{
  "chapter": "النمل",
  "text": "ان هذا القرءان يقص على بنى اسرءيل اكثر الذى هم فيه يختلفون",
  "translations": [
    {
      "translation": "Certainly this Qur'an narrates to the tribe of Israel most of the things about which they differ.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed this Qur'an explains to the children of Israel much of what they are at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this Qur'an explains to the Children of Israel most of the matters concerning which they have disagreements\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran tells the Israelites most of the matters about which they had disputes among themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed this Qur’an narrates to the Descendants of Israel most of the matters in which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this Qur'an narrates to the Children of Israel most of that in which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this Quran declares to the children of Israel most of what they differ in.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this Koran relates to the Children of Israel most of that concerning which they are at variance;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! this Qur'an narrateth unto the Children of Israel most of that concerning which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran explains to the children of Israel much of what they differ over,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this Qur'an recounteth with truth unto the Children of Isra'il much of that wherein they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran recounts for the Children of Israel most of what they differ about,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this Qur'an doth explain to the Children of Israel most of the matters in which they disagree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this Quran narrates to the Children of Israel most of that about which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, this Koran relates to the Children of Israel most of that which they are at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran relates to the Children of Israel most of what they differ about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, this Qur'an relates to the Children of Israel most of that over which they disagree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:76] Truly this Qur’ān recounts to the Children of Israel — those living at the time of our Prophet — [the means to resolve] most of that concerning which they differ, that is, by virtue of the fact that it expounds the said [differences] as they should be, eliminating any disagreements between them, if only they were to implement it and submit [to its prescriptions].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! this Qur'an) which you recite to them, Muhammad, (narrateth unto the Children of Israel) explains to Jews and Christians (most of that concerning which they differ) most of that which they oppose concerning Religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومما يدل عليه، وعلى حيطة حضرة علمه الكتب الإلهية النازلة من عنده سبحانه المنتخبة من حضرة علمه ولوح قضائه، سيما القرآن { إِنَّ هَـٰذَا ٱلْقُرْآنَ } من كمال جمعيته وإحاطته { يَقُصُّ } أي: يظهر ويبين { عَلَىٰ } علماء { بَنِيۤ إِسْرَائِيلَ أَكْثَرَ } الامور والشأن { ٱلَّذِي هُمْ فِيهِ يَخْتَلِفُونَ } [النمل: 76] من الأمور المتعلقة لدينهم وملتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { إِنَّ هذا القرآن يَقُصُّ على بني إسرائيل } يُبين لهم { أكثرَ الذي هم فيه يختلفون } من أمر الدين الذي اشتبه عليهم\n ومن جملة ما اختلفوا فيه: المسيح، وتحزّبوا فيه أحزاباً، وركبوا متن العند والغلو في الإفراط والتفريط، ووقع بينهم المناكرة في أشياء، حتى لعن بعضُهم بعضاً\n وقد نزل القرآن ببيان ما اختلفوا فيه، لو أنصفوا وأخذوا به، وأسلموا\n يريد اليهود والنصارى، وإن كانت الآية خاصة باليهود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:3",
      "similarity": 0.5254499610765929
    },
    {
      "verse": "3:62",
      "similarity": 0.5168645104150664
    },
    {
      "verse": "7:7",
      "similarity": 0.4743653732575132
    },
    {
      "verse": "4:164",
      "similarity": 0.453626882595236
    },
    {
      "verse": "26:17",
      "similarity": 0.4258308930392656
    }
  ]
}