{
  "chapter": "النمل",
  "text": "فلما جاءها نودى انۢ بورك من فى النار ومن حولها وسبحن الله رب العلمين",
  "translations": [
    {
      "translation": "But when he reached it, a voice called out to him, 'Blessed be Him who is in the Fire and all who are around it. Glory be to Allah, the Lord of all the worlds!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he reached it, a voice called out: \"Blessed is He who is in the fire and all around it. Praised be God, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when Moses came to the fire, a call was sounded: \"Blessed is He Who is in the fire and whatever is around it. Glory be to Allah, the Sustainer of all in the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he approached the fire, he was told, \"Blessed is the one in the fire and those around it. All glory belongs to God, the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he reached it, it was proclaimed, “Blessed is he who is in the location of the fire (Moosa) and those who are close to it (the angels); and Purity is to Allah, the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to it, he was called: \"Blessed is whosoever is in the fire, and whosoever is round about it! And glorified be Allah, the Lord of all that exists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he came to it a voice was uttered saying: Blessed is Whoever is in the fire and whatever is about it; and glory be to Allah, the Lord of the worlds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when he came to it, he was called: 'Blessed is he who is in the fire, and he who is about it. Glory be to God, the Lord of all Being!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he reached it, he was called, saying: Blessed is Whosoever is in the fire and Whosoever is round about it! And Glorified be Allah, the Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came up to it, a voice called out, \"Blessed be whoever is near this fire, and whoever is around it! Glory be to God, Lord of the Universe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he came unto it, he was cried unto Thus; Blest is whosoever is in the fire and whosoever is around it; and hallowed be Allah, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came to it, he was called: ‘Blessed is He who is in the fire and who is [as well] around it, and immaculate is Allah, the Lord of all the worlds!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to the (fire), a voice was heard: \"Blessed are those in the fire and those around: and glory to Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to it, he was called: \"Blessed is whosoever is in the fire, and whosoever is round about it! And glorified be Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came near it he was called: 'Blessed be who is (Moses) in the fire and (the angels) who are around it! Exaltations to Allah, Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he reached it, he was called: “Blessed is He who is within the fire, and He who is around it, and glorified be God, Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to it, he was called, \"Blessed is whoever is at the fire and whoever is around it. And exalted is Allah, Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:8] But when he reached it, he was called [with the following words]: ‘Blessed is he, that is to say, God bless him, who is in the fire, namely, Moses, and who is around it, namely, the angels — or vice-versa ([the verb] bāraka may be followed immediately by the direct object or by a preposition and then the direct object; [a noun such as] makān, ‘location’, is implied after fī, ‘in’, [sc. man fī makāni’l-nār, ‘who is in the area of the fire’]); and Glory be to God, the Lord of the Worlds — this is included in the call, and is meant to declare that God is above all evil [associations].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَلَمَّا جَاءَهَا نُودِيَ أَنْ بُورِكَ مَنْ فِي النَّارِ وَمَنْ حَوْلَهَا وَسُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ (8) أُنث ضمير { جاءها } جرياً على ما تقدم من تسمية النور ناراً بحسب ما لاح لموسى . وتقدم ذكر هذه القصة في سورة طه ، فبنا أن نتعرض هنا لما انفردت به هذه الآيات من المفردات والتراكيب ، فقوله : { أن بورك من في النار ومن حولها } هو بعض ما اقتضاه قوله في طه ( 12 ) : { فاخلع نعليك إنك بالواد المقدس طُوى } لأن معنى بورك قُدّس وزُكِّيَ .وفعل ( بارك ) يستعمل متعدياً ، يقال : باركك الله ، أي جعل لك بركة وتقدم بيان معنى البركة في قوله تعالى : { للَّذِي بِبَكَّة مباركاً } في آل عمران ( 96 ) ، وقوله { وبركاتتٍ عليك وعلى أمم ممّن معك } في سورة هود ( 48 ) . و ( أن ) تفسيرية لفعل { نُودِيَ } لأن فيه معنى القول دون حروفه ، أي نودي بهذا الكلام .و { مَن في النار } مراد به موسى فإنه لما حل في موضع النور صار محيطاً به فتلك الإحاطة تشبه إحاطة الظرف بالمظروف ، فعبر عنه ب { مَن في النار } وهو نفسه .والعدول عن ذِكره بضمير الخِطاب كما هو مقتضى الظاهر ، أو باسمه العلم إن أريد العدول عن مقتضى الظاهر ، لأن في معنى صلة الموصول إيناساً له وتلطفاً كقول النبي صلى الله عليه وسلم لعليّ «قُم أبَا تراب» وكثيرٌ التلطف بذكر بعض ما التبس به المتلطَّف به من أحواله . وهذا الكلام خبر هو بشارة لموسى عليه السلام ببركة النبوءة .ومَن حَوْل النار : هو جبريل الذي أرسل إليه بما نودي به والملائكة الذين وكل إليهم إنارة المكان وتقديسُه إن كان النداء بغير واسطة جبريل بل كان من لدن الله تعالى . فهذا التبريك تبريك ذوات لا تبريك مكان بدليل ذكر { مَن } الموصولة في الموضعين ، وهو تبريك الاصطفاء الإلهي بالكرامة . وقيل إن قوله { أن بورك من في النار } إنشاء تحية من الله تعالى إلى موسى عليه السلام كما كانت تحية الملائكة لإبراهيم { رحمتُ الله وبركاته عليكم أهل البيت } \\[ هود : 73 \\] أي أهل هذا البيت الذي نحن فيه .و { سبحان الله رب العالمين } عطف على ما نودي به موسى على صريح معناه إخباراً بتنزيه الله تعالى عما لا يليق بإلهيته من أحوال المحدثات ليعلم موسى أمرين : أحدهما أن النداء وحي من الله تعالى ، والثاني أن الله منزه عما عسى أن يخطر بالبال أن جلالته في ذلك المكان . ويجوز أن يكون { سبحان الله } مستعملاً للتعجيب من ذلك المشهد وأنه أمر عظيم من أمر الله تعالى وعنايته يقتضي تذكُّر تنزيهه وتقديسه .وفي حذف متعلق التنزيه إيذان بالعموم المناسب لمصدر التنزيه وهو عموم الأشياء التي لا يليق إثباتها لله تعالى وإنما يُعلم تفصيلها بالأدلة العقلية والشرعية .فالمعنى : ونَزِّه الله تنزيهاً عن كل ما لا يليق به ، ومن أول تلك الأشياء تنزيهه عن أن يكون حالاً في ذلك المكان .وإرداف اسم الجلالة بوصف { رب العالمين } فيه معنى التعليل للتنزيه عن شؤون المحدثات لأنه رب العالمين فلا يشبه شأنه تعالى شؤونهم .وضمير { إنه } ضمير الشأن\n\n",
      "translations": [
        {
          "translation": "(But when he reached it, he was called, saying: Blessed is whosoever is in the Fire) blessed is the Fire (and whosoever is round about it) of angels! This is the reading of Ubayy and 'Abdullah Ibn Mas'ud; it is also said that this means: blessed is He Who lightened this light; and it also said that this means: blessed is he who is seeking, i.e. Moses and whoever is around him of angels, (And glorified be Allah) He exonerated Himself, (the Lord of the Worlds!) the Master of the jinn and human beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فذهب موسى { فَلَمَّا جَآءَهَا } أي: النار\n ووصل عندها { نُودِيَ } من وراء سرادقات العز والجلال تكريماً لموسى\n وتعظيماً له\n وتنبيهاً عليه من أن مرجع جميع مقاصدك وحوائجك هو الحق\n فاطلبه حتى تجد عنده جميع مقاصدك { أَن بُورِكَ } أي: الشأن\n إنه أكثر عليك خيرك وبركاتك يا موسى { مَن فِي ٱلنَّارِ وَمَنْ } ظهر { حَوْلَهَا } إذ هو محيط بجميع الأماكن\n ظاهر منها\n غير متمكن فيها\n أي: من ظهر فيها ولاح عليها\n\n\n{ وَ } بعدما تحققت بشهود الحق مع جميع الأماكن والأشياء\n نزهه عن الحلول فيها والإتحاد بها\n فقل: { سُبْحَانَ ٱللَّهِ } المنزه عن الأماكن كلها\n المتجلي في جميعها\n لكونه { رَبِّ ٱلْعَالَمِينَ } [النمل: 8] يربيها بدوام التجلي\n وامتداد الأظلال والعكوس الفائضة منه سبحانه عليها\n\n\nثمَّ لمَّا قلق موسى واستوحش عن هذا النداء\n وقرب إلى أن صار مغشياً عليه من شدة هوله ودهشته\n وكمال ولهه وحيرته\n نودي ثانياً باسمه استئناساً له",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: الأمر والشأن { بُورِكَ } أي: قدّس\n أو: جعل فيه البركة والخير\n { مَن في النار ومَنْ حولها } أي: من في مكان النار\n وهم الملائكة\n { ومَنْ حولها } أي: موسى عليه السلام\n بإنزال الوحي عليه\n الذي فيه خير الدنيا والآخرة\n وقال ابن عباس والحسن: بورك من في النار أي: قُدِّس من في النار\n وهو الله تعالى أي: نوره وسره\n الذي قامت به الأشياء\n من باب قيام المعاني بالأواني\n أو: من قيام أسرار الذات بالأشياء\n بمعنى أنه نادى موسى منها وسمع كلامه من جهتها\n ثم نزّه - سبحانه - ذاته المقدسة عن الحلول والاتحاد\n فقال: { وسبحان اللهِ } أي: تنزيهاً له عن الحلول في شيء\n وهو { ربّ العالمين }\n ثم فسر نداءه\n فقال: { يا موسى إنه } أي: الأمر والشأن { أنا الله العزيزُ الحكيم } أو: إنه\n أي: مكلمك\n الله العزيز الحكيم\n وهو تمهيد لِما أراد أن يظهر على يديه من المعجزات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:92",
      "similarity": 0.47179817534478524
    },
    {
      "verse": "26:25",
      "similarity": 0.4599100727392177
    },
    {
      "verse": "18:108",
      "similarity": 0.42476336518127866
    },
    {
      "verse": "23:29",
      "similarity": 0.390616026309065
    },
    {
      "verse": "26:34",
      "similarity": 0.3897453918242886
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}