{
  "chapter": "النمل",
  "text": "ويوم نحشر من كل امة فوجا ممن يكذب بـايتنا فهم يوزعون",
  "translations": [
    {
      "translation": "The day We shall gather from every community a section of those who denied Our signs, and they will be brought (in separate groups),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just imagine the Day when We shall muster from every nation a large group of those who gave the lie to Our Signs, and they shall be duly arranged in ranks\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We resurrect from every nation a group from among those who had rejected Our revelations, they will be kept confined in ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when We will raise from every nation an army that denies Our signs – so the former groups will be held back for the latter to join them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when We shall gather out of every nation a Fawj of those who denied Our Ayat, and they shall be driven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We will gather from every nation a party from among those who rejected Our communications, then they shall be formed into groups.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when We shall muster out of every nation a troop of those that cried lies to Our signs, duly disposed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remind them of) the Day when We shall gather out of every nation a host of those who denied Our revelations, and they will be set in array;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day We shall assemble together a host from every community of those who cried lies to Our revelations and they will be grouped\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remind them of the Day whereon We shall Rather from every community a troop of those who belied Our signs, and they shall be held in order.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day We shall resurrect from every nation a group of those who denied Our signs, and they will be held in check.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day We shall gather together from every people a troop of those who reject our Signs, and they shall be kept in ranks,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when We shall gather out of every nation a troop of those who denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and (then) they (all) shall be gathered (and driven to the place of reckoning),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day We shall gather a crowd from every nation of those who belied Our verses, so they are gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We gather from every community a group of those who rejected Our revelations; and they will be restrained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [warn of] the Day when We will gather from every nation a company of those who deny Our signs, and they will be [driven] in rows\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:83]   And, mention, the day when We shall gather from every community a group of those who denied Our signs, namely, their leaders, the ones [whom they] followed, and they will be set in array, assembled, with the last of them brought together with the first and then led away,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remind them of) the Day) which is the Day of Judgement (when We shall gather out of every nation) from the adherents of every religion (a host) a group (of those who denied Our revelations) Our Book and Messenger, (and they will be set in array) they will be stopped from the first to the last, one after the other;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَوْمَ نَحْشُرُ مِن كُلِّ أُمَّةٍ فَوْجاً } معناه جَماعة\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَوْمَ } اذكر يا أكمل الرسل { نَحْشُرُ } ونسوق عند قيام الساعة { مِن كُلِّ أُمَّةٍ فَوْجاً } فرقة وجماعة هي صناديدهم ورؤساؤهم { مِّمَّن يُكَذِّبُ بِآيَاتِنَا } التي جاء بها رسلنا؛ لإهدائهم وإرشادهم { فَهُمْ } في حين حشرهم وسوقهم { يُوزَعُونَ } [النمل: 83] أي: يحبس أولهم لآخرهم؛ حتى يتلاقوا ويزدحموا، ويساقون أولئك المجرمون هكذا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" ماذا \" تأتي على أوجه أحَدُها: أن تكون \" ما \": استفهاماً، و \" ذا \": إشارة نحو: ماذا التواني\n الثاني: أن تكون \" ما \": استفهاماً، و \" ذا \": موصولة، كقول لبيد:\n\nالثالث: \" ماذا \" كله: استفهام على التركيب، كقولك: لماذا جئت؟\n الرابع: أن تكون \" ماذا \" كله: اسم جنس بمعنى شيء أو: بمعنى \" الذي \" كقوله: دعني ماذا علمت؟، وتكون \" ذا \" زائدة\n انظر القاموس\n يقول الحق جل جلاله: { و } اذكر { يوم نحشُرُ من كل إمةٍ فوجاً } ، الفوج، الجماعة الكثيرة\n و \" مِنْ \": للتبعيض، أي: واذكر يوم نجمع من كل أمة من أمم الأنبياء جماعة كثيرة { ممن يُكَذِبُ بآياتنا } ، \" مِن \": لبيان الفوج، أي: فوجاً مكذبين بآياتنا، المنزلة على أنبيائنا، { فهم يُوزَعُون }: يُحبس أولهم على آخرهم، حتى يجتمعوا، حين يُساقون إلى موضع الحساب\n وهذه عبارة عن كثرة العدد، وتباعد أطرافهم، والمراد بهذا الحشر: الحشر للعذاب، والتوبيخ والمناقشة، بعد الحشر الكلي، الشامل لكافة الخلق\n وعن ابن عباس: المراد بهذا الفوج: أبو جهل، والوليد بن المغيرة، وشيبة بن ربيعة، يُساقون بين يدي أهل مكة وهكذا يُحشر قادة سائر الأمم بين أيديهم إلى النار",
      "translations": []
    }
  ]
}