{
  "chapter": "النمل",
  "text": "حتى اذا جاءو قال اكذبتم بـايتى ولم تحيطوا۟ بها علما اماذا كنتم تعملون",
  "translations": [
    {
      "translation": "Then when they arrive He will say, 'Did you deny My Signs even though you did not have proper knowledge of them. What were you doing?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that when they come (before the Lord) He will say: \"Did you deny My signs without having understood them? Or what was it that you were doing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until, when all of them have arrived, Allah will say: \"Did you give the lie to My Signs even without encompassing them with your knowledge? If that is not so, what did you do?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they will be brought into the presence of God, He will ask them, \"Did you reject My revelations without fully understanding them. What did you know about them if you had any knowledge at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they all come together, He will say, “Did you deny My signs whereas your knowledge had not reached it, or what were the deeds you were doing?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they come, He will say: \"Did you deny My Ayat whereas you comprehended them not by knowledge, or what was it that you used to do\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they come, He will say: Did you reject My communications while you had no comprehensive knowledge of them? Or what was it that you did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "till, when they are come, He shall say, 'Did you cry lies to My signs, not comprehending them in knowledge, or what have you been doing?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they come (before their Lord), He will say: Did ye deny My revelations when ye could not compass them in knowledge, or what was it that ye did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then, when they have arrived, He will say, \"Did you deny My revelations, even though you did not have proper knowledge of them? Or what was it that you were doing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they shall have come, He Shall say: belied ye My signs when ye encompassed them not in Your knowledge; nay, what else was it that ye have been working?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they come, He will say, ‘Did you deny My signs without comprehending them in knowledge? What was it that you used to do?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they come (before the Judgment-seat), (Allah) will say: \"Did ye reject My Signs, though ye comprehended them not in knowledge, or what was it ye did?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they come (before their Lord at the place of reckoning), He will say: \"Did you deny My Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) when you comprehended them not in knowledge, or what (else) was it that you used to do?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they have come, He will say: 'Did you belie My verses, although you knew nothing, or what was it you were doing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they arrive, He will say, “Did you reject My revelations without comprehending them? Or what is it you were doing?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they arrive [at the place of Judgement], He will say, \"Did you deny My signs while you encompassed them not in knowledge, or what [was it that] you were doing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:84] until, when they arrive, at the site of the Reckoning, He, exalted be He, shall say, to them: ‘Did you deny, My prophets, by [denying], My signs without comprehending them, from the perspective of your denial, in knowledge, or what (ammā: the interrogative mā has been assimilated with am, ‘or’) was it (dhā is a relative pronoun, in other words [it is in fact] mā alladhī) that you did?, with the commands given to you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till, when they come (before their Lord)) gathered all together, (He will say) Allah will say to them: (Did ye deny My revelations) My Book and Messenger (when ye could not compass them in knowledge) He says: you denied them while you knew not that they did not come from Me, (or what was it that ye did) in your 434 disbelief and idolatry?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا جَآءُو } المحشر وحضروا الموعد، وعُرضوا على الله صافين صاغرين { قَالَ } قائل من قبل سرادقات العظمة والجلال معيداً عليهم: { أَكَذَّبْتُم } أنتم أيها المسرفون { بِآيَاتِي } في بادي الرأي بلا تأمل وتدبر فيها { وَلَمْ تُحِيطُواْ بِهَا عِلْماً } أي: لم تطرحوا نظركم وعقولكم عن فحض معانيها وفحاويها؛ حتى ظهر عندكم ولاح عليكم هل هي جديرة بالرد والإنكار؟ أم حقيق بالقبول والاعتبار؟ فبادرتم إلى تكذيبها بلا إمعانٍ فيها { أَمَّا ذَا } أي: أم أي شيء شنيع { } كُنتُمْ تَعْمَلُونَ [النمل: 84] أيها الجاهلون المسرفون؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { حتى إِذا جاؤوا } إلى موقف السؤال والجواب، والمناقشة والحساب، { قال } أي: الله عز وجل، موبخاً لهم على التكذيب: { أَكَذَّبتم بآياتي } المنزلة على رسلي، الناطقة بلقاء يومكم، { و } الحال أنكم { لم تُحيطوا بها علماً } أي: أكذبتم بها في بادئ الرأي، من غير فكر، ولا نظر، يؤدي إلى إحاطة العلم بكنهها، وأنها حقيقة بالتصديق حتماً\n وهذا نص في أن المراد بالآيات في الموضعين هي الآيات القرآنية\n وقيل: هو عطف على \" كذبتم \" ، أي: أجمعتم بين التكذيب وعدم التدبر فيها\n { أم ماذا كنتم تعملون }؟ حيث لم تتفكروا فيها، فإنكم لم تُخلقوا عبثاً\n أو: أيُّ شيء كنتم تعملون، استفهام، على معنى استبعاد الحجج، أي: إن كانت لكم حجة وعمل فهاتوا ذلك\n وخطابهم بهذا تبكيت لهم",
      "translations": []
    }
  ]
}