{
  "chapter": "النمل",
  "text": "واذا وقع القول عليهم اخرجنا لهم دابة من الارض تكلمهم ان الناس كانوا۟ بـايتنا لا يوقنون",
  "translations": [
    {
      "translation": "When the sentence will have been passed against them, We shall bring forth beastly brutes from the earth who will torment them, for men certainly do not believe Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the time for the fulfilment of Our Word against them will come, We shall bring forth for them a beast from the earth who will speak to them because people did not believe in Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the word about them comes true We shall make a creature appear to them on earth who will tell them that people had no faith in Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Word (promise) appears upon them, We shall bring forth for them a beast from the earth to speak to them – because the people were not accepting faith in Our signs. (This beast will rise from the earth, when the Last Day draws near.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Word is fulfilled against them, We shall bring out from the earth a beast for them, to speak to them because mankind believed not with certainty in Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the word shall come to pass against them, We shall bring forth for them a creature from the earth that shall wound them, because people did not believe in Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Word falls on them, We shall bring forth for them out of the earth a beast that shall speak unto them: 'Mankind had no faith in Our signs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the word is fulfilled concerning them, We shall bring forth a beast of the earth to speak unto them because mankind had not faith in Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God's word is justly carried out against them, We will produce a dabbah from the earth which will tell them that mankind had no real faith in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the word shall come to be fulfilled concerning them, We shall bring forth a beast of the earth speaking unto them, that the people have not of Our signs been convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the word [of judgement] falls upon them, We shall bring out for them an Animal from the earth who shall tell them that the people had no faith in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Word is fulfilled against them (the unjust), we shall produce from the earth a beast to (face) them: He will speak to them, for that mankind did not believe with assurance in Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Word (of torment) is fulfilled against them, We shall bring out from the earth a beast to them, which will speak to them because mankind believed not with certainty in Our Ayat (Verses of the Quran and Prophet Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Word falls on them, We will bring out from the earth a beast that shall speak to them: 'Indeed the people were not certain of Our verses.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Word has fallen on them, We will bring out for them from the earth a creature which will say to them that the people are uncertain of Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the word befalls them, We will bring forth for them a creature from the earth speaking to them, [saying] that the people were, of Our verses, not certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:82] And when the word [of judgement] falls upon them, [when] they deserve that chastisement befalls them as well as all [other] disbelievers, We shall bring forth for them a beast from the earth which shall speak to them [saying], that is, which shall speak in Arabic to those who are alive at the time when it appears, among its other statements, it will say to them on Our behalf: ‘Indeed mankind (read tukallimuhum inna’lnāsa; a variant has tukallimuhum bi-anna’l-nāsa, ‘to tell them that mankind’) had no faith in Our signs’, in other words, they did not believe in the Qur’ān and what it comprises [of the mention] of resurrection, reckoning and requital. With its [the beast’s] appearance the enjoining of decency and forbidding of indecency will cease, and thereafter no disbeliever will believe — just as God revealed to Noah [when He said to him]: None of your people will believe except he who has already believed [Q. 11:36].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when the word) bringing curse and torment upon them (is fulfilled concerning them, We shall bring forth a beast of the earth) between the Safa and al-Marwah, and this is the staff of Moses; it is also said that this beast will come with the staff of Moses (to speak unto them because mankind had not faith) they did not believe (in Our revelations) i.e. in Muhammad (pbuh) and the Qur'an; and it is also said that this means: they did not believe in the advent of the beast.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اصبر يا أكمل الرسل { إِذَا وَقَعَ ٱلْقَوْلُ } الموعود { عَلَيْهِم } ولاح أمارات الساعة وظهر علامات القيامة، ودنا وقت قيامها { أَخْرَجْنَا لَهُمْ } قبيل قيام الساعة { دَآبَّةً } عظيمة { مِّنَ ٱلأَرْضِ } لتكون أمارة على قيامها، دالة على كمال قدرتنا على إحياء الأموات من العظام الرفات، طولها سبعون ذراعاً، ولها قوائم وزغب؛ أي: شعرات صفر كريش الفرخ، وريش وجناحان، يقال لها: الجساسة، لا يفوتها هارب ولا يدركها طالب\n\n\n\n\nسُئل عليه السلام عن مخرجها فقال:\n\n \" من أعظم المساجد حرمة على الله تعالى \" \n\nيعني: المسجد الحرام\n\n\n\n\nفإذا خرجت عليهم { تُكَلِّمُهُمْ } وتخاطب معهم بسوء فعالهم وحسن خصالهم فتفرق المؤمن من الكافر، وحينئذٍ ظهر { أَنَّ ٱلنَّاسَ } المنهمكين في بحر الغفلة والنيسان لأي شيء { كَانُوا بِآيَاتِنَا } الواصلة إليهم من ألسنة رسلنا { لاَ يُوقِنُونَ } [النمل: 82] ولا يذعنون، بل ينكرون ويكذبون عناداً أو مكابرةً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وإذا وقع القولُ عليهم } أي: وقع مصداق القول الناطق بمجيء الساعة، بأن قَرُب إتيانها، وظهرت أشراطها، فأراد بالوقوع: دنوه واقترابه، كقوله:\n\n[النحل: 1] رُوي أن ذلك حين ينقطع الخير، ولا يُؤمر بمعروف ولا يُنهى عن منكر، ولا يبقى منيب ولا تائب\n و \" وقع \": عبارة عن الثبوت واللزوم، وهذا بمنزلة:\n\n[الزمر: 19] أي: وإذا انتجز وعد عذابهم التي تضمنه القول الأزلي، وأراد أن ينفذ في الكافرين سابق علمه لهم من العذاب، أخرج لهم دابة من الأرض\n وفي الحديث:\n\n \" إن الدابة، وطلوع الشمس من المغرب، من أول الأشراط \"\n \n\nفلا ينبغي لهؤلاء الكفرة ترك الإيمان حيث ينفعهم، ويتطلبون وقوع الساعة الموعود بها، التي لا ينفع الإيمان لمن لم يكن آمن، مع ظهور مقدماتها، فضلاً عنها\n فإذا وقع الوعد وَسَمَت الدابة مَن لم يؤمن بِسمة الكفر، وكان ذلك طبعاً وختماً، فلا يقبل منه إيمان، ويقال له: أيها الكافر لم تؤمن بالآيات غيباً، فلا يقبل منك بعد رؤيتها عيناً وهذا معنى قوله: { أخرجنا لهم دابةً من الأرض } ، وهي الجساسة، طولها ستون ذراعاً، لا يدركها طالبٌ، ولا يفوتها هاربٌ، لها أربع قوائم، وزغب، وريش، وجناحان\n وقيل: لها رأس ثور، وعين خنزير، وأذن فيل، وقرن أيّل، وعنق نعامة، وصدر أسد، ولون نمر، وخاصرة هرّة، وذنب كبش، وخف بعير، وما بين المفصلين اثنا عشر ذراعاً، تخرج من الصفا فتكلّمهم بالعربية فتقول { أن الناس كانوا بآياتنا لا يوقنون } أي: بخروجي لأن خروجها من الآيات، وتقول: ألا لعنة الله على الظالمين\n وفي حديث حذيفة رضي الله عنه: \" تأتي الدابة المؤمن، فتُسلم عليه، وتأتي الكافر فتخطه - أي تسمه - في وجهه \"\n وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال:\n\n \" تَخْرُجُ الدَّابةُ مَعها خاتمُ سُليمانَ، وعَصا مُوسى، فتَجْلُو وَجْهَ المُؤمِن، وَتَخْتُم أنْفَ الكافِر بالخاتَم ختَّى أَنَّ أَهْلَ الحِواء مجْتَمِعُون فيقول: هاها يا مُؤمْن ويقول: هاها يا كافِرُ \" \n\nوهي بعد نزول عيسى وطلوع الشمس من مغربها\n والله تعالى أعلم\n الإشارة: وإذا وقع القول على قوم بإسدال الحجاب، وإدامة غلق الباب، أخرج لهم جاهل بالله، يكلمهم بادعاء التربية، فيأخذون عنه، ويقتدون به\n قال في المباحث:\n",
      "translations": []
    }
  ]
}