{
  "chapter": "النمل",
  "text": "الم يروا۟ انا جعلنا اليل ليسكنوا۟ فيه والنهار مبصرا ان فى ذلك لءايت لقوم يؤمنون",
  "translations": [
    {
      "translation": "Do they not see that We have made the night for them to rest in and the day for seeing? There are certainly Signs in that for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We made the night for them to rest, the day to make things clear? Indeed there are signs in this for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not perceive that We had made the night so that they may repose in it and made the day clear and shining. Surely there are Signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We have created the night for them to rest and the day for them to see. In this there is evidence for the believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not see that We created the night for them to rest in, and created the day providing sight? Indeed in this are signs for the people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that We have made the night for them to rest therein, and the day sight-giving Verily, in this are Ayat for the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider that We have made the night that. they may rest therein, and the day to give light? Most surely there are signs in this for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We made the night for them, to repose in it, and the day, to see? Surely in that is a sign for a people who are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We have appointed the night that they may rest therein, and the day sight-giving? Lo! therein verily are portents for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We have made the night for them to rest in and the day to give them light? There are certainly signs in that for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe they not that We have appointed the night that they may repose therein, and the day sight-giving? Verily herein are signs unto a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We made the night that they may rest in it, and the day to provide visibility. There are indeed signs in that for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that We have made the Night for them to rest in and the Day to give them light? Verily in this are Signs for any people that believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that We have made the night for them to rest therein, and the day sight-giving? Verily, in this are Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We have made the night for them to rest in and the day to see? Surely, there are signs in this for the nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We made the night for them to rest therein, and the day for visibility? Surely in that are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We made the night that they may rest therein and the day giving sight? Indeed in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:86] Do they not see that We made, We created, the night that they, like others, may rest in it, and the day for sight?, meaning, [for people] to see in it, so that they may go about their business therein. Surely in that there are signs, indications of His power, exalted be He, for a people who believe — they [the believers] are singled out for mention because they benefit from such [signs] in their faith, in contrast to the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَلَمْ يَرَوْا أَنَّا جَعَلْنَا اللَّيْلَ لِيَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا إِنَّ فِي ذَلِكَ لَآَيَاتٍ لِقَوْمٍ يُؤْمِنُونَ (86)هذا الكلام متصل بقوله { ووقع القول عليهم بما ظلموا } \\[ النمل : 85 \\] أي بما أشركوا ، فذكرهم بدلائل الوحدانية بذكر أظهر الآيات وأكثرها تكراراً على حواسهم وأجدرها بأن تكون مقنعة في ارعوائهم عن شركهم . وهي آية ملازمة لهم طول حياتهم تخطر ببالهم مرتين كل يوم على الأقل . وتلك هي آية اختلاف الليل والنهار الدالة على انفراده تعالى بالتصرف في هذا العالم؛ فأصنامهم تخضع لمفعولها فتظلم ذواتهم في الليل وتنير في النهار ، وفيها تذكير بتمثيل الموت والحياة بعده بسكون الليل وانبثاق النهار عقبه .والجملة معترضة بين جملة { ووقع القول عليهم } \\[ النمل : 85 \\] وجملة { ويوم ينفخ في الصور } \\[ النمل : 87 \\] ليتخلل الوعيد بالاستدلال فتكون الدعوة إلى الحق بالإرهاب تارة واستدعاء النظر تارة أخرى .والاستفهام مستعمل كناية عن التعجيب من حالهم لأنها لغرابتها تستلزم سؤال من يسأل عن عدم رؤيتهم فهذه علاقة أو مسوغ استعمال الاستفهام في التعجيب ، وهي علاقة خفية أشار سعد الدين في «المطول» إلى عدم ظهورها وتصدى السيد الشريف إلى بيانها غاية البيان وأرجعها إلى المجاز المرسل فتأمله .والرؤية يجوز أن تكون قلبية وجملة { أنّا جعلنا } سادة مسد المفعولين ، أي كيف لم يعلموا أنا جعلنا الليل ليسكنوا فيه والنهار مبصراً مع أن ذلك واضح الدلالة على هذا الجعل . واختير من أفعال العلم فعل الرؤية لشبه هذا العلم بالمعلومات المبصرة .ويجوز أن تكون الرؤية بصرية والمصدر المنسبك من الجملة مفعول الرؤية والمعنى : كيف لم يبصروا جعل الليل للسكون والنهار للإبصار مع أن ذلك بمرأى من أبصارهم . والجعل مراد منه أثره وهو اضطرار الناس إلى السكون في الليل وإلى الانتشار في النهار . فجعلت رؤية أثر الجعل بمنزلة رؤية ذلك الجعل وهذا واسع في العربية أن يجعل الأثر محل المؤثر ، والدال محل المدلول . قال النابغة :وقد خفت حتى ما تزيد مخافتي ... على وعل في ذي المطارة عاقلأي على مخافة وعل .والمبصر : اسم فاعل أبصر بمعنى رأى . ووصف النهار بأنه مبصر من قبيل المجاز العقلي لأن نور النهار سبب الإبصار . ويجوز أن تكون الهمزة للتعدية من أبصره ، إذا جعله باصراً .وجملة { إن في ذلك لآيات } تعليل للتعجيب من حالهم إذ لم يستدلوا باختلاف الليل والنهار على الوحدانية ولا على البعث .ووجه كون الآيات في ذلك كثيرة كما اقتضاه الجمع هو أن في نظام الليل آيات على الانفراد بخلق الشمس وخلق نورها الخارق للظلمات ، وخلق الأرض ، وخلق نظام دورانها اليومي تجاه أشعة الشمس وهي الدورة التي تكوّن الليل والنهار ، وفي خلق طبع الإنسان بأن يتلقّى الظلمة بطلب السكون لما يعتري الأعصاب من الفتور دون بعض الدواب التي تنشط في الليل كالهوام والخفافيش وفي ذلك أيضاً دلالة على تعاقب الموت والحياة ، فتلك آيات وفي كل آية منها دقائق ونظم عظيمة لو بسط القول فيها لأوعب مجلدات من العلوم .وفي جعل النهار مبصراً آيات كثيرة على الوحدانية ودقة صنع تقابل ما تقدم في آيات جعل الليل سكناً . وفيه دلالة على أن لا إحالة ولا استبعاد في البعث بعد الموت ، وأنه نظير بعث اليقظة بعد النوم ، وفي جليل تلك الآيات ودقيقها عدة آيات فهذا وجه جعل ذلك آيات ولم يجعل آيتين .ومعنى { لقوم يؤمنون } لناس شأنهم الإيمان والاعترف بالحجة ولذلك جعل الإيمان صفة جارية على { قوم } لما قلناه غير مرة من أن إناطة الحكم بلفظ ( قوم ) يومىء إلى أن ذلك الحكم متمكن منهم حتى كأنه من مقومات قوميتهم ومنه قوله تعالى { ويحلفون بالله إنهم لمنكم وما هم منكم ولكنهم قوم يفرقون } \\[ التوبة : 56 \\] ، أي الفرق من مقومات قوميتهم فكيف يكونون منكم وأنتم لا تفرقون ، أي في ذلك آيات لمن من شعارهم التدبر والاتصاف ، أي فهؤلاء ليسوا بتلك المثابة .ولكون الإيمان مقصوداً به أنه مرجو منهم جيء فيه بصيغة المضارع إذ ليس المقصود أن في ذلك آيات للذين آمنوا لأن ذلك حاصل بالفحوى والأولوية ، فصار المعنى : أن في ذلك لآيات للمؤمنين ولمن يرجى منهم الإيمان عند النظر في الأدلة . وقريب من هذا المعنى قوله تعالى { إن هو إلا ذكر للعالمين لمن شاء منكم أن يستقيم } \\[ التكوير : 27 ، 28 \\] . ولهذا خولف بين ما هنا وبين ما في سورة يونس ( 67 ) إذ قال { هو الذي جعل لكم الليل لتسكنوا فيه والنهار مبصراً إن في ذلك لآيات لقوم يسمعون } لأن آية يونس مسوقة مساق الاستدلال والامتنان فخاطب بها جميع الناس من مؤمن وكافر فجاءت بصيغة الخطاب ، وجعلت دلالتها لكل من يسمع أدلة القرآن فمنهم مهتد وضال ولذلك جيء فيها بفعل { يسمعون } \\[ يونس : 67 \\] المؤذن بالامتثال والإقبال على طلب الهدى .وأما هذه الآية فمسوقة مساق التعجيب والتوبيخ فجعل ما فيها آيات لمن الإيمان من شأنهم ليفيد بمفهومه أنه لا تحصل منه دلالة لمن ليس من شأنهم الانصاف والاعتراف ولذلك أوثر فيه فعل { يؤمنون } .وجاء ما في الليل من الخصوصية بصيغة التعليل باللام بقوله { ليسكنوا فيه } ، وما في النهار بصيغة مفعول الجعل بقوله { مبصراً } تفنناً ، ولما يفيده { مبصراً } من المبالغة . والمعنى على التعليل والمفعول واحد في المآل . وبهذا قال في «الكشاف» «التقابل مراعى من حيث المعنى وهكذا النظم المطبوع غير المتكلف» أي ففي الآية احتباك إذ المعنى : جعلنا الليل مظلماً ليسكنوا فيه والنهار مبصراً لينتشروا فيه .واعلم أن ما قرر هنا يأتي في آية سورة يونس عدا ما هو من وجوه الفروق البلاغية فارجع إليها هنالك .\n\n",
      "translations": [
        {
          "translation": "(Have they not) the disbelievers of Mecca (seen how We have appointed the night that they may rest therein, and the day sight giving) and the day bright, so that they seek their livelihood? (Lo! Therein) in that which We have done to them (verily are portents) signs (for a people who believe) for people who have faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ يَرَوْاْ } ولم ينظروا أولئك الحمقى بنظر العبرة إلى مصنوعاتنا المتبدلة المتغيرة بقدرتنا واختيارنا\n ليتحقق عندهم أمر الساعة\n ولم يبادروا إلى إنكارها\n حتى لا يلحقهم ما لحقهم { أَنَّا } من كمال قدرتنا\n ووفور حولنا وقوتنا كيف { جَعَلْنَا ٱلْلَّيْلَ } مظلماً { لِيَسْكُنُواْ فِيهِ } بلا دغدغة منهم إلى الحركة والاشتغال { وَ } كيف جعلنا { ٱلنَّهَارَ مُبْصِراً } مضيئاً تتحركون وتترددون فيه يشغل معاشكم { إِنَّ فِي ذَلِكَ } الإظلام والإضاءة على التعاقب والتوالي { لآيَاتٍ } دلائل قاطعات\n وشواهد ساطعات على قدرة القديم القادر المقتدر على أمثال هذه المقدورات المتقنة\n والمصنوعات المحكمة الصادرة عن محض الحكمة { لِّقَوْمٍ يُؤْمِنُونَ } [النمل: 86] ويذعنون بوحدة ذات الله وكمال أوصافه وأسمائه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ والنهارَ مبصراً } أي: يُبصروا\n بما فيه من الإضاءة\n طرق التقلب في أمور المعاش\n وبولغ فيه\n حيث جعل الإبصار الذي هو حال الناس\n حالاً له\n ووصفاً من أوصافه\n بحيث لا ينفك عنها\n ولم يسلك في الليل هذا المسلك لأن تأثير ظلام الليل في السكون ليس بمثابة تأثير النهار في الإبصار\n قاله أبو السعود\n قلت: وقد جعله كذلك في قوله:\n[الأنعام: 96] فانظره\n { إنَّ في ذلك لآياتٍ } كثيرة { لقوم يؤمنون } يُصدِّقون\n فيعتبرون\n فإنَّ من تأمل في تعاقب الليل والنهار\n واختلافهما على وجوه بديعة\n مبنية على حِكَمٍ رائقة\n تحار في فهمها العقول\n وشاهد في الآفاق تبدل ظلمة الليل\n المحاكية للموت\n بضياء النهار\n المضاهي للحياة\n وعاين في نفسه غلبة النوم\n الذي هو يضاهي الموت\n وانتباهه منه\n الذي هو يضاهي البعث\n قضى بأن الساعة آتية لا ريب فيها\n وأن الله يبعث من في القبور\n قال لقمان لابنه: يا بُني إن كنت تشك في الموت فلا تنم\n فكما أنك تنام قهراً كذلك تموت\n وإن كنت تشك في البعث فلا تنتبه\n فكما أنك تنتبه بعد نومك كذلك تُبعث بعد موتك هـ\n وبالله التوفيق\n الإشارة: يوم نَحشر من كل أمة فوجاً يُنكر على أهل الخصوصية\n ممن يكذب بآياتنا\n وهم العارفون بنا\n الدالون علينا\n المعرِّفون بنا\n فهم يُوزعون: يُجمعون للعتاب\n حتى إذا جاؤوا إلينا بقلب سقيم\n قال: أكذَّبتم بأوليائي\n الدالين على حضرتي\n بعد التطهير والتهذيب\n ولم تُحيطوا بهم علماً\n منعكم من ذلك حب الرئاسة والجاه\n أم ماذا كنتم تعملون؟\n ووقع القول عليهم بالبقاء مع عامة أهل الحجاب\n فهم لا ينطقون\n ولا يجدون اعتذاراً يُقبل منهم\n ألم يعلموا أنهم يموتون على ما عاشوا عليه\n ويُبعثون على ما ماتوا عليه\n فهلاّ صحبوا أهل اليقين الكبير\n - وهو عين اليقين أو حق اليقين المستفاد من شهود الذات الأقدس - فيكتسبوا منهم اليقين\n حتى يموتوا على اليقين ويُبعثوا على اليقين\n وبالله التوفيق\n ثم ذكر النفخ في الصور\n وما يكون بعده من الأهوال\n فقال: { وَيَوْمَ يُنفَخُ فِي ٱلصُّورِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:67",
      "similarity": 0.857423306888886
    },
    {
      "verse": "6:13",
      "similarity": 0.6920401669749102
    },
    {
      "verse": "40:61",
      "similarity": 0.5944188287132213
    },
    {
      "verse": "28:73",
      "similarity": 0.5412742093600665
    },
    {
      "verse": "71:5",
      "similarity": 0.504800548068495
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027086.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027086.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:86.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}