{
  "chapter": "النمل",
  "text": "انك لا تسمع الموتى ولا تسمع الصم الدعاء اذا ولوا۟ مدبرين",
  "translations": [
    {
      "translation": "You will not make dead men hear and you will not make deaf men hear the call when they turn their backs in flight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead to listen, or the deaf to hear the call, when they have turned their backs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely you cannot make the dead hear you, nor can you make the deaf hear your call if they turn back in flight,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead listen and the deaf are unable to hear calls. Thus, they turn back on their heels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the dead* do not listen to your call nor do the deaf* listen to your call, when they flee turning back. (The dead and deaf implies the disbelievers.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you cannot make the dead to hear nor can you make the deaf to hear the call, when they flee, turning their backs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely you do not make the dead to hear, and you do not make the deaf to hear the call when they go back retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou shalt not make the dead to hear, neither shalt thou make the deaf to hear the call when they turn about, retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thou canst not make the dead to hear, nor canst thou make the deaf to hear the call when they have turned to flee;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead hear, nor can you make the deaf hear your call, when they turn their backs on it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thou canst not make the dead hear, nor canst thou make the deaf hear the call when they flee turning their backs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead hear, nor can you make the deaf listen to your call when they turn their backs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly thou canst not cause the dead to listen, nor canst thou cause the deaf to hear the call, (especially) when they turn back in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you cannot make the dead to hear (i.e. benefit them and similarly the disbelievers), nor can you make the deaf to hear the call, when they flee, turning their backs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not make the dead hear, nor do you make the deaf hear you call when they turn about, retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead hear, nor can you make the deaf hear the call if they turn their backs and flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, you will not make the dead hear, nor will you make the deaf hear the call when they have turned their backs retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:80] Indeed you cannot make the dead hear, nor can you make the deaf hear the call when (al-du‘ā’a idhā, read by pronouncing both hamzas, or by not pronouncing the second one, eliding it with the yā’) they have turned their backs [upon you];\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! thou canst not) Muhammad (make the dead) of hearts; and it is said: those who are like the dead, (to hear, nor canst thou make the deaf) those whose hearts are dead; it is also said that this means: those who pretend to be deaf (to hear the call) your call to the Truth and guidance (when they have turned) turn away (to flee) from the Truth and guidance;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّكَ } وإن بالغت واجتهدت في إرشادك وهدايتك { لاَ تُسْمِعُ ٱلْمَوْتَىٰ } ما جئت به من الأوامر والنواهي المقربة إلى الله\n المبينة لطريق توحيده\n إذ هم عن السمع معزولون { وَلاَ تُسْمِعُ ٱلصُّمَّ ٱلدُّعَآءَ } أي: ليس في وسعك إسماع الدعاء للأصمين الفاقدين آلة الاستماع\n سيما { إِذَا وَلَّوْاْ } وأعرضوا عنك { مُدْبِرِينَ } [النمل: 80] بلا التفات وتوجه منهم إلى الاستماع والإصغاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيّن سبب طعنهم في القرآن، بأنهم ليس فيهم قابلية الإدراك لكونهم موتى صماً، لا حياة لهم ولا سمعَ استبصار، قال تعالى: { إنك لا تُسمع الموتى } ، شُبِّهوا بالموتى لعدم تأثرهم بما يُتلى عليهم من القوارع والزواجر، { ولا تُسمِع الصمَّ الدعاءَ } أي: الدعوة إلى أمر من الأمور { إذا وَلَّوا مدبرين } عنك\n وتقييد النفي بالإدبار لتكميل التنبيه وتأكيد النفي، فإنهم مع صمَمهم عن الدعاء إلى الحق معرضون عن الداعي، مولون على أدبارهم\n ولا ريب أن الأصم لا يسمع الدعاء، مع كون الداعي بمقابلة صماخة، قريباً منه، فكيف إذا كان خلفه بعيداً منه؟\n { وما أنت بهادي العُمى عن ضلالتهم } هدايةً موصلةً إلى المطلوب، كما في قوله تعالى:\n\n[القصص:56] فإن الاهتداء منوط بالصبر في الحس، وبالبصيرة في المعنى\n ومَن فقدهما لا يتصور منه اهتداء، و \" عن \" متعلق بهادي باعتبار تضمنه معنى الصرف، وإيراد الجملة الاسمية للمبالغة في نفي الهداية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:52",
      "similarity": 0.9981031457095454
    },
    {
      "verse": "21:45",
      "similarity": 0.7458901917538792
    },
    {
      "verse": "10:42",
      "similarity": 0.6802679194553589
    },
    {
      "verse": "43:40",
      "similarity": 0.6136345529155735
    },
    {
      "verse": "47:23",
      "similarity": 0.5413512792853337
    }
  ]
}