{
  "chapter": "النمل",
  "text": "ويوم ينفخ فى الصور ففزع من فى السموت ومن فى الارض الا من شاء الله وكل اتوه دخرين",
  "translations": [
    {
      "translation": "On the Day the Trumpet is blown and everyone in the heavens and everyone on the earth is terrified - except those Allah wills, everyone will come to Him abject.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the trumpet blast is sounded whoever is in the heavens and the earth will be terrified, save those whom God please, and all will appear before Him in abjectness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Trumpet will be blown all those who are in the heavens and on the earth shall be terror stricken - all except those whom Allah wills - and everyone shall come to Him utterly abject.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone in the heavens and earth will be terrified on the day when the trumpet will be sounded except those whom God will save. Everyone will humbly come into the presence of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when the Trumpet is blown – so all those who are in the heavens and the earth will be terrified, except whomever Allah wills; and everyone has come to Him, in submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day on which the Trumpet (Sur) will be blown -- and all who are in the heavens and all who are on the earth, will be terrified except him whom Allah wills. And all shall come to Him, humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when the trumpet shall be blown, then those who are in the heavens and those who are in the earth shall be terrified except such as Allah please, and all shall come to him abased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day the Trumpet is blown, and terrified is whosoever is in the heavens and earth, excepting whom God wills, and every one shall come to Him, all utterly abject;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remind them of) the Day when the Trumpet will be blown, and all who are in the heavens and the earth will start in fear, save him whom Allah willeth. And all come unto Him, humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the trumpet is blown, whoever is in the heavens and whoever is on the earth will be struck with terror, except for those whom God wishes to spare. All shall come to Him in utter humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remind them of the Day whereon the trumpet shall be blown, and affrighted will be those who are in the heavens and the earth, save him whom Allah willeth. And all shall come unto Him, lowly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the trumpet is blown, whoever is in the heavens and whoever is on the earth will be terrified, except such as Allah wishes, and all will come to Him in utter humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day that the Trumpet will be sounded - then will be smitten with terror those who are in the heavens, and those who are on earth, except such as Allah will please (to exempt): and all shall come to His (Presence) as beings conscious of their lowliness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day on which the Trumpet will be blown and all who are in the heavens and all who are on the earth, will be terrified except him whom Allah will (exempt). And all shall come to Him humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the Horn shall be blown all who live in the heavens and earth will be terrified, except those whom Allah wills. All shall come to Him humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the Trumpet is blown, everyone in the heavens and the earth will be horrified, except whomever God wills; and everyone will come before Him in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [warn of] the Day the Horn will be blown, and whoever is in the heavens and whoever is on the earth will be terrified except whom Allah wills. And all will come to Him humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:87] And the day when the Trumpet will be blown, the Horn [will be blown], the First Blast, by [the archangel] Isrāfīl, and whoever is in the heavens and the earth will be terrified, that is, a fright that brings about death — as is stated in another verse, and whoever is in the heavens and whoever is in the earth will swoon [Q. 39:68] (the past tense [fazi‘a] is used to express the fact that such [events] will have occurred); except whom God will, namely, Gabriel, Michael, Isrāfīl and the Angel of Death. According to Ibn ‘Abbās, however, these [excepted individuals] are the martyrs who are [described as], living with their Lord, provided for [by Him]’ [Q. 3:169]. And all (kullun: the nunation compensates for the [missing] genitive annexation), in other words, and every one of them, after being brought back to life on the Day of Resurrection, will come to Him (read in the form of the verb [atawhu] or the active participle [ātūhu]) in [utter] humility, humbled (the past tense, atawhu, is used to express the fact that this will have happened).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remind them of) the Day when the Trumpet will be blown) this is the blowing of death, (and all who are in the heavens) the angels (and the earth) of created beings (will start in fear) will die, (save him whom Allah wills) from among the dwellers of heaven: Gabriel, Michael, Seraphiel and the angel of death, for these will not die upon the first blowing of the Trumpet, but they will die after that. (And all) i.e. the dwellers of the heavens and earth (come unto Him, humbled) they will come to Allah on the Day of Judgement abased and humbled.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكُلٌّ أَتَوْهُ دَاخِرِينَ } أي صَاغرينَ خَاضعينَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"All will come to Him {humiliated}\": that is, in a state of submission and humility.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويوم ينفخ في الصور } النفخة الأولى نفخة الإماتة في القيامة الصغرى { ففزع مَنْ في السموات ومن في الأرض } من العقلاء المجرّدين والجهال والجهار البدنيين\n أو من القوى الروحانية والجسمانية { إلا من شاء الله } من الموحدين الفانين في الله\n والشهداء القائمين بالله { وكل أتوه } إلى المحشر للبعث\n صاغرين\n أذلاء\n لا قدرة لهم ولا اختيار\n أو أتوه منقادين قابلين لحكمه بالموت\n { وترى } جبال الأبدان { تحسبها جامدة } ثابتة في مكانها { وهي تمرّ } وتذهب وتتلاشى بالتحليل كالسحاب لتجتمع أجزاؤها عند البعث في اليوم الطويل { صنع الله } أي: صنع هذا النفخ والإماتة والإحياء لمجازاة العباد بالأعمال صنعاً متقناً يليق به { إنه خبير بما تفعلون }  { من جاء بالحسنة } أي: بمحو صفة من صفات نفسه بالتوبة إلى الله عنها من قيام صفة إلهية مقامها\n { ومن جاء بالسيئة } باحتجابه بصفة من صفات نفسه { فكبت وجوههم } بتنكيس بنائهم لشدّة ميلهم إلى الجهة السفلية في نار الطبيعة { هل تجزون } إلا بصور أعمالكم وجعل هيئاتها صوركم\n { إنما أُمِرت أن } لا ألتفت إلى غير الحق و { أعبد ربّ هذه البلدة } أي: القلب { الذي حرّمها } حماها عن استيلاء صفات النفس ومنعها من دخول أهل الرجس وآمنها وآمن من فيها لئلا ينكبّ وجهي في نار الطبيعة { وله كل شيء } أي: تحت ملكوته وربوبيته يعطي عابده ما شاء أن يعطيه ويمنعه ما شاء أن يمنعه ويدفع من غالبه { وأمرت أن أكون من المسلمين } الذين أسلموا وجوههم بالفناء فيه { وأن أتلو القرآن } أفضل الكمالات المجموعة في إبرازها وإخراجها إلى الفعل في مقام البقاء { وقل الحمد لله } بالاتّصاف بصفاته الحميدة { سيريكم } صفاته في مقام القلب { فتعرفونها } أو آيات أفعاله وآثارها بالقهر في مقام النفس فتعرفونها عند التعذب بها أو { يوم ينفخ في الصور } بتجلي الذات في القيامة الكبرى\n { ففزع من في السماوات ومن في الأرض } بصعقة الفناء والقهر الكليّ إلا من شاء الله من أهل البقاء الذين أحيوا لحياته وأفاقوا بعد صعقة الفناء به\n[النمل\n الآية: 87] ساقطين عن درجة الحياة والوجود\n مقهورين\n وترى جبال الوجودات تحسبها جامدة ثابتة على حالها ظاهراً وهي تمرّ مرّ السحاب في الحقيقة زائلة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل تنبيهاً على التائهين في بيداء الغفلة: { يَوْمَ يُنفَخُ فِي ٱلصُّورِ } وهو البوق\n لحشر الأموات من أجداثهم { فَفَزِعَ } وارتعد من هول تلك الصدى { مَن فِي ٱلسَّمَٰوَٰتِ } من سكانها { وَمَن فِي ٱلأَرْضِ إِلاَّ مَن شَآءَ ٱللَّهُ } تمكنه وقرار قلبه مطمئن بلا قلق واضطراب\n وهم الأولياء المتمكنون في مقر الفناء في الله\n المتحققون بمقام البقاء ببقائه\n الواصلون إلى شرف لقائه بلا تلوين\n منسلخين عن جلباب ناسوتهم رأساً\n وصاروا إلى حيث لا خوف عليهم ولا هم يحزنون\n\n\n{ وَ } بعدما أفاقوا من دهشتهم وهيبتهم العارضة إياهم من هول ما سمعوا { كُلٌّ } ممن يتأتى منهم الإتيان { أَتَوْهُ } على كلتا القراءتين فعلاً أو اسم فاعل\n أي: حضروا عنده وحاضروه { دَاخِرِينَ } [النمل: 87] صارغرين ذليلين\n منتظرين إلى ما جرى عليهم من حكم الله\n يُساقون إلى النار بمقتضى عدله؟ أم إلى الجنة بمقتضى فضله وإحسانه؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { و } اذكر { يومَ يُنفَخُ فِي الصُّور } \n وهو القرن الذي ينفخ فيه إسرافيل - عليه السلام - عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال:\n \" لما فرغ الله تعالى من خلق السموات والأرض\n خلق الصور\n فأعطاه إسرافيل\n فهو واضعه على فيه\n شاخص بصره إلى العرش\n حتى يؤمر\n قال: قلت: كيف هو؟ قال: عظيم\n والذي نفسي بيده إن أعظم دارة فيه كعرض السموات والأرض \" \nوفي حديث آخر:\n \" فيه ثقب بعدد كل روح مخلوقة\n فيأمر بالنفخ فيه\n فينخ نفخة\n لا يبقى عندها في الحياة أحد\n غير من شاء الله تعالى وذلك قوله تعالى: { وَنُفِخَ فِي ٱلصُّورِ فَصَعِقَ مَن فِي ٱلسَّمَاوَاتِ وَمَن فِي ٱلأَرْضِ إِلاَّ مَن شَآءَ ٱللَّهُ } [الزمر: 68]\n ثم يؤمر بأخرى\n فينفخ نفخة لا يبقى معها ميت إلا بُعث \" \nوفي رواية:\n \" فينفخ نفخة البعث\n فتخرج الأرواح\n كأنها النحل\n فتملأ ما بين السماء والأرض\n وتأتي كل روح إلى جسدها\n كما تأتي النحل إلى وكرها\n وذلك قوله تعالى: { ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ } [الزمر: 68] \"\n \nقال أبو السعود: والذي يستدعيه النظم الكريم أن المراد بالنفخ ها هنا: النفخة الثانية\n وفي الفزع في قوله تعالى: { ففزع من في السماوات ومن في الأرض } ما يعتري الكل عند البعث والنشور\n بمشاهدة الأمور الهائلة\n الخارقة للعادات في الأنفس والآفاق\n من الرعب والتهيب\n الضروريين\n الجبلين في كل نفس\n وإيراد صيغة الماضي مع كون المعطوف عليه مضارعاً للدلالة على تحقيق وقوعه\n هـ\n وظاهره أن النفخ مرتان فقط\n واعتمده القرطبي وغيره\n وصحح ابن عطية أنها ثلاث\n ورُوي ذلك عن أبي هريرة: نفخة الفزع وهي فزع حياة الدنيا\n وليس بالفزع الأكبر\n ونفخة الصعق\n ونفخة القيام من القبور\n وقوله: { إلا من شاء الله } أي: ألاَّ يفزع\n وهو من ثبّت الله قلبه\n فإن قلنا: المراد بها النفخة الثانية\n فالمستثنى: هم من سبقت لهم الحسنى\n بدليل قوله:\n[الأنبياء: 103] وإن قلنا: هي نفخة الصعق\n فالمستثنى: قيل: هم جبريل\n وميكائيل\n وإسرافيل\n وعزرائيل\n لكن يموتون بعد صعق الخلق\n وقيل: الحور وحَملةُ العرش\n وإن قلنا: المراد نفخة الفزع في الدنيا\n فالمستثنى: أرواح الأنبياء والأولياء والشهداء والملائكة\n ثم قال تعالى: { وكلٌّ أَتَوْهُ } بصيغة الماضي\n أي: وكل واحد من المبعوثين عند النفخة حضروه في موقف الحساب\n بين يدي الله جل جلاله\n والسؤال والجواب: أو: وكل حاضروه\n على قراءة إسم الفاعل\n وأصله: آتيوه\n حال كونهم { داخرين }: صاغرين أذلاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:18",
      "similarity": 0.6191154936056669
    },
    {
      "verse": "40:60",
      "similarity": 0.5706580723814382
    },
    {
      "verse": "27:89",
      "similarity": 0.4596543137991965
    },
    {
      "verse": "16:48",
      "similarity": 0.44518992846944894
    },
    {
      "verse": "21:103",
      "similarity": 0.43689820956528436
    }
  ]
}