{
  "chapter": "النمل",
  "text": "وما انت بهدى العمى عن ضللتهم ان تسمع الا من يؤمن بـايتنا فهم مسلمون",
  "translations": [
    {
      "translation": "You will not guide blind men out of their error. You will not make anyone hear except for those who have iman in Our Signs and so are Muslims.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you lead the blind when they have gone astray. You can make none hear except those who believe in Our signs and have come to peace and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor can you direct the blind to the Right Way, preventing them from falling into error. You can make only those who believe in Our verses to hear the call and then submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide the straying blind ones. You can only make hear those who believe in Our revelations submissively.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will not guide the blind out of their error; and none listen to you except those who accept faith in Our signs, and they are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you lead the blind out of their error. You can only make to hear those who believe in Our Ayat, so they submit (became Muslims).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you be a guide to the blind out of their error; you cannot make to bear (any one) except those who believe in Our communications, so they submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou shalt not guide the blind out of their error neither shalt thou make any to hear, save such as believe in Our signs, and so surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor canst thou lead the blind out of their error. Thou canst make none to hear, save those who believe Our revelations and who have surrendered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor can you guide the blind out of their error. You can make only those hear you who believe in Our revelations and surrender themselves to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor canst thou lead the blind out of their error. Thou canst make none hear save these who believe in Our signs and who have submitted themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor can you lead the blind out of their error. You can make only those hear you who believe in Our signs and have submitted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor canst thou be a guide to the blind, (to prevent them) from straying: only those wilt thou get to listen who believe in Our Signs, and they will bow in Islam.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you lead the blind out of their error, you can only make to hear those who believe in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and who have submitted (themselves to Allah in Islam as Muslims).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do you guide the blind out of their error, nor do you make any to hear, except those who believe in Our verses and are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you guide the blind out of their straying. You can make no one listen, except those who believe in Our verses; for they are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [submitting to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:81] nor can you lead the blind out of their error. You can only make those hear — hear so as to comprehend and accept — who believe in Our signs — the Qur’ān — and have therefore submitted, [are therefore] sincere in their affirmation of God’s Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nor canst thou) Muhammad (lead the blind out of their error) to guidance. (Thou canst make none to hear) your call, (save those who believe Our revelations) Our Scripture and Messenger (and who have surrendered) and are sincere in their worship and profession of Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { مَآ أَنتَ } أيها المرسل للهداية\n والمبعوث للإرشاد والتكميل { بِهَادِي ٱلْعُمْيِ } الفاقدين لآلات الهداية وأسبابها { عَن ضَلالَتِهِمْ } المركوزة في جبلتهم الراسخة في طباعهم { إِن تُسْمِعُ } أي: ما تسمع أنت هدايتك وإرشادك أيها الهادي بوحينا وتوفيقنا { إِلاَّ مَن يُؤْمِنُ بِآيَاتِنَا } الدالة على كمال وحدة ذاتنا\n وقدرتنا وعلمنا وإرادتنا ويصدق بجميع ما جئت به من عندنا { فَهُم مُّسْلِمُونَ } [النمل: 81] منقادون لأوامرنا وأحكامنا\n مجتنبون عن نواهينا ومحظوراتنا\n فهم من شدة شقاوتهم وغلظ غشاوتهم لا يؤمنون بك ولا يسلمون\n فكيف يتأتى لك إسماعهم وإراشدهم؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن تُسْمِعُ } أي: ما تُسمع سماعاً يجدي السامع وينفعه { إلا من يؤمن بآياتنا } أي: من عَلِمَ الله أنهم يؤمنون بآياته\n { فهم مسلمون } مخلصون\n من قوله:\n[البقرة: 112] أي: جعله سالماً لله خالصاً\n جعلنا الله ممن أسلم بكليته إليه\n آمين\n الإشارة: إذا وقع الاختلاف في الأحكام الظاهرة\n وهي ما يتعلق بالجوارح الظاهرة\n رُجع فيه إلى الكتاب العزيز\n أو السُنَّة المحمدية\n أو الإجماع\n أو القياس\n وإن وقع الاختلاف في الأمور القلبية\n وهي ما يتعلق بالعقائد التوحيدية\n من طريق الأذواق أو العلوم\n يُرجع فيه إلى أرباب القلوب الصافية\n فإنه لا يتجلى فيها إلا ما هو حق وصواب\n فلا يمكن قلع عروق الشكوك والأوهام\n والوساوس من القلوب المُسوسة\n إلا بالرجوع إليهم وصحبتهم\n ومن جمع بين الظاهر والباطن\n رجع إليه في الأمرين معاً\n ذكر ابن الصباغ أن الشيخ أبا الحسن الشاذلي رضي الله عنه كان يُناظر جماعة من المعتزلة\n ليردهم إلى الحق\n فدخل عليه رجل من القراء\n يُقال له: أبو مروان\n فسلَّم عليه\n فقال له الشيخ: اقرأ علينا آية من كتاب الله\n فأجرى الله على لسانه\n من غير قصد\n قوله تعالى: { فتوكل على الله إنك على الحق المبين } إلى قوله: { ووقع القول عليهم بما ظلموا فهم لا ينطقون } فتهلل وجه الشيخ\n وقال: ما بعد بيان الله من بيان\n فتابوا واهتدوا إلى الحق\n ورجعوا عن مذهبهم\n وشفا الله قلوبهم من مرض الاعتزال\n فهذا شأن العارفين بالله\n جعلهم الله شفاء من كل داء\n لكن الأعمى والأصم لا يُبصر الداعي\n ولا يَسمع المنادي\n ولذلك قال تعالى: { فإنك لا تُسمع الموتى\n\n } إلخ: قال الورتجبي: الميت: من ليس له استعداد لقبول المعرفة الحقيقية بغير الدلائل\n والأصم: من كان أذن قلبه مسدودة بغواشي القهر\n ومن كان بهذه الصفة لا يقبل إلا ما يليق بطبعه وشهواته\n هـ\n ثم ذكر بعض مقدمات الساعة\n التي كانوا يستعجلونها\n فقال: { وَإِذَا وَقَعَ ٱلْقَوْلُ عَلَيْهِم\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:53",
      "similarity": 0.9999999999999998
    },
    {
      "verse": "17:72",
      "similarity": 0.6610627638021569
    },
    {
      "verse": "80:2",
      "similarity": 0.6354984336205196
    },
    {
      "verse": "10:43",
      "similarity": 0.5823849117015713
    },
    {
      "verse": "35:19",
      "similarity": 0.5672000993867601
    }
  ]
}