{
  "chapter": "النمل",
  "text": "وترى الجبال تحسبها جامدة وهى تمر مر السحاب صنع الله الذى اتقن كل شىء انه خبيرۢ بما تفعلون",
  "translations": [
    {
      "translation": "You will see the mountains you reckoned to be solid going past like clouds - the handiwork of Allah who gives to everything its solidity. He is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see the mountains and think they are firmly planted, but they will pass away like flying clouds: Artistry of God who perfected everything. He is indeed fully aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You now see the mountains and consider them firmly fixed, but then they shall pass away even as clouds pass away. That will be the handiwork of Allah Who has created everything with perfect wisdom. He is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You think the mountains are solid. In fact, they move like clouds. It is God's technique which has established everything perfectly. He is well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the mountains presuming them fixed whereas they will be moving like the clouds; this is Allah’s making, Who created all things with wisdom; indeed He is Informed of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the mountains and think them solid, but they shall pass away as the passing away of the clouds. The work of Allah, Who perfected all things, verily, He is well-acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see the mountains, you think them to be solid, and they shall pass away as the passing away of the cloud-- the handiwork of Allah Who has made every thing thoroughly; surely He is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thou shalt see the mountains, that thou supposest fixed, passing by like clouds -- God's handiwork, who has created everything very well. He is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou seest the hills thou deemest solid flying with the flight of clouds: the doing of Allah Who perfecteth all things. Lo! He is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see the mountains and think them firmly fixed. But they shall pass away as the clouds pass away. Such is the work of God, who has ordered all things to perfection: He is fully aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou shalt see the mountains thou deemest solid passing away as the passing away of the clouds: the handiwork of Allah Who hath perfected everything. Verily He is Aware of all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see the mountains, which you suppose, to be stationary, while they drift like passing clouds—the handiwork of Allah who has made everything faultless. He is indeed well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou seest the mountains and thinkest them firmly fixed: but they shall pass away as the clouds pass away: (such is) the artistry of Allah, who disposes of all things in perfect order: for he is well acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the mountains and think them solid, but they shall pass away as the passing away of the clouds. The Work of Allah, Who perfected all things, verily! He is Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the mountains which you think to be firm pass by like clouds. (Such is the) making of Allah, who has created everything well. He is Aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see the mountains, and imagine them fixed, yet they pass, as the passing of the clouds—the making of God, who has perfected everything. He is fully Informed of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see the mountains, thinking them rigid, while they will pass as the passing of clouds. [It is] the work of Allah, who perfected all things. Indeed, He is Acquainted with that which you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:88] And you see the mountains, you notice them, at the moment of the Blast, supposing them to be still, stationary in their place, because of their tremendous size, while they drift like passing clouds, [like the drifting of the] rain when it is blown around by the wind, in other words, they [the mountains] will be drifting in like manner until they [eventually] fall to the ground, whereby they are flattened before becoming like [tufts of] ‘wool’ [cf. Q. 101:5] and then ‘scattered dust’ [cf. Q. 56:6]. God’s handiwork (sun‘a, a verbal noun emphasising the import of the preceding sentence, and which has been annexed [in a genitive construction] to its agent [Allāhi, ‘God’] after the omission of its operator) Who has perfected everything, that He has made. Truly He is aware of what you do (taf‘alūna; or [read] yaf‘alūna, ‘[what] they do’), namely, His enemies, [what they do] in the way of disobedience, and His friends, in the way of obedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَتَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحَابِ صُنْعَ اللَّهِ الَّذِي أَتْقَنَ كُلَّ شَيْءٍ إِنَّهُ خَبِيرٌ بِمَا تَفْعَلُونَ (88)الذي قاله جمهور المفسرين : إن الآية حكت حادثاً يحصل يوم ينفخ في الصور فجعلوا قوله { وترى الجبال تحسبها جامدة } عطفاً على { ينفخ في الصور } \\[ النمل : 87 \\] أي ويوم ترى الجبال تحسبها جامدة الخ . . وجعلوا الرؤية بصرية ، ومرّ السحاب تشبيهاً لتنقلها بمرّ السحاب في السرعة ، وجعلوا اختيار التشبيه بمرور السحاب مقصوداً منه إدماج تشبيه حال الجبال حين ذلك المرور بحال السحاب في تخلخل الأجزاء وانتفاشها فيكون من معنى قوله { وتكون الجبال كالعهن المنفوش } \\[ القارعة : 5 \\] ، وجعلوا الخطاب في قوله { ترى } لغير معين ليعم كل من يرى ، وجعلوا معنى هذه الآية في معنى قوله تعالى { ويوم نسير الجبال } \\[ الكهف : 47 \\] . فلما أشكل أن هذه الأحوال تكون قبل يوم الحشر لأن الآيات التي ورد فيها ذكر دك الجبال ونسفها تشير إلى أن ذلك في انتهاء الدنيا عند القارعة وهي النفخة الأولى أو قبيلها ، فأجابوا بأنها تندك حينئذ ثم تسير يوم الحشر لقوله { فقل ينسفها ربي نسفاً } إلى أن قال { يومئذ يتبعون الداعي لا عوج له } \\[ طه : 105 108 \\] لأن الداعي هو إسرافيل ( وفيه أن للاتباع أحوالاً كثيرة ، وللداعي معاني أيضاً ) .وقال بعض المفسرين : هذا مما يكون عند النفخة الأولى وكذلك جميع الآيات التي ذكر فيها نسف الجبال ودكها وبسها . وكأنهم لم يجعلوا عطف { وترى الجبال } على { ينفخ في الصور } \\[ النمل : 87 \\] حتى يتسلط عليه عمل لفظ ( يوم ) بل يجعلوه من عطف الجملة على الجملة ، والواو لا تقتضي ترتيب المعطوف بها مع المعطوف عليه ، فهو عطف عبرة على عبرة وإن كانت المذكورة أولى حاصلة ثانياً .وجعل كلا الفريقين قوله { صنع الله } الخ مراداً به تهويل قدرة الله تعالى وأن النفخ في الصور وتسيير الجبال من عجيب قدرته ، فكأنهم تأولوا الصنع بمعنى مطلق الفعل من غير التزام ما في مادة صنع من معنى التركيب والإيجاد ، فإن الإتقان إجادة ، والهدم لا يحتاج إلى إتقان .وقال الماوردي : قيل هذا مثل ضربه الله ، أي وليس بخبر . وفيما ضرب فيه المثل ثلاثة أقوال :أحدهما : أنه مثل للدنيا يظن الناظر إليها أنها ثابتة كالجبال وهي آخذة بحظها من الزوال كالسحاب ، قاله سهل بن عبد الله التستري .الثاني : أنه مثل للإيمان تحسبه ثابتاً في القلب ، وعمله صاعد إلى السماء .الثالث : إنه مثل للنفس عند خروج الروح ، والروح تسير إلى العرش .وكأنهم أرادوا بالتمثيل التشبيه والاستعارة .ولا يخفى على الناقد البصير بعد هذه التأويلات الثلاثة لأنه إن كان { الجبال } مشبهاً بها فهذه الحالة غير ثابتة لها حتى تكون هي وجه الشبه وإن كان لفظ { الجبال } مستعاراً لشيء وكان مر السحاب كذلك كان المستعار له غير مصرح به ولا ضمنياً .وليس في كلام المفسرين شفاء لبيان اختصاص هذه الآية بأن الرائي يحسب الجبال جامدة ، ولا بيان وجه تشبيه سيرها بسير السحاب ، ولا توجيه التذليل بقوله تعالى { صنع الله الذي أتقن كل شيء } فلذلك كان لهذه الآية وضع دقيق ، ومعنى بالتأمل خليق ، فوضعها أنها وقعت موقع الجملة المعترضة بين المجمل وبيانه من قوله { ففزع من في السموات ومن في الأرض } إلى قوله{ من جاء بالحسنة فله خير منها وهم من فزع يومئذ ءامنون } \\[ النمل : 87 89 \\] بأن يكون من تخلل دليل على دقيق صنع الله تعالى في أثناء الإنذار والوعيد إدماجاً وجمعاً بين استدعاء للنظر ، وبين الزواجر والنذر ، كما صنع في جملة { ألم يروا أنا جعلنا الليل ليسكنوا فيه } \\[ النمل : 86 \\] الآية .أو هي معطوفة على جملة { ألم يروا أنا جعلنا الليل ليسكنوا فيه } \\[ النمل : 86 \\] الآية ، وجملة { ويوم ينفخ في الصور } \\[ النمل : 87 \\] معترضة بينهما لمناسبة ما في الجملة المعطوف عليها من الإيماء إلى تمثيل الحياة بعد الموت ، ولكن هذا استدعاء لأهل العلم والحكمة لتتوجه أنظارهم إلى ما في هذا الكون من دقائق الحكمة وبديع الصنعة . وهذا من العلم الذي أودع في القرآن ليكون معجزة من الجانب العلمي يدركها أهل العلم ، كما كان معجزة للبلغاء من جانبه النظمي كما قدمناه في الجهة الثانية من المقدمة العاشرة .فإن الناس كانوا يحسبون أن الشمس تدور حول الأرض فينشأ من دورانها نظام الليل والنهار ، ويحسبون الأرض ساكنة . واهتدى بعض علماء اليونان إلى أن الأرض هي التي تدور حول الشمس في كل يوم وليلة دورة تتكون منها ظلمة نصف الكرة الأرضي تقريباً وضياء النصف الآخر وذلك ما يعبر عنه بالليل والنهار ، ولكنها كانت نظرية مرموقة بالنقد وإنما كان الدال عليها قاعدة أن الجرم الأصغر أولى بالتحرك حول الجرم الأكبر المرتبط بسيره وهي علة إقناعية لأن الحركة مختلفة المدارات فلا مانع من أن يكون المتحرك الأصغر حول الأكبر في رأي العين وضبط الحساب وما تحققت هذه النظرية إلا في القرن السابع عشر بواسطة الرياضي ( غاليلي ) الإيطالي .والقرآن يدمج في ضمن دلائله الجمة وعقب دليل تكوين النور والظملة دليلاً رمز إليه رمزاً ، فلم يتناوله المفسرون أو تسمع لهم ركزاً .وإنما ناط دلالة تحرك الأرض بتحرك الجبال منها لأن الجبال هي الأجزاء الناتئة من الكرة الأرضية فظهور تحرك ظلالها متناقصة قبل الزوال إلى منتهى نقصها ، ثم آخذة في الزيادة بعد الزوال . ومشاهدة تحرك تلك الظلال تحركاً يحاكي دبيب النمل أشد وضوحاً للراصد ، وكذلك ظهور تحرك قممها أمام قرص الشمس في الصباح والماء أظهر مع كون الشمس ثابتة في مقرها بحسب أرصاد البروج والأنواء .ولهذا الاعتبار غير أسلوب الاستدلال الذي في قوله تعالى { ألم يروا أنا جعلنا الليل ليسكنوا فيه } \\[ النمل : 86 \\] فجعل هنا بطريق الخطاب { وترى الجبال } . والخطاب للنبيء صلى الله عليه وسلم تعليماً له لمعنى يدرك هو كنهه ولذلك خص الخطاب به ولم يعمم كما عمم قوله{ ألم يروا أنا جعلنا الليل ليسكنوا فيه } \\[ النمل : 86 \\] في هذا الخطاب ، وادخاراً لعلماء أمته الذين يأتون في وقت ظهور هذه الحقيقة الدقيقة . فالنبي صلى الله عليه وسلم أطلعه الله على هذا السر العجيب في نظام الأرض كما أطلع إبراهيم عليه السلام على كيفية إحياء الموتى ، اختص الله رسوله صلى الله عليه وسلم بعلم ذلك في وقته وائتمنه على علمه بهذا السر العجيب في قرآنه ولم يأمره بتبليغه إذ لا يتعلق بعلمه للناس مصلحة حنيئذ حتى إذا كشف العلم عنه من نقابه وجد أهل القرآن ذلك حقاً في كتابه فاستلوا سيف الحجة به وكان في قرابة .وهذا التأويل للآية هو الذي يساعد قوله { وترى الجبال } المقتضي أن الرائي يراها في هيئة الساكنة ، وقوله { تحسبها جامدة } إذ هذا التأويل بمعنى الجامدة هو الذي يناسب حالة الجبال إذ لا تكون الجبال ذائبة .وقوله { وهي تمرّ } الذي هو بمعنى السير { مرّ السحاب } أي مرا واضحاً لكنه لا يبين من أول وهلة . وقوله بعد ذلك كله { صنع الله الذي أتقن كل شيء } المقتضي أنه اعتبار بحالة نظامها المألوف لا بحالة انخرام النظام لأن خرم النظام لا يناسب وصفه بالصنع المتقن ولكنه يوصف بالأمر العظيم أو نحو ذلك من أحوال الآخرة التي لا تدخل تحت التصور .و { مر السحاب } مصدر مبين لنوع مرور الجبال ، أي مروراً تنتقل به من جهة إلى جهة مع أن الرائي يخالها ثابتة في مكانها كما يخال ناظر السحاب الذي يعم الأفق أنه مستقر وهو ينتقل من صوب إلى صوب ويمطر من مكان إلى آخر فلا يشعر به الناظر إلا وقد غاب عنه . وبهذا تعلم أن المر غير السير الذي في قوله تعالى { ويوم نسير الجبال وترى الأرض بارزة } \\[ الكهف : 47 \\] فإن ذلك في وقت اختلال نظام العالم الأرضي .وانتصب قوله { صنع الله } على المصدرية مؤكداً لمضمون جملة { تمر مر السحاب } بتقدير : صنع الله ذلك صنعاً . وهذا تمجيد لهذا النظام العجيب إذ تتحرك الأجسام العظيمة مسافات شاسعة والناس يحسبونها قارة ثابتة وهي تتحرك بهم ولا يشعرون . :والجامدة : الساكنة ، قاله ابن عباس . وفي «الكشاف» : الجامدة من جمد في مكانه إذا لم يبرح ، يعني أنه جمود مجازي ، كثر استعمال هذا المجاز حتى ساوى الحقيقة والصنع . قال الراغب : إجادة الفعل فكل صنع فعل وليس كل فعل صنعاً قال تعالى { ويصنع الفلك } \\[ هود : 38 \\] { وعلمناه صنعة لبوس لكم } \\[ الأنبياء : 80 \\] يقال للحاذق المجيد : صنع ، وللحاذقة المجيدة : صنّاع . اه . وقصر في تفسير الصنع الجوهري وصاحب «اللسان» وصاحب «القاموس» واستدركه في «تاج العروس» .قلت : وأما قولهم : بئس ما صنعت ، فهو على معنى التخطئة لمن ظن أنه فعل فعلاً .حسناً ولم يتفطن لقبحه . فالصنع إذا أطلق انصرف للعمل الجيد النافع وإذا أريد غير ذلك وجب تقييده على أنه قليل أو تهكم أو مشاكلة .واعلم أن الصنع يطلق على العمل المتقن في الخير أو الشر قال تعالى { تلقف ما صنعوا إنما صنعوا كيد ساحر } \\[ طه : 69 \\] ، ووصف الله ب { الذي أتقن كل شيء } تعميم قصد به التذييل ، أي ما هذا الصنع العجيب إلا مماثلاً لأمثاله من الصنائع الإلهية الدقيقة الصنع . وهذا يقتضي أن تسيير الجبال نظام متقن ، وأنه من نوع التكوين والخلق واستدامة النظام وليس من نوع الخرم والتفكيك .وجملة { إنه خبير بما تفعلون } تذييل أو اعتراض في آخر الكلام للتذكير والوعظ والتحذير ، عقب قوله { الذي أتقن كل شيء } لأن إتقان الصنع أثر من آثار سعة العلم فالذي بعلمه أتقن كل شيء هو خبير بما يفعل الخلق فليحذروا أن يخالفوا عن أمره .ثم جيء لتفصيل هذا بقوله { من جاء بالحسنة } \\[ النمل : 89 \\] الآية فكان من التخلص والعود إلى ما يحصل يوم ينفخ في الصور ، ومن جعلوا أمر الجبال من أحداث يوم الحشر جعلوا جملة { إنه خبير بما تفعلون } استئنافاً بيانياً لجواب سائل : فماذا يكون بعد النفخ والفزع والحضور بين يدي الله وتسيير الجبال ، فأجيب جواباً إجمالياً بأن الله عليم بأفعال الناس ثم فصل بقوله { من جاء بالحسنة فله خير منها . . } \\[ النمل : 89 \\] الآية .قرأ الجمهور { بما تفعلون } بتاء الخطاب . وقرأ ابن كثير وأبو عمرو { يفعلون } بياء الغائبين عائداً ضميره على { من في السماوات ومن في الأرض } \\[ النمل : 87 \\] .\n\n",
      "translations": [
        {
          "translation": "(And thou seest) Muhammad upon the first blow of the trumpet (the hills thou deemest solid) and still (flying with the flight of clouds) in the air: (the doing of Allah) this is the doing of Allah with His creation (Who perfecteth all things) of creation. (Lo! He is Informed) Aware (of what ye do) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتَرَى } أيها الرائي يومئذٍ { ٱلْجِبَالَ } الراسيات التي { تَحْسَبُهَا } وتظنها { جَامِدَةً } ثابتة مستقرة في مكانها بلا حركة وذهاب { وَهِيَ } في نفسها { تَمُرُّ } أي: تتحرك وتذهب { مَرَّ ٱلسَّحَابِ } أي: كمروره وسرعة سيره؟ إذ الأشياء العظيمة التي لا يحيط الأبصار بجميع جوانبها قلما يحس بحركتها وإن أسرع فيها\n بل يظن أنها ثابتة في مقره\n وهكذا حال الجبال وجميع الأظلال والأطلال قبل قيام الساعة لو تفطنت بمرورها أيها الفطن اللبيب\n وجدتها في كل آن على التقضي والانصرام\n إذ الأعراض لا قيام ولا قرار\n بل كل يوم وآن في شأن\n و\n[الرحمن: 26-27]\n\n\nومرور الجبال على هذا المنوال { صُنْعَ ٱللَّهِ } أي: من صنع الله { ٱلَّذِيۤ أَتْقَنَ } وأحكم { كُلَّ شَيْءٍ } إتقاناً بديعاً\n ودبره تدبيراً أنيقاً عجيباً\n وأودع فيه من الحكم والمصالح ما لم يطلع عليها أحد من عباده\n إذ لا يسع لهم الإطلاع على أفعاله سبحانه\n بل { إِنَّهُ } بذاته وبمقتضى أسمائه وصفاته { خَبِيرٌ بِمَا تَفْعَلُونَ } [النمل: 88] أي: بجميع أفعالهم وأحوالهم\n وأقوالهم الظاهر والباطنة\n يجازيهم عليها على مقتضى خبرته\n إن خيراً فخير وإن شراً فشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وترى الجبالَ } حال الدنيا { تحسبُها جامدةً } واقفة ممسّكة عن الحركة\n من: جمد في مكانه: إذا لم يبرح\n\n{ وهي تمرُّ مرَّ السحابِ } أي: مراً مثل مر السحاب\n التي تسيرها الرياح\n سيراً حثيثاً\n والمعنى: أنك إذا رأيت الجبال وقت النفخة ظننتها ثابتة في مكان واحد لِعظمها\n وهي تسير سيراً سريعاً\n كالحساب إذا ضربته الرياح\n وهكذا الأجرام العظام\n إذا تحركت لا تكاد تتبين حركتها\n ومثال ذلك: الشمس لعظم جرمها وبُعدها لا تتبين حركتها\n مع كونها أسرع من الريح\n والذي في حديث أبي هريرة: أنَّ تسيير الجبال يكون بعد نفخة الفزع وقبل الصعق\n ونص الحديث - بعد كلام تقدم:\n \" فيأمر إسرافيل بالنفخة الأولى\n فيقول: انفخ نفخة الفزع\n فيفزع أهل السموات والأرض\n إلا من شاء الله\n فيأمره فيمدها - أي: النفخة - ويطيلها\n فيُسير الله الجبالا\n فتمر مر السحاب\n فتكون سراباً\n وتَرْتج الأرض بأهلها رجاً\n فتكون كالسفينة تضربها الأمواج\n وتقلبها الرياح وهو في قوله: { يَوْمَ تَرْجُفُ الرَّاجِفَةُ } [النازعات: 6] الآية\n فتميد الأرض بالناس على ظهرها فتذهل المراضع\n وتضع الحوامل\n وتشيب الولدان\n وتطير الشياطين\n هاربة من الفزع\n حتى تأتي الأقطار هاربة\n فتلقاها الملائكة تضرب وجهها وأدبارها\n فترجع\n ويولي الناس مدبرين\n ينادي بعضهم بعضاً\n وهو قوله: { يَوْمَ ٱلتَّنَادِ يَوْمَ تُوَلُّونَ مُدْبِرِينَ\n\n\n } [غافر: 33] الآية فبينما هم كذلك إذ تصدعت الأرض\n من قطر إلى قطر\n فرأوا أمراً عظيماً\n لم يروا مثله \" \nثم قال: قال النبي صلى الله عليه وسلم:\n \" والأموات يومئذٍ لا يعلمون بشيء من ذلك \" \nقال أبو هريرة: قلت: يا رسول الله فمن استثنى الله من الفزع؟ قال: \" أولئك الشهداء \"\n قلت: ومثلهم الأنبياء والأولياء إذ هم أعظم منهم\n وأحياء مثلهم\n ثم قال عليه الصلاة والسلام: \" وإنما يصل الفزع إلى الأحياء\n وهم أحياء عند ربهم يُرزقون\n وقاهم الله فزع ذلك اليوم\n وهو عذاب يبعثه الله على شرار خلقه \"\n وهو قوله تعالى:\n[الحج: 1] إلى قوله:\n[الحج: 2] فيمكثون طويلاً\n ثم يأمر الله تعالى إسرافيل\n فينفخ نفخة الصعق\n فيصعق من في السموات\n ومن في الأرض\n إلا من شاء الله\n فإذا اجتمعوا في البرزخ\n جاء ملك الموت إلى الجبار\n فيقول: قد مات أهلُ السموات والأرض\n إلا من شاء الله\n فإذا اجتمعوا في البرزخ جاء ملك الموت إلى الجبار فيقول: قد مات أهل السموات والأرض إلا من شئتَ فيقول الله تعالى\n وهو أعلم: مَن بقي؟ فيقول: بقيتَ أنت الحي القيوم\n الذي لا تموت\n وبقيت حملة العرش\n وبقي جبريل وميكائيل\n وإسرافيل وبقيتُ أنا\n فيقول تعالى: فليمتْ جبريل وميكائيل\n فينطق الله العرش\n فيقول: أيّ رب يموت جبريل\n وميكائيل! فيقول: اسكت\n إني كتبت الموت على كل من تحت عرشي\n فيموتان\n ثم يأتي ملك الموتُ الجبارَ\n فيقول: أي رب قد مات جبريل وميكائيل\n فيقول - وهو أعلم: من بقي؟ بقيتَ أنت الحي الذي لا تموت\n وبقيت حملة العرش\n وبقي إسرافيل\n وبقيتُ أنا\n\nفيقول: ليمتْ حملة العرش\n فيموتون\n فيأمر الله العرش فيقبض الصور من إسرافيل\n ثم يقول: ليمت إسرافيل\n فيموت\n ثم يأتي ملك الموت فيقول: يا رب قد مات حملة عرشك\n فيقول\n وهو أعلم: من بقي؟ فيقول: بقيتَ أنت الحي الذي لا تموت\n وبقيت أنا\n فيقول: أنت خلق من خلقي\n خلقتك لِما رأيتَ\n فمتْ\n فيموت\n فإذا لم يبق إلا الله الواحد الأحد الصمد\n الذي لم يلد ولم يولد\n ولم يكن له كفواً أحد\n فكان آخراً\n كما كان أولاً\n طوى السماء طي السجل للكتاب\n فيقول: أنا الجبار\n { لِمن الملك اليوم }؟ فلا يجيبه أحد\n ثم يقول تعالى: { لله الواحد القهار } ثم تُبدل الأرض غير الأرض\n والسموات يبسطها بسطاً\n ثم يمدها مدّ الأديم العكاظي\n لا ترى فيها عِوَجاً ولا أمتاً\n ثم قال: ثم ينزل ماء من تحت العرش\n كمني الرجل\n ثم يأمر الله السحاب أن تمطر أربعين يوماً\n حتى يكون فوقهم اثني عشر ذراعاً\n ويأمر الله تعالى الأجساد أن تنبت كنبات البقل\n حتى إذا تكاملت أجسادهم\n كما كانت\n قال الله تعالى: ليحيَى حملة العرش\n فيحيون\n ثم يقول الله تعالى: ليحيى جبريل وميكائيل وإسرافيل\n فيحيون\n ثم يأمر الله تعالى إسرافيل\n فيأخذ الصور فيضعه على فيه\n ثم يدعو الله تعالى الأرواح\n فيؤتى بها تتوهج أرواح المؤمنين نوراً\n والأخرى ظلمة\n فيقبضها\n ثم يلقيها في الصور\n ثم يأمر الله تعالى إسرافيل أن ينفخ نفخة البعث\n فتخرج الأرواح\n كأنها النحل\n وقد ملأت ما بين السماء والأرض\n فيقول تعالى: لترجعن كل روح إلى جسدها\n فتدخل الأرواح الخياشيم\n ثم تمشي في الأجساد\n مشي السم في اللديغ\n ثم تنشق الأرض عنهم سراعاً\n فأنا أول من تنشق عنه\n فتخرجون منها إلى ربكم تنسلون\n عراةً\n حفاةً\n غُرلاً\n مهطعين إلى الداعي\n فيقول الكافر: هذا يوم عسير\n نقله الثعلبي\n ثم قال تعالى: { صُنعَ الله } \n هو مصدر مؤكد لمضمون ما قبله\n أي: صَنَعَ الله ذلك صُنعاً\n على أنه عبارة عما ذكر من النفخ في الصور\n وما ترتب عليه جميعاً\n قصد به التنبيه على عِظَم شأن تلك الأفاعيل\n وتهويل أمرها\n والإيذان بأنها ليست بطريق الإخلال بنظم العالم\n وإفساد أحوال الكائنات\n من غير أن تدعو إليه داعية\n بل هي من بدائع صنع الله تعالى\n المبنية على أساس الحكمة\n المستتبعة للغايات الجليلة\n التي لأجلها رتبت مقدمات الخلق ومبادئ الإبداع\n على الوجه المتين\n والنهج الرصين كما يعرب عنه قوله: { الذي أتقنَ كلَّ شيء } أي: أحكم خلقه وسوّاه\n على ما تقتضيه الحكمة\n وقوله تعالى: { إنه خبير بما تفعلون }: تعليل لكون ما ذكر صنعاً محكماً له تعالى لبيان أن علمه بظواهر أفعال المكلفين وبواطنها\n مما يدعو إلى إظهارها وبيان كيفياتها\n على ما هي عليه من الحسن والسوء\n وترتيب أجزيتها عليها بعد بعثهم وحشرهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:38",
      "similarity": 0.07229599080460464
    },
    {
      "verse": "13:12",
      "similarity": 0.07183345780715888
    },
    {
      "verse": "7:57",
      "similarity": 0.07169093193499525
    },
    {
      "verse": "2:164",
      "similarity": 0.06917270052388914
    },
    {
      "verse": "54:48",
      "similarity": 0.06879881491955288
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027088.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027088.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:88.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}