{
  "chapter": "النمل",
  "text": "وان اتلوا۟ القرءان فمن اهتدى فانما يهتدى لنفسه ومن ضل فقل انما انا۠ من المنذرين",
  "translations": [
    {
      "translation": "And to recite the Qur'an.\" Whoever comes to guidance does so for himself; as for him who stays astray, tell him: \"I am only a warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to recite the Qur'an.\" So, whosoever is guided, his guidance will be to his own good. As for those who stray, tell them: \"I am none but a warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and recite the Quran. Whoever seeks guidance will find it for his own soul. Say to whoever goes astray, \"I am only a warner\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And to recite the Qur’an”; so whoever attained the right path, has attained it for his own good; and whoever goes astray – so say, “Indeed I am only a Herald of Warning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that I should recite the Qur'an, then whosoever receives guidance, receives it for the good of himself; and whosoever goes astray, say (to him): \"I am only one of the warners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that I should recite the Quran. Therefore whoever goes aright, he goes aright for his own soul, and whoever goes ' astray, then say: I am only one of the warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to recite the Koran. So whosoever is guided, is only guided to his own gain; and whosoever goes astray, say: 'I am naught but a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to recite the Qur'an. And whoso goeth right, goeth right only for (the good of) his own soul; and as for him who goeth astray - (Unto him) say: Lo! I am only a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to recite the Quran.\" Whoever follows its guidance, follows it only for the good of his own soul; and as for him who goes astray, just say, \"I am only a warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that I should recite the Qur'an. And whosoever receiveth guidance, receiveth guidance for his own soul, and as for him who strayeth say thou: I am only of the warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to recite the Quran.’ Whoever is guided is guided only for his own good, and as for him who goes astray, say, ‘I am just one of the warners.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to rehearse the Qur'an: and if any accept guidance, they do it for the good of their own souls, and if any stray, say: \"I am only a Warner\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to recite the Quran, so whosoever receives guidance, receives it for the good of his ownself, and whosoever goes astray, say (to him): \"I am only one of the warners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to recite the Koran. Whosoever is guided is only guided for himself, and to whosoever goes astray, say: 'I am only a warner'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to recite the Quran.” Whoever is guided—is guided to his own advantage. And whoever goes astray, then say, “I am one of the warners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to recite the Qur'an.\" And whoever is guided is only guided for [the benefit of] himself; and whoever strays - say, \"I am only [one] of the warners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:92] and to recite the Qur’ān, to you as a call to faith. So whoever is guided, to it, is guided only for his own sake, since the reward for his being guided will be his; and whoever goes astray, from faith and errs from the path of guidance, say, to him: ‘I am just one of the warners’, the threateners, and therefore my duty is only to deliver [the Message] — this was [revealed] before the command to fight [against the disbelievers].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And to recite the Qur'an) I am commanded to recite the Qur'an to you. (And whoso goeth right) whoever believes in what is in the Qur'an, (goeth right) believes (only for (the good of) his own soul) the reward of his faith goes to himself; (and as for him who goeth astray) disbelieves in the Qur'an ((Unto him) say) Muhammad: (Lo! I am only a warner) I only warn you against the Fire by means of the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أُمرت أيضاً { أَنْ أَتْلُوَاْ ٱلْقُرْآنَ } المنزل عليَّ من عند ربي، وأداوم على تلاوتة بين أظهر الأنام؛ لأنه إنما أوحي للهدى والإرشاد بالنسبة إلى جميع العباد { فَمَنِ ٱهْتَدَىٰ } به بعدما سمعه وتأمل معناه، وامتثل بمقتضاه { فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ } نفع هدايته عائد إليها، مفيد لها { وَمَن ضَلَّ } أي: أعرض عنه بعدما سمع واستكبر وكذب { فَقُلْ } أي: أمرني ربي أن قُلْ للمكذبين: { إِنَّمَآ أَنَاْ مِنَ ٱلْمُنذِرِينَ } [النمل: 92] أي: أمري منحسر بالإنذار والتخويف كسائر الرسل المنذرين، فالهداية والضلال إنما هو مفوض إلى الكبير المتعال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإن أتلوَ القرآن } أي: أُواظب على تلاوته لتنكشف حقائقه الرائقة المخزونة في تضاعيفه شيئاً فشيئاً\n أو: على تلاوته على الناس بطريق تكرير الدعوة، وتثنية الإرشاد، فيكون ذلك تنبيهاً على كفايته في الهداية والإرشاد، من غير حاجة إلى إظهار معجزة أخرى\n { فمن اهتدى فإنما يهتدي لنفسه } أي: فمن اهتدى بالإيمان به، والعمل بما فيه من الشرائع والأحكام، فإنما منافع هدايته عائدة إليه، لا إلى غيره\n { ومن ضلّ } بالكفر به، والإعراض عن العمل بما فيه { فقلْ } في حقه: { إنما أنا من المنذرينَ } وقد خرجتُ من عهدة الإنذار، فليس عليَّ من وبال ضلالته شيء\n قال الصفاقسي: جواب \" من \": محذوف، يدل عليه ما قبله، أي: فوبال ضلاله عليه، أو: يكون الجواب: \" فقل \" ، ويقدر ضمير عائد من الجواب إلى الشرط لأنه اسم غير ظرف، أي: من المنذرين له\n هـ",
      "translations": []
    }
  ]
}