{
  "chapter": "النمل",
  "text": "انما امرت ان اعبد رب هذه البلدة الذى حرمها وله كل شىء وامرت ان اكون من المسلمين",
  "translations": [
    {
      "translation": "'I have simply been ordered to worship the Lord of this land which He has declared sacred - everything belongs to Him - and I have been ordered to be one of the Muslims",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Say): \"I am commanded to worship the Lord of this land He has blessed, to whom all things belong; and I am commanded to be one of those who submit,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Tell them, O Muhammad): \"I have been commanded only to serve the Lord of this city that He has made inviolable, to serve Him to Whom all things belong. I have been commanded to be of those that submit to Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am commanded to worship the Lord of this town which He has made sacred. To Him belong all things. I am commanded to be a Muslim\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I (Prophet Mohammed – peace and blessings be upon him) have been commanded to worship the Lord of this city, Who has deemed it sacred, and everything belongs to Him; and I have been commanded to be among the obedient.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have been commanded only to worship the Lord of this city, Who has sanctified it and to Whom belongs everything. And I am commanded to be from among the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am commanded only that I should serve the Lord of this city, Who has made it sacred, and His are all things; and I am commanded that I should be of these who submit;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have only been commanded to serve the Lord of this territory which He has made sacred; to Him belongs everything. And I have been commanded to be of those that surrender,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Say): I (Muhammad) am commanded only to serve the Lord of this land which He hath hallowed, and unto Whom all things belong. And I am commanded to be of those who surrender (unto Him),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am commanded to serve the Lord of this town, which He has made inviolable and to whom everything belongs; I am commanded to be one of those devoted to Him;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am commanded only to worship the Lord of this city which He hath sanctified, -and His is every thing - and I am commanded to be of the Muslims;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say], ‘I have been commanded to worship the Lord of this city who has made it inviolable and to whom all things belong, and I have been commanded to be among those who submit [to Allah],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For me, I have been commanded to serve the Lord of this city, Him Who has sanctified it and to Whom (belong) all things: and I am commanded to be of those who bow in Islam to Allah's Will,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I (Muhammad SAW) have been commanded only to worship the Lord of this city (Makkah), Him Who has sanctified it and His is everything. And I am commanded to be from among the Muslims (those who submit to Allah in Islam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Say Prophet Muhammad): 'I am only ordered to worship the Lord of this country, which He has made sacred, everything belongs to Him. And I am ordered to be of the Muslims,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I was commanded to worship the Lord of this town, who has sanctified it, and to Whom everything belongs; and I was commanded to be of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say, O Muhammad], \"I have only been commanded to worship the Lord of this city, who made it sacred and to whom [belongs] all things. And I am commanded to be of the Muslims [those who submit to Allah]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:91] Say to them: I have been commanded only to worship the Lord of this land, namely, Mecca, which He has made inviolable, which He has made a secure Sanctuary, one in which no human blood may be shed, no person may be wronged, none of its prey may be hunted and [a sanctuary] which is never deserted. Such were the graces bestowed [by God] upon its inhabitants, the [tribe of] Quraysh, [graces] whereby God has spared their land the suffering and civil strife common to all the [other] lands of the Arabs; and to Whom, exalted be He, all things belong, for He is their Lord, Creator and Possessor. And I have been commanded to be of those who submit, to God, by affirming His Oneness;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (I am commanded only to serve) to confess the divine Oneness of (the Lord of this land) i.e. Mecca (which He hath hallowed) which He made Sacred, (and unto Whom all things) among created beings (belong. And I am commanded to be of those who surrender (unto Him)) with the Muslims in their religion,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا أمر سبحانه الرسول صلى الله عليه وسلم بتبليغ ما أوحي إليه من الوعد والوعيد\n والأوامر والنواهي المصلحة لأحوال الأنام في النشأتين\n وبيان مبدئهم ومعاهدهم\n وما يؤول إليه أمرهم بعدما انقرضوا من هذه النشأة التي هي دار الابتلاء والاختبار\n إما إلى دركات النيران وإما إلى درجات الجنان\n ثمَّ بيَّن لهم طريق الوصول إلى مقر التوحيد\n والتمكن في مقام التجريد والتفريد آمراً أيضاً\n بأن قال لهم إمحاضاً للنصح كلاماً ناشئاً عن محض الحكمة\n خالياً عن وصمة الميل إلى الهوى: { إِنَّمَآ أُمِرْتُ أَنْ أَعْبُدَ } الله الواحد الأحد الصمد عبادة خالصة عن الرياء والرعونات { رَبَّ هَذِهِ ٱلْبَلْدَةِ } أراد بها مكة\n شرفها الله - خصها بالإضافة للتعظيم\n وإلا فهو رب جميع البلاد والأماكن { ٱلَّذِي حَرَّمَهَا } هذه البلدة من الأمور التي أباحها في غيرها من البلاد { وَلَهُ } سبحانه { كُلُّ شَيءٍ } خلقه وملكه\n وتصرف فيه كشف يشاء وأراد بلا منازع ومخاصم { وَ } بالجملة: { أُمِرْتُ أَنْ أَكُونَ مِنَ ٱلْمُسْلِمِينَ } [النمل: 91] المنقادين لأحكامه سبحانه\n الممتثلين لأوامره ونواهيه بلا التفات إلى إيمان أحد وكفره وهدايته وضلاله\n\n\n{ وَ } أُمرت أيضاً { أَنْ أَتْلُوَاْ ٱلْقُرْآنَ } المنزل عليَّ من عند ربي\n وأداوم على تلاوتة بين أظهر الأنام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: قل لكفار قريش\n بعد تبيين أحوال المبعث\n وشرح أحوال القيامة\n بما لا مزيد عليه: { إنما أُمرتُ أن أعبدَ ربَّ هذه البلدة } أي: مكة\n أي: إنما أمرني ربي أن أعبده\n وأستغرق أوقاتي في مراقبته ومشاهدته\n غير مبالٍ بكم\n ضللتم أم رشِدتم\n وما عليّ إلا البلاغ\n وقد بلغتكم وأنذرتكم\n وتخصيص مكة بالإضافة لتفخيم شأنها وإجلال مكانها\n { الذي حَرَّمها } أي: جعلها حرماً آمناً\n يأمن الملتجأ إليها\n ولا يختلي خلاها\n ولا يعضد شوكها\n ولا ينفّر صيدها\n والتعرض لبيان تحريمه إياها تشريف لها بعد تشريف\n وتعظيم إثر تعظيم\n مع ما فيه من الإشعار بعلة الأمر بعبادة ربها\n وأنهم مُكلفون بذلك\n كما في قوله تعالى:\n[قريش: 3\n 4]\n ومن الإشارة إلى غاية شناعة ما فعلوا فيها\n ألا يُرى أنهم مع كونها محرمة أن تنتهك حرمتها\n ويلحد فيها بإثم\n قد استمروا فيها على تعاطي أفجر الفجور\n وأشنع الإلحاد\n حيث تركوا عبادة ربها\n ونصبوا الأوثان\n وعكفوا على عبادتها\n قاتلهم الله أنَّى يؤفكون\n قاله أبو السعود\n ثم قال تعالى: { وله كلُّ شيء } خلقاً وملكاً وتصرفاً\n من غير ان يشاركه أحد في شيء من ذلك\n تحقيقاً للحق\n وتنبيهاً على إن إفراد مكة بالإضافة لما ذكر من التفخيم والتشريف\n مع عموم الربوبية لجميع الموجودات\n { وأُمرتُ أن أكون من المسلمين } المنقادين له\n الثابتين على ما كنا عليه\n من ملة الإسلام والتوحيد\n الذين أسلموا وجوهم له تعالى\n وانقادوا إليه بالكلية\n { وإن أتلوَ القرآن } أي: أُواظب على تلاوته لتنكشف حقائقه الرائقة المخزونة في تضاعيفه شيئاً فشيئاً\n أو: على تلاوته على الناس بطريق تكرير الدعوة\n وتثنية الإرشاد\n فيكون ذلك تنبيهاً على كفايته في الهداية والإرشاد\n من غير حاجة إلى إظهار معجزة أخرى\n { فمن اهتدى فإنما يهتدي لنفسه } أي: فمن اهتدى بالإيمان به\n والعمل بما فيه من الشرائع والأحكام\n فإنما منافع هدايته عائدة إليه\n لا إلى غيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "95:3",
      "similarity": 0.7255108079313416
    },
    {
      "verse": "89:8",
      "similarity": 0.6452845809376845
    },
    {
      "verse": "90:2",
      "similarity": 0.6340484602151445
    },
    {
      "verse": "50:11",
      "similarity": 0.6194628351253966
    },
    {
      "verse": "89:11",
      "similarity": 0.6044205749335794
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/27:91.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/27:91.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/27:91.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}