{
  "chapter": "النمل",
  "text": "ومن جاء بالسيئة فكبت وجوههم فى النار هل تجزون الا ما كنتم تعملون",
  "translations": [
    {
      "translation": "Those who perform bad actions will be flung head first into the Fire: 'Are you being repaid for anything other than what you did?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever comes with evil will be flung face forward into the Fire. Can you expect reward for any thing but what you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever comes with evil, they will be flung upon their faces into the Fire. Will you be recompensed for aught other than what you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who commit evil will be thrown headlong into hell fire. (It will be said to them) can you expect any recompense other than what you deserve for your deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever brings evil – so their faces will be dipped into the fire; what reward will you get, except what you did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever brings an evil deed, they will be cast down on their faces in the Fire. (And it will be said to them) \"Are you being recompensed anything except what you used to do\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever brings evil, these shall be thrown down on their faces into the fire; shall you be rewarded (for) aught except what you did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever comes with an evil deed, their faces shall be thrust into the Fire: 'Are you recompensed but for what you did?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso bringeth an ill-deed, such will be flung down on their faces in the Fire. Are ye rewarded aught save what ye did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who do evil will be flung down on their faces in the Fire. Are you not rewarded according to your deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever will bring evil --their faces shall be cast down into the Fire. Are ye being requited aught save that which ye have been working?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever brings vice—they shall be cast on their faces into the Fire [and told:] ‘Shall you not be requited for what you used to do?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any do evil, their faces will be thrown headlong into the Fire: \"Do ye receive a reward other than that which ye have earned by your deeds?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever brings an evil (deed) (i.e. Shirk polytheism, disbelief in the Oneness of Allah and every evil sinful deed), they will be cast down (prone) on their faces in the Fire. (And it will be said to them) \"Are you being recompensed anything except what you used to do?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who come with an evil deed shall have their faces thrust into the Fire: 'Are you recompensed except for your deeds'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever brings evil—their faces will be tumbled into the Fire. Will you be rewarded except for what you used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever comes with an evil deed - their faces will be overturned into the Fire, [and it will be said], \"Are you recompensed except for what you used to do?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:90] And whoever brings an evil deed, namely, the ascribing of partners [to God], their faces shall be thrust into the Fire, having been oriented towards it — ‘faces’ are specifically mentioned here because of all the sensory organs it is where [a person’s] dignity resides, and so other parts [of the body] are more deserving [of punishment]. It shall be said to them in reproach: ‘Are you requited except, the requital, for what you used to do?’, in the way of idolatry and acts of disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso bringeth an ill-deed) associating partners with Allah, (such will be flung down on their faces in the Fire. Are ye rewarded) in the Hereafter (aught save what ye did) in this worldly life?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومن جاء بالسيئة } باحتجابه بصفة من صفات نفسه { فكبت وجوههم } بتنكيس بنائهم لشدّة ميلهم إلى الجهة السفلية في نار الطبيعة { هل تجزون } إلا بصور أعمالكم وجعل هيئاتها صوركم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن جَآءَ } في دا ر الاختبار { بِٱلسَّيِّئَةِ } المردودة عند الله، وعند الناس من الأمور التي حرمها الشرع والعقل والمروءة { فَكُبَّتْ وُجُوهُهُمْ فِي ٱلنَّارِ } أي: كُبُّوا على وجوههم في النار صاغرين، قيل لهم حنيئذٍ زجراً عليهم، وطرداً لهم: { هَلْ تُجْزَوْنَ } أي: ما تُجزون بهذا الهوان والصغار { إِلاَّ مَا كُنتُمْ تَعْمَلُونَ } [النمل: 90] من السيئات الجالبة له في النشأة الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن جاء بالسيئة } قيل: هو الشرك\n { فكُبَّتْ وجُوهُهُم في النار } ، أي: كُبوا فيها على وجوههم منكوسين\n ويقال لهم: { هل تُجزَون إلا ما كنتم تعملون } في الدنيا من الشرك والمعاصي\n والله تعالى أعلم\n الإشارة: من أراد أن يكون ممن استثنى الله من الفزع والهول، فليكن قلبه معموراً بالله، ليس فيه غير مولاه، ولا مقصود له في الدارين إلا الله، وظاهره معموراً بطاعة الله، متمسكاً بسنة رسول الله، هواه تابع لِما جاء من عند الله، لا شهوة له إلا ما يقضي عليه مولاه، فبهذا ينخرط في سلك أولياء الله، الذين لا خوف عليهم ولا هم يحزنون، والذين سبقت لهم الحسنى، لا يحزنهم الفزع الأكبر، وهم فيما اشتهت أنفسهم خالدون\n جعلنا الله من خواصهم، بمنِّه وكرمه آمين\n وقوله تعالى: { وترى الجبالَ تحسَبها جامدةً\n\n\n } الآية\n كذلك قلوب الراسخين في العلم بالله، لا تؤثر فيهم هواجم الأحوال والواردات الإلهية، بل تهزهم في الباطن، وظواهرهم ساكنة، كالجبال الراسية، قيل للجنيد: قد كنت تتواجدُ عند السماع، والآن لا يتحرك فيك شيء؟ فتلى: { وترى الجبال تحسبها جامدة وهي تمر مر السحاب }\n وقوله تعالى: { من جاء بالحسنة } أي: بالخصلة الحسنة، وهي المعرفة { فله خير منها } وهو دوام النظرة والحبرة، في مقعد صدق عند مليك مقتدر، { ومن جاء بالسيئة } هي الجهل بالله، فينكس وجهه عن مواجهة المقربين\n والعياذ بالله\n ولمّا بلّغ الرسول صلى الله عليه وسلم ما أمره الله من بيان عواقب الأمور، تبرأ منهم، فقال: { إِنَّمَآ أُمِرْتُ أَنْ أَعْبُدَ رَبَّ\n\n\n }\n",
      "translations": []
    }
  ]
}