{
  "chapter": "النمل",
  "text": "وقل الحمد لله سيريكم ءايته فتعرفونها وما ربك بغفل عما تعملون",
  "translations": [
    {
      "translation": "Say: 'Praise be to Allah. He will show you His Signs and you will recognise them. Your Lord is not unaware of what you do.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"All praise be to God. He will show you His signs, and you will recognise them. Your Lord is not heedless of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"All praise be to Allah, Who will soon show you His Signs that you will recognize.\" Your Lord is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is only He who deserves all praise. He will soon show you His signs and you will recognize them. Your Lord is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim, “All praise is to Allah – He will soon show you His signs so you will recognise them”; and (O dear Prophet Mohammed – peace and blessings be upon him) your Lord is not unaware of what you, O people, do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"All the praises and thanks be to Allah. He will show you His Ayat, and you shall recognize them. And your Lord is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: Praise be to Allah, He will show you His signs so that you shall recognize them; nor is your Lord heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: 'Praise belongs to God. He shall show you His signs and you will recognise them. Thy Lord is not heedless of the things you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: Praise be to Allah Who will show you His portents so that ye shall know them. And thy Lord is not unaware of what ye (mortals) do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then say, \"Praise be to God! He will show you His signs and you will recognize them. Your Lord is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say thou: All praise unto Allah! Anon He shall shew you His signs, so that ye will recognize them. And thy Lord is not negligent of that which ye Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, ‘All praise belongs to Allah. Soon He will show you His signs, and you will recognize them.’ Your Lord is not oblivious of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"Praise be to Allah, Who will soon show you His Signs, so that ye shall know them\"; and thy Lord is not unmindful of all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say [(O Muhammad SAW) to these polytheists and pagans etc.]: \"All the praises and thanks be to Allah. He will show you His Ayat (signs, in yourselves, and in the universe or punishments, etc.), and you shall recognise them. And your Lord is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: 'Praise belongs to Allah! He will show you His signs and you will recognize them. Your Lord is not inattentive of what you do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, “Praise belongs to God; He will show you His signs, and you will recognize them. Your Lord is not heedless of what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, \"[All] praise is [due] to Allah. He will show you His signs, and you will recognize them. And your Lord is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:93] And say: ‘Praise be to God. He will show you His signs and you will recognise them. Thus on the day of Badr God showed them how it was to be killed, to be taken prisoner and to be beaten by the angels on their faces and backs; and God hastened on for them the [punishment of the] Fire. And your Lord is not oblivious of what they do’ (ya‘malūna; or [read] ta‘malūna, ‘[what] you do’) but grants them respite until their [appointed] time [of requital]. Meccan, except verses 52 to 55, which are Medinese, and verse 85, which was revealed at al-Juhfa during the Hijra; it consists of 88 verses, revealed after [sūrat] al-Naml.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "435 Allah then commanded him to fight, saying: (And say) Muhammad: (Praise be to Allah) gratitude and divine Oneness are Allah's (who will show you His portents) the signs of His divine Oneness and power by inflicting torment upon you on the Day of Badr (so that ye shall know them) so that you shall know that what Muhammad (pbuh) tells you is true. (And your Lord is not unaware) oblivious (of what ye do) in your state of disbelief and idolatry. The reference here is to the disbelievers of Quraysh. This can also be considered a threat from Allah to them because of their disbelief and idolatry; it is also said that this means: Allah will not forgo the torment you deserve for your acts of plotting, treachery and corruption'. And of the surah in which the stories are mentioned, which is all Meccan-except for Allah's saying: (Lo! He Who hath given thee the Qur'an for a law will surely bring you again to the place of return. Say: My Lord is best aware of he who bringeth guidance and him who is in error manifest) which was revealed in al-Juhfah, between Mecca and Medina-and consists of 88 verses, 441 words and 5,800 letters: Surah 28: The Story (al-Qasas) And of the surah in which the stories are mentioned, which is all Meccan-except for Allah's saying: (Lo! He Who hath given thee the Qur'an for a law will surely bring you again to the place of return. Say: My Lord is best aware of he who bringeth guidance and him who is in error manifest) which was revealed in al-Juhfah, between Mecca and Medina- and consists of 88 verses, 441 words and 5,800 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أمرنن ربي بهذه المأمورات المذكورة أمرني بتجديد التحميد على تبليغ ما أُحيت به بقوله: { قُلِ } بعدما تلوت عليهم ما تلونا عليك { ٱلْحَمْدُ للَّهِ } على ما علمني ربي من الحقائق والمعارف\n وشرفني بأنواع المكاشفات والمشاهدات\n ويسر عليَّ تبليغ ما أوحي إليَّ\n وأُمرت بتبليغه إلى قاطبة الأنام\n وإن أعرضوا عن قبول ما بلغت لهم من مصالح دينهم في النشأة الأولى والأخرى\n\n\nقل لهم على سبيل التهديد: { سَيُرِيكُمْ } سبحانه في النشأة الأخرى وقيام الساعة الموعودة صدق { آيَاتِهِ } الدالة على عظمة ذاته\n المتينة لمواعيده ووعيداته { فَتَعْرِفُونَهَا } حنيئذٍ\n وتسمعونها سمع قبول ورضا\n ولا يجديكم قبولها حينئذٍ نفعاً وفائدة\n إذ قد مضى وقت الإرشاد والامتثال بها\n والعمل بمقتضاها { وَ } بعدما بلغت لهم ما بلغت يا أكمل الرسل لا تبالِ بإعراضهم وإنكارهم\n إذ { مَا رَبُّكَ } المطلع بالسرائر والخفايا { بِغَافِلٍ } ذاهل { عَمَّا تَعْمَلُونَ } [النمل: 93] من الرد والقبول بعدما سمعوا منك وفهموا معناه\n يجازيهم على مقتضى إطلاعه وعلمه\n\nرنبا اشرح لنا صدورنا بتأمل آياتك المنزلة من عندك\n ويسِّر لنا أمورنا بأن نمتثل بمقتضاها بفضلك وجودك\n\n\nخاتمة السورة\n\nعليك أيها المحمدي المواظب على تلاوة كتاب الله اللازم للاسترشاد والاستهداء منه أن تلاحظ أولاً منطوقات ألفاظه المفردة\n ثمَّ مفهومات الكلام المركب مها\n ثمَّ التأمل والتدبر في رعاية المطابقة لمقتضيات الأحوال الموردة لأجلها\n ثمَّ لتعمق في الأساليب والأغراض المسوقة لها الكلام\n ثمَّ سرائر الأوامر والنواهي الموردة فيها\n والعبر والأمثال المشتملة عليها الكلام\n ثمَّ الحكم والمصالح الباعثة لإيراد الكلام على وجهها\n ثمَّ التفطن والتنبه من النظم المتلو المقروء على المعارف والحقائق\n والمكاشفات والمشاهدات التي هي العلل الغائية لإنشائه\n والأسرار الباعثة لنظم كلماته وتأليف حروفه\n\n\nوعليك أيها الفطن الخبير أن تدرك أن\n \" للقرآن ظهراً وبطناً\n ولبطنه بطناً إلى سبعة أبطن \" \nعلى ما نطق به الحديث الصحيح\n صلوات الله على قائله وسلامه\n\n\nوإياك إياك أن تقنع منه بألفاظه ومنطوقاته التي تعرفها عوام العرب\n أو تقنع منه بالخواص والمزايا التي تعرفها أرباب اللسن منهم\n بل لك أن تلاحظ على الوجه المذكور إلى أن صار علمك المتعلق به لدنياً ذوقياً خالياً\n بحيث تسمعه من قلبك\n وتفهمه بقلبك بلا وسائل الألفاظ والحروف الجارية على لسانك\n إذ الألفاظ والحروف إنما هي من جملة الحجب الغليظة عند أولي الألباب الناظرين في لب القرآن\n فحينئذٍ فزت بحظك منه\n ونلت نصيبك من هدايته وإرشاده\n\n\nربِّ هب لي بفظلك من خزائن جودك التي أودعتها في كتابك الكريم\n إنك أنت الوهاب الملهم بالخير والصواب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقل الحمدُ لله } على ما أفاض عليّ من نعمائه\n التي أجلُها نعمة النبوة\n المستتبعة لفنون النعم الدينية والدنيوية\n ووفقني لتحمل أعبائها\n وتبليغ أحكامها إلى كافة الورى\n بالآيات البينة والبراهين النيرة\n { سيُريكُم آياته } قطعاً في الدنيا\n التي وعدكم بها\n كخروج الدابة وسائر الأشراط\n { فتعرفونها } أي: فتعرفون أنها آيات الله\n حين لا تنفعكم المعرفة\n أو: سيضطركم إلى معرفة آياته\n والإقرار بأنها آيات الله حين ظهورها\n { وما ربك بغافل عما تعملون } \n بل محيط بعمل المهتدي والضال\n غير غافل\n فيجازي كلاًّ بما يستحقه\n\nوتخصيص الخطاب أولاً به - عليه الصلاة والسلام - وتعميمه ثانياً للكفرة تغليباً\n أي: وما ربك بغافل عما تعمل أنت من الحسنات وما تعملون أنتم - أيها الكفرة - من السيئات\n فيجازي كلاً بعمله\n ومن قرأ بالغيب فهو وعيد محض\n أي: وما ربك بغافل عن أعمالهم\n فسيعذبهم ألبتة\n فلا يحسبوا أن تأخير عذابهم لغفلته تعالى عن أعمالهم\n بل يمهل ولا يهمل\n والله تعالى أعلم\n الإشارة: إذا فرغ الواعظ من وعظه وتذكيره\n أو: العالم من تدريسه وتعليمه\n أقبل على عبادة ربه\n إما عبادة الجوارح الظاهرة\n من صلاة وذكر وتلاوة\n أو عبادة القلوب\n كتفكر واعتبار\n أو استخراج علوم وحكم ودُرر\n وإما عبادة الأرواح\n كنظرة وفكرة وشهود واستبصار\n وهذه عبادة الفحول من الرجال\n فمن اهتدى إليها فلنفسه\n ومن ضل عنها فقل إنما أنا من المنذرين\n والحمد لله رب العالمين - وصلى الله على سيدنا محمد وآله وصحبه وسلم تسليماً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:6",
      "similarity": 0.4480893646269397
    },
    {
      "verse": "6:132",
      "similarity": 0.424925495030278
    },
    {
      "verse": "11:123",
      "similarity": 0.4157461770223701
    },
    {
      "verse": "30:7",
      "similarity": 0.4122480520401196
    },
    {
      "verse": "10:29",
      "similarity": 0.4037738771837004
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/27:93.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/27:93.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/27:93.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}