{
  "chapter": "القصص",
  "text": "ولما بلغ اشده واستوى ءاتينه حكما وعلما وكذلك نجزى المحسنين",
  "translations": [
    {
      "translation": "And when he reached his full strength and maturity, We gave him judgement and knowledge. That is how We recompense good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had grown up to full maturity, We gave him wisdom and knowledge. Thus do We recompense the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses reached the age of full youth and grew to maturity, We bestowed upon him wisdom and knowledge. Thus do We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he become matured and grow to manhood, We granted him wisdom and knowledge. Thus do We reward the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached his maturity and full strength, We gave him wisdom and knowledge; and this is how We reward the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached maturity, and was complete, We bestowed on him Hukm and knowledge. And thus do We reward the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained his maturity and became full grown, We granted him wisdom and knowledge; and thus do We reward those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he was fully grown and in the perfection of his strength, We gave him judgment and knowledge; even so do We recompense the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached his full strength and was ripe, We gave him wisdom and knowledge. Thus do We reward the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses reached full manhood and maturity, We bestowed upon him wisdom and knowledge: this is how We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained his full strength and became firm, We vouchsafed unto him wisdom and knowledge; and Thus We reward the well- doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came of age and became fully matured, We gave him judgement and knowledge, and thus do We reward the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reached full age, and was firmly established (in life), We bestowed on him wisdom and knowledge: for thus do We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained his full strength, and was perfect (in manhood), We bestowed on him Hukman (Prophethood, right judgement of the affairs) and religious knowledge [of the religion of his forefathers i.e. Islamic Monotheism]. And thus do We reward the Muhsinun (i.e. good doers - see the footnote of V. 9:120).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he was full grown, and reached the perfection of his strength, We gave him judgment and knowledge. As such We recompense the gooddoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached his maturity, and became established, We gave him wisdom and knowledge. Thus do We reward the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained his full strength and was [mentally] mature, We bestowed upon him judgement and knowledge. And thus do We reward the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:14] And when he came of age, namely, at 30 or 33, and [then] was [fully] mature, that is, when he reached the age of 40, We gave him judgement, wisdom, and knowledge, comprehension of religious matters before he was sent as a prophet. And so, just as We rewarded him, do We reward those are virtuous, to their own souls.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he reached his full strength) 18 years of age (and was ripe) he reached his 40th year, (We gave him wisdom) understanding (and knowledge) prophethood. (Thus do We reward the good) i.e. the prophets by bestowing upon them understanding and prophethood; it is also said that this means: thus do We reward the righteous by bestowing upon them knowledge and wisdom. 437\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولما بلغ أشدّه } أي: مقام الفتوّة وكمال الفطرة { واستوى } استقام بحصول كماله ثم بتجرّده عن النفس وصفاته { آتيناه حكماً وعلماً } أي: حكمة نظرية وعملية { وكذلك نجزي المحسنين } المتّصفين بالفضائل\n السائرين في طريق العدالة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا } ربته أمه\n وأحسنت تربيته بمعاونة عدوه إلى أن { بَلَغَ أَشُدَّهُ } كمال قوته في نشوئه ونمائه { وَٱسْتَوَىٰ } أي: كمل وتم عقله ورشده إلى أن صلح لحمل أعباء الرسالة { آتَيْنَاهُ } من كمال جودنا إيفاءً لما وعدنا له في سابق علمنا\n وكتبنا لأجله في لوح قضائنا { حُكْماً } نبوة ورسالة\n ليضبط به ظواهر الأحكام بين الأنام { وَعِلْماً } لدنياً متعلقاً بمعرفة ذات الحق المتصف بجلائل الأوصاف والأسماء\n وبمعرفة توحيده وتنزهه عن سمة الكثرة مطلقاً { وَكَذَلِكَ } أي: مثل ما جزينا موسى { نَجْزِي } عموم { ٱلْمُحْسِنِينَ } [القصص: 14] من خلَّص عبادنا البالغين رتبة الإحسان\n لأنهم يعبدون الله كأنهم يرونه\n إنما أتى بلفظ الماضي مع أنه إنما أُرسل بعدما هاجر من بينهم إلى مدين تلميذ شعيب عليه السلام تنبيهاً على تحقق وقوعه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:22",
      "similarity": 0.9048057604971199
    },
    {
      "verse": "37:110",
      "similarity": 0.4373701706966851
    },
    {
      "verse": "37:80",
      "similarity": 0.4349316142146068
    },
    {
      "verse": "37:121",
      "similarity": 0.4349316142146068
    },
    {
      "verse": "37:131",
      "similarity": 0.4349316142146068
    }
  ]
}