{
  "chapter": "القصص",
  "text": "فرددنه الى امه كى تقر عينها ولا تحزن ولتعلم ان وعد الله حق ولكن اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "That is how We returned him to his mother so that she might delight her eyes and feel no grief and so that she would know that Allah's promise is true. But most of them do not know this.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We restored him to his mother that she may be tranquil and not grieve, and know that the promise of God is true, though most men do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We restore Moses to his mother that her eyes might be comforted and she might not grieve, and realise that the promise of Allah was true. But most people are unaware of this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We return Moses to his mother that We would delight her eyes, relieve her sorrows, and let her know that the promise of God was true, but many people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We returned him to his mother in order to soothe her eyes and not grieve, and to know that Allah’s promise is true – but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We restored him to his mother, that her eye might be comforted, and that she might not grieve, and that she might know that the promise of Allah is true. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We gave him back to his mother that her eye might be refreshed, and that she might no grieve, and that she might know that the promise of Allah is true, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We returned him to his mother, that she might be comforted and not sorrow, and that she might know that the promise of God is true; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We restored him to his mother that she might be comforted and not grieve, and that she might know that the promise of Allah is true. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We restored him to his mother, so that she might be comforted and not grieve any more, and so that she would know that God's promise was true. But most of them do not realize this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We restored him unto his mother that she might be comforted and not grieve, and that she might know that the promise of Allah is true. Yet most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We restored him to his mother so that she might be comforted and not grieve, and that she might know that Allah’s promise is true, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We restore him to his mother, that her eye might be comforted, that she might not grieve, and that she might know that the promise of Allah is true: but most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So did We restore him to his mother, that she might be delighted, and that she might not grieve, and that she might know that the Promise of Allah is true. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We restored him to his mother, so that she might be comforted and not sorrow, and that she might know that the promise of Allah is true. Yet most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We returned him to his mother, that she may be comforted, and not grieve, and know that God’s promise is true. But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We restored him to his mother that she might be content and not grieve and that she would know that the promise of Allah is true. But most of the people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:13] Thus We restored him to his mother so that her eyes might delight, in seeing him [again], and not grieve, thereat, and that she might know that God’s promise, to restore him to her, is true; but most of them, that is, the people, do not know, about this promise, or of the fact that this was his sister and the other was his mother. He [Moses] remained with her until he was weaned during which time she was paid wages at one dinar per day. She took this because it was money from enemy territory (harbī). She then brought him [back] to Pharaoh in whose household he was raised, as God recounts of him in sūrat al-Shu‘arā’ [Q. 26:18], Did we not rear you among us as a child, and did you not stay with us for years of your life?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So We restored him to his mother that she might be comforted) by having Moses (and not grieve) over him, (and that she might know that the promise of Allah) to bring him back to her (is true. But most of them) the people of Egypt (know not) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكما قال سبحانه: { فَرَدَدْنَاهُ } في يوم إلقائه في البحر { إِلَىٰ أُمِّهِ } إيفاءً لوعدنا إياها { كَيْ تَقَرَّ } وتنور { عَيْنُهَا } بولدها { وَ } بعدما رددناه إليها ألهمنا لها أن { لاَ تَحْزَنَ } بعد اليوم\n وتثق بوعدنا إياك { وَلِتَعْلَمَ أَنَّ وَعْدَ ٱللَّهِ } القادر على إيفاء العهدو { حَقٌّ } ثابت مطابق للواقع\n فكما أوفى سبحانه وعد رده إليك يوفي وعد رسالته ونبوته أيضاً بلا خلف منه\n فعليك أن تثقي بالله وتفوضي أمره إليه\n فإنه سبحانه يكفي مؤونة شرور أعدائه ويوصل إلى منتهى ما جبله لأجله\n إذ هو قادر غالب على كل ما أراد وشاء { وَلَـٰكِنَّ أَكْثَرَهُمْ } أي: أكثر الناس { لاَ يَعْلَمُونَ } [القصص: 13] كمال قدرته وحكمته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تحزن } لفراقه\n { ولِتَعْلَمَ أن وعْدَ الله حقٌ } \n أي: وليثبت علمها مشاهدة\n كما ثبت علماً\n وأما جزعها وحيرتها فذلك من الطبع البشري الجِبِلِّيِّ\n اللازم لضعف البشرية\n لا ينجو منه إلا خواص الخواص\n وإنما حل لها ما تأخذه من الدينار في اليوم\n كما قال السدي: لأنه مال حربي\n لا أنه أجرة إرضاع ولدها\n { ولكن أكثرهم } أي: القبط\n أو الناس جملة\n { لا يعلمون } أن ما وعد الله لا بد من إنجازه\n ولو بعد حين\n وهو داخل تحت علمها\n أي: لتعلم أن وعد الله حق\n ولتعلم أن أكثر الناس لا يعلمون فيرتابون فيه\n وفيه التعريض بما فرط منها حين سمعت بوقوع موسى في يد فرعون\n فجزعت\n وهذا من الطبع البشري كما تقدم\n وأيضاً يجوز أن يكون الوعد منوطاً بشروط وأسباب\n قد لا تعرفها\n فلذلك لم ينفك خوفها\n والله تعالى أعلم\n الإشارة: وحرمنا على الإنسان المراضع\n من لبان الخمرة الأزلية\n من قبل أن نلقيه بأهلها\n فقالت له العناية السابقة: هل أدلك على أهل بيت الحضرة يكفلونك من رعونات البشرية\n والهفوات القلبية\n وهي الإصرار على المساوئ والذنوب\n ويرضعونك من لبن الخمرة الأزلية\n وهم لك ناصحون\n يدلونك على الله ولا يدلونك على غيره فإن من دلك على الله فقد نصحك\n ومن دلَّك على العمل فقد أتعبك\n ومن دلك على الدنيا فقد غشك\n فرددناه إلى أمه\n وهي الحضرة القدسية\n التي خرج منها\n بمتابعة شهوته وغفلته\n كي تقر عين روحه بمشاهدة حبيبها\n ولا تحزن على فوات شيء\n إذ لَم تفقد شيئاً\n حيث وجدت الله تعالى \" مَاذَا فَقَدَ مَنْ وَجَدَكَ؟ وما الذي وَجَدَ من فَقَدَكَ؟ \"\n ولتعلم أن وعد الله بالفتح على من توجه إليه بالواسطة حق\n ولكن أكثر أهل الغفلة لا يعلمون ثم ذكر سبب خروج موسى من مصر\n فقال: { وَلَمَّا بَلَغَ أَشُدَّهُ وَٱسْتَوَىٰ آتَيْنَاهُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:33",
      "similarity": 0.6187268687230094
    },
    {
      "verse": "16:70",
      "similarity": 0.3545204918886932
    },
    {
      "verse": "20:40",
      "similarity": 0.35089310756302383
    },
    {
      "verse": "32:17",
      "similarity": 0.2848710129934042
    },
    {
      "verse": "25:74",
      "similarity": 0.2804145802709145
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/28:13.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/28:13.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/28:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}