{
  "chapter": "القصص",
  "text": "قال رب بما انعمت على فلن اكون ظهيرا للمجرمين",
  "translations": [
    {
      "translation": "He said, 'My Lord, because of Your blessing to me, I will never be a supporter of evildoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: \"O Lord, as You have been gracious to me I will never aid the guilty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Moses vowed: \"My Lord, because of the favour that You have done me I shall never support the guilty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Lord, in appreciation for Your favor to me I shall never support the criminals\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! The way You have bestowed favour upon me, so never will I be a supporter of the guilty.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! For that with which You have favored me, I will nevermore be a helper of the criminals!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! because Thou hast bestowed a favor on me, I shall never be a backer of the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'My Lord, forasmuch as Thou hast blessed me, I will never be a partisan of the sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Forasmuch as Thou hast favoured me, I will nevermore be a supporter of the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, because of the favour that You have shown me, I vow that I will never be a helper of the guilty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! whereas Thou hast favoured me, I shall nevermore be a supporter of the culprits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! As You have blessed me, I will never be a supporter of the guilty.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! For that Thou hast bestowed Thy Grace on me, never shall I be a help to those who sin!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! For that with which You have favoured me, I will never more be a helper for the Mujrimun (criminals, disobedient to Allah, polytheists, sinners, etc.)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'My Lord as You have favored me, I will never be a helper to the wrongdoer'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, in as much as you have favored me, I will never be a supporter of the criminals.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:17]   He said, ‘My Lord, forasmuch as You have been gracious to me, with forgiveness, protect me [so], I will never be a partisan, a supporter, of the criminals’, the disbelievers henceforth, if you were to protect me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِلْمُجْرِمِينَ (17)إعادة { قال } أفاد تأكيداً لفعل { قال رب إني ظلمت نفسي } \\[ القصص : 16 \\] . أعيد القول للتنبيه على اتصال كلام موسى حيث وقع الفصل بينه بجملتي { فغفر له إنه هو الغفور الرحيم } \\[ القصص : 16 \\] . ونظم الكلام : قال رب إني ظلمت نفسي فاغفر لي ، رب بما أنعمت فلن أكون ظهيراً للمجرمين ، وليس قوله { قال رب بما أنعمت علي } مستأنفاً عن قوله { فغفر له } \\[ القصص : 16 \\] لأن موسى لم يعلم أن الله غفر له إذ لم يكن يوحى إليه يومئذ .والباء للسببية في { بما أنعمت علي } و ( ما ) موصولة وحذف العائد من الصلة لأنه ضمير مجرور بمثل ما جرّ به الموصول ، والحذف في مثله كثير . والتقدير : بالذي أنعمت به عليّ . ويجوز أن تكون ( ما ) مصدرية وما صدق الإنعام عليه ، هو ما أوتيه من الحكمة والعلم فتميزت عنده الحقائق ولم يبق للعوائد والتقاليد تأثير على شعوره . فأصبح لا ينظر الأشياء إلا بعين الحقيقة ، ومن ذلك أن لا يكون ظهيراً وعوناً للمجرمين .وأراد بالمجرمين من يتوسم منهم الإجرام ، وأراد بهم الذين يستذلون الناس ويظلمونهم لأن القبطي أذل الإسرائيلي بغصبه على تحميله الحطب دون رضاه .ولعل هذا الكلام ساقه مساق الاعتبار عن قتله القبطي وثوقاً بأنه قتله خطأ .واقتران جملة { فلن أكون ظهيراً للمجرمين } بالفاء لأن الموصول كثيراً ما يعامل معاملة اسم الشرط فيقترن خبره ومتعلقه بالفاء تشبيهاً له بجزاء الشرط وخاصة إذا كان الموصول مجروراً مقدّماً فإن المجرور المقدّم قد يقصد به معنى الشرطية فيعامل معاملة الشرط كقوله في الحديث ( كما تكونوا يول عليكم ) بجزم ( تكونوا ) وإعطائه جواباً مجزوماً . والظهير : النصير .وقد دل هذا النظم على أن موسى أراد أن يجعل عدم مظاهرته للمجرمين جزاء على نعمة الحكمة والعلم بأن جعل شكر تلك النعمة الانتصار للحق وتغيير الباطل لأنه إذا لم يغير الباطل والمنكر وأقرهما فقد صانع فاعلهما ، والمصانعة مظاهرة . ومما يؤيد هذا التفسير أن موسى لما أصبح من الغد فوجد الرجل الذي استصرخه في أمسه يستصرخه على قبطي آخر أراد أن يبطش بالقبطي وفاء بوعده ربه إذ قال { فلن أكون ظهيراً للمجرمين } لأن القبطي مشرك بالله والإسرائيلي موحِّد .وقد جعل جمهور من السلف هذه الآية حجة على منع إعانة أهل الجور في شيء من أمورهم . ولعل وجه الاحتجاج بها أن الله حكاها عن موسى في معرض التنويه به فاقتضى ذلك أنه من القول الحق .\n\n",
      "translations": [
        {
          "translation": "(He said: My Lord! Forasmuch as Thou hast favoured me) with knowledge and the profession of Your divine Oneness and forgiveness, (I will nevermore be a supporter of the guilty) do not make me a helper to the idolaters: Pharaoh and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَنْ أَكُونَ ظَهِيراً لِّلْمُجْرِمِينَ } معناه مُعينٌ لَهُم\n\n",
      "translations": [
        {
          "translation": " And his saying, {But I will not be an advocate for the criminals} [means that] he is {specifically} for them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } مقسماً: { رَبِّ } يا من رباني بأنواع الكرامات أقسمت { بِمَآ أَنْعَمْتَ عَلَيَّ } من النعم العظام { فَلَنْ أَكُونَ } بعد اليوم { ظَهِيراً } مغيثاً ومعيناً { لِّلْمُجْرِمِينَ } [القصص: 17] الذين أدت إغاثتهم إلى جرم كبير وذنب عظيم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:41",
      "similarity": 0.42122731781928924
    },
    {
      "verse": "15:58",
      "similarity": 0.41106603130557257
    },
    {
      "verse": "51:32",
      "similarity": 0.41106603130557257
    },
    {
      "verse": "26:99",
      "similarity": 0.4035566960722868
    },
    {
      "verse": "44:22",
      "similarity": 0.4007230154977629
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}