{
  "chapter": "القصص",
  "text": "واصبح فؤاد ام موسى فرغا ان كادت لتبدى به لولا ان ربطنا على قلبها لتكون من المؤمنين",
  "translations": [
    {
      "translation": "Musa's mother felt a great emptiness in her heart and she almost gave him away; only We fortified her heart so that she would be one of the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mother of Moses was perturbed in the morning. Had We not strengthened her heart to remain a believer she had almost given him away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the other hand, the heart of Moses' mother was sorely distressed. Had We not strengthened her heart that she might have full faith (in Our promise), she would have disclosed the secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heart of Moses' mother was relieved and confident. But she would almost have made the whole matter public had We not strengthened her heart with faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the morning, the heart of Moosa’s mother became impatient; and she would have almost certainly given away his secret had We not strengthened her heart, so that she may have faith in Our promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heart of the mother of Musa became empty. She was very near to disclose his (case), had We not strengthened her heart, so that she might remain as one of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heart of Musa's mother was free (from anxiety) she would have almost disclosed it had We not strengthened her heart so that she might be of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the morrow the heart of Moses\" mother became empty, and she wellnigh disclosed him had We not strengthened her heart, that she might be among the believers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heart of the mother of Moses became void, and she would have betrayed him if We had not fortified her heart, that she might be of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses' mother's heart was full of anxiety -- she would have disclosed his identity had We not strengthened her heart so that she might be a firm believer [in Our promise].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heart of the mother of Musa became void, and she had wellnigh disclosed him, had We not fortified her heart, that she might remain one of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heart of Moses’ mother became desolate, and indeed she was about to divulge it had We not fortified her heart so that she might have faith [in Allah’s promise].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there came to be a void in the heart of the mother of Moses: She was going almost to disclose his (case), had We not strengthened her heart (with faith), so that she might remain a (firm) believer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heart of the mother of Musa (Moses) became empty [from every thought, except the thought of Musa (Moses)]. She was very near to disclose his (case, i.e. the child is her son), had We not strengthened her heart (with Faith), so that she might remain as one of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the morning the heart of Moses' mother became empty. She would have revealed (who he was) had We not settled her heart so that she might be among the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heart of Moses’ mother became vacant. She was about to disclose him, had We not steadied her heart, that she may remain a believer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heart of Moses' mother became empty [of all else]. She was about to disclose [the matter concerning] him had We not bound fast her heart that she would be of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:10] And the heart of Moses’s mother, when she found out that they had picked him up, became empty, of everything other than him. Indeed (in, softened from the hardened form, its subject omitted, in other words [understand it as] innaha) she was about to expose him, that is, as being her son, had We not fortified her heart, with patience, that is, We made it at peace, that she might be of the believers, [of] those who have faith in God’s promise (the response to [the conditional] lawlā, ‘had … not’, is given by the preceding [statement]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the heart of the mother of Moses) Jochabed (became void) from the preoccupation or mention of anything other than Moses, (and she would have betrayed him) by admitting that Moses was her son after being adopted by Pharaoh (if We had not fortified her heart) with patience, (that she might be of the believers) in the promise of Allah that he will be one of the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَارِغاً } قالَ زيدُ بن علي عليهما السّلامُ: كان فارِغاً من كُلِّ شَيءٍ إلاّ من ذِكرِ مُوسى عَليه السّلامُ\n وقال: معنى فارغٌ أي فازعٌ\n\n\n\n\nوقوله تعالى: { إِن كَادَتْ لَتُبْدِي بِهِ } معناه لتَقول يَا موسى\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the Mother of Moses {became empty of everything except the memory of Moses}. Zayd ibn Ali said: \"She became empty of everything except the memory of Moses.\"\n And he said: \"The meaning of {empty} is {scared}\"\n\n\nAnd His saying, {Indeed, if it had been up to me, I would have let you see} [means]: O Moses, if it had been up to me, I would have let you see [me].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وأصبح فؤاد أمّ موسى } أي: النفس الساذجة اللوّامة { فارغاً } عن العقل من استيلاء فرعون عليها وخوفها منه لمقهوريتها له { إن كادت لتبدي به } أي: كادت تطيع النفس الأمّارة باطناً وظاهراً فلا تخالفها بسرها وما أضمرته من نور الاستعداد وحال موسى المخفي لكونه بالقوّة بعد { لولا أن ربطنا على قلبها } أي: صبّرناها وقوّيناها بالتأييد الروحي والإلهام الملكي { لتكون من المؤمنين } بالغيب لصفاء الاستعداد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد ألقائه في البحر { أَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَارِغاً } صفراً من العقل ومقتضياته\n وصارت قلقة حائرة هائمة\n بحيث اضمحلت عنها أمارات الحياة تحنناً إلى ولدها وشوقاً إليه\n وخوفاً من قتله\n سيما سمعت بالتقاط آل فرعون إياه ووقوعه بأيديهم { إِن كَادَتْ } أي: إنه صارت من غاية الحزن الأسف إلى أن قربت { لَتُبْدِي بِهِ } أي: لتظهر وتبوح بأمره صائحة عليه\n فاجعة في شأنه من التقاط عدوه { لَوْلاۤ أَن رَّبَطْنَا } وألقينا { عَلَىٰ قَلْبِهَا } السكينة والطمأنينة { لِتَكُونَ مِنَ ٱلْمُؤْمِنِينَ } [القصص: 10] المصدقين لما وعدنا إياها برد ولدها لها بلا ضر من العدو",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وأصبح } أي: صار: { فؤادُ أُمّ موسى فارِغاً } من كل شيء إلا مِن ذكر موسى وهمه\n أو: فارغاً: خالياً من العقل لِمَا دهمها من الجَزَع والحيرة\n حين سمعت بوقوعه في يد فرعون\n ويؤيده قراءة ابن محيصن: \" فزعاً \" بالزاي بلا ألف\n أو: فارغاً من الوحي الذي أوحي إليها أن تلقيه في اليم\n ناسياً للعهد أن يرده إليها\n لما دَهَمَهما من الوجد\n وقال لها الشيطان: يا أم موسى كرهتِ أن يقتل فرعون موسى وأغرقته أنتِ\n وبلغها أنه وقع في يد فرعون\n فعظم البلاء\n { إن كادتْ لتُبدِي به }: لتبوح به وتظهر شأنه وأنه وَلدها\n قيل: لما رأت الأمواج تلعب بالتابوت كادت تصيح وتقول: يا ابناه\n وقيل: لما سمعت أن فرعون أخذ التابوت لم تشك أنه يقتله\n فكادت تقول: يا ابناه شفقة عليه\n و \" أن \" مخففة\n أي: إنها كادت لتظهره { لولا أن ربطنا على قلبها }\n والربط: تقويته بإلهام الصبر والتثبيت\n { لتكون من المؤمنين }: من المصدقين بوعدنا\n وهو: { إنا رادوه إليك }\n وجواب \" لولا \": محذوف\n أي: لأبْدته\n أو: فارغاً من الهم\n حين سمعت أن فرعون تبناه\n إن كادت لتُبدي بأنه ولدها لأنها لم تملك نفسها فرحاً وسروراً مما سمعت\n لولا أن ربطنا على قلبها وثبتناه لتكون من المؤمنين الواثقين بعهد الله\n لا بتبني فرعون\n قال يوسف بن الحسن: أمرتُ أُم موسى بشيئين\n وبُشرت ببشارتين\n فلم ينفعها الكل\n حتى تولى الله حياطتها\n فربط على قلبها\n { وقال لأخته } مريم: { قُصّيهِ }: اتبعي أثره لتعلمي خبره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:200",
      "similarity": 0.48359746718565155
    },
    {
      "verse": "94:7",
      "similarity": 0.4272428633905271
    },
    {
      "verse": "55:31",
      "similarity": 0.4210740533479883
    },
    {
      "verse": "7:126",
      "similarity": 0.39843835835231617
    },
    {
      "verse": "8:60",
      "similarity": 0.36914283258749975
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}