{
  "chapter": "القصص",
  "text": "فلما ان اراد ان يبطش بالذى هو عدو لهما قال يموسى اتريد ان تقتلنى كما قتلت نفسۢا بالامس ان تريد الا ان تكون جبارا فى الارض وما تريد ان تكون من المصلحين",
  "translations": [
    {
      "translation": "But when he was about to grab the man who was their common enemy, he said, 'Musa! do you want to kill me just as you killed a person yesterday? You only want to be a tyrant in the land; you do not want to be a reformer.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as he was about to lay hands on the one who was their common enemy, he cried out: \"O Moses, do you want to kill me as you killed that person yesterday? You only want to be a tyrant in the land and no peacemaker.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses decided to lay his violent hands on the man belonging to the enemy, he cried out: \"Moses, do you intend to kill me as you killed a person yesterday?\" You simply want to live in the land as a tyrant, and do not wish to set things right.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses was about to attack their enemy, he said, \"Moses, do you want to kill me as you slew a soul the other day? Do you want to become a tyrant in the land, not a reformer?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Moosa wished to apprehend the man who was an enemy to them both, he said, “O Moosa! Do you wish to kill me the way you killed a man yesterday? You only wish to become a strict ruler in the land, and not to make reform.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he decided to seize the man who was an enemy to both of them, the man said: \"O Musa! Is it your intention to kill me as you killed a man yesterday Your aim is nothing but to become a tyrant in the land, and not to be one of those who do right.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he desired to seize him who was an enemy to them both, he said: O Musa! do you intend to kill me as you killed a person yesterday? You desire nothing but that you should be a tyrant in the land, and you do not desire to be of those who act aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he would have assaulted the man who was an enemy to them both, the man said, 'Moses, dost thou' desire to slay me, even as thou slewest a living 'soul yesterday? Thou only desirest to be a tyrant in the land; thou desirest not to be of them that put things right.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he would have fallen upon the man who was an enemy unto them both, he said: O Moses! Wouldst thou kill me as thou didst kill a person yesterday. Thou wouldst be nothing but a tyrant in the land, thou wouldst not be of the reformers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he wanted to catch the one who was an enemy to them both, the man said, \"Moses, do you want to kill me just as you killed a man yesterday? You only want to become a tyrant in the land; you do not want to set things right.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he sought to seize him who was an enemy unto them both, he said: O Musa wouldst thou slay me as thou didst slay a person yesterday? Thou seekest only to be a tyrant in the land, and thou seekest not to be of the reconcilers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he wanted to strike him who was an enemy of both of them, he said, ‘Moses, do you want to kill me, just like the one you killed yesterday? You only want to be a tyrant in the land, and you do not desire to be one who brings about reform.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he decided to lay hold of the man who was an enemy to both of them, that man said: \"O Moses! Is it thy intention to slay me as thou slewest a man yesterday? Thy intention is none other than to become a powerful violent man in the land, and not to be one who sets things right!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he decided to seize the man who was an enemy to both of them, the man said: \"O Musa (Moses)! Is it your intention to kill me as you killed a man yesterday? Your aim is nothing but to become a tyrant in the land, and not to be one of those who do right.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses was about to seize he who was the enemy of both of them, he said: 'Moses, would you kill me as you killed a living soul yesterday? You desire only to be a tyrant in the land, and you do not want to be among the reformers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As he was about to strike the one who was their enemy, he said, “O Moses, do you intend to kill me, as you killed someone yesterday? You only want to be a bully in the land, and do not want to be a peacemaker.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he wanted to strike the one who was an enemy to both of them, he said, \"O Moses, do you intend to kill me as you killed someone yesterday? You only want to be a tyrant in the land and do not want to be of the amenders.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:19] But when (fa-lammā an: an is extra) he was about to strike the man who was an enemy to both of them, to Moses and the one seeking his help, he, the one seeking help, supposing that Moses was about to strike him, because of what he [Moses] had said to him, said: ‘O Moses, do you want to slay me just as you slew a soul yesterday? You merely want to be a tyrant in the land, and you do not want to be of the reformers’. The Egyptian heard this and realised that the slayer had been Moses. Thus he hurried off to Pharaoh to inform him of this. Pharaoh then ordered slaughterers to slay Moses, and they set off in his direction.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he would have fallen upon the man who was an enemy unto them both) i.e. the Copt, (he said) i.e. the Israelite said: (0 Moses! Wouldst thou kill me) today (as thou didst kill a person) a Copt (yesterday. Thou wouldst be nothing but a tyrant) a murderer (in the land) of Egypt, (thou wouldst not be of the reformers) of the pious who enjoin good and forbid evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إنْ } ما { تريدُ إلا أن تكون جباراً } قتالاً بالغضب\n { في الأرض } أرض مصر\n { وما تريدُ أن تكون من المصلحين } في كظم الغيظ\n وقيل: القائل: { يا موسى أتريد\n\n\n } إلخ\n هو القبطي\n ولم يعلم أن موسى هو الذي قتل الرجل بالأمس\n ولكن لما قصد أن يمنعه من الإسرائيلي استدل على أن الذي قتل صاحب هذا الرجل بالأمس هو موسى\n فلما ذكر ذلك شاع في أفواه الناس أن موسى هو الذي قتل القبطي بالأمس\n فأمسك موسى عنه\n ثم أخبر فرعون بذلك فأمر بقتل موسى\n { وجاء رجلٌ من أقصى المدينة } من آخرها\n واسمه: \" حزقيل بن حبورا \" \n مؤمن آل فرعون\n وكان ابن عم فرعون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:130",
      "similarity": 0.5820566311442036
    },
    {
      "verse": "28:18",
      "similarity": 0.42090356980921656
    },
    {
      "verse": "85:12",
      "similarity": 0.3683938924011224
    },
    {
      "verse": "54:36",
      "similarity": 0.34415416315010067
    },
    {
      "verse": "44:16",
      "similarity": 0.33837627758977407
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}