{
  "chapter": "القصص",
  "text": "قال رب انى ظلمت نفسى فاغفر لى فغفر له انه هو الغفور الرحيم",
  "translations": [
    {
      "translation": "O Lord,\" he prayed, \"I have done wrong, forgive me.\" And God forgave him. Verily He is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he prayed: \"My Lord! I have indeed inflicted wrong on myself, so do forgive me,\" wherefore Allah forgave him for He is Ever Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said, \"Lord, I have wronged myself. Forgive me!\" The Lord forgave him; He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! I have indeed wronged my soul* therefore forgive me” – He therefore forgave him; indeed only He is the Oft Forgiving, the Most Merciful. (* By getting angry.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! Verily, I have wronged myself, so forgive me.\" Then He forgave him. Verily, He is the Oft-Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! surely I have done harm to myself, so do Thou protect me. So He protected him; surely He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'My Lord, I have wronged myself. Forgive me!' So God forgave him, for He is the All-forgiving, the All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Lo! I have wronged my soul, so forgive me. Then He forgave him. Lo! He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He prayed, \"Forgive me Lord, for I have sinned against my soul.\" God forgave him; for He is the Forgiving One, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! verily I have wronged my soul, so wherefore forgive me. So He forgave him. Verily He! He is the Forgiving, the Owner of Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! I have wronged myself. Forgive me!’ So He forgave him. Indeed, He is the All-forgiving, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He prayed: \"O my Lord! I have indeed wronged my soul! Do Thou then forgive me!\" So (Allah) forgave him: for He is the Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! Verily, I have wronged myself, so forgive me.\" Then He forgave him. Verily, He is the Oft-Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forgive me, my Lord, for I have wronged myself' and so He forgave him; for He is indeed the Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, I have wronged myself, so forgive me.” So He forgave him. He is the Forgiver, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, indeed I have wronged myself, so forgive me,\" and He forgave him. Indeed, He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:16] He said, remorsefully, ‘My Lord, I have indeed wronged myself, by killing him, so forgive me!’ So He forgave him. Truly He is the Forgiving, the Merciful, that is to say, the One Who has always possessed, and will always possess, these two attributes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: My Lord! Lo! I have wronged my soul) by killing a person, (so forgive me) my sin. (Then He forgave him. Lo! He is the Forgiving, the Merciful) towards he who repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى متضرعاً نحو الحق، آيباً إليه، تائباً عما صدر عنه، مناجياً له عن محض الندم: { رَبِّ } يا من رباني بأنواع اللطف والكرم بين يدي عدوي، وخلصني من البلية العاممة يمقتضى جودك { إِنِّي } بالإقدام على هذا الأمر الشنيع { ظَلَمْتُ نَفْسِي } وعرضتها لعذابك بالخروج عن مقتضى حدودك بقتل هذا الشخص بلا رخصة شرعية { فَٱغْفِرْ لِي } يا ربّ زلتي بعدما تبت إليك، ورجعت عن ذنبي نادماً، والتجأت إلى بابك راجياً { فَغَفَرَ لَهُ } ربه زلته بعدما رجع إليه مخلصاً { إِنَّهُ هُوَ ٱلْغَفُورُ } لذنوب عباده بعدما رجعوا نحوه متذللاً خائباً خاسراً { ٱلرَّحِيمُ } [القصص: 16] لهم يقبل توبتهم بعدما أخلصوا فيها، وبعدما تاب ورجع عمَّا عمل خطأً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال ربِّ } أي: يا رب { إني ظلمتُ نفسي } بفعل صار قتلاً { فاغفرْ لي } زلتي، { فَغَفَرَ له } زلته، { إنه هو الغفور } بإقالة الزلل، { الرحيم } بإزالة الخجل، { قال ربِّ بما أنعمت عليَّ } أي: بحق إنعامك عليّ بالمغفرة ولم تعاقبني { فلن أكون ظهيراً للمجرمين } أي: لا تجعلني أُعين على خطيئةَ، تَوَسل للعصمة بإنعامه عليه\n وقيل: إنه قسم حُذف جوابه، أي: أُقْسِمُ بإنعامك عليَّ بالمغفرة، إن عصمتني، فلن أكون ظهيراً للمجرمين، وأراد بمظاهرة المجرمين صُحْبَةَ فرعون، وانتظامَهُ في جملته، وتكثير سواده، حيث كان يركب معه كالولد مع الوالد\n قال ابن عطية: احتج أهل الفضل والعلم بهذه الآية في منع خدمة أهل الجور، ومَعُونتهم في شيء من أمورهم، ورأوا أنها تتناول ذلك\n هـ\n قال الْوُصَافِي لعطاء بن أبي رباح: إن لي أخاً يأخذ بقلمه، وإنما يكتب ما يدخل ويخرج، وله عيال، ولو ترك لاحتاج وَادّانَ\n فقال: من الرأس؟ فقال: خالد بن عبد الله، قال: أما تقرأ قول العبد الصالح: { ربّ بما أنعمتَ عليَّ فلن أكون ظهيراً للمجرمين } ، فإن الله عز وجل سيعينه\n هـ\n الإشارة: خصوصية الولاية كخصوصية النبوة، لا تُعطى، غَالِباً، إلا بعد بلوغ الأشد وكمال قوة العقل، وحصول الاستواء، وهو أن يستوي عنده المدح والذم، والعز والذل، والمنع والعطاء، والفقر والغنى، وتستوي حاله في القبض والبسط، والغضب والرضا، فإذا استوى في هذه الأمور آتاه الله حكماً وعلماً، وجزاه جزاء المحسنين وكتب شيخ شيخنا إلى بعض تلامذته: أمَّا بعد، فإن تورعت في أقوالك وأفعالك، وتوسعت في أخلاقك، حتى يستوي عندك من من يمدحك ويذمك، ويعطيك ويمنعك، ومن يؤذيك وينفعك، ومن يشدد عليك ويوسع، فلا أشك في كمالك\n\n\nهـ\n فإن قلت: لِمَ ذكر الحق، جَلَّ جلاله، الاستواء في حق سيدنا موسى، ولم يذكره في حق نبيه يوسف - عليهما السلام؟ فالجواب: أن سيدنا يوسف عليه السلام تربى في السجن وفي نار الجلال، وكل محنة تزيد تهذيباً وتدريباً، فما بلغ الأشد حتى وقع له كمال الاستواء، بخلاف سيدنا موسى عليه السلام فإنه تربى في العز والجمال، فاحتاج إلى تربية وتهذيب، بعد كمال الأشد، فلم يحصل له كمال الأدب إلا بعد الاستواء الذي يليق به، فلذلك ذكره حقه\n والله تعالى أعلم\n ثم قال تعالى: { فَأَصْبَحَ فِي ٱلْمَدِينَةِ خَآئِفاً\n\n\n }\n",
      "translations": []
    }
  ]
}