{
  "chapter": "القصص",
  "text": "وحرمنا عليه المراضع من قبل فقالت هل ادلكم على اهل بيت يكفلونه لكم وهم له نصحون",
  "translations": [
    {
      "translation": "We first made him refuse all wet-nurses, so she said, 'Shall I show you to a household who will feed him for you and be good to him?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made (Moses) refuse a wet nurse. So his sister said: \"Should I tell you of a household that could bring him up for you and take care of him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already forbidden the breasts of the nurses for the child. (So seeing the girl) said: \"Shall I direct you to the people of a household that will rear him with utter sincerity?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had decreed that the infant must not be breast-fed by any nurse besides his mother. His sister said to the people of the Pharaoh, \"May I show you a family who can nurse him for you with kindness?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already forbidden suckle-nurses for him, so she said, “Shall I show you a household that will nurse this child of yours, and they are his well-wishers?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already forbidden foster suckling mothers for him, until she said: \"Shall I direct you to a household who will rear him for you, and look after him in a good manner\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We ordained that he refused to suck any foster mother before, so she said: Shall I point out to you the people of a house who will take care of him for you, and they will be benevolent to him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We had forbidden to him aforetime to be suckled by any foster-mother; therefore she said, 'Shall I direct you to the people of a household who will take charge of him for you and look after him?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had before forbidden foster-mothers for him, so she said: Shall I show you a household who will rear him for you and take care of him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had already made him refuse all wet nurses. So his sister said to them, \"Shall I tell you of a family who will bring him up for you and take good care of him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had aforetime forbidden foster-mothers for him; so she said: shall direct you unto a household who will rear him for you and who will be unto him good counsellors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since before We had forbidden him to be suckled by any nurse. So she said, ‘Shall I show you a household that will take care of him for you and they will be his well-wishers?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we ordained that he refused suck at first, until (His sister came up and) said: \"Shall I point out to you the people of a house that will nourish and bring him up for you and be sincerely attached to him?\"...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already forbidden (other) foster suckling mothers for him, until she (his sister came up and) said: \"Shall I direct you to a household who will rear him for you, and sincerely they will look after him in a good manner?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had forbidden to him before that he should be suckled by foster mothers, therefore she (Moses' sister) said (to them): 'Shall I direct you to a people of a household who will take charge of him for you and advise him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We forbade him breastfeeding at first. So she said, “Shall I tell you about a family that can raise him for you, and will look after him?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had prevented from him [all] wet nurses before, so she said, \"Shall I direct you to a household that will be responsible for him for you while they are to him [for his upbringing] sincere?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:12] And We had forbidden him to [take to the breasts of] fostermothers from before, that is to say, we prevented him from taking to the breasts of any suckling mother other than his own mother. Therefore he would not accept the breasts of any of the foster-mothers brought for him. So she, his sister, said, ‘Shall I show you a household — having seen their affection for him — who will take care of him for you, by having him suckled and so on, and who will act in good faith towards him?’ (the [suffixed] pronoun in lahu has been interpreted as referring to the king, as a response to them [when they asked Mary how she could be sure]). Her suggestion was accepted. So she brought his mother and he took to her breast. She explained to them that he had taken to her [breast] because of her pleasant scent and the wholesome taste of her milk. Permission was given to her to breast-feed him in her own house and so she returned with him, just as God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We had before forbidden foster-mothers) the milk of foster-mothers (for him) for Moses, (so she said) the sister of Moses said to the entourage of Pharaoh: (Shall I show you a household who will rear him) Moses (for you and take care of him) and she directed them to her mother?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قد كنا من متانة حكمنا وحكمتنا { حَرَّمْنَا عَلَيْهِ ٱلْمَرَاضِعَ مِن قَبْلُ } أي: قبل إلقائه أمه في البحر، وحين عهدنا مع أمه برده إياها بقولنا:\n\n[القصص: 7] فأحضروا مراضع كثيرة فأبى موسى عن مصهن، فتحيروا في أمره { فَقَالَتْ } مريم بعدما انتهزت فرصة: { هَلْ أَدُلُّكُمْ عَلَىٰ أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ } إن ابتغيتم المرضعة { وَهُمْ } أي: أهل ذلك البيت { لَهُ نَاصِحُونَ } [القصص: 12] إلى أن كبر، بحيث لا يغفل من تربيته وحفظه\n\n\n\n\nفلما سمع هامان منها ما سمع قال: إنها قد عرفت أهله ومنشأه، خذوها حتى تخبر ما حاله؟ قالت مريم: إنما أردت، وهم للملك ناصحون فأمرها فرعون بإتيانها، فأتت بأمها وموسى على يدي فرعون يبيكي ويصيح، فلما شم ريح أمه استأنس، والتقم ثديها ومص بلا إباءٍ، فقال لها فرعون: من أنت منه فقد أبى كل ثدي إلا ثديك؟ فقالت: إني امرأة طيبة الريح واللبن، لا أوتي بصبي إلا قبلني، فدفعه إليها وعيَّن أجرة حضانتها ورضاعتها، فذهب به إلى بيتها من يومه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:40",
      "similarity": 0.37043782610426385
    },
    {
      "verse": "28:7",
      "similarity": 0.3702559095640157
    },
    {
      "verse": "61:10",
      "similarity": 0.3261679823665397
    },
    {
      "verse": "65:6",
      "similarity": 0.31039340295637086
    },
    {
      "verse": "25:45",
      "similarity": 0.3094902183022187
    }
  ]
}