{
  "chapter": "القصص",
  "text": "قالت احدىهما يابت استـجره ان خير من استـجرت القوى الامين",
  "translations": [
    {
      "translation": "Said one of the maidens: \"O father, employ him. Surely the best (man) to employ is one who is strong and honest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the two women said: \"Father, employ this man in your service. The best whom you might employ is he who is strong and trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the women said to her father, \"Father, hire him; the best whom you may hire is a strong and trustworthy one.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the two women said, “O my father! Employ him – indeed a strong and trustworthy employee is better.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said one of them (the two women): \"O my father! Hire him! Verily, the best of men for you to hire is the strong, the trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said one of them: O my father! employ him, surely the best of those that you can employ is the strong man, the faithful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said one of the two women, 'Father, hire him; surely the best man thou canst hire is the one strong and trusty.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the two women said: O my father! Hire him! For the best (man) that thou canst hire in the strong, the trustworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the girls said, \"Father, hire him! For the best man to hire is someone strong and trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said one of the twain: O my father! hire him, for the best that thou canst hire is the strong and trustworthy one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the two women said, ‘Father, hire him. Indeed the best you can hire is a powerful and trustworthy man.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said one of the (damsels): \"O my (dear) father! engage him on wages: truly the best of men for thee to employ is the (man) who is strong and trusty\"....\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said one of them (the two women): \"O my father! Hire him! Verily, the best of men for you to hire is the strong, the trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the two women said: 'Father, hire him. The best who you can hire, is the strong, the honest'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the two women said, “Father, hire him; the best employee for you is the strong and trustworthy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the women said, \"O my father, hire him. Indeed, the best one you can hire is the strong and the trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:26] One of the two women, the one that had been sent [by her father], either the elder or the younger, said, ‘O my father, hire him, employ him in return for a wage, that he may tend our flock instead of us. Surely the best [man] you can hire is the strong, the trustworthy man’, in other words, hire him on account of his strength and trustworthiness. He [Shu‘ayb] asked her about him and she told him, as mentioned above, how he had lifted the rock off the well and that he had said to her, ‘Walk behind me’, in addition to his lowering his head when he realised that she was coming towards him, refusing to lift it [until she left]. He [Shu‘ayb] therefore was keen to have him marry [one of his daughters].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(One of the two women said) the youngest of the two women said: (0 my father! Hire him! For the best (man) that thou canst hire is the strong) who can bear a heavy load, (the trustworthy) regarding that with which you entrust him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قالت إحداهما يا أبت استأجره } أي: استعمله بالمجاهدة في الله والمراقبة لحاله في رعاية أغنام القوى حتى لا تنتشر فتفسد جمعيتنا وتشوّش فرقتنا، وبالذكر القلبي في مقام تجليات الصفات والسير فيها بأجره ثواب التجليات وعلوم المكاشفات { إن خير من استأجرت } لهذا العمل { القويّ } على كسب الكمال { الأمين } الذي لا يخون عهد الله بالوفاء بإبرازها في الاستعداد من وديعته أو لا يخون الروح بالميل إلى بناته فيحتجب بالمعقول\n وقد قيل: إن الرعاة كانوا يضعون على رأس البئر حجراً لا يقله إلا سبعة رجال، وقيل عشرة، فأقله وحده وذلك قوته\n وفيها إشارة إلى أن العلم اللدني لا يحصل إلا بالاتّصاف بالصفات السبع الإلهية أو العشر\n { قال إني أريد أن أنكحك إحدى ابنتيّ هاتين } أي: أجعلها تحتك، تحظى عندك بنور القدس وعلوم الكشف وتكون بحكمك وأمرك لا تحتجب عنك بقولها { على أن تأجرني ثماني حجج } أي: تعمل لأجلي بالمجاهدة حتى تأتي عليك ثمانية أطوار هي أطوار الصفات السبعة الإلهية بالفناء عن صفاته في صفات الله التي آخرها مقام المكالمة مع طور المشاهدة التي يتم بها الوصول المطلوبة بقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما جلس موسى عند شعيب - عليهما السلام - وقصَّ عليه ما جرى من الخوف والحزن وأنواع الكآبة { قَالَتْ إِحْدَاهُمَا } أي: إحدى الابنتين، وهي التي استدعته للضيافة: { يٰأَبَتِ ٱسْتَئْجِرْهُ } لرعي الغنم، وأنت تريد الأجير { إِنَّ خَيْرَ } جميع { مَنِ ٱسْتَئْجَرْتَ } من الرجال هو؛ لأنه { ٱلْقَوِيُّ } أي: شديد القوة { ٱلأَمِينُ } [القصص: 26] ذو الأمانة والديانة\n\n\n\n\nقال لها أبوها حمية وغيرة: من أين عرفت قوته وأمانته؟ فذكرت لأبيها إقلال الحجر العظيم وحده من رأس البئر مع أن الناس يقلونه في جمع كثير، فهذا دليل قوته، وأما أمانته فإني بعدما دعوته قام ومشى قدامي، وأمرني بالمشي خلفه، صيانةً عن النظر إلي، فقال لي: دليني عن الطريق إن ضللت، وهذا دليل أمانته وصيانته حدود الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}