{
  "chapter": "القصص",
  "text": "فخرج منها خائفا يترقب قال رب نجنى من القوم الظلمين",
  "translations": [
    {
      "translation": "So he left there fearful and on his guard, saying, 'My Lord, rescue me from the people of the wrongdoers!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left the city, fearful and hesitant, (and) prayed: \"O Lord, deliver me from these wicked people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon after hearing this Moses departed in a state of fear, looking around as one in apprehension and prayed: \"My Lord, deliver me from these unjust people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left the city afraid and cautious, saying, \"Lord, protect me against the unjust people\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left the city in fear, waiting to see what happens; he said, “My Lord! Rescue me from the unjust people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he escaped from there, looking about in a state of fear. He said: \"My Lord! Save me from the people who are wrongdoers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went forth therefrom, fearing, awaiting, (and) he said: My Lord! deliver me from the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he departed therefrom, fearful and vigilant; he said, 'My Lord, deliver me from the people of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he escaped from thence, fearing, vigilant. He said: My Lord! Deliver me from the wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Moses departed from the city, fearful and vigilant, and prayed, \"My Lord, save me from these unjust people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went forth from thence fearing, looking abcut. He said: my Lord! deliver me from the wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left the city, fearful and vigilant. He said, ‘My Lord! Deliver me from the wrongdoing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He therefore got away therefrom, looking about, in a state of fear. He prayed \"O my Lord! save me from people given to wrong-doing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he escaped from there, looking about in a state of fear. He said: \"My Lord! Save me from the people who are Zalimun (polytheists and wrong-doers)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left, fearful and vigilant, saying: 'My Lord, save me from the harmdoing nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left, fearful and vigilant. He said, “My Lord, deliver me from the wrongdoing people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he left it, fearful and anticipating [apprehension]. He said, \"My Lord, save me from the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:21] So he departed from it, fearful, vigilant, lest any of the pursuers catch up with him, or [in the hope] that God might rescue him. He said, ‘My Lord, deliver me from the evildoing people’, Pharaoh’s people.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So he escaped from thence) from the city, (fearing, vigilant) waiting and looking behind him expecting to be hunted down and arrested. (He said) at this point: (My Lord! Deliver me from the wrong-doing folk) the people of Egypt.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع من الناصح ما سمع { فَخَرَجَ مِنْهَا } أي: من المدينة على الفور { خَآئِفاً يَتَرَقَّبُ } إدراكه من الخلف { قَالَ } حين خروجه ملتجأ إلى الله، مناجياً له: { رَبِّ } يا من رباني بكنفك وجوارك، ونجاني من أنواع الفتن والمحن { نَجِّنِي } بلطفك { مِنَ } إدراك { ٱلْقَوْمِ ٱلظَّالِمِينَ } [القصص: 21] القاصدين لمقتي وقتلي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والائتمار: التشاور، { فاخْرجْ } من المدينة، { إني لك من الناصحين } ، فاللام في لك: للبيان، وليس بصلة لأن الصلة لا تتقدم على الموصول، إلا أن يُتَسَامحَ في المجرور، { فخرج منها } من مصر { خائفاً يترقّبُ }: ينتظر الطلب ويتوقعه، { قال ربّ نجني من القوم الظالمين } قوم فرعون\n والله تعالى أعلم\n الإشارة: في الآية دليل على أن الخوف عند الدواهي الكبار لا ينافي الخصوصية لأنه أمر جِبِلِّي، لكنه يخف ويهون أمره، وفيها دليل على جواز الفرار من مواطن الهلاك، يفرّ من الله إلىالله، ولا ينافي التوكل، وقد اختفى صلى الله عليه وسلم من الكفار بغار ثور، واختفى الحسن البصري من الحَجَّاج، عند تلميذه حبيب العجمي\n\n\nوفيها أيضاً دليل على أن المعصية قد تكون سبباً في نيل الخصوصية، كأكل آدم من الشجرة، كان سبباً في نيل الخلافة، وعُمْرَةِ الأرض، وما نشأ من صُلبه من الأنبياء والأولياء وجهابذة العلماء، وكقتل موسى عليه السلام نفساً لم يُؤمر بقتلها، كان سبباً في خروجه للتربية عند شعيب عليه السلام، وتهيئته للنبوة والرسالة والاصطفائية، فكل ما يُوجب التواضع والانكسار يورث التقريب عند الملك الغفار، والحاصل: أن من سبقت له العناية، ونال من الأزل مقام المحبوبية صارت مساوئه محاسن، ومن سبق له العكس صارت محاسنه مساوئ\n اللهم اجعل سيئاتنا سيئات من أحببت، ولا تجعل حسناتنا حسنات من أبغضت\n وفي الحديث:\n\n \" إذا أحب الله عبداً لم يضره ذنب \"\n \n\nقال في القوت: واعلم أن مسامحة، الله عز وجل لأوليائه - يعني: في هفواتهم - في ثلاث مقامات: أن يقيمه مَقَامَ حَبيبٍ صَديقٍ، لِمَا سبق من قدم صدق، فلا تنقصه الذنوب لأنه حبيب\n المقام الثاني: أن يقيمه مقام الحياء منه، بإجلال وتعظيم، فيسمح له، وتصغر ذنوبه للإجلال والمنزلة، ولا يمكن كشف هذا المقام، إلا أنَّا روينا عن رسول الله صلى الله عليه وسلم: أنه ذكر طائفة فقال:\n\n \" يدفع عنهم مساوئ أعمالهم بمحاسن أعمالهم \" \n\nالمقام الثالث: أن يقيمه مقام الحزن والانكسار، والاعتراف بالذنب والإكثار، فإذا نظر حزنه وهمه، ورأى اعترافه وغمه، غفر له حياء منه ورحمة\n هـ\n وبالله التوفيق\n ثم ذكر توجه موسى إلى موسى إلى مدين واتصاله بشعيب - عليهما السّلام - فقال: { وَجَآءَ رَجُلٌ مِّنْ أَقْصَى ٱلْمَدِينَةِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:59",
      "similarity": 0.7329247846658877
    },
    {
      "verse": "11:93",
      "similarity": 0.4540098278357845
    },
    {
      "verse": "5:117",
      "similarity": 0.34860293071847415
    },
    {
      "verse": "33:52",
      "similarity": 0.32762795695032604
    },
    {
      "verse": "54:27",
      "similarity": 0.32535552723735983
    }
  ]
}