{
  "chapter": "القصص",
  "text": "فسقى لهما ثم تولى الى الظل فقال رب انى لما انزلت الى من خير فقير",
  "translations": [
    {
      "translation": "So he drew water for them and then withdrew into the shade and said, 'My Lord, I am truly in need of any good You have in store for me.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered (their flock), and moved into the shade and prayed: \"My Lord, I have need of whatever good you send me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On hearing this Moses watered their flocks for them, and then returned in a shaded place and said: \"My Lord, I am truly in great need of any good that You might send down to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses watered their flocks and then sought shelter under a shadow praying, \"Lord, I need the means to preserve (the power) that You have granted me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Moosa watered their animals for them, and then turned towards the shade and said, “My Lord! I am in need of the sustenance you may send down for me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered (their flocks) for them, then he turned back to shade, and said: \"My Lord! Truly, I am in need of whatever good that You bestow on me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered (their sheep) for them, then went back to the shade and said: My Lord! surely I stand in need of whatever good Thou mayest send down to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he drew water for them; then he turned away to the shade, and he said, 'O my Lord, surely I have need of whatever good Thou shalt have sent down upon me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered (their flock) for them. Then he turned aside into the shade, and said: My Lord! I am needy of whatever good Thou sendest down for me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Moses watered their flocks for them; and returned into the shade and prayed, \"Lord, I am truly in need of whatever blessing You may send down for me,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he watered their flocks for the twain. Then he turned aside into the shade, and said: my Lord! I verily of the good which Thou mayest send down for me I am needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered [their flock] for them. Then he withdrew toward the shade and said, ‘My Lord! I am indeed in need of any good You may send down to me!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered (their flocks) for them; then he turned back to the shade, and said:\"O my Lord! truly am I in (desperate) need of any good that Thou dost send me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered (their flocks) for them, then he turned back to shade, and said: \"My Lord! Truly, I am in need of whatever good that You bestow on me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he drew water for them and then retired to the shade, saying: 'O my Lord, surely I have need of whatever good You send me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he drew water for them, and then withdrew to the shade, and said, “My Lord, I am in dire need of whatever good you might send down to me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he watered [their flocks] for them; then he went back to the shade and said, \"My Lord, indeed I am, for whatever good You would send down to me, in need.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:24] So he watered [their flock] for them, from another well nearby, by lifting a rock from on top of it, which only ten men could have lifted; then he retreated to the shade, of an acacia tree (samura), because of the extreme heat of the sun and he was hungry, and said, ‘My Lord, indeed I am in utter need of whatever   good, [whatever] food, You send down to me’. The two women returned to their father quicker than usual and so he asked them why [it was so]. They told him about the man who had watered [their flock] for them. So he said to one of them, ‘Summon him to [come to] me’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So he watered (their flock) for them) and they went back to their father to inform him about Moses. (Then he) Moses (turned aside into the shade) of a tree; and it is said: the shade of a wall; and it is said: the shade of a shelter, (and said) Moses said: (My Lord! I am needy of whatever good) food (Thou sendest down for me) You have decreed for me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ تَوَلَّىٰ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَآ أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ } قال الإِمام زيد بن علي عليهما السّلامُ: كان موسى عليه السلام حينَ وردَ الماءَ، لَتُرى خُضرةُ البَقلِ من بَطنِهِ من الهُزَالِ، وما سألَ يَومئذٍ إِلاّ أكلةً من طَعامٍ\n\n",
      "translations": [
        {
          "translation": "\nThen he {turned} to the shade and said, \"My Lord, I am in need of whatever good You have sent down to me.\" Imam Zayd ibn Ali (as) said: \"When Musa (as) came to the water, you would see the greenness of the spinach from his stomach because of hunger. That day, he did not ask for anything except a meal of food.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع موسى منهما ما سمع، ورأى ما رأى من كمال العطف والعفة والعصمة قام مع أنه في غاية الضعف؛ من شدة الجوع والوصب، وعلى رأس البئر حجر عظيم يقله عند الاستسقاء جمع كثير، فأقله وحده { فَسَقَىٰ لَهُمَا } جميع أغنامهما { ثُمَّ تَوَلَّىٰ } ونصرف { إِلَى ٱلظِّلِّ } وازداد جوعه ووصبه { فَقَالَ } ملتجئاً إلى ربه: { رَبِّ إِنِّي } من شدة جوعي وضعفي { لِمَآ أَنزَلْتَ إِلَيَّ } ورزقتني من موائد إفضالك وإنعامك { مِنْ خَيْرٍ } وصل إليَّ، حينئذٍ { فَقِيرٌ } [القصص: 24] محتاج مريد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فسقى لهما } أي: فسقى غنمهما لأجلهما رغبة في المعروف وإغاثة الملهوف، رُوي أنه نحى القوم عن رأس البئر، وسألهم دلواً، فأعطوه دلوهم، وقالوا: استق به، وكانت لا ينزعها إلا أربعون، فاستقى بها، وصبَها في الحوض، ودعا بالبركة\n وقيل: كانت آبارهم مغطاة بحجار كبار، فعمد إلى بئر، وكان حجرها لا يرفع إلا جماعة، فرفعه وسقى للمرأتين\n ووجه مطابقة جوابهما سؤاله: أنه سألهما عن سبب الذود، فقالتا: السبب في ذلك أن امرأتان مستورتان ضعيفتان، لا نقدر على مزاحمة الرجال، ونستحي من الاختلاط بهم، فلا بد لنا من تأخير السقي إلى أن يفرغوا\n\n\nوإنما رضي شعيب عليه السلام لابنيته بسقي الماشية لأن الأمر في نفسه مباح مع حصول الأمن، وأما المروءة فعادات الناس فيها متباينة، وأحوال العرب فيها خلاف أحوال العجم، ومذهب أهل البدو فيه غير مذهب أهل الحضر، خصوصاً إذا كانت الضرورة\n قاله النسفي\n قلت: وقد كنت أعترض على أهل الجبل رَعْيَ النِّساءِ المواشي حتى تذكرت قضية ابنتي شعيب، لكن السلامة في زماننا هذا حبس النساء في الديار لكثرة أهل الفساد\n { ثم } لما سقى لهما { تولى إلى الظل } ظل شجرة\n عن عمرو بن ميمون، عن عبد الله قال: أحييت ليلتين على جمل لي، حتى صبّحْت مدين، فسالت عن الشجرة التي أوى إليها موسى، فإذا هي شجرة خضراء، فأخذ جملي يأكل منها ثم لفظها\n هـ\n وفي الآية دليل على جواز الاستراحة والاستظلال في الدنيا، بخلاف ما يقوله بعض المتقشفة، وسيأتي في الإشارة تمامه إن شاء الله\n ثم بث شكواه لمولاه { فقال ربِّ إِني لِمَا أنزلتَ إليَّ من خيرٍ } قليل أو كثير { فقير } محتاج\n قال ابن عباس: لقد قال ذلك وإن خضراء البقل لتتراءى في بطنه، من الهزال\n قيل: لم يذق طعاماً منذ سبعة أيام، وقد لصق بظهره بَطْنُهُ، وما سأل الله تعالى الأكلة\n وفي هذا تنبيه على هوان الدنيا على الله تعالى\n وقال ابن عطاء: نظر من العبودية إلى الربوبية، وتكلم بلسان الافتقار، لما ورد على سره من الأنوار\n هـ\n الإشارة: ولما توجه القلبُ تلقاء مَدْيَنِ المآرب، ومنتهى الرغائب - وهي الحضرة القدسية - قال: عسى ربي أن يهديني سواء السبيل، أي: وسط الطريق التي توصل إليها، وهو شيخ التربية\n ولَمَّا ورد مناهله، ومحلَ شربه وجد عليه أمة من الناس يسقون قلوبهم من شراب تلكَ الخمرة، ويطلبون مثل ما يطلب، فإن كان قوياً في حاله وصل من كان ضعيفاً وسقى له، ثم نزل إلى ظل المعرفة، في نسيم برد الرضا والتسليم، قائلاً، بلسان التضرع، سائلاً من الله المزيد: ربِّ إني لما أنزلت إليّ من خير الدارين، وغنى الأبد، فقير محتاج إلى مزيد الفضل والكرم\n وقال في لطائف المنن: { ثم تولى إلى الظل } قصداً لشكر الله تعالى على ما ناله من النعمة - يعني: نعمة الظل الحسي - وجعله أصلاً في استعمال الطيبات، وتناولها بقصد الشكر، ومثله في التنوير\n وفي سنن أبي داود عن عائشة - رضي الله عنها - قالت: \" كان صلى الله عليه وسلم يُسْتعذب له الماء من بُيوت السُّقيا \" ، قال ابن قتيبة: هي عَيْنٌ، بينها وبين المدينة يومان\n هـ\n وكان الشيخ ابن مشيش يقول لأبي الحسن رضي الله عنه: يا أبا الحسن، بَرِّد الماءَ فإن النفس إذا شربت الماء البارد حمدت الله بجميع الجوارح، وإذا شربت الماء السخن حمدت الله بكزازة\n ثم ذكر اتصاله بشعيب، فقال: { فَجَآءَتْهُ إِحْدَاهُمَا تَمْشِي\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:25",
      "similarity": 0.5299548588249949
    },
    {
      "verse": "35:15",
      "similarity": 0.5192560280846104
    },
    {
      "verse": "2:271",
      "similarity": 0.4338452894540503
    },
    {
      "verse": "2:268",
      "similarity": 0.39761972704775367
    },
    {
      "verse": "59:8",
      "similarity": 0.38829926149397004
    }
  ]
}