{
  "chapter": "القصص",
  "text": "ولما توجه تلقاء مدين قال عسى ربى ان يهدينى سواء السبيل",
  "translations": [
    {
      "translation": "When he turned his face in the direction of Madyan, he said. 'Hopefully my Lord will guide me to the right way.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as he turned his face to Midian, he said: \"Maybe my Lord will show me the right way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (after his departure from Egypt) Moses headed towards Midian, he said: \"I hope my Lord will show me the right Path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he started his journey to Midian he said, \"Perhaps my Lord will show me the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turned his attention towards Madyan he said, “It is likely that my Lord will show me the right path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he went towards Madyan, he said: \"It may be that my Lord guides me to the right way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turned his face towards Madyan, he said: Maybe my Lord will guide me in the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turned his face towards Midian he said, 'It may be that my Lord will guide me\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turned his face toward Midian, he said: Peradventure my Lord will guide me in the right road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he made his way towards Midian, he said, \"I am sure, my Lord will guide me to the right way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he betook himself toward Madyan, he said: belike my Lord will guide me even way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turned his face toward Midian, he said, ‘Maybe my Lord will show me the right way.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he turned his face towards (the land of) Madyan, he said: \"I do hope that my Lord will show me the smooth and straight Path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he went towards (the land of) Madyan (Midian) he said: \"It may be that my Lord guides me to the Right Way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turned his face towards Midian, he said: 'It may be that my Lord will guide me on the right way'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As he headed towards Median, he said, “Perhaps my Lord will guide me to the right way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he directed himself toward Madyan, he said, \"Perhaps my Lord will guide me to the sound way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:22] And when he turned his face towards Midian, in the direction thereof — and this [Midian] was the town of [the prophet] Shu‘ayb, eight day’s journeying from Egypt, [so] named after Midian son of Abraham; he [Moses] did not know the route to it — he said, ‘Perhaps my Lord will show me the right way’, that is to say, which route to follow, in other words, the simplest route to it. God thus sent forth to him an angel with a goat, which he [Moses] set off following towards it [the town].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he turned his face towards Midian) he was afraid to miss the way, (he said: Peradventure my Lord will guide me in the right road) leading to Midian.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمَّا تَوَجَّهَ تِلْقَآءَ مَدْيَنَ } معناه نَحوَ مَدين",
      "translations": [
        {
          "translation": "\nAnd when he {turned away from} Medina, he meant Medina.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا تَوَجَّهَ تِلْقَآءَ مَدْيَنَ } أي: حهة قرية شعيب عليه السلام { قَالَ } راجياً إلى الله\n ذاكراً سوابق نعمه عليه من كمال فضله وكرمه: { عَسَىٰ رَبِّيۤ أَن يَهْدِيَنِي } بمقتضى جوده العميم { سَوَآءَ ٱلسَّبِيلِ } [القصص: 22] أي: الطريق المستقيم المنجي عن العدو\n الموصل إلى الصديق المشفق\n ليهديني إلى صراط الله الأقوم الأعدل الذي هو التوحيد المخلص عن وساوس التقليد\n فعن له ثلاث طرق فاختار أوسطها بإلهام من الله إياه\n وجاء الطلاب عقيبه فاختاروا الآخرين\n فنجا من شرورهم سالماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولما توجَّه } موسى { تلقاءَ مَدْينَ } نحوها وجهتها\n ومدين: قرية شعيب، سُميت بمدين بن إبراهيم، كما سميت المدائن باسم أخيه مدائن، ويقال له أيضاً: \" مدان بن إبراهيم \" ، ولم تكن مدين في سلطان فرعون، وبينها وبين مصر مسيرة ثمانية أيام، ولعله إنما لم يتسلط عليها لِمَا وصله من خبر إهلاك أهلها لما طغوا على أنبيائهم، فخاف على نفسه\n قال ابن عباس: خرج موسى، ولم يكن له علم بالطريق إلا حسن الظن بربه\n { قال عسى ربي أن يهديني سواءَ السبيل } أي: وسطه ونهجه\n فلما خرج، عَرَض له ثَلاَثُ طرق، فأخذ في أوسطها، وجاء الطلاب عَقِبَهُ، فأخذوا في الآخَرَيْنِ\n رُوي أن مَلكاً جاءه على فرس بيده عَنَزَة، فانطلق به إلى مدين\n ورُوي أنه خرج بلا زاد ولا درهم، ولا ظهر، ولا حِذاء - أي: نعل -، ولم يكن له طعام إلا ورق الشجر، فما بلغ مدين حتى وقع خُفُّ قَدَمِهِ، وخضرة البقل ترى على بطنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:67",
      "similarity": 0.40604796670587673
    },
    {
      "verse": "26:53",
      "similarity": 0.36256178955649626
    },
    {
      "verse": "4:99",
      "similarity": 0.3602463093101562
    },
    {
      "verse": "28:67",
      "similarity": 0.31785933866882565
    },
    {
      "verse": "60:7",
      "similarity": 0.31763240942526166
    }
  ]
}