{
  "chapter": "القصص",
  "text": "فجاءته احدىهما تمشى على استحياء قالت ان ابى يدعوك ليجزيك اجر ما سقيت لنا فلما جاءه وقص عليه القصص قال لا تخف نجوت من القوم الظلمين",
  "translations": [
    {
      "translation": "One of them came walking shyly up to him and said, 'My father invites you so that he can pay you your wage for drawing water for us.' When he came to him and told him the whole story he said, 'Have no fear, you have escaped from wrongdoing people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then one of the (maidens) came to him walking bashfully, (and) said: \"My father invites you that he may repay you for having watered our flock.\" So, when (Moses) came to him and told him his story, he said: \"Have no fear. You have escaped from the wicked people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon thereafter one of the two women came to him, walking bashfully, and said: \"My father invites you that he may reward you for your having watered our flocks for us. \" When Moses came to him and narrated to him the whole of his story, he said: \"Have no fear. You are now safe from the iniquitous people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of the women, walking bashfully, came to Moses and said, \"My father calls you and wants to pay you for your watering our flocks.\" When Moses came to the woman's father and told him his whole story, he said, \"Do not be afraid. Now you are secure from the unjust people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So one of the two women approached him, walking shyly; she said, “My father is calling you, in order to give you wages because you watered our animals for us”; when Moosa came to him and had told him the story, he said, “Do not fear, you are safe from the unjust people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there came to him one of them, walking shyly. She said: \"Verily, my father calls you that he may reward you for having watered (our flocks) for us.\" So when he came to him and narrated the story, he said: \"Fear you not. You have escaped from the people who are wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then one of the two women came to him walking bashfully. She said: My father invites you that he may give you the reward of your having watered for us. So when he came to him and gave to him the account, he said: Fear not, you are secure from the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then came one of the two women to him, walking modestly, and said, 'My father invites thee, that he may recompense thee with the wage of thy drawing water for us.' So when he came to him and had related to him the story, he said, 'Be not afraid; thou hast escaped from the people of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there came unto him one of the two women, walking shyly. She said: Lo! my father biddeth thee, that he may reward thee with a payment for that thou didst water (the flock) for us. Then, when he came unto him and told him the (whole) story, he said: Fear not! Thou hast escaped from the wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and then one of the two women came walking shyly up to him and said, \"My father is asking you to come so that he may reward you for watering our flocks for us.\" When Moses came to their father and gave him an account of himself, he said: \"Don't be afraid! You have escaped from those wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there came unto him one of the twain walking bashfully, and said: verily my father calleth for thee, that he may recompense thee with a hire for that thou didst water the flock for us. Then, when he was come unto him and had recounted unto him the whole story, he said: fear not; thou hast escaped from the wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then one of the two women approached him, walking bashfully. She said, ‘Indeed my father invites you to pay you the wages for watering [our flock] for us.’ So when he came to him and recounted the story to him, he said, ‘Do not be afraid. You have been delivered from the wrongdoing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Afterwards one of the (damsels) came (back) to him, walking bashfully. She said: \"My father invites thee that he may reward thee for having watered (our flocks) for us.\" So when he came to him and narrated the story, he said: \"Fear thou not: (well) hast thou escaped from unjust people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there came to him one of the two women, walking shyly. She said: \"Verily, my father calls you that he may reward you for having watered (our flocks) for us.\" So when he came to him and narrated the story, he said: \"Fear you not. You have escaped from the people who are Zalimun (polytheists, disbelievers, and wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, one of the two came to him walking shyly, and said: 'My father invites you, so that he can recompense you with a wage for having drawn water for us.' So when he came to him and told him his story, (the father) said: 'Do not be afraid, you have been saved from the nation of harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, one of the two women approached him, walking bashfully. She said, “My father is calling you, to reward you for drawing water for us.” And when he came to him, and told him the story, he said, “Do not fear, you have escaped from the wrongdoing people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then one of the two women came to him walking with shyness. She said, \"Indeed, my father invites you that he may reward you for having watered for us.\" So when he came to him and related to him the story, he said, \"Fear not. You have escaped from the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:25] God, exalted be He, says: Then one of the two women came to him, walking bashfully — in other words, covering her face with the sleeve of her shirt, being shy of him — and said, ‘My father invites you, that he may pay you a wage for watering [our flock] for us’. He accepted her invitation, while inwardly he disapproved of accepting any wage, for it was as though she sought to remunerate him and as though he were of those who would want it [which he was not]. She walked in front of him but when the wind began to blow off her dress and reveal her legs, he said to her, ‘Walk behind me and show me the way’, which she did. Finally he came to her father, Shu‘ayb, peace be upon him, who was sitting with some supper in front of him. He said to him, ‘Sit and have some supper’. He [Moses] said, ‘I hope that this is not [some sort of] compensation for having watered [their flock] for them? For we are People of a House and do not demand compensation for good deeds’. He [Shu‘ayb] said, ‘No. It is [simply] a custom of mine and of my forefathers to be hospitable to guests and to offer them food’. Thus, he [Moses] ate and informed him of his predicament. God, exalted be He, says: So when he came to him and recounted to him the story (al-qasas is a verbal noun with the sense of al-maqsūs, ‘that which is recounted’), of his slaying of the Egyptian and their intention to slay him and his fear of Pharaoh, he [their father] said, ‘Do not be afraid. You have escaped from the evildoing people’, as Pharaoh had no authority over Midian.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then there came unto him one of the two women) the youngest of the two, whose name was Zipporah (Saffurah), (walking shyly) with her hand on her face. (She said: Lo! my father biddeth thee, that he may reward thee with a payment for that thou didst water (the flock) for us. Then, when he came unto him) when Moses went to Yathron, the nephew of the Prophet Shu'ayb who had died before (and told him) told Yathron (the (whole) story) of his escape from Pharaoh and the rest of it, (he said) Yathron said to him: (Fear not! thou hast escaped from the wrong-doing folk) the people of Egypt.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَجَآءَتْهُ إِحْدَاهُمَا تَمْشِي عَلَى ٱسْتِحْيَآءٍ } معناه واضعةٌ يَدهَا عَلَى وَجهِهَا\n\n\n\n\nوقوله تعالى: { إِنَّ أَبِي يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا } معناه ثوابُ ما سَقيتَ لَنا\n\n",
      "translations": [
        {
          "translation": " And His saying, the Most High, {So one of them came running, walking on her hands} means that she was walking with her hands on her face out of shyness.\n\n\nAnd His saying, \"Indeed, my father invites you that he may give you the reward for what you have done for us.\" This means that you will be rewarded for what you have done for us.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فلما جاءه } واتصل به وترقى في مقامه\n وأطلع الروح على حاله { قال لا تخف نجوت من القوم الظالمين } وهو صورة حاله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تم مناجاته مع ربه\n وطلب حاجته منه سبحانه { فَجَآءَتْهُ إِحْدَاهُمَا } أي: إحدى المرأتين { تَمْشِي } نحوه { عَلَى ٱسْتِحْيَآءٍ } تام منه\n لما وصلت حوله سلمت عليه\n ثمَّ { قَالَتْ } له مستحيية: { إِنَّ أَبِي يَدْعُوكَ لِيَجْزِيَكَ } ويكافئك { أَجْرَ مَا سَقَيْتَ لَنَا } تبرعاً\n فأجابها موسى تبركاً برؤية شعيب عليه السلام لا طمعاً لأجرته\n\n\nرُوي أنه لمَّا دخل عليه أتى أولاً بالطعام\n فامتنع موسى عليه السلام وقال: نحن من أهل بيت لا نبيع بالدنيا\n قال شعيب عليه السلام: هذا من عادتنا مع كل من ينزل بنا\n وإن من أتى بمعروف\n وأهدي له لم يحرم أخذه وأكله في جميع الأديان\n\n\n{ فَلَمَّا جَآءَهُ } أي: جاء موسى شعيباً - عليهما السلام - وتبرك بشرف صحبته لاح عليه حاله { وَقَصَّ عَلَيْهِ ٱلْقَصَصَ } الذي جرى عليه من أوله إلى آخره\n وسمع منه الشيخ على التفصيل { قَالَ لاَ تَخَفْ } بعد اليوم { نَجَوْتَ مِنَ ٱلْقَوْمِ ٱلظَّالِمِينَ } [القصص: 25] يعني: فرعون وملأه\n\n\nوبعدما جلس موسى عند شعيب - عليهما السلام - وقصَّ عليه ما جرى من الخوف والحزن وأنواع الكآبة { قَالَتْ إِحْدَاهُمَا } أي: إحدى الابنتين\n وهي التي استدعته للضيافة: { يٰأَبَتِ ٱسْتَئْجِرْهُ } لرعي الغنم\n وأنت تريد الأجير { إِنَّ خَيْرَ } جميع { مَنِ ٱسْتَئْجَرْتَ } من الرجال هو\n لأنه { ٱلْقَوِيُّ } أي: شديد القوة { ٱلأَمِينُ } [القصص: 26] ذو الأمانة والديانة\n\n\nقال لها أبوها حمية وغيرة: من أين عرفت قوته وأمانته؟ فذكرت لأبيها إقلال الحجر العظيم وحده من رأس البئر مع أن الناس يقلونه في جمع كثير\n فهذا دليل قوته\n وأما أمانته فإني بعدما دعوته قام ومشى قدامي\n وأمرني بالمشي خلفه\n صيانةً عن النظر إلي\n فقال لي: دليني عن الطريق إن ضللت\n وهذا دليل أمانته وصيانته حدود الله\n\n\nولمَّا سمع شعيب عليه السلام من ابنته ما سمع من أمارات أمانته ومروءته رغب إلى ألفته ومؤانسته\n حيث { قَالَ } شعيب لموسى عليه السلام { إِنِّيۤ } بعدما وجدتك شاباً صالحاً\n سوياً ذا رشد وأمانة { أُرِيدُ أَنْ أُنكِحَكَ إِحْدَى ٱبْنَتَيَّ هَاتَيْنِ } على صداق معين { عَلَىٰ أَن تَأْجُرَنِي } نفسك برعي الغنم { ثَمَانِيَ حِجَجٍ فَإِنْ أَتْمَمْتَ عَشْراً } كاملاً { فَمِنْ عِندِكَ } تبرعاً وإحساناً { وَمَآ أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ } بأن أحملك أزيد من ذلك { سَتَجِدُنِي إِن شَاءَ اللَّهُ مِنَ الصَّالِحِينَ } [القصص: 27] للخدمة والمصاحبة\n والمؤاخاة والموافاة في أداء الحقوق والعهود\n\n\n{ قَالَ } موسى مجيباً له\n راغباً لقبول ما ألقاء من الكلام: { ذَلِكَ } الوقت الذي عينته ملزماً عليَّ أولاً { بَيْنِي وَبَيْنَكَ } معهود ثابت\n والذي قلته ثانياً تبرعاً مني\n وبالجملة: { أَيَّمَا ٱلأَجَلَيْنِ } يعني: أجل الالتزام\n وأجل التبرع { قَضَيْتُ } يقع المعهود بلا تردد { فَلاَ عُدْوَانَ } ولا تعدي { عَلَيَّ } بعد انقضاء كل واحد من الأجلين { وَٱللَّهُ } الشهيد المطلع لعموم أحوال عباده { عَلَىٰ مَا نَقُولُ } من المشارطة والمعادة { وَكِيلٌ } [القصص: 28] حفيظ يحفظه على وجهها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: تمشي: حال من إحداهما\n و على استحياء: حال من ضمير تمشي\n أي: تمشي مستحيية\n والقصص: مصدر\n سُمِّيَ به المقصوص\n يقول الحق جل جلاله: { فجاءته إحداهما } وهي التي تزوجها\n وذلك أنه لما سقى لهما رجعا إلى أبيهما بغنمها بِطاناً حُفَّلاً\n فقال لهما: ما أعجلكما؟ فقالتا له: وجدنا رجلاً صالحاً رحمنا فسقى لنا أغنامنا\n فقال لإحداهما: أدعيه\n فجاءته { تمشي على استحياء } قد سترت وجهها بكفها\n واستترت بكُمِّ درعها\n وهذا دليل على كمال إيمانها وشرف عنصرها لأنها كانت تدعوه إلى ضيافتها\n ولم تعلم أيجيبها أم لا؟ فقالت: { إن أبي يدعوك ليجزيك أجرَ ما سَقيت لنا } \n \" ما \" مصدرية\n أي: أجر سُقْيَاك لنا\n فتبعها موسى\n فألزقت الريح ثوبها بجسدها\n فوصفته\n فقال لها: امشي خلفي\n وانعتي الطريق\n فإننا بَني يعقوب\n لا ننظر إلى أعجاز النساء\n { فلما جاءه وقصَّ عليه القَصص } \n أي: قصته وأحواله مع فرعون\n وكيف أراد قَتْلَهُ\n { قال } له: { لا تخفْ نجوتَ من القوم الظالمين } فرعون وقومه إذ لا سلطان له على أرضنا - مدين -\n أو: قَبِلَ الله دعاءك في قولك: { رب نجني من القوم الظالمين }\n وفيه دليل على العمل بخير الواحد\n ولو أنثى\n والمشي مع أجنبية على ذلك الاحتياط والتورع\n قاله النسفي\n وفيه نظر لعصمة الأنبياء - عليهم السلام -\n وما أخذ الأجر على البر والمعروف فقيل: لا بأس به عند الحاجة\n كما كان لموسى عليه السلام\n على أنه رُوي أنه لمّا قالت له: { ليجزيك } كره ذلك\n وإنما أجابها لئلا يخيب قصدها لأن للقاصد حرمة\n ولما وضع شعيب الطعام بين يديه امتنع\n فقال شعيب: ألست جائعاً؟ فقال: بلى\n ولكن أخاف أن يكون عوضاً مما سَقَيْتُ لهما\n وإنا أهل بيت لا نبيع ديننا بالدنيا\n ولا نأخذ على المعروف شيئاً\n فقال شعيب: هذه عادتنا مع كل من ينزل بنا\n فأكل\n { قالت إحداهما يا أبَتِ استأجرْهُ } \n أي: اتخذه أجيراً لرعي الغنم\n رُوي أن كبراهما كانت تسمى: \" صفراء \" \n والصغرى: \" صفيراء \" \n وقيل: \" صابورة \" و \" ليا \"\n وصفراء هي التي ذهبت به\n وطلبت إلى أبيها أن يستأجره\n وهي التي تزوجها\n قاله وهب بن منبه وغيره فانظره مع ما في حديث\n قال صلى الله عليه وسلم:\n \" تزوج صغراهما\n وقضى أوفاهما \" \nويمكن الجمع بأن يكون زوّجه إحداهما ثم نقله إلى الأخرى\n ثم قالت التي طلبت استئجاره: { إن خيرَ من استأجرت القويُّ الأمين } \n فقال: ما أَعْلَمَكِ بقوته وأمانته؟ فذكرت نزع الدلو\n أو رفع الحجر عن البئر\n وأمْرها بالمشي خلفه\n وفي رواية عند الثعلبي\n أما قوته: فإنه عمد إلى صخرة لا يرفعها إلا أربعون رجلاً\n فرفعها عن فم البئر\n\nثم ذكرتْ أمر الطريق\n وقولها: { إنَّ خيرَ من استأجرت\n\n\n } إلخ: كلام جامع لأنه إذا اجتمعت هاتان الخصلتان الكفاية والأمانة\n في القائم بأمرك\n فقد فرغ بالك وتم مرادك\n وقيل: القوي في دينه\n الأمين في جوارحه\n وقد استغنت بهذا الكلام\n الجاري مجرى المثل\n عن أن تقول: استأجره لقوته وأمانته\n وعن ابن مسعود رضي الله عنه: أفرس الناس ثلاثة: بنت شعيب\n وصاحب يوسف في قوله:\n[يوسف: 21]\n وأبو بكر في استخلافه عمر\n { قال } شعيب لموسى - عليهما السلام-: { إني أُريد أن أُنكِحَك }: أُزوجك { إحدىَ ابنتي هاتينِ } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:122",
      "similarity": 0.3332057101001794
    },
    {
      "verse": "3:62",
      "similarity": 0.28910429164924306
    },
    {
      "verse": "7:7",
      "similarity": 0.28823532405836666
    },
    {
      "verse": "26:79",
      "similarity": 0.2847831042054379
    },
    {
      "verse": "7:35",
      "similarity": 0.2813682371530967
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/28:25.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/28:25.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/28:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}