{
  "chapter": "القصص",
  "text": "ولما ورد ماء مدين وجد عليه امة من الناس يسقون ووجد من دونهم امراتين تذودان قال ما خطبكما قالتا لا نسقى حتى يصدر الرعاء وابونا شيخ كبير",
  "translations": [
    {
      "translation": "When he arrived at the water of Madyan, he found a crowd of people drawing water there. Standing apart from them, he found two women, holding back their sheep. He said, 'What are you two doing here?' They said, 'We cannot draw water until the shepherds have driven off their sheep. You see our father is a very old",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to the waters of Midian he found a crowd of people watering (their flocks), and saw two maidens holding back (their cattle). He asked: \"What is the trouble with you?\" They said: \"We cannot water our flock till the shepherds have driven away theirs, and our father is a very old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he arrived at the spring of Midian, he found there a crowd of people watering their flocks, and he found apart from them two women holding their flocks back. He asked the women: \"What is it that troubles you?\" They said: \"We cannot water our flocks until the shepherds take their flocks away, and our father is a very old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he arrived at the well of Midian, he found some people watering (their sheep) and two women keeping the sheep away from the others. He asked the two women, \"What is the matter with you?\" They replied, \"We cannot water our sheep until all the shepherds have driven away their flocks. Our father is an old man\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to the water of Madyan he found a group of men, watering their animals; and away from them he found two women restraining their animals; he said, “What is the matter with you?” They said, “We do not water our animals till all the shepherds water and take away their animals; and our father is very old.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he arrived at the water of Madyan, he found there a group of men watering, and besides them he found two women who were keeping back (their flocks). He said: \"What is the matter with you\" They said: \"We cannot water (our flocks) until the shepherds take (their flocks). And our father is a very old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to the water of Madyan, he found on it a group of men watering, and he found besides them two women keeping back (their flocks). He said: What is the matter with you? They said: We cannot water until the shepherds take away (their sheep) from the water, and our father is a very old man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the right way. And when he came to the waters of Midian he found a company of the people there drawing water, and he found, apart from them, two women holding back their flocks. He said, 'What is your business?' They said, 'We may not draw water until the shepherds drive off; and our father is passing old.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came unto the water of Midian he found there a whole tribe of men, watering. And he found apart from them two women keeping back (their flocks). He said: What aileth you? The two said: We cannot give (our flocks) to drink till the shepherds return from the water; and our father is a very old man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he arrived at the well of Midian, he found around it a group of men watering their flocks, and he saw two women standing apart from them, who were holding back their flocks, so he asked, \"What is the matter with you?\" They replied, \"We cannot draw water until the shepherds take away their sheep. Our father is a very old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he arrived at the water of Madyan, he found there a community of the people watering. And he found, apart from them, two women keeping back their flocks. He said: what aileth you twain! The twain said: we water not until the shepherds have driven away their flocks; and our father is a very old man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he arrived at the well of Midian, he found there a throng of people watering [their flocks], and he found, besides them, two women holding back [their flock]. He said, ‘What is your business?’ They said, ‘We do not water [our flock] until the shepherds have driven out [their flocks], and our father is an aged man.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he arrived at the watering (place) in Madyan, he found there a group of men watering (their flocks), and besides them he found two women who were keeping back (their flocks). He said: \"What is the matter with you?\" They said: \"We cannot water (our flocks) until the shepherds take back (their flocks): And our father is a very old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he arrived at the water of Madyan (Midian) he found there a group of men watering (their flocks), and besides them he found two women who were keeping back (their flocks). He said: \"What is the matter with you?\" They said: \"We cannot water (our flocks) until the shepherds take (their flocks). And our father is a very old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came to the water wells of Midian he found there some people drawing water, and he found two women apart from them who were keeping back (their flocks). 'What is your business' he asked. They replied: 'We cannot draw water until the shepherds have driven away (their flocks), and our father is an elderly man'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he arrived at the waters of Median, he found there a crowd of people drawing water, and he noticed two women waiting on the side. He said, “What is the matter with you?” They said, “We cannot draw water until the shepherds depart, and our father is a very old man.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to the well of Madyan, he found there a crowd of people watering [their flocks], and he found aside from them two women driving back [their flocks]. He said, \"What is your circumstance?\" They said, \"We do not water until the shepherds dispatch [their flocks]; and our father is an old man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:23] And when he arrived at the Water of Midian, [the name of] a well therein, he found a group of people there watering, their flocks, and he found, besides them, two women holding back their flock, from the water. He, Moses, said, to the two: ‘What is your business?’, that is, ‘What is the matter with you, that you are not watering?’ They said, ‘We do not water [our flock] until the shepherds have moved on (ri‘ā’u, ‘shepherds’, the plural of rā‘in) that is to say, until they have returned from the watering, for fear of being crushed [by the throng], after which we go to water (a variant reading [for yasdiru, ‘move on’] is the 4th form [subjunctive] yusdira, ‘to drive away’, meaning, until they [the shepherds] have driven their flocks away from the water’) and our father is a very old man’, unable to [come and] water.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "438 (And when he came unto the water of Midian) a well in Midian (he found there a whole tribe of men) a group of 40 men, (watering) their flocks. (And he found apart from them two women keeping, back (their flocks)) until the men finished watering their flocks, due to their weakness. (He said: What aileth you) what holds you back? (The two said: We cannot give (our flocks) to drink till the shepherds return from the water) until they finish watering their flocks; (and our father is a very old man) and does not have anyone to help him except us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n { وَجَدَ عَلَيْهِ أُمَّةً مِّنَ ٱلنَّاسِ يَسْقُونَ } معناه جَماعةٌ\n\n\n\n\nوقوله تعالى: { وَوَجَدَ مِن دُونِهِمُ ٱمْرَأَتَينِ تَذُودَانِ } معناه تَمنَعان\n قال الإِمامُ زيد بن علي عليهما السلام: انتهى موسى عليه السّلامُ إلى مَدينَ وعليهِ أُمةٌ من النَّاسِ يَسقون وامرأتان حَابستانِ\n وتَذودُ: أي تَسوقُ\n\n\n\n\nوقوله تعالى: { مَا خَطْبُكُمَا } [معناه] ما أمركُما ومَا حَالِكُما\n\n\n\n\nوقوله تعالى: { حَتَّىٰ يُصْدِرَ ٱلرِّعَآءُ } معناه حتَّى يَسقوا مَواشيَهُم ويَنصرفوا عن البئرِ\n\n\n\n\nوقوله تعالى: { وَأَبُونَا شَيْخٌ كَبِيرٌ } قال الإِمام زيد بن علي عليهما السَّلام: كانَ الذي استأجرَ موسى عليهِ السَّلامُ يَثرون بن [أخ] شُعيب النبي عليه السَّلامُ\n\n",
      "translations": [
        {
          "translation": "\nAnd he found a nation {of people} watering. Its meaning is a group.\n\n\nAnd He found, among them, two women who were withholding (information).\n\n\nThe Imam Zaid bin Ali said: \"Moses came to a city where there was a people who were watering their crops and two women were waiting.\"\n\n\nAnd she will be left {desolate}: that is, she will have no one to turn to.\n\n\nAnd His saying, {What concerns you two?} [means] whatever your affair and whatever your state.\n\nAnd His saying, {Until the grazing livestock have removed themselves} [means] until they have watered their animals and have returned from the well.\n\n\nAnd the Prophet Muhammad said: \"Our father, Shaikh, was a great man.\" Zaid ibn Ali, may peace be upon him, said that the one who hired Moses was the son of the Prophet Shu'ayb, may peace be upon him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولما ورد ماء مدين } أي: مورد علم المكاشفة ومنهل علم السرّ والمكالمة { وجد عليه أمّة من الناس } من الأولياء والسالكين في الله والمتوسطين الذين مشربهم من منهل المكاشفة { يسقون } قواهم ومريديهم منه\n أو العقول المقدّسة والأرواح المجرّدة من أهل الجبروت فإنها في الحقيقة أهل ذلك المنهل\n يسقون منه أغنام النفوس السماوية والإنسية وملكوت السموات والأرض { ووجد من دونهم } من مرتبة أسفل من مرتبتهم { امرأتين } هما العاقلتان النظرية والعملية { تذودان } أغنام القوى عنه لكون مشربها من العلوم العقلية والحكمة العملية قبل وصول موسى القلب إلى المناهل الكشفية والموارد الذوقية ولا نصيب لها من علوم المكاشفة { لا نسقي حت يصدر الرعاء } أي: شربنا من فضلة رعاء الأرواح والعقول المقدّسة عند صدورها عن المنهل متوجهة إلينا\n مفيضة علينا فضلة الماء { وأبونا } الروح { شيخ كبير } أكبر من أن يقوم بالسقي { فسقى لهما } من مشرب ذوقه ومنهل كشفه بالإفاضة على جميع القوى من فيضه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا وَرَدَ } ووصل بعدما سار ثمانية أيام بلا زاد\n يأكل الكلأ { مَآءَ مَدْيَنَ } أي: بئراً قرب مدين\n كان أهلها يسقون منها مواشيهم { وَجَدَ عَلَيْهِ أُمَّةً } أي: فرقة عظيمة { مِّنَ ٱلنَّاسِ } قعد عندهم من شدة الوصف والجوع والعطش\n وهم { يَسْقُونَ } وماشيهم بالدلو منها { وَوَجَدَ مِن دُونِهِمُ } أي: في مكان أبعد وأشغل من مكانهم { ٱمْرَأَتَينِ } معهما غنم كثير { تَذُودَانِ } أي: تطردان وتصرفان غنمهما عن اخلاط غنمهم\n وتبعدان عن الماء\n\n\n{ قَالَ } موسى سائلاً عنهما بعدما شاهد حاليهما وذودهما: { مَا خَطْبُكُمَا } أي: شأنكما وأمركما؟ وأي: شيء مقصودكما من الذود مع أن أغنامكما في غاية العطش؟! { قَالَتَا } مع كمال الاستحياء والتحفظ من مكالمته: { لاَ نَسْقِي } أغنامنا مع هؤلاء الرجال\n إذ نحن من أهل بيت النبوة لا نجتمع معهم في السقي\n بل نصبر { حَتَّىٰ يُصْدِرَ ٱلرِّعَآءُ } أي: يُخلوا الدلو\n ويُخرجوا مواشيهم إلى المرعى عن رأس الماء - الرعاء: جمع راعٍ كتجار: جمع تاجر\n هذا على قراءة: { يُصْدِرَ } بضم الياء وكسر الدال\n وأمَّا على قراءة: { يُصْدِرَ } بفتح الياء وضم الدال\n أي: يذهب الرعاء بمواشيهم مرتبة\n وينصرفوا من شفير البئر - إذ نحن لا نختلط مع أجانب الرجال { وَ } نحن من كمال اضطرارنا جئنا للسقي\n إذ { أَبُونَا شَيْخٌ كَبِيرٌ } [القصص: 23] فاقد البصر\n وما لنا أخ وعم\n وليس لأبينا سوانا\n\n\nوبعدما سمع موسى منهما ما سمع\n ورأى ما رأى من كمال العطف والعفة والعصمة قام مع أنه في غاية الضعف\n من شدة الجوع والوصب\n وعلى رأس البئر حجر عظيم يقله عند الاستسقاء جمع كثير\n فأقله وحده { فَسَقَىٰ لَهُمَا } جميع أغنامهما { ثُمَّ تَوَلَّىٰ } ونصرف { إِلَى ٱلظِّلِّ } وازداد جوعه ووصبه { فَقَالَ } ملتجئاً إلى ربه: { رَبِّ إِنِّي } من شدة جوعي وضعفي { لِمَآ أَنزَلْتَ إِلَيَّ } ورزقتني من موائد إفضالك وإنعامك { مِنْ خَيْرٍ } وصل إليَّ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولما وَرَدَ } وصل { ماء مدين } بئراً لهم\n { وجد عليه } على جانب البئر { أُمّةً } جماعة كثيرة { من الناس } من أناس مختلفين { يسقون } مواشيهم\n { ووجد من دونِهِمُ } في مكان أسفل من مكانهم { امرأتين تَذُودَان }: تطردان غَنَمَهُمَا عن الماء\n حتى تَصْدُرَ مواشي الناس ثم تسقيان لأن علىالماء من هو أقوى منهما\n فلا يتمكنان من السقي\n أو: لئلا تختلط أغنامهما بأغنامهم\n والذود: الطرد والدفع\n { قال } لهما موسى: { ما خطبُكما }: ما شأنكما لا تسقيان؟ والأصل: ما مخطوبكما\n أي: مطلوبكما\n فسمي المطلوب خَطْباً\n { قالتا لا نسقي } غنمنا { حتى يُصْدِرَ الرّعَاءُ } \n أي: يصرفوا مواشيهم\n يقال: أصدر عن الماء وصدر\n والمضارع: يَصْدُر ويَصْدِر\n والرعاء: جمع راع\n كقائم وقيام\n والمعنى: لا نستطيع مزاحمة الرجال\n فإذا صدروا سقينا مواشينا\n { وأبُونا شيخ كبير } السن\n لا يمكنه سقي الأغنام وهو شعيب بن نويْب بن مدين بن إبراهيم - عليهما السلام - وقيل: هو \" يثرون \" ابن أخي شعيب\n وكان شعيب قد مات بعدما كفَّ بَصَرُهُ\n ودفن بين المقام وزمزم\n والأول أصح وأشهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:78",
      "similarity": 0.25786969551008676
    },
    {
      "verse": "11:72",
      "similarity": 0.21383444084465011
    },
    {
      "verse": "40:67",
      "similarity": 0.18759938302656842
    },
    {
      "verse": "79:31",
      "similarity": 0.13520390171690744
    },
    {
      "verse": "87:4",
      "similarity": 0.11849756499088893
    }
  ]
}