{
  "chapter": "القصص",
  "text": "فلما قضى موسى الاجل وسار باهله ءانس من جانب الطور نارا قال لاهله امكثوا۟ انى ءانست نارا لعلى ءاتيكم منها بخبر او جذوة من النار لعلكم تصطلون",
  "translations": [
    {
      "translation": "When Musa had fulfilled the appointed term and had set off with his family, he noticed a fire from one side of the Mount. He said to his family, 'Stay here, I can see a fire. Hopefully I will bring you back some news from it or a burning branch from the fire so that you will be able to warm yourselves.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses had fulfilled the term and was journeying with his family, he noticed a fire on the side of the mountain. \"Wait here,\" he said to his family; \"I have seen a fire. I may haply bring some news from there, or an ember that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses had fulfilled the term and was journeying with his family, he perceived a fire in the direction of the Mount (Sinai). He said to his family: \"Wait here; I have observed a fire. Maybe I will bring to you some news or a brand of fire from there that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses completed the term of the contract and departed from his employer with his family, he saw a fire (on his way) on one side of the Mount (Sinai). He asked his wife, \"Stay here. I can see some fire. Perhaps I will be able to bring some news of it or some fire for you to warm-up yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Moosa completed his term and was travelling with his wife, he saw a fire in the direction of the Mount (Sinai); he said to his wife “Stay here – I have sighted a fire in the direction of the mount – perhaps I may bring you some news from it, or an ember so that you may warm yourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when Musa had fulfilled the term, and was traveling with his family, he saw a fire in the direction of At-Tur. He said to his family: \"Wait, I have seen a fire; perhaps I may bring to you from there some information, or a burning firebrand that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Musa had fulfilled the term, and he journeyed with his family, he perceived on this side of the mountain a fire. He said to his family: Wait, I have seen a fire, maybe I will bring to you from it some news or a brand of fire, so that you may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Moses had accomplished the term and departed with his household, he observed on the side of the Mount a fire. He said to his household, 'Tarry you here; I observe a fire. Perhaps I shall bring you news of it, or a faggot from the fire, that haply you shall warm yourselves.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when Moses had fulfilled the term, and was travelling with his housefolk, he saw in the distance a fire and said unto his housefolk: Bide ye (here). Lo! I see in the distance a fire; peradventure I shall bring you tidings thence, or a brand from the fire that ye may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses completed the term and set out with his family, he noticed a fire in the direction of Mount Tur. He said to his family: \"Stay here, I can see a fire. Perhaps I can bring you news, or a burning brand from the fire with which you may warm yourself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when Musa had fulfilled the term, and was journeying with his household, he saw a fire on the side of Tur, and said unto his household: bide ye; verily I see a fire afar, haply I may bring unto you tidings thereon, or a brand out: of the fire, haply ye may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Moses completed the term and set out with his family, he descried a fire on the side of the mountain. He said to his family, ‘Wait! Indeed, I descry a fire! Maybe I will bring you some news from it, or a brand of fire so that you may warm yourselves.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when Moses had fulfilled the term, and was travelling with his family, he perceived a fire in the direction of Mount Tur. He said to his family: \"Tarry ye; I perceive a fire; I hope to bring you from there some information, or a burning firebrand, that ye may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when Musa (Moses) had fulfilled the term, and was travelling with his family, he saw a fire in the direction of Tur (Mount). He said to his family: \"Wait, I have seen a fire; perhaps I may bring to you from there some information, or a burning fire-brand that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses had fulfilled the term and departed with his household, he saw from far away on the side of the Tor a fire. He said to his household: 'Stay here, for I can see a fire. Perhaps I can bring you news, or a flame from the fire so that you can warm yourselves'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses had completed the term, and departed with his family, he noticed a fire by the side of the Mount. He said to his family, “Stay here, I have glimpsed a fire. Perhaps I can bring you some information from there, or an ember from the fire, that you may warm yourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses had completed the term and was traveling with his family, he perceived from the direction of the mount a fire. He said to his family, \"Stay here; indeed, I have perceived a fire. Perhaps I will bring you from there [some] information or burning wood from the fire that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:29] So when Moses had completed the term, of his tending — of eight years, or of ten years, which is what is generally assumed — and was travelling with his family, his wife, with the permission of her father, in the direction of Egypt, he saw in the distance on the side of the Mount [Tūr] a fire (al-Tūr is the name of a   mountain). He said to his family, ‘Wait, here; I see a fire in the distance. Maybe I will bring you from it news, about [how to rejoin] the route [to Egypt] — for he had strayed from it [along the way] — or a brand (read with any of the three vowels [jadhwa, jidhwa, or judhwa], which [either] means ‘a bundle’, or ‘a flame’) from the fire, that you may warm yourselves’ (tastalūna: the tā’ replaces the tā’ of the [8th verbal paradigm] ifta‘ala of the verb saliya, or salaya).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَلَمَّا قَضَى مُوسَى الْأَجَلَ وَسَارَ بِأَهْلِهِ آَنَسَ مِنْ جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آَنَسْتُ نَارًا لَعَلِّي آَتِيكُمْ مِنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ (29)\\* فَلَمَّا قضى مُوسَى الاجل وَسَارَ بِأَهْلِهِ ءَانَسَ مِن جَانِبِ الطور نَاراً قَالَ لاَِهْلِهِ امكثوا } .لم يذكر القرآن أي الأجلين قضى موسى إذ لا يتعلق بتعيينه غرض في سياق القصة . وعن ابن عباس «قضى أوفاهما وأطيبهما إن رسول الله إذا قال فعل» أي أن رسول الله المستقبل لا يصدر من مثله إلا الوفاء التام ، وورد ذلك عن النبي صلى الله عليه وسلم في أحاديث ضعيفة الأسانيد أنه سئل عن ذلك فأجاب بمثل ما قال ابن عباس . والأهل من إطلاقه الزوجة كما في الحديث : \" والله ما علمت على أهلي إلا خيراً \"وفي سفر الخروج : أنه استأذن صهره في الذهاب إلى مصر لافتقاد أخته وآله . وبقية القصة تقدمت في سورة \\[ النمل : 7 \\] إلا زيادة قوله : { آنس من جانب الطور ناراً } وذلك مساوٍ لقوله هنا ( إذ رأى ناراً فقال لأهله امكثوا إني آنست ناراً .والجذوة مثلث الجيم ، وقرىء بالوجوه الثلاثة ، فالجمهور بكسر الجيم ، وعاصم بفتح الجيم وحمزة وخلف بضمها ، وهي العود الغليظ . قيل مطلقاً وقيل المشتعل وهو الذي في «القاموس» . فإن كان الأول فوصف الجذوة بأنها من النار وصف مخصص ، وإن كان الثاني فهو وصف كاشف ، و { من } على الأول بيانية وعلى الثاني تبعيضية .\n\n",
      "translations": [
        {
          "translation": "(Then, when Moses had fulfilled the term) ten years, (and was travelling with his housefolk) towards Egypt, (he saw in the distance a fire) he saw on the left side of the road a fire (and said unto his housefolk: Bide ye (here)) remain her. (Lo! I see in the distance a fire; peradventure I shall bring you tidings thence) from the Fire camp, (or a brand from the Fire that ye may warm yourselves) because they were in the cold winter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ جَذْوَةٍ مِّنَ ٱلنَّارِ } معناهُ قِطعةٌ منهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Or a fragment of fire from the Fire\" - its meaning is a piece of it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فلما قضى موسى الأجل } أي: بلغ حدّ الكمال الذي هو أقصر الأجلين { وسار بأهله } من القوى بأسرها إلى جانب القدس مستصحباً للجميع بحيث لم يمانعه ولم يتخلف عنه واحدة منها\n وحصل له ملكة الاتصال للتدرب في المجاهدة والمراقبة بلا كلفة { آنس من جانب الطور } طور السرّ الذي هو كمال القلب في الارتقاء نار روح القدس وهو الأفق المبين الذي أوحى منه إلى من أوحى إليه من الأنبياء { في البقعة المباركة } أي: مقام كمال القلب المسمى سرّاً من شجرة نفسه القدسية { أن يا موسى إنني أنا الله } وهو مقام المكالمة والفناء في الصفات فيكون القائل والسامع هو الله\n كما قال:\n \" كنت سمعه الذي به يسمع\n ولسانه الذي به يتكلم \" \nوإلقاء العصا والإدبار وإظهار اليد البيضاء مرّ تأويله في سورة النمل\n { واضمم إليك جناحك من الرهب } أي: لا تخف من الاحتجاب والتلوين عند الرجوع من الله واربط جأشك بتأييدي آمناً متحققاً بالله\n وقد سمعت شيخنا المولى نور الدين عبد الصمد قدّس الله روحه العزيز في شهود الوحدة ومقام الفناء عن أبيه أنه كان بعض الفقراء في خدمة الشيخ الكبير شهاب الدين السهروردي في شهود الوحدة ومقام الفناء ذا ذوق عظيم\n فإذا هو في بعض الأيام يبكي ويتأسف\n فسأله الشيخ عن حاله\n فقال: إني حجبت عن الوحدة بالكثرة\n ورددت\n فلا أجد حالي\n فنبّه الشيخ على أنه بداية مقام البقاء\n وإن حاله أعلى وأرفع من الحال الأولى وأمنه { فذانك برهانان من ربّك } من التمتع المذكور",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا قَضَىٰ مُوسَى ٱلأَجَلَ } أي: أقصى الأجلين\n ومكث عنده عشراً أخر بعدما تزوج ابنته\n للاسترشاد والاستكمال\n وبعدما كمل بصحبة المرشد الكامل المكمل أراد أن يرجع إلى قومه فخرج من عنده { وَسَارَ بِأَهْلِهِ } نحو مصر\n وهي حاملة فجاءها الطلق في ليلة شاتية مظلمة\n وهم على جناح السفر ضالين عن الطريق { آنَسَ } أي: أبصر موسى { مِن جَانِبِ ٱلطُّورِ } أي: من الجهة التي تجاه الطور { نَاراً } ففرح من رؤيتها { قَالَ لأَهْلِهِ ٱمْكُثُوۤاْ } ساعة { إِنِّيۤ آنَسْتُ } وأبصرت { نَاراً } ومن هذا يُعلم أن أهله لم يروها\n أذهب إليها { لَّعَلِّيۤ آتِيكُمْ مِّنْهَا بِخَبَرٍ } من الطريق أستخبر من عندنا { أَوْ جَذْوَةٍ } أي: عود غليظ معي شيء { مِّنَ ٱلنَّارِ } إن لم أجد عندها أحداً { لَعَلَّكُمْ تَصْطَلُونَ } [القصص: 29] تستدفئون من البرد\n فمكثوا\n\n\nفبادر إليها سريعاً { فَلَمَّآ أَتَاهَا } وقرب إليها { نُودِيَ مِن شَاطِىءِ ٱلْوَادِي } أي: شفيره وجانبه { ٱلأَيْمَنِ } باليمن\n والكرامة الواقعة { فِي ٱلْبُقْعَةِ ٱلْمُبَارَكَةِ } التي كثر الخير والبركة فيها { مِنَ ٱلشَّجَرَةِ } أي: نُودي من الشجرة التي تعقد النار عليها نداءً عجيباً معرباً عن اسمه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { فلما قضى موسى الأجلَ } \n قال صلى الله عليه وسلم:\n \" قضى أبعدهما وأطيبهما \" \n\n وفي رواية: \" أبرهما وأوفاهما \" { وسارَ بأهله } أي: امرأته\n نحو مصر\n قال مجاهد: ثم استأذن موسى أن يزور أهله بمصر\n فأذن له\n فسار بأهله إلى البَرِّيَّةِ\n فأوى إلى جانب الطور الغربي الأيمن\n في ليلة مظلمة شديدة البرد\n وكان أخذ على غير طريق\n يخاف ملوك الشام - قلت: ولعلهم كانوا من تحت يد قرعون - فأخذ امْرَأَتَهُ الطَّلقُ\n فقدح زنده\n فلم يور\n فآنس من جانب الطور ناراً\n هـ\n وقال ابن عطاء: لما تم أجل المحنة\n ودنت أيام الزلفة\n وظهرت أنوار النبوة\n سار بأهله ليشتركوا معه في لطائف صنع ربه\n هـ\n { آنس } أي: أبصر { من جانب الطُور } أي: من الجهة التي تِلْوَ الطورِ { ناراً قال لأهله امكثوا إني آنستُ ناراً لعلي آتيكم منها بخبر } عن الطريق لأنه كان ضل عنها\n { أو جذوة من النار } أي: قطعة وشُعلة منها\n والجُذوة - مثلثة الجيم: العُود الذي احترق بعضه\n وجمعه: \" جِذّى \"\n { لعلكم تصطلون } تستدفئون بها\n والاصطلاء على النار سُنَّة المتواضعين\n وفي بعض الأخبار: \" اصطلوا فإن الجبابرة لا يصطلون \"\n { فلما أتاها نُودي من شاطىء الوادِ الأيمنِ } بالنسبة إلى موسى\n أي: عين يمين موسى\n { في البقعة المباركةِ } بتكليم الله تعالى فيها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:77",
      "similarity": 0.1965946531200239
    },
    {
      "verse": "17:106",
      "similarity": 0.1799479164308159
    },
    {
      "verse": "20:10",
      "similarity": 0.1793091352545438
    },
    {
      "verse": "18:3",
      "similarity": 0.17508313282704008
    },
    {
      "verse": "28:46",
      "similarity": 0.164288076098437
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}