{
  "chapter": "القصص",
  "text": "وجاء رجل من اقصا المدينة يسعى قال يموسى ان الملا ياتمرون بك ليقتلوك فاخرج انى لك من النصحين",
  "translations": [
    {
      "translation": "A man came running from the furthest part of the city, saying, 'Musa, the Council are conspiring to kill you, so leave! I am someone who brings you good advice.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There came a man running from the other part of the city. \"O Moses,\" he said, \"the chiefs are deliberating to kill you. Go away from the city. I wish you well.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then a man came running from the farther end of the city and said: \"O Moses, the nobles are deliberating about you that they may put you to death. So do be gone. I am one of your well-wishers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A man came running from the farthest part of the city saying, \"Moses, people are planning to kill you. I sincerely advise you to leave the city.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a man came running from the outer part of the city; he said, “O Moosa! Indeed the court members are considering killing you, therefore go away – I surely am your well-wisher.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there came a man running, from the farthest end of the city. He said: \"O Musa! Verily, the chiefs are taking counsel together about you, to kill you, so escape. Truly, I am one of the good advisers to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a man came running from the remotest part of the city. He said: O Musa! surely the chiefs are consulting together to slay you, therefore depart (at once); surely I am of those who wish well to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then came a man from the furthest part of the city, running; he said, 'Moses, the Council are conspiring to slay thee. Depart; I am one of thy sincere advisers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a man came from the uttermost part of the city, running. He said: O Moses! Lo! the chiefs take counsel against thee to slay thee; therefor escape. Lo! I am of those who give thee good advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A man came running from the far side of the city, and said, \"Moses, the authorities are conspiring to kill you, so leave the city. I am one of your well-wishers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there came a man from the farthest part of the city, running; he said: O Musa! the chiefs are taking counsel together concerning thee, that they might slay thee; wherefore go forth thou, verily I am unto thee of the admonishers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There came a man from the city outskirts, hurrying. He said, ‘Moses! The elite are indeed conspiring to kill you. So leave. I am indeed your well-wisher.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there came a man, running, from the furthest end of the City. He said: \"O Moses! the Chiefs are taking counsel together about thee, to slay thee: so get thee away, for I do give thee sincere advice.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there came a man running, from the farthest end of the city. He said: \"O Musa (Moses)! Verily, the chiefs are taking counsel together about you, to kill you, so escape. Truly, I am to you of those who give sincere advice.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then a man came running from the furthest part of the city, 'Moses' he said, 'the Assembly are plotting to kill you. Leave, for I am one of your sincere advisers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a man came from the farthest part of the city running. He said, “O Moses, the authorities are considering killing you, so leave; I am giving you good advice.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a man came from the farthest end of the city, running. He said, \"O Moses, indeed the eminent ones are conferring over you [intending] to kill you, so leave [the city]; indeed, I am to you of the sincere advisors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:20] And a man, who was the [only] believer among Pharaoh’s kinsfolk, came from the outskirts of the city, hastening, walking fast, via a route quicker than theirs. He said, ‘O Moses, lo! the council, of Pharaoh’s folk, are conspiring, discussing [the means], to slay you. So leave, the city. Truly I am speaking to you in good faith’, in bidding you to leave.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And a man) Ezekiel (came from the uttermost part) and it is said from the centre (of the city, running. He said: Moses! Lo! the chiefs) the family of the man killed (take counsel against thee) they agreed (to slay thee; therefore escape) from the city. (Lo! I am of those who give thee good advice) I am of those who feel pity for you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلْمَلأَ يَأْتَمِرُونَ بِكَ } معناه يَتَشاورونَ فِيكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما انتشر الخبر بن القوم، وشارع بن الأنام إلى أن وصل الخبر إلى فرعون وملئه بقتل موسى بعدما شاوروا في شأنه { جَآءَ رَجُلٌ } مؤمن { مِّنْ أَقْصَا ٱلْمَدِينَةِ } إلى موسى، وهو ابن عمه حالك كونه { يَسْعَىٰ } يسرع ويتبختر { قَالَ يٰمُوسَىٰ إِنَّ ٱلْمَلأَ } أيك فرعون وأشراف قومه { يَأْتَمِرُونَ بِكَ } وتشاوروا في شأنك واستقر رأيهم { لِيَقْتُلُوكَ } قصاصاً { فَٱخْرُجْ } من المدينة ذا الساعة { إِنِّي } من كمال عطفي { لَكَ مِنَ ٱلنَّاصِحِينَ } [القصص: 20] أنصحك بالخروج من بينهم؛ لئلا يلحقك شرهم وضرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجاء رجلٌ من أقصى المدينة } من آخرها، واسمه: \" حزقيل بن حبورا \" ، مؤمن آل فرعون، وكان ابن عم فرعون، { يسعى }: يُسرع في مشيه، أو: يمشي على رجله، { قال يا موسى إن الملأ يأتمرون بك } ، أي: يتشاورون في قتلك، ويأمر بعضهم بعضاً بذلك",
      "translations": []
    }
  ]
}