{
  "chapter": "القصص",
  "text": "قال ذلك بينى وبينك ايما الاجلين قضيت فلا عدون على والله على ما نقول وكيل",
  "translations": [
    {
      "translation": "He said, 'That is agreed between me and you. Whichever of the two terms I fulfil, there should be no bad feeling towards me. Allah is Guardian over what we say.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: \"This is (agreed) between you and me. Whichever term I fulfil, no injustice will be done to me. God is witness to our agreement.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied: \"So that is agreed between me and you. Whichever of the two terms I fulfil, I trust that I shall not be wronged. Allah is a witness over the covenant we are committing ourselves to.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said, \"Let it be a binding contract between us and I shall be free to serve for any of the said terms. God will bear witness to our agreement.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “This is agreed between me and you; there shall be no claim upon me if I fulfil any of these two terms; and Allah is the Trustee upon this word of ours.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Musa) said: \"That (is settled) between me and you: whichever of the two terms I fulfill, there will be no injustice to me, and Allah is Surety over what we say.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This shall be (an agreement) between me and you; whichever of the two terms I fulfill, there shall be no wrongdoing to me; and Allah is a witness of what we say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'So let it be between me and thee. Whichever of the two' terms I fulfil, it shall be no Injustice to me; and God is guardian of what we say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: That (is settled) between thee and me. Whichever of the two terms I fulfil, there will be no injustice to me, and Allah is Surety over what we say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"That is agreed between me and you; whichever of the two terms I fulfil, there will be no blame on me. God is witness to what we say.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: be that between me and thee: whichsoever of the two terms I shall fulfil, it shall be no harshness to me; and of that which we say Allah is Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘This will be [by consent] between you and me. Whichever of the two terms I complete, there shall be no imposition upon me, and Allah is witness over what we say.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Be that (the agreement) between me and thee: whichever of the two terms I fulfil, let there be no ill-will to me. Be Allah a witness to what we say.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Musa (Moses)] said: \"That (is settled) between me and you whichever of the two terms I fulfill, there will be no injustice to me, and Allah is Surety over what we say.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be it between me and you' said Moses. 'Whichever of the two terms I fulfill, it will be no injustice to me. Allah is the Guardian of what we say'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Let this be an agreement between you and me. Whichever of the two terms I fulfill, there shall be no reprisal against me; and God is witness over what we say.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"That is [established] between me and you. Whichever of the two terms I complete - there is no injustice to me, and Allah, over what we say, is Witness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:28] He, Moses, said, ‘That, which you have said, is [settled then] between me and you. Whichever of the two terms, the eight or the ten (the mā [in ayyamā, ‘whichever of the two’] is extra), in other words, the tending thereof, I complete, there shall be no injustice [done] to me, by demanding [of me] to do more [tending]. And God is Guardian, Keeper or Witness, over what we, you and I, say’. The contract was agreed in this way. Shu‘ayb bid his daughter to give Moses a staff with which to beat off predatory beasts from his sheep — the staffs of the prophets were in his keeping. It was Adam’s staff, made from the myrtle of Paradise, that fell into her hands and so Moses took it, with Shu‘ayb’s knowledge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Moses said: (That (is settled) between thee and me) I agree to the conditions. (Whichever of the two terms I fulfil) eight or ten years, (there will be no injustice to me) after that you will have no right over me, (and Allah is Surety) Witness (over what we say) over the conditions agreed between us and their fulfilment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ عُدْوَانَ عَلَيَّ } معناهُ لا تَعدّيَ عليَّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Do not aggression against me\" means do not aggression against me.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال: { أيَّما الأجلين قضيتُ } أي: أيُّ الأجلين قضيت من الأجلين: العشر أو الثماني\n { فلا عدوان عَلَيّ } أي: لا يتعدى عليّ في طلب الزيادة عليه\n قال المبرد: قد علم أنه لا عدوان عليه في إتمامهما\n ولكن جمعهما ليجعل الأقل كالأتم في الوفاء\n وكما أن طلب الزيادة على الأتم عدوان فلذلك طلب الزيادة على الأقل\n { والله على ما نقول وكيل } أي: رقيب وشهيد\n واختلف العلماء في وجوب الإشهاد في النكاح على قولين: أحدهما: أنه لا ينعقد إلا بشاهدين\n وبه قال أبو حنيفة والشافعي\n وقال مالك: ينعقد بدون شهود لأنه عَقْدُ معاوضة\n فلا يشترط فيه الإشهاد\n وإنما يشترط فيه الإعلان\n والإظهار بالدف والدخان ليتميز من السفاح\n ويجب عند الدخول\n رُوي أن شعيباً كانت عنده عصِيّ الأنبياء - عليهم السلام -\n فقال لموسى بالليل: ادخل ذلك البيت فخذ عصاً من تلك العصي\n فأخذ عصا هبط بها آدم من الجنة\n ولم يزل الأنبياء - عليهم السلام - يتوارثونها\n حتى وقعت إلى شعيب\n فلما أخذها\n قال له شعيب: ردها وخذ غيرها\n فما وقع في يده إلا هي سبع مرات\n - وفي رواية السدي: أمر ابنته أن تأتيه بعصا فجاءته بها\n فلما رآها الشيخ قال: آتيه بغيرها\n فألقتها لتأخذ غيرها\n فلا تصير في يده إلا هي\n مراراً\n فرفعتها إليه\n فعلم أن له شأناً\n\nولما أصبح قال له شعيب: إذا بلغتَ مفرق الطريق فلا تأخذ على يمينك\n فإن الكلأ\n وإن كان بها أكثر\n إلا أن فيها تنيناً\n أخشاه عليك وعلى الغنم\n فأخذت الغنم ذات اليمين ولم يقدر على كفها\n فمشى على أثرها\n فإذا عشب وريف لم ير مثله\n فنام\n فإذا التنين قد أقبل\n فحاربته العصا حتى قتلته\n وعادت إلى جنب موسى دامي\n فلما أبصرها دامية\n والتنينَ مقتولاً ارتاح لذلك\n ولما رجع إلى شعيب بالغنم فوجدها ملأى البطون غزيرة اللبن\n وأخبره موسى\n فرح\n وعلم أن لموسى شأناً\n وقال له: إني وهبت لك من نتاج غنمي\n هذا العام\n كُلَّ أَدْرَعَ وَدَرْعَاءَ - أي: كل جدي أبلق\n وأثنى بلقاء - فأوحى الله تعالى إلى موسى في المنام: أن اضرب بعصاك الماء الذي تسقى منه الغنم\n فضرب\n ثم سقى الأغنام\n فوضعت كلها بلقاء\n فسلمها شعيب إليه\n وذكر الإمام اللجائي في كتابه قطب العارفين: أن موسى عليه السلام انتهى\n ذات يوم\n بأغنامه إلى واد كثير الذئاب\n وكان قد بلغ به التعب\n فبقي متحيراً\n إن اشتغل بحفْظ الغنم عجز عن ذلك لغلبة النوم عليه والتعب\n وإن هو طلب الراحة\n وثبَت الذئابُ على الغنم\n فرمى السماء بطرفه\n وقال: إلهي إنه أحاط علمك\n ونفذت إرادتك\n وسبق تقديرك\n ثم وضع رأسه ونام\n فلما استيقظ وجد ذئباً واضعاً عصاه على عاتقه\n وهو يرعى الغنم\n فتعجب موسى من ذلك\n فأوحى الله إليه: يا موسى كن لي كما أريد\n أكن لك كما تريد\n قال: فهذه إشارة تدل على أن: مَنْ هَرَبَ مِنَ الله إلى الله كفاه الله\n عز وجل\n مَنْ دُونَهُ\n هـ\n والله تعالى أعلم\n الإشارة: فجاءته - أي: القلب - إحدى الخصلتين الفناء والبقاء\n تمشي على مهل وقدر فإن الوصول إلى المقامات إنما يكون بتدريج\n على حسب القَدَر السابق\n قالت إحدى الخصلتين: إن ربي يدعوك إلى حضرته ليجزيك أجر ما سقيت\n واستعملت في جانب الوصول إلينا\n فلما جاءه\n أي: وصل إليه\n وتمكن منه\n وقص عليه القصص\n وهو ما جرى له مع نفسه وجنودها من المجاهدات والمكابدات\n قال: لا تخف اليوم\n حين وصلت إلينا\n نجوت من القوم الظالمين\n قالت إحداهما: يا رب استأجره في العبودية شكراً\n إن خير من استأجرت القوي الأمين لأن عمله بالله\n محفوفاً برعاية الله\n قال: إني أريد أن أعطيك إحدى الخصلتين\n إما الإقامة في الفناء المستغرِق\n أو الرجوع إلى البقاء المستفيق\n لتقوم بالأدب على ان تخدم ثماني حجج\n فإن أتممت عشراً\n لزيادة التمكين\n فمن عندك\n فأقل خدمة المريد للشيخ ثماني سنين\n ونهايتها نهاية التمكين\n قال الورتجبي: لأن شعيباً\n عليه السلام رأى بنور النبوة أن موسى عليه السلام يبلغ درجة الكمال في ثماني حجج\n ولا يحتاج إلى التربية بعد ذلك\n ورأى أن كمال الكمال في عشر حجج لأنه رأى أن بعد العشرة لا يبقى مقام الإرادة\n ويكون بعد ذلك حراً\n ولذلك قال: وما أريد أن أشق عليك\n هـ\n ثم ذكر رجوع موسى إلى مصر\n فقال: { فَلَمَّا قَضَىٰ مُوسَى ٱلأَجَلَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:12",
      "similarity": 0.45921403906278263
    },
    {
      "verse": "27:79",
      "similarity": 0.41462579390388915
    },
    {
      "verse": "64:13",
      "similarity": 0.4062618310867189
    },
    {
      "verse": "6:102",
      "similarity": 0.36896819362414224
    },
    {
      "verse": "11:104",
      "similarity": 0.3583514291763373
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}