{
  "chapter": "القصص",
  "text": "قال انى اريد ان انكحك احدى ابنتى هتين على ان تاجرنى ثمنى حجج فان اتممت عشرا فمن عندك وما اريد ان اشق عليك ستجدنى ان شاء الله من الصلحين",
  "translations": [
    {
      "translation": "He said, 'I would like to marry you to one of these two daughters of mine on condition that you work for Allah willing, to be one of the salihun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I would like to marry one of these two daughters of mine to you if you agree to work for me on hire for eight years. And if you stay on for ten, it is up to you. I do not wish to impose any hardship on you. God willing you will find me a man of honour.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her father said to Moses: \"I want to marry one of these two daughters of mine to you if you serve me for eight years. But if you complete ten years, that will be of your own accord (but not an obligation). I do not intend to treat you harshly. If Allah wills, you will find me an upright man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Shu'ayb) said to (Moses), \"I want to give one of my daughters to you in marriage on the condition that you will work for me for eight years, but you may continue for two more years only out of your own accord. I do not want it to become a burden for you. God willing, you will find me a righteous person\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I wish to give you one of these two daughters of mine in marriage, the bridal money being that you work for me for eight years; then if you complete ten years, it will be from you; and I do not wish to put you in hardship; Allah willing, you will probably find me of the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I intend to wed one of these two daughters of mine to you, on condition that you serve me for eight years; but if you complete ten years, it will be (a favor) from you. But I intend not to place you under a difficulty. If Allah wills, you will find me one of the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I desire to marry one of these two daughters of mine to you on condition that you should serve me for eight years; but if you complete ten, it will be of your own free will, and I do not wish to be hard to you; if Allah please, you will find me one of the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'I desire to marry thee to one of these my two daughters, on condition that thou hirest thyself to me for eight years. If thou completest ten, that shall be of thy own accord; I do not desire to' press hard 'upon thee. Thou shalt assuredly find me, if God wills, one of the righteous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lo! I fain would marry thee to one of these two daughters of mine on condition that thou hirest thyself to me for (the term of) eight pilgrimages. Then if thou completest ten it will be of thine own accord, for I would not make it hard for thee. Allah willing, thou wilt find me of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The father said, \"I would like to marry you to one of these two daughters of mine on the condition that you stay eight years in my service. But if you wish it, you may stay ten. I do not want to impose any hardship on you. God willing, you will find me a fair person.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: verily I wish I would marry thee to one of these two daughters of mine provided that thou hirest thyself to me for eight years. then if thou completest ten it will de of thine own accord, and I would not make it hard for thee; thou Shalt find me, Allah willing, of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Indeed I desire to marry you to one of these two daughters of mine, on condition that you hire yourself to me for eight years. And if you complete ten, that will be up to you, and I do not want to be hard on you. God willing, you will find me to a righteous person.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I intend to wed one of these my daughters to thee, on condition that thou serve me for eight years; but if thou complete ten years, it will be (grace) from thee. But I intend not to place thee under a difficulty: thou wilt find me, indeed, if Allah wills, one of the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I intend to wed one of these two daughters of mine to you, on condition that you serve me for eight years, but if you complete ten years, it will be (a favour) from you. But I intend not to place you under a difficulty. If Allah will, you will find me one of the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'I will let you marry one of these two daughters of mine on condition that you hire yourself to me for eight years. If you complete ten that is of your own accord; I shall not press you. Surely, you will find me, if Allah wills, among the good'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I want to marry you to one of these two daughters of mine, provided you work for me for eight years. But if you complete ten, that is up to you. I do not intend to impose any hardship on you. You will find me, God willing, one of the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Indeed, I wish to wed you one of these, my two daughters, on [the condition] that you serve me for eight years; but if you complete ten, it will be [as a favor] from you. And I do not wish to put you in difficulty. You will find me, if Allah wills, from among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:27] He said, ‘I desire to marry you to one of these two daughters of mine, either the elder or the younger one, on condition that you hire yourself to me, that you are employed by me to tend my flock, for eight years. And if you complete ten, that is, the tending of ten years, that, completion, shall be of your own accord. I do not want to be hard on you, by making it [the marriage] conditional on ten [years service]. God willing — [expressed] to seek [God’s] blessing — you shall find me to be one of the righteous’, of those who fulfil their covenants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Yathron said to Moses: (Lo! I fain would marry thee) Moses (to one of these two daughters of mine on condition that thou hirest thyself to me) to look after my flock (for (the term of) eight pilgrimages) eight years. (Then if thou completest ten) ten years (it will be of thine own accord) the increase of term will be of your own accord, (for I would not make it hard for thee) by increasing the term. (Allah willing, thou wilt find me of the righteous) who fulfil their promise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فإن أتممت عشراً } بالترقي في طورين آخرين هما الفناء في الذات والبقاء بعده بالتحقق { فمن عندك } فمن كمال استعدادك وقوّته وخصوصية عينك واقتضاء هويتك وهي الكمالات العشر التي ابتلى بها إبراهيم ربّه فأتمهنّ فجعله إماماً للناس في مقام التوحيد والله أعلم\n { وما أريد أن أشق عليك } أحمل عليك فوق طاقتك وما لا يفي به وسع استعدادك { ستجدني إن شاء الله من الصالحين } المربين بما يصلح للوصول من الإفاضات والعلوم\n الهادين إلى ما في أصل الاستعداد من الكمال المودع في عين الذات بالأنوار\n غير مكلفين ما لم يكن في وسعك\n { ذلك بيني وبينك } ذلك الأمر الذي عاهدتني عليه قائم بيني وبينك\n يتعلق بقوّتنا واستعدادنا وسعينا\n لا مدخل لغيرنا فيه { أيما الأجلين قضيت فلا عدوان عليّ } أيما النهايتين بلغت فلا إثم عليّ\n إذ لا عليّ إلا السعي\n وأما البلوغ فهو بحسب ما أوتيت من الاستعداد في الأزل وإنما تتقدّر قوتي في السعي بحسب ذلك والله هو الذي وكل إليه أمرنا وفي ذلك شاهد عليه\n أي: ما أوتينا من الكمال المقدّر لنا أمر تولاه الله بنفسه وعينه من فيضه الأقدس لا يمكن لأحد تغييره ولا يطلع عليه أحد غيره\n ولا يعلم قبل الوصول قدر الكمال المودع في الاستعداد وهو غيب الغيوب الذي استأثر به الله لذاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { هاتين } يدل على أن له غيرهما\n وهذه مواعدة منه\n لا عقد\n وإلا لقال: أنكحتك\n { على أن تأجُرَنِي } أي: تكون أجيراً لي\n من أجرته: إذا كنت له أجيراً { ثمانِيَ حِجَجٍ } سنين والحجة: السنة\n والتزوج على رعي الغنم جائز في شرعنا\n على خلاف في مذهبنا\n { فإِن أتممتَ عشراً } أي: عشر حجج { فمن عندك } أي: فلذلك تفضلٌ منك\n ليس بواجب عليك\n أو: فإتمامه من عندك\n ولا أحتمه عليك\n { وما أريد أن أشق عليك } بإلزام أتم الأجلين\n من المشقة\n { ستجدني إن شاء الله من الصالحين } في حسن المعاملة\n والوفاء بالعهد\n أو مطلقاً\n وعلق بالمشيئة\n مراعاة لحسن الأدب مع الربوبية\n { قال } موسى عليه السلام: { ذلك } العهد وعقد الأجرة { بيني وبينك } أي: ذلك الذي قُلْتَهُ\n وشارطتني عليه\n قائم بيننا جميعاً\n لا يخرج واحد منا عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:142",
      "similarity": 0.25787965229037246
    },
    {
      "verse": "3:73",
      "similarity": 0.24543693707696132
    },
    {
      "verse": "2:79",
      "similarity": 0.24141846333438538
    },
    {
      "verse": "16:95",
      "similarity": 0.23678794957515645
    },
    {
      "verse": "3:199",
      "similarity": 0.2313743949056038
    }
  ]
}