{
  "chapter": "القصص",
  "text": "واخى هرون هو افصح منى لسانا فارسله معى ردءا يصدقنى انى اخاف ان يكذبون",
  "translations": [
    {
      "translation": "and my brother Harun is more eloquent than me so send him with me to support me and back me up. I am afraid they will call me a liar.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So send my brother Aaron with me as helper for he is more fluent than I with words, that he should affirm me, for I fear that they would call me a liar.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My brother Aaron is more eloquent in speech than I: so send him with me as a helper to confirm my truthfulness for I fear that they will reject me as a liar.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My brother Aaron is more fluent then I am. Send him with me to assist me and express my truthfulness; I am afraid they will reject me\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And my brother Haroon – he is more eloquent than I am in speech, therefore in order to help me, appoint him as a Noble Messenger so that he confirms me; I fear that they will deny me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my brother Harun -- he is more eloquent in speech than me, so send him with me as a helper to confirm me. Verily, I fear that they will deny me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my brother, Haroun, he is more eloquent of tongue than I, therefore send him with me as an aider, verifying me: surely I fear that they would reject me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moreover my brother Aaron is more eloquent than I. Send him with me as a helper and to confirm I speak truly, for' I fear they will cry me lies.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My brother Aaron is more eloquent than me in speech. Therefor send him with me as a helper to confirm me. Lo! I fear that they will give the lie to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My brother Aaron is more eloquent than I am. Send him with me to support me and back me up. For I fear that they will reject me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And My brother Harun! He is more eloquent than I in speech; wherefore send him with me as a support, to corroborate me; verily I fear that they shall belie me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron, my brother—he is more eloquent than me in speech. So send him with me as a helper to confirm me, for I fear that they will impugn me.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my brother Aaron - He is more eloquent in speech than I: so send him with me as a helper, to confirm (and strengthen) me: for I fear that they may accuse me of falsehood.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my brother Harun (Aaron) he is more eloquent in speech than me so send him with me as a helper to confirm me. Verily! I fear that they will belie me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron my brother has a more eloquent tongue than I, (please) send him with me as a helper to confirm I speak truly, I fear that they will belie me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my brother Aaron, he is more eloquent than me, so send him with me, to help me, and to confirm my words, for I fear they will reject me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my brother Aaron is more fluent than me in tongue, so send him with me as support, verifying me. Indeed, I fear that they will deny me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:34] And my brother Aaron is more eloquent, more intelligible, than me in speech. So send him with me as a helper, as an aid (a variant reading [for rid’an, ‘helper’] is ridan) to confirm me (read [either] in apocopated form, yusadiqnī, as a response to the request, or [as an indicative] with damma inflection, yusadiqunī, as an adjectival qualification of rid’an, ‘helper’), for I truly fear that they will deny me’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(My brother Aaron is more eloquent then me in speech) because Moses had a slight speech impediment. (Therefore send him with me as a helper to confirm me) to speak on my behalf and confirm my words. (Lo! I fear that they will give the lie to me) deny the message I bring to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَرْسِلْهُ مَعِيَ رِدْءاً } معناه مُعينٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Send him with me as a companion,\" means that he is to be accompanied.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وشدة شكيمتهم وغضبهم عليَّ { أَخَافُ أَن يُكَذِّبُونِ } [القصص: 34] دفعة\n ولا ينطلق لساني بمجادلتهم\n بسبب لكنتي فأفوت بلكنتي حكمة رسالتي\n وأحكام دعوتي ونبوتي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:13",
      "similarity": 0.07934375388560812
    },
    {
      "verse": "25:35",
      "similarity": 0.060193448318182886
    },
    {
      "verse": "23:45",
      "similarity": 0.058041429523111636
    },
    {
      "verse": "20:30",
      "similarity": 0.056871329009920646
    },
    {
      "verse": "19:53",
      "similarity": 0.055995876911546914
    }
  ]
}