{
  "chapter": "القصص",
  "text": "قال سنشد عضدك باخيك ونجعل لكما سلطنا فلا يصلون اليكما بـايتنا انتما ومن اتبعكما الغلبون",
  "translations": [
    {
      "translation": "He said, 'We will reinforce you with your brother and by Our Signs will give you both authority, so that they will not be able to lay a hand on you. You and those who follow you will be the victors.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And) God said: \"We shall strengthen your arm with your brother, and give you power with Our signs and give you authority, so that they will not be able to harm you. Both of you and your followers will be victorious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"We will certainly strengthen you through your brother and will invest both of you with such power that they shall not be able to hurt you. With the help of Our Signs the two of you and your followers will prevail.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord said, \"We will support you by your brother and will grant you such prestige that no one will dare to approach anyone of you. By the help of Our miracles both you and your follower will certainly triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “We will soon strengthen your arm with your brother, and give you both dominance, so they will not be able to harm you; due to Our signs; you both, and those who will follow you, will be victorious.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: \"We will strengthen your arm through your brother, and give you both power, so they shall not be able to harm you, with Our Ayat; you two as well as those who follow you, will be the victors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: We will strengthen your arm with your brother, and We will give you both an authority, so that they shall not reach you; (go) with Our signs; you two and those who follow you shall be uppermost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'We will strengthen thy arm by means of thy brother, and We shall appoint. to you an authority, so that they shall not reach you because of Our signs; you, and whoso follows you, shall be the victors.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: We will strengthen thine arm with thy brother, and We will give unto you both power so that they cannot reach you for Our portents. Ye twain, and those who follow you, will be the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said: \"We shall strengthen your arm through your brother, We shall give you both power, so that they shall not be able to harm you. Set forth with Our signs. You, and those who follow you, will surely prevail.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: We shall indeed strengthen thine arm with thy brother, and We shall vouchsafe unto you authority, so that they shall not be able to come up to you. Go forth with Our signs! Ye twain and those who follow you, shall be the victors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘We will strengthen your arm by means of your brother, and invest both of you with such authority that they will not touch you. With the help of Our signs, you two, and those who follow the two of you, shall be the victors.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"We will certainly strengthen thy arm through thy brother, and invest you both with authority, so they shall not be able to touch you: with Our Sign shall ye triumph,- you two as well as those who follow you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: \"We will strengthen your arm through your brother, and give you both power, so they shall not be able to harm you, with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), you two as well as those who follow you will be the victors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'We will strengthen your arm with your brother, and appoint for you both an authority so that they shall not reach you. With our signs you and those who follow you shall be the victors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “We will strengthen your arm with your brother, and We will give you authority, so they will not touch you. By virtue of Our signs, you and those who follow you will be the triumphant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"We will strengthen your arm through your brother and grant you both supremacy so they will not reach you. [It will be] through Our signs; you and those who follow you will be the predominant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:35] He said, ‘We will strengthen your arm, We will make you strong, by means of your brother, and We will give authority, victory, so that they will not be able to touch [either of] you, with any evil; go both of you, with Our signs the two of you, and those who follow you [two], will be the victors’, over them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَانًا فَلَا يَصِلُونَ إِلَيْكُمَا بِآَيَاتِنَا أَنْتُمَا وَمَنِ اتَّبَعَكُمَا الْغَالِبُونَ (35)استجاب الله له دعوتيه وزاده تفضلاً بما لم يسأله فاستجابة الدعوة الثانية بقوله { سنشد عضدك بأخيك } ، واستجابة الأولى بقوله { فلا يصلون إليكما } ، والتفضل بقوله { ونجعل لكما سلطاناً } ، فأعطى موسى ما يماثل ما لهارون من المقدرة على إقامة الحجة إذ قال { ونجعل لكما سلطاناً } . وقد دل على ذلك ما تكلم به موسى عليه السلام من حجج في مجادلة فرعون كما في سورة الشعراء ، وهنا وما خاطب به بني إسرائيل مما حكي في سورة الأعراف . ولم يحك في القرآن أن هارون تكلم بدعوة فرعون على أن موسى سأل الله تعالى أن يحلل عقدة من لسانه كما في سورة طه ، ولا شك أن الله استجاب له .والشد : الربط ، وشأن العامل بعضو إذا أراد أن يعمل به عملاً متعباً للعضو أن يربط عليه لئلا يتفكك أو يعتريه كسر ، وفي ضد ذلك قال تعالى { ولما سقط في أيديهم } \\[ الأعراف : 149 \\] وقولهم : فُتَّ في عضده ، وجعل الأخ هنا بمنزلة الرباط الذي يشد به . والمراد : أنه يؤيده بفصاحته ، فتعليقه بالشد ملحق بباب المجاز العقلي . وهذا كله تمثيل لحال إيضاح حجته بحال تقوية من يريد عملاً عظيماً أن يشد على يده وهو التأييد الذي شاع في معنى الإعانة والإمداد ، وإلا فالتأييد أيضاً مشتق من اليد . فأصل معنى ( أيد ) جعل يداً ، فهو استعارة لإيجاد الإعانة .والسلطان هنا مصدر بمعنى التسلط على القلوب والنفوس ، أي مهابة في قلوب الأعداء ورعباً منكما كما ألقى على موسى محبة حين التقطه آل فرعون . وتقدم معنى السلطان حقيقة في قوله تعالى { فقد جعلنا لوليه سلطاناً } في سورة الإسراء .( 33 ) وفرع على جعل السلطان { فلا يصلون إليكما } أي لا يؤذونكما بسوء وهو القتل ونحوه . فالوصول مستعمل مجازاً في الإصابة . والمراد : الإصابة بسوء ، بقرينة المقام .وقوله { بآياتنا أنتما ومن اتبعكما الغالبون } يجوز أن يكون { بآياتنا } متعلقاً بمحذوف دل عليه قوله { إلى فرعون وملائه } \\[ القصص : 32 \\] تقديره : اذهبا بآياتنا على نحو ما قدّر في قوله تعالى { في تسع آيات إلى فرعون } \\[ النمل : 12 \\] وقوله في سورة النمل بعد قوله { وأدخل يدك في جيبك تخرج بيضاء من غير سوء في تسع آيات } \\[ النمل : 12 \\] أي اذهبا في تسع آيات . وقد صرح بذلك في قوله في سورة الشعراء ( 15 ) { قال كلا فاذهبا بآياتنا إنا معكم مستمعون }ويجوز أن يتعلق ب { نجعل لكما سلطاناً } ، أي سلطاناً عليهم بآياتنا حتى تكون رهبتهم منكما آية من آياتنا ، ويجوز أن يتعلق ب { لا يصلون إليكما } أي يصرفون عن أذاكم بآيات منا كقول النبي صلى الله عليه وسلم « نُصِرتُ بالرعب » ويجوز أن يكون متعلقاً بقوله { الغالبون } أي تغلبونهم وتقهرونهم بآياتنا التي نؤيدكما بها .وتقديم المجرور على متعلقه في هذا الوجه للاهتمام بعظمة الآيات التي سيعطيانها . ويجوز أن تكون الباء حرف قسم تأكيداً لهما بأنهما الغالبون وتثبيتاً لقلوبهما .وعلى الوجوه كلها فالآيات تشمل خوارق العادات المشاهدة مثل الآيات التسع ، وتشمل المعجزات الخفية كصرف قوم فرعون عن الإقدام على أذاهما مع ما لديهم من القوة وما هم عليه من العداوة بحيث لولا الصرفة من الله لأهلكوا موسى وأخاه .ومحل العبرة من هذا الجزء من القصة التنبيه إلى أن الرسالة فيض من الله على من اصطفاه من عباده وأن رسالة محمد صلى الله عليه وسلم كرسالة موسى جاءته بغتة فنودي محمد في غار جبل حراء كما نودي موسى في جانب جبل الطور ، وأنه اعتراه من الخوف مثل ما اعترى موسى ، وأن الله ثبته كما ثبت موسى ، وأن الله يكفيه أعداءه كما كفى موسى أعداءه .\n\n",
      "translations": [
        {
          "translation": "(He said) Allah said: (We will strengthen thine arm with thy brother) Aaron, (and We will give unto you both power) a proof and argument (so that they cannot reach you for Our portents) in order to kill you. (Ye twain, and those who follow you) by believing in you and the signs you bring, (will be the winners) against Pharaoh and his people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَنَشُدُّ عَضُدَكَ بِأَخِيكَ } معناه سنُقويكَ بِهِ، ونُعينُكَ عليه\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We will strengthen your arm with your brother\" means that We will support you and help you with him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { سنشدّ عضدك بأخيك } نقويك بمعاضدته { ونجعل لكما } غلبة بتأثيرك فيهم بالقدرة الملكوتية وتأييدك العقل بالقوّة القدسية\n وإظهار العقل كمالك في الصورة العملية والحجّة القياسية { فأوقد لي يا هامان } نار الهوى على طين الحكمة الممتزجة من ماء العلم وتراب الهيئات المادية { فاجعل لي } مرتبة عالية من الكمال\n من صعد إليها كان عارفاً\n وهو إشارة إلى احتجابه بنفسه\n وعدم تجرّد عقله من الهيئات المادّية لشوب الوهم\n أي: حاولت النفس المحجوبة بأنائيته من عقل المعاش المحجوب بمعقوله أن يبني بنياناً من العلم والعمل المشوبين بالوهميات\n ومقاماً عالياً من الكمال الحاصل بالدراسة والتعلّم لا بالوراثة والتلقي\n من استعلى عليه توهم كونه عارفاً بالغاً حدّ الكمال\n كما ذكر في الشعراء أنهم كانوا قوماً محجوبين بالمعقول عن الشريعة والنبوّة\n متدربين بالمنطق والحكمة\n معتنين بهما\n معتقدين الفلسفة غاية الكمال\n منكرين للعرفان والسلوك والوصال { لعلي أطلع إلى إله موسى } بطريقة التفلسف\n وإنما ظنّه من الكاذبين لقصوره عن درجة العرفان والتوحيد\n واحتجابه بصفة الأنائية والطغيان والتفرعن بغير الحق من غير أن يتّصفوا بصفة الكبرياء عند الفناء\n فيكون تكّبرهم بالحق لا بالباطل عن صفات نفوسهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } له سبحانه على وجه التأييد والتعضيد: { سَنَشُدُّ عَضُدَكَ } ونقويك { بِأَخِيكَ } مع ذلك لا تيأس من توفيقنا إياك\n إذ بعدما أرسلناكما إلى فرعون وملئه { وَنَجْعَلُ لَكُمَا سُلْطَاناً } حجة قاطعة بها تغلبان عليهم { فَلاَ يَصِلُونَ إِلَيْكُمَا } بقهر واستيلاء { بِآيَاتِنَآ } أي: بسبب آياتنا التي معكما\n ولا تخافا عن غلبتهم عليكما\n بسبب شوكتهم وكثرة عَددهم وعُددهم\n بل { أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا } من المؤمنين هم { ٱلْغَالِبُونَ } [القصص: 35] المقصورون على الغلبة\n لا تتعدة الغلبة عنكم\n وهم المغلوبون المنحصرون على المغلوبية\n لا يتجاوزون عنها أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ونجعلُ لكما سلطاناً } غلبة وتسلطاً وهيبة في قلوب الأعداء\n { فلا يَصِلُون إليكما بآياتنا } بسبب آياتنا\n القاهرة لهم عن التسلط عليكم\n فالباء تتعلق بيصلون\n أو: بنجعل لكما سلطاناً\n أي: تسلطاً بآياتنا\n أو: بمحذوف\n أي: اذهبا بآياتنا\n أو: هو بيان لغالبون\n أي: { أنتما ومن اتبعكما الغالبون } \nأي: المنصورون\n الإشارة: إذا اجتمع في زمانٍ نبيان\n أو: وليان\n لا تجدهما إلا متخالفين في القوة والليونة\n أو في السكر والصحو\n فكان مُوسَى في غاية القوة\n وأخوه في غاية الليونة\n وكان موسى عليه السلام في أول الرسالة غالباً عليه الجذب\n وأخوه غالباً عليه الصحو\n فلذلك استعان به\n قال الورتجبي: افهَمْ أن مقام الفصاحة هو مقام الصحو والتمكين\n الذي يقدر صاحبه أن يخبر عن الحق وأسراره\n بعبارة لا تكون بشيعة في موازين العلم\n وهذا حال نبينا محمد صلى الله عليه وسلم\n حيث قال:\n \" أنا أفصح العرب \" \nو\n \" بُعثتُ بجوامع الكلم \" \nوهذه قدرته قادرية اتصف بها العارف المتمكن\n الذي بلغ مشاهدة الخاص\n ومخاطبة الخاص\n وكان موسى عليه السلام في محل السكر في ذلك الوقت\n ولم يطق أن يعبر عن حاله كما كان لأن كلامه\n لو خرج على وزان حاله\n يكون على نعوت الشطح\n عظيماً في آذان الخلق\n وكلام السكران ربما يفتتن به الخلق\n لذلك سأل مقام الصحو والتمكين بقوله: { واحلل عقدة من لساني } لأن كلامه من بحر المكافحة والمواجهة الخاصة\n التي كان مخصوصاً بها عن أخيه\n هـ\n ثم ذكر عناد فرعون وتجبّره\n فقال: { فَلَمَّا جَآءَهُم مُّوسَىٰ بِآيَاتِنَا\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:51",
      "similarity": 0.8063192224011652
    },
    {
      "verse": "28:51",
      "similarity": 0.2461748456523089
    },
    {
      "verse": "13:21",
      "similarity": 0.23239324517468618
    },
    {
      "verse": "4:90",
      "similarity": 0.2151838776192112
    },
    {
      "verse": "2:27",
      "similarity": 0.19027354275458855
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}