{
  "chapter": "القصص",
  "text": "واستكبر هو وجنوده فى الارض بغير الحق وظنوا۟ انهم الينا لا يرجعون",
  "translations": [
    {
      "translation": "He and his troops were arrogant in the land without any right. They thought that they would not return to Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He and his soldiers had become arrogant in the land for no reason, and did not think that they have to come back to Us in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he and his hosts waxed arrogant in the land without any right, believing that they will never have to return to Us!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh and his army were puffed-up with pride in the land for no true cause. They thought that they would never return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he and his soldiers wrongfully sought greatness in the land, and assumed they would never be brought back to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he and his armies were arrogant in the land, without right, and they thought that they would never return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he was unjustly proud in the land, he and his hosts, and they deemed that they would not be brought back to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he waxed proud in the land, he and his hosts, wrongfully; and they thought they should not be returned to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he and his hosts were haughty in the land without right, and deemed that they would never be brought back to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He and his hosts behaved arrogantly in the land without any justification, thinking that they would not be recalled to Us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he and his hosts were stiff-necked in the land without right, and imagined that before Us they would not be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He and his hosts unduly acted arrogantly in the land, and thought they would not be brought back to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he was arrogant and insolent in the land, beyond reason,- He and his hosts: they thought that they would not have to return to Us!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he and his hosts were arrogant in the land, without right, and they thought that they would never return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He and his hosts became wrongfully proud in the land and they thought that they would never be returned to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He and his troops acted arrogantly in the land, with no justification. They thought they would not be returned to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he was arrogant, he and his soldiers, in the land, without right, and they thought that they would not be returned to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:39] And he and his hosts acted arrogantly in the land, the land of Egypt, without right, and thought they would not return to Us (read active yarji‘ūna, or passive yurja‘ūna, ‘they would [not] be brought back’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "440 (And he and his hosts) the Copts (were haughty) too proud to accept faith (in the land) of Egypt (without right) to do so, (and deemed that they would never be brought back to Us) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال سكرتهم وعمههم، وإمهالنا إياهم متمتعين { ٱسْتَكْبَرَ هُوَ } أي: فرعون { وَجُنُودُهُ فِي ٱلأَرْضِ بِغَيْرِ ٱلْحَقِّ } والاستحقاق، وترقبوا في عتوهم وعنادهم إلى أن ظهروا على الله بأمثال هذه الهذيانات الباطلة { وَظَنُّوۤاْ } بالإقدام والجرأة على مثل هذه الخرافات { أَنَّهُمْ } بعد خلعهم لوازم الناسوت { إِلَيْنَا لاَ يُرْجَعُونَ } [القصص: 39] رجوع الأظلال إلى الأضواء المنعكسة من شمس الذات، والأمواج إلى الماء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واستكبر هو وجنوده } تعاظم { في الأرض } أرض موسى { بغير الحق } بغير استحقاق، بل بالباطل، فالاستكبار بالحق هو لله تعالى، وهو المتكبر المتعالي، المبالغ في كبرياء الشأن، كما في الحديث القدسي:\n\n \" الكبرياء ردائي، والعظمة إزاري، فمن نازعني واحداً منهما قصمته \" \n\n، أو: ألقيته في النار، وكل مستكبر سواه فاستكباره بغير الحق\n { وظنوا أنهم إلينا لا يُرجَعُون } بالبعث والنشور\n وقرأ نافع وحمزة والكسائي: بالبناء للفاعل\n والباقي: للمفعول\n والله تعالى أعلم\n الإشارة: الأرواح كلها برزت من عالم العز والكبرياء، وهو عالم الجبروت، فما هبطت إلى عالم الأشباح، وكلفت بالعبودية، وبالخضوع لقهرية الربوبية، شق عليها، ونفرت من التواضع والذل، وبطشت إلى أصلها لأنها من عالم العز، فبعث الله الرسل ومشايخ التربية يدلونها على ما فيه سعادتها\n من الذل والتواضع والخضوع للحق، حتى تصل إلى الحق، فمن سبق له الشقاء أنف، وقال: ما هذا إلا سحر مفترى، وما سمعنا بهذا في آبائنا الأولين، واستكبر وطغى، فغرق في بحر الردى\n ومن سبقت له السعادة تواضع، وذل لعظمة مولاه، فوصله إلى العز الدائم، في حضرة جماله وسناه\n ولذلك قيل: للنفس خاصية ما ظهرت إلا على فرعون، حيث قال: أنا ربكم الأعلى\n وهذه الخاصية هي أصل نشأتها وبروزها، حيث برزت من عالم الجبروت قال تعالى: { وَنَفَخْتُ فِيهِ مِن رُّوحِى } ولكن لم يفتح لها الباب إلا من جهة العبودية والذل والافتقار، كما قال الشاعر:\n\nولا يرضى المحبوب من المحب إلا الأدب، وهو التذلل والخضوع، كما قائل القائل:\n\nثم ذكر وبال من تكبّر على الله، فقال: { فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي ٱلْيَمِّ\n\n\n }\n\n",
      "translations": []
    }
  ]
}