{
  "chapter": "القصص",
  "text": "اسلك يدك فى جيبك تخرج بيضاء من غير سوء واضمم اليك جناحك من الرهب فذنك برهنان من ربك الى فرعون وملاي۟ه انهم كانوا۟ قوما فسقين",
  "translations": [
    {
      "translation": "Put your hand inside your shirt front. It will emerge pure white yet quite unharmed. And hug your arms to your sides to still your fear. These are two proofs from your Lord for Pharaoh and his ruling circle. They are a deviant people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand inside your shirt. It will come out white without a tarnish of blame; and do not be perturbed or afraid. These are two proofs from your Lord for the Pharaoh and his nobles. They are certainly a rebellious people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand into your bosom, and it will come out shining without any blemish; and draw your hand close to your body to still your fear. Those are the two clear Signs from your Lord for Pharaoh and his chiefs, for truly they are a disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Place your hand in your pocket; it will come out sheer white but not sick. Be humble for fear of God and show these two miracles of your Lord to the Pharaoh and his officials; they are an evil-doing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Put your hand inside your armpit – it will come out shining white, not due to any illness; and put your hand on your chest to remove the fear – so these are two proofs from your Lord to Firaun and his court members; indeed they are a lawless people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand into the opening of your garment, it will come forth white without a disease; and draw your hand close to your side to be free from the fear. These are two proofs from your Lord to Fir`awn and his chiefs. Verily, they are the people who are rebellious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enter your hand into the opening of your bosom, it will come forth white without evil, and draw your hand to yourself to ward off fear: so these two shall be two arguments from your Lord to Firon and his chiefs, surely they are a transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Insert thy hand into thy bosom, and it will come forth white without evil; and press to thee thy arm, that thou be not afraid. So these shall be two proofs from thy Lord to Pharaoh and his Council; for surely they are an ungodly people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thrust thy hand into the bosom of thy robe it will come forth white without hurt. And guard thy heart from fear. Then these shall be two proofs from your Lord unto Pharaoh and his chiefs. Lo! they are evil-living folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand into your bosom; it will come out [shining] white, without blemish; now draw your arm close to your body to calm your fears. These are two credentials from your Lord for Pharaoh and his nobles. Surely, they are a rebellious people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slip thy hand in thy bosom, it shall come forth white without hurt; and draw back thy arm unto thee for fear. These shall be two proofs from thy Lord unto Fir'awn and his chiefs; verily they have been a people given to transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Insert your hand into your shirt. It will emerge white, without any fault, and keep your arms drawn in awe to your sides. These shall be two proofs from your Lord to Pharaoh and his elite. They are indeed a transgressing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move thy hand into thy bosom, and it will come forth white without stain (or harm), and draw thy hand close to thy side (to guard) against fear. Those are the two credentials from thy Lord to Pharaoh and his Chiefs: for truly they are a people rebellious and wicked.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand in your bosom, it will come forth white without a disease, and draw your hand close to your side to be free from fear (that which you suffered from the snake, and also by that your hand will return to its original state). these are two Burhan (signs, miracles, evidences, proofs) from your Lord to Fir'aun (Pharaoh) and his chiefs. Verily, they are the people who are Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand in the neck (of your shirt), it will come out luminous, unharmed, and draw your arm to you so that you are not afraid. These are two signs from your Lord to Pharaoh and his Assembly. Surely, they were an impious nation.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your hand inside your pocket, and it will come out white, without blemish. And press your arm to your side, against fear. These are two proofs from your Lord, to Pharaoh and his dignitaries. They are truly sinful people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Insert your hand into the opening of your garment; it will come out white, without disease. And draw in your arm close to you [as prevention] from fear, for those are two proofs from your Lord to Pharaoh and his establishment. Indeed, they have been a people defiantly disobedient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:32] Insert your, right, hand, meaning, the palm, into your bosom (jayb is the neck [area] of the shirt) and [then] take it out, and it will emerge, not in its usual skin colour [but], white, without any blemish, any [vestige of] leprosy. So he inserted it and took it out and it shone as bright as the sun, blinding the eyes; and draw your arm [back] to your side [as a precaution] against fear (read rahab, rahb or ruhb), in other words, [against] the fear produced by the glow of the hand, so that you insert it [back] into your bosom and it is restored to its former state; it [the arm] is referred to as jināh, ‘wing’, because they are for humans what wings are for birds. These then (read fa-dhānika or fa-dhānnika) namely, the staff and the hand (both of which [‘asā and yad] are feminine nouns, but the demonstrative pronoun [dhānika] used for them, being the subject, is in the masculine because its predicate is masculine) shall be two proofs, to be sent, from your Lord to Pharaoh and his council; for surely they are an immoral people’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاسْلُكْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ وَاضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ فَذَانِكَ بُرْهَانَانِ مِنْ رَبِّكَ إِلَى فِرْعَوْنَ وَمَلَئِهِ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ (32)إما إلى تكرير مفاد قوله { اسلُك يدك في جيبك } وحرف العطف مانع من احتمال التأكيد . وادعاء أن يكون التكرير لاختلاف الغرض من الأول والثاني كما في «الكشاف» بعيد ، أو يؤول بأن وضع اليد على الصدر يذهب الخوف كما عُزي إلى الضحاك عن ابن عباس وإلى مجاهد وهو تأويل بعيد . وهذا ميل إلى أن الجناح مجاز مرسل مراد به يد الإنسان . وللجناح حقيقة ومجازات بين مرسل واستعارة وقد ورد في القرآن وغيره في تصاريف معانيه وليس وروده في بعض المواضع بمعنى بقاض بحمله على ذلك المعنى حيثما وقع في القرآن . ولذا فالوجه أن قوله { واضمم إليك جناحك } تمثيل بحال الطائر إذا سكن عن الطيران أو عن الدفاع جعل كناية عن سكون اضطراب الخوف . ويكون { من } هنا للبدلية ، أي اسكن سكون الطائر بدلاً من أن تطير خوفاً .وهذا مأخوذ من أحد وجهين ذكرهما الزمخشري قيل : وأصله لأبي علي الفارسي . و { الرهب } معروف أنه الخوف كقوله تعالى { يدعوننا رغباً ورهباً } \\[ الأنبياء : 90 \\] .والمعنى : انكفف عن التخوف من أمر الرسالة . وفي الكلام إيجاز وهو ما دل عليه قوله بعده { قال رب إني قتلت منهم نفساً فأخاف أن يقتلون } \\[ القصص : 33 \\] فقوله { واضمم إليك جناحك من الرهب } في معنى قوله تعالى { فلا يصلون إليكما بآياتنا أنتما ومن اتبعكما الغالبون } \\[ القصص : 35 \\] .وقرأ الجمهور { الرهب } بفتح الراء والهاء ، وقرأه حمزة والكسائي وأبو بكر عن عاصم وخلف بضم الراء وسكون الهاء . وقرأه حفص عن عاصم بفتح الراء وسكون الهاء وهي لغات فصيحة .{ مِنَ الرهب فَذَانِكَ برهانان مِن رَّبِّكَ إلى فِرْعَوْنَ وَمَلَئِهِ إِنَّهُمْ كَانُواْ } .تفريع على قوله { واضمم إليك جناحك من الرهب } والإشارة إلى العصا وبياض اليد . والبرهان : الحجة القاطعة . و { من } للابتداء ، و { إلى } للانتهاء المجازي أي حجتان على أن أرسل بهما إليهم .وجملة { إنهم كانوا قوماً فاسقين } تعليل لجملة { فذانك برهانان من ربك إلى فرعون وملائه } لتضمنها أنهم بحيث يقرعون بالبراهين فبين أن سبب ذلك تمكن الكفر من نفوسهم حتى كان كالجبلة فيهم وبه قوام قوميتهم لما يؤذن به قوله { كانوا } . وقوله { قوماً } كما تقدم في قوله تعالى { لآيات لقوم يعقلون } في سورة \\[ البقرة : 164 \\] . والفسق : الإشراك بالله .وقرأ الجمهور { فذانك } بتخفيف النون من ( ذانك ) على الأصل في التثنية . وقرأه ابن كثير وأبو عمرو ورويس عن يعقوب بتشديد نون { فذانك } وهي لغة تميم وقيس . وعلّلها النحويون بأن تضعيف النون تعويض على الألف من ( ذا ) و ( تا ) المحذوفة لأجل صيغة التثنية . وفي «الكشاف» : أن التشديد عوض عن لام البعد التي تلحق اسم الإشارة فلذلك قال «فالمخفف مثنى ذاك والمشدد مثنى ذلك» . وهذا أحسن .\n\n",
      "translations": [
        {
          "translation": "Allah then said to him: (Thrust thy hand into the bosom of thy robe) in your armpit, Moses, (it will come forth white) shining like the rays of the sun (without hurt) without being afflicted with leprosy. (And guard thy heart) and put back your hand in your armpit after that (from fear) from the difference, if people get scared. (Then these shall be two proofs from your Lord unto Pharaoh and his chiefs: Lo! they are evil-living folk) disbelievers who caused corruption because of their state of idolatry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱضْمُمْ إِلَيْكَ جَنَاحَكَ } معناه يَدُكَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And take to yourself your wing} His meaning your hand",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أمر سبحانه ثانياً\n تأكيداً لتأنيسه إياه بقوله: { ٱسْلُكْ } وأدخل { يَدَكَ فِي جَيْبِكَ تَخْرُجْ } على الفور { بَيْضَآءَ } مضيئة منيرة\n محيرة للعقول والأبصار\n من كمال إشراقها وضوئها\n مع أنها { مِنْ غَيْرِ سُوۤءٍ } أي: مرض من برص وبهق\n فأدخل وأخرج فرأى ما رأى { وَ } بعدما رأى موسى يده في غاية البياض والصفاء استوحش أيضاً منها واسترهب عن عروض المرض إليها\n أمره سبحانه ثالثاً\n إزالة لحزنه بقوله: { ٱضْمُمْ إِلَيْكَ جَنَاحَكَ } أي: يديك\n وأطوِ كشحك { مِنَ ٱلرَّهْبِ } أي: الخوف والحزن\n وهذا كناية عن الطمأمنينة والوقار\n وعدم إخطار الخوف في البال\n\n\n{ فَذَانِكَ } أي: العصا واليد والبيضاء { بُرْهَانَانِ } أي: شاهدان على نبوتك ورسالتك\n ومعجزتان باهرتان لك لمن يعارض معك وأنكر عليك رسالتك\n منتشئان { مِن } أمر { رَّبِّكَ } تأييداً لك ولأمرك حين أرسلك { إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ } لتدعوهم إلى توحيد الحق وصراط مستقيم\n وتنذرهم عمَّا هم عليه من الإفراط والتفريط { إِنَّهُمْ } من غاية انهماكهم في الغفلة والغرور { كَانُواْ قَوْماً فَاسِقِينَ } [القصص: 32] خارجين عن مقتضى الحدود الإلهية الموضوعة في شرائع الأنبياء الماضين\n والرسل المنقرضين\n\n\nثمَّ لمَّا سمع موسى من ربه ما سمع { قَالَ } معتذاراً مستظهراً: { رَبِّ } يا من رباني بسوابق النعم { إِنِّي قَتَلْتُ مِنْهُمْ نَفْساً } خطأ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { اسلكْ }: أَدْخِلْ { يدكَ في جَيْبِكَ } جيب قمصيك { تخرج بيضاءَ } لها شعاع كشعاع الشمس { من غير سُوءٍ } برص\n { واضمم إليك جناحكَ من الرَّهْبِ } \n أي: الخوف\n فيه لغات: \" الرُّهبُ \" \n بفتحتين\n وبالفتح والسكون\n وبالضم معه\n وبضمتين\n والمعنى: واضمم يدك إلى صدرك يذهب ما لحقك من الخوف لأجل الحية\n وعن ابن عباس رضي الله عنه: كل خائف\n إذا وضع يده على صدره\n ذهب خوفه\n وقيل: المراد بضم يده إلى جناحه تجلده\n وضبطه نفسه عند انقلاب العصا حية\n حتى لا يضطرب ولا يرهب\n استعارة من فعل الطائر لأنه إذا خاف نشر جناحيه وأرخاهما\n { فذانِك } أي: اليد والعصا\n ومن شدد فإحدى النونين عِوَضٌ من المحذوف\n { بُرهانان } أي: حجتان نيرتان\n وسميت الحجة برهاناً لإنارتها\n من قولهم: بَره الشيء: إذا ابيض\n والمرأة بَرهَاءُ وَبرَهْرَهَةٌ: أي: بيضاء\n { من ربك إلى فرعون وملئه } أي: أرسلناك إلى فرعون وقومه بهاتين الحجتين\n { إنهم كانوا قوماً فاسقين }: خارجين عن الحق\n كافرين بالله ورسوله\n الإشارة: قد تقدم في سورة \" طه \" بعض إشارتها\n ويؤخذ من الآية أن تزوج المريد\n بعد كمال تربيته\n كمال\n وأما قبل كماله: فإن كان بإذن شيخه فلا يضره\n وربما يتربى له اليقين أكثر من غيره\n وقوله تعالى: { وسار بأهله } قال الورتجبي: افهم أن مواقيت الأنبياء والأولياء وقت سير الأسرار من بدء الإرادة إلى عالم الأنوار\n هـ\n وقوله تعالى: { آنست ناراً } قال الورتجبي: الحكمة في ذلك: أن طبع الإنسانية يميل إلى الأشياء المعهودة\n لذلك تجلى النور في النار لاستئناسه بلباس الاستئناس\n ولا تخلوا النار من الاستئناس\n خاصة في الشتاء\n وكان شتاءً\n فتجلى الحق بالنور في لباس النار لأنه كان في طلب النار\n فأخذ الحق مراده\n وتجلى مِنْ حَيْثُ إِرَادَاته\n وهو سنة الله تعالى\n هـ\n وقوله تعالى: { من الشجرة } أي: نودي منها حقيقة إذ ليس في الوجود إلا تجليات الحق ومظاهره\n فيكلم عباده من حيث شاء منها\n قال في العوارف: الصوفي لتجرده\n يشهد التالي كشجرة موسى\n حيث أسمعه الله خطابه منها\n بأني أنا الله لا إله إلا أنا\n هـ\n فأهل التوحيد الخاص لا يسمعون إلا من الله\n بلا واسطة\n قد سقطت الوسائط في حقهم\n حين غرقوا في بحر شهود الذات\n فافهم\n وقال في القوت: كانت الشجرة وجهة موسى عليه السلام\n كلمة الله عز وجل منها\n كما قال بعضهم: إن قوله تعالى:\n[الأعراف: 107\n والشعراء: 32]\n أي: بالجبل\n كان الجبل من جهة الحس حجاباً لموسى\n كشفه الله عنه\n فتجلى به\n كما قال: { من الشجرة } فكانت الشجرة وجهة له عليه السلام هـ\n بإيضاح\n والله تعالى أعلم\n ثم ذكر اعتذار موسى وطلبه الإعانة بأخيه\n فقال: { قَالَ رَبِّ إِنِّي قَتَلْتُ مِنْهُمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:22",
      "similarity": 0.6497713714197583
    },
    {
      "verse": "27:12",
      "similarity": 0.4854007909529139
    },
    {
      "verse": "24:31",
      "similarity": 0.1804641137839819
    },
    {
      "verse": "4:174",
      "similarity": 0.17224753038605867
    },
    {
      "verse": "23:117",
      "similarity": 0.1678779474040705
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}