{
  "chapter": "القصص",
  "text": "وقال موسى ربى اعلم بمن جاء بالهدى من عنده ومن تكون له عقبة الدار انه لا يفلح الظلمون",
  "translations": [
    {
      "translation": "Musa said, 'My Lord knows best who has come with guidance from Him and who will have the best Home in the end. The wrongdoers will certainly not be successful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Moses said: \"My Lord knows well who has come with guidance from Him, and for whom is the guerdon of Paradise. But surely the wicked will not prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied: \"My Lord knows best who comes with guidance from Him, and also whose end will be the best in the Hereafter. As for the wrongdoers, they shall not prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"My Lord knows best who has received guidance from Him and who will achieve a happy end. The unjust ones certainly will have no happiness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said Moosa, “My Lord well knows him who has brought guidance from Him, and for whom will be the abode the Hereafter; indeed the unjust never attain success.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: \"My Lord knows best him who came with guidance from Him, and whose will be the happy end in the Hereafter. Verily, the wrongdoers will not be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: My Lord knows best who comes with guidance from Him, and whose shall be the good end of the abode; surely the unjust shall not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Moses said, 'My Lord knows very well who comes with the guidance from Him, and shall possess the Ultimate Abode; surely the evildoers will not prosper.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: My Lord is Best Aware of him who bringeth guidance from His presence, and whose will be the sequel of the Home (of bliss). Lo! wrong-doers will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses replied, \"My Lord knows best who comes with guidance from Him and who will attain the heavenly abode in the hereafter. The wrongdoers shall never prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: My Lord best knoweth him who bringeth guidance from before Him and him whose will be the happy end of the Abode. Verily the wrong-doers shall not thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, ‘My Lord knows best who brings guidance from Him, and in whose favour the outcome of that abode will be. The wrongdoers will not be felicitous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"My Lord knows best who it is that comes with guidance from Him and whose end will be best in the Hereafter: certain it is that the wrong-doers will not prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa (Moses) said: \"My Lord knows best him who came with guidance from Him, and whose will be the happy end in the Hereafter. Verily, the Zalimun (wrong-doers, polytheists and disbelievers in the Oneness of Allah) will not be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied: 'My Lord knows well who brings guidance from Him and who shall possess the Last Residence. The harmdoers will not prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, “My Lord is well aware of him who brings guidance from Him, and him who will have the sequel of the abode. The wrongdoers will not succeed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, \"My Lord is more knowing [than we or you] of who has come with guidance from Him and to whom will be succession in the home. Indeed, wrongdoers do not succeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:37] And Moses said, (wa-qāla, or qāla, without the ‘and’) ‘My Lord knows best who brings guidance from Him (the suffixed pronoun [in ‘indihi] refers to the Lord) and whose (man here is a supplement to the previous man) will be (read takūna or yakūna) the sequel of the [Blissful] Abode, that is to say, the praiseworthy sequel in the Abode of the Hereafter, in other words, it is I [Moses], in both cases, and I speak truthfully in what I have brought [you]. Truly the evildoers, the disbelievers, will not be successful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Moses said: My Lord is best aware of him who bringeth guidance) who brings the message and the call for the profession of Allah's divine Oneness (from His presence, and whose will be the sequel of the Home (of bliss)) Paradise in the Hereafter. (Lo! wrong-doers) the idolaters (will not be successful) they will not be saved from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَاقِبَةُ ٱلدَّارِ } معناه آخرُهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"The outcome of [all] matters is in Allah's hand,\" means that their end is in His hands.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنها بمراحل عنها { قَالَ مُوسَىٰ } بعدما قنط من إيمانهم وصلاحهم: { رَبِّيۤ } الذي رباني بأنواع الكرامات { أَعْلَمُ } منِّي { بِمَن جَآءَ بِٱلْهُدَىٰ } والرشد المنزل { مِنْ عِندِهِ } بمقتضى وحيه وإلهامه\n ومن اهتدى واسترشد به { وَمَن تَكُونُ لَهُ عَاقِبَةُ ٱلدَّارِ } يعني: العاقبة الحميدة المترتبة على هذه النشأة التي هي دار الابتلاء والاختبار\n وبالجملة: { إِنَّهُ } سبحانه بمقتضى عدله وحكمته { لاَ يُفْلِحُ ٱلظَّالِمُونَ } [القصص: 37] الخارجون عن مقتضى الحدود الإلهية\n ولا يفوزون بما فاز المتقون من المثوبة العظمى والدرجة العليا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَن تكونُ له عاقبةُ الدار } أي: العاقبة المحمودة\n فإن المراد بالدار: الدنيا\n وعاقبتها الأصلية هي الجنة لأن الدنيا خلقت مَعْبراً ومجازاً إلى الآخرة\n والمقصود منها\n بالذات\n هو المجازاة على الأعمال فيها من الثواب الدائم\n أوالعقاب الأليم\n { إنه لا يُفلِحُ الظالمون } لا يفوزون بالهدى في الدنيا\n وحسن العاقبة في العقبى\n قال النسفي: قل ربي أعلم منكم بحال من أَهَّلَهُ الله للفلاح الأعظم حيث جعله نبياً وبعثه بالهدى\n ووعده حُسْنَ العُقْبَى\n يعني نفسه\n ولو كان كما تزعمون\n ساحراً\n مفترياً\n لما أَهَّلَهُ لذلك لأنه غني حكيم\n لا يرسل الكاذبين\n ولا يُنَبِّىءُ الساحرين\n ولا يفلح عنده الظالمون\n وعاقبة الدار هي العاقبة المحمودة لقوله تعالى:\n[الرعد: 22]\n والمراد بالدار: الدنيا\n وعاقبتها: أن تختم للعبد بالرحمة والرضوان\n ويلقى الملائكة بالبشرى والغفران\n هـ\n { وقال فرعونُ يا أيها الملأُ ما علمتُ لكم من إلهٍ غيري } \n قصد بنفي علمه بإله غيره نَفِيَ وُجُودِهِ\n أي: مالكم إله غيري\n قاله تجبراً ومكابرة\n وإلا فهو مقر بالربوبية لقوله تعالى حاكياً عن موسى عليه اسلام:\n[الإسراء: 102]\n ورُوي أنه كان إذا جن الليل\n لبس المسوح وتمرغ في الرماد\n وقال: يا رب إني كذاب فلا تفضحني\n ثم أَمَرَ ببنيان الصرح زيادة في الطغيان\n بقوله: { فأوقِدْ لي يا هامانُ على الطين } أي: اطبخ لي الآجر واتخذه\n وإنما لم يقل مكان الطين: آجرّ لأنه أول من عمله\n فهو معلمه الصنعة بهذه العبارة\n { فاجعل لي صرحاً } أي: قصراً عالياً\n { لعَلِّي أَطَّلِعُ } أي: أصعد\n فالطلوع والاطلاع: الصعود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:135",
      "similarity": 0.7054915647615222
    },
    {
      "verse": "2:5",
      "similarity": 0.5078095166760328
    },
    {
      "verse": "31:5",
      "similarity": 0.5078095166760328
    },
    {
      "verse": "10:77",
      "similarity": 0.48522423521824687
    },
    {
      "verse": "13:24",
      "similarity": 0.4430950362167651
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:37.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:37.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}