{
  "chapter": "القصص",
  "text": "فلما اتىها نودى من شطئ الواد الايمن فى البقعة المبركة من الشجرة ان يموسى انى انا الله رب العلمين",
  "translations": [
    {
      "translation": "But when he reached it a voice called out to him from the right hand side of the valley in the part which was full of blessing, from out of the bush: 'Musa, I am Allah, the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he drew near, a voice called out to him from the tree on the blessed spot on the right side of the valley: \"O Moses, I am verily God, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to the fire, a cry was heard from the right bank of the valley, from a tree in the hallowed ground: \"O Moses, verily I am Allah, the Lord of all creatures of the Universe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was called from a tree of the blessed spot of the bank of the right side of the valley when he appraoched it, \"Moses, I am God, the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached the fire, he was called out to from the right side of the valley in the blessed field, from the tree, “O Moosa! Indeed I am truly Allah, the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he reached it, he was called from the right side of the valley, in the blessed place, from the tree: \"O Musa! Verily, I am Allah, the Lord of all that exists!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to it, a voice was uttered from the right side of the valley in the blessed spot of the bush, saying: O Musa! surely I am Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came to it, a voice cried from the right of the watercourse, in the sacred hollow, coming from the tree: 'Moses, I am God, the Lord of all Being.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached it, he was called from the right side of the valley in the blessed field, from the tree: O Moses! Lo! I, even I, am Allah, the Lord of the Worlds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to it, he was called by a voice from a bush in a blessed spot, on the right side of the valley: \"O Moses, I am God, Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he was come thereto, he was called from the right side of the valley in the ground blest from the tree: Musa! verily I! I am Allah, the Lord of the worlds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he approached it, he was called from the right bank of the valley in that blessed site from the tree: ‘Moses! Indeed I am Allah, the Lord of all the worlds!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to the (fire), a voice was heard from the right bank of the valley, from a tree in hallowed ground: \"O Moses! Verily I am Allah, the Lord of the Worlds....\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he reached it (the fire), he was called from the right side of the valley, in the blessed place from the tree: \"O Musa (Moses)! Verily! I am Allah, the Lord of the 'Alamin (mankind, jinns and all that exists)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came to it, he was called from the right bank in the blessed plot of the tree (he heard speech without letter or voice coming from all directions):'Moses, I am Allah, Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reached it, he was called from the right side of the valley, at the Blessed Spot, from the bush: “O Moses, it is I, God, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to it, he was called from the right side of the valley in a blessed spot - from the tree, \"O Moses, indeed I am Allah, Lord of the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:30] And when he reached it, a call came from the right bank, [the right] side, of the valley, to Moses, at the blessed spot, [blessed] for Moses, because of his hearing God’s speech therein, from the tree (mina’lshajarati substitutes for min shāti’i, ‘from the [right] bank’, and the preposition [min, ‘from’] has been repeated because it [the tree] grows there) — the tree was a jujube, a bramble, or a boxthorn — [saying] that (an here is explicative, and not in its softened form) ‘O Moses! Indeed I am God, the Lord of the Worlds’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he reached it, he was called from the right side of the valley) from the right side of Moses (in the blessed field) blessed with trees and water, (from the tree) from the direction of the tree: (0 Moses! Lo! I, even I, am Allah, the Lord of the Worlds) the Lord of the jinn and human beings; 439\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن شَاطِىءِ ٱلْوَادِي ٱلأَيْمَنِ } معناهُ من جَانبِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفبادر إليها سريعاً { فَلَمَّآ أَتَاهَا } وقرب إليها { نُودِيَ مِن شَاطِىءِ ٱلْوَادِي } أي: شفيره وجانبه { ٱلأَيْمَنِ } باليمن، والكرامة الواقعة { فِي ٱلْبُقْعَةِ ٱلْمُبَارَكَةِ } التي كثر الخير والبركة فيها { مِنَ ٱلشَّجَرَةِ } أي: نُودي من الشجرة التي تعقد النار عليها نداءً عجيباً معرباً عن اسمه، مصرحاً به: { أَن يٰمُوسَىٰ } المتحير في بيداء الطلب، القلق الحائر في فيافي التعب { إِنِّيۤ } مع كمال إطلاقي وإن ظهرت على صورة نار، وتقيدت بها متنزهاً عن كمال تنزهي عن عموم الصور والتعينات { أَنَا ٱللَّهُ رَبُّ ٱلْعَالَمِينَ } [القصص: 30] الجامع لجميع الأسماء والصفات، المتجلي لجميع الصور والشئون، وعموم الهياكل والتماثيل، المتعالي عن الحلول في شيء والاتحاد به والمعية معه مطلقاً، فاطلبني تجد جميع حوائجك عندي؛ لأني رب العالمين، أي: مربٍ الكل ومدبره بعدما أظهرت الأشياء وأوجدتها من كتم العدم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما أتاها نُودي من شاطىء الوادِ الأيمنِ } بالنسبة إلى موسى، أي: عين يمين موسى، { في البقعة المباركةِ } بتكليم الله تعالى فيها، { من الشجرة } بدل من \" شاطىء \": بَدَلَ اشتمالٍ أي: من ناحية الشجرة، وهو العنَّاب، او العوسج، أو: سمرة\n وقال وهب: عُليقاً\n { أن يا موسى }\n أي: يا موسى، أو: إنه يا موسى { إني أنا الله ربُّ العالمين } ، قال البيضاوي: هذا، وإن خالف ما في \" طه \" و \" النمل \" لفظاً، فهو طبْقُهُ في المقصود\n هـ\n قال جعفر الصادق: أبصر ناراً، دلته على الأنوار لأنه رأى النور على هيئة النار، فلما دنا منها شملته أنوار القدس، وأحاطت به جلابيب الأنس، فخاطبه الله بألطف خطاب، واستدعى منه أحسن جواب، فصار بذلك مُكَلَّماً شريفاً، أُعْطِيَ ما سأل، وأمن ممن خاف\n هـ\n قال القشيري: فكان موسى عند الشجرة، والنداء من الله لا منها، وقد حصل الإجماع أن موسى، تلك الليلة، سمع كلام الله، ولو كان النداء من الشجرة لكانت المتكلمة هي، فلأجل الإجماع قلنا: لم يكن النداء منها، وإلا فنحن نجوز أن يخلق الله نداء في الشجرة\n هـ\n قلت: وسيأتي في الإشارة ما لأهل التوحيد الخاص، وما قاله - هو مذهب أهل الظاهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:29",
      "similarity": 0.2766239163495902
    },
    {
      "verse": "79:16",
      "similarity": 0.10263249980708833
    },
    {
      "verse": "46:24",
      "similarity": 0.0974423640374075
    },
    {
      "verse": "9:121",
      "similarity": 0.09319054103735404
    },
    {
      "verse": "14:37",
      "similarity": 0.08569552961621958
    }
  ]
}