{
  "chapter": "القصص",
  "text": "وان الق عصاك فلما رءاها تهتز كانها جان ولى مدبرا ولم يعقب يموسى اقبل ولا تخف انك من الءامنين",
  "translations": [
    {
      "translation": "Throw down your staff!' Then when he he saw it slithering like a snake he turned and fled and did not turn back again. 'Musa, approach and have no fear! You are one of those who are secure.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.\" When he saw it wriggling like a serpent, he turned about and fled without turning. \"O Moses, approach,\" (said the Voice), \"and have no fear. You will be safe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He received the command: \"Throw away your rod!\" But when he saw the rod writhing as though it were a serpent, he turned back in retreat, and did not even look behind. (He was told): \"O Moses, go ahead and have no fear. You are perfectly secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.\" When Moses saw his staff moving on the ground like a living being he fled with no desire to step forward. He was told, \"Moses, step forward. Do not be afraid; you will be safe and secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Put down your staff”; so when Moosa saw it writhing like a serpent, he turned moving away without looking back; “O Moosa! Come forth and do not fear; indeed you are in peace.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw your stick!\" But when he saw it moving as if it were a snake, he turned in flight, and looked not back. (It was said:) \"O Musa! Draw near, and fear not. Verily, you are of those who are secure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And saying: Cast down you staff. So when he saw it in motion as if it were a serpent, he turned back retreating, and did not return. O Musa! come forward and fear not; surely you are of those who are secure;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast down thy staff.' And when he saw it quivering like a serpent, he turned about retreating, and turned not back. 'Moses, come forward, and fear not; for surely thou art in security.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down thy staff. And when he saw it writhing as it had been a demon, he turned to flee headlong, (and it was said unto him): O Moses! Draw nigh and fear not. Lo! thou art of those who are secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.\" And when he saw it move as though it were a serpent, he turned his back and fled, and did not look back. \"O Moses,\" said the voice, \"come forward and have no fear; you are quite safe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cast thou down thy staff. And when he saw it stirring, as though it were a serpent, he turned in flight and looked not back. O Musa! draw nigh, and fear not; thou art of the secure ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And: ‘Throw down your staff!’ And when he saw it wriggling as if it were a snake, he turned his back [to flee], without looking back. ‘Moses! Come forward, and do not be afraid. Indeed you are safe.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now do thou throw thy rod!\" but when he saw it moving (of its own accord) as if it had been a snake, he turned back in retreat, and retraced not his steps: O Moses!\" (It was said), \"Draw near, and fear not: for thou art of those who are secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw your stick!\" But when he saw it moving as if it were a snake, he turned in flight, and looked not back. (It was said): \"O Musa (Moses)! Draw near, and fear not. Verily, you are of those who are secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast down your staff' And when he saw his staff writhing as though it were a serpent, he turned about in retreat, and did not turn back. 'O Moses, approach and have no fear. You are surely safe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.” And when he saw it wiggling, as if it were possessed, he turned his back to flee, and did not look back. “O Moses, come forward, and do not fear, you are perfectly safe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [he was told], \"Throw down your staff.\" But when he saw it writhing as if it was a snake, he turned in flight and did not return. [Allah said], \"O Moses, approach and fear not. Indeed, you are of the secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:31] And: ‘Throw down your staff’, and he threw it down. And when he saw it quivering, moving, as if it were a serpent (jānn: is a small snake [so called] because of the speed of its movement) he turned his back, to flee from it, and did not look back, in other words, he did not return, and so there called out [the voice]: ‘O Moses! Come forward, and do not be afraid. Indeed you are safe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Throw down your staff) from your hand. (And when he saw it) after throwing it down (writhing) moving with its head up (as it had been a demon) a serpent neither big nor small, (he turned to flee headlong) from it, without looking back; but Allah said: (0 Moses! Draw nigh) to it (and fear not) from it. (Lo! thou art of those who are secure) from its evil. When Moses picked it up, it was a staff like it was originally.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع موسى ما سمع استوحش من هذا النداء، وارتعد من هيبة هذا الصدى؛ لأنه في ابتداء انكشافه وشهوده أنس معه ربه؛ إزالةً لرعبه ووحشتها، فقال مخاطباً له، آمراً: { وَأَنْ أَلْقِ عَصَاكَ } التي في يدك؛ حتى ترى عجائب وغرائب حكمتنا وليزول استبعداك من ظهورنا على صورة الناس فألقاها، فإذا هي حية تسعى { فَلَمَّا رَآهَا تَهْتَزُّ } وتتحرك على وجه السرعة { كَأَنَّهَا جَآنٌّ } أي: حية صغيرة سريعة السير { وَلَّىٰ } موسى، وانصرف عنها { مُدْبِراً } بعدما أدبر مرعوباً مرهوباً { وَلَمْ يُعَقِّبْ } أي: لم يرجع ولم يلتفت إلى أخذها خائفاً مها هائباً، قلنا له منادياً؛ إزالةً لرعبة: { يٰمُوسَىٰ أَقْبِلْ } إلى عصاك وخذها { وَلاَ تَخَفْ } منها { إِنَّكَ مِنَ ٱلآمِنِينَ } [القصص: 31] عن ضرر ما ظهرت عليك من الصورة الحادثة المهبية، فإنَّا سنعيدها سيرتها الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { وأن أَلْق عَصَاكَ } ، أي: نودي: أن ألق عصاك، فألقاها، فقلبها الله ثعباناً، { فلما رآها تهتزُّ } تتحرك { كأنها جانٌّ } حية رقيقة\n\n\nفإن قيل: كيف قال في موضع: كأنها جان، وفي أخرى:\n\n[الأعراف: 143]؟ قلت: هي في أول أمرها جان، وفي آخر أمرها ثعبان لأنها كانت تصير حية على قدر العصا، ثم لا تزال تنتفخ حتى تصير كالثعبان، أو: يُريد في سرعة الجان وخفته، وفي قوة الثعبان\n فلما رآها كذلك { ولّى مُدْبِراً ولم يُعقِّبْ } ولم يرجع عقبه\n فقيل له: { يا موسى أقبلْ ولا تخفْ إنك من الآمنين } ، أي: أمنت من أن ينالك مكروه من الحية",
      "translations": []
    }
  ]
}