{
  "chapter": "القصص",
  "text": "واتبعنهم فى هذه الدنيا لعنة ويوم القيمة هم من المقبوحين",
  "translations": [
    {
      "translation": "We pursued them with a curse in this world and on the Day of Rising they will be hideous and spurned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A curse lies upon them in this world, and on the Day of Resurrection they will be despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made a curse to pursue them in this world, and on the Day of Judgement they shall be among the despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made them to be mentioned with condemnation in this life and they will be disgraced on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We set a curse after them in this world; and evil is for them on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a curse to follow them in this world, and on the Day of Resurrection, they will be among disgraced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused a curse to follow them in this world, and on the day of resurrection they shall be of those made to appear hideous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We pursued them in this world with a curse, and on the Day of Resurrection they shall be among the spurned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a curse to follow them in this world, and on the Day of Resurrection they will be among the hateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have caused a curse to follow them in this world and, on the Day of Judgement, they will be among the wretched.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused a curse to follow them in this world, and on the Day of Resurrection they shall be of the castaway.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a curse pursue them in this world, and on the Day of Resurrection they will be among the disfigured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in this world We made a curse to follow them and on the Day of Judgment they will be among the loathed (and despised).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a curse to follow them in this world, and on the Day of Resurrection, they will be among Al-Maqbuhun (those who are prevented to receive Allah's Mercy or any good, despised or destroyed, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this world We laid Our curse on them, and on the Day of Resurrection they shall be among the exiled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We pursued them in this world with a curse. And on Resurrection Day, they will be among the despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused to overtake them in this world a curse, and on the Day of Resurrection they will be of the despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:42] And We made a curse, ignominy, pursue them in this world, and on the Day of Resurrection they will be among the spurned, those banished [from God’s mercy].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We made a curse to follow them in this world) We destroyed them in this worldly life by drowning, (and on the Day of Resurrection they will be among the hateful) they will have gloomy faces and bluish eyes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَوْمَ القِيَامَةِ هُمْ مِّنَ ٱلْمَقْبُوحِينَ } معناه من الهَالِكينَ\n\n\n\n\nوقوله تعالى: { وَأَتْبَعْنَاهُم } معناه ألزمناهُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف ينصرون أولئك الضالون المضلون، مع أنَّا { أَتْبَعْنَاهُم } وألزمنا عليهم { فِي هَذِهِ ٱلدُّنْيَا لَعْنَةً } مستمرة جارية على ألسنة من على الأرض { وَيَوْمَ القِيَامَةِ } المعدة للجزاء { هُمْ مِّنَ ٱلْمَقْبُوحِينَ } [القصص: 42] المطرودين المسوقين نحو جهنم صاغرين مهانين؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}