{
  "chapter": "القصص",
  "text": "ان فرعون علا فى الارض وجعل اهلها شيعا يستضعف طائفة منهم يذبح ابناءهم ويستحى نساءهم انه كان من المفسدين",
  "translations": [
    {
      "translation": "Pharaoh exalted himself arrogantly in the land and divided its people into camps, oppressing one group of them by slaughtering their sons and letting their women live. He was one of the corrupters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh had become high and mighty in the land, and divided the people into different classes, and impoverished one class, slaying its males and sparing its women, for he was indeed a tyrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Pharaoh transgressed in the land and divided its people into sections. One group of them he humiliated, and slew their sons and spared their daughters. Truly he was among the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh dominated the land and divided its inhabitants into different groups, suppressing one group by killing their sons and keeping their women alive. He was certainly an evil-doer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Firaun had achieved dominance in the earth and made its people subservient to him – seeing a group among them weak, he used to kill their sons and spare their women; he was indeed very mischievous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Fir`awn exalted himself in the land and made its people Shiya`a, weakening a group among them: killing their sons, and letting their females live. Verily, he was of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Firon exalted himself in the land and made its people into parties, weakening one party from among them; he slaughtered their sons and let their women live; surely he was one of the mischiefmakers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Pharaoh had exalted himself in the land and had divided its inhabitants into sects, abasing one party of them, slaughtering their sons, and sparing their women; for he was of the workers of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Pharaoh exalted himself in the earth and made its people castes. A tribe among them he oppressed, killing their sons and sparing their women. Lo! he was of those who work corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh behaved arrogantly in the land, and divided the people into groups, seeking to weaken one section, slaying their sons and sparing their daughters, he was one of those who spread corruption,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Fir'awn exalted himself in the earth and made the people thereof into sects, weakening a party among them, slaying their sons and letting their women live. Verify he was of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Pharaoh tyrannized over the land, reducing its people to factions, abasing one group of them, slaughtering their sons, and sparing their women. Indeed, He was one of the agents of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly Pharaoh elated himself in the land and broke up its people into sections, depressing a small group among them: their sons he slew, but he kept alive their females: for he was indeed a maker of mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Fir'aun (Pharaoh) exalted himself in the land and made its people sects, weakening (oppressing) a group (i.e. Children of Israel) among them, killing their sons, and letting their females live. Verily, he was of the Mufsidun (i.e. those who commit great sins and crimes, oppressors, tyrants, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh had exalted himself in the land and had divided its people into sects, one group he abased, putting their sons to death and sparing their women, for he was one of those who corrupted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh exalted himself in the land, and divided its people into factions. He persecuted a group of them, slaughtering their sons, while sparing their daughters. He was truly a corrupter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Pharaoh exalted himself in the land and made its people into factions, oppressing a sector among them, slaughtering their [newborn] sons and keeping their females alive. Indeed, he was of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:4]   Truly Pharaoh had exalted himself in the land, the land of Egypt, and reduced its people into sects, groups, to serve him, oppressing a group of them, namely, the Children of Israel, slaughtering their sons, the newborn, and sparing their women, keeping them alive — for some of the [Egyptian] priests had told him, ‘A new-born of the Children of Israel shall bring about the end of your kingdom’. Indeed he was of those who cause corruption, through [the use of] slaughter and otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Pharaoh exalted himself) Pharaoh rebelled and became arrogant and tyrannical (in the earth) in the land of Egypt (and made its people castes) different groups. (A tribe among them) from among the Children of Israel (he suppressed) he oppressed, (killing their sons) young (and sparing their women) and use their grown up women as servants. (Lo! he was of those who work corruption) in his state of disbelief, by killing people and calling for the worship of other than Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدثنا علي بن أحمد قال: حدثنا عطاء بن السائب عن أبي خالد الواسطي عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { إِنَّ فِرْعَوْنَ عَلاَ فِي ٱلأَرْضِ } معناه عَظُمَ وتَكبَّر\n\n\n\n\nوقوله تعالى: { وَجَعَلَ أَهْلَهَا شِيَعاً } معناه فِرقٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad said that 'Ata' ibn al-Sa'ib reported from Abu Khalid al-Wasiti from Zayd ibn Ali, upon them both be peace, that he said concerning the words of the Almighty, {Indeed Pharaoh was arrogant in the land} [Qur'an 28:39], \"This means that he was great and powerful.\"\n\n\nAnd His saying - {And He made His people into factions} - its meaning is divisions.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وترقى أمره إلى حيث تفوه بأنا ربكم الأعلى { وَ } من كمال علوه واستكباره { جَعَلَ أَهْلَهَا } أي: أهل مصر ومن يسكنون حولها { شِيَعاً } أي: فرقاً وأحزاباً يشايعونه لدى الحاجة ويزدحمون عليه عند الإرادة طوعاً وكرهاً\n\n\nوبعدما رأى فرعون في منامه ليلاً أن ناراً تخرج من دور بني إسرائيل\n وتقع على داره وتحرقها وما حولها من ور القبط\n ولم تضر بدور بني إسرائيل أصلاً فأصبح\n وأمر بإحضار الكاهن العليم\n فاستعبر منه الرؤيا فقال الكاهن: سيخرج من بني إسرائيل رجل يستولي عليك\n ويستأصلك ومن معك\n وبعدما سمع من الكاهن ما سمع صار { يَسْتَضْعِفُ } ويضعف { طَآئِفَةً مِّنْهُمْ } هي بنو إسرائيل\n وبالغ في إضعافهم إلى حيث { يُذَبِّحُ أَبْنَآءَهُمْ } أي: أمر الشرطة أن يقتلوا من ولد منهم ذكراً\n لئلا يتقووا على قتاله\n ولم يحدث بينهم من أخبر به الكاهن { وَيَسْتَحْيِي نِسَاءَهُمْ } ليتزوجهن القبط ظلماً ويزدادوا ويلحق العار والصغار على بني إسرائيل\n وبالجملة: { إِنَّهُ كَانَ مِنَ } أعظم { ٱلْمُفْسِدِينَ } [القصص: 4] في الأرض\n يريد أن يظهر على الله بقتل ما أوجده سبحانه عتواً واستكباراً\n\n\n{ وَ } بعدما بالغ في الإفساد والعناد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { إِنَّ فرعونَ علا في الأرض } \n وهو استئناف بياني\n وكأن قائلاً قال: وكيف كان نبأهما؟ فقال: إنه علا في الأرض\n أي: تجبّر وطغى في أرض مصر\n وجاوز الحد في الظلم والعدوان\n أو: علا عن عبادة ربه\n وافتخر بنفسه\n ونسي العبودية\n وفي التعبير بالأرض تبكيت عليه\n أي: علا في محل التذلل والانخفاض\n { وجعل أهلَها شِيعاً } أي: فرقاً وأصنافاً في الخدمة والتسخير\n كلُّ قوم من بني إسرائيل في شغل مفرد\n وقيل: مَلَكَ القبط واستعبد بني إسرائيل\n أو: فرقاً مختلفة\n يُكرم طائفة ويهين أخرى\n فأكرم القبط\n وأهان بني إسرائيل\n { ويستضعفُ طائفةً منهم } وهم بنو إسرائيل\n وهو يُرشد إلى كون المراد بقوله: { وجعل أهلها } لا يُخَصُّ ببني إسرائيل\n { يُذَّبِّحُ أبناءهم } الذكور\n { ويستحيي نساءَهم } أي: البنات\n يتركهم لخدمته\n وسبب ذبحه للأبناء أن كاهناً قال له: يولد مولود في بني إسرائيل\n يذهب ملكك على يده\n وفيه دليل على حمق فرعون\n فإنه إن صدق الكاهن لم ينفعه القتل إذ لا ينفع حذر من قدر\n وإن كذب فلا معنى للقتل\n وجملة: { يستضعف }: حال من الضمير في { جعل } \n أو صفة لشِيع\n أو استئناف\n { إنه كان من المفسدين } \n أي: الراسخين في الإفساد\n ولذلك اجترأ على تلك العزيمة العظيمة\n ومن قتل المعصومين من أولاد الأنبياء - عليهم السلام\n { ونريد أن نَمُنَّ } أي: نتفضل { على الذين استُضعفوا في الأرض } على الوجه المذكور بالقتل والتسخير\n وهذه الجملة معطوفة على: { إن فرعون } \n أو: حال من { يستضعف } \n أي: يستضعفهم فرعون ونحن نُريد أن نمنّ عليهم\n وإرادة الله تعالى كائنة لا محالة\n فَجُعِلَتْ كالمقارنة لاستضعافهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:49",
      "similarity": 0.4885282326303079
    },
    {
      "verse": "14:6",
      "similarity": 0.47203044634494074
    },
    {
      "verse": "27:21",
      "similarity": 0.4298852046037093
    },
    {
      "verse": "37:107",
      "similarity": 0.4057941310692736
    },
    {
      "verse": "15:10",
      "similarity": 0.4006283799412313
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}