{
  "chapter": "القصص",
  "text": "وما كنت بجانب الغربى اذ قضينا الى موسى الامر وما كنت من الشهدين",
  "translations": [
    {
      "translation": "You were not on the western side when We gave Musa the command. You were not a witness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not there on the western side (of Mount Sinai) when We gave the commandments to Moses, nor were you witness (to the event).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), you were then not on the western side when We bestowed this commandment (of Law), and you were not among its witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you were not present at the west bank to witness when We gave the commandments to Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you (O dear Prophet Mohammed – peace and blessings be upon him) were not on the western side of the Mount when We sent the command of Prophethood to Moosa, and you were not present. (Yet you narrate the account very clearly to the Jews and Christians.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you were not on the western side (of the Mount), when We made clear to Musa the commandment, and you were not among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you were not on the western side when We revealed to Musa the commandment, and you were not among the witnesses;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wast not upon the western side when We decreed to Moses the commandment, nor wast thou of those witnessing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou (Muhammad) wast not on the western side (of the Mount) when We expounded unto Moses the commandment, and thou wast not among those present;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not present on the western side of the Mount when We gave Our Command to Moses: nor were you among the witnesses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wast not on the western side when We decreed the affair unto Musa, and thou wast not of the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not on the western side when We revealed the commandments to Moses, nor were you among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wast not on the Western side when We decreed the Commission to Moses, nor wast thou a witness (of those events).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you (O Muhammad SAW) were not on the western side (of the Mount), when We made clear to Musa (Moses) the commandment, and you were not among those present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Prophet Muhammad) you were not on the western side (of the mountain) when We decreed the commandment to Moses, nor were you among thosewitnessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not on the Western Side when We decreed the command to Moses, nor were you among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, [O Muhammad], were not on the western side [of the mount] when We revealed to Moses the command, and you were not among the witnesses [to that].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:44] And you were not, O Muhammad (s), on the western side, of the mountain, the valley, or the spot, [to the west] of Moses at the time of the communion, when We decreed, revealed, to Moses the commandment, to deliver the Message to Pharaoh and his people, nor were you among the witnesses, to this, to know it and inform of it;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou) Muhammad (wast not on the western side (of the Mount) when We exposited unto Moses the commandment) when We commanded Moses to go to Pharaoh, (and thou wast not among those present) there;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا قصَّ سبحانه على حبيبه صلى الله عليه وسلم ما قصَّ من قصة موسى الكليم، وكيفية انكشافه من النار الموقدة على الشجرة، وكيفية عروجه مترقياً من العلم إلى العين ثمَّ إلى الحق، أراد أن يمن عليه سبحانه بما اصطفاه وفضله من بين البرايا على الرسالة العامة، وأخبره من المغيبات بطريق الوحي والإلهام ما ليس في وسعه، لولا وحيه وإلهامه سبحانه إياه، فقال: { وَمَا كُنتَ } يا أكمل الرسل حين انكشف موسى بالواد المقدس، وشهد من فضل الله عليه ما شهد { بِجَانِبِ ٱلْغَرْبِيِّ } أي: الوادي الذي على شفيرها الشجرة بالطرف الغربي من مقام موسى؛ أي: ما كنت حاضراً عنده { إِذْ قَضَيْنَآ } وأوحينا { إِلَىٰ مُوسَى ٱلأَمْرَ } الذي هو مطلوبه الحقيقي من مطلوبه الصوري { وَمَا كنتَ } حينئذٍ { مِنَ ٱلشَّاهِدِينَ } [القصص: 44] الحاضرين المطلعين على شأنه وشهوده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وما كنتَ } يا محمد { بجانب } المكان { الغربي } من الطور، وهو الذي كلم الله فيه موسى، وهو الجانب الأيمن\n قال السهيلي: إذا استقبلت القبلة، وأنت بالشام، كان الجبل يميناً منك، غربياً، غير أنه قال في قصة موسى:\n\n[مريم: 52 - وطه: 80]، وصفه بالصفة المشتقة من اليُمن والبركة، لتكليمه إياه فيه، وحين نفى عن محمد صلى الله عليه وسلم أن يكون بذلك الجانب، قال: { وما كنت بجانب الغربي } ، والغربي هو الأيمن\n والعدول عنه، في حالة النفي للاحتراس من توهم نفي اليمن عنه صلى الله عليه وسلم، وكيف، وهو صلى الله عليه وسلم لم يزل بصفة اليُمن وآدم بين الماء والطين! فحسنُ اللفظِ أصل في البلاغة، ومجانبة الاشتراك الموهم: من فصيحِ بديعِ الفصاحة\n هـ\n أي: وما كانت حاضراً بذلك الموضع، { إِذْ قَضَينا إلى موسى الأمرَ } ، أي: كلمناه وقربناه نجياً، وأوحينا إليه بالرسالة إلى فرعون، { وما كنتَ من الشاهدين } ، أي: من جملة الشاهدين فتخبر بذلك، ولكن أعلمناك من طريق الوحي، بعد أن لم يكن لك بذلك شعور، والمراد: الدلالة على أن إخباره بذلك من قِبَلِ الإخبار بالمغيبات التي لا تُعرف إلا بالوحي، ولذلك استدرك عنه بقوله: { ولكنَّا أنشأنا } بعد موسى { قروناً فتطاولَ عليهم العُمُرُ } ، أي: طالت أعمارهم، وفترت النبوة، وانقطعت الأخبار، واندرست العلوم، ووقع التحريف في كثير منها، فأرسلناك مُجَدِّداً لتلك الأخبار، مبيناً ما وقع فيها من التحريف، وأعطيناك العلم بقصص الأنبياء، وأوقفناك على قصة موسى بتمامها، فكأنه قال: وما كنت شاهداً لموسى وما جرى عليه، ولكنا أوحيناه إليك، فأخبرت به، بعد اندراسه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:17",
      "similarity": 0.4645626099075527
    },
    {
      "verse": "26:28",
      "similarity": 0.43268984681923484
    },
    {
      "verse": "73:9",
      "similarity": 0.42474412331027656
    },
    {
      "verse": "70:40",
      "similarity": 0.4008996703400165
    },
    {
      "verse": "50:39",
      "similarity": 0.36885444604344386
    }
  ]
}