{
  "chapter": "القصص",
  "text": "ولقد ءاتينا موسى الكتب منۢ بعد ما اهلكنا القرون الاولى بصائر للناس وهدى ورحمة لعلهم يتذكرون",
  "translations": [
    {
      "translation": "We gave Musa the Book after destroying the earlier nations, to awaken people's hearts and as a guidance and a mercy so that hopefully they would pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After We had destroyed the earlier generations We gave Moses the Book as evidence for mankind, and a guidance and grace, so that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After We had destroyed the earlier generations We bestowed the Book on Moses - a source of enlightenment for people and a guidance and mercy -- that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After destroying the people of the ancient towns We gave the Book to Moses to be a source of knowledge, a guidance, and mercy for mankind so that perhaps they would take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed gave Moosa the Book after We had destroyed the former generations, having enlightenment for mankind, and a guidance and a mercy, for them to accept advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa -- after We had destroyed the generations of old -- the Scripture as an enlightenment for mankind, and a guidance and a mercy, that they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave Musa the Book after We had destroyed the former generations, clear arguments for men and a guidance and a mercy, that they may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, after that We had destroyed the former generations, to be examples and a guidance and a mercy, that haply so they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily gave the Scripture unto Moses after We had destroyed the generations of old: clear testimonies for mankind, and a guidance and a mercy, that haply they might reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After We had destroyed the earlier generations, We gave Moses the Book to give men insight, and as guidance and a blessing for people, so that they might take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed the the Scripture unto Musa after We had destroyed the generations of old: enlightenment unto mankind and a guidance and a mercy, that haply they might be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book, after We had destroyed the former generations, as [a set of] eye-openers, guidance and mercy for mankind, so that they may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did reveal to Moses the Book after We had destroyed the earlier generations, (to give) Insight to men, and guidance and Mercy, that they might receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa (Moses), after We had destroyed the generations of old, the Scripture [the Taurat (Torah)] as an enlightenment for mankind, and a guidance and a mercy, that they might remember (or receive admonition).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, after We had destroyed the former generations, to be reflections for people and a guidance, and a mercy in order that they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Scripture after We had annihilated the previous generations; as an illumination for mankind, and guidance, and mercy, so that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Scripture, after We had destroyed the former generations, as enlightenment for the people and guidance and mercy that they might be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:43] And verily We gave Moses the Scripture, the Torah, after We had destroyed the former generations, the people of Noah, ‘Ād, Thamūd and others, [containing] eye-openers for mankind (basā’ira, is a circumstantial qualifier referring to al-kitāb, ‘the Scripture’, the plural of basīra, which is the [perceptive] light of the heart), in other words, illumination for the hearts [of mankind], and as guidance, from error, for those who implement it, and mercy, for those who believe therein, that perhaps they might remember, [that] they might be admonished by the admonitions it [the Scripture] contains.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We verily gave the Scripture) i.e. the Torah (unto Moses after We had destroyed the generations of old) before Moses; (clear testimonies) a clarification (for mankind) for the Children of Israel, (and a guidance) from error (and a mercy) for those who believe in it, (that haply they might reflect) in order that they make take admonition and believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما نبذنا فرعون وجنوده في اليم { لَقَدْ آتَيْنَا } وأعطينا من كمال جودنا { مُوسَى ٱلْكِتَابَ } أي: التوراة الجامعة لظواهر الأحكام { مِن بَعْدِ مَآ أَهْلَكْنَا ٱلْقُرُونَ ٱلأُولَىٰ } واستأصلنا آثارهم وأحكامهم، بحيث لم يبقَ من شرائع المتقدمين وآثارهم وأحكامهم شيئاً بين الأنام، كنوح وهود وصالح وإبراهيم؛ وإنما آتيناه ليكون { بَصَآئِرَ لِلنَّاسِ } أي: ينوروا بأحكامه وأوامره عيون بصائرهم، ويستيقظوا من منام الجهل والغفلة، ويشتغلوا بطلب الحق\n\n\n\n\n{ وَهُدًى } يهديهم إلى سلوك مسالك التوحيد { وَرَحْمَةً } يبشرهم إلى البقاء الأبدي السرمدي بعد انخلاعهم عن خلع تعيناتهم العدمية، والإفناء عن هوياتهم الباطلة { لَّعَلَّهُمْ يَتَذَكَّرُونَ } [القصص: 43] رجاء أن يتذكروا ويتنبهوا من المواعظ والأحكام التي ذُكرت فيه إلى جُبلوا لأجله من المعارف والحقائق والرموز، والإشارات والمكاشفات والمشاهدات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}