{
  "chapter": "القصص",
  "text": "فلما جاءهم الحق من عندنا قالوا۟ لولا اوتى مثل ما اوتى موسى اولم يكفروا۟ بما اوتى موسى من قبل قالوا۟ سحران تظهرا وقالوا۟ انا بكل كفرون",
  "translations": [
    {
      "translation": "But when the truth did come to them from Us they said, 'Why has he not been given the same as Musa was given?' But did they not previously reject what Musa was given? They say, 'Two magicians who back each other up.' And they say, 'We reject both of them.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them from Us, they said: \"Why is he not given the like of what was given to Moses?\" Did they not disbelieve before in what was given to Moses? They said: \"Both are imposters one like the other,\" and added: \"We do not believe in either.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the Truth reached them from Us, they said: \"Why was he not given that which was given to Moses?\" But did they not reject before what had been given to Moses? They said: \"Both are magic, each supporting the other!\" And they said: \"We deny each of these.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Truth from Us came to them they said, \"Would that he, (Muhammad), had received what was given to Moses (by his Lord).\" Did not they reject what Moses had brought to them saying, \"These two, Moses and Aaron, are two magicians who support each other. We do not have any faith in them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the Truth* from Us came to them, they said, “Why has he not been given what was given to Moosa?” Had they not disbelieved in what was earlier given to Moosa? They said, “They are two magicians, who support each other”; and said, “We disbelieve in both of them.” (* Prophet Mohammed – peace and blessings be upon him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth has come to them from Us, they say: \"Why is he not given the like of what was given to Musa Did they not disbelieve in that which was given to Musa of old\" They say: \"Two kinds of magic, each helping the other!\" And they say: \"Verily, in both we are disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (now) when the truth has come to them from Us, they say: Why is he not given the like of what was given to Musa? What! did they not disbelieve in what Musa was given before? They say: Two magicians backing up each other; and they say: Surely we are unbelievers in all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when the truth came to them 'from Ourselves, they said, 'Why has he not been given the like' of that Moses was given?' But they, did they not disbelieve also in what Moses was given aforetime? They said, 'A pair of sorceries mutually supporting each other.' They said, 'We disbelieve both.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when there came unto them the Truth from Our presence, they said: Why is he not given the like of what was given unto Moses? Did they not disbelieve in that which was given unto Moses of old? They say: Two magics that support each other; and they say: Lo! in both we are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them from Us, they said, \"Why has he not been given the like of what Moses was given?\" But did they not reject what Moses was given before? They said, \"Both [Moses and Muhammad] are kinds of sorcery, each assisting the other.\" And they add, \"We reject both of them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when the truth is come unto them from before Us, they say: wherefore hast he not been vouchsafed the like of that which was given unto Musa? Disbelieved they not in that which was given unto Musa aforetime? They say; two magics supporting each other. And they say: verily in all such things we are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when there came to them the truth from Us, they said, ‘Why has he not been given the like of what Moses was given?’ Did they not disbelieve what Moses was given before, and said, ‘Two magicians abetting each other,’ and said, ‘Indeed we disbelieve both of them’?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (now), when the Truth has come to them from Ourselves, they say, \"Why are not (Signs) sent to him, like those which were sent to Moses?\" Do they not then reject (the Signs) which were formerly sent to Moses? They say: \"Two kinds of sorcery, each assisting the other!\" And they say: \"For us, we reject all (such things)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth (i.e. Muhammad SAW with his Message) has come to them from Us, they say: \"Why is he not given the like of what was given to Musa (Moses)? Did they not disbelieve in that which was given to Musa (Moses) of old? They say: \"Two kinds of magic [the Taurat (Torah) and the Quran] each helping the other!\" And they say: \"Verily! In both we are disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the truth (Prophet Muhammad) came to them from Us, they said: 'Why is he not given the like of that which was given to Moses' But did they not also disbelieve in that which Moses was given before! They say (about Moses and Aaron): 'Two sorcerers supporting one another' And they said: 'We disbelieve both'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them from Us, they said, “If only he was given the like of what was given to Moses.” Did they not disbelieve in what was given to Moses in the past? They said, “Two works of magic backing one another.” And they said, “We are disbelieving in both.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them from Us, they said, \"Why was he not given like that which was given to Moses?\" Did they not disbelieve in that which was given to Moses before? They said, \"[They are but] two works of magic supporting each other, and indeed we are, in both, disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:48] But when the truth, namely, Muhammad (s), came to them from Us, they said, ‘Why has he not been given the like of what Moses was given?’, in the way of signs, such as the glowing hand, the staff and others, or [by having] the Book revealed all at once. God, exalted be He, says: And did they not disbelieve in what was given to Moses before?; [before] when, they said, regarding him and Muhammad (s), ‘Two sorcerers (sāhirān; a variant reading has sihrān, ‘two sorceries’, namely [what they said regarding] the Qur’ān and the Torah) abetting each other.’ And they said, ‘We indeed disbelieve in both’, the two prophets and the two Scriptures [of Moses and Muhammad].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But when there came unto them the Truth) Muhammad (pbuh) with the Qur'an (from Our presence, they said) the disbelievers of Mecca said: (Why is he not) i.e. Muhammad (pbuh) (given the like of what was given unto Moses) i.e. the hand, the staff, the quails and honey as well as the Qur'an? (Did they not) i.e. the disbelievers of Mecca (disbelieve in that which was given unto Moses of old) i.e. the Torah before the coming of Muhammad (pbuh)? (They say) the disbelievers of Mecca say: (Two magics) i.e. the Qur'an and the Torah (that support each other; and they) the disbelievers of Mecca (say: Lo! in both we are disbelievers) we disbelieve in both the Qur'an and the Torah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَالُواْ سِحْرَانِ تَظَاهَرَا } معناه تَعاونا\n وتُقرأ سِحْرَانُ يعني التَوراةُ والإِنجيلُ\n ومن قَرأ سَاحران أراد بهما مُوسى وهارون عليهما السّلامُ\n\n",
      "translations": [
        {
          "translation": " And the saying of Allah: {They said, \"It is two magic [displays] in harmony\"} means cooperation.\n\n\nAnd the Qur'an is read, which means the Torah and the Gospel.\n\n\nAnd whoever reads the two sorcerers, Moses and Aaron, peace be upon them, desires them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَهُمُ ٱلْحَقُّ } أي: الرسول المرسل { مِنْ عِندِنَا } ملتبساً بالحق المؤيَّد بالآيات الساطعة القاطعة { قَالُواْ } من خبث طينتهم\n وشدة شكيمتهم وضغينتهم: { لَوْلاۤ أُوتِيَ } وهلاَّ أوتي بهذا الرسول المرسل إلينا من الدلائل والمعجزات { مِثْلَ مَآ أُوتِيَ مُوسَىٰ } حتى نصدقه ونؤمن به\n وما هذا إلا من غاية غيهم وضلالهم\n وغلظ حجبهم وغشاوتهم\n وإلاَّ لو أتوي له مثل ما أوتي موسى لكفروا ألبتة { أَوَلَمْ يَكْفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبْلُ }\n\n\nحيث { قَالُواْ } بعدما شاهدوا دلائله ومعجزاته مبالغين في رده وإنكاره: { سِحْرَانِ } أو سحران على القراءتين { تَظَاهَرَا } يعني: موسى وهارون\n مع أن ما أتيا به بعيد بمراحل عن السحر\n وأنتم أيضاً من بقية ما كفروا بدلائل موسى\n ونسبوها إلى السحر\n ولو آتينا محمداً صلى الله عليه وسلم مثل ما آتينا موسى لكفرتم به ألبتة\n كما كفر أسلافكم بآيات موسى ومعجزاته\n مع أن دلائل محمد أقوى من دلائل موسى\n وكتابه أجمع من كتابه وأتم نظماً\n وأكمل معرفة وأعم حكماً وأشمل فائدة\n وبعدما سمعوا ما دل على خباثة فطرتهم { وَقَالُواْ } مظهرين ما في نفوسهم من الشرك والنفاق: { إِنَّا بِكُلٍّ } مما يدعي الرسالة والنبوة\n والإرشاد والهداية { كَافِرُونَ } [القصص: 48] منكرون له\n لا نقبل عن أبناء جنسنا مثل هذه المفتريات التي أختلقوها من تلقاء أنفسهم\n ونسبوها ترويجاً لها إلى ما لا وجود له في الواقع\n وسموه إلهاً واحداً أحداً صمداً\n فرداً وتراً\n لم يتخذ صاحبةً ولا ولداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَلَمَّا جاءهم الحق من عندنا } القرآن المعجز\n أو الرسول صلى الله عليه وسلم\n { قالوا } أي: كفار مكة اقتراحاً وتعنتاً: { لولا }: هلا { أُوتي } من المعجزات { مثل ما أُوتي } أُعطي { موسى } من اليد والعصا\n ومن الكتاب المنزل جملة\n قال تعالى: { أوَ لَمْ يكفروا } أي: أبناء جنسهم\n ومَنْ مَذهبهم على مذهبهم\n وعنادهم مثل عنادهم\n وهم الكفرة في زمن موسى عليه السلام\n فقد كفروا { بما أُوتي موسى من قبلُ } من قبل القرآن\n { قالوا } في موسى وهارون: { ساحران تظاهرا }: تعاونا\n أو: في موسى ومحمد - عليهما السلام - بإظهار تلك الخوارق\n أو بتوافق الكتابين\n وقرأ الكوفيون: \" سِحْران \" بتقدير مضاف\n أي: ذوَا سحر\n أو: جعلوهما سحريْن مبالغة في وصفهما بالسحر\n { وقالوا } أي: كفرة موسى وكفرة محمد صلى الله عليه وسلم: { إِنا بكلِّ } بكل واحد منهما { كافرون }\n وقيل أن أهل مكة\n لمّا كفروا بمحمد صلى الله عليه وسلم وبالقرآن فقد كفروا بموسى وبالتوراة\n وقالوا في محمد صلى الله عليه وسلم وموسى: ساحران تظاهرا\n أو في التوراة والقرآن: سحران تظاهرا\n أو: ذلك حين بَعَثُوا الرهط إلى رؤساء اليهود يسألونهم عن محمد\n فأخبروهم أنه في كتابهم فرجع الرهط إلى قريش\n فأخبروهم بقول اليهود\n فقالوا عند ذلك: { ساحران تظاهرا إنا بكل كافرون }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:76",
      "similarity": 0.5316567061451134
    },
    {
      "verse": "43:30",
      "similarity": 0.5073072688804005
    },
    {
      "verse": "10:80",
      "similarity": 0.5061071705037812
    },
    {
      "verse": "10:77",
      "similarity": 0.48698476981091715
    },
    {
      "verse": "20:57",
      "similarity": 0.44287585044965916
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:48.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:48.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}