{
  "chapter": "القصص",
  "text": "ولولا ان تصيبهم مصيبةۢ بما قدمت ايديهم فيقولوا۟ ربنا لولا ارسلت الينا رسولا فنتبع ءايتك ونكون من المؤمنين",
  "translations": [
    {
      "translation": "If a disaster had struck them because of what they had already done, they would have said, 'Our Lord, why did You not send us a Messenger so that we could have followed Your Signs and been muminun?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in case disaster comes upon them for what they have done themselves, they should say: \"O Lord, why did You not send an apostle to us that we should have followed Your commands, and been with those who are believers;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We did so) lest a calamity might seize them because of the misdeeds they committed whereafter they would say: \"Our Lord, why did you not send a Messenger to us that we follow Your revelation and become among those who believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to whom no warner had been sent that perhaps they might take heed, and that, on experiencing afflictions because of their own deeds, they may not say, \"Lord, would that You had sent to us a Messenger so that we could follow Your revelations and become believers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Otherwise, if some disaster befell them because of what their own hands have sent forward they would say, “Our Lord! Why did you not send a Noble Messenger towards us, so we may have followed Your signs and accepted faith?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if (We had) not (sent you to the people of Makkah) in case a calamity should seize them for what their hands have sent forth, they would have said: \"Our Lord! Why did You not send us a Messenger We would then have followed Your Ayat and would have been among the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were it not that there should befall them a disaster for what their hands have sent before, then they should say: Our Lord! why didst Thou not send to us an apostle so that we should have followed Thy communications and been of the believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Else, did an affliction visit them for that their own hands have forwarded then they might say, 'Our Lord, why didst Thou not send a Messenger to us that we might follow Thy signs and so be among the believers?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Otherwise, if disaster should afflict them because of that which their own hands have sent before (them), they might say: Our Lord! Why sentest Thou no messenger unto us, that we might have followed Thy revelations and been of the believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and may not say, if an affliction should befall them on account of their misdeeds: \"Lord, if only You had sent us a messenger, we might have followed Your message and become believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lest, if an affliction had afflicted them for that which their hands had sent before, they should have said: our Lord! wherefore sent not Thou an apostle unto us that we might have followed Thy revelations and been of the believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lest—if an affliction were to befall them because of what their hands have sent ahead —they should say, ‘Our Lord! Why did You not send us an apostle so that we might have followed Your signs and been among the faithful?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If (We had) not (sent thee to the Quraish),- in case a calamity should seize them for (the deeds) that their hands have sent forth, they might say: \"Our Lord! why didst Thou not sent us a messenger? We should then have followed Thy Signs and been amongst those who believe!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if (We had) not (sent you to the people of Makkah) in case a calamity should seize them for (the deeds) that their hands have sent forth, they should have said: \"Our Lord! Why did You not send us a Messenger? We should then have followed Your Ayat (Verses of the Quran) and should have been among the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and not say, when evil befalls them on account of that which their hands forwarded: 'Our Lord, why did You not send a Messenger to us so that we might follow Your verses and so that we might be among the believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Otherwise, if a calamity befell them as a result of what their hands have perpetrated, they would say, “Our Lord, if only You had sent us a messenger, we would have followed Your revelations, and been among the believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if not that a disaster should strike them for what their hands put forth [of sins] and they would say, \"Our Lord, why did You not send us a messenger so we could have followed Your verses and been among the believers?\"...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:47] Otherwise, if an affliction, a punishment, should befall them because of what their own hands have sent before them, in the way of disbelief and otherwise, they might say, ‘Our Lord, why did You not send a messenger to us, that we might have followed Your signs, the ones sent with the messengers, and been of the believers?’ (the response to [the conditional particle] lawlā, ‘if’, has been omitted, and what follows it is a [new] subject; the meaning is: ‘were it not for the affliction that is the cause of their saying’, or, ‘were it not for their saying that is the cause of their affliction, We would have hastened on for them their punishment and We would not have sent you as a messenger to them’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Otherwise, if disaster should afflict them) if the chastisement of the Day of Judgement afflicted your people, 441 the Quraysh, (because of that which their own hands have sent before (them)) because of what they had earned in their state of disbelief, (they might say) upon the coming of the torment of the Day of Judgement on them: (Our Lord!) our Lord! (Why sentest Thou no messenger unto us) with a Scripture before You chastised us, (that we might have followed Your revelations) Your Scripture and Messenger (and been of the believers) in the Scripture and Messenger? If it were otherwise, We would have destroyed them before you, but We have sent them the Qur'an so that they do not have any excuse against Us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِمَا قَدَّمَتْ أَيْدِيهِمْ } معناه بما كَسَبَتْ أيديهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"With what [good] they have put forth of their hands,\" means with what they have earned of their own accord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التوبيخ والتقريع: { وَلَوْلاۤ } كراهة { أَن تُصِيبَهُم مُّصِيبَةٌ } عظيمة جالبة لنزول أنواع العذاب والنكال { بِمَا قَدَّمَتْ أَيْدِيهِمْ } أي: بشؤم ما اقترفوا من المعاصي { فَيَقُولُواْ } حنيئذٍ مجتمعين علينا\n مجالدين بنا بعدما أخذناهم عليها: { رَبَّنَا لَوْلاۤ } وهلاَّ { أَرْسَلْتَ إِلَيْنَا رَسُولاً } من عندك\n مؤيَّداً من لدنك بالآيات البينات { فَنَتَّبِعَ آيَاتِكَ } البالغة إلينا برسالته ونصدقها\n ونعمل بمقتضاها { وَنَكُونَ مِنَ ٱلْمُؤْمِنِينَ } [القصص: 47] الموقنين بوحدانيتك\n المخلصن من عذابك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لولا الأولى: امتناعية\n وجوابها محذوف\n اي: ولولا أنهم قائلون إذا عوقبوا على ما قدّموا من الشرك محتجين علينا: هلا أرسلت إلينا رسولاً\n\n\n إلخ لَمَا أرسلناك\n يقول الحق جل جلاله: { ولولا أن تصيبهم مصيبة } \n أي: عقوبة في الدنيا والآخرة\n { بما } بسبب ما { قدمت أيديهم } من الكفر والظلم\n ولمّا كانت أكثر الأعمال إنما تناول بالأيدي\n نسب الأعمال إلى الأيدي\n وإن كانت من أعمال القلوب تغليباً للأكثر على الأقل\n { فيقولوا } عند نزول العذاب: { ربنا لولا } هلا { أرسلت إلينا رسولاً } يُنذرنا { فنتَّبع آياتك ونكونَ من المؤمنين } \n فلولا احتجاجهم بذلك علينا لَمَا أرسلناك\n فسبب الإرسال هو قولهم: هلا أرسلت\n\n\n إلخ\n ولما كانت العقوبة سبباً للقول جعلت العقوبة كأنها سبب الإرسال\n فدخلت \" لولا \" الامتناعية عليها\n فرجع المعنى إلى قولك: ولولا قولهم هذا\n إذا أصابتهم مصيبة\n لما أرسلناك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "49:1",
      "similarity": 0.5158865994330836
    },
    {
      "verse": "3:182",
      "similarity": 0.4849358470341509
    },
    {
      "verse": "8:51",
      "similarity": 0.4849358470341509
    },
    {
      "verse": "22:10",
      "similarity": 0.4849358470341509
    },
    {
      "verse": "74:37",
      "similarity": 0.3909057123057517
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/28:47.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/28:47.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/28:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}