{
  "chapter": "القصص",
  "text": "ولقد ءاتينا موسى الكتب منۢ بعد ما اهلكنا القرون الاولى بصائر للناس وهدى ورحمة لعلهم يتذكرون",
  "translations": [
    {
      "translation": "We gave Musa the Book after destroying the earlier nations, to awaken people's hearts and as a guidance and a mercy so that hopefully they would pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After We had destroyed the earlier generations We gave Moses the Book as evidence for mankind, and a guidance and grace, so that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After We had destroyed the earlier generations We bestowed the Book on Moses - a source of enlightenment for people and a guidance and mercy -- that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After destroying the people of the ancient towns We gave the Book to Moses to be a source of knowledge, a guidance, and mercy for mankind so that perhaps they would take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed gave Moosa the Book after We had destroyed the former generations, having enlightenment for mankind, and a guidance and a mercy, for them to accept advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa -- after We had destroyed the generations of old -- the Scripture as an enlightenment for mankind, and a guidance and a mercy, that they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave Musa the Book after We had destroyed the former generations, clear arguments for men and a guidance and a mercy, that they may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, after that We had destroyed the former generations, to be examples and a guidance and a mercy, that haply so they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily gave the Scripture unto Moses after We had destroyed the generations of old: clear testimonies for mankind, and a guidance and a mercy, that haply they might reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After We had destroyed the earlier generations, We gave Moses the Book to give men insight, and as guidance and a blessing for people, so that they might take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed the the Scripture unto Musa after We had destroyed the generations of old: enlightenment unto mankind and a guidance and a mercy, that haply they might be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book, after We had destroyed the former generations, as [a set of] eye-openers, guidance and mercy for mankind, so that they may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did reveal to Moses the Book after We had destroyed the earlier generations, (to give) Insight to men, and guidance and Mercy, that they might receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa (Moses), after We had destroyed the generations of old, the Scripture [the Taurat (Torah)] as an enlightenment for mankind, and a guidance and a mercy, that they might remember (or receive admonition).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, after We had destroyed the former generations, to be reflections for people and a guidance, and a mercy in order that they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Scripture after We had annihilated the previous generations; as an illumination for mankind, and guidance, and mercy, so that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Scripture, after We had destroyed the former generations, as enlightenment for the people and guidance and mercy that they might be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:43] And verily We gave Moses the Scripture, the Torah, after We had destroyed the former generations, the people of Noah, ‘Ād, Thamūd and others, [containing] eye-openers for mankind (basā’ira, is a circumstantial qualifier referring to al-kitāb, ‘the Scripture’, the plural of basīra, which is the [perceptive] light of the heart), in other words, illumination for the hearts [of mankind], and as guidance, from error, for those who implement it, and mercy, for those who believe therein, that perhaps they might remember, [that] they might be admonished by the admonitions it [the Scripture] contains.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَقَدْ آَتَيْنَا مُوسَى الْكِتَابَ مِنْ بَعْدِ مَا أَهْلَكْنَا الْقُرُونَ الْأُولَى بَصَائِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَعَلَّهُمْ يَتَذَكَّرُونَ (43)المقصود من الآيات السابقة ابتداء من قوله { فلما آتاها نودي } \\[ القصص : 30 \\] إلى هنا الاعتبار بعاقبة المكذبين القائلين { ما سمعنا بهذا في آبائنا الأولين } \\[ القصص : 36 \\] ليقاس النظير على النظير ، فقد كان المشركون يقولون مثل ذلك يريدون إفحام الرسول عليه الصلاة والسلام بأنه لو كان الله أرسله حقاً لكان أرسل إلى الأجيال من قبله ، ولما كان الله يترك الأجيال التي قبلهم بدون رسالة رسول ثم يرسل إلى الجيل الأخير ، فكان قوله { ولقد آتينا موسى الكتاب من بعدما أهلكنا القرون الأولى } إتماماً لتنظير رسالة محمد صلى الله عليه وسلم برسالة موسى عليه السلام في أنها جاءت بعد فترة طويلة لا رسالة فيها ، مع الإشارة إلى أن سبق إرسال الرسل إلى الأمم شيء واقع بشهادة التواتر ، وأنه قد ترتب على تكذيب الأمم رسلهم إهلاك القرون الأولى فلم يكن ذلك موجباً لاستمرار إرسال الرسل متعاقبين بل كانوا يجيئون في أزمنة متفرقة؛ فإذا كان المشركون يحاولون بقولهم { ما سمعنا بهذا في آبائنا الأولين } \\[ القصص : 36 \\] إبطال رسالة محمد صلى الله عليه وسلم بعلة تأخر زمانها سفسطة ووهماً فإن دليلهم مقدوح فيه بقادح القلب بأن الرسل قد جاءوا إلى الأمم من قبل ثم جاء موسى بعد فترة من الرسل . وقد كان المشركون لما بهرهم أمر الإسلام لاذوا باليهود يسترشدونهم في طرق المجادلة الدينية فكان المشركون يخلطون ما يلقنهم اليهود من المغالطات بما استقر في نفوسهم من تضليل أيمة الشرك فيأتون بكلام يلعن بعضه بعضاً ، فمرة يقولون { ما سمعنا بهذا في آبائنا الأولين } \\[ القصص : 36 \\] وهو من مجادلات الأميين ، ومرة يقولون { لولا أوتي مثل ما أوتي موسى } \\[ القصص : 48 \\] وهو من تلقين اليهود ، ومرة يقولون { ما أنزل الله على بشر من شيء } \\[ الأنعام : 91 \\] ، فكان القرآن يدمغ باطلهم بحجة الحق بإلزامهم تناقض مقالاتهم . وهذه الآية من ذلك فهي حجة بتنظير رسالة محمد برسالة موسى عليهما الصلاة والسلام والمقصود منها ذكر القرون الأولى .وأما ذكر إهلاكهم فهو إدماج للنذارة في ضمن الاستدلال . وجملة { ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى } تخلص من قصة بعثة موسى عليه السلام إلى تأييد بعثة محمد صلى الله عليه وسلم والمقصود قوله ( من بعد القرون الأولى ) .ثم إن القرآن أعرض عن بيان حكمة الفِتَر التي تسبق إرسال الرسل ، واقتصر على بيان الحكمة في الإرسال عقبها لأنه المهم في مقام نقض حجة المبطلين للرسالة أو اكتفاء بأن ذلك أمر واقع لا يستطاع إنكاره وهو المقصود هنا ، وأما حكمة الفصل بالفِتر فشيء فوق مراتب عقولهم . فأشار بقوله { بصائر للناس وهدى ورحمة لعلهم يتذكرون } إلى بيان حكمة الإرسال عقب الفترة . وأشار بقوله { من بعد ما أهلكنا القرون الأولى } إلى الأمم التي استأصلها الله لتكذيبها رسل الله .فتأكيد الجملة بلام القسم وحرف التحقيق لتنزيل المخاطبين منزلة المنكرين لوقوع ذلك حتى يحتاج معهم إلى التأكيد بالقسم ، فموقع التأكيد هو قوله { من بعد ما أهلكنا القرون الأولى } .و { الكتاب } : التوراة التي خاطب الله بها موسى عليه السلام . والبصائر : جمع بصيرة ، وهي إدراك العقل . سُمي بصيرة اشتقاقاً من بصر العين ، وجُعل الكتاب بصائر باعتبار عدة دلائله وكثرة بيّناته ، كما في الآية الأخرى قال { لقد علمت ما أنزل هؤلاء إلا رب السموات والأرض بصائر } \\[ الإسراء : 102 \\] .و { القرون الأولى } : قوم نوح وعاد وثمود وقوم لوط . والقرن : الأمة ، قال تعالى { كم أهلكنا من قبلهم من قرن } \\[ الأنعام : 6 \\] . وفي الحديث « خير القرون قرني » .والناس هم الذين أرسل إليهم موسى من بني إسرائيل وقوم فرعون ، ولمن يريد أن يهتدي بهديه مثل الذين تهودوا من عرب اليمن ، و { هدى ورحمة } لهم ، ولمن يقتبس منهم قال تعالى { إنا أنزلنا التوراة فيها هدى ونور } \\[ المائدة : 44 \\] . ومن جملة ما تشتمل عليه التوراة تحذيرها من عبادة الأصنام .وضمير { لعلهم يتذكرون } عائد إلى الناس الذين خوطبوا بالتوراة ، أي فكذلك إرسال محمد لكم هدى ورحمة لعلكم تتذكرون .\n\n",
      "translations": [
        {
          "translation": "(And We verily gave the Scripture) i.e. the Torah (unto Moses after We had destroyed the generations of old) before Moses; (clear testimonies) a clarification (for mankind) for the Children of Israel, (and a guidance) from error (and a mercy) for those who believe in it, (that haply they might reflect) in order that they make take admonition and believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما نبذنا فرعون وجنوده في اليم { لَقَدْ آتَيْنَا } وأعطينا من كمال جودنا { مُوسَى ٱلْكِتَابَ } أي: التوراة الجامعة لظواهر الأحكام { مِن بَعْدِ مَآ أَهْلَكْنَا ٱلْقُرُونَ ٱلأُولَىٰ } واستأصلنا آثارهم وأحكامهم\n بحيث لم يبقَ من شرائع المتقدمين وآثارهم وأحكامهم شيئاً بين الأنام\n كنوح وهود وصالح وإبراهيم\n وإنما آتيناه ليكون { بَصَآئِرَ لِلنَّاسِ } أي: ينوروا بأحكامه وأوامره عيون بصائرهم\n ويستيقظوا من منام الجهل والغفلة\n ويشتغلوا بطلب الحق\n\n\n{ وَهُدًى } يهديهم إلى سلوك مسالك التوحيد { وَرَحْمَةً } يبشرهم إلى البقاء الأبدي السرمدي بعد انخلاعهم عن خلع تعيناتهم العدمية\n والإفناء عن هوياتهم الباطلة { لَّعَلَّهُمْ يَتَذَكَّرُونَ } [القصص: 43] رجاء أن يتذكروا ويتنبهوا من المواعظ والأحكام التي ذُكرت فيه إلى جُبلوا لأجله من المعارف والحقائق والرموز\n والإشارات والمكاشفات والمشاهدات\n\n\nثمَّ لمَّا قصَّ سبحانه على حبيبه صلى الله عليه وسلم ما قصَّ من قصة موسى الكليم\n وكيفية انكشافه من النار الموقدة على الشجرة\n وكيفية عروجه مترقياً من العلم إلى العين ثمَّ إلى الحق\n أراد أن يمن عليه سبحانه بما اصطفاه وفضله من بين البرايا على الرسالة العامة\n وأخبره من المغيبات بطريق الوحي والإلهام ما ليس في وسعه\n لولا وحيه وإلهامه سبحانه إياه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { ولقد آتينا موسى الكتاب }: التوراة { من بعدما أهلكنا القرونَ الأولى } قوم نوح وهود وصالح ولوط - عليهم السلام -، حال كون الكتاب { بصائرَ للناس } أنواراً لقلوبهم، يتبصرون الحقائق، ويُميزون بين الحق والباطل. فالبصيرة: عين القلب، الذي يبصر بها الحق، ويهتدي إلى الرشد والسعادة. كما أن البصر عين الرأس التي يُبصر بها الحسيات، أي: آتيناه التوراة، أنواراً للقلوب التي كانت عمياً لا تستبصر ولا تعرف حقاً من باطل، { وهدىً } وإرشاداً إلى الشرائع لأنهم كانوا يخبطون في الضلال. { ورحمةً } لمن اتبعها لأنهم، إذا عملوا بها، وصلوا إلى نيل الرحمة، { لعلهم يتذكرون } ، أي: ليكونوا على حال يُرجَى منهم التذكر والاتعاظ. وبالله التوفيق. الإشارة: إنما تطيب المنازل إذا خلت من الأجانب والأراذل. وأطيب عيش الأحباب إذا غابت عنهم الرقباء وأهل العتاب، فلما أهلك الله فرعونَ وجنوده وأورث بني إسرائيل ديارهم، ومحى عن جميعها آثارهم، طاب عيشهم، وظهرت سعادتهم، وتمكنوا من إقامة الدين. وكذلك أهل التوجه إلى يوم الدين. ثم ذكر دلائل نبوته صلى الله عليه وسلم بعد ذكر قصة موسى لاشتراكهما في شدة المعالجة، فقال: { وَمَا كُنتَ بِجَانِبِ ٱلْغَرْبِيِّ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:13",
      "similarity": 0.47260938468991226
    },
    {
      "verse": "37:51",
      "similarity": 0.440177520234503
    },
    {
      "verse": "23:49",
      "similarity": 0.42580915180243684
    },
    {
      "verse": "36:31",
      "similarity": 0.41071299598955213
    },
    {
      "verse": "50:27",
      "similarity": 0.3802748995331563
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}