{
  "chapter": "القصص",
  "text": "وما كنت بجانب الغربى اذ قضينا الى موسى الامر وما كنت من الشهدين",
  "translations": [
    {
      "translation": "You were not on the western side when We gave Musa the command. You were not a witness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not there on the western side (of Mount Sinai) when We gave the commandments to Moses, nor were you witness (to the event).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), you were then not on the western side when We bestowed this commandment (of Law), and you were not among its witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you were not present at the west bank to witness when We gave the commandments to Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you (O dear Prophet Mohammed – peace and blessings be upon him) were not on the western side of the Mount when We sent the command of Prophethood to Moosa, and you were not present. (Yet you narrate the account very clearly to the Jews and Christians.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you were not on the western side (of the Mount), when We made clear to Musa the commandment, and you were not among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you were not on the western side when We revealed to Musa the commandment, and you were not among the witnesses;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wast not upon the western side when We decreed to Moses the commandment, nor wast thou of those witnessing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou (Muhammad) wast not on the western side (of the Mount) when We expounded unto Moses the commandment, and thou wast not among those present;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not present on the western side of the Mount when We gave Our Command to Moses: nor were you among the witnesses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wast not on the western side when We decreed the affair unto Musa, and thou wast not of the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not on the western side when We revealed the commandments to Moses, nor were you among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wast not on the Western side when We decreed the Commission to Moses, nor wast thou a witness (of those events).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you (O Muhammad SAW) were not on the western side (of the Mount), when We made clear to Musa (Moses) the commandment, and you were not among those present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Prophet Muhammad) you were not on the western side (of the mountain) when We decreed the commandment to Moses, nor were you among thosewitnessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not on the Western Side when We decreed the command to Moses, nor were you among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, [O Muhammad], were not on the western side [of the mount] when We revealed to Moses the command, and you were not among the witnesses [to that].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:44] And you were not, O Muhammad (s), on the western side, of the mountain, the valley, or the spot, [to the west] of Moses at the time of the communion, when We decreed, revealed, to Moses the commandment, to deliver the Message to Pharaoh and his people, nor were you among the witnesses, to this, to know it and inform of it;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou) Muhammad (wast not on the western side (of the Mount) when We exposited unto Moses the commandment) when We commanded Moses to go to Pharaoh, (and thou wast not among those present) there;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كنت بجانب الغربيّ } أي: جانب غروب شمس الذات الأحدية في عين موسى واحتجابها بعينه في مقام المكالمة لأنه سمع النداء من شجرة نفسه\n ولهذا كانت قبلته جهة المغرب ودعوته إلى الظاهر التي هي مغارب شمس الحقيقة بخلاف عيسى عليه السلام { إذ قضينا إلى موسى الأمر } أوحينا إليه بطريق المكالمة { وما كنت من الشاهدين } مقامه في مرتبة نقبائه وأولياء زمانه الذين شهدوا مقامه\n ولكن بعد قرنك من قرنه بإنشاء قرون كثيرة بينهما فنسوا فأطلعناك على مقامه وحاله في معراجك وطريق صراطك ليتذكروا { وما كنت ثاوياً } مقيماً { في أهل مدين } مقام الروح { تتلو عليهم } علوم صفاتنا ومشاهداتنا\n بل كنت في طريقك إذ ترقيت من الأفق الأعلى فدنوت من الحضرة الأحدية إلى مقام قاب قوسين أو أدنى\n فأخبرتهم بذلك عند إرسالنا إياك بالرجوع إلى مقام القلب بعد الفناء في الحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَمَا كُنتَ } يا أكمل الرسل حين انكشف موسى بالواد المقدس\n وشهد من فضل الله عليه ما شهد { بِجَانِبِ ٱلْغَرْبِيِّ } أي: الوادي الذي على شفيرها الشجرة بالطرف الغربي من مقام موسى\n أي: ما كنت حاضراً عنده { إِذْ قَضَيْنَآ } وأوحينا { إِلَىٰ مُوسَى ٱلأَمْرَ } الذي هو مطلوبه الحقيقي من مطلوبه الصوري { وَمَا كنتَ } حينئذٍ { مِنَ ٱلشَّاهِدِينَ } [القصص: 44] الحاضرين المطلعين على شأنه وشهوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وما كنتَ } يا محمد { بجانب } المكان { الغربي } من الطور\n وهو الذي كلم الله فيه موسى\n وهو الجانب الأيمن\n قال السهيلي: إذا استقبلت القبلة\n وأنت بالشام\n كان الجبل يميناً منك\n غربياً\n غير أنه قال في قصة موسى:\n[مريم: 52 - وطه: 80]\n وصفه بالصفة المشتقة من اليُمن والبركة\n لتكليمه إياه فيه\n وحين نفى عن محمد صلى الله عليه وسلم أن يكون بذلك الجانب\n قال: { وما كنت بجانب الغربي } \n والغربي هو الأيمن\n والعدول عنه\n في حالة النفي للاحتراس من توهم نفي اليمن عنه صلى الله عليه وسلم\n وكيف\n وهو صلى الله عليه وسلم لم يزل بصفة اليُمن وآدم بين الماء والطين! فحسنُ اللفظِ أصل في البلاغة\n ومجانبة الاشتراك الموهم: من فصيحِ بديعِ الفصاحة\n هـ\n أي: وما كانت حاضراً بذلك الموضع\n { إِذْ قَضَينا إلى موسى الأمرَ } \n أي: كلمناه وقربناه نجياً\n وأوحينا إليه بالرسالة إلى فرعون\n { وما كنتَ من الشاهدين } \n أي: من جملة الشاهدين فتخبر بذلك\n ولكن أعلمناك من طريق الوحي\n بعد أن لم يكن لك بذلك شعور\n والمراد: الدلالة على أن إخباره بذلك من قِبَلِ الإخبار بالمغيبات التي لا تُعرف إلا بالوحي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:17",
      "similarity": 0.4645626099075527
    },
    {
      "verse": "26:28",
      "similarity": 0.43268984681923484
    },
    {
      "verse": "73:9",
      "similarity": 0.42474412331027656
    },
    {
      "verse": "70:40",
      "similarity": 0.4008996703400165
    },
    {
      "verse": "50:39",
      "similarity": 0.36885444604344386
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028044.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028044.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}