{
  "chapter": "القصص",
  "text": "ولكنا انشانا قرونا فتطاول عليهم العمر وما كنت ثاويا فى اهل مدين تتلوا۟ عليهم ءايتنا ولكنا كنا مرسلين",
  "translations": [
    {
      "translation": "Yet We produced further generations and ages passed. Nor did you live among the people of Madyan and recite Our Signs to them, yet We have sent you news of them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We raised (many more) generations and prolonged their lives. You did not live with the people of Midian, nor recited to them Our revelations; but We kept on sending messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We raised up many a generation and a long time passed. You were then not even present among the people of Midian to rehearse Our verses to them. But it is We Who are sending news about that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We raised many generations after Moses and they lived for many years. You did not dwell with the people of Midian reciting Our revelations to them, but We had certainly sent Messengers to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, We created generations and ages passed by upon them; and nor were you dwelling with the people of Madyan reciting Our verses to them – however it is We Who made the Noble Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We created generations, and long were the ages that passed over them. And you were not a dweller among the people of Madyan, reciting Our Ayat to them. But it is We Who kept sending (Messengers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We raised up generations, then life became prolonged to them; and you were not dwelling among the people of Madyan, reciting to them Our communications, but We were the senders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but We raised up generations, and long their lives continued. Neither wast thou a dweller among the Midianites, reciting to them Our signs; but We were sending Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We brought forth generations, and their lives dragged on for them. And thou wast not a dweller in Midian, reciting unto them Our revelations, but We kept sending (messengers to men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We brought into being many generations who lived long lives, nor did you live among the people of Midian and recite our revelations to them, it is We who send messengers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We brought forth generations, and prolonged unto them was life; nor wast thou a dweller among the people of Madyan, reciting unto them Our revelations; but it is We who were to send.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We brought forth other generations and time took its toll on them. You did not dwell among the people of Midian reciting to them Our signs, but it is We who are the senders [of the apostles].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We raised up (new) generations, and long were the ages that passed over them; but thou wast not a dweller among the people of Madyan, rehearsing Our Signs to them; but it is We Who send messengers (with inspiration).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We created generations [after generations i.e. after Musa (Moses)], and long were the ages that passed over them. And you (O Muhammad SAW) were not a dweller among the people of Madyan (Midian), reciting Our Verses to them. But it is We Who kept sending (Messengers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We raised generations who lived long. You did not live among the people of Midian, nor did you recite to them Our verses; but We were sendingMessengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We established many generations, and time took its toll on them. Nor were you among the people of Median, reciting Our revelations to them. But We kept sending messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We produced [many] generations [after Moses], and prolonged was their duration. And you were not a resident among the people of Madyan, reciting to them Our verses, but We were senders [of this message].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:45]   but We brought forth generations, communities, after Moses, and life was prolonged in their case, in other words, they lived long lives and so they forgot the covenants [made with God], knowledge disappeared and revelation ceased. Then We brought you as Messenger and revealed to you the story of Moses and others. And you were not a dweller, a resident, among the people of Midian reciting to them Our revelations (tatlū ‘alayhim āyātinā, a second predicate [after thāwiyan, ‘dweller’), to know their story and inform of it; but truly We are the senders, of you [as Messenger] and [the senders] to you of the stories of former generations.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But We brought forth) We created (generations) generation after generation, and explained the event of the former to the latter, just as We explained it to you, (and their lives dragged on for them) their lives were prolonged, and when they did not believe We destroyed them. (And thou wast not) Muhammad (a dweller in Midian, reciting unto them Our revelations) reciting the Qur'an to your people, (but We kept sending (messengers to men)) to past generations and exposited to them the events of those who preceded them just as We explained the events of the people of old to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَكِنَّآ أَنشَأْنَا قُرُوناً } معناه خَلقنَاهُم\n وقروناً أي أمماً\n\n\n\n\nوقوله تعالى: { وَمَا كُنتَ ثَاوِياً فِيۤ أَهْلِ مَدْيَنَ } معناه مُقيمٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَكِنَّآ } من كمال لطفنا وجودننا أخبرناك بما جرى بينه وبيننا في تلك الليلة، كما أخبرنا لك أحوال أمم { أَنشَأْنَا } من بعد موسى ومن قبلك { قُرُوناً } أي: زماناً متطاولة ومدة بعيدة { فَتَطَاوَلَ عَلَيْهِمُ ٱلْعُمُرُ } ومكثوا في الدنيا كثيراً، ودار بينهم الدول الحول وحدثت الفتن والمحن، ووقعت التغييرات والتحريفات في الشرائع والأديان، واندست معالم الهدى، وفشا الجدال والطغيان، واستولت الهوية الفاسدة والآراء الباطلة على أهل الزمان، فأخبرنا لك في كتابك هذا من وقائعهم؛ لتكون تذكرة لك، وعبرة للمؤمنين بك\n\n\n\n\n{ وَمَا كُنتَ } أيضاً يا أكمل الرسل { ثَاوِياً } مقيماً { فِيۤ أَهْلِ مَدْيَنَ } شعيب عليه السلام { تَتْلُواْ عَلَيْهِمْ آيَاتِنَا } الدالة على كمال القسط والعدالة بلسان شعيب عليه السلام حين انحرفوا عن جادة الاعتدال في المكيلات والموزونات، واشتغلوا بالبخص والتطفيف وأنواع التنقيص والتخسير { وَلَكِنَّا كُنَّا مُرْسِلِينَ } [القصص: 45] مخبرين لك، موحين إليك ما جرى عليهم الأحوال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}