{
  "chapter": "القصص",
  "text": "وما كان ربك مهلك القرى حتى يبعث فى امها رسولا يتلوا۟ عليهم ءايتنا وما كنا مهلكى القرى الا واهلها ظلمون",
  "translations": [
    {
      "translation": "Your Lord would never destroy any cities without first sending to the chief of them a Messenger to recite Our Signs to them. We would never destroy any cities unless their inhabitants were wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But your Lord does not destroy habitations without having sent an apostle to their metropolis to read out Our commandments to them. We would never have destroyed cities if their inhabitants were not given to wickedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would not destroy a town until He had sent to its centre a Messenger who would recite to them Our verses. Nor would We destroy any town unless its inhabitants were iniquitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord did not destroy the people of the towns without first sending a Messenger to the mother town who would recite His revelations to them. We did not want to destroy the towns if the people therein were not unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never does your Lord destroy towns until He sends a Noble Messenger to their principal town, reciting Our verses to them; and We never destroy towns unless its people are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never will your Lord destroy the towns until He sends to their mother town a Messenger reciting to them Our Ayat. And never would We destroy the towns unless the people thereof are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord never destroyed the towns until He raised in their metropolis an apostle, reciting to them Our communications, and We never destroyed the towns except when their people were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet thy Lord never destroyed the cities until He sent in their mother-city a Messenger, to recite Our signs unto them; and We never destroyed the cities, save that their inhabitants were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never did thy Lord destroy the townships, till He had raised up in their mother(-town) a messenger reciting unto them Our revelations. And never did We destroy the townships unless the folk thereof were evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would never destroy a people until He had sent messengers to their capital cities, reciting to them Our revelations. Nor did We destroy a town unless their people became wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor was thy Lord to destroy the Cities, until He had raised up in their mother-city an apostle reciting unto them our revealations. Nor were We to destroy the cities unless the inhabitants thereof were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would not destroy the towns until He had raised an apostle in their mother city to recite to them Our signs. We would never destroy the towns except when their people were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor was thy Lord the one to destroy a population until He had sent to its centre a messenger, rehearsing to them Our Signs; nor are We going to destroy a population except when its members practise iniquity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never will your Lord destroy the towns (populations) until He sends to their mother town a Messenger reciting to them Our Verses. And never would We destroy the towns unless the people thereof are Zalimun (polytheists, wrong-doers, disbelievers in the Oneness of Allah, oppressors and tyrants).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did your Lord destroy the villages until He had sent a Messenger to its mother village reciting to them Our verses. We never destroyed villages unless their inhabitants were harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord never destroys cities without first sending a messenger in their midst, reciting to them Our revelations. And We never destroy the cities, unless their people are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never would your Lord have destroyed the cities until He had sent to their mother a messenger reciting to them Our verses. And We would not destroy the cities except while their people were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:59] And your Lord never destroyed the towns, because of evildoing on their part, until He had raised up in their mother-town, that is, the major [town] among them, a messenger to recite Our signs to them. And We never destroyed the towns unless their inhabitants were committing evil, by denying the messengers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And never did thy Lord destroy the townships) the inhabitants of any township, (till He had raised up in their mother (-town)) their greatest town, i.e. Mecca; it is also said that this means: until He sends to their leaders and chiefs (a messenger reciting unto them Our revelations) explaining the commands and prohibitions. (And never did We destroy the townships) the inhabitants of any township (unless the folk thereof were evil-doers) idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا كَانَ رَبُّكَ مُهْلِكَ ٱلْقُرَىٰ حَتَّىٰ يَبْعَثَ فِيۤ أُمِّهَا رَسُولاً } فأم القُرى: مَكةٌ وأُم كُلِّ شَيءٍ أَصلُهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And your Lord is not one to destroy the cities until He sends in their mother a messenger} So the mother of the cities is Mecca and the mother of everything is its origin.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا كَانَ رَبُّكَ } يا أكمل الرسل { مُهْلِكَ ٱلْقُرَىٰ } وما ينبغي ويليق بشأن العليم الحكيم أخذهم بغتةً بلا منبه منذر\n بل ما أخذهم على ظلمهم { حَتَّىٰ يَبْعَثَ فِيۤ أُمِّهَا } أي: البلدة التي هي أم القرى الهالكة\n إذ أهلها قبل المرشد والهداية من أصحاب القرى والنواحي\n وهم تابعون لهم في معظم أمورهم { رَسُولاً } مؤيَّداً من عندنا\n مرسلاً إليهم { يَتْلُو عَلَيْهِمْ آيَاتِنَا } الدالة على عظيم ذاتنا\n وكمال قدرتنا على الإنعام والانتقام\n ويدعوهم إلى توحيدنا والتدين بالدين الموضوع من عندنا\n فتلا عليهم آياتنا فدعاهم إلى توحيدنا وديننا\n فلم يقبلوا قوله ولم يستجيبوا له\n بل كذبوه وجميع ما جاء به من الرشد والهداية مصرين على ما هم عليه من الغواية\n فاستحقوا الهلاك والعذاب فأهلكناهم\n\n\n{ وَ } بالجلمة: { مَا كُنَّا مُهْلِكِي ٱلْقُرَىٰ إِلاَّ وَأَهْلُهَا ظَالِمُونَ } [القصص: 59] يعني: ما كنا مبادرين على إهلاك القرى الهالكة بلا سبق أسباب صدرت عنهم\n واستوجبت هلاكهم\n بل إنما أخذناهم بعدما ظلموا أنفسهم بالخروج عن مقتضى حدودنا الموضوعة فيها ظلماً وعدواناً\n وصاروا مصرين مباهين بما آتيناهم من زخرفة الدنيا المستعارة الفانية التي ألهاهم عن اللذائذ الأخروية الباقية فيهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { رسولاً } لإلزام الحجة وقطع المعذرة\n أو: ما كان في حكم الله وسابق قضائه أن يهلك القرى في الأرض حتى يبعث في أمها\n وهي مكة لأن الأرض دحيت من تحتها\n { رسولاً } يعني: محمداً صلى الله عليه وسلم\n { يتلوا عليهم آياتنا } القرآن\n { وما كنا مهلكي القرى إلا وأهلُها ظالمون } \n أي: وما أهلكناهم للانتقام\n إلا وأهلها مستحقون العذاب بظلمهم\n وهو إصرارهم على الكفر والمعاصي\n والعناد\n بعد الإعذار إليهم\n والله تعالى أعلم\n الإشارة: وكم خَرَّبْنَا من قلوب وأخليناها من النور\n حيث طغت وتجبرت في معيشتها\n وانشغلت بحظوظها وشهواتها\n فتلك أماكنها خاوية من النور\n لم تُسكن بالنور إلا قليلاً\n وكنا نحن الوارثين لها\n فأعطينا ذلك النور غيرها\n وما فعلنا ذلك حتى بعثنا من يُذكرها ويُنذرها\n وما كنا مهلكي قلوبٍ وَمُتْلِفيهَا إلا وأهلها ظالمون\n بإيثار الغفلة والشهوة على اليقظة والعفة\n والله تعالى أعلم\n وسبب هلاك هو حب الدنيا\n ولذلك حقرّ الله تعالى شأنها\n فقال: { وَمَآ أُوتِيتُم مِّن شَيْءٍ فَمَتَاعُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:117",
      "similarity": 0.6109133920095341
    },
    {
      "verse": "6:131",
      "similarity": 0.5161545998152243
    },
    {
      "verse": "29:31",
      "similarity": 0.5122707364012541
    },
    {
      "verse": "15:4",
      "similarity": 0.49896327212285746
    },
    {
      "verse": "62:2",
      "similarity": 0.49486819859435094
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/28:59.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/28:59.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/28:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}