{
  "chapter": "القصص",
  "text": "وكم اهلكنا من قريةۭ بطرت معيشتها فتلك مسكنهم لم تسكن منۢ بعدهم الا قليلا وكنا نحن الورثين",
  "translations": [
    {
      "translation": "How many habitations that had come to boast of their resources have We destroyed? These their dwellings were never inhabited except rarely after them; and they came back to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town did We destroy whose inhabitants exulted on account of their affluence. These are their dwellings in which very few dwelt after them. Eventually it is We Who inherited them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many nations, who had enjoyed great prosperity, had We destroyed? Those are their homes which were not inhabited thereafter except for a short time. Only We were their heirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many towns did We destroy which had stooped to self indulgence! So here lie their dwellings, uninhabited after them except a little; and only We are the Inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town have We destroyed, which was thankless for its means of livelihood! And those are their dwellings, which have not been inhabited after them except a little. And verily, We have been the heirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town have We destroyed which exulted in its means of subsistence, so these are their abodes, they have not been dwelt in after them except a little, and We are the inheritors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a city We have destroyed that flourished in insolent ease! Those are their dwelling-places, undwelt in after them, except a little; Ourselves are the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a community have We destroyed that was thankless for its means of livelihood! And yonder are their dwellings, which have not been inhabited after them save a little. And We, even We, were the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many townships have We destroyed where the people had become arrogant on account of their affluence? Since then their dwelling-places have scarcely been inhabited -- We became their inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city have We destroyed that exulted in their living! And yonder are their dwellings which have not been inhabited after them unless for a little while; and verily We! We have been the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town We have destroyed that exulted in its lifestyle! There lie their dwellings, uninhabited after them except by a few, and We were the [sole] inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many populations We destroyed, which exulted in their life (of ease and plenty)! now those habitations of theirs, after them, are deserted,- All but a (miserable) few! and We are their heirs!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town (population) have We destroyed, which were thankless for its means of livelihood (disobeyed Allah, and His Messengers, by doing evil deeds and crimes)! And those are their dwellings, which have not been inhabited after them except a little. And verily! We have been the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a village have We destroyed that were ungrateful in their life! Those are their dwellings, (they are) uninhabited after them except for a little; We are the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city did We destroy for turning unappreciative of its livelihood? Here are their homes, uninhabited after them, except for a few. And We became the Inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city have We destroyed that was insolent in its [way of] living, and those are their dwellings which have not been inhabited after them except briefly. And it is We who were the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:58] And how many a town We have destroyed whose lifestyle was one of arrogant ungratefulness — by ‘town’ is meant the inhabitants thereof. Those are their dwellings, which have not been dwelt in after them except a little, by passers-by, for a day or part of it. And it was We Who were the [sole] inheritors, after them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And how many a community) how many inhabitants of a community (have We destroyed that was thankless for its means of livelihood! And yonder are their dwellings, which have not been inhabited after them) after their destruction (save a little) save some of them which are inhabited by travellers whereas most of them are in ruin. (And We, even We, were the inheritors) the owners of what they had owned and left behind after their destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قل لهم يا أكمل الرسل نيابةً عنَّا: لا تغرنَّكم الحياة الدنيا، وإمهالنا إياكم فيها مترفهين متنعمين؛ إذ { كَمْ أَهْلَكْنَا مِن قَرْيَةٍ } أي: كثيراً أهكلنا أهل قرية قد { بَطِرَتْ مَعِيشَتَهَا } أي: كان أهلها بطرين بسعة عيشها، ووفور معيشتها أمثالكم فدرا عليهم الدول، فأخذناهم بأنواع النقم بدل نعمهم، فأهلكناهم واستأصلناهم صاغرين؟! { فَتِلْكَ } الأطلال الخربة، والآثار الكربة التي تجاه وجوهكم { مَسَاكِنُهُمْ } وأوطانهم التي يتمكنون فيها مترفهين بطرين، انظر كيف اندرست وتفتت إلى حيث { لَمْ تُسْكَن مِّن بَعْدِهِمْ } في بلادهم وأماكنهم\n\n\n\n\n{ إِلاَّ قَلِيلاً } من أهل السفر والعبور ينزلون فيه، ويرحلون بلا إقامة فيها ووارثةٍ لها، وهكذا الدنيا وحياتها، والاستقرار عليها والتمتع بمتاعها عند العارف المتحقق بحقيقتها { وَ } بعدما أهلكناهم، وخربنا بلادهم { كُنَّا نَحْنُ ٱلْوَارِثِينَ } [القصص: 58] منهم، حيث لا نمكن فيها خلفاً من أبناء من شؤم آثارهم ومعاصيهم التي كانوا عليها مصرين غير ممتنعين، وإن أرسلنا عليهم الرسل، وأنزلنا عليهم الكتب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}