{
  "chapter": "القصص",
  "text": "ونريد ان نمن على الذين استضعفوا۟ فى الارض ونجعلهم ائمة ونجعلهم الورثين",
  "translations": [
    {
      "translation": "We desired to show kindness to those who were oppressed in the land and to make them leaders and",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wished to favour those who were weak in the land and make them leaders and heirs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wanted to bestow favour on those who were oppressed in the land. We wanted to make them leaders and heirs\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We have decided to grant a favor to the suppressed ones by appointing them leaders and heirs of the land,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We willed to favour those who were weak in the earth, and to make them leaders and to make them the inheritors (of the land and wealth of Firaun’s people).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wished to do a favor to those who were weak in the land, and to make them rulers and to make them the inheritors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We desired to bestow a favor upon those who were deemed weak in the land, and to make them the Imams, and to make them the heirs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet We desired to be gracious to those that were abased in the land, and to make them leaders, and to make them the inheritors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We desired to show favour unto those who were oppressed in the earth, and to make them examples and to make them the inheritors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wished to favour those who were oppressed in the land, and to make them leaders and make them inheritors [of Our bounties],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We desired that We should be gracious unto those who were weakened in the land, and We should make them leaders and We should make them the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We desired to show favour to those who were abased in the land, and to make them imams, and to make them the heirs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wished to be Gracious to those who were being depressed in the land, to make them leaders (in Faith) and make them heirs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wished to do a favour to those who were weak (and oppressed) in the land, and to make them rulers and to make them the inheritors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We wanted to be gracious to those abased in the land, and to make them leaders and inheritors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We desired to favor those who were oppressed in the land, and to make them leaders, and to make them the inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wanted to confer favor upon those who were oppressed in the land and make them leaders and make them inheritors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:5] And We desired to show favour to those who were oppressed in the land, and to make them exemplars (read a’immatan, pronouncing both hamzas, or by replacing the second one with a yā’) whose good example would be followed, and to make them the inheritors, of Pharaoh’s kingdom;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We desired) by sending Moses to them and consequently destroying them (to show favour) to save (unto those who were oppressed) i.e. the Children of Israel (in the earth) in the land of Egypt, (and to make them examples) of goodness (and to make them the inheritors) of the land of Egypt,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما بالغ في الإفساد والعناد، وتمادى في الجور والفساد زماناً { نُرِيدُ } بمقتضى جودنا وسعة رحمتنا { أَن نَّمُنَّ } منة عظيمة { عَلَى } عبادنا { ٱلَّذِينَ ٱسْتُضْعِفُواْ فِي ٱلأَرْضِ } أي: أرض العمالقة، وهم بنو إسرائيل الأُسراء المظلمون في أدي القبط { وَنَجْعَلَهُمْ أَئِمَّةً } قدوة كراماً متبوعين بعدما كانوا أتباعاً أذلاء صاغرين { وَنَجْعَلَهُمُ ٱلْوَارِثِينَ } [القصص: 5] من ظالميهم، يرثون منهم أرضهم وديارهم وأموالهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:6",
      "similarity": 0.4847143557265493
    },
    {
      "verse": "68:3",
      "similarity": 0.4549140689609998
    },
    {
      "verse": "49:17",
      "similarity": 0.43837382914342854
    },
    {
      "verse": "41:8",
      "similarity": 0.43824430772519574
    },
    {
      "verse": "84:25",
      "similarity": 0.4355894666727883
    }
  ]
}