{
  "chapter": "القصص",
  "text": "واذا سمعوا۟ اللغو اعرضوا۟ عنه وقالوا۟ لنا اعملنا ولكم اعملكم سلم عليكم لا نبتغى الجهلين",
  "translations": [
    {
      "translation": "When they hear worthless talk they turn away from it and say, 'We have our actions and you have your actions. Peace be upon you. We do not desire the company of the ignorant.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear idle talk they turn aside and say: \"To us our actions, to you yours. Peace on you; we do not look for the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear any vain talk, they turn away from it, saying: \"We have our deeds and you have your deeds. Peace be to you. We do not desire to act like the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear impious words, they ignore them, saying, \"We shall be responsible for our deeds and you will be responsible for yours. Peace be with you. We do not want to become ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear indecent speech, they ignore it and say, “For us are our deeds and for you are your deeds; peace be to you (good bye); we are not interested in the ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear evil vain talk, they withdraw from it and say: \"To us our deeds, and to you your deeds. Peace be to you. We seek not (the way of) the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear idle talk they turn aside from it and say: We shall have our deeds and you shall have your deeds; peace be on you, we do not desire the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear idle talk, they turn away from it and say, 'We have our deeds, and you your deeds. Peace be upon your We desire not the ignorant.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vanity they withdraw from it and say: Unto us our works and unto you your works. Peace be unto you! We desire not the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear vain talk, they turn away from it and say, \"We have our actions and you have yours. We wish you peace. We will have nothing to do with the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vain discourse they withdraw therefrom and say: unto US our works, and unto you your works; peace be unto you; we seek not the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear vain talk, they avoid it and say, ‘Our deeds belong to us, and your deeds belong to you. Peace be to you. We do not court the ignorant.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vain talk, they turn away therefrom and say: \"To us our deeds, and to you yours; peace be to you: we seek not the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear Al-Laghw (dirty, false, evil vain talk), they withdraw from it and say: \"To us our deeds, and to you your deeds. Peace be to you. We seek not the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and because when they hear idle talk they turn away from it and say: 'We have our deeds, and you have your deeds. Peace be upon you. We do not desire the ignorant'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vain talk, they avoid it, and say, “We have our deeds, and you have your deeds; peace be upon you; we do not desire the ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear ill speech, they turn away from it and say, \"For us are our deeds, and for you are your deeds. Peace will be upon you; we seek not the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:55] And when they hear vanity, vile words and hurtful intent from the disbelievers, they disregard it and say, ‘To us [belong] our deeds and to you [belong] your deeds. Peace to you — a parting truce (salām mutāraka), in other words you are secure from any abuse or the like on our part. We do not desire [friendship with] the ignorant’, we do not seek companionship with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقَالُوا لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ سَلَامٌ عَلَيْكُمْ لَا نَبْتَغِي الْجَاهِلِينَ (55)والخصلة الخامسة : الإعراض عن اللغو ، وهو الكلام العبث الذي لا فائدة فيه ، وهذا الخلق من مظاهر الحكمة ، إذ لا ينبغي للعاقل أن يشغل سمعه ولُبّه بما لا جدوى له وبالأولى يتنزه عن أن يصدر منه ذلك .والخصلة السادسة : الكلام الفصل وهو قولهم { لنا أعمالنا ولكم أعمالكم سلام عليكم } وهذا من أحسن ما يجاب به السفهاء وهو أقرب لإصلاحهم وأسلم من تزايد سفههم .ولقد أنطقهم الله بحكمة جعلها مستأهلة لأن تُنظم في سلك الإعجاز فألهمهم تلك الكلمات ثم شرّفها بأن حيكت في نسج القرآن ، كما ألهم عمر قوله{ عسى ربه إن طلقكن } \\[ التحريم : 5 \\] الآية .ومعنى { لنا أعمالنا ولكم أعمالكم } أن أعمالنا مستحقة لنا كناية عن ملازمتهم إياها وأما قولهم { ولكم أعمالكم } فهو تتميم على حد { لكم دينكم ولي دين } \\[ الكافرون : 6 \\] .والمقصود من السلام أنه سلام المتاركة المكنى بها عن الموادعة أن لا نعود لمخاطبتكم قال الحسن : كلمة : السلام عليكم ، تحية بين المؤمنين ، وعلامة الاحتمال من الجاهلين . ولعل القرآن غير مقالتهم بالتقديم والتأخير لتكون مشتملة على الخصوصية المناسبة للإعجاز لأن تأخير الكلام الذي فيه المتاركة إلى آخر الخطاب أولى ليكون فيه براعة المقطع .وحذف القرآن قولهم : لم نأل أنفسنا رشداً ، للاستغناء عنه بقولهم { لنا أعمالنا ولكم أعمالكم } .السابعة : ما أفصح عنه قولهم { لا نبتغي الجاهلين } من أن ذلك خلقهم أنهم يتطلبون العلم ومكارم الأخلاق . والجملة تعليل للمتاركة ، أي لأنا لا نحب مخالطة أهل الجهالة بالله وبدين الحق وأهل خُلق الجهل الذي هو ضد الحلم ، فاستعمل الجهل في معنييه المشترك فيها ولعله تعريض بكنية أبي جهل الذي بذا عليهم بلسانه .والظاهر أن هذه الكلمة يقولونها بين أنفسهم ولم يجهروا بها لأبي جهل وأصحابه بقرينة قوله { ويدرأون بالحسنة السيئة } وقوله { سلام عليكم } وبذلك يكون القول المحكي قولين : قول وجهوه لأبي جهل وصحبه ، وقول دار بين أهل الوفد .\n\n",
      "translations": [
        {
          "translation": "(And when they hear vanity) falsehood, i.e. being vilified by the disbelievers (they withdraw from it) in an honourable way (and say) kindly: (Unto us our works) the worship of Allah and the religion of Islam (and unto you your works) upon you is the onus of your works: the worship of idols, the religion of the devil and the association of partners with Allah. (Peace be unto you!) May Allah guide you! (We desire not the ignorant) we do not seek the religion of those who associate partners with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا سَمِعُواْ ٱللَّغْوَ أَعْرَضُواْ عَنْهُ } معناه سَمِعُوا فحشاءَ\n\n",
      "translations": [
        {
          "translation": " And when they hear {obscenity}, they turn away from it.\n\nThis means that when they hear obscenity, they turn away from it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذا سمعوا } لغواً لفضول المانع من القبول لم يلحوا وأعرضوا لكونهم أولياء موحدين لا أنبياء { سلام عليكم } سلّمكم الله من الآفات المانعة عن قبول الحق { لا نبتغي } صحبة { الجاهلين } المفقودين بالسفاهة والجهل المركّب\n فإنهم لا ينتفعون بصحبتنا ولا يقبلون هدايتنا\n { إنك لا تهدي من أحببت } هدايته لاهتمامك بحاله غير مطلع على استعداده بمجرّد الجنسية النفسية أو للقرابة البدنية دون الأصلية\n أو الصحبة العارضية دون الحقيقة الروحية { ولكنّ الله يهدي من يشاء } من أهل عنايته { وهو أعلم بالمهتدين } القابلين للهداية لاطلاعه على استعدادهم وكونهم غير مطبوع على قلوبهم\n { فعميت عليهم الأنباء يومئذ } أي: خُفِيت عليهم الحقائق والتبست في القيامة الصغرى لكونهم محجوبين\n واقفين مع الأغيار كالعمي\n وقد رسخ جهلهم الشامل أوقات النشأتين كقوله:\n[الإسراء\n الآية:72]\n { فهم لا يتساءلون } لعجزهم عن النطلق وكونهم مختوماً على أفواههم\n { فأمّا من تاب } تنصل عما غطى بصيرته وغشى قلبه واستعداده من صفات النفس\n وآمن بالغيب بطريق العلم { وعمل } في التحلية واكتساب الخيرات والفضائل { عملاً صالحاً فعسى أن يكون من المفلحين } الفائزين بالتجرّد عن مقام النفس بمقام القلب والرجوع إلى الفطرة من حجاب النشأة\n { وربّك يخلق ما يشاء } من المحجوبين والمكاشفين { ويختار } بمقتضى مشيئته وعنايته لهم ما يريد { ما كان لهم الخيرة } في ذلك { سبحان الله } نزّهه عن أن يكون لغيره اختيار مع اختياره فيكون شريكه\n { لا إله إلا هو } لا شريك له في الوجود { له الحمد } المطلق لثبوت جميع الكمالات الظاهرة على مظاهر الأكوان\n والباطنة فيها وعنها له\n فيكون كل جميل غنيّ قوي عزيز في الدنيا بجماله وغناه وقوّته وعزّته جميلاً غنيّاً قويّاً عزيزاً\n وكل كامل عالم عارف به في الآخرة بكماله وعلمه ومعرفته كاملاً عالماً عارفاً { وله الحكم } يقهر كل شيء على مقتضى مشيئته ويحكم عليه بموجب إرادته\n فيكون كل قبيح فقير ذليل ضعيف في الدنيا بحكمه\n وتحت قهره\n كذلك وكل محجوب مخذول\n أسير\n مردود في الآخرة في قهره وتحت حكمه مخذولاً محجوباً أسيراً مردوداً { وإليه ترجعون } بالفناء في وجوده أو أفعاله وصفاته أو ذاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وصيانتهم نفوسهم عن نواهينا { إِذَا سَمِعُواْ ٱللَّغْوَ } أي: الكلام الخالي عن المصلحة الدينية { أَعْرَضُواْ عَنْهُ } اتقاءً وتحرزاً عن وصمة المداهنة والمراضاة بما لا يرضى منه سبحانه { وَقَالُواْ } من سلامة نفوسهم\n وكمال علمهم للمرتكبين بعدما لم يقدروا على نهيهم: { لَنَآ } جزاء { أَعْمَالُنَا } التي اقترفناها بسعينا واجتهادنا { وَلَكُمْ } جزاء { أَعْمَالُكُمْ } التي أنتم عليها مصرين\n وقالوا لهم حين توديعهم والذب عنهم: { سَلاَمٌ عَلَيْكُمْ } أي: سلمكم الله العفو الرحيم عن عوائد ما كنتم عليه ووفقكم على التوبة والإنابة\n وما لنا معكم مطالبة ومجادلة سوى إنَّا { لاَ نَبْتَغِي } ولا نطلب مصاحبة { ٱلْجَاهِلِينَ } [القصص: 55] بسوء عواقب الخصائل الغير المرضية عند الله وعند خالص عباده\n\n\n \" ثمَّ لمَّ أحتضر أبو طالب\n ودنا أن يخرج من الدنيا جاءه رسول الله صلى الله عليه وسلم مهتماً بإيمانه وتوحيده\n فقال له: \" قل يا عمِّ مرة: لا إله إلا الله\n أحاج بها لك عند ربي\n وأخرجك بها عن زمرة المشركين \" قال: يا ابن أخي\n والله إني علمت إنك لصادق في جميع ما جئت به\n لكن أكره أن يقال: جزع أبو طالب عند الموت \" \nأي: ضعف وجبن\n\n\nأنزل سبحانه هذه الآية\n تأديباً لحبيبه صلى الله عليه وسلم\n وردعاً عن طلب شيء لا يُعرف حصوله\n فقال: { إِنَّكَ } يا أكمل الرسل من شدة حرصك واهتمامك { لاَ تَهْدِي } وترشد إلى طريق الحق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا سمعوا اللغْوَ } الباطل\n أو الشتم من المشركين\n { أعْرضوا عنه وقالوا } للاغين: { لنا أعمالنا ولكم أعمالكم سلامٌ عليكم } أمان منا عليكم\n لا نقابل لغوكم بمثله\n { لا نبتغي الجاهلين } لا نريد مخالطتهم وصحبتهم\n أو: لا نبتغي دين الجاهلين\n أو محاورة الجاهلين وجدالهم\n أو: لا نريد أن نكون جهالاً\n وفي السَير: أن أصحاب النجاشي لَمَّا كلمهم جعفر رضي الله عنه في مجمع النجاشي\n بَكَوْا\n ووقر الإسلام في قلوبهم\n فقدِموا على رسول الله صلى الله عليه وسلم بمكة\n فقرأ عليهم القرآن\n فأسلموا وقالوا: { آمنا به إنه الحق من ربنا\n\n } الآية\n فلما خرجوا من عنده صلى الله عليه وسلم استقبلتهم قريش فسبوهم\n وقالوا: ما رأينا قوماً أحمق منكم\n تركتم دينكم لمجلس ساعة مع هذا الرجل\n فقالوا لهم: { سلام عليكم\n\n\n } إلخ\n الإشارة: مَنْ تَحَمَّلَ من العلماء مشقة تَحَمُّلِ العلمِ الظاهر\n ثم ركب أهواء النفس ومحاربتَها في تحصيل العلم الباطن\n فهو ممن يُوتى أجره مرتين\n وينال عز الدارين ضعفين بسبب صبره على العِلْمَيْن\n وارتكاب الذل مرتين\n إذا اتصف بما اتصف به أولئك\n بحيث يدرأ بالحسنة السيئة\n وينفق مما رزقه الله من الحس والمعنى\n كالعلوم والمواهب\n ويعرض عن اللغو - وهو كل ما يشغل عن شهود الله - ويحلم عن الجاهل\n ويرفق بالسائل\n وبالله التوفيق\n ولما حرص صلى الله عليه وسلم على إسلام عمه\n نزل: { إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:3",
      "similarity": 0.7392795681775107
    },
    {
      "verse": "88:11",
      "similarity": 0.6954883815914602
    },
    {
      "verse": "78:35",
      "similarity": 0.6870196105541125
    },
    {
      "verse": "56:25",
      "similarity": 0.642201956343681
    },
    {
      "verse": "41:26",
      "similarity": 0.5754670613510013
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028055.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028055.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}