{
  "chapter": "القصص",
  "text": "او۟لئك يؤتون اجرهم مرتين بما صبروا۟ ويدرءون بالحسنة السيئة ومما رزقنهم ينفقون",
  "translations": [
    {
      "translation": "They will be given their reward twice over because they have been steadfast and because they ward off the bad with the good and give from what we have provided for them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be given their recompense twice, for they persevered and repelled evil with good, and spent of what We had given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be granted their reward twice over because they remained steadfast; they repel evil with good, and spend (in alms) out of the sustenance We provided them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will receive double reward for their forbearance, replacing evil by virtue, and for their spending for the cause of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be given double the reward, the recompense of their patience – and they repel evil with good, and spend part of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be given their reward twice over, because they are patient, and repel evil with good, and spend out of what We have provided for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These shall be granted their reward twice, because they are steadfast and they repel evil with good and spend out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These shall be given their wage twice over for that they patiently endured, and avert evil with good, and expend of that We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be given their reward twice over, because they are steadfast and repel evil with good, and spend of that wherewith We have provided them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people as these will receive a double reward, because they are steadfast and repel evil with good, and give alms out of what We have given them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These shall be vouchsafed their hire twice over, because they have persevered, and they repel evil with good, and expend of that wherewith We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will be given their reward two times for their patience. They repel evil [conduct] with good, and spend out of what We have provided them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Twice will they be given their reward, for that they have persevered, that they avert Evil with Good, and that they spend (in charity) out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be given their reward twice over, because they are patient, and repel evil with good, and spend (in charity) out of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their wage shall be given them twice, because they have endured patiently, averting evil with good and spending from what We have given them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be given their reward twice, because they persevered; and they counter evil with good; and from Our provisions to them, they give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will be given their reward twice for what they patiently endured and [because] they avert evil through good, and from what We have provided them they spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:54] Those will be given their reward twice over, for believing in both Scriptures, for the patience they showed, for having been steadfast in implementing [the prescriptions in] them; and they ward off, from themselves, evil with good, and expend, give as voluntary alms, of that which We have provided them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These) those whose traits are thus (will be given their reward twice over, because they are steadfast) in the 442 face of the harm and vilification coming from the disbelievers whenever they showed the attributes and description of the Prophet Muhammad (pbuh) in their own Scriptures or embraced the religion of Muhammad (pbuh) (and repel evil with good) they repel idolatry from others by means of \"there is no deity except Allah\", (and spend) and give to charity (of that wherewith We have provided them) of wealth,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَدْرَؤُنَ بِٱلْحَسَنَةِ ٱلسَّيِّئَةَ } معناه يَدْفعونَ بِهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they repel with the good the evil} [means that] they repel it with it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } السعداء المقبولون عند الله { يُؤْتُونَ } ويعطون { أَجْرَهُم مَّرَّتَيْنِ } أي: ضعفين\n أي: مرة على الإيمان السابق بالقرآن وبمحمد صلى الله عليه وسلم بمقتضى ما ثبت في كتابهم\n ومرة على الإيمان اللاحق بعدما عاينوا ما وصف لهم في كتابهم\n وإنما ضوعفوا { بِمَا صَبَرُواْ } وثبتوا على ما نزل عليه من قبل الحق\n ولم يتركوا امتثاله سابقاً ولا حقاً بواسطة دوامهم وثباتهم على الأمر أو في كتابه { وَيَدْرَؤُنَ } أي: يدفعون ويسقطون { بِٱلْحَسَنَةِ } أي: الخصلة الحميدة الموجبة لأنواع الإفضال والإنعام { ٱلسَّيِّئَةَ } الجالبة لأنواع العذاب والخذلان { وَ } هم أيضاً من كمال اتصافهم بالكمال والإحسان { مِمَّا رَزَقْنَاهُمْ } وأقدرناهم على كسبه { يُنفِقُونَ } [القصص: 54] من سبيلنا\n طلباً لمرضاتنا\n\n\n{ وَ } من كمال تحفظهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك يُوْتَون أجرَهم مرتين بما صبروا } بصبرهم على الإيمان بالتوراة\n والإيمان بالقرآن\n أو: بصبرهم على الإيمان بالقرآن\n قبل نزوله وبعده\n أو بصبرهم على أذى المشركين وأهل الكتاب\n وفي الحديث:\n \" ثلاثةٌ يُؤْتَوْنَ أَجْرَهُمْ مرتين: رجل من أهل الكتاب آمن بنبيه\n ثم آمن بمحمد صلى الله عليه وسلم\n ورجل مملوك أدى حق الله وحق مواليه\n ورجل كانت عنده أمَةٌ فأعتقتها وتزوجها \"\n \n{ ويدرؤون بالحسنةِ السيئةَ } يدفعون الخصلة القبيحة بالخصلة الحسنة\n يدفعون الأذى بالسِلم\n والمعصية بالطاعة\n { ومما رزقناهم ينفقون } يتصدقون\n أو يزكون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:8",
      "similarity": 0.7202622163344066
    },
    {
      "verse": "2:72",
      "similarity": 0.7103256708297933
    },
    {
      "verse": "13:22",
      "similarity": 0.709765823735296
    },
    {
      "verse": "3:168",
      "similarity": 0.6839359617123629
    },
    {
      "verse": "33:31",
      "similarity": 0.2033210708666429
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:54.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:54.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}