{
  "chapter": "القصص",
  "text": "واذا يتلى عليهم قالوا۟ ءامنا به انه الحق من ربنا انا كنا من قبله مسلمين",
  "translations": [
    {
      "translation": "When it is recited to them they say, 'We have iman in it; it is the truth from our Lord. We were already",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is read out to them, say: \"We believe in it. It's the truth from our Lord. We had committed ourselves before it came.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is recited to them they say: \"We believe in it for it is the Truth from our Lord. Indeed we were already Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is recited to them, they say, \"We believe in it. It is the Truth from our Lord. We were Muslims before it was revealed\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when these verses are recited to them, they say, “We accept faith in it – indeed it is the Truth from our Lord – and indeed we had surrendered even before this.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is recited to them, they say: \"We believe in it. Verily, it is the truth from our Lord. Indeed even before it we have been from Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is recited to them they say: We believe in it surely it is the truth from our Lord; surely we were submitters before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, when it is recited to them, they say, 'We believe in it; surely it is the truth from our Lord. Indeed, even before' it we had surrendered.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is recited unto them, they say: We believe in it. Lo! it is the Truth from our Lord. Lo! even before it we were of those who surrender (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, when it is recited to them, they say, \"We believe in it. Indeed it is the truth from our Lord. Even before it came, we had submitted ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is rehearsed unto them they say: we believe therein: verily it is truth from our Lord: verily we have been even before it of those who submit themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when it is recited to them, they say, ‘We believe in it. It is indeed the truth from our Lord. Indeed we were Muslims [even] before it [came].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is recited to them, they say: \"We believe therein, for it is the Truth from our Lord: indeed we have been Muslims (bowing to Allah's Will) from before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is recited to them, they say: \"We believe in it. Verily, it is the truth from our Lord. Indeed even before it we have been from those who submit themselves to Allah in Islam as Muslims (like 'Abdullah bin Salam and Salman Al-Farisi, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is recited to them, they say: 'We believe in it, because it is the truth from Our Lord. We surrendered ourselves before it came.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is recited to them, they say, “We have believed in it; it is the truth from our Lord; we were Muslims prior to it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is recited to them, they say, \"We have believed in it; indeed, it is the truth from our Lord. Indeed we were, [even] before it, Muslims [submitting to Allah].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:53] And, when it is recited to them, the Qur’ān, they say, ‘We believe in it. It is indeed the Truth from our Lord. Lo! [even] before it we had submitted’, we affirmed God’s Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is recited unto them) and when the Qur'an is recited to them expositing the attributes and description of Muhammad (pbuh) (they say: We believe in it) we believe in Muhammad (pbuh) and in the Qur'an. (Lo! it is the Truth from our Lord. Lo! even before it) before the recitation of the Qur'an to us (we were of those who surrender (unto Him)) we were of those who believe in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا يُتْلَىٰ } معناهُ يُقرأْ عَلَيهِم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when the verses are recited to him, he listens to them attentively.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم يؤمنون به قبل بعثته صلى الله عليه وسلم ونزول القرآن لمدة متطاولة { وَ } وبعد نزول القرآن { إِذَا يُتْلَىٰ عَلَيْهِمْ قَالُوۤاْ } مسلمين مصدقين: { آمَنَّا بِهِ إِنَّهُ ٱلْحَقُّ } المطابق للواقع\n النازل { مِن رَّبِّنَآ إنَّا كُنَّا مِن قَبْلِهِ } أي: من قبل نزوله { مُسْلِمِينَ } [القصص: 53] منقادين لما فيه\n مصديقن له\n مؤمنين بما أنزل إليه\n إذ الإيمان به من جملة المعتقدات المثبتة في كتابنا\n فالآن لمَ لمْ نؤمن مع أنَّا وجدناه مطابقاً لما علمناه في كتابنا\n وعلى الوجه الذي تلوناه فيه؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّا كنا من قبله } من قبل القرآن\n أو: من قبل محمد صلى الله عليه وسلم\n { مسلمين } كائنين على دين الإسلام\n مؤمنين بمحمد صلى الله عليه وسلم\n فقوله { إِنه }: تعليل للإيمان به لأن كَوْنَهُ حقاً من عند الله حقيق بأن يُؤْمَنَ به\n وقوله: { إِنا }: بيان لقوله: { آمنا } لأنه يحتمل أن يكون إيماناً قريب العهد أو بعيده\n فأخبروه بأن إيمانهم به متقادم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:252",
      "similarity": 0.6567130837711119
    },
    {
      "verse": "3:108",
      "similarity": 0.5486297944586551
    },
    {
      "verse": "37:3",
      "similarity": 0.538565286725562
    },
    {
      "verse": "23:105",
      "similarity": 0.5260544596556798
    },
    {
      "verse": "3:58",
      "similarity": 0.5080764170309942
    }
  ]
}