{
  "chapter": "القصص",
  "text": "واذا سمعوا۟ اللغو اعرضوا۟ عنه وقالوا۟ لنا اعملنا ولكم اعملكم سلم عليكم لا نبتغى الجهلين",
  "translations": [
    {
      "translation": "When they hear worthless talk they turn away from it and say, 'We have our actions and you have your actions. Peace be upon you. We do not desire the company of the ignorant.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear idle talk they turn aside and say: \"To us our actions, to you yours. Peace on you; we do not look for the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear any vain talk, they turn away from it, saying: \"We have our deeds and you have your deeds. Peace be to you. We do not desire to act like the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear impious words, they ignore them, saying, \"We shall be responsible for our deeds and you will be responsible for yours. Peace be with you. We do not want to become ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear indecent speech, they ignore it and say, “For us are our deeds and for you are your deeds; peace be to you (good bye); we are not interested in the ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear evil vain talk, they withdraw from it and say: \"To us our deeds, and to you your deeds. Peace be to you. We seek not (the way of) the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear idle talk they turn aside from it and say: We shall have our deeds and you shall have your deeds; peace be on you, we do not desire the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear idle talk, they turn away from it and say, 'We have our deeds, and you your deeds. Peace be upon your We desire not the ignorant.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vanity they withdraw from it and say: Unto us our works and unto you your works. Peace be unto you! We desire not the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear vain talk, they turn away from it and say, \"We have our actions and you have yours. We wish you peace. We will have nothing to do with the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vain discourse they withdraw therefrom and say: unto US our works, and unto you your works; peace be unto you; we seek not the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear vain talk, they avoid it and say, ‘Our deeds belong to us, and your deeds belong to you. Peace be to you. We do not court the ignorant.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vain talk, they turn away therefrom and say: \"To us our deeds, and to you yours; peace be to you: we seek not the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear Al-Laghw (dirty, false, evil vain talk), they withdraw from it and say: \"To us our deeds, and to you your deeds. Peace be to you. We seek not the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and because when they hear idle talk they turn away from it and say: 'We have our deeds, and you have your deeds. Peace be upon you. We do not desire the ignorant'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear vain talk, they avoid it, and say, “We have our deeds, and you have your deeds; peace be upon you; we do not desire the ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear ill speech, they turn away from it and say, \"For us are our deeds, and for you are your deeds. Peace will be upon you; we seek not the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:55] And when they hear vanity, vile words and hurtful intent from the disbelievers, they disregard it and say, ‘To us [belong] our deeds and to you [belong] your deeds. Peace to you — a parting truce (salām mutāraka), in other words you are secure from any abuse or the like on our part. We do not desire [friendship with] the ignorant’, we do not seek companionship with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they hear vanity) falsehood, i.e. being vilified by the disbelievers (they withdraw from it) in an honourable way (and say) kindly: (Unto us our works) the worship of Allah and the religion of Islam (and unto you your works) upon you is the onus of your works: the worship of idols, the religion of the devil and the association of partners with Allah. (Peace be unto you!) May Allah guide you! (We desire not the ignorant) we do not seek the religion of those who associate partners with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا سَمِعُواْ ٱللَّغْوَ أَعْرَضُواْ عَنْهُ } معناه سَمِعُوا فحشاءَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذا سمعوا } لغواً لفضول المانع من القبول لم يلحوا وأعرضوا لكونهم أولياء موحدين لا أنبياء { سلام عليكم } سلّمكم الله من الآفات المانعة عن قبول الحق { لا نبتغي } صحبة { الجاهلين } المفقودين بالسفاهة والجهل المركّب، فإنهم لا ينتفعون بصحبتنا ولا يقبلون هدايتنا",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال تحفظهم، وصيانتهم نفوسهم عن نواهينا { إِذَا سَمِعُواْ ٱللَّغْوَ } أي: الكلام الخالي عن المصلحة الدينية { أَعْرَضُواْ عَنْهُ } اتقاءً وتحرزاً عن وصمة المداهنة والمراضاة بما لا يرضى منه سبحانه { وَقَالُواْ } من سلامة نفوسهم، وكمال علمهم للمرتكبين بعدما لم يقدروا على نهيهم: { لَنَآ } جزاء { أَعْمَالُنَا } التي اقترفناها بسعينا واجتهادنا { وَلَكُمْ } جزاء { أَعْمَالُكُمْ } التي أنتم عليها مصرين، وقالوا لهم حين توديعهم والذب عنهم: { سَلاَمٌ عَلَيْكُمْ } أي: سلمكم الله العفو الرحيم عن عوائد ما كنتم عليه ووفقكم على التوبة والإنابة، وما لنا معكم مطالبة ومجادلة سوى إنَّا { لاَ نَبْتَغِي } ولا نطلب مصاحبة { ٱلْجَاهِلِينَ } [القصص: 55] بسوء عواقب الخصائل الغير المرضية عند الله وعند خالص عباده\n\n\n\n\n \" ثمَّ لمَّ أحتضر أبو طالب، ودنا أن يخرج من الدنيا جاءه رسول الله صلى الله عليه وسلم مهتماً بإيمانه وتوحيده، فقال له: \" قل يا عمِّ مرة: لا إله إلا الله، أحاج بها لك عند ربي، وأخرجك بها عن زمرة المشركين \" قال: يا ابن أخي، والله إني علمت إنك لصادق في جميع ما جئت به، لكن أكره أن يقال: جزع أبو طالب عند الموت \" \n\nأي: ضعف وجبن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:3",
      "similarity": 0.7392795681775107
    },
    {
      "verse": "88:11",
      "similarity": 0.6954883815914602
    },
    {
      "verse": "78:35",
      "similarity": 0.6870196105541125
    },
    {
      "verse": "56:25",
      "similarity": 0.642201956343681
    },
    {
      "verse": "41:26",
      "similarity": 0.5754670613510013
    }
  ]
}