{
  "chapter": "القصص",
  "text": "فان لم يستجيبوا۟ لك فاعلم انما يتبعون اهواءهم ومن اضل ممن اتبع هوىه بغير هدى من الله ان الله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "If they do not respond to you then know that they are merely following their whims and desires. And who could be further astray than someone who follows his whims and desires without any guidance from Allah? Allah does not guide the people of the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, if they cannot give you an answer, know that they are only following their lusts. And who can be farther astray than he who follows his lust without any guidance from God? And certainly God does not guide an unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not hearken to this, know well that they only follow their lusts and who is in greater error than he who follows his lusts without any guidance from Allah? Allah does not guide those given to wrong-doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they cannot meet such a challenge, know that they are only following their (evil) desires. Who strays more than one who follows his desires without guidance from God? God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they do not accept your challenge, then know that they only follow their desires; and who is more astray than one who follows his desires away from the guidance of Allah? Indeed Allah does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they answer you not, then know that they only follow their own lusts. And who is more astray than one who follows his own lusts, without guidance from Allah Verily, Allah guides not the people who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not answer you, then know that they only follow their low desires; and who is more erring than he who follows his low desires without any guidance from Allah? Surely Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they do not answer thee, know that they are only following their caprices; and who is further astray than he who follows his caprice without guidance from God? Surely God guides not the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they answer thee not, then know that what they follow is their lusts. And who goeth farther astray than he who followeth his lust without guidance from Allah. Lo! Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they do not respond to you, then know that they follow only their own desires. Who could be more astray than he who follows his own likes and dislikes with no guidance from God? God does not guide the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they answer thee not, know thou that they only follow their own desires; and who is farther astray than he who followeth his desire without guidance from Allah? Verily Allah guideth not a wrong- doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they do not respond to you[r] [summons], know that they only follow their desires, and who is more astray than him who follows his desires without any guidance from Allah? Indeed Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they hearken not to thee, know that they only follow their own lusts: and who is more astray than one who follow his own lusts, devoid of guidance from Allah? for Allah guides not people given to wrong-doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they answer you not (i.e. do not believe in your doctrine of Islamic Monotheism, nor follow you), then know that they only follow their own lusts. And who is more astray than one who follows his own lusts, without guidance from Allah? Verily! Allah guides not the people who are Zalimun (wrong-doers, disobedient to Allah, and polytheists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they do not answer you, know that they are only following their desires. And who is further astray than he who is led by his desires without guidance fromAllah! Allah does not guide the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they fail to respond to you, know that they follow their fancies. And who is more lost than him who follows his fancy without guidance from God? God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allah? Indeed, Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:50] Then if they do not respond to you, regarding your invitation [to them] to bring a Scripture, know that they are only following their desires, in [persisting in] their disbelief. And who is more astray than he who follows his desire without any guidance from God?, in other words, there is no one more astray than such [a person]. Truly God does not guide the evildoing, the disbelieving, folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they could not bring a Scripture, Allah said: (And if they answer thee not) if the wrong-doers do not produce that which you have asked them, (then know that what they follow is their lusts) through disbelief, idolatry and idol worship. (And who goeth farther astray) from the Truth and guidance (than he who followeth his lust) through disbelief, idolatry, and idol worship (without guidance from Allah) without proof or exposition from Allah. (Lo! Allah guideth not) to His religion (wrong-doing folk) the idolaters: Abu Jahl and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن } عجزوا عن الإتيان\n و { لَّمْ يَسْتَجِيبُواْ لَكَ } ما طلبت منهم { فَٱعْلَمْ } يا أكمل الرسل { أَنَّمَا يَتَّبِعُونَ أَهْوَآءَهُمْ } أي: إنهمه إنما يتبعون أهواءهم الفاسدة\n وآراءهم الباطلة بلا متابعةٍ منهم إلى ملةٍ من الملل السالفة\n وإلى دين الأديان السابقة { وَمَنْ أَضَلُّ } طريقاً\n وأشد غياً\n وأسوأ حالاً ومآلاً { مِمَّنِ ٱتَّبَعَ هَوَاهُ } حال كونه { بِغَيْرِ هُدًى } أي: بتوفيقٍ وإرشادٍ { مِّنَ ٱللَّهِ } الميسر لأمور عباده \n وكيف يوفقهم الحق ويهديهم؟ { إِنَّ ٱللَّهَ } الحكيم المتقن في أفعاله { لاَ يَهْدِي } إلى الطريق المستبين { ٱلْقَوْمَ ٱلظَّالِمِينَ } [القصص: 50] الخارجين عن مقتضى أوامره ونواهيه\n إذ هم منهمكون في بحر الغفلة والضلالة لا يُرجى نجاتهم منها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nو { بغير هدى }: حال، أي: مخذولاً، مُخَلاً بينه وبين هواه، { إن الله لا يهدي القوم الظالمين } الذين ظلموا أنفسهم بالانهماك في اتباع الهوى والتقليد\n وبالله التوفيق\n الإشارة: لو احتجاج الناس على الله يوم القيامة، حين تصيبهم نقائص عيوبهم، ما بعث الله في كل زمان نذيراً طبيباً، فإذا ظهر وتوجه لتربية الناس، قالوا: لولا أُوتي مثل ما أُوتي فلان وفلان من كرامات المتقدمين، فيقال لهم: قد كان مَنْ قبلكم من الأولياء لهم كرامات فكذَّبوهم وأنكروا عليهم ورموهم بالسحر والتبدع وغير ذلك وبقوا مع هوى أنفسهم\n ومن أضل ممن اتبع هواه بغير هدى من الله، أي: بغير تمسك بمن يهديه إلى حضرة الله، إن الله لا يهدي القوم الظالمين إلى معرفته الخاصة\n ثم ذكر حكمة تفريق القرآن، رداً على من قال: { لولا أوتي مثل ما أوتي موسى } من إنزاله جملة، فقال: { قُلْ فَأْتُواْ بِكِتَابٍ مِّنْ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:29",
      "similarity": 0.7051152880614855
    },
    {
      "verse": "6:56",
      "similarity": 0.5311772685989362
    },
    {
      "verse": "2:145",
      "similarity": 0.4897592113191813
    },
    {
      "verse": "10:89",
      "similarity": 0.48366168322199354
    },
    {
      "verse": "11:14",
      "similarity": 0.45848898076858546
    }
  ]
}