{
  "chapter": "القصص",
  "text": "انك لا تهدى من احببت ولكن الله يهدى من يشاء وهو اعلم بالمهتدين",
  "translations": [
    {
      "translation": "You cannot guide those you would like to but Allah guides those He wills. He has best knowledge of the guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide any one you like: God guides whosoever He please. He knows best who will come to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), you cannot grant guidance to whom you please. It is Allah Who guides those whom He will. He knows best who are amenable to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you cannot guide whomever you love, but God guides whomever He wants and knows best those who seek guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is not such that you can guide whomever you love, but Allah guides whomever He wills; and He well knows the people upon guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you guide not whom you like, but Allah guides whom He wills. And He knows best those who are the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely you cannot guide whom you love, but Allah guides whom He pleases, and He knows best the followers of the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou guidest not whom thou likest, but God guides whom He wills, and knows very well those that are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thou (O Muhammad) guidest not whom thou lovest, but Allah guideth whom He will. And He is Best Aware of those who walk aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide whoever you please: it is God who guides whom He will. He best knows those who would accept guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thou shalt not guide whomsoever thou lovest, but Allah shall guide whomsoever He will. And He knoweth best who are the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide whomever you wish, but [it is] Allah [who] guides whomever He wishes, and He knows best those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is true thou wilt not be able to guide every one, whom thou lovest; but Allah guides those whom He will and He knows best those who receive guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! You (O Muhammad SAW) guide not whom you like, but Allah guides whom He wills. And He knows best those who are the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide whom you please; it is Allah who guides whom He will. He knows well those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide whom you love, but God guides whom He wills, and He knows best those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, [O Muhammad], you do not guide whom you like, but Allah guides whom He wills. And He is most knowing of the [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:56] The following was revealed regarding the Prophet’s longing for his uncle Abū Tālib to embrace faith: You cannot guide whom you like, to be guided, but [it is] God [Who] guides whomever He will, and He knows best those who will be guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! thou) Muhammad (guidest not) know not (whom thou lovest) i.e. whom you love to accept faith: i.e. Abu Talib, (but Allah guideth) He gives success and leads (whom He will) to His religion: Abu Bakr, 'Umar and their fellow believers. (And He is best aware of those who walk aright) to His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسبيل التوحيد كل { مَنْ أَحْبَبْتَ } وأردت إيمانه { وَلَـٰكِنَّ ٱللَّهَ } المطلع على استعدادات عباده { يَهْدِي } ويوفق على الإيمان والإطاعة بدين الإسلام { مَن يَشَآءُ } هدايته\n وأثبت سعادته وتوحيده في لوح قضائه { وَهُوَ أَعْلَمُ } بعلمه الحضوري { بِٱلْمُهْتَدِينَ } [القصص: 56] من عباده بعد أن بلغت لهم ما أمرك الحق بتبليغه\n وما عليك إلا البلاغ\n والهداية والرشاد إنما هو بإرادته سبحانه واختياره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { إنك } يا محمد { لا تهدي من أحببتَ } ، أي: لا تقدر أن تُدخل في الإسلام كل من أحببت أن يدخل من قومك وغيرهم، يعني: أن خاصية الهداية خاصة بالربوبية، وخاصية الربوبية لا تكون لمخلوق، ولو كان أكمل الخلق. { ولكنَّ الله يهدي من يشاء } يخلق الهداية في قلب من يشاء، { وهو أعلم بالمهتدين } بمن يختار هدايته ويقبلها. قال الزجاج: اجمع المفسرون أنها نزلت في أبي طالب، وذلك أنه قال عند موته: يا معشر بني هاشم صدقوا محمداً تُفلحوا، فقال صلى الله عليه وسلم:\n \" يا عَمّ تأمُرُهُم بالنَّصِيحة لأنفسهم وتَدعُها لنفسك! \" \nفقال: ما تريد يا ابن أخي؟ فقال:\n \" أُريدُ منك أن تقُول: لا إله إلا الله، أشْهَدُ لك بها عِنْدَ اللهِ \" \nفقال: يا ابن أخي أنا قد علمت أنك صادق، ولكن أكره أن يقال جزع عند الموت. هـ. وفي رواية قال: لولا أن تُعيرني نساء قريش، ويقلن: إنه حملني على ذلك الجزع، لأقررتُ بها عينك. وفي لفظ آخر عند البخاري: قال له:\n \" يا عم، قُل: لا إله إلا الله، أُحاجُّ لك بها عند الله \" \nفقال أبو جهل وعبد الله بن أمية: يا أبا طالب، أترغب عن ملة عبد المطلب؟ فقال: بل على ملّة عبد المطلب، فنزلت الآية. وفيها دليل على المعتزلة لأنهم يقولون: الهدى هو البيان، وقد هدى الله الناس أجمع، ولكنهم لم يهتدوا بسوء اختيارهم، فدلت الآية على أن وراء البيان ما يسمى هداية وهو خلق الاهتداء، وإعطاء التوفيق والقدرة على الاهتداء. وبالله التوفيق. الإشارة: الآية ليست خاصة بالنبي صلى الله عليه وسلم، بل هي عامة لكل من يريد الهداية لأحد من خاصته، كتب شيخ أشياخنا، سيدي \" أحمد بن عبد الله \" ، إلى شيخه، سيدي \" أحمد بن سعيد الهبري \" يشكو له ابنه حيث لم ير منه ما تقر به عينه، فكتب إليه: أخبرني: ما الذي بَنَيْتَ فيه؟ دع الدار لبانيها، إن شاء هدمها وإن شاء بناها. هـ. وفي اللباب - بعد كلام -: قد رضي الله على أقوام في الأزل، فاستعلمهم في أسباب الرضا من غير سبب، وسَخِطَ على أقوام في الأزل، فاستعملهم في أسباب السَّخَطِ بلا سبب.\n[الأنعام: 125] الآية. وهذه الآية تخاطب رسول الله صلى الله عليه وسلم بقولها: { إنك لا تَهْدي من أحببت } ، والحكم عام في كل أحد، وقد خص رسول الله صلى الله عليه وسلم بأتم الفضائل وأعلى الوسائل، حتى لم يُسْبَقْ لفضيلة، ولم يَحْتَجْ لوسيلة، وليس في ذلك نظر، بل سابقة السعادة أيدته، والخصوصية قرَّبته، ولو كان له في التقدير نظر ما مُنع من الشفاعة في عمه أبي طالب، ومن الاستغفار لأبيه. ولو كانت الهداية بيد آدم لهدى قابيل، ولو كانت بيد نوح لهدى ولده كنعان، أو بيد إبراهيم لهدى أباه آزر، أو بيد محمد صلى الله عليه وسلم لأنقذ عمه أبا طالب، جذبت العنايةُ سلمان من فارس، وصاحت على بلال من الحبشة، وأبو طالب على الباب ممنوع من الدخول. سبحان من أعطى ومنع، وضر ونفع. هـ. ولما دعى صلى الله عليه وسلم قومه إلى الإسلام، تعلّلوا بعلل واهية، كما قال تعالى: { وَقَالُوۤاْ إِن نَّتَّبِعِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:107",
      "similarity": 0.4860518771272315
    },
    {
      "verse": "10:44",
      "similarity": 0.4687251162204417
    },
    {
      "verse": "3:32",
      "similarity": 0.4439162531612406
    },
    {
      "verse": "100:8",
      "similarity": 0.4320815515421958
    },
    {
      "verse": "2:190",
      "similarity": 0.39631202297339113
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028056.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028056.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:56.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}