{
  "chapter": "القصص",
  "text": "ونمكن لهم فى الارض ونرى فرعون وهمن وجنودهما منهم ما كانوا۟ يحذرون",
  "translations": [
    {
      "translation": "And establish them in the country; and to make the Pharaoh, Haman and their hordes beware of what they feared from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to grant them power in the land, and make Pharaoh and Haman and their hosts see what they had feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "give them power in the land and make the Pharaoh, Haman (his Minister), and their armies to experience from their victims what they feared most.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to give them control in the land, and to show Firaun and Haman and their armies what they fear from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the land, and We let Fir`awn and Haman and their armies receive from them that which they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to grant them power in the land, and to make Firon and Haman and their hosts see from them what they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to establish them in the land, and to show Pharaoh and Ha man, and their hosts, what they were dreading from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the earth, and to show Pharaoh and Haman and their hosts that which they feared from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to give them power in the land; and to show Pharaoh and Haman and their hosts that very thing which they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We should establish them in the earth, and We should let Fir'awn and Haman and their hostee from them that which they dreaded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to establish them in the land, and to show Pharaoh and Haman and their hosts from them that of which they were apprehensive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To establish a firm place for them in the land, and to show Pharaoh, Haman, and their hosts, at their hands, the very things against which they were taking precautions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the land, and We let Fir'aun (Pharaoh) and Haman and their hosts receive from them that which they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to establish them in the land; and to show Pharaoh and Haman, and their armies, the very thing they dreaded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the land; and to show Pharaoh, Hamaan, and their troops, the very thing they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish them in the land and show Pharaoh and [his minister] Haman and their soldiers through them that which they had feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:6] and to establish them in the land, the land of Egypt and Syria, and to show Pharaoh and Hāmān and their hosts (a variant reading has wa-yarā Fir‘awnu wa-Hāmānu wa-junūduhumā, ‘so that Pharaoh and Hāmān and their hosts might see’, with all three [nouns] in the nominative) from them that of which they were apprehensive, [that which] they feared of the new-born [Israelite] who would bring about the end of their kingdom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And to establish them in the earth) and give them sovereignty over the land of Egypt, (and to show 436 Pharaoh and Haman and their hosts that which they feared) the loss if their sovereignty (from them) from Moses and the Children of Israel.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَنُمَكِّنَ لَهُمْ } أي: نقررهم ونوطنهم { فِي ٱلأَرْضِ } أي: أرض مصر والشام بعدما كانوا مضطرين متزلزلين { وَنُرِيَ } بمقتضى قهرنا وجلالنا { فِرْعَوْنَ } المفرط في العتو والعناد { وَ } ظهيره { هَامَانَ } المفتخر على أهل الزمان بنيابته ووزارته { وَجُنُودَهُمَا مِنْهُمْ } أي: بني إسرائيل { مَّا كَانُواْ يَحْذَرُونَ } [القصص: 6] منه، وهو ظهور مولود منهم يذهب به دولة القبط، وصار سبباً لهلاكهم بالمرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}