{
  "chapter": "القصص",
  "text": "وربك يخلق ما يشاء ويختار ما كان لهم الخيرة سبحن الله وتعلى عما يشركون",
  "translations": [
    {
      "translation": "Your Lord creates and chooses whatever He wills. The choice is not theirs. Glory be to Allah! He is exalted above anything they associate with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates what He wills and chooses. The good is not for them to choose. Too holy and high is God for what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates what He will and chooses (for His tasks) whomsoever He will. It is not for them to make the choice. Glory be to Allah. He is exalted far above their associating others in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates and chooses (to grant mercy) to whomever He wants. (In matters of guidance) they (unbelievers) do not have the choice to choose whatever they want. God is too exalted to be considered equal to anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord creates whatever He wills, and chooses; they do not have any power to choose; Purity and Supremacy are to Allah above their ascribing partners (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord creates whatsoever He wills and chooses, no choice have they. Glorified is Allah, and exalted above all that they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord creates and chooses whom He pleases; to choose is not theirs; glory be to Allah, and exalted be He above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord creates whatsoever He will and He chooses; they have not the choice. Glory be to God! High be He exalted above that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord bringeth to pass what He willeth and chooseth. They have never any choice. Glorified be Allah and Exalted above all that they associate (with Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates whatsoever He wills and chooses whomsoever He pleases. They have no choice. Praise be to God -- exalted is He over anything they may associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy lord createth whatsoever He listeth and chooseth; no Choice is to be far them. Hallowed be Allah and exalted above that which they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates whatever He wishes and chooses: they have no choice. Immaculate is Allah and exalted above [having] any partners that they ascribe [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord does create and choose as He pleases: no choice have they (in the matter): Glory to Allah! and far is He above the partners they ascribe (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord creates whatsoever He wills and chooses, no choice have they (in any matter). Glorified be Allah, and exalted above all that they associate as partners (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates whosoever He will and He chooses the choice was not theirs (the unbelievers). Exalted is Allah, above that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord creates whatever He wills, and He chooses. The choice is not theirs. Glory be to God, and exalted be He above the associations they make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord creates what He wills and chooses; not for them was the choice. Exalted is Allah and high above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:68] And your Lord creates whatever He will and chooses, whatever He will. They, the idolaters, do not have the choice, the right to choose anything. Glory be to God and exalted be He above what they associate, [above] their idolatry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thy Lord bringeth to pass what He willeth) as He wills (and chooseth) from His created beings those upon whom He bestows prophethood, i.e. Muhammad (pbuh). (They) the people of Mecca (have never any choice. Glorified be Allah) Allah sanctifies Himself (and exalted) and exonerates Himself (above all that they associate (with Him)) of idols!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَرَبُّكَ } يا أكمل الرسل { مَا يَشَآءُ } ويُظهر بمقتضى تجلياته الحبية الجمالية جميع { يَخْلُقُ } من المظاهر { وَيَخْتَارُ } منها ما يختار، فالكل مجبور تحت قدرته ومشيئته { مَا كَانَ } أي: ما صح وثبت { لَهُمُ ٱلْخِيَرَةُ } أي: التخير والاختيار؛ حتى يريدوا لأنفسهم ما هو الأصلح لهم، بل جميع شئونهم وأمورهم مفوضة إلى الله أولاً وبالذات، وهم مقهورون مجبورون تحت حكمه وقضائه، وكيف لا يكونوا مجبورين؛ إذ هم من عكوس أسمائه وظلال أوصافه، ما لهم وجود في أنفسهم، وتحقق في ذواتهم؟! { سُبْحَانَ ٱللَّهِ } المنزه عن المثل والشبيه { وَتَعَالَىٰ عَمَّا يُشْرِكُونَ } [القصص: 68] من الشريك والنظير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وربك يخلقُ ما يشاءُ } ، لا موجب عليه، ولا مانع له، وفيه دلالة على خلق الأفعال\n { ويختارُ } ما يشاء، لا اختيار لأحد مع اختياره\n قال البيضاوي: وظاهره: نفي الاختيار عنهم رأساً، والأمر كذلك عند التحقيق فإنَّ اختبار العبد مخلوق لله، منوط بدواعٍ لا اختيار لهم فيها، وقيل: المراد أنه ليس لأحد أن يختار عليه، فلذلك خلا عن العاطف، يعني قوله: { ما كان\n\n } إلخ، ويؤيده: ما روي أنه نزل في قولهم:\n\n[الزخرف: 31] هـ\n { ما كان لهم الخِيَرةُ } أي: ليس لهم أن يختاروا مع الله شيئاً ما، وله الخيرة عليهم\n والخيرة: من التخير، تستعمل مصدراً بمعنى التخير، وبمعنى المتخيّر، ومنه: محمد خيرة الله من خلقه، ولم يدخل العاطف في { ما كان لهم الخيرة } لأنه مقرر لِمَا قبله، وقيل: \" ما \": موصولة، مفعول بيختار، والراجع إليه: محذوف، أي: ويختار الذي كان لهم من الخيرة والصلاح\n هـ\n وبحث فيه النسفي بأن فيه ميلاً إلى الاعتزال، ويجاب: بأن المعتزلة يقولون ذلك على سبيل الإيجاب، ونحن نقوله على سبيل التفضل والإحسان\n { سبحان الله } ، أي: تنزيهاً له عن أن ينازعه أحد، أو يزاحم اختيارَهُ اختيارٌ\n { وتعالى عما يشركون } ، أي: تعاظم عن إشراكهم، أو: عن مشاركة ما يُشركون به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:1",
      "similarity": 0.6703425308586376
    },
    {
      "verse": "17:43",
      "similarity": 0.6630444544941168
    },
    {
      "verse": "16:3",
      "similarity": 0.6519889454127201
    },
    {
      "verse": "16:1",
      "similarity": 0.6184457115012675
    },
    {
      "verse": "30:40",
      "similarity": 0.6085847867610126
    }
  ]
}