{
  "chapter": "القصص",
  "text": "افمن وعدنه وعدا حسنا فهو لقيه كمن متعنه متع الحيوة الدنيا ثم هو يوم القيمة من المحضرين",
  "translations": [
    {
      "translation": "Is someone whom We have promised good and who then obtains it, the same as someone whom We have given enjoyment in the life of the dunya and who then, on the Day of Rising, is one of those brought to punishment?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can one who was given a better promise, which he will find come true, be like him who was given a little enjoyment of this life, but who will afterwards be brought (to judgement) on the Day of Resurrection?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, he to whom We have promised a good which he is going to obtain - can he be like him whom We have given the good things of this life, but who will be brought up for punishment on the Day of Judgement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the case of those to whom We have promised good things - which they will certainly receive in the life to come - equal to the case of those to whom We have granted the means of enjoyment in the worldly life and who will certainly be questioned about them in the life to come?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is he whom We have given a good promise – he will therefore get it – equal to him whom We gave the usage of the life of this world to enjoy, and who will then be brought captive on the Day of Resurrection?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whom We have promised an excellent promise -- which he will find true -- like him whom We have made to enjoy the luxuries of the life of the world, then on the Day of Resurrection, he will be among those brought up\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he to whom We have promised a goodly promise which he shall meet with like him whom We have provided with the provisions of this world's life, then on the day of resurrection he shall be of those who are brought up?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not understand? What, is he to whom We have promised a fair promise, and he receives it, like him to whom We have given the enjoyment of the present life, then he on the Resurrection Day shall be of those that are arraigned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whom We have promised a fair promise which he will find (true) like him whom We suffer to enjoy awhile the comfort of the life of the world, then on the Day of Resurrection he will be of those arraigned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can someone to whom We have made a gracious promise and who will see it fulfilled, be compared to someone We have allowed to enjoy a worldly life, awhile, and who will be brought up [before God] for his accounting on the Day of Resurrection?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he, then, whom We have promised an excellent promise which he is going to meet, like unto him whom We have suffered to enjoy awhile the enjoyment of the life of the world, then on the Day of Resurrection he shall be of those brought up!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he to whom We have given a good promise, which he will receive, like him whom We have provided the wares of the life of this world, but who will be arraigned on the Day of Resurrection?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are (these two) alike?- one to whom We have made a goodly promise, and who is going to reach its (fulfilment), and one to whom We have given the good things of this life, but who, on the Day of Judgment, is to be among those brought up (for punishment)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whom We have promised an excellent promise (Paradise), which he will find true, like him whom We have made to enjoy the luxuries of the life of (this) world, then on the Day of Resurrection, he will be among those brought up (to be punished in the Hell-fire)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he to whom We promised a fine promise and receives it, like he who has been given the enjoyment of this present life, then on the Day of Resurrection shall be among those that are arraigned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can someone to whom We have made a fine promise—which he will attain—be equal to someone to whom We have given enjoyments in this world, but who will be, on Resurrection Day, among the arraigned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is he whom We have promised a good promise which he will obtain like he for whom We provided enjoyment of worldly life [but] then he is, on the Day of Resurrection, among those presented [for punishment in Hell]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:61]   Is he to whom We have given a fair promise, which he will receive, which he will attain, and that [promise] is Paradise, like him to whom We have given the enjoyment of the life of this world, [enjoyment] which will disappear soon, then on the Day of Resurrection he will be of those arraigned?, before the Fire. The former is the believer, the latter the disbeliever: in other words the two are not equal.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he whom We have promised a fair promise) Paradise; the reference here is to Muhammad (pbuh) and 443 his Companions; it is also said that the reference is to 'Uthman Ibn 'Affan (which he will find (true)) in the Hereafter (like him whom We suffer to enjoy awhile the comfort of the life of the world) like him whom We gave wealth and servants in the life of the world; the reference here is to Abu Jahl, (then on the Day of Resurrection he will be of those arraigned) of those who are tormented in hell?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أن الكل من عندنا وتحت قدرتنا { فَمَن وَعَدْنَاهُ وَعْداً حَسَناً } أي: موعداً ذا حسن وكرامة\n وبهجة وبهاء { فَهُوَ لاَقِيهِ } أي: مدركة وموصلة إليه\n إذ لا خلف لوعدنا\n أتظنون وتعتقدون أيها الجاهلون أن منزلة هذا السعيد الموفق على السعادة من عندنا { كَمَن مَّتَّعْنَاهُ } في هذه النشأة { مَتَاعَ ٱلْحَيَاةِ ٱلدُّنْيَا } مكدرة بأنواع الكدورات\n مشوبة بالآلام والحسرات\n منغمسة بالخبائث والقاذورات { ثُمَّ هُوَ يَوْمَ ٱلْقِيَامَةِ } بعد انقراض النشأة الأولى { مِنَ ٱلْمُحْضَرِينَ } [القصص: 61] للحساب والجزاء على ما تمتعوا في النشأة الأولى؟!\n\n\nثمَّ قال سبحانه: { وَ } اذكر يا أكمل الرسل لمن أشرك بالله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قرر ذلك بقوله: { أفمن وعدناه وعداً حسنا } ، وهو الجنة إذ لا شيء أحسن منها، حيث اشتملت على النظر لوجه الله العظيم، ولأنها دائمة، ولذا سميت الحسنى، { فهو }: أي: الوعد الحسن { لاقيه } ومدركه، لا محالة، لامتناع الخلف في وعده تعالى، { كمن متعناه متاع الحياة الدنيا } الذي هو مشوب بالكدر والمتاعب،، مستعْقب بالفناء والانقطاع، { ثم هو يوم القيامة من المحضَرين } للحساب والعقاب، أو: من الذين أحضروا النار\n والآية نزلت في المؤمن والكافر، أو: في رسول الله صلى الله عليه وسلم وأبي جهل - لعنه الله -، ومعنى الفاء الأولى: أنه لَمَّا ذكر التفاوت بين متاع الحياة الدنيا وما عند الله عقّبه بقوله: { أفمن وعدناه } أي: أبعد هذا التفاوت الجلي نُسَوي بين أبناء الدنيا وأبناء الآخرة؟ والفاء الثانية للتسبيب، لأنه لقاء الموعود مسبب عن الوعد\n و \" ثم \": لتراخي حال الإحضار عن حال التمتع\n ومن قرأ: \" ثم هْو \" بالسكون، شبه المنفصل بالمتصل، كما قيل في عَضد - بسكون الضاد -",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:127",
      "similarity": 0.5419490293333518
    },
    {
      "verse": "81:14",
      "similarity": 0.5343315291085106
    },
    {
      "verse": "30:16",
      "similarity": 0.5062779053976924
    },
    {
      "verse": "37:57",
      "similarity": 0.4826078640722557
    },
    {
      "verse": "36:75",
      "similarity": 0.40350019368193996
    }
  ]
}