{
  "chapter": "القصص",
  "text": "ويوم يناديهم فيقول اين شركاءى الذين كنتم تزعمون",
  "translations": [
    {
      "translation": "On the Day when He summons them He will say, 'Where are they, those you claimed were My associates?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day God will call them and ask: \"Where are they you imagined were My compeers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Let them not forget) that the Day when Allah will call unto them, and say: \"Where are those whom you imagined to be My associates?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He will ask (the latter group), \"Where are those whom you had considered equal to Me?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He will call to them – He will therefore proclaim, “Where are those partners of Mine, whom you had assumed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when He will call to them and say: \"Where are My (so-called) partners whom you used to assert\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He will call them and say: Where are those whom you deemed to be My associates?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when He shall call to them, and He shall say, 'Where now are My associates whom you were asserting?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He will call unto them and say: Where are My partners whom ye imagined?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day He will call to them, and say, \"Where are those whom you claimed to be My partners?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day whereon He shall call unto them and say: where are My associates whom ye were wont to assert?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will call out to them and ask, ‘Where are My ‘partners’ that you used to claim?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day (Allah) will call to them, and say \"Where are my 'partners'?- whom ye imagined (to be such)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when He will call to them, and say: \"Where are My (so-called) partners whom you used to assert?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day He will call to them, saying: 'Where are those whom you alleged to be My associates'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He will call to them, and say, “Where are My associates whom you used to claim?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [warn of] the Day He will call them and say, \"Where are My 'partners' which you used to claim?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:62] And, mention, the day when He, God, will call to them and say, ‘Where [then] are My partners, those whom you used to claim?’, were partners of Mine.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the Day) which is the Day of Judgement (when He) i.e. Allah (will call unto them) Abu Jahl and his host (and say) and Allah, glorified is He, says: (Where are My partners whom you imagined) whom you worshipped and claimed they were my partners?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَ } اذكر يا أكمل الرسل لمن أشرك بالله، وأثبت له شريكاً في الوجود سواه { يَوْمَ يُنَادِيهِمْ } الله المتعزز برداء العظمة والكبرياء حين ظهر على مظاهره باسم القهار، المفني لأظلال السوى والأغيار مطلقاً { فَيَقُولُ } على مقتضى غيرته وجلاله مخاطباً لمن أشرك به شيئاً من عكوسه وأظلاله، مع أن الكل حنيئذٍ مطموس مقهور تحت حوله وقدرته: { أَيْنَ شُرَكَآئِيَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ } [القصص: 62] أيها المشركون شركائي، وتعبدونهم كعبادتي عدواناً وظلماً؟! ثمَّ أظهرهم الحق وأوجدهم؛ أي: التابعين والمتبوعين جميعاً بعدما قهرهم وعذبهم جميعاً؛ إظهاراً للقدرة الكاملة، وإلزاماً للحجة البالغة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } اذكر { يوم يُنادِيهم } يوم ينادي الله الكفارَ، نداء توبيخ، { فيقول أين شركائيَ } في زعمهم { الذين كنتم تزعمون } أنهم شركائي، فحذف المفعول لدلالة على الكلام عليه\n والله تعالى أعلم\n الإشارة: في الآية تحقير لشأن الدنيا الفانية، وتعظيم لشأن الآخرة الباقية\n وقد اتفق على هذا جميع الأنبياء والرسل والحكماء، قديماً وحديثاً، وقد تقدم آنفاً أنها لا تَزِن عند الله جناحَ بعوضة وفي حديث آخر:\n\n \" ما الدنيا في جانب الآخرة، إلا كما يُدخل أَحَدُكُمْ يده في البحر ثم يُخرجه، فانظر ماذا يعلق به \" \n\nبالمعنى: فنعيم الدنيا كله، بالنسبة إلى نعيم الجنان، كبلل الأصبع، الذي دخل في الماء ثم خرج\n\n\nمع أن نعيمها مكدر، ممزوج بالأهوال والأحزان والمتاعب\n وقد كتب علي بي أبي طالب إلى سلمان - رضي الله عنهما -: \" إن مثل الدنيا كمثل الحية، لينٌ مسها، قاتل سمها، فأعرض عنها، وعما يعجبك منها، لقلة ما يصحبك منها ودع عنك همومها لما تيقنت من فراقها، وكن أسرّ ما تكون منها، احذر ما تكون منها، فإن صاحبها، كلما اطمأن فيها إلى سرور أشخص منها إلى مكروه \"\n وعن عبد الله بن عمرو رضي الله عنه أنه قال: سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" إن هذه الدار دار الثوى، لا دار استواء، ومنزل ترح، لا منزل فرح، فمن عرفها لم يفرح لرخائها، ولم يحزن لشقائها - أي: لأنهما لا يدومان - ألا وإن الله خلق الدنيا دار بلوى، والآخرة دار عقبى، فجعل بلوى الدنيا لثواب الآخرة سبباً، وثواب الآخرة من بلوى الدنيا عوضاً، فيأخذ ليعطي، ويبتلي ليجزي، وأنها سريعة الثوى - أي: الهلاك - وشيكة الانقلاب، فاحذروا حلاوة رضاعها، لمرارة فطامها، واهجروا لذيذ عاجلها لكريه آجلها، ولا تسعوا في عمران دار قد قضى الله خرابها، ولا تواصلوها وقد أراد الله منكم اجتنابها، فتكونوا لسخطه متعرضين، ولعقوبته مستحقين \" \n\nهـ\n ذكره ابن وداعة الموصلي\n وذكر أيضاً عن ابن عباس رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" ما سكن حب الدنيا قلب عبد إلا إلتاط منها بثلاث: شغل لا ينفد عناؤه، وفقر لا يدرك غناه، وأمل لا ينال منتهاه، إن الدنيا والآخرة طالبتان ومطلوبتان، فطالب الآخرة تطلبه الدنيا، حتى يستكمل رزقه، وطالب الدنيا تطلبه الآخرة حتى يأخذ الموت بعنقه، ألا وإن السعيد من اختار باقية يدوم نعيمها على فانية لا ينفك عذابها وقدّم لِمَا يُقْدِمُ عليه مما هو الآن في يده، قبل أن يُخلفه لمن يسعد بإنفاقه، وقد شقي هو بجمعه واحتكاره \"\n \n\nثم ذكر مآل من اغتر فيها، قال: { قَالَ ٱلَّذِينَ حَقَّ عَلَيْهِمُ\n\n\n }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:74",
      "similarity": 1.0
    },
    {
      "verse": "6:22",
      "similarity": 0.8206482016688436
    },
    {
      "verse": "40:73",
      "similarity": 0.5749456921718161
    },
    {
      "verse": "68:40",
      "similarity": 0.5626841856247444
    },
    {
      "verse": "26:92",
      "similarity": 0.5264096760815392
    }
  ]
}