{
  "chapter": "القصص",
  "text": "وما اوتيتم من شىء فمتع الحيوة الدنيا وزينتها وما عند الله خير وابقى افلا تعقلون",
  "translations": [
    {
      "translation": "Anything you have been given is only the enjoyment of the life of this world and its finery. What is with Allah is better and longer lasting. So will you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever has been given you is the stuff this life is made of, and only its embellishment. What is with your Lord is better and abiding. Will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you have been given is a provision for the life of this world and its glitter. But that which is with Allah is better and more enduring. Do you not use your intellect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you (people) have been given are only the means for enjoyment and beauty of the worldly life, but the means of enjoyment (which you will receive from God) in the life to come will be better and everlasting. Will you then not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you have been given, is a usage in the life of this world and its adornment; and that which is with Allah is better and more lasting; so do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you have been given is an enjoyment of the life of the world and its adornment, and that which is with Allah is better and will remain forever. Have you then no sense\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever things you have been given are only a provision of this world's life and its adornment, and whatever is with Allah is better and more lasting; do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever thing you have been given is the enjoyment of the present life and its adornment; and what is with God is better and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever ye have been given is a comfort of the life of the world and an ornament thereof; and that which Allah hath is better and more lasting. Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you are given in this life is nothing but a temporary provision of this life and its glitter; what God has is better and more lasting. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever ye are vouchsafed is an enjoyment of the life of the world and an adornment thereof; and that which is with Allah is better and more lasting. Will ye not therefore reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever things you have been given are only the wares of the life of this world and its glitter, and what is with Allah is better and more lasting. Will you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (material) things which ye are given are but the conveniences of this life and the glitter thereof; but that which is with Allah is better and more enduring: will ye not then be wise?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you have been given is an enjoyment of the life of (this) world and its adornment, and that (Hereafter) which is with Allah is better and will remain forever. Have you then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The things you have been given, and its adornments, are but the enjoyment of this present life. What is with Allah is better and everlasting. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever thing you are given is but the material of this world, and its glitter. But what is with God is better, and longer lasting. Do you not comprehend?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever thing you [people] have been given - it is [only for] the enjoyment of worldly life and its adornment. And what is with Allah is better and more lasting; so will you not use reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:60] And whatever things you have been given are [only] the [short-lived] enjoyment of the life of this world and an ornament thereof, in other words, [things] which you enjoy and adorn yourselves with for the days of your lives, after which they perish; and what is with God, in other words, His reward, is better and more lasting. Will you not understand? (ta‘qilūna; or read ya‘qilūna, ‘will they [not] understand’) that what lasts is better than what perishes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whatsoever ye have been given) whatever you are given of wealth and servants, (is a comfort of the life of the world) is like the ornament of the life of the world: like pottery and glass (and an ornament thereof) and an embellishment, and the latter does not last forever; (and that which Allah hath) for Muhammad and his Companions in Paradise (is better and more lasting) than that which you have in the life of the world. (Have ye then no sense?) do you not possess sound thinking to realise that this worldly life is perishing while the Hereafter is lasting?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الحال أنهم { مَآ أُوتِيتُم مِّن شَيْءٍ } في هذه النشأة { فَمَتَاعُ ٱلْحَيَاةِ ٱلدُّنْيَا } الدنية التي هي على طرف التمام\n مشرفة على التقضي والانصرام { وَزِينَتُهَا } الزائلة الذاهبة بلا قرار ولا دوام { وَمَا عِندَ ٱللَّهِ } من المعارف الحقائق\n والمكاشفات والمشاهدات لأرباب المراتب العلية\n والمناصب السنية من المنقطعين نحو الحق بعد انخلاعهم عن لوازم هوياتهم البشرية الفائضة عن التلذذ باللذات الروحانية { خَيْرٌ } لا يتخلل بينهي شيء\n ولا يعرضه ضر { وَأَبْقَىٰ } إذ لا يلحقه انصرام ولا انقضاء\n ولا زوال ولا فناء { أَ } تستبدلون أيها الحمقى الأدنى الفاني بالأعلى الباقي\n وتختارون اللذة الجسمانية على اللذات الروحانية { فَلاَ تَعْقِلُونَ } [القصص: 60] ولا تستعملون عقولكم الموهوبة بمقتضاها\n ليتميز عندكم ما هو الأليق بحالكم\n والأولى بمآلكم؟!\n\n\n{ أَ } تسوون الأجل الباقي بالعاجل الزائد الفاني",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" ما \" شرطية\n وجملة: فمتاع\n\n\n إلخ: جوابه\n يقول الحق جل جلاله: { وما أُوتيتم من شيءٍ } من زهرة الدنيا { فمتاعُ الحياة الدنيا وزينتُها } أي: ايُّ شيء أحببتموه من أسباب الدنيا وملاذها فما هو إلا تمتع وزينة\n أياماً قلائل\n وهي مدة الحياة الفانية\n { وما عند الله } من النعيم الدائم في الدار الباقية ثواباً لأعمالكم { خير } من ذلك لأنه لذة خالصة في بهجة كاملة\n { وأبقى } لأنه دائم لا يفنى { أفلا تعقلون } أن الباقي خير من الفاني\n فتستبدلون الذي هو أدنى يا الذي هو خير؟\n وعن ابن عباس رضي الله عنه: إن الله خلق الدنيا\n وجعل أهلها ثلاثة أصناف المؤمن والمنافق والكافر\n فالمؤمن يتزود\n والمنافق يتربى\n والكافر يتمتع\n ثم قرأ هذه الآية\n وفي الحديث عنه صلى الله عليه وسلم:\n \" لو كانتِ الدنيا تَزِنُ عند الله جناحَ بعوضة لمى سَقَى الكافرَ منها شَرْبَةَ ماءٍ \" \nرواه الترمذي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:36",
      "similarity": 0.7367934329622438
    },
    {
      "verse": "87:17",
      "similarity": 0.540276562349983
    },
    {
      "verse": "11:86",
      "similarity": 0.48737019414453825
    },
    {
      "verse": "69:8",
      "similarity": 0.47430924428343163
    },
    {
      "verse": "74:28",
      "similarity": 0.4568575475102289
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:60.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:60.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}