{
  "chapter": "القصص",
  "text": "فاما من تاب وءامن وعمل صلحا فعسى ان يكون من المفلحين",
  "translations": [
    {
      "translation": "But as for those who make tawba and believe and act rightly, they will hopefully be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who repents and believes and does good things may well be among the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who repented and believed and acted righteously, they will perhaps be among those who will prosper there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, those who have repented and have become righteously striving believers will perhaps have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So whoever repented and accepted faith and did good deeds, so it is likely that he will be among the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who repented, believed, and did righteous deeds, then perhaps he will be among those who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as to him who repents and believes and does good, maybe he will be among the successful:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who repents, and believes, and works righteousness, haply he shall be among the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who shall repent and believe and do right, he haply may be one of the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who repents and believes and does good deeds, he can hope to find himself among the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Howbeit, whosoever shall repent and believe, and work righteous works - belike he shall be of the thrivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for him who repents, has faith and acts righteously, maybe he will be among the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But any that (in this life) had repented, believed, and worked righteousness, will have hopes to be among those who achieve salvation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who repented (from polytheism and sins, etc.), believed (in the Oneness of Allah, and in His Messenger Muhammad SAW), and did righteous deeds (in the life of this world), then he will be among those who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, as for he who repents and believes, and does good deeds, he will be among those who prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who repents, and believes, and does righteous deeds, may well be among the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for one who had repented, believed, and done righteousness, it is promised by Allah that he will be among the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:67] But as for him who repents, of idolatry, and believes, in the affirmation of God’s Oneness, and acts righteously, he observes the duties [of religion], maybe he will be among the successful, those delivered according to God’s promise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But as for him who shall repent) from disbelief (and believe) in Allah (and do right) sincerely between him and his Lord, (he haply may be) \"may be\" in connection with Allah denotes a necessity (one of the successful) one of those saved from Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَمَّا مَن تَابَ } عمَّا جرى عليه من المعاصي { وَآمَنَ } بالله على مقتضى ما أمرهم الحق بلسان رسله وأنبيائه { وَعَمِلَ } عملاً { صَالِحاً } امتثالاً لما نطق به الكتب والرسل { فَعَسَىٰ أَن يَكُونَ } هذا السعيد { مِنَ ٱلْمُفْلِحِينَ } [القصص: 67] الفائزين بالمثوبة العظمى والدرجة العليا عند الله\n ومن المبشرين من عنده بشرف اللقاء\n والوصول إلى دار البقاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأما من تابَ } من الشرك { وآمَنَ } بربه وبمن جاء من عنده، { وعَمِلَ صالحاً } أي: جمع بين الإيمان والعمل، { فعسى أن يكون من المفلحين } من الفائزين عند الله بالنعيم المقيم\n و \" عسى \" ، من الكِرام، تحقيق\n وفيه بشارة للمسلمين على الإسلام، وترغيب للكافرين في الإيمان\n وبالله التوفيق\n الإشارة: قال الذين حق عليهم القول بالانحطاط عن درجة المقربين، والبقاء مع عامة أهل اليمين، وهم الصادُّون الناسَ عن الدخول في طريق القوم: ربنا هؤلاء الذين أغوينا زيناً لهم البقاء مع الأسباب، والوقوف مع العوائد، أغويناهم كما غوينا، فحيث لم نَقَوَ على مقام أهل التجريد، قوينا سوادنا بهم، تبرأنا إليك لأنا لم نقهرهم، ولكن وسوسنا لهم ذلك، ما كانوا إيانا يعبدون، ولكن عبدوا هوى أنفسهم\n ثم يقال لهم: ادعوا ما كنتم تعبدونه من حظوظ الدنيا وشهواتها، فدعوهم فلم يستجيبوا لهم، ورأوا عذاب القطيعة، لو أنهم كانوا يهتدون إلى اتباع أهل التربية ما وقعوا في ذلك\n ويوم يناديهم فيقول: ماذا أجبتم الداعين، الذين أرسلتهم في كل زمان، يدعون إلى الله، ويرفعون الحجاب بينهم وبين ربهم، فعميت عليهم الأنبياء يومئذٍ، فهم لا يتساءلون عن أحوال المقربين، لغيبتهم عنهم\n والله تعالى أعلم\n ثم بين الله تعالى بعض صفاته الحسنى، فقال: { وَرَبُّكَ يَخْلُقُ مَا يَشَآءُ وَيَخْتَارُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:99",
      "similarity": 0.4086388398565041
    },
    {
      "verse": "23:1",
      "similarity": 0.38626711673706327
    },
    {
      "verse": "2:5",
      "similarity": 0.3660105285206431
    },
    {
      "verse": "31:5",
      "similarity": 0.3660105285206431
    },
    {
      "verse": "25:71",
      "similarity": 0.3627261411041135
    }
  ]
}