{
  "chapter": "القصص",
  "text": "ونمكن لهم فى الارض ونرى فرعون وهمن وجنودهما منهم ما كانوا۟ يحذرون",
  "translations": [
    {
      "translation": "and establish them firmly in the land and to show Pharaoh and Haman and their troops the very thing that they were fearing from them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish them in the country; and to make the Pharaoh, Haman and their hordes beware of what they feared from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to grant them power in the land, and make Pharaoh and Haman and their hosts see what they had feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "give them power in the land and make the Pharaoh, Haman (his Minister), and their armies to experience from their victims what they feared most.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to give them control in the land, and to show Firaun and Haman and their armies what they fear from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the land, and We let Fir`awn and Haman and their armies receive from them that which they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to grant them power in the land, and to make Firon and Haman and their hosts see from them what they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to establish them in the land, and to show Pharaoh and Ha man, and their hosts, what they were dreading from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the earth, and to show Pharaoh and Haman and their hosts that which they feared from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to give them power in the land; and to show Pharaoh and Haman and their hosts that very thing which they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We should establish them in the earth, and We should let Fir'awn and Haman and their hostee from them that which they dreaded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to establish them in the land, and to show Pharaoh and Haman and their hosts from them that of which they were apprehensive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To establish a firm place for them in the land, and to show Pharaoh, Haman, and their hosts, at their hands, the very things against which they were taking precautions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the land, and We let Fir'aun (Pharaoh) and Haman and their hosts receive from them that which they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to establish them in the land; and to show Pharaoh and Haman, and their armies, the very thing they dreaded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to establish them in the land; and to show Pharaoh, Hamaan, and their troops, the very thing they feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish them in the land and show Pharaoh and [his minister] Haman and their soldiers through them that which they had feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:6] and to establish them in the land, the land of Egypt and Syria, and to show Pharaoh and Hāmān and their hosts (a variant reading has wa-yarā Fir‘awnu wa-Hāmānu wa-junūduhumā, ‘so that Pharaoh and Hāmān and their hosts might see’, with all three [nouns] in the nominative) from them that of which they were apprehensive, [that which] they feared of the new-born [Israelite] who would bring about the end of their kingdom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَنُمَكِّنَ لَهُمْ فِي الْأَرْضِ وَنُرِيَ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا مِنْهُمْ مَا كَانُوا يَحْذَرُونَ (6)والتمكين لهم في الأرض تثبيت سلطانهم فيما ملكوه منها وهي أرض الشام إن كانت اللام عوضاً عن المضاف إليه . ويحتمل أن يكون المعنى تقويتهم بين أمم الأرض إن حمل التعريف على جنس الأرض المنحصر في فرد ، أو على العهد ، أي الأرض المعهودة للناس .وأصل التمكين : الجعل في المكان ، وقد تقدم في قوله تعالى { إنا مكّنّا له في الأرض } في سورة \\[ الكهف : 84 \\] ، وتقدم الكلام على اشتقاق التمكين وتصاريفه عند قوله تعالى { مكّنّاهم في الأرض ما لم نمكّن لكم } في سورة \\[ الأنعام : 6 \\] .و { ما كانوا يحذرون } هو زوال ملكهم بسبب رجل من بني إسرائيل حسبما أنذره بذلك الكهان .ومعنى إراءتهم ذلك إراءتهم مقدماته وأسبابه .وفرعون الذي أُرِي ذلك هو ملك مصر ( منفتاح ) الثالث وهو الذي حكم مصر بعد ( رعمسيس ) الثاني الذي كانت ولادة موسى في زمانه وهو الذي كان يحذر ظهور رجل من إسرائيل يكون له شأن . و { هامان } قال المفسرون : هو وزير فرعون . وظاهر آيات هذه السورة يقتضي أنه وزير فرعون وأحسب أن هامان ليس باسم علم ولكنه لقب خطة مثل فرعون وكسرى وقيصر ونجاشي . فالظاهر أن هامان لقب وزير الملك في مصر في ذلك العصر . وجاء في كتاب «أستير» من كتب اليهود الملحقة بالتوراة تسمية وزير ( أحشويروش ) ملك الفرس ( هامان ) فظنوه علماً فزعموا أنه لم يكن لفرعون وزير اسمه هامان واتخذوا هذا الظن مطعناً في هذه الآية . وهذا اشتباه منهم فإن الأعلام لا تنحصر وكذلك ألقاب الولايات قد تشترك بين أمم وخاصة الأمم المتجاورة ، فيجوز أن يكون { هامان } علماً من الأمان فإن الأعلام تتكرر في الأمم والعصور ، ويجوز أن يكون لقب خطة في مصر فنقل اليهود هذا اللقب إلى بلاد الفرس في مدة أسرهم .ويشبه هذا الطعن طعن بعض المستشرقين من نصارى العصر في قوله تعالى في شأن مريم حين حكى قول أهلها لها { يا أخت هارون } \\[ مريم : 28 \\] فقالوا : هذا وهم انجرّ من كون أبي مريم اسمه عمران فتوهم أن عمران هو أبو موسى الرسول عليه السلام ، وتبع ذلك توهم أن مريم أخت موسى وهارون وهو مجازفة فإن النصارى لا يعرفون اسم أبي مريم وهل يمتنع أن يكون مسمى على اسم أبي موسى وهارون وهل يمتنع أن يكون لمريم أخ اسمه هارون . وقد تكلمنا على ذلك في سورة مريم .والجنود جمع الجند . ويطلق الجند على الأمة قال تعالى { هل أتاك حديث الجنود فرعون وثمود } \\[ البروج : 17 - 18 \\] .وقرأ الجمهور { ونُرِيَ } بنون العظمة ونصب الفعل ونصب { فرعونَ } وما عطف عليه . وقرأه حمزة والكسائي وخلف { ويرى } بياء الغائب مفتوحة وفتح الراء على أنه مضارع رأى ورفع { فرعونُ } وما عطف عليه . ومآل معنى القراءتين واحد .والجند اسم جمع لا واحد له من لفظه : هو الجماعة من الناس التي تجتمع على أمر تتبعه ، فلذلك يطلق على العسكر لأن عملهم واحد وهو خدمة أميرهم وطاعته .\n\n",
      "translations": [
        {
          "translation": "(And to establish them in the earth) and give them sovereignty over the land of Egypt, (and to show 436 Pharaoh and Haman and their hosts that which they feared) the loss if their sovereignty (from them) from Moses and the Children of Israel.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما كانوا يحذَرون } يخافون من ذهاب ملكهم\n وهلاكهم على يد مولود منهم\n والحذر التوقي من الضرر\n ومن قرأ يري بالياء ففرعون وما بعده فاعل\n وبالله التوفيق\n الإشارة: العلو في الأرض يُورث الذل والهوان\n والتواضع والاستضعاف يورث العز والسلطان\n والعيش في العافية والأمان من تواضع رفعه الله\n ومن تكبر قصمه الله\n وهذه عادة الله في خلقه\n بقدر ما يَذِلُّ في جانب الله يعزه الله\n وبقدر ما يفتقر يغنيه الله\n بقدر ما يفقد يجد الله\n قال الشيخ أبو الحسن رضي الله عنه: اللهم إن القوم قد حكمت عليهم بالذل حتى عزوا\n وحكمت عليه بالفقد حتى وجدوا\n وبالله التوفيق\n ثم ذكر أول نشأة موسى عليه السلام وما جرى في تربيته\n فقال: { وَأَوْحَيْنَآ إِلَىٰ أُمِّ مُوسَىٰ أَنْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:24",
      "similarity": 0.4556095209852965
    },
    {
      "verse": "29:39",
      "similarity": 0.44913469798142636
    },
    {
      "verse": "28:8",
      "similarity": 0.38043847741924275
    },
    {
      "verse": "40:36",
      "similarity": 0.3683994531151496
    },
    {
      "verse": "28:38",
      "similarity": 0.3123359877574427
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}