{
  "chapter": "القصص",
  "text": "قال الذين حق عليهم القول ربنا هؤلاء الذين اغوينا اغوينهم كما غوينا تبرانا اليك ما كانوا۟ ايانا يعبدون",
  "translations": [
    {
      "translation": "Those against whom the Word has been justly carried out will say, 'Our Lord, those people we misled, we only misled them as we too were misled. We declare our innocence to You. It was not us they were worshipping!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the sentence is justified will say: \"O Lord, these are those we had led astray as we had ourselves gone astray. We clear ourselves before You: They never worshipped us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the Word will be realised will say: \"Our Lord, these are the ones whom we led astray just as we ourselves strayed. We absolve ourselves before You of all blame. It was not us that they worshipped.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have become subject to punishment will say, \"Lord, they seduced us.\" Their idols will say, \"We seduced them but we renounce their worshipping us for it was not us whom they worshipped\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the Word will have proved true will say, “Our Lord! These are they whom we led astray; we led them astray the way we ourselves went astray; we are unconcerned with them and we incline towards You – they never worshipped us!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those about whom the Word will have been fulfilled will say: \"Our Lord! These are they whom we led astray. We led them astray, as we were astray ourselves. We declare our innocence before You. It was not us they worshipped.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the sentence has become confirmed will say: Our Lord! these are they whom we caused to err; we caused them to err as we ourselves did err; to Thee we declare ourselves to be clear (of them); they never served Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the Word is realized they shall say, 'Our Lord, those whom we perverted, we perverted them even as we ourselves erred. We declare our innocence unto Thee; it was not us that they were serving.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those concerning whom the Word will have come true will say: Our Lord! These are they whom we led astray. We led them astray even as we ourselves were astray. We declare our innocence before Thee: us they never worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those on whom sentence has been passed, will say, \"Our Lord, these are the ones who led us astray. We led them astray as we ourselves were led astray. We now dissociate ourselves from them before You; it was not us that they worshipped.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those upon whom the sentence will be pronounced will say: our Lord these are they whom we seduced, we seduced them even as we our selves were seduced. We declare ourselves quit of them before Thee; not our selves they were wont to worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the word had become due will say, ‘Our Lord! These are the ones whom we have perverted. We perverted them as we were perverse ourselves. We repudiate them before You: it was not us that they worshipped.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the charge will be proved, will say: \"Our Lord! These are the ones whom we led astray: we led them astray, as we were astray ourselves: we free ourselves (from them) in Thy presence: it was not us they worshipped.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those about whom the Word will have come true (to be punished) will say: \"Our Lord! These are they whom we led astray. We led them astray, as we were astray ourselves. We declare our innocence (from them) before You. It was not us they worshipped.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the Word is realized shall say: 'Our Lord, those whom we led astray, we led them astray even as we ourselves were astray. We are quit of them to You; it was not us that they worshipped'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those against whom the sentence is justified will say, “Our Lord, these are they whom we misled. We misled them, as we were misled. We beg Your forgiveness; it was not us they used to worship.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those upon whom the word will have come into effect will say, \"Our Lord, these are the ones we led to error. We led them to error just as we were in error. We declare our disassociation [from them] to You. They did not used to worship us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:63] Those against whom the Word [of punishment] will have become due, the justified [Word], that they be admitted into the Fire — and these are the leaders of misguidance — they shall say, ‘Our Lord! These are the ones whom we led astray (hā’ūlā’i’lladhīna aghwaynā is both a subject and an adjectival qualification). We led them astray (aghwaynāhum, the predicate thereof) and they went astray, even as we went astray — we did not compel them to [follow] error. We declare our innocence, of them, before You; it was not us that they worshipped’ (mā, ‘not’, is for negation; the direct object [iyyānā, ‘us’] precedes [the verb ya‘budūna, ‘they worshipped’] in order to concord with the end-rhyme of the verses).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ رَبَّنَا هَؤُلَاءِ الَّذِينَ أَغْوَيْنَا أَغْوَيْنَاهُمْ كَمَا غَوَيْنَا تَبَرَّأْنَا إِلَيْكَ مَا كَانُوا إِيَّانَا يَعْبُدُونَ (63)وجردت جملة { قال الذين حق عليهم القول } عن حرف العطف لأنها وقعت في موقع المحاورة فهي جواب عن قوله تعالى { أين شركائي الذين كنتم تزعمون } .والذين تصدوا للجواب هم بعض المنادين ب { أين شركائي الذين كنتم تزعمون } علموا أنهم الأحرياء بالجواب . وهؤلاء هم أيمة أهل الشرك من أهل مكة مثل أبي جهل وأمية بن خلف وسدنة أصنامهم كسادن العزى . ولذلك عبّر عنهم ب { الذين حقّ عليهم القول } ولم يعبر عنهم ب ( قالوا ) .ومعنى { حق عليهم القول } يجوز أن يكون { حق } بمعنى تحقق وثبت ويكون القول قولا معهوداً وهو ما عهد للمسلمين من قوله تعالى { وحقَّ القول مني لأملأن جهنم من الجنة والناس أجمعين } \\[ السجدة : 13 \\] وقوله { أفمن حق عليه كلمة العذاب } \\[ الزمر : 19 \\] فالذين حق عليهم القول هم الذين حل الإبان الذي يحق عليهم فيه هذا القول . والمعنى : أن الله ألجأهم إلى الاعتراف بأنهم أضلوا الضالين وأغووهم .ويجوز أن يكون { حق } بمعنى وجب وتعين ، أي حق عليهم الجواب لأنهم علموا أن قوله تعالى { فيقول أين شركائي الذين كنتم تزعمون } موجه إليهم فلم يكن لهم بد من إجابة ذلك السؤال .ويكون المراد بالقول جنس القول ، أي الكلام الذي يقال في ذلك المقام وهو الجواب عن الاستفهام بقوله { أين شركائي الذين كنتم تزعمون } وعلى كلا الاحتمالين فالذين حق عليهم القول هم أيمة الكفر كما يقتضيه قوله تعالى { هؤلاء الذين أغوينا . . . } الخ .والتعريف في { القول } الأظهر أنه تعريف الجنس وهو ما دل عليه { قال } ، أي قال الذين حق عليهم أن يقولوا ، أي الذين كانوا أحرى بأن يجيبوا لعلمهم بأن تبعة المسؤول عنه واقعة عليهم لأنه لما وجه التوبيخ إلى جملتهم تعين أن يتصدى للجواب الفريق الذين ثبتوا العامة على الشرك وأضلوا الدهماء .وابتدأوا جوابهم بتوجيه النداء إلى الله بعنوان أنه ربهم ، نداء أريد منه الاستعطاف بأنه الذي خلقهم اعترافاً منهم بالعبودية وتمهيداً للتنصل من أن يكونوا هم المخترعين لدين الشرك فإنهم إنما تلقوه عن غيرهم من سلفهم ، والإشارة ب { هؤلاء } إلى بقية المنادين معهم قصداً لأن يتميزوا عمن سواهم من أهل الموقف وذلك بإلهام من الله ليزدادوا رُعباً ، وأن يكون لهم مطمع في التخليص . و { الذين أغوينا } خبر عن اسم الإشارة وهو اعتراف بأنهم أغووهم .وجملة { أغويناهم كما غوينا } استئناف بياني لجملة { الذين أغوينا } لأن اعترافهم بأنهم أغووهم يثير سؤال سائل متعجب كيف يعترفون بمثل هذا الجرم فأرادوا بيان الباعث لهم على إغواء إخوانهم وهو أنهم بثوا في عامة أتباعهم الغواية المستقرة في نفوسهم وظنوا أن ذلك الاعتراف يخفف عنهم من العذاب بقرينة قولهم { تبرّأنا إليك ما كانوا إيانا يعبدون } .وإنما لم يقتصر على جملة { أغويناهم } بأن يقال : هؤلاء الذين أغويناهم كما غوينا ، لقصد الاهتمام بذكر هذا الإغواء بتأكيده اللفظي ، وبإجماله في المرة الأولى وتفصيله في المرة الثانية ، فليست إعادة فعل { أغوينا } لمجرد التأكيد . قال ابن جني في كتاب «التنبيه» على إعراب الحماسة عند قول الأحوص: ... فإذا تزول تزول عن متخمطتخشى بوادره على الأقران ... إنما جاز أن يقول : فإذا تزول تزول ، لما اتصل بالفعل الثاني من حرف الجر المفاد منه الفائدة ، ومثله قول الله تعالى { هؤلاء الذين أغوينا أغويناهم كما غوينا } ولو قال : هؤلاء الذين أغوينا أغويناهم لم يُفد القول شيئاً ، لأنه كقولك : الذي ضربته ضربته ، والتي أكرمتها أكرمتها ، ولكن لما اتصل ب { أغويناهم } الثانية قوله { كما غوينا } أفاد الكلام كقولك : الذي ضربته ضربته لأنه جاهل . وقد كان أبو علي امتنع في هذه الآية مما اخترناه غير أن الأمر فيها عندي على ما عرفتك» اه . وقد تقدم بيان كلامه عند قوله تعالى { إن أحسنتم أحسنتم لأنفسكم } في سورة الاسراء ( 7 ) ، وقوله { وإذا بطشتم بطشتم جبارين } في سورة الشعراء ( 130 ) ، وقوله{ وإذا مروا باللغو مروا كراماً } في سورة الفرقان ( 72 ) ، فإن تلك الآيات تطابق بيت الأحوص لاشتمالهن على ( إذا ) .و { كما غوينا } صفة لمصدر ، أي إغواء يوقع في نفوسهم غيّاً مثل الغي الذي في قلوبنا . ووجه الشبه في أنهم تلقوا الغواية من غيرهم فأفاد التشبيه أن المجيبين أغواهم مُغوون قبلهم ، وهم يحسبون هذا الجواب يدفع التبعة عنهم ويتوهمون أن السير على قدم الغاوين يبرر الغواية ، وهذا كما حكى عنهم في سورة الشعراء ( 96 ، 99 ) { قالوا وهم فيها يختصمون تالله إن كنا لفي ضلال مبين إذ نسويكم برب العالمين وما أضلنا إلا المجرمون } وحذف مفعول فعل { أغوينا } الأول وهو العائد من الصلة إلى الموصول لكثرة حذف أمثاله من كل عائد صلة هو ضمير نصب متصل وناصبه فعل أو وصف شبيه بالفعل ، لأن اسم الموصول مغن عن ذكره ودال عليه فكان حذف العائد اختصاراً . وذكر مفعول فعل { أغويناهم } الثاني اهتماماً بذكره لعدم الاستغناء عنه في الاستعمال .وجملة { تبرأنا إليك } استئناف . والتبرؤ : تفعل من البراءة وهي انتفاء ما يصم ، فالتبرؤ : معالجة إثبات البراءة وتحقيقها . وهو يتعدى إلى من يحاول إثبات البراءة لأجله بحرف ( إلى ) الدال على الانتهاء المجازي؛ يقال : إني أبرأ إلى الله من كذا ، أي أوجه براءتي إلى الله ، كما يتعدى إلى الشيء الذي يَصِم بحرف ( من ) الاتصالية التي هي للابتداء المجازي قال تعالى { فبراه الله مما قالوا } \\[ الأحزاب : 69 \\] . وقد تدخل ( من ) على اسم ذات باعتبار مضاف مقدر نحو قوله تعالى { وقال إني بريء منكم } \\[ الأنفال : 48 \\] أي من كفركم . والتقدير : من أعمالكم وشؤونكم إما من أعمال خاصة يدل عليها المقام أو من عدة أعمال .فالمعنى هنا تحقق التبرؤ لديك والمتبرأ منه هو مضمون جملة { ما كانوا إيانا يعبدون } فهي بيان لإجمال التبرؤ .والمقصود : أنهم يتبرؤون من أن يكونوا هم المزعوم أنهم شركاء وإنما قصارى أمرهم أنهم مضلون وكان هذا المقصد إلجاء من الله إياهم ليعلنوا تنصلهم من ادعاء أنهم شركاء على رؤوس الملأ ، أو حملهم على ذلك ما يشاهدون من فظاعة عذاب كل من ادعى المشركون له الإلهية باطلاً لما سمعوا قوله تعالى { إنكم وما تعبدون عن دون الله حصب جهنم } \\[ الأنبياء : 98 \\] . هذا ما انطوت عليه هذه الآية من المعاني .وتقديم { إيانا } على { يعبدون } دون أن يقال يعبدوننا للاهتمام بهذا التبرؤ مع الرعاية على الفاصلة .\n\n",
      "translations": [
        {
          "translation": "(Those concerning whom the Word) of wrath and torment, i.e. the leaders, (will have come true) has been enjoined upon (will say: Our Lord!) our Lord! (These) lowly people (are they whom we led astray) we led to error. (We led them astray) we misled them from the Truth and guidance (even as we ourselves were astray. We declare our innocence before You) we exonerate ourselves from them: (us they never worshipped) i.e. by our command.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أظهرهم وسأل عنهم { قَالَ ٱلَّذِينَ حَقَّ } أي: ثبت وتوجه { عَلَيْهِمُ ٱلْقَوْلُ } أي: السؤال من الله\n وهم الشياطين المعبودون مناجين نحو الحق\n متضرعين قائلين: { رَبَّنَا } يا من ربانا على فطرة التوحيد\n كيف صدر منَّا أمثال هذه الجرأة؟! بل { هَـٰؤُلاۤءِ } الغواة الهالكون في تيه الغي والضلال هم { ٱلَّذِينَ أَغْوَيْنَآ } عن منهج الاستقامة والسداد بأنواع التذلل والانقياد\n والإطاعة والعبادة إيانا على مقتضى أهويتهم الفاسدة\n وآرائهم الباطلة\n مع أنَّا لا نستحق بها على توهم منهم إنَّا قادرون على إنجاح ما في نفوسهم من الأماني والشهوات\n\n\nونحن أيضاً { أَغْوَيْنَاهُمْ } بأنواع التغرير والتضليل { كَمَا غَوَيْنَا } هؤلاء إيانا بعبادتهم وطاعتهم نحونا\n فتعارض إغواؤنا بإغوائهم\n وحين ظهر الحق تساطقا\n فالآن { تَبَرَّأْنَآ } عنهم وعن عبادتهم\n والتجأنا { إِلَيْكَ } تائبين آيبين\n مع أنهم { مَا كَانُوۤاْ إِيَّانَا يَعْبُدُونَ } [القصص: 63] حين ادعوا عبادتنا\n بل إنما عبدوا أهوية نفوسهم\n وأماني قلوبهم\n وتوسلوا بنا فيها\n والعابدون أيضاً يتبرؤون عن معبوداتهم بأشد من ذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" هؤلاء \": مبتدأ\n و \" الذين \": صفته\n والعائد: محذوف\n و \" أغويناهم \": خبر\n والكاف في \" كما \": صفة لمصدر محذوف\n أي أغويناهم غياً مثل ما غوينا\n و \" لو أنهم \": جوابه محذوف\n أي: لما رأوا العذاب\n يقول الحق جل جلاله: { قال الذين حقَّ عليهم القولُ } بالعذاب\n وثبت مقتضاه\n وهو قوله تعالى:\n[هود: 119]\n وهم الشياطين\n أو: أئمة الكفر: ورؤساء الكفرة: { ربنا هؤلاء } الكفرة { الذين أغوينا أغويناهم } أي: دعوناهم إلى الشرك وسوّلناه لهم\n قد غَووا غياً { كما } مثل ما { غَوَينا } يقولون: إنا لم نغو إلا باختيارنا\n فهؤلاء كذلك غووا باختيارهم لأن إغواءنا لم يكن إلا وسوسة وتسويلاً\n فلا فرق إذن بين غينا وغيهم\n وإن كان تسويلنا داعياً لهم إلى الكفر فقد كان في مقابلته دعاء الله لهم إلى الإيمان\n بما وضع فيهم من أدلة العقل\n وما بعث إليهم من الرسل\n وأنزل إليهم من الكتب\n وهذا كقوله:\nإلى قوله:\n[إبراهيم: 22]\n ثم قالوا: { تبرَّأنا إليك } منهم فيما اختاروه من الكفر\n { ما كانوا إيانا يعبدون } \n بل كانوا يعبدون أهواءهم\n ويطيعون شهواتهم\n فَتَحَصَّلَ من كلام هؤلاء الرؤساء أنهم اعترفوا أنهم غَرُّوا الضعفاء\n وتبرؤوا من أن يكون آلهتهم\n فلا تناقض\n انظر ابن جزي\n وإخلاء الجملتين من العاطف لكونهما مقررتين للجملة الأولى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:32",
      "similarity": 0.5283734696269772
    },
    {
      "verse": "53:2",
      "similarity": 0.4887479452668142
    },
    {
      "verse": "38:82",
      "similarity": 0.4776814289602683
    },
    {
      "verse": "15:42",
      "similarity": 0.46036287646767937
    },
    {
      "verse": "26:224",
      "similarity": 0.4583679824440555
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028063.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028063.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}