{
  "chapter": "القصص",
  "text": "وقيل ادعوا۟ شركاءكم فدعوهم فلم يستجيبوا۟ لهم وراوا۟ العذاب لو انهم كانوا۟ يهتدون",
  "translations": [
    {
      "translation": "They will be told, 'Call on your partner-gods!' They will call on them but they will not respond to them. They will see the punishment. Oh if only they had been guided!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The sinners) will be told: \"Invoke your partners.\" They will call on them, but they will not answer; and they will see the torment (and wish) if only they had come to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will then be told: \"Call upon those for help whom you declared to be Our associates.\" They will then call upon them but they will not answer them. They will have observed the chastisement in front of them. Would that they were guided!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told to call their idols. They will call them but will receive no answer. They will see the torment approaching and wish that they had sought guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them, “Call unto your ascribed partners” – so they will call unto them and they will not listen to them, and they will behold the punishment; if only they had obtained guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: \"Call upon your partners,\" and they will call upon them, but they will give no answer to them, and they will see the torment. If only they had been guided!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: Call your associate-gods. So they will call upon them, but they will not answer them, and they shall see the punishment; would that they had followed the right way!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be said, 'Call you now upon your associates!' And they will call upon them, but they shall not answer them, and they shall see the chastisement-ah, if they had been guided!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: Cry unto your (so-called) partners (of Allah). And they will cry unto them, and they will give no answer unto them, and they will see the Doom. Ah, if they had but been guided!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they will be told, \"Call upon your partners.\" And they will call upon them, but will receive no answer. They shall witness the punishment. If only they had allowed themselves to be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said: Call upon your associate-gods. And they shall call upon them, and they shall not answer them, and they shall behold the torment. Would that they had received the guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said, ‘Invoke your partners!’ So they will invoke them, but they will not respond to them, and they will sight the punishment, wishing they had followed guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said (to them): \"Call upon your 'partners' (for help)\": they will call upon them, but they will not listen to them; and they will see the Penalty (before them); (how they will wish) 'if only they had been open to guidance!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said (to them): \"Call upon your (so-called) partners (of Allah), and they will call upon them, but they will give no answer to them, and they will see the torment. (They will then wish) if only they had been guided!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said to them: 'Call on your associates' And they will call on them, but they will not respond to them, and they shall see the punishment if only they had been guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said, “Call on your partners.” And they will call on them, but they will not respond to them. And they will see the suffering. If only they were guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said, \"Invoke your 'partners' \" and they will invoke them; but they will not respond to them, and they will see the punishment. If only they had followed guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:64] And it shall be said, ‘Call [now] to your associates!’, namely, the idols you alleged to be partners of God. So they will call to them, but they will not answer them, their call, and they, the former, will see, they will sight, the chastisement: [they will wish] if only they had been guided!, in this world, they would not have seen it in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it will be said: Cry unto your (so called) partners (of Allah)) call upon your deities to save you from Allah's torment. (And they will cry unto them, and they will give no answer unto them) they will not respond in order to save them from Allah's chastisement, (and they) the leaders and their followers (will see the Doom. Ah, if they had but been guided!) they wished they followed the Truth and guidance in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقِيلَ } حينئذٍ من قِبَل الحق للمشركين: { ٱدْعُواْ شُرَكَآءَكُمْ } الذين تطمعون وتدعون شفاعتهم لكم { فَدَعَوْهُمْ } صائحين متضرعين { فَلَمْ يَسْتَجِيبُواْ لَهُمْ } من كمال عجزهم وحيرتهم في أمر أنفسهم { وَ } بعدما { رَأَوُاْ ٱلْعَذَابَ } النازل على أربابهم قالوا متمنين على سبيل التلهف والتحسر: { لَوْ أَنَّهُمْ كَانُواْ يَهْتَدُونَ } [القصص: 64] في النشأة الأولى لينقذوا أنفسهم من العذاب اليوم\n فكيف: إنقاذهم بنا؟!\n\n\n{ وَ } بعدما سأل سبحانه عن شركهم سألهم عن تكذيب رسله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقيل } للمشركين: { ادعو شركاءَكم } أي: الأصنام لتُخلصكم من العذاب\n { فَدَعَوْهُمْ فلم يستجيبوا لهم } \n فلم يجيبوهم لعجزهم عن الإجابة والنصرة\n { ورأوا العذاب لو أنهم كانوا يهتدون } لَمَّا رأوا ذلك العذاب\n وقيل: \" لو \" للتمني\n أي: تمنوا أنهم كانوا يهتدون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:14",
      "similarity": 0.5744840967878521
    },
    {
      "verse": "10:89",
      "similarity": 0.5420963480618239
    },
    {
      "verse": "7:194",
      "similarity": 0.5355412767833618
    },
    {
      "verse": "11:14",
      "similarity": 0.5036091954590063
    },
    {
      "verse": "28:50",
      "similarity": 0.45244728877787965
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:64.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:64.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}