{
  "chapter": "القصص",
  "text": "وابتغ فيما ءاتىك الله الدار الءاخرة ولا تنس نصيبك من الدنيا واحسن كما احسن الله اليك ولا تبغ الفساد فى الارض ان الله لا يحب المفسدين",
  "translations": [
    {
      "translation": "Seek the abode of the Next World with what Allah has given you, without forgetting your portion of this world. And do good as Allah has been good to you. And do not seek to cause corruption in the earth. Allah does not love corrupters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So seek the abode of the Hereafter through what God has given you, and do not forget your part in this world. Do good to others as God has done good to you, and do not try to spread corruption in the land. Surely God does not like corrupters.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek by means of the wealth that Allah has granted you the Abode of the Hereafter, but forget not your share in this world and do good as Allah has been good to you and do not strive to create mischief in the land, for Allah loves not those who create mischief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek the gains of the life to come through your wealth without ignoring your share of this life. Do favors to others just as God has done favors to you. Do not commit evil in the land for God does not love the evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And seek the abode of the Hereafter with the wealth that Allah has given you, and do not forget your part in this world, and do favours (to others) the way Allah has favoured you, and do not seek to cause turmoil in the earth; indeed Allah does not like the mischievous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek, with that which Allah has bestowed on you, the home of the Hereafter, and forget not your portion of lawful enjoyment in this world; and be generous as Allah has been generous to you, and seek not mischief in the land. Verily, Allah likes not the mischief-makers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And seek by means of what Allah has given you the future abode, and do not neglect your portion of this world, and do good (to others) as Allah has done good to you, and do not seek to make mischief in the land, surely Allah does not love the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but seek, amidst that which God has given thee, the Last Abode, and forget not thy portion of the present world; and do good, as God has been good to thee.' And seek not to work corruption in the earth; surely God loves not the workers of corruption.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek the abode of the Hereafter in that which Allah hath given thee and neglect not thy portion of the world, and be thou kind even as Allah hath been kind to thee, and seek not corruption in the earth; lo! Allah loveth not corrupters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek the Home of the Hereafter by means of that which God has bestowed on you; do not forget to take your portion [of the Hereafter] in this world.\" Be good to others as God has been good to you and do not strive for evil in the land, for God does not love the evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And seek the abode of the Hereafter with that which God hath vouchsafed thee, and forget not thy portion in the World, and be thou bounteous even as God hath been bounteous unto thee, and seek not corruption in the earth; verily Allah loveth not corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek the abode of the Hereafter by means of what Allah has given you, while not forgetting your share of this world. Be good [to others] just as Allah has been good to you, and do not try to cause corruption in the land. Indeed Allah does not like the agents of corruption.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek, with the (wealth) which Allah has bestowed on thee, the Home of the Hereafter, nor forget thy portion in this world: but do thou good, as Allah has been good to thee, and seek not (occasions for) mischief in the land: for Allah loves not those who do mischief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek, with that (wealth) which Allah has bestowed on you, the home of the Hereafter, and forget not your portion of legal enjoyment in this world, and do good as Allah has been good to you, and seek not mischief in the land. Verily, Allah likes not the Mufsidun (those who commit great crimes and sins, oppressors, tyrants, mischief-makers, corrupts).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek, in that which Allah has given you to attain the Everlasting residence. Do not forget your share in this world. Do good, as Allah has been good to you, and do not corrupt in the land, Allah does not love those who corrupt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek, with what God has given you, the Home of the Hereafter, and do not neglect your share of this world. And be charitable, as God has been charitable to you. And do not seek corruption in the land. God does not like the seekers of corruption.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But seek, through that which Allah has given you, the home of the Hereafter; and [yet], do not forget your share of the world. And do good as Allah has done good to you. And desire not corruption in the land. Indeed, Allah does not like corrupters.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:77] but seek, in that which God has given you, of wealth, the Abode of the Hereafter, by expending it in obedience to God, and do not forget your share of this world, that is, [do not forget] to strive in it for the sake of the Hereafter; and be good, to people, by [giving] voluntary alms, just as God has been good to you. And do not seek to cause corruption in the earth, by committing acts of disobedience. Surely God does not love the agents of corruption’, meaning that He will punish them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But seek the abode of the Hereafter) Paradise (in that which Allah hath given you) through that which Allah has given you of wealth (and neglect not thy portion of the world) do not leave your portion in the Hereafter because of your portion in this worldly life; it is also said: your portion of this worldly life will not diminish 445 because of spending from it for the Hereafter, (and be thou kind) to the poor and needy (even as Allah hath been kind to thee) by giving you wealth, (and seek not corruption in the earth) do not commit transgressions and oppose the command of the Messenger Moses, Allah give him peace; (lo! Allah loveth not corrupters) who commit transgressions,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وغير ذلك من الأمور المتعلقة لعموم مصالح العباد والتسهيل عليهم ورفع العسرة عنهم { وَ } إن أردت أن تكون من أهل الثروة والجاه المخلد في النشأتين { لاَ تَنسَ نَصِيبَكَ مِنَ ٱلدُّنْيَا } وهو الاجتهاد في مرتبة الاستخلاف والنيابة على مقتضى كريمة:\n[الحديد: 7]\n\n\nإذ العبد وما في يده لمولاه والتصرفات الحادثة في عالم الكون والفساد إنما هي مستندة إلى الله أولاً بالذات { وَ } بعدما علمت ما هو نصيبك وحظك من دنياك\n وما معك منه في أخراك إلا الإحسان والإنفاق { أَحْسِن } مما جعلك الحق خليفةً عليه { كَمَآ أَحْسَنَ ٱللَّهُ إِلَيْكَ وَلاَ تَبْغِ } أي: لا تطلب { ٱلْفَسَادَ فِي ٱلأَرْضِ } اتكالاً على ما في يدك من أسبابه التي هي الأموال المؤدية إلى أصناف الفسادات\n وارتكاب أنواع المحذورات والمنهيات { إِنَّ ٱللَّهَ } المطلع لجميع حالات عباده { لاَ يُحِبُّ ٱلْمُفْسِدِينَ } [القصص: 77] منهم\n سيما بمظاهرة حطام الدنيا الدنيَّة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تنس نصيبَكَ من الدنيا } \n وهو أن تأخذ ما يكفيك ويصلحك\n وقيل: معناه: واطلب بدنياك آخرتك فإن ذلك حظ المؤمن منها لأنها مزرعة الآخرة\n فيها تكتسب الحسنات وترفع الدرجات\n أي: لا تنس نصيبك منها أن تقدمه للآخرة\n { وأحسنْ } إلى عباد الله { كما أحسن الله إليك } فيما أنعم به عليك: أو: أحسن بشكرك وطاعتك لخالق الأنام كما أحسن إليك بسوابغ الإنعام\n\n{ ولا تبغِ الفسادَ في الأرض } بالظلم والبغي وإنفاق المال في المعاصي { إن الله لا يحب المفسدين } لا يرضى فعلهم\n والله تعالى أعلم\n الإشارة: في الآية زجر عن الفرح بالدنيا والافتخار بها بل الفرح بكل ما يَفنِي: كُلُّهُ مذموم\n قال في الإحياء: الفرح بالدنيا والتنعم بها سُمٌّ قاتل يسري في العروق فَيُخرجُ من القلب الخوفَ والحزنَ وذكرَ الموت وأهوالَ يوم القيامة وهذا هو موت القلب والعياذ بالله فأولو العزم من أرباب القلوب حزنوا لِمُوَاتَاةِ الدنيا\n وَعَلِموا أن النجاة في الحزن الدائم والتباعُدِ من أسباب الفرح والبطر\n فقطعوا النفس عن ملاذها وعودوا الصبر عن شهواتها حلالها وحرامها وعلموا أن حلالها حساب وهو نوع عذاب ومن نوقش الحساب عُذّب فخلَصوا أنفسهم من عذابها وتوصلوا إلى الحرية والملك في الدنيا والآخرة بالخلاص من أسر الشهوات ورقها والأنس بذكر الله تعالى والاشتغال بطاعته\n هـ\n وقال يُمْن بن رزق: اعلم أني لم أجد شيئاً أبلغ في الزهد في الدنيا من ثبات حزن الآخرة في القلب وعلامة ثبات حزن الآخرة في القلب: أنْسُ القلب بالوحدة\n هـ\n قلت: وهذا مذهب العباد والزهاد وأما العارفون فقد دخلوا جنة المعارف فلا خوف عليهم ولا هم يحزنون جعلنا الله من خواصهم بمنِّه وكرمه\n ثم ذكر جواب قارون\n فقال: { قَالَ إِنَّمَآ أُوتِيتُهُ عَلَىٰ عِلْمٍ عِندِيۤ أَوَلَمْ\n\n\n } BR>",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:83",
      "similarity": 0.3877152038428449
    },
    {
      "verse": "88:3",
      "similarity": 0.3568051664950432
    },
    {
      "verse": "15:48",
      "similarity": 0.3420769225925054
    },
    {
      "verse": "20:126",
      "similarity": 0.33983447410536827
    },
    {
      "verse": "88:19",
      "similarity": 0.31752675929353913
    }
  ]
}