{
  "chapter": "القصص",
  "text": "فخرج على قومه فى زينته قال الذين يريدون الحيوة الدنيا يليت لنا مثل ما اوتى قرون انه لذو حظ عظيم",
  "translations": [
    {
      "translation": "He went out among his people in his finery. Those who desired the life of this world said, 'Oh! If only we had the same as Qarun has been given! What immense good fortune he possesses.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he came before his people in all pomp; and those enamoured of this world, said: \"Ah would that we had what Qarun has been given! He indeed possesses great good fortune.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Once Korah went forth among his people in full glitter. Those seeking the life of this world said: \"Would that we had the like of what Korah has! He truly has a great fortune.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Korah would bedeck himself to show off his wealth. Those who wanted worldly gains would say, \"Would that we were given that which Korah has received. He has certainly received a great share.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He therefore came before his people in his pomp; said those who desired the worldly life, “If only we were to get what Qaroon has been given – he is indeed very fortunate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, he went forth before his people in his finery. Those who were desirous of the life of the world, said: \"Ah, would that we had the like of what Qarun has been given! Verily, he is the owner of a great fortune.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went forth to his people in his finery. Those who desire this world's life said: O would that we had the like of what Qaroun is given; most surely he is possessed of mighty good fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went forth unto his people in his adornment. Those who desired the present life said, 'Would that we possessed the like of that Korah has been given! Surely he is a man of mighty fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then went he forth before his people in his pomp. Those who were desirous of the life of the world said: Ah, would that we had the like of what hath been given unto Korah! Lo! he is lord of rare good fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he went forth before his people in all his pomp. Those who were eager for the life of this world said, \"If only we had the like of Korah's fortune! He really is a very fortunate man,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he went forth unto his people in his pomp. Those who sought the life of the world said: would that we had the like of that which hath been vouchsafed unto Qarun! Verily he is the owner of a very great fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he emerged before his people in his finery. Those who desired the life of the world said, ‘We wish we had like what Korah has been given! Indeed he is greatly fortunate.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went forth among his people in the (pride of his wordly) glitter. Said those whose aim is the Life of this World: \"Oh! that we had the like of what Qarun has got! for he is truly a lord of mighty good fortune!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went forth before his people in his pomp. Those who were desirous of the life of the world, said: \"Ah, would that we had the like of what Qarun (Korah) has been given? Verily! He is the owner of a great fortune.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he went out in all his finery among his nation, those who desired this life said: 'Would that we had the like of that Korah has been given! He has indeed a mighty fortune'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he went out before his people in his splendor. Those who desired the worldly life said, “If only we possessed the likes of what Quaroon was given. He is indeed very fortunate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he came out before his people in his adornment. Those who desired the worldly life said, \"Oh, would that we had like what was given to Qarun. Indeed, he is one of great fortune.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:79] So he, Korah, emerged before his people in his finery, with his large retinue [all of them] in procession dressed in gold and silk garments and mounted on adorned horses and mules. Those who desired the life of this world said, ‘O (yā is for drawing attention) would that we had the like of what Korah has been given, this world. Truly he enjoys great fortune’, abundant [fortune] in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then went he forth) i.e. Korah (before his people in his pomp) his horses, mules, servant boys and servant girls, attires of gold and silver and different kinds of arms and clothes. (Those who were desirous of the life of the world said: Ah, would that unto us had been given the like of what has been given unto Korah) of wealth! (Lo! he is lord of rare good fortune.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ذكروا عنده من الزواجر والعبر فلم ينزجر ولم يعتبر، بل ما زاد إلا بطراً وخيلاءً { فَخَرَجَ } يوماً من الأيام من بيته مباهياً { عَلَىٰ قَوْمِهِ } مستكبراً عليهم، مستغرقاً { فِي زِينَتِهِ } الكاملة؛ إذ هو على بغلة شبهاء - هي الأبلق الذي كثر بياضه على سواده - وعليه ثباب فاخرة حمرٌ كلها تسر الناظر إليها؛ من صفاء لونها وبهائها، وعلى البغلة سرج من ذهب ومعه أربعة آلاف على زيِّة، وقيل: تسعون ألفاً على زيِّه، وعلى خيولهم ومراكبهم أيضاً لبسة حمراء، فخرج الناس معه صافين حوله، ناظرين نحوه، متعجبين من حاله، متمنين من الله رتبته، حيث { قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلْحَيَاةَ ٱلدُّنْيَا } وزينتها، وهمهم مقصور إليها، وغاية متمناهم حصول مثلها لهم: { يٰلَيْتَ لَنَا } من حظوظ الدنيا { مِثْلَ مَآ أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ } [القصص: 79] ونصيبٍ كامل من الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: في زينته: حال، { ويْكَأنه }: مذهب الخليل وسيبويه: أن \" وي \": حرف تنبيه منفصلة عن كَأَنَ، لكن أضيفت لكثرة الاستعمال\n وقال أبو حاتم وجماعة: \" ويك \" هي \" ويلك \" حذفت اللام منها لكثرة الاستعمال\n وقالت فرقة: \" ويكأن \" بجملتها كلمة\n قاله الثعلبي، وقال البيضاوي: ويكأن، عند البصريين، مركب من \" وي \" للتعجب، و \" كأن \" ، للتشبيه\n هـ\n وقال سيبويه: \" وي \": كلمة تنبيه على الخطأ وتَنَدُّمٍ، يستعملها النادم لإظهار ندامته\n يقول الحق جل جلاله: { فخرج } قارونُ { على قومه في زينته } ، قال جابر: كانت زينته القرمز، وهو صبغ أحمر معروف\n قيل: إنه خرج في الحمرة والصفرة، وقيل: خرج يوم السبت على بغلة شهباء، عليها الأرْجُوان، وعليها سرج من ذهب، ومعه أربعة آلاف على زيه، وقيل: عليهم وعلى خيولهم الديباج الأحمر، وعن يمينه ثلاثمائة غلام، وعن يساره ثلاثمائة جارية بيض، عليهن الحليّ والديباج\n { قال الذين يُريدون الحياةَ الدنيا } ، قيل: كانوا مسلمين، وإنما تمنوا، على سبيل الرغبة في اليسار، كعادة البشر، وقيل: كانوا كفاراً، ويرده قوله: { لولا أن مَنّ الله علينا\n\n } إلخ\n { يا ليت لنا مِثْلَ ما أُوتي قارونُ } من المال والجاه، قالوه غِبْطَةً\n والغابط هو الذي يتمنى مثل نعمة صاحبه، من غير أن تزول عنه، والحاسد هو الذي يتمنى أن تكون نعمة صاحبه له، دونه\n وهو كقوله تعالى:\n\n[النساء:32]، وقيل لرسول الله صلى الله عليه وسلم: هل تضر الغبطة؟ فقال:\n\n \" لا\n\n\n \" \n\nالحديث\n { إنه لذو حظٍ عظيم } من الدنيا، والحظ: الجَدُّ، وهو البخت والدولة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:24",
      "similarity": 0.5000506929179418
    },
    {
      "verse": "29:39",
      "similarity": 0.4860107055046889
    },
    {
      "verse": "41:35",
      "similarity": 0.4363655048739795
    },
    {
      "verse": "3:176",
      "similarity": 0.3944240470400817
    },
    {
      "verse": "4:176",
      "similarity": 0.2534206932335321
    }
  ]
}