{
  "chapter": "القصص",
  "text": "قل ارءيتم ان جعل الله عليكم اليل سرمدا الى يوم القيمة من اله غير الله ياتيكم بضياء افلا تسمعون",
  "translations": [
    {
      "translation": "Say: 'What do you think? If Allah made it permanent night for you till the Day of Rising, what god is there other than Allah to bring you light? Do you not then hear?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Just think, if God were to cover you up with night for ever until the Day of Doom, what other god apart from God will give you light? Why do you not pay heed?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), tell them: \"Did you consider: if Allah were to make the night perpetual over you till the Day of Judgement, is there a god other than Allah who can bring forth light for you? Do you not hear?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Think, if God were to cause the night to continue until the Day of Judgment which Lord besides Him could bring you light? Will you then not listen to (His revelations)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “What is your opinion – if Allah makes it night continuously for you till the Day of Resurrection then, other than Allah, who is the God who could bring you light? So do you not heed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me! If Allah made the night continuous for you till the Day of Resurrection, which god besides Allah could bring you light Will you not then hear\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Tell me, if Allah were to make the night to continue incessantly on you till the day of resurrection, who is the god besides Allah that could bring you light? Do you not then hear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If God should make the night unceasing over you, until the Day of Resurrection, what god other than God shall bring you illumination? Will you not hear?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have ye thought, if Allah made night everlasting for you till the Day of Resurrection, who is a god beside Allah who could bring you light? Will ye not then hear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"Tell me, if God were to extend perpetual night over you till the Day of Judgement, is there any deity other than God that could bring you light? Will you not listen?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye, if Allah made night continuous for you till the Day of Resurrection, what god is there beside Allah, who would bring you light? Hearken ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, if Allah were to make the night perpetual for you until the Day of Resurrection, what god other than Allah can bring you light? Will you not listen?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: See ye? If Allah were to make the night perpetual over you to the Day of Judgment, what god is there other than Allah, who can give you enlightenment? Will ye not then hearken?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Tell me! If Allah made night continuous for you till the Day of Resurrection, who is an ilah (a god) besides Allah who could bring you light? Will you not then hear?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Think! What if Allah should enshroud you in unceasing night till the Day of Resurrection, what god, other than Allah, shall bring you light! Will you not hear?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? Had God made the night perpetual over you until the Day of Resurrection, which god other than God will bring you illumination? Do you not hear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if Allah should make for you the night continuous until the Day of Resurrection, what deity other than Allah could bring you light? Then will you not hear?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:71] Say, to the people of Mecca: ‘Have you considered, in other words, inform Me: if God were to make the night everlasting over you until the Day of Resurrection, what god other than God, as you [are wont to] claim, could bring you light?, daylight [hours] during which you could earn [a living]. Will you not then listen?’, to this in a way so as to understand it and so repent of your idolatry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Have ye thought) what do you say, disbelievers, (if Allah made night everlasting) everlastingly dark (for you till the Day of Resurrection) such that you see no day, (who is a god beside Allah) other than Allah (who could bring you light) of day? (Will ye not then hear) will you not obey He who made the day and the night for you?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ ٱلْلَّيْلَ سَرْمَداً } معناه دائمٌ لاَنهَارَ فيهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {If Allah willed, He could have made the night continuous for you} - its meaning is perpetual, because it is daybreak in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن جعل الله عليكم } ليل ظلمة النفس { سرمداً إلى يوم القيامة } الصغرى { من إله غير الله يأتيكم بضياء } من نور الروح { أفلا تسمعون } حال كونكم في الحجاب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أشار سبحانه إلى معظم ما أنعم على عباده من تجدد الملوين\n وتعاقب الجديدين امتناناً لهم\n وحثاً على مواظبة شكره ومداومة ذكره\n والتذكر بإحسانه وإنعامه\n وتعريضاً للمشركين\n فقال آمراً لحبيبه صلى الله عليه وسلم: { قُلْ } أي أكمل الرسل للناس الناسين توالي نعمنا المترادفة مستفهماً إياهم\n مسخبراً منهم على سبيل التنبيه والتذكير: { أَرَأَيْتُمْ } أي: أخبروني أيها المغمورون بنعمي { إِن جَعَلَ ٱللَّهُ } المحول للأحوال\n المدبر لجميع التدابير { عَلَيْكُمُ ٱلْلَّيْلَ } المظلم { سَرْمَداً } ممتداً مستمراً بلا تخلل ضوء بينه { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ مَنْ إِلَـٰهٌ } قادر على إيجاد الضوء في خلال الظلمة { غَيْرُ ٱللَّهِ } على زعمكم الفاسد { يَأْتِيكُمْ بِضِيَآءٍ } تفوزون إلى أمور معاشكم بسببها { أَفَلاَ تَسْمَعُونَ } [القصص: 71] أمثال هذه التذكيرات ولا تفهمون معناها\n ولا تستكشفون عن الحكم والمصالح المدرجة فيها أيها المجبولون على الفهم والاستكشاف؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: سرمداً: مفعول ثان لجعل\n وهو من السرد\n أي: التتابع\n ومنه قولهم في الأشهر الحرم: ثلاثة سرد وواحد فرد\n والميم زائدة\n فوزنه: فعْمَل\n يقول الحق جل جلاله: { قل أرأيتم } أخبروني { إن جعل الله عليكم الليلَ سرمداً } دائماً بإسكان الشمس تحت الأرض\n أو بتحريكها حول الأفق الخارج عن كورة الأرض\n أو بإخفاء نورها\n { مَنْ إلهٌ غيرُ اللهِ يأتيكم بضياءٍ } \n وحقه: هل إله غير الله\n وعبّر بـ \" مَن \" على زعمهم أن غيره آلهة\n أي: هل يقدر أحد على هذا؟ { أفلا تسمعون } سماع تدبر واستبصار؟\n { قل أرأيتم إن جعل الله عليكم النهارَ سرمداً إلي يوم القيامة } بإسكانها في وسط السماء\n أو: بتحريكها فوق الأفق فقط",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:72",
      "similarity": 0.8401304444243414
    },
    {
      "verse": "21:48",
      "similarity": 0.3497728050711993
    },
    {
      "verse": "10:5",
      "similarity": 0.31615927898511886
    },
    {
      "verse": "2:17",
      "similarity": 0.3089947880018068
    },
    {
      "verse": "2:20",
      "similarity": 0.2639310269805153
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/28:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/28:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}