{
  "chapter": "القصص",
  "text": "قال انما اوتيته على علم عندى اولم يعلم ان الله قد اهلك من قبله من القرون من هو اشد منه قوة واكثر جمعا ولا يسـل عن ذنوبهم المجرمون",
  "translations": [
    {
      "translation": "he said, 'I have only been given it because of knowledge I have.' Did he not know that before him Allah had destroyed generations with far greater strength than his and far more possessions? The evildoers will not be questioned about their sins.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This has come to me through my own acumen.\" Did he not know that God had destroyed many generations before him who possessed far more acumen than he, and more wealth? The sinners will not be asked about their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"All this has been given to me on account of a certain knowledge that I have.\" Did he not know that Allah had destroyed before him those who were stronger in might than he and were more numerous in multitude? The wicked are not asked about their acts of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I have received this wealth because of my knowledge.\" Did he not know that God had destroyed many generations that lived before him who were stronger than him in power and people? (There will be no need) to ask the criminals what sins they have committed, (for the angels already know them)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I got this only due to a knowledge I have”; and does he not know that before him Allah destroyed the generations who were stronger than him and more in number? And there is no questioning of the guilty regarding their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This has been given to me only because of the knowledge I possess.\" Did he not know that Allah had destroyed before him generations, men who were stronger than him in might and greater in the amount they had collected But the criminals will not be questioned of their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I have been given this only on account of the knowledge I have. Did he not know that Allah had destroyed before him of the generations those who were mightier in strength than he and greater in assemblage? And the guilty shall not be asked about their faults.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'What I have been given is only because of a knowledge that is in me.' What, did he not know that God bad destroyed before him generations of men stronger than he ill might, and more numerous in multitude? And yet the sinners shall not be questioned concerning their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I have been given it only on account of knowledge I possess. Knew he not that Allah had destroyed already of the generations before him men who were mightier than him in strength and greater in respect of following? The guilty are not questioned of their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he said, \"I have been given it only because of the knowledge I possess.\" Did he not know that God had destroyed before him people who were stronger than he and possessed even greater resources? The guilty are not required to offer explanations of their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I have been vouchsafed this only because of the knowledge that is with me. Knew he not that Allah had destroyed before him, of the generations, those who were stronger than he in might and larger in respect of following? And the culprits shall not be questioned of their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘I have indeed been given [all] this because of the knowledge that I have.’ Did he not know that Allah had already destroyed before him some of the generations who were more powerful than him and greater in amassing [wealth]? The guilty will not be questioned about their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This has been given to me because of a certain knowledge which I have.\" Did he not know that Allah had destroyed, before him, (whole) generations,- which were superior to him in strength and greater in the amount (of riches) they had collected? but the wicked are not called (immediately) to account for their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This has been given to me only because of knowledge I possess.\" Did he not know that Allah had destroyed before him generations, men who were stronger than him in might and greater in the amount (of riches) they had collected. But the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.) will not be questioned of their sins (because Allah knows them well, so they will be punished without account).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he replied: 'What was given me is only because of the knowledge I possess' Did he not know that from the generations before him Allah had destroyed a mightier and more numerous in multitude? The sinners shall not be questioned about their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I was given all this on account of knowledge I possess.” Did he not know that God destroyed many generations before him, who were stronger than he, and possessed greater riches? But the guilty will not be asked about their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I was only given it because of knowledge I have.\" Did he not know that Allah had destroyed before him of generations those who were greater than him in power and greater in accumulation [of wealth]? But the criminals, about their sins, will not be asked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:78] He said, ‘In fact I have been given it, that is, [this] wealth, because of knowledge I possess’, in other words, in return for it — he was the most knowledgeable of the Children of Israel in the Torah, after Moses and Aaron. God, exalted be He, says: Does he not know that God had already destroyed before him generations, communities, of men stronger than him in might and greater in the amassing?, of wealth; in other words, he does know this. And God destroys them, and the guilty will not be questioned about their sins, because of God’s knowledge of these [sins], and so they will be admitted into the Fire without a reckoning.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Korah said: (I have been given it) this wealth (only on account of knowledge I possess) because Allah knows that I deserve it; it is also said that this means: he made gold from his knowledge of alchemy. (Knew he not) i.e. Korah (that Allah had destroyed already of the generations before him men who were mightier than Him in strength) who were physically stronger than him (and greater about following) and greater in respect to the wealth and men they had? (The guilty are not questioned of their sins) the idolaters will not be asked on the Day of Judgement about their sins because they will be known through distinct marks.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع قارون منهم المواعظ والتذكيرات المتعلقة بإصلاح حاله\n النافعة له في الاولى والأخرى أعرض عنهم وعن مقالهم عتواً واستبكاراً\n حيث { قَالَ } مستعظماً بشأنه\n مستبدأ برأيه: { إِنَّمَآ أُوتِيتُهُ } أي: ما أوتيت بما أوتيت من الرزق الصوري إلا { عَلَىٰ عِلْمٍ } حاصلٍ { عِندِيۤ } يعني: منشأ إتيان المال عليَّ وحصولها عندي اتصافي بعلم كامل موجب لحصولها تحصيلها\n أي: ما هي وجمعها إلا بحولي وقوتي وعلمي بطرق تحصيلها\n\n\nإنما قال هذا بطراً واستغناءً\n وكبراً وخيلاءً\n وقيلأ: إنه عالم بعلم الكيمياء\n قال سبحانه رداً عليه على سبيل التعيير والتوبيخ: { أَ } بتفوه ويقول هذا الطاغي الباغي الهالك في تيه الغي والضلال أمثال هذه الخرافات { وَلَمْ يَعْلَمْ } بالتواتر ومطالعة كتب التواريخ\n ومن القصص المثبتة في التوراة { أَنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { قَدْ أَهْلَكَ } واستاصل كثيراً { مِن قَبْلِهِ مِنَ } أهل { ٱلْقُرُونِ } الماضية { مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً } بحسب الأولاد والأتباع { وَأَكْثَرُ جَمْعاً } لحطام الدنيا\n أما يستحي هذا الطاغي المسرف يظهر على الله\n ولم يخف من بطشه وانتقامه بغتةً { وَ } من سرعة نفوذ قضاء الله وقت إرادة إنفاذه عند الغضب على أعدائه { لاَ يُسْأَلُ عَن ذُنُوبِهِمُ ٱلْمُجْرِمُونَ } [القصص: 78] إذ اطلاعه سبحانه بحالهم وضلالهم يكفي في انتقامهم\n فلا يحتاج إلى سؤالهم؟!\n\n\nوبعدما ذكروا عنده من الزواجر والعبر فلم ينزجر ولم يعتبر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { قال } قارون: { إنما أُوتيته } أي: المال { على علم عندي } أي: على استحقاق مني، لِمَا فيّ من العلم الذي فَضلت به الناس، وهو علم التوراة، وكان أعلم الناس به بعد، موسى وهارون، وكان من العباد، ثم كفر بعد ذلك. وذكر القشيري أنه كان منقطعاً في صومعة للعبادة، فصحبة إبليسُ على العبادة، واستمر معه على ذلك، وهو لا يشعر، إلى أن ألقى إليه: إن ما هما عليه، من الانقطاع عن التكسب، وكون أمرها على أيدي الناس، ليس بشيء، فرده إلى الكسب بتدريج، إلى أن استحكم في حب الدنيا والجمع والمنع، ثم تركه. هـ. وقيل: المراد به علم الكيمياء، وكان يأخذ الرصاص والنحاس فيجعلهما ذهبا. أو: العلم بوجوه المكاسب من التجارة والزراعة، أو: العمل بكنوز يوسف. قال تعالى: { أَوَلَمْ يعلم أن الله قد أهلكَ مِنْ قبله من القرون مَنْ هو أشدُّ منه قوةً وأكثرُ جَمْعاً } ، أي: أو لم يكن في علمه، من جملة العلم الذي عنده، أن الله قد أهلك من قبله من القرون من هو أشد منه وأقوى وأغنى، وأكثر جمعاً للمال، أو أكثر جماعة وعددا، وهو توبيخ على اغتراره بقوته وكثرة ماله، مع علمه بذلك لأن قرأه في التوراة، وسمعه من حفاظ التواريخ. أو: نفيٌ لعلمه بذلك لأنه لَمَّا قال: { أُوتيته على علم عندي } قيل له، أعنده مثل ذلك العلم الذي ادعاه ورأى نفسه به مستوجبة لكل نعمة، ولم يعلم هذا العلم النافع، الذي هو الاعتبار بمن هلك قبله، حتى يَقِيَ نفسه مصارع الهالكين. { ولا يُسْئل عن ذنوبهم المجرمون } ، لعلمه تعالى بعملهم، بل يُدخلهم النار بغتة. أو: يعترفون بها بغير سؤال، أو: يُعرفون بسيماهم فلا يُسألون، أو: لا يُسألون سؤال توبيخ، أو لا يُسْأَلُ المجرمون من هذه الأمة عن ذنوب الماضين. قال محمد بن كعب: هو كلام متصل بما قبله، والضمير في ذنوبهم عائد على من أهلك من القرون، أي: أُهلكوا، ولم يُسْأَلُ غيرهم بعدهم عن ذنوبهم، بل كان أحد إنما يُعاتب على ما يخصه. هـ. وإذ قلنا هو في القيامة فقد ورد في آيات أخر أنهم يُسْألون، ويومُ القيامة مواطن وطوائف. والله تعالى أعلم. الإشارة: إذا خص الله عبداً بخصوصية فلا ينسبها لنفسه، أو لحوله وقوته، أو لكسبه ومجاهدته، بل يشهدها منَّةً من الله عليه، وسابق عناية منه إليه، قال سهل رضي الله عنه: ما نظر أحد إلى نفسه فأفلح، والسعيد من صرف بصره عن أفعاله وأقواله، وفتح له سبيل رؤيةِ مِنَّةِ الله عليه، في جميع الأفعال والأقوال. والشقي مَنّ زُيِّنَ له في عينه أفعالهُ وأقوالُه وأحوالُه، ولا فتِحَ له سبيلُ رؤيةِ منَّةِ الله عليه، فافتخر بها وادعاها لنفسه، فشؤمه أن يهلكه كما خسف بقارون. لَمّا ادعى لنفسه فضلاً. هـ. ثم قال تعالى: { فَخَرَجَ عَلَىٰ قَوْمِهِ فِي زِينَتِهِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:13",
      "similarity": 0.4874653502985497
    },
    {
      "verse": "36:31",
      "similarity": 0.38582987438985106
    },
    {
      "verse": "40:21",
      "similarity": 0.38205268574571105
    },
    {
      "verse": "17:17",
      "similarity": 0.3786682212933557
    },
    {
      "verse": "28:43",
      "similarity": 0.36739483871152284
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/28:78.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/28:78.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/28:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}