{
  "chapter": "القصص",
  "text": "قل ارءيتم ان جعل الله عليكم النهار سرمدا الى يوم القيمة من اله غير الله ياتيكم بليل تسكنون فيه افلا تبصرون",
  "translations": [
    {
      "translation": "Say: \"Just think. If God were to make the day perpetual till the Day of Resurrection, what other god but God would bring you night for rest? Why do you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Did you consider: if Allah were to make the day become perpetual over you till the Day of Judgement, is there a god other than Allah who can bring in night for you that you may repose in it? Will you not see?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Do you not think that if God were to cause the day to continue until the Day of Judgment, which Lord besides Him could bring you the night to rest. Do you not see (His signs)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if Allah makes it day continuously for you till the Day of Resurrection then, other than Allah, who is the God who could bring you night for you to rest during it? So do you not perceive?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me! If Allah made the day continuous for you till the Day of Resurrection, which god besides Allah could bring you night wherein you rest Will you not then see\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Tell me, if Allah were to make the day to continue incessantly on you till the day of resurrection, who is the god besides Allah that could bring you the night in which you take rest? Do you not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If God should make the day unceasing over you, until the Day of Resurrection, what god other than God shall bring you night to repose in? Will you not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have ye thought, if Allah made day everlasting for you till the Day of Resurrection, who is a god beside Allah who could bring you night wherein ye rest? Will ye not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Tell me, if God were to extend perpetual day over you till the Day of Judgement -- is there any deity other than God that could bring you night, in which to rest? Will you not then see?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye, if Allah made day continuous for you till the Day of Resurrection, what god is there beside Allah, who would bring you night wherein ye have repose? Behold ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, if Allah were to make the day perpetual for you until the Day of Resurrection, what god other than Allah can bring you night wherein you can rest? Will you not perceive?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: See ye? If Allah were to make the day perpetual over you to the Day of Judgment, what god is there other than Allah, who can give you a night in which ye can rest? Will ye not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Tell me! If Allah made day continuous for you till the Day of Resurrection, who is an ilah (a god) besides Allah who could bring you night wherein you rest? Will you not then see?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What would you think if Allah should make the day unceasing over you till the Day of Resurrection, what god, other than Allah, shall bring you the night to sleep in. Will you not see'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? Had God made the day perpetual over you until the Day of Resurrection, which god other than God will bring you night to rest in? Do you not see?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if Allah should make for you the day continuous until the Day of Resurrection, what deity other than Allah could bring you a night in which you may rest? Then will you not see?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:72] Say, to them: ‘Have you considered, if God were to make the day everlasting over you until the Day of Resurrection, what god other than God, as you [are wont to] claim, could bring you night wherein you rest?, from [any] weariness. Will you not then see?, the error you are upon when you ascribe partners [to God], and so repent of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) also to them, Muhammad: (Have ye thought) what do you say, (if Allah made day everlasting) everlastingly bright (for you till the Day of Resurrection) without night, (who is a God beside Allah) other than Allah (who could, bring you night wherein ye rest? Will ye not then see?) will you not believe He Who made the day and the night for you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { قُلْ } لهم يا أكمل الرسل: { أَرَأَيْتُمْ إِن جَعَلَ ٱللَّهُ } المصلح لجميع حالاتكم { عَلَيْكُمُ ٱلنَّهَارَ } المضيء { سَرْمَداً } مستمراً دائماً بلا لحوق ما يضاده { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ مَنْ إِلَـٰهٌ غَيْرُ ٱللَّهِ } الواحد الأحد، المستقل بالألوهية والربوبية { يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ } وتستريحون من تعبكم اللاحق من أشغالكم { أَفلاَ تُبْصِرُونَ } [القصص: 72] آلاء الله الفائضة عليكم على التعاقب التوالي؛ لإصلاح أحوالكم ليلاً ونهاراً؛ حتى تواظبوا على شكرها، وتداوموا لأداء حقها سراً وجهاراً؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل أرأيتم إن جعل الله عليكم النهارَ سرمداً إلي يوم القيامة } بإسكانها في وسط السماء، أو: بتحريكها فوق الأفق فقط، { مَنْ إِلهٌ غير الله يأتيكم بليلٍ تسكنون فيه } استراحة من متاعب الأشغال؟ ولم يقل: بنهارتتصرفون فيه، كما قال: { بليل تسكنون فيه } ، بل ذكر الضياء، وهو ضوء الشمس لأن المنافع التي تتعلق به متكاثرة، وليس هو التصرف في المعاش وحده، والظلام ليس هو بتلك المنزلة، ومن ثم قرن بالضياء\n { أفلا تسمعون } لأن السمع يدرك ما لا يدركه البصر، من ذكر منافعه، ووصف فوائده، وقرن بالليل { أفلا تُبصرون } لأن غيرك يُبصر من منفعة الظلام ما تبصره أنت من السكون ونحوه",
      "translations": []
    }
  ]
}