{
  "chapter": "القصص",
  "text": "واوحينا الى ام موسى ان ارضعيه فاذا خفت عليه فالقيه فى اليم ولا تخافى ولا تحزنى انا رادوه اليك وجاعلوه من المرسلين",
  "translations": [
    {
      "translation": "We revealed to Musa's mother, 'Suckle him and then when you fear for him cast him into the sea. Do not fear or grieve; We will return him to you and make him one of the Messengers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We conveyed to the mother of Moses: \"Suckle him. If you are afraid for him, cast him in the river without any fear or regret, for We shall restore him to you, and make him an apostle.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We suggested to the mother of Moses: \"Suckle your child, but when you fear for his life cast him into the river and be not fearful nor grieve, for We shall restore him to you and make him one of the Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We inspired Moses' mother saying, \"Breast-feed your son. When you become afraid for his life, throw him into the sea. Do not be afraid or grieved for We shall return him to you and make him a Messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired the mother of Moosa that, “Suckle him; then when you fear for him, cast him into the river and do not fear nor grieve; We shall indeed return him back to you and make him one of the Noble Messengers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired the mother of Musa: \"Suckle him (Musa), but when you fear for him, then cast him into the river and fear not, nor grieve. Verily, We shall bring him back to you, and shall make him one of the Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We revealed to Musa's mothers, saying: Give him suck, then when you fear for him, cast him into the river and do not fear nor grieve; surely We will bring him back to you and make him one of the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We revealed to Moses' mother, 'Suckle him, then, when thou fearest for him, cast him into the sea, and do not fear, neither sorrow, for We shall return him to thee, and shall appoint him one of the Envoys.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired the mother of Moses, saying: Suckle him and, when thou fearest for him, then cast him into the river and fear not nor grieve. Lo! We shall bring him back unto thee and shall make him (one) of Our messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We inspired Moses' mother saying, \"Suckle him, and then, when you fear for him, cast him into the river, and have no fear and do not grieve, for We shall return him to you, and shall make him one of the Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired the mother of Musa, saying: suckle him, then when thou fearest for him, cast him into the river and fear not, nor grieve. Verily We are going to restore him unto thee, and shall make him one of the sent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed to Moses’ mother, [saying], ‘Nurse him; then, when you fear for him, cast him into the river, and do not fear or grieve, for We will restore him to you and make him one of the apostles.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent this inspiration to the mother of Moses: \"Suckle (thy child), but when thou hast fears about him, cast him into the river, but fear not nor grieve: for We shall restore him to thee, and We shall make him one of Our messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired the mother of Musa (Moses), (saying): \"Suckle him [Musa (Moses)], but when you fear for him, then cast him into the river and fear not, nor grieve. Verily! We shall bring him back to you, and shall make him one of (Our) Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed this to Moses' mother: 'Suckle him, but when you fear for him cast him into the water. Neither fear, nor sorrow because We shall restore him to you and make him among the Messengers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We inspired the mother of Moses: “Nurse him; then, when you fear for him, cast him into the river, and do not fear, nor grieve; We will return him to you, and make him one of the messengers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired to the mother of Moses, \"Suckle him; but when you fear for him, cast him into the river and do not fear and do not grieve. Indeed, We will return him to you and will make him [one] of the messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:7] And We revealed, by inspiration or in a dream, to the mother of Moses — who was the said new-born; his sister was the only other person aware of his birth — ‘Suckle him, then, when you fear for him, cast him into the waters, namely, the Nile, and do not fear, that he should drown, or grieve, for being separated from him, for We will restore him to you and make him one of the messengers’. She suckled him for three months during which he never cried. She then began to fear for him and so she placed him in a basket coated with pitch and made as a cradle for him on the inside. She then closed it and cast it into the waters of the Nile at night.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We inspired the mother of Moses) Jochabed the daughter of Levi, the son of Jacob (Yohabadh Bint Lawi Ibn Ya'qub), (saying: Suckle him) suckle this child (and, when you fear for him) to be lost, (then cast him into the river) put him in a chest and then throw the chest in the sea (and fear not) his drowning (nor grieve) for his loss, or because you think he will never return to you. (Lo! We shall bring him back unto thee and shall make him (one) of Our messengers) to Pharaoh and his people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأوحينا إلى أمّ موسى } أي: النفس الساذجة السليمة الباقية على فطرتها وهي اللوّامة { أن أرضعيه } بلبان الإدراكات الجزئية والعلوم النافعة الأولية { فإذا خفت عليه } من استيلاء النفس الأمّارة وأعوانها { فألقيه } في يمّ العقل الهيولاني والاستعداد الأصليّ أو في يمّ الطبيعة البدنية بالإخفاء { ولا تخافي } من هلاكه { ولا تحزني } من فراقه { إنّا رادّوه إليك } بعد ظهور التمييز ونور الرشد { وجاعلوه من المرسلين } إلى بني إسرائيل\n { فالتقطه آل فرعون } من القوى النفسانية الظاهرة عليه\n الغالبة على أمره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما ولد موسى\n و ظهر من أراد به سبحانه زوال ملك فرعون استوحشت أمه\n من وقوف الشرطة عليه وقتله { أَوْحَيْنَآ } وألهمنا { إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ } مهما أمكنك إرضاعه وإخفاؤه { فَإِذَا خِفْتِ عَلَيْهِ } من وقوفهم إياه ضعيه في التابوت { فَأَلْقِيهِ فِي ٱليَمِّ وَلاَ تَخَافِي } من هلاكه وغرقه { وَلاَ تَحْزَنِيۤ } من فراقه { إِنَّا } من وفور لطفنا وعطفنا { رَآدُّوهُ إِلَيْكِ } لتحضنه وتحفظه إلى وقت كبره { وَ } بعدما استوى وبلغ أشده { جَاعِلُوهُ مِنَ } جملة { ٱلْمُرْسَلِينَ } [القصص: 7] المؤيدين بالوحي والإلهام\n وظهور أنواع المعجزات والخوارق من يده\n\n\nوبعدما تفرست أم موسى بوقوف الشرطة وتجسسهم بعدما أرضعته ثلاثة أيام وضعته في التابوت على الوجه المأمور\n وألقته في اليم مفرضة أمرها إلى الله المتكفل بحفظه\n\n\nفذهب البحر بتابوته إلى حذاء دار فرعون فرآه من فيها { فَٱلْتَقَطَهُ آلُ فِرْعَوْنَ } أي: أخذوه وأخرجوه من اليم وأحضروه\n وبعدما كشفوا عنه ستره رأوا وليداً في غاية الحسن والجمال إلى حيث تبهر به عيون الناظر إليه\n بمضغ إبهامه\n فلما رآه فرعون وامرأته وجميع من في بيته من الخدمة أحبوه وأعجبوا حسنه\n وألقينا محبته في قلوبهم جميعاً إلى اتفقوا لحفظه غافلين عن مكرنا معهم { لِيَكُونَ لَهُمْ عَدُوّاً وَحَزَناً } أي: موجب حزن طويل وعداوة مستمرة { إِنَّ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا كَانُواْ خَاطِئِينَ } [القصص: 8] مجبولين على الخطأ في جميع أفعالهم\n ومن جلمتها: محافظة العدو الموجب لأنواع العذاب والنكال في النشأة الأولى والأخرى\n\n\n{ وَقَالَتِ ٱمْرَأَةُ فِرْعَوْنَ } آسية - رضي الله عنها - من كمال محبتها له وتحننها نحوه لفرعون: هو { قُرَّتُ عَيْنٍ لِّي وَلَكَ لاَ تَقْتُلُوهُ } كسائر أبناء إسرائيل على ظن أنه منهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وأوحينا إلى أمِّ موسى } بالإلهام\n أو بالرؤيا\n أو بإخبار ملك كما كان لمريم\n وليس هذا وحي رسالة\n فلا يلزم أن تكون رسولاً\n واسمها: يوحانة\n وقيل: يوخابذ بنت يَصهرُ بن لاوي بن يعقوب\n وقيل: يارخا\n ذكره في الإتقان\n وقلنا: { أن أرضعيه } \" أن \": مفسرة\n أي: أرضعيه\n أو: مصدرية\n بأن أرضعيه ما أمكنك إخفاؤه\n { فإذا خِفْتِ عليه } من القتل { فألقيه في اليمِّ }\n البحر\n وهو نيل مصر\n { ولا تخافي } عليه من الغرق والضياع\n { ولا تحزني } لفراقه\n { إنا رادوه إليك } بوجه لطيف لتُربيه\n { وجاعلوه من المرسلين }\n وفي هذه الآية: أمران\n ونهيان\n وخبران\n وبشارتان\n والفرق بين الخوف والحزن أن الخوف: غم يلحق الإنسان لِتَوَقُّعِ مكروه\n والحزن: غم يلحق الإنسان لواقع أو ماضي\n وهو الآن فراقه والإخطار به\n فنُهيت عنهما\n وبُشرت برده وجعله من المرسلين\n رُوي أنه ذبح\n في طلب موسى\n تسعون ألف وليدٍ\n ورُوي أنها حين ضربها الطلق - وكانت بعض القوابل من الموكلات بحَبَالى بني إسرائيل مَصافية لها\n فعالجتها\n فلما وقع إلى الأرض هالها نور بين عينيّه\n ودخل حُبُه قلبها\n فقالت: ما جئتُ إلا لأقتل ولدك وأُخبر فرعون\n ولكن وجدت لابنك حباً ما وجدت مثله\n فاحفظيه\n فلما خرجت القابلة\n جاءت عيون فرعون فلفَّتْه في خرقة\n ووضعته في تنور مسجور\n ولم تعلم ما تصنع لِما طاش من عقلها\n فطلبوا فلم يجدوا شيئاً\n فخرجوا\n وهي لا تدري مكانه\n فسمعت بكاءه من التنور\n فانطلقت إليه\n وقد جعل الله النار عليه برداً وسلاماً\n فلما ألح فرعون في طلب الولدان أوحى الله إليها بإلقائه في اليمِّ\n فألقته في اليم بعد أن أرضعته ثلاثة أشهر\n رُوي أنها لفته في ثيابه\n وجعلت له تابوتاً من خشب\n وقيل: من بردى\n وسدت عليه بقفل\n وأسلمته ثقة بالله وانتظاراً لوعده سبحانه\n قال ابن مخلص: ألقته في البحر بالغداة\n فرده إليها قبل الظهر\n حُكي أن فرعون كانت له بنتٌ برصاء\n أعيت الأطباء\n فقال الأطباء والسحرة: لا تبرأ إلا من قِبل البحر\n يؤخذ من شبه الإنسان\n فيؤخذ من ريقه وتلطخ به برصها\n فتبرأ\n فقعد فرعون على شفير النيل\n ومعه آسية امرأته\n فإذا بالتابوت يلعب به الموج\n فأخِذ له\n ففتحوه\n فلم يطيقوا\n فدنت آسية\n فرأت في وجه التابوت نوراً لم يره غيرُها\n لِلذي أراد الله أن يكرمها\n ففتحه\n فإذا الصبي بين عينيه نور وقد جعل الله رزقه في إبهامه\n يمصه لبناً\n فأحبته آسية وفرعون\n فلطخت بنت فرعون برصها فبرئت\n فقبَّلته وضمته إلى صدرها\n فقال بعض القواد من قوم فرعون: نظن هذا المولود الذي نحذر منه\n فهمّ فرعون بقتله - والله غالب على أمره - فقالت: آسية: { قُرة عين لي ولك\n\n\n\n } الآية\n وهذا معنى قوله: { فالتقطه آلُ فرعون } أخذه\n قال الزجّاج: وكان فرعون من أهل فارس\n من إصْطَخْر\n والالتقاط: وجدان الشيء من غير طلب ولا إرادة\n ومنه: اللُّقَطَةُ\n لما وُجد ضالاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "65:6",
      "similarity": 0.3703153570046503
    },
    {
      "verse": "28:12",
      "similarity": 0.37025590956401555
    },
    {
      "verse": "20:78",
      "similarity": 0.35511968157028423
    },
    {
      "verse": "7:136",
      "similarity": 0.33438500308412494
    },
    {
      "verse": "28:40",
      "similarity": 0.32012451639481204
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}