{
  "chapter": "القصص",
  "text": "وهو الله لا اله الا هو له الحمد فى الاولى والءاخرة وله الحكم واليه ترجعون",
  "translations": [
    {
      "translation": "He is God. There is no god but He. His alone is praise first and last, and His the judgement, and to Him will you be brought back in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah; there is no god but He. His is the praise in this world and in the Hereafter. His is the command and to Him will all of you be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the only God and it is only He who deserves to be given thanks in this world and in the life to come. Judgment is in His hands and to Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah – there is no God except Him; only His is the praise in this world and in the Hereafter; and only His is the command, and it is towards Him that you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah; La ilaha illa Huwa, His is the praise in the first and in the last, and His is the decision, and to Him shall you be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah, there is no god but He! All praise is due to Him in this (life) and the hereafter, and His is the judgment, and to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is God; there is no god but He. His is the praise in the former as in the latter; His too is the Judgment, and unto Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah; there is no Allah save Him. His is all praise in the former and the latter (state), and His is the command, and unto Him ye will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God: there is no god but Him. All Praise is due to Him in this world and the hereafter. His is the Judgement and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah there is no god but he! His is all praise in the first and in the last, and His is the command, and unto Him ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, there is no god except Him. All praise belongs to Him in this world and the Hereafter. All judgement belongs to Him, and to Him you will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah: There is no god but He. To Him be praise, at the first and at the last: for Him is the Command, and to Him shall ye (all) be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah; La ilaha illa Huwa (none has the right to be worshipped but He). His is all praise, in the first (i.e. in this world) and in the last (i.e. in the Hereafter). And for Him is the Decision, and to Him shall you (all) be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah; there is no god except He. The Praise is His in the former as in the latter. His is the Judgement, to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is God. There is no god but He. To Him belongs all praise in this life, and in the next. And His is the decision, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah; there is no deity except Him. To Him is [due all] praise in the first [life] and the Hereafter. And His is the [final] decision, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:70]   And He is God; there is no god except Him. To Him belongs [all] praise in the former, namely, the life of this world, and in the latter, Paradise. And to Him belongs the judgement, the decree effective in [the case of] all things, and to Him you will be returned, through resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "444 (And He is Allah; there is no god save Him) He has no son or partner. (His is all praise) all gratitude (in the former and the latter) upon the dwellers of the earth and the dwellers of heaven; it is also said that this means: praise, favour and beneficence is upon the inhabitants of the heaven and the earth, (and His is the command) judgement between them, (and unto Him ye will be brought back) after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف يخفى عليه شيء؛ إذ { هُوَ ٱللَّهُ } الواجب لذاته، المستقل في وجوده وظهوره على عروش عموم مظاهره ومصنوعاته بالاستقلال التام والاستيلاء الكامل { لاۤ إِلَـٰهَ } في الوجود سواه، ولا عالم لما ظهر وبطن { إِلاَّ هُوَ } لذلك ثبت { لَهُ ٱلْحَمْدُ } والثناء من ألسنة ذرائر الأكوان، وجميع من رش عليه من رشحات جوده ولمعات وجوده { فِي ٱلأُولَىٰ وَٱلآخِرَةِ } من نشأتي الظهور والخفاء، والبروز والكمون، والقبض والبسط { وَلَهُ ٱلْحُكْمُ } والأمر في الصعود والهبوط، والنزول والعروج، وجميع الشئون والتطورات { وَ } بالجملة: { إِلَيْهِ } لا إلى غيره؛ إذ لا غير في الوجود { تُرْجَعُونَ } [القصص: 70] وتُحشرون، كما أن منه تُبدؤون وتُنشؤون؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الله } المستأثر بالألوهية المختص بها، { لا إله إلا هو } ، تقرير له، كقولك: الكعبة قبلة، لا قبلةَ إلا هي\n { له الحمد في الأولى } أي: في الدنيا، { والآخرة } لأنه المُولي للنعم كلها، عاجلها وآجلها، يحمده المؤمنون في الدنيا، ويحمدونه في الآخرة بقولهم:\n\n[فاطر: 34]،\n\n[الزمر: 74]،\n\n[الزمر: 75]، والتحميد تم على وجه التلذذ لا الكلفة\n { وله الحُكم } القضاء بين عباده، { وإليه تُرجعون } بالبعث والنشور\n وبالله التوفيق\n الإشارة: في الآية تحضيض على ترك التدبير والاختيار، مع تدبير الواحد القهار، وهو أصل كبير عند أهل التصوف، أفرد بالتأليف، وفي الحِكَم: \" أراح نفسك من التدبير، فما قام به غيرك عنك لا تقم به أنت عن نفسك \"\n وقال سهل رضي الله عنه: ذروا التدبير والاختيار، فإنهما يكدران على الناس عيشهم\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: ذروا التدبير وإن كان ولا بد من التدبير، فدبروا ألا تدبروا\n هـ\n والتدبير المذموم: هو ما فيه للنفس حظ، كتدبير أسباب الدنيا، وما تحصل بها من شهواتها، إذا صحبه عزم أو تكرير، وأمَّا ما كان فيما يقرب إلى الله تعالى فهو النية الصالحة، أو لم يصحب تصميم بأن كان عَزْمه محلولاً، أو علقة بمشيئة الله، أو كان خاطراً غير ساكن، فلا بأس به\n\n\nقال القشيري - بعد كلام في وجه اختصاص التدبير بالحق تعالى: لأنه لو لم تنفذ مشيئته واختياره لم يكن بوصف العِزِّ لأن من نفى عن مراده لا يكون إلا ذليلاً، والاختيارُ للحق نعتُ عز، والاختيار للخلق صِفةُ نقصٍ، ونعتُ ملام وقصور، فاختيارُ العَبْدُ على غيرُ مُبَارَكٍ له، لأنه صفة غيرُ مستحِقٍّ لها، ومن اتصف بما لا يليق به افتضح، قال قائلهم:\n\nوالطينةُ إذا ادَّعَت صفة للحقِّ أظهرت رعونتها، فما للمختار والاختيار؟! وما للمملوكِ والمِلْك؟! وما للعبيد في دَسْتِ الملوك؟! قال تعالى: { ما كان لهم الخيرة }\n هـ\n وقال آخر في هذا المعنى:\n\nفإذا علمت، أيها العبد، أن الحق تعالى هو الذي يخلق ما يشاء ويختار، لم يبق لك مع الله اختيار، فالحالة التي أقامك فيها هي التي تليق بك، ولذلك قيل: العارف لا يعارض ما حلّ به، فقراً كان أو غنى\n قال اللجائي في كتاب قطب العارفين: الراضي شبه ميت، لا نفس له، يختار لها، فالفقر والغنى حكمان من حكيم واحد، وهو أعلم سبحانه بعبيده، وما يصلحون به، فمنهم من يصلح للفقر ولا يصلح للغنى، ومنهم من يصلح للغنى ولا يصلح للفقر، ومنهم من يصلح بالمنع ولايصلح بالعطاء، ومنهم من يصلح بالعطاء ولا يصلح بالمنع، ومنهم من يصلح بالبلاء ولا يصلح بالصحة، ومنهم من يصلح بالصحة ولا يصلح بالبلاء، ومنهم من يصلح بالوجهين جميعاً، وهو أعلى رُتبة يشار إليها في غاية هذا الشأن، { وربك يخلق ما يشاء ويختار\n\n\n } الآية، ففي هذه الآية كفاية وتعزية لكل سالك راض عن الله تعالى، لكن لا يعقْلُها ولا يتلذذ بها إلا مشايخ العارفين\n هـ\n وبالله التوفيق\n ثم برهن على انفراده بالخلق والاختيار، فقال: { قُلْ أَرَأَيْتُمْ إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ\n\n\n }\n",
      "translations": []
    }
  ]
}