{
  "chapter": "القصص",
  "text": "ان قرون كان من قوم موسى فبغى عليهم وءاتينه من الكنوز ما ان مفاتحه لتنوا بالعصبة او۟لى القوة اذ قال له قومه لا تفرح ان الله لا يحب الفرحين",
  "translations": [
    {
      "translation": "Qarun was one of the people of Musa but he lorded it over them. We gave him treasures, the keys alone to which were a heavy weight for a party of strong men. When his people said to him, 'Do not gloat. Allah does not love people who gloat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Qarun was of Moses' people, but he began to oppress them. We had given him treasures, so many that a team of wrestlers could hardly lift their keys. His people said to him: \"Do not be exultant. God does not like those who exult.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To be sure, Qarun (Korah) was one of Moses' people; then he transgressed against them. We had bestowed on him such treasure that their very keys would have been raised with difficulty by a whole group of strong people. Once when his people said to him: \"Do not exult, for Allah does not love those who exult (in their riches).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Korah was a man from the people of Moses. This man rebelled against them. We had given him so much treasure that the keys of the stores of his treasures could hardly even be carried by a group of strong people. His people told him, \"Do not be proud of your wealth; God does not love those who are proudly happy of their wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Qaroon was from the people of Moosa – he then oppressed them; and We gave him so many treasures that their keys were a heavy burden for a strong group; when his people said to him, “Do not show off – indeed Allah does not like the boastful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Qarun was of Musa's people, but he behaved arrogantly towards them. And We gave him of the treasures, that of which the keys would have been a burden to a body of strong men. Remember when his people said to him: \"Do not exult. Verily, Allah likes not those who exult.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Qaroun was of the people of Musa, but he rebelled against them, and We had given him of the treasures, so much so that his hoards of wealth would certainly weigh down a company of men possessed of great strength. When his people said to him: Do not exult, surely Allah does not love the exultant;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Korah was of the people of Moses; he became insolent to them, for We had given him treasures such that the very keys of them were too heavy a burden for a company of men endowed with strength. When his people said to him, 'Do not exult; God loves not those that exult;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Korah was of Moses' folk, but he oppressed them; and We gave him so much treasure that the stores thereof would verily have been a burden for a troop of mighty men. When his own folk said unto him: Exult not; lo! Allah loveth not the exultant;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Korah was one of Moses' people, but he behaved arrogantly towards them. We had given him such treasures that their very keys would have weighed down a band of strong men. His people said to him, \"Do not exult in your riches, for God does not love the exultant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Qarun was of the people of Musa; then he behaved arrogantly toward them. And We had vouchsafed him of the treasures whereof the keys would have weighed down a band of strong men. Recall what time his people said unto him: exult not; verily God loveth not the exultant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Korah indeed belonged to the people of Moses, but he bullied them. We had given him so much treasures that their chests indeed proved heavy for a band of stalwarts. When his people said to him, ‘Do not boast! Indeed Allah does not like the boasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Qarun was doubtless, of the people of Moses; but he acted insolently towards them: such were the treasures We had bestowed on him that their very keys would have been a burden to a body of strong men, behold, his people said to him: \"Exult not, for Allah loveth not those who exult (in riches).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Qarun (Korah) was of Musa's (Moses) people, but he behaved arrogantly towards them. And We gave him of the treasures, that of which the keys would have been a burden to a body of strong men. When his people said to him: \"Do not be glad (with ungratefulness to Allah's Favours). Verily! Allah likes not those who are glad (with ungratefulness to Allah's Favours).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": ". Korah was one of Moses' nation. But he was insolent to them, for We had given him such treasures that their very keys were too heavy a burden for even the strong. His people said to him: 'Do not exult; Allah does not love the boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Quaroon belonged to the clan of Moses, but he oppressed them. We had given him treasures, the keys of which would weigh down a group of strong men. His people said to him, “Do not exult; God does not love the exultant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Qarun was from the people of Moses, but he tyrannized them. And We gave him of treasures whose keys would burden a band of strong men; thereupon his people said to him, \"Do not exult. Indeed, Allah does not like the exultant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:76] Indeed Korah belonged to the people of Moses — [being] his paternal and maternal cousin, and he had believed in him [in Moses] — but he became insolent towards them, through [his] disdain, haughtiness and great wealth. For We had given him so many treasures that [the number of] their keys would verily have burdened a group of strong men, in other words, they would have been too heavy for such [men] (the bā’ of [bi’l-‘usbati, ‘a group’] is to render transitive [the intransitive] verb); the number of such [men required] is estimated to be 70, 40 or 10; other estimates are also given. Mention, when his people, the believers among the Children of Israel, said to him, ‘Do not be exultant, in [your] great wealth, an exultation of insolence; truly God does not love the exultant, in such [things];\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Now Korah was of Moses folk) He was Moses' cousin, (but he oppressed them) but he transgressed against Moses, Aaron and their folk. He said: \"Moses has been given messengership and Aaron religious authority while have nothing; this I will not accept\", and he rejected Moses' prophethood (and We gave him so much treasure) wealth (that the stores thereof) the keys of his stores (would verily have been a burden for a troop of mighty men) 40 men carried the keys of his stores. (When his own folk) the folk of Moses (said unto him: Exult not) do not be too proud nor associate partners with Allah; (lo! Allah loveth not the exultant) Allah does not love those who are too proud because of their wealth;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ قَارُونَ كَانَ مِن قَوْمِ مُوسَىٰ } قالَ الإِمامُ زين بن علي عليهما السلام: كَان ابن عَمه رَحمَهُ الله { فَبَغَىٰ عَلَيْهِمْ } أي زادَ عَلَيهِم في الثِياب شِبراً\n\n\n\n\nوقوله تعالى: { مَآ إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِٱلْعُصْبَةِ أُوْلِي ٱلْقُوَّةِ } معناه تَنْهَضُ والعَصبَةُ: الجَماعةُ\n وقال: أربعون رَجلاً\n وقال: كانت مَفاتيحُ كنوزِهِ من جِلودٍ، كُلُّ مَفتاحٍ مَقدارُ أربعِ أصابعٍ\n كُلُّ مِفتاحٍ منها عَلَى خُزانَةٍ\n فكانت تُحملُ عَلَى سِتينَ بَغلاً مُحجلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ قارون كان من قوم موسى } عالماً كبلعم بن باعوراء { فبغى عليهم } لاحتجابه بنفسه وعلمه بالتكّبر والاستطالة عليهم، فغلب عليه الحرص\n ومحبّة الدنيا ابتلاء من الله لغروره واحتجابه برؤيته زينة نفسه بكاملها، فمال هواه إلى الجهة السفلية، فخسف به فيها محجوباً ممقوتاً\n { تلك الدار الآخرة } من العالم القدسيّ الباقي { نجعلها للذين } لا يحتجبون بنفوسهم وصفاتها فتصير فيهم الإرادة الفطرية الطالبة للترقي والعلوّ في سماء الروح هوى نفسانية تطلب الاستعلاء والاستطالة والتكبر على الناس في الأرض، ويصير صلاحهم بطلب المعارف واكتساب الفضائل والمعالي فساداً يوجب جمع الأسباب والأموال وأخذ حقوق الخلق بالباطل { والعاقبة } للمجرّدين الذين تزّكت نفوسهم عن الرذائل المردية والأهواء المغوية\n { إن الذي فرض عليك القرآن } أوجب لك في الأزل عند البداية والاستعداد الكامل الذي هو العقل القرآني الجامع لجميع الكمالات وجوامع الكلم والحكم { لرادّك إلى معاد } ما أعظمه لا يبلغ كنهه ولا يقدر قدره هو الفناء في الله في أحدية الذات والبقاء بالتحقق به بجميع الصفات { قل ربي أعلم من جاء بالهدى } أي: لا يعلم حالي وكنه هدايتي وما أوتيت من العلم اللدني المخصوص به إلا ربي لا أنا ولا غيري، لفنائي فيه عن نفسي واحتجاب غيري عن حالي { ومن هو في ضلال مبين } من هو محجوب عن الحق لعدم الاستعداد وكثافة الحجاب لكون غيري محجوباً عن حال استعدادي فما علمته بل هو العالم به لا أنا، لفنائي فيه وتحققي به\n { وما كنت ترجو أن يلقى إليك الكتاب } كتاب العقل الفرقاني بتفصيل ما جمع فيك لكونك في حجب النشأة مغموراً، وعمّا أودع فيك محجوباً { إلا } أي: لكن ألقى إليك لتجلي صفة الرحمة الرحيمية { من ربّك } وظهور فيضها فيك شيئاً فشيئاً حتى صارت وصفك { فلا تكوننّ ظهيراً للكافرين } المحجوبين باحتجابك بها عن الفناء في الذات، فتظهر أنائيتك برؤية كمالها { ولا يصدّنك عن آيات الله } وتجليات صفته فتقف مع أنائيتك كوقوفهم مع الغير فتكون من المشركين بالنظر إلى نفسك وإشراكها بالله في الوجود { وادع إلى ربّك } به لا إلى نفسك بها، فإنك الحبيب، والحبيب لا يدعو إلى نفسه ولا يكون بنفسه بل إلى حبيبه بحبيبه { لا إله إلاّ هو } فلا تدع معه غيراً لا نفسك ولا غيرها\n فمن امتثال قوله: { وَٱدْعُ إِلَىٰ رَبِّكَ } حصل له وصف ما طغى ومن قوله: { ولا تدع مع الله } ،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تذكيراً للمؤمنين وعبرةً لهم عن تفظيع حال من تكبر على الله، وعتا على كليمه، وخرج عن ربقة الإيمان وقلادة الإخلاص معه؛ بسبب ما بسط الله عليه من حطام الدنيا ومن زخرفاها ابتلاءً وفتنةً: { إِنَّ قَارُونَ } المتجبر المتكبر الذي ظهر على الله و على رسوله متفخراً بماله وجاهه { كَانَ مِن قَوْمِ مُوسَىٰ } أي: من جملة من آمن له وصدقه، قيل: هو ابن عمته، وقيل: ابن خالته، وكان أميراً بين بين إسرائيل قد أمَّره عليهم فرعون، وبعدما ظهر موسى وهارون فآمن له وحفظ التوراة وأحسن حفظه إلى حيث يقرؤه عن ظهر القلب، ثمَّ لمَّا استولى موسى وأخوه على مملكة العمالقة، وانقرض الفراعنة رأساً حسدهما قارون، وأنكر جاههما إتكاءً بما عنده من الكنوز، فقال يوماً لموسى: لك الرسالة ولأخيك الحبور، وأنا في غير شيءٍ إلى متى أصبر؟! { فَبَغَىٰ عَلَيْهِمْ } وقصدهم مغالبتهم\n\n\n\n\n{ وَ } ما ذلك إلا أن { آتَيْنَاهُ } وأعطينا له مكراً له، وافتناناً عليه { مِنَ ٱلْكُنُوزِ } أي: الأموال التي عهد ادخارها من الذهب والفضة وغيرهما، وبلغت من الكثرة إلى { مَآ إِنَّ مَفَاتِحَهُ } أي: إلى حد مفاتح أقفال مخازنه، وأقفال الصناديق الموضوعة فيها المختومة المقفولة { لَتَنُوءُ } وتثقل من كثرتها { بِٱلْعُصْبَةِ } أي: الجماعة الكثيرة من الحفظة، مع أنهم من { أُوْلِي ٱلْقُوَّةِ } أقوياء على حمل الثقيل جداً، وكان مفتخراً بها بطراً، فرحاناً يمشي على وجه الأرض خيلاء { إِذْ قَالَ لَهُ قَوْمُهُ } أي: بعض منهم من أقربائه وقرنائه بعدما أبصروا بطره المفرط نهياً له، وتشنيعاً عليه، وحثاً له على الإنفاق والصرف في سبيل الخيرات: { لاَ تَفْرَحْ } بما عندك من الزخرفة الفانية فإنها عن قريب ستفوت، وأخرجها من قلبك { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { لاَ يُحِبُّ ٱلْفَرِحِينَ } [القصص: 76] منهم، سيما بحطام الدنيا ومزخرفاتها الملهية عن اللذات الروحانية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" قارون \": غير مصروف للعجمة والتعريف، ولو كان \" فاعولاً \" من قرنت الشيء، لا نصرف لخروجه عن العجمة\n { إذ قال }: ظرف لبَغَى أي: طغى حين وُعِظ، ولم يقبل ما وُعظ به، أو: يتعلق بمقدر، أي: أظهر التفاخر بالمال حين قال له قومه: لا تفرح\n و \" ما \": موصولة، و \" إنَّ مفاتحه \": صلته، ولذلك كسرت\n يقول الحق جل جلاله: { إنَّ قارون كان من قوم موسى } كان إسرائيلياً، ابن عم لموسى وابن خالته، فهو قارون بن يصهر بن قَاهَث بن لاوي بن يعقوب، وموسى بن عمران بن قاهَث\n وكان يسمى \" المنور \" لحُسن صورته وكان آمن بموسى، وكان أحفظ الناس للتوراة، ولكنه نافق كما نافق السامري\n { فَبَغَى عليهم } ، من البغي، أي: الظلم: قيل: ملَّكه فرعون على بني إسرائيل فظلمهم\n أو: من البغي، أي: الكبر، أي: تكبر عليهم بكثرة ماله وولده، وزاد عليهم في الثياب شبراً، فطلب الفضل عليهم وأن يكونوا تحت يده\n { وآتيناه من الكنوز ما } الذي { إنَّ مفاتِحَه } جمع مِفتح، بمعنى المقَلد، أي: إن مقاليده { لَتَنُوءُ } أي: تثقل { بالعُصْبَةِ } ، الباء للتعدية، يقال: ناء به الحمل: أثقله حتى أماله\n والعصبة: الجماعة الكثيرة، وكانت مفاتح خزائنه وقرَ ستين بغلاً، لكل خزانة مفتاح، ولا يزيد المفتاح على إصبع\n وكانت من جلود، أي: مغاليقها\n وقيل: معنى تنوء: تنهض بِتَكَلُّفِ، ويكون حينئذٍ في الكلام قلب إذ العصبة هي التي تنوء بالمفاتيح، لا العكس، قيل: وسميت أمواله كنوزاً لأنه كان لايؤدي زكاتها، وبسبب ذلك عادى موسى أول عداوته\n { إذْ قال له قومُه لا تفرح } لا تبطر بكثرة المال فرَح إعجاب لأنه يقود إلى الطغيان\n أو: لا تفرح بالدنيا إذ لا يفرح بها إلا من لا عقل له، { إن الله لا يُحب الفَرِحِين: } البطرين المفتخرين بالمال، أو: الفرحين بزخارف الدنيا، من حيث حصول حظوظهم وشهواتهم فيها\n قال البيضاوي: الفرح بالدنيا مذموم مطلقاً لأنه نتيجة حبها والرضا بها، والذهول عن ذهابها، قإن العلم بأن ما فيها من اللذة مفارق لا محالة، يوجب التوخي لا محالة، كما قيل:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:39",
      "similarity": 0.23319814108685158
    },
    {
      "verse": "28:79",
      "similarity": 0.2300468714312882
    },
    {
      "verse": "40:24",
      "similarity": 0.22821127076766154
    },
    {
      "verse": "12:8",
      "similarity": 0.21355838397291707
    },
    {
      "verse": "24:11",
      "similarity": 0.1902338925956389
    }
  ]
}