{
  "chapter": "القصص",
  "text": "ونزعنا من كل امة شهيدا فقلنا هاتوا۟ برهنكم فعلموا۟ ان الحق لله وضل عنهم ما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "We will drag out a witness from each nation and will say, 'Produce your evidence!' They will know then that the truth is with Allah and that what they invented has forsaken them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall single out one witness from each community and say: \"Bring your proof.\" Then will they know that God's is the judgement, and what they contrived will avail them not in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from each people We shall draw a witness, and shall say to them: \"Do produce your evidence now.\" Then they shall know that the Truth is with Allah alone, and the lies which they had invented will forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall call from every nation a witness and shall ask them to bring proof (in support of their belief). They will know that truth belongs to God and that whatever they had falsely invented has abandoned them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall proclaim taking out a witness from each group, “Bring your proof” – so they will realise that the Truth (Right) is for Allah, and they will lose all that they had fabricated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall take out from every nation a witness, and We shall say: \"Bring your proof.\" Then they shall know that the truth is with Allah, and the lies which they invented will disappear from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will draw forth from among every nation a witness and say: Bring your proof; then shall they know that the truth is Allah's, and that which they forged shall depart from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall draw out from every nation a witness, and say, 'Produce your proof!' Then will they know that Truth is God's, and there shall go astray from them that they were forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall take out from every nation a witness and We shall say: Bring your proof. Then they will know that Allah hath the Truth, and all that they invented will have failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall bring forth from every people a witness and We shall say to them: \"Bring your proof.\" Then they will know that truth belongs to God alone, and that which they used to invent will fall away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall take out from every community a witness and We shall say: come forth with your proof; then they shall know that the truth was Allah's, and astray will go from them that which they were wont to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall draw from every nation a witness and say, ‘Produce your evidence.’ Then they will know that all reality belongs to Allah and what they used to fabricate will forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from each people shall We draw a witness, and We shall say: \"Produce your Proof\": then shall they know that the Truth is in Allah (alone), and the (lies) which they invented will leave them in lurch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall take out from every nation a witness, and We shall say: \"Bring your proof.\" Then they shall know that the truth is with Allah (Alone), and the lies (false gods) which they invented will disappear from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From every nation We will bring a witness, and We shall say to them: 'Produce your proof' Then they shall know the truth is with Allah, and their own fabrications will forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will draw out from every community a witness, and say, “Produce your evidence.” Then they will realize that the truth is God’s, and those they used to invent have forsaken them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will extract from every nation a witness and say, \"Produce your proof,\" and they will know that the truth belongs to Allah, and lost from them is that which they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:75] And We shall draw, bring forth, from every community a witness, and this will be their prophet, who will bear witness against what they say, and We shall say, to them: ‘Produce your evidence’, for [the justification of] the idolatry which you asserted. Then they will know that the right, to divineness, is God’s — none share it with Him. And that which they used to invent, in this world, of His having an associate, exalted be He [high] above such [associations], will fail them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَنَزَعْنَا مِنْ كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا بُرْهَانَكُمْ فَعَلِمُوا أَنَّ الْحَقَّ لِلَّهِ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ (75)، وإما لأن الواو للحال وهي يعقبها الماضي ب ( قد ) وبدون ( قد ) أي يوم يكون ذلك النداء وقد أخرجنا من كل أمة شهيداً عليهم وأخرجنا من هؤلاء شهيداً وهو محمد صلى الله عليه وسلم كما قال تعالى { ويوم نبعث في كل أمة شهيداً عليهم من أنفسهم وجئنا بك شهيداً على هؤلاء } \\[ النحل : 89 \\] . وشهيد كل أمة رسولها .والنزع : جذب شيء من بين ما هو مختلط به واستعير هنا لإخراج بعض من جماعة كما في قوله تعالى { ثم لننزعن من كل شيعة أيهم أشد على الرحمان عتياً } في سورة مريم ( 69 ) . وذلك أن الأمم تأتي إلى المحشر تتبع أنبياءها ، وهذا المجيء الأول ، ثم تأتي الأنبياء مع كل واحد منهم من آمنوا به كما ورد في الحديث \" يأتي النبي معه الرهط والنبي وحده ما معه أحد» . \"والتُفت من الغيبة إلى التكلم في { ونزعنا } لإظهار عظمة التكلم ، وعطف { فقلنا } على { ونزعنا } لأنه المقصود . والمخاطب ب { هاتوا } هم المشركون ، أي هاتوا برهانكم على إلهية أصنامكم .و { هاتوا } اسم فعل معناه ناولوا ، وهات مبني على الكسر . وقد تقدم في قوله تعالى { قل هاتوا برهانكم إن كنتم صادقين } في سورة البقرة ( 111 ) ، واستعيرت المناولة للإظهار .والأمر مستعمل في التعجيز فهو يقتضي أنهم على الباطل فيما زعموه من الشركاء ، ولما علموا عجزهم من إظهار برهان لهم في جعل الشركاء لله أيقنوا أن الحق مستحق لله تعالى ، أي علموا علم اليقين أنهم لا حق لهم في إثبات الشركاء وأن الحق لله إذ كان ينهاهم عن الشرك على لسان الرسول في الدنيا ، وأن الحق لله إذ ناداهم بأمر التعجيز في قوله { هاتوا برهانكم } .و { ما كانوا يفترون } يشمل ما كانوا يكذبونه من المزاعم في إلهية الأصنام وما كانوا يفترون له الإلهية من الأصنام ، كل ذلك كانوا يفترونه .والضلال : أصله عدم الاهتداء إلى الطريق . واستعير هنا لعدم خطور الشيء في البال ولعدم حضوره في المحضر من استعمال اللفظ في مجازيه .و { عنهم } متعلق بفعل { ضل } . والمراد : ضل عن عقولهم وعن مقامهم؛ مثلوا بالمقصود للسائر في طريق حين يخطىء الطريق فلا يبلغ المكان المقصود . وعلق بالضلال ضمير ذواتهم ليشمل ضلال الأمرين فيفيد أنهم لم يجدوا حجة يروجون بها زعمهم إلهية الأصنام ، ولم يجدوا الأصنام حاضرة للشفاعة فيهم فوجموا عن الجواب وأيقنوا بالمؤاخذة .\n\n",
      "translations": [
        {
          "translation": "(And We shall take out from every nation a witness) a prophet who will testify against them, i.e. that he conveyed the message to them; this prophet is the prophet who was sent to them in the life of the world (and We shall say: Bring your proof) why did you reject the messengers? (Then they will know) each nation will know (that Allah hath the Truth) that the worship of Allah and the religion of Allah are the Truth, and that their judgement is up to Allah, (and all that they invented) all that which they falsely worshipped (will have failed them) will become too preoccupied with themselves to help them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ونزعنا من كل أمّة شهيداً } أي: نُخْرج يوم القيامة عند خروج المهدي من كل أمّة نبيهم هو أعرفهم بالحق { فقلنا } على لسان الشهيد الذي يشهد الحق بشهود الكل ولا يحتجب بهم عنه { هاتوا برهانكم } على ما أنتم عليه أحق هو أم لا؟ فعجزوا عن آخرهم وظهر برهان النبيّ { فعلموا أن الحق لله } أظهره مظهر الشهيد { وضلّ عنهم } مفترياتهم من المذاهب المختلقة والطرق المتشعبة المتفرّقة\n أو قلنا للشهداء\n { هاتوا برهانكم } بإظهار التوحيد\n فأظهروا\n فعلموا أن الحقّ لله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما بهتوا وسكتوا من الجواب { نَزَعْنَا } وأخرجنا { مِن كُلِّ أُمَّةٍ شَهِيداً } يشهد عليهم جميع ما صدر عنهم وجرى عليهم في دار الاختبار\n والشهيد هو النبي المبعوث إليهم حين انحرافهم عن سبيل الاستقامة { فَقُلْنَا } للأمم بعد نزع شهدائهم: { هَاتُواْ } أيها الضالون { بُرْهَانَكُمْ } أي: مستندكم ودليلكم الذي أنتم تضلون لأجله وتشركون بسببه\n وتنحرفون عن جادة العدالة وسبيل السلامة بمتابعة { فَعَلِمُوۤاْ } حنيئذٍ { أَنَّ ٱلْحَقَّ } أي: اللياقة والاستحقاق على العبادة { لِلَّهِ } الحقيق بالحقية\n الجدير بالألوهية اللائق بالربوبية\n ليس كمثله شيء يُعبد له ويُرجع إليه { وَ } بعدما جاء الحق وزهق الباطل { ضَلَّ } أي: غاب وخفي حنيئذٍ { عَنْهُمْ مَّا كَانُواْ يَفْتَرُونَ } [القصص: 75] المعبودية إليه وينسبون الألوهية والربوبية نحوه جهلاً وعناداً\n ويدعون اشتراكه مع الله في استحقاق العبادة والرجوع إليه لدى الحاجة\n\n\nثمَّ قال سبحانه تذكيراً للمؤمنين وعبرةً لهم عن تفظيع حال من تكبر على الله\n وعتا على كليمه\n وخرج عن ربقة الإيمان وقلادة الإخلاص معه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ونزعنا } وأخرجنا { من كل أُمةٍ شهيداً } \n وهو نبيهم\n يشهد عليهم بما كانوا عليه لأن الأنبياء شهداء على أممهم\n { فقلنا } للأمم: { هاتوا برهانكم } على صحة ما كنتم عليه من الشرك ومخالفة الرسول\n { فعلموا } حينئذٍ { إن الحق لله } في الألوهية\n لا يشاركه فيها غيره\n { وضل عنهم } غاب غيبة الشيء الضائع { ما كانوا يَفترون } من ألوهية غير الله وشفاعة أصنامهم\n\nوالله تعالى أعلم\n الإشارة: دوام ليل القبض يمحق البشرية\n ودوام نهار البسط يُطغي النفس\n وتخالفهما على المريد رحمة\n وإخراجه عنهما عناية\n وفي الحكم: \" بسطِك كي لا يتركك مع القبض\n وقبضك كي لا يتركك مع البسط\n وأخرجك عنهما كي لا تكون لشيء دونه \"\n وقال فارس رضي الله عنه: القبض أولاُ\n ثم البسط\n ثم لا قبض ولا بسط\n لأن القبض والبسط يقعان في الوجود وأما مع الفناء والبقاء فلا\n هـ\n ولما قال الله تعالى: { وما أوتيتم من شيء فمتاع الحياة الدنيا } ذكر من متَّعه بها وغرته\n فقال: { إِنَّ قَارُونَ كَانَ مِن قَوْمِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:24",
      "similarity": 0.8224500430484699
    },
    {
      "verse": "2:111",
      "similarity": 0.7602348745150469
    },
    {
      "verse": "27:64",
      "similarity": 0.7592892786998615
    },
    {
      "verse": "4:174",
      "similarity": 0.3936784379283741
    },
    {
      "verse": "23:117",
      "similarity": 0.3804053691274299
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}