{
  "chapter": "القصص",
  "text": "وقال الذين اوتوا۟ العلم ويلكم ثواب الله خير لمن ءامن وعمل صلحا ولا يلقىها الا الصبرون",
  "translations": [
    {
      "translation": "But those who had been given knowledge said, 'Woe to you! Allah's reward is better for those who have iman and act rightly. But only the steadfast will obtain it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who knew better, said: \"Alack-a-day! God's guerdon is better for those who believe and do the right. Only those who persevere will receive it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those endowed with true knowledge said: \"Woe to you. The reward of Allah is best for those who believe and act righteously. But none except those who are patient shall attain to this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people who had received knowledge would tell them, \"Woe to you! The reward of God is far better for the righteously striving believers. No one can receive such reward except those who exercise patience.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said those who were given the knowledge, “Woe to you – the reward of Allah is better for one who accepts faith and does good deeds; and only those who are patient will receive it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been given knowledge said: \"Woe to you! The reward of Allah is better for those who believe and do righteous deeds, and this none shall attain except the patient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were given the knowledge said: Woe to you! Allah's reward is better for him who believes and does good, and none is made to receive this except the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those to whom knowledge had been given said, 'Woe upon you! The reward of God is better for him who believes, and works righteousness; and none shall receive it except the steadfast.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been given knowledge said: Woe unto you! The reward of Allah for him who believeth and doeth right is better, and only the steadfast will obtain it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those who had been given knowledge said, \"Woe to you, God's reward is better for those who believe and do good deeds: and it is awarded only to those who are steadfast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had been vouchsafed the knowledge said: woe unto you! the reward of Allah is best for him who believeth and worketh righteously and none shall attain it except the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given knowledge said [to them], ‘Woe to you! Allah’s reward is better for someone who has faith and acts righteously, and no one will receive it except the patient.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been granted (true) knowledge said: \"Alas for you! The reward of Allah (in the Hereafter) is best for those who believe and work righteousness: but this none shall attain, save those who steadfastly persevere (in good).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been given (religious) knowledge said: \"Woe to you! The Reward of Allah (in the Hereafter) is better for those who believe and do righteous good deeds, and this none shall attain except those who are patient (in following the truth).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those to whom knowledge had been given said: 'Alas for you! Better is the reward of Allah for him who believes and does good works; but none shall receive it except the patient'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were given knowledge said, “Woe to you! The reward of God is better for those who believe and do righteous deeds.” Yet none attains it except the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been given knowledge said, \"Woe to you! The reward of Allah is better for he who believes and does righteousness. And none are granted it except the patient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:80] But those to whom knowledge had been given, [knowledge] of what God had promised in the Hereafter, said, to them: ‘Woe to you! (waylakum, is an expression of reprimand) God’s reward, of Paradise in the Hereafter, is better for him who believes and acts righteously, than what Korah has been given in this world; and none will obtain it, namely, the Paradise that is given as a reward, except those who are steadfast’, in [their adherence to] obedience and [refrain] from disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "But those who had been given knowledge) the knowledge of abstinence and trust in Allah (said) to the desirous ones: (Woe unto you!) may Allah straiten this worldly life for you! (The reward of Allah) in Paradise (for him who believeth) in Allah and in Moses (and doeth right) sincerely between him and his Lord (is better, and only the steadfast will obtain it) only those who are patient in fulfilling the commands of Allah and in withstanding misfortunes will obtain Paradise; it is also said that this means: no one will be given success to enjoin good and forbid evil except those who are patient in fulfilling the commands of Allah and withstanding misfortunes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ يُلَقَّاهَآ إِلاَّ ٱلصَّابِرُونَ } معناه لا يُوفق لَها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } اللدني والمعرفة الكاملة وبالنشأة الأخرى؛ رداً عليهم وإزالةً لحسرتهم، وردعاً لهم عن متمناهم على أبلغ وجه وآدكده: { وَيْلَكُمْ } أي: يلزمكم ويلكم، ويحل عليكم هلاككم أيها القاصرون عن معرفة الحق، وما يترتب عليها من المكاشفات والمشاهدات التي ما لا عينٌ رأت، ولا أذنٌ سمعت، ولا خطر على قلب بشر، بل { ثَوَابُ ٱللَّهِ } المحسن المفضل، ورضاه من عبده { خَيْرٌ } من الدنيا وما فيها من أضعافها وآلافها { لِّمَنْ آمَنَ } له احتساباً على نفسه { وَعَمِلَ صَالِحاً } أي: قرنَ إيمانه بالعمل الصالح إحساناً منه بالنسبة إليه سبحانه، وطلباً لمرضاته { وَ } بالجملة: { لاَ يُلَقَّاهَآ } أي: لا يصل إلى هذه المثوبة العظمى، والدرجة العليا التي أعدها الله لعباده { إِلاَّ ٱلصَّابِرُونَ } [القصص: 80] على ما جرى عليهم من البليات، وعلى مشاق الطاعات ومتاعب العبادات، والرضا بما أعطاهم الحق ورزقهم من الحظوظ بلا تمنٍ منهم، ولا تحسرٍ إلى مرتبة أحد من أصحاب الجاه والثروة، بل هم بما عندهم راضون، وبما أعطاهم الحق على مقتضى قسمته الأزلية متمكنون مطمئنون، ألا أنهم هم المؤمنون حقاً وأولئك الفائزون المفلحون؟!\n\n\n\n\nربنا اجعلنا من زمرتهم بمنِّك العظيم وجودك الكريم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقال الذين أُوتوا العلمَ } بالثواب والعقاب وفناء الدنيا، أو: أتوا العلم بالله، فيؤخذ منه: أن متمني الدنيا جاهل ولو كان أعلم الناس إذ لا يتمناها إلا المحب لها، وهي رأس الفتنة\n فأيّ علم يبقى مع فتنة الدنيا؟! قالوا في وعظهم لغابطي قارون: { وَيْلَكُمْ } هلاكاً لكم، فأصل ويلك: الدعاء بالهلاك، ثم استعمل في الزجر والردع على ترك ما لا يرضى\n وقال في التبيان في إعراب القرآن: هو مفعول بفعل محذوف، أي: ألزمتكم الله ويلكم، { ثوابُ الله } في الآخرة، { خير لمن آمن وعَمِلَ صالحاً } مما أوتي قارون، بل من الدنيا وما فيها، { ولا يُلقَّاها } أي: لا يلقى هذه الكلمة التي تكلم بها العلماء، وهي ثواب الله خير، { إلا الصابرون }\n أو: لا يلقى هذه القوة والعزيمة في الدين إلا الصابرون على الطاعات وعن الشهوات وزينة الدنيا\n وفي حديث الترمذي: أن رسول الله صلى الله عليه وسلم قال:\n\n \" من ترك اللباس - أي: الفاخر - تواضعاً لله تعالى، وهو يَقْدِرُ عليه، دعاهُ الله على رؤوس الخلائق، حتى يُخَيِّره من أي حُلل الإيمانِ شاء يَلْبَسُهَا \" \n\n \n\nوفيه أيضاً عنه عليه الصلاة والسلام:\n\n \" لَيْسَ لابن آدَمَ حقٌّ في سوى هذِهِ الخِصَال بيتٌ يَسْكُنُهُ، وَثَوْبٌ يُوَارِي عَوْرَتَه، وجلَف الخُبْزِ وَالْمَاءِ \" \n\nأي: ليس معه إدام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:103",
      "similarity": 0.5819929877982504
    },
    {
      "verse": "3:148",
      "similarity": 0.4910403375259069
    },
    {
      "verse": "83:36",
      "similarity": 0.48183888716129364
    },
    {
      "verse": "4:134",
      "similarity": 0.45262234077146163
    },
    {
      "verse": "74:4",
      "similarity": 0.44636915840782276
    }
  ]
}