{
  "chapter": "القصص",
  "text": "فخسفنا به وبداره الارض فما كان له من فئة ينصرونه من دون الله وما كان من المنتصرين",
  "translations": [
    {
      "translation": "We caused the earth to swallow up both him and his house. There was no group to come to his aid, besides Allah, and he was not someone who is helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We opened up the earth and sunk him and his mansion. There was not a body that could help him against (the will) of God, nor was he able to save himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At last We caused the earth to swallow him and his house. Thereafter there was no group of people that could come to his aid against Allah; nor was he able to come to his own aid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We caused the earth to swallow up him and his home. No one besides God could help him nor could he himself achieve victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore buried him and his house into the earth; so he had no group to help save him from Allah; nor could he take revenge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We caused the earth to swallow him and his dwelling place. Then he had no group to help him against Allah, nor was he one of those who could save themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We made the earth to swallow up him and his abode; so he had no body of helpers to assist him against Allah nor was he of those who can defend themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made the earth to swallow him and his dwelling and there was no host to help him, apart from God, and he was helpless;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We caused the earth to swallow him and his dwelling-place. Then he had no host to help him against Allah, nor was he of those who can save themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We caused the earth to swallow up him and his home: there was no one to help him against God, nor could he defend himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sank the earth with him and his dwelling-place. And he had no host to defend him against Allah, nor was he of those who could defend themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We caused the earth to swallow him and his house, and he had no party that might protect him from Allah, nor could he rescue himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We caused the earth to swallow up him and his house; and he had not (the least little) party to help him against Allah, nor could he defend himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We caused the earth to swallow him and his dwelling place. Then he had no group or party to help him against Allah, nor was he one of those who could save themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We caused the earth to swallow him, together with his dwelling, and there was no host to help him, other than Allah; and he was not amongst the victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We caused the earth to cave in on him and his mansion. He had no company to save him from God, and he could not defend himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused the earth to swallow him and his home. And there was for him no company to aid him other than Allah, nor was he of those who [could] defend themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:81] So We caused the earth to swallow him, Korah, and his dwelling, and he had no host to help him besides God, that is, other than Him, to protect him from destruction, nor was he of those who can rescue themselves, from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So We caused the earth to swallow him and his dwelling-place) We cause the earth to swallow Korah and his house. (Then he had no host) no group or troop (to help him against Allah) against Allah's punishment when it came on him, (nor was he of those who can save themselves) from the torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَا كَانَ لَهُ مِن فِئَةٍ } معناه أعوانَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"There is no group for him,\" means the leaders.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أمهلناه زماناً\n ورفهناه نشطاً فرحاناً\n أخذناه غضباناً { فَخَسَفْنَا بِهِ وَبِدَارِهِ ٱلأَرْضَ } قلقاً حيراناً\n يعني: طبقنا الأرض عليه وعلى أمواله وخزائنه بعدما أخذتها وابتلعتها امتثالاً لأمر موسى الكليم - صلوات الله عليه وسلامه - وذلك أنه كان يؤذي موسى دائماً حسداً عليه\n وكان موسى يداريه صيانةً لقرابته\n\n\nثمَّ لمَّا نزلت الزكاة صالح معه من كل ألفٍ بواحدة من أي جنس كان فحاسبه\n فبلغ مبلغاً عظيماً فاستكثره فمنعه\n فعمد إلى أن يفضح موسى بين بين إسرائيل بغياً عليه وعدواناً فبرطل بغيِّة\n وأعطى لها رشوة\n لترمي موسى بنفسها\n\n\nفلمَّا كان يوم عبدٍ قام موسى خطيباً\n فقال في خطبته: من سرق قطعناه\n ومن زنى غير محصن جلدناه\n ومن زنى محصناً رجمناه\n فقال قارون: ولو أنت يا موسى\n قال: ولو كنت أنا؟! قال: إن بني إسرائيل يزعمون أنك فجرت مع فلانة\n قال موسى: فأحضروها فأُحصرت\n فناشدها موسى بالله الذي فلق البحر\n وأنزل التوراة أن تصدق\n فقالت بإلقاء الله في قلبها كرامةً لموسى\n وتنزيهاً له عمَّا لا يليق بشأنه\n وتفيضحاً لقارون: جعل لي قارون جعلاً كذا\n على أمن أرميك بنفسي\n فخر موسى ساجداً\n فقال في سجدته: إليه إن كنت نبيك ورسولك فانصرني واخذل عدوي\n فأوحى الله في سجدته: أن مُر الأرض أي شيء شئت\n فتجيبك يا موسى\n\n\nفرفع رأسه من سجدته مرتعداً غيوراً غضباناً\n فقال يا أرض خذيه فابتلعته على الفور إلى ركبته\n فأخذ يتضرع: يا موسى ارحمني! فأنا قرابتك\n ثمَّ قال موسى مغاضباً على الأرض: خذيه! فأذخته إلى وسطه\n فازداد في تضرعه وتفزعه\n ثمَّ قال: خذيه! فأخذته إلى عنقه\n فتضرع وصرخ نحو موسى من أول أخذه إلى خسفه سبعين مرة لم يرحم عليه\n ثمَّ قال: خذيه! فخسفت به وطبقت عليه\n فلم يرحمه حتى عاتبه سبحانه: ما أفظّك يا موسى! حتى استرحمك سبعين مرة فلم ترعه\n فوعزتي وجلالي: لو دعاني مرة لأجبته\n\n\nوبعدما خُسف قارون قال بنو إسرائيل: إنما قلته ليرث أمواله\n فأشعر بهم موسى فأمر الأرض بخسف داره وأمواله وخزائنه إلى حيث لم يبق من منسوباته شيء على وجه الأرض { فَمَا كَانَ لَهُ } حينئذٍ { مِن فِئَةٍ } أعوانٍ وأنصارٍ { يَنصُرُونَهُ } ويدفعون عذاب الله عنه { مِن دُونِ ٱللَّهِ } القادر المقتدر على دفع أمثاله\n وهو بريء من الله { وَ } هو غير ملتجئ إليه ومتضرع نحوه\n ولذلك { مَا كَانَ مِنَ ٱلْمُنتَصِرِينَ } [القصص: 81] الممتنعين من العذاب لا بنفسه ولا بمعاونيه وأنصاره\n\n\nوبعدما خُسف قارون بشؤم أمواله التي جعلها وسيلة إلى أنواع الفسادات\n من جملتها: رمي كليم الله وخُلَّص رسله بالزنا التي هي بمراحل عن طهارة ذيله ونجابة طينته\n إذ الأنبياء كلهم معصومون عن الكبائر مطلقاً\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فخسفنا به } بقارون { وبداره الأرض } \n كان قارون يؤدي موسى عليه السلام كل وقت\n وهو يداريه للقرابة التي بينهما\n حتى نزلت الزكاة\n فصالحه: على كل ألف دينار دينارٌ\n وعلى كل ألف درهم درهمٌ\n فحاسبه فاستكثره\n فشحت به نفسه\n فجمع بني إسرائيل\n وقال له: قد أطعتم موسى في كل شيء\n وهو الآن يريد أن يأخذ أموالكم\n فقالوا: أنت كبيرنا فَمُرنا بما شئت\n قال: نجعل لفلانة البغي جُعْلاً حتى تقذف موسى بنفسها\n فيرفضه بنو إسرائيل\n فجعل لها ألف دينار\n أو: طستاً من ذهب\n فلما كان يوم عيد قام موسى خطيباً\n فقال: من سرق قطعنا يده\n ومن افترى جلدناه ثمانين\n ومن زنى وليس له امرأة جلدناه مائة\n ومن زنى وله امرأة رجمناه\n فقال قارون: وإن كنتَ أنتَ؟ قال: وإن كنتُ أنا\n قال: فإن بني إسرائيل يزعمون أنك فجرت بفلانة\n فأحضرت\n فناشدها بالذي خلق البحر وأنزل التوراة أن تصدق\n فقالت: جعل لي قارون جُعلا على أن أقذفك بنفسي\n فخرَّ موسى ساجداً يبكي\n وقال: اللهم إن كنتُ رسولَك فاغضبْ لي\n فأوحى الله تعالى إليه: مُر الأرض بما شئت فيه\n فإنها مطيعة لك\n فقال: يا بني إسرائيل: إن الله بعثني إلى قارون كما بعثني إلى فرعون\n فمن كان معه فليلزم مكانه\n ومن كان معي فليعتزل\n فاعتزلوا جميعاً غير رَجُلَيْن\n ثم قال: يا أرض خذيهم\n فأخذتهم إلى الأوساط\n ثم قال: خذيهم\n فأخذتهم إلى الأعناق\n وقارونُ وأصحابه يتضرعون إلى موسى\n ويناشدونه بالله وبالرحم\n وموسى لا يلتفت إليهم لشدة غضبه\n ثم قال: خذيهم\n فانطبقت عليهم\n فقال الله تعالى: يا موسى استغاث بك مراراً فلم ترحمه\n فوعزتي لو استرحمني مرة لرحمته\n رُوي أنه يخسف كل يوم قامة\n فهو يتجلجل فيها إلى يوم القيامة\n فقال بعض بني إسرائيل: إنما أهلكه ليرث داره وكنوزه\n فدعى الله تعالى فخسف بداره وكنوزه\n وأوحى الله تعالى إلى موسى: إني لا أُعَبِّدُ الأرض أحداً بعدك أبداً\n أي: لا آمرها تطيع أحداً بعدك\n { فما كان له من فئة } جماعة { ينصرونه من دون الله } يمنعونه من عذاب الله { وما كان من المنتصرين } من عذاب الله\n أو: من المنتقمين من موسى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:43",
      "similarity": 0.6305137996736339
    },
    {
      "verse": "75:8",
      "similarity": 0.5707550699061933
    },
    {
      "verse": "16:45",
      "similarity": 0.4877349955024173
    },
    {
      "verse": "8:45",
      "similarity": 0.4417523177882967
    },
    {
      "verse": "8:19",
      "similarity": 0.43761504036591986
    }
  ]
}