{
  "chapter": "القصص",
  "text": "ولا تدع مع الله الها ءاخر لا اله الا هو كل شىء هالك الا وجهه له الحكم واليه ترجعون",
  "translations": [
    {
      "translation": "Do not call on any other god along with Allah. There is no god but Him. All things are passing except His Face. Judgement belongs to Him. You will be returned to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not call on any other god apart from God. There is no god but He. All things will perish save His magnificence. His is the judgement, and to Him will you be brought back in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and do not invoke any god beside Allah. There is no god but He. All will perish but He. To Him belongs the command. And to Him shall all of you return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not worship anything besides God. He is the only God. Everything will be destroyed except God. To Him belongs Judgment and to Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not worship any other God along with Allah; there is no God except Him; all things are destructible except His Entity; only His is the command, and it is towards Him that you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And invoke not any other god along with Allah, La ilaha illa Huwa. Everything will perish save His Face. His is the decision, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call not with Allah any other god; there is no god but He, every thing is perishable but He; His is the judgment, and to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call not upon another god with God; there is no god but He. All things perish, except His Face. His is the Judgment, and unto Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cry not unto any other god along with Allah. There is no Allah save Him. Everything will perish save His countenance. His is the command, and unto Him ye will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invoke no god other than God, for there is no god but Him. All things are bound to perish except Himself. His is the judgement, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And invoke thou not any other god along with Allah. There is no god but he. Everything is perishable save His countenance His is the judgment, and unto Him ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not invoke another god besides Allah; there is no god except Him. Everything is to perish except His Face. All judgement belongs to Him, and to Him you will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call not, besides Allah, on another god. There is no god but He. Everything (that exists) will perish except His own Face. To Him belongs the Command, and to Him will ye (all) be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And invoke not any other ilah (god) along with Allah, La ilaha illa Huwa (none has the right to be worshipped but He). Everything will perish save His Face. His is the Decision, and to Him you (all) shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not call upon another god with Allah, there is no god except He. All things perish, except His Face, Judgement is His, and to Him all of you shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not invoke with God any other god. There is no god but He. All things perish, except His presence. His is the judgment, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not invoke with Allah another deity. There is no deity except Him. Everything will be destroyed except His Face. His is the judgement, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:88] And do not call on, [do not] worship, another god with God; there is no god except Him. Everything will perish except His Countenance, except Him. His is the judgement, the effective decree, and to Him you will be brought back, by being raised from the grave. Meccan, except for verses 1 to 11 inclusive, which are Medinese; it consists of 69 verses revealed after [sūrat] al-Rūm.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَا تَدْعُ مَعَ اللَّهِ إِلَهًا آَخَرَ لَا إِلَهَ إِلَّا هُوَ كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ لَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ (88)هذا النهي موجه إلى النبي صلى الله عليه وسلم في الظاهر ، والمقصود به إبطال الشرك وإظهار ضلال أهله إذ يزعمون أنهم معترفون بإلهية الله تعالى وأنهم إنما اتخذوا له شركاء وشفعاء ، فبين لهم أن الله لا إله غيره ، وأن انفراده بالإلهية في نفس الأمر يقضي ببطلان الإشراك في الاعتقاد ولو أضعف إشراك ، فجملة { لا إله إلا هو } في معنى العلة للنهي الذي في الجملة قبلها .وجملة { كل شيء هالك إلا وجهه } علة ثانية للنهي لأن هلاك الأشياء التي منها الأصنام وكلُّ ما عبد مع الله وأشرك به دليل على انتفاء الإلهية عنها لأن الإلهية تنافي الهلاك وهو العدم .والوجه مستعمل في معنى الذات . والمعنى : كل موجود هالك إلا الله تعالى . والهلاك : الزوال والانعدام .وجملة { له الحكم وإليه ترجعون } تذييل فلذلك كانت مفصولة عما قبلها . وتقديم المجرور باللام لإفادة الحصر ، والمحصور فيه هو الحكم الأتم ، أي الذي لا يرده راد .والرجوع مستعمل في معنى : آخر الكون على وجه الاستعارة ، لأن حقيقته الانصراف إلى مكان قد فارقه فاستعمل في مصير الخلق وهو البعث بعد الموت؛ شبه برجوع صاحب المنزل إلى منزله ، ووجه الشبه هو الاستقرار والخلود فهو مراد منه طول الإقامة .وتقديم المجرور ب ( إلى ) للاهتمام بالخبر لأن المشركين نفوا الرجوع من أصله ولم يقولوا بالشركة في ذلك حتى يكون التقديم للتخصيص .والمقصود من تعدد هذه الجملة إثبات أن الله منفرد بالإلهية في ذاته وهو مدلول جملة { لا إله إلا هو } . وذلك أيضاً يدل على صفة القدم لأنه لما انتفى جنس الإلهية عن غيره تعالى تعين أنه لم يُوجده غيرُه فثبت له القدمُ الأزلي وأن الله تعالى باق لا يعتريه العدم لاستحالة عدم القديم ، وذلك مدلول { كل شيء هالك إلا وجهه } ، وأنه تعالى منفرد في أفعاله بالتصرف المطلق الذي لا يرده غيره فيتضمن ذلك إثبات الإرادة والقدرة . وفي كل هذا ردّ على المشركين الذين جوزوا شركته في الإلهية ، وأشركوا معه آلهتهم في التصرف بالشفاعة والغوث .ثم أبطل إنكارهم البعث بقوله { وإليه ترجعون }\n\n",
      "translations": [
        {
          "translation": "(And cry not unto any other god along with Allah) do not worship any deity other than Allah nor call people to anyone or anything beside Allah. (There is no god save Him) alone without partners. (Everything) all works that are for other than Allah's Countenance (will perish) will not be accepted (save His Countenance) except that which is meant for the sake of His Countenance; it is also said that this means: every countenance changes except Allah's and every kingdom will vanish except His. (His is the command) the judgement between people, (and unto Him ye will be brought back) after death and he will requite each according to his works'. And of the surah in which the spider is mentioned, which is all Meccan and consists of 77 verses, 780 words and 4,145 letters: Surah 29: The Spider (al-'Ankabut) And of the surah in which the spider is mentioned, which is all Meccan and consists of 77 verses, 780 words and 4,145 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كُلُّ شَيْءٍ هَالِكٌ إِلاَّ وَجْهَهُ } معناه إلاّ هُو\n ويقال: ما أُريدَ بِهِ وَجهَهُ مِن الأَعمالِ الصَّالِحةِ\n\n",
      "translations": [
        {
          "translation": "\nThe saying of the Almighty: {Every single thing will perish except His Face} means except He\n It is said: I do not intend by it the face of his righteous deeds.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأتممت مكارم الأخلاق واليقين { تَدْعُ } بحالٍ من الأحوال { مَعَ ٱللَّهِ } الواحد الأحد الصمد\n الفرد الوتر الذي لم يلد ولم يولد\n ولم يتخذ صاحبة ولا ولداً { إِلَـٰهاً آخَرَ } شريكاً له في الوجود والألوهية والربوبية\n وجميع التصرفات الواقعة في مظاهره ومماليكه\n إذ { لاَ إِلَـٰهَ } في الوجود\n ولا موجود في الشهود { إِلاَّ هُوَ } هذا هو هايت ما نطق العارف عنه سبحانه\n وبعد ذلك يقلق ويدهش ويهيم\n ويفنى ويتلاشى\n\nإذ { كُلُّ شَيْءٍ } يتراءى لك من أظلال أسمائه وعكوس صفاته { هَالِكٌ } في حد ذاته\n باقٍ على عدمه\n مستمراً على استحالته وامتناعه { إِلاَّ وَجْهَهُ } الذي اقتبس به النور من تجليات الحق على حسب أسمائه وصفاته\n واستمد به العكس من شوارق بوارق شئونه المتشعشعة المتجددة\n وعن دقائق رقائق لوائح لوامع تطوراته التي تخطف بها أبصار أرباب الكشف والشهود من المنجذبين نحو الحق\n المتأملين في شأنهم\n الوالهين بمطالعة جماله وجلاله\n وبالجملة: بعدما ثبت هلاك الكل في ذاته سبحانه وظهوره وانعكاسه منه ابتداءً ثبت { لَهُ ٱلْحُكْمُ } والأمر في جميع ما كان ويكون أزلاً وابداً { وَإِلَيْهِ } انتهاء لا إلى غيره\n إذ لا غير في الوجود معه { تُرْجَعُونَ } [القصص: 88] رجوع الأمواج إلى الماء\n والأظلال إلى الأضواء\n\n\nسبحان من ظهر على الكل فأظهره\n وبطن في الكل فأهلكه\n هو الأول والآخر والظاهر والباطن\n وهو بكل شيء عليم\n\n\nخاتمة السورة\n\nعليك أيها السالك المتوجه نحو الحق بوجهك الذي ليلي الحق المقتبس به منه أشعة أنوار تجلياته الذاتية حسب أسمائه الحسنى وصفاته العليا\n أن تتأمل في كيفية نشآت الكثرات الغير المحصورة عن الواحد من كل الوجود\n وتتعمق بمقتضى العقل المفاض لك من حضرة علمه سبحانه على سبيل التوديع\n لتتدبر معرفة مبدئك ومعادك حسب استعدادك الفطري\n وقابليتك الجبلية التي بها امتيازك عن سائر المظاهر والمصنوعات\n وبها تستحق الخلافة والنيابة عن الله\n وبواسطة تلك الوديعة البديعة المودعة فيك كلفك الحق إلى ما كلفك\n وأعد لك من المراتب العلية والمقامات السنية عنده ما أعد لك حسب صعودك وترقيك في معارفك\n وحقائقك على مقتضى التكاليف التي توصلك إليها إن أخلصت فيها\n\n\nفلك أن تتحمل على مشاق التكليفات ومتاعب الرياضات ما دمت في مجال التكاليف ومنازل العروج إلى أن جذبك الحق منك نحوه\n ومكنك بموعدك المعهود ومقامك المحمود الذي هو مرتبة الكشف والشهود\n وحينئذٍ اتحد قوساً الوجوب والإمكان\n وارتفعت الزبد والأمواج عن بحر العيان\n وفزت بما فزت من موالد اللطف والإحسان\n فظهر لك حينئذٍ معنى قوله: { لاَ إِلَـٰهَ إِلاَّ هُوَ كُلُّ شَيْءٍ هَالِكٌ إِلاَّ وَجْهَهُ لَهُ ٱلْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ } [القصص: 88]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا إله إلا هو }: استئناف\n مقرر لِمَا قبله\n { كلُّ شيءٍ هالكٌ إلا وَجْهَهُ } أي: ذاته\n فالوجه يُعَبِّرُ به عن الذات\n أي: لكل شيء فانٍ مستهلك معدوم\n إلا ذاته المقدسة\n فإنها موجودة باقية\n\nوقال أبو العالية: إلا ما أريد به وجه الله\n مِنْ عِلْمٍ وعمل\n فإنه لا يفنى\n قال عبادة بن الصامت رضي الله عنه: يجاء بالدنيا يوم القيامة\n فيقال: ميزوا ما كان لله تعالى منها\n فيميز\n ثم يؤمر بسائرها فيُلقى في النار\n هـ\n وقال الضحاك: كل شيء هالك إلا الله والجنة والنار والعرش\n { له الحُكْمُ } القضاء النافذ في خلقه\n { وإليه تُرجعون } للجزاء والفصل\n والله تعالى أعلم\n الإشارة: أهل الاشتياق يُرَوِّحُونَ أرواحهم بهذه الآية\n فيقولون لها: إن الذي فرض عليك القرآن\n أن تعمل به في الدنيا لرادك إلى معاد جسماني روحاني\n فتتصل نضرتك ونظرتك إلى وجه الحبيب\n من غير عذول ولا رقيب\n على سبيل الاتصال\n من غير تكدر ولا انفصال\n فإن وقع الإنكار على أهل الخصوصية فيقولون: { ربي أعلم } الآية\n\n وما كنت ترجو أن تُلْقَى إليك الخصوصية إلا رحمة من ربك\n فلا تكونن ظهيراً للكافرين المنكرين لها\n معيناً لهم على إذاية من انتسب إليها\n ولا يصدنك عن معرفة آيات الله الدالة عليه\n بعد إذ أُنزلت إليك\n أي: لا يمنعك الناس عن صحبة أولياء الله الدالين عليه\n وادع إلى ربك\n أي: إلى معرفة ذاته ووحدانيته\n ولا تكونن من المشركين بشهود شيء من السِّوى\n فإن كل شيء هالك\n أي: معدم في الماضي والحال والاستقبال\n إلا وجهه: إلا ذاته\n فلا موجود معها\n وفي ذلك يقول الشاعر:\nوبالله التوفيق\n ولا حول ولا قوة إلا بالله العلي العظيم\n وَصَلَّى اللهُ على سيدنا محمد وآله وصحبه\n وسَلَّمَ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:70",
      "similarity": 0.40740721172457467
    },
    {
      "verse": "21:95",
      "similarity": 0.4009822974949216
    },
    {
      "verse": "26:213",
      "similarity": 0.3751889651330939
    },
    {
      "verse": "11:4",
      "similarity": 0.3495810035652995
    },
    {
      "verse": "23:48",
      "similarity": 0.34647464564403774
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028088.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028088.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:88.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}