{
  "chapter": "القصص",
  "text": "ان الذى فرض عليك القرءان لرادك الى معاد قل ربى اعلم من جاء بالهدى ومن هو فى ضلل مبين",
  "translations": [
    {
      "translation": "He who has imposed the Qur'an upon you will most certainly bring you back home again. Say: 'My Lord knows best who has brought true guidance and who is plainly misguided.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who has assigned (the propagation) of the Qur'an to you will bring you back to the destination. Say: \"My Lord knows who has come to guidance, and who is clearly in error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), surely He Who has ordained the Qur'an on you will bring you to the best end. Say to them: \"My Lord knows best who has brought true guidance and who is in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), God, Who has commanded you to follow the guidance of the Quran, will certainly return you victoriously to your place of birth. Say, \"My Lord knows best who has brought guidance and who is in plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed He Who has ordained the Qur’an upon you, will surely bring you back to where you wish; proclaim, “My Lord well knows him who came with guidance, and him who is in open error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, He Who has given you the Qur'an, will surely bring you back to the return. Say: \"My Lord is Aware of him who brings guidance, and of him who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely He Who has made the Quran binding on you will bring you back to the destination. Say: My Lord knows best him who has brought the guidance and him who is in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who imposed 'the Recitation upon thee. shall surely restore thee to a place of homing. Say: 'My Lord' knows very well who comes with guidance, and who is in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! He Who hath given thee the Qur'an for a law will surely bring thee home again. Say: My Lord is Best Aware of him who bringeth guidance and him who is in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who has entrusted you with the responsibility of the Quran, will surely lead you to a successful end. Say, \"My Lord knows best who is rightly guided and who is in gross error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily He who hath imposed the Qur'an on thee Is surely about to bring thee back home. Say thou: my Lord knoweth best who bringeth guidance and who is in an error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed He who has revealed to you the Quran will surely restore you to the place of return. Say, ‘My Lord knows best him who brings guidance and him who is in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily He Who ordained the Qur'an for thee, will bring thee back to the Place of Return. Say: \"My Lord knows best who it is that brings true guidance, and who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, He Who has given you (O Muhammad SAW) the Quran (i.e. ordered you to act on its laws and to preach it to others) will surely bring you back to the Ma'ad (place of return, either to Makkah or to Paradise after your death, etc.). Say (O Muhammad SAW): \"My Lord is Aware of him who brings guidance, and he who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who has obligated the Koran will bring you to an appointment. Say: 'My Lord knows well who comes with guidance, and who is in clear error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who ordained the Quran for you will return you Home. Say, “My Lord knows best who comes with guidance, and who is in manifest error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, [O Muhammad], He who imposed upon you the Qur'an will take you back to a place of return. Say, \"My Lord is most knowing of who brings guidance and who is in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:85] Indeed He Who has prescribed for you the Qur’ān, [He Who] has revealed it, will surely restore you to a place of return, to Mecca — he had yearned for it. Say: ‘My Lord knows best him who brings guidance and   him who is in manifest error’ — this was revealed in order to refute what the Meccan disbelievers had said to him: ‘Indeed, you are error’. In other words [God is saying that] he [the Prophet] is the one who has brought guidance, while they are the ones in error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ الَّذِي فَرَضَ عَلَيْكَ الْقُرْآَنَ لَرَادُّكَ إِلَى مَعَادٍ قُلْ رَبِّي أَعْلَمُ مَنْ جَاءَ بِالْهُدَى وَمَنْ هُوَ فِي ضَلَالٍ مُبِينٍ (85)ابتداء كلام للتنويه بشأن محمد صلى الله عليه وسلم وتثبيت فؤاده ووعده بحسن العاقبة في الدنيا والآخرة ، وأن إنكار أهل الضلال رسالته لا يضيره لأن الله أعلم بأنه على هدى وأنهم على ضلال بعد أن قدم لذلك من أحوال رسالة موسى عليه السلام ما فيه عبرة بالمقارنة بين حالي الرسولين وما لقياه من المعرضين .وافتتاح الكلام بحرف التأكيد للاهتمام به . وجيء بالمسند إليه اسم موصول دون اسمه تعالى العَلَم لما في الصلة من الإيماء إلى وجه بناء الخبر . وأنه خبر الكرامة والتأييد أي أن الذي أعطاك القرآن ما كان إلا مقدِّراً نصرك وكرامتك؛ لأن إعطاء القرآن شيء لا نظير له فهو دليل على كمال عناية الله بالمعطى . قال كعب بن زهير: ... مَهْلاً هداك الذي أعطاك نافلة القرآن فيها مواعيظ وتفصيل ... وفيه إيماء إلى تعظيم شأن الرسول صلى الله عليه وسلمومعنى { فرض عليك القرآن } اختاره لك من قولهم : فرض له كذا ، إذا عيَّن له فرضاً ، أي نصيباً . ولما ضمن { فرض } معنى ( أنزل ) لأن فرض القرآن هو إنزاله ، عُدِّي فرض بحرف ( على ) .والردّ : إرجاع شيء إلى حاله أو مكانه . والمعاد : اسم مكان العَوْدِ ، أي الأوْللِ كما يقتضيه حرف الانتهاء . والتنكير في { معاد } للتعظيم كما يقتضيه مقام الوعد والبشارة ، وموقعُهما بعد قوله { من جاء بالحسنة فله خير منها } \\[ القصص : 84 \\] ، أي إلى معاد أيَّ معاد .والمعاد يجوز أن يكون مستعملاً في معنى آخر أحوال الشيء وقراره الذي لا انتقال منه تشبيهاً بالمكان العائد إليه بعد أن صدر منه أو كناية عن الأخارة فيكون مراداً به الحياة الآخرة . قال ابن عطية : وقد اشتهر يوم القيامة بالمعاد لأنه معاد الكل اه . أي فأبشر بما تلقى في معادك من الكرامة التي لا تعادلها كرامة والتي لا تُعطى لأحد غيرك . فتنكير { معاد } أفاد أنه عظيم الشأن ، وترتبه على الصلة أفاد أنه لا يعطى لغيره مثله كما أن القرآن لم يفرض على أحد مثله .ويجوز أن يراد بالمعاد معناه المشهود القريب من الحقيقة . وهو ما يعود إليه المرء إن غاب عنه ، فيراد به هنا بلدهُ الذي كان به وهو مكة . وهذا الوجه يقتضي أنه كناية عن خروجه منه ثم عوده إليه لأن الرد يستلزم المفارقة . وإذ قد كانت السورة مكية ورسول الله صلى الله عليه وسلم في مكة فالوعد بالرد كناية عن الخروج منه قبل أن يُردّ عليه . وقد كان النبي صلى الله عليه وسلم أُرِيَ في النوم أنه يهاجر إلى أرض ذات نخل كما في حديث البخاري ، وكان قال له ورقةُ ابن نَوفل : يا ليتني أكون معك إذ يُخرجك قومُك وإن يُدركْني يومُك أنصرْك نصراً مؤزَّراً ، فما كان ذلك كله ليغيب عن علم رسول الله صلى الله عليه وسلم على أنه قد قيل : إن هذه الآية نزلت عليه وهو في الجُحْفة في طريقه إلى الهجرة كما تقدم في أول السورة فوعد بالرد عليها وهو دخوله إليها فاتحاً لها ومتمكناً منها .فقد روي عن ابن عباس تفسيرُ المعاد بذلك وكلا الوجهين يصح أن يكون مراداً على ما تقرر في المقدمة التاسعة .ثم تكون جملة { قل ربي أعلم من جاء بالهُدى } بالنسبة إلى الوجه الأول بمنزلة التفريع على جملة { لرادّك إلى معاد } ، أي رادّك إلى يوم المعاد فمُظهرٌ المهتدي والضالين ، فيكون علم الله بالمهتدي والضالّ مكنى به عن اتضاح الأمر بلا ريب لأن علم الله تعالى لا يعتريه تلبيس وتكون هذه الكناية تعريضاً بالمشركين أنهم الضالون . وأن النبي صلى الله عليه وسلم هو المهتدي .ولهذه النكتة عبّر عن جانب المهتدي بفعل { من جاء } للإشارة إلى أن المهتدي هو الذي جاء بهدي لم يكن معروفاً من قبل كما يقتضيه : جاء بكذا . وعبر عن جانب الضالين بالجملة الإسمية المقتضية ثبات الضلال المشعر بأن الضلال هو أمرهم القديم الراسخ فيهم مع ما أفاده حرف الظرفية من انغماسهم في الضلال وإحاطته بهم . ويكون المعنى حينئذ على حد قوله تعالى { وإنا أو إياكم لعلى هدى أو في ضلال مبين } \\[ سبأ : 24 \\] لظهور أن المبلغ لهذا الكلام لا يفرض في حقه أن يكون هو الشق الضال فيتعين أن الضال من خالفه .وبالنسبة إلى الوجه الثاني تكون بمنزلة الموادعة والمتاركة وقطع المجادلة . فالمعنى : عدِّ عن إثبات هداك وضلالهم وكِلْهم إلى يوم ردك إلى معادك يوم يتبين أن الله نصرك وخذلهم . وعلى المعنيين فجملة { قل ربي أعلم } مستأنفة استئنافاً بيانياً عن جملة { إن الذي فرض عليك القرآن } جواباً لسؤال سائل يثيره أحد المعنيين .وفي تقديم جملة { إن الذي فرض عليك القرآن لرادك إلى معاد } على جملة { قل ربي أعلم من جاء بالهدى } إعداد لصلاحية الجملة الثانية للمعنيين المذكورين . فهذا من الدلالة على معاني الكلام بمواقعه وترتيب نظامه وتقديم الجمل عن مواضع تأخيرها لتوفير المعاني .\n\n",
      "translations": [
        {
          "translation": "(Lo! He Who hath given thee the Qur'an for a law) He Who has sent you Gabriel with the Qur'an (will surely bring you again to the place of return) to Mecca; and it is said: to Paradise. (Say) Muhammad: (My Lord is best aware of he who bringeth guidance) the profession of Allah's divine Oneness and the Qur'an (and him who is in error manifest) and him who is in manifest disbelief and error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَرَضَ عَلَيْكَ ٱلْقُرْآنَ } معناه أنزلَهُ\n وقال: أعطاكه\n\n\n\n\nوقوله تعالى: { لَرَآدُّكَ إِلَىٰ مَعَادٍ } معناه إلى المَوتِ\n وقال: إلى مَولِدِكَ بِمكة\n وقال: إلى الجَنةِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"It is incumbent upon you to recite the Qur'an\" - this means that He revealed it.\n\n\nAnd he said: \"I give it to you.\"\n\n\nAnd His saying, \"I will return you to your appointed time\" [Qur'an 11:107] means returning you to death.\n He said: \"To your birth in Mecca\"\n\n\nAnd he said, \"To paradise.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا اغتم رسول الله صلى الله عليه وسلم حين هاجر من مكة بسبب مكر المشركين\n فلما وصل إلى جحفة اشتد اشتياقه إلى مولده وموطن آبائه\n وتحزن حزناً شديداً إلى حيث أراد أن يعود منها إليها\n فنزلت تسليةً عليه صلى الله عليه وسلم\n وإزالةً لحزنه: { إِنَّ } القادر المقتدر { ٱلَّذِي فَرَضَ عَلَيْكَ ٱلْقُرْآنَ } وقدر لك إنزاله\n وأقدرك على الامتثال بجميع ما فيه من الأوامر والنواهي وكشف عليك ما فيه من الحقائق والمعارف\n والرموز والإشارات المتعقلة بصفاء مشرب التوحيد\n وذكر لك فيه القصص والعبر والأمثال إرشاداً لك إلى مقامك الذي وعدك الحق تفضلاً وامتناناً\n وسماه من عنده مقاماً محموداً { لَرَآدُّكَ } ومعاودك { إِلَىٰ مَعَادٍ } معهود\n هو مولدك وموظن آبائك وأسلافك على أحسن وجه وأكمله\n\n\nوبعدما عدت ورجعت إليه بعد هجرتك من بينهم أو أضلوك ونسبوك إلى ما لا يليق بشأنك { قُل } لهم على سبيل المجاراة: { رَّبِّيۤ } الذي وسع علمه كل شيء { أَعْلَمُ } بعلمه الحضوري { مَن جَآءَ بِٱلْهُدَىٰ } منَّا أنا أو أنتم { وَمَنْ هُوَ فِي ضَلاَلٍ مُّبِينٍ } [القصص: 85] منَّا ومنكم\n\n\n{ وَ } عليك يا أكمل الرسل أن تفوض أمورك إلينا اتكالاً علينا\n واعتصاماً لحولنا وقوتنا\n ولا تلتفت إلى المشركين وإيمانهم ولا تداريهم\n ولا تك في رعبٍ منهم\n إنَّا كفيناك مؤنة شرورهم عنك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ولا يصدنك: مجزوم بحذف النون\n وحذفت الواو لالتقاء الساكنين\n حين دخلت نون التوكيد\n يقول الحق جل جلاله: لرسوله صلى الله عليه وسلم { إن الذي فَرَضَ عليك القرآن } أي: أوجب عليك تلاوته وتبليغه\n والعمل بما فيه\n { لرادُّك إلى معاد } عظيم\n وهو المعاد الجسماني لتقوم المقام المحمود\n الذي لا يقوم فيه أحد غيرك\n مع حضور الأكابر من الرسل وغيرهم\n أو: لرادك إلى معادك الأول\n وهو مكة\n وكان عليه الصلاة والسلام اشتاق إليها لأنها مولده ومولد آبائه\n وقد ردّه إليها يوم الفتح\n وإنما نكَّره لأنه كان في ذلك اليوم معاد له شأن\n ومرجع له اعتداد لغلبته - عليه الصلاة والسلام - ونصره\n وقهره لأعدائه\n ولظهور عز الإسلام وأهله\n وذل الشرك وحزبه\n والسورة مكية\n لكن هذه الآية نزلت بالجُحْفَةِ\n لا بمكة ولا بالمدينة\n وفي الآية وعد بالنصر\n وأن العاقبة الحسنة والخير الجسيم للنبي صلى الله عليه وسلم لا يختص بالآخرة\n بل يكون في الدنيا له ولمتَّبِعيهِ\n ولكن بعد الابتلاء والامتحان\n كما في صدر السورة الآتية بعدها\n وبهذا يقع التناسب بينهما\n فإنها كالتعليل لِمَا قبلها\n ولما وعده بالنصر قال له: قل ربي أعلم من جاء بالهُدى أي: يعلم مَنْ جاء بالحق\n يعني نَفْسَهْ صلى الله عليه وسلم مع ما يستحقه من النصر والثواب\n في معاده\n { ومن هو في ضلال مبين } وهم المشركون\n مع ما يستحقونه من العقاب في معادهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "66:2",
      "similarity": 0.5453093642796661
    },
    {
      "verse": "24:1",
      "similarity": 0.49989935306100647
    },
    {
      "verse": "4:118",
      "similarity": 0.49889658419998906
    },
    {
      "verse": "4:7",
      "similarity": 0.4029959004897116
    },
    {
      "verse": "33:38",
      "similarity": 0.3433559567609574
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028085.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028085.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}