{
  "chapter": "القصص",
  "text": "فالتقطه ءال فرعون ليكون لهم عدوا وحزنا ان فرعون وهمن وجنودهما كانوا۟ خطـين",
  "translations": [
    {
      "translation": "The family of Pharaoh picked him up so that he might be an enemy and a source of grief to them. Certainly Pharaoh and Haman and their troops were in the wrong.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he was picked up by the family of Pharaoh (unaware) that he would become their enemy and a cause for regret. Surely the Pharaoh, Haman and their hordes were habitual sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Pharaoh's household picked him up (from the river) that he may be their adversary and be a cause of sorrow to them. Surely Pharaoh and Haman and their hosts erred (in their scheming).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Pharaoh picked him up (without realizing) that he would become their enemy and a source of their sorrow. The Pharaoh, Haman, and their army were sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the family of Firaun picked him up, in order that he become their enemy and a sorrow upon them; indeed Firaun and Haman and their armies were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the household of Fir`awn picked him up, that he might become for them an enemy and a (cause of) grief. Verily, Fir`awn, Haman and their armies were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Firon's family took him up that he might be an enemy and a grief for them; surely Firon and Haman and their hosts were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So then the folk of Pharaoh picked him out to be an enemy and a sorrow to them; certainly Pharaoh and Haman, and their hosts, were of the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the family of Pharaoh took him up, that he might become for them an enemy and a sorrow, Lo! Pharaoh and Haman and their hosts were ever sinning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Pharaoh's household picked him up -- later to become for them an enemy and a source of grief for them: Pharaoh and Haman and their hosts were wrongdoers --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the household of Fir'awn took him Up, that he should become unto them an enemy and a grief. Verily Fir'awn and Haman and their hosts were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Pharaoh’s kinsmen picked him up that he might be an enemy and a cause of grief to them. Indeed Pharaoh and Haman and their hosts were iniquitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the people of Pharaoh picked him up (from the river): (It was intended) that (Moses) should be to them an adversary and a cause of sorrow: for Pharaoh and Haman and (all) their hosts were men of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the household of Fir'aun (Pharaoh) picked him up, that he might become for them an enemy and a (cause of) grief. Verily! Fir'aun (Pharaoh), Haman and their hosts were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the family of Pharaoh picked him out to be an enemy and a sorrow for them, indeed Pharaoh and Haman, and their army were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh’s household picked him up, to be an opponent and a sorrow for them. Pharaoh, Hamaan, and their troops were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the family of Pharaoh picked him up [out of the river] so that he would become to them an enemy and a [cause of] grief. Indeed, Pharaoh and Haman and their soldiers were deliberate sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:8] Then Pharaoh’s folk, aids, picked him up, with him [still] in the basket, the morning following that night — it was placed him in front of him [Pharaoh] and then opened and Moses was brought out of it, sucking milk from his thumb — to be, at the end of the affair, an enemy, slaying their menfolk, and a [cause of] grief to them, enslaving their womenfolk (a variant reading [for hazanan] is huznan, both of which are alternative forms of the verbal noun, and it functions as an active participle, derived from hazanahu, which is like ahzanahu, ‘he caused him grief’). Truly Pharaoh and, his minister, Hāmān, and their hosts were sinners, that is, disobedient, and so they were punished at his [Moses’s] hands.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the family of Pharaoh) the maidens of Pharaoh (took him up) picked him from between the trees and water and took him to the wife of Pharaoh, (that he might become for them an enemy) after he takes the message to them (and a sorrow) for the loss of their kingdom. (Lo! Pharaoh and Haman and their hosts were ever sinning) they were idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فإنه لا يصل إلى التمييز والرشد ولا يتوقى إلا بمعاونة التخيل والوهم وسائر المدركات الظاهرة والباطنة وإمدادها { ليكون لهم عدوّاً وحزناً } في العاقبة ويعلم أن أعدى عدوّه النفس التي بين جنبيه فيقهرها وأعوانها بالرياضة ويفنيها بالقمع والكسر والإماتة\n { وقالت امرأة فرعون } أي: النفس المطمئنة العارفة بنور اليقين والسكينة حالة المحبة لصفائها له التي تستولي عليها الأمّارة وتؤثر فيها بالتلوين { قرّة عين لي } بالطبع للتناسب { ولك } بالتوسط ورابطة الزوجية والتواصل\n وقيل\n قال فرعون: لك لا لي\n وعالجوا التابوت فلم ينفتح",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { ليكونَ لهم عَدُواً وحَزَناً } أي: ليصير الأمر ذلك\n لا أنهم أخذوه لهذا\n فاللام للصيرورة كقولهم: لدوا للموت وابنوا للخراب\n وقال صاحب الكشاف: هي لام \" كي \" التي معناها التعليل\n كقولك: جئت لتكرمني\n ولكن معنى التعليل فيها وارد على طريق المجاز لأن ذلك لما كان نتيجة التقاطم له شبه بالداعي الذي يفعل الفاعل الفعلَ لأجله\n هـ\n وتسمى بالاستعارة التبعية\n وفي \" الحَزَن \" لغتان الفتح\n والضم\n كالعدم والعدم\n { إنَّ فرعونَ وهامانَ وجنودَهما كانوا خاطئين } \n أي: مذنبين\n فعاقبهم الله تعالى بأن ربَّى عدوهم\n ومن هو سبب هلاكهم على يديهم\n أو: كانوا خاطئين في كل شيء\n فليس خطؤهم في تربية عدوهم ببدع منهم\n { وقالت امرأةُ فرعون } \n لمّا هم فرعون بقتله – لقول القواد: هو الذي نحذر هو: { قرةُ عين لي ولك } \n فقال فرعون: لكِ\n لا لي\n قال صلى الله عليه وسلم:\n \" لو قال مثل ما قالت لهداه الله مثل ما هداها \" \n\n وهذا على سبيل الفرض\n أي: لو كان غير مطبوع عليه الكفر لقال مثل قولها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:10",
      "similarity": 0.5142147565292998
    },
    {
      "verse": "28:6",
      "similarity": 0.3804384774192427
    },
    {
      "verse": "40:24",
      "similarity": 0.28716567555745975
    },
    {
      "verse": "29:39",
      "similarity": 0.2815755994151423
    },
    {
      "verse": "40:36",
      "similarity": 0.24925956456725903
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}