{
  "chapter": "القصص",
  "text": "ولا يصدنك عن ءايت الله بعد اذ انزلت اليك وادع الى ربك ولا تكونن من المشركين",
  "translations": [
    {
      "translation": "Do not let them debar you from Allah's Signs after they have been sent down to you. Call people to your Lord and on no account be one of the idolaters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor should you let them turn you away from the commandments of God once they have been delivered to you; and call them to your Lord, and do not be an idolater,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let it never happen that the unbelievers might turn you away from the revelations of Allah after they have been revealed to you. Call people to your Lord and never become one of the unbelievers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them not prevent you from following the revelations of God after they are revealed to you. Call (mankind) to your Lord and do not be a pagan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never may they prevent you from the verses of Allah after they have been sent down upon you, and call towards your Lord, and never be among those who ascribe partners (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them not turn you away from the Ayat of Allah after they have been sent down to you, and invite to your Lord and be not of idolators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them not turn you aside from the communications of Allah after they have been revealed to you, and call (men) to your Lord and be not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them not bar thee from the signs of God, after that they have been sent down to thee. And call upon thy Lord, and be thou' not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them not divert thee from the revelations of Allah after they have been sent down unto thee; but call (mankind) unto thy Lord, and be not of those who ascribe partners (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let no one divert you from God's revelations, once they have been sent down to you. Call people to your Lord. Never be of those who ascribe partners to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them not turn thee aside from the signs of Allah after they have been sent down unto thee. And call thou men unto thy Lord, and be thou not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not ever let them bar you from Allah’s signs after they have been sent down to you. Invite to your Lord, and never be one of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let nothing keep thee back from the Signs of Allah after they have been revealed to thee: and invite (men) to thy Lord, and be not of the company of those who join gods with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them not turn you (O Muhammad SAW) away from (preaching) the Ayat (revelations and verses) of Allah after they have been sent down to you, and invite (men) to (believe in) your Lord [i.e. in the Oneness (Tauhid) of Allah (1) Oneness of the Lordship of Allah; (2) Oneness of the worship of Allah; (3) Oneness of the Names and Qualities of Allah], and be not of Al-Mushrikun (those who associate partners with Allah, e.g. polytheists, pagans, idolaters, those who disbelieve in the Oneness of Allah and deny the Prophethood of Messenger Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let no one bar you from the verses of Allah after they have been sent down to you, but call to your Lord, and do not be amongst the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not let them divert you from God’s revelations after they have been revealed to you. And pray to your Lord, and never be of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never let them avert you from the verses of Allah after they have been revealed to you. And invite [people] to your Lord. And never be of those who associate others with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:87] And never let them bar you (yasuddunnaka is actually yasuddūnannaka, but the nūn of the indicative [ending] has been omitted because of the apocopating particle [lā], as has the wāw of the [third person plural] subject of the verb because of its coming together with an unvocalised nūn) from God’s signs after they have been revealed to you, in other words, do not consult with them in such [matters], and summon, people, to your Lord, by affirming His Oneness and worshipping Him, and never be of the idolaters, by supporting them (lā takūnanna: the apocopating particle does not affect the [ending of the] verb here because of its invariability).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And let them not divert thee from the revelations of Allah) from the Qur'an (after they have been sent down unto thee) through Gabriel; (but call (mankind) unto thy Lord) call to the profession of Allah's divine Oneness and Book of your Lord, (and be not of those who ascribe partners (unto turn)) do not be with the idolaters, following their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يَصُدُّنَّكَ } ويصرفنك مواساتهم ومداراتهم\n والمسامحة معهم { عَنْ } تبليغ { آيَاتِ ٱللَّهِ } المشتملة على الإنذارات والوعيدات الشديدة إياهم { بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ } وأُمرت بتبليغها { وَٱدْعُ إِلَىٰ } توحيد { رَبِّكَ } بعدما بعثك إلى كافة البرايا\n وعامة الأمم كله\n مَنْ جبله الحق على صورة الإنسان\n وكلفه بالمعرفة والإيمان { وَلاَ تَكُونَنَّ } بالمداهنة والمسامحة معهم { مِنَ ٱلْمُشْرِكِينَ } [القصص: 87] المشتركين في شركهم وكفرهم\n\n\n{ وَلاَ } بعدما ظهرت على التوحيد الذاتي\n وأكملت مراسم الدين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا يَصُدُّنَّك عن آيات الله } أي: لا يمنعك هؤلاء عن العمل بآيات الله وتبليغها وإظهارها، { بعد إذ أُنزلت إليك } أي: بعد وقت إنزالها، و { إذ }: مضاف إليه أسماء الزمان، كقولك: حينئذٍ ويَومَئذٍ\n { وادعُ إلى ربك } إلى توحيده وعبادته، { ولا تكونن من المشركين } ، نهاه، تنفيراً لغيره من الشرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:167",
      "similarity": 0.5623923656116546
    },
    {
      "verse": "43:62",
      "similarity": 0.5082193349177446
    },
    {
      "verse": "47:1",
      "similarity": 0.502947957886768
    },
    {
      "verse": "4:61",
      "similarity": 0.4988492636099075
    },
    {
      "verse": "27:43",
      "similarity": 0.4975361729330941
    }
  ]
}