{
  "chapter": "القصص",
  "text": "تلك الدار الءاخرة نجعلها للذين لا يريدون علوا فى الارض ولا فسادا والعقبة للمتقين",
  "translations": [
    {
      "translation": "That abode of the Next World- We grant it to those who do not seek to exalt themselves in the earth or to cause corruption in it. The successful outcome is for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall give the mansion of the Hereafter to those who do not want to be haughty in the land and spread corruption. The future belongs to those who take heed for themselves and follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Abode of the Hereafter, We shall assign it exclusively for those who do not seek glory on earth nor want to cause mischief. The God-fearing shall have the best end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is the life hereafter which We have prepared for those who do not want to impose their superiority over the others in the land nor commit evil therein. The happy end certainly belongs to the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This abode of the Hereafter – We make it for those who do not wish greatness in the land nor turmoil; and the Hereafter is only for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the home of the Hereafter, We shall assign to those who do not want to exalt themselves in the land nor cause corruption. And the good end is for those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) that future abode, We assign it to those who have no desire to exalt themselves in the earth nor to make mischief and the good end is for those who guard (against evil)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Last Abode; We appoint it for those who desire not exorbitance in the earth, nor corruption. The issue ultimate is to the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for that Abode of the Hereafter We assign it unto those who seek not oppression in the earth, nor yet corruption. The sequel is for those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the abode of the Hereafter, We shall assign it to those who seek neither self-aggrandisement on the earth nor corruption. The righteous shall have a blessed end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the abode of the Hereafter! We appoint it unto those who Seek not exaltation in the earth nor corruption; and the happy end is for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the abode of the Hereafter, which We shall grant to those who do not desire to domineer in the earth nor to cause corruption, and the outcome will be in favour of the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Home of the Hereafter We shall give to those who intend not high-handedness or mischief on earth: and the end is (best) for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That home of the Hereafter (i.e. Paradise), We shall assign to those who rebel not against the truth with pride and oppression in the land nor do mischief by committing crimes. And the good end is for the Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Last Abode, We shall assign it to those who desire neither exorbitance in the earth, nor corruption. The outcome is for the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Home of the Hereafter—We assign it for those who seek no superiority on earth, nor corruption. And the outcome is for the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That home of the Hereafter We assign to those who do not desire exaltedness upon the earth or corruption. And the [best] outcome is for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:83] That is the Abode of the Hereafter, namely, Paradise, which We shall grant to those who do not desire to be haughty in the earth, through insolence, nor [to cause] corruption, by committing acts of disobedience. And the, praiseworthy, sequel will be for those who fear, God’s punishment, by performing deeds of obedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for that Abode of the Hereafter) Paradise (We assign it unto those who seek not oppression) and haughtiness (in the earth) through their wealth, (nor yet corruption) by means of carvings, statues and transgressions. (The sequel) Paradise (is for those who ward off (evil)) those who ward off disbelief, idolatry, haughtiness and corruption in the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتنشيطاً للمتقين الموقنين: { تِلْكَ } الجنة التي سمعت وصفها\n وبلغك خيرها في كتب الله وألسنة رسله وأنبيائه وأوليائه المكشفين بها\n الفائزين بمقاماتها { ٱلدَّارُ ٱلآخِرَةُ } أي: الموصوفة بهذه الصفة\n إذ لا مقر لأهل الله سواها\n لذلك سميت بها { نَجْعَلُهَا } بمقتضى فضلنا وجودنا مقراً { لِلَّذِينَ } أي: للمؤمنين الموحدين الذين { لاَ يُرِيدُونَ } من كمال حلمهم وعلمهم { عُلُوّاً فِي ٱلأَرْضِ } أي: تفوقاً وتكبراً على من عليها\n ولا يمشون عليها خيلاء غافلين عن تزود الآخرة { وَلاَ } يقصدون فيها { فَسَاداً } مؤدياً إلى هتك محارم الله والخروج عن مقتضى حدوده\n\n\n{ وَ } بالجملة: { ٱلْعَاقِبَةُ } الحميدة التي عبر بها عن الجنة ودار الآخرة\n ودار السلام والخلد وغير ذلك من العبارات معدة مهيأة { لِلْمُتَّقِينَ } [القصص: 83] الذين يحفظون نفوسهم عن ارتكاب المنهيات والمحظورات مطلقاً\n ويجتنبون عن جميع ما يؤدي إلى إسقاط المروءة رأساً\n ويتصفون بجميع ما جاء به الرسل ونطق به الكتب من الأمور المشعرة للهداية والصلاح\n والفوز بالنجاح والفلاح\n فأولئك السعداء المقبولون هم الواصلون إلى درجة القرب والشهود\n والوالهون بشرف مطالعة لقاء الخلاق الودود\n\n\nثمَّ أشار سبحانه بشارة جميلة محتوية على أصول جميع المواعظ والتذكيرات المتعلقة لعموم مصالح عباده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: تلك: مبتدأ\n ونجعلها: خبر\n يقول الحق جل جلاله: { تلك الدارُ الآخرة } أي: تلك الدار التي سمعْت بذكرها\n وبلغت خبرها\n وعنى البُعد في الإشارة\n لبُعد منزلتها وعلو قدرها\n { نجعلها للذين لا يُريدون علواً في الأرض } أي: تكبراً وقهراً كحال فرعون\n { ولا فساداً } عملاً بالمعاصي\n أو ظلماً على الناس\n كحال قارون\n أو قتل النفس\n أو: دعاء إلى عبادة غير الله\n ولم يعلق الوعد بترك العلو والفساد\n ولكن بترك إرادتهما وميل القلب إليهما\n أدرك ذلك بالفعل أم لا\n وعن علي رضي الله عنه: إن الرجل ليعجبه أن يكون شراك نعله أجود من شراك نعل صاحبه\n فيدخل تحتها\n وعن الفضيل: أن قرأها\n ثم قال: ذهبت الأماني ها هنا وعن عمر عبد العزيز رضي الله عنه أنه كان يرددها حتى قُبض\n { والعاقبة } المحمودة { للمتقين } ما لا يرضاه الله من العلو والفساد وغير ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:24",
      "similarity": 0.41848945596888926
    },
    {
      "verse": "26:152",
      "similarity": 0.41488833854377494
    },
    {
      "verse": "2:11",
      "similarity": 0.39609715381765775
    },
    {
      "verse": "28:77",
      "similarity": 0.3877152038428449
    },
    {
      "verse": "28:37",
      "similarity": 0.3710883617850305
    }
  ]
}