{
  "chapter": "القصص",
  "text": "واصبح الذين تمنوا۟ مكانه بالامس يقولون ويكان الله يبسط الرزق لمن يشاء من عباده ويقدر لولا ان من الله علينا لخسف بنا ويكانه لا يفلح الكفرون",
  "translations": [
    {
      "translation": "Those who had longed to take his place the day before woke up saying, 'Allah expands the provision of any of His slaves He wills or restricts it. If Allah had not shown great kindness to us, we would have been swallowed up as well. Ah! Truly the kafirun are not successful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were envious of his position only yesterday said on the morrow: \"Indeed God increases the fortunes of those of His creatures as He will, and decreases. Had God not been gracious to us He could have (opened up) the earth and made it swallow us. Surely the infidels will not succeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had envied his position the day before began to say on the morrow: \"Alas, we had forgotten that it is Allah Who increases the provision of those of His servants whom He will and grants in sparing measure to those whom He will. But for Allah's favour upon us, He could have made us to be swallowed too. Alas, we had forgotten that the unbelievers do not prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people who the other day had wished to be like him, began saying, \"Woe to us! God gives abundant wealth only to those of His servants whom He wants and He determines everyone's share. Had it not been for God's favor to us, He would have caused the earth to swallow us up. Woe to the unbelievers who will have no happiness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had the day before desired his status, said in the morning, “It is strange – Allah expands the sustenance for whomever He wills among His bondmen, and restricts it; if Allah had not been gracious to us He would have buried us too; strangely, the disbelievers do not prosper.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who desired his position the day before, began to say: \"Know you not that it is Allah Who expands the provision or restricts it to whomsoever He pleases of His servants. Had it not been that Allah was Gracious to us, He could have caused the earth to swallow us up! Know you not that the disbelievers will never be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who yearned for his place only the day before began to say: Ah! (know) that Allah amplifies and straitens the means of subsistence for whom He pleases of His servants; had not Allah been gracious to us, He would most surely have abased us; ah! (know) that the ungrateful are never successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in the morning those who had longed to be in his place the day before were saying, 'Ah, God outspreads and straitens His provision to whomsoever He will of His servants. Had God not been gracious to us, He would have made us to be swallowed too. Ah, the unbelievers do not prosper,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And morning found those who had coveted his place but yesterday crying: Ah, welladay! Allah enlargeth the provision for whom He will of His slaves and straiteneth it (for whom He will). If Allah had not been gracious unto us He would have caused it to swallow us (also). Ah, welladay! the disbelievers never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had coveted his position the day before now began to say, \"Ah! It is indeed God alone who gives abundantly to whom He will and sparingly to whom He pleases. Had not God been gracious to us, He would have caused us to be swallowed up also.\" Alas indeed! Those who deny the truth will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had wished for his place but yesterday began to say: Ah! Allah expandeth the provision for whomsoever He will of His bondmen and stinteth, had not Allah been gracious unto us, He would have sunk the earth with us also. Ah! the infidels thrive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By dawn those who longed to be in his place the day before were saying, ‘Don’t you see that Allah expands the provision for whomever He wishes of His servants, and tightens it? Had Allah not shown us favour, He might have made the earth swallow us too. Don’t you see that the faithless do not prosper?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had envied his position the day before began to say on the morrow: \"Ah! it is indeed Allah Who enlarges the provision or restricts it, to any of His servants He pleases! had it not been that Allah was gracious to us, He could have caused the earth to swallow us up! Ah! those who reject Allah will assuredly never prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had desired (for a position like) his position the day before, began to say: \"Know you not that it is Allah Who enlarges the provision or restricts it to whomsoever He pleases of His slaves. Had it not been that Allah was Gracious to us, He could have caused the earth to swallow us up (also)! Know you not that the disbelievers will never be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the morning those who had wished to be in his place the previous evening said: 'Indeed, Allah outspreads to whom He will among His worshipers, and He restrains. Had He not shown us favor, He could have caused the earth to swallow us. Indeed, the unbelievers shall never prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had wished they were in his position the day before were saying, “Indeed, it is God who spreads the bounty to whomever He wills of His servants, and restricts it. Had God not been gracious to us, He would have caved in on us. No wonder the ungrateful never prosper.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had wished for his position the previous day began to say, \"Oh, how Allah extends provision to whom He wills of His servants and restricts it! If not that Allah had conferred favor on us, He would have caused it to swallow us. Oh, how the disbelievers do not succeed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:82] And those who had longed to be in his place the day before, that is, only recently, were saying, ‘Alas! God expands provision for whomever He will of His servants and straitens [it], He restricts it for whomever He will (way-ka’anna: way is a noun of action, with the sense of ‘How astonished I am’, while the kāf functions as a [causative] lām, ‘because’). Had God not been gracious to us, He would have made us to be swallowed too’ (read active la-khasafa, or passive la-khusifa). Lo! indeed those who are ungrateful, for God’s grace, such as Korah, never prosper.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And morning found those who had coveted his place) his status, standing and wealth (but yesterday crying) to one another: (Ah, welladay!) it is not as Korah said, i.e. that his wealth was his own doing, but rather (Allah enlargeth the provision for whom He will of His slaves) and in the case of Korah such wealth was a lure to perdition (and straiteneth it (for whom He will)) out of care for the person. (If Allah had not been gracious unto us) and withheld from us what He gave him, (He would have caused it to swallow us (also)) as it swallowed Korah. (Ah, welladay! the disbelievers never prosper) they will never be safe from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيْكَأَنَّ ٱللَّهَ يَبْسُطُ } معناه ألا تَعلمْ أَنَّ الله يَبسُطُ الرِّزقَ لِمن يَشاءُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"Indeed, Allah enlarges the provision for whom He wills and restricts [it] for whom He wills,\" {wa-yuka'anna Allaha yabsutu} means, \"Do you not know that Allah enlarges the provision for whoever He wills and restricts it for whoever He wills?\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَصْبَحَ } الفقراء { ٱلَّذِينَ تَمَنَّوْاْ مَكَانَهُ } ومنزلته { بِٱلأَمْسِ } أي: الزمان الذي هو أقرب زمن بخسفه، متحسرين بما عنده من الثروة والجاه، أخذوا { يَقُولُونَ } متمنين على عكس متمناهم السابق، متعجبين من كمال علم الله ومتانة حكمته، قائلين كل منهم لصاحبه: { وَيْكَأَنَّ } المعنى على الانفصال بين \" ويك \" و \" أن \" والاتصال بينهما إنما هو بمتابعة المصحف؛ يعني: ويل لك، وهلاكك لازم بمتمناك الذي تمنيته بالأمس، اعلم أن { ٱللَّهَ } الحكيم المتقن في أفعاله { يَبْسُطُ ٱلرِّزْقَ } بمقتضى حكمته { لِمَن يَشَآءُ مِنْ عِبَادِهِ } على مقتضى استعداداتهم { وَيَقْدِرُ } أي: يقبض عن من يشاء أيضاً على وفق استعداده، وما لنا اطلاع على متانة علمه وحكمته { لَوْلاۤ أَن مَّنَّ ٱللَّهُ } المصلح لمفسادنا { عَلَيْنَا } بمنعنا عن متمناها { لَخَسَفَ بِنَا } أيضاً من شؤم مبتغانا، مثل ما خسف قارون، وإنما منَّ علينا ما منَّ؛ لإيماننا به سبحانه، وإخلاصنا فيه { وَيْكَأَنَّهُ لاَ يُفْلِحُ ٱلْكَافِرُونَ } [القصص: 82] ولا يفوزون بالنجاة عن عذابه سبحانه، بل يوفقهم سبحانه على ما يوقعهم في عذابه افتناناً منه وانتقاماً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأصبح } أي: وصار { الذين تمنَّوا مكانَه } أي: منزلته من الدنيا { بالأمس }: متعلق بتمنوا\n ولم يُرد به اليوم الذي قبل يومك، ولكن الوقت القريب، استعارة\n { يقولون ويْكأنّ الله يبسط الرزق لمن يشاء من عباده ويقدرُ } أي: أعجب مما صنع بقارون لأن الله يبسط الرزق لمن يشاء، وهو عنده ممقوت، { ويقدر } أي: يضيقه على من يشاء، وهو عنده محبوب\n\n\n{ لولا أن مَنَّ الله علينا } بصرف ما كنا نتمناه بالأمس، { لخسف بنا } معه، كما فعل بالرجلين { ويْكأنه لا يُفلح الكافرون } أي: اعجب لعدم فلاح الكافرين\n قال الرضي: كأنه المخاطب كان يدعي أنهم يفلحون، فقال له: عجباً منك، فسئل: لم تتعجب منه؟ فقال: إنه لا يفلح الكافرون، فحذف حرف الجار\n وقال ابن عزيز: ويكأن الله معناه\n ألم تر أن الله\n واقتصر عليه البخاري\n والله تعالى أعلم\n الإشارة: في الآية ترهيب من التعمق في زينة الدنيا، والتكاثر بها\n ومن تمنى ما لأربابها من غرور زخرفها، وترغيب في الزهد فيها، وإيثار الفقر على الغنى، والتبذل والتخشن على ملاذ ملابسها ومطاعمها\n قال الشيخ العارف سيدي عبد الرحمن بن يوسف اللجائي في كتابه: اعلم أن الدنيا إذا عظمت وجلّت في قلب عبد، فإن ذلك العبد يعظم قدر من أقبلت عليه الدنيا، ويتمنى أن ينال منها ما نال، فإن كل إنسان يعظم ما اشتهت نفسه\n وهذه صفة عبيد الدنيا، وعبيد أهوائهم\n وهي صفة من أسكرته الغفلة، وخرجت عظمة الله عز وجل من قلبه، وإلى هذه الإشارة بقوله تعالى: { قال الذين يريدون الحياة الدنيا\n\n\n } الآية\n فكل محب للدنيا، مستغرق في حبها، فهو لاحق بالذين تمنوا زينة قارون\n واعلم أن الدنيا إذا رسخت في القلب، واستوطنت، ظهر ذلك على جوارح العبد، بتكالبه عليها، وشدة رغبته فيها، فيسلبه الله تعالى لذة القناعة، ويمنعه سياسة الزاهدين، ويبعده عن روح العارفين فإن القلب إذا لم يقنع ـ لو ملك الدنيا بحذافيرها ـ لم يشبع\n وقال بعض الحكماء: القناعة هي الغنى الأكبر، ولن تخفى صفة القانعين\n هـ\n ومآل الراغبين في الدنيا هو مآل قارون، من الفناء والذهاب تحت التراب، وأنشدوا:\n\nثم ذكر عاقبة المتواضعين، فقال: { تِلْكَ ٱلدَّارُ ٱلآخِرَةُ نَجْعَلُهَا\n\n\n }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:18",
      "similarity": 0.23588395233758305
    },
    {
      "verse": "28:19",
      "similarity": 0.23351615535584855
    },
    {
      "verse": "10:24",
      "similarity": 0.17993582097731617
    },
    {
      "verse": "75:8",
      "similarity": 0.1390525372438111
    },
    {
      "verse": "16:45",
      "similarity": 0.1366227349358836
    }
  ]
}