{
  "chapter": "القصص",
  "text": "ان الذى فرض عليك القرءان لرادك الى معاد قل ربى اعلم من جاء بالهدى ومن هو فى ضلل مبين",
  "translations": [
    {
      "translation": "He who has assigned (the propagation) of the Qur'an to you will bring you back to the destination. Say: \"My Lord knows who has come to guidance, and who is clearly in error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), surely He Who has ordained the Qur'an on you will bring you to the best end. Say to them: \"My Lord knows best who has brought true guidance and who is in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), God, Who has commanded you to follow the guidance of the Quran, will certainly return you victoriously to your place of birth. Say, \"My Lord knows best who has brought guidance and who is in plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed He Who has ordained the Qur’an upon you, will surely bring you back to where you wish; proclaim, “My Lord well knows him who came with guidance, and him who is in open error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, He Who has given you the Qur'an, will surely bring you back to the return. Say: \"My Lord is Aware of him who brings guidance, and of him who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely He Who has made the Quran binding on you will bring you back to the destination. Say: My Lord knows best him who has brought the guidance and him who is in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who imposed 'the Recitation upon thee. shall surely restore thee to a place of homing. Say: 'My Lord' knows very well who comes with guidance, and who is in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! He Who hath given thee the Qur'an for a law will surely bring thee home again. Say: My Lord is Best Aware of him who bringeth guidance and him who is in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who has entrusted you with the responsibility of the Quran, will surely lead you to a successful end. Say, \"My Lord knows best who is rightly guided and who is in gross error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily He who hath imposed the Qur'an on thee Is surely about to bring thee back home. Say thou: my Lord knoweth best who bringeth guidance and who is in an error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed He who has revealed to you the Quran will surely restore you to the place of return. Say, ‘My Lord knows best him who brings guidance and him who is in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily He Who ordained the Qur'an for thee, will bring thee back to the Place of Return. Say: \"My Lord knows best who it is that brings true guidance, and who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, He Who has given you (O Muhammad SAW) the Quran (i.e. ordered you to act on its laws and to preach it to others) will surely bring you back to the Ma'ad (place of return, either to Makkah or to Paradise after your death, etc.). Say (O Muhammad SAW): \"My Lord is Aware of him who brings guidance, and he who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who has obligated the Koran will bring you to an appointment. Say: 'My Lord knows well who comes with guidance, and who is in clear error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who ordained the Quran for you will return you Home. Say, “My Lord knows best who comes with guidance, and who is in manifest error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, [O Muhammad], He who imposed upon you the Qur'an will take you back to a place of return. Say, \"My Lord is most knowing of who brings guidance and who is in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:85] Indeed He Who has prescribed for you the Qur’ān, [He Who] has revealed it, will surely restore you to a place of return, to Mecca — he had yearned for it. Say: ‘My Lord knows best him who brings guidance and   him who is in manifest error’ — this was revealed in order to refute what the Meccan disbelievers had said to him: ‘Indeed, you are error’. In other words [God is saying that] he [the Prophet] is the one who has brought guidance, while they are the ones in error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! He Who hath given thee the Qur'an for a law) He Who has sent you Gabriel with the Qur'an (will surely bring you again to the place of return) to Mecca; and it is said: to Paradise. (Say) Muhammad: (My Lord is best aware of he who bringeth guidance) the profession of Allah's divine Oneness and the Qur'an (and him who is in error manifest) and him who is in manifest disbelief and error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَرَضَ عَلَيْكَ ٱلْقُرْآنَ } معناه أنزلَهُ\n وقال: أعطاكه\n\n\n\n\nوقوله تعالى: { لَرَآدُّكَ إِلَىٰ مَعَادٍ } معناه إلى المَوتِ\n وقال: إلى مَولِدِكَ بِمكة\n وقال: إلى الجَنةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا اغتم رسول الله صلى الله عليه وسلم حين هاجر من مكة بسبب مكر المشركين، فلما وصل إلى جحفة اشتد اشتياقه إلى مولده وموطن آبائه، وتحزن حزناً شديداً إلى حيث أراد أن يعود منها إليها، فنزلت تسليةً عليه صلى الله عليه وسلم، وإزالةً لحزنه: { إِنَّ } القادر المقتدر { ٱلَّذِي فَرَضَ عَلَيْكَ ٱلْقُرْآنَ } وقدر لك إنزاله، وأقدرك على الامتثال بجميع ما فيه من الأوامر والنواهي وكشف عليك ما فيه من الحقائق والمعارف، والرموز والإشارات المتعقلة بصفاء مشرب التوحيد، وذكر لك فيه القصص والعبر والأمثال إرشاداً لك إلى مقامك الذي وعدك الحق تفضلاً وامتناناً، وسماه من عنده مقاماً محموداً { لَرَآدُّكَ } ومعاودك { إِلَىٰ مَعَادٍ } معهود، هو مولدك وموظن آبائك وأسلافك على أحسن وجه وأكمله\n\n\n\n\nوبعدما عدت ورجعت إليه بعد هجرتك من بينهم أو أضلوك ونسبوك إلى ما لا يليق بشأنك { قُل } لهم على سبيل المجاراة: { رَّبِّيۤ } الذي وسع علمه كل شيء { أَعْلَمُ } بعلمه الحضوري { مَن جَآءَ بِٱلْهُدَىٰ } منَّا أنا أو أنتم { وَمَنْ هُوَ فِي ضَلاَلٍ مُّبِينٍ } [القصص: 85] منَّا ومنكم\n\n\n\n\n{ وَ } عليك يا أكمل الرسل أن تفوض أمورك إلينا اتكالاً علينا، واعتصاماً لحولنا وقوتنا، ولا تلتفت إلى المشركين وإيمانهم ولا تداريهم، ولا تك في رعبٍ منهم، إنَّا كفيناك مؤنة شرورهم عنك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ولا يصدنك: مجزوم بحذف النون، وحذفت الواو لالتقاء الساكنين، حين دخلت نون التوكيد\n يقول الحق جل جلاله: لرسوله صلى الله عليه وسلم { إن الذي فَرَضَ عليك القرآن } أي: أوجب عليك تلاوته وتبليغه، والعمل بما فيه، { لرادُّك إلى معاد } عظيم، وهو المعاد الجسماني لتقوم المقام المحمود، الذي لا يقوم فيه أحد غيرك، مع حضور الأكابر من الرسل وغيرهم\n أو: لرادك إلى معادك الأول، وهو مكة، وكان عليه الصلاة والسلام اشتاق إليها لأنها مولده ومولد آبائه، وقد ردّه إليها يوم الفتح، وإنما نكَّره لأنه كان في ذلك اليوم معاد له شأن، ومرجع له اعتداد لغلبته - عليه الصلاة والسلام - ونصره، وقهره لأعدائه، ولظهور عز الإسلام وأهله، وذل الشرك وحزبه\n والسورة مكية، لكن هذه الآية نزلت بالجُحْفَةِ، لا بمكة ولا بالمدينة، وفي الآية وعد بالنصر، وأن العاقبة الحسنة والخير الجسيم للنبي صلى الله عليه وسلم لا يختص بالآخرة، بل يكون في الدنيا له ولمتَّبِعيهِ، ولكن بعد الابتلاء والامتحان، كما في صدر السورة الآتية بعدها، وبهذا يقع التناسب بينهما، فإنها كالتعليل لِمَا قبلها\n ولما وعده بالنصر قال له: قل ربي أعلم من جاء بالهُدى أي: يعلم مَنْ جاء بالحق، يعني نَفْسَهْ صلى الله عليه وسلم مع ما يستحقه من النصر والثواب، في معاده، { ومن هو في ضلال مبين } وهم المشركون، مع ما يستحقونه من العقاب في معادهم",
      "translations": []
    }
  ]
}