{
  "chapter": "القصص",
  "text": "من جاء بالحسنة فله خير منها ومن جاء بالسيئة فلا يجزى الذين عملوا۟ السيـات الا ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Anyone who does a good action will get something better. As for anyone who does a bad action, those who have done bad actions will only be repaid for what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does good will receive better than what he has done; and whoever does ill shall be requited but to the extent of what he does.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who shall bring a good deed shall be rewarded with what is better. But those who bring evil deeds shall not be requited more than their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The reward for a good deed will be greater than the deed itself and the recompense for an evil deed will be equivalent to the deed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings virtue, for him is better than it; and whoever brings evil – so those who commit evil will not be repaid except to the extent of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever brings good, he shall have the better thereof; and whosoever brings evil, then those who do evil deeds will only be requited for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings good, he shall have better than it, and whoever brings evil, those who do evil shall not be rewarded (for) aught except what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso brings a good deed shall have better than it; and whoso brings an evil deed those who have done evil deeds shall only be recompensed for that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso bringeth a good deed, he will have better than the same; while as for him who bringeth an ill-deed, those who do ill-deeds will be requited only what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does good shall be rewarded with something better. But he who does evil shall be requited according to his deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever bringeth good shall have better than it, and whosoever bringeth evil, then those who do ill works shall be rewarded only for that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings virtue shall receive [a reward] better than it, but whoever brings vice—those who commit misdeeds shall not be requited except for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any does good, the reward to him is better than his deed; but if any does evil, the doers of evil are only punished (to the extent) of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever brings good (Islamic Monotheism along with righteous deeds), he shall have the better thereof, and whosoever brings evil (polytheism along with evil deeds) then, those who do evil deeds will only be requited for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever does a good deed shall have better than it. But whosoever does evil deeds, they shall be recompensed for what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a virtue will receive better than it. But whoever brings evil—the evildoers will be rewarded only according to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes [on the Day of Judgement] with a good deed will have better than it; and whoever comes with an evil deed - then those who did evil deeds will not be recompensed except [as much as] what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:84] Whoever brings a good deed shall have better than it, as a reward, because of it, and this will be the like of it tenfold; while whoever brings an evil deed, those who commit evil deeds shall only be requited, the requital, for what they used to do, in other words, [only] the like of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "446 (Whoso bringeth a good deed) the sincere profession of \"there is no god except Allah\", (he will have better than the same) he will reap goodness from it; (while as for him who bringeth an ill deed) associating partners with Allah, (those who do ill deeds) associating partners with Allah (will be requited only what they did) the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { مَن جَآءَ } في النشأة الأولى { بِٱلْحَسَنَةِ } والخصلة المقبولة عند الله وعند عموم عباده ابتغاءً لمرضاته سبحانه\n وأداءً لحقوق عباده { فَلَهُ } عند الله في النشأة الأخرى جزاءً عليها { خَيْرٌ مِّنْهَا } وبأضعافها تفضلاً وإحساناً { وَمَن جَآءَ بِٱلسَّيِّئَةِ } والخصلة الذميمة أيضاً فيها\n المستقبحة عقلاً وشرعاً { فَلاَ يُجْزَى } من قبل الحق في يوم الجزاء المسيئون { ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّئَاتِ } التي لا يرضى بها الله ولا خُلَّص عباده { إِلاَّ } مثل { مَا كَانُواْ يَعْمَلُونَ } [القصص: 84] عدلاً منه سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن جاء بالحسنة فله خيرٌ منها } ذاتاً وقدراً ووصفاً\n { ومن جاء السيئة } مالا يرضاه الله تعالى\n { فلا يجزى الذين عملوا السيئات } \n أصله: فلا يجزون\n وضع الظاهر موضع المضمر لِمَا في إسناد السيئات إليهم من تقبيح رأيهم وتسفية أحلامهم\n وزيادة تبغيض السيئات إلى قلوب السامعين\n { إلا ما كانوا يعملون } إلا جزاء عملهم فقط\n ومن فضله العظيم ألا يجزي السيئة إلا مثلها\n ويجزي الحسنة بعشر أمثالها إلى سبعمائة\n الإشارة: جعل الله الدار الآخرة للمتواضعين\n أهل الذل والإنكسار\n والعاقبة المحمودة - وهي الوصول إلى الحضرة - للمتقين الشهرة والاستكبار\n وفي الحكم: \" ادفن نفسك في أرض الخمول فَمَا نَبَتَ مِمَّا لَمْ يُدفنْ لاَ يَتِمُّ نِتَاجُهُ \"\n قال في التنبيه: لا شيء أضر على المريد من الشهرة وانتشار الصيت لأن ذلك من أعظم حظوظه\n التي هي مأمور بتركها\n ومجاهدة النفس فيها\n وقد تسمح نفس المريد بترك ما سوى هذا من الحظوظ\n هـ\n وكان شيخ شيخنا يقول: نحب المريد أن يكون قدمه أعظم من صيته\n ولا يكون صيته أعظم من قدمه\n هـ\n وقال إبراهيم بن أدهم رضي الله عنه: ما صدق الله من أحب الشهرة\n وقال بعضهم: طريقتنا هذه لا تصلح إلا بأقوام كنست بأرواحهم المزابل\n وقال أيوب رضي الله عنه: ما صدق عبد إلا سَرَّهُ ألا يشعر بمكانه\n وقال في القوت: ومتى ذل العبد نفسه\n واتضع عندها\n فلم يجد لذلته طعماً\n ولا لضعته حسماً\n فقد صار الذل والتواضع كونَه\n فهذا لا يكره الذم من الخلق لوجود النقص في نفسه\n ولا يحب المدح منهم لفقد القدر والمنزلة في نفسه\n فصارت الذلة والضعة صفة لا تفارقه\n لازمة لزوم الزبالة للزبال\n والكساحة للكساح\n هما صنعتان له كسائر الصنائع\n وربما فخروا بهما لعدم النظر إلى نقصهما\n\nفهذه ولاية عظيمة له من ربه\n قد ولاّه على نفسه\n وملّكه عليها\n فقهرها بعزه\n وهذا مقام محبوب\n وبعده المكاشفات بسرائر الغيوب\n ثم قال: ومن كان حاله مع الله تعالى الذل طلبه واستحلاه\n كما يطلب المتكبر العز\n ويستحليه إذا وجده\n فإن فارق ذلك الذل ساعة تغير قلبه لفراق حاله\n كما أن المتعزز إن فارق العز ساعة تكدر عليه عيشه لأن ذلك عيش نفسه\n هـ\n قلت: وهذا مقام من المقامات\n والعارف الكالم لا يتغير قلبه على فقد شيء إذ لم يفقد شيئاً بعد أن وجد الله\n مَاذَا فَقَدَ مَنْ وَجَدَكَ\n والذي ذكره في القوت هو حال السائرين الصادقين\n وبالله التوفيق\n ثم ذكر عاقبة سيّد المتقين\n فقال: { إِنَّ ٱلَّذِي فَرَضَ عَلَيْكَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:31",
      "similarity": 0.7325599676721728
    },
    {
      "verse": "39:35",
      "similarity": 0.6565023751752732
    },
    {
      "verse": "29:7",
      "similarity": 0.637831397006946
    },
    {
      "verse": "37:39",
      "similarity": 0.5532744197893065
    },
    {
      "verse": "56:24",
      "similarity": 0.5176716378535692
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028084.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028084.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:84.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}