{
  "chapter": "القصص",
  "text": "وقالت امرات فرعون قرت عين لى ولك لا تقتلوه عسى ان ينفعنا او نتخذه ولدا وهم لا يشعرون",
  "translations": [
    {
      "translation": "The wife of Pharaoh said, 'A source of delight for me and for you; do not kill him. It may well be that he will be of use to us or perhaps we could adopt him as a son.' They were not aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh's wife said: \"He will be a comfort to me and to you. Do not kill him. He may well be of some advantage to us, or we may adopt him as a son.\" They were not aware (of what the future held in store).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wife of Pharaoh said: \"Here is a delight of the eye to me and to you. Do not kill him. Maybe he will prove useful for us, or we may adopt him as a son.\" They were unaware of the end of it all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh's wife said, \"He, (Moses), is the delight of our eyes. Do not kill him. Perhaps he will benefit us or we may adopt him.\" They were unaware of the future.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Firaun’s wife said, “This child is the comfort of my eyes and yours*; do not kill him; perhaps he may benefit us, or we may adopt him as our son” – and they were unaware. (Had Firaun also said the same, Allah would have granted him faith.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the wife of Fir`awn said: \"A comfort of the eye for me and for you. Kill him not, perhaps he may be of benefit to us, or we may adopt him as a son.\" And they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Firon's wife said: A refreshment of the eye to me and to you; do not slay him; maybe he will be useful to us, or we may take him for a son; and they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Pharaoh's wife, 'He will be a comfort to me and thee. Slay him not; perchance he will profit us, or we will take him for a son.' And they were not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the wife of Pharaoh said: (He will be) a consolation for me and for thee. Kill him not. Peradventure he may be of use to us, or we may choose him for a son. And they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Pharaoh's wife said, \"He will be a joy to the eye for me and you! Do not slay him: he may well be of use to us, or we may adopt him as a son.\" They did not realize what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the wife of Fir'awn said: a comfort unto me and thee slay him not; belike he shall be of benefit to us or we might like him for a son; and they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh’s wife said [to him], ‘[This infant will be] a [source of] comfort to me and to you. Do not kill him. Maybe he will benefit us, or we will adopt him as a son.’ But they were not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wife of Pharaoh said: \"(Here is) joy of the eye, for me and for thee: slay him not. It may be that he will be use to us, or we may adopt him as a son.\" And they perceived not (what they were doing)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the wife of Fir'aun (Pharaoh) said: \"A comfort of the eye for me and for you. Kill him not, perhaps he may be of benefit to us, or we may adopt him as a son.\" And they perceive not (the result of that).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh's wife said to him: 'He will be a comfort to me and you. Do not slay him, perhaps he may benefit us, or we will take him for our son' But they were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh’s wife said, “An eye's delight for me and for you. Do not kill him; perhaps he will be useful to us, or we may adopt him as a son.” But they did not foresee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the wife of Pharaoh said, \"[He will be] a comfort of the eye for me and for you. Do not kill him; perhaps he may benefit us, or we may adopt him as a son.\" And they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[28:9] And Pharaoh’s wife said, after he and his aids had resolved to slay him: he is, ‘A joyous sight for me and you. Do not slay him. Perhaps he will be of benefit to us, or we will adopt him as a son’, and so they obeyed her [wish]. And they were not aware, of the sequel to their affair with him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالَتِ امْرَأَةُ فِرْعَوْنَ قُرَّةُ عَيْنٍ لِي وَلَكَ لَا تَقْتُلُوهُ عَسَى أَنْ يَنْفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ (9)يدل الكلام على أن الذين انتشلوه جعلوه بين أيدي فرعون وامرأته فرقت له امرأة فرعون وصرفت فرعون عن قتله بعد أن هم به لأنه علم أن الطفل ليس من أبناء القبط بلون جلوته وملامح وجهه ، وعلم أنه لم يكن حمله النيل من مكان بعيد لظهوره أنه لم يطل مكث تابوته في الماء ولا اضطرابه بكثرة التنقل ، فعلم أن وقعه في التابوت لقصد إنجائه من الذبح . وكان ذلك وقت انتشاله من الماء وإخراجه من التابوت . وكانت امرأة فرعون امرأة ملهمة للخير وقدّر الله نجاة موسى بسببها . وقد قال الله تعالى في شأنها { وضرب الله مثلاً للذين ءامنوا امرأة فرعون إذ قالت رب ابن لي عندك بيتاً في الجنة ونجِّني من فرعون وعمله ونجِّني من القوم الظالمين } \\[ التحريم : 11 \\] ، وهي لم تر عداوة موسى لآل فرعون ولا حزنت منه لأنها انقرضت قبل بعثة موسى .و { امرأة فرعون } سميت آسية كما في الحديث المروي عن النبي صلى الله عليه وسلم « كمل من الرجال كثير ولم يكمل من النساء إلا مريم ابنة عمران وآسية امرأة فرعون » ويفيد قولها ذلك أن فرعون حين رآه استحسنه ثم خالجه الخوف من عاقبة أمره فلذلك أنذرته امرأته بقولها { قرة عين لي ولك لا تقتلوه } .وارتفع { قرة عين } على أنه خبر لمبتدأ محذوف تقديره : هذا الطفل . وحذفه لأنه دل عليه حضوره بين أيديهم وهو على حذف مضاف ، أي هو سبب قرة عين لي ولك .و ( قرة العين ) كناية عن السرور وهي كناية ناشئة عن ضدها وهو سُخْنة العين التي هي أثر البكاء اللازم للأسف والحزن ، فلما كُني عن الحزن بسخنة العين في قولهم في الدعاء بالسوء : أسخن الله عينه . وقول الراجز :أوه أديم عرضه وأسخن ... بعينه بعد هجوع الأعينأتبعوا ذلك بأن كنّوا عن السرور بضد هذه الكناية فقالوا : قرة عين ، وأقر الله عينه ، فحكى القرآن ما في لغة امرأة فرعون من دلالة على معنى المسرّة الحاصلة للنفس ببليغ ما كنّى به العرب عن ذلك وهو { قرة عين } ، ومن لطائفه في الآية أن المسرة المعنية هي مسرة حاصلة من مرأى محاسن الطفل كما قال تعالى { وألقيت عليك محبة مني } \\[ طه : 39 \\] .ويجوز أن يكون قوله { قرة عين } قسماً كما يقال : أيمن الله . فإن العرب يقسمون بذلك ، أي أقسم بما تقرّ به عيني . وفي الحديث الصحيح : أن أبا بكر الصديق استضاف نفراً وتأخر عن وقت عشائهم ثم حضر ، وفيه قصة إلى أن قال الراوي : فجعلوا لا يأكلون لقمة إلا ربت من أسفلها أكثر منها . فقال أبو بكر لامرأته : يا أخت بني فراس ما هذا؟ فقالت : وقُرّة عيني إنها الآن أكثر من قبل .فتكون امرأة فرعون أقسمت على فرعون بما فيه قرة عينها ، وقرة عينه أن لا يقتل موسى ، ويكون رفع { قرة عينٍ } على الابتداء وخبره محذوفاً ، وهو حذف كثير في نص اليمين مثل : لعمرك . وابتدأت بنفسها في { قرة عين لي } قبل ذكر فرعون إدلالاً عليه لمكانتها عنده أرادت أن تبتدره بذلك حتى لا يصدر عنه الأمر بقتل الطفل .وضمير الجمع في قولها { لا تقتلوه } يجوز أن يراد به فرعون نزّلته منزلة الجماعة على وجه التعظيم كما في قوله { قال رب ارجعون } \\[ المؤمنون : 99 \\] . ويجوز أن يراد به خطاب فرعون داخلاً فيه أهل دولته هامان والكهنة الذين ألقوا في نفس فرعون أن فتى من إسرائيل يفسد عليه مملكته . وهذا أحسن لأن فيه تمهيداً لإجابة سُؤْلها حين أسندت معظم القتل لأهل الدولة وجعلت لفرعون منه حظ الواحد من الجماعة فكأنها تعرّض بأن ذلك ينبغي أن لا يكون عن رأيه فتهوِّن عليه عدوله في هذا الطفل عما تقرر من قتل الأطفال . وقيل { لا تقتلوه } التفات عن خطاب فرعون إلى خطاب الموكّلين بقتل أطفال إسرائيل كقوله { يوسف أعرض عن هذا واستغفري لذنبك } \\[ يوسف : 29 \\] .فموقع جملة { قرة عين لي ولك } موقع التمهيد والمقدمة للعرض . وموقع جملة { لا تقتلوه } موقع التفريع عن المقدمة ولذلك فصلت عنها .وأما جملة { عسى أن ينفعنا } فهي في موقع العلة لمضمون جملة { لا تقتلوه } فاتصالها بها كاتصال جملة { قرة عين لي ولك } بها ، ولكن نظم الكلام قضى بهذا الترتيب البليغ بأن جعل الوازع الطبيعي عن القتل وهو وازع المحبة هو المقدِّمة لأنه أشدّ تعلقاً بالنفس فهو يشبه المعلوم البديهي . وجعل الوازع العقلي بعد النهي علةً لاحتياجه إلى الفكر ، فتكون مهلة التفكير بعد سماع النهي الممهد بالوازع الطبيعي فلا يخشى جماح السامع من النهي ورفضه إياه .ويتضمن قولها { عسى أن ينفعنا أو نتخذه ولداً } إزالة ما خامر نفس فرعون من خشية فساد ملكه على يد فتى إسرائيلي بأن هذا الطفل لا يكون هو المخوف منه لأنه لما انضم في أهلهم وسيكون ربيَّهم فإنه يرجى منه نفعهم وأن يكون لهم كالولد . فأقنعت فرعون بقياس على الأحوال المجربة في علاقة التربية والمعاشرة والتبني والإحسان ، وإن الخير لا يأتي بالشر . ولذلك وقع بعده الاعتراض بقوله تعالى { وهم لا يشعرون } أي وفرعون وقومه لا يعلمون خفي إرادة الله من الانتقام من أمة القبط بسبب موسى . ولعل الله حقق لامرأة فرعون رجاءها فكان موسى قرة عين لها ولزوجها ، فلما هلكا وجاء فرعون آخر بعدهما كان ما قدّره الله من نصر بني إسرائيل .واختير { يشعرون } هنا لأنه من العلم الخفي ، أي لا يعلمون هذا الأمر الخفي .\n\n",
      "translations": [
        {
          "translation": "(And the wife of Pharaoh) Asiyah Bint Muzahim, who was Moses' aunt (said: (He will be)) this child will be (a consolation for me and for you) Pharaoh. (Kill him not. Peradventure he may be of use to us) in our farm, (or we may choose him for a son) or adopt him as a son. (And they perceived not) the Children of Israel did not know that he was not from them; it is also said that this means: and they did not know that their destruction will be at his hands.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ففتحته آسية بعدما رأت نوراً في جوفه فأحبّته { عسى أن ينفعنا } في تحصيل أسباب المعاش ورعاية المصالح وتدبير الأمور بالرأي { أو نتخذه ولداً } بأن يناسب النفس دون الروح\n ويتبع الهوى\n ويخدم البدن بالإصلاح\n فيقوينا { وهم لا يشعرون } على أن الأمر على خلاف ذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل نحفظه { عَسَىٰ أَن يَنْفَعَنَا } أي: رجاء أن ينفع نفعاً { أَوْ نَتَّخِذَهُ وَلَداً } خلفاً لنا إذ ظهر على رشد تام وعقل كامل { وَهُمْ لاَ يَشْعُرُونَ } [القصص: 9] إنه عدوهم الذي يهذب به دولتهم وملكهم بيدهن وهلاكهم بسببه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قالت: { لا تقتلوه } \nخاطبته خطاب الملوك\n أو خاطبت القُواد\n { عسى أن ينفعنا } فإن فيه مَخَايلَ اليُمنِ ودلائلَ النفع\n وذلك لِمَا عَايَنَتْ من النور وبرْءِ البرصاء\n { أو نتخذه ولدا } أو: نتبناه فإنه أهل لأَن يكون ولد الملوك\n قال تعالى: { وهم لا يشعرون } ما يكون من أمره وأمرهم\n أو: لا يشعرون أن هلاكهم على يديه\n أو: لا يشعرون أنهم على خطأ عظيم في التقاطه ورجاء النفع منه\n والله تعالى أعلم\n الإشارة: يقال لمن يعالج تربية مريد: أرضعه من لبن علم الغيوب\n فإذا خفت عليه الوقوف مع الشرائع\n فألقه في اليم في بحر الحقائق\n ولا تخف ولا تحزن\n إنا رادوه إلا بر الشرائع\n ليكون من الكاملين\n لأن من غرق في بحر الحقيقة\n على يد شيخ كامل\n لا بد أن يخرجه إلى بر الشريعة ويسمى البقاء\n وهو القيام برسم الشرائع\n فالبقاء يطلب الفناء\n فمن تحقق بمقام الفناء فلا بد أن يخرج إلى البقاء\n كما يخرج من فصل الشتاء إلى الربيع\n والله تعالى أعلم\n وقوله تعالى: { ليكون لهم عدواً وحزناً } \n ما كان التقاط فرعون لموسى إلا للمحبة والفرح\n فخرج له عكسه\n ومن هذا كان العارفون لا يسكنون إلى الشيء ولا يعتمدون على شيء لأن العبد قد يخرج له الضرر من حيث النفع وقد يخرج له النفع من حيث يعتقد الضرر\n وقد ينتفع على أيدي الأعداء\n وَيُضَرُّ على أيدي الأَحِبَّاءِ\n فليكن العبد سلْماً بين يدي سيده\n ينظر ما يفعل به\n { والله يعلم وأنتم لا تعلمون }\n ثم قال تعالى: { وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَارِغاً\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:17",
      "similarity": 0.29825191799196193
    },
    {
      "verse": "2:216",
      "similarity": 0.27890798582624515
    },
    {
      "verse": "4:99",
      "similarity": 0.2669475840217831
    },
    {
      "verse": "2:154",
      "similarity": 0.2603800550967367
    },
    {
      "verse": "66:11",
      "similarity": 0.25960721905014095
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/028009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/028009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/28:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}