{
  "chapter": "العنكبوت",
  "text": "وليحملن اثقالهم واثقالا مع اثقالهم وليسـلن يوم القيمة عما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "They will bear their own burdens and other burdens together with their own. On the Day of Rising they will be questioned about what they invented.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will carry their own loads and other loads besides their own; and will surely be questioned on the Day of Resurrection about what they contrived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will certainly carry their own burdens and other burdens besides their own. They will assuredly be called to account on the Day of Resurrection concerning the fabrications which they contrived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides the other burdens that they will have to carry, they will certainly be loaded with the burden of their own sins. They will be questioned on the Day of Judgment about what they had falsely invented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will surely bear their own burdens and some other burdens along with their own; and they will undoubtedly be questioned on the Day of Resurrection concerning what they had fabricated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, they shall bear their own loads, and other loads besides their own; and verily, they shall be questioned on the Day of Resurrection about that which they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most certainly they shall carry their own burdens, and other burdens with their own burdens, and most certainly they shall be questioned on the resurrection day as to what they forged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall certainly carry their loads, and other loads along with their loads, and upon the Day of Resurrection they shall surely be questioned concerning that they were forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they verily will bear their own loads and other loads beside their own, and they verily will be questioned on the Day of Resurrection concerning that which they invented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall bear their own burdens, and other burdens besides. On the Day of Resurrection they shall be questioned about their false assertions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely they shall bear their loads and other loads beside their own loads, and surely they shall be questioned on the Day of Resurrection concerning that which they were wont to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will carry their own burdens and other burdens along with their own burdens, and they will surely be questioned on the Day of Resurrection concerning that which they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will bear their own burdens, and (other) burdens along with their own, and on the Day of Judgments they will be called to account for their falsehoods.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, they shall bear their own loads, and other loads besides their own, and verily, they shall be questioned on the Day of Resurrection about that which they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall certainly carry their loads, and other loads besides their loads, and on the Day of Resurrection, they shall be questioned about what they forged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will carry their own loads, and other loads with their own. And they will be questioned on the Day of Resurrection concerning what they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will surely carry their [own] burdens and [other] burdens along with their burdens, and they will surely be questioned on the Day of Resurrection about what they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:13] And they shall certainly bear their [own] burdens, their sins, and other burdens along with their [own] burdens, [as punishment] for saying to believers: Follow our path [previous verse] and for their leading   astray those who follow them [blindly]; and on the Day of Resurrection they shall surely be questioned concerning what they used to invent, [what] they used to fabricate of lies against God, a questioning of rebuke (the lām in both verbs [la-yahmilunna and la-yus’alunna] is for oaths; in both [verbs] the [plural] indicators of the subject, wāw and nūn [-ūna], have been omitted).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they verily will hear their own loads) their sins on the Day of Judgement (and other loads) the sins of those they misled (beside their own) in addition to their own sins, (and they verily will be questioned on the nay of Resurrection concerning that which they invented) concerning their lie against Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَيَحْمِلُنَّ أَثْقَالَهُمْ } معناه أوزارُهم\n\n",
      "translations": [
        {
          "translation": " And His saying - the Most High - {And they should carry their burdens} means their provisions.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولهذا قال سبحانه مقسماً: { وَ } الله { لَيَحْمِلُنَّ } حنيئذٍ { أَثْقَالَهُمْ } اي: خطاياهم التي اقترفوها لنفوسهم يزيدون عليها { وَأَثْقَالاً } أُخر حاصلة من إضلالهم وتضليلهم عباد الله { مَّعَ أَثْقَالِهِمْ } الأصلية { وَ } الله مع تلك الأثقال على الأثقال { لَيُسْأَلُنَّ يَوْمَ ٱلْقِيَامَةِ عَمَّا كَانُواْ يَفْتَرُونَ } [العنكبوت: 13] على الله من إثبات الشريك له في الوجود واستحقاق العبادة\n وعن نسبتهم إليهم ما لا يليق بشأنه افتراءً ومراءً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وليَحْمِلُنَّ أثقالهم } أي: أثقال أنفسهم بسبب كفرهم\n { وأثقالاً مع أثقالهم } أي: أثقالاً أُخر غير التي ضمنوا للمؤمنين حملَها\n وهي أثقال الذين كانوا سبباً في ضلالهم\n كقولهم:\n[النحل: 25]\n { وَلَيُسْأَلُنَّ يوم القيامة عما كانوا يفترون } من الأكاذيب والأباطيل التي ضلوا بها\n الإشارة: كل من عاق الناس عن الدخول في طريق التصفية والتخليص: تَصْدُقُ عليه هذه الآية\n فيتقلد بحمل نقائصهم ومساوئهم التي بقيت فيهم\n فيحاسب عليها وعلى مساوئ نفسه\n والله تعالى أعلم\n ثم سلّى رسوله صلى الله عليه وسلم ومن أوذي معه\n بما جرى للأنبياء من قبله\n فقال: { وَلَقَدْ أَرْسَلْنَا نُوحاً إِلَىٰ قَوْمِهِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "99:2",
      "similarity": 0.508358301017336
    },
    {
      "verse": "73:5",
      "similarity": 0.47436759029436887
    },
    {
      "verse": "19:27",
      "similarity": 0.41895449501869464
    },
    {
      "verse": "99:7",
      "similarity": 0.41612789787949966
    },
    {
      "verse": "99:8",
      "similarity": 0.3643714314788487
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/29:13.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/29:13.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/29:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}