{
  "chapter": "العنكبوت",
  "text": "ومن الناس من يقول ءامنا بالله فاذا اوذى فى الله جعل فتنة الناس كعذاب الله ولئن جاء نصر من ربك ليقولن انا كنا معكم اوليس الله باعلم بما فى صدور العلمين",
  "translations": [
    {
      "translation": "There are some people who say, 'We have iman in Allah,' and then, when they suffer harm in Allah's cause, they take people's persecution for Allah's punishment; but if help comes from your Lord they say, 'We were with you.' Does Allah not know best what is in every person's heart?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are among men those who say: \"We believe in God;\" yet if they happen to suffer in the cause of God they take oppression by men as punishment from God. And if help comes to them from your Lord, they say: \"We were with you.\" Does not God know what is hidden in the hearts of men?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among people there are some who say: “We believe in Allah.” But when such a person is made to endure suffering in Allah's cause, he reckons the persecution he suffers at the hands of people as though it is a chastisement from Allah. But if victory comes from your Lord, the same person will say “We were with you.” Does Allah not know whatever is in the hearts of the people of the world?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people say, \"We have faith in God.\" But when they face some hardship for His cause, they begin to consider the persecution that they have experienced from people as a torment from God. When your Lord grants you a victory, they say, \"We were with you.\" Does God not know best what is in the hearts of every creature?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some people say, “We believe in Allah” – so if they are afflicted with some adversity in Allah’s way, they consider the chaos created by men as the punishment from Allah; and if the help comes from your Lord, they will surely say, “Indeed we were with you”; does not Allah well know what is in the hearts of the entire creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of mankind are some who say: \"We believe in Allah.\" But if they are made to suffer for Allah, they consider the trial of mankind as Allah's punishment; and if victory comes from your Lord, they will say: \"Verily, we were with you.\" Is not Allah Best Aware of what is in the breasts of the creatures\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is he who says: We believe in Allah; but when he is persecuted in (the way of) Allah he thinks the persecution of men to be as the chastisement of Allah; and if there come assistance from your Lord, they would most certainly say: Surely we were with you. What! is not Allah the best knower of what is in the breasts of mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some men there are who say, 'We believe in God,' but when such a man is hurt in God's cause, he makes the persecution of men as it were God's chastisement; then if help comes from thy Lord, he will say 'We were with you.' What, does not God know very well what is in the breasts of all beings?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of mankind is he who saith: We believe in Allah, but, if he be made to suffer for the sake of Allah, he mistaketh the persecution of mankind for Allah's punishment; and then, if victory cometh from thy Lord, will say: Lo! we were with you (all the while). Is not Allah Best Aware of what is in the bosoms of (His) creatures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some profess to believe in God, but when they suffer for God's cause they mistake the persecution of man for the punishment of God. But when help comes to you from God, they will say, \"We have always been with you.\" Is not God fully aware of what is in the hearts of all creatures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of mankind are some who say: we believe in Allah; then if they are afflicted in the way of Allah, they take the persecution of men even as the torment of Allah; and then, if succour cometh from thy Lord they say: verily we have been with you. Is not Allah the Best Knower of that which is in the breasts of the creatures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people there are those who say, ‘We have faith in Allah,’ but if such a one is tormented in Allah’s cause, he takes persecution by the people for Allah’s punishment. Yet if there comes any help from your Lord, they will say, ‘We were indeed with you.’ Does not Allah know best what is in the breasts of the creatures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there are among men such as say, \"We believe in Allah\"; but when they suffer affliction in (the cause of) Allah, they treat men's oppression as if it were the Wrath of Allah! And if help comes (to thee) from thy Lord, they are sure to say, \"We have (always) been with you!\" Does not Allah know best all that is in the hearts of all creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of mankind are some who say: \"We believe in Allah,\" but if they are made to suffer for the sake of Allah, they consider the trial of mankind as Allah's punishment, and if victory comes from your Lord, (the hypocrites) will say: \"Verily! We were with you (helping you).\" Is not Allah Best Aware of what is in the breast of the 'Alamin (mankind and jinns).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some people who say: 'We believe in Allah' yet when such is hurt in the cause of Allah, he makes the persecution of people as though it were the punishment of Allah. But then if help comes from his Lord, he will say: 'We were with you' Does Allah not know what is in the (people's) chests of the worlds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he who says, “We have believed in God.” Yet when he is harmed on God’s account, he equates the people's persecution with God’s retribution. And if help comes from your Lord, he says, “We were actually with you.” Is not God aware of what is inside the hearts of the people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people are some who say, \"We believe in Allah,\" but when one [of them] is harmed for [the cause of] Allah, they consider the trial of the people as [if it were] the punishment of Allah. But if victory comes from your Lord, they say, \"Indeed, We were with you.\" Is not Allah most knowing of what is within the breasts of all creatures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:10] And among people there are those who say, ‘We believe in God’, but if such [a person] suffers hurt in God’s cause, he takes people’s persecution, that is, their harming of him, to be [the same] as God’s chastisement, in terms of his fear of it, and so he obeys them and behaves hypocritically. Yet if (la-in: the lām is for oaths) there comes help, to believers, from your Lord, and they take spoils, they will assuredly say (la-yaqūlunna: the [final] nūn [of the indicative] has been omitted because of the other nūn coming after it, and likewise the wāw, indicating the plural person [has been replaced by a damma], because of two unvocalised consonants coming together), ‘We were indeed with you’, in faith, so give us a share of the booty. God, exalted be He, says: Does God not know best what is in the breasts of all creatures?, [what is] in their hearts of faith or hypocrisy? Indeed [He does].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Of mankind) this is 'Ayyash Ibn Abi Rabi'ah al-Makhzumi (is he who saith: We believe in Allah) we are sincere in our profession of Allah's divine Oneness, (but, if he be made to suffer for the sake of Allah) if he is tortured for the sake of Allah's religion, (he mistaketh the persecution of mankind) their flogging (for Allah's punishment) in the Fire; such that he abandons Islam and reverts to his old religion; (and then, if victory cometh from your Lord) the conquest of Mecca, (will say) 'Ayyash and his host will say: (Lo! we were with you (all the while)) following your religion. (Is not Allah best aware of what is in the bosoms of (His) creatures) of good and evil? 'Ayyash and his friends embraced Islam afterwards and lived as good Muslims.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱلنَّاسِ } المجبولين على التزلزل والتذبذب { مَن يِقُولُ } خوفاً من عذاب الله { ءَامَنَّا بِٱللَّهِ } بلا تمكن له واطمئنان في قلبه { فَإِذَآ أُوذِيَ فِي } سبيل { ٱللَّهِ } من أعدائه انقلب على الكفر حيث { جَعَلَ فِتْنَةَ ٱلنَّاسِ } وإيذاءهم { كَعَذَابِ ٱللَّهِ } القادر بالقدرة الكاملة على أنواع المحن والابتلاءات\n يعني: يسوون بين خوف الله وخوف الناس\n فكما يؤمنون بالله من خوف عذابه يكفرون به من خوف عذاب الناس بلا تفاوت بين الخوفين وبين العذابين\n بل يرجحون خوفهم على خوف الله\n فيختارون الكفر على الإيمان من ضعف يقينهم وعدم رسوخهم وتمكينهم على الإيمان\n وذلك من عدم ترقيهم من حضيض الجهل والتقليد إلى ذورة العرفان والتوحيد { وَ } من غاية تزلزلهم وتلونهم { لَئِنْ جَآءَ نَصْرٌ } وعون للمؤمنين الباذلين مهجهم في سبيل التوحيد { مِّن رَّبِّكَ } يا أكمل الرسل وصاروا غالبين على أعداء الله بنصر الله إياهم\n وفازوا بالفتح والغنائم وأنواع الكرامات { لَيَقُولُنَّ } أولئك المذبذبون المتزلزلون\n مبالغين في دعى الموافقة والمؤاخاة: { إِنَّا كُنَّا مَعَكُمْ } موافقين ظاهراً وباطناً\n وفي دين الإسلام متمكنين مطئنين سراً وجهراً\n فأشركونا في ما نلتم من الغنيمة والخير\n وهم يقصدون بقولهم هذا التغرير والتلبيس على المؤمنين\n بل على الله أيضاً\n لذلك قال سبحانه: { أَ } تعتقدون التلبيس والتشبيه أيها الجاهلون بعلو شأنه { وَ لَيْسَ ٱللَّهُ } المتجلي على جميع ما ظهر وبطن في الأكوان غيباً وشهادةً { بِأَعْلَمَ } بعلمه الحضوري { بِمَا فِي صُدُورِ ٱلْعَالَمِينَ } [العنكبوت: 10] بل بما في استعداداتهم وقابلياتهم التي كانوا عليها حيث لم يكونوا؟ وإن كان حالهم أيضاً كذلك الآن عند من له أدنى حظ من المعرفة والإتقان\n\n\n{ وَلَيَعْلَمَنَّ ٱللَّهُ } المطلع لضمائر عباده ويميزن { ٱلَّذِينَ آمَنُواْ } بالله وبذلوا جهدهم في سبيله\n وليظهرن إخلاصهم ورسوخهم على الدين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ومن الناس من يقول آمنا بالله } \n فيدخل في جملة المسلمين\n { فإِذا أُوذي في الله } أي: مسّه أذىً من الكفرة بأن عذبوه على الإيمان\n { جعل فتنةَ الناسِ كعذابِ الله } أي: جزع من ذلك كما يجزع من عذاب الله\n فَيُصْرَفْ عن الإيمان\n { ولئن جاء نصرٌ من ربك } فتح أو غنيمة\n { ليقولن إنا كنا معكم } أي: متابعين لكم في دينكم\n ثابتين عليه بثباتكم\n فأعطونا نصيباً من المغنم\n والمراد بهم: المنافقون\n أو: قوم ضعف إيمانهم فارتدوا\n قال تعالى: { أَوَلَيس الله بأعلمَ بما في صدور العالمين } أي: هو أعلم بما في صدور العالمين\n ومن ذلك ما في صدور هؤلاء من النفاق\n وما في صدور المؤمنين\n من الإخلاص\n الإشارة: منافق أهل الإيمان هو الذي يظهر الإيمان في الرخاء ويرجع عنه في الشدة\n ومنافق الصوفية هو الذي يظهر الانتساب في السعة والجمال\n فإذا وقع البلاء والاختبار بأهل النسبة خرج عنهم\n فإذا أُوذي في الله جعل فتنة الناس كعذاب الله بالقطيعة والحجاب\n ولئن جاء لأهل النسبة نصر وعز\n ليقولن: إنا كنا معكم\n وقد رأينا كثيراً من هذا النوع\n دخلوا في طريق القوم\n فلما قابلتهم نيران التعرف والامتحان رجعوا القهقرى\n فعند الامتحان يعز المرء أو يهان\n وعند الحَمْلَةِ يتميز الجبان من الشجاع\n قال القشيري: المحن تُظْهِرُ جواهرَ الرجال\n وتَدُلُّ على قيمتهم وأقدارهم\n ثم من كانت محنته من فوات الدنيا\n أو نقص نصيبه فيها\n أو بموت قريب أو فَقْد حبيب\n فحقيرٌ قدره\n وكثيرٌ في الناس مثله\n ومن كانت محنته في الله ولله\n فعظيم قدره\n وقليل مثله\n في العدد قليل\n ولكن في القدر والخطر جليل\n هـ\n قلت: معنى كلامه: أن العامة يمتحنهم الله ويختبرهم بذهاب حظوظهم وأحبابهم\n فإن جزعوا فقدرهم حقير\n وإن صبروا فأجرهم كبير\n وأما الخاصة فيمتحنهم الله بسبب نسبتهم إلى الله\n وإقبالهم عليه\n أو الأمر بمعروف أو نهي عن منكر\n فَيُؤْذَوْنَ في جانب الله\n فمنهم من يُسجن\n ومنهم من يُضرب\n ومنهم من يُجلى من بلده\n فهؤلاء قدرهم عند الله كبير\n ثم قال: والمؤمن مَنْ يكفُّ الأذى\n والولي من يتحمل من الناس الأذى\n من غير شكوى\n ولا إظهار دعوى\n هـ\n ولما وقعت الإذابة من الكفار للمسلمين طمعوا فيهم كما قال تعالى: { وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:12",
      "similarity": 0.43574688170196435
    },
    {
      "verse": "9:61",
      "similarity": 0.43262408713684375
    },
    {
      "verse": "6:34",
      "similarity": 0.4133908096813339
    },
    {
      "verse": "4:16",
      "similarity": 0.405156691575393
    },
    {
      "verse": "3:111",
      "similarity": 0.40162405172659593
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}