{
  "chapter": "العنكبوت",
  "text": "وابرهيم اذ قال لقومه اعبدوا۟ الله واتقوه ذلكم خير لكم ان كنتم تعلمون",
  "translations": [
    {
      "translation": "And Ibrahim, when he said to his people, 'Worship Allah and have taqwa of Him. That is better for you if you only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Abraham who said to his people: \"Worship God and be obedient to Him. This is better for you if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Abraham and he said to his people: “Serve Allah and fear Him. This is better for you if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham told his people, \"Worship God and have fear of Him. It is better for you if only you knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ibrahim – when he said to his people, “Worship Allah and fear Him; that is better for you, if you knew!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ibrahim when he said to his people: \"Worship Allah, and have Taqwa of Him, that is better for you if you know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We sent) Ibrahim, when he said to his people: Serve Allah and be careful of (your duty to) Him; this is best for you, if you did but know:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham, when he said to his people, 'Serve God, and fear Him; that is better for you, did you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham! (Remember) when he said unto his folk: Serve Allah, and keep your duty unto Him; that is better for you if ye did but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell of Abraham. He said to his people, \"Worship God and fear Him, that would be best for you, if only you knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Ibrahim. Recall what time he said unto his people: worship Allah, and fear Him; that is best for you if ye but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham, when he said to his people, ‘Worship Allah and be wary of Him. That is better for you, should you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We also saved) Abraham: behold, he said to his people, \"Serve Allah and fear Him: that will be best for you- If ye understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ibrahim (Abraham) when he said to his people: \"Worship Allah (Alone), and fear Him, that is better for you if you did but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Abraham. When he said to his people 'Worship Allah and fear Him. That would be best for you, if you but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham, when he said to his people, “Worship God, and fear Him. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We sent] Abraham, when he said to his people, \"Worship Allah and fear Him. That is best for you, if you should know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:16] And, mention, Abraham, when he said to his people, ‘Worship God and fear Him, fear His punishment; that is better for you, than the worship of idols which you practice, if you only knew, what is good from what is otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِبْرَاهِيمَ إِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (16) انتقل من خبر نوح إلى خبر إبراهيم لمناسبة إنجاء إبراهيم من النار كإنجاء نوح من الماء . وفيه تنبيه إلى عظم القدرة إذ أنجت من الماء ومن النار .و { إبراهيم } عطف على { نوحاً } \\[ العنكبوت : 14 \\] . والتقدير : وأرسلنا إبراهيم .و { إذ } ظرف متعلق ب ( أرسلنا ) المقدَّر ، أي في وقت قوله لقومه { اعبدوا الله } الخ وهو أول زمن دعوته . واقتضى قوله { اعبدوا الله } أنهم لم يكونوا عابدين لله أصلاً .وجملة { ذلكم خير لكم إن كنتم تعلمون } تعليل للأمر بعبادة الله . وقد أجمل الخبر في هذه الجملة وفُصل بقوله { إن الذين تعبدون من دون الله لا يملكون لكم رزقاً } الآية .ومعنى { إن كنتم تعلمون } إن كنتم تعلمون أدلة اختصاص الله بالإلهية فمفعول العلم محذوف لدلالة ما قبله عليه . ويجوز جعل فعل { تعلمون } منزلاً منزلة اللازم ، أي إن كنتم أهل علم ونظر .وجملة { إنما تعبدون من دون الله أوثاناً } تعليل لجملة { اعبدوا الله } . وقَصْرُهم على عبادة الأوثان يجوز أن يكون قصراً على عبادتهم الأوثان\n\n",
      "translations": [
        {
          "translation": "(And Abraham! (Remember)) and We sent Abraham to his people (when he said unto his folk: serve Allah) declare Allah's divine Oneness, (and keep your duty unto Him) fear him and obey Him by repenting from disbelief, idolatry and idol worship; (that is better for you) than the state in which you are now (if ye did but know) this and believe in it; but neither do you know this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً يا أكمل الرسل جدك { إِبْرَاهِيمَ } الخليل - صلوت الرحمن عليه وسلامه - إلى قومه الذين تمادوا زماناً في الغفلة والغرور\n ليصلح مفاسدهم ويرشدهم توحيدنا\n اذكر { إِذْ قَالَ لِقَوْمِهِ } بعدما بعثناه إليهم ليهديهم إلى طريق الحق { ٱعْبُدُواْ ٱللَّهَ } الواحد الأحد الصمد\n المستحق للعبادة والأطاعة استحقاقاً ذاتياً ووصفياً { وَٱتَّقُوهُ } عن ارتكاب محارمه ومنهياته\n واجتنبوا جميع ما لا يرضى به حتى لا تستجلبوا سخطه و غضبه عليكم { ذٰلِكُمْ } الذي أوصيكم به من العبادة والعرفان واجتناب عن المحارم والطغيان والاتصاف بالتوحيد والتقوى وجميع لوازم الإيمان { خَيْرٌ لَّكُمْ } وأولى بحاكم وأنفع لنفوسكم من أولاكم وأخراكم مما أنت عليه من عبادة التماثيل التي تنحتونها بأيديكم وتسمونها من تلقاء أنفسكم آلهة دون الله ظلماً وزوراً { إِن كُنتُمْ تَعْلَمُونَ } [العنكبوت: 16] أي: إن كنتم من ذوي العقول المستكملين بالقوة النظرية المفاضة لكم من حضرة العلم الإلهي\n ليميزكم به عن سائر الحيوانات ويعدكم للخلافة والنيابة عن الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إبراهيم: عطف على نوح\n أو متعلق باذكر\n و وإذ قال: ظرف زمان لأرسلنا\n أو: بدل اشتمال من إبراهيم إِنْ نُصِبَ باذكر\n لأن الأحيان تشتمل على ما فيها\n يقول الحق جل جلاله: { وإِبراهيمَ } أي: وأرسلنا إبراهيم { إذ قال لقومه } أي: أرسلناه حين كمل عقله وتم نظره\n وبلغ من السن والعلم مبلغاً صَلَحَ فيه لأن يعظ قَوْمَهُ\n وَيَأَمُرَهُمْ بالعبادة والتقوى\n وقرأ النخعي وأبو حنيفة: بالرفع\n أي: ومن المرسلين إبراهيم\n قال في وعظه: { اعبدوا الله واتقوه ذلكم خير لكم } مما أنتم عليه من الكفر\n { إن كنتم تعلمون } إن كان فيكم علم بما هو خير لكم مما هو شر لكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:109",
      "similarity": 0.48812007955665315
    },
    {
      "verse": "21:62",
      "similarity": 0.4779672344131768
    },
    {
      "verse": "43:26",
      "similarity": 0.47234541551023757
    },
    {
      "verse": "53:37",
      "similarity": 0.44116846244848956
    },
    {
      "verse": "19:41",
      "similarity": 0.43751623543673895
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}