{
  "chapter": "العنكبوت",
  "text": "ولقد ارسلنا نوحا الى قومه فلبث فيهم الف سنة الا خمسين عاما فاخذهم الطوفان وهم ظلمون",
  "translations": [
    {
      "translation": "We sent Nuh to his people and he remained among them for fifty short of a thousand years; yet the Flood engulfed them while they were wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, and he lived with them a thousand years minus fifty. Then they were caught by the deluge for they were evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed send Noah to his people and he lived among them a thousand years save fifty. Eventually the Flood overtook them while they were engaged in wrongdoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people and he lived with them for nine hundred and fifty years, then the flood engulfed them for their injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nooh to his people – he therefore stayed with them for a thousand years, less fifty; so the flood seized them, and they were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nuh to his people, and he stayed among them a thousand years less fifty years; so the Deluge overtook them while they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Nuh to his people, so he remained among them a thousand years save fifty years. And the deluge overtook them, while they were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Noah to his people, and he tarried among them a thousand years, all but fifty; so the Flood seized them, while they were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily we sent Noah (as Our messenger) unto his folk, and he continued with them for a thousand years save fifty years; and the flood engulfed them, for they were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people and he lived among them for fifty short of a thousand years; then the deluge overtook them, for they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Nuh unto his people. Then he tarried among them for a thousand years, save tifty years; and then deluge overtook them, while they were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Noah to his people, and he remained with them for a thousand-less-fifty years. Then the flood overtook them while they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We (once) sent Noah to his people, and he tarried among them a thousand years less fifty: but the Deluge overwhelmed them while they (persisted in) sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nuh (Noah) to his people, and he stayed among them a thousand years less fifty years [inviting them to believe in the Oneness of Allah (Monotheism), and discard the false gods and other deities], and the Deluge overtook them while they were Zalimun (wrong-doers, polytheists, disbelievers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Noah to his nation, and he lived amongst them for a thousand years, less fifty (but they belied him), then the Flood seized them while they were harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, and He stayed among them for a thousand years minus fifty years. Then the Deluge swept them; for they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly sent Noah to his people, and he remained among them a thousand years minus fifty years, and the flood seized them while they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:14] And verily We sent Noah to his people, when he was forty years of age or older, and he remained among them a thousand-less-fifty years, calling them to affirm God’s Oneness, but they denied him; so the Flood engulfed them, a deluge of water drifted against them, rising above them and drowning them, for they were wrongdoers, idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We sent Noah (as Our messenger) unto his folk, and he continued with them for a thousand years save fifty years) calling them to profess Allah's divine Oneness but they did not respond to him; (and the flood engulfed them) and Allah destroyed them by the flood, (for they were wrong-doers) they were disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَخَذَهُمُ ٱلطُّوفَانُ } معناه الموتُ الفَاشي\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {then the earthquake took them}, means sudden death.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ذكر سبحانه نبذاً من أحوال أهل الضلال والإضلال من المفترين الذين مضوا في سالف الزمان تسليةً لرسول الله صلى الله عليه وسلم وإزالة للحزن الذي لحقه صلى الله عليه وسلم من تمادي المشركين في الغفلة والفساد وتطاولهم في الغي والعناد\n فقال: { وَلَقَدْ أَرْسَلْنَا نُوحاً إِلَىٰ قَوْمِهِ } وقت إذ ظهر فيهم أنواع الفسوق والجدال وأصناف الغي والضلال { فَلَبِثَ فِيهِمْ } وتحمل على مشاق دعوتهم وأنواع أذاهم { أَلْفَ سَنَةٍ إِلاَّ خَمْسِينَ عَاماً } فهم كانوا يضربونه ويشتمونه ونسبونه إلى الجهل والجنون والخرف وأنواع الاستخفاف والاستحقار\n ومع ذلك لم يتقاعد عن دعوتهم\n ولم ينزجر عن زواجرهم\n بل يبلغهم ما أمره الحق بتبليغه من الآيات الظاهرة والمعجزات الباهرة\n وهم من شدة شكيمتهم وخبث طينتهم لم يزيدوا من سماعها إلا تعنتاً واستكباراً\n وعتواً واغتراراً وإصراراً على ما هم عليه\n وبعدما استحقوا كمال العذاب والنكال { فَأَخَذَهُمُ ٱلطُّوفَانُ } حين خرج الماء من التنور المعهود وطاف عليهم فأغرهم واستؤصلوا { وَهُمْ } في أنفسهم { ظَالِمُونَ } [العنكبوت: 14] خارجون عن مقتضى الحدود ومنهمكون في بحر الغفلة والغرور\n ضالون في تيه الجهل والطغيان\n لذلك أخذهم الله بالطوفان واستأصلهم بالمرة إلى حيث لم يبق منهم أحد على وجه الأرض بعدما إغرقناهم وأهلنكاهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { و } الله { لقد أرسلنا نوحاً إلى قومه فلَبِثَ فيهم ألفَ سنةٍ إلا خمسين عاماً } يدعوهم إلى الله\n وهم يؤذونه بالشتم والضرب حتى نُصر\n فاصبر كما صبر\n فإن العاقبة للمتقين\n رُوي أنه عاش ألفاً وخمسين سنة وقيل: إنه ولد في حياة آدم وآدم يومئذٍ ابن ألف سنة إلا ستين عاماً\n وقيل: إلا أربعين\n ذكره الفاسي في الحاشية\n والمشهور: أن بينه وبين آدام نحو العشرة آباء\n وروي أنه بُعث على رأس أربعين\n ولبث في قومه تسعمائة وخمسين\n وعاش بعد الطوفان ستين\n وعن وَهْبٍ أنه عاش في عمره ألفاً وأربعمائة\n وقيل: وستمائة\n فقال له ملك الموت: يا أطول الأنبياء عمراً كيف وجدت الدنيا؟ قال: كَدَارٍ لها بابان\n دخلت من أحدهما وخرجت من الآخر\n ولم يقل: تسعمائة وخمسين سنة\n لأنه\n لو قيل ذلك\n لجاز أن يتوهم إطلاق هذا العدد على أكثره\n وهذا التوهم زائل هنا\n وكأنه قيل: تسعمائة وخمسين كاملة وافية العدد\n مع أن ما ذكره الحق أسلس وأعذب لفظاً\n ولأن القصة سيقت لذكر ما ابتلى به نوح عليه السلام من أمته\n وما كابده من طول المصابرة تسليةً لنبينا - عليه الصلاة والسلام - فكان ذكر الألف أفخم وأوصل إلى الغرض\n وَجِيءَ\n أولاً: بالسّنةِ ثم بالعام لأن تكرار لفظ واحد في كلام واحد حقيق بالاجتناب في البلاغة\n { فأخذهم الطوفانُ } طوفان الماء\n وهو ما طاف وأحاط\n بكثرة وغلبة\n من سيل\n أو ظلام ليلٍ\n أو نحوها\n { وهم ظالمون } أنفسهم بالكفر والشرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:4",
      "similarity": 0.5382047432891816
    },
    {
      "verse": "9:126",
      "similarity": 0.40650008414634914
    },
    {
      "verse": "24:7",
      "similarity": 0.39196436283850883
    },
    {
      "verse": "24:9",
      "similarity": 0.3784308468858495
    },
    {
      "verse": "3:125",
      "similarity": 0.32936023129323855
    }
  ]
}