{
  "chapter": "العنكبوت",
  "text": "اولم يروا۟ كيف يبدئ الله الخلق ثم يعيده ان ذلك على الله يسير",
  "translations": [
    {
      "translation": "Have they not seen how Allah brings creation out of nothing, then reproduces it? That is easy for Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how God originates creation, then reverts it back? This is indeed how inevitably the law of God works;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never observed how Allah creates for the first time and then repeats it? Indeed (to repeat the creation of a thing) is even easier for Allah (than creating it for the first time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how God begins the creation and then turns it back? This is not difficult at all for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how Allah initiates the creation, then will create it again? Indeed that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how Allah originates the creation, then repeats it. Verily, that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do they not consider how Allah originates the creation, then reproduces it? Surely that is easy to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Have they not seen how God originates creation, then brings it back again? Surely that is an easy matter for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how Allah produceth creation, then reproduceth it? Lo! for Allah that is easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how God originates creation, then reproduces it? That surely is easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe they not what wise Allah originateth creation? And then He shall restore it. Verily for Allah that is easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded how Allah originates the creation? Then He will bring it back. That is indeed easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how Allah originates creation, then repeats it: truly that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how Allah originates creation, then repeats it. Verily, that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how Allah originates the Creation, and then brings it back? That is an easy matter for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how God originates the creation, and then reproduces it? This is easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered how Allah begins creation and then repeats it? Indeed that, for Allah, is easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:19] Have they not seen (yaraw, or taraw, ‘have you not seen?’), observed, how God originates creation (yubdi’u, from [4th form] abda’a; a variant reading has yabda‘u from [1st form] bada’a, both with the same meaning: ‘He creates them originally’) then, He, restores it, namely, creation, just as He originated them? Surely that, which is mentioned of the first and the second [acts of] creation, is easy for God, so how can they deny the second one?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See they not) have the disbelievers of Mecca not been informed in the Book (how Allah produceth creation) from a sperm drop, (then reproduceth it) on the Day of Judgement? (Lo! for Allah that is easy) its production and reproduction is easy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَلَمْ يَرَوْاْ } إلى كمال قدرته ومتانة حكمه وحكمته { كَيْفَ يُبْدِئُ } أي: يظهر ويبدع { ٱللَّهُ } القادر المقتدر { ٱلْخَلْقَ } أي: جميع المخلوقات والموجودات من كتم العدم بلا سبق مادة ومدة { ثُمَّ يُعِيدُهُ } ويعدمه كما برأه وأظهره على مقتضى النشأتين نزولاً وعروجاً، هبوطاً وصعوداً، ظهوراً وبطوناً، مداً وقبضاً، نشراً وطياً، لطفاً وقهراً، جمالاً وجلالاً { إِنَّ ذٰلِكَ } التبديل والتحويل { عَلَى ٱللَّهِ } المتجلي في الأكوان في كل آن في شأن { يَسِيرٌ } [العنكبوت: 19] إذ لا يعرضه العسر والفتور، ولا يلحقه العجز والقصور ولا يبرمه مر الدهور وكر الشهور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يقال: بدأ الله الخلق، وأبداه: بمعنى واحد، وقد جاءت اللغتان في هذه السورة\n وقوله: يُعيده: عطف على الجلمة، لا على يبدئ لأن رؤية البداءة بالمشاهدة بخلاف الإعادة، فإنها تُعْلَمُ بالنظر والاستدلال، وهم لا يقرونها، لعدم النظر\n وقد قيل: إنه يريد إعادة النبات وإبداءه، وعلى هذا تكون ثم يعيده: عطفاً على يبدئ\n يقول الحق جل جلاله: { أَوَلَم يروا } أي: كفار قريش { كيف يُبدىءُ اللهُ الخلقَ } أي: يظهره من العدم، أي: قد رأوا ذلك وعلموه، { ثم يُعيده } بالبعث للجزاء بالعذاب والثواب\n قال القشيري: الذي دَاخَلَهم في الشكُّ هو بعث الخلَق، فاحتجَّ عليهم بما أراهم من فصول السنة بعد نقضها، وإعادتها على الوجه الذي كان في العام الماضي\n وكما أن ذلك سائغٌ في قدرته، كذلك بُعث الخلق\n هـ\n ونحوه لابن عطية وغيره\n كما هو مشهود في الثمار، من كونها تبدأ، فتجنى، ثم تفنى، ثم تعيدها مرة أخرى\n وكذلك يبدئ خلق الإنسان، ثم يهلكه بعد أن خلق منه ولداً، وخلق من الولد ولداً آخر، وكذا سائر الحيوان\n وهذا يرشح صحة عطف \" يعيد \" على \" يبدئ \"\n { إن ذلك على الله يسيرٌ } أي: الإعادة بعد الإفناء يسيرة على قدرة الله تعالى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:11",
      "similarity": 0.7650881519074937
    },
    {
      "verse": "85:13",
      "similarity": 0.759976972486368
    },
    {
      "verse": "34:49",
      "similarity": 0.6522575549595242
    },
    {
      "verse": "30:27",
      "similarity": 0.6054202229306601
    },
    {
      "verse": "10:34",
      "similarity": 0.5842501958107627
    }
  ]
}