{
  "chapter": "العنكبوت",
  "text": "وقال الذين كفروا۟ للذين ءامنوا۟ اتبعوا۟ سبيلنا ولنحمل خطيكم وما هم بحملين من خطيهم من شىء انهم لكذبون",
  "translations": [
    {
      "translation": "Those who are kafir say to those who have iman, 'Follow our way and we will bear the weight of your",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny say to those who affirm: \"Follow our way; we shall carry the burden of your sins.\" But they cannot carry the burden of their sins in the least. They are liars indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say to the believers: “Follow our way and we will carry the burden of your sins.” (They say so even though) they are not going to carry any part of their sins. Surely they are lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say to the believers. \"Follow our way. We shall take the responsibility for your sins.\" They cannot take responsibility for any of the sins. They are only liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said to the Muslims, “Follow our path and we will bear your sins”; whereas they will not bear anything from their sins; they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say to those who believe: \"Follow our way and let us bear your sins.\" Never will they bear anything of their sins. Surely, they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say to those who believe: Follow our path and we will bear your wrongs. And never shall they be the bearers of any of their wrongs; most surely they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say to the believers, 'Follow our path, and let us carry your offences'; yet they cannot carry anything, even of their own offences; they are truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say unto those who believe: Follow our way (of religion) and we verily will bear your sins (for you). They cannot bear aught of their sins. Lo! they verily are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say to the faithful, \"Follow our way, and we will bear the burden of your sins.\" But they will bear none of their sins. They are surely lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say unto those who believe: follow our way, and we shall surely bear your sins; whereas they shall not bear aught of their sins; verily they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say to the faithful, ‘Follow our way and we will bear [responsibility for] your iniquities.’ They will not bear anything of their iniquities. They are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Unbelievers say to those who believe: \"Follow our path, and we will bear (the consequences) of your faults.\" Never in the least will they bear their faults: in fact they are liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say to those who believe: \"Follow our way and we will verily bear your sins,\" never will they bear anything of their sins. Surely, they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say to those who believe: 'Follow our path, and we will carry your sins' Yet they cannot carry even a thing of their sins. They are surely lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say to those who believe, “Follow our way, and we will carry your sins.” In no way can they carry any of their sins. They are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say to those who believe, \"Follow our way, and we will carry your sins.\" But they will not carry anything of their sins. Indeed, they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:12] And those who disbelieve say to those who believe, ‘Follow our path, our religion, and we will bear [responsibility for] your sins’, when you follow us, should there be any [such sins] (the imperative here functions as a predicate). God, exalted be He, says: But they will not [be able to] bear anything of their sins. Truly they are liars, in [saying] this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) the disbelievers of Mecca, Abu Jahl and his host (say unto those who believe) 'Ali, Salman [al-Farisi] and their fellow believers: (Follow our way) our religion which consists of worshipping idols (and we verily will bear your sins (for you)) on the Day of Judgement. (They cannot bear aught of their sins) on the Day of Judgement. (Lo! they verily are liars) regarding what they claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱتَّبِعُواْ سَبِيلَنَا } معناه دِيننا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Follow our way,\" means our religion.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة مكرهم واحتيالهم مع المؤمنين وخداعهم إياهم { قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ آمَنُواْ } قاصدين إضلالهم عن طريق الحق وانصرافهم عن الدين المستبين: { ٱتَّبِعُواْ } أيها الحمقى المتذللون في أيدينا { سَبِيلَنَا } واختاروا طريقنا الذي كنا عليه من عبادة الأوثان والأصنام التي هي دين آبائنا وأسلافنا { وَ } إن خفتم على مقتضى زعمكم من أثقال ذنوبكم يوم العرض والجزاء { لْنَحْمِلْ } أثقال { خَطَايَاكُمْ } عنكم حينئذ فتصيروا مخففين بلا وزر وذنب\n إنما قالوا هكذا\n تغريراً عليهم وتضليلاً لهم واستهزاءً وإلا فهم منكرون بالآخرة وجميع ما فيها من الوعيدات الهائلة والإنذارات { وَ } هم وإن فرض أنهم اعتقدوا النشأة الأخرى ما فيها { مَا هُمْ بِحَامِلِينَ مِنْ خَطَايَاهُمْ مِّن شَيْءٍ } أي: شيئاً قليلاً من خطاياهم\n فكيف بجميعها؟! وبالجملة: { إِنَّهُمْ لَكَاذِبُونَ } [العنكبوت: 12] في جميع مواعيدهم وعهودهم\n إذ الكل لا يطابق اعتقادهم ولا الواقع\n إذ لا تحمل يومئذ وازرة وزر أخرى\n عدلاً من الله تعالى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وقال الذين كفروا } من صناديد قريش، { للذين آمنوا اتَّبِِعُوا سبيلَنَا } الذي نسلكه، وهو الدخول في ديننا، { وَلْنَحْمِلْ خطاياكم } إن كان ذلك خطيئة في زعمكم\n أمروهم باتباع سبيلهم، وهي طريقتهم التي كانوا عليها، وأمروا أنفسهم بحمل خطاياهم، فعطف الأمر على الأمر، وأرادوا ليجتمع هذان الأمران في الحصول\n والمعنى: تعليق الحمل بالاتباع، أي: إن تتبعوا سبيلنا حملنا خطاياكم\n وهذا قول صناديد قريش، كانوا يقولون لمن آمن منهم: لا نُبعث نحن ولا أنتم، فإن كان ذلك فإنا نحمل عنكم الإثم\n قال تعالى: { وما هم بحاملين من خطاياهم من شيءٍ } أي: ما هم حاملين شيئاً من أوزارهم، { إنهم لكاذبون } فيما ادعوا لأنهم قالوا ذلك وقلوبهم على خلافه، كالكاذبين الذين يَعِدُون الشيء وفي قلوبهم نية الخُلْف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:37",
      "similarity": 0.6299361274536857
    },
    {
      "verse": "12:97",
      "similarity": 0.5346875415844656
    },
    {
      "verse": "69:9",
      "similarity": 0.5005955512723965
    },
    {
      "verse": "71:25",
      "similarity": 0.4380560433992931
    },
    {
      "verse": "12:29",
      "similarity": 0.431431003543872
    }
  ]
}