{
  "chapter": "العنكبوت",
  "text": "ووهبنا له اسحق ويعقوب وجعلنا فى ذريته النبوة والكتب وءاتينه اجره فى الدنيا وانه فى الءاخرة لمن الصلحين",
  "translations": [
    {
      "translation": "So We bestowed on him Isaac and Jacob and gave his progeny prophethood and scripture, and rewarded him in this world, and in the next he will be among the upright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We bestowed upon him (offspring like) Isaac and Jacob, and bestowed prophethood and the Book on his descendants and granted him his reward in this world; he will certainly be among the righteous in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted Isaac and Jacob to Abraham and We bestowed upon his offspring, prophethood and the Book. We gave him his reward in this world and in the next life, he will be among the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed Ishaq and Yaqub to him, and kept the Prophethood and the Book among his descendants, and We gave him his reward in the world; and in the Hereafter he is indeed among those who deserve Our proximity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him, Ishaq and Ya`qub, and We ordained among his offspring prophethood and the Book, and We granted him his reward in this world; and verily, in the Hereafter he is indeed among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted him Ishaq and Yaqoub, and caused the prophethood and the book to remain in his seed, and We gave him his reward in this world, and in the hereafter he will most surely be among the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him Isaac and Jacob, and We appointed the Prophecy and the Book to be among his seed; We gave him his wage in this world, and in the world to come he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him Isaac and Jacob, and We established the prophethood and the Scripture among his seed, and We gave him his reward in the world, and lo! in the Hereafter he verily is among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave him Isaac and Jacob and granted prophethood and the Book to his descendants. We gave him his reward in this life and in the Hereafter he shall dwell among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him Is-haq and Y'aqub, and We placed among his posterity prophethood and the Book, and We vouchsafed unto him his hire in the World, and verily in the Hereafter he shall be of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him Isaac and Jacob, and We ordained among his descendants prophethood and the Book, and We gave him his reward in this world, and in the Hereafter he will indeed be among the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave (Abraham) Isaac and Jacob, and ordained among his progeny Prophethood and Revelation, and We granted him his reward in this life; and he was in the Hereafter (of the company) of the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him [Ibrahim (Abraham)], Ishaque (Isaac) and Ya'qub (Jacob), and ordained among his offspring Prophethood and the Book [i.e. the Taurat (Torah) (to Musa - Moses), the Injeel (Gospel) (to 'Iesa - Jesus), the Quran (to Muhammad SAW), all from the offspring of Ibrahim (Abraham)], and We granted him his reward in this world, and verily, in the Hereafter he is indeed among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, We gave him (Abraham), Isaac and Jacob and appointed on his descendants the Prophethood and the Book. We gave him his wage in this world, and in the Everlasting Life he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted him Isaac and Jacob, and conferred on his descendants the Prophethood and the Book, and gave him his reward in this life; and in the Hereafter he will be among the upright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave to Him Isaac and Jacob and placed in his descendants prophethood and scripture. And We gave him his reward in this world, and indeed, he is in the Hereafter among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:27] And We gave him, after Ishmael, Isaac, and Jacob, after Isaac; and We ordained among his descendants prophethood, thus all prophets after Abraham are descended from him, and the Scripture, meaning, the [Holy] Books, the Torah, the Gospels, the Psalms and the Criterion (al-furqān). And We gave him his reward in this world, which is fair praise [of him] by members of all the [Abrahamic] religions. And in the Hereafter he shall truly be among the righteous, for whom there shall be the highest degrees [of reward].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We bestowed on him) on Abraham (Isaac) as a son (and Jacob) as a grandson, (and We established the prophethood and the Scripture among his seed) He says: We honoured his progeny with prophethood and Scriptures and righteous offspring; for there were among them prophets and Scriptures, (and We gave him his reward in the world) We honoured him with prophethood, a good reputation and righteous offspring in this worldly life, (and lo! in the Hereafter he verily is among the righteous) with his forefathers, the messengers, in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما خرج عليه السلام من سواد الكوفة مع لوط وزوجته وصل إلى حران، ثم منها إلى الشام، فنزل فلسطين ونزل لوط سدوم، ثم لما استقر وتمن على فلسطين { وَهَبْنَا لَهُ } من كمال لطفنا معه وفضلنا إياه ابنه { إِسْحَاقَ } نافلة { وَيَعْقُوبَ } ليزول بهما كربة الغربة ووحشة الجلاء، مع أن هبة ولده إياه من محض الجود الإلهي على سبيل خرق العادة؛ إذ هو كبير السن وامرأته عاقر { وَ } أيضاً من كمال لطفنا معه { جَعَلْنَا فِي ذُرِّيَّتِهِ ٱلنُّبُوَّةَ } مستمرةً إلى الجزاء { وَٱلْكِتَابَ } أي: آتينا الكتاب لبعضٍ منهم؛ يعني: رسلهم، وإنما فعلنا معه كذلك؛ لئلا تنقطع سلسلة كرامتنا عنه، بل تستمر إلى انقراض العالم { وَ } بالجملة: بعدما هاجر إلينا الخليل بالكلية، وانخلع عن لوازم ناسوته بالمرة { آتَيْنَاهُ أَجْرَهُ } أي: أجر هجرته { فِي ٱلدُّنْيَا } على وجه لا ينقطع صيته عن الآفاق أبداً { وَإِنَّهُ فِي ٱلآخِرَةِ لَمِنَ ٱلصَّالِحِينَ } [العنكبوت: 27] لقبولنا، المقبولين في ساحة عز حضورنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}