{
  "chapter": "العنكبوت",
  "text": "فـامن له لوط وقال انى مهاجر الى ربى انه هو العزيز الحكيم",
  "translations": [
    {
      "translation": "And Lut had iman in him. He said, 'I am leaving this place to follow the pleasure of my Lord. He is the Almighty, the All Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Lot believed in him; and (Abraham) said: \"I will separate myself and take refuge in my Lord. Surely He is all-mighty and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did Lot believe him, and Abraham said: “I am emigrating unto my Lord. He is All-Powerful, All-Wise,”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only Lot believed in (Abraham) and said, \"I seek refuge in my Lord, for He is Majestic and All-wise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Lut believed in him; and Ibrahim said, “I migrate towards my Lord; indeed only He is the Almighty, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, Lut believed in him. He said: \"I will emigrate for the sake of my Lord. Verily, He is the All-Mighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lut believed in Him, and he said: I am fleeing to my Lord, surely He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Lot believed him; and he said, 'I will flee to my Lord; He is the All-mighty, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot believed him, and said: Lo! I am a fugitive unto my Lord. Lo! He, only He, is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lot was the one who believed in him and said, \"I shall migrate to another land for the sake of my Lord. He is the Mighty One, the Wise One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lut believed in him. And he said: verily I am going to migrate to my Lord; verily He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Lot believed in him, and he said, ‘Indeed I am migrating toward my Lord. Indeed He is the All-mighty, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Lut had faith in Him: He said: \"I will leave home for the sake of my Lord: for He is Exalted in Might, and Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Lout (Lot) believed in him [Ibrahim's (Abraham) Message of Islamic Monotheism]. He [Ibrahim (Abraham)] said: \"I will emigrate for the sake of my Lord. Verily, He is the All-Mighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lot believed him, and said: 'I will migrate to my Lord; He is the Almighty, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Lot believed in him, and said, “I am emigrating to my Lord. He is the Noble, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot believed him. [Abraham] said, \"Indeed, I will emigrate to [the service of] my Lord. Indeed, He is the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:26] And Lot believed in him, he affirmed the sincerity of Abraham, and he was his [paternal] nephew, from his brother Hārān, and he, Abraham, said, ‘Indeed I am migrating, away from my people, toward my Lord, to where my Lord commands. So he shunned his people and emigrated from the rural lands of Iraq to Syria. Indeed He is the Mighty, in His kingdom, the Wise’, in what He does.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "450 (And Lot believed him) he believed in Abraham, (and said) and Abraham said: (Lo! I am a fugitive unto my Lord) I am returning to the obedience of my Lord; and he left Harran for Palestine. (Lo! He, only He, is the Mighty) in retribution against them, (the Wise) He decreed that one should move from one country to another for growth and the protection of one's religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّي مُهَاجِرٌ } معناه خارجٌ من دارِ قَومي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أنجى سبحانه خليله - صلوات الرحمن عليه وسلامه - من النار، وخرج منها سالماً سوياً بلا لحوق ضرر { فَآمَنَ لَهُ } ابن أخيه { لُوطٌ } وهو أول من آمن به وأنكره غيره، ونسبوه إلى السحر والشعبذة وأنواع الخرافات { وَ } لما أيس الخليل عن إيمانهم { قَالَ } للوط وزوجته سارة ابنة عمه: { إِنِّي } بعدما أيست عن إيمان هؤلاء الجهلة الضالين، ونجوت عن مكائدهم { مُهَاجِرٌ } مبعد منهم { إِلَىٰ } أرضٍ أمرني { رَبِّيۤ } للهجرة إليها، وأوحاني أن أذهب نحوها، فعليَّ أن امتثل لأمره وأمضي على موجب حكمه { إِنَّهُ } سبحانه في ذاته وأسمائه وأفعاله { هُوَ ٱلْعَزِيزُ } الغالب القادر على جميع ما جرى عليه مشيئته وقضاءه { ٱلْحَكِيمُ } [العنكبوت: 26] المتقن في جميع ما صدر عنه إرادة واختياراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:133",
      "similarity": 0.5660192325481067
    },
    {
      "verse": "26:160",
      "similarity": 0.5338233950485595
    },
    {
      "verse": "54:33",
      "similarity": 0.5087236460095219
    },
    {
      "verse": "22:43",
      "similarity": 0.4990914190280364
    },
    {
      "verse": "25:30",
      "similarity": 0.49498925922836945
    }
  ]
}