{
  "chapter": "العنكبوت",
  "text": "ائنكم لتاتون الرجال وتقطعون السبيل وتاتون فى ناديكم المنكر فما كان جواب قومه الا ان قالوا۟ ائتنا بعذاب الله ان كنت من الصدقين",
  "translations": [
    {
      "translation": "Do you lie with men and waylay them on the road and commit depravities within your gatherings?' the only answer of his people was to say, 'Bring us Allah's punishment if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You commit unnatural acts with men and cut off the way (of procreation), and commit obscenities in your gatherings.\" The only answer his people made was: \"Bring the punishment of God, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do you go to men (to satisfy your lust), engage in highway robbery, and commit evil deeds in your gatherings?” Then they had no answer to offer other than to say: “Bring Allah's chastisement upon us if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you engage in carnal relations with men, rob the travellers, and commit evil in your gatherings? His people had no answer but to say, \"Bring upon us the torment of God if you are truthful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“What! You commit the immoral with males, and cut off the roads; and you speak evilly in your gatherings?” So his people had no answer except to say, “Bring the punishment of Allah upon us if you are truthful!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you practice sodomy with men, and rob the wayfarer! And practice Al-Munkar in your meetings.\" But his people gave no answer except that they said: \"Bring Allah's torment upon us if you are one of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do you come to the males and commit robbery on the highway, and you commit evil deeds in your assemblies? But nothing was the answer of his people except that they said: Bring on us Allah's punishment, if you are one of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do you approach men, and cut the way, and commit in your assembly dishonour?' But the only answer of his people was that they said, 'Then bring us the chastisement of God, if thou speakest truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For come ye not in unto males, and cut ye not the road (for travellers), and commit ye not abomination in your meetings? But the answer of his folk was only that they said: Bring Allah's doom upon us if thou art a truthteller!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You approach men and waylay them on the road and commit depravities within your gatherings.\" But his people's only reply was, \"Bring down God's punishment upon us, if what you say be true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye go in indeed unto males, and ye rob on the highway, and ye commit that which is disreputable in your assembly? Then the answer of his people was naught but that they said: bring thou God's torment on us if thou art of the truth-tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do you come to men, and cut off the way, and commit outrages in your gatherings?’ But the only answer of his people was that they said, ‘Bring down us Allah’s punishment, if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do ye indeed approach men, and cut off the highway?- and practise wickedness (even) in your councils?\" But his people gave no answer but this: they said: \"Bring us the Wrath of Allah if thou tellest the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you do sodomy with men, and rob the wayfarer (travellers, etc.)! And practise Al-Munkar (disbelief and polytheism and every kind of evil wicked deed) in your meetings.\" But his people gave no answer except, that they said: \"Bring Allah's Torment upon us if you are one of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do you approach men and cause a detour on the road, and commit dishonor (sodomy) in your assembly' But the only reply of his nation was: 'Then bring down the punishment of Allah, if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You approach men, and cut off the way, and commit lewdness in your gatherings.” But the only response from his people was to say, “Bring upon us God’s punishment, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, you approach men and obstruct the road and commit in your meetings [every] evil.\" And the answer of his people was not but they said, \"Bring us the punishment of Allah, if you should be of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:29] What! Do you come unto men, and cut off the way, the [travel] roads of passers-by, committing lewd acts with whoever passes your way, such that people ceased to pass by [where] you [live], and you discuss in your gatherings, in your conversations, indecency?’, [you discuss] committing lewd acts with one another. But the only answer of his people was that they said, ‘Bring us the chastisement of God, if you are truthful’, in your deeming such [acts] vile and that chastisement will befall those who do such things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For come ye not in unto males) do you not have sexual intercourse with men, (and cut ye not the road (for travellers)) and it is also said that this means: you cut off the continuation of progeny by your abominable act, (and commit ye not abomination in your meetings) they used to indulge in ten different kinds of indecency? (But the answer of his folk) the folk of Lot (was only that they said: Bring Allah's doom upon us if thou art a truth-teller) if you are true that we will be punished unless we accept faith!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَأْتُونَ فِي نَادِيكُمُ ٱلْمُنْكَرَ } فالنادِي والنَدِي: مَجلسُ القَومِ ومُتَحدثَهُم\n والمُنكَرُ: حَذفُ النَّاسِ، والسُخريةِ بِهِم\n وقال: إنهم يُجامعون الرِّجالَ فِي مَجالِسِهِمْ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And you come to your gathering place of sin}. So the gathering place is the Majlis of the people and the one who addresses them.\n\n\nAnd al-Munkar: the removal of people, and mockery of them.\n He said: \"They are bringing the men together in their gathering places.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم وبخهم وقرعهم بهُجنة أفعالهم وأعمالهم فقال: { أَئِنَّكُمْ } أيها المفرطون في متابعة القوة الشهوية { لَتَأْتُونَ } وتطئون { ٱلرِّجَالَ } من أدبارهم وهم أمثالكم { وَتَقْطَعُونَ ٱلسَّبِيلَ } أي: سبيل التناسل والتوالد\n وتبطلون الحكمة البالغة الإلهية المتعلقة بإبقاء النوع { وَ } مع ذلك { تَأْتُونَ فِي نَادِيكُمُ } أي: مجالسكم ومحافلكم { ٱلْمُنْكَرَ } أي: الفعلة الذميمة\n أي: تأتون بها على رءوس الملأ بلا مبالاة واستحياء وإخفاء\n بل يتباهون بإظهارها\n مع أن إعلان المنكرات من أعظم الجرائم وأقبح الفواحش عند الله وعند المؤمنين\n سيما هذا المنكر المستبدع المستقذر { فَمَا كَانَ جَوَابَ قَوْمِهِ } بعدما سمعوا منه التشنيع والتقبيح على أبلغ وجه وآكده { إِلاَّ أَن قَالُواْ } متهكمين له\n مصرين على ما هم عليه من الفعلة الذميمة الشنيعة: { ٱئْتِنَا } يا لوط { بِعَذَابِ ٱللَّهِ } الذي ادعيت نزوله علينا بسبب فعلنا هذا { إِن كُنتَ مِنَ ٱلصَّادِقِينَ } [العنكبوت: 29] في دعوك\n فنحن لم نمتنع بهذياناتك عن فعلتنا هذا قط\n ولم نقبل منك نصيحتك أصلاً\n\n\nوبعدما أيس من صلاحهم وإصالحهم { قَالَ } مشتكياً\n ملتجئاً نحوه\n مستنصراً منه: { رَبِّ } يا من رباني على صفة الصلاح والنظافة { ٱنصُرْنِي } بحولك وقوتك بإنزال العذاب { عَلَى ٱلْقَوْمِ ٱلْمُفْسِدِينَ } [العنكبوت: 30] المسرفين المفرطين في الإفساد\n الخارجين على مقتضى حدودك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أئِنكم لتأتون الرجالَ وتقطعون السبيلَ } اي: تتعرضون للسابلة بالقتل وأخذ المال\n كما هو شأن قُطاع الطريق\n وقيل: اعتراضهم السابلة لقصد الفاحشة\n { وتأتون في ناديكم } في مجالسكم الغاصة بأهلها\n ولا يقال للمجلس: ناد\n إلا ما دام فيه أهله\n { المنكرَ } فعلهم الفاحشة بالرجال\n أو المضارطة\n أو: السباب والفحش في المزاح\n أو الحذف بالحصى\n أو: مضغ العلك\n أو الفرقعة\n وعن أم هانىء - رضي اله عنها - أنها سألت النبي صلى الله عليه وسلم عن قوله: { وتأتون في ناديكم المنكر }؟ فقال:\n \" كانوا يحذفون من يمرّ بهم الطريق\n ويسخرون منهم \" \nوقال معاوية: قال النبي صلى الله عليه وسلم:\n \" إن قوم لوط كانوا يجلسون في مجالسهم\n وعند كل قصعة من الحصى\n فإذا مر بهم عابر قذفوه\n فأيهم أصابه كان أَوْلَى به \"\n \n{ فما كان جوابَ قومه إلا أن قالوا ائتنا بعذابِ الله إن كنت من الصادقين } فيما تعدنا من نزول العذاب\n أو في دعوى النبوة\n المفهومة من التوبيخ\n { قال ربِّ انصرني } بإنزال العذاب { على القوم المفسدين } بابتداع الفاحشة وحمل الناس عليها\n وسَنِّهَا لِمَنْ بعدهم\n وصفهم بذلك مبالغة استنزال العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:75",
      "similarity": 0.4073450792633252
    },
    {
      "verse": "28:65",
      "similarity": 0.39302655649032453
    },
    {
      "verse": "15:62",
      "similarity": 0.34195660711125336
    },
    {
      "verse": "7:194",
      "similarity": 0.3381774605982182
    },
    {
      "verse": "10:89",
      "similarity": 0.33352424589055585
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/29:29.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/29:29.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/29:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}