{
  "chapter": "العنكبوت",
  "text": "وقال انما اتخذتم من دون الله اوثنا مودة بينكم فى الحيوة الدنيا ثم يوم القيمة يكفر بعضكم ببعض ويلعن بعضكم بعضا وماوىكم النار وما لكم من نصرين",
  "translations": [
    {
      "translation": "He said, 'You have adopted idols apart from Allah as tokens of mutual affection in this world. But then on the Day of Rising you will reject one another and curse one another. The Fire will be your shelter. You will have no helpers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"You have taken to idols through mutual affection in this life, in place of God, but on the Day of Resurrection you will disown and curse each other, and your abode will be Hell, and you will have none to help you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: “You have taken up idols instead of Allah as a bond of love among yourselves in the present life, but on the Day of Resurrection you will disown and curse one another. Your refuge shall be the Fire, and none will come to your aid.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said, \"You believe in idols besides God only out of worldly love, but on the Day of Judgment you will reject and condemn each other. Your dwelling will be fire and no one will help you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim said, “You have chosen only idols instead of Allah, with whom your friendship is only in the life of this world; then on the Day of Resurrection you will deny and curse each other; and the destination for all of you is hell, and you do not have supporters.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (Ibrahim) said: \"You have taken idols instead of Allah. The love between you is only in the life of this world, but on the Day of Resurrection, you shall deny each other, and curse each other, and your abode will be the Fire, and you shall have no helper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: You have only taken for yourselves idols besides Allah by way of friendship between you in this world's life, then on the resurrection day some of you shall deny others, and some of you shall curse others, and your abode is the fire, and you shall not have any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, 'You have only taken to yourselves idols, apart from God, as a mark of mutual love between you in the present life; then upon the Day of Resurrection you will deny one another, and you will curse one another, and your refuge will be the Fire, and you will have no helpers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Ye have chosen only idols instead of Allah. The love between you is only in the life of the world. Then on the Day of Resurrection ye will deny each other and curse each other, and your abode will be the Fire, and ye will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said, \"You have taken up the worship of idols, instead of God, to promote friendship between yourselves in the present life. But on the Day of Judgement, you will disown and curse one another. Your abode will be the Fire and you will have no helpers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: ye have taken images instead of Allah out of affection between you in the life of the world; but on the Day of Resurrection ye shall deny each other and ye shall curse each other, and your resort shall be the Fire, and ye shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘You have taken idols [for worship] besides Allah for the sake of [mutual] affection amongst yourselves in the life of the world. Then on the Day of Resurrection you will disown one another and curse one another, and the Fire will be your abode, and you will not have any helpers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"For you, ye have taken (for worship) idols besides Allah, out of mutual love and regard between yourselves in this life; but on the Day of Judgment ye shall disown each other and curse each other: and your abode will be the Fire, and ye shall have none to help.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [Ibrahim (Abraham)] said: \"You have taken (for worship) idols instead of Allah, and the love between you is only in the life of this world, but on the Day of Resurrection, you shall disown each other, and curse each other, and your abode will be the Fire, and you shall have no helper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Other than Allah, you have taken to yourselves idols as an affection between yourselves in the present life. Then, on the Day of Resurrection, you shall deny one another and curse one another, and your refuge will be the Fire, and none shall help you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, “You have chosen idols instead of God, out of affection for one another in the worldly life. But then, on the Day of Resurrection, you will disown one another, and curse one another. Your destiny is Hell, and you will have no saviors.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [Abraham] said, \"You have only taken, other than Allah, idols as [a bond of] affection among you in worldly life. Then on the Day of Resurrection you will deny one another and curse one another, and your refuge will be the Fire, and you will not have any helpers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:25] And he, Abraham, said: ‘You have adopted mere idols besides God, which you worship (mā [of innamā] relates to the verbal noun) for the sake of [mutual] affection between you (mawaddatu baynikum: this is the predicate of inna [of innamā]; the accusative reading [mawaddata baynikum] would denote a direct object denoting reason, so that the mā would denote ‘entirety’) — in other words, you are friends of one another in your worship of them, in the life of this world. Then on the Day of Resurrection you will disown one another, the leaders will dissociate from those who followed [them]; and you will curse one another, those who followed will curse their leaders; and your abode, your destination all together, will be the Fire, and you will have no helpers’, to protect you against it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Abraham said to his people: (Ye have chosen) you have worshipped (idols) stones (instead of Allah. The love) the connection (between you is only in the life of the world) it will not last. (Then on the Day of Resurrection ye will deny each other) you absolve yourselves from each other (and curse each other, and your abode) your destination (will be the Fire) i.e. the worshipper and the worshipped, (and ye will have no helpers) to save you from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما اتّخذتم من دون الله } شيئاً عبدتموه مودوداً فيما بينكم { في الحياة الدنيا } أو أن كل ما اتخذتم من دون الله شيئاً مودوداً فيما بينكم في الحياة الدنيا\n أو أن كل ما اتخذتم أوثاناً مودوداً في هذه الحياة أو لمودّة بينكم في هذه على القراءتين\n والمعنى: أن المودة قسمان: مودّة دنيوية ومودة أخروية\n والدنيوية منشؤها النفس من الجهة السفلية\n والأخروية منشؤها الروح من الجهة العلوية\n فكل ما يحب ويودّ من دون الله لا لله ولا بمحبة الله فهو محبوب بالمودّة النفسية\n وهي هوى زائل كلما انقطعت الوصلة البدنية زالت ولم تصل إلى إحدى القيامات فإنها نشأت من تركيب البدن واعتدال المزاج\n فإذا انحلّ التركيب وانحرف المزاج تلاشت وبقي التضادّ والتعاند بمقتضى الطبائع كقوله تعالى: { ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضاً } ولهذا شبهها ببيت العنكبوت في الوهن في قوله: { مثل الذين اتخذوا من دون الله أولياء كمثل العنكبوت } إلى آخر الآية\n وأما الأخرية فمنشؤها الذات الأحدية والمحبة الإلهية\n وتلك المودّة هي التي تكون بين الأصفياء والأولياء لتناسب الصفات وتجانس الذوات لا تتصفى غاية الصفاء ولا تتجرّد عن الغطاء إلا عند زوال التركيب والبروز عن حجب النفس والبدن في مقام القلب الروح لقربها من منبعها هناك فتصير يوم القيامة محبّة صرفة صافية الهيئة بخلاف تلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أنجاه الله منها { وَ } أيس من إيمان قومه { قَالَ } لهم موبخاً عليهم وموعداً لهم بوحي الله وإلهامه: { إِنَّمَا ٱتَّخَذْتُمْ } وأخذتم { مِّن دُونِ ٱللَّهِ } المتوحد بالألوهية والربوبية { أَوْثَاناً } آلهة: لتكونوا أسباباً لكم توجب { مَّوَدَّةَ بَيْنِكُمْ } وتوقع المحبة والمؤاخاة بين أظهركم { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } بأن تجتمعوا عندها وتعتكفوا حولها\n وتتقربوا إليها بالهدايا والقرابين { ثُمَّ } اعلموا أيها الضالون المنهمكون في بحر الغفلة والضلال والجهل بالله وبقدره وقدر حوله وقوته { يَوْمَ ٱلْقِيَامَةِ } المعدة للعرض والجزاء وحساب ماصدر عنكم في دار الابتلاء { يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ } يعني: يقع التناكر والتخاصم بينكم\n فيكفر بعضكم ببعض { وَيَلْعَنُ بَعْضُكُمْ بَعْضاً } أي: كل منكم ومن معبودكم يتلاعنون ويتخاصمون حال كونكم متبرئين كل منكم عن صحابه تابعاً ومتبوعاً\n عابداً ومعبوداً { وَ } بالجملة: { مَأْوَاكُمُ } ومرجعكم إليها أنتم وآلهتكم جميعاً\n خالدون فيها لا نجاة لكم منها بأعمالكم وأفعالكم { ٱلنَّارُ وَمَا لَكُمْ مِّن نَّاصِرِينَ } [العنكبوت: 25] ليشفعوا لكم وينقذوكم منها بشفاعتهم\n\n\nوبعدما أنجى سبحانه خليله - صلوات الرحمن عليه وسلامه - من النار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مودَّةَ بينكم }: مَنْ نَصَبَها: فله وجهان أحدهما: على التعليل\n أي لتوادوا بينكم\n والمفعول الثاني محذوف\n أي: اتخذتم أوثاناً آلهة\n والثاني على المفعول الثاني لاتخذتم\n كقوله:\n[الفرقان: 43]\n وما: كافة\n أي: اتخذتم الأوثان سَبَبَ المودَّةِ على حَذْفِ مضاف\n أو: اتخذتموها مَوْدُودَةً بينكم\n وبينكم: نصب على الظرفية نعت لمودة\n أي: حاصلة بينكم\n ومن رفع: فله وجهان إما خبر إن\n وما موصولة\n أو: عن مبتدأ محذوف\n أي: هي مودة بينكم\n وبينكم: مضاف إليه ما قبله\n يقول الحق جل جلاله: { فما كان جوابَ قومه } قوم إبراهيم حين دعاهم إلى الله { إلا أن قالوا اقتلوه أو حَرِّقوه } \n قاله بعضهم لبعض\n أو: قاله واحد منهم\n وكان الباقون راضين\n فكانوا جميعاً في الحكم القائلين\n فاتفقوا على تحريقه\n { فأنجاه الله من النار } حين قذفوه فيها بأن جعلها برداً وسلاماً\n وتقدم في الأنبياء تمام القصة\n { إن في ذلك } فيما فعلوه به وفعلناه { لآياتٍ } دالةً على عظم قدرته { لقوم يؤمنون } لأنهم المنتفعون بالفصح عنها والتأمل فيها\n رُوي أنه لم ينتفع بها في تلك الأيام أحد لذهاب حرها لأن كل نار سمعت الخطاب فامتثلت\n { وقال } إبراهيمُ لقومه: { إِنما اتخذتم من دون الله أوثاناً } أصناماً آلهة { مودَّةَ بينكم في الحياة الدنيا } أي: لتوادوا بينكم في الحياة الدنيا\n وتواصلوا لاجتماعكم على عبادتها\n واتفاقكم عليها كما تتفق الناس على مذهب أو طريق\n فيكون ذلك سبب تحابهم\n أو: إنما اتخذتم الأوثان سبب المودة\n أو اتخذتموها مودودة ومحبوبة بينكم\n أو: إن التي اتخذتموها أوثاناً تعبدونها هي مودة بينكم في الدنيا\n { ثم يوم القيامة يكفر بعضكم ببعض } أي: تتبرأ الأصنام من عابديها كقوله:\n[الزخرف: 67]\n { ويلعن بعضُكم بعضاً } \n فتلعن الأتباعُ الرؤساء: { ومأواكم النار } أي: مأوى العابد والمعبود والتابع والمتبوع\n { وما لكم من ناصرين } يحصنونكم منها\n الإشارة: الإنكار على أهل الخصوصية سنَّة الله في خلقه\n فلا يأنف منها إلا جاهل\n والاجتماع على التودد على غير ذكر الله ومحبته وما يقرب إليه\n كله يؤدي إلى التباغض والتلاعن يوم القيامة { الأخلاء يومئذٍ بعضهم لبعض عدو إلا المتقين } \n وهم المتحابون في الله\n والمجتمعون على ذكر الله والعلم به\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:17",
      "similarity": 0.7337926881090171
    },
    {
      "verse": "22:30",
      "similarity": 0.5504045019147209
    },
    {
      "verse": "45:34",
      "similarity": 0.15790494192790053
    },
    {
      "verse": "4:89",
      "similarity": 0.15481706701632544
    },
    {
      "verse": "8:72",
      "similarity": 0.15308277972372603
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/29:25.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/29:25.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/29:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}