{
  "chapter": "العنكبوت",
  "text": "ولوطا اذ قال لقومه انكم لتاتون الفحشة ما سبقكم بها من احد من العلمين",
  "translations": [
    {
      "translation": "When Lut said to his people, 'You are committing an obscenity not perpetrated before you by anyone in all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Lot when he said to his people: \"You indulge in lecherous acts which none of the creatures had done before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Lot and he said to his people: “You commit the abomination that none in the world ever committed before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lot told his people, \"You are certainly committing the kind of indecency which no one in the world has committed before\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We rescued Lut when he said to his people, “You indeed commit the shameful; such that no one in the creation has ever done before you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Lut, when he said to his people: \"You commit immoral sins which none has preceded you in (committing) it in all creatures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We sent) Lut when he said to his people: Most surely you are guilty of an indecency which none of the nations has ever done before you;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot, when he said to his people 'Surely you commit such indecency as never any being in all the world committed before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot! (Remember) when he said unto his folk: Lo! ye commit lewdness such as no creature did before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Lot to his people and he said to them, \"Indeed you commit obscenity such as no people before you have ever committed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lut: Recall what time he said unto his people: verily ye commit an indecency wherein none hath preceded you in the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot, when he said to his people, ‘You indeed commit an indecency none in the world has ever committed before you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Lut: behold, he said to his people: \"Ye do commit lewdness, such as no people in Creation (ever) committed before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Lout (Lot), when he said to his people: \"You commit Al-Fahishah (sodomy the worst sin) which none has preceded you in (committing) it in the 'Alamin (mankind and jinns).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot who said to his nation: 'You commit indecency which no other being in all the world has committed before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot, when he said to his people, “You are committing an obscenity not perpetrated before you by anyone in the whole world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] Lot, when he said to his people, \"Indeed, you commit such immorality as no one has preceded you with from among the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:28] And, mention, Lot, when he said to his people ‘Truly you (read a-innakum, pronouncing both hamzas, or not pronouncing the second and inserting an alif between the two in either case and in both instances) commit lewdness, namely, [coming in unto] the rears of men, such as none in [all] the worlds, of jinn or men, has committed before you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Lot!) We sent Lot to his folk ((Remember) when he said unto his folk: Lo! ye commit lewdness) sodomy (such as no creature did before you) He said: no one before has ever committed your abominable act.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً { لُوطاً } إلى قوم انحرفوا عن جادة الاستقامة\n وضلوا عن سواء السبيل\n اذكر يا أكمل الرسل { إِذْ قَالَ } لوط { لِقَوْمِهِ } بوحي الله إياه وإلهامه: { إِنَّكُمْ } أيها المفسدون المسرفون { لَتَأْتُونَ ٱلْفَاحِشَةَ } أي الفعلة التي { مَا سَبَقَكُمْ بِهَا } بغاية قبحها وهجنتها ونهاية شنعتها { مِنْ أَحَدٍ } أي: أحد { مِّنَ ٱلْعَالَمِينَ } [العنكبوت: 28] من بني نوعكم\n بل أنتم ابتدعتموها واخترعتموها من خباثة نفوسكم وشؤم شهوتكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { و } اذكر { لوطاً إِذْ قال لقومه إِنكم لتأتون الفاحشةَ } أي: الفعلة البالغة في القُبح\n وهي اللواطة\n { ما سَبَقَكم بها من أحدٍ من العالمين }: جملة مستأنفة مقررة لفحش تلك الفعلة\n كأن قائلاً قال: لِمَ كانت فاحشة؟ فقال: لأن أحداً ممن قبلهم لم يقدم عليها\n قالوا: لم يَنْزُ ذكر على ذكر قبل قوم لوط",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:80",
      "similarity": 0.9902799715192134
    },
    {
      "verse": "27:54",
      "similarity": 0.7697231750260373
    },
    {
      "verse": "2:169",
      "similarity": 0.48742118171371035
    },
    {
      "verse": "37:133",
      "similarity": 0.44439184178364566
    },
    {
      "verse": "26:160",
      "similarity": 0.4363696248558349
    }
  ]
}