{
  "chapter": "العنكبوت",
  "text": "يعذب من يشاء ويرحم من يشاء واليه تقلبون",
  "translations": [
    {
      "translation": "He punishes anyone He wills and has mercy on anyone He wills. You will be returned to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Punish whom He will, and have mercy on whom He please. And to Him will you be brought back in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He chastises whom He will and forgives whom He will. To Him all of you will be sent back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes or grants mercy to whomever He wants and to Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whomever He wills and has mercy upon whomever He wills; and towards Him only you are to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He wills, and shows mercy to whom He wills; and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He pleases and has mercy on whom He pleases, and to Him you shall be turned back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "chastising whom He will, and having mercy on whomsoever He will, and unto Him you shall be turned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punisheth whom He will and showeth mercy unto whom He will, and unto Him ye will be turned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He will and shows mercy to whom He pleases. And to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He shall torment whomsoever He Will, and shall show mercy unto whomsoever He Will, and unto Him ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will punish whomever He wishes and have mercy on whomever He wishes, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He pleases, and He grants Mercy to whom He pleases, and towards Him are ye turned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He will, and shows mercy to whom He will, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He will and has mercy to whom He will. To Him you shall be turned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He wills, and He grants mercy to whom He wills, and to Him you will be restored.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He punishes whom He wills and has mercy upon whom He wills, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:21] He chastises whomever He will, to chastise, and has mercy on whomever He will, to have mercy, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He punisheth whom He will) He makes die whoever He will as a disbeliever and thus torments him (and showeth mercy unto whom He will) and makes to die whoever He will as a believer and thus shows mercy upon him, (and unto Him ye will be turned) after death and He will reward each according to his works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِلَيْهِ تُقْلَبُونَ } معناه تَرجِعونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال قدرته ومقتضى حكمته ومشيئته: { يُعَذِّبُ } من عباده { مَن يَشَآءُ } لا ملجأ لهم دونه ولا مرجع لهم سواه؛ إذ { وَيَرْحَمُ مَن يَشَآءُ } برحمته الواسعة أيضاً كذلك على مقتضى لطفه وجماله { وَ } لا ملجأ لهم دونه ولا مرجع لهم؛ إذ { إِلَيْهِ } لا إلى غيره؛ إذ لا غير في الوجود معه { تُقْلَبُونَ } [العنكبوت: 21] انقلاب الزبد هواء والأمواج ماء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يُعذِّب من يشاء } بعدله { ويرحم من يشاء } بفضله، أو: يُعذب من يشاء بالخذلان، ويرحم بالهداية للإيمان، أو: يُعذب من يشاء بالحرص، ويرحم من يشاء بالقناعة، أو: يُعذب بالتدبير والاختيار ويرحم بالرضا والتسليم لمجاري الأقدار، أو: يُعذب بالإعراض عنه، ويرحم بالإقبال عليه، أو: بالاستتار والتجلي، أو: بالقبض والبسط، أو بالمجاهدة والمشاهدة، إلى غير ذلك\n { وإليه تقلبون } تُردون للحساب والعقاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:14",
      "similarity": 0.6028750774722829
    },
    {
      "verse": "7:125",
      "similarity": 0.5834690198938478
    },
    {
      "verse": "3:129",
      "similarity": 0.4683647298215135
    },
    {
      "verse": "48:14",
      "similarity": 0.41632489551264207
    },
    {
      "verse": "26:194",
      "similarity": 0.39288511215699423
    }
  ]
}