{
  "chapter": "العنكبوت",
  "text": "فما كان جواب قومه الا ان قالوا۟ اقتلوه او حرقوه فانجىه الله من النار ان فى ذلك لءايت لقوم يؤمنون",
  "translations": [
    {
      "translation": "The only answer of his people was to say: 'Kill him or burn him!' But Allah rescued him from the fire. There are certainly Signs in that for people who are muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people (of Abraham) had no answer except: \"Kill him or burn him;\" but God saved him from the fire. There are lessons in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people (of Abraham) had no other answer than to say: “Kill him or burn him.” But Allah delivered him from the fire. There are many Signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Abraham's) people had no answer except suggesting, \"Kill him or burn him.\" But God saved him from the fire. In this there is evidence (of truth) for the believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his people could not answer him except to say, “Kill him or burn him” – so Allah rescued him from the fire; indeed in this are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So nothing was the answer of people except that they said: \"Kill him or burn him.\" Then Allah saved him from the fire. Verily, in this are indeed signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So naught was the answer of his people except that they said: Slay him or burn him; then Allah delivered him from the fire; most surely there are signs in this for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the only answer of his people was that they said, 'Slay him, or burn him!' Then God delivered him from the fire; surely in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the answer of his folk was only that they said: \"Kill him\" or \"Burn him.\" Then Allah saved him from the Fire. Lo! herein verily are portents for folk who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only response of Abraham's people was, \"Kill him or burn him!\" But God saved him from the fire. Surely in this there are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the answer of his people was naught but that they said: slay him, or burn him. Then Allah delivered him from the fire; verily herein are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the only answer of his people was that they said, ‘Kill him, or burn him.’ Then Allah delivered him from the fire. There are indeed signs in that for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So naught was the answer of (Abraham's) people except that they said: \"Slay him or burn him.\" But Allah did save him from the Fire. Verily in this are Signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So nothing was the answer of [Ibrahim's (Abraham)] people except that they said: \"Kill him or burn him.\" Then Allah saved him from the fire. Verily, in this are indeed signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only answer his nation gave was that they said: 'Kill him, or burn him! 'But Allah saved him from the fire. Surely, in this there are signs for a nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the only response from his people was their saying, “Kill him, or burn him.” But God saved him from the fire. Surely in that are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the answer of Abraham's people was not but that they said, \"Kill him or burn him,\" but Allah saved him from the fire. Indeed in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:24] God, exalted be He, says with regard to the tale of Abraham, peace be upon him: But the only answer of his people was that they said, ‘Slay him, or burn him!’ Then God delivered him from the fire, into which they threw him, by making it cool and harmless for him. Surely in that, namely, [in that] deliverance of him from it, there are signs — namely, the fact that it did not have any affect on him despite its greatness, and the fact that it was extinguished and that within a brief period meadows sprung up in its place — for a people who believe, [a people who] affirm the truth of God’s Oneness and His power, for they are the ones to benefit from these [signs].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "But the answer of his folk was) the response of Abraham's folk when he called them to believe in Allah was (only that they said: \"Kill him\" or \"Burn him\".) or throw him in the Fire. (Then Allah saved him from the Fire) without harm. (Lo! Herein) in that which We did with the folk of Abraham (verily are portents) lessons (for folk who believe) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما بلغ الخليل - صلوات الرحمن وسلام عليه - في الدعوة والإرشاد، وأيده بأنواع المواعظ والتذكيرات والرموز و الإشارات، ونبذ من الوعيدات والإنذارات رجاء أن يتنبهوا منها ويتفطنوا به اعلى ما هو الحق { فَمَا كَانَ جَوَابَ قَوْمِهِ } بعد استماعهم مقالاه تفصيلاً { إِلاَّ أَن قَالُواْ } متفقين مجتمعين: { ٱقْتُلُوهُ } حداً، فإنه قد أعرض عن دينكم وانصرف عن آلهتكم وشفعاءكم { أَوْ حَرِّقُوهُ } فإنه جدير بالإحراق؛ لعظم جرمه وكبر ذنبه، وبعدما اتفقوا على حرقه أو قدوا ناراً عظيمة بحيث لا يمكن التقرب إليها إلا بمسافة بعيدة، فوضعوه في المنجنيق، فرموه بها إليها { فَأَنْجَاهُ ٱللَّهُ } الرقيب المطلع على إخلاص عباده وأخلصه { مِنَ } حرق { ٱلنَّارِ } وجعلها له برداً وسلاماً { إِنَّ فِي ذٰلِكَ } الإنجاء والإنقاذ مع أن طبع النار الإحراق والإفناء { لآيَاتٍ } عظام ودلائل جسام على كمال قدرة الله وحوله وقوته { لِّقَوْمٍ يُؤْمِنُونَ } [العنكبوت: 24] بوحدة ذاته وكمال أسمائه وصفاته؛ لأ،هم هم المنتفعون بأمثال هذه الشواهد والبراهين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:68",
      "similarity": 0.7275533790754474
    },
    {
      "verse": "85:10",
      "similarity": 0.6504705429496394
    },
    {
      "verse": "8:50",
      "similarity": 0.5516193097709357
    },
    {
      "verse": "3:181",
      "similarity": 0.5453451904161226
    },
    {
      "verse": "22:22",
      "similarity": 0.5057416158004652
    }
  ]
}