{
  "chapter": "العنكبوت",
  "text": "قل سيروا۟ فى الارض فانظروا۟ كيف بدا الخلق ثم الله ينشئ النشاة الءاخرة ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "Say: \"Travel on the earth and see how He originated creation. Then (you will know) how God will raise the last raising (of the dead). Surely God has power over everything,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “Go about the earth and see how He created for the first time, and then Allah will recreate life.” Surely, Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to them, \"Travel through the land and see how He has begun the creation and how He will invent the next life. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Travel in the land and see how He creates for the first time, then Allah brings forth the next development; indeed Allah is Able to do all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Travel in the land and see how He originated the creation, and then Allah will bring forth the creation of the Hereafter. Verily, Allah is able to do all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Travel in the earth and see how He makes the first creation, then Allah creates the latter creation; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Journey in the land, then behold how He originated creation; then God causes the second growth to grow; God is powerful over everything,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Travel in the land and see how He originated creation, then Allah bringeth forth the later growth. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, \"Roam the earth and see how He originated creation. Then God will bring into being your second life. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: go about in the land and behold what wise He hath originated creation; and then Allah shall produce another production; verily Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Travel over the land and observe how He has originated the creation.’ Then Allah will bring about the genesis of the Hereafter. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Travel through the earth and see how Allah did originate creation; so will Allah produce a later creation: for Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Travel in the land and see how (Allah) originated creation, and then Allah will bring forth (resurrect) the creation of the Hereafter (i.e. resurrection after death). Verily, Allah is Able to do all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Travel in the land and see how He started the Creation. Then Allah will originate the Everlasting Life. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Roam the earth, and observe how He originated the creation.” Then God will bring about the next existence. God has power over all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Travel through the land and observe how He began creation. Then Allah will produce the final creation. Indeed Allah, over all things, is competent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:20] Say: ‘Travel in the land and observe how He originated creation, of those before you, and [how He] made them die. Then God shall bring about the other genesis (al-nashā’a, or al-nash’a). Truly God has power over all things, among them the origination [of creation] and the restoration [thereof].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (Travel in the land and see how He) how Allah (originated creation) from a sperm drop and then destroyed them after that, (then Allah bringeth forth the later growth) then Allah creates the creation on the Day of Judgement. (Lo! Allah is Able to do all things) of creation, resurrection, life and death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن أنكروا لك ولم يقبلوا منك تنويرك الذي جئت به { قُلْ } لهم يا أكمل الحلم والخلة: { سِيرُواْ فِي ٱلأَرْضِ } سير معتبر خبير { فَٱنظُرُواْ } بنظر الاعتبار والاستبصار { كَيْفَ بَدَأَ } وأظهر { ٱلْخَلْقَ } في أقطار الآفاق ونشرهم فيها وبسطهم عليها بامتداد أظلال أسمائه وصفاته { ثُمَّ ٱللَّهُ } القادر المقتدر على كل ما أراد وشاء بالاختيار والاستقلال { يُنشِىءُ ٱلنَّشْأَةَ ٱلآخِرَةَ } المقابلة لنشأة الظهور والإبداع، وهي نشأة الكمون والإخفاء والفناء والإفناء، بأن قبض سبحانه بمقتضى قهره وجلاله جميع ما امتد من أضلال، وطوى نحوه ما نشر من آثار الأوصاف والأسماء { إِنَّ ٱللَّهَ } المتردي برداء العظمة والكبرياء { عَلَىٰ كُلِّ شَيْءٍ } من مقدرواته ومراداته { قَدِيرٌ } [العنكبوت: 20] لا تنتهي قدرته عند مقدورٍ، بل له أن يتصرف فيه كيف شاء ومتى أراد أزلاً وأبداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قُلْ سيروا في الأرض } أي: قل يا محمد، وإن كان من كلام إبراهيم فتقديره: وأوحينا إليه أن قل: سيروا في الأرض، { فانظروا كيف بدأَ الخلقَ } على كثرتهم، واختلافْ أحوالهم وألسنتهم وألوانهم وطبائعهم، تفاوت هيئاتهم، لتعرفوا عجائب قدرة الله بالمشاهدة، ويقوي إيمانكم بالبعث، وهو قوله: { ثم الله ينشىءُ النشأةَ الآخرةَ } أي: البعث، وهذا دليل على أنهما نشأتان: نشأة الاختراع ونشأة الإعادة، غير إن الآخرة إنشاء بعد إنشاء، والأولى ليست كذلك\n والقياس أن يقال: كيف بدأ الله الخلق ثم ينشىء النشأة الآخرة، وإنما عدل عنه لأن الكلام معهم وقع في الإعادة، فلما قررهم في الإبداء، بإنه من الله، احتج بأن الإعادة إنشاء مثل الإبداء، فإذا لم يعجزه الإبداء وجب ألا يعجزه الإعادة فكأنه قال: ثم ذلك الذي أنشأ الأولى هو الذي يُنشىء النشأة الآخرة، فللتنبيه على هذا أبرز اسمه وأوقعه مبتدأ\n قال النسفي\n { إن الله على كل شيءٍ قديرٌ } فلا يعجزه شيء",
      "translations": []
    }
  ]
}