{
  "chapter": "العنكبوت",
  "text": "وما انتم بمعجزين فى الارض ولا فى السماء وما لكم من دون الله من ولى ولا نصير",
  "translations": [
    {
      "translation": "There is no way out for you in earth or heaven. You have no protector or helper besides Allah.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Escape Him you cannot either in the earth or in the sky; and you have no friend or helper apart from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot overpower Allah, neither on the earth nor in the heaven. None can protect you from Allah nor come to your aid against Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot challenge God in the heavens or in the earth. No one besides God is your guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither can you escape (from His control) in the earth nor in the sky; and for you, other than Allah, there is neither a friend nor a supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot escape in the earth or in the heaven. And besides Allah you have neither any protector nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall not escape in the earth nor in the heaven, and you have neither a protector nor a helper besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are not able to frustrate Him either in the earth or in heaven; and you have not, apart from God, either protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye cannot escape (from Him) in the earth or in the sky, and beside Allah there is for you no friend or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot defeat His purpose on earth or in heaven; nor have you any friend or helper besides God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye cannot escape in the earth nor in the heaven, and beside Allah there is for you no friend nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot frustrate Him on the earth or in the sky, nor do you have besides Allah any guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not on earth nor in heaven will ye be able (fleeing) to frustrate (his Plan), nor have ye, besides Allah, any protector or helper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot escape in the earth or in the heaven. And besides Allah you have neither any Wali (Protector or Guardian) nor any Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are not able to frustrate Him either in the earth or heaven, nor have you, other than Allah, a guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot escape, on earth or in the heaven; and you have no protector and no savior besides God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will not cause failure [to Allah] upon the earth or in the heaven. And you have not other than Allah any protector or any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:22] And you will never be able to thwart [Him], your Lord [and prevent Him] from catching up with you, on earth, or in the heaven, were you to be in it, in other words, you cannot elude Him; and you do not have besides God, that is, other than Him, any guardian, to defend you against Him, or any helper, to help you [escape] from His chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ye cannot) people of Mecca (escape) from His torment (in the earth) from the people of earth (or in the sky) or from the dwellers of the sky, (and beside Allah) beside Allah's punishment (there is for you no friend) to benefit you (nor helper) to save you from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لا يخفى عليه شيء في الأرض ولا في السماء { وَ } بالجملة: { مَا لَكُمْ مِّن دُونِ ٱللَّهِ } المعيد المبدئ\n المحيي المميت { مِن وَلِيٍّ } يولي أموركم بالاستقلال ويتصرف فيكم بالإرادة والاختيار { وَلاَ نَصِيرٍ } [العنكبوت: 22] ينصركم على أعدائكم ويدفع ضررهم عنكم\n\n\nثم قال سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما أنتم بمعجزين } أي: بفائتين ربكم إن هربتم من حكمه وقضائه\n { في الأرض } الفسيحة\n { ولا في السماء } التي هي أفسح منها وأبسط\n لو كنتم فيها\n\n{ وما لكم من دون الله من وليٍّ } يتولى أموركم\n { ولا نصير } ولا ناصر يمنعكم من عذابه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:31",
      "similarity": 0.9788971631729187
    },
    {
      "verse": "11:33",
      "similarity": 0.7206085434068157
    },
    {
      "verse": "6:134",
      "similarity": 0.6904130619922829
    },
    {
      "verse": "16:46",
      "similarity": 0.6622659226401988
    },
    {
      "verse": "46:32",
      "similarity": 0.6521681008604119
    }
  ]
}