{
  "chapter": "العنكبوت",
  "text": "احسب الناس ان يتركوا۟ ان يقولوا۟ ءامنا وهم لا يفتنون",
  "translations": [
    {
      "translation": "Do men think they will get away by saying: \"We believe,\" and will not be tried?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do people think that they will be let go merely by saying: “We believe,” and that they will not be tested,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do people think they will not be tested because they say, \"We have faith?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do men fancy that they will be left just upon their declaring, “We believe”, and they will not be tested?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do people think that they will be left alone because they say: \"We believe,\" and will not be tested.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do men think that they will be left alone on saying, We believe, and not be tried?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people reckon that they will be left to say 'We believe,' and will not be tried?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do men imagine that they will be left (at ease) because they say, We believe, and will not be tested with affliction?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do people think that once they say, \"We believe,\" they will be left alone and not be put to the test?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink men that they shall be left alone because they say: we believe; and that they shall not be tempted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people suppose that they will be let off because they say, ‘We have faith,’ and they will not be tested?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do men think that they will be left alone on saying, \"We believe\", and that they will not be tested?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do people think that they will be left alone because they say: \"We believe,\" and will not be tested.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do people think that they are left alone by saying: 'We are believers' and will not be tried?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the people supposed that they will be left alone to say, “We believe,” without being put to the test?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people think that they will be left to say, \"We believe\" and they will not be tried?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:2] Do people suppose that they will be left to say, that is, [that they will be left alone] because of their saying, ‘We believe’, and they will not be tried?, tested with that which will reveal the sincerity of their belief. This [verse] was revealed regarding a group of individuals who when they became believers endured suffering at the hands of the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Do men) do the Companions of Muhammad (pbuh) (imagine that they will be left) that they be given a reprieve after Muhammad (pbuh) (because they say, We believe) in Muhammad (pbuh) and in the Qur'an, 447 (and will not be tested with affliction) and will not be tried with caprice, blameworthy innovations and the violation of sanctities?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر، قال: حدّثنا علي بن أحمد قال: حدّثنا عطاءُ بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَهُمْ لاَ يُفْتَنُونَ } معناه لا يَبتلونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَحَسِبَ } وظن { ٱلنَّاسُ } المنهمكون في الغفلة والنيسان { أَن يُتْرَكُوۤاْ } ويُهملوا على ما هم عليه من عدم مطابقة قلوبهم لأفواههم، وأعمالهم بنياتهم، وأفعالهم بحالاتهم بمجرد { أَن يَقُولُوۤاْ آمَنَّا } بلا موافقة من قلوبهم، مع أن الإيمان في الأصل هو الإذعان والقبول والإخلاص بالقلب، والانقياد والتسليم بالجوارح والآلات من لوازمه ومتمماته { وَهُمْ } بمجرد ما يلقلق به لسانهم، ويظهره بيانهم طنوا أنهم { لاَ يُفْتَنُونَ } [العنكبوت: 2] ولا يمتحنون، بلى والله لنبولنهم ونختبرهم بشيءٍ من الخوف والجوع، ونقص من الأمال والأنفس والثمرات، حتى ظهر إخلاصهم في جيع ما آمنوا، فترتب خلاصهم حنيئذٍ على إخلاصهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والكلام الدال على المضمون، الذي يقتضيه الحسبان هنا أن يتركوا مع قوله: { وهم لا يفتنون } أي: أحسبوا تركهم غير مفتونين لأن يقولوا: آمنا",
      "translations": []
    }
  ]
}