{
  "chapter": "العنكبوت",
  "text": "والذين كفروا۟ بـايت الله ولقائه او۟لئك يئسوا۟ من رحمتى واو۟لئك لهم عذاب اليم",
  "translations": [
    {
      "translation": "Those who reject Allah's Signs and the meeting with Him, such people can despair of My mercy, such people will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the signs of God and the meeting with Him, cannot have hope of My mercy. There is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved in Allah's signs and in meeting Him, it is they who have despaired of My Mercy; it is they for whom a painful chastisement lies ahead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have rejected God's revelations have no hope in receiving His mercy. They will face a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who did not believe in My signs and in meeting Me, are those who have no hope of My mercy, and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve in the Ayat of Allah and meeting with Him, such have no hope of My mercy: and for such there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who disbelieve in the communications of Allah and His meeting, they have despaired of My mercy, and these it is that shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve in God's signs and the encounter with Him -- they despair of My mercy, and there awaits them a painful chastisement.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in the revelations of Allah and in (their) Meeting with Him, such have no hope of My mercy. For such there is a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny God's revelations and the meeting with Him -- it is they who have despaired of My mercy. They will suffer a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in the signs of Allah and in their meeting with Him, they shall despair of My mercy, and they! theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the signs of Allah and the encounter with Him—they have despaired of My mercy, and for such there is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject the Signs of Allah and the Meeting with Him (in the Hereafter),- it is they who shall despair of My Mercy: it is they who will (suffer) a most grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah and the Meeting with Him, it is they who have no hope of My Mercy, and it is they who will (have) a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve the verses of Allah and the meeting with Him shall despair of My Mercy, for them there awaits a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved in God’s signs and His encounter—these have despaired of My mercy. For them is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the ones who disbelieve in the signs of Allah and the meeting with Him - those have despaired of My mercy, and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:23] And those who disbelieve in God’s signs and the encounter with Him, namely, the Qur’ān and the Resurrection [respectively], they have despaired of My mercy, that is, [of attaining] My Paradise, and for those there shall be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve in the revelations of Allah) those who disbelieve in Muhammad (pbuh) and in the Qur'an, i.e. the Jews, Christians and all other disbelievers (and in (their) Meeting with Him) and also disbelieve in resurrection after death, (such) who have these traits (have no hope of My mercy) of My Paradise; the reference here is to the Jews and Christians; they have no hope that in Paradise there will be food, drink and sexual intercourse. (For such there is a painful doom.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حثاً لهم إلى الإيمان وترغيباً لهم إلى التوحيد والعرفان: { وَٱلَّذِينَ كَفَرُواْ بِآيَاتِ ٱللَّهِ } الدالة على عظمة ذاته وكما أسمائه وصفاته { وَلِقَآئِهِ } أي: أنكروا بلقائه الموعود لأرباب الكشف والشهود { أُوْلَـٰئِكَ } البعداء المطرودون عن ساحة عز القبول هم الذين { يَئِسُواْ } وقنطوا { مِن رَّحْمَتِي } مع سعتها ووفورها { وَأُوْلَـٰئِكَ } المردودون في تيه الغفلة والضلال { لَهُمْ عَذَابٌ أَلِيمٌ } [العنكبوت: 23] في النشأة الأولى والأخرى\n لا يرجرى نجاتهم وخلاصهم أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين كفروا بآيات الله } بدلائله على وحدانيته، أو كتبه، أو معجزاته، { ولقائه } وكفروا بلقائه، { أولئك يئِسُوا من رحمتي } جنتي، { وأولئك لهم عذابٌ أليم } موجع\n وبالله التوفيق\n الإشارة: أَوَلَمْ ير أهل فكرة الاستبصار كيف يظهر الحقُّ تجلياته من عالم الغيب إلى عالم الشهادة، ثم يبطنها، فيردها لأصلها من اللطافة، ثم ينشأها النشأة الثانية، تكون معانيها أظهر من حسها، وقدرتُها أظهر من حكمتها، فليس عند أهل التوحيد الخاص شيء يفنى، وإنما يُبطن ما ظهر، ويُظهر ما بطن، ولا زائد على أسرار الذات وأنوار الصفات\n وهذا أمر لا يدركه إلا أفراد الرجال بصحبة أكابر الرجال، وهو لُب العلم، وخالصة طريقة ذكر الله، والتفرغ عن كل شيء ما يشغل عن الله، بعد قتل النفوس وحط الرؤوس وبذل الفلوس\n وبالله التوفيق\n ثم ذكر جواب قوم إبراهيم، فقال: { فَمَا كَانَ جَوَابَ قَوْمِهِ إِلاَّ أَن قَالُواْ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:9",
      "similarity": 0.6550787891345609
    },
    {
      "verse": "12:110",
      "similarity": 0.5477620561425037
    },
    {
      "verse": "60:13",
      "similarity": 0.4468673253958789
    },
    {
      "verse": "12:87",
      "similarity": 0.38473832533591773
    },
    {
      "verse": "17:83",
      "similarity": 0.27645073752019966
    }
  ]
}