{
  "chapter": "العنكبوت",
  "text": "ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا۟ وليعلمن الكذبين",
  "translations": [
    {
      "translation": "We tested those before them so that Allah would know the truthful and would know the liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had tried those who were before them so that God knew who spoke the truth, and who were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for We indeed tested those who went before them? Allah will most certainly ascertain those who spoke the truth and those who lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had certainly tried those who lived before them to make sure who were truthful in their faith and who were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed tested those before them – so Allah will surely test the truthful, and will surely test the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed tested those who were before them so that Allah will indeed know those who are true, and He will know those who are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We tried those before them, so Allah will certainly know those who are true and He will certainly know the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly tried those that were before them, and assuredly God knows those who speak truly, and assuredly He knows the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We tested those who were before you. Thus Allah knoweth those who are sincere, and knoweth those who feign.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly tried those who have gone before them, so God will certainly distinguish between those who are truthful and those who are lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have tempted those who were before them. So Allah will surely know those who are true and He will surely know the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We tested those who were before them. So Allah shall surely ascertain those who are truthful, and He shall surely ascertain the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did test those before them, and Allah will certainly know those who are true from those who are false.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed tested those who were before them. And Allah will certainly make (it) known (the truth of) those who are true, and will certainly make (it) known (the falsehood of) those who are liars, (although Allah knows all that before putting them to test).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tried those who have gone before them. Allah knows those who are truthful and those who lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tested those before them. God will surely know the truthful, and He will surely know the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We have certainly tried those before them, and Allah will surely make evident those who are truthful, and He will surely make evident the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:3] And certainly We tried those who were before them. So God shall surely know those who are sincere, in their faith — a knowledge of direct vision — and He shall surely know those who are liars, regarding it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We tested those who were before you) before the Companions of Muhammad (pbuh) after the demise of their prophets, with caprice, blameworthy innovations and the violation of sanctities. (Thus Allah knoweth) in order that Allah sees and distinguishes (those who are sincere) in their faith by avoiding caprice, blameworthy innovation and by shunning that which is unlawful, (and knoweth those who feign) i.e. the insincere in their faith who follow caprice, blameworthy innovation and the violation of sanctities.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ فَتَنَّا } معناه بَلونَا\n\n\n\n\nوقوله تعالى: { فَلَيَعْلَمَنَّ ٱللَّهُ ٱلَّذِينَ صَدَقُواْ } معناه فليَمْيِزَنَ\n لأَنَّ الله عزّ وجلّ قَد عَلَّمَ الأَشياءَ كُلَّها قَبلَ أوان كَونِها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ليس افتتاننا واختبارنا إياهم ببدع منا، بل { لَقَدْ فَتَنَّا } وامتحنا { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } من الأمم السالفة، مع أنهم يدعون الإيمان، ويتفوهون ويتقوهون به أمثالهم، ومع ذلك لم نتركهم بلا ابتلاء واختبار، وليس اختبارهم وامتحانهم إلا لإظهار حجتا البالغة عليهم، وإلاَّ { فَلَيَعْلَمَنَّ ٱللَّهُ } المطلع على ضمائر عباده وسرائرهم { ٱلَّذِينَ صَدَقُواْ } منهم، وأخلصوا في إيمانهم { وَلَيَعْلَمَنَّ ٱلْكَاذِبِينَ } [العنكبوت: 3] أيضاً منهم\n\n\n\n\nوهم الذين لا يخلصون مع الله في حالٍ من الأحوال، وعملٍ من الأعمال، ولا يسمعون أوامر الله ونواهيه من ألسنة رسله سمع قبولٍ ورضا، وإنما أرادوا بإيمانهم الظاهر الذي أتوا به على سبيل الكراهة إسقاط لوازم الكفر من حقن الدماء، وسلب الذراري ونهب الأموال، وإلا فهم ليسوا ممن يذعنون بدلائل التوحيد وبراهين الإيمان عن صميم قلوبهم، ظناً أنَّا غافلون عن بواطنهم ونياتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحق جل جلاله: { الم }: الألف: لوحدة أسرار الجبروت، واللام: لفيضان أنوار الملكوت، والميم: لاتصال المادة بعالم الملك\n فكأنه تعالى أقسم بوحدة جبروته وأنوار ملكوته واتصال مادته بملكه وخليقته، أنه لا يدع دعوة مدع إلا ويختبره ليظهر صدقه أو كذبه، وهذا معنى قوله: { أحَسِبَ الناسُ } أي: أظن الناس { أن يُتركوا } غير - مفتونين ومختَبَرِين، { أن يقولوا آمنَّا وهم لا يُفتنون } أظنوا أن يَدَّعوا الإيمان ولا يُختبرون عليه ليظهر الصادق من الكاذب، بل يمتحنهم الله بمشاق التكليف من مفارقة الأوطان، ومجاهدة الأعداء، ورفض الشهوات، ووظائف الطاعات، وبالفقر، والقحط، وأنواع المصائب في الأموال والأنفس، وإذاية الخلق ليتميز المخلص من المنافق، والثابت في الدين من المضطرب فيه، ولينالوا بالصبر على ذلك عوالي الدرجات، فإن مجرد الإيمان، وإن كان على خلوص قلب، لا يقتضي غير الخلاص من الخلود في العذاب، وما ينال العبدَ من المكاره يسمو به إلى أعلى الدرجات وأعظم المقامات، مع ما في ذلك من تصفية النفس وتهذيبها، لتتهيأ لإشراق أنوار مقام الإحسان\n رُوي أنها نزلت في ناس من أصحاب رسول الله صلى الله عليه وسلم، قد جزعوا من أذى المشركين، وضاقت صدورهم من ذلك، وربما استنكر بعضهم أن يُمكِّن اللهُ الكفرةَ من المؤمنين\n فزلت مُسلِّية ومعِلْمة أن هذه هي سيرة الله في عباده اختباراً لهم\n قال تعالى: { ولقد فتنَّا الذين مِنْ قبلهم } بأنواع المحن فمنهم من كان يُوضع المناشر على رأسه، فَيُفْرَقُ فرقتين، وما يصرفه ذلك عن دينه، ومنهم من كان يمشط بأمشاط الحديد، ومنهم من كان يُطرح في النار، وما يصده ذلك عن دينه\n { فليعْلَمَنَّ اللهُ } بذلك الامتحان { الذين صَدَقُوا } في الإيمان بالثبات، { وليعلمنَّ الكاذبين } بالرجوع عنه\n ومعنى علمه تعالى به، أي: علم ظهور وتمييز\n والمعنى: ولَيُمَيِّزَنَّ الصادق منهم من الكاذب، في الدنيا والآخرة\n قال ابن عطاء: يَتَبَيَّن صدق العبد من كذبه في أوقات الرخاء والبلاء، فمن شكر في أيام الرخاء، وصبر في أيام البلاء، فهو من الصادقين، ومن بطر في أيام الدنيا، وجزع في أيام البلاء، فهو من الكاذبين\n هـ\n الإشارة: سُنَّة الله تعالى في أوليائه: أن يمتحنهم في البدايات، فإذا تمكنوا من معرفة الله، وكمل تهذيبهم، أعزهم ونصرهم، وأظهرهم لعباده\n ومنهم من يتركهم تحت أستار الخمول، حتى يلقوه على ذلك وهم عرائس الملكوت، ضنَّ بهم أن يظهرهم لخلقه\n\n\nوالامتحان يكون على قدر المقام، وفي الحديث:\n\n \" أشدُّ الناسِ بلاءً: الأنبياء، ثم الأمْثَلُ فالأمثلُ، يُبْتَلَى الرجلُ على قدر ديِنهِ، فإن كان في دينه صُلْباً اشتد بلاؤُهُ وإن كان في دينِه رقَّةٌ ابتلى على قَدرِ دينِه فما يبرحُ البلاءُ بالعبدِ حتى يَتْرُكَهُ يَمْشِي على الأرْضِ وما عليه مِنْ خَطِيئة \"\n \n\nوقال صلى الله عليه وسلم:\n\n \" أشدُّ الناسِِ بلاءً في الدنيا: نبي أو صفي \" \n\nوقال صلى الله عليه وسلم:\n\n \" أشدُّ الناس بلاءً: الأنبياءُ، ثم الصالحون\n لقد كان أحدهم يُبْتَلى بالفقر، حتى ما يَجَدَ إلا العباءَةَ يُحَوِّيهَا فيلبسها، ويُبْتَلى بالقَمَلِ حتى يَقْتُلَهُ ولأَحَدُهُمْ كان أشدَّ فرحاً بالبلاء من أحَدِكُم بالعطاء \" \n\nمن الجامع\n والله تعالى أعلم\n ثم ذكر المؤذين لهم، فقال: { أَمْ حَسِبَ ٱلَّذِينَ يَعْمَلُونَ\n\n\n }\n",
      "translations": []
    }
  ]
}