{
  "chapter": "العنكبوت",
  "text": "فكذبوه فاخذتهم الرجفة فاصبحوا۟ فى دارهم جثمين",
  "translations": [
    {
      "translation": "But they denied him so the earthquake seized them and morning found them lying flattened in their homes.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him and were seized by an earthquake, and lay overturned in their homes in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denounced him as a liar. So a mighty earthquake overtook them, and by the morning they lay overturned in their houses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They rejected him so We jolted them with a violent earthquake and they were left motionless in their houses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response they denied him – thereupon the earthquake seized them – so at morning they remained lying flattened in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied him; so the earthquake seized them, and they lay, prostrate in their dwellings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected him, so a severe earthquake overtook them, and they became motionless bodies in their abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they cried lies to him; so the earthquake seized them, and morning found them in their habitation fallen prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him, and the dreadful earthquake took them, and morning found them prostrate in their dwelling place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected him, so the earthquake overwhelmed them and they were left lying prostrate on the ground in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they belied him; wherefore an earthquake laid hold of them, and they lay in their dwellings, crouching.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they impugned him, whereupon the earthquake seized them, and they lay lifeless prostrate in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected him: Then the mighty Blast seized them, and they lay prostrate in their homes by the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they belied him [Shu'aib (Shuaib)], so the earthquake seized them, and they lay (dead), prostrate in their dwellings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they belied him, so the earthquake seized them, and when morning came, they were found fallen crouched in their dwellings, dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected him, so the tremor overtook them, and they were left motionless in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him, so the earthquake seized them, and they became within their home [corpses] fallen prone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:37]   But they denied him, and so the earthquake, the violent tremor, seized them, and they ended up lying lifeless prostrate in their habitations, keeled over their knees, dead.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they denied him) they rejected his message, (and the dreadful earthquake took them) as a punishment, (and morning found them prostrate in their dwelling-place) and morning found them dead in their compound, without any movement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعوا مقالتهم { فَكَذَّبُوهُ } فجاءوا بتكذيبه بلا مبالاة له وبكلامه فاستحقوا المقت العظيم { فَأَخَذَتْهُمُ ٱلرَّجْفَةُ } أي: الزلزلة الشديدة مع الصيحة الهائلة { فَأَصْبَحُواْ فِي دَارِهِمْ } التي بنوها للحياة والمعاش { جَاثِمِينَ } [العنكبوت: 37] مائتين هالكين باركين على ركبهم\n ساقطين على وجوههم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { و } أرسلنا { إلى مدينَ أخاهم شعيباً فقال يا قوم اعبدوا الله } وحده، { وارجُوا اليومَ الآخر } أي: خافوه، واعملوا ما ترجون به الثواب فيه، { ولا تعثوا في الأرض مفسدين } قاصدين الفساد، { فكذّبوه فأخذتهم الرجفةُ } الزلزلة الشديدة، أو: الصيحة من جبريل عليه السلام لأن القلوب رجفت بها، { فأصبحوا في دارهم } بلدهم وأرضهم، { جاثمين } باركين على الرُكب ميتين\n الإشارة: العبادة مع الغفلة عن العواقب الغيبية المستقبلة، لا جدوى لها، كأنها عادة، وخوف العواقب، من غير استعداد لها، خذلان، والاجتهاد في العمل، مع ارتقاب العواقب الغيبية، فلاح، من شأن أهل البصائر، كما قال تعالى في حق من مدحهم من أكابر الرسل:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:78",
      "similarity": 0.9950428171854234
    },
    {
      "verse": "7:91",
      "similarity": 0.9950428171854234
    },
    {
      "verse": "11:67",
      "similarity": 0.6846530228529318
    },
    {
      "verse": "11:94",
      "similarity": 0.5736617698825165
    },
    {
      "verse": "79:6",
      "similarity": 0.5302013902292334
    }
  ]
}