{
  "chapter": "العنكبوت",
  "text": "ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا۟ وليعلمن الكذبين",
  "translations": [
    {
      "translation": "We tested those before them so that Allah would know the truthful and would know the liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had tried those who were before them so that God knew who spoke the truth, and who were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for We indeed tested those who went before them? Allah will most certainly ascertain those who spoke the truth and those who lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had certainly tried those who lived before them to make sure who were truthful in their faith and who were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed tested those before them – so Allah will surely test the truthful, and will surely test the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed tested those who were before them so that Allah will indeed know those who are true, and He will know those who are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We tried those before them, so Allah will certainly know those who are true and He will certainly know the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly tried those that were before them, and assuredly God knows those who speak truly, and assuredly He knows the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We tested those who were before you. Thus Allah knoweth those who are sincere, and knoweth those who feign.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly tried those who have gone before them, so God will certainly distinguish between those who are truthful and those who are lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have tempted those who were before them. So Allah will surely know those who are true and He will surely know the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We tested those who were before them. So Allah shall surely ascertain those who are truthful, and He shall surely ascertain the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did test those before them, and Allah will certainly know those who are true from those who are false.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed tested those who were before them. And Allah will certainly make (it) known (the truth of) those who are true, and will certainly make (it) known (the falsehood of) those who are liars, (although Allah knows all that before putting them to test).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tried those who have gone before them. Allah knows those who are truthful and those who lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tested those before them. God will surely know the truthful, and He will surely know the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We have certainly tried those before them, and Allah will surely make evident those who are truthful, and He will surely make evident the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:3] And certainly We tried those who were before them. So God shall surely know those who are sincere, in their faith — a knowledge of direct vision — and He shall surely know those who are liars, regarding it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We tested those who were before you) before the Companions of Muhammad (pbuh) after the demise of their prophets, with caprice, blameworthy innovations and the violation of sanctities. (Thus Allah knoweth) in order that Allah sees and distinguishes (those who are sincere) in their faith by avoiding caprice, blameworthy innovation and by shunning that which is unlawful, (and knoweth those who feign) i.e. the insincere in their faith who follow caprice, blameworthy innovation and the violation of sanctities.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ فَتَنَّا } معناه بَلونَا\n\n\n\n\nوقوله تعالى: { فَلَيَعْلَمَنَّ ٱللَّهُ ٱلَّذِينَ صَدَقُواْ } معناه فليَمْيِزَنَ\n لأَنَّ الله عزّ وجلّ قَد عَلَّمَ الأَشياءَ كُلَّها قَبلَ أوان كَونِها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd indeed, We have put them to the test.\n\nAnd His saying - the Most High: {So let Allah know those who are true} its meaning is \"So let Allah distinguish those who are true\"\n\n\nBecause Allah, the Most High and Glorious, has taught us all things before they come into existence.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولقد فتّنا الذين من قبلهم } من أهل الاستبصار والاستعداد بأنواع المصائب والمحن والرياضات والفتن\n حتى يتميز الصادق في الطلب\n القابل للكمال بظهور كماله من الكاذب المهوّس الضعيف الاستعداد\n { من كان يرجو لقاء الله } في أحد المواطن سواء كان موطن الثواب والآثار أو موطن الأفعال أو موطن الأخلاق أو موطن الصفات أو موطن الذات { فإن أجل الله } في إحدى المقامات الثلاثة { لآت } أي: فليتيقن وقوع اللقاء بحسب حاله ورجائه عند الأجل المعلوم\n وليعمل الحسنات ليجد الكرامة في جنة النفس من باب الآثار والأفعال عند الموت الطبيعي\n أو ليجتهد في المحو بالرياضات والمراقبات ليشاهد في جنة القلب من تجليات الصفات ومقامات الأخلاق ما يشتهيه ويدّعيه عند الموت الإرادي\n أو ليجاهد في الله حقّ جهاده بالفناء فيه ليجد روح الشهود وذوق الجمال في جنة الروح عند الموت الأكبر والطامّة الكبرى\n { ومن جاهد } في أي مقام كان لأيّ موطن أراد { فإنما يجاهد لنفسه }\n { والذين آمنوا } كل واحد من أنواع الإيمان المذكورة { وعملوا الصالحات } بحسب إيمانهم { لنكفرنّ عنهم } سيئات أعمالهم وأخلاقهم\n أو صفاتهم أو ذواتهم بأنوار ذاته { ولنجزينّهم أحسن الذي كانوا يعملون } من أعمالنا الصادرة عن صفاتنا بدل أعمالهم\n { ووصينا الإنسان } إلى آخره\n جعل أول مكارم الأخلاق إحسان الوالدين إذ هم مظهرا صفتي الإيجاد والربوبية\n فكان حقّهما يلي حقّ الله بقرن طاعتهما بطاعته لأن العدل ظلّ التوحيد\n فمن وحّد الله لزمه العدل وأول العدل مراعاة حقوقهما لأنهما أولى الناس\n فوجب تقديم حقوقهما على حق كل أحد إلا على حقه تعالى\n ولهذا أوجبت طاعتهما في كل شيء إلا في الشرك بالله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { لَقَدْ فَتَنَّا } وامتحنا { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } من الأمم السالفة\n مع أنهم يدعون الإيمان\n ويتفوهون ويتقوهون به أمثالهم\n ومع ذلك لم نتركهم بلا ابتلاء واختبار\n وليس اختبارهم وامتحانهم إلا لإظهار حجتا البالغة عليهم\n وإلاَّ { فَلَيَعْلَمَنَّ ٱللَّهُ } المطلع على ضمائر عباده وسرائرهم { ٱلَّذِينَ صَدَقُواْ } منهم\n وأخلصوا في إيمانهم { وَلَيَعْلَمَنَّ ٱلْكَاذِبِينَ } [العنكبوت: 3] أيضاً منهم\n\n\nوهم الذين لا يخلصون مع الله في حالٍ من الأحوال\n وعملٍ من الأعمال\n ولا يسمعون أوامر الله ونواهيه من ألسنة رسله سمع قبولٍ ورضا\n وإنما أرادوا بإيمانهم الظاهر الذي أتوا به على سبيل الكراهة إسقاط لوازم الكفر من حقن الدماء\n وسلب الذراري ونهب الأموال\n وإلا فهم ليسوا ممن يذعنون بدلائل التوحيد وبراهين الإيمان عن صميم قلوبهم\n ظناً أنَّا غافلون عن بواطنهم ونياتهم\n\n\n{ أَمْ حَسِبَ } أي: بل ظن المسرفون { ٱلَّذِينَ يَعْمَلُونَ ٱلسَّيِّئَاتِ } مصرين عليها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحق جل جلاله: { الم }: الألف: لوحدة أسرار الجبروت\n واللام: لفيضان أنوار الملكوت\n والميم: لاتصال المادة بعالم الملك\n فكأنه تعالى أقسم بوحدة جبروته وأنوار ملكوته واتصال مادته بملكه وخليقته\n أنه لا يدع دعوة مدع إلا ويختبره ليظهر صدقه أو كذبه\n وهذا معنى قوله: { أحَسِبَ الناسُ } أي: أظن الناس { أن يُتركوا } غير - مفتونين ومختَبَرِين\n { أن يقولوا آمنَّا وهم لا يُفتنون } أظنوا أن يَدَّعوا الإيمان ولا يُختبرون عليه ليظهر الصادق من الكاذب\n بل يمتحنهم الله بمشاق التكليف من مفارقة الأوطان\n ومجاهدة الأعداء\n ورفض الشهوات\n ووظائف الطاعات\n وبالفقر\n والقحط\n وأنواع المصائب في الأموال والأنفس\n وإذاية الخلق ليتميز المخلص من المنافق\n والثابت في الدين من المضطرب فيه\n ولينالوا بالصبر على ذلك عوالي الدرجات\n فإن مجرد الإيمان\n وإن كان على خلوص قلب\n لا يقتضي غير الخلاص من الخلود في العذاب\n وما ينال العبدَ من المكاره يسمو به إلى أعلى الدرجات وأعظم المقامات\n مع ما في ذلك من تصفية النفس وتهذيبها\n لتتهيأ لإشراق أنوار مقام الإحسان\n رُوي أنها نزلت في ناس من أصحاب رسول الله صلى الله عليه وسلم\n قد جزعوا من أذى المشركين\n وضاقت صدورهم من ذلك\n وربما استنكر بعضهم أن يُمكِّن اللهُ الكفرةَ من المؤمنين\n فزلت مُسلِّية ومعِلْمة أن هذه هي سيرة الله في عباده اختباراً لهم\n قال تعالى: { ولقد فتنَّا الذين مِنْ قبلهم } بأنواع المحن فمنهم من كان يُوضع المناشر على رأسه\n فَيُفْرَقُ فرقتين\n وما يصرفه ذلك عن دينه\n ومنهم من كان يمشط بأمشاط الحديد\n ومنهم من كان يُطرح في النار\n وما يصده ذلك عن دينه\n { فليعْلَمَنَّ اللهُ } بذلك الامتحان { الذين صَدَقُوا } في الإيمان بالثبات\n { وليعلمنَّ الكاذبين } بالرجوع عنه\n ومعنى علمه تعالى به\n أي: علم ظهور وتمييز\n والمعنى: ولَيُمَيِّزَنَّ الصادق منهم من الكاذب\n في الدنيا والآخرة\n قال ابن عطاء: يَتَبَيَّن صدق العبد من كذبه في أوقات الرخاء والبلاء\n فمن شكر في أيام الرخاء\n وصبر في أيام البلاء\n فهو من الصادقين\n ومن بطر في أيام الدنيا\n وجزع في أيام البلاء\n فهو من الكاذبين\n هـ\n الإشارة: سُنَّة الله تعالى في أوليائه: أن يمتحنهم في البدايات\n فإذا تمكنوا من معرفة الله\n وكمل تهذيبهم\n أعزهم ونصرهم\n وأظهرهم لعباده\n ومنهم من يتركهم تحت أستار الخمول\n حتى يلقوه على ذلك وهم عرائس الملكوت\n ضنَّ بهم أن يظهرهم لخلقه\n\nوالامتحان يكون على قدر المقام\n وفي الحديث:\n \" أشدُّ الناسِ بلاءً: الأنبياء\n ثم الأمْثَلُ فالأمثلُ\n يُبْتَلَى الرجلُ على قدر ديِنهِ\n فإن كان في دينه صُلْباً اشتد بلاؤُهُ وإن كان في دينِه رقَّةٌ ابتلى على قَدرِ دينِه فما يبرحُ البلاءُ بالعبدِ حتى يَتْرُكَهُ يَمْشِي على الأرْضِ وما عليه مِنْ خَطِيئة \"\n \nوقال صلى الله عليه وسلم:\n \" أشدُّ الناسِِ بلاءً في الدنيا: نبي أو صفي \" \nوقال صلى الله عليه وسلم:\n \" أشدُّ الناس بلاءً: الأنبياءُ\n ثم الصالحون\n لقد كان أحدهم يُبْتَلى بالفقر\n حتى ما يَجَدَ إلا العباءَةَ يُحَوِّيهَا فيلبسها\n ويُبْتَلى بالقَمَلِ حتى يَقْتُلَهُ ولأَحَدُهُمْ كان أشدَّ فرحاً بالبلاء من أحَدِكُم بالعطاء \" \nمن الجامع\n والله تعالى أعلم\n ثم ذكر المؤذين لهم\n فقال: { أَمْ حَسِبَ ٱلَّذِينَ يَعْمَلُونَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:6",
      "similarity": 0.5499938301951455
    },
    {
      "verse": "37:162",
      "similarity": 0.547736768501451
    },
    {
      "verse": "37:63",
      "similarity": 0.5185393959498679
    },
    {
      "verse": "51:13",
      "similarity": 0.49842505183730745
    },
    {
      "verse": "6:23",
      "similarity": 0.4427304023938752
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/29:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/29:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/29:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}