{
  "chapter": "العنكبوت",
  "text": "ولما ان جاءت رسلنا لوطا سىء بهم وضاق بهم ذرعا وقالوا۟ لا تخف ولا تحزن انا منجوك واهلك الا امراتك كانت من الغبرين",
  "translations": [
    {
      "translation": "When Our Messengers came to Lut, he was distressed on their account, feeling incapable of protecting them. They said, 'Do not fear and do not grieve. We are going to rescue you and your family - except for your wife; she will be one of those who stay behind.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when Our messengers came to Lot, he was worried on their account as he was unable to protect them. They said: \"Have no fear or regret. We will certainly save you and your family except your wife, for she is one of those who will stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our emissaries came to Lot he was distressed and embarrassed on their account. They said: “Do not fear nor be distressed. We shall save you and all your household except your wife who is among those that will stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our angelic Messengers came to Lot, he was grieved and depressed to see them. They told him, \"Do not be afraid or grieved. We will rescue you and your family except your wife who will remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our sent angels came to Lut, he was unhappy at their arrival and was depressed – and they said, “Do not fear or grieve; we will surely rescue you and your family, except your wife, who is of those who will stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our messengers came to Lut, he was grieved because of them, and felt straitened on their account. They said: \"Have no fear, and do not grieve! Truly, we shall save you and your family except your wife: she will be of those who remain behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our apostles came to Lut he was grieved on account of them, and he felt powerless (to protect) them; and they said: Fear not, nor grieve; surely we will deliver you and your followers, except your wife; she shall be of those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When that Our messengers came to Lot he was troubled on their account and distressed for them; but they said, 'Fear not, neither sorrow, for surely we shall deliver thee and thy family, except thy wife; she has become of those that tarry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our messengers came unto Lot, he was troubled upon their account, for he could not protect them; but they said: Fear not, nor grieve! Lo! we are to deliver thee and thy household, (all) save thy wife, who is of those who stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our messengers came to Lot, he was troubled and distressed on their account. They said, \"Have no fear or grief. We shall certainly save you and your household, except your wife, who will be among those who stay behind,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our messengers came unto Lut, he was distressed on their account and felt straitened on their account. And they said: fear not, nor grieve: verily we are to deliver thee and thy household, save thy wife: she is to be of the lingerers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our messengers came to Lot, he was distressed on their account and in a predicament for their sake. But they said, ‘Do not be afraid, nor grieve! We shall deliver you and your family, except your wife: she will be one of those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Messengers came to Lut, he was grieved on their account, and felt himself powerless (to protect) them: but they said: \"Fear thou not, nor grieve: we are (here) to save thee and thy following, except thy wife: she is of those who lag behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Messengers came to Lout (Lot), he was grieved because of them, and felt straitened on their account. They said: \"Have no fear, and do not grieve! Truly, we shall save you and your family, except your wife, she will be of those who remain behind (i.e. she will be destroyed along with those who will be destroyed from her folk).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Messengers came to Lot, he was troubled and distressed on their account. But they said: 'Have no fear, and do not be sad. Surely, we will save you and your family except your wife, she has become of those that shall remain behind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when Our envoys came to Lot, they were mistreated, and he was troubled and distressed on their account. They said, “Do not fear, nor grieve. We will save you and your family, except for your wife, who will remain behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our messengers came to Lot, he was distressed for them and felt for them great discomfort. They said, \"Fear not, nor grieve. Indeed, we will save you and your family, except your wife; she is to be of those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:33] And when Our messengers came to Lot, he was distressed on their account, he was grieved because of them, and he was constrained [unable] to help them, because they had handsome faces, dressed as guests, and thus he feared for them from his people. So they informed him that they were the messengers of his Lord. But they said, ‘Do not be afraid, nor grieve. We shall surely deliver you (read munajjūka or munjūka) and your family, except your wife: she is of those who will remain behind (ahlaka, ‘your family’, is in the accusative as a supplement to the [suffixed direct object pronoun] kāf [of munajjūka, ‘We shall surely deliver you’]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our messengers) Gabriel and the angels who were with him (came unto Lot, he was troubled upon their account) he disliked their coming, (for he could not protect them) from the abominable act of his people; (but they) Gabriel and the angels (said: Fear not) for us, (nor grieve) about us, for fear of our peril! (Lo! we are to deliver you) from your people (and your household) and your two daughters, ((all) save your wife) the hypocrite, (who is of those who stay behind) and be destroyed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فهم مشغوفون بطلب أمثالهم { وَ } لما تفرس الرسل منه الخوف والحزن والضجرة وأنواع الغموم والهموم العارضة لهم من إلمامهم إياه { قَالُواْ } له تفريجاً لهمه: { لاَ تَخَفْ } يا لوط إضرارهم بنا { وَلاَ تَحْزَنْ } من لحوق العار عليك بسببنا\n لأنا رسل ربك\n أرسلنا الله لنصرك وتأييدك وإنزال العذاب على قومك\n ولا تحزن أيضاً تعذيبنا لك ولمن تبعك { إِنَّا } بأمر ربنا { مُنَجُّوكَ وَأَهْلَكَ } مما يصيبهم من العذاب والهلاك { إِلاَّ ٱمْرَأَتَكَ كَانَتْ مِنَ ٱلْغَابِرينَ } [العنكبوت: 33] الهالكين\n هكذا ثب تفي حضرة علم الله ولوح قضائه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وضاق بهم ذَرْعاً } أي: ضاق بشأنهم وتدبير أمرهم ذرعُه وطاقته\n وقد جعلوا ضيقَ الذرعِ والذراع عبارةً عن فقد الطاقة\n كما قالوا: رحْب الذراع\n إذا كان مُطيقاً للأمور\n والأصلَ فيه: إن الرجل إذا طالت ذراعه نال مالا يناله القصير\n فاستعير للطاقة والقوة وعدمها\n { وقالوا } \n لمّا رأوا فيه أثر الضجر والخوف: { لا تخفْ ولا تحزنْ } على تمكنهم منا\n { إنا منجُّوكَ وأهلَكَ } أي: وننجي أهلك\n فالكاف في محل الجر\n و \" أهلك \": نصب بفعل محذوف\n { إلا إمرأتكَ كانت من الغابرين }\n في الكلام حذف يدل عليه ما في هود\n أي: لا تخف ولا تحزن من أجلنا\n إنهم لن يصلوا إليك ونحن عندك\n بل يهلكون جميعاً\n وأما أنت فإنا منجوك\n\n\n إلخ لأن خوفه إنما كان عليهم لا على نفسه\n أو يقدر: إنا منجوك وأهلك بعد هلاكهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:77",
      "similarity": 0.6519612808520436
    },
    {
      "verse": "29:32",
      "similarity": 0.5221877494149579
    },
    {
      "verse": "7:83",
      "similarity": 0.45356360876352775
    },
    {
      "verse": "27:57",
      "similarity": 0.4471394262042527
    },
    {
      "verse": "15:60",
      "similarity": 0.4039156184647229
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/29:33.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/29:33.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}