{
  "chapter": "العنكبوت",
  "text": "وعادا وثمودا۟ وقد تبين لكم من مسكنهم وزين لهم الشيطن اعملهم فصدهم عن السبيل وكانوا۟ مستبصرين",
  "translations": [
    {
      "translation": "And 'Ad and Thamud - it must be clear to you from their dwelling places! Shaytan made their actions seem good to them and so debarred them from the Way, even though they were intelligent people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) 'Ad and Thamud. It will be clear to you from their habitations (how they were destroyed), for Satan had made their deeds look attractive to them, and turned them away from the path; and yet they were a people of acumen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We destroyed Ad and Thamud, whose dwellings you have observed. Satan had embellished their deeds for them and had turned them away from the Right Path although they were a people of clear perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How the people of Ad and Thamud were destroyed is evident to you from their homes. Satan made their deeds seem attractive to them and prevented them from the right path, even though they had visions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We destroyed the A’ad and the Thamud, and you already know their dwellings; Satan made their deeds appear good to them and prevented them from the path, whereas they could perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And `Ad and Thamud! And indeed (their destruction) is clearly apparent to you from their (ruined) dwellings. Shaytan made their deeds fair seeming to them, and turned them away from the path, though they were intelligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We destroyed) Ad and Samood, and from their dwellings (this) is apparent to you indeed; and the Shaitan made their deeds fair-seeming to them, so he kept them back from the path, though they were endowed with intelligence and skill,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ad, and Thamood -- it has become clear to you from their dwelling-places; and Satan decked out fair to them their works, and barred them from the way, though they saw clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (the tribes of) A'ad and Thamud! (Their fate) is manifest unto you from their (ruined and deserted) dwellings. Satan made their deeds seem fair unto them and so debarred them from the Way, though they were keen observers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The same happened to the tribes of 'Ad and Thamud: this must be clear to you from their ruins. Satan made their actions seem good to them, and turned them away from the straight path, even though they were intelligent people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the 'Aad and Thamud and of a surety their destruction is apparent unto you from their dwellings. The Satan made fairseeming their works unto them, and so kept them off from the path, while they were endued with sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ‘Ad and Thamud, [whose fate] is evident to you from their habitations. Satan made their deeds seem decorous to them, thus he barred them from the way [of Allah], though they used to be perceptive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember also) the 'Ad and the Thamud (people): clearly will appear to you from (the traces) of their buildings (their fate): the Evil One made their deeds alluring to them, and kept them back from the Path, though they were gifted with intelligence and skill.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And 'Ad and Thamud (people)! And indeed (their destruction) is clearly apparent to you from their (ruined) dwellings. Shaitan (Satan) made their deeds fair-seeming to them, and turned them away from the (Right) Path, though they were intelligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aad and Thamood, it has become clear to you from their dwellings; satan made their works seem fair to them and barred them from the Path, although they saw clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Aad and Thamood. It has become clear to you from their dwellings. Satan embellished for them their deeds, barring them from the path, even though they could see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We destroyed] 'Aad and Thamud, and it has become clear to you from their [ruined] dwellings. And Satan had made pleasing to them their deeds and averted them from the path, and they were endowed with perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:38] And, We destroyed, ‘Ād, and Thamūd (may be fully declined, or not [as diptotes], denoting both the district or the tribe [respectively])— it is indeed evident to you, their destruction, from their [former] dwellings, in al-Hijr and in Yemen. For Satan adorned for them their deeds, of disbelief and disobedience, and thus barred them from the Way, the way of truth, though they had been discerning, perceptive people.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (the tribes of) 'Aad) We destroyed the people of Hud (and Thamud) and We destroyed the people of Salih! ((Their fate) is manifest unto you) people of Mecca (from their (ruined and deserted) dwellings. Satan made their deeds seem fair unto them) in their state of idolatry, hardship and comfort (and so debarred them from the Way) the Truth and guidance, (though they were keen observers) they thought they followed the Truth when they did not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { عَاداً } المبالغين في الظلم والعدوان { وَثَمُودَاْ } المتجاوزين عن مقتضى حدود الله بالبغي والطغيان { وَقَد تَّبَيَّنَ لَكُم } وظهر عندكم ولاح عليكم أيها الناظرون المعتبرون عتوهم واستكبارهم { مِّن مَّسَاكِنِهِمْ } الرفيعة وحصونهم الحصينة المنيعة { وَ } ذلك بأنهم قوم { زَيَّنَ لَهُمُ ٱلشَّيْطَانُ أَعْمَالَهُمْ } وحسنها في نفوسهم فاستبدوا بها { فَصَدَّهُمْ عَنِ ٱلسَّبِيلِ } أي: أعرضهم الشيطان بتزيين أعمالهم الفاسدة عن الصراط المستقيم والطريق المستبين { وَ } هم { كَانُواْ مُسْتَبْصِرِينَ } [العنكبوت: 38] متمكنين\n قادرين على الاستبصار والاعتبار\n فلم يعتبروا\n إذ لم يُسلب عنهم لوازم عقولهم\n بل لبَّس عليهم الشيطان أفعالهم وحسن عندهم أعمالهم\n فظنوا أنهم مهتدون وما كانوا مهتدين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وعاداً وثمودَا } أي: اذكر عاداً وثموداً\n أو أهلكنا عاداً\n وثموداً يدل عليه { فأخذتهم الرجفة } لأنه في معنى الإهلاك\n { وقد تبيَّنَ لكم } ما وصفنا من إهلاكهم { من مساكنهم } الدارسة\n أو تبين لكم بعض مساكنهم الخربة إذا مررتم بها خالية\n { وزيَّنَ لهم الشيطانُ أعمالهم } من الكفر والمعاصي\n { فصدَّهم عن السبيل } عن الطريق الذي أُمروا بسلوكه\n وهو الإيمان بالله ورسوله\n { وكانوا مستبصرين } متمكنين من النظر والاستبصار وتميز الحق من الباطل ولكنهم لم يفعلوا\n أو عارفين الحق من الباطل بظهور دلائله\n لكنهم عاندوا\n حسداً\n يقال: استبصر: إذا عرف الشيء على حقيقته\n أو: متيقنين أن العذاب لاحق بهم بإخبار الرسول\n لكنهم لجّوا\n أو: مستبصرين في ضلالتهم معجبين بها\n وقال الفراء: عقلاء ذوو بصائر\n يعني: علماء في أمور الدنيا\n كقوله:\n[الروم: 7] الآية\n وقال مجاهد: حسبوا أنهم على الحق\n وهم على الباطل\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:24",
      "similarity": 0.49157017082381993
    },
    {
      "verse": "22:42",
      "similarity": 0.47940775372440964
    },
    {
      "verse": "26:141",
      "similarity": 0.39169595228920423
    },
    {
      "verse": "54:23",
      "similarity": 0.37898584265630597
    },
    {
      "verse": "85:18",
      "similarity": 0.375605393026232
    }
  ]
}