{
  "chapter": "العنكبوت",
  "text": "انا منزلون على اهل هذه القرية رجزا من السماء بما كانوا۟ يفسقون",
  "translations": [
    {
      "translation": "We have to bring a scourge from the heavens on the people of this city as they are depraved.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall bring down upon the people of this city a scourge from the heaven because of their evildoing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will bring torment from the sky on this town because of the evil-deeds of its inhabitants\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We will indeed cause a punishment from the sky to descend upon the inhabitants of this town – the recompense of their disobedience.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, we are about to bring down on the people of this town a great torment from the sky, because they have been rebellious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We will cause to come down upon the people of this town a punishment from heaven, because they transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall send down upon the people of this city wrath out of heaven for their ungodliness.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We are about to bring down upon the folk of this township a fury from the sky because they are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are surely going to bring down a punishment from heaven on the people of this town because of their depravities.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily we are about to bring down upon the inhabitants of this city a scourge from the heaven, for they have been transgressing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are indeed going to bring down upon the people of this town a punishment from the sky because of the transgressions they used to commit.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For we are going to bring down on the people of this township a Punishment from heaven, because they have been wickedly rebellious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, we are about to bring down on the people of this town a great torment from the sky, because they have been rebellious (against Allah's Command).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall send down anger out of heaven upon the people of this city because they are debauchers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We will bring down upon the people of this town a scourge from heaven, because of their wickedness.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, we will bring down on the people of this city punishment from the sky because they have been defiantly disobedient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:34] We are indeed going to bring down (read munzilūna or munazzilūna) upon the people of this town a scourge, a chastisement, from the heaven because of, on account of the acts of, their immorality’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "451 (Lo! we are about to bring down upon folk of this township a fury) a torment (from the sky) hurling upon them stones (because they are evil-livers) because they are disbelievers and transgressors.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم فصلوا له العذاب وقالوا: { إِنَّا مُنزِلُونَ عَلَىٰ أَهْلِ هَـٰذِهِ ٱلْقَرْيَةِ رِجْزاً مِّنَ ٱلسَّمَآءِ } أي: عذاباً ذا رجز؛ أي: قلقاً واضطراباً يقلق المضطرب المعذب، ويضطربه اضطراباً شديداً حين نزوله { بِمَا كَانُواْ يَفْسُقُونَ } [العنكبوت: 34] اي: بفسقهم الذي باهوا به وتمادوا فيه مجاهرين مصرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قالوا: { إنا منزلون على أهلِ هذه القرية رِجْزاً } عذاباً { من السماء بما كانوا يَفْسُقُون } بسبب فسقهم",
      "translations": []
    }
  ]
}