{
  "chapter": "العنكبوت",
  "text": "وقرون وفرعون وهمن ولقد جاءهم موسى بالبينت فاستكبروا۟ فى الارض وما كانوا۟ سبقين",
  "translations": [
    {
      "translation": "And Qarun and Pharaoh and Haman - Musa came with the Clear Signs to them, but they were arrogant on the earth. They could not outstrip Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) Qarun, Pharaoh and Haman to whom Moses came with clear signs; but they were haughty (and oppressed) the land. Yet they could not run away from Us;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We destroyed Qarun (Korah) and Pharaoh and Haman. Moses came to them with Clear Signs but they waxed arrogant in the land although they could not have outstripped (Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Korah, the Pharaoh, and Haman were also destroyed. Moses had brought them illustrious miracles, but they were puffed-up with pride in the land and they could not defeat Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We destroyed) Qaroon, Firaun and Haman; and indeed Moosa came to them with clear signs, so they were arrogant in the land, and they could never escape from Our control.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Qarun, Fir`awn, and Haman. And indeed Musa came to them with clear Ayat, but they were arrogant in the land, yet they could not outstrip Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We destroyed) Qaroun and Firon and Haman; and certainly Musa came to them with clear arguments, but they behaved haughtily in the land; yet they could not outstrip (Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Korah, and Pharaoh, and Haman; Moses came to them with the clear signs, but they waxed proud in the earth, yet they outstripped Us not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Korah, Pharaoh and Haman! Moses came unto them with clear proofs (of Allah's Sovereignty), but they were boastful in the land. And they were not winners (in the race).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Korah, Pharaoh, and Haman: Moses came to them with clear signs but they were arrogant in the land. They could not escape Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Qarun and Fir'awn and Haman! And assuredly Musa came unto them with the evidences, yet they were stiff-necked in the land. And they could not outstrip Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Korah, Pharaoh, and Haman. Certainly, Moses brought them manifest proofs, but they acted arrogantly in the land; though they could not outmaneuver [Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember also) Qarun, Pharaoh, and Haman: there came to them Moses with Clear Signs, but they behaved with insolence on the earth; yet they could not overreach (Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We destroyed also) Qarun (Korah), Fir'aun (Pharaoh), and Haman. And indeed Musa (Moses) came to them with clear Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), but they were arrogant in the land, yet they could not outstrip Us (escape Our punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Korah, Pharaoh, and Haman Moses came to them with clear signs, but they became very insolent in the earth, yet they did not outstrip Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Quaroon, and Pharaoh, and Hamaan—Moses went to them with clear arguments, but they acted arrogantly in the land. And they could not get ahead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We destroyed] Qarun and Pharaoh and Haman. And Moses had already come to them with clear evidences, and they were arrogant in the land, but they were not outrunners [of Our punishment].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:39] And, We destroyed, Korah, and Pharaoh, and Hāmān! And verily Moses brought them, beforehand, clear signs, manifest proofs, but they acted arrogantly in the land; and they could not thwart Us, they could not elude Our chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Korah) We destroyed Korah, (Pharaoh and Haman) Pharaoh's aid! (Moses came unto them with clear proofs) with commands, prohibitions and signs, (but they were boastful in the land) they were too proud to accept faith and they rejected the signs. (And they were not winners) they did not escape from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { قَارُونَ } المباهي بالمال والنسب على أهل عصره وزمانه { وَفِرْعَوْنَ } المستعلي بالسلطنة والملك إلى أن تفوه من غاية عتوه واستكباره بدعوى الألوهية لنفسه { وَهَامَانَ } وزيره\n قد تفوق على أقرانه وأهل زمانه بالثروة والجاه والنيابة الكاملة وعلو المكانة والمنزلة بين الأنام { وَ } من كمال تعنت هؤلاء المفسدين المسرفين واستعلائهم { لَقَدْ جَآءَهُمْ مُّوسَىٰ } بوحينا رسولاً منا\n ليهديهم إلى طريق الحق وصراط مستقيم\n فكذبوه ولم يبالوا به وبكلامه مع كونه مؤيداً { بِٱلْبَيِّنَاتِ } القاطعة والمعجزات الساطعة { فَٱسْتَكْبَرُواْ فِي ٱلأَرْضِ } على الله وعلى رسله وعموم عباده وانصرفوا عن مطلق أوامره ونواهيه منكرين وجوده وإرساله ووحيه عناداً ومكابرة { وَ } مع ذلك { مَا كَانُواْ سَابِقِينَ } [العنكبوت: 39] بنا\n حافظين نفوسهم عن إدراك عذابنا إياهم وانتقامنا منهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقارونَ وفرعونَ وهامان }: أي: أهلكناهم\n { ولقد جاءهم موسى بالبينات فاستكبروا في الأرض وما كانوا سابقين } فائتين\n بل أدركهم أمر الله فلم يفوتوه\n يقال: سبق طالبه: فاته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:24",
      "similarity": 0.9153436715550604
    },
    {
      "verse": "28:79",
      "similarity": 0.4860107055046887
    },
    {
      "verse": "28:6",
      "similarity": 0.44913469798142636
    },
    {
      "verse": "40:36",
      "similarity": 0.3209516803279239
    },
    {
      "verse": "28:38",
      "similarity": 0.28937832792853735
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/29:39.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/29:39.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/29:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}