{
  "chapter": "العنكبوت",
  "text": "قال ان فيها لوطا قالوا۟ نحن اعلم بمن فيها لننجينه واهله الا امراته كانت من الغبرين",
  "translations": [
    {
      "translation": "He said, 'Lut is in it.' They said, 'We know very well who is in it. We are going to rescue him and his family - except for his wife. She will be one of those who stay behind.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Surely Lot is there.\" They answered: \"We know who is there. We are to save him and his family except his wife, for she is one of those who will stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said: “But Lot is there.” They replied: “We are well aware of those who are there. We shall save him and all his household except his wife.” His wife is among those who will stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said, \"Lot is there in that town!\" They said, \"We know everyone there. We shall certainly save him and his family except his wife who will remain behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Lut is in it!”; they said, “We know very well who all are there; we shall rescue him and his family, except his wife; she is of those who will stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim said: \"But there is Lut in it.\" They said: \"We know better who is there. We will verily, save him and his family - except his wife, she will be of those who remain behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Surely in it is Lut. They said: We know well who is in it; we shall certainly deliver him and his followers, except his wife; she shall be of those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Lot is in it.' They said, 'We know very well who is in it; assuredly We shall deliver him and his family, except his wife; she has become of those that tarry.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lo! Lot is there. They said: We are best aware of who is there. We are to deliver him and his household, all save his wife, who is of those who stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said, \"But, Lot lives here.\" They answered, \"We well know who lives here. We shall surely save him and his whole family, except his wife, who will be among those who stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: verily Lut is therein. They said: we know better who is therein: we are to deliver him and his household, save his wife; she is to be of the lingerers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Lot is in it.’ They said, ‘We know better those who are in it. We will surely deliver him and his family, except his wife: she shall be one of those who remain behind.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"But there is Lut there.\" They said: \"Well do we know who is there: we will certainly save him and his following,- except his wife: she is of those who lag behind!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim (Abraham) said: \"But there is Lout (Lot) in it.\" They said:\"We know better who is there, we will verily save him [Lout (Lot)] and his family, except his wife, she will be of those who remain behind (i.e. she will be destroyed along with those who will be destroyed from her folk).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Lot is in it' They replied: 'We know who are in it, we shall save him and his family, except his wife, she has become of those that shall remain behind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Yet Lot is in it.” They said, “We are well aware of who is in it. We will save him, and his family, except for his wife, who will remain behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Abraham] said, \"Indeed, within it is Lot.\" They said, \"We are more knowing of who is within it. We will surely save him and his family, except his wife. She is to be of those who remain behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:32] He, Abraham, said, ‘Lo! Lot is in it.’ They, namely, the messengers, said, ‘We know very well who is in it. Assuredly We shall deliver him (read la-nunjiyannahu or la-nunajjiyannahu) and his family, except his wife: she is of those who will stay behind’, [of those] who will remain behind in the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Abraham said: (Lo! Lot is there) so how could you destroy them, Gabriel? (They) i.e. Gabriel and the angels with him (said: We are best aware of who is there. We are to deliver him and his household) his daughters Za'ura and Raytha, (all save his wife) Wa'ilah the hypocrite, (who is of those who stay behind) and be destroyed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما سمع إبراهيم عليه السلام منهم ما سمع { قَالَ } مضطرباً قلقاً: { إِنَّ فِيهَا لُوطاً } من خُلص عباد الله { قَالُواْ نَحْنُ أَعْلَمُ } منك { بِمَن فِيهَا } بتعليم الله إيانا { لَنُنَجِّيَنَّهُ وَأَهْلَهُ } مما سيصيب قومه بأمر الله علينا بإنجائه، ومن معه من أهل بيته والمؤمنين له { إِلاَّ ٱمْرَأَتَهُ كَانَتْ مِنَ ٱلْغَابِرِينَ } [العنكبوت: 32] الهالكين لنفاذ قضاء الله على هلاكها فيهم؛ إذ هي من جملتهم ومن عدادهم وفي زمرتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } إبراهيم: { إن فيها لوطاً } أي: أتهلكونهم وفيهم من هو بريء من الظلم، أو: وفيهم نبي بين أظهرهم؟ { قالوا } أي: الملائكة: { نحن أعلمُ } منك { بمن فيها لننجيَّنه وأهله إلا امرأته كانت من الغابرين } الباقين في العذاب\n ثم أخبر عن مسير الملائكة إلى لوط بعد مفارقتهم إبراهيم، فقال: { ولما أن جاءتْ رُسُلُنَا لوطاً سِيء بهم } أي: ساءه مجيئُهم وغمه مخافة أن يقصدهم قومه بسوء\n و \" أن \": صلة لتأكيد الفعلين وترتيب أحدهما على الآخر كأنهما وُجِدا في جزء واحد من الزمان كأنه قيل: لمَّا أحس بمجيئهم فاجأته المساءة من غير ترتيب\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:83",
      "similarity": 0.8829692633672549
    },
    {
      "verse": "27:57",
      "similarity": 0.8627795513327947
    },
    {
      "verse": "15:60",
      "similarity": 0.8020547365727532
    },
    {
      "verse": "80:40",
      "similarity": 0.6778937125291126
    },
    {
      "verse": "26:171",
      "similarity": 0.6525971680157958
    }
  ]
}