{
  "chapter": "العنكبوت",
  "text": "والى مدين اخاهم شعيبا فقال يقوم اعبدوا۟ الله وارجوا۟ اليوم الءاخر ولا تعثوا۟ فى الارض مفسدين",
  "translations": [
    {
      "translation": "And to Madyan We sent their brother Shu'ayb. he said. 'My people, worship Allah and look to the Last Day and do not act unjustly on earth, corrupting it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Midian We sent their brother Shu'aib. He said: \"O people, worship God and be ready for the Day of Resurrection. Do no evil, and create no mischief in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent to Midian their brother Shuayb. He said: “My people, serve Allah and look forward to the Last Day and do not go about the earth committing mischief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to the people of Midian their brother Shu`ayb. He told them, \"Worship God. Have hope in the life to come. Do not spread evil in the land\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent towards Madyan, their fellowman Shuaib – he therefore said, “O my people! Worship Allah, and anticipate the Last Day, and do not roam the earth spreading turmoil.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan, We sent their brother Shu`ayb. He said: \"O my people! Worship Allah and hope for the last Day, and commit no mischief on the earth as mischief-makers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan (We sent) their brother Shuaib, so he said: O my people! serve Allah and fear the latter day and do not act corruptly in the land, making mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian their brother Shuaib; he said, 'O my people, serve God, and look you for the Last Day; and do not mischief in the land, working corruption.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Midian We sent Shu'eyb, their brother. He said: O my people! Serve Allah, and look forward to the Last Day, and do not evil, making mischief, in the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the people of Midian We sent their brother Shu'ayb. He said, \"My people, worship God, and look forward to the Last Day, and do not commit evil and spread corruption in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Madyan We sent their brother, Shu'aib. He said: my people! worship Allah, and fear the Last Day, and commit not evil on the earth as corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian We sent Shu‘ayb, their brother. He said, ‘O my people! Worship Allah, and expect [to encounter] the Last Day, and do not act wickedly on the earth causing corruption.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Madyan (people) (We sent) their brother Shu'aib. Then he said: \"O my people! serve Allah, and fear the Last Day: nor commit evil on the earth, with intent to do mischief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the people of) Madyan (Midian), We sent their brother Shu'aib (Shuaib). He said: \"O my people! Worship Allah, and hope for (the reward of good deeds by worshipping Allah Alone, on) the last Day, and commit no mischief on the earth as Mufsidun (those who commit great crimes, oppressors, tyrants, mischief-makers, corrupts).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian their brother Shu'aib. He said: 'Worship Allah, my nation. Look to the Last Day. Do not make mischief in the land, doing corrupt works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Median, their brother Shuaib. He said, “O my people, worship God and anticipate the Last Day, and do not spread corruption in the land.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan [We sent] their brother Shu'ayb, and he said, \"O my people, worship Allah and expect the Last Day and do not commit abuse on the earth, spreading corruption.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:36] And, We sent, to Midian, their brother Shu‘ayb. He said, ‘O my people! Worship God and anticipate the Last Day, fear it, namely, the Day of Resurrection; and do not be degenerate in the earth, working corruption’ (mufsidīna is a circumstantial qualifier, emphasising its operator [wa-lā ta‘thaw, ‘do not be degenerate’]; it [the verb] derives from ‘athiya, meaning afsada, ‘he corrupted’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto Midian We sent Shu'ayb, their brother) their Prophet. (He said: my people! Serve Allah) declare the divine Oneness of Allah, (and look forward to the Last Day) and fear the Day of Judgement, (and do not evil, making mischief, in the earth) do not engage in transgressions and corruption in the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱرْجُواْ ٱلْيَوْمَ ٱلأَخِرَ } معناه أَخشى يَومَ القِيامةِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Seek the Hereafter,\" means fearing the Day of Resurrection.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً { إِلَىٰ مَدْيَنَ } حين ظهر فيه الخيان في المكيلات والموزونات { أَخَاهُمْ شُعَيْباً } ليصلح ما فيهم من المفاسد { فَقَالَ } بعدما بعثناه إليهم منادياً لهم ليقبلوه ويطيعوا أمره: { يٰقَوْمِ } أضافهم إلى نفسه\n لكمال العطف والشفقة وإمحاض النصح { ٱعْبُدُواْ ٱللَّهَ } الواحد الأحد\n الحقيق بالعبادة والإطاعة { وَٱرْجُواْ } من الله { ٱلْيَوْمَ ٱلأَخِرَ } أي: ائتوا بالإيمان والإخلاص والعمل الصالح\n راجين من الله الثواب في يوم الجزاء { وَ } عليكم أن { لاَ تَعْثَوْاْ فِي ٱلأَرْضِ } ولا تتحركوا عليها حال كونكم { مُفْسِدِينَ } [العنكبوت: 36] لمصالح عباد الله وأمور معاشهم ومعادهم\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { و } أرسلنا { إلى مدينَ أخاهم شعيباً فقال يا قوم اعبدوا الله } وحده\n { وارجُوا اليومَ الآخر } أي: خافوه\n واعملوا ما ترجون به الثواب فيه\n { ولا تعثوا في الأرض مفسدين } قاصدين الفساد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:183",
      "similarity": 0.5610186322239133
    },
    {
      "verse": "11:85",
      "similarity": 0.46248413214481965
    },
    {
      "verse": "2:60",
      "similarity": 0.426844810293234
    },
    {
      "verse": "7:85",
      "similarity": 0.3960880605407764
    },
    {
      "verse": "26:177",
      "similarity": 0.37464391201539887
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/29:36.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/29:36.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}