{
  "chapter": "العنكبوت",
  "text": "ام حسب الذين يعملون السيـات ان يسبقونا ساء ما يحكمون",
  "translations": [
    {
      "translation": "Or do those who do bad actions imagine they can outstrip Us? How bad their judgement is!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who do evil think that they will get the better of Us? How bad is the judgement that they make!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the evil-doers suppose that they will get the better of Us? How evil is their judgement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the evil-doers think they can escape Us? How terrible is their judgment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they who commit evil deeds imagine that they can escape from Us? What an evil judgement they impose!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or think those who do evil deeds that they can outstrip Us Evil is that which they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they who work evil think that they will escape Us? Evil is it that they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they reckon, those who do evil deeds, that they will outstrip Us? Ill they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do those who do ill-deeds imagine that they can outstrip Us? Evil (for them) is that which they decide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who do evil imagine that they will escape Us? How ill they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or bethink those who work ill deeds that they shall outstrip Us? lll do they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who commit misdeeds suppose that they can outmaneuver Us? Evil is the judgement that they make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who practise evil think that they will get the better of Us? Evil is their judgment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or those who do evil deeds think that they can outstrip Us (i.e. escape Our Punishment)? Evil is that which they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do the evildoers think that they will outstrip Us? How evil is their judgment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do those who commit sins think they can fool Us? Terrible is their opinion!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do those who do evil deeds think they can outrun Us? Evil is what they judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:4] Or do those who commit evil deeds, idolatry and acts of disobedience, suppose that they can elude Us?, so that We will not be able to requite them. Evil is that, judgement of theirs, which they judge!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The following was revealed about Abu Jahl Ibn Hisham, al-Walid Ibn al-Mughirah and 'Utbah and Shaybah the sons of Rabi'ah who had duals with 'AN Ibn Abi Talib, may Allah be well pleased with him, Hamzah Ibn 'Abd al-Muttalib, the uncle of the Prophet (pbuh) and 'Ubaydah Ibn al-Harth Ibn 'Abd al-Muttalib on the Day of Badr; some of them boasted to others, and so Allah said: (Or do those who do ill deeds) in their state of associating partners with Allah (imagine that they can outstrip Us) that they will evade Our punishment: (Evil (for them) is that which they decide) evil is that which they judge and think for themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ حَسِبَ } أي: بل ظن المسرفون { ٱلَّذِينَ يَعْمَلُونَ ٱلسَّيِّئَاتِ } مصرين عليها، مبالغين في إتيانها { أَن يَسْبِقُونَا } ويفوتوا عنا جزاء ما عملوا، ويسقطوا عن حسابنا ما أتوا به من المعاصي، بل نحن مطلعون عليها حين كانوا في استعداداتهم قبل ظهورهم في فضاء الوجود، فكيف حين وجودهم وظهورهم، وصدور الآثام عنهم بالفعل؟! { سَآءَ مَا يَحْكُمُونَ } [العنكبوت: 4] علينا حكمهم وهذا ونسبتهم هذه - أعاذنا الله وعموم عباده عن أمثال هذه الظنون الفاسدة بالنسبة إليه سبحانه - كل ذلك عن جهلهم بالله ويمقتضى عزه وعلوه، وإنكارهم بلقائه والوقوف بين يديهز\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:27",
      "similarity": 0.6209042700701312
    },
    {
      "verse": "56:10",
      "similarity": 0.6166268386608225
    },
    {
      "verse": "79:4",
      "similarity": 0.6150356106167781
    },
    {
      "verse": "21:101",
      "similarity": 0.5442220826217096
    },
    {
      "verse": "56:60",
      "similarity": 0.5243016791133462
    }
  ]
}