{
  "chapter": "العنكبوت",
  "text": "وكذلك انزلنا اليك الكتب فالذين ءاتينهم الكتب يؤمنون به ومن هؤلاء من يؤمن به وما يجحد بـايتنا الا الكفرون",
  "translations": [
    {
      "translation": "Accordingly We have sent down the Book to you, and those to whom We gave the Book have iman in it, and some of these people have iman in it as well. Only the kafirun deny Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We have revealed this Book to you and those to whom We have sent down the Book will believe in it. Only those who are infidels will deny it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), thus have We bestowed the Book on you. So those on whom We had bestowed the Book before believe in it, and of these (Arabs) too a good many believe in it. It is none but the utter unbelievers who deny Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed the Book to you. Some of the People of the Book and some of the pagans also believe in it. No one rejects Our revelations except the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We sent down the Book to you O dear Prophet (Mohammed – peace and blessings be upon him); so those to whom We gave the Book believe in it; and some of these (polytheists) accept faith in it; and none except the disbelievers reject Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent down the Book to you, and those whom We gave the Scripture believe therein as also do some of these and none but the disbelievers reject Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We revealed the Book to you. So those whom We have given the Book believe in it, and of these there are those who believe in it, and none deny Our communications except the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so We have sent down to thee the Book. Those to whom We have given the Book believe in it; and some of these believe in it; and none denies Our signs but the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In like manner We have revealed unto thee the Scripture, and those unto whom We gave the Scripture aforetime will believe therein; and of these (also) there are some who believe therein. And none deny Our revelations save the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise We have sent down the Book to you. Those to whom We gave the scripture believe in it, and so do some of your own people. Only those who deny the truth reject Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise have We sent down unto thee the Book; so those to whom We have vouchsafed the Book believe therein, and of those also some believe therein. And none gainsay Our signs save the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent down the Book to you; those to whom We have given the Book believe in it, and of these there are some who believe in it, and none contests Our signs except the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus (it is) that We have sent down the Book to thee. So the People of the Book believe therein, as also do some of these (pagan Arabs): and none but Unbelievers reject our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent down the Book (i.e. this Quran) to you (O Muhammad SAW), and those whom We gave the Scripture [the Taurat (Torah) and the Injeel (Gospel) aforetime] believe therein as also do some of these (who are present with you now like 'Abdullah bin Salam) and none but the disbelievers reject Our Ayat [(proofs, signs, verses, lessons, etc., and deny Our Oneness of Lordship and Our Oneness of worship and Our Oneness of Our Names and Qualities: i.e. Islamic Monotheism)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such, We have sent down to you the Book. Those to whom We gave the Book believe in it, and so do some of these. None reject Our verses except the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, We revealed to you the Scripture. Those to whom We gave the Scripture believe in it, and some of these believe in it. None renounce Our communications except the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent down to you the Qur'an. And those to whom We [previously] gave the Scripture believe in it. And among these [people of Makkah] are those who believe in it. And none reject Our verses except the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:47] Thus have We revealed to you the Book, the Qur’ān, in the same way that We have revealed to them the Torah and other [scripture]. And so those to whom We have given the Scripture, the Torah, such as ‘Abd Allāh b. Salām and others, believe in it, in the Qur’ān, and of these, people of Mecca, there are some who believe in it; and none denies Our signs, after they have been manifested, except disbelievers, namely, the Jews, and those for whom it was apparent that the Qur’ān was the truth, and that the one who brought it was truthful but still denied it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In like manner We have revealed unto thee the Scripture) He says: thus We sent Gabriel to you with the Scripture so that you recite to them that which it contains of commands, prohibitions and similitudes, (and those unto whom We gave the Scripture aforetime) those to whom We gave the knowledge of the Torah, i.e. 'Abdullah Ibn Salam and his followers (will believe therein) in Muhammad (pbuh) and in the Qur'an; (and of these (also)) of the people of Mecca (there are some who believe therein) who believe in Muhammad (pbuh) and in the Qur'an. (And none deny our revelations) i.e. Muhammad (pbuh) and the Qur'an (save the disbelievers) Ka'b and his host and Abu Jahl and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ بل هو آيات بينات في صدور الذين أوتوا العلم } أي: القرآن علوم حقيقية ذوقية بيّنة\n محلها صدور العلماء المحققين\n وهي المعاني النازلة من غيب الغيوب إلى الصدر لا الألفاظ والحروف الواقعة على اللسان والذكر\n وما يجحد بها إلاّ الكافرون المحجوبون لعدم الاستعداد\n أو الظالمون الذين أبطلوا استعدادهم بالرذائل والوقوف مع الأضداد { وإنّ جهنم لمحيطة بالكافرين } المحجوبين عن الحق لكونهم مغمورين في الغواشي الطبيعية والحجب الهيولانية بحيث لم يبق فيهم فرجة إلى عالم النور فيستبصروا ويستضيئوا بها ويتنفسوا منها فيترّوحوا فيها\n { يوم يغشاهم العذاب من فوقهم } لحرمانهم عن الحق واحتجابهم عن النور واحتراقهم تحت القهر { ومن تحت أرجلهم } لحرمانهم اللذات والشهوات واحتجابهم عنها بفقدان الأسباب والآلات\n وتعذّبهم بإيلام الهيئات ونيران الآثام وهم بين مبتلين شديدين ومشوقين قويين إلى الجهة العلوية بمقتضى الفطرة الأصلية\n وإلى السفلية باقتضاء رسوخ الهيئة العارضية مع الحرمان عنهما واحتباسهم في برزخ بينهما نعوذ بالله منه\n { والذين جاهدوا } من أهل الطريقة { فينا } بالسير في صفاتنا\n وهو السير القلبيّ لأن المبتدىء الذي هو في مقام النفس سيره بالجهاد إلى الله\n والمجاهدة في هذا السير بالحضور والمراقبة والاستقامة إلى الله في الثبات على حكم التجليات { لنهدينهم } إلى طرق الوصول إلى الذات\n وهي الصفات لأنها حجب الذات\n فالسلوك فيها بالاتصاف بها موصل إلى حقيقة الاسم الثابت له تعالى بحسب الصفة الموصوف هو بها وهو عين الذات الواحدية وهي باب الحضرة الأحدية { وإنّ الله لمع المحسنين } الذين يعبدون الله على المشاهدة\n كما قال عليه السلام:\n \" الإحسان أن تعبد الله كأنك تراه \" \nفالمُحسنون السالكون في الصفات والمتّصفون بها لأنهم يعبدون بالمراقبة والمشاهدة\n وإنما قال: \" كأنك تراه \" لأن الرؤية والشهود العيني لا يكون إلا بالفناء في الذات بعد الصفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يقول لهم المؤمنون هكذا ولا يؤمنون بالكتب المنزلة من عندنا { كَذَلِكَ } وعلى ذلك { أَنزَلْنَآ إِلَيْكَ } يا أكمل الرسل { ٱلْكِتَابَ } الجامع لما في الكتب السالفة\n لتكون أنت ومن تبعك مؤمنين مصدقين لجميع الكتب والرسل بلا تفرقة ولا تفاوت { فَٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } قبل كتابك { يُؤْمِنُونَ بِهِ } أي: بكتابك ويصدقون بك أيضاً\n كذلك على الوجه الذي وعدناهم في كتبهم من أنَّا سنرسل رسولاً موصوفاً بأوصافٍ ما بيناه لهم في كتبهم\n ومعه كتاب جامع مصدق لجميع الكتب السالفة والرسل السابقة\n وإن كان مشتملاً على النسخ والتبديل لبعض أحكام الكتب السالفة على مقتضى سنتنا القديمة وعادتنا المستمرة من نسخ بعض الأحكام السابقة باللاحقة\n\n\n{ وَمِنْ هَـٰؤُلاۤءِ } أي: الأعراب { مَن يُؤْمِنُ بِهِ } أي: بهذا الكتاب وإن لم يسبق لهم وعد\n لأنهم ليسوا من أهل الكتاب في وقت من الأوقات\n بل إنما آمنوا به\n لكونهم من أرباب اللسن والفصاحة\n تأملوا في نظام ألفاظه العجيبة واتساق معانيه الدبيعة\n وانكشف لهم أ\nه ما هو من جنس كلام البشر\n فجزموا بإعجازه وآمنوا به\n فصدقوه أنه نازل من عند الله على سبيل الوحي { وَ } بالجملة: { مَا يَجْحَدُ } وينكر { بِآيَاتِنَآ } الظاهر الإعجاز\n العجيبة الشأن\n الباهرة البيان { إِلاَّ ٱلْكَافِرونَ } العنكبوت: 47] الساترون نور الهداية والإيمان بظلمة الكفر والطغيان عناداً ومكابرة\n\n\n{ وَ } كيف لا يكون القرآن وحياً نازلاً من عند الله بمقتضى إرادته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وكذلك } أي: ومثل ذلك الإنزال البديع { أنزلنا إليك الكتاب } مصدقاً لسائر الكتب السماوية وشاهداً عليها\n { فالذين آتيناهم الكتاب } التوراة والإنجيل\n { يؤمنون به } \n وهم عبد الله بن سلام ومن آمن معه\n وأصحاب النجاشي\n أو: من تقدم عهد الرسول صلى الله عليه وسلم من أهل الكتاب\n { ومن هؤلاء } \n من أهل مكة\n { من يؤمن به } \n أو: فالذي آتيناهم الكتب قبلك يؤمنون به قبل ظهوره\n ومن هؤلاء الذين أدركوا زمانك من يؤمن به\n وإذا قلنا: إِنّ السورة كلها مكية\n يكون إخباراً بغيب تحقق وقوعه\n { وما يجحد بآياتنا } \n مع ظهورها وزوال الشبهة عنها\n { إلا الكافرون } إلا المتوغلون في الكفر\n المصممون عليه\n ككعب بن الأشرف وأضرابه\n أو كفار قريش\n إذا قلنا: الآية مكية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:63",
      "similarity": 0.7651017869103294
    },
    {
      "verse": "29:49",
      "similarity": 0.7526613013042841
    },
    {
      "verse": "6:33",
      "similarity": 0.7159454478088466
    },
    {
      "verse": "41:28",
      "similarity": 0.6806748830911173
    },
    {
      "verse": "16:71",
      "similarity": 0.5891103480868544
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029047.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029047.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}