{
  "chapter": "العنكبوت",
  "text": "ولا تجدلوا۟ اهل الكتب الا بالتى هى احسن الا الذين ظلموا۟ منهم وقولوا۟ ءامنا بالذى انزل الينا وانزل اليكم والهنا والهكم وحد ونحن له مسلمون",
  "translations": [
    {
      "translation": "Only argue with the People of the Book in the kindest way - except in the case of those of them who do wrong - saying, 'We have iman in what has been sent down to us and what was sent down to you. Our God and your God are one and we submit to Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not argue with the people of the Book unless in a fair way, apart from those who act wrongly, and say to them: \"We believe what has been sent down to us, and we believe what has been sent down to you. Our God and your God is one, and to Him we submit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Argue not with the People of the Book except in the fairest manner, unless it be those of them that are utterly unjust. Say to them: “We believe in what was revealed to us and what was revealed to you. One is our God and your God; and we are those who submit ourselves to Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not argue with the People of the Book except only by the best manner, except the unjust among them. Tell them, \"We believe in what is revealed to us and to you. Our Lord and your Lord is one. We have submitted ourselves to His will\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O Muslims, do not argue with the People given the Book(s) except in the best manner – except (with) those among them who oppress, and say, “We believe in what has been sent down towards us and what has been sent towards you – and ours and your God is One, and we have submitted ourselves to Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And argue not with the People of the Scripture, except with that which is better -- except with such of them as do wrong; and say (to them): \"We believe in that which has been revealed to us and revealed to you; our God and your God is One, and to Him we have submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not dispute with the followers of the Book except by what is best, except those of them who act unjustly, and say: We believe in that which has been revealed to us and revealed to you, and our Allah and your Allah is One, and to Him do we submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dispute not with the People of the Book save in the fairer manner, except for those of them that do wrong; and say, 'We believe in what has been sent down to us, and what has been sent down to you; our God and your God is One, and to Him we have surrendered.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And argue not with the People of the Scripture unless it be in (a way) that is better, save with such of them as do wrong; and say: We believe in that which hath been revealed unto us and revealed unto you; our Allah and your Allah is One, and unto Him we surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, argue only in the best way with the People of the Book, [but contend not at all] with such of them as are unjust. Say, \"We believe in what has been revealed to us, and what has been revealed to you; our God and your God are one; and to Him we submit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And dispute not with the people of the Book unless in the best manner, save with those of them who do wrong; and say: we believe in that which hath been sent down unto us and that which hath been sent down unto you: our God and your God is One; and unto Him we are submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not argue with the People of the Book except in a manner which is best, except such of them as are wrongdoers, and say, ‘We believe in what has been sent down to us and in what has been sent down to you; our God and your God is one [and the same], and to Him do we submit.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And dispute ye not with the People of the Book, except with means better (than mere disputation), unless it be with those of them who inflict wrong (and injury): but say, \"We believe in the revelation which has come down to us and in that which came down to you; Our Allah and your Allah is one; and it is to Him we bow (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And argue not with the people of the Scripture (Jews and Christians), unless it be in (a way) that is better (with good words and in good manner, inviting them to Islamic Monotheism with His Verses), except with such of them as do wrong, and say (to them): \"We believe in that which has been revealed to us and revealed to you; our Ilah (God) and your Ilah (God) is One (i.e. Allah), and to Him we have submitted (as Muslims).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not dispute with the People of the Book (Nazarenes) except in the best manner, except for those among them who do wrong and say (to them): 'We believe in that which was sent down to us and that which was sent down to you. Our God and your God is One, and to Him we have surrendered'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not argue with the People of the Scripture except in the best manner possible, except those who do wrong among them. And say, “We believe in what was revealed to us, and in what was revealed to you; and our God and your God is One; and to Him we are submissive.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not argue with the People of the Scripture except in a way that is best, except for those who commit injustice among them, and say, \"We believe in that which has been revealed to us and revealed to you. And our God and your God is one; and we are Muslims [in submission] to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:46] And do not dispute with the People of the Scripture unless it be with that — in that manner of disputation, bettering the most virtuous way, such as calling [them] to God by [reference to] His signs and pointing out His arguments; except [in the case of] those of them who have done wrong, by waging war and refusing to accept [to pay] the jizya-tax: dispute with these using the sword, until such time as they submit or pay the jizya-tax; and say, to those who have accepted [the imposition upon them of] the jizya-tax, should they inform you of something stated in their Scriptures: ‘We believe in that which has been revealed to us and revealed to you — and neither believe nor disbelieve them in that [which they tell you] — our God and your God is one [and the same], and to Him we submit’, [to Him] we are obedient.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And argue not with the People of the Scripture) the Jews and Christians (unless it be in (a way) that is better) i.e. by the Qur'an, (save with such of them as do wrong) from among the delegation of Najran, then you can do so by means of Mula'anah; (and say: We believe in that which has been revealed unto us) i.e. the Qur'an (and revealed unto you) the Torah and the Gospel; (our God and your God is One) He has no son or partner, (and unto Him we surrender) we are sincere to Him in our worship and profession of Allah's divine Oneness, and we believe in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وإنما ضلّوا عن مقصدهم الذي هو الحق في الطريق لموانع وعادات وظواهر فوجب في الحكمة مرافقتهم في المقصد الذي هو التوحيد كما قال: { وإلهنا وإلهكم واحد } ومرافقتهم في الطريق ما استقام منها ووافق طريق الحق، لا ما اعوّج وانحرف عن المقصد كالانقياد والاستسلام للمعبود بالحق الواحد المطلق كما قال: { ونحن له مُسْلِمون } ليتحقق عندهم أنهم على الحق متوجهون إلى مقصدهم سالكون لسبيله، فتطمئن قلوبهم\n\n\nوملاطفتهم في بيان كيفية سلوك الطريق بتصويب ما هو حق مما هو عليه وتبصير ما هو باطل لاحتجابهم عنه بالعبادة، كقوله: { آمنّا بالذي أنزل إلينا وأُنزل إليكم وإلهنا وإلهكم واحد ونحن له مسلمون } لمناسبتهم ومشراكتهم إياهم في اللطف، فيستأنسوا بهم ويقبلوا قولهم ويهتدوا بهداهم إلا الذي ران على قلوبهم ما كانوا يكسبون فبطل استعدادهم وحجبوا عن ربّهم، وهم الذين ظلموا منهم على أنفسهم بإبطال استعداداتهم ونقص حقوقها من كمالاتها بتكديرها وتسويدها، ومنعها عن القبول بكثرة ارتكاب الفضول فإنهم أهل القهر لا يؤثر فيهم إلا القهر ولا تنجع فيهم الملاطفة للمضادّة بين الوصفين\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعتم أيها المؤمنون خطاب ربكم مع نبيكم { لاَ تُجَادِلُوۤاْ } ولا تخاصموا { أَهْلَ ٱلْكِتَابِ } أي: الأحبار الذين واظبوا على محافظة كتاب الله المنزل إليهم واستنبطوا منه الأحكام، وامتثلوا بأوامره واجتنبوا نواهيه { إِلاَّ بِٱلَّتِي } أي: بالطريق التي { هِيَ أَحْسَنُ } الطرق، وأبعد عن المكبرة وأقرب إلى الصواب، هينين لينين معهم بلا قلق واضطراب وفضول الكلام ماداموا متصفين معتدلين بلا ميل منهم وانحراف إلى المكابرة والاعتساف { إِلاَّ ٱلَّذِينَ ظَلَمُواْ مِنْهُمْ } جهلاً وعناداً، وخرجوا عن منهج الصواب بغياً وعدواناً { وَقُولُوۤاْ } لهم على مقتضى ما أُمرتم به في كتابكم: { آمَنَّا } وصدَّقنا { بِٱلَّذِيۤ } أي: بالكتاب الذي { أُنزِلَ إِلَيْنَا } من ربنا على طريق الوحي لنبينا { وَ } آمناً أيضاً بالكتاب الذي { أُنزِلَ إِلَيْكُمْ } منه سبحانه وحياً على نبيكم { وَ } كيف لا نؤمن لكتابكم ونبيكم؛ إذ { إِلَـٰهُنَا } الذي أنزل علينا كتاباً { وَإِلَـٰهُكُمْ } الذي أنزل عليكم أيضاً كتاباً { وَاحِدٌ } لا تعدد فيه ولا شريك له، ولا مثل له يمثاله ولا كفو له يشابهه { وَنَحْنُ لَهُ مُسْلِمُونَ } [العنكبوت: 46] مؤمنون، منقادون، مطيعون وبجميع ما حكم به سبحانه في كتبه وعلى ألسنة رسله مصدقون ممتثلون إلا ما نسخ في كتابنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولا تُجادلوا أهلَ الكتاب إلا بالتي هي أحسن } إلا بالخصلة التي هي أحسن، أي: ألطف وأرفق، وهي مقابلة الخشونة باللين، والغضب بالكظم، والمشاغبة بالنصح، بأن تدعوه إلى الله تعالى برفق ولين، وتبين له الحجج والآيات، من غير مغالبة ولا قهر\n وأصل المجادلة: فتلُ الخصم عن مذهبه بطريق الحجج، وأصله: شدة الفتل، ومنه قيل للصقر: أجدل لشدة فتل بدنه وقوة خلقه\n والآية قيل: منسوخة بآية السيف، وقيل: نزلت في أهل الذمة\n { إلا الذين ظلموا منهم } ، فأفرطوا في الاعتداء والعناد، ولم يقبلوا النصح، ولم ينفع فيهم الرفق فاستعمِلوا معهم الغلظة\n وقيل: إلا الذين آذوا رسول الله صلى الله عليه وسلم، أو: إلا الذين أثبتوا الولد والشريك، وقالوا: يد الله مغلولة\n أو معناه: ولا تُجادلوا الذين دخلوا في الذمة، المؤدين للجزية، إلا بالتي هي أحسن، إلا الذين ظلموا: فنبذوا الذمة، ومنعوا الجزية، فمجادلتهم بالسيف\n والآية تدل على جواز مناظرة الكفرة في الدين، وعلى جواز تعلم علم الكلام، الذي به تتحقق المجادلة\n قاله النسفي\n { وقولو آمنا بالذي أُنزل إلينا وأُنزل إليكم وإلهُنا وإلهكم واحد } هذا من حسن المجادلة\n قال صلى الله عليه وسلم:\n\n \" إذا حدثكم أهل الكتاب فلا تصدقوهم ولا تكذبوهم، وقولوا: آمنا بالله وكتبه ورسله، فإن كان باطلاً لم تصدقوهم، وإن كان حقاً لم تكذبوهم \" \n",
      "translations": []
    }
  ]
}