{
  "chapter": "العنكبوت",
  "text": "مثل الذين اتخذوا۟ من دون الله اولياء كمثل العنكبوت اتخذت بيتا وان اوهن البيوت لبيت العنكبوت لو كانوا۟ يعلمون",
  "translations": [
    {
      "translation": "The metaphor of those who take protectors besides Allah is that of a spider which builds itself a house; but no house is flimsier than a spider's house, if they only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The semblance of those who take protectors besides God is that of the spider. She arranges a house for herself, but the flimsiest of houses is the spider's. If only they had sense!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The case of those who took others than Allah as their protectors is that of a spider who builds a house; but the frailest of all houses is the spider's house; if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The belief of considering other things as one's guardians besides God is as feeble as a spider's web. The spider's web is the frailest of all dwellings, if only they knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who choose masters other than Allah is like that of the spider; it makes the web its house; and indeed the weakest house of all is that of the spider; if only they knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who seek protectors from other than Allah is that of a spider who builds a house; but indeed, the weakest of houses is the spider's house -- if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who take guardians besides Allah is as the parable of the spider that makes for itself a house; and most surely the frailest of the houses is the spider's house did they but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who have taken to them protectors, apart from God, is as the likeness of the spider that takes to itself a house; and surely the frailest of houses is the house of the spider, did they but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who choose other patrons than Allah is as the likeness of the spider when she taketh unto herself a house, and lo! the frailest of all houses is the spider's house, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who take protectors other than God can be compared to the spider which builds itself a cobweb, but the frailest of all structures is the house of the spider, if they but knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who take other patrons than Allah is as the likeness of the spider who taketh unto herself a house. And verily the frailest of all houses is the spider's house - if they but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who take guardians instead of Allah is that of the spider that takes a home, and indeed the frailest of homes is the home of a spider, had they known!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who take protectors other than Allah is that of the spider, who builds (to itself) a house; but truly the flimsiest of houses is the spider's house;- if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who take Auliya' (protectors and helpers) other than Allah is as the likeness of a spider, who builds (for itself) a house, but verily, the frailest (weakest) of houses is the spider's house; if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who have taken guardians, other than Allah, is as the likeness of the spider that takes to itself a house; surely the spider's house is the weakest house if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who take to themselves protectors other than God is that of the spider. It builds a house. But the most fragile of houses is the spider’s house. If they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who take allies other than Allah is like that of the spider who takes a home. And indeed, the weakest of homes is the home of the spider, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:41] The likeness of those who choose besides God [other] patrons, namely, idols, from whom they hope to profit, is as the likeness of the spider that makes a home, for itself in which to shelter. And truly the frailest, the weakest, of homes is the home of the spider, for it neither protects it from heat nor cold — likewise, idols cannot benefit those who worship them — if they only knew, this, they would not worship them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The likeness of those who choose) worshipped (other patrons than Allah) idols as Lords (is as the likeness of the spider when she taketh unto herself a house, and lo! the frailest of all houses is the spider's house) He says: the spider's web does not protect the spider from heat nor from cold; and idols do not protect those who worship them in this worldly life nor in the Hereafter, (if they but knew) this similitude; but they do not know nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى توهيم جميع التقليدات والتخمينات الحاصلة من هوية النفوس الخبيثة بالماديات\n والعقول المكدرة بكدورات الأوهام والخيالات\n فقال على سبيل التمثيل والتشبيه\n على مقتضى إدراك العوام\n توضيحاً لهم ليتنبهوا على طريق الحق ويتفطنوا بالتوحيد القويم: { مَثَلُ } القوم { ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ } المنزه عن الأشباه والأنداد مطلقاً { أَوْلِيَآءَ } يوالونهم كولاية الله ويعبدونهم مثل عبادته\n متوهمين أنهم شركاء معه أو شفعاء لهم عنده سبحانه مع أنهم لا يتأتى منهم الشركة والشفاعة أصلاً\n إنما مثلهم في هذا الاتخاذ والاعتقاد { كَمَثَلِ ٱلْعَنكَبُوتِ } التي { ٱتَّخَذَتْ بَيْتاً } من لعابها\n ثم تركتها واتخذت آخر مثلها\n ثم تركتها\n وهكذا حالها دائماً مع أن هذه الأبنية البيوتات المتخذة لا تدفع حراً ولا برداً\n ولا تصير مانعاً له من العدو وحجاباً كهؤلاء المقلدين الضالين الذين اتخذوا تقليد بعض الضلال ديناً\n ثم تركوها بتقليدٍ آخر منهم بلا رسوخ ولا تمكن\n وهكذا حالهم دائماً مع أن الأديان المتخذة لا تكشف لهم طريق الحق\n ولا توصلهم إلى معرفته وتوحيده\n ولا تنقذهم من الأوهام والخيالات الباطلة العائقة عن مشرب التوحيد\n ولا تخرجهم من سجن الطبيعة وقيود الإمكان وأغلال الأنانيات وسلاسل العينات\n\n\n{ وَ } قال سبحانه على سبيل التأكيد والمبالغة والتصريح بالتوهين بعدما كنى\n لينزجروا ويرتدوا على ما هم عليه من الأديان الباطلة: { إِنَّ أَوْهَنَ ٱلْبُيُوتِ } وأضعف الأبنية { لَبَيْتُ ٱلْعَنكَبُوتِ } إذ لا بيت أضعف منه\n وأشرف إلى التخريب والانهدام\n وأقل وقاية من الحر والبرد ودفع الضر { لَوْ كَانُواْ يَعْلَمُونَ } [العنكبوت: 41] وهنه وعدم نفعه لما اتخذوها\n لكنهم لم يعلموا\n فاتخذوا جهلاً وعناداً\n فيسعلمون عاقبة ما اتخذوا ووبال ما عبدوا\n\n\nثم قال سبحانه على وجه الوعيد إياهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { مَثَلُ الذين اتخذوا من دون اللهِ أولياءَ } أصناماً يعبدونها\n أي: مَثَلُ من أشرك بالله الأوثان في الضعف\n وسوء الاختيار\n { كَمَثَل العنكبوتِ اتخذت بيتاً } \n أي: كمثل العنكبوت فيما تتخذه لنفسها من بيت فإنه لا يدفع الحر والبرد\n ولا يقي ما تقي البيوت\n فكذلك الأوثان\n لا تنفعهم في الدنيا والآخرة\n بل هي أَوْهَى وأضعف\n فإن لبيت العنكبوت حقيقةً وانتفاعاً عاماً\n وأما الأوثان فتضر ولا تنفع\n { وإنَّ أوْهَنَ البيوتِ } أي: أضعفها { لبيتُ العنكبوت } لا بَيْتَ أوهن من بيته إذْ أضعف شيء يسقطها\n عن عليّ رضي الله عنه: \" طهروا بيوتكم من نسج العنكبوت\n فإن تركه يُورث الفقر \"\n والعنكبوت يقع على الواحد والجمع\n والمذكر والمؤنث\n ويجمع على عناكيب وعناكب وعِكاب وعكَبَة وأعكُب\n { لو كانوا يعلمون } لعلموا أن هذا مثلُهم\n وأنَّ ما تمسكوا به من الدين أرق من بيت العنكبوت\n وقال الزجاج: تقدير الآية: مثل الذين اتخذوا من دون الله أولياء\n لو كانوا يعلمون\n كمثل العنكبوت\n وقيل: معنى الآية: مَثَلُ المشركِ يعبد الوثن\n بالقياس إلى المؤمن الذي يعبد الله\n مثل عنكبوت تتخذ بيتاً بالإضافة إلى رجل بنى بيتاً بآجُرٍّ وجص\n أو جص وصخور\n فكما أن أوهن البيوت\n إذا استقرأتَهَا بيتاً بيتاً\n بيت العنكبوت\n كذلك أضعف الأديان\n إذا تتبعتها ديناً ديناً\n عبادةُ الأوثان\n وقال الضحاك: ضرب مثلاً لضعف آلهتهم ووهنها\n فلو علموا أن عبادة الأوثان\n في عدم الغنى\n كما ذكرنا في المثل\n لَمَا عبدوها\n ولكنهم لا يعلمون\n بل الله يعلم ضَعف ما تعبدون من دونه وعجزه\n ولذلك قال: { إن الله يعلم ما تدعون من دونه من شيء } \n أي: يعلم حاله\n وصفته\n وحقيقته\n وعدم صلاحيته لِمَا تؤملونه منه\n فما: موصولة\n مفعول \" يعلم \" \n وهي تامة\n أي: يتعلق علمه بجميع ما يعبدونه من دونه أيّ شيء كان\n أو ناقصة والثاني محذوف أي: يعلمه وهياً وباطلاً\n وقيل: استفهامية معلقة\n وأما كونها نافية فضعيف\n و \" من \" الثانية للبيان\n ومن قرأ بالخطاب فعلى حذف القول\n أي: ويقال للكفرة: إن الله يعلم ما تعبدونه من دونه من جيمع الأشياء\n أو: أيّ شيء كان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:104",
      "similarity": 0.1918027405906626
    },
    {
      "verse": "3:139",
      "similarity": 0.18817019494568277
    },
    {
      "verse": "8:18",
      "similarity": 0.18777550027149412
    },
    {
      "verse": "31:14",
      "similarity": 0.15539211159041125
    },
    {
      "verse": "47:35",
      "similarity": 0.1490844117996373
    }
  ]
}