{
  "chapter": "العنكبوت",
  "text": "ام حسب الذين يعملون السيـات ان يسبقونا ساء ما يحكمون",
  "translations": [
    {
      "translation": "Or do those who do bad actions imagine they can outstrip Us? How bad their judgement is!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who do evil think that they will get the better of Us? How bad is the judgement that they make!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the evil-doers suppose that they will get the better of Us? How evil is their judgement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the evil-doers think they can escape Us? How terrible is their judgment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they who commit evil deeds imagine that they can escape from Us? What an evil judgement they impose!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or think those who do evil deeds that they can outstrip Us Evil is that which they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they who work evil think that they will escape Us? Evil is it that they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they reckon, those who do evil deeds, that they will outstrip Us? Ill they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do those who do ill-deeds imagine that they can outstrip Us? Evil (for them) is that which they decide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who do evil imagine that they will escape Us? How ill they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or bethink those who work ill deeds that they shall outstrip Us? lll do they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who commit misdeeds suppose that they can outmaneuver Us? Evil is the judgement that they make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who practise evil think that they will get the better of Us? Evil is their judgment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or those who do evil deeds think that they can outstrip Us (i.e. escape Our Punishment)? Evil is that which they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do the evildoers think that they will outstrip Us? How evil is their judgment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do those who commit sins think they can fool Us? Terrible is their opinion!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do those who do evil deeds think they can outrun Us? Evil is what they judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:4] Or do those who commit evil deeds, idolatry and acts of disobedience, suppose that they can elude Us?, so that We will not be able to requite them. Evil is that, judgement of theirs, which they judge!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا سَاءَ مَا يَحْكُمُونَ (4)أعقب تثبيت المؤمنين على ما يصيبهم من فتون المشركين وما في ذلك من الوعد والوعيد بزجر المشركين على ما يعملونه من السيئات في جانب المؤمنين وأعظم تلك السيئات فتونهم المسلمين . فالمراد بالذين يعملون السيئات الفاتنون للمؤمنين .وهذا ووعيدهم بأن الله لا يفلتهم . وفي هذا أيضاً زيادة تثبيت للمؤمنين بأن الله ينصرهم من أعدائهم .ف { أم } للإضراب الانتقالي ويقدر بعدها استفهام إنكاري .و { السيئات } : الأعمال السوء . وهي التنكيل والتعذيب وفتون المسلمين .والسبق : مستعمل مجازاً في النجاة والانفلات كقول مُرة بن عدَّاء الفقعسي: ... كأنك لم تُسْبَق من الدهر مرةإذا أنت أدركت الذي كنت تطلب ... وقوله تعالى { وما نحن بمسبوقين على أن نبدّل أمثالكم } \\[ الواقعة : 60 ، 61 \\] وقوله { فاستكبروا في الأرض وما كانوا سابقين فكُلاًّ أخذنا بذنبه } \\[ العنكبوت : 39 ، 40 \\] .وقد تقدم عند قوله تعالى { ولا يحسبَنّ الذين كفروا سبقوا } في سورة \\[ الأنفال : 59 \\] . والمعنى : أم حسبوا أن قد شفوا غيظهم من المؤمنين ، فهم بذلك غلبوا أولياءنا فغلبونا .وجملة { ساء ما يحكمون } ذمّ لحسبانهم ذلك وإبطال له . فهي مقررة لمعنى الإنكار في جملة { أم حَسِبَ الذين يعملون السيئات } فلها حكم التوكيد فلذلك فصلت .وهذه الجملة تقتضي أن يكون هذا الحسبان واقعاً منهم . ومعنى وقوعه : أنهم اعتقدوا ما يساوي هذا الحسبان لأنهم حين لم يستطع المؤمنون رد فتنتهم قد اغتروا بأنهم غلبوا المؤمنين ، وإذ قد كان المؤمنون يدعون إلى الله دون الأصنام فمَنْ غلبهم فقد حسب أنه غلب من يدعون إليه وهم لا يشعرون بهذا الحسبان ، فافهمه .والحُكم مستعمل في معنى الظن والاعتقاد تهكماً بهم بأنهم نصبوا أنفسهم منصب الذي يحكم فيطاع و { ما يحكمون } موصول وصلته ، أي ساء الحكم الذي يحكمونه .وهذه الآية وإن كانت واردة في شأن المشركين المؤذين للمؤمنين فهي تشير إلى تحذير المسلمين من مشابهتهم في اقتراف السيئات استخفافاً بوعيد الله عليها لأنهم في ذلك يأخذون بشيء من مشابهة حسبان الانفلات ، وإن كان المؤمن لا يظن ذلك ولكنه ينزل منزلة من يظنه لإعراضه عن الوعيد حين يقترف السيئة .\n\n",
      "translations": [
        {
          "translation": "The following was revealed about Abu Jahl Ibn Hisham, al-Walid Ibn al-Mughirah and 'Utbah and Shaybah the sons of Rabi'ah who had duals with 'AN Ibn Abi Talib, may Allah be well pleased with him, Hamzah Ibn 'Abd al-Muttalib, the uncle of the Prophet (pbuh) and 'Ubaydah Ibn al-Harth Ibn 'Abd al-Muttalib on the Day of Badr; some of them boasted to others, and so Allah said: (Or do those who do ill deeds) in their state of associating partners with Allah (imagine that they can outstrip Us) that they will evade Our punishment: (Evil (for them) is that which they decide) evil is that which they judge and think for themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مبالغين في إتيانها { أَن يَسْبِقُونَا } ويفوتوا عنا جزاء ما عملوا\n ويسقطوا عن حسابنا ما أتوا به من المعاصي\n بل نحن مطلعون عليها حين كانوا في استعداداتهم قبل ظهورهم في فضاء الوجود\n فكيف حين وجودهم وظهورهم\n وصدور الآثام عنهم بالفعل؟! { سَآءَ مَا يَحْكُمُونَ } [العنكبوت: 4] علينا حكمهم وهذا ونسبتهم هذه - أعاذنا الله وعموم عباده عن أمثال هذه الظنون الفاسدة بالنسبة إليه سبحانه - كل ذلك عن جهلهم بالله ويمقتضى عزه وعلوه\n وإنكارهم بلقائه والوقوف بين يديهز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { أَمْ حَسِبَ الذين يعملون السيئات } أي: الشرك والمعاصي وإذاية المسلمين\n { أن يسبقونا } أي: يفوتونا\n بل يلحقهم الجزاء لا محالة\n و \" أم \": منقطعة\n ومعنى الإضراب فيها: أن هذا الحسبان أَبْطَلُ من الحسبان الأول\n لأن ذلك يظن أنه لا يُمْتَحَنُ لإيمانه\n وهذا يظن أنه لا يُجَازَى بمساوئه\n وشبهته أضعف\n ولذلك عقّبه بقوله: { ساءَ ما يحكمون } \n أي: بئس ما يحكمون به حكمهم في صفات الله أنه مسبوق\n وهو القادر على كل شيء\n فالمخصوص محذوف\n ثم ذكر الحامل على الصبر عند الإمتحان\n وهو رجاء لقاء الحبيب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:27",
      "similarity": 0.6209042700701312
    },
    {
      "verse": "56:10",
      "similarity": 0.6166268386608225
    },
    {
      "verse": "79:4",
      "similarity": 0.6150356106167781
    },
    {
      "verse": "21:101",
      "similarity": 0.5442220826217096
    },
    {
      "verse": "56:60",
      "similarity": 0.5243016791133462
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}