{
  "chapter": "العنكبوت",
  "text": "وتلك الامثل نضربها للناس وما يعقلها الا العلمون",
  "translations": [
    {
      "translation": "Such metaphors - We devise them for mankind; but only those with knowledge understand them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are precepts of wisdom We offer to men, but only those who are rational understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the parables that We set forth to make people understand. But only those endowed with knowledge will comprehend them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are parables which We tell to human being, but only the learned ones understand them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We illustrate these examples for mankind; and none except the knowledgeable understand them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these are the examples We give for mankind; but none will understand them except those who have knowledge (of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) these examples, We set them forth for men, and none understand them but the learned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those similitudes -- We strike them for the people, but none understands them save those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for these similitudes, We coin them for mankind, but none will grasp their meaning save the wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the comparisons We make for people, but only those understand them who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these similtudes! We propound them for mankind; and none understand them save men of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We draw these parables for mankind; but no one grasps them except those who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And such are the Parables We set forth for mankind, but only those understand them who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these similitudes We put forward for mankind, but none will understand them except those who have knowledge (of Allah and His Signs, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strike these parables for the people, but none understands except the knowledgeable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These examples—We put them forward to the people; but none grasps them except the learned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these examples We present to the people, but none will understand them except those of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:43] And such similitudes, in the Qur’ān, We strike them, We coin them, for [the sake of] mankind; but none understands them, [none] grasp them, except those who know, those who reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for these similitudes, We coin them) We explain them (for mankind, but none will grasp their meaning) i.e. the meaning of the similitude of the Qur'an (save the wise) those who profess Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتلك الأمثالُ } الغريبة، أي: هذا المثل ونظائره { نضربها للناس } نُبّيِّنُها لهم تقريباً لما بَعُدَ عن أفهامهم\n كان سفهاء قريش وجهَلَتُهم يقولون: إن رب محمد يضرب المثل بالذباب والعنكبوت، ويضحكون من ذلك، فلذلك قال تعالى: { وما يعقلها إلا العالِمون } ، أي: بالله وصفاته وأسمائه، وبمواقع كلامه وحِكَمه، أي: لا يعقل صحتها وحُسنها، ولا يفهم حكمتها، إلا هم لأن الأمثال والتشْبيهات إنما هي طرق إلى المعاني المستورة، حتى يبرزها ويصورها للأفهام، كما صور هذا التشبيه الذي بيّن فيه حال المشرك وحال المؤمن\n\n\nوعن النبي صلى الله عليه وسلم أنه تلا في هذه الآية، وقال:\n\n \" العالِم: مَنْ عقل عن الله، فعمل بطاعته، واجتنب سخطه \" \n\n، وَدَلَّتْ هذه الآية على فضل العلم وأهله",
      "translations": []
    }
  ]
}