{
  "chapter": "العنكبوت",
  "text": "بل هو ءايتۢ بينت فى صدور الذين اوتوا۟ العلم وما يجحد بـايتنا الا الظلمون",
  "translations": [
    {
      "translation": "No, it is Clear Signs reposited in the hearts of those who have been given knowledge. Only wrongdoers deny Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, in the minds of those who have intelligence these are clear signs. No one denies Our revelations except those who are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But it is a set of Clear Signs in the hearts of those who have been endowed with knowledge. None except the utterly unjust will deny Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, the Quran consists of illustrious verses that exist in the hearts of those who have knowledge. No one rejects Our revelations except the unjust ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact they are clear verses in the hearts of those who have been given knowledge; and none deny Our verses except the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but it is clear Ayat, (preserved) in the breasts of those who have been given knowledge. And none but the wrongdoers deny Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! these are clear communications in the breasts of those who are granted knowledge; and none deny Our communications except the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay; rather it is signs, clear signs in the breasts of those who have been given knowledge; and none denies Our signs but the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But it is clear revelations in the hearts of those who have been given knowledge, and none deny Our revelations save wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Quran is a revelation that is clear to the hearts of those endowed with knowledge. Only the evil-doers refuse to acknowledge Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! it in itself manifest signs in the breasts of those who have been vouchsafed knowledge, and none gainsay Our signs save the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, it is [present as] manifest signs in the breasts of those who have been given knowledge, and none contests Our signs except wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, here are Signs self-evident in the hearts of those endowed with knowledge: and none but the unjust reject Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they, the clear Ayat [i.e. the description and the qualities of Prophet Muhammad SAW written like verses in the Taurat (Torah) and the Injeel (Gospel)] are preserved in the breasts of those who have been given knowledge (from the people of the Scriptures). And none but the Zalimun (polytheists and wrongdoers, etc.) deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, rather they are clear verses in the chests of those who have been given knowledge. None disbelieves Our verses except the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, it is clear signs in the hearts of those given knowledge. No one renounce Our signs except the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, the Qur'an is distinct verses [preserved] within the breasts of those who have been given knowledge. And none reject Our verses except the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:49] Nay, but it, that is, the Qur’ān which you have brought, is clear signs in the breasts of those who have been given knowledge, namely, the believers, who preserve it [in their hearts], and none denies Our signs except wrongdoers, namely, the Jews — they denied them after they were manifested to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But it) your attributes and description (is clear revelations) are clear signs whose knowledge is (in the hearts of those who have been given knowledge) the knowledge of the Torah; it is also said this means: the Qur'an consists of clear verses which explain the lawful and the unlawful, the commands and prohibitions, and this is preserved in the hearts of those who have been given knowledge of the Qur'an, (and none deny 453 our revelations) Muhammad (pbuh) and the Qur'an (save wrong-doers) the disbelievers: the Jews, Christians and idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ هُوَ } أي: القرآن في نفسه { آيَاتٌ } ودلائل دالة على توحيد الحق { بَيِّنَاتٌ } واضحات الدلالات في أنفسها، ثابتات { فِي صُدُورِ } الموحدين { ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } اللدني المترشح من حضرة العلم الإلهي، المفاض لهم منها محسب استعداداتهم وقابلياتهم تفضلاً عليهم وامتناناً لهم { وَ } بالجملة: { مَا يَجْحَدُ } وينكر { بِآيَاتِنَآ } مع قواطع برهانه وسواطع تبيانه { إِلاَّ } القوم { ٱلظَّالِمُونَ } [العنكبوت: 49] الخارجون عن مقتضى العلم والعين والكشف والشهود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { بل هو } أي: القرآن { آيات بيناتٌ في صدور الذين أُوتوا العلم } اي: في صدور العلماء وحُفاظه، وهما من خصائص القرآن كون آياتِه بيناتِ الإعجاز وكونه محفوظاً في الصدور، بخلاف سائر الكتب، فإنها لم تكن معجزات، ولم تكن تُقرأ إلا بالمصاحف\n قال ابن عباس: { بل هو } أي: محمد، والعلم بأنه أُمي، { آيات بينات } في صدور أهل العلم من أهل الكتاب، يجدونه في كتبهم\n هـ\n وبل: للإضراب عن محذوف، ينساق إليه الكلام، أي: ليس الأمر مما يمكن الارتياب فيه، بل هو آيات واضحات\n وفي صدور: متعلق ببينات، أو: خبر ثان لهو\n { وما يجحدُ بآياتنا } الواضحة { إلا الظالمون } المتوغلون في الظلم\n قال ابن عطية: الظالمون والمبطلون هم كل مُكذب للنبي صلى الله عليه وسلم، ولكن عُظم الإشارة بهما إلى قريش لأنهم الأهم\n قاله مجاهد\n هـ\n الإشارة: كم من وليٍّ يكون أُمياً، وتجد عنده من العلوم والحِكَم والتوحيد ما لا يوجد عند نحارير العلماء\n ما اتخذ الله ولياً جاهلاً إلا علَّمه ولقد سمعت من شيخنا البوزيدي رضي الله عنه علوماً وأسراراً، ما رأيتها في كتاب، وكان يتكلم في تفسير آيات من كتاب الله على طريق أهل الإشارة، قلّ أن تجدها عند غيره، وسمعته يقول: والله ما جلست بين يدى عالم قط، ولا قرأت شيئاً من العلم الظاهر\n قال القشيري: قلوبُ الخواص من العلماء بالله خزائنُ الغيب، فيها أودع براهين حقه، وبينات سرِّه، ودلائل توحيده، وشواهد ربوبيته، فقانون الحقائق في قلوبهم، وكلُّ شيء يُطلب من موطنه ومحله، فالدر يُطلب من الصدف لأنه مسكنه، كذلك المعرفة، ووصف الحق يُطْلَبُ من قلوب خواصه لأن ذلك قانون معرفته، ومنها ترفع نسخةُ توحيده\n هـ\n ثم ردّ اقتراحهم للآيات، فقال: { وَقَالُواْ لَوْلاَ أُنزِلَ عَلَيْهِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:47",
      "similarity": 0.7526613013042845
    },
    {
      "verse": "6:33",
      "similarity": 0.6957151163334396
    },
    {
      "verse": "40:63",
      "similarity": 0.6705750183598591
    },
    {
      "verse": "41:28",
      "similarity": 0.6300554206779385
    },
    {
      "verse": "16:71",
      "similarity": 0.5555558937144695
    }
  ]
}