{
  "chapter": "العنكبوت",
  "text": "وما كنت تتلوا۟ من قبله من كتب ولا تخطه بيمينك اذا لارتاب المبطلون",
  "translations": [
    {
      "translation": "You never recited any Book before it nor did you write one down with your right hand. If you had, the purveyors of falsehood would have voiced their doubts.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not read any Scripture before this, nor wrote one with your right hand, or else these dissemblers would have found a cause to doubt it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), you did not recite any Book before, nor did you write it down with your hand; for then the votaries of falsehood would have had a cause for doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not able to read or write before the Quran was revealed to you; otherwise, the followers of falsehood would have tried to confuse the matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you (O dear Prophet Mohammed – peace and blessings be upon him) were not reading any Book before it, nor writing with your right hand – if it were, the people of falsehood would surely have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither did you read any book before it nor did you write any book with your right hand. In that case, indeed, the followers of falsehood might have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you did not recite before it any book, nor did you transcribe one with your right hand, for then could those who say untrue things have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not before this didst thou recite any Book, or inscribe it with thy right hand, for then those who follow falsehood would have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou (O Muhammad) wast not a reader of any scripture before it, nor didst thou write it with thy right hand, for then might those have doubted, who follow falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were not able to read any book before this, nor did you write one down with your hand. If you had done so, the followers of falsehood would have had cause to doubt it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou hast not been reciting any book before it, nor hast thou been writing it With thine right hand, for then might the followers of falsehood have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not use to recite any scripture before it, nor did you write it with your right hand, for then the impugners would have been skeptical.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wast not (able) to recite a Book before this (Book came), nor art thou (able) to transcribe it with thy right hand: In that case, indeed, would the talkers of vanities have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither did you (O Muhammad SAW) read any book before it (this Quran), nor did you write any book (whatsoever) with your right hand. In that case, indeed, the followers of falsehood might have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never before did you recited any Book, or inscribe it with your right hand. If you had done so, those who follow falsehood would have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not read any scripture before this, nor did you write it down with your right hand; otherwise the falsifiers would have doubted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you did not recite before it any scripture, nor did you inscribe one with your right hand. Otherwise the falsifiers would have had [cause for] doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:48] And you did not use to recite before this, namely, [before] the Qur’ān, any [other] Book, nor did you write it with your right hand, for, had you been reciting [something] and writing, then those who follow falsehood, the Jews, would have had doubts, about you and would have said, ‘What the Torah states is that he will be unlettered (ummī), unable to read or write’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou (0 Muhammad) were not a reader of any scripture before it) before the Qur'an, (nor didst thou write it with thy right hand, for) if you could read or write (then might those have doubted, who follow falsehood) then the Jews, Christians and idolaters would have doubted, for it is mentioned in the Scriptures of the Jews and Christians that you are unlettered.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذاً لاَّرْتَابَ ٱلْمُبْطِلُونَ } معناه شَكٌّ الكَذوبُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {then let the falsifiers be} [means] that the liars are in doubt.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { مَا كُنتَ } يا أكمل الرسل { تَتْلُواْ } وتتعلم { مِن قَبْلِهِ } أي: قبل القرآن ونزوله { مِن كِتَابٍ } من الكتب المنزلة { وَلاَ تَخُطُّهُ } وتنسخه { بِيَمِينِكَ } على سبيل النقل\n يعني: ما كنت من أهل النسخ والإملاء والكتابة\n إذ هي مسبوقة بالتعليم وأنت أمِّي\n عارٍ عن الدراسة والكتابة والتعلم مطلقاً\n ولم يعهد منك أمثال هذه الأمور الدالة على الأخذ والاستنباط\n ولو كنت متصفاً بها وأهلاً لها { إِذاً لاَّرْتَابَ } شك و تردد { ٱلْمُبْطِلُونَ } [العنكبوت: 48] المجاهرون بالقول الزور الباطل في شأنك وفي شأن كتابك وكونه معجزاً\n مع أنه ما هو - أي: القرآن - حينئذ أيضاً محل ارتياب\n لأنه في نفسه باعتبار نظمه العجيب البديع ومعانيه الغريبة وأسلوبه المحكم معجز خارق للعادة عند من له أدنى دربة في أساليب الكلام\n ولا ينبغي لأحد أن يشك في إعجازه إلا من هو متناهٍ في البلادة وسخافة العقل وركاكة الفهم\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما كنت تَتْلوا من قبله } من قبل القرآن { من كتاب ولا تَخُطُّه بيمينك } \n بل كنت أمياً\n لم تقرأ ولم تكتب\n فظهور هذا الكتاب الجامع لأنواع العلوم الشريفة والأخبار السالفة\n على يد أُمي لم يُعْرَفْ بالقراءة والتعلم\n خرق عادة\n قاطعة لبغيته\n وذكر اليمين\n لأن الكتابة\n غالباً\n تكون به\n أي: ما كنت قارئاً كتاباً من الكتب\n ولا كَاتِباً { إِذاً لارتابَ المبطلون } أي: لو كنت ممن يخط ويقرأ لقالوا: تعلمه\n والتقطه من كتب الأقدمين\n وكتبه بيده\n أو: يقول أهل الكتاب: الذي نجده في كتابنا أُمي لا يكتب ولا يقرأ\n وليس به\n وسماهم مبطلين\n لإنكارهم النبوة\n أو: لارتيابهم فيها\n مع تواتر حججها ودلائلها\n هذا\n وكونه صلى الله عليه وسلم أُمياً كَمَالٌ في حقه صلى الله عليه وسلم\n مع كونه أمياً أحاط بعلوم الأولين والآخرين\n وأخبر بقصص القرون الخالية والأمم الماضية\n من غير مدارسة ولا مطالعة\n وهو\n مع ذلك\n يُخبر بما مضى\n وبما يأتي إلى قيام الساعة\n وسرد علم الأولين والآخرين مما لا يعلم القصة الواحدة منها إلا الفذ من أحبارهم\n الذي يقطع عمره في مدارسته وتعلمه\n وهذا كله في جاهلية جهلاء\n بَعُد فيها العهد بالأنبياء\n وبدّل الناس\n وغيَّروا في كتب الله تعالى بالزيادة والنقصان\n ففضحهم صلى الله عليه وسلم وقرر الشرائع الماضية\n فهذا كله كاف في صحة نبوته\n فكانت أميته صلى الله عليه وسلم وَصْفَ كمال في حقه\n ومعجزةً دالة على نبوته لأنه صلى الله عليه وسلم\n مع كونه أُمياً\n ظهر عليه من العلوم اللدنية\n والأسرار الربانية\n ما يعجز عنه العقول\n ولا تُحيط به النقول\n مع إحكامه لسياسة الخلق\n ومعالجتهم\n مع تنوعهم\n وتدبير أمر الحروب\n وإمامته في كل علم وحكمة\n وأيضاً: المقصود من القراءة والكتابة: ما ينتج عنهما من العلم لأنهما آلة\n فإذا حصلت الثمرة استغنى عنهما\n والمشهور أنه صلى الله عليه وسلم لم يكتب قط\n\nوقال الباجي وغيره: إنه كتب\n لظاهر حديث الحديبية\n وقال مجاهد والشعبي: ما مات النبي صلى الله عليه وسلم حتى كتب وقرأ\n وهذا كله ضعيف\n قال تعالى: { بل هو } أي: القرآن { آيات بيناتٌ في صدور الذين أُوتوا العلم } اي: في صدور العلماء وحُفاظه\n وهما من خصائص القرآن كون آياتِه بيناتِ الإعجاز وكونه محفوظاً في الصدور\n بخلاف سائر الكتب\n فإنها لم تكن معجزات\n ولم تكن تُقرأ إلا بالمصاحف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:2",
      "similarity": 0.05866454120289222
    },
    {
      "verse": "2:2",
      "similarity": 0.058473212566908385
    },
    {
      "verse": "7:173",
      "similarity": 0.058463272884112266
    },
    {
      "verse": "6:12",
      "similarity": 0.058232521307688016
    },
    {
      "verse": "10:37",
      "similarity": 0.05692798139988668
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029048.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029048.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}