{
  "chapter": "العنكبوت",
  "text": "ان الله يعلم ما يدعون من دونه من شىء وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "Allah knows what you call upon besides Himself. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily God knows what they invoke in His place, for He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah knows fully what they call upon apart from Him. He is the Most Powerful, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows whatever they worship besides Him; He is the Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what they worship instead of Him; He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah knows what things they invoke instead of Him. He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah knows whatever thing they call upon besides Him; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows whatever thing they call upon apart from Him; He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah knoweth what thing they invoke instead of Him. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God surely knows what they invoke besides Him. He is the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah knoweth whatsoever thing they invoke beside Him. And He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed knows whatever thing they invoke besides Him, and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah doth know of (every thing) whatever that they call upon besides Him: and He is Exalted (in power), Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah knows what things they invoke instead of Him. He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows whatever they call upon other than Him; He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows what they invoke besides Him. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah knows whatever thing they call upon other than Him. And He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:42] Truly God knows whatever thing (mā functions like alladhī) they call on, [what] they worship (read yad‘ūna, ‘they call on’, or tad‘ūna, ‘you call on’) besides Him, other than Him. And He is the Mighty, in His kingdom, the Wise, in what He does.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ اللَّهَ يَعْلَمُ مَا يَدْعُونَ مِنْ دُونِهِ مِنْ شَيْءٍ وَهُوَ الْعَزِيزُ الْحَكِيمُ (42)لما نفى عنهم العلم بما تضمنه التمثيل من حقارة أصنامهم التي يعبدونها وقلة جدواها بقوله { لو كانوا يعلمون } \\[ العنكبوت : 41 \\] المفيد أنهم لا يعلمون ، أعقبه بإعلامهم بعلمه بدقائق أحوال تلك الأصنام على اختلافها واختلاف معتقدات القبائل التي عبدتها ، وأن من آثار علمه بها ضرب ذلك المثل لحال من عبدوها وحالها أيضاً دفعاً بهم إلى أن يتهموا عقولهم وأن عليهم النظر من حقائق الأشياء تعريضاً بقصور علمهم كقوله تعالى { والله يعلم وأنتم لا تعلمون } \\[ البقرة : 216 \\] ، فهذا توقيف لهم على تفريطهم في علم حقائق الأمور التي عَلِمها الله وأبلغهم دلائلها النظرية ونظائرها التاريخية ، وقربها إليهم بالتمثيلات الحسية فعموا وصموا عن هذا وذاك .و { ما } من قوله { ما تدعون } يجوز أن تكون نافية معلِّقة فعل { يعلم } عن العمل ، وتكون { من } زائدة لتوكيد النفي ، ومجرورها مفعول في المعنى ل { تدعون } ظهرت عليه حركة حرف الجر الزائد . ومعنى الكلام : أن الله يعلم أنكم لا تدعون موجوداً ولكنكم تدعون أموراً عدمية ، ففيه تحقير لأصنامهم بجعلها كالعدم لأنها خلو عن جميع الصفات اللائقة بالإلهية . فهي في بابها كالعدم فلما شابهت المعدومات في انتفاء الفائدة المزعومة لها استعمل لها التركيب الدال على نفي الوجود على طريقة التمثيلية . ولا يتوهم السامع أن المراد نفيُ أن يكونوا قد دعوا أولياء من دون الله ، لأن سياق الكلام سابقه ولاحقه يأباه وهذا كقوله تعالى { ليست النصارى على شيء } في سورة البقرة ( 113 ) ، و { لستم على شيء } في سورة المائدة ( 68 ) ، وكقول النبي صلى الله عليه وسلم لما سُئل عن الكهان : إنهم ليسوا بشيء ، أي ليسوا بشيء فيما يدعونه من معرفة الغيب .وحاصل المعنى : أن من علمه تعالى بأنها موجودات كالعدم ضرَبَ لها مثلاً ببيت العنكبوت ولعبدتها مثلاً بالعنكبوت الذي اتخذها ، وعلى هذا الوجه فالكلام صريح في إبطال إلهية الأصنام وفي أنها كالعدم .ويجوز أن تكون { ما } استفهامية معلِّقة فعل { يعلم } عن العمل من باب قولهم : علمت هل زيد قائم ، أي علمت جوابه . و { من } بيانية لما في { ما } الاستفهامية من الإبهام ، أي من شيء من المدعوات العديدة في الأمم . ففيه تعريض بأن المشركين لا يعلمون جواب سؤال السائل «ما تدعون من دون الله» ، أي قد علم الله ذلك ، ومن علمه بذلك أنه ضرب لهم المثل بالعنكبوت اتخذت بيتاً ، وللمعبودات مثلاً ببيت العنكبوت ، وأنتم لو سئلتم : ما تدعون من دون الله ، لتلعثمتم ولم تحيروا جواباً؛ فإن شأن العقائد الباطلة والأفهام السقيمة أن لا يستطيع صاحبها بيانها بالقول وشرحها ، لأنها لما كانت تتألف من تصديقات غير متلائمة لا يستطيع صاحبها تقريرها فلا يلبث قليلاً حتى يفتضح فاسد معتقده من تعذر إفصاحه عنه .وجعل بعض المفسرين { يعلم } هنا متعدياً إلى مفعول واحد وأنه بمعنى ( يعرف ) وجعل { ما } موصولة مفعول { يدعون } والعائذ محذوفاً ، ويعكر عليه أن إسناد العلم بمعنى المعرفة وهو المتعدي إلى مفعول واحد إلى الله يؤول إلى إسناد فعل المعرفة إلى الله بناء على إثبات الفرق بين فعل ( علم ) وفعل ( عرف ) عند من فسر المعرفة بإدراك الشيء بواسطة آثاره وخصائصه المحسوسة ، وأنها أضعف من العلم لأن العلم شاع في معرفة حقائق الأشياء ونسبها .وعن الخليل بن أحمد «العلم معرفتان مجتمعان ، ففي قولك : عرفت زيداً قائماً ، يكون ( قائماً ) حالاً من ( زيداً ) ، وفي قولك : علمت زيداً قائماً ، يكون ( قائماً ) مفعولاً ثانياً ل ( علمت ) اه . يريد أن فعل ( عرف ) يدل على إدراك واحد وهو إدراك الذات ، وفعل ( علم ) يدل على إدراكين هما إدراك الذات وإدراك ثبوت حكم لها ، على نحو ما قاله أهل المنطق في التصور والتصديق ، فلذلك لم يرد في الكتاب والسنة إسناد فعل المعرفة إلى الله فكيف يسند إليه ما يؤوَّل بمعناها .وجملة { وهو العزيز الحكيم } تذييل لجملة { إن الله يعلم } لأن الجملة على كلا المعنيين في معاني { ما } تدل على أن الذي بيَّن حقارة حال الأصنام واختلال عقول عابديها فلم يعبأ بفضحها وكشفها بما يسوءها مع وفرة أتباعها ومع أوهام أنها لا يمسها أحد بسوء إلا كانت ألْباً عليه؛ فلو كان للأصنام حظ في الإلهية لما سلم من ضرّها من يُحقرها كقوله تعالى { قل لو كان معه ءالهة كما تقولون إذن لابتغوا إلى ذي العرش سبيلاً } \\[ الإسراء : 42 \\] كما تقدم ، وأنه لما فضح عقول عُبادها لم يخشهم على أوليائه بَلْهَ ذاته ، فهو عزيز لا يُغلب ، وحكيم لا تنطلي عليه الأوهام والسفاسط بخلاف حال هاتيك وأولئك .وقرأ الجمهور { تدعون } بالفوقية على طريقة الالتفات . وقرأه أبو عمرو وعاصم ويعقوب بالتحتية .\n\n",
      "translations": [
        {
          "translation": "(Lo! Allah knoweth what thing they invoke) they worship (instead of Him) of idols do not benefit them in this 452 worldly life nor in the Hereafter. (He is the Mighty) in retribution against those who worship them, (the Wise) He decreed that none should be worshipped except Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n آمراً لحبيبه صلى الله عليه وسلم: قل لهم يا أكمل الرسل: { إِنَّ ٱللَّهَ } المطلع لضمائر عباده وسرائرهم { يَعْلَمُ } بعلمه الحضوري { مَا يَدْعُونَ } وتعبدون { مِن دُونِهِ مِن شَيْءٍ } من الأصنام والأوثان على التفصيل\n إذ لا يعزب عن حيطة علمه شيء مما ظهر وبطن وخفي وعلم\n ولكن يمهلهم ويؤخر أخذهم بها زماناً\n لحكم ومصالح استأثر الله بها ولم يطلع أحداً عليها { وَ } كيف لا يأخذهم بما صدر عنهم إنه { هُوَ ٱلْعَزِيزُ } الغالب القادر على الانتقام بالقوى الكاملة والبطش الشديد { ٱلْحَكِيمُ } [العنكبوت: 42] المقتن في أفعاله بما لا مزيد عليه\n\n\n{ وَ } إن استهزءوا معك يا أكمل الرسل\n متهكمين بما في كتابك من التمثيلات بأحقر الأشياء وأضعفها مثل: الذباب والعنكبوت والنمل وغيرها لا تبال بهم وبتهكمكم و استهزائهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو العزيزُ } الغالب الذي لا شريك له { الحكيمُ } في ترك المعاجلة بالعقوبة وفيه تجهيل لهم حيث عبدوا جماداً لا علم له ولا قدرة وتركوا عبادة القادر القاهر على كل شيء الحكيم الذي لا يفعل إلا لحكمة وتدبير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:81",
      "similarity": 0.614513598467473
    },
    {
      "verse": "16:20",
      "similarity": 0.5837959126154431
    },
    {
      "verse": "39:1",
      "similarity": 0.5466069781411173
    },
    {
      "verse": "45:2",
      "similarity": 0.5466069781411173
    },
    {
      "verse": "46:2",
      "similarity": 0.5466069781411173
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}