{
  "chapter": "العنكبوت",
  "text": "اتل ما اوحى اليك من الكتب واقم الصلوة ان الصلوة تنهى عن الفحشاء والمنكر ولذكر الله اكبر والله يعلم ما تصنعون",
  "translations": [
    {
      "translation": "Recite what has been revealed to you of this Book, and be constant in devotion. Surely prayer keeps you away from the obscene and detestable, but the remembrance of God is greater far; and God knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), recite the Book that has been revealed to you and establish Prayer. Surely Prayer forbids indecency and evil. And Allah's remembrance is of even greater merit. Allah knows all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), recite to them what has been revealed to you in the Book and be steadfast in prayer; prayer keeps one away from indecency and evil. It is the greatest act of worshipping God. God knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), recite from the Book which has been sent down to you, and establish the prayer; indeed the prayer stops from indecency and evil; and indeed the remembrance of Allah is the greatest; and Allah knows all what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to you of the Book, and perform the Salah. Verily, the Salah prevents from Al-Fahsha' (immoral sins) and Al-Munkar (evil deeds) and the remembering (praising) of Allah is greater indeed. And Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite that which has been revealed to you of the Book and keep up prayer; surely prayer keeps (one) away from indecency and evil, and certainly the remembrance of Allah is the greatest, and Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to thee of the Book, and perform the prayer; prayer forbids indecency and dishonour. God's remembrance is greater; and God knows the things you work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite that which hath been inspired in thee of the Scripture, and establish worship. Lo! worship preserveth from lewdness and iniquity, but verily remembrance of Allah is more important. And Allah knoweth what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to you of the book, and pray regularly. Surely prayer restrains one from indecency and evil and remembrance of God is greater. God has knowledge of all your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite thou that which hath been revealed unto thee of the Book and establish thou the prayer; verily prayer preventeth man from indecency and that which is disreputable: and surely the remembrance of Allah is the greatest. And Allah knoweth that which ye perform.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to you of the Book, and maintain the prayer. Indeed the prayer restrains from indecent and wrongful conduct, and the remembrance of Allah is surely greater. And Allah knows whatever [deeds] you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what is sent of the Book by inspiration to thee, and establish regular Prayer: for Prayer restrains from shameful and unjust deeds; and remembrance of Allah is the greatest (thing in life) without doubt. And Allah knows the (deeds) that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite (O Muhammad SAW) what has been revealed to you of the Book (the Quran), and perform As-Salat (Iqamat-as-Salat). Verily, As-Salat (the prayer) prevents from Al-Fahsha' (i.e. great sins of every kind, unlawful sexual intercourse, etc.) and Al-Munkar (i.e. disbelief, polytheism, and every kind of evil wicked deed, etc.) and the remembering (praising, etc.) of (you by) Allah (in front of the angels) is greater indeed [than your remembering (praising, etc.) Allah in prayers, etc.]. And Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been sent down to you of the Book, and establish the prayer. Prayer forbids indecency and dishonor. The remembrance of Allah is greater, and Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what is revealed to you of the Scripture, and perform the prayer. The prayer prevents indecencies and evils. And the remembrance of God is greater. And God knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite, [O Muhammad], what has been revealed to you of the Book and establish prayer. Indeed, prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater. And Allah knows that which you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:45] Recite what has been revealed to you of the Book, the Qur’ān, and maintain prayer; truly prayer prohibits lewd acts and indecency, [defined as such] according to the Law. In other words, that is its purpose provided that the person adheres to [observance of] it. And the remembrance of God is surely greater, than other acts of obedience, and God knows what you do, and He will requite you for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Recite that which hath been inspired in thee of the Scripture) He says: recite unto them, Muhammad, that which Gabriel brought down to you, i.e. the Qur'an, (and establish worship) fulfil the five daily prayers. (Lo! worship preserveth from lewdness) transgressions (and iniquity) that which is unknown in the Shari'ah or Sunnah; as long as one performs the prayers, they will prevent one from lewdness and iniquity, (but verily remembrance of Allah is more important) He says: Allah's remembrance of you, through His forgiveness and reward, is greater than your remembrance of Him during the prayer. (And Allah knoweth what ye do) whether it is good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ اتل ما أوحي إليك من الكتاب وأقم الصلاة } أي: فصّل ما أجمل فيك من كتاب العقل القرآني بسبب الوحي ونزول كتاب العلم الفرقاني، وأقم الصلاة المطلقة على ترتيب تفاصيل التلاوة والعلوم\n ومعناه: اجمع بين الكمال العلميّ والعمل المطلق، فإن لك بحسب كل علم صلاة وكما أن العلوم إما نافعة تتعلق بالآداب والأعمال وإصلاح المعاش وهي علوم القوى من غيب الملكوت الأرضية، وإما شريفة تتعلق بالأخلاق والفضائل وإصلاح المعاد وهي علوم النفس من غيب الصدر والعقل العلمي، وإما كلية يقينية تتعلق بالصفات وهي على نوعين: عقلية نظرية وكشفية سريّة، وكلاهما من غيب القلب والسرّ\n وإما حقيقية تتعلق بالتجليات والمشاهدات، وهي من غيب الروح، وإما ذوقية لدنية تتعلق بالعشقيات والمواصلات وهي من غيب الخفاء\n وإما حقيّة من غيب الغيوب\n وبحسب كل علم صلاة، فالأولى هي الصلاة البدنية بإقامة الأوضاع وأداء الأركان، والثانية صلاة النفس بالخضوع والخشوع والانقياد والطمأنينة بين الخوف والرجاء، والثالثة صلاة القلب بالحضور والمراقبة، والرابعة صلاة السرّ بالمناجاة والمكالمة، والخامسة صلاة الروح بالمشاهدة والمعاينة، والسادسة صلاة الخفاء بالمناغاة والملاطفة، ولا صلاة في المقام السابع لأنه مقام الفناء والمحبة الصرفة الفناء في عين الوحدة\n وكما كان نهاية الصلاة الظاهرة وانقطاعها بظهور الموت الذي هو ظاهر اليقين وصورته كما قيل في تفسير قوله تعالى:\n\n[الحجر، الآية:99]، فكذلك انتهاء الصلاة الحقيقية بالفناء المطلق الذي هو حق اليقين\n وأما في مقام البقاء بعد الفناء فيتجدّد جميع الصلوات الست مع سابعة وهي صلاة الحق بالمحبة والتفريد\n { إنّ الصلاة تنهى عن الفحشاء والمُنْكر } فالصلاة البدنية تنهى عن المعاصي والسيئات الشرعية، وصلاة النفس تنهى عن الرذائل والأخلاق الرديئة والهيئات المظلمة، وصلاة القلب تنهى عن الفضول والغفلة، وصلاة السرّ تنهى عن الالتفات إلى الغير والغيبة، كما قال عليه السلام:\n\n \" لو علم المصلي من يناجي ما التفت \" \n\nوصلاة الروح عن الطغيان بظهور القلب بالصفات كنهي صلاة القلب عن ظهور النفس بها، وصلاة الخفاء عن الاثنينية وظهور الأنائية، وصلاة الذات تنهى عن ظهور البقية بالتلوين وحصول المخالفة في التوحيد { ولذكر الله أكبر } الذي هو ذكر الذات في مقام الفناء المحض، وصلاة الحق عند التمكين في مقام البقاء أكبر من جميع الأذكار والصلوات { والله يعلم ما تصنعون } في جميع المقامات والأحوال والصلوات\n { ولا تجادلوا أهل الكتاب إلاّ بالتي هي أحسن } إنما منع المجادلة مع أهل الكتاب إلا بالطريقة التي هي أحسن لأنهم ليسوا محجوبين عن الحق بل عن الدين، فهم أهل استعداد ولطف لا أهل خذلان وقهر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱتْلُ } يا أكمل الرسل { مَا أُوْحِيَ إِلَيْكَ مِنَ ٱلْكِتَابِ } الجامع لما في النشأتين، الحاوي لجميع الأمور الجارية في المنزلتين، وتأمل في مرموزاته وإشارته حق التأمل والتدبر واتصف بأوامره واجتنب عن نواهيه، واعتبر عن عبره وأمثاله وذق حلاوة معارفه وحقائقه { وَأَقِمِ ٱلصَّلاَةَ } أي: دوام على الميل المقرب إلى الله بجميع جوارحك وأركانك بالانخلاع عن لوازم ناستوك مطلقاً { إِنَّ ٱلصَّلاَةَ } على الوجه المذكور { تَنْهَىٰ } وتكف صاحبه { عَنِ ٱلْفَحْشَآءِ } المترتبة عن القوى البهيمية من الشهوية والغضبية { وَٱلْمُنْكَرِ } المترتب على البشرية المنغمسة بالعلائق المادية والشواغل الجسمانية { وَ } بالجملة: { لَذِكْرُ ٱللَّهِ } المنزه في ذاته عن جميع الأكوان، المبرئ أوصافه وأسماءه عن وصمة النقصان وسمة الحدوث والإمكان، والاشتغال بذكره حسب إطلاقه { أَكْبَرُ } شمولاً وأتم توجهاً وأكمل حصولاً ووصولاً لو جذبتك العناية من لدن جنابه ووفقك التوفيق منه نحو بابه { وَ } كن يا أكمل الرسل في نفسك متوجهاً إلى ربك، متقرباً إليه على الوجه الذي أمرت به، ولا تلتفت إلى هذيانات أهل البدع والأهواء الفاسدة؛ إذ { ٱللَّهُ } المطلع بجميع حالاتهم { يَعْلَمُ } منهم { مَا تَصْنَعُونَ } [العنكبوت: 45] من الاستخفاف الاستهزاء وعدم المبالاة بمعالم الدين ومراسم التوحيد واليقين، فيجازيهم على مقتضى علمه بهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { اتْلُ ما أُوحي إليك من الكتابِ } تَنَعُّماً بشهود أسرار معانيه، وبشهود المتكلم به، فتغيب عن كل ما سواه، واستكشافاً لحقائقه، فإن القارئ المتأمل قد ينكشف له بالتكرار ما لم ينكشف له أول ما قرع سمعه\n وقد كان من السلف من يبقى في السورة يكررها أياماً، وفي الآية يرددها ليلة وأكثر، كلما رددها ظهر له معان أُخر\n { وأَقِم الصلاةَ } أي: دم على إقامتها، بإتقانها فعلاً وحضوراً وخشوعاً، { إن الصلاةَ تنهى عن الفحشاء } الفعلة القبيحة كالزنى، والشرب، ونحوهما، { والمنكرِ } ، وهو ما يُنكره الشرع والعقل\n ولا شك أن الصلاة، إذا صحبها الخشوع والهيبة في الباطن، والإتقان في الظاهر، نهت صاحبها عن المنكر، لا محالة، وإلا فلا\n رُوي أن فتًى من الأنصار كان يصلي مع رسول الله الصلوات، ولا يدع شيئاً من الفواحش إلا ركبه، فَوُصِفَ حَالُهُ له صلى الله عليه وسلم فقال:\n\n \" إن صلاته تنهاه \" \n\n، فلم يلبث أن تاب\n هـ\n وأما من كان يصليها فلم تنهه فهو دليل عدم قبولها، ففي الحديث:\n\n \" من لمْ تَنْهَهُ صَلاتُهُ عن الفحشاء والمنكر لم يَزْدَدْ من الله إلا بُعْداً \" \n\nرواه الطبراني\n وقال الحسن: من لم تنهه صلاته عن الفحشاء والمنكر فليست بصلاة، وهي بال عليه\n وقال ابن عوف: إن الصلاة تنهى إذا كنت فيها فأنت في معروف وطاعة، وقد حجزتك عن الفحشاء والمنكر\n هـ\n فخص النهي بكونه ما دام فيها، وعليه حَمَلَهُ المَحلِّي\n قال المحشي: يعني: أن مِنْ شأنها ذلك، وإن لم يحصل ذلك فلا تخرج عن كونها صلاة، كما أن من شأن الإيمان التوكل، وإن قدر أن أحداً من المؤمنين لا يتوكل فلا يخرج ذلك عن الإيمان\n وقيل: الصلاة الحقيقية: ما تكون لصاحبها ناهيةً عن ذلك، وإن لم ينته فالصلاةُ ناهيةٌ على معنى: ورود الزواجر على قلبه، ولكنه أصر ولم يطع\n ويقال: بل الصلاة الحقيقية ما تنهى صاحبها عن الفحشاء والمنكر، فإن كان، وإلا فصورة الصلاة لا حقيقتها\n انظر القيشيري\n وقال ابن عطية: إذا وقعت على ما ينبغي من الخشوع، والإخبات لذكر عظمة الله، والوقوف بين يديه، انتهى عن الفحشاء والمنكر، وأما مَنْ كانت صلاته لا ذكر فيها ولا خشوع، فتلك تترك صاحبها بمنزلته حيث كان\n هـ\n فائدة: ذكر في اللباب أن أول من صلى الصبح آدم عليه السلام، لأنه لم يكن رأى ظلمة قط، فلما نزل، وجنَّه الليل خرّ مغشياً، فلما أصبح ورأى النور صلى ركعتين، شكراً\n وأول من صلى الظهر إبراهيم، لما فدى ولده، وقد كان نزل به أربعة أهوال، هم الذبح وهم الولد، وهم والدته، وهم مرضاة الرب، فصلى أربع ركعات، شكراً لله تعالى\n\n\nوأول من صلى العصر سليمان عليه السلام، لمَّا رد الله عليه ملكه\n وأول من صلى المغرب عيسى عليه السلام، كفارة عما اعتقد فيه من أنه ثالث ثلاثة\n وأول من صلى العشاء يونس عليه السلام، ولعله هذا الوقت الذي نُبذ فيه بالعراء\n وأول من توضأ آدم كفارة لأكله\n هـ\n مختصراً بزيادة بيان\n وجمعها الحق تعالى لهذه الأمة المحمدية لتحوز فضائل تلك الشرائع لأنه صلى الله عليه وسلم جَامِعٌ لِمَا افْتَرَقَ في غيره\n ثم قال تعالى { ولذكرُ الله أكبرُ } ، أي: ولذكر الله، على الدوام، أكبر، في النهي من الفحشاء والمنكر، من الصلاة لأنها في بعض الأوقات\n فالجزء الذي في الصلاة ينهى عن الفحشاء الظاهرة، والباقي ينهى عن الفحشاء الباطنة، وهو أعظم، ولأن الانتهاء لا يكون إلا من ذاكرٍ لله، مراقبٍ له، وثواب ذلك الذكر أن يذكر الله تعالى لقوله:\n\n[البقرة: 152]\n ومن ذَكَرَه حَفِظَهُ ورعاه\n أو: لذكر الله أكبر أجراً، من الصلاة، ومن سائر الطاعات، كما في الحديث:\n\n \" ألا أنبئكم بخيرِ أعمالكمْ، وأزكْاهَا عند مليككم، وأرفَعِهَا في درجاتكم، وخيرٍ لكم من إنفاق الذهب والوَرِق، وخيرٍ لكم من أن تَلْقَوْا عدوكم فتضربُوا أعناقهم ويضربوا اعناقكمْ؟ قالوا: وما ذلك يا رسول الله؟ قال ذِكْرُ الله \" \n\nوسئل أي الأعمال أفضل؟ قال:\n\n \" أن تموتَ ولسانُكَ رَطْبٌ من ذكر الله \" \n\nقيل: المراد بذكر الله هو الصلاة نفسها، أي: وَللصلواتُ أكبر من سائر الطاعات، وإنما عبّر عنها بذكر الله ليشعر بالتعليل، كأنه قال: والصلاة أكبر لأنها ذكر الله\n وعن ابن عباس: ولذكر الله لكم إياكم، برحمته، أكبر من ذكركم إياه بطاعته\n وقال ابن عطاء ذكر الله لكم أكبر من ذكركم له لأن ذكره بلا علة، وذكركم مشوب بالعلل والأماني، ولأن ذكره لا يفنى، وذكركم يفنى\n أو: لذكر الله أكبر من أن تفهمه أفهامكم وعقولكم\n أو: ذكر الله أكبر من أن تبقى معه معصية\n { والله يعلم ما تصنعون } من الخير والطاعة، فيثيبكم أحسن الثواب\n والله تعالى أعلم\n الإشارة: الصلاة تنهى عن الفحشاء والمنكر المتعلِّقَيْنِ بالجوارح الظاهرة، والذكر ينهى عن الفحشاء والمنكر والمتعلقين بالعوالم الباطنة، وهي المساوئ التي تحجب العبد عن حضرة الغيوب فإذا أكثر العبد من ذكر الله، على نعت الحضور والتفرغ من الشواغل، تنور قلبه، وتطهر سره ولُبه، فاتصف بأوصاف الكمال، وزالت عن جميع العلل، ولذلك جعلته الصوفية مُعْتَمَدَ أعمالِهِمْ، والتزموه مع مرور أوقاتهم وأنفاسهم، ولم يقتنعوا منه بقليل ولا كثير، بل قاموا بالجد والتشمير، فيذكرون أولاً بلسانهم وقلوبهم، ثم بقلوبهم فقط، ثم بأرواحهم وأسرارهم فيغيبون حينئذٍ في شهود المذكور عن وجودهم وعن ذكرهم، وفي هذا المقام ينقطع ذكر اللسان، ويصير العبد محواً في وجود العيان، فتكون عبادتهم كلها فكرة وعبرة، وشهوداً ونظرة، وهو مقام العيان في منزل الإحسان، فيكون ذكر اللسان عندهم بطالة، وفي ذلك يقول الشاعر:\n\n\n\nقال القشيري: ويقال: ذكر الله أكبر من أن يبقى معه ذكر مخلوق أو معلوم للعبد، فضلاً أن يبقى معه للفحشاء والمنكر سلطان\n هـ\n وقال في القوت على هذه الآية: الذكر عند الذاكرين: المشاهدة، فمشاهدة المذكور في الصلاة أكبر من الصلاة\n هذا أحد الوجهين في الآية: ثم قال: ورُوي في معنى الآية عن رسول لله صلى الله عليه وسلم أنه قال:\n\n \" إنما فرضت الصلاة، وأمر بالحج والطواف،وأشعرت المناسك، لإقامة ذكر الله - عز وجل - \" \n\nقال تعالى:\n\n[طه: 14]، أي: لتذكرني فيها\n ثم قال: فإذا لم يكن في قلبك للمذكور، الذي هو المقصود والمُبْتغى، عظمة ولا هيبة، ولا إجلالُ مقامٍ، ولا حلاوة فهْم، فما قيمة ذكرك فإنما صلاتك كعمل من أعمال دنياك\n وقد جعل الرسول صلى الله عليه وسلم الصلاة قسماً من اقسام الدنيا، إذ كان المصلي على مقام من الهوى، فقال:\n\n \" حُبب إليَّ من دنياكم\n\n \" \n\nذكر منها الصلاة، فهي دنيا لمن كان همه الدنيا، وهي آخرة لأبناء الآخرة، وهي صلة ومواصلة لأهل الله - عز وجل-، وإنما سميت الصلاة لأنها صلة بين الله وعبده، ولا تكون المواصلة إلا لتقي، ولا يكون التقي إلا خاشعاً، فعند هذا لا يعظم عليه طول القيام، ولا يكبر عليه الانتهاء عن المنكر كما قال الله: { إن الصلاة تنهى عن الفحشاء والمنكر }\n هـ\n ثم ذكر ما ينتج عن الصلاة الكاملة والذكر الدائم وهو الخلق الجميل فوصّى به، حيث قال: { وَلاَ تُجَادِلُوۤاْ أَهْلَ ٱلْكِتَابِ\n\n\n }\n",
      "translations": []
    }
  ]
}