{
  "chapter": "العنكبوت",
  "text": "قل كفى بالله بينى وبينكم شهيدا يعلم ما فى السموت والارض والذين ءامنوا۟ بالبطل وكفروا۟ بالله او۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "Say: \"God is sufficient as witness between me and you.\" He knows what is in the heavens and the earth. It is those who believe in falsehood and disbelieve in God who will perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Prophet): “Allah suffices as a witness between me and you. He knows whatever is in the heavens and the earth. As for those who believe in falsehood and are engaged in infidelity with Allah, it is they who will be the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"God is sufficient as a witness between me and you. He knows all that is in the heavens and the earth.\" Those who have faith in falsehood and disbelieve in God are certainly lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Allah is Sufficient as a Witness between me and you; He knows all what is in the heavens and in the earth; and those who accepted faith in falsehood and denied faith in Allah – it is they who are the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Sufficient is Allah for a witness between me and you. He knows what is in the heavens and on the earth.\" And those who believe in falsehood, and disbelieve in Allah, it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Allah is sufficient as a witness between me and you; He knows what is in the heavens and the earth. And (as for) those who believe in the falsehood and disbelieve in Allah, these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'God suffices as a witness between me and you.' He knows whatsoever is in the heavens and earth. Those who believe in vanity and disbelieve in God -- those, they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): Allah sufficeth for witness between me and you. He knoweth whatsoever is in the heavens and the earth. And those who believe in vanity and disbelieve in Allah, they it is who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"God is sufficient as a witness between you and me. He knows all that is in the heavens and the earth. Those who believe in falsehood and reject God will surely be the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: Allah sufficeth for witness between me and you: He knoweth whatsoever is in the heavens and the earth. And they who believe in falsehood and disbelieve in Allah, those: they shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Allah suffices as a witness between me and you: He knows whatever there is in the heavens and the earth. Those who put faith in falsehood and defy Allah—it is they who are the losers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Enough is Allah for a witness between me and you: He knows what is in the heavens and on earth. And it is those who believe in vanities and reject Allah, that will perish (in the end).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to them O Muhammad SAW): \"Sufficient is Allah for a witness between me and you. He knows what is in the heavens and on earth.\" And those who believe in Batil (all false deities other than Allah), and disbelieve in Allah and (in His Oneness), it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Allah suffices as a witness between me and you. He knows whatsoever is in the heavens and the earth. Those who believe in falsehood and disbelieve in Allah those are they who are the losers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “God suffices as witness between you and me. He knows everything in the heavens and the Earth. Those who believe in vanity and reject God—it is they who are the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Sufficient is Allah between me and you as Witness. He knows what is in the heavens and earth. And they who have believed in falsehood and disbelieved in Allah - it is those who are the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:52] Say: ‘God suffices as a witness between me and you’, of my sincerity. He knows whatever is in the heavens and the earth, including my circumstances and yours. And those who believe in falsehood, namely, all that is worshipped besides God, and [who] disbelieve in God, from among you — those, they are the losers, in their bargain, for they have purchased disbelief in return for faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Allah sufficeth for witness between me and you) that I am His Messenger. (He knoweth whatsoever is in the heavens and the earth) of created beings. (And those who believe in vanity) in the devil (and disbelieve in Allah, they it is who are the losers) who will be tormented, i.e. Abu Jahl and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أتى قوم من ضعفاء المسلمين إلى رسول الله صلى الله عليه وسلم بكتف رُقم فيها بعض أراجيف اليهود وأقوايلهم الكاذبة، متبركين بها، متيمنين بما فيها، فقال صلى الله عليه وسلم مبغضاً عليهم: كفى بضلالة قوم أن يرغبوا عما جاءهم به نبيهم من قبل ربهم إلى ما جاء به غير نبيهم، وصدقوا ما جاء به غير نبيهم مع أنه كذب مفترى، وكذبوا ما جاء به النبي مع أنه صدق مطابق للواقع، فنزلت حينئذ تسلية لرسول الله صلى الله عليه وسلم: { قُلْ } يا أكمل الرسل للمكذبين لك وبما جئت به مصدقين لأعدائك وبما جاءوا به: { كَفَىٰ بِٱللَّهِ بَيْنِي وَبَيْنَكُمْ } أيها المكابرون { شَهِيداً } حاضراً معي ومعكم مطلقاً، على حالي وحالكم وما جرى في ضميري وضمائركم؛ إذ هو سبحانه { يَعْلَمُ } بعلمه الحضوري جميع { مَا } ظهر { فِي ٱلسَّمَٰوَ } ما ظهر في { ٰتِ وَٱلأَرْضِ } وكذا ما ظهر بينهما ما بطن فيهما، فيجازي كلاً منا ومنكم على مقتضى علمه بنا وبكم\n\n\n{ وَ } كيف لا يجازي القادر المقتدر على انتقام عصاة عباده { ٱلَّذِينَ آمَنُواْ } وأطاعوا { بِٱلْبَاطِلِ } الذي هو بمراحل عن الحق والصدق { وَكَفَرُواْ بِٱللَّهِ } الحق الحقيق بالحقية، المستوي على منهج الصدق والصواب، وأعرضوا عن إطاعته وانقياده عناداً وكابرةً، وبالجملة: { أُوْلَـٰئِكَ } البعداء المطرودون عن ساحة عز الحضور، والأشقياء المحرومون عن سعة رحمة الملك الغفور { هُمُ ٱلْخَاسِرُونَ } [العنكبوت: 52] المقصورون على الخسران الخذلان، لا يُرجى ربحهم وتفريجهم أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}