{
  "chapter": "العنكبوت",
  "text": "يوم يغشىهم العذاب من فوقهم ومن تحت ارجلهم ويقول ذوقوا۟ ما كنتم تعملون",
  "translations": [
    {
      "translation": "On the Day the punishment envelops them from above them and from underneath their feet, He will say, 'Taste what you were doing!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the punishment comes upon them from above and underneath their feet, (God will) say: \"And now taste of what you had done.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will become aware of it) the Day when the chastisement will overwhelm them from above and from under their feet, and He will say to them: “Taste now the consequence of the deeds that you used to commit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told on the Day of Judgment, when the torment will surround them from all sides, \"Suffer the consequences of your deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the punishment will envelop them from above them and from below their feet, and He will say, “Taste the flavour of your deeds!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the torment shall cover them from above them and from beneath their feet, and it will be said: \"Taste what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the chastisement shall cover them from above them, and from beneath their feet; and He shall say: Taste what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day the chastisement shall overwhelm them from above them and from under their feet, and He shall say, 'Taste now what you were doing!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the doom will overwhelm them from above them and from underneath their feet, and He will say: Taste what ye used to do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the punishment envelops them from above them and from underneath their feet, they will be told, \"Taste [the punishment] for what you used to do!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon the torment shall cover them from above them and from underneath their feet, and He shall say: taste that which ye have been working!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when the punishment envelopes them, from above them and from under their feet, and He will say, ‘Taste what you used to do!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day that the Punishment shall cover them from above them and from below them, and (a Voice) shall say: \"Taste ye (the fruits) of your deeds!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the torment (Hell-fire) shall cover them from above them and from underneath their feet, and it will be said: \"Taste what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the punishment shall cover them from above them and from beneath their feet, He shall say: 'Taste now what you were doing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the punishment will envelop them, from above them, and from beneath their feet, He will say, “Taste what you used to do!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the punishment will cover them from above them and from below their feet and it is said, \"Taste [the result of] what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:55] on the Day when the chastisement shall envelop them from above them and from under their feet, and We shall say, thereat (read [the verb] as naqūlu, in other words, ‘We shall command that it be said; or [if read] yaqūlu, ‘he shall say’, namely, the one in charge of [meting out] chastisement), ‘Taste now what you used to do!’, that is, [taste] the requital for it, as you will not be able to elude Us.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when the doom will overwhelm them) will seize them (from above them) from above their heads (and from beneath their feet) upon being cast in the Fire, (and He will say) to them: (Taste what ye used to do) because of what you used to do and say in your state of disbelief!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل { يَوْمَ يَغْشَاهُمُ ٱلْعَذَابُ } في الآخرة، كغشي أسبابها التي هي عبارة من لوازم الإمكان إياهم اليوم { مِن فَوْقِهِمْ وَمِن تَحْتِ أَرْجُلِهِمْ } أي: من أعلاهم وأسفلهم، ومحيطاً بجميع جوانبهم { وَيِقُولُ } قائل من قِبَل الحق زاجراً لهم وتوبيخاً: { ذُوقُواْ } أيها المستكبرون المصرون على الكفر والعناد جزاء { مَا كُنْتُمْ تَعْمَلُونَ } [العنكبوت: 55] أيها المعاندون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:54",
      "similarity": 0.4719322172137332
    },
    {
      "verse": "44:11",
      "similarity": 0.44438222859423343
    },
    {
      "verse": "7:41",
      "similarity": 0.44416230604783974
    },
    {
      "verse": "91:4",
      "similarity": 0.43366163765603943
    },
    {
      "verse": "92:1",
      "similarity": 0.43366163765603943
    }
  ]
}