{
  "chapter": "العنكبوت",
  "text": "والذين ءامنوا۟ وعملوا۟ الصلحت لنبوئنهم من الجنة غرفا تجرى من تحتها الانهر خلدين فيها نعم اجر العملين",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions, We will lodge them in lofty chambers in the Garden, with rivers flowing under them, remaining in them timelessly, for ever. How excellent is the reward of those who act:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall admit those who believe and do the right to empyreal gardens with rivers rippling by, where they will abide for ever. How excellent the guerdon of those who toil,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall house those who believed and acted righteously in the lofty mansions of Paradise beneath which rivers flow. There they shall remain for ever. How excellent a reward it is for those who acted (in obedience to Allah),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall give mansions in Paradise wherein streams flow to the righteously striving believers and therein they will live forever. How blessed is the reward of the hard working people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did good deeds – indeed We will, surely, place them on high positions in Paradise beneath which rivers flow, abiding in it for ever; what an excellent reward of the performers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do righteous good deeds, to them We shall surely give lofty dwellings in Paradise, beneath which rivers flow, to live therein forever. Excellent is the reward for the workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and do good, We will certainly give them abode in the high places in gardens beneath which rivers flow, abiding therein; how good the reward of the workers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe, and do righteous deeds, We shall surely lodge them in lofty chambers of paradise, underneath which rivers flow, therein dwelling forever; and excellent is the wage of those who labour,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do good works, them verily We shall house in lofty dwellings of the Garden underneath which rivers flow. There they will dwell secure. How sweet the guerdon of the toilers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall lodge forever those who believe and do good works in the mansions of Paradise beside which rivers flow. How excellent is the reward of those who labour,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and work righteous works--them We shall surely settle in lofty dwellins of the; they shall be of the Garden whereunder the rivers flow; they shall be abiders therein. Excellent is the hire of the Workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have faith and do righteous deeds, We will surely settle them in the lofty abodes of paradise, with streams running in them, to remain in them [forever]. How excellent is the reward of the workers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and work deeds of righteousness - to them shall We give a Home in Heaven,- lofty mansions beneath which flow rivers,- to dwell therein for aye;- an excellent reward for those who do (good)!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, to them We shall surely give lofty dwellings in Paradise, underneath which rivers flow, to live therein forever. Excellent is the reward of the workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do good deeds We shall lodge them in the rooms of Paradise underneath which rivers flow, therein living for ever, an excellent wage for those who labor,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and work righteousness—We will settle them in Paradise, in mansions under which rivers flow, dwelling therein forever. Excellent is the compensation for the workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have believed and done righteous deeds - We will surely assign to them of Paradise [elevated] chambers beneath which rivers flow, wherein they abide eternally. Excellent is the reward of the [righteous] workers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:58] And those who believe and perform righteous deeds, We shall surely lodge them, We shall give them residence (a variant reading has nuthwiyannahum, [derived] from thawā’, ‘residence’; the transitive link to the indirect object ghurafan is made without [the preposition] fī, ‘in’) in lofty abodes of Paradise, underneath which rivers flow, to abide, decreed for them to live forever, in them — excellent is, this reward as, the reward of the toilers;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and perform acts of 454 obedience between themselves and their Lord, (them verily We shall house in lofty dwellings of the Garden underneath which) beneath its trees and dwellings (rivers) rivers of wine, water, honey and milk (flow. There they will dwell secure) they will dwell therein forever. (How sweet the guerdon of the toilers) the reward of those who do good,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مخلصين فيها إلينا { لَنُبَوِّئَنَّهُمْ } وننزلنَّهم تفضلاً منا إياهم وتكريماً { مِّنَ ٱلْجَنَّةِ } المعدة لأرباب المعرفة التوحيد { غُرَفَاً } أي: لكل منهم غرفة معينة تصير له مقراً ومنزلاً { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق\n والمكاشفات والمشاهدات على تفاوت طبقاتهم وقدر قابليتهم { خَالِدِينَ فِيهَا } دائمين\n غير متحولين عنها أصلاً { نِعْمَ أَجْرُ ٱلْعَامِلِينَ } [العنكبوت: 58] الجنة وما فيها\n مما لاعينٌ رأت ولا أذنٌ سمعت\n ولا خطر على قلب بشر\n وهم أُولوا العزائم الصحيحة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:20",
      "similarity": 0.7380924918671182
    },
    {
      "verse": "25:75",
      "similarity": 0.6647988332320844
    },
    {
      "verse": "34:37",
      "similarity": 0.567308512960637
    },
    {
      "verse": "3:136",
      "similarity": 0.3665731702283682
    },
    {
      "verse": "39:74",
      "similarity": 0.3283703409103408
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/29:58.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/29:58.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:58.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}