{
  "chapter": "العنكبوت",
  "text": "يعبادى الذين ءامنوا۟ ان ارضى وسعة فايى فاعبدون",
  "translations": [
    {
      "translation": "My slaves, you who have iman, My earth is wide, so worship Me alone!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My creatures who believe, surely My earth has plenty of scope and so worship only Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who believe, verily My earth is vast; so serve Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My believing servants, My land is vast. Worship Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My bondmen who believe! Indeed My earth is spacious – therefore worship Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who believe! Certainly, spacious is My earth. Therefore worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who believe! surely My earth is vast, therefore Me alone should you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who believe, surely My earth is wide; therefore Me do you serve!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my bondmen who believe! Lo! My earth is spacious. Therefor serve Me only.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My servants who believe, My earth is vast, so worship Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My bondmen, who believe! verily My earth is wide, so Me alone worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who have faith! My earth is indeed vast. So worship [only] Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who believe! truly, spacious is My Earth: therefore serve ye Me - (and Me alone)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My slaves who believe! Certainly, spacious is My earth. Therefore worship Me (Alone).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My worshipers who believe, My earth is vast, therefore worship Me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who have believed: My earth is vast, so worship Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My servants who have believed, indeed My earth is spacious, so worship only Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:56] O My servants who believe! My earth is indeed vast. So worship [only] Me, in whichever land worship is possible, by emigrating to it from a land in which worship is not possible — this [verse] was revealed regarding the oppressed Muslims [living] in Mecca, who were constrained to manifest [their] Islam in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my bondmen who believe) in Muhammad (pbuh) and in the Qur'an! i.e. Abu Bakr, 'Umar, 'Uthman, 'AN and their fellow believers (Lo! My earth) the land of Medina (is spacious) is safe, therefore travel to it. (Therefore serve Me only) obey Me only.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا عبادي الذين آمنوا إن أرضي واسعةً } ، فإذا لم يتيسر لكم إقامةُ دينِكُمْ في بلد، فاخرجوا منها إلى أرض يتهيأ لكم فيها استقامة دينكم، والبقاع تتفاوت في ذلك تفاوتاً كبيراً، والناس مختلفون، فأهل الشرائع يطلبون البقاع التي يتيسر لهم فيها استقامة ظواهرهم، كالمدن والقرى الكبار، التي يكثر فيها العلم وأهله\n وأهل الحقائق من الصوفية يطلبون البقاع التي تسلم فيها قلوبهم من العلائق والشواغل، أينما وجدوها عمروها، إن تهيأ لهم الاجتماع على ربهم\n وعن سهل رضي الله عنه: إذا ظهرت المعاصي والبدع في أرض، فاخرجوا منها إلى أرض المطيعين\n وعن رسول الله صلى الله عليه وسلم:\n\n \" من فرّ بدينه من أرض، إلى أرض وإن كان بشيراً، استوجب الجنة، وكان رفيق إبراهيم ومحمد عليهما السلام \"\n \n\n{ فإياي فاعبدون } أي: فخصوني بالعبادة\n وإياي: مفعول لمحذوف، ومفعول \" اعبدوني \": الياء المحذوفة، أي: فاعبدوا إياي، فاعبدوني\n والفاء: جواب الشرط، محذوف، إذ المعنى، إن أرضي واسعة، فإن لم تخلصوا العبادة لي في أرض، فاخلصوا لي في غيرها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:24",
      "similarity": 0.5474698911183138
    },
    {
      "verse": "20:98",
      "similarity": 0.5268350697339924
    },
    {
      "verse": "2:172",
      "similarity": 0.5158871459942873
    },
    {
      "verse": "34:40",
      "similarity": 0.5060514474242968
    },
    {
      "verse": "39:10",
      "similarity": 0.4291257033458889
    }
  ]
}