{
  "chapter": "العنكبوت",
  "text": "الذين صبروا۟ وعلى ربهم يتوكلون",
  "translations": [
    {
      "translation": "Who persevere and place their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who remained steadfast and put their trust in their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have exercised patience and who have had trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who patiently endured and who rely only upon their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are patient, and put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are patient, and on their Lord do they rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such men as are patient, and put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who persevere, and put their trust in their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who are steadfast and put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who persevere and in their Lord trust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Those who are patient and who put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who persevere in patience, and put their trust, in their Lord and Cherisher.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are patient, and put their trust (only) in their Lord (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who are patient, and put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who endure patiently, and in their Lord they trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who have been patient and upon their Lord rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:59] they are, those who are steadfast, in [enduring] the harm inflicted [upon them] by the idolaters, and in [enduring] the Emigration, in order to make manifest the religion [of Islam], and who put their trust in their Lord, so that He provides for them whence they do not expect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who persevere) who are steadfast in performing the commands of Allah and in facing hardship, (and put their trust in their Lord) and not in anyone other than Him!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ صَبَرُواْ } على جميع مشاق التكاليف ومتاعب الطاعات وأذيات الأعادي، والجلاء من الأوطان ومفارقة الخلان، وغير ذلك مما جرى عليهم من طوارق الحدثان { وَ } مع ذلك هم في جميع حالاتهم، وفي عموم ما جرى عليهم { عَلَىٰ رَبِّهِمْ } لا على غيره من الوسائل والوسائط { يَتَوَكَّلُونَ } [العنكبوت: 59] وينسبون إليه ما ينسبون لا إلى الوسائل والأسباب العادية؛ إذ الكل منه بدأ وإليه يعود، بل الوسائل كلها مطوية عندهم، والأسباب منسية لديهم، بل نظرهم مقصور على المسبب الواحد الأحد، الفرد الصمد، القيوم المطلق الذي\n\n\n\n[الإخلاص: 3-4]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهم { الذين صبروا } على مفارقة الأوطان وأذى المشركين، وعلى المحن والمصائب، ومشاق الطاعات، وترك المحرمات، { وعلى ربهم يتوكلون } ، أي: لم يتوكلوا في جميع ذلك إلا على الله، فكفاهم شأنهم\n وبالله التوفيق\n الإشارة: كل من لم يَتَأَتَّ له جَمْعُ قَلْبِهِ في بلده فليهاجر منها إلى غير، وليسمع قول سيده: { يا عبادي الذين آمنوا إن أرضي واسعة } ، فإن شق عليه مفارقة الأوطان، فليذكر مفارقته للدنيا في أقرب زمان\n وكان الصدِّيق رضي الله عنه لَمَّا هاجر إلى المدينة، وأصابته الحمى، يتسلى بذكر الموت، ويُنشد:\n\nوقد أكثر الناس في الوعظ بالموت وهجومه، نظماً ونثراً، فمن ذلك قول الشاعر:\n\nوقال آخر:\n",
      "translations": []
    }
  ]
}