{
  "chapter": "العنكبوت",
  "text": "من كان يرجوا۟ لقاء الله فان اجل الله لءات وهو السميع العليم",
  "translations": [
    {
      "translation": "As for those who look forward to meeting Allah, Allah's appointed time is certainly coming. He is the All- Hearing, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who hopes to meet God (should know) that God's appointed time will surely come. He is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let him who looks forward to meeting Allah know that Allah's appointed term will surely come to pass. He is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who have the desire to be in the presence of God on the Day of Judgment know that their day will certainly be coming. God is All-Hearing and All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever expects to meet Allah – then indeed the time appointed by Allah will come; and He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever hopes in meeting with Allah, then Allah's term is surely coming, and He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever hopes to meet Allah, the term appointed by Allah will then most surely come; and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso looks to encounter God, God's term is coming; He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso looketh forward to the meeting with Allah (let him know that) Allah's reckoning is surely nigh, and He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who hopes to meet God should know that God's appointed hour is sure to come. He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever hopeth for the meeting with Allah, then Allah's term is surely coming, and He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever expects to encounter Allah [should know that] Allah’s [appointed] time will indeed come, and He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those whose hopes are in the meeting with Allah (in the Hereafter, let them strive); for the term (appointed) by Allah is surely coming and He hears and knows (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever hopes for the Meeting with Allah, then Allah's Term is surely coming. and He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who hopes to meet Allah (must know) that the term of Allah is coming. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever looks forward to the meeting with God—the appointed time of God is coming. He is the All-Hearing, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever should hope for the meeting with Allah - indeed, the term decreed by Allah is coming. And He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:5] Whoever expects to encounter God, [should know that] God’s [appointed] term, for this [encounter], will indeed come; so let him prepare for it. And He is the Hearer, of the sayings of His servants, the Knower, of their actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَنْ كَانَ يَرْجُو لِقَاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآَتٍ وَهُوَ السَّمِيعُ الْعَلِيمُ (5)هذا مسوق للمؤمنين خاصة لأنهم الذين يرجون لقاء الله ، فالجملة مفيدة التصريح بما أومأ إليه قوله { أن يسبقونا } \\[ العنكبوت : 4 \\] من الوعد بنصر المؤمنين على عدوّهم مبينة لها ولذلك فصلت . ولولا هذا الوقع لكان حق الإخبار بها أن يجيء بواسطة حرف العطف . ورجاء لقاء الله : ظنّ وقوع الحضور لحساب الله .و { لقاء الله } : الحشر للجزاء لأن الناس يتلقون خطاب الله المتعلق بهم ، لهم أو عليهم ، مباشرة بدون واسطة ، وقد تقدم في قوله { الذين يظنون أنهم ملاقوا ربهم } \\[ البقرة : 46 \\] وقوله { واعلموا أنكم ملاقوه } في سورة \\[ البقرة : 223 \\] .و { أجل الله } يجوز أن يكون الوقت الذي عينه الله في علمه للبعث والحساب فيكون من الإظهار في مقام الإضمار ، ومقتضى الظاهر أن يقال : فإنه لآتتٍ فعدل إلى الإظهار كما في إضافة { أجل } إلى اسم الجلالة من الإيماء إلى أنه لا يخلف . والمقصود الاهتمام بالتحريض على الاستعداد . ويجوز أن يكون المراد ب { أجل الله } الأجل الذي عيَّنه الله لنصر المؤمنين وانتهاء فتنة المشركين إياهم باستئصال مساعير تلك الفتنة ، وهم صناديد قريش وذلك بما كان من النصر يوم بدر ثم ما عقبه إلى فتح مكة فيكون الكلام تثبيتاً للرسول صلى الله عليه وسلم وللمؤمنين حين استبطأ المؤمنون النصر للخلاص من فتنة المشركين حتى يعبدوا الله لا يفتنوهم في عبادته . والمعنى عليه : إن كنتم مؤمنين بالبعث إيقاناً ينبعث من تصديق وعد الله به فإن تصديقكم بمجيء النصر أجدر لأنه وعدكم به ، ف { من } شرطية ، وجعل فعل الشرط فعل الكون للدلالة على تمكن هذ الرجاء من فاعل فعل الشرط .ولهذا كان قوله { فإن أجل الله لآت } جواباً لقوله { من كان يرجو لقاء الله } باعتبار دلالته على الجواب المقدر ليلتئم الربط بين مدلول جملة الشرط ومدلول جملة الجزاء . ولولا ذلك لاختلّ الربط بين الشرط والجزاء إذ يفضي إلى معنى من لم يكن يرجو لقاء الله فإن أجل الله غير آتتٍ . وهذا لا يستقيم في مجاري الكلام فلزم تقدير شيء من باب دلالة الاقتضاء .وتأكيد جملة الجزاء بحرف التوكيد على الوجه الأول للتحريض والحث على الاستعداد للقاء الله ، وعلى الوجه الثاني لقصد تحقيق النصر الموعود به تنزيلاً لاستبطائه منزلة التردد لقصد إذكاء يقينهم بما وعد الله ولا يوهنهم طول المدة الذي يضخمه الانتظار . وبهذا يظهر وقع التذييل بوصفي { السميع العليم } دون غيرهما من الصفات العُلَى للإيماء بوصف { السميع } إلى أن الله تعالى سمع مقالة بعضهم من الدعاء بتعجيل النصر كما أشار إليه قوله تعالى { وزلزلوا حتى يقول الرسول والذين ءامنوا معه متى نصر الله } \\[ البقرة : 214 \\] . وكقول النبي صلى الله عليه وسلم«اللهم أنججِ عياش بن أبي ربيعة اللهم أنج الوليد بن الوليد اللهم أنج سلمة بن هشام اللهم أنج المستضعفين من المؤمنين ، اللهم اشدد وطأتك على مضر اللهم اجعلها عليهم سنين كسنين يوسف» .والإيماء بوصف { العليم } إلى أن الله علم ما في نفوسهم من استعجال النصر ولو كان المراد من { أجل الله } الموتَ لَمَا كان وجه للإعلام بإتيانه بَلْهَ تأكيده ، وكذا لو كان المراد منه البعث لكان قوله { من كان يرجو لقاء الله } كافياً ، فهذا وجه ما أشارت إليه الآيات بالمنطوق والاقتضاء ، والعدول بها عن هذا المهيع وإلى ما في «الكشاف» و«مفاتيح الغيب» أخذاً من كلام أبي عبيدة تحويل لها عن مجراها وصرف كلمة الرجاء عن معناها وتفكيك لنظم الكلام عن أن يكون آخذاً بعضه بحُجز بعض .وإظهار اسم الجلالة في جملة { فإن أجل الله لآت } مع كون مقتضى الظاهر الإضمار لتقدم اسم الجلالة في جملة الشرط { من كان يرجو لقاء الله } لئلا يلتبس معاد الضمير بأن يُعاد إلى { من } إذ المقصود الإعلام بأجل مخصوص وهو وقت النصر الموعود كما في قوله تعالى { ويقولون متى هذا الوعد إن كنتم صادقين قل لكم ميعاد يوم لا تستأخرون عنه ساعة ولا تستقدمون } \\[ سبأ : 29 ، 30 \\] .وعبّر بفعل الرجاء عن ترقب البعث لأن الكلام مسوق للمؤمنين وهم ممن يرجو لقاء الله لأنهم يترقبون البعث لما يأملون من الخيرات فيه . قال بلال رضي الله عنه حين احتضاره متمثلاً بقول بعض الأشعريين الذين وفدوا على النبي صلى الله عليه وسلمغداً ألقَى الأحبهْ ... محمداً وصحبهْ\n\n",
      "translations": [
        {
          "translation": "(Whoso looketh forward to) whoever fears (the meeting with Allah (let him know that) Allah's reckoning) resurrection after death (is surely nigh) will surely happen, (and He is the Hearer) of what both parties said on the Day of Badr, (the Knower) of that which befalls them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { مَن كَانَ يَرْجُواْ } ويأمل { لِقَآءَ ٱللَّهِ } المتجلي على الأكوان حسب أسمائه العلية وصفاته السنية\n ويترصد أن ينكشف له ما هو الموعود من لدنه سبحانه من الدرجات العلية والمقامات السنية حال كونه متأدباً بالآداب المنزلة من عنده بواسطة أنبيائه ورسله\n متحملاً على متاعب التكاليف ومشاق الطاعات المفروضة المشروعة له\n مترقباً للانكشاف والشهود\n راجياً لقياه بلا يأس وقنوط\n فاز بمبتغاه على الوجه الذي وُعد بعدما وفقه الحق وجذبه إلى نفسه { فَإِنَّ أَجَلَ ٱللَّهِ } الذي وعده لعباده أن يشرفهم بشرف لقائه { لآتٍ } بلا شك وارتياب { وَ } كيف لا يشرفهم بعدما وعدهم\n إذ { هُوَ ٱلسَّمِيعُ } لمناجاتهم { ٱلْعَلِيمُ } [العنكبوت: 5] بحاجاتهم التي هي الفوز بشرف اللقاء\n والوقوف عند سدرة المنتهى\n والتدلي إلى مقام دنا فتدلى\n\n[النجم: 9]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { من كان يرجو لقاء الله } أي: يأمل ثوابه\n أو يخاف حسابه\n أو ينتظر رؤيته\n { فَإِنَّ أَجَلَ الله } المضروب للغاية { لآتٍ } لا محالة\n وهو تبشير بأن اللقاء حاصل لأنه لأجل آت\n وكل آت قريب\n وكل غاية لها انقضاء\n فليبادر للعمل الصالح الذي يصدق رجاءه ويحقق أمله\n { وهو السميعُ } لما يقوله عباده\n { العليمُ } بما يفعلونه\n فلا يفوته شيء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:27",
      "similarity": 0.6028612438831685
    },
    {
      "verse": "28:86",
      "similarity": 0.5729683945251477
    },
    {
      "verse": "45:14",
      "similarity": 0.49487978974271807
    },
    {
      "verse": "18:110",
      "similarity": 0.4565502935679415
    },
    {
      "verse": "77:12",
      "similarity": 0.408757461273199
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}