{
  "chapter": "العنكبوت",
  "text": "ويستعجلونك بالعذاب ولولا اجل مسمى لجاءهم العذاب ولياتينهم بغتة وهم لا يشعرون",
  "translations": [
    {
      "translation": "They ask you to hasten the punishment. If it were not for a stipulated term, the punishment would have come to them already. It will come upon them suddenly when they are not expecting it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want you to hasten the punishment: But for a time already determined the punishment would have come upon them. It will come upon them all too suddenly, and they will be caught unawares.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to hasten in bringing chastisement upon them. Had there not been an appointed term for it, the chastisement would have already visited them; in fact it will come down upon them all of a sudden (at its appointed time) while they will not be aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They demand you to bring upon them torment immediately. Had not the time been fixed, the torment would certainly have approached them. It would have come to them suddenly and they would not have even realized how it came.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they urge you to hasten the punishment; and if a time had not been fixed, the punishment would have certainly come upon them; and it will indeed come upon them suddenly whilst they are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you to hasten on the torment, and had it not been for a term appointed, the torment would certainly have come to them. And surely, it will come upon them suddenly while they perceive not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you to hasten on the chastisement; and had not a term been appointed, the chastisement would certainly have come to them; and most certainly it will come to them all of a sudden while they will not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they demand of thee to hasten the chastisement! But for a stated term the chastisement would have come upon them; but it shall come upon them suddenly, when they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They bid thee hasten on the doom (of Allah). And if a term had not been appointed, the doom would assuredly have come unto them (ere now). And verily it will come upon them suddenly when they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to hasten the punishment. Had there not been an appointed time for it, the punishment would already have come to them. Indeed it will come down upon them suddenly and catch them unawares.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask thee to hasten on the torment. And had not there been a term appointed, the torment would surely have come unto them. And surely it shall come upon them of a sudden while they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to hasten the punishment. Yet were it not for a specified time, the punishment would have surely overtaken them. Surely, it will overtake them suddenly while they are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee to hasten on the Punishment (for them): had it not been for a term (of respite) appointed, the Punishment would certainly have come to them: and it will certainly reach them,- of a sudden, while they perceive not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you to hasten on the torment (for them), and had it not been for a term appointed, the torment would certainly have come to them. And surely, it will come upon them suddenly while they perceive not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They demand that you hasten the punishment! But had it not been for the stated term, the punishment would come to them; it will come upon them suddenly when they are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they urge you to hasten the punishment. Were it not for a specified time, the punishment would have come to them. But it will come upon them suddenly, while they are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they urge you to hasten the punishment. And if not for [the decree of] a specified term, punishment would have reached them. But it will surely come to them suddenly while they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:53]   And they ask you to hasten the chastisement. Yet were it not for an appointed term, for this [chastisement], the chastisement would have come upon them, before long, but it shall assuredly come upon them suddenly while they are unaware, of the time of its coming.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They bid thee) Muhammad (hasten on the doom (of Allah). And if a term had not been appointed, the doom would assuredly have come unto them) before its due time. (And verily it will come upon them suddenly when they perceive not) its coming down upon them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ونهاية انهماكهم في بحر الغفلة والغرور { يَسْتَعْجِلُونَكَ } تهكماً استهزاءً { بِٱلْعَذَابِ } واستهزاءً بك الذي أنذرتهم بوحي منا إليك بنزوله إياهم من كمال إنكارهم وتكذيبهم { وَلَوْلاَ أَجَلٌ مُّسَمًّى } ووقت معين موعود\n مثبت في لوح قضائنا { لَّجَآءَهُمُ ٱلْعَذَابُ } اليوم فجأةً عاجلاً\n لاستحقاقهم بنزوله إلا أنه مؤقت موعود على مقتضى سنتنا القديمة المستمرة من ترهين الأمور على الأوقات المعينة المثبتة في لوح القضاء وحضرة العلم\n\n\nقل لهم يا أكمل الرسل نيابةً عنا: لا تغتروا بإمهالنا إياكم زماناً { وَ } الله { لَيَأْتِيَنَّهُمْ } ولينزلن عليهم العذاب الموعود { بَغْتَةً } أي: دفعة وفجأة { وَهُمْ لاَ يَشْعُرُونَ } [العنكبوت: 53] ولا يطلعون بنزوله وأمارات إتيانه\n\n\nومن غاية عمههم وسكرتهم وكمال انهماكهم في أسباب العذاب وموجباته ولوازمه { يَسْتَعْجِلُونَكَ بِٱلْعَذَابِ } ظناً منهم أن ما هم عليه إنما هو من موجبات الثواب وأسباب النجاة الجنة\n بل هي عينهما\n إذ لا إيمان لهم بالنشأة الأخرى وما فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ويستعجلونك بالعذاب } \nكقولهم: أمطر علينا حجارة من السماء\n { ولولا أجلٌ مسمىًّ } المضروب لعذاب كل قوم\n أو: القيامة\n أو: يوم بدر\n أو: وقت فنائهم بأجلهم\n والمعنى: ولو أجل قد سمّاه الله وعيَّنه في اللوح المحفوظ\n { لجاءهم العذاب } عاجلاً\n والحكمة تقتضي تأخيره إلى ذلك الأجل المسمى\n { وليأتينهم } العذاب في الأجل المسمى { بغتةً }: فجأة { وهم لا يشعرون } بإيتانه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:202",
      "similarity": 0.7406857118675653
    },
    {
      "verse": "39:55",
      "similarity": 0.6970015431354343
    },
    {
      "verse": "43:66",
      "similarity": 0.640067779363263
    },
    {
      "verse": "12:107",
      "similarity": 0.6041516432892279
    },
    {
      "verse": "7:95",
      "similarity": 0.47466709887023784
    }
  ]
}