{
  "chapter": "العنكبوت",
  "text": "اولم يكفهم انا انزلنا عليك الكتب يتلى عليهم ان فى ذلك لرحمة وذكرى لقوم يؤمنون",
  "translations": [
    {
      "translation": "Is it not enough for them that We have sent down to you the Book which is recited to them? There is certainly a mercy and reminder in that for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not sufficient for them that We have revealed the Book to you which is read out to them? It is indeed a grace and reminder for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not suffice for them (as a Sign) that We revealed to you the Book that is recited to them? Surely there is mercy and good counsel in it for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not enough for them that We have revealed the Book to you to be recited to them. It is a mercy and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not enough for them that We have sent down the Book upon you, which is read to them? Indeed in it are mercy and advice for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not sufficient for them that We have sent down to you the Book which is recited to them Verily, herein is mercy and a reminder for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not enough for them that We have revealed to you the Book which is recited to them? Most surely there is mercy in this and a reminder for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is it not sufficient for them that We have sent down upon thee the Book that is recited to them? Surely in that is a mercy, and a reminder to a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not enough for them that We have sent down unto thee the Scripture which is read unto them? Lo! herein verily is mercy, and a reminder for folk who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not sufficient for them that We have sent you down the Book to be recited to them? In this surely there is a blessing and an admonition for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sufficeth it not for them that We have sent down unto thee the Book to be recited unto them? Verily herein is a mercy and an admonition for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not suffice them that We have sent down to you the Book which is recited to them? There is indeed in that a mercy and admonition for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And is it not enough for them that we have sent down to thee the Book which is rehearsed to them? Verily, in it is Mercy and a Reminder to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not sufficient for them that We have sent down to you the Book (the Quran) which is recited to them? Verily, herein is mercy and a reminder (or an admonition) for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not enough for them that We have sent down to you the Book that is recited to them? Surely, in this there is a mercy and a reminder to a nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not suffice them that We revealed to you the Scripture, which is recited to them? In that is mercy and a reminder for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And is it not sufficient for them that We revealed to you the Book which is recited to them? Indeed in that is a mercy and reminder for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:51] Is it not sufficient for them, regarding what they have demanded, that We have revealed to you the Book, the Qur’ān, which is recited to them? — as it constitutes a ongoing sign that will never terminate, in contrast to the signs mentioned. Surely in that, Book, is mercy and a reminder, an admonition, for a people who believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَى عَلَيْهِمْ إِنَّ فِي ذَلِكَ لَرَحْمَةً وَذِكْرَى لِقَوْمٍ يُؤْمِنُونَ (51)عطف على جملة : { قل إنما الآيات عند الله } \\[ العنكبوت : 50 \\] وهو ارتقاء في المجادلة .والاستفهام تعجيبي إنكاري . والمعنى : وهل لا يكفيهم من الآيات آيات القرآن فإن كل مقدار من مقادير إعجازه آية على صدق الرسول صلى الله عليه وسلم فإن آيات القرآن زهاء ستة آلاف آية . ومقدار كل ثلاث آيات مقدار مُعجز ، فيحصل من القرآن مقدار ألفي معجزة وذلك لم يحصل لأحد من رسل الله .و { الكتاب } : القرآن ، وعُدل عن لفظ القرآن الذي هو كالعلم عليه إلى لفظ الكتاب المعهود لإيمائه إلى معنى تعظيمه بأنه المشتهر من بين كتب الأنبياء .وجملة : { يتلى عليهم } مستأنفة أو حال ، لأن الكتاب معلوم غير محتاج للوصف لما تشعر به مادة التلاوة من الانتشار والشيوع . واختير المضارع دون الوصف بأن يقال : متلواً عليهم ، لما يؤذن به المضارع من الاستمرار ، فحصل من مادة { يُتْلَى } ومن صيغة المضارع دلالة على عموم الأمكنة والأزمنة . وقد أشار قوله : { يُتْلى عليهم } وما بعده إلى خمس مزايا للقرآن على غيره من المعجزات .المزية الأولى : ما أشار إليه قوله { يُتْلى عليهم } من انتشار إعجازه وعمومه في المجامع والآفاق والأزمان المختلفة بحيث لا يختص بإدْراك إعجازه فريق خاص في زمن خاص شأن المعجزات المشهودة مثل عصا موسى وناقة صالح وبرء الأكمة ، فهو يتلى ، ومن ضمن تلاوته الآيات التي تحدّت الناس بمعارضته وسجلت عليهم عجزهم عن المعارضة من قَبل محاولتهم إياها فكان كما قال فهو معجزة باقية والمعجزات الأخرى معجزات زائلة .المزية الثانية : كونه مما يُتلى ، فإن ذلك أرفع من كون المعجزات الأخرى أحوالاً مرئية لأن إدراك المتلوّ إدراك عقلي فكري وهو أعلى من المدركات الحسية فكانت معجزةُ القرآن أليق بما يستقبل من عصور العلم التي تهيأت إليها الإنسانية .المزية الثالثة : ما أشار إليه قوله : { إن في ذلك لرحمة } فإنها واردة مورد التعليل للتعجيب من عدم اكتفائهم بالكتاب وفي التعليل تتميم لما اقتضاه التعبير بالكتاب وب { يتلى عليهم } ، فالإشارة ب { ذلك } إلى { الكتاب } ليستحضر بصفاته كلها وللتنويه به بما تقتضيه الإشارة من التعظيم . وتنكير ( رحمة ) للتعظيم ، أي لا يقادَر قدرها . فالكتاب المتلو مشتمل على ما هو رحمة لهم اشتمال الظرف على المظروف لأنه يشتمل على إقامة الشريعة وهي رحمة وصلاح للناس في دنياهم ، فالقرآن مع كونه معجزة دالّةً على صدق الرسول صلى الله عليه وسلم ومرشدة إلى تصديقه مثل غيره من المعجزات وهو أيضاً وسيلة علم وتشريع وآداب للمتلو عليهم وبذلك فضَل غيره من المعجزات التي لا تفيد إلا تصديق الرسول الآتي بها .المزية الرابعة : ما أشار إليه قوله : { وذكرى } فإن القرآن مشتمل على مواعظ ونذر وتعريف بعواقب الأعمال ، وإعدادٍ إلى الحياة الثانية ، ونحو ذلك مما هو تذكير بما في تذكره خيرُ الدارين ، وبذلك فضَل غيره من المعجزات الصامتة التي لا تفيد أزيد من كون الآتية على يديه صادقاً .المزية الخامسة : أن كون القرآن كتاباً متلواً مستطاعاً إدراك خصائصه لكل عربي ، ولكل من حذق العربية من غير العرب مثل أيمة العربية ، يبعده عن مشابهة نفثات السحرة والطلاسم ، فلا يستطيع طاعن أن يزعم أنه تخيلات كما قال قوم فرعون لموسى : { يأيها الساحر } \\[ الزخرف : 49 \\] وقال تعالى حكاية عن المشركين حين رأوا معجزة انشقاق القمر : { وإن يروا ءاية يعرضوا ويقولوا سحر مستمر } \\[ القمر : 2 \\] ، فأشار قوله : { يعرضوا } إلى أن ذلك القول صدر عنهم في معجزة مرئية .وعُلق بالرحمة والذكرى قوله : { لِقَوم يؤمنون } للإشارة إلى أن تلك منافع من القرآن زائدة على ما في المعجزات الأخرى من المنفعة التي هي منفعة الإيمان بما جاء به الرسول صلى الله عليه وسلم فهذه مزايا عظيمة لمعجزة القرآن حاصلة في حضرة الرسول صلى الله عليه وسلم وغيبته ومستقلة عن الحاجة إلى بيانه وتكميله بالدعوة وبتكريرها .واستحضار المؤمنين بعنوان : ( قوم يؤمنون ) دون أن يقال : للمؤمنين ، لما في لفظ قوم من الإيماء إلى أن الإيمان من مقومات قوميتهم ، أي لقوم شعارهم أن يؤمنوا ، يعني لقوم شعارهم النظر والإنصاف فإذا قامت لهم دلائل الإيمان آمنوا ولم يكابروا ظلماً وعلوّاً ، فالفعل مراد به الحال القريبة من الاستقبال . وفيه تعريض بالذين لم يكتفوا بمعجزته واقترحوا آيات أخرى لا نسبة بينه وبينها .\n\n",
      "translations": [
        {
          "translation": "(Is it not enough for them) i.e. for the people of Mecca as a sign for your prophethood, Muhammad, (that We have sent down unto thee the Scripture) We sent down Gabriel with the Qur'an (which is read unto them) and relating to them the commands, prohibitions and the events of past nations? (Lo! Herein) i.e. in the Qur'an (verily is mercy) that saves from chastisement, for those who believe in it, (and a reminder) an admonition (for folk who believe) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على المقترحين وتقريعاً لهم: { أَوَلَمْ يَكْفِهِمْ } ولم يغنهم من جميع الآيات التي اقترحوا عنك يا أكمل الرسل { أَنَّآ أَنزَلْنَا } من مقام جودنا ولطفنا معك { عَلَيْكَ ٱلْكِتَابَ } الجامع لما في الكتب السالفة\n المحتوي على أحوال النشأتين على الوجه الأبلغ مع أنه لا يغيب عنهم\n بل { يُتْلَىٰ عَلَيْهِمْ } ويُقرأ عندهم دائماً بخلاف سائر الآيات\n فإنها كما ظهرت غابت هي وأثرها وهو وأثرها حاضر عندهم غير مغيب عنهم\n وبالجملة: { إِنَّ فِي ذٰلِكَ } الكتاب الذي هو في نفسه آيات عظيمة الفوائد\n دائمة العوائد\n غير منقطعة آثارها عن من تمسك بها واستهديا { لَرَحْمَةً } أي: نعمة عامة نازلة من قبل الحق { وَذِكْرَىٰ } أي: عظة وتذكيراً شاملاً لعموم عباده\n ملقاه من عنده سبحانه { لِقَوْمٍ يُؤْمِنُونَ } [العنكبوت: 51] بتوحيده وأسمائه وصفاته\n ويصدقون المبدأ والمعاد والعرض والجزاء والفوز بشرف اللقاء جميع ما وعد لهم في النشأة الأخرى\n\n\nثم لما أتى قوم من ضعفاء المسلمين إلى رسول الله صلى الله عليه وسلم بكتف رُقم فيها بعض أراجيف اليهود وأقوايلهم الكاذبة\n متبركين بها\n متيمنين بما فيها\n فقال صلى الله عليه وسلم مبغضاً عليهم: كفى بضلالة قوم أن يرغبوا عما جاءهم به نبيهم من قبل ربهم إلى ما جاء به غير نبيهم\n وصدقوا ما جاء به غير نبيهم مع أنه كذب مفترى\n وكذبوا ما جاء به النبي مع أنه صدق مطابق للواقع\n فنزلت حينئذ تسلية لرسول الله صلى الله عليه وسلم: { قُلْ } يا أكمل الرسل للمكذبين لك وبما جئت به مصدقين لأعدائك وبما جاءوا به: { كَفَىٰ بِٱللَّهِ بَيْنِي وَبَيْنَكُمْ } أيها المكابرون { شَهِيداً } حاضراً معي ومعكم مطلقاً\n على حالي وحالكم وما جرى في ضميري وضمائركم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أو لم يكفهم أنا أنزلنا عليك الكتاب يُتلى عليهم } \n أي أَوَلَمْ يكفهم إنزال آية مغنية عن سائر الآيات\n إن كانوا طالبين للحق\n غير متعنتين\n وهو هذا القرآن الذي تدوم تلاوته عليهم في كل زمان ومكان\n فلا يزال معهم آية ثابته\n لا تزول ولا تنقطع\n كما انقطع غيره من الآيات\n وفي ذلك يقوم البوصيري:\n{ إن في ذلك } أي: هذه الآية الموجودة في كل زمان إلى آخر الدهر\n { لرحمة } لنعمة عظيمة\n { وذكرى } وتذكرة { لقوم يؤمنون } من دون المتعنتين\n قال يحيى بن جعدة: إن ناساً من المسلمين أتوا النبي صلى الله عليه وسلم بكتب قد كتبوها\n فيها بعض ما يقول اليهود\n فألقاها\n وقال: كفى بها حماقة\n أو ضلالة قوم\n أن يرغبوا عما جاء به نبيهم\n فنزل: { أولم يكفهم\n\n\n } إلخ\n { قل كفى بالله بيني وبينكم شهيداً } أي: شاهداً بصدق ما أدعيه من الرسالة وإنزال القرآن عليّ\n وتكذبيكم\n { يعلم ما في السماوات والأرض } \n فهو مطلع على أمري وأمركم\n وعالم بحقي وباطلكم\n فلا يخفى عليه شيء\n { والذين آمنوا بالباطل } \n وهو ما يُعبد من دون الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:70",
      "similarity": 0.5415315577630433
    },
    {
      "verse": "4:166",
      "similarity": 0.5204413407205772
    },
    {
      "verse": "33:3",
      "similarity": 0.5160891871088846
    },
    {
      "verse": "17:14",
      "similarity": 0.5118374968899322
    },
    {
      "verse": "4:132",
      "similarity": 0.49933525808476575
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}