{
  "chapter": "العنكبوت",
  "text": "الله يبسط الرزق لمن يشاء من عباده ويقدر له ان الله بكل شىء عليم",
  "translations": [
    {
      "translation": "Allah expands the provision of any of His slaves He wills and restricts it. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases the means of those of His creatures as He please, or limits them for whomsoever He will. He is certainly cognisant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlarges the sustenance of any of His servants whom He will, and straitens the sustenance of whom He will. Surely Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases the sustenance of whichever of His servants He wants and He determines their share. God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah eases the sustenance for whomever He wills among His bondmen, and restricts it for whomever He wills; indeed Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expands the provision for whom He wills of His servants, and straitens it for whom (He wills). Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah makes abundant the means of subsistence for whom He pleases of His servants, and straitens them for whom (He pleases) surely Allah is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God outspreads and straitens His provision to whomsoever He will of His servants; God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah maketh the provision wide for whom He will of His bondmen, and straiteneth it for whom (He will). Lo! Allah is Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gives abundantly to whom He will and sparingly to whom He pleases. God has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expandeth provision for whomsoever He Will of His bondmen and stinteth it for him. Verily Allah is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expands the provision for whomever He wishes of His servants, and tightens it for him. Indeed Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlarges the sustenance (which He gives) to whichever of His servants He pleases; and He (similarly) grants by (strict) measure, (as He pleases): for Allah has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlarges the provision for whom He wills of His slaves, and straitens it for whom (He wills). Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah outspreads and restricts His provision to whomsoever He will of His worshipers. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God expands the provision for whomever He wills of His servants, and restricts it. God is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah extends provision for whom He wills of His servants and restricts for him. Indeed Allah is, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:62]   God extends provision, He makes it abundant, for whomever He will of His servants, by way of a test, and He straitens, He restricts it, for him, after having extended it, that is, for whomever He will to try. Truly God has knowledge of all things, among them the occasion in which [it is appropriate for Him] to extend or to straiten.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ (62)هذا إلزام آخر لهم بإبطال شركهم وافتضاح تناقضهم فإنهم كانوا معترفين بأن الرازق هو الله تعالى { قل مَن يرزقكم من السماء والأرض أمن يملك السمع والأبصار } إلى قوله { فسيقولون الله فقل أفلا تتقون } في سورة يونس \\[ 31 \\] . وإنما جاء أسلوب هذا الاستدلال مخالفاً لأسلوب الذي قبله والذي بعده فعدل عن تركيب { ولئن سألتهم } \\[ العنكبوت : 61 \\] تفنناًفي الأساليب لتجديد نشاط السامع .وأدمج في الاستدلال على انفراده تعالى بالرزق التذكير بأنه تعالة يرزق عباده على حسب مشيئته دليلاً على أنه المختار في تصرفه وليس ذلك على مقادير حاجاتهم ولا على ما يبدو من الانتفاع بما يُرزقونه . وبسط الرزق : إكثاره ، وقَدْره : تقليله وتقتيره . والمقصود : أنه الرازق لأحوال الرزق ، وقد تقدم في قوله تعالى { الله يبسط الرزق لمن يشاء ويقدر } في سورة \\[ الرعد : 26 \\] . فجاءت هذه الاية على وزان قوله في سورة { أو لم يروا أن الله يبسط الرزق لمن يشاء ويقدر إن في ذلك لآيات لقوم يؤمنون } \\[ الروم : 27 \\] فجمع بين ضمير المشركين في أولها وبين كون الآيات للمؤمنين في آخرها . وتقديم المسند إليه على الخبر الفعلي في قوله { الله يبسط الرزق } لإفادة الاختصاص ، أي الله لا غيره يبسط الرزق ويقدر . والتعبير بالمضارع لإفادة تجدد البسط والقدر . وزيادة { له } بعد { ويقدر } في هذه الآية دون آية سورة الرعد وآية الققصص للتعريض بتبصير المؤمنين الذين ابتلوا في أموالهم من اعتداء المشركين عليها كما أشار غليه قوله آنفاً : { وكأين من دابة لا تحمل رزقها } \\[ العنكبوت : 60 \\] بأن ذلك القَدْر في الرزق هو لهم لا عليهم لما ينجر لهم منه من الثواب ورفع الدرجات ، فغُلّب في هذا الغرض جانب المؤمنين ولهذا لم يُعدّ { يقدر } بحرف ( على ) كما مقتضى معنى القدر كما في قوله تعالى : { ومن قُدِر عليه رزقُه فلينفقْ مما ءتاه الله } \\[ الطلاق : 7 \\] . وقال بعض المفسرين : إن المشركين عيروا المسلمين بالففقر ، وقيل : إن بعض المسلمين قالوا : إن هاجرنا لم نجد ما ننفق . والضمير المجرور باللام عائد إلى ( من يشاء من عباده ) باعتبار أن ( من يشاء ) عام ليس بشخص معين لا سيما وقد بيّن عمومه بقوله { من عباده } . والمعنى : أنه يبسط الرزق لفريق ويقدر لفريق . والتذييل بقوله { إن الله بكل شيء عليم } لإفادة أن ذلك كله جار على حكمة لا يطلع عليها الناس ، وأن الله يعلم صبر الصابرين وجزع الجازعين كما تقدم في قوله في أول السورة : { فليعلمن الله الذين صدقوا وليعلمن الكاذبين } \\[ العنكبوت : 3 \\] ، قال تعالى : { لَتُبلَوُنَّ في أموالكم وأنفسكم ولَتَسْمَعُنَّ من الذين أوتوا الكتاب من قبلكم ومن الذين أشركوا أذىً كثيراً وإن تَصْبِروا وتتقوا فإِنَّ ذلك من عزم الأمور } \\[ آل عمران : 186 \\] .\n\n",
      "translations": [
        {
          "translation": "(Allah maketh the provision wide for whom He will of His bondmen) He gives abundant wealth to whom He will of His servants; and this is a lure to perdition for them, (and straiteneth it for whom (He will)) out of care for them. (Lo! Allah is Aware of all things) regarding giving in abundance or straitening His provision.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قل لهم نيابة عنا: { ٱللَّهُ } المطلع لاستعدادات عباده وقابلياتهم { يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِ } على مقتضى استعداده { وَيَقْدِرُ لَهُ } ويقبض عنه حسب تعلق إرادته { إِنَّ ٱللَّهَ } المتقن في أفعاله { بِكُلِّ شَيْءٍ } صدر عنه إرادة واختياراً { عَلِيمٌ } [العنكبوت: 62] لا يعزب عن حيطة علمه شيء من لوازمه ومتمماته\n وجميع مقتضياته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الله يَبسُطُ الرِزْقَ لمن يشاءُ من عباده } هاجر أو أقام في بلده\n { ويقدرُ له } ويضيق عليه\n أقام أو هاجر\n فالضمير في { له } لمن يشاء لأنه مبهم غير معين\n { إن الله بكل شيء عليم } يعلم ما يصلح العباد وما يفسدهم\n فمنهم من يصله الفقر\n ومنهم من يُفسده\n ففي الحديث القدسي:\n \" إن من عبادي من لا يُصلح إيمانه إلاَّ الغنى\n ولو أفقرته لأفسده ذلك\n وإن من عبادي من لا يصلح إيمانه إلا الفقر\n ولو أغنيته لأفسده ذلك \" \nذكره النسفي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:52",
      "similarity": 0.8680670234805116
    },
    {
      "verse": "30:37",
      "similarity": 0.8393365816487338
    },
    {
      "verse": "34:36",
      "similarity": 0.8270311616302239
    },
    {
      "verse": "17:30",
      "similarity": 0.8071934543379539
    },
    {
      "verse": "34:39",
      "similarity": 0.8020250850242916
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}