{
  "chapter": "العنكبوت",
  "text": "وما هذه الحيوة الدنيا الا لهو ولعب وان الدار الءاخرة لهى الحيوان لو كانوا۟ يعلمون",
  "translations": [
    {
      "translation": "The life of this world is nothing but a game and a diversion. The abode of the Next World - that is truly Life if they only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is only a sport and play. It is surely the home of the Hereafter that will indeed be life extended and new, if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The present life is nothing but sport and amusement. The true life is in the Abode of the Hereafter; if only they knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worldly life is not more than a childish game. It is the life hereafter which will be the real life, if only they knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this worldly life is nothing but pastime and game; indeed the abode of the Hereafter – that is indeed the true life; if only they knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this life of the world is only an amusement and a play! Verily, the home of the Hereafter -- that is the life indeed, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this life of the world is nothing but a sport and a play; and as for the next abode, that most surely is the life-- did they but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This present life is naught but a diversion and a sport; surely the Last Abode is Life, did they but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This life of the world is but a pastime and a game. Lo! the home of the Hereafter - that is Life, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing but sport and a diversion. It is the life of the Hereafter which is the only true life, if they but knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this life of the world is but: sport and play. Verily the home of the Hereafter--that is life indeed, if they but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing but diversion and play, but the abode of the Hereafter is indeed Life (itself), had they known!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the life of this world but amusement and play? but verily the Home in the Hereafter,- that is life indeed, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this life of the world is only amusement and play! Verily, the home of the Hereafter, that is the life indeed (i.e. the eternal life that will never end), if they but knew\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing but a diversion and play. Indeed, the Everlasting Residence is the Eternal Life, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing but diversion and play, and the Home of the Hereafter is the Life, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this worldly life is not but diversion and amusement. And indeed, the home of the Hereafter - that is the [eternal] life, if only they knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:64] And the life of this world is nothing but diversion and play, whereas closeness [to God] pertains to concern for the Hereafter, since the fruits thereof will be revealed in it. But surely the Abode of the Hereafter is indeed the [true] Life, if they only knew, this, [then] they would not prefer this world to it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This life of the world) the comfort and embellishment which is the life of the world (is but a pastime) exhilaration (and a game) and falsehood which does not last. (Lo! the home of the Hereafter) i.e. Paradise (that is Life) wherein its inhabitant never die, (if they but knew) if they but believed, but they do not know this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّ ٱلدَّارَ ٱلآخِرَةَ لَهِيَ ٱلْحَيَوَانُ } معناه الحَياةُ والبقاءُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And indeed the Hereafter is the true life,\" means that life and existence are in the Hereafter.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومقتضيات استعداداتهم الثابتة في لوح القضاء وحضرة العلم الإلهي: { وَمَا هَـٰذِهِ ٱلْحَيَاةُ ٱلدُّنْيَآ } التي لا قرار لها ولا مدار حقيقة\n بل لا أصل لها أصلاً سوى سراب انعكس من شمس الذات\n وأمواج حدثت في بحر الجود { إِلاَّ لَهْوٌ وَلَعِبٌ } يعني: كما أن السراب يُلهي ويخدع العطشان بالتردد والتبختر نحو على اعتقاد أنه ماء\n فيتعب نفسه ويزيد عطشه\n بل يهلكها\n كذلك الحياة الدنيوية ومزخرفاتها الفانية\n ولذاتها الزائلة الذاهبة الإمكانية تُتعب صاحبها طول عمره\n ولا ترويه\n ثم تميته بأنواع الحسرة والضجرة { وَإِنَّ ٱلدَّارَ ٱلآخِرَةَ } وما يترتب عليها من المكاشفات والمشاهدات اللدنية\n وما يترتب عليها من أنواع الفتوحات والكرامات الفائضة لأرباب التوحيد { لَهِيَ ٱلْحَيَوَانُ } أي: هي مقصورة على الحياة الأزلية الأبدية التي لا يطرأ عليها زوال\n ولا يعقبها فناء\n ولا يعرض للذاتها انصرام وانقضاء { لَوْ كَانُواْ يَعْلَمُونَ } [العنكبوت: 64] يوقنون بها وبما فيها من الكرامات لم يؤثروا الدنيا الدنيَّة وحياتها الفانية المستعارة عليها\n ولم يختاروا اللذات الوهمية البهيمية على لذاتها الأزلية الأبدية\n ويجهلهم وضلالهم اختاروا الفاني على الباقي\n والزائل على القار\n والسراب المهلك على الفرات المحيي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وما هذه الحياةُ الدنيا إلا لهوٌ ولعب } أي: وما هي لسرعة زوالها عن أهلها وموتهم عنها\n إلا كما يلعب الصبيان ساعة\n ثم يفترقون متعبَين بلا فائدة\n وفيه ازدراء بالدنيا وتحقير لشأنها\n وكيف لا يحقرها وهي لا تزن عنده جناح بعوضة؟ واللهو: ما يتلذذ به الإنسان\n فيلهيه ساعة\n ثم ينقضي\n { وإنَّ الدار الآخرة لهي الحيوان } \n أي: الحياة الحقيقية لأنها دائمة\n والحيوان: مصدر\n وقياسه: حيَيَان\n فَقَلَبَ الياءَ الثانية واواً\n ولم يقل: لهي الحياة لِمَا في بناء فَعَلاَن من معنى الحركة والاضطراب\n وفي المصباح: الحيوان: مبالغة في الحياة\n كما قيل: للموت الكثير مَوَتَان\n هـ\n { لو كانوا يعلمون } حقيقة الدارين لَمَا اختاروا اللهو الفاني على الحيوان الباقي\n { فإذا رَكِبُوا في الفلك } \n هو مرتب على محذوف\n دل عليه ما وصفهم به قَبْلُ\n والتقدير: هم على ما هم عليه من الشرك والعناد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:32",
      "similarity": 0.8728891306852825
    },
    {
      "verse": "47:36",
      "similarity": 0.7782840178385811
    },
    {
      "verse": "80:10",
      "similarity": 0.5620208163430418
    },
    {
      "verse": "102:1",
      "similarity": 0.5556872605610543
    },
    {
      "verse": "7:51",
      "similarity": 0.5491458989902678
    }
  ]
}