{
  "chapter": "العنكبوت",
  "text": "ومن اظلم ممن افترى على الله كذبا او كذب بالحق لما جاءه اليس فى جهنم مثوى للكفرين",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who invents lies against Allah or denies the truth when it comes to him? Is there not shelter in Hell for the kafirun?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than he who fabricates a lie about God, or denies the truth when it has come to him? Is there not an abode for unbelievers in Hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who can be more unjust than he who foists a lie on Allah or gives the lie to the Truth after it has come to him? Is Hell not the resort of the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who invents falsehood against God or rejects the Truth after it has come to him? Is not hell the dwelling for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who fabricates lies against Allah, or denies the truth* when it comes to him? Is there not a place in hell for disbelievers? (* The Holy Prophet and / or the Holy Qur’an).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah or denies the truth, when it comes to him Is there not a dwelling in Hell for the disbelievers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who forges a lie against Allah, or gives the lie to the truth when it has come to him? Will not in hell be the abode of the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God a lie, or cries lies to the truth when it comes to him? What, is there not in Gehenna a lodging for the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doeth greater wrong than he who inventeth a lie concerning Allah, or denieth the truth when it cometh unto him? Is not there a home in hell for disbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than he who invents a lie about God or rejects the truth when it comes to him? Is Hell not the home for those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who fabricateth a lie against Allah or belieth the truth when it cometh unto him Will there not be in the Hell an abiding-place for the infidels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who fabricates a lie against Allah, or denies the truth when it comes to him? Is not the [final] abode of the faithless in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah or rejects the Truth when it reaches him? Is there not a home in Hell for those who reject Faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah or denies the truth (Muhammad SAW and his doctrine of Islamic Monotheism and this Quran), when it comes to him? Is there not a dwelling in Hell for disbelievers (in the Oneness of Allah and in His Messenger Muhammad SAW)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil that he who forges a lie against Allah or belied the truth when it comes to him! Is there not a lodging in Gehenna for the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater wrong than he who fabricates lies and attributes them to God, or calls the truth a lie when it has come to him? Is there not in Hell a dwelling for the blasphemers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who invents a lie about Allah or denies the truth when it has come to him? Is there not in Hell a [sufficient] residence for the disbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:68] And who — in other words, there is none [who] — does greater wrong than he who invents a lie against God, by ascribing partners to Him, or denies truth, be it the Prophet or the Book, when it comes to him? Is there not in Hell a lodging, an abode, for the disbelievers?, in other words, there is such [an abode] therein and such [a person] belongs with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَاءَهُ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ (68)لما أوفاهم ما يستأهلونه من تشنيع أحوالهم وسوء انتظام شؤونهم جاء في عقبه بتذييل يجمعها في أنها افتراء على الله وتكذيب بالحق ، ثم جزاهم الجزاء الأوفى اللائق بحالهم وهو أن النار مثواهم . وافتتح تشخيص حالهم بالاستفهام عن وجود فريق هم أظلم من هؤلاء الذين افتروا على الله وكذبوا بالحق توجيهاً لأذهان السامعين نحو البحث هل يجدون أظلم منهم حتى إذا أجادوا التأمل واستَقْروا مظانّ الظلمة واستعرضوا أصنافهم تيقنُوا أن ليس ثمة ظلم أشدُّمن ظلم هؤلاء .وإنما كانوا أشد الظالمين ظُلماً لأن الظلم الاعتداء على أحد بمنعه من حقه وأشدّ من المنع أن يمنعه مستحقَّه ويعطيه من لا يستحقه ، وأن يلصق باحد ما هو بريء منه . ث إن الاستحقاق وعدمه قد يثبتان بحكم العوائد وقد يثبتان بأحكام الشرائع وقد يثبتان بقضايا العقول السليمة وهو أعلى مراتب الثبوت ومَدار أمور أهل الشرك على الافتراء على الله بأن سَلبوا عنه ما هو متصف به من صفات الإلهية الثابتة بدلالة العقول ، وأثبتوا له ما هو منزه عنه من الصفات والأفعال بدلالة العقول ، وعلى تكذيب الرسول صلى الله عليه وسلم ونكران دلالة المعجزة التي يقتضيها العقل ، وعلى رمي الرسول عليه الصلاة والسلام بما هو بريء منه بشهادة العقل والعادة التي عرفوها منه بهتاناً وكذباً؛ فكانوا بمجموع الأمرين وضعوا اشياء في مواضع لا يمكن أن تكون مواضعها فكانوا أظلم الناس لأن عدم الإمكان أقوى من عدم الحصول .وتقييد الافتراء بالحال الموكِّدة في قوله { كَذِباً } لزيادة تفظيع الافتراء لأن اسم الكذب مشتهر القبح في عرف الناس ، وإنما اختير الافتراء للدلالة على أنهم يتعمدون الاختلاق تعمداً لا تخالطه شبهة . وتقييد تكذيبهم بالحق بقوله { لَمَّا جَاءَهُ } لإِدماج ذم المكذبين بنكران نعمة إرسال الحق إليهم التي لم يقدروها قدرها ، وكان شأن العقلاء أن يتطلبوا الحق ويرحلوا في طلبه ، وهؤلاء جاءهم الحق بين أيديهم فكذبوا به . وأيضاً فإن { لَمَّا } التوقيتية تؤذن بأن تكذيبهم حصل بداراً عند مجيء الحق ، أي دون أن يتركوا لأنفسهم مهلة النظر .وجملة { أليس في جهنم مثوى للكافرين } بيان لجملة { ومَنْ أظْلَمُ مِمَّن افْتَرَى على الله } وتقرير لها لأن في جملة { ومن أظلم ممن افترى على الله } إلى آخرها إيذاناً إجمالياً بجزاء فظيع يترقبهم ، فكان بيانه بمضمون جملة { أليس في جهنم مثوى لكافرين } وهو بالفاظه ونظمه يفيد تمكنهم من عذاب جهنم إذ جعلت مثواهم . فالمثوى : مكان الثواء . والثواء : الإقامة الطويلة والسكنى . وعلق ذلك بعنوان الكافرين للتنبيه على استحقاقهم ذلك لأجل كفرهم . والتعريف في ( الكَافِرِين ) تعريف العهد ، أي لهؤلاء الكافرين وهم الذين ذكروا من قبلُ بأنهم افتروا على الله كذباً وكذبوا بالحق ، فكان مقتضى الظاهر الإتيان بضميرهم فعدل عنه إلى الاسم الظاهر لإحضارهم بوصف الكفر .والهمزة في { أليس في جهنم مثوى } للاستفهام التقريري ، واصلها : إما الإنكار بتنزيل المُقِرّ منزلة المنكر ليكون إقراره أشد لزوماً له ، وإما أن تكون للاستفهام فلما دخلت على النفي أفادت التقرير لأن إنكار النفي إثبات للمنفي وهو إثبات مستعمل في التقرير على وجه الكناية . وهذا التقرير بالهمزة هو غالب استعمال الاستفهام مع النفي ، ومنه قول جرير :ألستم خير من ركب المطايا ... وأندى العالمين بطون راحِفإنه لا يحتمل غير معنى التقرير بشهادة الذوق ولياقة مقام مدح الخليفة . وهذا تقرير لمن يسمع هذا الكلام . جُعل كون جهنم مثواهم أمراً مسلماً معروفاً بحيث يُقرّ به كل من يُسأل عنه كناية عن تحقيق المغبة على طريقة إيماء الكناية .\n\n",
      "translations": [
        {
          "translation": "(Who doeth greater wrong) who is more insolent towards, and bolder against, Allah (than he who inventeth a lie concerning Allah) thus ascribing to Him a son and partners, (or denieth the Truth) or denies Muhammad (pbuh) and the Qur'an (when it cometh unto him) when Muhammad (pbuh) and the Qur'an come to him? (Is not there a home in hell for disbelievers) Abu Jahl and his host?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التهديد والوعيد الشديد: { وَمَنْ أَظْلَمُ } وأشد عدواناً على الله\n وخروجاً عن مقتضى حدوده\n وعلى نفسه بالعرض على بطشه وعذابه { مِمَّنْ ٱفْتَرَىٰ } وانتسب إلى الله مراءً وافتراءً { عَلَى ٱللَّهِ كَذِباً } عظيماً بأن يُشرك معه غيره\n مع أنه ليس في الوجود سواه { أَوْ كَذَّبَ بِٱلْحَقِّ } المطابق للواقع\n الثابت النازل من عنده سبحانه\n يعني: الرسول { لَمَّا جَآءَهُ } كذبه فجأة بلا تأمل وتدبر عناداً ومكابرةً { أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْكَافِرِينَ } [العنكبوت: 68] يعني: أيزعمون أولئك المسرعون في التكذيب\n المجترئون على الإنكار أنهم لا يدخلون جهنم الطرد وجحيم الخذلان\n خالدين مخلدين بسبب هذا الجرم العظيم والافتراء البالغ نهاية البغي والفساد على الله وعلى كتابه ورسوله؟! بلى هم المستوجبون المقصودون على الخلود فيها أبداً مهانين صاغرين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَنْ أظلمُ } أي: لا أحد أظلم { ممن افترى علىا لله كذباً } بأن جعل له شريكاً\n { أو كذّب بالحق } الرسول صلى الله عليه وسلم\n أو: الكتاب\n { لمَّا جاءه } أي: لم يتلعثموا في تكذيبه لَمّا سمعوه\n وفي \" لَمَّا \" \n المقتضية للاتصال\n تسفيه لرأيهم\n حيث لم يتوقفوا ولم يتأملوا قط حين جاءهم\n بل سارعوا إلى التكذيب أول ما سمعوه\n { أليس في جهنم مَثْوىً } مقاماً { للكافرين } \n وهو تقرير لمثواهم في جهنم\n لأن همزة الإنكار\n إذا دخلت على النفي\n صار إثباتاً\n كقوله:\nأي: أتم خير من ركب المطايا\n والتقدير: ألا يستوجبون الثوى فيها؟ وقد افتروا مثل هذه العظيمة\n كذبوا على الله وكذّبوا بالحق الذي جاء من عنده\n أو: ألم يصح عندهم أن في جهنم مثوى للكافرين؟ حين اجترأوا مثل هذه الجرأة\n بل لهم فيها مثوى وإقامة\n وهذه الآية في مقابلة قوله:\n[العنكبوت: 58]\n لا سيما في قراءة الثاء\n والله تعالى أعلم\n الإشارة: الحرم الآمن\n في هذه الدار\n هو التبتل والانقطاع عن الدنيا وأبنائها\n والتجريد من أسبابها\n فمن دخله أَمِنَ ظاهراً وباطناً\n ومن هجرها\n وترك الناس حوله يتخطفون ويتهارجون عليها\n وهو يتفرج عليهم\n فالدنيا جيفة والناس كلابها\n فإن خالطتهم ناهشوك\n وإن تركت لهم جيفتهم سَلِمتَ منهم\n فمن كذّب بهذا فقد كذَّب بالحق وآمن بالباطل\n فلا أحد أظلم منه\n وبالله التوفيق\n ثم ذكر مآل أهل الجدّ والاجتهاد ممّن تبتّل وانقطع إلى الله فقال: { وَٱلَّذِينَ جَاهَدُواْ فِينَا\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:32",
      "similarity": 0.8386424952080469
    },
    {
      "verse": "47:19",
      "similarity": 0.5450260314298935
    },
    {
      "verse": "16:29",
      "similarity": 0.5387551935224641
    },
    {
      "verse": "40:76",
      "similarity": 0.5371203366710251
    },
    {
      "verse": "39:72",
      "similarity": 0.5359016823379904
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029068.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029068.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:68.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}