{
  "chapter": "العنكبوت",
  "text": "والذين جهدوا۟ فينا لنهدينهم سبلنا وان الله لمع المحسنين",
  "translations": [
    {
      "translation": "As for those who do jihad in Our Way, We will guide them to Our Paths. Truly Allah is with the good- doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall guide those who strive in Our cause to the paths leading straight to Us. Surely God is with those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who strive in Our cause, We shall surely guide them to Our Ways. Indeed Allah is with those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall certainly guide those who strive for Our cause to Our path. God is certainly with the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who strove in Our way – We shall surely show them Our paths; and indeed Allah is with the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who strive hard for Us, We will surely guide them to Our paths. And verily, Allah is with the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who strive hard for Us, We will most certainly guide them in Our ways; and Allah is most surely with the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who struggle in Our cause, surely We shall guide them in Our ways; and God is with the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who strive in Us, We surely guide them to Our paths, and lo! Allah is with the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely guide in Our ways those who strive hard for Our cause, God is surely with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who strive hard in us, We shall surely guide them in Our paths; verily Allah is with the welldoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who strive in Us, We shall surely guide them in Our ways, and Allah is indeed with the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who strive in Our (cause),- We will certainly guide them to our Paths: For verily Allah is with those who do right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who strive hard in Us (Our Cause), We will surely guide them to Our Paths (i.e. Allah's Religion - Islamic Monotheism). And verily, Allah is with the Muhsinun (good doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who struggle in Our cause, We will surely guide them to Our ways; and Allah is with those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who strive for Us—We will guide them in Our ways. God is with the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:69] But as for those who struggle for Our sake, for Our truth, We shall assuredly guide them in Our ways, that is, the means to come to Us, and truly God is with the virtuous, the believers, assisting and helping. Meccan, except for verse 17, which is Medinese; it consists of 60 verses, revealed after [sūrat] al-Inshiqāq.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for those who strive in Us) in Our obedience; Ibn 'Abbas said this means: those who strive for Our Word, (We surely guide them to Our paths) i.e. whoever acts upon what he knows, We shall give him success to know that which he do not know; it is also said that this means: We shall honour them with a natural aptitude, easiness and sweetness [of faith]; it is also said that this means: We shall guide them to obey Us, (and lo! Allah is with the good) He helps those who are good in their works and speech by giving them success and holding them back from transgression'. And of the surah in which the Romans are mentioned, which is all Meccan and consists of 70 verses, 819 words and 3,530 letters: Surah 30: The Romans [al-Rum) And of the surah in which the Romans are mentioned, which is all Meccan and consists of 70 verses, 819 words and 3,530 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على مقتضى سنته المستمرة من تعقيب الوعيد بالوعد: { وَٱلَّذِينَ جَاهَدُواْ فِينَا } يعني: المؤمنين الموقنين الذين حازوا كلا مرتبتي العين و الحق على مقتضى استعداداتهم الفطرية\n ثمَّ اجتهدوا ببذل وسعهم بأن يفنوا فينا\n ويبقوا ببقائنا\n باذلين مهجهم في سبيلنا\n تاركين أنانيتهم وأعيانهم الباطلة في هويتنا وعيننا الحق { لَنَهْدِيَنَّهُمْ } ونوفقنَّ عليهم { سُبُلَنَا } ولنزيدنَّ هديهم ورشدهم إلينا جذباً منا إياهم\n وعنايةً لهم\n وأحساناً معهم { وَ } كيف لا يجذبهم ولا يعتني بشأنهم\n ولا يزيد برشدهم وتوفيقهم؟! { إِنَّ ٱللَّهَ } المتجلي لخلَّص عباده بمقتضى أسمائه وصفاته { لَمَعَ ٱلْمُحْسِنِينَ } [العنكبوت: 69] منهم\n وهم الذين يحسنون الأدب مع الله\n ويجتهدون في إفناء ذواتهم في ذاته بعدما تحققوا بمقام الكشف والشهود\n وتيقنوا ألاَّ موجود سواه\n ولا إله ي الوجود إلا هو\n اجتهدوا حينئذٍ أن يحكوا أضلال هوياتهم الباطلة\n وعكوس تعيناتهم الهالكة العاطلة عن دفتر الوجود مطلقاً\n لئلا يبقى لهم عين ولا اسم ولا رسم\n\nوبعدما طرحوا بتوفيق الله وجذب من جانبه ما أطرحوا من أباطيل التعينات ولوازم الهويات والأنانيات\n وعموم الاعتبارات عن دفتر الوجود وفضاء الشهود\n بحيث لم يبق لهم عين ولا أثر\n بل لا معنى للمعية والمصاحبة والمقارنة\n ولا تشوشك منطوقات الألفاظ والعبارات إن كنت من أهل الرموز والإشارات\n هو يقول الحق\n وهو يهدي السبيل\n وحسبنا الله ونعم الوكيل\n\n\nخاتمة السورة\n\n\nعليكم أيها المجتهد المتوجه نحو الحق\n المتعطش بزلال توحيده\n المعرض عن الباطل وما يترتب عليه من غوائل الشيطان ووساوسه أن يجتهد أولاً في استخلاص نفسك البشرية عن أمانيها مطلقاً\n سيما أنية أمارتك المائلة بأنواع الفجور\n المبغية على الله بأصناف الكفر والفسوق\n والغيبة التي لا تفهم مقتضيات الوحدة وإشارات أرباب التوحيد أصلاً\n العرية عن مبدأ المعارف والحقائق والأسرار والمكاشفات\n الواقعة في طريقه رأساً\n فلك أن تروضها بمتاعب الرياضات ومشاق التكليفات إلى أن تجعلها مطمئنة راضية بما جرى عليها من القضاء\n\n\nثمَّ بعدما صارت نفسك مطمئنة راضية انبعث شوقك\n واقتضى ذوقك مع جذب من جانب الحق إلى أن تجعلها فانية في هوية الله\n مضمحلة في ذاته\n متلاشية في أوصافه وأسمائه\n بحيث لا يبقى لها عين ولا أثر\n فحيئنذٍ صرت في زمرة المحسنين المهديين\n المرضيين الذين هم من الله في جميع حالاتهم لا بطريق المصاحبة والمقارنة\n ولا بطريق الحلول والاتحاد على ما يخيلك الألفاظ والعبادات\n بل بطريق الفناء فيه والرجوع إليه\n والبقاء ببقائه\n\n\nجعلنا الله ممن اجتهد في طريق التوحيد\n وجاهد نفسه في مسلك الفناء حتى بذلها في سبيل الله وأفناها في هويته بمنَّه وسعة جوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { والذين جاهدوا فينا } ، أطلق المجاهدة، ولم يُقيدها بمفعول ليتناول من تجب مجاهدته من النفس والشيطان وأعداء الدين، أي: جاهدوا نفوسَهم في طلبنا أو في حقنا، ومن أجلنا، ولوجهنا، خالصاً، { لنهدينهم سُبلنا } أي: طُرُق السير إلينا، والوصول إلى حضرتنا، أو لنسهلنهم فعل الخير حتى يصلوا إلى جنابنا. وعن الداراني: والذين جاهدوا بأن عملوا بما علموا، لنهدينهم إلى علم ما لم يعلموا. وقال الفضيل: والذين جاهدوا في طلب العلم، أي: لله، لنهدينهم سبل العمل. وقال سهل: والذين جاهدوا في إقامة السنَّنَّة، لنهدينهم سبل الجنة. وقال ابن عطاء: جاهدوا في إرضائنا لنهدينهم سبل الوصول إلى محل الرضوان. وقال ابن عباس: جاهدوا في طاعتنا لنهدينهم سُبل ثوابنا. وقال الجنيد: جاهدوا في التوبة، لنهديهم سُبل الإخلاص، أو: جاهدوا في خدمتنا لنمنحنهم سبل المناجاة معنا والأنس بنا، { وإن الله لمع المحسنين } بالنصر والمعونة في الدنيا، وبالثواب والمغفرة في العُقبى. والله تعالى أعلم. الإشارة: المجاهدة، على قدرها تكون المشاهدة، فمن لا مجاهدة له لا مشاهدة له. وبالمجاهدة تميزت الخصوص من العموم، وبها تحقق سير السائرين، فالعموم وقفوا مع موافقة حظوظهم من الجاه والغنى وغيره والخصوص خالفوا نفوسهم ورفضوا حظوظهم، وخرقوا عوائدهم، فَخُرِقَتْ لهم العوائد، وانكشفت عنهم الحجب، وشاهدوا المحبوب. فجاهدوا أولاً في ترك الدنيا، وتحملوا مرارة الفقر، حتى تحققوا بمقام التوكل، ثم جاهدوا في ترك الجاه والرئاسة، فتحققوا بالخمول، وهو أساس الإخلاص، ثم جاهدوا في مخالفة النفس، فَحَمَّلوها كل ما يثقل عليها، وأخرجوها من كل ما تهواه ويخف عليها، وارتكبوا في ذلك أهوالاً وأحوالاً صِعَاباً، حتى ماتت نفوسهم مَوْتَاتٍ، فتحقق بذلك حياة أرواحهم، وأشرفت على البحر الزاخر، بحر التوحيد الخاص، فغابت ظلال الأكوان حين أشرقت شمس العيان، ففني من لم يكن، وبقي من لم يزل، فدخلوا جنة المعارف، ولم يشتاقوا قط إلى جنة الزخارف لأنها منطوية فيها. ولا بد من صحبة شيخ كامل، قد سلك هذه المسالك، يلقيه زمام نفسه، حتى يوصله إلى ربه، وإلا أتعب نفسه بلا فائدة. وقوله تعالى: { وإن الله لمع المحسنين } تهوينٌ وتسهيلٌ على السائرين أَمْرَ نفوسِهِمْ ومجاهدَتَها، إذا علموا أن الله معهم، هان عليهم كل صعب، وقَرُبَ كل بعيد. وبالله التوفيق. ولا حول ولا قوة إلا بالله العلي العظيم. وصلى الله على سيدنا محمد وآله وصحبه وسلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:11",
      "similarity": 0.585364798531788
    },
    {
      "verse": "29:6",
      "similarity": 0.5360222760352449
    },
    {
      "verse": "25:52",
      "similarity": 0.5358699395385789
    },
    {
      "verse": "9:88",
      "similarity": 0.46461195543325273
    },
    {
      "verse": "49:15",
      "similarity": 0.4642777010678392
    }
  ]
}