{
  "chapter": "العنكبوت",
  "text": "ولئن سالتهم من نزل من السماء ماء فاحيا به الارض منۢ بعد موتها ليقولن الله قل الحمد لله بل اكثرهم لا يعقلون",
  "translations": [
    {
      "translation": "If you ask them, 'Who sends down water from the sky, bringing the earth back to life again after it was dead?' they will say, 'Allah.' Say: 'Praise be to Allah.' But most of them do not use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them: \"Who sends down rain from the sky and quickens the earth when it is dead?\" They will answer: \"God.\" Say: \"All praise be to God.\" But most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to ask them: “Who sent down water from the sky and therewith revived the earth after its death?” they will certainly say: “Allah.” Say: “To Allah alone be praise and thanks.” But most people do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, \"Who has sent down water from the sky to revive the dead earth?\" They will say, \"God has done it.\" Say, \"It is only God who deserves all praise, but many of them do not understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, “Who sent down the water from the sky, and with it revived the earth after its death?”, they will surely say, “Allah”; proclaim, “All praise is to Allah”; in fact most of them do not have any sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you were to ask them: \"Who sends down water from the sky, and gives life therewith to the earth after its death\" They will surely reply: \"Allah.\" Say: \"All the praises and thanks be to Allah!\" Nay, most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them Who is it that sends down water from the clouds, then gives life to the earth with it after its death, they will certainly say, Allah. Say: All praise is due to Allah. Nay, most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou askest them, 'Who sends down out of heaven water, and therewith revives the earth after it is dead?' they will say, 'God.' Say: 'Praise belongs to God.' Nay, but most of them have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou wert to ask them: Who causeth water to come down from the sky, and therewith reviveth the earth after its death? they verily would say: Allah. Say: Praise be to Allah! But most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them who it is that sends down water from the sky and revives the earth with it after its death, they will surely answer, \"God.\" Then praise be to God. But most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wert thou to ask them: who sendeth down water from the heaven, and therewith quickeneth the earth after the death thereof? they would surely say: Allah. Say thou: all praise unto Allah! Aye! most of them reflect not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, ‘Who sends down water from the sky, with which He revives the earth after its death?’ They will surely say, ‘Allah.’ Say, ‘All praise belongs to Allah!’ But most of them do not exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if indeed thou ask them who it is that sends down rain from the sky, and gives life therewith to the earth after its death, they will certainly reply, \"Allah!\" Say, \"Praise be to Allah!\" But most of them understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to ask them: \"Who sends down water (rain) from the sky, and gives life therewith to the earth after its death?\" They will surely reply: \"Allah.\" Say: \"All the praises and thanks be to Allah!\" Nay! Most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to ask them: ''Who sends down water out of the sky and thereby revives the earth after it was dead' they will reply: 'Allah' Say: 'Praise, belongs to Allah' No, but most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you asked them, “Who sends water down from the sky, with which He revives the earth after it had died?” They would say, “God.” Say, “Praise be to God.” But most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you asked them, \"Who sends down rain from the sky and gives life thereby to the earth after its lifelessness?\" they would surely say \" Allah.\" Say, \"Praise to Allah \"; but most of them do not reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:63] And if (wa-la-in: the lām is for oaths) you were to ask them, ‘Who sends down water from the heaven, and therewith revives the earth after its death?’ They would assuredly say, ‘God’: so how can they ascribe partners to Him?! Say, to them: ‘Praise be to God!’, that the proof has been established against you. Nay, but most of them do not realise, their contradictiousness in this respect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thou wert to ask them) i.e. the people of Mecca: (Who causeth water) the rain (to come down from the sky, and therewith reviveth the earth after its death) after its drought and dryness? (they) the disbelievers of Mecca (verily would say: Allah) causes it to come down. (Say: Praise be to Allah) thanks to Allah for it! (But most of them) all of them (have no sense) do not know and do not believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } يا أكمل الرسل: { مَّن نَّزَّلَ مِنَ } جانب { ٱلسَّمَآءِ مَآءً فَأَحْيَا بِهِ } أي: بواسطة الماء على مقتضى عادته المستمرة من تعقيب الأسباب بالمسببات { ٱلأَرْضَ } الجامدة اليابسة { مِن بَعْدِ مَوْتِهَا } أي: جمودها ويبسها؟ طبعاً { لَيَقُولُنَّ ٱللَّهُ } طوعاً\n القادر المقتدر على الإحياء والإماتة\n ومع اعترافهم بوحدة الله وانتساب معظم الأشياء إليه يشركون له غيره عناداً ومكابرةً { قُلِ } أيضاً { لَئِن سَأَلْتَهُمْ } يا أكمل الرسل بلسان الجمع\n بعدما عصمك الحق عن الشرك وأنواع الجهالات بإفاضة العقل المفاض\n وهداك إلى توحيده بالرشد الكامل المكمل المميز لك أكمل التمييز\n حامداً لله شاكراً لنعمه\n سيما نعمة العصمة عن الشرك والضلال: { ٱلْحَمْدُ } والثناء الصادر من ألسنة ذرائر الكائنات المتذكرة لمبدئها ومنشئها طوعاً وطبعاً\n ثابتة حاصلة { لِلَّهِ } راجعة إليه سبحانه أصالةً\n إذ لا مُظهر لهم سواه\n ولا موجد في الوجود إلا هو\n\n\n{ بَلْ أَكْثَرُهُمْ } من نهاية غفلتهم وضلالهم عن الله { لاَ يَعْقِلُونَ } [العنكبوت: 63] ولا يفهمون وحدة الحق واستقلاله في الآثار والتصرفات الواقعة في الأنفس والآفاق\n ولا يستعملون عقولهم المفاضة لهم للتدبر والتأمل في هذا المطلب العزيز حتى يستبعدوا الفيضان نزول الوحدة بطريق الكشف والشهود\n فخلصوا عن التردد في هاوية الجهالات\n وأودية الخيالات والضلالات\n وما يعوقهم ويمنعنم عن الوصول إلى هذا المطلب العلي\n والمقصد السني إلا المزخرفات الدنيَّة الدنيوية\n الملهية للنفوس البشرية عن اللذات الروحانية\n مع أنها ما هي في أنفاسها إلا أوهام وخيالات باطلة\n فكيف ما يترتب عليها من اللذات الوهمية والشهوات البهيمية؟!\n\n\nكما قال سبحانه مشيراً إلى فناء زخرفة الدنيا وعدم قرارها وثباتها\n وبقاء النشأة الأخرى وما يترتب عليها من اللذات الروحانية\n والدرجات العليَّة النورانية المتفاوتة علماً وعيناً وحقاً على تفاوت طبقات أرباب الكشف والشهود",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولئن سألتهم من نزَّل من السماءِ ماء فأحيا به الأرضَ من بعد موتها ليقولن اللهُ } معترفين بأنه الموجد للكائنات بأسرها\n أصولها وفروعها\n ثم إنهم يُشركون به بعض مخلوقاته الذي هو أضعف الأشياء\n { قل الحمد لله } على إظهار قدرته\n حتى ظهرت لجميع الخلق\n حتى أقرت بها الجاهلية الجهلاء\n أو: على ما عصمك مما هم عليه\n أو: على تصديقك وإظهار حجتك\n أو: على إنزاله الماء لإحياء الأرض\n { بل أكثرُهُم لا يعقلون } لا عقول لهم\n فلا يتدبرون فيما يُريهم من الآيات ويقيم عليهم من الدلالات\n والله تعالى أعلم\n الإشارة: الرزق مضمون بيد من أَمْرُهُ بين الكاف والنون\n لا يزيد بحرص قوي\n ولا ينقص بعجز ضعيف\n بل قد ينعكس الأمر\n كما الشاعر:\nوقد يبسطه الله لأهل الغفلة والبُعد\n ويقدره لأهل الولاية والقُرب\n كما قال القائل:\nوقال عليه الصلاة والسلام - في بعض خطبه -:\n \" أيها الناس\n إن الرزق مقسوم\n لن يعدو امْرُؤٌ ما كُتِبَ له\n فاتقوا الله\n وأَجْمِلُوا في الطَلَبِ\n وإن الأمر محدود\n لن يجاوز أحد ما قُدر له\n فبادروا قبل نفود الأجل\n وإن الأعمال محصاة\n لن يُهْمَلَ منها صغيرةٌ ولا كبيرةٌ\n فأكثروا من صالح الأعمال\n\n\n \" \nالحديث\n وقال صلى الله عليه وسلم:\n \" لو توكلتمْ على الله حقَّ توكلِهِ\n لرَزقتم كما تُرزق الطير تغدو خِمَاصاً وتروح بِطَانا \"\n \nثم حقر الدنيا وعظّم الآخرة\n فقال: { وَمَا هَـٰذِهِ ٱلْحَيَاةُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:25",
      "similarity": 0.6145344782551565
    },
    {
      "verse": "16:65",
      "similarity": 0.5481336808844712
    },
    {
      "verse": "57:17",
      "similarity": 0.48602866763985225
    },
    {
      "verse": "23:80",
      "similarity": 0.39265899510072694
    },
    {
      "verse": "45:5",
      "similarity": 0.3835278809439862
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/29:63.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/29:63.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}