{
  "chapter": "العنكبوت",
  "text": "ولئن سالتهم من خلق السموت والارض وسخر الشمس والقمر ليقولن الله فانى يؤفكون",
  "translations": [
    {
      "translation": "If you ask them, 'Who created the heavens and the earth and made the sun and moon subservient?' they will say, 'Allah.' So how have they been perverted?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them: \"Who created the heavens and the earth, and who set the sun and the moon to work?\" They will answer: \"God.\" Why then do they vacillate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to ask them: “Who created the heavens and the earth and Who has kept the sun and the moon in subjection?” they will certainly say: “Allah.” How come, then, they are being deluded from the Truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, \"Who has created the heavens and the earth and has subdued the sun and moon?\" They will say, \"God has done it.\" So why are they wandering about!?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, “Who created the heavens and the earth, and subjected the sun and the moon?”, they will surely say, “Allah”; so where are they reverting?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you were to ask them: \"Who has created the heavens and the earth and subjected the sun and the moon\" They will surely reply: \"Allah.\" How then are they deviating\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, Who created the heavens and the earth and made the sun and the moon subservient, they will certainly say, Allah. Whence are they then turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou askest them, 'Who created the heavens and the earth and subjected the sun and the moon?' they will say, 'God.' How then are they perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou wert to ask them: Who created the heavens and the earth, and constrained the sun and the moon (to their appointed work)? they would say: Allah. How then are they turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them who it is that has created the heavens and the earth and subjugated the sun and the moon, they will say, \"God.\" How then are they turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wert thou to ask them.: who hath created the heavens and the earth and subjected the sun and the moon they would surely say: Allah. How then are they deviating?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, ‘Who created the heavens and the earth, and who has disposed the sun and the moon?’ They will surely say, ‘Allah.’ Then where do they stray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If indeed thou ask them who has created the heavens and the earth and subjected the sun and the moon (to his Law), they will certainly reply, \"Allah\". How are they then deluded away (from the truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to ask them: \"Who has created the heavens and the earth and subjected the sun and the moon?\" They will surely reply: \"Allah.\" How then are they deviating (as polytheists and disbelievers)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them: 'Who has created the heavens and the earth and subjected the sun and the moon' They will say: 'Allah' How perverted they are!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you asked them, “Who created the heavens and the earth and regulated the sun and the moon?” They would say, “God.” Why then do they deviate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you asked them, \"Who created the heavens and earth and subjected the sun and the moon?\" they would surely say, \"Allah.\" Then how are they deluded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:61] And if (wa-la-in: the lām is for oaths) you were to ask them, namely, the disbelievers, ‘Who created the heavens and the earth and disposed the sun and the moon?’ They would assuredly say, ‘God.’ So how then are they turned away?, from affirming His Oneness after affirming that [God created them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thou wert to ask them) i.e. the disbelievers of Mecca: (Who created the heavens and the earth, and constrained) and made subservient (the sun and the moon? they would say) the disbelievers of Mecca would say: (Allah) created and made them subservient. (How then are they turned away?) How then do they lie against Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه قولاً على سبيل الإلزام والتبكيت: { وَلَئِن سَأَلْتَهُمْ } يا أكمل الرسل؛ أي: أهل مكة مع كفرهم وشركهم: { مَّنْ خَلَقَ } وأظهر { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } من كتم العدم؟ { وَ } منْ { سَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ } دائبين؟ { لَيَقُولُنَّ ٱللَّهُ } المظهر للكائنات، المستقل في إيجادها، والمتصرف فيها حسب إرادته ومشيئته، وبعدما أقروا بتوحيد الحق وانتهاء مراتب الممكنات إليه { فَأَنَّىٰ يُؤْفَكُونَ } [العنكبوت: 61] ويُصرفون عن توحيده والإيمان ب، والامتثال بأوامره ونواهيه الجارية على ألسنة رسله وكتبه؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر دلائل قدرته على الرزق وغيره فقال: { ولئن سألتهم } أي: المشركين وغيرهم { مَنْ خَلَقَ السماوات والأرض } على كبرهما وسعتهما، { وسخَّرَ الشمسَ والقمرَ } يجريان في فلكهما، { ليقولُنَّ اللهُ } لا يجدون جواباً إلا هذا، لإقرارهم بوجود الصانع، { فأنى يؤفكون } فكيف يُصرفون عن توحيد الله؟ مع إقرارهم بهذا كله، إذ لوتعدد الإله لفسد نظام العالم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:87",
      "similarity": 0.6388571797545346
    },
    {
      "verse": "40:62",
      "similarity": 0.5416607866719105
    },
    {
      "verse": "75:9",
      "similarity": 0.5129594304420013
    },
    {
      "verse": "55:5",
      "similarity": 0.508866629998358
    },
    {
      "verse": "35:3",
      "similarity": 0.4971204983665316
    }
  ]
}