{
  "chapter": "العنكبوت",
  "text": "فاذا ركبوا۟ فى الفلك دعوا۟ الله مخلصين له الدين فلما نجىهم الى البر اذا هم يشركون",
  "translations": [
    {
      "translation": "When they embark in ships, they call on Allah, making their deen sincerely His, but then when He delivers them safely to the land, they associate others with Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they board a ship they call on God, placing their faith wholly in Him. But when He brings them safely back to shore, they begin to associate others with Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they embark in the ships they call upon Allah, consecrating their faith to Him. But when He rescues them and brings them to land, they suddenly begin to associate others with Allah in His Divinity\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they sail in a boat, they sincerely pray to God with pure faith. But when We bring them safely to land, they start considering things equal to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they board the ships they pray to Allah, believing purely in Him; so when He delivers them safely to land, they immediately begin ascribing partners (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they embark on a ship, they invoke Allah, making their faith pure for Him only, but when He brings them safely to land, behold, they give a share of their worship to others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they ride in the ships they call upon Allah, being sincerely obedient to Him, but when He brings them safe to the land, lo! they associate others (with Him);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they embark in the ships, they call on God, making their religion sincerely His; but when He has delivered them to the land, they associate others with Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they mount upon the ships they pray to Allah, making their faith pure for Him only, but when He bringeth them safe to land, behold! they ascribe partners (unto Him),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they board a vessel, they call on God, sincere in their faith for Him alone; but when He brings them safe to land, they begin to ascribe partners to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So When they mount upon the ships they call on Allah making pure for Him the religion, then when He delivereth them safely on the land, lo! they associate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they board the ship, they invoke Allah putting exclusive faith in Him, but when He delivers them to land, behold, they ascribe partners [to Him],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, if they embark on a boat, they call on Allah, making their devotion sincerely (and exclusively) to Him; but when He has delivered them safely to (dry) land, behold, they give a share (of their worship to others)!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they embark on a ship, they invoke Allah, making their Faith pure for Him only, but when He brings them safely to land, behold, they give a share of their worship to others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they embark upon ships, they call to Allah making their religion sincerely His; but when He brings them safe to the land, they associate others with Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they embark on a vessel, they pray to God, devoting their faith to Him; but once He has delivered them safely to land, they attribute partners to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they board a ship, they supplicate Allah, sincere to Him in religion. But when He delivers them to the land, at once they associate others with Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:65] And when they board the ship, they call on God, making their supplications purely to Him, in other words, they do not call on any other besides Him, suffering distress which only He is able to remove; but when He delivers them to land, behold! they ascribe partners, to Him,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they) i.e. the disbelievers of Mecca (mount upon the ships they pray to Allah) for safety, (making their faith pure for Him only) addressing Him alone in their call, (but when He bringeth them safe to land, behold! they ascribe partners (unto Him)) they associate idols with Him,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالعجب منهم ومن حالهم كل العجب أنهم مع شركهم وإصرارهم على الكفر\n وعدم تأثرهم بالزواجر والروادع الواردة من قِبَل الحق\n ظهور المعجزات المزعجة إلى الإيمان { فَإِذَا رَكِبُواْ فِي ٱلْفُلْكِ دَعَوُاْ ٱللَّهَ } متضرعين نحوه { مُخْلِصِينَ لَهُ ٱلدِّينَ } أي: كائنين كالمؤمنين المطيعين\n الخالصين إطاعتهم وانقيادهم لله بلا شوب الشرك وشين الكفر { فَلَمَّا نَجَّاهُمْ } من كمال فضلنا وجودنا إياهم { إِلَى ٱلْبَرِّ } وأخلصناهم من المهلكة آمنين { إِذَا هُمْ يُشْرِكُونَ } [العنكبوت: 65] يعني: هم ما جاءوا على الفور بُعيْد ما خلصوا من التهلكة إلى الشرك والطغيان وأنواع العصيان والكفران\n\n\nقل لهم يا أكمل الرسل نيابةً عنا آمراً لهم على سبيل التهديد: { لِيَكْفُرُواْ } أولئك الكافرون { بِمَآ آتَيْنَاهُمْ } من النعم العظام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإذا رَكِبُوا في الفلك } ، هو مرتب على محذوف، دل عليه ما وصفهم به قَبْلُ، والتقدير: هم على ما هم عليه من الشرك والعناد، وإذا ركبوا في الفلك { دَعَوا الله مخلصين له الدين } ، أي: كائنين في صورة من يخلص الدين لله من المؤمنين، حيث لا يذكرون إلا الله، ولا يدعون معه إلهاً آخر، { فلما نجاهم إلى البر } ، وأمنوا من الغرق، { إذا هم يُشركون } ، أي: عادوا إلى حال الشرك، { ليكفروا بما آتيناهم } من النعمة، { وَلِيَتَمَّتعوا } باجتماعهم على عبادة الأصنام وتوادهم عليها\n واللام فيهما: إما لاَمُ كي، أي: يعودون إلى شركهم ليكونوا به كافرين بنعمة النجاة، قاصدين التمتع بها والتلذذ لا غير على خلاف عادة المؤمنين المخلصين فإنهم يشكرون نعمة الله إذا أنجاهم ويجعلون نعمة النجاة ذريعة إلى توحيده وطاعته لا إلى التلذذ والتمتع\n أو: لام الأمر، علة وجه التهديد، كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:12",
      "similarity": 0.5881156049588842
    },
    {
      "verse": "36:42",
      "similarity": 0.44240081700016143
    },
    {
      "verse": "40:79",
      "similarity": 0.4326977133618011
    },
    {
      "verse": "2:239",
      "similarity": 0.4153419481506404
    },
    {
      "verse": "36:72",
      "similarity": 0.3912791938575821
    }
  ]
}