{
  "chapter": "العنكبوت",
  "text": "اولم يروا۟ انا جعلنا حرما ءامنا ويتخطف الناس من حولهم افبالبطل يؤمنون وبنعمة الله يكفرون",
  "translations": [
    {
      "translation": "Do they not see that We have established a safe haven while people all round them are violently dispossessed? So why do they believe in falsehood and reject the blessing of Allah?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We have given them a safe sanctuary, while all around them men are being despoiled? Do they then believe what is false, and deny the bounty of God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We have given them a sanctuary of safety whereas people around them are being snatched away? So, do they believe in falsehood and ungratefully deny Allah's bounties?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the (pagans) not seen that We have made the holy precinct a safe place while all the people around are suffering terror. Do they believe in falsehood and disbelieve in God's bounties?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not observe that We have created a refuge in the Sacred Land, and people around them are snatched away? So do they believe in falsehood and are ungrateful for the favours of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We have made a secure sanctuary, while men are being snatched away from all around them Then do they believe in falsehood, and deny the graces of Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We have made a sacred territory secure, while men are carried off by force from around them? Will they still believe in the falsehood and disbelieve in the favour of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We have appointed a sanctuary secure, while all about them the people are snatched away? What, do they believe in vanity, and do they disbelieve in God's blessing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We have appointed a sanctuary immune (from violence), while mankind are ravaged all around them? Do they then believe in falsehood and disbelieve in the bounty of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We have granted them a safe sanctuary, though all around them people are snatched away? Would they still believe in falsehood, and deny the favour of God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold they not that We have appointed an inviolable sanctuary, while men are being snatched away round about them? in falsehood then believe they, and unto the favour of Allah will they be ingrate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We have appointed a safe sanctuary, while the people are despoiled all around them? Would they then believe in falsehood and be ungrateful toward the blessing of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then see that We have made a sanctuary secure, and that men are being snatched away from all around them? Then, do they believe in that which is vain, and reject the Grace of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We have made (Makkah) a sanctuary secure, and that men are being snatched away from all around them? Then do they believe in Batil (falsehood - polytheism, idols and all deities other than Allah), and deny (become ingrate for) the Graces of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how We appointed a safe Sanctuary while all around them people are snatched away? Would they believe in falsehood and do they disbelieve in the favor of Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We established a Secure Sanctuary, while all around them the people are being carried away? Do they believe in falsehood, and reject the blessings of God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We made [Makkah] a safe sanctuary, while people are being taken away all around them? Then in falsehood do they believe, and in the favor of Allah they disbelieve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:67] Or is it that they have not seen, [have not] realised, that We have appointed, their town of Mecca to be, a secure Sanctuary, while people are snatched away all around them?, by being killed or taken captive, except for them? Is it that they believe in falsehood, [in] the idol, and are [wont to be] ungrateful for God’s grace?, when they ascribe partners to Him?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَوَلَمْ يَرَوْا أَنَّا جَعَلْنَا حَرَمًا آَمِنًا وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَةِ اللَّهِ يَكْفُرُونَ (67)هذا تذكير خاص لأهل مكة وإنما خُصُّوا من بين المشركين من العرب لأن أهل مكة قدوة لجميع القبائل؛ ألا ترى أن أكثر قبائل العرب كانوا ينتظرون ماذا يكون من أهل مكة فلما اسلم أهل مكة يومَ الفتح أقبلت وفود القبائل معلنة إسلامهم . والجملة معطوفة على جملة { فإِذَا رَكبوا فِي الفُلك دَعُوا الله } \\[ العنكبوت : 65 \\] باعتبار ما اشتملت عليه تلك الجملة من تقريعهم على كفران نعم الله تعهالى ، ولذلك عقبت هذه الجملة بقولة { وبنعمة الله يكفرون } والاستفهام إِ ، كاري ، وجعلت نعمة أمن بلدهم كالشيء المشاهد فأنكر عليهم عدم رؤيته ، فقوله { أنا جعلنا حرماً آمناً } مفعول { يَرُوا } ومعنى هذه الآية يعلم مما تقدم عند الكلام على قوله تعالى : { وَقَالُوا إنْ نَتَّبِعْ الهُدَى معَكَ نُتخَطَّفْ من أرْضِنَا أوَ لَمْ نُمَكِّنْ لَهُمْ حرَماً آمِناً } في سورة \\[ القصص : 57 \\] ، وقد كان أهل مكة في بحبوحة من الأمن وكان غيرهم من القبائل حول مكة وما بعدُ منها يغزو بعضهم بعضاً ويتغاورون ويتناهون ، وأهل مكة آمنون لا يعدو عليهم أحد مع قتلهم ، فذكرهم الله هذه النعمة عليهم والباطل : هو الشرك كما تقدم عند قوله تعالى { والذين آمنوا بالباطل } في هذه السورة العنكبوت \\[ 52 \\] . و ( نِعْمَةَ الله ) المراد بها الجنس الذي منه إنجاؤهم من الغرق وما عداه من النِعم المحسوسة المعروفة ، ومن النِعم الخفية التي لو تأملوا لأدركوا عظمها ، ومنها نعمة الرسالة المحمدية . والمضارع في المواضع الثلاثة دال على تجدّد الفعل .\n\n",
      "translations": [
        {
          "translation": "(Have they not seen) i.e. the disbelievers of Mecca (that We have appointed a sanctuary immune (from violence)) such that they are not attacked in the Sacred Precinct, (while mankind are ravaged all around them) by their enemies? (Do they then believe in falsehood) do they believe in the devil and idols (and disbelieve in the bounty of Allah) which He gave them in the Sacred Precinct, thus rejecting Allah's divine Oneness?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } ينكرون نعمنا وإنعامنا إياهم أولئك الكافرون المبطلون { وَلَمْ يَرَوْاْ } ولم يعلموا أهل مكة { أَنَّا } من مقام جودنا وفضلنا إياهم { جَعَلْنَا } بلدهم\n يعني: مكة { حَرَماً } يعني: ذا حرمة عظيمة يأوي إليها الناس من جميع أقطار الأرض من لك مرمى سحيق وفج عميق { آمِناً } ذا أمن أهله من النهب والسبي وأنواع الأذى { وَيُتَخَطَّفُ } نهباً وسبياً\n وهم آمنون فيها\n مصونون عن المؤذيات كلها\n وهم مع ذلك يكفرون نعمنا ويشركون بنا غيرنا { أَ } أي: يختلس ويؤخذ { ٱلنَّاسُ مِنْ حَوْلِهِمْ } ما تستحيون من الله أيها المبطلون\n وما تخافون من بطشه أيها المفسدون المسرفون؟! { فَبِٱلْبَاطِلِ } العاطل الزاهق الزائل\n يعني: الأصنام والأوثان { يُؤْمِنُونَ } أي: يطيعون ويعبدون\n مع أنهم لا يقدرون على جلب نفع ودفع ضر { وَبِنِعْمَةِ ٱللَّهِ } القادر المقتدر القوي على البطش والانتقام { يَكْفُرُونَ } [العنكبوت: 67] فستعلمون أيها الجاهلون الضالون أيّ منقلب تنقلبون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { أَوَلَمْ يَرَوا } أي: أهل مكة { أنا جعلنا } بلدهم { حَرَماً } أي: ممنوعاً مصوناً من الهبب\n { آمِنا } يأمن كل من دخله\n أو آمناً أهله من القتل والسبي\n { ويُتَخَطّفُ الناس من حولهم } أي: يخطف بعضهم بعضاً\n قتلاً وسبياً\n إذ كانت العرب حوله في تغاور وتناهب\n { أفبالباطل يؤمنون } أبعد هذه النعمة العظمى يُؤمنون بالأصنام ويعبدونها\n أو: الشيطان\n { وبنعمة الله يكفرون } حيث أشركوا به غيْرَهُ\n أو بمحمد صلى الله عليه وسلم إذ هو النعمة المهداة\n أو: الإسلام\n وتقديم المعمولين للاهتمام\n أو للاختصاص",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:26",
      "similarity": 0.5034001275202614
    },
    {
      "verse": "28:57",
      "similarity": 0.4885031237183048
    },
    {
      "verse": "2:20",
      "similarity": 0.37011272502739595
    },
    {
      "verse": "37:10",
      "similarity": 0.2903751473857075
    },
    {
      "verse": "22:31",
      "similarity": 0.2679591807666953
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029067.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029067.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:67.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}