{
  "chapter": "العنكبوت",
  "text": "ليكفروا۟ بما ءاتينهم وليتمتعوا۟ فسوف يعلمون",
  "translations": [
    {
      "translation": "Let them be ungrateful for what We have given them! Let them enjoy themselves - they will soon know!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And deny what We had given them, in order to go on enjoying themselves. They will come to know soon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may be ungrateful for the rescue that We granted them, and that they may revel in the pleasures (of the present life). Soon they shall come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them be ungrateful to what We have granted them. Let them enjoy themselves, but they will soon know (the consequences of their deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to be ungrateful for Our favours; and to use the comforts; therefore they will soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they become ingrate for that which We have given them, and that they take their enjoyment, but they will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus they become ungrateful for what We have given them, so that they may enjoy; but they shall soon know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may be ungrateful for what We have given them, and take their enjoyment; they will soon know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may disbelieve in that which We have given them, and that they may take their ease. But they will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus they may show utter ingratitude for Our favours; let them enjoy themselves for a time. But they will soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they become ingrate for that which We have vouchsafed unto them, and that they enjoy themselves; but presently they shall know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being ungrateful for what We have given them! Let them enjoy. Soon they will know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disdaining ungratefully Our gifts, and giving themselves up to (worldly) enjoyment! But soon will they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they become ingrate for that which We have given them, and that they take their enjoyment (as a warning and a threat), but they will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "showing ingratitude for what We have given them and take their enjoyment; soon they shall know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To be ungrateful for what We have given them, and to enjoy themselves. They will surely come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they will deny what We have granted them, and they will enjoy themselves. But they are going to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:66] that they may be ungrateful for what We have bestowed on them, of graces, and that they may seek enjoyment, in consenting to worship idols together (a variant reading [for the purposive wa-li-yatamatta‘ū] has wa’l-yatamatta‘ū, ‘and let them seek their enjoyment’, as an imperative denoting a threat), for they will soon know!, the consequences of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That they may disbelieve in that which We have given them) such that they disbelieve in the bounties that We have given them, (and that they may take their ease) live comfortably in their state of disbelief. (But they will come to know) what will be done with them upon the descent of torment upon them. 455\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم يا أكمل الرسل نيابةً عنا آمراً لهم على سبيل التهديد: { لِيَكْفُرُواْ } أولئك الكافرون { بِمَآ آتَيْنَاهُمْ } من النعم العظام، سيما نعمة الإنجاء من مضيق البحر { وَلِيَتَمَتَّعُواْ } أولئك المتمتعون بما عندهم من الحطام الدنيوية، وما هم عليه من الإصرار على الكفر الضلال { فَسَوْفَ يَعلَمُونَ } [العنكبوت: 66] ما يترتب على كفرانهم وتمتعهم وشركهم وضلالهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الكهف: 29]، ويقويه: قراءةُ مَنْ سَكَّنَ الثانية، أي: ليكفروا وليتمتعوا { فسوف يعلمون } تدبيرهم عند تدميرهم\n الإشارة: الدنيا عند أهل الجد والاجتهاد جد، يتوصلون فيها إلى معرفة الحق، ويترقون منها إلى أسرار ومعارف لا يحصرها عقل ولا يحيط بها نقل، لأن في هذه الدار: عرفه من عرف، وجَهِلَهُ من جهله\n والترقي عند العارفين فيها أكثر لأنه يسير بين جلاله وجماله، وهناك ليس إلا الجمال، والترقي بين الضدين أعظم، فإذا مات بقي يترقى في أنوار الجمال على قدر ما أدرك هنا\n والله أعلم\n فتحصل أن الدنيا في حق أهل الغفلة لعب ولهو لأنها شغلتهم وغرتهم بزخارفها عن معرفة الله والوصول إليه، ولذلك حذّر منها صلى الله عليه وسلم، فقد قال في بعض خطبه:\n\n \" أيها الناس، لا تكونوا ممن خَدَعَتْهُ العاجلة، وغرته الأمنية، واستهوته الخدعة، فركن إلى دار سريعة الزوال، وشيكة الانتقال إذ لن يبقى من دنياكم هذه في جنب ما مضى إلا كإناخة راكب، أو درّ حالب، فعلام تعرجون؟ وما تنتظرون؟ فكأنكم، والله، بما قد أصبحتم فيه من الدنيا، كأن لم يكن، وما تصيرون إليه من الآخرة، لم يزل، فخذوا في الأهْبة لأزُوف النقلة، وأعدوا الزاد لقرب الرحلة، واعلموا أن كل إمرىء على ما قَدَّمَ قادِمٌ، وعلى ما خَلَّفَ نادمٌ \" \n",
      "translations": []
    }
  ]
}