{
  "chapter": "العنكبوت",
  "text": "الله يبسط الرزق لمن يشاء من عباده ويقدر له ان الله بكل شىء عليم",
  "translations": [
    {
      "translation": "Allah expands the provision of any of His slaves He wills and restricts it. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases the means of those of His creatures as He please, or limits them for whomsoever He will. He is certainly cognisant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlarges the sustenance of any of His servants whom He will, and straitens the sustenance of whom He will. Surely Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases the sustenance of whichever of His servants He wants and He determines their share. God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah eases the sustenance for whomever He wills among His bondmen, and restricts it for whomever He wills; indeed Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expands the provision for whom He wills of His servants, and straitens it for whom (He wills). Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah makes abundant the means of subsistence for whom He pleases of His servants, and straitens them for whom (He pleases) surely Allah is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God outspreads and straitens His provision to whomsoever He will of His servants; God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah maketh the provision wide for whom He will of His bondmen, and straiteneth it for whom (He will). Lo! Allah is Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gives abundantly to whom He will and sparingly to whom He pleases. God has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expandeth provision for whomsoever He Will of His bondmen and stinteth it for him. Verily Allah is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expands the provision for whomever He wishes of His servants, and tightens it for him. Indeed Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlarges the sustenance (which He gives) to whichever of His servants He pleases; and He (similarly) grants by (strict) measure, (as He pleases): for Allah has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlarges the provision for whom He wills of His slaves, and straitens it for whom (He wills). Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah outspreads and restricts His provision to whomsoever He will of His worshipers. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God expands the provision for whomever He wills of His servants, and restricts it. God is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah extends provision for whom He wills of His servants and restricts for him. Indeed Allah is, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:62]   God extends provision, He makes it abundant, for whomever He will of His servants, by way of a test, and He straitens, He restricts it, for him, after having extended it, that is, for whomever He will to try. Truly God has knowledge of all things, among them the occasion in which [it is appropriate for Him] to extend or to straiten.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah maketh the provision wide for whom He will of His bondmen) He gives abundant wealth to whom He will of His servants; and this is a lure to perdition for them, (and straiteneth it for whom (He will)) out of care for them. (Lo! Allah is Aware of all things) regarding giving in abundance or straitening His provision.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن صرفهم عن الإيمان فاقة أهل الإيمان وفقر الموحدين، قل لهم نيابة عنا: { ٱللَّهُ } المطلع لاستعدادات عباده وقابلياتهم { يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِ } على مقتضى استعداده { وَيَقْدِرُ لَهُ } ويقبض عنه حسب تعلق إرادته { إِنَّ ٱللَّهَ } المتقن في أفعاله { بِكُلِّ شَيْءٍ } صدر عنه إرادة واختياراً { عَلِيمٌ } [العنكبوت: 62] لا يعزب عن حيطة علمه شيء من لوازمه ومتمماته، وجميع مقتضياته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الله يَبسُطُ الرِزْقَ لمن يشاءُ من عباده } هاجر أو أقام في بلده، { ويقدرُ له } ويضيق عليه، أقام أو هاجر، فالضمير في { له } لمن يشاء لأنه مبهم غير معين، { إن الله بكل شيء عليم } يعلم ما يصلح العباد وما يفسدهم، فمنهم من يصله الفقر، ومنهم من يُفسده، ففي الحديث القدسي:\n\n \" إن من عبادي من لا يُصلح إيمانه إلاَّ الغنى، ولو أفقرته لأفسده ذلك، وإن من عبادي من لا يصلح إيمانه إلا الفقر، ولو أغنيته لأفسده ذلك \" \n\nذكره النسفي",
      "translations": []
    }
  ]
}