{
  "chapter": "العنكبوت",
  "text": "وكاين من دابة لا تحمل رزقها الله يرزقها واياكم وهو السميع العليم",
  "translations": [
    {
      "translation": "How many living things there are on the earth that do not Store their food; God provides them as well as you. He is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an animal there is that does not carry about its sustenance. Allah provides sustenance to them and to you. He is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are many living creatures which do not carry their sustenance, but God provides them and you with sustenance. He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many creatures walk upon the earth that do not carry their own sustenance; Allah provides the sustenance to them and to you; and only He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so many a moving creature carries not its own provision! Allah provides for it and for you. And He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a living creature that does not carry its sustenance: Allah sustains it and yourselves; and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a beast that bears not its own provision, but God provides for it and you! He is the All-hearer, the All-knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many an animal there is that beareth not its own provision! Allah provideth for it and for you. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many creatures cannot fend for themselves! God provides for them and for you. He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a moving creature there is that beareth not its provision! Allah provideth for it and for you. And He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an animal there is that does not carry its own provision. Allah provides them and you, and He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many are the creatures that carry not their own sustenance? It is Allah who feeds (both) them and you: for He hears and knows (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so many a moving (living) creature there is, that carries not its own provision! Allah provides for it and for you. And He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a beast does not bear its own provision. Allah provides for it, as (He provides) for you. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a creature there is that does not carry its provision? God provides for them, and for you. He is the Hearer, the Knowledgeable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a creature carries not its [own] provision. Allah provides for it and for you. And He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:60] And how many (ka-ayyin means kam) an animal there is that does not bear its own provision, on account of its inability [to do so]. Yet God provides for it, and for you, O Emigrants (al-muhājirūn), even when you carry with you neither supplies nor substance. And He is the Hearer, of your sayings, the Knower, of your consciences.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "But when Allah commanded them to migrate to Medina, they said: \"we do not have anyone there to give us shelter, food or drink\". And so Allah said: (And how many an animal there is that beareth not its own provision) for the morrow, except ants who store their yearly provision! (Allah provideth for it) for the animal that stores its provision and the animal that does not (and for you) believers. (He is the Hearer) when you say: \"who will provide for us?\", (the Knower) of your sustenance; He knows from whence to provide for you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَأَيِّن مِّن دَآبَّةٍ لاَّ تَحْمِلُ رِزْقَهَا } معناه وكأيِّن من دَابةٍ لاَ تَدّخرُ رِزقَها لَعلَ الله تعالى يَرزقُها بِفَضلِهِ ورَحمتِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أمر سبحانه المؤمنين بالجلاء ومفارقة الأوطان؛ لكسب الجمعية وحضور القلب، قالوا متخوفين عن العيلة والاضطرار في أمر المعاش: كيف نعمل ونعيش في بلاد الغربة، ولا معيشة لنا فيها، قال سحبانه تسليةً لهم، وإزالةً لخوفهم: { وَكَأَيِّن } أي: كثير { مِّن دَآبَّةٍ } تتحرك على الأرض محتاجة إلى الغذاء المقوم لمزاجها مع أنها لضعفها وعدم مكنتها { لاَّ تَحْمِلُ رِزْقَهَا } أي: لا تطيق لحمل رزقها وادخاره وكسبه { ٱللَّهُ } المتكفل لأرزاق عموم عباده { يَرْزُقُهَا } من حيث لا تحتسب { وَإِيَّاكُمْ } أيضاً، وأنتم من جملة الحيوانات التي تكفل الله برزقها، بل من أجلتها، فلا تغتموا لأجل الرزق، ولا تقولوا قولاً به زل نعلكم عن خالقكم ورازقكم { وَ } لا تُخطروا أيضاً ببالكم أمثال هذا؛ إذ { هُوَ ٱلسَّمِيعُ } لأقوالكم { ٱلْعَلِيمُ } [العنكبوت: 60] بأحوالكم وبيناتكم، فعليكم أن تتقوا في كل الأحوال بالله المتولي لأمركم، مفوضين كلها إليه، متوكلين عليه، متمكنين في توكلكم وتفويضكم، راسخين فيه بلا تلعثمٍ وتزلزلٍ\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وكأيِّن من دابة } أي: وكم دابة من داوب الأرض، عاقلة وغير عاقلة، { لا تحملُ رِزْقَها } لا تطيق أن تحمله لضعفها عن حمله، { اللهُ يرزقها وإياكم } أي: لا يرزق تلك الدواب الضعاف إلا الله، ولا يرزقكم أنتم أيها الأقوياء إلا الله، وإن كنتم مطيقين لحمل أرزاقكم وكسبها لأنه لو لم يخلق فيكم قدرة على كسبها، لكنتم أعجز من الدواب\n وعن الحسن: { لا تحمل رزقها }: لا تدخره، إنما تصبح خِمَاصاً، فيرزقها الله\n وقيل: لا يدخر من الحيوان قوتاً إلا ابن آدم والفأرة والنملة\n { وهو السميع } لقولكم: نخشى الفقر والعيْلة إن هاجرنا، { العليم } بما في ضمائركم من خوف فوات الرزق",
      "translations": []
    }
  ]
}