{
  "chapter": "العنكبوت",
  "text": "والذين ءامنوا۟ وعملوا۟ الصلحت لنكفرن عنهم سيـاتهم ولنجزينهم احسن الذى كانوا۟ يعملون",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions, We will erase their bad actions from them, and recompense them for the best of what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall pardon the sinful deeds of those who believe and do the right, and give them a reward better than their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do good deeds, We shall cleanse them of their evil deeds and reward them according to the best of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall expiate the sins of the righteously striving believers and shall reward them better than their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accepted faith and did good deeds – We will indeed relieve their sins and reward them for the best of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and do righteous good deeds, surely, We shall expiate from them their evil deeds and We shall indeed reward them according to the best of that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and do good, We will most certainly do away with their evil deeds and We will most certainly reward them the best of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe, and do righteous deeds, We shall surely acquit them of their evil deeds, and shall recompense them the best of what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe and do good works, We shall remit from them their evil deeds and shall repay them the best that they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as for those who have faith and do good works, We shall certainly cleanse them of their evil deeds and reward them according to the best of their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever believe and work righteous works, We shall purge away from them their ill-deeds and shall recompense them the best of that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have faith and do righteous deeds, We will absolve them of their misdeeds and We will surely reward them by the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and work righteous deeds,- from them shall We blot out all evil (that may be) in them, and We shall reward them according to the best of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe [in the Oneness of Allah (Monotheism) and in Messenger Muhammad SAW, and do not apostate because of the harm they receive from the polytheists], and do righteous good deeds, surely, We shall remit from them their evil deeds and shall reward them according to the best of that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works, We shall acquit them of their sins, and recompense them with the best for what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do righteous deeds—We will remit their sins, and We will reward them according to the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do righteous deeds - We will surely remove from them their misdeeds and will surely reward them according to the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[29:7] And those who believe and perform righteous deeds, We will surely absolve them of their misdeeds, by their performance of righteous deeds, and We will indeed requite them with the best of what they used to do, namely, their righteous deeds (it [ahsana] is in the accusative because the operator of the oblique [bi] has been omitted).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for those who believe) 'AN and his two fellow companions (and do good works) and perform acts of obedience between themselves and their Lord, (We shall remit from them their evil deeds) We shall expiate their minor sins but not the enormities they commit (and shall repay them the best that they did) in their striving.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه حثاً لعباده على التوجه نحو بابه\n ليفوزوا بما أعد لهم من الحسنات والدرجات: { وَٱلَّذِينَ آمَنُواْ } وأخلصوا إيمانهم { وَعَمِلُواْ ٱلصَّالِحَاتِ } المشعرة المؤيدة لإخلاصهم بلا شوب الهوى والرياء والرعونات أصلاً { لَنُكَفِّرَنَّ عَنْهُمْ } ونمحون عن ديوان أعمالهم { سَيِّئَاتِهِمْ } التي جاءوا بها وقت جهلهم وضلالهم { وَلَنَجْزِيَنَّهُمْ } نعاملن معهم { أَحْسَنَ ٱلَّذِي كَانُواْ يَعْمَلُونَ } [العكبوت: 7] يعني: أحسن من الجزاء الذي كانوا يستحقون بأعمالهم بعد إيمانهم وأزيد منه بأضعافه تفضلاً وإحساناً\n\n\nوبعدما حثهم سبحانه على الإيمان والعمل الصالح أوحى لهم أمرهم ببر الوالدين وحسن المعاشرة معهما والتحنن إليهما",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولنجزينهم } مع غنانا عنهم\n { أحسنَ الذين كانوا يعملون } أي: أحسن جزاء أعمالهم بالفضل والكرم\n والله تعالى أعلم\n الإشارة: أم حسب الذين يُنكرون على أوليائي\n المنتسبين إليّ\n أن يسبقونا؟ بل لا بد أن نعاقبهم في الدنيا والآخرة\n إما في الظاهر بمصيبة تنزل بهم\n أو في الباطن\n وهو أقبح\n كقساوة في قلوبهم\n أو: كسل في بدنهم\n أو: شك في يقينهم\n أو: بُعد من ربهم\n فإن من عادى لي ولياً فقد آذنته بالحرب\n ثم بشّر المتوجهين الذين يؤذَون في جانبه\n بأن لقاءه حاصل لهم إن صبروا\n وهو الوصول إلى حضرته\n والتنعم بقربه ومشاهدته\n جزاء على صبرهم ومجاهدتهم\n وهو الغَنِي بالإطلاق\n ثم حذّر من طاعة من يرد عن التوحيد والاخلاص\n فقال: { وَوَصَّيْنَا ٱلإِنْسَانَ بِوَالِدَيْهِ حُسْناً\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:35",
      "similarity": 0.72446883329407
    },
    {
      "verse": "53:31",
      "similarity": 0.6750032287028059
    },
    {
      "verse": "28:84",
      "similarity": 0.6378313970069459
    },
    {
      "verse": "41:27",
      "similarity": 0.5570000098906699
    },
    {
      "verse": "30:45",
      "similarity": 0.5098071084501924
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/029007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/029007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/29:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}