{
  "chapter": "البقرة",
  "text": "فى قلوبهم مرض فزادهم الله مرضا ولهم عذاب اليمۢ بما كانوا۟ يكذبون",
  "translations": [
    {
      "translation": "There is a sickness in their hearts and Allah has increased their sickness. They will have a painful punishment on account of their denial.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sick are their hearts, and God adds to their malady. For them is suffering for they lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease which Allah has increased all the more and a painful doom is in store for them for the lie they utter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sickness exists in their hearts to which God adds more sickness. Besides this, they will suffer a painful punishment as a result of the lie which they speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, so Allah has increased their disease; and for them is a painful punishment, because of their lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease and Allah has increased their disease. A painful torment is theirs because they used to tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a disease in their hearts, so Allah added to their disease and they shall have a painful chastisement because they lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a sickness, and God has increased their sickness, and there awaits them a painful chastisement for that they have cried lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, and Allah increaseth their disease. A painful doom is theirs because they lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, which God has increased. They will have a painful punishment, because they have been lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, so Allah hath increased unto them that disease; and unto them shall be a torment afflictive, for they have been lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a sickness in their hearts; then Allah increased their sickness, and there is a painful punishment for them because of the lies they used to tell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease; and Allah has increased their disease: And grievous is the penalty they (incur), because they are false (to themselves).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease (of doubt and hypocrisy) and Allah has increased their disease. A painful torment is theirs because they used to tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a sickness in their hearts which Allah has increased. For them there is a painful punishment because they lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is sickness, and God has increased their sickness. They will have a painful punishment because of their denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is disease, so Allah has increased their disease; and for them is a painful punishment because they [habitually] used to lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:10] In their hearts is a sickness: doubt and hypocrisy, which ails their hearts, debilitating them; and God has increased their sickness with what He has revealed in the Qur’ān, since they disbelieve it; and there awaits them a painful chastisement because they used to lie (read yukadhdhibūn to imply [that they used to call] the Prophet of God [a liar], or yakdhibūn to imply their [mendacity when] saying ‘we believe’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In their hearts is a disease), doubt, hypocrisy, conflict and darkness (so Allah increaseth their disease), increased their doubt, hypocrisy, conflict and darkness. (And a painful doom is theirs), they will have a painful torment in the Hereafter which shall extend to their hearts, (because they lie) in secret, the reference here being to the hypocrites: 'Abdullah ibn Ubayy, Jadd Ibn Qays and Mu'attib Ibn Qushayr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فِي قُلُوبِهِم مَّرَضٌ } أي شَكٌّ ونِفاقٌ\n\n\n\n\nوقولهُ تعالى: { عَذَابٌ أَلِيمٌ } [أي] مُوجِعٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in their hearts is a disease} [means] doubt and hypocrisy.\n\n\nAnd His saying, { \"a punishment most painful\" } [i.e. a severe punishment].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ في قلوبِهِم مرضٌ } أي شك ونفاق تنكير المرض\n وإيراد الجملة الظرفية إشارة إلى عروض المرض واستقراره ورسوخه فيها كما أشرنا إليه في التقسيم\n وإلا لقال قلوبهم مرضى أو موتى\n { فزادهم الله مرضاً } أي: آخر حقداً وحسداً وغلاً بإعلاء كلمة الدين\n ونصرة الرسول والمؤمنين\n والرذائل كلها أمراض القلوب لأنها أسباب ضعفها وآفتها في أفعالها الخاصة\n وهلاكها في العاقبة\n وفرق بين العذابين بالألم للمنافقين\n والعظم للكافرين\n لأن عذاب المطرودين في الأزل أعظم فلا يجدون شدّة ألمه لعدم صفاء إدراك قلوبهم\n كحال العضو الميت\n أو المفلوج والخدل بالنسبة إلى ما يجري عليه من القطع والكيّ وغير ذلك من الآلام\n وأما المنافقون فلثبوت استعدادهم في الأصل وبقاء إدراكهم يجدون شدّة الألم فلا جرم كان عذابهم مؤلماً مسبباً عن المرض العارض المزمن الذي هو الكذب ولواحقه\n وإذا نهوا عن الإفساد في الأرض\n أي في الجهة السفلية التي هي النفوس وما يتعلق بها من المصالح بتكدير النفوس\n وتهييج الفتن والحروب\n والعداوة والبغضاء بين الناس\n أنكروا وبالغوا في إثبات الإصلاح لأنفسهم\n إذ يرون الصلاح في تحصيل المعاش وتيسير أسبابه\n وتنظيم أمور الدنيا لأنفسهم خاصة\n لتوغلهم في محبة الدنيا وانهماكهم في اللذات البدنية\n واحتجابهم بالمنافع الجزئية\n والملاذ الحسيّة عن المصالح العامة الكليّة\n واللذات العقلية\n وبذلك يتيسر مرادهم\n ويتسهل مطلوبهم وهم لا يحسون بإفسادهم المدرك بالحس\n وإذا دعوا إلى الإيمان الحقيقي\n كإيمان فقراء المسلمين والصعاليك المجرّدين\n سفهوهم لمكان تركهم لحطام الدنيا وإعراضهم عن متاعها ولذاتها وطيباتها\n لزهدهم الحقيقي\n إذ قصارى همومهم\n وقصوى مقاصد عقولهم الأسيرة في قيد الهوى المشوبة بالوهم\n المؤدّية لهم إلى الردى هي تلك اللذات يعلمون ظاهراً من الحياة الدنيا وهم عن الآخرة هم غافلون\n ولا يعلمون أن غاية السفه هو اختيار الفاني الأخس على الباقي الأشرف\n وفرق بين الفاصلتين بالشعور والعلم\n لأنّ تأثير خداعهم في أنفسهم وإفسادهم في الأرض أمر بيِّن كالمحسوس\n وأما ترجيح نعيم الآخرة على نعيم الدنيا المستلزم للفرق بين السفه والحكمة فأمر استدلالي عقليّ صرف",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولما لم يؤمنوا به ولم يلتفتوا إليه بل كذبوا رسوله المنزل عليهم { فَزَادَهُمُ ٱللَّهُ مَرَضاً } إحكاماً لختمه وتأكيداً لحكمه { وَلَهُم } في يوم الجزاء { عَذَابٌ } هو إبعادهم وطردهم عن ساحة عز الحضور { أَلِيمٌ } مؤلم بسبب تقريب المؤمنين إلى دار السرور جزاء { بِمَا كَانُوا يَكْذِبُونَ } [البقرة: 10] ويقولون بأفواههم ما ليس في قلوبهم خداعاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَزَادَهُمُ اللَّهُ مَرَضاً } على مرضهم بما ينزل عليهم من الآيات التي تفضحهم\n { وَلَهُمْ } في الآخرة - إذا قدموا على الله - { عَذَابٌ } موجع بسبب تكذيبهم رسول الله أو كذبهم على الله\n هذا مُضَمَّنُ الآية\n افتتح الحق - جلّ جلاله - بذكر الذين أخلصوا دينهم لله وواطأت فيه قلوبهم ألسنتهم\n ثم ثنى بالكافرين الذين محضوا الكفر ظاهراً وباطناً\n ثم ثلث بالمنافقين الذين آمنوا بأفواههم ولم تؤمن قلوبهم\n وهم أخبث الكفرة لأنهم خلطوا بالكفر استهزاء وخداعاً\n ولذلك كانوا في الدرك الأسفل من النار\n الإشارة: ومن الناس مَن يترامى بالدعوى على الخصوصية\n ويدعي تحقيق مشاهدة الربوبية\n وهو في الدرك الأسفل من العمومية\n يظهر خلوص الإيمان وتحقيق العرفان\n وهو في أودية الشكوك والخواطر حيران\n وفي فيافي القطيعة والفَرْقِ ظمآن\n لسانه منطلق بالدعوى\n وقلبه خارب من الهدي\n يخادع الله بالرضا عن عيوبه ومساوئه\n ويخادع المسلمين بتزيين ظاهره\n وباطنه معمور بحظوظه ومهاويه\n يتزيى بِزِيِّ العارفين ويتعامل معاملة الجاهلين\n ويصدق عليه قول القائل:\nوما يخادع في الحقيقة إلا نفسه\n حيث حرمها الوصول\n وتركها في أودية الأكوان تجول\n قلبه بمرض الفرق والقطعية سقيم\n وهو يظن أنه في عداد مَن يأتي الله بقلب سليم\n فزاده الله مرضاً على مرضه حيث رضي بسقمه وعيبه\n وله عذاب الحرص والتعب في ضيق الحجاب والنصب بسبب كذبه على الله\n وإنكاره على أولياء الله\n فجزاؤه البعد والخذلان\n وسوء العاقبة والحرمان\n عائذاً بالله من المكر والطغيان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:12",
      "similarity": 0.4728005670001424
    },
    {
      "verse": "9:125",
      "similarity": 0.4520510644430901
    },
    {
      "verse": "8:49",
      "similarity": 0.40731351582251607
    },
    {
      "verse": "47:20",
      "similarity": 0.3320982719084972
    },
    {
      "verse": "74:31",
      "similarity": 0.3274762362387202
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/2:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/2:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/2:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}