{
  "chapter": "البقرة",
  "text": "فى قلوبهم مرض فزادهم الله مرضا ولهم عذاب اليمۢ بما كانوا۟ يكذبون",
  "translations": [
    {
      "translation": "There is a sickness in their hearts and Allah has increased their sickness. They will have a painful punishment on account of their denial.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sick are their hearts, and God adds to their malady. For them is suffering for they lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease which Allah has increased all the more and a painful doom is in store for them for the lie they utter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sickness exists in their hearts to which God adds more sickness. Besides this, they will suffer a painful punishment as a result of the lie which they speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, so Allah has increased their disease; and for them is a painful punishment, because of their lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease and Allah has increased their disease. A painful torment is theirs because they used to tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a disease in their hearts, so Allah added to their disease and they shall have a painful chastisement because they lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a sickness, and God has increased their sickness, and there awaits them a painful chastisement for that they have cried lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, and Allah increaseth their disease. A painful doom is theirs because they lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, which God has increased. They will have a painful punishment, because they have been lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease, so Allah hath increased unto them that disease; and unto them shall be a torment afflictive, for they have been lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a sickness in their hearts; then Allah increased their sickness, and there is a painful punishment for them because of the lies they used to tell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease; and Allah has increased their disease: And grievous is the penalty they (incur), because they are false (to themselves).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is a disease (of doubt and hypocrisy) and Allah has increased their disease. A painful torment is theirs because they used to tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a sickness in their hearts which Allah has increased. For them there is a painful punishment because they lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is sickness, and God has increased their sickness. They will have a painful punishment because of their denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their hearts is disease, so Allah has increased their disease; and for them is a painful punishment because they [habitually] used to lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:10] In their hearts is a sickness: doubt and hypocrisy, which ails their hearts, debilitating them; and God has increased their sickness with what He has revealed in the Qur’ān, since they disbelieve it; and there awaits them a painful chastisement because they used to lie (read yukadhdhibūn to imply [that they used to call] the Prophet of God [a liar], or yakdhibūn to imply their [mendacity when] saying ‘we believe’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف محض لعَدِّ مساويهم ويجوز أن يكون بيانياً لجواب سؤال متعجب ناشىء عن سماع الأحوال التي وصفوا بها قبل في قوله تعالى : { يخادعون الله والذين آمنوا وما يخدعون إلا أنفسهم وما يشعرون } \\[ البقرة : 9 \\] فإن من يسمع أن طائفة تخادع الله تعالى وتخادع قوماً عديدين وتطمع أن خداعها يتمشى عليهم ثم لا تشعر بأن ضرر الخداع لاحق بها لطائفة جديرة بأن يتعجب من أمرها المتعجب ويتساءل كيف خطر هذا بخواطرها فكان قوله : { في قلوبهم مرض } بياناً وهو أن في قلوبهم خللاً تزايد إلى أن بلغ حد الأفن . ولهذا قدم الظرف وهو { في قلوبهم } للاهتمام لأن القلوب هي محل الفكرة في الخداع فلما كان المسؤول عنه هو متعلقها وأثرها كان هو المهتم به في الجواب . وتنوين { مرض } للتعظيم . وأطلق القلوب هنا على محل التفكير كما تقدم عند قوله تعالى : { ختم الله على قلوبهم } \\[ البقرة : 7 \\] .والمرض حقيقة في عارض للمزاج يخرجه عن الاعتدال الخاص بنوع ذلك الجسم خروجاً غير تام وبمقدار الخروج يشتد الألم فإن تم الخروج فهو الموت ، وهو مجاز في الأعراض النفسانية العارضة للأخلاق البشرية عروضاً يخرجها عن كمالها ، وإطلاق المرض على هذا شائع مشهور في كلام العرب ، وتدبير المزاج لإزالة هذا العارض والرجوع به إلى اعتداله هو الطب الحقيقي ومجازي كذلك قال علقمة بن عبدة الملقب بالفحل :فإن تسألوني بالنساءِ فإنني ... خبير بأدواء النساء طَبيبفذكر الأدواء والطب لفساد الأخلاق وإصلاحها .والمراد بالمرض في هاته الآية هو معناه المجازي لا محالة لأنه هو الذي اتصف به المنافقون وهو المقصود من مذمتهم وبيان منشأ مساوي أعمالهم .ومعنى { فزادهم الله مرضاً } أن تلك الأخلاق الذميمة الناشئة عن النفاق والملازمة له كانت تتزايد فيهم بتزايد الأيام لأن من شأن الأخلاق إذا تمكنت أن تتزايد بتزايد الأيام حتى تصير ملكات كما قال المعلوط القُرَيْعي :ورَجِّ الفتى للخير ما إنْ رأيتَه ... على السِّنِّ خيراً لا يزال يزيدوكذلك القول في الشر ولذلك قيل : من لم يتحلم في الصغر لا يتحلم في الكبر ، وقال النابغة يهجو عامر بن الطفيل :فإنك سوف تحلم أو تَنَاهَى ... إذا ماشِبْتَ أو شاب الغرابوإنما كان النفاق موجباً لازدياد ما يقارنه من سيء الأخلاق لأن النفاق يستر الأخلاق الذميمة فتكون محجوبة عن الناصحين والمربين والمرشدين وبذلك تتأصل وتتوالد إلى غير حد فالنفاق في كتمه مساوىء الأخلاق بمنزلة كتم المريض داءه عن الطبيب ، وإليك بيان ما ينشأ عن النفاق من الأمراض الأخلاقية في الجدول المذكور هنا وأشرنا إلى ما يشير إلى كل خلق منها في الآيات الواردة هنا أو في آيات أخرى في هذا الجدول :صفحة مستقلة للرسم ص 280 الأصل .اعلم أن هذه طباع تنشأ عن النفاق أو تقارنه من حيث هو ولا سيما النفاق في الدين فقد نبهنا الله تعالى لمذام ذلك تعليماً وتربية فإن النفاق يعتمد على ثلاث خصال وهي : الكذب القولي ، والكذب الفعلي وهو الخداع ، ويقارن ذلك الخوف لأن الكذب والخداع إنما يصدران ممن يتوقى إظهار حقيقة أمره وذلك لا يكون إلا لخوف ضر أو لخوف إخفاق سعي وكلاهما مؤذن بقلة الشجاعة والثبات والثقةِ بالنفس وبحسن السلوك ، ثم إن كل خصلة من هاته الخصال الثلاث الذميمة توكّد هنَوات أخرى ، فالكذب ينشأ عن شيء من البله لأن الكاذب يعتقد أن كذبه يتمشى عند الناس وهذا من قلة الذكاء لأن النبيه يعلم أن في الناس مثله وخيراً منه ، ثم البله يؤدي إلى الجهل بالحقائق وبمراتب العقول ، ولأن الكذب يعود فِكر صاحبه بالحقائق المحرَّفة وتشتبه عليه مع طول الاسترسال في ذلك حتى إنه ربما اعتقد ما اختلقه واقعاً ، وينشأ عن الأمرين السفه وهو خلل في الرأي وأَفَن في العقل ، وقد أصبح علماء الأخلاق والطب يعدون الكذب من أمراض الدماغ .وأما نشأةُ العجب والغرور والكفر وفساد الرأي عن الغباوة والجهل والسفهِ فظاهرة ، وكذلك نشأة العزلة والجبن والتستر عن الخوف ، وأما نشأة عداوة الناس عن الخداع فلأن عداوة الأضداد تبدأُ من شعورهم بخداعه ، وتعقبها عداوة الأصحاب لأنهم إذا رأوا تفنن ذلك الصاحب في النفاق والخداع داخلهم الشك أن يكون إخلاصه الذي يظهره لهم هو من المخادعة فإذا حصلت عداوة الفريقين تصدى الناس كلهم للتوقي منه والنكاية به ، وتصدى هو للمكر بهم والفساد ليصل إلى مرامه ، فرمته الناس عن قَوس واحدة واجتنى من ذلك أن يصير هُزأة للناس أجمعين .وقد رأيتم أن الناشىء عن مرض النفاق والزائد فيه هو زيادة ذلك الناشىء أي تأصله وتمكنه وتولد مذمات أخرى عنه ، ولعل تنكير ( مرض ) في الموضعين أشعر بهذا فإن تنكير الأول للإشارة إلى تنويععٍ أو تكثيرٍ ، وتنكيرَ الثاني ليشير إلى أن المزيد مرض آخر على قاعدة إعادةِ النكرةِ نكرةً .وإنما أسندت زيادة مرض قلوبهم إلى الله تعالى مع أن زيادة هاته الأمراض القلبية من ذاتها لأن الله تعالى لما خلَق هذا التولُّد وأسبابه وكان أمراً خفياً نبه الناس على خطر الاسترسال في النوايا الخبيثة والأعمال المنكرة ، وأنه من شأنه أن يزيد تلك النوايا تمكناً من القلب فيعسر أو يتعذر الإقلاع عنها بعد تمكنها ، وأسندت تلك الزيادة إلى اسمه تعالى لأن الله تعالى غضب عليهم فأهملهم وشأنهم ولم يتداركهم بلطفه الذي يوقظهم من غفلاتهم لينبه المسلمين إلى خطر أمرها وأنها مما يعسر إقلاع أصحابها عنها ليكون حذرهم من معاملتهم أشد ما يمكن .فجملة : { فزادهم الله مرضاً } خبرية معطوفة على قوله : { في قلوبهم مرض } واقعة موقع الاستئناف للبيان ، داخلةٌ في دفع التعجب ، أي إن سبب توغلهم في الفساد ومحاولتهم ما لا يُنال لأن في قلوبهم مرضاً ولأنه مرض يتزايد مع الأيام تزايداً مجعولاً من الله فلا طمع في زواله .وقال بعض المفسرين : هي دعاءٌ عليهم كقول جبير بن الأضبط :تَبَاعَد عني فَطْحَل إذْ دَعوتُه ... أَمِينَ فزادَ الله مَا بينَنا بُعداوهو تفسير غير حسن لأنه خلاف الأصل في العطف بالفاء ولأن تصدي القرآن لشتمهم بذلك ليس من دأبه ، ولأن الدعاء عليهم بالزيادة تنافي ما عهد من الدعاء للضالين بالهداية في نحو : «اللهم اهدِ قومي فإنهم لا يعلمون» .وقوله : { ولهم عذاب أليم بما كانوا يكذبون } معطوف على قوله : { فزادهم الله مرضاً } إكمالاً للفائدة فكمل بهذا العطف بيانُ ما جره النفاق إليهم من فساد الحال في الدنيا والعذاب في الآخرة . وتقديم الجار والمجرور وهو { لهم } للتنبيه على أنه خبر لانعت حتى يستقر بمجرد سماع المبتدأ العلم بأن ذلك من صفاتهم فلا تلهو النفس عن تلقيه .والأليم فَعيل بمعنى مفعول لأن الأكثر في هذه الصيغة أن الرباعي بمعنى مُفعَل وأصله عذاب مؤلَم بصيغة اسم المفعول أي مؤلَمٌ من يعذَّب به على طريقة المجاز العقلي لأن المؤلَم هو المعذب دون العذاب كما قالوا جَدّ جِدّه ، أو هو فعيل بمعنى فاعل من أَلِمَ بمعنى صار ذا ألَم ، وإما أن يكون فعيل بمعنى مفعِل أي مؤلِمْ بكسر اللام ، فقيل لم يثبت عن العرب في هذه المادة وثبت في نظيرها نحو الحَكيم والسميع بمعنى المسمِع كقول عمرو بن معديكرب :وخيلٍ قد دَلَفْتُ لها بخيل ... تحيةُ بينهم ضرب وَجِيعأي موجع ، واختلف في جواز القياس عليه والحق أنه كثير في الكلام البليغ وأن منع القياس عليه للمولدين قصد منه التباعد عن مخالفة القياس بدون داع لئلا يلتبس حال الجاهل بحال البليغ فلا مانع من تخريج الكلام الفصيح عليه .وقوله : { بما كانوا يكذبون } الباء للسببية . وقرأ الجمهور ( يُكذِّبون ) بضم أوله وتشديد الذال . وقرأه عاصم وحمزة والكسائي وخلف بفتح أوله وتخفيف الذال أي بسبب تكذيبهم الرسول وإخبارَه بأنه مرسل من الله وأن القرآن وحي الله إلى الرسول ، فمادة التفعيل للنسبة إلى الكذب مثل التعديل والتجريح ، وأما قراءة التخفيف فعلى كذبهم الخاص في قولهم : { آمنا بالله } \\[ البقرة : 8 \\] وعلى كذبهم العام في قولهم : { إنما نحن مصلحون } \\[ البقرة : 11 \\] فالمقصود كذبهم في إظهار الإيمان وفي جعل أنفسهم المصلحين دون المؤمنين .والكذب ضد الصدق ، وسيأتي عند قوله تعالى : { ولكن الذين كفروا يفترون على الله الكذب } في سورة المائدة ( 103 ) . و ( ما ) المجرورة بالباء مصدرية ، والمصدر هو المنسبك من كان أي الكون .\n\n",
      "translations": [
        {
          "translation": "(In their hearts is a disease), doubt, hypocrisy, conflict and darkness (so Allah increaseth their disease), increased their doubt, hypocrisy, conflict and darkness. (And a painful doom is theirs), they will have a painful torment in the Hereafter which shall extend to their hearts, (because they lie) in secret, the reference here being to the hypocrites: 'Abdullah ibn Ubayy, Jadd Ibn Qays and Mu'attib Ibn Qushayr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فِي قُلُوبِهِم مَّرَضٌ } أي شَكٌّ ونِفاقٌ\n\n\n\n\nوقولهُ تعالى: { عَذَابٌ أَلِيمٌ } [أي] مُوجِعٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in their hearts is a disease} [means] doubt and hypocrisy.\n\n\nAnd His saying, { \"a punishment most painful\" } [i.e. a severe punishment].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ في قلوبِهِم مرضٌ } أي شك ونفاق تنكير المرض\n وإيراد الجملة الظرفية إشارة إلى عروض المرض واستقراره ورسوخه فيها كما أشرنا إليه في التقسيم\n وإلا لقال قلوبهم مرضى أو موتى\n { فزادهم الله مرضاً } أي: آخر حقداً وحسداً وغلاً بإعلاء كلمة الدين\n ونصرة الرسول والمؤمنين\n والرذائل كلها أمراض القلوب لأنها أسباب ضعفها وآفتها في أفعالها الخاصة\n وهلاكها في العاقبة\n وفرق بين العذابين بالألم للمنافقين\n والعظم للكافرين\n لأن عذاب المطرودين في الأزل أعظم فلا يجدون شدّة ألمه لعدم صفاء إدراك قلوبهم\n كحال العضو الميت\n أو المفلوج والخدل بالنسبة إلى ما يجري عليه من القطع والكيّ وغير ذلك من الآلام\n وأما المنافقون فلثبوت استعدادهم في الأصل وبقاء إدراكهم يجدون شدّة الألم فلا جرم كان عذابهم مؤلماً مسبباً عن المرض العارض المزمن الذي هو الكذب ولواحقه\n وإذا نهوا عن الإفساد في الأرض\n أي في الجهة السفلية التي هي النفوس وما يتعلق بها من المصالح بتكدير النفوس\n وتهييج الفتن والحروب\n والعداوة والبغضاء بين الناس\n أنكروا وبالغوا في إثبات الإصلاح لأنفسهم\n إذ يرون الصلاح في تحصيل المعاش وتيسير أسبابه\n وتنظيم أمور الدنيا لأنفسهم خاصة\n لتوغلهم في محبة الدنيا وانهماكهم في اللذات البدنية\n واحتجابهم بالمنافع الجزئية\n والملاذ الحسيّة عن المصالح العامة الكليّة\n واللذات العقلية\n وبذلك يتيسر مرادهم\n ويتسهل مطلوبهم وهم لا يحسون بإفسادهم المدرك بالحس\n وإذا دعوا إلى الإيمان الحقيقي\n كإيمان فقراء المسلمين والصعاليك المجرّدين\n سفهوهم لمكان تركهم لحطام الدنيا وإعراضهم عن متاعها ولذاتها وطيباتها\n لزهدهم الحقيقي\n إذ قصارى همومهم\n وقصوى مقاصد عقولهم الأسيرة في قيد الهوى المشوبة بالوهم\n المؤدّية لهم إلى الردى هي تلك اللذات يعلمون ظاهراً من الحياة الدنيا وهم عن الآخرة هم غافلون\n ولا يعلمون أن غاية السفه هو اختيار الفاني الأخس على الباقي الأشرف\n وفرق بين الفاصلتين بالشعور والعلم\n لأنّ تأثير خداعهم في أنفسهم وإفسادهم في الأرض أمر بيِّن كالمحسوس\n وأما ترجيح نعيم الآخرة على نعيم الدنيا المستلزم للفرق بين السفه والحكمة فأمر استدلالي عقليّ صرف",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولما لم يؤمنوا به ولم يلتفتوا إليه بل كذبوا رسوله المنزل عليهم { فَزَادَهُمُ ٱللَّهُ مَرَضاً } إحكاماً لختمه وتأكيداً لحكمه { وَلَهُم } في يوم الجزاء { عَذَابٌ } هو إبعادهم وطردهم عن ساحة عز الحضور { أَلِيمٌ } مؤلم بسبب تقريب المؤمنين إلى دار السرور جزاء { بِمَا كَانُوا يَكْذِبُونَ } [البقرة: 10] ويقولون بأفواههم ما ليس في قلوبهم خداعاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَزَادَهُمُ اللَّهُ مَرَضاً } على مرضهم بما ينزل عليهم من الآيات التي تفضحهم\n { وَلَهُمْ } في الآخرة - إذا قدموا على الله - { عَذَابٌ } موجع بسبب تكذيبهم رسول الله أو كذبهم على الله\n هذا مُضَمَّنُ الآية\n افتتح الحق - جلّ جلاله - بذكر الذين أخلصوا دينهم لله وواطأت فيه قلوبهم ألسنتهم\n ثم ثنى بالكافرين الذين محضوا الكفر ظاهراً وباطناً\n ثم ثلث بالمنافقين الذين آمنوا بأفواههم ولم تؤمن قلوبهم\n وهم أخبث الكفرة لأنهم خلطوا بالكفر استهزاء وخداعاً\n ولذلك كانوا في الدرك الأسفل من النار\n الإشارة: ومن الناس مَن يترامى بالدعوى على الخصوصية\n ويدعي تحقيق مشاهدة الربوبية\n وهو في الدرك الأسفل من العمومية\n يظهر خلوص الإيمان وتحقيق العرفان\n وهو في أودية الشكوك والخواطر حيران\n وفي فيافي القطيعة والفَرْقِ ظمآن\n لسانه منطلق بالدعوى\n وقلبه خارب من الهدي\n يخادع الله بالرضا عن عيوبه ومساوئه\n ويخادع المسلمين بتزيين ظاهره\n وباطنه معمور بحظوظه ومهاويه\n يتزيى بِزِيِّ العارفين ويتعامل معاملة الجاهلين\n ويصدق عليه قول القائل:\nوما يخادع في الحقيقة إلا نفسه\n حيث حرمها الوصول\n وتركها في أودية الأكوان تجول\n قلبه بمرض الفرق والقطعية سقيم\n وهو يظن أنه في عداد مَن يأتي الله بقلب سليم\n فزاده الله مرضاً على مرضه حيث رضي بسقمه وعيبه\n وله عذاب الحرص والتعب في ضيق الحجاب والنصب بسبب كذبه على الله\n وإنكاره على أولياء الله\n فجزاؤه البعد والخذلان\n وسوء العاقبة والحرمان\n عائذاً بالله من المكر والطغيان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:12",
      "similarity": 0.4728005670001424
    },
    {
      "verse": "9:125",
      "similarity": 0.4520510644430901
    },
    {
      "verse": "8:49",
      "similarity": 0.40731351582251607
    },
    {
      "verse": "47:20",
      "similarity": 0.3320982719084972
    },
    {
      "verse": "74:31",
      "similarity": 0.3274762362387202
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}