{
  "chapter": "البقرة",
  "text": "وقالوا۟ اتخذ الله ولدا سبحنه بل له ما فى السموت والارض كل له قنتون",
  "translations": [
    {
      "translation": "They say, 'Allah has a son.' Glory be to Him! No, everything in the heavens and earth belongs to Him. Everything is obedient to Him,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they say that God has begotten a son. May He be praised! Indeed everything in the heavens and the earth belongs to Him, and all are obedient to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say \"Allah has adopted a son.\" Allah is above such things. As a matter of fact, whatever is in the heavens and on the earth belongs to Him and all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They, (the People of the Book), have said that God has taken for Himself a son. He is too glorious to have a son. To Him belongs all that is in the heavens and the earth. All pray in obedience to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Allah has taken an offspring for Himself” – Purity is to Him! In fact, all that is in the heavens and the earth, is His dominion; all are submissive to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Jews, Christians and pagans) say: Allah has begotten a son (children or offspring). Glory is to Him (Exalted is He above all that they associate with Him). Nay, to Him belongs all that is in the heavens and on earth, and all are Qanitun to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Allah has taken to himself a son. Glory be to Him; rather, whatever is in the heavens and the earth is His; all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'God has taken to Him a son. Glory be to Him! Nay, to Him belongs all that is in the heavens and the earth; all obey His will --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Allah hath taken unto Himself a son. Be He glorified! Nay, but whatsoever is in the heavens and the earth is His. All are subservient unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"God has taken a son.\" Glory be to Him! Everything in the heavens and the earth belongs to Him; all things are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they Say: God hath betaken unto Him a son! Hallowed be He: Aye unto Him belongeth whatsoever is in the heavens and the earth: ', all are unto Him devout\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘Allah has taken a son.’ Immaculate is He! Rather, to Him belongs whatever there is in the heavens and the earth. All are obedient to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Allah hath begotten a son\": Glory be to Him.-Nay, to Him belongs all that is in the heavens and on earth: everything renders worship to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Jews, Christians and pagans) say: Allah has begotten a son (children or offspring). Glory be to Him (Exalted be He above all that they associate with Him). Nay, to Him belongs all that is in the heavens and on earth, and all surrender with obedience (in worship) to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Allah has taken (to Himself) a son' Exaltations to Him (Allah). For Him is what is in the heavens and the earth, all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “God has begotten a son.” Be He glorified. Rather, His is everything in the heavens and the earth; all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Allah has taken a son.\" Exalted is He! Rather, to Him belongs whatever is in the heavens and the earth. All are devoutly obedient to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:116] And they, the Jews and the Christians, and those that claim that the angels are God’s daughters, say (read wa-qālū or [simply] qālū) ‘God has taken to Himself a son’; God says: Glory be to Him!, as a way of exalting Himself above this; Nay, to Him belongs all that is in the heavens and the earth, as possessions, creatures and servants, and this sovereignty contradicts having a child, and is expressed by [the particle] mā, ‘all that’, in order to include all [creation] that is not rational; all obey His will, submitting to that which is required from each one of them: here the emphasis is on rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالضمير المرفوع بقالوا عائد إلى جميع الفرق الثلاث وهي اليهود والنصارى والذين لا يعلمون إشارة إلى ضلال آخر اتفق فيه الفرق الثلاث .وقد قرىء بالواو ( وقالوا ) على أنه معطوف على قوله { وقالت اليهود } \\[ البقرة : 113 \\] وهي قراءة الجمهور . وقرأه ابن عامر بدون واو عطف وكذلك ثبتت الآية في المصحف الإمام الموجه إلى الشام فتكون استئنافاً كأنَّ السامع بعد أن سمع ما مر من عجائب هؤلاء الفرق الثلاث جمعاً وتفريقاً تسنى له أن يقول لقد أسمعتنا من مساويهم عجباً فهل انتهت مساويهم أم لهم مساوٍ أخرى لأن ما سمعناه مؤذن بأنها مساوٍ لا تصدر إلا عن فطر خبيثة .وقد اجتمع على هذه الضلالة الفرق الثلاث كما اتفقوا على ما قبلها ، فقالت اليهود عزير ابن الله وقالت النصارى المسيح ابن الله وقال المشركون الملائكة بنات الله فتكون هاته الآية رجوعاً إلى جمعهم في قَرَن إتماماً لجمع أحوالهم الواقع في قوله : { ما يود الذين كفروا من أهل الكتاب ولا المشركين } \\[ البقرة : 105 \\] وفي قوله : { كذلك قال الذين لا يعلمون مثل قولهم } \\[ البقرة : 113 \\] . وقد ختمت هذه الآية بآية جمعت الفريق الثالث في مقالة أخرى وذلك قوله تعالى : { وقال الذين لا يعلمون لولا يكلمنا الله } \\[ البقرة : 118 \\] إلى قوله : { كذلك قال الذين من قبلهم مثل قولهم تشابهت قلوبهم } \\[ البقرة : 118 \\] .والقول هنا على حقيقته وهو الكلام اللساني ولذلك نصب الجملة وأريد أنهم اعتقدوا ذلك أيضاً لأن الغالب في الكلام أن يكون على وفق الاعْتِقَاد .وقوله : { اتخذ الله ولداً } جاء بلفظ ( اتخذ ) تعريضاً بالاستهزاء بهم بأن كلامهم لا يلتئم لأنهم أثبتوا ولداً لله ويقولون اتخذه الله .والاتخاذ الاكتساب وهو ينافي الولدية إذ الولدية تولد بدون صنع فإذا جاء الصنع جاءت العبودية لا محالة وهذا التخالف هو ما يعبر عنه في علم الجدل بفساد الوضع وهو أن يستنتج وجود الشيء من وجود ضده كما يقول قائل : القتلُ جناية عظيمةٌ فلا تكفَّر مثل الردة .وأصل هذه المقالة بالنسبة للمشركين ناشىء عن جهالة وبالنسبة لأهل الكتابين ناشىء عن توغلهما في سوء فهم الدين حتى توهموا التشبيهات والمجازات حقائق فقد ورد وصف الصالحين بأنهم أبناء الله على طريقة التشبيه وورد في كتاب النصارى وصف الله تعالى بأنه أبو عيسى وأبو الأمة فتلقفته عقول لا تعرف التأويل ولا تؤيد اعتقادها بواضح الدليل فظنته على حقيقته .جاء في التوراة في الإصحاح 14 من سفر التثنية «أنتم أولاد للرب إلهكم لا تخمشوا أجسامكم» وفي إنجيل متى الإصحاح 5 «طوبى لصانعي السلام لأنهم أبناء الله يُدْعَون» وفيه «وصَلُّوا لأجل الذين يسيئون إليكم ويطردونكم لكي تكونوا أبناء أبيكم الذي في السماوات» وفي الإصحاح 6 «انظروا إلى طيور السماء إنها لا تزرع ولا تحصد ولا تجمع إلى مخازن وأبوكم السماوي يقوتها» وتكرر ذلك في الأناجيل غير مرة ففهموها بسوء الفهم على ظاهر عبارتها ولم يراعوا أصول الديانة التي توجب تأويلها ألا ترى أن المسلمين لما جاءتهم أمثال هاته العبارات أحسنوا تأويلها وتبينوا دليلها كما في الحديث : «الخلقُ عيال الله» .وقوله : { سبحانه } تنزيه لله عن شنيع هذا القول . وفيه إشارة إلى أن الوَلَدِيَّة نقص بالنسبة إلى الله تعالى وإن كانت كمالاً في الشاهد لأنها إنما كانت كمالاً في الشاهد من حيث إنها تسد بعض نقائصه عند العجز والفقر وتسد مكانه عند الاضمحلال والله منزه عن جميع ذلك فلو كان له ولد لآذن بالحدوث وبالحاجة إليه .وقوله : { بل له ما في السماوات والأرض } إضراب عن قولهم لإبطاله ، وأقام الدليل على الإبطال بقوله : { له ما في السماوات والأرض } فالجملة استئناف ابتدائي وَاللام للملك و ( ما في السماوات والأرض ) أي ما هو موجود فإن السماوات والأرض هي مجموع العوالم العلوية والسفلية .و ( ما ) من صيغ العموم تقع على العاقل وغيره وعلى المجموع وهذا هو الأصح الذي ذهب إليه في «المفصل» واختاره الرضي . وقيل : ( ما ) تَغْلِب أو تختص بغير العقلاء ومَنْ تختص بالعقلاء وربما استعمل كل منهما في الآخر وهذا هو المشتهر بين النحاة وإن كان ضعيفاً وعليه فهم يجيبون على نحو هاته الآية بأنها من قبيل التغليب تنزيلاً للعقلاء في كونهم من صنع الله بمنزلة مساويةٍ لغيره من بقية الموجودات تصغيراً لشأن كل موجود .والقنوت الخضوع والانقياد مع خوف وإنما جاء { قانتون } بجمع المذكر السالم المختص بالعقلاء تغليباً لأنهم أهل القنوت عن إرادة وبصيرة .والمضاف إليه المحذوف بعد ( كلّ ) دلّ عليه قوله : { ما في السماوات والأرض } أي كل ما في السماوات والأرض أي العقلاء له قانتون وتنوين ( كل ) تنوين عوض عن المضاف إليه وسيأتي بيانه عند قوله تعالى : { ولكل وجهة هو موليها } \\[ البقرة : 148 \\] في هذه السورة .وفي قوله : { له قانتون } حجة ثالثة على انتفاء الولد لأن الخضوع من شعار العبيد أما الولد فله إدلال على الوالد وإنما يبرُّ به ولا يقنت ، فكان إثبات القنوت كناية عن انتفاء الولدية بانتفاء لازمها لثبوت مُساوي نقيضه ومُساوي النقيض نقيضٌ وإثبات النقيض يستلزم نفي ما هو نقيض له .وفصل جملة { كل له قانتون } لقصد استقلالها بالاستدلال حتى لا يظن السامع أنها مكملة للدليل المسوق له قوله : { له ما في السماوات والأرض } .وقد استدل بها بعض الفقهاء على أن من ملك ولده أُعتق عليه لأن الله تعالى جعل نفي الولدية بإثبات العبودية فدل ذلك على تنافي الماهيتين وهو استرواح حسن .\n\n",
      "translations": [
        {
          "translation": "Then Allah mentions the claims of the Jews and Christians that Ezra and Jesus are the sons of Allah, saying: (And they) the Jews and Christians (say: Allah hath taken unto Himself a Son) Ezra and the Messiah (Jesus). (Be He glorified!) He is far exalted to have a son or partner (Nay) it is not as they say, (but whatsoever is in the heavens and the earth) of creation (is His) are His servants. (All are subservient unto Him) linked to Him by the bond of servitude and the declaration of His Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { كُلٌّ لَّهُ قَانِتُونَ } معناهُ مُطِيعونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {All of you are obedient to Him} means that you are all obedient to Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وقالوا اتخذ الله ولداً } أي: أوجد موجوداً مستقلاً بذاته مخصوصاً دونه { سبحانه } ننزّهه عن أن يكون غيره شيء فضلاً عما يجانسه { بل له ما في السموات والأرض } أي: له عالم الأرواح والأجساد وهي باطنه وظاهره\n كما تقول: له الذات والوجه والصفات وأمثال ذلك\n { كلّ له قانتون } موجودون بوجوده\n فاعلون بفعله\n معدومون بذواتهم\n وهو غاية الطاعة والقيام بحقه إذ هو الوجود المطلق\n فلا يوجد بدونه شيء\n والوجودات المعينة صفاته وأسماؤه لامتيازها بتعيّناتها التي هي أمور إمكانية عدمية ليست عينه بالاعتبار العقليّ يقسمها إلى الوجود والماهية التي هي بدون الوجود ليست شيئاً في الخارج\n لكن في العقل\n والعقليات باطنه\n فهي في الحقيقة ليست غيره فلا يكون غيره موجوداً حتى يكون ولداً\n أي: معلولاً أو مخلوقاً أو ما شئت فسمه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { كُلٌّ لَّهُ قَانِتُونَ } [البقرة: 116] خاضعون منقادون مقرون على ما هم عليه قبل ظهورهم من العدم مقرون بأنه:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: هذه الجملة معطوفة على قوله: { وقالت اليهود\n\n\n } الخ\n ومن قرأ بغير واو جعلَها مستأنفة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:26",
      "similarity": 0.8280591337169558
    },
    {
      "verse": "3:17",
      "similarity": 0.6288292267845443
    },
    {
      "verse": "16:120",
      "similarity": 0.504202243689745
    },
    {
      "verse": "33:31",
      "similarity": 0.46392258537379655
    },
    {
      "verse": "3:43",
      "similarity": 0.45483890722666254
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002116.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002116.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:116.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}