{
  "chapter": "البقرة",
  "text": "ومن اظلم ممن منع مسجد الله ان يذكر فيها اسمه وسعى فى خرابها او۟لئك ما كان لهم ان يدخلوها الا خائفين لهم فى الدنيا خزى ولهم فى الءاخرة عذاب عظيم",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who bars access to the mosques of Allah, preventing His name from being remembered in them, and goes about destroying them? Such people will never be able to enter them - except in fear. They will have disgrace in the dunya and in the akhira they will have a terrible punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who prohibits the name of God being used in His mosques, who hurries to despoil them even though he has no right to enter them except in reverence? For them is ignominy in the world and severe punishment in the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who could be a greater wrongdoer than the one who forbids the mention of Allah's name in places of worship and strives for their ruin? Such people do not deserve to enter the places of worship, and, if they enter at all, they should do so in fear; for there is ignominy for them in this world and an awful punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than those who strive to destroy the mosques and prevent others from commemorating the Name of God therein who could not enter the mosques except with fear. They, (the unjust ones), will be disgraced in this life and will receive great torment in the life hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who prevents the name of Allah being mentioned in the mosques, and strives for their ruin? It did not befit them to enter the mosques except in fear; for them is disgrace in this world, and a terrible punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who are more unjust than those who forbid that Allah's Name be mentioned (i.e. prayers and invocations) in Allah's Masjids and strive for their ruin It was not fitting that such should themselves enter them (Allah's Masjids) except in fear. For them there is disgrace in this world, and they will have a great torment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who prevents (men) from the masjids of Allah, that His name should be remembered in them, and strives to ruin them? (As for) these, it was not proper for them that they should have entered them except in fear; they shall meet with disgrace in this world, and they shall have great chastisement in the hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who bars God's places of worship, so that His Name be not rehearsed in them, and strives to destroy them? Such men might never enter them, save in fear; for them is degradation in the present world, and in the world to come a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who forbiddeth the approach to the sanctuaries of Allah lest His name should be mentioned therein, and striveth for their ruin. As for such, it was never meant that they should enter them except in fear. Theirs in the world is ignominy and theirs in the Hereafter is an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who could be more wicked than someone who prevents God's name from being mentioned in His places of worship, and seeks to bring about their ruin, while it behoves these men to enter them with fear in their hearts? There is disgrace in store for them in this world and a great punishment in the next.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who preventeth the mosques of Allah, that His name be mentioned therein, and striveth after their ruin? These! it was not for them to enter therein except in fear. Unto them shall be humiliation in this World, and unto them in the Hereafter a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than those who deny access to the mosques of Allah lest His Name be celebrated therein, and try to ruin them? Such ones may not enter them, except in fear. There is disgrace for them in this world and a great punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who forbids that in places for the worship of Allah, Allah's name should be celebrated?-whose zeal is (in fact) to ruin them? It was not fitting that such should themselves enter them except in fear. For them there is nothing but disgrace in this world, and in the world to come, an exceeding torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than those who forbid that Allah's Name be glorified and mentioned much (i.e. prayers and invocations, etc.) in Allah's Mosques and strive for their ruin? It was not fitting that such should themselves enter them (Allah's Mosques) except in fear. For them there is disgrace in this world, and they will have a great torment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater harm than he who prevents His Name to be remembered in the Mosques of Allah and strives to destroy them? Those, they will not enter them except in fear. And for them shame in this world and a great punishment in the next.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than him who forbids the remembrance of God’s name in places of worship, and contributes to their ruin? These ought not to enter them except in fear. For them is disgrace in this world, and for them is a terrible punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who are more unjust than those who prevent the name of Allah from being mentioned in His mosques and strive toward their destruction. It is not for them to enter them except in fear. For them in this world is disgrace, and they will have in the Hereafter a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:114] And who does greater evil — that is, none does more evil — than he who bars God’s places of worship, so that His Name be not invoked in them, in prayer and praise, and strives to ruin them?, through destruction and impeding people from them: this was revealed to inform of the Byzantines’ destruction of the Holy House [sc. Jerusalem], or [it was revealed] when the idolaters barred the Prophet (s) from entering Mecca in the year of the battle of Hudaybiyya; such men might never enter them, save in fear (illā khā’ifīna is a predicate, also functioning as a command, that is to say, ‘Frighten them by threats of waging war against them, so that not one of them shall enter it feeling secure’); for them in this world is degradation, debasement through being killed, taken captive and forced to pay the jizya; and in the Hereafter a mighty chastisement, namely, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He mentioned Tatus Ibn Asipanos al-Rumi, king of the Christians who destroyed Jerusalem, saying: (And who doth greater wrong) in his disbelief (than he who forbideth the approach to the sanctuaries of Allah) Jerusalem (lest His name should be mentioned therein) by declaring Allah's Oneness and calling to prayer, (and striveth for their ruin?) in the ruin of Jerusalem by throwing carrions in it. And this lasted until the reign of 'Umar. (As for such) for the Romans, (it was never meant that they should enter them) Jerusalem (except in fear) hiding from the believers for fear of being killed, for they would be killed if found. (Theirs in the world is ignominy) a chastisement in that their cities, Constantinople, Amorium ('Ammuriyyah) and Rome (Rumiyyah) would be ruined (and theirs in the Hereafter is an awful doom) more severe than the punishment they were subjected to in this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومن أظلم } أي: أنقص حقاً وأبخس حظاً { ممن منع مساجد الله } أي: مواضع سجود الله التي هي القلوب التي يعرف فيها فيسجد بالفناء الذاتيّ { أن يذكر فيها اسمه } الخاص الذي هو الاسم الأعظم\n إذ لا يتجلى بهذا الاسم إلا في القلب\n وهو التجلي بالذات مع جميع الصفات أو اسمه المخصوص بكل واحد منها\n أي الكمال اللائق باستعداده المقتضي له\n { وسعى في خرابها } بتكديرها بالتعصبات الباردة وغلبة واستيلاء التمنيات عليها\n ومنع أهلها المستعدّين عنها بالهرج والمرج وتهييج الفتن اللازمة لتجاذب قوى النفس ودواعي الشيطان والوهم { أولئك ما كان لهم أن يدخلوها إلا خائفين } ويصلوا إليها\n أي: منكسرين لظهور تجلّي الحق فيها { لهم في الدنيا خزي } أي: افتضاح وذلّة بظهور بطلان دينهم ومعتقدهم\n وفسخه بدين الحق وانقهارهم وتحسرهم ومغلوبيتهم\n { ولهم في الآخرة عذاب عظيم } هو الاحتجاب عن الحق بدينهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ } على الله المظهر للعباد ليعرفوه\n ويتوجهوا نحوه في الأمكنة المعدة للتوجه { أَظْلَمُ مِمَّنْ مَّنَعَ مَسَاجِدَ ٱللَّهِ } الموضوعة { أَن يُذْكَرَ فِيهَا ٱسْمُهُ } أي: يذكر فيها أساؤه\n والمؤمنون الموقنون بأسمائه الحسنى { وَ } مع المنع { سَعَىٰ فِي خَرَابِهَآ } ليستأصلها ويخرجها عما يعدله { أُوْلَـٰئِكَ } المشركون { مَا كَانَ لَهُمْ أَن يَدْخُلُوهَآ } لنجاستهم وخباثتهم\n وإن دخلوها لحاجة أحياناً لا بد لهم أن يدخلوها { إِلاَّ خَآئِفِينَ } خاضعين متذللين مستوحشين\n بحيث لم يتوجهوا يمنةً ويسرةً استحياء من الله\n بل منكوسين رءوسهم على الأرض إلى أن يخرجوا\n قل يا أكمل الرسل نيابة عنا: { لَّهُمْ فِي ٱلدُّنْيَا خِزْيٌ } [البقرة: 114] حرمان عن الكمال الإنساني يكفرهم وظلمهم\n\n\n{ وَ } قل للمؤمنين يا أكمل الرسل تسلية لهم: لا تغتموا على منعهم منا وسعيهم في تخريبها\n ولا تحصروا توجهكم إلى الله في الأمكنة المخصوصة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { مَن } مبتدأ، و { أظلم } خبر، و { أن يذكر } إما منصوب على إسقاط الخافض وتسلط الفعل عليه، أي: من أن يذكر، أو بدل اشتمال من { مساجد } ، أو مجرور بالحروف المحذوف، قاله سيبويه. و { خائفين } حال من الواو. يقول الحقّ جلّ جلاله: لا أحَد أكثرُ جُرْماً ولا أعظم ظلماً { ممن } يمنع { مساجد الله } من { أن يذكر } اسم الله فيها، جماعة أو فرادى، في صلاة أو غيرها، { وسعى في خرابها } حيث عطل عمارتها، { أولئك ما كان } ينبغي { لهم أن يدخلوها } إلا بخشية وخشوع، فكيف يجترئون على تخريبها؟ أو ما كان الواجب أن يدخلوها إلا خائفين من المؤمنين أن يبطشوا بهم فضلاً عن أن يمنعوهم منها، أو { ما كان لهم } في علم الله وقضائه { أن يدخلوها إلا خائفين } ، فيكون وعداً أنجزه الله لهم، وقد فتح الله لهم مكة والشام، فكان لا يدخل بيت الله الحرام كافر إلا خفية، خائفاً من القتل، ولا يدخل نصراني بيت المقدس إلا خائفاً من المسلمين، فنالهم { في الدنيا خزي } وهو قتل الحربي، وضرب الجزية على الذمي، وخزي المشركين قتلهم يوم الفتح، وإذلالهم بدخولها عليهم عنوة، ولمن مات على الكفر { في الآخرة عذاب عظيم }. وهذه الآية - وإن نزلت في الكفار - فهي عامة لكل من يمنع الناس من الذكر في المساجد، كيفما كان قياماً أو قعوداً، جماعة أو فرادى، والله تعالى أعلم. الإشارة: مساجدُ الله هي حضرة القلوب وحضر الأرواح وحضرة الأسرار، فحضرة القلوب لأهل المراقبة من أهل الإيمان، وحضرة الأرواح والأسرار لأهل المشاهدة والمكالمة من أهل الإحسان، فمن منع نفسه من الدخول في هذه الحضرات الثلاث، وسعى في خراب باطنه باتباع الحظوظ والشهوات، ومال إلى الدنيا وزخارفها الغرارات، فلا أحد أظلم منه نفساً، ولا أبخس منه صفقةً. فلا ينجعُ في هؤلاء إلا خوف مزعج أو شوق مقلق. فإن لم يكن أحد من هذين بقي على غيّه حتى مخايل الموت. فيحن إلى الدخول فيها خائفاً، ولا ينفع حينئذٍ الندم، وقد زلت به القدم، له في الدنيا ذلك الفقر والجزع، وله في الآخرة غم الحجاب وسوء الحساب وحسرة العتاب، نسأل الله العافية في الدارين. آمين. بمنه وكرمه. وقال القشيري: نفْسُ العابدِ وَطَنُ العبادة، وقلب العارف وطن المعرفة، وروح الواجد وطن المحبة، وسر الموحِّد وطن المشاهدة، ولا أظلم ممن سعى في خراب وطن العابد بالشهوات، وفي وطن المعرفة بالمُنى والعلاقات، وفي وطن المحبة بالحطوط والمساكنات، وفي وطن الموحد بالالتفات إلى القربات. هـ. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:2",
      "similarity": 0.5682957732061266
    },
    {
      "verse": "7:12",
      "similarity": 0.16538840746871827
    },
    {
      "verse": "38:75",
      "similarity": 0.1621975416514924
    },
    {
      "verse": "66:8",
      "similarity": 0.15804342686299916
    },
    {
      "verse": "17:94",
      "similarity": 0.15519087380147661
    }
  ]
}