{
  "chapter": "البقرة",
  "text": "ولله المشرق والمغرب فاينما تولوا۟ فثم وجه الله ان الله وسع عليم",
  "translations": [
    {
      "translation": "Both East and West belong to Allah, so wherever you turn, the Face of Allah is there. Allah is All- Encompassing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the East and the West. Wherever you turn the glory of God is everywhere: All-pervading is He and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The East and the West, all belong to Allah: you will face Allah in whichsoever direction you turn your face: Allah is All-Embracing and All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The East and the West belong to God. Wherever you turn, you are always in the presence of God. God is Munificent and Omniscient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the East and the West, all belong to Allah – so whichever direction you face, there is Allah’s Entity (Allah’s Mercy is directed towards you); indeed Allah is the All Capable, (His powers and reach are limitless), the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the east and the west, so wherever you turn (yourselves or your faces) there is the Face of Allah (and He is High above, over His Throne). Surely, Allah is Sufficient (for His creatures' needs), Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the East and the West, therefore, whither you turn, thither is Allah's purpose; surely Allah is Ample-giving, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the East and the West; whithersoever you turn, there is the Face of God; God is All-embracing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belong the East and the West, and whithersoever ye turn, there is Allah's Countenance. Lo! Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The East and the West belong to God. Whichever way you turn, there is the Face of God. God is all pervading and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah belongeth the east and the west; so withersoever you turn there is the countenance of Allah: verily Allah is pervading, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the east and the west: so whichever way you turn, there is the face of Allah! Allah is indeed all-bounteous, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the east and the West: Whithersoever ye turn, there is the presence of Allah. For Allah is all-Pervading, all-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the east and the west, so wherever you turn yourselves or your faces there is the Face of Allah (and He is High above, over His Throne). Surely! Allah is All-Sufficient for His creatures' needs, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the east and the west. Whichever way you turn, there is the Face of Allah. He is the Embracer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the East and the West. Whichever way you turn, there is God’s presence. God is Omnipresent and Omniscient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the east and the west. So wherever you [might] turn, there is the Face of Allah. Indeed, Allah is all-Encompassing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:115] The following was revealed either when the Jews criticised the change of the direction of prayer [qibla], or concerning the supererogatory prayers on animal-back during journeys, which one may pray in any direction: To God belong the East and the West, that is, the entire earth, because these two [directions] represent both sides of it [the earth]; whithersoever you turn, your faces in prayer by His command, there is the Face of God, the direction of prayer with which He is pleased. Lo! God is Embracing, His bounty embracing all things, Knowing, how to manage His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the direction of prayer to Him, saying (Unto Allah belong the East and the West) as a direction of prayer for him who does not know the correct direction of prayer, (and whithersoever ye turn) your faces in prayer after ascertaining the direction, (there is Allah's Countenance) that prayer is performed in Allah's pleasure. This verse was revealed about a group of Companions of the Prophet (pbuh) who prayed whilst travelling in the wrong direction after doing their best to determine the correct direction. It is also said that saying (Unto Allah belong the East and the West) means: the people of the East and the people of the West have one direction of prayer which is the Sacred Precinct, and therefore (there is Allah's Countenance) 19 means: that is the direction of prayer to Allah, (Lo! Allah is All-Embracing) regarding the direction of prayer, (All- Knowing) of their intentions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَثَمَّ وَجْهُ ٱللَّهِ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ قِبلةُ الله\n\n\n\n\nوقولهُ تعالى: { إِنَّ ٱللَّهَ وَاسِعٌ عَلِيمٌ } قيلَ جوادٌ كَريمٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Then the face of Allah} - Zayd ibn `Ali, peace be upon him, said: Its meaning is the qiblah of Allah.\n\n\nAnd His saying - the Most High - \"Indeed, Allah is All-Encompassing, All-Knowing,\" it is said [that this means] \"Generous, Noble.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ ولله المَشْرق } أي: عالم النور والظهور الذي هو جنّة النصارى وقبلتهم بالحقيقة هو باطنه { والمغرب } أي: عالم الظلمة والاختفاء الذي هو جنة اليهود وقبلتهم بالحقيقة هو ظاهره { فأينما تولوا } أي: أي جهة تتوجهوا من الظاهر والباطن { فثمّ وجه الله } أي: ذات الله المتجلية بجميع صفاته، أو ولله الإشراق على قلوبكم بالظهور فيها والتجلي لها بصفة جماله حالة شهودكم وفنائكم، والغروب فيها بتستره واحتجابه بصورها وذواتها، واختفائه بصفة جلاله حالة بقائكم بعد الفناء. فأيّ جهة تتوجهوا حينئذ فثمّ وجهه لم يكن شيء إلا إيّاه وحده { إن الله واسع } جميع الوجود شامل لجميع الجهات والوجودات { عليم } بكل العلوم والمعلومات.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { للَّهِ } المتجلي في الآفاق { ٱلْمَشْرِقُ وَٱلْمَغْرِبُ } فهما كنايتان عن طرفي العالم { فَأَيْنَمَا تُوَلُّواْ } توجهوا نحوه { فَثَمَّ وَجْهُ ٱللَّهِ } أي: ذاته\n إذهو منتهى الجهات محيط بها { إِنَّ ٱللَّهَ وَاسِعٌ } أجل من أن تحيط به القلوب إلا من وسعه الله بلطفه كما أخبر سبحانه بقوله: \" لا يسعني أرضي ولا سمائي بل يسعني قلب عبدي المؤمن \" { عَلِيمٌ } [البقرة: 115] لا يغيب عن علمه شيء\n وحيث اتجهتم نحوه علمه قبل توجهكم\n بل توجهكم عين توجهه فلا يتوجه إليه إلا هو\n لا إله إلا هو\n كل شيء هالك إلا وجهه\n\n\nومن غاية جهلهم بالله الواسع العليم الذي لا يسعه الأرض والسماء\n[البقرة: 255] حصروه سبحانه في شخص وتخيلوه جسماً\n وأثبتوا له لوازم الأجسام { وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَداً } قتل وإجلاء وسبي وذلة { وَلَهُمْ فِي ٱلآخِرَةِ عَذَابٌ عَظِيمٌ } كعيسى وعزير عليهما السلام { سُبْحَـٰنَهُ } وتعالى\n عز الصمد الذين شأنه\n[الإخلاص: 3-4] أن يتخذ صاحبة وولداً { بَل لَّهُ } مظاهر { مَا فِي ٱلسَّمَـٰوَٰتِ وَ } مظاهر { ٱلأَرْضِ } ليظهر عليها ويتجلى لها\n إظهاراً لكمالاتها المترتبة على صفاته المندرجة في ذاته ونسبته تعالى إلى جميع المظاهر في التكوين والخلق على السوى من غير تفاوت\n وعيسى وعزير - عليهما السلام - أيضاً من جملة المظاهر\n ومرجع جميع المظان إلى الظاهر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أينما } شرطية، و { تولوا } شَرْطُها، وجملة { فثم } جوابها، ووَلْي يستعمل بمعنى أدبر وبمعنى أقبل، تقول: وليت عن كذا أو كذا، والوجه هنا بمعنى الجهة، تقول: سافرت في وجه كذا، أي في جهة كذا. قاله ابن عطية. يقول الحقّ جلّ جلاله: { ولله المشرق والمغرب } ، والجهات كلها له، لا يختص ملكه بمكان دون آخر، فإذا مُنعتم من الصلاة في المساجد ففي أي مكان كنتم ووليتم وجهكم إلى القبلة التي أمرتم بالتوجه إليها فثم جهته التي أمر بها، أو فثم ذاته المقدسة، أي: عالم مطلع على ما يفعل فيه، { إن الله واسع } بإحاطته بالإشياء، أو برحمته يريد التوسعة على عباده { عليم } بمصالحهم وأعمالهم في الأماكن كلها. وعن ابن عمر: أنها نزلت في صلاة المسار على الراحلة حيثما توجهت به، وقيل: في قوم عميت عليهم القبلة فصلوا إلى أنحاء مختلفة، فلما أصبحوا تبينوا خطأهم، وعلى هذا: لو أخطأ المجتهد ثم تبين له الخطأ، لم يلزمه التدارك. قاله البيضاوي. الإشارة: اعلم أن الأماكن والجهات، وكل ما ظهر من الكائنات، قائمة بأنوار الصفات، ممحوة بأحدية الذات، \" كان الله ولا شيء معه، وهو الآن على ما عليه كان \" إذ لا وجود لشيء مع الله، { فأينما تولوا فثم وجه الله } ، محق الآثار بإفلاك الأنوار، وانمحت الأنوار بأحدية الأسرار، وانفرد بالوجود الواحد القهار، ولله درّ القائل:\nوقال آخر:\nوقال صاحب العينية:\nوقال الششتري:\nقال بعض السلف: دخلت ديراً جاء وقت الصلاة، فقلت لبعض النصارى: دُلني على بقعة طاهرة أصلي فيها، فقال لي: طهر قلبك عما سواه، وقف حيث شئت، قال: فخَجِلت منه. ويحكى عن أبي يزيد رضي الله عنه أنه كان يصلي إلى جهة شاء، ويتلو هذه الآية، فالوجه عند أهل التحقيق هو عين الذات، يعني أسرار الذات وأنوار الصفات. قال تعالى: { كل شيء هالك إلا وجهه } أي: كل شيء فانٍ ومستهلك في الحال والاستقبال إلا ذاته المقدسة، وأنشدوا:\nوقلت في تائيتي الخمرية في وصف الخمرة الأزلية:\nولما قالت اليهود: عُزَير ابن الله، وقالت النصارى: المسيح ابن الله، وقالت المشركون: الملائكة بنات الله، ردَّ الله تعالى عليهم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:17",
      "similarity": 0.6747860388848925
    },
    {
      "verse": "73:9",
      "similarity": 0.6369370813210199
    },
    {
      "verse": "26:28",
      "similarity": 0.6321506489070546
    },
    {
      "verse": "70:40",
      "similarity": 0.607511464474941
    },
    {
      "verse": "2:142",
      "similarity": 0.4879939429613303
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002115.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002115.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:115.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}