{
  "chapter": "البقرة",
  "text": "واذ جعلنا البيت مثابة للناس وامنا واتخذوا۟ من مقام ابرهم مصلى وعهدنا الى ابرهم واسمعيل ان طهرا بيتى للطائفين والعكفين والركع السجود",
  "translations": [
    {
      "translation": "And when We made the House* a place of return, a sanctuary for mankind: They took the Maqam of Ibrahim as a place of prayer. We contracted with Ibrahim and Isma'il: 'Purify My House for those who circle it, and those who stay there, and those who bow and who prostrate.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, We made the House (of Ka'bah) a place of congregation and safe retreat, and said: \"Make the spot where Abraham stood the place of worship;\" and enjoined upon Abraham and Ishmael to keep Our House immaculate for those who shall walk around it and stay in it for contemplation and prayer, and for bowing in adoration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember that We made this House (the Ka'bah) the centre and sanctuary for mankind and enjoined the people to dedicate to worship the place where Abraham used to stand for prayer, and We urged Abraham and Ismail to keep My House pure for those who would go round it and those who would retire to it for devotion and prayer and for those who would bow down and prostrate themselves there in worhsip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the house (in Mecca) as a place of refuge and sanctuary for men. Adopt the place where Abraham stood as a place for prayer. We advised Abraham and Ishmael to keep My house clean for the pilgrims, the worshippers and for those who bow down and prostrate themselves in worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when We made this House (at Mecca) a recourse for mankind and a sanctuary; and take the place where Ibrahim stood, as your place of prayer; and We imposed a duty upon Ibrahim and Ismail (Ishmael), to fully purify My house for those who go around it, and those who stay in it (for worship), and those who bow down and prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We made the House (the Ka`bah at Makkah) a place of resort for mankind and a place of safety. And take you (people) the Maqam (place) of Ibrahim as a place of prayer. And We commanded Ibrahim (Abraham) and Isma`il (Ishmael) that they should purify My House (the Ka`bah at Makkah) for those who are circumambulating it, or staying (I`tikaf), or bowing or prostrating themselves (there, in prayer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made the House a pilgrimage for men and a (place of) security, and: Appoint for yourselves a place of prayer on the standing-place of Ibrahim. And We enjoined Ibrahim and Ismail saying: Purify My House for those who visit (it) and those who abide (in it) for devotion and those who bow down (and) those who prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We appointed the House to be a place of visitation for the people, and a sanctuary, and: 'Take to yourselves Abraham's station for a place of prayer.' And We made covenant with Abraham and Ishmael: 'Purify My House for those that shall go about it and those that cleave to it, to those who bow and prostrate themselves.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made the House (at Makka) a resort for mankind and sanctuary, (saying): Take as your place of worship the place where Abraham stood (to pray). And We imposed a duty upon Abraham and Ishmael, (saying): Purify My house for those who go around and those who meditate therein and those who bow down and prostrate themselves (in worship).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the House [the Ka'bah] a place of assembly and a sanctuary for mankind, [saying], \"Make the place where Abraham stood a place of worship.\" We commanded Abraham and Ishmael, \"Purify My House for those who walk round it, those who stay there for devotion, and those who bow down and prostrate themselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We appointed the House a resort unto man kind and a place of security and said: take the station of Ibrahim for a place of prayer. And We covenanted with Ibrahim and Ismai'l, saying: purify ye twain My Houses for those who shall circumambulate it and those who shall stay, and those who shall bow down and prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when We made the House a place of reward for mankind and a sanctuary, [declaring], ‘Take the venue of prayer from Abraham’s Station.’ We charged Abraham and Ishmael [with its upkeep, saying], ‘Purify My House for those who go around it, [for] those who make it a retreat and [for] those who bow and prostrate.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember We made the House a place of assembly for men and a place of safety; and take ye the station of Abraham as a place of prayer; and We covenanted with Abraham and Isma'il, that they should sanctify My House for those who compass it round, or use it as a retreat, or bow, or prostrate themselves (therein in prayer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We made the House (the Ka'bah at Makkah) a place of resort for mankind and a place of safety. And take you (people) the Maqam (place) of Ibrahim (Abraham) [or the stone on which Ibrahim (Abraham) stood while he was building the Ka'bah] as a place of prayer (for some of your prayers, e.g. two Rak'at after the Tawaf of the Ka'bah at Makkah), and We commanded Ibrahim (Abraham) and Isma'il (Ishmael) that they should purify My House (the Ka'bah at Makkah) for those who are circumambulating it, or staying (I'tikaf), or bowing or prostrating themselves (there, in prayer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made the House (Ka'bah) a visitation and a sanctuary for the people (saying:) 'Make the place where Abraham stood a place of prayer. 'And We made a covenant with Abraham and Ishmael: 'Purify My House for those who circumambulate around it, and those who cleave to it, to those who bow and prostrate'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the House a focal point for the people, and a sanctuary. Use the shrine of Abraham as a place of prayer. And We commissioned Abraham and Ishmael, “Sanctify My House for those who circle around it, and those who seclude themselves in it, and those who kneel and prostrate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when We made the House a place of return for the people and [a place of] security. And take, [O believers], from the standing place of Abraham a place of prayer. And We charged Abraham and Ishmael, [saying], \"Purify My House for those who perform Tawaf and those who are staying [there] for worship and those who bow and prostrate [in prayer].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:125] And when We appointed the House, the Ka‘ba, to be a place of visitation, to which they flock from every direction, for the people, and a sanctuary, of safety for them from the injustice and attacks that befall other places: a person could come across his father’s killer there, and yet not act violently against him; and: ‘Take (ittakhidhū is also read ittakhadhū, making it a predicate), O people, to yourselves Abraham’s station, the founding stone he used when building the House, for a place of prayer’, so that you perform two units of prayer for the circumambulation; And We made a covenant with Abraham and Ishmael, We commanded them: ‘Purify My House, of graven images, for those that shall go round it and those that cleave to it, in ritual residence, to those who bow and prostrate themselves’, that is, those who pray: (al-rukka‘ and alsujūd are the plurals of rāki‘, ‘one bowing’, and sājid, ‘one prostrated’, respectively).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then commanded people to emulate him, saying: (And when We made the House a resort) a place to turn to (for mankind) whereby they can turn and long for (and a sanctuary) for whoever enters it: (Take) it, community of Muhammad! (as your place of worship the place where Abraham stood (to pray)) a place whereby you turn in prayer. (And We imposed a duty upon) commanded (Abraham and Ishmael: Purify My house) from idols (for those who go around and those who meditate therein) those who live there (and those who bow down and prostrate themselves) those who perform the five daily prayers, regardless of their country of origin.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَإِذْ جَعَلْنَا ٱلْبَيْتَ مَثَابَةً لِّلنَّاسِ وَأَمْناً } قالَ زيدُ بن علي عليهما السلامُ: معناهُ يَحُجونَ إِليهِ\n ويَثُوبونَ إِليهِ: معناهُ يَعُودُونَ إِليهِ ولا يَقْضُونَ فِيهِ وَطراً\n\n\n\n\nوقولهُ تعالى: { وَٱتَّخِذُواْ مِن مَّقَامِ إِبْرَاهِيمَ مُصَلًّى } قالَ زيدُ بن علي عليهما السلام\n فالمَقامُ بفتحِ الميمِ: الذي يُقامُ فيهِ\n والمُقامُ بضمِ الميمِ: الإِقامةُ بالمكانِ\n والمُصلّى: المُدعى\n ويقال: المُصلى: عَرَفةٌ وجَمعٌ ومِنى\n ويقال: الحجُ: كُلُّ مقام إبراهيم\n\n\n\n\nوقولهُ تعالى: { لِلطَّائِفِينَ وَٱلْعَاكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ } فالعَاكِفونَ: المجاورونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And We made the House a place of resort for mankind and a place of safety\" - Zayd ibn Ali said: \"This means that they will perform Hajj to it.\"\n\n{And they will return to Him} - this means they will return to Him and not decide anything in it according to their own desires.\n\n\nAnd the words of the Almighty: {And take the position of Abraham as a place of prayer} Zayd ibn Ali said, peace be upon them both.\n\n\nThe place of articulation with the opening of the mouth: that which is articulated in it\n\n\nAnd the place of articulation with the letter Meem: the place of articulation is with the letter Meem.\n\n\nThe one who is called to prayer is the one who is to lead the prayer.\n\n\nIt is said that the person who prays is in a state of purity, and that their prayer is a gathering and a connection.\n\n\nIt is said that Hajj is every station of Ibrahim.\n\n\nAnd His saying, {For those who are Al-Tā'ifīn (of two different tribes) and Al-ʿĀkifīn (those who bow down and prostrate themselves in worship)} So the Al-ʿĀkifīn are those who are close by.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ وإذ جعلنا البيت } القلب { مثابة } أي: مرجعاً ومبّوأً { للناس وأمناً } ومحل أمن أو سبب أمن وسلامة لهم يأمنون بالوصول إليه والسكون فيه شرّ غوائل صفات النفس وفتك فتاك القوى الطبيعية وإفسادها، وتخييل شياطين الوهم والخيال، وإغوائهم ومكائدهم { واتخذوا من مقام إبراهيم } الذي هو مقام الروح ومقام الخلة { مصلى } موطناً للصلاة الحقيقية التي هي المشاهدة والمواصلة الإلهية والخلة الذوقية { وعهدنا إلى إبراهيم وإسماعيل } أمرناهما بتطهير بيت القلب من قاذورات أحاديث النفس، ونجاسات وساوس الشيطان، وأرجاس دواعي الهوى، وأدناس صفات القوى { للطائفين } أي: للسالكين المشتاقين الذين يدورون حول القلب في سيرهم { والعاكفين } الواصلين إلى مقام القلب بالتوكل الذي هو توحيد الأفعال المقيمين فيه بلا تلوينات النفس وإزعاجها منه { والركع } أي: الخاضعين الذين بلغوا إلى مقام تجلي الصفات، وكمال مرتبة الرضا والسجود الفانين في الوحدة.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما جعلناه إماماً هداياً إلى طريق الحق هيأنا له طريق الاهتداء { إِذْ جَعَلْنَا ٱلْبَيْتَ } أي: الكعبة المعدة للتوجه إلينا بترك المألوفات وقطع التعلقات من الأهل والمال والوطن\n والاجتناب عن التصرفات المانعة عن التوجه الحقيقي من الرفت والفسوق والجدال والقتل\n وغير ذلك من الأمور المتعلقة للحياة المستعارة { مَثَابَةً } موضع ثواب { لِّلنَّاسِ } ليتقربوا إلينا ويتوجهوا نحونا { وَأَمْناً } من جميع المخافات الدينية إذا كانت الزيارة على نية الإخلاص { وَ } بعدما جعلنا البيت مثابة للناس قلنا للزائرين لها والطائفين حولها: { ٱتَّخِذُواْ } أيها الزوار { مِن مَّقَامِ } خليلنا { إِبْرَاهِيمَ مُصَلًّى } موضع ميل وتوجه\n اقتداءً له صلوات الرحمن عليه { وَ } بعدما أمرنا الزوار بما أمرنا { عَهِدْنَآ } وصينا { إِلَىٰ } خليلنا { إِبْرَاهِيمَ وَ } ذبيحنا { إِسْمَاعِيلَ } ابنه { أَن طَهِّرَا } بالمظاهرة { بَيْتِيَ } المعدة للطهارة الحقيقة عن جميع الشواغل { لِلطَّائِفِينَ } الذين قصدوا الميل إلى جنابنا ببذل المهج { وَٱلْعَاكِفِينَ } القائمين المقيمن ببابنا رجاء أن ينكشف لهم أسرار التكاليف التي كلفوا بها { وَٱلرُّكَّعِ ٱلسُّجُودِ } [البقرة: 125] أي: الراكعين الساجدين في فنائنا تذللاً وانكساراً حتى يتحققوا بمقام العبودية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { المثابة }: المرجع الذي يثُوب الناس إليه كل سنة، و { اتخذوا }: على قراءة الأمر، محكي بقول محذوف، أي: وقلنا اتخذوا، وعلى قراءة الماضي: معطوف على { جعلنا } ، أي: جعلناه مثابة، واتخذه الناس مُصلَّى. يقول الحقّ جلّ جلاله: { و } اذكر يا محمد { إذ جعلنا البيت } الحرام: أي: الكعبة، مرجعاً للناس يرجعون لزيارته والطواف به كل سنة، وجعلناه محل أمن، كل من دخله كان آمناً من عقوبة الدنيا والآخرة، أما في الدنيا فإنَّ الناس يُتَخطفون من حوله، وأهلُه آمنون، وأمافي الآخرة فلأن الحج يَجُبُّ ما قبله، وهذا يدل على شرف البيت وحرمته. وقلنا لهم: { اتخذوا من مقام إبراهيم } ، وهو الحجر الذي فيه أثر قدميه، { مصلى } تصلون إليه، وهو الذي يصلون خلفه ركعتي الطواف، { وعهدنا } أي: أوحينا { إلى إبراهيم وإسماعيل } ولده، بأن قلنا لهما: { طهرا بيتي } من الأدناس والأرجاس والأصنام والأوثان، { للطائفين } به { والعاكفين } أي: المقيمين فيه، والمصلين فيه الراكعين الساجدين. فكان البيت مطهراً في زمانهما وبعدهما زماناً، ثم أدخلت فيه الأصنام فطهّره نبيّنا محمد صلى الله عليه وسلم، وتبقى طهارته حتى يأتي أمر الله، والله تعالى أعلم. الإشارة: القلب هو بيت الرب، يقول الله تبارك وتعالى لبعض أنبيائه: \" طهر لي بيتاً أسكنه، فقال: يا رب أي بيت يسعك؟ فقال له: لن تسعني أرضي ولا سمائي، ووسعني قلب عبدي المؤمن \". فإذا تطهر القلب من الأغيار وملئ بالأنوار، وتمكنت فيه المعارف والأسرار، كان مرجعاً وملجأ للعباد، كل مَن وصل إليه، وطاف به، كان آمنناً من الزيغ والعناد، ومن خواطر السوء سوء الاعتقاد، ومن دخله والوداد، أَمِن من الطرْد والبعاد، وكان عند الله من أفضل العباد. ومقام إبراهيم - عليه السلام - هو الاستغراق في عين بحر الشهود، ورفع الهمة عن ما سوى الملك المعبود. وهذا المقام هو الذي اتخذه العارفون كعبة لصلاة قلوبهم، وغاية لمنتهى قصودهم.\nوقد عهد الله تعالى إلى أنبيائه وأصفيائه أن يطهروا قلوبهم من الأغيار، ويرفضوا كل ما سواه من الأكدار، لتتهيأ بذلك لطواف الواردات والأنوار، ولعكوف المعارف والأسرار، وتخضع لهيبتها ظواهرُ الأشباح، وتنقاد لجمال بهجتها القلوبُ والأرواح، وما ذلك على الله بعزيز.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:26",
      "similarity": 0.5480161587863058
    },
    {
      "verse": "21:52",
      "similarity": 0.36005778407833744
    },
    {
      "verse": "5:55",
      "similarity": 0.3496262648010728
    },
    {
      "verse": "2:43",
      "similarity": 0.3478959151976007
    },
    {
      "verse": "2:127",
      "similarity": 0.33936477590811903
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002125.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002125.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:125.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}