{
  "chapter": "البقرة",
  "text": "واتقوا۟ يوما لا تجزى نفس عن نفس شيـا ولا يقبل منها عدل ولا تنفعها شفعة ولا هم ينصرون",
  "translations": [
    {
      "translation": "Have fear of a Day when no self will be able to compensate for another in any way, and no ransom will be accepted from it, and no intercession benefit it, and they will not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fear the day when no man will stand up for man in the least, and no ransom avail nor intercession matter nor help reach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And dread the Day when no one shall avail anyone in any way; nor shall any ransom be accepted from anyone; nor shall intercession profit any body; nor shall the offenders be helped from any quarter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have fear of the day when every soul will be responsible for itself, no ransom will be accepted for it, no intercession will be of any benefit to it and no one will receive any help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the day when no soul will be exchanged for another, nor will they be set free in lieu of compensation, nor will any intercession benefit the disbelievers, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Day (of Judgement) when no person shall avail another, nor shall compensation be accepted from him, nor shall intercession be of use to him, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be on your guard against a day when no soul shall avail another in the least neither shall any compensation be accepted from it, nor shall intercession profit it, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and beware a day when no soul for another shall give satisfaction, and no counterpoise shall be accepted from it, nor any intercession shall be profitable to it, neither shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard (yourselves) against a day when no soul will in aught avail another, nor will compensation be accepted from it, nor will intercession be of use to it; nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and fear a Day when no human being shall avail another. Nor shall ransom be accepted from any of them, nor shall intercession be of any use to them, and none shall be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day whereon not in aught shall a soul satisfy for a soul, nor shall compensation be accepted therefor, nor shall intercession profit it, nor shall they be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beware of the Day when no soul will compensate for another, neither will any ransom be accepted from it, nor will any intercession benefit it, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then guard yourselves against a Day when one soul shall not avail another, nor shall compensation be accepted from her nor shall intercession profit her nor shall anyone be helped (from outside).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Day (of Judgement) when no person shall avail another, nor shall compensation be accepted from him, nor shall intercession be of use to him, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day when no soul for another will compensate a thing, and no equivalent will be accepted from it, neither intercession will benefit it, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware of a Day when no soul will avail another soul in any way, and no ransom will be accepted from it, and no intercession will benefit it, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day when no soul will suffice for another soul at all, and no compensation will be accepted from it, nor will any intercession benefit it, nor will they be aided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:123] And beware of, fear, a day when no soul shall for another, on this [Day] be requited, that is, [when no soul for another] shall be of any avail, and no compensation, no ransom, shall be accepted from it, nor any intercession shall benefit it, neither shall they be helped, against God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And guard against a day) fear the torment of a day, i.e. the Day of Judgement (when no soul will in anything avail another) no unbelieving soul will be able to drive away anything from another unbelieving soul; it is also said that this means: no righteous soul will be able to drive away anything from another righteous soul; and it is said that this means: no father will be able to drive away anything from his son and no son will be able to drive away Allah's punishment from his father, (nor will compensation be accepted from it) no ransom will be accepted, (nor will intercession be of use to it) no intercessor will intercede for it: not a close angel, a sent messenger or a righteous servant; (nor will they be helped) will be prevented from what they will face.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَّ تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئاً } معناهُ لا تُغني عنها شيئاً\n\n\n\n\nوقولهُ تعالى: { لاَ يُقْبَلُ مِنْهَا عَدْلٌ } معناهُ فِديةٌ\n وَعَدْلُ الشيءِ أَيضاً: مِثلُهُ\n وكذلك عِدْلُهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"No soul shall bear another's burden\" - this means that nothing can help another soul.\n\n\nAnd His saying - the Most High: {No compensation will be accepted from her}, meaning that atonement is not possible.\n\n\nAnd the just thing is also like its counterpart.\n\n\nAnd likewise, His Justice.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تنفعها شفاعة } شافع\n ولا يدفع عنها أهوال ذلك اليوم ولي ولا ناصر\n إلا من اتخذ يداً عند الملك القادر\n وبالله التوفيق\n وتقدمت إشارة هذه الآية في الآية الأولى\n ولما أراد الحق تعالى أن ينسخ القبلة ويردها إلى بيت الله الحرام بعد أن كانت إلى بيت المقدس\n ذكر خصوصيةَ مَنْ بناه\n وكيفية بنائه\n وفي ضمن ذلك ذكر شرفه ليكون ذلك داعياً إلى الامتثال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:48",
      "similarity": 0.9047176903766316
    },
    {
      "verse": "74:48",
      "similarity": 0.5980403675273646
    },
    {
      "verse": "20:109",
      "similarity": 0.5307862301310861
    },
    {
      "verse": "10:18",
      "similarity": 0.4396340991090081
    },
    {
      "verse": "26:100",
      "similarity": 0.4390872579896366
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:123.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:123.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:123.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}