{
  "chapter": "البقرة",
  "text": "ربنا واجعلنا مسلمين لك ومن ذريتنا امة مسلمة لك وارنا مناسكنا وتب علينا انك انت التواب الرحيم",
  "translations": [
    {
      "translation": "Our Lord, make us both Muslims submitted to You, and our descendants a Muslim community submitted to You. Show us our rites of worship and turn towards us. You are the Ever-Returning, the Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make us submit, O Lord, to Your will, and our progeny a people submissive to You. Teach us the way of worship and forgive our trespasses, for You are compassionate and merciful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, make us Your Muslims (submissive servants) and also raise from our offspring a community which should be Muslim (submissive to Your Will). Show us the ways of Your worship and forbear our shortcomings: You are Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, make us good Muslims (one who submits himself to God) and from our descendants make a good Muslim nation. Teach us the rules of worship and accept our repentance; You are All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord! And make us submissive towards you and from our offspring a nation obedient to You – and show us the ways of our worship, and incline towards us with Your mercy; indeed You only are the Most Acceptor of Repentance, the Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And make us submissive unto You and of our offspring a nation submissive unto You, and show us our Manasik, and accept our repentance. Truly, You are the One Who accepts repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! and make us both submissive to Thee and (raise) from our offspring a nation submitting to Thee, and show us our ways of devotion and turn to us (mercifully), surely Thou art the Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, our Lord, make us submissive to Thee, and of our seed a nation submissive to Thee; and show us our holy rites, and turn towards us; surely Thou turnest, and art All-compassionate;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And make us submissive unto Thee and of our seed a nation submissive unto Thee, and show us our ways of worship, and relent toward us. Lo! Thou, only Thou, art the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, make us submissive to You; make of our descendants a nation that will submit to You. Teach us our rites of worship and turn to us with mercy; You are the Forgiving One and the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! make us twain submissive unto Thee, and of our progeny community submissive unto Thee, and show us our rites, and relent toward us! verily Thou! Thou art the Relentant, the Merciful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Our Lord, make us submissive to You, and [raise] from our progeny a nation submissive to You, and show us our rites [of worship], and turn to us clemently. Indeed You are the All-clement, the All-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! make of us Muslims, bowing to Thy (Will), and of our progeny a people Muslim, bowing to Thy (will); and show us our place for the celebration of (due) rites; and turn unto us (in Mercy); for Thou art the Oft-Returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And make us submissive unto You and of our offspring a nation submissive unto You, and show us our Manasik (all the ceremonies of pilgrimage - Hajj and 'Umrah, etc.), and accept our repentance. Truly, You are the One Who accepts repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, make us both submissive to You, and of our descendants a submissive nation to You. Show us our rites and accept us; You are the Receiver of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and make us submissive to You, and from our descendants a community submissive to You. And show us our rites, and accept our repentance. You are the Acceptor of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:128] Our Lord! And make us submissive, compliant, to You and, make, of our seed, our progeny, a community, a people, submissive to You (min [in the phrase min dhurriyyatinā, ‘of our seed’] here is partitive, and is used here in accordance with God’s above-mentioned saying My covenant shall not reach the evildoers); and show us, teach us, our holy rites, our ceremonies for worship or for the pilgrimage, and relent to us. Surely You are the Relenting, the Merciful: they asked Him to turn towards them, despite their [moral] impeccability, out of humbleness and in order to teach their progeny.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفائدة تكرير النداء بقوله : { ربنا } إظهار الضراعة إلى الله تعالى وإظهار أن كل دعوى من هاته الدعوات مقصودة بالذات ، ولذلك لم يكرر النداء إلا عند الانتقال من دعوة إلى أخرى فإن الدعوة الأولى لطلب تقبل العمل والثانية لطلب الاهتداء فجملة النداء معترضة بين المعطوف هنا والمعطوف عليه في قوله الآتي : { ربنا وابعث فيهم رسولاً } \\[ البقرة : 129 \\] .والمراد بمسلميْن لك المنقادان إلى الله تعالى إذ الإسلام الانقياد ، ولما كان الانقياد للخالق بحق يشمل الإيمان بوجوده وأن لا يشرك في عبادته غيره ومعرفة صفاته التي دل عليها فعله كانت حقيقة الإسلام ملازمة لحقيقة الإيمان والتوحيد ، ووجه تسمية ذلك إسلاماً سيأتي عند قوله : { فلا تموتن إلا وأنتم مسلمون } \\[ البقرة : 132 \\] ، وأما قوله تعالى : { قل لم تؤمنوا ولكن قولوا أسلمنا } \\[ الحجرات : 14 \\] فإنه فكك بينهما لأن إسلامهم كان عن خوف لا عن اعتقاد ، فالإيمان والإسلام متغايران مفهوماً وبينهما عموم وخصوص وجهي في الماصدق ، فالتوحيد في زمن الفترة إيمان لا يترقب منه انقياد إذ الانقياد إنما يحصل بالأعمال ، وانقياد المغلوب المكره إسلام لم ينشأ عن اعتقاد إيمان ، إلا أن صورتي الانفراد في الإيمان والإسلام نادرتان .ألهم الله إبراهيم اسم الإسلام ثم ادخره بعده للدين المحمدي فنُسي هذا الاسم بعد إبراهيم ولم يلقب به دين آخر لأن الله أراد أن يكون الدين المحمدي إتماماً للحنيفية دين إبراهيم وسيجيء بيان لهذا عند قوله تعالى : { ما كان إبراهيم يهودياً } في سورة آل عمران ( 67 ) .ومعنى طلب أن يجعلهما مسلمين هو طلب الزيادة في ما هما عليه من الإسلام وطلب الدوام عليه ، لأن الله قد جعلهما مسلمين من قبل كما دل عليه قوله : { إذ قال له ربه أسلم } \\[ البقرة : 131 \\] الآية .وقوله : { ومن ذريتنا أمة مسلمة لك } يتعين أن يكون { من ذريتنا } و { مسلمة } معمولين لفعل { واجعلنا } بطريق العطف ، وهذا دعاء ببقاء دينهما في ذريتهما ، و ( من ) في قوله : { ومن ذريتنا } للتبعيض ، وإنما سألا ذلك لبعض الذرية جمعاً بين الحرص على حصول الفضيلة للذرية وبين الأدب في الدعاء لأن نبوءة إبراهيم تقتضي علمه بأنه ستكون ذريته أمماً كثيرة وأن حكمة الله في هذا العالم جرت على أنه لا يخلو من اشتماله على الأخيار والأشرار فدعا الله بالممكن عادة ، وهذا من أدب الدعاء وقد تقدم نظيره في قوله تعالى : { قال ومن ذريتي } \\[ البقرة : 124 \\] .ومن هنا ابتدىء التعريض بالمشركين الذين أعرضوا عن التوحيد واتبعوا الشرك ، والتمهيد لشرف الدين المحمدي .والأمة اسم مشترك يطلق على معان كثيرة والمراد منها هنا الجماعة العظيمة التي يجمعها جامع له بال من نسب أو دين أو زمان ، ويقال أمة محمد مثلاً للمسلمين لأنهم اجتمعوا على الإيمان بنبوة محمد صلى الله عليه وسلم وهي بزنة فُعله وهذه الزنة تدل على المفعول مثل لقطة وضحكة وقدوة ، فالأمة بمعنى مأمومة اشتقت من الأم بفتح الهمزة وهو القصد ، لأن الأمة تقصدها الفرق العديدة التي تجمعها جامعة الأمة كلها ، مثل الأمة العربية لأنها ترجع إليا قبائل العرب ، والأمة الإسلامية لأنها ترجع إليها المذاهب الإسلامية ، وأما قوله تعالى :{ وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم } \\[ الأنعام : 38 \\] فهو في معنى التشبيه البليغ أي كأمم إذا تدبرتم في حكمة إتقان خلقهم ونظام أحوالهم وجدتموه كأمم أمثالكم لأن هذا الاعتبار كان الناس في غفلة عنه .وقد استجيبت دعوة إبراهيم في المسلمين من العرب الذين تلاحقوا بالإسلام قبل الهجرة وبعدها حتى أسلم كل العرب إلا قبائل قليلة لا تنخرم بهم جامعة الأمة ، وقد أشار إلى هذا المعنى قوله تعالى : { ربنا وابعث فيهم رسولاً منهم } \\[ البقرة : 129 \\] ، وأما من أسلموا من بني إسرائيل مثل عبد الله بن سلام فلم يلتئم منهم عدد أمة .وقوله : { وأرنا مناسكنا } سؤال لإرشادهم لكيفية الحج الذي أمرا به من قبل أمراً مجملاً ، ففعل { أرنا } هو من رأى العرفانية وهو استعمال ثابت لفعل الرؤية كما جزم به الراغب في «المفردات» والزمخشري في «المفصل» وتعدت بالهمز إلى مفعولين . وحق رأى أن يتعدى إلى مفعول واحد لأن أصله هو الرؤية البصرية ثم استعمل مجازاً في العلم بجعل العلم اليقيني شبيهاً برؤية البصر ، فإذا دخل عليه همز التعدية تعدى إلى مفعولين وأما تعدية أرى إلى ثلاثة مفاعيل فهو خلاف الأصل وهو استعمال خاص وذلك إذا أراد المتكلم الإخبار عن معرفة صفة من صفات ذات فيذكر اسم الذات أولاً ويعلم أن ذلك لا يفيد مراده فيكمله بذكر حال لازمة إتماماً للفائدة فيقول رأيت الهلال طالعاً مثلاً ثم يقول : أراني فلان الهلال طالعاً ، وكذلك فعل علم وأخواته من باب ظن كله ومثله باب كان وأخواتها ، ألا ترى أنك لو عدلت عن المفعول الثاني في باب ظن أو عن الخبر في باب كان إلى الإتيان بمصدر في موضع الاسم في أفعال هذين البابين لاستغنيت عن الخبر والمفعول الثاني فتقول كان حضور فلان أي حصل وعلمت مجيء صاحبك وظننت طلوع الشمس وقد رُوي قولُ الفِنْد الزِّمّاني :عَسَى أن يُرجِعَ الأيّا ... مُ قَوْماً كالذي كانواوقال حَطائط بن يَعْفُر :أَرِيني جَواداً مات هُزْلاً لعلَّني ... أَرى ما ترين أو بخيلاً مُخَلَّدافإن جملة مات هزلاً ليست خبراً عن جواداً إذ المبتدأ لايكون نكرة ، وبهذا يتبين أن الصواب أن يعد الخبر في باب كان والمفعول الثاني في باب ظن أحوالاً لازمة لتمام الفائدة وأن إطلاق اسم الخبر أو المفعول على ذلك المنصوب تسامح وعبارة قديمة .وقرأ ابن كثير ويعقوب { وأرْنا } بسكون الراء للتخفيف وقرأه أبو عمرو باختلاس كسرة الراء تخفيفاً أيضاً ، وجملة { إنك أنت التواب الرحيم } تعليل لجمل الدعاء .والمناسك جمع منسك وهو اسم مكان من نسك نَسكاً من باب نصر أي تعبد أو من نسك بضم السين نساكة بمعنى ذبح تقرباً ، والأظهر هو الأول لأنه الذي يحق طلب التوفيق له وسيأتي في قوله تعالى : { فإذا قضيتم مناسككم } \\[ البقرة : 200 \\] .\n\n",
      "translations": [
        {
          "translation": "21 (Our Lord!) our Lord! (And make us submissive) obedient and sincere (unto Thee) by not ascribing any partners to you and through worshipping You (and of our seed a nation submissive) obedient and sincere (unto Thee) by not ascribing any partners to you and through worshipping You, (and show us our rites) teach us the rites of our pilgrimage, (and relent towards us) overlook our shortcomings. (Lo! Thou, only Thou, art the Relenting) You who overlooks shortcomings, (the Merciful) towards the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَرِنَا مَنَاسِكَنَا } معناه عَلِّمنا مناسِكَنَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Show us our rites,\" means, \"Teach us our rites.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبَّنَا وَٱجْعَلْنَا } بفضلك { مُسْلِمَيْنِ لَكَ } مستسلمين مفوضين جميع أمورنا إليك\n مخلصين فيه ربنا { وَ } اجعل أيضاً { مِن ذُرِّيَّتِنَآ } المنتسبين إلينا { أُمَّةً مُّسْلِمَةً } مسلمة { لَّكَ } مطيعة لأمرك { وَأَرِنَا } اكشف لنا ولهم { مَنَاسِكَنَا } سرائر مناسكنا التي نعملها على مقتضى أمرك وتكليفك { وَ } إن أخطأنا فيما أمرتنا { تُبْ عَلَيْنَآ } عماجرى علينا من لوازم بشريتنا { إِنَّكَ أَنتَ ٱلتَّوَّابُ } للعباد العاصين الخاطئين { ٱلرَّحِيمُ } [البقرة: 128] بقبول توبتهم\n وإن نقضوها مراراً\n\n\nثم لما كان الغالب عليهما توحيد الصفات والأفعال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال ابن عباس رضي الله عنه: لما فرغ إبراهيم وإسماعيل من بناء البيت\n دَعَوَا بهذا الدعاء\n فقال: { ربنا واجعلنا مسلمين لك } أي: منقادين لأوامرك الظاهرة ولأحكامك القهرية\n واجعل { من ذريتنا أمة } أي: جماعة { مسلمة لك }؟ عَلِمَا - بوحي أو إلهام - أنه يكون من ذريتهما من يكفر بالله\n { وأرنا } أي: عرفنا وعلمنا { مناسكنا } في الحج\n والنُّسُك في الأصل: غاية العبادة\n وشاع في الحج لما فيه من المشاق والكلفة\n والبعد عن العادة\n { وتب علينا } مما لا يليق بحالنا\n فسحناتُ الأبرار سيئات المقربين\n فلكل مقام ما ينقصه وإن كان كاملاً\n ولهذا كان عليه الصلاة والسلام يستغفر في الملجس سبعين مرة\nإذ ما من مقام إلا وقبله ما فيه نقص\n فإذا ترقى عنه استغفر منه { إنك أنت التواب الرحيم } أي: كثير القبول والإقبال على التائبين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:162",
      "similarity": 0.7768488915520476
    },
    {
      "verse": "22:67",
      "similarity": 0.7315059259037443
    },
    {
      "verse": "2:200",
      "similarity": 0.6976260168600104
    },
    {
      "verse": "22:34",
      "similarity": 0.3298688171690956
    },
    {
      "verse": "14:40",
      "similarity": 0.22417454620837393
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002128.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002128.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:128.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}