{
  "chapter": "البقرة",
  "text": "واذا قيل لهم ءامنوا۟ كما ءامن الناس قالوا۟ انؤمن كما ءامن السفهاء الا انهم هم السفهاء ولكن لا يعلمون",
  "translations": [
    {
      "translation": "When they are told, 'Have iman in the way that the people have iman,' they say, 'What! Are we to have iman in the way that fools have iman?' No indeed! They are the fools, but they do not know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When asked to believe as others do, they say: \"Should we believe like fools?\" And yet they are the fools, even though they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Believe sincerely as the other people have believed\", they reply, \"Should we believe as fools have believed?\" Beware! they themselves are the fools, but they know it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to believe as everyone else does, they say, \"Should we believe as fools do?\" In fact, they themselves are fools, but they do not know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Believe as the others believe”, they say, “Shall we believe as the foolish believe?” It is they who are the fools, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Believe as the people believe,\" They say: \"Shall we believe as the fools have believed\" Verily, they are the fools, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Believe as the people believe, they say: Shall we believe as the fools believe? Now surely they themselves are the fools, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, 'Believe as the people believe', they say, 'Shall we believe, as fools believe?' Truly, they are the foolish ones, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: believe as the people believe, they say: shall we believe as the foolish believe? are not they indeed the foolish? But they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, \"Believe as other people have believed,\" they say, \"Are we to believe just as fools believe?\" Surely they are the fools, even though they do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them: believe even as mankind have believed, they say: shall we believe even as the fools have believed? Lo! verily it is they who are the fools; and yet they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, ‘Believe like the people who have believed,’ they say, ‘Shall we believe like the fools who have believed?’ Behold! They are themselves the fools, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Believe as the others believe:\" They say: \"Shall we believe as the fools believe?\" Nay, of a surety they are the fools, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them (hypocrites): \"Believe as the people (followers of Muhammad Peace be upon him, Al-Ansar and Al-Muhajirun) have believed,\" they say: \"Shall we believe as the fools have believed?\" Verily, they are the fools, but they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Believe as (other) people believe,' they reply, 'Are we to believe as fools believe?' It is they who are the fools, if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Believe as the people have believed,” they say, “Shall we believe as the fools have believed?” In fact, it is they who are the fools, but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Believe as the people have believed,\" they say, \"Should we believe as the foolish have believed?\" Unquestionably, it is they who are the foolish, but they know [it] not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:13] When it is said to them, ‘Believe as the people believe’, that is, as the Companions of the Prophet (s), They say, ‘Shall we believe as fools believe?’, that is, as the ignorant do? No we do not follow their way. The exalted One refutes them, saying: Truly, they are the foolish ones, but they know, this, not.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهو من تمام المقول قبله فحكمه حكمه بالعطف والقائل ، ويجوز هنا أن يكون القائل أيضاً طائفة من المنافقين يشيرون عليهم بالإقلاع عن النفاق لأنهم ضجروه وسئموا كُلَفَهُ ومتَّقياته ، وكَلَّت أذهانهم من ابتكار الحِيَل واختلاق الخطل . وحذف مفعول { آمِنوا } استغناء عنه بالتشبيه في قوله : { كما آمن الناس } أو لأنه معلوم للسامعين . وقوله : { كما آمن الناس } الكاف فيه للتشبيه أو للتعليل ، واللام في ( الناس ) للجنس أو للاستغراق العرفي . والمراد بالناس من عَدَا المخاطبين ، كلمة تقولها العرب في الإغراء بالفعل والحث عليه لأن شأن النفوس أن تسرع إلى التقليد والاقتداء بمن يسبقها في الأمر ، فلذلك يأتون بهاته الكلمة في مقام الإغراء أو التسلية أو الائتساء ، قال عَمْرو ابن البَرَّاقَة النِّهْمِي :وننصُرُ مولانا ونَعَلُم أَنَّه ... كما الناسسِ مجرومٌ عليه وجَارموقوله : { أنؤمن كما آمن السفهاء } استفهام للإنكار ، قصدوا منه التبرىء من الإيمان على أبلغ وجه ، وجعلوا الإيمان المتبرأ منه شبيهاً بإيمان السفهاء تشنيعاً له وتعريضاً بالمسلمين بأنهم حملهم على الإيمان سفاهة عقولهم ، ودلوا على أنهم علموا مراد من يقول لهم { كما آمن الناس } أنه يعني بالناس المسلمين .والسفهاءُ جمع سفيه وهو المتصف بالسفاهة ، والسفاهة خفة العقل وقلة ضبطه للأمور قال السموأل :نَخاف أن تَسْفَهَ أحلامُنَا ... فَنَخْمل الدهرَ مع الخاملوالعرب تطلق السفاهة على أفن الرأي وضعفه ، وتطلقها على سوء التدبير للمال . قال تعالى : { ولا تؤتوا السفهاء أموالكم } \\[ النساء : 5 \\] وقال : { فإن كان الذي عليه الحق سفيهاً أو ضعيفاً } \\[ البقرة : 282 \\] الآية لأن ذلك إنما يجىء من ضعف الرأي . ووصفهم المؤمنين بالسفاهة بهتان لزعمهم أن مخالفتهم لا تكون إلا لخفة في عقولهم ، وليس ذلك لتحقيرهم ، كيف وفي المسلمين سادة العرب من المهاجرين والأنصار . وهذه شنشنة أهل الفساد والسفه أن يرموا المصلحين بالمذمات يهتاناً ووقاحة ليلهوهم عن تتبع مفاسدهم ولذلك قال أبو الطيب :وإذا أتتْكَ مَذمَّتي من ناقص ... فهي الشهادةُ لي بأني كاملوليس في هاته الآية دليل على حكم الزنديق إذا ظهر عليه وعرفت زندقته إثباتاً ، ولا نفياً لأن القائلين لهم { آمنوا كما آمن الناس } هم من أقاربهم أو خاصتهم من المؤمنين الذين لم يفشوا أمرهم فليس في الآية دليل على ظهور نفاقهم للرسول بوجه معتاد ولكنه شيء أطلع عليه نبيئه ، وكانت المصلحة في ستره ، وقد اطّلع بعض المؤمنين عليه بمخالطتهم وعلموا من النبيء صلى الله عليه وسلم الإعراض عن إذاعة ذلك فكانت الآية غير دالة على حكم شرعي يتعلق بحكم النفاق والزندقة .{ ألاا إِنَّهُمْ هُمُ السفهآء ولكن لاَّ يَعْلَمُونَ } .أتى بما يقابل جفاء طبعهم انتصاراً للمؤمنين ، ولولا جفاء قولهم : { أنؤمن كما آمن السفهاء } لما تصدى القرآن لسبابهم مع أن عادته الإعراض عن الجاهلين ولكنهم كانوا مضرب المثل : «قُلتَ فأَوْجَبْتَ» ، ولأنه مقام بيان الحق من الباطل فتحسن فيه الصراحة والصرامة كما تقرر في آداب الخطابة ، وأعلن ذلك بكلمة ألاَ المؤذنة بالتنبيه للخبر ، وجاء بصيغة القصر على نحو ما قرر في :{ ألا إنهم هم المفسدون } \\[ البقرة : 12 \\] ليدل على أن السفاهة مقصورة عليهم دون المؤمنين فهو إضافي لا محالة . وإذا ثبتت لهم السفاهة انتفى عنهم الحِلم لا محالة لأنهما ضدان في صفات العقول( إِنَّ ) هنا لتوكيد الخبر وهو مضمون القصر وضمير الفصل لتأكيد القصر كما تقدم آنفاً . و ( أَلا ) كأختها المتقدمة في : { ألا إنهم هم المفسدون } .وقوله : { ولكن لا يعلمون } نفى عنهم العلم بكونهم سفهاء بكلمة { يعلمون دون يشعرون خلافاً للآيتين السابقتين لأن اتصافهم بالسفه ليس مما شأنه الخفاء حتى يكون العلم به شُعوراً ويكونَ الجهل به نفيَ شُعور ، بل هو وصف ظاهر لا يخفى لأن لقاءهم كل فريق بوجه واضطرابهم في الاعتماد على إحدى الخَلَّتين وعدم ثباتهم على دينهم ثباتاً كاملاً ولا على الإسلام كذلك كافَ في النداء بسفاهة أحلامهم فإن السفاهة صفة لا تكاد تخفى ، وقد قالت العرب : السفاهة كاسمها ، قال النابغة :نُبئْتُ زرعة والسفاهةُ كاسمها ... يُهدى إليّ غَرائبَ الأشعاروقال جَزْءُ بن كلاب الفَقْعَسي :تَبَغّى ابنُ كُوز والسَّفَاهَة كاسمها ... لِيَسْتَادَ مِنَّا أَنْ شَتَوْنَا لَيَالِيافظنهم أن ما هم عليه من الكفر رُشد ، وأن ما تقلده المسلمون من الإيمان سَفَه يدل على انتفاء العلم عنهم . فموقع حرف الاستدراك لدفع تعجب من يتعجب من رضاهم بالاختصاص بوصف السفاهة .\n\n",
      "translations": [
        {
          "translation": "(And when it is said unto them) i.e. to Jews, (believe) in Muhammad (pbuh) (as the people believe), i.e. 'Abdullah Ibn Salam and his companions, (they say: Shall we believe) in Muhammad (pbuh) and the Qur'an, (as the foolish believe?), i.e. as the stupid and ignorant do, (Surely they are the fools) the stupid and ignorant. (But they know not) that they are so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وفازوا في الدارين فوزاً عظيماً بسبب الإيمان { قَالُوۤاْ } في الجواب توبيخاً وتقريعاً: { أَنُؤْمِنُ } بهذا الرجل الحقير الساقط\n وبهذه الأساطير الكاذبة ونترك دين آبائنا { كَمَآ آمَنَ ٱلسُّفَهَآءُ } التاركون دين آبائهم لغرور هذا المدعي المفتري؟ { أَلاۤ } أيها المبعوث لإهداء المضلين المجبولين على الهداية في أصل فطرتهم { إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ } المجبولون على الغوية في بدء الفطرة لا يمكنك هدايتهم أصلاً\n لعدم قابليتهم واستعدادهم للإيمان { وَ } إن ظنوا في زعمهم من العقلاء { لَـٰكِن لاَّ يَعْلَمُونَ } [البقرة: 13] أصلاً لتركب جهلهم المركوز في جبلتهم\n فيسلب قابليتهم للإيمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الكاف من { كَمَا آمَنَ } صفة لمصدر محذوف، و { ما } مصدرية. أي: إذا قيل لهم آمنوا إيماناً خالصاً من النفاق مثل إيمان المسلمين، أو من أسلم من جلدتهم، والسفه: خفة وطيش في العقل، يقال: ثوب سفيه، أي: خفيف. يقول الحقّ جلّ جلاله: { وَإذَا قِيلَ } لهؤلاء المنافقين من المشركين واليهود: اتركوا ما أنتم عليه من الكفر والجحود، وراقبوا الملك المعبود، وطهروا قلوبكم من الكفر والنفاق، وأقصروا مما أنتم فيه من العباد والشقاق و { آمنوا } إيماناً خالصاً مثل إيمان المسلمين، لتكونوا معهم في أعلى عليين، \" مَنْ أحَبَّ قَوْماً حُشرِ مَعهم \". \" المَرْءُ مَعَ مَنْ أَحَبَّ \" ، { قَالُوا } مترجمين عما في قلوبهم من الكفر والنفاق: { أَنُؤْمِنُ كَمَا آمَنَ السُّفُهَاءُ } الذين لا عقل لهم، إذ جُلهم فقراء ومَوَالي. قال الحق تعالى في الرد عليهم وتقبيح رأيهم: { أَلا إِنَّهُمْ هُمُ السُّفَهَاءُ } لا غيرهم، حيث تركوا ما هو السبب في الفوز العظيم بالنعيم المقيم، وارتكبوا ما استوجبوا به الخلود في الدرك الأسفل من الجحيم { وَلَكَن لاَّ يَعْلَمُونَ } ،\n[الشُّعَراء: 227]، عبَّر الحق في هذه الآية بـ { لا يعلمون } وفي الأولى بـ\n[الأعرَاف: 95] لأن الفساد في الأرض يدرك بأدنى شعور، بخلاف الإيمان والتمييز بين الحق والباطل فيحتاج إلى زيادة تفكر واكتساب علم. والله تعالى أعلم. الإشارة: وإذا قيل لأهل الإنكار على أهل الخصوصية، القاصدين مشاهدة عظمة الربوبية، قد تجرّدوا عن لباس العز والاشتهار، ولبسوا أطمار الذل والافتقار، آمنوا بطريق هؤلاء المخصوصين، وادخلوا معهم كي تكونوا من المقربين. قالوا: { أنؤمن كما آمن السفهاء } ونترك ما نحن عليه من العز والكبرياء، قال الله تعالى في تسفيه رأيهم وتقبيح شأنهم: { ألا إنهم هم السفهاء } حيث تعززوا بعز يفنى، وتركوا العز الذي لا يفنى، قال الشاعر:\nفلو علموا ما في طيّ الذل من العز، وما في طي الفقر من الغنى، لجالدوا عليه بالسيوف، ولكن لا يعلمون.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:67",
      "similarity": 0.7727507995719434
    },
    {
      "verse": "7:66",
      "similarity": 0.6534478072118104
    },
    {
      "verse": "6:140",
      "similarity": 0.5695827920160141
    },
    {
      "verse": "2:142",
      "similarity": 0.48728986974182553
    },
    {
      "verse": "4:5",
      "similarity": 0.4063261360080251
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}