{
  "chapter": "البقرة",
  "text": "تلك امة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسـلون عما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "That was a community which has long since passed away. It has what it earned. You have what you have earned. You will not be questioned about what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were the people, and they have passed away. Theirs the reward for what they did, as yours will be for what you do. You will not be questioned about their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were a people who passed away; they shall receive the reward of what they earned and you shall have the reward of what you will earn; and you will not be questioned as to what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That nation (children of Abraham) is gone. They have reaped what they sowed, and the same applies to you. You are not responsible for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was a nation that has passed away; for them is what they earned, and yours is what you earn; and you will not be questioned about their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation who has passed away. They shall receive the reward of what they earned and you of what you earn. And you will not be asked of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a people that have passed away; they shall have what they earned and you shall have what you earn, and you shall not be called upon to answer for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is a nation that has passed away; there awaits them that they have earned, and there awaits you that you have earned; you shall not be questioned concerning the things they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are a people who have passed away. Theirs is that which they earned, and yours is that which ye earn. And ye will not be asked of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were a people that have passed away; what they did is theirs and what you have done is yours. You will not be answerable for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That are a community who have passed away, unto them shall be that which they earned and unto you that which ye earn, and ye shall be questioned not of that which they were wont to Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation that has passed: for it there will be what it has earned, and for you there will be what you have earned, and you will not be questioned about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a people that hath passed away. They shall reap the fruit of what they did, and ye of what ye do! Of their merits there is no question in your case!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation who has passed away. They shall receive the reward of what they earned and you of what you earn. And you will not be asked of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation that has passed away. Theirs is what they earned, and yours what you have earned. You shall not be questioned about what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a community that has passed; for them is what they have earned, and for you is what you have earned; and you will not be questioned about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation which has passed on. It will have [the consequence of] what it earned, and you will have what you have earned. And you will not be asked about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:134] That (tilka, is the subject of this sentence and denotes Abraham, Jacob and his sons, and is feminine because it agrees with the gender of its predicate) is a community that has passed away, has gone before; theirs is what they have earned, the reward for their deeds (lahā mā kasabat, theirs is what they have earned’, constitutes the commencement of a new sentence) and yours (the Jews are being addressed here) is what you have earned; you shall not be asked about what they did, in the same way that they will not be asked about what you did, this latter statement being an affirmation of the former.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعقبت الآيات المتقدمة من قوله : { وإذ ابتلى إبراهيم ربه } \\[ البقرة : 124 \\] بهذه الآية لأن تلك الآيات تضمنت الثناء على إبراهيم وبنيه والتنويه بشأنهم والتعريض بمن لم يقتف آثارهم من ذريتهم وكأن ذلك قد ينتحل منه المغرورون عذراً لأنفسهم فيقولون نحن وإن قصرنا فإن لنا من فضل آبائنا مسلكاً لنجاتنا ، فذكرت هذه الآية لإفادة أن الجزاء بالأعمال لا بالاتكال .والإشارة بتلك عائدة إلى إبراهيم وبنيه باعتبار أنهم جماعة وباعتبار الإخبار عنهم باسم مؤنث لفظه وهو أمة .والأمة تقدم بيانها آنفاً عند قوله تعالى : { ومن ذريتنا أمة مسلمة لك } \\[ البقرة : 128 \\] .وقوله : { قد خلت } صفة لأمة ومعنى خلت مضت ، وأصل الخلاء الفراغ فأصل معنى خلت خلا منها المكان فأسند الخلو إلى أصحاب المكان على طريقة المجاز العقلي لنكتة المبالغة ، والخبر هنا كناية عن عدم انتفاع غيرهم بأعمالهم الصالحة وإلا فإن كونها خلت مما لا يحتاج إلى الإخبار به ، ولذا فقوله : { لها ما كسبت } الآية بدل من جملة { قد خلت } بدل مفصل من مجمل .والخطاب موجه إلى اليهود أي لا ينفعكم صلاح آبائكم إذا كنتم غير متبعين طريقتهم ، فقوله : { لها ما كسبت } تمهيد لقوله : { ولكم ما كسبتم } إذ هو المقصود من الكلام ، والمراد بما كسبت وبما كسبتم ثواب الأعمال بدليل التعبير فيه بلها ولكم ، ولك أن تجعل الكلام من نوع الاحتباك والتقرير لها ما كسبت وعليكم ما كسبتم أي إثمه .ومن هذه الآية ونظائرها انتزع الأشعري التعبير عن فعل العبد بالكسب .وتقديم المسندين على المسند إليهما في { لها ما كسبت ولكم ما كسبتم } لقصر المسند إليه على المسند أي ما كسبت الأمة لا يتجاوزها إلى غيرها وما كسبتم لا يتحاوزكم ، وهو قصر إضافي لقلب اعتقاد المخاطبين فإنهم لغرورهم يزعمون أن ما كان لأسلافهم من الفضائل يزيل ما ارتكبوه هم من المعاصي أو يحمله عنهم أسلافهم .وقوله : { ولا تسألون عما كانوا يعملون } معطوف على قوله : { لها ما كسبت } وهو من تمام التفصيل لمعنى خلت ، فإن جعلت { لها ما كسبت ولكم ما كسبتم } خاصاً بالأعمال الصالحة فقوله : { ولا تسألون } إلخ تكميل للأقسام أي وعلى كل ما عمل من الإثم ولذا عبر هنالك بالكسب المتعارف في الادخار والتنافس وعبر هنا بالعمل . وإنما نفى السؤال عن العمل لأنه أقل أنواع المؤاخذة بالجريمة فإن المرء يؤخذ بجريمته فيسأل عنها ويعاقب وقد يسأل المرء عن جريمة غيره ولا يعاقب كما يلام على القوم فعل بعضهم ما لا يليق وهو شائع عند العرب قال زهير :لعمري لنِعْمَ الحيُّ جَرَّ عليهم ... بما لا يُواتيهم حُصَين بن ضَمْضمِفنفي أصل السؤال أبلغ وأشمل للأمرين ، وإن جعلت قوله : { ولكم ما كسبتم } مراداً به الأعمال الذميمة المحيطة بهم كان قوله : { ولا تسألون } إلخ احتراساً واستيفاء لتحقيق معنى الاختصاص أي كل فريق مختص به عمله أو تبعته ولا يلحق الآخر من ذلك شيء ولا السؤال عنه ، أي لا تحاسبون بأعمال سلفكم وإنما تحاسبون بأعمالكم .\n\n",
      "translations": [
        {
          "translation": "(Those are the people) a group of people (who have passed away) perished. (Theirs is that which they earned) of goodness (and yours is that which ye earn) of goodness. (And ye will not be asked) on the Day 22 of Judgement (of what they used to do) or say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ تلك أمة قد خلت } أي: لا تكونوا مقلدين ولا تكتفوا بالتقليد الصرف في الدين إذ لا اعتماد على النقل، فليس لأحد إلا ما كسب من العلم والعمل والاعتقاد والسيرة، لا يجازى أحد بمعتقد غيره ولا بعمله، فكونوا على بصائركم واطلبوا اليقين واعملوا عليه.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ أُمَّةٌ قَدْ خَلَتْ } مضت { لَهَا مَا كَسَبَتْ } من العزائم الدينية\n وعليها ما اكتسبت من الجرائم المتعلقة به بحسب ذلك الزمان { وَلَكُمْ مَّا كَسَبْتُمْ } من فوائد الإيمان والإسلام\n و عليكم ما اكتسبتم من غوائل الكفر والطغيان بحسب زمانكم هذا\n إذ لك منكم ومنهم لم يجز إلا بما عمل وكسب { وَلاَ تُسْأَلُونَ } وتؤاخذون أنتم { عَمَّا كَانُوا يَعْمَلُونَ } [البقرة: 134] من السيئات\n كما لا تثابون من حسناتهم بل كل امرئ بما كسب رهين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فتلك { أمة } أي: جماعة { قد خلت لها ما كسبت } من الخير\n { ولكم ما كسبتم } أنتم\n { ولا تسألون عما كانوا يعملون } فلا تؤاخذون بسيئاتهم\n كما لا تثابون بحسناتهم\n وهذا كما قال صلى الله عليه وسلم لقريش:\n \" لا يأتيني الناسُ بأعمَالهِم وتَأتُوني بأنْسَابِكُم \"\n \nالإشارة: يقال لمن حصرَ الخصوصية في أسلافه\n ونفاها عن غيرهم: هل حضرتم معهم حين أوصوا بذلك؟ بل ما كانوا يوصون إلا بإخلاص العبودية\n وتوحيد الألوهية\n ومشاهدة عظمة الربوبية\n فمن حصّل هذه الخصال كانت الخصوصية معه أينما كان\n ومَن حاد عنها ومال إلى متابعة الهوى انتقلت إلى غيره\n ويقال له: إن أسلافه قد جَدُّوا ووجَدُوا\n وأنت لا تنتفع بأعمالهم في طريق الخصوصية\n { تلك أمة قد خلت لها ما كسبت ولكم ما كسبتم\n\n\n } الآية\n وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:141",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "46:18",
      "similarity": 0.5903720486600735
    },
    {
      "verse": "35:24",
      "similarity": 0.5848744924137916
    },
    {
      "verse": "84:4",
      "similarity": 0.5760010635708936
    },
    {
      "verse": "13:30",
      "similarity": 0.4590763207505276
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002134.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002134.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:134.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}