{
  "chapter": "البقرة",
  "text": "ومن يرغب عن ملة ابرهم الا من سفه نفسه ولقد اصطفينه فى الدنيا وانه فى الءاخرة لمن الصلحين",
  "translations": [
    {
      "translation": "Who would deliberately renounce the religion of Ibrahim except someone who reveals himself to be a fool? We chose him in this world and in the Next World he will be one of the righteous.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who will turn away from the creed of Abraham but one dull of soul? We made him the chosen one here in the world, and one of the best in the world to come,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, who else can have aversion to the way of Abraham but the one who has debased himself with folly and ignorance? Abraham was the man whom We chose for Our service in this world, and in the Next World he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one turns away from Abraham's Tradition except one who makes a fool of himself. To Abraham We have granted distinction in this world and in the life hereafter he will be among the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who will renounce the religion of Ibrahim except him who is a fool at heart? We indeed chose him (Ibrahim) in this world; and indeed in the Hereafter he is among those worthy of being closest to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who turns away from the religion of Ibrahim (i.e. Islamic Monotheism) except him who fools himself Truly, We chose him in this world and verily, in the Hereafter he will be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who forsakes the religion of Ibrahim but he who makes himself a fool, and most certainly We chose him in this world, and in the hereafter he is most surely among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who therefore shrinks from the religion of Abraham, except he be foolish-minded? Indeed, We chose him in the present world, and in the world to come he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who forsaketh the religion of Abraham save him who befooleth himself? Verily We chose him in the world, and lo! in the Hereafter he is among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who but a foolish man would turn away from the religion of Abraham? We chose him in this world, and in the Hereafter he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who shall be averse from the faith of Ibrahim, save one who befooleth his soul! And assuredly We chose him in this World, and verily he in the Hereafter shall be of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who will [ever] forsake Abraham’s creed except one who debases himself? We certainly chose him in the [present] world, and in the Hereafter he will indeed be among the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who turns away from the religion of Abraham but such as debase their souls with folly? Him We chose and rendered pure in this world: And he will be in the Hereafter in the ranks of the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who turns away from the religion of Ibrahim (Abraham) (i.e. Islamic Monotheism) except him who befools himself? Truly, We chose him in this world and verily, in the Hereafter he will be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who has no desire for the religion of Abraham, except he who fooled himself? We chose him in this world, and in the Everlasting world, he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who would forsake the religion of Abraham, except he who fools himself? We chose him in this world, and in the Hereafter he will be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who would be averse to the religion of Abraham except one who makes a fool of himself. And We had chosen him in this world, and indeed he, in the Hereafter, will be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:130] Who therefore, meaning ‘none’, shrinks from the religion of Abraham, abandoning it, except he who fools himself?, that is to say, either the one who ignores that his soul has been created for God, and that it is obliged to worship Him, or the one who treats it with frivolity and degrades it. Indeed We chose him, We elected him, in this world, for prophethood and friendship, and in the Hereafter he shall be among the righteous, those of the high stations [al-darajāt al-‘ulā, cf. Q. 20:75].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nموقع هاته الآيات من سوابقها موقع النتيجة بعد الدليل ، فإنه لما بين فضائل إبراهيم من قوله : { وإذ ابتلى } \\[ البقرة : 124 \\] إلى هنا علم أن صاحب هاته الفضائل لا يعدل عن دينه والاقتداء به إلا سفيه العقل أفن الرأي ، فمقتضى الظاهر أن تعطف على سوابقها بالفاء وإنما عدل من الفاء إلى الواو ليكون مدلول هذه الجملة مستقلاً بنفسه في تكميل التنويه بشأن إبراهيم وفي أن هذا الحكم حقيق بملة إبراهيم من كل جهة لا من خصوص ما حكي عنه في الآيات السالفة وفي التعريض بالذين حادوا عن الدين الذي جاء متضمناً لملة إبراهيم ، والدلالة عن التفريع لا تفوت لأن وقوع الجملة بعد سوابقها متضمنة هذا المعنى دليل على أنها نتيجة لما تقدم كما تقول أحسن فلان تدبير المهم وهو رجل حكيم ولا تحتاج إلى أن تقول فهو رجل حكيم .والاستفهام للإنكار والاستبعاد ، واستعماله في الإنكار قد يكون مع جواز إرادة قصد الاستفهام فيكون كناية ، وقد يكون مع عدم جواز إرادة معنى الاستفهام فيكون مجازاً في الإنكار ويكون معناه معنى النفي ، والأظهر أنه هنا من قبيل الكناية فإن الإعراض عن ملة إبراهيم مع العلم بفضلها ووضوحها أمر منكر مستبعد . ولما كان شأن المنكر المستبعد أن يسأل عن فاعله استعمل الاستفهام في ملزومه وهو الإنكار والاستبعاد على وجه الكناية مع أنه لو سئل عن هذا المعرض لكان السؤال وجيهاً ، والاستثناء قرينة عن إرادة النفي واستعمال اللفظ في معنيين كنائيين ، أو ترشيح للمعنى الكنائي وهما الإنكار . والاستفهام لا يجيء فيه ما قالوا في استعمال اللفظ المشترك في معنييه واستعمال اللفظ في حقيقته ومجازه أو في مجازيه لأن الدلالة على المعنى الكنائي بطريق العقل بخلاف الدلالة على المعنيين الموضوع لهما الحقيقي وعلى المعنى الحقيقي والمجازي إذ الذين رأوا ذلك منعوا بعلة أن قصد الدلالة باللفظ على أحد المعنيين يقتضي عدم الدلالة به على الآخر لأنه لفظ واحد فإذا دل على معنى تمت دلالته وأن الدلالة على المعنيين المجازيين دلالة باللفظ على أحد المعنيين فتقضى أنه نقل من مدلوله الحقيقي إلى مدلول مجازي وذلك يقتضي عدم الدلالة به على غيره لأنه لفظ واحد ، وقد أبطلنا ذلك في المقدمة التاسعة ، أما المعنى الكنائي فالدلالة عليه عقلية سواء بقي اللفظ دالاً على معناه الحقيقي أم تعطلت دلالته عليه . ولك أن تجعل استعمال الاستفهام في معنى الإنكار مجازاً بعلاقة اللزوم كما تكرر في كل كناية لم يرد فيها المعنى الأصلي وهو أظهر لأنه مجاز مشهور حتى صار حقيقة عرفية فقال النحاة : الاستفهام الإنكاري نفي ولذا يجيء بعده الاستثناء ، والتحقيق أنه لايطرد أن يكون بمعنى النفي ولكنه يكثر فيه ذلك لأن شأن الشيء المنكر بأن يكون معدوماً ولهذا فالاستثناء هنا يصح أن يكون استثناء من كلام دل عليه الاستفهام كأنَّ مجيباً أجاب السائل بقوله : «لا يرغب عنها إلا من سفه نفسه .والرغبة طلب أمر محبوب ، فحق فعلها أن يتعدى بفي وقد يعدى بعن إذا ضمن معنى العدول عن أمر وكثر هذا التضمين في الكلام حتى صار منسياً .والملة الدين وتقدم بيانها عند قوله تعالى : { ولن ترضى عنك اليهود ولا النصارى حتي تتبع ملتهم } \\[ البقرة : 120 \\] .وسفه بمعنى استخف لأن السفاهة خفة العقل واضطرابه يقال تسفهه استخفه قال ذو الرمة :مَشَيْن كما اهتزت رماحٌ تسفَّهَتْ ... أَعاليَها مَرُّ الرياح النَّوَاسمومنه السفاهة في الفعل وهو ارتكاب أفعال لا يرضى بها أهل المروءة . والسفه في المال وهو إضاعته وقلة المبالاة به وسوء تنميته . وسفهه بمعنى استخفه وأهانه لأن الاستخفاف ينشأ عنه الإهانة وسفه صار سفيهاً وقد تضم الفاء في هذا .وانتصاب { نفسه } إما على المفعول به أي أهملها واستخفها ولم يبال بإضاعتها دنيا وأخرى ويجوز انتصابه على التمييز المحول عن الفاعل وأصله سَفِهَتْ نفسُه أي خفت وطاشت فحُوِّل الإسنادُ إلى صاحب النفس على طريقة المجاز العقلي للملابسة قصداً للمبالغة وهي أن السفاهة سرت من النفس إلى صاحبها من شدة تمكنها بنفسه حتى صارت صفة لجثمانه ، ثم انتصب الفاعل على التمييز تفسيراً لذلك الإبهام في الإسناد المجازي ، ولا يعكر عليه مجيء التمييز معرفةً بالإضافة لأن تنكير التمييز أغلبي .والمقصود من قوله : { ومن يرغب عن ملة إبراهيم إلا من سفه نفسه } تسفيه المشركين في إعراضهم عن دعوة الإسلام بعد أن بين لهم الرسول صلى الله عليه وسلم أن الإسلام مُقام على أساس الحنيفية وهي معروفة عندهم بأنها ملة إبراهيم قال تعالى : { ثم أوحينا إليك أَننِ اتَّبع ملةَ إبراهيم حنيفاً } \\[ النحل : 123 \\] وقال في الآية السابقة { ربنا واجعلنا مُسْلِمَيْننِ لك ومن ذريتنا أُمَّةً مُسْلِمةً لك } \\[ البقرة : 128 \\] وقال : { وأوْصَى بها إبراهيم بنيه ويعقوبُ } \\[ البقرة : 132 \\] إلى قوله : { فلا تَمُوتُنَّ إلا وأنتم مسلمون } \\[ البقرة : 132 \\] .وجملة { ولقد اصطفيناه } معطوفة على الجمل التي قبلها الدالة على رفعة درجة إبراهيم عند الله تعالى إذ جعله للناس إماماً وضمن له النبوءة في ذريته وأَمَرَهُ ببناء مسجد لتوحيده واستجاب له دعواته .وقد دلت تلك الجمل على اختيار الله إياه فلا جرم أعقبت بعطف هذه الجملة عليها لأنها جامعة لفذلكتها وزائدة بذكر أنه سيكون في الآخرة من الصالحين . واللام جواب قسم محذوف وفي ذلك اهتمام بتقرير اصطفائه وصلاحه في الآخرة .ولأجل الاهتمام بهذا الخبر الأخير أكد بقوله : { وإنه في الآخرة لمن الصالحين } فقوله : { وإنه في الآخرة إلى آخره اعتراض بين جملة اصطفيناه } وبين الظرف وهو قوله : { إذْ قال له ربه أَسلم } ، إذ هو ظرف لاصطفيناه وما عطف عليه ، قصد من هذه الظرفية التخلُّص إلى منقبة أخرى ، لأن ذلك الوقت هو دليل اصطفائه حيث خاطبه الله بوحي وأمره بما تضمنه قوله { أسْلِم } من معانٍ جماعها التوحيدُ والبراءةُ من الحول والقوة وإخلاصُ الطاعة ، وهو أيضاً وقتُ ظهور أن الله أراد إصلاح حاله في الآخرة إذ كلٌّ مُيسَّر لما خلق له .\n\n",
      "translations": [
        {
          "translation": "(And who forsaketh the religion of Abraham) renounces the Religion of Abraham and his practices (save him who befooleth himself?) has ruined himself, lost his mind or is foolish? (Verily We chose him) i.e. Abraham (in the world) by taking him as a friend; as it is said this means: We have chosen him in this world by bestowing upon him prophethood, Islam and goodly offspring, (and lo! In the Hereafter he is among the righteous ones) with his forefathers, the messengers, in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِلاَّ مَن سَفِهَ نَفْسَهُ } معناهُ أَهْلَكها\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {Except for whoever has wronged himself} means that he has destroyed himself.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما جعلنا الخليل إماماً مقتدى للأنام\n هادياً لهم إلى دار السلام { مَن يَرْغَبُ عَن مِّلَّةِ إِبْرَاهِيمَ } أي: من يعرض عن ملته الحنيفية\n الطاهرة عن الميل إلى الآراء والآثام\n البيضاء المنورة لقلوب أهل التفويض والإسلام\n المبينة على محض الوحي والإلهام { إِلاَّ مَن سَفِهَ نَفْسَهُ } أي: لا يعرض عن ملته الغراء إلا من ترك نفسه في ظلمة الإمكان من غير رجوع إلى الفضاء الوجوب\n ليتبع الطريق الموصل إليه { وَ } الله { لَقَدِ ٱصْطَفَيْنَاهُ } واجتبيناه من بين الأنام { فِي ٱلدُّنْيَا } للرسالة والنبوة لإرشاد العباد إلى طريق التوحيد { وَإِنَّهُ فِي ٱلآخِرَةِ لَمِنَ ٱلصَّالِحِينَ } [البقرة: 130] للتحقق والوصول\n لا لطريق الاتحاد والحلول بل لطريق التوحيد الذاتي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من }: استفهامية إنكارية\n فيها معنى النفي\n مبتدأ\n و { يرغب } وما بعده خبر\n و { إلا } إبطال لنفيها الذي تضمنته\n و { مَن سَفِه } بدل من ضمير { يرغب } على المختار\n و { نفسه } مفعول { سَفِه } لتضمنه معنى جهل أو أهلك\n قاله الزجاج\n أو على التمييز قاله الفراء لأن الضمير فيه معنى الشيوع الذي في { مَن } فلم يكسب التعريف\n أو على إسقاط الجارّ وإيصال الفعل إليه\n كقولهم: ضرب فلان الظهر والبطن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "94:8",
      "similarity": 0.477178962383758
    },
    {
      "verse": "9:59",
      "similarity": 0.4336552517790006
    },
    {
      "verse": "68:32",
      "similarity": 0.4249188157832913
    },
    {
      "verse": "7:67",
      "similarity": 0.3823651325992344
    },
    {
      "verse": "7:66",
      "similarity": 0.36983721736422837
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002130.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002130.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:130.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}