{
  "chapter": "البقرة",
  "text": "سيقول السفهاء من الناس ما ولىهم عن قبلتهم التى كانوا۟ عليها قل لله المشرق والمغرب يهدى من يشاء الى صرط مستقيم",
  "translations": [
    {
      "translation": "The fools among the people will ask, 'What has made them turn round from the direction they used to face?'* Say, 'Both East and West belong to Allah. He guides whoever He wills to a straight path.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish will now ask and say: \"What has made the faithful turn away from the Qiblah towards which they used to pray?\" Say: \"To God belong the East and the West. He guides who so wills to the path that is straight.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of course, the foolish people will say, \"What has turned them abruptly away from the giblah towards which they formerly used to turn their faces in prayer?\" Tell them, O Messenger, `'East and West all belong to Allah; He shows the Right Way to anyone He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fools will soon say, \"What has made them (Muslims) change the direction to which they had been facing during their prayers (the qibla)?\" (Muhammad), tell them, \"Both the East and West belong to God and He guides (whomever He wants), to the right direction.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now the foolish people will say, “What has turned the Muslims away from the qiblah (prayer direction) which they formerly observed?”; proclaim, “To Allah only belong the East and the West; He guides whomever He wills upon the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools (idolators, hypocrites, and Jews) among the people will say: \"What has turned them (Muslims) from their Qiblah [prayer direction (towards Jerusalem)] to which they used to face in prayer.\" Say (O Muhammad): \"To Allah belong both, east and the west. He guides whom He wills to the straight way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say: What has turned them from their qiblah which they had? Say: The East and the West belong only to Allah; He guides whom He likes to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say, 'What has turned them from the direction they were facing in their prayers aforetime?' Say: \"To God belong the East and the West; He guides whomsoever He will to a straight path.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish of the people will say: What hath turned them from the qiblah which they formerly observed? Say: Unto Allah belong the East and the West. He guideth whom He will unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish will ask, \"What has made them turn away from their direction of prayer which they used to face?\" Say, \"The East and the West belong to God. He guides whom He pleases to the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon will the foolish among mankind say: what hath turned them away from their Qiblah whereon they had been? Say thou: unto Allah belongeth the east and the west he guideth whomsoever He listeth unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish among the people will say, ‘What has turned them away from the qiblah they were following?’ Say, ‘To Allah belong the east and the west. He guides whomever He wishes to a straight path.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say: \"What hath turned them from the Qibla to which they were used?\" Say: To Allah belong both east and West: He guideth whom He will to a Way that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools (pagans, hypocrites, and Jews) among the people will say, \"What has turned them (Muslims) from their Qiblah [prayer direction (towards Jerusalem)] to which they were used to face in prayer.\" Say, (O Muhammad SAW) \"To Allah belong both, east and the west. He guides whom He wills to a Straight Way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say: 'What has made them turn away from the direction they were facing' Say: 'The east and the west belong to Allah. He guides whom He will to the Straight Path'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ignorant among the people will say, “What has turned them away from the direction of prayer they once followed?” Say, “To God belong the East and the West. He guides whom He wills to a straight path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish among the people will say, \"What has turned them away from their qiblah, which they used to face?\" Say, \"To Allah belongs the east and the west. He guides whom He wills to a straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:142] The fools, the ignorant, among the people, that is, the Jews and the idolaters, will say, ‘What, matter, has turned them, the Prophet (s) and the believers, from the direction they were facing in their prayers formerly?’, this being the Holy House (bayt al-maqdis, sc. Jerusalem); the sīn [of sa-yaqūlu, ‘they will say’] denotes the future tense and informs of the Unseen. Say: ‘To God belong the East and the West, that is, all directions. Thus He commands that they face whichever direction He wills, and there can be no objection. He guides whomever He will, His guidance being, to a straight path’, that is, the religion of Islam, and you are among these [guided ones].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقد خفي موقع هذه الآية من الآي التي بَعْدَها لأن الظاهر منها أنها إخبار عن أمر يقع في المستقبل وأن القبلة المذكورة فيها هي القبلة التي كانت في أول الهجرة بالمدينة وهي استقبال بيت المقدس وأنَّ التولي عنها هو نسخها باستقبال الكعبة فكان الشأن أن يترقب طعن الطاعنين في هذا التحويل بعد وقوع النسخ أي بعد الآيات الناسخة لاستقبال بيت المقدس لِمَا هو معلوم من دأبهم من الترصد للطعن في تصرفات المسلمين فإن السورة نزلت متتابعة ، والأصل موافقة التلاوة للنزول في السورة الواحدة إلاّ ما ثبت أنه نزل متأخراً ويتلى متقدماً .والظاهر أن المراد بالقبلة المحولة القبلةُ المنسوخة وهي استقبال بيت المقدس أعني الشرقَ وهي قبلة اليهود ، ولم يشف أحد من المفسرين وأصحاب «أسباب النزول» الغليل في هذا ، على أن المناسبة بينها وبين الآي الذي قبلها غير واضحة فاحتاج بعض المفسرين إلى تكلف إبدائها .والذي استقر عليه فهمي أن مناسبة وقوع هذه الآية هنا مناسبةٌ بديعة وهي أن الآيات التي قبلها تكرر فيها التنويه بإبراهيم وملته ، والكعبة وأن من يرغب عنها قد سفِه نفسه ، فكانت مثاراً لأن يقول المشركون ، ما ولَّى محمداً وأتباعه عن قبلتهم التي كانوا عليها بمكة أي استقبال الكعبة مع أنه يقول إنه على ملة إبراهيم ويأبى عن إتباع اليهودية والنصرانية ، فكيف ترك قبلة إبراهيم واستقبل بيت المقدس؟ ولأنه قد تكررت الإشارة في الآيات السابقة إلى هذا الغرض بقوله : { ولله المشرق والمغرب } \\[ البقرة : 115 \\] . وقوله : { ولن ترضى عنك اليهود ولا النصارى حتى تتبع ملتهم } \\[ البقرة : 120 \\] كما ذكرناه هنالك ، وقد علم الله ذلك منهم فأنبأ رسوله بقولهم وأتى فيه بهذا الموقع العجيب وهو أن جعله بعد الآيات المثيرة له وقبل الآيات التي أُنزلت إليه في نسخ استقبال بيت المقدس والأمر بالتوجه في الصلاة إلى جهة الكعبة ، لئلا يكون القرآن الذي فيه الأمر باستقبال الكعبة نازلاً بعد مقالة المشركين فيشمخوا بأنوفهم يقولون غيَّر محمد قبلته من أجل اعتراضنا عليه فكان لموضع هذه الآية هنا أفضل تمكن وأوثق ربط ، وبهذا يظهر وجه نزولها قبل آية النسخ وهي قوله : { قد نرى تقلب وجهك في السماء } \\[ البقرة : 144 \\] الآيات ، لأن مقالة المشركين أو توقُّعَها حاصل قبل نسخ استقبال بيت المقدس وناشىء عن التنويه بملة إبراهيم والكعبة .فالمراد بالسفهاء المشركون ويدل لذلك تبيينه بقوله { من الناس ، } فقد عرف في اصطلاح القرآن النازل بمكة أن لفظ الناس يراد به المشركون كما روي ذلك عن ابن عباس ولا يظهر أن يكون المراد به اليهود أو أهل الكتاب لأنه لو كان ذلك لَنَاسب أن يقال سيقولون بالإضمار لأن ذكرهم لم يزل قريباً من الآي السابقة إلى قوله :{ ولا تسألون } \\[ البقرة : 134 ، 141 \\] الآية . ويعضدنا في هذا ما ذكر الفخر عن ابن عباس والبراء بن عازب والحسن أن المراد بالسفهاء المشركون وذكر القرطبي أنه قول الزجاج ، ويجوز أن يكون المراد بهم المنافقين وقد سبق وصفهم بهذا في أول السورة فيكون المقصود المنافقين الذين يبطنون الشرك ، والذي يبعثهم على هذا القول هو عين الذي يبعث المشركين عليه وقد روي عن السدي أن السفهاء هنا هم المنافقون .أما الذين فسروا { السفهاء } باليهود فقد وقعوا في حيرة من موقع هذه الآية لظهور أن هذا القول ناشىء عن تغيير القبلة إلى بيت المقدس وذلك قد وقع الإخبار به قبل سماع الآية الناسخة للقبلة لأن الأصل موافقة التلاوة للنزول فكيف يقول السفهاء هذا القول قبل حدوث داع إليه لأنهم إنما يطعنون في التحول عن استقبال بيت المقدس لأنه مسجدهم وهو قبلتهم في قول كثير من العلماء ، ولذلك جزم أصحاب هذا القول بأن هذه الآية نزلت بعد نسخ استقبال بيت المقدس ورووا ذلك عن مجاهد وروى البخاري في كتاب الصلاة من طريق عبد الله بن رجاء عن إسرائيل عن أبي إسحاق عن البراء حديث تحويل القبلة ووقع فيه «فقال السفهاء وهم اليهود { ما ولاهم عن قبلتهم التي كانوا عليها قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم } ، وأخرجه في كتاب الإيمان من طريق عمرو بن خالد عن زهير عن أبي إسحاق عن البراء بغير هذه الزيادة ، ولكن قال عوضها : \" وكانت اليهود قد أعجبهم إذ كان يصلي قبَل بيت المقدس وأهل الكتاب ، فلما وَلَّى وجهه قبَل البيت أَنكروا ذلك \" وأخرجه في كتاب التفسير من طريق أبي نعيم عن زهير بدون شيء من هاتين الزيادتين ، والظاهر أن الزيادة الأولى مدرجة من إسرائيل عن أبي إسحاق ، والزيادة الثانية مدرجة من عمرو بن خالد لأن مسلماً والترمذي والنسائي قد رووا حديث البراء عن أبي إسحاق من غير طريق إسرائيل ولم يكن فيه إحدى الزيادتين ، فاحتاجوا إلى تأويل حرف الاستقبال من قوله { سيقول السفهاء } بمعنى التحقيق لا غير أي قد قال السفهاء ما ولاهم .ووجه فصل هذه الآية عما قبلها بدون عطف ، اختلافُ الغرض عن غرض الآيات السابقة فهي استئناف محض ليس جواباً عن سؤال مقدر .والأولى بقاء السين على معنى الاستقبال إذ لا داعي إلى صرفه إلى معنى المضي وقد علمتم الداعي إلى الإخبار به قبل وقوعه منهم وقال في «الكشاف» \" فائدة الإخبار به قبل وقوعه أن العلم به قبل وقوعه أبعد من الاضطراب إذا وقع وأن الجواب العتيد قبل الحاجة إليه أقطع للخصم وأرد لشغبه \" وذكر ابن عطية عن ابن عباس أنه من وضع المستقبل موضع الماضي ليدل على استمرارهم فيه وقال الفخر إنه مختار القفال .وكأنَّ الذي دعاهم إلى ذلك أنهم ينظرون إلى أن هذا القول وقع بعد نسخ استقبال بيت المقدس وأن الآية نزلت بعد ذلك وهذا تكلف ينبغي عدم التعويل عليه ، والإخبار عن أقوالهم المستقبلة ليس بعزيز في القرآن مثل قوله : { فسيقولون من يعيدنا فسيتغضون إليك رؤوسهم } \\[ الإسراء : 51 \\] وإذا كان الذي دعاهم إلى ذلك ثبوت أنهم قالوا هذه المقالة قبل نزول هذه الآية وشيوع ذلك كان لتأويل المستقبل بالماضي وجه وجيه ، وكان فيه تأييد لما أسلفناه في تفسير قوله تعالى : { ولله المشرق والمغرب } \\[ البقرة : 115 \\] وقوله : { ولن ترضى عنك اليهود ولا النصارى } \\[ البقرة : 120 \\] .والسفهاء جمع سفيه الذي هو صفة مشبهة من سفه بضم الفاء إذا صار السفه له سجية وتقدم القول في السفه عند قوله تعالى : { ومن يرغب عن ملة إبراهيم إلا من سفه نفسه } \\[ البقرة : 130 \\] وفائدة وصفهم بأنهم من الناس مع كونه معلوماً هو التنبيه على بلوغهم الحد الأقصى من السفاهة بحيث لا يوجد في الناس سفهاء غير هؤلاء فإذا قسم نوع الإنسان أصنافاً كان هؤلاء صنف السفهاء فيفهم أنه لا سفيه غيرهم على وجه المبالغة ، والمعنى أن كل من صدر منه هذا القول هو سفيه سواء كان القائل اليهود أو المشركين من أهل مكة .وضمير الجمع في قوله : { ما ولاهم } عائد إلى معلوم من المقام غير مذكور في اللفظ حكاية لقول السفهاء ، وهم يريدون بالضمير أو بما يعبر عنه في كلامهم أنه عائد على المسلمين .وفعل ( ولاهم ) أصله مضاعف ولي إذا دنا وقرب ، فحقه أن يتعدى إلى مفعول واحد بسبب التضعيف فيقال ولاه من كذا أي قربه منه وولاه عن كذا أي صرفه عنه ومنه قوله تعالى هنا { ما ولاهم عن قبلتهم } ، وشاع استعماله في الكلام فكثر أن يحذفوا حرف الجر الذي يعديه إلى متعلق ثان فبذلك عدوه إلى مفعول ثان كثيراً على التوسع فقالوا ولى فلاناً وجهه مثلاً دون أن يقولوا ولَّى فلان وجهه من فلان أو عن فلان فأشبه أفعال كسا وأعطى ولذلك لم يعبأوا بتقديم أحد المفعولين على الآخر قال تعالى : { فلا تولوهم الأدبار } \\[ الأنفال : 15 \\] أصله فلا تولوا الأدبار منهم ، فالأدبار هو الفاعل في المعنى لأنه لو رُفع لقيل وَلِيَ دُبُرُه الكافرين ، ومنه قوله تعالى : { نوله ما تولى } \\[ النساء : 115 \\] أي نجعله والياً مما تولى أي قريباً له أي ملازماً له فهذا تحقيق تصرفات هذا الفعل .وجملة { ما ولهام } إلخ هي مقول القول فضمائر الجمع كلها عائدة على معاد معلوم من المقام وهم المسلمون ولا يحتمل غير ذلك لئلا يلزم تشتيت الضمائر ومخالفة الظاهر في أصل حكاية الأقوال .والاستفهام في قوله : { ما ولهام } مستعمل في التعريض بالتخطئة واضطراب العقل .والمراد بالقبلة في قوله : { عن قبلتهم } الجهة التي يُوَلَّوُن إليها وجوههم عند الصلاة كما دل عليه السياق وأخبار سبب نزول هذه الآيات .والقبلة في أصل الصيغة اسم على زنة فِعْلة بكسر الفاء وسكون العين ، وهي زنة المصدر الدال على هيئة فعل الاستقبال أي التوجه اشتق على غير قياس بحذف السين والتاء ثم أطلقت على الشي الذي يستقبله المستقبلُ مجازاً وهو المراد هنا لأن الانصراف لا يكون عن الهيئة قال حسان في رثاء أبي بكر رضي الله عنه: ... أَلَيْسَ أَوَّلَ من صلَى لقبلتكموالأظهر عندي أن تكون القبلة اسم مفعول على وزن فِعْل كالذِّبح والطِّحْن وتأنيثه باعتبار الجهة كما قالوا : ما له في هذا الأمر قِبْلَة ولا دِبْرَة أي وِجهة .وإضافة القبلة إلى ضمير المسلمين للدلالة على مزيد اختصاصها بهم إذ لم يستقبلها غيرهم من الأمم لأن المشركين لم يكونوا من المصلين وأهل الكتاب لم يكونوا يستقبلون في صلاتهم ، وهذا مما يعضد حمل «السفهآء» على المشركين إذ لو أريد بهم اليهود لقيل عن قبلتنا إذ لا يرضون أن يضيفوا تلك القبلة إلى المسلمين ، ومن فسر «السفهآء» باليهود ونسب إليهم استقبال بيت المقدس حَمَل الإضافة على أدنى ملابسة لأن المسلمين استقبلوا تلك القبلة مدة سنةٍ وأشهرٍ فصارت قبلة لهم .وضمير الجمع في قوله : { ما ولهام } عائد إلى معلوم من المقام غير مذكور اللفظ حكاية لقول السفهاء وهم يريدون بالضمير أو بمساويه في كلامهم عودهُ على المسلمين .وقوله : { التي كانوا عليها } أي كانوا ملازمين لها فعَلَى هنا للتمكن المجازي وهو شدة الملازمة مثل وقوله : { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] ، وفيه زيادة توجيه للإنكار والاستغراب أي كيف عدلوا عنها بعد أن لارموها ولم يكن استقبالهم إياها مجرد صدفة فإنهم استقبلوا الكعبة ثلاث عشرة سنة قبل الهجرة .واعلم أن اليهود يستقبلون بيت المقدس وليس هذا الاستقبال من أصل دينهم لأن بيت المقدس إنما بني بعد موسى عليه السلام بناه سليمان عليه السلام ، فلا تجد في أسفار «التوراة» الخمسة ذكراً لاستقبال جهة معينة في عبادة الله تعالى والصلاة والدعاء ، ولكن سليمان عليه السلام هو الذي سنّ استقبال بيت المقدس ففي سفر الملوك الأول أن سليمان لما أتم بناء بيت المقدس جمع شيوخ إسرائيل وجمهورهم ووقف أمام المذبح في بيت المقدس وبسط يديه ودعا الله دعاء جاء فيه : \" إذا انكسر شعبُ إسرائيل أمام العدو ثم رجعوا واعترفوا وصلوا نحو هذا البيت فأرجعهم إلى الأرض التي أعطيت لآبائهم وإذا خرج الشعب لمحاربة العدو وصلَّوا إلى الرب نحو المدينة التي اخترتَها والبيتتِ الذي بنيتُه لاسمك فاسمعْ صلاتهم وتضرعهم \" إلخ ، وذكر بعد ذلك أن الله تجلّى لسليمان وقال له \" قد سمعتُ صلاتك وتضرعك الذي تضرعتَ به أمامي \"وهذا لا يدل على أن استقبال بيت المقدس شرط في الصلاة في دين اليهود وقصاراه الدلالة على أن التوجه نحو بيت المقدس بالصلاة والدعاء هيئة فاضلة ، فلعل بني إسرائيل التزموه لا سيما بعد خروجهم من بيت المقدس أو أن أنبياءهم الموجودين بعد خروجهم أمروهم بذلك بوحي من الله .وقد قال ابن عباس ومجاهد : كان اليهود يظنون أن موافقة الرسول لهم في القبلة ربما تدعوه إلى أن يصير موافقاً لهم بالكلية ، وجرى كلام ابن العربي في «أحكام القرآن» على الجزم بأن اليهود كانوا يستقبلون بيت المقدس بناء على كلام ابن عباس ومجاهد ، ولم يثبت هذا من دين اليهود ، كما علمت ، وذكر الفخر عن أبي مسلم ما فيه أن اليهود كانوا يستقبلون جهةَ المغرببِ وأن النصارى يستقبلون المشرق ، وقد علمت آنفاً أن اليهود لم تكن لهم في صلاتهم جهة معينة يستقبلونها وأنهم كانوا يتيمنون في دعائهم بالتوجه إلى صوب بيت المقدس على اختلاف موقع جهته من البلاد التي هم بها فليس لهم جهة معينة من جهات مطلع الشمس ومغربها وما بينهما فلما تقرر ذلك عادة عندهم توهموه من الدين وتعجبوا من مخالفة المسلمين في ذلك . وأما النصارى فإنهم لم يقع في إنجيلهم تغيير لما كان عليه اليهود في أمر الاستقبال في الصلاة ولا تعيين جهة معينة ولكنهم لما وجدوا الروم يجعلون أبواب هياكلهم مستقبلة لمشرق الشمس بحيث تدخل أشعة الشمس عند طلوعها من باب الهيكل وتقع على الصَّنم صاحب الهيكل الموضوع في منتهى الهيكل عكسوا ذلك فجعلوا أبواب الكنائس إلى الغرب وبذلك يكون المذبح إلى الغرب والمصلون مستقبلين الشرق ، وذكر الخفاجي أن بولس هو الذي أمرهم بذلك ، فهذه حالة النصارى في وقت نزول الآية ثم إن النصارى من العصور الوسطى إلى الآن توسعوا فتركوا استقبال جهة معينة فلذلك تكون كنائسهم مختلفة الاتجاه وكذلك المذابح المتعددة في الكنيسة الواحدة .وأما استقبال الكعبة في الحنيفية فالظاهر أن إبراهيم عليه السلام لما بنى الكعبة استقبلها عند الدعاء وعند الصلاة وأنه بناها للصلاة حولها فإن داخلها لا يسع الجماهير من الناس وإذا كان بناؤها للصلاة حولها فهي أول قبلة وُضعت للمصلي تجاهها وبذلك اشتهرت عند العرب ويدل عليه قول زيد بن عَمرو بن نفيل: ... عذت بما عاذ به إبراهمْمستقبل المعبة وهو قائم ... أما توجهه إلى جهتها من بلد بعيد عنها فلا دليل على وقوعه فيكون الأمر بالتزام الاستقبال في الصلاة من خصائص هذه الشريعة ومن جملة معاني إكمال الدين بها كما سنبينه .وقد دلت هذه الآية على أن المسلمين كانوا يستقبلون جهة ثم تحولوا عنها إلى جهة أخرى وليست التي تحول إليها المسلمون إلاّ جهة الكعبة فدل على أنهم كانوا يستقبلون بيت المقدس وبذلك جاءت الآثار .والأحاديثُ الصحيحة في هذا ثلاثة ، أولها وأصحها حديث «الموطأ» عن ابن دينار عن ابن عمر \" بينما الناس في صلاة الصبح بقباء إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة ( قرآن ) وقد أمر أن يستقبل الكعبة فاستقبِلوها وكانت وجوههم إلى الشام فاستداروا إلى الكعبة \" ورواه أيضاً البخاري من طريق مالك ، ومسلم من طريق مالك ومن طريق عبد العزيز بن مسلم وموسى بن عقبة ، وفيه أن نزول آية تحويل القبلة كان قبل صلاة الصبح وأنه لم يكن في أثناء الصلاة وأنه صلى الصبح للكعبة وهذا الحديث هو أصل الباب وهو فصل الخطاب .ثانيها : حديث مسلم عن أنس بن مالك وفيه \" فمر رجل من بني سلمة وهم ركوع في صلاة الفجر وقد صلوا ركعة فنادى ألا إن القبلة قد حُوِّلت فمالوا كما هم نحو القبلة \" .الثالث حديث البخاري ومسلم واللفظ للبخاري في كتاب التفسير عن البراء بن عازب قال كان رسول الله صلى الله عليه وسلم صلى نحو بيت المقدس ستة عشر شهراً أو سبعة عشر شهراً ، وكان رسول الله يحب أن يوجه إلى الكعبة فأنزل الله تعالى { قد نرى تقلب وجهك في السماء } \\[ البقرة : 144 \\] فتوجه نحو الكعبة ثم قال فصلى مع النبي رجل ثم خرج بعد ما صلى فمر على قوم من الأنصار في صلاة العصر يصلون نحو بيت المقدس فقال : هو يشهد أنه صلى مع رسول الله وأنه توجه نحو الكعبة فتحرف القوم حتى توجهوا نحو الكعبة ، وحمل ذكر صلاة الصبح في روايتي ابن عمر وأنس بن مالك وذكر صلاة العصر في رواية البراء كلٌّ على أهل مكان مخصوص ، وهنالك آثار أخرى تخالف هذه لم يصح سندها ذكرها القرطبي . فتحويل القبلة كان في رجب سنة اثنتين من الهجرة قبل بدر بشهرين وقيل يوم الثلاثاء نصف شعبان منها .واختلفوا في أن استقباله صلى الله عليه وسلم بيت المقدس هل كان قبل الهجرة أو بعدها؟ فالجمهور على أنه لما فرضت عليه الصلاة بمكة كان يستقبل الكعبة فلما قدم المدينة استقبل بيت المقدس تألُّفاً لليهود قاله بعضهم وهو ضعيف ، وقيل كان يستقبل بيت المقدس وهو في مكان يجعل الكعبة أمامه من جهة الشرق فيكون مستقبلاً الكعبة وبيت المقدس معاً ، ولم يصح هذا القول .واختلفوا هل كان استقبال بيت المقدس بأمر من الله؟ فقال ابن عباس والجمهور أوجبه الله عليه بوحي ثم نسخه باستقبال الكعبة ودليلهم قوله تعالى : { وما جعلنا القبلة التي كنت عليها } \\[ البقرة : 143 \\] الآية ، وقال الطبري كان مخيراً بين الكعبة وبيت المقدس واختار بيت المقدس استئلافاً لليهود ، وقال الحسن وعكرمة وأبو العالية : كان ذلك عن اجتهاد من النبي صلى الله عليه وسلم وعلى هذا القول يكون قوله تعالى :{ فلنولينك قبلة ترضاها } \\[ البقرة : 144 \\] دالاً على أنه اجتهد فرأى أن يتبع قبلة الدينين اللذين قبله ومع ذلك كان يود أن يأمره الله باستقبال الكعبة ، فلما غيرت القبلة قال السفهاء وهم اليهود أو المنافقون على اختلاف الروايات المتقدمة وقيل كفار قريش قالوا اشتاق محمد إلى بلده وعن قريب يرجع إلى دينكم ذكره الزجاج ونسب إلى البراء بن عازب وابن عباس والحسن ، وروى القرطبي أن أول من صلى نحو الكعبة من المسلمين أبو سعيد بن المعلى وفي الحديث ضعف .وقوله : { قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم } جواب قاطع معناه أن الجهات كلها سواء في أنها مواقع لبعض المخلوقات المعظمة فالجهات ملك لله تبعاً للأشياء الواقعة فيها المملوكة له ، وليست مستحقة للتوجه والاستقبال استحقاقاً ذاتياً . وذكر المشرق والمغرب مراد به تعميم الجهات كما تقدم عند قوله تعالى : { ولله المشرق والمغرب } \\[ البقرة : 115 \\] ، ويجوز أن يكون المراد من المشرق والمغرب الكناية عن الأرض كلها لأن اصطلاح الناس أنهم يقسمون الأرض إلى جهتين شرقية وغربية بحسب مطلع الشمس ومغربها ، والمقصود أن ليس لبعض الجهات اختصاص بقرب من الله تعالى لأنه منزه عن الجهة وإنما يكون أمره باستقبال بعض الجهات لحكمة يريدها كالتيمن أو التذكر فلا بدع في التولي لجهة دون أخرى حسب ما يأمر به الله تعالى ، فقوله تعالى : { قل لله المشرق والمغرب } ، إشارة إلى وجه صحة التولية إلى الكعبة وقوله : { يهدي من يشاء } إشارة إلى وجه ترجيح التولية إلى الكعبة على التولية إلى غيرها لأن قوله : { يهدي من يشاء } تعريض بأن الذي أمر الله به المسلمين هو الهدى دون قبلة اليهود إلاّ أن هذا التعريض جيء به على طريقة الكلام المنصف من حيث ما في قوله { من يشاء } من الإجمال الذي يبينه المقام فإن المهدي من فريقين كانا في حالة واحدة هو الفريق الذي أمره من بيده الهدى بالعدول عن الحالة التي شاركه فيها الفريق الآخر إلى حالة اختص هو بها ، فهذه الآية بهذا المعنى فيها إشارة إلى ترجيح أحد المعنيين من الكلام الموجه أقوى من آية : { وإنا أو إياكم لعلى هدى أو في ضلال مبين } \\[ سبأ : 24 \\] .وقد سلك في هذا الجواب لهم طريق الإعراض والتبكيت لأن إنكارهم كان عن عناد لا عن طلب الحق فأجيبوا بما لا يدفع عنهم الحيرة ولم تبين لهم حكمة تحويل القبلة ولا أحقية الكعبة بالاستقبال وذلك ما يعلمه المؤمنون .فأما إذا جرينا على قول الذين نسبوا إلى اليهود استقبال جهة المغرب وإلى النصارى استقبال جهة المشرق من المفسرين فيأتي على تفسيرهم أن تقول إن ذكر المشرق والمغرب إشارة إلى قبلة النصارى وقبلة اليهود ، فيكون الجواب جواباً بالإعراض عن ترجيح قبلة المسلمين لعدم جدواه هنا ، أو يكون قوله : { يهدي من يشاء إلى صراط مستقيم } إيماء إلى قبلة الإسلام ، والمراد بالصراط المستقيم هنا وسيلة الخير وما يوصل إليه كما تقدم في قوله تعالى :{ اهدنا الصراط المستقيم } \\[ الفاتحة : 6 \\] فيشمل ذلك كل هَدْي إلى خير ومنه الهدى إلى استقبال أفضل جهة . فجملة : { يهدي من يشاء } حال من اسم الجلالة ولا يحسن جعلها بدل اشتمال من جملة : { لله المشرق والمغرب } لعدم وضوح اشتمال جملة : قل لله المشرق والمغرب على معنى جملة : { يهدي من يشاء } إذ مفاد الأولى أن الأرض جميعها لله أي فلا تتفاضل الجهات ومفاد الثانية أن الهدى بيد الله .واتفق علماء الإسلام على أن استقبال الكعبة أي التوجه إليها شرط من شروط صحة الصلاة المفروضة والنافلةِ إلاّ لضرورة في الفريضة كالقتال والمريض لا يجد من يوجهه إلى جهة القبلة أو لرخصة في النافلة للمسافر إذا كان راكباً على دابة أو في سفينة لا يستقر بها . فأما الذي هو في المسجد الحرام ففرض عليه استقبال عين الكعبة من أحد جوانبها ومن كان بمكة في موضع يعاين منه الكعبة فعليه التوجه إلى جهة الكعبة التي يعاينها فإذا طال الصف من أحد جوانب الكعبة وجب على من كان من أهل الصف غيرَ مقابل لركن من أركان الكعبة أن يستدير بحيث يصلون دائرين بالكعبة صفاً وراء صف بالاستدارة ، وأما الذي تَغيب ذات الكعبة عن بصره فعليه الاجتهاد بأن يتوخى أن يستقبل جهتها فمن العلماء من قال يتوخَّى المصلي جهةَ مصادفة عين الكعبة بحيث لو فُرض خط بينه وبين الكعبة لوجَدَ وجهه قُبالة جدارها ، وهذا شاق يعسر تحققه إلاّ بطريق أرصاد علم الهيئة ويعبر عن هذا باستقبال العين وباستقبال السمت وهذا قول ابن القصار واختاره أحد أشياخ أبي الطيب عبد المنعم الكندي ونقله المالكية عن الشافعي ، ومن العلماء من قال يتوخى المصلى أن يستقبل جهةً أقرب ما بينه وبين الكعبة بحيث لو مشى باستقامة لوصل حول الكعبة ويعبر عن هذا باستقبال الجهة أي جهة الكعبة وهذا قول أكثر المالكية واختاره الأبهري والباجي وهو قول أبي حنيفة وأحمد بن حنبل وهو من التيسير ورفع الحرج ، ومن كان بالمدينة يستدل بموضع صلاة النبي صلى الله عليه وسلم في مسجده لأن الله أذن لرسوله بالصلاة فيه ، وروى ابن القاسم عن مالك أن جبريل هو الذي أقام للنبيء صلى الله عليه وسلم قِبلة مسجده .وبين المازري معنى المسامتة بأن يكون جزء من سطح وجه المصلي وجزء من سمت الكعبة طرفي خط مستقيم وذلك ممكن بكون صف المصلين كالخط المستقيم الواصل بين طرفي خطين متباعدين خرجا من المركز إلى المحيط في جهته لأن كل نقطة منه ممر لخارج من المركز إلى المحيط ا ه ، واستبعد عز الدين بن عبد السلام هذا الكلام بأن تكليف البعيد استقبال عين البيت لا يطاق ، وبإجماعهم على صحة ذوي صفَ مائةِ ذراع وعَرضُ البيت خمسة أذرع فبعض هذا الصف خارج عن سمت البيت قطعاً ووافقه القرافي ثم أجاب بأن البيت لمستقبليه كمركز دائرة لمحيطها والخطوط الخارجة من مركز لمحيطه كلما قربت منه اتسعت ولا سيما في البعد .فإذا طالت الصفوف فلا حرج عليهم لأنهم إنما يجب عليهم أن يكونوا متوجهين نحو الجهة التي يعبرون عنها بأنها قبلة الصلاة .ومن أخطأ القبلة أو نسي الاستقبال حتى فرغ من صلاته لا يجب عليه إعادة صلاته عند مالك وأبي حنيفة وأحمد إلاّ أن مالكاً استحب له أن يعيدها ما لم يخرج الوقت ولم ير ذلك أبو حنيفة وأحمد وهذا بناء على أن فرض المكلف هو الاجتهاد في استقبال الجهة وأما الشافعي فأوجب عليه الإعادة أبداً بناء على أنه يرى أن فرض المكلف هو إصابة سمت الكعبة .\n\n",
      "translations": [
        {
          "translation": "(The foolish of the people) the ignorant among the Jews and Arab idolaters (will say: What hath turned them) made them change (from the Qiblah which they formerly observed) except that they want to revert to the religion of their ancestors; it is also said that this means: there was no reason to turn from the direction in which they prayed, i.e. Jerusalem? (Say) Muhammad! (unto Allah belong the East) praying to the Ka'bah (and the West) the prayer that you prayed in the direction of Jerusalem-both are with Allah's command. (He guideth whom He will unto a straight path) He confirms whom He wills on a straight Religion and direction of prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ سيقول السفَهَاء من الناس } سمّاهم سفهاء خفاف العقول، لعدم وفاء عقولهم بإدراك حقيقة دين الإسلام وقضائها على ما عرفت بحق مذهبها ووقوفها به، ولذلك كانت محاجتهم في الله مع اتفاقهم في التوحيد واختصاص المسلمين بالإخلاص، إذ لو أدركوا الحق لأدركوا إخلاصهم فلم تبق محاجتهم معهم. ولو كانت عقولهم رزينة لاستدلت بالآيات وأدركت في كل دين ومذهب حقه، وفرّقت بين ذلك الدين الحق الذي هو كالروح لذلك، وبين باطل أهله الذي اختلط به ولبسه خاصة دين الإسلام، فإن كله حق، بل هو حق الحقوق ولذلك جعلوا أمّة وسطاً أي: عدلاً بين الأمم، فضلاء شهداء عليهم. { ما ولاّهُم عن قبلتهم التي كانوا عليها } لأنهم كانوا مقيدين بالجهة فلم يقبلوا إلا مقيداً ولم يعرفوا التوحيد الوافي بالجهات كلها { قل لله المَشرق والمَغرب } على ما مرّ من التأويلين { يهدي من يشاء إلى صراطٍ مستقيمٍ } أي: طريق الوحدة التي تتساوى الجهات بالنسبة إليها لكون الحق المتوجه إليه لا في جهة، وكون الجهات كلها فيه وبه وله، كما قال تعالى:\n[البقرة، الآية: 115].",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كان الغالب على رسول الله صلى الله عليه وسلم في أوائل حاله وسلوكه\n توحيد الصفات والأفعال المورثين له عن آبائه - صلوات الله عليهم - كان تابعاً لهم في قبلتهم التي كانوا عليها أيضاً صورة\n وحين ظهر وانكشف له صلى الله عليه وسلم توحيد الذات\n وغلبت عليه تجلياتها وإشراقها استغرق ووله\n بل فني واضمحل وتلاشت فيها هويته\n وبعدما تنزل عن ولهه واستغراقه\n خص له سبحانه قبلة مخصوصة\n ووجهة معينة صورة\n لتكون آية على قبلته الحقيقية المعنوية\n\n\nثم لما أمره سبحانه بتوجهها واستقبالها وهو في الصلاة إلى القبلة التيكان عليها قبل الأمر وتحول نحوها فيها\n أخذ المنافقون في الغيبة\n واشتغلوا بالنفاق\n ونسبوه إلى ما هو منزه عنه\n وانتهزوا واغتنموا الفرصة لمقابلته وصمموا العزم بمجادلته\n أراد سبحانه أن ينبه بما هم عليه من النفاق والشقاق في أمر القبلة على وجه الإخبار\n فقال: { سَيَقُولُ ٱلسُّفَهَآءُ } المعزولون عن مقتضى العقل الخيري\n المتشعب من العقل الكلي\n المتفرع على اسم العليم: { مِنَ ٱلنَّاسِ } المحجوبين بظلمة التعينات عن نور الوجود قولاً ناشئاً عن محض الغفلة والسفاهة على سبيل الاستهزاء\n وهو قولهم: { مَا وَلَّٰهُمْ } حوَّلهم وصرفهم\n أي: المؤمنين { عَن قِبْلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيْهَا } ومن قبل مع أنها قبلة من يدعون الانتساب إليهم والاقتداء بملتهم؟\n\n{ قُل } لهم يا أكمل الرسل على وجه التنبيه والإرشاد وبلسان التوحيد الذاتي بعدما انكشف لك: { للَّهِ } المنزله عن الأماكن والجهات المتجلي فيها { ٱلْمَشْرِقُ وَٱلْمَغْرِبُ } أي: جميع ما يتوهم من الزمان والمكان والجهة\n إنما هي مظاهر ذاته ومجالي أسمائه وصفاته { يَهْدِي } بحبه الذاتي { مَن يَشَآءُ } من عباده المتوجهين إلى جنابه { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [البقرة: 142] موصلٍ إلى ذاته من أي مكان كان\n وفي أي وجهة وزمانٍ\n إذ هو محيط بكلها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { سيقول السفهاء من الناس } الذين لا عقل لهم ولا دين، حين تحول القبلة من بيت المقدس إلى الكعبة: ما صرفهم { عن قبلتهم التي كانوا عليها } ، فلو دام عليها لاتبعناه. { قل } لهم يا محمد: { لله المشرق والمغرب } لا يختص ملكه بمكان دون مكان بخاصية ذاتيه تمنع من إقامة غيره مقامه، بل الأماكن عند الله سواء: والخلق في حقه سواء، { يهدي من يشاء إلى صراط مستقيم } ، ويضل مَن يشاء عن المنهاج القويم\n \" لاَ يُسْئَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْئَلُونَ \" \n[الأنبيَاء: 23]، والصراط المستقيم: ما ترتضيه الحكمة وتقتضيه المصلحة من التوجه إلى بيت المقدس تارة، والكعبة أخرى، وفائدة تقديم الإخبار به: توطين النفس وإعداد الجواب. قاله البيضاوي. قال بعض العارفين: لي أربعون سنة ما أقامني الحق في شيء فكرهته، ولا نقلني إلى غيره فسخطته. بخلاف السفهاء من الجهال، فشأنهم الإنكار عند اختلاف الأحوال، فمن رأوه تجرد عن الأسباب وانقطع إلى الكريم الوهاب، قالوا: ما ولاَّه عن حاله الذي كان عليه؟ وأكثروا من الاعتراض والانتقاد عليه، وكذلك من رأوه رجع إلى الأسباب بعد الكمال، قالوا: قد انحط عن مراتب الرجال. وهو إنما زاد في مراتب الكمال. فالملك كله لله، يهدي مَن يشاء إلى الصراط مستقيم، ويضلّ مَن يشاء بعدله الحكيم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:17",
      "similarity": 0.5958520761180112
    },
    {
      "verse": "26:28",
      "similarity": 0.570221824530234
    },
    {
      "verse": "73:9",
      "similarity": 0.564466977059076
    },
    {
      "verse": "70:40",
      "similarity": 0.5389686015234237
    },
    {
      "verse": "7:67",
      "similarity": 0.5058343649595625
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002142.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002142.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:142.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}