{
  "chapter": "البقرة",
  "text": "ولئن اتيت الذين اوتوا۟ الكتب بكل ءاية ما تبعوا۟ قبلتك وما انت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت اهواءهم منۢ بعد ما جاءك من العلم انك اذا لمن الظلمين",
  "translations": [
    {
      "translation": "If you were to bring every Sign to those given the Book, they still would not follow your direction. You do not follow their direction. They do not follow each other's direction. If you followed their whims and desires, after the knowledge that has come to you, you would then be one of the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even though you bring all the proof to the people of the Book they will not face the direction you turn to, nor you theirs, nor will they follow each other's direction. And if you follow their whims after all the knowledge that has reached you, then surely you will be among transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even though you may show every kind of sign to the people of the Book, they will not adopt your giblah, nor are you going to adopt their giblah; nor will any of them adopt the giblah of the other; therefore if, after the knowledge you have received, you follow their desires, you will certainly be counted among the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you were to bring all kinds of authoritative proof to the People of the Book, they still would not accept your qibla, nor would you accept theirs, nor would they accept each others. Were you to follow their desires after all the knowledge that has come to you, you would certainly have been one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you were to bring all the signs to the People given the Book(s), they would not follow your qiblah; nor should you follow their qiblah; nor do they follow each others qiblah; and were you (the followers of this Prophet) to follow their desires after having received knowledge, you would then surely be unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you were to bring to the People of the Scripture (Jews and Christians) all the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they would not follow your Qiblah (prayer direction), nor are you going to follow their Qiblah. And they will not follow each other's Qiblah. Verily, if you follow their desires after that which you have received of knowledge (from Allah), then indeed you will be one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you bring to those who have been given the Book every sign they would not follow your qiblah, nor can you be a follower of their qiblah, neither are they the followers of each other's qiblah, and if you follow their desires after the knowledge that has come to you, then you shall most surely be among the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if thou shouldst bring to those that have been given the Book every sign, they will not follow thy direction; thou art not a follower of their direction, neither are they followers of one another's direction. If thou followest their caprices, after the knowledge that has come to thee, then thou wilt surely be among the evildoers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if thou broughtest unto those who have received the Scripture all kinds of portents, they would not follow thy qiblah, nor canst thou be a follower of their qiblah; nor are some of them followers of the qiblah of others. And if thou shouldst follow their desires after the knowledge which hath come unto thee, then surely wert thou of the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But even if you should produce every kind of sign for those who have been given the Book, they would never accept your prayer direction, nor would you accept their prayer direction: nor would any of them accept one another's direction. If, after all the knowledge you have been given, you yield to their desires, then, you shall surely become a transgressor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And shouldst thou bring unto those who are vouchsafed the Book every sign, they would not follow thy Qiblah, neither art thou to be a follower of their Qiblah; nor doth one part of them follow the Qiblah of the other. And shouldst thou follow their desires, after that which hath come unto thee of the knowledge, then verily thou wilt become one of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you bring those who were given the Book every [kind of] sign, they will not follow your qiblah. Nor shall you follow their qiblah, nor will any of them follow the qiblah of the other. And if you follow their desires, after the knowledge that has come to you, you will be one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if thou wert to bring to the people of the Book all the Signs (together), they would not follow Thy Qibla; nor art thou going to follow their Qibla; nor indeed will they follow each other's Qibla. If thou after the knowledge hath reached thee, Wert to follow their (vain) desires,-then wert thou Indeed (clearly) in the wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you were to bring to the people of the Scripture (Jews and Christians) all the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they would not follow your Qiblah (prayer direction), nor are you going to follow their Qiblah (prayer direction). And they will not follow each other's Qiblah (prayer direction). Verily, if you follow their desires after that which you have received of knowledge (from Allah), then indeed you will be one of the Zalimun (polytheists, wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But even if you brought those to whom the Book had been given every proof, they would not accept your direction, nor would you accept theirs; nor would any of them accept the direction of the other. If after all the knowledge you have been given you yield to their desires, then you will surely be among the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you were to bring to those who were given the Book every proof, they would not follow your direction, nor are you to follow their direction, nor do they follow the direction of one another. And if you were to follow their desires, after the knowledge that has come to you, you would be in that case one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you brought to those who were given the Scripture every sign, they would not follow your qiblah. Nor will you be a follower of their qiblah. Nor would they be followers of one another's qiblah. So if you were to follow their desires after what has come to you of knowledge, indeed, you would then be among the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:145] Yet if (wa-la-in: the lām is for oaths) you should bring to those who have been given the Scripture every sign, about your truthfulness in the matter of the direction of prayer, they will not follow your direction, out of obduracy, and you are not a follower of their direction (this is a categorical negation of his [the Prophet’s] desire that they become Muslims and of their desire that he return to their direction of prayer; neither are they, the Jews and the Christians, followers of one another’s direction. If you were to follow their whims, the ones to which they summon you, after the knowledge, the revelation, that has come to you, then you, if, hypothetically, you were to follow them, will surely be among the evildoers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ولئن أتيتَ } عطف على قوله : { وإن الذين أوتوا الكتاب ليعلمون } \\[ البقرة : 144 \\] ، والمناسبة أنهم يعلمون ولا يعملون فلما أفيد أنهم يعلَمون أنه الحق على الوجه المتقدم في إفادته التعريض بأنهم مكابرون ناسبت أن يحقق نفي الطَّمع في اتِّباعهم القِبْلَة لدفع توهم أن يَطْمع السامع باتباعهم لأنهم يعلمون أحقيتها ، فلذا أكدت الجملة الدالة على نفي اتِّباعهم بالقَسَم واللام الموطئة ، وبالتعليق على أقصى ما يمكن عادةً .والمراد بالذين أوتوا الكتاب عين المراد من قوله : { وإن الذين أوتوا الكتاب ليعلمون } على ما تقدم فإن ما يفعله أحْبارهم يكون قدوة لعامتهم فإذا لم يتبع أحبارهم قبلة الإسلام فأجْدَرُ بعامتهم أن لا يتبعوها .ووجه الإظهار في مقام الإضمار هنا الإعلان بمذمتهم حتى تكون هذه الجملة صريحة في تناولهم كما هو الشأن في الإظهار في موقع الإضمار أن يكون المقصود منه زيادة العناية والتمكن في الذهن .والمرادُ { بكل آية } آيات متكاثرة والمراد بالآية الحجة والدليل على أن استقبال الكعبة هو قبلة الحنيفِية . وإطلاق لفظ ( كل ) على الكثرة شائع في كلام العرب قال امرؤ القيس :فيالكَ من ليللٍ كأنَّ نُجُومَه ... بكل مُغَار الفَتْل شُدَّت بيذبُلوأصله مجاز لجعل الكثير من أفراد شيء مشابهاً لمجموع عموم أفراده ، ثم كثر ذلك حتى ساوى الحقيقة فصار معنى من معاني كل لا يحتاج استعماله إلى قرينة ولا إلى اعتبار تشبيه العدد الكثير من أفراد الجنس بعموم جميع أفراده حتى إنه يَرِد فيما لا يتصور فيه عموم أفراد ، مثل قوله هنا { بكل آية } فإن الآيات لا يتصور لها عدد يُحاط به ، ومثله قوله تعالى : { ثم كلي من كل الثمرات } \\[ النحل : 69 \\] وقوله : { إن الذين حقت عليهم كلمت ربك لا يؤمنون } \\[ يونس : 96 \\] وقال النابغة :بها كُلُّ ذُيَّاللٍ وخَنْسَاءَ تَرْعَوِى ... إلى كُلِّ رَجاففٍ من الرمل فاردوتكرر هذا ثلاث مرات في قول عنترة: ... جادت عليه كل بِكْر حُرَّةفتَرَكْنَ كُلَّ قرارةٍ كالدِّرهَم ... سَحَّاً وتَسْكَاباً فكُلَّ عَشِيَّةٍيجري إليها الماء لم يتَصَرَّم ... وصاحب «القاموس» قال في مادة كل «وقد جاء استعمال كل بمعنى بَعْضضٍ ضدٌّ» فأثبت الخروج عن معنى الإحاطة ولكنه جازف في قوله «بمعنى بعضٍ» وكان الأصوبُ أن يقول بمعنى كَثيرٍ .والمعنى أن إنكارهم أَحَقِّيَّة الكعبة بالاستقبال ليس عن شبهة حتى تُزيله الحجة ولكنه مكابرة وعناد فلا جدوى في إطناب الاحتجاج عليهم .وإضافة قبلة إلى ضمير الرسول لأنها أخص به لكونها قِبلة شرعِه ، ولأنه سأَلها بلسان الحال .وإفراد القبلة في قوله : { وما أنت بتابع قبلتهم } مع كونهما قبلتين ، إن كان لكل من أهل الكتاب قبلة معينة ، وأكثرَ من قِبلة إن لم تكن لهم قبلةٌ معينة وكانوا مخيَّرين في استقبال الجهات ، فإفراد لفظ ( قبلتهم ) على معنى التوزيع لأنه إذا اتَّبع قبلة إحدى الطائفتين كان غير متبع قبلة الطائفة الأخرى .والمقصود من قوله : { ما تبعوا قبلتك } إظهارُ مكابرتهم تأْييساً من إيمانهم ، ومِنْ قوله : { وما أنت بتابع قبلتهم } تنزيهُ النبي وتعريضٌ لهم باليأس من رجوع المؤمنين إلى استقبال بيت المقدس ، وفي قوله : { وما بعضهم بتابع قبلة بعض } تأنيسٌ لِلنبيء بأنَّ هذا دأبهم وشنشنتهم من الخلاف فقديماً خالف بعضهم بعضاً في قبلتهم حتى خالفت النصارى قبلة اليهود مع أن شريعة اليهود هي أصل النصرانية .وجملة : { ولئن اتبعت أهواءهم } معطوفة على جملة : { وما أنت بتابع قبلتهم } وما بينهما اعتراض . وفائدة هذا العطف بعد الإخبار بأنه لا يتبع قبلتهم زيادة تأكيد الأمر باستقبال الكعبة ، والتحذير من التهاون في ذلك بحيث يفرض على وجه الاحتمال أنه لو اتبع أهواء أهل الكتاب في ذلك لكان كذا وكذا ، ولذلك كان الموقع لإن لأنَّ لها مواقعَ الشك والفرض في وقوع الشرط .وقوله : { من العلم } بيان لما جاءك أي من بعد الذي جاءك والذي هو العلم فجعل ما أنْزِل إليه هو العلم كلَّه على وجه المبالغة .والأهواء جمع هَوى وهو الحُب البليغ بحيث يقتضي طلبَ حصول الشيء المحبوب ولو بحصول ضر لمحصِّله ، فلذلك غلب إطلاق الهوى على حُبَ لا يقتضيه الرشد ولا العقل ومن ثَمّ أطلق على العشق ، وشاع إطلاق الهوى في القرآن على عقيدة الضلال ومن ثم سَمَّى علماء الإسلام أهلَ العقائد المنحرفة بأهل الأهواء .وقد بولغ في هذا التحذير باشتمال مجموع الشرط والجزاء على عدة مؤكدات أومأ إليها صاحب «الكَشَّاف» وفصَّلها صاحب «الكشف» إلى عشرة وهي : القَسَم المدلول عليه باللام ، واللام الموطئة للقسم لأنها تزيد القسم تأكيداً ، وحرف التوكيد في جملة الجزاء ، ولام الابتداء في خبرها ، واسمية الجملة ، وجَعْل حرففِ الشرط الحرفَ الدال على الشك وهو ( إنْ ) المقتضي أن أقل جُزء من اتِّباع أهوائهم كاففٍ في الظُّلم ، والإتيانُ بإِذَن الدالةِ على الجزائية فإنها أَكَّدَتْ ربطَ الجزاء بالشرط ، والإجمالُ ثم التفصيل في قوله : { ما جاءك من العلم } فإنه يدل على الاهتمام والاهتمامُ بالوازع يَؤُول إلى تحقيق العقاب على الارتكاب لانقطاع العذر ، وجَعْل ما نزل عليه هو نفس العلم .والتعريفُ في { الظالمين } الدالُّ على أنه يكون من المعهودين بهذا الوصف الذين هو لهم سجية . ولا يخفى أن كل ما يَؤُول إلى تحقيق الربط بين الجزاء والشرط أو تحقيق سببه أو تحقيق حصول الجزاء أو تهويل بعض متعلقاته ، كل ذلك يؤكد المقصود من الغرض المسوق لأجله الشرط .والتعبير بالعِلم هنا عن الوحي واليقين الإلهي إعلان بتنويه شأن العلم ولَفت لعقول هذه الأمة إليه لما يتكرر من لفظه على أسماعهم .وقوله : { لمن الظالمين } أقوى دلالةً على الانصاف بالظلم من إنك لَظالم كما تقدم عند قوله : { قال أعوذ بالله أن أكون من الجاهلين }\\[ البقرة : 67 \\] .والمراد بالظالمين الظالمون أنفسهم وللظلم مراتِبُ دخلت كلها تحت هذا الوصف والسامع يعلم إرجاع كل ضَرب من ضروب اتباع أهوائهم إلى ضرب من ضروب ظلم النفس حتى ينتهي إلى عقائدهم الضالة فينتهي ظلمهم أنفسهم إلى الكفر الملقي في خالد العذاب .قد يقول قائل إن قريباً من هذه الجملة تقدم عند قوله تعالى : { قل إن هدى الله هو الهدى ولئن اتبعت أهواءهم بعد الذي جاءك من العلم ما لك من الله من ولي ولا نصير } \\[ البقرة : 120 \\] فعبر هنالك باسم الموصول ( الذي ) وعبر هنا باسم الموصول ( مَا ) ، وقال هنالك «بَعد» وقال هنا «مِنْ بعد» ، وجُعل جزاء الشرط هنالك انتفاء ولِيَ ونصيرٍ ، وجعل الجزاء هنا أن يكون من الظالمين ، وقد أَوْرَد هذا السؤال صاحبُ «دُرَّة التنزيل وغُرَّة التأويل» وحاول إبداء خصوصيات تفرق بين ما اختلفت فيه الآيتان ولم يأت بما يشفي ، والذي يرشد إليه كلامه أن نقول إن ( الذي ) و ( مَا ) وإن كانا مشتركين في أنهما اسما موصول إلاّ أنهما الأصل في الأسماء الموصولة ، ولما كان العلم الذي جاء النبي صلى الله عليه وسلم في غرض الآية الأولى هو العلم المتعلق بأصل ملة الإسلام وببطلان ملة اليهود وملة النصارى بعد النسخ ، وبإثبات عناد الفريقين في صحة رسالة محمد صلى الله عليه وسلم وذلك ابتداء من قوله تعالى : { وقالوا اتخذ الله ولداً سبحانه } \\[ البقرة : 116 \\] إلى قوله { قل إن هدى الله هو الهدى } \\[ البقرة : 120 \\] ، فلا جرم كان العلم الذي جاء في ذلك هو أصرح العلم وأقدمه ، وكان حَقيقاً بأن يعبر عنه باسم الموصول الصريح في التعريف .وأما الآية الثانية التي نحن بصددها فهي متعلقة بإبطال قبلة اليهود والنصارى ، لأنها مسبوقة ببيان ذلك ابتداء من قوله : { سيقول السفهاء من الناس ما ولاهم عن قبلتهم التي كانوا عليها } \\[ البقرة : 142 \\] وذلك تشريع فرعي فالتحذير الواقع بعدهُ تحذير من اتباع الفريقين في أمر القبلة وذلك ليس له أهمية مثلُ ما للتحذير من اتباع ملتهم بأسرها فلم يكن للعلم الذي جاء النبي في أمر قبلتهم من الأهمية ما للعلم الذي جاءه في بطلان أصول ملتهم ، فلذلك جيء في تعريفه باسم الموصول الملحق بالمعارف وهو ( ما ) لأنها في الأصل نكرة موصوفة نقلت للموصولية .وإنما أدخلت ( مِنْ ) في هذه الآية الثانية على ( بْعد ) بقوله : { من بعد ما جاءك من العلم } لأن هذه الآية وقعت بعد الآية الأول في سورة واحدة وليس بينهما بعيد فَصْللٍ فكان العلم الذي جاءه فيها مِن قوله : { ما تبعوا قبلتك } هو جزئي من عموم العلم الذي جاء في إبطال جميع ملتهم ، فكان جديراً بأن يُشار إلى كونه جزئياً له بإيراد ( مِن ) الابتدائية .\n\n",
      "translations": [
        {
          "translation": "(And even if thou broughtest unto those who have received the Scripture all kinds of portents) all the signs they asked of you, (they would not follow your Qiblah) they would not pray towards your Qiblah nor embrace your Religion, (nor canst thou be a follower of their Qiblah) nor can you pray towards the Qiblah of the Jews or Christians; (nor are some of them followers of others) nor are some of them going to pray towards the Qiblah of the Jews and Christians. (And if thou shouldst follow their desires) after being warned and pray towards their Qiblah (after the knowledge which hath come unto you) that the Sacred Precinct is the Qiblah of Abraham, (then surely) if you do that then surely (wert thou of the evil-doers) who harm themselves. 24\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ ولئِنْ أتيتَ الذين أُوتُوا الكتاب بكل آيةٍ } دالة على صحة نبوّتك وحقية قبلتك ولو من كتابهم، أو ما كانت عقلية قطعية { ما تبِعوا قِبلتكَ } لاحتجابهم بدينهم ومعقولهم وتقيدهم به { وما أنت بِتَابع قبلتهم } لعلوك عن رتبة دينهم وترقيك عن مقامهم { وما بعضهم بتابع قبلةَ بعضٍ } لاحتجاب كلّ بدينه وتضادّ وجههم الناشئ من التضادّ المركوز في طباعهم { ولئِن اتّبعت أهواءهم } المتفرّقة { من بعد ما جاءك من } علم التوحيد الجامع إيّاك { إنك إذاً لمن } الناقصين حقك وحقّ مقامك.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله { لَئِنْ أَتَيْتَ } يا أكمل الرسل { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ بِكُلِّ آيَةٍ } نازلة لك دالة على توحيد الذات الذي هو مقصدك وقبلتك { مَّا تَبِعُواْ قِبْلَتَكَ } لانهماكهم في الغفلة والضلالة { وَمَآ أَنتَ } أيضاً بعدما انكشف لك الأمر يقيناً { بِتَابِعٍ قِبْلَتَهُمْ } التي توجهوا إليها ظناً وتخميناً { وَ } أيضاً { مَا بَعْضُهُم بِتَابِعٍ قِبْلَةَ بَعْضٍ } لتفاوت ظنونهم وآرائهم { وَ } الله { لَئِنِ ٱتَّبَعْتَ } أنت يا أكمل الرسل { أَهْوَاءَهُم } الباطلة { مِّن بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ } اليقيني المطابق للعين بل للحق { إِنَّكَ } مع اصطفائنا إياك واجتنابنا لك { إِذَاً لَّمِنَ ٱلظَّالِمِينَ } [البقرة: 145] المعرضين عنا بعد توفيقنا إياك وإرشادنا لك إلى الكعبة الحقيقة\n\n\nهذا تهديد لرسول الله صلى الله عليه وسلم بعد تهديد وحث له صلى الله عليه وسلم لدوام التوجه على ما اكشف له من توحيد الذات\n تحريض للمؤمنين على متابعته صلى الله عليه وسلم في دوام التوجه والميل إليه\n ومثله في القرآن كثير\n\n\nثم قال سبحانه: { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } المبين لهم طريق توحيد الصفات والأفعال\n المنبه لهم على توحيد الذات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أتيت } فعل اشرط\n و { ما تبعوا } جواب القسم المحذوف سد مسد جواب الشرط\n\nقال في الألفية:\nيقول الحقّ جلّ جلاله: { وإن الذين أوتوا الكتاب } من أحبار اليهود { ليعلمون } أن التحول إلى الكعبة حق { من ربهم } لِمَا يجدون في كتابهم أنه يصلي إلى القبلتين\n وأن عادته تعالى تخصيص كل أمة بشريعة\n { وما الله بغافل عما يعملون } من التعنت والعناد\n وإنما يمهلهم ليوم المعاد\n والله لئن أتيتهم بكل حجة وبرهان على صحة التوجه إلى الكعبة { ما تبعوا قبلتك } لأنهم ما تركوا قبلتك لشبهة تُزيلُها الحجة\n وإنما خالفوك مكابرة وعناداً\n وقد طمعوا أن ترجع إلى قبلتهم\n ولست { بتابع قبلتهم } أبداً\n بل لهم قبلتهم صخرة بيت المقدس\n وللنصارى قبلتهم مطلع الشمس\n وليس بعضهم { بتابع قبلة بعض } لتصلب كل حزب بما هو فيه\n وإن كان على خطأ وفساد لأن مفارقة العوائد نا صعب على النفوس إلا من سبقت له العناية\n { ولئن اتبعت أهواءهم } الباطلة وإراءهم الزائفة فَرْضاً وتقديراً { من بعد ما جاءك من العلم } الواضح والوحي الصحيح { إنك إذاً لمن الظالمين } \n لكنك معصوم\n فلا يتصور اتباعك لهم أبداً\n { الدين آتيناهم الكتاب } أي: اليهود { يعرفونه } أي: الرسول - عليه الصلاة والسلام - وإن لم يتقدم ذكره لدلالة الكلام عليه أو القرآن أو التحويل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:29",
      "similarity": 0.5403396637731053
    },
    {
      "verse": "28:50",
      "similarity": 0.4897592113191815
    },
    {
      "verse": "54:3",
      "similarity": 0.48680515229627347
    },
    {
      "verse": "101:9",
      "similarity": 0.47193695866812224
    },
    {
      "verse": "13:37",
      "similarity": 0.46968524838386166
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002145.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002145.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:145.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}