{
  "chapter": "البقرة",
  "text": "كما ارسلنا فيكم رسولا منكم يتلوا۟ عليكم ءايتنا ويزكيكم ويعلمكم الكتب والحكمة ويعلمكم ما لم تكونوا۟ تعلمون",
  "translations": [
    {
      "translation": "For this We sent a Messenger to you from among you to recite Our Signs to you and purify you and teach you the Book and Wisdom and teach you things you did not know before.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as We sent a messenger from among you to convey Our messages to you and cleanse you, and teach you the Book and the wisdom, and what you did not know;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "just as (you have found from this: that) We sent the Messenger to you from among you, who recites to you Our Revelations; who purifies your lives; who instructs you in the Book and in Wisdom and teaches you those things that you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As We have sent a Messenger from your own people to show you evidence about Me, to purify you from sins, to teach you the Book, give you wisdom and instruct you in that which you did not know,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way We have sent to you a Noble Messenger from among you, who recites to you Our verses and purifies you, and teaches you the Book and sound wisdom*, and teaches you what you did not know. (The traditions / sayings of the Holy Prophet – peace and blessings be upon him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly (to complete My blessings on you), We have sent among you a Messenger (Muhammad) of your own, reciting to you Our verses (the Qur'an) and purifying you, and teaching you the Book (the Qur'an) and the Hikmah (i.e., Sunnah, Islamic laws and Fiqh ـ jurisprudence), and teaching you that which you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as We have sent among you an Apostle from among you who recites to you Our communications and purifies you and teaches you the Book and the wisdom and teaches you that which you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as also We have sent among you, of yourselves, a Messenger, to recite Our signs to you and to purify you, and to teach you the Book and the Wisdom, and to teach you that you knew not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as We have sent unto you a messenger from among you, who reciteth unto you Our revelations and causeth you to grow, and teacheth you the Scripture and wisdom, and teacheth you that which ye knew not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent among you a Messenger of your own to recite Our revelations to you, purify you and teach you the Book and wisdom, and to teach you what you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as We have sent amidst you an apostle from amongst you, who rehearseth unto you Our revelations and purifieth you, and teacheth you the Book and wisdom, and teacheth you that which ye were not wont to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as We sent to you an apostle from among yourselves, who recites to you Our signs and purifies you, and teaches you the Book and wisdom, and teaches you what you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A similar (favour have ye already received) in that We have sent among you a Messenger of your own, rehearsing to you Our Signs, and sanctifying you, and instructing you in Scripture and Wisdom, and in new knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly (to complete My Blessings on you) We have sent among you a Messenger (Muhammad SAW) of your own, reciting to you Our Verses (the Quran) and sanctifying you, and teaching you the Book (the Quran) and the Hikmah (i.e. Sunnah, Islamic laws and Fiqh - jurisprudence), and teaching you that which you used not to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As We have sent among you a Messenger (Prophet Muhammad) from yourselves, to recite to you Our verses and to purify you, who will teach you the Book and Wisdom, and teach you that of which you have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as We sent to you a messenger from among you, who recites Our revelations to you, and purifies you, and teaches you the Book and wisdom, and teaches you what you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as We have sent among you a messenger from yourselves reciting to you Our verses and purifying you and teaching you the Book and wisdom and teaching you that which you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:151] As also We have sent (this [verbal clause ka-mā arsalnā, ‘as We have sent’] is semantically connected to wali-utimma [of the previous verse], that is to say, ‘[Also We have sent] by way of perfection’); as it [My grace] has been perfected by Our sending, among you, of yourselves, Muhammad (s), a messenger, to recite Our verses, the Qur’ān, to you and to purify you, to cleanse you from idolatry, and to teach you the Book, the Qur’ān, and wisdom, the rulings therein, and to teach you what you knew not.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even as We have sent unto you a Messenger) remember Me as I have sent a Messenger (from among you) from your own lineage, (who reciteth unto you Our revelations) i.e. the Qur'an: its commands and prohibitions (and causeth you to grow) cleanses you of sin through divine Oneness, the poor-due, and alms, (and teacheth you the Scripture) the Qur'an (and wisdom) the lawful and the prohibited, (and teacheth you) of legal rulings, legal punishments and stories of bygone nations (that which ye knew not) before the revelation of the Qur'an and the advent of Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كما أرسلنا } أي: كما ذكرتم بإرسال رسول { فيكم } من جنسكم ليمكنكم التلقيّ والتعلم\n وقبول الهداية منه لجنسية النفس ورابطة البشرية { فاذكروني } بالإجابة والطاعة والإرادة { أذكركم } بالمزيد والتوالي للسلوك وإفاضة نور اليقين { واشكروا لي } على نعمة الإرسال والهداية بسلوك صراطي على قدم المحبة أزدكم عرفاني ومحبتي { ولا تكفرون } بالفترة والاحتجاب بنعمة الدين عن المنعم\n فإنه كفران بل كفر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأمرناكم بالتوجه نحوها { كَمَآ أَرْسَلْنَا } من مقام جودنا { فِيكُمْ رَسُولاً } هادياً لكم نائشاً { مِّنْكُمْ يَتْلُواْ عَلَيْكُمْ } أولاً { آيَاتِنَا } آثار صفاتنا الدالة على وحدة ذاتنا { وَ } ثانياً: { يُزَكِّيكُمْ }  { وَ } ثالثاً: { يُعَلِّمُكُمُ ٱلْكِتَابَ } الموضح للدلائل والآيات المبين للآراء والمعتقدات { وَ } رابعاً: يظهر لكم { ٱلْحِكْمَةَ } الموصلة إلى توحيد الذات { وَ } بعد ذلك { يُعَلِّمُكُم } من الحقائق والمعارف { مَّا لَمْ تَكُونُواْ تَعْلَمُونَ } [البقرة: 151] لولا إرشاده وإرساله\n\n\nوإذا أنعمنا عليكم بهذه النعم العظام وأتممناها لكم { فَٱذْكُرُونِيۤ } أيها المؤمنون بالميل الدائم والتوجه الصادق { أَذْكُرْكُمْ } بنفساتٍ رحمانيةٍ ونسماتٍ روحانيةٍ { وَٱشْكُرُواْ لِي } بإسناد النعم إلي { وَلاَ تَكْفُرُونِ } [البقرة: 152] بإسنادها إلى الوسائط والأسباب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كما } متعلق بأتم\n أي: ولأتم نعمتي عليكم في شأن القبلة كما أتممتها عليكم بإرسال الرسول\n أو باذكروني\n أي: كما ذكرناكم بالإرسال\n فاذكروني بالمقال والحال\n وقدم هنا التزكية على التعليم\n باعتبار القصد لأن القصد من الإرسال والتعليم هو التطهير\n وأخره في دعوة إبراهيم باعتبار الفعل\n لأن الإرسال والتعليم مقدم على التطهير\n وأعاد العامل في قوله: { ويعلمكم ما لم تكونوا تعلمون } إيذاناً بأنه جنس آخر شرفاً له\n يقول الحقّ جلّ جلاله يا عبادي اذكروا برّي وإحساني\n فقد أتممت عليكم نعمتي وآلائي بإسعافكم في تحويل القبلة\n كما أتممتها عليكم بأعظم النعم وأجلها\n وهو إرسال من يعلمكم { رسولاً منكم يتلو عليكم آياتنا } الموصلة إلى حضرتنا\n ويطهركم من المساوئ والعيوب\n { ويعلمكم الكتاب } المشتمل على علم الغيوب ودواء القلوب\n ويعلمكم { الحكمة } وهي الشريعة المطهرة والسنّة النبوية\n { ويعلمكم } علوماً غيبية لم يكن لكم بها علم ولا معرفة\n { فاذكروني } بالطاعة والإحسان { أذكركم } بالثواب ونعيم الجنان\n قال صلى الله عليه وسلم:\n \" مَن أطَاعَ الله فقدْ ذكَرَ الله\n وإنْ قَلَّتْ صَلاتُه وصيَامُهُ وتِلاوتُه القرآن\n ومَنْ عَصيَ اللّهَ فَقَدْ نَسِيَ الله\n وإنْ كَثُرتْ صَلاتُهُ وصَيَامُهُ وتِلاوَتُه \"\n \nأو فاذكروني بالجَنَانِ أذكركم بنعمة الشهود والعيان\n أو فاذكروني بالقلوب أذكركم بكشف الحجب\n أو فاذكروني بالتوحيد والإيمان أذكركم بالدرجات في الجنان\n قال الصِّديق رضي الله عنه: كفَى بالتوحيدِ عبَادةً\n وكَفَى بالجنةِ ثَواباً\n أو فاذكروني بالشكر أذكركم بالزيادة\n أو فاذكروني على ظهر الأرض أذكركم في بطنها: قال الأصمعي: رأيت أعرابيّاً واقفاً يوم عرفة بعرفات\n وهو يقول: إلهي عَجَّتْ لكَ الأصْواتُ بضُروب اللغات يسألونك الحَاجَات\n وحاجَتي إليكَ أنْ تَذْكُرني عندَ البلاَءِ إذا نَسِيَني أهلُ الدنيا\n أو: فاذكروني في الدنيا أذكركم في العقبى\n أو: فاذكروني بالطاعات أذكركم بالمعافاة\n يعني يحييه حياة طيبة\n أو: فاذكروني في الخلاء والملأ أذكركم في أفضل الملأ\n دليله الحديث:\n \" أنا عِندَ ظنِّ عبدي بي فليُظنَّ بي مَا شاء\n وأنا معه إذا ذكَرني\n فمن ذَكَرَنيِ في نَفْسِه ذَكَرْتُه في نَفْسِي\n ومن ذَكَرَنِي في مَلأ ذَكرْتُه في مَلأ خير من مَلَئِهِ\n\n\n \" \nالحديث\n أو: فاذكروني في النعمة والرخاء أذكركم في الشدة والبلاء\n أو: فاذكروني بالتسليم والرضا أذكركم بحسن التدبير ولطف القضاء\n\n[الطّلاَق: 3] أو: فاذكروني بالشوق والمحبة أذكركم بالوصال والقربة\n أو: فاذكروني بالتوبة أذكركم بغفران الحوبة\n أو: فاذكروني بالدعاء أذكركم بالعطاء\n أو: فاذكروني بالسؤال أذكركم بالنوال\n إلى غير ذلك مما لا ينحصر\n واعلم أن الذكر ثلاثة أنواع: ذكر اللسان فقط وهو ذكر الغافلين\n وذكر اللسان والقلب وهو ذكر السائرين\n وذكر القلب فقط\n وهو ذكر الواصلين\n والذكر هو أفضل الأعمال كما تقتضيه الأحاديث النبوية والآيات القرآنية\n وهو أقرب الطرق الموصلة إلى الله تعالى\n إذا كان بشيخ كامل\n واعلم أن الذكر على أنواع كثيرة من تهليل وتكبير وتسبيح وحَمْدَلَةٍ وحَسْبَلَةٍ وحوقلة وصلاة على رسول الله صلى الله عليه وسلم\n ولكلِّ خاصيةٌ وثمرة\n وتجتمع في ذكر المفرد\n وهو: الله\n الله\n\nفإن ثمرته الفناء في الذات\n وهي الغاية والمنتهى\n انظر ابن جزي\n قال الحقّ تعالى: واشكروا لي ما أوليتكم من إحساني وبرّي بأن تنسبوها لي لا لغيري\n ولا تجحدوا إحساني فأسلبكم ما خولتكم من إنعامي\n الإشارة: كما أنعم الله على الأمة المحمدية بأن بعث فيهم رسولاً منهم يعلمهم الشرعية النبوية\n ويطهرهم من شهود الغيرية\n ويعلمهم العلوم اللدنية\n كذلك منَّ الله تعالى على عباده من هذه الأمة في كل زمان\n ببعث شيوخ التربية يطهرون الناس من العيوب\n ويدخلونهم حضرة الغيوب\n ويطلعونهم على شهود القدرة الأزلية والحكمة الإلهية\n ويعلمهم من غرائب العلوم\n ويفتح لهم مخازن الفهوم\n فَيَطَّلعون على السر المصون\n ويعلمون ما لم يكونوا يعلمون\n فيقول لهم الحقّ جلّ جلاله: اذكروني بأرواحكم وأسراركم\n أذكركم بالغيبة عن رؤية أشباحكم\n اذكروني بالفكرة والنظرة أمتعكم بدوام شهود الحضرة\n واشكروا لي آلائي وبرّي\n ولا تكفروا بالركون إلى غيري فإني أسلبكم من مزيد معوني ونصري\n ولمّا أمر عباده بالشكر أمرهم بمقام الصبر لأنه أخوه في ضده إذ الشكر في النعمة والصبر في البلية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:129",
      "similarity": 0.7505056153061909
    },
    {
      "verse": "62:2",
      "similarity": 0.6954995433432715
    },
    {
      "verse": "3:58",
      "similarity": 0.562422741728743
    },
    {
      "verse": "3:164",
      "similarity": 0.543913124580393
    },
    {
      "verse": "23:105",
      "similarity": 0.5148021256937645
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:151.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:151.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:151.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}