{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ استعينوا۟ بالصبر والصلوة ان الله مع الصبرين",
  "translations": [
    {
      "translation": "You who have iman! seek help in steadfastness and salat. Allah is with the steadfast.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, seek courage in fortitude and prayer, for God is with those who are patient and persevere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, seek help with fortitude and Salat, for Allah is with those who show fortitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, help yourselves (in your affairs) through patience and prayer; God is with those who have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Seek help from patience and prayer; indeed Allah is with those who patiently endure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Seek help in patience and As-Salah (the prayer). Truly, Allah is with As-Sabirin (the patient).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! seek assistance through patience and prayer; surely Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O all you who believe, seek you help in patience and prayer; surely God is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Seek help in steadfastness and prayer. Lo! Allah is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You who believe, seek help through patience and prayer; surely, God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! seek help in patience and prayer; verily Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Take recourse in patience and prayer; indeed Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! seek help with patient perseverance and prayer; for Allah is with those who patiently persevere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Seek help in patience and As-Salat (the prayer). Truly! Allah is with As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, seek assistance in patience and prayer, Allah is with those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Seek help through patience and prayers. God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:153] O you who believe, seek help, regarding the Hereafter, through patience, in obedience and afflictions, and prayer (He singles it out for mention on account of its frequency and its greatness); surely God is with the patient, helping them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه جمل معترضة بين قوله تعالى : { وحيث ما كنتم فولوا وجوهكم شطره } \\[ البقرة : 150 \\] وما اتصل به من تعليله بقوله : { لئلا يكون للناس عليكم حجة } \\[ البقرة : 150 \\] وما عطف عليه من قوله { ولأتم نعمتي عليكم } \\[ البقرة : 150 \\] إلى قوله : { واشكروا لي ولا تكفرون } \\[ البقرة : 152 \\] وبين قوله : { ليس البر أن تولوا وجوهكم قبل المشرق والمغرب } \\[ البقرة : 177 \\] لأن ذلك وقع تكملة لدفع المطاعن في شأن تحويل القبلة فله أشد اتصال بقوله : { لئلا يكون للناس عليكم حجةً } المتصل بقوله : { وحيثما كنتم فولوا وجوهكم شطره } \\[ البقرة : 150 \\] .وهو اعتراض مُطْنِبٌ ابتُدىء به إعداد المسلمين لما هم أهله من نصر دين الله شكراً له على خَولهم من النعم المعدودة في الآيات السالفة من جعلهم أمة وسطاً وشهداء على الناس ، وتفضيلِهم بالتوجه إلى استقبال أفضل بقعة ، وتأييدهم بأنهم على الحق في ذلك ، وأمْرِهم بالاستخفاففِ بالظالمين وأَنْ لا يخشوهم ، وتبْشيرهم بأنه أتم نعمته عليهم وهداهم ، وامتن عليهم بأنه أرسل فيهم رسولاً منهم ، وهداهم إلى الامتثال للأحكام العظيمة كالشكر والذكر ، فإن الشكر والذكر بهما تهيئة النفوس إلى عظيم الأعمال ، من أجل ذلك كله أَمرهم هنا بالصبر والصلاة ، ونبههم إلى أنهما عون للنفس على عظيم الأعمال ، فناسب تعقيبها بها ، وأيضاً فإن ما ذكر من قوله : { لئلا يكون للناس عليكم حجةً } مشعر بأن أناساً متصدُّون لشغبهم وتشكيكهم والكيد لهم ، فأُمروا بالاستعانة عليهم بالصبر والصلاة . وكلها متماسكة متناسبة الانتقال عدا آية : { إن الصفا والمروة من شعائر الله } إلى قوله : { شاكر عليم } \\[ البقرة : 158 \\] فسيأتي تبييننا لموقعها .وافتُتح الكلام بالنداء لأن فيه إشعاراً بخبرٍ مهم عظيم ، فإن شأن الأَخبار العظيمة التي تَهُول المخاطبَ أن يقدَّم قبلَها ما يهيءُ النفس لقبولها لتستأنس بها قبل أن تفْجَأَها .وفي افتتاح هذا الخطاب بالاستعانة بالصبر إيذان بأنه سيُعقب بالنَّدْب إلى عمل عظيم وبلْوى شديدة ، وذلك تهيئةٌ للجهاد ، ولعله إعداد لغزوة بدر الكبرى ، فإن ابتداء المغازي كان قُبيل زمن تحويل القبلة إذ كان تحويل القبلة في رجب أو شعبان من السنة الثانية للهجرة وكانت غزوة بُوَاطَ والعُشَيْرَةِ وبدْرٍ الأولى في ربيع وجمادى من السنة الثانية ولم يكن فيهما قتال ، وكانت بَدْرٌ الكبرى في رمضان من السنة الثانية فكانت بعد تحويل القبلة بنحو شهرين .وقد تقدم في تفسير قوله تعالى : { وما كان الله ليضيع إيمانكم } \\[ البقرة : 143 \\] أن ما وقع في حديث البراء بن عازب من قول الراوي أن ناساً قُتلوا قبل تحويل القبلة ، أنه توهم من أحد الرواة عن البراء ، فإن أَوَّلَ قَتْل في سبيل الله وقع في غزوة بدر وهي بعد تحويل القبلة بنحو شهرين ، والأصح ما في حديث الترمذي عن ابن عباس قال « لما وُجِّه النبي إلى الكعبة قالوا يا رسول الله كيف بإخواننا الذين ماتوا وهم يصلون إلى بيت المقدس »الحديث فلم يقل : ( الذين قتلوا ) . فالوجه في تفسير هذه الآية أنها تهيئة للمسلمين للصبر على شدائد الحرب ، وتحبيبٌ للشهادة إليهم . ولذلك وقع التعبير بالمضارع في قوله : { لمن يقتل في سبيل الله المشعر بأنه أمرٌ مستقبل وهم الذين قتلوا في وقعة بدر بُعَيد نزول هذه الآية .وقد تقدم القول في نظير هذه الآية عند قوله تعالى : { واستعينوا بالصبر والصلوات وإنها لكبيرة } \\[ البقرة : 45 \\] الآية إلاَّ أنا نقول هنا إن الله تعالى قال لبني إسرائيل : { إنها لكبيرة } علماً منه بضعف عزائمهم عن عظائم الأعمال وقال هنالك { إلاَّ على الخاشعين } ولم يذكر مثل هذا هنا ، وفي هذا إيماء إلى أن المسلمين قد يُسر لهم ما يصعب على غيرهم ، وأنهم الخاشعون الذين استثناهم الله هنالك ، وزاد هنا فقال : { إن الله مع الصابرين } فبشرهم بأنهم ممن يمتثل هذا الأمر ويعد لذلك في زمرة الصابرين .وقوله { إن الله مع الصابرين } تذييل في معنى التعليل أي اصبروا ليكون الله معكم لأنه مع الصابرين .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! Seek help in steadfastness) to fulfil the obligations of Allah and to abstain from contraventions and shameful works (and prayer) and with abundant supererogatory prayers at night and during the day in order to come clean from sin. (Lo! Allah is with the steadfast) He helps, and protects the steadfast from shameful works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يا أيها الذين آمنوا } الإيمان العيانيّ { استعينوا بالصبر } معي عند سطوات تجليّات عظمتي وكبريائي { والصلاة } أي: الشهود الحقيقي بي { إنّ الله مع الصابرين } المطيقين لتجليات أنواره\n  { ولا تقولوا لمن يقتل في سبيل الله } أي: يجعل فانياً مقتولة نفسه في سلوك سبيل التوحيد ميتاً عن هواه\n كما قال رسول الله صلى الله عليه وسلم:\n \" موتوا قبل أن تموتوا \" ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم إنه لما بالغ سبحانه في التنبيه والإرشاد\n وناداهم رجاء أن يتنبهوا مع أن فطرتهم الأصلية على التوحيد الذاتي\n فقال: { يَآأَيُّهَا ٱلَّذِينَ آمَنُواْ } بتوحيد الذات { ٱسْتَعِينُواْ } لتحققه وانكشافه { بِٱلصَّبْرِ } على ما جرى عليكم من الحوادث المنفرة لنفوسكم { وَٱلصَّلاَةِ } أي: الميل والتوجه إلى جنابه لجميع الأعضاء والجوارح { إِنَّ ٱللَّهَ } المعبر به عن الذات الأحدية { مَعَ ٱلصَّابِرِينَ } [البقرة: 153] المتحملين للبلاء لو كوشفوا\n\n\nرب اجعلنا منه بفضلك وكرمك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:45",
      "similarity": 0.7225655945825634
    },
    {
      "verse": "7:128",
      "similarity": 0.6907880464935079
    },
    {
      "verse": "1:5",
      "similarity": 0.6782358701750041
    },
    {
      "verse": "107:7",
      "similarity": 0.6519021439190261
    },
    {
      "verse": "21:112",
      "similarity": 0.5948005058501991
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002153.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002153.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:153.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}