{
  "chapter": "البقرة",
  "text": "يايها الناس كلوا۟ مما فى الارض حللا طيبا ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين",
  "translations": [
    {
      "translation": "Mankind! eat what is good and lawful on the earth. And do not follow in the footsteps of Shaytan. He truly is an outright enemy to you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, eat only the things of the earth that are lawful and good. Do not walk in the footsteps of Satan, your acknowledged enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, eat of what is lawful and clean in the earth and do not follow the ways of Satan, for he is your avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, eat of the good and lawful things on earth. Do not follow the footsteps of Satan; he is clearly your enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat from what is lawful and clean in the earth; and do not follow the footsteps of the devil; undoubtedly he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaytan (Satan). Verily, he is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! eat the lawful and good things out of what is in the earth, and do not follow the footsteps of the Shaitan; surely he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, eat of what is in the earth lawful and good; and follow not the steps of Satan; he is a manifest foe to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of that which is lawful and wholesome in the earth, and follow not the footsteps of the devil. Lo! he is an open enemy for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, eat whatever is lawful and wholesome on the earth; and do not follow in the footsteps of Satan; for he is indeed your avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind! eat of whatsoever is, the earth, lawful, and clean and follow not the footsteps of Satan; verily he is an enemy unto you manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of what is lawful and pure in the earth, and do not follow in Satan’s steps. Indeed, he is your manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye people! Eat of what is on earth, Lawful and good; and do not follow the footsteps of the evil one, for he is to you an avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaitan (Satan). Verily, he is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, eat of what is lawful and good on the earth and do not walk in satan's footsteps, because he is for you a clear enemy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Eat of what is lawful and good on earth, and do not follow the footsteps of Satan. He is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, eat from whatever is on earth [that is] lawful and good and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:168] The following was revealed when some said that it was unlawful to take a camel that has been let loose (sawā’ib): O people, eat of what is in the earth, lawful (halālan is a circumstantial qualifier) and wholesome (tayyiban is an adjective for emphasis), that is to say, what is delicious; and follow not the steps, the ways, of Satan, meaning, what he embellishes [of temptations]; he is a manifest foe to you, whose enmity is clear;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي هو كالخاتمة لتشويه أحوال أهل الشرك من أصول دينهم وفروعه التي ابتدأ الكلام فيها من قوله تعالى : { إن الذين كفروا وماتوا وهم كفار أولئك عليهم لعنة الله والملائكة } \\[ البقرة : 161 \\] الآية ، إذْ ذَكر كفرهم إجمالاً ثم أبطله بقوله : { وإلهكم إله واحد } \\[ البقرة : 163 \\] واستدل على إبطاله بقوله : { إن في خلق السموات والأرض } \\[ البقرة : 164 \\] الآيات ثم وصف كفرهم بقوله : { ومن الناس من يتخذ من دون الله أنداداً يحبونهم كحب الله } \\[ البقرة : 165 \\] ، ووصف حالهم وحسرتهم يوم القيامة ، فوصف هنا بعض مساوىء دين أهل الشرك فيما حرموا على أنفسهم مما أخرج الله لهم من الأرض ، وناسب ذكره هنا أنه وقع بعد ما تضمنه الاستدلال على وحدانية الله والامتنان عليهم بنعمته بقوله : { إن في خلق السموات والأرض إلى قوله : وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابةٍ } \\[ البقرة : 164 \\] الآية ، وهو تمهيد وتلخيص لما يعقبه من ذكر شرائع الإسلام في الأطعمة وغيرها التي ستأتي من قوله تعالى : { يأيها الذين آمنوا كلوا من طيبات ما رزقناكم } \\[ البقرة : 172 \\] .فالخطاب بيأيها الناس موجه إلى المشركين كما هو شأن خطاب القرآن بيأيها الناس . والأمر في قوله : { كلوا مما في الأرض } مستعمل في التوبيخ على ترك ذلك وليس للوجوب ولا للإِباحة ، إذ ليس الكفار بأهل للخطاب بفروع الشريعة فقوله : { كلوا } تمهيد لقوله بعده { ولا تتبعوا خطوات الشيطان } .وقوله : { حلالاً طيباً } تعريض بتحميقهم فيما أعنتوا به أنفسهم فحرَموها من نعم طيبة افتراء على الله ، وفيه إيماء إلى علة إباحته في الإِسلام وتعليم للمسلمين بأوصاف الأفعال التي هي مناط الحِل والتحريم .والمقصود إبطال ما اختلقوه من منع أكل البَحِيرة ، والسائبة ، والوصيلة ، والحامي ، وما حكي الله عنهم في سورة الأنعام من قوله : { وقالوا هذه أنعام وحرث حجر لا يطعمها إلا من نشاء بزعمهم } \\[ الأنعام : 138 \\] الآيات . قيل نزلت في ثقيف وبني عامر بن صعصعة وخزاعة وبني مدلج حرَّموا على أنفسهم من الأنعام أي مما ذكر في سورة الأنعام .ومِن في قوله : { مما في الأرض } للتبعيض ، فالتبعيض راجع إلى كون المأكول بعضاً من كل نوع وليس راجعاً إلى كون المأكول أنواعاً دون أنواع ، لأنه يفوت غرض الآية ، فما في الأرض عام خصصه الوصف بقوله : { حلالاً طيباً } فخرجت المحرمات الثابت تحريمها بالكتاب أو السنة .وقوله : { حلالاً طيباً } حالان من ( ما ) الموصولة ، أولهما لبيان الحكم الشرعي والثاني لبيان علته لأن الطيب من شأنه أن تقصده النفوس للانتفاع به فإذا ثبت الطيب ثبتت الحلِّية لأن الله رفيق بعباده لم يمنعهم مما فيه نفعهم الخالص أو الراجح .والمراد بالطيب هنا ما تستطيبه النفوس بالإدراك المستقيم السليم من الشذوذ وهي النفوس التي تشتهي الملائم الكامل أو الراجح بحيث لا يعود تناوله بضر جثماني أو روحاني وسيأتي معنى الطيب لغة عند قوله تعالى :{ قل أحل لكم الطيبات } \\[ المائدة : 4 \\] في سورة المائدة .وفي هذا الوصف معنى عظيم من الإيماء إلى قاعدة الحلال والحرام فلذلك قال علماؤنا : إن حكم الأشياء التي لم ينص الشرع فيها بشيء أن أصل المضار منها التحريم وأصل المنافع الحل ، وهذا بالنظر إلى ذات الشيء بقطع النظر عن عوارضه كتعلق حق الغير به الموجب تحريمه ، إذ التحريم حينئذٍ حكم للعارض لا للمعروض .وقد فسر الطيب هنا بما يبيحه الطشرع وهو بعيد لأنه يفضي إلى التكرار ، ولأنه يقتضي استعمال لفظ في معنى غير متعارف عندهم .وقوله : { ولا تتبعوا خطوات الشيطان } الضمير للناس لا محالة وهم المشركون المتلبسون بالمنهي عنه دوماً ، وأما المؤمنون فحظهم منه التحذير والموعظة . واتباع الخطوات تمثيلية ، أصلها أن السائر إذا رأى آثار خطوات السائرين تبع ذلك المسلك علماً منه بأنه ما سار فيه السائر قبله إلاّ لأنه موصل للمطلوب ، فشبه المقتدي الذي لا دليل له سوى المقتدي به وهو يظن مسلكه موصلاً ، بالذي يتبع خطوات السائرين وشاعت هاته التمثيلية حتى صاروا يقولون هو يتبع خُطا فلان بمعنى يقتدي به ويمتثل له .والخطوات بضم فسكون جمع خطوة مثل الغرفة والقبضة بضم أولهما بمعنى المخطو والمغروف والمقبوض ، فهي بمعنى مخطوة اسم لمسافة ما بين القدمين عند مشي الماشي فهو يخطوها ، وأما الخَطوة بفتح الخاء فهي المرة من مصدر الخطو وتطلق على المخطو من إطلاق المصدر على المفعول .وقرأ الجمهور ( خطوات ) بضم فسكون على أصل جمع السلامة ، وقرأه ابن عامر وقنبل عن ابن كثير وحفصٌ عن عاصم بضم الخاء والطاء على الإتباع ، والإتباع يساوي السكون في الخفة على اللسان .والاقتداء بالشيطان إرسال النفس على العمل بما يوسوسه لها من الخواطر الشرية ، فإن الشياطين موجودات مدركة لها اتصال بالنفوس البشرية لعله كاتصال الجاذبية بالأفلاك والمغناطيس بالحديد ، فإذا حصل التوجه من أحدهما إلى الآخر بأسباب غير معلومة حدثت في النفس خواطر سيئة ، فإن أرسل المكلف نفسه لاتباعها ولم يردعها بما له من الإرادة والعزيمة حققها في فاعله ، وإن كبحها وصدها عن ذلك غلبها . ولذلك أودع الله فينا العقل والإرادة والقدرة وكمَّل لنا ذلك بالهدى الديني عوناً وعصمة عن تلبيتها لئلا تضلنا الخواطر الشيطانية حتى نرى حسناً ما ليس بالحسن ، ولهذا جاء في الحديث « من هَمَّ بسيئة فلم يعملها كتبها الله عنده حسنة كاملة » لأنه لما هم بها فذلك حين تسلطت عليه القوة الشيطانية ولما عدل عنها فذلك حين غلب الإرادة الخيرية عليها ، ومثل هذا يقال في الخواطر الخيرية وهي الناشئة عن التوجهات الملكية ، فإذا تنازع الداعيان في نفوسنا احتجنا في التغلب إلى الاستعانة بعقولنا وآرائنا وقدرتنا ، وهُدى الله تعالى إيانا وذلك هو المعبر عنه عند الأشعري بالكسب ، وعنه يترتب الثواب والعقاب .واللام في { الشيطان } للجنس ، ويجوز أن تكون للعهد ، ويكون المراد إبليسَ وهو أصل الشياطين وآمرهم فكل ما ينشأ من وسوسة الشياطين فهو راجع إليه لأنه الذي خطا الخطوات الأولى .وقوله : { إنه لكم عدوٌ مبين } ، ( إنَّ ) لمجرد الاهتمام بالخبر لأن العداوة بين الشيطان والناس معلومة متقررة عند المؤمنين والمشركين وقد كانوا في الحج يرمون الجمار ويعتقدون أنهم يرجمون الشيطان ، أو تجعل ( إن ) للتأكيد بتنزيل غير المتردد في الحكم منزلة المتردد أو المنكِر لأنهم لاتباعهم الإشارات الشيطانية بمنزلة من ينكر عداوته كما قال عبدة: ... إن الذين تُرونهم إخوانَكميشفى غليل صدورهم أن تُصرعوا ... وأياً ما كان فإن تفيد معنى التعليل والربط في مثل هذا وتغني غناء الفاء وهو شأنها بعد الأمر والنهي على ما في «دلائل الإعجاز» ومثله قول بشار: ... بكِّرا صَاحِبَيَّ قبلَ الهجيرإنَّ ذاك النجاحَ في التبكير ... وقد تقدم ذلك .وإنما كان عدواً لأن عنصر خلقته مخالف لعنصر خلقة الإنسان فاتصاله بالإنسان يؤثر خلاف ما يلائمه ، وقد كثر في القرآن تمثيل الشيطان في صورة العدو المتربص بنا الدوائر لإثارة داعية مخالفته في نفوسنا كي لا نغتر حين نجد الخواطر الشريرة في أنفسنا فنظنها ما نشأت فينا إلاّ وهي نافعة لنا لأنها تولدت من نفوسنا ، ولأجل هذا أيضاً صورت لنا النفس في صورة العدو في مثل هاته الأحوال .ومعنى المبين الظاهر العداوة من أبان الذي هو بمعنى بان وليس من أبان الذي همزته للتعدية بمعنى أظهر لأن الشيطان لا يُظهر لنا العداوة بل يلبس لنا وسوسته في لباس النصيحة أو جلب الملائم ، ولذلك سماه الله وليّاً فقال : { ومن يتخذ الشيطان ولياً من دون الله فقد خسر خسراناً مبيناً } \\[ النساء : 119 \\] ، إلاّ أن الله فضحه فلم يبق مسلم تروج عليه تلبيساته حتى في حال اتِّباعه لخطواته فهو يعلم أنها وساوسه المضرة إلاّ أنه تغلبه شهوته وضعف عزيمته ورقة ديانته .\n\n",
      "translations": [
        {
          "translation": "Allah then mentions the lawfulness of cultivating land and raising cattle, saying: (0 mankind) people of Mecca! (Eat of that which is lawful and wholesome) that is not prohibited by Allah (in the earth) of what is cultivated in lands and of cattle, (and follow not the footsteps of the devil) the embellishments and whisperings of the devil concerning the unlawfulness of the cultivation of land and of raising cattle. (Lo! He is an open enemy for you) whose enmity towards you is quite manifest.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلاَ تَتَّبِعُواْ خُطُوَاتِ ٱلشَّيْطَانِ } معناهُ آثارُهُ\n وواحدُهَا خُطْوَةٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And do not follow the footsteps of Satan}, its meaning is its effects.\n {It is} one step",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال تعالى منادياً لهم إشفاقاً وإرشاداً: { يٰأَيُّهَا ٱلنَّاسُ } المجبولون على التوحيد { كُلُواْ } وتناولوا { مِمَّا } من جميع ماخلق لكم { فِي ٱلأَرْضِ } لتقويم مزاجكم وتقويته { حَلاَلاً } إذ الأصل في الأشياء الحل ما الم يرد الشرع على حرمته { طَيِّباً } مما يحصل من كد يمينكم وعرق جبينكم\n إذ لا رزق أطيب منه { وَلاَ تَتَّبِعُواْ خُطُوَاتِ ٱلشَّيْطَانِ } أي: لا تقتدوا ولا تقنفوا في تحصيل الرزق إثر وساوس شياطين الأهواء والآراء المضلة عن طريق الحق\n والمفضية إلى سبيل الظلم والعدون\n ولا تغتروا بتمويهات الشيطان وتزييناته { إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ } [البقرة: 168] ظاهر العداوة عند أولي البصائر بنور الله\n المقتبسين من مشكاة توحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { حلالاًّ } حال\n أو مفعول به\n و { طيباً } نعت له\n و { الخُطُوات } جمع خطوة\n وهي بالفتح - مصدر خطَا يَخْطُوا\n وبالضم - اسم لمسافة ما بين القدمين\n ويُكَسَّر على خطاً\n ويُصَحَّح على خطوات\n مثلث الطاء\n أعني: الضم على الإتباع\n كغرفات وقربات\n قال ابن مالك:\nوالسكون على الأصل في المفرد\n والفتح تخفيفاً\n قال في الألفية:\nوقرئ في المواتر بالضم والإسكان\n وفي الشاذِّ بالفتح\n قال الخليل: خطوات الشيطان\n آثاره وطرقه\n يقول: لا تقتدوا به\n هـ\n وأصل السوء: كل ما يَسُوء صاحبه ويُحزنه\n والفحشاء: ما قبحُ من القول والفعل\n مصدر فحش كالبأساء والضراء واللأوَاء\n قال ابن عباس: الفحشاءُ: ما فيه حد\n والسوء: ما لا حَدَّ فيه\n وقال مقاتل: كل مافي القرآن من ذكر الفشحاء فإنه الزنا\n إلا قوله:\nفإنه البخل[البَقَرَة: 268]\n قال البيضاوي: السوء والفحشاء: ما أنكره العقل واستقبحه الشرع\n والعطف لاختلاف الوصفين\n فإنه سوءٌ لاغتمام العاقل\n به\n وفحشاء باستقباحه إياه\n وقيل: السوء يعمُ القبائح\n والفحشاء ما تجاوَز الحدَّ في القبح\n هـ\n يقول الحقّ جلّ جلاله: { يا أيها الناس كلوا } من جميع ما خلقنا لكم في الأرض من نباتها مما يُستطاب أكله\n وحيواناتها إلا ما حرمناه عليكم\n حالة كون ذلك { حلالاً } قد انحلَّت عنه التبِعَات\n وزالت عنه الشبهات\n { طيباً } مُستلَذاً يستلِذُّه الطبع\n ويستحسنه الشرع\n { ولا تتبعوا } طرق { الشيطان } فتُحَرِّموا برأيكم ما أحلَّ الله لكم\n كالبَحِيرة والسائبة والوَصِيلة والحام\n وبعض الحرث الذي جعلتموه للأصنام\n فإن ذلك من تزيين الشيطان\n وهو { لكم عدو مبين }\n ومن شأن العدو الخِدَاع والغرور\n فإنما يأمركم بما يَسُوء وجوهَكم من الذنوب\n وما يُرديكم من قبائح المعاصي والعيوب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:208",
      "similarity": 0.7936502731388579
    },
    {
      "verse": "6:142",
      "similarity": 0.6927184121818528
    },
    {
      "verse": "24:21",
      "similarity": 0.6777612712190417
    },
    {
      "verse": "5:87",
      "similarity": 0.29215284803787867
    },
    {
      "verse": "5:88",
      "similarity": 0.2632865261711395
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002168.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002168.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:168.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}