{
  "chapter": "البقرة",
  "text": "ان الذين كفروا۟ وماتوا۟ وهم كفار او۟لئك عليهم لعنة الله والملئكة والناس اجمعين",
  "translations": [
    {
      "translation": "But as for those who are kafir and die kuffar, the curse of Allah is upon them and that of the angels and all mankind.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny, and die disbelieving, bear the condemnation of God and the angels and that of all men,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who adopted the way of disbelief and died as disbelievers, are accursed of Allah and of angels and of all mankind: they shall remain accursed for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny My existence and die with such attitude will be subject to the condemnation of God, the angels, and all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed upon those who disbelieved, and died as disbelievers, is the curse of Allah and of the angels and of men combined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, and die while they are disbelievers, it is they on whom is the curse of Allah and of the angels and of mankind, combined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve and die while they are disbelievers, these it is on whom is the curse of Allah and the angels and men all;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve, and die disbelieving -- upon them shall rest the curse of God and the angels, and of men altogether,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Those who disbelieve, and die while they are disbelievers; on them is the curse of Allah and of angels and of men combined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth, and die as deniers, on them shall be the curse of God and of angels and of men altogether.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve, and die while they are infidels, these it is on whom shall be the curse of Allah and the angels and mankind all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who turn faithless and die while they are faithless—it is they on whom shall be the curse of Allah, the angels and all mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Faith, and die rejecting,- on them is Allah's curse, and the curse of angels, and of all mankind;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, and die while they are disbelievers, it is they on whom is the Curse of Allah and of the angels and of mankind, combined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve, and die disbelieving shall incur the curse of Allah, the angels, and all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who reject faith, and die rejecting—those—upon them is the curse of God, and of the angels, and of all humanity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve and die while they are disbelievers - upon them will be the curse of Allah and of the angels and the people, all together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:161] But those who disbelieve, and die disbelieving (wa-hum kuffār, ‘they being disbelievers’, is a circumstantial qualifier) — upon them shall be the curse of God and the angels, and of people altogether, that is, they deserve such [a curse] in this life and in the next; ‘people’ here is said to be either [people] in general, or believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those who disbelieve, and die while they are disbelievers) in Allah and His Messenger; (on them is the curse of Allah) the torment of Allah (and of the angels) the curse of the angels (and of men combined) the curses directed by believers towards each other will end up as curses on these unbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ إنّ الذين كَفَرُوا } حجبوا عن الدين أو الحق { وماتُوا وهم كفّار } أي: بقوا على احتجابهم حتى زال استعدادهم وانطفأ نور فطرتهم بدين الحجاب، وانقطعوا عن الأسباب التي يمكن بها رفع حجاب الموت { أولئك عليهم لعنَة الله والملائكة والناس أجْمَعِين } أي: استحقوا البعد والحرمان والطرد الكليّ عن الحق وعن عالم الملكوت وعن الفطرة الإنسانية المعبر عنه بالطمس.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال: { إِن الَّذِينَ كَفَرُوا } بكتمان ما بين الله في كتابه { وَمَاتُوا وَهُمْ كُفَّارٌ } كاتمون { أُولَئِكَ } المصرون المعاندون في أمر الكتان بعد الظهور مكابرة\n وتنزل { عَلَيْهِمْ لَعْنَةُ ٱللَّهِ } طرده وتبعيده دائماً مستمراً منحصراً عليهم\n غر منفكٍ عنهم على ما يقتضيه حال الجلمة المعبر عنها بخلاف اللعن السابق { وَ } تنزل عليهم أيضاً لعنة { ٱلْمَلاۤئِكَةِ } المستغفرين لمن تاب { وَ } أيضاً لعنة { ٱلنَّاسِ } العارفين لحقوق الله المتحققين بآدابه المعتكفين ببابه { أَجْمَعِينَ } [البقرة: 161] مجتمعين عليها دائماً لخروجهم عن ربتة العبودية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وأما من مات على الكفر ولم يتب فأولئك { عليهم لعنة الله } \n ومن يُعْتَدّ بلعنته من { الملائكة والناس أجمعين } خالدين في اللعنة أو في النار { لا يخفف عنهم العذاب } ساعة\n ولا هم يمهلون عنه\n أو لا ينتظرون للاعتذار أو الفداء\n الإشارة: ما قيل في أحبار اليهود يقال مثله في علماء السوء من هذه الأمة\n الذين ملكتهم جيفة الدنيا\n وأسرهم الهوى\n الذين يقبضون الرّشَا على الأحكام\n فيكتمون المشهور الواضح\n ويحكمون بشهوة أنفسهم\n فأولئك يلعنهم اللاعنون\n وفي ذلك يقول ابن المبارك - رحمه الله -:\nوكان يحيى بن معاذ الرازي رضي الله عنه يقول لعلماء وقته: يا معْشرَ العلماء\n ديارُكم هَامَانيَّة\n وملابِسُكُم قَارُونية\n ومَرَاكِبُكُم فرعونية وولائمُكُمْ جالوتية\n فأين السنّةُ المحمدية؟\n إلا مَن تاب وأصلح ما أفسد\n وبيَّن ما كتم\n فأولئك يتوب الله عليهم\n تنبيه: العلم باعتبار وجوب إظهاره وكتمه على ثلاثة أقسام: قسم يجب إظهاره\n ومَنْ كَتَمَه دخل في وعيد الآية\n وهو علم الشريعة الظاهرة\n إذا تعيَّن على المسؤول بحيث لم يُوجَد من يُفتِي في تلك النازلة\n وقسم يجب كتمه\n وهو علم سرّ الربوبية\n أعني التوحيدَ الخاص\n فهذا لا يجوز إفشاؤه إلا لأهله\n وهو من بذل نَفْسَه وفَلْسَهُ وخَرقَ عوائد نفسه\n فهذا لا يحل كتمه عن إذا طلبه\n وقسم يُستحب كتمه\n وهو أسرار القدَر المُغَيَّبَات\n فهذا من باب الكرامات يستحب كتمها ولا يجب\n والله تعالى أعلم\n هنا انتهى العتاب لبني إسرائل والكلام معهم\n وابتداؤه من قوله تعالى: { يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأوفوا بعهدي أوف بعهدكم\n\n\n } \n وإنما تخلَّل الكلامَ ذكرُ إبراهيم وبنيه توطئةً لنسخ القبلة الذي أنركوه\n فذكر بناء الكعبة وبيان شرفها\n وانجزَّ الكلام إلى ذكر الصفا والمروة لقرب المناسبة والجوار\n فلما فرغ من عتابهم دلَّهم على التوحيد\n وشاركهم في ذلك غيرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:87",
      "similarity": 0.8189828406580468
    },
    {
      "verse": "15:35",
      "similarity": 0.5773493722582363
    },
    {
      "verse": "38:78",
      "similarity": 0.5773493722582363
    },
    {
      "verse": "4:52",
      "similarity": 0.5208435678988247
    },
    {
      "verse": "33:68",
      "similarity": 0.4659868397181216
    }
  ]
}