{
  "chapter": "البقرة",
  "text": "اذ تبرا الذين اتبعوا۟ من الذين اتبعوا۟ وراوا۟ العذاب وتقطعت بهم الاسباب",
  "translations": [
    {
      "translation": "When those who were followed disown those who followed them, and they see the punishment, and the connection between them is cut,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed will disclaim those who followed them, and see the torment all ties between them shall be severed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When He will inflict punishment, those very leaders and guides whom they followed in the world will disown them. But punishment they shall get and all their bonds shall be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the leaders see the torment and lose all their resources, they will denounce their followers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The day) when the leaders will be disgusted with their followers – and they shall see their punishment, and all their links will be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed disown (declare themselves innocent of) those who followed (them), and they see the torment, then all their relations will be cut off from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed shall renounce those who followed (them), and they see the chastisement and their ties are cut asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when those that were followed disown their followers, and they see the chastisement, and their cords are cut asunder,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the day) when those who were followed disown those who followed (them), and they behold the doom, and all their aims collapse with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they face their punishment, those who have been followed will disown their followers, and all their ties shall be cut asunder,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed shall quit themselves of those who followed, and they all shall behold the torment, and sundered between them shall be the Cords.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed will disown the followers, and they will sight the punishment while all their means of recourse will be cut off,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then would those who are followed clear themselves of those who follow (them): They would see the penalty, and all relations between them would be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed, disown (declare themselves innocent of) those who followed (them), and they see the torment, then all their relations will be cut off from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when those who were followed disown those who followed, and they see the punishment and relationships are broken off,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were followed will then disown those who followed them, and they will see the retribution, and ties between them will be severed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And they should consider that] when those who have been followed disassociate themselves from those who followed [them], and they [all] see the punishment, and cut off from them are the ties [of relationship],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:166] When (idh here substitutes for the previous idh) those who were followed, that is, the leaders, disown their followers, that is to say, [when] they have denied misleading them [the latter], and they have seen the chastisement, and the cords, the bonds of affection and kinship that were between them on earth, are cut away before them, from them (taqatta‘at, ‘cut away’, is a supplement to tabarra’a, ‘disown’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإذ ظرف وقع بدل اشتمال من ظرف { إذ يرون العذاب } \\[ البقرة : 165 \\] أي لو تراهم في هذين الحالين حال رؤيتهم العذاب وهي حالة فظيعة وتشتمل على حال اتخاذ لهم وتبرىء بعضهم من بعض وهي حالة شنيعة وهما حاصلان في زمن واحد .وجيء بالفعل بعد ( إذ ) هنا ماضياً مع أنه مستقبل في المعنى لأنه إنما يحصل في الآخرة تنبيهاً على تحقق وقوعه فإن درجتَ على أن إذ لا تخرج عن كونها ظرفاً للماضي على رأي جمهور النحاة فهي واقعة موقع التحقيق مثل الفعل الماضي الذي معها فتكون ترشيحاً للتبعية ، وإن درجت على أنها ترد ظرفاً للمستقبل وهو الأصح ونسبه في «التسهيل» إلى بعض النحاة ، وله شواهد كثيرة في القرآن قال تعالى : { ولقد صدقكم الله وعده إذ تحسونهم بإذنه } \\[ آل عمران : 152 \\] على أن يكون { إذ تحسونهم } هو الموعود به وقال : { فسوف يعلمون إذ الأغلال في أعناقهم } \\[ غافر : 71 \\] فيكون المجاز في فعل { تَبرَّأ } خاصة .والتبرؤ تكلف البراءة وهي التباعد من الأمر الذي من شأن قُرْبه أن يكون مضراً ولذلك يقال تبارآ إذا أبعد كلٌ الآخر من تبعةٍ محققة أو متوقعة .و { الذين اتبعوا } بالبناء إلى المجهول هم الذين ضللوا المشركين ونصبوا لهم الأنصاب مثل عمرو بن لُحَيَ ، فقد أشعر قوله { اتُّبِعُوا } أنهم كانوا يَدْعُون إلى متابعتهم ، وأيدَّ ذلك قوله بعده { فنتبرأ منهم كما تبرءوا منا } أي نجازيهم على إِخلافهم .ومعنى براءتهم منهم تنصلهم من مواعيد نفعهم في الآخرة الذي وعدوهم في الدنيا والشفاعة فيهم ، وصَرْفُهم عن الالتحاق بهم حين هَرَعُوا إليهم .وجملة { ورأوا العذاب } حاليَّة أي تبرءوا في حال رؤيتهم العذاب ، ومعنى رؤيتهم إياه أنهم رأوا أسبابه وعلموا أنه أُعِد لمن أضلَّ الناسَ فجعلوا يتباعدون من أَتباعهم لئلا يحق عليهم عذاب المضللين ، ويجوز أن تكون رؤية العذاب مجازاً في إحساس التعذيب كالمجاز في قوله : { يمسهم العذاب } \\[ الأنعام : 49 \\] فموقع الحال هنا حسن جداً وهي مغنية عن الاستئناف الذي يقتضيه المقام لأن السامع يتساءل عن موجب هذا التبرؤ فإنه غريب فيقال رأوا العذاب فلما أريد تصويرالحال وتهويل الاستفظاع عدل عن الاستئناف إلى الحال قضاء لحق التهويل واكتفاءً بالحال عن الاستئناف لأن موقعهما متقارب ، ولا تكون معطوفة على جملة { تبرأ } لأن معناها حينئذٍ يصير إعادةً لمعنى جملة : { ولو يرى الذين ظلموا إذ يرون العذاب } فتصير مجردَ تأكيد لها ويفوت ما ذكرناه من الخصوصيات .وضمير { رَأوا } ضميرٌ مبهم عائد إلى فريقي الذين اتُّبعوا والذين اتَّبعوا .وجملة { وتقطعت بهم الأسباب } معطوفة على جملة { تبرأ } أي وإذْ تقطعت بهم الأسباب ، والضمير المجرور عائد إلى كلا الفريقين .والتقطع الانقطاع الشديد لأن أصله مطاوع قطَّعهُ بالتشديد مضاعف قَطع بالتخفيف .والأسباب جمع سبب وهو الحَبْل الذي يُمد ليُرتقى عليه في النخلة أو السطح ، وقوله { وتقطعت بهم الأسباب } تمثيلية شبهت هيئتهم عند خيبة أملهم حين لم يجدوا النعيم الذي تعبوا لأجله مدةَ حياتهم وقد جاءَ إبانه في ظنهم فوجدوا عوضه العذاب ، بحال المرتقى إلى النخلة ليجتنى الثمر الذي كد لأجله طول السنة فتقطع به السبب عند ارتقائه فسقط هالكاً ، فكذلك هؤلاء قد علم كلهم حينئذٍ أن لا نجاة لهم فحالهم كحال الساقط من علو لا ترجى له سلامة ، وهي تمثيلية بديعة لأنها الهيئة المشبهة تشتمل على سبْعة أشياء كل واحد منها يصلح لأن يكون مشَّبهاً بواحد من الأشياء التي تشتمل عليها الهيئة المشبه بها وهي : تشبيه المشرك في عبادته الأصنام واتباع دينها بالمرتقى بجامع السعي ، وتشبيه العبادة وقبول الآلهة منه بالحبل الموصل ، وتشبيه النعيم والثواب بالثمرة في أعلى النخلة لأنها لا يصل لها المرء إلا بعد طول وهو مدة العمر ، وتشبيه العمر بالنخلة في الطول ، وتشبيه الحرمان من الموصول للنعيم بتقطع الحبل ، وتشبيه الخيبة بالبعد عن الثمرة ، وتشبيه الوقوع في العذاب بالسقوط المهلك . وقلما تأتي في التمثيلية صلوحية أجزاء التشبيه المركب فيها لأن تكون تشبيهات مستقلة ، والوارد في ذلك يكون في أشياء قليلة كقول بشار الذي يُعد مثالاً في الحُسن: ... كأنَّ مُثار النَّقْع فوقَ رؤسِناوأسيافَنَا لَيْلٌ تَهَاوَى كَواكِبُهْ ... فليس في البيت أكثر من تشبيهات ثلاثة .فالباء في ( بهم ) للملابسة أي تقطعت الأسباب ملتبسة بهم أي فسقطوا ، وهذا المعنى هو محل التشبيه لأن الحبل لو تقطع غير ملابس للمرتقى عليه لما كان في ذلك ضر إذ يمسك بالنخلة ويتطلب سبباً آخر ينزل فيه ، ولذلك لم يقل وتقطعت أسبابُهم أو نحوه ، فمن قال إن الباء بمعنى عَن أو للسببية أو التعدية فقد بَعد عن البلاغة ، وبهذه الباء تقوَّم معنى التمثيلية بالصاعد إلى النخلة بحبل وهذا المعنى فائت في قول امرىء القيس: ... تقطَّعَ أسبابُ اللُّبانة والهَوىعَشِيَّةَ جاوَزْنا حَمَاةَ وشَيْزَرَا ...\n\n",
      "translations": [
        {
          "translation": "(When those who were followed) the leaders (disown those who followed (them)) the lowly among people, (and they behold) both the leaders and the lowly (the doom) in the Hereafter, (and all their aims) the pledges and congeniality that were between them in this world (collapse with them). 27\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَتَقَطَّعَتْ بِهِمُ ٱلأَسْبَابُ } معناهُ الأَوْصالُ التي كانتْ بينهم في الدنيا\n وواحدُهَا سَببٌ\n والسَّببُ أَيضاً الحَبْلُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"And the causes between them were severed,\" meaning the ties that were between them in the world.\n \n\n{One of them is a reason.}\n\n\nAnd another reason is the rope.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذ تبرأ } بدل من: إذ يرون العذاب\n أي: وقت رؤيتهم العذاب هو وقت تبرّئ المتبوعين من التابعين مع لزوم كلّ منهم الآخر بمقتضى المحبة التي كانت بينهم لتعذب كلّ منهم بالآخر وتقيده واحتجابه به عن كمالاته ولذاته وانقطاع الأسباب والوصل الموجبة للفوائد والتمتعات التي كانت بينهم في الدنيا من القرابة\n والرحم\n والإلفة\n والعهد\n وسائر المواصلات الدنيوية الجالبة للنفع واللذة\n فإنها تنقطع كلها بانقطاع لوازمها وموجباتها دون المواصلات الخيرية والمحبّات الإلهية المبنية على المناسبة الروحية والتعارف الأزليّ\n فإنها تبقى ببقاء الروح أبداً وتزيد في الآخرة بعد رفع الحجب البدنية لاقتضائها محبة الله المفيدة في الآخرة\n كما قال تعالى:\n \" وجبت محبتي للمتحابين فيّ \" \nوالواو في { ورأوا العذاب } واو الحال\n أي: تبرّؤوا عنهم في حال رؤيتهم العذاب وتقطع الوصل بينهم\n يعني: حال ظهور شرّ المقارنة وتبعتها\n ونفاد خيرها وفائدتها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل وقت { إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ } من الأنداد والأمثال { مِنَ ٱلَّذِينَ ٱتَّبَعُواْ } من المتخذين { وَ } ذلك حين { رَأَوُاْ } المتبوعين { ٱلْعَذَابَ } النازل على تابعيهم باتخاذهم آلهة\n كذبوهم وأظهروا البراءة عنهم براءة نفوسهم { وَ } التابعون أيضاً يرونهم ويفهمون براءتهم ويقصدون انتقامهم ولا يستطيعون\n إذ { تَقَطَّعَتْ بِهِمُ ٱلأَسْبَابُ } [البقرة: 166] أي: أسباب الانتقام بانقطاع النشأة الأولى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:85",
      "similarity": 0.736850520262962
    },
    {
      "verse": "18:89",
      "similarity": 0.7296505335164365
    },
    {
      "verse": "18:92",
      "similarity": 0.7296505335164365
    },
    {
      "verse": "18:84",
      "similarity": 0.5663772907040937
    },
    {
      "verse": "6:108",
      "similarity": 0.5303206866431163
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002166.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002166.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:166.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}