{
  "chapter": "البقرة",
  "text": "ومن الناس من يتخذ من دون الله اندادا يحبونهم كحب الله والذين ءامنوا۟ اشد حبا لله ولو يرى الذين ظلموا۟ اذ يرون العذاب ان القوة لله جميعا وان الله شديد العذاب",
  "translations": [
    {
      "translation": "Some people set up equals to Allah, loving them as they should love Allah. But those who have iman have greater love for Allah. If only you could see those who do wrong at the time when they see the punishment, and that truly all strength belongs to Allah, and that Allah is severe in punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet there are men who take others as compeers of God, and bestow on them love due to God; but the love of the faithful for God is more intense. If only the wicked could see now the agony that they will behold (on the Day of Resurrection), they will know that to God belongs the power entirely'. And the punishment of God is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In spite of such clear signs of the Oneness of Allah), there are people who set up equals and rivals with Allah and adore them with the adoration due to Allah. whereas the Believers adore Allah most ardently. Would that these transgressors could realize now what they will realize, when they will see the chastisement before them that power and authority wholly belong to Allah and that Allah is severe in punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people consider certain things equal to God and love them just as one should love God. However, the strongest of the believers' love is their love of God. Had the unjust been able to reflect about their condition, when facing the torment, they would have had no doubt that to God belongs All-power and that He is stern in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some people create for themselves Gods (objects of worship) other than Allah, with devotion (love) equal to the devotion of Allah; and the believers do not love anybody with love equal to the love of Allah; and what will be their state, when the punishment will be before the eyes of the unjust (disbelievers)? For all power belongs wholly to Allah, and because Allah’s punishment is very severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah. But those who believe, love Allah more (than anything else). If only, those who do wrong could see, when they will see the torment, that all power belongs to Allah and that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are some among men who take for themselves objects of worship besides Allah, whom they love as they love Allah, and those who believe are stronger in love for Allah and O, that those who are unjust had seen, when they see the chastisement, that the power is wholly Allah's and that Allah is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there be men who take to themselves compeers apart from God, loving them as God is loved; but those that believe love God more ardently. O if the evildoers might see, when they see the chastisement, that the power altogether belongs to God, and that God is terrible in chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet of mankind are some who take unto themselves (objects of worship which they set as) rivals to Allah, loving them with a love like (that which is the due) of Allah (only) - those who believe are stauncher in their love for Allah - Oh, that those who do evil had but known, (on the day) when they behold the doom, that power belongeth wholly to Allah, and that Allah is severe in punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are some who set up equals with God and adore them with the adoration due to God, but those who believe love God most. If only the wrongdoers could see, as they will see when they face the punishment, that all power belongs to God, and that God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some that set up compeers; unto Allah they love them as with the love due to Allah. And those who believe are strongest in love of Allah. Would that those who do wrong saw, when they saw the torment, that verily power belonged wholly unto Allah, and that Allah was severe in requital -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people are those who set up compeers besides Allah, loving them as if loving Allah—but the faithful have a more ardent love for Allah—though the wrongdoers will see, when they sight the punishment, that power, altogether, belongs to Allah, and that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are men who take (for worship) others besides Allah, as equal (with Allah): They love them as they should love Allah. But those of Faith are overflowing in their love for Allah. If only the unrighteous could see, behold, they would see the penalty: that to Allah belongs all power, and Allah will strongly enforce the penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah. But those who believe, love Allah more (than anything else). If only, those who do wrong could see, when they will see the torment, that all power belongs to Allah and that Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people are those who take to themselves rivals, other than Allah, loving them as Allah is loved. But those who believe are more loving to Allah. When the harmdoers see when they see the punishment because the power altogether belongs to Allah, and that Allah is firm in punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet among the people are those who take other than God as equals to Him. They love them as the love of God. But those who believe have greater love for God. If only the wrongdoers would realize, when they see the torment; that all power is God’s, and that God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [yet], among the people are those who take other than Allah as equals [to Him]. They love them as they [should] love Allah. But those who believe are stronger in love for Allah. And if only they who have wronged would consider [that] when they see the punishment, [they will be certain] that all power belongs to Allah and that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:165] Yet there be people who take to themselves compeers, idols, besides God, that is, other than God, loving them, by magnifying them and being subservient to them, as God is loved, that is, as their love of Him; but those who believe love God more ardently, than those who love their compeers, because the former never reject God, whereas the latter when faced with hardship soon abandon those [compeers] for God; If he, [if you] O Muhammad (s), were to see those who did evil, by taking to themselves compeers, when (idh here denotes idhā) they see (read either as active [yarawna, ‘they see’] or passive [yurawna, ‘they are made to see’]) the chastisement, you would see a grave sight, that, this is because, the might, the power and the vanquishing, altogether (a circumstantial qualifier) belongs to God, and that God is terrible in chastisement (according to one reading, the person listening [to the verse] governs the verb yarā, ‘he sees’, and constitutes the subject [of the clause]; according to another [reading], it is the ‘evildoers’ [who constitute the subject of the clause and govern the verb yarā]; and so it [yarā] has the sense of ya‘lam, ‘he knows’; the particle an, ‘that’, and what comes after it have taken the place of the objects in both cases; the response to the [initial conditional] law, ‘if’, has been omitted). The general meaning [of the verse] then is: ‘If they were aware in this world of the severity of God’s chastisement and of the fact that power is God’s alone, the moment they come to see it with their own eyes, on the Day of Resurrection, they would not take to themselves compeers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على إن في خلق السموات والأرض { وَمِنَ الناس مَن يَتَّخِذُ مِن دُونِ الله أَندَادًا يُحِبُّونَهُمْ كَحُبِّ الله والذين ءَامَنُواْ أَشَدُّ حُبًّا لِلَّهِ } \\[ البقرة : 164 \\] الخ لأن تلك الجملة تضمنت أن قوماً يعقلون استدلوا بخلق السموات والأرض وما عطف عليه على أن الله واحد فوحدوه ، فناسب أن يعطف عليه شأن الذين لم يهتدوا لذلك فاتخذوا لأنفسهم شركاء مع قيام تلك الدلائل الواضحة ، فهؤلاء الذين اتخذوا من دون الله هم المتحدث عنهم آنفاً بقوله تعالى : { إن الذين كفروا وماتوا وهم كفار } \\[ البقرة : 161 \\] الآيات .وقوله : { ومن الناس } خبر مقدم وقد ذكرنا وجه الإخبار به وفائدة تقديمه عند قوله تعالى : { ومن الناس من يقول أمنا بالله وباليوم الآخر وما هم بمؤمنين } \\[ البقرة : 8 \\] وعطفُه على ذكر دلائل الوحدانية وتقديمُ الخبر وكونُ الخبر { من الناس } مؤذن بأنه تعجبٌ من شأنهم .و { مَنْ } في قوله : { من يتخذ } ما صدْقُها فريق لا فرد بدليل عود الضمير في قوله : { يحبونهم كحب الله } .والمراد بالأنداد الأمثال في الألوهية والعبادة ، وقد مضى الكلام على النِّد بكسر النون عند قوله تعالى : { فلا تجعلوا لله أنداداً وأنتم تعلمون } \\[ البقرة : 22 \\] .وقوله : { من دون الله } معناه مع الله لأن كلمة دون تؤذن بالحيلولة لأنها بمعنى وراء فإذا قالوا اتخذه دون الله فالمعنى أنه أفرده وأعرض عن الله وإذا قالوا اتخذه من دون الله فالمعنى أنه جعله بعض حائل عن الله أي أشركه مع الله لأن الإشراك يستلزم الإعراض عن الله في أوقات الشغل بعبادة ذلك الشريك .وقوله : { من دون الله } خال من ضمير { يتخذ } ، وقوله : { يحبونهم } بدل من { يتخذ } بدل اشتمال ، لأن الاتخاذ يشتمل على المحبة والعبادة ، ويجوز كونه صفة لمَن ، وجوِّز أن يكون صفة لأنداداً لكنه ضعيف لأن فيه إيهام الضمائر لاحتمال أن يفهم أن المحب هم الأنداد يحبون الذين اتخذوهم ، والأظهر أن يكون حالاً من ( مَن ) تفظيعاً لحالهم في هذا الاتخاذ وهو اتخاذ أنداد سووها بالله تعالى في محبتها والاعتقاد فيها .والمراد بالأنداد هنا وفي مواقعه من القرآن ، الأصنام لا الرؤساء كما قيل ، وعاد عليهم ضمير جماعة العقلاء المنصوب في قوله : { يحبونهم } لأن الأصنام لما اعتقدوا ألوهيتها فقد صارت جديرة بضمير العقلاء على أن ذلك مستعمل في العربية ولو بدون هذا التأويل ، والمحبة هنا مستعملة في معناها الحقيقي وهو مَيل النفس إلى الحَسن عندها بمعاينة أو سماع أو حصول نفع محقق أو موهوم لعدم انحصار المحبة في ميل النفس إلى المرئيات خلافاً لبعض أهل اللغة فإن الميل إلى الخُلُق ( بضم الخاء ) الحسن وإلى الفعل الحسن والكمال ، محبة أشد من محبة محاسن الذات فتشترك هذه المعاني في إطلاق اسم المحبة عليها باعتبار الحاصل في النفس وقطع النظر عن سبب حصوله .فالتحقيق أن الحب يتعلق بذِكر المرء وحصول النفععِ منه وحُسْن السمعة وإن لم يره فنحن نحب الله لما نعلمه من صفات كماله ولما يصلنا من نعمته وفضله ورحمته ، ونحب رسوله لما نعلم من كماله ولِما وصل إلينا على يديه ولما نعلم من حرصه على هدينا ونجاتنا ، ونحب أجدادنا ، ونحب أسلافنا من علماء الإسلام ، ونحب الحكماء والمصلحين من الأولين والآخرين ، ولله در أبي مدين في هذا المعنى :وكم من محب قد أحب وما رأى ... وعشق الفتى بالسمع مرتبة أخرىوبضد ذلك كله تكون الكراهية .ومن الناس من زعم أن تعلق المحبة بالله مجاز مرسل في الطاعة والتعظيم بعلاقة اللزوم لأن طاعة المحب للمحبوب لازم عرفي لها قال الجَعْدي :لو كان حبك صادقاً لأطعته ... إن المحب لمن يحب مطيعأو مجاز بالحذف ، والتقدير : يحبون ثواب الله أو نعمته لأن المحبة لا تتعلق بذات الله ، إما لأنها من أنواع الإرادة ، والإرادة لا تتعلق إلا بالجائزات وهو رأى بعض المتكلمين ، وإما لأنها طلب الملائم . واللذة لا تحصل بغير المحسوسات وكلا الدليلين ظاهر الوهن كما بينه الفخر ، وعلى هذا التفصيل بين إطلاقي المحبة هنا يكون التشبيه راجعاً إلى التسوية في القوةومنهم من جعل محبة الله تعالى مجازاً وجعلها في قوله : { يحبونهم } أيضاً مجازاً وعلى ذلك درج في «الكشاف» وكان وجهه أن الأصل في تشبيه اسم بمثله أن يكون تشبيه فرد من الحقيقة بآخر منها . وقد علمت أنه غير متعين . وقوله : { كحب الله } مفيد لمساواة الحبين؛ لأن أصل التشبيه المساواة وإضافة حب إلى اسم الجلالة من الإضافة إلى المفعول فهو بمنزلة الفعل المبني إلى المجهول . فالفاعل المحذوف حذف هنا لقصد التعميم أي كيفما قدرت حب محب لله فحب هؤلاء أندادهم مساو لذلك الحب ، ووجه هذا التعميم أن أحوال المشركين مختلفة ، فمنهم من يعبد الأنداد من الأصنام أو الجن أو الكواكب ويعترف بوجود الله ويسوي بين الأنداد وبينه ، ويسميهم شركاء أو أبناء لله تعالى ، ومنهم من يجعل لله تعالى الإلهية الكبرى ويجعل الأنداد شفعاء إليه ، ومنهم من يقتصر على عبادة الأنداد وينسى الله تعالى قال تعالى : { نسوا فأنساهم أنفسهم } \\[ الحشر : 19 \\] ، ومن هؤلاء صابئة العرب الذين عبدوا الكواكب ، ولله تعالى محبون من غير هؤلاء ومن بعض هؤلاء ، فمحبة هؤلاء أندادهم مساوية لمحبة محبي الله إياه أي مساوية في التفكير في نفوس المحبين من الفريقين فيصح أن تقدر يحبونهم كما يحب أن يحب الله أو يحبونهم كحب الموحدين لله إياه أو يحبونهم كحبهم الله ، وقد سلك كل صورة من هذه التقادير طائفة من المفسرين ، والتحقيق أن المقدر هو القدر المشترك وهو ما قدرناه في أول الكلام .واعلم أن المراد إنكار محبتهم الأنداد من أصلها لا إنكار تسويتها بحب الله تعالى وإنما قيدت بمماثلة محبة الله لتشويهها وللنداء على انحطاط عقول أصحابها وفيه إيقاظ لعيون معظم المشركين وهم الذين زعموا أن الأصنام شفعاء لهم كما كثرت حكاية ذلك عنهم في القرآن فنبهوا إلى أنهم سووا بين محبة التابع ومحبة المتبوع ومحبة المخلوق ومحبة الخالق لعلهم يستفيقون فإذا ذهبوا يبحثون عما تستحقه الأصنام من المحبة وتطلبوا أسباب المحبة وجدوها مفقودة كما قال إبراهيم عليه السلام :{ بَأَبَتتِ لم تعبد ما لا يسمع ولا يُبصر ولا يغني عنك شيئاً } \\[ مريم : 42 \\] مع ما في هذه الحال من زيادة موجب الإنكار .وقوله : { والذين أمنوا أشد حباً لله } أي أشد حبّاً لله من محبة أصحاب الأنداد أندادهم ، على ما بلغوا من التصلب فيها ، ومن محبة بعضهم لله ممن يعترف بالله مع الأنداد ، لأن محبة جميع هؤلاء المحبين وإن بلغوا ما بلغوا من التصلب في محبوبيهم لمَّا كانت محبة مجردة عن الحجة لا تبلغ مبلغ أصحاب الاعتقاد الصميم المعضود بالبرهان ، ولأن إيمانهم بهم لأغراض عاجلة كقضاء الحاجات ودفع الملمات بخلاف حب المؤمنين لله فإنه حب لذاته وكونِه أهلاً للحب ثم يتبع ذلك أغراض أعظمها الأغراض الآجلة لرفع الدرجات وتزكية النفس .والمقصود تنقيص المشركين حتى في إيمانهم بآلهتهم فكثيراً ما كانوا يُعرضون عنها إذا لم يجدوا منها ما أمَّلوه . فمورد التسوية بين المحبتين التي دل عليها التشبيه مخالف لمورد التفضيل الذي دل عليه اسم التفضيل هنا ، لأن التسوية ناظرة إلى فرط المحبة وقت خطورها ، والتفضيل ناظر إلى رسوخ المحبة وعدم تزلزلها ، وهذا مأخوذ من كلام «الكشاف» ومصرح به في كلام البيضاوي مع زيادة تحريره ، وهذا يغنيك عن احتمالات وتمحلات عرضت هنا لبعض المفسرين وبعض شراح «الكشاف» .روي أن امرأَ القيس لما أراد قتال بني أسد حين قتلوا أباه حُجْراً ملكَهم مر على ذي الخُلَصة الصَّنم الذي كان بتَبَالَة بين مكة واليَمننِ فاستقسم بالأزلام التي كانت عند الصَّنم فخرج له القدح الناهي ثلاث مرات ( ) فكَسَر تلك القِداح ورمى بها وجه الصَّنم وشتمه وأنشد :لو كنتَ ياذَا الخلص المَوْتُورا ... مِثلي وكانَ شيخك المقبورالم تَنْه عن قتل العُداة زورَا ... ثم قصد بني أسد فظفِر بهم .ورُوي أن رجلاً من بني مَلْكَان جاء إلى سَعْد الصَّنم بساحل جُدَّةَ وكان معه إبل فنفرت إبله لما رأت الصَّنم ( ) فغضب المَلْكاني على الصَّنم ورماه بحجَر وقال :أتينَا إلى سَعْد ليَجْمَع شملنا ... فشتَّتنَا سَعْد فما نَحْنُ من سَعْدوهلْ سَعْدٌ إلاَّ صَخْرَةٌ بتَنَوفَة ... من الأرض لا تدعو لِغيَ ولا رُشدوإنما جيء بأفعل التفضيل بواسطة كلمة { أشد } قال التفتزاني : آثر { أشدُّ حباً } على أحَبُّ لأن أحب شاع في تفضيل المحبوب على محبوب آخر تقول : هو أحب إلي ، وفي القرآن : { قل إن كان أباءكم وأبناءكم وإخوانكم وأزواجكم وعشيرتكم وأموال اقترفتموها وتجارة تخشون كسادها ومساكن ترضونها أحب إليكم من الله ورسوله }\\[ التوبة : 24 \\] الخ . يعني أن فعل أحب هو الشائع وفعل حب قليل فلذلك خصوا في الاستعمال كلاً بمواقع نفياً للبس فقالوا : أحب وهو محب وأشد حباً وقالوا حبيب من حب وأحب إلى من حب أيضاً .عطف على قوله : { ومن الناس من يتخذ } وذلك أن قوله ذلك لما كان شرحاً لحال ضلالهم الفظيع في الدنيا من اتخاذ الأنداد لله مع ظهور أدلة وحدانيته حتى كان قوله : { ومن الناس } مؤذناً بالتعجيب من حالهم كما قدمنا ، وزيد في شناعته أنهم اتخذوا لله أنداداً وأحبوها كحبه ، ناسب أن ينتقل من ذلك أي ذكر عاقبتهم من هذا الصنيع ووصف فظاعة حالهم في الآخرة كما فظع حالهم في الدنيا .قرأ نافع وابن عامر ويعقوب { ولو يرى } بتاء فوقية وهو خطاب لغير معين يعم كل من يسمع هذا الخطاب ، وذلك لتناهي حالهم في الفظاعة والسوء ، حتى لو حضرها الناس لظهرت لجميعهم ويجوز أن يكون الخطاب للنبيء صلى الله عليه وسلم ( فالذين ظلموا ) مفعول ( ترى ) على المعنيين ، و ( إذ ) ظرف زمان ، والرؤية بصرية في الأول والثاني لتعلقها في الموضعين بالمرئيات ، ولأن ذلك مورد المعنى ، إلاّ أن وقت الرؤيتين مختلف ، إذ المعنى لو تراهم الآن حين يرون العذاب يوم القيامة ، أي لو ترى الآن حالهم ، وقرأه الجمهور { يرى الذين ظلموا بالتحتية فيكون الذين ظلموا } فاعل { يرى } والمعنى أيضاً لو يرون الآن ، وحذف مفعول { يرى } لدلالة المقام ، تقديره لو يرون عذابهم أو لو يرون أنفسهم أو يكون ( إذ ) اسماً غير ظرف أي لو ينظرون الآن ذلك الوقت فيكون بدل اشتمال من { الذين ظلموا } .و { الذين ظلموا } هم الذين اتخذوا من دون الله أنداداً فهو من الإظهار في مقام الإضمار ليكون شاملاً لهؤلاء المشركين وغيرهم ، وجعل اتخاذهم الأنداد ظلماً لأنه اعتداء على عدة حقوق فقد اعتدوا على حق الله تعالى من وجوب توحيده ، واعتدوا على من جعلوهم أنداداً لله على العقلاء منهم مثل الملائكة وعيسى ، ومثل ود وسواع ويغوث ويعوق ونسر ، فقد ورد في «الصحيح» عن ابن عباس أنهم كانوا رجالاً صالحين من قوم نوح فلما ماتوا اتخذ قومهم لهم تماثيل ثم عبدوها ، ومثل ( اللات ) يزعم العرب أنه رجل كان يلت السويق للحجيج وأن أصله اللات بتشديد التاء ، فبذلك ظلموهم إذ كانوا سبباً لهول يحصل لهم من السؤال يوم القيامة كما قال الله تعالى : { وإذ قال الله يا عيسى ابن مريم أأنت قلت للناس اتخذوني وأمي إلهين من دون الله } \\[ المائدة : 116 \\] وقال : { ويوم يحشرهم جميعاً ثم يقول للملائكة أهوؤلاء إياكم كانوا يعبدون } \\[ سبأ : 40 \\] الآية وقال : { ويوم يحشرهم وما يعبدون من دون الله فيقول أأنتم أضللتم عبادي هئلاء أم هم ضلوا السبيل }\\[ الفرقان : 17 \\] الآية ، وظلموا أنفسهم في ذلك بتعريضها للسخرية في الدنيا وللعذاب في الآخرة وظلموا أعقابهم وقومهم الذين يتبعونهم في هذا الضلال فتمضي عليه العصور والأجيال ، ولذلك حذف مفعول { ظلموا } لقصد التعميم ، ولك أن تجعل { ظلموا } بمعنى أشركوا كما هو الشائع في القرآن قال تعالى عن لقمان : { إن الشرك لظلم عظيم } \\[ لقمان : 13 \\] وعليه فالفعل منزَّل منزلة اللازم لأنه صار كاللقب .وجملة : { والذين أمنوا أشد حباً لله } معترضة والغرض منها التنويه بشأن الذين آمنوا بأن حبهم لله صار أشد من حبهم الأنداد التي كانوا يعبدونها وهذا كقول عُمر بن الخطاب للنبيء صلى الله عليه وسلم \" لأنت أَحب إليّ من نفسي التي بين جنبيّ \" .وتركيب { لو ترى } وما أشبهه نحو لو رأيتَ من التراكيب التي جرت مجرى المثل فبنيت على الاختصار وقد تكرر وقوعها في القرآن .وجواب { لو } محذوف لقصد التفخيم وتهويل الأمر لتذهب النفس في تصويره كل مذهب ممكن ونظيره { ولو ترى إذ الظالمون في غمَرَات الموت } \\[ الأنعام : 93 \\] { ولو ترى إذ وقفوا على النار } \\[ الأنعام : 27 \\] { ولو أن قرءاناً سيرت به الجبال } \\[ الرعد : 31 \\] ، قال المرزوقي عند قول الشَّمَيْذَرِ الحارثي :وقد ساءني ما جرَّتتِ الحرب بيننا ... بنِي عَمِّنا لو كان أمراً مُدَانِيا«حَذْفُ الجواب في مثل هاته المواضع أبلغ وأدل على المراد بدليل أن السيد إذا قال لعبده لئن قمتُ إليك ثم سكتَ تزاحم على العبد من الظنون المعترضة للتوعد ما لا يتزاحم لو نص على ضرببٍ من العذاب» ، والتقدير على قراءة نافع وابن عامر لرأيتَ أمراًعظيماً وعلى قراءة الجمهور لرأوا أمراً عظيماً .وقوله : { أن القوة } قرأَه الجمهور بفتح همزة أَنَّ وهو بدل اشتمال من { العذاب } أو من { الذين ظلموا } فإن ذلك العذاب من أحوالهم ، ولا يضر الفصل بين المبدل منه والبدل لطول البدل ، ويجوز أن يكون على حذف لام التعليل والتقدير لأن القوة لله جميعاً والتعليل بمضمون الجواب المقدر أي لرأيت ما هو هائل لأنه عذاب الله ولله القوة جميعاً .{ وجميعاً } استعمل في الكثرة والشدة فقوة غيره كالعدم وهذا كاستعمال ألفاظ الكثرة في معنى القوة وألفاظ القلة في معنى الوهن كما في قول تأبط شراً :قليلُ التشكي للمُلِمِّ يصيبُه ... كثيرُ الهوى شتَّى النَّوى والمسالكأراد شديد الغرام .وقرأه أبو جعفر ويعقوب { إِن القوة } بكسر الهمزة على الاستئناف البياني كأن سائلاً قال : ماذا أرى وما هذا التهويل؟ فقيل : إن القوة ولا يصح كونها حينئذٍ للتعليل التي تغني غناء الفاء كما هي في قول بشار :إن ذاك النجاح في التبْكير ... لأن ذلك يكون في مواقع احتياج ما قبلها للتعليل حتى تكون صريحة فيه .وقرأ ابن عامر وحده { إذ يرون العذاب } بضم الياء أي إذ يريهم الله العذاب في معنى قوله : { كذلك يريهم الله أعمالهم حسرات } \\[ البقرة : 167 \\] .وانتصب ( جميعاً ) على التوكيد لِقوله ( القوة ) أي جميع جنس القوة ثابت لله ، وهو مبالغة لعدم الاعتداد بقوة غيره فمفاد جميع هنا مفاد لام الاستغراق في قوله{ الحمد لله } \\[ الفاتحة : 2 \\] .وقد جاء ( لو ) في مثل هذا التركيب بشرط مضارع ووقع في كلام الجمهور من النحاة أن لو للشرط في الماضي وأن المضارع إذا وقع شرطاً لها يُصرف إلى معنى الماضي إذا أريد استحضار حالة ماضية وأما إذا كان المضارع بعدها متعيناً للمستقبل فأوَّلَه الجمهور بالماضي في جميع مواقعه وتكلفوا في كثير منها كما وقع لصاحب «المفتاح» ، وذهب المبرد وبعض الكوفيين إلى أن لو حْرف بالمعنى إِنْ لمجرد التعليق لا للامتناع ، وذهب ابن مالك في «التسهيل» و«الخلاصة» إلى أن ذلك جائز لكنه قليل وهو يريد القلة النسبية بالنسبة لوقوع الماضي وإلاّ فهو وارد في القرآن وفصيح العربية .والتحقيق أن الامتناع الذي تفيده ( لو ) متفاوت المعنى ومرجعه إلى أن شرطها وجوابها مفروضان فرضاً وغير مقصود حصول الشرط فقد يكون ممكن الحصول وقد يكون متعذراً ولذلك كان الأولى أن يعبر بالانتفاء دون الامتناع لأن الامتناع يوهم أنه غير ممكن الحصول فأما الانتفاء فأعم ، وأن كون الفعل بعدها ماضياً أو مضارعاً ليس لمراعاة مقدار الامتناع ولكن ذلك لمقاصد أخرى مختلفة بالاختلاف مفاد الفعلين في مواقعها في الشروط وغيرها ، إذ كثيراً ما يراد تعليق الشرط بلو في المستقبل نحو قول توبة :ولو تلتقِي أصداؤنا بعد موتنا ... ومِنْ بين رَمْسينا من الأرض سَبسبُلظل صدَى صوتي وإن كنتُ رِمَّةً ... لصوت صدى ليلى يهشُّ ويَطْرَبُفإنه صريح في المستقبل ومثله هذه الآية .\n\n",
      "translations": [
        {
          "translation": "Allah mentions after this the unbelievers' love for their objects of worship in this world, and how they disown each other in the Hereafter, saying: (Yet of mankind) i.e. the unbelievers (are some who take unto themselves) who worship (rivals to Allah) idols, (loving them with a love like (that which is the due) of Allah) like the love that sincere believers have for Allah (-Those who believe are stauncher) more lasting (in their love for Allah) than are the unbelievers vis-a-vis their idols; it is also said that this verse was revealed about the hypocrites who buried their gold and silver or hid it in caves; and it is also said that this means: they took their leaders as gods (-that those who do evil had but known) if only the idolaters knew, (when they behold the doom) on the Day of Judgement, (that power) and might and invincibility (belongeth wholly to Allah, and that Allah is severe in punishment!) in the Hereafter-if they knew this, they would certainly have believed in this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوۤاْ } معناهُ يَعلَمُ وليسَ برؤيا عينٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd if those who have wronged could see {the consequences of their actions}, they would know {exactly what they are facing}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ ومن الناس من يَتَخذ من دون الله أنداداً يحبونهم كحبّ الله } أي: من يعبد من دون الله أشياء إمّا أناسيّ من جنسهم كالأزواج، والأولاد، والآباء، والأجداد، والإخوان، والأحباب، والرؤساء، والملوك، وغيرهم. وإمّا غير أناسيّ كالحيوانات، والجمادات، وسائر أموالهم، بالإقبال عليهم والتوجه نحوهم، ومراعاتهم، وحفظهم، والاهتمام بهم وبحالهم، والتفكّر في بابهم، يحبونهم كحب الله، أي: كما يجب أن يحب الله، فتكون تلك الأشياء عندهم مساوية في المحبة مع الله فتكون أنداداً أو شركاء لله بالنسبة إليهم، أو تكون هي محبوباتهم ومعبوداتهم لا غير، فهي آلهتهم كما أن الله إله الخلق فهم جعلوا لأنفسهم آلهة أنداداً لإله سائر الخلق، إله العالمين. { والذين آمَنُوا أشدّ حباً لله } من غيره لأنهم لا يحبون إلا الله، لا يختلط حبهم له بحب غيره ولا يتغير، ويحبون الأشياء بمحبة الله ولله، وبقدر ما يجدون فيها من الجهة الإلهية كما قال بعضهم: \" الحق حبيبنا، والخلق حبيبنا وإذا اختلفا فالحق أحبّ إلينا \" أي: إذا لم تبق جهة الإلهية فيهم بمخالفتهم إياه لم تبق محبتنا لهم، أو أشدّ حباً من محبتهم لآلهتهم لأنهم يحبون الأشياء بأنفسهم لأنفسهم، فلا جرم تتغير محبتهم بتغيير إعراض النفوس أنفسهم عند خوف الهلاك ومضرّة النفس عليهم والمؤمنون يحبون الله بأرواحهم وقلوبهم، بل بالله لله، لا تتغير محبتهم لكونها لا لغرض، ويبذلون أرواحهم وأنفسهم لوجهه ورضاه، ويتركون جميع مراداتهم لمراده ويحبون أفعاله وإن كانت بخلاف هواهم، كما قال أحدهم:\n{ ولو يرى الذينَ ظَلَموا } أي: أشركوا بمحبة الإنذار في وقت رؤيتهم عذاب الاحتجاب بآلهتهم { أن القوّة لله } أي: القدرة كلها لله ليس لآلهتهم شيء منها، وشدّة عذاب الله بقرنهم بآلهتهم في نار الحرمان بالسلاسل النارية المستفاد من محبتهم إياها، لكان ما لا يدخل تحت الوصف ولهذا المعنى حذف جواب لو.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وشروق المكاشفات العينية الدالة على وحدة الذات { مِنَ ٱلنَّاسِ } المخلوقين على فطرة التوحيد القابلين لها { مَن يَتَّخِذُ } منهم جهلاً وعناداً { مِن دُونِ ٱللَّهِ } المعني للكثرة مطلقاً { أَندَاداً } أمثالاً أحقاء للألوهية والربوبية مستحقين للعابدة إلى حيث { يُحِبُّونَهُمْ } أي: كلاً منه معبودهم { كَحُبِّ ٱللَّهِ } الجامع للكل لحصر كل طائفة منهم مرتبة للألوهية في مظهرٍ مخصوصٍ\n ولذلك كفروا { وَٱلَّذِينَ آمَنُواْ } بالله { أَشَدُّ حُبّاً } منهم { للَّهِ } المحيط للكل الحقيق بالحقية\n لحصرهم الألوهية والربوبية والتحقق والوجود والهوية\n والذات والحقيقة والصفات على الله لا على غيره\n إذ لا غير في الوجود\n لا إله إلا هو\n كل شيء هالك إلا وجهه\n له الحكم في النشأةالأولى\n وإليه الرجوع في النشأة الأخرى\n\nأذقنا حلاوة اليقين وارزقنا محبة المؤمنين الموقنين\n\n\n{ وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوۤاْ } حين خرجوا عن طريق التوحيد\n وانصرفوا عن الصراط المستقيم واتخذوا أمثالاً يحبونهم كحب الله ما يرون حين { إِذْ يَرَوْنَ ٱلْعَذَابَ } النازل عليهم باتخاذهم من { أَنَّ ٱلْقُوَّةَ } الكاملة والقدرة الشاملة الجامعة { للَّهِ جَمِيعاً } المنفرد بالمجد وإليها { وَ } من { أَنَّ ٱللَّهَ } المتردي برداء العظمة والكبرياء { شَدِيدُ ٱلْعَذَابِ } [البقرة: 165] صعب الانتقام\n سريع الحساب\n لتبرءوا من متبوعهم في الدنيا كما تبرءوا منهم في الآخرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَاداً يُحِبُّونَهُمْ كَحُبِّ ٱللَّهِ وَٱلَّذِينَ آمَنُواْ أَشَدُّ حُبّاً للَّهِ\n\n\n }  قلت: ويُحتمل في وجه المناسبة\n أن يكون الحق تعالى لمّا ذكر دلائل التوحيد ذكّر من أعرض بعد وضوحها فأشرك معه\n ليرتب بعد ذلك ما أعدَّ له من العذاب\n والأنداد: جمع نِدْ وهو المِثْل\n والمراد هنا الأصنام أو الرؤساء\n والإضافة في { كحُب الله } من إضافة المصدر إلى مفعوله\n والحُب: ميل القلب إلى المحبوب\n وسأتي في الإشارة إن شاء الله\n يقول الحقّ جلّ جلاله: { ومن الناس من يتخذ من دون الله } أشباهاً وأمثالاً من الأصنام والرؤساء { يحبونهم } \n وينقادون إليهم\n كما يحبون الله تعالى\n فيُسَوَّون في المحبة بين الله تعالى العلي الكبير\n وبين المصنوع الذليل الحقير\n { والذين آمنوا } بالله ووحَّدُوه { أشد حبّاً لله } لأن المؤمنين لا يلتفتون عن حبوبهم في الشدة ولا في الرخاء\n بخلاف الكفار فإنهم يعبدونهم في وقت الرخاء\n فإذا نزل البلاء التجؤوا إلى الله\n قال تعالى:\n[النّحل: 53] الآية\n وأيضاً: المؤمنون يعبدون الله بلا واسطة\n والكفار يعبدونه بواسطة أصنامهم\n[الزمر: 3] وأيضاً المؤمنونن يعبدون ربّاً واحداً فاتحدت مبحتهم\n قال سعيد بن جبير: إن الله تعالى يأمر يوم القيامة مَنْ عبد الأصنام أن يدخلوا النار مع أصنامهم\n فيمتنعون لعلمهم بالخلود فيها\n ثم يقول للمؤمنين بين يدي الكفار: إن كنتم أحبائي فادخلوا\n فيقتحم المؤمنون النار\n وينادي مُنَأدٍ مِنْ تحت العرش: { والذين آمناو أشد حبّاً لله }\n وفي ذلك يقول ابن الفارض:\nوقال أيضاً:\nوقال آخر:\nالإشارة: المحبةُ: مَيلٌ دائم بقلب هائم\n أو مراقبة الحبيب في المشهد والمغيب\n أو مواطأةُ القلب لمراد الرب\n أو خوف ترك الخدْمة مع إقامة الحُرْمة\n أو اسْتِقْلالُ الكثير من نفسك واستكثارُ القليل مِنْ حبيبك\n أو معانقة الطاعة ومباينة المخالفة\n وقال الشِّبْلِي: أن تَغَار على المحبوب أن يحبه مثلك والمحب على الحقيقة من لا سلطان على قلبه لغير محبوبه\n ولا مشيئة له غير مشيئته\n وقال الشيخ أبو الحسن رضي الله عنه: المحبة أخْذَةٌ من الله لقلب عبده المؤمن عن كل شيء سواه\n فترى النفس مائلة لطاعته\n والعقل متحصّناً بمعروفه\n والروح مأخوذة في حضرته\n والسر مغموراً في مشاهدته\n والعبد يستزيد من محبته فيزداد\n ويفاتح بما هو أعذب من لذيذ مناجاته\n فيكسي حلل التقريب على بساط القربة\n ويَمَسُّ أبكارَ الحقائق وثيبات العلوم\n فمن أجل ذلك قالوا: أولياء الله عرائس\n ولا يَرَى العرائسَ المجرمون\n\n\n\n الخ كلامه\n واعلم أن محبة العبد لمولاه سببُها شيئان: أحدهُما: نظر العبد لإحسان الله إليه وضروب امتنانه عليه\n وجُبِلَت القلوبُ على حب من أحسن إليها\n وهذا هو المسمى بحب الهوى\n هو مكتسب\n لأن الإنسان مغمور بإحسانات الله إليه\n ومتمكن من النظر فيها\n فكلما طالَع منةً مِنْ مِنَن الله التي لا تقبل الحصر ولا العدَّ\nكان ذلك كحَبة زُرعت في أرض قلبه الطيب الزكي\n فلا يزال يطالع مِنّةً بعد منّة\n وكلُّ منّة أعظم من التي قبلها\n لأنه كلما طالع المنن تنوّر قلبه وزداد إيماناً\n وكشف من دقائق المنن ما لم يكن يُكشف له قبلُ\n وظهر له خفايا المنن\n وعظمت محبته\n  الثاني: كشْف الحجب\n وإزالة الموانع عن ناظر القلب\n حتى يرى جمال الحقّ وكماله\n والجمال محبوب بالطبع\n وهذان هما اللذان قصدت رابعة العدوية - رضي الله عنها -:\nوإنما خَصَّصَتْ الحُبَّ الناشئ عن شهود الجمال بالأهلية دون الأول\n وإن كان أهلاً للجميع لأن هذا منه إليه\n لا كسب للعبد فيه\n والآخر فيه كسب\n وعمل العبد معلول\n وقولها: فشغلي بذكر عمن سواك من باب التعبير بالمسبب عن السبب\n والأصل: فثمرته شغلي بذكرك عمن سواك\n فهو مسبب عن المحبة لأنفسنا\n وقولها أيضاً كشفك للحجب حتى أراك\n من باب التعبير بالسبب عن المسبب\n والأصل\n فبسببه كشفك للحجب حتى رأيتك بعينَيْ قلبي\n وقولها: فلا الحمد\n\n\n الخ\n إخبار منها بأن الحُبَّيْن معاً منه وإليه وبه في الحقيقة\n لا كسب لها في واحد منهما باعتبار الحقيقة\n بل هو الحامد والمحمود\n وإدراك التفاوت بين المقامين\n - أعْني بين المحبة الناشئة عن شهود الإحسان\n والناشئة عن شهود الجمال - ضروري عند كل ذائق\n وأن الثانية أقوى\n قاله في شرح الشريشية\n قال ابن جُزَيّ: اعلم أن محبة العبد لربه على درجتين أحدهما: المحبة العامة\n التي لا يخلو منها كل مؤمن\n وهي واجبة\n والأخرى: المحبة الخاصة التي ينفرد فيها العلماء الربَّانيون\n والأولياء والأصفياء\n وهي أعلى المقامات\n وغاية المطلوبات\n فإنَّ سائر مقامات الصالحين: كالخوف والرجاء والتوكل\n وغير ذلك\n مَبْنِيَةٌ على حظوظ النفس\n ألا ترى أن الخائف إنما يخاف على نفسه\n والراجي إنما يرجوا منفعة نفسه\n بخلاف المحبة\n فإنها من أجل المحبوب فليست من المعاوضة\n واعلم أن سببَ محبةِ الله: معرفتُه\n فتقوى المحبة على قدر المعرفة\n وتضعف على قدر ضعف المعرفة\n فإن الموجب للمحبة أحد أمرين أو كلاهما إذا اجتمعا\n ولا شك أنهما اجتمعا في حق الله تعالى على غاية الكمال فالموجب الأول: الحسن والجمال\n والآخر الإحسان والإجمال\n فأما الجمال فهو محبوب بالطبع\n فإن الإنسان بالضرورة يجب كل ما يُستحسن\n ولا جمالَ مثلُ جمال الله تعالى\n في حكمته البالغة وصنائعه البديعة\n وصفاته الجميلة الساطعة الأنوار\n التي تَرُوق العقول وتبهج القلوب\n وإنما يُدْرَك جمالُه تعالى بالبصائر لا بالأبصار\n\nوأما الإحسان فقد جبلت القلوب على حب من أحسن إليها\n وإحسان الله إلى عباده متواتر\n وإنعامُه عليهم باطن وظاهر\n\n[إبراهيم: 34]\n ويكفيك أنه يُحسن إلى المطيع والعاصي\n وإلا المؤمن والكافر\n وكل إحسان ينبس إلى غيره فهو في الحقيقة منه وحدَه\n فهو المستحق للمحبة وحده\n واعلم أن محبة الله إذا تمكنت من القلب ظهرت آثارها على الجوارح\n من الجد في طاعته\n والنَّشَطِ لخدمته\n والحرص على مرضاته والتلذذ بمناجاته\n والرضا بقضائه\n والشوق إلى لقائه\n والأُنْس بذكره\n والاسْتِيحَاش مِنْ غيره\n والفرار من الناس\n والانفراد في الخلوات\n وخروج الدنيا من القلب\n ومحبة كل ما يحب الله\n وكل من يحب الله\n وإيثار الله على كل ما سواه\n قال الحارث المحاسبي: المحبة ميلك إلى المحبوب بِكُلِّيتِكَ\n ثم إيثارك له على نفسك ورُوحك\n ثم موافقته سرّاً وجهراً\n ثم علمك بتقصيرك في حبه\n قلت: ظاهره أن المحبة أعلى من المعرفة\n والتحقيق أن المعرفة أعلى من جميع المقامات لأنها لا تبقى معها بقية من الحجاب أصلاً\n بخلاف المحبة\n فإنها تكون بقية الحجاب\n ألا ترى أن المحب يستوحش من الخلق\n والعارف لا يستوحش من شيء لمعرفته في كل شيء\n قال في الحِكَم: \" إنما استوحشَ العُبَّاد والزهاد من كل شيء لغيبتهم عن الله في كل شيء\n ولو عرفوا الله في كل شيء ما استوحشوا من شيء \"\n وأيضاً\n العارف أكمل أدباً من المحب لأن المعرفة إنما تحصُل بعد كمال التهذيب والتدريب\n وقد تحصل المحبة قبل كمال التهذيب\n مع أن المعرفة هي غاية المحبة ونهايتها\n والله تعالى أعلم\n ثم ذكر الحقّ وعيدَ مَنْ أشرك مع الله في عبادته أو محبته\n بعد وضوح برهان وحدانيته\n فقال: {\n\n\nوَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوۤاْ إِذْ يَرَوْنَ ٱلْعَذَابَ أَنَّ ٱلْقُوَّةَ للَّهِ جَمِيعاً وَأَنَّ ٱللَّهَ شَدِيدُ ٱلْعَذَابِ إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلْعَذَابَ وَتَقَطَّعَتْ بِهِمُ ٱلأَسْبَابُ وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوْ أَنَّ لَنَا كَرَّةً فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُواْ مِنَّا كَذَلِكَ يُرِيهِمُ ٱللَّهُ أَعْمَالَهُمْ حَسَرَاتٍ عَلَيْهِمْ وَمَا هُم بِخَارِجِينَ مِنَ ٱلنَّارِ }\n  قلت: { لو } شرطية\n و { ترى } شرطها\n قرأ نافع وابن عامر ويعقوب بالخطاب للنبيّ صلى الله عليه وسلم أو لكل سامع\n والباقون بالغيب وإسناده إلى الظالم\n لأنه المقصود بالوعيد والتهديد\n و { إذ } ظرف للرؤية\n وموضع { يرون } خفض بالإضافة\n قرأ ابن عامر بضم الياء\n على البناء للمفعول\n والفاعلُ الحقيقي هو الله تعالى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:9",
      "similarity": 0.7399741529910678
    },
    {
      "verse": "14:30",
      "similarity": 0.661062601660301
    },
    {
      "verse": "2:22",
      "similarity": 0.4838333226657475
    },
    {
      "verse": "39:8",
      "similarity": 0.42344433766007716
    },
    {
      "verse": "34:33",
      "similarity": 0.3804223432784642
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002165.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002165.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:165.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}