{
  "chapter": "البقرة",
  "text": "او۟لئك الذين اشتروا۟ الضللة بالهدى فما ربحت تجرتهم وما كانوا۟ مهتدين",
  "translations": [
    {
      "translation": "Those are the people who have sold guidance for misguidance. Their trade has brought no profit; they are not guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are indeed those who bartered away good guidance for error and gained nothing from the deal, nor found the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who have bartered away Guidance for error, but this is a profitless bargain that they have made, and they are not at all on the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have traded guidance for error, but their bargain has had no profit and they have missed the true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who purchased error in exchange of guidance – so their bargain did not profit them, and they did not know how to trade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have purchased error with guidance, so their commerce was profitless. And they were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who buy error for the right direction, so their bargain shall bring no gain, nor are they the followers of the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that have bought error at the price of guidance, and their commerce has not profited them, and they are not right-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who purchase error at the price of guidance, so their commerce doth not prosper, neither are they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are those who have taken misguidance in exchange for guidance; but their bargain does not profit them, nor have they found true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who purchased error for guidance, but their traffic profited not, nor have they ever become guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who bought error for guidance, so their trade did not profit them, nor were they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have bartered Guidance for error: But their traffic is profitless, and they have lost true direction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have purchased error for guidance, so their commerce was profitless. And they were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are those who barter away guidance for error, their trade did not profit (them), nor are they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who have bartered error for guidance; but their trade does not profit them, and they are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who have purchased error [in exchange] for guidance, so their transaction has brought no profit, nor were they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:16] Those are they who have bought error for guidance, that is, they have exchanged the latter for the former; so their commerce has not profited them, that is to say, they have gained nothing from it, indeed, they have lost, because their destination is the Fire, made everlasting for them; nor are they guided, in what they did.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالإشارة إلى من يقول { آمنا بالله وباليوم الآخر } \\[ البقرة : 8 \\] وما عطف على صلته من صفاتهم وجىء باسم إشارة الجمع لأن ما صدق «من» هو فريق من الناس ، وفصلت الجملة عن التي قبلها لتفيد تقرير معنى : { ويمدهم في طغيانهم يعمهون } \\[ البقرة : 15 \\] فمضمونها بمنزلة التوكيد ، وذلك مما يقتضي الفصل ، ولتفيد تعليل مضمون جملة { ويمدهم في طغيانهم يعمهون } فتكون استئنافاً بيانياً لسائل عن العلة ، وهي أيضاً فذلكة للجمل السابقة الشارحة لأحوالهم وشأن الفذلكة عدم العطف كقوله تعالى : { تلك عشرة كاملة } \\[ البقرة : 196 \\] ، وكل هذه الاعتبارات مقتض لعدم العطف ففيها ثلاثة موجبات للفصل .وموقع هذه الجملة من نظم الكلام مقابل موقع جملة { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] ومقابل موقع جملة { ختم الله على قلوبهم } \\[ البقرة : 7 \\] الآية .واسم الإشارة هنا غير مشار به إلى ذوات ولكن إلى صنف اجتمعت فيهم الصفات الماضية فانكشفت أحوالهم حتى صاروا كالحاضرين تجاه السامع بحيث يشار إليهم وهذا استعمال كثير الورود في الكلام البليغ . وليس في هذه الإشارة إشعار ببعد أو قرب حتى تفيد تحقيراً ناشئاً عن البعد لأن هذا من أسماء الإشارة الغالبة في كلام العرب فلا عدول فيها حتى يكون العدول لمقصد كما تقدم في قوله تعالى : { ذلك الكتاب } \\[ البقرة : 2 \\] ولأن المشار إليه هنا غير محسوس حتى يكون له مرتبة معينة فيكون العدول عن لفظها لقصد معنى ثان فإن قوله تعالى : { ذلك الكتاب } مع قرب الكتاب للناطق بآياته عدول عن إشارة القريب إلى البعيد فأفاد التعظيم . وعكس هذا قول قيس بن الخطيم :متى يأتتِ هذا الموتُ لا يُلْففِ حاجة ... لنفسي إلا قد قضيت قضاءهافإن الموت بعيد عنه فحقه أن يشير إليه باسم البعيد ، وعدل عنه إلى إشارة القريب لإظهار استخفافه به .والاشتراء افتعال من الشري وفعله شرى الذي هو بمعنى باع كما أن اشترى بمعنى ابتاع فاشترى وابتاع كلاهما مطاوع لفعله المجرد أشار أهل اللسان إلى أن فاعل هذه المطاوعة هو الذي قبل الفعل والتزمه فدلوا بذلك على أنه آخذ شيئاً لرغبة فيه ، ولما كان معنى البيع مقتضياً آخذين وباذلين كان كل منهما بائعاً ومبتاعاً باختلاف الاعتبار ، ففعل باع منظور فيه ابتداء إلى معنى البذل والفعل ابتاع منظور فيه ابتداء إلى معنى الأخذ فإن اعتبره المتكلم آخذاً لما صار بيده عَبَّر عنه بمبتاع ومشتر ، وإن اعتبره باذلاً لما خرج من يده من العوض ، عَبَّر عنه ببائع وشار ، وبهذا يكون الفعلان جاريين على سَنَن واحد ، وقد ذكر كثير من اللغويين أن شرى يستعمل بمعنى اشترى والذي جرَّأهم على ذلك سوء التأمل في قوله تعالى : { وشَرَوْه بثمن بخس دراهمَ معدودةٍ } \\[ يوسف : 20 \\] فتوهموا الضمير عائداً إلى المصريين مع أن معاده واضح قريب وهو سيارة من قوله تعالى :{ وجاءت سيارة } \\[ يوسف : 19 \\] أي باعوه ، وحسبك شاهداً على ذلك قوله : { وكانوا فيه من الزاهدين } \\[ يوسف : 20 \\] أما الذي اشتراه فهو فيه من الراغبين ألا ترى إلى قوله لامرأته : { أكرمي مثواه } \\[ يوسف : 21 \\] .وعلى ذينك الاعتبارين في فعلي الشراء والبيع كانت تعديتهما إلى المفعول فهما يتعديان إلى المقصود الأصلي بأنفسهما وإلى غيره بالباء فيقال باع فرسه بألف وابتاع فرس فلان بألف لأن الفرس هو الذي كانت المعاقدة لأجله لأن الذي أخرجه ليبيعه علم أن الناس يرغبون فيه والذي جاء ليشتريه كذلك .وإطلاق الاشتراء ههنا مجاز مرسل بعلاقة اللزوم ، أطلق الاشتراء على لازمه الثاني وهو الحرص على شيء والزهد في ضده أي حَرَصوا على الضلالة ، وزَهِدوا في الهدى إذ ليس في ما وقع من المنافقين استبدال شيء بشيء إذ لم يكونوا من قبل مهتدين .ويجوز أن يكون الاشتراء مستعملاً في الاستبدال وهو لازمه الأول واستعماله في هذا اللازم مشهور . قال بشامة بن حَزن :إِنَّا بني نَهْشَللٍ لا نَدَّعِي لأَبٍ ... عنه ولا هُوَ بالأبناء يَشْريناأي يبيعنا أي يبدلنا ، وقال عنترة بن الأَخرس المَعْني من شعراء «الحماسة» :ومَنْ إِنْ بِعْتَ منزلة بأخرى ... حَلَلْتَ بأمره وبه تَسيرأي إذا استبدلتَ داراً بأخرى . وهذا بخلاف قول أبي النجم :أخذتُ بالجمة رأساً أزعرا ... وبالطويل العُمْر عُمْرا جَيْدارفيكون الحمل عليه هنا أن اختلاطهم كما اشترى المسلم إذ تنصرا بالمسلمين وإظهارهم الإيمان حالةٌ تشبه حال المهتدي تَلَبَّسوا بها فإذا خَلوا إلى شياطينهم طرحوها واستبدلوها بحالة الضلال وعلى هذا الوجه الثاني يصح أيضاً أن يكون الاشتراء استعارة بتشبيه تيْنك الحالتين بحال المشتري لشيء كان غير جائز له وارتضاه في «الكشاف» .والموصول في قوله { الذين اشتروا } بمعنى المعرف بلام الجنس فيفيد التركيب قصر المسند على المسند إليه وهو قصر ادعائي باعتبار أنهم بلغوا الغاية في اشتراء الضلالة والحرص عليها إذ جمعوا الكفر والسفه والخداع والإفساد والاستهزاء بالمهتدين .{ فَمَا رَبِحَت تجارتهم وَمَا كَانُواْ مُهْتَدِينَ } .رَتَّبت الفاء عدم الربح المعطوف بها وعدم الاهتداء المعطوف عليه على اشتراء الضلالة بالهدى لأن كليهما ناشىء عن الاشتراء المذكور في الوجود والظهور؛ لأنهم لما اشتروا الضلالة بالهدى فقد اشتروا ما لا ينفع وبذلوا ما ينفع فلا جرم أن يكونوا خاسرين وأن يتحقق أنهم لم يكونوا مهتدين فعدم الاهتداء وإن كان سابقاً على اشتراء الضلالة بالهدى أو هو عينه أو هو سببه إلا أنه لكونه عدماً فظهوره للناس في الوجود لا يكون إلا عند حصول أثره وهو ذلك الاشتراء ، فإذا ظهر أثره تبين للناس المؤثر فلذلك صح ترتيبه بفاء الترتيب فأشبه العلة الغائية ، ولهذا عبر ب { ما كانوا مهتدين } دون ما اهتدوا لأن ما كانوا أبلغ في النفي لإشعاره بأن انتفاء الاهتداء عنهم أمر متأصل سابق قديم ، لأن كان تدل على اتصاف اسمها بخبرها منذ المضي فكان نفي الكون في الزمن الماضي أنسب بهذا التفريع .والربح هو نجاح التجارة ومصادفة الرغبة في السلع بأكثر من الأثمان التي اشتراها بها التاجر ويطلق الربح على المال الحاصل للتاجر زائداً على رأس ماله . والتجارة بكسر أوله على وزن فعالة وهي زنة الضائع ومعنى التجارة التصدي لاشتراء الأشياء لقصد بيعها بثمن أوفر مما اشترى به ليكتسب من ذلك الوفر ما ينفقه أو يتأثله . ولما كان ذلك لا ينجح إلا بالمثابرة والتجديد صيغ له وزن الضائع ونفي الربح في الآية تشبيه لحال المنافقين إذ قصدوا من النفاق غاية فأخفقت مساعيهم وضاعت مقاصدهم بحال التجار الذين لم يحصلوا من تجارتهم على ربح فلا التفات إلى رأس مال في التجارة حتى يقال إنهم إذا لم يربحوا فقد بقي لهم نفع رأس المال ويجاب بأن نفي الربح يستلزم ضياع رأس المال لأنه يتلف في النفقة من القوت والكسوة لأن هذا كله غير منظور إليه إذ الاستعارة تعتمد على ما يقصد من وجه الشبه فلا تلزم المشابهة في الأمور كلها كما هو مقرر في فن البيان .وإنما أسند الربح إلى التجارة حتى نفي عنها لأن الربح لما كان مسبباً عن التجارة وكان الرابح هو التاجر صح إسناده للتجارة لأنها سببه فهو مجاز عقلي وذلك أنه لولا الإسناد المجازي لما صح أن ينفى عن الشيء ما يعلم كل أحد أنه ليس من صفاته لأنه يصير من باب الإخبار بالمعلوم ضرورة ، فلا تظنن أن النفي في مثل هذا حقيقة فتتركه ، إن انتفاء الربح عن التجارة واقع ثابت لأنها لا توصف بالربح وهكذا تقول في نحو قول جرير :«ونمت وماليل المطي بنائم» ... بخلاف قولك ما ليله بطويل ، بل النفي هنا مجاز عقلي لأنه فرع عن اعتبار وصف التجارة بأنها إلى الخسر ووصفها بالربح مجاز وقاعدة ذلك أن تنظر في النفي إلى المنفي لو كان مثبتاً فإن وجدت إثباته مجازاً عقلياً فاجعل نفيه كذلك وإلا فاجعل نفيه حقيقة لأنه لا ينفى إلا ما يصح أن يثبت . وهذه هي الطريقة التي انفصل عليها المحقق التفتزاني في «المطول» ، وعدل عنها في «حواشي الكشاف» وهي أمثل مما عدل إليه .وقد أفاد قوله : { فما ربحت تجارتهم } ترشيحاً للاستعارة في { اشتروا } فإن مرجع الترشيح إلى أن يقفى المجاز بما يناسبه سواء كان ذلك الترشيح حقيقة بحيث لا يستفاد منه إلا تقوية المجاز كما تقول له يد طولى أو هو أسد دامي البراثن أم كان الترشيح متميزاً به أو مستعاراً لمعنى آخر هو من ملائمات المجاز الأول سواء حسن مع ذلك استقلاله بالاستعارة كما في هذه الآية فإن نفي الربح ترشح به { اشتروا } . ومثله قول الشاعر أنشده ابن الأعرابي كما في «أساس البلاغة» للزمخشري ولم يعزُه :ولما رأيت النَّسْر عزَّ ابنَ دايَةٍ ... وعشّش في وَكْرَيْه جاشَ له صدريفإنه لما شبه الشيب بالنسر والشعر الأسود بالغراب صح تشبيه حلول الشيب في محلي السواد وهما الفودان بتعشيش الطائر في موضع طائر آخر؛ أم لم يحسن إلا مع المجاز الأول كقول بعض فُتَّاك العرب في أمه ( أنشده في «الكشاف» ولم أقف على تعيين قائله ) :وما أُمُّ الرُّدَيْن وإنْ أَدَلَّتْ ... بعالمة بأخلاق الكرامإذا الشيطانُ قَصَّع في قفاها ... تَنَفَّقْنَاهُ بالحَبْل التُّؤَامِفإنه لما استعار قصع لدخول الشيطان أي وسوسته وهي استعارة حسنة لأنه شبه الشيطان بضب يدخل للوسوسة ودخوله من مدخله المتعارف له وهو القاصعاء ، وجعل علاجهم وإزالة وسوسته كالتنفق أي تطلب خروج الضب من نافقائه بعد أن يسد عليه القاصعاء ولا تحسن هذه الثانية إلا تبعاً للأولى . والآية ليست من هذا القبيل . وقوله : { وما كانوا مهتدين } قد علم من قوله : { اشتروا الضلالة بالهدى } إلى : { وما كانوا مهتدين ، } فتعين أن الاهتداء المنفي هو الاهتداء بالمعنى الأصلي في اللغة وهو معرفة الطريق الموصل للمقصود وليس هو بالمعنى الشرعي المتقدم في قوله : { اشتروا الضلالة بالهدى } فلا تكرير في المعنى فلا يرد أنهم لما أخبر عنهم بأنهم اشتروا الضلالة بالهدى كان من المعْلوم أنه لم يبق فيهم هدى .ومعنى نفي الاهتداء كناية عن إضاعة القصد أي إنهم أضاعوا ما سعوا له ولم يعرفوا ما يوصل لخير الآخر ولا ما يضر المسلمين . وهذا نداء عليهم بسفه الرأي والخرق وهو كما علمت فيما تقدم يجري مجرى العلة لعدم ربح التجارة ، فشبه سوء تصرفهم حتى في كفرهم بسوء تصرف من يريد الربح ، فيقع في الخسران . فقوله : { وما كانوا مهتدين } تمثيلية ويصح أن يؤخذ منها كناية عن الحسران وإضاعة كل شيء لأن من لم يكن مهتدياً أضاع الربح وأضاع رأس المال بسوء سلوكه .\n\n",
      "translations": [
        {
          "translation": "(These are they who purchase error at the price of guidance), they chose disbelief instead of faith and exchanged guidance with error, (so their commerce did not prosper), they did not prosper in their bargain but on the contrary (neither were they guided) to overcome their error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أُوْلَـٰئِكَ ٱلَّذِينَ ٱشْتَرَوُاْ ٱلضَّلاَلَةَ بِٱلْهُدَىٰ } أي اسْتَحبوا الضَّلالَةَ على الهُدى\n ويقال آمَنوا ثُمَّ كَفَرُوا\n\n",
      "translations": [
        {
          "translation": " And His saying, {Those who have purchased error [in exchange] for guidance} [i.e., those who preferred disbelief over belief].\n They said, \"Believe,\" then they disbelieved.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أولئكَ الذين اشْتَروا الضلالةَ بالهُدى } أي: الظلمة\n والاحتجاب عن طريق الحق الذي هو الدين\n أو عن الحق\n فإنّ الضلالة تنقسم بإزاء الهداية بالنور الاستعداديّ الأصليّ\n { فما ربِحت تجارتُهُم } إذ كان رأس مالهم من عالم النور والبقاء ليكتسبوا به ما يجانسه من النور الفيضيّ الكماليّ\n بالعلوم والأعمال والحكم والمعارف والأخلاق والملكات الفاضلة\n فيصيرون أغنياء في الحقيقة\n مستحقين للقرب والكرامة والتعظيم والوجاهة عند الله\n فما ربحوا بكسبها وضاعت الهداية الأصلية التي كانت بضاعتهم ورأس مالهم بإزالة استعدادهم وتكدير قلوبهم بالرين الموجب للحجاب والحرمان الأبديّ\n فخسروا بالخسران السرمديّ\n أعاذنا الله من ذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } البعداء عن طريق الهداية هم { ٱلَّذِينَ ٱشْتَرَوُاْ } استبدلوا واختاروا { ٱلضَّلَـٰلَةَ } المعززة في نفوسهم بتقليد آبائهم { بِٱلْهُدَىٰ } المتفرعة على الإيمان بالله وبرسوله { فَمَا رَبِحَتْ } بهذا الاستبدال والاختيار { تِّجَارَتُهُمْ } أي: ما يتجرون به { وَمَا كَانُواْ مُهْتَدِينَ } [البقرة: 16] رابحين بسبب الاستبدال\n وخاسرين ضالين به\n أو يقال: فما يتم الربح { تِّجَارَتُهُمْ } اتجارهم { وَمَا كَانُواْ مُهْتَدِينَ } بسبب هذا الاتجار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فإذا ذهب الرأس فلا ربح ولذلك قال تعالى: { فَمَا رَبِحَت تِجَارَتُهُمْ } \n بل خسرت صفقتهم\n { وَمَا كَانُوا مُهْتَدِينَ } إلى أسباب الربح أبداً\n لاستبدالهم الهدى - التي هي رأس المال - بالضلالة - التي هي سبب الخسران\n وبالله التوفيق\n وها هنا استعارات وبلاغات يطول سردها\n إذ مرادنا تربية اليقين بكلام رب العالمين\n الإشارة: الناس في طريق الخصوص على أربعة أقسام: قسم: سبقت لهم من الله العناية\n وهبت عليهم ريح الهداية: فصدقوا ودخلوا فيها\n وبذلوا أنفسهم وأموالهم في سبيل الله\n فَتَجِرُوا فيه وربحوا\n فعوّضهم الله تعالى جنة المعارف\n يتبوؤون منها حيث شاءوا\n فإذا قدموا عليه أدخلهم جنة الزخارف\n يسرحون فيها حيث شاءوا\n وأتحفهم فيها بالنظر إلى وجهه الكريم\n\nوقسم: سبقت لهم من الله الهداية\n وحفتهم الرعاية\n فصدقوا وأقروا\n ولكنهم ضعفوا عن الدخول\n ولم تتعلق همتهم بالوصول\n فبقوا في ضعفاء المسلمين\n[التّوبَة: 91]\n وقسم: أنكروا وأظهروا وجحدوا وكفروا\n فتجروا وخسروا\n \" مَنْ عَادَى لي وَلِياً فقَد آذنْتُهُ بالْحَربِ \"\n وقسم رابع: هم مذبذبون بين ذلك إذا لقوا أهل الخصوصية قالوا: آمنا وصدقنا فأنتم على الجادة\n وإذا رجعوا إلى أهل التمرد من المنكرين - طعنوا وجحدوا\n وقالوا: إنما كنا بهم مستهزئين\n { الله يستهزئ بهم } بما يظهر لهم من صور الكرامات والاستدراجات\n ويمدهم في تعاطي العوائد والشهوات\n وطلب العلو والرئاسات\n متحيرين في مهامه الخواطر والغفلات\n { أولئك الذي اشتروا الضلالة } عن طريق الخصوص من أهل الوصول\n { بالهدى } الذي كان بيدهم\n لو حصل لهم التصديق والدخول\n فما ربحوا في تجارتهم\n وما كانوا مهتدين إلى بلوغ المأمول\n قال بعض العارفين: التصديق بطريقتنا ولاية\n والدخول فيها عناية\n والانتقاد عليها جناية\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:29",
      "similarity": 0.1809581704054938
    },
    {
      "verse": "61:10",
      "similarity": 0.16952095367379064
    },
    {
      "verse": "62:11",
      "similarity": 0.1626953335343341
    },
    {
      "verse": "24:37",
      "similarity": 0.162232957902149
    },
    {
      "verse": "35:29",
      "similarity": 0.14942032546555412
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}