{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ كتب عليكم القصاص فى القتلى الحر بالحر والعبد بالعبد والانثى بالانثى فمن عفى له من اخيه شىء فاتباعۢ بالمعروف واداء اليه باحسن ذلك تخفيف من ربكم ورحمة فمن اعتدى بعد ذلك فله عذاب اليم",
  "translations": [
    {
      "translation": "You who have iman! retaliation is prescribed for you in the case of people killed: free man for free man, slave for slave, female for female. But if someone is absolved by his brother, blood-money should be claimed with correctness and paid with good will. That is an easement and a mercy from your Lord. Anyone who goes beyond the limits after this will receive a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, ordained for you is retribution for the murdered, (whether) a free man (is guilty) of (the murder of) a free man, or a slave of a slave, or a woman of a woman. But he who is pardoned some of it by his brother should be dealt with equity, and recompense (for blood) paid with a grace. This is a concession from your Lord and a kindness. He who transgresses in spite of it shall suffer painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, the lawn of retribution has been prescribed for you in cases of murder; if a free man commits a murder, the free man shall he punished for it and a slave for a slave: likewise if a woman is guilty of murder the same shall he accountable for it. But in case the injured brother is willing to show leniency to the murderer, the blood money should he decided in accordance with the common law and the murderer should pay it in a genuine way. This is an allowance and mercy from your Lord. Now there shall be a painful torment for anyone who transgresses the limits after this. O men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, in case of murder, the death penalty is the sanctioned retaliation: a free man for a free man, a slave for a slave, and a female for a female. However, if the convicted person receives pardon from the aggrieved party, the prescribed rules of compensation must be followed accordingly. This is a merciful alteration from your Lord. Whoever transgresses against it will face a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Retribution is made obligatory for you in the matter of those killed unjustly; a freeman for a freeman, and a slave for a slave, and a female for a female; and for him who is partly forgiven by his brother, seek compensation with courtesy and make payment in proper manner; this is a relief and a mercy upon you, from your Lord; so after this, a painful punishment is for whoever exceeds the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Al-Qisas (the Law of equality) is prescribed for you in case of murder: the free for the free, the slave for the slave, and the female for the female. But if the killer is forgiven by the brother (or the relatives) of the killed (against blood money), then it should be sought in a good manner, and paid to him respectfully. This is an alleviation and a mercy from your Lord. So after this, whoever transgresses the limits (i.e. kills the killer after taking the blood money), he shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! retaliation is prescribed for you in the matter of the slain, the free for the free, and the slave for the slave, and the female for the female, but if any remission is made to any one by his (aggrieved) brother, then prosecution (for the bloodwit) should be made according to usage, and payment should be made to him in a good manner; this is an alleviation from your Lord and a mercy; so whoever exceeds the limit after this he shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, prescribed for you is retaliation, touching the slain; freeman for freeman, slave for slave, female for female. But if aught is pardoned a man by his brother, let the pursuing be honourable, and let the payment be with kindliness. That is a lightening granted you by your Lord, and a mercy; and for him who commits aggression after that -- for him there awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Retaliation is prescribed for you in the matter of the murdered; the freeman for the freeman, and the slave for the slave, and the female for the female. And for him who is forgiven somewhat by his (injured) brother, prosecution according to usage and payment unto him in kindness. This is an alleviation and a mercy from your Lord. He who transgresseth after this will have a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, retribution is prescribed for you in cases of murder: the free man for the free man, the slave for the slave, the female for the female. If the offender is granted some remission by the heir of the slain person, the agreed penalty should be equitably exacted and should be discharged in a handsome manner. This is an alleviation from your Lord and an act of grace. He who transgresses after this shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! prescribed unto you is retaliation for the slain; the free for the free, and a bondsman for a bondsman, and a woman for a woman; yet unto whomsoever is pardoned aught by his brother, then a serving with lenity and payments with kindness. That is an alleviation from your Lord and a mercy so whosoever shall transgress thereafter, for him there shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Retribution is prescribed for you regarding the slain: freeman for freeman, slave for slave, and female for female. But if one is granted any extenuation by his brother, let the follow up [for the blood-money] be honourable, and let the payment to him be with kindness. That is a remission from your Lord and a mercy; and should anyone transgress after that, there shall be a painful punishment for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! the law of equality is prescribed to you in cases of murder: the free for the free, the slave for the slave, the woman for the woman. But if any remission is made by the brother of the slain, then grant any reasonable demand, and compensate him with handsome gratitude, this is a concession and a Mercy from your Lord. After this whoever exceeds the limits shall be in grave penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Al-Qisas (the Law of Equality in punishment) is prescribed for you in case of murder: the free for the free, the slave for the slave, and the female for the female. But if the killer is forgiven by the brother (or the relatives, etc.) of the killed against blood money, then adhering to it with fairness and payment of the blood money, to the heir should be made in fairness. This is an alleviation and a mercy from your Lord. So after this whoever transgresses the limits (i.e. kills the killer after taking the blood money), he shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, retaliation is decreed for you concerning the killed. A free (man) for a free (man), a slave for a slave, and a female for a female. He who is pardoned by his brother, let the ensuing be with kindness, and let the payment be with generosity. This is an alleviation from your Lord and mercy. He who transgresses thereafter shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Retaliation for the murdered is ordained upon you: the free for the free, the slave for the slave, the female for the female. But if he is forgiven by his kin, then grant any reasonable demand, and pay with good will. This is a concession from your Lord, and a mercy. But whoever commits aggression after that, a painful torment awaits him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, prescribed for you is legal retribution for those murdered - the free for the free, the slave for the slave, and the female for the female. But whoever overlooks from his brother anything, then there should be a suitable follow-up and payment to him with good conduct. This is an alleviation from your Lord and a mercy. But whoever transgresses after that will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:178] O you who believe, prescribed, made obligatory, for you is retaliation, on equal terms, regarding the slain, both in the attributes [of the one slain] and in the action involved; a free man, is killed, for a free man, and not for a slave; and a slave for a slave, and a female for a female. The Sunna makes it clear that a male may be killed [in retaliation] for a female, and that religious affiliation should be taken into account also, so that a Muslim cannot be killed in return for an disbeliever, even if the former be a slave and the latter a free man. But if anything, of the blood, is pardoned any one, of those who have slain, in relation to his brother, the one slain, so that the retaliation is waived (the use of the indefinite shay’un, ‘anything’, here implies the waiving of retaliation through a partial pardon by the inheritors [of the slain]; the mention of akhīh [‘his brother’] is intended as a conciliatory entreaty to pardon and a declaration that killing should not sever the bonds of religious brotherhood; the particle man, ‘any one’, is the subject of a conditional or a relative clause, of which the predicate is [the following, fa’ittibā‘un]) let the pursuing, that is, the action of the one who has pardoned in pursuing the killer, be honourable, demanding the blood money without force. The fact that the ‘pursuing’ results from the ‘pardoning’ implies that one of the two [actions] is a duty, which is one of al-Shāfi‘ī’s two opinions here. The other [opinion] is that retaliation is the duty, whereas the blood money is merely compensation [for non-retaliation], so that if one were to pardon but not name his blood money, then nothing [happens]; and this [latter] is the preferred [opinion]. And let the payment, of the blood money by the slayer, to him, the pardoner, that is, the one inheriting [from the slain], be with kindliness, without procrastination or fraud; that, stipulation mentioned here about the possibility of retaliation and the forgoing of this in return for blood money, is an alleviation, a facilitation, given, to you, by your Lord, and a mercy, for you, for He has given you latitude in this matter and has not categorically demanded that one [of the said options] be followed through, in the way that He made it obligatory for Jews to retaliate and for Christians to [pardon and] accept blood money; and for him who commits aggression, by being unjust towards the killer and slaying him, after that, that is, [after] pardoning — his is a painful chastisement, of   the Fire in the Hereafter, or of being killed in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأعيد الخطاب بيأيُّها الذين آمنوا لأن هذا صنف من التشريع لأحكام ذات بال في صلاح المجتمع الإسلامي واستتباب نظامه وأمنه حين صار المسلمون بعد الهجرة جماعةً ذات استقلال بنفسها ومديِنتها ، فإن هاته الآيات كانت من أول ما أنزل بالمدينة عام الهجرة كما ذكره المفسرون في سبب نزولها في تفسير قوله تعالى بعدَ هذا : { وقاتلوا في سبيل الله الذين يقاتلونكم } \\[ البقرة : 190 \\] الآية .تلك أحكام متتابعة من إصلاح أحوال الأفراد وأحوال المجتمع ، وابتُدىء بأحكام القصاص ، لأن أعظم شيء من اختلال الأحوال اختلالُ حفظ نفوس الأمة ، وقد أفرط العرب في إضاعة هذا الأصل ، يَعلم ذلك مَنْ له إلمام بتاريخهم وآدابهم وأحوالهم ، فقد بلغ بهم تطرفهم في ذلك إلى وشك الفناء لو طال ذلك فلم يتداركهم الله فيه بنعمة الإسلام ، فكانوا يغير بعضهم على بعض لغنيمة أنعامه وعبيده ونسائه فيدافع المُغَار عليه وتتلف نفوس بين الفريقين ثم ينشأ عن ذلك طلب الثارات فيسعى كل من قتل له قتيل في قَتْل قاتِل وليِّه وإن أعوزه ذلك قتل به غيره من واحدٍ كفءٍ له ، أو عدد يراهم لا يوازونه ويسمون ذلك بالتكايل في الدم أي كأنَّ دم الشريف يُكال بدماء كثيرة فربما قدروه باثنين أو بعشرة أو بمائة ، وهكذا يدور الأمر ويتزايد تزايداً فاحشاً حتى يصير تفانياً قال زهير :تَدَارَكْتُمَا عَبْساً وذُبْيَانَ بعدَما ... تَفانَوْا ودَقُّوا بينهم عِطْرَ مَنْشِموينتقل الأمر من قبيلة إلى قبيلة بالولاء والنسب والحلف والنصرة ، حتى صارت الإحن فاشية فتخاذلوا بينهم واستنصر بعض القبائل على بعض فوجد الفرس والروم مدخلاً إلى التفرقة بينهم فحكموهم وأرْهبوهم ، وإلى هذا الإشارة والله أعلم بقوله تعالى : { واذكروا نعمة الله عليكم . . . حتى فأنقذكم منها } \\[ البقرة : 231 \\] أي كنتم أعداء بأسباب الغارات والحروب فألف بينكم بكلمة الإسلام ، وكنتم على وَشْك الهلاك فأنقذكم منه فضَرب مثلاً للهلاك العاجل الذي لا يُبقي شيئاً بحفرة النار فالقائم على حافتها ليس بينه وبين الهلاك إلاّ أقلُّ حركة .فمعنى { كتب عليكم } أنه حق لازم للأمة لا محيد عن الأخذ به فضمير { عليكم } لمجموع الأمة على الجملة لمن توجه له حق القصاص وليس المراد على كل فرد فرد القصاص ، لأن ولي الدم له العفو عن دم وليه كما قال تعالى : { فمن عفى له من أخيه شيء فاتباع بالمعروف } وأصل الكتابة نقش الحروف في حَجَر أَوْ رَقِّ أو ثوب ولما كان ذلك النقش يراد به التوثق بما نقش به دوام تذكره أطلق كُتِب على معنى حَقَّ وثبت أي حق لأهل القتيل .والقصاص اسم لتعويض حق جنايةٍ أو حق غُرْم على أحد بمثل ذلك من عند المحقوق إنصافاً وعدلاً ، فالقصاص يطلق على عقوبة الجاني بمثل ما جنَى ، وعلى محاسبة رب الدين بما عليه للمدين من دين يفي بدينه ، فإطلاقاته كلها تدل على التعادل والتناصف في الحقوق والتبعات المعروضة للغمص .وهو بوزن فِعال وهو وزن مصدر فَاعَلَ من القص وهو القطع ومنه قولهم : طائر مقصوص الجناح ومنه سمي المقص لآلة القص أي القطع وقصة الشعر بضم القاف ما يقص منه لأنه يجري في حقين متبادلين بين جانبين يقال قاصّ فلان فلاناً إذا طرح من دين في ذمته مقداراً بدين له في ذمة الآخر فشبه التناصف بالقطع لأنه يقطع النزاع الناشب قبله ، فلذلك سمي القَود وهو تمكينُ ولي المقتول من قَتل قاتِل مولاه قصاصاً قال تعالى : { ولكم في القصاص حياة } \\[ البقرة : 179 \\] ، وسميت عقوبة من يجرح أحداً جُرحاً عمداً عدواناً بأن يُجْرح ذلك الجارح مثل ما جَرح غيره قصَاصاً قال تعالى : { والجروح قصاص } \\[ المائدة : 45 \\] وسموا معاملة المعتدي بمثل جرمه قصاصاً { والحرمت قصاص } \\[ البقرة : 194 \\] ، فماهية القصاص تتضمن ماهية التعويض والتماثل .فقوله تعالى : { كتب عليكم القصاص في القتلى } يتحمّل معنى الجزاء على القتل بالقتل للقاتل وتتحمل معنى التعادل والتماثل في ذلك الجزاء بما هو كالعوض له والمِثل ، وتتحمل معنى أنه لا يقتل غير القاتل ممن لا شركة له في قتل القتيل فأفاد قوله : { كتب عليكم } حق المؤاخذة بين المؤمنين في قتل القتلى فلا يذهب حق قتيل باطلاً ولا يُقتل غير القاتل باطلاً ، وذلك إبطال لما كانوا عليه في الجاهلية من إهمال دم الوضيع إذا قتله الشريف وإهمال حق الضعيف إذا قتله القَوي الذي يُخشى قومه ، ومن تَحَكُّمهم بطلب قتل غير القاتل إذا قَتَل أحد رجُلاً شريفاً يطلبون قتل رجل شريف مثله بحيث لا يقتلون القاتل إلاّ إذا كان بواء للمقتول أي كفءا له في الشرف والمجد ويعتبرون قيمة الدماء متفاوتة بحسب تفاوت السودد والشرف ويُسمون ذلك التفاوت تكَايُلاً من الكيل ، قالت ابنة بهدل بن قرقة الطائي تستثير رهطها على قتل رجل قتل أباها وتَذكر أنها ما كانت تقنع بقتله به لولا أن الإسلام أبطل تكايل الدماء :أَمَا فِي بَنِي حِصْننٍ من ابننِ كريهة ... مِنَ القوْم طَلاَّببِ الترَّاتتِ غَشَمْشَمِفيَقتُلَ جَبْراً بامرىءٍ لم يكن له ... بَوَاءً ولكن لا تَكايُلَ بالدَّم ( )قال النبي صلى الله عليه وسلم « المسلمون تتكافأ دماؤهم » .وقد ثبت بهذه الآية شرع القصاص في قتل العمد ، وحكمة ذلك ردع أهل العدوان عند الإقدام على قتل الأنفس إذا علموا أن جزاءهم القتل ، فإن الحياة أعز شيء على الإنسان في الجبلة فلا تعادل عقوبةٌ القتلَ في الردع والانزجار ، ومن حكمة ذلك تطمين أولياء القتلى بأن القضاء ينتقم لهم ممَّن اعتدى على قتيلهم قال تعالى : { ومن قتل مظلوماً فقد جعلنا لوليه سلطاناً فلا يسرف في القتل إنه كان منصوراً } \\[ الإسراء : 33 \\] أي لئلا يتصدى أولياء القتيل للانتقام من قاتل مولاهم بأنفسهم؛ لأن ذلك يفضي إلى صورة الحرب بين رهطين فيكثر فيه إتلاف الأنفس كما تقدم في الكلام على صدر الآية ، ويأتي عند قوله تعالى :{ ولكم في القصاص حياة } \\[ البقرة : 179 \\] .وأول دم أقيد به في الإسلام دم رجل من هذيل قتله رجل من بني ليث فأقاد منه النبي صلى الله عليه وسلم وهو سائر إلى فتح الطائف بموضع يقال له : بَحْرَةُ الرُّغَاء في طريق الطائف وذلك سنة ثمان من الهجرة .و { في } من قوله : { في القتلى } ، للظرفية المجازية والقصاص لا يكون في ذوات القتلى ، فتعين تقدير مضاف وحذفُه هنا ليشمل القصاص سائر شؤون القتلى وسائر معاني القصاص فهو إيجاز وتعميم .وجمع { القتلى } باعتبار جمع المخاطبين أي في قتلاكم ، والتعريف في القتلى تعريف الجنس ، والقتيل هو من يقتله غيره من الناس والقتل فعل الإنسان إماتة إنسان آخر فليس الميت بدون فعل فاعل قتيلاً .وجملة { الحر بالحر والعبد بالعبد والأنثى بالأنثى } بيان وتفصيل لجملة { كُتبَ عليكم القصاص في القتلى } فالباء في قوله : { بالحر } وما بعده ، متعلقة بمحذوف دل عليه معنى القصاص والتقدير الحر يقتصُّ أو يقتل بالحر الخ ومفهوم القيد مع ما في الحر والعبد والأنثى من معنى الوصفية يقتضي أن الحر يقتل بالحر لا بغيره والعبد يقتل بالعبد لا بغيره ، والأنثى تقتل بالأنثى لا بغيرها .وقد اتفق علماء الإسلام على أن هذا المفهوم غير معمول به باطراد ، لكنهم اختلفوا في المقدار المعمول به منه بحسب اختلاف الأدلة الثابتة من الكتاب والسنة وفي المراد من هذه الآية ومحمل معناها ، ففي «الموطأ» «قال مالك أحسن ما سمعت في هذه الآية أن قوله تعالى : { الحر بالحر والعبد بالعبد } فهؤلاء الذكور وقوله : { والأنثى بالأنثى } أن القصاص يكون بين الإناث كما يكون بين الذكور والمرأة الحرة تقتل بالمرأة الحرة كما يقتل الحر بالحر والأمة تقتل بالأمة كما يقتل العبد بالعبد والقصاص يكون بين النساء كما يكون يبن الرجال . والقصاص أيضاً يكون بين الرجال والنساء» . أي وخُصَّت الأنثى بالذكر مع أنها مشمولة لعموم الحر بالحر والعبد لئلا يتوهم أن صيغة التذكير في قوله : { الحر } وقوله : { العبد } مراد بها خصوص الذكور .قال القرطبي عن طائفة أن الآية جاءت مبينة لحكم النوع إذا قتل نوعه فبيّنت حكم الحر إذا قتل حراً والعبد إذا قتل عبداً والأنثى إذا قتلت أنثى ولم يتعرض لأحد النوعين إذا قتل الآخر ، فالآية محكمة وفيها إجمال يبيّنه قوله تعالى : { وكتبنا عليهم فيها أن النفس } \\[ المائدة : 45 \\] الآية اه . وعلى هذا الوجه فالتقييد لبيان عدم التفاضل في أفراد النوع ، ولا مفهوم له فيما عدا ذلك من تفاضل الأنواع إثباتاً ولا نفياً ، وقال الشعبي : نزلت في قوم قالوا : لنقتلن الحر بالعبد والذكر بالأنثى ، وذلك وقع في قتال بين حيين من الأنصار ، ولم يثبت هذا الذي رواه وهو لا يغني في إقامة محمل الآية .وعلى هذين التأويلين لا اعتبار بعموم مفهوم القيد؛ لأن شرط اعتباره ألا يظهر لذكر القيد سبب إلاّ الاحتراز عن نقيضه ، فإذا ظهر سبب غير الاحتراز بطل الاحتجاج بالمفهوم ، وحينئذٍ فلا دلالة في الآية على ألا يقتل حر بعبد ولا أنثى بذكر ولا على عكس ذلك ، وأن دليل المساواة بين الأنثى والذكر وعدم المساواة بين العبد والحر عند من نفى المساواة مستنبط من أدلة أخرى .الثالث : نقل عن ابن عباس أن هذا كان حكماً في صدر الإسلام ثم نسخ بآية المائدة { أن النفس بالنفس } \\[ المائدة : 45 \\] ونقله في «الكشاف» عن سعيد بن المسيب والنخعي والثوري وأبي حنيفة ، ورده ابن عطية والقرطبي بأن آية المائدة حكاية عن بني إسرائيل فكيف تصلح نسخاً لحكم ثبت في شريعة الإسلام ، أي حتى على القول بأن شرع من قبلنا شرع لنا فمحله ما لم يأتي في شرعنا خلافه .وقال ابن العربي في «الأحكام» عن الحنفية : إن قوله تعالى : { في القتلى } هو نهاية الكلام وقوله : { الحر بالحر } جاء بعد ذلك وقد ثبت عموم المساواة بقوله : { كتب عليكم القصاص في القتلى } لأن القتلى عام وخصوص آخر الآية لا يبطل عموم أولها ، ولذلك قالوا يقتل الحر بالعبد ، قلت : يرد على هذا أنه لا فائدة في التفصيل لو لم يكن مقصوداً وإن الكلام بأواخره فالخاص يخصص العام لا محالة ، وإنه لا محيص من اعتبار كونه تفصيلاً إلاّ أن يقولوا إن ذلك كالتمثيل ، والمنقول عن الحنفية في «الكشاف» هو ما ذكرناه آنفاً .ويبقى بعد هاته التأويلات سؤال قائم عن وجه تخصيص الأنثى بعد قوله تعالى : { الحر بالحر والعبد بالعبد } وهل تخرج الأنثى عن كونها حرة أو أمة بعد ما تبين أن المراد بالحر والعبد الجنسان؛ إذ ليس صيغة الذكور فيها للاحتراز عن النساء منهم؛ فإن ( ال ) لمّا صيرته اسم جنس صار الحكم على الجنس وبطل ما فيه من صيغة تأنيث كما يبطل ما فيه من صيغة جمع إن كانت فيه .ولأجل هذا الإشكال سألت العلامة الجد الوزير رحمه الله عن وجه مجيء هذه المقابلة المشعرة بألا يقتص من صنف إلاّ لقتل مماثله في الصفة فترك لي ورقة بخطه فيها ما يأتي : الظاهر والله تعالى أعلم أن الآية ( يعني آية سورة المائدة ) نزلت إعلاماً بالحكم في بني إسرائيل تأنيساً وتمهيداً لحكم الشريعة الإسلامية ، ولذلك تضمنت إناطة الحكم بلفظ النفس المتناول للذكر والأنثى الحر والعبد الصغير والكبير ، ولم تتضمن حكماً للعبيد ولا للإناث ، وصدرت بقوله { وكتبنا عليهم فيها } \\[ المائدة : 45 \\] ، والآية الثانية ( يعني آية سورة البقرة ) صدرت بقوله : { كتب عليكم } وناط الحكم فيها بالحرية المتناولة للأصناف كلها ثم ذكر حكم العبيد والأناث رداً على من يزعم أنه لا يقتص لهم ، وخصص الأنثى بالأنثى للدلالة على أن عدمها معصوم ، وذلك لأنه إذا اقتص لها من الأنثى ولم يقتص لها من الذكر صار الدم معصوماً تارة لذاته غير معصوم أخرى وهذا من لطف التبليغ حيث كان الحكم متضمناً لدليله ، فقوله :كتب القتل والقتال علينا ... وعلى الغانيات جر الذيولحكم جاهلي اه .يعني أن الآية لم يقصد منها إلاّ إبطال ما كان عليه أمر الجاهلية من ترك القصاص لشرف أو لقلة اكتراث ، فقصدت التسوية بقوله { الحر بالحر والعبد بالعبد } أي لا فضل لحر شريف على حر ضعيف ولا لعبيد السادة على عبيد العامة وقصدت من ذكر الأنثى إبطال ما كان عليه الجاهلية من عدم الاعتداد بجناية الأنثى واعتبارها غير مؤاخذة بجناياتها ، وأراد بقوله : حكم جاهلي أنه ليس جارياً على أحكام الإسلام؛ لأن البيت لعمر ابن أبي ربيعة وهو شاعر إسلامي من صدر الدولة الأموية .فإن قلت : كان الوجه ألا يقول : { بالأنثى } المشعر بأن الأنثى لا تقتل بالرجل مع إجماع المسلمين على أن المرأة يقتص منها للرجل . قلت : الظاهر أن القيد خرج مخرج الغالب ، فإن الجاري في العرف أن الأنثى لا تقتل إلاّ أنثى ، إذ لا يتثاور الرجال والنساء فذكر { بالأنثى } خارج على اعتبار الغالب كمخرج وصف السائمة في قول النبي صلى الله عليه وسلم « في الغنم السائمة الزكاة » والخلاصة أن الآية لا يلتئم منها معنى سليم من الإشكال إلاّ معنى إرادة التسوية بين الأصناف لقصد إبطال عوائد الجاهلية .وإذا تقرر أن الآية لا دلالة لها على نفي القصاص بين الأصناف المختلفة ولا على إثباته من جهة ما ورد على كل تأويل غير ذلك من انتقاض بجهة أخرى ، فتعين أن قوله : { الحر بالحر والعبد بالعبد والأنثى بالأنثى } محمله الذي لا شك فيه هو مساواة أفراد كل صنف بعضها مع بعض دون تفاضل بين الأفراد ، ثم أدلة العلماء في تسوية القصاص بين بعض الأصناف مع بعض الذكور بالإناث وفي عدمها كعدم تسوية الأحرار بالعبيد عند الذين لا يسوون بين صنفيهما خلافاً لأبي حنيفة والثوري وابن أبي ليلى وداود أدلة أخرى غير هذا القيد الذي في ظاهر الآية ، فأما أبو حنيفة فأخذ بعموم قوله : { القتلى } ولم يثبت له مخصصاً ولم يستثن منه إلاّ القصاص بين المسلم والكافر الحربي واستثناؤه لا خلاف فيه ، ووجهه أن الحربي غير معصوم الدم ، وأما المعاهد ففي حكم قتل المسلم إياه مذاهب ، وأما الشافعي وأحمد فنفيا القصاص من المسلم للذمي والمعاهد وأخذاً بحديث « لا يقتل مسلم بكافر » ومالك والليث قالا لا قصاص من المسلم إذا قتل الذمي والمعاهد قتل عدوان وأثبتا القصاص منه إذا قتل غيلة .وأما القصاص بين الحر والعبد في قطع الأطراف فليس من متعلقات هذه الآية وسيأتي عند قوله تعالى :{ والجروح قصاص } \\[ المائدة : 45 \\] في سورة العقود . ونفي مالك والشافعي وأحمد القصاص من الحر للعبد استناداً لعمل الخلفاء الراشدين وسكوت الصحابة ، واستناداً لآثار مروية ، وقياساً على انتفاء القصاص من الحر في إصابة أطراف العبد فالنفس أولى بالحفظ . والقصاص من العبد لقتله الحر ثابت عندهما بالفحوى ، والقصاص من الذكر لقتل الأنثى ثابت بلحن الخطاب .الفاء لتفريع الإخبار أي لمجرد الترتيب اللفظي لا لتفريع حصول ما تضمنته الجملة المعطوفة بها على حصول ما تضمنته ما قبلها ، والمقصود بيان أن أخذ الولي بالقصاص المستفاد من صور { كتب عليكم القصاص في القتلى } ليس واجباً عليه ولكنه حق له فقط لئلا يتوهم من قوله : { كتب عليكم } أن الأخذ به واجب على ولي القتيل ، والتصدي لتفريع ذكر هذا بعد ذكر حق القصاص للإيماء إلى أن الأولى بالناس قبول الصلح استبقاء لأواصر أخوة الإسلام .قال الأزهري : «هذه آية مشكلة وقد فسروها تفسيراً قربوه على قدر أفهام أهل عصرهم» ثم أخذ الأزهري في تفسيرها بما لم يكشف معنى وما أزال إشكالاً ، وللمفسرين مناح كثيرة في تفسير ألفاظها ذكر القرطبي خمسة منها ، وذكر في «الكشاف» تأويلاً آخر ، وذكر الطيبي تأويلين راجعين إلى تأويل «الكشاف» ، واتفق جميعهم على أن المقصد منها الترغيب في المصالحة عن الدماء ، وينبغي ألا نذهب بأفهام الناظر طرائق قدداً ، فالقول الفصل أن نقول : إن ما صدق من في قوله : { فمن عفى له } هو ولي المقتول وإن المراد بأخيه هو القاتل وصفاً بأنه أخ تذكيراً بأخوة الإسلام وترقيقاً لنفس ولي المقتول؛ لأنه إذا اعتبر القاتل أخاً له كان من المروءة ألا يرضى بالقَوَد منه؛ لأنه كمن رضي بقتل أخيه ، ولقد قال بعض العرب : قتل أخوه ابناً له عمداً فقدم إليه ليقتاد منه فألقى السيف وقال :أَقول للنفس تَأْسَاءً وتَعْزيَة ... إِحدى يَدَيَّ أصابتْني ولم تُرِدِكِلاَهُما خَلَفٌ من فَقْدِ صاحبه ... هَذَا أخي حينَ أَدْعُوهُ وذَا ولَدِيوما صدق { شيء } هو عرض الصلح ، ولفظ شيء اسم متوغل في التنكير دال على نوع ما يصلح له سياق الكلام ، وقد تقدم حسن موقع كلمة شيء عند قوله تعالى : { ولنبلونكم بشيء من الخوف والجوع } \\[ البقرة : 155 \\] .ومعنى { عفى له من أخيه } أنه أعطى العفو أي الميسور على القاتل من عوض الصلح . ومن معاني العفو أنه الميسور من المال الذي لا يجحف بباذله وقد فسر به العفو من قوله تعالى : { خذ العفو } \\[ الأعراف : 199 \\] ، وإيثار هذا الفعل لأنه يؤذن بمراعاة التيسير والسماحة وهي من خلق الإسلام فهذا تأكيد للترغيب الذي دل عليه قوله : { من أخيه } ، والتعيبر عن عوض الدم بشيء لأن العوض يختلف فقد يُعرض على ولي الدم مال من ذهب أو فضة وقد يعرض عليه إبل أو عروض أو مقاصة دماء بين الحيين؛ إذ ليس العوض في قتل العمد معيناً كما هو في دية قتل الخطأ .( واتّباع ) و ( أداء ) مصدران وقعا عوضاً عن فعلين والتقدير : فليتبع اتباعاً وليؤد أداء فعدل عن أن ينصب على المفعولية المطلقة إلى الرفع لإفادة معنى الثبات والتحقيق الحاصل بالجملة الاسمية كما عدل إلى الرفع في قوله تعالى : { قال سلام } \\[ هود : 69 \\] بعد قوله : { قالوا سلاماً } \\[ هود : 69 \\] ، وقد تقدم تطور المصدر الذي أصله مفعول مطلق إلى مصيره مرفوعاً عند قوله تعالى : { الحمد لله } \\[ الفاتحة : 2 \\] ، فنظم الكلام : فاتباعٌ حاصلٌ ممن عفي له من أخيه شيء وأداءٌ حاصل من أخيه إليه ، وفي هذا تحريض لمن عفي له على أن يقبل ما عفي له وتحريض لأخيه على أداء ما بذله بإحسان . والاتباع مستعمل في القبول والرضا ، أي فليرض بما عفي له كقول النبي صلى الله عليه وسلم « وإذا أتبع أحدكم على مَلِيء فليتبع » .والضمير المقدر في ( اتباع ) عائد إلى { من عفي له } والضمير المقدر في أدَاء عائد إلى ( أخيه ) ، والمعنى : فليرضى بما بذل له من الصلح المتيسر ، وليؤد باذلُ الصلح ما بذله دون مماطلة ولا نقص ، والضمير المجرور باللام والضمير المجرور بإلى عائداننِ على { فمن عفى له } .ومقصد الآية الترغيب في الرضا بأخذ العوض عن دم القتيل بدلاً من القصاص لتغيير ما كان أهل الجاهلية يتَعيرون به من أخذ الصلح في قتل العمد ويعدونه بيعاً لدم مولاهم كما قال مُرَّةُ الفَقْعَسِي :فلا تَأْخذوا عَقْلاً من القَوْم إِنَّنِي ... أَرى العَارَ يبقَى والمَعَاقِلَ تَذْهَبُوقال غيره يَذْكر قوماً لم يَقْبَلوا منه صلحاً عن قتيل :فلَوْ أَنَّ حيّاً يقبَلُ المالَ فِدْيَةً ... لسُقْنَا لهم سَبْباً من المال مُفْعَمَاولكِنْ أَبَى قَوْمٌ أُصيبَ أخُوهُمُ ... رِضَا العَار فاختاروا على اللَّبَن الدَّمَاوهذا كله في العفو على قتل العمد وأما قتل الخطأ فإن شأنه الدية عن عاقلة القاتل وسيأتي في سورة النساء .وإطلاقُ وصف الأخ على المماثل في دين الإسلام تأسيسُ أصل جاء به القرآن جعل به التوافق في العقيدة كالتوافق في نسب الإِخوة ، وحَقّاً فإن التوافق في الدين آصرة نفسانية والتوافق في النسب آصرة جسدية والروح أشرف من الجسد .واحتج ابن عباس بهذه الآية على الخوارج في أن المعصية لا تُزيل الإيمان ، لأن الله سمى القاتل أخاً لولي الدم وتلك أخوة الإِسلام مع كون القَاتل عَاصياً .وقوله : { بالمعروف } المعروف هو الذي تألفه النفوس وتستحسنه فهو مما تُسَر به النفوس ولا تشمئز منه ولا تنكره ، ويقال لضده مُنْكَر وسيأتي عند قوله تعالى : { كنتم خير أمةٍ أخرجت للناس تأمرون بالمعروف وتنهون عن المنكر } \\[ آل عمران : 110 \\] في سورة آل عمران .والباء في قوله : { بالمعروف } للملابسة أي فاتباع مُصاحب للمعروف أي رِضا وقبول ، وحسنُ اقتضاء إن وقع مطل ، وقبول التنجيم إن سأله القاتل .والأداء : الدفع وإبلاغ الحق والمراد به إعطاء مال الصلح ، وذُكر متعلقه وهو قوله { إليه } المؤذن بالوصول إليه والانتهاء إليه للإشارة إلى إبلاغ مال الصلح إلى ولي المقتول بأن يذهب به إليه ولا يكلفه الحضور بنفسه لقبضه أو إرسال من يقبضه ، وفيه إشارة إلى أنه لا يمطله ، وزاد ذلك تقريراً بقوله : { بإحسان } أي دون غضب ولا كلام كريه أو جَفاء معاملة .وقوله : { ذلك تخفيف من ربكم } إشارة إلى الحكم المذكور وهو قبول العفو وإحسان الأداء والعدولُ عن القصاص ، تخفيف من الله على الناس فهو رحمة منه أي أَثَر رحمته ، إذ التخفيف في الحكم أثر الرحمة ، فالأخذ بالقصاص عَدْل والأخذ بالعفو رحمة .ولما كانت مشروعية القصاص كافية في تحقيق مقصد الشريعة في شرع القصاص من ازدجار الناس عن قتل النفوس وتحقيق حفظ حق المقتول بكون الخيرة للولي كان الإذن في العفو إن تراضيا عليه رحمةً من الله بالجانبين ، فالعدل مقدم والرحمة تأتي بعده .قيل : إن الآية أشارت إلى ما كان في الشريعة الإسرائيلية من تعيين القصاص من قاتل العمد دون العفو ودون الديَة كما ذكره كثير من المفسرين وهو في «صحيح البخاري» عن ابن عباس ، وهو ظاهر ما في سفر الخروج الإصحاح الثالث : «من ضَرب إنساناً فمات يقتل قتلاً ولكن الذي لم يتعمد بل أوقع الله في يده فأنا أجعلُ لك مكاناً يُهرَب إليه وإذا بغى إنسان على صاحبه ليقتله بغدر فمن عندِ مذبحي تأخذُه للموت» ، وقال القرطبي : إن حكم الإنجيل العفو مطلقاً والظاهر أن هذا غير ثابت في شريعة عيسى ، لأنه ما حكَى الله عنه إلاّ أنه قال : { ولأحل لكم بعض الذي حرم عليكم } \\[ آل عمران : 50 \\] ، فلعله مما أخذه علماء المسيحية من أمره بالعفو والتسامح لكنه حكم تنزه شرائع الله عنه لإفضائه إلى انخرام نظام العالم ، وشتان بين حال الجاني بالقتل في الإسلام يَتوقع القصاص ويضع حياته في يد ولي دم المقتول فلا يدري أيقبل الصلح أم لا يقبل ، وبين ما لو كان واثقاً بأنه لا قصاص عليه فإن ذلك يجرئه على قتل عدوه وخصمه .تفريع عن حكم العفو لأن العفو يقتضي شكر الله على أن أنجاهُ بشرع جواز العفو وبأن سخر الولي للعفو ، ومن الشكر ألاّ يعود إلى الجناية مرة أخرى ، فإن عاد فله عذاب أليم ، وقد فسر الجمهور العذاب الأليم بعذاب الآخرة والمراد تشديد العذاب عليه كقوله تعالى : { ومن عاد فينتقم الله منه } \\[ المائدة : 95 \\] ، ثم له من حكم العفو والدية ما للقاتل ابتداء عندهم ، وفسره بعضهم بعذاب الدنيا أعني القتل فقالوا : إن عاد المعفو عنه إلى القتل مرة أخرى فلا بد من قتله ولا يمكن الحاكم الولي من العفو ونقلوا ذلك عن قتادة وعكرمة والسدي ورواه أبو داود عن سمرة بن جندب عن النبي صلى الله عليه وسلم وروي عن عمر بن عبد العزيز أنه موكول إلى اجتهاد الإمام .والذي يستخلص من أقوالهم هنا سواء كان العذاب عذاب الآخرة أو عذاب الدنيا أن تكرر الجناية يوجب التغليظ وهو ظاهر من مقاصد الشارع؛ لأن الجناية قد تصير له دُربة فعَوْده إلى قتل النفس يؤذن باستخفافه بالأنفس فيجب أن يُراح منه الناس ، وإلى هذا نظر قتادة ومن معه ، غير أن هذا لا يمنع حكم العفو إن رضي به الولي؛ لأن الحق حقه ، وما أحسن قول عمر بن عبد العزيز بتفويضه إلى الإمام لينظر هل صار هذا القاتل مِزْهَقَ أَنْفُس ، وينبغي إن عُفي عنه أن تشدد عليه العقوبة أكثر من ضرب مائة وحَبس عام وإن لم يقولوه؛ لأن ذكر الله هذا الحكمَ بعد ذكر الرحمة دليلٌ على أن هذا الجاني غير جدير في هاته المرة بمزيد الرحمة ، وهذا موضع نظر من الفقه دقيق ، قد كان الرجل في الجاهلية يقتل ثم يدفع الدية ثم يغدره ولي الدم فيقتله وقريب من هذا قصة حُصين بن ضَمْضَم التي أشار إليها زهير بقوله :لَعَمْرِي لَنِعْمَ الحيُّ جَرَّ عليهِمُ ... بما لا يواتيهم حصين بن ضمضم\n\n",
      "translations": [
        {
          "translation": "29 (0 ye who believe! Retaliation is prescribed for you in the matter of the murdered ones; the freeman for the freeman) a freeman who premeditatedly kills another freeman, (and the slave for the slave) a slave who premeditatedly kills another, (and the female for the female) a female who premeditatedly kills another. This verse was revealed regarding two Arab clans but is abrogated by the verse: (... a life for a life) [5:45]. (And for him who is forgiven somewhat by his brother) whoever forgives the killing and takes instead blood money, (prosecution according to usage) Allah commands the person who asks for blood money to claim this money according to practised usage: three years if it is a full blood money, two years if it is half of the blood money, or one year if it is a third (and payment unto him) the person who is required to pay blood money is commanded to give the custodians of the murdered person what is due to them (in kindness) without the need to go to court or making it difficult for them. (This) this pardon (is an alleviation) appeasement (and a mercy from your Lord) towards the killer such that he is not killed. (He who transgresseth after this) after taking the blood money and kills the murderer (will have a painful doom) he shall be killed and will not be forgiven or allowed to pay blood money.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَمَنْ عُفِيَ لَهُ } معناهُ مَنْ تُركَ لَهُ\n ويقالُ العَفو أَخْذُ الدِّيةِ\n وقال ابن عباس: كانَ القِصَاصُ فِي بني إِسرائيل، ولمْ يكنْ لَهُمْ دِيةٌ\n فقالَ الله تعالى لِهَذِهِ الأُمةِ: { كُتِبَ عَلَيْكُمُ ٱلْقِصَاصُ فِي ٱلْقَتْلَى ٱلْحُرُّ بِالْحُرِّ وَٱلْعَبْدُ بِٱلْعَبْدِ وَٱلأُنثَىٰ بِٱلأُنْثَىٰ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ } فالعَفو: أَنْ يَقْبلَ الدِيةَ فِي العَمدِ اتّباعاً بالمَعْروفِ\n قالَ زيدُ بن علي عليهما السلامُ فيتَّّبعُ الطَالبُ بالمَعروفِ ويُؤدي المطْلوبُ إِليهِ بإِحْسَانٍ { ذٰلِكَ تَخْفِيفٌ مِّن رَّبِّكُمْ وَرَحْمَةٌ } مما كُتِبَ على مَنْ كَانَ قَبْلَكُمْ\n\n\n\n\nوقولهُ تعالى: { فَمَنِ ٱعْتَدَىٰ بَعْدَ ذٰلِكَ } معناهُ مَنْ قَتَلَ بَعدَ أَخْذِ الدّية؛ فإنه يقتل، ولا تقبل منه الدّية\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Whoever is forgiven (by Allah) will be forgiven,\" means whoever is left alone (by Allah) will be left alone.\n\n\nThe taking of the debt is called 'afw (pardon/forgiveness).\n\n\nAnd Ibn Abbas said: \"Retaliation was in force among the children of Israel, but they had no right of compensation.\"\n Allah said to this nation: {Retaliation is prescribed for you in the matter of the murdered: the free for the free, and the slave for the slave, and the female for the female. But if any remission is made by the brother of the slain, then grant any reasonable demand, and compensate him with handsome gratitude. This is a concession and a mercy from your Lord. After this whoever exceeds the limits shall be in grave penalty.} So at-Tafiyah (pardon/remission) is to accept the Diyah (blood-money) in Qisas (retaliation) following Ma'ruf (that which is known to be good).\n\n\nZaid ibn Ali said, \"The student should follow what is good and fulfill his obligations to his teacher with kindness. This is a lightening of your load from your Lord and a mercy.\" This is what is written for those before you.\n\n\nAnd the saying of Allah, {But whoever kills after that} means whoever kills after taking the ransom; he will kill, and the ransom will not be accepted from him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nالقصاص قانون من قوانين العدالة\n فُرِض لإزالة عدوان القوّة السبعية\n وهو ظلّ من ظلال عدله تعالى فإنه إذا تصرّف في عبده بإفنائه فيه عوّضه عن حرّ روحه روحاً موهوماً خيراً منه\n وعن عبد قلبه قلباً موهوباً\n وعن أنثى نفسه نفساً موهوبة كاملة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإن وقع فيكم أحياناً فاعلموا أنه { كُتِبَ } فُرض { عَلَيْكُمُ } في دينكم { ٱلْقِصَاصُ } بالمثل { فِي ٱلْقَتْلَى } المقتولين عمداً فيُقتل { ٱلْحُرُّ } القاتل { بِالْحُرِّ } المقتول { وَ }  كذا { ٱلْعَبْدُ } القاتل { بِٱلْعَبْدِ } المقتول\n وبالحر وبالطريق الأولى { وَ } كذا يُقتل { ٱلأُنثَىٰ } القاتلة حرة كانت أو أمة { بِٱلأُنْثَىٰ } المقتولة أيضاً\n كذلك لنظيرتها قياساً على الحر ةالعبد\n والأمة بالحرة بالطريق الأولى\n وكذا بالذكرين مهما وافى قتل الحر\n والحرة بالعبد والأمة\n فقد خولف فيه\n الظاهر أنه لم يقتل\n\n{ فَمَنْ عُفِيَ لَهُ } أي: للجاني والقاتل من المحقوق والسهام المشتركة بين الغرماء الطالبين منه قصاص أخيه المسلم المقتول بيده ظلماً { مِنْ أَخِيهِ شَيْءٌ } قليل من الحقوق المذكورة { فَٱتِّبَاعٌ بِٱلْمَعْرُوفِ } أي: فالحكم لازم عليكم في دينكم أيها الغرماء متابعة المعروف المستحسن عند الله وعند المؤمنين والرجوع إلى الدية وعدم القصاص { وَ } عليك أيها الجاني { أَدَآءٌ } أي: أ داء الدية التي هي فدية حياتك { إِلَيْهِ } أي: إلى و لي المقتول { بِإِحْسَانٍ } معتذراً نادماً متذللاً على وجه الانكسار بلا مطل وكسل { ذٰلِكَ } أي: سقوط القصاص بعد عفو البعض ولزوم الدية يدله { تَخْفِيفٌ } لكم أيها المؤمنون وإصلاح لحالكم { مِّن } قبل { رَّبِّكُمْ } أمَّا التخفيف بالنسبة إلى الغرماء فبتسكين القوة الغضبية\n وتليين الحمية العصبية بالمال المسرة لنفوسهم بعد وقوع ما وقع\n وأمَّا بالنسبة إلى الجاني فظاهر لإبقاء الحياة بالمال { وَرَحْمَةٌ } نازلة لكم من ربكم لتصفية كدورتكم الواقعة بينكم بواسطة القتل { فَمَنِ ٱعْتَدَىٰ } منكم وتجاوز عن الحمم { بَعْدَ ذٰلِكَ } المذكور بأن قتل الغرماءُ الجاني بعد عفو البعض وأخذ الدية\n أو امتنع الجاني عن أداء الدية على الغرماء { فَلَهُ } أي: لكل من المعتدين { عَذَابٌ أَلِيمٌ } [البقرة: 178] يؤاخذون في الدنيا بما صدر عنهم\n ويعاقبون عليها في الآخرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { عفا } لازمٌ يتعدى بالحرف: بعَنْ إلى الجناية\n وباللام إلى الجاني\n فيقال: عفوت لفلان عن جنايته و { ابتاعٌ } خبر عن مضمَر\n أي: فالأمر اتباع\n و { حياة } مبتدأ و { في القصاص } خبره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:18",
      "similarity": 0.5298385283526679
    },
    {
      "verse": "4:58",
      "similarity": 0.4490774200711773
    },
    {
      "verse": "2:283",
      "similarity": 0.28664779960206793
    },
    {
      "verse": "76:12",
      "similarity": 0.2665604898099215
    },
    {
      "verse": "35:21",
      "similarity": 0.2629933948379495
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002178.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002178.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:178.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}