{
  "chapter": "البقرة",
  "text": "ذلك بان الله نزل الكتب بالحق وان الذين اختلفوا۟ فى الكتب لفى شقاقۭ بعيد",
  "translations": [
    {
      "translation": "That is because Allah has sent down the Book with truth and those who differ from the Book are entrenched in hostility.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God has revealed the Book containing the truth; but those who are at variance about it have gone astray in their contrariness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was inspite of the fact that Allah had sent down the Book with the Truth but the people who sought differences in the Book swerved far away from the Truth in their disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has revealed the Book in all Truth and those who dispute it are filled with malice which has taken them far away from the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah has sent down the Book with the truth; and indeed those who caused disagreement in the Book are, surely, disputants in the extreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah has sent down the Book (the Qur'an) in truth. And verily, those who disputed as regards the Book are far away in opposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah has revealed the Book with the truth; and surely those who go against the Book are in a great opposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, because God has sent down the Book with the truth; and those that are at variance regarding the Book are in wide schism.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah hath revealed the Scripture with the truth. Lo! those who find (a cause of) disagreement in the Scripture are in open schism.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God has sent down the Book with the truth. And those who pursue differences in the Scriptures go much too far in dissension.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This shall be because Allah hath verily sent down the Book with truth: and verily those who differ respecting the Book. are surely in cleavage wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so because Allah has sent down the Book with the truth, and those who differ about the Book are surely in extreme defiance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their doom is) because Allah sent down the Book in truth but those who seek causes of dispute in the Book are in a schism Far (from the purpose).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah has sent down the Book (the Quran) in truth. And verily, those who disputed as regards the Book are far away in opposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah has sent down the Book with the truth; those who disagree about it are in extreme dissension.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God has revealed the Book in truth; and those who differ about the Book are in deep discord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is [deserved by them] because Allah has sent down the Book in truth. And indeed, those who differ over the Book are in extreme dissension.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:176] That, which has been mentioned of their eating of the Fire and what follows it, is because God has revealed the Book with the truth, but they are at variance regarding it, believing in parts of it while disbelieving in others, and concealing them; and those that are at variance regarding the Book, concerning this matter, namely, the Jews — although it is said that these are the idolaters some of whom said, with regard to the Qur’ān, that it was poetry, others, that it was sorcery, and others still, that it was divination — are in schism, disagreement, far removed, from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجيء باسم الإشارة لربط الكلام اللاحق بالسابق على طريقة العرب في أمثاله إذا طال الفصل بين الشيء وما ارتبط به من حكم أو علة أو نحوهما كقول النابغة: ... وذلك من تلقاء مثلك رائعبعد قوله: ... أتاني أبيتَ اللعن أنَّكَ لُمْتَنِيوالكلامُ السابق الأظهرُ أَنه قولُه : { فما أصبرهم على النار } \\[ البقرة : 175 \\] والمعنى أنهم استحقوا العذاب على كتمانهم بسبب أن الله أنزل الكتاب بالحق فكتمانُهم شيئاً من الكتاب كتمان للحق وذلك فساد وتغيير لمراد الله؛ لأن ما يُكتم من الحق يَخلفه الباطل كما بيناه آنفاً فحقَّ عليهم العذاب لكتمانه ، لأنه مخالف مراد الله من تنزيله ، وعليه فالكتاب في قوله : { بأن الله نزل الكتاب } هو عين الكتاب المذكور في قوله : { إن الذين يكتمون ما أنزل الله من الكتاب } \\[ البقرة : 174 \\] وهو كتابهم التوراة والإنجيل ليكون الموضوع في العلة والحكم المعلَّل واحداً ، وعليه فالجملة فصلت من الجملة التي قبلها لجريانها منها مجرى العلة .ويجوز أن يكون المشار إليه السابق هو الكتمان المأخوذ من { يكتمون } \\[ البقرة : 174 \\] ، أي إنما كتَموا ما كتموا بسبب أن الله نزل الكتاب بالحق فعلموا أنه على النعت الذي بَشر الله به على لسان التوراة . والمعنى أنهم كتموا دلائل صدق النبي حَسداً وعناداً؛ لأن الله أنزل القرآن على محمد ، فالكتاب هنا غير الكتاب في قوله : { إن الذين يكتمون ما أنزل الله من الكتاب } \\[ البقرة : 174 \\] .والجملة على هذا الوجه استئناف بياني لاستغراب تعمدهم كتمانَ ما أنزل الله من الكتاب وإن هذا الصنع الشنيع لا يكون إلاّ عن سبب عظيم ، فبُين بقوله تعالى : { ذك بأن الله نزل الكتاب بالحق } .وقوله : { وإن الذين اختلفوا في الكتاب لفي شقاق بعيد } تذييل ولكنه عطف بالواو لأنه يتضمن تكملة وصف الذين اشتروا الضلالة بالهدى ووعيدَهم ، والمرادُ بالذين اختلفوا عين المراد من قوله : { الذين يكتمون } \\[ البقرة : 174 \\] ، و { الذين اشتروا } \\[ البقرة : 175 \\] ، فالموصولات كلها على نسق واحد .والمراد من الكتاب المجرور بفي يحتمل أنه المرادُ من الكتاب في قوله : { نزل الكتاب } فهو القرآن فيكون من الإظهار في مقام الإضمار ليناسب استقلال جملة التذييل بذاتها ويكون المراد باختلفوا على هذا الوجه أنهم اختلفوا مع الذين آمنوا منهم أو اختلفوا فيما يصفون به القرآن من تكذيب به كلِّه أو تكذيببِ ما لا يوافق هواهم وتصديققِ ما يؤيد كتبهم ، ويحتمل أن المراد من الكتاب المجرور بفي هو المراد من المنصوب في قوله : { ما أنزل الله من الكتاب } \\[ البقرة : 174 \\] يعني التوراة والإنجيل أي اختلفوا في الذي يُقِرُّونه والذي يغيرونه وفي الإيمان بالإنجيل والإيمان بالتوراة ، ومن المحتمل أن يكون المراد بالذين اختلفوا في الكتاب ما يشمل المشركين وأن يكون الاختلاف هو اختلاف معاذيرهم عن القرآن إذْ قالوا : سحرٌ أو شعر أو كهانة أو أساطير الأولين . لكنه خروج عن سياق الكلام على أهل الكتاب ، ومن المحتمل أيضاً أن يكون المراد بالكتاب الجنس أي الذين اختلفوا في كتب الله فآمنوا ببعضها وكفروا بالقرآن .وفائدة الإظهار في مقام الإضمار في قوله : { الكتاب } أن يكون التذييل مستقلاً بنفسه لجريانه مجرى المثل ، وللمفسرين وجوه كثيرة في قوله : { وإن الذين اختلفوا في الكتاب } متفاوتة البعد .ووصف الشقاق بالبعيد مجاز عقلي أي بعيد صاحبُه عن الوفاق كقوله تعالى : { ولا يزالون مختلفين } \\[ هود : 118 \\] .\n\n",
      "translations": [
        {
          "translation": "(That is) the torment (because Allah hath revealed the Scripture) He sent down Gabriel with the Qur'an and the Torah (with the Truth) with an exposition of the Truth and falsehood, but they disbelieved. (Lo! Those who find disagreement in the Scripture) those who contravene that which is in the Book regarding the description and traits of Muhammad (pbuh) and further conceal the latter (are in open schism) are too much in disagreement with guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } العذاب الذي استحقوه وتجرءوا عليه بسبب أن { الله } تعالى { نزل الكتاب } القرآن ملتبساً { بالحق } \n فاختلفوا فيه فآمنوا ببعض وكفروا ببعض\n { وإن الذين اختلفوا في الكتاب لفي شقاق بعيد } أي: لفي خلاف وضلال بعيد\n الإشارة: كل من كتم علمه\n ولم ينشرْه إلا في مقابلة حظ دنيوي\n صَدَق عليه قولُه تعالى: { ويشترون به ثمناً قليلاً أولئك ما يأكلون في بطونهم إلا النار }\n رُوِيَ أن بعض الصحابة كان يُقرئ أهل الصُّفّة\n فأَهْدَى له أحدُهم قوساً\n فأتى به النبيَّ صلى الله عليه وسلم\n فقال: يا رسول الله: كنت أُعلِّمُ أهلَ الصفة فأهدى لي فلان قوساً\n وقال: هو لله\n فقال له - عليه الصلاة والسلام -:\n \" لقدْ تقلدتَ قَوسْاً مِنْ نَارِ جَهنم \" \nأو كما قال صلى الله عليه وسلم\n وأمره بردِّه\n ولعل هذا من باب الورع\n فأراد عليه السلام أن يرفع همة ذلك الصحابي\n وإلا فقد ورد في الحديث:\n \" أَحَقُّ ما أَخَذْتُمْ علَيْهِ الأجرَ كتَابُ اللّهِ \"\n \nفمن ملَكَتْه نفسه\n وأسره الهوى\n فقد اشترى الضلالة بالهدى\n اشترى الضلالة عن طريق أولياء الله\n بالهدى الذي كان له ملَكَ نفسه وهواه\n وعذابَ القطيعة والحجاب\n بالمغفرة والدخول مع الأحباب\n فما أصبرهم على غم الحجاب وسوء الحساب\n سبب ذلك اختلاف قلبه\n وتفريق همه ولُبَّه\n وقد قال - عليه الصلاة والسلام -:\n\n \" اقْرَءوا القُرْآنَ ما ائْتَلَفَتْ عَلَيْهِ قُلُبُكمْ\n فَإِذَا اخْتَلَفْتُمْ فَقُومُوا \" \nأو كما قال: وسببت تفرق القلب وعدم حضوره\n حبُّ الدنيا فقد قال عليه الصلاة والسلام:\n \" مَنْ كَانَت الدُّنيا هَمَّهُ فَرَّقَ اللّهُ عَلَيْه أمْرَه\n وَجَعَلَ فَقْرَهُ بَيْنَ عَيْنَيْهِ\n ولَمْ يَأتِهِ مِنَ الدُّنْيا إلا من قُسِمَ لَهُ\n ومن كَانَتِ الآخرةُ نيته\n جَمَعَ اللّهُ عليه أمْرَهُ\n وَجَعَلَ غِنَاهُ في قَلْبه\n وأتتْهُ الدُنيَا وَهِيَ رَاِغِمةً \"\n \nوالقلب الذي اختلَف في فهم الكتاب وتشتَّت عنه في شقاق بعيد عن الحضرة لأن عُنْوان صحة القلب: جمعُه على كلام الله وتدبر خطابه والتلذذ بسماعه\n وقد تقدم في أول السورة درجات القراءة: فانظره إن شئت\n وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:1",
      "similarity": 0.6933464367641466
    },
    {
      "verse": "80:26",
      "similarity": 0.6914648631506278
    },
    {
      "verse": "41:52",
      "similarity": 0.6617224243554616
    },
    {
      "verse": "38:2",
      "similarity": 0.6360919050533248
    },
    {
      "verse": "8:13",
      "similarity": 0.6288238157768976
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002176.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002176.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:176.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}