{
  "chapter": "البقرة",
  "text": "انما حرم عليكم الميتة والدم ولحم الخنزير وما اهل به لغير الله فمن اضطر غير باغ ولا عاد فلا اثم عليه ان الله غفور رحيم",
  "translations": [
    {
      "translation": "He has only forbidden you carrion, blood and pork and what has been consecrated to other than Allah. But anyone who is forced to eat it - without desiring it or going to excess in it - commits no crime. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are carrion and blood, and the flesh of the swine, and that which has been consecrated (or killed) in the name of any other than God. If one is obliged by necessity to eat it without intending to transgress, or reverting to it, he is not guilty of sin; for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has only forbidden you to eat what dies of itself, and blood and swine flesh and what has been consecrated to any other name than of Allah. But one will incur no sin if, forced by absolute necessity, he eats of any of these forbidden things, provided he has no intention of transgressing the law and does not take more than what is absolutely indispensable: for Allah is very Forgiving and very Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has forbidden you to eat that which has not been properly slaughtered, blood, pork, and the flesh of any animal which has not been consecrated with a mention of the Name of God. However, in an emergency, without the intention of transgression or repeating transgression, one will not be considered to have committed a sin. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden for you only the carrion, and blood, and flesh of swine, and the animal that has been slaughtered while proclaiming the name of anyone other than Allah; so there is no sin on him who is compelled and does not eat out of desire, nor eats more than what is necessary; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only the Maitah (dead animals), and blood, and the flesh of swine, and that which is slaughtered as a sacrifice for other than Allah. But if one is forced by necessity without willful disobedience nor transgressing due limits, then there is no sin on him. Truly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden you what dies of itself, and blood, and flesh of swine, and that over which any other (name) than (that of) Allah has been invoked; but whoever is driven to necessity, not desiring, nor exceeding the limit, no sin shall be upon him; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These things only has He forbidden you: carrion, blood, the flesh of swine, what has been hollowed to other than God. Yet who so is constrained, not desiring nor transgressing, no sin shall be on him; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath forbidden you only carrion, and blood, and swineflesh, and that which hath been immolated to (the name of) any other than Allah. But he who is driven by necessity, neither craving nor transgressing, it is no sin for him. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only carrion, blood, and the flesh of swine; also any flesh that is consecrated other than in the name of God. But for one who is driven by necessity, neither craving nor transgressing, it is no sin. For God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath only forbidden unto you the carcass and blood and the flesh of swine, and that over which is invoked the name of other than Allah. But whosoever is driven by necessity, neither alusting nor transgressing, for him is no sin; verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only carrion, blood, the flesh of the swine, and that which has been offered to other than Allah. But should someone be compelled, without being rebellious or transgressive, there shall be no sin upon him. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath only forbidden you dead meat, and blood, and the flesh of swine, and that on which any other name hath been invoked besides that of Allah. But if one is forced by necessity, without wilful disobedience, nor transgressing due limits,- then is he guiltless. For Allah is Oft-forgiving Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only the Maytatah (dead animals), and blood, and the flesh of swine, and that which is slaughtered as a scrifice for others than Allah (or has been slaughtered for idols, etc., on which Allah's Name has not been mentioned while slaughtering). But if one is forced by necessity without wilful disobedience nor transgressing due limits, then there is no sin on him. Truly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you the dead, blood, and the flesh of swine, also that which is invoked to other than Allah. But whoever is constrained (to eat) any of these, not intending to sin or transgress, incurs no guilt. Allah is Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you carrion, and blood, and the flesh of swine, and what was dedicated to other than God. But if anyone is compelled, without desiring or exceeding, he commits no sin. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden to you dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit], there is no sin upon him. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:173] He has only forbidden you: carrion, that is, the consumption of it, since this is the subject of the general address here, and similarly [the consumption of] what follows, [all of] which is what has not been slaughtered in accordance with [prescriptions of] the Law; to this the Sunna adds [as also constituting carrion] what has been severed from a living creature. A special status is, however, accorded fish and locusts; blood, poured forth, as in [sūrat] al-An‘ām [see Q. 6:145], the flesh of swine, the meat is singled out for mention because that [part] is what people mostly seek, every other [part] being implied thereby; what has been hallowed to other than God, that is to say, what has been slaughtered in other than His Name (al-ihlāl is the raising of one’s voice, which they used to do when sacrificing for their gods). Yet whoever is constrained, forced by dire need to eat of the above-mentioned, not desiring, to rebel against Muslims, nor transgressing, committing aggression against them by waylaying them, no sin shall be on him, for eating it. God is Forgiving, to His friends, Merciful, to those who are obedient to Him, for He has granted them wide berth in this matter. The aggressor and the transgressor are excluded from this [dispensation], and to these two [categories] one should also add every person that sets out on a journey in disobedience, such as the fugitive or the excise collector, for whom it would be unlawful to eat any of the mentioned, unless they repent [of their disobedience]; this is the opinion of al-Shāfi‘ī.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah exposited what He made unlawful for them, saying: (He hath forbidden you only carrion) which He has commanded to immolate, (and blood) and shed blood, (and swineflesh, and that which hath been immolated to any other than Allah) that which is offered as sacrifice purposefully in any other thing than the Name of Allah, i.e. to idols. (But he who is driven by necessity) compelled to eat carrion (neither craving) 28 neither rebelling nor declaring it lawful (nor transgressing) nor committing highway robbery nor purposefully eating it without being driven by necessity, (it is no sin for him) then such a person, who is compelled to eat it without having his fill and without taking anything with him, has not transgressed. (Lo! Allah is Forgiving) that he ate more than he needs to preserve himself, (Merciful) when He gave him legal dispensation to eat carrion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَآ أُهِلَّ بِهِ لِغَيْرِ ٱللَّهِ } معناهُ أُرِيدَ بهِ غَيرُ الله\n والإهْلاَلُ: رفعُ الصوتِ بذكرِ الله، وذِكْرِ غَيرِهِ\n\n\n\n\nوقولهُ تعالى: { غَيْرَ بَاغٍ وَلاَ عَادٍ } والبَاغِـ[ـي] الذي يَأكلُ المِيتَةَ عَنْ غَيْر اضْطِرارٍ إِليها\n والعَاد [ي] الذي يَشْبَعُ مِنهُ\n فالمِيتةُ تُحلُّ لَهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {And nothing is given to it {the fire} except for God} [means] that He only wants for it other than God.\n\n\nAnd the exhalation: raising the voice with the mention of Allah, and the mention of others.\n\n\nAnd His saying, {There is neither grazing nor rebellion} - the grazing is that which consumes dead flesh without being compelled to do so.\n\n\nAnd the habit that one becomes satiated from it\n\n\nThe dead person is purified for him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما حرّم عَلَيكم المِيتة } لجمود الدم فيها، وبعدها عن الاعتدال بانحراف المزاج { والدم } لاختلاطه بالفضلات النجسة البعيدة عن قبول الحياة والعدالة والنورية وعدم صلاحيته لذلك بعد لقصور النضج { ولحْم الخِنْزير } لغلبة السبعية والشره ومباشرة القاذورات والدياثة على طبعه فيولد في أكله مثل ذلك { وما أُهِلّ به لِغَير الله } أي: رفع الصوت بذبحه لغير الله يعني ما قصد بذبحه وأكله الشرك لمنافاته التوحيد سفيراً عن الشرك\n ويفهم منه ما يقوي آكله به على الكلام ورفع الصوت لغير الله أي: كل ما يؤكل لا على التوحيد فهو محرّم على آكله { فمنِ اضطرّ } أي: من الجماعة { غير بَاغٍ } على مضطرّ آخر باستئثاره { ولا عَادٍ } سدّ الرمق { فلا إثمَ عليه }\n { ما يَأْكُلون في بُطُونهم } أي: ملء بطونهم إلا ما هو وقود نار الحرمان وسبب اشتعال نيران الطبيعة الحاجبة عن نور الحق المعذبة بهيئات السوء المظلمة الموقعة صاحبها في جحيم الهيولى الجسمانية { ولا يكلمهم الله ولا ينظر إليهم } عبارة عن شدّة غضبه عليهم وبعدهم عنه\n { ليس البرّ أن تولوا وجوهكم } مشرق عالم الأرواح ومغرب عالم الأجساد، فإنه تقيد واحتجاب { ولكن البرّ } برّ الموحدين الذين آمنوا بالله والمعاد في مقام الجمع، إذ التوحيد في مقام الجمع يلزمه البقاء الأبديّ الذي هو المعاد الحقيقي\n وشاهدوا الجمع في تفاصيل الكثرة ولم يحتجبوا بالجمع عن التفصيل الذي هو باطن عالم الملائكة وظاهر عالم النبيين\n { والكِتَاب } الذي جمع ببين الظاهر بالأحكام والمعارف، وأفاد علم الاستقامة ثم استقاموا بعد تمام التوحيد جمعاً وتفصيلاً بالأعمال المذكورة، فإن الاستقامة عبارة عن وقوف جميع القوى على حدودها بالأمر الإلهي لتنوّرها بنور الروح عند تحقق صاحبها بالله في مقام البقاء بعد الفناء وذلك مقام العدالة، فتكون هي في ظلّ الحق منخرطة في سلك الوحدة بكليتها\n { على حبه } أي: في حال الاحتياج إليه والشحّ به، كما قال ابن مسعود: أن تؤتيه وأنت صحيح شحيح، تأمل العيش، وتخشى الفقر، ولا تمهل حتى إذا بلغت الحلقوم، قلت لفلان: كذا، ولفلان: كذا\n قال الله تعالى:\n\n[الحشر، الآية: 9] أو على حب الله لئلا يشغل قلبه عنه ولأنه تعالى يرضى بإيتائه أو على حبّ الإيتاء، يعني: بطيب النفس، فإن الكريم هو الفرح وطيب النفس بالإعطاء\n ومن قوله: { وآتى المال } إلى قوله: { وآتى الزكاة } من باب العفة التي هي كمال القوة الشهوانية ووقوفها على حدّها فيما يتعلق بها، وقوله: { والموفون بعَهْدهم إذا عَاهَدوا } من باب العدالة المستلزمة للحكمة التي هي كمال القوّة النطقية فإنها ما لم تعلم تبعة الغدر والخيانة وفائدة الفضيلة المقابلة لهما، لم تف بالعهد",
      "translations": [
        {
          "translation": "\n\n\"The only thing that is forbidden to you is carrion, for it is disgusting.\",\n\nAfter that, due to the deviation of the mood {and the blood}, it mixes with the remote impurities and is far from accepting life, justice, and light, and it is not eligible for that after the exhaustion of maturity {and pork meat}. Most of them are seven and evil, and the immediate qazwrat and di'is are stamped on their food. Such as {and what is not allowed for anyone but God}, that is, raising the voice with his slaughter for anyone but God means what is intended by his slaughter and eating him. The polytheism is a representative of the polytheism of the unity.\n\n\nHe understands from it that which strengthens his appetite for speech and raises his voice to others besides Allah, that is, anything he eats that is not in the name of Allah is forbidden to him. {If someone is compelled} that is, by the community, {and is not willful} that is, he does not have the means to resist, {and is not rebellious} that is, he does not openly defy the authorities, {then there is no sin on him}\n\n\n{They do not eat in their bellies} i.e. they are not filled with their bellies except for the fuel of the fire of Hell and the cause of the ignition of the natural fire in front of the light of the punished Truth with the dark, evil structures that are located with it in the body of the Hell of Hell {And Allah does not speak to them or look at them} a statement of His severe anger against them and after them.\n\n\nNot all that is faced eastwards in the world of the spirits is necessarily faced westwards in the world of the bodies.,\n\nThis verse is about {but the believer} the believer in God and the Hereafter, who is in a position of unity.,\n\nThe unity of God in the act of creation requires His eternal existence, which is the true return.\n\n\nThey saw the multitude in the details of the many, and they did not conceal the multitude from the detail that is the innermost secret of the world of the angels and the outermost secret of the world of the prophets.\n The Book which has gathered together the apparent with the knowledge.,\n\nAnd the science of uprightness {al-istiqamah} attested to their uprightness {istiqamah} after they had completed their declaration of {tawhid} in both its general and specific aspects through the aforementioned deeds.,\n\nThe meaning of \"Al-Istiqamah\" is to stand firm on the path of Allah with all one's power, in order to be enlightened by the light of the Spirit, when one's Lord is realized in the station of remaining after annihilation. And that is the station of justice.,\n{She} will be {engaged} in the {truth} {entirely}, {immersed} in the {path} of {unity} with {all} {of her}.\n\n\n{For his love}, meaning: when in need of him and longing for him,\n\nAs Ibn Mas'ud said: \"Give him {advice} when you are upright and straightforward.\",\n\nContemplate life.,\n\nAnd fear poverty.,\n\nDo not delay until you reach the point of no return.,\n\nI said to so-and-so, \"Thus it is.\",\n\n{And so it is with} {such and such}.\n\n\n\"Allah said {Qul huwa Allāhu ahad}, 'Say, \"He is Allah, [who is] One.\"'\"\n The Resurrection\n\nالحشرات\nEnglish: The Resurrection,\n\nOr, out of love for Allah, so that one's heart is not distracted from Him. And Allah is pleased with those who make offerings to Him.,\n\nThis means: \"With a good heart.\", The generous person is the one who is happy and content with giving.\n\nAnd from his saying: {And the money came} to his saying: {And the Zakat came}, from the chapter of Al-'Afw which is the perfection of sexual potency and its stopping at its limit in what is related to it., And when he says: {And those who are firmly committed to their covenant when they make a covenant}, this is from the perspective of the justice that is required of the wisdom that is the perfection of the vocal power, for it is what does not know the following of treachery and betrayal and the benefit of the opposite virtue to them., You have not kept your promise",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم يا أكمل الرسل نيابة: { إِنَّمَا حَرَّمَ عَلَيْكُمُ } أي: ما حرم ربكم عليكم في دينكم من الحيوانات إلا { ٱلْمَيْتَةَ } حتف نفسه بلا تزيكة وتهليل { وَٱلدَّمَ } السائل من أي وجه كان { وَلَحْمَ ٱلْخِنزِيرِ } المرخص في الأديان الأخر لنجاسة عينه طبعاً وشرعاً { وَمَآ أُهِلَّ } صوت { بِهِ لِغَيْرِ } اسم { ٱللَّهِ } عند ذبحه من أسماء الأصنام، وإنما حرم عليكم هذه الأشياء وقت سعتكم { فَمَنِ ٱضْطُرَّ } منكم حال كونه { غَيْرَ بَاغٍ } للولاة القائمين بحدود الله { وَلاَ عَادٍ } مجاوزاً عن شدة الجوعة إلى وقت السعة { فَلاۤ إِثْمَ عَلَيْهِ } إن تناول منها مقدار سد الرمق { إِنَّ ٱللَّهَ } المرخص لكم في أمثال المضائق والاضطرار { غَفُورٌ } سائر لكم عن أمثال هذه الجراءة { رَّحِيمٌ } [البقرة: 173] علكيم بهذه الرخصة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:115",
      "similarity": 0.982310862459987
    },
    {
      "verse": "6:145",
      "similarity": 0.7397324093288513
    },
    {
      "verse": "22:37",
      "similarity": 0.35604094105713513
    },
    {
      "verse": "2:189",
      "similarity": 0.34040559486316857
    },
    {
      "verse": "5:60",
      "similarity": 0.27843600679871283
    }
  ]
}