{
  "chapter": "البقرة",
  "text": "ان الذين يكتمون ما انزل الله من الكتب ويشترون به ثمنا قليلا او۟لئك ما ياكلون فى بطونهم الا النار ولا يكلمهم الله يوم القيمة ولا يزكيهم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "Those who conceal what Allah has sent down of the Book and sell it cheap, take nothing into their bellies but the Fire. On the Day of Rising Allah will not speak to them or purify them. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal any part of the Scriptures that God has revealed, and thus make a little profit thereby, take nothing but fire as food; and God will not turn to them on the Day of Resurrection, nor nourish them for growth; and their doom will be painful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those, who conceal the Commands that Allah has sent down in His Book and barter them away for paltry worldly gains, fill their bellies with fire. Allah will not speak to them on the Day of Resurrection, nor will He regard them as pure; \"a there is a painful torment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who receive some small gain by hiding the Books which God has revealed, have, in fact, filled up their stomachs with fire. God will not speak with them on the Day of Judgment, nor will He purify them; instead, they will face a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hide the Book sent down by Allah and exchange it for an abject price – they only fill their bellies with fire and Allah will not speak to them on the Day of Resurrection nor will He purify them; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who conceal what Allah has sent down of the Book, and purchase a small gain therewith (of worldly things), they eat into their bellies nothing but fire. Allah will not speak to them on the Day of Resurrection, nor purify them, and theirs will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who conceal any part of the Book that Allah has revealed and take for it a small price, they eat nothing but fire into their bellies, and Allah will not speak to them on the day of resurrection, nor will He purify them, and they shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal what of the Book God has sent down on them, and sell it for a little price - they shall eat naught but the Fire in their bellies; God shall not speak to them on the Day of Resurrection neither purify them; there awaits them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who hide aught of the Scripture which Allah hath revealed and purchase a small gain therewith, they eat into their bellies nothing else than fire. Allah will not speak to them on the Day of Resurrection, nor will He make them grow. Theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal any part of the Scriptures which God has revealed in order to gain some paltry end, simply fill their bellies with Fire. On the Day of Resurrection, God will neither speak to them nor purify them. They will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who hide that which Allah hath sent down in the Book and Purchase therewith a small gain, these are they who eat in their bellies naught but Fire. Allah will not speak unto them on the Day of Resurrection, nor purify them; and unto them shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who conceal what Allah has sent down of the Book and sell it for a paltry gain—they do not take in, into their bellies, [anything] except fire, and Allah shall not speak to them on the Day of Resurrection, nor shall He purify them, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal Allah's revelations in the Book, and purchase for them a miserable profit,- they swallow into themselves naught but Fire; Allah will not address them on the Day of Resurrection. Nor purify them: Grievous will be their penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who conceal what Allah has sent down of the Book, and purchase a small gain therewith (of worldly things), they eat into their bellies nothing but fire. Allah will not speak to them on the Day of Resurrection, nor purify them, and theirs will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal what Allah has sent down of the Book and sell it for a small price shall swallow nothing but fire into their bellies. On the Day of Resurrection, Allah will neither speak to them nor purify them. Theirs shall be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal what God revealed in the Book, and exchange it for a small price—those swallow nothing but fire into their bellies. And God will not speak to them on the Day of Resurrection, nor will He purify them, and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they who conceal what Allah has sent down of the Book and exchange it for a small price - those consume not into their bellies except the Fire. And Allah will not speak to them on the Day of Resurrection, nor will He purify them. And they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:174] Those who conceal what God has revealed of the Scripture, comprising all the descriptions of Muhammad (s), meaning the Jews, and sell it for a little price, in this world, taking this [little price] in its place from the debased ones among them, for fear of losing out if they were to manifest it [sc. the truth of Muhammad (s)] — they shall consume nothing in their bellies but the Fire, because that is their journey’s end; God shall not speak to them on the Day of Resurrection, out of anger with them, neither purify them, from the filth of sin; and theirs is a painful chastisement, that is, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those who hide anything of the Scripture which Allah hath revealed) what Allah has exposited in the Torah regarding the description and traits of Muhammad, (and purchase) by concealing this (a small gain therewith) a small profit, this was revealed about Ka'b Ibn al-Ashraf, Huyayy Ibn Akhtab and Judayy Ibn Akhtab (they eat into their bellies) they put into their bellies (nothing else than fire) except the unlawful; and it is also said that this means: they eat nothing except that which will turn into fire in their bellies on the Day of Judgement. (And Allah will not speak to them) nicely (on the Day of Resurrection, nor will He make them pure) He will not absolve them of their transgressions; it is also said that this means: He will not commend them in any good way. (Theirs will be a painful doom) a painful torment that will extend to their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والكِتَاب } الذي جمع ببين الظاهر بالأحكام والمعارف\n وأفاد علم الاستقامة ثم استقاموا بعد تمام التوحيد جمعاً وتفصيلاً بالأعمال المذكورة\n فإن الاستقامة عبارة عن وقوف جميع القوى على حدودها بالأمر الإلهي لتنوّرها بنور الروح عند تحقق صاحبها بالله في مقام البقاء بعد الفناء وذلك مقام العدالة\n فتكون هي في ظلّ الحق منخرطة في سلك الوحدة بكليتها\n { على حبه } أي: في حال الاحتياج إليه والشحّ به\n كما قال ابن مسعود: أن تؤتيه وأنت صحيح شحيح\n تأمل العيش\n وتخشى الفقر\n ولا تمهل حتى إذا بلغت الحلقوم\n قلت لفلان: كذا\n ولفلان: كذا\n قال الله تعالى:\n[الحشر\n الآية: 9] أو على حب الله لئلا يشغل قلبه عنه ولأنه تعالى يرضى بإيتائه أو على حبّ الإيتاء\n يعني: بطيب النفس\n فإن الكريم هو الفرح وطيب النفس بالإعطاء\n ومن قوله: { وآتى المال } إلى قوله: { وآتى الزكاة } من باب العفة التي هي كمال القوة الشهوانية ووقوفها على حدّها فيما يتعلق بها\n وقوله: { والموفون بعَهْدهم إذا عَاهَدوا } من باب العدالة المستلزمة للحكمة التي هي كمال القوّة النطقية فإنها ما لم تعلم تبعة الغدر والخيانة وفائدة الفضيلة المقابلة لهما\n لم تف بالعهد\n وقوله: { والصابرين في البأساء } أي: الشدّة والفقر { والضرّاء } أي: المرض والزمانة { وحين البأس } أي: الحرب من باب الشجاعة التي هي كمال القوّة الغضبية { أولئك } الموصوفون بهذه الفضائل كلها\n الثابتون في مقام الاستقامة { الذين صدقوا } الله في مواطن التجريد بأفعالهم التي هي البرّ كله { وأولئك هم المتقون } عن محبة غير الله حتى النفس\n المجرّدون عن غواشي النشأة والطبيعة\n\nويمكن أن يؤوّل المال بالعلم الذي هو مال القلب\n لأنه يقوى به ويستغنى\n أي: أعطي العلم مع كونه محبوباً ذوي قربى القوى الروحانية لقربها منه\n ويتامى القوى النفسانية لانقطاعها عن نور الروح الذي هو الأب الحقيقيّ ومساكين القوى الطبيعية لكونها دائمة السكون لثواب البدن وعلمها علم الأخلاق والسياسات الفاضلة\n ثم إذا ارتوى من العلم\n علم المعارف والأخلاق والآداب والمعايش جملة وتفصيلاً وفرغ من نفسه\n أفاض على أبناء السبيل\n أي: السالكين والسائلين\n أي: طلبة العلم وفي فكّ رقاب عبدة الدنيا والشهوات من أسرهم بالوعظ والخطابة وأقام صلاة الحضور\n أي: أدامها بالمشاهدة\n وآتى ما يزكي نفسه عن النظر إلى الغير\n والتفاتات الخواطر بالنفي\n ومحو الصفات\n والموفون بعهد الأزل بملازمة التوحيد وإفناء الذات والآتية\n والصابرين في بأساء الافتقار إلى الله دائماً\n وضرّاء كسر النفس وقمع الهوى\nوحين بأس محاربة الشيطان\n أولئك الذين صدقوا الله فى الوفاء بعهده وعزيمة السلوك وعقده\n وأولئك هم المتقون عن الشرك\n المنزّهون عن البقية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ يَكْتُمُونَ مَآ أَنزَلَ ٱللَّهُ } المدبر لأمور عباده { مِنَ ٱلْكِتَابِ } المبين لهم طريق الرشاد والسداد\n ويظهرون بدله ما تشتهيه نفوسهم وترتضيه عقولهم عتواً واستكباراً { وَيَشْتَرُونَ بِهِ } أي: بكتمان كتاب الله { ثَمَناً قَلِيلاً } من ضعفاء الناس على وجه التحف والهدايا { أُولَـٰئِكَ } الكاتمون طريق الحق\n الناكبون عن منهج الصدق { مَا يَأْكُلُونَ } بهذه الحيلة والتزوير\n لا يستحيل { فِي بُطُونِهِمْ إِلاَّ ٱلنَّارَ } أي: نار الحرص والطمع المقتبسة من نيران الإمكان المنتهية إلى نار الجحيم\n أعاذنا الله منها { وَ } من فطاعة أمرهم وسناعة صنيعهم { لاَ يُكَلِّمُهُمُ ٱللَّهُ } المنكشف عن أحوال العباد { يَوْمَ ٱلْقِيَامَةِ } ليجزيهم على مقتضى أعمالهم التي كانوا عليها في النشأة الأولى\n بل يسوقهم إلى النار بلا كشفٍ عن حالهم { وَ } بعد ما ساقهم إليها { لاَ يُزَكِّيهِمْ } أي: لا يطهرهم الله بها كما يطهر عصاة المؤمنين بالنار\n ثم يخرجهم إلى الجنة\n يبقون فيها خالدين { وَلَهُمْ } فيها { عَذَابٌ أَلِيمٌ } [البقرة: 174] مؤلم غير منقطع أبداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ما } تعجبية\n مبتدأ\n وهي نكرة\n وسوَّغَ الابتداء َ معنى التعجب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:77",
      "similarity": 0.6532275793389412
    },
    {
      "verse": "16:95",
      "similarity": 0.5167986245349342
    },
    {
      "verse": "3:187",
      "similarity": 0.5117953142950242
    },
    {
      "verse": "9:9",
      "similarity": 0.5065537873423517
    },
    {
      "verse": "2:79",
      "similarity": 0.506297317861242
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:174.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:174.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:174.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}