{
  "chapter": "البقرة",
  "text": "ولكم فى القصاص حيوة ياو۟لى الالبب لعلكم تتقون",
  "translations": [
    {
      "translation": "There is life for you in retaliation, people of intelligence, so that hopefully you will have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In retribution there is life (and preservation). O men of sense, you may haply take heed for yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is security of life for you in the law of retribution. It is expected that you will refrain from breaking this law.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of understanding, the law of the death penalty as retaliation grants you life so that perhaps you will have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is life for you in retribution, O men of understanding, so that you may avoid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is (a saving of) life for you in Al-Qisas (the Law of equality in punishment), O men of understanding, that you may acquire Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is life for you in (the law of) retaliation, O men of understanding, that you may guard yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In retaliation there is life for you, men possessed of minds; haply you will be godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is life for you in retaliation, O men of understanding, that ye may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In [this law of] retribution there is life for you, O people of understanding, so that perhaps you will be mindful of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for you in retaliation is life men of insight! that haply ye may fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is life for you in retribution, O you who possess intellects! Maybe you will be Godwary!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Law of Equality there is (saving of) Life to you, o ye men of understanding; that ye may restrain yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is (a saving of) life for you in Al-Qisas (the Law of Equality in punishment), O men of understanding, that you may become Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O owners of minds, for you in retaliation is life, in order that you be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is life for you in retaliation, O people of understanding, so that you may refrain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is for you in legal retribution [saving of] life, O you [people] of understanding, that you may become righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:179] In retaliation there is life for you, that is great longevity, O people of pith, possessors of intellect, because if the would-be killer knew that he would be killed [in retaliation], he would refrain [from such action] and would have thereby given life to himself and to the one whom he had intended to kill; and so it [retaliation] was stipulated by the Law, so that you might fear killing, fearing retaliation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And there is a life for you in retaliation) a continuation of existence and a lesson, (0 men of understanding) those who possess sound minds among people, (that ye may ward off (evil)) that you may ward off killing one another for fear of retaliation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَكُمْ فِي ٱلْقِصَاصِ حَيَٰوةٌ } معناه بقاءٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {And for you in retaliation is life} means existence.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولكم } في مقاصّة الله إياكم بما ذكر { حياة } عظيمة\n أي: حياة لا يوصف كنهها { يا أولي الألباب } أي: العقول الخالصة عن قشر الأوهام وغواشي العينيات والأجرام\n فكذا في هذا القصاص - لكي تتقوا تركه وتحافظوا عليه - الوصية والمحافظة عليها قانون آخر فُرِضَ لإزالة نقصان القوّة الملكية\n أي: القوّة النطقية وقصورها عما يقتضي الحكمة من التصرّف في الأموال\n والسلطنة على القوّتين الأخريين بنور الحق وحكم الشرع\n ومنعها عن عدوانها أيضاً بتبديل الوصية الذي هو نوع من الجريمة والخيانة\n وتحريضها على التحقيق والتدقيق في باب الحكمة التي هي كمالها بالإصلاح بين الموصى لهم على مقتضى الحكمة\n إذا توقع وعلم من الموصي إضراراً بالسهو والعمد - الصيام قانون آخر مما فُرِضَ لإزالة عدوان القوّة البهيمية وتسلطها - واعلم أنّ قصاص أهل الحقيقة ما ذكر\n ووصيتهم هي بالمحافظة على عهد الأزل بترك ما سوى الحق\n كما قال تعالى:\n[البقرة: 132]\n وصيامهم هو الإمساك عن كلّ قول وفعل وحركة وسكون ليس بالحق للحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَكُمْ } أيها الموحدون المكاشفون بسرائر الشرائع والنواميس الإلهية الموضوعة بين المؤمنين في هذه النشأة خصوصاً { فِي ٱلْقِصَاصِ } المسقط للجرائم الصادرة من جوارحكم البادية عليها { حَيَٰوةٌ } عظيمة حقيقية لكم في النشأة الأخرى\n إذ لا يؤاخذون عليه بعد مؤاخذتكم في النشأة الأولى { يٰأُولِي ٱلأَلْبَابِ } الناظرين بنور الحق في لب الأمور المعرضين عن قشوره { لَعَلَّكُمْ تَتَّقُونَ } [البقرة: 179] رجاء أن تتحفظوا عن مقتضى القوى البهمية\n المنافية لطريق التوحيد المبني على الاعتدال والوفاق\n المؤدية إلى أمثال هذه الخبائث\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { لكم } خبر ثان\n أو صلة له\n أو حال من الضمير المستكِنْ فيه\n وفيه من البلاغة والفصاحة ما لا يخفى\n جعل الشيء مجيء ضده\n وعرّف القصاص ونكْر الحياة ليدل على التعظيم والتعميم\n أي: ولكم نوع من الحياة عظيم\n وذلك لأن العلم به يَرْدَع القاتل عن القتل\n فيكون سببَ حياةِ نَفْسَيْن\n ولأنهم كانوا يقتلون غير القاتل\n والجماعة بالواحد\n فتثور الفتنة بينهم\n فإذا اقتُصّ من القاتل سَلِم الباقون\n ويصيرُ ذلك سبباً لحياتهم\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: يا أيها المؤمنون { كتب عليكم القصاص في } شأن { القتلى } في العَمْد\n فاستسلِموا للقصاص\n فالحُر يُقتل { بالحر } \n ولا يقتل بالعبد\n بل يغرم قيمته لسيده\n ودليله قوله - عليه الصلاة والسلام-:\n \" لا يُقتل مسلمٌ بكافرٍ ولا حرٌ بعبدٍ \" \nوالعبد يقتل بالعبد\n إن أراد سيد المقتول قتله\n فإن استحياه خُيِّر سيدُه بين إسلامه وفدائه بقيمة العبد\n وكذلك إن قُتل الحر خُيّر أولياؤُه بين قتله أو استرقاقه\n فإن استحيَوْه خُيِّر سيدُه بين إسلامه وفدائه بِدِيَةِ الحر العَمْد\n والأنثى تُقتل بالأنثى والذكر\n والذكر يقتل بالأنثى\n وتخصيصُ الآية بالمُساوي\n قال مالك: أحسنُ ما سمعتُ في هذه الآية: أنه يُراد بها الجنسُ - أي: جنس الحر - والذكر والأنثى فيه سواء\n وأعيدَ ذِكْرُ الأنثى تأكيداً وتهمُّمَا بإذهاب أمر الجاهلية\n هـ\n يعني أن أل في الحر: للجنس\n تشمل الذكر والأنثى\n وأعاد ذكر الأنثى اهتماماً بردِّ ما كان يفعله الجاهلية من عدم القَودَ فيها\n ثم قال الحقّ جلّ جلاله: { فمن عُفي له من } دم أخيه { شيء } ولو قَلَّ\n فقد سقط القتل\n فالواجب اتباعٌ للقاتل بالدية { بالمعروف } من غير تعنيف ولا تعنيت\n و { أداء } من القاتل { بإحسان } من غير مطل ولا بَخس\n { ذلك } - الذي شرعْتُ لكم من أمر العفو والديّة - { تخفيف من ربكم ورحمة } بكم\n وقد كُتب على اليهود القصاص وحده\n وعلى النصارى مطلقاً\n وخيَّركم أيها الأمة المحمدية بين أخذ الديّة والقصاص\n { فمن اعتدى } بعد أخذ الديّة وقَتَل { فله عذاب أليم } في الدنيا والآخرة\n في الدنيا: بأن يُقتل لا محالة لقوله - عليه الصلاة والسلام -:\n \" لا أُعَافِي أحَداً قَتَلَ بَعْدَ أَخْذِ الدِّيَة \"\n \n{ ولكم } يا معشر المسلمين { في } تشريع { القصاص حياة } عظيمة في الدنيا\n لانزجار القاتل إذا علَم أنه يُقتص منه\n وقد كانوا يَقتُلون الجماعةَ في الواحد\n فسلِموا من القتل بشروع القصاص\n أو في الآخرة\n فإن القاتل إذا اقتُصَّ منه في الدنيا لم يؤخذْ به في الآخرة\n فاعتُبِروا { يا أولي الألباب } أي: العقول الكاملة\n ما في حكمة القصاص من استبقاء الأرواح وحفظ النفوس\n { لعلكم تتقون } الله في المحافظة على القصاص\n والحكم به والإذعان له\n أو تَكُفُّون عن القتل خوفاً من الله\n\nالإشارة: كما جعل الله القصاص في الجناية الحسيّة\n جعل القصاصَ في الجناية المعنوية\n وهي الجنايةُ على النفس بسوء الأدب مع الله\n فكل من صدر منه هفوةٌ أو زَلَّة\n اقْتصَ الحقّ تعالى منه في دار الدنيا\n إن كانت له من الله عناية\n الكبيرة بالكبيرة والصغيرة بالصغيرة: وتأمَّلْ قضية الرجل الذي كان يطوف بالكعبة\n فنظر إلى امرأة\n فلطَمْته كَفٍّ من الهوى\n وذهبت عينه\n فقال: آه\n فقيل له: لطمة بنظرة\n وإن زدت زدنا\n هـ\n وقضية أبي تراب النخشبي: قال رضي الله عنه: ما تمنت نفسي شهوةً من الشهوات إلا مرة واحدة\n تمنيت خبزاً وبيضاً وأنا في سفر\n فعدلت إلى قرية\n فقام واحد\n وتعلّق بي\n وقال: هذا رأيته مع اللصوص\n فضربوني سبعين درة\n ثم عرفني رجلٌ منهم\n وحملني إلى منزله\n وقدَّم لي خبزاً وبيضاً\n فقلت في نفسي: كُلْ بعد سبعين درة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.6695277789918873
    },
    {
      "verse": "39:18",
      "similarity": 0.6146893420294178
    },
    {
      "verse": "2:269",
      "similarity": 0.6004384764202706
    },
    {
      "verse": "65:10",
      "similarity": 0.5990473849076384
    },
    {
      "verse": "3:190",
      "similarity": 0.5773579813129006
    }
  ]
}