{
  "chapter": "البقرة",
  "text": "شهر رمضان الذى انزل فيه القرءان هدى للناس وبينت من الهدى والفرقان فمن شهد منكم الشهر فليصمه ومن كان مريضا او على سفر فعدة من ايام اخر يريد الله بكم اليسر ولا يريد بكم العسر ولتكملوا۟ العدة ولتكبروا۟ الله على ما هدىكم ولعلكم تشكرون",
  "translations": [
    {
      "translation": "The month of Ramadan is the one in which the Qur'an was sent down as guidance for mankind, with Clear Signs containing guidance and discrimination. Any of you who are resident for the month should fast it. But any of you who are ill or on a journey should fast a number of other days. Allah desires ease for you; He does not desire difficulty for you. You should complete the number of days and proclaim Allah's greatness for the guidance He has given you so that hopefully you will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadan is the month in which the Qur'an was revealed as guidance to man and clear proof of the guidance, and criterion (of falsehood and truth). So when you see the new moon you should fast the whole month; but a person who is ill or travelling (and fails to do so) should fast on other days, as God wishes ease and not hardship for you, so that you complete the (fixed) number (of fasts), and give glory to God for the guidance, and be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadan is the month in which the Qur'an was sent down: this Book is a perfect guidance for mankind and consists of clear teachings which show the right way and are a criterion of Truth and falsehood. Therefore from now on whoever witnesses it, it is obligatory on hire to fast the whole month, but if one be ill or on a journey, he should make up for the same number by fasting on other days. Allah desires to show leniency to you and does not desire to show any hardship. \"therefore this method is being shown to you so that you may complete the number of Fast days and glorify Allah for the Guidance He has shown to you and be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan is the month in which the Quran was revealed; a guide for the people, the most authoritative of all guidance and a criteria to discern right from wrong. Anyone of you who knows that the month of Ramadan has begun, he must start to fast. Those who are sick or on a journey have to fast the same number of days at another time. God does not impose any hardship upon you. He wants you to have comfort so that you may complete the fast, glorify God for His having given you guidance, and that, perhaps, you would give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was sent down the Qur’an – the guidance for mankind, the direction and the clear criteria (to judge between right and wrong); so whoever among you witnesses this month, must fast for the (whole) month; and whoever is sick or on a journey, may fast the same number in other days; Allah desires ease for you and does not desire hardship for you – so that you complete the count (of fasts), and glorify Allah’s greatness for having guided you, and so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was revealed the Qur'an, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong). So whoever of you sights (the crescent on the first night of) the month (of Ramadan, i.e., is present at his home), he must observe Sawm (fasting) that month, and whoever is ill or on a journey, the same number [of days which one did not observe Sawm (fasting) must be made up] from other days. Allah intends for you ease, and He does not want to make things difficult for you. (He wants that you) must complete the same number (of days), and that you must magnify Allah [i.e., to say Takbir (Allahu Akbar: Allah is the Most Great)] for having guided you so that you may be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramazan is that in which the Quran was revealed, a guidance to men and clear proofs of the guidance and the distinction; therefore whoever of you is present in the month, he shall fast therein, and whoever is sick or upon a journey, then (he shall fast) a (like) number of other days; Allah desires ease for you, and He does not desire for you difficulty, and (He desires) that you should complete the number and that you should exalt the greatness of Allah for His having guided you and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the month of Ramadan, wherein the Koran was sent down to be a guidance to the people, and as clear signs of the Guidance and the Salvation. So let those of you, who are present at the month, fast it; and if any of you be sick, or if he be on a journey, then a number of other days; God desires ease for you, and desires not hardship for you; and that you fulfil the number, and magnify God that He has guided you, and haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was revealed the Qur'an, a guidance for mankind, and clear proofs of the guidance, and the Criterion (of right and wrong). And whosoever of you is present, let him fast the month, and whosoever of you is sick or on a journey, (let him fast the same) number of other days. Allah desireth for you ease; He desireth not hardship for you; and (He desireth) that ye should complete the period, and that ye should magnify Allah for having guided you, and that peradventure ye may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan is the month when the Quran was sent down as guidance for mankind with clear proofs of guidance and the criterion by which to distinguish right from wrong. Therefore, whoever of you is present in that month, let him fast; but he who is ill or on a journey shall fast a similar number of days later on. God desires ease for you, not hardship. He desires you to fast the whole month, so that you may glorify Him for His having guided you and so that you may be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadhan: therein was sent down the Qur'an: is a guidance unto mankind, and with evidences: one of the Books of guidance and the distinction. So whosoever of you witnesseth the month, he shall fast it, and whosoever sick or journeying, for him the like number of other days. Allah intendeth for you ease, and intendeth not for you hardship; so ye shall fulfil the number and shall magnify Allah for His having guided you, and haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Rama¤¡n is one in which the Quran was sent down as guidance to mankind, with manifest proofs of guidance and the Criterion. So let those of you who witness it fast [in] it, and as for someone who is sick or on a journey, let it be a [similar] number of other days. Allah desires ease for you, and He does not desire hardship for you, and so that you may complete the number and magnify Allah for guiding you, and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadhan is the (month) in which was sent down the Qur'an, as a guide to mankind, also clear (Signs) for guidance and judgment (Between right and wrong). So every one of you who is present (at his home) during that month should spend it in fasting, but if any one is ill, or on a journey, the prescribed period (Should be made up) by days later. Allah intends every facility for you; He does not want to put to difficulties. (He wants you) to complete the prescribed period, and to glorify Him in that He has guided you; and perchance ye shall be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was revealed the Quran, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong). So whoever of you sights (the crescent on the first night of) the month (of Ramadan i.e. is present at his home), he must observe Saum (fasts) that month, and whoever is ill or on a journey, the same number [of days which one did not observe Saum (fasts) must be made up] from other days. Allah intends for you ease, and He does not want to make things difficult for you. (He wants that you) must complete the same number (of days), and that you must magnify Allah [i.e. to say Takbir (Allahu-Akbar; Allah is the Most Great) on seeing the crescent of the months of Ramadan and Shawwal] for having guided you so that you may be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan is the month in which the Koran was sent down, a guidance for people, and clear verses of guidance and the criterion. Therefore, whoever of you witnesses the month, let him fast. But he who is ill, or on a journey shall (fast) a similar number (of days) later on. Allah wants ease for you and does not want hardship for you. And that you fulfill the number of days and exalt Allah who has guided you in order that you be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadan is the month in which the Quran was revealed. Guidance for humanity, and clear portents of guidance, and the Criterion. Whoever of you witnesses the month, shall fast it. But whoever is sick, or on a journey, then a number of other days. God desires ease for you, and does not desire hardship for you, that you may complete the number, and celebrate God for having guided you, so that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadhan [is that] in which was revealed the Qur'an, a guidance for the people and clear proofs of guidance and criterion. So whoever sights [the new moon of] the month, let him fast it; and whoever is ill or on a journey - then an equal number of other days. Allah intends for you ease and does not intend for you hardship and [wants] for you to complete the period and to glorify Allah for that [to] which He has guided you; and perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:185] These days of, the month of Ramadān, wherein the Qur’ān was revealed, from the Preserved Tablet to the earthly heaven on the Night of Ordainment [laylat al-qadr] from Him, a guidance (hudan, ‘a guidance’, is a circumstantial qualifier), guiding away from error, for the people, and as clear proofs, lucid verses, of the Guidance, the rulings that guide to truth, and, of, the Criterion, that discriminates between truth and falsehood; So let those of you, who are present at the month, fast it and if any of you be sick, or if he be on a journey, then a number of other days (this [concession] has already been mentioned, but it is repeated here to avoid the mistaken impression that it has been abrogated by the comprehensive implication of man shahida, ‘who are present’). God desires ease for you, and desires not hardship for you, and for this reason He has permitted you the breaking of the fast during illness or travel, [this ease being] the very reason He has commanded you to fast; He supplements [the previous statement with]: and that you fulfil (read tukmilū or tukammilū) the number, of the fasting days of Ramadān, and magnify God, when you have completed them, for having guided you, for having directed you to the principal rites of His religion, and that you might be thankful, to God for this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقد علمت أن هذه الآيات تكملة للآيات السابقة وأن لا نسخ في خلال هاته الآيات ، فقوله : شهر رمضان شَهْرُ رَمَضَانَ الذى أُنزِلَ فِيهِ القرآن هُدًى لِّلنَّاسِ وبينات مِّنَ الهدى والفرقان } خبر مبتدأ محذوف تقديره هي أي الأيام المعدودات شهر رمضان ، والجملة مستأنفة بيانياً ، لأن قوله : { أياماً معدودات } \\[ البقرة : 184 \\] يثير سؤال السامع عن تعيين هذه الأيام ، ويؤيد ذلك قراءة مجاهد { شهراً } بالنصب على البدلية من { أياماً } : بدل تفصيل .وحذف المسند إليه جار على طريقة الاستعمال في المسند إليه إذا تقدم من الكلام ما فيه تفصيل وتبيين لأحوال المسند إليه فهم يحذفون ضميره ، وإذا جَوَّزتَ أن يكون هذا الكلام نسخاً لصدر الآية لم يصح أن يكون التقدير هي شهر رمضان فيتعين أن يكون شهر رمضان مبتدأ خبرهم قوله : { فمن شهد منكم الشهر فليصمه } ، واقتران الخبر بالفاء حينئذٍ مراعاة لوصف المبتدأ بالموصول الذي هو شبيه بالشرط ومثله كثير في القرآن وفي كلام العرب ، أو على زيادة الفاء في الخبر كقوله :وقائلةٍ خَوْلاَنُ فانكِحْ فَتاتهم ( ) ... أنشده سيبويه ، وكلا هذين الوجهين ضعيف .والشهر جزء من اثني عشر جزءاً من تقسيم السنة قال تعالى : { إن عدة الشهور عند الله اثنا عشر شهراً في كتاب الله يوم خلق السموات والأرض } \\[ التوبة : 36 \\] والشهر يبتدىء من ظهور الهلال إلى المحاق ثم ظهور الهلال مرة أخرى ، وهو مشتق من الشهرة لأن الهلال يظهر لهم فيشهرونه ليراه الناس فيثبت الشهر عندهم .ورمضان علم وليس منقولاً؛ إذ لم يسمع مصدر على وزن الفَعلان من رمِض بكسر الميم إذا احترق؛ لأن الفَعَلان ، يدل على الاضطراب ولا معنى له هنا ، وقيل هو منقول عن المصدر . ورمضان علَم على الشهر التاسع من أشهر السنة العربية القمرية المفتتحة بالمحرم؛ فقد كان العرب يفتتحون أشهر العام بالمحرم؛ لأن نهاية العام عندهم هي انقضاء الحج ومدة الرجوع إلى آفاقهم ، ألا ترى أن لَبيداً جعل جمادى الثانية وهو نهاية فصل الشتاء شهراً سادساً إذ قال :حَتَّى إذا سَلخا جُمادى سِتَّةً ... جَزْءاً فطال صيامُه وصيامهاورمضان ممنوع من الصرف للعلمية وزيادة الألف والنون؛ لأنه مشتق من الرمضاء وهي الحرارة لأن رمضان أول أشهر الحرارة بناء على ما كان من النسيء في السنة عند العرب إذ كانت السنة تنقسم إلى ستة فصول كل فصل منها شهران : الفصل الأول الخريف وشهراه محرم وصفر ، الثاني ربيع الأول وهو وقت نضج الثمار وظهور الرُّطَب والتمر وشهراه شهرُ ربيع الأولُ وشهرُ ربيع الثاني على أن الأول والثاني وصف لشهر ، ألا ترى أن العرب يقولون «الرطب شهري ربيع» ، الثالث الشتاء وشهراه جمادى الأولى وجمادى الثانية قال حاتم :في ليلةٍ من جمادَى ذاتتِ أَنْدَيةٍ ... لاَ يُبصِرُ الكَلْبُ مِن ظَلْمَائِها الظُّنُبَالاَ يَنَبحُ الكلبُ فيها غيرَ واحِدَةٍ ... حتَّى يَلُفَّ علَى خَيشُومِهِ الذَّنبَاالرابع الربيع الثاني والثاني وصف للربيع وهذا هو وقت ظهور النَّور والكَمْأَةِ وشهراه رجبٌ وشعبان ، وهو فصل الدَّر والمطَر قال النابغة يذكر غَزَوات النعمان ابن الحارث :وكانَتْ لَهْم رَبْعِيَّةٌ يَحْذَرُونَها ... إذا خَضْخَضَتْ ماءَ السماء القبائِلُوسَمَّوه الثاني لأنه يجيءُ بعد الربيععِ الأول في حساب السنة ، قال النابغة :فإن يَهلك أبو قابُوسَ يَهلكْ ... رَبِيعُ الثَّاننِ والبَلَدُ الحَرامُفي رواية وراوي «ربيعُ الناس» ، وسموا كلا منهما ربيعاً لأنه وقت خصب ، الفصل الخامس ، الصيف وهو مبدأ الحر وشهراه رمضان وشوال ، لأن النوق تشول أذنابها فيه تطرد الذباب . السادس القيظ وشهراه ذو القعدة وذو الحجة .وبعض القبائل تقسم السنة إِلى أربعة ، كل فصل له ثلاثة أشهر؛ وهي الربيع وشهوره رجب وشعبان ورمضان ، والصيف وشهوره شوال وذو القعدة وذو الحجة ، والخريف وشهوره محرم وصفر والربيع الأول ، والشتاء وشهوره شهر ربيع الثاني على أن الأول والثاني وصفان لشهر لا لربيع وجمادى الأولى وجمادى الثانية .ولما كانت أشهر العرب قمرية وكانت السنة القمرية أقل من أيام السنة الشمسية التي تجيء بها الفصول تنقص أحد عشر يوماً وكسراً ، وراموا أن يكون الحج في وقت الفراغ من الزروع والثمار ووقت السلامة من البرد وشدة الحر جعلوا للأشهر كبساً بزيادة شهر في السنة بعد ثلاث سنين وهو المعبر عنه بالنسيء .وأسماء الشهور كلِّها أعلام لها عدا شهر ربيع الأول وشهر ربيع الثاني فلذلك وجب ذكر لفظ الشهر معهما ثم وصفه بالأول والثاني؛ لأن معناه الشهر الأول من فصل الربيع أعني الأول ، فالأول والثاني صفتان لشهر ، أما الأشهر الأخرى فيجوز فيها ذكر لفظ الشهر بالإضافة من إضافة اسم النوع إلى واحده مثل شجر الأراك ومدينة بغداد ، وبهذا يشعر كلام سيبويه والمحققين فمن قال : إنه لا يقال رمضان إلاّ بإضافة شهر إليه بناء على أن رمضان مصدر ، حتى تكلف لمنعه من الصرف بأنه صار بإضافة شهر إليه علماً فمنع جزء العلم من الصرف كما منع هريرة في أبي هريرة فقد تكلف شططاً وخالف ما روي من قول النبي صلى الله عليه وسلم \" من صام ر مضان إيماناً واحتساباً \" بنصب رمضان وإنما انجر إليهم هذا الوهم من اصطلاح كتاب الديوان كما في «أدب الكاتب» .وإنما أضيف لفظ الشهر إلى رمضان في هذه الآية مع أن الإيجاز المطلوب لهم يتقضي عدم ذكره إما لأنه الأشهر في فصيح كلامهم وإما للدلالة على استيعاب جميع أيامه بالصوم؛ لأنه لو قال رمضان لكان ظاهراً لا نصاً ، لا سيما مع تقدم قوله { أياماً } \\[ البقرة : 184 \\] فيتوهم السامعون أنها أيام من رمضان .فالمعنى أن الجزء المعروف بشهر رمضان من السنة العربية القمرية هو الذي جعل ظرفاً لأداء فريضة الصيام المكتوبة في الدين فكلما حل الوقت المعين من السنة المسمى بشهر رمضان فقد وجب على المسلمين أداء فريضة الصوم فيه ، ولما كانم ذلك حلوله مكرراً في كل عام كان وجوب الصوم مكرراً في كل سنة إذ لم ينط الصيام بشهر واحد مخصوص ولأن ما أجري على الشهر من الصفات يحقق أن المراد منه جميعُ الأزمنة المسماةُ به طول الدهر .وظاهر قوله : { الذي أنزل فيه القرآن } أن المخاطبين يعلمون أن نزول القرآن وقع في شهر رمضان ، لأن الغالب في صلة الموصول أن يكون السامع عالماً باختصاصها بمن أجرى عليه الموصول ، ولأن مثل هذا الحدَث الديني من شأنه ألا يخفى عليهم ، فيكون الكلام تذكيراً بهذا الفضل العظيم ، ويجوز أيضاً أن يكون إعلاماً بهذا الفضل وأجري الكلام على طريقة الوصف بالموصول للتنبيه على أن الموصوف مختص بمضمون هذه الصلة بحيث تجعل طريقاً لمعرفته ، ولا نسلم لزوم علم المخاطب باتصاف ذي الصلة بمضمونها في التعريف بالموصولية بل ذلك غَرض أغلبي كما يشهد به تتبع كلامهم ، وليس المقصود الإخبارَ عن شهر رمضان بأنه أنزل فيه القرآن ، لأن تركيب الكلام لا يسمح باعتباره خبراً لأن لفظ { شهر رمضان } خبر وليس هو مبتدأ ، والمراد بإنزال القرآن ابتداءُ إنزاله على النبي صلى الله عليه وسلم فإن فيه ابتداء النزول من عام واحد وأربعين من الفيل فعبر عن إنزال أوله باسم جميعه؛ لأن ذلك القدْر المنزل مقَدَّرٌ إلحاق تكملته به كما جاء في كثير من الآيات مثل قوله : { وهذا كتاب أنزلناه مبارك } \\[ الأنعام : 92 \\] وذلك قبل إكمال نزوله فيشمل كل ما يلحق به من بعد ، وقد تقدم عند قوله : { والذين يؤمنون بما أنزل إليك } ومعنى { الذي أنزل فيه } أنزل في مثله؛ لأن الشهر الذي أنزل فيه القرآن قد انقضى قبل نزول آية الصوم بعدة سنين ، فإن صيام رمضان فرض من السنة الثانية للهجرة فَبَيْن فرض الصيام والشهرِ الذي أنزل فيه القرآن حقيقةً عدةُ سنين فيتعين بالقرينة أن المراد أنزل في مثله أي في نظيره من عام آخر .فقد جعل الله للمواقيت المحدودة اعتباراً يشبه اعتبار الشيء الواحد المتجدد ، وإنما هذا اعتبار للتذكير بالأيام العظيمة المقدَار كما قال تعالى : { وذكرهم بأيام الله } \\[ إبراهيم : 5 \\] ، فخلع الله على المواقيت التي قارنها شيء عظيم في الفضل أن جعل لتلك المواقيت فضلاً مستمراً تنويهاً بكونها تذكرة لأمر عظيم ، ولعل هذا هو الذي جعَل الله لأجله سنة الهدي في الحج ، لأن في مثل ذلك الوقت ابتلَى الله إبراهيم بذبح ولده إسماعيل وأظهر عَزْم إبراهيم وطاعته ربه ومنه أخذ العلماء تعظيم اليوم الموافق ليوم ولادة النبي صلى الله عليه وسلم ويجيء من هذا إكرام ذرية رسول الله وأبناء الصالحين وتعظيم ولاة الأمور الشرعية القائمين مقام النبي صلى الله عليه وسلم في أعمالهم من الأمراء والقضاة والأئمّة .وهذا يدل على أن مراد الله تعالى من الأمة صوم ثلاثين يوماً متتابعة مضبوطة المبدأ والنهاية متحدة لجميع المسلمين . ولما كان ذلك هو المراد وُقِّتَ بشهر معيَّن وجعل قمرياً لسهولة ضبط بدئه ونهايته برؤية الهلال والتقدير ، واختير شهر رمضان من بين الأشهر لأنه قد شُرف بنزول القرآن فيه ، فإن نزول القرآن لما كان لقصد تنزيه الأمة وهداها ناسب أن يكون ما به تطهير النفوس والتقرب من الحالة المَلَكية واقعاً فيه ، والأغلب على ظني أن النبي صلى الله عليه وسلم كان يصوم أيام تحنثه في غار حراء قبل أن يُنزل عليه الوحي إلهاماً من الله تعالى وتلقيناً لبقية من الملة الحنيفية فلما أنزل عليه الوحي في شهر رمضان أمر الله الأمة الإسلامية بالصوم في ذلك الشهر ، روَى ابن إسحاق أن رسول الله صلى الله عليه وسلم قال : « جاورت بحِراء شهرَ رمضان » وقال ابن سعد : جاءه الوحي وهو في غار حراء يوم الاثنين لسبع عشرة حلت من رمضان .وقوله : { هدى للناس وبينات من الهدى والفرقان } حالان من ( القرآن ) إشارة بهما إلى وجه تفضيل الشهر بسبب ما نزل فيه من الهدى والفرقان .والمراد بالهدى الأول : ما في القرآن من الإرشاد إلى المصالح العامة والخاصة التي لا تنافي العامة ، وبالبينات من الهدى : ما في القرآن من الاستدلال على الهدى الخفي الذي ينكره كثير مِن الناس مثل أدلة التوحيد وصدق الرسول وغير ذلك من الحجج القرآنية . والفرقان مصدر فرق وقد شاع في الفَرق بين الحق والباطل أي إعلان التفرقة بين الحق الذي جاءهم من الله وبين الباطل الذي كانوا عليه قبل الإسلام ، فالمراد بالهدى الأول : ضرب من الهدى غير المراد من الهدى الثاني ، فلا تكرار .تفريع على قوله : { شهر رمضان الذي أنزل فيه القرآن } الذي هو بيان لقوله { كتب عليكم الصيام } \\[ البقرة : 183 \\] كما تقدم فهو رجوع إلى التبيين بعد الفصل بما عقب به قوله : { كتب عليكم الصيام } من استيناسسٍ وتنويهٍ بفضل الصيام وما يرجى من عوده على نفوس الصائمين بالتقوى وما حف الله به فرضه على الأمة من تيسير عند حصول مشقة من الصيام .وضمير { منكم } عائد إلى { الذين أمنوا } \\[ البقرة : 183 \\] مثل الضمائر التي قبله ، أي كل من حضر الشهر فليصمه ، و { شهد } يجوز أن يكون بمعنى حضر كما يقال : إن فلاناً شهد بَدراً وشهد أُحُداً وشهد العقبة أو شهد المشاهد كلها مع رسول الله صلى الله عليه وسلم أي حضرها فنصب الشهر على أنه مفعول فيه لفعل { شَهِد } أي حضر في الشهر أي لم يكن مسافراً ، وهو المناسب لقوله بعده : { ومن كان مريضاً أو على سفر } . الخ . أي فمن حضر في الشهر فليصمه كله ويُفهم أن مَن حضر بعضه يصوم أيام حضوره .ويجوز أن يكون { شهد } بمعنى عَلِم كقوله تعالى : { شهد الله أنه لا إله إلا هو } \\[ آل عمران : 18 \\] فيكون انتصاب الشهر على المفعول به بتقدير مضاف أي علم بحلول الشهر ، وليس شهد بمعنى رأى؛ لأنه لا يقال : شهد بمعنى رأى ، وإنما يقال شَاهد ، ولا الشهر هنا بمعنى هلاله بناء على أن الشهر يطلق على الهلال كما حكوه عن الزجاج وأنشد في «الأساس» قول ذي الرمة :فأصبح أَجلَى الطَّرْففِ ما يستزيده ... يَرى الشهرَ قبل الناس وهو نَحيلأي يرى هلال الشهر؛ لأن الهلال لا يصح أن يتعدى إليه فعل { شهد } بمعنى حضر ومَن يفهم الآية على ذلك فقد أخطأ خطأ بيناً وهو يفضي إلى أن كل فرد من الأمة معلق وجوب صومه على مشاهدته هلال رمضان فمن لم ير الهلال لا يجب عليه الصوم وهذا باطل ، ولهذا فليس في الآية تصريح على طريق ثبوت الشهر وإنما بينته السنة بحديث \" لا تصوموا حتى تروا الهلال ولا تُفطروا حتى تروه فإنْ غُمَّ عليكم فاقدروا له \" وفي معنى الإقدار له محامل ليست من تفسير الآية .وقرأ الجمهور : ( القُرْءَان ) بهمزة مفتوحة بعد الراء الساكنة وبعد الهمزة ألف ، وقرأهُ ابن كثير براء مفتوحة بعدها ألف على نقل حركة الهمزة إلى الراء الساكنة لقصد التخفيف .وقوله : { ومن كان مريضاً أو على سفر فعدة } قالوا في وجه إعادته مع تقدم نظيره في قوله : { فمن كان منكم مريضاً } \\[ البقرة : 184 \\] أنه لما كان صوم رمضان واجباً على التخيير بينه وبين الفدية بالإطعام بالآية الأولى وهي { كتب عليكم الصيام } \\[ البقرة : 183 \\] الخ وقد سقط الوجوب عن المريض والمسافر بنصها فلما نسخ حكم تلك الآية بقوله { شهر رمضان } الآية وصار الصوم واجباً على التعيين خيف أن يظُنّ الناس أن جميع ما كان في الآية الأولى من الرخصة قد نسخ فوجب الصوم أيضاً حتى على المريض والمسافر فأعيد ذلك في هذه الآية الناسخة تصريحاً ببقاء تلك الرخصة ، ونُسخت رخصة الإطعام مع القدرة والحضر والصحة لا غير ، وهو بناء على كون هاته الآية ناسخة للتي قبلها ، فإن درجنا على أنهما نزلتا في وقت واحد كان الوجه في إعادة هذا الحكم هو هذا الموضع الجدير بقوله : { ومن كان مريضاً } لأنه جاء بعد تعيين أيام الصوم ، وأما ما تقدم في الآية الأولى فهو تعجيل بالإعلام بالرخصة رفقاً بالسامعين ، أو أن إعادته لدفع توهم أن الأول منسوخ بقوله : { فمن شهد منكم الشهر فليصمه } إذا كان شهد بمعنى تحقق وعَلِم ، مع زيادة في تأكيد حكم الرخصة ولزيادة بيان معنى قوله : { فمن شهد منكم الشهر فليصمه } .{ يُرِيدُ الله بِكُمُ اليسر وَلاَ يُرِيدُ بِكُمُ العسر } .استئناف بياني كالعلة لقوله : { ومن كان مريضاً } الخ بيَّن به حكمة الرخصة أي شرع لكم القضاءَ لأنه يريد بكم اليسر عند المشقة .وقوله : { ولا يريد بكم العسر } نفي لضد اليسر ، وقد كان يقوم مقام هاتين الجملتين جملةُ قصر نحو أن يقول : ما يريد بكم إلاّ اليسر ، لكنه عُدل عن جملة القصر إلى جملتي إثبات ونفي لأن المقصود ابتداءً هو جملة الإثبات لتكون تعليلاً للرخصة ، وجاءت بعدها جملة النفي تأكيداً لها ، ويجوز أن يكون قوله : { يريد الله بكم اليسر ولا يريد بكم العسر } تعليلاً لجميع ما تقدم من قوله : { كتب عليكم الصيام } \\[ البقرة : 183 \\] إلى هنا فيكون إيماء إلى أن مشروعية الصيام وإن كانت تلوح في صورة المشقة والعسر فإن في طيها من المصالح ما يدل على أن الله أراد بها اليسر أي تيسير تحصيل رياضة النفس بطريقة سليمة من إرهاق أصحاب بعض الأديان الأخرى أنفسهم .وقرأ الجمهور : ( اليُسْر ) و ( العُسْر ) بسكون السين فيهما ، وقرأه أبو جعفر بضم السين ضمةَ إتباع .عطف على جملةٍ : { يريد الله بكم اليسر } الخ؛ إذ هي في موقع العلة كما علمتَ؛ فإن مجموعَ هذه الجمل الأربع تعليل لما قبلها من قوله : { فمن شهد منكم الشهر } إلى قوله : { فعدة من أيام أُخر } .واللام في قوله : { ولتكبروا } تسمى شبه الزائدة وهي اللام التي يكثر وقوعها بعد فعل الإرادة وفعل الأمر أي مادة أمَرَ اللذين مفعولهما أنْ المصدرية مع فعلها ، فحق ذلك المفعول أن يتعدى إليه فعل الإرادة وفعل مادة الأمر بنفسه دون حرف الجر ولكن كثر في الكلام تعديته باللام نحو قوله تعالى : { يريدون ليطفئوا نور الله بأفواههم } \\[ الصف : 8 \\] قال في «الكشاف» : أصله يريدون أن يطفئوا ، ومنه قوله تعالى : { وأُمرت لأن أكون أول المسلمين } \\[ الزمر : 12 \\] والفعل الذي بعد اللام منصوب بأنْ ظاهرةٍ أو مقدرةٍ .والمعنى : يريد الله أن تُكملوا العدة وأن تُكبروا الله ، وإكمالُ العدة يحصل بقضاء الأيام التي أفطرها مَن وجب عليه الصوم ليأتي بعدة أيام شهر رمضان كاملة ، فإن في تلك العدة حكمة تجب المحافظة عليها ، فبالقضاء حصلت حكمة التشريع وبرخصة الإفطار لصاحب العذر حصلت رحمة التخفيف .وقرأ الجمهور : ( ولتُكْملوا ) بسكون الكاف وتخفيف الميم مضارع أكمل وقَرأه أبو بكر عن عاصم ويعقوب بفتح الكاف وتشديد الميم مضارع كَمَّل .وقوله : { ولتكبروا الله على ما هداكم } عطف على قوله : { ولتكملوا العدة } ، وهذا يتضمن تعليلاً وهو في معنى علة غيرِ متضمنةٍ لحكمة ولكنها متضمنة لمقصد إرادة الله تعالى وهو أن يكبروه .والتكبير تفعيل مراد به النسبة والتوصيف أي أن تنسبوا الله إلى الكبر والنسبة هنا نسبة بالقول اللساني ، والكِبَر هنا كبر معنوي لا جسمي فهو العظمة والجلال والتنزيه عن النقائص كلها ، أي لتصفوا الله بالعظمة ، وذلك بأن تقولوا : الله أكبر ، فالتفعيل هنا مأخوذ من فَعَّلَ المنحوتتِ من قوللٍ يقوله ، مثل قولهم : بَسْمل وحَمْدل وهَلَّل وقد تقدم عند الكلام على البسملة ، أي لتقولوا : الله أكبر ، وهي جملة تدل على أن الله أعظم من كل عظيم في الوَاقع كالحكماء والملوك والسادة والقادة ، ومن كل عظيم في الاعتقاد كالآلهة الباطلة ، وإثبات الأعظمية لله في كلمة ( الله أكبر ) كناية عن وحدانيته بالإلهية ، لأن التفضيل يستلزم نقصان من عداه والناقص غير مستحق للإلهية ، لأن حقيقتها لا تلاقي شيئاً من النقص ، ولذلك شُرع التكبير في الصلاة لإبطال السجود لغير الله ، وشُرع التكبير عند نحر البُدْن في الحج لإبطال ما كانوا يتقربون به إلى أصنامهم ، وكذلك شرع التكبير عند انتهاء الصيام بهذه الآية ، فمن أجل ذلك مضت السنة بأن يكبر المسلمون عند الخروج إلى صلاة العيد ويكبر الإمام في خطبة العيد .وفي لفظ التكبير عند انتهاء الصيام خصوصية جليلة وهي أن المشركين كانوا يتزلفون إلى آلهتهم بالأَكل والتلطيخ بالدماء ، فكان لقول المسلم : الله أكبر ، إشارة إلى أن الله يعبد بالصوم وأنه متنزه عن ضراوة الأصنام .وقوله : { ولعلكم تشكرون } تعليل آخر وهو أعم من مضمون جملة { ولتكبروا الله على ما هداكم } فإن التكبير تعظيم يتضمن شكراً والشكر أعم ، لأنه يكون بالأقوال التي فيها تعظيم لله تعالى ويكون بفعل القُرب من الصدقات في أيام الصيام وأيام الفطر ، ومن مظاهر الشكر لبس أحسن الثياب يوم الفطر .وقد دلت الآية على الأمر بالتكبير؛ إذ جعلتْه مما يريده الله ، وهو غير مفصَّل في لفظ التكبير ، ومجملٌ في وقت التكبير؛ وعدده ، وقد بينت السنة القولية والفعلية ذلك على اختلاف بين الفقهاء في الأحوال .فأما لفظ التكبير فظاهر الآية أنه كل قول فيه لفظ الله أكبر ، والمشهور في السنة أنه يكرر الله أكبر ثلاثاً ، وبهذا أخذ مالك وأبو حنيفة والشافعي ، وقال مالك والشافعي : إذا شاء المرءُ زاد على التكبير تهليلاً وتحميداً فهو حسن ولا يترك الله أكبر ، فإذا أراد الزيادة على التكبير كبر مرتين ثم قال : لا إله إلاّ الله والله أكبر ولله الحمد وهو قول ابن عمر وابن عباس ، وقال أحمد : هو واسع ، وقال أبو حنيفة : لا يجزىء غير ثلاث تكبيرات .وأما وقته : فتكبير الفطر يبتدىء من وقت خروج المصلي من بيته إلى محل الصلاة ، وكذلك الإمامُ ومَنْ خرج معه ، فإذا بلغ محل الصلاة قطع التكبير ، ويسن في أول كل ركعة من ركعتي صلاة العيد افتتاح الأولى بسبع تكبيرات والثانية بست ، هذا هو الأصح مما ثبت في الأخبار وعمل به أهل المدينة من عهد النبي عليه الصلاة والسلام فما بعده وتلقاه جمهور علماء الأمصار ، وفيه خلاف كثير لا فائدة في التطويل بذكره والأمر واسع ، ثم يكبر الإمام في خطبة صلاة العيد بعد الصلاة ويكبر معه المصلون حين تكبيره وينصتون للخطبة فيما سوى التكبير .وقال ابن عباس وسعيد بن المسيب وعُروة بن الزبير والشافعي : يكبر الناس من وقت استهلال هلال الفطر إلى انقضاء صلاة العيد ثم ينقطع التكبير ، هذا كله في الفطر فهو مورد الآية التي نحن بصدد تفسيرها .فأما في الأضحى فيزاد على ما يذكر في الفطر التكبير عقب الصلوات المفروضة من صلاة الظهر من يوم الأضحى إلى صلاة الصبح من اليوم الرابع منه ، ويأتي تفصيله في تفسير قوله تعالى : { واذكروا الله في أياممٍ معدودات } \\[ البقرة : 203 \\] .\n\n",
      "translations": [
        {
          "translation": "(The month of Ramadan is) the month in (which was revealed the Qur'an) whereupon Gabriel brought down the entire Qur'an to the first heaven, dictated it to the scribes among the angels (al-safarah) and then took it down to Muhammad (pbuh) day after day, sometimes revealing to him just one, two or three verses and sometimes an entire surah, (a guidance for mankind) the Qur'an elucidates error to people, (and clear proofs of the guidance) in the matter of Religion, (and the Criterion (of right and wrong)) the lawful and the unlawful, the legal rulings, legal punishments and the steering away from doubtful matters. (And whoever of you is present) in settled areas and not travelling, (let him fast the month. And whoever of you is sick) during the month of Ramadan (or on a journey, (let him fast the same) number of days) at another time. (Allah desireth for your ease) He desires for you the dispensation of breaking the fast while on a journey; it is also said that this means: Allah wants you to break the fast when travelling; (He desireth not hardship for you) He does not desire for you the hardship of fasting while travelling; (and (He desireth) that ye should complete the period) that you should fast when you are back in your settlement the same number of days of fast you broke during your travel, (and that ye should magnify Allah for having guided you) as He guided you to His religion and legal dispensation, (and that peradventure ye may be thankful) so that you be thankful for His giving you this dispensation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ شهر رمضان } أي: احتراق النفس بنور الحق { الذي أنزل فيه } في ذلك الوقت { القرآن } أي: العلم الجامع الإجمالي\n المسمّى بالعقل القرآنيّ الموصل إلى مقام الجمع - هداية للناس إلى الوحدة باعتبار الجمع { وبينات من الهُدى } ودلائل متصلة من الجمع والفرق\n أي: العلم التفصيلي المسمّى بالعقل الفرقاني - فمن حضر منكم في ذلك الوقت\n أي: بلغ مقام شهود الذات { فليصمه } أي: فليمسك عن قول وفعل وحركة ليس بالحق فيه { ومن كان مريضاً } أي: مبتلى بأمراض قلبه من الحجب النفسانية المانعة من ذلك الشهود { أو على سفر } أي: في سلوك بعد ولم يصل إلى الشهود الذاتيّ\n فعليه مراتب أُخر يقطعها حتى يصل إلى ذلك المقام { يريد الله بكم اليسر } بالوصول إلى مقام التوحيد والامتداد بقدرة الله { ولا يريد بكم العسر } أي: تكلف الأفعال بالنفس الضعيفة العاجزة { ولتكملوا العدّة } ولتتمموا تلك المراتب والأحوال والمقامات الموصلة\n ولتعظموا الله وتعرفوا عظمته وكبرياءه على هدايته إياكم إلى مقام الجمع { ولعلكم تشكرون } بالاستقامة أمركم بذلك\n { وإذا سألك عبادي } السالكون الطالبون المتوجهون إليّ\n عن معرفتي { فإني قريب } ظاهر { أجيب دعوة } من يدعوني بلسان الحال والاستعداد بإعطائه ما اقتضى حاله واستعداده { فليستجيبوا لي } بتصفية الاستعداد بالزهد والعبادة\n فإني أدعوهم إلى نفسي وأعلمهم كيفية السلوك إليّ\n وليشاهدوني عند التصفية\n فإني أتجلّى عليهم في مرائي قلوبهم لكي يرشدوا بالاستقامة\n أي: لكي يستقيموا ويصلحوا",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والحال أن القرآن النزل فيه { هُدًى لِّلنَّاسِ } المؤمنين بتوحيد الله المتوجهين نحو جنابه يهديهم إلى مرتبة اليقين { وَبَيِّنَاتٍ } شواهد وآيات واضحات { مِّنَ ٱلْهُدَىٰ } الموصل للمستكشفين عن سرائر التوحيد إلى مرتبة عين اليقين { وَٱلْفُرْقَانِ } الفارق لهم بين الحق الذي هو الوجود الإلهي\n والباطل الذي هو الوجودات الكونية يوصلهم إلى مرتبة حق اليقين { فَمَن شَهِدَ } أدرك { مِنكُمُ ٱلشَّهْرَ } المذكور مقيماً مطيقاً بلا عذر { فَلْيَصُمْهُ } ثلاثين يوماً حتى بلا إفطار وإفداء\n لأن هذه الآية ناسخة للآية السابقة\n\n\n{ وَمَن كَانَ مَرِيضاً } لا يطيق على صومه خوفاً من شدة مرضه { أَوْ عَلَىٰ } متن { سَفَرٍ } فأفطر دفعاً للحرج { فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ } أي: لزم عليه صيام أيام أخر قضاء لأيام الفطر إنما { يُرِيدُ ٱللَّهُ بِكُمُ } أيها المؤمنون { ٱلْيُسْرَ } لئلا يتحرجوا { وَلاَ يُرِيدُ بِكُمُ ٱلْعُسْرَ } لئلا تضطروا وتضطربوا وإنما رخص لكم الإفطار في المرض والسفر { وَ } ألزم عليكم القضاء بعد { لِتُكْمِلُواْ ٱلْعِدَّةَ } المفروضة لكم في كل سنة\n لئلا تحرموا عن منافع الصوم { وَلِتُكَبِّرُواْ ٱللَّهَ } وتعظموه { عَلَىٰ مَا هَدَاكُمْ } إلى الرخص عند الاضطرار { وَلَعَلَّكُمْ تَشْكُرُونَ } [البقرة: 185] تتنبهون بشكر نعمه الفائضة عليكم في أمثال هذه المضائق إلى ذاته\n أو يشكر نعمه تتقربون إليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { شهر رمضان } إما خبر عن مضمر\n أو مبتدأ\n والخبر: الألف واللام والوصف: و { شهر رمضان } إما خبر عن مضمر\n أو مبتدأ\n والخبر: { فمن شهد } \n أو بدل من { الصيام } \n على حذف مضاف\n أي: صيام شهر رمضان\n و { رمضان } مصدر رمَض إذا احترق\n وأضيف إليه الشهر\n وجُعل عَلَما\n ومُنع من الصرف للعلَمية والألف والنون\n وسَمَّوْه بذلك إما لارتماض القلب فيه من حرَّ الجوع والعطش\n أو لارتماض القلب فيه من حَرَّ الجوع والعطش\n أو لارتماض الذنوب فيه\n أو وافق الحرَّ حين نقلوا الشهور عن اللغة القديمة\n و { الشهر } ظرف\n لقوله: { شهد } أي: حضر\n وقوله: { ولتكلموا\n\n\n } الآية\n هذه ثلاثُ عِللَ لثلاثة أحكام على سبيل الفِّ والنَّشْرِ المعكوس\n أي: ولتكملوا العدة أمرتُكم بقضاء عدة أيام أخر\n ولتكبروا الله عند تمام الشهر أمرتُكم بصيام الشهر كله\n ولعلكم تشكرون أردتُ بكم اليسر دون العسر\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } فُرض عليكم { الصيام } كما فرض { على الذين من قبلكم } من الأنبياء وأَمَمِهم من لدن آدم\n فلكم فيهم أسوة\n فلا يشق عليكم { لعلكم تتقون } المعاصي\n فإن الصوم يكسر الشهوة\n ولذلك قال - عليه الصلاة والسلام-:\n \" مَنْ اسْتَطَاعَ منْكُمُ البَاءَةَ فَلْيَتَزَوَّجْ\n ومَنْ لَمْ يَسْتَطِعْ فَعَليْه بالصَّوْمِ\n فَإِنَّه لَهُ وِجَاء \"\n \nوذلك الصيام إنما هو في أيام قلائل { معدودات } فلا يهولكم أمره\n { فمن كان منكم مريضاً } يشق عليه الصيام\n { أو على سفر } فأفطر فعليه صيام عدة ما أفطر { من أيام أُخر } بعد تمام الشهر\n { وعلى الذين يطيقونه } بلا مشقة\n إن أرادوا أن يفطروا { فديةُ } وهي: { طعام مساكين }: مُدٍّ لكل يوم\n وفي قراءة { فديةٌ طعامُ مسكين } أي: وهي طعام مسكين لكل يوم\n وقيل: نصف صاع\n { فمن تطوع } بزيادة المُد\n أو أطعم مسكينَينْ عن يوم\n { فهو خير له } وأعظم أجراً\n { وإن تصوموا } أيها المطيقون للصيام\n { خير لكم إن كنتم تعلمون } ما في الصيام من الأسرار\n والخير المدرار\n ثم نسخ بقوله: { فمن شهد منكم الشهر فليصمه }\n وذلك الصيام الذي أُمرتم به هو { شهر رمضان } المبارك { الذي أنزل فيه القرآن } أي: ابتداء نزوله فيه\n أو إلى سماء الدنيا\n حالة كونه { هدى للناس } أي: هادياً لهم إلى طريق الوصول\n وآيات واضحات { من الهدى والفرقان } الذي يفرق بين الحق والباطل\n وإن شئتَ قلتَ: فيه هدى للناس إلى مقام الإسلام\n { وبينات } \n أي: حججاً واضحة تهدي إلى تحقق الإيمان\n وإلى تحقق الفرق بين الحق والباطل\n وهو ما سوى الله\n فيتحقق مقام الإحسان\n\n{ فمن } حضر منكم في { الشهر } ولم يكن مسافراً { فليصمه } وجوباً\n وكان في أول الإسلام على سبيل التخيير لأنه شق عليهم حيث لم يألفُوه\n فلما ألفوه واستمروا معه\n حتّمه عليهم في الحضور والصحة\n { ومَن كان مريضاً } يشق عليه الصيام\n { أو على } جَناح { سفر } بحيث شرَع فيه قبل الفجر فأفطر فيه\n فعليه { عدة من أيام أُخر }  { يريد الله بكم اليسر } والتخفيف\n حيث خفّف عنكم\n وأباح الفطر في المرض والسفر\n { ولا يريد بكم العسر } إذ لم يجعل عليكم في الدّين من حرج\n وإنما أمركم بالقضاء { لتكلموا العدّة } التي أمركم بها\n وهي تمام الشهر\n { ولتكبروا الله على ما هداكم } \n أمركم بصيامه فتكبروا عند تمامه\n ووقت التكبير عند مالك: من حين يخرج إلى المُصَلَّى\n بعد الطلوع\n إلى مجيء الإمام إلى الصلاة\n ولفظُه المختار: الله أكبر\n الله أكبر\n لا إله إلا الله\n الله أكبر ولله الحمد على ما هدانا\n اللهم اجعلنا من الشاكرين لجمعه بين التهليل والتكبير والشكر امتثالاً لقوله: { ولعلكم تشكرون } على ما أوليناكم من سابغ الإنعام\n وسهَّلنا عليكم في شأن الصيام\n الإشارة: كُتب عليكم الصيام عن الحظوظ والشهوات\n كما كتب على مَن سلك الطريق قبلكم من العارفين الثقات\n في أيام المجاهدة والرياضات\n حتى تنزلوا بساحة حضرة المشاهدات\n لعلكم تتقون شهود الكائنات\n ويكشف لكم عن أسرار الذات\n فمن كان فيما سلف من أيام عمره مريضاً بحب الهوى\n أو على سفر في طلب الدنيا\n فليبادِرْ إلى تلافِي ما ضاع في أيام أُخر\n وعلى الأقوياء الذين يُطيقون هذا الصيام\n إطعام الضعفاء من قُوت اليقين ومعرفة رب العالمين\n فمَنْ تطوع خيراً بإرشاد العباد إلى ما يُقوِّي يقينهم\n ويرفع فهو خير له\n وأَنْ تَدُوموا أيها الأقوياء على صومكم عن شهود السَّوَى\n وعن مخالطة الحس بعد التمكين\n فهو خير لكم وأسلم\n إن كنتم تعلمون ما في مخالطة الحس من تفريق القلب وتوهين الهمم\n إذ في وقت هذا الصيام يتحقق وحي الفهم والإلهام\n وتترادف الأنوار وسواطعُ العرفان\n فمن شهد هذا فَلْيَدُمْ على صيامه\n ومن لم يَقْدِر عليه فَلْيَبْكِ على نفسه في تضييع أيامه\n واعلم أن الصيام على ثلاث درجات: صوم العوام\n وصوم الخواص\n وصوم خواص الخواص\n أما صوم العوام: فهو الإمساك عن شهوتَي البطن والفَرْج\n وما يقوم مقامَهما من الفجر إلى الغروب\n مع إرسال الجوارح في الزلاَّت\n وإهمال القلب في الغفلات\n وصاحبُ هذا الصوم ليس له من صومه إلا الجوع\n لقوله صلى الله عليه وسلم:\n \" مَنْ لم يَدَعْ قولَ الزُور والعملَ به فليس لله حاجةٌ في أنْ يدع طعامَه وشرابَه \" \nوأما صوم الخواص: فهو إمساك الجوارح كلَّها عن الفَضول\n وهو كل ما يشغل العبد عن الوصول\n وحاصلُه: حفظ الجوارح الظاهرة والباطنة عن الاشتغال بما لا يَعْنِي\n وأما صوم خواص الخواص: فهو حفظ القلب عن الالتفات لغير الرب\n وحفظ السر عن الوقوف مع الغير\n وحاصله: الإمساك عن شهود السَّوى\n وعكوفُ القلب في حضرة المولَى\n وصاحب هذا صائم أبداً سرمداً\n فأهل الحضرة على الدوام صائمون\n وفي صلاتهم دائمون\n نفعنا الله بهم وحشرنا معهم\n آمين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:196",
      "similarity": 0.2215767118573639
    },
    {
      "verse": "2:184",
      "similarity": 0.2154962680180174
    },
    {
      "verse": "16:25",
      "similarity": 0.19957472893851197
    },
    {
      "verse": "2:233",
      "similarity": 0.14280526292168855
    },
    {
      "verse": "58:4",
      "similarity": 0.14180721516984005
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002185.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002185.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:185.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}