{
  "chapter": "البقرة",
  "text": "يسـلونك عن الاهلة قل هى موقيت للناس والحج وليس البر بان تاتوا۟ البيوت من ظهورها ولكن البر من اتقى واتوا۟ البيوت من ابوبها واتقوا۟ الله لعلكم تفلحون",
  "translations": [
    {
      "translation": "They will ask you about the crescent moons. Say, 'They are set times for mankind and for the hajj.' It is not devoutness for you to enter houses by the back. Rather devoutness is possessed by those who have taqwa. So come to houses by their doors and have taqwa of Allah, so that hopefully you will be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you of the new moons. Say: \"These are periods set for men (to reckon) time, and for pilgrimage.\" Piety does not lie in entering the house through the back door, for the pious man is he who follows the straight path. Enter the house through the main gate, and obey God. You may haply find success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the phases of the moon. Say, \"These are signs for the people to reckon dates and fix the periods for hajj.\" Also tell them, \"It is no virtue to enter your houses from their backs during the Hajj days); real virtue is that one should refrain from incurring the displeasure of Allah; so enter your houses by their proper doors. and fear Allah so that you may gain (true) success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), they ask you about the different phases of the moon. Tell them that they are there to indicate to people the phases of time and the pilgrimage season. It is not a righteous act to enter houses from the back. Righteousness is to be pious and enter the houses from the front door. Have fear of God so that perhaps you will have lasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, (O dear Prophet Mohammed – peace and blessings be upon him), regarding the crescents; say, “They are indicators of time for mankind and for Hajj (the pilgrimage)”; and it is not a virtue at all that you enter the houses by demolishing their back portions, but in reality virtue is piety; and enter the houses using their gates – and keep fearing Allah, hoping that you achieve success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad) about the crescents. Say: \"These are signs to mark fixed periods of time for mankind and for the pilgrimage.\" It is not Al-Birr (piety, righteousness, etc.) that you enter the houses from the back, but Al-Birr is from Taqwa. So enter houses through their proper doors, and have Taqwa of Allah that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the new moon. Say: They are times appointed for (the benefit of) men, and (for) the pilgrimage; and it is not righteousness that you should enter the houses at their backs, but righteousness is this that one should guard (against evil); and go into the houses by their doors and be careful (of your duty) to Allah, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the new moons. Say: 'They are appointed times for the people, and the Pilgrimage.' It is not piety to come to the houses from the backs of them; but piety is to be godfearing; so come to the houses by their doors, and fear God; haply so you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee, (O Muhammad), of new moons, say: They are fixed seasons for mankind and for the pilgrimage. It is not righteousness that ye go to houses by the backs thereof (as do the idolaters at certain seasons), but the righteous man is he who wardeth off (evil). So go to houses by the gates thereof, and observe your duty to Allah, that ye may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the phases of the moon. Say, \"They are a means of determining time for the regulation of people's affairs and for the pilgrimage.\" Piety does not consist in entering your houses from the rear. Indeed, one who guards himself against evil out of fear of God is the truly righteous one. Enter your houses by their doors and be mindful of God, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee of new moons. Say thou: they are time-marks to mankind and for pilgrimage. And it is not piety that ye enter your houses by the backs thereof, but Piety is of him who feareth God; so enter the houses by the doors thereof, and fear Allah that haply ye may thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you concerning the new moons. Say, ‘They are timekeeping signs for the people and [for the sake of] hajj.’ It is not piety that you enter houses from their rear; rather, piety is [personified by] one who is Godwary, and enter houses from their doors and be wary of Allah, so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning the New Moons. Say: They are but signs to mark fixed periods of time in (the affairs of) men, and for Pilgrimage. It is no virtue if ye enter your houses from the back: It is virtue if ye fear Allah. Enter houses through the proper doors: And fear Allah: That ye may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad SAW) about the new moons. Say: These are signs to mark fixed periods of time for mankind and for the pilgrimage. It is not Al-Birr (piety, righteousness, etc.) that you enter the houses from the back but Al-Birr (is the quality of the one) who fears Allah. So enter houses through their proper doors, and fear Allah that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you about the crescents. Say: 'They are times fixed for people and for the pilgrimage' Righteousness does not consist in entering dwellings from the back. But righteousness is he who wardsoff (sin). Enter dwellings by their doors and fear Allah, so that you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the crescents. Say, “They are timetables for people, and for the Hajj.” It is not virtuous that you approach homes from their backs, but virtue is to be pious. So approach homes from their doors, and observe God, that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, [O Muhammad], about the new moons. Say, \"They are measurements of time for the people and for Hajj.\" And it is not righteousness to enter houses from the back, but righteousness is [in] one who fears Allah. And enter houses from their doors. And fear Allah that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:189] They will ask you, O Muhammad (s), about the new moons (ahilla, plural of hilāl): ‘Why do they seem very thin, and then wax until they are full of light, and then wane again as at the first, and are not always the same, in the way that the sun is?’ Say, to them: ‘They are appointed times (mawāqīt is the plural of mīqāt) for the people, for them to know the times for sowing the land, for business, for their women’s waiting periods, their fast and their breaking it, and the Pilgrimage’ (wa’l-hajji and the Pilgrimage’, is a supplement to li’l-nāsi, ‘for the people’), that is to say, [appointed times] by which its season is known, for if they [the new moons] always looked the same, none of these things could be known. It is not piety to come to the houses from their backs, in [your] state of pilgrimage inviolability (ihrām), when you would bore holes in them to enter them and then exit, disregarding their doors; they used to do this and claim that it was out of piety; but piety is to fear, God by not contravening His commands; so come to the houses by their doors, when in a state of pilgrimage inviolability, and fear God, that you may prosper, [that you may] triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاعتراض بين شرائع الأحكام الراجعة إلى إصلاح النظام ، دعا إليه ما حدث من السؤال ، فقد روى الواحدي أنها نزلت بسبب أن أحد اليهود سأل أنصارياً عن الأهلة وأحوالها في الدقة إلى أن تصير بدراً ثم تتناقص حتى تختفي فسأل الأنصاري رسول الله فنزلت هذه الآية ، ويظهر أن نزولها متأخر عن نزول آيات فرض الصيام ببضع سنين؛ لأن آية : وليس البر بأن تأتوا البيوت من ظهورها يَسْھَلُونَكَ عَنِ الأهلة قُلْ هِىَ مَوَاقِيتُ لِلنَّاسِ والحج } متصلة بها . وسيأتي أن تلك الآية نزلت في عام الحديبية أو عام عمرة القضية . فمناسبة وضعها في هذا الموضع هي توقيت الصيام بحلول شهر رمضان ، فكان من المناسبة ذكر المواقيت لإقامة نظام الجامعة الإسلامية على أكمل وجه ، ومن كمال النظام ضبط الأوقات ، ويظهر أن هذه الآية أيضاً نزلت بعد أن شرع الحج أي بعد فتح مكة ، لقوله تعالى : { قل هي مواقيت للناس والحج } .وابتدئت الآية ب { يسألونك } لأن هنالك سؤالاً واقعاً عن أمر الأهلة . وجميع الآيات التي افتتحت ب { يسألونك } هي متضمنة لأحكام وقع السؤال عنها فيكون موقعها في القرآن مع آيات تناسبها نزلت في وقتها أو قرنت بها . وروي أن الذي سأله عن ذلك معاذ بن جبل وثعلبة بن غنمة الأنصاري فقالا : ما بال الهلال يبدو دقيقاً ثم يزيد حتى يمتلىء ثم لا يزال ينقص حتى يعود كما بدأ ، قال العراقي لم أقف لهذا السبب على إسناد .وجمع الضمير في قوله : { يسألونك } مع أن المروي أن الذي سأله رجلان نظراً لأن المسؤول عنه يهم جميع السامعين أثناء تشريع الأحكام؛ ولأن من تمام ضبط النظام أن يكون المسؤول عنه قد شاع بين الناس واستشرف كثير منهم لمعرفته سواء في ذلك من سأل بالقول ومن سأل في نفسه .وذكر فوائد خلق الأهلة في هذا المقام للإيماء إلى أن الله جعل للحج وقتاً من الأشهر لا يقبل التبديل وذلك تمهيداً لإبطال ما كان في الجاهلية من النسىء في أشهر الحج في بعض السنين .والسؤال : طلب أحدٍ من آخر بذلَ شيء أو إخباراً بخبر ، فإذا كان طلب بذل عُدّي فعل السؤال بنفسه وإذا كان طلب إخبار عدي الفعل بحرف «عن» أو ما ينوب منابه .وقد تكررت في هذه السورة آيات مفتتحة ب { يسألونك } وهي سبع آيات غير بعيد بعضها عن بعض ، جاء بعضها غير معطوف بحرف العطف وهي أربع وبعضها معطوفاً به وهي الثلاث الأواخر منها ، وأما غير المفتتحة بحرف العطف فلا حاجة إلى تبيين تجردها عن العاطف؛ لأنها في استئناف أحكام لا مقارنة بينها وبين مضمون الجمل التي قبلها فكانت جديرة بالفصل دون عطف ، ولا يتطلب لها سوى المناسبة لمواقعها .وأما الجمل الثلاث الأواخر المفتتحة بالعاطف فكل واحدة منها مشتملة على أحكام لها مزيد اتصال بمضمون ما قبلها فكان السؤال المحكي فيها مما شأنه أن ينشأ عن التي قبلها فكانت حقيقةً بالوصل بحرف العطف كما سيتضح في مواقعها .والسؤال عن الأهلة لا يتعلق بذواتها إذ الذوات لا يسأل إلا عن أحوالها ، فيُعلم هنا تقدير وحذف أي عن أحوال الأهلة ، فعلى تقدير كون السؤال واقعاً بها غير مفروض فهو يحتمل السؤال عن الحكمة ويحتمل السؤال عن السبب ، فإن كان عن الحكمة فالجواب بقوله : { قل هي مواقيت للناس } جار على وفق السؤال ، وإلى هذا ذهب صاحب «الكشاف» ، ولعل المقصود من السؤال حينئذٍ استثبات كون المراد الشرعي منها موافقاً لما اصطلحوا عليه؛ لأن كونها مواقيت ليس مما يخفى حتى يسأل عنه ، فإنه متعارف لهم ، فيتعين كون المراد من سؤالهم إن كان واقعاً هو تحقق الموافقة للمقصد الشرعي .وإن كان السؤال عن السبب فالجواب بقوله : { قل هي مواقيت } غير مطابق للسؤال ، فيكون إخراجاً للكلام على خلاف مقتضى الظاهر بصرف السائل إلى غير ما يتطلب ، تنبيهاً على أن ما صرف إليه هو المهم له ، لأنهم في مبدأ تشريع جديد والمسؤول هو الرسول عليه الصلاة والسلام وكان المهم لهم أن يسألوه عما ينفعهم في صلاح دنياهم وأخراهم ، وهو معرفة كون الأهلة ترتبت عليها آجال المعاملات والعبادات كالحج والصيام والعدة ، ولذلك صرفهم عن بيان مسؤولهم إلى بيان فائدة أخرى ، لا سيما والرسول لم يجيء مبيناً لعلل اختلاف أحوال الأجرام السماوية ، والسائلون ليس لهم من أصول معرفة الهيئة ما يهيئهم إلى فهم ما أرادوا علمه بمجرد البيان اللفظي بل ذلك يستدعى تعليمهم مقدمات لذلك العلم ، على أنه لو تعرض صاحب الشريعة لبيانه لبين أشياء من حقائق العلم لم تكن معروفة عندهم ولا تقبلها عقولهم يومئذٍ ، ولكان ذلك ذريعة إلى طعن المشركين والمنافقين بتكذيبه ، فإنهم قد أسرعوا إلى التكذيب فيما لم يطلعوا على ظواهره كقولهم : { هل ندلكم على رجل ينبئكم إذا مزقتم كل ممزق إنكم لفي خلق جديد أفترى على الله كذباً أم به جنة } \\[ سبأ : 7 ، 8 \\] وقولهم : { ما سمعنا بهذا في الملة الآخرة إن هذا إلاّ اختلاق } \\[ ص : 7 \\] وعليه فيكون هذا الجواب بقوله : { هي مواقيت للناس والحج } تخريجاً للكلام على خلاف مقتضى الظاهر كقول الشاعر . أنشده في «المفتاح» ولم ينسبه ولم أقف على قائله ولم أره في غيره. ... أتت تشتكي منّي مزاولة القرىوقد رأت الأضياف يَنْحَوْن منزلي ... فقلت لها لمّا سمعت كلامهاهم الضيف جِدِّي في قراهم وعجِّلي ... وإلى هذا نحا صاحب «المفتاح» وكأنه بناه على أنهم لا يظن بهم السؤال عن الحكمة في خلق الأهلة لظهورها ، وعلى أن الوارد في قصة معاذ وثعلبة يشعر بأنهما سألا عن السبب إذ قالا : ما بال الهلال يبدو دقيقاً الخ .والأهلة : جمع هلال وهو القمر في أول استقباله الشمس كل شهر قمري في الليلة الأولى والثانية ، قيل والثالثة ، ومن قال إلى سبع فإنما أراد المجاز ، لأنه يشبه الهلال ، ويطلق الهلال على القمر ليلة ست وعشرين وسبع وعشرين لأنه في قدر الهلال في أول الشهر ، وإنما سمي الهلال هلالاً لأن الناس إذا رأوه رفعوا أصواتهم بالإخبار عنه ينادي بعضهم بعْضاً لذلك ، وإن هَلَّ وأهَلَّ بمعنى رفع صوته كما تقدم في قوله تعالى : { وما أهل به لغير الله } \\[ البقرة : 173 \\] .وقوله : { مواقيت للناس } أي مواقيت لما يُوقَّت من أعمالهم فاللام للعلة أي لفائدة الناس وهو على تقدير مضاف أي لأعمال الناس ، ولم تذكر الأعمال الموقَّتة بالأهلة ليشمل الكلام كل عمل محتاج إلى التوقيت ، وعطف الحج على الناس مع اعتبار المضاف المحذوف من عطف الخاص على العام للاهتمام به واحتياج الحج للتوقيت ضروري؛ إذ لو لم يوقّت لجاء الناس للحج متخالفين فلم يحصل المقصود من اجتماعهم ولم يجدوا ما يحتاجون إليه في أسفارهم وحلولهم بمكة وأسواقها؛ بخلاف الصلاة فليست موقتة بالأهلة ، وبخلاف الصوم فإن توقيته بالهلال تكميلي له؛ لأنه عبادة مقصورة على الذات فلو جاء بها المنفرد لحصل المقصد الشرعي ولكن شُرع فيه توحيد الوقت ليكون أخف على المكلفين ، فإن الصعب يخف بالاجتماع وليكون حالهم في تلك المدة متماثلاً فلا يشق أحد على آخر في اختلاف أوقات الأكل والنوم ونحوهما .والمواقيت جمع ميقات والميقات جاء بوزن اسم الآلة من وقَّت وسمى العرب به الوقت ، وكذلك سُمي الشهر شهراً مشتقاً من الشهرة ، لأن الذي يرى هلال الشهر يشهره لدى الناس . وسمى العرب الوقت المعيَّن ميقاتاً كأنه مبالغة وإلاّ فهو الوقت عينه . وقيل : الميقات أخص من الوقت ، لأنه وقت قُدّر فيه عمل من الأعمال ، قلت : فعليه يكون صوغه بصيغة اسم الآلة اعتباراً بأن ذلك العمل المعيَّن يكون وسيلة لتحديد الوقت فكأنه آلة للضبط والاقتصار على الحج دون العمرة لأن العمرة لا وقت لها فلا تكون للأهلة فائدة في فعلها .ومجيء ذكر الحج في هاته الآية ، وهي من أول ما نزل بالمدينة ، ولم يكن المسلمون يستطيعون الحج حينئذٍ لأن المشركين يمنعونهم إشارة إلى أن وجوب الحج ثابت ولكن المشركين حالوا دون المسلمين ودونه ( ) . وسيأتي عند قوله تعالى : { ولله على الناس حج البيت } في \\[ سورة آل عمران : 97 \\] وعند قوله : { الحج أشهر معلومات } \\[ البقرة : 197 \\] في هذه السورة .معطوفة على { يسألونك } وليست معطوفة على جملة { هي مواقيت } لأنّه لم يكن مما سألوا عنه حتى يكون مقولاً للمجيب . ومناسبة هذه الجملة للتي قبلها أن سبب نزولها كان موالياً أو مقارناً لسبب نزول الآية التي قبلها وأن مضمون كلتا الجملتين كان مثار تردد وإشكال عليهم من شأنه أن يسأل عنه ، فكانوا إذا أحرموا بالحج أو العمرة من بلادهم جعلوا من أحكام الإحرام ألا يدخل المحرم بيته من بابه أو لا يدخل تحت سقف يحول بينه وبين السماء ، وكان المحرمون إذا أرادوا أخذ شيء من بيوتهم تسنَّموا على ظهور البيوت أو اتخذوا نقباً في ظهور البيوت إن كانوا من أهل المدر ، وإن كانوا من أهل الخيام دخلوا من خلف الخيمة ، وكان الأنصار يدينون بذلك ، وأما الحُمس فلم يكونوا يفعلون هذا ، والحمس جمع أحمس والأحمس المتشدد بأمر الدين لا يخالفه ، وهم قريش وكنانة وخزاعة وثقيف وجُشم وبنو نصر ابن معاوية ومدلج وعَدوان وعَضْل وبنو الحارث بن عبد مناة ، وبنو عامر بن صعصعة وكلهم من سكان مكة وحرمها ما عدا بني عامر بن صعصعة فإنهم تحمسوا لأن أمهم قرشية .ومعنى نفي البر عن هذا نفي أن يكون مشروعاً أو من الحنيفية ، وإنما لم يكن مشروعاً لأنه غلو في أفعال الحج ، فإن الحج وإن اشتمل على أفعال راجعة إلى ترك الترفه عن البدن كترك المخيط وترك تغطية الرأس إلاّ أنه لم يكن المقصد من تشريعه إعنات الناس بل إظهار التجرد وترك الترفه ، ولهذا لم يكن الحمس يفعلون ، ذلك لأنهم أقرب إلى دين إبراهيم ، فالنفي في قوله : { وليس البر } نفي جنس البر عن هذا الفعل بخلاف قوله المتقدم { ليس البر أن تولوا وجوهكم } \\[ البقرة : 177 \\] والقرينة هنا هي قوله : { وأتوا البيوت من أبوابها } ولم يقل هنالك : واستقبلوا أية جهة شئتم ، والمقصود من الآيتين إظهار البر العظيم وهو ما ذكر بعد حرف الاستدراك في الآيتين بقطع النظر عما نفي عنه البر ، وهذا هو مناط الشبه والافتراق بين الآيتين .روى الواحدي في «أسباب النزول» أن النبي صلى الله عليه وسلم أهلَّ عام الحديبية من المدينة وأنه دخل بيتاً وأن أحداً من الأنصار ، قيل : اسمه قطبة بن عامر وقيل : رفاعة بن تابوت . كان دخل ذلك البيت من بابه اقتداء برسول الله فقاله له النبي صلى الله عليه وسلم لم دخلت وأنْتَ قد أحرمت؟ فقال له الأنصاري : دخلت أنت فدخلت بدخولك فقال له النبي صلى الله عليه وسلم إني أحمس فقال له الأنصاري : وأنا ديني دينك رضيت بهديك فنزلت الآية ، فظاهر هذه الروايات أن الرسول نهى غير الحُمس عن ترك ما كانوا يفعلونه حتى نزلت الآية في إبطاله ، وفي «تفسير ابن جرير وابن عطية» عن السدي ما يخالف ذلك وهو أن النبي صلى الله عليه وسلم دخل باباً وهو محرم وكان معه رجل من أهل الحجاز فوقف الرجل وقال : إني أحمس فقال له الرسول عليه الصلاة والسلام : وأنا أحمس فنزلت الآية ، فهذه الرواية تقتضي أن النبي أعلن إبطال دخول البيوت من ظهورها .وأن الحمس هم الذين كانوا يدخلون البيوت من ظهورها ، وأقول : الصحيح من ذلك ما رواه البخاري ومسلم عن البراء بن عازب قال : كانت الأنصار إذا حجوا فجاءوا لا يدخلون من أبواب بيوتهم ولكن من ظهورها فجاء رجل فدخل من بابه فكأنَّه عبّر بذلك هذه الآية ، ورواية السدي وهَم ، وليس في الصحيح ما يقتضي أن رسول الله أمر بذلك ولا يظن أن يكون ذلك منه ، وسياق الآية ينافيه .وقوله : { ولكن البر من اتقىلقول فيه كالقول في قوله تعالى : { ولكن البر من ءامن بالله واليوم الآخر } \\[ البقرة : 177 \\] .و { اتقى } فعل منزل منزلة اللازم؛ لأن المراد به من اتصف بالتقوى الشرعية بامتثال المأمورات واجتناب المنهيات .وُجر { بأن تأتوا } بالباء الزائدة لتأكيد النفي بلَيْس ، ومقتضى تأكيد النفي أنهم كانوا يظنون أن هذا المنفي من البر ظناً قوياً فلذلك كانَ مقتضى حالهم أن يؤكَّد نفيُ هذا الظن .وقوله : { وأتوا البيوت من أبوابها } معطوف على جملة { وليس البر } عطف الإنشاء على الخبر الذي هو في معنى الإنشاء؛ لأن قوله : { ليس البر } في معنى النهي عن ذلك فكان كعطف أمر على نهي .وهذه الآية يتعين أن تكون نزلت في سنة خمس حين أزمع النبي صلى الله عليه وسلم الخروج إلى العمرة في ذي القعدة سنة خمس من الهجرة والظاهر أن رسول الله نوى أن يحج بالمسلمين إن لم يصده المشركون ، فيحتمل أنها نزلت في ذي القعدة أو قبله بقليل .وقرأ الجمهور «البيوت» في الموضعين في الآية بكسر الباء على خلاف صيغة جمع فَعْل على فُعول فهي كسرةٌ لمناسبة وقوع الياء التحتية بعد حركة الضم للتخفيف كما قرأوا { عيون } \\[ الحجر : 45 \\] . وقرأه أبو عمرو وورش عن نافع وحفص عن عاصم وأبو جعفر بضم الباء على أصل صيغة الجمع مع عدم الاعتداد ببعض الثقل؛ لأنه لا يبلغ مبلغ الثقل الموجب لتغيير الحركة ، قال ابن العربي في «العواصم» : والذي أَختاره لنفسي إذا قرأتُ أكسر الحروف المنسوبة إلى قالون إلاّ الهمزة فإني أتركه أصلاً إلاّ فيما يحيل المعنى أو يلبسه ولا أكسر باء بيوت ولا عَين عيون ، وأطال بما في بعضه نظر ، وهذا اختيار لنفسه بترجيح بعض القراءات المشهورة على بعض .وقد تقدم خلاف القراء في نصب { البر } من قوله : { ليس البر } \\[ البقرة : 177 \\] وفي تشديد نون { لكن } من قوله : { ولكن البر .وقوله واتقوا الله لعلكم تفلحون } أي تظفَرون بمطلبكم من البر : فإن البر في اتباع الشرع فلا تفعلوا شيئاً إلا إذا كان فيه مرضاة الله ولا تتبعوا خطوات المبتدعين الذين زادوا في الحج ما ليس من شرع إبراهيم .وقد قيل في تفسير الآية وجوه واحتمالات أخرى كلها بعيدة : فقيل إن قوله { وليس البر } مثل ضربه الله لما كانوا يأتونه من النسيء قاله أبو مسلم وفيه بعد حقيقة ومجازاً ومعنى؛ لأن الآيات خطاب للمسلمين وهم الذين سألوا عن الأهلة ، والنسيء من أحوال أهل الجاهلية ، ولأنه يئول إلى استعارة غير رشيقة ، وقيل : مثل ضرب لسؤالهم عن الأهلة من لا يعلم وأمرهم بتفويض العلم إلى الله وهو بعيد جداً لحصول الجواب من قبل ، وقيل : كانوا ينذرون إذا تعسر عليهم مطلوبهم ألاّ يدخلوا بيوتهم من أبوابها فنهوا عن ذلك وهذا بعيدٌ معنى ، لأن الكلام مع المسلمين وهم لا يفعلون ذلك ، وسَنَداً ، إذ لم يروِ أحد أن هذا سبب النزول .\n\n",
      "translations": [
        {
          "translation": "(They ask thee (0 Muhammad), of new moons) they ask you about the increase and decrease of the moon. (Say) Muhammad! (They are fixed seasons for mankind) they are signs for people so that they pay back their debts and know the waiting periods of their women and the timing of their fast and the breaking of their fast (and for the pilgrimage) and for the timing of pilgrimage. This verse was revealed about Mu'adh Ibn Jabal when he asked the Prophet (pbuh) about the timing of the pilgrimage. (It is not righteousness) it is not an act of obedience or God-fearing (that ye go to houses by the backs thereof) during ritual consecration (ihram), (but the righteous man) the obedient person during the time of ritual consecration (is he who wardeth off (evil)) hunting and other things. (So go to the houses) enter the houses (by the gates thereof) by the gates you used to enter, (and observe your duty to Allah) fear Allah during the time of ritual consecration, (that ye may be successful) so that you will be spared Allah's wrath and punishment. This verse was revealed about a group of Companions of the Prophet (pbuh) from the tribes of Kinanah and Khuza'ah, who used to enter their houses, during the time of ritual consecration, from the back or from the roof, as was the habit during the pre-Islamic era.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والوقوف في مقام المعرفة { وليس البرّ بأن تأتوا } بيوت قلوبكم { من ظهورها } من طرق حواسكم ومعلوماتكم المأخوذة من المشاعر البدنية فإنّ ظهر القلب هو الجهة التي تلي البدن { ولكنّ البرّ } برّ { من اتقى } شواغل الحواس وهواجس الخيال ووساوس النفس { وأتوا البيوت من أبوابها } الباطنة التي تلي الروح والحق\n فإنّ باب القلب هو الطريق الذي انفتح منه إلى الحق { واتّقوا الله } في الاشتغال بما يشغلكم عنه { لعلكم تفلحون }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أخبر نبيه صلى الله عليه وسلم عما سألوه امتناناً عليه فقال: { يَسْأَلُونَكَ } أيها الداعي إلى الحق { عَنِ } كيمة تغير { ٱلأَهِلَّةِ قُلْ } واختلافها كمالاً ونقصاناً\n قل لهم في جوابهم كلاماً ناشئاً عن لسان الحكمة مطابقاً لأسلوب الحكيم مقتضى حالكم وإدراككم: إن تسألوا عن الحكم والمصالح المودعة فيها لا عن كمية أمر القمر\n فإنها خارجة عن طوق البشر\n ونهاية مدارك العقلاء من أمر القمر ليس إلا أن نوره مستفاد من الشمس\n وإنه مظلم في ذاته\n وإن استفادته النور بحسب مقابلته بالشمس\n وعدم ممانعة الأرض منها\n\n\nوإمَّا أن الشمس ما هي في ذته والقمر ما هو؟ والارتباط بينهما على أي وجه فسر؟ لا يحوم حوله عقول أحد من خلقه\n بل مما استأثر الله به في علمه\n فلا يسأل عنه أحد\n بل { هِيَ } أي: الاختلافات الواقعة في القمر زيادة ونقصاناً\n ترقياً وتنزيلاً لأجل أنه { مَوَاقِيتُ } معينة { لِلنَّاسِ } في أمور معاشهم من الآجال المقدرة\n لقضاء الديون والعدة وتعليقات المتعلقة بها\n وغير ذلك من التقديرات الجارية في المعاملات بين الناس في العادات والعبادات { وَ } خصوصاً في { ٱلْحَجِّ } والصوم والنذر المعينة\n فإنها كلها تضبط باختلافات إلى غير ذلك من العبادات المؤقتة { وَ } كما أن سؤالكم هذا ليس من الأمور المبرورة المتعلقة لدينكم وتوحيدكم كذلك { لَيْسَ ٱلْبِرُّ بِأَن تَأْتُواْ ٱلْبُيُوتَ مِن ظُهُورِهَا } لا من أبوابها\n\n\nالأنصار كانوا إذا أحرموا للحج لم يدخلوا من أبواب البيوت\n بل يثقبون ظهورها ويدخلون منها يعدون هذه الفعلة من الأمور المبرورة ويعتقدونها كذلك\n لذلك نبه سبحانة على خطئهم\n وأرشدهم إلى البر الحقيقي بقوله: { وَلَـٰكِنَّ ٱلْبِرَّ } المقبول عند الله بر { مَنِ ٱتَّقَىٰ } عن محارم الله مطلقاً حين لبس الإحرام\n إذ الإحرام للموت الإرادي المعبر عنه بلسان الشرع بالحج بمنزلة الكفن للموت الطبيعي\n فكا أن لابس الكفن محفوظ عن جميع المحارم اضطراراً\n كذلك لابس الإحرام لا بد أن يتقي نفسه عن جميع المحارم إرادة واختياراً { وَ } إذا لم يكن الدخول من ظهور البيوت وثيقة من البر { أْتُواْ ٱلْبُيُوتَ مِنْ أَبْوَابِهَا } مغمضين عيونكم عن محارم الله { وَٱتَّقُواْ ٱللَّهَ } مخلصين له خائفين منه { لَعَلَّكُمْ تُفْلِحُونَ } [البقرة: 189] رجاء أن تفوزوا بالفلاح من عند الله بسبب تقواكم\n\n{ وَ } من جملة الحدود الموضوعة فيكم: القتال مع أعداء دينكم { قَاتِلُواْ فِي سَبِيلِ ٱللَّهِ } مع المشركين المعرضين عن طريق الحق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ يَسْئَلُونَكَ عَنِ الأَهِلَّةِ قُلْ هِىَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِ... }  قلت: الذي سأله معاذُ بن جبل وثعلبةُ بن غنمة، فقالا: يا رسول الله: ما بال الهلال يبدو رقيقاً كالخيط، ثم لا يزال يزيد حتى يستوي، ثم لا يزال ينقص حتى يرجع كالخيط؟ فقال الحقّ جلّ جلاله: { يسألونك عن الأهلة } أي: عن حكمة اختلاف الأهلة بالزياة والنقص { قل } لهم يا محمد: { هي مواقيت للناس } يُوقِّتُون بها دُيونهم، ويعرفون بها أوقات زَرْعهم، وعِدَدَ نسائهم وصيامهم، وهي أيضاً مواقيتُ للحج، يعرفون بذلك وقت دخوله وخروجه، فيعرفون الأداء من القضاء، فلو كانت على حالة واحدة لم يعرفوا ذلك. أجابهم الحق تعالى بغير ما ينتظرون أشارة إلى أن السؤال عن سر الاختلاف، ليس فيه منفعة شرعية، وإنما ينبغي الاهتمام بما فيه منفعة دينية. قال أهل الهيئة: إن نورة من نُور الشمس، وجِرْمه أَطْلَس، فكلما بعد من مُسَامته الشمس قابَله نورُها، فإذا قرب منها لميقابله من نورها إلا بعض جِرمه، فإذا دخل تحتها في الفلك كان ظَهره كله إليها، فلم يقابله شيء من نورها، فإذا خرج مِنح تحتِها قابله بقدر ذلك، والله تعالى أعلم. الإشارة: إذا ظهر هلال السعادة في أفق الإرادة، وهبَّت ريح الهداية من ناحية سابق العناية، دخل وقت حج القلوب إلى حضرة علام الغيوب، فهلال الهداية للسائرين، وهم أرباب الأحوال أهل التلوين، يزداد نوره بزيادة اليقين، وينقص بنقصانه، على حسب ضعف حاله وقته، حتى يتحقق الوصال، ويُرزق صف الكمال. وأنشدوا:\nفصاحب التلوين بين الزيادة والنقصان، إلى أن تطلع عليه شمس العرفان، فإذا طلعت شمس العرفان فليس بعدها زيادة ولا نقصان، وأنشدوا:\nبخلاف صاحب التمكين فإنه أبدا في ضياء معرفته، متكنٌ في بُرج سعادته، لا يلحق شمسَه كسوف ولا حجابٌ، ولا يستر نورَها ظلمةٌ ولا سحاب، فلو طلب الحجاب لم يُجَبْ. قال بعض العارفين: لو كُلتُ أنْ أَرى غيره لم أستطع، فإنه لا غير معه حتى أشهده. ثم حذَّر الحق تعالى مما اتبدعه المشركون في الحج، فقال: {... وَلَيْسَ الْبِرُّ بِأَن تَأْتُواْ الْبُيُوتَ مِن ظُهُورِهَا وَلَكِنَ الْبِرَّ مَنِ اتَّقَى وَأْتُواْ الْبُيُوتَ مِنْ أَبْوَابِهَا وَاتَّقُواْ اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ 189 }  قلت: كانت الأنصار إذا حَجُّوا أو اعتمروا، يقولون: لا يَحُول بيننا وبين السماء سَقْفٌ، حتى يدخلوا بيوتهم، فإذا رجعوا تسوَّرُوا الجُدْران، أو نَقَبُوا في ظهور بيوتهم، فجاء رجالٌ منهم فدخل من الباب، فَعُيِّر بذلك، فأنزل الحقّ جلّ جلاله: { وليس البر } أي: الطاعة، { بأن تأتوا البيوت من ظهورها } فتتسوروها، أو تنقُبوا من أعلاها، { ولكن البر من اتقى } المحارم وخالف الشهوات.\nأو: ليس البر بأن تعكسوا مسائلكم بأن تسألوا عما لا نفع لكم فيه، وتتركوا مسائل العلم التي تنفعكم في العاجل والآجل. { ولكن البر من اتقى } ذلك، { وأتوا } بيوت العلم من أبوابها، فتُحسنون السؤال وتتأدبون في المقال، وتقدمون الأهم فالأهم، والأنفع فالأنفع. { واتقوا الله } فلا تُغيروا أحكامه، ولا تعترضوا على أفعاله { لعلكم تفلحون } بتوفيقه وهدايته. الإشارة: اعلم أن البيوت التي يدخلها المريد ثلاثة: بيت الشريعة وبيت الطريقة وبيت الحقيقة، ولكل واحد أبواب فمن أتى البيت من بابه دخل. ومن أتاه من غيره طُرد. فبيت الشريعة له ثلاثة أبواب: الباب الأول: التوبة، فإذا دخل هذا الباب، وحقَّق التوبة بأركانها وشروطها، استقبله باب الاستقامة، وهي: متابعة الرسول في أقواله وأفعاله وأحواله، فإذا دخله، وحقق الاستقامة، استقبله باب التقوى بأقسامها. فإذا حقق التقوى ظاهراً وباطناً، دخل بيت الشريعة المطهرة، وتنزه في محاسنه ومعانيه، ثم يروم دخول بيت الطريقة، وله ثلاثة أبواب: الباب الأول: الإخلاص وهو: إفراد العمل لله نم غير حرف ولا حظ، فإذا حقق الإخلاص استقبله باب التخلية وهي التظهير من العيوب الباطنة، وهي لا تنحصر، لكن من ظفر بالشيخ أطلعه عليها، وعلَّمه أودتيها، فإذا حقق التخلية استقبله باب التحلية، وهي: الاتصاف بأنواع الفضائل كالصبر والحلم والصدق والطمأنينة والسخاء والإيثار، وغير ذلك من أنواع الكمالات. فإذا حقق الإخلاص والتخلية والتحلية فقد حقق بيت الطريقة، ثم يستقبله بيت الحقيقة. فأول ما يقرع باب المراقبة، وهي: حفظ القلب والسر من الخواطر الردية، فإذا تطهر القلب من الخواطر الساكنة، استشرف على باب المشاهدة، وهي: محو الرسول في مشاهدة أنوار الحيّ القيّوم، أو تلطيف الأواني عند ظهور المعاني، فإذا دخل باب المشاهدة، وسكن فيها، استقبله باب المعرفة، وهي محلّ الرسوخ والتمكين، وهي الغاية والمنتهى، فبيت الحقيقة وهو مسجد الحضرة الربانية. وما بقي بعدها إلا الترقي في المقامات، وزيادة المعارف والكشوفات أبداً سرمداً، منحنا الله من ذلك حظّاً وافراً بمنّه وكرمه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:115",
      "similarity": 0.34736492955255077
    },
    {
      "verse": "2:173",
      "similarity": 0.34040559486316857
    },
    {
      "verse": "77:11",
      "similarity": 0.26427986858402486
    },
    {
      "verse": "15:38",
      "similarity": 0.2634271113679627
    },
    {
      "verse": "38:81",
      "similarity": 0.2634271113679627
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002189.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002189.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:189.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}