{
  "chapter": "البقرة",
  "text": "وانفقوا۟ فى سبيل الله ولا تلقوا۟ بايديكم الى التهلكة واحسنوا۟ ان الله يحب المحسنين",
  "translations": [
    {
      "translation": "Spend in the Way of Allah. Do not cast yourselves into destruction. And do good: Allah loves good- doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend in the way of God, and do not seek destruction at your own hands. So do good for God loves those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend your wealth in the Way of Allah and do not cast yourselves into ruin with your own hands. Do all things gracefully, for Allah loves those who do all things with excellence\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give money for the cause of God but do not push yourselves into perdition. Do good; God loves the people who do good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend your wealth in Allah's cause, and do not fall into ruin with your own hands; and be virtuous; undoubtedly the righteous are the beloved of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend in the cause of Allah and do not throw yourselves into destruction, and do good. Truly, Allah loves Al-Muhsinin (those who do good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend in the way of Allah and cast not yourselves to perdition with your own hands, and do good (to others); surely Allah loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And expend in the way of God; and cast not yourselves by your own hands into destruction, but be good-doers; God loves the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend your wealth for the cause of Allah, and be not cast by your own hands to ruin; and do good. Lo! Allah loveth the beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend for God's cause: do not cast yourselves into destruction by your own hands. Do good, God loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And expend in the way of Allah, and cast not yourselves with your hands into perdition, and do well. verily Allah loveth the well- doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend in the way of Allah, and do not cast yourselves with your own hands into destruction; and be virtuous. Indeed Allah loves the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend of your substance in the cause of Allah, and make not your own hands contribute to (your) destruction; but do good; for Allah loveth those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend in the Cause of Allah (i.e. Jihad of all kinds, etc.) and do not throw yourselves into destruction (by not spending your wealth in the Cause of Allah), and do good. Truly, Allah loves Al-Muhsinun (the good-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend in the way of Allah and do not cast into destruction with your own hands. Be gooddoers; Allah loves the gooddoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend in the cause of God, and do not throw yourselves with your own hands into ruin, and be charitable. God loves the charitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend in the way of Allah and do not throw [yourselves] with your [own] hands into destruction [by refraining]. And do good; indeed, Allah loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:195] And spend in the way of God, in obedience to Him, in holy struggle and the like; and cast not your own hands, yourselves (the bā’ of bi-aydīkum ‘with your hands’ is extra) into destruction, by withholding funds needed for the struggle or abandoning it altogether, because this will give your enemy the advantage over you; but be virtuous, by spending etc.; God loves the virtuous, that is, He rewards them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة معطوفة على جملة { وقاتلوا في سبيل الله } \\[ البقرة : 190 \\] الخ فإنهم لما أمروا بقتال عدوهم وكان العدو أوفر منهم عدة حرب أيقظهم إلى الاستعداد بإنفاق الأموال في سبيل الله ، فالمخاطبون بالأمر بالإنفاق جميع المسلمين لا خصوص المقاتلين .ووجه الحاجة إلى هذا الأمر . مع أن الاستعداد للحرب مركوز في الطباع تنبيه المسلمين فإنهم قد يقصرون في الإتيان على منتهى الاستعداد لعدو قوي ، لأنهم قد ملئت قلوبهم إيماناً بالله وثقة به ، وملئت أسماعهم بوعد الله إياهم النصر وأخيراً بقوله : { واعلموا أن الله مع المتقين } نبهوا على أن تعهد الله لهم بالتأييد والنصر لا يسقط عنهم أخذ العدة المعروفة فلا يحسبوا أنهم غير مأمورين ببذل الوسع لوسائل النصر التي هي أسباب ناط الله تعالى بها مسبباتها على حسب الحكمة التي اقتضاها النظام الذي سنه الله في الأسباب ومسبباتها ، فتطلب المسببات دون أسبابها غلط وسوء أدب مع خالق الأسباب ومسبباتها كي لا يكونوا كالذين قالوا لموسى { فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون } \\[ المائدة : 24 \\] فالمسلمون إذا بذلوا وسعهم ، ولم يفرطوا في شيء ثم ارتبكوا في أمر بعد ذلك فالله ناصرهم ، ومؤيدهم فيما لا قبل لهم بتحصيله ولقد نصرهم الله ببدر هم أذلة ، إذ هم يؤمئذٍ جملة المسلمين وإذ لم يقصروا في شيء ، فأما أقوام يتلفون أموال المسلمين في شهواتهم ، ويفيتون الفرص وقت الأمن فلا يستعدون لشيء ثم يطلبون بعد ذلك من الله النصر والظفر فأولئك قوم مغرورون ، ولذلك يسلط الله عليهم أعداءهم بتفريطهم ، ولعله يتداركهم في خلال ذلك بلطفه فيما يرجع إلى استبقاء الدين .والإنفاق تقدم في قوله تعالى : { ومما رزقناهم ينفقون } \\[ البقرة : 3 \\] .و ( سبيل الله ) طريقه ، والطريق إذا أضيف إلى شيء فإنما يضاف إلى ما يوصل إليه ، ولما علم أن الله لا يصل إليه الناس تعيَّن أن يكون المراد من الطريق العمل الموصل إلى مرضاة الله وثوابه ، فهو مجاز في اللفظ ومجاز في الإسناد ، وقد غلب ( سبيل الله ) في اصطلاح الشرع في الجهاد . أي القتال للذب عن دينه وإعلاء كلمته ، و ( في ) للظرفية لأن النفقة تكون بإعطاء العَتاد ، والخيل ، والزاد ، وكل ذلك مظروف للجهاد على وجه المجاز وليست ( في ) هنا مستعملة للتعليل .وقوله تعالى : { ولا تلقوا بأيديكم إلى التهلكة } عطف غرض على غرض ، عُقِّب الأمر بالإنفاق في سبيل الله بالنهي عن الأعمال التي لها عواقب ضارة إبلاغاً للنصيحة والإرشاد لئلا يدفع بهم يقينهم بتأييد الله إياهم إلى التفريط في وسائل الحذر من غلبَة العدو ، فالنهي عن الإلقاء بالنفوس إلى التهلكة يجمع معنى الأمر بالإنفاق وغيره من تصاريف الحرب وحفظ النفوس ، ولذلك فالجملة فيها معنى التذييل وإنما عطفت ولم تفصل باعتبار أنها غرض آخر من أغراض الإرشاد .والإلقاء رمي الشيء من اليد وهو يتعدى إلى مفعول واحد بنفسه وإلى المرمى إليه بإلى وإلى المرمى فيه بفي .والظاهر أن الأيدي هي المفعول إذ لم يذكر غيره ، وأن الباء زائدة لتوكيد اتصال الفِعل بالمفعول كما قالوا للمنقاد «أَعطى بيده» أي أعطى يده لأن المستسلم في الحرب ونحوه يُشَد بيده ، فزيادة الباء كزيادتها في { وهُزى إليك بجِذْع النخلة } \\[ مريم : 25 \\] وقول النابغة: ... لَك الخَيْرُ إِنْ وارتْ بك الأرضُ وَاحِداوالمعنى ولا تعطوا الهلاكَ أيديَكم فيأخذكم أخذ الموثَققِ ، وجل التهلكة كالآخِذِ والآسِرِ استعارة بجامع الإحاطة بالملقى ، ويجوز أن تُجعل اليد مع هذا مجازاً عن الذات بعلاقة البعضية لأن اليد أَهم شيء في النفس في هذا المعنى ، وهذا في الأمرين كقول لبيد: ... حَتَّى إذَا أَلْقَتْ يَداً في كَافِرٍأي ألقت الشمس نفسها . وقيل الباء سببية والأيدي مستعملة في معنى الذات كناية عن الاختيار والمفعول محذوف أي لا تلقوا أنفسكم إلى التهلكة باختياركم .والتهلكة بضم اللام اسم مصدر بمعنى الهلاك ، وإنما كان اسم مصدر لأنه لم يعهد في المصادر وزن التَّفْعلة بضم العين وإنما في المصادر التفعلة بكسر العين لكِنَّه مصدرُ مضاعففِ العين المعتل اللام كزكَّى وغطَّى ، أو المهموز اللام كَجزَّأَ وهيأ ، وحكى سيبويه له نظيرين في المشتقات التَّضُرَّة والتَّسُرَّة بضم العين من أضر وأَسر بمعنى الضُّر والسُّرور ، وفي الأسماء الجامدة التَّنْضُبة والتَّتْفُلة ( الأول اسم شجر ، والثاني ولَدُ الثعلب ) .وفي «تاج العروس» أن الخليل قرأها ( التهلِكة ) بكسر اللام ولا أحسب الخليل قرأ كذلك؛ فإن هذا لم يرو عن أحد من القراء في المشهور ولا الشاذ فإن صح هذا النقل فلعل الخليل نطق به على وجه المثال فلم يضبط من رواه عنه حق الضبط ، فإن الخليل أجل من أن يقرأ القرآن بحرف غير مأثور .ومعنى النهي عن الإلقاء باليد إلى التهلكة النهي عن التسبب في إتلاف النفس أو القوممِ عن تحقق الهلاك بدون أن يجتنَى منه المقصودُ .وعُطِف على الأمر بالإنفاق للإشارة إلى علة مشروعية الإنفاق وإلى سبب الْامر به فإنَّ ترك الإنفاق في سبيل الله والخروجَ بدون عُدة إلقاءٌ باليد للهلاك كما قيل: ... كساععٍ إلى الهَيْجَا بغير سِلاَحفلذلك وجب الإنفاق ، ولأن اعتقاد كفاية الإيمان بالله ونصر دينه في هزم الأعداء اعتقادٌ غير صحيح ، لأنه كالذي يلقي بنفسه للهلاك ويقول سينجيني الله تعالى ، فهذا النهي قد أفاد المعنيين جميعاً وهذا من أبدع الإيجاز .وفي البخاري عن ابن عباس وجماعة من التابعين في معنى { ولا تلقوا بأيديكم إلى التهلكة } لا تتركوا النفقة في سبيل الله وتخافوا العَيْلة وإن لم إلاَّ يكز سهم أو مشقص فأْتتِ به .وقد قيل في تفسير { ولا تلقوا بأيديكم إلى التهلكة } أقوال :الأول أَنَّ { أنفقوا } أمرٌ بالنفقة على العيال ، والتهلكة : الإسراف فيها أو البخل الشديد رواه البخاري عن حذيفة ، ويبعده قوله { في سبيل الله } وأن إطلاق التهلكة على السرف بعيد وعلى البخل أبعد .الثاني أنها النفقة على الفقراء أي الصدقة والتهلكة الإمساك وببعده عدم مناسبة العطف وإطلاق التهلكة على الإمساك .الثالث الإنفاق في الجهاد ، والإلقاء إلى التهلكة الخروج بغير زاد .الرابع الإلقاء باليد إلى التهلكة : الاستسلام في الحرب أي لا تستسلموا للأسر .الخامس أنه الاشتغال عن الجهاد وعن الإنفاق فيه بإصلاح أموالهم .روى الترمذي عن أسلم أبي عمران قال : كنا بمدينة الروم ( القسطنطينية ) فأخرجوا إلينا صفاً عظيماً من الروم فخرج إليهم من المسلمين مثلهم فحمل رجل من المسلمين على صف للروم حتى دخل فيهم فصاح الناس وقالوا : سبحان الله يلقي بيديه إلى التهلكة ، فقام أبو أيوب الأنصاري فقال : يا أيها الناس إنكم تتأوّلون هذه الآية هذا التأويل وإنما أنزلت فينا معاشر الأنصار لما أعزّ الله الإسلام وكثر ناصروه قال بعضنا لبعض سراً دون رسول الله : إن أموالنا قد ضاعت وإن الله قد أعز الإسلام وكثر ناصروه فلو أقمنا في أموالنا فأصلحنا ما ضاع منها فأنزل الله على نبيه يرد علينا ما قلنا : { وأنفقوا في سبيل الله ولا تلقوا بأيديكم إلى التهلكة } فكانت التهلكة الإقامة على الأموال وإصلاحها وتركنا الغزو اه ، والآية تتحمل جميع المعاني المقبولة .ووقوع فعل { تلقوا } في سياق النهي يقتضي عموم كل إلقاء باليد للتهلكة أي كل تسبب في الهلاك عن عمد فيكون منهياً عنه محرماً ما لم يوجد مقتض لإزالة ذلك التحريم وهو ما يكون حفظه مقدماً على حفظ النفس مع تحقق حصول حفظه بسبب الإلقاء بالنفس إلى الهلاك أو حفظ بعضه بسبب ذلك . فالتفريط في الاستعداد للجهاد حرام لا محالة لأنه إلقاء باليد إلى التهلكة ، وإلقاء بالأمة والدين إليها بإتلاف نفوس المسلمين .وقد اختلف العلماء في مثل هذا الخبر الذي رواه الترمذي عن أبي أيوب وهو اقتحام الرجل الواحد على صف العدو فقال القاسم بن محمد ( من التابعين ) وعبد الملك بن الماجشون وابن خويز منداد ( من المالكية ) ومحمد بن الحسن صاحب أبي حنيفة : لا بأس بذلك إذا كان فيه قوة وكان بنية خالصة لله تعالى وطمع في نجاة أو في نكاية العدو أو قصد تجرئة المسلمين عليهم ، وقد وقع ذلك من بعض المسلمين يوم أحد بمرأى النبي صلى الله عليه وسلم فإن لم يكن كذلك كان من الإلقاء إلى التهلكة .وقوله تعالى : { وأحسنوا } الإحسان فعل النافع الملائم ، فإذا فعل فعلاً نافعاً مؤلماً لا يكون محسناً فلا تقول إذا ضربت رجلاً تأديباً : أحسنت إليه ولا إذا جاريته في ملذات مضرة أَحسنت إليه ، وكذا إذا فعل فعلاً مضراً ملائماً لا يسمى محسناً .وفي حذف متعلق { أحسنوا } تنبيه على أن الإحسان مطلوب في كل حال ويؤيده قوله صلى الله عليه وسلم في الحديث الصحيح : \" إن الله كتب الإحسان على كل شيء \" .وفي الأمر بالإحسان بعد ذكر الأمر بالاعتداء على المعتدي والإنفاق في سبيل الله والنهي عن الإلقاء باليد إلى التهلكة إشارة إلى أنّ كلّ هاته الأحوال يلابسها الإحسان ويحفّ بها ، ففي الاعتداء يكون الإحسان بالوقوف عند الحدود والاقتصاد في الاعتداء والاقتناع بما يحصل به الصلاح المطلوب ، وفي الجهاد في سبيل الله يكون الإحسان بالرفق بالأسير والمغلوب وبحفظ أموال المغلوبين وديارهم من التخريب والتحريق ، والعرب تقول : «ملكت فأسجح» ، والحذر من الإلقاء باليد إلى التهلكة إحسان .وقوله : { إن الله يحب المحسنين } تذييل للترغيب في الإحسان ، لأن محبة الله عبده غاية ما يطلبه الناس إذ محبة الله العبد سبب الصلاح والخير دنيا وآخرة ، واللام للاستغراق العرفي والمراد المحسنون من المؤمنين .\n\n",
      "translations": [
        {
          "translation": "(Spend your wealth for the cause of Allah) in obedience of Allah so as to perform the lesser pilgrimage, (and be not cast by your own hands to ruin) Allah says: do not refrain from giving in His cause lest you ruin yourselves. It is also said that this means: do not be the cause of your own ruin; and it is also said that this means: do not despair of Allah's mercy lest you ruin yourselves; (and do good) by spending in the cause of Allah; it is also said that this means: have a good opinion about Allah; and it is also said that this means: be good in your spending in the way of Allah. (Lo! Allah loveth the beneficent) who spend in His cause. The verses from (Fight in the way of Allah against those who fight against you) to (and do good. Lo! Allah loveth the beneficent) were revealed about the Companions who were in ritual consecration with the Prophet (pbuh) on their way to perform the lesser pilgrimage after the year of al-Hudaybiyyah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلاَ تُلْقُواْ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ } قالَ زيدُ بن علي عليهما السلامُ التَّهْلُكَةُ: الهَلاكُ\n يقالُ هَلاكٌ وهُلْكٌ\n وأَرادَ بِهِ تَركَ النَفَقَةِ فِي سَبِيلِ الله\n ويقالُ: أَرادَ القنوطَ ومثلُهُ قَولُهُ:\n\n[الزمر: 53]\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And do not throw yourselves into destruction with your own hands} Zaid ibn Ali said: \"Destruction\" is destruction.\n\n\nThis is said to be destruction and ruin.\n And he wanted to {leave} the expenditure in the way of Allah\n It is said: \"He wanted the quenoot and his like {i.e. the quenoot and things like it}\"\n\n\nThe People: 53",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأنفقوا في سبيل الله } ما معكم من العلوم بالعمل بها ولا تدّخروها لوقت آخر عسى لا تدركونه فلا شيء أضرّ من التسويف { ولا تلقوا بأيديكم إلى } تهلكة التفريط وتأخير العمل بالعلم وإنفاقه في مصالح النفس فإنه موجب للحرمان { وأحسنوا } أي: وكونوا في عملكم مشاهدين { إنّ الله يحبّ المُحْسنين } المشاهدين في أعمالهم ربّهم\n مخلصين له فيها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الأخلاٌ الموضوعة فيم: الإنفاق في فواضيل أمولكم إلى الفقراء والمساكين الذين أسكنهم الاحتياج والإسكان في زواية الخمول { أَنْفِقُواْ } أيها المؤمنون { فِي سَبِيلِ ٱللَّهِ } مقتصدين فيه بين طرفي التبذير والتقتير المذمومين عند الله وعند المؤمنين { وَلاَ تُلْقُواْ بِأَيْدِيكُمْ } أنفسكم { إِلَى ٱلتَّهْلُكَةِ } والمشقة بالإسراف والتضييع أو بالبخل والتقتير\n إذ بالبخل تبقى النفس في ظلمة الإمكان وتوطن في وحشة الحرمان والخذلان { وَ } من جملة أخلاقكم الإحسان { أَحْسِنُوۤاْ } أيها المتوجهون إلى فضاء التوحيد أخلاقكم وأعمالكم وجميع أوصافكم\n إذ ما من نبي ولا وليذٍ إلا هو مجبول على حسن الأخلاق والشيم المقتبسة من أخلاق الله سبحانه\n لذلك استحقوا الخلافة والنيبة { إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ } [البقرة: 195] المتفضلين بالأموال والأعمال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولا تمسكوا عن الإنفاق فيه فتلقوا { بإيديكم } أي: بأنفسكم { إلى التهلكة } أي: الهلكة فيستولي عليكم عدوكم\n رُوِيَ عن أبي أيوب الأنصاري أنه كان على القسطنطينية\n فحمل رجل على عسكر العدو\n فقال قوم: ألقى بيده إلى التهلكة\n فقال أبو أيوب: لا\n إن هذه الآية نزلت في الأنصار\n قالوا - لما أعز الله الإسلام وكثرب أهله -: لو رجعنا إلى أهلينا وأموالنا نقيم فيها ونصلحها\n فأنزل الله فينا { ولا تلقوا بأيديكم إلى التهلكة } \n وأما هذا فهو الذي قال فيه الله تعالى:\n[البقرة: 207] أو: ولا تنفقوا كل أموالكم فتتعرضوا للهلكة\n أو الطمع في الخلق\n ولكن القصد\n وهو الوسط\n\n{ وأحسنوا } بالتفضل على المحاويج والمجاهدين: { إن الله يحب المحسنين } فيحفظهم\n ويحفظ عقبهم إلى يوم القيامة\n الإشارة: أعلم أن أعداء الإنسان التي تقطعه عن حضرة ربه أربعة: النفس والشيطان والدنيا والناس\n فمجاهدة النفس: بمخالفة هواها\n وتحميلها ما يَثقُل عليها حتى ترتاض\n ومجاهدة الشيطان: بعصيانه\n والاشتغال بالله عنه\n فإنه يذوب بذكر الله\n ومجاهدة الدنيا: بالزهد فيها\n والقناعة بما تيسر منها\n ومجاهدة الناس: بالغيبة عنهم والإعراض عنهم في الإقبال والإدبار\n فيقول الحقّ جلّ جلاله للمتوجهين إليه: { وقاتلوا في سبيل الله الذين يقاتلونكم } ويصدونكم عن حضرته\n ولا تعتدوا فتشتغلوا بهم عن ذكري\n والإقبال عليّ\n { إن الله لا يحب المعتدين }\n بل اقتلوهم حيث تعرضوا لكم فقط\n فإذا ظهرت صورة النفس أدبها\n ثم غاب في الله عنها\n وكذلك بقية القواطع\n وكان شيخ شيوخنا سيدي علي الجمل رضي الله عنه يقول: عداوة العدو حقّاً هي اشتغالك بمحبة الحبيب حقّاً\n وأما إذا اشتغلت بعداوة العدو فاتتك محبة الحبيب\n ونال العدو مراده منك\n هـ\n وأخرجوهم من قلوبكم من حيث أخرجوكم من حضرة ربكم\n يعني: كما أخرجوكم من الحضرة في أيام الغفلة\n أخرجوهم من قلوبكم في أيام اليقظة\n والفتنة بالاشتغال بهم أشد من القتل لهم\n ولا تقاتلوهم عند مسجد الحضرة وحال الغيبة في الله\n فإن ذلك التفات إلى غير الله\n كمن كان مقبلاً عليه حبيبه فجعل يلتفت إلى مَن يكلمه ويشغله عنه\n وذلك في غاية الجفاء\n حتى يقاتلوكم فيه\n ويريدون أن يخرجوكم منه بوسوستهم\n فإن قاتلوكم\n وخطر على بالكم شيء من وسوستهم\n فاقتلوهم بذكر الله\n والتعوّذ منهم\n فإن الله يكفيكم أمرهم\n وينهزمون عنكم\n كذلك جزاء الكافرين\n فإن انتهوا عنكم\n وانقطع عنكم خواطرهم\n فغيبوا عنهم فإن الله يستركم عنهم\n وقاتلوهم على الدوام حتى لا تكون في قلوبكم فتنة منهم\n ويكون التوجه كله لله\n لا ينازعه شيء مما سواه\n فإن انتهوا عنكم فلا تتعرضوا لهم فإن ذلك عدوان وظلم\n\n[البقرة: 193]\n فإن جَنَحَتْ نفسُك إلى حرمة الطاعة الظاهرة كتدريس علم أو جهاد أو غيرها\n وأرادت أن تخرجك من حرمة الحضرة القدسية وهي الفكرة والشهود والمعاينة\n فقاتلها وأخرجها من حرمة تلك الطاعة\n فالحرمات قصاص\n فكما أخرجتك من حضرة ربك القدسية أخرِجْها من حضرة الطاعة الحسية إلى الطاعة القلبية\n فإن الذَّرَّةَ من أعمال القلوب أفضل من أمثال الجبال من أعمال الجوارح\n فمَن اعتدى عليكم\n في زمن البطالة\n فاعتدوا عليه في زمن اليقظة بمثل ما اعتدى عليكم\n وكان شيخنا البوزيدي رضي الله عنه يقول: جوروا على نفوسكم بقدر ما جارت عليكم هـ\n أي: اقتلوها بقدر ما قتلتكم بالبعد عن ربكم\n وكان أيضاً يقول: جوروا على الوهم قل أن يجور عليكم\n هـ\n واتقوا الله فإن الله يعينكم عليها\n { واعلموا أن الله مع المتقين }\n وأنفقوا أنفسكم ومهجكم في سبيل الله\n بأن تطرحوها في يد الله يفعل بها ما يشاء\n { ولا تلقوا بأيديكم إلى التهلكة } فتدبروا لها\n وتختاروا لها\n وتعتنوا بشؤونها\n فإن ذلك غفلة عن ربكم\n { وأحسنوا } أي: ادخلوا في مقام الإحسان بأن تعبدوا لله كأنكم ترونه { إن الله يحب المحسنين } أي: يقربهم إلى حضرته\n ويصطفيهم إلى محبته ومعرفته\n خرطنا الله في سلكهم بمنِّه وكرمه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:190",
      "similarity": 0.36854208029115293
    },
    {
      "verse": "23:48",
      "similarity": 0.3418085212186571
    },
    {
      "verse": "26:139",
      "similarity": 0.3259615469074391
    },
    {
      "verse": "9:77",
      "similarity": 0.32375898895934824
    },
    {
      "verse": "77:16",
      "similarity": 0.31523946096887434
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002195.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002195.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:195.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}