{
  "chapter": "البقرة",
  "text": "ثم افيضوا۟ من حيث افاض الناس واستغفروا۟ الله ان الله غفور رحيم",
  "translations": [
    {
      "translation": "Then press on from where the people press on and ask Allah's forgiveness. Allah is Ever-Forgiving,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then move with the crowd impetuously, and pray God to forgive you your sins. God is surely forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then return from where others return and ask Allah's forgiveness. Most surely He is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then leave Mash'ar as the rest of the people do and ask forgiveness from God; He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, O people of Quraish, you too must return from the place where the people return from, and ask forgiveness from Allah; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then depart from the place whence all the people depart and ask Allah for His forgiveness. Truly, Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hasten on from the Place from which the people hasten on and ask the forgiveness of Allah; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then press on from where the people press on, and pray for God's forgiveness; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hasten onward from the place whence the multitude hasteneth onward, and ask forgiveness of Allah. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then press on from where the pilgrims stream forth and ask God's forgiveness. God is ever forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hurry from the place whence the other people have hurried, and ask forgiveness of Allah, verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then stream out from where the people stream out, and plead to Allah for forgiveness; indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then pass on at a quick pace from the place whence it is usual for the multitude so to do, and ask for Allah's forgiveness. For Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then depart from the place whence all the people depart and ask Allah for His Forgiveness. Truly, Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then surge on from where the people surge and ask Allah for forgiveness. He is Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then disperse from where the people disperse, and ask God for forgiveness. God is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then depart from the place from where [all] the people depart and ask forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:199] Then (thumma denotes the sequence intended) press on, O Quraysh, from where the people press on, that is, from ‘Arafa, by standing there together with them (for, they used to stand at Muzdalifa, disdaining to stand with other people); and seek God’s forgiveness, for your sins; God is Forgiving, Merciful, to the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالذي عليه جمهور المفسرين أن ثم للتراخي الإخباري للترقى في الخبر وأن الإفاضة المأمور بها هنا هي عين الإفاضة المذكورة في قوله تعالى : { فإذا أفضتم من عرفات } \\[ البقرة : 198 \\] وأن العطف بثم للعودة إلى الكلام على تلك الإفاضة .فالمقصود من الأمر هو متعلق { أفيضوا } أي قوله : { من حيث أفاض الناس } إشارة إلى عرفات فيكون متضمناً الأمر بالوقوف بعرفة لا بغيرها إبطالاً لعمل قريش الذين كانوا يقفون يوم الحج الأكبر على ( قُزَح ) المسمى بجمع وبالمشعر الحرام فهو من المزدلفة وكان سائر العرب وغيرهم يقف بعرفات فيكون المراد بالناس في جمهورهم من عدا قريشاً .عن عائشة أنها قالت : كانت قريش ومن دَان دينها يقفون بيوم عرفة في المزدلفة وكانوا يسمون الحمس وكان سائر العرب يقفون بعرفة فلما جاء الإسلام أمر الله نبيه أن يأتي عرفات ثم يقف بها ثم يفيض منها فذلك قوله تعالى : { ثم أفيضوا من حيث أفاض الناس } اه فالمخاطب بقوله : { أفيضوا } جميع المسلمين والمراد بالناس عموم الناس يعني من عدا قريشاً ومن كان من الحمس الذين كانوا يفيضون من المزدلفة وهم قريش ومن ولدوا وكنانة وأحلافهم .روى الطبري عن ابن أبي نجيح قال : كانت قريش لا أدري قبل الفيل أم بعده ابتدعت أمر الحمس رأياً قالوا : نحن ولاة البيت وقاطنو مكة فليس لأحد من العرب مثل حقنا ولا مثل منزلنا فلا تعظموا شيئاً من الحللِ كما تعظمون الحرم يعني لأن عرفة من الحل فإنكم إن فعلتم ذلك استخفت العرب بحرَمكم وقالوا : قد عظموا من الحل مثلَ ما عظموا من الحرم فلذلك تركوا الوقوف بعرفة والإفاضة منها وكانت كنانة وخزاعة قد دخلوا معهم في ذلك اه ، يعني فكانوا لا يفيضون إلاّ إفاضة واحدة بأن ينتظروا الحجيج حتى يردوا من عرفة إلى مزدلفة فيجتمع الناس كلهم في مزدلفة ولعل هذا وجه تسمية مزدلفة بجمع ، لأنها يجمع بها الحمس وغيرهم في الإفاضة فتكون الآية قد ردت على قريش الاقتصار على الوقوف بمزدلفة .وقيل : المراد بقوله : { ثم أفيضوا } الإفاضة من مزدلفة إلى منى ، فتكون ( ثم ) للتراخي والترتيب في الزمن أي بعد أن تذكروا الله عند المشعر الحرام وهي من السنة القديمة من عهد إبراهيم عليه السلام فيما يقال ، وكان عليها العرب في الجاهلية وكانت الإجازة فيها بيد خُزاعة ثم صارت بعدهم لبني عَدْوان من قيس عَيلان ، وكان آخرُ من تولى الإجازة منهم أبا سَيَّارة عُمَيلة بن الأعزل أجاز بالناس أربعين سنة إلى أن فتحت مكة فأبطلت الإجازة وصار الناس يتبعون أمير الحج ، وكانوا في الجاهلية يخرجون من مزدلفة يوم عاشر ذي الحجة بعد أن تطلع الشمس على ثَبير وهو أعلى جبللٍ قُرب منى وكان الذي يُجيز بهم يقف قبيل طلوع الشمس مستقبل القبلة ويدعو بدعاء يقول فيه : «اللهم بَغِّض بين رعائنا ، وحَبِّب بين نسائنا ، واجعل المال في سُمَحائنا ، اللهم كن لنا جاراً ممن نخافه ، أَوْفُوا بعهدكم ، وأكرموا جاركم ، واقروا ضيفكم» ، فإن قرب طلوع الشمس قال : «أَشْرِقْ ثَبير كيما نُغير» ويركب أبو سيارة حماراً أسود فإذا طلعت الشمس دَفَع بهم وتبعه الناس وقد قال في ذلك راجزهم :خَلُّوا السبيلَ عن أبي سَيَّارهْ ... وعن مَواليه بني فَزارهْحتَّى يُجيز سالماً حِمارَه ... مستقبل القبلةِ يَدْعو جَارهْأي يدعو الله تعالى لقوله : «اللهم كن لنا جاراً ممن نخافه .فقوله : { من حيث أفاض الناس } أي من المكان الذي يفيض منه سائر الناس وهو مزدلفة . وعبر عنه بذلك لأن العرب كلهم يجتمعون في مزدلفة ، ولولا ما جاء من الحديث لكان هذا التفسير أظهر لتكون الآية ذكرت الإفاضتين بالصراحة وليناسب قوله بعد : { فإذا قضيتم مناسككم } \\[ البقرة : 200 \\] .وقوله : { من ربكم } عطف على { أفيضوا من حيث أفاض الناس } أمرهم بالاستغفار كما أمرهم بذكر الله عند المشعر الحرام . وفيه تعريض بقريش فيما كانوا عليه من ترك الوقوف بعرفة .\n\n",
      "translations": [
        {
          "translation": "(Then hasten onward from the place whence the multitude hasteneth onward) He says: return from whence the people of Yemen have returned, (and ask forgiveness of Allah) for your sins. (Lo! Allah is Forgiving) of those who repent, (Merciful) towards those who die in a state of repentance. This was revealed about a group of people called the \"Hamsiyyun\" who did not want to press on from the Inviolable Place of Worship to 'Arafat during their pilgrimage. Allah warned them against this, commanding them to go to 'Arafat and then return from there.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ثم أفيضُوا من حيث أفاضَ الناس } ثم أفيضوا إلى ظواهر العبادات والطاعات وسائر وظائف الشرعيات والمعاملات من حيث\n أي: من مقام إفاضة سائر الناس فيها\n وكونوا كأحدهم\n قيل لجنيد رحمة الله عليه: ما النهاية؟ قال: الرجوع إلى البداية\n { واسْتَغفروا الله } من ظهور النفس وتبرمها بالحال وطغيانها\n قال النبي صلى الله عليه وسلم:\n \" إنه ليغان على قلبي\n وإني لأستغفر الله في اليوم سبعين مرة \" \nوقال صلى الله عليه وسلم:\n \" اللهم ثبتني على دينك \" \n\n فقيل له في ذلك فقال صلى الله عليه وسلم:\n \" أو ما يؤمنني\n إنّ مثل القلب كمثل ريشة في فلاة\n تقلّبها الرياح كيف شاءت \"\n \n\n \" ولما تورّمت قدماه فقالت له عائشة رضي الله عنها: أما غفر لك الله ما تقدم من ذنبك وما تأخر؟ قال صلى الله عليه وسلم: \" أفلا أكون عبداً شكوراً \" \" \nوقال أمير المؤمنين عليه السلام: \" أعوذ بالله من الضلال بعد الهدى \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } لما تم توجهكم ووقوفكم بعرفة الذات وتحققكم بها { أَفِيضُواْ } منها { مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ } إلى المرابت المترتبة إلى الصفات { وَٱسْتَغْفِرُواْ ٱللَّهَ } المحيط بكم فيها { إِنَّ ٱللَّهَ غَفُورٌ } ساتر لرتبكم وتعيناتكم { رَّحِيمٌ } [البقرة: 199] لكم بإيصالكم إلى مبدئكم الأصلي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:14",
      "similarity": 0.6938486781052462
    },
    {
      "verse": "46:8",
      "similarity": 0.6886113421829336
    },
    {
      "verse": "7:50",
      "similarity": 0.6424000835238971
    },
    {
      "verse": "2:198",
      "similarity": 0.5558492457242803
    },
    {
      "verse": "5:83",
      "similarity": 0.28622369241153023
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002199.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002199.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:199.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}