{
  "chapter": "البقرة",
  "text": "ليس عليكم جناح ان تبتغوا۟ فضلا من ربكم فاذا افضتم من عرفت فاذكروا۟ الله عند المشعر الحرام واذكروه كما هدىكم وان كنتم من قبله لمن الضالين",
  "translations": [
    {
      "translation": "There is nothing wrong in seeking bounty from your Lord. When you pour down from Arafat, remember Allah at the Sacred Landmark.* Remember Him because He has guided you, even though before this you were astray.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin to seek the favours of your Lord (by trading). When you start from 'Arafat in a concourse, remember God at the monument that is sacred (al-Mash'ar al-haram), and remember Him as He has shown you the way, for in the olden days you we're a people astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is nothing wrong if you also seek the bounty of your Lord during the pilgrimage. Moreover, when you return from 'Arafat, stay at Mash'aril-Haram (Muzdalifah) and remember Allah. And remember Him just as He has enjoined you, for you had gone astray before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not a sin if you try to make a profit out of the bounty of your Lord (by trading during hajj). When you leave Arafah, commemorate the name of your Lord in Mash'ar, the sacred reminder of God. Commemorate His name as He has given you guidance while prior to that you had been in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin for you that you seek the bounty of your Lord; so when you return from Arafat, remember Allah near the Sacred Symbol (Mash’ar al Haram) – and remember Him in the manner He has guided you; and indeed, before this, you were of the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin on you if you seek the bounty of your Lord (during pilgrimage by trading). Then when you leave `Arafat, remember Allah (by glorifying His praises, i.e., prayers and invocations) at the Mash`ar-il-Haram. And remember Him (by invoking Allah for all good) as He has guided you, and verily you were before, of those who were astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on you in seeking bounty from your Lord, so when you hasten on from \"Arafat\", then remember Allah near the Holy Monument, and remember Him as He has guided you, though before that you were certainly of the erring ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no fault in you, that you should seek bounty from your Lord; but when you press on from Arafat, then remember God at the Holy Waymark, and remember Him as He has guided you, though formerly you were gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin for you that ye seek the bounty of your Lord (by trading). But, when ye press on in the multitude from 'Arafat, remember Allah by the sacred monument. Remember Him as He hath guided you, although before ye were of those astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will be committing no sin if [during the pilgrimage] you seek to obtain any bounty from your Lord. When you return from Arafat, remember God at the sacred place, and remember Him as He has guided you. Before this you were surely astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No fault it is in you if ye seek grace from your Lord. Then when ye hurry from Arafat, remember Allah near the sacred monument. Remember Him as He hath guided you, and ye were afore of the erring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin upon you in seeking your Lord’s bounty [during the hajj season]. Then when you stream out of ‘Arafat remember Allah at the Holy Mash‘ar, and remember Him as He has guided you, and earlier you were indeed among the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no crime in you if ye seek of the bounty of your Lord (during pilgrimage). Then when ye pour down from (Mount) Arafat, celebrate the praises of Allah at the Sacred Monument, and celebrate His praises as He has directed you, even though, before this, ye went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin on you if you seek the Bounty of your Lord (during pilgrimage by trading, etc.). Then when you leave 'Arafat, remember Allah (by glorifying His Praises, i.e. prayers and invocations, etc.) at the Mash'ar-il-Haram. And remember Him (by invoking Allah for all good, etc.) as He has guided you, and verily, you were, before, of those who were astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be no offense for you to seek the bounty of your Lord. When you surge on from Arafat, remember Allah as you approach the Holy Mountain of Mash'ar. Remember Him as it is He who guided you though before that you were amongst the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You commit no error by seeking bounty from your Lord. When you disperse from Arafat, remember God at the Sacred Landmark. And remember Him as He has guided you. Although, before that, you were of those astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon you for seeking bounty from your Lord [during Hajj]. But when you depart from 'Arafat, remember Allah at al- Mash'ar al-Haram. And remember Him, as He has guided you, for indeed, you were before that among those astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:198] You would not be at fault if you should seek bounty, sustenance, from your Lord, by engaging in commerce at the Pilgrimage: this was revealed in response to their aversion to such an idea; but when you press on, push on, from ‘Arafāt, having stood [in prayer] upon it, then remember God, after the overnight stay at Muzdalifa, by repeating the talbiya [sc. labbayka Llāhummā labbayk, ‘at thy service, O God, at thy service’], the tahlīl [lā ilāha illā Llāh, ‘no god but God’] and making supplications, at the Sacred Waymark, a mountain at the end of Muzdalifa, called Quzah. In one hadīth, the Prophet (s) stood there remembering God and supplicating until his face began to glow brightly, according to Muslim; and remember Him as He has guided you, to the principal rites of His religion and the rituals of His Pilgrimage (the kāf of ka-mā, ‘as’, is the particle denoting the reason), though previously, before His guidance, you were astray.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة معترضة بين المتعاطفين بمناسبة النهي عن أعمال في الحج تنافي المقصد منه فنقل الكلام إلى إباحة ما كانوا يتحرجون منه في الحج وهو التجارة ببيان أنها لا تنافي المقصد الشرعي إبطالاً لما كان عليه المشركون ، إذ كانوا يرون التجارة للمُحْرم بالحج حراماً . فالفضل هنا هو المال ، وابتغاء الفضل التجارة لأجل الربح كما هو في قوله تعالى : { وآخرون يضربون في الأرض يبتغون من فضل الله لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ } \\[ المزمل : 20 \\] . وقد كان أهل الجاهلية إذا خرجوا من سوق ذي المجاز إلى مكة حرم عندهم البيع والشراء قال النابغة :كادَتْ تُسَاقِطُني رَحْلي ومِيثَرَتِي ... بذِي المجاز ولم تُحسس به نَغَما ( )من صَوْتتِ حِرْمِيَّةٍ قالتْ وقد ظعنوا ... هل في مُخِفِّيكُمُ مَنْ يشتري أَدَماقلتُ لهَا وهي تَسْعَى تحتَ لَبَّتِها ... لا تَحْطِمنَّككِ إن البيعَ قد زَرِماأي انقطع البيع وحَرُم ، وعن ابن عباس : كانت عكاظ ومَجَنَّة ، وذو المجاز أسواقاً في الجاهلية فتأَثَّمُوا أنْ يَتَّجِرُوا في المواسم فنزلت : ( ليس عليكم جناح أن تبتغوا فضلاً من ربكم في موسم الحج ) اه . أي قرأها ابن عباس بزيادة في مواسم الحج .وقد كانت سوق عكاظ تفتح مستهل ذي القعدة وتدوم عشرين يوماً وفيها تباع نفائس السلع وتتفاخر القبائل ويتبارى الشعراء ، فهي أعظم أسواق العرب وكان موقعها بين نَخْلَةَ والطائف ، ثم يخرجون من عكاظ إلى مَجِنَة ثم إلى ذي المَجاز ، والمظنون أنهم يقضون بين هاتين السوقين بقية شهر ذي القعدة؛ لأن النابغة ذكر أنه أقام بذي المجاز أربع ليال وأنه خرج من ذي المجاز إلى مكة فقال يذكر راحلته :باتَت ثلاثَ لياللٍ ثم واحِدَةً ... بذي المجاز تُراعِي مَنْزِلاً زِيَمَاثم ذكر أنه خرج من هنالك حاجّاً فقال :كادَتْ تُساقِطني رَحْلي ومِيثَرَتِي ... الفاء عاطفة على قوله : { فلا رفث ولا فسوق } \\[ البقرة : 197 \\] الآية ، عطف الأمر على النهي ، وقوله : ( إذا أفضتم ) شرط للمقصود وهو : ( فاذكروا الله ) .والإفاضة هنا : الخروج بسرعة وأصلها من فاض الماء إذا كثر على ما يحويه فبرز منه وسالَ؛ ولذلك سموا إحالة القِداح في المَيْسر إفَاضَةً والمجيلَ مُفيضاً ، لأنه يُخْرِج القِدَاح من الرِّبَابَة بقوة وسرعة أي بدون تَخَيُّر ولا جَسَ لينظر القدح الذي يخرج ، وسمَّوا الخروج من عرفة إفاضة لأنهم يخرجون في وقت واحد وهم عدد كثير فتكون لخروجهم شدة ، والإفاضة أطلقت في هاته الآية على الخروج من عرفة والخروج من مزدلفة .والعرب كانوا يسمون الخروج من عرفة الدَّفْع ، ويسمون الخروج من مزدلفة إفاضة ، وكلا الإطلاقين مجاز؛ لأن الدفع هو إبعاد الجسم بقوة ، ومن بلاغة القرآن إطلاق الإفاضة على الخروجين؛ لما في أفاض من قرب المشابهة من حيث معنى الكثرة دون الشدة . ولأن في تجنُّب دَفَعْتُم تجنباً لتوهم السامعين أن السير مشتمل على دفععِ بعض الناس بعضاً؛ لأنهم كانوا يجعلون في دفعهم ضَوْضَاء وجلبة وسرعةَ سير فنهاهم النبي صلى الله عليه وسلم عن ذلك في حجة الوداع وقال :\" ليس البِرُّ بالإيضَاع فإذا أفضتم فعليكم بالسَّكينة والوَقَار \" .و ( عرفات ) اسم واد ويقال : بطن وهو مَسِيلٌ متَّسع تنحدر إليه مياه جبال تحيط به تعرف بجبال عرفة بالإفراد ، وقد جُعل عرفات علَمَاً على ذلك الوادي بصيغة الجمع بألففٍ وتاء ، ويقال له : عرفة بصيغة المفرد ، وقال الفرّاء : قول الناس يومُ عَرفة مولَّد ليس بعربي محْضضٍ ، وخالفه أكثر أهل العلم فقالوا : يقال عرفات وعرفة ، وقد جاء في عدة أحاديث «يوم عرفة» ، وقال بعض أهل اللغة : لا يقال : يوم عرفات .وفي وسط وادي عرفة جُبيل يقف عليه ناس ممن يقفون بعرفة ويخطب عليه الخطيب بالناس يوم تاسع ذي الحجة عند الظهر ، ووقف عليه النبي صلى الله عليه وسلم راكباً يوم عرفة ، وبُني في أعلى ذلك الجبيل عَلَم في الموضع الذي وقف فيه النبي عليه الصلاة والسلام فيقف الأئمة يوم عرفة عنده .ولا يُدرَى وجه اشتقاققٍ في تسمية المكان عَرَفات أو عَرَفة ، ولا أنه علم منقول أو مرتجل ، والذي اختارَه الزمخشري وابنُ عطية أنه علم مرتجل ، والذي يظهر أن أحد الاسمين أصل والآخر طارىء عليه وأن الأصل ( عرفات ) من العربية القديمة وأن عرفة تخفيف جرى على الألسنة ، ويحتمل أن يكون الأصل ( عرفة ) وأن عرفات إشباع من لغة بعض القبائل .وذكر ( عرفات ) باسمه في القرآن يشير إلى أن الوقوف بعرفة رُكن الحج وقال النبي صلى الله عليه وسلم \" الحج عرفة \" .سمي الموضع عرفات الذي هو على زنة الجمع بألففٍ وتاء فعاملوه معاملة الجمع بألففٍ وتاء ولم يمنعوه الصرف مع وجود العلمية . وجمع المؤنث لا يُمنع من الصرف؛ لأن الجمع يزيل ما في المفرد من العلمية؛ إذ الجمع بتقدير مُسَمَّيَات بكذا ، فما جُمع إلاّ بعدَ قصدِ تنكيره ، فالتأنيث الذي يمنع الصرف مع العلمية أو الوصفية هو التأنيث بالهاء .وذكر الإفاضة من ( عرفات ) يقتضي سبق الوقوف به؛ لأنه لا إفاضة إلاّ بعد الحُلول بها ، وذِكر ( عرفات ) باسمه تنويه به يدل على أن الوقوف به ركن فلم يُذكر من المناسك باسمه غير عرفة والصفا والمروة ، وفي ذلك دلالة على أنهما من الأركان ، خلافاً لأبي حنيفة في الصفا والمروة ، ويؤخذ ركن الإحرام من قوله : { فمن فرض فيهن الحج } \\[ البقرة : 197 \\] ، وأما طواف الإفاضة فثبت بالسنة وإجماع الفقهاء .و ( من ) ابتدائية .والمعنى فإذا أفضتم خارجين من عرفات إلى المزدلفة .والتصريح باسم ( عرفات ) في هذه الآية للرد على قريش؛ إذ كانوا في الجاهلية يقفون في ( جَمْع ) وهو المزدلفة؛ لأنهم حُمْس ، فيرون أن الوقوف لا يكون خارج الحرم ، ولما كانت مزدلفة من الحرم كانوا يقفون بها ولا يرضون بالوقوف بعرفة ، لأن عرفة من الحل كما سيأتي ، ولهذا لم يذكر الله تعالى المزدلفة في الإفاضة الثانية باسمها وقال : { مِنْ حيثُ أَفَاضَ الناسُ } لأن المزدلفة هو المكان الذي يفيض منه الناس بعد إفاضة عرفات ، فذلك حوالة على ما يعلمونه .و ( المشعر ) اسم مشتق من الشعور أي العِلْم ، أو من الشِّعَار أي العَلاَمة ، لأنه أقيمت فيه علامة كالمنار من عهد الجاهلية ، ولعلهم فعلوا ذلك لأنهم يدفعون من عرفات آخر المساء فيدركهم غبسُ ما بعد الغروب وهم جماعات كثيرة فخشوا أن يضلوا الطريق فيضيق عليهم الوقت .إوصف المشعر بوصف ( الحَرام ) لأنه من أرض الحرم بخلاف عرفات .والمشعر الحرام هو ( المزدلفة ) ، سميت مزدلفة لأنها ازدلفت من مِنَى أي اقتربت؛ لأنهم يبيتون بها قاصدين التصبيح في مِنى . ويقال للمزدلفة أيضاً ( جَمْع ) لأن جميع الحجيج يجتمعون في الوقوف بها ، الحُمْس وغيرُهم من عهد الجاهلية ، قال أبو ذؤيب :فبَاتَ بجَمْععٍ ثم راح إلى منًى ... فأصبح رَاداً يبتغي المَزْجَ بالسَّحْل ( )فمن قال : إن تسميتها جمعاً لأنها يُجْمع فيها بين المغرب والعشاء فقد غفل عن كونه اسماً من عهد ما قبل الإسلام .وتسمى المزدلفة أيضاً ( قُزَح ) بقاف مضمومة وزاي مفتوحة ممنوعاً من الصرف ، باسم قرن جبل بين جباللٍ من طَرَف مزدلفة ويقال له : المِيقَدَة لأن العرب في الجاهلية كانوا يُوقدون عليه النيران ، وهو موقف قريش في الجاهلية ، وموقفُ الإمام في المزدلفة على قُزح . روى أبو داود والترمذي أن النبي صلى الله عليه وسلم لما أصبح بجَمْع أتى قُزَحَ فوقف عليه وقال : هذا قُزَح وهو الموقف وجَمْعُ كلها موقف .ومذهب مالك أن المبيت سنة وأما النزول حصةً فواجب . وذهب علقمة وجماعة من التابعين والأوزاعي إلى أن الوقوف بمزدلفة ركن من الحج فمن فاته بطل حجه تمسكاً بظاهر الأمر في قوله { فاذكروا الله } .وقد كانت العرب في الجاهلية لا يفيضون من عرفة إلى المزدلفة حتى يجيزهم أحد ( بني صُوفَة ) وهم بنو الغوث بن مُر بن أدِّ بن طابخة بن إلياس بن مُضر وكانت أمهُ جرهمية ، لقب الغوث بصُوفَة؛ لأن أمه كانت لا تلد فنذرت إنْ هي ولدت ذكراً أن تجعله لخدمة الكعبة فولدت الغوث وكانوا يجعلون صوفةً يَربطون بها شعر رأس الصبي الذي ينذرونه لخِدمة الكعبة وتسمى الرَّبيِطَ ، فكان الغوْث يلي أمر الكعبة مع أخواله من جرهم فلما غلب قصَي بن كِلاب على الكعبة جعل الإجازة للغَوْث ثم بَقيت في بنيه حتى انقرضوا ، وقيل إن الذي جعل أبناء الغَوْث لإجازة الحَاجِّ هم ملوك كندة ، فكان الذي يجيز بهم من عرفة يقول :لاَ هُمَّ إِني تَابِع تباعَهْ ... إن كان إثْمٌ فعلَى قُضاعهْلأن قضاعة كانت تُحل الأشهر الحرم ، ولما انقرض أبناء صوفة صارت الإجازة لبني سعد بن زيد مناءة بن تميم ورثوها بالقُعدد فكانت في آل صَفْوان منهم وجاء الإسلام وهي بيد كَرب بن صفوان قال أوس بن مَغْراء :لاَ يَبْرَحُ الناسُ ما حَجُّوا مُعَرَّفَهُم ... حَتَّى يُقَالَ أجيزوا آل صفوانَاالواو عاطفة على قوله : { فاذكروا الله عند المشعر الحرام } والعطف يقتضي أن الذكر المأمور به هنا غير الذكر المأمور به في قوله : { فاذكروا الله عند المشعر الحرام } فيكون هذا أمراً بالذكر على العموم بعد الأمر بذكر خاص فهو في معنى التذييل بعد الأمر بالذكر الخاص في المشعر الحرام .ويجوز أن يكون المراد من هذه الجملة هو قوله : { كما هداكم } فموقعها موقع التذييل . وكان مقتضى الظاهر ألا تعطف بل تُفْصَل وعدل عن مقتضى الظاهر فعطفت بالواو باعتبار مغايرتها للجملة التي قبلها بما فيها من تعليل الذكر وبياننِ سببه وهي مغايَرةٌ ضعيفة لكنها تصحح العطف كما في قول الحارث بن همام الشيباني :أيا ابْنَ زَيَّابَةَ إِنْ تَلْقَني ... لا تلقني في النَّعَم العَازِبوتَلْقَني يشتَدُّ بي أَجْرَدٌ ... مُسْتَقْدِم البِرْكَة كالراكبفإن جملة تلقني الثانية هي بمنزلة بدَل الاشتمال من لا تلقني في النعم العازب لأن معناه لا تلقني راعيَ إبل وذلك النفي يقتضي كونه فارساً؛ إذ لا يخلو الرجل عن إحدى الحالتين فكان الظاهر فصل جملة تلقني تشتد بي أجرد لكنه وصلها لمغايرةٍ مَّا .وقوله : { كما هداكم } تشبيه للذكر بالهدى وما مصدرية . ومعنى التشبيه في مثل هذا المشابهةُ في التساوي أي اذكروه ذكراً مساوياً لهدايته إياكم فيفيد معنى المجازاة والمكافأَة فلذلك يقولون إن الكاف في مثله للتعليل وقد تقدم الفرق بينها وبين كاف المجازاة عند قوله تعالى : { فنتبرأ منهم كما تبرؤوا منا } \\[ البقرة : 167 \\] وكثر ذلك في الكاف التي اقترنت بها ( ما ) كيف كانت ، وقيل ذلك خاص بما الكافة والحق أنه وارد في الكاف المقترنة بما وفي غيرها .وضمير { من قبله } يرجع إلى الهدى المأخوذ من ما المصدرية و«إنْ» مخففة . من إنَّ الثقيلة . والمراد ضلالهم في الجاهلية بعبادة الأصنام وتغيير المناسك وغير ذلك .\n\n",
      "translations": [
        {
          "translation": "(It is no sin) there is no constraint (for you that ye seek the bounty of your Lord (by trading)) by engaging in trade in the Sacred Precinct. This was revealed about a group of people who were against buying and selling in the Sacred Precinct, and so legal dispensation was given to allow it. (But, when you press on in the multitude from 'Arafat) when you return from 'Arafat to the Sacred monument, (remember Allah) with your heart and tongue (by the Sacred monument. Remember Him as He hath guided you, although before) before Muhammad (pbuh) the Qur'an and Islam (ye were of the astray) among the unbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ } قالَ زيدُ بن علي عليهما السَّلامُ: فالفَضلُ ها هنا: التِجَارَةُ\n\n\n\n\nوقولهُ تعالى: { فَإِذَآ أَفَضْتُم مِّنْ عَرَفَٰتٍ } قالَ زيدُ بن علي عليهما السَّلامُ: الإِفاضةُ: الإِسرَاعُ فِي السَّيرِ، يُريدُ رَجَعتُمْ مِنْ حَيثُ جِئتُم\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of the Almighty: {There is no blame on you if you seek bounty from your Lord} Zaid ibn Ali, peace be upon him, said: \"So the bounty is here: trade.\"\n\nAnd His saying - the Most High: {So when you have completed your rites}, Zayd ibn `Ali - peace be upon him - said: \"The ifaḍah is haste in travel. He intends that you return from where you came.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ليس عليكم جناحٌ أن تَبْتغوا فضلاً من ربّكم } أي: لا حرج عليكم عند الرجوع إلى الكثرة في أن تطلبوا رفقاً لأنفسكم وتمتعوها بحظوظها على مقتضى الشرع بإذن الحق\n فإنّ حظها حينئذ يقويها على موافقة القلب في مقاصده ولأنها غير طاغية لتنوّرها بنور الحق { فإذا أفضتم } أي: دفعتم أنفسكم من مقام المعرفة التامة الذي هو نهاية مناسك الحج وأمّها كما قال النبي صلى الله عليه وسلم:\n \" الحجّ عرفة \" \n{ فاذكروا الله عند المشْعر الحرام } أي: شاهدوا جمال الله عند السرّ الروحيّ المسمّى بالخفيّ\n فإنّ الذكر في هذا المقام هو المشاهدة\n والمشْعر هو محل الشعور بالجمال المحرّم من أن يصل إليه الغير { واذكروه كما هَدَاكم } إلى ذكره في المراتب فإنه تعالى هدى أولاً إلى الذكر باللسان وهو ذكر النفس ثم إلى الذكر بالقلب وهو ذكر الأفعال الذي تصدر نعماء الله وآلاؤه منه\n ثم ذكر السرّ وهو معاينة الأفعال ومكاشفة علوم تجليات الصفات\n ثم ذكر الروح وهو مشاهدة أنوار تجليات الصفات مع ملاحظة نور الذات\n ثم ذكر الخفيّ وهو مشاهدة جمال الذات مع بقاء الإثنينية\n ثم ذكر الذات وهو الشهود الذاتي بارتفاع البقية { وإن كنتم من قَبْله } أي: من قبل الوصول إلى عرفات المعرفة والوقوف بها { لمن الضالِين } عن هذه الأذكار",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَيْسَ عَلَيْكُمْ } أيها المؤمنون { جُنَاحٌ } ضيق وتعب اتقائكم من سخط الله وتزويدكم بالتقوى { أَن تَبْتَغُواْ } أي: كل منكم { فَضْلاً } من المعارف اليقينية واللذات الروحانية { مِّن رَّبِّكُمْ } الذي رباكم بأنواع اللطف والكرم { فَإِذَآ أَفَضْتُم } أيها المؤمنون { مِّنْ عَرَفَٰتٍ } الذات المحيطة بجميع الصفات المرتبة لكم\n جمعها باعتبار وصول كل من الواصلين إليها بطريق مخصوص\n وإن كانت بعد الوصول واحدةً\n وحدةً حقيقيةً ذاتيةً لا كثرة فيها أصلاً { فَٱذْكُرُواْ ٱللَّهَ } المستجمع لذواتكم { عِندَ ٱلْمَشْعَرِ ٱلْحَرَامِ } أي: الصفات المحرمة ثبوتها لغير ذات الله\n أفرده لاختصاص كلٍ بصفة مخصوصة يربيه { وَٱذْكُرُوهُ كَمَا هَدَٰكُمْ } بتفويض الأمور كلها إليه\n واتقائكم نحوه من وساوس الشياطين المضلة { وَإِن كُنْتُمْ مِّن قَبْلِهِ } أي: قبل إهدائه { لَمِنَ ٱلضَّآلِّينَ } [البقرة: 198] التائهين في بيدات الضلالة\n الناكبين عن الهداية الحقيقية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ }  قلت: { أن تبتغوا }: على إسقاط حرف الجر\n أيْ: في أن تبتغوا\n وسبب نزول الآية: أن عُكاظاً ومَجَنّة وذا المجاز - أسماء مواضع - كانت أسواقاً في الجاهلية يعمرونها في مواسم الحج\n وكانت معايشهم منها\n فلما جاء الإسلام تأثَّمُوا وتحرجوا أن يتجروا فيها\n فقال لهم الحقّ جلّ جلاله: { ليس عليكم جناح } أي: إثم أو ميل عن الصواب\n في { أن تبتغوا فضلاً من ربكم } أي: عطاء ورزقاً تستفيدونه من التجارة في مواسم حجكم\n إذا خلَصَتْ نيتكم\n وغلب قصدُ الحج على التجارة\n وها هنا قاعدةٌ ذكرها الغزالي في الإحياء وحاصلها: أن العمل إذا تمحَّض لغير الله فهو سبب المقت والعقاب\n وإذا تمحض الله خالصاً فهو سبب القرب والثواب\n وإذا امتزج بشوْب من الرياء أو حظوظ النفس فينظر إلى الغالب وقوة الباعث فإن كان باعث الحظ أغلب\n سقط\n وكان إلى العقوبة أقرب\n لكن عقوبته أخف ممن تجرد لغير الله\n وإن كان باعث التقرب أغلب\n حُط منه بقدر ما فيه من باعث الحظ\n وإن تساوي تقاوماً وتساقطاً وصار العمل لا له ولا عليه\n ثم قال: ويشهد لهذا إجماعُ الأمة على أن مَنْ خرج حاجّاً ومعه تجارة صحَّ حجه وأُثيب عليه\n ثم قال: والصواب أنْ يقال: مهما كان الحج هو المحرّك الأصلي\n وكان غرضُ التجارة كالتابع\n فلا ينفك نفس السفر عن ثواب\n ثم طُرِّد هذا الاعتبار في الجهاد باعتبار الغنيمة\n يعني: يُنْظر لغالب الباعث وخُلوص القصد\n وكذلك الصوم للحِمْية والثواب\n ينظر لغالب الباعث\n قلت: وتطَّرد هذه القاعدة في المعاملات كلها\n وجميع الحركات والسكنات والحِرَف وسائر الأسباب\n فالخالص من الحظوظ مقبول\n والمتمحض للحظوظ مردود\n والمَشُوب يُنظر للغالب كما تقدم\n وقد ذكر شيه المشايخ سيدي أبو الحسن الشاذلي رضي الله عنه قاعدة أخرى أدقّ من هذه فقال: إذا أكرم الله عبداً في حركاته وسكناته\n نصَب له العبودية لله وستر عنه حظوظ نفسه\n وجعله يتقلّب في عبوديته\n والحظوظ عنه مستورة\n مع جَرْي ما قُدِّر له\n ولا يلتفت إليها لأنها في معزل عنه\n وإذا أهان الله عبداً في حركاته وسكناته\n نصب له حظوظ نفسه\n وستر عنه عبوديته\n فهو يتقلّب في شهواته\n وعبودية الله عنه بمعزلِ\n وإن كان يجري عليه شيء منها في الظاهر\n قال: وهذا باب من الولاية والإهانة\n وأما الصِّدِّيقية العظمى\n والولاية الكبرى\n فالحظوظ والحقوق كلها سواء عند ذوي البصيرة لأنه بالله فيما يأخذ ويترك\n هـ\n الإشارة: العبد لا يستغني عن طلب الزيادة\n ولو بلغ من الكمال غاية النهاية\n فالقناعة من الله حرمان\n واعتقاد بلوغ النهاية نقصان\n فليس عليكم جناح أيها العارفون أن تبتغوا فضلاً من ربكم زيادة في إيقانكم\n وترَقِّياً في معانيكم\n إذ كمالات الحق لا نهاية لها\n وأسرار الذات لا إحاطة بها\n قال تعالى:\n\n[طه: 110]\n والله وليّ التوفيق\n ثم ذكر الحقّ تعالى الوقوف بعرفة\n والرجوع إلى المزدلفة والمشعر الحرام\n فقال: {\n\n\nفَإِذَآ أَفَضْتُم مِّنْ عَرَفَاتٍ فَٱذْكُرُواْ ٱللَّهَ عِندَ ٱلْمَشْعَرِ ٱلْحَرَامِ وَٱذْكُرُوهُ كَمَا هَدَاكُمْ وَإِن كُنْتُمْ مِّن قَبْلِهِ لَمِنَ ٱلضَّآلِّينَ ثُمَّ أَفِيضُواْ مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ وَٱسْتَغْفِرُواْ ٱللَّهَ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ فَإِذَا قَضَيْتُمْ مَّنَاسِكَكُمْ فَٱذْكُرُواْ ٱللَّهَ كَذِكْرِكُمْ آبَآءَكُمْ أَوْ أَشَدَّ ذِكْراً\n\n\n }  قلت: { أفضتُم }: دفعتم\n وأصل الإفاضة: الدفع بقوة\n من فاض الماء إذا نبَع بقوة\n ثم استُعمل في مطلق الاندفاع على سبيل المبالغة\n و { عرفات } فيه الصرف وعدمه\n كأذرعات\n وسمى عرفات لقول إبراهيم الخليل عليه السلام لجبريل حين علَّمه المناسك: قد عرفتُ: أو لمعرفة آدم حواءَ فيها\n والكاف في { كما هداكم } تعليلية\n و { ما } مصدرية\n أي: واذكروه لأجل هدايته لكم\n و { إن كنتم } مخففة\n واللام فارقة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:14",
      "similarity": 0.5811826213272099
    },
    {
      "verse": "7:50",
      "similarity": 0.5747402329202096
    },
    {
      "verse": "2:199",
      "similarity": 0.5558492457242802
    },
    {
      "verse": "46:8",
      "similarity": 0.5163131154315276
    },
    {
      "verse": "5:83",
      "similarity": 0.29736668347816386
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002198.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002198.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:198.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}