{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ ادخلوا۟ فى السلم كافة ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين",
  "translations": [
    {
      "translation": "You who have iman! enter Islam totally. Do not follow in the footsteps of Shaytan. He is an outright enemy to you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, come to full submission to God. Do not follow in the footsteps of Satan your acknowledged foe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, enter completely into Islam and do not follow in\" the footsteps of Satan, for he is your avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, submit yourselves to the will of God as a whole. Do not follow the footsteps of Satan; he is your sworn enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Enter Islam in full – and do not follow the footsteps of the devil; indeed he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Enter Silm perfectly, and follow not the footsteps of Shaytan (Satan). Verily, he is to you a plain enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! enter into submission one and all and do not follow the footsteps of Shaitan; surely he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, enter the peace, all of you, and follow not the steps of Satan; he is a manifest foe to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Come, all of you, into submission (unto Him); and follow not the footsteps of the devil. Lo! he is an open enemy for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, surrender yourselves totally to God, and do not follow in the footsteps of Satan; surely, he is your sworn enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! enter into Islam wholly, and follow not the foot steps of the Satan, verily he is unto you an enemy manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Enter into submission, all together, and do not follow in Satan’s steps; he is indeed your manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Enter into Islam whole-heartedly; and follow not the footsteps of the evil one; for he is to you an avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Enter perfectly in Islam (by obeying all the rules and regulations of the Islamic religion) and follow not the footsteps of Shaitan (Satan). Verily! He is to you a plain enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, all of you, enter the peace and do not follow in satan's footsteps; he is a clear enemy to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Enter into submission, wholeheartedly, and do not follow the footsteps of Satan; he is to you an outright enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, enter into Islam completely [and perfectly] and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:208] The following verse was revealed regarding ‘Abd Allāh b. Salām and his companions, who after converting to Islam still observed the Sabbath with reverence and were averse to [the consumption of] camels: O you who believe, come, all of you, into submission (read al-salm or al-silm), that is, Islam; kāffatan is a circumstantial qualifier referring to al-silm, meaning, into all of its precepts; and follow not the steps, the ways, of Satan, that is, his temptations to you by way of creating divisions; he is a manifest foe to you, one whose enmity is obvious.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O ye who believe! Come, all of you, into submission) come all of you to the prescriptions of the Religion of Muhammad (pbuh); (and follow not the footsteps of the devil) follow not the embellishments of the devil regarding the unlawfulness of the Sabbath, the meat of camels and other things. (Lo! He is an open enemy for you) whose enmity is quite manifest.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱدْخُلُواْ فِي ٱلسِّلْمِ كَآفَّةً } قالَ زيدُ بن علي عليهما السلامُ: فالسِّلْمُ: الإِسلاَمُ\n وكافَةً: أي جميعاً\n والسَّلمُ فِي آيةٍ أخرى: الصلحُ\n قالَ:\n\n[الأنفال: 61] معناه للصلْحِ\n وجَنَحُوا: معناهُ مَالُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the words of the Most High: {Enter into Islam completely}, says Zayd ibn Ali, may peace be upon him: So Islam is complete submission.\n All\n\n\nAnd peace be upon another verse: Al-Salaam.\n\n\nHe said:\n\n\nThe meaning of this classical Arabic phrase is \"for the sake of peace.\"\n\n\nAnd they will be asked, \"What have you amassed?\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المعبرة عنها في الشرع بالشيطان { إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ } [البقرة: 208] ظاهر العداوة والإضلال يضلكم عما يهديكم الحق إليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { السلم } ، بالفتح والكسر: هو الاستسلام والانقياد، ويبعد هنا تفسيره بالصُّلْح، و { كافة }: حال من الواو والسلم معاً، كقوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:168",
      "similarity": 0.7936502731388579
    },
    {
      "verse": "24:21",
      "similarity": 0.6574253897322069
    },
    {
      "verse": "6:142",
      "similarity": 0.6451542429730149
    },
    {
      "verse": "34:28",
      "similarity": 0.2947211464568647
    },
    {
      "verse": "21:39",
      "similarity": 0.2711692083525661
    }
  ]
}