{
  "chapter": "البقرة",
  "text": "او۟لئك لهم نصيب مما كسبوا۟ والله سريع الحساب",
  "translations": [
    {
      "translation": "They will have a good share from what they have earned. Allah is swift at reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who will surely have their share of whatsoever they have earned; for God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people shall have their due share (in both the worlds) according to what they earn. And Allah is swift at settling accounts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have their share of the reward for their deeds. God's reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such is a portion from what they have earned; and Allah is Swift At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be alloted a share for what they have earned. And Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have (their) portion of what they have earned, and Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those -- they shall have a portion from what they have earned; and God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there is in store a goodly portion out of that which they have earned. Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have a good share from what they have earned. God is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These! for them will be a share for that which they have earned. and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such shall partake of what they have earned, and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To these will be allotted what they have earned; and Allah is quick in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be alloted a share for what they have earned. And Allah is Swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These shall have a share of what they have earned. Swift is the reckoning of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will have a share of what they have earned. God is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will have a share of what they have earned, and Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:202] Those — they shall have a portion, a reward, from, as a result of, what they have earned, the deeds they have performed, such as Pilgrimage and supplication; and God is swift at reckoning, reckoning with the whole of creation in half a day of this world, as one hadīth states.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { أولئك لهم نصيب مما كسبوا } إشارة إلى الفريق الثاني ، والنصيب : الحظ المعطى لأحد في خير أو شر قليلاً كان أو كثيراً ووزنه على صيغة فَعيل ، ولم أدر أصل اشتقاقه فلعلهم كانوا إذا عينوا الحظ لأحد ينصب له ويظهر ويشخص ، وهذا ظاهر كلام الزمخشري في «الأساس» والراغب في «مفردات القرآن» أو هو اسم جاء على هذه الصيغة ولم يقصد منه معنى فاعل ولا معنى مفعول ، وإطلاق النصيب على الشقص المشاع في قولهم نصيب الشفيع مجاز بالأول .واعلم أنه وقع في «لسان العرب» في مادة ( كفل ) أنه لا يقال هذا نصيب فلان حتى يكون قد أعِد لغيره فإذا كان مفرداً فلا يقال نصيب وهذا غريب لم أره لغيره سوى أن الفخر نقل مثله عن ابن المظفر عند قوله تعالى : { يكن له كفل منها } في \\[ سورة النساء : 85 \\] . ووقع في كلام الزجاج وابن عطية في تفسير قوله تعالى : { وجعلوا لله مما ذرأ من الحرب والأنعام نصيباً } \\[ الأنعام : 136 \\] قال الزجاج تقدير الكلام جعلوا لله نصيباً ولشركائهم نصيباً ، وقال ابن عطية قولهم جعل من كذا وكذا نصيباً يتضمن بقاء نصيب آخر ليس بداخل في حكم الأول اه .وهذا وعد من الله تعالى بإجابة دعاء المسلمين الداعين في تلك المواقف المباركة إلاّ أنه وعد بإجابة شيء مما دَعوا به بحسب ما تقتضيه أحوالهم وحكمة الله تعالى ، وبألا يجر إلى فساد عام لا يرضاه الله تعالى فلذلك نكر ( نصيب ) ليصدق بالقليل والكثير وأما إجابة الجميع إذا حصلت فهي أقوى وأحسن . وكسبوا بمعنى طلبوا ، لأن كسب بمعنى طلب ما يرغب فيه . ويجوز أن يراد بالكسب هنا العمل وبالنصيببِ نصيبُ الثواب فتكون ( من ) ابتدائية .واسم الإشارة مشير إلى الناس الذين يقولون : { ربنا آاتنا في الدنيا حسنة وفي الآخرة حسنة } للتنبيه باسم الإشارة على أن اتصافهم بما بعد اسم الإشارة شيء استحقوه بسبب الإخبار عنهم بما قبل اسم الإشارة ، أي إن الله استجاب لهم لأجل إيمانهم بالآخرة فيفهم منه أن دُعاء الكافرين في ضلال .وقوله : { والله سريع الحساب } تذييل قصد به تحقيق الوعد بحصول الإجابة ، وزيادة تبشير لأهل ذلك الموقف ، لأن إجابة الدعاء فيه سريعة الحصول ، فعلم أن الحساب هنا أطلق على مراعاة العمل والجزاء عليه .والحساب في الأصل العد ، ثم أطلق على عد الأشياء التي يراد الجزاء عليها أو قضاؤها ، فصار الحساب يطلق على الوفاء بالحق يقال حاسبه أي كافأه أو دفع إليه حقه ، ومنه سمي يوم القيامة يوم الحساب وقال تعالى : { إن حسابهم إلا على ربي } \\[ الشعراء : 113 \\] وقال { جزاء من ربك عطاء حساباً } \\[ النبأ : 36 \\] أي وفاقاً لأعمالهم ، وههنا أيضاً أريد به الوفاء بالوعد وإيصال الموعود به ، فاستفادة التبشير بسرعة حصول مطلوبهم بطريق العموم؛ لأن إجابتهم من جملة حساب الله تعالى عباده على ما وَعدهم فيدخل في ذلك العموم .والمعنى فإذا أتممتم أيها المسلمون مناسك حجكم فلا تنقطعوا عن أن تذكروا الله بتعظيمه وحمده ، وبالالتجاء إليه بالدعاء لتحصيل خير الدنيا وخير الآخرة ، ولا تشتغلوا بالتفاخر ، فإن ذكر الله خير من ذكركم آباءكم كما كنتم تذكرونهم بعد قضاء المناسك قبل الإسلام وكما يذكرهم المشركون الآن . ولا تكونوا كالذين لا يدعون إلاّ بطلب خير الدنيا ولا يتفكرون في الحياة الآخرة ، لأنهم ينكرون الحياة بعد الموت فإنكم إن سألتموه أعطاكم نصيباً مما سألتم في الدنيا وفي الآخرة إن الله يعجل باستجابة دعائكم .\n\n",
      "translations": [
        {
          "translation": "(For these) who are thus (there is in store a goodly portion) a great portion in Paradise (out of that which they have earned) from their pilgrimage. (Allah is swift in reckoning) Allah says: when He takes people to task, His reckoning is swift; it is also said that this means: swift in His protection. It is said that this means: His punishment is severe towards those who show off in their devotional works. 34\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } الموفون الموحدون الجامعون بين مرتبتي الظاهر والباطن { لَهُمْ نَصِيبٌ } حظ كامل { مِّمَّا كَسَبُواْ } في الدنيا التي هي مزرعة الآخرة من المعارف اللدنية والكشوف الإلهية { وَٱللَّهُ } المحيط وبضمائرهم { سَرِيعُ ٱلْحِسَابِ } [البقرة: 202] يحاسبهم ويجازيهم على ما كسبوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك } الذين طلبوا خيرَ الدارَيْن { لهم نصيب } وحظٍّ من الجزاء الوافر من أجلْ ما كسبوا من الأعمال الصالحات\n { والله سريع الحساب } يحاسب عباده على كثرتهم\n وكثرة أعمالهم\n في مقدار لَمْحة\n قيل لعليّ رضي الله عنه: كيف يُحاسب اللّهُ عباده في ساعة واحدة؟ فقال: كما يرزقهم في ساعة واحدة\n هـ\n أو يوشك أن يقيم القيامة ويحاسب عباده\n فبادِرُوا إلى إغتنام الطاعات\n واكتساب الحسنات\n قبل هجوم الممات\n الإشارة: الناس ثلاثة: صاحب همة دَنِيَّة\n وذو همة متوسطة\n وصاحب همة عالية\n أما صاحب الهمة الدنية فهو الذي أنزل همته على الدنيا الدنية\n وأكبَّ على جمع حطامها الفانية\n فقلبُ هذا خالٍ من حب الحبيب\n فما له في الآخرة من نصيب\n وأما صاحب الهمة المتوسطة فهو الذي طلب سلامة الدارين\n وصلاح الحالين\n قد اشتغل في هذه الدار بما ينفعه في دار القرار\n ولم ينسَ نصيبه من الدنيا لِيقْضِي ما له فيها من الأوطار\n فهذا له في الدنيا حسنة\n وهي الكفاية والغنى\n وفي الآخرة حسنة\n وهي النعمة والسرور والهنا\n\nوأما صاحب الهمة العالية فهو الذي رفع همته عن الكونَيْن\n وأغمض طَرْفَه عن الالتفات إلى الدارين\n بل علَّق همته بمولاه\n ولم يقنع بشيء سواه\n قد ولّى عن هذه الدار مُغضياً\n وأعرض عنها مُولياً\n ولم يشغله عن الله شيء\n يقول بلسان المقال إظهاراً لعبودية للكبير المتعال: { ربنا آتنا في الدنيا حسنة } وهي النظرة والشهود\n ورضا الملك الودود\n { وفي الآخرة حسنة } وهي اللحوق بأهل الرفيق الأعلى\n من المقربين والأنبياء\n في حضرة الشهود المؤبد { في مقعد صدق عند مليك مقتدر }\n أتحفَنَا الله من ذلك بحظٍّ وافر\n بمنِّه وكرمه\n نحن وأحباءَنا أجمعين\n آمين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:51",
      "similarity": 0.7323810497011931
    },
    {
      "verse": "40:17",
      "similarity": 0.704658448705143
    },
    {
      "verse": "23:61",
      "similarity": 0.4822759149977481
    },
    {
      "verse": "6:62",
      "similarity": 0.4787690430087522
    },
    {
      "verse": "3:19",
      "similarity": 0.47438049606609545
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002202.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002202.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:202.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}