{
  "chapter": "البقرة",
  "text": "واذا تولى سعى فى الارض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد",
  "translations": [
    {
      "translation": "When he leaves you, he goes about the earth corrupting it, destroying crops and animals. Allah does not love corruption.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For when his back is turned he goes about spreading disorder in the land, destroying fields and flocks; but God does not love disorder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he gets power he directs all his efforts towards spreading mischief in the land, destroying harvests and killing the human race whereas Allah (Whom he makes his witness) does not like mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As soon as they leave you, they quickly commit evil in the land, destroying the farms and people. God does not love evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns away, he creates turmoil in the earth and destroys crops and lives; and Allah is not pleased with turmoil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns away (from you O Muhammad), his effort in the land is to make mischief therein and to destroy the crops and the cattle, and Allah likes not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns back, he runs along in the land that he may cause mischief in it and destroy the tilth and the stock, and Allah does not love mischief-making.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when he turns his back, he hastens about the earth, to do corruption there and to destroy the tillage and the stock; and God loves not corruption;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turneth away (from thee) his effort in the land is to make mischief therein and to destroy the crops and the cattle; and Allah loveth not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he turns away, he sets out to spread corruption in the land, destroying crops and cattle. God does not love corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turnoth away, he speedeth through the land that He may act corruptly therein and destroy the tilth and the stock. And Allah approveth not corruptness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he were to wield authority, he would try to cause corruption in the land and to ruin the crop and the stock, and Allah does not like corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he turns his back, His aim everywhere is to spread mischief through the earth and destroy crops and cattle. But Allah loveth not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns away (from you \"O Muhammad SAW \"), his effort in the land is to make mischief therein and to destroy the crops and the cattle, and Allah likes not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No sooner does he leave than he hastens about the earth to corrupt there and destroy crops and cattle. Allah does not love corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he gains power, he strives to spread corruption on earth, destroying properties and lives. God does not like corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he goes away, he strives throughout the land to cause corruption therein and destroy crops and animals. And Allah does not like corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:205] And when he turns his back, leaving you behind, he hastens, he walks, about the earth to do corruption there and to destroy the tillage and the stock (these [last two actions] are included in such ‘corruption’); and God loves not corruption, that is to say, it does not please Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله تعالى : { وإذا تولى سعى في الأرض } إذا ظرف تضمن معنى الشرط .و { تولى } إما مشتق من التولية وهي الإدبار والانصراف يقال ولى وتولى وقد تقدم قوله تعالى : { ما ولاهم عن قبلتهم } \\[ البقرة : 142 \\] أي وإذا فارقك سعى في الأرض ليفسد .ومتعلق { تولى } محذوف تقديره تولى عنك ، والخطاب المقدر يجري على الوجهين المتقدمين وإما مشتق من الوَلاية : يقال وَلِيَ البلد وتولاه ، أي وإذا صار والياً أي إذا تزعم ورأس الناس سعى في الأرض بالفساد ، وقد كان الأخنس زعيم مواليه وهم بنو زهرة .وقوله : { سعى في الأرض ليفسد فيها } السعي حقيقته المشي الحثيث قال تعالى : { وجاء رجل من أقصا المدينة يسعى } \\[ القصص : 20 \\] ويطلق السعي على العمل والكسب ، قال تعالى : { ومن أراد الآخرة وسعى لها سعيها } \\[ الإسراء : 19 \\] وقال امرؤ القيس: ... فلو أن ما أسعى لأدنى معيشةالبيتين ويطلق على التوسط بين الناس لإصلاح ذات البين أو لتخفيف الإضرار قال عمرو بن كلثوم: ... ومِنَّا قَبْلَه السَّاعِي كُلَيْبٌفأيُّ الفضل إلاّ قَدْ ولِينَا ... وقال لبيد: ... وهم السُّعاة إذا العشيرة أفظعتالبيت . ويطلق على الحرص وبذل العزم لتحصيل شيء كما قال تعالى في شأن فرعون { ثم أدبر يسعى } \\[ النازعات : 22 \\] فيجوز أن يكون هنا بالمعنيين الأول والرابع أي ذهب يسير في الأرض غازياً ومغيراً ليفسد فيها . فيكون إشارة إلى ما فعله الأخنس بزرع بعض المسلمين ، لأن ذلك مؤذن بكفره وكذبه في مودة النبي صلى الله عليه وسلم إذ لو كان وده صادقاً لما آذى أتباعه . أو إلى ما صنعه بزرع ثقيف على قول من قال من المفسرين إن الأخنس بيت ثقيفا وكانت بينه وبينهم عداوة وهم قومه فأغار عليهم بمن معه من بني زهرة فأحرق زروعهم وقتل مواشيهم . لأنَّ صنيعه هذا بقوم وإن كانوا يومئذٍ كفاراً لا يهم المسلمين ضُرهم ، ولأنه لم يفعله انتصاراً للإسلام ولم يكن في حالة حرب معهم فكان فعله ينم عن خبث طوية لا تتطابق مع ما يظهره من الخير ولين القول؛ إذ من شأن أخلاق المرء أن تتماثل وتتظاهر فالله لا يرضى بإضرار عبيده ولو كفاراً ضراً لا يجر إلى نفعهم؛ لأنهم لم يغزهم حملاً لهم على الإيمان بل إفساداً وإتلافاً ولذلك قال تعالى : { والله لا يحب الفساد } .وقوله : { في الأرض } تأكيد لمدلول { سعى } لرفع توهم المجاز من أن يراد بالسعي العمل والاكتساب فأريد التنصيص على أن هذا السعي هو السير في الأرض للفساد وهو الغارة والتلصص لغير إعلاء كلمة الله ، ولذلك قال بعده { ليفسد فيها } فاللام للتعليل ، لأن الإفساد مقصود لهذا الساعي .ويجوز أن يكون { سعى } مجازاً في الإرادة والتدبير أي دبر الكيد لأن ابتكار الفساد وإعمالَ الحيلة لتحصيله مع إظهار النصح بالقَول كَيْدٌ ويكون ليفسد مفعولاً به لفعل { سعى } والتقدير أراد الفساد في الأرض ودبَّره ، وتكون اللام لام التبليغ كما تقدم في قوله تعالى :{ يريد الله بكم اليسر إلى قوله ولتكملوا العدة } \\[ البقرة : 185 \\] فاللام شبيه بالزائد وما بعد اللام من الفعل المقدَّرَةِ معه ( أَنْ ) مفعول به كما في قوله تعالى : { يريدون أن يطفئوا نور الله بأفواههم } \\[ التوبة : 32 \\] وقول جَزْءِ بننِ كُلَيْببٍ الفَقْعسي: ... تبغَّى ابن كوز والسفاهة كاسمهاليستادَ منّا أَنْ شَتَوْنَا لَيَالِيَا ... إذ التقدير تبغَّى الاستيادَ منا ، قال المرزوقي : أتى بالفعل واللام لأنّ تبغى مثل أراد فكما قال الله عز وجل : { يريدون أن يطفئوا نور الله بأفوههم } \\[ التوبة : 32 \\] والمعنى يريدون إطفاء نور الله كذلك قال تبغى ليستاد أي تبغى الاستياد منا اه .وأقول : إن هذا الاستعمال يتأتى في كل موضع يقع فيه مفعول الفعل علةً للفعل مع كونه مفعولاً به ، فالبليغ يأتي به مقترناً بلام العلة اعتماداً على أن كونه مفعولاً به يعلم من تقدير ( أَن ) المصدرية .ويكون قوله : { في الأرض } متعلقاً بسعى لإفادة أن سعيه في أمر من أمور أهل أرضكم ، وبذلك تكون إعادة { فيها } من قوله : { ليفسد فيها } بياناً لإجمال قوله : { في الأرض } مع إفادة التأكيد .وقوله : { ويهلك الحرث والنسل } بضم الياء أي يتلفه .والحرث هنا مراد منه الزرع ، والنسل أطفال الحيوان مشتق من نسل الصوف نسولاً إذا سقط وانفصل ، وعندي أن إهلاك الحرث والنسل كناية عن اختلال ما به قوام أحوال الناس ، وكانوا أهل حرث وماشية فليس المراد خصوص هذين بل المراد ضياع ما به قوام الناس ، وهذا جار مجرى المثل ، وقيل الحرث والنسل هنا إشارة إلى ما صنع الأخنس بن شريق ، وأياً ما كان فالآية دالة على أن من ينتسب في مثل ذلك صريحاً أو كناية مستحق للعقاب في الآخرة ولذلك عقب بجملة التذييل وهي { والله لا يحب الفساد } تحذيراً وتوبيخاً .ومعنى نفي المحبة نفي الرضا بالفساد ، وإلاّ فالمحبة وهي انفعال النفس وتوجه طبيعي يحصل نحو استحسان ناشىء مستحيلة على الله تعالى فلا يصح نفيها فالمراد لازمها وهو الرضا عندنا وعند المعتزلة : الإرادة والمسألة مبنية على مسألة خلق الأفعال . ولا شك أن القدير إذا لم يرض بشيء يعاقب فاعله ، إذ لا يعوقه عن ذلك عائق وقد سمى الله ذلك فساداً وإن كان الزرع والحرث للمشركين : لأن إتلاف خيرات الأرض رزء على الناس كلهم وإنما يكون القتال بإتلاف الأشياء التي هي آلات الإتلاف وأسباب الاعتداء .والفساد ضد الصلاح ، ومعنى الفساد : إتلاف ما هو نافع للناس نفعاً محضاً أو راجحاً ، فإتلاف الألبان مثلاً إتلاف نفع محض ، وإتلاف الحطب بعلة الخوف من الاحتراق إتلاف نفع راجح والمراد بالرجحان رجحان استعماله عند الناسي لا رجحان كمية النفع على كمية الضر ، فإتلاف الأدوية السامة فساد ، وإن كان التداوي بها نادراً لكن الإهلاك بها كالمعدوم لما في عقول الناس من الوازع عن الإهلاك بها فيتفادى عن ضرها بالاحتياط رواجها وبأمانة من تسلم إليه ، وأما إتلاف المنافع المرجوحة فليس من الفساد كإتلاف الخمور بَلْه إتلاف ما لا نفع فيه بالمرة كإتلاف الحيَّات والعقارب والفيران والكِلاب الكَلِبَةِ ، وإنما كان الفساد غير محبوب عند الله لأن في الفساد بالتفسير الذي ذكرناه تعطيلاً لما خلقه الله في هذا العالم لحكمة صلاح الناس فإن الحكيم لا يحب تعطيل ما تقتضيه الحكمة ، فقتال العدوِّ إتلاف للضر الراجح ولذلك يقتصر في القتال على ما يحصل به إتلاف الضر بدون زيادة ، ومن أجل ذلك نهي عن إحراق الديار في الحرب وعن قطع الأشجار إلاّ إذا رجح في نظر أمير الجيش أن بقاء شيء من ذلك يزيد قوة العدو ويطيل مدة القتال ويخاف منه على جيش المسلمين أن ينقلب إلى هزيمة وذلك يرجع إلى قاعدة : الضرورةُ تقدر بقدرها .\n\n",
      "translations": [
        {
          "translation": "(And when he turneth away (from thee)) when he is angry (his effort in the land is to make mischief therein) by committing transgressions (and to destroy the crops) and stacks of grain by burning them (and the cattle) by killing them; (and Allah loveth not mischief) or those who commit it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلْحَرْثَ وَٱلنَّسْلَ } فالحَرثُ: الزرعُ، والنَّسْلُ: نَسْلُ كُلِ دَابَةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"al-harth wa al-nasl\" (the land and its offspring), the meaning of al-harth is planting, and al-nasl is the offspring of every creature.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا تَوَلَّىٰ } أدبر من عنده { سَعَىٰ فِي ٱلأَرْضِ } الموضوعة للإصلاح والتعمير { لِيُفْسِدَ فِيِهَا } بأنواع الفسادات { وَ } من جملة ذلك أنه { يُهْلِكَ ٱلْحَرْثَ وَٱلنَّسْلَ } بالظلم والفسوق والعصيان المتجاوز للحد مثل: الزنا وقطع الطريق والخروج على الولاة القائمين بحدود الله المقيمن بأحكامه\n كالمتمشيخة المبتدعة التي ظهرت في هذه الأمة بإفساد عقائد ضعفاء المسلمين بالشيخوصة\n وترغيبهم إلى البدع والأهواء الباطلة المؤدية إلى تحليل المحرمات الشرعية\n ورفع التكليفات الدينية والمعتدات اليقينة\n شتت الله شملهم وفرق جمعهم { وَٱللَّهُ } الهادي للعباد { لاَ يُحِبُّ ٱلفَسَادَ } [البقرة: 205]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا تولى } أي: أدبر وانصرف عنك\n { سعى في الأرض } أي: مشى فيها بنية الإفساد { ليفسد فيها ويهلك الحرث والنسل } كما فعل الأخنَسْ\n أو كما فعله أهل الظلم\n فيَحْبِسُ الله القَطْر\n فَيَهْلِكَ الحرثُ والنسل بشؤم معاصيهم\n { والله لا يحب الفساد } أي: لا يرتضيه\n فاحذروا غضبه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:51",
      "similarity": 0.44381977174472126
    },
    {
      "verse": "32:8",
      "similarity": 0.3861091487655586
    },
    {
      "verse": "56:63",
      "similarity": 0.33957559429049794
    },
    {
      "verse": "42:20",
      "similarity": 0.3051274468503583
    },
    {
      "verse": "2:223",
      "similarity": 0.2891396185804334
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002205.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002205.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:205.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}