{
  "chapter": "البقرة",
  "text": "يسـلونك عن الخمر والميسر قل فيهما اثم كبير ومنفع للناس واثمهما اكبر من نفعهما ويسـلونك ماذا ينفقون قل العفو كذلك يبين الله لكم الءايت لعلكم تتفكرون",
  "translations": [
    {
      "translation": "They will ask you about alcoholic drinks and gambling. Say, 'There is great wrong in both of them and also certain benefits for mankind. But the wrong in them is greater than the benefit.' They will ask you what they should give away. Say, 'Whatever is surplus to your needs.' In this way Allah makes the Signs clear to you, so that hopefully you will reflect",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you of (intoxicants,) wine and gambling. Tell them: \"There is great enervation though profit in them for men; but their enervation is greater than benefit. And they ask you what they should give. Tell them: \"The utmost you can spare.\" So does God reveal His signs: You may haply reflect\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about drinking and gambling. Say, \"There is great harm in both, though there is some benefit also for the people. But the harm of the sin thereof is far greater than their benefit. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), they ask you about wine and gambling. Tell them that there is great sin in them. Although they have benefits for men, the sin therein is far greater than the benefit. They ask you about what they should give for the cause of God. Tell them, \"Let it be what you can spare.\" This is how God explains for you His guidance so that perhaps you will think\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you the decree regarding wine (intoxicants) and gambling; say (O dear Prophet Mohammed – peace and blessings be upon him), “In both is great sin, and some worldly benefit for men – but their sin is greater than their benefit”; and they ask you what they should spend; say, “That which remains spare (surplus)”; this is how Allah explains His verses to you, so that you may think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad) concerning alcoholic drink and gambling. Say: \"In them is a great sin, and (some) benefits for men, but the sin of them is greater than their benefit.\" And they ask you what they ought to spend. Say: \"That which is (spare) beyond your needs.\" Thus Allah makes clear to you His Laws in order that you may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about intoxicants and games of chance. Say: In both of them there is a great sin and means of profit for men, and their sin is greater than their profit. And they ask you as to what they should spend. Say: What you can spare. Thus does Allah make clear to you the communications, that you may ponder,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning wine, and arrow-shuffling. Say: 'In both is heinous sin; and uses for men, but the sin in them is more heinous than the usefulness.' They will question thee concerning what they should expend. Say: 'The abundance.' So God makes clear His signs to you; haply you will reflect;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question thee about strong drink and games of chance. Say: In both is great sin, and (some) utility for men; but the sin of them is greater than their usefulness. And they ask thee what they ought to spend. Say: that which is superfluous. Thus Allah maketh plain to you (His) revelations, that haply ye may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you [Prophet] about intoxicants and gambling. Say, \"There is great sin in both, although they have some benefit for people: but their harm is greater than their benefit.\" They ask you what they should spend [in God's cause]. Say, \"Whatever is surplus to your needs.\" Thus God makes His commandments clear to you so that you may reflect\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee of wine, and gambling. Say thou: in both is a great sin, and some benefits for men, but the sin of them is for greater than their benefit. And they ask thee, how much they should expend. Say thou: the redundant portion. In this wise Allah expoundeth unto you His commandments that haply ye may ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning wine and gambling. Say, ‘There is a great sin in both of them, and some profits for the people, but their sinfulness outweighs their profit.’ And they ask you as to what they should spend. Say, ‘All that is surplus.’ Thus does Allah clarify His signs for you so that you may reflect\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning wine and gambling. Say: \"In them is great sin, and some profit, for men; but the sin is greater than the profit.\" They ask thee how much they are to spend; Say: \"What is beyond your needs.\" Thus doth Allah Make clear to you His Signs: In order that ye may consider-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad SAW) concerning alcoholic drink and gambling. Say: \"In them is a great sin, and (some) benefit for men, but the sin of them is greater than their benefit.\" And they ask you what they ought to spend. Say: \"That which is beyond your needs.\" Thus Allah makes clear to you His Laws in order that you may give thought.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about intoxicating drink and gambling. Say: 'There is great sin in both, although they have some benefit for people; but their sin is far greater than their benefit' They ask you what they should spend. Say: 'That which remains' So, Allah makes plain to you His verses, in order that you will reflect\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about intoxicants and gambling. Say, “There is gross sin in them, and some benefits for people, but their sinfulness outweighs their benefit.” And they ask you about what they should give: say, “The surplus.” Thus God explains the revelations to you, so that you may think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about wine and gambling. Say, \"In them is great sin and [yet, some] benefit for people. But their sin is greater than their benefit.\" And they ask you what they should spend. Say, \"The excess [beyond needs].\" Thus Allah makes clear to you the verses [of revelation] that you might give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:219] They ask you about wine, and divinatory arrows, gambling, and what the ruling is regarding them. Say, to them: ‘In both, that is, in the partaking of both, is great sin (a variant reading [for kabīr, ‘great’] has kathīr, ‘much’) because of the fighting, cursing and swearing that ensue from it; and profit for men, by way of delight and enjoyment in wine, and acquiring money effortlessly from gambling; but the sin in them, that is, the degenerate behaviour in which they result, is greater, graver, than the usefulness’. When this verse was revealed, some gave up drinking, while others persisted, until the verse of sūrat al-Mā’ida [Q. 5:90-91]   finally made it illicit. And they will ask you what, that is to say, how much, they should expend. Say, expend, ‘Comfortably’ (al-‘afwa [in the accusative] is also read in the nominative, al-‘afwu, implying a preceding huwa), that is, the surplus of your need, and do not expend what you need, ruining yourselves. So, just as He explained to you what has been mentioned, God makes clear His signs to you that you might reflect,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They question thee about strong drink and games of chance). This was revealed about 'Umar Ibn al- Khattab who prayed: \"0 Allah! Show us Your judgement regarding alcoholic drinks!\" So Allah said to Muhammad (pbuh): (Say) Muhammad! (in both is great sin) this is after they were declared unlawful, (and (some) utility for men) by means of their trading, i.e. before they were unlawful; (but the sin of them) after their being declared unlawful (is greater than their usefulness) before they were made unlawful; and then both were prohibited. (And they ask thee what they ought to spend). This was revealed about 'Amr Ibn al-Jamuh who asked the Prophet (pbuh): \"What should we spend from our wealth\". Allah told His Prophet: they ask you about what they should spend from their wealth. (Say: That which is superfluous) that which is in surplus to your sustenance requirements and of food for your dependents. But this was abrogated by 37 those verses on the poor-due. (Thus Allah maketh plain to you (the) revelations) the commands and prohibitions and the insignificance of this world, (that ye may reflect) that it is evanescent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولُه تعالى: { يَسْأَلُونَكَ عَنِ ٱلْخَمْرِ وَٱلْمَيْسِرِ } قالَ زيدُ بن علي عليهما السَّلامُ: فالمَيْسِرُ: القِمَارُ\n\n\n\n\nوقولهُ تعالى: { وَيَسْأَلُونَكَ مَاذَا يُنفِقُونَ قُلِ ٱلْعَفْوَ } قالَ زيدُ بن علي عليهما السَّلامُ: والعَفْوُ: فَضْلُ المَالِ، ما يَفضِلُ عَن الأَهلِ والعيالِ\n ولا تَجْهِدْ مَالكَ ثُمَّ تَحتاج أَنْ تَسْأَلَ النَّاسَ\n\n\n\n\nوقولهُ تعالى: { لَعَلَّكُمْ تَتَفَكَّرُونَ } قالَ زيدُ معناه لعلَّكم تَتَفكرونَ فِي الدّنيا فتَعرِفُون فَضلَ الآخرةِ على الدّنيا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They ask you about alcohol and gambling}, Zayd ibn `Ali, peace be upon him, said: \"So gambling is alcohol.\"\n\n\nAnd the saying of Allah, {And they ask you what they should spend. Say, \"Spend of [that which is] good.\"} Zayd ibn Ali said: \"And [the meaning of] 'good' is the surplus of wealth, that which is over and above what is needed for oneself and one's family.\"\n\nDo not overexert yourself for your possessions, then have to ask people [for help].\n\nAnd His saying, {So that you may reflect}, [Zayd] said its meaning, \"So that you may reflect upon the world and then you will come to know the superiority of the Hereafter over the world.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَسْأَلُونَكَ } يا أكمل الرسل { عَنِ } حرمة { ٱلْخَمْرِ وَٱلْمَيْسِرِ } أهما من المحرمات الإلهية أم لا؟ { قُلْ فِيهِمَآ إِثْمٌ كَبِيرٌ } أمَّا في الخمر\n فلكونه معطلاً مزيلاً للعقل الجزئي المودع في الإنسان\n ليتوصل به إلى العقل الكل المتفرع إلى اسم العليم\n الشامل لجميع ما كان ويكون\n وهو اللوح المحفوظ والكتاب المبين وأمَّا في الميسر فلكونه متلفاً للمال الذي هو سبب تعمير البدن\n الذي هو مخزن جوهر العقل المذكور الذي اختص به الإنسان\n وبه استحق مرتبة الخلافة والنيابة\n\n\n{ وَ } فيهما { مَنَٰفِعُ لِلنَّاسِ } أي: لبعضهم من المرض الذي لا يمكنهم العلاج بدون إزالة عقولهم\n والتداوي لهم منحصر في الخمر عند المتطببين\n ومن استغناء بعض السفلة من الناس واسترزاقهم بالميسر { وَ } لكن { إِثْمُهُمَآ } عند أولي النهي واليقين { أَكْبَرُ مِن نَّفْعِهِمَا } عندهم\n بل لا نفع فيهما بالنسبة إليهم\n إذ لا يبقى لهم رابطة مع أبدانهم ليصلحوا ويصححوا { وَيَسْأَلُونَكَ } أيضاً يا أكمل الرسل: { مَاذَا يُنفِقُونَ } من أي شيء ينفقون\n على أي وجه ينفقون؟ { قُلِ } يا أكمل الرسل نيابة عنا: أنفقوا { ٱلْعَفْوَ } الفاضل من أموالكم\n لئلا يتضرروا بالجهد\n وليسهل عليكم التجاوز عنه\n لا يشق عليكم إنفاقه { كَذٰلِكَ } أي: على الوجه الأحسن الأسهل { يُبيِّنُ ٱللَّهُ لَكُمُ } جميع { ٱلأيَٰتِ } المنزلة عليكم إصلاح حالكم { لَعَلَّكُمْ تَتَفَكَّرُونَ } [البقرة: 219] رجاء أن تتأملوا:\n\n{ فِي } الآيات المتعلقة لأمور { ٱلدُّنْيَا } فتتصفوا بما فيها { وَ } أيضاً تأملوا في الآيات المتعلقة لأمور { ٱلآخِرَةِ } فتحققوا بها\n وتمكنوا عليها واطمأنوا بسببها\n ليتم لكم تهذيب الظاهر والباطن",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يَسْأَلُونَكَ عَنِ ٱلْخَمْرِ وَٱلْمَيْسِرِ قُلْ فِيهِمَآ إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَآ أَكْبَرُ مِن نَّفْعِهِمَا\n\n\n }  قلت: الخمر في اللغة: ما يستر الشيء ويغطيه\n ومنه: خمار المرأة\n وسُمِّي الخمر خمراً لستره العقلَ\n وفي الاصطلاح: ما غَيّب العقل دون الحواس مع النَّشْوة والطرَب\n وقال رسول الله صلى الله عليه وسلم:\n \" كُلُّ مُسْكرٍ خَمْرٍ وكُلُّ خَمْر\n حَرَامٌ \"\n \nوالميسر: قال ابن عباس والحسن: كل قمار ميسر\n من شطرنج ونرْد ونحوه\n حتى لَعِب الصبيان بالجَوْز والكِعَاب\n إذا كان بالفُلوس\n وسمي ميسراً ليُسْر صاحبه بالمال الذي يأخذه\n وأما إذا كان بغير عِوض\n إنما هو لَعِبٍّ فقط\n فلا بأس\n قاله ابن عرفة\n يقول الحقّ جلّ جلاله: { يسألونك عن } حكم { الخمر والميسر قل } لهم: { فيهما إثم كبير } أي: عظيم لما في المسير من أكل أموال الناس بالباطل\n وما ينشأ عنه من العداوة والشحناء\n وما في الخمر من إذهاب العقل والسباب والافتراء والإذاية\n والتعدّي الذي يكون من شاربه\n وقرأ حمزة والكسائي: { كثير } بالمثلثة\n أي: آثام كثيرة لقوله عليه الصلاة والسلام:\n \" لَعَنَ اللّهُ الخَمْرَ\n وَبَائِعِهَا\n وَمُبْتَاعَهَا\n والمُشتَرَاة لَهُ\n وعَاصَرَهَا\n والمَعْصُورَةَ لَه\n وسَاقِيها\n وشَاربهَا\n وحَامِلهَا\n والْمْحمُولة لَهُ\n وآكل ثَمِنِها \" \nفهذه آثام\n وفيها { منافعٍ للناس } أي: منافع دنيوية ككسب المال بلا تعب\n وإطعام الفقراء من كسبه\n كما كانت تصنع العرب في الميسر\n وفي الخمر اللذة والنشوة\n كما قال حسان رضي الله عنه:\n{ وإثمهما أكثر من نفعهما } لأن منفعتهما دنيوية\n وعقوبة إثمهما أُخروية\n وهذه الآية نزلت قبل التحريم\n رُويَ أنه لما نزل بمكة قوله تعالى:\n[النّحل: 67]\n أخذ المسلمون يشربونها\n ثم إن عمرَ ومعاذاً في نفر من الصحابة\n قالوا: أفْتنا يا رسول الله في الخمر فإنها مُذهبة للعقل\n فنزلت هذه الآية\n فشربها قوم وتركها آخرون\n ثم دعا عبدُ الرحمن بن عوف ناساً إلى داره\n فشربوا وسكروا\n ثم قام يصلي بهم فقرأ:\n[الكافِرون: 1\n 2] من غير نفي\n فنزلت:\n[النِّساء: 43] فاجتنبُوها في أوقات الصلاة\n ثم دعا عتبانُ بنُ مالك سعدَ بن أبي وقاص في جماعة\n فلما سكروا افتخروا وتناشدوا\n فأنشد سعدُ شعراً فيه هجاء الأنصار\n فضربه أنصاري بلحى بعير فشجَّه\n فشكى إلى رسول الله صلى الله عليه وسلم\n فقال عمر: اللهم بيِّن لنا في الخمر بياناً شافياً\n فنزلت\nإلى قوله:\n[المَائدة: 90\n 91] فقال عمر: انتهينا يا رب هـ\n ولما شربها بعض الناس بعد التحريم\n كان - عليه الصلاة والسلام - يضرب فيها بالنعال والجريد\n ضرباً غير محدود\n وضرب أبو بكر وعمر أربعين\n وأول من حد فيها ثمانين سيدنا عثمان\n لما تهافت الناس فيها\n\nوالله تعالى أعلم\n الإشارة: اعلم أن الحق تعالى جعل للعقل نوراً يُميز بين الحق والباطل\n بين الضار والنافع\n وبين الصانع والمصنوع\n ثم إن هذا النور قد يتغطى بالظلمة الطينية وهي نشوة الخمر الحسية\n وقد يتغطى أيضاً بالأنوار الباهرة من الحضرة الأزلية إذا فاجأته\n فيغيب عن الإحساس في مشاهدة الأنوار المعنوية\n وهي أسرار الذات الأزلية\n فلا يرى إلا أسرار المعاني القديمة\n وينكر الحوادث الحسية\n فسمي الصوفية هذه الغيبة خمرة لمشاركتها للخمر في غيبوبة العقل\n وتغنوا بها في أشعارهم ومواجيدهم\n قال الفارض رضي الله عنه:\nثم قال:\nوقلت في عينيتي:\nوالميسر في طريق الإشارة: هو الغني الذي يحصل بهذه الخمرة\n وهو الغني بالله عن كل ما سواه قل فيهما إثم كبير أي: في تعاطيهما حرج كبير\n ومنافع للناس بعد تعاطيهما\n فيهما إثم كبير عند طالب الأجور\n ومنافع للناس لمن طلب الحضور ورفع الستور\n وأنشدوا:\nوقال ابن الفارض:\nوقال آخر:\nفيهما إثم كبير عند أهل الحجاب\n ونفع كبير عند ذوي الألباب\n يعني: في الخمرة الأزلية والغنى بالله\n وقوله تعالى: { وإثمهما أكبر من نفعهما }: خطاب على قدر ما يفهم الناس\n لأن إثمهما ظاهر للعوام\n وهو ما يظهر على النشوان من خراب الظاهر\n وصدور الأحوال الغريبة\n ونفعهما خاص عند خوصا الخواص\n لا يفهمه إلا الخواص\n بل يجب كتمه عن غير أهله\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n ثم وقع سؤال ثالث عن قدر المنفق\n فأشار إليه الحقّ جلّ جلاله بقوله: {\n\n\n وَيَسْأَلُونَكَ مَاذَا يُنفِقُونَ قُلِ ٱلْعَفْوَ كَذٰلِكَ يُبيِّنُ ٱللَّهُ لَكُمُ ٱلآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ فِي ٱلدُّنْيَا وَٱلآخِرَةِ\n\n\n }  قلت: { العفو }: ضد الجهد\n وهو السهل\n ويقال للأرض السهلة: عفو\n والمراد: أن يُنفق ما تيسر بذله\n ولا يبلغ به الجَهد\n وهو خبر\n أو مفعول\n أي: هو العفو\n أو ينفقون العفو\n\nيقول الحقّ جلّ جلاله: { ويسألونك } ما القدر الذي ينفقونه؟ { قل } لهم: هو { العفو } أي: السهل الذي لا مشقة في إعطائه\n ولا ضرر على المعطي في فقده\n رُوِي أن رجلاً أتى النبيّ صلى الله عليه وسلم بقدر بَيْضة من الذهب\n فقال: خُذها عني صَدقَة\n فأعرض عنه\n حتى كَرَّر مِرَاراً\n فقال: هاتها\n مُغْضَبَا\n فحذفها حذفاً لو أصابه لشجَّه\n فقال:\n \" يأتي أحدكم بماله كله يتصدّق به\n ويجلس يتكفَّفُ الناس\n إنما الصدقةُ عن ظَهْرِ غِنَى \" \nقاله البيضاوي مختصراً\n قلت: وهذا يختلف باختلاف اليقين فقد تصدّق الصدِّيقُ رضي الله عنه بماله كله\n وعمر رضي الله عنه بنصف ماله\n فأقرهما ورَدّ فعلَ غيرهما\n فدلَّ ذلك على أن العفو يختلف باختلاف الأشخاص\n على حسب اليقين\n { كذلك يبن الله لكم الآيات } أي: مثل هذا التبيين الذي ذكرنا\n { يُبين } لكم الآيات\n حتى لا يترك إشكالاً ولا وهماً\n { لعلكم تتفكرون } بعقولكم\n وتأخذون بما يعود نفعه عليهكم\n فتتفكرون { في الدنيا } وسرعة ذهابها وتقلبها بأهلها\n إذا أقبلت كانت فتنة\n وإذا أدبرت كانت حسرة\n لا يفي طالبُها بمقصوده منها ولو ملكها بحذافيرها\n ضيقة الزمان والمكان\n عمارتها إلى الخراب\n وشأنها إلى انقلاب\n سريعة الزوال\n وشيكة الانتقال\n فتزهدون فيها وترفعون همتكم عنها\n وفي الحديث عنه صلى الله عليه وسلم:\n \" مَالِي وللدنيا\n إنما مَثَلي ومثلُ الدنيا كرجلٍ سَافَرَ في يوم صَائِفٍ\n فاسْتَظَلَّ تحت شَجَرةٍ\n ثم رَاحَ وَتَرَكَها \" \nوفي صحف إبراهيم عليه السلام: \" عجبت لمن أيقن بالموت كيف يفرح\n عجبت لمن أيقن بالنار كيف يضحك\n عجبت لمن أيقن بالقدر كيف ينصب - أي: يتعب - عجبت لمن رأى الدنيا وتقلبها بأهلها كيف يطمئن إليها \"\n وأنشدوا:\nوتتفكرون في { الآخرة } ودوام نعيمها\n وسعة فضائها\n وبهجة منظرها فترغبون في الوصول إليه\n وتتأهبون للقائها\n فتؤثرونها على هذه الدار الفانية\n قال بعض الحكماء: لو كانت الدنيا من ذهب يفنى\n والآخرة من طين يبقى\n لكان ينبغي للعاقل أن يختار ما يبقى على ما يفنى\n لا سيما والأمر بالعكس\n الدنيا من طين يفنى\n والآخرة من ذهب يبقى\n فلا يختار هذه الدار إلاَّ أحمق خسيس الهمة\n وبالله التوفيق\n الإشارة: كما نهى الحقّ جلّ جلاله عن السرف في الأموال\n نهى عن السرف في الأحوال\n فالسرف\n من حيث هو\n يؤدي إلى الملل والانقطاع\n \" أحبُ العملِ إلى اللّهِ ما دَامَ عليه صاحبُه\n وإنْ قَلَ \" كما في الحديث\n\n \" والله ما رأينا أحداً أسرف في الأحوال إلا مَلَّ\n وضعف حاله \" \n\n وفي الحديث:\n \" لاَ يكْن أحَدُكُم كالمُنْبَتِّ - أي: المنقطع - لا أرضاً قطع\n ولا ظَهْراً أبقى \" \n \nوقال في المباحث:\nفلا يزال يُسايس نفسه شيئاً فشيئاً حتى يملكها\n ويظفر بها\n فإذا ظفر بها كانت له شبكة يصطاد بها العلوم والمعارف\n فتتفكر في الدنيا فتراها فانية فترحل عنها\n ثم تتفكر في الآخرة فتراها باقية\n فإذا رامت السُّكْنَى فيها رأتْها كَوْناً مخلوقاً فرحلت إلى خالقها\n فكشف الحقّ عنها الحجاب\n وأدخلها مع الأحباب\n وأدخلها مع الأحباب\n فغابت عن الكونين في شهود المكون\n فلم يبق لها دنيا ولا آخرة\n بل هي الآن في بهجة ونضرة { إلى ربها ناظرة } \n حققنا الله بهذا المقام العلي\n آمين\n ثم سألوا أيضاً عن مخالطة اليتامى\n فأجابهم الحقّ تعالى بقوله: {\n\n\n وَيَسْأَلُونَكَ عَنِ ٱلْيَتَامَىٰ قُلْ إِصْلاَحٌ لَّهُمْ خَيْرٌ وَإِنْ تُخَالِطُوهُمْ فَإِخْوَانُكُمْ وَٱللَّهُ يَعْلَمُ ٱلْمُفْسِدَ مِنَ ٱلْمُصْلِحِ وَلَوْ شَآءَ ٱللَّهُ لأَعْنَتَكُمْ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ }  قلت: العنت: التعب والمشقة\n أعنتكم: أتعبكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:91",
      "similarity": 0.381196312085332
    },
    {
      "verse": "12:41",
      "similarity": 0.28279849597200646
    },
    {
      "verse": "5:90",
      "similarity": 0.27528579509055545
    },
    {
      "verse": "16:44",
      "similarity": 0.248296153916266
    },
    {
      "verse": "74:18",
      "similarity": 0.2452327252415255
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/2:219.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/2:219.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/2:219.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}