{
  "chapter": "البقرة",
  "text": "زين للذين كفروا۟ الحيوة الدنيا ويسخرون من الذين ءامنوا۟ والذين اتقوا۟ فوقهم يوم القيمة والله يرزق من يشاء بغير حساب",
  "translations": [
    {
      "translation": "To those who are kafir, the life of this world is painted in glowing colours and they laugh at those who have iman. But on the Day of Rising those who fear Allah will be over them. Allah provides for whomever He wills without any reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enamoured are the unbelievers of the life of this world, and scoff at the faithful. But those who keep from evil and follow the straight path will have a higher place than they on the Day of Reckoning; for God gives in measure without number whomsoever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This worldly life has been made very charming and alluring for those who have adopted the way of disbelief. So they mock at those who have adopted the way of belief, but (they forget that) the pious people will rank above them on the Day of Resurrection. As to the wordly provisions, Allah has full authority and power to bestow these without measure on anyone He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worldly life is made to seem attractive to the disbelievers who scoff at the faithful, but the pious, in the life hereafter, will have a position far above them. God grants sustenance (without account) to anyone He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is made to appear beautiful in the sight of the disbelievers, and they make fun of the believers; and the pious will be above them on the Day of Resurrection; and Allah may give to whomever He wills, without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of this world for those who disbelieve, and they mock at those who believe. But those who have Taqwa, will be above them on the Day of Resurrection. And Allah gives (of His bounty, blessings, favors, and honors on the Day of Resurrection) to whom He wills without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is made to seem fair to those who disbelieve, and they mock those who believe, and those who guard (against evil) shall be above them on the day of resurrection; and Allah gives means of subsistence to whom he pleases without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Decked out fair to the unbelievers is the present life, and they deride the believers; but those who were godfearing shall be above them on the Resurrection Day; and God provides whomsoever He will without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of the world for those who disbelieve; they make a jest of the believers. But those who keep their duty to Allah will be above them on the Day of Resurrection. Allah giveth without stint to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is made to appear attractive for those who deny the truth and they scoff at those who believe. But those who fear God shall be above them on the Day of Resurrection: God bestows His bounties on whoever He pleases without stinting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fair-seeming is made the life of the world unto those who disbelieve, and they scoff at those who believe, whereas those who fear God shall be above them on the Day of Resurrection. And Allah provideth whomsoever He listeth without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worldly life has been glamorized for the faithless, and they ridicule the faithful. But those who are Godwary shall be above them on the Day of Resurrection, and Allah provides for whomever He wishes without any reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is alluring to those who reject faith, and they scoff at those who believe. But the righteous will be above them on the Day of Resurrection; for Allah bestows His abundance without measure on whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of this world for those who disbelieve, and they mock at those who believe. But those who obey Allah's Orders and keep away from what He has forbidden, will be above them on the Day of Resurrection. And Allah gives (of His Bounty, Blessings, Favours, Honours, etc. on the Day of Resurrection) to whom He wills without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who disbelieve, the worldly life is decked with all manner of decorations. They scoff at those who believe, but the cautious shall be above them on the Day of Resurrection. Allah gives without count to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of this world for those who disbelieve, and they ridicule those who believe. But the righteous will be above them on the Day of Resurrection. God provides to whomever He wills without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified for those who disbelieve is the life of this world, and they ridicule those who believe. But those who fear Allah are above them on the Day of Resurrection. And Allah gives provision to whom He wills without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:212] Decked out fair to the disbelievers, of Mecca, is the life of this world, in disguise and they have fallen in love with it; and they deride the believers, on account of their poverty, the likes of Bilāl [al-Habashī], ‘Ammār [b. Yāsir], and Suhayb [al-Rūmī], mocking them and treating them condescendingly with their wealth; but those who fear, idolatry, namely, those mentioned, shall be above them on the Day of Resurrection; and God sustains whomever He will without reckoning, with ample sustenance in the Hereafter or in this world, when He gives to those that were mocked possession of the property and lives of those that mocked them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بالرجوع إلى أحوال كفار العرب المعنيين من الآيات السابقة قصداً وتعريضاً من قوله : { هل ينظرون إلاَّ أن يأتيهم الله في ظُلل من الغمام } \\[ البقرة : 210 \\] ، والمحتج عليهم بقوله : { سل بني إسرائيل } \\[ البقرة : 211 \\] استئنافاً لبيان خُلُقهم العجيب المفضي بهم إلى قلة الاكتراث بالإيمان وأهله إلى الاستمرار على الكفر وشُعبه التي سبق الحديث عنها ، فعن ابن عباس المراد : رؤساءُ قريش ، فهذا الاستئناف في معنى التعليل للأحوال الماضية ، ولأجل ذلك قطع عن الجمل السابقة لا سيما وقد حال بينه وبينها الاستطراد بقوله : { سل بني إسرائيل } \\[ البقرة : 211 \\] الآية ، وليس المراد بالذين كفروا أهل الكتاب مِن معلن ومنافق كما روي عن مقاتل ، لأنه ليس من اصطلاح القرآن التعبير عنهم بالذين كفروا ، ولأنهم لو كانوا هم المراد لقيل زين لهم الحياة الدنيا ، لأنهم من بني إسرائيل ، ولأن قوله : { ويسخرون من الذين آمنوا } يناسب حال المشركين لا حالَ أهل الكتاب كما سيأتي .والتزيين : جعل الشيء زْيناً أو الاحتجاج لكونه زيناً ، لأن التفعيل يأتي للجعل ويأتي للنسبة كالتعليم وكالتفسيق والتزكية ، والزَّيْن شدة الحسن .والحياة الدنيا مراد بها ما تشتمل عليه الحياة من اللَّذَّات والملائمات والذوات الحسنة ، وهذا إطلاق مشهور للحياة وما يُرَادِفُها؛ ففي الحديث : « مَن كانت هجرته إلى دنيا يصيبها » أي إلى منافع دُنيا ، وهو على حذف مضاف اشتهر حذفه .ومعنى تزيين الحياة لهم ، إما أن ما خُلق زيناً في الدنيا قد تمكّن من نفوسهم واشتد توغلهم في استحسانه ، لأن الأشياء الزَّيْنَة هي حسنة في أعين جميع الناس فلا يختص الذين كفروا بجعلها لهم زَيْنَة كما هو مقتضى قوله : { للذين كفروا } ؛ فإن اللام تشعر بالاختصاص ، وإما ترويج تزيينها في نفوسهم بدعوة شيطانية تحسِّن ما ليس بالحسن كالأقْيسة الشِّعرية والخواطر الشهوية .والمزيِّن على المعنى الأول هو الله تعالى إلاّ أنهم أَفرطوا في الإقبال على الزينة ، والمزيِّن على المعنى الثاني هو الشيطان ودعاته .وحُذِف فاعل التزيين لأن المزيِّن لهم أمورٌ كثيرة : منها خلْقُ بعض الأشياء حسنة بديعة كمحاسن الذوات والمناظر ، ومنها إلقاء حُسن بعض الأشياء في نفوسهم وهي غير حسنة كقتل النفس ، ومنها إعراضهم عمن يدعوهم إلى الإقبال على الأمور النافعة حتى انحصرت هممهم في التوغل من المحاسن الظاهرة التي تحتها العار لو كان بادياً ، ومنها ارتياضهم على الانكباب على اللذات دون الفكر في المصالح ، إلى غير ذلك من أمور يصلح كل منها أن يُعدَّ فاعلاً للتزيين حقيقة أو عرفاً ، فلأجل ذلك طوي ذكر هذا الفاعل تجنباً للإطالة .ويجوز أن يكون حذف الفاعل لدقته ، إذ المزيِّن لهم الدنيا أمر خفي فيُحتاج في تفصيله إلى شرح في أخلاقهم وهو ما اكتسبته نفوسهم من التعلق باللذات وبغيرها من كل ما حملهم على التعلق به التنافسُ أو التقليدُ حتى عَمُوا عما في ذلك من الأضرار المخالطة للذَّات أو من الأضرار المختصة المغَشَّاة بتحسين العادات الذميمة ، وحملهم على الدوام عليه ضعفُ العزائم الناشىء عن اعتياد الاسترسال في جلب الملائمات دون كبح لأزمة الشهوات ، ولأجل اختصاصهم بهذه الحالة دون المؤمنين ودون بعض أهل الكتاب الذين ربَّتْ الأديان فيهم عزيمة مقاومةِ دعوة النفوس الذميمة بتعريفهم ما تشتمل عليه تلك اللذات من المذمات وبأمرهم بالإقلاع عن كل ما فيه ضر عاجل أو آجل حتى يجردوها عنها إن أرادوا تناولها وينبذوا ما هو ذميمة محضة ، وراضتهم على ذلك بالبشائر والزواجر حتى صارت لهم ملكة ، فلذلك لم تزين الدنيا لهم ، لأن زينتها عندهم ومعرضة للحكم عليها بالإثبات تارة وبالنفي أخرى ، فإن من عرف ما في الأمر الزين ظاهرُه من الإضرار والقبائح انقلب زينه عنده شَينا ، خُص التزيين بهم ، إذ المراد من قوله : { زين للذين كفروا } ذمُّهم والتحذير من خلقهم ، ولهذا لزم حمل التزيين على تزييين يعد ذماً ، فلزم أن يكون المراد منه تزييناً مشوباً بما يجعل تلك الزينة مذمة ، وإلاّ فإن أصل تزيين الحياة الدنيا المقتضي للرغبة فيما هو زينُ أمرٍ ليس بمذموم إذا روعى فيه ما أوصى الله برعيه قال تعالى :{ قل من حرم زينة الله التي أخرج لعباده والطيبات من الرزق } \\[ الأعراف : 32 \\] .وقد استقريْتُ مواقع التزيين المذموم فحصرتها في ثلاثة أنواع : الأول ما ليس بزين أصلاً لا ذاتاً ولا صفة ، لأن جميعه ذم وأذى ولكنه زين للناس بأوهام وخواطر شيطانية وتخييلات شعرية كالخمر . الثاني ما هو زين حقيقة لكن له عواقب تجعله ضراً وأذى كالزنا . الثالث ما هو زين لكنه يحف به ما يصيره ذميماً كنجدة الظالم وقد حضر لي التمثيل لثلاثتها بقول طرفة :ولولا ثلاثٌ هُنَّ من عيشة الفتى ... وجَدِّك لم أَحْفَلْ متى قام عُوَّدِيفمنهن سَبْقي العاذِلاَت بشَربة ... كُمَيْتتٍ متى ما تُعْلَ بالماءِ تُزْبِدِوتقصيرُ يوم الدَّجْننِ والدَّجْنُ مُعْجِبٌ ... بَبْهكَنَةٍ تحتَ الخِبَاءِ المُعَمَّد2وكَرِّي إذا نادَى المضافُ مُجَنَّباً ... كَسِيدِ الغَضَا نَبَّهْتَه المُتَوَرِّدِوقوله : ويسخرون من الذين آمنوا عطف على جملة { زين للذين كفروا } إلخ ، وهذه حالة أعجب من التي قبلها وهي حالة التناهي في الغرور؛ إذ لم يقتصروا على افتتانهم بزهرة الحياة الدنيا حتى سخروا بمن لم ينسج على منوالهم من المؤمنين الذين تركوا كثيراً من زهرة الحياة الدنيا لما هداهم الدين إلى وجوب ترك ذلك في أحوال وأنواع تنطوي على خبائث .والسَخَر بفتحتين : كالفرح وقد تسكن الخاء تخفيفاً وفعله كفرح والسُّخرية الاسم ، وهو تعجب مشوب باحتقار الحال المتعجب منها ، وفعله قاصر لدلالته على وصف نفسي مثل عَجِب ، ويتعدى بمن جارَّة لصاحب الحال المتعجَّب منها فهي ابتدائية ابتداء معنوياً ، وفي لغة تعديته بالباء وهي ضعيفة .ووجه سخريتهم بالمؤمنين أنهم احتقروا رأيهم في إعراضهم عن اللذات لامتثال أمر الرسول وأفّنوهم في ذلك ورأوهم قد أضاعوا حظوظهم وراء أوهام باطلة ، لأن الكفار اعتقدوا أن ما مضى من حياتهم في غير نعمة قد ضاع عليهم إذ لا خلود في الدنيا ولا حياة بعدها كما قال الشاعر ( أنشده شمر ) :وأحمقُ ممن يَلْعَق الماء قال لي ... دع الخمر واشْرَب من نُقَاخٍ مبرَّدفالسخرية ناشئة عن تزيين الحياة عندهم ولذلك يصح جعل الواو للحال ليفيد تقييد حالة التزيين بحالة السخرية ، فتتلازم الحالان ويقدر للجملة مبتدأ ، أي وهم يسخرون ، وقد قيل إن من جملة من كان الكفار يسخرون منهم بلالاً وعماراً وُصهيباً يقولون : هؤلاء المساكين تركوا الدنيا وطيباتها وتحملوا المشاق لطلب ما يسمونه بالآخرة وهي شيء باطل ، وممن كان يسخر بهم عبدُ الله بن أُبَيَ والمنافقون .وجيء في فعل التزيين بصيغة الماضي وفي فعل السخرية بصيغة المضارع قضاءً لحقْي الدلالة على أن معنيين فعل التزيين أمر مستقر فيهم؛ لأن الماضي يدل على التحقق ، وأن معنى { يسخرون } متكرر متجدد منهم؛ لأن المضارع يفيد التجدد ويعلم السامع أن ما هو محقق بين الفعلين هو أيضاً مستمر؛ لأن الشيء الراسخ في النفس لا تفتر عن تكريره ، ويعلم أن ما كان مستمراً هو أيضاً محقق؛ لأن الفعل لا يستمر إلاّ وقد تمكن من نفس فاعله وسكنت إليه ، فيكون المعنى في الآية : زُيِّن للذين كفروا وتزين الحياة الدنيا وسخروا ويسخرون من الذين آمنوا ، وعلى هذا فإنما اختير لفعل التزيين خصوص المضي ولفعل السخرية خصوص المضارعة إيثاراً لكل من الصفتين بالفعل التي هي به أجدر؛ لأن التزيين لما كان هو الأسبق في الوجود وهو منشأ السخرية أوثر بما يدل على التحقق ، ليدل على ملكةٍ واعتمد في دلالته على الاستمرار بالاستتباع ، والسخرية لما كانت مترتبة على التزيين وكان تكررها يزيد في الذم ، إذ لا يليق بذي المروءة السخرية بغيره ، أوثرت بما يدل على الاستمرار واعتمد في دلالتها على التحقق دلالة الالتزام ، لأن الشيء المستمر لا يكون إلاّ متحققاً .وقوله : { والذين اتقوا فوقهم } أريد من الذين اتقوا المؤمنون الذين سخر منهم الذين كفروا؛ لأن أولئك المؤمنين كانوا متقين ، وكان مقتضى الظاهر أن يقال وهم فوقهم لكن عُدل عن الإضمار إلى اسم ظاهر لدفع إيهام أن يغتر الكافرون بأن الضمير عائد إليهم ويضموا إليه كذباً وتلفيقاً كما فعلوا حين سمعوا قوله تعالى : { أفرءيتم اللات والعزى } \\[ النجم : 19 \\] إذ سجد المشركون وزعموا أن محمداً أثنى على آلهتهم . فعدل لذلك عن الإضمار إلى الإظهار ولكنه لم يكن بالاسم الذي سبق أعني ( الذين ءَامنوا ) لقصد التنبيه على مزية التقوى وكونها سبباً عظيماً في هذه الفوقية ، على عادة القرآن في انتهاز فرص الهدى والإرشاد ليفيد فضل المؤمنين على الذين كفروا ، وينبه المؤمنين على وجوب التقوى لتكون سبب تفوقهم على الذين كفروا يوم القيامة ، وأما المؤمنون غير المتقين فليس من غرض القرآن أن يعبأ بذكر حالهم ليكونوا دَوماً بين شدة الخوف وقليل الرجاء ، وهذه عادة القرآن في مثل هذا المقام .والفوقية هنا فوقية تشريف وهي مجاز في تناهي الفضل والسيادة كما استعير التحت لحالة المفضول والمسخَّر والمملوك . وقيدت بيوم القيامة تنصيصاً على دوامها ، لأن ذلك اليوم هو مبدأ الحياة الأبدية .فإن قلت : كيفما كان حظ المؤمنين من كثرة التقوى وقلتها إنهم فوق الذين كفروا يوم القيامة بالإيمان والمقام مقام التنويه بفضل المؤمنين فكان الأحق بالذكر هنا وصف «الذين ءَامنوا» قلت : وأما بيان مزية التقوى الذي ذكرته فله مناسبات أخرى . قلت في الآية تعريض بأن غير المتقين لا تظخر مزيتهم يوم القيامة وإنما تظهر بعد ذلك ، لأن يوم القيامة هو مبدأ أيام الجزاء فغير المتقين لا تظهر لهم التفوق يومئذٍ ، ولا يدركه الكفار بالحس قال تعالى : { فاتقوا النار التي وقودها الناس والحجارة أعدت للكافرين } \\[ البقرة : 24 \\] نعم تظهر مزيتهم بعد انقضاء ما قُدِّر لهم من العذاب على الذنوب .رُوي عن ابن عباس أن الآية نزلت في سادة قريش بمكة سخروا من فقراء المؤمنين وضعفائهم فأعلمهم الله أن فقراء المؤمنين خير منهم عند الله ، ووعد الله الفقراء بالرزق وفي قوله : { من يشاء } تعريض بتهديد المشركين بقطع الرزق عنهم وزوال حظوتهم .وقوله : { والله يرزق من يشاء } إلخ تذييل قصد منه تعظيم تشريف المؤمنين يوم القيامة ، لأن التذييل لا بد أن يكون مرتبطاً بما قبله فالسامع يعلم من هذا التذييل معنى محذوفاً تقديره والذين اتقوا فوقهم فوقية عظيمة لا يحيط بها الوصف ، لأنها فوقية منحوها من فضل الله وفضلُ الله لا نهاية له ، ولأن من سخرية الذين كفروا بالذين آمنوا أنهم سخروا بفقراء المؤمنين لإقلالهم .والحساب هنا حصر المقدار فنفي الحساب نفي لعلم مقدار الرزق ، وقد شاعت هذه الكنابة في كلام العرب كما شاع عندهم أن يقولوا يُعَدُّون بالأصابع ويحيط بها العد كناية عن القِلّة ومنه قولهم شيء لا يُحصى ولذلك صح أن ينفى الحساب هنا عن أمر لا يعقل حسابه وهو الفوقية وقال قيس بن الخطيم :ما تمنعِي يقظي فقد تُؤْتينه ... في النَّوْم غيرَ مُصَرَّدٍ محسوبِ\n\n",
      "translations": [
        {
          "translation": "(Beautified is the life of the world) what is in this world of comfortable living (for those who disbelieve) Abu Jahl and his entourage; (they make a jest of believers) Salman [al-Farisi], Bilal [Ibn Rabah], Suhayb [al- Rumi] and their fellow believers because of their abject poverty. (But those who ward off) disbelief and ascribing partners to Allah: i.e. Salman and his fellow believers (will be above them) in this world by having a strong argument against them and also by having status and standing (on the Day of Resurrection. Allah giveth) abundant wealth (without stint) without faltering or affectation; it is also said that He gives to whoever He wills in Paradise without stint (to whom He will).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَٱلَّذِينَ ٱتَّقَواْ فَوْقَهُمْ } معناهُ أَفضلَ مَنْهم\n ويقال فَوقهم فِي الجَنَّة\n\n\n\n\nوقولهُ تعالى: { وَٱللَّهُ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍ } معناه بغيرِ مُحاسبةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And those who fear Him above them,\" means that He is better than them.\n\n\nIt is said that above them in Paradise is a { }.\n\nAnd His saying, {And God provides for whoever He wills without account} [means] without [needing] a reckoning.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال على وجه الإخبار: { زُيِّنَ لِلَّذِينَ كَفَرُواْ } أي: حسن في عيونهم وارتكز في قلوبهم { ٱلْحَيَاةُ ٱلدُّنْيَا } أي: الحياة المستعارة المنسوبة إلى الدنيا { وَ } أدى أمرهم في هذا التزيين والتحسين إلى أن { يَسْخَرُونَ } ويستهزئون { مِنَ ٱلَّذِينَ آمَنُواْ } أي: صار المؤمنون لفقرهم وعرائهم عن أمتعة الدنيا الدنية محل استهزائهم وسخريتهم\n متى قصدوا الاستهزاء على مناقد الدنيا أخذوا منهم { وَ } الحال أن المؤمنين { ٱلَّذِينَ ٱتَّقَواْ } عن الدنيا ومزخرفاتها الفانية الغير الباقية يكون { فَوْقَهُمْ } رتبة ومنزلة عند الله { يَوْمَ ٱلْقِيَامَةِ } المعد لجزاء الأعمال الصالحة في النشأة الأولى { وَٱللَّهُ } الرزاق للكل { يَرْزُقُ مَن يَشَآءُ } من عباده بالرزق الدنيوي { بِغَيْرِ حِسَابٍ } [البقرة: 212] فيها\n بل مستجبرين متكبرين مفتخرين بمزخرفاتها إلى النشأة الأخرى\n فيحاسبهم فيها ويجازيهم عليها\n ويرزق أيضاً من يشاء من عباده بالرزق الأخروي بغير حساب\n لا في النشأة الأولى ولا في الأخرى\n بل صاروا في حمائه أزلاً وأبداً لا يشوشهم الحساب ولا تتفاوت عندهم اللذة والعذاب\n بل صاروا ما صاروا بلا سترة وحجاب\n\n\nآتنا من لدنك رحمة إنك أنت الوهاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { زُين } مبني للمفعول، والفاعل هو الله، إذ لا فاعل سواه. يقول الحقّ جلّ جلاله: { زيّن للذين كفروا } من اهل الكتاب وغيرهم، { الحياة الدنيا } أي: حُسِّنَتْ في أعينهم، وأُشربت محبتها في قلوبهم، حتى تهالكوا عليها، واعرضوا عن غيرها، فلم تتفرغ قلوبهم للتفكر والاعتبار، ولم تستمع آذانهم للوعظ والتذكار، بل أعمتهم، وأصمّتهم، وقصروا عليها همتهم، حتى جعلوا يسخرون ممن أعرض عنها، كفقراء المسلمين وأهل الصفة، فكانوا يستهزئون بهم، حيث رفضوا الدنيا وأقبلوا على الله، فرفعهم الله في أعلى عليين، وخفض الكفار في أسفل سافلين. فهم يسخرون منهم في دار الدنيا { والذين اتقَوْا فوقَهم يومَ القيامة } لأنهم في عليين، والآخرين في أسفل سافلين. أو لأنهم في كرامة، والآخرون في مذلة. أو لأنهم يسخرون منهم يوم القيامة كما سخروا منهم في الدنيا. وعبَّر بالتقوى لأنها سبب رفعهم واستعلائهم. وأما استهزاؤهم بهم لأجل فقرهم، فإن الفقر شرف للعبد، والبسط في الدنيا على شرفه فقد يكون استدراجاً، وقد يكون عوناً، فالله { يرزق مَن يشاء بغير حساب } ، أي: بغير تقدير، فيوسع في الدنيا استدراجاً وابتلاء، ويقتر على مَي يشاء اختباراً وتمحيصاً،\n[الأنبيَاء: 23]. الإشارة: اعلم أن عمل أهل الباطن كله باطني قلبي، بين تفكر واعتبار، وشهور واستبصار، أو نقول: بين فكرة ونظرة وعكوف في الحضرة، فلا يظهرون من أعمالهم إلا المهم من الواجبات، ولذلك قال بعضهم: إذا وصل العمل إلى القلوب استراحت الجوارح، ومعلوم أن الذرة من أعمال القلوب أفضل من أمثال الجبال من أعمال الجوارح لأن أعمال القلوب خفية، لا يطلع عليها ملك فيكتبها، ولا شيطان فيفسدها، الإخلاص فيها محقق. وأيضاً: \" تفكر ساعة أفضل من عبادة ستين سنة \".\n \" وسئل - عليه الصلاة والسلام -:أيُّ الأَعْمَال أَفْضَلُ؟ قال: العلْمُ بالله. قيلَ: يا رسُولَ الله سَأَلْنَاكَ عن العَمَل؟ فقال: العلمُ بالله ثم قال صلى الله عليه وسلم: إذا حَصَلَ العلمُ بالله كَفَى قلِيلُ العَملِ \" \nأو كما قال عليه الصلاة والسلام،\n \" فلما خفيت أعمال أهل الباطن سخر منهم أهل الظاهر، واستصغروا شأنهم حيث لم يروا عليهم من الأعمال ما رأوا على العُبَّاد والزُهاد. والذين اتقوا شهود ما سوى الله، أو كل ما يشغل عن الله، فوقهم يوم القيامة لأنهم من المقربين وغيرهم من عوام المسلمين، والله يرزق من يشاء في الدارين بغير حساب، أي: بغير تقدير ولا حصر، فيرزق العلوم، ويفتح مخازن الفهوم على مَن توجه إلى مولاه، وفرغ قلبه مما سواه \" \nوبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:32",
      "similarity": 0.36144718064157505
    },
    {
      "verse": "37:14",
      "similarity": 0.34020827527520675
    },
    {
      "verse": "28:60",
      "similarity": 0.2972929301879365
    },
    {
      "verse": "50:6",
      "similarity": 0.2953980359074267
    },
    {
      "verse": "24:38",
      "similarity": 0.28736698990548126
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002212.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002212.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:212.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}