{
  "chapter": "البقرة",
  "text": "كان الناس امة وحدة فبعث الله النبين مبشرين ومنذرين وانزل معهم الكتب بالحق ليحكم بين الناس فيما اختلفوا۟ فيه وما اختلف فيه الا الذين اوتوه منۢ بعد ما جاءتهم البينت بغيۢا بينهم فهدى الله الذين ءامنوا۟ لما اختلفوا۟ فيه من الحق باذنه والله يهدى من يشاء الى صرط مستقيم",
  "translations": [
    {
      "translation": "Mankind was a single community. Then Allah sent out Prophets bringing good news and giving warning, and with them He sent down the Book with truth to decide between people regarding their differences. Only those who were given it differed about it, after the Clear Signs had come to them, envying one another. Then, by His permission, Allah guided those who had iman to the truth of that about which they had differed. Allah guides whomever He wills to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men belonged to a single community, and God sent them messengers to give them happy tidings and warnings, and sent the Book with them containing the truth to judge between them in matters of dispute; but only those who received it differed after receiving clear proofs, on account of waywardness (and jealousies) among them. Then God by His dispensation showed those who believed the way to the truth about which they were differing; for God shows whom He please the path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the beginning all the people followed the same way. (Afterwards there came a change and differences arose). Then Allah sent Prophets to give good tidings to those who followed the Right Way and warnings to those who swerved from it. And He sent down with them the Book based on the Truth so that it should judge between the people concerning their differences. (Differences arose not because people were not given the knowledge of the Truth in the beginning, nay), differences arose between those very people who had been given clear teachings, and (for no other reasons than that) they wanted to tyrannize over one another. So Allah, by His leave, guided those who believed in the Prophets to the Truth about which they had differed; AIIah guides whomever He pleases to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At one time all people were only one nation. God sent Prophets with glad news and warnings. He sent the Book with them for a genuine purpose to provide the people with the ruling about disputed matters among them. No one disputed this matter except those who had already received evidence before. Their dispute was only because of their own hostility. To deal with this dispute, God, through His will, sent guidance to the believers. God guides to the right path whomever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was on one religion; so Allah sent Prophets giving glad tidings and warnings – and with them sent down the true Book to judge between mankind on their differences; and only those to whom it was given created disputes regarding the Book, after clear commands had come to them, due to hostility of one another; so Allah, by His command, made the truth clear to the believers, concerning their disputes; and Allah may guide whomever He wills to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was one community and Allah sent Prophets with glad tidings and warnings, and with them He sent down the Scripture in truth to judge between people in matters wherein they differed. And only those to whom (the Scripture) was given differed concerning it, after clear proofs had come unto them, through hatred, one to another. Then Allah by His leave guided those who believed to the truth of that wherein they differed. And Allah guides whom He wills to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All) people are a single nation; so Allah raised prophets as bearers of good news and as warners, and He revealed with them the Book with truth, that it might judge between people in that in which they differed; and none but the very people who were given it differed about it after clear arguments had come to them, revolting among themselves; so Allah has guided by His will those who believe to the truth about which they differed and Allah guides whom He pleases to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people were one nation; then God sent forth the Prophets, good tidings to bear and warning, and He sent down with them the Book with the truth, that He might decide between the people touching their differences; and only those who had been given it were at variance upon it, after the clear signs had come to them, being insolent one to another; then God guided those who believed to the truth, touching which they were at variance, by His leave; and God guides whomsoever He will to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were one community, and Allah sent (unto them) prophets as bearers of good tidings and as warners, and revealed therewith the Scripture with the truth that it might judge between mankind concerning that wherein they differed. And only those unto whom (the Scripture) was given differed concerning it, after clear proofs had come unto them, through hatred one of another. And Allah by His Will guided those who believe unto the truth of that concerning which they differed. Allah guideth whom He will unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was once a single community, [but then people developed differences], so God sent prophets to them as bearers of good tidings and warning, and sent down with them the Book containing the truth, so that He might judge between their disputes. It was only those to whom it [the scripture] was given who disagreed about it after clear signs had come to them, because of rivalry between them. God by His will guided the believers to the truth about which the others had disputed. God guides whom He will to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was one community; thereafter Allah raised prophets as bearers of glad tidings and warners, as He sent down the Book With truth that He may judge between mankind in that wherein they disputed. And none differed therein save those unto whom it was vouchsafed after the evidences had come to them, out of spite among themselves; then Allah guided those who believed unto the truth of that regarding which they differed, by His leave. Allah guideth whomsoever He listeth unto a path straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were a single community; then Allah sent the prophets as bearers of good news and warners, and He sent down with them the Book with the truth, that it may judge between the people concerning that about which they differed, and none differed in it except those who had been given it, after the manifest proofs had come to them, out of envy among themselves. Then Allah guided those who had faith to the truth of what they differed in, by His will, and Allah guides whomever He wishes to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was one single nation, and Allah sent Messengers with glad tidings and warnings; and with them He sent the Book in truth, to judge between people in matters wherein they differed; but the People of the Book, after the clear Signs came to them, did not differ among themselves, except through selfish contumacy. Allah by His Grace Guided the believers to the Truth, concerning that wherein they differed. For Allah guided whom He will to a path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were one community and Allah sent Prophets with glad tidings and warnings, and with them He sent the Scripture in truth to judge between people in matters wherein they differed. And only those to whom (the Scripture) was given differed concerning it after clear proofs had come unto them through hatred, one to another. Then Allah by His Leave guided those who believed to the truth of that wherein they differed. And Allah guides whom He wills to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people were one nation. Then Allah sent forth Prophets to give them glad tidings and to warn them; and with them He sent down the Book with the truth, that He might rule between the people in that which they differ. Only those to whom it had been given differed about it after the clear verses had come to them, transgressing between themselves. Then Allah guided those who believed concerning that which they were at variance in the truth, by His permission. Allah guides whom He will to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Humanity used to be one community; then God sent the prophets, bringing good news and giving warnings. And He sent down with them the Scripture, with the truth, to judge between people regarding their differences. But none differed over it except those who were given it—after the proofs had come to them—out of mutual envy between them. Then God guided those who believed to the truth they had disputed, in accordance with His will. God guides whom He wills to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was [of] one religion [before their deviation]; then Allah sent the prophets as bringers of good tidings and warners and sent down with them the Scripture in truth to judge between the people concerning that in which they differed. And none differed over the Scripture except those who were given it - after the clear proofs came to them - out of jealous animosity among themselves. And Allah guided those who believed to the truth concerning that over which they had differed, by His permission. And Allah guides whom He wills to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:213] People were one community, in faith, but they fell into disagreement, and some believed, while others disbelieved; then God sent forth the prophets, to them, as bearers of good tidings, of Paradise for the believers, and warners, of the Fire for the disbelievers; and He revealed with them the Scripture, meaning, the Books, with the truth (bi’l-haqqi, ‘with the truth’, is semantically connected to anzala, ‘He revealed’) that He might decide, according to it, between people regarding their differences, in religion; and only those who had been given it, the Scripture, so that some believed while others disbelieved, differed about it, [about] religion, after the clear proofs, the manifest arguments for God’s Oneness, had come to them (min [of min ba‘di, ‘after’] is semantically connected to ikhtalafa, ‘they differed’, and together with what follows should be understood as coming before the exception [illā lladhīna, ‘only those’]); out of insolence, on the part of the disbelievers, one to another; then God guided those who believed to the truth, regarding which (min [of min al-haqqi, ‘of the truth’] here is explicative) they were at variance, by His leave, by His will; and God guides, with His guidance, whomever He will to a straight path, the path of truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف لبيان أن اختلاف الأديان أمر كان في البشر لحكمة اقتضته وأنه قد ارتفع ذلك ورجع الله بالناس إلى وِحْدة الدين بالإسلام .والمناسبة بينها وبين ما تقدمها تحتمل وجوهاً :الأول : كَانَ الناس أُمَّةً واحدة فَبَعَثَ الله النبيين مُبَشِّرِينَ وَمُنذِرِينَ وَأَنزَلَ مَعَهُمُ الكتاب بالحق لِيَحْكُمَ بَيْنَ الناس فِيمَا اختلفوا فِيهِ } قال فخر الدين : إن الله تعالى لما بين في قوله : { زين للذين كفروا الحياة الدنيا } \\[ البقرة : 212 \\] أن سبب إصرار الكفار على كفرهم هو استبدالهم الدنيا بالآخرة بين في هذه الآية أن هذه الحالة غير مختصة بالذين كفروا بمحمد صلى الله عليه وسلم بل كانت حاصلة في الأزمنة المتقادمة لأن الناس كانوا أمة واحدة قائمة على الحق وما كان اختلافهم لسبب البغي والتحاسد في طلب الدنيا اه ، فتكون الجملة مستأنفة استئنافاً بيانياً لتنظير ما لقيه المسلمون بما كان في الأمم الغابرة .الثاني : يؤخذ من كلام الطيبي عند قوله تعالى : { أم حسبتم أن تدخلوا الجنة } \\[ البقرة : 214 \\] أخذ من كلام «الكشاف» أن المقصود من قوله : { كان الناس أمة واحدة } تشجيع الرسول عليه السلام والمؤمنين على الثبات والصبر على أذى المشركين بذكر ما قابلت به الأمم السالفة أنبياءها وما لقوا فيها من الشدائد اه فالمناسبة على هذا في مدلوللِ قوله تعالى : { زين للذين كفروا الحياة الدنيا ويسخرون } \\[ البقرة : 212 \\] إلخ ، وتكون الجملة مستأنفة استئنافاً ابتدائياً للمناسبة .والظاهر عندي أن موقع هذه الآية هنا جامع لموقع تذييل لما قبلها ومقدمة لما بعدها .فأما الأول فلأنها أفادت بيان حالة الأمم الماضية كيف نشأ الخلاف بينهم في الحق مما لأجله تداركهم الله ببعثات الرسل في العصور والأجيال التي اقتضتها حكمة الله ولطفه مما يماثل الحالة التي نشأت فيها البعثة المحمدية وما لقيه الرسول والمسلمون من المشركين .وأما الثاني فلأنها مقدمة لما يرد بعدها من ذكر اختصاص الإسلام بالهداية إلى الحق الذي اختلفت فيه الأمم وهو مضمون قوله تعالى : { فهدى الله الذين آمنوا لما اختلفوا فيه } إلى قوله : { إلى صراط المستقيم } وذلك من خصائص كون الإسلام مهيمناً على ما سبقه من الشرائع الإلهية وتفضيله على جميع الأديان وأن هذه المزية العظمى يجب الاعتراف بها وألا تكون مثار حسد للنبيء وأمته ، رداً على حسد المشركين ، إذ يسخرون من الذين آمنوا وعلى حسد أهل الكتاب الذي سبق التنبيه عليه في قوله تعالى : { سيقول السفهاء من الناس ما ولاهم عن قبلتهم } إلى قوله { يهدي من يشاء إلى صراط مستقيم } \\[ البقرة : 142 \\] .وحصل من عموم ذلك تعليم المسلمين تاريخ أطوار الدين بين عصور البشر بكلمات جامعة ختمت بقوله : { فهدى الله الذين آمنوا لما اختلفوا فيه من الحق بإذنه } فإن كان المراد من كونهم أمة واحدة الوحدة في الخير والحق وهو المختار كما سيأتي فقد نبه الله أن الناس اختلفوا فبعث لهم أنبياء متفرقين لقصد تهيئة الناس للدخول في دين واحد عام ، فالمناسبة حاصلة مع جملة{ ادخلوا في السلم كافة } \\[ البقرة : 208 \\] بناء على أنها خطاب لأهل الكتاب أي ادخلوا في دين الإسلام الذي هدى الله به المسلمين . وإن كان المراد من كون الناس أمة واحدة الوحدة في الضلال والكفر يكون الله قد نبههم أن بعثة الرسل تقع لأجل إزالة الكفر والضلال الذي يحدث في قرون الجهالة ، فكذلك انتهت تلك القرون إلى القرن الذي أعقبته بعثة محمد صلى الله عليه وسلم فتكون الآية تثبيتاً للمؤمنين فالمناسبة حاصلة مع قوله : { زين للذين كفروا الحياة الدنيا } \\[ البقرة : 212 \\] . فالمعنى أن الإسلام هدى إلى شريعة تجمع الناس كلهم تبييناً لفضيلة هذا الدين واهتداء أهله إلى ما لم يهتد إليه غيرهم ، مع الإشارة إلى أن ما تقدمه من الشرائع تمهيد له وتأنيس به كما سنبينه عند قوله : { فهدى الله الذين آمنوا } .والناس اسم جمع ليس له مفرد من لفظه ، و ( أل ) فيه للاستغراق لا محالة وهو هنا للعموم أي البشر كلهم ، إذ ليس ثمة فريق معهود ولكنه عموم عرفي مبني على مراعاة الغالب الأغلب وعدم الاعتداد بالنادر لظهور أنه لا يخلو زمن غلب فيه الخير عن أن يكون بعض الناس فيه شريراً مثل عصر النبوة ولا يخلو زمن غلب فيه الشر من أن يكون بعض الناس فيه خيراً مثل نوح { وما آمن معه إلاّ قليل } \\[ هود : 4 \\] .والأمة بضمة الهمزة : اسم للجماعة الذين أمرهم واحد ، مشتقة من الأم بفتح الهمزة وهو القصد أي يؤمون غاية واحدة ، وإنما تكون الجماعة أمة إذا اتفقوا في الموطن أو الدين أو اللغة أو في جميعها .والوصف ب ( واحدة ) في الآية لتأكيد الإفراد في قوله ( أمة ) لدفع توهم أن يكون المراد من الأمة القبيلة ، فيظن أن المراد كان الناس أهل نسب واحد ، لأن الأمة قد تطلق على من يجمعهم نسب متحد .والوحدة هنا : مراد بها الاتحاد والتماثل في الدين بقرينة تفريع { فبعث الله النبيئين } الخ ، فيحتمل أن يكون المراد كانوا أمة واحدة في الحق والهدى أي كان الناس على ملة واحدة من الحق والتوحيد ، وبهذا المعنى روى الطبري تفسيرها عن أُبَيّ بن كعب وابن عباس ومجاهد وقتادة وجابر بن زيد وهو مختار الزمخشري قال الفخر : وهو مختار أكثر المحققين قال القفال : بدليل قوله تعالى بعده { فبعث الله النبيين } إلى قوله { فيما اختلفوا فيه } ، لأن تفريع الخبر ببعثة النبيين على الجملة السابقة وتعليل البعث بقوله { ليحكم بين الناس فيما اختلفوا فيه } انتظم من ذلك كلام من بليغ الإيجاز وهو أن الناس كانوا أمة واحدة فجاءتهم الرسل بالترغيب والترهيب والوعد والوعيد ليدوموا على الحق خشية انصرافهم عنه إذا ابتدأ الاختلاف يظهر وأيدهم الله بالكتب ليحكم بين الناس فيما اختلفوا فيه ، فلا جرم أن يكون مجيء الرسل لأجل إبطال اختلاف حدث ، وأن الاختلاف الذي يحتاج إلى بعثة الرسل هو الاختلاف الناشىء بعد الاتفاق على الحق كما يقتضيه التفريع على جملة { كان الناس أمة واحدة } بالفاء في قوله : { فبعث الله النبيين } وعلى صريح قوله : { ليحكم بين الناس فيما اختلفوا فيه } .ولأجل هذه القرينة يتعين تقدير فاختلفوا بعد قوله { أمة واحدة } ، لأن البعثة ترتبت على الاختلاف لا على الكون أمة واحدة ، وعلى هذا الفهم قرأ ابن مسعود ( كان الناس أمة واحدة فاختلفوا فبعث الله ) الخ ، ولو كان المراد أنهم كانوا أمة واحدة في الضلال لصح تفريع البعثة على نفس هذا الكون بلا تقدير ولولا أن القرينة صرفت عن هذا لكان هو المتبادر ، ولهذا قال ابن عطية كل من قدَّر الناسَ في الآية كانوا مؤمنين قدَّر في الكلام فاختلفوا وكل من قدرهم كفاراً كانت بعثة الرسل إليهم اه . ويؤيد هذا التقدير قوله في آية سورة يونس ( 19 ) { وما كان الناس إلا أُمة واحدة فاختلفوا لأن الظاهر اتحاد غرض الآيتين ، ولأنه لما أخبر هنا عن الناس بأنهم كانوا أمة واحدة ونحن نرى اختلافهم علمنا أنهم لم يدوموا على تلك الحالة .والمقصود من الآية على هذا الوجه التنبيه على أن التوحيد والهدى والصلاح هي الفطرة التي فطر الله الناس عليها حين خلقهم كما دلت عليه آية { ألست بربكم } \\[ الأعراف : 172 \\] ، وأنها ما غشَّاها إلاّ تلقين الضلال وترويج الباطل وأن الله بعث النبيئين لإصلاح الفطرة إصلاحاً جزئياً فكان هديهم مختلف الأساليب على حسب اختلاف المصالح والأهلية وشدة الشكائم ، فكان من الأنبياء الميسر ومنهم المغلظ وأنه بعث محمداً لإكمال ذلك الإصلاح ، وإعادة الناس إلى الوحدة على الخير والهدى وذلك معنى قوله : { فهدى الله الذين آمنوا } الخ .وعن عطاء والحسن أن المعنى كان الناس أمة واحدة متفقين على الضلال والشر وهو يروى عن ابن عباس أيضاً وعليه فعطف قوله { فبعث الله النبيئين } عطف على اللفظ الظاهر لا تقدير معه أي كانوا كذلك فبعث الله النبيئين فيعلم أن المراد ليرشدوا الناس إلى الحق بالتبشير والنذارة . فالمقصود من الآية على هذا التأويل إظهار أن ما بعث الله به النبيئين قد وقع فيه التغيير والاختلاف فيما بعثوا به وأن الله بعث محمداً بالقرآن لإرشادهم إلى ما اختلفوا فيه فيكون المقصود بيان مزية دين الإسلام وفضله على سائر الأديان بما كان معه من البيان والبرهان .وأيّاً ما كان المراد فإن فعل كان هنا مستعمل في أصل معناه وهو اتصاف اسمها المخبر عنه بمضمون خبرها في الزمن الماضي وأن ذلك قد انقطع ، إذ صار الناس منقسمين إلى فئتين فئة على الحق وفئة على الباطل .فإن كان المراد الوحدة في الحق فقد حصل ذلك في زمن كان الغالب فيه على الناس الرشد والاستقامة والصلاح والإصلاح فلم يكونوا بحاجة إلى بعثة الرسل إلى أن اختلفت أحوالهم فظهر فيهم الفساد ، فقيل كان ذلك فيما بين آدم ونوح ونقل هذا عن ابن عباس وقتادة ومجاهد ، وقال ابن عطية قال قوم كان ذلك زمن نوح كفر رجل قومه فهلكوا بالطوفان إلاّ من نجاه الله مع نوح فكان أولئك النفر الناجون أمة واحدة قائمة على الحق ، وقيل إنما كان الناس على الحق حين خلق الله الأرواح التي ستودع في بني آدم ففطرها على الإسلام فأقروا له بالوحدانية والعبودية وهو ما في قوله تعالى في سورة الأعراف ( 172 ، 173 ) : { وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم وأشهدهم على أنفسهم ألست بربكم قالوا بلى شهدنا أن تقولوا يوم القيامة إنا كنا عن هذا غافلين أو تقولوا إنما أشرك آباؤنا من قبل وكنا ذرية من بعدهم } على أحد تفاسير تلك الآية وروي هذا عن أبي بن كعب وجابر بن زيد والربيع بن سليمان .وفي تفسير الفخر } عن القاضي عبد الجبار وأبي مسلم الأصفهاني أن معنى الآية : كان الناس أمة واحدة في التمسك بالشرائع العقلية على وجود الخالق وصفاته واحتناب الظلم والكذب وحجتهما على ذلك أن قوله : { النبيئين جمع يفيد العموم ( أي لأنه معرف باللام ) فيقتضي أن بعثة كل النبيئين كانت بعد أن كان الناس أمة واحدة بدليل الفاء ، والشرائع إنما تلقيت من الأنبياء ، فتعين أن كون الناس أمة واحدة شيء سابق على شرائع الأنبياء ولا يكون إلاّ مستفاداً من العقل ، وهما يعنيان أن الله فطر الإنسان في أول نشأته على سلامة الفطرة من الخطأ والضلال ، قال تعالى : { لقد خلقنا الإنسان في أحسن تقويم } \\[ التين : 4 \\] وقيل : أريد بالناس آدم وحواء . نقله ابن عطية عن مجاهد وقوم ، والذي نجزم به أن هذا كان في زمن من أزمان وجود الناس على الأرض يعلمه الله تعالى لقوله : { وقروناً بين ذلك كثيراً } \\[ الفرقان : 38 \\] والأظهر أنه من زمن وجود آدم إلى أن أشرك قوم نوح .وإن كان المراد الوحدة على الباطل فقد حصل ذلك في زمن نوح في أول ما قص الله علينا مع ما ورد في الصحيح أن نوحاً أول الرسل إلى أهل الأرض ، فيظهر أن الضلال حدث في أهل الأرض وعمَّهم عاجلاً فبعث الله نوحاً إليهم ثم أهلك الكافرين منهم بالطوفان ونجى نوحاً ونفراً معه فأصبح جميع الناس صالحين ، ثم اختلفوا بعد ذلك فبعث الله النبيين . فيجدر بنا أن ننظر الآن فيما تضمنته هذه الآية من المعنى في تاريخ ظهور الشرائع وفي أسباب ذلك .الناس أبناء أب واحد وأم واحدة فلا جرم أن كانوا في أول أمرهم أمة واحدة لأن أبويهم لما ولدا الأبناء الكثيرين وتوالد أبناؤهما تألفت منهم في أمد قصير عائلة واحدة خلقت من مزاج نقي فكانت لها أمزجة متماثلة ونشأوا على سيرة واحدة في أحوال الحياة كلها وما كانت لتختلف إلاّ اختلافاً قليلاً ليس له أثر يؤبه به ولا يحدث في العائلة تنافراً ولا تغالباً .ثم إن الله تعالى لما خلق نوع الإنسان أراده ليكون أفضل الموجودات في هذا العالم الأرضي فلا جرم أن يكون خلقه على حالة صالحة للكمال والخير قال تعالى : { لقد خلقنا الإنسان في أحسن تقويم } \\[ التين : 4 \\] . فآدم خلق في أحسن تقويم يليق بالذكر جسماً وعقلاً وألهمه معرفة الخير واتباعه ومعرفة الشر وتجنبه فكانت آراؤه مستقيمة تتوجه ابتداء لما فيه النفع وتهتدي إلى ما يحتاج للاهتداء إليه ، وتتعقل ما يشار به عليه فتميز النافع من غيره ويساعده على العمل بما يهتدي إليه فكره جسد سليم قوي متين وحواءُ خلقت في أحسن تقويم يليق بالأنثى خلقاً مشابهاً لخلق آدم ، إذ إنها خلقت كما خلق آدم ، قال تعالى : { خلقكم من نفس واحدة وخلق منها زوجها } \\[ النساء : 1 \\] فكانت في انسياق عقلها واهتدائها وتعقلها ومساعدة جسدها على ذلك على نحو ما كان عليه آدم . ولا شك أن أقوى عنصر في تقويم البشر عند الخلقة هو العقل المستقيم فبالعقل تأتَّى للبشر أن يتصرف في خصائصه ، وأن يضعها في مواضع الحاجة إليها .هكذا كان شأن الذكَر والأنثى فما ولدا من الأولاد نشأ مثل نشأتهما في الأحوال كلها ، ألم تر كيف اهتدى أحد بني آدم إلى دفن أخيه من مشاهدة فعل الغراب الباحث في الأرض فكانت الاستنباط الفكري والتقليدُ به أسَّ الحضارة البشرية . فالصلاح هُوَ الأصل الذي خلق عليه البشر ودام عليه دهراً ليس بالقصير ، ثم أخذ يرتد إلى أسفل سافلين ، ذلك أن ارتداد الإنسان إلى أسفل سافلين إنما عرض له بعوارض كانت في مبدأ الخليقة قليلة الطرُوّ أوْ معدومته ، لأن أسباب الانحراف عن الفطرة السليمة لا تعدو أربعة أسباب :الأول : خلل يعرض عند تكوين الفرد في عقله أو في جسده فينشأ منحرفاً عن الفضيلة لتلك العاهة .الثاني : اكتساب رَذائل من الأخلاق من مخترعات قواه الشهوية والغضبية ومن تقليد غيره بداعية استحسان ما في غيره من مفاسد يخترعها ويدعو إليها .الثالث : خواطر خياليّة تحدث في النفس مخالفة لما عليه الناس كالشهوات والإفراط في حب الذات أو في كراهية الغير مما توسوس به النفس فيفكر صاحبها في تحقيقها .الرابع : صدور أفعال تصدر من الفرد بدواع حاجية أو تكميلية ويجدها ملائمة له أو لذيذة عنده فيلازمها حتى تصير له عادة وتشتبه عنده بعد طول المدة بالطبيعة ، لأن العادة إذا صادفت سذاجة من العقل غير بصيرة بالنواهي رسخت فصارت طبعاً .فهذه أربعة أسباب للانحطاط عن الفطرة الطيبة ، والأول كان نادر الحدوث في البشر ، لأن سلامة الأبدان وشبابَ واعتدالَ الطبيعة وبساطةَ العيش ونظامَ البِيئة كل تلك كانت موانع من طرو الخلل التكويني ، ألا ترى أن نوع كل حيواننٍ يلازم حال فطرته فلا ينحرف عنها باتباع غيره .والثاني كان غير موجود ، لأن البشر يومئذٍ كانوا عائلة واحدة في موطن واحد يسير على نظام واحد وتربية واحدة وإحساس واحد فمن أين يجيئه الاختلاف؟والثالث ممكن الوجود لكن المحبة الناشئة عن حسن المعاشرة وعن الإلف ، والشفقة الناشئة عن الأخوة والمواعظ الصادرة عن الأبوين كانت حُجباً لما يهجس من هذا الإحساس .والرابع لم يكن بالذي يكثر في الوقت الأول من وجود البشر ، لأن الحاجات كانت جارية على وفق الطباع الأصلية ولأن التحسينات كانت مفقودة ، وإنما هذا السبب الرابع من موجبات الرقي والانحطاط في أحوال الجمعيات البشرية الطارئة .أما حادثة قتل ابن آدم أخاه فما هي إلاّ فلتة نشأت عن السبب الثالث عن إحساس وجداني هو الحسَد مع الجهل بمغبة ما ينشأ عن القتل؛ لأن البشر لم يعرف الموت إلاّ يومئذٍ ولذلك أسرعت إليه الندامة ، فتبين أن الصلاح هو حال الأمة يومئذٍ أو هو الغالب عليها .وينشأ عن هذا الصلاح والاستقامة في الآباء دوام الاستقامة في النسل ، لأن النسل مُنْسَلٌ من ذوات الأصول فهو ينقل ما فيها من الأحوال الخِلقية والخُلُقية ، ولما كان النسل منسَلاَ من الذكر والأنثى كان بحكم الطبع محصِّلاً على مجموع من الحالتين فإن استوت الحالتان أو تقاربتا جاء النسل على أحوال مساويةِ المظاهرِ لأحوال سلفه ، قال نوح عليه السلام في عكسه { ولا يَلدوا إلاّ فاجراً كفاراً } \\[ نوح : 27 \\] ، ومما يدل على أن حال البشر في أول أمره صلاحٌ ما نقله في «الكشاف» عن ابن عباس أنه كان بين آدم ونوح عشرة قرون على شريعة من الحق .ثم كثرت العائلة البشرية وتكونت منها القبيلة فتكاثرت ونشأ فيها مع الزمان قليلاً قليلاً خواطر مختلفة ودبت فيها أسباب الاختلاف في الأحوال تبعاً لاختلاف بين حالي الأب والأم ، فجاء النسل على أحوال مركبة مخالفة لكل من مفرد حالتي الأب والأم ، وبذلك حدثت أمزجة جديدة وطرأت عليها حينئذٍ أسباب الانحطاط الأربعة ، وصارت ملازمة لطوائف من البشر بحكم التناسل والتلقي ، هنالك جاءت الحاجة إلى هدي البشر ببعثة الرسل ، والتاريخُ الديني دلنا على أن نوحاً أول الرسل الذين دَعوا إلى الله تعالى قال تعالى : { شرع لكم من الدين ما وصى به نوحاً } \\[ الشورى : 13 \\] الآية ، ولما ذكر الرسل في آيات القرآن ابتدأهم في جميع تلك الآيات بنوح ولم يذكر آدم وفي حديث الشفاعة في الصحيح تصريح بذلك أن آدم يقول للذين يستشفعون به إني لست هناكم ، ويذكر خطيئته ايتوا نوحاً أول رسول أرسله الله إلى أهل الأرض ، وبهذا يتعين أن خطيئة قابيل ليست مخالفة شرع مشروع ، وأن آدم لم يكن رسولاً وأنه نبيء صالح أوحي إليه بما يهذب ابناءه ويعلمهم بالجزاء .فقوله تعالى : { فبعث الله النبيئين } هو على الوجه الأول مفرع على ما يؤذن به قوله : { كان الناس أمة واحدة } مع تحقق وجود الخلاف بينهم بالمشاهدة من إرادة أن كونهم { } مة واحدة دام مدة ثم انقضى ، فيكون مفرعاً على جملة مقدرة تقديرها فاختلفوا فبعث الله النبيئين ، وعلى الوجه الآخر مفرعاً على الكون أمة واحدة في الباطل فعلى الأول يكون أول النبيين المبعوثين نوحاً ، لأنه أول الرسل لإصلاح الخلق . وعلى الثاني : يكون أولهم آدم بعث لبنيه لما قتل أحدهم أخاه؛ فإن الظاهر أن آدم لم يبعث بشريعة لعدم الدواعي إلى ذلك ، وإنما كان مرشداً كما يرشد المربي عائلته .والمراد بالنبيين هنا الرسل بقرينة قوله : { وأنزل معهم الكتاب بالحق } والإرسال بالشرائع متوغل في القدم وقبله ظهور الشرط وهو أصل ظهور الفواحش لأن الاعتقاد الفاسد أصل ذميم الفعال ، وقد عبد قوم نوح الأصنام ، عبدوا ودا وسواعا ويغوث ويعوق ونسرا وهم يومئذٍ لم يزالوا في مواطن آدم وبنيه في ( جبال نوذ ) من بلاد الهند كما قيل ، وفي البخاري عن ابن عباس أن ودّاً وسواعاً ويغوث ويعوق ونسراً كانوا من صالحي قوم نوح ، فلما هلكوا أوحى الشيطان إلى قومهم أن انصبوا إلى مجالسهم التي كانوا يجلسون أنصاباً وسموها بأسمائهم ففعلوا فلم تعبد ، حتى إذا هلك أولئك وتنسخ العلم عبدت اه ، وقيل كانوا من صالحي قوم آدم ، وقيل إن سواعاً هو ابن شيث وأن يغوث ابن سواع ويعوق ابن سغوث ونسر بن يعوق ، وقيل إنهم من صالحي عصر آدم ماتوا فنحت قابيل بن آدم لهم صوراً ثم عبدوهم بعد ثلاثة أجيال ، وهذا كله زمن متوغل في القدم قبل التاريخ فلا يؤخذ إلاّ بمزيد الاحتراز ، وأقدم شريعة أثبتها التاريخ شريعة برهمان في الهند فإنها تبتدىء من قبل القرن الثلاثين قبل الهجرة . وفي هذا العهد كانت في العراق شريعة عظيمة ببابل وضعها ملك بابل المدعو ( حَمُورَابي ) ويظن المؤرخون أنه كان معاصراً لإبراهيم عليه السلام وأنه المذكور في «سفر التكوين» باسم ( ملْكي صادق ) الذي لقي إبراهيم في شاليم وبارك إبراهيم ودعا له .والبعث : الإرسال والإنهاض للمشي ومنه بعث البعير إذا أنهضه بعد أن برك والبعث هنا مجاز مستعمل في أمر الله النبي بتبليغ الشريعة للأمة .و ( النبيئين ) جمع نبيء وهو فعيل بمعنى مفعول مشتق من النبأ وهو الخبر المهم ، لأن الله أخبره بالوحي وعلم ما فيه صلاح نفسه وصلاح من ينتسب إليه ، فإن أمره بتبليغ شريعة الأمة فهو رسول فكل رسول نبيء ، والقرآن يذكر في الغالب النبي مراداً به الرسول ، وقد ورد أن عدد الأنبياء مائة ألف وأربعة وعشرون ألفاً لا يعلم تفصيلهم وأزمانهم إلاّ الله تعالى قال تعالى :{ وقروناً بين ذلك كثيراً } \\[ الفرقان : 38 \\] وقال : { وكم أهلكنا من القرون من بعد نوح } \\[ الإسراء : 17 \\] . وعدد الرسل ثلاثمائة وثلاثة عشر .والمراد بالنبيين هنا خصوص الرسل منهم بقرينة قوله { بعث } وبقرينة الحال في قوله : { مبشرين ومنذرين } ، لأن البشارة والإنذار من خصائص الرسالة والدعوة وبقرينة ما يأتي من قوله : { وأنزل معهم الكتاب بالحق } الآية . فالتعريف في ( النبيين ) للاستغراق وهو الاستغراق الملقب بالعرفي في اصطلاح أهل المعاني .والبشارة : الإعلام بخير حصل أو سيحصل ، والنذارة بكسر النون الإعلام بشر وضر حصل أو سيحصل ، وذلك هو الوعد والوعيد الذي تشتمل عليه الشرائع .فالرسل هم الذين جاءوا بالوعد والوعيد ، وأما الأنبياء غير الرسل فإن وظيفتهم هي ظهور صلاحهم بين قومهم حتى يكونوا قدوة لهم ، وإرشاد أهلهم وذويهم ومريديهم للاستقامة من دون دعوة حتى يكون بين قومهم رجال صالحون ، وإرشاد من يسترشدهم من قومهم ، وتعليم من يرونه أهلاً لعلم الخير من الأمة .ثم هم قد يجيئون مؤيدين لشريعة مضت كمجيء إسحاق ويعقوب والأسباط لتأييد شريعة إبراهيم عليه السلام ، ومجيء أنبياء بني إسرائيل بعد موسى لتأييد التوراة ، وقد لا يكون لهم تعلق بشرع من قبلهم كمجيء خالد بن سنان العَبْسي نبيئاً في عَبْس من العرب .وقوله : { وأنزل معهم الكتاب } ، الإنزال : حقيقته تدلية الجسم من علو إلى أسفل ، وهو هنا مجاز في وصول الشيء من الأعلى مرتبة إلى من هو دونه ، وذلك أن الوحي جاء من قبل الله تعالى ودال على مراده من الخلق فهو وارد للرسل في جانب له علو منزلة .وأضاف مع إلى ضمير النبيئين إضافة مجملة واختير لفظ مع دون عليهم ليصلح لمن أنزل عليه كتاب منهم مثل إبراهيم وموسى وعيسى ومحمد ، ولمن جاء مؤيداً لمن قبله مثل أنبياء بني إسرائيل بين موسى وعيسى .والكتاب هو المكتوب ، وأطلق في اصطلاح الشرع على الشريعة لأن الله يأمر الناس بكتابتها لدوام حفظها والتمكن من مدارستها ، وإطلاق الكتاب عليها قد يكون حقيقة إن كانت الشريعة في وقت الإطلاق قد كتبت أو كتب بعضها كقوله تعالى : { الم ذلك الكتاب } \\[ البقرة : 1 2 \\] على أحد الوجهين المتقدمين هنالك ، وقد يكون مجازاً على الوجه الآخر ، وما هنا يحمل على الحقيقة لأن الشرائع قد نزلت وكتبت وكتب بعض الشريعة المحمدية .والمعية معية اعتبارية مجازية أريد بها مقارنة الزمان ، لأن حقيقة المعية هي المقارنة في المكان وهي المصاحبة ، ولعل اختيار المعية هنا لما تؤذن به من التأييد والنصر قال تعالى : { إنني معكما أسمع وأرى } \\[ طه : 20 \\] وفي الحديث « ومعك روح القدس » .والتعريف في الكتاب للاستغراق ، أي وأنزل مع النبيئين الكتب التي نزلت كلها وهو من مقابلة الجمع بالجمع على معنى التوزيع ، فالمعنى أنزل مع كل نبي كتابه وقرينة التوزيع موكولة لعلم السامعين لاشتهار ذلك .وإنما أفرد الكتاب ولم يقل الكتب ، لأن المفرد والجمع في مقام الاستغراق سواء ، وقد تقدم مع ما في الإفراد من الإيجاز ودفع احتمال العهد إذ لا يجوز أن ينزل كتاب واحد مع جمع النبيئين؛ فتعين أن يكون المراد الاستغراق لا العهد ، وجوز صاحب «الكشاف» كون اللام للعهد والمعنى أنزل مع كل واحد كتابه .والضمير في { ليحكم } راجع إلى الكتاب فإسناد الحكم إلى الكتاب مجاز عقلي ، لأنه مبين ما به الحكم ، أو فعل يحكم مجاز في البيان . ويجوز رجوع الضمير إلى اسم الجلالة أي أنزل الله الكتاب ليحكم بينهم إسناد الحكم مجاز عقلي ، لأنه المسبب له والأمر بالقضاء به ، وتعدية ( يحكم ) ببين لأنه لم يعين فيه محكوم له أو عليه .وحكم الكتاب بين الناس بيان الحق والرشد والاستدلال عليه ، وكونه فيما اختلفوا فيه كناية عن إظهاره الحق ، لأن الحق واحد لا يختلف فيه إلاّ عن ضلال أو خطأ ، ولهذا قال جمهور علمائنا إن المصيب في الاجتهاديات واحد .عطف على جملة { أنزل معهم الكتاب بالحق } لبيان حقيقة أخرى من أحوال اختلاف الأمم وهو الاختلاف بين أهل الكتاب بعضهم مع بعض وبين أهل الكتاب الواحد مع تلقيهم ديناً واحداً ، والمعنى وأنزل معهم الكتاب بالحق فاختلف فيه كما قال تعالى : { ولقد آتينا موسى الكتاب فاختلف فيه } \\[ هود : 110 \\] . والمعنى وما اختلف فيه إلا أقوامهم الذين أوتوا كتبهم فاستغنى بجملة القصر عن الجملة الأخرى لتضمن جملة القصر إثباتاً ونفياً . فاللَّه بعث الرسل لإبطال الضلال الحاصل من جهل البشر بصلاحهم فجاءت الرسل بالهدى ، اتبعهم من اتبعهم فاهتدى وأعرض عنهم من أعرض فبقي في ضلالة ، فإرسال الرسل لإبطال الاختلاف بين الحق والباطل ، ثم أحدث اتباع الرسل بعدهم اختلافاً آخر وهو اختلاف كل قوم في نفس شريعتهم . والمقصود من هذا بيان عجيب حال البشر في تسرعهم إلى الضلال ، وهي حقيقة تاريخية من تاريخ الشرائع ، وتحذير المسلمين من الوقوع في مثل ذلك .والتعريض بأهل الكتاب وهم أشهر أهل الشرائع يومئذٍ فيما صنعوا بكتبهم من الاختلاف فيها ، وهذا من بديع استطراد القرآن في توبيخ أهل الكتاب وخاصة اليهود وهي طريقة عربية بليغة قال زهير: ... إن البخيل ملوم حين كانولكن الجوادَ على علاَّته هرم ... وقال الفرزدق يمدح الخليفة ويستطرد بهجاء جرير: ... إلى مَلِك ما أُمُّه من مُحَارِبأبُوه ولا كانَتْ كُلَيْبٌ تصاهره ... والضمير من قوله : { فيه } يجوز أن يعود إلى الكتاب وأن يعود إلى الحق الذي تضمنه الكتاب ، والمعنى على التقديرين واحد ، لأن الكتاب أنزل ملابساً للحق ومصاحباً له فإذا اختلف في الكتاب اختلف في الحق الذي فيه وبالعكس على طريقة قياس المساواة في المنطق .والاختلاف في الكتاب ذهاب كل فريق في تحريف المراد منه مذهباً يخالف مذهب الآخر في أصول الشرع لا في الفروع ، فإن الاختلاف في أصوله يعطل المقصود منه .وجيء بالموصول دون غيره من المعرفات لما في الصلة من الأمر العجيب وهو أن يكون المختلفون في مقصد الكتاب هم الذين أعطوا الكتاب ليزيلوا به الخلاف بين الناس فأصبحوا هم سبب خلاف فيه ، ولا شك أن ذلك يبطل المراد منه .والمعنى تشنيع حال الذين أوتوه بأن كانوا أسوأ حالاً من المختلفين في الحق قبل مجيء الشرائع ، لأن أولئك لهم بعض العذر بخلاف الذين اختلفوا بعد كون الكتاب بأيديهم .وقوله : { من بعد ما جاءتهم البينات } متعلق باختلف ، والبينات جمع بينة وهي الحجة والدليل . والمراد بالبينات هنا الدلائل التي من شأنها الصدّ عن الاختلاف في مقاصد الشريعة ، وهي النصوص التي لا تحتمل غير مدلولاتها أعني قواطع الشريعة ، والظواهر المتعاضدة التي التحقت بالقواطع . والظواهر التي لم يدع داع إلى تأويلها ولا عارضها معارض . والظواهر المتعارضة التي دل تعارضها على أن محمل كل منها على حالة لا تعارض حالة محمل الآخر وهو المعبر عنه في الأصول بالجمع بين الأدلة وتواريخ التشريع الدالة على نسخ حكم حكماً آخر ، أو ما يقوم مقام التاريخ من نحو هذا ناسخ ، أو كان الحكم كذا فصار كذا ، فهذه بينات مانعة من الاختلاف لو كان غرض الأمم اتباع الحق ومجىء البينات بلوغ ما يدل عليها وظهور المراد منها .والبعدية هنا : بعدية اعتبار لم يقصد منها تأخر زمان الاختلاف عن مجيء البينات ، وإن كان هو كذلك في نفس الأمر ، أي إن الخلاف كان في حالة تقررت فيها دلائل الحق في نفوس المختلفين .وقوله : { بغياً بينهم } مفعول لأجله لاختلفوا ، والبغي : الظلم وأصل البغي في كلام العرب الطلب ، ثم شاع في طلب ما للغير بدون حق فصار بمعنى الظلم معنى ثانياً وأطلق هنا على الحسد لأن الحسد ظلم .والمعنى أن داعي الاختلاف هو التحاسد وقصد كل فريق تغليط الآخر فيحمل الشريعة غير محاملها ليفسد ما حملها عليه الآخر فيفسد كل فريق صواب غيره وأما خطؤه فأمره أظهر .وقوله : { بينهم } متعلق بقوله : { بغياً } للتنصيص على أن البغي بمعنى الحسد ، وأنه ظلم في نفس الأمة وليس ظلماً على عدوها .واعلم أن تعلق كل من المجرور وهو { من بعد ما جاءتهم } وتعلق المفعول لأجله وهو { بغياً } بقوله : { اختلف } الذي هو محصور بالاستثناء المفرغ ، ويستلزم أن يكون كلاهما محصوراً في فاعل الفعل الذي تعلقا به ، فلا يتأتى فيه الخلاف الذي ذكره الرضي بين النحاة في جواز استثناء شيئين بعد أداة استثناء واحدة ، لأن التحقيق أنّ ما هنا ليس استثناء أشياء بل استثناء شيء واحد وهم الذين أوتوه ، لكنه مقيد بقيدين هما { من بعد ما جاءتهم البينات } و { بغياً } إذ المقصود أن الخلاف لم يكن بين أهل الدين ومعانديه ، ولا كان بين أهل الدين قبل ظهور الدلائل الصارفة عن الخلاف ، ولا كان ذلك الخلاف عن مقصد حسن بل كان بين أهل الدين الواحد ، مع قيام الدلائل وبدافع البغي والحسد .والآية تقتضي تحذير المسلمين من الوقوع فيما وقعت فيه الأمم السابقة من الاختلاف في الدين أي في أصول الإسلام ، فالخلاف الحاصل بين علماء الإسلام ليس اختلافاً في أصول الشريعة ، فإنها إجماعية ، وقد أجمعوا على أنهم يريدون تحقيقها ، ولذلك اتفقت أصولهم في البحث عن مراد الله تعالى وعن سنة رسوله للاستدلال عن مقصد الشارع وتصرفاته ، واتفقوا في أكثر الفروع ، وإنما اختلفوا في تعيين كيفية الوصول إلى مقصد الشارع ، وقد استبرءوا للدِّين فأعلنوا جميعاً أن لله تعالى حكماً في كل مسألة ، وأنه حكم واحد ، وأنه كلف المجتهدين بإصابته وأن المصيب واحد ، وأن مخطئه أقل ثواباً من مصيبه ، وأن التقصير في طلبه إثم . فالاختلاف الحاصل بين علمائنا اختلاف جليل المقدار موسع للأنظار .أما لو جاء أتباعهم فانتصروا لآرائهم مع تحقق ضعف المدرك أو خطئه لقصد ترويج المذهب وإسقاط رأي الغير فذلك يشبه الاختلاف الذي شنعه الله تعالى وحذرنا منه فكونوا من مثله على حذر ولا تكونوا كمثل قول المعري: ... فمجادل وصَلَ الجدالَ وقد درىأن الحقيقة فيه ليس كما زعَمْ ... عَلِم الفتى النَّظَّار أن بصائراعميتْ فكم يُخفى اليقين وكم يُعَم ... وقوله : { فهدى الله الذين آمنوا } هذا العطف يحتمل أن الفاء عاطفة على { اختلف فيه } الذي تضمنته جملة القصر ، قال ابن عرفة : عطف بالفاء إشارة إلى سرعة هدايته المؤمنين بعقب الاختلاف اه ، يريد أنه تعقيب بحسب ما يناسب سرعة مثله وإلا فهدى المسلمين وقع بعد أزمان مضت ، حتى تفاقم اختلاف اليهود واختلاف النصارى ، وفيه بعد لا يخفى ، فالظاهر عندي أن الفاء فصيحة لما علم من أن المقصود من الكلام السابق التحذير من الوقوع في الاختلاف ضرورة أن القرآن إنما نزل لهدي المسلمين للحق في كل ما اختلف فيه أهل الكتب السالفة فكأنَّ السامعَ ترقب العلم بعاقبة هذا الاختلاف فقيل : دامَ هذا الاختلاف إلى مجيء الإسلام فهدى الله الذين آمنوا إلخ ، فقد أفصحت عن كلام مقدر وهو المعطوف عليه المحذوف كقوله تعالى : { اضرب بعصاك الحجر فانفجرت } \\[ البقرة : 60 \\] .والمراد من الذين آمنوا المسلمون لا محالة ، والضمير في { اختلفوا } عائد للمختلفين كلهم ، سواء الذين اختلفوا في الحق قبل مجيء الرسل والذين اختلفوا في الشرائع بعد مجيء الرسل والبينات ولذلك بينه بقوله : { من الحق } وهو الحق الذي تقدم ذكره في قوله : { وأنزل معهم الكتاب بالحق } اختلاف الفريقين راجع إلى الاختلاف في تعيين الحق إما عن جهل أو عن حسد وبغي .والإذن : الخطاب بإباحة فعل وأصله مشتق من فعل أذنَ إذا أصغى أُذُنه إلى كلام مَن يكلمه ، ثم أطلق على الخطاب بإباحة فعل على طريقة المجاز بعلاقة اللزوم لأن الإصغاء إلى كلام المتكلم يستلزم الإقبال عليه وإجابةَ مطلبه ، وشاع ذلك حتى صار الإذن أشْيَع في معنى الخطاب بإباحة الفعل ، وبذلك صار لفظ الإذن قابلاً لأن يستعمل مجازاً في معان من مشابهات الخطاب بالإباحة ، فأطلق في هذه الآية على التمكين من الاهتداء وتيسيره بما في الشرائع من بيان الهُدى والإرشاد إلى وسائل الاهتداء على وجه الاستعارة ، لأن من ييسر لك شيئاً فكأنه أباح لك تناوله .وفي هذا إيماء إلى أن الله بعث بالإسلام لإرجاع الناس إلى الحق وإلى التوحيد الذي كانوا عليه ، أو لإرجاعهم إلى الحق الذي جاءت الرسل لتحصيله ، فاختلف أتباعهم فيه بدلاً من أن يحققوا بأفهامهم مقاصد ما جاءت به رسلهم ، فحصل بما في الإسلام من بيان القرآننِ الذي لا يأتيه الباطل من بين يديه ولا من خلفه وضوحُ الحق والإرشاد إلى كيفية أخذه ، فحصل بمجيء الإسلام إتمام مراد الله مما أنزل من الشرائع السالفة .وقوله : { والله يهدي من يشاء إلى صراط مستقيم } تذييل لبيان أن فضل الله يعطيه من يشاء ، وهذا إجمال ، وتفصيله أن حكمة الله اقتضت أن يتأخر تمام الهدى إلى وقت مجىء شريعة الإسلام لمَّا تهيأَ البشر بمجيء الشرائع السابقة لقبول هذه الشريعة الجامعة ، فكانت الشرائع السابقة تمهيداً وتهيئة لقبول دين الإسلام ، ولذلك صدرت هذه الآية بقوله : { كان الناس أمة واحدة } ، فكما كان البشر في أول أمره أمة واحدة على هدى بسيط ثم عرضت له الضلالات عند تحرك الأفكار البشرية ، رجع البشر إلى دين واحد في حالة ارتقاء الأفكار ، وهذا اتحاد عجيب ، لأنه جاء بعد تشتت الآراء والمذاهب ، ولذا قال تعالى : { إن الدين عند الله الإسلام وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغياً بينهم } ، وفي الحديث : « مَثَل المسلمين واليهود والنصارى كمثللِ رجللٍ استأْجَر قوماً يعملون له عملاً يوماً إلى الليل على أجر معلوم فعملوا له إلى نصف النهار فقالوا لا حاجة لنا إلى أجرك الذي شرطتَ لنا وما عَمِلنا باطل فقال لهم لا تفعلوا أَكمِلوا بقيةَ عملكم وخُذُوا أجركم كاملاً فأَبَوْا وتركوا ، واستأجر آخرين بعدهم فقال لهم : أَكملوا بقية يومكم هذا ولكم الذي شرطتُ لهم من الأجر فعملوا حتى إذا كان حين صلاة العصر قالوا : لك ما عملنا باطل ولك الأجر الذي جعلتَ لنا فيه ، فقال لهم أَكملوا بقية عملكم فإنما بقي من النهار شيء يسير فأَبَوْا ، واستأجر قوماً أن يعملوا له بقية يومهم فعملوا بقية يومهم حتى غابت الشمس واستكملوا أجر الفريقين كليهما ، فذلك مثَلُهم ومثَلُ ما قبلوا من هذا النور ، فقالت اليهود والنصارى ما لَنا أكثرُ عملاً وأقَلُّ عطاء ، قال هل ظلمتكم من حقكم شيئاً؟ قالوا : لا ، قال : فذلك فضلي أوتيه من أشاء » .\n\n",
      "translations": [
        {
          "translation": "(Mankind were) in the times of Noah and Abraham (one community) of disbelievers; as it is said that this means: there were in the time of Abraham followers of the true Religion (Muslims), (and Allah sent Prophets) from the children of Noah and Abraham (as bearers of good tidings) of Paradise for whoever believes in Allah (and as warners) from hell for whoever does not believe in Allah, (and revealed therewith the Scripture) He sent down Gabriel to them with the Scripture, (with the Truth) expositing what is true and what is false (that it might judge) so that each prophet would judge by his Scripture (between mankind concerning that wherein they differed) in Religion; it is also said that this means: so that the Scripture is used as a final authority; and it is also said that this means: so that the Prophet Muhammad (pbuh) rules them by the Scripture. (And only those unto whom (the Scripture) was given differed concerning it) concerning the Religion and Muhammad (pbuh) (after clear proofs had come unto them) clear proofs from their own Scripture, (through hatred one of another) out of resentful envy from their part and this is why they disbelieved in it. (And Allah by His will guided those who believe) by means of the prophets (unto the Truth of that concerning which they differed) in Religion. It is also said that this means: Allah protected the believers by means of the prophets from that which they differed over in matters of Religion, and directed them from falsehood to the Truth. (Allah guideth whom He will) whomever deserves it; and it is also said that this means: Allah holds firm whomever He wills by His grace and will (unto a straight path) unto an established religion that He is pleased with.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَانَ ٱلنَّاسُ أُمَّةً وَٰحِدَةً } قالَ زيدُ بن علي عليهما السَّلامُ: يريدُ بِهِ آدمَ صلى الله عليه\n والأُمَّةُ: المِلَّةُ\n\n\n\n\nوقولهُ تعالى:\n\n[الرعد: 30] معناه مَضتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"The people were one nation,\" Zayd ibn Ali said, \"He [Adam] wanted by it [the people] to be Allah.\"\n The nation: the language\n\n\nAnd His saying, {Exalted is He},\n\n\nThe thunder: 30] Its meaning is {that it has passed}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كان الناس أمّة واحدة } أي: على الفطرة ودين الحق\n كما قال صلى الله عليه وسلم:\n \" كلّ مولود يولد على الفطرة \" \n\n وهو في عهد الفطرة الأولى على الحقيقة\n أو في زمن الطفولة\n أو في عهد آدم عليه السلام { كان الناس أمّة واحدة } ثم اختلفوا في النشأة بحسب اختلاف طبائعهم وغلبة صفات نفوسهم\n وتفرّق أهوائهم\n فإن تضادّ أصول بنيتهم ومراكز أبدانهم باختلاف البقاع والأهوية\n اقتضى ذلك وكذا ما في طباعهم من جذب النفع الخاص ودفع الضرّ الخاص لاحتجاب كل بمادة بدنه واقتضاء الحكمة الإلهية ذلك لمصلحة النشوء والنماء يقتضي التعادي والتخالف { فبعثَ الله النبيين } ليدعوهم من الخلاف إلى الوفاق\n ومن الكثرة إلى الوحدة\n ومن العداوة إلى المحبة\n فتفرّقوا وتحزبوا عليهم وتميزوا\n فأمّا السفليون الذين رسخت في طباعهم محبة الباطل وغلب على قلوبهم الرين وطبع عليها وعميت وزال استعدادهم بغلبة هواهم\n فازدادوا خلافاً وعناداً\n فكأنهم ما اختلفوا إلا عند بعثهم وإتيانهم بالكتاب الذي هو سبب ظهور الحق والوفاق حسداً بينهم\n ناشئاً من عند أنفسهم\n وغلبة هواهم واحتجابهم\n وأمّا العلويون الذين بقوا على الصفاء الأصليّ والاستعداد الأول فهداهم الله إلى الحق الذي اختلفوا فيه وزال خلافهم وسلكوا الصراط المستقيم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَانَ ٱلنَّاسُ } في الفطرة الأصلية والمرتبة الحقيقية الجبلية { أُمَّةً وَٰحِدَةً } وملة واحدة مستوجهة إلى مبدئهم الحقيقي ومقصدهم الأصلي طوعاً\n ثم اختلفت آراؤهم وتشتت أهواؤهم بشياطين القوى الوحدانية التي هي من جنود إبليس\n فظهر بينهم العداوة والبغضاء والمجادلة والمراء { فَبَعَثَ ٱللَّهُ } المدبر لأمورهم { ٱلنَّبِيِّينَ } من بني نوعهم\n المؤيدين من عند ربهم { مُبَشِّرِينَ } لهم طريق الإطلاق والتوحيد { وَمُنذِرِينَ } لهم عن الكثرة والتقييد { وَأَنزَلَ مَعَهُمُ } تصديقاً لهم { ٱلْكِتَٰبَ } الجامع لما يبشر به وينذر عنه ملتبساً { بِٱلْحَقِّ } المطابق للواقع { لِيَحْكُمَ } كل نبي به { بَيْنَ ٱلنَّاسِ } المنسوبين إليه { فِيمَا ٱخْتَلَفُواْ فِيهِ } من أمور معاشهم ومعادهم\n\n\n{ وَمَا ٱخْتَلَفَ فِيهِ } أي: في الكتاب المنزل إليهم بالتكذيب والإنكار أحد من الناس { إِلاَّ } القوم { ٱلَّذِينَ أُوتُوهُ } أي: الكتاب\n وكان اختلافهم { مِن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَٰتُ } الواضحات المصدقات\n بأنه منزل لهم من عند الله العليم الحكيم { بَغْياً } خروجاً عن طريق الحق وحسداً لأهله واقعاً { بَيْنَهُمْ } من وساوس شياطينهم\n من الجاه و الرئاسة والعتو والاستكبار { فَهَدَى ٱللَّهُ } بلطفه { ٱلَّذِينَ آمَنُواْ } بالنبي المبعوث\n والكتاب المنزل معه { لِمَا ٱخْتَلَفُواْ فِيهِ } من الأمور الدينية مع المعاندين المنكرين\n والحال أنه { مِنَ ٱلْحَقِّ } الصريح المطابق للواقع\n واختلافاتهم أيضاً معهم إنما يكون { بِإِذْنِهِ } أي: بأمره المنزل في كتابه { وَٱللَّهُ } المرشد لكل العباد إلى ما هم عليه { يَهْدِي } بفضله { مَن يَشَآءُ } من خلص عباده { إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ } [البقرة: 213] الموصل إلى بابه بلا عوج وضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { فبعث } معطوف على محذوف، أي: فاختلفوا فبعث، و { بغياً }: مفعول له، و { من الحق } بيان { لما }. يقول الحقّ جلّ جلاله: { كان الناس } في زمن آدم عليه السلام وما قرُب منه { أمة واحدة } أي: جماعة واحدة، متفقة على التوحيد، والطاعة، فاختلفوا بعد ذلك في أمر التوحيد، { فبعث الله النبيين مبشرين } لأهل التوحيد والطاعة بالنعيم المقيم، { ومنذرين } أي: مخوفين لأهل الكفر والعصيان بالعذاب الأليم. { وأنزل معهم الكتاب } أي: جنب الكتب، فيشمل الكتب السماوية كلها، متلبساً ذلك الكتاب { بالحق } ، ودالاً عليه { ليحكم } الحق تعالى على لسان الرسل { بين الناس } في الأمر الذي { اختلفوا فيه } من أمر التوحيد وغيره. ثم اختلفوا أيضاً في الكتب المنزلة فبعضهم آمن، وبعضهم كفر بها أو ببعضها، { وما اختلف فيه } أي: في الكتاب المنزل: { إلا الذين اوتوه } حسداً أو كبراً فاليهود آمنوا بالتوراة وكفروا بالإنجيل، والنصارى آمنوا بالإنجيل وكفروا بالتوراة، { من بعد ما جاءتهم }: الآيات الواضحات في صحة ذلك الكتاب الذي كفروا به، والأمر بالإيمان به. وإنما وقع ذلك الكفر منهم { بغياً } وحسداً { بينهم } ، فأنزل الله العلم ليجمعهم ويؤلف بينهم على طاعته، فأمرهم أن يتألفوا بالعلم، فتحاسدوا، واختلفوا طلباً للرئاسة والجاه، { فهدى الله الذين آمنوا } بمحمد - عليه الصلاة والسلام - للأمر الذي اختلف فيه أهل الكتاب، وهو الحق الذي جاءت به الرسل، فآمنوا بالجميع، وتآلفوا على طاعة الله { بإذنه } وإرادته، { والله يهدي من يشاء إلى صراط مستقيم } ، ويضل من يشاء عن طريقه القويم،\n[الأنبيَاء: 23]. الإشارة: الإصل في الأرواح كلها، الاتفاقُ والإقرار، وإنما حصل لها الخلاف والإنكار بعد دخولها في عالم الأشباح، وهبوطها من عالم الأرواح، فبعث الله النبيين يُذكْرون الناس العهدَ القديم، فمن سبقت له السعادة حصل له الإقرار، ومن سبق له الشقاء حصل له الإنكار، ولذلك قال - عليه الصلاة والسلام-:\n \" كُلُّ مَوْلُودٍ يُولَد على الْفطْرةِ، فأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصّرَانِهِ أوْ يُمَجِّسَانِهِ \" \nثم بعث الله الحكما، وهم العارفون بالله، يعالجون ما حصل للروح من الجهل والإنكار، فمن سبقت له العناية آمن بهم، وصدقهم، واستسلم بكليته إليهم، فحصل له الوصول، وبلغ كل المأمول، ومن سبق له الحرمان لم يحصل له بهم إيمان، وبقي دائماً في قلبه حيران. وما وقع هذا الإنكار في الغالب إلا من أهل الرئاسة والجاه، أو من كان عبداً لدنياه وهواه بغياً وحسداً منهم، فهدى الله الذين آمنوا - وهم أهل الفطرة والنيّة - لما اختلفوا فيهم من الحق بإذنه، فحصل لهم التصديق، ووصلوا إلى عين التحقيق، { والله يهدي مَن يشاء إلى صراط مستقيم } وهو طريق الوصول إلى الحضرة القدسية التي كانت مقرّاً للأرواح الزكية، منها جاءت وإليها عادت. وفي ذلك يقول ابن البنا رضي الله عنه:\nولمّا كانت المحبة والهداية إلى أسبابها مقرنتين بالبلاء ذكره الحق تعالى بإثر الهداية.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:89",
      "similarity": 0.42401966249999407
    },
    {
      "verse": "14:1",
      "similarity": 0.36087089790389765
    },
    {
      "verse": "24:46",
      "similarity": 0.36016214987350814
    },
    {
      "verse": "45:17",
      "similarity": 0.3271509863973808
    },
    {
      "verse": "34:6",
      "similarity": 0.32197427296728287
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002213.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002213.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:213.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}