{
  "chapter": "البقرة",
  "text": "ام حسبتم ان تدخلوا۟ الجنة ولما ياتكم مثل الذين خلوا۟ من قبلكم مستهم الباساء والضراء وزلزلوا۟ حتى يقول الرسول والذين ءامنوا۟ معه متى نصر الله الا ان نصر الله قريب",
  "translations": [
    {
      "translation": "Or did you suppose that you would enter the Garden without facing the same as those who came before you? Poverty and illness afflicted them and they were shaken to the point that the Messenger and those who had iman with him said, 'When is Allah's help coming?' Be assured that Allah's help is very near.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think you will find your way to Paradise even though you have not known what the others before you have gone through? They had suffered affliction and loss, and were shaken and tossed about so that even the Apostle had to cry out with his followers: \"When will the help of God arrive?\" Remember, the help of God is ever at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you will enter Paradise without undergoing such trials as were experienced by the believers before you? They met with adversity and affliction and were so shaken by trials that the Prophet of the time and his followers cried out: \"When will Allah's help come\"? (Then they were comforted with the good tidings): \"Yes, Allah's help is near.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you think that you could go to Paradise without experiencing the kind of suffering others have experienced before you? Distress and afflictions battered them until the Messenger and the believers said, \"When will God send help?\" Certainly God's help is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you under the illusion that you will enter Paradise whereas the suffering, which came to those before you, has not yet come to you? Hardship and adversity befell them and they were shaken, to the extent that the Noble Messenger and the believers along with him said, “When will the help of Allah come?”; pay heed! Allah’s help is surely near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or think you that you will enter Paradise without such (trials) as came to those who passed away before you They were afflicted with severe poverty and ailments and were so shaken that even the Messenger and those who believed along with him said, \"When (will come) the help of Allah\" Yes! Certainly, the help of Allah is near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you think that you would enter the garden while yet the state of those who have passed away before you has not come upon you; distress and affliction befell them and they were shaken violently, so that the Apostle and those who believed with him said: When will the help of Allah come? Now surely the help of Allah is nigh!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did you suppose you should enter Paradise without there had come upon you the like of those who passed away before you? They were afflicted by misery and hardship and were so convulsed, that the Messenger and those who believed with him said, 'When comes God's help?' Ah, but surely God's help is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or think ye that ye will enter paradise while yet there hath not come unto you the like of (that which came to) those who passed away before you? Affliction and adversity befell them, they were shaken as with earthquake, till the messenger (of Allah) and those who believed along with him said: When cometh Allah's help? Now surely Allah's help is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you will enter Paradise without having suffered like those who passed away before you? Affliction and hardship befell them and so shaken were they that the Messenger and the believers with him would exclaim, \"When will God's help come?\" Surely the help of God is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem ye that ye will enter the Garden while ye hath not come upon you the like of that which came upon those who have passed away before you There touched them adversity and distress, and shaken were they, until the apostle and those who believed with him said; when cometh the succour of Allah! Lo! verily Allah's succour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you suppose that you will enter paradise though there has not yet come to you the like of [what befell] those who went before you? Stress and distress befell them and they were convulsed until the apostle and the faithful who were with him said, ‘When will Allah’s help [come]?’ Behold! Allah’s help is indeed near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do ye think that ye shall enter the Garden (of bliss) without such (trials) as came to those who passed away before you? they encountered suffering and adversity, and were so shaken in spirit that even the Messenger and those of faith who were with him cried: \"When (will come) the help of Allah?\" Ah! Verily, the help of Allah is (always) near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or think you that you will enter Paradise without such (trials) as came to those who passed away before you? They were afflicted with severe poverty and ailments and were so shaken that even the Messenger and those who believed along with him said, \"When (will come) the Help of Allah?\" Yes! Certainly, the Help of Allah is near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did you suppose that you would go to Paradise untouched by that endured by those before you! Affliction and adversity befell them; and they were shaken until the Messenger, and those who believed with him, said: 'When will the victory of Allah come' Is it not so that the victory of Allah is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you expect to enter Paradise before the example of those who came before you had reached you? Adversity and hardship had afflicted them, and they were so shaken up, that the Messenger and those who believed with him said, “When is God’s victory?” Indeed, God’s victory is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you think that you will enter Paradise while such [trial] has not yet come to you as came to those who passed on before you? They were touched by poverty and hardship and were shaken until [even their] messenger and those who believed with him said, \"When is the help of Allah?\" Unquestionably, the help of Allah is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:214] The following was revealed after the Muslims suffered a trying experience: Or did you suppose that you should enter Paradise without there having come upon you the like of, what came upon, those, believers, who passed away before you?, of trials, so that you may endure as they did; a new sentence begins here, explaining the previous one: They were afflicted by misery, extreme poverty, and hardship, illness, and were so convulsed, by all types of tribulations, that the Messenger and those who believed with him said (read yaqūla or yaqūlu), not expecting to see any help, on account of the extreme hardship afflicting them, ‘When will God’s help come?’, [the help] which we were promised; and God responded to them: Ah, but surely God’s help is nigh, in coming.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or think ye) group of believersl-referring here to 'Uthman [Ibn 'Affan] and his fellow believers-(that ye will enter Paradise while yet there hath not come unto you the like of (that which came to) those who passed away before you?) i.e. without being tried as were the believers who came before you. (Affliction) fear, calamities, hardships (and adversity) sickness, pain and hunger (befell them) visited them, (they were shaken as with an earthquake) in hardship, (till the Messenger (of Allah)) until their Messenger (and those who believed along with him) those who believed in him (said: When cometh Allah's help) over the enemy? Allah said to that Prophet: (Now surely Allah's help) over your enemy by means of your safety (is near). 36\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَزُلْزِلُواْ } معناه خُوِّفو\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And be shaken,\" means be afraid.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أم حَسِبْتم أن تَدْخلوا } جنّة تجلّي الجمال { ولما يَأْتكم } حال { الذين } مضوا { من قَبْلكم مستهم } بأساء الترك والتجريد والفقر والافتقار\n وضرّاء المجاهدة والرياضة وكسر النفس بالعبادة { وزلزلوا } بدواعي الشوق والمحبة عن مقارّ نفوسهم ليظهروا ما في استعدادهم بالقوّة { حتى يقول الرسول والذين آمنوا معه متى نَصْر الله } أي: حتى تضجروا من طول مدّة الحجاب\n وكثرة الجهاد من الفراق\n وعيل صبرهم عن مشاهدة الجمال\n وذوق الوصال\n وطلبوا نصر الله بالتجلي على قمع صفات النفوس مع قوة مصابرتهم\n وحسن تحملهم\n لما يفعل المحبوب ويريد بهم من ابتلائهم بالهجران\n وإذاقتهم طعم الفرقة لاشتداد قوة المحبة\n فكيف بغيرهم؟ فأجيبوا إذا بلغ جهدهم ونفدت طاقتهم وقيل لهم { ألا إنّ نصر الله قريب } أي: رفع الحجاب وظهرت آثار الجمال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأرجوتم وطمعتم أيها المحمديون المتوجون إلى زلال التوحيد\n وصفو التجريد والتفريد\n أن تصلوا إليه بأنيتكم هذه بلا سولكٍ ومجاهدةٍ\n وسكرٍ وصحوٍ\n وتلوينٍ وتمكينٍ\n وقيدٍ وإطلاقٍ\n ونفيٍ وإثباتٍ\n وفناءٍ وبقاءٍ\n وهيهات هيهات\n\n\n{ أَمْ حَسِبْتُمْ } تمنيتم متوقعاً { أَن تَدْخُلُواْ } فجأة بهويتكم هذه بلا إفنائها أو فنائها في هوية الله { ٱلْجَنَّةَ } التي ارتفعت عندها الهويات\n واضمحلت دونها الماهيات { وَلَمَّا يَأْتِكُم } أي: لما يأتكم { مَّثَلُ ٱلَّذِينَ خَلَوْاْ } مضوا { مِن قَبْلِكُم } أي: شأنهم وقصتهم المشهورة المعروفة المنسوبة إلى الأحرار الأبرار الواصلين إلى دار القرار كيف { مَّسَّتْهُمُ } بأبدانهم وأجسادهم وهوياتهم الجسمانية { ٱلْبَأْسَآءُ } المذلة الدميمة المزمنة المزعجة المفنية لإتيانهم\n وكيف مستهم أيضاً بأرواحهم المتكثرة بأشباحهم المتربتة على الأوصاف الذاتية الإلهية { وَٱلضَّرَّآءُ } المسقطة للإضافات كلها { وَ } بعد ما وصلوا إلى هذه المرتبة المعبرة بالقيامة والطامات الكبرى عند العارف { زُلْزِلُواْ } اضطربوا وتلونوا وتذبذبوا لا إلى هؤلاء ولا إلى هؤلاء\n وكان حالهم بين الحيرة والحسرة يترددون ويتحيرون\n إلى أن غلب عليهم المحبة والشوق\n وانبعث من المحبة الخالصة والإرادة الصادقة العشق المفرط المنبعث من جذب المعشوق الماثل بالطبع نحوه واحتاجوا إلى نصر الله وتوفيقه\n وجذبه بلطف\n فاضطروا في بين وبين\n وأين إلى أين { حَتَّىٰ يَقُولَ ٱلرَّسُولُ } المرشد إلى طريق التوحيد مناجياً مع الله وأفعاله\n إذ هم { وَ } أيضاً { ٱلَّذِينَ آمَنُواْ مَعَهُ } مشايعين له في قوله ودعائه مشاركين معه في نهر الاشتياق والاستبطاء وقلة الصبر والجزع والفزع والاضطرار والمراقبة والانتظار { مَتَىٰ نَصْرُ ٱللَّهِ } حتى يتخلص من التلون والتمكن والكون والتكون والظهور والإظهار والغيب والشهادة\n وغير ذلك من الإضافات\n\n\nقيل لهم: وما لنا تعيين القائل؟ إذ لا قائل إلا هو\n منبهاً مستقرباً مستعجباً مستغرباً { أَلاۤ } تنبهوا أيها الأطلال الممدودة المتعددة المنتشئة من الأوصاف المحمودة الذاتية الأحدية المضافة بعضها إلى بعض ارفعوا إضافتكم عن البين وغشاوتكم عن العين\n حتى اتصل العين بالعين\n وارتفع البين عن البين وقولوا: وما أدري ها هنا أيضاً ما القائل وما المقول\n وما القول وما المقول إليه\n وما هذا وماذا؟\n\n\nأدركنا بلطفك عن حجاب الألفاظ وغشاوة العبارة\n\n\n{ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌ } [البقرة: 214] حاضر غير مغيبٍ لو تنبهتم إلى ذي ظلكم\n والتنبه له محال إلا من كشف سبحانه عليه كيفية الظل والإظلال والاستعداد والتعدد الحاصل فيه\n والكوائن الغير المتناهية\n والمكونات الغير المحصورة الحاصلة فيه بأشخاصها وأنواعها وأجناسها إلى ما شاء الله\n لا حول ولا وقة إلا بالله\n\n\n(وَ) بالجملة: لا تحوم الفهوم حول سرادقات عز جلله حتى يشقق عن كائناته ومصنوعاته\n ليس كمثله شيء ليقاس عليه ولا غيره حتى يسمع منه ويبصر به\n وهو السميع البصير العليم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أم } منقطعة بمعنى بل، وتتضمن استفهاماً إنكاريّاً، و \" حسب \" تتعدى إلى مفعولين، أي: أظننتم دخول الجنة حاصلاً من غير أن يأتيكم؟. و { لما } أصلها { لم } زيدت عليها \" ما \" وهي تدل على توقع منفيها بخلاف لم. و { حتى يقول } يصح فيه النصب { أن } لأن الزلزلة متقدمة على قول الرسول، والرفع على حكاية الحال، أي: وزلزلوا حتى حالتهم حينئذٍ أن الرسول ومن معه يقولون كذا وكذا. وفائدة الحكاية: فرض ما كان واقعاً في الزمان الماضي واقعاً في هذا الزمان، تصوّراً لتلك الحال العجيبة، واستحضاراً لصورتها في مشاهدة السامع، وإنما وجب رفعه عند إرادة الحال لأنه نصبه يؤدي إلى تقدير { أن } ، وهي للاستقبال، والحال يُنافيه، ويصح في موضع \" حتى \" الداخلة على الحال الفاء السببية. يقول الحقّ جل جلاله للرسول - عليه الصلاة والسلام - والمؤمنين، تسلية لهم وتشجيعاً لقلوبهم: أظننتم أن تدخلوا الجنة ولمَّا يُصبكم مثلُ ما أصاب مَنْ قبلَكم من الأنبياء وأممهم، فقد { مسّتهم البأساء } في أموالهم بالغصب والنهب والموت { والضراء } وفي أبدانهم بالتقل في الحرب والمرض وأنواع البلاء، { وزلزلوا } أي: ضُربوا بالمحن والشدائد، وطال عليهم البلاء، وتأخر عنهم النصر، حتى أفضى بهم الحال إلى أن قالوا: { متى } يأتينا { نصر الله }؟ استبطاء لمجيئه مع شدة البلاء. قال الحقّ جلّ جلاله بشارةً لهم: { ألا إن نصر الله قريب } فلا تستعجلوا،\n[الأنفَال: 46]،\n[الأعرَاف: 128]. الإشارة: الجنة حفت بالمكاره، ولا فرق بين جنة الزخارف وجنة المعارف، فمن رام دخول جنة المعارف قبل أن يمسه شيء من المكاره، فقد رام المحال. قال أبو المواهب: من ادعى شهود الجمال، قبل تأدبه بالجلال، فارفضه فإنه دجال. وقال بعض العارفين: [صيحة العدو سوط الله يزجر به قلوب أوليائه لئلا تسكن إلى غيره }. وفي الحكم: \" إنما أَجْرَى الأذى عيلهم كي لا تكونَ ساكناً إليهم، أراد أن يزعجك عن كل شيء حتى لا تكون ساكناً إلى شيء \".وقال الشيخ أبو الحسن رضي الله عنه: \" اللهمَّ إنَّ القوم قَد حكَمْتَ عليهم بالذل حتى عزُّوا، وحكمت عليهم بالفقْدِ حتى وَجَدُوا }. فتسليط الخلق على أولياء الله في بدايتهم سنة ماضية، وحكمة إلهية،\n[الأحزَاب: 62]. حتى إذا تخلصوا من البقايا، وكملت فيهم المزايا، نشر فضيلهم لعباده، فأقروهم ليُعرفُوهم الطريق إلى الله، ويدلوا العباد على الله، بعد أن كساهم حينئذٍ كُسوة الجمال وكسوة الجلال، فبكسوة الجمال يقع الائتلاف عليهم والعطف لهم، وبكسوة الجلال يقع الامتثال لأمرهم والاستماع لقولهم. والله تعالى أعلم. ولمّا أمر الحق تعالى بالنفقة في الجهاد وغيره، سألوا ما الذي ينفقون؟، فبيَّن الله تعالى لهم المنفَق والمحل الذي تُدفع فيه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "99:1",
      "similarity": 0.6114643498800513
    },
    {
      "verse": "22:1",
      "similarity": 0.5815133042573891
    },
    {
      "verse": "33:11",
      "similarity": 0.5216683763861986
    },
    {
      "verse": "10:48",
      "similarity": 0.32460491196046265
    },
    {
      "verse": "21:38",
      "similarity": 0.32460491196046265
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:214.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:214.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:214.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}