{
  "chapter": "البقرة",
  "text": "لا يؤاخذكم الله باللغو فى ايمنكم ولكن يؤاخذكم بما كسبت قلوبكم والله غفور حليم",
  "translations": [
    {
      "translation": "Allah will not take you to task for inadvertent statements in your oaths, but He will take you to task for the intention your hearts have made. Allah is Ever-Forgiving, All-Forbearing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not call you to account for that which is senseless in your oaths, but only for what is in your hearts; for God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hears everything you utter and knows everything. Allah does not call you to Account for unintentional and meaningless oaths, but will surely take you to task for oaths taken deliberately and in earnest: Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not take into account your inattentive oath. However, He will question you about what your hearts have gained. God is All-forgiving and Lenient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not take you to task for oaths which are made unintentionally but He does take you to task for deeds which your hearts have done; and Allah is Oft Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for that which is unintentional in your oaths, but He will call you to account for that which your hearts have earned. And Allah is Oft-Forgiving, Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not call you to account for what is vain in your oaths, but He will call you to account for what your hearts have earned, and Allah is Forgiving, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not take you to task for a slip in your oaths; but He will take you to task for what your hearts have earned; and God is All-forgiving, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for that which is unintentional in your oaths. But He will take you to task for that which your hearts have garnered. Allah is Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not call you to account for any oaths you uttered unintentionally, but He will take you to task for what is intended in your hearts. God is most forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for the vain in Your oaths, but he shall take you to task for that which your hearts have earned, and He is the Forgiving, the Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for what is unconsidered in your oaths, but He will take you to task for what your hearts have incurred, and Allah is all-forgiving, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for thoughtlessness in your oaths, but for the intention in your hearts; and He is Oft-forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for that which is unintentional in your oaths, but He will call you to account for that which your hearts have earned. And Allah is Oft-Forgiving, Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for a slip in your oaths. But He will take you to task for that which is intended in your hearts. Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not hold you responsible for your unintentional oaths, but He holds you responsible for your intentions. God is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not impose blame upon you for what is unintentional in your oaths, but He imposes blame upon you for what your hearts have earned. And Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:225] God will not take you to task for a slip, that results, in your oaths, which is what the tongue utters spontaneously and unintentionally, such as ‘By God’, ‘Indeed, by God’: in such instances there is no sin and no redemption required; but He will take you to task for what your hearts have earned, what their intention is, when you commit perjury in your oaths; and God is Forgiving, of slips [in your oaths], Forbearing, since He delays the punishment of the one deserving it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بياني لأن الآية السابقة لما أفادت النهي عن التسرع بالحلف إفادة صريحة أو التزامية ، كانت نفوس السامعين بحيث يهجس بها التفكر والتطلع إلى حكم اليمين التي تجري على الألسن . ومناسبته لما قبله ظاهرة لا سيما إن جعلتَ قوله : { ولا تجعلوا الله عرضة لأيمانكم } \\[ البقرة : 224 \\] نهياً عن الحلف .والمؤاخذة مفاعلة من الأَخذ بمعنى العد والمحاسبة ، يقال أخذه بكذا أي عده عليه ليعاتبه أو يعاقبه ، قال كعب بن زهير: ... لا تأخُذَنِّي بأَقْوال الوْشاةِ ولمأُذْنِبْ وإِنْ كَثُرَتْ فيَّ الأَقَاوِيل ... فالمفاعلة هنا للمبالغة في الأخذ؛ إذ ليس فيه حصول الفعل من الجانبين . والمؤاخذة باليمين هي الإلزام بالوفاء بها وعدم الحنث؛ ويترتب على ذلك أن يأثم إذا وقع الحنث ، إلاّ ما أذن الله في كفّارته ، كما في آية سورة العقود .واللغو مصدر لغا إذا قال كلاماً خَطَئاً ، يقال : لغا يلغُو لغواً كسعا ، ولغا يلغْى لَغْياً كسَعى . ولغة القرآن بالواو . وفي «اللسان» : «أنه لا نظير له إلاّ قولهم أسوته أسواً وأَسى أصلحتُه» وفي الكواشي : «ولغا يلغو لغواً قال باطلاً» ، ويطلق اللغو أيضاً على الكلام الساقط ، الذي لا يعتد به ، وهو الخطأ ، وهو إطلاق شائع . وقد اقتصر عليه الزمخشري في «الأساس» ولم يجعله مجازاً؛ واقتصر على التفسير به في «الكشاف» وتبعه متابعوه .و ( في ) للظرفية المجازية المراد بها الملابسة ، وهي ظرف مستقر ، صفة اللغو أو حال منه ، وكذلك قدره الكواشي فيكون المعنى على جعل اللغو بمعنى المصدر ، وهو الأظهر : لا يؤاخذكم الله بأن تلغوا لغواً ملابساً للأيمان ، أي لا يؤاخذكم بالأيمان الصادرة صدور اللغو ، أي غير المقصود من القول . فإذا جعلتَ اللغو اسماً بمعنى الكلام الساقط الخاطىء ، لم تصح ظرفيته في الأيمان ، لأنه من الأيمان ، فالظرفية متعلقة بيؤاخذكم ، والمعنى لا يؤاخذكم الله في أيمانكم باللغو ، أي لا يؤاخذكم من بين أيمانكم باليمين اللغو .والأيمان جمع يمين ، واليمين القسم والحلف ، وهو ذكر اسم الله تعالى ، أو بعض صفاته ، أو بعض شؤونه العليا أو شعائره . فقد كانت العرب تحلف بالله ، وبرب الكعبة ، وبالهدي ، وبمناسك الحج . والقسم عندهم بحرف من حروف القسم الثلاثة : الواو والباء والتاء ، وربما ذكروا لفظ حلفت أو أقسمت ، وربما حلفوا بدماء البدن ، وربما قالوا والدماءِ ، وقد يدخلون لاماً على عَمْر الله ، يقال : لَعَمْرُ الله ، ويقولون : عمرَك الله ، ولم أر أنهم كانوا يحلفون بأسماء الأصنام . فهذا الحلف الذي يراد به التزام فعل ، أو براءة من حق . وقد يحلفون بأشياء عزيزة عندهم لقصد تأكيد الخبر أو الالتزام ، كقولهم وأبيك ولَعَمْرك ولعمري ، ويحلفون بآبائهم ، ولما جاء الإسلام نهى عن الحلف بغير الله . ومن عادة العرب في القسم أن بعض القسم يقسمون به على التزام فعل يفعله المقسِم ليُلجىء نفسه إلى عمله ولا يندم عنه ، وهو من قبيل قسم النذر ، فإذا أراد أحد أن يظهر عزمه على فعل لا محالة منه ، ولا مطمع لأحد في صرفه عنه ، أكده بالقسم ، قال بلعاء بن قيس: ... وفارسسٍ في غِمار المَوْت منغَمِسإذَا تَأَلَّى على مَكْروهَةٍ صَدَقَا ... ( أي إذا حلف على أن يقاتل أو يقتل أو نحو ذلك من المصاعب والأضرار ومنه سميت الحرب كريهة ) فصار نطقهم باليمين مؤذناً بالغرم ، وكثر ذلك في ألسنتهم في أغراض التأْكيد ونحوه ، حتى صار يجري ذلك على اللسان كما تجري الكلمات الدالة على المعاني من غير إرادة الحلف ، وصارت كثرته في الكلام لا تنحصر ، فكثر التحرج من ذلك في الإسلام قال كثيِّر: ... قليل الألايى حافظ ليمينهوإن سبقت منه الأليَّة بَرَّتِ ... فأشبهه جريانُ الحلف على اللسان اللغوَ من الكلام .وقد اختلف العلماء في المراد من لغو اليمين في هذه الآية ، فذهب الجمهور إلى أن اللغو هو اليمين التي تجري على اللسان ، لم يقصد المتكلم بها الحلف ، ولكنها جرت مجرى التأكيد أو التنبيه ، كقول العرب : لا والله ، وبلى والله . وقول القائل : والله لقد سمعت من فلان كلاماً عجباً ، وغير هذا ليس بلغو ، وهذا قول عائشة ، رواه عنها في «الموطأ» و«الصِّحاح» ، وإليه ذهب الشعبي ، وأبو قِلابة ، وعكرمة ، ومجاهد ، وأبو صالح ، وأخذ به الشافعي ، والحجة له أن الله قد جعل اللغو قسيماً للتي كسبها القلب في هذه الآية ، وللتي عقد عليها الحالف اليمين في قوله : { ولكن يؤاخذكم بما } \\[ المائدة : 89 \\] فما عقدتم الأيمان هو ما كسبته القلوب؛ لأن ما كسبت قلوبكم مبيِّن ، فيحمل عليه مجمل { ما عقدتم } ، فتعين أن تكون اللغو هي التي لا قصد فيها إلى الحلف ، وهي التي تجري على اللسان دون قصد ، وعليه فمعنى نفي المؤاخذة نفي المؤاخذة بالإثم وبالكفارة؛ لأن نفي الفعل يعم ، فاليمين التي لا قصد فيها لا إثم ولا كفارة عليها ، وغيرها تلزم فيه الكفارة للخروج من الإثم بدليل آية المائدة؛ إذ فسر المؤاخذة فيها بقوله : { فكفارته إطعام عشرة مساكين } \\[ المائدة : 89 \\] فيكون في الغموس ، وفي يمين التعليق ، وفي اليمين على الظن ، ثم يتبين خلافه ، الكفارة في جميع ذلك .وقال مالك : «لغو اليمين أن يحلف على شيء يظنه كذلك ثم يتبيّن خلاف ظنه» قال في «الموطأ» : «وهذا أحسن ما سمعت إلى في ذلك» وهو مروي في غير «الموطأ» ، عن أبي هريرة ومن قال به الحسن وإبراهيم وقتادة والسدي ومكحول وابن أبي نجيح . ووجهه من الآية : أن الله تعالى جعل المؤاخذة على كسب القلب في اليمين ، ولا تكون المؤاخذة إلاّ على الحنث لا أصل القسم؛ إذ لا مؤاخذة لأجل مجرد الحلف لا سيما مع البر ، فتعين أن يكون المراد من كسب القلب كسبه الحنث أي تعمده الحنث ، فهو الذي فيه المؤاخذة ، والمؤاخذة أجملت في هاته الآية ، وبينت في آية المائدة بالكفارة ، فالحالف على ظن يظهر بعد خلافه لا تعمد عنده للحنث ، فهو اللغو ، فلا مؤاخذة فيه ، أي لا كفارة وأما قول الرجل : لا والله وبلى والله ، وهو كاذب ، فهو عند مالك قسم ليس بلغو ، لأن اللغوية تتعلق بالحنث بعد اعتقاد الصدق ، والقائل : «لا والله» كاذباً ، لم يتبين حنثه له بعد اليمين ، بل هو غافل عن كونه حالفاً ، فإذا انتبه للحلف وجبت عليه الكفارة ، لأنه حلفها حين حلفها وهو حانث .وإنما جعلنا تفسير ( ما كسبت قلوبكم ) كسب القلب للحنث ، لأن مساق الآية في الحنث لأن قوله : { ولا تجعلوا الله عرضة لأيمانكم } \\[ البقرة : 224 \\] ، إما إذن في الحنث ، أو نهي عن الحلف خشية الحنث ، على الوجهين الماضيين ، وقوله : { لا يؤاخذكم الله بيان وتعليل لذلك ، وحكم البيان حكم المبين ، لأنه عينه .وقال جماعة : اللغو ما لم يقصد به الكذب ، فتشمل القسمين ، سواء كان بلا قصد كالتي تجري على الألسن في لا والله وبلى والله كان بقصد مع اعتقاد الصدق فتبين خلافه . وممن قال بهذا ابن عباس والشعبي وقال به أبو حنيفة ، فقال : اللغو لا كفارة فيها ولا إثم . واحتج لذلك بأن الله تعالى جعل اللغو هنا ، مقابلاً لما كسبته القلوب ، ونفى المؤاخذة عن اللغو وأثبتها لما كسبه القلب ، والمؤاخذة لا محالة على الحنث لا على أصل الحلف ، فاللغو هي التي لا حنث فيها؛ ولم ير بين آية البقرة وآية المائدة تعارضاً حتى يحمل إحداهما على الأخرى بل قال : إن آية البقرة جعلت اللغو مقابلاً لما كسبه القلب ، وأثبت المؤاخذة لما كسبه القلب أي عزمت عليه النفس ، والمؤاخذة مطلقة تنصرف إلى أكمل أفرادها ، وهي العقوبة الأخروية فيتعين أنه ما كسبته القلوب ، أريد به الغموس؛ وجعل في آية المائدة اللغو مقابلاً للأيمان المعقودة .والعقد في الأصل : الربط ، وهو معناه لغة ، وقد أضافه إلى الأيمان ، فدل على أنها اليمين التي فيها تعليق ، وقد فسر المؤاخذة فيها بقوله : { فكفارته إطعام } \\[ المائدة : 89 \\] الخ ، فظهر من الآيتين أن اللغو ما قابل الغموس ، والمنعقدة ، وهو نوعان لا محالة ، وظهر حكم الغموس ، وهي الحلف بتعمد الكذب ، فهو الإثم ، وحكم المنعقدة أنه الكفارة ، فوافق مالكاً في الغموس وخالفه في أحد نوعي اللغو ، وهذا تحقيق مذهبه . وفي اللغو غير هذه المذاهب مذاهب أنهاها ابن عطية إلى عشرة ، لا نطيل بها .وقوله : { والله غفور حليم } تذييل لحكم نفي المؤاخذة ، ومناسبة اقتران وصف الغفور بالحليم هنا دون الرحيم ، لأن هذه مغفرة لذنب هو من قبيل التقصير في الأدب مع الله تعالى ، فلذلك وصف الله نفسه بالحليم ، لأن الحليم هو الذي لا يستفزه التقصير في جانبه ، ولا يغضب للغفلة ، ويقبل المعذرة .\n\n",
      "translations": [
        {
          "translation": "(Allah will not take you to task for that which is unintentional in your oaths) by imposing amends for unintentional oaths such as saying: \"No, by Allah\" or \"Yes indeed, by Allah\" upon buying and selling and upon other instances of idle talk. (But He will take you to task for that which your hearts have garnered) what is hidden in your hearts. (And Allah is Forgiving) of your unintentional oaths, (Clement) in that He does not hasten punishment upon you; it is also said: idle talk is an oath for committing transgression. If one refrains from it and makes amends, then Allah does not take one to task for it; but if one does not refrain from so doing, then Allah will take one to task for it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَّ يُؤَاخِذُكُمُ ٱللَّهُ بِٱلَّلغْوِ فِيۤ أَيْمَانِكُمْ } قالَ زيدُ بن علي عليهما السَّلامُ: فاللَّغوُ: أَنْ يَحلِفَ الرَّجلُ عَلى شَيءٍ وهو يَظُنُ أَنهُ كَذلِكَ\n ويقالُ إِنَّ اللَّغوَ: هو قولُ الرَّجلِ لاَ وَالله، وبلى والله، وهو لاَ يُريدُ أَنْ يُكَلِّمَ بِهَا مَالَ أَحداً، أَو يَقْطعَ بِهَا مَالَ إِنْسانٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {He will not take you to task for a slip in your oaths} - Zayd ibn Ali said: \"The slip\" is when a man swears to something and believes it to be so.\n\n\nIt is said that the word \"laghw\" is the man's way of saying \"no\" to something, or of affirming something, without intending to communicate anything to anyone.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فلبستم فيها وأثبتهم بها { وَٱللَّهُ غَفُورٌ } لكم لو تبتم ورجعتم إليه عما كسبتم من الآثام { حَلِيمٌ } [البقرة: 225] بالانتقام رجاء أن يتوبوا عنها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والأول ألْيَق بقوله تعالى: { ولكن يؤاخذكم بما كسبت قلوبكم } أي: بما عقدت عليه قلوبكم\n { والله غفور } حيث لم يؤاخذكم باللغو\n { حليم } حيث لم يعجل بالمؤاخذة على يمين الجدّ\n تربصاً للتوبة\n الإشارة: يقول الحقّ جلّ جلاله: { لا تجعلوا الله عُرضة لأيمانكم } \n لكن اجعلوه عرضة لتعظيم قلوبكم ومشاهدة لأسراركم\n فإني ما أظهرت اسمي لتبتذلوه في الأيمان والجدال\n وإنما اسمي لتتلقَّوْه بالتعظيم والإجلال\n فمن عظَّم اسمي فقد عظَّم ذاتي\n ومن عظم ذاتي جعلته عظيماً في أرضي وعند أهل سمواتي\n وجعلته برّاً تقيّاً\n من أهل محبتي وودادي\n وداعياً يدعو إلى معرفتي\n ويصلح بيني وبين عبادي\n فمن حلمي ورأفتي: أني لا أؤاخذ بما يجري على اللسان\n وإنما أؤاخذ بما يقصده الجَنَان\n تنبيه: كثرة الحلف مذموم يدل على الخفة والطيش\n وعدم الحلف بالكلية تعسف\n وخيرُ الأمور أوساطها\n كان عليه الصلاة والسلام يحلف في بعض أحيانه\n يقول:\n \" لاَ وَمُقَلِّبِ الْقُلُوبِ \" \n \" وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ \" \nوالله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "88:11",
      "similarity": 0.6182812559019735
    },
    {
      "verse": "78:35",
      "similarity": 0.6113534825155255
    },
    {
      "verse": "23:3",
      "similarity": 0.591733164215106
    },
    {
      "verse": "56:25",
      "similarity": 0.5736517278219461
    },
    {
      "verse": "41:26",
      "similarity": 0.51177379807422
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002225.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002225.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:225.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}