{
  "chapter": "البقرة",
  "text": "الذى جعل لكم الارض فرشا والسماء بناء وانزل من السماء ماء فاخرج به من الثمرت رزقا لكم فلا تجعلوا۟ لله اندادا وانتم تعلمون",
  "translations": [
    {
      "translation": "It is He who made the earth a couch for you, and the sky a dome. He sends down water from the sky and by it brings forth fruits for your provision. Do not, then, knowingly make others equal to Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who made the earth a bed for you, the sky a canopy, and sends forth rain from the skies that fruits may grow -- your food and sustenance. So, do not make another the equal of God knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has made the earth a bed for you and the sky a canopy; and it is He Who sends down rain from above for the growth of every kind of food products for your sustenance. So, when you know this, you should not set up equals to rank with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship God who has rendered the earth as a floor for you and the sky as a dome for you and has sent water down from the sky to produce fruits for your sustenance. Do not knowingly set up anything as an equal to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One Who has appointed the earth a base for you, and the sky a canopy – and caused water to pour down from the sky, thereby producing fruits as food for you; and do not knowingly set up rivals to Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth a resting place for you, and the sky as a canopy, and sent down water (rain) from the sky and brought forth therewith fruits as a provision for you. Then do not set up rivals unto Allah (in worship) while you know (that He alone has the right to be worshipped).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who made the earth a resting place for you and the heaven a canopy and (Who) sends down rain from the cloud, then brings forth with it subsistence for you of the fruits; therefore do not set up rivals to Allah while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who assigned to you the earth for a couch, and heaven for an edifice, and sent down out of heaven water, wherewith He brought forth fruits for your provision; so set not up compeers to God wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath appointed the earth a resting-place for you, and the sky a canopy; and causeth water to pour down from the sky, thereby producing fruits as food for you. And do not set up rivals to Allah when ye know (better).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who made the earth a bed, and the sky a canopy; and it is He who sends down rain from above for the growth of every kind of food for your sustenance. And do not knowingly set up rivals to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath made the earth for you a carpet and the heaven a structure, and sent down from heaven water, and brought forth therewith fruits as a Provision for you; wherefore set not up compeers unto Allah while ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—He who made the earth a place of repose for you, and the sky a canopy, and He sends down water from the sky and with it brings forth crops for your sustenance. So do not set up equals to Allah, while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth your couch, and the heavens your canopy; and sent down rain from the heavens; and brought forth therewith Fruits for your sustenance; then set not up rivals unto Allah when ye know (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth a resting place for you, and the sky as a canopy, and sent down water (rain) from the sky and brought forth therewith fruits as a provision for you. Then do not set up rivals unto Allah (in worship) while you know (that He Alone has the right to be worshipped).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth a bed for you and the sky a dome, and has sent down water from the sky to bring forth fruits for your provision. Do not knowingly set up rivals to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who made the earth a habitat for you, and the sky a structure, and sends water down from the sky, and brings out fruits thereby, as a sustenance for you. Therefore, do not assign rivals to God while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He] who made for you the earth a bed [spread out] and the sky a ceiling and sent down from the sky, rain and brought forth thereby fruits as provision for you. So do not attribute to Allah equals while you know [that there is nothing similar to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:22] He Who assigned to you, created [for you], the earth for a couch, like a carpet that is laid out, neither extremely hard, nor extremely soft so as to make it impossible to stand firm upon it; and heaven for an edifice, like a roof; and sent down from the heaven water, wherewith He brought forth, all types of, fruits for your provision; so set not up compeers to God, that is partners in worship, while you know that He is the Creator, that you create not and that only One that creates can be God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيتعين أن قوله : { الذي جعل لكم الأرض فراشاً } صفة ثانية للرب لأن مساقها مساق قوله : { الذي خلقكم } \\[ البقرة : 21 \\] ، والمقصود الإيماء إلى سبب آخر لاستحقاقه العبادة وإفراده بها فإنه لما أوجب عبادته أنه خالق الناس كلهم أتبع ذلك بصفة أخرى تقتضي عبادتهم إياه وحده ، وهي نعمه المستمرة عليهم مع ما فيها من دلائل عظيم قدرته فإنه مكن لهم سبل العيش وأولها المكان الصالح للاستقرار عليه بدون لغوب فجعله كالفراش لهم ومن إحاطة هذا القرار بالهواء النافع لحياتهم والذي هو غذاء الروح الحيواني ، وذلك ما أشير إليه بقوله : { والسماء بناء } وبكون تلك الكرة الهوائية واقية الناس من إضرار طبقات فوقها متناهية في العلو ، من زمهرير أو عناصر غريبة قاتلة خانقة ، فالكرة الهوائية جعلت فوق هذا العالم فهي كالبناء له ونفعها كنفع البناء فشبهت به على طريقة التشبيه البليغ وبأن أخرج للناس ما فيه إقامة أود حياتهم باجتماع ماء السماء مع قوة الأرض وهو الثمار .والمراد بالسماء هنا إطلاقها العرفي عند العرب وهو ما يبدو للناظر كالقبة الزرقاء وهو كرة الهواء المحيط بالأرض كما هو المراد في قوله : { أو كصيب من السماء } \\[ البقرة : 19 \\] وهذا هو المراد الغالب إذا أطلق السماء بالإفراد دون الجمع .ومعنى جعل الأرض فراشاً أنها كالفراش في التمكن من الاستقرار والاضطجاع عليها وهو أخص أحوال الاستقرار . والمعنى أنه جعلها متوسطة بين شدة الصخور بحيث تؤلم جلد الإنسان وبين رخاوة الحمأة بحيث يتزحزح الكائن فوقها ويسوخ فيها وتلك منة عظيمة .وأما وجه شبه السماء بالبناء فهو أن الكرة الهوائية جعلها الله حاجزة بين الكرة الأرضية وبين الكرة الأثيرية فهي كالبناء فيما يراد له البناء وهو الوقاية من الأضرار النازلة ، فإن للكرة الهوائية دفعاً لأضرار أظهرها دفع ضرر طغيان مياه البحار على الأرض ودفع أضرار بلوغ أهوية تندفع عن بعض الكواكب إلينا وتلطيفها حتى تختلط بالهواء أو صد الهواء إياها عنا مع ما في مشابهة منظر الكرة الهوائية لهيئة القبة ، والقبة بيت من أدم مقبب وتسمى بناء ، والبناء في كلام العرب ما يرفع سمكه على الأرض للوقاية سواء كان من حجر أو من أدم أو من شعر ، ومنه قولهم : بنى على امرأته إذا تزوج لأن المتزوج يجعل بيتاً يسكن فيه مع امرأته وقد اشتهر اطلاق البناء على القبة من أدم ولذلك سموا الأدم الذي تبنى منه القباب مبناة بفتح الميم وكسرها ، وهذا كقوله في سورة الأنبياء ( 32 ) : { وجعلنا السماء سقفاً محفوظاً }فإن قلت يقتضي كلامك هذا أن الامتنان بجعل السماء كالبناء لوقاية الناس من قبيل المعجزات العلمية التي أشرت إليها في المقدمة العاشرة وذلك لا يدركه إلا الأجيال التي حدثت بعد زمان النزول فماذا يكون حظ المسلمين وغيرهم الذين نزلت بينهم الآية :{ والذين جاءوا من بعدهم } \\[ الحشر : 10 \\] في عدة أجيال فإن أهل الجاهلية لم يكونوا يشعرون بأن للسماء خاصية البناء في الوقاية وغاية ما كانوا يتخيلونه أن السماء تشبه سقف القبة كما قالت الأعرابية حين سئلت عن معرفة النجوم : أيجهل أحد خرزات معلقة في سقفه فتتمحض الآية لإفادة العبرة بذلك الخلق البديع إلا أنه ليس فيه حظ من الامتنان الذي أفاده قوله : { لكم } فهل نخص تعلقه بفعل { جعل } المصرح به دون تعلقه بالفعل المطوي تحت واو العطف ، أو بجعله متعلقاً بقوله : { فراشاً } فيكون قوله : { والسماء بناء } معطوفاً على معمول فعل الجعل المجرد عن التقييد بالمتعلق .قلت : هذا يفضي إلى التحكم في تعلق قوله : { لكم } تحكماً لا يدل عليه دليل للسامع بل الوجه أن يجعل { لكم } متعلقاً بفعل { جعل } ويكفي في الامتنان بخلق السماء إشعار السامعين لهذه الآية بأن في خلق السماء على تلك الصفة ما في إقامة البناء من الفوائد على الإجمال ليفرضه السامعون على مقدار قرائحهم وأفهامهم ثم يأتي تأويله في قابل الأجيال .وحذف ( لكم ) عند ذكر السماء إيجازاً لأن ذكره في قوله : { الذي جعل لكم الأرض } دليل عليه .و ( جعل ) إن كانت بمعنى أوجد فحمل الامتنان هو إن كانتا على هذه الحالة وإن كانت بمعنى صير فهي دالة على أن الأرض والسماء قد انتقلتا من حال إلى حال حتى صارتا كما هما وصار أظهر في معنى الانتقال من صفة إلى صفة وقواعد علم طبقات الأرض ( الجيولوجيا ) تؤذن بهذا الوجه الثاني فيكون في الآية منتان وعبرتان في جعلهما على ما رأينا وفي الأطوار التي انتقلتا فيهما بقدرة الله تعالى وإذنه فيكون كقوله تعالى : { أو لم ير الذين كفروا أن السماوات والأرض كانتا رتقاً ففتقناهما إلى قوله : { وجعلنا السماء سقفاً محفوظاً وهم عن آياتها معرضون } \\[ الأنبياء : 30 32 \\]وقد امتن الله وضرب العبرة بأقرب الأشياء وأظهرها لسائر الناس حاضرهم وباديهم وبأول الأشياء في شروط هذه الحياة ، وفيهما أنفع الأشياء وهما الهواء والماء النابع من الأرض وفيهما كانت أول منافع البشر . وفي تخصيص الأرض والسماء بالذكر نكتة أخرى وهي التمهيد لما سيأتي من قوله : { وأنزل من السماء ماء } الخ . وابتدأ بالأرض لأنها أول ما يخطر ببال المعتبر ثم بالسماء لأنه بعد أن ينظر لما بين يديه ينظر إلى ما يحيط به .وقوله : { وأنزل من السماء ماء فأخرج به } الخ هذا امتنان بما يلحق الإيجاد مما يحفظه من الاختلال وهو خلقة لما تتلفه الحرارة الغريزية والعمل العصبي والدماغي من القوة البدنية ليدوم قوام البدن بالغذاء وأصل الغذاء هو ما يخرج من الأرض وإنما تخرج الأرض النبات بنزول الماء عليها من السماء أي من السحاب والطبقات العليا .واعلم أن كون الماء نازلاً من السماء هو أن تكونه يكون في طبقات الجو من آثار البخار الذي في الجو فإن الجو ممتلىء دائماً بالأبخرة الصاعدة إليه بواسطة حرارة الشمس من مياه البحار والأنهار ومن نداوة الأرض ومن النبات ولهذا نجد الإناء المملوء ماء فارغاً بعد أيام إذا ترك مكشوفاً للهواء فإذا بلغ البخار أقطار الجو العالية برد ببرودتها وخاصة في فصل الشتاء فإذا برد مال إلى التميع ، فيصير سحاباً ثم يمكث قليلاً أو كثيراً بحسب التناسب بين برودة الطبقات الجوية والحرارة البخارية فإذا زادت البرودة عليه انقبض السحاب وثقل وتميع فتجتمع فيه الفقاقيع المائية وتثقل عليه فتنزل مطراً وهو ما أشار له قوله تعالى : { وينشىء السحاب الثقال } \\[ الرعد : 12 \\] وكذلك إذا تعرض السحاب للريح الآتية من جهة البحر وهي ريح ندية ارتفع الهواء إلى أعلى الجو فبرد فصار مائعاً وربما كان السحاب قليلاً فساقت إليه الريح سحاباً آخر فانضم أحدهما للآخر ونزلا مطراً ، ولهذا غلب المطر بعد هبوب الريح البحرية وفي الحديث : « إذا أنشأت بحرية ثم تشاءمت فتلك عين غُدَيقة » ومن القواعد أن الحرارة وقلة الضغط يزيدان في صعود البخار وفي قوة انبساطه والبرودة وكثرة الضغط يصيران البخار مائعاً وقد جرب أن صعود البخار يزداد بقدر قرب الجهة من خط الاستواء وينقص بقدر بعده عنه وإلى بعض هذا يشير ما ورد في الحديث أن المطر ينزل من صخرة تحت العرش فإن العرش هو اسم لسماء من السماوات والصخرة تقريب لمكان ذي برودة وقد علمت أن المطر تنشئه البرودة فيتميع السحاب فكانت البرودة هي لقاح المطر .و ( من ) التي في قوله : { من الثمرات } ليست للتبعيض إذ ليس التبعيض مناسباً لمقام الامتنان بل إما لبيان الرزق المخرج ، وتقديم البيان على المبين شائع في كلام العرب وإما زائدة لتأكيد تعلق الإخراج بالثمرات .{ فَلاَ تَجْعَلُواْ للَّهِ أَندَاداً وَأَنتُمْ تَعْلَمُونَ } .أتت الفاء لترتيب هاته الجملة على الكلام السابق وهو مترتب على الأمر بالعبادة و ( لا ) ناهية والفعل مجزوم وليست نافية حتى يكون الفعل منصوباً في جواب الأمر من قوله : { اعبدوا ربكم } والمراد هنا تسببه الخاص وهو حصوله عن دليل يوجبه وهو أن الذي أمركم بعبادته هو المستحق للإفراد بها فهو أخص من مطلق ضد العبادة لأن ضد العبادة عدم العبادة . ولكن لما كان الإشراك للمعبود في العبادة يشبه ترك العبادة جعل ترك الإشراك مساوياً لنقيض العبادة لأن الإشراك ما هو إلا ترك لعبادة الله في أوقات تعظيم شركائهم .والند بكسر النون المساوي والمماثل في أمر من مجد أو حرب ، وزاد بعض أهل اللغة أن يكون مناوئاً أي معادياً ، وكأنهم نظروا إلى اشتقاقه من ند إذا نفر وعاند ، وليس بمتعين لجواز كونه اسماً جامداً وأظن أن وجه دلالة الند على المناوأة والمضادة أنها من لوازم المماثلة عرفاً عند العرب ، فإن شأن المثل عندهم أن ينافس مماثله ويزاحمه في مراده فتحصل المضادة .ونظيره في عكسه تسميتهم المماثل قريعاً ، فإن القريع هو الذي يقارع ويضارب ولما كان أحد لا يتصدى لمقارعة من هو فوقه لخشيته ولا من هو دونه لاحتقاره كانت المقارعة مستلزمة للمماثلة ، وكذلك قولهم قرن للمحارب المكافىء في الشجاعة . ويقال جعل له نداً ، إذا سوى غيره به .والمعنى لاتثبتوا لله أنداداً تجعلونها جعلاً وهي ليست أنداداً وسماها أنداداً تعريضاً بزعمهم لأن حال العرب في عبادتهم لها كحال من يسوي بين الله وبينها وإن كان أهل الجاهلية يقولون إن الآلاهة شفعاء ويقولون ما نعبدهم إلا ليقربونا إلى الله ، وجعلوا الله خالق الآلهة فقالوا في التلبية : «لبيك لا شريك لك إلا شريكاً هو لك تملكه وما ملك» لكنهم لما عبدوها ونسوا بعبادتها والسعي إليها والنذور عندها وإقامة المواسم حولها عبادة الله ، أصبح عملهم عمل من يعتقد التسوية بينها وبين الله تعالى لأن العبرة بالفعل لا بالقول . وفي ذلك معنى من التعريض بهم ورميهم باضطراب الحال ومناقضة الأقوال للأفعال .وقوله : { وأنتم تعلمون } جملة حالية ومفعول { تعلمون } متروك لأن الفعل لم يقصد تعليقه بمفعول بل قصد إثباته لفاعله فقط فنزل الفعل منزلة اللازم ، والمعنى وأنتم ذو علم . والمراد بالعلم هنا العقل التام وهو رجحان الرأي المقابل عندهم بالجهل على نحو قوله تعالى : { قل هل يستوي الذين يعلمون والذين لا يعلمون } \\[ الزمر : 9 \\] وقد جعلت هاته الحال محط النهي والنفي تمليحاً في الكلام للجمع بين التوبيخ وإثارة الهمة فإنه أثبت لهم علماً ورجاحة الرأي ليثير همتهم ويلفت بصائرهم إلى دلائل الوحدانية ونهاهم عن اتخاذ الآلهة أو نفي ذلك مع تلبسهم به وجعله لا يجتمع مع العلم توبيخاً لهم على ما أهملوا من مواهب عقولهم وأضاعوا من سلامة مداركهم . وهذا منزع تهذيبي عظيم ، أن يعمد المربي فيجمع لمن يربيه بين ما يدل على بقية كمال فيه حتى لا يقتل همته باليأس من كماله فإنه إذا ساءت ظنونه في نفسه خارت عزيمته وذهبت مواهبه ، ويأتي بما يدل على نقائص فيه ليطلب الكمال فلا يستريح من الكد في طلب العلا والكمال .وقد أومأ قوله : { وأنتم تعلمون } إلى أنهم يعلمون أن الله لا ند له ولكنهم تعاموا وتناسوا فقالوا : «إلا شريكاً هو لك» .\n\n",
      "translations": [
        {
          "translation": "(Who hath appointed the earth a resting-place for you), a place for dwelling and sleeping, (and the sky a canopy), raised high above; (and causeth water to pour down from the sky), i.e. rain, (thereby producing) through this rain (fruits) different kinds of fruit (as food for you) as sustenance for you and all created beings. (So do not set up rivals to Allah) do not say that Allah has peers, different forms or coequals (when you know) that He is the fashioner of all these things. It is also said that (when you know) means: when you know from your own scripture that Allah does not have a son, coequal or peer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلَّذِي جَعَلَ لَكُمُ ٱلأَرْضَ فِرَاشاً } أَي مِهاداً\n\n\n\n\nوقولهُ تعالى: { فَلاَ تَجْعَلُواْ للَّهِ أَندَاداً } أي أَضدَاداً، وواحدُهَا نِدٌّ ونَديدٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, the Most High, {Who made the earth a bed for you} [that is] a place of rest.\n\nAnd His saying, {So do not make for Allah any equals} that is, any opponents; one of them is Nidd and Nadyd.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولهذا ذكر نتيجة هذه المقدّمات بالفاء فقال: { فلا تجعلوا لله أنداداً وأنتم تعلمون } \n ما ذكرنا من المقدمات كأنه قال: هو الذي فعل هذه الأفعال\n فلا تحق العبادة إلا له\n ولا تنبغي أن تجعل لغيره\n فلا تجعلوا له ندّاً بنسبة الفعل إليه\n فيستحق أن يعبد عندكم فتعبدوه مع علمكم بهذا\n فعبادتهم إنما هي للصانع\n وربهم هو المتجلّي في صورة الصنع\n إذ كل عابد لا يعبد إلا ما يعرفه\n ولا يعرف الله إلا بقدر ما وجد من الألوهية في نفسه\n وهم ما وجدوا إلا الفاعل المختار فعبدوه\n وغاية هذه العبادة الوصول إلى الجنّة التي هي كمال عالم الأفعال\n فالله مهد لهم أراضي نفوسهم\n وبنى عليها سموات أرواحهم\n وأنزل من تلك السموات ماء علم توحيد الأفعال\n فأخرج به من تلك الأرض نبات الاستسلام والأعمال والطاعات والأخلاق الحسنة ليرزق قلوبهم منها ثمرات الإيقان والأحوال والمقامات\n كالصبر والشكر والتوكل\n ولما أثبت التوحيد\n استدل على إثبات النبوّة ليصح بهما الإسلام\n فإنه لا يصح إلا بشهادتين لأن مجرّد التوحيد هو الاحتجاب بالجمع عن التفصيل وهو محض الجبر المؤديّ إلى الزندقة والإباحة\n ومجرّد إسناد الفعل والقول إلى الرسول\n احتجاب بالتفصيل عن الجمع الذي هو صرف القدر المؤدّي إلى المجوسية والثنوية\n والإسلام طريق بينهما بالجمع بين قولنا: لا إله إلا الله\n وبين قولنا: محمد رسول الله\n واعتقاد مظهريته لأفعاله تعالى\n فإن أفعال الخلق بالنسبة إلى أفعال الحق كالجسد بالنسبة إلى الروح\n فكما أن مصدر الفعل هو الروح ولا يتم إلا بالجسد\n فكذلك مبدئ الفعل هو الحق ولا يظهر إلا بالخلق\n ولا بدّ من الرسالة لأن الخلق بسبب احتجابهم وبعدهم عن الحق لا يمكنهم تلقي المعارف من ربهم\n فيجب وجود واسطة يجانس بروحه الشاهدة للحق الحضرة الإلهية\n وبنفسه المخالطة للخلق الرتبة البشرية\n ليتلقى قلبه من روحه الكلمات الربانية\n ويلقي إلى نفسه القدسية\n ويقبل منه الخلق برابطة الجنسية فقال:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لتستقروا عليها وتسترزقوا منها { وَٱلسَّمَاءَ بِنَآءً } مرفوعاً\n لترتقي الأبخرة والأدخنة والمتصاعدة إليهم وتتراكم السحب فيها { وَ } بعد وجود هذه الأسباب { أَنزَلَ } بمحض فضله وفيضه { مِنَ } جانب { ٱلسَّمَآءِ مَآءً } منبتاً لكم الزروع والأثمار المقومة لمزاجكم وإذا أنزل { فَأَخْرَجَ بِهِ } سبحانه\n أي: بسبب الماء { مِنَ ٱلثَّمَرَٰتِ رِزْقاً لَّكُمْ } أي: أخرج رزقاً لكم من الثمرات والطعوم\n لتعيشوا بها وتقدروا إلى التوجه إلى توحيده وتفريده الذي هو غاية إيجادكم وخلقكم وما يترتب على وجودكم\n وإذا كان كذلك { فَلاَ تَجْعَلُواْ } أيها المنعمون بانتزاع النعم { للَّهِ } الواحد القهار لجميع الأغيار { أَندَاداً } أمثالاً في استحقاق العبادة والإيجاد والتكوين والترزيق والإنبات والإضاء وغير ذلك مما يتعلق بالألوهية { وَأَنْتُمْ } إن وصلتم إلى مرتبة التوحيد الذي { تَعْلَمُونَ } [البقرة: 22] أن سلسلة الأسباب منتهية إليه سبحانه\n ولا موجود إلا هو\n بل لا موجود إلا هو\n[الأنعام: 59] والتحقيق بهذا المقام والوصول إلى هذا المرام لا يحصل إلا بعد التخلق بأخلاق الله\n والتخلق بأخلاقه لا يتيسر إلا بمتابعة المتخلق الكامل\n وأكمل المتخلفين نبينا صلى الله عليه وسلم\n والمتخلق بخلقه صلى الله عليه وسلم إنما يكون بالكتاب الجامع لجميع أخلاق الله\n المنزل على مرتبته\n الجامع جميع مراتب المظان\n وفي نسخة أخرى: المظاهر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أَنتُمْ تَعْلَمُونَ } حال من ضمير { فَلاَ تَجْعَلُوا } أي: فلا تجعلوا لله أنداداً والحال أنكم من أهل العلم\n يقول الحقّ جلّ جلاله: يا عبادي اعبدوني بقلوبكم بالتوحيد والإيمان\n وبجوارحكم بالطاعة والإذعان\n وبأرواحكم بالشهود والعيان\n فأنا الذي أظهرتكم من العدم - أنتم ومَن كان قبلكم - وأسبلت عليهم سوابغ النعم\n الأرض تقلكم والسماء تظلكم\n والجهات تكتنفكم\n وأنزلت من السماء ماء فأخرجت به أصنافاً { من الثمرات رزقاً لكم } \n فأنتم جوهرة الصدق\n تنطوي عليكم أصداف مكنوناتي\n وأنتم الذين أطلعتكم على أسرار مكنوناتي\n فكيف يمكنكم أن تتوجهوا إلى غيري؟ وقد أغنيتكم بلطائف إحساني وبري\n أنعمت عليكم أولاً بالإيجاد\n وثانياً بتوالي الإمداد\n خصصتكم بنور العقل والفهم\n وأشرقت عليكم نبذة من أنوار القِدم\n فبي عرفتموني\n وبقدرتي عبدتموني\n فلا شريك معي ولا ظهير\n ولا احتياج إلى معين ولا وزير\n الإشارة: توجه الخطاب إلى العارفين الكاملين في الإنسانية الذي يعبدون الله تعظيماً لحق الربوبية\n وقياماً بوظائف العبودية\n وفيهم قال صاحب العينية:\nوقال قبل ذلك:\nفعبادة العارفين: بالله ومن الله وإلى الله\n وعبادة الجاهلين: بأنفسهم ومن أنفسهم ولأنفسهم\n عبادة العارفين حمد وشكر\n وعبادة الغافلين اقتضاء حظ وأجر\n عبادة العارفين قلبية باطنية\n وعبادة الغافلين حسية ظاهرية\n يا أيها الناس المخصوصون بالأنس والقرب دوموا على عبادة القريب\n ومشاهدة الحبيب\n فقد رَفَعْتُ بيني وبينكم الحجب والأستار\n وأشهدتكم عجائب الألطاف والأسرار\n أبرزتكم إلى الوجود\n وأدخلتكم من باب الكرم والجود\n ومنحتكم بفضلي غاية الشهود\n لعلكم تتقون الإنكار والجحود\n وتعرفونني في كل شاهد ومشهود\n فقد جعلت أرض نفوسكم مهاداً لعلوم الشرعية\n وسماء قلوبكم سقفاً لأسرار الحقيقة\n وأنزلت من سماء الملوكت ماء غيبياً تحيا به أرض النفوس\n وتهتز بواردات حضرة القدوس\n فتخرج من ثمرات العلوم اللدنية\n والأسرار الربانية\n والأحوال المرضية\n ما تتقوت به عائلة المستمعين\n وتنتعش به أسرار السائرين\n فلا تشهدوا معي غيري\n ولا تميلوا لغير إحساني وبري\n فقد علمتم أني منفرد بالوجود\n ومختص بالكرم والجود\n فكيف يرجى غيري وأنا ما قطعت الإحسان؟! وكيف يلتفت إلى ما سواي وأنا بذلت عادة الأمتنان؟! مني كان الإيجاد\n وعليَّ دوام الإمداد\n فثقوا بي كفيلاً\n واتخذوني وكيلاً\n أعطكم عطاء جزيلاً\n وأمنحكم فخراً جليلاً\n ولما أمر عباده بعبادته وتوحيده\n أمرهم بتصديق كلامه والإيمان برسوله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:9",
      "similarity": 0.560802785032869
    },
    {
      "verse": "56:34",
      "similarity": 0.5240264808740127
    },
    {
      "verse": "14:30",
      "similarity": 0.5049922272137163
    },
    {
      "verse": "51:48",
      "similarity": 0.49984528340968537
    },
    {
      "verse": "2:165",
      "similarity": 0.48383332266574747
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}