{
  "chapter": "البقرة",
  "text": "نساؤكم حرث لكم فاتوا۟ حرثكم انى شئتم وقدموا۟ لانفسكم واتقوا۟ الله واعلموا۟ انكم ملقوه وبشر المؤمنين",
  "translations": [
    {
      "translation": "Your women are fertile fields for you, so come to your fertile fields however you like. Send good ahead for yourselves and have taqwa of Allah. Know that you are going to meet Him. And give good news to the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women are like fields for you; so seed them as you intend, but plan the future in advance. And fear God, and remember, you have to face Him in the end. So convey glad tidings to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are your tilth: so you may go to your tilth as you please, but you should take care of your future and refrain from the displeasure of Allah. Know it well that One Day you shall meet Him. (O Prophet!) bear good tidings to the Believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are as fields for you. You may enter your fields from any place you want. Reserve something good for your souls (for the life hereafter). Have fear of God and know that you are going to meet Him. (Muhammad) give the glad news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tillage for you; so come into your tillage as you will; and first perform the deeds that benefit you; and keep fearing Allah, and know well that you have to meet Him; and (O dear Prophet Mohammed – peace and blessings be upon him) give glad tidings to the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a tilth for you, so go to your tilth, when or how you will, and send (good deeds, or ask Allah to bestow upon you pious offspring) for your own selves beforehand. And fear Allah, and know that you are to meet Him (in the Hereafter), and give good tidings to the believers (O Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a tilth for you, so go into your tilth when you like, and do good beforehand for yourselves, and be careful (of your duty) to Allah, and know that you will meet Him, and give good news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tillage for you; so come unto your tillage as you wish, and forward for your souls; and fear God, and know that you shall meet Him. Give thou good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tilth for you (to cultivate) so go to your tilth as ye will, and send (good deeds) before you for your souls, and fear Allah, and know that ye will (one day) meet Him. Give glad tidings to believers, (O Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are your fields. Go, then, into your fields as you will. Do good deeds, and fear God, and know that you shall meet Him.\" Give good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are tilth Unto you, so go in unto your tilth as ye list, and provide beforehand for your souls. And fear Allah, and know that ye are going to meet Him; and give thou glad tidings Unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tillage for you, so come to your tillage whenever you like, and send ahead for your souls, and be Godwary, and know that you will encounter Him; and give good news to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are as a tilth unto you; so approach your tilth when or how ye will; but do some good act for your souls beforehand; and fear Allah. And know that ye are to meet Him (in the Hereafter), and give (these) good tidings to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a tilth for you, so go to your tilth when or how you will, and send (good deeds, or ask Allah to bestow upon you pious offspring) before you for your ownselves. And fear Allah, and know that you are to meet Him (in the Hereafter), and give good tidings to the believers (O Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women are your planting place (for children); come then to your planting place as you please and forward (good deeds) for your souls, and fear Allah. And know that you shall meet Him. Give glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are cultivation for you; so approach your cultivation whenever you like, and send ahead for yourselves. And fear God, and know that you will meet Him. And give good news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a place of sowing of seed for you, so come to your place of cultivation however you wish and put forth [righteousness] for yourselves. And fear Allah and know that you will meet Him. And give good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:223] Your women are a tillage for you, that is, the place where you sow [the seeds of] your children; so come to your tillage, that is, the specified place, the front part, as, in whichever way, you wish, whether standing up, sitting down, lying down, from the front or the back: this was revealed in response to the Jews saying that if a person had vaginal intercourse with his wife from behind, the child would be born cross-eyed; and offer for your souls, righteous deeds, such as saying, ‘In the Name of God’ (bismillāh) when you commence intercourse; and fear God, in what He commands and prohibits; and know that you shall meet Him, at the Resurrection, where He will requite you according to your deeds; and give good tidings, of Paradise, to the believers, who feared Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة تذييل ثان لجملة : { فأتوهن من حيث أمركم الله نِسَآؤُكُمْ حَرْثٌ لَّكُمْ فَأْتُواْ حَرْثَكُمْ أنى شِئْتُمْ } \\[ البقرة : 222 \\] قصد به الارتفاق بالمخاطبين والتأنس لهم لإشعارهم بأن منعهم من قربان النساء في مدة المحيض منع مؤقت لفائدتهم وأن الله يعلم أن نساءهم محل تعهدهم وملابستهم ليس منعهم منهن في بعض الأحوال بأمر هين عليهم لولا إرادة حفظهم من الأذى ، كقول عمر بن الخطاب لما حمي الحمى «لولا المال الذي أحمل عليه في سبيل الله ما حميت عليهم من بلادهم شبراً إنها لبلادُهم» وتعتبر جملة { نساؤكم حرث } مقدِّمة لجملة { فأتوا حرثكم أنى شئتم } وفيها معنى التعليل للإذن بإتيانهن أنّى شاءوا ، والعلةُ قد تجعل مقدمة فلو أوثر معنى التعليل لأخرت عن جملة { فأتوا حرثكم أنى شئتم } ولكن أوثر أن تكون مقدمة للتي بعدها لأنه أحكم نسيج نظم ولتتأتى عقبه الفاء الفصيحة .والحرث مصدر حرث الأرض إذا شقها بآلة تشق التراب ليزرع في شقوقه زريعة أو تغرس أشجار . وهو هنا مطلق على معنى اسم المفعول .وإطلاق الحرث على المحروث وأنواعه إطلاق متعدد فيطلق على الأرض المجعولة للزرع أو الغرس كما قال تعالى : { وقالوا هذه أنعام وحرث حجر } \\[ الأنعام : 138 \\] أي أرض زرع محجورة على الناس أن يزرعوها .وقال : { والخيل المسومة والأنعام والحرث } \\[ آل عمران : 14 \\] أي الجنات والحوائط والحقول .وقال : { كمثل ريح فيها صر أصابت حرث قوم ظلموا أنفسهم فأهلكته } \\[ »ل عمران : 117 \\] أي فأهلكت زرعهم .وقال : { فتنادوا مصبحين أن اغدوا على حرثكم إن كنتم صارمين } \\[ القلم : 22 \\] يعنون به جنتهم أي صارمين عراجين التمر .والحرث في هذه الآية مراد به المحروث بقرينة كونه مفعولاً لفعل { فأتوا حرثكم } وليس المراد به المصدر لأن المقام ينبو عنه ، وتشبيه النساء بالحرث تشبيه لطيف كما شبه النسل بالزرع في قول أبي طالب في خطبته خديجة للنبيء صلى الله عليه وسلم \" الحمد لله الذي جعلنا من ذرية إبراهيم وزرع إسماعيل \" .والفاء في { فأتوا حرثكم أنى شئتم } فاء فصيحة لابتناء ما بعدها على تقرر أن النساء حرث لهم ، لا سيما إذا كانوا قد سألوا عن ذلك بلسان المقال أو بلسان الحال .وكلمة ( أنى ) اسم لمكان مبهم تبينه جملة مضاف هو إليها ، وقد كثر استعماله مجازاً في معنى كيف بتشبيه حال الشيء بمكانه ، لأن كيف اسم للحال المبهمة يبينها عاملها نحو { كيف يشاء } \\[ آل عمران : 6 \\] وقال في «لسان العرب» : إن ( أنى ) تكون بمعنى ( متى ) ، وقد أضيف ( أنى ) في هذه الآية إلى جملة ( شئتم ) والمشيئات شتى فتأوله كثير من المفسرين على حمل ( أني ) على المعنى المجازي وفسره بكيف شئتم وهو تأويل الجمهور الذي عضدوه بما رووه في سبب نزول الآية وفيها روايتان .إحداهما عن جابر بن عبد الله والأخرى عن ابن عباس وتأوله الضحاك على معنى متى شئتم وتأوله جمع على معناه الحقيقي من كونه اسم مكان مبهم ، فمنهم من جعلوه ظرفاً لأنه الأصل في أسماء المكان إذا لم يصرح فيها بما يصرف عن معنى الظرفية وفسروه بمعنى في أي مكان من المرأة شئتم وهو المروي في «صحيح البخاري» تفسيراً من ابن عمر ، ومنهم من جعلوه اسم مكان غير ظرف وقدروا أنه مجرور ب ( من ) ففسروه من أي مكان أو جهة شئتم وهو يئول إلى تفسيره بمعنى كيف ، ونسب القرطبي هذين التأويلين إلى سيبويه . فالذي يتبادر من موقع الآية وتساعد عليه معاني ألفاظها أنها تذييل وارد بعد النهي عن قربان النساء في حال الحيض . فتحمل ( أني ) على معنى متى ويكون المعنى فأتوا نساءكم متى شئتم إذا تطهرن فوزانها وزان قوله تعالى : { وإذا حللتم فاصطادوا بعد قوله : { غير محلى الصيد وأنتم حرم } \\[ المائدة : 2 \\] .ولا مناسبة تبعث لصرف الآية عن هذا المعنى إلا أن ما طار بين علماء السلف ومن بعدهم من الخوض في محامل أخرى لهذه الآية ، وما رووه من آثار في أسباب النزول يضطّرنا إلى استفصال البيان في مختلف الأقوال والمحامل مقتنعين بذلك ، لما فيه من إشارة إلى اختلاف الفقهاء في معاني الآية ، وإنها لمسألة جديرة بالاهتمام ، على ثقل في جريانها ، على الألسنة والأقلام .روى البخاري ومسلم في «صحيحهما» عن جابر بن عبد الله : أن اليهود قالوا إذا أتى الرجل امرأته مجبية جاء الولد أحول ، فسأل المسلمون عن ذلك فنزلت { نساؤكم حرث لكم } الآية وأخرج أبو داود عن ابن عباس قال : كان هذا الحي من الأنصار وهم أهل وثن مع هذا الحي من اليهود وهم أهل كتاب وكانوا يرون لهم فضلاً عليهم في العلم فكانوا يقتدون بكثير من فعلهم ، وكان من أمر أهل الكتاب ألا يأتوا النساء إلا على حرف وذلك أستر ما تكون المرأة ، فكان هذا الحي من الأنصار قد أخذوا بذلك ، وكان هذا الحي من قريش يشرحون النساء شرحاً ( أي يطأونهن وهن مستلقيات عن أقفيتهن ) ومقبلات ومدبرات ومستلقيات ، فلما قدم المهاجرون المدينة تزوج رجل منهم امرأة من الأنصار فذهب يصنع بها ذلك فأنكرته عليه وقالت : إنما كنا نؤتَى على حرف فاصنع ذلك وإلا فاجتنبني حتى شَرِي أمرُهما ( أي تفاقم اللجاج ) فبلغ ذلك النبي فأنزل الله : { فأتوا حرثكم أنى شئتم } أي مقبلات كن أو مدبرات أو مستلقيات يعني بذلك في موضع الولد ، وروي مثله عن أم سلمة زوج النبي صلى الله عليه وسلم في الترمذي ، وما أخرجه الترمذي عن ابن عباس قال : جاء عمر إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله هلكتُ قال وما أهلكك؟ قال : حوَّلْت رحلي الليلة ( يريد أنه أتى امرأته وهي مستدبرة ) فلم يردَّ عليه رسول الله شيئاً فأوحى الله إلى رسوله هذه الآية : { نساؤكم حرث لكم } الآية .وروى البخاري عن نافع قال : كان ابن عمر إذا قرأ القرآن لم يتكلم حتى يفرغ منه فأخذت عليه المصحف يوماً فقرأ سورة البقرة حتى انتهى إلى { فأتوا حرثكم أنى شئتم } قال : تدري فيم أنزلت؟ قلت : لا قال : أنزلت في كذا وكذا وفي رواية عن نافع في البخاري «يأتيها في . . . . » ولم يزد وهو يعني في كلتا الروايتين عنه إتيان النساء في أدبارهن كما صرح بذلك في رواية الطبري وإسحاق بن راهويه : أنزلت إتيان النساء في أدبارهن ، وروى الدارقطني في «غرائب مالك» والطبري عن نافع عن عبد الله بن عمر أن رجلاً أتى امرأته في دبرها فوجد في نفسه من ذلك فأنزل الله { نساؤكم حرث لكم فأتوا حرثكم أنى شئتم } وقد روى أن ذلك الرجل هو عبد الله بن عمر ، وعن عطاء بن يسار أن رجلاً أصاب امرأته في دبرها على عهد رسول الله صلى الله عليه وسلم فأنكر الناس عليه وقالوا : أثفرها فأنزل الله تعالى { نساؤكم حرث لكم } فعلى تأويل هؤلاء يكون قوله تعالى : { نساؤكم حرث لكم فأتوا حرثكم أنى شئتم } ، تشبيهاً للمرأة بالحرث أي بأرض الحرث وأطلق { فأتوا حرثكم } على معنى : فاحرثوا في أي مكان شئتم .أقول : قد أجمل كلام الله تعالى هنا ، وأبهم وبين المبهمات بمبهمات من جهة أخرى لاحتمال { أمركم الله } معاني ليس معنى الإيجاب والتشريع منها ، إذ لم يعهد سبق تشريع من الله في هذا كما قدمناه ، ثم أتبع بقوله : { يحب التوابين } \\[ البقرة : 222 \\] فربما أشعر بأن فعلاً في هذا البيان كان يرتكب والله يدعو إلى الانكفاف عنه وأتبع بقوله : { ويحب المتطهرين } فأشعر بأن فعلاً في هذا الشأن قد يلتبس بغيرِ التنزه والله يحب التنزه عنه ، مع احتمال المحبة عنه لمعنى التفضيل والتكرمة مثل { يحبون أن يتطهروا والله يحب المتطهرين } \\[ التوبة : 108 \\] ، واحتمالها لمعنى : ويبغض غير ذلك ، ثم جاء ما هو كالدليل وهو قوله : { نساؤكم حرث لكم } فجعلن حرثاً على احتمال وجوه في الشبه؛ فقد يقال : إنه وكل للمعروف ، وقد يقال : إنه جعل شائعاً في المرأة ، فلذلك نيط الحكم بذات النساء كلها ، ثم قال : { فأتوا حرثكم أنى شئتم } فجاء بأنى المحتملة للكيفيات وللأمكنة وهي أصل في الأمكنة ووردت في الكيفيات ، وقد قيل : إنها ترد للأزمنة فاحتمل كونها أمكنة الوصول من هذا الإتيان ، أو أمكنة الورود إلى مكان آخر مقصود فهي أمكنة ابتداء الإتيان أو أمكنة الاستقرار فأُجمِل في هذا كله إجمال بديع وأثنى ثناء حسن .واختلاف محامل الآية في أنظار المفسرين والفقهاء طوعُ علم المتأمل ، وفيها أقوال كثيرة ومذاهب مختلفة لفقهاء الأمصار في كتب أحكام القرآن وكتب السنة ، وفي دواوين الفقه ، وقد اقتصرنا على الآثار التي تمت إلى الآية بسبب نزول ، وتركنا ما عداه إلى أفهام العقول .{ وَقَدِّمُواْ لاَِنفُسِكُمْ واتقوا الله واعلموا أَنَّكُم ملاقوه وَبَشِّرِ المؤمنين }عطف على جملة { فأتوا حرثكم } أو على جملة { إن الله يحب التوابين ويحب المتطهرين } . عطف الإنشاء على الخبر ، على أن الجملة المعطوف عليها وإن كانت خبراً فالمقصود منها الأمر بالتوبة والتطهر؛ فكرر ذلك اهتماماً بالحرص على الأعمال الصالحة بعد الكلام على اللذائذ العاجلة .وحذف مفعول { وقدموا } اختصاراً لظهوره؛ لأن التقديم هنا إعداد الحسنات فإنها بمنزلة الثَّقَل الذي يقدمه المسافر .وقوله : { لأنفسكم } متعلق ب { قدموا } ، واللام للعلة أي لأجل أنفسكم أي لنفعها ، وقوله : { واتقوا الله } تحريض على امتثال الشرع بتجنب المخالفة ، فيدخل تحته التخلي عن السيئات والتحلي بالواجبات والقربات ، فمضمونها أعم من مضمون جملة { وقدموا لأنفسكم } فلذلك كانت هذه تذييلاً .وقوله : { واعلموا أنكم ملاقوه } يجمع التحذير والترغيب ، أي فلاقوه بما يرضى به عنكم كقوله : { ووجد الله عنده } \\[ النور : 39 \\] وهو عطف على قوله : { واتقوا الله } .والملاقاة : مفاعلة من اللقاء وهو الحضور لدى الغير بقصد أو مصادفة . وأصل مادة لقي تقتضي الوقوع بين شيئين فكانت مفيدة معنى المفاعلة بمجردها ، فلذلك كان لقي ولاقى بمعنى واحد ، وإنما أمرهم الله بعلم أنهم ملاقوه مع أن المسلمين يعلمون ذلك تنزيلاً لعلمهم منزلة العدم في هذا الشأن ، ليزاد من تعليمهم اهتماماً بهذا المعلوم وتنافساً فيه على أننا رأينا أن في افتتاح الجملة بكلمة : { اعلموا } اهتماماً بالخبر واستنصاتاً له وهي نقطة عظيمة سيأتي الكلام عليها عند قوله تعالى : { واعلموا أن الله يحول بين المرء وقلبه } في سورة الأنفال ( 24 ) .وقد رتبت الجمل الثلاث الأول على عكس ترتيب حصول مضامينها في الخارج؛ فإن الظاهر أن يكون الإعلام بملاقاة الله هو الحاصل أولاً ثم يعقبه الأمر بالتقوى ثم الأمر بأن يقدموا لأنفسهم ، فخولف الظاهر للمبادرة بالأمر بالاستعداد ليوم الجزاء ، وأعقب بالأمر بالتقوى إشعاراً بأنها هي الاستعداد ثم ذكِّروا بأنهم ملاقو الله فجاء ذلك بمنزلة التعليل .وقوله : وبشر المؤمنين } تعقيب للتحذير بالبشارة ، والمراد : المؤمنون الكاملون وهم الذين يسرون بلقاء الله كما جاء : « من أحب لقاء الله أحب الله لقاءه » وذِكر هذه البشارة عقب ما تقدم إشارة إلى أن امتثال الأحكام المتقدمة من كمال الإيمان ، وجملة : { وبشر المؤمنين } ، معطوفة على جملة : { واعلموا أنكم ملاقوه } ، على الأظهر من جعل جملة : { نساؤكم حرث لكم } ، استئنافاً غير معمولة لقل هو أذى ، وإذا جعلت جملة { نساؤكم } من معمول القول كانت جملة { قل هو أذى } \\[ البقرة : 222 \\] معطوفة على جملة : { قُلْ هُوَ أَذًى } ؛ إذ لا يصح وقوعها مقولا للقول كما اختاره التفتازاني .\n\n",
      "translations": [
        {
          "translation": "(Your women are a tilth for you (to cultivate)) He says: the vulvas of your wives are plantations for your offspring (so go to your tilth) your plantations (as ye will) as you please, from behind or front as long as the penetration is in the pudendum, (and send (good deeds) before you for your souls) righteous children, (and fear Allah) regarding penetrating your wives in their anus or having sex with them during menstruation, (and know that ye will (one day) meet Him) that you will see Him after you die and He will reward you according to your deeds. (Give glad tidings to believers (0 Muhammad)) Allah says: give glad tidings, Muhammad, to the believers, who ward off penetrating their wives in their anus and further abstain from having sex with them when they are menstruating, that Paradise will be theirs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَنَّىٰ شِئْتُمْ } معناه كَيفَ شِئْتُمْ فِي المأتى ومِنْ حَيثُ يكونُ الوَلدُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"How do you want?\" means, how do you want in the future and from where will the child come?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ نِسَآؤُكُمْ } أيها المؤمنون { حَرْثٌ لَّكُمْ } أي: موضع حراثتكم ومحل إتيانكم { فَأْتُواْ حَرْثَكُمْ أَنَّىٰ شِئْتُمْ } مقبلين أو مدبرين\n روي أن اليهود كانوا يقولون: من جامع امرأته من جانب دبرها كان ولده أحول\n رد الله عليهم بهذه الآية { وَقَدِّمُواْ لأَنْفُسِكُمْ } أيها المستكشفون عن سرائر الأمور من الحكم والأسرار المودعة في التلذذ والنزول والانبعاث والشوق والانتعاش\n وأنواع الكيفيات المستحدثة عند الوقاع لإيجاد النسل وإبقاء النوع\n ولا تغفلوا عن سرائره\n ولا تطمئوا بمجرد قضاء الشهوة كالحيوانات العُجم { وَٱتَّقُواْ ٱللَّهَ } عن الخيانة والخباثة\n والإتيان إلى غير المآتي المأمورة في الشرع\n وغير ذلك من المحظورات المسقطة لحرمات الله الواقعة في أمر الجماع والاجتماع\n إذ هو منزلة إقدام أولي الأحلام من عظماء الأنام { وَٱعْلَمُوۤاْ أَنَّكُمْ } بأجمعكم { مُّلاَقُوهُ } سبحانه فتزودوا بزادٍ يليق بجانبه { وَبَشِّرِ } يا أكمل الرسل { ٱلْمُؤْمِنِينَ } [البقرة: 223] القائمين بحدود الله\n المحافظين عليها دائماً\n الخائفين من خشية الله\n الراجين من رحمة الله بأن لهم عند ربهم روضة الرضاء وجنة التسليم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { نساؤكم حرث لكم } \n أي: مواضع حرثكم\n شبه ما يلقى في أرحامهن من النطف\n بالبذر\n والأرحام أرض لها\n { فأتوا حرثكم } أي: محل حرثكم\n وهو الفرج\n { أنى شئتم } أي: من أي جهة شئتم\n رُوِيَ أن اليهود كانوا يقولون: مَنْ جامع امرأته مِنْ خَلْفهَا في قُبُلِهَا جَاء الولُد أَحْولَ\n فذُكر لرسول الله صلى الله عليه وسلم فنزلت\n وقيل: إنَّ قُريشاً كانوا يأتون النساء من قُدَّام\n مستلقية\n والأنصار كانوا يأتوهن من خلف\n باركة\n فتزوج رجل من المهاجرين امراة من الأنصار\n فأراد أن يفعل عادته\n فامتنعت\n وأرادت عادتها\n فاختصما إلى رسول الله صلى الله عليه وسلم\n فنزلت الآية بالتخيير للرجل\n مع الإتيان في المحل\n وأما الإتيان في الدُّبُر فحرام\n ملعونٌ فاعله\n وقال في القوت: { فأتوا حرثكم أنى شئتم } أي: في أي وقت شئتم\n ومن أي مكان شئتم\n مع اتحاد المحل\n هـ\n ثم حذَّر الحق تعالى من متابعة شهوة النساء\n والغفلة عن الله\n فقال: { وقدموا لأنفسكم } ما تجدون ثوابه مُدخراً عنده\n وهو ذكر الله في مظان الغفلة\n قيل: التسمية قبل الوطء وقيل: طلب الولد\n والتحقيق: أنه الحضور مع الحق عند هيجان الشهوة\n قال بعض العارفين: إني لا أغيب عن الله ولو في حالة الجماع\n\nهـ\n وهذا شأن أهل الجمع\n لا يفترقون عن الحضرة ساعة\n وهذه التقوى التي أمر الله بها بقوله: { واتقوا الله } أي: لا تغيبكم عنه شهوةُ النساء\n { واعلموا أنكم ملاقوه } فترون وبال الغفلة وجزاء اليقظة\n { وبشر المؤمنين } بالقرب من رب العالمين\n الإشارة: إذا سُئلت - أيها العارف - عن النفس في حال جنابتها بالغفلة\n وحال تلبسها بنجاسة حب الدنيا\n فقل: هي أذى\n أي: قذر ونجس\n من قَرُب منها لطَّخته بنجاستها\n فلا يحل القرب منه\n أو الصحبة معها\n حتى تطهر من جنابة الغفلة باليقظة\n ومن نجاسة حب الدنيا بالزهد\n ورفع الهمة عنها\n فإذا تطهرت فاتها\n وردها إلى حضرة مولاها\n كما أمرك الله\n { إن الله يحب التوابين } \n وقد تابت ورجعت إلى مولاها\n { ويحب المتطهرين } \n وقد تطهرت من جنابة الغفلة\n وتنزهت عن نجاسة الدنيا برفع الهمة\n فصارت لك أرضاً لزراعة حقوق العبودية\n ومَنْبَتا لبذر شهود عظمة الربوبية\n فأتوا حرثكم - أيها العارفون - أنى شئتم\n أي: ازرعوا في أرض نفوسكم من أوصاف العبودية ما شئتم\n وفي أي وقت شئتم\n فبقدر ما تزرعون من العبودية تحصدون من الحرية\n وبقدر ما تزرع فيها من الذل تحصده من العز\n وبقدر ما تزرع فيها من الفقر تحصده من الغنى\n وبقدر ما تزرع فيها من التواضع تحصده من الشرف والرفعة\n والحاصل: بقدر ما تزرع فيها من السفليات تحصد ضده من العلويات\n قال تعالى:\n[القصص: 5\n 6]\n فإذا تركتها هَمَلاً\n أنبتت لك الشوك والحنظل\n { وقدموا لأنفسكم } من أوصاف العبودية ما تجدونه أمامكم من مشاهدة الربوبية\n واتقوا الله فلا تشهدوا معه سواه\n واعلموا أنكم ملاقوه حين تغيبون عن وجودكم وتفقدونه\n وبشر المؤمنين الموقنين بشهود رب العالمين\n ولما تكلم الحقّ جلّ جلاله على بعض أحكام النكاح\n أراد أن يتكلم على الإيلاء\n وهو الحلف على عدم مس المرأة وجماعها\n وقدّم على ذلك النهي عن كثرة الحلف لأنه هو السبب في الوقوع في الإيلاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:63",
      "similarity": 0.6142413126462246
    },
    {
      "verse": "42:20",
      "similarity": 0.5095065879419658
    },
    {
      "verse": "6:138",
      "similarity": 0.35552439743202896
    },
    {
      "verse": "3:117",
      "similarity": 0.3375597546558207
    },
    {
      "verse": "3:47",
      "similarity": 0.30135106801126404
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002223.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002223.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:223.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}