{
  "chapter": "البقرة",
  "text": "ولا جناح عليكم فيما عرضتم به من خطبة النساء او اكننتم فى انفسكم علم الله انكم ستذكرونهن ولكن لا تواعدوهن سرا الا ان تقولوا۟ قولا معروفا ولا تعزموا۟ عقدة النكاح حتى يبلغ الكتب اجله واعلموا۟ ان الله يعلم ما فى انفسكم فاحذروه واعلموا۟ ان الله غفور حليم",
  "translations": [
    {
      "translation": "Nor is there anything wrong in any allusion to marriage you make to a woman, nor for any you keep to yourself. Allah knows that you will say things to them. But do not make secret arrangements with them, rather only speak with correctness and courtesy. Do not finally decide on the marriage contract until the prescribed period has come to its end. Know that Allah knows what is in your selves, so beware of Him! And know that Allah is Ever-Forgiving, All-Forbearing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm in proposing in secret to (any of) these women, or keeping the intention to yourself: God is aware that you will keep them in mind. Yet do not make a promise in secret, unless you speak in a manner that is proper; and do not resolve upon marriage till the fixed term of waiting is over. Remember that God knows what is in your hearts; so be fearful of Him, and remember that God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no offence if you make indirect proposal of marriage to widows during their waiting term or keep it concealed in your hearts: for Allah knows that you will naturally think of them. But be careful not to make any secret engagement. If you have to do anything, do it in an honourable way. And you should not settle anything finally about the marriage until the waiting term expires. Understand it well that Allah even knows what is hidden in your hearts; so fear Him. Also know that Allah is Lenient and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not a sin if you make an indirect marriage proposal or have such an intention in your hearts. God knows that you will cherish their memories in your hearts. Do not have secret dates unless you behave lawfully. Do not decide for a marriage before the appointed time is over. Know that God knows what is in your hearts. Have fear of Him and know that He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no sin on you if you propose marriage to women while they are hidden from your view, or hide it in your hearts; Allah knows that you will now remember them, but do not make secret pacts with women except by decent words recognised by Islamic law; and do not consummate the marriage until the written command reaches its completion; know well that Allah knows what is in your hearts, therefore fear Him; and know well that Allah is Oft Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no sin on you if you make a hint of betrothal or conceal it in yourself, Allah knows that you will remember them, but do not make a promise (of contract) with them in secret except that you speak an honorable saying. And do not be determined on the marriage bond until the term prescribed is fulfilled. And know that Allah knows what is in your minds, so fear Him. And know that Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no blame on you respecting that which you speak indirectly in the asking of (such) women in marriage or keep (the proposal) concealed within your minds; Allah knows that you will mention them, but do not give them a promise in secret unless you speak in a lawful manner, and do not confirm the marriage tie until the writing is fulfilled, and know that Allah knows what is in your minds, therefore beware of Him, and know that Allah is Forgiving, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no fault in you touching the proposal to women you offer, or hide in your hearts; God knows that you will be mindful of them; but do not make troth with them secretly without you speak honourable words. And do not resolve on the knot of marriage until the book has reached its term; and know that God knows what is in your hearts, so be fearful of Him; and know that God is All-forgiving, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin for you in that which ye proclaim or hide in your minds concerning your troth with women. Allah knoweth that ye will remember them. But plight not your troth with women except by uttering a recognised form of words. And do not consummate the marriage until (the term) prescribed is run. Know that Allah knoweth what is in your minds, so beware of Him; and know that Allah is Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be no offence for you to hint at a proposal of marriage [to divorced or widowed women] or to cherish them in your hearts. God knows that you will bear them in mind. But do not enter into any secret arrangement with them, beyond conveying some indication to them of your inclination. Do not proceed with tying the marriage-knot before the end of their waiting period. Know that God has knowledge of all your thoughts. Therefore, take heed and bear in mind that God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no blame is on you in that ye speak indirectly of your troth unto the said women or conceal it in, your souls! Allah knoweth that ye will anon make mention of these women: but make no promises unto them in secret, except ye speak a reputable saying. And even resolve not on wedding-knot until the prescribed term hath attained its end; and know that Allah knoweth that which is in your souls, wherefore beware of Him, and know that Allah is Forgiving, Forbearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin upon you in what you may hint in proposing to [recently widowed] women, or what you may secretly cherish within your hearts. Allah knows that you will be thinking of them, but do not make troth with them secretly, unless you say honourable words, and do not resolve on a marriage tie until the prescribed term is complete. Know that Allah knows what is in your hearts, so beware of Him; and know that Allah is all-forgiving, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on you if ye make an offer of betrothal or hold it in your hearts. Allah knows that ye cherish them in your hearts: But do not make a secret contract with them except in terms Honourable, nor resolve on the tie of marriage till the term prescribed is fulfilled. And know that Allah Knoweth what is in your hearts, and take heed of Him; and know that Allah is Oft-forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no sin on you if you make a hint of betrothal or conceal it in yourself, Allah knows that you will remember them, but do not make a promise of contract with them in secret except that you speak an honourable saying according to the Islamic law (e.g. you can say to her, \"If one finds a wife like you, he will be happy\"). And do not consummate the marriage until the term prescribed is fulfilled. And know that Allah knows what is in your minds, so fear Him. And know that Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No guilt shall be on you in the indication of an engagement to women or what you suppress in yourself. Allah knows that you will remember them; but do not promise them secretly unless you speak kind words (only of indication). And do not resolve on the knot of marriage until the writing has reached its term. And know that Allah knows what is in your hearts, so be cautious of Him. And know that Allah is the Forgiver, the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You commit no error by announcing your engagement to women, or by keeping it to yourselves. God knows that you will be thinking about them. But do not meet them secretly, unless you have something proper to say. And do not confirm the marriage tie until the writing is fulfilled. And know that God knows what is in your souls, so beware of Him. And know that God is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon you for that to which you [indirectly] allude concerning a proposal to women or for what you conceal within yourselves. Allah knows that you will have them in mind. But do not promise them secretly except for saying a proper saying. And do not determine to undertake a marriage contract until the decreed period reaches its end. And know that Allah knows what is within yourselves, so beware of Him. And know that Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:235] You would not be at fault regarding the proposal, with the intention of marriage, you present, offer, or hide in your hearts, during the waiting period, to women, whose spouses have died: such as men saying, ‘How beautiful you are!’, or, ‘Who could find one like you?’, or ‘How many a man must desire you!’. God knows that you will be mindful of them, in proposing to them impatiently, and so He has permitted you to make such offers; but do not make arrangements, of marriage, with them secretly, unless you speak honourable words, such as are acknowledged by the Law, in other words, such as proposals, that which is permitted to you. And do not resolve on the knot, the consummation, of marriage until that which is written, the period prescribed, has reached its term, and has been completed; and know that God knows what is in your souls, of resolve or otherwise; so be fearful of Him, that He should chastise you if you have made such resolve; and know that God is Forgiving, toward him who is fearful of Him, Forbearing, in delaying the chastisement of the one deserving it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على الجملة التي قبلها ، فهذا من الأحكام المتعلقة بالعدة ، وقد تضمنت الآيات التي قبلها أحكام عدة الطلاق وعدة الوفاة ، وأن أمد العدة محترم ، وأن المطلقات إذا بلغن أجلهن جاز أن يفعلن في أنفسهن ما أردن من المعروف ، فعلم من ذلك أنهن إذا لم يبلغنه لا يجوز ذلك فالتزوج في مدة الأجل حرام ، ولما كان التحدث في التزوج إنما يقصد منه المتحدث حصول الزواج ، وكان من عادتهم أن يتسابقوا إلى خطبة المعتدة ومواعدتها ، حرصاً على الاستئثار بها بعد انقضاء العدة فبينت الشريعة لهم تحريم ذلك ، ورخصت في شيء منه ولذلك عطف هذا الكلام على سابقه .والجناح الإثم وقد تقدم في قوله تعالى : فلا جناح عليه أن يطوف بهما { وَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُم بِهِ مِنْ خِطْبَةِ النسآء أَوْ أَكْنَنتُمْ فى أَنفُسِكُمْ عَلِمَ الله أَنَّكُمْ سَتَذْكُرُونَهُنَّ ولكن لاَّ تُوَاعِدُوهُنَّ سِرًّا إِلاَّ أَن تَقُولُواْ قَوْلاً مَّعْرُوفًا وَلاَ تَعْزِمُواْ عُقْدَةَ النكاح حتى يَبْلُغَ الكتاب أَجَلَهُ } \\[ البقرة : 158 \\] .وقوله : { ما عرضتم به } ما موصولة ، وما صْدَقها كلام ، أي كلام عرضتم به ، لأن التعريض يطلق على ضرب من ضروب المعاني المستفادة من الكلام ، وقد بينه بقوله : { من خطبة النساء } فدل على أن المراد كلام .ومادة فعَّل فيه دالة على الجعل مثل صوَّر ، مشتقة من العرض بضم العين وهو الجانب أي جعل كلامه بجانب ، والجانب هو الطرف ، فكأن المتكلم يحيد بكلامه من جادة المعنى إلى جانب . ونظير هذا قولهم جَنَبَه ، أي جعله في جانب . فالتعريض أن يريد المتكلم من كلامه شيئاً ، غير المدلول عليه بالتركيب وضعاً ، لمناسبة بين مدلول الكلام وبين الشيء المقصود ، مع قرينة على إرادة المعنى التعريضي ، فعلم ألا بد من مناسبة بين مدلول الكلام وبين الشيء المقصود ، وتلك المناسبة : إما ملازمة أو مماثلة ، وذلك كما يقول العافى لرجل كريم : جئت لأسلم عليك ولأنظر وجهك ، وقد عبر عن إرادتهم مثل هذا أمية بن أبي الصلت في قوله: ... إذَا أَثَنى عليكَ المرءُ يوماًكفاهُ عن تَعَرُّضه الثَّنَاء ... وجعل الطيبي منه قوله تعالى : { وإذا قال الله يا عيسى ابن مريم أأنت قلت للناس اتخذوني وأمي إلهين من دون الله } \\[ المائدة : 116 \\] . فالمعنى التعريضي في مثل هذا حاصل من الملازمة ، وكقول القائل «المسلم من سلم المسلمون من لسانه» في حضرة من عرف بأذى الناس ، فالمعنى التعريضي حاصل من علم الناس بمماثلة حال الشخص المقصود للحالة التي ورد فيها معنى الكلام ، ولما كانت المماثلة شبيهة بالملازمة لأن حضور المماثل في الذهن يقارن حضور مثيله صح أن نقول إن المعنى التعريضي بالنسبة إلى المركبات شبيه بالمعنى الكنائي بالنسبة إلى دلالة الألفاظ المفردة ، وإن شئت قلت : المعنى التعريضي من قبيل الكناية بالمركب فخص باسم التعريض كما أن المعنى الكنائي من قبيل الكناية باللفظ المفرد ، وعلى هذا فالتعريض من مستتبعات التراكيب ، وهذا هو الملاقى لما درج عليه صاحب «الكشاف» في هذا المقام ، فالتعريض عنده مغاير للكناية من هذه الجهة وإن كان شبيهاً بها ، ولذلك احتاج إلى الإشارة إلى الفرق بينهما ، فالنسبة بينهما عنده التباين .وأما السكاكي فقد جعل بعض التعريض من الكناية وهو الأصوب ، فصارت النسبة بينهما العموم والخصوص الوجهي ، وقد حمل الطيبي والتفتازاني كلام «الكشاف» على هذا ، ولا إخاله يتحمله .وإذ قد تبين لك معنى التعريض ، وعلمت حد الفرق بينه وبين الصريح فأمثلة التعريض والتصريح لا تخفى ، ولكن فيما أثر من بعض تلك الألفاظ إشكال لا ينبغي الإغضاء عنه في تفسير هذه الآية .إن المعرض بالخطبة تعريضه قد يريده لنفسه وقد يريده لغيره بوساطته ، وبين الحالتين فرق ينبغي أن يكون الحكم في المتشابه من التعريض ، فقد روي أن النبي صلى الله عليه وسلم قال لفاطمة ابنة قيس ، وهي في عدتها من طلاق زوجها عمرو بن حفص آخر الثلاث «كوني عند أم شريك ولا تسبقيني بنفسك» أي لا تستبدي بالتزوج قبل استئذاني وفي رواية «فإذا حللت فآذنيين» وبعد انقضاء عدتها خطبها لأسامة بن زيد ، فهذا قول لا خطبة فيه وإرادة المشورة فيه واضحة .ووقع في «الموطأ» : أن القاسم بن محمد كان يقول في قوله تعالى : { ولا جناح عليكم فيما عرضتم به من خطبة النساء } أن يقول الرجل للمرأة وهي في عدتها من وفاة زوجها : «إنك عليَّ لكريمة وإني فيك لراغب» .فأما إنك عليَّ لكريمة فقريب من صريح إرادة التزوج بها وما هو بصريح ، فإذا لم تعقبه مواعدة من أحدهما فأمره محتمل ، وأما قوله إني فيك لراغب فهو بمنزلة صريح الخطبة وأمره مشكل ، وقد أشار ابن الحاجب إلى إشكاله بقوله : «قالوا ومثل إني فيك لراغب أكثر هذه الكلمات تصريحاً فينبغي ترك مثله» ويذكر عن محمد الباقر أن النبي صلى الله عليه وسلم عرض لأم سلمة في عدتها من وفاة أبي سلمة ، ولا أحسب ما روي عنه صحيحاً .وفي «تفسير ابن عرفة» : «قيل إن شيخنا محمد بن أحمد بن حيدرة كان يقول : «إذا كان التعريض من أحد الجانبين فقط وأما إذا وقع التعريض منهما فظاهر المذهب أنه كصريح المواعدة» .ولفظ النساء عام لكن خص منه ذوات الأزواج ، بدليل العقل ويخص منه المطلقات الرجعيات بدليل القياس ودليل الإجماع ، لأن الرجعية لها حكم الزوجة بإلغاء الفارق ، وحكى القرطبي الإجماع على منع خطبة المطلقة الرجعية في عدتها ، وحكى ابن عبد السلام عن مذهب مالك جواز التعريض لكل معتدة : من وفاة أو طلاق ، وهو يخالف كلام القرطبي ، والمسألة محتملة لأن للطلاق الرجعي شائبتين ، وأجاز الشافعي التعريض في المعتدة بعد وفاة ومنعه في عدة الطلاق ، وهو ظاهر ما حكاه في «الموطأ» عن القاسم بن محمد .وقوله : { أو أكننتم في أنفسكم } الإكنان الإخفاء . وفائدة عطف الإكنان على التعريض في نفي الجناح ، مع ظهور أن التعريض لا يكون إلاّ عن عزم في النفس ، فنفي الجناح عن عزم النفس المجرد ضروري من نفي الجناح عن التعريض ، أنَّ المراد التنبيه على أن العزم أمر لا يمكن دفعه ولا النهي عنه ، فلما كان كذلك ، وكان تكلم العازم بما عزم عليه جبلة في البشر ، لضعف الصبر على الكتمان ، بين الله موضع الرخصة أنه الرحمة بالناس ، مع الإبقاء على احترام حالة العدة ، مع بيان علة هذا الترخيص ، وأنه يرجع إلى نفي الحرج ، ففيه حكمة هذا التشريع الذي لم يبين لهم من قبل .وأخر الإكنان في الذكر للتنبيه على أنه أفضل وأبقى على ما للعدة من حرمة ، مع التنبيه على أنه نادر وقوعه ، لأنه لو قدمه لكان الانتقال من ذكر الإكنان إلى ذكر التعريض جارياً على مقتضى ظاهر نظم الكلام في أن يكون اللاَّحق زائد المعنى على ما يشمله الكلام السابق ، فلم يتفطن السامع لهذه النكتة ، فلما خولف مقتضى الظاهر علم السامع أن هذه المخالفة ترمي إلى غرض ، كما هو شأن البليغ في مخالفة مقتضى الظاهر ، وقد زاد ذلك إيضاحاً بقوله عقبه : { علم الله أنكم ستذكرونهن } أي علم أنكم لا تستطيعون كتمان ما في أنفسكم ، فأباح لكم التعريض تيسيراً عليكم ، فحصل بتأخير ذكر { أو أكنتم } فائدة أخرى وهي التمهيد لقوله : { علم الله أنكم ستذكرونهن } وجاء النظم بديعاً معجزاً ، ولقد أهمل معظم المفسرين التعرض لفائدة هذا العطف ، وحاول الفخر توجيهه بما لا ينثلج له الصدر ووجهه ابن عرفة بما هو أقرب من توجيه الفخر ، ولكنه لا تطمئن له نفس البليغ .فقوله : { ولكن لا تواعدوهن سراً } استدراك دل عليه الكلام ، أي علم الله أنكم ستذكرونهن صراحة وتعريضاً؛ إذ لا يخلو ذو عزم من ذكر ما عزم عليه بأحد الطريقين ، ولما كان ذكر العلم في مثل هذا الموضع كناية عن الإذن كما تقول : علمت أنك تفعل كذا تريد : إني لا أؤاخذك لأنك لو كنت تؤاخذه ، وقد علمت فعله ، لآخذته كما قال : { علم الله أنكم كنت تختانون أنفسكم فتاب عليكم وعفا عنكم } \\[ البقرة : 187 \\] هذا أظهر ما فسر به هذا الاستدراك وقيل : هذا استدراك على كلام محذوف أي فاذكروهن ولكن لا تواعدوهن ، أي لا تصرحوا وتواعدوهن ، أي تعدوهن ويعدنكم بالتزوج .والسر أصله ما قابل الجهر ، وكنى به عن قربان المرأة قال الأعشى: ... ولا تقربنَّ جارة إنَّ سِرَّهاعليك حرام فانكحن أو تأبدوا ... وقال امرؤ القيس: ... ألا زعمتْ بسباسَةُ الحي أننيكبرْتُ وأن لا يحسن السر أمثالي ...والظاهر أن المراد به في هاته الآية حقيقته ، فيكون { سراً } منصوباً على الوصف لمفعول مطلق أي وعداً صريحاً سراً ، أي لا تكتموا المواعدة ، وهذا مبالغة في تجنب مواعدة صريح الخطبة في العدة .وقوله : { إلا أن تقولوا قولاً معروفاً } استثناء من المفعول المطلق أي إلا وعداً معروفاً ، وهو التعريض الذي سبق في قوله : { فيما عرضتم به } فإن القول المعروف من أنواع الوعد إلا أنه غير صريح ، وإذا كان النهي عن المواعدة سراً ، علم النهي عن لمواعدة جهراً بالأولى ، والاستثناء على هذا في قوله : { إلا أن تقولوا قولاً معروفاً } متصل ، والقول المعروف هو المأذون فيه ، وهو التعريض ، فهو تأكيد لقوله : { ولا جناح عليكم فيما عرضتم به } الآية .وقيل : المراد بالسر هنا كناية ، أي لا تواعدوهن قرباناً ، وكنى به عن النكاح أي الوعد الصريح بالنكاح ، فيكون { سراً } مفعولاً به لتواعدوهن ، ويكون الاستثناء منقطعاً ، لأن القول ليس من أنواع النكاح ، إذ النكاح عقد بإيجاب وقبول ، والقول خطبة : صراحة أو تعريضاً وهذا بعيد : لأن فيه كناية على كناية ، وقيل غير ذلك مما لا ينبغي التعريج عليه ، فإن قلتم حظر : صريح الخطبة والمواعدة ، وإباحة التعريض بذلك يلوح بصور التعارض ، فإن مآل التصريح والتعريض واحد ، فإذا كان قد حصل بين الخاطب والمعتدة العلم بأنه يخطبها وبأنها توافقه ، فما فائدة تعلق التحريم والتحليل بالألفاظ والأساليب ، إن كان المفاد واحداً قلت : قصد الشارع من هذا حماية أن يكون التعجل ذريعة إلى الوقوع فيما يعطل حكمة العدة ، إذ لعل الخوض في ذلك يتخطى إلى باعث تعجل الراغب إلى عقد النكاح على المعتدة بالبناء بها؛ فإن دبيب الرغبة يوقع في الشهوة ، والمكاشفة تزيل ساتر الحياء فإن من الوازع الطبيعي الحياء الموجود في الرجل ، حينما يقصد مكاشفة المرأة بشيء من رغبته فيها ، والحياء في المرأة أشد حينما يواجهها بذلك الرجل ، وحينما تقصد إجابته لما يطلب منها ، فالتعريض أسلوب من أساليب الكلام يؤذن بما لصاحبه من وقار الحياء فهو يقبض عن التدرج إلى ما نهي عنه ، وإيذانه بهذا الاستحياء يزيد ما طبعت عليه المرأة من الحياء فتنقبض نفسها عن صريح الإجابة ، بله المواعدة فيبقى حجاب الحياء مسدولاً بينهما وبرقع المروءة غير منضى وذلك من توفير شأن العدة فلذلك رخص في التعريض تيسيراً على الناس ، ومنع التصريح إبقاء على حرمات العدة .وقوله : { ولا تعزموا عقدة النكاح } العزم هنا عقد النكاح لا التصميم على العقد ، ولهذا فعقدة النكاح منصوب على المفعول به ، والمعنى : لا تعقدوا عقدة النكاح ، أخذ من العزم بمعنى القطع والبت ، قاله النحاس وغيره ، ولك أن تجعله بمعناه المشهور أي لا تصمموا على عقدة النكاح ، ونهي عن التصميم لأنه إذا وقع وقع ما صمم عليه . وقيل : نهى عن العزم مبالغة ، والمراد النهي عن المعزوم عليه ، مثل النهي من الاقتراب في قوله :{ تلك حدود الله فلا تقربوها } \\[ البقرة : 187 \\] وعلى هذين الوجهين فعقدة النكاح منصوب على نزع الخافض ، كقولهم ضربة الظهر والبطن ، وقيل ضمن عزم معنى أبرم قاله صاحب «المغني» في الباب الثامن .والكتاب هنا بمعنى المكتوب أي المفروض من الله وهو العدة المذكورة بالتعريف للعهد .والأجل المدة المعينة لعمل ما ، والمراد به هنا مدة العدة المعينة بتمام ، كما أشار إليه قوله : { فإذا بلغن أجلهن } \\[ البقرة : 234 \\] آنفاً .والآية صريحة في النهي عن النكاح في العدة وفي تحريم الخطبة في العدة وفي إباحة التعريض .فأما النكاح أي عقده في العدة ، فهو إذا وقع ولم يقع بناء بها في العدة فالنكاح مفسوخ اتفاقاً ، وإنما اختلفوا هل يتأبد به تحريم المرأة على العاقد أو لا؟ فالجمهور على أنه لا يتأبد ، وهو قول عمر بن الخطاب ، ورواية ابن القاسم عن مالك في «المدونة» ، وحكى ابن الجلاب عن مالك رواية أنه يتأبد ، ولا يعرف مثله عن غير مالك .وأما الدخول في العدة ففيه الفسخ اتفاقاً ، واختلف في تأبيد تحريمها عليه فقال عمر بن الخطاب ومالك والليث والأوزاعي وأحمد بن حنبل بتأبد تحريمها عليه ، ولا دليل لهم على ذلك إلا أنهم بنوه على أصل المعاملة بنقيض المقصود الفاسد ، وهو أصل ضعيف ، وقال علي وابن مسعود وأبو حنيفة والثوري والشافعي : بفسخ النكاح ولا يتأبد التحريم ، وهو بعد العدة خاطب من الخطاب ، وقد قيل : إن عمر رجع إليه وهو الأصح ، وعلى الزوج مهرها بما استحل منها ، وقد تزوج رويشد الثقفي طليحة الأسدية في عدتها ففرق عمر بينهما وجعل مهرها على بيت المال ، فبلغ ذلك علياً فقال : «يرحم الله أمير المؤمنين ما بال الصداق وبيت المال ، إنما جهلا فينبغي للإمام أن يردهما للسنة» قيل له : «فما تقول أنت»؟ قال : «لها الصداق بما استحل منها ويفرق بينهما ولا جلد عليهما» واستحسن المتأخرون من فقهاء المالكية للقاضي إذا حكم بفسخ نكاح الناكح في العدة ألا يتعرض في حكمه للحكم بتأبيد تحريمها ، لأنه لم يقع التنازع في شأنه لديه ، فينبغي له أن يترك التعريج عليه ، لعلهما أن يأخذا بقول من لا يرون تأبيد التحريم .وأما الخطبة في العدة والمواعدة فحرام مواجهة المرأة بها ، وكذلك مواجهة الأب في ابنته البكر ، وأما مواجهة ولي غير مجبر فالكراهة ، فإذا لم يقع البناء في العدة بل بعدها ، فقال مالك : يفرق بينهما بطلقة ولا يتأبد تحريمها ، وروى عنه ابن وهب : فراقها أحب إليَّ ، وقال الشافعي : الخطبة حرام ، والنكاح الواقع بعد العدة صحيح .{ واعلموا أَنَّ الله يَعْلَمُ مَا فى أَنفُسِكُمْ فاحذروه واعلموا أَنَّ الله غَفُورٌ حَلِيمٌ }عطف على الكلام السابق في قوله : { ولا جناح عليكم فيما عرضتم به من خطبة النساء } إلى قوله : { حتى يبلغ الكتاب أجله } وابتدىء الخطاب باعلموا لما أريد قطع هواجس التساهل والتأول ، في هذا الشأن ، ليأتي الناس ما شرع الله لهم عن صفاء سريرة من كل دخل وحيلة ، وقدم تقدم نظيره في قوله :{ واعلموا أنكم ملاقوه } \\[ البقرة : 223 \\] .وقوله : { واعلموا أن الله غفور حليم } تذييل ، أي فكما يؤاخذكم على ما تضمرون من المخالفة يغفر لكم ما وعد بالمغفرة عنه كالتعريض لأنه حليم بكم ، وهذا دليل على أن إباحة التعريض رخصة كما قدمنا ، وأن الذريعة تقتضي تحريمه ، لولا أن الله علم مشقة تحريمه على الناس للوجوه التي قدمناها ، فلعل المراد من المغفرة هنا التجاوز لا مغفرة الذنب؛ لأن التعريض ليس بإثم ، أو يراد به المعنى الأعم الشامل لمغفرة الذنب والتجاوز عن المشاق ، وشأن التذييل التعميم .\n\n",
      "translations": [
        {
          "translation": "(There is no sin on you) there is no harm in talking (in that which ye proclaim or hide in your mind concerning your troth with women) concerning your offer to the woman whose husband is dead, before the waiting period ends, that you desire to marry her after the waiting period, such as saying to her: \"If Allah unites us lawfully, I would like that\". (Allah knoweth that you will remember them) remember marrying them. (But plight not your troth with them) to have sexual intercourse with them (except by uttering a recognised form of words) properly and unequivocally by saying for example: \"If Allah unites us lawfully, I would like that\", and no more. (And do not consummate the marriage until (the term) prescribed is run) until the waiting period comes to an end. (And know that Allah knoweth what is in your minds) in your hearts whether you are going to honour your pledge or not, (so beware of Him) beware of contravening Him; (and know that Allah is Forgiving) of those who repent of transgressing against Him, (Clement) since He does not hasten His punishment upon those who transgress against Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَـٰكِن لاَّ تُوَاعِدُوهُنَّ سِرّاً } معناهُ نِكَاحٌ، والسِّرُ: الزِّنَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"But do not promise them secretly\" means marriage, and the secret is adultery.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ جُنَاحَ عَلَيْكُمْ } أيها المؤمنون { فِيمَا } أي: في كلام وألفاظ { عَرَّضْتُمْ بِهِ } تعريضاً حسناً وتلميحاً مليحاً خالياً عن ومصة الفساد\n ناشئاً { مِنْ } إرادة { خِطْبَةِ ٱلنِّسَآءِ } المعتادت للوفاة { أَوْ أَكْنَنتُمْ } أضمرتم وأخفيتم { فِيۤ أَنْفُسِكُمْ } إذ { عَلِمَ ٱللَّهُ } منكم وإن أخفيتم { أَنَّكُمْ } يميل طبيعتكم إليهن { سَتَذْكُرُونَهُنَّ } فاذكروهن على الوجه الأحسن ألابعد عن التهمة { وَلَـٰكِن لاَّ تُوَاعِدُوهُنَّ سِرّاً } أي: الوقاع والجماع\n أي: لا تخالطوا معهن إلى حيث يرتفع الحجاب عنكم\n فتتكلمون معهن بالكلمات التي جرت بين الزوج والزوجة { إِلاَّ أَن تَقُولُواْ قَوْلاً مَّعْرُوفاً } يومئ إلى خطبتكم إياهن إن خفتم أن يسبق عليكم الغير من الخطباء { وَ } عليكم أن { لاَ تَعْزِمُوۤاْ عُقْدَةَ ٱلنِّكَاحِ } أي: لا تستعجلوا في العزيمة على العقد { حَتَّىٰ يَبْلُغَ ٱلْكِتَابُ أَجَلَهُ } أي: ما فرض في الكتاب\n أي: من العدة المقدرة فيه { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ } المطلع لضمائركم { يَعْلَمُ مَا فِيۤ أَنْفُسِكُمْ } من الخيانة في حدوده { فَٱحْذَرُوهُ } لتنجوا من غضبه { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ غَفُورٌ } لمن عزم المعصية ولم يفعل { حَلِيمٌ } [البقرة: 235] لا يستعجل بالعقوبة على العاصين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا جناح عليكم } أيها الخُطَّاب { فيما عرَّضتم به } للمعتدات { من خطبة النساء } كقول الرجل: إني لراغب في صحبتكم\n وإني أريد أن أتزوج في هذه الساعة\n وإنك لنافقة\n أو لا يصلح لك أن تبقى بلا زوج\n ونحو هذا\n { أو أكننتم } أي: أضمرتم { في أنفسكم } في زمن العدة من أمر التزوج دون تصريح\n { علم الله أنكم } ستذكرون النساء المعتدات\n وتتكلمون في نكاحهن\n حرصاً وتمنياً\n فعرّضُوا بذلك\n { ولكن لا تواعدوهن سرّاً } أي: في الخلوة\n أو لا تواعدوهن نكاحاً أو جماعاً\n { إلا أن تقولوا قولاً معروفاً } وهو التعريض بالألفاظ المتقدمة\n ولا تقطعوا { عقدة النكاح } \n وتعزموا على فعله { حتى يبلغ } كتاب المعتدة { أجله } \n وتنقضي العدة\n { واعملوا أن الله يعلم ما في أنفسكم } من الرغبة والحرص\n { فاحذروه } فإنَّ الحرص على الشيء\n والرغبة فيه\n قبل أوانه\n ربما يعاقب صاحبه بحرمانه\n وما قُدِّر لكَ لا يكون لغيرك\n وما كان لغيرك لا يكون لك\n ولو فعلت ما فعلت\n { واعلموا أن الله غفور } لِمَا استعجلتم فإن الإنسان خُلق عجولاً\n { حليم } فلا يعاجلكم ولا يفضح سرائركم\n الإشارة: إذا ماتت النفس عن الهوى\n وتركت حظوظاً وشهوات\n فلا ينبغي أن يردها إلى ذلك حتى تتربص مدة\n فيظهر عليها آثارُ الزهد من السكون إلى الله\n والتأنس بمشاهدة الله حتى تغيب عما سواه\n فإذا بلغت هذا الوصف فلا جناح على المريد أن يسعفها فيما تفعل بالمعروف\n من غير سَرَفٍ ولا ميل إلى هوى\n لأن فعلها حينئذٍ بالله\n ومن الله\n وإلى الله\n { والله بما تعملون خبير } لا يخفى عليه شيء من أمرها\n ولا جناح عليكم\n أيها المريدون\n إن تزكت نفوسكم\nوطهرت من الأغيار قلوبكم\n فيما عرضتم به من خطبة أبكار الحقائق وثيبات العلوم\n أو أكننتم في أنفسكم من المعارف والفهوم\n علم الله أنكم ستذكرون ذلك باللسان قبل أن يصل الذوق إلى الجَنَان\n فلا تصرحوا بعلوم الحقائق مع كل الخلائق فإن ذلك من فعل الزنادق\n إلا أن تقولوا قولاً معروفاً\n إشارة أو تلويحاً\n فعلمنا كله إشارة\n فإذا صار عبارة خفي\n ولا تطلبوا علم الحقائق قبل بلوغ أجله\n وهو موت النفوس\n والزهد في الفلوس\n وكمال التربية\n وتمام التصفية\n { واعملوا أن الله يعلم ما في أنفسكم } من الشرة إليها قبل أوانها\n { فاحذروه } أن يعاقبكم بحرمانها\n { واعلموا أن الله غفور حليم } لا يعاجلكم بحرمان قصدكم\n إن صح مقصدكم\n والله تعالى أعلم\n وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:237",
      "similarity": 0.30030769100311355
    },
    {
      "verse": "20:27",
      "similarity": 0.2914932883748599
    },
    {
      "verse": "4:33",
      "similarity": 0.27858731064273484
    },
    {
      "verse": "47:21",
      "similarity": 0.27497840233466214
    },
    {
      "verse": "42:43",
      "similarity": 0.2569667122361789
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002235.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002235.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:235.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}