{
  "chapter": "البقرة",
  "text": "وقال لهم نبيهم ان الله قد بعث لكم طالوت ملكا قالوا۟ انى يكون له الملك علينا ونحن احق بالملك منه ولم يؤت سعة من المال قال ان الله اصطفىه عليكم وزاده بسطة فى العلم والجسم والله يؤتى ملكه من يشاء والله وسع عليم",
  "translations": [
    {
      "translation": "Their Prophet said to them, 'Allah has appointed Saul to be your king.' They said, 'How can he have kingship over us when we have much more right to kingship than he does? He has not even much wealth!' He said, 'Allah has chosen him over you and increased him greatly in knowledge and physical strength. Allah gives kingship to anyone He wills. Allah is All-Encompassing, All-Knowing.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their prophet said to them: \"God has raised Saul king over you,\" they said: \"How can he be king over us when we have greater right to kingship than he, for he does not even possess abundant wealth?\" \"God has chosen him in preference to you,\" said the prophet \"and given him much more wisdom and prowess; and God gives authority to whomsoever He will: God is infinite and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet said to them, \"Allah has appointed Saul to be king over you.\" Hearing this, they replied, \"How has he been entitled to become king over us? We have a better right to kingship than he, for he does not even possess enough riches.\" The Prophet replied, \"Allah has preferred him to you and blessed him with abundant powers of mind and body. And Allah has the power to give His kingdom to whomever He wills: Allah is All-Embracing, All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet said, \"God has appointed Saul as a king for you.\" They replied, \"How can he dominate us when we deserve more to be king than he. Besides, he does not have abundant wealth.\" Their Prophet said, \"God has chosen him as your ruler and has given him physical power and knowledge. God grants His authority to anyone whom He wants. God is Provident and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet said to them, “Indeed Allah has sent Talut (Saul) as your king”; they said, “Why should he have kingship over us whereas we deserve the kingship more than he, and nor has he been given enough wealth?” He said, “Indeed Allah has chosen him above you, and has bestowed him with vast knowledge and physique”; and Allah may bestow His kingdom on whomever He wills; and Allah is Most Capable, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet said to them, \"Indeed Allah has appointed Talut (Saul) as a king over you.\" They said, \"How can he be a king over us when we are fitter than him for the kingdom, and he has not been given enough wealth.\" He said: \"Verily, Allah has chosen him above you and has increased him abundantly in knowledge and stature. And Allah grants His kingdom to whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prophet said to them: Surely Allah has raised Talut to be a king over you. They said: How can he hold kingship over us while we have a greater right to kingship than he, and he has not been granted an abundance of wealth? He said: Surely Allah has chosen him in preference to you, and He has increased him abundantly in knowledge and physique, and Allah grants His kingdom to whom He pleases, and Allah is Amplegiving, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their Prophet said to them, 'Verily God has raised up Saul for you as king.' They said, 'How should he be king over us who have better right than he to kingship, seeing he has not been given amplitude of wealth?' He said, 'God has chosen him over you, and has increased him broadly in knowledge and body. God gives the kingship to whom He will; and God is All-embracing, All-knowing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet said unto them: Lo! Allah hath raised up Saul to be a king for you. They said: How can he have kingdom over us when we are more deserving of the kingdom than he is, since he hath not been given wealth enough? He said: Lo! Allah hath chosen him above you, and hath increased him abundantly in wisdom and stature. Allah bestoweth His Sovereignty on whom He will. Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prophet said to them, \"God has now appointed Talut to be your king.\" But they replied, \"How can he be king over us when we are worthier of kingship than he and he has not even been granted an abundance of wealth?\" He said, \"God has chosen him over you, and has given him great knowledge and physique. God grants kingship to whoever He pleases: God is magnanimous and all knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prophet said unto them: verily Allah hath raised unto you Talut as a king. They said: how can there be the dominion for him over us, whereas we are more worthy of the dominion than he nor hath he been vouchsafed an amplitude of wealth! He said: verily Allah hath chosen him over you and hath increased him amply in knowledge and physique, and Allah vouchsafeth His dominion unto whomsoever He listeth; and Allah is Bountiful, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prophet said to them, ‘Allah has appointed Saul as king for you.’ They said, ‘How can he have kingship over us, when we have a greater right to kingship than him, as he has not been given ample wealth?’ He said, ‘Indeed Allah has chosen him over you, and enhanced him vastly in knowledge and physique, and Allah gives His kingdom to whomever He wishes, and Allah is all-bounteous, all-knowing.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet said to them: \"Allah hath appointed Talut as king over you.\" They said: \"How can he exercise authority over us when we are better fitted than he to exercise authority, and he is not even gifted, with wealth in abundance?\" He said: \"Allah hath Chosen him above you, and hath gifted him abundantly with knowledge and bodily prowess: Allah Granteth His authority to whom He pleaseth. Allah careth for all, and He knoweth all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet (Samuel) said to them, \"Indeed Allah has appointed Talut (Saul) as a king over you.\" They said, \"How can he be a king over us when we are better fitted than him for the kingdom, and he has not been given enough wealth.\" He said: \"Verily, Allah has chosen him above you and has increased him abundantly in knowledge and stature. And Allah grants His Kingdom to whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet said to them: 'Allah has raised Saul to be your king' But they replied: 'Should he be given the kingship over us, when we are more deserving of it than he and he has not been given abundant wealth' He said: 'Allah has chosen him over you and increased him with amplitude in knowledge and body. Allah gives His kingship to whom He will. Allah is the Embracer, the Knower'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prophet said to them, “God has appointed Saul to be your king.” They said, “How can he have authority over us, when we are more worthy of authority than he, and he was not given plenty of wealth?” He said, “God has chosen him over you, and has increased him in knowledge and stature.” God bestows His sovereignty upon whomever He wills. God is Embracing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prophet said to them, \"Indeed, Allah has sent to you Saul as a king.\" They said, \"How can he have kingship over us while we are more worthy of kingship than him and he has not been given any measure of wealth?\" He said, \"Indeed, Allah has chosen him over you and has increased him abundantly in knowledge and stature. And Allah gives His sovereignty to whom He wills. And Allah is all-Encompassing [in favor] and Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:247] Then their prophet said to them, ‘Verily God has raised up Saul for you as king’ They said, ‘How can he be king over us when we have better right than he to kingship, since he is not of the tribe of monarchs or that of prophets; he [Saul] was a tanner or a shepherd; seeing he has not been given amplitude of wealth?’ which he can use to establish a kingdom. He, the prophet, said, to them, ‘God has chosen him over you, for kingship, and has increased him broadly, amply, in knowledge and body: at that time, he was the most knowledgeable and the most handsome of all the Children of Israel, and the most perfect of character. God gives the kingship to whom He will, in the way He does, and there can be no objection; and God is Embracing, in His bounty, Knowing, of those who deserve it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأعاد الفعل في قوله : { وقال لهم نبيهم } للدلالة على أن كلامه هذا ليس من بقية كلامه الأول ، بل هو حديث آخر متأخر عنه وذلك أنه بعد أن حذرهم عواقب الحكومة الملكية وحذرهم التولي عن القتال ، تكلم معهم كلاماً آخَرَ في وقت آخر .وتأكيدُ الخبر بإنَّ إيذان بأن من شأن هذا الخبر أن يُتلقى بالاستغراب والشك ، كما أنبأ عنه قولهم : { أنى يكون له الملك علينا } .ووقع في سفر صمويل في الإصحاح التاسع أنه لما صمم بنو إسرائيل في سؤالهم أن يعين لهم مِلكاً ، صلى لله تعالى فأوحى الله إليه أنْ أجبْهم إلى كل ما طلبوه ، فأجابهم وقال لهم : اذهبوا إلى مدنكم ، ثم أوحى الله إليه صفة الملك الذي سيعينه لهم ، وأَنه لقيه رجل من بنيامين اسمه شَاول بن قيس ، فوجد فيه الصفة وهي أنه أطول القوم ، ومسَحَهُ صمويلُ ملكاً على إسرائيل ، إذْ صب على رأسه زيتاً ، وقبَّله وجمع بني إسرائيل بعد أيام في بلد المصفاة وأحضره وعينه لهم ملكاً ، وذلك سنة 1095 قبل المسيح .وهذا الملك هو الذي سمي في الآية طالوت وهو شاول وطالوت لقبهُ ، وهو وزن اسم مصدر من الطول ، على وزن فعَلُوت مثل جَبَروت ومَلكوت ورَهَبوت ورغَبوت ورحموت ، ومنه طاغوت أصله طَغَيُوت فوقع فيه قلب مكاني ، وطالوت وصف به للمبالغة في طول قامته ، ولعله جعل لقباً له في القرآن للإِشارة إلى الصفة التي عرف بها لصمويل في الوحي الذي أوحى الله إليه كما تقدم ، ولمراعاة التنظير بينه وبين جالوت غريمه في الحرب ، أو كان ذلك لقباً له في قومه قبلَ أن يؤتى الملك ، وإنما يلقب بأمثال هذا اللقب من كان من العموم . ووزن فَعَلوت وزن نادر في العربية ولعله من بقايا العربية القديمة السامية ، وهذا هو الذي يؤذن به منعه من الصرف ، فإن منعه من الصرف لا علة له إلاّ العلمية والعجمة ، وجزم الراغب بأنه اسم عجمي ولم يُذكر في كتب اللغة لذلك ولعله عومل معاملة الاسم العجمي لمَّا جُعل علماً على هذا العَجمي في العربية ، فعُجمته عارضة وليس هو عجمياً بالأصالة ، لأنه لم يعرف هذا الاسم في لغة العبرانيين كداوود وشاوول ، ويجوز أن يكون منعه من الصرف لمصيره بالإبدال إلى شبه وزن فاعُول ، ووزنُ فاعول في الأعلام عجمي ، مثل هاروت وماروت وشاوول وداوود ، ولذلك منعوا قابوس من الصرف ، ولم يعتدوا باشتقاقه من القبس ، وكأنَّ عدول القرآن عن ذكره باسمه شاول لثقل هذا اللفظ وخفة طالوت .وأَنَّى في قوله : { أنى يكون له الملك علينا } بمعنى كيف ، وهو استفهام مستعمل في التعجب ، تعجبوا من جعل مِثله ملكاً ، وكان رجلاً فلاحاً من بيت حقير ، إلاّ أنه كان شجاعاً ، وكان أطول القوم ، ولما اختاره صمويل لذلك ، فتح الله عليه بالحكمة ، وتنبأ نبوءات كثيرة ، ورضيت به بعض إسرائيل ، وأباه بعضهم ، ففي سفر صمويل أن الذين لم يرضَوا به هم بنو بليعال والقرآن ذكر أن بني إسرائيل قالوا : أنى يكون له الملك علينا وهو الحق؛ لأنهم لا بد أن يكونوا قد ظنوا أن مَلكهم سيكون من كبرائهم وقوادهم .والسر في اختيار نبيئهم لهم هذا الملك أنه أراد أن تبقى لهم حالتهم الشورية بقدر الإمكان ، فجعل مَلِكهم من عامتهم لا من سادتهم ، لتكون قدمه في الملك غير راسخة ، فلا يخشى منه أن يشتد في استعباد أمته ، لأن الملوك في ابتداء تأسيس الدول يكونون أقرب إلى الخير لأنهم لم يعتادوا عظمة الملك ولم ينسوا مساواتَهم لأمثالهم ، وما يزالون يتوقعون الخلع ، ولهذا كانت الخلافة سُنَّةَ الإسلام ، وكانت الوراثة مبدأ الملك في الإسلام ، إذ عهد معاوية ابن أبي سفيان لابنه يزيد بالخلافة بعده ، والظن به أنه لم يكن يسعه يومئذٍ إلاّ ذلك؛ لأن شيعة بني أمية راغبون فيه ، ثم كانت قاعدة الوراثة للملك في دول الإسلام وهي من تقاليد الدول من أقدم عصور التاريخ ، وهي سنة سيئة ولهذا تجد مؤسسي الدول أفضل ملوك عائلاتهم ، وقواد بني إسرائيل لم يتفطنوا لهذه الحكمة لقصر أنظارهم ، وإنما نظروا إلى قلة جدته ، فتوهموا ذلك مانعاً من تمليكه عليهم ، ولم يعلموا أن الاعتبار بالخلال النفسانية ، وأن الغنى غنى النفس لا وفرة المال وماذا تجدي وفرته إذا لم يكن ينفقه في المصالح ، وقد قال الراجز: ... قدني من نصر الخُبَيْبين قَدِيليسَ الإمامُ بالشحيح المُلحد ... فقولهم : { ونحن أحق بالملك } جملة حالية ، والضمير من المتكلمين ، وهم قادة بني إسرائيل وجعلوا الجملة حالاً للدلالة على أنهم لما ذكروا أحقيتهم بالملك لم يحتاجوا إلى الاستدلال على ذلك؛ لأن هذا الأمر عندهم مسلم معروف ، إذ هم قادة وعرفاء ، وشاوول رجل من السوقة ، فهذا تسجيل منهم بأرجحيتهم عليه ، وقوله : { ولم يؤت سعة من المال } معطوفة على جملة الحال فهي حال ثانية . وهذا إبداء مانع فيه من ولايته الملك في نظرهم ، وهو أنه فقير ، وشأن الملك أن يكون ذا مال ليكفي نوائب الأمة فينفق المال في العدد والعطاء وإغاثة الملهوف ، فكيف يستطيع من ليس بذي مال أن يكون ملكاً ، وإنما قالوا هذا لقصورهم في معرفة سياسة الأمم ونظام الملك؛ فإنهم رأوا الملوك المجاورين لهم في بذخة وسعة ، فظنوا ذلك من شروط الملك . ولذا أجابهم نبيئهم بقوله : { إن الله اصطفاه عليكم } رادّاً على قولهم : { ونحن أحق بالملك منه } فإنهم استندوا إلى اصطفاء الجمهور إياهم فأجابهم بأنه أرجح منهم لأن الله اصطفاه ، وبقوله : { وزاده بسطة في العلم والجسم } راداً عليهم قولهم : { ولم يؤت سعة من المال } أي زاده عليكم بسطة في العلم والجسم ، فأعلمهم نبيئهم أن الصفات المحتاج إليها في سياسة أمر الأمة ترجع إلى أصالة الرأي وقوة البدن؛ لأنه بالرأي يهتدي لمصالح الأمة ، لا سيما في وقت المضائق ، وعند تعذر الاستشارة أو عند خلاف أهل الشورى وبالقوة يستطيع الثبات في مواقع القتال فيكون بثباته ثبات نفوس الجيش .وقدم النبي في كلامه العلم على القوة لأن وقعه أعظم ، قال أبو الطيب: ... الرأي قبلَ شجاعةِ الشجعانهو أَوَّلٌ وهي المحل الثاني ... فالعلم المراد هنا ، هو علم تدبير الحرب وسياسة الأمة ، وقيل : هو علم النبوءة ، ولا يصح ذلك لأن طالوت لم يكن معدوداً من أنبيائهم .ولم يجبهم نبيئهم عن قوله : { ولم يؤت سعة من المال } اكتفاء بدلالة اقتصاره على قوله : { وزاده بسطة في العلم والجسم } فإنه ببسطة العلم وبالنصر يتوافر له المال؛ لأن «المال تجلبه الرعية» كما قال أرسططاليس ، ولأن الملك ولو كان ذا ثروة ، فثروته لا تكفي لإقامة أمور المملكة ولهذا لم يكن من شرط ولاة الأمور من الخليفة فما دونه أن يكون ذا سعة ، وقد ولي على الأمة أبو بكر وعمر وعلي ولم يكونوا ذوي يسار ، وغنى الأمة في بيت مالها ومنه تقوم مصالحها ، وأرزاق ولاة أمورها .والبسطة اسم من البسط وهو السعة والانتشار ، فالبسطة الوفرة والقوة من الشيء ، وسيجيء كلام عليها عند قوله تعالى : { وزادكم في الخلق } في الأعراف ( 69 ) .وقوله : والله يؤتي ملكه من يشاء } يحتمل أن يكون من كلام النبي ، فيكون قد رجع بهم إلى التسليم إلى أمر الله ، بعد أن بين لهم شيئاً من حكمة الله في ذلك . ويحتمل أن يكون تذييلاً للقصة من كلام الله تعالى ، وكذلك قوله : { والله واسع عليم } .\n\n",
      "translations": [
        {
          "translation": "(The Prophet) Samuel (said unto them: Lo! Allah hath raised up) identified (Saul to be king for you. They said: How can) it be justified that (he have kingdom over us) for he is not of royal descent (when we are more deserving of the kingdom than he is) for we are of royal descent, (since he hath not been given wealth enough) to spend on the army? (He) Samuel (said: Lo! Allah hath chosen him) to be king and sovereign (above you, and hath increased him abundantly in wisdom) the knowledge of warfare (and stature) size and physical strength. (Allah bestoweth His sovereignty on whom he will) in this life even if he is not of royal descent. (Allah is All-Embracing) in His gift, (All-Knowing) about whom He gives to, because they said to their prophet that it was he who chose Saul rather than his being appointed by Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ ٱللَّهَ ٱصْطَفَاهُ عَلَيْكُمْ } معناهُ اخْتَارهُ فملكَهُ\n\n\n\n\nوقولهُ تعالى: { وَزَادَهُ بَسْطَةً فِي ٱلْعِلْمِ وَٱلْجِسْمِ } فالبسطَةُ: الزِّيادَةُ والبسْطَةُ: الطّولُ\n\n",
      "translations": [
        {
          "translation": " The meaning of the {Allah has chosen him} is that he chose him and his kingdom.\n\n\nAnd His saying, {And He increased him in knowledge and in body} - so the increase is in knowledge and the increase is in body.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ طَالُوت } كان رجلاً فقيراً\n لا نسب له\n ولا مال\n فما قبلوه للمُلك\n لأن استحقاق المُلك والرياسة عند العامة إنما هو بالسعادة الخارجية التي هي المال والنسب\n فنبّه نبيهم على أن الاستحقاق إنما يكون بالسعادتين الأخريين: الروحانية التي هي العلم\n والبدنية: التي هي زيادة القوى وشدّة البنية والبسطة\n بقوله: { وزاده بسطَة في العلم والجسم } والله أعلم بمن يستحق المُلك فيؤتيه { من يشاء والله واسعٌ } كثير العطاء\n يؤتي المال كما يؤتي المُلك { عَليمٌ } بمن له الاستحقاق وما يحتاج إليه من المال الذي يعتضد به\n فيعطيه\n ثم بيّن أن استحقاق المُلك له علامة أخرى وهي: إذعان الخلق له\n ووقوع هيبته ووقاره في القلوب\n وسكون قلوبهم إليه\n ومحبتهم له\n وقبولهم لأمره على الطاعة والانقياد\n وهو الذي كان يسميه الأعاجم من قدماء الفرس \" خوره \"\n وما يختص بالملوك كيان خوره\n ثم من بعدهم سموه \" فر \" فقالوا: كان فر للملك في أفريدون\n وذهب عن كي كاؤوس فر الملك\n فطلبوا من له الفر\n فوجدوا للملك المبارك كيخسرو وسمّاه \" التابوت \" أي: ما يرجع إليه من الأمور\n لأنّ التابوت فعلوت من التوب\n أي: يأتيكم من جهته ما يرجع في ثبوت ملكه من الإذعان والطاعة والانقياد والمحبة له بإلقاء الله له ذلك في قلوبكم\n كما قال النبي صلى الله عليه وسلم:\n \" نصرت بالرعب مسيرة شهر \" \nأو ما يرجع إليه من الحالة النفسانية\n والهيئة الشاهدة له على صحة ملكه { فيه سكينة من ربّكم } أي: ما تسكن قلوبكم إليه { وبقية مما ترك آل موسى وآل هارون } في أولادهم من المعنى المسمّى \" فر \" وهو نور ملكوتيّ تستضيء به النفس باتصالها بالملكوت السماوية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ لَهُمْ نَبِيُّهُمْ } بإلالهام لله ووحيه { إِنَّ ٱللَّهَ } المدبِرّ لأموركم { قَدْ بَعَثَ لَكُمْ طَالُوتَ } من المرتجلات العجمية { مَلِكاً } يولي أموركم ويقاتلك مع عدوكم { قَالُوۤاْ } مستكبرين مستنكرين: { أَنَّىٰ } من أين { يَكُونُ لَهُ ٱلْمُلْكُ عَلَيْنَا } وهو من سفلة الناس\n كيف يستأهل هذا المنصب؟ { وَنَحْنُ أَحَقُّ بِٱلْمُلْكِ مِنْهُ وَ } الحال أنه { } لَمْ يُؤْتَ سَعَةً مِّنَ ٱلْمَالِ حتى يقوى به\n وإنما استحقروه\n لأنه كان فقيراً راعياً أو سقَّاء أو دباغاً\n وكان من أولاد بنيامينن\n ولم يكن في أولاده النبوة والملك\n إنما كانت النبوة في أولاد لاوي والملك في أولاد يهوذا\n وكان فيهم من أسباطهما خلق عظيم\n\n\n{ قَالَ } لهم نبيهم: { إِنَّ ٱللَّهَ } المعز لأذلة عباده { ٱصْطَفَاهُ } واختاره للملك { عَلَيْكُمْ } مع فقره وسقوط نسبه { وَ } بعدما اختاره { زَادَهُ بَسْطَةً } حيطة وشمولاً { فِي ٱلْعِلْمِ } المتعلق لتبدير المملكة { وَ } قوة عظيمة في { ٱلْجِسْمِ } لمقاومة العدو ومدافعته { وَٱللَّهُ } المدبر لمصالح عباده { يُؤْتِي مُلْكَهُ مَن يَشَآءُ } من عباده على مقتضى علمه منهم وحكمته من غير التفات إلى فقرهم ونسبهم { وَٱللَّهُ } الحكيم العليم { وَاسِعٌ } في فضله وإحسانه { عَلِيمٌ } [البقرة: 247] في حكمه وعدله\n يفعل ما يشاء ويحكم ما يريد\n بلا سسبق علل وأغراض",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وقال لهم نبيهم } شمويل: { إن الله قد بعث لكم } ملكاً، أي: عيَّنه لكم لتقاتلوا معه، وهو { طالوت } وهو عَلَمٌ عِبْراني كدَاوُد، { قالوا } تعنتاً وتشغيباً: { أنى يكون له الملك علينا } أي من أين يستأهل التملك علينا وليس من دار الملك؟ لأن المملكة كانت في أولاد يهوذا، وطالوت من أولاد بنيامين، والنبوة كانت في أولاد لاوى. وقالوا: { نحن أحق بالملك منه } وراثة ومُكْنة، لأن دار المملكة فينا. وأيضاً هو فقير { لم يُؤْتَ سعة من المال } يتقوى به على حرب عدوه، وكان طالوت فقيراً راعياً أو سَقَّاءً أو دباغاً. { قال } لهم نبيهم - عليه السلام-: { إن اصطفاه عليكم } رغم أنفكم. قال وهب بن منبه: أوحى الله إلى نبيهم: إذا دخل عليك رجل فَنَش الدُهنَ الذي في القرن فهو ملكهم، فلما دخل طالوت نَشَّ الدهن. وقال السدي: أرسل الله إليه عَصا، وقال له: إذا دخل عليك رجل على طول هذه العصا فهو ملكهم، فكان ذلك طالوت فتبيَّن أن الله تعالى اصطفاه للملك، { وزاده بسطه في العلم } فكان أعلم بني إسرائيل بالتوراة وقيل: بالحروب وعلم السياسة. وزاده أيضاً بسطه في { الجسم } ، فكان أطولُ بني إسرائيل يبلغ إلى مَنْكبِهِ. وذلك ليكون أعظم خطَراً في القلوب، وأقوى على مقاومة العدو ومكابدة الحروب، { والله يؤتي ملكه من يشاء } لأنه مَلِك الملوك يضع مُلكه حيث شاء، { والله واسع } فيوسع على الفقير ويغنيه بلا سبب، { عليم } بمن يليق بالملك بسبب وبلا سبب.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:249",
      "similarity": 0.3165639640317738
    },
    {
      "verse": "63:4",
      "similarity": 0.26445071760786437
    },
    {
      "verse": "22:75",
      "similarity": 0.10374084361880281
    },
    {
      "verse": "17:40",
      "similarity": 0.10206625422033173
    },
    {
      "verse": "3:42",
      "similarity": 0.10152936910065781
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002247.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002247.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:247.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}