{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ انفقوا۟ مما رزقنكم من قبل ان ياتى يوم لا بيع فيه ولا خلة ولا شفعة والكفرون هم الظلمون",
  "translations": [
    {
      "translation": "You who have iman! give away some of what We have provided for you before a Day arrives on which there is no trading, no close friendship and no intercession. It is the kafirun who are the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, expend of what We have given you before the day arrives on which there will be no barter, and no friendship or intercession matter, and those who are disbelievers will be sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, spend of the wealth We have bestowed upon you (in Our way) before the Day comes when there shall be no buying and no selling: when neither friendship nor intercession will be of any avail. Those, who adopt the way of disbelief are indeed the wrongdoers. '\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, out of what We have given you, spend for the cause of God before the coming of the day when there will be no trading, no friendship, and no intercession. Those who deny the Truth are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Spend in Allah's cause, from what We have provided you, before the advent of a day in which there is no trade, and for the disbelievers neither any friendship nor intercession; and the disbelievers themselves are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Spend of that with which We have provided for you, before a Day comes when there will be no bargaining, nor friendship, nor intercession. And it is the disbelievers who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! spend out of what We have given you before the day comes in which there is no bargaining, neither any friendship nor intercession, and the unbelievers-- they are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, expend of that wherewith We have provided you, before there comes a day wherein shall be neither traffick, nor friendship, nor intercession; and the unbelievers -- they are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! spend of that wherewith We have provided you ere a day come when there will be no trafficking, nor friendship, nor intercession. The disbelievers, they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, spend out of what We have given you, before the Day comes when there will be neither trading, friendship nor intercession. Truly, it is those who deny the truth who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe: expend of that which We have provided you ere the Day cometh wherein there will be neither bargain nor friendship nor intercession. And the infidels - they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Spend out of what We have provided you before there comes a day on which there will be no bargaining, neither friendship, nor intercession. And the faithless—they are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Spend out of (the bounties) We have provided for you, before the Day comes when no bargaining (Will avail), nor friendship nor intercession. Those who reject Faith they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Spend of that with which We have provided for you, before a Day comes when there will be no bargaining, nor friendship, nor intercession. And it is the disbelievers who are the Zalimun (wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, spend of what We have given you before that Day arrives when there shall be neither trade, nor friendship, nor intercession. It is the unbelievers who are the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Spend from what We have given you, before a Day comes in which there is neither trading, nor friendship, nor intercession. The disbelievers are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, spend from that which We have provided for you before there comes a Day in which there is no exchange and no friendship and no intercession. And the disbelievers - they are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:254] O you who believe, expend of what We have provided you with, what is due of it as alms, before there comes a day in which there shall be neither commerce, ransom, nor friendship, that can be of any benefit, nor intercession, without His permission (a variant reading has all three nouns in nominative inflection bay‘un, khullatun, shafā‘atun [as opposed to lā bay‘a, lā khullata, lā shafā‘ata]): this is the Day of Resurrection. And the disbelievers, those that disbelieve in God or in the obligations He has imposed on them — they are the evildoers, for not respecting God’s command.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nموقع هذه الآية مثل موقع { من ذا الذي يقرض الله قرضاً حسنا } \\[ البقرة : 245 \\] الآية لأنّه لما دعاهم إلى بذل نفوسهم للقتال في سبيل الله فقال : { وقاتلوا في سبيل الله واعلموا أنّ الله سميع عليم } \\[ البقرة : 244 \\] شفَّعَهُ بالدعوة إلى بذل المال في الجهاد بقوله : { من ذا الذي يقرض الله قرضاً حسناً فيضاعفه له أضعافاً كثيرة } \\[ البقرة : 245 \\] على طريقة قوله : { وجاهدوا بأموالكم وأنفسكم في سبيل الله } \\[ الأنفال : 72 \\] ، وكانت هذه الآية في قوة التذييل لآية { من ذا الذي يقرض الله قرضاً حسناً } لأنّ صيغة هذه الآية أظهر في إرادة عموم الإنفاق المطلوب في الإسلام ، فالمراد بالإنفاق هنا ما هو أعم من الإنفاق في سبيل الله ، ولذلك حذف المفعول والمتعلق لقصد الانتقال إلى الأمر بالصدقات الواجبة وغيرها ، وستجيء آيات في تفصيل ذلك .وقوله : { مما رزقناكم } حث على الإنفاق واستحقاق فيه .وقوله : { من قبل أن يأتي يوم } حث آخر لأنه يذكر بأن هنالك وقتاً تنتهي الأعمال إليه ويتعذّر الاستدراك فيه ، واليوم هو يوم القيامة ، وانتفاء البيع والخلة والشفاعة كناية عن تعذّر التدارك للفائِت ، لأن المرء يحصل ما يعوزه بطرق هي المعاوضة المعبر عنها بالبيع ، والارتفاق من الغير وذلك بسبب الخلة ، أو بسبب توسط الواسطة إلى من ليس بخليل .والخلة بضم الخاء المودة والصحبة ، ويجوز كسر الخاء ولم يقرأ به أحد ، وتطلق الخلة بالضم على الصديق تسمية بالمصدر فيستوي فيه الواحد وغيره والمذكر وغيره قال الحماسي: ... ألاَ أبلِغَا خُلَّتي راشِداوصنوي قديماً إذا ما اتصل ... وقال كعب : أكرِم بها خُلةً ، البيت .فيجوز أن يراد هنا بالخلة المودة ، ونفي المودة في ذلك لِحصول أثرها وهو الدّفع عن الخليل كقوله تعالى : { واخشوا يوماً لا يجزي والد عن ولده ولا مولود هو جاز عن والده شيئاً } \\[ لقمان : 33 \\] ، ويجوز أن يكون نفي الخليل كناية عن نفي لازمه وهو النفع كقوله : { يوم لا ينفع مال ولا بنون } \\[ الشعراء : 88 \\] ، قال كعب بن زهير: ... وقَال كل خليل كنت آمُلُهلا ألهِيَنَّك إني عنك مشغول ... وقرأ الجمهور { لا بيع فيه } وما بعده بالرفع لأنّ المراد بالبيع والخلة والشفاعة الأجناس لا محالة ، إذ هي من أسماء المعاني التي لا آحاد لها في الخارج فهي أسماء أجناس لا نكرات ، ولذلك لا يحتمل نفيها إرادة نفي الواحد حتى يحتاج عند قصد التنصيص على إرادة نفي الجنس إلى بناء الاسم على الفتح ، بخلاف نحو لا رجلَ في الدار ولا إلَه إلا الله ، ولهذا جاءت الرواية في قول إحدى صواحب أم زرع «زوجي كلَيْللِ تِهَامَهْ لا حَرٌّ ولا قُرٌّ ولا مَخَافَةٌ ولا سآمهْ» بالرفع لا غير ، لأنّها أسماء أجناس كما في هذه الآية . وقرأ ابن كثير وأبو عمرو ويعقوب بالفتح لنفي الجنس نصّاً فالقراءتان متساويتان معنى ، ومن التكلّف هنا قول البيضاوي إنّ وجه قراءة الرفع وقوع النفي في تقدير جواب لسؤال قائل هل بيعٌ فيه أو خلّة أو شفاعة .والشفاعة الوساطة في طلب النافع ، والسعي إلى من يراد استحقاق رضاه على مغضوب منه عليه أو إزالة وحشة أو بغضاء بينهما ، فهي مشتقة من الشفع ضد الوتر ، يقال شفع كمنع إذا صيّر الشيء شفعاً ، وشفع أيضاً كمنع إذا سعى في الإرضاء ونحوه لأنّ المغضوب عليه والمحروم يبعد عن واصله فيصير وتراً فإذا سعى الشفيع بجلب المنفعة والرضا فقد أعادهما شفعاً ، فالشفاعة تقتضي مشفوعاً إليه ومشفوعاً فيه ، وهي في عرفهم لا يتصدّى لها إلاّ من يتحقّق قبول شفاعته ، ويقال شفع فلان عند فلان في فلان فشفَّعهُ فيه أي فقبل شفاعته ، وفي الحديث : «قالوا هذا جدير إن خطب بأن ينكح وإن شفع بأن يشفع» .وبهذا يظهر أنّ الشفاعة تكون في دفع المضرة وتكون في جلب المنفعة قال: ... فذاك فتًى إن تأته في صنيعةإلى ماله لا تأته بشفيع ... ومما جاء في منشور الخليفة القادر بالله للسلطان محمود بن سبكتكين الغزنوي «ولّيناك كورة خراسان ولقبناك يمين الدولة ، بشفاعة أبي حامد الإسفرائيني» ، أي بواسطته ورغبته .فالشفاعة في العرف تقتضي إدلال الشفيع عند المشفوع لديه ، ولهذا نفاها الله تعالى هنا بمعنى نفي استحقاق أحد من المخلوقات أن يكون شفيعاً عند الله بإدلال ، وأثبتها في آيات أخرى كقوله قريباً { من ذا الذي يشفع عنده إلا بإذنه } \\[ البقرة : 255 \\] وقوله : { ولا يشفعون إلاّ لمن ارتضى } \\[ الأنبياء : 28 \\] ، وثبتت للرسول عليه السلام في أحاديث كثيرة وأشير إليها بقوله تعالى : { عسى أن يبعثك ربك مقاما محمودا } \\[ الإسراء : 79 \\] وفسّرت الآية بذلك في الحديث الصحيح ، ولذلك كان من أصول اعتقادنا إثبات الشفاعة للنبيء صلى الله عليه وسلم وأنكرها المعتزلة وهم مخطئون في إنكارها وملبسون في استدلالهم ، والمسألة مبسوطة في كتب الكلام .والشفاعة المنفية هنا مراد بها الشفاعة التي لا يسع المشفوعَ إليه ردّها ، فلا يعارض ما ورد من شفاعة النبي صلى الله عليه وسلم في الأحاديث الصحيحة لأنّ تلك كرامة أكرمه الله تعالى بها وأذن له فيها إذ يقول : «اشفع تشفع» فهي ترجع إلى قوله تعالى : { من ذا الذي يشفع عنده إلا بإذنه } \\[ البقرة : 255 \\] وقوله : { ولا يشفعون إلاّ لمن ارتضى } \\[ الأنبياء : 28 \\] وقوله : { ولا تنفع الشفاعة عنده إلاّ لمن أذن له } \\[ سبأ : 23 \\] .وقوله : { والكافرون هم الظالمون } صيغة قصر نشأت عن قوله : { لا بيع فيه ولا خلّة ولا شفاعة } فدلّت على أن ذلك النفي تعريض وتهديد للمشركين فعقب بزيادة التغليظ عليهم والتنديد بأنّ ذلك التهديد والمهدّد به قد جلبوه لأنفسهم بمكابرتهم فما ظلمهم الله ، وهذا أشدّ وقعاً على المعاقب لأنّ المظلوم يجد لنفسه سلوّاً بأنّه معتدى عليه ، فالقصر قصر قلب ، بتنزيلهم منزلة من يعتقد أنّهم مظلومون .ولك أن تجعلَه قصراً حقيقياً ادّعائياً لأنّ ظلمهم لما كان أشدّ الظلم جعلوا كمن انحصر الظلم فيهم .والمراد بالكافرين ظاهراً المشركون ، وهذا من بدائع بلاغة القرآن ، فإنّ هذه الجملة صالحة أيضاً لتذييل الأمر بالإنفاق في سبيل الله ، لأنّ ذلك الإنفاق لقتال المشركين الذين بدأوا الدين بالمناوأة ، فهم الظالمون لا المؤمنون الذين يقاتلونهم لحماية الدين والذبّ عن حوزته . وذكر الكافرين في مقام التسجيل فيه تنزيه للمؤمنين عن أن يتركوا الإنفاق إذ لا يظنّ بهم ذلك ، فتركه والكفر متلازمان ، فالكافرون يظلمون أنفسهم ، والمؤمنون لا يظلمونها ، وهذا كقوله تعالى : { وويل للمشركين الذين لا يؤتون الزكاة } \\[ فصلت : 6 ، 7 \\] ، وذلك أنّ القرآن يصوّر المؤمنين في أكمل مراتب الإيمان ويقابل حالهم بحال الكفار تغليظاً وتنزيهاً ، ومن هذه الآية وأمثالها اعتقد بعض فرق الإسلام أنّ المعاصي تبطل الإيمان كما قدّمناه .\n\n",
      "translations": [
        {
          "translation": "44 After this, Allah prompted them to give in charity, saying: (0 ye who believe! spend of that wherewith We have provided you) give in charity from the wealth We have given you for the sake of Allah (ere a day) the Day of Judgement (come when there will be no trafficking) no ransom is accepted, (nor friendship, nor intercession) for the disbelievers. (Disbelievers) in Allah (are the wrong-doers) who ascribe partners with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَّ بَيْعٌ فِيهِ وَلاَ خُلَّةٌ } المعنى وَلا خَليلٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {There is no buying in it, nor is there any lodging. } The meaning is \"nor is there any close friend.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المضيفون نعم الله إليها { هُمُ ٱلظَّٰلِمُونَ } [البقرة: 254] المتجاوزون عن حدود الله عناداً واستكباراً المعتقدون أصالتهم في الوجود واستقلالهم في الآثار الصادرة عنهم\n مع كونهم هالكين مستهلكين في وجود الحق وهويته إذ:",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا أنفقوا مما رزقناكم } واجباً أو تطوعاً في وجوه الخير، وخصوصاً في الجهاد الذي نحن بصدد الحضّ عليه، وقدموا لأنفسكم ما تجدونه بعد موتكم { من قبل أن يأتي يوم } الحساب، واقتضاء الثواب، يوم ليس فيه { بيع } ولا شراء، فيكتسب ما يقع به الفداء، وليس فيه { خُلّة } تنفعُ إلا خلة الأتقياء { ولا شفاعة } ترجى\n[طه: 109] فأنفقوا مما خولناكم في سبيل الله، وجاهدوا الكافرين أعداء الله، فإن الكافرين { هم الظالمون } حيث وضعوا عبادتهم في غير محلها، ونسبوا الربوبية لغير مستحقيها، إذ لا يستحقها إلا الحيّ القيّوم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:31",
      "similarity": 0.72428997596125
    },
    {
      "verse": "62:9",
      "similarity": 0.43519338008157765
    },
    {
      "verse": "43:67",
      "similarity": 0.43514906517368557
    },
    {
      "verse": "17:73",
      "similarity": 0.3524435639274569
    },
    {
      "verse": "48:18",
      "similarity": 0.3456915806462503
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002254.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002254.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:254.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}