{
  "chapter": "البقرة",
  "text": "ولما برزوا۟ لجالوت وجنوده قالوا۟ ربنا افرغ علينا صبرا وثبت اقدامنا وانصرنا على القوم الكفرين",
  "translations": [
    {
      "translation": "When they came out against Saul and his troops, they said, 'Our Lord, pour down steadfastness upon us, and make our feet firm, and help us against this kafir people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they were facing Goliath and his hordes they prayed: \"O Lord, give us endurance and steady our steps, and help us against the deniers of truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accordingly, when they marched forward to fight with Goliath and his hosts, they prayed, \"Our Lord, bless us with fortitude, make firm our foothold and give us victory over the unbelieving host.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Advancing towards Goliath and his army, they prayed to God for patience, steadfastness in battle, and for victory over the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they confronted Jalut and his armies they invoked, “Our Lord! Pour (bestow abundantly) on us patience (fortitude), and keep our feet steady, and help us against the disbelieving people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they advanced to meet Jalut (Goliath) and his forces, they invoked: \"Our Lord! Pour forth on us patience, and set firm our feet and make us victorious over the disbelieving people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went out against Jalut and his forces they said: Our Lord, pour down upon us patience, and make our steps firm and assist us against the unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they went forth against Goliath and his hosts, they said, 'Our Lord, pour out upon us patience, and make firm our feet, and give us aid against the people of the unbelievers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went into the field against Goliath and his hosts they said: Our Lord! Bestow on us endurance, make our foothold sure, and give us help against the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they met Goliath and his warriors, they said, \"Our Lord, bestow patience upon us, make us stand firm, and help us against those who deny the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they arrayed themselves against Jalut and his hosts, they said: our Lord pour forth on us patience, and set firm our feet, and make us triumph over the infidel people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they marched out for [encounter with] Goliath and his troops, they said, ‘Our Lord, pour patience upon us, make our feet steady, and assist us against the faithless lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they advanced to meet Goliath and his forces, they prayed: \"Our Lord! Pour out constancy on us and make our steps firm: Help us against those that reject faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they advanced to meet Jalut (Goliath) and his forces, they invoked: \"Our Lord! Pour forth on us patience and make us victorious over the disbelieving people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they appeared to Goliath and his soldiers, they said: 'Lord, pour upon us patience. Make us firm of foot and give us victory against the nation of unbelievers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they confronted Goliath and his troops, they said, “Our Lord, pour down patience on us, and strengthen our foothold, and support us against the faithless people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went forth to [face] Goliath and his soldiers, they said, \"Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:250] So, when they went forth against Goliath and his troops, facing them in military columns, they said, ‘Our Lord, pour out upon us patience, and make firm our feet, by strengthening our hearts for this struggle, and grant us victory over the disbelieving folk!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { ولما برزوا لجالوت وجنوده قالوا ربنا أفرغ علينا صبراً } هذا دعاؤهم حين اللقاء بطلب الصبر من الله ، وعبروا عن إلهامهم إلى الصبر بالإفراغ استعارة لقوة الصبر فإن القوة والكثرة يتعاوران الألفاظَ الدالة عليهما ، كقول أبي كبير الهذلي :كثير الهوى شَتَّى النوى والمسالك ... وقد تقدم نظيره ، فاستعير الإفراغ هنا للكثرة مع التعميم والإحاطة وتثبيت الأقدام استعارة لعدم الفرار شبه الفرار والخوف بزلق القدم ، فشبه عدمه بثبات القدم في المأزق .\n\n",
      "translations": [
        {
          "translation": "(And when they went into the field against Goliath and his hosts they) those who believed (said: Our Lord! Bestow on us endurance) honour us by bestowing patience on us, (make our foothold sure) in war, (and give us victory against the disbelieving folk) Goliath and his people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَفْرِغْ عَلَيْنَا صَبْراً } معناهُ أَنْزِلهُ علينا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Pour forth upon us patience,\" means bestow it upon us.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا بَرَزُواْ } ظهروا { لِجَالُوتَ وَجُنُودِهِ } ودنوا منهم { قَالُواْ } متوجهين إلى ربهم متضرعين له مستمدين منه: { رَبَّنَآ أَفْرِغْ } أفض { عَلَيْنَا صَبْراً } نصبر به عند نزول بلائك { وَثَبِّتْ أَقْدَامَنَا } فيه رضاء لقضائك { وَٱنْصُرْنَا } لتنفيذ حكمك وإمضائك { عَلَى ٱلْقَوْمِ ٱلْكَافِرِينَ } [البقرة: 250] لآلائك ونعمائك\n إنك أنت العزيز الحكيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: ولما برز طالوت بمَن معه { لجالوتَ } \n أي: ظهر في البرَاز\n ودنا بعضهم من بعض\n تضرعوا إلى الله واستنصروه\n وقالوا: { ربنا أفرغ علينا صبراً } أي: أصْبُبْه علينا صبّاً\n { وثبت أقدامنا } عند اللقاء لئلا نَفِرّ\n { وانصرنا على القوم الكافرين }\n وفي دعائهم ترتيب بليغ سألوا أولاً إفراغ الصبر في قلوبهم الذي هو ملاك الأمر\n ثم ثبات القدمِ في مَدَاحِضِ الحرب المُسببِ عنه\n ثم النصرَ على العدو المرتب عليها غالباً\n فهزم الله عدوَّهم وأجاب دعاءهم بإذنه وقدرته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:251",
      "similarity": 0.3902398414476567
    },
    {
      "verse": "7:126",
      "similarity": 0.35690931441375867
    },
    {
      "verse": "94:7",
      "similarity": 0.3458527774334524
    },
    {
      "verse": "55:31",
      "similarity": 0.34203039854374895
    },
    {
      "verse": "2:249",
      "similarity": 0.28766154981453335
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002250.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002250.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:250.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}