{
  "chapter": "البقرة",
  "text": "الم تر الى الذى حاج ابرهم فى ربه ان ءاتىه الله الملك اذ قال ابرهم ربى الذى يحى ويميت قال انا۠ احى واميت قال ابرهم فان الله ياتى بالشمس من المشرق فات بها من المغرب فبهت الذى كفر والله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "What about the one who argued with Ibrahim about his Lord, on the basis that Allah had given him sovereignty? Ibrahim said, 'My Lord is He who gives life and causes to die.' He said, 'I too give life and cause to die.' Ibrahim said, 'Allah makes the sun come from the East. Make it come from the West.' And the one who was a kafir was dumbfounded. Allah does not guide wrongdoing people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you thought of the man who argued with Abraham about his Lord because God had given him a kingdom? When Abraham said: \"My Lord is the giver of life and death,\" he replied: \"I am the giver of life and death.\" And Abraham said: \"God makes the sun rise from the East; so you make it rise from the West,\" and dumbfounded was the infidel. God does not guide those who are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered the case of the person who had an argument with Abraham as to `Whom Abraham acknowledged as his Lord?' The dispute arose because Allah had given him the kingship, (which had made him arrogant). When Abraham said, \"My Lord is He Who gives life and causes death,\" he answered, \"I give life and cause death.\" Then Abraham said, \"Well, Allah brings the sun from the east: just bring it from the west.\" At this the disbeliever was confounded: (yet he did not believe), for Allah does not show guidance to unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have you heard about the one who argued with Abraham about his Lord for His granting him authority? Abraham said, \"It is only my Lord who gives life and causes things to die.\" His opponent said, \"I also can give life and make things die.\" Abraham said, \"God causes the sun to come up from the East. You make it come from the West.\" Thus the unbeliever was confounded. God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you (O dear Prophet Mohammed – peace and blessings be upon him) not see him who argued with Ibrahim (Abraham) concerning his Lord, as Allah had given him the kingdom? When Ibrahim said, “My Lord is He Who gives life and causes death”, he answered, “I give life and cause death”; Ibrahim said, “So indeed it is Allah Who brings the sun from the East – you bring it from the West!” – the disbeliever was therefore baffled; and Allah does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not looked at him who disputed with Ibrahim about his Lord (Allah), because Allah had given him the kingdom When Ibrahim said (to him): \"My Lord is He Who gives life and causes death.\" He said, \"I give life and cause death.\" Ibrahim said, \"Verily, Allah brings the sun from the east; then bring it you from the west.\" So the disbeliever was utterly defeated. And Allah guides not the people, who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered him (Namrud) who disputed with Ibrahim about his Lord, because Allah had given him the kingdom? When Ibrahim said: My Lord is He who gives life and causes to die, he said: I give life and cause death. Ibrahim said: So surely Allah causes the sun to rise from the east, then make it rise from the west; thus he who disbelieved was confounded; and Allah does not guide aright the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded him who disputed with Abraham, concerning his Lord, that God had given him the kingship? When Abraham said, 'My Lord is He who gives life, and makes to die,' he said, 'I give life, and make to die.' Said Abraham, 'God brings the sun from the east; so bring thou it from the west.' Then the unbeliever was confounded. God guides not the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink thee of him who had an argument with Abraham about his Lord, because Allah had given him the kingdom; how, when Abraham said: My Lord is He Who giveth life and causeth death, he answered: I give life and cause death. Abraham said: Lo! Allah causeth the sun to rise in the East, so do thou cause it to come up from the West. Thus was the disbeliever abashed. And Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not heard of him who argued with Abraham about his Lord because God had bestowed the kingdom upon him? Abraham said, \"My Lord is the one who gives life and brings death.\" He answered, \"I [too] give life and bring death!\" Abraham said, \"God brings up the sun from the east, so bring it up yourself from the west.\" Then the disbeliever was confounded. God does not guide the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethinkest thou not of one who contended with Ibrahim concerning his Lord, because Allah had vouchsafed unto him dominion! When Ibrahim said: my Lord is He Who giveth life and causeth death, he said: give life and cause death. Ibrahim said: verily Allah bringeth the sun from the east, then bring it thou from the west. Thereupon he Who disbelieved Was dumb-founded, And Allah guideth not a wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded him who argued with Abraham about his Lord, [only] because Allah had given him kingdom? When Abraham said, ‘My Lord is He who gives life and brings death,’ he replied, ‘I [too] give life and bring death.’ Abraham said, ‘Indeed Allah brings the sun from the east; now you bring it from the west.’ Thereat the faithless one was dumbfounded. And Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not Turned thy vision to one who disputed with Abraham About his Lord, because Allah had granted him power? Abraham said: \"My Lord is He Who Giveth life and death.\" He said: \"I give life and death\". Said Abraham: \"But it is Allah that causeth the sun to rise from the east: Do thou then cause him to rise from the West.\" Thus was he confounded who (in arrogance) rejected faith. Nor doth Allah Give guidance to a people unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not looked at him who disputed with Ibrahim (Abraham) about his Lord (Allah), because Allah had given him the kingdom? When Ibrahim (Abraham) said (to him): \"My Lord (Allah) is He Who gives life and causes death.\" He said, \"I give life and cause death.\" Ibrahim (Abraham) said, \"Verily! Allah causes the sun to rise from the east; then cause it you to rise from the west.\" So the disbeliever was utterly defeated. And Allah guides not the people, who are Zalimun (wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen he who argued with Abraham about his Lord that Allah had given him the kingship! When Abraham said: 'My Lord is He who revives, and causes to die' He said: 'I revive, and cause to die' Abraham said: 'Allah brings up the sun from the east; so you bring it from the west' Then he who disbelieved became pale. Allah does not guide the nation, the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered him who argued with Abraham about his Lord, because God had given him sovereignty? Abraham said, “My Lord is He who gives life and causes death.” He said, “I give life and cause death.” Abraham said, “God brings the sun from the East, so bring it from the West,” so the blasphemer was confounded. God does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered the one who argued with Abraham about his Lord [merely] because Allah had given him kingship? When Abraham said, \"My Lord is the one who gives life and causes death,\" he said, \"I give life and cause death.\" Abraham said, \"Indeed, Allah brings up the sun from the east, so bring it up from the west.\" So the disbeliever was overwhelmed [by astonishment], and Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:258] Have you not seen him who disputed with Abraham, concerning his Lord, because of the fact, that God had given him the kingship?, that is, his arrogance towards this very grace of God: this was Nimrod (Nimrūd). When (idh is a substitution for hājja, ‘disputed’) Abraham, in response to the other’s question, ‘Who is this Lord of yours to whom you are calling us?’, said: ‘My Lord is He who gives life, and makes to die’, the One that creates life and death in bodies; he [Nimrod] said, ‘I give life, by sparing, and make to die’, by killing. He then had two men brought before him, killed one and spared the other. When Abraham realised that this man was a fool, Abraham, resorting to a more sophisticated argument, said: ‘God brings the sun from the east; so bring, you, it from the west.’ Then the disbeliever was confused, perplexed and amazed; and God   guides not the folk who do evil, disbelieving, to the art of argument.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجرى هذا الكلام مجرى الحجة على مضمون الجملة الماضية أو المثاللِ لها؛ فإنّه لما ذكر أنّ الله يخرج الذين آمنوا من الظلمات إلى النور وأنّ الطاغوت يخرجون الذين كفروا من النور إلى الظلمات ، ساق ثلاثة شواهد على ذلك هذا أولها وأجمعها لأنّه اشتمل على ضلال الكافر وهدى المؤمن ، فكان هذا في قوّة المثال .والمقصود من هذا تمثيل حال المشركين في مجادلتهم النبي صلى الله عليه وسلم في البعث بحال الذي حاجّ إبراهيم في ربه ، ويدل لذلك ما يرد من التخيير في التشبيه في قوله : { و كالذي مر على قرية } \\[ البقرة : 259 \\] الآية .وقد مَضى الكلام على تركيب ألم تر . والاستفهامُ في { ألم تر } مجازي متضمّن معنى التعجيب ، وقد تقدم تفصيل معناه وأصله عند قوله تعالى : { ألم تر إلى الذين خرجوا من ديارهم } \\[ البقرة : 243 \\] . وهذا استدلال مسوق لإثبات الوحدانية لله تعالى وإبطال إلاهية غيره لانفراده بالإحياء والإماتة ، وانفراده بخلق العوالم المشهودة للناس . ومعنى { حاجّ } خاصم ، وهو فعل جاء على زنة المفاعلة ، ولا يعرف لحاجّ في الاستعمال فعل مجرد دال على وقوع الخصام ولا تعرف المادة التي اشتق منها . ومن العجيب أنّ الحجة في كلام العرب البرهان المصدّق للدعوى مع أنّ حاج لا يستعمل غالباً إلاّ في معنى المخاصمة؛ قال تعالى : { وإذ يتحاجّون في النار } \\[ غافر : 47 \\] مع قوله : { إن ذلك لحق تخاصم أهل النار } \\[ ص : 64 \\] ، وأنّ الأغلب أنّه يفيد الخصام بباطل ، قال تعالى : { وحاجّه قومه قال أتحاجّوني في الله وقد هدان } \\[ الأنعام : 80 \\] وقال : { فإن حاجّوك فقل أسلمت وجهي لله } \\[ آل عمران : 20 \\] والآيات في ذلك كثيرة . فمعنى { الذي حاجّ إبراهيم } أنّه خاصمه خصاماً باطلاً في شأن صفات الله ربّ إبراهيم .والذي حَاجّ إبرهيم كافر لا محالة لقوله : { فبهت الذي كفر } ، وقد قيل : إنّه نمرودُ بن فالخ بن عابر بن شالح بن أرفخشد بن سام بن كوش بن حام بن نوح ، فيكون أخا ( رَعو ) جدِّ إبراهيم . والذي يُعتمد أنّه ملك جبّار ، كان ملكاً في بابل ، وأنّه الذي بنى مدينة بابل ، وبنى الصرح الذي في بابل ، واسمه نمرُود بالدال المهملة في آخره ويقال بالذال المعجمة ، ولم تتعرّض كتب اليهود لهذه القصة وهي في المرويات .والضمير المضاف إليه رَب عائِد إلى إبراهيم ، والإضافة لتشريف المضاف إليه ، ويجوز عوده إلى الذي ، والإضافة لإظهار غلطه كقول ابن زيابة: ... نُبِّئْتُ عَمراً غارزاً رأسَهفي سِنَةٍ يُوعِدُ أخوا لَه ... أي ما كان من شأن المروءة أن يُظهر شراً لأهللِ رحمه .وقوله : { أن أتاه الله الملك } تعليل حذفت منه لام التعليل ، وهو تعليل لما يتضمنّه حاجّ من الإقدام على هذا الغلط العظيم الذي سهّله عنده ازدهاؤه وإعجابه بنفسه ، فهو تعليل محض وليس علة غَائِيَّة مقصودةً للمحاجِّ من حجاجه .وجوّز صاحب «الكشاف» أن يكون تعليلاً غائياً أي حاجّ لأجل أنّ الله آتاه الملك ، فاللام استعارة تبعية لمعنى يُؤدَّى بحرف غير اللام ، والداعي لهاته الاستعارة التهكّم ، أي أنّه وضعَ الكفر موضع الشكر كما في أحد الوجهين في قوله تعالى : { وتجعلون رزقكم أنَّكم تكذبون } \\[ الواقعة : 82 \\] ، أي جزاءَ رزقكم . وإيتاء الملك مجاز في التفضّل عليه بتقدير أن جعله ملكاً وخوّله ذلك ، ويجيء تفصيل هذا الفعل عند قوله تعالى : { وتلك حجّتنا آتيناها إبراهيم } في سورة الأنعام ( 83 ) . قيل : كان نمرود أولَ ملك في الأرض وأولَ من وضع التاج على رأسه . وإذ قال } ظرف لحَاجّ . وقد دل هذا على أنّ إبراهيم هو الذي بدأ بالدعوة إلى التوحيد واحتجّ بحجة واضحة يدركها كل عاقل وهي أن الربّ الحق هو الذي يحيي ويميت؛ فإن كل أحد يعلم بالضرورة أنّه لا يستطيع إحياء ميت فلذلك ابتدأ إبراهيم الحجة بدلالة عجز الناس عن إحياء الأموات ، وأراد بأنّ الله يحيي أنّه يخلق الأجسام الحيّة من الإنسان والحيوان وهذا معلوم بالضرورة . وفي تقديم الاستدلال بخلق الحياة إدماج لإثبات البعث لأنّ الذي حاجّ إبراهيم كان من عبدة الأصنام ، وهم ينكرون البعث . وذلك موضع العِبرة من سياق الآية في القرآن على مسامع أهل الشرك ، ثم أعقبه بدلالة الأمانة ، فإنّه لا يستطيع تنهية حياة الحي ، ففي الإحياء والأمانة دلالة على أنّهما من فعل فاعل غير البشر ، فالله هو الذي يحيي ويميت . فالله هو الباقي دون غيره الذين لا حياة لهم أصلاً كالأصنام إذْ لا يُعطون الحياة غيرَهم وهم فاقدوها ، ودون من لا يدفع الموت على نفسه مثل هذا الذي حاجّ إبراهيم .وجملة { قال أنا أحيي } بيان لحاجّ والتقدير حاجّ إبراهيمَ قال أنا أحيي وأميت حين قال له إبراهيم { ربي الذي يحيي ويميت } . وقد جاء بمغالطة عن جهل أو غرور في الإحياء والإماتة إذ زعم أنّه يعمد إلى من حَكَم عليه بالموت فيعفو عنه ، وإلى بريء فيقتله ، كذا نقلوه . ويجوز أن يكون مراده أنّ الإحياء والإماتة من فِعله هوَ لأنّ أمرهما خفي لا يقوم عليه برهان محسوس .وقرأ الجمهور ألف ضمير ( أنا ) بقصر الألف بحيث يكون كفتحة غير مشبعة وذلك استعمال خاص بألف ( أنا ) في العربية . وقرأه نافع وأبو جعفر مثلَهم إلاّ إذا وقع بعد الألففِ همزةُ قطع مضمومةٌ أو مفتوحةٌ كما هنا ، وكما في قوله تعالى : { وأنا أول المسلمين } \\[ الأنعام : 163 \\] فيقرأه بألف ممدودة . وفي همزة القطع المكسورة روايتان لقالونَ عن نافع نحو قوله تعالى : { إن أنا إلا نذير } \\[ الأعراف : 188 \\] وهذه لغة فصيحة .وقوله : { قال إبراهيم } مجاوبة فقطعت عن العطف جرياً علَى طريقة حكاية المحاورات ، وقد عدل إبراهيم عن الاعتراض بأنّ هذا ليس من الإحياء المحتجّ به ولا من الإماتة المحتجّ بها ، فأعرض عنه لِمَا علم من مكابرة خصمه وانتقل إلى ما لا يستطيع الخصم انتحاله ، ولذلك بُهت ، أي عجز لم يجد معارضة .وبهت فعل مبْني للمجهول يقال بَهَتَه فبُهت بمعنى أعجزه عن الجواب فعَجز أو فَاجَأه بما لم يَعرف دفعه قال تعالى : { بل تأتيهم بغتة فتبهتهم } \\[ الأنبياء : 40 \\] وقال عروة العذري: ... فما هو إلاّ أن أراها فُجَاءَةفأُبْهَتَ حتى ما أكادُ أجيب ... ومنه البهتان وهو الكذب الفظيع الذي يُبهت سامعَه .وقوله : { والله لا يهدي القوم الظالمين } تذييل هو حوصلة الحجة على قوله { الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور } ، وإنّما انتفى هدي الله لقوم الظالمين لأنّ الظلم حائل بين صاحبه وبين التنازل إلى التأمّل من الحجج وإعمال النظر فيما فيه النفع؛ إذ الذهن في شاغل عن ذلك بزهوه وغروره .والآية دليل على جواز المجادلة والمناظرة في إثبات العقائد ، والقرآن مملوء بذلك ، وأما ما نهي عنه من الجدل فهو جدال المكابرة والتعصّب وترويج الباطل والخطإ .\n\n",
      "translations": [
        {
          "translation": "(Bethink thee) have you not been informed (of him who had an argument with Abraham about his Lord) about the Religion of his Lord, (because Allah had given him the kingdom) he is Nimrod Ibn Canaan; (how, when Abraham said: My Lord is He Who giveth life and causeth death) gives life upon the resurrection and causes death by ending the life of this world, (he answered: I give life and cause death. Abraham said) give me proof of what you say. So Nimrod brought two prisoners, killed one and spared the other and then said: this is my proof. When he saw this, Abraham said: (Lo! Allah causeth the sun to rise in the East) from the direction of the East, (so do thou cause it to come up from the West) from the direction of the West. (Thus was the disbeliever abashed) the one who disbelieved kept quiet and could not argue. (And Allah guideth not) to the right argument (wrong-doing folk) the unbelievers, referring here to Nimrod.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَبُهِتَ } معناهُ انْقَطَعتْ حُجتُهُ\n ويقالُ: بَهُتَ وبَهِتَ، وأَكثرُ الكَلامِ بَهُتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Fabuhita} [means] that his proof has been cut off.\n \n\nIt is said: \"You are Baht and Bahit,\" and most of the speech is Baht.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ إِلَى } الكافر العابد للطاغوت وهو نمورد اللعين المعاند { ٱلَّذِي حَآجَّ } جادل مكابرة مع { إِبْرَاهِيمَ } صلوات الرحمن عليه { فِي } شأن { رَبِّهِ } حين { أَنْ آتَاهُ ٱللَّهُ ٱلْمُلْكَ } وأبطره عليه وغيره بملكه وذلك وقت { إِذْ قَالَ إِبْرَاهِيمُ } إلزاماً له حين أخرجه من السجن\n فسأكل عن ربه الذي يدعي الدعوة إليه: { رَبِّيَ ٱلَّذِي يُحْيِـي } يُوجِدُ من العدم { وَيُمِيتُ } يرد إليه بعد إيجاده { قَالَ } مكابرة ومجادلة: { أَنَا } أيضاً { أُحْيِـي وَأُمِيتُ } بالعفو والقصاص { قَالَ إِبْرَاهِيمُ } تصريحاً لإلزامه من غير التفات إلى كلام: { فَإِنَّ ٱللَّهَ } القادر على ما يشاء { يَأْتِي بِٱلشَّمْسِ مِنَ ٱلْمَشْرِقِ فَأْتِ } أيها المعاند المكابر { بِهَا مِنَ ٱلْمَغْرِبِ فَبُهِتَ ٱلَّذِي كَفَرَ } بالله بالمعارضة معه فصار مبهوتاً متحيراً { وَٱللَّهُ } الهادي للكل { لاَ يَهْدِي ٱلْقَوْمَ ٱلظَّالِمِينَ } [البقرة: 259] المجاوزين عن حقوق الله وآداب العبودية معه\n\n\n{ أَوْ كَٱلَّذِي } أي: ألم تر إلى الشخص الذي { مَرَّ عَلَىٰ قَرْيَةٍ } هي البيت المقدس في زمان خربها بُخْتنَصَّر فرآها { وَهِيَ خَاوِيَةٌ } ساقطة { عَلَىٰ عُرُوشِهَا قَالَ } محاجاً مجادلاً مبعداً للحشر والنشر: { أَنَّىٰ يُحْيِـي هَـٰذِهِ ٱللَّهُ بَعْدَ مَوْتِهَا } أي: كيف يقدر على إحياء أهلها وهم قد انقرضوا واندرسوا إلى حيث لم يبق منهم أثر؟ { فَأَمَاتَهُ ٱللَّهُ } فجأة\n إظهار لقدرته وتبييناً لحجته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أن آتاه }: على حذف لام العلة، و { إذ قال }: ظرف لـ { حاجَّ } ، أبو بدل من { آتاه الله }. يقول الحقّ جلّ جلاله: متعجباً من جهالة النمرود، والمراد تعجيب السامع: { ألم تر } يا محمد، { إلى } جهالة { الذي حاج إبراهيم } أي: خاصمه { في ربه } لأجْل { أن } أعطاه { الله الملك } ، أي: حمله على ذلك بطر الملك. وذلك أنه لما كسَّر إبراهيم الأصنام، سجنه أياماً، وأخرجه من السجن، وقال له: من ربك الذي تعبد؟ { قال } له { إبراهيم } عليه السلام: { ربي الذي يحيي ويميت } ، أي: يخلق الأرواح في الأجسام، ويخرجها عند انقضاء آجالها، { قال } نمرود: { أنا أحيي واميت } ، فدعا برجلين فقتل أحدهما، وعفا عن الآخر، فلما رأى إبراهيم عليه السلام غلطه وتشغيبه عدل له إلى حجة أخرى، لا مقدور للبشر على الإتيان بمثلها، فال له: { فإن الله يأتي بالشمس من المشرق فأت بها } أنت { من المغرب } لأنك تدَّعي الربوبية، ومن شأن الربوبية أن تقدر على كل شيء، ولا يعجزها شيء، { فبُهت الذي كفر } أي: غُلب وصار مبهوتاً، { والله لا يهدي القوم الظالمين } إلى قبول الهداية، أو إلى طريق النجاة، أو إلى محجة الاحتجاج. الإشارة: قال بعض الحكماء: للنفس سر، ظهر على فرعون والنمرود، حتى صرّحا بدعوى الربوبية: قلت: وهذا السر هو ثابت للروح في أصل نشأتها لأنها جاءت من عالم العز والكبرياء. انظر قوله تعالى:\n[الحِجر: 29]، وقال أيضاً:\n[الإسَراء: 85] أي: سر من أسراره، فلما رُكبت في هذا القلب الذي هو قالب العبودية - طلبت الرجوع إلى أصلها. فجعل لها الحقّ جلّ جلاله باباً تدخل منه فترجع إلى أصلها وهو الذل والخضوع والانكسار والافتقار، فمن دخل من هذا الباب، واتصل بمن يعرّفه ربه، رجعت روحه إلى ذلك الأصل، وأدركت ذلك السر، فمنها من تتسع لذلك السر وتطيقه، ومنها من تضيق عن حمله وتبوح به، فتقتلها الشريعة، كالحلاج وأمثاله، ومن طلب الرجوع إلى ذلك الأصل من غير بابه، ورام إدراكه بالعز والتكبّر، طُرد وأُبعد، وهو الذي صدر من النمرود وفرعون وغيرهما ممن ادّعى الربوبية جهلاً. والله تعالى أعلم. ثم ذكر الحقّ تعالى من أدركته العناية، وفي قصته برهان على إحياء الموتى الذي احتج إبراهيم - عليه السلام -.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:17",
      "similarity": 0.4764645102830228
    },
    {
      "verse": "4:156",
      "similarity": 0.46690836131074204
    },
    {
      "verse": "73:9",
      "similarity": 0.4614896758999073
    },
    {
      "verse": "24:16",
      "similarity": 0.4597148567827069
    },
    {
      "verse": "26:28",
      "similarity": 0.4583045757564102
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002258.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002258.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:258.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}