{
  "chapter": "البقرة",
  "text": "فهزموهم باذن الله وقتل داود جالوت وءاتىه الله الملك والحكمة وعلمه مما يشاء ولولا دفع الله الناس بعضهم ببعض لفسدت الارض ولكن الله ذو فضل على العلمين",
  "translations": [
    {
      "translation": "And with Allah's permission they routed them. Dawud killed Saul and Allah gave him kingship and wisdom and taught him whatever He willed. If it were not for Allah's driving some people back by means of others, the earth would have been corrupted. But Allah shows favour to all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the will of God they defeated them, and David killed Goliath, and God gave him kingship and wisdom, and taught him whatsoever He pleased. If God did not make men deter one another this earth would indeed be depraved. But gracious is God to the people of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consequently, by Allah's grace, they routed the unbelievers, and David killed Goliath; and Allah gave him kingship and wisdom and taught him whatever other things He willed. And if Allah had not been repelling one set of people by means of another, the earth would have been filled with chaos. But Allah is bountiful to the world (and so repels chaos in this way).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They defeated their enemy through God's will. David slew Goliath and God granted David the kingdom and wisdom and also taught him whatever He wanted. Had God not made one group of people repel the other, the earth would have become full of corruption, but God is generous to His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they routed them by the command of Allah; and Dawud (David) slew Jalut, and Allah gave him the kingdom and wisdom, and taught him all whatever He willed; and if Allah does not ward off some men by others, the earth will be destroyed, but Allah is Most Munificent towards the entire creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they routed them by Allah's leave and Dawud (David) killed Jalut (Goliath), and Allah gave him (Dawud) the kingdom [after the death of Talut and Samuel] and Al-Hikmah (prophethood), and taught him of that which He willed. And if Allah did not check one set of people by means of another, the earth would indeed be full of mischief. But Allah is full of bounty to the `Alamin (mankind, Jinn and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they put them to flight by Allah's permission. And Dawood slew Jalut, and Allah gave him kingdom and wisdom, and taught him of what He pleased. And were it not for Allah's repelling some men with others, the earth would certainly be in a state of disorder; but Allah is Gracious to the creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they routed them, by the leave of God, and David slew Goliath; and God gave him the kingship, and Wisdom, and He taught him such as He willed. Had God not driven back the people, some by the means of others, the earth had surely corrupted; but God is bounteous unto all beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they routed them by Allah's leave and David slew Goliath; and Allah gave him the kingdom and wisdom, and taught him of that which He willeth. And if Allah had not repelled some men by others the earth would have been corrupted. But Allah is a Lord of Kindness to (His) creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so by the command of God they defeated them. David killed Goliath, and God gave him kingship and wisdom, and imparted to him the knowledge of whatever He willed. Had it not been for God's repelling some people by means of others, the earth would have been filled with corruption. But God is bountiful to His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they vanquished them by the leave of Allah, and Da'ud slew Jalut, and Allah vouchsafed him dominion, and Wisdom and taught him of that which He Willed. And, it not for Allah's repelling people, some of them by means of others, the earth surely were corrupted; but Allah is Gracious unto the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus they routed them with Allah’s will, and David killed Goliath, and Allah gave him kingdom and wisdom and taught him whatever He liked. Were it not for Allah’s repelling the people by means of one another, the earth would surely have been corrupted; but Allah is gracious to the world’s people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah's will they routed them; and David slew Goliath; and Allah gave him power and wisdom and taught him whatever (else) He willed. And did not Allah Check one set of people by means of another, the earth would indeed be full of mischief: But Allah is full of bounty to all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they routed them by Allah's Leave and Dawud (David) killed Jalut (Goliath), and Allah gave him [Dawud (David)] the kingdom [after the death of Talut (Saul) and Samuel] and Al-Hikmah (Prophethood), and taught him of that which He willed. And if Allah did not check one set of people by means of another, the earth would indeed be full of mischief. But Allah is full of Bounty to the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the permission of Allah, they routed them. David slew Goliath, and Allah bestowed on him the kingship and wisdom, and taught him from that He willed. Had Allah not pushed the people, some by the other, the earth would have been corrupted. But Allah is Bountiful to the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they defeated them by God’s leave, and David killed Goliath, and God gave him sovereignty and wisdom, and taught him as He willed. Were it not for God restraining the people, some by means of others, the earth would have gone to ruin. But God is gracious towards mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they defeated them by permission of Allah, and David killed Goliath, and Allah gave him the kingship and prophethood and taught him from that which He willed. And if it were not for Allah checking [some] people by means of others, the earth would have been corrupted, but Allah is full of bounty to the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:251] And they routed, they broke, them, by the leave of God, by His will, and David, who was among the ranks of Saul’s army, slew Goliath; and God gave him, David, the kingship, over the Children of Israel, and Wisdom, prophethood after the death of Samuel and Saul, and the combination [of kingship and prophethood] had never come to anyone before him; and He taught him such as He willed, of the manufacture of mail-coats and the speech of birds. Had God not repelled people some (ba‘dahum, ‘some’, substitutes for [saying] ba‘dan min al-nās, ‘some people’) by means of others the earth would have surely been corrupted, with idolaters defeating and slaying Muslims, and mosques being destroyed; but God is bounteous to all worlds, by repelling some by means of others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقد أشارت الآية في قوله : { فهزموهم } إلخ إلى انتصار بني إسرائيل على الفلسطينيين وهو انتصار عظيم كان به نجاح بني إسرائيل في فلسطين وبلاد العمالقة ، مع قلة عددهم فقد قال مؤرخوهم إن طالوت لما خرج لحرب الفلسطينيين جمع جيشاً فيه ثلاثة آلاف رجل ، فلما رأوا كثرة الفلسطينيين حصل لهم ضنك شديد واختبأ معظم الجيش في جبل افرايم في المغارات والغياض والآبار ، ولم يعبروا الأردن ، ووجم طالوت واستخار صمويل ، وخرج للقتال فلما اجتاز نهر الأردن عد الجيش الذي معه فلم يجد إلاّ نحو ستمائة رجل ، ثم وقعت مقاتلات كان النصر فيها لبني إسرائيل ، وتشجع الذين جبنوا واختبأوا في المغارات وغيرها فخرجوا وراء الفلسطينيين وغنموا غنيمة كثيرة ، وفي تلك الأيام من غير بيان في كتب اليهود لمقدار المدد بين الحوادث ولا تنصيص على المتقدم منها والمتأخر ومع انتقالات في القصص غير متناسبة ، ظهر داود بن يسى اليهودي إذ أوحى الله إلى صمويل أن يذهب إلى بيت يسى في بيت لحم ويمسح أصغر أبناء يسى ليكون ملكاً على إسرائيل بعد حين ، وساق الله داود إلى شاول ( طالوت ) بتقدير عجيب فحظى عند شاول ، وكان داود من قبل راعي غنم أبيه ، وكان ذا شجاعة ونشاط وحسن سمت ، وله نبوغ في رمي المقلاع ، فكان ذات يوم التقى الفلسطينيون مع جيش طالوت وخرج زعيم من زعماء فلسطين اسمه جُلْيَات كما تقدم ، فلم يستطع أحد مبارزته فانبرى له داود ورماه بالمقلاع فأصاب الحجر جبهته وأسقطه إلى الأرض واعتلاه داود واخترط سيفه وقطع رأسه ، فذهب به إلى شاول وانهزم الفلسطينيون ، وزوج شاول ابنته المسماة ميكال من داود ، وصار داود بعد حين ملكاً عوض شاول ، ثم آتاه الله النبوءة فصار ملكاً نبيئاً ، وعلمه مما يشاء .ويأتي ذكر داود عند قوله تعالى : { وتلك حجتنا أتيناها إبراهيم على قومه } في سورة الأنعام ( 83 ) .وَلَوْلاَ دَفْعُ الله الناس بَعْضَهُم بِبَعْضٍ لَفَسَدَتِ الأرض ولكن الله ذُو فَضْلٍ عَلَى العالمين } .ذيلت هذه الآية العظيمة كل الوقائع العجيبة التي أشارت بها الآيات السالفة لتدفع عن السامع المتبصر ما يخامره من تطلب الحكمة في حدثان هذه الوقائع وأمثالها في هذا العالم ولكون مضمون هذه الآية عبرة من عبر الأكوان وحكمة من حكم التاريخ ، ونظم العمران التي لم يهتد إليها أحد قبل نزول هذه الآية ، وقبل إدراك ما في مطاويها ، عطفت على العبر الماضية كما عطف قوله : { وقال لهم نبيهم } \\[ البقرة : 247 \\] وما بعده من رؤوس الآي . وعدل عن المتعارف في أمثالها من ترك العطف ، وسلوك سبيل الاستئناف .وقرأ نافع وأبو جعفر ويعقوب ( ولولا دفاع الله الناس ) بصيغة المفاعلة ، وقرأه الجمهور ( دفع ) بصيغة المجرد .والدفاع مصدر دافع الذي هو مبالغة في دفع لا للمفاعلة ، كقول موسى بن جابر الحنفي :لا أشتهي يا قوم إلاّ كارهاً ... باب الأمير ولا دفاع الحاجبوإضافته إلى الله مجاز عقلي كما هو في قوله : { إن الله يدفع عن الذين آمنوا } \\[ الحج : 38 \\] أي يدفع لأن الذي يدفع حقيقة هو الذي يباشر الدفع في متعارف الناس وإنما أسند إلى الله لأنه الذي قدره وقدر أسبابه ، ولذلك قال : { بعضهم ببعض } فجعل سبب الدفاع بعضهم وهو من باب { وما رميت إذ رميت ولكن الله رمى } \\[ الأنفال : 17 \\] وأصل معنى الدفع الضرب باليد للإقصاء عن المرام . قال :فدفعتها فتدافعت ... وهو ذب عن مصلحة الدافع . ومعنى الآية : أنه لولا وقوع دفع بعض الناس بعضاً آخر بتكوين الله وإيداعه قوة الدفع وبواعثه في الدافع لفسدت الأرض ، أي من على الأرض ، واختل نظام ما عليها ، ذلك أن الله تعالى لما خلق الموجودات التي على الأرض من أجناس وأنواع وأصناف ، خلقها قابلة للاضمحلال ، وأودع في أفرادها سننا دلت على أن مراد الله بقاؤها إلى أمد أراده ، ولذلك نجد قانون الخَلَفية منبثاً في جميع أنواع الموجودات فما من نوع إلاّ وفي أفراده قوة إيجاد أمثالها لتكون تلك الأمثال أخلافاً عن الأفراد عند اضمحلالها ، وهذه القوة هي المعبر عنها بالتناسل في الحيوان ، والبذر في النبت ، والنضح في المعادن ، والتولد في العناصر الكيماوية . ووجود هذه القوة في جميع الموجودات أول دليل على أن موجِدها قد أراد بقاء الأنواع ، كما أراد اضمحلال الأفراد عند آجال معينة ، لاختلال أو انعدام صلاحيتها ، ونعلم من هذا أن الله خالق هذه الأكوان لا يحب فسادها ، وقد تقدم لنا تفسير قوله : { وإذا تولى سعى في الأرض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد } \\[ البقرة : 205 \\] .ثم إن الله تعالى كما أودع في الأفراد قوة بها بقاء الأنواع ، أودع في الأفراد أيضاً قوى بها بقاء تلك الأفراد بقدر الطاقة ، وهي قوى تطلُّب الملائم ودفع المنافي ، أو تطلُّب البقاء وكراهية الهلاك ، ولذلك أودع في جميع الكائنات إدراكات تنساق بها ، بدون تأمل أو بتأمل ، إلى ما فيه صلاحها وبقاؤها ، كانسياق الوليد لالتهام الثدي ، وأطفال الحيوان إلى الأثداء والمراعي ، ثم تتوسع هذه الإدراكات ، فيتفرع عنها كل ما فيه جلب النافع الملائم عن بصيرة واعتياد ، ويسمى ذلك بالقوة الشاهية .وأودع أيضاً في جميع الكائنات إدراكات تندفع بها إلى الذب عن أنفسها ، ودفع العوادي عنها ، عن غير بصيرة ، كتعريض اليد بين الهاجم وبين الوجه ، وتعريض البقرة رأسها بمجرد الشعور بما يهجم عليها من غير تأمل في تفوق قوة الهاجم على قوة المدافع ، ثم تتوسع هاته الإدراكات فتتفرع إلى كل ما فيه دفع المنافر من ابتداء بإهلاك من يُتوقع منه الضر ، ومن طلب الكِن ، واتخاذ السلاح ، ومقاومة العدو عند توقع الهلاك ، ولو بآخر ما في القوة وهو القوة الغاضبة ولهذا تزيد قوة المدافعة اشتداداً عند زيادة توقع الأخطار حتى في الحيوان . وما جعله الله في كل أنواع الموجودات من أسباب الأذى لمريد السوء به أدل دليل على أن الله خلقها لإرادة بقائها ، وقد عَوَّضَ الإنسان عما وهبه إلى الحيوان العقلَ والفكرة في التحيل على النجاة ممن يريد به ضرراً ، وعلى إيقاع الضر بمن يريده به قبل أن يقصده به ، وهو المعبر عنه بالاستعداد .ثم إنه تعالى جعل لكل نوع من الأنواع ، أو فرد من الأفراد خصائص فيها منافع لغيره ولنفسه ليحرص كل على إبقاء الآخر ، فهذا ناموس عام ، وجعل الإنسان بما أودَعه من العقل هو المهيمن على بقية الأنواع . وجعل له العلم بما في الأنواع من الخصائص ، وبما في أفراد نوعه من الفوائد . فخلق الله تعالى أسباب الدفاع بمنزلة دفع من الله يدفع مريد الضر بوسائل يستعملها المراد إضراره ، ولولا هذه الوسائل التي خولها الله تعالى أفراد الأنواع ، لاشتد طمع القوي في إهلاك الضعيف ، ولاشتدت جراءة من يجلب النفع إلى نفسه على منافع يجدها في غيره ، فابتزها منه ، ولأفرَطتْ أفراد كل نوع في جلب النافع الملائم إلى أنفسها بسلب النافع الملائم لغيرها ، مما هو له ، ولتناسى صاحب الحاجة حين الاحتياج ما في بقاء غيره من المنفعة له أيضاً . وهكذا يتسلط كل ذي شهوة على غيره ، وكل قوي على ضعيفه ، فيهلك القوي الضعيف ، ويهلك الأقوى القويَّ ، وتذهب الأفراد تباعاً ، والأنواع كذلك حتى لا يبقى إلاّ أقوى الأفراد من أقوى الأنواع ، وذلك شيء قليل ، حتى إذا بقي أعوزته حاجات كثيرة لا يجدها في نفسه ، وكان يجدها في غيره من أفراد نوعه ، كحاجة أفراد البشر بعضهم إلى بعض ، أو من أنواع أخر ، كحاجة الإنسان إلى البقرة ، فيذهب هدراً .ولما كان نوع الإنسان هو المهيمن على بقية موجودات الأرض وهو الذي تظهر في أفراده جميع التطورات والمساعي ، خصتهُ الآية بالكلام فقالت : { ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض } إذ جعل الله في الإنسان القوة الشاهية لبقائه وبقاء نوعه ، وجعل فيه القوة الغاضبة لرد المفرط في طلب النافع لنفسه ، وفي ذلك استبقاء بقية الأنواع؛ لأن الإنسان يذب عنها لما في بقائها من منافع له .وبهذا الدفاع حصلت سلامة القوي ، وهو ظاهر ، وسلامة الضعيف أيضاً لأن القوي إذا وجد التعب والمكدرات في جلب النافع سئم ذلك ، واقتصر على ما تدعو إليه الضرورة . وإنما كان الحاصل هو الفساد ، لولا الدفاع ، دون الصلاح ، لأن الفساد كثيراً ما تندفع إليه القوة الشاهية بما يوجد في أكثر المفاسد من اللذات العاجلة القصيرة الزمن ، ولأن في كثير من النفوس أو أكثرها الميل إلى مفاسد كثيرة ، لأن طبع النفوس الشريرة ألا تراعي مضرة غيرها ، بخلاف النفوس الصالحة ، فالنفوس الشريرة أعمد إلى انتهاك حرمات غيرها ، ولأن الأعمال الفاسدة أسرع في حصول آثارها وانتشارها ، فالقليل منها يأتي على الكثير من الصالحات ، فلا جرم لولا دفاع الناس بأن يدافع صالحهم المفسدين ، لأسرع ذلك في فساد حالهم ، ولعم الفساد أمورهم في أسرع وقت .وأعظم مظاهر هذا الدفاع هو الحروب؛ فبالحرب الجائرة يطلب المحارب غصب منافع غيره ، وبالحرب العادلة ينتصف المحق من المبطل ، ولأجلها تتألف العصبيات والدعوات إلى الحق ، والإنحاء على الظالمين ، وهزم الكافرين .ثم إن دفاع الناس بعضهم بعضاً يصد المفسد عن محاولة الفساد ، ونفس شعور المفسد بتأهب غيره لدفاعه يصده عن اقتحام مفاسد جمة .ومعنى فساد الأرض : إما فساد الجامعة البشرية كما دل عليه تعليق الدفاع بالناس ، أي لفسد أهل الأرض ، وإما فساد جميع ما يقبل الفساد فيكون في الآية احتباك ، والتقدير : ولولا دفاع الله الناس بعضهم ببعض وبقية الموجودات بعضها ببعض لفسدت الأرض أي من على الأرض ولفسد الناس .والآية مسوقة مساق الامتنان ، فلذلك قال تعالى : { لفسدت الأرض } لأنا لا نحب فساد الأرض ، إذ في فسادها بمعنى فساد ما عليها اختلالُ نظامنا وذهاب أسباب سعادتنا ، ولذلك عقبه بقوله : { ولكن الله ذو فضل على العالمين } فهو استدراك مما تضمنته «لولا» من تقدير انتفاء الدفاع؛ لأن أصل لولا لو مع لا النافية ، أي لو كان انتفاءُ الدفاع موجوداً لفسدت الأرض وهذا الاستدراك في هذه الآية أدل دليل على تركيب ( لولا ) من ( لو ) و ( لا ) ، إذ لا يتم الاستدراك على قوله : { لفسدت الأرض } لأن فساد الأرض غير واقع بعد فرض وجود الدفاع ، إن قلنا «لولا» حرف امتناع لوجود .وعلق الفضل بالعالمين كلهم لأن هذه المنة لا تختص .\n\n",
      "translations": [
        {
          "translation": "(So they routed them by Allah's leave) by Allah's help (and David) the Prophet (slew Goliath) the unbeliever; (and Allah gave him the kingdom) Allah gave David sovereignty over the Children of Israel (and wisdom) understanding and prophethood, (and taught him of that which He willeth) i.e. how to make armour. (And if Allah had not repelled some men by others) as He repelled through David the evil of Goliath from the Children of Israel (the earth would have been corrupted). He says: Allah repelled from the believers, by means of the prophets, the evil of their enemies, and He repelled from those who refrained from participating in the fight for Allah's sake, by means of those who fought in His sake, the evil of their enemies. If it were not thus, the earth would have been corrupted. (But Allah is a Lord of Kindness to all the worlds) by this repelling.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَهَزَمُوهُمْ } كسروهم وهزموهم { بِإِذْنِ ٱللَّهِ } بعونه ونصره { وَقَتَلَ دَاوُدُ جَالُوتَ } قيل: كان أيضاً أشعيا في عسكر طالوت مع ستة من بنيه\n وكان داود سابعهم\n وكان صغيراً يرعى الغنم\n فأوحى إلى نبيهم أنه الذي يقتل جالوت\n فطلبه من أبيه\n فجاء\n وقد كلمته في الطريق ثلاثة أحجار\n وقالت له: إنك بنا تقتل جالوت فحملها في مخلاته\n ورماه بها\n فقتله\n ثم زوجه طالوت بنته { وَ } بعد ذلك { آتَاهُ ٱللَّهُ ٱلْمُلْكَ } أي: ملك بني إسرائيل\n ولم يجتمعوا قبل داود على ملك { وَ } آتاه { ٱلْحِكْمَةَ } أي: دعوة الخلق إلى طريق الحق بالحكمة المؤتاة له من قبل ربه { وَعَلَّمَهُ مِمَّا يَشَآءُ } من العلوم والحكمة والمعجزات وخوارق العادات بالجملة { وَلَوْلاَ دَفْعُ ٱللَّهِ } الرقيب الحفيظ لحدوده بين عباده { ٱلنَّاسَ بَعْضَهُمْ بِبَعْضٍ } أي: ظلم بعض الظالمين بتقوية بعض المظلومين ونصره عليهم { لَفَسَدَتِ ٱلأَرْضُ } التي هي منشأ الهون والفساد ومعدن الظلم والعناد { وَلَـٰكِنَّ ٱللَّهَ } المصلح لأحوال العباد { ذُو فَضْلٍ } كثير { عَلَى ٱلْعَالَمِينَ } [البقرة: 251] ليعتدل ويتمكن كل من ساكنيها على ما خلقهم الله لأجله بلا مزاحمة بعضهم بعضاً ظلماً وزوراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقتل داود جالوت }\n وقصة قتله: أن أصحاب طالوت كان فيهم بنو إيش\n وهو أبو داود عليه السلام ستة أو سبعة\n وكان داود صغيراً يرعى غنماً\n فلما حضرت الحرب قال في نسفه: لأذهبن لرؤية هذه الحرب\n فمرَّ في طريقه\n بحجر فناداه: يا داود خُذْني\n فبي تقتل جالوت\n ثم ناداه حجر آخر ثم آخر فأخذها\n وجعلها في مخلاته وسار\n فلما حضر البأس خرج جالوت يطلب البراز\n وكاع الناس عنه\n أي: تأخروا خوفاً\n حتى قال طالوت: من بيرز له ويقتله فأنا أزوجه ابنتي\n وأُحَكِّمُهُ في مالي\n فجاء داود\n فقال له طالوت: اركب فرسي وخذ سلاحي\n ففعل\n وخرج في أحسن شكله\n فلما مشى قليلاً رجع\n فقال الناس: جَبُنَ الفتى\n فقال داود: إن الله سبحانه لم يقتله ولم يُعنى عليه\n لم ينفعني هذا الفرس ولا هذا السلاح\n ولكني أُحب أن أقاتله على عادتي\n وكان داود من أرمى الناس بالمقلاع\n فنزل\n وأخذ مخلاته فتقلدها\n وأخذ مقلاعه فخرج إلى جالوت\n وهو شاكٍ في السلاح\n فقال جالوت: أنت يا فتى تخرج إليّ! قال: نعم\n قال: هكذا كما تخرج إلى الكلب! قال: نعم\n وأنت أهون\n قال: لأطعمن لحمك اليوم الطير والسباع\n ثم تدانيا فأدار داود فأخذ مقلاعه وأدخل يده إلى الحجارة\n فروى أنها التأمت\n وصارت حجراً واحداً\n فأخذه ووضعه في المقلاع\n وسَمَّى الله\n وأداره\n ورماه\n فأصاب رأس جالوت فقتله\n وجزّ رأسه\n وجعله في مخلاته\n واختلط الناس\n وحمل أصحابُ طالوت فكانت الهزيمة\n ثم إن داود جاء يطلب شرطه من طالوت\n فقال: حتى تقتل مائتين من هؤلاء الجراجمة الذين يؤذون الناس يؤذون الناس وتجيئني بسلبهم\n فقتل داود منهم مائتين\n وجاء بذلك\n فدفع إليه امرأته وتخلّى له على الملك\n ولما تمكن داود - عليه السلام - من الملك\n أجلى من بقي من قوم جالوت إلى المغرب\n فمن بقيتهم البرابرة من الشلوح وسائر الأرياف\n فآتي اللّهُ داود { الملك والحكمة } وهي النبوة\n وقيل: صنعة الدروع ومنطق الطير { وعلمه مما يشاء } من أنواع العلوم والمعارف والأسرار\n وقد دفع الله بأس الكافرين ورد كيدهم في نحرهم\n { ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض } أي: لولا أن الله يدفع بعض الناس ببعض\n فينصر المسلمين على الكافرين\n ويكف فسادهم\n لغلبوا وأفسدوا في الأرض\n\nأو: لولا أن الله نصب السلطان\n وأقام الحكام لينصفوا المظلوم من الظالم\n ويردوا القوي عن الضعيف\n لتواثب الخلق بعضهم على بعض\n وأكل القوي الضعيفَ فيفسد النظام\n أو: لولا أن الله يدفع بالشهود عن الناس في حفظ الأموال والنفوس والدماء والأعراض\n لوقع الفساد في الأرض\n أو: لولا أن الله يدفع بأهل الطاعة والإحسان عن أهل الغفلة والعصيان\n لفسد الأرض بشؤم أهل العصيان\n وفي الخبر عنه صلى الله عليه وسلم:\n \" إنَّ الله يَدْفَعُ بالمُصلِّي مِنْ أمَّتِي عَمَّنْ لا يُصلي\n ويمنْ يُزكيَّ عَمَّنْ لاَ يُزَكِّي\n وبِمنْ يَصُومُ\n عَمَّنْ لاَ يَصُوم\n وبمَنْ يَحُجُّ\n عَمَّنْ لاَ يَحُجُّ\n وبَمَّنْ يُجاهِدُ عَمَّنْ لاَ يُجَاهِدُ\n وَلَوِ اجْتَمَعُوا عَلَى تَرْكِ هذِهِ الأشْياءِ ما أنْظَرَهُمُ الله طَرْفة عَيْنٍ \"\n \nوفي حديث آخر:\n \" لولا عباد الله رُكَّع\n وصبية رُضَّع\n لصبَّ عليكم العذاب صبّاً \"\n \nورَوى جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:\n \" إن الله ليُصْلِحُ بصلاح الرجل - ولده وولدَ ولدهِ\n وأهل دُوَيْرَتِه\n ودويراتٍ حوله\n ولا يزالون في حِفْظِ الله ما دام فيهم \" \nهـ\n فهذا من فضل الله على عباده يصلح طالحهم بصالحهم\n ويُشَفع خيارُهُم في شرارهم\n ولولا ذلك لعوجلوا بالهلاك\n { ولكن الله ذو فضل على العالمين }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:45",
      "similarity": 0.4999301067441609
    },
    {
      "verse": "38:11",
      "similarity": 0.44678939961407166
    },
    {
      "verse": "2:250",
      "similarity": 0.39023984144765667
    },
    {
      "verse": "2:249",
      "similarity": 0.23915549422231178
    },
    {
      "verse": "52:8",
      "similarity": 0.2101821523392596
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002251.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002251.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:251.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}