{
  "chapter": "البقرة",
  "text": "تلك ءايت الله نتلوها عليك بالحق وانك لمن المرسلين",
  "translations": [
    {
      "translation": "Those are Allah's Signs which We recite to you with truth. You are indeed one of the Messengers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the messages of God. We recite them to you in all truth, as indeed you are one of the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are Allah's revelations, which We are conveying to you accurately. And O Muhammad, most surely you are of those who have been sent as Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), these are the revelations which We recite to you for a genuine purpose. Certainly you are one of Our Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah, which We recite to you (O dear Prophet Mohammed – peace and blessings be upon him) with truth; and undoubtedly you are one of the Noble Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah, We recite them to you (O Muhammad) in truth, and surely, you are one of the Messengers (of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the communications of Allah: We recite them to you with truth; and most surely you are (one) of the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the signs of God We recite to thee in truth, and assuredly thou art of the number of the Envoys.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the portents of Allah which We recite unto thee (Muhammad) with truth, and lo! thou art of the number of (Our) messengers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the revelations of God which We recite to you in all truth, for you are truly one of the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the revelations of Allah We rehearse them unto thee with truth, and verily thou art of the sentones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the signs of Allah, which We recite for you in truth, and you are indeed one of the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Signs of Allah: we rehearse them to thee in truth: verily Thou art one of the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Verses of Allah, We recite them to you (O Muhammad SAW) in truth, and surely, you are one of the Messengers (of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah. We recite (them) to you in truth, for you (Prophet Muhammad) are one of the Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are God’s revelations, which We recite to you in truth. You are one of the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah which We recite to you, [O Muhammad], in truth. And indeed, you are from among the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:252] These, verses, are the verses of God We recite to you, O Muhammad (s), as narration, in truth, and assuredly you are one of the Messengers [of God], the emphasis is made here with the particle inna [of innaka, ‘surely you are’], with the remainder of the statement being a rebuttal of the disbelievers’ saying, ‘You are no Messenger’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالإشارة إلى ما تضمنته القصص الماضية وما فيها من العبر ، ولكن الحكم العالية في قوله : { ولولا دفع الله الناس بعضهم ببعض } \\[ البقرة : 251 \\] ، وقد نَزَّلَها منزِلةَ المشاهد لوضوحها وبيانها وجعلت آيات لأنها دلائل على عظم تصرف الله تعالى وعلى سعة علمه .وقوله : { وإنك لمن المرسلين } خطاب للرسول صلى الله عليه وسلم تنويهاً بشأنه وتثبيتاً لقلبه ، وتعريضاً بالمنكرين رسالته . وتأكيد الجملة بإنَّ للاهتمام بهذا الخبر ، وجيء بقوله ( من المرسلين ) دون أن يقول : وإنك لرسول الله ، للرد على المنكرين بتذكيرهم أنه ما كان بدْعاً من الرسل ، وأنه أرسله كما أرسل من قبله ، وليس في حاله ما ينقص عن أحوالهم .\n\n",
      "translations": [
        {
          "translation": "(These are the revelations of Allah) i.e. the Qur'an which relates the events of past nations (which We recite unto thee (Muhammad)) which We send Gabriel with to you (with Truth) to exposit the Truth and falsehood, (and lo! thou art of the number of (the) messengers) to all human beings and jinn;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ } المذكورات { آيَاتُ ٱللَّهِ } الدالة على توحيد ذاته وتعظيم شأنه { نَتْلُوهَا عَلَيْكَ } يا أكمل الرسل { بِٱلْحَقِّ } المطابق للواقع { وَإِنَّكَ لَمِنَ ٱلْمُرْسَلِينَ } [البقرة: 253] المتلوين عليهم آياتنا\n امتناناً لهم بل من أفضلهم وأكملهم إذ:",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تلك } يا محمد\n { آيات الله } والإشارة إلى ما قصَّ من حديث الألوف\n وتمليك طالوت\n وإتيان التابوت\n وانهزام الجبابرة أصحاب جالوت\n { نتلوها } أي: نقصها عليكم { بالحق } أي: بالوجه المطابق الذي لا يَشُك فيه أهل الكتاب وأرباب التواريخ\n { وإنك لمن المرسلين } حيث أخبرت بها من غير تعرف ولا استماع ولم يعهد منك تعلم ولا اطلاع\n فلا يشك أنه مِنْ عند الخبير العليم\n إلا من طبع الله على قلبه\n نعوذ بالله من ذلك\n الإشارة: \" من علامة النُجْحِ في النهايات الرجوع إلى الله في البدايات \" \n فإذا برز المريد لجهاد أعدائه من النفس وَالهوى والشيطان وسائر القُطاع\n واستنصر بالله وتبرأ من حوله وقوته\n كان ذلك علامة على نصره وظفره بنفسه\n وكان سبباً في نجح نهايته\n فيملكه الله الوجود بأسره\n ويفتح عليه من خزائن حكمته\n قال أبو سليمان الداراني \" إذا اعتادت النفوس على ترك الآثام\n جالت في الملكوت ثم عادت إلى صاحبها بطرائف الحكم من غير أن يُؤدّي عالمٌ علماً\n وفي الخبر: \" من عَمِل بما عَلِمَ أورثه الله عِلْمَ ما لم يعلمْ \"\n وكان حينئذٍ رحمة للعباد\n يدفع الله بوجوده العذاب عمن يستحقه من عباده\n وفي الحديث القدسي: \" يقول الله عزّ وجلّ:\n \" إذا كان الغالبَ على عبدي الاشتغالُ بي جعلتُ همته ولذَّته في ذكري\n ورفعت الحجاب فيما بيني وبينه\n لا يسهو إذا سها الناس\n أولئك كَلاَمُهُم كلام الأنبياء\n أولئك الأبطال حقّاً\n أولئك الذين إذا أردتُ بأهلِ الأرض عقوبة أو عذاباً ذكرتهم فصرفته بهم عنهم \" \nحقَّقنا الله بمحبتهم وجعلنا منهم\n\n\n آمين\n ولمَّا ذكر في هذه السورة جملة من الأنبياء والرسل\n وشهد لرسوله صلى الله عليه وسلم أنه من المرسلين ذكر تفضيل بعضهم على بعض في الجملة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:108",
      "similarity": 0.7524816796623077
    },
    {
      "verse": "3:58",
      "similarity": 0.7170754829806126
    },
    {
      "verse": "37:3",
      "similarity": 0.6672386145820823
    },
    {
      "verse": "23:105",
      "similarity": 0.664072571719
    },
    {
      "verse": "28:53",
      "similarity": 0.6567130837711117
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002252.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002252.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:252.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}