{
  "chapter": "البقرة",
  "text": "الشيطن يعدكم الفقر ويامركم بالفحشاء والله يعدكم مغفرة منه وفضلا والله وسع عليم",
  "translations": [
    {
      "translation": "Shaytan promises you poverty and commands you to self-gratification. Allah promises you forgiveness from Him and abundance. Allah is All-Encompassing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan threatens you with want, and orders you (to commit) shameful acts. But God promises His pardon and grace, for God is bounteous and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan holds out to you the threat of poverty and prompts you to adopt a shameless niggardly conduct, but Allah holds out from Himself the promise of pardon and bounty: Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan threatens you with poverty and commands you to commit sin. God promises you forgiveness and favors. God is Munificent and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devil scares you of poverty and bids you to the shameful; and Allah promises you forgiveness from Him, and munificence; and Allah is Most Capable, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shaytan threatens you with poverty and orders you to commit Fahsha' (evil deeds) whereas Allah promises you forgiveness from Himself and bounty, and Allah is All-Sufficient for His creatures' needs, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shaitan threatens you with poverty and enjoins you to be niggardly, and Allah promises you forgiveness from Himself and abundance; and Allah is Ample-giving, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan promises you poverty, and bids you unto indecency; but God promises you His pardon and His bounty; and God is All-embracing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devil promiseth you destitution and enjoineth on you lewdness. But Allah promiseth you forgiveness from Himself with bounty. Allah is All-Embracing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan threatens you with the prospect of poverty and commands you to do foul deeds. But God promises His forgiveness and His bounty. God is bountiful and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan promiseth You poverty and commandeth you to niggardliness, whereas Allah promiseth you forgiveness from Himself and abundance; and Allah is Bounteous, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan frightens you of poverty and prompts you to [commit] indecent acts. But Allah promises you His forgiveness and bounty, and Allah is all-bounteous, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Evil one threatens you with poverty and bids you to conduct unseemly. Allah promiseth you His forgiveness and bounties. And Allah careth for all and He knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shaitan (Satan) threatens you with poverty and orders you to commit Fahsha (evil deeds, illegal sexual intercourse, sins etc.); whereas Allah promises you Forgiveness from Himself and Bounty, and Allah is All-Sufficient for His creatures' needs, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "satan promises you with poverty and orders you to commit what is indecent. But Allah promises you His Forgiveness and bounty from Him. Allah is the Embracer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan promises you poverty, and urges you to immorality; but God promises you forgiveness from Himself, and grace. God is Embracing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan threatens you with poverty and orders you to immorality, while Allah promises you forgiveness from Him and bounty. And Allah is all-Encompassing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:268]   Satan promises you poverty, by making you fear [loss] when you make a voluntary almsgiving, and so you withhold it, and enjoins you to indecency, niggardliness and the impeding of almsgiving; but God promises you, in return for your expenditure, His pardon, for your sins, and His bounty, as sustenance from Him; and God is Embracing, in His bounty, Knowing, the one who expends.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف عن قوله : { أنفقوا من طيبات ما كسبتم الشيطان يَعِدُكُمُ الفقر وَيَأْمُرُكُم بالفحشآء } \\[ البقرة : 267 \\] لأنّ الشيطان يصدّ الناس عن إعطاء خيار أموالهم ، ويغريهم بالشحّ أو بإعطاء الرديء والخبيث ، ويخوّفهم من الفقر إن أعطوا بعض مَالهم .وقدّم اسم الشيطان مسنداً إليه لأنّ تقديمه مؤذن بذمّ الحكم الذي سيق له الكلام وشؤمِه لتحذير المسلمين من هذا الحكم ، كما يقال في مثال علم المعاني «السَّفَّاح في دَار صديقك» ، ولأنّ في تقديم المسند إليه على الخبر الفعلي تَقَوِّيَ الحُكم وتحقيقه .ومعنى { يعدكم } يسوّل لكم وقوعه في المستقبل إذا أنفقتم خيار أموالكم ، وذلك بما يلقيه في قلوب الذين تخلّقوا بالأخلاق الشيطانية . وسمّي الإخبار بحصول أمر في المستقبل وعداً مجازاً لأنّ الوعد إخبار بحصول شيء في المستقبل من جهة المخبِر ، ولذلك يقال : أنجز فلان وعده أو أخلف وعده ، ولا يقولون أنجز خَبَره ، ويقولون صدق خَبَرِه وصدَق وعده ، فالوعد أخصّ من الخبر ، وبذلك يؤذن كلام أئِمة اللغة . فشُبِّه إلقاء الشيطان في نفوسهم توقّع الفقر بوعد منه بحصوله لا محالة ، ووجه الشبه ما في الوعد من معنى التحقق ، وحسَّن هذا المجاز هنا مشاكلته لقوله : { والله يعدكم مغفرة } فإنّه وعد حقيقي .ثم إن كان الوعد يطلق على التعهد بالخير والشر كما هو كلام «القاموس» تبعاً لفصيح ثعلب ففي قوله يعدكم الفقر مجاز واحد ، وإن كان خاصاً بالخير كما هو قول الزمخشري في الأساس ، ففي قوله : { يعدكم الفقر } مجازان .والفقر شدّة الحاجة إلى لوازم الحياة لقلة أو فقد ما يعاوض به ، وهو مشتق من فقار الظهر ، فأصله مصدر فَقَره إذا كسر ظهره ، جعلوا العاجز بمنزلة من لا يستطيع أدنى حركة لأنّ الظَّهر هو مجمع الحركات ، ومن هذا تسميتهم المصيبة فاقرة ، وقاصمة الظهر ، ويقال فَقْر وفُقْر وفَقَر وفُقُر بفتح فسكون ، وبفتحتين ، وبضم فسكون ، وبضمتين ، ويقال رجل فقير ، ويقال رجل فَقْر وصفاً بالمصدر .والفحشاء اسم لفعل أو قول شديد السوء واستحقاققِ الذم عرفاً أو شرعاً . مشتق من الفحش بضم الفاء وسكون الحاء تجاوز الحد . وخصّه الاستعمال بالتجاوز في القبيح ، أي يأمركم بفعل قبيح . وهذا ارتقاء في التحذير من الخواطر الشيطانية التي تدعو إلى الأفعال الذميمة ، وليس المراد بالفحشاء البخل لأنّ لفظ الفحشاء لا يطلق على البخل وإن كان البخيل يسمّى فاحشاً . وإطلاق الأمر على وسوسة الشيطان وتأثير قوته في النفوس مجاز لأنّ الأمر في الحقيقة من أقسام الكلام . والتعريف في الفحشاء تعريف الجنس .{ والله يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلاً والله واسع عَلِيمٌ } .عطف على جملة { الشيطان يعدكم الفقر } لإظهار الفرق بين ما تدعو إليه وساوس الشيطان وما تدعو إليه أوامر الله تعالى ، والوعد فيه حقيقة لا محالة . والقول في تقديم اسم الجلالة على الخبر الفعلي في قوله : { والله يعدكم } على طريقة القول في تقديم اسم الشيطان في قوله : { الشيطان يعدكم الفقر } .ومعنى «واسع» أنّه واسع الفضل ، والوصف بالواسع مشتق من وَسِع المتعدي إذا عمّ بالعطاء ونحوه قال الله تعالى : { ربنا وسعت كل شيء رحمة وعلما } \\[ غافر : 7 \\] ، وتقول العرب : «لا يسعني أن أفعل كذا» ، أي لا أجدُ فيه سعة ، وفي حديث علي في وصف رسول الله صلى الله عليه وسلم \" قد وسع الناسَ بِشْرُه وخُلقُه \" . فالمعنى هنا أنّه وَسِعَ الناس والعالمين بعطائِه .\n\n",
      "translations": [
        {
          "translation": "(The devil promiseth you destitution) makes you scared of poverty upon spending in charity (and enjoineth on you lewdness) by not giving the poor-due. (But Allah promiseth you forgiveness) of your sins for giving the poor-due (from Himself with bounty) with something in exchange as well as a reward in the Hereafter. (Allah is All-Embracing) in that He replaces what you spend and also forgives sins, (All-Knowing) of your intentions and spending.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الشيطان يَعدكم الفقر ويأمركم بالفحشاء } أي: الخصلة القبيحة التي هي البخل\n فتعوّذوا منه بالله\n فإنه { يعدكم مغفرة منه } أي: ستراً لصفات نفوسكم بنوره { وفضلاً } وموهبة من مواهب صفاته لكم وتجلياتها كالغنى المطلق فلا يبقى فيكم خوف الفقر { والله واسع } يسع ذواتكم وصفاتكم وعطاؤكم لا يضيق وعاء جوده بالعطاء ولا ينفد عطاياه { عليمٌ } بمواقع تجلياته واستعدادها واستحقاقها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلشَّيْطَانُ يَعِدُكُمُ ٱلْفَقْرَ } في الإنفاق ويخوفكم منه { وَيَأْمُرُكُم بِٱلْفَحْشَآءِ } أي: البخف المتجاوز عن الحدود { وَٱللَّهُ يَعِدُكُم } فيه { مَّغْفِرَةً } لذنوبكم ناشئة { مِّنْهُ وَفَضْلاً } زائداً على وجه التبرع والإكرام خلفاً لما أنفقتم لطلب رضاه { وَٱللَّهُ وَاسِعٌ } لاضيق في فضله وأحسانه { عَلِيمٌ } [البقرة: 268] بنية من أنفق\n\n\n{ يُؤْتِي الْحِكْمَةَ } أي: سرائر جميع الأعمال المأمورة لعباده { مَن يَشَآءُ } بفضله وجوده { وَمَن يُؤْتَ الْحِكْمَةَ } من العباد { فَقَدْ أُوتِيَ خَيْراً كَثِيراً } لا يحيط بكثرته إلا هو { وَمَا يَذَّكَّرُ } أي: ما يتعظ ويتذكر بهذه الآية { إِلاَّ أُوْلُواْ ٱلأَلْبَابِ } [البقرة: 269] الواصلون إلى لب الأمور\n المائلون عن قشورها المتجهون إلى الله بالعزائم الصحيحة\n المعرضون عن الرخص المؤدية إلى الجرائم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: يقال: وعدته خيراً ووعدته شرّاً، هذا إن ذكر الخير أو الشر، وأما إذا لم يذكر فيقال في الخير: وعدته، وفي الشر: أوعدته، قال الشاعر:\nو { الفحشاء } هنا: البخل والشح. يقول الحقّ جلّ جلاله: { الشيطان يعدكم } أي: يخوفكم { الفقر } بسبب الإنفاق، ويقول في وسوسته: إن أعطيت مالك بقيت فقيراً تتكفف الناس، { ويأمركم بالفحشاء } أي: ويأمركم بالبخل والشح، والعرب تسمي البخيل فاحشاً، وفي الحديث:\n \" البخيلُ بعيدٌ من الله، بعيدُ من الناسِ، بعيد من الجنة قريب من النار. والسخي قريب من الله. قريبٌ من الناس، قريب من الجنة، بعيد من النار. ولجاهل سخيٍّ أحبُّ إلى الله من عابدٍ بخيل \" \nوفي حديث آخر:\n \" إنَّ الله يأخذُ بيد السخيِّ كلما عثر \" \n{ والله يعدكم } في الإنفاق { مغفرة منه } لذنوبكم، وستراً لعيوبكم، { وفضلاً } أي: خَلَفاً أفضل مما أنفقتم في الدنيا والآخرة، { وما أنفقتم من شيء فهو يخلفه } ، { والله واسع } الفضل والعطاء، { عليم } بما أنفقتم، ولماذا أنفقتم، وفيما أخلصتم، لا يخفى عليه شيء من أموركم. الإشارة: إذا توجه المريد إلى الله تعالى، وأراد سلوك طريق التجريد والزهد والانقطاع إلى الله تعالى، تعرض له الشيطان، اختباراً منه تعالى وابتلاء، إذ الحضرة محروسة بالقواطع ليظهر الصادق في الطلب من الكاذب، فيخوفه من الفقر، ويأمره بالوقوف مع الأسباب والعوائد، وهي أفحش المعاصي عند الخواص، إذ إذ الهمة العالية تأنف عن الاشتغال بغير الحضرة الإلهية. والله يعدكم - أيها المتوجهون إليه - مغفرة لذنوبكم، وستراً لعيوبكم، فيغطي وصفكم بوصفه، ونعتكم بنعته، فيوصلكم بما منه إليكم من الفضل والجود، لا بما منكم إليه من المجاهدة والمكابدة،\n[النُّور: 21]، { والله واسع } الجود والإحسان، { عليم } بمن يستحق الفضل والامتنان. ومن نتائج الزهد والانقطاع: ورود الحكمة على لسان العبد وقلبه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:25",
      "similarity": 0.4895572425989312
    },
    {
      "verse": "35:15",
      "similarity": 0.4728287138122356
    },
    {
      "verse": "59:8",
      "similarity": 0.42116740038661554
    },
    {
      "verse": "2:169",
      "similarity": 0.39767926694247463
    },
    {
      "verse": "28:24",
      "similarity": 0.3976197270477535
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002268.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002268.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:268.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}