{
  "chapter": "البقرة",
  "text": "يؤتى الحكمة من يشاء ومن يؤت الحكمة فقد اوتى خيرا كثيرا وما يذكر الا او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "He gives wisdom to whoever He wills and he who has been given wisdom has been given great good. But no one pays heed but people of intelligence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives wisdom to whomsoever He please; and those who are bestowed wisdom get good in abundance. Yet none remembers this save men of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He bestows wisdom upon anyone He wills, and he who is given wisdom is in fact given great wealth, but only those who have common sense learn lessons from these things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gives wisdom to anyone whom He wants. Whoever is given wisdom, certainly, has received much good. Only people of reason can grasp this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bestows wisdom on whomever He wills; and whoever receives wisdom has received abundant goodness; but none heed advice except men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He grants Hikmah to whom He wills, and he, to whom Hikmah is granted, is indeed granted abundant good. But none remember (will receive admonition) except men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He grants wisdom to whom He pleases, and whoever is granted wisdom, he indeed is given a great good and none but men of understanding mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives the Wisdom to whomsoever He will, and whoso is given the Wisdom, has been given much good; yet none remembers but men possessed of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He giveth wisdom unto whom He will, and he unto whom wisdom is given, he truly hath received abundant good. But none remember except men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He grants wisdom to whom He will; and whoever is granted wisdom has indeed been granted abundant wealth. Yet none bear this in mind except those endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He vouchsafeth wisdom unto whomsoever He will, and whosoever is vouchsafed wisdom is of a surety vouchsafed abundant good, and none receiveth admonition Save men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He grants wisdom to whomever He wishes, and he, who is given wisdom, is certainly given an abundant good, and none takes admonition except those who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He granteth wisdom to whom He pleaseth; and he to whom wisdom is granted receiveth indeed a benefit overflowing; but none will grasp the Message but men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He grants Hikmah to whom He pleases, and he, to whom Hikmah is granted, is indeed granted abundant good. But none remember (will receive admonition) except men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives wisdom to whom He will, and he who is given wisdom has been given a lot of good. Yet none will remember except the owners of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives wisdom to whomever He wills. Whoever is given wisdom has been given much good. But none pays heed except those with insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives wisdom to whom He wills, and whoever has been given wisdom has certainly been given much good. And none will remember except those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:269] He gives wisdom, that is, the profitable knowledge that leads to [righteous] action, to whomever He will, and he who is given wisdom, has been given much good, because he will end up in perpetual bliss; yet none remembers (the tā’ of yadhdhakkar has been assimilated with the dhāl), that is to say, [none] is admonished, but the people of pith, possessors of intellects.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned His favour, saying: (He giveth wisdom unto whom He will) i.e. prophethood to 47 Muhammad (pbuh); it is also said that wisdom here means the interpretation of the Qur'an; as it is said that it refers to being in the right in speech, action and opinion, (and he unto him wisdom) being in the right in speech, action and opinion (is given, he truly hath received abundant good. But none remember) takes admonitions from the similes of the Qur'an or wisdom (except men of understanding) those who have minds from among people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { يُؤْتِي الْحِكْمَةَ مَن يَشَآءُ } قالَ زيدُ بن علي عليهما السَّلامُ: فالحِكْمةُ: الأَمانَةُ، والحِكمةُ: البَيانُ، والحِكمةُ: الفِقهُ، والحكِمةُ: العَقلُ والحِكمةُ: الفَهمُ\n\n\n\n\nوقولهُ تعالى: { وَمَا يَذَّكَّرُ إِلاَّ أُوْلُواْ ٱلأَلْبَابِ } معناهُ أُولوا العُقولِ\n واحدُهَا لِبٌ\n ويقالُ: رجلٌ لَبيبٌ، ورِجالٌ أَلبَّاءُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {He gives wisdom to whom He wills}, said Zayd ibn Ali, peace be upon them both: So wisdom is trustworthiness, and wisdom is explanation, and wisdom is jurisprudence, and wisdom is intellect and wisdom is understanding.\n\nAnd His saying - Almighty - {And none remembers except those of understanding hearts} Its meaning is those of the minds\n One of them is a lion.\n\n\nIt is said: \"A man is a lover, and men are passionate.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يؤتي الحكمة من يشاء } لإخلاصه في الإنفاق وكونه فيه بالله\n فيعطيه حكمة الإنفاق لينفق من الحكمة الإلهية لكونه متصفاً بصفاته { ومن يؤت الحكمة فقد أوتي خيراً كثيراً } لأنها أخصّ صفات الله { وما يَذكر } أنّ الحكمة أشرف الأشياء وأخصّ الصفات { إلا اولو الألبَاب } الذين نوّر الله عقولهم بنور الهداية فصفاها عن شوائب الوهم وقشور الرسوم والعادات وهو النفس\n فجزاء الإنفاق الأول هو الإضعاف\n وجزاء الثاني هو الجنّة الصفاتية المثمرة للإضعاف\n وجزاء الثالث هو الحكمة اللازمة للوجود والموهوب\n فانظر كم بينها من التفاوت",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قال البيضاوي: الحكمة: تحقيق العلم وإتقان العلم. هـ. وقيل: هي سرعة الجواب وإصابة الصواب، وقيل: كل فصل جَزْلٍ من قول أو فعل. يقول الحقّ جلّ جلاله: { يؤتي } الحق تعالى { الحكمة من يشاء } من عباده، وهي التفقّه في الدين والتبصر في الأمور. قال صلى الله عليه وسلم:\nوقيل: الحكمة: الإصابة في الرأي. وقيل: الفهم في كتاب الله. وقيل الفهم عن الله. { ومن يؤت الحكمة } أي: أعطيها، { فقد أوتي خيراً كثيراً } لأنه حاز خيرَ الدارَيْن، ولا شك أن من حقَّق العلم بالله وبأحكامه، وأتقنَ العملَ بما أمره الله به، فقد صفا قلبه، وتطهر سره، فصار من أولي الألباب ولذلك قال عقبه: { وما يذكر إلا أولوا الألباب }. الإشارة: الحكمة هي: شهود الذات مرتديةً بأنوار الصفات، وهي حقيقة المعرفة، ومن عرف الله هابه، ولذلك قال عليه الصلاة والسلام:\n \" رأس الحكمة مخافة الله \" \nوقيل: هي تجريد السر لورود الإلهام، وقيل: هي النور المفرق بين الوسواس والإلهام، وقيل: شهود الحق تعالى في جميع الأحوال. والتحقيق: أن الحكمة هي إبداع الشيء وإتقانه حتى يأتي على غاية الكمال، ويجري ذلك في العلم والعمل والحال والمعرفة. وقال القُشَيْري: الحكمة: أن يَحكم عليك خاطر الحق لا داعي الباطل، وأن تحكم قواهر الحق لا زواجر الشيطان. ويقال: الحكمة: صواب الأمر، ويقال: هي ألا تغلب عليك رعونات البشرية، ومن لا حكم له على نفسه لا حُكْمَ له على غيره. ويقال: الحكمة: موافقة أمر الله، والسفه: مخالفة أمره، ويقال: الحكمة شهود الحق، والسفه: شهود الغير. قاله المحشي. واعلم أن الصوفية، في اصطلاحهم، يُعبِّرون عن أسرار الذات بالقدرة، وعن أنوار الصفات - وهي ظهور آثارها - بالحكمة. فالوجودُ كله قائم بين الحكمة والقدرة، فالقدرة تُبرز الأشياء، والحكمة تَسترها. فربط الأشياء واقترانها بأسبابها تُسمى عندهم الحكمة، وإنفاذ الأمر وإظهار يُسمى القدرة، فمن وقف مع الحكمة حجب عن شهود القدرة، وكان محجوباً عن الله. ومن نفذ إلى شهود القدرة ولم يرتبط مع الأسباب والعوائد كان عارفاً محبوباً. فالعارف الكامل هو الذي جمع بين شهود القدرة وإقرار الحكمة، فأعطى كل ذي حق حقه، وَوَفَّى كلَّ ذي قسط قسطه، لكن يكون ذلك ذوقاً وكشفاً، لا علماً وتقليداً. وبالله تعالى التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.8255254505799718
    },
    {
      "verse": "39:18",
      "similarity": 0.717621088842712
    },
    {
      "verse": "65:10",
      "similarity": 0.6773176860914075
    },
    {
      "verse": "14:52",
      "similarity": 0.6664351261572823
    },
    {
      "verse": "13:19",
      "similarity": 0.6594674151047507
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:269.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:269.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:269.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}