{
  "chapter": "البقرة",
  "text": "قول معروف ومغفرة خير من صدقة يتبعها اذى والله غنى حليم",
  "translations": [
    {
      "translation": "Correct and courteous words accompanied by forgiveness are better than sadaqa followed by insulting words. Allah is Rich Beyond Need, All-Forbearing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying a word that is kind, and forgiving is better than charity that hurts. (Do not forget that) God is affluent and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word and forbearance is better than that charity which is followed up by insult or injury. Allah is Self-Sufficient and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instructive words and forgiveness are better than charity that may cause an insult to the recipient. God is Rich and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Speaking kind words and pardoning are better than charity followed by injury; and Allah is the Independent, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and forgiving of faults are better than Sadaqah (charity) followed by injury. And Allah is Rich (free of all needs) and He is Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind speech and forgiveness is better than charity followed by injury; and Allah is Self-sufficient, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Honourable words, and forgiveness, are better than a freewill offering followed by injury; and God is All-sufficient, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word with forgiveness is better than almsgiving followed by injury. Allah is Absolute, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word and forgiveness is better than a charitable deed followed by hurtful words: God is self-sufficient and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A reputable word and forgiveness are better than an alms which hurt followeth; and Allah is Self-Sufficient, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An honourable reply [in response to the needy] and forgiving [their annoyance] is better than a charity followed by affront. Allah is all-sufficient, most forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and the covering of faults are better than charity followed by injury. Allah is free of all wants, and He is Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and forgiving of faults are better than Sadaqah (charity) followed by injury. And Allah is Rich (Free of all wants) and He is Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word and forgiveness is better than charity followed by injury. Allah is the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and forgiveness are better than charity followed by insults. God is Rich and Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind speech and forgiveness are better than charity followed by injury. And Allah is Free of need and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:263]   Honourable words, kind talk and a generous reply to the beggar, and forgiveness, towards him for his persistence, are better than a voluntary almsgiving followed by injury, through reproach and deriding him for his begging; and God is Independent, of the voluntary almsgiving of His servants, Forbearing, in His delaying the punishment of the reproachful and injurious one.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتخلُّص من غرض التنويه بالإنفاق في سبيل الله إلى التنويه بضرب آخر من الإنفاق وهو الإنفاق على المحاويج من الناس ، وهو الصدقات . ولم يتقدم ذكر للصدقة إلاّ أنّها تخطر بالبال عند ذكر الإنفاق في سبيل الله ، فلما وصف الإنفاق في سبيل الله بصفة الإخلاص لله فيه بقوله : { الذين ينفقون أموالهم في سبيل الله ثم لا يتبعون ما انفقوا } \\[ البقرة : 262 \\] الآية انتقل بمناسبة ذلك إلى طرد ذلك الوصف في الإنفاق على المحتاجين؛ فإنّ المنّ والأذى في الصدقة أكثر حُصولاً لكون الصدقة متعلّقة بأشخاص معيّنين ، بخلاف الإنفاق في سبيل الله فإن أكثر من تنالهم النفقة لا يعلمهم المنفِق .فالمنّ على المتصدّق عليه هو تذكيره بالنعمة كما تقدم آنفاً .ومن فقرات الزمخشري في «الكَلِم النَّوابغ» : «طَعْمُ الآلاء أحْلى من المنّ . وهوَ أمَرُّ من الآلاء عند المنّ» الآلاء الأول النعم والآلاء الثاني شَجر مُر الورق ، والمنّ الأول شيء شِبْه العسل يقع كالنَّدَى على بعض شجر بادية سِينا وهو الذي في قوله تعالى : { وأنزلنا عليكم المن والسلوى } \\[ البقرة : 57 \\] ، والمنّ الثاني تذكير المنَعم عليه بالنعمة .والأذى الإساءة والضرّ القليل للمنعم عليه قال تعالى : { لن يضروكم إلا أذى } \\[ آل عمران : 111 \\] ، والمراد به الأذى الصريح من المنعِم للمنعم عليه كالتطاول عليه بأنّه أعطاه ، أو أن يتكبّر عليه لأجل العطاء ، بله تعيِيره بالفقر ، وهو غير الأذى الذي يحصل عند المن . وأشار أبو حامد الغزالي في كتاب الزكاة من «الإحياء» إلى أنّ المنّ له أصل ومغرس وهو من أحوال القلب وصفاته ، ثم تتفرّع عليه أحوال ظاهرة على اللسان والجوارح . ومنبع الأذى أمران : كراهية المعطي إعطاءَ ماله وشدّةُ ذلك على نفسه ورؤيتُه أنّه خير من الفقير ، وكلاهما منشؤهُ الجهل؛ فإنّ كراهية تسليم المال حمق لأنّ من بذل المال لطلب رضا الله والثواب فقد علم أنّ ما حصل له من بذل المال أشرف ممّا بذله ، وظنَه أنّه خير من الفقير جهل بِخطر الغنَى ، أي أنّ مراتب الناس بما تتفاوت به نفوسهم من التزكية لا بعوارض الغنى والفقر التي لا تنشأ عن درجات الكمال النفساني .ولما حذّر الله المتصدّق من أن يؤذي المتصدّق عليه عُلِم أنّ التحذير من الإضرار به كشتمه وضربه حاصلٌ بفحوى الخطاب لأنّه أوْلى بالنهي .أوْسع اللَّهُ تعالى هذا المقام بيَاناً وترغيباً وزجراً بأساليب مختلفة وتفنّنات بديعة فنّبهنا بذلك إلى شدّة عناية الإسلام بالإنفاق في وجوه البرّ والمعُونة .وكيف لا تكون كذلك وقوام الأمة دوران أموالها بينها ، وإنّ من أكبر مقاصد الشريعة الانتفاع بالثروة العامة بين أفراد الأمة على وجوه جامعة بين رعْي المنفعة العامة ورعي الوجدان الخاص ، وذلك بمراعاة العدل مع الذي كدّ لجمع المال وكسبه ، ومراعاةِ الإحسان للذي بطَّأ به جُهده ، وهذا المقصد من أشرف المقاصد التشريعية .ولقد كان مقدار الإصابة والخطإ فيه هو ميزان ارتقاء الأمم وتدهورها ، ولا تجد شريعة ظهرت ولا دعاة خير دعَوا إلاّ وهم يجعلون لتنويل أفراد الأمة حَظاً من الأموال التي بين أيدي أهل الثروة وموضعاً عظيماً من تشريعهم أو دعوتهم ، إلاّ أنّهم في ذلك متفاوتون بين مقارب ومقصِّر أو آمِل ومُدَبِّر ، غير أنّك لا تجد شريعة سدّدت السهم لهذا الغرض . وعرفت كيف تفرق بين المستحبّ فيه والمفتَرض . ومثل هذه الشريعة المباركة ، فإنّها قد تصرّفت في نظام الثروة العامة تصرّفاً عجيباً أقامته على قاعدة توزيع الثروة بين أفراد الأمة ، وذلك بكفاية المحتاج من الأمة مؤونة حاجته ، على وجوه لا تحرم المكتسب للمال فائدة اكتسابه وانتفاعه به قبل كل أحد .فأول ما ابتدأت به تأمين ثقة المكتسب بالأمن على ماله من أن ينتزعه منه مُنتزع إذ قال تعالى : { يأيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل } \\[ النساء : 29 \\] وقال النبي صلى الله عليه وسلم في خطبة حجة الوداع : « إن دماءَكم وأموالكم حرام عليكم كحرمة يومكم هذا في شهركم هذا في بلدكم هذا » سمع ذلك منه مائة ألف نفس أو يزيدون وتناقلوه في آفاق الإسلام حتى بلغ مبلغ التواتر ، فكان من قواعد التشريع العامة قاعدة حفظ الأموال لا يستطيع مسلم إبطالها .وقد أتْبعت إعلان هذه الثقةِ بحفظ الأموال بتفاريع الأحكام المتعلّقة بالمعاملات والتوثيقات ، كمشروعية الرهن في السلف والتوثّق بالإشهاد كما تُصرّح به الآيات الآتية وما سوى ذلك من نصوص الشريعة تنصيصاً واستنباطاً .ثم أشارت إلى أنّ من مقاصدها ألاّ تبقى الأموال متنقّلة في جهة واحدة أو عائلة أو قبيلة من الأمة بل المقصد دورانها بقوله تعالى في آية الفيء : { ما أفاء الله على رسوله من أهل القرى فللَّه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل كَيْلا يكون دُولةً بين الأغنياء منكم } \\[ الحشر : 7 \\] ، فضمير يكون عائد إلى ما أفاء الله باعتبار كونه مالاً أي كيلا يكون المال دُولة . والدُّولة ما يتداوله الناس من المال ، أي شرْعنا صرفه لمن سمّيناهم دون أن يكون لأهل الجيش حق فيه ، لينال الفقراءُ منه حظوظهم فيصبحوا أغنياء فلا يكون مُدالاً بين طائفة الأغنياء كما كانوا في الجاهلية يأخذ قادتهم المِرْبَاع ويأخذ الغزاة ثلاثة الأرباع فيبقى المال كله لطائفة خاصة .ثم عمدت إلى الانتزاع من هذا المال انتزاعاً منظّماً فجعلت منه انتزاعاً جبرياً بعضه في حياة صاحب المال وبعضه بعد موته . فأما الذي في حياته فهو الصدقات الواجبة ، ومنها الزكاة ، وهي في غالب الأحوال عشر المملوكات أو نصف عشرها أو ربع عشرها . وقد بيّن النبي صلى الله عليه وسلم وجه تشريعها بقوله لمعاذ بن جبل حين أرسله إلى اليمن« إن الله فرض عليهم زكاة تُؤخذ من أغنيائهم فتردّ على فقرائهم » وجعل توزيع ما يتحصّل من هذا المال لإقامة مصالح الناس وكفاية مؤن الضعفاء منهم ، فصاروا بذلك ذوي حق في أموال الأغنياء ، غير مهينين ولا مهددّين بالمنع والقساوة . والتفت إلى الأغنياء فوعدهم على هذا العطاء بأفضل ما وُعد به المحسنون ، من تسميته قرضاً لله تعالى ، ومن توفير ثوابه ، كما جاءت به الآيات التي نحن بصدد تفسيرها .ويلحق بهذا النوع أخذ الخمس من الغنيمة مع أنّها حق المحاربين ، فانتزع منهم ذلك وقال لهم : { واعلموا أنّ ما غنمتم من شيء فإنّ للَّه خمسه وللرسول } إلى قوله { إن كنتم آمنتم بالله } \\[ الأنفال : 41 \\] فحَرضهم على الرضا بذلك ، ولا شك أنّه انتزعه من أيدي الذين اكتسبوه بسيوفهم ورماحهم . وكذلك يلحق به النفقات الواجبة غير نفقة الزوجة لأنّها غير منظور فيها إلى الانتزاع إذ هي في مقابلة تألُّف العائلة ، ولا نفقةِ الأولاد كذلك لأنّ الداعي إليها جبلِيّ . أما نفقة غير البنين عند من يوجب نفقة القرابة فهي من قسم الانتزاع الواجب ، ومن الانتزاع الواجب الكفارات في حنث اليمين ، وفطر رمضان ، والظهار ، والإيلاء ، وجزاء الصيد . فهذا توزيع بعض مال الحي في حياته .وأما توزيع المال بعد وفاة صاحبه فذلك ببيان فرائض الإرث على وجه لا يقبل الزيادة والنقصان . وقد كان العرب يعطون أموالهم لمن يحبّون من أجنبي أو قريب كما قدمنا بيانه في قوله : { كتب عليكم إذا حضر أحدكم الموت } ( 180 ) ، وكان بعض الأمم يجعل الإرث للأكبر .وجعل توزيع هذه الفرائض على وجه الرحمة بالناس أصحاب الأموال ، فلم تعط أموالهم إلاّ لأقرب الناس إليهم ، وكان توزيعه بحسب القرب كما هو معروف في مسائل الحجب من الفرائض ، وبحسب الأحوجية إلى المال ، كتفضيل الذكر على الأنثى لأنّه يعول غيره والأنثى يعولها غيرها . والتفت في هذا الباب إلى أصحاب الأموال فترك لهم حقّ التصرّف في ثلث أموالهم يعينون من يأخذه بعد موتهم على شرط ألاّ يكون وارثاً ، حتى لا يتوسلوا بذلك إلى تنفيل وارث على غيره .وجعلت الشريعة من الانتزاع انتزاعاً مندوباً إليه غير واجب ، وذلك أنواع المواساة بالصدقات والعطايا والهدايا والوصايا وإسلاف المعسر بدون مراباة وليس في الشريعة انتزاع أعيان المملوكات من الأصول فالانتزاع لا يعدو انتزاع الفوائد بالعدالة والمساواة .وجملة { قول معروف } إلى آخرها مستأنفة استئنافاً بيانياً . وتنكير { قول معروف } للتقليل ، أي أقَلُّ قول معروف خير من صدقة يتبعها أذى . والمعروف هو الذي يعرفه الناس ، أي لا ينكرونه . فالمرَاد به القول الحسن وهو ضدّ الأذى .والمغفرة هنا يراد بها التجاوز عن الإساءة أي تجاوز المتصدق عن الملحّ أو الجافي في سؤاله إلحاحَهُ أو جفاءهُ مثل الذي يسأل فيقول : أعطني حقّ الله الذي عندك أو نحو ذلك ، ويراد بها أيضاً تجاوز الله تعالى عن الذنوب بسبب تلك الصدقة إذا كان معها قول معروف ، وفي هذا تعْريض بأنّ الأذى يوشك أنْ يبطل ثواب الصدقة .وقوله : { والله غني حليم } تذييل للتذكير بصفتين من صفات الله تعالى ليتخلّق بهما المؤمنون وهما : الغِنَى الراجع إليه الترفّع عن مقابلة العطية بما يبرد غليل شحّ نفس المعطي ، والحلمُ الراجع إليه العفو والصفح عن رعونة بعض العُفاة .\n\n",
      "translations": [
        {
          "translation": "(A kind word) a good word for your brother, in his absence, by praying for him and praising him in front of other people, (with forgiveness) that overlooks any misdeed (is better) for him and you (than almsgiving followed by injury) than reminding him about your favour upon him which will hurt him. (Allah is Absolute) in His freedom from the need of such a person's charity, (Clement) for He does not hasten the punishment of this person.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nثم قال: { قول مَعْروف ومَغْفرة خيرٌ من صدَقَة يَتْبعها أَذَىً } إذ القول الجميل\n وإن كان بالردّ\n يفرح قلبه\n ويروّح روحه\n والصدقة إنما تنفع جسده ولا تفرّح القلب إلا بالتبعية وتصوّر النفع\n فإذا قارن ما ينفع الجسد ما يؤذي الروح تكدّر النفع وتنغص\n ولم يقع في مقابلة الفرح الحاصل من القول الجميل\n ولو لم يكن مع التنغيص أيضاً لأن الروحانيات أشرف وأحسن وأوقع في النفوس { والله غنيّ } عن الصدقة المقرونة بالأذى\n فيعطي المستحق من خزائن غيبه { حليم } لا يعاجل بالعقوبة\n { مثل الذين يُنْفِقون أموَالهم ابْتِغاء مرضاة الله } هذا هو القسم الثاني من الإنفاق\n فضّله على الأول بتشبيهه بالجنة\n فإن الجنة مع إيتاء أكلها تبقى بحالها بخلاف الحبة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَوْلٌ مَّعْرُوفٌ } رد جميل للسائل ناشئ من حسن الخلق { وَمَغْفِرَةٌ } من الله بعد رده متحسراً على نعمة الإنفاق { خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَآ أَذًى } إذ بذلك القول يجرى الثواب وبتلك الصدقة يستحق العقاب { وَٱللَّهُ غَنِيٌّ } عن إنفاقكم بالمن والأذى للفقراء الذين هم من عيال الله { حَلِيمٌ } [البقرة: 263] لا يعجل بمؤاخذة من يمن ويؤذي\n\n\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله الغني الحليم مقتضى إيمانكم أن { لاَ تُبْطِلُواْ صَدَقَٰتِكُم } عند الله { بِٱلْمَنِّ وَٱلأَذَىٰ } حتى لا تعاقبوا عليها بأشد العقاب { كَ } الكافر { ٱلَّذِي يُنْفِقُ مَالَهُ رِئَآءَ ٱلنَّاسِ وَ } الحال أنه { لاَ يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلآخِرِ } المعد لجزاء الأعمال { فَمَثَلُهُ } أي: مثل المرائي في أنفاقه في يوم الجزاء { كَمَثَلِ صَفْوَانٍ } حجرٍ أملسٍ { عَلَيْهِ تُرَابٌ } اجتمع من هبوب الرياح فطرح فيه البذور لتنبت وتثمر { فَأَصَابَهُ وَابِلٌ } مطر عظيم القطر { فَتَرَكَهُ صَلْداً } أملس كما كان\n وذهب بالبذور والتراب إلى حيث { لاَّ يَقْدِرُونَ عَلَىٰ } تحصيل { شَيْءٍ مِّمَّا كَسَبُواْ } وبذروا عليه { وَٱللَّهُ } الهادي للكل { لاَ يَهْدِي ٱلْقَوْمَ ٱلْكَافِرِينَ } [البقرة: 264] المبطلين بالمن والأذى حكمة الله المتعلقة لتربية الفقراء وتقوية العجز والضعف\n فلا بد للمؤمن أن يجتنب عن أمثاله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { قول }: مبتدأ، و { خير }: خبر، والمسوِّغ الصفةُ. يقول الحقّ جلّ جلاله: { قول } جميل يقوله الإنسان للسائل في حال رده، حيث لم يجد ما يعطيه، { خير } وأفضل عند الله من الصدقة التي يتبعها المن والأذى، ومثال القول المعروف: الله يرزقنا وإياك رزقاً حسناً. والله يغنينا وإياك من فضله العظيم، وشبه ذلك من غير تعبيس ولا كراهية. { ومغفرة } للسائل والعفو عن جفوته وإلحاحه، { خير } أيضاً { من صدقة يتبعها } مَنٍّ، أو { أذى } للسائل، علم الحق جلّ جلاله أن الفقير إذا رُدَّ بغير نوال شقَّ عليه، فربما أطلق لسانه وأظهر الشكوى فأمر المسؤول بالعفو والتواضع. ولو شاء الحقّ تعالى لأغنى الجميع، لكنه أعطى الأغنياء ليظهر شكرهم، وابتلى الفقراء لينظر كيف صبرهم، { والله } تعالى { غني } عن أنفاق يصحبه مَنٌ أو أذى، { حليم } عن معالجة من يَمُنُّ أو يؤذي بالعقوبة. والله تعالى أعلم. الإشارة: يُفهم من الآية أن حسنَ الخلق، ولينَ الجانب، وخفض الجناح، وكف الأذى، وحمل الجفاء، وشهود الصفاء، من أفضل الأعمال وأزكى الأحوال وأحسن الخلال، وفي الحديث:\n \" إنَّ حُسْن الخُلق يعدل الصيام والقيام \". \nوفي قوله: { والله غني حليم }: تربية للسائل والمسؤول، فتربية السائل: أن يستغني بالغنيِّ الكبير عن سؤال العبد الفقير، ويكتفي بعلم الحال عن المقال، وتربية المسؤول: أن يحلم عن جفوة السائل فيتلطف في الخطاب، ويحسن الرد والجواب. قال في شرح الأسماء: والتخلق بهذا الاسم - يعني الحليم - بالصفح عن الجنايات، والسمح فيما يقابلونه به من الإساءات، بل يجازيهم بالإحسان، تحقيقاً للحلم والغفران. هـ.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:59",
      "similarity": 0.434223973484428
    },
    {
      "verse": "9:61",
      "similarity": 0.42846782411862383
    },
    {
      "verse": "52:32",
      "similarity": 0.40890520381404477
    },
    {
      "verse": "4:16",
      "similarity": 0.38504682377932264
    },
    {
      "verse": "14:12",
      "similarity": 0.375143042011693
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002263.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002263.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:263.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}