{
  "chapter": "البقرة",
  "text": "ان الله لا يستحى ان يضرب مثلا ما بعوضة فما فوقها فاما الذين ءامنوا۟ فيعلمون انه الحق من ربهم واما الذين كفروا۟ فيقولون ماذا اراد الله بهذا مثلا يضل به كثيرا ويهدى به كثيرا وما يضل به الا الفسقين",
  "translations": [
    {
      "translation": "Allah is not ashamed to make an example of a gnat or of an even smaller thing. As for those who have iman, they know it is the truth from their Lord. But as for those who are kafir, they say, 'What does Allah mean by this example?' He misguides many by it and guides many by it. But He only misguides the deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is not loath to advance the similitude of a gnat or a being more contemptible; and those who believe know whatever is from the Lord is true. But those who disbelieve say: \"What does God mean by this parable?\" He causes some to err this way, and some He guides; yet He turns away none but those who transgress,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well, Allah is not ashamed to cite the similitude of a gnat or of something even more insignificant than this. As for those who believe, they come to know from the same similitude that it is the Revelation from their Lord; but those who disbelieve, say, \"What does Allah mean by such similitudes?\" Allah leads astray many and guides many to the right way by the same thing. And He leads astray only those who disobey Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not hesitate to set forth parables of anything even a gnat. The believers know that it is the truth from their Lord, but those who deny the truth say, \"What does God mean by such parables?\" In fact, by such parables God misleads and guides many. However, He only misleads the evil doers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah does not, for the sake of explanation, shy to illustrate an example of anything, whether it is of a gnat or something further (inferior) than it; so the believers know it is the Truth from their Lord; as for the disbelievers, they say, “What does Allah intend by such an example?” He misleads many thereby, and He guides many thereby; and with it He misleads only those who are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah is not ashamed to set forth a parable even of a mosquito or so much more when it is bigger (or less when it is smaller) than it. And as for those who believe, they know that it is the truth from their Lord, but as for those who disbelieve, they say: \"What did Allah intend by this parable\" By it He misleads many, and many He guides thereby. And He misleads thereby only the Fasiqin (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah is not ashamed to set forth any parable-- (that of) a gnat or any thing above that; then as for those who believe, they know that it is the truth from their Lord, and as for those who disbelieve, they say: What is it that Allah means by this parable: He causes many to err by it and many He leads aright by it! but He does not cause to err by it (any) except the transgressors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is not ashamed to strike a similitude even of a gnat, or aught above it. As for the believers, they know it is the truth from their Lord; but as for unbelievers, they say, 'What did God desire by this for a similitude?' Thereby He leads many astray, and thereby He guides many; and thereby He leads none astray save the ungodly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah disdaineth not to coin the similitude even of a gnat. Those who believe know that it is the truth from their Lord; but those who disbelieve say: What doth Allah wish (to teach) by such a similitude? He misleadeth many thereby, and He guideth many thereby; and He misleadeth thereby only miscreants;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not disdain to give a parable about a gnat or a smaller creature. The faithful know that it is the truth from their Lord, but those who deny the truth ask, \"What could God mean by this parable?\" He lets many go astray through it, and guides many by it. But He makes only the disobedient go astray:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah is not ashamed to propound a similitude, be it of a gnat or of aught above it. Then as to those who believe, they know that it is the truth from their Lord. And to those who disbelieve, they say what intendeth God by similitude? He sendeth many astray thereby, and He guideth many thereby, and He sendeth not astray thereby any except the transgressors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah is not ashamed to draw a parable whether it is that of a gnat or something above it. As for those who have faith, they know it is the truth from their Lord; and as for the faithless, they say, ‘What did Allah mean by this parable?’ Thereby He leads many astray, and thereby He guides many; and He leads no one astray thereby except the transgressors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah disdains not to use the similitude of things, lowest as well as highest. Those who believe know that it is truth from their Lord; but those who reject Faith say: \"What means Allah by this similitude?\" By it He causes many to stray, and many He leads into the right path; but He causes not to stray, except those who forsake (the path),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah is not ashamed to set forth a parable even of a mosquito or so much more when it is bigger (or less when it is smaller) than it. And as for those who believe, they know that it is the Truth from their Lord, but as for those who disbelieve, they say: \"What did Allah intend by this parable?\" By it He misleads many, and many He guides thereby. And He misleads thereby only those who are Al-Fasiqun (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is not shy to strike a parable whatsoever a gnat or larger. Those who believe know that it is the truth from their Lord. As for those who disbelieve they ask: 'What could Allah mean by this parable? By it, Allah misleads many and guides many.' But He misleads none except the evildoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not shy away from making an example of a gnat, or something above it. As for those who believe, they know that it is the Truth from their Lord. But as for those who disbelieve, they say, “What did God intend by this example?” He leads astray many thereby, and He guides many thereby; but He misleads thereby only the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah is not timid to present an example - that of a mosquito or what is smaller than it. And those who have believed know that it is the truth from their Lord. But as for those who disbelieve, they say, \"What did Allah intend by this as an example?\" He misleads many thereby and guides many thereby. And He misleads not except the defiantly disobedient,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:26] God is not ashamed to strike, to make, a similitude (mathal: is the first direct object; mā either represents an indefinite noun described by what comes after it and constitutes a second direct object, meaning ‘whatever that similitude may be’; or it [the mā] is extra to emphasise the vileness [involved], so that what follows constitutes the second direct object); even of a gnat, (ba‘ūda is the singular of ba‘ūd), that is, small flies; or anything above it, that is, larger than it, so that this explanation is not affected [by the size of the creature] with regard to the judgement [God is making]; as for the believers, they know it, the similitude, is the truth, established and given in this instance, from their Lord; but as for disbelievers, they say, ‘What did God desire by this for a similitude?’ (mathalan is a specification, meaning, ‘by this similitude’; mā is an interrogative of rejection and is the subject; dhā means alladhī, whose relative clause contains its predicate, in other words, ‘what use is there in it?’). God then responds to them saying: Thereby, that is, by this similitude, He leads many astray, from the truth on account of their disbelieving in it, and thereby He guides many, believers on account of their belief in it; and thereby He leads none astray except the wicked, those that reject obedience to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقد يبدو في بادىء النظر عدم التناسب بين مساق الآيات السالفة ومساق هاته الآية ، فبينما كانت الآية السابقة ثناء على هذا الكتاب المبين ، ووصف حالي المهتدين بهديه والناكبين عن صراطه وبيان إعجازه والتحدي به مع ما تخلل وأعقب ذلك من المواعظ والزواجر النافعة والبيانات البالغة والتمثيلات الرائعة ، إذا بالكلام قد جاء يخبر بأن الله تعالى لا يعبأ أن يضرب مثلاً بشيء حقير أو غير حقير ، فحقيق بالناظر عند التأمل أن تظهر له المناسبة لهذا الانتقال ، ذلك أن الآيات السابقة اشتملت على تحدي البلغاء بأن يأتوا بسورة مثل القرآن ، فلما عجزوا عن معارضة النظم سلكوا في المعارضة طريقة الطعن في المعاني فلبسوا على الناس بأن في القرآن من سخيف المعنى ما ينزه عنه كلام الله ليصلوا بذلك إلى إبطال أن يكون القرآن من عند الله بإلقاء الشك في نفوس المؤمنين وبذر الخصيب في تنفير المشركين والمنافقين .روى الواحدي في «أسباب النزول» عن ابن عباس أن الله تعالى لما أنزل قوله : { إن الذين تدعون من دون الله لن يخلقوا ذباباً ولو اجتمعوا له وإن يسلبهم الذباب شيئاً لا يستنقذوه منه } \\[ الحج : 73 \\] وقوله : { مثل الذين اتخذوا من دون الله أولياء كمثل العنكبوت اتخذت بيتاً } \\[ العنكبوت : 41 \\] قال المشركون أرأيتم أي شيء يصنع بهذا فأنزل الله : { إن الله لا يستحي أن يضرب مثلاً ما بعوضة فما فوقها } وروي عن الحسن وقتادة أن الله لما ذكر الذباب والعنكبوت في كتابه وضرب بها المثل ضحك اليهود وقالوا ما يشبه أن يكون هذا كلام الله فأنزل الله : { إن الله لا يستحي } الآية .والوجه أن نجمع بين الروايتين ونبين ما انطوتا عليه بأن المشركين كانوا يفزعون إلى يهود يثرب في التشاور في شأن نبوءة محمد صلى الله عليه وسلم وخاصة بعد أن هاجر النبيء صلى الله عليه وسلم إلى المدينة ، فيتلقون منهم صوراً من الكيد والتشغيب فيكون قد تظاهر الفريقان على الطعن في بلاغة ضرب المثل بالعنكبوت والذباب فلما أنزل الله تعالى تمثيل المنافقين بالذي استوقد ناراً وكان معظمهم من اليهود هاجت أحناقهم وضاف خناقهم فاختلقوا هذه المطاعن فقال كل فريق ما نسب إليه في إحدى الروايتين ونزلت الآية للرد على الفريقين ووضح الصبح لذي عينين .فيحتمل أن ذلك قاله علماء اليهود الذين لا حظ لهم في البلاغة ، أو قد قالوه مع علمهم بفنون ضرب الأمثال مكابرة وتجاهلاً . وكون القائلين هم اليهود هو الموافق لكون السورة نزلت بالمدينة ، وكان أشد المعاندين فيها هم اليهود ، ولأنه الأوفق بقوله تعالى : { وما يضل به إلا الفاسقين الذين ينقضون عهد الله } وهذه صفة اليهود ، ولأن اليهود قد شاع بينهم التشاؤم والغلو في الحذر من مدلولات الألفاظ حتى اشتهروا باستعمال الكلام الموجه بالشتم والذم كقولهم{ رَاعنا } \\[ البقرة : 104 \\] ، قال تعالى : { فبدل الذين ظلموا منهم قولاً غير الذي قيل لهم } \\[ البقرة : 59 \\] كما ورد تفسيره في «الصحيح» ولم يكن ذلك من شأن العرب .وإما أن يكون قائله المشركون من أهل مكة مع علمهم بوقوع مثلِه في كلام بلغائهم كقولهم أَجرأُ من ذُبابة ، وأسْمَع من قُرادٍ ، وأطْيَشُ من فَراشة ، وأضعف من بَعُوضَة . وهذا الاحتمال أدَلُّ ، على أنهم ما قالوا هذا التمثيل إلا مكابرة ومعاندة فإنهم لما غُلبوا بالتحدي وعجزوا عن الإتيان بسورة من مثله تعلقوا في معاذيرهم بهاته السفاسف ، والمكابرُ يقول ما لا يعتقد ، والمحجوج المبهوت يستعوج المستقيم ويخفي الواضح ، وإلى هذا الثاني ينزع كلام صاحب «الكشاف» وهو أوفق بالسياق . والسورة وإن كانت مدنية فإن المشركين لم يزالوا يُلقون الشبه في صحة الرسالة ويشيعون ذلك بعد الهجرة بواسطة المنافقين . وقد دل على هذا المعنى قوله بعده : { فأما الذين آمنوا فيعلمون أنه الحق من ربهم وأما الذين كفروا } إلى قوله : { ويهدي به كثيراً } .فإن قيل : لم يكن الرد عقب نزول الآيات الواقع فيها التمثيل الذي أنكروه فإن البدار بالرد على من في مقاله شبهة رائجة يكون أقطع لشبهته من تأخيره زماناً .قلنا : الوجه في تأخير نزولها أن يقع الرد بعد الإتيان بأمثال معجبة اقتضاها مقام تشبيه الهيآت ، فذلك كما يمنع الكريم عدوه من عطاء فيلمزه الممنوع بلمز البخل ، أو يتأخر الكمي عن ساحة القتال مكيدة فيظنه ناس جبناً فيسرها الأول في نفسه حتى يأتيه القاصد فيعطيه عطاء جزلا ، والثاني حتى يكر كرة تكون القاضية على قرنه . فكذلك لما أتى القرآن بأعظم الأمثال وأروعها وهي قوله : { مثلهم كمثل الذي استوقد } \\[ البقرة : 17 \\] { أو كصيب } \\[ البقرة : 19 \\] الآيات وقوله : { صم بكم عمي } \\[ البقرة : 18 \\] أتى إثر ذلك بالرد عليهم فهذا يبين لك مناسبة نزول هذه الآية عقب التي قبلها وقد غفل عن بيانه المفسرون .والمراد بالمثل هنا الشبه مطلقاً لا خصوص المركب من هيئة ، بخلاف قوله فيما سبق { مثلهم كمثل الذي استوقد ناراً } لأن المعنىَّ هنا ما طعنوا به في تشابيه القرآن مثل قوله : { لن يخلقوا ذباباً } \\[ الحج : 73 \\] وقوله : { كمثل العنكبوت اتخذت بيتاً } \\[ العنكبوت : 41 \\] .وموقع ( إنّ ) هنا بيِّن .وأما الإتيان بالمسند إليه علماً دون غيره من الصفات فلأن هذا العلم جامع لجميع صفات الكمال فذكره أوقع في الإقناع بأن كلامه هو أعلى كلام في مراعاة ما هو حقيق بالمراعاة وفي ذلك أيضاً إبطال لتمويههم بأن اشتمال القرآن على مثل هذا المثل دليل على أنه ليس من عند الله فليس من معنى الآية أن غير الله ينبغي له أن يستحي أن يضرب مثلاً من هذا القبيل .ولهذا أيضاً اختير أن يكون المسند خصوص فعل الاستحياء زيادة في الرد عليهم لأنهم أنكروا التمثيل بهاته الأشياء لمراعاة كراهة الناس ومثل هذا ضرب من الاستحياء كما سنبينه فنبهوا على أن الخالق لا يستحي من ذلك إذ ليس مما يستحي منه ، ولأن المخلوقات متساوية في الضعف بالنسبة إلى خالقها والمتصرف فيها ، وقد يكون ذكر الاستحياء هنا محاكاة لقولهم أما يستحي رب محمد أن يضرب مثلاً بالذباب والعنكبوت .فإن قلت : إذا كان استعمال هذه الألفاظ الدالة على معان حقيرة غير مخل بالبلاغة فما بالُنا نرى كثيراً من أهل النقد قد نقدوا من كلام البلغاء ما اشتمل على مثل هذا كقول الفرزدق :من عِزّهم حجرَتْ كليبٌ بيتها ... زَرباً كأنهمُ لديهِ القُمَّلوقول أبي الطيب :أماتكمُ من قبل موتِكم الجهلُ ... وجركمُ من خفة بكمُ النملوقول الطرمّاح :ولو أن بُرغوثاً على ظهر قملة ... يكرُّ على ضَبْعَيْ تميم لولَّتقلت أصول الانتقاد الأدبي تؤول إلى بيان ما لا يحسن أن يشتمل عليه كلام الأديب من جانب صناعة الكلام ، ومن جانب صور المعاني ، ومن جانب المستحسن منها والمكروه وهذا النوع الثالث يختلف باختلاف العوائد ومدارك العقول وأصالة الأفهام بحسب الغالب من أحوال أهل صناعة الأدب ، ألا ترى أنه قد يكون اللفظ مقبولاً عند قوم غير مقبول عند آخرين ، ومقبولاً في عصر مرفوضاً في غيره ، ألا ترى إلى قول النابغة يخاطب الملك النعمان ::فإنكَ كالليل الذي هو مُدْركي ... وإن خِلْتُ أن المُنْتَأَى عنك واسعفإن تشبيه الملك بالليل لو وقع في زمان المولدين لعُدَّ من الجفاء أو العجرفة ، وكذلك تشبيههم بالحية في الإقدام وإهلاك العدو في قول ذي الإصبع :عَذير الحي من عَدوَا ... نَ كانُوا حَيَّةَ الأرضوقول النابغة في رثاء الحارث الغسّاني :ماذا رُزِئْنا به من حيَّةٍ ذَكَرٍ ... نَضْنَاضَةٍ بالرزايا صِلّ أَصلاَلِوقد زعم بعض أهل الأدب أن عليًّا بن الجهم مدح الخليفة المتوكل بقوله :أنت كالكلب في وفائك بالعه ... د وكالتيْس في قراع الخطوبوأنه لما سكن بغداد وعلقت نضارة الناس بخياله قال في أول ما قاله :عيون المها بين الرصافة والجسر ... جلبن الهوى من حيث أَدري ولا أدريوقد انتقد بشارٌ على كُثيِّر قوله :ألا إنما ليلى عصا خيزُرانة ... إذا لمسوها بالأكُف تلينُفقال لو جعلها عصا مخ أو عصا زبد لما تجاوز من أن تكون عصا ، على أن بشاراً هو القائل :إذا قامت لجارتها تثنت ... كأن عظامها من خيزرانوشبَّه بشار عبدة بالحيَّة في قوله :وكأنها لما مشت ... أَيْمٌ تأود في كثيبْوالاستحياء والحياء واحد ، فالسين والتاء فيه للمبالغة مثل استقدم واستأخر واستجاب ، وهو انقباض النفس من صدور فعل أو تلقيه لاستشعار أنه لا يليق أو لا يحسن في متعارف أمثاله ، فهو هيئة تعرض للنفس هي من قبيل الانفعال يظهر أثرها على الوجه وفي الإمساك عن ما من شأنه أن يُفعل .والاستحياء هنا منفي عن أن يكون وصفاً لله تعالى فلا يحتاج إلى تأويل في صحة إسناده إلى الله ، والتعللُ لذلك بأن نفي الوصف يستلزم صحة الاتصاف تعللٌ غير مسلم .والضرب في قوله : { أن يضرب مثلاً } مستعمل مجازاً في الوضع والجعل من قولهم ضربَ خيمة وضرب بيتاً قال عبدة بن الطبيب :إنَّ التي ضربتْ بيتاً مُهاجِرَةً ... بكوفةِ الجُندِ غالت ودَّها غُولُوقول الفرزدق :ضربت عليك العنكبوت بنسجها ... وقضى عليك به الكتابُ المُنْزَلُأي جعل شيئاً مثلاً أي شبهاً ، قال تعالى : { فلا تضربوا لله الأمثال } \\[ النحل : 74 \\] أي لا تجعلوا له مماثلاً من خلقه فانتصاب { مثلاً } على المفعول به . وجوز بعض أئمة اللغة أن يكون فعل ضرب مشتقاً من الضرب بمعنى المماثل فانتصاب { مثلاً } على المفعولية المطلقة للتوكيد لأن مثلاً مرادف مصدر فعله على هذا التقدير ، والمعنى لا يستحي أن يشبِّه بشيء ما .والمثل المثيل والمشابه وغلب على مماثلة هيئة بهيئة وقد تقدم عند قوله تعالى : { مثلهم كمثل الذي استوقد ناراً } \\[ البقرة : 17 \\] وتقدم هناك معنى ضرب المثل بالمعنى الآخر وتنكير { مثلاً } للتنويع بقرينة بيانه بقوله { بعوضة فما فوقها } .وما إبهامية تتصل بالنكرة فتؤكد معناها من تنويع أو تفخيم أو تحقير ، نحو لأمر ما وأعطاه شيئاً ما . والأظهر أنها مزيدة لتكون دلالتها على التأكيد أشد . وقيل اسم بمعنى النكرة المبهمة .و { بعوضة } بدل أو بيان من قوله : { مثلاً } . والبعوضة واحدة البعوض وهي حشرة صغيرة طائرة ذات خرطوم دقيق تحوم على الإنسان لتمتص بخرطومها من دمه غذاء لها ، وتعرف في لغة هذيل بالخموش ، وأهل تونس يسمونه الناموس واحدته الناموسة وقد جعلت هنا مثلاً لشدة الضعف والحقارة .وقوله : { فما فوقها } عطف على { بعوضة } ، وأصل فوق اسم للمكان المعتلي على غيره فهو اسم مبهم فلذلك كان ملازماً للإضافة لأنه تتميز جهته بالاسم الذي يضاف هو إليه فهو من أسماء الجهات الملازمة للإضافة لفظاً أو تقديراً ويستعمل مجازاً في المتجاوز غيره في صفة تجاوزاً ظاهراً تشبيهاً بظهور الشيء المعتلي على غيره على ما هو معتل عليه ، ففوق في مثله يستعمل في معنى التغلب والزيادة في صفة سواء كانت من المحامد أو من المذام يقال : فلان خسيس وفوق الخسيس وفلان شجاع وفوق الشجاع ، وتقول : أعطى فلان فوق حقه أي زائداً على حقه . وهو في هذه الآية صالح للمعنيين أي ما هو أشد من البعوضة في الحقارة وما هو أكبر حجماً . ونظيره قول النبيء صلى الله عليه وسلم « ما من مسلم يشاك شوكة فما فوقها إلا كتبت له بها درجة ومحيت عنه بها خطيئة » رواه مسلم ، يحتمل أقل من الشوكة في الأذى مثل نَخْبة النملة كما جاءَ في حديث آخر ، أو ما هو أشد من الشوكة مثل الوخز بسكين وهذا من تصاريف لفظ فوق في الكلام ولذلك كان لاختياره في هذه الآية دون لفظ أقل ودون لفظ أقوى مثلاً موقع من بليغ الإيجاز .والفاء عاطفة ( ما فوقها ) على ( بعوضة ) أفادت تشريكهما في ضرب المثل بهما ، وحقها أن تفيد الترتيب والتعقيب ولكنها هنا لا تفيد التعقيب وإنما استعملت في معنى التدرج في الرتب بين مفاعيل { أن يضرب } ولا تفيد أن ضرب المثل يكون بالبعوضة ويعقبه ضربه بما فوقها بل المراد بيان المثل بأنه البعوضة وما يتدرج في مراتب القوة زائداً عليها درجة تلي درجة فالفاء في مثل هذا مجاز مرسل علاقته الإطلاق عن القيد لأن الفاء موضوعة للتعقيب الذي هو اتصال خاص ، فاستعملت في مطلق الاتصال ، أو هي مستعارة للتدرج لأنه شبيه بالتعقيب في التأخر في التعقل كما أن التعقيب تأخر في الحصول ومنه : «رحم الله المحلقين فالمقصرين» .والمعنى أن يضرب البعوضة مثلاً فيضرب ما فوقها أي ما هو درجة أخرى أي أحقر من البعوضة مثل الذرة وأعظم منها مثل العنكبوت والحمار .{ فَأَمَّا الذين ءَامَنُواْ فَيَعْلَمُونَ أَنَّهُ الحق مِن رَّبِّهِمْ وَأَمَّا الذين كَفَرُواْ فَيَقُولُونَ مَاذَآ أَرَادَ الله بهذا مَثَلاً } .الفاء للتعقيب الذكري دون الحصولي أي لتعقيب الكلام المفصل على الكلام المجمل عطفت المقدر في قوله : { لا يستحي } لأن تقديره لا يستحي من الناس كما تقدم ، ولما كان في الناس مؤمنون وكافرون وكلا الفريقين تلقى ذلك المثل واختلفت حالهم في الانتفاع به ، نشأ في الكلام إجمال مقدر اقتضى تفصيل حالهم . وإنما عطف بالفاء لأن التفصيل حاصل عقب الإجمال .و ( أما ) حرف موضوع لتفصيل مجمل ملفوظ أو مقدر . ولما كان الإجمال يقتضي استشراف السامع لتفصيله كان التصدي لتفصيله بمنزلة سؤال مفروض كأن المتكلم يقول إن شئت تفصيله فتفصيله كيث وكيت ، فلذلك كانت أما متضمنة معنى الشرط ولذلك لزمتها الفاء في الجملة التي بعدها لأنها كجواب شرط ، وقد تخلو عن معنى التفصيل في خصوص قول العرب أما بعد فتتمحض للشرط وذلك في التحقيق لخفاء معنى التفصيل لأنه مبني على ترقب السامع كلاماً بعد كلامه الأول . وقدرها سيبويه بمعنى مهما يكن من شيء ، وتلقفه أهل العربية بعده وهو عندي تقدير معنى لتصحيح دخول الفاء في جوابها وفي النفس منه شيء لأن دعوى قصد عموم الشرط غير بينة ، فإذا جيء بأداة التفصيل المتضمنة معنى الشرط دل ذلك على مزيد اهتمام المتكلم بذلك التفصيل فأفاد تقوية الكلام التي سماها الزمخشري توكيداً وما هو إلا دلالة الاهتمام بالكلام ، على أن مضمونه محقق ولولا ذلك لما اهتم به وبهذا يظهر فضل قوله : { فأما الذين آمنوا فيعلمون } الخ على أن يقال فالذين آمنوا يعلمون بدون أما والفاء .وجعل تفصيل الناس في هذه الآية قسمين لأن الناس بالنسبة إلى التشريع والتنزيل قسمان ابتداء مؤمن وكافر ، والمقصود من ذكر المؤمنين هنا الثناء عليهم بثبات إيمانهم وتأييس الذين أرادوا إلقاء الشك عليهم فيعلمون أن قلوبهم لا مدخل فيها لذلك الشك .والمراد بالذين كفروا هنا إما خصوص المشركين كما هو مصطلح القرآن غالباً ، وإما ما يشملهم ويشمل اليهود بناء على ما سلف في سبب نزول الآية .وإنما عبر في جانب المؤمنين بيعلمون تعريضاً بأن الكافرين إنما قالوا ما قالوا عناداً ومكابرة وأنهم يعلمون أن ذلك تمثيل أصاب المحز ، كيف وهم أهل اللسان وفرسان البيان ، ولكن شأن المعاند المكابر أن يقول ما لا يعتقد حسداً وعناداً .وضمير ( أنه ) عائد إلى المثل .و ( الحق ) ترجع معانيه إلى موافقة الشيء لما يحق أن يقع وهو هنا الموافق لإصابة الكلام وبلاغته . و ( من ربهم ) حال من ( الحق ) و ( من ) ابتدائية أي وارد من الله لا كما زعم الذين كفروا أنه مخالف للصواب فهو مؤذن بأنه من كلام من يقع منه الخطأ .وأصل ( ماذا ) كلمة مركبة من ما الاستفهامية وذا اسممِ الإشارة ولذلك كان أصلها أن يسأل بها عن شيء مشار إليه كقول القائل ماذا مشيراً إلى شيء حاضر بمنزلة قوله ما هذا . غير أن العرب توسعوا فيه فاستعملوه اسم استفهام مركباً من كلمتين وذلك حيث يكون المشار إليه معبراً عنه بلفظ آخر غير الإشارة حتى تصير الإشارة إليه مع التعبير عنه بلفظ آخر لمجرد التأكيد ، نحو ماذا التواني ، أو حيث لا يكون للإشارة موقع نحو : { وماذا عليهم لو آمنوا بالله } \\[ النساء : 39 \\] ولذلك يقول النحاة إن ذا ملغاة في مثل هذا التركيب . وقد يتوسعون فيها توسعاً أقوى فيجعلون ذا اسم موصول وذلك حين يكون المسؤول عنه معروفاً للمخاطب بشيء من أحواله فلذلك يُجرون عليه جملة أو نحوَها هي صلة ويجعلون ذا موصولاً نحو : { ماذا أنزل ربكم } \\[ النحل : 24 \\] وعلى هذين الاحتمالين يصح إعرابه مبتدأ ويصح إعرابه مفعولاً مقدماً إذا وقع بعده فِعل . والاستفهام هنا إنكاري أي جعل الكلام في صورة الاستفهام كناية به عن الإنكار لأن الشيء المنكر يستفهم عن حصوله فاستعمال الاستفهام في الإنكار من قبيل الكناية ، ومثله لا يجاب بشيء غالباً لأنه غير مقصود به الاستعلام . وقد يلاحظ فيه معناه الأصلي فيجاب بجواب لأن الاستعمال الكنائي لا يمنع من إرادة المعنى الأصلي كقوله تعالى : { عم يتساءلون عن النبأ العظيم } \\[ النبأ : 1 ، 2 \\] .والإشارة بقوله : { بهذا } مفيدة للتحقير بقرينة المقام كقوله : { أَهذا الذي يذكر آلهتكم } \\[ الأنبياء : 36 \\] .وانتصب قوله : { مثلاً } على التمييز من ( هذا ) لأنه مبهم فحقَّ له التمييز وهو نظير التمييز للضمير في قولهم «رُبَّهُ رَجُلاً» .{ يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلاَّ الفاسقين \\* الذين يَنقُضُونَ عَهْدَ الله مِن بَعْدِ ميثاقه وَيَقْطَعُونَ مَآ أَمَرَ الله بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الارض أولاائك هُمُ الخاسرون } .بيان وتفسير للجملتين المصدرتين بأَما على طريقة النشر المعكوس لأن معنى هاتين الجملتين قد اشتمل عليهما معنى الجملتين السالفتين إجمالاً فإنَّ علم المؤمنين أنه الحق من ربهم هُدى ، وقولَ الكافرين { ماذا أراد الله } الخ ضلال ، والأظهر أن لا يكون قوله : { يضل به كثيراً ويهدي به كثيراً } جواباً للاستفهام في قول الذين كفروا { ماذا أراد الله بهذا مثلاً } لأن ذلك ليس استفهاماً حقيقياً كما تقدم .ويجوز أن يجعل جواباً عن استفهامهم تخريجاً للكلام على الأسلوب الحكيم بحمل استفهامهم على ظاهره تنبيهاً على أن اللائق بهم أن يسألوا عن حكمة ما أراد الله بتلك الأمثال فيكون قوله : { يضل به كثيراً ويهدي به كثيراً } جواباً لهم وردا عليهم وبياناً لحال المؤمنين ، وهذا لا ينافي كون الاستفهام الذي قبله مكنى به عن الإنكار كما علمته آنفاً من عدم المانع من جمع المعنيين الكنائي والأصلي . وكونُ كلا الفريقين من المضلَّل والمهدى كثيراً في نفسه ، لا ينافي نحو قوله : { وقليل من عبادي الشكور } \\[ سبأ : 13 \\] لأن قوة الشكر التي اقتضاها صيغة المبالغة ، أخصُّ في الاهتداء .والفاسق لفظ من منقولات الشريعة أصله اسم فاعل من الفِسق بكسر الفاء ، وحقيقة الفسق خروج الثمرة من قشرها وهو عاهة أو رداءة في الثمر فهو خروج مذموم يعد من الأدواء مثل ما قال النابغة :صِغار النوى مكنوزة ليس قِشْرُها ... إذا طار قِشْر التمر عنها بطائرقالوا ولم يسمع في كلامهم في غير هذا المعنى حتى نقله القرآن للخروج عن أمر الله تعالى الجازم بارتكاب المعاصي الكبائر ، فوقع بعد ذلك في كلام المسلمين ، قال رؤبة يصف إبلاً :فواسَقاً عن قَصْدهَا جوائراً ... يَهوين في نجد وغورٍ غائراًوالفسق مراتب كثيرة تبلغ بعضها إلى الكفر . وقد أطلق الفسق في الكتاب والسنة على جميعها لكن الذي يستخلص من الجمع بين الأدلة هو ما اصطلح عليه أهل السنة من المتكلمين والفقهاء وهو أن الفسق غيرُ الكفر وأن المعاصي وإن كثرت لا تزيل الإيمان وهو الحق ، وقد لقب الله اليهود في مواضع كثيرة من القرآن بالفاسقين وأحسب أنه المراد هنا وعزاه ابن كثير لجمهور من المفسرين .وإسناد الإضلال إلى الله تعالى مراعى فيه أنه الذي مكن الضالين من الكسب والاختيار بما خلق لهم من العقول وما فصل لهم من أسباب الخير وضده . وفي اختيار إسناده إلى الله تعالى مع صحة إسناده لفعل الضال إشارة إلى أنه ضلال متمكن من نفوسهم حتى صار كالجِبلة فيهم فهم مأيوس من اهتدائهم كما قال تعالى : { ختم الله على قلوبهم } \\[ البقرة : 7 \\] . فإسناد الإضلال إلى الله تعالى منظور فيه إلى خَلق أسبابه القريبة والبعيدةِ وإلا فإنَّ الله أمَر الناس كلهم بالهدى وهي مسألة مفروغ منها في علم الكلام .وقوله : { وما يضل به إلا الفاسقين } إما مسوق لبيان أن للفسق تأثيراً في زيادة الضلال لأن الفسق يرين على القلوب ويكسب النفوس ظلمة فتتساقط في الضلال المرة بعد الأخرى على التعاقب ، حتى يصير لها دربة .وهذا الذي يؤذن به التعليق على الوصف المشتق إن كان المراد به هنا المعنى الاشتقاقي ، فكأنه قيل هؤلاء فاسقون وما من فاسق إلا وهو ضال فما ثبت الضلال إلا بثبوت الفسق على نحو طريقة القياس الاقتراني ، وإما مسوق لبيان أن الضلال والفسق أخوان فحيثما تحقق أحدهما أنبأ بتحقق الآخر على نحو قياس المساواة إذا أريد من الفاسقين المعنى اللقبي المشهور فلا يكون له إيذان بتعليل ، وإما لبيان أن الإضلال المتكيف في إنكار الأمثال إضلال مع غباوة فلا يصدر إلا من اليهود وقد عرفوا بهذا الوصف .والقول في مذاهب علماء الإسلام في الفسق وتأثيره في الإيمان ليس هذا مقام بيانه إذ ليس هو المقصود من الآية .فإن كان محمل الفاسقين على ما يشمل المشركين واليهود الذين طعنوا في ضرب المثل كان القصر في قوله : { وما يضل به } الخ بالإضافة إلى المؤمنين ليحصل تمييز المراد من المضلل والمهتدى ، وإن كان محمل الفاسقين على اليهود كان القصر حقيقياً ادعائياً أي يضل به كثيراً وهم الطاعنون فيه وأشدهم ضلالاً هم الفاسقون ، ووجه ذلك أن المشركين أبعد عن الاهتداء بالكتاب لأنهم في شركهم ، وأما اليهود فهم أهل كتاب وشأنهم أن يعلموا أفانين الكتب السماوية وضرب الأمثال فإنكارهم إياها غاية الضلال فكأنه لا ضلال سواه .\n\n",
      "translations": [
        {
          "translation": "Then Allah mentioned the Jews' objection to the Qur'an's similes, saying: (Lo! Allah disdaineth not), He cannot abstain from coining similes, and how can He disdain mentioning something that if all created being were to join forces to create, they would not be able to do so. Allah does not disdain (to coin the similitude) Allah does not disdain explaining to people a similitude (even of a gnat), even regarding a gnat, (or what is above it) let alone a simile of something greater than a gnat such as a fly, or a spider. (Those who believe) in Muhammad and the Qur'an (know that it), the simile, (is the Truth from their Lord; but those who disbelieve), in Muhammad and the Qur'an, (say: What doth Allah wish (to teach) by such similitude?) say: Muhammad! What Allah wishes by such simile is that (He misleadeth many thereby) of the Jews from the true Religion, (and He guideth many thereby) of the believers, (and He misleadeth thereby), by such similes, (only miscreants), the Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ ٱللَّهَ لاَ يَسْتَحْى أَن يَضْرِبَ مَثَلاً مَّا بَعُوضَةً فَمَا فَوْقَهَا } أي فما دُونها فِي الصِّغرِ\n وهذا من الأَضدادِ\n يقالُ ما هو أَكبرُ، لِما هو أصغرُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {Indeed, Allah is not ashamed to set forth a parable - even of a mosquito or what is above it} i.e. what is below it in size.\n\n\nAnd this is from the opposites.\n\n\nIt is said that what is great is because it is small.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أنه الحقّ من ربهم } لمناسبة الممثل به الممثل له { وما يضل به إلا الفاسقِينَ } الذين خرجوا من مقام القلب إلى مقام النفس\n ومن طاعة الرحمن إلى طاعة الرحمن الشيطان\n وهم الفريق الثاني من الأشقياء لا الفريق الأول\n فإنهم ضالون في نفس الأمر على أيّ حال كان لا به ولا بسبب آخر\n وإضلالهم به مسبّب عن فسقهم في الحقيقة\n إذ ترتيب الحكم على الوصف يشعر بالعليّة وهي زيادة عنادهم وإنكارهم وحقدهم وغلبة صفات نفوسهم على قلوبهم بورود القرآن فيزيدهم بعداً وظلمة على ظلمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما طعن الكفار في غاية استكبارهم وعتوهم ونهاية استعظامهم نفوسهم\n واعتقادهم الأصالة في الوجود\n والاستقلال بالآثار المترتبة عليه الصادرة منهم ظاهراً على الكتاب\n والرسول المنزل عليه قائلين بأن ما جئت به وسميته وحياً نازلاً إليك من عند الله الحكيم لا يدل على كلام من يعتد به ويعتمد عليه\n فضلاً عن أن يدل على أنه كلام الحكيم المتصف بجميع أوصاف الكمال المستحق للعبادة\n لأن ما مثل به فيه هي الأشياء الخسيسة الخبيثة والضعيفة الحقيرة\n مثل الكلب والحمار والذباب والنمل والنحل والعنكبوت وغيرها\n والكلام المشتمل على أمثال هذه الأمثار لا يصدر من الكبير المتعال؟!\n\nرد الله عليهم وروج أمر نبيه - صلوات الله عليه - فقال: { إِنَّ ٱللَّهَ } المستجمع لجميع الأوصاف والأسماء\n المقتضية لظواهر الكائنات\n المرتبة لمراتب الموجودات الظاهر على جميع المظاهر بلا تفاوت\n كظهور الشمس وإشراقها على جميع الآفاق\n وسريان الروح في جميع الأعضاء { لاَ يَسْتَحْى } استحياء من في فعله ضعف وعافية وضيعة\n بل الله سبحانة { أَن يَضْرِبَ مَثَلاً } بمظهر { مَّا } من المظاهر غير المتفاوتة في المظهرية\n إذ له بذاته من جميع أوصافه وأسمائه ظهور في كل ذرة من ذرائر العالم بلا إضافة\n فلا تفاوت في المظاهر عنده\n وما ترى في خلق الرحمن من تفاوت\n وسواء كانت { بَعُوضَةً } مستحقرة عندكم أو أحقر منها { فَمَا فَوْقَهَا } في الحقارة والخساسة كالبق والنمل\n فلا يبالي الله في تمثيلها\n إذ عند الكل على السواء { فَأَمَّا ٱلَّذِينَ } صدقوا النبي الأمي صلى الله عليه وسلم و { آمَنُواْ } بما جاء به من عند ربه { فَيَعْلَمُونَ } علماً يقيناً أن التمثيل بهذه الأمثال { أَنَّهُ ٱلْحَقُّ } الثابت الصادر { مِن رَّبِّهِمْ } الذي رباهم بكشف الأمور على ما هي عليه\n\n\n{ وَأَمَّا ٱلَّذِينَ كَفَرُواْ } أعرضوا عن تصديق الله ورسوله { فَيَقُولُونَ } مستهزئين متهكمين على سبيل الاستفهام { مَاذَآ أَرَادَ ٱللَّهُ } المقدس عن جميع الرذائل المتصف بالأوصاف الحميدة { بِهَـٰذَا } الحقير الخسيس بأن يضرب { مَثَلاً } بهذا تعريض على رسول الله صلى الله عليه وسلم بأبلغ وجه\n يعني: ما جئت به من عندك كلمات مفتريات بعضها فوق بعض\n أسندته إلى الله لتروجها على أولي الأحلام الضعيفة\n ومن غاية استكبارهم ونهاية جهلهم المقتضي لعمى القلب لم يروا الحكمة في تمثيله\n ولم يعلموا أنه { يُضِلُّ } الله باسمه المنتقم { بِهِ } بسبب إنكار هذا المثال { كَثِيراً } من المستكبرين المستحقرين بعض المظاهر { وَيَهْدِي بِهِ كَثِيراً } من الموحدين الموقنين الذين لا يرون في المظاهر إلا الله\n ففي هذا المشهد لا يسع الإضافات المستلزمة للاستعظام والاستحقار\n بل سقط هناك جميع الاعتبار\n ثم بيَّن سبب إضلاله له فقال: { وَمَا يُضِلُّ بِهِ إِلاَّ ٱلْفَٰسِقِينَ } [البقرة: 26]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الحياء: خُلُق كريم يمنع صاحبه من ارتكاب ما يعاب به\n وفي الحديث:\n \" إنَّ الله حَيِيٌ كَريم \" \n\n و { مثلاً } مفعول\n و { ما } نكرة\n صفته\n و { بعوضة } بدل\n والبعوضة: الذباب\n وفي الحديث:\n \" لوْ كَانَتِ الدُّنيَا تُسَاوِي عندَ الله جَنَاحَ بعُوضَةٍ مَا سَقَى الكافرَ منها جَرْعَة ماءٍ \" \n\n وقيل: صِغَار البَقِّ\n أي: إن الله لا يترك أن يضرب مثلاً - أيّ مثل كان - بعوضة فما فوقها\n أو { بعوضة } مفعول أول\n و { مثلاً } مفعول ثانٍ\n من باب جعل\n و { ماذا } إما مبتدأ وخبرِ\n على أن { ذا } موصولة\n أو مفعولة بأراد على أنها مركبة\n و { مثلاً } حال أو تمييز\n والفسق: الخروج\n يقال: فسقت الرطبة إذا خرجت عن قشرها\n يقوله الحقّ جلّ جلاله: { إنَّ اللَّهَ } لا يترك ترك المستحيي { أَن يَضْرِبَ مَثَلاً } بالخسيس والكبير كالذباب والعنكبوت وغير ذلك\n فأما المؤمنون فيتيقَّنُون { أَنَّهُ الْحَقُّ مِن رَّبِّهِمْ } \n وحكمته: إبراز المعاني اللطيفة في قوالب المحسوسات ليسهل الفهم\n وأما الكفار فيعترضون ويقولون: { مَاذَا أَرَادَ الله } بهذه الأمثال؟ فإن الله منزه عن ضرب الأمثال بهذه الأشياء الخسيسة\n قال الله تعالى في الرد عليهم: أراد بهذا إضلال قوم بسبب إنكارها\n وهداية آخرين بسبب الإيمان بها\n { وَمَا يُضِلُّ } بذلك المثل إلا الخارجين عن طاعته\n { الذين } نقضوا العهد الذي أُخذ عليهم في عالم الذَّرِّ\n أو مطلق العهد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:110",
      "similarity": 0.3885596505355399
    },
    {
      "verse": "31:11",
      "similarity": 0.37145597860725893
    },
    {
      "verse": "26:35",
      "similarity": 0.36723519012756567
    },
    {
      "verse": "10:32",
      "similarity": 0.3349467696356217
    },
    {
      "verse": "4:39",
      "similarity": 0.3266300781962795
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}