{
  "chapter": "البقرة",
  "text": "الذين ينقضون عهد الله منۢ بعد ميثقه ويقطعون ما امر الله به ان يوصل ويفسدون فى الارض او۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "Those who break Allah's contract after it has been agreed, and sever what Allah has commanded to be joined, and cause corruption on the earth, it is they who are the lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, having sealed it, break God's covenant, dividing what He ordained cohered; and those who spread discord in the land will suffer assuredly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who break Allah's covenant after ratifying it; who cut asunder what Allah has ordered to be joined, and who produce chaos on the Earth. These are the people who are indeed the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who break their established covenant with Him and the relations He has commanded to be kept and who spread evil in the land. These are the ones who lose a great deal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break the covenant of Allah after ratifying it – and sever what Allah has ordered to join, and who cause turmoil (evil / religious chaos) in the earth; it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break Allah's covenant after ratifying it, and sever what Allah has ordered to be joined and do mischief on earth, it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who break the covenant of Allah after its confirmation and cut asunder what Allah has ordered to be joined, and make mischief in the land; these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such as break the covenant of God after its solemn binding, and such as cut what God has commanded should be joined, and such as do corruption in the land -- they shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break the covenant of Allah after ratifying it, and sever that which Allah ordered to be joined, and (who) make mischief in the earth: Those are they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who break God's covenant after they have pledged to keep it, and sever whatever God has ordered to be joined, and spread corruption in the land -- it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who break the covenant of Allah after the ratification thereof, and sunder that which Allah hath commanded should be joined, and act corruptly on the earth. These! they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who break the covenant made with Allah after having pledged it solemnly, and sever what Allah has commanded to be joined, and cause corruption on the earth—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break Allah's Covenant after it is ratified, and who sunder what Allah Has ordered to be joined, and do mischief on earth: These cause loss (only) to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break Allah's Covenant after ratifying it, and sever what Allah has ordered to be joined (as regards Allah's Religion of Islamic Monotheism, and to practise its legal laws on the earth and also as regards keeping good relations with kith and kin), and do mischief on earth, it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who break the covenant of Allah after accepting it and sever what Allah has bidden to be joined and corrupt in the land. These are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who violate God’s covenant after its confirmation, and sever what God has commanded to be joined, and commit evil on earth. These are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and cause corruption on earth. It is those who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:27] Those such as, He has described, break the covenant of God, the contract He made with them in the [revealed] Books to belief in Muhammad (s), after its solemn binding, after it has been confirmed with them, and such as cut what God has commanded should be joined, of belief in the Prophet, of kinship and other   matters (an [in the phrase an yūsala, ‘that it be joined’] substitutes for the pronoun [suffixed] in bihi [of the preceding words mā amara Llāhu bihi, ‘that which God has commanded’]); and such as do corruption in the land, by way of their transgressing and impeding faith, they, the ones thus described, shall be the losers, since, they shall end up in the Fire, made everlasting for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { الذين ينقضون } إلى آخره صفة للفاسقين لتقرير اتصافهم بالفسق لأن هاته الخلال من أكبر أنواع الفسوق بمعنى الخروج عن أمر الله تعالى . وجوز أن تكون مقطوعة مستأنفة على أن ( الذين ) مبتدأ وقوله : { أولئك هم الخاسرون } خبر وهي مع ذلك لا تخرج عن معنى توصيف الفاسقين بتلك الخلال إذ الاستئناف لما ورد إثر حكاية حال عن الفاسقين تعين في حكم البلاغة أن تكون هاته الصلة من صفاتهم وأحوالهم للزوم الاتحاد في الجامع الخيالي وإلا لصار الكلام مقطعاً منتوفاً فليس بين الاعتبارين إلا اختلاف الإعراب وأما المعنى فواحد فلذلك كان إعرابه صفة أرجح أو متعيناً إذ لا داعي إلى اعتبار القطع .ومجيء الموصول هنا للتعريف بالمراد من الفاسقين أي الفاسقين الذين عرفوا بهذه الخلال الثلاث فالأظهر أن المراد من الفاسقين اليهود وقد أطلق عليهم هذا الوصف في مواضع من القرآن وهم قد عرفوا بما دلت عليه صلة الموصول كما سنبينه هنا بل هم قد شهدت عليهم كتب أنبيائهم بأنهم نقضوا عهد الله غير مرة وهم قد اعترفوا على أنفسهم بذلك فناسب أن يجعل النقض صلة لاشتهارهم بها ، ووجه تخصيصهم بذلك أن الطعن في هذا المثل جرهم إلى زيادة الطعن في الإسلام فازدادوا بذلك ضلالاً على ضلالهم السابق في تغيير دينهم وفي كفرهم بعيسى ، فأما المشركون فضلالهم لا يقبل الزيادة ، على أن سورة البقرة نزلت بالمدينة وأكثر الرد في الآيات المدنية متوجه إلى أهل الكتاب .والنقض في اللغة حقيقة في فسخ وحل ما ركب ووصل ، بفعل يعاكس الفعل الذي كان به التركيب ، وإنما زدت قولي بفعل الخ ليخرج القطع والحرق فيقال نقض الحبل إذا حل ما كان أبرمه ، ونقض الغزل ونقض البناء . وقد استعمل النقض هنا مجازاً في إبطال العهد بقرينة إضافته إلى ( عهد الله ) وهي استعارة من مخترعات القرآن بنيت على ما شاع في كلام العرب في تشبيه العهد وكل ما فيه وصل بالحبل وهو تشبيه شائع في كلامهم ، ومنه قول مالك بن التيهان الأنصاري للنبيء صلى الله عليه وسلم يوم بيعة العقبة : «يا رسول الله إن بيننا وبين القوم حبالاً ونحن قاطعوها فنخشى إن أعزك الله وأظهرك أن ترجع إلى قومك» ( يريد العهود التي كانت في الجاهلية بين قريش وبين الأوس والخزرج ) . وكان الشائع في الكلام إطلاق لفظ القطع والصرم وما في معناهما على إبطال العهد أيضاً في كلامهم . قال امرؤ القيس :وإن كنتتِ قد أزمعتتِ صرمي فأجملي ... وقال لبيد :أوَ لم تكن تدري نوارِ بأنَّني ... وَصَّالُ عَقد حبائل جَذّامهاوقال :بل ما تَذكّر من نَوار وقد نَأَتْ ... وتقطَّعَتْ أَسبابُها ورِمَامُهاوقال :فاقْطع لُبانة من تعرَّض وصلُه ... فلَشَرُّ واصِل خُلَّةٍ صَرَّامُهاووجه اختيار استعارة النقض الذي هو حل طَيَّات الحبل إلى إبطال العهد أنها تمثيل لإبطال العهد رويداً رويداً وفي أزمنة متكررة ومعالجة . والنقض أبلغ في الدلالة على الإبطال من القطع والصرم ونحوهما لأن في النقض إفساداً لهيأة الحبل وزوال رجاء عودها وأما القطع فهو تجزئة .وفي النقض رمز إلى استعارة مكنية لأن النقض من روادف الحبل فاجتمع هنا استعارتان مكنية وتصريحية وهذه الأخيرة تمثيلية وقد تقرر في علم البيان أن ما يرمز به للمشبه به المطروح في المكنية قد يكون مستعملاً في معنى حقيقي على طريقة التخييل وذلك حيث لا يكون للمشبه المذكور في صورة المكنية رديف يمكن تشبيهه برديف المشبه به المطروح مثل إثباتتِ الأظفار للمنية في قولهم أظفارُ المنية وإثباتتِ المخالببِ والناب للكُماة في قول أبي فِراس الحمداني :فلما اشتدت الهيجاءُ كنَّا ... أَشَدَّ مخالِباً وأَحَدَّ ناباوإثباتتِ اليد للشمال في قول لَبيد :وغداة ريححٍ قد كشفتُ وقِرَّةٍ ... إذْ أصبحت بِيَد الشَّمال زِمامُهاوقد يكون مستعملاً في معنى مجازي إذا كان للمشبه في المكنية رديف يمكن تشبيهه برديف المشبه به المضمر نحو { ينقضون عهد الله } ، وقد زدنا أنها تمثيلية أيضاً والبليغ لا يفلت هاته الاستعارة مهما تأت له ولا يتكلف لها مهما عسرت فليس الجواز المذكور في قرينة المكنية إلا جوازاً في الجملة أي بالنظر إلى اختلاف الأحوال .وهذا الذي هو من روادف المشبه به في صورة المكنية وغيرها قد يقطع عن الربط بالمكنية فيكون استعارة مستقلة ( وذلك حيث لا تذكر معه لفظاً يراد تشبيهه بمشبه به مضمر ) نحو أن تقول فلان ينقض ما أبرم .وقد يربط بالمكنية وذلك حيث يذكر معه شيء أريد تشبيهه بمشبه به مضمر كما في الآية حيث ذكر النقض مع العهد . وقد يربط بمصرحة وذلك حيث يذكر مع لفظ المشبه به الذي الرادف من توابعه نحو قوله : «إن بيننا وبين القوم حبالاً نحن قاطعوها» وحينئذٍ يكون ترشيحاً للمجاز وهذه الاعتبارات متداخلة لامتضادة إذ قد يصح في الموضع اعتباران منها أو جميعها وإنما التقسيم بالنظر إلى ما ينظر إليه البليغ أول النظر .واعلم أن رديف المشبه به في المكنية إذا اعتبر استعارة في ذاته قد يتوهم أن اعتباره ذلك ينافي كونه رمزاً للمشبه به المضمر كالنقض فإنه لما أريد به إبطال العهد لم يكن من روادف الحبل ، لكن لما كان إيذانه بالحبل سابقاً عند سماع لفظه لسبق المعنى الحقيقي إلى ذهن السامع حتى يتأمل في القرينة كفى ذلك السبق دليلاً ورمزاً على المشبه به المضمر فإذا حصل ذلك الرمز لم يضر فهمَ الاستعارة في ذلك اللفظ ، وأجاب عبد الحكيم بأن كونه رادفاً بعد كونه استعارة بناء على أنه لما شبه به الرادف وسمي به صار رادفاً ادعائياً وفيه تكلف .و ( عهد الله ) هو ما عهد به أي ما أوصى برعيه وحفاظه ، ومعاني العهد في كلام العرب كثيرة وتصريفه عرفي . قال الزجاج : «قال بعضهم ما أدري ما العهد» ومرجع معانيه إلى المعاودة والمحافظة والمراجعة والافتقاد ولا أدري أي معانيه أصل لبقيتها وغالب ظني أنها متفرع بعضها عن بعض والأقرب أن أصلها هو العهد مصدر عهده عهداً إذا تذكره وراجع إليه نفسه يقولون عهدتك كذا أي أتذكر فيك كذا وعهدي بك كذا ، وفي حديث أم زرع «ولا يسأل عما عهد أي عما عهد وترك في البيت ومنه قولهم في عهد فلان أي زمانه لأنه يقال للزمان الذي فيه خير وشر لا ينساه الناس ، وتعهد المكان أو فلاناً وتعاهده إذا افتقده وأحدث الرجوع إليه بعد ترك العهد والوصية ومنه ولي العهد . والعهد اليمين والعهد الالتزام بشيء ، يقال عهد إليه وتعهد إليه لأنها أمور لا يزال صاحبها يتذكرها ويراعيها في مواقع الاحتراز عن خفرها . وسمي الموضع الذي يتراجعه الناس بعد البعد عنه معهداً .والعهد في الآية الذي أخذه الله على بني آدم أن لا يعبدوا غيره : { ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان } \\[ يس : 60 \\] الآية ، فنقضه يشمل الشرك وقد وصف الله المشركين بنقض العهد في قوله : { والذين ينقضون عهد الله من بعد ميثاقه } الآية في سورة الرعد . ( 25 ) وفسر بالعهد الذي أخذه الله على الأمم على ألسنة رسلهم أنهم إذا بعث بعدهم رسول مصدق لما معهم ليؤمنن به : { وإذ أخذ الله ميثاق النبيئين لما آتيناكم من كتاب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه }\\[ آل عمران : 81 \\] الآيات لأن المقصود من ذلك أخذ العهد على أممهم . وفسر بالعهد الذي أخذه الله على أهل الكتاب ليبننه للناس : { وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس } \\[ آل عمران : 187 \\] الآية في تفاسير أخرى بعيدة .والصحيح عندي أن المراد بالعهد هو العهد الذي أخذه الله على بني إسرائيل غير مرة من إقامة الدين وتأييد الرسل وأن لا يسفك بعضهم دماء بعض وأن يؤمنوا بالدين كله ، وقد ذكرهم القرآن بعهود الله تعالى ونقضهم إياها في غير ما آية من ذلك قوله تعالى : { وأوفوا بعهدي أوف بعهدكم } \\[ البقرة : 40 \\] . { ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيباً إلى قوله : فبما نقضهم ميثاقهم لعناهم } \\[ المائدة : 12 13 \\] الخ وقوله : { لقد أخذنا ميثاق بني إسرائيل وأرسلنا إليهم رسلاً } \\[ المائدة : 70 \\] إلى قوله : { فعموا وصموا } \\[ المائدة : 70 ، 71 \\] . { وإذ أخذنا ميثاقكم لا تسفكون دماءكم إلى قوله : { ثم أنتم هؤلاء تقتلون أنفسكم } \\[ البقرة : 80 84 \\] إلى قوله : { وتكفرون ببعض } \\[ البقرة : 85 \\] بل إن كتبهم قد صرحت بعهود الله تعالى لهم وأنحت عليهم نقضهم لها وجعلت ذلك إنذاراً بما يحل بهم من المصائب كما في كتاب أرميا ومراثي أرميا وغير ذلك ، بل قد صار لفظ العهد عندهم لقباً للشريعة التي جاء بها موسى . ولما كان قوله : { الذين ينقضون عهد الله } الآية وصفاً للفاسقين وكان المراد من الفاسقين اليهود كما علمت كان ذكر العهد إيماء إلى أن الفاسقين هنا هم ، وتسجيلاً على اليهود بأنهم قد حق عليهم هذا الوصف من قبل اليوم بشهادة كتبهم وعلى ألسنة أنبيائهم فكان لاختيار لفظ العهد هنا وقع عظيم يتنزل منزلة المفتاح الذي يوضع في حل اللغز ليشير للمقصود فهو العهد الذي سيأتي ذكره في قوله تعالى : { وأوفوا بعهدي } \\[ البقرة : 40 \\] .والميثاق مفعال وهو يكون للآلة كثيراً كمرقاة ومرآة ومحراث ، قال الخفاجي كأنه إشباع للمِفْعَل ، وللمصدر أيضاً نحو الميلاد والميعاد وهو الأظهر هنا . والضمير للعهد أي من بعد توكيد العهد وتوثيقه . ولما كان المراد بالعهد عهداً غير معيّننٍ ، بل كل ما عاهدوا عليه كان توكيد كل ما يفرضه المخاطب بما تقدمه من العهود وما تأخر عنه فهو على حد : { ولا تنقضوا الأيمان بعد توكيده } \\[ النحل : 91 \\] فالميثاق إذن عهد آخر اعتبر مؤكداً لعهد سبقه أو لحقه .وقوله : { ويقطعون ما أمر الله به أن يوصل } قيل ما أمر الله به أن يوصل هو قرابة الأرحام يعني وحيث ترجح أن المراد به بعض عمل اليهود فذلك إذ تقاتلوا وأخرجوا كثيراً منهم من ديارهم ولم تزل التوراة توصي بني إسرائيل بحسن معاملة بعضهم لبعض . وقيل الإعراض عن قطع ما أمر الله به أن يوصل هو موالاة المؤمنين . وقيل اقتران القول بالعمل . وقيل التفرقة بين الأنبياء في الإيمان ببعض والكفر ببعض .وقال البغوي يعني بما أمر الله به أن يوصل الإيمان بمحمد صلى الله عليه وسلم وبجميع الرسل .وأقول تكميلاً لهذا إن مراد الله تعالى مما شرع للناس منذ النشأة إلى ختم الرسالة واحد وهو إبلاغ البشر إلى الغاية التي خلقوا لها وحفظ نظام عالمهم وضبط تصرفاتهم فيه على وجه لا يعتوره خلل ، وإنما اختلفت الشرائع على حسب مبلغ تهييء البشر لتلقي مراد الله تعالى ولذلك قلما اختلفت الأصول الأساسية للشرائع الإلهية قال تعالى : { شرع لكم من الدين ما وصى به نوحاً والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى أن أقيموا الدين } \\[ الشورى : 13 \\] الآية . وإنما اختلفت الشرائع في تفاريع أصولها اختلافاً مراعى فيه مبلغ طاقة البشر لطفاً من الله تعالى بالناس ورحمة منه بهم حتى في حملهم على مصالحهم ليكون تلقيهم لذلك أسهلَ ، وعملُهم به أدوم ، إلى أن جاءت الشريعة الإسلامية في وقت راهَقَ فيه البشرُ مَبلغَ غاية الكمال العقلي وجاءهم دين تناسب أحكامه وأصوله استعدادهم الفكري وإن تخالفت الأعصار وتباعدت الأقطار فكان ديناً عاماً لجميع البشر ، فلا جرم أن كانت الشرائع السابقة تمهيداً له لتهييء البشر لقبول تعاليمه وتفاريعها التي هي غاية مراد الله تعالى من الناس ولذا قال تعالى : { إن الدين عند الله الإسلام } \\[ آل عمران : 19 \\] . فما من شريعة سلفت إلا وهي حلقة من سلسلة جعلت وِصلة للعُروة الوثقى التي لا انفصام لها وهي عروة الإسلام فمتى بلغها الناس فقد فَصوا ما قبلها من الحلق وبلغوا المراد ، ومتى انقطعوا في أثناء بعض الحلق فقد قطعوا ما أراد الله وصله ، فاليهود لما زعموا أنهم لا يحل لهم العدول عن شريعة التوارة قد قطعوا ما أمر الله به أن يوصل ففرقوا مجتمعه .والفساد في الأرض تقدم الكلام عليه عند قوله تعالى : { ألا إنهم هم المفسدون } \\[ البقرة : 12 \\] ومن الفساد في الأرض عكوف قوم على دين قد اضمحل وقت العمل به وأصبح غير صالح لما أراد الله من البشر فإن الله ما جعل شريعة من الشرائع خاصة وقابلة للنسخ إلا وقد أراد منها إصلاح طائفة من البشر معينة في مدة معينة في علمه ، وما نسخ ديناً إلا لتمام وقت صلوحيته للعمل به فالتصميم على عدم تلقي الناسخ وعلى ملازمة المنسوخ هو عمل بما لم يبق فيه صلاح للبشر فيصير ذلك فساداً في الأرض لأنه كمداواة المريض بدواء كان وصف له في حالة تبدلت من أحوال مرضه حتى أتى دين الإسلام عاماً دائماً لأنه صالح للكل .وقوله : { أولئك هم الخاسرون } قصر قلب لأنهم ظنوا أنفسهم رابحين وهو استعارة مكنية تمثيلية تقدمت في قوله تعالى : { فما ربحت تجارتهم } \\[ البقرة : 16 \\] . وذكر الخسران تخييل مراد منه الاستعارة في ذاته على نحو ما قرر في { ينقضون عهد الله } فهذه الآية ظاهرة في أنها موجهة إلى اليهود لما علمت عند قوله : { وما يضل به إلا الفاسقين } ولما علمت من كثرة إطلاق وصف الفاسقين على اليهود ، وإن كان الذين طعنوا في أمثال القرآن فريقين : المشركين واليهود ، كما تقدم ، وكان القرآن قد وصف المشركين في سورة الرعد ( 25 ) وهي مكية بهذه الصفات الثلاث في قوله :{ والذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض أولئك لهم اللعنة ولهم سوء الدار } فالمراد بهم المشركون لا محالة فذلك كله لا يُناكد جعل آية سورة البقرة موجهة إلى اليهود إذ ليس يلزم المفسر حمله آي القرآن على معنى واحد كما يوهمه صنيع كثير من المفسرين حتى كان آي القرآن عندهم قوالب تفرغ فيها معان متحدة .واعلم أن الله قد وصف المؤمنين بضد هذه الصفات في قوله تعالى : { إنما يتذكر أولو الألباب الذين يوفون بعهد الله ولا ينقضون الميثاق والذين يصلون ما أمر الله به أن يوصل } الآية في سورة الرعد ( 25 ) .واعلم أن نزول هذه الآيات ونحوها في بعض أهل الكتاب أو المشركين هو وعيد وتوبيخ للمشركين وأهل الكتاب وهو أيضاً موعظة وذكرى للمؤمنين ليعلم سامعوه أن كل من شارك هؤلاء المذمومين فيما أوجب ذمهم وسبب وعيدهم هو آخذ بحظ مما نالهم من ذلك على حسب مقدار المشاركة في الموجب .\n\n",
      "translations": [
        {
          "translation": "(Those who break the covenant of Allah) regarding this Prophet (pbuh) (after ratifying it), after sanctioning, confirming and vouchsafing it (and sever that which Allah hath ordered) of oaths and kinsfolk relations (to be joined) to Muhammad, (and (who) make mischief in the earth) by preventing people from the Religion of Muhammad (pbuh) and the Qur'an: (Those are they who are the losers), the duped in that they lose both this world and the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ الذين يَنقُضُونَ عهد الله من بعد ميثاقِهِ } هو الذي أشار إليه في قوله:\n[الأعراف، الآية: 172]. وقد ورد في الحديث:\n \" أن الله تعالى مسح ظهر آدم بيده وأخرج ذريّته منه كهيئة الذرّ \" \n.. الحديث. فيد الله هو العقل الأقدس، والروح الأول الذي هو روح العالم المسمّى يمين الرحمن، وآدم هو النفس الناطقة الكلية التي هي قلب العالم. ومسحه ظهره تأثير العقل فيها وتنويره إياها بنوره بالاتصال الروحاني، وإخراج ذريّته منه إيجاد النفوس الشخصية الجزئية التي كانت فيها بالقوّة، وإخراجها إلى الفعل. وعهد الله إليهم بقوله: { أَلَسْتُ بِرَبِّكُمْ } إيداع علم التوحيد في ذواتهم وميثاق ذلك العهد ركز أدلة التوحيد في عقولهم وإلزام ذلك العلم إياهم وجعله من اللوازم الذاتية لهم، بحيث إذا تجرّدوا عن الصفات النفسانية والغواشي الجسمانية تبين لهم ذلك، وانكشف عليهم أظهر شيء وأبينه وهو إشهادهم على أنفسهم لكون ذلك العلم ضرورياً حينئذ، وإجابتهم لذلك بقولهم: { بَلَىٰ } قبولهم الذاتيّ له، ونقض ذلك العهد انهماكهم في اللذات البدنية والغواشي الطبيعية وتعبدهم لهواهم وشهواتهم، بحيث احتجبوا بها عن وحدة الله وتعبده، وقطعهم ما أمر الله بوصله إعراضهم عن اتصال روح القدس والمبادئ العالية والأرواح السماوية التي هي الملأ الأعلى، وسكان الحضرة الإلهية من أهل الجبروت والملكوت الذين يجانسونهم بذواتهم وصفاتهم، وهم أهل قرابتهم الحقيقية، ورحمهم الظاهر المأمور بوصله حقيقة بتوجههم إلى العالم السفليّ ومحبتهم للجواهر الفاسقة المظلمة، وعشقهم وشغفهم بالأمور الخسيسة الفانية. ولهذا قال عليه الصلاة والسلام:\n \" إن الله يحب معالي الأمور وأشرافها، ويبغض سفاسفها \" \n، إذ كلما كان مطلوب النفس أخسّ كانت عن العالم الشريف أبعد.\nوقد مرّ تفسير الإفساد في الأرض، والخسران الذي هو تضييع الجوهر النوريّ الباقي لأجل الظلمانيّ الفاني.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ } يخرجون عن طريق التوحيد باستحقار بعض المظاهر { يَنقُضُونَ } يفصمون { عَهْدَ ٱللَّهِ } الذي هو حبله الممدود من أزل الذات إلى أبد الأسماء والصفات سيما { مِن بَعْدِ } توكيده بذكر { مِيثَٰقِهِ } الموثق بقوله:\n\n[الأعراف: 172]\n وقولهم:\n[الأعراف: 172] وبعدما نقضوا العهد الوثيق الذي من شأنه ألاَّ ينقضِ لم يفزعوا ولم يتوجهوا إلى جبره ووصله\n بل { وَيَقْطَعُونَ } التوجه عن امتثال { مَآ أَمَرَ ٱللَّهُ بِهِ } في كتابه المنزل { أَن يُوصَلَ } به ما نقض من عهده\n ومع ذلك لا يقنعون بنقض العهد وقطع الوصل المختصين بهم\n بل { وَيُفْسِدُونَ فِي ٱلأرْضِ } بأنواع الفسادات السارية من إفسادٍ واعتقاد الضعفاء\n والبغض مع العرفاء الأنساء - وفي نسخة أخرى: ا لأمناء - والمخالفة مع الأنبياء والأولياء { أُولَـۤئِكَ } البعداء عن طريق التوحيد { هُمُ ٱلْخَٰسِرُونَ } [البقرة: 27] المقصورون على الخسران الكلي الذي لا خسران فوقه\n أعاذنا الله من ذلك\n\n\nثم استفهم سبحانه مخاطباً لهم\n مستبعداً عما صدر عنهم من الكفر والطغيان على سبيل الكناية تحريكاً لحمية الفطرة التي فطر الناس عليها\n وتذكيراً لهم بالعهود التي عهدوا مع الله في استعدادتهم الأصلية بقوله:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ } من الأنبياء والرسل والأرحام وغيرها\n { وَيُفْسِدُونَ فِي الأرْضِ } بالمعاصي والتعويق عن الإيمان\n { أَوْلَئِكَ هُمُ الْخَاسِرُونَ } الكاملون في الخسران\n نعوذ بالله من الخذلان\n الإشارة: إن الله لا يترك أن يظهر مثلاً من أنوار قدسه بارزاً بقدرته\n مرتدياً برداء حكمته\n ملتبساً بأسرار ذاته\n مَكسُوّاً بأنوار صفاته من الذرة إلى ما لا نهاية له\n فالمتجلِّي في النملة هو المتجلي في الفيلة\n فأما الذين صَدَّقُوا بتجلي الذات في أنوار الصفات\n فيقولون: إنه الحق فائضٌ من نور الربوبية\n محتجباً برداء الكبرياء وسبحات الألوهية\n وأما الجاحدون لظهور نور ذات الربوبية فينكرونه في حال ظهوره\n ويقولون: ماذا أراد الله بهذه العوالم الظاهرة؟ فيقول الحق تعالى: أردت ظهور قدرتي وعجائب حكمتي\n ليظهر سر ربوبيتي في مظاهر عبوديتي\n قال الشيخ أبو الحسن رضي الله عنه: \" العبودية جوهرة أظهر بها الربوبية \" وقيل لأبي الحسن النُّورِي: ما هذه الأماكن والمخلوقات الظاهرة؟ فقال: عز ظاهر وملك قاهر\n ومخلوقات ظاهرة به\n وصادرة عنه\n لا هي متصلة به ولا منفصلة عنه\n فرغ من الأشياء ولم تفرغ منه\n لأنها تحتاج إليه وهو لا يحتاج إليها\n هـ\n فأراد الله بظهور هذا الكون أن يضل به قوماً فيقفون مع ظاهر غرَّتِه\n ويهدي به قوماً فينفذون إلى باطن عبرته\n وما يضل به إلا الفاسقين الخارجين عن دائرة الشهود\n المنكرين لتجليات الملك المعبود\n الذين ينقضون عهد الله\n وهو معرفة الروح التي حصلت لها وهي في عالم الذر\n ويقطعون ما أمر الله به أن يوصل من الشيوخ العارفين\n الذين أَهَّلَهُمَ الله للتربية والترقية\n وهم لا ينقطعون ما دامت المِلَّةُ المحمدية\n ويفسدون في الأرض بالإنكار والتعويق عن طريق الخصوص\n بتضييعهم الأصولَ\n وهي صحبة العارفين\n والتأدب لهم\n والتعظيم لحرمتهم\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:25",
      "similarity": 0.9062812340296588
    },
    {
      "verse": "13:20",
      "similarity": 0.6405022118351075
    },
    {
      "verse": "8:56",
      "similarity": 0.522417594645178
    },
    {
      "verse": "94:3",
      "similarity": 0.4605642988887623
    },
    {
      "verse": "28:51",
      "similarity": 0.4253650536538753
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}