{
  "chapter": "البقرة",
  "text": "الذين ينفقون امولهم باليل والنهار سرا وعلانية فلهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "Those who give away their wealth by night and day, secretly and openly, will have their reward with their Lord. They will feel no fear and will know no sorrow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend of their wealth in the way of God, day and night, in secret or openly, have their reward with their Lord, and have nothing to fear or regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth secretly and openly by day and night, will have their reward with their Lord, and they have nothing to fear nor grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their property for the cause of God, any time during the day or night, in public or in private, will receive their reward from their Lord. There will be no fear for them nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth by night and day, secretly and openly – their reward is with their Lord; and there shall be no fear upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth (in Allah's cause) by night and day, in secret and in public, they shall have their reward with their Lord. On them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who spend their property by night and by day, secretly and openly, they shall have their reward from their Lord and they shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who expend their wealth night and day, secretly and in public, their wage awaits them with their Lord, and no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth by night and day, by stealth and openly, verily their reward is with their Lord, and their shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth night and day, both privately and publicly, will receive their reward from their Lord. They shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who expend their riches by night and by day, in secret and openly, theirs shall be their hire with their Lord; no fear shall come on them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who give their wealth by night and day, secretly and openly, they shall have their reward near their Lord, and they will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who (in charity) spend of their goods by night and by day, in secret and in public, have their reward with their Lord: on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth (in Allah's Cause) by night and day, in secret and in public, they shall have their reward with their Lord. On them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth by day and by night, in private and in public, their wage is with their Lord, and no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth by night and day, privately and publicly, will receive their reward from their Lord. They have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth [in Allah 's way] by night and by day, secretly and publicly - they will have their reward with their Lord. And no fear will there be concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:274] Those who expend their wealth night and day, secretly and openly, their wage awaits them with their Lord, and no fear shall befall them, neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who spend their wealth) in charity (by night and day, in secret and openly, surely their reward is with their Lord) in Paradise, (and there shall no fear come upon them) perpetually (neither shall they grieve) when others do. This verse was revealed about 'AN Ibn Abi Talib.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الذينَ يُنفقونَ } عمم الإنفاق أولاً وثانياً بحسب الأوقات والأحوال ليعلم أنه لا يتفاوت بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n هارباً عما شغل من الحق وابتلاه { فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ } بقدر قابليتهم واستعدادهم { وَلاَ خَوْفٌ عَلَيْهِمْ } من التضييع والإحباط { وَلاَ هُمْ يَحْزَنُونَ } [البقرة: 274] من سوء المنقلب والمآب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الموصول مبتدأ، و { فلهم أجرهم }: خبر، والفاء للسببية، ولأن في الموصول معنى الشرط، وقيل: الخبر محذوف، أي: ومنهم الذين ينفقون الخ: و { فلهم }: استئناف بياني. يقول الحقّ جلّ جلاله: { الذين ينفقون أموالهم بالليل والنهار سرّاً وعلانية } ، ويعمرون أوقاتهم بفعل الخيرات، { فلهم أجرهم عند ربهم } إذا قدموا عليه، { ولا خوف عليهم } من لُحوق مكروه، { ولا هم يحزنون } على فوات محبوب، بل وجدوا الله فأغناهم عن كل شيء. قيل: نزلت في أبي بكر رضي الله عنه تصدَّق بأربعين ألف دينار، عشرة بالليل، وعشرة بالنهار، وعشرة بالسر، وعشر بالعلانية، أو في عليّ - كرّم الله وجهه - لم يملك إلا أربعة دراهم، فتصدق بدرهم ليلاً، ودرهم نهاراً، ودرهم سرّاً، ودرهم علانية. وهي عامة لمن فعل فعلهما. الإشارة: أجر بذل الأموار هو إعطاء الثواب من وراء الباب، والأمن من العذاب وسوء المآب، وأجر بذل النفوس هو دخول حضرة القدوس، والأنس بالأحباب داخل الحجاب، فمن بذل نفسه لله على الدوام، أمنه من الحجبة في دار السلام، فلا خوف يلحقهم في الدارين، ولا يعتريهم حزن في الكونين. وبالله التوفيق. ولما رغَّب في الصدقة، وكانت في الغالب لا يتوصل إليها إلا بتعاطي أسباب المال، وهو البيع والشراء حذر من الربا لئلا يتساهل الناس في المعاملة به، حرصاً على الصدقة.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:76",
      "similarity": 0.7408331822465636
    },
    {
      "verse": "16:19",
      "similarity": 0.627616705580333
    },
    {
      "verse": "71:9",
      "similarity": 0.6262501046613158
    },
    {
      "verse": "2:77",
      "similarity": 0.6239767953919253
    },
    {
      "verse": "16:23",
      "similarity": 0.5605192789292502
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:274.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:274.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:274.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}