{
  "chapter": "البقرة",
  "text": "الذين ينقضون عهد الله منۢ بعد ميثقه ويقطعون ما امر الله به ان يوصل ويفسدون فى الارض او۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "Those who break Allah's contract after it has been agreed, and sever what Allah has commanded to be joined, and cause corruption on the earth, it is they who are the lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, having sealed it, break God's covenant, dividing what He ordained cohered; and those who spread discord in the land will suffer assuredly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who break Allah's covenant after ratifying it; who cut asunder what Allah has ordered to be joined, and who produce chaos on the Earth. These are the people who are indeed the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who break their established covenant with Him and the relations He has commanded to be kept and who spread evil in the land. These are the ones who lose a great deal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break the covenant of Allah after ratifying it – and sever what Allah has ordered to join, and who cause turmoil (evil / religious chaos) in the earth; it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break Allah's covenant after ratifying it, and sever what Allah has ordered to be joined and do mischief on earth, it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who break the covenant of Allah after its confirmation and cut asunder what Allah has ordered to be joined, and make mischief in the land; these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such as break the covenant of God after its solemn binding, and such as cut what God has commanded should be joined, and such as do corruption in the land -- they shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break the covenant of Allah after ratifying it, and sever that which Allah ordered to be joined, and (who) make mischief in the earth: Those are they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who break God's covenant after they have pledged to keep it, and sever whatever God has ordered to be joined, and spread corruption in the land -- it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who break the covenant of Allah after the ratification thereof, and sunder that which Allah hath commanded should be joined, and act corruptly on the earth. These! they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who break the covenant made with Allah after having pledged it solemnly, and sever what Allah has commanded to be joined, and cause corruption on the earth—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break Allah's Covenant after it is ratified, and who sunder what Allah Has ordered to be joined, and do mischief on earth: These cause loss (only) to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break Allah's Covenant after ratifying it, and sever what Allah has ordered to be joined (as regards Allah's Religion of Islamic Monotheism, and to practise its legal laws on the earth and also as regards keeping good relations with kith and kin), and do mischief on earth, it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who break the covenant of Allah after accepting it and sever what Allah has bidden to be joined and corrupt in the land. These are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who violate God’s covenant after its confirmation, and sever what God has commanded to be joined, and commit evil on earth. These are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and cause corruption on earth. It is those who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:27] Those such as, He has described, break the covenant of God, the contract He made with them in the [revealed] Books to belief in Muhammad (s), after its solemn binding, after it has been confirmed with them, and such as cut what God has commanded should be joined, of belief in the Prophet, of kinship and other   matters (an [in the phrase an yūsala, ‘that it be joined’] substitutes for the pronoun [suffixed] in bihi [of the preceding words mā amara Llāhu bihi, ‘that which God has commanded’]); and such as do corruption in the land, by way of their transgressing and impeding faith, they, the ones thus described, shall be the losers, since, they shall end up in the Fire, made everlasting for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who break the covenant of Allah) regarding this Prophet (pbuh) (after ratifying it), after sanctioning, confirming and vouchsafing it (and sever that which Allah hath ordered) of oaths and kinsfolk relations (to be joined) to Muhammad, (and (who) make mischief in the earth) by preventing people from the Religion of Muhammad (pbuh) and the Qur'an: (Those are they who are the losers), the duped in that they lose both this world and the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الذين يَنقُضُونَ عهد الله من بعد ميثاقِهِ } هو الذي أشار إليه في قوله:\n\n[الأعراف، الآية: 172]\n وقد ورد في الحديث:\n\n \" أن الله تعالى مسح ظهر آدم بيده وأخرج ذريّته منه كهيئة الذرّ \" \n\n\n\n الحديث\n فيد الله هو العقل الأقدس، والروح الأول الذي هو روح العالم المسمّى يمين الرحمن، وآدم هو النفس الناطقة الكلية التي هي قلب العالم\n ومسحه ظهره تأثير العقل فيها وتنويره إياها بنوره بالاتصال الروحاني، وإخراج ذريّته منه إيجاد النفوس الشخصية الجزئية التي كانت فيها بالقوّة، وإخراجها إلى الفعل\n وعهد الله إليهم بقوله: { أَلَسْتُ بِرَبِّكُمْ } إيداع علم التوحيد في ذواتهم وميثاق ذلك العهد ركز أدلة التوحيد في عقولهم وإلزام ذلك العلم إياهم وجعله من اللوازم الذاتية لهم، بحيث إذا تجرّدوا عن الصفات النفسانية والغواشي الجسمانية تبين لهم ذلك، وانكشف عليهم أظهر شيء وأبينه وهو إشهادهم على أنفسهم لكون ذلك العلم ضرورياً حينئذ، وإجابتهم لذلك بقولهم: { بَلَىٰ } قبولهم الذاتيّ له، ونقض ذلك العهد انهماكهم في اللذات البدنية والغواشي الطبيعية وتعبدهم لهواهم وشهواتهم، بحيث احتجبوا بها عن وحدة الله وتعبده، وقطعهم ما أمر الله بوصله إعراضهم عن اتصال روح القدس والمبادئ العالية والأرواح السماوية التي هي الملأ الأعلى، وسكان الحضرة الإلهية من أهل الجبروت والملكوت الذين يجانسونهم بذواتهم وصفاتهم، وهم أهل قرابتهم الحقيقية، ورحمهم الظاهر المأمور بوصله حقيقة بتوجههم إلى العالم السفليّ ومحبتهم للجواهر الفاسقة المظلمة، وعشقهم وشغفهم بالأمور الخسيسة الفانية\n ولهذا قال عليه الصلاة والسلام:\n\n \" إن الله يحب معالي الأمور وأشرافها، ويبغض سفاسفها \" \n\n، إذ كلما كان مطلوب النفس أخسّ كانت عن العالم الشريف أبعد\n\n",
      "translations": [
        {
          "translation": "\n\n\"Those who break the covenant of Allah after ratifying it...\" This is the one to whom Allah is referring in His saying:\n\n\nThe A'raf are a group of beings who, according to Islamic tradition, dwell on the edge of Hell.,\n\nAnd when it is said to them, \"Follow what Allah has revealed,\" they say, \"We will follow what we found our fathers doing.\" What, even though their fathers did not understand anything, and were not guided?\n\n\nIt has been narrated in the hadith:\n\n\n\"God wiped the back of Adam with His hand and extracted his progeny from him in the form of dust.\"\n\n\nThe hadith is a record of the sayings and actions of the Prophet Muhammad (pbuh), as well as his companions.\n\n\nMay God be the highest intelligence.,\n\nAnd the first spirit, which is the spirit of the world called the right hand of the Most Merciful.,\n\nAnd Adam is the speaking soul which is the heart of the world.\n\n\nAnd he wiped her back with the effect of his mind and illuminated her with his light in a spiritual connection., And { } his descendants from him the finding of the individual souls that were in him with power.,\n\nAnd bring it to action\n\n\nAnd Allah made a covenant with them through His statement: {Are you not my Lord?} planting the knowledge of Tawhid in their hearts and making that covenant the basis of the evidence of Tawhid in their minds, and making that knowledge obligatory upon them and part of their essential needs., If they { } the { } and { }, it will become clear to them.,\n\nAnd {He} reveals to them a sign, and {He} makes it clear, and that is their testimony against themselves, that this knowledge is absolutely necessary at that time.,\n\nAnd their response to that was to say: {Yes}, they accepted it of themselves.,\nWe break that covenant when they enjoy {physical} and {natural} pleasures and worship their desires and lusts., So that they would cover themselves with it for the sake of God and worship Him.,\nAnd He severed them as He commanded severing the connection of those who disobeyed Him from the Holy Spirit and the high principles and the heavenly souls which are the highest of all.,\n\nThe inhabitants of the holy city of Jerusalem are the people of Gibran and Malakut, who associate with them in their own way., They are the people of their true kinship.,\n\nAnd may their apparent leader guide them truly to the underworld, and their love for dark, sinful jewels.,\n\nAnd their love and passion for mundane, transient things.\n\n\nAnd for this reason, the Messenger of Allah (peace and blessings of Allah be upon him) said:\n\n\n\"Indeed, Allah loves those who are lofty in their affairs and have integrity.\",\n\nAnd he dislikes her arrogance.\n\n\nThe {Nawawi} commentary on Sahih Muslim is a classic work of Sunni Islamic scholarship.,\n\n{When the soul was most needed, it was farthest from the noble world.}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ } يخرجون عن طريق التوحيد باستحقار بعض المظاهر { يَنقُضُونَ } يفصمون { عَهْدَ ٱللَّهِ } الذي هو حبله الممدود من أزل الذات إلى أبد الأسماء والصفات سيما { مِن بَعْدِ } توكيده بذكر { مِيثَٰقِهِ } الموثق بقوله:\n\n\n\n[الأعراف: 172]، وقولهم:\n\n[الأعراف: 172] وبعدما نقضوا العهد الوثيق الذي من شأنه ألاَّ ينقضِ لم يفزعوا ولم يتوجهوا إلى جبره ووصله، بل { وَيَقْطَعُونَ } التوجه عن امتثال { مَآ أَمَرَ ٱللَّهُ بِهِ } في كتابه المنزل { أَن يُوصَلَ } به ما نقض من عهده، ومع ذلك لا يقنعون بنقض العهد وقطع الوصل المختصين بهم، بل { وَيُفْسِدُونَ فِي ٱلأرْضِ } بأنواع الفسادات السارية من إفسادٍ واعتقاد الضعفاء، والبغض مع العرفاء الأنساء - وفي نسخة أخرى: ا لأمناء - والمخالفة مع الأنبياء والأولياء { أُولَـۤئِكَ } البعداء عن طريق التوحيد { هُمُ ٱلْخَٰسِرُونَ } [البقرة: 27] المقصورون على الخسران الكلي الذي لا خسران فوقه، أعاذنا الله من ذلك\n\n\n\n\nثم استفهم سبحانه مخاطباً لهم، مستبعداً عما صدر عنهم من الكفر والطغيان على سبيل الكناية تحريكاً لحمية الفطرة التي فطر الناس عليها، وتذكيراً لهم بالعهود التي عهدوا مع الله في استعدادتهم الأصلية بقوله:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:25",
      "similarity": 0.9062812340296588
    },
    {
      "verse": "13:20",
      "similarity": 0.6405022118351075
    },
    {
      "verse": "8:56",
      "similarity": 0.522417594645178
    },
    {
      "verse": "94:3",
      "similarity": 0.4605642988887623
    },
    {
      "verse": "28:51",
      "similarity": 0.4253650536538753
    }
  ]
}