{
  "chapter": "البقرة",
  "text": "واتقوا۟ يوما ترجعون فيه الى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون",
  "translations": [
    {
      "translation": "Have fear of a Day when you will be returned to Allah. Then every self will be paid in full for what it earned. They will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have fear of the day when you go back to God. Then each will be paid back in full his reward, and no one will be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Guard against the disgrace and misery of the day when you shall return to Allah: there everyone shall be paid in full, for the good or evil one has earned and none shall be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Safeguard yourselves against the day when you will return to God and every soul will be rewarded according to its deeds without being wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the day in which you will be returned to Allah; and every soul will be paid back in full what it had earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And have Taqwa the Day when you shall be brought back to Allah. Then every person shall be paid what he earned, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard yourselves against a day in which you shall be returned to Allah; then every soul shall be paid back in full what it has earned, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a day wherein you shall be returned to God, and every soul shall be paid in full what it has earned; and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard yourselves against a day in which ye will be brought back to Allah. Then every soul will be paid in full that which it hath earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fear the Day when you shall be made to return to God; then every soul shall be paid in full what it has earned; and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Day whereon ye shall be brought back unto Allah, then shall each sour be repaid, in full that which he hath earned, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware of a day in which you will be brought back to Allah. Then every soul shall be recompensed fully for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Day when ye shall be brought back to Allah. Then shall every soul be paid what it earned, and none shall be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be afraid of the Day when you shall be brought back to Allah. Then every person shall be paid what he earned, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fear the Day when you shall be returned to Allah. And every soul shall be paid in full what it has earned; and they shall not be harmed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard yourselves against a Day when you will be returned to God; then each soul will be rewarded fully for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day when you will be returned to Allah. Then every soul will be compensated for what it earned, and they will not be treated unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:281]   And fear a day wherein you shall be returned to God, namely, the Day of Resurrection (read the passive [turja‘ūna] meaning, ‘you shall be returned’, or the active [tarji‘ūna] meaning ‘you shall return’), and every soul, on that day, shall be paid in full, the requital of, what it has earned, what it has done of good or evil; and they shall not be wronged, through any loss of a good deed or the incurring of an extra evil deed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجيء بقوله : { واتقوا يوماً } تذييلاً لهاته الأحكام لأنّه صالح للترهيب من ارتكاب ما نهي عنه والترغيب في فعل ما أمر به أو ندب إليه ، لأن في ترك المنهيات سلامة من آثامها ، وفي فعل المطلوبات استكثاراً من ثوابها ، والكل يرجع إلى اتّقاء ذلك اليوم الذي تُطلب فيه السلامة وكثرة أسباب النجاح .وفي «البخاري» عن ابن عباس أنّ هذه آخر آية نزلت . وعن ابن عباس هي آخر ما نزل فقال جبريل : «يا محمد ضعها على رأس ثمانين ومائتين من البقرة» . وهذا الذي عليه الجمهور ، قاله ابن عباس والسُّدي والضحاك وابن جريج وابن جبير ومقاتل . وروي أنّ رسول الله صلى الله عليه وسلم عاش بعد نزولها واحداً وعشرين يوماً ، وقيل واحداً وثمانين ، وقيل سبعة أيام ، وقيل تسعة ، وقيل ثلاث ساعات . وقد قيل : إنّ آخر آية هي آية الكلالة ، وقيل غير ذلك ، وقد استقصى الأقوال صاحب الإتقان .وقرأه الجمهور ترجعون بضم التاء وفتح الجيم ، وقرأ يعقوب بفتح التاء وكسر الجيم .\n\n",
      "translations": [
        {
          "translation": "(And guard yourselves against a day) fear the torment of a day (in which ye will be brought back to Allah. Then every soul) whether believing or disbelieving (will be paid full that which it hath earned) of good or evil, (and they will not be wronged) their rewards will not be decreased and their sins shall not be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱتَّقُواْ يَوْماً تُرْجَعُونَ فِيهِ إِلَى ٱللَّهِ } المسقط لجميع الإضافات منسلخين عن جميع ما أنتم عليه في الدنيا\n مؤاخذين عليها\n ليحاسبوا ويجازوا على نقير وقمطير { ثُمَّ تُوَفَّىٰ } تجزى { كُلُّ نَفْسٍ } على مقتضى { مَّا كَسَبَتْ } من خير وشر وظلم وجور { وَهُمْ لاَ يُظْلَمُونَ } [البقرة: 281] أصلاً\n لا بتنقيص الثواب ولا بتضعيف العقاب بل كل نفس فيها رهينة بما كسبت\n\n\nوعن ابن عباس رضي الله عنهما: أنها آخر ىية نزل بها جبريل عليه السلام\n وقال:\n \" ضعها في رأس المائتين والثمانين من البقرة \" \nوعاش رسول الله صلى الله عليه وسلم بعهدها إحدى وعشرين يوماً وقيل: إحدى وثمانين\n وقيل: سبعة آيام\n وقيل: ثلاث ساعات\n\n\nعليك أيها المؤمن المتوجه إلى تصفية الذات أن تدخر لنفسك هذه الآية كزاد آخرتك ما لا يسعه المطولات ولا يتدرج في المجلدات\n ولا يفي باستقصائها التعبيرات والإشارات\n وهي محتوية على جميع الأسرار الباعثة للإرسال والإنزوال والتبشير والإنذار\n لذلك ختم به الوحي\n وانقطع به الإنزال\n\n\nربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم قال تعالى: { واتقوا يوماً ترجعون فيه إلى الله } \n وهو يوم القيامة\n فتأهبوا للمصير إله بالصدقة وسائر الأعمال الصالحة\n { ثم توفّى كل نفس } جزاء ما أسلفت\n { وهم لا يظلمون } بنقص ثواب أو تضعيف عقاب\n قال ابن عباس: هذه آخر آية نزل بها جبريل\n فقال: ضعها في رأس المائتين والثمانين من البقرة\n وعاش بعدها رسول الله صلى الله عليه وسلم أحداً وعشرين يوماً\n وقيل: أحداً وثمانين\n وقيل غير ذلك\n والله تعالى أعلم\n الإشارة: وإن كان ذو عسرة من نور اليقين والمعرفة\n فلينظر إلى أهل الغنى بالله\n وليصحبهم ويتعلَّق بهم\n وهم العارفون\n فإنهم يغنونه بالنظر\n وفي بعض الأخبار: إن لله رجالاً من نظر إليهم سعد سعادة لا يشقى بعدها أبداً\n هـ\n ولله رجال إذا نظروا أغنَوْا\n وفي هذا المعنى يقول صاحب العينية:\n\nوقال الشيخ أبو العباس رضي الله عنه: والله ما بيني وبين الرجل إلا أن أنظر إليه وقد أغنيته\n وقال فيه شيخه: نعم الرجل أبو العباس\n يأتيه البدويُّ يبول على ساقه\n فلا يُمسي إلا وقد أوصله إلى ربه\n وقال شيخ شيوخنان سيدي العربي بن عبد الله: لو أتاني يهودي أو نصراني\n لَمْ يُمْسِ إلا وقد أوصلته إلى الله\n هـ\n وفي كل زمان رجال يُغْنُونَ بالنظر\n وقد أدركتهم\n وصحبتُهم والحمد لله\n والإشارة بقوله: { وأن تصدقوا خير لكم } إلى أهل الغنى بالله\n يتصدقون على الفقراء بالنظرة والهمة\n حتى يحصل لهم الغنى بالله\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:25",
      "similarity": 0.5677479480474508
    },
    {
      "verse": "45:22",
      "similarity": 0.4839784781848352
    },
    {
      "verse": "3:161",
      "similarity": 0.4787119182280938
    },
    {
      "verse": "32:11",
      "similarity": 0.4701408568562396
    },
    {
      "verse": "39:70",
      "similarity": 0.4408508478614304
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002281.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002281.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:281.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}