{
  "chapter": "البقرة",
  "text": "وعلم ءادم الاسماء كلها ثم عرضهم على الملئكة فقال انۢبـونى باسماء هؤلاء ان كنتم صدقين",
  "translations": [
    {
      "translation": "He taught Adam the names of all things. Then He arrayed them before the angels and said, 'Tell me the names of these if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He gave Adam knowledge of the nature and reality of all things and everything, and set them before the angels and said: \"Tell Me the names of these if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah replied, \"I know what you do not know.\" After this he taught Adam the names of all things. Then He set these before the angels and asked, \"Tell Me the names of these things, if you are right (in thinking that the appointment of a vicegerent will cause disorder)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He taught Adam all the names. Then He introduced (some intelligent beings) to the angels, asking them to tell Him the names of these beings, if the angels were true to their claim (that they more deserved to be His deputies on earth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah the Supreme taught Adam all the names (of things), then presented them to the angels, saying, “Tell Me the names of these, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names (of everything), then He showed them to the angels and said, \"Tell Me the names of these if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names, then presented them to the angels; then He said: Tell me the names of those if you are right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names, all of them; then He presented them unto the angels and said, 'Now tell Me the names of these, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names, then showed them to the angels, saying: Inform Me of the names of these, if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He taught Adam all the names, then He set them before the angels and said, \"Tell Me the names of these, if what you say be true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names, all of them; thereafter He set them before the angles, and said declare unto Me the names of those if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the Names, all of them; then presented them to the angels and said, ‘Tell me the names of these, if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names of all things; then He placed them before the angels, and said: \"Tell me the names of these if ye are right.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names (of everything), then He showed them to the angels and said, \"Tell Me the names of these if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He taught Adam (father of humans) the names all of them and then presented them to the angels, saying: 'Tell Me the names of these, if you are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names, all of them; then he presented them to the angels, and said, “Tell Me the names of these, if you are sincere.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names - all of them. Then He showed them to the angels and said, \"Inform Me of the names of these, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:31] And He taught Adam the names, that is, the names of things named, all of them, by placing knowledge of them into his heart; then He presented them, these names, the majority of which concerned intellectual beings, to the angels and said, to them in reproach, ‘Now tell Me, inform Me, the names of these, things named, if you speak truly’, in your claim that I would not create anything more knowledgeable than you, or that you are more deserving of this vicegerency; the response to the conditional sentence is intimated by what precedes it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He taught Adam all the names), the names of all his progeny, or the names of all the beasts and other things, including: a cooking pot, a plate and saucer, (then showed them) to prove that they were wrong (to the angels) who were commanded to prostrate, (saying: Inform Me of the names of these) created beings and descendents, (if ye are truthful) in your first claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وعلم آدم الأسماء كلها } أي: ألقى في قلبه خواص الأشياء التي تعرف بها هي ومنافعها ومضارّها { ثم عَرَضُهُم } أي: عرض مسمياتها { على الملائكةِ } بشهودهم البنية الإنسانية ومرافقتهم لآدم في التنزيل\n ومعنى قوله: { فقال أنبئوني بأسماءِ هؤلاءِ إن كنتمْ صادقين } إرادته لانتعاشهم ببعض معلومات الإنسان باقتضاء التركيب الإنساني\n وتأذَّي محسوساته ومعلوماته المتنوعة منها والحادثة فيه بخاصية التركيب والهيئة الاجتماعية إلى ذواتهم بعد ما لم تكن\n إذ علومهم تابعة لعلمه وهو معنى إفحامهم وتعلق إرادته بذلك أمر آدم بالإنباء إذ جميع القوى الإنسانية والملائكة التي بحضرته تنتعش بما لا تنتعش هي في غير ذلك المحل\n وهو معنى إنباء آدم إياهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتنبيهاً على جلالة قدر المظهر الجامع فقال: { وَعَلَّمَ ءَادَمَ } سبحانه\n أي: ذكره { ٱلأَسْمَآءَ } التي أودعها في ذاته وأوجد بها ما في العالم من الآثار البديعة { كُلَّهَا } بحيث لا يبقى من الأوصاف المتقابلة والأسماء المتخالفة المتضادة شيء إلا ما استأثر به في غيبه { ثُمَّ عَرَضَهُمْ } الأسماء المودعة باعتبار مسمياتها وآثارها الظاهرة في الآفاق { عَلَى ٱلْمَلَٰئِكَةِ } الذين يدعون الأولوية في أمر الخلافة { فَقَالَ } تعالى لهم مخاطباً على سبيل الإسكات والتبكيت: { أَنْبِئُونِي } عن روية وبصيرة { بِأَسْمَآءِ هَـٰؤُلاۤءِ } المسميات\n وبأسباب هؤلاء الآثار والمسببات { إِن كُنْتُمْ صَٰدِقِينَ } [البقرة: 31] في دعوى الأولوية والأحقية للنيابة\n محقين في الاعتراض على آدم لا عن علم بحاله\n\n\n{ قَالُواْ } مستوحشين من هذه الكلمات\n معتذرين متذليين خائفين من عتابه تعالى\n متذكرين عن سوء الأدب مع الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فقال }: أخبروني { بأَسْمَاءِ هَؤُلاءِ } المسيمات { إن كنتم صادقين } في ادعائكم استحقاق الخلافة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:37",
      "similarity": 0.4851292669064914
    },
    {
      "verse": "5:27",
      "similarity": 0.44690989155102995
    },
    {
      "verse": "2:33",
      "similarity": 0.41180836468259013
    },
    {
      "verse": "36:60",
      "similarity": 0.39275461947690604
    },
    {
      "verse": "3:59",
      "similarity": 0.37661951912763003
    }
  ]
}