{
  "chapter": "البقرة",
  "text": "قالوا۟ سبحنك لا علم لنا الا ما علمتنا انك انت العليم الحكيم",
  "translations": [
    {
      "translation": "They said, 'Glory be to You! We have no knowledge except what You have taught us. You are the All- Knowing, the All-Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: \"Glory to You (O Lord), knowledge we have none except what You have given us, for You are all-knowing and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"Glory be to You. You alone are free from defect. We possess only that much knowledge which You have given us. Indeed You alone are All-Knowing and All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels replied, \"You are glorious indeed! We do not know more than what You have taught us. You alone are All-knowing and All-wise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Purity is to You! We do not have any knowledge except what You have taught us! Indeed You only are the All Knowing, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (angels) said: \"Glory is to You, we have no knowledge except what you have taught us. Verily, You are the Knower, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Glory be to Thee! we have no knowledge but that which Thou hast taught us; surely Thou art the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Glory be to Thee! We know not save what Thou hast taught us. Surely Thou art the All-knowing, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Be glorified! We have no knowledge saving that which Thou hast taught us. Lo! Thou, only Thou, art the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Glory be to You; we have no knowledge except whatever You have taught us. You are the All Knowing, the All Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: hallowed be Thou no knowledge is our save that which Thou hast taught us, verily Thou! Thou art the Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Immaculate are You! We have no knowledge except what You have taught us. Indeed You are the All-knowing, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Glory to Thee, of knowledge We have none, save what Thou Hast taught us: In truth it is Thou Who art perfect in knowledge and wisdom.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (angels) said: \"Glory be to You, we have no knowledge except what you have taught us. Verily, it is You, the All-Knower, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to You,' they replied, 'we have no knowledge except that which You have taught us. You are indeed the Knowing, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Glory be to You! We have no knowledge except what You have taught us. It is you who are the Knowledgeable, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Exalted are You; we have no knowledge except what You have taught us. Indeed, it is You who is the Knowing, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:32] They said, ‘Glory be to You!, exalting You above that any should object to You, We know not except what   You have taught us. Surely You are (innaka anta emphasises the [preceding suffixed pronoun] kāf) the Knower, Wise’, from whose knowledge and wisdom nothing escapes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Be glorified!), we repent to you of what we said (We have no knowledge saving that which Thou hast taught us), inspired us with. (Lo! Thou, only Thou, art the Knower) of us and of them (the Wise) regarding our matters and theirs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ومعنى قوله: { قالوا سبحانك لا عِلْمَ لنا إلا ما علمتَنَا إنك أنت العليمُ الحكيمُ } شهادة وجوداتهم بالدلالة وألسنة الحال على قصورهم عن الكمالات الإنسانية وتخلفهم عن شأوها\n وبتنزيه الله عن فعل ما فيه مفسدة بالإجمال\n وعلمهم بامتناع ترقيهم إلى مراتبهم بكسب العلوم\n إذ كمالاتهم مقارنة لوجوداتهم\n وبأن علمه تعالى فوق علمهم فهو العليم المطلق\n والحكيم الذي لا يفعل إلا ما ينبغي\n ولهذا قال: { يا آدَمُ أَنْبِئهُم } ولم يقل علمهم\n لأنّ العلم المكتسب الموجب للترقي هو من خاصية الجمعية الإنسانية فلا يقبل كل منها إلا ما في طباعه من جنس مدركاته لا غير\n وكما أن البصر مثلاً من كثرة مبصراته لا يزيد علماً ورتبة ولا يقبل إلا ما هو من جنس المبصرات فقط\n وإن تكثرت عنده فكذلك حال كل قوة باطنة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مستحيين عن سؤالهم من فعله الذي لا يسأل عنه قائلين: { سُبْحَٰنَكَ } ننزهك من أن يعترض عليك ويسأل عن فعلك\n ذلك الحكم في ملكوتك والتصرف في مقتضيات أسمائك\n وإنما بسطنا معك الكلام لا لانبساطك بنا\n إذ { لاَ عِلْمَ لَنَآ } منها { إِلاَّ مَا عَلَّمْتَنَآ } بقدر استعداداتنا وقابلياتنا { إِنَّكَ أَنْتَ ٱلْعَلِيمُ } بجميع الاستعدادات والقابليات { ٱلْحَكِيمُ } [البقرة: 32] بإقامته ما ينبغي لمن ينبغي بلا عللٍ واعتراضٍ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فلما عجزوا عن معرفة تلك الأسماء { قَالُوا سُبْحَانَكَ } أي: تنزيهاً لك عن العبث\n { لا عِلْمَ لَنَا إلاَّ مَا عَلَّمْتَنَا إنَّكَ أَنتَ الْعَلِيمُ } بكل شيء\n { الْحَكيمُ } لإتقانك كل شيء\n وهذا اعتراف منهم بالقصود والعجز\n وإشعار بأن سؤالهم كان استفهاماً وطلباً لتفسير ما أشكر عليهم\n ولم يكن اعتراضاً\n يقول الحقّ جلّ جلاله: { يَا آدَمُ أَنْبِئْهُمْ بِأَسْمَائِهِم } \n وعيِّن لهم اسم كل مسمى\n فلما أخبرهم بذلك بحيث قال مثلاً: هذا فرس وهذا جمل\n وعين ذلك لهم\n وظهرت ميزته عليهم بالعلم حتى استحق الخلافة\n قال الحقّ تعالى: { أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلمُ غَيْبَ السَّمَوَاتِ وَالأَرْضِ } أي: ما غاب\n وأعلم ما تظهرونه من قولكم: { أَتَجْعَلُ فِيهَا\n\n\n } الخ\n وما تكتمونه من استحقاقكم الخلافة\n وقولكم: لن يخلق الله تعالى أحداً أعلم منا لتقدمنا\n والفضل لمن صدق لا لمن سبق\n قال البيضاوي: اعلم أن هذه الآيات تدل على شرف الإنسان\n ومزية العلم وفضله على العبادة\n وأنه شرط في الخلافة\n بل العمدة فيها\n وأن التعليم يصح إطلاقه عليه تعالى\n وإن لم يصح إطلاق المعلم عليه لاختصاصه بمن يحترف به\n وأن اللغات توقيفية - عملها الله بالوحي -\n وأن آدم عليه السلام أفضل من هؤلاء الملائكة لأنه أعلم منهم\n والأعلم أفضل لقوله تعالى:\n\n[الزُّمَر: 9]\n وأن الله يعلم الأشياء قبل حدوثها\n هـ\n باختصار\n وقال في تفسير الملائكة: إنهم أجسام لطيفة قادرة على التشكل\n وهي منقسمة على قسمين: قسم شأنهم الاستغراق في معرفة الحق والتنزه عن الاشتغال بغيره\n - وهم العليِّون\n والملائكة المقربون - وقسم يدبرون الأمر من السماء إلى الأرض على ما ثبت به القضاء وجرى به القلم الإلهي\n وهم المدبرات أمراً\n فمنهم سماوية\n ومنه أرضية\n هـ\n مختصراً\n الإشارة: اعلم أن الروح القائمة بهذا الآدمي هي قطعة من الروح الأعظم التي هي المعاني القائمة بالأواني\n وهي آدم الأكبر والأب الأدم\n وفي ذلك يقول ابن الفارض:\nفلمّا أراد الحق تعالى أن يستخلف هذا الروح في هذه البشرية لتدبرها وتصرفها فيما أريد منها\n قالت الملائكة بلسان حالها: كيف تجعل فيها من يفسد فيها بالميل إلى الحظوظ والشهوات\n ويسفك الدماء بالغضب والحميات\n ونحن نسبحك وننزهك عما لا يليق بك؟ رأت الملائكة ما يصدر من بعض الأرواح من الميل إلى الحضيض الأسفل\n ولم تر ما يصدر في بعضها من التصفية والترقية\n فقال لهم الحق تعالى: { إني أعلم ما لا تعلمون } فإن منها من تعرج إلى عرش الحضرة\n وتعبدني بالفكرة والنظرة\n وتستولي على الوجود بأسره\n وتنكشف لها عند ذلك أسرار الذات وأنوار الصفات وأسماء المسميات\n فيقول الحق تعالى للملائكة: هل فيكم من كشف له عن هذا السر المكنون\n والاسم المصون\n فقالوا: { سُبْحَانَكَ لا عِلْمَ لَنَا إِلاَّ مَا عَلَّمْتَنَا } من علم الصفات دون أسرار الذات { إنَّكَ أَنتَ الْعَلِيمُ الْحَكِيمُ } يقول الحق تعالى لروح العارف التي نفذت إلى بحر وحدة الذات وتيار الصفات: أنبئهم بما غاب عنهم من أسرار الجبروت\n وأسماء الملكوت\n فلما أعلمهم بما كوشف له من الأسرار\n وانفق له من الأنوار\n أقروا بشرف الآدمي\n وسجدوا لطلعة آدم عليه السلام فقال الحق لهم: { أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ غَيْبَ السَّمَوَاتِ وَالأَرْضِ }؟ أي: ما غاب في سماء الأرواح من الأسرار وفي أرض النفوس من الأنوار\n وأعلم ما تظهرونه من الانقياد\n وما تكتمونه من الاعتقاد\n والله تعالى أعلم\n ولما تبينّ شرف آدم عليه السلام وبان فضله أمرهم بالسجود له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:166",
      "similarity": 0.704204771869191
    },
    {
      "verse": "79:3",
      "similarity": 0.6718783072111828
    },
    {
      "verse": "57:1",
      "similarity": 0.6396364558061135
    },
    {
      "verse": "59:1",
      "similarity": 0.6396364558061135
    },
    {
      "verse": "61:1",
      "similarity": 0.6396364558061135
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:32.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:32.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}