{
  "chapter": "البقرة",
  "text": "فازلهما الشيطن عنها فاخرجهما مما كانا فيه وقلنا اهبطوا۟ بعضكم لبعض عدو ولكم فى الارض مستقر ومتع الى حين",
  "translations": [
    {
      "translation": "But Shaytan made them slip up by means of it, expelling them from where they were. We said, 'Go down from here as enemies to each other! You will have residence on the earth and enjoyment for a time.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan tempted them and had them banished from the (happy) state they were in. And We said: \"Go, one the antagonist of the other, and live on the earth for a time ordained, and fend for yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After a time Satan tempted them with that tree to disobey. Our Command and brought them out of the state they were in, and We decreed, \"Now, go down all of you from here; you are enemies of one another. Henceforth you shall dwell and provide for yourselves on the Earth for a specified period.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan made Adam and his spouse err and caused them to abandon the state in which they had been living. Then We said, \"Descend, you are each other's enemies! The earth will be a dwelling place for you and it will provide you with sustenance for an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the devil destabilised them in it and removed them from where they were – and We said, “Go down, one of you is an enemy to the other; and for a fixed time you shall stay on earth and feed in it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Shaytan made them slip therefrom (the Paradise), and got them out from that in which they were. We said: \"Get you down, all, with enmity between yourselves. On earth will be a dwelling place for you and an enjoyment for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Shaitan made them both fall from it, and caused them to depart from that (state) in which they were; and We said: Get forth, some of you being the enemies of others, and there is for you in the earth an abode and a provision for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan caused them to slip therefrom and brought them out of that they were in; and We said, 'Get you all down, each of you an enemy of each; and in the earth a sojourn shall be yours, and enjoyment for a time.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them to deflect therefrom and expelled them from the (happy) state in which they were; and We said: Fall down, one of you a foe unto the other! There shall be for you on earth a habitation and provision for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them both to slip through this and thus brought about the loss of their former state. We said, \"Go down from here as enemies to each other; and on earth you shall have your abode and your livelihood for a while!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Satan caused the twain to slip on account thereof, and drave them forth from that which the twain were in. And We said: get ye down, one of you an enemy unto anot her, and for you on the earth shall be a resting-place and enjoyment for a season.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan caused them to stumble from it, and he dislodged them from what [state] they were in; and We said, ‘Get down, being enemies of one another! On the earth shall be your abode and sustenance for a time.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did Satan make them slip from the (garden), and get them out of the state (of felicity) in which they had been. We said: \"Get ye down, all (ye people), with enmity between yourselves. On earth will be your dwelling-place and your means of livelihood - for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Shaitan (Satan) made them slip therefrom (the Paradise), and got them out from that in which they were. We said: \"Get you down, all, with enmity between yourselves. On earth will be a dwelling place for you and an enjoyment for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But satan made them slip therefrom and caused them to depart from that in which they had been. 'Go down,' We said, 'be enemies to each other. The earth will provide your dwelling place an enjoyment for a while'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them to slip from it, and caused them to depart the state they were in. We said, “Go down, some of you enemies of one another. And you will have residence on earth, and enjoyment for a while.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them to slip out of it and removed them from that [condition] in which they had been. And We said, \"Go down, [all of you], as enemies to one another, and you will have upon the earth a place of settlement and provision for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:36] Then Satan, Iblīs, caused them to slip, he caused them to be removed (fa-azallahumā: a variant reading has fa-azālahumā: he caused them to be away from it) therefrom, that is, from the Garden, when he said to them, ‘Shall I point you to the tree of eternity’ [cf. Q. 20:120], and swore to them by God that he was only giving good advice to them, and so they ate of it; and brought them out of what they were in, of bliss; and We said, ‘Go down, to earth, both of you and all those comprised by your seed; some of you, of your progeny, an enemy to the other, through your wronging one another; and in the earth a dwelling, a place of settlement, shall be yours, and enjoyment, of whatever of its vegetation you may enjoy, for a while’, [until] the time your terms [of life] are concluded.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء عاطفة على قوله : { ولا تقربا } \\[ البقرة : 35 \\] وحَقها إفادة التعقيب فيكون التعقيب عرفياً لأن وقوع الإزلال كان بعدَ مضي مدة هي بالنسبة للمدة المرادة من سكنى الجنة كالأَمد القليل . والأحسن جعل الفاء للتفريع مجردة عن التعقيب .والإزلال جعل الغير زَالاًّ أي قائماً به الزلل وهو كالزَلَق أن تسير الرجلان على الأرض بدون اختيار لارتخاء الأرض بطين ونحوه ، أي ذاهبة رجلاه بدون إرادة ، وهو مجاز مشهور في صدور الخطيئة والغلط المضر ومنه سمي العصيان ونحوه الزلل .والضمير في قوله : { عنها } يجوز أن يعود إلى الشجرة لأنها أقرب وليتبين سبب الزلة وسبب الخروج من الجنة إذ لو لم يجعل الضمير عائداً إلى الشجرة لخلت القصة عن ذكر سبب الخروج . و ( عن ) في أصل معناها أي أزلهما إزلالاً ناشئاً عن الشجرة أي عن الأكل منها ، وتقدير المضاف دل عليه قوله : { ولا تقربا هذه الشجرة } ، وليست ( عن ) للسببية ومن ذكر السببية أراد حاصل المعنى كما قال أبو عبيدة في قوله تعالى : { وما ينطق عن الهوى } \\[ النجم : 3 \\] أن معناه وما ينطق بالهوى فقال الرضي : الأوْلى أن ( عن ) بمعناها وأن الجار والمجرور صفة لمصدر محذوف أي نطقاً صادراً عن الهوى . ويجوز كون الضمير للجنة وتكون ( عن ) على ظاهرها والإزلال مجازاً في الإخراج بكره والمراد منه الهبوط من الجنة مكرهين كمن يزل عن موقفه فيسقط كقوله : «وكم منزل لولايَ طِحْتَ» .وقولُه : { فأخرجهما مما كانا فيه } تفريع عن الإزلال بناء على أن الضمير للشجرة ، والمراد من الموصول وصلته التعظيم ، كقولهم قد كان ما كان ، فإن جعلت الضمير في قوله : { عنها } عائداً إلى الجنة كان هذا التفريع تفريع المفصَّل عن المجمل وكانت الفاء للترتيب الذكْري المجرَّد كما في قوله تعالى : { وكم من قرية أهلكناها فجاءها بأسنا بياتاً أوْ هُم قائلون } \\[ الأعراف : 4 \\] وقوله : { كذَّبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدُجِر } \\[ القمر : 9 \\] . أما دلالة الموصول عن التعظيم فهي هي .وقرأ حمزة «فأزالهما» بألف بعد الزاي وهو من الإزالة بمعنى الإبعاد ، وعلى هذه القراءة يتعين أن يكون ضمير { عنها } عائداً إلى الجنة لا إلى الشجرة . وقد نُبه عليه بخصوصه مع العلم بأن من خَرج من الجنة فقد خرج مما كان فيه إحضاراً لهذه الخسارة العظيمة في ذهن السامعين حتى لا تكون استفادتها بدلالة الالتزام خاصة فإنها دلالة قد تخفى فكانت إعادته في هذه الصلة بمرادفه كإعادته بلفظه في قوله تعالى : { فغَشِيَهم من اليَمِّ ما غَشِيَهُم } \\[ طه : 78 \\] .وتفيد الآية إثارة الحسرة في نفوس بني آدم على ما أصاب آدم من جراء عدم امتثاله لوصاية الله تعالى وموعظة تُنبِّهُ بوجوب الوقوف عند الأمر والنهي والترغيب في السعي إلى ما يعيدهم إلى هذه الجنة التي كانت لأبيهم وتربيةِ العداوة بينهم وبين الشيطان وجنده إذ كان سبباً في جر هذه المصيبة لأبيهم حتى يكونوا أبداً ثأراً لأبيهم مُعادين للشيطان ووسوسته مسيئين الظنون بإغرائه كما أشار إليه قوله تعالى :{ يا بني آدم لا يفتننكم الشيطان كما أخرج أبويكم من الجنة } \\[ الأعراف : 27 \\] وقوله هنا : { بعضكم لبعض عدو } . وهذا أصل عظيم في تربية العامة ولأجله كان قادة الأمم يذكرون لهم سوابق عداوات منافسيهم ومَن غلبهم في الحروب ليكون ذلك باعثاً على أخذ الثأر .وعطفُ { وقلنا اهبطوا } بالواو دون الفاء لأنه ليس متُفرِّع عن الإخراج بل هو متقدم عليه ولكن ذكر الإخراج قبل هذا لمناسبةِ سياققِ ما فعله الشيطان وغروره بآدم فلذلك قدم قوله : { فأخرجهما } إثر قوله : { فأزلهما الشيطان } . ووجه جمع الضمير في { اهبطوا } قيل لأن هبوط آدم وحواءَ اقتضى أن لا يوجد نسلهما في الجنة فكان إهباطهما إهباطاً لنسلهما ، وقيل الخطاب لهما ولإبليس وهو وإن أُهبط عند إبايته السجود كما أفاده قوله تعالى في سورة الأعراف { قال أنا خير منه خلقتني من نار وخلقته من طين قال فاهبط منها فما يكون لك أن تتكبر فيها فاخرج إنك من الصاغرين } \\[ الأعراف : 12 ، 13 \\] إلى قوله { قال اخرجُ منها مذءوماً مدحوراً } \\[ الأعراف : 18 \\] إلى قوله { ويا آدم اسكن أنت وزوجك الجنة } \\[ الأعراف : 19 \\] فهذا إهباط ثان فيه تحجير دخول الجنة عليه والإهباطُ الأول كان إهباطَ مَنع من الكرامة مع تمكينه من الدخول للوسوسة وكلا الوجهين بعيد ، فالذي أراه أن جمع الضمير مراد به التثنية لكراهية توالي المثنيات بالإظهار والإضمار من قوله : { وكُلا منها رغداً } \\[ البقرة : 35 \\] والعرب يستثقلون ذلك قال امرؤ القيس :وقوفاً بها صحبي عليَّ مطيَّهم ... يقُولون لا تهلك أسىً وتجملوإنما له صاحبان لقوله : «قفا نبك» إلخ وقال تعالى : { فقد صَغَت قلوبكما } وسيأتي في سورة التحريم ( 4 ) .وقوله : بعضكم لبعض عدو } يحتمل أن يراد بالبعض بعض الأنواع وهو عداوة الإنس والجن . إن كان الضمير في { اهبطوا } لآدم وزوجه وإبليس ، ويحتمل أن يراد عداوة بعض أفراد نوع البشر ، إن كان ضمير { اهبطوا } لآدم وحواء فيكون ذلك إعلاماً لهما بأثر من آثار عملهما يورث في بنيهما ، ولذلك مبدأ ظهور آثار الاختلاف في تكوين خلقتهما بأن كان عصيانهما يورث في بنيهما ، ولذلك مبدأ ظهور آثار الاختلال في تكوين خلقتهما بأن كان عصيانهما يورث في أنفسهما وأنفس ذريتهما داعية التغرير والحيلة على حد قوله تعالى : { إن من أزواجكم وأولادكم عدواً لكم } فإن الأخلاق تورث وكيف لا وهي مما يعدى بكثرة الملابسة والمصاحبة وقد قال أبو تمام :لأعْديتني بالحلم إن العلا تعدي ... ووجه المناسبة بين هذا الأثر وبين منشئه الذي هو الأكل من الشجرة أن الأكل من الشجرة كان مخالفة لأمر الله تعالى ورفضاً له وسوء الظن بالفائدة منه دعا لمخالفته الطمع والحرص على جلب نفع لأنفسهما ، وهو الخلود في الجنة والاستئثار بخيراتها مع سوء الظن بالذي نهاهما عن الأكل منها وإعلامه لهما بأنهما إن أكلا منها ظلما أنفسهما لقول إبليس لهما :{ ما نهاكما ربكما عن هذه الشجرة إلا أن تكونا ملكين أو تكونا من الخالدين } \\[ الأعراف : 20 \\] فكذلك كانت عداوة أفراد البشر مع ما جبلوا عليه من الألفة والأنس والاتحاد منشؤها رفض تلك الألفة والاتحاد لأجل جلب النفع للنفس وإهمال منفعة الغير ، فلا جرم كان بين ذلك الخاطر الذي بعثهما على الأكل من الشجرة وبين أثره الذي بقي في نفوسهما والذي سيورثونه نسلهما فيخلق النسل مركبة عقولهم على التخلق بذلك الخلق الذي طرأ على عقل أبويهما ، ولا شك أن ذلك الخلق الراجع لإيثار النفس بالخير وسوء الظن بالغير هو منبع العداوات كلها لأن الواحد لا يعادي الآخر إلا لاعتقاد مزاحمة في منفعة أو لسوء ظن به في مضرة . وفي هذا إشارة إلى مسألة أخلاقية وهي أن أصل الأخلاق حسنها وقبيحها هو الخواطر الخيرة والشريرة ثم ينقلب الخاطر إذا ترتب عليه فعل فيصير خلقاً وإذا قاومه صاحبه ولم يفعل صارت تلك المقاومة سبباً في اضمحلال ذلك الخاطر ، ولذلك حذرت الشريعة من الهم بالمعاصي وكان جزاء ترك فعل ما يهم به منها حسنة وأمرت بخواطِر الخير فكان جزاء مجردِ الهمِّ بالحسنة حسنةً ولو لم يعملها وكان العمل بذلك الهَم عشرَ حسنات كما ورد في الحديث الصحيح : « مَن همَّ بحسنة فلم يعملها كتبها الله عنده حسنة كاملة ثم قال ومَنْ همَّ بسيئة فعملها كُتبت له سيئةٌ واحدة » وجعل العفو عن حديث النفس مِنَّة من الله تعالى ومغفرة في حديث « إن الله تجاوز عن أمتي فيما حدثت به نفوسها »إن الله تعالى خلق الإنسان خَيِّراً سالماً من الشرور والخواطر الشريرة على صفة مَلَكية وهو معنى { لقد خلقنا الإنسان في أحسن تقويم } \\[ التين : 4 \\] ثم جعله أطواراً فأولها طور تعليمِه النطقَ ووضععِ الأسماء للمسميات لأن ذلك مبدأُ المعرفة وبه يكون التعليم أي يعلم بعض أفراده بعضاً ما علِمَه وجَهِلَهُ الآخرِ فكان إلهامُه اللغة مبدأَ حركة الفكر الإنساني وهو مبدأ صالح للخير ومعين عليه لأن به علَّم الناسُ بعضهم بعضاً ولذلك ترى الصبي يرى الشيءَ فيسرعُ إلى قرنائه يُناديهم ليَرَوْهُ معه حرصاً على إفادتهم فكان الإنسان معلِّماً بالطبع وكان ذلك معيناً على خيريته إلا أنه صالح أيضاً لاستعمال النطق في التمويه والكذب؛ ثم إن الله تعالى لما نهاه عن أمر كلَّفه بما في استطاعته أن يمتثله وأن يخالفه فتلك الاستطاعة مبدأ حركة نفسه في الحرص والاستئثار فكان خَلْق الله تعالى إياه على تلك الاستطاعة مبدأ طَور جديد هو المشار إليه بقوله : { ثم رَدَدْناه أَسفل سافلين } \\[ التين : 5 \\] ، ثم هداه بواسطة الشرائع فصار باتباعها يبلغ إلى مراتب الملائكة ويرجع إلى تقويمه الأول وذلك معنى قوله :{ إلا الذين آمنُوا وعملوا الصالحات } \\[ التين : 6 \\] وقد أشير إلى هذا الطور الأخير بقوله فيما يأتي : { فإما يأتينكم مني هُدى فَمَنْ تَبِعَ هُداي } \\[ البقرة : 38 \\] الآية .وجملة { بعضكم لبعض عدو } إما مستأنفة استئنافاً ابتدائياً وإما جملة حال من ضير { اهبطوا } وهي اسمية خلت من الواو ، وفي اعتبار الجملة الاسمية الخالية من الواو حالا خلاف بين أئمة العربية ، منع ذلك الفراء والزمخشري وأجازه ابن مالك وجماعة . والحق عندي أن الجملة الحالية تستغني بالضمير عن الواو وبالواو عن الضمير فإذا كانت في معنى الصفة لصاحبها اشتملت على ضميره أو ضمير سببيِّه فاستغنت عن الواو نحو الآية ونحوجاء زيد يَدُه على رأسه أو أَبُوه يرافقه ، وإلا وجبت الواو إذ لا رابط حينئذ غيرُها نحو جاء زيد والشمسُ طالعة وقوللِ تأبط شراً :فخالط سَهْلَ الأرضضِ لَمْ يَكْدَح الصَّفَا ... به كَدْحَةً والموتُ خَزيان يَنْظُروقوله : { ولكم في الأرض مستقر } ضميره راجع إلى ما رجع إليه ضمير { اهبطوا } على التقادير كلها . والحين الوقت والمراد به وقت انقراض النوع الإنساني والشيطاني بانقراض العالم ، ويحتمل أن يكون المراد من ضمير { لكم } التوزيعَ أي ولكل واحد منكم في الأرض مستقر ومتاع إلى حين . وإنما كان ذلك متاعاً لأن الحياة أمر مرغوب لسائر البشر على أن الحياة لا تخلو من لذات وتمتع بما وَهَبَنا الله من الملائمات . هذا إن أريد بالخبر المجموع أي لجميعكم وإن أريد به التوزيع فالحين هو وقت موت كل فرد على حدِّ قولك للجيش : هذه الأفْراس لكم أي لكل واحد منكم فرس .\n\n",
      "translations": [
        {
          "translation": "(But the Devil caused them to deflect), caused them to slip (therefrom), from Paradise, (and expelled them from the state in which they were), from the comfort which they had enjoyed; (and We said) to Adam, Eve, the peacock and the serpent (Fall down) go down to the earth, (one of you a foe unto the other! There shall be for you on earth a habitation), a dwelling-place, (and a provision), a benefit and livelihood, (for a time) until the moment of death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { مَتَاعٌ إِلَىٰ حِينٍ } أَي إِلى وقتٍ، والمَتَاعُ: الزَّادُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Mata'un ila hinin} - that is, until a time - and Mata'un refers to the provision.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فأزَلهُما الشيطانُ عنها } أي: حملهما على الزلة من مقامهما إ لى مهوى الطبيعة عن الجنة بتسويل الملاذ الجسمانية ودوامها عليهما { فأخرجهما مما كانا فيه } من النعيم والروح الدائم\n وقيل: بينما هما يتفرّجان في الجنة إذ راعهما طاووس تجلّى لهما على سور الجنة\n فدنت حواء منه وتبعها آدم فوسوس لهما الشيطان من وراء الجدار\n وقيل: توسل بحيّة تتسوّر الجنة فأخذ بذنبها وصعد الجنة\n والأوّل إشارة إلى توسله من قبل الشهوة خارج الجنة\n والثاني: إلى توسله بالغضب\n وتسوّره جدار الجنة: إشارة إلى أن الغضب أقرب إلى الأفق الروحانيّ والحيز القلبيّ من الشهوة\n { وقلنا اهبطوا } أي: ألزمناهم الهبوط إلى الجهة السفلية التي هي العالم الجسمانيّ { بعضكم لبعض عدو } حال من الهبوط مقيد له إذ الهبوط إلى الدنيا التي هي الجهة السفلية يستلزم كون مطالبها جزئية في ضيق المادة محصورة لا تحتمل الشركة\n وكلما حظي بها أحد حرم منها غيره فمنعه\n فيقع بينهما العداوة والبغضاء بخلاف المطالب الكلية وجمع الخطاب لأن خطابهما خطاب النوع إذ الأصل يتناول الفرع { ولكم في الأرض } أي: في هذه الجهة { مُسْتَقر } استقرار { ومتاعٌ } تمتع { إلى حينٍ } أي: حين تجرّدهما بالموت الإرادي وانقطاع حظوظهما بالموت الطبيعي وقيام أحد القيامتين الكبرى أو الصغرى\n { فتلقى آدم من ربهِ كلماتٍ } أي: استقبل من جهة ربّه أنواراً وأطواراً\n أي: مراتب من الملكوت والجبروت وأرواحاً مجرّدة\n إذ كل مجرد كلمة لأنه من عالم الأمر كما سمي عيسى كلمة أو تلقن منه معارف وعلوماً وحقائق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبالجملة: { فَأَزَلَّهُمَا } ألجأهما إلى ارتكاب الزلة بوسوسة { ٱلشَّيْطَانُ عَنْهَا } العدو لهما والرقيب معهما فتنادوا عنها عن الشجرة المنهية { فَأَخْرَجَهُمَا مِمَّا } أي: من الحضور الذي { كَانَا فِيهِ } أي: في دار السرور { وَ } بعدما ظهر زلتهما { قُلْنَا } لهما ولناصحهما: { ٱهْبِطُواْ } من دار السرور إلى دار الغرور\n ومن دار الكرامة إلى دار الابتلاء والملائمة\n وعيشوا فيها مع النزاع والخصومة\n إذ { بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ } ينتهز الفرصة لمقته { وَ } بعد هبوطمم { لَكُمْ فِي ٱلأَرْضِ } التي هي محل التفرقة وموطن الفتن والمحن { مُسْتَقَرٌّ } موضع قرار { وَمَتَاعٌ } استمتاع لمزخرفاتها ومستلذاتها الغير القارة التي ألهاكم الشيطان بها عن النعيم الدائم { إِلَىٰ حِينٍ } [البقرة: 36] قيام الساعة التي هي الطامة الكبرى\n\n\nثم لما لم يكن زلة آدم من نفسه ومن مقتضى طبعه بل بسوسوة عدوه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أزلهما }: أوقعهما في الزلل بسبب الأكل\n أو أذهبهما عن الجنة\n ويدل عليه قراءة حمزة: \" فأزالهما \" وجملة { بعضكم لبعض عدو }: حالية\n أي: متعادين\n يقول الحقّ جلّ جلاله: { وَقُلْنَا يَا آدَم } حين سجدت له الملائكة ودخل الجنة: { اسْكُنْ أَنتَ وَزَوْجُكَ } حواء { الجنة } \n وكانت خلقت من ضلعه الأيسر\n { وَكُلا } من ثمار الجنة { حَيْثُ شِئْتُمَا وَلا تَقْرَبَا هَذِهِ الشَّجِرَةَ }: العنب أو التين أو الحنطة { فَتَكُونَا } إن أكلتما منها { مِنَ الظَّالِمِينَ } لنفسيكما\n فدخل إبليس خفية أو في فم الحية\n فتكلم مع آدم عليه السلام فقال له آدمُ عليه السلام: ما أحسن هذه الحالة لو كان الخلود\n فحفظها إبليس\n ووجد فيها مدخلاً من جهة الطمع\n فقال له:\n[طه: 120] فدلّه على أكل الشجرة\n وقال:\n[الأعرَاف: 20] عنها\n[الأعراف: 20] كراهية\n[الأعراف: 20\n 21]\n وأكلت حواء أولاً\n ثم قالت له: قد أكلتُ ولم يضرني\n ثم أكل آدم عليه السلام من جنس الشجرة\n لا من عينها\n متأوّلاً\n فطار التاج واللباس\n وأخرجهما { مما كانا فيه } من رغد العيش والعناء\n وأهبطهما إلى الأرض\n للتعب والعناء\n ليكون خليفة على ما سبق به القضاء\n فقال لهم الحقّ تعالى: { اهْبطُوا } آدم وحواء وإبليس والحية\n { بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِي الأَرْضِ } استقرار وتمتع { إلَى حِينٍ } وفاتكم\n فتقدمون علي فيجازي المحسن بإحسانه\n والمسيء بإساءته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:209",
      "similarity": 0.6455714854775179
    },
    {
      "verse": "7:24",
      "similarity": 0.6229217361268473
    },
    {
      "verse": "3:155",
      "similarity": 0.6119464733687413
    },
    {
      "verse": "16:94",
      "similarity": 0.5433435602962517
    },
    {
      "verse": "20:123",
      "similarity": 0.3918082467086151
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}