{
  "chapter": "البقرة",
  "text": "فتلقى ءادم من ربه كلمت فتاب عليه انه هو التواب الرحيم",
  "translations": [
    {
      "translation": "Then Adam received some words from his Lord and He turned towards him. He is the Ever-Returning, the Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his Lord sent commands to Adam and turned towards him: Indeed He is compassionate and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At that time Adam learnt appropriate words from his Lord and repented, and his Lord accepted his repentance, for He is very Relenting and very Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adam was inspired by some words (of prayer) through which he received forgiveness from his Lord, for He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam learnt from his Lord certain words (of revelation), therefore Allah accepted his repentance; indeed He only is the Most Acceptor of Repentance, the Most Merciful. (See Verse 7:23)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord Words. And his Lord pardoned him (accepted his repentance). Verily, He is the One Who forgives (accepts repentance), the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received (some) words from his Lord, so He turned to him mercifully; surely He is Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter Adam received certain words from his Lord, and He turned towards him; truly He turns, and is All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord words (of revelation), and He relented toward him. Lo! He is the relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received some words [of prayer] from his Lord and He accepted his repentance. He is the Forgiving One, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam learnt from his Lord certain Words, and He relented toward him, verily He! He is the Relentant, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received certain words from his Lord, and He turned to him clemently. Indeed He is the All-clement, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then learnt Adam from his Lord words of inspiration, and his Lord Turned towards him; for He is Oft-Returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord Words. And his Lord pardoned him (accepted his repentance). Verily, He is the One Who forgives (accepts repentance), the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received Words from his Lord, and his Lord relented towards him. He is the Receiver of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received words from his Lord, so He relented towards him. He is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord [some] words, and He accepted his repentance. Indeed, it is He who is the Accepting of repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:37] Thereafter Adam received certain words from his Lord, with which He inspired him (a variant reading [of Ādamu] has accusative Ādama and nominative kalimātu), meaning they [the words] came to him, and these were [those of] the verse Lord, we have wronged ourselves [Q. 7:23], with which he supplicated, and He relented to him, that is, He accepted his repentance; truly He is the Relenting, to His servants, the Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجاء بالفاء إيذاناً بمبادرة آدم بطلب العفو . والتلقي استقبال إكرام ومسرة قال تعالى : { وتتلقاهم الملائكة } \\[ الأنبياء : 103 \\] ووجه دلالته على ذلك أنه صيغة تفعل من لقيه وهي دالة على التكلف لحصوله وتطلبه وإنما يتكلف ويتطلب لقاء الأمر المحبوب بخلاف لاقى فلا يدل على كون الملاقى محبوباً بل تقول لاقى العدو . واللقاء الحضور نحو الغير بقصد أو بغير قصد وفي خير أو شر ، قال تعالى : { يا أيها الذين آمنوا إذا لقيتم الذين كفروا زحفاً } \\[ الأنفال : 45 \\] الآية فالتعبير بتلقى هنا مؤذن بأن الكلمات التي أخذها آدم كلمات نافعة له فعلم أنها ليست كلمات زجر وتوبيخ بل كلمات عفو ومغفرة ورضى وهي إما كلمات لقنها آدم من قبل الله تعالى ليقولها طالباً المغفرة وإما كلمات إعلام من الله إياه بأنه عفا عنه بعد أن أهبطه من الجنة اكتفاء بذلك في العقوبة ، ومما يدل على أنها كلمات عفو عطف { فتاب عليه } بالفاء إذ لو كانت كلمات توبيخ لما صح التسبب .وتلقي آدم للكلمات إما بطريق الوحي أو الإلهام . ولهم في تعيين هذه الكلمات روايات أعرضنا عنها لقلة جدوى الاشتغال بذلك ، فقد قال آدم الكلمات فتيب عليه فلنهتم نحن بما ينفعنا من الكلام الصالح والفعل الصالح .ولم تذكر توبة حواء هنا مع أنها مذكورة في مواضع أخرى نحو قوله : { قالا ربنا ظلمنا أنفسنا } \\[ الأعراف : 23 \\] لظهور أنها تتبعه في سائر أحواله وأنه أرشدها إلى ما أرشد إليه ، وإنما لم يذكر في هذه الآية لأن الكلام جرى على الابتداء بتكريم آدم وجعله في الأرض خليفة فكان الاعتناء بذكر تقلباته هو الغرض المقصود .وأصل معنى تاب رجع ونظيره ثاب بالمثلثة ، ولما كانت التوبة رجوعاً من التائب إلى الطاعة ونبذاً للعصيان وكان قبولها رجوعاً من المتوب إليه إلى الرضى وحسن المعاملة وصف بذلك رجوع العاصي عن العصيان ورجوع المعصي عن العقاب فقالوا تاب فلان لفلان فتاب عليه لأنهم ضمنوا الثاني معنى عطف ورضى فاختلاف مفادي هذا الفعل باختلاف الحرف الذي يتعدى به وكان أصله مبنياً على المشاكلة .والتوبة تتركب من علم وحال وعمل ، فالعلم هو معرفة الذنب والحال هو تألم النفس من ذلك الضرر ويسمى ندماً ، والعمل هو الترك للإثم وتدارك ما يمكن تداركه وهو المقصود من التوبة ، وأما الندم فهو الباعث على العمل ولذلك ورد في الحديث : «الندم توبة» قاله الغزالي ، قلت : أي لأنه سببها ضرورة أنه لم يقصر لأن أحد الجزءين غير معرفة .ثم التعبير بتاب عليه هنا مشعر بأن أكل آدم من الشجرة خطيئة إثم غير أن الخطيئة يومئذ لم يكن مرتباً عليها جزاءُ عقاب أخروي ولا نقص في الدين ولكنها أوجبت تأديباً عاجلاً لأن الإنسان يومئذ في طور كطور الصبا فلذلك لم يكن ارتكابها بقادح في نبوءة آدم على أنها لا يظهر أن تعد من الكبائر بل قصارها أن تكون من الصغائر إذ ليس فيها معنى يؤذن بقلة اكتراث بالأمر ولا يترتب عليه فساد ، وفي عصمة الأنبياء من الصغائر خلاف بين أصحاب الأشعري وبين الماتريدي وهي في كتب الكلام ، على أن نبوءة آدم فيما يظهر كانت بعد النزول إلى الأرض فلم تكن له عصمة قبل ذلك إذ العصمة عند النبوءة .وعندي وبعضه مأخوذ من كلامهم أن ذلك العالم لم يكن عالم تكليف بالمعنى المتعارف عند أهل الشرائع بل عالم تربية فقط فتكون خطيئة آدم ومعصيته مخالفة تأديبية ولذلك كان الجزاء عليها جارياً على طريقة العقوبات التأديبية بالحرمان مما جره إلى المعصية ، فإطلاق المعصية والتوبة وظلم النفس على جميع ذلك هو بغير المعنى الشرعي المعروف بل هي معصية كبيرة وتوبة بمعنى الندم والرجوع إلى التزام حسن السلوك ، وتوبة الله عليه بمعنى الرضى لا بمعنى غفران الذنوب ، وظلم النفس بمعنى التسبب في حرمانها من لذات كثيرة بسبب لذة قليلة فهو قد خالف ما كان ينبغي أن لا يخالفه ويدل لذلك قوله بعد ذلك : { فإما يأتينكم مني هدى فمن تبع هداي إلى قوله خالدون } \\[ البقرة : 38 ، 39 \\] فإنه هو الذي بين به لهم أن المعصية بعد ذلك اليوم جزاؤها جهنم فأورد عليّ بعض الحذاق من طلبة الدرس أنه إذا لم يكن العالم عالم تكليف فكيف كفر إبليس باعتراضه وامتناعه من السجود؟ فأجبته بأن دلالة ألوهية الله تعالى في ذلك العالم حاصلة بالمشاهدة حصولاً أقوى من كل دلالة زيادة على دلالة العقل لأن إبليس شاهد بالحس الدلائل على تفرده تعالى بالألوهية والخلق والتصرف المطلق وبعلمه وحكمته واتصافه بصفات الكمال كما حصل العلم بمثله للملائكة فكان اعتراضه على فعله والتغليط إنكاراً لمقتضى تلك الصفات فكان مخالفة لدلائل الإيمان فكفر به . وأما الأمر والنهي والطاعة والمعصية وجزاء ذلك فلا يتلقى إلا بالإخبارات الشرعية وهي لم تحصل يومئذ وإنما حصلت بقوله تعالى لهم : { فمن تبع هداي } الآية فظهر الفرق .وقرأ الجمهور { آدم } بالرفع و { كلمات } بالنصب ، وقرأه ابن كثير بنصب ( آدم ) ورفع ( كلمات ) على تأويل ( تلقى ) بمعنى بلغته كلمات فيكون التلقي مجازاً عن البلوغ بعلاقة السببية .وقوله : { إنه هو التواب الرحيم } تذييل وتعليل للجملة السابقة وهي { فتاب عليه } لأنه يفيد مفادها مع زيادة التعميم والتذييل من الإطناب كما تقرر في علم المعاني . ومعنى المبالغة في التواب أنه الكثير القبول للتوبة أي لكثرة التائبين فهو مثال مبالغة من تاب المتعدي بعلى الذي هو بمعنى قبول التوبة إيذان بأن ذلك لا يخص تائباً دون آخر وهو تذييل لقوله : { فتلقى آدم من ربه } المؤذن بتقدير تاب آدم فتاب الله عليه على جعل التواب بمعنى الملهم لعباده الكثيرين أن يتوبوا فإن أمثلة المبالغة قد تجيء من غير التكاثر فالتواب هنا معناه الملهم التوبة وهو كناية عن قبول توبة التائب .وتعقيبه بالرحيم لأن الرحيم جار مجرى العلة للتواب إذ قبوله التوبة عن عباده ضرب من الرحمة بهم وإلا لكانت التوبة لا تقتضي إلا نفع التائب نفسه بعدم العود للذنب حتى تترتب عليه الآثام ، وأما الإثم المترتب فكان من العدل أن يتحقق عقابه لكن الرحمة سبقت العدل هنا بوعد من الله .\n\n",
      "translations": [
        {
          "translation": "(Then Adam received from his Lord) Adam learnt from his Lord, and it is said that he was taught and inspired with (words) so that they became a way for him and his progeny to repentance, (and He relented towards him), He forgave him. (Indeed! He is the Relenting), the One Who overlooks misdeeds, (the Merciful) towards any that dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَتَلَقَّىٰ ءَادَمُ مِن رَّبِّهِ كَلِمَٰتٍ } أي قَبِلَها\n والكَلماتُ: قَولُهُما رَبَّنا ظَلَمنا أَنفُسَنا، وإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمنَا، لَنكوننَّ من الخَاسِرينَ\n\n\n\n\nوقولهُ تعالى: { إِنَّهُ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ } والتَوابُ: المُعينُ للعبادِ على التّوبةِ، والتَّوابُ من العِبادِ: الرَّاجعُ عن ذَنبهِ، التَّاركُ لَهُ، والنَّادِمُ على مَا تَابَ مِنهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Then Adam received from his Lord [some] words\" - that is, before them.\n\n\nAnd the words: their Lord said, \"Ourselves have done injustice, and if you do not forgive us and have mercy on us, we will be among the losers.\"\n\nAnd His saying, {Indeed, He is the Accepting of repentance, the Merciful} and at-tawwab: the One Who encourages the slaves to repent, and at-tawwab from the slaves: the one who turns back from his sin, leaves it, and regrets what he has repented from.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فَتَابَ عليه } تقبّل رجوعه إليه بالتجرّد عن الملابس الطبيعية والانخراط في سلك الأنوار الملكوتية\n والاتصاف بالكمالات القدسية\n والتجلّي بالعلوم الحقيقية\n وأصل تاب عليه: ألقى الرجوع عليه وجعله راجعاً\n ولعمري إنها هي التوبة المقبولة لا الرجوع الناشئ من قبله\n { إنه هو التوابُ } الكثير القبول لتوبة عباده { الرحيم } الذي سبقت رحمته غضبه\n فيرحم عبده في حين غضبه\n كما جعل غضبه على آدم سبب كماله ورجوعه إليه وبعده ليتقرّب منه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أشفق عليه وتوجه نحوه وتطلف معه { فَتَلَقَّىٰ } استفاد { ءَادَمُ } المذنب العاصي { مِن رَّبِّهِ } المستخلف المستقبل عليه { كَلِمَٰتٍ } مشتملات على الرجوع والإنانية عما صدر عنه من زلة هي قوله:\n[الأعراف: 23] ولما تلقى آدم من ربه هذه الكلمات واستغفر بها\n ورجع عما صدر { فَتَابَ } الله { عَلَيْهِ } أي: قبل توبته ورحم عليه { إِنَّهُ هُوَ ٱلتَّوَّابُ } الرجاع للمذنبين المنهمكين في العصيان بالإنابة إليه عن ظهر الجنان { ٱلرَّحِيمُ } [البقرة: 37] لهم عما صدر عنهم من المعاصي والآثام بلا معاتبة ولا انتقام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَتَلَقَّى } أي أخذ { آدم من ربه كلمات } وهي:\n[الأعرَاف: 23 } \n { فتاب } الحق تعالى عليه واجتباه لحضرته\n فإنه توّاب كثير التوبة على عباده\n رحيم بهم\n أرحم من أبيهم وأمهم\n اللهم ارحمنا رحمة تعصمنا بها عن رؤية السّوي\n إنك على كل شيء قدير\n الإشارة: يقول الحقّ جلّ جلاله للروح\n إذا كمل تهذيبها\n وتمت تريبتُها: اسكن أنت وبشريتك التي تزوجتها - قال تعالى:\n[التّكوير: 7] - جنة المعارف\n وَكُلا من ثمار أذوابها وأنهار علومها\n وتبوَّءًا من قصور ترقياتها\n أكلاً واسعاً ما دمتما متحليين بالأدب\n ولا تقربا شجرة المعصية وسوء الأدب { فتكونا من الظالمين } \n فلما سكنت جنة الخلود\n وشَرهَتْ إلى الخلود\n أهبطها الله إلى أرض العبودية\n وردها إلى البقاء لتستحق الخلافة\n وتقوم بحقوق الربوبية\n بسبب ما ارتكبه من المعصية\n وهي الشَّرهُ إلى دوام الحرية\n \" أكْرِمْ بها معصيةً أورثت الخلافة! \" \n فكل ما ينزل بالروح إلى قهرية العبودية\n فهو سبب إلى الترقي لشهود نور الربوبية\n وربما قضي عليك بالذنب فكان سبب الوصول\n فلام أراد الحق تعالى أن ينزلها إلى أرض العبودية بالسلوك بعد الجذب\n قال لها ولمن يحاربها من الشيطان والهوى والدنيا وسائر الحظوظ: اهبطوا بعضكم لبعض عدو\n ولكم - أيها العارفون بعد جهاد أعدائكم - في أرض العبودية\n استقرار وتمتعٌ بتجليات أنوار الربوبية\n إلى حين الملاقاة الحقيقية\n فتلقت الروح من ربها كلمات الإنابة\n وهبَّ عليها\n نسيم الهداية\n بما سبق لها من عين العناية\n فتاب عليها\n وقرَّبها إلى حضرة الشهود\n ومعاينة طلعة الملك الودود\n إنه تواب رحيم جواد كريم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:31",
      "similarity": 0.4851292669064914
    },
    {
      "verse": "36:60",
      "similarity": 0.40823087518851064
    },
    {
      "verse": "5:27",
      "similarity": 0.3920283207869506
    },
    {
      "verse": "7:35",
      "similarity": 0.3667620782124728
    },
    {
      "verse": "3:59",
      "similarity": 0.35106061332217
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}