{
  "chapter": "البقرة",
  "text": "والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "But those who are kafir and deny Our Signs are the Companions of the Fire, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny and reject Our signs will belong to Hell, and there abide unchanged.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whoever will refuse to accept it and defy Our Revelations they shall be doomed to the Fire wherein they shall remain for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who would deny the Truth and reject Our revelations would be the companions of the Fire in which they would live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve and deny Our signs, are the people of fire (hell); they will remain in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) ـ such are the dwellers of the Fire. They shall abide therein forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who disbelieve in and reject My communications, they are the inmates of the fire, in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers who cry lies to Our signs, those shall be the inhabitants of the Fire, therein dwelling forever.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they who disbelieve, and deny Our revelations, such are rightful Peoples of the Fire. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who deny and reject Our signs shall be the inhabitants of the Fire; therein shall they abide forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve and belie Our signs, --they, shall be fellows of the Fire; therein they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are faithless and deny Our signs, they shall be the inmates of the Fire and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Faith and belie Our Signs, they shall be companions of the Fire; they shall abide therein.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) such are the dwellers of the Fire, they shall abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our verses shall be the companions of the Fire, and there they shall live for ever'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who disbelieve and reject Our signs—these are the inmates of the Fire—wherein they will remain forever.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve and deny Our signs - those will be companions of the Fire; they will abide therein eternally.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:39]   As for the disbelievers who deny Our signs, Our Books, those shall be the inhabitants of the Fire, abiding therein’, enduring perpetually, neither perishing nor exiting therefrom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { والذين كفروا وكذبوا بآياتنا } يحتمل أنه من جملة ما قيل لآدم فإكمال ذكره هنا استيعاب لأقسام ذرية آدم وفيه تعريض بالمشركين من ذرية آدم وهو يعم من كذب بالمعجزات كلها ومن جملتها القرآن ، عطف على ( مَن ) الشرطية في قوله : { فمن تبع هداي } إلخ فهو من عطف جملة اسمية على جملة اسمية ، وأتى بالجملة المعطوفة غير شرطية مع ما في الشرطية من قوة الربط والتنصيص على ترتب الجزاء على الشرط وعدم الانفكاك عنه لأن معنى الترتب والتسبب وعدم الانفكاك قد حصل بطرق أخرى فحصل معنى الشرط من مفهوم قوله : { فمن تبع هداي فلا خوف عليهم } فإنه بشارة يؤذن مفهومها بنذارة من لم يتبعه فهو خائف حزين فيترقب السامع ما يبين هذا الخوف والحزن فيحصل ذلك بقوله : { والذين كفروا وكذبوا } الآية . وأما معنى التسبب فقد حصل من تعليق الخبر على الموصول وصلته المومىء إلى وجه بناء الخبر وعلته على أحد التفسيرين في الإيماء إلى وجه بناء الخبر ، وأما عدم الانفكاك فقد اقتضاه الإخبار عنهم بأصحاب النار المقتضي للملازمة ثم التصريح بقوله : { هم فيها خالدون } .ويحتمل أنه تذييل ذيلت به قصة آدم لمناسبة ذكر المهتدين وليس من المقول له ، والمقصود من هذا التذييل تهديد المشركين والعود إلى عرض قوله تعالى : { يا أيها الناس اعبدوا ربكم } \\[ البقرة : 21 \\] وقوله : { كيف تكفرون بالله } \\[ البقرة : 28 \\] فتكون الواو في قوله : { والذين كفروا } اعتراضية والمراد بالذين كفروا الذين أنكروا الخالق وأنكروا أنبياءه وجحدوا عهده كما هو اصطلاح القرآن والمعنى والذين كفروا بي وبهداي كما دلت عليه المقابلة .والآيات جمع آية وهي الشيء الدال على أمر من شأنه أن يخفى ، ولذلك قيل لأعلام الطريق آيات لأنهم وضعوها للإرشاد إلى الطرق الخفية في الرمال ، وتسمى الحجة آية لأنها تظهر الحق الخفي ، كما قال الحارث بن حلزة :من لنا عنده من الخير آيا ... تٌ ثلاثٌ في كلهن القضاءيعني ثلاث حجج على نصحهم وحسن بلائهم في الحرب وعلى اتصالهم بالملك عمرو بن هند . وسمى الله الدلائل على وجوده وعلى وحدانيته وعلى إبطال عقيدة الشرك آيات ، فقال : { وماتأتيهم من آية من آيات ربهم إلا كانوا عنها معرضين } \\[ الأنعام : 4 \\] وقال : { وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر قد فصلنا الآيات لقوم يعلمون } \\[ الأنعام : 97 \\] إلى قوله : { إن في ذلكم لآيات لقوم يؤمنون } \\[ الأنعام : 99 \\] وقال : { وأقسموا بالله جهد أيمانهم لئن جاءتهم آية ليؤمنن بها } \\[ الأنعام : 109 \\] وسمي القرآن آية فقال : { وقالوا لولا أنزل عليه آيات من ربه قل إنما الآيات عند الله إلى قوله { أو لم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم } في سورة العنكبوت ( 50 ، 51 ) . وسمَّى أجزاءه آيات فقال : { وإذا تتلى عليهم آياتنا بينات تعرف في وجوه الذين كفروا المنكر يكادون يسطون بالذين يتلون عليهم آياتنا } \\[ الحج : 72 \\] وقال : { المر تلك آيات الكتاب والذي أنزل إليك من ربك الحق } \\[ الرعد : 1 \\] لأن كل سورة من القرآن يعجز البشر عن الإتيان بمثلها كما قال تعالى : { فأتوا بسورة من مثله } \\[ البقرة : 23 \\] ، فكان دالاً على صدق الرسول فيما جاء به وكانت جمله آيات لأن بها بعضَ المقدار المعجز ، ولم تسم أجزاء الكتب السماوية الأخرى آيات ، وأما ما ورد في حديث الرجم أن ابن صوريا حين نشر التوراة وضع يده على آية الرجم فذلك على تشبيه الجزء من التوراة بالجزء من القرآن وهو من تعبير راوي الحديث .وأصل الآية عند سيبويه فَعَلَة بالتحريك أَيَيَهْ أو أَوَيَهْ على الخلاف في أنها واوية أو يائية مشتقة من أي الاستفهامية أو من أوى فلما تحرك حرفَا العلة فيها قلب أحدهما وقُلب الأول تخفيفاً على غير قياس لأن قياس اجتماع حرفي علة صالحين للإعلال أن يعل ثانيهما إلا ما قل من نحو آيَة وقَاية وطَاية وثَاية ورَاية .فالمراد بآياتنا هنا آيات القرآن أي وكذبوا بالقرآن أي بأنه وحي من عند الله . والباء في قوله : { وكذبوا بآياتنا } باء يكثر دخولها على متعلق مادة التكذيب مع أن التكذيب متعد بنفسه ولم أقف في كلام أئمة اللغة على خصائص لحاقها بهذه المادة والصيغة فيحتمل أنها لتأكيد اللصوق للمبالغة في التكذيب فتكون كالباء في قوله تعالى : { وامسحوا برؤوسكم } \\[ المائدة : 6 \\] وقول النابغة :لك الخير أَنْ وارتْ بك الأرضُ واحدا ... ويحتمل أن أصلها للسببية وأن الأصل أن يُقال كذَّب فلاناً بخبره ثم كثر ذلك فصار كذب به وكذَب بمعنى واحد والأكثر أن يقال كذَّب فلاناً ، وكذب بالخبر الفلاني ، فقوله : { بآياتنا } يتنازعه فعلا كَفروا وكَذبوا . وقوله : { هم فيها خالدون } بيان لمضمون قوله : { أصحاب النار } فإن الصاحب هنا بمعنى الملازم ولذلك فصلت جملة { فيها خالدون } لتنزلها من الأولى منزلة البيان فبينهما كمال الاتصال .\n\n",
      "translations": [
        {
          "translation": "(But those who disbelieve, and deny our revelations), the scripture and the Emissary, (such are rightful owners of the Fire), the dwellers of hell. (They will abide therein forever), they will remain perpetually in hell: never to die or be released from it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والذينَ كَفَروا } أي: حجبوا عن الدين لكونه في مقابلة اتباع الهدى\n وإردافه بقوله: { وكَذبوا بِآياتِنا أُولئكَ أَصحابُ النارِ } أي: نار الحرمان { هم فيها خالدون * يا بَنِي إسرائيلَ اذكُروا نِعمتي التي أنعمتُ عليكم وأوفُوا بِعَهدي أُوفِ بعهدكم وإيايَ فارهبون } بنو إسرائيل هم أهل اللطف الإلهيّ\n وأرباب نعمة الهداية والنبوة\n دعاهم باللطف وتذكير النعمة السابقة\n والعهد السالف المأخوذ منهم في التوراة بتوحيد الأفعال بعد العهد الأزليّ كما هو عادة الأحباب عند الجفاء\n\nوهذه الدعوة مخصوصة بتوحيد الصفات الذي هو رفع الحجاب الثاني\n فهي أخص من الدعوة الأولى العامة لتذكير النعمة الدينية والعهد والتجلّي بصفة المنعم والوليّ\n والتهديد على عدم إجابتها بالرهبة التي هي أخصّ من الخوف\n فإن الخوف إنما يكون من العقاب\n والرهبة من السخط والقهر\n والإعراض والاحتجاب والخشية أخص منها لكونها مخصوصة باحتجاب الذات\n قال الله تعالى:\n[الرعد\n الآية: 21]\n وكذا الهيبة لأنها قرنت بعظمة الذات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ } لم يرتبقوا الرجوع\n ونسوا ما هم عليه في الجنة ولم يلتفتوا إلى الهدى المؤتى\n و { كَفَرواْ } به وأنكروا له { وَكَذَّبُواْ } رسلنا الذين أتوا إياهم { بِآيَٰتِنَآ } دلائلنا الدالة على صدقهم من المعجزات الظاهرة\n والآثار الباهرة { أُولَـٰئِكَ } الهابطون الناسون والموطن الأصلي والمقام الحقيقي\n المستبدلون عن الجنة بعرض هذا الأدنى\n والكافرون بطريق الحق\n والمكذبون بمن يهديهم { أَصْحَٰبُ ٱلنَّارِ } التي هي معدن البعد والخذلان\n ومنزل الطرد والحرمان { هُمْ } بسبب نسيانهم وتكذيبهم { فِيهَا خَٰلِدُونَ } [البقرة: 39] إلى ما شاء الله\n\n\nربنا لا تزغ قلوبنا بعد إذ هديتنا\n وهب لنا من لدنك رحمة\n إنك أنت الوهاب\n\n\nثم لما بين سبحانه وتعالى طريق الهداية والضلال\n ونبه على جزاء كل منهما إجمالاً\n أشار إلى تفصيله وتوضيحه من قصص القرون الماضية والأمم السالفة\n ليتيقن المؤمنين منها ومن جملتها قصة ندائه تعالى بني إسرائيل أولاد يعقوب إسرائيل الله\n مخاطباً لهم أمر تذكرهم بالنعم التي أنعمها عليهم\n ليكونوا من الشاكرين لنعمه\n الموفين بعهده بقوله:\n\n{ يَٰبَنِي إِسْرَائِيلَ } المتنعمين بالنعم الكثيرة { ٱذْكُرُواْ } واشكروا { نِعْمَتِيَ ٱلَّتِي أَنْعَمْتُ عَلَيْكُمْ } وعلى من استخفلكم من أسلافكم { وَأَوْفُواْ } بعد اعتدادكم النعم على أنفسكم { بِعَهْدِيۤ } الذي عاهدتم معي من متابعة الهدى النازل مني على لسان الأنبياء { أُوفِ بِعَهْدِكُمْ } من إرجاعهم إلى المقام الأصلي الذي أنتم فيه قبل هبوطكم إلى طار المحن\n وبعد رجوعكم إليه في النشأة الأخرى\n لا يبقى لكم خوف من الأغيار\n بل رهبة من سطوة سلطنتي { وَ } عند عروجها { إِيَّٰيَ } لا إلى غيري { فَٱرْهَبُونِ } [البقرة: 40] فارجعون\n لأوانس معكم وأزيل رهبتكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وعبر بإن دون { إذا } \n مع تحقق مجيء الهدى لأنه غير واجب عقلاً\n وجملة الشرط الثاني وجوابه\n الشرط الأول\n و { جميعاً } حال مؤكدة أي: اهبطوا أنتم أجمعون\n ولذلك لا يقتضي اجماعهم على الهبوط في زمان واحد\n ولما أمر الحقّ جلا جلاله آدم أولاً بالهبوط من الجنة\n جعل يبكي ويتضرّع ويقول: ألم تخلقني بيدك؟ ألم تسجد لي ملائكتك؟ ألم تدخلني جنتك؟ ثم ألهم الكلمات التي تلقاها من ربه\n فتاب عليه ورحمه\n فطمع آدم حين سمع من ربه قبول توبته في البقاء في الجنة\n فقال له الحقّ جلّ جلاله: يا آدم لا يجاورني من عصاني\n وقد سبقت كلمتي بهبوطك إلى الأرض لتكون خليفتي بذريتك\n فكرّر عليه الأمر بالهبوط ثانياً\n فقال: { اهبطوا منها جميعا } أنتما بما اشتملتما عليه من ذريتكما\n فمهما { يَأتِيَنَّكُم مِنِّي هُدىً } أي: بيان وإرشاد إلى توحيدي ومعرفتي\n على يد رسول أو نائب عنه\n { فَمَن تَبعَ } ذلك الإرشاد\n واهتدى إلى معرفتي وتوحيدي\n وعمل بطاعتي وتكاليفي\n { فَلا خَوْفٌ عَلَيْهِمْ } من لحُوق مكروه { وَلا هُمْ يَحْزَنُونَ } من فوات محبوب\n لأني أَصرف عنهم جميع المكاره\n وأجلب لهم المنافع\n { والذين كفروا وكذبوا بآياتنا } الدالّة على قدرتنا المنزلة على رسلنا\n\n[النِّساء: 173] عن النظر فيها\n أو عن الخضوع لمن جاء بها\n { أُوْلَئِكَ أصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ }\n الإشارة: إذا سكنت الأرواح في عُشِّ الحضرة\n وتمكنت من الشهود والنظرة\n أمرها الحق تعالى بالنزول إلى سماء الحقوق أو أرض الحظوظ\n فتنزل بالإذن والتمكين\n والرسوخ في اليقين\n لا لطلب جزاء أو لقضاء شهوة\n بل تنزل بالله ومن الله وإلى الله\n فمن نزل منها على هذا الهدى الحسن { فَلا خَوْفٌ عَلَيْهمْ وَلا هُمْ يَحْزَنُونَ } \n ومن ركب بحر التوحيد مع غير رئيس عارف\n ولم يأوِ إلى سفينة الشريعة\n واستكبر عن الخضوع إلى تكاليفها لعبت به الأمواج\n فكان من المغرقين\n { أولئك أصحاب النار هم فيها خالدون } لأن من تحقق ولم يتشرع فقد تزندق\n ومن تشرع ولم يتصوف فقد تفسق\n ومن جمع بينهما فقد تحقق\n جعلنا الله ممن تحقق بهما\n وسلك على مهاجهما إلى الممات\n آمين\n ولما ذكر الحق تعالى شرف كتابه\n ونفى وجد الريب عن ساحته\n ثم دعا إلى توحيده\n وبرهن على وجوده\n بابتداء خلق العالم من عرشه إلى فرشه\n وذكر كيفية ابتداء عمارته\n خاطب بني إسرائيل لأنهم أهل العلم بالأخبار المتقدمة\n وقد مسعوا هذه الأخبار نَبِي أُمِّي لم يُعْهَدْ بقراءةٍ ولا تعلم\n فقامت الحجة عليهم\n وتحققوا أنه من عند الله\n وما منعهم من الإسلام إلا الحسد وحب الرئاسة\n فلذلك أطال الحق الكلام معهم\n تارةً يُقرِّعَهم على عدم الإيمان وما فعلوا مع أنبيائهم\n وتارة يذكرهم النعم التي أنهم الله على أسلافهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:36",
      "similarity": 0.872558355492374
    },
    {
      "verse": "2:82",
      "similarity": 0.6359588016152192
    },
    {
      "verse": "64:10",
      "similarity": 0.6212687858091321
    },
    {
      "verse": "46:14",
      "similarity": 0.6029778566851798
    },
    {
      "verse": "2:257",
      "similarity": 0.5726851752981363
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}