{
  "chapter": "البقرة",
  "text": "واذ فرقنا بكم البحر فانجينكم واغرقنا ءال فرعون وانتم تنظرون",
  "translations": [
    {
      "translation": "And when We parted the sea for you and rescued you, and drowned the people of Pharaoh while you watched.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, We parted the sea and saved you, and drowned the men of Pharaoh before your very eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the time when We parted the sea to make way for you and let you pass safely through it and then drowned Pharaoh's people before your very eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We parted the sea to save you and drowned Pharaoh's people before your very eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We split the sea for you thereby rescuing you, and drowned the Firaun's people in front of your eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We separated the sea for you and saved you and drowned Fir`awn's (Pharaoh) people while you were watching.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We parted the sea for you, so We saved you and drowned the followers of Firon and you watched by.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We divided for you the sea and delivered you, and drowned Pharaoh's folk while you were beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We brought you through the sea and rescued you, and drowned the folk of Pharaoh in your sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when We divided the sea for you and saved you and drowned Pharaoh's people, while you looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We separated the sea for you and delivered you and drowned Fir'awn's house while ye looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We parted the sea with you, and We delivered you and drowned Pharaoh’s clan as you looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We divided the sea for you and saved you and drowned Pharaoh's people within your very sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We separated the sea for you and saved you and drowned Fir'aun's (Pharaoh) people while you were looking (at them, when the sea-water covered them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We parted the sea for you, and, taking you to safety, drowned the family of Pharaoh before your eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall that We parted the sea for you, so We saved you, and We drowned the people of Pharaoh as you looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We parted the sea for you and saved you and drowned the people of Pharaoh while you were looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:50] And, remember, when We divided, split in two, for you, on account of you, the sea, such that you were able to cross it and escape from your enemy; and We delivered you, from drowning, and drowned Pharaoh’s folk, his people with him, while you were beholding the sea crashing down on top of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the favour of saving them from drowning and the drowning of Pharaoh and his folk, saying (And when We brought you through) split (the sea and rescued you) from drowning,(and drowned the folk of Pharaoh) and his folk (in your sight) while you were looking at them, three days later.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { آلَ فِرْعَوْنَ } فآلُ: أَهلُ دِينهِ\n وآلُ الرّجلِ: قَومُهُ وعِتْرتُهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {the family of Pharaoh}, that the family: the people of his religion.\n\n\nAnd his family: his tribe and his kinsmen.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإذْ فرقنَا } بوجودكم { البَحرَ } أي البحر الأسود الزعاق الذي هو المادة الجسمانية لانفلاقها بوجودكم انفلاق الأرض من النبات { فأنْجَيناكُم } بالتجرّد منها { وأغْرَقنا آلَ فِرْعون } أي: القوى النفسانية فيها بملازمتها إياها وهلاكها بفسادها، { وأنْتم } تشاهدون ذلك\n وعلى هذا يمكن أن يؤوّل بنو إسرائيل في أوّل الخطاب بتلك القوى الروحانية والنِعْمة التي أنعم بها عليهم هي التهدي إلى قبول الأنوار الفائضة عليها من عالم الروح وتلقي المعارف والحكم، وإيفاؤهم بالعهد، وإبرازهم ما ركز فيها بحسب الاستعداد الأول من الأدلة التوحيدية والمعاني الكلية الكامنة فيها بالتصفية ومزاولة ما يختص بها من الأفعال، وإيفاؤه بعهدهم إفاضة النور الكماليّ عليها عند قيامها بحق النور الاستعدادي بالتصفية واستعمال ما عندهم من المعاني\n وإن كنتم رهبتم شيئاً فارهبوا احتجاب أنواري بزوال استعدادكم، وآمنوا أي: واقبلوا ما أفيض عليكم من الإشراقات النورية والسوانح الغيبية مصدّقاً لما في استعدادكم من النور الفطريّ، ولا تكوونوا في أوّل رتبة المحتجبين عن قبولها بالتوجه إلى الجهة السفلية ولا تستبدلوا بها لذات النفس ومقاصدها، ولا تخلطوا حق المعارف الروحية والأنوار القدسية بباطل المطالب الحسية والصفات النفسية، وتكتموا تلك الأنوار والمعارف بظهور هذه عليكم\n وأقيموا وأديموا التوجه إلى حضرة الروح وامتثال أمره، وآتوا زكاة معلوماتكم التي هي أموالكم بتصفحها وتركيبها لتحرزوا بها ثواب النتائج واللوازم، وأنفقوها على فقرائكم الذين بحضرتكم من القوى البدنية الطبيعية ليعيشوا بها، ويكتسبوا بها الأخلاق الفاضلة والملكات الجميلة، وعلموها أبناء جنسكم ليكملوا بها، واركعوا واخضعوا لقبول الأوامر العقلية والأنوار الروحية والأعمال القلبية\n\n\nأتأمرون الناس بالبرّ وتنسون أنفسكم؟ أتسوسون ما تحتكم من القوى بالعبادات الجميلة والآداب الحسنة والترقي إلى مقامكم والتأدب بآدابكم وتنسون أنفسكم في التأدّب بين يدي الله بآداب الروحانيين والتمرّن في المراقبة، والتنوّر بأنوار الروح في مقام المشاهدة والترقي إلى مقامه عند الفناء في الوحدة، وأنتم تتلون كتاب المعقولات النازلة من ربّ الروح بواسطة ملك العقل إلى نبيّ القلب\n أفلا تعقلون بالعقل المجرّد عن شوب الهوى والوهم؟ واستعينوا بالصبر على ما يظهر عليكم ويرد من سلطنة أنوار سلطان الروح وأحكامه وقهر تجليات العظموت والحضور مع الحق، وأن هذه الاستعانة لشاقّة إلا على الخاشعين، المرتاضين، المذعنين لانقياد أمر القلب والروح، المتيقنين بأنهم بحضرته وفي لقائه، وأنهم يرجعون إليه في قبول أنواره\n وتفضيلهم على العالمين هو شرفهم على جميع ما في الإنسان من القوى\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when We {divided} the sea {into two parts} in your presence, {the part of the sea} that is the black, murky, deep sea into which the earth {was plunged} was in your presence the earth's {submersion}. We {saved you} by {fleeing} from it, and We {drowned} Pharaoh's {forces} in it, that is, the human {powers} that were in it, by {serving} it and {destroying} it with its {corruption}.,\n\n{And you} are seeing that.\n\n\n{ } can be translated as \"Therefore, the children of Israel can interpret the first statement as referring to the spiritual and divine powers and blessings that have been bestowed upon them. These powers and blessings guide them to accept the surplus light from the world of the spirit, and to receive knowledge and wisdom.\",\n\nAnd their fulfillment of the covenant.,\n\nAnd to manifest to them that which they are most prepared for, according to the first evidence of the unity of God and the comprehensive meanings {contained} therein, with clarification and engagement in that which is specific to them of deeds.,\nAnd its complete light upon them at their performance of the right of the preparatory light with purification and using what they have of meanings.\n\n\nAnd if you are afraid of anything, then fear the light of My countenance, for the extinction of your preparation.,\n\nAnd believe in what is revealed to you, {wa-amano} {ayy}, from the {al-ishraqat} {an-nuriyyah} {wa-as-sawanih} {al-ghaybiyyah}, {musaddiqan} {lima} {fi-istidadakum} {min} {an-nur} {al-fitriyy}., Do not be in the first row of those who accept it by turning to the lower authority, nor should you replace it with self and its purposes.,\nDo not mix the spiritual truth and the divine light with the false claims and the human qualities.,\n\nAnd hide those lights and knowledge with the appearance of this upon you.\n\nAnd establish and maintain the direction towards the Divine Presence and compliance with His command., Give your zakat {alms} with the knowledge that it is your money that you are browsing and assembling to earn the rewards of the results and supplies.,\n\nAnd spend it on your needy readers who are with you, from the natural physical strength to live on it., And they acquire with it the noble character and beautiful virtues, And teach your children the {prayers} so that they can complete them.,\n\nAnd prostrate yourselves and submit to the orders of the intellect and the lights of the soul and the deeds of the heart.\n\nDo you order people to piety and forget yourselves, while you sew what is beneath you of the powers of beautiful worship and good manners and the elevation to your status and the etiquette of your etiquette, and you forget yourselves in the etiquette between the hands of God with the etiquette of the righteous and the practice of watching?,\n\nAnd the enlightenment of the soul with the Lights of the Spirit in the station of witnessing and the ascent to its station at the end of the unit.,\n\nAnd you recited the Book of the Rationalities, descending from the Lord of the Spirit, through the King of the Mind, to the Prophet of the Heart.\n\n\nDon't you understand with your mere intellect about the vicissitudes of love and imagination? And take refuge in patience for what appears to you and is returned from the dominion of lights, the sultan of the soul, and its decrees, and the power of the manifestations of majesty and presence with truth.,\n\nAnd this help is only for the humble.,\n\nThe Murtaddun,\n\nThe heart and soul {are not subject to the control of} the {ones who are} preoccupied {with material things}., The confident ones that He is with them and in His meeting with them.,\n\nAnd that they will return to Him in acceptance of His light.\n\n\nAnd their preference over the [other] nations is their honor over all that is in humanity from the [various] powers.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا { إِذْ فَرَقْنَا بِكُمُ } أي: وقت تفريقنا بالفرق الكبيرة { ٱلْبَحْرَ } المتصل في بعضه ليسهل عبوركم منه ونجاتكم منه، وبالجملة: { فَأَنجَيْنَٰكُمْ } فعبرناكم منه سالمين { وَأَغْرَقْنَا آلَ فِرْعَوْنَ } المقتحمين بالفور خلفكم باجتماع تلك الفرق واتصال البحر على ما هو عليه في نفسه { وَأَنْتُمْ } حينئذ { تَنظُرُونَ } [البقرة: 50] إلى الافتراق والاجتماع المتعاقبة، فكيف لا تذكرونها وتشكرونها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:66",
      "similarity": 0.4724996245544049
    },
    {
      "verse": "37:82",
      "similarity": 0.4724996245544049
    },
    {
      "verse": "10:73",
      "similarity": 0.4437933064516592
    },
    {
      "verse": "21:77",
      "similarity": 0.4263323480771804
    },
    {
      "verse": "7:64",
      "similarity": 0.41306828477565993
    }
  ]
}