{
  "chapter": "البقرة",
  "text": "واذ وعدنا موسى اربعين ليلة ثم اتخذتم العجل منۢ بعده وانتم ظلمون",
  "translations": [
    {
      "translation": "And when We allotted to Musa forty nights. Then you adopted the Calf when he had gone and you were wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet, remember, as We communed with Moses for forty nights you took the calf in his absence (and worshipped it), and you did wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to mind that when We invited Moses for a fixed term of forty nights and days, you took to calf worship in his absence. Though you had committed a wicked transgression,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We called Moses for an appointment of forty nights. You began to worship the calf in his absence, doing wrong to yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a commitment with Moosa (Moses) for forty nights – then behind him you started worshipping the calf, and you were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We appointed for Musa (Moses) forty nights, and (in his absence) you took the calf (for worship), and you were Zalimun (polytheists and wrongdoers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We appointed a time of forty nights with Musa, then you took the calf (for a god) after him and you were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We appointed with Moses forty nights then you took to yourselves the Calf after him and you were evildoers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We did appoint for Moses forty nights (of solitude), and then ye chose the calf, when he had gone from you, and were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed for Moses forty nights [on Mount Sinai], and in his absence you took to worshipping the calf, and thus became transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We treated with Musa forty nights, then ye betook the calf after him, and ye were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made an appointment with Moses for forty nights, you took up the Calf [for worship] in his absence, and you were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We appointed forty nights for Moses, and in his absence ye took the calf (for worship), and ye did grievous wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We appointed for Musa (Moses) forty nights, and (in his absence) you took the calf (for worship), and you were Zalimun (polytheists and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed for Moses forty nights, but in his absence you took the calf, thereby committing harm.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall that We appointed for Moses forty nights. Then you took to worshiping the calf after him, and you turned wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We made an appointment with Moses for forty nights. Then you took [for worship] the calf after him, while you were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:51] And when We appointed for (wā‘adnā or wa‘adnā) Moses forty nights, at the end of which We shall give him the Torah for you to implement, then you took to yourselves the calf, the one which the Samaritan fashioned for you as a god, after him, that is, after he departed for Our appointment, and you were evildoers, for taking it [in worship], because you directed your worship to the wrong place.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We appointed for Moses forty nights) by giving him the scripture, (and then you chose the calf), you worshipped the calf, (when he had gone from you) to the mountain, (and you were wrong-doers) harmful both to yourselves and others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ وَاعَدنا مُوسى } بعد فراغه من مقاومة آل فرعون وإهلاكهم { أربعينَ ليلةً } يخلص لنا فيها لترفع بها الغشاوات الطبيعية التي حجبت قلبه عن معدن النور في الأربعين التي خلق فيها بدنه عند تكوّنه جنيناً واحتجابه بالنشأة عن الفطرة كما ورد في الحديث\n \" خمر طينة آدم بيده أربعين صباحاً \" \nوعن وجه قلبه\n وتظهر حكمة التوراة من قلبه على لسانه { ثم اتخذتم } عجل النفس الحيوانية الناقصة إلهاً من بعد اعتزاله وغيبته عنكم { وأنتم ظَالِمُون } واضعون العبادة في غير موضعها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإغراقهم بالمرة وإيراثنا لكم أرضهم وديارهم وأموالهم اذكروا { إِذْ وَٰعَدْنَا مُوسَىٰ } المتبحر في ضبط المملكة في أول الاستيلاء بأمر\n قلنا له: إن أخلصت التوجه والرجوع والميل إلينا مدة { أَرْبَعِينَ لَيْلَةً } متوالية متتالية - خصصها لخلوها عن الشواغل المانعة من الإخلاص - أنزلنا عليكم كتاباً جامعاً لمرتبتي الإيمان والعمل\n حاوياً على جميع التدابير والحكم الظاهرة والباطنة { ثُمَّ } لم اشتغل موسى بإنجاز الوعد\n وإيفاء العهد فذهب إلى الميقات { ٱتَّخَذْتُمُ ٱلْعِجْلَ } الذي صوغتم بيدكم من حليكم بتعليم السامري\n بسبب الخوار الذي ظهر منه ابتلاء لكم وفتنة إلهاً من دون الله\n بل حصرتم الإلهية له بقولكم: هذا إلهكم وإله موسى\n فأخلفتم الوعد { مِن بَعْدِهِ } أي: من بعد ذهاب موسى إلى الميقات\n وقيل رجوعه منه { وَأَنْتُمْ } بسبب خلف الوعد والا تخاذ المذكور { ظَٰلِمُونَ } [البقرة: 51] خارجون عن الإيمان والتوحيد\n والعياذ بالله من ذلك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أربعين }: مفعول لواعدنا\n لا ظرف\n و { العجل }: مفعول أول\n والثاني محذوف\n أي: اتخذتموه إليهاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:92",
      "similarity": 0.5360464671825118
    },
    {
      "verse": "24:13",
      "similarity": 0.4838208680897847
    },
    {
      "verse": "20:83",
      "similarity": 0.3929868074065604
    },
    {
      "verse": "2:54",
      "similarity": 0.33984295243839435
    },
    {
      "verse": "26:204",
      "similarity": 0.31034787364570904
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}