{
  "chapter": "البقرة",
  "text": "واذ قلتم يموسى لن نؤمن لك حتى نرى الله جهرة فاخذتكم الصعقة وانتم تنظرون",
  "translations": [
    {
      "translation": "And when you said, 'Musa, we will not believe in you until we see Allah with our own eyes.' So the thunder-bolt struck you dead while you were looking.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, when you said to Moses: \"We shall not believe in you until we see God face to face,\" lightning struck you as you looked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you said, \"O Moses, we are not going to believe you until we see with our own eyes Allah (talking to you)\". At that very time a thunderbolt struck you while you were looking on and you fell lifeless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you argued with Moses, saying that you were not going to believe him unless you could see God with your own eyes, the swift wind struck you and you could do nothing but watch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said “O Moosa! We will not believe you till we clearly see Allah”; so the thunder seized you while you were watching.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you said: \"O Musa! We shall never believe in you until we see Allah plainly.\" But you were seized with a bolt of lightning while you were looking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said: O Musa! we will not believe in you until we see Allah manifestly, so the punishment overtook you while you looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said, 'Moses, we will not believe thee till we see God openly'; and the thunderbolt took you while you were beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye said: O Moses! We will not believe in thee till we see Allah plainly; and even while ye gazed the lightning seized you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you said, \"Moses, we will not believe in you until we see God with our own eyes,\" a thunderbolt struck you while you were looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time ye said: O Musa! we will not believe in thee until we see God openly; then a thunderbolt took hold of you while ye looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said, ‘O Moses, we will not believe you until we see Allah visibly.’ Thereupon a thunderbolt seized you as you looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember ye said: \"O Moses! We shall never believe in thee until we see Allah manifestly,\" but ye were dazed with thunder and lighting even as ye looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you said: \"O Musa (Moses)! We shall never believe in you till we see Allah plainly.\" But you were seized with a thunderbolt (lightning) while you were looking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said to Moses: 'We will not believe in you until we see Allah openly' a thunderbolt struck you whilst you were looking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall that you said, “O Moses, we will not believe in you unless we see God plainly.” Thereupon the thunderbolt struck you, as you looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when you said, \"O Moses, we will never believe you until we see Allah outright\"; so the thunderbolt took you while you were looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:55] And when you said, having gone out with Moses to apologise before God for your worship of the calf, and having heard what he had said [to you]; ‘O Moses, we will not believe you till we see God openly’, with our own eyes; and the thunderbolt, the shout, took you, and you died, while you were beholding, what was happening to you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when you said: Moses! We will not believe in you) in what you say (till we see Allah plainly) until we see Him plainly as you did; (and even while you gazed the lightning seized you) the Fire burnt you while you were looking at it. 10\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَأَخَذَتْكُمُ ٱلصَّاعِقَةُ } معناهُ الموتُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then the lightning seized you,\" means death.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذْ قلتم يا موسى لنْ نُؤمِنَ } لأجل هدايتك الإيمان الحقيقي حتى تصل إلى مقام المشاهدة والعيان { فأخَذَتكم } صاعقة الموت الذي هو الفناء في التجلي الذاتي { وأنْتُم } تراقبون أو تشاهدون\n { ثم بعثناكم } بالحياة الحقيقية والبقاء بعد الفناء لكي تشكروا نعمة التوحيد والوصول بالسلوك في الله { وظَللنَا عليكمُ } غمام تجلي الصفات لكونها حجب شمس الذات المحرقة بالكلية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا أيضاً { إِذْ قُلْتُمْ } لموسى عند دعوتكم إلى الإيمان والهداية: { يَٰمُوسَىٰ } المدعي للرسالة\n الداعي إلى الله بمجرد الإخبار { لَن نُّؤْمِنَ لَكَ } ولما جئت به من عند ربك { حَتَّىٰ نَرَى ٱللَّهَ } المرسل { جَهْرَةً } ظاهراً من غير حجاب كما يرى بعضنا بعضاً { فَأَخَذَتْكُمُ ٱلصَّٰعِقَةُ } النازلة من عين قهرنا وغضنا لإنكاركم ظهورنا الذي هو أظهر من الشمس\n بل الشمس إنما هي لمعة من لمعات ذاتنا { وَأَنْتُمْ } حين ترونها { تَنظُرُونَ } [البقرة: 55] متحيرين والهين بلا تدبير وتصرف\n إلى أن صرتم فانين مقهورين تحت قهرنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { جهرة } مصدر نرى لأنه نوع منه\n أي: نرى الله رؤية عيان\n أو حال من الفاعل\n أي: نراه معاينين له\n أو من المفعول أي: نراه معاينة\n يقول الحقّ جلّ جلاله: واذكروا أيضاً\n يا بني إسرائيل\n حين قلتم لموسى عليه السلام لما رجع من الطور\n ووجدكم قد عبدتم العجل\n فأخذ منكم سبعين رجلاً ممن لم يعبد العجل\n وذهب يعتذر\n فلما سمعتم كلامي أنكرتموه وحرفتموه\n وقلتم: { لَن نُؤْمِنَ لَكَ } أن هذا كلام الله { حَتَّى نَرَى اللّهَ جَهْرَةً فَأَخَذَتْكُمُ الصَّاعِقَةِ } بسبب طلبكم ما لا طاقة لكم به\n فغبتم عن إحساسكم\n وذهبت أرواحكم\n { وَأَنتُمْ تَنظُرُونَ } ما فعل بكم\n فاستشفع فيكم موسى عليه السلام وقال: يا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:153",
      "similarity": 0.6759618997496067
    },
    {
      "verse": "52:45",
      "similarity": 0.5982504241654155
    },
    {
      "verse": "51:44",
      "similarity": 0.5046956170136833
    },
    {
      "verse": "41:13",
      "similarity": 0.4990656403147573
    },
    {
      "verse": "39:68",
      "similarity": 0.47471845624237247
    }
  ]
}