{
  "chapter": "البقرة",
  "text": "ان الذين كفروا۟ سواء عليهم ءانذرتهم ام لم تنذرهم لا يؤمنون",
  "translations": [
    {
      "translation": "As for those who are kafir, it makes no difference to them whether you warn them or do not warn them, they will not have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny, it is all the same if you warn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have rejected (these things), it is all the same to them whether you warn them or do not warn them: they are not going to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny your message will not believe whether you warn them or not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whose fate is disbelief, whether you warn them or do not warn them – it is all one for them; they will not believe. (Because their hearts are sealed – see next verse).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, it is the same to them whether you warn them or do not warn them, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve, it being alike to them whether you warn them, or do not warn them, will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, alike it is to them whether thou hast warned them or hast not warned them, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Disbelievers, Whether thou warn them or thou warn them not it is all one for them; they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who are bent on denying the truth, it makes no difference to them whether you warn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who have disbelieved, it is equal to them whether thou warnest them or warnest them not; they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, it is the same to them whether you warn them or do not warn them, they will not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who reject Faith, it is the same to them whether thou warn them or do not warn them; they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, it is the same to them whether you (O Muhammad Peace be upon him) warn them or do not warn them, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, whether you forewarn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve—it is the same for them, whether you have warned them, or have not warned them—they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve - it is all the same for them whether you warn them or do not warn them - they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:6] As for the disbelievers, the likes of Abū Jahl, Abū Lahab and such; alike it is for them whether you have warned them or have not warned them, they do not believe, as God knows very well, so do not hope that they will believe (read a-andhartahum pronouncing both hamzas, or by not pronouncing the second, making it an alif instead, and inserting an alif between the one not pronounced and the other one, or leaving [this insertion]; al-indhār [‘warning’] is to give knowledge of something, and simultaneously instil an element of fear).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for the disbelievers) who remain firm in their disbelief, (whether thou warn them), instil fear into them by means of the Qur'an, (or thou warm them not) or you do not instil fear into them, (it is all one for them; they believe not), they do not want to believe. It is also said that they will not believe as it is in Allah's knowledge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الذين كفروا } - إلى قوله - { عظيم } هم الفريق الأول من الأشقياء الذين هم أهل القهر الإلهي لا ينجح فيهم الإنذار ولا سبيل إلى خلاصهم من النار\n أولئك حقّت عليهم كلمة ربّك أنهم لا يؤمنون\n وكذلك حقّت كلمة ربك على الذين كفروا أنهم أصحاب النار\n سدّت عليهم الطرق\n وأغلقت عليهم الأبواب\n إذ القلب هو المشعر الإلهيّ الذي هو محلّ الإلهام\n فحجبوا عنه بختمه\n والسمع والبصر هما المشعران الأنسيان\n أي الظاهران اللذان هما بابا الفهم والاعتبار\n فحرموا عن جدواهما لامتناع نفوذ المعنى فيهما إلى القلب\n فلا سبيل لهم في الباطن إلى العلم الذوقيّ الكشفيّ ولا في الظاهر إلى العلم التعلميّ والكسبيّ\n فحبسوا في سجون الظلمات\n فما أعظم عذابهم\n  { ومن الناس من يقول آمنا } هم الفريق الثاني من الأشقياء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه جرياً\n بل على مقتضى سنته من تعقيب الوعد بالوعيد: { إِنَّ ٱلَّذِينَ كَفَرُواْ } ستروا الحق وأعرضوا عنه\n وأظهروا الباطل وأصروا عليه عناداً واستكباراً\n لا ينفعهم إنذارك وعدمه بل { سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لاَ يُؤْمِنُونَ } [البقرة: 6] بك وبكتابك\n لأنهم هم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { سواء } خبر مقدم\n و { أنذرتهم } مبتدأ لسبك همزة التسوية\n أي: الإنذار وعدمه سواء في حق هؤلاء الكفرة\n والجملة خبر إن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:10",
      "similarity": 0.9530634975642286
    },
    {
      "verse": "63:6",
      "similarity": 0.5128033624309775
    },
    {
      "verse": "26:136",
      "similarity": 0.4777433311353938
    },
    {
      "verse": "87:2",
      "similarity": 0.4486717927707178
    },
    {
      "verse": "91:7",
      "similarity": 0.43166614507333567
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}