{
  "chapter": "البقرة",
  "text": "ولقد علمتم الذين اعتدوا۟ منكم فى السبت فقلنا لهم كونوا۟ قردة خسـين",
  "translations": [
    {
      "translation": "You are well aware of those of you who broke the Sabbath. We said to them, 'Be apes, despised, cast out.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You know and have known already those among you who had broken the sanctity of the Sabbath, and to whom We had said: \"Become (like) apes despised,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you know well the story of those among you who broke Sabbath. We said to them, \"Be apes despised and hated by all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You certainly knew about those among you who were transgressors on the Sabbath. We commanded them, \"Become detested apes,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you certainly know of those amongst you who transgressed in the matter of Sabth (Sabbath – Saturday) – We therefore said to them, “Become apes, despised!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed you knew those amongst you who transgressed in the matter of the Sabbath (i.e. Saturday). We said to them: \"Be you monkeys, despised and rejected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly you have known those among you who exceeded the limits of the Sabbath, so We said to them: Be (as) apes, despised and hated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And well you know there were those among you that transgressed the Sabbath, and We said to them, 'Be you apes, miserably slinking!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye know of those of you who broke the Sabbath, how We said unto them: Be ye apes, despised and hated!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are aware of those who transgressed in the matter of the Sabbath, whereupon We said to them, \"Be as apes, despised!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly ye know of those of you who trespassed in the matter of the Sabbath, wherefore We said unto them: be ye apes despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly you know those of you who violated the Sabbath, whereupon We said to them, ‘Be you spurned apes.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And well ye knew those amongst you who transgressed in the matter of the Sabbath: We said to them: \"Be ye apes, despised and rejected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed you knew those amongst you who transgressed in the matter of the Sabbath (i.e. Saturday). We said to them: \"Be you monkeys, despised and rejected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have surely known of those amongst you who transgressed the Sabbath. We said to them: 'Be apes, despised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you surely knew those of you who violated the Sabbath. We said to them, “Be despicable apes!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you had already known about those who transgressed among you concerning the sabbath, and We said to them, \"Be apes, despised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:65] And verily (wa-la-qad: the lām is for oaths) you know that there were those among you who transgressed, violated, the Sabbath, by fishing, when We had forbidden you to do so — these were the inhabitants of Eilat — and We said to them, ‘Be apes, despised!’, rejected, and they became so: they died three days later.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ye know) you indeed know and heard about the punishment (of those of you who broke) who have taken the covenant (the Sabbath) the day of Saturday and this at the time of David (pbuh) (how We said unto them: Be ye apes, despised and hated!) turned into humiliated and base apes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَقُلْنَا لَهُمْ كُونُواْ قِرَدَةً خَاسِئِينَ } معناهُ كونوا قِردةً باعدينَ من الخيرِ\n ويقالُ: قد خسَأتُهُ عني أَي قد بَاعدْتُهُ عني وصَغَّرتُهُ\n\n",
      "translations": [
        {
          "translation": " And His saying, {So become monkeys, despised} [means] to be monkeys far from good.\n It is said: \"I have lost him\" or \"I have removed him from me\" or \"I have made him small.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولقَد علِمْتم الذين اعتدوا } اعلم: أن الناس لو أهملوا وتركوا وخلّي بينهم وبين طباعهم لتوغلوا وانهمكوا في اللذات الجسمانية، والغواشي الظلمانية لضراوتهم بها واعتيادهم من الطفولية والصبا حتى زالت استعداداتهم وانحطوا عن رتبة الإنسانية، فمسخوا كما قال تعالى:\n\n[المائدة: 60]، وإن حفظوا وروّعوا بالسياسات الشرعية والعقلية والحكم والآداب والمواعظ الوعدية والوعيدية ترقوا وتنوّروا، كما قال الشاعر:\n\nفلهذا وضعت العبادات، وفرض عليهم تكرارها في الأوقات المعينة لتزول عنهم بها درن الطباع المتراكم في أوقات الغفلات وظلمة الشواغل العارضة في أزمنة اتخاذ اللذات، وارتكاب الشهوات\n فتتنوّر بواطنهم بنور الحضور، وتنتعش قلوبهم بالتوجه إلى الحق عن السقوط في هاوية النفس والعثور، وتستريح بروح الروح، وحبّ الوحدة عن وحشة الهوى، وتعلق الكثرة، كما قال عليه السلام:\n\n \" الصلاة بعد الصلاة كفارة ما بينهما من الصغائر إذا اجتنبت الكبائر \" \n\nألا ترى كيف أمرهم عند الحدث الأكبر ومباشرة الشهوة بتطهير الغسل، وعند الأصغر بالوضوء، وعند الاشتغال بالأشغال الدنيوية في ساعات اليوم والليل بالصلوات الخمس المزيلة لكدورات الحواس الخمس الحاصلة في النفس بسببها، كل بما يناسبه، فلذلك وضعوا بإزاء وحشة تفرقة الأسبوع وظلمة انفرادهم بدؤوب الأشغال والمكاسب، والملابس البدنية، والملاذ النفسانية، اجتماع يوم واحد على العبادة والتوجه لتزول وحشة التفرقة بأنس الاجتماع وتحصل بينهم المحبة والأنس وتزول ظلمة الاشتغال بالأمور الدنيوية والإعراض عن الحق بنور العبادة والتوجه، ويحصل لهم التنوّر فوضع لليهود أول أيام الأسابيع لكونهم أهل المبدأ والظاهر، وللنصارى بعده لأنهم أهل المعاد والروحاني والباطن المتأخرين عن المبدأ والظاهر بالنسبة إلينا، وللمسلمين آخرها الذي هو يوم الجمعة لكونهم في آخر الزمان أهل النبوّة الخاتمة وأهل الوحدة الجامعة للكل، وإن جعل السبت آخر الأيام - على ما نقل أنه السابع - فبالنسبة إلى الحقّ تعالى لأن عالم الحسّ الذي إليه دعوة اليهود هو آخر العوالم، وعالم العقل الذي إليه دعوة النصارى أوّلها، والجمعة هي يوم الجمع والختم، فمن لم يراع هذه الأوضاع والمراقبات أصلاً زال نور استعداده، فمسخ كما مسخت أصحاب السبت\n نهوا عن الصيد، أي: إحراز الحظوظ النفسانية واقتنائها في يوم السبت، فاحتالوا فيه فاتخذوا حياضاً على ساحل البحر ليحبسوا فيها الحيتان ويصطادوها يوم الأحد\n أي: ادخروا في سائر أيام الأسبوع من ماء بحر الهيولى الجرمية والجرمانيات المادية في حياض بيوتهم فجمعوا بها أنواع المطاعم والمشارب والملاذ والملاهي، فاجتمع لهم كل الحظوظ النفسانية في يوم السبت ما اكتفوا به سائر أيام الأسبوع ليفرغوا فيها إلى الاشتغال بالمكاسب والصناعات والمهن، كحما هو عادة اليهود اليوم وشطار المسلمين في الجماعات فإن أكثر فسقهم فيها، فذلك اعتيادهم في السبت وهو يدل على أنّ جميع أوقات حضورهم مصروفة في هموم الدنيا وطلب حظوظ النفس والهوى\n\n\nكما ترى اليوم واحداً من المسلمين قالبه في المسجد في الصلاة وقلبه في السوق في المعاملة، حتى قال أحدهم: جريدة حسابي هي الصلاة\n أي: إذا فرغت من أشغال الدنيا إلى الصلاة أخذ قلبي في تصفح تجاراتي وما لي على الناس وما للناس عليّ، وذلك موجب للانحطاط عن العالم العلويّ الإنساني إلى الأفق السفليّ الحيواني\n وهو معنى قوله:  { فقلنا لهُم كونوا قردة } أي: مشابهين الناس في الصورة وليسوا بهم { خَاسِئينَ } بعيدين، طريدين\n والمسخ بالحقيقة حق غير منكر في الدنيا والآخرة، ووردت به الآيات والأحاديث كقوله تعالى:\n\n[المائدة، الآية: 60]، وقول رسول الله صلى الله عليه وسلم:\n\n \" يحشر بعض الناس على صور يحسن عندها القردة والخنازير \" \n\nوقد روي عنه عليه الصلاة والسلام:\n\n \" المسوخ ثلاثة عشر \" \n\n، ثم عدّهم وبيّن أعمالهم ومعاصيهم وموجبات مسخهم\n والحاصل أنّ من غلب عليه وصف من أوصاف الحيوانات ورسخ فيه بحيث أزال استعداده وتمكن في طباعه وصار صورة ذاتية له كالماء الذي منبعه معدن الكبريت مثلاً صار طباعه طباع ذلك الحيوان ونفسه نفسه، فاتصلت روحه عند المفارقة ببدن يناسب صفته فصارت صفته صورته والله أعلم بذلك\n\n",
      "translations": [
        {
          "translation": " {And you have certainly known those who have committed excesses} [i.e., the disbelievers]. Know that if the people had left [the worship of] Allaah and His Messenger, and did not make things difficult between themselves and their own desires, they would have been swallowed up [by their desires], and they would have perished in [the indulgence of] their physical appetites.,\n\nAnd the dark-skinned people {of the world} are oppressed by them and have been since childhood, so that their readiness and ability to be human has been lost.,\n\nThey corrupted as Allah said:\n\n\n{The table: 60}, And if they preserve and act with the lawful, reasonable, and prudent policies, customs, and admonitions that are promised and expected, they will rise and be enlightened.,\n\nAs the poet said:\n\n\nSo the worship rites were established.,\nAnd it is incumbent upon them to repeat it at specific times so that the sleepiness and darkness of the heedless moments in the times of indulgence will go away from them.,\n\nThe indulgence of lusts.\n Their citizens were enlightened by the light of presence., And their hearts are revived by turning to the truth from the fall into the abyss of the self and finding, {And you shall take} the {breath of the soul} {in rest},\n\nAnd the love of unity is better than the love of passion., The frequency is attached., As he said (PBUH):\n\nThe prayer after the prayer is the expiation of the minor sins between them, if the major sins are avoided.\n\nDo you not see how they are when the greatest event occurs and they are directly ordered to perform the washing?,\n\nAnd when the younger one is in the light {of the sun},,\n\nAnd when occupied with worldly affairs during the day and night, the five prayers are to be observed at their proper times, due to the five senses being occupied with them.,\n\nEverything that is suitable, So they set aside a {wilderness} {parting} of the week and a darkness of their own {indulgence} with the {moderation} of their {occupations} and {gains}.,\n\nAnd the clothing of the body,\n\nAnd the human soul,\n\nA one-day gathering for worship and unity will dispel the animosity and misunderstanding between people, and replace it with love and understanding. It will also dispel the darkness of preoccupation with worldly affairs and resentment towards the rights of others with the light of worship and unity.,\nAnd they {will} achieve enlightenment {as} the Jews {are} given the first days of the week {because} they {are} the people of {the} origin and {the} apparent.,\n\nThe Christians are after us because they are the people of the Hereafter and the Spiritual and the Hidden, who are behind the Principle and the Manifest to us.,\n\nAnd for Muslims, the last day is Friday, because they are the people of the final prophecy and the people of the unified community of all.,\n\nAnd if the Sabbath is the last day of the week - as is the case according to the Jews - then in terms of the truth, it is the last day of the world.,\n\nThe world of the intellect is the first place to which the Christian invitation extends.,\n\nFriday is the day of gathering and finishing.,\n\n{If someone} does not take care of {these} affairs and {conditions} {properly}, {they} will never {be able to} {prepare} {properly}.,\n\nAs you have wiped out the people of Saturday, so you shall be wiped out.\n\n\nThe hunting season is over.,\n\n{ } refers to the human soul, and taking it in on Saturday.,\n\nThey set up a camp on the beach to catch fish and crabs on Sundays.\n Enter in all the days of the week from the water of the Hiyuli sea and the Germaanyat material in their homes and gather with them the types of restaurants and bars and nightclubs,\n\nAll the human {blessings} come together on Saturday, what they {settle for} the rest of the week, in order to {engage in} their {pursuits} and {trades} on that day.,\n\nThe Jews today are commonly considered unclean by Muslims, and their presence in Muslim communities is often seen as disruptive. The more religious Jews are seen as particularly unclean.,\n\nThis is their habit on Saturdays, which indicates that all their time is wasted on worldly affairs and the pursuit of self-interest and pleasure.\n\n\nAs you can see today, one Muslim has his body in the mosque during prayer and his heart in the market during business.,\n\nOne of them said, \"My account is the prayer.\"\n If I am free from the world's affairs to the prayer, I take my heart to browse my trade and what I have on people and what people have on me.,\n\nAnd that leads to the decline of the human world and the ascent of the animal world.\n\n\nAnd the meaning of his saying: {Be you as apes} that is, resembling people in appearance and not being {wicked} far from them.,\n{We are} twin sisters.\n\n\nAnd the destruction of truth is not an unacceptable thing in this world or the next.,\n\nI came to the verses and the ahadith as the saying of Allah, the Exalted:\n\n\nThe table,\n\n{O you who have believed, take not those who have taken your religion in mockery and amusement among the those who were given the Scripture before you, nor the disbelievers as allies. Fear Allah, if you should indeed be believers.},\n\nAnd the Prophet Muhammad (peace and blessings be upon him) said:\n Some people are gathered in pictures that monkeys and rabbits look good in.\n\n\nIt is narrated that the Prophet (peace and blessings be upon him) said:\n\n\n\"The one who voids the contract is liable for damages.\"\n\n\n\"And {indeed} We have made the Qur'an easy to remember, but is there anyone who will remember?\"\n\nAnd indeed, We have made the Qur'an easy to remember, but is there anyone who will remember?,\n\nThen {he} will judge them and clarify their deeds and their transgressions and the things that caused their corruption.\n The result is that {most of} those who {prevailed over him} {described him with} {attributes of animals} and {stuck in him} {to the point that} {they removed} {his readiness} and {became possible in his impression}, {and became a self-image for him} {like water} {whose source is} {the metal sulfur}, {for example, his impression became the impression} {of that animal} {and himself, himself}.,\n So his soul became his {form and attributes} when it parted from his body, and God is Knowing of that.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تكونون من الخاسرين الناقضين للعهود، وأنتم قوم شأنكم هذا { وَ } الله { لَقَدْ عَلِمْتُمُ } وخفظتم قصة { مِنْكُمْ فِي } تجاوزوا عن العهد { ٱلَّذِينَ ٱعْتَدَواْ } زمن داود عليه السلام واصطياد يوم { ٱلسَّبْتِ } ذلك أنهم سكنوا على شاطئ البحر بقرية، يقال لها: أيلة، وكان معاشهم من صيد البحر فأرسل الله عليهم داود عليه السلام، فدعاهم فآمنوا له، وعهد الله معهم على لسان داود بألاَّ يصطادوا في يوم السبت، بل تعينوها وتخصصوها للتوجه والتعبد، فقبلوا العهد وكانت حيتان البحر بعد العهد يحضرون في يوم السبت على شاطئ البحر ويخرجن خراطيمهن من الماء، ولما مضى عليها زمان احتالوا لصيدها بأن حفروا حياضاً وأخاديد على شاطئ البحر وأحدثوا جداول منه إليها، فلما كان يوم السبت يفتحون الجداول ويرسلون الماء في الحياض واجتمعت الحيتان فيها، وفي يوم الأحدا يصطادونها منها، ونقضوا عهد الله بهذه الحيلة، قال الله تعالى: لما أمهلناهم زماناً ظنوا أنهم خادعوا ثم انتقمنا منهم { فَقُلْنَا لَهُمْ } إذا أفسدتم لوازم الإنسانية؛ أي: العهود والتكاليف أفسدنا أيضاً إنسانيتكم { كُونُواْ } صيروا في الساعة { قِرَدَةً خَاسِئِينَ } [البقرة: 65] مهانين مبتذلين، فسمخوا عن لوازم الإنسانية من العلم والإرادة والمعرفة والإيمان، ولحقوا بالبهائم بل صاروا أسوأ حالاً منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:166",
      "similarity": 0.7965801058941439
    },
    {
      "verse": "23:108",
      "similarity": 0.49722139586347436
    },
    {
      "verse": "5:60",
      "similarity": 0.4422883344872583
    },
    {
      "verse": "67:4",
      "similarity": 0.39305448598668985
    },
    {
      "verse": "16:124",
      "similarity": 0.3181523356901501
    }
  ]
}