{
  "chapter": "البقرة",
  "text": "ختم الله على قلوبهم وعلى سمعهم وعلى ابصرهم غشوة ولهم عذاب عظيم",
  "translations": [
    {
      "translation": "Allah has sealed up their hearts and hearing and over their eyes is a blindfold. They will have a terrible punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sealed their hearts and ears, and veiled their eyes. For them is great deprivation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sealed up their hearts and ears and a covering has fallen over their eyes, and they have incurred the severest punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sealed their hearts and hearing and their vision is veiled; a great punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sealed their hearts and their ears, and on their eyes is a covering; and for them is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal on their hearts and on their hearing, and on their eyes there is a covering. Theirs will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal upon their hearts and upon their hearing and there is a covering over their eyes, and there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has set a seal on their hearts and on their hearing, and on their eyes is a covering, and there awaits them a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath sealed their hearing and their hearts, and on their eyes there is a covering. Theirs will be an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sealed their hearts and their ears, and over their eyes there is a covering. They will have a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath set a seal upon their hearts and upon their hearing, and over their sights is a covering; and unto them shall be a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal on their hearts and their hearing, and there is a blindfold on their sight, and there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath set a seal on their hearts and on their hearing, and on their eyes is a veil; great is the penalty they (incur).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal on their hearts and on their hearings, (i.e. they are closed from accepting Allah's Guidance), and on their eyes there is a covering. Theirs will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal upon their hearts and ears; their sight is dimmed and for them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has set a seal on their hearts and on their hearing, and over their vision is a veil. They will have a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:7] God has set a seal on their hearts, impressing on them and making certain that no good enters them; and on their hearing, [in which He has] deposited something so that they cannot profit from the truth they hear; and on their eyes is a covering, that is, a veil so that they do not see the truth; and for them there will be a mighty chastisement, that is, intense and everlasting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة جارية مجرى التعليل للحكم السابق في قوله تعالى : { سواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون } \\[ البقرة : 6 \\] وبيان لسببه في الواقع ليدفع بذلك تعجب المتعجبين من استواء الإنذار وعدمه عندهم ومن عدم نفوذ الإيمان إلى نفوسهم مع وضوح دلائله ، فإذا عَلم أن على قلوبهم ختماً وعلى أسماعهم وأن على أبصارهم غشاوة عَلِمَ سبب ذلك كله وبطل العجب ، فالجملة استئناف بياني يفيد جواب سائل يسأل عن سبب كونهم لا يؤمنون ، وموقع هذه الجملة في نظم الكلام مقابل موقع جملة { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] فلهذه الجملة مكانة بين ذم أصحابها بمقدار ما لتلك من المكانة في الثناء على أربابها .والختم حقيقته السد على الإناء والغلقُ على الكتاب بطين ونحوه مع وضع علامة مرسومة في خاتَم ليمنع ذلك من فتح المختوم ، فإذا فُتح علم صاحبه أنه فتح لفسادٍ يظهر في أثر النقش وقد اتخذ النبيء صلى الله عليه وسلم خاتماً لذلك ، وقد كانت العرب تختم على قوارير الخمر ليصلحها انحباس الهواء عنها وتسلم من الأقذار في مدة تعتيقها . وأما تسمية البلوغ لآخِر الشيء ختماً فلأن ذلك الموضع أو ذلك الوقت هو ظرف وَضع الختم فيسمى به مجازاً . والخاتَم بفتح التاء الطين الموضوع على المكان المختوم ، وأطلق على القالَب المنقوش فيه علامة أو كتابة يطبع بها على الطين الذي يختم به . وكان نقش خاتم النبيء صلى الله عليه وسلم محمد رسول الله . وطينُ الختم طين خاص يشبه الجبس يبل بماء ونحوه ويشد على الموضع المختوم فإذا جف كان قوي الشد لا يُقلع بسهولة وهو يكون قِطَعاً صغيرة كل قطعة بمقدار مضغة وكانوا يجعلونه خواتيم في رقاب أهل الذمة قال بشار :ختم الحب لها في عُنقي ... موضعَ الخاتَم من أهل الذِّمَموالغِشاوة فِعالة من غشاه وتغشاه إذا حجبه ومما يصاغ له وزن فِعالة بكسر الفاء معنى الاشتمال على شيء مثل العِمامة والعِلاوة واللِّفافة . وقد قيل إن صوغ هذه الزنة للصناعات كالخِياطة لما فيها من معنى الاشتمال المجازي ومعنى الغشاوة الغطاء .وليس الختم على القلوب والأسماع ولا الغشاوة على الأبصار هنا حقيقة كما توهمه بعض المفسرين فيما نقله ابن عطية بل ذلك جار على طريقة المجاز بأن جعل قلوبهم أي عقولهم في عدم نفوذ الإيمان والحق والإرشاد إليها ، وجعل أسماعهم في استكاكها عن سماع الآيات والنذر ، وجعل أعينهم في عدم الانتفاع بما ترى من المعجزات والدلائل الكونية ، كأنها مختوم عليها ومغشًّى دونها إما على طريقة الاستعارة بتشبيه عدم حصُول النفع المقصود منها بالختم والغشاوة ثم إطلاق لفظ خَتَم على وجه التبعية ولفظ الغشاوة على وجه الأصلية وكلتاهما استعارة تحقيقية إلا أن المشبه محقق عقلاً لا حساً .ولك أن تجعل الختم والغشاوة تمثيلاً بتشبيه هيئة وهمية متخيلة في قلوبهم أي إدراكهم من التصميم على الكفر وإمساكهم عن التأمل في الأدلة كما تقدم بهيئة الختم ، وتشبيه هيئة متخيلة في أبصارهم من عدم التأمل في الوحدانية وصدق الرسول بهيئة الغشاوة وكل ذينك من تشبيه المعقول بالمحسوس ، ولك أن تجعل الختم والغشاوة مجازاً مرسلاً بعلاقة اللزوم والمراد اتصافهم بلازم ذلك وهو أن لا تعقل ولا تحس ، والختم في اصطلاح الشرع استمرار الضلالة في نفس الضال أو خلق الضلالة ، ومثله الطبع ، والأكنة .والظاهر أن قوله : { وعلى سمعهم } معطوف على قوله : { قلوبهم } فتكون الأسماع مختوماً عليها وليس هو خبراً مقدماً لقوله { غشاوة } فيكون : { وعلى أبصارهم } معطوفاً عليه لأن الغشاوة تناسب الأبصار لا الأسماع ولأن الختم يناسب الأسماع كما يناسب القلوب إذ كلاهما يشبه بالوعاء ويتخيل فيه معنى الغلق والسد ، فإن العرب تقول : استكَّ سمعه ووقر سمعه وجعلوا أصابعهم في آذانهم .والمراد من القلوب هنا الألباب والعقول ، والعرب تطلق القلب على اللحمة الصنوبرية ، وتطلقه على الإدراك والعقل ، ولا يكادون يطلقونه على غير ذلك بالنسبة للإنسان وذلك غالب كلامهم على الحيوان ، وهو المراد هنا ، ومقره الدماغ لا محالة ولكن القلب هو الذي يمده بالقوة التي بها عمل الإدراك .وإنما أفرد السمع ولم يجمع كما جمع ( قلوبهم ) و ( أبصارهم ) إما لأنه أريد منه المصدر الدال على الجنس ، إذ لا يطلق على الآذان سمع ألا ترى أنه جمع لما ذكر الآذان في قوله : { يجعلون أصابعهم في أذانهم } \\[ البقرة : 19 \\] وقوله : { وفي آذاننا وقر } \\[ فصلت : 5 \\] فلما عبر بالسمع أفرد لأنه مصدر بخلاف القلوب والأبصار فإن القلوب متعددة والأبصار جمع بصر الذي هو اسم لا مصدر ، وإما لتقدير محذوف أي وعلى حواس سمعهم أو جوارح سمعهم . وقد تكون في إفراد السمع لطيفة روعيت من جملة بلاغة القرآن هي أن القلوب كانت متفاوتة واشتغالها بالتفكر في أمر الإيمان والدين مختلف باختلاف وضوح الأدلة ، وبالكثرة والقلة وتتلقى أنواعاً كثيرة من الآيات فلكل عقل حظه من الإدراك ، وكانت الأبصار أيضاً متفاوتة التعلق بالمرئيات التي فيها دلائل الوحدانية في الآفاق ، وفي الأنفس التي فيها دلالة ، فلكل بصر حظه من الالتفات إلى الآيات المعجزات والعبر والمواعظ ، فلما اختلفت أنواع ما تتعلقان به جمعت . وأما الأسماع فإنما كانت تتعلق بسماع ما يُلقى إليها من القرآن فالجماعات إذا سمعوا القرآن سمعوه سماعاً متساوياً وإنما يتفاوتون في تدبره والتدبر من عمل العقول فلما اتحد تعلقها بالمسموعات جعلت سمعاً واحداً .وإطلاق أسماء الجوارح والأعضاء إذا أريد به المجاز عن أعمالها ومصادرها جاز في إجرائه على غير المفرد إفراده وجمعه وقد اجتمعا هنا فأما الإطلاق حقيقة فلم يصح ، قال الجاحظ في «البيان» : قال بعضهم لغلام له اشتر لي رأس كبشين فقيل له ذلك لا يكون ، فقال : إذاً فرأسي كبش فزاد كلامه إحالة» وفي «الكشاف» أنهم يقولون ذلك إذا أمن اللبس كقول الشاعر :كُلوا في بعضضِ بطنكم تَعُّفوا ... فإنَّ زمانكم زَمَن خَمِيصوهو نظير ما قاله سيبويه في باب ما لُفظ به مما هو مثنى كما لفظ بالجمع من نحو قوله تعالى : { فقد ضغت قلوبكما } \\[ التحريم : 4 \\] ويقولون ضع رحالهما وإنما هما اثنان وهو خلاف كلام الجاحظ وقد يكون ما عده الجاحظ على القائل خطأً لأن مثل ذلك القائل لا يقصد المعاني الثانية فحمل كلامه على الخطأ لجهله بالعربية ولم يحمل على قصد لطيفة بلاغية بخلاف ما في البيت فضلاً عن الآية كقول علي رضي الله عنه لمن سأله حين مرت جنازة : من المتوفى ( بصيغة اسم الفاعل ) فقال له علي : «الله» لأنه علم أنه أخطأ أراد أن يقول المتوَّفي وإلا فإنه يصح أن يقال توفى فلان بالبناء للفاعل فهو متوف أي استوفى أجله ، وقد قرأ عليُّ نفسه قوله تعالى : { والذين يَتوفون منكم } بصيغة المبني للفاعل .وبعد كون الختم مجازاً في عدم نفوذ الحق لعقولهم وأسماعهم وكون ذلك مسبباً لا محالة عن إعراضهم ومكابرتهم أسند ذلك الوصف إلى الله تعالى لأنه المقدِّر له على طريقة إسناد نظائر مثل هذا الوصف في غير ما آية من القرآن نحو قوله : { أولئك الذين طبع الله على قلوبهم } \\[ النحل : 108 \\] وقوله : { ولا تطع من أغفلنا قلبه عن ذكرنا } \\[ الكهف : 28 \\] ونظائر ذلك كثيرة في القرآن كثرة تنبو عن التأويل ومحملها عندنا على التحقيق أنها واردة على اعتبار أن كل واقع هو بقدر الله تعالى وأن الله هدى ووفق بعضاً ، وأضل وخذل بعضاً في التقدير والتكوين ، فلا ينافي ذلك ورود الآية ونظائرها في معنى النعي على الموصوفين بذلك والتشنيع بحالهم لأن ذلك باعتبار ما لهم من الميل والاكتساب ، وبالتحقيق القدرة على الفعل والترك التي هي دون الخلق ، فالله تعالى قدَّر الشرور وأوجد في الناس القدرة على فعلها ولكنه نهاهم عنها لأنه أوجد في الناس القدرة على تركها أيضاً ، فلا تعارض بين القدَر والتكليف إذ كلٌّ راجع إلى جهة خلاف ما توهمته القدرية فنفوا القدَر وهو التقدير والعلم وخلاف ما توهمته المعتزلة من عدم تعلق قدرة الله تعالى بأفعال المكلفين ولا هي مخلوقة له وإنما المخلوق له ذواتهم وآلات أفعالهم ، ليتوسلوا بذلك إلى إنكار صحة إسناد مثل هاته الأفعال إلى الله تعالى تنزيهاً له عن إيجاد الفساد ، وتأويللِ ما ورد من ذلك : على أن ذلك لم يغن عنهم شيئاً لأنهم قائلون بعلمه تعالى بأنهم سيفعلون وهو قادر على سلب القُدَر منهم فبتركه إياهم على تلك القُدرة إمهال لهم على فعل القبيح وهو قبيح ، فالتحقيق ما ذهب إليه الأشاعرة وغيرهم من أهل السنة أن الله هو مقدر أفعال العباد إلا أن فِعْلها هو من العبد لا من الله وهو الذي أفصح عنه إمام الحرمين وأضرابُه من المحققين .ولا يرد علينا أنه كيف أقدرهم على فعل المعاصي؟ لأنه يَرد على المعتزلة أيضاً أنه كيف عَلم بعد أن أقدرهم بأنهم شارعون في المعاصي ولم يسلب عنهم القدرة؟ فكان مذهب الأشاعرة أسعد بالتحقيق وأجرى على طريق الجمع بين ما طفح به الكتاب والسنة من الأدلة . ولنا فيه تحقيق أعلى من هذا بسطناه في «رسالة القدرة والتقدر» التي لما تظهر .وإسناد الختم المستعمل مجازاً إلى الله تعالى للدلالة على تمكن معنى الختم من قلوبهم وأن لا يرجى زواله كما يقال خِلقةٌ في فلان ، والوصف الذي أودعه الله في فلان أوأعطاه فلاناً ، وفرق بين هذا الإسناد وبين الإسناد في المجاز العقلي لأن هذا أريد منه لازم المعنى والمجازَ العقلي إنما أسند فيه فعل لغير فاعله لملابسة ، والغالب صحة فرض الاعتبارين فيما صلح لأحدهما وإنما يرتكب ما يكون أصلح بالمقام .وجملة : { وعلى سمعهم } معطوفة على قوله : { وعلى قلوبهم } بإعادة الجار لزيادة التأكيد حتى يكون المعطوف مقصوداً لأن على مؤذنة بالمتعلق فكأنَّ { خَتَم } كُرر مرتين . وفيه ملاحظة كون الأسماع مقصودة بالختم إذ ليس العطف كالتصريح بالعامل . وليس قوله { وعلى سمعهم } خبراً مقدماً لغشاوة لأن الأسماع لا تناسبها الغشاوة وإنما يناسبها السد ألا ترى إلى قوله تعالى : { وختم على سمعه وقلبه وجعل على بصره غشاوة } \\[ الجاثية : 23 \\] ولأن تقديم قوله : { وعلى أبصارهم } دليل على أنه هو الخبر لأن التقديم لتصحيح الابتداء بالنكرة فلو كان قوله : { وعلى سمعهم } هو الخبر لاستغنى بتقديم أحدهما وأبقى الآخر على الأصل من التأخير فقيل وعَلى سمعهم غشاوة وعلى أبصارهم .وفي تقديم السمع على البصر في مواقعه من القرآن دليل على أنه أفضل فائدة لصاحبه من البصر فإن التقديم مؤذن بأهمية المقدم وذلك لأن السمع آلة لتلقي المعارف التي بها كمال العقل ، وهو وسيلة بلوغ دعوة الأنبياء إلى أفهام الأمم على وجه أكمل من بلوغها بواسطة البصر لو فقد السمع ، ولأن السمع ترد إليه الأصوات المسموعة من الجهات الست بدون توجه ، بخلاف البصر فإنه يحتاج إلى التوجه بالالتفات إلى الجهات غير المقابلة .{ وَلَهُمْ عَذَابٌ عظِيمٌ } .العذاب : الألم ، وقد قيل إن أصله الإعذاب مصدر أعذب إذا أزال العذوبة لأن العذاب يزيل حلاوة العيش فصيغ منه اسم مصدر بحذف الهمزة ، أو هو اسم موضع للألم بدون ملاحظة اشتقاق من العذوبة إذ ليس يلزم مصير الكلمة إلى نظيرتها في الحروف . ووصف العذاب بالعظيم دليل على أن تنكير عذاب للنوعية وذلك اهتمام بالتنصيص على عظمه لأن التنكير وإن كان صالحاً للدلالة على التعظيم إلا أنه ليس بنص فيه ولا يجوز أن يكون { عظيم } تأكيداً لما يفيده التنكير من التعظيم كما ظنه صاحب «المفتاح» لأن دلالة التنكير على التعظيم غير وضعية ، والمدلولات غير الوضعية يستغني عنها إذا ورد ما يدل عليها وضعاً فلا يعد تأكيداً . والعذاب في الآية ، إما عذاب النار في الآخر ، وإما عذاب القتل والمسغبة في الدنيا .\n\n",
      "translations": [
        {
          "translation": "(Allah hath sealed their hearts), stamped their hearts, (and their hearing, and on their eyes there is a covering), on their eyes there is a shield (and theirs will be an awful doom) an awful torment in the Hereafter. This refers in particular to the Jews Ka'b Ibn al-Ashraf, Huyayy Ibn Akhtab and Judayy Ibn Akhtab. It is also said that it refers to the idolaters of Mecca 'Utbah [Ibn Rabi'ah], Shaybah [Ibn Rabi'ah] and al-Walid [Ibn al-Mughirah].\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { عَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ } أي غِطاءٌ وسِترٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {Upon their eyes is a veil} that is, a cover and a protection.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ خَتَمَ ٱللَّهُ } المحيط بذواتهم وأوصافهم وأفعالهم { عَلَىٰ قُلُوبِهمْ } لئلا يكونوا من أرباب المكاشفات { وَعَلَىٰ سَمْعِهِمْ } لئلا يكونوا من أصحاب المجاهدة { وَعَلَىٰ أَبْصَٰرِهِمْ } لئلا يكونوا من أرباب المشاهدة { غِشَاوَةٌ } ستر عظيم لا يمكنك رفعه بل { وَلَهُمْ عَذَابٌ عظِيمٌ } [البقرة: 7] هو عذاب الطرد والبعد\n إذ لا عذاب أعظم منه\n أولئك الأشقياء البعداء عن ساحة الحضور\n هم الضالون في تيه الحرمان\n الباقون في عظلمة الإمكان\n أعاذنا الله من ذلك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { غشاوة } مبتدأ\n والجار قبله خبره\n والغشاوة: ما يغشى الشيء ويغطيه\n كنى به عن مانع قهرهم عن الإيمان\n يقول الحقّ جلّ جلاله: يا محمد { إنَّ الَّذِينَ كَفَرُوا } بما أنزل إليك جهراً\n وسبقت لهم مني الشقاوة سرّاً\n لا ينفع فيهم الوعظ والإنذار\n ولا البشارة والتذكار\n فإنذارك وعدمه في حقهم سواء\n لما سبق لهم مني الطرد والشقاء\n فالتذكير في حقهم عناء\n والغيبة عن أحوالهم راحة وهناء\n لأني ختمتُ على قلوبهم بطابع الكفران\n فلا يهتدون إلى إسلام ولا إيمان\n ومنعت أسماعهم أن تصغي إلى الوعظ والتذكير\n فلا ينجع فيهم تخويف ولا تحذير\n وغشيت أبصارهم بظلمة الحجاب فلا يبصرون الحق والصواب\n قد أعددتُهم لعذابي ونقمتي\n وطردتهم عن ساحة رحمتي ونعمتي\n وإنما أمرتك بإنذارهم لإقامة الحجة عليهم\n وإني وإن حكمت عليهم أنهم من أهل مخالفتي وعنادي فإني لا أظلم أحداً من خلقي وعبادي\n\n[الأنعَام: 149]\n فما ظلمتُهم لأني بعثتُ الرسلَ مبشرين ومنذرين\n ولكن ظلموا أنفسهم فكانوا هم الظالمين\n فحكمتي اقتضيت الإنذار\n وقدرتي اقتضت القهر والإجبار\n فالواجب عليك أيها العبد أن تكون لك عينان: عين تنظر لحكمتي وشريعتي فتتأدب\n وعينٌ تنظر لقدرتي وحقيقتي فتُسلم\n وتكون بي الأمن والرّهْب\n فلا تأمَنْ مَكْرِي وإن أمَّنتُك\n ولا تيأس من حلمي وإن أبعدتك\n فعلمي لا يحيط به محيط\n إلا من هو بكل شيء محيط\n الإشارة: إن الذين أنكروا وجود الخصوصية\n جحدوا أهل مشاهدة الربوبية من أهل التربية النبوية\n لا ينفع فيهم الوعظ والتذكير\n بما سبق لهم في علم الملك القدير\n فسواء عليهم أأنذرتهم وبال القطيعة والحجاب\n أم لم تنذرهم لعدم فتح الباب\n قد ختم الله على قلوبهم بالعوائد والشهوات\n أو حلاوة الزهد والطاعات\n أو تحرير المسائل والمشكلات\n وعلى سمع قلوبهم بالخواطر والغفلات\n وجعل على أبصارهم غشاوة الحجاب\n فلا يبصرون إلا المحسوسات\n غائبون عن أسرار المعاني وأنوار التجليات\n بخلاف قلوب العارفين\n فإنها ترى من أسرار المعاني ما لا يُرى للناظرين\n وفي ذلك يقول الشاعر:\nفسبحان من حجب العالمين بصلاحهم عن مصلحهم\n وحجب العلماء بعلمهم عن معلومهم\n واختصّ قوماً بنفوذ عزائمهم إلى مشاهدة ذات محبوبهم\n فهم في رياض ملكوته يتنزهون\n وفي بحار جبروته يسبحون\n\n[الصَّافات: 61]\n ولما ذكر الحق - جلّ جلاله - من أعلن بالإنكار\n ذكر من أسَرَّ بالجحود وأظهر الإقرار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:23",
      "similarity": 0.8371850401035806
    },
    {
      "verse": "83:26",
      "similarity": 0.6797535635137217
    },
    {
      "verse": "33:40",
      "similarity": 0.6292090198213417
    },
    {
      "verse": "36:65",
      "similarity": 0.5403556898371967
    },
    {
      "verse": "6:46",
      "similarity": 0.3867726441313199
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}