{
  "chapter": "البقرة",
  "text": "او۟لئك الذين اشتروا۟ الحيوة الدنيا بالءاخرة فلا يخفف عنهم العذاب ولا هم ينصرون",
  "translations": [
    {
      "translation": "Those are the people who trade the Next World for this world. The punishment will not be lightened for them. They will not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who bought the life of the world at the cost of the life to come; and neither will their torment decrease nor help reach them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who have preferred the worldly life to the life in the Hereafter. Therefore their torment shall not be lightened nor shall help be given to them (from any quarter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have traded the life hereafter in exchange for their worldly life. Their punishment will not be eased nor will they receive help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who bought the worldly life in exchange of the Hereafter – so their punishment will not be lightened, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who have bought the life of this world at the price of the Hereafter. Their torment shall not be lightened nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who buy the life of this world for the hereafter, so their chastisement shall not be lightened nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have purchased the present life at the price of the world to come -- for them the chastisement shall not be lightened, neither shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are those who buy the life of the world at the price of the Hereafter. Their punishment will not be lightened, neither will they have support.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are they who buy the life of this world at the price of the Hereafter. Their punishment shall not be lightened for them, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have purchased the life of the world for the Hereafter; wherefore the torment shall not be lightened for them, nor shall they be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who bought the life of this world for the Hereafter; so their punishment shall not be lightened, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who buy the life of this world at the price of the Hereafter: their penalty shall not be lightened nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who have bought the life of this world at the price of the Hereafter. Their torment shall not be lightened nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are they who buy the worldly life at the price of the Everlasting Life. Their punishment shall not be lightened, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who bought the present life for the Hereafter, so the punishment will not be lightened for them, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who have bought the life of this world [in exchange] for the Hereafter, so the punishment will not be lightened for them, nor will they be aided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:86] Those are the ones who have purchased the life of this world at the price of the Hereafter, by preferring the former to the latter — for them the punishment shall not be lightened, neither shall they be helped, [neither shall they be] protected against it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such are those who buy the life of the world at the price of the Hereafter) they choose this lower world instead of the Hereafter, and disbelief instead of belief: (Their punishment will not be lightened) will not be reduced; as it is said: it will not be lifted, (neither will they have support) be precluded from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما ذكر سبحانه قبح معاشهم ومعادهم أراد أن ينبه على المؤمنين بأسباب مقابحهم وإعراضهم ليحذروا منها ويحترزوا عنها فقال مشيراً لهم: { أُولَـٰئِكَ } البعداء عن منهج الصدق والصواب هم { ٱلَّذِينَ ٱشْتَرَوُاْ } استبدلوا واختاروا { ٱلْحَيَاةَ ٱلدُّنْيَا بِٱلآخِرَةِ } الفانية غير القارة\n بل اللاشيء المحض بالآخرة التي هي النعيم الدائم واللذة المستمرة والحياة الأزلية السرمدية { فَلاَ يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ } أي: عذاب الإمكان والافتقار لذلك { وَلاَ هُمْ يُنصَرُونَ } [البقرة: 86] فيما هو متمناهم من الحوائج\n بل دائماً مفترضون محتاجون\n مسودة الوجوه في النشأتين\n\n\nواذكر يا أكمل الرسل للمؤمنين أيضاً من قبح صنائعهم ليعتبروا: { وَلَقَدْ آتَيْنَا مُوسَىٰ } المبعوث إليهم { ٱلْكِتَابَ } أي: التوراة المشتملة على مصالحهم الدنيوية والأخروية فكذبوه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { أُوْلَئِكَ } الناقصون للعهود المتعدون الحدود { اشْتَرَوُا الْحَيَاةَ الدُّنْيَا } وزخارفها الغرارة { بالآخِرَةِ } الباقية الدائمة، { فَلا يُخَفَّفُ عَنْهُمُ الْعَذَابُ } ساعة الدنيا بالذل والهوان، وفي الآخرة بدخول النيران، { وَلا هُمْ يُنصَرُونَ } بالامتناع منه في كل أوان. الإشارة: أولئك الذين نظروا إلى غرة ظاهرة الأكوان، ولم ينفذوا إلى عبرة باطنها، فلا ينقطع عنهم عذاب الوهم والحجاب، ولا هم ينصرون من أليم العذاب.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:85",
      "similarity": 0.6017778076967869
    },
    {
      "verse": "2:162",
      "similarity": 0.5854542326145362
    },
    {
      "verse": "3:88",
      "similarity": 0.5854542326145362
    },
    {
      "verse": "43:54",
      "similarity": 0.5239377542293121
    },
    {
      "verse": "4:28",
      "similarity": 0.5166238292849051
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/2:86.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/2:86.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:86.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}