{
  "chapter": "البقرة",
  "text": "يخدعون الله والذين ءامنوا۟ وما يخدعون الا انفسهم وما يشعرون",
  "translations": [
    {
      "translation": "They think they deceive Allah and those who have iman. They deceive no one but themselves but they are not aware of it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (try to) deceive God and those who believe, yet deceive none but themselves although they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thus try to deceive Allah and the Believers, but they succeed in deceiving none except themselves and they realize it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deceive God and the believers. However, they have deceived no one but themselves, a fact of which they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish to deceive Allah and the believers; and in fact they deceive none except themselves and they do not have any understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They try to deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desire to deceive Allah and those who believe, and they deceive only themselves and they do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would trick God and the believers, and only themselves they deceive, and they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think to beguile Allah and those who believe, and they beguile none save themselves; but they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive God and the believers, but they only deceive themselves, though they do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would deceive Allah and those who believe, whereas they deceive not save themselves, and they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive Allah and those who have faith, yet they deceive no one but themselves, but they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would they deceive Allah and those who believe, but they only deceive themselves, and realise (it) not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (think to) deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive Allah and those who believe, but they deceive none except themselves, though they do not sense it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive God and those who believe, but they deceive none but themselves, though they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:9] They would deceive God and the believers, by manifesting the opposite of the unbelief they hide, so that they can avoid His rulings in this world; and only themselves they deceive (yukhādi‘ūn), for the evil consequences of their deception will rebound upon them, as they are disgraced in this world when God makes known to His Prophet what they are hiding, and they will be punished in the Hereafter; and they are not aware, and they do not know that they are actually deceiving themselves (mukhāda‘a [although a third verbal form, from khāda‘a] actually denotes a one-way action, such as [when one says] ‘āqabtu al-lissa, ‘I punished the thief’ [using the third verbal form ‘āqaba]; the mention of ‘God’ in [this statement] is for [rhetorical] effect; a variant reading [for wa-mā yukhādi‘ūna] has wa-mā yakhda‘ūna).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة : { يخادعون } بدل اشتمال من جملة : { يقول آمنا بالله } \\[ البقرة : 8 \\] وما معها لأن قولهم ذلك يشتمل على المخادعة . والخداع مصدر خادع الدال على معنى مفاعلة الخدع ، والخدع هو فعل أو قول معه ما يوهم أن فاعله يريد بمدلوله نفع غيره وهو إنما يريد خلاف ذلك ويتكلف ترويجه على غيره ليغيره عن حالة هو فيها أو يصرفه عن أمر يوشك أن يفعله ، تقول العرب : خدع الضب إذا أوهم حارشه أنه يحاول الخروج من الجهة التي أدخل فيها الحارش يده حتى لا يرقبه الحارش لعلمه أنه آخذه لا محالة ثم يخرج الضب من النافقاء .والخداع فعل مذموم إلا في الحرب والانخداع تمشي حيلة المخادع على المخدوع وهو مذموم أيضاً لأنه من البله وأما إظهار الانخداع مع التفطن للحيلة إذا كانت غير مضرة فذلك من الكرم والحلم قال الفرزدق :استمطروا من قريش كل منخدع ... إن الكريمَ إذا خادعته انخدعاوفي حديث \" المؤمن غر كريم \" أي من صفاته الصفح والتغاضي حتى يظن أنه غر ولذلك عقبه بكريم لدفع الغرية المؤذنة بالبله فإن الإيمان يزيد الفطنة لأن أصول اعتقاده مبنية على نبذ كل ما من شأنه تضليل الرأي وطمس البصيرة ألا ترى إلى قوله : \" والسعيد من وعظ بغيره \" مع قوله : \" لا يلدغ المؤمن من جحر مرتين \" ، وكلها تنادي على أن المؤمن لا يليق به البله وأما معنى «المؤمن غر كريم» فهو أن المؤمن لما زكت نفسه عن ضمائر الشر وخطورها بباله وحمل أحوال الناس على مثل حاله فعرضت له حالة استئمان تشبه الغرية قال ذو الرمة :تلك الفتاة التي علقتها عرضاً ... إِنَّ الحليم وذا الإسلام يختلبفاعتذر عن سرعة تعلقه بها واختلابها عقله بكرم عقله وصحة إسلامه فإن كل ذلك من أسباب جودة الرأي ورقة القلب فلا عجب أن يكون سريع التأثر منها .ومعنى صدور الخداع من جانبهم للمؤمنين ظاهر ، وأما مخادعتهم الله تعالى المقتضية أن المنافقين قصدوا التمويه على الله تعالى مع أن ذلك لا يقصده عاقل يعلم أن الله مطلع على الضمائر والمقتضية أن الله يعاملهم بخداع ، وكذلك صدور الخداع من جانب المؤمنين للمنافقين كما هو مقتضى صيغة المفاعلة مع أن ذلك من مذموم الفعل لا يليق بالمؤمنين فعله فلا يستقيم إسناده إلى الله ولا قصد المنافقين تعلقه بمعاملتهم لله كل ذلك يوجب تأويلاً في معنى المفاعلة الدال عليه صيغة { يخادعون } أو في فاعله المقدر من الجانب الآخر وهو المفعول المصرح به .فأما التأويل في { يخادعون } فعلى وجوه :أحدها : أن مفعول خَادع لا يلزم أن يكون مقصوداً للمخادِع بالكسر إذ قد يقصد خداع أحد فيصادف غيره كما يخادع أحد وكيلَ أحد في مال فيقال له أنت تخادع فلاناً وفلاناً تعني الوكيل وموكِّلَه ، فهم قصدوا خداع المؤمنين لأنهم يكذّبون أن يكون الإسلام من عند الله فلما كانت مخادعتهم المؤمنين لأجل الدِّين كان خداعهم راجعاً لشارع ذلك الدين ، وأمَّا تأويل معنى خداع الله تعالى والمؤمنين إياهم فهو إغضاء المؤمنين عن بوادرهم وفلتات أَلسُنهم وكبواتتِ أفعالهم وهفواتِهم الدال جميعها على نفاقهم حتى لم يزالوا يعاملونهم معاملة المؤمنين فإن ذلك لما كان من المؤمنين بإذن الرسول صلى الله عليه وسلم حتى لقد نهى من استأذنه في أن يقتل عبدَ الله بن أبي ابن سلول ، كان ذلك الصنيع بإذن الله فكان مرجعه إلى الله ، ونظيره قوله تعالى :{ إن المنافقين يخادعون الله وهو خادعهم } في سورة النساء ( 142 ) ، كما رجع إليه خداعُهم للمؤمنين ، وهذا تأويل في المخادعة من جانبيها ، كل بما يلائمه .الثاني : } ما ذكره صاحب «الكشاف» أن { يخادعون } استعارة تمثيلية تشبيهاً للهيئة الحَاصلة من معاملتهم للمؤمنين ولدين الله ، ومن معاملة الله إياهم في الإملاء لهم والإِبْقاء عليهم ، ومعاملة المؤمنين إياهم في إجراء أحكام المسلمين عليهم ، بهيئة فعل المتخادعَين .الثالث : أن يكون خادع بمعنى خدع أي غير مقصود به حصول الفعل من الجانبين بل قَصْدُ المبالغة . قال ابن عطية عن الخليل : يقال خَادع مِنْ واحد لأن في المخادعة مُهْلةً كما يقال عَالجت المريضَ لمكان المهلة ، قال ابن عطية كأنه يرد فَاعَل إلى اثنين ولا بُدَّ من حيثُ إن فيه مهلة ومدافعة ومماطلة فكأنه يقاوم في المعنى الذي يجيء فيه فاعَلَ ا ه . وهذا يرجع إلى جعل صيغة المفاعلة مستعارة لِمعنى المبالغة بتشبيه الفعل القوي بالفعل الحاصل من فاعَلْين على وجه التبَعية ، ويؤيد هذا التأويل قراءة ابن عامر ومن معه : ( يخْدَعون الله ) . وهذا إنما يدفع الإشكال عن إسناد صدور الخداع من الله والمؤمنين مع تنزيه الله والمؤمنين عنه ، ولا يدفع إشكال صدور الخداع من المنافقين لله .وأما التأويل في فَاعِل { يخادعون } المقدَّر وهو المفعول أيضاً فبأن يُجعل المراد أنهم يخادعون رسول الله فالإسناد إلى الله تعالى إما على طريقة المجاز العقلي لأجل الملابسة بين الرسول ومُرسله وإما مجازٌ بالحذف للمضاففِ ، فلا يكون مرادهم خداعَ الله حقيقة ، ويبقى أن يكون رسول الله مخدوعاً منهم ومخادعاً لهم ، وأما تجويز مخادعة الرسول والمؤمنين للمنافقين لأنها جزاءٌ لهم على خداعهم فذلك غير لائق .وقوله : { يخادعون الله } قرأه نافع وابن كثير وأبو عَمرو وخلَف ( يخادعون ) بألف بعد الخاء وقرأه ابن عامر وعاصم وحمزة والكسائي وأبو جعفر ويعقوب ( يخْدَعون ) بفتح التحتية وسكون الخاء .وجملة { وما يخادعون إلا أنفسهم } حال من الضمير في { يُخادعون } الأول أي يخادعون في حال كونهم لا يخادعون إلا أنفسهم أي خداعهم مقصور عن ذواتهم لا يرجع شيء منه إلى الله والذين آمنوا ، فيتعين أن الخداع في قوله { وما يخادعون } عينُ الخِداع المتقدم في قوله : { يخادعون الله } فَيَرِد إشكال صحة قصر الخِداع على أنفسهم مع إثبات مخادعتهم الله تعالى والمؤمنين .وقد أجاب صاحب «الكشاف» بما حاصله أن المخادعة الثانية مستعملة في لازم معنى المخادعة الأولى وهو الضُّر فإنها قد استعملت أولاً في مطلق المعاملة الشبيهة بالخداع وهي معاملة الماكر المستخف فأطلق عليها لفظُ المخادعة استعارة ثم أطلقت ثانياً وأريد منها لازِم معنى الاستعارة وهو الضُر لأن الذي يعامَل بالمكر والاستخفاف يتصدى للإنتقام من معامِلِه فقد يجد قدرة من نفسه أو غِرَّةً من صاحبه فيضره ضراً فصار حصول الضر للمعامِل أمراً عرفياً لازماً لمعامَله ، وبذلك صح استعمال يخادع في هذا المعنى مجازاً أو كناية وهو من بناء المجاز على المجاز لأن المخادعة أطلقت أولاً استعارة ثم نُزلت منزلة الحقيقة فاستعملت مجازاً في لازم المعنى المستعار له ، فالمعنى وما يَضُرون إلا أنفسهم فيجري فيه الوجوه المتعلقة بإطلاق مادة الخداع على فعلهم ، ويجىء تأويل معنى جَعل أنفسهم شقاً ثانياً للمخادعة مع أن الأنفس هي عينهم فيكون الخداع استعارة للمعاملة الشبيهة بفعل الجانبين المتخادعين بناء على ما شاع في وِجدان الناس من الإحساس بأن الخواطر التي تدعو إلى ارتكاب ما تَسوء عواقبه أنها فعلُ نفس هي مغايرة للعقل وهي التي تسول للإنسان الخير مرة والشر أخرى وهو تخيُّل بُني على خَطابة أخلاقية لإحداث العداوة بين المرء وبين خواطره الشريرة بجعلها واردة عليه من جهة غير ذاته بل من النَّفْس حتى يتأهب لمقارعتها وعصيان أمرها ولو انتسبت إليه لما رأى من سبيل إلى مدافعتها ، قال عمرو بن معديكرب :فجاشَت عليَّ أوَّلَ مرة ... فرُدَّتْ على مكروهها فاستقرتِوذكر ابن عطية أن أبا عليّ الفارسي أنشد لبعض الأعراب :لم تَدر ما ( لا ) ولستَ قائلَها ... عُمْرَك ما عِشْتَ آخر الأبدولم تُؤامر نفسيْك مُمتريا ... فيها وفي أختها ولم تكديريد بأختها كلمة ( نعم ) وهي أخت ( لا ) والمراد أنها أخت في اللسان . وقلت ومنه قول عروة بن أذينة :وإذا وجدتُ لها وَسَاوِسَ سَلْوَة ... شَفَع الفؤاد إلى الضمير فَسَلَّهافكأنهم لما عصوا نفوسهم التي تدعوهم للإيمان عند سماع الآيات والنذر إذ لا تخلو النفس من أوبة إلى الحق جعل معاملتهم لها في الإعراض عن نصحها وإعراضها عنهم في قلة تجديد النصح لهم وتركهم في غيهم كالمخادعة من هذين الجانبين .واعلم أن قوله : { وما يخادعون إلا أنفسهم } أجمعت القراءات العشر على قراءته بضم التحتية وفتح الخاء بعدها ألف . والنفس في لسان العرب الذات والقوة الباطنية المعبر عنها بالروح وخاطر العقل .وقوله : { وما يشعرون } عطف على جملة { وما يخادعون } والشعور يطلق على العلم بالأشياء الخفية ، ومنه سمي الشاعر شاعراً لعلمه بالمعاني التي لا يهتدي إليها كل أحد وقدرته على الوزن والتقفية بسهولة ، ولا يحسن لذلك كل أحد ، وقولهم ليت شعري في التحير في علم أمر خفي ، ولولا الخفاء لما تمنى علمه بل لعلمه بلا تمن ، فقولهم هو لا يشعر وصف بعدم الفطنة لا بعدم الإحساس وهو أبلغ في الذم لأن الذم بالوصف الممكن الحصول أنكى من الذم بما يتحقق عدمه فإن إحساسهم أمر معلوم لهم وللناس فلا يغيضهم أن يوصفوا بعدمه وإنما الذي يغيضهم أن يوصفوا بالبلادة .على أن خفاء مخادعتهم أنفسهم مما لا يمتري فيه واختير مثله في نظيره في الخفاء وهو { ألا إنهم هم المفسدون ولكن لا يشعرون } \\[ البقرة : 12 \\] لأن كليهما أثبت فيه ما هو المآل والغاية وهي مما يخفي واختير في قوله { ألا إنهم هم السفهاء ولكن لا يعلمون } \\[ البقرة : 13 \\] نفي العلم دون نفي الشعور لأن السفه قد يبدو لصاحبه بأقل التفاتة إلى أحواله وتصرفاته لأن السفه أقرب لادعاء الظهور من مخادعة النفس عند إرادة مخادعة الغير ومن حصول الإفساد عند إرادة الإصلاح وعلى الإطلاق الثاني درج صاحب «الكشاف» قال : فهم لتمادي غفلتهم كالذي لا حس له .\n\n",
      "translations": [
        {
          "translation": "(They try to deceive Allah) contravene against Him and denying Him in secret. It is also said that this means that they were so daring with Allah to the extent that they thought they had deceived Him; (and those who believe), Abu Bakr and all the Companions of Muhammad Allah bless him and give him peace; (and they deceive) lie to (none save themselves; but they perceive not), they do not know that Allah informs His Prophet about that which lies secret in their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يُخَادِعُونَ ٱللَّهَ } المحيط بجميع أحوالهم مخادعتهم مع آحاد الناس\n تعالى عن ذلك { وَ } يخادعون الموحدين { ٱلَّذِينَ آمَنُوا } بإحاطة الله بتوفيقه وإلهامه\n حفظاً لدمائهم وأموالهم منهم { وَ } هم { مَا يَخْدَعُونَ } بهذا الخداع { إِلاَّ أَنْفُسَهُم } لأن الله ومن هو في حمايته أجل من أن ينخدع منهم\n فهم بهذا الخداع ما يخدعون إلا أنفسهم { وَمَا يَشْعُرُونَ } [البقرة: 9] بخداعهم\n لأن:\n\n{ فِي قُلُوبِهِم مَّرَضٌ } غطاء مختوم على قلوبهم لا ينكشف إلا بكتاب الله المنزل على رسوله صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجملة { وما يشعرون } حالية\n أي: غير شاعرين\n والشعور: التفطن\n وفعله من باب كَرُمَ ونَصَرَ\n وليت شعري: أي: ليت فطنتي تدرك هذا\n وجملة { في قلوبهم مرض } تعليلية للمخادعة\n والمرض: الضعف والفتور\n وهو هنا مرض القلوب بالشك والنفاق\n والعياذ بالله\n يقول الحقّ جلّ جلاله: { وَمِنَ النَّاسِ } مَن هم مغموص عليهم بالنفاق كبعض اليهود والمنافقين\n يقولون بألسنتهم ما ليس في قلوبهم\n يقولون: { آمَنَّا بِاللَّهِ وبِاليَومِ الآخِر } وما هُم في عداد المؤمنين\n { يُخَادِعُونَ } بزعمهم { اللَّهَ وّالَّذينَ آمَنُوا } بما يظهرون من الإيمان\n { وَمَا يَخْدَعُونَ } في الحقيقة { إلاَّ أَنفُسَهُمْ } لأن وبال خداعهم راجع إليهم\n { وَمَا يَشْعُرُونَ } أن خداعهم وبال عليهم\n وإنما حصلت لهم هذه المخادعة لأن { في قُلُوبِهِم } مرضاً من الشك والحسد\n فقلوبهم مذبذبة\n وأنفسهم مغمومة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:62",
      "similarity": 0.8174127294790419
    },
    {
      "verse": "4:142",
      "similarity": 0.5343507147714677
    },
    {
      "verse": "69:41",
      "similarity": 0.13272150958368276
    },
    {
      "verse": "26:113",
      "similarity": 0.1296247194941885
    },
    {
      "verse": "36:69",
      "similarity": 0.1285127804542434
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}