{
  "chapter": "البقرة",
  "text": "واذا قيل لهم ءامنوا۟ بما انزل الله قالوا۟ نؤمن بما انزل علينا ويكفرون بما وراءه وهو الحق مصدقا لما معهم قل فلم تقتلون انۢبياء الله من قبل ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "When they are told, 'Have iman in what Allah has sent down,' they say, 'Our iman is in what was sent down to us,' and they reject anything beyond that, even though it is the truth, confirming what they have. Say, 'Why then, if you are muminun, did you previously kill the Prophets of Allah?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"believe in what God has sent down,\" they say: \"We believe what was sent to us, and do not believe what has come thereafter,\" although it affirms the truth they possess already. Say: \"Why have you then been slaying God's apostles as of old, if you do believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, \"Believe in that which Allah has sent down,\" they say, \"We believe only in that which has been sent to us\", and reject everything else, though it is the Truth and confirms what is with them. Well, ask them, \"If you sincerely believed in what was sent down to you, why did you kill the Messengers of Allah (who were sent to you from amongst yourselves)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to believe n God's revelations, they reply, \"We believe only in what God has revealed to us,\" but they disbelieve His other true revelations, even though these revelations confirms their own (original) Scripture. (Muhammad) ask them, \"Why did you murder God's Prophets if you were true believers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Believe in what Allah has sent down\", they say, “We believe in what was sent down to us, and disbelieve in the rest” – whereas it is the Truth confirming what they possess! Say (to them, O dear Prophet Mohammed – peace and blessings be upon him), “Why did you then martyr the earlier Prophets, if you believed in your Book?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them (the Jews), \"Believe in what Allah has sent down,\" they say, \"We believe in what was sent down to us.\" And they disbelieve in that which came after it, while it is the truth confirming what is with them. Say (O Muhammad to them): \"Why then have you killed the Prophets of Allah aforetime, if you indeed have been believers\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, Believe in what Allah has revealed, they say: We believe in that which was revealed to us; and they deny what is besides that, while it is the truth verifying that which they have. Say: Why then did you kill Allah's Prophets before if you were indeed believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they were told, 'Believe in that God has sent down,' they said, 'We believe in what was sent down on us'; and they disbelieve in what is beyond that, yet it is the truth confirming what is with them. Say: 'Why then were you slaying the Prophets of God in former time, if you were believers?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Believe in that which Allah hath revealed, they say: We believe in that which was revealed unto us. And they disbelieve in that which cometh after it, though it is the truth confirming that which they possess. Say (unto them, O Muhammad): Why then slew ye the prophets of Allah aforetime, if ye are (indeed) believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Believe in what God has revealed,\" they say, \"We believe in what was revealed to us,\" while they deny the truth in what has been sent down after that, even though it is the Truth, confirming that which they already have. Say, \"Why did you kill God's prophets in the past, if you were true believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them believe in that which Allah hath sent down now, they say: we believe in that which hath been sent down unto Us. And they disbelieve in that which is besides that while it is the truth, confirming that which is with them. Say thou: wherefore then slew ye Allah's prophets afore, a if ye have been believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, ‘Believe in what Allah has sent down,’ they say, ‘We believe in what was sent down to us,’ and they disbelieve what is besides it, though it is the truth confirming what is with them. Say, ‘Then why would you kill the prophets of Allah formerly, should you be faithful?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, \"Believe in what Allah Hath sent down, \"they say, \"We believe in what was sent down to us:\" yet they reject all besides, even if it be Truth confirming what is with them. Say: \"Why then have ye slain the prophets of Allah in times gone by, if ye did indeed believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them (the Jews), \"Believe in what Allah has sent down,\" they say, \"We believe in what was sent down to us.\" And they disbelieve in that which came after it, while it is the truth confirming what is with them. Say (O Muhammad Peace be upon him to them): \"Why then have you killed the Prophets of Allah aforetime, if you indeed have been believers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Believe in what Allah has sent down' they reply: 'We believe in what was sent down to us' But they disbelieve in what is sent after it, although it is the truth, confirming their own Book. Say: 'Why, before did you kill the Prophets of Allah, if you are believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Believe in what God has revealed,” they say, “We believe in what was revealed to us,” and they reject anything beyond that, although it is the truth which confirms what they have. Say, “Why did you kill God’s prophets before, if you were believers?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Believe in what Allah has revealed,\" they say, \"We believe [only] in what was revealed to us.\" And they disbelieve in what came after it, while it is the truth confirming that which is with them. Say, \"Then why did you kill the prophets of Allah before, if you are [indeed] believers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:91] And when it was said to them, ‘Believe in what God has revealed, that is, the Qur’ān and other [Books], they said, ‘We believe in what was revealed to us’, that is, the Torah; and (wā, here indicates a circumstantial   qualifier) they disbelieve in what is beyond that, what is other than that or what came afterwards, such as the Qur’ān; yet it is the truth (wa-huwa’l-haqqu is a circumstantial qualifier) confirming (musaddiqan, a second circumstantial qualifier for emphasis) what is with them. Say, to them: ‘Why then were you slaying the prophets of God formerly, if you were believers?’ in the Torah and in it you were forbidden to kill them: this address, concerning what their forefathers did, is directed towards those present at the time of our Prophet, on account of their approval of it [that is, of what the forefathers had done].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمعطوف على قوله : { ولما جاءهم كتاب من عند الله } \\[ البقرة : 89 \\] المعطوف على قوله : { وقالوا قلوبنا غلف } \\[ البقرة : 88 \\] وبهذا الاعتبار يصح اعتباره معطوفاً على { وقالوا قلوبنا غلف } على المعروف في اعتبار العطف على ما هو معطوف وهذا كله من عطف حكايات أحوالهم في معاذيرهم عن الإعراض عن الدعوة الإسلامية فإذا دعوا قالوا : قلوبنا غلف وإذا سمعوا الكتاب أعرضوا عنه بعد أن كانوا منتظريه حسداً أن نزل على رجل من غيرهم ، وإذا وعظوا وأنذروا ودعوا إلى الإيمان بالقرآن وبأنه أنزله الله وأن ينظروا في دلائل كونه منزلاً من عند الله أعرضوا وقالوا : نؤمن بما أنزل علينا أي بما أنزله الله على رسولنا موسى ، وهذا هو مجمع ضلالاتهم ومنبع عنادهم فلذلك تصدى القرآن لتطويل المحاجة فيه بما هنا وما بعده تمهيداً لقوله الآتي : { ما ننسخ من آية } \\[ البقرة : 106 \\] الآيات .وقولهم : { نؤمن بما أنزل علينا } أرادوا به الاعتذار وتعلة أنفسهم لأنهم لما قيل لهم { آمنوا بما أنزل الله } علموا أنهم إن امتنعوا امتناعاً مجرداً عدت عليهم شناعة الامتناع من الإيمان بما يدعى أنه أنزله الله فقالوا في معذرتهم ولإرضاء أنفسهم { نؤمن بما أنزل علينا } أي أن فضيلة الانتساب للإيمان بما أنزل الله قد حصلت لهم أي فنحن نكتفي بما أنزل علينا وزادوا إذ تمسكوا بذلك ولم يرفضوه . وهذا وجه التعبير في الحكاية عنهم بلفظ المضارع { نؤمن } أي ندوم على الإيمان بما أنزل علينا وقد عرضوا بأنهم لا يؤمنون بغيره لأن التعبير بنؤمن بما أنزل علينا في جواب من قال لهم { آمنوا بما أنزل الله } وقد علم أن مراد القائل الإيمان بالقرآن مشعر بأنهم يؤمنون بما أنزل عليهم فقط لأنهم يرون الإيمان بغيره مقتضياً الكفر به فههنا مستفاد من مجموع جملتي { آمنوا بما أنزل الله } وجوابها بقولهم { نؤمن بما أنزل علينا } .وقوله تعالى : { ويكفرون بما وراءه } جيء بالمضارع محاكاة لقولهم { نؤمن بما أنزل علينا } وتصريح بما لوحوا إليه ورد عليهم أي يدومون على الإيمان بما أنزل عليهم ويكفرون كذلك بما وراءه فهم يرون أن الإيمان به مقتض للكفر بغيره على أن للمضارع تأثيراً في معنى التعجب والغرابة . وفي قرنه بواو الحال إشعار بالرد عليهم وزاد ذلك بقوله { وهو الحق مصدقاً لما معهم } .والوراء في الأصل اسم مكان للجهة التي خلف الشيء وهو عريق في الظرفية وليس أصله مصدراً . جعل الوراء مجازاً أو كناية عن الغائب لأنه لا يبصره الشخص واستعمل أيضاً مجازاً عن المجاوز لأن الشيء إذا كان أمام السائر فهو صائر إليه فإذا صاروا وراءه فقد تجاوزه وتباعد عنه قال النابغة :وليس وراء الله للمرء مطلب ... واستعمل أيضاً بمعنى الطلب والتعقب تقول ورائي فلان بمعنى يتعقبني ويطلبني ومنه قول الله تعالى :{ وكان وراءهم ملك يأخذ كل سفينة غصباً } \\[ الكهف : 79 \\] وقول لبيد :أليس ورائي أن تراخت منيتي ... لزوم العصا تحني عليها الأصابعفمن ثم زعم بعضهم أن الوراء يطلق على الخلف والأمام إطلاق اسم الضدين واحتج ببيت لبيد وبقرآن وكان أمامهم ملك وقد علمت أنه لا حجة فيه ولذلك أنكر الآمدي في «الموازنة» كونه ضداً .فالمراد بما وراءه في الآية بما عداه وتجاوزه أي بغيره والمقصود بهذا الغير هنا خصوص القرآن بقرينة السياق لتقدم قوله : { وإذا قيل لهم آمنوا بما أنزل الله } ولتعقيبه بقوله : { وهو الحق مصدقاً } .وجملة { وهو الحق } حالية واللام في ( الحق ) للجنس والمقصود اشتهار المسند إليه بهذا الجنس أي وهو المشتهر بالحقية المسلم ذلك له على حد قول حسان :وإن سنام المجد من آل هشام ... بنو بنت مخزوم ووالدك العبدلم يرد حسان انحصار العبودية في الوالد وإنما أراد أنه المعروف بذلك المشتهر به فليست اللام هنا مفيدة للحصر لأن تعريف المسند باللام لا تطرد إفادته الحصر على ما في «دلائل الإعجاز» . وقيل يفيد الحصر باعتبار القيد أعني قوله { مصدقاً } أي هو المنحصر في كونه حقاً مع كونه مصدقاً فإن غيره من الكتب السماوية حق لكنه ليس مصدقاً لما معهم ولعل صاحب هذا التفسير يعتبر الإنجيل غير متعرض لتصديق التوراة بل مقتصراً على تحليل بعض المحرمات وذلك يشبه عدم التصديق . ففي الآية صد لبني إسرائيل عن مقابلة القرآن بمثل ما قابلوا به الإنجيل وزيادة في توبيخهم .وقوله : { مصدقاً } حال مؤكدة لقوله : { وهو الحق } وهذه الآية علم في التمثيل للحال المؤكدة وعندي أنها حال مؤسسة لأن قوله { مصدقاً لما معهم } مشعر بوصف زائد على مضمون { وهو الحق } إذ قد يكون الكتاب حقاً ولا يصدق كتاباً آخر ولا يكذبه وفي مجيء الحال من الحال زيادة في استحضار شؤونهم وهيئاتهم .وقوله : { قل فلم تقتلون أنبياء الله من قبل إن كنتم مؤمنين } فصله عما قبله لأنه اعتراض في أثناء ذكر أحوالهم قصد به الرد عليهم في معذرتهم هذه لإظهار أن معاداة الأنبئاء دأب لهم وأن قولهم : { نؤمن بما أنزل علينا } كذب إذ لو كان حقاً لما قتل أسلافهم الأنبئاء الذين هم من قومهم ودعوهم إلى تأييد التوراة والأمر بالعمل بها ولكنهم يعرضون عن كل ما لا يوافق أهواءهم . وهذا إلزام للحاضرين بما فعله أسلافهم لأنهم يرونهم على حق فيما فعلوا من قتل الأنبئاء .والإتيان بالمضارع في قوله : { تقتلون } مع أن القتل قد مضى لقصد استحضار الحالة الفظيعة وقرينة ذلك قوله : { من قبل } فذلك كما جاء الحطيئة بالماضي مراداً به الاستقبال في قوله :شهد الحطيئة يوم يلقى ربه ... أن الوليد أحق بالعذربقرينة قوله يوم يلقى ربه .والمراد بأنبئاء الله الذين ذكرناهم عند قوله تعالى : { ويقتلون النبيئين بغير الحق } \\[ البقرة : 61 \\] .\n\n",
      "translations": [
        {
          "translation": "(And when it is said unto them) i.e. the Jews: (Believe in that which Allah hath revealed) meaning: the Qur'an, (they say: We believe in that which was revealed unto us) i.e. the Torah. (And they disbelieve in that which cometh after it) other than the Torah, (though it is the Truth) i.e. the Qur'an is the Truth (confirming) affirming the Oneness of Allah (that which they possess) of the Book. They said: \"0 Muhammad! Our forefathers were believers\". (Say) Muhammad!: (Why then slew ye the Prophets of Allah before, if ye are (indeed) believers?) if your claims are truthful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية استنكافهم واستكبارهم { إِذَا قِيلَ لَهُمْ } كلاماً صادقاً يقبله كل العقول { آمِنُواْ بِمَا أَنْزَلَ اللَّهُ } في الواقع مطلقاً { قَالُواْ } في الجواب حاصرين: بل { نُؤْمِنُ بِمَآ أُنْزِلَ عَلَيْنَا } فقط\n ولا تم الإنزال لغيرنا { وَ } لا يقتصرون عليه بل { يَكْفُرونَ بِمَا وَرَآءَهُ وَ } إن كان { هُوَ ٱلْحَقُّ } المطابق للواقع في نفسه وهم يعلمون حقيته\n وإن كان { مُصَدِّقاً لِّمَا مَعَهُمْ } من الكتاب\n والحسد والعناد الراسخين في نفوسهم وطباعهم ومبالغتهم في العناد والإصرار على تكذيب هذا الكتاب مع أن الإيمان بأحد المتصدقين المتوافقين يوجب الإيمان بالآخر\n يدل على ألاَّ إيمان لهم بالتوارة أيضاً\n بل هم كافرون بها لدلالة أفعالهم وأعمالهم على الكفر بها وإن أنكروه { قُلْ } لهم إلزاماً يا أكمل الرسل: { فَلِمَ تَقْتُلُونَ } أيها المدينون بدين اليهود المؤمنون المصدقون بالتوراة { أَنْبِيَآءَ ٱللَّهِ } الحاملين لها العاملين بها { مِن قَبْلُ إِن كُنْتُمْ } صادقين في أنكم { مُّؤْمِنِينَ } [البقرة: 91] بها فثبت أنكم لستم مؤمنين بها حينئذ لتخلفكم عن مقتضاه وتكذيبكم من أنزل عليه\n وإن أنكروه اذكر له:",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { يكفرون } حال من الفاعل في { قالوا } \n و { وراء } في الأصل: مصدر جُعل ظرفاً\n ويضاف إلى الفاعل ويراد به ما يتوارى به وهو خلفه\n وإلى المفعول فيراد به ما يواريه وهو قدامه\n ولذلك عد من الأضداد\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: في شأن اليهود: بئس شيئاً باعوا به حظ أنفسهم\n وهو كفرهم بما أنزر الله\n أو { بئسما اشتروا به أنفسهم } بحسب ظنهم\n فإنهم ظنوا أنهم خلّصوا أنفسهم من العذاب بما فعلوا\n وهو كفرهم بما أنزل الله على محمد نبيه صلى الله عليه وسلم بغياً وحسداً أن يكون النبيّ من غيرهم\n فانقلبوا { بِغَضَبِ عَلَى غَضَبٍ } للكفر والحسد لمن هو أفضل الخلق\n أو لكفرهم بمحمد - عليه الصلاة والسلام - بعد عيسى عليه السلام\n أو لتضييعهم التوراة\n وكفرهم بمحمد صلى الله عليه وسلم\n { وَلِلْكَافِرِينَ عَذَابٌ مُّهِينٌ } أي: يذلهم ويخزيهم في الدنيا والآخرة\n بخلاف عذاب العاصي فإنه كفارة لذنوبه\n { وَإِذَا قِيلَ } لهؤلاء اليهود: { آمِنُوا بِمَا أَنزَلَ اللّهُ } على محمد صلى الله عليه وسلم { قَالُوا نُؤْمِنُ بِمَا أُنزِلَ عَلَيْنَا } من التوراة\n وهم { يَكْفُرُونَ بِمَا ورَاءَهُ } أي: بما سواه\n وهو القرآن\n حال كونه { مُصَدِّقاً لِّمَا مَعَهُمْ } من التوراة ومهيمناً عليه\n { قُلْ } لهم يا محمد: { فَلِمَ تَقْتُلُونَ أَنْبِيَاءَ اللّهِ مِن قَبْل } هذا الزمان\n وهو محرم عليكم في التوراة\n { إِن كُنتُم مُؤْمِنِينَ } به؟ فهذا يبطل دعواكم الإيمان بالتوراة إذ الإيمان بالكتاب يقتضي العمل به\n وإلاَّ كان دعوى\n وإن فعله أسلافكم فأنتم راضون به وعازمون عليه\n الإشارة: اعلم أن قاعدة تفسير أهل الإشارة هي أن كل عتاب توجه لمن ترك طريق الإيمان\n وأنكر على أهله يتوجه مثله لمن ترك طريق مقام الإحسان\n وأنكر على أهله\n\nوكل وعيد توعد به أهل الكفران يتوعد به مَن ترك السلوك لمقام الإحسان\n غير أن عذاب أهل الكفر حسي بدني\n وعذاب أهل الحجاب معنوي قلبي\n فنقول فيمن رضي بعيبه وأقام على مرض قلبه وأنكر الأطباء ووجود أهل التربية\n بئسما اشتروا به أنفسهم\n وهو كفرهم بما أنزل الله من الخصوصية على قلوب أوليائه بغياً وحسداً\n أو جهلاً وسوء ظن\n أن ينزل الله من فضله على من يشاء من عباده\n فباؤوا بغضب الحجاب على غضب البعد والارتياب\n أو بغضب سقم القلوب على غضب الإصرار على المساوئ والعيوب\n من لم يتغلغل في علمنا هذا مات مصراً على الكبائر وهو لا يشعر كما قال الشاذلي رضي الله عنه\n ولا يصح التغلغل فيه إلا بصحبة أهله\n وللكافرين بالخصوصية عذاب الطمع وسجن الأكوان\n وهما شجرة الذل والهوان\n وإذا قيل لهم: آمنوا بما أنزل الله من أسرار الحقيقة وأنوار الطريقة\n قالوا: نؤمن بما أنزل علينا من ظواهر الشريعة\n ويكفرون بما وراءه من أسرار الحقيقة\n ككشف أسرار الذات وأنوار الصفات\n وهو - أي: علم الحقيقة - الحق لأنه خالص لب الشريعة\n ولله در صاحب المباحث الأصلية حيث قال:\nوقال أيضاً:\nوكان الشيخ عز الدين بن عبد السلام يقول: هل ثَمَّ شيءٌ غيرُ ما فهمناه من الكتاب والسنة؟\n كان يقول ذلك إذا قيل له: إن الشيخ الشاذلي فاض اليوم بعلوم وأسرار\n فلا التقى بالشيخ وأخذ بيده\n قال: أي والله\n\n\n ما قعد على قواعد الشريعة التي لا تنهدم إلا الصوفية\n ويقال لمن ادعى التمسك بالشريعة وأنكر ما وراءها: فلم تشتغل بجمع الدنيا واحتكارها وتخاف من الفقر\n وتهتم بأمر الرزق وتجزع من المصائب\n والشريعة تنادي عليك بذم ذلك كله إن كنت مؤمناً؟!! وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:71",
      "similarity": 0.5119573435195076
    },
    {
      "verse": "23:7",
      "similarity": 0.4797573506318906
    },
    {
      "verse": "70:31",
      "similarity": 0.4797573506318906
    },
    {
      "verse": "85:20",
      "similarity": 0.4331025479460021
    },
    {
      "verse": "84:10",
      "similarity": 0.41223973300732764
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002091.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002091.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:91.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}