{
  "chapter": "البقرة",
  "text": "واذ اخذنا ميثقكم ورفعنا فوقكم الطور خذوا۟ ما ءاتينكم بقوة واسمعوا۟ قالوا۟ سمعنا وعصينا واشربوا۟ فى قلوبهم العجل بكفرهم قل بئسما يامركم به ايمنكم ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "Remember when We made a covenant with you and lifted up the Mount above your heads: 'Take hold vigorously of what We have given you and listen.' They said, 'We hear and disobey.' They were made to drink the Calf into their hearts because of their kufr. Say, 'If you are muminun, what an evil thing your iman has",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when We took your pledge and exalted you on the Mount (saying:) \"Hold fast to what We have given you, firmly, and pay heed,\" you said: \"We have heard and will not obey.\" (The image of) the calf had sunk deep into their hearts on account of unbelief. Say: \"Vile is your belief if you are believers indeed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall also to mind the Covenant We made with you while We raised the Tur over you: `Follow strictly the precepts We are giving you and give ear to Our Commandments.' Your forefathers replied, \"We have heard but we will not obey.\" They were so prone to unbelief that they cherished the calf in their hearts. Tell them (O Muhammad). \"If indeed you are believers, yours is a strange Faith that enjoins you to do such evil things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Children of Israel) when We made a covenant with you, raised Mount Tur (Sinai) above you, and told you to receive devotedly what We had revealed to you and to listen to it, you said that you had listened but you disobeyed. They denied the truth and became totally devoted and full of love for the calf. (Muhammad) tell these people, \"If, in fact, you are true believers, then what your faith commands you to do is evil.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when We made a covenant with you and raised the Mount Tur (Sinai) above you; “Accept and hold fast to what We give you, and listen”; they said, “We hear and we disobey”; and the calf was still embedded in their hearts because of their disbelief; say (O dear Prophet Mohammed – peace and blessings be upon him), “What an evil command is what your faith orders you, if you are believers!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took your covenant and We raised above you the Mount (saying), \"Hold firmly to what We have given you and hear (Our Word).\" They said, \"We have heard and disobeyed.\" And their hearts absorbed (the worship of) the calf because of their disbelief. Say: \"Worst indeed is that which your faith enjoins on you if you are believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a covenant with you and raised the mountain over you: Take hold of what We have given you with firmness and be obedient. They said: We hear and disobey. And they were made to imbibe (the love of) the calf into their hearts on account of their unbelief. Say: Evil is that which your belief bids you if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took compact with you, and raised over you the Mount: 'Take forcefully what We have given you and give ear.' They said, 'We hear, and rebel'; and they were made to drink the Calf in their hearts for their unbelief. Say: 'Evil is the thing your faith bids you to, if you are believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made with you a covenant and caused the Mount to tower above you, (saying): Hold fast by that which We have given you, and hear (Our Word), they said: We hear and we rebel. And (worship of) the calf was made to sink into their hearts because of their rejection (of the covenant). Say (unto them): Evil is that which your belief enjoineth on you, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We made a covenant with you and raised the mountain above you saying, \"Hold firmly to what We have given you and listen,\" you said, \"We hear, but we disobey,\" and their hearts were filled with the love of the calf, because of their refusal to acknowledge the truth. Say, \"Evil is that to which your faith enjoins you if you are indeed believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We took your bond and raised over you the Tur, saying: hold fast to that which We have vouchsafed unto you and hearken. They said: we hear and we disobey. And into their hearts the calf was made to sink because of their infidelity. Say thou: vile is that which your belief commandeth you, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took covenant with you and raised the Mount above you, [declaring], ‘Hold on with power to what We have given you, and do listen!’ They said, ‘We hear, and disobey,’ and their hearts had been imbued with [the love of] the Calf, due to their unfaith. Say, ‘Evil is that to which your faith prompts you, should you be faithful!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We took your covenant and We raised above you (the towering height) of Mount (Sinai): (Saying): \"Hold firmly to what We have given you, and hearken (to the Law)\": They said:\" We hear, and we disobey:\" And they had to drink into their hearts (of the taint) of the calf because of their Faithlessness. Say: \"Vile indeed are the behests of your Faith if ye have any faith!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took your covenant and We raised above you the Mount (saying), \"Hold firmly to what We have given you and hear (Our Word). They said, \"We have heard and disobeyed.\" And their hearts absorbed (the worship of) the calf because of their disbelief. Say: \"Worst indeed is that which your faith enjoins on you if you are believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We made a covenant with you and raised the Mount above you (saying): 'Take what We have given you forcefully and hear' they replied: 'We hear, but disobey' For their disbelief, they were made to drink the calf into their very hearts. Say: 'Evil is your belief that orders you to (worship the calf), if you are indeed believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a covenant with you, and raised the Mount above you: “Take what We have given you firmly, and listen.” They said, “We hear and disobey.” And their hearts became filled with the love of the calf because of their disbelief. Say, “Wretched is what your faith commands you to do, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We took your covenant and raised over you the mount, [saying], \"Take what We have given you with determination and listen.\" They said [instead], \"We hear and disobey.\" And their hearts absorbed [the worship of] the calf because of their disbelief. Say, \"How wretched is that which your faith enjoins upon you, if you should be believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:93] And when We made a covenant with you, to act according to what is in the Torah, and raised over you the Mount, to drop it on you, when you had refused to accept it; We said, ‘Take forcefully, seriously and with effort, what We have given you, and listen’, to what you have been commanded, and be prepared to accept it, They said, ‘We hear, your words, and disobey’, your command; and they were made to drink the calf in their hearts, that is to say, the love of it [the golden calf] intoxicated their hearts in the way that wine does, on account of their unbelief. Say, to them: ‘Evil is that, thing, which your belief, in the Torah, enjoins on you, [in the way of] the worship of the [golden] calf, if you are believers’, in it, as you claim; meaning, you are not believers, for faith does not command that you worship the calf — their forefathers are meant here. Likewise, you do not believe in the Torah, because you have denied [the prophethood of] Muhammad (s), whereas faith in it does not command you to reject him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوفي «الكشاف» أن تكرير حديث رفع الطور هنا لما نيط به من الزيادة على ما في الآية السابقة معنى في قوله : { قالوا سمعنا وعصينا } الآية وهي نكتة في الدرجة الثانية .وقال البيضاوي إن تكرير القصة للتنبيه على أن طريقتهم مع محمد صلى الله عليه وسلم طريقة أسلافهم مع موسى وهي نكتة في الدرجة الأولى وهذا إلزام لهم بعمل أسلافهم بناءً على أن الفرع يَتْبَع أصله والولد نسخة من أبيه ، وهو احتجاج خطابي .والقول في هاته الآيات كالقول في سابقتها \\[ البقرة : 63 \\] وكذلك القول في ( البينات ) . إلا أن قوله : { واسمعوا } مراد به الامتثال فهو كناية كما تقول فلان لا يسمع كلامي أي لا يمتثل أمري إذ ليس الأمر هنا بالسماع بمعنى الإصغاء إلى التوراة فإن قوله : { خذوا ما آتيناكم بقوة } يتضمنه ابتداء لأن المراد من الأخذ بالقوة الاهتمام به وأول الاهتمام بالكلام هو سماعه والظاهر أن قوله : { خذوا ما آتيناكم بقوة } لا يشمل الامتثال فيكون قوله : { واسمعوا } دالاً على معنى جديد وليس تأكيداً ، ولك أن تجعله تأكيداً لمدلول { خذوا ما آتيناكم بقوة } بأن يكون الأخذ بقوة شاملاً لنية الامتثال وتكون نكتة التأكيد حينئذ هي الإشعار بأنهم مظنة الإهمال والإخلال حتى أكد عليهم ذلك قبل تبين عدم امتثالهم فيما يأتي ففي هذه الآية زيادة بيان لقوله في الآية الأولى : { واذكروا ما فيه } \\[ البقرة : 63 \\] .واعلم أن من دلائل النبوة والمعجزات العلمية إشارات القرآن إلى العبارات الني نطق بها موسى في بني إسرائيل وكتبت في التوراة فإن الأمر بالسماع تكرر في مواضع مخاطباتتِ موسى لملإ بني إسرائيل بقوله : اسمع يا إسرائيل ، فهذا من نكت اختيار هذا اللفظ للدلالة على الامتثال دون غيره مما هو أوضح منه وهذا مثل ما ذكرنا في التعبير بالعهد .وقوله : { قالوا سمعنا وعصينا } يحتمل أنهم قالوه في وقت واحد جواباً لقوله : { واسمعوا } وإنما أجابوه بأمرين لأن قوله : { اسمعوا } تضمن معنيين معنى صريحاً ومعنى كنائياً فأجابوا بامتثال الأمر الصريح وأما الأمر الكنائي فقد رفضوه وذلك يتضمن جواب قوله : { خذوا ما آتيناكم بقوة } أيضا لأنه يتضمن ما تضمنه { واسمعوا } وفي هذا الوجه بعد ظاهر إذ لم يعهد منهم أنهم شافهوا نبيهم بالعزم على المعصية وقيل : إن قوله : { سمعنا } جواب لقوله : { خذوا ما آتيناكم } أي سمعنا هذا الكلام ، وقوله : { وعصينا } جواب لقوله : { واسمعوا } لأنه بمعنى امتثلوا ليكون كل كلام قد أجيب عنه ويبعده أن الإتيان في جوابهم بكلمة { سمعنا } مشير إلى كونه جواباً لقوله : { اسمعوا } لأن شأن الجواب أن يشتمل على عبارة الكلام المجاب به وقوله : ليكون كل كلام قد أجيب عنه قد علمت أن جعل { سمعنا وعصينا } جواباً لقوله : { واسمعوا } يغني عن تطلب جواب لقوله : { خذوا } ففيه إيجاز ، فالوجه في معنى هذه الآية هوما نقله الفخر عن أبي مسلم أن قولهم : { عصينا } كان بلسان الحال يعني فيكون { قالوا } مستعملاً في حقيقته ومجازه أي قالوا : سمعنا وعصوا فكأن لسانهم يقول عصينا . : ويحتمل أن قولهم { عصينا } وقع في زمن متأخر عن وقت نزول التوراة بأن قالوا عصينا في حثهم على بعض الأوامر مثل قولهم لموسى حين قال لهم : ادخلوا القرية { لن ندخلها أبداً } \\[ المائدة : 24 \\] وهذان الوجهان أقرب من الوجه الأول . وفي هذا بيان لقوله في الآية الأولى : { ثم توليتم من بعد ذلك } \\[ البقرة : 64 \\] .والإشراب هو جعل الشيء شارباً ، واستعير لجعل الشيء متصلاً بشيء وداخلاً فيه ووجه الشبه هو شدة الاتصال والسريان لأن الماء أسرى الأجسام في غيره ولذا يقول الأطباء الماء مطية الأغذية والأدوية ومَركبها الذي تسافر به إلى أقطار البدن فلذلك استعاروا الإشراب لشدة التداخل استعارة تبعية قال بعض الشعراء :تغلغل حب عثمة في فؤادي ... فباديه مع الخافي يسيرتغلغل حيث لم يبلغ شراب ... ولا حزن ولم يبلغ سرورومنه قولهم أشرب الثوب الصبغ ، قال الراغب : من عادتهم إذا أرادوا مخامرة حب وبغض أن يستعيروا لذلك اسم الشراب اه . وقد اشتهر المعنى المجازي فهجر استعمال الإشراب بمعنى السقي وذكر القلوب قرينة على أن إشراب العجل على تقدير مضاف من شأن القلب مثل عبادة العجل أو تأليه العجل . وإنما جعل حبهم العجل إشراباً لهم للإشارة إلى أنه بلغ حبهم العجل مبلغ الأمر الذي لا اختيار لهم فيه كأن غيرهم أشربهم إياه كقولهم أُولِع بكذا وشُغِف .والعجلَ مفعول { أشربوا } على حذف مضاف مشهور في أمثاله من تعليق الأحكام وإسنادها إلى الذوات مثل{ حُرِّمت عليكم الميتة } \\[ المائدة : 3 \\] أي أكل لحمها . وإنما شغفوا به استحساناً واعتقاداً أنه إلههم وأن فيه نفعهم لأنهم لما رأوه من ذهب قدسوه من فرط حبهم الذهب . وقد قوي ذلك الإعجاب به بفرط اعتقادهم ألوهيته ولذلك قال تعالى : { بكفرهم } فإن الاعتقاد يزيد المعتقد توغلاً في حب معتقده .وإسناد الإشراب إلى ضمير ذواتهم ثم توضيحه بقوله : { في قلوبهم } مبالغة وذلك مثل ما يقع في بدل البعض والاشتمال وما يقع في تمييز النسبة . وقريب منه قوله تعالى : { إنما يأكلون في بطونهم ناراً } \\[ النساء : 10 \\] وليس هو مثل ما هنا لأن الأكل متمحض لكونه منحصراً في البطن بخلاف الإشراب فلا اختصاص له بالقلوب .وقوله : { قل بئسما يأمركم به إيمانكم إن كنتم مؤمنين } تذييل واعتراض ناشىء عن قولهم { سمعنا وعَصَيْنا } هو خلاصة لإبطال قولهم : { نؤمن بما أنزل علينا } \\[ البقرة : 91 \\] بعد أن أبطل ذلك بشواهد التاريخ وهي قوله : { قل فلم تقتلون أنبئاء الله } \\[ البقرة : 91 \\] وقوله : { ولقد جاءكم موسى بالبينات } وقوله : { قالوا سمعنا وعصينا } ولذلك فَصَله عن قوله : { قل فلم تقتلون أنبئاء الله } لأنه يجري من الأول مجرى التقرير والبيان لحاصله ، والمعنى قل لهم إن كنتم مؤمنين بما أنزل عليكم كما زعمتم يعني التوراة فبئسما أمركم به هذا الإيمان إذ فعلتم ما فعلتم من الشنائع من قتل الأنبياء ومن الإشراك بالله في حين قيام التوراة فيكم فكيف وأنتم اليوم لا تعرفون من الشريعة إلا قليلاً ، وخاصة إذا كان هذا الإيمان بزعمهم يصدهم عن الإيمان بمحمد صلى الله عليه وسلم فالجملة الشرطية كلها مقول { قل } والأمر هنا مستعمل مجازاً في التسبب .وإنما جعل هذا مما أمرهم به إيمانهم مع أنهم لم يدعوا ذلك لأنهم لما فعلوه وهم يزعمون أنهم متصلبون في التمسك بما أنزل إليهم حتى أنهم لا يخالفونه قيد فتر ولا يستمعون لكتاب جاء من بعده فلا شك أن لسان حالهم ينادي بأنهم لا يفعلون فعلاً إلا وهو مأذون فيه من كتابهم ، هذا وجه الملازمة وأما كون هذه الأفعال مذمومة شنيعة فذلك معلوم بالبداهة فأنتج ذلك أن إيمانهم بالتوراة يأمرهم بارتكاب الفظائع وهذا ظاهر الكلام والمقصود منه القدح في دعواهم الإيمان بالتوراة وإبطال ذلك بطريق يستنزل طائرهم ويرمي بهم في مهواة الاستسلام للحجة فأظهر إيمانهم المقطوع بعدمه في مظهر الممكن المفروض ليتوصل من ذلك إلى تبكيتهم وإفحامهم نحو : { قل إن كان للرحمن من ولد فأنا أول العابدين } \\[ الزخرف : 81 \\] ولهذا أضيف الإيمان إلى ضميرهم لإظهار أن الإيمان المذموم هو إيمانهم أي الذي دخله التحريف والاضطراب لما هو معلوم من أن الإيمان بالكتب والرسل إنما هو لصلاح الناس والخروج بهم من الظلمات إلى النور فلا جرم أن يكون مرتكبو هاته الشنائع ليسوا من الإيمان بالكتاب الذي فيه هدى ونور في شيء فبطل بذلك كونهم { مؤمنين } وهو المقصود فقوله : { بئسما يأمركم } جواب الشرط مقدم عليه أو { قل } دليل الجواب ولأجل هذا جيء في هذا الشرط بإن التي من شأن شرطها أن يكون مشكوك الحصول وينتقل من الشك في حصوله إلى كونه مفروضاً كما يفرض المحال وهو المراد هنا؛ لأن المتكلم عالم بانتفاء الشرط ولأن المخاطبين يعتقدون وقوع الشرط فكان مقتضى ظاهر حال المتكلم أن لا يؤتى بالشرط المتضمن لكونهم { مؤمنين } إلا منفياً ومقتضى ظاهر حال المخاطب أن لا يؤتى به إلا مع إذا ولكن المتكلم مع علمه بانتفاء الشرط فرضه كما يفرض المحال استنزالاً لطائرهم .وفي الإتيان بإن إشعار بهذا الفرض حتى يقعوا في الشك في حالهم وينتقلوا من الشك إلى اليقين بأنهم غير مؤمنين حين مجيء الجواب وهو { بئسما يأمركم } وإلى هذا أشار صاحب «الكشاف» كما قاله التفتزاني وهو لا ينافي كون القصد التبكيت لأنها معان متعاقبة يفضي بعضها إلى بعض فمن الفرض يتولد التشكيك ومن التشكيك يظهر التبكيت .ولا معنى لجعل { إن كنتم مؤمنين } ابتداء كلام وجوابه محذوفاً تقديره فإيمانكم لا يأمركم بقتل الأنبياء وعبادة العجل إلخ لأنه قطع لأواصر الكلام وتقدير بلا داع مع أن قوله : { قل بئسما يأمركم به إيمانكم } إلخ يتطلبه مزيد تطلب ونظائره في آيات القرآن كثيرة . على أن معنى ذلك التقدير لا يلاقي الكلام المتقدم المثبت أن إيمانهم أمَرهم بهذا المذام فكيف ينفي بَعْد ذلك أن يكون إميانهم يأمرهم؟و { بئسما } هنا نظير بئسما المتقدم في قوله : { بئسما اشتروا به أنفسهم } \\[ البقرة : 90 \\] سوى أن هذا لم يؤت له باسممٍ مخصوص بالذم لدلالة قوله : { وأشربوا في قلوبهم العجل بكفرهم } والتقدير بئسما يأمركم به إيمانكم عبادةُ العجل .\n\n",
      "translations": [
        {
          "translation": "(And when We made with you a covenant) when we took your consent (and caused the Mount to tower above you) extracted it, elevated it and fixed it above your heads: (Hold fast by that which We have given you) be diligent and earnest with what We have given you of the Book, (and hear) obey what you have been commanded, (they said: We hear and rebel) it is as if they were saying: if it were not for the mountain we would have heard your saying and disobeyed your command. (And (worship of) the calf was made to sink into their hearts) their love of worshipping the calf sank into their hearts (because of their rejection) as a punishment for their disbelief. (Say (unto them)) Muhammad! If love of worshipping the calf is equal in your eyes to love of your Creator, then: (Evil is that which your belief enjoineth on you) the worship of the calf enjoins on you, (if ye are believers) if you are truthful that your forefathers were believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَأُشْرِبُواْ فِي قُلُوبِهِمُ ٱلْعِجْلَ } قالَ زَيدُ بن علي عليهما السلامُ\n معناهُ سُقوا حُبَّ العِجْلِ، حتى غلبَ ذَلِكَ عليهم، وخلصَ إِلى قلوبِهِمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of the Almighty: {And drink in their hearts the {ijl}} said Zayd ibn Ali peace be upon him\n\n\nThis means that they should strive to love camel racing, until it overcomes them, and they are drawn to it with their hearts.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n اذكر لهم نيابة عنا وقت { إِذْ أَخَذْنَا } منكم أيها الناقضون لعهودنا والمنكرون لكتابنا { مِيثَاقَكُمْ } الذي واثقكم معنا ثم استثقلتموه وتركتموه { وَ } ألجأناكم على إيفائه بأن { رَفَعْنَا فَوْقَكُمُ ٱلطُّورَ } معلقاً وقلنا لكم استعلاءً وتجبراً { خُذُواْ } وامتثلوا { مَآ ءَاتَيْنَٰكُم } على نبيكم من الأوامر والنواهي { بِقُوَّةٍ } جدٍ واجتهادٍ { وَٱسْمَعُواْ } من المعارف والحقائق بسمع الرضا ونية الكشف { قَالُواْ } ظاهراً: { سَمِعْنَا } ما أمرتنا به { وَ } قالوا خفية: { عَصَيْنَا } عن الامتثال بها { وَ } سبب عصيانهم أنهم لدناءتهم وسخافة طبعهم { أُشْرِبُواْ } تداخلوا وتجبلوا وتطيبوا { فِي قُلُوبِهِمُ } التي هي محل الإيمان والتوحيد منازل العرفان واليقين { ٱلْعِجْلَ } أي: محبة العجل المسترذل والمستقبح المستحدث من حليهم ما هي إلا { بِكُفْرِهِمْ } بالله وبكتبه ورسله وحصرهم ظهرو الحق في مظهر مخصوص\n ومع ذلك يدعون الإيمان بموسى { قُلْ } لهم يا أكمل الرسل تقريعاً لهم على وجه التعريض: { بِئْسَمَا يَأْمُرُكُمْ بِهِ إِيمَانُكُمْ } من إنكار كتب الله وتكذيب رسلهم وقتلهم بغير حق واعتقادهم الشريك لله { إِنْ كُنْتُمْ } صادقين في كونكم { مُّؤْمِنِينَ } [البقرة: 93]\n\n\nثم لما اشتهر بين الناس قولهم: لن يدخل الجنة إلا من كان هوداً\n وامتنع كثير من الناس القاصدين دين الإسلام وتغمم ضعفاء المسلمين أيضاً من هذا الكلام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { إن كنتم }: شرط حذف جوابه، أي: إن كنتم مؤمنين فبئس ما يأمركم به إيمانكم. يقول الحقّ جلّ جلاله: { و } اذكروا أيضاً { إذ أخذنا ميثاقكم } أن تعملوا بالتوراة فأبيتم { ورفعنا فوقكم } جبل { الطور } وقلنا: { خذوا ما آتيناكم بقوة } واجتهاد { واسمعوا } ما أقول لكم فيه { قالوا } بلسان حالهم: { سمعنا } قولك { وعصينا } أمرك، حيث لم يمتثلوا، أو بلسان المقال لسوء أدبهم، { وأُشربوا في قلوبهم } حب { العجل } حتى صبغ فيها ورسخ رسوخ الصبغ في الثوب، لأنهم كانوا مُجَسِّمَةً، ولم يروا منظراً أعجب من العجل الذي صنعه السامري، { قل } لهم يا محمد: { بئسما يأمركما به إيمانكم } بالتوراة الذي ادعيتموه، { إن كنتم مؤمنين } ، لكن الإيمان لا يأمر بهذا فلستم مؤمنين. الإشارة: يقول الحقّ جلّ جلاله لمن ادعى كمال الإيمان، وهو منكر على أهل الإحسان، مع إقامته على عوائد نفسه، وكونه محجوباً بشهود حسه: وإذا أخذنا ميثاقكم، بأن تجاهدوا نفوسكم، وتخرقوا عوائدكم لتدخلوا حضرة ربكم، ورفعنا فوق رؤوسكم سيوف التخويف، أو جبال التشويق، وأوضحنا لكم سواء الطريق، وقلنا لكم: خذوا ما آتيناكم من خرق العوائد، واكتساب الفوائد، بجد واجتهاد، فأبيتم وعزَّت عليكم نُفوسكم، وقلتم بلسان حالكم: سمعنا وعصينا، وأشربت قلوبكم حب العاجلة، وآثرتم الدنيا على الآخرة، بئسما يأمركم به إيمانكم إن كنتم مؤمنين.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:63",
      "similarity": 0.7650145848068245
    },
    {
      "verse": "4:154",
      "similarity": 0.46083931951103435
    },
    {
      "verse": "52:1",
      "similarity": 0.42159339017168274
    },
    {
      "verse": "71:14",
      "similarity": 0.41385806889326615
    },
    {
      "verse": "28:46",
      "similarity": 0.37163507926959993
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002093.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002093.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:93.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}