{
  "chapter": "البقرة",
  "text": "قل ان كانت لكم الدار الءاخرة عند الله خالصة من دون الناس فتمنوا۟ الموت ان كنتم صدقين",
  "translations": [
    {
      "translation": "Say, 'If the abode of the akhira with Allah is for you alone, to the exclusion of all others, then long for death if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"If you think you alone will abide with God to the exclusion of the rest of Mankind, in the mansions of the world to come, then wish for death if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"If the abode of the Hereafter with Allah is exclusively reserved for you and not for the rest of mankind, then you should long for death, if you arc sincere in your claim.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"If your claim is true that the home with God in the everlasting life hereafter is for you alone, you should have a longing for death\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “If the abode of the Hereafter in the sight of Allah is for you alone and none else, then long for death if you are truthful!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to (them): \"If the abode of the Hereafter with Allah is indeed for you especially and not for others of mankind, then long for death if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If the future abode with Allah is specially for you to the exclusion of the people, then invoke death if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If the Last Abode with God is yours exclusively, and not for other people, then long for death -- if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them): If the abode of the Hereafter in the providence of Allah is indeed for you alone and not for others of mankind (as ye pretend), then long for death (for ye must long for death) if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If God's abode of the Hereafter is for you alone, to the exclusion of all others, then wish for death, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if for you alone is the abode of the Hereafter with Allah to the exclusion of mankind, then wish for death if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If the abode of the Hereafter were exclusively for you with Allah, and not for other people, then long for death, should you be truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the last Home, with Allah, be for you specially, and not for anyone else, then seek ye for death, if ye are sincere.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to (them): \"If the home of the Hereafter with Allah is indeed for you specially and not for others, of mankind, then long for death if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If the abode of the Everlasting Life is with Allah for you especially, to the exclusion of all other people, then long for death if you are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If the Final Home with God is yours alone, to the exclusion of all other people, then wish for death if you are sincere.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"If the home of the Hereafter with Allah is for you alone and not the [other] people, then wish for death, if you should be truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:94] Say, to them: ‘If the Abode of the Hereafter, that is, Paradise, with God is purely yours, that is, exclusively, and not for other people, as you allege, then long for death — if you speak truly’ (here both conditionals are connected to the verb tamannū, ‘long for’, so that the first is dependent upon the second, in other words, ‘If you speak truly when you claim that it is yours, then you will naturally incline to what is yours, and since the path to it is death, long for it [death]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإبطال لدعوى قارة في نفوسهم اقتضاها قولهم : { نؤمن بما أنزل علينا } \\[ البقرة : 91 \\] الذي أرادوا به الاعتذار عن إعراضهم عن دعوة محمد صلى الله عليه وسلم بعذر أنهم متصلبون في التمسك بالتوراة لا يعدونها وأنهم بذلك استحقوا محبة الله إياهم وتكون الآخرة لهم فلما أبطلت دعوى إيمانهم بما أنزل عليهم بإلزامهم الكذب في دعواهم بسند ما أتاه سلفهم وهم جدودهم من الفظائع مع أنبيائهم والخروج عن أوامر التوراة بالإشراك بالله تعالى بعبادة العجل ، عقب ذلك بإبطال ما في عقائدهم من أنهم أهل الانفراد برحمة الله ما داموا متمسكين بالتوراة وأن من خالفها لا يكون له حظ في الآخرة ، وارتكب في إبطال اعتقادهم هذا طريقة الإحالة على ما عقدوا عليه اعتقادهم من الثقة بحسن المصير أو على شكهم في ذلك فإذا ثبت لديهم شكهم في ذلك علموا أن إيمانهم بالتوراة غير ثابت على حقه وذلك أشد ما يفت في أعضادهم ويسقط في أيديهم لأن ترقب الحظ الأخروي أهم ما يتعلق به المعتقد المتدين فإن تلك هي الحياة الدائمة والنعيم المقيم .وقد قيل : إن هذه الآية رد لدعوى أخرى صدرت من اليهود تدل على أنهم يجعلون الجنة خاصة بهم مثل قولهم نحن { أبناء الله وأحباؤه } \\[ المائدة : 18 \\] وقولهم { لن يدخل الجنة إلا من كان هوداً } \\[ البقرة : 111 \\] ، وإلى هذا مال القرطبي والبيضاوي ، وعليه فيكون ذكر الرد عليهم بينا لمجرد المناسبة في رد معتقد لهم باطل أيضاً لا في خصوص الغرض المسوق فيه الآيات المتقدمة بناءً على أن الآيات لا يلزم أن تكون متناسبة تمام المناسبة ، ونحن لا نساعد على ذلك فعلى هذا الوجه تكون هاته الآية هنا نزلت مع سوابقها للرد على أقوالهم المتفرقة المحكية في آيات أخرى وإنما اتصلت مع الآيات الراجعة إلى رد دعواهم الإيمان بما أنزل عليهم للمناسبة بجمع رد جميع دعاويهم ولكن فيما ذكرناه غنية . وأيّاً ما كان فهذه الآية تحدت اليهود كما تحدى القرآن مشركي العرب بقوله : { فأتوا بسورة من مثله } \\[ البقرة : 23 \\] . وإنما فصلت هاته الجملة عما قبلها لاختلاف السياق لأن هذه الآية إلقاء حجة عليهم والآيات السابقة تفظيع لأحوالهم وإن كان في كل من ذلك احتجاج لكن الانتقال من أسلوب إلى أسلوب كان محسناً للفصل دون العطف لا سيما مع افتتاح الاحتجاج بقل .والكلام في { لكم } مشعر بأن المراد من الدار الآخرة نعيمها و { لكم } خبر { كانت } قدم للحصر بناء على اعتقادهم كتقديمه في قول الكميت يمدح هشاماً بن عبد الملك حين عفا عنه من قصيدة :لكم مسجداً الله المزوران والحصى ... لكم قبضة من بين أثري وأقتراو { عند الله } ظرف متعلق بكانت والعندية عندية تشريف وادخار أي مدخرة لكم عند الله وفي ذلك إيذان بأن الدار الآخرة مراد بها الجنة .وانتصب { خالصة } على الحال من اسم ( كان ) ولا وجه لتوقف بعض النحاة في مجيء الحال من اسم ( كان ) . ومعنى الخالصة السالمة من مشاركة غيركم لكم فيها فهو يؤول إلى معنى خاصة بكم .وقوله : { من دون الناس } دون في الأصل ظرف للمكان الأقرب من مكان آخر غير متصرف وهو مجاز في المفارقة فلذلك تدل على تخالف الأوصاف أو الأحوال ، تقول هذا لك دون زيد أي لاحق لزيد فيه فقوله : { من دون الناس } توكيد لمعنى الاختصاص المستفاد من تقديم الخبر ومن قوله : { خالصة } لدفع احتمال أن يكون المراد من الخلوص الصفاء من المشارك في درجاتهم مع كونه له حظ من النعيم . والمراد من الناس جميع الناس فاللام فيه للاستغراق لأنهم قالوا : { لن يدخل الجنة إلا من كان هوداً } \\[ البقرة : 111 \\] .وقوله : { فتمنوا الموت } جواب الشرط ووجه الملازمة بين الشرط وهو أن الدار الآخرة لهم وجزائه وهو تمني الموت أن الدار الآخرة لا يخلص أحد إليها إلا بالروح حين تفارق جسده ومفارقة الروح الجسد هو الموت فإذا كان الموت هو سبب مصيرهم إلى الخيرات كان الشأن أن يتمنوا حلوله كما كان شأن أصحاب النبيء صلى الله عليه وسلم كما قال عمير بن الحمام رضي الله عنه :جرياً إلى الله بغير زاد ... إلا التقى وعملَ المعادوارتجز جعفر بن أبي طالب يوم غزوة مؤتة حين اقتحم على المشركين بقوله :يا حبذا الجنةُ واقترابُها ... طيبة وبارد شرابهاوقال عبد الله بن رواحة عند خروجه إلى غزوة مؤتة ودعا المسلمون له ولمن معه أن يردهم الله سالمين :لكني أسأل الرحمان مغفرةً ... وضربةً ذات فرغ تقذف الزبداأو طعنةً من يدي حران مُجهِزة ... بحربة تُنفِذُ الأحشاءَ والكبداحتى يقولوا إذا مروا على جدثي ... أرشدك الله من غاز وقد رشدا\n\n",
      "translations": [
        {
          "translation": "(Say (unto them): If the abode of the Hereafter) i.e. Paradise (in the providence of Allah is indeed for you alone) specifically for you alone (and not for others of mankind) and not for the believers in Muhammad and his Companions ((as you pretend), then long for death (for ye must long for death)) ask for death (if ye are truthful) in your claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أشار سبحانه إلى دفعه مخاطباً لرسوله معكم: { قُلْ } لهم نيابة عنا يا أكمل الرسل: { إِن كَانَتْ } محصورة مسلمة { لَكُمُ ٱلدَّارُ ٱلآخِرَةُ عِندَ ٱللَّهِ } التي هي منازل الشهداء والسعداء ومقام العرفاء والأمناء { خَالِصَةً } خاصة مخصوصة { مِّن دُونِ } شركة { ٱلنَّاسِ } المنسوبين إلى الأديان الأخر { فَتَمَنَّوُاْ } عن صميم القلب ومحض الرغبة { ٱلْمَوْتَ } المقرب لكم إليها والموصل إلى لذائذها\n كما ينتمناه خلص المؤمنين بوحدانية الله في أكثر أوقاتهم\n\n\nقال المرتضى كرم الله وجهه: \" لابن أبي طالب أشوق إلى الموت من الطفل بثدي أمه \" \n وقال أيضاً: \" لا أبالي سقطت على الموت أو سقط الموت عليَّ \" \n وقال أيضاً:\nوقال عمار رضي الله عنه حين استشهد: \" الآن ألقى الأحبة محمداً وصحبه \" وأنتم أيضاً تمنون الموت المقرب { إِن كُنْتُمْ صَادِقِينَ } [البقرة: 94] في دعواكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { خالصة } خبر كان\n و { عند } متعلق بكان على الأصح\n يقول الحقّ جلّ جلاله: { قل } يا محمد لبني إسرائيل الذين ادعوا أن الجنة خاصة بهم: { إن كانت لكم الدار الآخرة عند الله } أي: في غيبه\n { خالصة } لكم { من دون } سائر { الناس } \n أو من دون المسلمين\n { فتمنوا الموت إن كنتم صادقين } في اختصاصكم بهم\n فإن العبد إذا تحقق أنه صائر إليها اشتاق إلى الموت الذي يوصل إليها\n كما قال عمار رضي الله عنه عند موته:\nوقال حذيفة رضي الله عنه حين احتضر: جَاءَ حَبِيبٌ عَلَى فَاقَة\n لاَ أَفْلَحَ مَنْ نَدِم\n أي: على التمني\n أو على الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:24",
      "similarity": 0.5434153093796341
    },
    {
      "verse": "3:143",
      "similarity": 0.5351855204319188
    },
    {
      "verse": "38:46",
      "similarity": 0.5302994672110296
    },
    {
      "verse": "56:58",
      "similarity": 0.5268303021705224
    },
    {
      "verse": "53:20",
      "similarity": 0.4843311865015529
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/002094.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/002094.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/2:94.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}