{
  "chapter": "الروم",
  "text": "فسبحن الله حين تمسون وحين تصبحون",
  "translations": [
    {
      "translation": "So glory be to Allah when you start the night and when you greet the day.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So extol God when the evening comes and the day dawns,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify Allah in the evening and the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory belongs to God all the time, in the evening and in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So proclaim the Purity of Allah when you witness the night and the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify Allah, when you enter the evening, and when you enter the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore glory be to Allah when you enter upon the time of the evening and when you enter upon the time of the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glory be to God both in your evening hour and in your morning hour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glory be to Allah when ye enter the night and when ye enter the morning -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify God in the evening and in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So hallow Allah when ye enter the night and when ye enter the morning, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify Allah when you enter evening and when you rise at dawn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (give) glory to Allah, when ye reach eventide and when ye rise in the morning;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify Allah [above all that (evil) they associate with Him (O believers)], when you come up to the evening [i.e. offer the (Maghrib) sunset and ('Isha') night prayers], and when you enter the morning [i.e. offer the (Fajr) morning prayer].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, exalt Allah when you enter the evening and in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify God when you retire at night, and when you rise in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So exalted is Allah when you reach the evening and when you reach the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:17] So glory be to God — in other words, [so] glorify God, meaning: perform prayer — when you enter the [time of the] night, in which there are two prayers, the sunset one (maghrib) and the later night one (‘ishā’), and when you rise in the morning, in which there is the morning prayer (subh).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So glory be to Allah) so pray to Allah (when ye enter the night) the prayers of Maghrib and 'Isha' (and when ye enter the morning) the prayer of Fajr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَسُبْحَانَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ ٱلْحَمْدُ فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ } قال الإِمامُ زيد بن علي عليهما السّلامُ: التسبيحُ في هذه الآيةِ الصلواتُ الخمسِ\n فحينَ تُمْسونَ: صَلاةُ المَغربِ، وصَلاةُ العِشاءِ الآخرةِ\n وحين تُصْبحونَ: صلاةُ الفَجرِ",
      "translations": [
        {
          "translation": "\nThe Almighty said: {So exalt [ Allah ] when you come [to the evening] and when you enter the morning. And His is the praise in the heavens and the earth - and [in] the afternoon and when you come to the time when the day begins to decline.} Imam Zayd ibn Ali, peace be upon him, said: \"The Tasbih in this verse is the five prayers.\"\n\n\nWhen you pray: the prayer of the sunset, and the prayer of the last night.\n\n\nWhen you wake up, pray the fajr prayer.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى أسباب النجاة والخلاص عن الوعيدات الأخروية، ونيل لذاتها ومتنزهاتها الروحانية، فقال: { فَسُبْحَانَ ٱللَّهِ } أي: سبحوا الله الواحد الأحد الصمد، المنزه عن شوائب النقص وسمات الكثرة مطلقاً أيها الأحرار المتوجهون نحو في السرائر والإعلان، سيما { حِينَ تُمْسُونَ } وتدخلون في المساء الذي هو أول وقت الفراغ عن الشواغل الجمسانية، وفتح باب الخلوة مع الله، والعزلة عن أسباب الكثرة مطلقاً { وَحِينَ تُصْبِحُونَ } [الروم: 17] وتدخلون في الصباح الذي هو نهاية مرتبة خلوتكم مع ربكم، فاغتنموا الفرصة فيه، وتعرضوا للنسمات المهبة بأنواع النفحات من قِبَل الرحمن\n\n\n\n\nوبعدما تزودوا بأنواع الفتوحات الروحانية في تلك الساعة الشريفة التي هي البرزخ بين اللذائذ الروحانية والجسمانية فاشتغلوا بالأشغال الجسمانية المتعلقة لتدبير المعاش النفساني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" فسبحان \": مصدر لمحذوف، أي: سبحوا سبحان\n وحين: متعلق بذلك المحذوف، وجملة: وله الحمد: معترضة بين معطوفات الظروف\n وفي السموات: حال من الحمد، أي: وله، على عباده، الحمد كائناً في السموات\n\n\n إلخ\n يقول الحق جل جلاله: { فسبحانَ اللهِ } أي: فسبّحوا الله ونزّهوه تنزيهاً يليق به في هذه الأوقات التي تظهر قدرته، وتجدد فيها نعَمه، وهي { حينَ تُمسون } تدخلون في المساء { وحين تُصبحون } تدخلون في الصباح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:48",
      "similarity": 0.07324258711815944
    },
    {
      "verse": "37:174",
      "similarity": 0.055355042979429205
    },
    {
      "verse": "56:84",
      "similarity": 0.05522365224438062
    },
    {
      "verse": "37:148",
      "similarity": 0.05516979120530785
    },
    {
      "verse": "26:218",
      "similarity": 0.05497554462099721
    }
  ]
}