{
  "chapter": "الروم",
  "text": "الله يبدؤا۟ الخلق ثم يعيده ثم اليه ترجعون",
  "translations": [
    {
      "translation": "Allah originates creation, then will regenerate it, then you will be returned to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God originates creation, and then will revert it, then you will go back to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah creates in the first instance and will later repeat it. Thereafter it is to Him that you shall be sent back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God begins the creation then causes it to turn back and to Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah initiates the creation, then will create it again – then it is to Him that you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah originates the creation, then He will repeat it, then to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah originates the creation, then reproduces it, then to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God originates creation, then brings it back again, then unto Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah produceth creation, then He reproduceth it, then unto Him ye will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God originates the creation, and shall repeat it, then to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah originateth the creation, then He shall restore it, then unto Him ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah originates the creation, then He will bring it back, then you will be brought back to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who begins (the process of) creation; then repeats it; then shall ye be brought back to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah (Alone) originates the creation, then He will repeat it, then to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah originates creation, then brings it back again, then to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God originates creation, and then repeats it. Then to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah begins creation; then He will repeat it; then to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:11] God originates creation, in other words, He produces the creation of mankind, then He will reproduce it, that is, the creation of them, after their death, then to Him you shall be returned (read turja‘ūna; or yurja‘ūna, ‘they shall be returned’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاللَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ثُمَّ إِلَيْهِ تُرْجَعُونَ (11)استئناف ابتدائي ، وهو شروع فيما أُقيمت عليه هذه السورة من بسط دلائل انفراد الله تعالى بالتصرف في الناس بإيجادهم وإعدامهم وبإمدادهم وأطوار حياتهم ، لإبطال أن يكون لشركائهم شيء من التصرف في ذلك . فهي دلائل ساطعة على ثبوت الوحدانية التي عمُوا عنها .وإذا كان نزول أول السورة على سبب ابتهاج المشركين لتغلب الفرس على الروم فقطع الله تطاولهم على المسلمين بأن أخبر أن عاقبة النصر للروم على الفرس نصراً باقياً ، وكان مثار التنازع بين المشركين والمؤمنين ميل كل فريق إلى مقاربه في الدين جُعل ذلك الحدثُ مناسبة لإفاضة الاستدلال في هذه السورة على إبطال دين الشرك .وقد فُصِّلت هذه الدلائل على أربعة استئنافات متماثلة الأسلوب ، ابتُدىء كل واحد منها باسم الجلالة مُجْرى عليه أخبار عن حقائق لا قِبَل لهم بدحضها لأنهم لا يسعهم إلا الإقرار ببعضها أو العجز عن نقض دليلها .فالاستئناف الأول المبدوء بقوله { الله يبدأ الخلق ثم يعيده } ، والثاني المبدوء بقوله { الله الذي خلقكم ثم رزقكم } \\[ الروم : 40 \\] ، والثالث المبدوء بقوله { الله الذي يرسل الرياح } \\[ الروم : 48 \\] ، والرابع المبدوء بقوله : { الله الذي خلقكم من ضعف } \\[ الروم : 54 \\] .فأما قوله : { الله يبدأ الخلق ثم يعيده } فاستدلال بما لا يسعهم إلا الاعتراف به وهو بدء الخلق إذ لا ينازعون في أن الله وحدَه هو خالق الخلق ولذلك قال الله تعالى { أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم } \\[ الرعد : 16 \\] الآية . وأما قوله { ثم يعيده } فهو إدماج لأنه إذا سُلم له بدء الخلق كان تسليم إعادته أولى وأجدر . وحسن موقع الاستئناف وروده بعد ذكر أمم غابرة وأمم حاضرة خلف بعضها بعضاً ، وإذ كان ذلك مِثالاً لإعادة الأشخاص بعد فنائها وذُكر عاقبة مصير المكذبين للرسل في العاجلة ، ناسب في مقام الاعتبار أن يقام لهم الاستدلال على إمكان البعث ليقع ذكر ما يعقبه من الجزاء موقع الإقناع لهم .وتقديم اسم الجلالة على المسند الفعلي لمجرد التقوّي . و { ثم } هنا للتراخي الرتبي كما هو شأنها في عطف الجمل ، وذلك أن شأن الإرجاع إلى الله أعظم من إعادة الخلق إذ هو المقصد من الإعادة ومن بدءْ الخلق . فالخطاب في { ترجعون } للمشركين على طريقة الالتفات من الغيبة إلى الخطاب .وقرأ الجمهور { ترجعون } بتاء الخطاب . وقرأه أبو عمرو وأبو بكر عن عاصم وروح عن يعقوب بياء الغيبة على طريقة ما قبله .\n\n",
      "translations": [
        {
          "translation": "(Allah produceth creation) from a sperm drop, (then He reproduceth it) on the Day of Judgement, (then unto Him ye will be returned) in the Hereafter and then He will requite each according to his works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الله يبدأ الخلق } بإظهار الفرس على الروم { ثم يُعِيدَه } بإظهار الروم على الفرس { ثم إليه ترجعون } بالفناء فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يستهزئ أولئك المسرفون مع الله ورسله وآياته النازلة من عنده\n إذ { ٱللَّهُ } المستقل بالتصرف في ملكه وملكوته { يَبْدَؤُاْ ٱلْخَلْقَ } ويبدع المخلوقات من كتم العدم بلا سبق مادة وزمان\n ويظهر في فضاء الوجود\n ثمَّ يميته ويعدمه { ثُمَّ يُعِيدُهُ } حياً كذلك في النشأة الأخرى بعد انقراض النشأة الأولى { ثُمَّ } بعد العرض وتنقيد الأعمال { إِلَيْهِ تُرْجَعُونَ } [الروم: 11] رجوع الأمواج إلى البحر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { الله يَبدأُ الخلقَ } ينشئهم\n { ثم يُعيده } يحييهم بعد الموت\n { ثم إليه تُرْجَعونَ } للجزاء بالثواب والعقاب\n والالتفات إلى الخطاب للمبالغة في إثباته\n وقرأ أبو عمرو وسهل وروح: بالغيب\n على الأصل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:13",
      "similarity": 0.8956884508595235
    },
    {
      "verse": "29:19",
      "similarity": 0.7650881519074937
    },
    {
      "verse": "34:49",
      "similarity": 0.7534540659285807
    },
    {
      "verse": "30:27",
      "similarity": 0.6740972919676936
    },
    {
      "verse": "10:34",
      "similarity": 0.6578846495696341
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}