{
  "chapter": "الروم",
  "text": "ثم كان عقبة الذين اسـوا۟ السواى ان كذبوا۟ بـايت الله وكانوا۟ بها يستهزءون",
  "translations": [
    {
      "translation": "Then the final fate of those who did evil will be the Worst because they denied Allah's Signs and mocked at them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore evil was the end of those who did evil, for they denied the signs of God and made fun of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil was the end of those evil-doers, for they gave the lie to Allah's Signs and scoffed at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The end of the evil-doers was terrible, for they had rejected the revelations of God and mocked them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the fate of those who committed evil to the extreme was that they denied the signs of Allah and used to mock at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then evil was the end of those who did evil, because they denied the Ayat of Allah and made a mockery of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then evil was the end of those who did evil, because they rejected the communications of Allah and used to mock them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the end of those that did evil was evil, for that they cried lies to the signs of God and mocked at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then evil was the consequence to those who dealt in evil, because they denied the revelations of Allah and made a mock of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the end of those who committed evil was evil, for they belied the signs of God, and they derided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the end of those who committed evil was evil, for they belied the signs of Allah and they were wont to mock at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the fate of those who committed misdeeds was that they denied the signs of Allah and they used to deride them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the long run evil in the extreme will be the End of those who do evil; for that they rejected the Signs of Allah, and held them up to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then evil was the end of those who did evil, because they belied the Ayat (proofs, evidences, verses, lessons, signs, revelations, Messengers, etc.) of Allah and made mock of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil was the end of the harmdoers, because they belied the verses of Allah and mocked at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, evil was the end of those who committed evil. That is because they rejected God’s revelations, and used to ridicule them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the end of those who did evil was the worst [consequence] because they denied the signs of Allah and used to ridicule them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:10] Then the consequence for those who committed evil was evil (al-sū’ā is the feminine form of al-aswa’, ‘the worst’; [it may be read as] the predicate of kāna if one reads ‘āqibatu, in the nominative; or it is the subject of kāna if read as ‘āqibata, in the accusative; and so what is meant is Hell [in the former reading], or [according to the latter reading] simply their evil actions) because they denied the signs of God, the Qur’ān, and made a mock of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then evil) the Fire in the Hereafter (was the consequence) the reward (to those who dealt in evil) those who associated partners with Allah, (because they denied the revelations of Allah) Muhammad (pbuh) and 457 the Qur'an (and made a mock of them) and because they derided the revelations of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ كَانَ } بعدما تمادوا في الغفلة والعصيان، وتكذيب الرسل، والاستكبار على عباد الله وأنواع الإساءة مع رسله { عَاقِبَةَ ٱلَّذِينَ أَسَاءُواْ } مع الله ورسوله والمؤمنين { ٱلسُّوۤأَىٰ } أي: الخصلة الذميمة والعاقبة الوخيمة المترتبة على إساءتهم في الأخرى جزاء ما كانوا عليها في الأولى، كل ذلك بواسطة { أَن كَذَّبُواْ بِآيَاتِ ٱللَّهِ } وأنكروا عليها، واستخفوا بها ولمن أُنزلت عليه { وَكَانُواْ } من غاية عتوهم واستكبارهم { بِهَا يَسْتَهْزِئُونَ } [الروم: 10] ويستسخرون، ونسبون إليها ما لا يليق بشأنها افتراءً ومراءً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم كان عاقبةُ الذي أساءوا } بالكفر والمعاصي { السُّوأى } أي: العقوبة السوأى، والأصل: ثم كان عاقبتهم، فوضع الظاهر موضع المضمر للدلالة على ما اقتضى أن تكون تلك عاقبتهم، وهو إساءتهم\n والمعنى: أنهم عوقبوا في الدنيا بالدمار، ثم كان عاقبتهم في الآخرة العقوبة التي هي أسوأ العقوبات، وهي النار التي أُعدت للكافرين\n لأجل { أن كذَّبوا } أو: بأن كذَّبوا { بآيات الله } الدالة على صدق رسله، أو: على وحدانيته\n { وكانوا بها يستهزؤون } حيث قابلوها بالتكذيب، أو: غفلوا عن التفكر فيها\n أو: ثم كان عاقبة الذين اقترفوا الخطيئة السُّؤاى أن طبع الله على قلوبهم، حتى كذّبوا بالآيات، واستهزءوا بها\n أو: ثم كان عاقبة الذين فعلوا الفعلة السوأى، وهو أن كذّبوا واستهزءوا، أن يلحقهم ما تعجز عنه نطاق العبارة، فخبر كان، على هذا: محذوف للتهويل\n وأن كذبوا: بيان، أو: بدل من السوأى\n والله تعالى أعلم\n الإشارة: السير إلى الله على أقسام: سَيْرُ النفوس: بإقامة عبادة الجوارح لطلب الأجور، وسَيْرُ القلوب: بجَولاَنها في ميادين الأغيار، للتبصر والاعتبار، طلباً للحضور، وسير الأرواح: بجولان الفكرة في ميادين الأنوار طلباً لرفع الستور ودوام الحضور، وسير الأسرار: الترقي في أسرار الجبروت، بعد التمكن من شهود أنوار الملكوت على سبيل الدوام\n\n\nقال القشيري: سَيْرُ النفوس في أوطان الأرض ومناكبها لأداء العبادات، وسَيْرُ القلوب بجَوَلاَن الفكْر في جميع المخلوقات، وغايته: الظَّفَرُ بحقائق العلوم التي تُوجبُ ثلج الصدور - ثم تلك العلوم علىدرجات - وسَيْرُ الأرواح في ميادين الغيب: بِنَعْتِ خَرْقِ سُرَادِقَات الملكوت\n وقُصَاراه: الوصولُ إلى ساحل الشهود، واستيلاء سلطان الحقيقة\n وسَيْرُ الأسرار: بالترقي - أي: الغيبة - عن الحِدْثان بأَسْرها، والتحقق، أولاً، بالصفات، ثم بالخمود، بالكلية، عمَّا سوى الحق\n هـ\n وقال في قوله: { ثم كان عاقبة الذين أساؤوا السُّوأى }: من زَرَعَ الشوكَ لم يحصدُ الوَرْدَ، ومَنْ استنبت الحشيش لم يقطف البهار، ومَنْ سَلَكَ سبيل الغيّ لم يَحْلُلْ بساحة الرشد\n هـ\n ثم ذكر شأن البعث الذي هو عاقبة المسيء والمحسن، فقال: { ٱللَّهُ يَبْدَأُ ٱلْخَلْقَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:11",
      "similarity": 0.6280663566815472
    },
    {
      "verse": "43:7",
      "similarity": 0.6033143543026903
    },
    {
      "verse": "26:6",
      "similarity": 0.5978245505920957
    },
    {
      "verse": "21:36",
      "similarity": 0.5377926400657914
    },
    {
      "verse": "18:106",
      "similarity": 0.5148118543421949
    }
  ]
}