{
  "chapter": "الروم",
  "text": "وله الحمد فى السموت والارض وعشيا وحين تظهرون",
  "translations": [
    {
      "translation": "Praise be to Him in the heavens and the earth, in the afternoon and when you reach midday.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For His is the praise in the heavens and the earth, -- and at nightfall and the time of noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is all praise in the heavens and in the earth; (and glorify Him) in the afternoon and when the sun begins to decline.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all the thanks giving which takes place in the heavens and the earth, in the evenings and the noontime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And only His is the praise in the heavens and the earth – and before the day ends and at noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His is all the praise in the heavens and the earth; and in `Ashiyya and when Tuzhirun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs praise in the heavens and the earth, and at nightfall and when you are at midday.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the praise in the heavens and earth, alike at the setting sun and in your noontide hour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him be praise in the heavens and the earth! - and at the sun's decline and in the noonday.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and praise be to Him in the heavens and on the earth, and glorify Him in the late afternoon, and at midday.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His is all praise in the heavens and the earth! --and at the sun's decline and when ye enter the noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all praise in the heavens and the earth, at nightfall and when you enter noontime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea, to Him be praise, in the heavens and on earth; and in the late afternoon and when the day begins to decline.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His is all the praises and thanks in the heavens and the earth, and (glorify Him) in the afternoon (i.e. offer 'Asr prayer) and when you come up to the time, when the day begins to decline (i.e. offer Zuhr prayer). (Ibn 'Abbas said: \"These are the five compulsory congregational prayers mentioned in the Quran).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the praise in the heavens and the earth, at the setting sun and at noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the praise in the heavens and on earth, and in the evening, and when you reach midday.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him is [due all] praise throughout the heavens and the earth. And [exalted is He] at night and when you are at noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:18] And to Him belongs [all] praise in the heavens and the earth — a parenthetical statement, in other words, the inhabitants in both of these [realms] praise Him — and as the sun declines (wa-‘ashiyyan is a supplement to hīna, ‘when’ [of the previous verse]), in which comes the afternoon prayer (‘asr), and when you enter noontime, in which comes the midday prayer (zuhr).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Him be praise in the heavens and the earth) gratitude and obedience is incumbent upon the inhabitants of the heavens and the earth! (and at the sun's decline) the 'Asr prayer (and in the noonday) which is the Zuhr prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n { وَعَشِيّاً } صلاةُ العَصرِ\n وحينَ تُظْهُرون: صلاةُ الظُّهر\n\n",
      "translations": [
        {
          "translation": "\n\nAnd {in the afternoon} is the prayer of {Asr}.\n\n\nWhen you show yourselves, the noon prayer is due.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لكم أيها المتوجهون نحو الحق أن تحمدوه وتشكروا نعمه، وتداوموا على أداء حقوق كرمه في خلال أيامكم ولياليكم، سيما طرفي النهار؛ إذ { لَهُ ٱلْحَمْدُ } والثناء الصادر عن ألسنة جميع ما { فِي ٱلسَّمَٰوَٰتِ وَ } ما في { ٱلأَرْضِ } من المظاهر التي لمع عليها برق الوجود، وانبسطت أظلال شمس الذات وأضواؤها { وَ } لا سيما { عَشِيّاً } إذ هو وقت مصون عن الكثرة { وَحِينَ تُظْهِرُونَ } [الروم: 18] أيضاً؛ إذ فيها يحصل الفراغ عن أمور المعاش غالباً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وله الحمدُ في السماوات والأرض } أي: وله، على المميّزين كلّهم، من أهل السموات والأرض، أن يحمدوه، { وعشيّاً } أي: وسبحوه عشياً آخر النهار، { وحين تُظْهِرُون } تدخلون في وقت الظهيرة\n قال البيضاوي: وتخصيص التسبيح بالمساء والصباح لأن آثار العظمة والقدرة فيهما أظهر، تخصيص الحمد بالعشي - الذي هو آخر النهار، من عشى العين إذ نقص نورها - والظهيرة - التي هي وسطه لأن تجدد النعم فيها أكثر\n ويجوز أن يكون { عَشِيّاً } معطوف على { حين تُمسون } ، وقوله: { وله الحمد\n\n } إلخ - اعتراضاً\n وعن ابن عباس: الآيةُ جامعة للصلوات الخمس، تُمسون: صلاتا المغرب والعشاء، تصبحون: صلاة الفجر، وعشياً: صلاة العصر، وتُظهرون صلاة الظهر\n ولذلك زعم الحسن أنها مَدَنِيَّةٌ لأنه كان يقول: كان الواجب عليه بمكة ركعتين، في أي وقت اتفقت، وإنما فرضت الخمس بالمدينة\n والأكثر على أنها فرضت بمكة\n هـ\n ثم ذكر وجه استحقاقه للحمد والتنزيه بقوله: { يُخرج الحيَّ من الميت } ، الطائر من البيضة، والإنسان من النطفة، أو: المؤمن من الكافر، والعالم من الجاهل\n { ويُخرج الميتَ من الحيّ } ، البيضة من الطائر، والنطفة من الإنسان، أو: الكافر من المؤمن، والجاهل من العالم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:55",
      "similarity": 0.45912063536131487
    },
    {
      "verse": "38:18",
      "similarity": 0.41686224484441176
    },
    {
      "verse": "52:48",
      "similarity": 0.3919809009071158
    },
    {
      "verse": "40:46",
      "similarity": 0.3906457395170405
    },
    {
      "verse": "12:16",
      "similarity": 0.3883107035791738
    }
  ]
}