{
  "chapter": "الروم",
  "text": "يخرج الحى من الميت ويخرج الميت من الحى ويحى الارض بعد موتها وكذلك تخرجون",
  "translations": [
    {
      "translation": "He brings forth the living from the dead and brings forth the dead from the living and brings the earth to life after it was dead. In the same way you too will be brought forth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings the living from the dead, the dead from the living, and quickens the earth after it had died. So will you be brought forth (from the dead).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead and brings forth the dead from the living, and revives the earth after it is dead. Likewise will you be raised to life (after you die).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead, takes out the dead from the living, and revives the earth from its death. Thus, you will all be brought back to life again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead, and brings forth the dead from the living, and He revives the earth after its death; and this how you will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings out the living from the dead, and brings out the dead from the living. And He revives the earth after its death. And thus shall you be brought out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead and brings forth the dead from the living, and gives life to the earth after its death, and thus shall you be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead, and brings forth the dead from the living, and He revives the earth after it is dead; even so you shall be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He bringeth forth the living from the dead, and He bringeth forth the dead from the living, and He reviveth the earth after her death. And even so will ye be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead and the dead from the living. He gives life to the earth after its death, and you shall be raised to life in the same way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He bringeth forth the living from the lifeless, and He bringeth forth the lifeless from the living, and He quickeneth the earth after the death thereof; and even so shall ye be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth the living from the dead, and brings forth the dead from the living, and revives the earth after its death. Likewise, you [too] shall be raised [from the dead].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who brings out the living from the dead, and brings out the dead from the living, and Who gives life to the earth after it is dead: and thus shall ye be brought out (from the dead).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings out the living from the dead, and brings out the dead from the living. And He revives the earth after its death. And thus shall you be brought out (resurrected).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings out the living from the dead, and the dead from the living. He revives the earth after its death. Likewise you shall be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings the living out of the dead, and He brings the dead out of the living, and He revives the land after it had died. Likewise you will be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings the living out of the dead and brings the dead out of the living and brings to life the earth after its lifelessness. And thus will you be brought out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:19] He brings forth the living from the dead, as in the case of the human being [who is produced] from a spermdrop and a bird from an egg, and He brings forth the dead, a sperm-drop or an egg, from the living, and He revives the earth, with vegetation, after it has died, dried out. And in such [a manner], of being brought forth, you shall be brought forth, from the graves (read [either as] the active takhrujūna, ‘you shall come forth’, or the passive tukhrajūna, ‘you shall be brought forth’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He bringeth forth the living from the dead) He brings forth living beings and animals from a sperm drop and birds from eggs and palm-trees from seeds, (and He bringeth forth the dead from the living) sperm drops from living beings and beasts and brings forth eggs from birds and seeds from palm-trees, (and He reviveth the earth after her death) after drying up and being exposed to drought. (And even so will you be brought forth) in such manner will you be quickened and brought forth from the graves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُخْرِجُ ٱلْحَيَّ مِنَ ٱلْمَيِّتِ وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَيِّ } معناه يُخْرِجُ المؤمنَ من الكَافِرِ، ويُخرِجُ الكَافر من المُؤمنِ\n وقال: يُخرِجُ الرَّجلَ وهو حيٌ من النُّطفةِ المَيتةِ\n والنَّخلةَ من النواةِ، والنُّواةَ من النَّخلةِ\n والحَبةَ من السُنبلةِ، والسُّنبلةَ من الحَبةِ\n والدجاجةَ من البَيضةِ، والبَيضةَ من الدجاجةِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {He brings the living out of the dead and brings the dead out of the living} [means] He brings the believer out of the disbeliever, and the disbeliever out of the believer.\n And he said: \"The man is { } from a dead { }.\"\n\n\n{And the nakhla from the nawa, and the nawa from the nakhla}\n\n\nAnd the grape from the vine, and the vine from the grape.\n\n\nThe chicken comes from the egg, and the egg comes from the chicken.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يتوجهون نحو الحق، ولا يديمون الميل إلأيه في أوقات حياتهم؛ إذ هو سبحانه بمقتضى لطفه وجماله { يُخْرِجُ } ويظهر بكمال قدرته { ٱلْحَيَّ } أي: ذا الحس والحركة، والإرادة التي هي أنواع الحيوانات { مِنَ ٱلْمَيِّتِ } الذي هو النطفة الجامدة { وَ } كذا { يُخْرِجُ } ويظهر بمقتضى قهره وجلاله { ٱلْمَيِّتَ مِنَ ٱلْحَيِّ } يعني: يعقبه الموت بالحياة، والحياة بالموت { وَ } من كمال قدرته { يُحْي ٱلأَرْضَ } بأنواع النضارة والبهاء { بَعْدَ مَوْتِهَا } أي: يبسها وجمودها { وَكَذَلِكَ } أي: مثل إعادة الحياة النضارة للأرض وقت الربيع { تُخْرَجُونَ } [الروم: 19] من قبوركم أيها المنكرون للبعث والحشر وإعادة المعدوم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويحيي الأرضَ } بالنبات { بعد موتها } يبسها، { وكذلك تخرجون } ، والمعنى: أن الإبداء والإعادة متساويان في قدرة مَن هو قادر على إخراج الحي من الميت، وعكسه\n رُوي عن ابن عباس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال:\n\n \" من قرأ { فسبحان الله حين تمسون }\n\n إلى الثلاث آيات، وآخر سورة الصافات: { سبحان ربك رب العزة\n\n } إلخ\n\n دُبُرَ كُلّ صلاة، كتب له من الحسنات عدد نجوم السماء، وقطر الأمطار، وورق الأشجار، وتراب الأرض\n فإذا مات أجرى له بكل لفظ عشر حسنات في قبره \" \n\nنقله الثعلبي والنسفي\n وعنه - عليه الصلاة والسلام:\n\n \" مَن قَالَ حِينَ يُصْبِحُ: { فسُبْحَانَ الله حِينَ تُمْسُونَ }\n\n\n إلى قوله: { وكذلك تخرجون } أدْرَكَ ما فَاتَهُ في يوْمِهِ، ومن قاله حين يُمْسِي أَدْرَكَ مَا فَاتَهُ فِي لَيْلَتِهِ \" \n\nرواه ابو داود\n وقال الضحاك: من قال: { فسبحان الله حين تمسون\n\n } إلخ كان له كعدل مائتي رقبة من ولد إسماعيل\n هـ\n زاد كعب: ولم يفته خَيْرٌ كان في يومه، ولا يدركه شر كان فيه\n\n\nوإن قالها في السماء فكذلك\n وكان إبراهيم الخليل عليه السلام يقرها ست مرات في كل يوم وليلة\n هـ\n الإشارة: أما وجه الأمر بالتنزيه حين المساء والصباح فلأنَّ المجوس كانوا يسجدون للشمس في هذين الوقتين تسليماً وتوديعاً، فأمر الحق تعالى المؤمنين أن ينزهوه عمن يستحق العبادة معه، وأما العشي فلأنه وقت غفلة الناس في جميع حوائجهم، وأما وقت الظهيرة فلأن جهنم تشتعل فيه كما في الحديث، وأمر بحمده والثناء عليه في كل وقت لما غمرهم من النِعَم الظاهرة والباطنة\n قال القشيري: فمن كان صباحُه بالله بُوركَ له في يومه، ومن كان مساؤه بالله بورك له في ليلته، وأنشدوا:\n\nشتَّان بين عبد: صباحُه مُفْتَتَحٌ بعبادته، ومساؤه مُخْتَتَمٌ بطاعته، وبين عبدٍ: صباحه مُفتتح بمشاهدته، ورواحه مختتم بعزيز رؤيته\n قلت: الأول من عامة الأبرار، والثاني من خاصة العارفين الكبار، وبقي مقام الغافلين، وهو: من كان صباحه مفتتح بهم نفسه، ومساؤه مختتم برؤية حسه، ثم ذكر احتمال الصلوات الخمس في الآية، كما تقدم - ثم قال: وأراد الحق من أوليائه أن يجددوا العبودية في اليوم والليلة خمس مرات، فيقف على بساط المناجاة، ويستدرك ما فاته بين الصلاتين من صوارف الزلات\n هـ\n وقوله تعالى: { يُخرج الحي من الميت } يُخرج الذاكر من الغافل، والغافل من الذاكر، والعارف من الجاهل، والجاهل من العارف، ويُحيي أرض النفوس باليقظة والمعرفة بعد موتها بالغفلة والجهل وكذلك تُخرجون من قبوركم على ما متم عليه من معرفة أو جهل، من يقظة أو غفلة، يموت المرء على ما عاش عليه، ويبعث على ما مات عليه\n والله تعالى أعلم\n ثم ذكر دلائل البعث والخروج، فقال: { وَمِنْ آيَاتِهِ أَنْ خَلَقَكُمْ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:25",
      "similarity": 0.7474446025812977
    },
    {
      "verse": "77:26",
      "similarity": 0.5845339519063883
    },
    {
      "verse": "36:33",
      "similarity": 0.5802279242155797
    },
    {
      "verse": "53:44",
      "similarity": 0.5691909972249422
    },
    {
      "verse": "26:81",
      "similarity": 0.5358596268232331
    }
  ]
}