{
  "chapter": "الروم",
  "text": "بل اتبع الذين ظلموا۟ اهواءهم بغير علم فمن يهدى من اضل الله وما لهم من نصرين",
  "translations": [
    {
      "translation": "However, those who do wrong pursue their whims and desires without any knowledge. Who can guide those whom Allah has led astray? They will have no helpers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet the wicked follow their own lusts without understanding. Who can show the way to those whom God allows to go astray? None will they have to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the wrong-doers follow their desires without any knowledge. Who, then, can show the way to him whom Allah lets go astray? Such shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, the unjust have followed their desires without knowledge. Who will guide those whom God has caused to go astray? No one will be their helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather the unjust followed their own desires, without knowledge; so who can guide one whom Allah has sent astray? And they do not have supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but those who do wrong follow their own lusts without knowledge. Then who will guide him whom Allah has sent astray And for such there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! those who are unjust follow their low desires without any knowledge; so who can guide him whom Allah makes err? And they shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but the evildoers follow their own caprices, without knowledge; so who shall guide those whom God has led astray? They have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but those who do wrong follow their own lusts without knowledge. Who is able to guide him whom Allah hath sent astray? For such there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And still those who are unjust follow their own desires without having any knowledge. Then who can guide those whom God has let go astray? There shall be none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! those who do wrong follow their own lusts without knowledge. Who, then, will guide him whom Allah hath sent astray? And for them there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the wrongdoers follow their own desires without any knowledge. So who will guide those whom Allah has led astray? They will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, the wrong-doers (merely) follow their own lusts, being devoid of knowledge. But who will guide those whom Allah leaves astray? To them there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but those who do wrong follow their own lusts without knowledge, Then who will guide him whom Allah has sent astray? And for such there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, the wrongdoers follow their own desires without knowledge. And who can guide those whom Allah has led astray? There shall be none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the wrongdoers follow their desires without knowledge. But who can guide whom God leaves astray? They will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who wrong follow their [own] desires without knowledge. Then who can guide one whom Allah has sent astray? And for them there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:29] Nay, but those who do evil, through idolatry, follow their own desires without any knowledge. So who will guide he whom God has led astray?, that is to say, he will have none to guide him. And they have no helpers, [no] protectors against God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but those who do wrong) those who disbelieved: the Jews and Christians and idolaters (follow their own lusts) i.e. that which they presently follow: Judaism, Christianity and idolatry (without knowledge) or proof. (Who is able to guide him) to Allah's religion (whom Allah hath sent astray) from His religion? (For such) for the Jews, Christians and idolaters (there are no helpers) no one to save them from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلِ ٱتَّبَعَ } الجاهلون { ٱلَّذِينَ ظَلَمُوۤاْ } أنفسهم بالخروج على مقتضى الآيات الواضحة\n والبراهين اللائحة { أَهْوَآءَهُمْ } الباطلة\n وآراءهم الزائغة الزائلة\n مع أن اتباعهم بها { بِغَيْرِ عِلْمٍ } فائض عليهم من المبدأ الفياض\n بل عن جهل مركوز في جبلتهم مركب مع طبيعتهم في أصل فطرتهم\n لمقتضى الشقاوة الأزلية والغباوة الفطرية الجبلية\n وإذا كان الأمر على ذلك { فَمَن يَهْدِي } ويرشد { مَنْ أَضَلَّ ٱللَّهُ } وأراد ضلاله\n وأثبته في لوح قضائه وحضرة علمه من جملة الضالين وزمرة الجاهلين { وَمَا لَهُمْ } بعدما نفذ القضاء على شقاوتهم وضلالهم { مِّن نَّاصِرِينَ } [الروم: 29] ينصروهم\n ويرشدونهم إلى سبيل الهداية وطريق السعادة والرشاد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { بل اتَّبعَ الذين ظلموا } أنفسهم بالشرك { أهواءَهم بغير علمٍ } \n أي: تبعوا أهواءهم\n جاهلين\n ولو كان لهم عِلْمٌ لَرُجِيَ أن يزجرهم\n { فمن يهدي من أضل الله }؟ اي: لا هادي له قط\n { وما لهم من ناصرين } يمنعونهم من العذاب\n أو: يَحْفُظونهم من الضلالة\n أو: من الإقامة فيها\n الإشارة: ما قيل في الشرك الجلي يجري مثله في الشرك الخفي فأن الحق تعالى غيور\n لا يُحب العمل المشترك\n ولا القلب المشترك\n العمل المشترك لا يقبله\n والقلب المشترك لا يُقبل عليه\n وأنْشَدُوا:\nفكما أنك لا ترضى من عبدك أن يُحب غيرك\n ويخضع له\n كذلك الحق تعالى\n لا يرضى منكُ أن تميل لغيره\n قال القشيري\n قوله: { بل اتبع الذين ظلموا أهواءهم }: أشدُّ الظلم متابعةُ الهوى لأنه قريب من الشِّرْكِ\n قال الله تعالى:\n[ الجاثية: 23]\n ومن اتَّبع هواه خالف رضا مولاه\n فهو\n بوضع الشيء في غير موضعه\n صار ظالماً\n كما أن العاصي\n بوضع المعصية في موضع الطاعة\n صار ظالماً\n كذلك بمتابعة هواه\n بَدَلاً عن موافقة ومتابعة رضا مولاه\n صار في الظلم متمادياً\n هـ\n ثم أمر بالتوحيد الخالص المقصود من ضرب المثل\n فقال: { فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً فِطْرَتَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:50",
      "similarity": 0.7051152880614854
    },
    {
      "verse": "6:56",
      "similarity": 0.557703845156261
    },
    {
      "verse": "2:145",
      "similarity": 0.540339663773105
    },
    {
      "verse": "101:9",
      "similarity": 0.49625466325138384
    },
    {
      "verse": "23:71",
      "similarity": 0.4948491436197821
    }
  ]
}