{
  "chapter": "الروم",
  "text": "وهو الذى يبدؤا۟ الخلق ثم يعيده وهو اهون عليه وله المثل الاعلى فى السموت والارض وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "It is He who originated creation and then regenerates it. That is very easy for Him. His is the most exalted designation in the heavens and the earth. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who first creates and then reverts it. This is how His law works inevitably. His semblance is of the most sublime in the heavens and the earth. He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who creates in the first instance and it is He Who will repeat the creation, and that is easier for Him. His is the loftiest attribute in the heavens and the earth. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who begins the creation, then, turns it back. For Him this is very easy. All the exalted attributes in the heavens and the earth belong to Him. He is the Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who initiates the creation, and will then create it again – and this, according to you, should be easier for Him! And for Him only is the Supreme Majesty in the heavens and the earth; and only He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who originates the creation, then He will repeat it; and this is easier for Him. His is the highest description in the heavens and in the earth. And He is the All-Mighty, the All-Wise.) Allah says:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who originates the creation, then reproduces it, and it is easy to Him; and His are the most exalted attributes in the heavens and the earth, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who originates creation, then brings it back again, and it is very easy for Him. His is the loftiest likeness in the heavens and the earth; He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who produceth creation, then reproduceth it, and it is easier for Him. His is the Sublime Similitude in the heavens and the earth. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the One who originates creation, then repeats it, and it is very easy for Him. His is the most exalted state in the heavens and on the earth; He is the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is who originateth the creation, then shall restore it, and it is easier for Him. His is the most exalted similitude in the heavens and in the earth; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who originates the creation, and then He will bring it back—and that is more simple for Him. His is the loftiest description in the heavens and the earth, and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who begins (the process of) creation; then repeats it; and for Him it is most easy. To Him belongs the loftiest similitude (we can think of) in the heavens and the earth: for He is Exalted in Might, full of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who originates the creation, then will repeat it (after it has been perished), and this is easier for Him. His is the highest description (i.e. none has the right to be worshipped but He, and there is nothing comparable unto Him) in the heavens and in the earth. And He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who originates the creation, and then brings it back again, that is easier for Him. For Him is the Highest Example in the heavens and earth He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who initiates creation, and then repeats it, something easy for Him. His is the highest attribute, in the heavens and the earth. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who begins creation; then He repeats it, and that is [even] easier for Him. To Him belongs the highest attribute in the heavens and earth. And He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:27]   And He it is Who initiates the creation, of mankind, then brings it back, after their destruction, and that is [even] easier for Him, than the initiation — from the perspective of those addressed for whom to repeat something is easier than doing it for the first time — otherwise, in God’s case, exalted be He, both are just as easy. His is the loftiest description in the heavens and the earth, the most sublime attribute, namely that ‘there is no god except God’. And He is the Mighty, in His kingdom, the Wise, in His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who produceth creation) from a sperm drop, (then reproduceth it) revives the person on the Day of Judgement (and it is easier for Him) bringing people to life after they die is as easy for Him and creating them in the first place. (His is the Sublime Similitude in the heavens and in the earth) He says: He has the most sublime attribute in His power over the dwellers of the heavens and the earth. (He is the Mighty) in His kingdom and dominion, (the Wise) in His command and decree. 459\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ أَهْوَنُ عَلَيْهِ } معناه ذلك هينٌ عليهِ\n وقال: وهو أهونُ عندكم لأن الإعادةَ أهونُ عِندكُم مِن الابتداءِ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And it is easier for Him}, its meaning is that it is easy for Him.\n And he said: \"It is easier for you, because the return is easier for you than the beginning.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا ينقادون ويطيعون لحكه أولئك المسخرون لصولجان قضائه، وقلم تقديره { هُوَ ٱلَّذِي يَبْدَؤُاْ } ويظهر { ٱلْخَلْقَ } من كتم العدم في فضاء الوجود بمقتضى اللطف والجود، ثمَّ يعدمه ويميته بمقتضى قهره وجلاله أيضاً فيها { ثُمَّ يُعِيدُهُ } أيضاً على ما يشئه في النشأة الأخرى إظهاراً لكمال قدرته ومقتضى حكمته؛ كي يظهر مصلحة الإبداء والإبراز في النشأة الأولى، وفائدة ما يترتب عليها في النشأة الأخرى يوم العرض والجزاء { وَ } أهل الأهواء والآراء الباطلة ينكرون الإعادة، مع أنه { هُوَ } أي: الإظهار بعد الإعدام { أَهْوَنُ } وأسهل { عَلَيْهِ } سبحانه بالنسبة إلى عقولهم السخيفة، وأحلامهم الضعيفة من الإبداء والإبداع لا عن شيء وبلا سبق مادة، وإن كانت نسبة قدرته وإرادته سبحانه إلى كل ما دخل في حيطة حضرة علمه وخبرته على السواء؛ إذ\n\n[الملك: 3] وكرر النظر\n\n[الملك: 3] وفتور في مبدعات الحق ومخترعاته؟!\n\n\n\n\n{ وَ } كيف يتفاوت دون قدرته الأشياء؛ إذ { لَهُ ٱلْمَثَلُ ٱلأَعْلَىٰ } واليد الطولى، والتصرف التام، والاقتدار العام الشامل لكل ما لاح عليه برق الوجود سواء كان { فِي ٱلسَّمَٰوَٰتِ } أي: العلويات التي هي عالم الأسماء والصفات باعتبار التنزؤلات من مرتبته الأحدية، والعماء التي لا يسع فيه إدراك مدرك وخيرة خبير { وَٱلأَرْضِ } أي: السلفيات التي هي هالم الهيولي والطبيعة القابلة لأن تنعكس منها أشعة أنواع العلويات المتفاوتة حسب تفاوت الشئون والتطورات المرتبة على الأسماء والصفات المتخالفة المتكثرة حسب التجليات الحِبِّية الإلهية؟! { وَ } كيف لا يكون له سبحانه المثل الأعلى؛ إذ { هُوَ ٱلْعَزِيزُ } الغالب في ذاته، حيث تفردت بوجوب الوجود، ودوام البقاء المنيع فناء على سرادقات سطوته وسلطنته عن شوب النقص والقصور مطلقاً { ٱلْحَكِيمُ } [الروم: 27] المقتن في أفعاله وآثاره بالاستقلال على مقتضى حيطة حضرة علمه الكامل بجميع وجوه الكمالات اللائقة لكل ذرة من ذرائر الكائنات؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الذي يبدأ الخلق ثم يُعيده } أي: يُنشئهم ثم يعيدهم للبعث، { وهو } أي: البعث { أهونُ } أيسر { عليه } عندكم لأن الإعادة عندكم أسهل من الإنشاء، فلِمَ أنكرتم الإعادة، مع إقراركم بأن الإنشاء منه تعالى؟ وقال الزجاج وغيره: أهون بمعنى \" هيّن \" كقوله:\n\n[النساء: 30]، كما قالوا: أكبر، بمعنى كبير\n والإعادة في نفسها عظيمة ولكنها هُوّنت بالقياس إلى الإنشاء إذ هو أهون عند الخلق من الإنشاء لأن قيامهم بصيحة واحدة أسهل من كونهم نُطفاً، ثم عُلقاً، ثم مضغاً، إلى تكميل خلقهم\n قاله النسفي\n { وله المَثَلُ الأعلى في السماوات والأرض } أي: الوصف الأعلى، الذي ليس لغيره، وقد عُرف به، ووُصف في السموات والأرض، على ألسنة الخلائق وألسنة الدلائل، وهو أنه القادر الذي لا يعجز عن شيء من إنشاءٍ وإعادة، وغيرهما من المقدورات، { وهو العزيزُ } أي: القاهر لكل مقدور، { الحكيم } الذي يجري كل فعل على قضايا حكمته وعلمه\n وعن ابن عباس: المثل الأعلى هو:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:11",
      "similarity": 0.6740972919676933
    },
    {
      "verse": "85:13",
      "similarity": 0.66322206727551
    },
    {
      "verse": "29:19",
      "similarity": 0.6054202229306602
    },
    {
      "verse": "34:49",
      "similarity": 0.5824267781724435
    },
    {
      "verse": "10:34",
      "similarity": 0.5290317090003109
    }
  ]
}