{
  "chapter": "الروم",
  "text": "ومن ءايته ان تقوم السماء والارض بامره ثم اذا دعاكم دعوة من الارض اذا انتم تخرجون",
  "translations": [
    {
      "translation": "Among His Signs is that heaven and earth hold firm by His command. Then, when He calls you forth from the earth, you will emerge at once.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that the heavens and the earth stay in position by His command; and then when He will call you once you will come out of the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that the sky and the earth stand firm by His command. Then no sooner than He summons you out of the earth you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some other evidence of His existence is that both the heavens and the earth stand firm at His command. When He will call you from the earth, you will start to come out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that the heavens and the earth remain established by His command; then when He calls you – from the earth – you will thereupon emerge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that the heaven and the earth stand by His command. Then afterwards when He will call you by a single call, behold, you will come out from the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that the heaven and the earth subsist by His command, then when He calls you with a (single) call from out of the earth, lo! you come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth stand firm by His command; then, when He calls you once and suddenly, out of the earth, lo you shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: The heavens and the earth stand fast by His command, and afterward, when He calleth you, lo! from the earth ye will emerge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is this: the heavens and the earth stand firm by His command and afterwards when He calls you, behold, from the earth you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and the earth stand fast by His command, and thereafter, when He calleth you, a call from the earth, lo! ye shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the sky and the earth stand by His command, and then, when He calls you forth from the earth, behold, you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that heaven and earth stand by His Command: then when He calls you, by a single call, from the earth, behold, ye (straightway) come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is that the heaven and the earth stand by His Command, then afterwards when He will call you by single call, behold, you will come out from the earth (i.e. from your graves for reckoning and recompense).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth stand firm at His command. And when He calls you once out of the earth, you shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and the earth stand at His disposal. And then, when He calls you out of the earth, you will emerge at once.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth remain by His command. Then when He calls you with a [single] call from the earth, immediately you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:25] And of His signs is that the heaven and the earth remain standing by His command, by His will, without any supports; then, when He calls you [to come] out of the earth, when Isrāfīl blows the Horn for the raising from the graves [to commence], lo! you shall come forth, from it alive. Thus your coming forth out of it by a call constitutes one of His [many] signs, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) of the signs of Allah's divine Oneness and power (is this: The heavens and the earth stand fast by His command) the heavens and the earth came into being by His leave, (and afterward, when He calleth you) i.e. when Allah calls you on the Day of Judgement through Seraphiel, (lo! from the earth) from the graves (you will emerge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ آيَاتِهِ } المحكمة أيضاً: { أَن تَقُومَ ٱلسَّمَآءُ وَٱلأَرْضُ بِأَمْرِهِ } يعني: من جملة آياته الظاهرة الباهرة: قيام السماء والأرض بلا عمد وأوتاد وأسانيد، وقرارها ومدارها في مكان معين بلا تبدل وتحول، إنما هو بأمره وحكمه، وعلى مقتضى إرادته ومشيئته، بحث لا يسع لهما الخروج عن أمره وحكمه أصلاً { ثُمَّ } بعدما تأملتم نفاذ حكمه سبحانه، ومضاء قضائه في معظم مخلوقاته، فلكم أن تتيقنوا { إِذَا دَعَاكُمْ } وقت إرادة إعادتكم وإحيائكم { دَعْوَةً } متضمنة لأخراجكم { مِّنَ ٱلأَرْضِ إِذَآ أَنتُمْ تَخْرُجُونَ } [الروم: 25] يعني: بعدما أسمعكم بكمال قدرته مضمون دعوته إليكم فاجأتم إلى الخروج منها أحياءً بلا تراخٍ ومهلةٍ تتميماً لسرعة نفوذ قضائه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن آياته أن تقومَ السماءُ } بغير عمد { والأرضُ } على ماء جماد { بأمره } أي: بإقامته، أو تدبيره وقدرته\n { ثم إذا دعاكم } للبعث { دعوةً من الأرض إذا أنتم تخرجون } من قبوركم\n وسبك الآية: ومن آياته قيام السماوات والأرض، واستمساكها بغير عمد، ثم إذا دعاكم دعوة واحدة، يا أهل القبور، خرجتم بسرعة\n\n\nوإنما عطف هذا بثم بياناً لعِظَم ما يكون من ذلك الأمر، وإظهار اقتداره على مثله، وهو أن يقول: يا أهل القبور، قوموا، فلا تبقى نسمة من الأولين والآخرين إلا قامت تنظر، كقوله:\n\n[الزمر:68]\n تنبيه: عبّر عن مودة الزوجين بيتكفرون لأن المودة قلبية، لا تُدْرَكُ إلا بتفكر القلب، وعبّر عن خلق السموات والأرض واختلاف الألسن والألوان بالعالِمين لأن أمر ذلك يدركه كل أحد، ممن له عقل أو علم، وعبّر عن النوم واليقظة بيسمعون لأن من كان في الغفلة لا يسمع أمثال هذه المواعظ، وإنما يسمعها مَنْ كان متيقظاً، وعبّر عن إظهار البرق، وإنزال المطر، وإحياء الأرض، بيعقلون لأن أمر البرق وما معه يبصره كل من له مسكةٌ عن عقل سليم، ويعلم أنه من الله بلا واسطة\n والله تعالى أعلم\n الإشارة: ما نُصِبَتْ هذه الكائنات لتراها، بل لترى فيها مولاها، فما هذه الأكوان الحسية إلا تجليات من تجليات الحق، ومظاهر من مظاهره، وأنوار من أنوار ملكوته، متدفقة من بحر جبروته\n كان الله ولا شيء معه، وهو الآن على ما عليه كان\n لكن لا يعرف هذا إلا العارفون بالله، وأما غيرهم فحسبهم أن يستدلوا على عظمة خالقها، وباهر قدرته وحكمته، فيقوي إيمانهم ويشتد إيقانهم\n قال في الإحياء: وبحر المعرفة لا ساحل له، والإحاطة بكنْه جلال الله محال، وكلما كثرت المعرفة بالله سبحانه، وبأفعال مملكته، وأسرار مملكته، وقويت، كثر النعيم في الآخرة وعَظُم، كما أنه كلما كثر البذر وحَسُن كثر الزعر وحَسُن، وقال أيضاً، في كتاب شرح عجائب القلب: ويكون سعة ملك العبد في الجنة بحسب سعة معرفته بالله، وبحسب ما يتجلى له من عظمة الله سبحانه، ومن صفاته وأفعاله\n هـ\n ومن آياته خلق سماوات أرواحكم، وأرض نفوسكم، لتقوم الأرواح بشهود عظمة الربوبية، والنفوس بآداب العبودية، واختلاف ألسنتكم فبعضها لا تتكلم إلا في الفَرْق، وبعضها إلا في الجمع\n وألوانكم بعضها طهر فيها سيما العارفين وبهجة المحبين وبعضها لم يظهر عليها شيء من ذلك\n ومن آياته منامكم في ليل الغفلة والبطالة، وَقْتَ غفلَتِكُمْ، وابتغاؤكم من فضله بزيادة معرفته وَقْتَ يقظتِكُمْ\n ومن آياته يُريكم البرق، أي: يُلْمِعُ عليكم أسرَار المعاني، ثم تخفى عند الاستشراف على بحر الحقيقة، خوفاً من الاصطلام والرجوع، وطمعاً في الوصول والتمكين\n ومن آياته أن تقوم الأشياء به وبأسرار ذاته، ثم إذا دعاكم دعوة من أرض القطيعة إذا أنتم تخرجون، فتعرجون بأرواحكم إلى سماء وصْلته وتمكن معرفته\n والله تعالى أعلم\n ثم برهن على كمال ملكه وعظمته، فقال: { وَلَهُ مَن فِي ٱلسَّمَاوَاتِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:109",
      "similarity": 0.3534625011108154
    },
    {
      "verse": "5:37",
      "similarity": 0.34461383896708336
    },
    {
      "verse": "45:3",
      "similarity": 0.3379856027083117
    },
    {
      "verse": "57:5",
      "similarity": 0.3303571285958784
    },
    {
      "verse": "71:18",
      "similarity": 0.324255305910746
    }
  ]
}