{
  "chapter": "الروم",
  "text": "ضرب لكم مثلا من انفسكم هل لكم من ما ملكت ايمنكم من شركاء فى ما رزقنكم فانتم فيه سواء تخافونهم كخيفتكم انفسكم كذلك نفصل الءايت لقوم يعقلون",
  "translations": [
    {
      "translation": "He has made an example for you from among yourselves. Are any of the slaves you own partners with you in what We have provided for you so that you are equal in respect of it, you fearing them the same as one another? In that way We make Our Signs clear for people who use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives you an example from your own life: Do you possess among your dependants any partners in what We have bestowed on you, so that you and they have equal (share) in it, and that you fear them as you fear each other? That is how We explain Our signs clearly for those who comprehend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sets forth for you a parable from your own lives. Do you have among your slaves some who share with you the sustenance that We have bestowed on you so that you become equals in it, all being alike, and then you would hold them in fear as you fear each other? Thus do We make plain the Signs for those who use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has told you this parable about yourselves: Could your slaves share your wealth equally with you and could you fear them as you fear yourselves? Thus, do We clarify the evidence (of the truth) for the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He illustrates an example for you from your own selves; do you have for yourselves, among the bondmen you possess, partners in the sustenance We have bestowed upon you, thereby you become equal in respect of it – you fearing them the way you fear each other? This is how We illustrate detailed signs for the people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sets forth for you a parable from yourselves: Do you have partners among those whom your right hands possess to share as equals in the wealth We have bestowed on you, whom you fear as you fear each other Thus do We explain the signs in detail to a people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sets forth to you a parable relating to yourselves: Have you among those whom your right hands possess partners in what We have given you for sustenance, so that with respect to it you are alike; you fear them as you fear each other? Thus do We make the communications distinct for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has struck for you a similitude from yourselves; do you have, among that your right hands own, associates in what We have provided for you so that you are equal in regard to it, you fearing them as you fear each other? So We distinguish the signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He coineth for you a similitude of yourselves. Have ye, from among those whom your right hands possess, partners in the wealth We have bestowed upon you, equal with you in respect thereof, so that ye fear them as ye fear each other (that ye ascribe unto Us partners out of that which We created)? Thus We display the revelations for people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sets forth for you an example taken from your own lives. Do you make your servants full partners with an equal share in the wealth We have bestowed upon you? Do you fear them as you fear each other? In this way We explain the signs to people who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He propoundeth unto you a similitude taken from yourselves. Have you, from among those whom your right hands own, partners in that wherewith We have provided you, so that ye are equal in respect thereof, and ye fear them as ye fear each other? In this wise We detail the signs for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He draws for you an example from yourselves: Do you have among your slaves any partners [who may share] in what We have provided you, so that you are equal in its respect, and you revere them as you revere one another? Thus do We elaborate the signs for people who exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He does propound to you a similitude from your own (experience): do ye have partners among those whom your right hands possess, to share as equals in the wealth We have bestowed on you? Do ye fear them as ye fear each other? Thus do we explain the Signs in detail to a people that understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sets forth for you a parable from your ownselves, - Do you have partners among those whom your right hands possess (i.e. your slaves) to share as equals in the wealth We have bestowed on you? Whom you fear as you fear each other? Thus do We explain the signs in detail to a people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sets for you an example, drawn from yourselves. Do you have from among those whom your right hand possesses associates in what We have given you, who share it equally with you? Do you fear them as you fear one another? So We made plain Our signs to a nation of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He illustrates an example for you, from your own selves: do you make your servants full partners in the wealth We have given you? Do you revere them as you revere one another? We thus explain the revelations for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He presents to you an example from yourselves. Do you have among those whom your right hands possess any partners in what We have provided for you so that you are equal therein [and] would fear them as your fear of one another [within a partnership]? Thus do We detail the verses for a people who use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:28] He has struck, He has coined, for you, O idolaters, a similitude, that is [actually drawn], from yourselves, and it is [as follows]: do you have among those whom your right hands own, that is to say, among your servants, any partners, of yourselves, [who may share] in what We have provided for you, of property and so on, so that you, and they, are equal therein, fearing them as you fear your own [folk], [just as you fear] those free men like you? (the interrogative is meant as a negation) in other words, ‘your servants are not partners of yours in what you own, so how can you make some of God’s servants partners of His. So We detail the signs, [so] We explain them in such detail, for people who understand, [a people who] reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He coineth for you) congregation of disbelievers (a similitude of yourselves) a human being like you. (Have ye, from among those whom your right hands possess) your slave boys and slave girls, (partners in the wealth We have bestowed upon you) on what We gave you of wealth, family and offspring, (equal with you) i.e. your slave boys and slave girls (in respect thereof) in that which We bestowed upon you, (so that ye fear them) you fear their rebuke (as ye fear each other) as you fear the rebuke of your fathers, sons and brothers were you not to fulfil their due rights in inheritance? They said: \"No!\" Allah said: \"Would you then accept for Me that which you do not accept for yourselves: you make My servants My partners but refuse to make your own slaves your partners?\" (Thus We display the revelations) the signs of My divine Oneness and power (for people who have sense) for people who believe in the similitudes of the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { ضَرَبَ لَكُمْ } سبحانه تبييناً وتنبيهاً { مَّثَلاً } متخذاً منتزعاً { مِّنْ أَنفُسِكُمْ } أيها المشركون المتخذون لله شركاء من مصنوعاته وعبيده\n إذ هي أقرب الأشياء إليكم\n وأوضحها عندكم { هَلْ لَّكُمْ } أيها الأحرار المتصرفون بالاستقلال في منسوباتكم متصرف آخر سواكم { مِّن مَّا مَلَكَتْ أَيْمَانُكُمْ } وحصلت من اكسابكم من العبيد والإماء الذين هم من جملة منسوابتكم\n وهل يصح ويجوز لمملوكيكم أن يكونوا\n وبعدوا { مِّن شُرَكَآءَ } معكم يتصرفون أمثالكم { فِي مَا رَزَقْنَاكُمْ } مثل تصرفكم بلا إذن منكم؟!\n\nوبالجلمة: { فَأَنتُمْ } أيها المالكون وما ملكت أيمانكم { فِيهِ } أي: في التصرف والاحتياج إلى الأموال { سَوَآءٌ } إذ هم أمثالكم\n فلأي شيء تحتاجون إليه أنتم\n وهم أيضاً محتاجون إليه بلا تفاوت ولكن { تَخَافُونَهُمْ } وتحذرون منهم أن تتصرفوا في أموالكم وأكسابكم بلا إذنٍ منكم { كَخِيفَتِكُمْ أَنفُسَكُمْ } يعني: تخافون على تضييع أموالكم\n مثل خوفكم على أنفسكم\n بل أشد من ذلك\n وبالجملة: تخافون منهم أن تساووا معكم في التصرف في أموالكم\n فلذلك منعتموهم\n ولم ترضوا بتصرفهم وشركتهم في الحطام الدنيا\n فكيف ترضون لنا شركة عبيدنا ومخلوقاتنا في ألوهيتنا وربوبيتنا\n والتصرف في ملكنا وملكوتنا أيها الغافلون المفرطون في شأننا\n والجاهلون بقدرتنا ومكانتنا؟!\n { كَذَلِكَ نُفَصِّلُ } ونوضح { ٱلآيَاتِ } أي: دلائل توحيدنا\n وبراهين وحدتنا وتفريدنا { لِقَوْمٍ يَعْقِلُونَ } [الروم: 28] ويستعملون عقولهم في تأمل الآيات\n والتدبر فيها على وجه العبرة الاستبصار\n فاعتبروا يا أولي الأبصار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ضَرَبَ لكم مثلاً } لقُبح الشرك وبشاعته\n منتزعاً { من أنفسكم } التي هي أقرب شيء إليكم\n وهو: { هل لكم } \n معَاشرِ الأحْرَارِ\n { مما ملكت أيمانُكُم } اي من عبيدكم { من شركاءَ فيما رزقناكم } من الأموال وغيرها\n فَمِنْ\n الأولى: للابتداء\n والثانية: للتبعيض\n والثالثة: مزيدة لتأكيد الاستفهام الجاري مجرى النفي\n والمعنى: هل لكم\n من بعض عبيدكم\n شرك فيما رزقناكم\n اي: هل ترضون أن يكون عبيدكم شركاء لكم\n فيما رزقناكم؟ { فأنتم فيه سواء } فتكونون أنتم وهم\n فيما رزقناكم من الأموال\n سواء يتصرفون فيه كتصرفكم\n ويحكمون فيه كحكمكم\n مع أنهم بشرٌ مثلكم\n حال كونكم { تخافونهم } أي: يستبدوا بالتصرف فيه\n { كخِيفَتِكُم أنفُسَكُم } أي: كما يخاف الأحرار بعضهم من بعض - فيما هو مشترك بينهم - أن يستبد فيه بالتصرف دونه\n أو: تخافونهم أن يقاسموكم تلك الأموال\n أو: يرثونها بعدكم\n كما تخافون ذلك من بعضكم\n فإذا لم تَرْضَوْا ذلك لأنفسكم\n فكيف ترضونه لرب الأرباب ومالك الأحرار والعبيد\n أن تجعلوا بعض عبيده له شركاء في استحقاق العبادة؟! { كذلك } \n أي: مثل هذا التفصيل البديع\n { نُفصِّلُ الآياتِ } بينهما لأن التمثيل مما يكشف المعاني ويوضحها { لقوم يعقلون } يتدبرون في ضرب الأمثال\n ويعرفون حكمها وأسرارها\n فلما لم ينزجروا أضرب عنهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:43",
      "similarity": 0.4595747186189756
    },
    {
      "verse": "2:73",
      "similarity": 0.3900003124554436
    },
    {
      "verse": "16:75",
      "similarity": 0.3470046880863644
    },
    {
      "verse": "7:174",
      "similarity": 0.30466958581208364
    },
    {
      "verse": "6:55",
      "similarity": 0.29585785661416075
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/30:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/30:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/30:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}