{
  "chapter": "الروم",
  "text": "ومن ءايته خلق السموت والارض واختلف السنتكم والونكم ان فى ذلك لءايت للعلمين",
  "translations": [
    {
      "translation": "Among His Signs is the creation of the heavens and earth and the variety of your languages and colours. There are certainly Signs in that for every being.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among other signs of His is the creation of the heavens and the earth, and the variety of your tongues and complexions. Surely there are signs in this for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is the creation of the heavens and the earth and the diversity of your tongues and colours. Indeed there are Signs in this for the wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other evidence of His existence are the creation of the heavens and the earth and the differences of languages and colors. In this there is evidence (of the truth) for the worlds (mankind).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is the creation of the heavens and the earth, and the differences in your languages and colours; indeed in this are signs for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is the creation of the heavens and the earth, and the difference of your languages and colors. Verily, in that are indeed signs for men of sound knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is the creation of the heavens and the earth and the diversity of your tongues and colors; most surely there are signs in this for the learned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and earth and the variety of your tongues and hues. Surely in that are signs for all living beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth, and the difference of your languages and colours. Lo! herein indeed are portents for men of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that He created the heavens and earth, and the diversity of your languages and colours. There truly are signs in this for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the creation of the heavens and the earth, and the variation of your languages and complexions; verily herein are signs for men of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is the creation of the heavens and the earth, and the difference of your languages and colours. There are indeed signs in that for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the creation of the heavens and the earth, and the variations in your languages and your colours: verily in that are Signs for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the creation of the heavens and the earth, and the difference of your languages and colours. Verily, in that are indeed signs for men of sound knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His signs are the creation of heavens and earth and the diversity of your tongues and colors. Surely, there are signs in this for all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth, and the diversity of your languages and colors. In this are signs for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Indeed in that are signs for those of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:22] And of His signs is the creation of the heavens and the earth and the differences of your tongues, that is, your languages, such as Arabic, non-Arabic and so on, and your colours, such as white or black or otherwise, even though [all of] you are [originally] the offspring of the same man and woman. Surely in that there are signs, indications of His power, exalted be He, for all peoples ([this may be vocalised either as] li’l‘ālamīna or li’l-‘ālimīna, so [it means] either rational creatures, or people of knowledge [respectively]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) of the signs of His divine Oneness and power (is the creation of the heavens and the earth, and the difference of your languages) Arabic, Persians and others languages (and colours) the colours of your forms: the red, the black, etc. (Lo! Herein) in the differences that I have mentioned (indeed are portents) signs (for men of knowledge) for the jinn and human beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واختلاف ألسنتكم } من لسان النفس والقلب والسرّ والروح والخفاء بكل مقال في كل مقام، فإنه لا ينحصروجوه اختلافات هذه الألسن { وألوانكم } تلوّناتكم للعلماء العارفين في مراتب علومهم { منامكم } غفلتكم في ليل النفس ونهار القلب بظهور صفاتها { وابتغاؤكم من فضله } بالترقي، فيفهمون معناه بحسب مقاماتهم في الأطوار",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً مِنْ { آيَاتِهِ } العجيبة الشأن، والبديعة البرهان: { خَلْقُ ٱلسَّمَٰوَٰتِ } وإيجاد العلويات متطابقة مترافعة مع ما فيها من الكواكب المتفاوتة في الإضاءة والإشراق على أبدع نظام، وأبلغ التئام وانتظام، بحيث لا يكتنه عند ذوي العقول، وأولي الإفهام المجبولين على الاستعلام والاستفهام، بل لاحظ لهم منها سوى الحيرة والعبرة، وأنواع الوله والهيمان { وَ } خلق { ٱلأَرْضِ } ممهدة منبسطة مشتملة على جبال راسيات، وبحار واسعات، وأنهار جاريات، وأشجار مثمرات، ومعادن وحيوانات، وأصناف من نواع الإنسان المجبول على صورة الرحمن، الجامع لأنواع التبيان والبيان، وأصناف الدلائل والبرهان؛ ليصير مرآة مجلوة يتراءى فيها صور الأسماء والصفات الإلهية، وينعكس منها شئونه وتطوراته { وَٱخْتِلاَفُ أَلْسِنَتِكُمْ } أي: لغاتكم وتكلمكم أيها المجبولون على فطرة النيابة والخلافة\n\n\n\n\n{ وَ } اختلاف { أَلْوَانِكُمْ } من السواد والبياض، وأنواع التخطيطات والتشكيلات، والهيئات الصورية والمعنوية التي اشتملت عليها هياكلكم وهوايتكم، إنما هي من آثار الأوصاف والأسماء الإلهية التي امتدت على ماهياتكم وتعيناتكم أظلالها وانبسطت { إِنَّ فِي ذٰلِكَ } الانطباق والالتصاق وأنواع الائتلاف والانتظام الواقعة في الأنفس والآفاق على أغرب الوجوه وأبدع الطرق { لآيَاتٍ } دلائل واضحات، وشواهد لائحات على كمال قدرة العليم الحكيم { لِّلْعَالِمِينَ } [الروم: 22] أي: لكل من يتأتى منه التفطن والتدبر للمبدأ والمعاد من أرباب الهداية والرشاد، والتأمل والتفكر على سبيل النظر والاستدلال من الصنائع والآثار إلى الصانع المؤثر المختار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يُريكم البرق: فيه وجهان، أحدهما: إضمار \" أن \" كما في حرف ابن مسعود، والثاني: تنزيل الفعل منزلة المصدر، كما قيل في قولهم، في المثل: \" تَسْمعَ بالمُعَيْدِيِّ خَيْرٌ من أن تراه \"\n أي: إن تسمع، أو: سماعك\n وخوفاً وطمعاً: مفعولان له على حذف مضاف، أي: إرادة خوف، وإرادة طمع، أو: على الحال، أي: خائفين وطامعين\n وإذا دعاكم: شرطية، وإذا، الثانية فجائية، نابت عن الفاء\n ومن الأرض: يتعلق بدعاكم\n يقول الحق جل جلاله: { ومن آياته } الدالة على باهر قدرته { خلقُ السماوات والأرض }\n قال القشيري: السموات في علوِّها\n والأرض في دنوِّها، هذه بنجومها وكواكبها، وهذه بأقطارها ومناكبها، هذه بشمسها وقمرها، وهذه بمائها ومدرها، واختلاف لغات أهلها في الأرض، واختلاف تسبيح الملائكة - عليهم السلام - الذين هم سكان السماء\n هـ\n { واختلافُ ألسنتكم } باختلاف اللغات، وبأجناس النطق وأشكاله، { وألوانكم } ، كالسواد والبياض وغيرهما، حتى لا تكاد تجد شخصين متوافقين إلا وبينهما نوع تخالف في اللسان واللون، وباختلاف ذلك وقع التعارفُ والتمايز، فلو توافقت وتشاكلت لوقع التجاهل والالتباس، ولتعطلت المصالح\n وفي ذلك آية بينة، حيث وُلدوا من أب واحد، وهم على كثرتهم متفاوتون\n { إن في ذلك لآيات للعالمين } بفتح اللام وكسره\n ويشهد للكسر قوله تعالى:\n\n[العنكبوت: 43]\n قال القشيري: واختصاص كلِّ شيء من هذه ببعض جائزات حكمها شاهدٌ عَدْلٍ، ودليلٌ صِدْقٍ، يناجي أفكار المستيقظين، وتنادي على أنفسها: أنها، بأجمعها، بتقدير العزيز العليم\n هـ\n\n\n{ ومن آياته منامُكُم بالليل والنهار وابتغاؤكم من فضله } ، أي منامكم بالليل، وابتغاؤكم من فضله بالنهار، أو: منامكم في الزمانين، وابتغاؤكم من فضله فيهما، وهو حسن لأنه إذا طال النهار يقع النوم فيه، وإذا طال الليل يقع الابتغاء فيه\n { إِن في ذلك لآياتٍ لقوم يسمعون } سماع تدبر، بآذان واعية\n قال القشيري: غَلَبةُ النوم لصاحبه من غير اختيار، وانتباهُه بلا اكتساب، يدلُّ على موته ثم بَعْثِهِ، ثم في حال منامه يرى ما يسرُّه وما يضرُّه يدل على حاله في قبره\n الله أعلمُ كيف حاله، في أمره، فيما يلقاه من خيره وشره\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:28",
      "similarity": 0.650276542481449
    },
    {
      "verse": "16:13",
      "similarity": 0.5866724226406497
    },
    {
      "verse": "16:69",
      "similarity": 0.3619865556752832
    },
    {
      "verse": "26:84",
      "similarity": 0.32374318882835074
    },
    {
      "verse": "35:27",
      "similarity": 0.3122617776753826
    }
  ]
}