{
  "chapter": "الروم",
  "text": "ومن ءايته منامكم باليل والنهار وابتغاؤكم من فضله ان فى ذلك لءايت لقوم يسمعون",
  "translations": [
    {
      "translation": "Among His Signs is your sleep by night and day and your seeking after His bounty. There are certainly Signs in that for people who hear.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is the night, a time for you to sleep, and the day to seek His bounty. Verily there are signs in this for those who pay heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is your sleeping at night and your seeking His Bounty during the day. Indeed there are Signs in this for those who hearken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your sleeping during the night and in the day your seeking His favors are evidence (of the truth) for the people who have hearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is your sleeping during the night and day, and your seeking His munificence; indeed in this are signs for people who heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is your sleep by night and by day, and your seeking His bounty. Verily, in that are indeed signs for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is your sleeping and your seeking of His grace by night and (by) day; most surely there are signs in this for a people who would hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is your slumbering by night and day, and your seeking after His bounty. Surely in that are signs for a people who hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is your slumber by night and by day, and your seeking of His bounty. Lo! herein indeed are portents for folk who heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs are your sleep, at night or in daytime, and your seeking His bounty. There truly are signs in this for people who hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are your sleeping by night and by day, and your seeking of His grace verily herein are signs for a people who hearken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is your sleep by night and day, and your pursuit of His bounty. There are indeed signs in that for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the sleep that ye take by night and by day, and the quest that ye (make for livelihood) out of His Bounty: verily in that are signs for those who hearken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the sleep that you take by night and by day, and your seeking of His Bounty. Verily, in that are indeed signs for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that you sleep at night and day, and seek His bounty. Surely, there are signs in this for those who hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are your sleep by night and day, and your pursuit of His bounty. In this are signs for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is your sleep by night and day and your seeking of His bounty. Indeed in that are signs for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:23] And of His signs is your sleep by night and day, by His will, as a repose for you, and your seeking, during the day, of His bounty, in other words, your going about [freely] in order to seek a living [is] by His will. Surely in that there are signs for people who listen, listening in a way so as to [be prompted to] reflect and take heed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) and of the signs of His divine Oneness and power (is your slumber) in your house (by night and by day, and your seeking of His bounty) of His provision by day. (Lo! Herein) in what I have mentioned about the day and the night (indeed are portents) signs and lessons (for folk who heed) and obey.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ آيَاتِهِ } العظام أيضاً: { مَنَامُكُم } واستراحتكم؛ تقويماً لأمزجتكم، تقويةً لقواكم { بِٱلَّيلِ وَٱلنَّهَارِ } وقت عروض الإعياء والعناء { وَٱبْتِغَآؤُكُمْ } طلبكم المعاش فيهما { مِّن فَضْلِهِ } وسعة رحمة جوده، أو على طريق اللف والنشر بأن قدر لمنامكم زمان الليل ولابتغائكم النهار { إِنَّ فِي ذَلِكَ } التقدير والتدبير المبني عن كمال العطف واللطف { لآيَاتٍ لِّقَوْمٍ يَسْمَعُونَ } [الروم: 23] دلائل توحيده سبحانه سمع قبول ورضا، ويتأملون في حكمة الحكيم المدبر لمصالح عباده، وما هو إلا صلح لهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}