{
  "chapter": "الروم",
  "text": "ومن ءايته خلق السموت والارض واختلف السنتكم والونكم ان فى ذلك لءايت للعلمين",
  "translations": [
    {
      "translation": "Among His Signs is the creation of the heavens and earth and the variety of your languages and colours. There are certainly Signs in that for every being.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among other signs of His is the creation of the heavens and the earth, and the variety of your tongues and complexions. Surely there are signs in this for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is the creation of the heavens and the earth and the diversity of your tongues and colours. Indeed there are Signs in this for the wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other evidence of His existence are the creation of the heavens and the earth and the differences of languages and colors. In this there is evidence (of the truth) for the worlds (mankind).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is the creation of the heavens and the earth, and the differences in your languages and colours; indeed in this are signs for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is the creation of the heavens and the earth, and the difference of your languages and colors. Verily, in that are indeed signs for men of sound knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is the creation of the heavens and the earth and the diversity of your tongues and colors; most surely there are signs in this for the learned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and earth and the variety of your tongues and hues. Surely in that are signs for all living beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth, and the difference of your languages and colours. Lo! herein indeed are portents for men of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that He created the heavens and earth, and the diversity of your languages and colours. There truly are signs in this for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the creation of the heavens and the earth, and the variation of your languages and complexions; verily herein are signs for men of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is the creation of the heavens and the earth, and the difference of your languages and colours. There are indeed signs in that for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the creation of the heavens and the earth, and the variations in your languages and your colours: verily in that are Signs for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the creation of the heavens and the earth, and the difference of your languages and colours. Verily, in that are indeed signs for men of sound knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His signs are the creation of heavens and earth and the diversity of your tongues and colors. Surely, there are signs in this for all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth, and the diversity of your languages and colors. In this are signs for those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Indeed in that are signs for those of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:22] And of His signs is the creation of the heavens and the earth and the differences of your tongues, that is, your languages, such as Arabic, non-Arabic and so on, and your colours, such as white or black or otherwise, even though [all of] you are [originally] the offspring of the same man and woman. Surely in that there are signs, indications of His power, exalted be He, for all peoples ([this may be vocalised either as] li’l‘ālamīna or li’l-‘ālimīna, so [it means] either rational creatures, or people of knowledge [respectively]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) of the signs of His divine Oneness and power (is the creation of the heavens and the earth, and the difference of your languages) Arabic, Persians and others languages (and colours) the colours of your forms: the red, the black, etc. (Lo! Herein) in the differences that I have mentioned (indeed are portents) signs (for men of knowledge) for the jinn and human beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واختلاف ألسنتكم } من لسان النفس والقلب والسرّ والروح والخفاء بكل مقال في كل مقام\n فإنه لا ينحصروجوه اختلافات هذه الألسن { وألوانكم } تلوّناتكم للعلماء العارفين في مراتب علومهم { منامكم } غفلتكم في ليل النفس ونهار القلب بظهور صفاتها { وابتغاؤكم من فضله } بالترقي\n فيفهمون معناه بحسب مقاماتهم في الأطوار",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً مِنْ { آيَاتِهِ } العجيبة الشأن\n والبديعة البرهان: { خَلْقُ ٱلسَّمَٰوَٰتِ } وإيجاد العلويات متطابقة مترافعة مع ما فيها من الكواكب المتفاوتة في الإضاءة والإشراق على أبدع نظام\n وأبلغ التئام وانتظام\n بحيث لا يكتنه عند ذوي العقول\n وأولي الإفهام المجبولين على الاستعلام والاستفهام\n بل لاحظ لهم منها سوى الحيرة والعبرة\n وأنواع الوله والهيمان { وَ } خلق { ٱلأَرْضِ } ممهدة منبسطة مشتملة على جبال راسيات\n وبحار واسعات\n وأنهار جاريات\n وأشجار مثمرات\n ومعادن وحيوانات\n وأصناف من نواع الإنسان المجبول على صورة الرحمن\n الجامع لأنواع التبيان والبيان\n وأصناف الدلائل والبرهان\n ليصير مرآة مجلوة يتراءى فيها صور الأسماء والصفات الإلهية\n وينعكس منها شئونه وتطوراته { وَٱخْتِلاَفُ أَلْسِنَتِكُمْ } أي: لغاتكم وتكلمكم أيها المجبولون على فطرة النيابة والخلافة\n\n\n{ وَ } اختلاف { أَلْوَانِكُمْ } من السواد والبياض\n وأنواع التخطيطات والتشكيلات\n والهيئات الصورية والمعنوية التي اشتملت عليها هياكلكم وهوايتكم\n إنما هي من آثار الأوصاف والأسماء الإلهية التي امتدت على ماهياتكم وتعيناتكم أظلالها وانبسطت { إِنَّ فِي ذٰلِكَ } الانطباق والالتصاق وأنواع الائتلاف والانتظام الواقعة في الأنفس والآفاق على أغرب الوجوه وأبدع الطرق { لآيَاتٍ } دلائل واضحات\n وشواهد لائحات على كمال قدرة العليم الحكيم { لِّلْعَالِمِينَ } [الروم: 22] أي: لكل من يتأتى منه التفطن والتدبر للمبدأ والمعاد من أرباب الهداية والرشاد\n والتأمل والتفكر على سبيل النظر والاستدلال من الصنائع والآثار إلى الصانع المؤثر المختار\n\n\n{ وَمِنْ آيَاتِهِ } العظام أيضاً: { مَنَامُكُم } واستراحتكم\n تقويماً لأمزجتكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يُريكم البرق: فيه وجهان\n أحدهما: إضمار \" أن \" كما في حرف ابن مسعود\n والثاني: تنزيل الفعل منزلة المصدر\n كما قيل في قولهم\n في المثل: \" تَسْمعَ بالمُعَيْدِيِّ خَيْرٌ من أن تراه \"\n أي: إن تسمع\n أو: سماعك\n وخوفاً وطمعاً: مفعولان له على حذف مضاف\n أي: إرادة خوف\n وإرادة طمع\n أو: على الحال\n أي: خائفين وطامعين\n وإذا دعاكم: شرطية\n وإذا\n الثانية فجائية\n نابت عن الفاء\n ومن الأرض: يتعلق بدعاكم\n يقول الحق جل جلاله: { ومن آياته } الدالة على باهر قدرته { خلقُ السماوات والأرض }\n قال القشيري: السموات في علوِّها\n والأرض في دنوِّها\n هذه بنجومها وكواكبها\n وهذه بأقطارها ومناكبها\n هذه بشمسها وقمرها\n وهذه بمائها ومدرها\n واختلاف لغات أهلها في الأرض\n واختلاف تسبيح الملائكة - عليهم السلام - الذين هم سكان السماء\n هـ\n { واختلافُ ألسنتكم } باختلاف اللغات\n وبأجناس النطق وأشكاله\n { وألوانكم } \n كالسواد والبياض وغيرهما\n حتى لا تكاد تجد شخصين متوافقين إلا وبينهما نوع تخالف في اللسان واللون\n وباختلاف ذلك وقع التعارفُ والتمايز\n فلو توافقت وتشاكلت لوقع التجاهل والالتباس\n ولتعطلت المصالح\n وفي ذلك آية بينة\n حيث وُلدوا من أب واحد\n وهم على كثرتهم متفاوتون\n { إن في ذلك لآيات للعالمين } بفتح اللام وكسره\n ويشهد للكسر قوله تعالى:\n[العنكبوت: 43]\n قال القشيري: واختصاص كلِّ شيء من هذه ببعض جائزات حكمها شاهدٌ عَدْلٍ\n ودليلٌ صِدْقٍ\n يناجي أفكار المستيقظين\n وتنادي على أنفسها: أنها\n بأجمعها\n بتقدير العزيز العليم\n هـ\n\n{ ومن آياته منامُكُم بالليل والنهار وابتغاؤكم من فضله } \n أي منامكم بالليل\n وابتغاؤكم من فضله بالنهار\n أو: منامكم في الزمانين\n وابتغاؤكم من فضله فيهما\n وهو حسن لأنه إذا طال النهار يقع النوم فيه\n وإذا طال الليل يقع الابتغاء فيه\n { إِن في ذلك لآياتٍ لقوم يسمعون } سماع تدبر\n بآذان واعية\n قال القشيري: غَلَبةُ النوم لصاحبه من غير اختيار\n وانتباهُه بلا اكتساب\n يدلُّ على موته ثم بَعْثِهِ\n ثم في حال منامه يرى ما يسرُّه وما يضرُّه يدل على حاله في قبره\n الله أعلمُ كيف حاله\n في أمره\n فيما يلقاه من خيره وشره\n هـ\n { ومن آياته يُريكُمُ البرقَ خوفاً وطمعاً } \n أي: خوفاً من الصواعق\n وطمعاً في الغيث\n أو: خوفاً للمسافر وطمعاً للحاضر\n { ويُنزّل من السماء ماءً } مطراً { فيحيي به الأرض بعد موتها إن في ذلك لآيات لقوم يعقلون }: يتفكرون بعقولهم\n { ومن آياته أن تقومَ السماءُ } بغير عمد { والأرضُ } على ماء جماد { بأمره } أي: بإقامته\n أو تدبيره وقدرته\n { ثم إذا دعاكم } للبعث { دعوةً من الأرض إذا أنتم تخرجون } من قبوركم\n وسبك الآية: ومن آياته قيام السماوات والأرض\n واستمساكها بغير عمد\n ثم إذا دعاكم دعوة واحدة\n يا أهل القبور\n خرجتم بسرعة\n\nوإنما عطف هذا بثم بياناً لعِظَم ما يكون من ذلك الأمر\n وإظهار اقتداره على مثله\n وهو أن يقول: يا أهل القبور\n قوموا\n فلا تبقى نسمة من الأولين والآخرين إلا قامت تنظر\n كقوله:\n[الزمر:68]\n تنبيه: عبّر عن مودة الزوجين بيتكفرون لأن المودة قلبية\n لا تُدْرَكُ إلا بتفكر القلب\n وعبّر عن خلق السموات والأرض واختلاف الألسن والألوان بالعالِمين لأن أمر ذلك يدركه كل أحد\n ممن له عقل أو علم\n وعبّر عن النوم واليقظة بيسمعون لأن من كان في الغفلة لا يسمع أمثال هذه المواعظ\n وإنما يسمعها مَنْ كان متيقظاً\n وعبّر عن إظهار البرق\n وإنزال المطر\n وإحياء الأرض\n بيعقلون لأن أمر البرق وما معه يبصره كل من له مسكةٌ عن عقل سليم\n ويعلم أنه من الله بلا واسطة\n والله تعالى أعلم\n الإشارة: ما نُصِبَتْ هذه الكائنات لتراها\n بل لترى فيها مولاها\n فما هذه الأكوان الحسية إلا تجليات من تجليات الحق\n ومظاهر من مظاهره\n وأنوار من أنوار ملكوته\n متدفقة من بحر جبروته\n كان الله ولا شيء معه\n وهو الآن على ما عليه كان\n لكن لا يعرف هذا إلا العارفون بالله\n وأما غيرهم فحسبهم أن يستدلوا على عظمة خالقها\n وباهر قدرته وحكمته\n فيقوي إيمانهم ويشتد إيقانهم\n قال في الإحياء: وبحر المعرفة لا ساحل له\n والإحاطة بكنْه جلال الله محال\n وكلما كثرت المعرفة بالله سبحانه\n وبأفعال مملكته\n وأسرار مملكته\n وقويت\n كثر النعيم في الآخرة وعَظُم\n كما أنه كلما كثر البذر وحَسُن كثر الزعر وحَسُن\n وقال أيضاً\n في كتاب شرح عجائب القلب: ويكون سعة ملك العبد في الجنة بحسب سعة معرفته بالله\n وبحسب ما يتجلى له من عظمة الله سبحانه\n ومن صفاته وأفعاله\n هـ\n ومن آياته خلق سماوات أرواحكم\n وأرض نفوسكم\n لتقوم الأرواح بشهود عظمة الربوبية\n والنفوس بآداب العبودية\n واختلاف ألسنتكم فبعضها لا تتكلم إلا في الفَرْق\n وبعضها إلا في الجمع\n وألوانكم بعضها طهر فيها سيما العارفين وبهجة المحبين وبعضها لم يظهر عليها شيء من ذلك\n ومن آياته منامكم في ليل الغفلة والبطالة\n وَقْتَ غفلَتِكُمْ\n وابتغاؤكم من فضله بزيادة معرفته وَقْتَ يقظتِكُمْ\n ومن آياته يُريكم البرق\n أي: يُلْمِعُ عليكم أسرَار المعاني\n ثم تخفى عند الاستشراف على بحر الحقيقة\n خوفاً من الاصطلام والرجوع\n وطمعاً في الوصول والتمكين\n ومن آياته أن تقوم الأشياء به وبأسرار ذاته\n ثم إذا دعاكم دعوة من أرض القطيعة إذا أنتم تخرجون\n فتعرجون بأرواحكم إلى سماء وصْلته وتمكن معرفته\n والله تعالى أعلم\n ثم برهن على كمال ملكه وعظمته\n فقال: { وَلَهُ مَن فِي ٱلسَّمَاوَاتِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:28",
      "similarity": 0.650276542481449
    },
    {
      "verse": "16:13",
      "similarity": 0.5866724226406497
    },
    {
      "verse": "16:69",
      "similarity": 0.3619865556752832
    },
    {
      "verse": "26:84",
      "similarity": 0.32374318882835074
    },
    {
      "verse": "35:27",
      "similarity": 0.3122617776753826
    }
  ]
}