{
  "chapter": "الروم",
  "text": "ومن ءايته يريكم البرق خوفا وطمعا وينزل من السماء ماء فيحى به الارض بعد موتها ان فى ذلك لءايت لقوم يعقلون",
  "translations": [
    {
      "translation": "Among His Signs is that He shows you lightning, a source of fear and eager hope, and sends down water from the sky, bringing the dead earth back to life by it. There are certainly Signs in that for people who use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is the lightning He shows to fill you both with dread and hope, and the water He sends down from the sky which reawakens the earth that was dead. There are indeed signs in this for those who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that He shows you lightning, arousing both fear and hope, and sends down water from the sky and revives the earth after it is dead. Indeed there are Signs in this for those who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, of the evidence of His existence are His showing you lightening which gives you fear and hope and His sending water down from the sky which revives the earth after its death. In this there is evidence (of the truth) for the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that He shows you the lightning, instilling fear and hope, and sends down water from the sky, so revives the earth after its death; indeed in this are signs for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that He shows you the lightning, for fear and for hope, and He sends down water from the sky, and therewith revives the earth after its death. Verily, in that are indeed signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that He shows you the lightning for fear and for hope, and sends down water from the clouds then gives life therewith to the earth after its death; most surely there are signs in this for a people who understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs He shows you lightning, for fear and hope, and that He sends down out of heaven water and He revives the earth after it is dead. Surely in that are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: He showeth you the lightning for a fear and for a hope, and sendeth down water from the sky, and thereby quickeneth the earth after her death. Lo! herein indeed are portents for folk who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is this: He shows you the lightning, giving rise to [both] fear and hope, and sends down water from the sky, giving life thereby to the earth after it had been lifeless: in this, behold, there are signs indeed for people who use their reason!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that he sheweth you the lightning for a fear's and for a hope, and sendeth down from the heaven water, and therewith quickeneth the earth after the death thereof; verily herein are signs for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He shows you the lightning, arousing fear and hope, and He sends down water from the sky, and with it revives the earth after its death. There are indeed signs in that for people who exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs, He shows you the lightning, by way both of fear and of hope, and He sends down rain from the sky and with it gives life to the earth after it is dead: verily in that are Signs for those who are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is that He shows you the lightning, by way of fear and hope, and He sends down water (rain) from the sky, and therewith revives the earth after its death. Verily, in that are indeed signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He shows you the lightning for fear and hope. He sends down water from the sky and with it He revives the earth after its death. Surely, in this there are signs for a nation that understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He shows you the lightning, causing fear and hope. And He brings down water from the sky, and with it He revives the earth after it was dead. In this are signs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is [that] He shows you the lightning [causing] fear and aspiration, and He sends down rain from the sky by which He brings to life the earth after its lifelessness. Indeed in that are signs for a people who use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:24] And of His signs is His showing you lightning to arouse fear, in the traveller, of storms, and hope, in the one not travelling, of [the coming of the] rain; and He sends down water from the heaven and with it He revives the earth after it has died, that is, [after] it has dried out, so that it produces vegetation [once again]. Surely in that, mentioned, there are signs for people who understand, [a people who] reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) and of the signs of His divine Oneness and power (is this: He showeth you the lightning) in the sky (for a fear) to the traveller lest the rain comes down and soak his clothes (and for a hope) for the settler lest it waters his fields, (and sendeth down water) rain (from the sky, and thereby) and by means of the rain (quickeneth the earth after her death) after drying up and being exposed to drought. (Lo! Herein) in what I mentioned about the rain (indeed are portents) signs and lessons (for folk who understand) for people who believe that it is from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يريكم } برق اللوامع والطوالع في البدايات\n خائفين من انقضاضها وخفوقها وبقائكم في الظلمة بفواتها\n وطامعين في رجوعها ومزيدكم بها\nوينّزل مياه الواردات والمكاشفات بعدها من سماء الروح وسحَاب السكينة\n فيحيي بها أراضي النفوس والاستعدادات الهامدة بعد موتها بالجهل { يعقلون } بمطاوعة نفوسهم للدواعي العقلية معاني الواردات وما يصلحهم من الحكم والمعقولات\n { وله المثل الأعلى } أي: الوصف الأعلى بالفردانية في الوجود والوحدة الذاتية\n وما أحسن قول مجاهد في معناه أنه: لا إله إلا هو\n { فأقِمْ وجهك } لدين التوحيد وهو طريق الحق تعالى\n ولذلك أطلق من غير إضافة أي: هو الدين مطلقاً وما سواه ليس بدين لانقطاعه دون الوصول إلى المطلوب\n والوجه هو الذت الموجودة مع جميع لوازمها وعوارضها\n وإقامته للدين تجريده عن كل ما سوى الحق قائماً بالتوحيد والوقوف مع الحق غير ملتفت إلى نفسه ولا إلى غيره فيكون سيره حينئذ سير الله ودينه وطريقته اللذان هو عليهما دين الله وطريقته إذ لا يرى غيره موجوداً { حنيفاً } مائلاً منحرفاً عن الأديان الباطلة التي هي طرق الأغيار والأنداد لمن أثبت غيره فأشركه بالله { فطرة الله } أي: الزموا فطرة الله\n وهي الحالة التي فطرت الحقيقة الإنسانية عليها من الصفاء والتجرّد في الأزل وهي الدين القيّم أزلاً وأبداً\n لا يتغير ولا يتبدّل عن الصفاء الأول\n ومحض التوحيد الفطري\n وتلك الفطرة الأولى ليست إلا من الفيض الأقدس الذي هو عين الذات\n من بقي عليها لم يمكن انحرافه عن التوحيد واحتاجبه عن الحق\n إنما يقع الانحراف والاحتجاب من غواشي النشأة وعوارض الطبيعة عند الخلقة أو التربية والعادة\n أما الأول فلقوله عليه السلام في الحديث الرباني:\n \" كل عبادي خلقت حنفاء فاحتالتهم الشياطين عن دينهم وأمروهم أن يشركوا بي غيري \" \nوأما الثاني فلقوله صلى الله عليه وسلم:\n \" كل مولود يولد على الفطرة حتى يكون أبواه هما اللذان يهوّدانه وينصرانه \" \n\n لا أن تتغير تلك الحقيقة في نفسها عن الحالة الذاتية فإنه محال\n وذلك معنى قوله: { لا تبديل لخلق الله ذلك الدين القَيْم ولكنّ أكثر الناس لا يعلمون } تلك الحقيقة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ } جملة { آيَاتِهِ } أيضاً: إنه سبحانه { يُرِيكُمُ ٱلْبَرْقَ } المبنئ عن هجوم البلاء ونزول المطر أيضاً\n إنما أريكم سبحانه\n ليحصل لكم { خَوْفاً } من خشية الله وحلول غضبه وعذابه { وَطَمَعاً } لنزول فضله ورحمته\n وإنما فعل سبحانه معهم كذلك\n لتكونوا دائماً خائفين من سخطه وبطشه\n راجعين من فضله وجوده { وَيُنَزِّلُ مِنَ } جانب { ٱلسَّمَآءِ مَآءً } بعدما أراكم البرق المخيف المطمع { فَيُحْيِي بِهِ } أي: بالماء النازل { ٱلأَرْضَ } اليابسة { بَعْدَ مَوْتِهَا } أي: بعد جمودها ويبسها { إِنَّ فِي ذَلِكَ } الإراءة والإخافة والإطماع\n والإنزال والإحياء { لآيَاتٍ } على حكمة القادر المختار\n المستقل في التصرف والآثار { لِّقَوْمٍ يَعْقِلُونَ } [الروم: 24] ويستعملون عقولهم في التفكر والتدبر في المصنوعات العجيبة والمخترعات البديعة الصادرة من الفاعل المطلق بالإرادة والاختيار\n\n\n{ وَمِنْ آيَاتِهِ } المحكمة أيضاً: { أَن تَقُومَ ٱلسَّمَآءُ وَٱلأَرْضُ بِأَمْرِهِ } يعني: من جملة آياته الظاهرة الباهرة: قيام السماء والأرض بلا عمد وأوتاد وأسانيد\n وقرارها ومدارها في مكان معين بلا تبدل وتحول\n إنما هو بأمره وحكمه\n وعلى مقتضى إرادته ومشيئته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:12",
      "similarity": 0.6645517178071705
    },
    {
      "verse": "75:7",
      "similarity": 0.6198858831745615
    },
    {
      "verse": "7:56",
      "similarity": 0.43500870940017533
    },
    {
      "verse": "5:84",
      "similarity": 0.4023145372042858
    },
    {
      "verse": "74:15",
      "similarity": 0.40177408964058203
    }
  ]
}