{
  "chapter": "الروم",
  "text": "ومن ءايته ان خلق لكم من انفسكم ازوجا لتسكنوا۟ اليها وجعل بينكم مودة ورحمة ان فى ذلك لءايت لقوم يتفكرون",
  "translations": [
    {
      "translation": "Among His Signs is that He created spouses for you of your own kind so that you might find tranquillity in them. And He has placed affection and compassion between you. There are certainly Signs in that for people who reflect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that He created mates of your own kind of yourselves so that you may get peace of mind from them, and has put love and compassion between you. Verily there are signs in this for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that He has created mates for you from your own kind that you may find peace in them and He has set between you love and mercy. Surely there are Signs in this for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His creating spouses for you out of yourselves so that you might take comfort in them and His creating love and mercy among you. In this there is evidence (of the truth) for the people who (carefully) think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that He created spouses for you from yourselves for you to gain rest from them, and kept love and mercy between yourselves; indeed in this are signs for the people who ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is this that He created for you wives from among yourselves, that you may find repose in them, and He has put between you affection and mercy. Verily, in that are indeed signs for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that He created mates for you from yourselves that you may find rest in them, and He put between you love and compassion; most surely there are signs in this for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created for you, of yourselves, spouses, that you might repose in them, and He has set between you love and mercy. Surely in that are signs for a people who consider.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: He created for you helpmeets from yourselves that ye might find rest in them, and He ordained between you love and mercy. Lo! herein indeed are portents for folk who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that He created for you from among yourselves spouses, so that you might find repose in them, and He created between you affection and kindness. Truly there are signs in this for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is, thathe created for you from yourselves pouses that ye may find repose in them, and He set between you affection and mercy. verily herein are signs for a people who ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created for you mates from your own selves that you may take comfort in them, and He ordained affection and mercy between you. There are indeed signs in that for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that He created for you mates from among yourselves, that ye may dwell in tranquillity with them, and He has put love and mercy between your (hearts): verily in that are Signs for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that He created for you wives from among yourselves, that you may find repose in them, and He has put between you affection and mercy. Verily, in that are indeed signs for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created for you wives from among yourselves, that you might reside with them, and has put kindness and mercy between you. Surely, there are signs in this for those who think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created for you mates from among yourselves, so that you may find tranquility in them; and He planted love and compassion between you. In this are signs for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created for you from yourselves mates that you may find tranquillity in them; and He placed between you affection and mercy. Indeed in that are signs for a people who give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:21] And of His signs is that He created for you, from yourselves, mates — Eve was created from Adam’s rib and the remainder of mankind from the [reproductive] fluids of men and women — that you might find peace by their side, and become intimate with them, and He ordained between you, all, affection and mercy. Surely in that, mentioned, there are signs for a people who reflect, upon God’s handiwork, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) of the signs of His divine Oneness and power (is this: He created for you spouses) human beings like yourselves (from yourselves that ye might find rest in them) so that the husband may find rest in his wife, (and He ordained between you) husband and wife (love) love of the wife for her husband (and mercy) of the husband towards his wife; it is also said that this means: love of the young ones of the old ones and mercy from the older ones towards the young ones. (Lo, herein) in that which I have mentioned (indeed are portents) signs and lessons (for folk who reflect) upon what Allah created.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً { مِنْ آيَاتِهِ } الدالة على كمال قدرته: { أَنْ خَلَقَ } وقدر { لَكُم مِّنْ أَنفُسِكُمْ } أي: من جنسكم وبني نوعكم { أَزْوَاجاً } نساءً؛ حتى تؤانسوا بهن وتستأنسوا بهن، بل إنما قدر لكم أزواجاً { لِّتَسْكُنُوۤاْ إِلَيْهَا } وتتوطنوا معها توطناً خاصاً، وتألفاً تاماً إلى حيث يفضي إلى التوالد والتناسل { وَ } بهذه الحكمة البديعة { جَعَلَ بَيْنَكُم } وبينهن { مَّوَدَّةً } خاصة خالصة، منبعثة عن محض الحكمة الإلهية بحيث لا يكتنه لميتها وكيفيتها أصلاً\n\n\n\n\n{ وَ } من كمال قدرته ومتانة حكمته: جعل من امتزاج النطفة النازلة منكم ومنهن، الناشئة من المودة المذكورة، والمحبة المقررة بينكم { رَحْمَةً } ولداً مثلكم، ومحيياً لكم اسمكم ورسمكم { إِنَّ فِي ذَلِكَ } الخلق والإيجاد، والتكميل والتمكن، والتقدير والانبعاث، والانزعاج وأنواع التدبيرات الواقعة فيها، والحكم العجيبة المحيرة لأرباب الفطنة والذكاء { لآيَاتٍ } عظام ودلائل جسام { لِّقَوْمٍ يَتَفَكَّرُونَ } [الروم: 12] في آثار صنائع الحكيم القدير، والعليم الخبير البصير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن آياته أن خلق لكم من أنفسكم أزواجاً لتسكنوا إليها } لأن حواء خُلقت من ضلع آدم، والنساء بعدها خُلقن من أصلاب الرجال\n أو: من شكل أنفسكم وجنسها، لا مِنْ جنس آخر، وذلك لما بين الاثنين - إِذْ كَانَا من جنس واحد - من الألفة والمودة والسكون، وما بين الجنسين المختلفين من التنافر\n ويقال سكن إليه: إذا مال إليه\n { وجعل بينكم مودة ورحمة } أي: جعل بينكم التوادد والتراحم بسبب الزواج\n وعن الحسن: المودة كناية عن الجماع، والرحمة هي الولد\n وقيل المودة للشابة الجميلة، والرحمة للعجوز، وقيل: المودة والرحمة من الله، والفَرْك من الشيطان – أي: البغض من الجانبين\n { إن في ذلك لآياتٍ لقوم يتفكرون } فيعلمون ما في ذلك من الحِكم، وأن قوام الدنيا بوجود التناسل\n الإشارة: أصل النشأة البشرية من الطين، وأصل الروح من نور رب العالمين\n فإذا غلبت الطينة على الروح جذبتها إلى عالم الطين، فكان همها الطين، وهوت إلى أسفل سافلين، فلا تجد فكرتها وحديثها، في الغالب، إلا في عالم الحس، ويكون عملها كله عَمَلَ الجوارح، يفنى بفنائها\n وإذا غلبت الروح على الطينة وذلك بدخول مقام الفناء، حتى تستولي المعاني على الحسيات\n وتنخنس البشرية تحت سلطان أنوار الحقيقة، جذبتها إلى عالم الأنوار والأسرار، فلا تجد فكرتها إلا في أنوار التوحيد وأسرار التفريد، وعملها كله قلبي وسري\n بين فكرة واعتبار، وشهود واستبصار، يبقى مع الروح ببقائها، يجري عليها بعد موت البشرية، ويبعث معها، كما تقدم في الحديث: \" يموت المرء\n\n\n \" إلخ\n قال القشيري: يقال: الأصل تُربة، ولكن العِبرَة بالتربية لا بالتربة\n هـ\n قلت: إذ بالتربية تغلب الروح على البشرية، ثم قال: اصطفى الكعبة، فهي خير من الجنة، مع أن الجنة جواهر ويواقيت، والكعبة حجر ومدر، أي: كذلك المؤمن الكامل، وإن كان أصله من الطين، فهو أفضل من كثير العوالم اللطيفة\n ثم قال في قوله تعالى: { ومن آياته أن خلق لكم من انفسكم أزواجاً } الآية: رَدَّ المِثْلَ إلى المِثْل، وربط الشكلَ بالشكل، وجعل سكونَ البعض إلى البعضِ، وذلك للأشباح والصُّورَ، والأرواح صحِبت الأشباح كرهاً لا طوعاً، وأما الأسرار فمُعْتَقَةٌ، لا تساكن الأطلال، ولا تتدنس بالأغيار\n هـ\n قلت: وكأنه يشير إلى أن المودة التي انعقدت بين الزوجين إنما هي نفسية، لا روحانية، ولا سرية إذ الروح والسر لا يتصور منها ميل إلى غير أسرار الذات العلية إذ محبة الحق، جذبتها عن الميل إلى شيء من السّوى\n واختلف الصوفية: هل تُخِلُّ هذه المودة بين الزوجين يمحية الحق أم لا؟ فقال سهل رضي الله عنه: لا تضر الروح لقوله صلى الله عليه وسلم:\n\n \" حُبب إلي َّمن دنياكم ثلاث\n\n\n \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:18",
      "similarity": 0.5329924158708798
    },
    {
      "verse": "30:8",
      "similarity": 0.4994300200442812
    },
    {
      "verse": "45:13",
      "similarity": 0.49506586597155283
    },
    {
      "verse": "7:184",
      "similarity": 0.4938672333161663
    },
    {
      "verse": "19:96",
      "similarity": 0.41155329278969016
    }
  ]
}