{
  "chapter": "الروم",
  "text": "ومن ءايته ان تقوم السماء والارض بامره ثم اذا دعاكم دعوة من الارض اذا انتم تخرجون",
  "translations": [
    {
      "translation": "Among His Signs is that heaven and earth hold firm by His command. Then, when He calls you forth from the earth, you will emerge at once.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that the heavens and the earth stay in position by His command; and then when He will call you once you will come out of the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that the sky and the earth stand firm by His command. Then no sooner than He summons you out of the earth you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some other evidence of His existence is that both the heavens and the earth stand firm at His command. When He will call you from the earth, you will start to come out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that the heavens and the earth remain established by His command; then when He calls you – from the earth – you will thereupon emerge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that the heaven and the earth stand by His command. Then afterwards when He will call you by a single call, behold, you will come out from the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that the heaven and the earth subsist by His command, then when He calls you with a (single) call from out of the earth, lo! you come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth stand firm by His command; then, when He calls you once and suddenly, out of the earth, lo you shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: The heavens and the earth stand fast by His command, and afterward, when He calleth you, lo! from the earth ye will emerge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is this: the heavens and the earth stand firm by His command and afterwards when He calls you, behold, from the earth you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and the earth stand fast by His command, and thereafter, when He calleth you, a call from the earth, lo! ye shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the sky and the earth stand by His command, and then, when He calls you forth from the earth, behold, you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that heaven and earth stand by His Command: then when He calls you, by a single call, from the earth, behold, ye (straightway) come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is that the heaven and the earth stand by His Command, then afterwards when He will call you by single call, behold, you will come out from the earth (i.e. from your graves for reckoning and recompense).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth stand firm at His command. And when He calls you once out of the earth, you shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and the earth stand at His disposal. And then, when He calls you out of the earth, you will emerge at once.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth remain by His command. Then when He calls you with a [single] call from the earth, immediately you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:25] And of His signs is that the heaven and the earth remain standing by His command, by His will, without any supports; then, when He calls you [to come] out of the earth, when Isrāfīl blows the Horn for the raising from the graves [to commence], lo! you shall come forth, from it alive. Thus your coming forth out of it by a call constitutes one of His [many] signs, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) of the signs of Allah's divine Oneness and power (is this: The heavens and the earth stand fast by His command) the heavens and the earth came into being by His leave, (and afterward, when He calleth you) i.e. when Allah calls you on the Day of Judgement through Seraphiel, (lo! from the earth) from the graves (you will emerge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بحث لا يسع لهما الخروج عن أمره وحكمه أصلاً { ثُمَّ } بعدما تأملتم نفاذ حكمه سبحانه\n ومضاء قضائه في معظم مخلوقاته\n فلكم أن تتيقنوا { إِذَا دَعَاكُمْ } وقت إرادة إعادتكم وإحيائكم { دَعْوَةً } متضمنة لأخراجكم { مِّنَ ٱلأَرْضِ إِذَآ أَنتُمْ تَخْرُجُونَ } [الروم: 25] يعني: بعدما أسمعكم بكمال قدرته مضمون دعوته إليكم فاجأتم إلى الخروج منها أحياءً بلا تراخٍ ومهلةٍ تتميماً لسرعة نفوذ قضائه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:109",
      "similarity": 0.3534625011108154
    },
    {
      "verse": "5:37",
      "similarity": 0.34461383896708336
    },
    {
      "verse": "45:3",
      "similarity": 0.3379856027083117
    },
    {
      "verse": "57:5",
      "similarity": 0.3303571285958784
    },
    {
      "verse": "71:18",
      "similarity": 0.324255305910746
    }
  ]
}