{
  "chapter": "الروم",
  "text": "ومن ءايته ان خلقكم من تراب ثم اذا انتم بشر تنتشرون",
  "translations": [
    {
      "translation": "Among His Signs is that He created you from dust and here you are now, widespread human beings!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is that He created you from the earth, and you are now human beings dispersed everywhere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that He created you from dust and behold, you became human beings, and are multiplying around (the earth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some evidence of His existence are His creating you from clay and from that you became human beings scattered all around;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that He created you from dust, and therefore you are human beings spread in the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is this that He created you from dust, and then -- behold you are human beings scattered!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that He created you from dust, then lo! you are mortals (who) scatter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created you of dust; then lo, you are mortals, all scattered abroad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: He created you of dust, and behold you human beings, ranging widely!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of His signs is that He created you from dust and, behold, you became human beings and multiplied yourselves throughout the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is, that he created you of dust, then lo! ye are humankind spreading yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of His signs is that He created you from dust, then, behold, you are humans scattering [all over]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His Signs in this, that He created you from dust; and then,- behold, ye are men scattered (far and wide)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that He created you (Adam) from dust, and then [Hawwa' (Eve) from Adam's rib, and then his offspring from the semen, and], - behold you are human beings scattered!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created you from dust and you became humans scattered throughout the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created you from dust; and behold, you become humans spreading out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He created you from dust; then, suddenly you were human beings dispersing [throughout the earth].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:20] And of His signs, exalted be He, indicating His power, is that He created you, in other words, your origin, Adam, of dust, then lo! you are human beings, of flesh and blood, spreading, across the earth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "458 (And of His signs) of the signs of His divine Oneness, power and prophethood of His Messenger (is this: He created you of dust) He created you of Adam and Adam is from dust, and you are his progeny, (and behold you human beings) living beings, (ranging widely) enjoying comfort on the face of the earth!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ آيَاتِهِ } الدالة على كمال قدرته على الإعادة والإبداء على السواء: { أَنْ } أي: إنه { خَلَقَكُمْ } وقدر جسمكم وصوركم أولاً { مِّن تُرَابٍ } يابس، ثمَّ بلدكم أطواراً وأدواراً؛ لتكميلكم وتشويقكم إمداداً و أدواراً إلى أن صوركم في أحسن صورة، وعدلكم في أقوم تعديل { ثُمَّ إِذَآ أَنتُمْ بَشَرٌ } أي: بعدما كمَّل صورتكم، وتمم تمثالكم وشكلكم، واستوى بشريتكم فاجأتم { تَنتَشِرُونَ } [الروم: 20] في الأرض على سبيل التناسل والتوالد، ومن قدر على إبدائكم وإبداعكم على الوجه المذكور قدر على حشركم وإعادتكم، بل هو أسهل من الإبداء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ومن آياته } الدالة على قدرته، الشاملة للبعث وغيره: أو: ومن علامات ربوبيته: { أن خلقكم } أي: أباكم { من ترابٍ } لأن أصل الإنشاء منه، { ثم إذا أنتم بشر تنتشرون } أي: ثم فاجأتم وقت كونكم بشراً منتشرين في الأرض، آدم وذريته",
      "translations": []
    }
  ]
}