{
  "chapter": "الروم",
  "text": "ومن ءايته ان تقوم السماء والارض بامره ثم اذا دعاكم دعوة من الارض اذا انتم تخرجون",
  "translations": [
    {
      "translation": "Among His Signs is that heaven and earth hold firm by His command. Then, when He calls you forth from the earth, you will emerge at once.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is that the heavens and the earth stay in position by His command; and then when He will call you once you will come out of the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that the sky and the earth stand firm by His command. Then no sooner than He summons you out of the earth you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some other evidence of His existence is that both the heavens and the earth stand firm at His command. When He will call you from the earth, you will start to come out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that the heavens and the earth remain established by His command; then when He calls you – from the earth – you will thereupon emerge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that the heaven and the earth stand by His command. Then afterwards when He will call you by a single call, behold, you will come out from the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that the heaven and the earth subsist by His command, then when He calls you with a (single) call from out of the earth, lo! you come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth stand firm by His command; then, when He calls you once and suddenly, out of the earth, lo you shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: The heavens and the earth stand fast by His command, and afterward, when He calleth you, lo! from the earth ye will emerge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another of His signs is this: the heavens and the earth stand firm by His command and afterwards when He calls you, behold, from the earth you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and the earth stand fast by His command, and thereafter, when He calleth you, a call from the earth, lo! ye shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the sky and the earth stand by His command, and then, when He calls you forth from the earth, behold, you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that heaven and earth stand by His Command: then when He calls you, by a single call, from the earth, behold, ye (straightway) come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is that the heaven and the earth stand by His Command, then afterwards when He will call you by single call, behold, you will come out from the earth (i.e. from your graves for reckoning and recompense).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth stand firm at His command. And when He calls you once out of the earth, you shall come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and the earth stand at His disposal. And then, when He calls you out of the earth, you will emerge at once.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that the heaven and earth remain by His command. Then when He calls you with a [single] call from the earth, immediately you will come forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:25] And of His signs is that the heaven and the earth remain standing by His command, by His will, without any supports; then, when He calls you [to come] out of the earth, when Isrāfīl blows the Horn for the raising from the graves [to commence], lo! you shall come forth, from it alive. Thus your coming forth out of it by a call constitutes one of His [many] signs, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمِنْ آَيَاتِهِ أَنْ تَقُومَ السَّمَاءُ وَالْأَرْضُ بِأَمْرِهِ ثُمَّ إِذَا دَعَاكُمْ دَعْوَةً مِنَ الْأَرْضِ إِذَا أَنْتُمْ تَخْرُجُونَ (25)ختمت الآيات بهذه الآية السادسة وهي التي دلت على عظيم القدرة على حفظ نظام المخلوقات العظيمة بعد خلقها؛ فخلقُ السماوات والأرض آيةٌ مستقلة تقدمت ، وبقاء نظامهما على ممر القرون آية أخرى . وموقع العبرة من هاته الآية هو أولها وهو أن تقوم السماء والأرض هذا القيام المتقن بأمر الله دون غيره .فمعنى القيام هنا : البقاء الكامل الذي يشبه بقاء القائم غير المضطجع وغير القاعد من قولهم : قامت السوق ، إذا عظم فيها البيع والشراء . وهذا هو المعبر عنه في قوله تعالى { إن الله يمسك السماوات والأرض أن تزولا } \\[ فاطر : 41 \\] وقوله { ويمسك السماء أن تقع على الأرض إلا بإذنه } \\[ الحج : 65 \\] . والأمر المضاف إلى الله هو أمره التكويني وهو مجموع ما وضعه الله من نظام العالم العلوي والسفلي ، ذلك النظامَ الحارس لهما من تطرق الاختلال بإيجاد ذلك النظام . و { بأمره } متعلق بفعل { تقوم ، } والباء للسببية .و { ثم } عاطفة الجملة على الجملة . والمقصود من الجملة المعطوفة الاحتراس عما قد يتوهم من قوله { أن تقوم السماء والأرض بأمره } من أبدية وجود السماوات والأرض ، فأفادت الجملة أن هذا النظام الأرضي يعتوره الاختلال إذا أراد الله انقضاء العالم الأرضي وإحضار الخلق إلى الحشر تسجيلاً على المشركين بإثبات البعث . فمضمون جملة { إذا دعاكم دعوة من الأرض إذا أنتم تخرجون } ليس من تمام هذه الآية السادسة ولكنه تكملة وإدماج موجه إلى منكري البعث .وفي متعلق المجرور في قوله { مِنَ الأرْض } اضطراب؛ فالذي ذهب إليه صاحب «الكشاف» أنه متعلق ب { دعاكم } لأن { دعاكم } لما اشتمل على فاعل ومفعول فالمتعلق بالفعل يجوز أن يكون من شؤون الفاعل ويجوز أن يكون من شؤون المفعول على حسب القرينة ، كما تقول : دعوت فلاناً من أعلى الجبل فنزل إليّ ، أي دعوته وهو في أعلى الجبل . وهذا الاستعمال خلاف الغالب ولكن دلت عليه القرينة مع التفصي من أن يكون المجرور متعلقاً ب { تخرجون } لأن ما بعد حرف المفاجأة لا يعمل فيما قبلها ، على أن في هذا المنع نظراً . ولا يجوز تعليقه ب { دعوة } لعدم اشتمال المصدر على فاعل ومفعول ، وهو وجيه وكفاك بذوق قائله . وأقول : قريب منه قوله تعالى { أولئك يُنادَوْن من مكان بعيد } \\[ فصلت : 44 \\] . و { مِن } لابتداء المكان ، والمجرور ظرف لغو . ويجوز أن يكون المجرور حالاً من ضمير النصب في { دَعَاكم } فهو ظرف مستقر . ويجوز أن يكون { من الأرض } متعلقاً ب { تخرجون } قدم عليه . وهذا ذكر في «مغني اللبيب» أنه حكاه عنهم أبو حاتم في كتاب «الوقف» ، وهذا أحسن وأبعد عن التكلف ، وعليه فتقديم المجرور للاهتمام تعريضاً بخطئهم إذ أحالوا أن يكون لهم خروج من الأرض عن بعد صيرورتهم فيها في قولهم المحكي عنهم بقوله تعالى { وقالوا أإذا ضَلَلْنا في الأرض أئنا لفي خلق جديد } \\[ السجدة : 10 \\] وقولهم{ أإذا كنّا تُراباً وءاباؤنا أئنّا لمخرجون } \\[ النمل : 67 \\] .وأما قضية تقديم المعمول على { إذا } الفجائية فإذا سلم عدم جوازه فإن التوسع في المجرور والمظروف من حديث البحر ، فمن العجب كيف سدّ باب التوسع فيه صاحب «مغني اللبيب» في الجهة الثانية من الباب الخامس . وجيء بحرف المفاجأة في قوله { إذا أنتم تخرجون } لإفادة سرعة خروجهم إلى الحشر كقوله { فإنما هي زجرة واحدة فإذا هم بالساهرة } \\[ النازعات : 13 ، 14 \\] و { إذا } الفجائية تقتضي أن يكون ما بعدها مبتدأ . وجيء بخبر المبتدأ جملة فعلية لإفادة التقوّي الحاصل من تحمل الفعل ضمير المبتدأ فكأنه أعيد ذكره كما أشار إليه صاحب «المفتاح» . وجيء بالمضارع لاستحضار الصورة العجيبة في ذلك الخروج كقوله { فإذا هم من الأجداث إلى ربهم ينسلون } \\[ يس : 51 \\] .\n\n",
      "translations": [
        {
          "translation": "(And of His signs) of the signs of Allah's divine Oneness and power (is this: The heavens and the earth stand fast by His command) the heavens and the earth came into being by His leave, (and afterward, when He calleth you) i.e. when Allah calls you on the Day of Judgement through Seraphiel, (lo! from the earth) from the graves (you will emerge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بحث لا يسع لهما الخروج عن أمره وحكمه أصلاً { ثُمَّ } بعدما تأملتم نفاذ حكمه سبحانه\n ومضاء قضائه في معظم مخلوقاته\n فلكم أن تتيقنوا { إِذَا دَعَاكُمْ } وقت إرادة إعادتكم وإحيائكم { دَعْوَةً } متضمنة لأخراجكم { مِّنَ ٱلأَرْضِ إِذَآ أَنتُمْ تَخْرُجُونَ } [الروم: 25] يعني: بعدما أسمعكم بكمال قدرته مضمون دعوته إليكم فاجأتم إلى الخروج منها أحياءً بلا تراخٍ ومهلةٍ تتميماً لسرعة نفوذ قضائه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:109",
      "similarity": 0.3534625011108154
    },
    {
      "verse": "5:37",
      "similarity": 0.34461383896708336
    },
    {
      "verse": "45:3",
      "similarity": 0.3379856027083117
    },
    {
      "verse": "57:5",
      "similarity": 0.3303571285958784
    },
    {
      "verse": "71:18",
      "similarity": 0.324255305910746
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}