{
  "chapter": "الروم",
  "text": "واذا مس الناس ضر دعوا۟ ربهم منيبين اليه ثم اذا اذاقهم منه رحمة اذا فريق منهم بربهم يشركون",
  "translations": [
    {
      "translation": "When harm touches people they call on their Lord, making tawba to Him. But then, when He gives them a taste of mercy from Him, a group of them immediately associate others with their Lord",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When misfortune befalls men they pray to their Lord and turn to Him; but afterwards when He has given them a taste of His benevolence a section of them begins to ascribe compeers to their Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such are human beings) that when any misfortune befalls them, they cry to their Lord, penitently turning to Him. But no sooner that He lets them have a taste of His Mercy than some of them begin associating others with their Lord in His Divinity\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people face hardship, they begin praying to their Lord and turn in repentance to Him. When they receive mercy from Him, a group of them begin to consider things equal to God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some affliction reaches men, they pray to their Lord inclining towards Him – and when He gives them a taste of His mercy, thereupon a group among them begins setting up partners to their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm touches men, they cry sincerely only to their Lord, turning to Him in repentance; but when He gives them a taste of His mercy, behold, a party of them associates partners in worship with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm afflicts men, they call upon their Lord, turning to Him, then when He makes them taste of mercy from Him, lo! some of them begin to associate (others) with their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some affliction visits mankind, they call unto their Lord, turning to Him; then, when He lets them taste mercy from Him, lo, a party of them assign associates to their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm toucheth men they cry unto their Lord, turning to Him in repentance; then, when they have tasted of His mercy, behold! some of them attribute partners to their Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When an affliction befalls men, they cry out to their Lord, turning to Him in repentance; but then, when He has made them taste His mercy, a section of them associate partners with their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when hurt toucheth mankind they cry unto their Lord, turning penitently unto Him; then when He causeth them to taste of His mercy, lo! a part of them with their Lord associate others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When distress befalls people, they supplicate their Lord, turning to Him in penitence. Then, when He lets them taste His mercy, behold, a part of them ascribe partners to their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When trouble touches men, they cry to their Lord, turning back to Him in repentance: but when He gives them a taste of Mercy as from Himself, behold, some of them pay part-worship to other god's besides their Lord,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm touches men, they cry sincerely only to their Lord (Allah), turning to Him in repentance, but when He gives them a taste of His Mercy, behold! a party of them associate partners in worship with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When affliction befalls mankind they turn to Him calling their Lord in prayer, but when He lets them taste His Mercy, some of them assign associates to their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When affliction touches the people, they call on their Lord, turning to Him in repentance. But then, when He gives them a taste of His mercy, some of them attribute partners to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when adversity touches the people, they call upon their Lord, turning in repentance to Him. Then when He lets them taste mercy from Him, at once a party of them associate others with their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:33] And when some distress, some hardship, befalls people, that is, [people such as] the Meccan disbelievers, they call on their Lord, turning, returning, in penitence to Him, alone. Then, when He lets them taste mercy from Him, by way of rain, lo! a party of them ascribe partners to their Lord.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when harm) hardship (toucheth men) the people of Mecca (they cry unto their Lord) to relieve them from the hardship, (turning to Him in repentance) and supplications; (then, when they have tasted of His mercy) of His blessing, (behold! some of them) some of the disbelievers (attribute partners to their Lord) their consider idols His partners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أشار سبحانه إلى ما حداهم وأغراهم على هذا الزيغ والضلال من الخصلة الذميمة المركوزة في جبلتهم فقال: { وَإِذَا مَسَّ ٱلنَّاسَ } المجبولين على الكفران والنسيان { ضُرٌّ } أي: شدة وبلاء\n ومصيبة وعناء يزعجهم إلى الدعوة والتوجه نحو الحق\n لكشفه وتفريجه { دَعَوْاْ رَبَّهُمْ مُّنِيبِينَ إِلَيْهِ }  مائلين عن الأسباب العادية مطلقاً\n مسترجعين نحوه عن محض الندم والإخلاص { ثُمَّ إِذَآ أَذَاقَهُمْ } الحق\n وأنجاهم { مِّنْهُ } أي: من الضرر ومن آثاره ولوازمه المستتبعة { رَحْمَةً } لهم\n وعطفاً إياهم على مقتضى اللطف والجمال { إِذَا فَرِيقٌ مِّنْهُمْ } أي: فجاء فريق منهم { بِرَبِّهِمْ يُشْرِكُونَ } [الروم: 33] أي: يشركون بربهم\n وينسبون الكشف والتفريج إلى الأسباب الوسائل العادية\n بل إلى ما اتخذوها من دون الله من الآلهة الباطلة التي اعتقدوها شفعاء ينقذونهم عن أمثاله\n\nوإنما فعلوا ذلك ونسبوا ما نسبوا إلى الأظلال البالطة { لِيَكْفُرُواْ بِمَآ آتَيْنَاهُمْ } وأعطيانهم من النعم العظام والفواضل الجسام\n وما ذلك إلا من خبث طينتهم\n وتركب جهلهم في جبلتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إِذَا هُمْ: جواب إن\n وإذا الفجائية\n تَخْلُفُ الفاء\n لتآخيهما في التعقيب\n يقول الحق جل جلاله: { وإِِذا مَسَّ الناسَ ضُرُّ } كمرض\n وفقر\n وشدة\n أو غير ذلك\n { دَعَوا ربهم منيبين } راجعين { إليه } من دعاء غيره\n { ثم إذا أذاقهم منه رحمةً } خلاصاً من الشدة { إذا فريق منهم بربهم يُشركون } شركاً جلياً أو خفياً\nأي فاجأ بعضهم الإشراك بربهم الذي عافاهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:31",
      "similarity": 0.5618862982032581
    },
    {
      "verse": "39:54",
      "similarity": 0.5286635607961436
    },
    {
      "verse": "50:8",
      "similarity": 0.5036652007941419
    },
    {
      "verse": "40:13",
      "similarity": 0.4859219962837106
    },
    {
      "verse": "13:27",
      "similarity": 0.4843102453496689
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}