{
  "chapter": "الروم",
  "text": "وما ءاتيتم من ربا ليربوا۟ فى امول الناس فلا يربوا۟ عند الله وما ءاتيتم من زكوة تريدون وجه الله فاو۟لئك هم المضعفون",
  "translations": [
    {
      "translation": "What you give with usurious intent, aiming to get back a greater amount from people's wealth, does not become greater with Allah. But anything you give as zakat, seeking the Face of Allah - all who do that will get back twice as much.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you give on interest to increase (your capital) through others' wealth, does not find increase with God; yet what you give (in alms and charity) with a pure heart, seeking the way of God, will be doubled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you pay as interest so that it may increase the wealth of people does not increase in the sight of Allah. As for the Zakah that you give, seeking with it Allah's good pleasure, that is multiplied manifold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not allow to increase whatever illegal interest you try to receive in order to increase your wealth at the expense of people's property. Whatever amount of zakat you give to please God will be doubled (for you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which you give upon usury, in order that it may increase the creditors’ property, will not increase before Allah; and the charity you give seeking the pleasure of Allah – only that will increase manifold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which you give in Riba in order that it may increase from other people's property, has no increase with Allah; but that which you give in Zakah seeking Allah's Face, then those they shall have manifold increase.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you lay out as usury, so that it may increase in the property of men, it shall not increase with Allah; and whatever you give in charity, desiring Allah's pleasure-- it is these (persons) that shall get manifold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what you give in usury, that it may increase upon the people's wealth, increases not with God; but what you give in alms, desiring God's Face, those -- they receive recompense manifold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which ye give in usury in order that it may increase on (other) people's property hath no increase with Allah; but that which ye give in charity, seeking Allah's Countenance, hath increase manifold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you lend out in usury to gain in value through other people's wealth will not increase in God's eyes, but whatever you give in alms in your desire for God's pleasure will be multiplied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever ye give in gift in order that it may increase among the substance of men increaseth not with Allah; and whatsoever ye give in poor-rate seeking the countenance of Allah-then those: they shall, have increase manifold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you give in usury in order that it may increase people’s wealth does not increase with Allah. But what you pay as zakat seeking Allah’s pleasure—it is they who will be given a manifold increase.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which ye lay out for increase through the property of (other) people, will have no increase with Allah: but that which ye lay out for charity, seeking the Countenance of Allah, (will increase): it is these who will get a recompense multiplied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which you give in gift (to others), in order that it may increase (your wealth by expecting to get a better one in return) from other people's property, has no increase with Allah, but that which you give in Zakat seeking Allah's Countenance then those, they shall have manifold increase.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which you give in usury so that it increases in other people's wealth, will not increase with Allah; but the charity you give desiring the Face of Allah, to those, they shall be recompensed many times over.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The usury you practice, seeking thereby to multiply people’s wealth, will not multiply with God. But what you give in charity, desiring God’s approval—these are the multipliers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you give for interest to increase within the wealth of people will not increase with Allah. But what you give in zakah, desiring the countenance of Allah - those are the multipliers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:39] And what you give in usury — such as when something is given as a gift or a present for the purpose of demanding more in return; it [the practice of usury] (ribā) is referred to by the same noun denoting that [illicit] ‘extra’ (ziyāda) requested in the [financial] transaction — that it may increase the wealth of the people, giving it, does not increase with God — there is no reward in it for those who give it. But what you give as alms (zakāt), as voluntary alms (sadaqa), seeking, thereby, God’s Countenance, such [of you who do so] — they are the receivers of manifold increase, in their reward for what they sought (there is here a shift of address away from the second person).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That which ye give in usury in order that it may increase on (other) people's property) to increase your wealth at the expense of people's wealth (hath no increase with Allah) for He will not multiply it since it is not for His Countenance; (but that which ye give in charity) to the needy, (seeking) with it (Allah's Countenance, hath increase manifold) in the Hereafter and their wealth will be increased in the life of this world by the grace of Allah and His preservation of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أو نية فاسدة أخرى بلا امتثال أمر الله وطلب مرضاته { فَلاَ يَرْبُواْ } ولا يزيد لكم صرفكم هذا { عِندَ ٱللَّهِ } شيئاً من الثواب\n بل لا يقبل عنده سبحانه أصلاً\n لإفسادكم في أغراضكم ونياتكم { وَ } أمَّا { مَآ آتَيْتُمْ } وأعطيتم للفقراء { مِّن زَكَاةٍ } قد فرضها سبحانه عليكم امتثالاً لأمره\n وإطاعةً لدينه على الوجه الذي أُمرتم به\n مع أنكم { تُرِيدُونَ } وتقصدون بإخراجها وصرفها { وَجْهَ ٱللَّهِ } ومحض رضاه بلا خلط شيء من أماني أهويتكم\n وتسويلات أمارتكم معها { فَأُوْلَـٰئِكَ } الفاعلون للزكاة على الوجه المذكور المأمور { هُمُ ٱلْمُضْعِفُونَ } [الروم: 39] عند الله ثوابها إلى سبعين\n بل إلى سبعمائة\n بل إلى ما شاء الله عنايةً من الله\n وإفضالاً لهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلا يربوا عند الله } ولا يبارك فيه\n بل يُسحته ويمحقه\n ولو بعد حين\n وهذه صورة الربا المحرمة\n إجماعاً\n وقيل: وما أعطيتم من هدية لتأخذوا أكثر منها\n فلا يربو عند الله\n لأنكم لم تقصدوا به وجه الله\n وهذه هدية الثواب\n جائزة\n إلا في حقه - عليه الصلاة والسلام لقوله تعالى:\n[المدثر: 6]\n وقرأ ابن كثير: \" أتيتم \" بالقصر\n بمعنى ما جئتم به من إعطاء ربا\n وقرأ نافع: \" لتُرْبُوا \" بالخطاب\n أي: لتصيروا ذَوِي ربا\n فتزيدوا في أموالكم\n { وما آتيتم من زكاةٍ } صدقة\n { تُريدون وجه الله } تبتغون به وجهه خالصاً\n لا تطلبون به زيادة\n ولا مكافأة\n ولاسمعة\n { فأولئك هم المضْعِفُونَ } أي: ذوو الأَضْعَافِ من الحسنات\n من سبعمائة فأكثر\n ونظير المُضْعِفِ: المقوي\n والموسر\n لذي القوة واليسار\n والالتفات إلى الخطاب في أولئك\n\n\n إلخ في غاية الحسن لما فيه من التعظيم\n كأنه خاطب الملائكة وخواص الخلق تعريفاً بحالهم\n وتنويهاً بقدرهم\n ولأنه يفيد التعميم\n كأنه قيل: مَنْ فَعَلَ هذا فسبيله سبيل المخاطبين المقبول عليهم\n ولا بد من ضمير يعود إلى \" ما \" الموصولة\n أي: المضعفون به\n أو: فَمُؤْتُوه أولئك هم المضعفون\n وقال الزجاج: أي: فأهلها هم المضعفون\n أي: يضاعف لهم الثواب\n من عشر إلى سبعمائة\n\nوالله تعالى أعلم\n الإشارة: البسط والقبض يتعاقبان على العبد تَعَاقُبَ الليل والنهار\n فالواجب على العبد: الرجوعُ إلى الله في السراء والضراء\n فالبسط يشهد فيه المنّة من الله\n ومقتضى الحق منك الحمدُ والشكر\n والقبض يشهده من الله امتحاناً وتصفية\n ومقتضى الحق منك الصبرُ والرضا\n وانتظار الفرج من الله فإن انتظار الفرج\n مع الصبر\n عبادة\n قال القشيري: الإشارة إلى ألا يُعلِّق العبدُ قلبَه إلا بالله\n لأن ما يسوءهم ليس زواله إلا من الله\n وما يسرهم ليس وجودُه إلا من الله\n فالبسطُ\n الذي يسرهم ويؤنسهم منه\n وجوده\n والقبض\n الذي يسوءهم ويحوشهم منه\n حصولُه\n فالواجب: لزوم عهوده بالإسرار\n وقطعُ الأفكار عن الأغيار\n هـ\n وقال في قوله: { فآتِ ذا القربى حَقَّه }: القرابة على قسمين قرابةُ النسب وقرابةُ الدين\n وهي أمسُّ\n وبالمواساة أحقُّ\n وإذ كان الرجلُ مشتغلا بالعبادة غيرُ متفرَغ لطلب المعيشة\n فالذي له إيمان بحاله\n وإشرافٌ على وقته\n يجب عليه أن يقوم بشأنه\n بقدر ما يمكنه\n مما يكون له عونٌ على طاعته\n مما يشوش قلبه\n من حديث عياله\n فإن كان اشتغال الرجل بشيء من مراعاة القلب فحقّه آكد\n وتَفَقُّدَه أوْجَب\n { ذلك خير للذين يريدون وجه الله } \n والمريدُ هو الذي يُؤْثِرُ حقَّ الله على حظِّ نَفْسِه\n فإيثارُ الإخوان\n لمن يريد وجه الله\n أتمُّ من مراعاة حال نفسه\n فهمّه بالإحسان لذوي القربى والمساكين يتقدم على نظره لنفسه وعَيْلَتِهِ\n وما يهمه من نصبيه\n هـ\n وقال في قوله: { يُريدون وجه الله }: لا تستخدم الفقير بما تُريده به من رفق\n بل أفضل الصدقة على ذي رَحمٍ كاشح\n أي: قاطع حتى يكون إعطاؤُه لله مجرداً عن كل نصيبٍ لَكَ\n فهؤلاء هم الذين يتضاعِفُ أجِرْهم بمجاهدتهم لنفوسهم\n حيث يخالفونها\n وفوزهم بالعِوَضِ من قِبَل الله\n ثم الزكاة هي التطهير\n فتطهيرُ المال معلومٌ ببيان الشريعة\n وزكاة البَدَنِ\n وزكاةُ القلبِ\n وزكاةُ السِّر\n كلُّ ذلك يجب القيام به\n هـ\n قلت: فزكاة البدن: إتعابه في القيام بوظائف العبودية الظاهرة\n وزكاة القلب: تطهيره من الرذائل وتحليته بالفضائل\n وزكاة السر: صيانته من الميل إلى شيء من السِّوى\n والله تعالى أعلم\n ثم برهن على وحدانيته\n فقال: { ٱللَّهُ ٱلَّذِي خَلَقَكُمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:130",
      "similarity": 0.5962017430274646
    },
    {
      "verse": "69:10",
      "similarity": 0.5096703449910845
    },
    {
      "verse": "2:278",
      "similarity": 0.44047295345619303
    },
    {
      "verse": "4:161",
      "similarity": 0.4286759330888485
    },
    {
      "verse": "23:50",
      "similarity": 0.37520033865644686
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/30:39.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/30:39.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}