{
  "chapter": "الروم",
  "text": "ليكفروا۟ بما ءاتينهم فتمتعوا۟ فسوف تعلمون",
  "translations": [
    {
      "translation": "to show ingratitude for what We have given them. 'Enjoy yourselves - you will soon know.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to deny what We have given them. Please yourselves for a time; you will come to know soon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they may show ingratitude to Us for the favours We had bestowed upon them. So, enjoy yourselves a while; but then you shall soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because of their ingratitude for what We have given them. Let them enjoy themselves, but they will soon know (the consequences of their deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to be ungrateful for Our bestowal; “Therefore enjoy”; you will soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to be ungrateful for the graces which We have bestowed on them. Then enjoy; but you will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to be ungrateful for what We have given them; but enjoy yourselves (for a while), for you shall soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may be ungrateful for what We have given them. 'Take your enjoyment; certainly you will soon know.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to disbelieve in that which We have given them. (Unto such it is said): Enjoy yourselves awhile, but ye will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and are ungrateful for what We have given them. So enjoy yourselves for a while, but soon you will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they may be ungrateful for that which We have vouchsafed to them. So enjoy awhile; presently ye shall come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being ungrateful toward what We have given them. So let them enjoy. Soon they will know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As if) to show their ingratitude for the (favours) We have bestowed on them! Then enjoy (your brief day); but soon will ye know (your folly).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to be ungrateful for the graces which We have bestowed on them. Then enjoy (your short life); but you will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "disbelieving in what We have given them. Enjoy, but you shall soon know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To show ingratitude for what We have given them. Indulge yourselves—you will surely know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they will deny what We have granted them. Then enjoy yourselves, for you are going to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:34] Let them be ungrateful for what We have given them (this is [an imperative] meant as a threat). ‘So take   your enjoyment. Soon you will know’, the consequences of your enjoyment (there is a shift away from the third person address to the second).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So as to disbelieve in that which We have given them) of blessings ((Unto such it is said): Enjoy yourselves awhile) live, O people of Mecca, in the life of this world, (but ye will come to know) what will be done with you in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما فعلوا ذلك ونسبوا ما نسبوا إلى الأظلال البالطة { لِيَكْفُرُواْ بِمَآ آتَيْنَاهُمْ } وأعطيانهم من النعم العظام والفواضل الجسام؛ وما ذلك إلا من خبث طينتهم، وتركب جهلهم في جبلتهم، قل لهم يا أكمل الرسل نيابةً عنا: { فَتَمَتَّعُواْ } أيها لاكافرون لنعمنا، ولفواضل لطفنا ولكرمنا، ولتعيشوا بها بطرين مسرورين { فَسَوْفَ تَعْلَمُونَ } [الروم: 34] عاقبة تمتعكم وكفرانكم، وما يترتب عليها من أنواع العذاب والنكال؛ إذ يأتي عليهم زمان يعترف كلٌّ منهم بما جرى عليه من الكفران والعصيان وقت رؤيتهم أحوال الكافرين وأهوالهم في النار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم إذا أذاقهم منه رحمةً } خلاصاً من الشدة { إذا فريق منهم بربهم يُشركون } شركاً جلياً أو خفياً،أي فاجأ بعضهم الإشراك بربهم الذي عافاهم، { ليكفروا } إما: لام كي، أو: لام الأمر للوعيد والتهديد، أي: أشركوا كي يكفروا { بما آتيناهم } من النعم، التي من جملتها: نجاتهم وخلاصهم من كل شدة، { فتمتعوا } بكفركم قليلاً أمر تهديد، { فسوف تعلمون } وبال تمتعكم",
      "translations": []
    }
  ]
}