{
  "chapter": "الروم",
  "text": "فـات ذا القربى حقه والمسكين وابن السبيل ذلك خير للذين يريدون وجه الله واو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "Give relatives their due, and the poor and travellers. That is best for those who seek the pleasure of Allah. They are the ones who are successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, give their share to the relatives, the needy, and the wayfarers. This is best for those who seek the way that leads to God, and they will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give his due to the near of kin, and to the needy, and to the wayfarer. That is better for those who desire to please Allah. It is they who will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the relatives, the destitute, and the needy travellers their share (of charity). It is better for those who want to please God and they will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore give the relative his right, and to the needy, and to the traveller; this is better for those who seek the pleasure of Allah; and it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, give to the kindred his due, and to Al-Miskin and to the wayfarer. That is best for those who seek Allah's Face; and it is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then give to the near of kin his due, and to the needy and the wayfarer; this is best for those who desire Allah's pleasure, and these it is who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the kinsman his right, and the needy, and the traveller; that is better for those who desire God's Face; those they are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give to the kinsman his due, and to the needy, and to the wayfarer. That is best for those who seek Allah's Countenance. And such are they who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give the near relative, the needy, and the wayfarer their due -- that is best for those who seek God's pleasure: such men are the ones who will surely prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give thou unto the kinsman his due and unto the needy and unto the wayfarer. That is best for those who seek Allah's countenance; and those: they are the blissful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the relative his due, and the needy and the traveller [as well]. That is better for those who seek Allah’s pleasure, and it is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give what is due to kindred, the needy, and the wayfarer. That is best for those who seek the Countenance, of Allah, and it is they who will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give to the kindred his due, and to Al-Miskin (the poor) and to the wayfarer. That is best for those who seek Allah's Countenance, and it is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the kinsman his due, and to the needy, and to the destitute traveler. That is best for those who desire the Face of Allah; such will surely prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give the relative his rights, and the destitute, and the wayfarer. That is best for those who seek God’s presence. Those are the prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give the relative his right, as well as the needy and the traveler. That is best for those who desire the countenance of Allah, and it is they who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:38] And give the relative what is his due, in the way of dutifulness and kindness, and the needy and the wayfarer, the traveller, [give] voluntary alms — the Prophet’s community must emulate him in this respect. That is better for those who desire God’s Countenance, [who desire] His reward, in exchange for what they do; those, they are the successful, the winners.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So give to the kinsman) so give, Muhammad, to the one related to you by blood (his due) the right of his kinship, (and to the needy) give him clothing and food, (and to the wayfarer) be hospitable to your guest for three days, and whatever you give him after three days is alms. (That) which I have mentioned of kinship, giving and hospitality (is best) is a reward and honour in the Hereafter (for those who seek Allah's Countenance) by their giving. (And such are they who are successful) those who are saved from Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أشار سبحانه إلى بسط الرزق على من يشاء، وقبضه عمن يشاء إرادةً واختياراً، أراد أن يشير إلى مصارفه فقال مخاطباً لحبيبه صلى الله عليه وسلم؛ إذ هو جدير بأمثال هذه الخطابات الإلهية: { فَآتِ } وأعط يا أكمل الرسل من فواضل ما رزق لك من النعم { ذَا ٱلْقُرْبَىٰ } المنتمين إليك من قِبَل أبويك { حَقَّهُ } أي: ما يليق به من الصلة وحفظه ورعايته، فهم أولى وأحق بالرعاية من غيرهم { وَ } بعد أولئك الأولى بالرعاية: { ٱلْمِسْكِينَ } وهو الذي أسكنه الفقر من هاوية الهوان، وزاوية الحرمان { وَ } أعط بعده: { ٱبْنَ ٱلسَّبِيلِ } وهم الذين فارقوا عن الأموال والأوطان بأسباب أباحها الشرع لهم { ذَلِكَ } التصرف المذكور { خَيْرٌ } في الدنيا والآخرة { لِّلَّذِينَ يُرِيدُونَ } بأموالهم وصرفها { وَجْهَ ٱللَّهِ } وابتغاء مرضاته، وخوضاً في طريق شكره، أداء حق شيء من نعمه وفواضل كرمه { وَ } بالجملة: { أُوْلَـٰئِكَ } الباذلون أموالهم في سبيل الله على الوجه الذي أمرهم الحق به { هُمُ ٱلْمُفْلِحُونَ } [الروم: 38] المصورون على الفوز والفلاح من عنده سبحانهز\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال النسفي: أنكر عليهم بأنهم قد علموا أنه القابض الباسط، فما لهم يقنطون من رحمته؟ وما لهم لا يرجعون إليه، تائبين من معاصيهم، التي عوقبوا بالشدّة من أجلها، حتى يعيد عليهم رحمته؟ ولما ذكر أنّ السيئة أصابتهم بما قدمت أيديهم، أتبعه ذكر ما يحب أن يفعل وما يجب أن يترك، يعني: عند البسط فقال: { فآت ذا القربى } أعطِ قريبك { حَقَّهُ } من البر والصلة مما بسط عليك\n { و } أعط { المسكينَ وابنَ السبيل } حقهما من الصدقة الواجبة أو التطوعية، حسبما تقتضيه مكارم الأخلاق\n والخطاب لمن بسط عليه، أو: للنبي - عليه الصلاة والسلام، وغيره تبع\n { ذلك } أي: إيتاء حقوقهم الواجبة، والتطوعية، { خيرٌ للذين يُريدون وَجْهَ الله } أي: ذاته المقدسة، أي: يقصدون، بمعروفهم، إياه، خالصاً\n { وأولئك هم المفلحون } الفائزون بكل خير، قد حَصَّلوا، بما بسط لهم، النعيم المقيم",
      "translations": []
    }
  ]
}