{
  "chapter": "الروم",
  "text": "اولم يروا۟ ان الله يبسط الرزق لمن يشاء ويقدر ان فى ذلك لءايت لقوم يؤمنون",
  "translations": [
    {
      "translation": "Do they not see that Allah expands provision for whoever He wills and also restricts it? There are certainly Signs in that for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see God increases or decreases the means of whosoever He please? Verily there are signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah enlarges and straitens the sustenance of those whom He pleases? There are Signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how God increases the livelihood of whomever He wants and determines his share. In this there is evidence (of the truth) for the believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And did they not see that Allah eases the sustenance for whomever He wills and restricts it for whomever He wills? Indeed in this are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah expands the provision for whom He wills and straitens (it for whom He wills). Verily, in that are indeed signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah makes ample provision for whom He pleases, or straitens? Most surely there are signs in this for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that God outspreads and straitens His provision to whom He will? Surely in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that Allah enlargeth the provision for whom He will, and straiteneth (it for whom He will). Lo! herein indeed are portents for folk who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that God gives abundantly to whoever He pleases, and sparingly to whoever He pleases? In that truly there are signs for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold they not that expandeth the provision for whomsoever He and stinteth? Verily herein are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah expands the provision for whomever He wishes, and tightens it? There are indeed signs in that for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that Allah enlarges the provision and restricts it, to whomsoever He pleases? Verily in that are Signs for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah enlarges the provision for whom He wills and straitens (it for whom He wills). Verily, in that are indeed signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah outspreads and restricts His provision to whom He will? Surely, there are signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that God expands the provision for whomever He wills, or restricts it? Surely in this are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah extends provision for whom He wills and restricts [it]? Indeed, in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:37] Have they not seen, [have they not] realised, that God extends, He makes abundant, His provision to whomever He will, as a test, and straitens?, and He restricts it for whomever He will, as a trial? Surely in that there are signs for people who believe, in them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See they not) were the disbelievers of Mecca not informed in the Book (that Allah enlargeth the provision) gives abundant wealth (for whom He will) and this could be a lure to his perdition, (and straiteneth (it for whom He will)) out of care for him. (Lo! Herein) in that which I have mentioned of enlargement and straitening (indeed are portents) signs and lessons (for folk who believe) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وشواهد لائحات { لِّقَوْمٍ يُؤْمِنُونَ } [الروم: 37] بتوحيد الله وأوصافه الذاتية الكاملة الجارية آثارها على مقتضى الحكمة والعدالة الإلهية\n المعبرة عنها بالصراط القويم والقسطاس المستقيم\n\n\nوبعدما أشار سبحانه إلى بسط الرزق على من يشاء\n وقبضه عمن يشاء إرادةً واختياراً\n أراد أن يشير إلى مصارفه فقال مخاطباً لحبيبه صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { أَوَلَمْ يروا أن الله يبسط الرزقَ لمن يشاءُ ويقدرُ } أي: يضيق على من يشاء، فينبغي للعبد أن يكون راجياً ما عند الله، غير آيس من روح الله إذ دَوَامُ حَالٍ من قضايا المحال، { إن في ذلك لآياتٍ لقوم يؤمنون } فيستدلون بها على كمال قدرته وحكمته، ولا يقفون مع شيء دونه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:52",
      "similarity": 0.9706449869499703
    },
    {
      "verse": "29:62",
      "similarity": 0.839336581648734
    },
    {
      "verse": "34:36",
      "similarity": 0.7730342768174585
    },
    {
      "verse": "34:39",
      "similarity": 0.7234458859501339
    },
    {
      "verse": "17:30",
      "similarity": 0.7226158328336542
    }
  ]
}