{
  "chapter": "الروم",
  "text": "فى ادنى الارض وهم منۢ بعد غلبهم سيغلبون",
  "translations": [
    {
      "translation": "in the land nearby, but after their defeat they will themselves be victorious",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the neighbouring land. But having been conquered they will conquer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in the neighbouring land; but after their defeat they shall gain victory in a few years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(within a few years) they will be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the nearby land, and after their defeat they will soon be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the nearest land, and they, after their defeat, will be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In a near land, and they, after being vanquished, shall overcome,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in the nearer part of the land; and, after their vanquishing, they shall be the victors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the nearer land, and they, after their defeat will be victorious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in a nearby land. They will reverse their defeat with a victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In a nearer land; and they, after the overcoming of them, shall soon overcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in a nearby land, but they, after their defeat, will be victorious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In a land close by; but they, (even) after (this) defeat of theirs, will soon be victorious-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the nearer land (Syria, Iraq, Jordan, and Palestine), and they, after their defeat, will be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in a land close by. But, in a few years after their defeat they shall become the victors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In a nearby territory. But following their defeat, they will be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the nearest land. But they, after their defeat, will overcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:3] in the nearer [part of the] land, that is, in the Byzantine land [that lies] nearest to Persia in Mesopotamia (al-Jazīra). There the two armies met and the Persians were the ones who had begun the invasion. But they, that is the Byzantines, after their vanquishing (ghalabihim: the verbal noun [ghalab] has been annexed to the direct object [hum], in other words, ghalabatu fāris iyyāhum, ‘the Persians’ vanquishing of them’) shall be the victors, over the Persians,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In the nearer land) close to Persia and, as a consequence, the believers were aggrieved while the idolaters rejoiced, saying: \"We shall defeat the believers just as the Persians defeated the Romans\", but then Allah proceeded to mention their victory (and they) i.e. the Romans, (after their defeat) at the hand of the Persians (will be victorious) over the Persians.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الم غلبت الروم } الذات الأحدية مع صفتي العلم والمبدئية كما ذكر، اقتضت أن روم القوى الروحانية تكون مغلوبة في أقرب موضع من أرض النفس الذي هو الصدر، لأن فيض المبدأ يوجب إظهار الخلق واحتجاب الحق به، فكل ما كان أقرب إلى الحق كان مغلوباً بالذي هو أقرب إلى الخلق وذلك حكم الاسم المبدئ في مظهر النشأة وتجليه تعالى به وباسمه الظاهر واسمه الخالق، وفي الجملة: بما في حضرته المبدئية من الأسماء { وهم من بعد } كونهم مغلوبين { سيغلبون } على فارس القوى النفسانية الأعجمية المحجوبة بالرجوع إلى الله، وظهور الغلب\n { في بضع سنين } من الأطوار التي يكون فيها الترقي إلى الكمال وأوقات الحضور والمقامات والتجليات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فِيۤ أَدْنَى ٱلأَرْضِ } وأقربها من أرض العرب وأرض الروم، وهي أذرعات الشام أو الأردن أو فلسطين - على اختلاف الروايات من أصحاب التواريخ - { وَ } ولا تغتموا أيها المؤمنون من مغلوبية أهل الكتاب وضعفهم؛ إذ { هُم } أي: الروم { مِّن بَعْدِ غَلَبِهِمْ } ومغلوبيتهم من الفرس { سَيَغْلِبُونَ } [الروم: 3] ويصيرون غالبين عليهم ، آخذين انتقامهم عنهم على أبلغ وجه وأشده لأبعد مدة مديدة، وأمد بعيد\n\n\n\n\nبل { فِي بِضْعِ سِنِينَ } والبضع عند العرب من الثلاث إلى التسع\n\n\n\n\nورُوي أن فارس غزوا الروم فتلاحقا بأذرعات الشام، وهي أقرب أرض الروم من الفرس والعرب أيضاً، فلما اقتحما غلب الفرس على الروم، فوصل الخبر إلى مكة فأخذ المشركون في فرح عظيم وسرور مفرط، شامتين بالمسلمين، قائلين إياهم: أنتم والنصارى أهل الكتاب، ونحن وفارس أميون لا كتاب لنا، وقد ظهر إخواننا على إخوانكم، فنحن لنظهرنَّ أيضاً عليكم مثلهم عن قريب، فنزلت الآية فقرأها صلى الله عليه وسلم على أبي بكر رضي الله عنه، فخرج عليهم، فقال لهم: لا يقر الله أعينكم أيها المشركون المسرفون، فوالله ليظهرن الروم على فارس بعد بضع سنين، فقال له أُبي بن خلف: كذبت، اجعل بننا أجلاً أناحبك وأراهنك فناحبه أبو بكر رضي الله عنه على عشر قلائص من كل واحد منهم، وجعل الأجل ثلاث سنين، فأخبر أبو بكر رضي الله عنه ما جرى بينهما على رسول الله صلى الله عليه وسلم، فقال صلى اله عليه وسلم:\n\n \" البضع ما بين الثلاث إلى التسع \"\n \n\n \n\nفرجع رضي الله عنه إلى أُبي فزايده الجعل والمدة أيضاً، فجعلاها مائة قلوص إلى تسع سنينن، ومات أُبي من طعن طعنه رسول الله صلى الله عليه وسلم يوم أُحد، وظهرت الروم على فارس يوم الحديبية أو بدر، فأخذ أبو بكر رضي الله عنه الخطر والرهن من ورثة أُبي، وجاء بها إلى رسول الله صلى الله عليه وسلم فقال صلى الله عليه وسلم:\n\n \" تصدق به \" \n\nفتصدق، فهذا قبل التحريم القمار، فلا يصح الاستدلال به على جواز العقود الفاسدة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا معنى قوله: { وهم } أي: الروم { من بعد غَلَبِهم } ، وقرئ: بسكون اللام كالحلَب والحلْب، وهو من إضافة المصدر إلى المفعول، أي: وهم من بعد غلبة فارس إياهم { سيَغْلِبون } فارس، وتكون الدولة لهم\n وذلك { في بِِضْعِ سنين } ، وهو ما بين الثلاث إلى العشر\n قال النسفي: قيل: احتربت الروم وفارس، بين أذرعاتِ وبُصرى، فغلبت فارسُ الروم، والمَلِكُ بفارس، يومئذٍ، كسرى \" أبرويز \" ، فبلغ الخبر مكة، فشقَّ ذلك على رسول الله صلى الله عليه وسلم والمؤمنين لأنَّ فارسَ مجوسٌ لا كتاب لهم، والروم أهل كتاب، وفرح المشركون وشمتوا، وقالوا: أنتم والنصارى أهل الكتاب، ونحن فارس أُمِّيُّون، وقد ظهر إخواننا على إخوانكم، ولنظهرنَّ نحن عليكم فنزلت الآية\n فقال أبو بكر: والله ليَظْهَرَنَّ الروم على فارس بعد بضع سنين، فقال له أُبَيُّ بنُ خلف: كذبت، فناحبه - أي: قامره - على عشر قلائص من كل واحد منهما، وجعل ثلالث سنين، فأخبر أبو بكر رسولَ الله صلى الله عليه وسلم، فقال - عليه الصلاة والسلام-:\n\n \" زِدْ في الخطر وأبعد في الأجل \" \n\n، فجعلاها مائة قلوص إلى تسع سنين ومات أبيّ من جرح رسول الله صلى الله عليه وسلم يوم أحد وظهرت الروم على فارس يوم الحديبية، أو: يوم بدر، فأخذ أبو بكر الخطر من ذرية أُبَيَّ، فقال عليه الصلاة والسلام -:\n\n \" تصدَّقْ به \"\n \n\nوهذه آية بينة على صحة نبوته، وأن القرآن من عند الله لأنها إنباء عن علم الغيب\n وكان ذلك قبل تحريم القمار، عن قتادة\n ومذهب ابي حنيفة ومحمد - رضي الله عنهما -: أن العقود الفاسدة كعقد الربا وغيره، جائز في دار الحرب بين المسلمين والكفار، واحتجا بهذه القصة\n هـ\n زاد البيضاوي: وأجيب بأنه كان قبل تحريم القمار\n هـ وقرئ: \" غلبت \" بالفتح، \" وسيُغلبون \" بالضم، ومعناه: أن الروم غَلَبُوا على ريف الشام، وسيغلبهم المسلمون، وقد غزاهم المسلمون في السنة التاسعة من نزولها، وفتحوا بعض بلادهم، وعلى هذا يكون إضافة الغلَب إلى الفاعل\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:116",
      "similarity": 0.6872653147032957
    },
    {
      "verse": "54:10",
      "similarity": 0.6386941165815465
    },
    {
      "verse": "26:40",
      "similarity": 0.5573520734667992
    },
    {
      "verse": "37:173",
      "similarity": 0.5376638420778124
    },
    {
      "verse": "58:21",
      "similarity": 0.5020862894529529
    }
  ]
}