{
  "chapter": "الروم",
  "text": "من الذين فرقوا۟ دينهم وكانوا۟ شيعا كل حزبۭ بما لديهم فرحون",
  "translations": [
    {
      "translation": "those who split up their deen, and form into sects, each faction exulting in what they have.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Or) one of those who created rifts in their order and are divided into sects, with each group exulting in what it has (carved out for itself) --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who have split up their religion and have become divided into sects, each party exulting in what they have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have divided themselves into various religious sects, each one happy with their own belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who broke their religion into several parts and became different groups; every group is happy with what it has.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who split up their religion, and became sects, each sect rejoicing in that which is with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who divided their religion and became seas every sect rejoicing in what they had with them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even of those who have divided up their religion, and become sects, each several party rejoicing in what is theirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who split up their religion and became schismatics, each sect exulting in its tenets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who split up their religion and became divided into sects; each one exulting in what they have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who split up their religion and became sects, each band in that which is with them exulting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who split up their religion and became sects: each faction boasting about what it possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who split up their Religion, and become (mere) Sects,- each party rejoicing in that which is with itself!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who split up their religion (i.e. who left the true Islamic Monotheism), and became sects, [i.e. they invented new things in the religion (Bid'ah), and followed their vain desires], each sect rejoicing in that which is with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who have divided their religion, and become sects, each rejoicing in what they have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who divided their religion, and became sects; each faction pleased with what they have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Or] of those who have divided their religion and become sects, every faction rejoicing in what it has.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:32] [of] those (mina’lladhīna is a substitution [for al-mushrikīna, ‘idolaters’] using the same operator of the oblique [min]) who have divided up their religion, by being at variance over what they worship, and have become [dissenting] factions, sects divided over this [matter], each party, among them, rejoicing, delighting, in what they have (a variant reading [for farraqū] is fāraqū, in other words, ‘of those who have parted with the religion to which they have been commanded’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Of those who split up their religion) they abandoned the religion of Islam (and became schismatics) they became different sects: Jews, Christians as well as all other sects, (each sect) the adherents of each sect (exulting in its tenets) fascinated with the religion they have, believing it to be the Truth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ } معناه جماعةٌ وفَريقٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Every faction rejoices in what it has,\" means a group and a faction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لحفظ فطرتكم التي هي التوحيد الذاتي { مِنَ ٱلَّذِينَ فَرَّقُواْ دِينَهُمْ } الوحداني الذي هو وقاية توحيدهم فرقاً مختلفة\n وابتدعوا فيه مذاهب متفاوتة متخالفة فتشعبوا شعباً كثيرة { وَكَانُواْ شِيَعاً } وأحزاباً يشايع ويروج { كُلُّ حِزْبٍ } منهم { بِمَا لَدَيْهِمْ } وعندهم من المذهب المبتدع المستحدث من تلقاء نفوسهم { فَرِحُونَ } [الروم: 32] مسرورون\n مدعون كل منهم حقية ما هم عليه من الباطل الزائغ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { من الذين فرقوا دينهم }: بدل من \" المشركين \" بإعادة الجار، أي: لا تكونوا من الذين جعلوا دينهم أدياناً مختلفة باختلاف ما يعبدونه لاختلاف أهوائهم\n وقرأ الأَخَوَان: فارقوا أي: تركوا دين الإسلام الذي أُمروا به، { وكانوا شِيَعاً } أي: فرقاً، كل فرقة تشايع إمامها الذي أضلها، أي: تشيعه، وتقوي سواده، { كل حزب } منهم { بما لديهم فرحون } مسرورون، ظناً بأنه الحق، ثُم يبدوا لهم من الله ما لم يكونوا يحتسبون\n والعياذ بالله\n الإشارة: الفطرة التي فَطَر الله الأرواحَ عليها في معرفة العيان، لأنها كلها كانت عارفة بالله، لصفائها ولطافتها، فما عاقها عن تلك المعرفة إلا كَثَافَةُ الأبدان، والاشتغالُ بحظوظها وهواها، حتى نسيت تلك المعرفة\n وفي ذلك يقول ابن البنا في مباحثه:\n\nقال بعضهم: إنما حجب الله عنها تلك العلوم غيرة أن تكشف سر الربوبية، فيظهر لغير أهله، قال القشيري: { فأَقِمْ وجْهَك } أي: أَخِلْصْ قَصْدَك إلى الله، واحفَظْ عهدك معه، وأَفْرِدْ عملك، في سكناتِك وحركاتك وجميع تصرفاتِك، له\n { حنيفاً } أي: مستقيماً في دينه، مائلاً عن غيره، مُعْرِضاً عن سواه\n والزَمْ فطرةَ الله التي فطر الناسَ عليها، ثم ذكر ما تقدم لنا\n ثم قال: { منيبين إليه } راجعين إلى الله بالكلية، من غير أن تبقى بقية، متصفين بوفائه، منحرفين بكل وجهٍ عن خلافه، مُتَّقينٍ صغير الإثم وكبيره، وقليله وكثيره، مقيمين الصلاة بأركانها وسننها وآدابها جهراً، متحققين بمرعاة فضلها سِراً\n وقال في قوله تعالى: { من الذين فَرَّقوا دينهم }: أقاموا في دنياهم في دار الغفلة، وعناد الجهل والفترة، فركنوا إلى ظنونهم، واستوطنوا مركب أوهامهم، وثَمِلُوا بِسُكْرِ غَيِّهِمْ، وظنوا أنهم على شيء، فإذا انكشف ضبابُ وقتهم، وانقشع سحابُ هجرهم، انقلب فرحُهم تَرَحاً، واستيقنوا أنهم كانوا في ضلالة، ولم يعرجوا إلا في أوطان الجهالة\n هـ\n ثم ذكر حال أهل الغفلة، فقال: { وَإِذَا مَسَّ ٱلنَّاسَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:53",
      "similarity": 0.562599360642157
    },
    {
      "verse": "6:159",
      "similarity": 0.5493451852285954
    },
    {
      "verse": "37:83",
      "similarity": 0.4741611433727994
    },
    {
      "verse": "15:10",
      "similarity": 0.47239103219457157
    },
    {
      "verse": "54:51",
      "similarity": 0.4535437953045717
    }
  ]
}