{
  "chapter": "الروم",
  "text": "ام انزلنا عليهم سلطنا فهو يتكلم بما كانوا۟ به يشركون",
  "translations": [
    {
      "translation": "Or have We sent down some authority to them, which advocates associating others with Him?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We sent down a charter to them which mentions what they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We sent down any sanction which provides support to their associating others with Allah in His Divinity?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We sent them any authority to speak in support of their idols?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sent down to them any proof, which therefore tells them of My partners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We revealed to them an authority, which speaks of that which they have been associating with Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, have We sent down upon them an authority so that it speaks of that which they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sent down any authority upon them, such as speaks of that they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We revealed unto them any warrant which speaketh of that which they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We sent down to them any authority which speaks in favour of what they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sent unto them any authority, so that it speaketh of that which they have been with Him associating?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We sent down to them any authority which might assert what they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sent down authority to them, which points out to them the things to which they pay part-worship?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We revealed to them a Scripture, which speaks of that which they have been associating with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sent down to them an authority that speaks of that they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We sent down to them any authority, which speaks in support of their idols?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sent down to them an authority, and it speaks of what they were associating with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:35] Or (am: the hamza here is meant for denial) have We revealed any warrant, any argument or scripture, to them which might speak, a token speech, of what they associate with Him?, in other words, commanding them to associate others with God? No!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "460 (Or have We revealed unto them) to the people of Mecca (any warrant) a book containing a pretext and proof from heaven (which speaketh of) and testifies about (that which they associate with Him) they make equal with Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ أَنزَلْنَا } يعني: بل أنزلنا { عَلَيْهِمْ } حينئذٍ { سُلْطَاناً } ملكاً ذا سلطنة وسطوة { فَهُوَ يَتَكَلَّمُ } معهم، ويذكرهم { بِمَا كَانُواْ بِهِ يُشْرِكُونَ } [الروم: 35] أي: بجميع ما صدر عنهم من الشرك والكفران، وأنواع الفسوق والعصيان بلا فوت شيءٍ منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم أنزلنا عليهم سلطاناً } حجّة على عبادة أصنامهم، { فهو يتكلمُ } ، وتكلمه مجاز، كما تقول: كتابه ناطق بكذا، وهذا مما نطق به القرآن، ومعناه: الشهادة، كأنه قال: يشهد بصحة ما { كانوا به يشركون } ، فما: مصدرية، أي: بصحة كونهم بالله يشركون، أو: موصولة، أي: بالأمر الذي بسببه يشركون",
      "translations": []
    }
  ]
}