{
  "chapter": "الروم",
  "text": "واذا اذقنا الناس رحمة فرحوا۟ بها وان تصبهم سيئةۢ بما قدمت ايديهم اذا هم يقنطون",
  "translations": [
    {
      "translation": "When We give people a taste of mercy, they rejoice in it, but when something bad happens to them because of what they themselves have done, they immediately lose all hope.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We give men a taste of Our benevolence they start rejoicing in it. When misfortune befalls them as a result of what they have done themselves, they begin to despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We make people have a taste of Our Mercy, they exult in it; and when any misfortune befalls them in consequence of their deeds, then lo and behold, they despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people receive mercy, they are happy with it. However, when hardship befalls them because of their own deeds, they despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We give people the taste of mercy they rejoice at it; and if an ill fortune reaches them because of what their hands have sent ahead – thereupon they lose hope!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We cause mankind to taste of mercy, they rejoice therein; but when some evil afflicts them because of what their hands have sent forth, behold, they are in despair!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We make people taste of mercy they rejoice in it, and if an evil befall them for what their hands have already wrought, lo! they are in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We let men taste mercy, they rejoice in it; but if some evil befalls them for that their own hands have forwarded, behold, they despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We cause mankind to taste of mercy they rejoice therein; but if an evil thing befall them as the consequence of their own deeds, lo! they are in despair!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We give mankind a taste of Our blessing, they rejoice therein: but if they encounter tribulation because of their own actions -- they fall into despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We cause mankind to taste of mercy they exult thereat; then if an evil befalleth them because of that which their hands have sent forth, lo! they despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We let people taste [Our] mercy, they boast about it; but should an ill visit them because of what their hands have sent ahead, behold, they become despondent!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We give men a taste of Mercy, they exult thereat: and when some evil afflicts them because of what their (own) hands have sent forth, behold, they are in despair!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We cause mankind to taste of mercy, they rejoice therein, but when some evil afflicts them because of (evil deeds and sins) that their (own) hands have sent forth, lo! They are in despair!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We give people a taste of mercy, they rejoice in it, but when evil befalls them through the forwarding of their own hands, they become despondent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We give people a taste of mercy, they rejoice in it. But when adversity befalls them, because of what their hands have perpetrated, they begin to despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We let the people taste mercy, they rejoice therein, but if evil afflicts them for what their hands have put forth, immediately they despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:36] And when We let people, that is, [people such as] the disbelievers of Mecca and others, taste some mercy, some grace, they exult in it, an exultation of arrogance. But if some evil, some hardship, befalls them for what their own hands have sent ahead, behold! they despair, of mercy. It is in the nature of a believer to give thanks in times of grace and to hope [for mercy] from his Lord in times of hardship.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا أَذَقْنَا النَّاسَ رَحْمَةً فَرِحُوا بِهَا وَإِنْ تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ إِذَا هُمْ يَقْنَطُونَ (36) أعيد الكلام على أحوال المشركين زيادة في بسط الحالة التي يتلقون بها الرحمة وضدها تلقياً يستوون فيه بعد أن مُيز فيما تقدم حال تلقي المشركين للرحمة بالكفران المقتضي أن المؤمنين لا يتلقونها بالكفران . فأريد تنبيههم هنا إلى حالة تلقيهم ضد الرحمة بالقنوط ليحذروا ذلك ويرتاضوا برجاء الفرج والابتهال إلى الله في ذلك والأخذ في أسباب انكشافها . والرحمة أطلقت على أثر الرحمة وهو المنافع والأحوال الحسنة الملائمة كما ينبني عنه مقابلتها بالسيئة وهي ما يسوء صاحبه ويحزنه فالمقصد من هذه الآية تخلق المسلمين بالخلق الكامل ، ف { الناس } مراد به خصوص المشركين بقرينة أن الآية ختمت بقوله { إن في ذلك لآيات لقوم يؤمنون .وقدمت في هذه الآية إصابة الرحمة على إصابة السيئة عكسَ التي قبلها للاهتمام بالحالة التي جُعلت مبدأ العبرة وأصل الاستدلال ، فقوله فرحوا بها } وصف لحال الناس عندما تصيبهم الرحمة ليبنَى عليه ضده في قوله { إذا هم يقنطون } لما يقتضيه القنوط من التذمر والغضب ، فليس في الكلام تعريض بإنكار الفرح حتى نضطر إلى تفسير الفرح بالبطر ونحوه لأنه عدول عن الظاهر بلا داع . والمعنى : أنهم كما يفرحون عند الرحمة ولا يخطر ببالهم زوالها ولا يحزنون من خشيته ، فكذلك ينبغي أن يصبروا عندما يمسهم الضر ولا يقنطوا من زواله لأن قنوطهم من زواله غير جار على قياس حالهم عندما تصيبهم رحمة حين لا يتوقعون زوالها ، فالقنوط هو محل الإنكار عليهم وهذا كقوله تعالى { لا يسأم الإنسان من دعاء الخير وإن مسَّه الشرُّ فيؤوس قنوط } \\[ فصلت : 49 \\] في أن محل التعجيب هو اليأس والقنوط ، وتقدم ذكر الإذاقة آنفاً . والقنوط : اليأس ، وتقدم في سورة الحجر ( 55 ) عند قوله تعالى { فلا تكن من القانطين } وأدمج في خلال الإنكار عليهم قوله { بما قدمت أيديهم } لتنبيههم إلى أن ما يصيبهم من حالة سيئة في الدنيا إنما سببها أفعالهم التي جعلها الله أسباباً لمسببات مؤثرة لا يحيط بأسرارها ودقائقها إلا الله تعالى ، فما على الناس إلا أن يحاسبوا أنفسهم ويجروا أسباب إصابة السيئات ، ويتداركوا ما فات ، فذلك أنجى لهم من السيئات وأجدر من القنوط . وهذا أدب جليل من آداب التنزيل قال تعالى { ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك } \\[ النساء : 79 \\] .وقرأ الجمهور { يقنَطون } بفتح النون على أنه مضارع قَنِط من باب حسِب . وقرأه أبو عمرو والكسائي بكسر النون على أنه مضارع قَنط من باب ضرب وهما لغتان فيه .ثم أنكر عليهم إهمال التأمل في سنّة الله الشائعة في الناس : من لحاق الضر وانفراجه ، ومن قسمة الحظوظ في الرزق بين بسط وتقتير فإنه كثير الوقوع كل حين فكما أنهم لم يقنطوا من بسط الرزق عليهم في حين تقتيره فكدحوا في طلب الرزق بالأسباب والدعاء فكذلك كان حقهم أن يتلقوا السوء النادر بمثل ما يتلقون به ضيق الرزق ، فيسعَوا في كشف السيئة بالتوبة والابتهال إلى الله وبتعاطي أسباب زوالها من الأسباب التي نصبها الله تعالى ،\n\n",
      "translations": [
        {
          "translation": "(And when We cause mankind) the disbelievers of Mecca (to taste of mercy) bounty (they rejoice therein) without giving thanks for it; (but if an evil thing) hardship, tightness, drought or sickness (befall them as the consequence of their own deeds) which they did in their state of idolatry, (lo! they are in despair) they despair from the mercy of Allah, and fail to withstand it!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَإِذَآ أَذَقْنَا ٱلنَّاسَ رَحْمَةً } وأعطيناهم نعمة وسعة في الرزق\n وصحة في الجسم على الترادف والتوالي { فَرِحُواْ بِهَا } وأفرطوا في الفرح والسرور إلى أن بطروا\n وباهوا مفتخرين بما عندهم من الأسباب { وَإِن تُصِبْهُمْ } أحياناً { سَيِّئَةٌ } مثل جدب وعناء\n ومصيبة وبلاء تسوءهم\n مع أنهم إنما أصابهم { بِمَا قَدَّمَتْ أَيْدِيهِمْ } أي: بشؤم ما اقترفوا من المفاسد والمعاصي الموجبة للبطش والانتقام\n فانتقمنا منهم\n لذلك { إِذَا هُمْ يَقْنَطُونَ } [الروم: 36] أي: فجاءوا على اليأس والقنوط منا بحيث لا يتوجهون إلينا\n لكشفها وتفريجها\n بل لا يعتقدون قدرتنا على كشفها ورفعها\n\n\n{ أَ } ينكرون قدرتنا أولئك المنكرون المفرطون { وَلَمْ يَرَوْاْ أَنَّ ٱللَّهَ } القادر على أنواع اللطف والكرم كيف { يَبْسُطُ } ويفيض { ٱلرِّزْقَ } الصوري والمعنوي { لِمَن يَشَآءُ } بسطه إياه { وَ } كيف { يَقْدِرُ } ويقبض لمن يشاء قبضه عنه على مقتضى حكمته المتقنة؟! { إِنَّ فِي ذَلِكَ } القبض والبسط { لآيَاتٍ } دلائل واضحات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا أذقنا الناسَ رحمةً } أي: نعمة من مطر\n أو: سعة رزق\n أو: صحة\n { فَرِحُوا بها } فرح بَطَرَ وافتخار وغفلة\n { وإن تُصبهم سيئة } بلاء من جدب\n أو ضيق\n أو مرض\n { بما } بسبب ما { قدمتْ أيديهم } من المعاصي\n أي: بشؤمها\n { إِذا هم يَقْنَطُون } ييأسون من رحمة الله\n وفرجِهِ بعد عسره\n يقال: قَنِطَ يَقْنَطُ\n كفرح يفرح\n وكعلم\n الإشارة: الواجب على المؤمنين أن يختلفوا بضد ما تخلق به الكافرون\n فإذا مسهم ضر أو شدة\n توجهوا إلى الله\n إما بالتضرع والابتهال عبودية\n منتظرين ما يفعل الله\n وإما بالصبر\n والرضا\n والسكون تحت مجاري الأقدار\n فإذا جاء الفرج والنعمة شكروا الله وحمدوه\n ونسبوا الفرج إليه وحده\n فإن كان وقع منهم سبب شرعي لم يلتفتوا إليه قط إذ لا تأثير له أصلاً\n وإنما الفرج عنده لا به\n فلا يقولوا: فلان ولا فلانة\n وإنما الفاعل هو الله الواحد القهار\n وهذا الشرك الخفي مما ابتلى به كثير من الناس\n علماء وصالحين\n وخصوصاً منهم من يتعاطى كتب الفلسفة\n كالأطباء وغيرهم\n إذا أصابهم شيء فزعوا\n فإذا فَرَّجَ عنهم قالوا: فلان داوانا\n وفلان فرَّج عنا\n والدواء الفلاني هو شفاني\n فتعالى الله عما يشكرون\n فليشدّ العبدُ يده على التوحيد\n ولا يرى في الوجود إلا الفرد الصمد\n الفعّال لما يريد\n ومن أوصاف أهل الغفلة: أنهم\n إذا أصابتهم نعمة\n فرحوا وافتخروا بها\n وإذا أصابتهم شدة قنطوا وأيسوا من روح الله\n والواجب: ألا يفرح بما هو عارض فانٍ\n ولا ييأس من روح الله عند الشدة\n بل ينتظر من الله الفرج\n فإنَّ مع العسر يسراً\n إن مع العسر يسرا\n قال تعالى:\n[الحديد: 22 -23] الآية\n وبالله التوفيق\n ثم برهن على توالي النعم والمحن على العبد\n ما دام في دار الدنيا\n فقال: { أَوَلَمْ يَرَوْاْ أَنَّ ٱللَّهَ يَبْسُطُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:56",
      "similarity": 0.7155905885211736
    },
    {
      "verse": "15:55",
      "similarity": 0.6994643468341422
    },
    {
      "verse": "39:53",
      "similarity": 0.59991782444174
    },
    {
      "verse": "42:48",
      "similarity": 0.5336263914724282
    },
    {
      "verse": "42:28",
      "similarity": 0.4290790227535551
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}