{
  "chapter": "الروم",
  "text": "فى بضع سنين لله الامر من قبل ومنۢ بعد ويومئذ يفرح المؤمنون",
  "translations": [
    {
      "translation": "in a few years' time. The affair is Allah's from beginning to end. On that day, the muminun will rejoice",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In a few years (less than ten). God's is the imperative first and last. On that day the believers will rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All power belongs to Allah both before and after. On that day will the believers rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All matters of the past and future are in the hands of God. The believers will enjoy the help of God on that Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Within a few (up to nine) years time; only for Allah is the command, before and after; and the believers will rejoice on that day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Bid`i years. The decision of the matter, before and after is only with Allah. And on that day, the believers will rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Within a few years. Allah's is the command before and after; and on that day the believers shall rejoice,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in a few years. To God belongs the Command before and after, and on that day the believers shall rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Within ten years - Allah's is the command in the former case and in the latter - and in that day believers will rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "within a few years: [for] with God rests all power of decision, first and last. On that day the believers too will have cause to rejoice,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In some few years. Allah's is the command, before and after. And on that day the believers wiil rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in a few years. All command belongs to Allah, before this and hereafter, and on that day the faithful will rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Within a few years. With Allah is the Decision, in the past and in the Future: on that Day shall the Believers rejoice-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Within three to nine years. The decision of the matter, before and after (these events) is only with Allah, (before the defeat of Romans by the Persians, and after, i.e. the defeat of the Persians by the Romans). And on that Day, the believers (i.e. Muslims) will rejoice (at the victory given by Allah to the Romans against the Persians),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Command before and after, and on that Day the believers will rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In a few years. The matter is up to God, in the past, and in the future. On that day, the believers will rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Within three to nine years. To Allah belongs the command before and after. And that day the believers will rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:4] in a few years (bid‘, [usually means] between three and nine or ten years). So the two armies met again seven years after this former encounter and the Byzantines defeated the Persians. To God belongs the command before and after, that is, before the defeat of the Byzantines and thereafter, that is to say, the Persian victory at first and the Byzantine victory later were [the result of] God’s command, in other words, His will, and on that day, the day when the Byzantines will be victorious, the believers shall rejoice\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Within a few years) at the beginning of the seventh year from now; Abu Bakr al-Siddiq betted ten camels on this against Ubayy Ibn Khalaf al-Jumahi (Allah's is the command) victory and the upper hand to 456 Muhammad (pbuh) (in the former case) before the Persians defeated the Romans (and in the latter) and after the Persian defeated the Romans; it is also said that this means: before and after the victory of the Romans against the Persians; it is also said: to Allah belongs knowledge, power, will, before the beginning of creation and after the evanescence of creation; and it is also said that this means: Allah was Commander before and after the creation of those He commanded just as He was Creator before and after the existence of creation, and Provider before and after the existence of those for whom He provided, and Master before and after the existence of His subjects (and in that day) when the Romans will defeat the Persians and also when He gives victory to Muhammad (pbuh) over the disbelievers of Mecca, on the Day of Badr, or on the Day of al-Hudaybiyyah, (believers will rejoice\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { بِضْعِ سِنِينَ } فالبِضعُ: ما بينَ الثلاثةِ إِلى التسعةِ\n وقال: ما بينَ ثَلاثةٍ وخمسةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: Ali ibn Ahmad narrated to us.\n\n\nHe said: We were told by 'Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn 'Ali, peace be upon them, regarding the words of Allah, {in a few years' time} that \"al-bid'u\" refers to the period between three and nine years.\n He said: \"Between three and five.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لله الأمر من قبل } بحكم اسمه المبدىء { ومن بعد } بحكم اسمه المعيد\n يدبر الأمر من السماء إلى الأرض ثم يعرج إليه { ويومئذ } أي: يوم غلبة روم الروحانيات على النفسانيات { يفرح المؤمنون بنصر الله } وتأييده من الملكوت السماوية وإمدادهم بالأمداد القدسية { ينصر من يشاء } من أهل عنايته المستعدّين بها { وهو العَزِيز } القويّ الغالب على قهر الفارسيين المحجوبين { الرحِيم } بإضافة الأمداد الكمالية والأنوار التأييدية القدسية على الروميين الغالبين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { لِلَّهِ } وفي قبضة قدرته واختياره { ٱلأَمْرُ } كله غيباً وشهادةً\n دنيا وعقبى { مِن قَبْلُ } أزلاً { وَمِن بَعْدُ } أبداً\n لا راد لأمره\n ولا معقب لحكمه\n يفعل الله على مقتضى إرادته واختياره ما يشاء\n ويحكم حسب حكمته ما يريد { وَيَوْمَئِذٍ } أي: حين غلب الروم على الفرس في رسن السنة التاسعة\n إنجازاً لما وعد به سبحاه المؤمنين { يَفْرَحُ ٱلْمُؤْمِنُونَ } [الروم: 4] مثلما فرح المشركون في الوقعة السابقة\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ لله الأمرُ من قبلُ ومن بعد } أي: من قبل كل شيء\n ومن بعد كل شيء\n أو: من قبل الغلبة وبعدها\n كأنه قيل: من قبل كونهم غالبين - وقبله: وهو وقت كونهم مغلوبين - ومن بعد كونهم مغلوبين - وهو وقت كونهم غالبين\n يعني: أن كونهم مغلوبين أولاًُ\n وغالبين آخراً\n ليس إلا بأمر الله وقضائه\n\n[آل عمران: 140]\n { ويومئذٍ } أي: ويوم تغلب الرومُ فارسَ\n ويحل ما وعده الله من غلبتهم\n { يفرح المؤمنون بنصر الله } \n وتغلب من له كتاب على مَن لا كتاب له\n وغيظ من شمت بهم من أهل مكة\n وقيل: نصر الله: هو إظهار صدق المؤمنين\n بما أخبروا به المشركين من غلبة الروم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:42",
      "similarity": 0.6162476281511826
    },
    {
      "verse": "12:62",
      "similarity": 0.41314668604978017
    },
    {
      "verse": "12:88",
      "similarity": 0.34490994695792804
    },
    {
      "verse": "12:19",
      "similarity": 0.3141699444235724
    },
    {
      "verse": "9:50",
      "similarity": 0.2915458712690147
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/30:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/30:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}