{
  "chapter": "الروم",
  "text": "ومن ءايته ان يرسل الرياح مبشرت وليذيقكم من رحمته ولتجرى الفلك بامره ولتبتغوا۟ من فضله ولعلكم تشكرون",
  "translations": [
    {
      "translation": "Among His Signs is that He sends the winds bearing good news, to give you a taste of His mercy, and to thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs are the breezes He sends as harbingers of happy news, so that He may allow you to taste of His mercy, and that ships may sail by His command, and you may seek of His bounty, and may haply be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that He sends winds to herald good tidings and that He may give you a taste of His Mercy, and that ships may sail at His bidding, and you may seek His Bounty and give thanks to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some evidence of His existence is His sending the glad-news-bearing winds so that He would let you to receive His mercy, cause the ships to sail by His command, and let you seek His favor so that perhaps you would give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that He sends winds heralding glad tidings, to make you taste His mercy, and so that the ships may sail by His command, and so that you may seek His munificence, and for you to give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is this that He sends the winds as glad tidings, giving you a taste of His mercy, and that the ships may sail at His command, and that you may seek of His bounty, in order that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is that He sends forth the winds bearing good news, and that He may make your taste of His mercy, and that the ships may run by His command, and that you may seek of His grace, and that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He looses the winds, bearing good tidings and that He may let you taste of His mercy, and that the ships may run at His commandment, and that you may seek His bounty; haply so you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is this: He sendeth herald winds to make you taste His mercy, and that the ships may sail at His command, and that ye may seek his favour, and that haply ye may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is this: He sends out the winds bearing good news so that He may make you taste His mercy, and ships sail at His command, so that you may seek His bounty, and be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that he sendeth winds heralding rain and that he may make you taste of His mercy, and that the ships may sail at His command and that ye may seek His grace, and that haply ye may return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He sends the winds as bearers of good news and to let you taste of His mercy, and that the ships may sail by His command, and that you may seek of His bounty, and so that you may give [Him] thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His Signs is this, that He sends the Winds, as heralds of Glad Tidings, giving you a taste of His (Grace and) Mercy,- that the ships may sail (majestically) by His Command and that ye may seek of His Bounty: in order that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is this, that He sends the winds as glad tidings, giving you a taste of His Mercy (i.e. rain), and that the ships may sail at His Command, and that you may seek of His Bounty, in order that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He looses the winds as bearers of glad tidings, so that He lets you taste His Mercy and that the ships may sail at His command in order that you can seek His bounty and be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He sends the winds bearing good news, to give you a taste of His mercy, and so that the ships may sail by His command, and so that you may seek of His bounty, and so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that He sends the winds as bringers of good tidings and to let you taste His mercy and so the ships may sail at His command and so you may seek of His bounty, and perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:46] And of His signs, exalted be He, is that He unleashes the winds as bearers of good tidings, meaning, so that they may bring you good tidings of rain, and that He may let you taste, thereby, of His mercy, namely, [in the way of] rain and fertile soil, and that the ships may run, thereby, by His command, by His will, and that you may seek, [that you may] request of, His bounty, provision, by way of commerce at sea, and that perhaps you might [then] give thanks, for these graces, O people of Mecca, and so affirm His Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His signs) and of the signs of His divine Oneness and power (is this: He sendeth herald winds) that the rain is being created (to make you taste His mercy) His bounty, (and that the ships may sail at His command) by His will in the sea, (and that ye may seek His favour) that by sailing in your ships you seek His provision, (and that haply ye may be thankful) for His bounty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ } جملة { آيَاتِهِ } سبحانه الدالة على كمال رأفته ورحمته للمؤمنين المتحققين لمرتبة التوحيد\n المتمكنين بمقر الوحدة الذاتية: { أَن يُرْسِلَ ٱلرِّيَاحَ } المشتملة لأنواع الروح والراحة\n المهبة من نفحات النفسات الرحمانية\n ليتعرضوا لها ويستنشقوا منها فيضان آثار اللطف والجمال\n مع كونها { مُبَشِّرَاتٍ } لمزيد فضله وطوله\n ونزول أنواع رحمته وجوده { وَلِيُذِيقَكُمْ } ويفيض عليكم { مِّن } سعة { رَّحْمَتِهِ } ما ينجيكم ويخلصكم من لوازم بشريتكم وناستوكم { وَلِتَجْرِيَ ٱلْفُلْكُ } أي: سفن تعيناتكم الجارية في بحر الوجود { بِأَمْرِهِ } وعلى مقتضى مشيئته وإرادته { وَلِتَبْتَغُواْ } وتطلبوا بعدما فوضتم أموركم إليه واتخذتموه وكيلاً { مِن } موائد { فَضْلِهِ } وإحسانه\n وعوائد كرمه وجوده ما لا عينٌ رأت ولا أذنٌ سمعت\n ولا خطر على قلب بشر { وَ } إنما فعل معكم سبحانه هذه الكرامات { لَعَلَّكُمْ تَشْكُرُونَ } [الروم: 46] رجاء أن تشكروا نعمه\n وتفوزوا بمزيد كرمه\n وتتحقوا بمقام معرفته وتوحيده الذي جبلتم لأجله\n\n\nثمَّ قال سبحانه مقسماً تسليةً لرسول الله صلى الله عليه وسلم وإزالةً لهمه وحزنه من تكذيب الجهلة المسرفين\n المشركين بالله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: وليذيقكم: عطف على مبشرات على المعنى، كأنه قيل: لتبشركم وليذيقكم، أو: على محذوف، أي: ليغيثكم وليذيقكم. يقول الحق جل جلاله: { ومن آياته } الدالة على كمال قدرته: { أن يُرسلَ الرياحَ } ، وهي الجَنُوبُ، والصَّبا، والشمال والدَّبُورُ، فالثلاث: رياح الرحمة، والدبور: ريحُ العذاب، ولذلك قال عليه الصلاة والسلام:\n \" اللهم اجعلها رياحاً، ولا تجعلها ريحاً \" \nوقال:\n \" نُصرْتُ بالصِّبَا، وأُهْلِكتَ عادٌ بالدَّبُورُ \" \n، وهي الريح العقيم. وقرأ ابن كثير والأَخَوان: بالإفراد، على إرادة الجنس. ثم ذكر فوائد إرسالها بقوله: { مبشرات } أي: أرسلها بالبشارة بالغيب { وليُذِيقَكُم من رحمته } ولإذاقة الرحمة، وهي نزول المطر، وحصول الخصب الذي يتبعه، والرّوح الذي مع هبوب الريح، وزكاء الأرض، أي: ربوها وزيادتها بالنبات، وغير ذلك من منافع الرياح والأمطار. قال الحسن: لو أمسك الله عن أهل الأرض الريح ساعة لَمَاتُوا غَمَّا. { ولِتجريَ الفلكُ } في البحر عند هبوبها { بأمره } بتدبيره، أو بتكوينه، لقوله:\n[يس: 82] الآية. قيل: إنما زاد بأمره لأنها قد تهب غير مُوَاتِيَةٍ، فتُغرق، وهي عند أمره أيضاً، فهي على حسب أمره، ولأن الإسناد وقع للفلك مجازاً، فأخبر أنه بأمره، { ولتبتغوا من فضله } ، يريد به تجارة البحر، { ولعلكم تشكرون } هذه النعم فيزيدكم من فضله. الإشارة: ومن آياتِ فَتْحِهِ على أوليائه: أن يرسل رياح الهداية أولاً، ثم رياح التأييد، ثم رياح الواردات، تحمل هدايا التَّعَرُّفَاتِ، مبشرات بالفتح الكبير، والتمكين في شهود العلي الكبير، وليذيقكم من رحمته، وهي حلاوة معرفته، ولتجريَ سفن الأفكار في ميادين بحار توحيده، ولتبتغوا من فضله، هو الترقي في الكشوفات والعلوم والأسرار، أبداً سرمداً، ولعلكم تشكرون بالقيام برسوم الشريعة وآداب العبودية. قال القشيري: يرسل رياحَ الرجاءِ على قلوب العُبَّاد، فتكنس قلوبهم من غبار الحسد وغُثَاء النفس، ثم يرسل عليها أمطار التوفيق، فتحملهم إلى بساط الجُهْدِ، وتكرمهم بقوى النشاط. ويرسل رياحَ البَسْطِ على أرواح الأولياء فتطهرها من وَحْشَةِ القبض، وتنشر فيه لذاذات الوصال، ويرسل رياحَ التوحيد فتهب على أسرار الأصفياء، فتطهرها من آثار الأغيار، وتبشرها بدوام الوصال، فذلك ارتياحٌ به،ولكن بعد اجتناحٍ عنك. هـ. أي: بعد ذهابٍ عنك وزوال. والله تعالى أعلم. ثم سلى نبيه بمن قبله، فقال: { وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ رُسُلاً إِلَىٰ قَوْمِهِمْ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:12",
      "similarity": 0.6625194768225918
    },
    {
      "verse": "31:31",
      "similarity": 0.5132066082247994
    },
    {
      "verse": "28:73",
      "similarity": 0.39239264799469975
    },
    {
      "verse": "23:22",
      "similarity": 0.36775903053453096
    },
    {
      "verse": "14:32",
      "similarity": 0.3271824039040279
    }
  ]
}