{
  "chapter": "الروم",
  "text": "فاقم وجهك للدين القيم من قبل ان ياتى يوم لا مرد له من الله يومئذ يصدعون",
  "translations": [
    {
      "translation": "So set your face firmly towards the True Deen, before a Day comes from Allah which cannot be turned back. On that Day they will be split up.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set your face towards the straight path before the day arrives from God which is irreversible. Men will be segregated on that day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So turn your face exclusively towards the True Faith before there comes the Day whose coming from Allah cannot be averted, the Day when people will split into groups.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be devoted to the upright religion before the coming of the inevitable day when no one can escape from God and people will either be sent to Paradise or hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore set your attention for worshipping, before the day from Allah which cannot be averted – on that day people will be split, separated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, set you your face to the straight and right religion, before there comes from Allah a Day which none can avert. On that Day men shall be divided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then turn thy face straight to the right religion before there come from Allah the day which cannot be averted; on that day they shall become separated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set thy face to the true religion before there comes a day from God that cannot be turned back; on that day they shall be sundered apart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set thy purpose resolutely for the right religion, before the inevitable day cometh from Allah. On that day mankind will be sundered-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Prophet], set your face to the right religion, before that Day comes from God which cannot be averted. On that Day, mankind will be parted in two.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set thy face toward the right religion before the Day cometh from which there is no averting, from Allah, on that Day they shall be sundered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set your heart on the upright religion, before there comes a day irrevocable from Allah. On that day they shall be split [into various groups].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But set thou thy face to the right Religion before there come from Allah the Day which there is no chance of averting: on that Day shall men be divided (in two).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set you (O Muhammad SAW) your face to (the obedience of Allah, your Lord) the straight and right religion (Islamic Monotheism), before there comes from Allah a Day which none can avert it. On that Day men shall be divided [(in two groups), a group in Paradise and a group in Hell].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore in purity set your face to the religion, before there comes from Allah a Day that cannot be turned back. On that Day mankind will be separated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So devote yourself to the upright religion, before there comes from God a Day that cannot be averted. On that Day, they will be shocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So direct your face toward the correct religion before a Day comes from Allah of which there is no repelling. That Day, they will be divided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:43] So set your purpose for the upright religion, the religion of Islam, before there comes the inevitable day from God, namely, the Day of Resurrection. On that day they shall be sundered (yassadda‘ūna: the original tā’ [yatasadda‘ūna] has been assimilated with the sād), that is, they will be split [into separate groups] after the Reckoning [destined] for Paradise or the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So set your purpose) set your own self and works (resolutely for the right religion) He says: make your religion and works sincere to Allah, and follow the true, straight religion, (before the inevitable day) which is the Day of Judgement (comes from Allah. On that day) the Day of Judgement (mankind will be sundered) a party of them in Paradise and a party in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَئِذٍ يَصَّدَّعُونَ } معناه يَتفرقُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"On that day they will part ways,\" means they will be dispersed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أشار سبحانه إلى وخامة عاقبة أصحاب الآراء الفاسدة، والأهواء الباطلة من المنحرفين عن جادة الاستقامة، المنصرفين عن سبيل السلامة، أمر حبيبه صلى الله عليه وسلم بالإقامة والاستقامة في منهج العدالة التي هي دين الإسلام الناسخ لجميع الأديان الباطلة، والآراء الزاهقة الزائلة، فقال: { فَأَقِمْ وَجْهَكَ } أي: استقم وتوجه يا أكمل الرسل بوجه قلبك الذي يلي الحق { لِلدِّينِ ٱلْقِيِّمِ } المنزل من عنده سبحانه على الاستقامة والعدالة تفضلاً عليك وامتناناً { مِن قَبْلِ أَن يَأْتِيَ } ويجيء { يَوْمٌ لاَّ مَرَدَّ لَهُ } أي: لا يرد فيه ما نفذ من القضاء المبرم؛ لأن إتيانه { مِنَ ٱللَّهِ } العليم الحكيم على هذا الوجه؛ إذ لا استكمال ولا رجوع حينئذٍ، ولا ينفع الطاعة والعبادة حين حلوله، بل { يَوْمَئِذٍ يَصَّدَّعُونَ } [الروم: 43] أي: يتفرق الناس فرقاً، ويتحزبون أحزاباً على مقتضى ما كانوا عليه في نشأة الابتلاء والاختبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "86:12",
      "similarity": 0.8526906661331305
    },
    {
      "verse": "15:94",
      "similarity": 0.8195318216202405
    },
    {
      "verse": "59:21",
      "similarity": 0.5789438289737275
    },
    {
      "verse": "56:19",
      "similarity": 0.41676537200611047
    },
    {
      "verse": "12:96",
      "similarity": 0.21057505451579883
    }
  ]
}