{
  "chapter": "الروم",
  "text": "الله الذى يرسل الريح فتثير سحابا فيبسطه فى السماء كيف يشاء ويجعله كسفا فترى الودق يخرج من خلله فاذا اصاب به من يشاء من عباده اذا هم يستبشرون",
  "translations": [
    {
      "translation": "It is Allah who sends the winds which stir up clouds which He spreads about the sky however He wills. He forms them into dark clumps and you see the rain come pouring out from the middle of them. When He makes it fall on those of His slaves He wills, they rejoice,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends the breezes that raise clouds, then spreads them over the sky as He please, fold on fold, then you see the drops of rain issue from between them. When He sends it down to those of His creatures as He will, they are filled with joy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends the winds that stir up clouds and then He spreads them in the sky as He pleases and splits them into different fragments, whereafter you see drops of rain pouring down from them. He then causes the rain to fall on whomsoever of His servants He pleases, and lo, they rejoice at it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends the winds to raise the clouds. He spreads them in the sky as He wants, then He intensifies them, and then you can see the rain coming down from the cloud. When He sends it down upon whichever of His servants He wants, they rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who sends the winds raising the clouds – therefore spreads them in the sky as He wills and shatters them – so you see the rain dropping from inside it; so when He delivers it upon whomever He wills among His bondmen, thereupon they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who sends the winds, so that they raise clouds and spread them along the sky as He wills, and then break them into fragments until you see rain drops come forth from their midst! Then when He has made them fall on whom of His servants as He wills, lo, they rejoice!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is he Who sends forth the winds so they raise a cloud, then He spreads it forth in the sky as He pleases, and He breaks it up so that you see the rain coming forth from inside it; then when He causes it to fall upon whom He pleases of His servants, lo! they are joyful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He that looses the winds, that stir up clouds; and He spreads them in heaven how He will, and shatters them; then thou seest the rain issuing out of the midst of them, and when He smites with it whomsoever of His servants He will, lo, they rejoice,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who sendeth the winds so that they raise clouds, and spreadeth them along the sky as pleaseth Him, and causeth them to break and thou seest the rain downpouring from within them. And when He maketh it to fall on whom He will of His bondmen, lo! they rejoice;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends out the winds so that they raise the clouds. Then He spreads them in the sky as He wills and places them layer upon layer and you see the rain issuing forth from their midst. When He causes it to fall on whichever of His servants He pleases, behold! they rejoice;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who sendeth the winds so that they raise a cloud and then spreadeth it along the heaven as He will and breaketh it into fragments, and thou beholdest the rain come forth from the intestines thereof. Then when He maketh it fall upon such of His bondmen as He will, lo! they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who sends the winds. Then they generate a cloud, then He spreads it as He wishes in the sky, and forms it into fragments, whereat you see the rain issuing from its midst. Then, when He strikes with it whomever of His servants that He wishes, behold, they rejoice;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who sends the Winds, and they raise the Clouds: then does He spread them in the sky as He wills, and break them into fragments, until thou seest rain-drops issue from the midst thereof: then when He has made them reach such of his servants as He wills behold, they do rejoice!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who sends the winds, so they raise clouds, and spread them along the sky as He wills, and then break them into fragments, until you see rain drops come forth from their midst! Then when He has made them fall on whom of His slaves as He will, lo! they rejoice!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who looses the winds that stir the clouds. He spreads them as He will in heaven and disperses them, so that you can see the rain falling from their midst. When He smites with it whom He will of His worshipers they rejoice,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He who sends the winds. They stir up clouds. Then He spreads them in the sky as He wills. And He breaks them apart. Then you see rain drops issuing from their midst. Then, when He makes it fall upon whom He wills of His servants, behold, they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who sends the winds, and they stir the clouds and spread them in the sky however He wills, and He makes them fragments so you see the rain emerge from within them. And when He causes it to fall upon whom He wills of His servants, immediately they rejoice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:48] God is the One Who unleashes the winds which then raise, stir up, clouds, and He then spreads them across the heaven as He will, in small or large quantities, and He forms them into fragments (read kisafan or kisfan: ‘scattered pieces’) then you see the rain issuing out of them, that is, out of the midst of them. Then when He drops it, the rain, upon whomever of His servants He will, lo! they rejoice, they are happy because of the rain.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah is He Who sendeth the winds so that they raise clouds) they raise as cloud heavy with the rain, (and spreadeth them along the sky as pleases Him, and causeth them to break and thou seest the rain downpouring from within them) from within the clouds. (And when He maketh it) the rain (to fall on whom He will of His bondmen) in the earth, (lo! they rejoice) for the coming down of rain;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n{ فَتُثِيرُ سَحَاباً } معناه تُهيجُهُ\n\n\n\n\nوقوله تعالى: { فَتَرَى ٱلْوَدْقَ } معناه المَطرُ\n { يَخْرُجُ مِنْ خِلاَلِهِ } معناه من وسَطِهِ\n\n",
      "translations": [
        {
          "translation": "\n\nThis {phrase} means \"to stir up a storm.\"\n\n\nAnd His saying, \"Then you will see the rain\" - its meaning is the rain.\n He emerges from his midst",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفكيف لا يقبل منهم أولئك البعداء\n المنكرون المسرفون وحي العحق إياهم وإلهامهم عليه\n مع أنه { ٱللَّهُ } الجامع لجميع مراتب الأسماء والصفات الظاهرة\n المتجلي على مقتضاها بالاستقلال إرادةً واختياراً { ٱلَّذِي يُرْسِلُ ٱلرِّيَاحَ } المنتشئة من محض فضله وجوده بلا سبق سبب يوجبها\n وعلة تقتضيها على ما جرى عليه عادته سبحانه في سائر الموجودات { فَتُثِيرُ } وتحرك أجزاء البخار والدخان\n ويمتزج بعضها مع بعض فتركمها وتكشفها حتى صارت { سَحَاباً } هامراً { فَيَبْسُطُهُ } سبحانه { فِي } جو { ٱلسَّمَآءِ كَيْفَ يَشَآءُ } عرضاً وطولاً\n سائراً وواقفاً\n مطبقاً وغير مطبقٍ\n إلى غير ذلك من الأوضاع الممكنة الورود عليها\n\n\n{ وَ } بعدما مهدة سبحانه وبسطه { يَجْعَلُهُ كِسَفاً } أي: قطعاً مختلفة { فَتَرَى } أيها الرائي { ٱلْوَدْقَ } المطر { يَخْرُجُ } ويفيض { مِنْ خِلاَلِهِ } وفتوقه بعدما تكوَّن فيه بقدرة الله من اجتماع أجزاء الأبخرة والأدخنة المتصاعدة الممتزجة\n المتراكمة المتكاثفة\n المتفاعلة بعضها مع بعض إلى أن صارت ماء فتقطر وتسيل { فَإِذَآ أَصَابَ بِهِ } أراضي { مَن يَشَآءُ مِنْ عِبَادِهِ } عنايةً منه سبحانه إياهم\n وتفضلاً عليهم { إِذَا هُمْ يَسْتَبْشِرُونَ } [الروم: 48] أي: فوجئوا بنزوله إلى أنواع الاستبشار والابتهاج\n والفرح والسرور متفائلين بنزوله إلى الخصب والرخاء\n وأنواع البهجة والصفاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { اللهُ الذي يُرسل الرياحَ } الأربع\n وقرأ المكي: بالإفراد\n { فتُثير } أي: تزعج { سحاباً فيبسُطُه في السماء } أي: يجعله منبسطاً\n متصلاً بعضه ببعض في سَمت السماء\n كقوله:\n[إبراهيم: 24]\n أي: جهته\n فيبسطها في الجو { كيف يشاء } سائراً أو واقفاً\n مطبقاً وغير مطبق\n من ناحية الشمال أو الجنوب\n أو الدََّبُورِ\n أو الصَّبَا\n { ويجعله كِسَفا } أي: قطعاً متفرقة\n والحاصل: أنه تارة يبسطه متصلاً مطبقاً\n وتارة يجعله قطعاً متفرقة\n على مشيئته وحكمته\n { فترى الوَدْقَ } المطر { يَخْرجُ من خِلاله } وسطه\n { فإِذا أصاب به } بالودق { من يشاء من عباده } \n يريد إِصابةَ بلادهم وأراضيهم { إذا هم يستبشرون } يفرحون بالخصب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:43",
      "similarity": 0.44686304881375033
    },
    {
      "verse": "35:9",
      "similarity": 0.36953114809414095
    },
    {
      "verse": "52:44",
      "similarity": 0.3045097413614747
    },
    {
      "verse": "30:9",
      "similarity": 0.2714551241486302
    },
    {
      "verse": "26:187",
      "similarity": 0.2652654774198141
    }
  ]
}