{
  "chapter": "الروم",
  "text": "ليجزى الذين ءامنوا۟ وعملوا۟ الصلحت من فضله انه لا يحب الكفرين",
  "translations": [
    {
      "translation": "so that He can repay with His bounty those who had iman and did right actions. He certainly does not love the kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that God may reward those who believed and did what was good, by His grace. Surely He does not love unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah may, out of His Bounty, reward those who believe and act righteously. Verily He does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will reward the righteously striving believers through His favor. He does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to reward those who believed and did good deeds, by His munificence; indeed He does not like the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and do righteous good deeds, out of His bounty. Verily, He likes not the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and do good out of His grace; surely He does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may recompense those who believe and do righteous deeds of His bounty; He loves not the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward out of His bounty those who believe and do good works. Lo! He loveth not the disbelievers (in His guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For then He will reward out of His bounty those who believe and do good deeds; He does not love those who reject the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that he shall recompense those who believe and work righteous works out of His grace; verily He loveth not the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may reward those who have faith and do righteous deeds out of His grace. Indeed, He does not like the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and work righteous deeds, out of his Bounty. For He loves not those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe (in the Oneness of Allah Islamic Monotheism), and do righteous good deeds, out of His Bounty. Verily, He likes not the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He will recompense those who believe and do righteous deeds from His bounty. He does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He may reward those who have believed and done the righteous deeds out of His bounty. Indeed, He does not love the ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who have believed and done righteous deeds out of His bounty. Indeed, He does not like the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:45] that He may requite (li-yajziya is semantically connected to yassadda‘ūna, ‘they shall be sundered’) those who believe and perform righteous deeds out of His bounty, [that He may] reward them. Indeed He does not like the disbelievers, in other words, He will punish them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That He may reward out of His bounty those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and perform acts of obedience between themselves and their Lord. (Lo! He loveth not the disbelievers) He does not accept their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويجزي الكافرين أيضاً بمقتضى عدله بمثل ما اقترفوا من الكفر والشرك وأنواع الظلم والظلال { إِنَّهُ لاَ يُحِبُّ ٱلْكَافِرِينَ } [الروم: 45] المصرين على الكفر والضلالن سيما بعد إرساله سبحانه إليهم منْ يصلحهم ويهديهم إلى صراط مستقيم\n فكذبوه وأنكروا له عناداً واستكباراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:7",
      "similarity": 0.5098071084501924
    },
    {
      "verse": "42:40",
      "similarity": 0.4206991650190366
    },
    {
      "verse": "34:4",
      "similarity": 0.4015404979580457
    },
    {
      "verse": "42:26",
      "similarity": 0.39950004348734475
    },
    {
      "verse": "56:24",
      "similarity": 0.3988856877310496
    }
  ]
}