{
  "chapter": "الروم",
  "text": "ولقد ارسلنا من قبلك رسلا الى قومهم فجاءوهم بالبينت فانتقمنا من الذين اجرموا۟ وكان حقا علينا نصر المؤمنين",
  "translations": [
    {
      "translation": "Before you We sent other Messengers to their people, and they too brought them the Clear Signs. We took revenge on those who did evil; and it is Our duty to help the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We sent many apostles before you to their people, who brought clear signs with them. Then We retributed those who were sinful. It is a duty incumbent on Us to help the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Messengers before you to their respective nations, and they brought Clear Signs to them. Then We took vengeance upon those who acted wickedly. It was incumbent on Us to come to the aid of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), We had sent before you Our Messengers to their people. The Messengers showed them clear miracles and We took revenge on the criminals. It was necessary for Us to help the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent several Noble Messengers before you, to their nations – so they came to them with clear signs – We therefore took revenge from the guilty; and it is incumbent upon Our mercy, to help the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We did send Messengers before you to their own peoples. They came to them with clear proofs, then, We took vengeance on those who committed crimes; and it was incumbent upon Us to help the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent before you apostles to their people, so they came to them with clear arguments, then We gave the punishment to those who were guilty; and helping the believers is ever incumbent on Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent before thee Messengers unto their people, and they brought them the clear signs; then We took vengeance upon those who sinned; and it was ever a duty incumbent upon Us, to help the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We sent before thee (Muhammad) messengers to their own folk. Then we took vengeance upon those who were guilty (in regard to them). To help believers is ever incumbent upon Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, We sent messengers before you to their own people, and they brought them clear signs. Then We took vengeance on the guilty. It was certainly Our duty to help the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent apostles before thee unto their people. They brought them manifest signs. Then We took vengeance upon those who transgressed. And incumbent upon us was avengement of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent apostles to their people before you, and they brought them manifest proofs. Then We took vengeance upon those who were guilty, and it was a must for Us to help the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed send, before thee, messengers to their (respective) peoples, and they came to them with Clear Signs: then, to those who transgressed, We meted out Retribution: and it was due from Us to aid those who believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We did send Messengers before you (O Muhammad SAW) to their own peoples. They came to them with clear proofs, then, We took vengeance on those who committed crimes (disbelief, setting partners in worship with Allah, sins, etc.), and (as for) the believers it was incumbent upon Us to help (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before you We sent other Messengers to their people; and they came with clear signs. We took revenge upon the sinners, and it was an incumbent duty upon Us to give victory to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before you, We sent messengers to their people. They came to them with clear proofs. Then We took revenge on those who sinned. It is incumbent on Us to help the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already sent messengers before you to their peoples, and they came to them with clear evidences; then We took retribution from those who committed crimes, and incumbent upon Us was support of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:47] And verily We sent before you messengers to their people and they brought them clear signs, plain proofs of their sincerity concerning their Message to them, but they denied them. Then We took vengeance upon those who were guilty, We destroyed those who denied them, and it was ever incumbent upon Us to give victory to the believers, over the disbelievers, by destroying these and delivering the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily We sent before thee) O Muhammad (messengers to their own folk. They brought them clear proofs (of Allah's Sovereignty)) they explained to them the commands, prohibitions and signs but they did not believe. (Then We took vengeance) by sending a chastisement (upon those who were guilty) the idolaters. (To help believers is incumbent upon Us) it is incumbent to help the believers with the messengers by saving them and destroying their enemies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المستهزئين مع رسوله: { وَ } الله { لَقَدْ أَرْسَلْنَا مِن قَبْلِكَ } يا أكمل الرسل { رُسُلاً } مبشرين ومنذرين { إِلَىٰ قَوْمِهِمْ } الذين ظهرتْ عليهم أمارات الكفر والطغيان\n وعلامات الكفر والعدوان { فَجَآءُوهُم } مؤيَّدين من عندنا { بِٱلْبَيِّنَاتِ } الواضحة\n والمعجزات اللائحة\n ففاجئوا على تكذيبهم عناداً واستكباراً بلا تدبر وتأمل منهم في آياتهم وبيناتهم { فَٱنتَقَمْنَا } بمقتضى قهرنا وجلالنا { مِنَ ٱلَّذِينَ أَجْرَمُواْ } بالجرائم العظام\n سيما تكذيب الرسل - عليهم السلام - { وَ } كيف لا ننتقم عنهم بتكذيبهم رسلنا\n مع أنه { كَانَ حَقّاً عَلَيْنَا } بمقتضى ما ثبت في لوح قضائنا\n وحضرة علمنا { نَصْرُ ٱلْمُؤْمِنينَ } [الروم: 47] أي: نصر الرسل والمؤمنين بهم\n وتغليبهم على الكفارين بعدما امتثلوا لأوامرنا\n و اجتنبوا عن نواهينا\n وبلَّغوا جميع ما أمرناهم وأوحيناهم إلى ما أرسلناهم\n فكذبوهم ولم يقبلوا منهم؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: حقاً: خبر \" كان \" ، ونصر: اسمها. أو: حقاً: خبر \" كان \" ، واسمها: ضمير الانتقام، فيوقف عليه، وعلينا نصر: مبتدأ وخبر. يقول الحق جل جلاله: { ولقد أرسلنا مِن قبلك رسلاً إلى قومهم فجاءهم بالبينات } بالمعجزات البينات الواضحات، فكذبوهم { فانتقمنا من الذين أجرموا } بالتدمير، { وكان حقاً علينا نصرُ المؤمنين } أي: وكان نصر المؤمنين، بإنجائهم من العذاب، حقاً واجباً علينا بإنجاز وعدنا إحساناً. أو: وكان الانتقام من المجرمين حقاً لا شك فيه، ثم علينا، من جهة الإحسان، نصر المؤمنين. قال البيضاوي: فيه إشعار بأن الانتقام لهم - أي: من عدوهم - إظهار لكرامتهم، حيث جعلهم مستحقين على الله أن ينصرهم. وعنه. صلى الله عليه وسلم:\n \" مَا مِنْ امْرِىءٍ مُسْلِمٍ يردّ عن عِرْضِ أَخِيه، إلا كان حقاً على الله أن يردّ عنْه نارَ جهنم \" \n، ثم تلا الآية. أي: { وكان حقاً علينا.. } إلخ. الإشارة: هكذا جرت سُنَّة الله تعالى، مع خواصه، أن ينتقم ممن آذاهم، ولو بعد حين. وقد يكون الانتقام باطناً، بنقص الإيمان وقساوة القلب، وهو أقبح. قال القشيري: فانتقمنا من الذين أجرموا، وأخذناهم من حيث لا يحتسبوا، وشَوَّشْنا عليهم ما أمَّلوا ونقصنا عليهم ما استطابوا وتَنَعَّموا. { وكان حقاً علينا نصرُ المؤمنين }. وَطِئَهُمْ أَعْدَاؤُهُمْ بأعقابهم فلم يلبثوا إلا يسيراً حتى رَقَّيْنَاهُمْ فوق رقابهم، وخرَّبنا أوطانهم، وهدَّمنا بنيانهم، وأخمدنا نيرانهم، وعَطَّلْنا عليهم ديارَهم، ومحونا، بقهْر التدمير، آثارَهم، فظَلتْ شموسُهم كاسفة، ومكيدةُ قهْرنا لهم، بأجمعهم، خاسفة. هـ. ثم برهن على ذلك، فقال: { ٱللَّهُ ٱلَّذِي يُرْسِلُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:22",
      "similarity": 0.7132515443298963
    },
    {
      "verse": "15:79",
      "similarity": 0.7046920872029745
    },
    {
      "verse": "85:8",
      "similarity": 0.6346416657520467
    },
    {
      "verse": "43:25",
      "similarity": 0.598543839113961
    },
    {
      "verse": "39:37",
      "similarity": 0.593786803805208
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/30:47.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/30:47.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/30:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}