{
  "chapter": "الروم",
  "text": "ظهر الفساد فى البر والبحر بما كسبت ايدى الناس ليذيقهم بعض الذى عملوا۟ لعلهم يرجعون",
  "translations": [
    {
      "translation": "Corruption has appeared in both land and sea because of what people's own hands have brought about so that they may taste something of what they have done so that hopefully they will turn back.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has spread over land and sea from what men have done themselves that they may taste a little of what they have done: They may haply come back (to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil has become rife on the land and at sea because of men's deeds; this in order that He may cause them to have a taste of some of their deeds; perhaps they will turn back (from evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil has spread over the land and the sea because of human deeds and through these God will cause some people to suffer so that perhaps they will return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Chaos appears in the land and the sea because of the evil deeds which people’s hands have earned, in order to make them taste the flavour of some of their misdeeds – in order that they may come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil has appeared in Al-Barr and Al-Bahr because of what the hands of men have earned, that He may make them taste a part of that which they have done, in order that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared in the land and the sea on account of what the hands of men have wrought, that He may make them taste a part of that which they have done, so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared in the land and sea, for that men's own hands have earned, that He may let them taste some part of that which they have done, that haply so they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption doth appear on land and sea because of (the evil) which men's hands have done, that He may make them taste a part of that which they have done, in order that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared on land and sea because of the evil which men's hands have done: and so He will make them taste the fruit of some of their doings, so that they may turn back from evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruptness hath appeared on land and sea because of that which men's hands have earned, so that he may make them taste a part of that which they have worked, in order that haply they may turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared in land and sea because of the doings of the people’s hands, that He may make them taste something of what they have done, so that they may come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mischief has appeared on land and sea because of (the meed) that the hands of men have earned, that (Allah) may give them a taste of some of their deeds: in order that they may turn back (from Evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil (sins and disobedience of Allah, etc.) has appeared on land and sea because of what the hands of men have earned (by oppression and evil deeds, etc.), that Allah may make them taste a part of that which they have done, in order that they may return (by repenting to Allah, and begging His Pardon).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared on land and sea with what the hands of the people earned. Therefore, they taste some of what they did in order that they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared on land and sea, because of what people’s hands have earned, in order to make them taste some of what they have done, so that they might return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned so He may let them taste part of [the consequence of] what they have done that perhaps they will return [to righteousness].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:41] Corruption has appeared on land, in the wastelands, because of the rain being withheld and the vegetation diminishing, and on sea, in lands near rivers because of their waters diminishing, because of what people’s hands have perpetrated, of acts of disobedience, that He may make them taste (li-yudhīqahum; or [may be read] li-nudhīqahum, ‘that We may make them taste’) something of what they have done, that is, the punishment for it, that perhaps they may repent.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ (41)موقع هذه الآية ومعناها صالح لعدة وجوه من الموعظة ، وهي من جوامع كلم القرآن . والمقصد منها هو الموعظة بالحوادث ماضيها وحاضرها للإقلاع عن الإشراك وعن تكذيب الرسول صلى الله عليه وسلم فأما موقعها فيجوز أن تكون متصلة بقوله قبلها { أو لم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم الآيات } \\[ الروم : 9 \\] ، فلما طولبوا بالإقرار على مَا رأوه من آثار الأمم الخالية ، أو أُنكِرَ عليهم عدمُ النظر في تلك الآثار ، أُتبع ذلك بما أدَّى إليه طريق الموعظة من قوله { هو الذي يبدأ الخلق ثم يعيده } \\[ الروم : 27 \\] ، ومن ذكر الإنذار بعذاب الآخرة ، والتذكير بدلائل الوحدانية ونِعَم الله تعالى ، وتفريع استحقاقه تعالى الشكر لذاته ولأجل إنعامه استحقاقاً مستقراً إدراكه في الفطرة البشرية ، وما تخلل ذلك من الإرشاد والموعظة ، عاد الكلام إلى التذكير بأن ما حلّ بالأمم الماضية من المصائب ما كان إلا بما كسبت أيديهم ، أي بأعمالهم ، فيوشك أن يحلّ مثل ما حلّ بهم بالمخاطبين الذين كسبت أيديهم مثلَ ما كسبت أيدي أولئك .فموقع هذه الجملة على هذا الوجه موقع النتيجة من مجموع الاستدلال أو موقع الاستئناف البياني بتقدير سؤال عن سبب ما حلّ بأولئك الأمم . ويجوز أن تقع هذه الآية موقع التكملة لقوله { وإذا مسّ الناسَ ضُر دَعوا ربهم } \\[ الروم : 33 \\] الآية ، فهي خبر مستعمل في التنديم على ما حلّ بالمكذبين المُخاطبين من ضرّ ليعلموا أن ذلك عقاب من الله تعالى فيقلعوا عنه خشية أن يحيط بهم ما هو أشد منه ، كما يؤذن به قوله عقب ذلك { لعلهم يرجعون . } فالإتيان بلفظ الناس في قوله { بما كسبت أيدي الناس } إظهار في مقام الإضمار لزيادة إيضاح المقصود ، ومقتضى الظاهر أن يقال «بما كسبت أيديهم» . فالآية تشير إلى مصائب نزلت ببلاد المشركين وعطلت منافعها ، ولعلها مما نشأ عن الحرب بين الروم وفارس ، وكان العرب منقسمين بين أنصار هؤلاء وأنصارِ أولئك ، فكان من جراء ذلك أن انقطعت سبل الأسفار في البر والبحر فتعطلت التجارة وقلّت الأقوات بمكة والحجاز كما يقتضيه سَوْق هذه الموعظة في هذه السورة المفتتحة ب { غُلِبَتتِ الرومُ } \\[ الروم : 2 \\] .فموقع هذه الجملة على هذا الوجه موقع الاستئناف البياني لسبب مسِّ الضر إياهم حتى لجأوا إلى الضراعة إلى الله ، وما بينها وبين جملة { وإذا مسّ الناسَ ضرّ } \\[ الروم : 33 \\] إلى آخره اعتراض واستطراد تخلل في الاعتراض . ويجوز أن يكون موقعها موقع الاعتراض بين ذكر ابتهال الناس إلى الله إذا أحاط بهم ضر ثم إعراضهم عن عبادته إذا أذاقهم منه رحمةً وبين ذكر ما حلّ بالأمم الماضية اعتراضاً ينبىء أن الفساد الذي يظهر في العالم ما هو إلا من جراء اكتساب الناس وأن لو استقاموا لكان حالهم على صلاح .و { الفساد : سوء الحال ، وهو ضد الصلاح ، ودل قوله : في البر والبحر } على أنه سوء الأحوال في ما ينتفع به الناس من خيرات الأرض برها وبحرها . ثم التعريف في { الفساد : } إما أن يكون تعريف العهد لفساد معهود لدى المخاطبين ، وإما أن يكون تعريف الجنس الشامل لكل فساد ظهر في الأرض برِّها وبحرِها أنه فساد في أحوال البر والبحر ، لا في أعمال الناس بدليل قوله { ليذيقهم بعضَ الذي عمِلوا لعلهم يرجعون } .وفساد البر يكون بفقدان منافعه وحدوث مضارّه ، مثل حبس الأقوات من الزرع والثمار والكلأ ، وفي مَوتان الحيوان المنتفع به ، وفي انتقال الوحوش التي تصاد من جراء قحط الأرض إلى أرضين أخرى ، وفي حدوث الجوائح من جراد وحشرات وأمراض .وفساد البحر كذلك يظهر في تعطيل منافعه من قلّة الحيتان واللؤلؤ والمرجان فقد كانا من أعظم موارد بلاد العرب وكثرة الزوابع الحائلة عن الأسفار في البحر ، ونضوب مياه الأنهار وانحباس فيضانها الذي به يستقي الناس . وقيل : أريد بالبر البَوادي وأهل الغمور وبالبحر المدن والقرى ، وهو عن مجاهد وعكرمة وقال : إن العرب تسمي الأمصار بحراً . قيل : ومنه قول سعد بن عبادة في شأن عبد الله بن أُبَيّ ابن سلول : ولقد أجمع أهل هذه البحرة على أن يتوّجوه . يعني بالبحرة : مدينة يثرب وفيه بُعد . وكأنَّ الذي دعا إلى سلوك هذا الوجه في إطلاق البحر أنه لم يعرف أنه حدث اختلال في سير الناس في البحر وقلة فيما يخرج منه . وقد ذكر أهل السير أنَّ قريشاً أصيبوا بقحط وأكلوا الميتة والعِظام ، ولم يذكروا أنهم تعطلت أسفارهم في البحر ولا انقطعت عنهم حيتان البحر ، على أنهم ما كانوا يعرفون بالاقتيات من الحيتان .وعلى هذه الوجوه الثلاثة يكون الباء في قوله بما كسبت أيدي الناس } للعوض ، أي جزاء لهم بأعمالهم ، كالباء في قوله تعالى : { وما أصابكم من مصيبة فبما كسبت أيديكم } \\[ الشورى : 30 \\] ، ويكون اللام في قوله { ليذيقهم } على حقيقة معنى التعليل .ويجوز أن يكون المراد بالفساد : الشرك قاله قتادة والسدّي فتكون هذه الآية متصلة بقوله { الله الذي خلقكم ثم رزقكم } إلى قوله : { هل من شركائكم من يفعل من ذلكم من شيء } \\[ الروم : 40 \\] ، فتكون الجملة إتماماً للاستدلال على وحدانية الله تعالى تنبيهاً على أن الله خلق العالم سالماً من الإشراك ، وأن الإشراك ظهر بما كسبت أيدي الناس من صنيعهم . وهذا معنى قوله في الحديث القدسي في «صحيح مسلم» : \" إني خلقت عبادي حُنَفَاء كلَّهم ، وأنهم أتتهم الشياطين فأجالتهم عن دينهم ، وأمَرْتهم أن يشركوا بي \" الحديث .فذكر البر والبحر لتعميم الجهات بمعنى : ظهر الفساد في جميع الأقطار الواقعة في البر والواقعة في الجزائر والشطوط ، ويكون الباء في قوله { بما كسبت أيدي الناس } للسببية ، ويكون اللام في قوله { ليذيقهم بعض الذي عملوا } لامَ العاقبة ، والمعنى : فأذقناهم بعض الذي عملوا ، فجُعلت لام العاقبة في موضع الفاء كما في قوله تعالى :{ فالتقطه ءال فرعون ليكون لهم عدوّاً وحزناً } \\[ القصص : 8 \\] ، أي فأذقنا الذين أشركوا بعض ما استحقوه من العذاب لشركهم . ويجوز أن يكون المعنى أن الله تعالى خلق العالم على نظام مُحكم ملائم صالح للناس فأحدث الإنسان فيه أعمالاً سيئة مفسدة ، فكانت وشائجَ لأمثالها :« وهل ينبت الخطيَّ إلا وشيجُه »فأخذ الاختلال يتطرق إلى نظام العالم قال تعالى : { لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين إلا الذين ءامنوا وعملوا الصالحات } \\[ التين : 4 6 \\] ، وعلى هذا الوجه يكون محمل الباء ومحمل اللام مثل محملهما على الوجه الرابع . وأطلق الظهور على حدوث حادث لم يكن ، فشبه ذلك الحدوث بعد العدم بظهور الشيء الذي كان مختفياً .ومحمل صيغة فعل { ظهر } على حقيقتها من المضي يقتضي أن الفساد حصل وأنه ليس بمستقبل ، فيكون إشارة إلى فساد مشاهَد أو محقق الوقوع بالأخبار المتواترة . وقد تحمل صيغة الماضي على معنى توقع حصول الفساد والإنذار به فكأنه قد وقع على طريقة { أتى أمر الله } \\[ النحل : 1 \\] . وأيَّاً ما كان الفساد من معهود أو شامل ، فالمقصود أن حلوله بالناس بقدرة الله كما دل عليه قوله { ليذيقهم بعض الذي عملوا } ، وأن الله يقدر أسبابه تقديراً خاصاً ليجازي من يغضب عليهم على سوء أفعالهم . وهو المراد بما كسبت أيديهم لأن إسناد الكسب إلى الأيدي جرى مجرى المثل في فعل الشر والسوء من الأعمال كلها ، دون خصوص ما يعمل منها بالأيدي لأن ما يكسبه الناس يكون بالجوارح الظاهرة كلها ، وبالحواس الباطنة من العقائد الضالة والأدواء النفسية .و { ما } موصولة ، وحذف العائد من الصلة ، وتقديره : بما كسبته أيدي الناس ، أي بسبب أعمالهم . وأعظم ما كسبته أيدي الناس من الأعمال السيئة الإشراك وهو المقصود هنا وإن كان الحكم عاماً . ويعلم أن مراتب ظهور الفساد حاصلة على مقادير ما كسبت أيدي الناس ، قال رسول الله صلى الله عليه وسلم وسُئِلَ : أي الذنب أعظم؟ « أن تدعُو لله نِدّاً وهو خلقك » وقال تعالى : { وما أصابكم من مصيبة فبما كسبت أيديكم } \\[ الشورى : 30 \\] وقال : { وأنْ لو استقاموا على الطريقة لأسقيناهم ماء غدقاً } \\[ الجن : 16 \\] .ويجري حكمُ تعريف { الناس } على نحو ما يجري في تعريف { الفساد } من عهد أو عموم ، فالمعهود هم المشركون وقد شاع في القرآن تغليب اسم { الناس } عليهم .والإذاقة : استعارة مكنية؛ شبه ما يصيبهم من الآلام فيُحسون بها بإصابة الطعام حاسة المطعم . ولما كان ما عملوه لا يصيبهم بعينه تعين أن بعض الذي عملوا أطلق على جزاء العمل ولذلك فالبعضية تبعيض للجزاء ، فالمراد بعض الجزاء على جميع العمل لا الجزاء على بعض العمل ، أي أن ما يذيقهم من العذاب هو بعض ما يستحقونه . وفي هذا تهديد إن لم يُقلعوا عن مساوىء أعمالهم كقوله تعالى :{ ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة } \\[ فاطر : 45 \\] ، ثم وراء ذلك عذاب الآخرة كما قال تعالى : { ولعذاب الآخرة أشد وأبقى } \\[ طه : 127 \\] .والعدول عن أن يقال : بعض أعمالهم إلى { بعضَ الذي عملوا } للإيماء إلى ما في الموصول من قوة التعريف ، أي أعمالهم المعروفة عندهم المتقرر صدورها منهم .والرجاء المستفاد من ( لعلَّ ) يشير إلى أن ما ظهر من فساد كاف لإقلاعهم عما هم اكتسبوه ، وأن حالهم حال من يُرجى رجوعه فإن هم لم يرجعوا فقد تبين تمردهم وعدم إجداء الموعظة فيهم ، وهذا كقوله تعالى : { أو لا يَرْون أنهم يُفْتَنون في كل عام مرة أو مرتين ثم لا يتوبون ولا هم يذّكرون } \\[ التوبة : 126 \\] .والرجوع مستعار للإقلاع عن المعاصي كأنَّ الذي عصى ربه عبد أبق عن سيّده ، أو دابة قد أبدت ، ثم رجع . وفي الحديث « الله أفرحُ بتوبة عبده من رجل نزل منزلاً وبه مهلكة ، ومعه راحلته عليها طعامه وشرابه فوضع رأسه فنام نومة فاستيقظ وقد ذهبت راحلته حتى إذا اشتد عليه الحر والعطش أو ما شاء الله قال : أرجع إلى مكاني ، فرجع فنام نومة ثم رفع رأسه فإذا دابته عنده » . وقرأ الجمهور { ليذيقهم } بالياء التحتية ، أي ليذيقهم الله . ومعاد الضمير قوله { الله الذي خلقكم } \\[ الروم : 40 \\] . وقرأه قنبل عن ابن كثير وروح عن عاصم بنون العظمة .\n\n",
      "translations": [
        {
          "translation": "(Corruption doth appear) transgression has appeared (on land) from Cain who killed his brother Abel (and sea) from Jalandan al-Azdi (because of (the evil) which men's hands have done) due to the killing of Abel by Cain and Jalandan's seizure of people's ships in the sea; it is also said that this means: corruption has appeared through the death of cattle, drought, lack of food and vegetation in the plains, mountains, countryside and wilderness as well as in townships and cities because of the transgressions committed by people, (that He may make them taste) that He may make them be seized by (a part of that which they have done) of transgressions, (in order that they may return) in order that they may repent of their sins and thus be relieved. 461\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ظَهَرَ ٱلْفَسَادُ فِي ٱلْبَرِّ وَٱلْبَحْرِ بِمَا كَسَبَتْ أَيْدِي ٱلنَّاسِ } في البَرِّ: ابن آدم الذي قَتَلَ أَخاهُ\n وفي البحرِ: الغَنيُ الذي كَان يأكلُ السفينةَ غصباً\n وقال: البحرُ كُلُّ قَريةٍ عَامرةٍ\n وكانت العَربُ تُسمى الأَمصارَ بَحراً\n\n\n\n\nوقوله تعالى: { لَعَلَّهُمْ يَرْجِعُونَ } معناه يَتُوبونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Corruption has appeared in the land and the sea because of what the hands of people have earned,\" in the land: the son of Adam who killed his brother.\n\n\nAnd in the sea: the rich man who used to eat the ship by force\n The sea is like every other village, full of people.\n The Arabs were called the Sea peoples\n And his saying, { perhaps they will return [to Allah ]}, its meaning is that they will repent.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإنما نذيقهم نبذاً منها عاجلاً { لَعَلَّهُمْ يَرْجِعُونَ } [الروم: 41] إلينا بعدما ذاقوا ما ذاقوا من أنواع المحن والشدائد\n\n\nوإن أنكر هؤلاء المشركون إذاقتنا العذاب لأمثالهم { قُلْ } لهم يا أكمل الرسل نيابةً عنا: { سِيرُواْ فِي ٱلأَرْضِ } المعدة لأنواع الكون والفساد { فَٱنْظُرُواْ } نظر معتبر منصف\n ومتأمل مستبصر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ظهر الفسادُ في البر والبحر } \n أما الفساد في البر\n فكالقحط\nوقلة الأمطار\n وعدم الريع في الزراعات والربح في التجارات\n ووقوع الموتان في الناس والدوابّ\n ومحق البركات من كل شيء\n وأما في البحر فبكثرة الغرق\n وانقطاع صيده\n { بما } وذلك بسبب ما { كسبتْ أيدي الناس } من الكفر والمعاصي\n ولو استقاموا على الطاعة لدفع الله عنهم هذه الآفات\n أظهر فيهم ذلك { ليذيقهم بعض الذي عملوا } أي: ليذيقهم وبال بعض أعمالهم في الدنيا\n قبل أن يعاقبهم بجميعها في الآخرة\n عن \" قُنْبل ويعقوب \": بنون التكلم\n { لعلهم يرجعون } عما هم عليه من المعاصي\n { قل } لكفار قومك { سيروا في الأرض فانظروا كيف كان عاقبةُ الذين من قبلُ } لتُعاينوا ما فعلنا بهم بسبب كفرهم ومعاصيهم لأنه { كان أكثرُهم مشركين } فدمرناهم\n وخربنا ديارهم\n فانظروا: كيف كان عاقبتهم\n لعلكم ترجعون عن غَيكم\n الإشارة: قال القشيري: الإشارة في البَرِ إلى النفس\n وفي البحر إلى القلب\n وفسادُ البرّ بأَكْلِ الحرام وارتكاب المحظورات\n وفسادُ البحر من الغفلة والأوصاف الذميمة\n مثل سوء العزم\n والحسد والحقد\n وإرادة الفسوق\n وغير ذلك\n وعَقْدُ الإصرار على المخالفات من أعظم فساد القلب\n كما أنَّ العَزْمَ على الخيرات\n قبل فِعْلها\n من أعظم الخيرات\n ومن جملة الفساد: التأويلاتُ بغير حقٍّ\n والانحطاطُ إلى الرُّخَصِ من غير قيام بحقٍ\n والإغراق في الدعاوى من غير استحياء\n هـ\n قال الورتجبي: إن الله غلب الإنسانية على الكون طاعةً ومعصية\n فإذا رزق الإنسان الطاعة صلح الأكوان ببركتها\n وإذا رزق المعصية فسد الحدثان بشؤم معصيته لأن طاعته ومعصيته من تواثير لطفه وقهره\n عَلاَ بنعت الاستيلاء على الوجود\n فإذا فسادها يؤثر في بَرِّ النفوس وبحار القلوب\n ففساد بَرَّ النفوس: فَتْرَتُهَا عن العبودية\n وفساد بحر القلب: احتجابه عن مشاهدة أنوارالربوبية\n هـ\n قلت: وقد يقال: ظهر الفساد في بر الشريعة بذهاب حَمَلَتِهَا\n ومن يحفظها\n ويذب عنها\n وفي بحر الحقيقة بقلة صدق من يطلبها\n وغربة أهلها\n واختفائها حتى اندرست أعلامها\n وخفي آثارُها\n والبركة لا تنقطع\n وذلك بسبب ما كسبت أيدي الناس من إيثار الدنيا على الله ليذيقهم وبال القطيعة\n لعلهم يرجعون إليه\n إما بملاطفة الإحسان\n أو بسلاسل الامتحان\n قال في لطائف المنن: سأل بعضُ العارفين عن أولياء العدد\n هل ينقصون؟ فقال: لو نقص منهم واحد ما أرسلت السماء قَطْرَهَا\n ولا أنبتت الأرض نباتها\n وفساد الوقت لا يكون بذهاب أعدادهم\n ولا بنقص أمداداهم\n ولكن إذا فسد الوقت كان مراد الله وقوع اختفائهم\n مع وجود بقائهم\n فإذا كان أهل الزمان مُعْرضين عن الله\n مؤثرين لما سوى الله لا تنجح فيهم الموعظة\n ولا تميلُهم التذكرة\n لم يكونوا أهلاً لظهور أولياء الله تعالى فيهم\n ولذلك قالوا: أولياء لله عرائس ولا يرى العرائسَ المجرمون\n هـ\n قال القشيري: قل سيروا بالاعتبار\n واطلبوا الحقَّ بنعت الافتكار\n وانظروا: كيف كان حال من تقدمكم من الأشكال والأمثال؟ وقيسوا عليها حُكْمَكم في جميع الأحوال\n كان أكثرهم مشركين: كان أكثرهم عدداً\n ولكن أقل في التحقيق وزناً وقَدْراً\n هـ\n ثم أمر بالتأهّب ليوم المعاد وبه يندفع عن الخلق الفساد\n فقال: { فَأَقِمْ وَجْهَكَ لِلدِّينَ ٱلْقِيِّمِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:63",
      "similarity": 0.4172775712207303
    },
    {
      "verse": "6:97",
      "similarity": 0.3420279979501017
    },
    {
      "verse": "17:67",
      "similarity": 0.3380916479722862
    },
    {
      "verse": "82:13",
      "similarity": 0.31375440351607087
    },
    {
      "verse": "83:22",
      "similarity": 0.31375440351607087
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}