{
  "chapter": "الروم",
  "text": "ظهر الفساد فى البر والبحر بما كسبت ايدى الناس ليذيقهم بعض الذى عملوا۟ لعلهم يرجعون",
  "translations": [
    {
      "translation": "Corruption has appeared in both land and sea because of what people's own hands have brought about so that they may taste something of what they have done so that hopefully they will turn back.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has spread over land and sea from what men have done themselves that they may taste a little of what they have done: They may haply come back (to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil has become rife on the land and at sea because of men's deeds; this in order that He may cause them to have a taste of some of their deeds; perhaps they will turn back (from evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil has spread over the land and the sea because of human deeds and through these God will cause some people to suffer so that perhaps they will return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Chaos appears in the land and the sea because of the evil deeds which people’s hands have earned, in order to make them taste the flavour of some of their misdeeds – in order that they may come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil has appeared in Al-Barr and Al-Bahr because of what the hands of men have earned, that He may make them taste a part of that which they have done, in order that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared in the land and the sea on account of what the hands of men have wrought, that He may make them taste a part of that which they have done, so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared in the land and sea, for that men's own hands have earned, that He may let them taste some part of that which they have done, that haply so they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption doth appear on land and sea because of (the evil) which men's hands have done, that He may make them taste a part of that which they have done, in order that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared on land and sea because of the evil which men's hands have done: and so He will make them taste the fruit of some of their doings, so that they may turn back from evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruptness hath appeared on land and sea because of that which men's hands have earned, so that he may make them taste a part of that which they have worked, in order that haply they may turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared in land and sea because of the doings of the people’s hands, that He may make them taste something of what they have done, so that they may come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mischief has appeared on land and sea because of (the meed) that the hands of men have earned, that (Allah) may give them a taste of some of their deeds: in order that they may turn back (from Evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil (sins and disobedience of Allah, etc.) has appeared on land and sea because of what the hands of men have earned (by oppression and evil deeds, etc.), that Allah may make them taste a part of that which they have done, in order that they may return (by repenting to Allah, and begging His Pardon).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared on land and sea with what the hands of the people earned. Therefore, they taste some of what they did in order that they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared on land and sea, because of what people’s hands have earned, in order to make them taste some of what they have done, so that they might return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned so He may let them taste part of [the consequence of] what they have done that perhaps they will return [to righteousness].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:41] Corruption has appeared on land, in the wastelands, because of the rain being withheld and the vegetation diminishing, and on sea, in lands near rivers because of their waters diminishing, because of what people’s hands have perpetrated, of acts of disobedience, that He may make them taste (li-yudhīqahum; or [may be read] li-nudhīqahum, ‘that We may make them taste’) something of what they have done, that is, the punishment for it, that perhaps they may repent.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Corruption doth appear) transgression has appeared (on land) from Cain who killed his brother Abel (and sea) from Jalandan al-Azdi (because of (the evil) which men's hands have done) due to the killing of Abel by Cain and Jalandan's seizure of people's ships in the sea; it is also said that this means: corruption has appeared through the death of cattle, drought, lack of food and vegetation in the plains, mountains, countryside and wilderness as well as in townships and cities because of the transgressions committed by people, (that He may make them taste) that He may make them be seized by (a part of that which they have done) of transgressions, (in order that they may return) in order that they may repent of their sins and thus be relieved. 461\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ظَهَرَ ٱلْفَسَادُ فِي ٱلْبَرِّ وَٱلْبَحْرِ بِمَا كَسَبَتْ أَيْدِي ٱلنَّاسِ } في البَرِّ: ابن آدم الذي قَتَلَ أَخاهُ\n وفي البحرِ: الغَنيُ الذي كَان يأكلُ السفينةَ غصباً\n وقال: البحرُ كُلُّ قَريةٍ عَامرةٍ\n وكانت العَربُ تُسمى الأَمصارَ بَحراً\n\n\n\n\nوقوله تعالى: { لَعَلَّهُمْ يَرْجِعُونَ } معناه يَتُوبونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Corruption has appeared in the land and the sea because of what the hands of people have earned,\" in the land: the son of Adam who killed his brother.\n\n\nAnd in the sea: the rich man who used to eat the ship by force\n The sea is like every other village, full of people.\n The Arabs were called the Sea peoples\n And his saying, { perhaps they will return [to Allah ]}, its meaning is that they will repent.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإنما نذيقهم نبذاً منها عاجلاً { لَعَلَّهُمْ يَرْجِعُونَ } [الروم: 41] إلينا بعدما ذاقوا ما ذاقوا من أنواع المحن والشدائد\n\n\nوإن أنكر هؤلاء المشركون إذاقتنا العذاب لأمثالهم { قُلْ } لهم يا أكمل الرسل نيابةً عنا: { سِيرُواْ فِي ٱلأَرْضِ } المعدة لأنواع الكون والفساد { فَٱنْظُرُواْ } نظر معتبر منصف\n ومتأمل مستبصر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ظهر الفسادُ في البر والبحر } \n أما الفساد في البر\n فكالقحط\nوقلة الأمطار\n وعدم الريع في الزراعات والربح في التجارات\n ووقوع الموتان في الناس والدوابّ\n ومحق البركات من كل شيء\n وأما في البحر فبكثرة الغرق\n وانقطاع صيده\n { بما } وذلك بسبب ما { كسبتْ أيدي الناس } من الكفر والمعاصي\n ولو استقاموا على الطاعة لدفع الله عنهم هذه الآفات\n أظهر فيهم ذلك { ليذيقهم بعض الذي عملوا } أي: ليذيقهم وبال بعض أعمالهم في الدنيا\n قبل أن يعاقبهم بجميعها في الآخرة\n عن \" قُنْبل ويعقوب \": بنون التكلم\n { لعلهم يرجعون } عما هم عليه من المعاصي\n { قل } لكفار قومك { سيروا في الأرض فانظروا كيف كان عاقبةُ الذين من قبلُ } لتُعاينوا ما فعلنا بهم بسبب كفرهم ومعاصيهم لأنه { كان أكثرُهم مشركين } فدمرناهم\n وخربنا ديارهم\n فانظروا: كيف كان عاقبتهم\n لعلكم ترجعون عن غَيكم\n الإشارة: قال القشيري: الإشارة في البَرِ إلى النفس\n وفي البحر إلى القلب\n وفسادُ البرّ بأَكْلِ الحرام وارتكاب المحظورات\n وفسادُ البحر من الغفلة والأوصاف الذميمة\n مثل سوء العزم\n والحسد والحقد\n وإرادة الفسوق\n وغير ذلك\n وعَقْدُ الإصرار على المخالفات من أعظم فساد القلب\n كما أنَّ العَزْمَ على الخيرات\n قبل فِعْلها\n من أعظم الخيرات\n ومن جملة الفساد: التأويلاتُ بغير حقٍّ\n والانحطاطُ إلى الرُّخَصِ من غير قيام بحقٍ\n والإغراق في الدعاوى من غير استحياء\n هـ\n قال الورتجبي: إن الله غلب الإنسانية على الكون طاعةً ومعصية\n فإذا رزق الإنسان الطاعة صلح الأكوان ببركتها\n وإذا رزق المعصية فسد الحدثان بشؤم معصيته لأن طاعته ومعصيته من تواثير لطفه وقهره\n عَلاَ بنعت الاستيلاء على الوجود\n فإذا فسادها يؤثر في بَرِّ النفوس وبحار القلوب\n ففساد بَرَّ النفوس: فَتْرَتُهَا عن العبودية\n وفساد بحر القلب: احتجابه عن مشاهدة أنوارالربوبية\n هـ\n قلت: وقد يقال: ظهر الفساد في بر الشريعة بذهاب حَمَلَتِهَا\n ومن يحفظها\n ويذب عنها\n وفي بحر الحقيقة بقلة صدق من يطلبها\n وغربة أهلها\n واختفائها حتى اندرست أعلامها\n وخفي آثارُها\n والبركة لا تنقطع\n وذلك بسبب ما كسبت أيدي الناس من إيثار الدنيا على الله ليذيقهم وبال القطيعة\n لعلهم يرجعون إليه\n إما بملاطفة الإحسان\n أو بسلاسل الامتحان\n قال في لطائف المنن: سأل بعضُ العارفين عن أولياء العدد\n هل ينقصون؟ فقال: لو نقص منهم واحد ما أرسلت السماء قَطْرَهَا\n ولا أنبتت الأرض نباتها\n وفساد الوقت لا يكون بذهاب أعدادهم\n ولا بنقص أمداداهم\n ولكن إذا فسد الوقت كان مراد الله وقوع اختفائهم\n مع وجود بقائهم\n فإذا كان أهل الزمان مُعْرضين عن الله\n مؤثرين لما سوى الله لا تنجح فيهم الموعظة\n ولا تميلُهم التذكرة\n لم يكونوا أهلاً لظهور أولياء الله تعالى فيهم\n ولذلك قالوا: أولياء لله عرائس ولا يرى العرائسَ المجرمون\n هـ\n قال القشيري: قل سيروا بالاعتبار\n واطلبوا الحقَّ بنعت الافتكار\n وانظروا: كيف كان حال من تقدمكم من الأشكال والأمثال؟ وقيسوا عليها حُكْمَكم في جميع الأحوال\n كان أكثرهم مشركين: كان أكثرهم عدداً\n ولكن أقل في التحقيق وزناً وقَدْراً\n هـ\n ثم أمر بالتأهّب ليوم المعاد وبه يندفع عن الخلق الفساد\n فقال: { فَأَقِمْ وَجْهَكَ لِلدِّينَ ٱلْقِيِّمِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:63",
      "similarity": 0.4172775712207303
    },
    {
      "verse": "6:97",
      "similarity": 0.3420279979501017
    },
    {
      "verse": "17:67",
      "similarity": 0.3380916479722862
    },
    {
      "verse": "82:13",
      "similarity": 0.31375440351607087
    },
    {
      "verse": "83:22",
      "similarity": 0.31375440351607087
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/30:41.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/30:41.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}