{
  "chapter": "الروم",
  "text": "الله الذى خلقكم ثم رزقكم ثم يميتكم ثم يحييكم هل من شركائكم من يفعل من ذلكم من شىء سبحنه وتعلى عما يشركون",
  "translations": [
    {
      "translation": "Allah is He who created you, then provides for you, then will cause you to die and then bring you back to life. Can any of your partner-gods do any of that? Glory be to Him and may He be exalted above anything they associate with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created you, then gave you sustenance, then He will make you die, and bring you back to life. Is there one among those you associate with Him who can do the least of these things? Too high and exalted is He for what they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created you, then bestowed upon you your sustenance, and He will cause you to die and then will bring you back to life. Can any of those whom you associate with Allah in His Divinity! do any such thing? Glory be to Him and exalted be He above whatever they associate with Allah in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has created you and given you sustenance. He will make you die and will bring you back to life. Can any of your idols do such things? God is too Exalted to be considered equal to anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created you and then provided you sustenance, then will cause you to die, and will then give you life again; is there any among your ascribed partners that can do any of these things? Purity and Supremacy are to Him, above their ascribing of partners (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created you, then provided food for you, then will cause you to die, then He will give you life. Is there any of your partners that do anything of that Glory be to Him! And Exalted be He above all that they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created you, then gave you sustenance, then He causes you to die, then brings you to life. Is there any of your associate-gods who does aught of it? Glory be to Him, and exalted be He above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He that created you, then He provided for you, then He shall make you dead, then He shall give you life; is there any of your associates does aught of that? Glory be to Him! High be He exalted above that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created you and then sustained you, then causeth you to die, then giveth life to you again. Is there any of your (so-called) partners (of Allah) that doeth aught of that? Praised and Exalted be He above what they associate (with Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He who created you, then provides for you, then will cause you to die and then bring you back to life. Can any of your \"partners\" do any one of these things? Glory be to Him and exalted be He above anything they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created you and provided food for you, then He causeth you to die, and then He shall quicken you. Is there any of your associate-gods that doth aught of that? Hallowed and exalted be He above that which they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who created you and then He provided for you, then He makes you die, then He will bring you to life. Is there anyone among your ‘partners’ who does anything of that kind? Immaculate is He and exalted above [having] any partners that they ascribe [to Him]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has created you: further, He has provided for your sustenance; then He will cause you to die; and again He will give you life. Are there any of your (false) \"Partners\" who can do any single one of these things? Glory to Him! and high is He above the partners they attribute (to him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created you, then provided food for you, then will cause you to die, then (again) He will give you life (on the Day of Resurrection). Is there any of your (so-called) partners (of Allah) that do anything of that? Glory be to Him! And Exalted be He above all that (evil) they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has created you and given you your provision. He will cause you to die, and will then revive you. Can any of your associates do any of that? Exalted is He above what they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He who created you, then provides for you, then makes you die, then brings you back to life. Can any of your idols do any of that? Glorified is He, and Exalted above what they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the one who created you, then provided for you, then will cause you to die, and then will give you life. Are there any of your \"partners\" who does anything of that? Exalted is He and high above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:40] God is the One Who created you, then provided for you, then makes you die, then gives you life: is there anyone among your associates, of those whom you have associated with God, who does anything of the kind? No! Glory be to Him and exalted be He above what they associate, with Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاللَّهُ الَّذِي خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ هَلْ مِنْ شُرَكَائِكُمْ مَنْ يَفْعَلُ مِنْ ذَلِكُمْ مِنْ شَيْءٍ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ (40)هذا الاستئناف الثاني من الأربعة التي أقيمت عليها دلائل انفراد الله تعالى بالتصرف في الناس وإبطال ما زعموه من الإشراك في الإلهية كما أنبأ عنه قوله { هل مِن شركائكم مَن يفعل مِنْ ذَلكم مِنْ شيء ، وإدماجاً للاستدلال على وقوع البعث . وقد جاء هذا الاستئناف على طريقة قوله : { الله يبدأ الخلق ثم يعيده } \\[ يونس : 34 \\] واطَّرد الافتتاح بمثله في الآيات التي أريد بها إثبات البعث كما تقدم عند قوله تعالى : { الله يبدأ الخلق ثم يعيده } ، وسيأتي في الآيتين بعد هذه .و { ثم } مستعمل في معنيي التراخي الزمني والرتبي .و { هل من شركائكم من يفعل من ذلكم من شيء } استفهام إنكاري في معنى النفي ولذلك زيدت { مِن } الدالة على تحقيق نفي الجنس كله في قوله { مِن شيء . } والمعنى : ما من شركائكم من يفعل شيئاً من ذلكم . ف { من } الأولى بيانية هي بيان للإبهام الذي في { من يفعل ، } فيكون { من يفعل } مبتدأ وخبره محذوف دل عليه الاستفهام ، تقديره : حصل ، أو وجد ، أو هي تبعيضية صفة لمقدر ، أي هل أحد مِن شركائكم . و { من } الثانية في قوله { من ذلكم } تبعيضية في موضع الحال { من شيء . ومن } الثالثة زائدة لاستغراق النفي .وإضافة ( شركاء ) إلى ضمير المخاطبين من المشركين لأن المخاطبين هم الذين خلعوا على الأصنام وصف الشركاء لله فكانوا شركاء بزعم المخاطبين وليسوا شركاء في نفس الأمر ، وهذا جار مجرى التهكم ، كقول خالد بن الصعق لعمرو بن معديكرب في مجمع من مجامع العرب بظاهر الكوفة فجعل عمرو يحدثهم عن غاراته فزعم أنه أغار على نهد فخرجوا إليه يقدمهم خالد بن الصَعق وأنه قتله ، فقال له خالد بن الصعق : «مهلاً أبا ثور قتيلُك يسمع» أي القتيل بزعمك . والقرينة قوله «يسمع» كما أن القرينة في هذه الآية هي جملة التنزيه عن الشريك . والإشارة ب { ذلكم } إلى الخلق ، والرزق ، والإماتة ، والإحياء ، وهي مصادر الأفعال المذكورة . وأفرد اسم الإشارة بتأويل المذكور .وجملة { سبحانه وتعالى عما يشركون } مستأنفة لإنشاء تنزيه الله تعالى عن الشريك في الإلهية . وموقعها بعد الجملتين السابقتين موقع النتيجة بعد القياس ، فإن حاصل معنى الجملة الأولى أن الإله الحق وهو مسمى اسم الجلالة هو الذي خَلَق ورزق ويُميت ويُحيي ، فهذا في قوة مقدمة هي صغرى قياس ، وحاصل الجملة الثانية أن لا أحد من الأصنام بفاعل ذلك ، وهذه في قوة مقدمة هي كبرَى قياسسٍ وهو من الشكل الثاني ، وحاصل معنى تنزيه الله عن الشريك أن لا شيء من الأصنام بإله . وهذه نتيجة قياس من الشكل الثاني . ودليل المقدمة الصغرى إقرار الخصم ، ودليل المقدمة الكبرى العقل . وقرأ الجمهور { تشركون } بفوقية على الخطاب تبعاً للخطاب في { ءاتيتم } \\[ الروم : 39 \\] . وقرأه حمزة والكسائي وخلف بتحتية على الالتفات من الخطاب إلى الغيبة .\n\n",
      "translations": [
        {
          "translation": "(Allah is He Who created you) as living beings in the wombs of your mothers and then He made you emerge from there possessed of a spirit (and then sustained you) provided you with sustenance until you die, (then causeth you to die) when your lifespan expires, (then giveth life to you again) for the resurrection after you die. (Is there any of your (so called) partners (of Allah)) of your idols, O people of Mecca, (that doeth aught of that) who is able to do any of this? (Praised) He exonerated Himself from having a son or partners (and exalted be He above what they associate (with Him)) of idols!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تطلبون وتقصدون بخيراتكم وصدقاتكم خالص وجه الله\n وتشركون معه غيره من التماثيل والأظلال الهالكة\n البالطة العاطلة\n إذ { ٱللَّهُ } المتوحد المتفرد في ذاته\n القادر المقتدر\n الحكيم العليم { ٱلَّذِي خَلَقَكُمْ } وأظهركم من كتم العجم\n ولم تكونوا شيئاً مذكوراً لا بالقوة ولا بالفعل { ثُمَّ } بعدما أظهركم في بيداء الوجود { رَزَقَكُمْ } وأنعم عليكم من أنواع النعم\n ليربيكم بها على مقتضى اللطف والكرم { ثُمَّ } بعدما انقضى الأجل المسمى عنده لبقائكم في النشأة الأولى { يُمِيتُكُمْ } على مقتضى قهره وجلاله تتميماً لقدرته الكاملة الغالبة { ثُمَّ } بعدما انقرضت النشاة الأولى المعدة لأنواع الابتلاءات والاختبارات الإلهية\n المتعقلة لحكمة إظهاركم وإيجادكم في عالم الكون والفساد\n لتتزودوا فيها من المعارف والحقائق\n والاتصاف بالأخلاق الإلهية لنشأتكم الأخرى { يُحْيِيكُمْ } فيها\n للعرض والجزاء وتنقيد ما اقترفتم من الأعمال والأحوال في النشأة الأولى\n لتجازوا بها على مقتضى فيها\n\n\nوبعدما سمعتم ما سمعتم تأملوا وتدبروا منصفين أيها المشركون بالله المتوحد المتفرد\n والمستقل في التصرفات الواقعة في ملكه غيرةً منه سبحانه وحميَّة\n لحمى قدس ذاته من أن يحوم حول سرادقات عزه وجلاله شائبة فتور وقصور\n وبعدما سمعتم هذا من خواص أوصافه سبحانه تأملوا { هَلْ مِن شُرَكَآئِكُمْ } الذي ادعيتم شركتهم مع الله القادر المقتدر على أمثاله بالاستقلال والاختيار { مَّن يَفْعَلُ مِن ذَٰلِكُمْ } الذي سمعتم صدروه منه سبحانه { مِّن شَيْءٍ } حقير قليل\n كلا وحاشا صدور شيء من الأشياء من غيره { سُبْحَانَهُ } أي: في ذاته منزه عن شوب الشركة والمظاهرة مطلقاً { وَتَعَالَىٰ } شأنه { عَمَّا يُشْرِكُونَ } [الروم: 40] أولئك المشركون المسرفون علواً كبيراً\n\n\nومن كمال جهلهم بالله\n وغفلتهم عن علو قدره وسمو مكانته { ظَهَرَ ٱلْفَسَادُ } وأنواع البليات والمصيبات الواقعة { فِي ٱلْبَرِّ وَٱلْبَحْرِ } من الجدب والعناء والوباء والزلزلة\n وأنواع الحرق والغرق والضلالات الواقعة في السفن الجارية\n مع أن أصل الظهور والبروز باعتبار الفطرة الأصلية على العدالة والاستقامة\n وإنما ظهر ما ظهر من الانحرافات والانصرافات المنافية لصرافة الاعتدال الحقيقي الإلهي { بِمَا كَسَبَتْ أَيْدِي ٱلنَّاسِ } أي: بشؤم ما اقترفوا من الكفر والكفران\n والفسوق والعصيان\n والخروج عن مقتضى الحدود الإلهية الموضوعة على الاعتدال والقسط القويم\n والحكمة في صدور هذه الانحرافات والفسادات منهم: { لِيُذِيقَهُمْ بَعْضَ ٱلَّذِي عَمِلُواْ } أي: ليذيق لهم العليم الحكيم في الدنيا وبال بعض أعمالهم الفاسدة\n ويبقى بعضها إلى الآخرة ليستوفيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الله: مبتدأ، و الذي خلقكم خبر. يقول الحق جل جلاله: { الله الذي خلقكم } أظهركم { ثم رزقكم } ما تقوم به أبدانكم، { ثم يُميتكم } عند انقضاء آجالكم، { ثم يُحييكم } عند بعثكم ليجازيكم على فعلكم، أي: هو المختص بالخلق والرزق، والإماتة، والإحياء. { هل من شركائكم } أصنامكم { من يفعل من ذلكم من شيء } أي: الخلق، والرزق، والإماتة، والإحياء، { هل من شركائكم } أصنامكم { من يفعل من ذلكم من شيء } أي: الخلق وارزق والإماتة والإحياء { من شيء } أي: شيئاً من تلك الأفعال؟ فلم يجيبوا، عجزاً، فقال استبعاداً وتنزيهاً: { سبحانه وتعالى عما يشركون }.و \" من \" الأولى، والثانية، والثالثة: زوائد لتأكيد عجز شركائهم، وتجهيل عَبَدَتِهِمْ. الإشارة: ذكر الحق تعالى أربعة أشياء متناسقة أنه هو فاعلها، فأقر الناس بثلاثة، وشكُّوا في الرزق، وقالوا: لا يكون إلا بالسبب، والسبب إنما هو ستر لسر الربوبية. فإذا تحقق وجوده في حق العامة ارتفع حق الخاصة، فيرزقهم بلا سبب، لقوله تعالى:\n[الطلاق: 2، 3]. قال القشيري: حين قذفك في بَطْنِ أُمّك قد كنت غنياً عن الأكل والشراب بقدرته أو مفتقراً إليه، فأجرى رزقه عليك مع الطمث، على ما قالوا، وإذا أخرجك من بطن أمك رزقك على الوجه المعهود في الوقت المعلوم، فيسر لك أسباب الشُرْب والأكل من لبن الأم، ثم من فنون الطعام، ثم أرزاق القلوب والسرائر، من الإيمان والعرفان، وأرزاق التوفيق من الطاعات والعبادات، وأرزاق اللسان من الأذكار، وغير ذلك مما جرى ذكره. { ثم يُميتكم } بسقوط شهواتكم، ويُميتكم عن شواهدكم، { ثم يحييكم } بحياة قلوبكم، ثم بأن يحييكم بربكم. ويقال: من الأرزاق ما هو وجود الأرفاق، ومنها ما شهود الرزاق، ويقال: لا مُكْنَةَ لك في تبديل خلقك، فكذلك لا قدرة لك على تغيير رزقك. فالمُوَسَّع عليه: رزقه بفضل ربه، لا بمناقب نفسه. والمُقَتّر عليه رزقُه بحُكم ربه لا بمعايب نفسه. هـ. وبعضه بالمعنى. وقد يُضَيِّق رزقه على العباد لما يظهر فيهم من الفساد، كما قال تعالى: { ظَهَرَ ٱلْفَسَادُ فِي... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:68",
      "similarity": 0.6085847867610128
    },
    {
      "verse": "16:1",
      "similarity": 0.4604151051129736
    },
    {
      "verse": "17:43",
      "similarity": 0.453398744980405
    },
    {
      "verse": "16:3",
      "similarity": 0.4460593407882429
    },
    {
      "verse": "87:1",
      "similarity": 0.42519320477477723
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030040.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030040.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}