{
  "chapter": "الروم",
  "text": "من كفر فعليه كفره ومن عمل صلحا فلانفسهم يمهدون",
  "translations": [
    {
      "translation": "So that he who disbelieves will bear the consequence of his unbelief; and he who does the right will straighten out the way for himself,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who disbelieves will suffer the consequence of it and he who acts righteously, they will pave the way for their own good\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve do so against their own souls. Those who do good pave the way for their own benefit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever disbelieves, then the calamity of his disbelief is only on him; and those who do good deeds, are preparing for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever disbelieves will suffer from his disbelief, and whosoever does righteous good deeds, then such will prepare a good place for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever disbelieves, he shall be responsible for his disbelief, and whoever does good, they prepare (good) for their own souls,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso disbelieves, his unbelief shall be charged against him; and whosoever does righteousness for themselves they are making provision,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso disbelieveth must (then) bear the consequences of his disbelief, while those who do right make provision for themselves -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who rejected the truth will bear the burden of that rejection, and those who did good deeds will have made good provision for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever disbelieveth, on him is his infidelity, and those who work righteously are preparing for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is faithless shall face the consequences of his faithlessness, and those who act righteously only prepare for their own souls,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Faith will suffer from that rejection: and those who work righteousness will spread their couch (of repose) for themselves (in heaven):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever disbelieves will suffer from his disbelief, and whosoever does righteous good deeds (by practising Islamic Monotheism), then such will prepare a good place (in Paradise) for themselves (and will be saved by Allah from His Torment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve will be charged for their disbelief, while the righteous are making provision for themselves\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever disbelieves, upon him falls his disbelief. And whoever acts righteously—they are preparing for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever disbelieves - upon him is [the consequence of] his disbelief. And whoever does righteousness - they are for themselves preparing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:44] Whoever disbelieves, [the consequence of] his disbelief shall upon him, that is, the evil consequences of his disbelief, which will be [his being punished in] the Fire, and those who act righteously, they will be paving the way for [the salvation of] their own souls, preparing their places in Paradise,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso disbelieveth) in Allah (must (then) bear the consequences of his disbelief) the punishment of his disbelief is to dwell in the Fire forever, (while those who do right) and are also believers (make provision for themselves) and collect reward and honour in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلأَنفُسِهِمْ يَمْهَدُونَ } أي يَعملونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَن كَفَرَ } فيما مضى { فَعَلَيْهِ كُفْرُهُ } أي: وبال كفره وفسقه ملازم معه يدخله في النار، ويخلده فيها مهاناً { وَمَنْ عَمِلَ صَالِحاً } فيما مضى { فَلأَنفُسِهِمْ يَمْهَدُونَ } [الروم: 44] أي: فهم بإيمانهم وعملهم الصالح يمهدون، ويبسطون لأنفسهم منزلاً ومهاداً في الجنة هم فيها خالدون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}