{
  "chapter": "الروم",
  "text": "ولقد ضربنا للناس فى هذا القرءان من كل مثل ولئن جئتهم بـاية ليقولن الذين كفروا۟ ان انتم الا مبطلون",
  "translations": [
    {
      "translation": "We have offered every kind of example here in this Qur'an to men. Even then if you bring a verse to them, those who disbelieve say: \"You are nothing but a liar.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Qur'an We have explained things to people in myriad ways. But no matter what Sign you bring to them, those who are resolved upon denying the Truth will say: “You are given to falsehood.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have told people various parables in this Quran. Even if you had shown them a miracle, the unbelievers would have said, \"You are only the followers of falsehood\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have illustrated all kinds of examples in this Qur’an for mankind; and indeed if you bring a sign to them, the disbelievers will say, “You are upon nothing but falsehood.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have set forth for mankind, in this Qur'an every kind of parable. But if you bring to them any sign or proof, the disbelievers are sure to say (to the believers): \"You follow nothing but falsehood and magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have set forth for men every kind of example in this Quran; and if you should bring them a communication, those who disbelieve would certainly say: You are naught but false claimants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have struck for the people in this Koran every manner of similitude; and if thou bringest them a sign, those who are unbelievers will certainly say, 'You do nothing but follow falsehood.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have coined for mankind in this Qur'an all kinds of similitudes; and indeed if thou camest unto them with a miracle, those who disbelieve would verily exclaim: Ye are but tricksters!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, We have set forth for men in this Quran every kind of parable and indeed, if you bring them a sign, those who are bent on denying the truth are sure to say, \"You are only making false claims!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have propounded for mankind, in this Qur'an, every kind of similitude; and if thou bringest unto them a sign, those who disbelieve are sure to say: ye are but followers of falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly we have drawn for mankind in this Quran every [kind of] parable. Indeed if you bring them a sign, the faithless will surely say, ‘You are nothing but fabricators!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "verily We have propounded for men, in this Qur'an every kind of Parable: But if thou bring to them any Sign, the Unbelievers are sure to say, \"Ye do nothing but talk vanities.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have set forth for mankind, in this Quran every kind of parable. But if you (O Muhammad SAW) bring to them any sign or proof, (as an evidence for the truth of your Prophethood), the disbelievers are sure to say (to the believers): \"You follow nothing but falsehood, and magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this Koran We have set forth for mankind all manner of examples. Yet if you bring to them a sign the unbelievers will surely say: 'You are but falsifiers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have cited in this Quran for the people every sort of parable. But even if you bring them a miracle, those who disbelieve will say, “You are nothing but fakers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly presented to the people in this Qur'an from every [kind of] example. But, [O Muhammad], if you should bring them a sign, the disbelievers will surely say, \"You [believers] are but falsifiers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:58] And verily We have struck, We have coined, for mankind in this Qur’ān every [kind of] similitude, as a way of cautioning them. And if (wa-la-in, the lām is for oaths) you, O Muhammad (s), were to bring them a [miraculous] sign, such as the staff or the hand in the case of Moses, those who disbelieve, from among them, will certainly say (la-yaqūlanna: the indicative nūn has been omitted because of the other nūn coming after it, and likewise the wāw [replaced by the damma in lu], because of two unvocalised consonants coming together and it indicates the plural person), ‘You — in other words, Muhammad (s) and his Companions — are nothing but followers of falsehood’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily We have coined) We have explained (for mankind in the Qur'an all kinds of similitudes) in all kinds of ways; (and indeed if thou earnest unto them with a miracle) from heaven as they have asked, (those who disbelieve) the disbelievers of Mecca (would verily exclaim: Ye are) O congregation of believers (but tricksters) liars! 463\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التأكيد والمبالغة مشيراً إلى كمال قسوة أهل الزيغ والضلال: { وَلَقَدْ ضَرَبْنَا } وبيَّنا { لِلنَّاسِ } الناسين طريق الوصول إلى توحيدنا ووحدة ذاتنا { فِي هَـٰذَا ٱلْقُرْآنِ } المنزل من عندنا؛ لتبيين طريق توحيدنا، وسلوك سبيل الاستقامة والرشاد فيه { مِن كُلِّ مَثَلٍ } ينبئ لهم عنه، وينبئهم عليه، ويبين لهم كيفية التنبه والتفطن منه، ومع ذلك لم ينتبهوا ولم يتفطنوا إلا قليلاً منه { وَ } من غلظ غشاوتهم، ونهاية غفلتهم وضلالهم { لَئِن جِئْتَهُمْ } يا أكمل الرسل { بِآيَةٍ } من آيات القرآن ملجئةٍ لهم إلى الإيمان، لو تأملوا معناها وتدبروا فحواها { لَّيَقُولَنَّ ٱلَّذِينَ كَفَرُوۤاْ } أي: أعرضوا عن الحق، وانصرفوا عن توحيده والإيمان على سبيل الحصر والمبالغة بلا مبالاة بك وبآياتك: { إِنْ أَنتُمْ } أي: ما أنتم في دعواكم هذه أيها المدعون الكاذبون - يعنون: الرسلو والمؤمنين - { إِلاَّ مُبْطِلُونَ } [الروم: 58] متفرون مزروعون، تفترون على الله ما تختلقون من تلقاء نفوسكم تغريراً وترويجاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}