{
  "chapter": "الروم",
  "text": "وقال الذين اوتوا۟ العلم والايمن لقد لبثتم فى كتب الله الى يوم البعث فهذا يوم البعث ولكنكم كنتم لا تعلمون",
  "translations": [
    {
      "translation": "Those who have been given knowledge and iman will say, 'You tarried in accordance with Allah's Decree until the Day of Rising. And this is the Day of Rising, but you did not know it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were given the knowledge and belief will say: \"You have tarried, according to the Book of God, as long as the Day of Resurrection, and this is the Day of Resurrection, but 'you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been endowed with knowledge and faith shall say: “According to Allah's Record you have stayed till the Day of Resurrection. Now, this is the Day of Resurrection. But you did not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have received knowledge and have faith will say, \"By the decree of God, you have remained for the exact period which was mentioned in the Book of God about the Day of Resurrection. This is the Day of Resurrection, but you did not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said those who received knowledge and faith, “You have indeed stayed in the decree of Allah until the Day of Restoration; so this is the Day of Restoration, but you did not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have been bestowed with knowledge and Faith will say: \"Indeed you have stayed according to the decree of Allah, until the Day of Resurrection; so this is the Day of Resurrection, but you knew not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are given knowledge and faith will say: Certainly you tarried according to the ordinance of Allah till the day of resurrection, so this is the day of resurrection, but you did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have been given knowledge and faith shall say, 'You have tarried in God's Book till the Day of the Upraising, This is the Day of the Upraising, but you did not know.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those to whom knowledge and faith are given will say: The truth is, ye have tarried, by Allah's decree, until the Day of Resurrection. This is the Day of Resurrection, but ye used not to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those endowed with knowledge and faith will say, \"Indeed, you did tarry, as God ordained, till the Day of Resurrection, and this is the Day of Resurrection: but you were not aware of it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have been vouchsafed knowledge and belief will say: assuredly ye have tarried according to the decree of Allah until the Day of Upraising; so this is the Day of Upraising, but ye were wont not to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were given knowledge and faith will say, ‘Certainly you remained in Allah’s Book until the Day of Resurrection. This is the Day of Resurrection, but you did not know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those endued with knowledge and faith will say: \"Indeed ye did tarry, within Allah's Decree, to the Day of Resurrection, and this is the Day of Resurrection: but ye - ye were not aware!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have been bestowed with knowledge and faith will say: \"Indeed you have stayed according to the Decree of Allah, until the Day of Resurrection, so this is the Day of Resurrection, but you knew not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those to whom knowledge and belief have been given will say: 'You have stayed in the Book of Allah (the Protected Tablets) till the Day of Resurrection. This is the Day of Resurrection, yet you did not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those endowed with knowledge and faith will say, “You remained in God’s Book until the Day of Resurrection. This is the Day of Resurrection, but you did not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were given knowledge and faith will say, \"You remained the extent of Allah 's decree until the Day of Resurrection, and this is the Day of Resurrection, but you did not used to know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:56] But those who have been given knowledge and faith, of angels and others, shall say, ‘You have remained according to God’s decree, in accordance with what He had decreed [for you] in His prior knowledge, until the Day of Resurrection. This is the Day of Resurrection, which you rejected, but you did not know’, that it would come to pass.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَالْإِيمَانَ لَقَدْ لَبِثْتُمْ فِي كِتَابِ اللَّهِ إِلَى يَوْمِ الْبَعْثِ فَهَذَا يَوْمُ الْبَعْثِ وَلَكِنَّكُمْ كُنْتُمْ لَا تَعْلَمُونَ (56)جعل الله منكري البعث هدفاً لسهام التغليظ والافتضاح في وقت النشور ، فلما سمع المؤمنون الذين أوتوا علم القرآن وأشرقت عقولهم في الحياة الدنيا بالعقائد الصحيحة وآثار الحكمة لم يتمالكوا أن لا يردوا عليهم غلطهم رداً يكون عليهم حسرات أن لا يكونوا قبلوا دعوة الحق كما قبلها المؤمنون . وهذه الجملة معترضة . وعطف الإيمان على العلم للاهتمام به لأن العلم بدون إيمان لا يرشد إلى العقائد الحق التي بها الفوز في الحياة الآخرة . والمعنى : وقال لهم المؤمنون إنكاراً عليهم وتحسيراً لهم .والظاهر أن المؤمنين يسمعون تَحَاجَّ المشركين بعضهم مع بعض فيبادرون بالإنكار عليهم لأن تغيير المنكر سجيتهم التي كانوا عليها . وفي هذا أدب إسلامي وهو أن الذي يسمع الخطأ في الدين والإيمان لا يقره ولو لم يكن هو المخاطَب به .وقولهم : { لقد لبثتم في كتاب الله إلى يوم البعث } صرف لهم عن تلك المعذرة كأنهم يقولون : دَعُوا عنكم هذا فلا جدوى فيه واشتغِلوا بالمقصود وما وُعدتم به من العذاب يوم البعث . وفعل { لَبِثْتُم } مستعمل في حقيقته ، أي مكثْتم ، أي استقررتم في القبور ، والخبر مستعمل في التحزين والترويع باعتبار ما يرد بعده من الإفصاح عن حضور وقت عذابهم . و { في } من قوله { فِي كِتَاب الله } للتعليل ، أي لبثتم إلى هذا اليوم ولم يعذبوا من قبل لأجل ما جاء في كتاب الله من تهديدهم بهذا اليوم مثل قوله تعالى : { ومِنْ وَرَائهم بَرْزَخ إلاى يَوْم يُبْعَثُون } \\[ المؤمنون : 100 \\] ، أي : لقد بلغكم ذلك وسمعتموه فكان الشأن أن تؤمنوا به ولا تعتذروا بقولكم مَا لَبِثْنا غيرَ سَاعة .والفاء في { فهذا يوم البعث } فاء الفصيحة أفصحت عن شرط مقدر ، وتفيد معنى المفاجأة كما تقدم عند قوله تعالى : { فَقَدْ كَذَّبُّوكم بِمَا تَقُولون } في سورة الفرقان ( 19 ) ، أي إذا كان كذلك فهذا يوم البعث كالفاء في قول عباس بن الأحنف :قالوا خراسانُ أقصى ما يُراد بنا ... ثم القفول فقد جئنا خراساناوهذا توبيخ لهم وتهديد وتعجيل لإساءتهم بما يترقبهم من العذاب . والاقتصار على { فهذا يوم البعث } ليتوقعوا كل سوء وعذاب .والاستدراك في { ولكنكم كنتم لا تعلمون } استدراك على ما تضمنته جملة { لقد لبثتم في كتاب الله إلى يوم البعث } أي لقد بلغكم ذلك وكان الشأن أن تستعدوا له ولكنكم كنتم لا تعلمون ، أي : لا تتصدون للعلم بما فيه النفع بل كان دأبكم الإعراض عن تصديق الرسول صلى الله عليه وسلموفي التعبير بنفي العلم وقصدِ نفي الاهتمام به والعناية بتلقيه إشارة إلى أن التصدي للتعلّم وسيلة لحصوله .\n\n",
      "translations": [
        {
          "translation": "(But those to whom knowledge and faith are given) those honoured with knowledge and faith (will say: The truth is, ye have tarried) in your graves, (by Allah's decree) those who say this are the angels; and it is said they are the prophets; and it is also said they are those who are sincere in their faith, they will say to the disbelievers: you remained in your graves (until the Day of Resurrection) from the graves. (This is the Day of Resurrection) this is the Day of Judgement, (but ye used not to know) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وانصرافهم عن الحق { قَالَ ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } اللدني من قِبَل الحق { وَٱلإِيمَانَ } بالمغيبات التي أُمروا بتصديقها على ألسنة الرسل والكتب\n سيما يوم البعث والنشور رداً عليهم\n وتخطئةً لهم: { لَقَدْ لَبِثْتُمْ } في الدنيا بمقتضى ما ثبت { فِي كِتَابِ ٱللَّهِ } ولوح قضائه\n وحضرة علمه { إِلَىٰ يَوْمِ ٱلْبَعْثِ } وحشر الموتى\n وقيام الساعة { فَهَـٰذَا } اليوم الذي أنتم فيه معذبون الآن { يَوْمُ ٱلْبَعْثِ } الموعود لكم في الدنيا على ألسنة الرسل { وَلَـٰكِنَّكُمْ } من خبث طينتكم وجهلكم { كُنتمْ لاَ تَعْلَمُونَ } [الروم: 56] ولا تؤمنون به\n ولا تصدقون قيامه\n بل تنكرونها وتكذبون من أخبر بها من الرسل العظام\n مع أنهم مؤيَّدون من قِبَل الحق بالدلائل القاطعة\n والبراهين الساطعة\n والمعجزات الباهرة الظاهرة\n\n\nوبعدما فوَّتوا الفرص في دار الاختبار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: لقد مكثتم مُدَّةَ البرزخ { إلى يوم البعث } \n ردّوا عليهم ما قالوه\n وحلَّفُوهم عليه\n وأطلعوهم على حقيقة الأَمر\n ثم وَبَّخُوهُمْ على إنكار البعث بقولهم: { فهذا يَوْمُ البعث } الذي كنتم تنكرونه\n { ولكنكم كنتم لا تعلمون } في الدنيا أنه حق لتفريطكم في طلب الحق\n واتباعه\n والفاء جواب شرط مقدر\n ينساق إليه الكلام\n أي: إن كنتم منكرين للبعث فهذا يومه\n { فيومئذٍ لا تنفع الذين ظلموا } كفروا { مَعْذِرَتُهُم }: اعتذارهم\n والمعذرة: تأنيثها مجازي\n فيجوز التذكير والتأنيث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:144",
      "similarity": 0.6332058449777699
    },
    {
      "verse": "23:114",
      "similarity": 0.5462227425766506
    },
    {
      "verse": "23:113",
      "similarity": 0.48036889975473374
    },
    {
      "verse": "18:26",
      "similarity": 0.42084578370919906
    },
    {
      "verse": "17:52",
      "similarity": 0.3940377282288912
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030056.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030056.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:56.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}