{
  "chapter": "الروم",
  "text": "وما انت بهد العمى عن ضللتهم ان تسمع الا من يؤمن بـايتنا فهم مسلمون",
  "translations": [
    {
      "translation": "You will not guide blind men from their misguidance. You will not make anyone hear except for those who have iman in Our Signs and so are Muslims.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you make the blind see the way when they have gone astray. You can make none hear except those who believe Our signs and have come to submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor can you guide the blind out of their error. You can make none hear (your call) except those who believe in Our Signs and have surrendered themselves (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide the straying blind. You can make no one listen except those who believe in Our revelations and are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do you guide the blind out of their error; you only make those hear who believe in Our signs, so they have submitted. (The disbelievers are referred to as blind.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot guide the blind from their straying; you can make to hear only those who believe in Our Ayat, and have submitted (to Allah in Islam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you lead away the blind out of their error. You cannot make to hear any but those who believe in Our communications so they shall submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou shalt not guide the blind out of their error neither shalt thou make any to hear except for such as believe in Our signs, and so surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor canst thou guide the blind out of their error. Thou canst make none to hear save those who believe in Our revelations so that they surrender (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "just as you cannot lead the blind [of heart] out of their error, you cannot make anyone hear your call save those who are willing to believe in Our revelations, and thus surrender themselves to Us and are submissive to Our will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor canst thou be a guide to the blind out of their error; thou canst make none to hear save those who believe in Our signs, and who have surrendered themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor can you lead the blind out of their error. You can make only those hear who have faith in Our signs and have submitted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor canst thou lead back the blind from their straying: only those wilt thou make to hear, who believe in Our signs and submit (their wills in Islam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you (O Muhammad SAW) cannot guide the blind from their straying; you can make to hear only those who believe in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and have submitted to Allah in Islam (as Muslims).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot guide the blind out of their error. Nor shall you make any to hear except those who believe in Our verses, and are submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you guide the blind out of their error. You can make hear only those who believe in Our signs, and so have submitted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [in submission to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:53] Nor can you guide the blind out of their error. You can only make hear, in a way so as to understand and accept, those who believe in Our signs, [in] the Qur’ān, and have thus submitted, sincere in their affirmation of God’s Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nor canst thou guide the blind out of their error) towards guidance. (Thou canst make none to hear) your call (save those who believe in Our revelations) in Our Scripture and Messenger (so that they surrender (unto Him)) they are sincere to Him in their worship and confession of Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا يتأتى لك أن تهديهم إلى طريق التوحيد وترشدهم إليه { إِن تُسْمِعُ } بتبليغك وإرشادك { إِلاَّ مَن يُؤْمِنُ بِآيَاتِنَا } ونوفقهم على الإيمان بمقتضى ما ثبت وجرى في لوح قضائنا وحضرة عملنا { فَهُمْ } بعدما سبقت العناية منا إياهم { مُّسْلِمُونَ } [الروم: 53] منقادون لك\n مسلمون منك جميع ما بلغت لهم من شعائر الدين\n ودلائل التوحيد واليقين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { عن ضلالتهم } أي: لا تقدر أن تهدي الأعمى عن طريقه إذا ضلّ عنه\n بالإشارة إليه\n { إنْ } ما { تُسمع إلا من يؤمن بآياتنا فهم مسلمون } منقادون لأوامر الله ونواهيه\n الإشارة: من أصول طريقة التصوف: الرجوع إلى الله في السراء والضراء\n فالرجوع في السراء: بالحمد والشكر\n وفي الضراء: بالرضا والصبر\n قال القشيري: { فإنك لا تُسمع الموتى\n\n } إلخ: مَنْ فَقَدَ الحياةَ الأصلية لم يَعِشْ بالرُّقَى والتمائم وإذا كان في السريرة طَرَشٌ عن سماء الحقائق\n فَسَمْعُ الظواهر لا يفيد إلا تأكيد الحُجَّة\n وكما لم يُسمع الصمّ الدعاء\n فكذلك لا يمكنه أن يهدي العُمْيَ عن ضلالتهم\n هـ\n ولما ذكر شيئاً من دلائل الأكوان\n ذكر شيئاً من دلائل الأنفس\n فقال: { ٱللَّهُ ٱلَّذِي خَلَقَكُمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:81",
      "similarity": 0.9999999999999998
    },
    {
      "verse": "17:72",
      "similarity": 0.6610627638021569
    },
    {
      "verse": "80:2",
      "similarity": 0.6354984336205196
    },
    {
      "verse": "10:43",
      "similarity": 0.5823849117015713
    },
    {
      "verse": "35:19",
      "similarity": 0.5672000993867601
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}