{
  "chapter": "الروم",
  "text": "فانك لا تسمع الموتى ولا تسمع الصم الدعاء اذا ولوا۟ مدبرين",
  "translations": [
    {
      "translation": "You will not make dead men hear; you will not make deaf men hear the call, when they turn their backs in flight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead to listen nor the deaf hear the call when they have turned back and retreated,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), you cannot make the dead hear, nor can you make the deaf hear your call when they turn back in retreat,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead listen, nor the deaf hear. Thus, they, (the disbelievers), turn away on their heels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you do not make the dead hear nor make the deaf hear the call when they flee, turning back. (The disbelievers are referred to as dead and deaf.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily, you cannot make the dead to hear, nor can you make the deaf to hear the call, when they show their backs and turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For surely you cannot, make the dead to hear and you cannot make the deaf to hear the call, when they turn back and\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou shalt not make the dead to hear, neither shalt thou make the deaf to hear the call when they turn about, retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For verily thou (Muhammad) canst not make the dead to hear, nor canst thou make the deaf to hear the call when they have turned to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You [Prophet] cannot make the dead hear and you cannot make the deaf hear your call when they turn their backs and leave;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily thou canst not make the dead hear, nor canst thou make the deaf hear the call when they turn away in flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed you cannot make the dead hear, nor can you make the deaf hear the call when they turn their backs [upon you],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily thou canst not make the dead to hear, nor canst thou make the deaf to hear the call, when they show their backs and turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily, you (O Muhammad SAW) cannot make the dead to hear (i.e. the disbelievers, etc.), nor can you make the deaf to hear the call, when they show their backs, turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead hear you, nor can you make the deaf hear the call when they retreat, turning about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot make the dead hear, nor can you make the deaf hear the call when they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So indeed, you will not make the dead hear, nor will you make the deaf hear the call when they turn their backs, retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:52] And so you cannot make the dead hear, nor can you make the deaf hear the call when (read al-du‘ā’a idhā, pronouncing both hamzas, or by not pronouncing the second one [that comes] between it and the yā’) they go away with their backs turned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For verily thou (Muhammad) canst not make the dead to hear) you cannot make someone who is like a dead man hear, (nor canst thou make the deaf) the person who pretends to be deaf (to hear the call) your call to the Truth and guidance (when they have turned to flee) from the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا تجتهد إلى إهدائهم وتكميلهم { فَإِنَّكَ لاَ تُسْمِعُ ٱلْمَوْتَىٰ } أي: ليس في وسعك وطاقتك إسماع الموتى\n بل ما عليك إلا التبليغ والدعوة { وَلاَ تُسْمِعُ ٱلصُّمَّ } الجبلي { ٱلدُّعَآءَ } والدعوة\n سيما { إِذَا وَلَّوْاْ } وانصرفوا عنك { مُدْبِرِينَ } [الروم: 52] معرضين منكرين لك\n مكذبين رسالتك ودعوتك\n\n{ وَ } كيف تجتهد وتسعى يا أكمل الرسل في حصول ما هو خارج عن وسعك وطاقتك مع أنك لا تُؤم به؟! إذ { مَآ أَنتَ بِهَادِ ٱلْعُمْيِ عَن ضَلاَلَتِهِمْ } إذ هم مجبولون على الغواية الجبلية في أصل فطرتهم\n فقادون بصائر قلوبهم المدركة دلائل التوحيد وشواهد الوحدة الذاتية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:80",
      "similarity": 0.9981031457095454
    },
    {
      "verse": "21:45",
      "similarity": 0.7444156121364744
    },
    {
      "verse": "10:42",
      "similarity": 0.6829021264587308
    },
    {
      "verse": "43:40",
      "similarity": 0.6161560317588388
    },
    {
      "verse": "47:23",
      "similarity": 0.5439002903542799
    }
  ]
}