{
  "chapter": "الروم",
  "text": "ويوم تقوم الساعة يقسم المجرمون ما لبثوا۟ غير ساعة كذلك كانوا۟ يؤفكون",
  "translations": [
    {
      "translation": "On the Day the Last Hour arrives, the evildoers will swear they have not even tarried for an hour. That is the extent to which they are deceived.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day Resurrection is set the sinners will swear: \"We did not tarry more than an hour (and cannot be guilty).\" That is how they have always been deceived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day when the Hour will come to pass the wicked shall swear that they had stayed (in the world) no more than an hour. Thus they used to be deceived in the life of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the Hour of Doom comes, the criminals will swear that they have remained (in their graves) for no more than an hour. They had been inventing lies in this way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when the Last Day is established, the guilty will swear that they did not stay except for an hour; this is how they keep straying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day that the Hour will be established, the criminals will swear that they stayed not but an hour -- thus were they ever deluded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And at the time when the hour shall come, the guilty shall swear (that) they did not tarry but an hour; thus are they ever turned away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the Hour is come, the sinners shall swear they have not tarried above an hour; so they were perverted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when the Hour riseth the guilty will vow that they did tarry but an hour - thus were they ever deceived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the Last Hour arrives, the evil-doers will swear they have not even tarried for an hour, they have always been deluded,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day whereon the Hour arriveth, the Culprits Will swear that they tarried not but an hour: Thus Were they ever deluded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the Hour sets in, the guilty will swear that they had remained only for an hour. That is how they were used to lying [in the world].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day that the Hour (of Reckoning) will be established, the transgressors will swear that they tarried not but an hour: thus were they used to being deluded!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day that the Hour will be established, the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.) will swear that they stayed not but an hour, thus were they ever deluded [away from the truth (i.e. they used to tell lies and take false oaths, and turn away from the truth) in this life of the world)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the Day when the Hour has come, the harmdoers will swear that they had stayed no more than an hour. As such they are deceived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the Hour takes place, the sinners will swear they had stayed but an hour. Thus they were deluded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day the Hour appears the criminals will swear they had remained but an hour. Thus they were deluded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:55] And on the Day when the Hour comes the guilty, the disbelievers, shall swear that they had not remained more than an hour, in the grave. God, exalted be He, says: That is how they use to be deceived, [how] they used to be turned away from the truth — the Resurrection — similar to the way in which they have [now] been turned away from the real truth about how long they had remained.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَيَوْمَ تَقُومُ السَّاعَةُ يُقْسِمُ الْمُجْرِمُونَ مَا لَبِثُوا غَيْرَ سَاعَةٍ كَذَلِكَ كَانُوا يُؤْفَكُونَ (55)لما ذكر عدم انتفاع المشركين بآيات القرآن وشبهوا بالأموات والصم والعمي فظهرت فظاعة حالهم في العاجلة أتبع ذلك بوصف حالهم حين تقوم الساعة في استصحاب مكابرتهم التي عاشوا عليها في الدنيا ، بأن الله حين يعيد خلقهم وينشىء لهم أجساماً كأجسامهم ويعيد إليهم عقولهم يكون تفكيرهم يومئذ على وفاق ما كانوا عليه في الدنيا من السفسطة والمغالطة والغرور ، فإذا نُشروا من القبور وشعروا بصحة أجسامهم وعقولهم وكانوا قد علموا في آخر أوقات حياتهم أنهم ميتون خامرتهم حينئذ عقيدة إنكار البعث وحجتُهم السفسطائية من قولهم { هل نَدُلُّكم عَلى رَجُل يُنْبِئكُم إذَا مُزِقْتم كُلَّ مُمزق إنكُّم لَفِي خَلْقٍ جَدِيد } \\[ سبأ : 7 \\] ، هنالك يريدون أن يقنعوا أنفسهم بصحة دليلهم القديم ويلتمسون اعتلالاً لتخلف المدلول بعلة أن بعثهم ما كان إلا بعد ساعة قليلة من وقت الدفن قبل أن تنعدم أجزاء أجسامهم فيخيل إليهم أنهم مُحِقُّون في إنكاره في الدنيا إذ كانوا قد أخبروا أن البعث يكون بعد فناء الأجسام ، فهم أرادوا الاعتذار عن إنكارهم البعث حين تحققوه بما حاصله : أنهم لو علموا أن البعث يكون بعد ساعة من الحُلول في القبر لأقروا به . وقد أنبأ عن هذا تسمية كلامهم هذا معذرة بقوله عقبه : { فيومئذ لا ينفع الذين ظلموا معذرتهم } \\[ الروم : 57 \\] . وهذه فتنة أصيبوا بها حين البعث جعلها الله لهم ليكونوا هُزأة لأهل النشور . ويتضح غلطهم وسوء فهمهم كما دل عليه قوله تعالى بعد ذلك : { وقال الذين أوتوا العلم والإيمان } الآية \\[ الروم : 56 \\] وقد أومأ إلى أن هذا هو المراد من الآية أنه قال عقب ذلك : { كذلك كانوا يؤفكون } أي كهذا الخطأ كانوا في الدنيا يُصرفون عن الحق بمثل هذه الترهات . وتقدم شيء من هذا في المعنى عند قوله تعالى : { يَتَخافتون بَيْنهُم إنْ لَبِثْتُم إلاَّ عَشراً نَحْنُ أعْلَم بِمَا يَقُولون إذْ يَقُول أمْثَلهم طَرِيقَة إنْ لَبِثْتُم إلاَّ يوماً } في سورة طه ( 103 ، 104 ) . وبلغ من ضلالهم في ذلك أنهم يُقسمون عليه ، وهذا بعدَ ما يجري بينهم من الجدال من قول بعضهم : { إنْ لَبِثْتُم إلاَّ عَشْراً } وقول بعضهم : { إنْ لَبِثْتُم إلاَّ يَوْماً } ، وقول آخرين : { لَبِثْنَا يَوْماً أوْ بَعْض يَوْم } \\[ الكهف : 19 \\] وبعض اليوم يصدق بالساعة ، كما حكي عنهم في هذه الآية . والظاهر أن هذا القسم يتخاطبون به فيما بينهم كما اقتضته آية سورة طه ، أو هو حديث آخر أعلنوا به حين اشتد الخلاف بينهم لأن المصير إلى الحلف يؤذن بمشادة ولجاج في الخلاف . وفي قوله : { السَّاعَة } و { ساعة } الجناس التام .وجملة { كذلك كانوا يؤفكون } استئناف بياني لأن غرابة حالهم من فساد تقدير المدة والقسم عليه مع كونه توهماً يثير سؤال سائل عن مثار هذا الوهَم في نفوسهم فكان قوله { كذلك كَانُوا يُؤْفَكُون } بياناً لذلك .ومعناه : أنهم لا عجب في صدور ذلك منهم فإنهم كانوا يجيئون بمثل تلك الأوهام مدة كونهم في الدنيا ، فتصرفهم أوهامهم عن اليقين ، وكانوا يقسمون على عقائدهم كما في قوله : { وأقْسَموا بالله جَهْدَ أيْمَانِهم لاَ يَبْعَث الله مَنْ يَمُوت } \\[ النحل : 38 \\] استخفافاً بالأيمان ، وكذلك إشارة إلى انصرافهم عن الحق يوم البعث . والمشار إليه هو المشبه به والمشبه محذوف دل عليه كاف التشبيه ، والتقدير : إفكاً مثل إفكهم هذا كانوا يُؤفكون به في حياتهم الدنيا . والمقصود من التشبيه المماثلة والمساواة .والإفك بفتح الهمزة : الصرف وهو من باب ضرب ، ويُعدى إلى الشيء المصروف عنه بحرف ( عن ) ، وقد تقدم في تفسير قوله تعالى : { ليقولُنّ الله فأنَّى يُؤْفَكون } في سورة العنكبوت ( 60 ) . ولم يسند إفكهم إلى آفك معين لأن بعض صرفهم يكون من أوليائهم وأيمة دينهم ، وبعضَه من طبع الله على قلوبهم .وإقحام فعل { كانُوا } للدلالة على أن المراد في زمان قبلَ ذلك الزمن ، أي في زمن الحياة الدنيا . والمعنى : أن ذلك خلُق تخلقوا به وصار لهم كالسجية في حياتهم الدنيا حتى إذا أعاد الله إليهم أرواحهم صدر عنهم ما كانوا تخلقوا به وقال تعالى { قَالَ رَبِّ لِمَ حَشَرْتَني أعماى وقَد كُنْت بَصِيراً قَال كذلك أتَتْكَ آياتُنا فنسِيْتَها وكذلك اليَوْم تُنْسى وكذلك نَجْزِي مَنْ أسْرَف } الآية \\[ طه : 125 127 \\] وفي هذا الخبر أدب عظيم للمسلمين أن يتَحامَوْا الرذائل والكبائر في الحياة الدنيا خشية أن تصير لهم خلقاً فيحشروا عليها .\n\n",
      "translations": [
        {
          "translation": "(And on the day) which is the Day of Judgement (when the Hour riseth the guilty will vow) those who associate partners with Allah will swear (that they did tarry) in their graves (but an hour thus) they will be in disbelief in the Hereafter (were they ever deceived) just as they disbelieved in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإعادة الموتى أحياءً بعدما شهد هذه التطورات المتخالفة المتعاقبة؟! اذكر لهم يا أكمل الرسل { يَوْمَ تَقُومُ ٱلسَّاعَةُ } الموعودة المعدة لحشر الأموات من الأجداث { يُقْسِمُ ٱلْمُجْرِمُونَ } أي: يقسم ويحلف كلٌّ منهم عند صاحبه بمدة لبثهم في الدنيا مترفهين متنعمين\n واتفقوا بعدما اختلفوا وترددوا في مكثهم فيها أنهم { مَا لَبِثُواْ } فيها { غَيْرَ سَاعَةٍ } واحدة بالنسبة إلى طول يوم القيامة\n ومن شدة عذابها وأهوالها\n وكثرة الهموم والأحزان فيها صار لبثهم في الدنيا مدة أعمارهم فيها ساعة واحدة عندهم\n بل بضعهم تخيلوا أقصر منها { كَذَلِكَ } أي: مثل صرفهم عن طول مدة مكثهم في الدنيا يوم القيامة { كَانُواْ يُؤْفَكُونَ } [الروم: 55] ويصرفون في النشأة الأولى عن طريق التوحيد\n وسبيل الهداية والرشاد من كمال غفلتهم وقسوتهم\n\n\n{ وَ } بعدما سمع منهم المؤمنون الموحدونن استقصارهم مدة لبثهم فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" لبثوا \": جواب القسم على المعنى\n وإلا لقيل: ما لبثنا\n يقول الحق جل جلاله: { ويوم تقوم الساعةُ } \n أي: القيامة\n وسميت بذلك لأنها تقوم آخر ساعة من ساعات الدنيا\n ولأنها تقوم في ساعة واحدة\n وصارت عَلَماً لها بالغلبة\n كالنجم للثريا فإذا قامت { يُقسم المجرمون } يحلف الكافرون: { ما لبثوا } في قبورهم\n أو: في الدنيا\n { غيرَ ساعة } \n استقلّوا مدّة لبثهم في القبور\n أو: الدنيا\n لشدة هول المطلع\n أو: لطول مقامهم في أهوالها\n أو: ينسون ما لبثوا\n أو: يكذبون\n { كذلك كانوا يُؤفكون } \n أي: مثل ذلك الصرف كانوا يصرفون في الدنيا عن الصدق والتصديق\n أو: عن الحق حتى يروا الأشياء على غير ما هي عليه\n ويقولون: ما هي إلا حياتنا الدنيا وما نحن بمبعوثين\n { وقال الذين أُوثوا العلم والإيمان } \n أي: حَصَّلوا العلم بالله والإيمان بالبَعْثِ وهم الملائكة والأنبياء\n والمؤمنون: { لقد لبثتمْ في كتاب الله } في علم الله المثبت في اللوح\n أو: في حكم الله وقضائه\n أو: القرآن\n وهو قوله تعالى: \" ومن ورائهم برزخ\n\n \" إلخ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:1",
      "similarity": 0.3694825514944354
    },
    {
      "verse": "15:90",
      "similarity": 0.3651372805760365
    },
    {
      "verse": "51:9",
      "similarity": 0.35032295124881796
    },
    {
      "verse": "30:56",
      "similarity": 0.34471717475198244
    },
    {
      "verse": "23:114",
      "similarity": 0.34170728744752166
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030055.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030055.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}