{
  "chapter": "الروم",
  "text": "فانظر الى ءاثر رحمت الله كيف يحى الارض بعد موتها ان ذلك لمحى الموتى وهو على كل شىء قدير",
  "translations": [
    {
      "translation": "So look at the effect of the mercy of Allah, how He brings the dead earth back to life. Truly He is the One Who brings the dead to life. He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So consider the signs of His benevolence: How He quickens the earth after it had become waste. He is verily the one who will raise the dead. He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See, then, the tokens of Allah's Mercy: how He revives the earth after it is dead. Verily He is the One Who will revive the dead. He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look at the traces of the mercy of God, how He has revived the dead earth. God revives the dead; He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore observe the result of Allah’s mercy, how He revives the earth after its death; He will indeed resurrect the dead; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look then at the effects of Allah's mercy, how He revives the earth after its death. Verily, that shall indeed raise the dead, and He is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look then at the signs of Allah's mercy, how He gives life to the earth after its death, most surely He will raise the dead to life; and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So behold the marks of God's mercy, how He quickens the earth after it was dead; surely He is the quickener of the dead, and He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look, therefore, at the prints of Allah's mercy (in creation): how He quickeneth the earth after her death. Lo! He verily is the Quickener of the Dead, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look, therefore, at the signs of God's mercy; how He resurrects the earth after its death. Truly, the same God will resurrect the dead; for He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look then at the effects of Allah's mercy: what wise He quickeneth the earth after the death thereof. Verily. He is the Quickener of the dead, and He is over every-thing potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So observe the effects of Allah’s mercy: how He revives the earth after its death! Indeed He is the reviver of the dead, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then contemplate (O man!) the memorials of Allah's Mercy!- how He gives life to the earth after its death: verily the same will give life to the men who are dead: for He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look then at the effects (results) of Allah's Mercy, how He revives the earth after its death. Verily! That (Allah) Who revived the earth after its death shall indeed raise the dead (on the Day of Resurrection), and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look then at the marks of Mercy of Allah; how He revives the earth after its death. He is the Reviver of the dead. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So observe the effects of God’s mercy—how He revives the earth after it was dead. Indeed, He is the Reviver of the dead. He is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So observe the effects of the mercy of Allah - how He gives life to the earth after its lifelessness. Indeed, that [same one] will give life to the dead, and He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:50] So behold the effects (a variant reading has [singular] athar, ‘the effect’) of God's mercy, that is, His grace in giving [them] rain, how He revives the earth after it has died, [after] it has dried out, so that it produces vegetation [again]. Surely He is the Reviver of the dead and He has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Look, therefore,) O Muhammad (at the prints of Allah's mercy (in creation)) before and after the rain: (how 462 He quickeneth the earth after her death) after her dryness and exposure to drought. (Lo! He verily is the Quickener of the Dead) for the resurrection, (and He is Able to do all things) give life and death and resurrect the creation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱنظُرْ } أيها المؤمن المعتبر، الناظر بنور الله { إِلَىٰ آثَارِ رَحْمَتِ ٱللَّهِ } وكمال فضله وجوده { كَيْفَ يُحْيِ } ويخضر { ٱلأَرْضَ بَعْدَ مَوْتِهَآ } أي: جمودها ويبسها، وعدم نضارتها ونزاهتها، ويظهر أنواع الأزهار والأثمار عنايةً منه سبحانه لعباده، وفضلاً لهم؛ ليتزودوا بها ويسلكوا سبيل هدايته وتوحيده { إِنَّ ذَلِكَ } القادر المقتدر بالإرادة التامة و الاختيار الكامل { لَمُحْيِ ٱلْمَوْتَىٰ } ومخرجها ألبتة من قبورها وقت تعلق إرادته بإحيائها { وَ } كيف لا { هُوَ } بذاته { عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة حضرة علمه وإرادته { قَدِيرٌ } [الروم: 50] على الوجه الأتم الأكمل بلا فتور وقصور؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فانظرْ إلى آثار رحمةِ الله } أي: المطر { كيف يُحيي الأرضَ } بالنبات وأنواع الثمار { بعد موتها } يبسها { إن ذلك } أي: القادر عليه { لمحيي الموتى } فكما أحيا الأرض بعد يبسها يحيي الأجساد بعد رميمها، { وهو على كل شيءٍ قدير }  وهذا من جمل مقدوراته تعالى\n الإشارة: الله الذي يرسل رياح الواردات الإلهية، فتنزعج سحاب الآثارعن عين الذات العلية، فتبقى شمس العرفان، ليس دونها سحاب، فيبسطه في سماء القلوب كيف يشاء، فيقع الاحتجاب لبعضها، ويصرفه عمن يشاء فيقع التجلي والظهور، ويجعله كسفاً لأهل الاستشراف، فتارة ينجلي عنهم سحاب الآثار، فيشاهدون الأنوار، وتارة تغطيهم سُحب الآثار، فيشاهدون الأغيار، فترى مَطَرَ خَمْرَةِ الفناءِ تخرج من خلاله، فإذا أصاب به من يشاء من عباده، إذا هم يستبشرون بأنوار معرفته وأسرار ذاته\n وقد كانوا قبل ذلك مبلسين، آيسين، حين كانت نفوسهم غالبةً عليهم\n فانظر كيف أحيا أرض قلوبهم بعد موتها بالجهل والغفلة\n وهذا مثال من كان منهمكاً ثم سقط على شيخ ذي خمرة أزلية، فسقاه حتى حَيِيَ بمعرفة الله\n قال القشيري: الله الذي يرسل رياح عَطْفِه وجُودِه، مبشراتٍ بجوده ووَصْله، ثم يُمْطِر جودَ غيثِه على أسراره، ويطوي بساطَ الحشمة عن مناجاة قُرْبِه، وبضرب قبابَ الهيبة بمشاهد كَشْفِه، وينشر عليهم أزهار أُنْسِه، ثم يتجلَّى لهم بحقائق قُدْسِه، ويسقيهم بيده شراب حُبِّه\n وبعد ما محاهم عن أوصافهم أصحاهم، لا بهم، ولكنْ بِنَفْسه\n والعبارات عن ذلك خُرْسٌ، والإشارات، دونه، طُمْسٌ\n وقال في قوله تعالى: { فانظر إلى آثار رحمة الله\n\n\n } الآية: يحيي الأرض بأزهارها وأنوارها عند مجيء أمطارها، ليُخرجَ زَرْعَها وثمارَها، ويحي النفوس بعد تَفْرِيقها، ويوفقه للخيرات بعد فترتها، فتعمر أوطان الوفاق بصدق إقدامهم وتندفع البلايا عن الأنام ببركات أيامهم وتحيي القلوبُ بعد غفلتها بأنواع المحاضرات فتعود إلى استدامة الذكر بحُسْنِ المراعاة ويهتدي بأنوار أهلها أهلُ العصر من أهل الإرادات ويحيي الأرواح بعد حجْبتَها بأنوار المشاهدات فتطلع شموسُها من بُرْجِ السعادة ويتصل بمشامِّ أسرار الكافة نسيمُ ما يُفيض عليهم من الزيادات فلا يبقى صاحبُ نَفَسٍ إلا حَظِيَ منه بنصيب ويُحْيي الأسرارَ بأنوار المواجهات\n\n\nوما كان لها إلا وَقْفَةٌ في بعض الحالات فتنتفي بالكلية آثارُ الغَيْرِيَّةِ ولا يَبْقَى في الديار ديَّار ولا من سكانها آثار وسَطَواتُ الحقائق لا تثبت لها ذَرَّةٌ من صفات الخلائق هنالك الولاية لله الحق\n\n انتهى المراد منه مع زيادة بيان\n ثم ذكر الجوائح، وما ينشأ من أهل الغفلة عند ظهورها، فقال: { وَلَئِنْ أَرْسَلْنَا رِيحاً فَرَأَوْهُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:38",
      "similarity": 0.6280273049824909
    },
    {
      "verse": "87:16",
      "similarity": 0.5975639566791612
    },
    {
      "verse": "74:24",
      "similarity": 0.5467837619947015
    },
    {
      "verse": "20:84",
      "similarity": 0.5104596425187007
    },
    {
      "verse": "43:22",
      "similarity": 0.48889880348590475
    }
  ]
}