{
  "chapter": "الروم",
  "text": "ولئن ارسلنا ريحا فراوه مصفرا لظلوا۟ منۢ بعده يكفرون",
  "translations": [
    {
      "translation": "But if We send a wind, and they see it turning yellow, still they persist after that in being kafir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We send a (blighting) wind and they see (the earth) seared autumnal, they would surely become ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We were to send a wind and then their tilth has become yellow, they would never cease to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We had sent the wind and caused (the plants) to turn yellow and to fade away, they would still have remained in disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We send a wind and they see their fields yellow because of it, then indeed they would become ungrateful after it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We send a wind, and they see it turn yellow -- behold, they then would become unthankful (disbelievers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We send a wind and they see it to be yellow, they would after that certainly continue to disbelieve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We loose a wind, and they see it growing yellow, they remain after that unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We sent a wind and they beheld it yellow, they verily would still continue in their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if We send a wind and they see their harvest turn yellow, they will then begin to deny [Our favours].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We send a wind, and they should see their tilth yellow, then they would thereafter remain disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We send a wind and they see it turn yellow, they will surely become ungrateful after that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We (but) send a Wind from which they see (their tilth) turn yellow,- behold, they become, thereafter, Ungrateful (Unbelievers)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We send a wind [which would spoil the green growth (tilth) brought up by the previous rain], and they see (their tilth) turn yellow, behold, they then after their being glad, would become unthankful (to their Lord Allah as) disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if We sent a wind so they see it yellow, indeed after that they would still be unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We send a wind, and they see it turning things yellow, they would continue thereafter to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We should send a [bad] wind and they saw [their crops] turned yellow, they would remain thereafter disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:51] But if (wa-la-in, the lām is for oaths) We unleash a [different] wind, that damages vegetation, and they see it turn yellow, they would begin (la-zallū is the response to the [conditional] oath) after that, that is, after its turning yellow, to disbelieve, to deny the grace of [having been given] rain.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We sent a wind) cold or hot wind on their vegetation (and they beheld it) i.e. the vegetation (yellow) when it was green before that; (they verily would still continue in their disbelief) even after seeing it turn yellow, they would still disbelieve in Allah and show no gratitude towards Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من عدم رسوخهم في الدين القويم، وقلة تثبتهم على الصراط المستقيم { لَئِنْ أَرْسَلْنَا } عليهم { رِيحاً فَرَأَوْهُ } أي: ما هبت عليه من الزروع { مُصْفَرّاً } من أثرها بعدما كان مخضراً؛ يعني: لا يربى زروعهم ولا ينميها، بل يضعفها ويرديها، مع أن إضرارها واصفرارها أيضاً إما هو بشؤم ما اقترفوا من المعاصي والآثام { لَّظَلُّواْ مِن بَعْدِهِ } أي: صاروا وأخذوا بعد اصفراره { يَكْفُرُونَ } [الروم: 51] بالله وبنعمه، وينكرون بعموم فضله وكرمه، مع أن أخذهم بالبأساء والضراء؛ إنما هو ليتضرعوا نحوه، ويلتجئوا إليه منيبين خاشعين خاضعين؛ ليكشف عنهم ما يضرهم؛ إذ لا كاشف إلا هو، ولا منجي لهم سواه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:33",
      "similarity": 0.6766344195117971
    },
    {
      "verse": "2:69",
      "similarity": 0.22788565922940818
    },
    {
      "verse": "57:20",
      "similarity": 0.2119279691136095
    },
    {
      "verse": "26:189",
      "similarity": 0.20693885965923436
    },
    {
      "verse": "77:41",
      "similarity": 0.20632905621379638
    }
  ]
}