{
  "chapter": "الروم",
  "text": "فاصبر ان وعد الله حق ولا يستخفنك الذين لا يوقنون",
  "translations": [
    {
      "translation": "So be steadfast. Allah's promise is true. Do not let those who have no certainty belittle you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have patience. The promise of God is surely true; and let not those who do not believe make you relax (your endeavours).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, (O Prophet), have patience. Surely Allah's promise is true. Let those who lack certainty not cause you to be unsteady.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient. The promise of God is certainly true. Let not the faithless make you despair of the promise of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore patiently endure, indeed the promise of Allah is true; and may not those who do not have faith make you impatient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. Verily, the promise of Allah is true; and let not those who have no certainty of faith discourage you (from conveying Allah's Message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be patient; surely the promise of Allah is true and let not those who have no certainty hold you in light estimation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be thou patient; surely God's promise is true; and let not those who have not sure faith make thee unsteady.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have patience (O Muhammad)! Allah's promise is the very truth, and let not those who have no certainty make thee impatient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so have patience [O Muhammad]! God's promise is true; let not those who will not be convinced make you discouraged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have thou patience; verily the promise of Allah is true. And let not make thee impatient those who have no conviction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient! Allah’s promise is indeed true. And do not let yourself be upset by those who have no conviction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So patiently persevere: for verily the promise of Allah is true: nor let those shake thy firmness, who have (themselves) no certainty of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient (O Muhammad SAW). Verily, the Promise of Allah is true, and let not those who have no certainty of faith, discourage you from conveying Allah's Message (which you are obliged to convey)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, have patience. The promise of Allah is true. Do not let those who are uncertain make you unsteady.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. The promise of God is true. And do not let those who lack certainty belittle you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. Indeed, the promise of Allah is truth. And let them not disquiet you who are not certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:60] So be patient. Surely God’s promise, to give you victory over them, is true. And do not let them cause you to be inconstant, those who are uncertain, of the Resurrection, in other words, do not let them cause you to succumb to inconstancy and frivolity by abandoning patience, that is to say, do not abandon it. Meccan, except for verses 27, 28 and 29, which are Medinese; it consists of 34 verses revealed after [sūrat] al-Sāffāt.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So have patience) Muhammad! (Allah's promise) to help you, give you the upper hand and to destroy them (is the very truth) it will surely happen, (and let not those who have no certainty) those who do not believe (make thee impatient) make you swerve from faith on the day of Judgement'. And of the surah in which Luqman is mentioned, which is all Meccan and consists of 34 verses, 748 words and 2,110 letters: Surah 31: Luqman And of the surah in which Luqman is mentioned, which is all Meccan and consists of 34 verses, 748 words and 2,1 10 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوما متى سمعت يا أكمل الرسل من أحوالهم وأوصافهم ما سمعت من عدم قابليتهم واستعدادهم إلى الهداية والرشاد { فَٱصْبِرْ } على إيذائهم، وثق بالله وبوعده الذي وعدك بأن يُظهر دينك على الأديان كلها { إِنَّ وَعْدَ ٱللَّهِ } وإنجازه لما وعد به { حَقٌّ } بلا خلف وتردد { وَلاَ يَسْتَخِفَّنَّكَ } أي: لا يحملنَّك ويبعثنَّك يا أكمل الرسل على الخفة والاضطراب، وقلة التصبر، وعدم الثقة بالله القوم { ٱلَّذِينَ لاَ يُوقِنُونَ } [الروم: 60] ولا يتصفون باليقين في أمر من الأمور أصلاً، فيكف بالمعارف والحقائق الإلهية؛ إذ هم مجبولون على فطرة الضلال، مترددون في بيداء الوهم والخيال، لا نجاة لهم منها في حال من الأحوال؟!\n\n\n\n\nهب لنا من لدنك جذبةً تنجينا عن مضيق الجهل والضلال، ووصلنا إلى سعة العلم وفضاء الوصال، نحمدك على كل حال، ونسعيذ بك منك من جميع الأهوال\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المتحقق لمرتبة اليقين العلمي والعيني والحقي - مكنك الجق من مقر لاهوتك، وجنبك على لوازم ناسوتك مطلقاً - أن تتصبر على أذيات أصحاب التقليدات والتخمينات، وتتحمل على تشنعيات أرباب الظنون والجهالات المترددون في تيه الجهل الضلال بمتابعة الوهم والخيال، وتصفي خاطرط وضميرك عن معارضتهم ومقابلتهم، والبغض معهم والالتفات إليهم مطلقاً؛ إذ هم قوم خذلهم الله وأحطهم عن مرتبة الإنسان التي هي التحقق بمقام اليقين والعرفان، والتمكن في مرتبة الخلافة والنيابة من الرحمن المستعان، والتخلق بأخلاق الحنَّان المنَّان، وأسكنهم في مضيق الإمكان مقيدين بسلاسل التقليد وأغلال الحسبان، لا نجاة لهم منها أبداً\n\n\nوعليك أن تتوجه بوجه قلبك إلى ربك، وتفوض أمورك كلها إليه وتتخذه وكيلاً، وتجعله حسيباً وكفيلاً، فإنه سبحانه يكفيك مؤنة شرور أعدائك وحاسديك، ولك التبتل والانقطاع إلى الله في كل الحالات، والرجوع نحوه في جميع المهمات والملمات؛ إذ ما من خبر يسرك وشر يضرك إلاَّ منه بدأ وبقدرته ظهر، وعلى مقتضى علمه صدر وبموجب حكمته جرى وقدر\n\n\n\n\nفلك أن تسترجع إليه، وتتضرع نحوه، وتستعيذ منه به؛ إذ الكل من عنده لا راد لقضائه، ولا معقب لحكمه، يفعل ما يشاء، ويحكم ما يريد، لا حول ولا قوة إلا بالله العلي العظيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:85",
      "similarity": 0.5820100182641241
    },
    {
      "verse": "2:162",
      "similarity": 0.5649587174570473
    },
    {
      "verse": "3:88",
      "similarity": 0.5649587174570473
    },
    {
      "verse": "43:54",
      "similarity": 0.5572683232625578
    },
    {
      "verse": "4:28",
      "similarity": 0.524870227335713
    }
  ]
}