{
  "chapter": "الروم",
  "text": "اولم يتفكروا۟ فى انفسهم ما خلق الله السموت والارض وما بينهما الا بالحق واجل مسمى وان كثيرا من الناس بلقائ ربهم لكفرون",
  "translations": [
    {
      "translation": "Have they not reflected within themselves? Allah did not create the heavens and the earth and everything between them except with truth and for a fixed term. Yet many people reject the meeting with their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not think for themselves that God did not create the heavens and the earth and all that lies between them without reason and a determined purpose? But many men reject the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect on themselves? Allah created the heavens and the earth and whatever lies between them in Truth and for an appointed term. Yet many people deny that they will meet their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not thought that God has not created the heavens and the earth and all that is between them but for a genuine purpose to exist for an appointed term? Many people do not believe in their meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not inwardly pondered – that Allah has not created the heavens and the earth, and all that is between them, except with truth and a fixed term? And indeed many people deny the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Do they not reflect upon themselves) Thinking and pondering how Allah created various things in the upper and lower realms and in the space between, realizing that this was not created in jest or in vain, but in truth, and that it will continue until an appointed time, the Day of Resurrection\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect within themselves: Allah did not create the heavens and the earth and what is between them two but with truth, and (for) an appointed term? And most surely most of the people are deniers of the meeting of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not considered within themselves? God created not the heavens and the earth, and what between them is, save with the truth and a stated term; yet most men disbelieve in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered upon themselves? Allah created not the heavens and the earth, and that which is between them, save with truth and for a destined end. But truly many of mankind are disbelievers in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder about their own selves? God has created the heavens and the earth and all that is between them for a purpose and for an appointed time? Yet many deny they will ever meet with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ponder they not in their minds: Allah hath not created the heavens and the earth and whatsoever is in-between the twain save with a purpose and for a term appointed? And verily many men in the meecing of their Lord are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not reflected in their own souls? Allah did not create the heavens and the earth and whatever is between them except with consummate wisdom and for a specified term. Indeed many people disbelieve in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect in their own minds? Not but for just ends and for a term appointed, did Allah create the heavens and the earth, and all between them: yet are there truly many among men who deny the meeting with their Lord (at the Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not think deeply (in their ownselves) about themselves (how Allah created them from nothing, and similarly He will resurrect them)? Allah has created not the heavens and the earth, and all that is between them, except with truth and for an appointed term. And indeed many of mankind deny the Meeting with their Lord. [See Tafsir At-Tabari, Part 21, Page 24].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never thought to themselves that Allah did not create the heavens and the earth and all that is between except with truth, and for a stated term? Yet most people disbelieve that they will ever meet their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect within themselves? God did not create the heavens and the earth, and what is between them, except with reason, and for a specific duration. But most people, regarding meeting their Lord, are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not contemplate within themselves? Allah has not created the heavens and the earth and what is between them except in truth and for a specified term. And indeed, many of the people, in [the matter of] the meeting with their Lord, are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:8] Have they not contemplated themselves?, so that they might emerge from their oblivion. God did not create the heavens and the earth, and what is between them, except with the truth and an appointed term, for that [creation], at the conclusion of which this [creation] will perish, and after which will be the Resurrection. But indeed many people, that is to say, [such as] the Meccan disbelievers, disbelieve in the encounter with their Lord, that is, they do not believe in resurrection after death.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَوَلَمْ يَتَفَكَّرُوا فِي أَنْفُسِهِمْ مَا خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى وَإِنَّ كَثِيرًا مِنَ النَّاسِ بِلِقَاءِ رَبِّهِمْ لَكَافِرُونَ (8)عطف على جملة { وهُمْ عن الآخرةِ هم غَافِلون } \\[ الروم : 7 \\] لأنهم نفوا الحياة الآخرة فسيق إليهم هذا الدليل على أنها من مقتضى الحكمة .فضمير { يتفكروا } عائد إلى الغافلين عن الآخرة وفي مقدمتهم مشركو مكة . والاستفهام تعجيبي من غفلتهم وعدم تفكرهم . والتقدير : هم غافلون وعجيب عدم تفكرهم . ومناسبة هذا الانتقال أن لإحالتهم رجوع الدَّالة إلى الروم بعد انكسارهم سببين :أحدهما : اعتيادهم قصر أفكارهم على الجولان في المألوفات دون دائرة الممكنات ، وذلك من أسباب إنكارهم البعث وهو أعظم ما أنكروه لهذا السبب .وثانيهما : تمردهم على تكذيب الرسول صلى الله عليه وسلم بعد أن شاهدوا معجزته فانتقل الكلام إلى نقض آرائهم في هذين السببين .والتفكر : إعمال الفكر ، أي الخاطر العقلي للاستفادة منه ، وهو التأمل في الدلالة العقلية . وقد تقدم عند قوله تعالى { قُلْ هَلْ يَسْتوي الأعْمَى والبَصِير أفَلا تَتَفَكرون } في سورة الأنعام ( 50 ) .والأنفس : جمع نفْس . والنفس يطلق على الذات كلها ، ويطلق على باطن الإنسان ، ومنه قوله تعالى حكاية عن عيسى عليه السلام : { تعْلَم مَا فِي نَفْسِي } \\[ المائدة : 116 \\] كقول عمر يوم السقيفة : «وكُنت زوّقت في نفسي مقالة» أي في عقلي وباطني .وحرف { في } من قوله { فِي أنْفُسهم } يجوز أن يكون للظرفية الحقيقية الاعتبارية فيكون ظرفاً لمصدر { يَتَفَكَرُّوا ، أي تفكراً مستقراً في أنفسهم . وموقع هذا الظرف مما قبله موقع معنى الصفة للتفكر . وإذ قد كان التفكر إنما يكون في النفس فذكر في أنفسهم لتقوية تصوير التفكر وهو كالصفة الكاشفة لتقرر معنى التفكر عند السامع ، كقوله { ولاَ تخطّهُ بِيَمِينك } \\[ العنكبوت : 48 \\] وقوله { ولاَ طَائِر يَطِير بِجَنَاحَيه } \\[ الأنعام : 38 \\] ، وتكون جملة { مَا خَلَقَ الله السَّمَاوات والأرْض } الخ على هذا مُبينة لجملة { يَتَفَكَرُّوا } إذ مدلولها هو ما يتفكرون فيه كقوله تعالى : { أمْ يَتَفَكَّروا ما بِصَاحبهم من جنة } \\[ الأعراف : 184 \\] .ويجوز أن يكون { في } للظرفية المجازية متعلقة بفعل { يَتَفكروا } تعلق المفعول بالفعل ، أي يتدبروا ويتأملوا في أنفسهم . والمراد بالأنفس الذوات فهو في معنى قوله تعالى { وفي أنْفُسكم أفَلا تُبْصِرون } \\[ الذاريات : 21 \\] ؛ فإن حق النظر المؤدّي إلى معرفة الوحدانية وتحقق البعث أن يبدأ بالنظر في أحوال خلقة الإنسان قال تعالى : { أفحسبتم أنما خلقناكم عبثاً وأنكم إلينا لا تُرجعون } \\[ المؤمنون : 115 \\] وهذا كقوله تعالى : { أو لم ينظروا في ملكوت السماوات والأرض } \\[ الأعراف : 185 \\] أي في دلالة ملكوت السماوات والأرض ، وتكون جملة { مَا خَلَق الله السماوَات والأرْض } الخ على هذا التفسير بدل اشتمال من قوله { أنْفُسهم } إذ الكلام على حذف مضاف ، تقديره : في دلالة أنفسهم ، فإن دلالة { أنفُسهم } تشتمل على دلالة خلق السماوات والأرض وما بينهما بالحق لأن { أنفُسهم } مشمولة لما في الأرض من الخلق ودالة على ما في الأرض ، وكذلك يطلق ما في الأرض دال على خلق أنفسهم .وعلى الاحتمالين وقع تعليق فعل { يَتَفَكَّروا } عن العمل في مفعولين لوجود النفي بعده .ومعنى { خلق السماوات والأرض وما بينهما إلا بالحق : أن خلقهم ملابسٌ للحق .والحق هنا هو ما يحق أن يكون حِكمة لِخلق السماوات والأرض وعلة له ، وحق كل ماهية ونوع هو ما يحق أن يتصرف به من الكمال في خصائصه وأنه به حقيق كما يقول الأب لابنه القائم ببره : أنت ابني حقاً ، ألا ترى أنهم جعلوا تعريف النكرة بلام الجنس دالاً على معنى الكمال في نحو : أنت الحبيب ، لأن اسم الجنس في المقام الخطابي يؤذن بكماله في صفاته ، وإنما يعرف حق كل نوع بالصفات التي بها قابليته ، ومن ينظر في القابليات التي أودعها الله تعالى في أنواع المخلوقات يجد كل الأنواع مخلوقة على حدود خاصة بها إذا هي بلغتها لا تقبل أكثر منها؛ فالفرس والبقرة والكلب الكائنات في العصور الخالية وإلى زمن آدم لا تتجاوز المتأخرة من أمثالها حدودها التي كانت عليها فهي في ذلك سواءٌ . دلت على ذلك تجارب الناس الحاضرين لأجيالها الحاضرة ، وأخبارُ الناس الماضين عن الأجيال المعاصرة لها ، وقياسُ ما كان قبل أزمان التاريخ على الأجيال التي انقرضت قبلها حاشا نوع الإنسان فإن الله فَطَره بقابلية للزيادة في كمالات غير محدودة على حسب أحواللِ تجدُّدِ الأجيال في الكمال والارتقاء وجعله السلطان على هذا العالم والمتصرف في أنواع مخلوقات عالَمِه كما قال { هو الذي خلق لكم ما في الأرض جميعاً } \\[ البقرة : 29 \\] وذلك بما أودع فيه من العقل . ودلت المشاهدة على تفاوت أفراد نوع الإنسان في كمال ما يصلح له تفاوتاً مترامي الأطراف ، كما قال البحتري :ولم أر أمثال الرجال تفاوتاً ... لدى الفضل حتى عُدّ ألف بواحدفدلت التجربة في المشاهدة كما دلت الأخبار عن الماضي وقياس ما قبل التاريخ على ما بعده ، كل ذلك دل على هذا المعنى ، ولأجل هذا التفاوت كلف الإنسان خالقُه بقوانين ليبلغ مرتقى الكمال القابل له في زمانه ، مع مراعاة ما يحيط به من أحوال زمانه ، وليتجنب إفساد نفسه وإفساد بني نوعه ، وقد كان ما أعطيه نوع الإنسان من شُعب العقل مخوِّلاً إياه أن يفعل على حسب إرادته وشهوته ، وأن يتوخّى الصواب أو أن لا يتوخّاه ، فلما كلفه خالقهُ باتباع قوانين شرائعه ارتكب واجتنب فالتحق تارة بمراقي كماله ، وقصَّر تارة عنها قصوراً متفاوتاً ، فكان من الحكمة أن لا يُهمَل مسترسلاً في خطوات القصور والفساد ، وذلك إما بتسليط قوة مُلْجِئَة عليه تستأصل المفسد وتستبقي المصلح ، وإما بإراضته على فعل الصلاح حتى يصير منساقاً إلى الصلاح باختياره المحمود ، إلا أن حكمة أخرى ربانية اقتضت بقاء عمران العالم وعدمَ استئصاله ، وبذلك تعطل استعمال القوة المستأصلة ، فتعين استعمال إراضته على الصلاح ، فجمع الله بين الحكمتين بأن جعل ثواباً للصالحين على قدر صلاحهم وعقاباً للمفسدين بمقدار عملهم ، واقعاً ذلك كلُّه في عالم غير هذا العالم ، وأبلغ ذلك إليهم على ألسنة رسله وأنبيائه إزالة للوصمة ، وتنبيهاً على الحكمة ، فخاف فريق ورجا فارتكب واجتنب ، وأعرض فريق ونأى فاجترح واكتسب ، وكانَ من حق آثار هاته الحِكم أن لا يُحرم الصالح من ثوابه ، وأن لا يفوتَ المفسد بمَا به ليظهر حق أهل الكمال ومَن دونهم من المراتب ، فجعل الله بقاء أفراد النوع في هذا العالم محدوداً بآجال معينة وجعل لبقاء هذا العالم كله أجلاً معيناً ، حتى إذا انتهت جميع الآجال جاء يوم الجزاء على الأعمال ، وتميز أهل النقص من أهل الكمال .فكان جَعْل الآجال لبقاء المخلوقات من جملة الحق الذي خُلقت ملابِسةً له ، ولذلك نُبّه عليه بخصوصه اهتماماً بشأنه ، وتنبيهاً على مكانه ، وإظهاراً أنه المقصدُ بكيانه ، فعطفه على الحق للاهتمام به ، كما عطف ضده على الباطل ، في قوله { أفحسبتم أنما خلقناكم عبثاً وأنكم إلينا لا ترجعون } \\[ المؤمنون : 115 \\] فقال { أو لم يتفكروا في أنفسهم ما خلق الله السماوات والأرض وما بينهما إلا بالحق وأجل مسمى .وقد مضى في سورة الأنعام ( 73 ) قوله { وهو الذي خلق السماوات والأرض بالحق ويوم يقول كن فيكون قوله الحق } الآية . وفائدة ذكر السماوات هنا أنّ في أحوال السماوات من شمسها وكواكبها وملائكتها ما هو من جملة الحق الذي خلقت ملابسة له ، أما ما وراء ذلك من أحوالها التي لا نَعرف نسبة تعلقها بهذا العالم ، فنَكِلُ أمره إلى الله ونقيسُ غائبه على الشاهد ، فنُوقنُ بأنه ما خُلق إلا بالحق كذلك . فشواهد حقيَّة البعث والجزاء بادية في دقائق خلق المخلوقات ، ولذلك أعقبه بقوله وإن كثيراً من الناس بلقاء ربهم لكافرون } ، وهذا كقوله تعالى { أفحسبتم أنما خلقناكم عبثاً وأنكم إلينا لا تُرجعون } \\[ المؤمنون : 115 \\] .والمسمَّى : المقدَّر . أطلقت التسمية على التقدير ، وقد تقدم عند قوله تعالى : { ونُقرّ في الأرحام ما نشاء إلى أجل مسمّى } في سورة الحج ( 5 ) . وعند قوله تعالى { ولولا أجل مسمّى لجاءهم العذاب } في سورة العنكبوت ( 53 ) . وجملة وإن كثيراً من الناس بلقاء ربهم لكافرون } تذييل .وتأكيده ب { إن } لتنزيل السامع منزلة من يشك في وجود من يجحد لقاء الله بعد هذا الدليل الذي مضى بَلْهَ أن يكون الكافرون به كثيراً . والمراد بالكثير هنا : مشركو أهل مكة وبقية مشركي العرب المنكرين للبعث ومن ماثلهم من الدهريين . ولم يعبر هنا ب { أكثر الناس } \\[ العنكبوت : 60 \\] لأن المثبتين للبعث كثيرون مثل أهل الكتاب والصابئة والمجوس والقبط .\n\n",
      "translations": [
        {
          "translation": "(Have they not) i.e. the disbelievers of Mecca (pondered upon themselves) among themselves? (Allah created not the heavens and the earth, and that which is between them) of created beings and marvels, (save with truth) save for the Truth and the establishment of commands and prohibitions and not merely for falsehood (and for a destined end) and for an appointed time in which there will be requital. (But truly many of mankind) i.e. the disbelievers of Mecca (are disbelievers in) deny (the meeting with their Lord) resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أو لم يتفكروا في أنفسهم ما خلق الله } سموات الغيوب السبعة وأرض البدن { وما بينهما } من القوى الطبيعية والملكوت الأرضية والروحانية\n والملكوت السماوية والصفات والأخلاق وغيرها إلا بالحكمة والعدل وظهور الحق في مظاهرهم بالصفات على حسب استعداد قبولها لتجلّيه { وأجلٍ مُسمى } هو غاية كمال كل منهم وفنائه في الله بمقتضى هوية استعداده الأول حتى يشهدوا بقدر استعدادهم وإلقاء الله فيهم بصفاته وذاته { وإنّ كثيراً من الناس بلقاء ربّهم لكافرون } لاحتجابهم عنه\n فيتوهمون أنه لا يكون إلا بالمقابلة الصورية في عالم آخر باندراج الهوية في الهوية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يقنعون بهذه المزخرفات الفانية الضالون الغافلون\n ويرضون أنفسهم بلذاتها الوهمية وشهواتها البهيمية { وَلَمْ يَتَفَكَّرُواْ } ويتدبروا في آلاء الله ونعمائه الفائضة على الترادف والتوالي في الآفاق على الصور العجيبة\n والهيئات الغريبة\n سيما { فِيۤ أَنفُسِهِمْ } التي هي أقرب الأشياء إليهم\n وأبدعها نظماً وتركيباً\n وأعجبها ظهوراً\n وأشملها تصرفاً\n وأكملها علماً ومعرفة\n وأعلاها شأناً\n وأوضحها برهاناً\n لذلك ما وسع الحق إلا فيها\n وما انعكس أوصافه وأسماؤه إلا منها\n واستحقت هي بخصوصها من بين مظاهره سبحانه لخلافته ونيابته\n ايطمئنون بهذه المزخرفات الزائلة الخسيسة\n ولم يعبروا منها إلى مبادئها التي هي الأوصاف الذاتية والأسماء الإلهية\n مع أنهم مجبولون على الجواز والعبرة بحسب أصل الفطرة ولم يعلموا\n ولم يفهموا أنه { مَّا خَلَقَ } وأظهر { ٱللَّهُ } الحكيم المتقن في جميع أفعاله { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: العلويات والسفليات { وَمَا بَيْنَهُمَآ } من البرازخ المتكونة من امتزاجاتهما واختلاطاتهما أثراً وأجزاءً { إِلاَّ } ملتبساً { بِٱلْحَقِّ } ومنتهياً إليه إعادةً وإبداءً\n لكنه قدر بقاءه وظهوره بوقت معين\n\n\n{ وَأَجَلٍ مُّسَمًّى } عنده\n وحين انقضائه انتهى إليه ورجع نحوه ما ظهر من الموجود\n وانتفى وفني ما لمع عليه نور الوجود\n وحينئذٍ لم يبق في فضاء الوجود إلا الواحد القهار للأظلال الأغيار { وَإِنَّ كَثِيراً مِّنَ ٱلنَّاسِ } المجبولين على الكفران والنسيان { بِلِقَآءِ رَبِّهِمْ } في النشأة الأخرى { لَكَافِرُونَ } [الروم: 8] منكرون جاحدون عتواً واستكباراً\n بسبب ما عندهم من حطام الدنيا ومزخرفاتها الفانية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" في أنفسهم \": يحتمل أن يكون ظرفاً، أي: أَوَ لمْ يحدثوا التفكر فيها، وأن تكون صلة للتفكر، نحو: تفكر في الأمر: أجال فيه فكره. والأول أظهر. يقول الحق جل جلاله: { أَوَ لَمْ يَتَفَكروا في أنفسهم } أي: أَوَ لَمْ يثبتوا التفكر في أنفسهم، أي: في قلوبهم الفارغة، فيتفكروا بها في مصنوعات الله، حتى يعلموا أنها ما خُلِقَتْ عبثاً، والتفكر لا يكون إلا في القلوب، ولكن زيادة تصوير لحال المتفكرين، كقوله: اعتقده في قلبك. أو: أَوَلَمْ يتفكروا في أنفسهم، التي هي أقرب إليهم من غيرها، وهم أعلم بأحوالها، فيتدبروا ما أودعها الله تعالى، ظاهراً وباطناً، من غرائب الحكمة الدالة على التدبير من الحكيم القديم، وأنه لا بد لها من الانتهاء إلى وقت تجازي فيه، على الإحسان إحساناً، وعلى الإساءة مثلها، حتى يعلموا، عند ذلك، أن سائر الخلائق مثلها، وأنه لا بُدَّ لهم من الانتهاء إلى ذلك الوقت، فعلموا أن { ما خَلَقَ الله السماواتِ والأرض وما بينهما إلا بالحقِ وأَجَلٍ مُّسَمىًّ } أي: ما خلقها باطلاً وعبثاً من غير حكمة، ولا لتبقى خالدة، وإنما خلقها مقرونة بالحق، مصحوبة بالحكمة البالغة، وتنتهي إلى أجل مسمى، وهو قيامُ الساعة، ووقت الحساب، بالثواب والعقاب، فيخرب هذا العالم، ويقوم عالم آخر، لا انتهاء لوجوده.  قال في الحاشية الفاسية: وبالجملة: فخلقُ السموات والأرض للدلالة على التوحيد بوجودهما، وعلى الآخرة بفنائهما، وانقضاء أجلهما. ثم قال: والحاصل أن خلقه بمقتضى الحكمة يقتضي جزاء أوليائه، وتعذيب أعدائه. وقد نصب تعالى القلب شاهداً ومُنزلاً منزلة الآخرة، والقلب منزلة الدنيا، وكما أن عمل القالب يعود نفعه، إذا فعل الطاعة، على القلب بالتنوير والتقريب لحضرة الربوبية، ويعود ضرره عليه، إذا فعل ضد ذلك، كما يعرفه أهل القلوب، وأنه مزرعة للقلب، ولا بقاء له، وإنما خلق لقضاء ذلك، فكذلك الدنيا مزرعة للآخرة، وإنما خلقت لذلك، كما يعرفه أهل القلوب والبصائر الصافية السالمة، فاعتبر ذلك. هـ. { وإن كثيراً من الناس بلقاء ربهم } بالبعث والجزاء { لكافرون }: لجاحدون. الإشارة: قد تقدم الكلام على فضل التفكر في آل عمران. وقوله تعالى: { إلا بالحق } أي: ما خلق الكائنات إلا بالحق، من الحق إلى الحق، فهي من تجليات الحق، ثابتة بإثباته، ممحوة بأحدية ذاته، فالحق عبارة عن عين الذات عند أهل الحق، فافهم. ثم قال زيادةً في الأمر، بالاعتبار أو تقول: لما ذكر عمهم بظاهر الحياة الدنيا ذكر أن من قبلهم كانوا أعلم بها ولم ينفعهم مع التكذيب، فقال: { أَوَلَمْ يَسيرُواْ فِي ٱلأَرْضِ... }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:184",
      "similarity": 0.6111005943417286
    },
    {
      "verse": "74:18",
      "similarity": 0.5886606453412977
    },
    {
      "verse": "45:13",
      "similarity": 0.5499376317593229
    },
    {
      "verse": "30:21",
      "similarity": 0.499430020044281
    },
    {
      "verse": "46:3",
      "similarity": 0.43107984881043904
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}