{
  "chapter": "الروم",
  "text": "اولم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم كانوا۟ اشد منهم قوة واثاروا۟ الارض وعمروها اكثر مما عمروها وجاءتهم رسلهم بالبينت فما كان الله ليظلمهم ولكن كانوا۟ انفسهم يظلمون",
  "translations": [
    {
      "translation": "Have they not travelled in the earth and seen the final fate of those before them? They had greater strength than them and cultivated the land and inhabited it in far greater numbers than they do. Their wronged themselves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled on the earth and seen how the others before them had met their end? They were far more powerful than them, furrowed the earth and colonised it far more than they; and their apostles came to them with visible signs. It was surely not for God to wrong them, they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the earth that they may observe what was the end of their predecessors who were far mightier and tilled the land and built upon it more than these have ever built? And Allah's Messengers came to them with Clear Signs. It was not Allah Who wronged them, but it is they who wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land to see how terrible was the end of the people who lived before them. The people who lived before them were stronger than them in might, in tilling, and in developing the earth. Our Messengers came to them with clear miracles. God did not do an injustice to them but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And did they not travel in the land to see what sort of fate befell those before them? They were stronger than them, and they cultivated the land and inhabited it more than them, and their Noble Messengers came to them with clear proofs; so it did not befit Allah’s Majesty to oppress them, but it was they who used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the earth and observed how was the end of those before them? They were greater than them in power, and they plowed the earth and built it up more than they have built it up, and their messengers came to them with clear evidences. And Allah would not ever have wronged them, but they were wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the earth and seen how was the end of those before them? They were stronger than these in prowess, and dug up the earth, and built on it in greater abundance than these have built on it, and there came to them their apostles with clear arguments; so it was not beseeming for Allah that He should deal with them unjustly, but they dealt unjustly with their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not journeyed in the land and beheld how was the end of those before them? They were stronger than themselves in might, and they ploughed up the earth and cultivated it more than they themselves have cultivated it; and their Messengers came to them with the clear signs; and God would never wrong them, but themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land and seen the nature of the consequence for those who were before them? They were stronger than these in power, and they dug the earth and built upon it more than these have built. Messengers of their own came unto them with clear proofs (of Allah's Sovereignty). Surely Allah wronged them not, but they did wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land and seen what end their predecessors met? They were mightier than them: they cultivated the earth more and built more upon it than these have ever built. Their own messengers also came to them with clear signs: God did not wrong them; they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the land and observed what wise hath been the end of those before them? They were stronger than they in power and they brake up the earth and they inhabited it with greater affluence than these have inhabited it, and their apostles came unto them with evidences. And Allah was not one to wrong them, but themselves they were wont to wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land and seen how was the fate of those who were before them? They were more powerful than them, and they plowed the earth and developed it more than they have developed it. Their apostles brought them manifest proofs. So it was not Allah who wronged them, but it was they who used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not travel through the earth, and see what was the end of those before them? They were superior to them in strength: they tilled the soil and populated it in greater numbers than these have done: there came to them their messengers with Clear (Signs). (Which they rejected, to their own destruction): It was not Allah Who wronged them, but they wronged their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not travel in the land, and see what was the end of those before them? They were superior to them in strength, and they tilled the earth and populated it in greater numbers than these (pagans) have done, and there came to them their Messengers with clear proofs. Surely, Allah wronged them not, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they never journeyed in the land and seen what was the end of those before them? They were stronger in might than themselves, and they plowed the land and cultivated it more than they themselves have cultivated it. And to them, their Messengers came with clear signs, and Allah did not wrong them, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled the earth and seen how those before them ended up? They were more powerful than them, and they cultivated the land and developed it more than they developed it, and their messengers came to them with clear signs. God would never wrong them, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the earth and observed how was the end of those before them? They were greater than them in power, and they plowed the earth and built it up more than they have built it up, and their messengers came to them with clear evidences. And Allah would not ever have wronged them, but they were wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[30:9] Have they not travelled in the land and beheld how was the consequence for those before them?, of [past] communities, which was that they were destroyed for denying their messengers. They were more powerful than them — such were ‘Ād and Thamūd — and they effected the land, they tilled it and churned it up to   sow crops and cultivate [trees], and developed it more than these, the Meccan disbelievers, have developed it; and their messengers brought them clear signs, manifest proofs, for God would never wrong them, by destroying them without being guilty, but they used to wrong themselves, by denying their messengers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ كَانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثَارُوا الْأَرْضَ وَعَمَرُوهَا أَكْثَرَ مِمَّا عَمَرُوهَا وَجَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ (9){ .عطف على جملة { أوْ لم يَتَفكروا في أنْفُسهم } \\[ الروم : 8 \\] وهو مثل الذي عطف هو عليه متصل بما يتضمنه قوله { ولكن أكثر الناس لا يعلمون } \\[ الروم : 6 \\] أن من أسباب عدم علمهم تكذيبهم الرسول عليه الصلاة والسلام الذي أنبأهم بالبعث ، فلما سيق إليهم دليل حكمة البعث والجزاء بالحق أعقب بإنذارهم موعظة لهم بعواقب الأمم الذين كذبوا رسلهم لأن المقصود هو عاقبة تكذيبهم رسل الله وهو قوله { وجاءتهم رسلهم بالبينات فما كان الله ليظلمهم } الآية .والأمر بالسير في الأرض تقدم في قوله تعالى : { قُلْ سيروا في الأرْض ثم انظروا كيفَ كَانَ عَاقِبَة المكذبِين } في سورة الأنعام ( 11 ) ، وقوله : { قل سيروا في الأرض فانظروا كيف بدأ الخلق } في سورة العنكبوت ( 20 ) .والاستفهام في { أوَلَم يسيروا } تقريري . وجاء التقرير على النفي للوجه الذي ذكرناه في قوله تعالى : { ألم يروا أنه لا يكلمهم } \\[ الأعراف : 148 \\] وقوله { ألم يأتكم رسل منكم } في الأنعام ( 130 ) ، وقوله { أليس في جهنم مثوىً للكافرين } في آخر العنكبوت ( 68 ) .والأرض : اسم للكرة التي عليها الناس .والنظر : هنا نظر العين لأن قريشاً كانوا يمرّون في أسفارهم إلى الشام على ديار ثمود وقوم لوط وفي أسفارهم إلى اليمن على ديار عاد . وكيفية العاقبة هي حالة آخر أمرهم من خراب بلادهم وانقطاع أعقابهم فعاضد دلالة التفكر التي في قوله { أولم يتفكروا في أنفسهم } \\[ الروم : 8 \\] الآية بدلالة الحس بقوله : { فينظروا كيف كان عاقبة الذين من قبلهم . وكيف } استفهام معلِّق فعل { ينظروا } عن مفعوله ، فكأنه قيل : فينظروا ثم استؤنف فقيل : كيف كان عاقبة الذين من قبلهم .والعاقبة : آخر الأمر من الخير والشرّ ، بخلاف العُقبى فهي للخير خاصة إلا في مقام المشاكلة ، وتقدم ذكر العاقبة في قوله { والعَاقِبَةُ لِلمُتَّقين } في الأعراف ( 128 ) . وقد جمع قوله { فينظروا كيف كان عاقبة الذين من قبلهم } وعيداً على تكذيبهم النبي صلى الله عليه وسلم وتجهيلاً لإحالتهم الممكنَ ، حيث أيقنوا بأن الفرس لا يُغلَبون بعد انتصارهم . فهذه آثار أمم عظيمة كانت سائدة على الأرض فزال ملكهم وخلت بلادهم من سبب تغلب أمم أخرى عليهم .والمراد بالذين من قبلهم : عاد وثمود وقوم لوط وأمثالهم الذين شاهد العرب آثارهم . والمعنى : أنهم كانوا من قبلهم في مثل حالتهم من الشرك وتكذيب الرسل المرسلين إليهم ، كما دل عليه قوله عقبه { كانوا أشد منهم قوة } الآية . > > { مِن قَبْلِهِمْ كانوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثَارُواْ الارض وَعَمَرُوهَآ أَكْثَرَ مِمَّا عَمَرُوهَا وَجَآءَتْهُمْ رُسُلُهُم بالبينات فَمَا كَانَ الله لِيَظْلِمَهُمْ ولكن كانوا }كل أولئك كانوا أشد قوة من قريش وأكثر تعميراً في الأرض ، وكلهم جاءتهم رسل ، وكلهم كانت عاقبتهم الاستئصال ، كل هذه ما تُقرّ به قريش .وجملة { كانوا أشد منهم قوة } بيان لجملة { كيف كان عاقبة الذين من قبلهم } .والشدة : صلابة جسم ، وتستعار بكثرة لقوة صفة من الأوصاف في شيء تشبيهاً لكمال الوصف وتمامه بالصلابة في عسر التحول .وتقدم في قوله : { وأولوا بأس شديد } في سورة النمل ( 33 ) .والقوة : حالة بها يقاوم صاحبها ما يوجب انخرامه ، فمن ذلك قوة البدن ، وقوة الخشب ، وتستعار القوة لما به تُدفع العادية وتستقيم الحالة؛ فهي مجموع صفات يكون بها بقاء الشيء على أكمل أحواله كما في قوله : { نحن أولوا قوة } \\[ النمل : 33 \\] فقوة الأمة مجموع ما به تدفع العوادي عن كِيانها وتستبقي صلاح أحوالها من عُدد حربيّة وأموال وأبناء وأزواج . وحالة مشركي قريش لا تداني أحوال تلك الأمم في القوة ، وناهيك بعاد فقد كانوا مضرب الأمثال في القوة في سائر أمورهم ، والعرب تصف الشيء العظيم في جنسه بأنه عاديُّ نسبةً إلى عاد .وعطف { أثاروا } على { كانوا } فهو فعل مشتق من الإثارة بكسر الهمزة ، وهي تحريك أجزاء الشيء ، فالإثارة : رفع الشيء المستقر وقَلْبُه بعد استقراره ، قال تعالى : { الله الذي يرسل الرياح فتُثير سحاباً } \\[ الروم : 48 \\] أي : تسوقه وتدفعه من مكان إلى مكان . وأطلقت الإثارة هنا على قلب تراب الأرض بجعل ما كان باطناً ظاهراً وهو الحرث ، قال تعالى : { لا ذلول تثير الأرض } \\[ البقرة : 71 \\] ، وقال النابغة يصف بقر الوحش إذا حفرت التراب :يُثرنَ الحصى حتى يباشرن بَرده ... إذا الشمس مجّت ريقها بالكلاكلويجوز أن يكون { أثاروا } هنا تمثيلاً لحال شدة تصرفهم في الأرض وتغلبهم على من سواهم بحال من يثير ساكناً ويهيجه ، ومنه أطلقت الثورة على الخروج عن الجماعة . وهذا الاحتمال أنسب بالمقصود الذي هو وصف الأمم بالقوة والمقدرة من احتمال أن تكون الإثارة بمعنى حرث الأرض لأنه يدخل في العمارة . وضمير { أثاروا } عائد إلى ما عاد إليه ضمير { كانوا أشد } .ومعنى عمارة الأرض : جعلها عامرة غير خلاء وذلك بالبناء والغرس والزرع . يقال : ضيعة عامرة ، أي : معمورة بما تعمر به الضياع ، ويقال في ضده : ضيعة غامرة . ولكون قريش لم تكن لهم إثارة في الأرض بكلا المعنيين إذ كانوا بِواد غير ذي زرع لم يقل في هذا الجانب : أكثر مما أثاروها .وضميرا جمع المذكر في قوله : { وعمروها أكثر مما عمروها } راجع أولهما إلى ما رجع إليه ضمير { أثاروا } وثانيهما إلى ما رجع إليه ضمير يسيروا في الأرض . ويعرف توزيع الضميرين بالقرينة مثل توزيع الإشارة في قوله تعالى : { هذا من شِيعتِه وهذا من عدوِّه } في سورة \\[ القصص : 15 \\] كالضميرين في قول عباس بن مرداس يذكر قتال هوازن يوم حُنين :عُدنا ولولا نحن أحدقَ جمعُهم ... بالمسلمين وأحرزوا ما جمَّعواوتقدم تفصيله عند قوله تعالى : { فبذلك فليفرحوا هو خير مما يجمعون } في سورة يونس ( 58 ) ، أي عمر الذين من قبلهم الأرض أكثر مما عمرها هؤلاء ، فإن لقريش عمارة في الأرض من غرس قليل وبناء وتفجير ولكنه يتضاءل أمام عمارة الأمم السالفة من عاد وثمود .وتفريع فما كان الله ليظلمهم } على قوله { وجاءتهم رسلهم بالبينات } إيجاز حذف بديع ، لأن مجيء الرسل بالبينات يقتضي تصديقاً وتكذيباً فلما فرع عليه أنهم ظلموا أنفسهم عُلم أنهم كذَّبوا الرسل وأن الله جازاهم على تكذيبهم رسله بأن عاقبهم عقاباً لو كان لغير جرم لشابه الظلم ، فجعل من مجموع نفي ظلم الله إياهم ومن إثبات ظلمهم أنفسَهم معرفة أنهم كذَّبوا الرسل وعاندوهم وحلّ بهم ما هو معلوم من مشاهدة ديارهم وتناقل أخبارهم .والاستدراك ناشىء على ما يقتضيه نفي ظلم الله إياهم من أنهم عوملوا معاملة سيئة لو لم يستحقوها لكانت معاملة ظلم . وعبر عن ظلمهم أنفسهم بصيغة المضارع للدلالة على استمرار ظلمهم وتكرره وأن الله أمهلهم فلم يقلعوا حتى أخذهم بما دلت عليه تلك العاقبة ، والقرينة قوله { كانوا } .وتقديم { أنفسهم } وهو مفعول { يظلمون } على فعله للاهتمام بأنفسهم في تسليط ظلمهم عليها لأنه ظلم يتعجب منه ، مع ما فيه من الرعاية على الفاصلة . وليس تقديم المفعول هنا للحصر لأن الحصر حاصل من جملتي النفي والإثبات .\n\n",
      "translations": [
        {
          "translation": "(Have they not travelled) i.e. the disbelievers of Mecca (in the land and seen) and reflect upon (the nature of the consequence for) the requital of (those who were before them) when they disbelieved in their messengers? (They were stronger than these in power) in physical strength, (and they dug the earth) for agriculture more than the people of Mecca did; it is also said that this means: they travelled more for their trade (and built upon it) and lived in their buildings (more than these have built) more than the period in which the people of Mecca lived in their buildings. (Messengers of their own came unto them with clear proofs (of Allah's Sovereignty)) with commands, prohibitions and signs but they disbelieved and Allah, Exalted is He, destroyed them because of their disbelief. (Surely Allah wronged them not) when He destroyed them, (but they did wrong themselves) through their disbelief, idolatry and denial of the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَثَارُواْ ٱلأَرْضَ } معناه استخرجُوها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And they set out the earth\" - its meaning is that they extracted it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَلَمْ يَسيرُواْ } أولئك المسرفون المفرطون { فِي } أقطار { ٱلأَرْضِ فَيَنظُرُواْ } بنظرة العبرة { كَيْفَ كَانَ عَاقِبَةُ } أمر المسرفين { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } كعاد وثمود\n مع أنهم { كَانُوۤاْ أَشَدَّ مِنْهُمْ قُوَّةً } لدلالة أظلالهم وآثارهم على تمكنهم { وَ } من دلائل قوتهم أنهم { أَثَارُواْ ٱلأَرْضَ } وقلبوها للمعادن وإخراج العيون\n وإجراء الأنهار\n وإحداث الزروع وغير ذلك { وَ } بالجملة: { عَمَرُوهَآ } أولئك فيمامضى { أَكْثَرَ مِمَّا عَمَرُوهَا } هؤلاء اليوم\n فدل زيادة عمارتهم على ازدياد قوتهم وتمكنهم\n\n\n{ وَ } بعدما أفسدوا على أنفسهم بأنواع الفسادات مباهياً بمالهم وجاههم\n قلبنا عليهم أمرهم بأن أرسلنا إليهم رسلاً مؤيدين بأنواع المعجزات\n فلما { جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَاتِ } القاطعة والبراهني الساطعة\n فلجأوا على تكذيبهم وإنكارهم بلا تأمل وتدبر فيما جاءوا به\n فأخذناهم أخذ عزيز مقتدر\n فاستأصلناهم وقلبنا عليهم أماكنهم\n وخرجنا بلادهم ومزارعهم { فَمَا كَانَ ٱللَّهُ } العزيز المتقدر الحكيم المتقن { لِيَظْلِمَهُمْ } أي: يفعل بهم فعل الظلمة بأخذهم وبطشهم بلا جرم صدر عنهم موجب لانتقامهم { وَلَـٰكِن كَانُوۤاْ أَنفُسَهُمْ يَظْلِمُونَ } [الروم: 9] أي: يظلمون أنفسهم بعتوهم واستكبارهم على ضعفاء عباد الله\n تكذيب خلَص أنبيائه وأوليائه\n وخروجهم عن مقتضى حدوده سبحانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من رفع \" عاقبة الذين أساءوا \" فالسوأى منصوب خبر كان\n ومن نصب \" عاقبة \" فالسُّوأى: مرفوع اسمها\n أو: مصدر لأساؤوا\n انظر البيضاوي\n والسُّوأى: تأنيث أسوأ\n وأن كذبوا: مفعول من أجله\n أو: بدل\n على أن معنى أساءوا: كفروا\n يقول الحق جل جلاله: { أوَ لَمْ يَسيروا } اي: أَعَمُوا ولم يسيروا { في الأرض } \n ثم قرره بقوله: { فينظروا كيف كان عاقبةُ الذين من قبلهم } أي: فينظروا إلى آثار الذين من قبلهم كيف دمرهم الله\n وأخلا بلادهم\n وبقيت دارسة بعدهم\n كعاد وثمود\n وغيرهم من الأمم العاتية\n والجبابرة الطاغية\n { كانوا أشدَّ منهم قوةً } حتى كان منهم من يفتل الحديد بيده\n { وأثاروا الأرض } قلبوا وجهها بالحراثة\n واستنباط المياه\n واستخراج المعادن\n وغير ذلك\n { وعَمَروها } اي: عمرَ المدمَّرون الأرض { أكثرَ مما عَمَروها } أي: أهل مكة\n فأكثر: صفة لمصدر محذوف\n وما: مصدرية\n أي: عمارة هؤلاء\n فإنهم أهل واد غير ذي زرع\n ولا تَبَسُّطَ لهم في غيرها\n وفيه تهكم بهم من حيث أنهم عمروا الأرض\n مغترون بالدنيا\n مفتخرون بها\n وهو أضعف حالاً فيها إذ مدار أمرها على التبسّط في البلاد\n والتسلط على العباد\n والتصرف في أقطار الأرض بأنواع العمارة\n وهم ضعفاء مُلْجؤونَ إلى واد لا نفع فيه\n قال البيضاوي\n { وجاءتهم رسلُهم بالبينات } بالمعجزات الواضحات\n فلم يؤمنوا فأُهلِكوا\n { فما كان الله ليظلمهم } بأن دمرهم بلا سبب\n أو: من غير إعذار\n { ولكن كانوا أنفسهم يظلمون } حيث ارتكبوا ما أدى إلى تدميرهم\n { ثم كان عاقبةُ الذي أساءوا } بالكفر والمعاصي { السُّوأى } أي: العقوبة السوأى\n والأصل: ثم كان عاقبتهم\n فوضع الظاهر موضع المضمر للدلالة على ما اقتضى أن تكون تلك عاقبتهم\n وهو إساءتهم\n والمعنى: أنهم عوقبوا في الدنيا بالدمار\n ثم كان عاقبتهم في الآخرة العقوبة التي هي أسوأ العقوبات\n وهي النار التي أُعدت للكافرين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:9",
      "similarity": 0.45382250277901154
    },
    {
      "verse": "35:44",
      "similarity": 0.4267960926527648
    },
    {
      "verse": "40:82",
      "similarity": 0.42331426997242705
    },
    {
      "verse": "40:21",
      "similarity": 0.4095266814057218
    },
    {
      "verse": "30:42",
      "similarity": 0.3545031913711393
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/030009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/030009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/30:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}