{
  "chapter": "لقمان",
  "text": "خلق السموت بغير عمد ترونها والقى فى الارض روسى ان تميد بكم وبث فيها من كل دابة وانزلنا من السماء ماء فانۢبتنا فيها من كل زوج كريم",
  "translations": [
    {
      "translation": "It is Allah Who created the heavens with no support - you can see them - and cast firmly embedded And We send down water from the sky and make every generous species grow in it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the skies without a support, as you can see, and placed stabilisers in the earth that you may dwell at ease as it revolves; and dispersed on it all varieties of creatures, and He sent down water from the skies and grew all kinds of splendid things upon it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without any pillars visible to you and He placed mountains in the earth as pegs lest it should turn topsy turvy with you, and He dispersed all kinds of animals over the earth, and sent down water from the sky causing all kinds of excellent plants to grow on it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens without pillar as you can see, fixed the mountains on earth so that it may not shake you away, and settled therein all types of living creatures. We have sent down water from the sky and made all kinds of plants grow in gracious pairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without any supports visible to you, and cast mountains as anchors into the earth so that it may not shake with you, and spread all kinds of beasts in it; and We sent down water from the sky so thereby grew all kinds of refined pairs in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens without any pillars that you see, and has set on the earth firm mountains lest it should shake with you. And He has scattered therein moving creatures of all kinds. And We send down water from the sky, and We cause (plants) of every goodly kind to grow therein in pairs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without pillars as you see them, and put mountains upon the earth lest it might convulse with you, and He spread in it animals of every kind; and We sent down water from the cloud, then caused to grow therein (vegetation) of every noble kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without pillars you can see, and He cast on the earth firm mountains, lest it shake with you, and He scattered abroad in it all manner of crawling thing. And We sent down out of heaven water, and caused to grow in it of every generous kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens without supports that ye can see, and hath cast into the earth firm hills, so that it quake not with you; and He hath dispersed therein all kinds of beasts. And We send down water from the sky and We cause (plants) of every goodly kind to grow therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the skies without any support that you could see, and has placed firm mountains upon the earth, lest it sway with you, and has caused all manner of living creatures to multiply thereon. And We sent down water from the skies, and thus We made every kind of excellent plant grow there:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens that ye behold without pillars and hath cast Into the earth firm mountains lest it move away with you; and He hath scattered thereon every kind of animal. And We send down water from the heaven and We make grow every kind of goodly growth therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without any pillars that you may see, and cast firm mountains in the earth lest it should shake with you, and He has scattered in it every kind of animal. And We sent down water from the sky and caused every splendid kind [of plant] to grow in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without any pillars that ye can see; He set on the earth mountains standing firm, lest it should shake with you; and He scattered through it beasts of all kinds. We send down rain from the sky, and produce on the earth every kind of noble creature, in pairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens without any pillars, that you see and has set on the earth firm mountains, lest it should shake with you. And He has scattered therein moving (living) creatures of all kinds. And We send down water (rain) from the sky, and We cause (plants) of every goodly kind to grow therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without pillars that you see and cast on the earth firm mountains lest it should shake with you. Upon it He dispersed all manner of crawling thing, and He sent down water from the sky with which He caused to grow in it every generous kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without pillars that you can see, and placed stabilizers on earth lest it shifts with you, and scattered throughout it all kinds of creatures. And from the sky We sent down water, and caused to grow therein of every noble pair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens without pillars that you see and has cast into the earth firmly set mountains, lest it should shift with you, and dispersed therein from every creature. And We sent down rain from the sky and made grow therein [plants] of every noble kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:10] He created the heavens without any pillars that you can see (‘amad is the plural of ‘imād, which is an ustuwāna, ‘a column’) — this is the truth since there are no actual pillars — and cast high mountains into the earth, lest it shake with you, and He dispersed therein all kinds beasts. And We sent down (there is a shift from the third [to the second] person) water from the heaven and We caused to grow in it of every splendid kind, [every] fair specimen.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nخَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا وَأَلْقَى فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ (10) استئناف للاستدلال على الذين دأبهم الإعراض عن آيات الله بأن الله هو خالق المخلوقات فلا يستحق غيرهُ أن تثبت له الإلهية فكان ادعاء الإلهية لغير الله هو العلة للإعْراض عن آيات الكتاب الحكيم ، فهم لما أثبتوا الإلهية لما لا يخلق شيئاً كانوا كمن يزعم أن الأصنام مماثلة لله تعالى في أوصافه فذلك يقتضي انتفاء وصف الحكمة عنه كما هو منتف عنها . ولذا فإن موقع هذه الآيات موقع دليل الدليل ، وهو المقام المعبر عنه في علم الاستدلال بالتدقيق ، وهو ذكر الشيء بدليله ودليل دليله ، فالخطاب في قوله { ترونها } و { بكم } للمشركين ، وقد تقدم في سورة الرعد ( 2 ) قوله : { الله الذي رفع السماوات بغير عمد ترونها } وتقدم في أول سورة النحل ( 15 ) قوله { وألقى في الأرض رواسيَ أن تَميدَ بكم } والمعنى خوفَ أن تميد بكم أو لئلا تُميدكم كما بين هنالك . وتقدم في سورة البقرة ( 164 ) قوله : { وبثّ فيها من كل دابّة وتصريف الرياح } وقوله { أنزلنا من السماء ماء } وهو نظير قوله في سورة البقرة ( 164 ) { وما أنزل الله من السماء من ماء } وقوله في سورة الرعد ( 17 ) { أنزل من السماء ماء فسالتْ أوْديَةٌ } والالتفات من الغيبة إلى التكلم في قوله وأنزلنا } للاهتمام بهذه النعمة التي هي أكثر دوراناً عند الناس . وضمير { فيها } عائد إلى الأرض .والزوج : الصنف ، وتقدم في قوله تعالى { فأخرجنا به أزواجاً من نبات شتى } في طه ( 53 ) وقوله { وأنبتت من كل زوج بَهيج } في سورة الحج ( 5 ) .والكريم : النفيس في نوعه ، وتقدم عند قوله تعالى { إنِّي ألقِيَ إليَّ كتابٌ كريم } في سورة النمل ( 29 ) .وقد أدمج في أثناء دلائل صفة الحكمة الامتنان بما في ذلك من منافع للخلق بقوله أن تميد بكم وبَث فيها من كل دابة } فإن من الدواب المبثوثة ما ينتفع به الناس من أكل لحوم أوانسها ووحوشها والانتفاع بألبانها وأصوافها وجلودها وقرونها وأسنانها والحمل عليها والتجمل بها في مرابطها وغدوّها ورواحها ، ثم من نعمة منافع النبات من الحب والثمَر والكلأ والكمأة . وإذ كانت البحار من جملة الأرض فقد شملَ الانتفاع بدواب البحر فالله كما أبدع الصنع أسبغ النعمة فأرانا آثار الحكمة والرحمة .\n\n",
      "translations": [
        {
          "translation": "(He hath created the heavens without supports that ye can see) it is also said that this means: He created the heavens with supports that you cannot see, (and hath cast into the earth) and created in the earth (firm hills) firm mountains as supports for it, (so that it quake not with you; and He hath dispersed therein) He created and spread in the earth (all kinds of beasts) possessed of spirits. (And We send down water) rain (from the sky and We cause (plants) of every goodly kind to grow therein) in the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَن تَمِيدَ بِكُمْ } معناه تُحرَّكَ بِكُم يميناً وشمالاً\n\n\n\n\nوقوله تعالى: { وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍ } معناه فَرَّقَ فِيها\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {may He cause you to increase} means that He will move you [to the right and to the left].\n\n\nAnd His statement, \"He has dispersed throughout it [the earth]\" - this means that He has divided it up.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n كراهة { أَن تَمِيدَ بِكُمْ } وتميل عليكم وقت ترددكم وتحرككم عليها { وَبَثَّ فِيهَا } أي: بسط عليها\n ونشر { مِن كُلِّ دَآبَّةٍ } تتحرك عليها متبادلة متقابلة كيف اتفق\n لتستقر وتتمكن\n لأن طبيعتها في حد ذاتها كانت على الحركة والاضطراب\n إذ هي محفوفة بالماء السائل المجبول على الحركة والسيلان\n وبالهواء المتموج بالطبع\n وبالنار المضطربة\n وبالأفلاك المتحركة بطبقاتها { وَ } بعدما شهدناها وألقينا عليها من الرواسي العظام تتميماً لتقريرها { أَنزَلْنَا مِنَ } جانب { ٱلسَّمَآءِ مَآءً } مستحدثاُ من الأبخرة والأدخنة المتصاعدة المتراكمة\n المتسحيلة بالماء بمجاورة الكرة الزمهريرية { فَأَنْبَتْنَا } وأخرجنا بإنزال الماء عليها { فِيهَا } أي: في الأرض المنبسطة اليابسة بالطبع { مِن كُلِّ زَوْجٍ } صنف من النبات مزدوج مع شاكلته { كَرِيمٍ } [لقمان: 10] كثير المنافع الفوائد\n مصلح للأمزجة\n قموم لها\n لتعيشوا عيلها مترفيهن متنعمين\n شاكرين لنعمنا\n غير كافرين بمقتضى جودنا وكرمنا\n\n\nثمَّ قال سبحانه من مقام العظمة والكبرياء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" بغير عمد \": يتعلق بحال محذوفه\n أي: مُمْسَكَةً أو مرفوعة بغير عمد\n وعمد: اسم جمع على المشهور\n وقيل: جمع عماد أو عامد\n وجملة ترونها: إما استئنافية\n لا محل لها\n أو صفة لعمد\n يقول الحق جل جلاله: { خلق السماواتِ } ورفعها { بغير عَمَدٍ ترونها } \n الضمير: إما للسموات\n أي: خلقها\n ظاهرة ترونها\n أو لعمد\n أي: بغير عمد مرئية بل بعمد خفية\n وهي إمساكها بقدرته تعالى\n { وألقى في الأرض رواسي } أي: جبالاً ثوابت\n كراهة { أن تميد بكم } أي: لئلا تضطرب بكم\n { وبثَّ }: نشر { فيها من كل دابةٍ وأنزلنا من السماء ماء فأنبتنا فيها من كل زوجٍ كريمٍ } صنف من أصناف النبات\n { كريم }: حسن بهيج\n أو كثير المنفعة\n وكأنه استدل بذلك على عزته\n التي هي كمال القدرة\n وحكمته التي هي كمال العلم\n فهي مقررة لقوله: العزيز الحكيم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:15",
      "similarity": 0.5536156390068417
    },
    {
      "verse": "21:31",
      "similarity": 0.41121364765488483
    },
    {
      "verse": "42:29",
      "similarity": 0.3882411436290235
    },
    {
      "verse": "45:4",
      "similarity": 0.3722919655718271
    },
    {
      "verse": "5:112",
      "similarity": 0.37195084719534943
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}