{
  "chapter": "لقمان",
  "text": "هذا خلق الله فارونى ماذا خلق الذين من دونه بل الظلمون فى ضلل مبين",
  "translations": [
    {
      "translation": "This is Allah's creation. Show me then what those besides Him have created! The wrongdoers are clearly",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God's creation. Show me now what those (they worship) beside Him have created. Surely the evil-doers are in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah's creation. Show me, then, what any others, apart from Allah, have created. Nay, the fact is that the wrong-doers are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the creation of God. Show me what those whom you consider equal to God have created. In fact, the unjust ones are in plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has created this – therefore show me what has been created by those other than Him; in fact the unjust are in open error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the creation of Allah. So, show Me that which those besides Him have created. Nay, the wrongdoers are in plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Allah's creation, but show Me what those besides Him have created. Nay, the unjust are in manifest error\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is God's creation; now show me what those have created that are apart from Him! Nay, but the evildoers are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Creation of Allah. Now show me that which those (ye worship) beside Him have created. Nay, but the wrong-doers are in error manifest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "this is God's creation. Show me then what those besides Him have created! The wrongdoers are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the creation of Allah; shew that which those beside Him me have created. Aye! the wrong-doers are in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the creation of Allah. Now show Me what others besides Him have created. Indeed, the wrongdoers are in manifest error!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Creation of Allah: now show Me what is there that others besides Him have created: nay, but the Transgressors are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the creation of Allah. So show Me that which those (whom you worship), besides Him have created. Nay, the Zalimun (polytheists, wrong-doers and those who do not believe in the Oneness of Allah) are in plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the creation of Allah; now show me what, other than Him, created! No, the harmdoers are in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God’s creation. Now show me what those besides Him have created. In fact, the wicked are in obvious error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the creation of Allah. So show Me what those other than Him have created. Rather, the wrongdoers are in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:11] This is God’s creation, in other words, what is created by Him. Now show me, inform me, O people of Mecca, what those [you worship] besides Him, [those] other than Him, have created, namely, your gods, so that you have associated them with Him, exalted be He (mā is an interrogative of denial and a subject; dhā has the significance of alladhī, and what follows it of the relative clause is the predicate [of the subject mā]; arūnī glosses ‘the action’, and what follows it stands in place of two direct objects). Nay (bal, is for transition) but the evildoers are in manifest error, [error] that is evident because of their ascribing partners to God: and you are like them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This is the Creation of Allah) this is the creation which I have created. (Now show me that which those (ye worship) beside Him) i.e. the idols (have created. Nay, but the wrong-doers) the idolaters (are in error manifest) in manifest error!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكمال المجد والبهاء على سبيل الإسكات والتبكيت لمن أشرك معه غيره عناداً ومكابرةً: { هَـٰذَا } الذي سمعتم أيها المجبولون على السمع والإصغاء { خَلْقُ ٱللَّهِ } القادر المقتدر ذي الحول والقوة الغالبة\n والطول العظيم { فَأَرُونِي } أيها المشركون المسرفون\n المفرطون في دعوى الشرك معه سبحانه { مَاذَا خَلَقَ } أي: أيّ شيء أظهر وأوجد الشركاء { ٱلَّذِينَ } تعبدونهم وتدعون نحوهم في الخطوب\n وتذعنون أنهم آلهة { مِن دُونِهِ } سبحانه مستحقة للعبادة والرجوع\n قادرة على لوازم الألوهية والربوبية\n فسكتوا بعدما سمعوا ما سمعوا باهتين\n وانقلبوا حينئذٍ صاغرين { بَلِ ٱلظَّالِمُونَ } المجبولون على الظلم والخروج عن مقتضى الحدود الإلهية\n سيما بدعوى الشركة واتخاذ إلهٍ سواه - العياذ بالله منه - { فِي ضَلاَلٍ مُّبِينٍ } [لقمان: 11] وغوايةٍ ظاهرةٍ\n وطغيانٍ عظيمٍ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أمر بالتفكر في هذه المصنوعات استدلالاً على توحيده بقوله: { هذا خلقُ الله } أي: هذا الذي تُعاينونه من جملة مخلوقاته\n { فأَرُوني ماذا خلقَ الذين من دونه } \n يعني: آلهتهم\n بكَّتهم بأن هذه الأشياء العظيمة مما خلق الله\n فأروني ماذا خلق آلهتكم حتى استوجبوا عندكم العبادة؟ { بل الظالمون في ضلال مبين } \n أضرب عن تبكيتهم إلى التسجيل عليهم بالظلم والتورط في ضلال ليس بعده ضلال\n الإشارة: خلق سموات الأرواح - وهو عالم الملكوت - مرفوعاً غنياً عن الاحتياج إلى شيء\n وألقى في أرض النفوس - وهو عالم الأشباح - من العقول الراسخة\n لئلا تميل إلى جهة الانحراف\n إما إلى الحقيقة المحضة\n أو الشريعة\n ونشر في أرض النفوس دواب الخواطَر والوساوس\n وأنبتنا فيها من علوم الحكمة والقدرة\n من كل صنف بهيج قال القشيري: { وألقى في الأرض رواسي } في الظاهر: الجبال\n وفي الحقيقة: الأبدال\n الذين هم أوتاد\n بهم يقيهم\n وبهم يَصرِف عن قريبهم وقاصيهم\n { وأنزلنا من السماء ماء\n\n } المطر من سماء الظاهر في رياض الخُضْرَةَ\n ومن سماء الباطن في رياض أهل الدنوِّ والحَضْرَة\n هذا خلق الله العزيز في كبريائه\n فأروني ماذا خَلَقَ الذين عَبَدْتم من دونه في أرضه وسمائه؟ هـ\n ثم ذكر قصة لقمان الذي وقع السؤال عنه فنزلت السورة\n فقال: { وَلَقَدْ آتَيْنَا لُقْمَانَ ٱلْحِكْمَةَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:85",
      "similarity": 0.5568035010330931
    },
    {
      "verse": "7:110",
      "similarity": 0.5553412906668347
    },
    {
      "verse": "35:40",
      "similarity": 0.554186189736795
    },
    {
      "verse": "4:39",
      "similarity": 0.5032590790740328
    },
    {
      "verse": "26:35",
      "similarity": 0.4943285567808598
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}