{
  "chapter": "لقمان",
  "text": "يبنى انها ان تك مثقال حبة من خردل فتكن فى صخرة او فى السموت او فى الارض يات بها الله ان الله لطيف خبير",
  "translations": [
    {
      "translation": "'My son, even if something weighs as little as a mustard-seed and is inside a rock or anywhere else in the heavens or earth, Allah will bring it out. Allah is All-Pervading, All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son, whatsoever it may be, even though equal to a mustard seed in weight, or within a rock or in the sky or in the earth, God will bring it forth. Verily God is perceptive, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Luqman said): “Son, Allah will bring forth everything even if it be as small as the grain of a mustard seed even though it be hidden inside a rock or (anywhere) in the heavens or earth. Allah is Most Subtle, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My son, God keeps the records of all the good and evil deeds, even if they are as small as a grain of mustard seed, hidden in a rock or in the heavens or the earth. God is subtle and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my son! If the evil deed is equal to the weight of a mustard-seed, and even if it is in a rock, or in the heavens, or wherever in the earth, Allah will bring it forth; indeed Allah knows all the minutest things, the All Aware.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! If it be (anything) equal to the weight of a grain of mustard seed, and though it be in a rock, or in the heavens or on the earth, Allah will bring it forth. Verily, Allah is Subtle, Well-Aware.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! surely if it is the very weight of the grain of a mustard-seed, even though it is in (the heart of) rock, or (high above) in the heaven or (deep down) in the earth, Allah will bring it (to light); surely Allah is Knower of subtleties, Aware;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son, if it should be but the weight of one grain of mustard-seed, and though it be in a rock, or in the heavens, or in the earth, God shall bring it forth; surely God is All-subtle, All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my dear son! Lo! though it be but the weight of a grain of mustard-seed, and though it be in a rock, or in the heavens, or in the earth, Allah will bring it forth. Lo! Allah is Subtile, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Luqman further said,] \"O my son! Though it be but the weight of a grain of mustard seed and though it be hidden in a rock, or in the heavens or on the earth, God will bring it forth. Truly, God is the knower of all subtleties and He is aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! though it be but the weight of a grain of mustard-seed, and though it be in a rock or in the heavens, or in the earth, Allah shall bring it forth. Verily Allah is subtile, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O my son! Even if it should be the weight of a mustard seed, and [even though] it should be in a rock, or in the heavens, or in the earth, Allah will produce it. Indeed Allah is all-attentive, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son!\" (said Luqman), \"If there be (but) the weight of a mustard-seed and it were (hidden) in a rock, or (anywhere) in the heavens or on earth, Allah will bring it forth: for Allah understands the finest mysteries, (and) is well-acquainted (with them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! If it be (anything) equal to the weight of a grain of mustard seed, and though it be in a rock, or in the heavens or in the earth, Allah will bring it forth. Verily, Allah is Subtle (in bringing out that grain), Well-Aware (of its place).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Lokman said:) 'My son, if it should be but the weight of one grain of mustardseed, and though it be on a rock, or in the heavens, or in the earth, Allah shall bring it. Surely, Allah is the Subtle, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my son, even if it were the weight of a mustard-seed, in a rock, or in the heavens, or on earth, God will bring it to light. God is Kind and Expert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And Luqman said], \"O my son, indeed if wrong should be the weight of a mustard seed and should be within a rock or [anywhere] in the heavens or in the earth, Allah will bring it forth. Indeed, Allah is Subtle and Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:16] ‘O my son! Even if it, namely, the evil trait, should be the weight of a grain of mustard-seed, and [even if] it be in a rock, or in the heavens, or in the earth, in other words, in the most concealed place therein, God will bring it forth, and He will call [that person] to account for it. Truly God is Subtle, in bringing it forth, Aware, of its location.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا بُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ (16)تكرير النداء لتجديد نشاط السامع لوعي الكلام . وقرأ نافع وأبو جعفر { إن تَكُ مثقالُ } برفع { مثقالُ } على أنه فاعل { تَكُ مِن ( كان ) التامة . وإنما جيء بفعله بتاء المضارعة للمؤنثة ، وأعيد عليه الضمير في قوله بها } مؤنثاً مع أن { مثقال لفظ غير مؤنث لأنه أضيف إلى حبة } فاكتسب التأنيث من المضاف إليه ، وهو استعمال كثير إذا كان المضاف لو حذف لما اختل الكلام بحيث يستغنى بالمضاف إليه عن المضاف ، وعليه فضمير { إنها } للقصة والحادثة وهو المسمى بضمير الشأن ، وهو يقع بصورة ضمير المفردة المؤنثة بتأويل القصة ، ويختار تأنيث هذا الضمير إذا كان في القصة لفظ مؤنث كما في قوله تعالى { فإنها لا تَعْمَى الأبصار } \\[ الحج : 46 \\] ، ويكثر وقوع ضمير الشأن بعد ( إنَّ ) كقوله تعالى { إنه مَن يأتِ ربه مجرماً فإنَّ له جَهَنم لا يَمُوت فيها ولا يَحْيى } \\[ طه : 74 \\] ، ومن ذلك تقدير ضمير الشأن اسماً لحرف ( أنَّ ) المفتوحة المخففة ، وهو يفيد الاهتمام بإقبال المخاطب على ما يأتي بعده ، فاجتمع في هذه الجملة ثلاثة مؤكدات : النداء ، وإنَّ ، وضمير القصة ، لعظم خطر ما بعده المفيد تقرير وصفه تعالى بالعلم المحيط بجميع المعلومات من الكائنات ، ووصفه بالقدرة المحيطة بجميع الممكنات بقرينة قوله { يأت بها الله . }وقد أفيد ذلك بطريق دلالة الفحوى؛ فذُكر أدقُّ الكائنات حالاً من حيث تعلق العلم والقدرة به ، وذلك أدق الأجسام المختفي في أصْلَب مكان أو أقصاه وأعزِّه منالاً ، أو أوسعه وأشده انتشاراً ، ليعلم أن ما هو أقوى منه في الظهور والدّنو من التناول أولى بأن يحيط به علم الله وقدرته . وقرأه الباقون بنصب { مثقالَ } على الخبرية ل { تكُ } مِن ( كان ) الناقصة ، وتقدير اسم لها يدل عليه المقام مع كون الفعل مسنداً لمؤنث ، أي إن تك الكائنة ، فضمير { إنها } مراد منه الخصلة من حسنة أو سيئة أخذاً من المقام .والمثقال بكسر الميم : ما يقدر به الثقل ولذلك صيغ على زنة اسم الآلة .والحبة : واحدة الحَبّ وهو بذر النبات من سنابل أو قطنية بحيث تكون تلك الواحدة زريعة لنوعها من النبات ، وقد تقدم في سورة البقرة ( 261 ) قوله { كَمَثَل حَبَّة أنبتَتْ سَبْع سَنَابل } وقوله { إنَّ الله فَالِق الحَب والنَّوى } في سورة الأنعام ( 95 ) .والخردل : نبت له جذر وساق قائمة متفرعة إسطوانية أوراقها كبيرة يُخرج أزهاراً صغيرة صُفْراً سنبلية تتحول إلى قرون دقيقة مربعة الزوايا تخرج بزوراً دقيقة تسمى الخردل أيضاً ، ولبّ تلك البزور شديد الحرارة يلدغ اللسان والجلد ، وهي سريعة التفتق ينفتق عنها قشرها بدقّ أو إذا بلت بمائع ، فتستعمل في الأدوية ضَمَّادات على المواضع التي فيها التهاب داخلي من نزلة أو ذات جنْب وهو كثير الاستعمال في الطب قديماً وحديثاً . وقد أخذ الأطباء يستغنون عنه بعقاقير أخرى . وتقدم نظير هذا في سورة الأنبياء ( 47 ){ فلا تُظْلَم نفس شيئاً وإن كان مثقالُ حَبة من خردل أتينَا بها } وقوله { أو في السموات } عطف على { في صخرة } لأن الصخرة من أجزاء الأرض فذكر بعدها { أو في السماوات } على معنى : أو كانت في أعزّ مَنَالاً من الصخرة ، وعطف عليه { أو في الأرض } وإنما الصخرة جزء من الأرض لقصد تعميم الأمكنة الأرضية فإن الظرفية تصدق بهما ، أي : ذلك كله سواء في جانب علم الله وقدرته ، كأنه قال : فتكن في صخرة أو حيث كانت من العالم العلوي والعالم السفلي وهو معنى قوله { وما يعزب عن ربك مثقال ذرّة في الأرض ولا في السماء ولا أصغرَ من ذلك ولا أكبرَ إلا في كتاب مبين } \\[ يونس : 61 \\] .والإتيان كناية عن التمكن منها ، وهو أيضاً كناية رمْزيَّة عن العلم بها لأن الإتيان بأدق الأجسام من أقصى الأمكنة وأعمقها وأصلبها لا يكون إلا عن علم بكونها في ذلك المكان وعلم بوسائل استخراجها منه .وجملة { إن الله لطيف خبير } يجوز أن تكون من كلام لقمان فهي كالمقصد من المقدمة أو كالنتيجة من الدليل ، ولذلك فصلت ولم تعطف لأن النتيجة كبدل الاشتمال يشتمل عليها القياس ولذلك جيء بالنتيجة كلية بعد الاستدلال بجزئية . وإنما لم نجعلها تعليلاً لأن مقام تعليم لقمان ابنه يقتضي أن الابن جاهل بهذه الحقائق ، وشرط التعليل أن يكون مسلَّماً معلوماً قبل العلم بالمعلَّل ليصح الاستدلال به . ويجوز أن تكون معترضة بين كلام لقمان تعليماً من الله للمسلمين .واللطيف : مَن يعلم دقائق الأشياء ويسلك في إيصالها إلى من تصلح به مسلك الرفق ، فهو وصف مؤذن بالعلم والقُدرة الكاملين ، أي يعلم ويقدر وينفذ قدرته ، وتقدم في قوله { وهو اللطيف الخبير } في سورة الأنعام ( 103 ) . ففي تعقيب { يأت بها الله } بوصفه ب ( اللطيف ) إيماء إلى أن التمكن منها وامتلاكها بكيفية دقيقة تناسب فلق الصخرة واستخراج الخردلة منها مع سلامتهما وسلامة ما اتصل بهما من اختلال نظام صُنعه . وهنا قد استوفى أصول الاعتقاد الصحيح .وجملة { إن الله لطيف خبير } \\[ لقمان : 16 \\] يجوز أن تكون من كلام لقمان وأن تكون معترضة من كلام الله تعالى .\n\n",
      "translations": [
        {
          "translation": "Allah then went back to Luqman's exhortation, saying: (0 my dear son! Lo! though it) i.e. a good deed; it is also said that it refers to provision (be but the weight of a grain of mustard seed, and though it be in a rock) beneath the earth, (or in the heavens) or above the heavens, (or in the earth) or in the belly of the earth, (Allah will bring it forth) to the one it is destined wherever he might be. (Allah is Subtile) in bringing it forth, (Aware) of its location.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَأْتِ بِهَا ٱللَّهُ } معناه يُجازي بِهَا الله\n\n\n\n\nوقوله تعالى: { إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٌ } معناه لَطِيفٌ باستخراجِهَا خَبيرٌ بمكانِها\n\n\n\n\nوقوله تعالى: { إِن تَكُ مِثْقَالَ حَبَّةٍ } معناه زِنةُ حَبَّةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nThe phrase \"yatiba biha Allah\" means \"God permits it.\"\n\nAnd His saying - the Most High: {Indeed, Allah is ever Subtle and Acquainted} The meaning of \"Latif\" in extracting it is \"Khabir\" in its place.\n\nAnd the saying of { If you are the weight of a mustard seed } its meaning is the sin of a mustard seed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سجَّل لقمان على ابنه التوحيد بنفي ضده على طريق المبالغة والتأكيد\n أراد أن ينبه عليه بأنه لا بدَّ له أن يحفظ على نفسه الأدب مع الله في كل الأحوال\n بحيث لا يصدر عنه شيء يخالف توحيده\n ولا يلائمه ولو كان ذرة حقيرة\n إذ لا يعزب عن حيطة حضرة علمه سبحانه شيء\n فقال أيضاً منادياً: { يٰبُنَيَّ إِنَّهَآ } أي: الخصلة الذميمة التي أتيت بها المنافية للتوحيد\n أو الخصلة الحميدة الملائمة له\n لا يعزب كلامهما عن علم الله مطلقاً\n وبالجملة: { إِن تَكُ } فرضاً ما جئت به من الخصلة الذميمة والحميدة في صغر الحبة والوزن { مِثْقَالَ حَبَّةٍ } واحدة كائنة { مِّنْ خَرْدَلٍ } أي: هي مثل في الحقارة والصغر { فَتَكُنْ } أنت بعدما جئت بها { فِي صَخْرَةٍ } أي: جوفها\n وهي أخفى المواضع وأستر الأمكنة { أَوْ فِي } أعلى { ٱلسَّمَٰوَٰتِ } وفوقها\n وهو ما وراء الفلك الأطلس { أَوْ فِي } أسفل { ٱلأَرْضِ } وقعرها\n\n\nوبالجملة: إن كنت في أخفى الأماكن وأحفظها { يَأْتِ بِهَا } أي: بك وخصلتك التي صدرت عنك { ٱللَّهُ } الرقيب عليك في جميع حالاتك\n ويجازيك بمقتضاها إن تعلق إرادته ومشيئته بأحضارك وإتيانها\n وبالجلمة: { إِنَّ ٱللَّهَ } المطلع على السرائر والخفايا { لَطِيفٌ } لا يحجبه حجب\n ولا يمنعه سدل { خَبِيرٌ } [لقمان: 16] ذو خبرة\n يعلم كنه الأشياء وإن دقت ورقت ولا كتنه ذاته\n مع أنه أظهر وأبين في ذاته من عموم مظاهره ومصنوعاته\n\n\nوبعدما سمعت { يٰبُنَيَّ } وصف ربك وحيطة علمه وقدرته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في إنها: للقصة\n ومن قرأ \" مثقال \": بالرفع ففاعِلُ كَانَ التامة ومن قرأ بالنصب فخبرها\n والضمير: للخطيئة أو الهيئة\n وأنث \" المثقال \" لإضافته إلى الحبة\n يقول الحق جل جلاله: وقال لقمان لابنه\n حين قال له: يا أبت: إن عَمِلْتُ بالخطيئة\n حين لا يراني أحد\n كيف يعلمها الله؟ فقال: { يا بُنيَّ إنها } \n أي: القصة أو الخطيئة { إن تكُ مثقال حبةٍ من خَرْدَلٍ } أي: إن تك المعصية في الصغر والحقارة\n مثالَ حَبَّةٍ من خردل\n أو: إن تقع مثقالُ حَبَّةٍ من المعاصي { فتكن في صخرةٍ } \n أي: فتكن\n مع صغرها\n في أخفى مكان\n أو في جبل\n وقال ابن عباس: هي صخرة تحت الأَرَضين السبع\n وهي التي يكتب فيها أعمال الفجار\n وخضرة الماء منها\n هـ\n قال السدي: خلق الله تعالى الأرض على حوت\n والحوت في الماء\n والماء على ظهر صَفَاةٍ - أي: صخرة - والصفاة على ظهر ملَكَ\n والملك على صَخْرَة\n وهي الصخرة التي ذكر لقمان\n ليست في السماء ولا في الأرض\n والصخرة على الريح\n هـ\n أي: إن تقع المعصية في أخفى مكان { يأتِ بها اللهُ } يوم القيامة فيحاسب عليها عاملها\n { إن الله لطيفٌ }: يتوصل علمه إلى كل خفي\n { خبير }: عالم بكنهه\n أو: لطيف باستخراجها خبير بمستقرها\n { يا بُني أقم الصلاةَ }: أتقنها\n وحافظ عليها تكميلاً لنفسك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:47",
      "similarity": 0.6172677345829765
    },
    {
      "verse": "89:9",
      "similarity": 0.43283354022855103
    },
    {
      "verse": "18:63",
      "similarity": 0.3828033561959371
    },
    {
      "verse": "67:14",
      "similarity": 0.2399855083480132
    },
    {
      "verse": "33:34",
      "similarity": 0.23648738392760038
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}