{
  "chapter": "لقمان",
  "text": "وان جهداك على ان تشرك بى ما ليس لك به علم فلا تطعهما وصاحبهما فى الدنيا معروفا واتبع سبيل من اناب الى ثم الى مرجعكم فانبئكم بما كنتم تعملون",
  "translations": [
    {
      "translation": "If they try to force you to associate with Me that of which you have no knowledge, do not obey them. Live with them honourably in the world, but follow the way of him who turns to Me. Your returning is to Me in the end, when I will tell you what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they press you to associate others with Me in My Divinity, (to associate) those regarding whom you have no knowledge (that they are My associates), do not obey them. And yet treat them well in this world, and follow the way of him who turns to Me in devotion. Eventually it is to Me that all of you shall return, and I shall then tell you all that you did.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they try to force you to consider things equal to Me, which you cannot justify, equal to Me, do not obey them. Maintain lawful relations with them in this world and follow the path of those who turn in repentance to Me. To Me you will all return and I shall tell you all that you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they force you, that you ascribe a partner to Me a thing concerning which you do not have knowledge – so do not obey them and support them well in the world; and follow the path of one who has inclined towards Me; then towards Me only is your return, and I shall tell you what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they strive with you to make you join in worship with Me others that of which you have no knowledge, then obey them not; but behave with them in the world kindly, and follow the path of him who turns to Me in repentance and in obedience. Then to Me will be your return, and I shall tell you what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they contend with you that you should associate with Me what you have no knowledge of, do not obey them, and keep company with them in this world kindly, and follow the way of him who turns to Me, then to Me is your return, then will I inform you of what you did--\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they strive with thee to make thee associate with Me that whereof thou hast no knowledge, then do not obey them. Keep them company honourable in this world; but follow the way of him who turns to Me. Then unto Me you shall return, and I shall tell you what you were doing.')\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they strive with thee to make thee ascribe unto Me as partner that of which thou hast no knowledge, then obey them not. Consort with them in the world kindly, and follow the path of him who repenteth unto Me. Then unto Me will be your return, and I shall tell you what ye used to do -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they press you to associate something with Me about which you have no knowledge, do not obey them. Yet be kind to them in this world and follow the path of those who turn to Me. You will all return to Me in the end, and I will tell you everything that you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the twain strive with thee to make thee associate with Me that for which thou hast no knowledge, then obey them not. And bear them thou company in the world reputably, and follow thou the path of him who turneth penitently unto Me. Then unto Me is your return, and I shall declare unto you that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they urge you to ascribe to Me as partner that of which you have no knowledge, then do not obey them. Keep their company honourably in this world and follow the way of those who turn to Me penitently. Then to Me will be your return, whereat I will inform you concerning what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they strive to make thee join in worship with Me things of which thou hast no knowledge, obey them not; yet bear them company in this life with justice (and consideration), and follow the way of those who turn to me (in love): in the end the return of you all is to Me, and I will tell you the truth (and meaning) of all that ye did.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they (both) strive with you to make you join in worship with Me others that of which you have no knowledge, then obey them not, but behave with them in the world kindly, and follow the path of him who turns to Me in repentance and in obedience. Then to Me will be your return, and I shall tell you what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they strive with you to make you associate with Me that of which you have no knowledge, do not obey them. And accompany them in this life with kindness; and follow the Path of he who turned to Me. To Me you shall return and I will inform you of all that you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they strive to have you associate with Me something of which you have no knowledge, do not obey them. But keep them company in this life, in kindness, and follow the path of him who turns to Me. Then to Me is your return; and I will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they endeavor to make you associate with Me that of which you have no knowledge, do not obey them but accompany them in [this] world with appropriate kindness and follow the way of those who turn back to Me [in repentance]. Then to Me will be your return, and I will inform you about what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:15] But if they urge you to ascribe to Me as partner that whereof you have no knowledge, that accords with [any] reality, then do not obey them. And keep them company in this world honourably, in other words, with decency: dutifulness and kindness — and follow the way of him who returns to Me [in penitence], with [acts of] obedience. Then to Me will be your return, and I will inform you of what you used to do, and requite you for it (the [entire] sentence containing the ‘enjoinder’ [verse 14] and what comes after it constitutes a parenthetical statement).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But if they strive with thee to make thee) if they want or command you to (ascribe unto Me as partner that of which thou hast no knowledge) that it is My partner while you know that it is not My partner, (then obey them not) regarding idolatry. (Consort with them in the world kindly) with kindness and beneficence, (and 465 follow the path of him who repenteth unto Me) the religion of him who betakes himself to Me and obeys me, i.e. Muhammad (pbuh). (Then unto Me will be your return) and the return of your parents, (and I shall tell you what ye used to do) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ } معناه طَريقُ مَنْ رَجِعَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أكدنا عليكم أيها المكلفون في حفظ حقوق والديكم، وبالغنا فيه { إِن جَاهَدَاكَ } أي: والداك أيها المكلف، واجتهدا في شأنك، وبالغا في الجهد والسعي إلى أن قاتلا معك وأرادا مقتك { عَلَىٰ أَن تُشْرِكَ بِي } وتعتقد رباً سواي وتعبده مثل عبادتي، مع أنك خالي الذهن؛ إذ { مَا لَيْسَ لَكَ بِهِ عِلْمٌ } يتعلق بنفي الشريك وإثباته أيضاً { فَلاَ تُطِعْهُمَا } في أمرهما هذا وسعيهما فيه؛ إذ أصل فطرتك مجبولة على التوحيد سواء تعلق علمك به أو لم يتعلق، فلك ألاَّ تطعهما وتنصرف عن أمرهما هذا { وَ } مع انصرافك على أمرهما هذا { صَاحِبْهُمَا فِي ٱلدُّنْيَا } وإن كانا مشركين { مَعْرُوفاً } مستحسناً عقلاً وشرعاً ومروءةً حفظاً لحقوقهما\n\n\n\n\n{ وَ } لا تتبع بشركها وكفرهما، بل { ٱتَّبِعْ } في الدين والملة { سَبِيلَ مَنْ أَنَابَ } ورجع { إِلَيَّ } ودين من توجه نحوي موحداً إياي، بريئاً من الشرك معي، وبالجملة: امرض على التوحيد واسلك طريقه مادمت في دار الابتلاء { ثُمَّ } بعدما انقرضت النشأة الأولى { إِلَيَّ مَرْجِعُكُمْ } تابعاً ومتبوعاً، أصلاً وفروعاً { فَأُنَبِّئُكُمْ } وأخبركم { بِمَا كُنتُمْ تَعْمَلُونَ } [لقمان: 15] أي: بتفاصيل أعمالكم التي صدرت عنكم في دار الاختبار، وأجازيكم على مقتضاها، إن خيراً فخير وإن شراً فشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو: ما ليس لك به علم باستحقاقه الإشراك مع الله، بل تقليداً لهما، { فلا تُطِعْهُما } في ذلك الشرك\n { وصاحبهما في الدنيا معروفاً } أي: صِحَاباً معروفاً يرتضيه الشرع ويقتضيه الكرم، وهو الخُلُقُ الجميل، بِحِلْمٍ، واحتفالٍ، وبر، وصلة\n وقد تقدم تفسيره في الإسراء\n { واتبع سبيل من أناب إلي } أي: اتبع طريق مَنْ رَجَعَ إليَّ بالتوحيد والإخلاص، وهو الرسول صلى الله عليه وسلم والمؤمنون، ولاتتبع سبيلهما، وإن كنت مأموراً بحسن مصاحبتهما في الدنيا، وقال ابن عطاء: اتبع سبيل من ترى عليه أنوار خدمتي\n هـ\n { ثم إليَّ مرجِعكُم } أي: مرجعك ومرجعهما، { فأُنَبِئُكم بما كنتم تعملون } فأجازيك على إيمانك وَبِرِّكَ وأجازيهما على كفرهما\n وَاعْتَرَضَ بهاتين الآيتين، على سبيل الاستطراد تأكيداً لِمَا في وصية لقمان من النهي عن الشرك، يعني: إنما وصيناه بوالديه، وأمرناه ألا يطيعَهُمَا في الشرك، وإن جاهدا كل الجهد لقبح الشرك\n وتقدم أن الآية نزلت في سعد بن أبي وقاص، وأنه مضت لأمه ثلاث ليال لم تَطْعم فيها شيئاً، فشكى لرسول الله صلى الله عليه وسلم فنزلت، وقيل: من أناب: أبو بكر لأن سعداً أسلم بدعوته\n\n\nوالله تعالى أعلم\n الإشارة: بر الوالدين واجب، لاسيما في حق الخصوص، فيطيعهما في كل شيء، إلا إذا منعاه من صحبة شيخ التربية، الذي يُطهر من الشرك الخفي، الذي لا ينجو منه أحد، فإن الآية تشمله بطريق العموم والإشارة\n أي: وإن جاهداك على أن تشرك بي متابعة هواك وحظوظك ومحبتهن، فلا تُطعهما، وصاحبهما في الدنيا معروفاً، واتبع سبيل من أناب إليَّ، هو شيخ التربية في علم الإشارة\n وقد تقدم قول الجنيد: أمرني أبي بشيء، وأمرني السّري بشيء، فقدمت أمر السّري، فرأيت سراً كبيراً\n وكان شيخ شيوخنا الولي الشهير، سيدي يوسف الفاسي، يأتيه شاب من أولاد كبراء فاس، وكان أبوه ينهاه ويزجره عن صحبته، وربما بلغ لمجلس الشيخ فيؤذيه، فكان الشيخ يقول للشاب: أطع أباك في كل شيء إلا في الإتيان إلينا\n هـ\n وكان بعض المشايخ يقول: ائتوني ولو بسخط الوالدين، إذ لا يضره ذلك، حيث قصد إصلاح نفسه ودواءها\n وقال الشيخ السنوسي، في شرح عقائد الجزائري، ما نصه: وحاصل الأمر في النفس: أنها شبيهة، في حالها، بحال الكافر الحَرْبِيّ، الذي يريد أن تكون كلمة الكفر هي العليا، وكلمة التوحيد السفلى، وكذلك النفس تريد أن تكون كلمة باطلها من الدعاوى للحظوظ العاجلة، المُشْغِلة عن إخلاص العبودية لمولانا جل وعلا، وعن القيام بوظائف تكاليفه، على الوجه الذي أمر به، هي العليا، النافذ أمرها ونهيها في مُدُنِ الأجسام وما تعلق بها، بعد أن نزلت ساحة الأبدان، واتصلت اتصالاً عظيماً لا انفكاك له إلا بالموت، فوجب، لذلك، على كل مؤمن يُعظّم حرمات الله تعالى أن ينهض كل النهوض، بغاية قواه العِلمية والعملية، لجهادها وقتالها\n وفي مثل هذا القتال الذي نزل العدو فيه بساحة الأبدان، وهو فرض عين على كل مؤمن، يسقط فيه استئذان الأبوين وغيرهما\n هـ\n فأنت ترى كيف جعل قيام النفس على العبد، وحجابها له عن ربه، كعدو يجب جهاده ولو خالف الوالدين، وهو كذلك إذ طاعة الوالدين لا تكون في ترك فرض، ولا في ارتكاب معصية، ومن جملة المعاصي، عند الخواص، رؤية النفس والوقوف معها، وفي ذلك يقول الشاعر:\n\nوتطهير النفس فرض عين، ولا طاعة للوالدين في فرض العين\n وقوله تعالى: وصاحبهما في الدنيا معروفاً قال الورتجبي: المعروف، ها هنا، أن تُعرفهما مكان الخطأ والغلط في الدين عند جهالتهما بالله\n { واتبع سبيل من أناب إليَّ } ، نهاه عن متابعة المخلَّطِين، وحثه على متابعة المنيبين\n هـ\n وبالله التوفيق\n ثم قال لقمان في وصيته: { يٰبُنَيَّ إِنَّهَآ إِن تَكُ مِثْقَالَ حَبَّةٍ\n\n\n }\n",
      "translations": []
    }
  ]
}