{
  "chapter": "لقمان",
  "text": "ولا تصعر خدك للناس ولا تمش فى الارض مرحا ان الله لا يحب كل مختال فخور",
  "translations": [
    {
      "translation": "Do not avert your face from people out of haughtiness and do not strut about arrogantly on the earth. Allah does not love anyone who is vain or boastful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not hold men in contempt, and do not walk with hauteur on the earth. Verily God does not like the proud and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not (contemptuously) turn your face away from people, nor tread haughtily upon earth. Allah does not love the arrogant and the vainglorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not scornfully turn your face away from people. Do not walk around puffed-up with pride; God does not love arrogant and boastful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And do not contort your cheek while talking to anyone, nor boastfully walk upon the earth; indeed Allah does not like any boastful, haughty person.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not your face away from men with pride, nor walk in insolence through the earth. Verily, Allah likes not any arrogant boaster.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not turn your face away from people in contempt, nor go about in the land exulting overmuch; surely Allah does not love any self-conceited boaster;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn not thy cheek away from men in scorn, and walk not in the earth exultantly; God loves not any man proud and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn not thy cheek in scorn toward folk, nor walk with pertness in the land. Lo! Allah loveth not each braggart boaster.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not avert your face from people out of haughtiness and do not walk with pride on the earth: for, behold, God does not love arrogant and boastful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not away thy cheek from men nor walk on the earth stultingly, verily Allah loveth not any vainglorious boaster.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not turn your cheek away disdainfully from the people, and do not walk exultantly on the earth. Indeed Allah does not like any swaggering braggart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And swell not thy cheek (for pride) at men, nor walk in insolence through the earth; for Allah loveth not any arrogant boaster.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not your face away from men with pride, nor walk in insolence through the earth. Verily, Allah likes not each arrogant boaster.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not turn your cheek in scorn away from people, nor walk proudly on the earth; Allah does not love the proud and the boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not treat people with arrogance, nor walk proudly on earth. God does not love the arrogant showoffs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not turn your cheek [in contempt] toward people and do not walk through the earth exultantly. Indeed, Allah does not like everyone self-deluded and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:18] And do not turn your cheek disdainfully from people (tusa‘‘ir: a variant reading has tusā‘ir) do not turn your face away in disdain, and do not walk upon the earth exultantly, in other words, with haughtiness. Truly God does not like any swaggering braggart, strutting in his step, [boasting] in front of people.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Turn not thy cheek in scorn towards folk) do not turn your face away from people out of pride and haughtiness towards them; it is also said that this means: do not belittle the poor among Muslims, (nor walk with pertness the land) displaying hubris and pretentiousness. (Lo! Allah loveth not each braggart) in his walk (boaster) about the blessings of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُصَعِّرْ خَدَّكَ } معناه تُعرِضُ عَنْهم تكبراً\n وقال: هو التَّشديقُ\n\n\n\n\nوقوله تعالى: { وَلاَ تَمْشِ فِي ٱلأَرْضِ مَرَحاً } يعني بَطراً وكبراً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd do not {turn your nose up at them in arrogance}. This means that you should not act arrogantly towards them.\n And he said: \"It is the {Tashdīq}\"\n\n\nAnd do not walk on earth arrogantly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بشَّاشاً بسَّاماً { وَلاَ تُصَعِّرْ } أي: لا تمل ولا تعرض { خَدَّكَ } أي: صفحة وجهك التي بها مواجهتك { لِلنَّاسِ } ولا تلوِ عنقك عنهم كبراً وخيلاً\n كما يفعله أرباب النخوة من الجهلة المستكبرين المتفوقين\n المفتخرين بما عندهم من المال والجاه والثروة والسيادة\n والعلوم الرسمية على الفقراء الضعفاء الفاقدين لها { وَ } بالجملة: { لاَ تَمْشِ } يا بني { فِي ٱلأَرْضِ } التي بُسطت للتذلل والانكسار { مَرَحاً } أي: ذا فرح وسرور\n متفخراً بما عندك من الحطام الفاني { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { لاَ يُحِبُّ كُلَّ مُخْتَالٍ } يمشي على وجه الأرض خيلاً\n بحيث يتبادر منه الكبر والنخوة في بادئ النظر { فَخُورٍ } [لقمان: 18] بما عنده من الحسب والنسب\n والمال والجاه بطر بها\n مباه بسببها\n\n\n{ وَٱقْصِدْ فِي مَشْيِكَ } أي: توسط يا بني في مشيك بين الإسراع المذهب بهاء المؤمن ووقاره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تُصَعِّر خَدكَ للناس } أي: تُمله عنهم، ولا تولهم صفَحة خدك، كما يفعله المتكبرون\n والتصعير: داء يصيب العير، فيلوى عُنُقَهُ منه\n والمعنى: أَقْبِل على الناس بوجهك تواضعاً، ولا تُولهم شق وجهك وصفحته { ولا تمشِ في الأرض مرحاً } خُيَلاَءَ متبختراً، فهو مصدر في موضع الحال، أي: مَرِحاً، أو تمرح مرحاً، أو: لأجل المرح، { إن الله لا يحب كل مختالٍ فخورٍ } ، علة النهي\n والمختال هو المرِحُ الذي يمشي خيلاء، والفخور هو المُصَعِّرُ خَدَّهُ تكبراً\n وتأخير الفخور، مع تقدمه لرؤوس الآي\n { واقصِدْ في مشيك } توسط فيه بين الدبيب والإسراع، فلا تدب دبيب المتماوتين، ولا تثب وثوب الشطارين، قال عليه الصلاة والسلام:\n\n \" إنَّ سُرْعَةَ المَشي تُذْهِبُ بَهَاءِ المُؤْمِنِ \" \n\n \n\nوأما قول عائشة ـ رضي الله عنها: كان إذا مَشَى أسْرَع فإنما أرادت السرعة المرتفعة عن دبيب التماوت\n وعن ابن مسعود رضي الله عنه: كانوا ينهون عن خَبَبِ اليهود ودبيب النصارى، ولكن مشياً بين ذلك\n وقيل: { واقصد في مشيك }: انظر موضع قدميك، أو: اقصد: تَوَسَّطْ بين العلو والتقصير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:4",
      "similarity": 0.369979033888739
    },
    {
      "verse": "40:75",
      "similarity": 0.2610726338842865
    },
    {
      "verse": "17:37",
      "similarity": 0.25405193814472565
    },
    {
      "verse": "4:36",
      "similarity": 0.21103343812129888
    },
    {
      "verse": "57:23",
      "similarity": 0.1979324815601733
    }
  ]
}