{
  "chapter": "لقمان",
  "text": "ولقد ءاتينا لقمن الحكمة ان اشكر لله ومن يشكر فانما يشكر لنفسه ومن كفر فان الله غنى حميد",
  "translations": [
    {
      "translation": "We aave Luaman wisdom: 'Give thanks to Allah. Whoever aives thanks onlv does so to his own aood. Whoever is ungrateful, Allah is Rich Beyond Need, Praiseworthy.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed wisdom on Luqman that he may be grateful to God. Whosoever is grateful is so for his own good, and whoever is ungrateful (should remember) that God is above all concern, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed wisdom upon Luqman, (enjoining): “Give thanks to Allah.” Whoso gives thanks to Allah, does so to his own good. And whoso disbelieves (let him know that) Allah is All-Sufficient, Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave wisdom to Luqman so that he would give thanks to God. Those who give thanks to God do so for their own good. Those who are ungrateful should know that God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed wisdom to Luqman (saying) that, “Be grateful to Allah”; and whoever is grateful, is grateful for his own good; and whoever is ungrateful – then indeed Allah is the Absolute, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed upon Luqman Al-Hikmah saying: \"Give thanks to Allah.\" And whoever gives thanks, he gives thanks for (the good of) himself. And whoever is unthankful, then verily, Allah is All-Rich, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave wisdom to Luqman, saying: Be grateful to Allah. And whoever is grateful, he is only grateful for his own soul; and whoever is ungrateful, then surely Allah is Self-sufficient, Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave Lokman wisdom: 'Give thanks to God. Whosoever gives thanks gives thanks only for his own soul's good, and whosoever is ungrateful -- surely God is All-sufficient, All-laudable.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We gave Luqman wisdom, saying: Give thanks unto Allah; and whosoever giveth thanks, he giveth thanks for (the good of) his soul. And whosoever refuseth - Lo! Allah is Absolute, Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed wisdom on Luqman, saying, \"Be grateful to God: he who is grateful, is grateful only for the good of his own soul. But if anyone is ungrateful, then surely God is self-sufficient and praiseworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Luqman Wisdom, saying: give thanks unto Allah; and whosoever giveth thanks giveth thanks for his soul; and whosoever is unthankful--then verily Allah is self-sufficient, praiseworthy\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Luqman wisdom, saying, ‘Give thanks to Allah; and whoever gives thanks, gives thanks only for his own sake. And whoever is ungrateful, [let him know that] Allah is indeed all-sufficient, all-laudable.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we bestowed (in the past) Wisdom on Luqman: \"Show (thy) gratitude to Allah.\" Any who is (so) grateful does so to the profit of his own soul: but if any is ungrateful, verily Allah is free of all wants, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed upon Luqman Al-Hikmah (wisdom and religious understanding, etc.) saying: \"Give thanks to Allah,\" and whoever gives thanks, he gives thanks for (the good of) his ownself. And whoever is unthankful, then verily, Allah is All-Rich (Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave wisdom to Lokman (saying): 'Give thanks to Allah. He who gives thanks, thanks only for himself, but whosoever is ungrateful, surely, Allah is the Rich, the Praised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We endowed Luqman with wisdom: “Give thanks to God.” Whoever is appreciative—is appreciative for the benefit of his own soul. And whoever is unappreciative—God is Sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly given Luqman wisdom [and said], \"Be grateful to Allah.\" And whoever is grateful is grateful for [the benefit of] himself. And whoever denies [His favor] - then indeed, Allah is Free of need and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:12] And verily We gave Luqmān wisdom, comprising knowledge, religiousness, and right-mindedness in speech; his many wisdoms are well-known. He used to give legal opinions [in matters of religion] before David was summoned [to prophethood], but lived on into the latter’s summoning. He then took to acquiring knowledge from him [David] and refrained from giving [any more] legal opinions, explaining this thus: ‘Should I not be content if someone [like the prophet David] has spared me the trouble?’ He was once asked, ‘What is the worst kind of person?’ He said, ‘The one who does not care that people should see him doing evil’. In other words, [We gave him wisdom] and We said to him: ‘Give thanks to God, for the wisdom that He has given you. Whoever gives thanks only for his own sake, because the reward for his gratitude shall be his, and whoever is ungrateful, for a grace, then surely God is Independent, [without need] of His creation, Praised’, in what He does.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We gave Luqman wisdom) knowledge, understanding and right words and actions, (saying: Give thanks unto Allah) by declaring His Oneness and obeying Him; (and whosoever giveth thanks) for His blessings through declaring His divine Oneness and obeying Him, (he giveth thanks for (the good of) his soul) for the reward of his soul. (And whosoever refuseth) and whoever is ungrateful towards His blessings, (lo! Allah is Absolute) free of need for his thanks, (Owner of Praise) for His actions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ آتَيْنَا لُقْمَانَ ٱلْحِكْمَةَ } معناهُ الفِقهُ، والإِصابةُ في القَولِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه عن سبيل إظهار الفضل الامتنان، والتفرد بمقتضى الألوهية والربوبية: { وَلَقَدْ آتَيْنَا } من مقام عظيم لطفنا وجودنا { لُقْمَانَ } بن باعورا بن ناخور بن آزر، فكان ابن أخت أيوب عليه السلام أو ابن خالته، وعاش إلى أن أدرك داوود عليه السلام فأخذ منه العلم و { ٱلْحِكْمَةَ } وهي عبارة عن اعتدال الأوصاف الجبلية المودعة في النفوس البشرية على مقتضى الفطرة الأصلية، والتخلق بالأخلاق المرضية المنشئة من الأوصاف الذاتية الإلهية، وقلنا له بعدما أنعمنا عليه نعمة الحكمة، وأعددناه لقبول فيضان أنواع اللطف والكرامات: { أَنِ ٱشْكُرْ للَّهِ } واصرف بمقتضى الحكمة الموهوبة لك من عندنا جميع ما أعطيناك من النعم العظام على ما جبلنا لأجله؛ لتكون من زمرة الشاكرين المواظبين على أداء حقوق جودنا وكرمنا، ومن جملة المطيعين لمقتضيات حكمتنا وأحكامنا\n\n\n\n\n{ وَ } أعلم أيها المجبول على الحكمة الفطرية أنه { مَن يَشْكُرْ } نعمنا عاد على نفسه فوائد كرمنا { فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ } إذ فائدة شكره عائدة إليه، مزيدة لنعمنا إياه، مستجبلة لأنواع لطفنا وإحساننا معه { وَمَن كَفَرَ } لنعمنا من خبث طينته، وأعرض عن أداء حقوق كرمنا إياه، فوبال كفرانه أيضاً عائد إلى نفسه؛ إذ عندنا الشكر والكفر سيان، ونحن منزهون عن الربح والخسران { فَإِنَّ ٱللَّهَ } المتجلي على عموم الأنفس والآفاق بالاستحقاق { غَنِيٌّ } بذاته عن جميع صور إحسان عباده معه { حَمِيدٌ } [لقمان: 12] هو في ذاته باعتبار أوصافه الذاتية الظاهرة آثارها على صفائح الأكوان والمكونات، المتجهة نحو مبدعها، المثنية له حالاً ومقالاً، سراً وجهاراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يا بُني فيه ثلاث قراءات كسر الياء، وفتحها مُشَدَّدةً، وإسكانها\n وقد تتبعنا توجيهاتها في كتابنا \" الدرر الناثرة في توجيه القراءات المتواترة \"\n يقول الحق جل جلاله: { ولقد آتينا لقمان الحكمةَ } وهو لقمان بن باعوراء ابن أخت أيوب، أو ابن خالته، وقيل: كان من أولاد آزر، وقيل: أخو شداد بن عاد، أُعطى شداد القوة، وأُعطى لقمان الحكمة، وعاش ألف سنة، وقيل: أكثر، وسيأتي\n وأدرك داود عليه السلام، وأخذ منه العلم\n وكان يُفتي قبل مبعث داود، فلما بُعث قطع الفتوى، فقيل له في ذلك؟ فقال: ألا أكتفي إذا كُفيت\n وقيل: كان خياطاً، وقيل: نجاراً، وقيل: راعياً\n وقيل: كان قاضياً في بني إسرائيل\n وقال عكرمة والشعبي: كان نبياً، والجمهور على أنه كان حكيماً فقط\n وقد خُير بين النبوة والحكمة فاختار الحكمة، وهي الإصابة في القول والعمل\n وقيل: تتلمذ لألف نبي وتتلمذ له ألف نبي\n قاله النسفي\n قال ابن عمر: سمعت النبي صلى الله عليه وسلم يقول:\n\n \" لم يكن لقمان نبياً ولكن كان عبداً كثير التفكر، حسن اليقين، أحب الله فأحبه، فمنَّ عليه بالحكمة\n كان قائماً فجاءه نداء: يا لقمان، هل لك أن يجعلك الله خليفة في الأرض، تحكم بين الناس بالحق؟ فأجاب الصوت، فقال: إن خيرني ربي قبلت العافية، وإن عزم عليّ فسمعاً وطاعة، فإني أعلم إن فعل ذلك بي عصمني وأعانني\n قالت الملائكة بصوت ولا يراهم: لِمَ يا لقمان؟ فقال: لأن الحاكم بأشد المنازل وأكدرها، يغشاه الظلم من كل مكان، إن يُعَن، فالبحري أن ينجو، وإن أخطأ أخطأ طريق الجنة، ومن يكن في الدنيا ذليلاً، خير من أن يكون شريفاً، ومن يختر الدنيا على الآخرة تفُته الدنيا، ولا يصيب الآخرة\n فعجبت الملائكة من حسن منطقه، فنام نومة فأُعطى الحكمة، فانتبه وتكلم بها \" \n\nهـ\n قال مجاهد: كان لقمان عبداً أسود، عظيم الشفتين، مُشققَّ القدمين\n زاد في اللباب: وكانت زوجته من أجمل أهل زمانها\n قيل: لم يزل لقمان، ومن زمن داود مظهراً للحكمة والزهد، إلى أيام يونس بن متى\n وكان قد عَمَّرَ عُمر سبعة أنسر، فكان آخر نسوره \" لبذ \"\n رُوي أنه أخذ نسراً صغيراً فربّاه، وكان يصرفه في حوائجه، فعاش ذلك النسر ألف سنة ومات، ثم أخذ نسراً آخر، فعاش خمسمائة سنة، ثم أخذ آخر، فعاش مثل ذلك، إلى السابع، عاش خمسمائة سنة، واسمه لبذ، فقال له لقمان يوماً: يا لبذ انهض إلى كذا، فأراد النهوض فلم يستطع، وإذا بوتر لقمان قد اختلج، وكان لم يألم قط، فنادى بأهله وعشيرته، وعلم أن أجله قد قرب، وقال: إن أجلي قد حضر بموت هذا النسر، كما أعلمني ربي، فإذا مت فلا تدفنوني في الكهوف والمقابر، كما [تدفنون] الجبابرة، ولكن ادفنوني في ضريح الارض، فدفنوه كما أوصاهم، فقال ابن ثعلبة:\n\n\n\nقال البيضاوي: والحكمة في عرف العلماء: استكمال النفس الإنسانية باقتباس العلوم النظرية واكتساب الْمَلَكَةِ التامة على الأفعال الفاضلة على قدر طاقتها\n ومن حكمته أنه صحب داود شهوراً، وكان يسرد الدرع، فلم يسأله عنها، فلما أتمها لبسها، فقال: نِعْمَ لبوسُ الحرب أنتِ، فقال: الصمت حكمة وقليل فاعله، وأن داود قال له يوماً: كيف أصبحت؟ فقال: أصبحت في يَدَيْ غيري\n وأنه أمر لقمان بأن يذبح شاة ويأتيه بأطيب مُضْغَتين منها، فأتى باللسان والقلب، ثم بعد أيام أمر بأن يأتي بأخبث مضغتين منها فأتى بهما أيضاً فسأله عن ذلك فقال: هما أطيب شيء إذا طابا وأخبث شيء إذا خبثا\n والذي عند الثعلبي: أن الآمر له بإتيان المضغتين سيدهُ، لا داود عليه السلام قيل له: بِمَ نلت هذه الحكم، وقد كنت راعياً؟ فقال بصدق الحديث، وأداء الأمانة، وترك ما لا يعنيني\n هـ\n قال صلى الله عليه وسلم:\n\n \" أول ما رؤى من حكمة لقمان: أن مولاه أطال الجلوس في المخرج، فناداه لقمان: إن الجلوس على الحاجة ينخلع منه الكبد، ويورث الباسور، ويُصعد الحرارة إلى الرأس، فاجلس هويناً، وقم هويناً \" \n\nوروي أنه قَدِمَ من سفر، فقيل له: مات أبوك، فقال: الحمد لله، ملكتُ أمري، فقيل له: ماتت امرأتك، فقال: الحمد لله جُدِّدَ فراشي، فقيل له: ماتت أختك، فقال: سُترت عورتي، فقيل له: مات أخوك، فقال: انقطع ظهري\n هـ\n و \" أَنْ \" - في قوله: { أن أشكر }: مفسرة لأنَّ إيتاء الحكمة في معنى القول، أي: وقلنا له اشكر الله على ما أعطاك من الحكمة، وفيه تنبيه على أن الحكمة الأصلية والعلم الحقيقي هو العمل بهما، وعبادةُ الله والشكر له، حيث فسر الحكمة بالحث على الشكر\n وقيل: لا يكون الرجل حكيماً حتى يكون حليماً في قوله وفعله ومعاشرته وصُحبته\n وقال الجنيد: الشكر: ألا يُعْصَى اللهُ بنعمه\n وقال أيضاً: ألا ترى مع الله شريكاً في نعمه\n وقيل: هو الإقرار بالعجز عن الشكر\n والحاصل: أن شكر القلب: المعرفة، وشكر اللسان: الحمد، وشكر الأركان: الطاعة\n ورؤية العجز في الكل دليل القبول\n { ومن يشكرْ فإنما يشكر لنفسه } لأن منفعته تعود عليه، لأنه يريد المزيد، { ومن كفرَ فإِنَّ الله غنيٌّ } غير محتاج إلى شكر أحد، { حميد } حقيق بأن يُحمد، وإن لم يَحْمَدْهُ أحد",
      "translations": []
    }
  ]
}