{
  "chapter": "لقمان",
  "text": "ووصينا الانسن بولديه حملته امه وهنا على وهن وفصله فى عامين ان اشكر لى ولولديك الى المصير",
  "translations": [
    {
      "translation": "We have instructed man concerning his parents. Bearing him caused his mother great debility and the period of his weaning was two years: 'Give thanks to Me and to your parents. I am your final destination.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have committed man about his parents. His mother carries him in her womb in weakness and debility, weaning him in two years. So he should be grateful to Me and his parents. To Me is the journeying back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We enjoined upon man to be dutiful to his parents. His mother bore him in weakness upon weakness, and his weaning lasted two years. (We, therefore, enjoined upon him): “Give thanks to Me and to your parents. To Me is your ultimate return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Concerning his parents), We advised the man, whose mother bears him with great pain and breast-feeds him for two years, to give thanks to Me first and then to them, to Me all things proceed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We ordained upon man concerning his parents; his mother bore him enduring weakness upon weakness, and his suckling is up to two years – therefore be thankful to Me and to your parents; finally towards Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man (to be dutiful and good) to his parents. His mother bore him in weakness and hardship upon weakness and hardship, and his weaning is in two years -- give thanks to Me and to your parents. Unto Me is the final destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined man in respect of his parents-- his mother bears him with faintings upon faintings and his weaning takes two years-- saying: Be grateful to Me and to both your parents; to Me is the eventual coming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And We have charged man concerning his parents -- his mother bore him in weakness upon weakness, and his weaning was in two years -- 'Be thankful to Me, and to thy parents; to Me is the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man concerning his partners - His mother beareth him in weakness upon weakness, and his weaning is in two years - Give thanks unto Me and unto thy parents. Unto Me is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined man to show kindness to his parents -- for his mother bears him, in hardship upon hardship, and his weaning takes two years. [We said] Give thanks to Me and to your parents; all will return to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man concerning his parents--his mother beareth him in hardship upon hardship and his weaning is in two years: give thanks unto Me and unto thy parents; Unto Me is the goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined man concerning his parents: His mother carried him through weakness upon weakness, and his weaning takes two years. Give thanks to Me and to your parents. To Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man (to be good) to his parents: in travail upon travail did his mother bear him, and in years twain was his weaning: (hear the command), \"Show gratitude to Me and to thy parents: to Me is (thy final) Goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man (to be dutiful and good) to his parents. His mother bore him in weakness and hardship upon weakness and hardship, and his weaning is in two years give thanks to Me and to your parents, unto Me is the final destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We charged the human concerning his parents, for his mother bore him in weakness upon weakness, and his weaning was in two years. Be thankful to Me and to your parents, to Me is the arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have entrusted the human being with the care of his parents. His mother carried him through hardship upon hardship, weaning him in two years. So give thanks to Me, and to your parents. To Me is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man [care] for his parents. His mother carried him, [increasing her] in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents; to Me is the [final] destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:14]   And We have enjoined man concerning his parents, We commanded him to be dutiful towards them — his mother bears him, and weakens, in weakness after weakness, that is to say, she is weakened by the pregnancy, the pains of labour and the delivery; and his weaning is in two years, and We said to him [to man]: ‘Give thanks to Me and to your parents. To Me is the journey’s end, the return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَى وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ (14) إذا درجنا على أن لقمان لم يكن نبيئاً مبلغاً عن الله وإنما كان حكيماً مرشداً كان هذا الكلام اعتراضاً بين كلامي لقمان لأن صيغة هذا الكلام مصوغة على أسلوب الإبلاغ والحكاية لقول من أقوال الله . والضمائر ضمائر العظمة جرَّتْه مناسبة حكاية نهي لقمان لابنه عن الإشراك وتفظيعه بأنه ظلم عظيم . فذكر الله هذا لتأكيد ما في وصية لقمان من النهي عن الشرك بتعميم النهي في الأشخاص والأحوال لئلا يتوهم متوهم أن النهي خاص بابن لقمان أو ببعض الأحوال فحكى الله أن الله أوصى بذلك كل إنسان وأن لا هوادة فيه ولو في أحرج الأحوال وهي حال مجاهدة الوالدين أولادَهم على الإشراك . وأحسن من هذه المناسبة أن تجعل مناسبة هذا الكلام أنه لما حكى وصاية لقمان لابنه بما هو شكر الله بتنزيهه عن الشرك في الإلهية بيَّن الله أنه تعالى أسبق منَّة على عباده إذ أوصى الأبناء ببر الآباء فدخل في العموم المنة على لقمان جزاءً على رعيه لحق الله في ابتداء موعظة ابنه فالله أسبق بالإحسان إلى الذين أحسنوا برَعْي حقه . ويقوي هذا التفسير اقتران شكر الله وشكر الوالدين في الأمر .وإذا درجنا على أن لقمان كان نبيئاً فهذا الكلام مما أبلغه لقمان لابنه وهو مما أوتيه من الوحي ويكون قد حكي بالأسلوب الذي أوحي به إليه على نحو أسلوب قوله { أن اشكر لله } \\[ لقمان : 12 \\] وهذا الاحتمال أنسب بسياق الكلام ، ويرجحه اختلاف الأسلوب بينها وبين آيتي سورة العنكبوت وسورة الأحقاف لأن ما هنا حكاية ما سبق في أمة أخرى والأخريين خطاب أنف لهذه الأمة . وقد روي أن لقمان لما أبلغ ابنه هذا قال له : إن الله رضيني لك فلم يوصِني بك ولم يرضَك لي فأوصاكَ بي .والمقصود من هذا الكلام هو قوله { وإن جاهداك على أن تشرك بي } إلى آخره . . . وما قبله تمهيد له وتقرير لواجب بر الوالدين ليكون النهي عن طاعتهما إذا أمرا بالإشراك بالله نهياً عنه في أوْلى الحالات بالطاعة حتى يكون النهي عن الشرك فيما دون ذلك من الأحوال مفهوماً بفحوى الخطاب مع ما في ذلك من حسن الإدماج المناسب لحكمة لقمان سواء كان هذا من كلام لقمان أو كان من جانب الله تعالى .وعلى كلا الاعتبارين لا يحسن ما ذهب إليه جمع من المفسرين أن هذه الآية نزلت في قضية إسلام سعد بن أبي وقاص وامتعاض أمه ، لعدم مناسبته السياق ، ولأنه قد تقدم أن نظير هذه الآية في سورة العنكبوت نزل في ذلك ، وأنها المناسبة لسبب النزول فإنها أخلِيت عن الأوصاف التي فيها ترقيق على الأم بخلاف هذه ، ولا وجه لنزول آيتين في غرض واحد ووقت مختلف وسيجيء بيان الموصَى به .والوهْن بسكون الهاء مصدر وَهَن يهِن من باب ضرَب . ويقال : وَهَنٌ بفتح الهاء على أنه مصدر وهِنَ يَوْهَن كوَجِلَ يَوجَل . وهو الضعف وقلة الطاقة على تحمل شيء . وانتصب { وَهْناً } على الحال من { أمّه } مبالغة في ضعفها حتى كأنها نفس الوهْن ، أي واهنة في حمله ، و { على وهن } صفة ل { وَهْناً } أي وهْناً واقعاً على وهْن ، كما يقال : رجع عوْداً على بدء ، إذا استأنف عملاً فرغ منه فرجع إليه ، أي : بعد بدء ، أو { على } بمعنى ( مع ) كما في قول الأحوص :إني على ما قد علمِت محسَّد ... أنمي على البغضاءِ والشَنآنِفإن حمل المرأة يقارنه التعب من ثقل الجنين في البطن ، والضُعفُ من انعكاس دمها إلى تغذية الجنين ، ولا يزال ذلك الضعف يتزايد بامتداد زمن الحمل فلا جرم أنه وَهْن على وَهْن .وجملة { حملته أمه وهناً على وهن } في موضع التعليل للوصاية بالوالدين قصداً لتأكيد تلك الوصاية لأن تعليل الحكم يفيده تأكيداً ، ولأن في مضمون هذه الجملة ما يثير الباعث في نفس الولد على أن يبرّ بأمه ويستتبع البرّ بأبيه . وإنما وقع تعليل الوصاية بالوالدين بذكر أحوال خاصة بأحدهما وهي الأم اكتفاء بأن تلك الحالة تقتضي الوصَاية بالأب أيضاً للقياس فإن الأب يلاقي مشاقّ وتعباً في القيام على الأم لتتمكن من الشغل بالطفل في مدة حضانته ثم هو يتولى تربيته والذبّ عنه حتى يبلغ أشدّه ويستغني عن الإسعاف كما قال تعالى { وقُلْ ربِّ ارْحَمْهُما كَما رَبَّيَانِي صَغِيراً } \\[ الإسراء : 24 \\] ، فجمعهما في التربية في حال الصغر مما يرجع إلى حفظه وإكمال نشأته ، فلما ذكرت هنا الحالة التي تقتضي البر بالأم من الحمل والإرضاع كانت منبهة إلى ما للأب من حالة تقتضي البرَّ به على حساب ما تقتضيه تلك العلة في كليهما قوة وضعفاً . ولا يقدح في القياس التفاوت بين المقيس والمقيس عليه في قوة الوصف الموجب للإلحاق . وقد نبَّه على هذا القياس تشريكهما في التحكم عقب ذلك بقوله { أن اشكر لي ولوالديك } وقوله { وصاحبهما في الدنيا معروفاً } . وحصل من هذا النظم البديع قضاء حق الإيجاز .وأمّا رجحان الأم في هذا الباب عند التعارض في مقتضيات البرور تعارضاً لا يمكن معه الجمع فقال ابن عطية في «تفسيره» : شرك الله في هذه الآية الأم والأب في رتبة الوصية بهما ثم خصص الأم بذكر درجة الحمل ودرجة الرضاع فتحصل للأم ثلاث مراتب وللأب واحدة ، وأشبه ذلك قول الرسول صلى الله عليه وسلم حين قال له رجل : مَن أُبِرُّ؟ قال : أمَّك . قال : ثم مَن؟ قال : أمَّك . قال : ثم مَن؟ قال : أمَّك . قال : ثم مَن؟ قال : أباك . فجعل له الربع من المبرّة . وهذا كلام منسوب مثله لابن بطّال في شرح «صحيح البخاري» . ولا يخفى أن مساق الحديث لتأكيد البر بالأم إذ قد يقع التفريط في الوفاء بالواجب للأم من الابن اعتماداً على ما يلاقيه من اللين منها بخلاف جانب الأب فإنه قوي ولأبنائه تَوَقَ من شدته عليهم ، فهذا مساق الحديث ولا معنى لأخذه على ظاهره حتى نذهب إلى تجزئة البرّ بين الأم والأب أثلاثاً أو أرباعاً وهو ما استشكله القرافي في «فائدة من الفرق الثالث والعشرين» ، وحسبنا نظم هذه الآية البديع في هذا الشأن .وأما لفظ الحديث فهو مسوق لتأكيد البر بالأم خشية التفريط فيه . وليس معنى «ثُمَّ» فيه إلا محاكاة قول السائل «ثُمَّ مَن» بقرينة أنه عطف بها لفظ الأم في المرتين ولا معنى لتفضيل الأم على نفسها في البر . وإذ كان السياق مسوقاً للاهتمام تعين أن عطف الأب على الأم في المرة الثالثة عطف في الاهتمام فلا ينتزع منه ترجيح عند التعارض . ولعل الرسول عليه الصلاة والسلام علم من السائل إرادة الترخيص له في عدم البرّ . وقد قال مالك لرجل سأله : أن أباه في بلد السودان كتب إليه أن يقدم عليه وأن أمه منعته فقال له مالك : أطِعْ أباك ولا تعْصصِ أمك . وهذا يقتضي إعراضه عن ترجيح جانب أحد الأبوين وأنه متوقف في هذا التعارض ليحمل الابن على ترضية كليهما . وقال الليث : يرجح جانب الأم . وقال الشافعي : يرجح جانب الأب .وجملة { وفصاله في عامين } عطف على جملة { حملتْه أمه } الخ ، فهي في موقع الحال أيضاً . وفي الجملة تقدير ضمير رابط إياها بصاحبها ، إذ التقدير : وفصالها إياه ، فلما أضيف الفصال إلى مفعوله علم أن فاعله هو الأم .والفِصال : اسم للفطام ، فهو فصل عن الرضاعة . وتقدم في قوله { فإن أرادَا فِصالاً } في سورة البقرة ( 233 ) . وذكر الفِصال في معرض تعليل حقية الأم بالبرّ ، لأنه يستلزم الإرضاع من قبل الفِصال ، وللإشارة إلى ما تتحمله الأم من كدَر الشفقة على الرضيع حين فصاله ، وما تشاهده من حزنه وألمه في مبدأ فطامه . وذُكر لمدة فِطامه أقصاها وهو عامان لأن ذلك أنسب بالترقيق على الأم ، وأشير إلى أنه قد يكون الفطام قبل العامين بحرف الظرفية لأن الظرفية تصدق مع استيعاب المظروف جميعَ الظرف ، ولذلك فموقع في أبلغ من موقع ( من ) التبعيضية في قول سبَرة بن عمرو الفقعسي :ونَشْرَب في أثمانها ونُقَامِر ... لأنه يصدق بأن يستغرق الشرابُ والمقامرة كامل أثمان إبله . وقد تقدم ذلك عند قوله تعالى { وارزقوهم فيها واكسوهم } في سورة النساء ( 5 ) . وقد حمله علي بن أبي طالب أوْ ابن عباس على هذا المعنى فأخذ منه أن أقل مدة الحمل ستة أشهر جمعاً بين هذه الآية وآية سورة الأحقاف كما سيأتي هنالك .وجملة أن اشكر لي ولوالديك } تفسير لفعل { وصينا . } و { أن } تفسيرية ، وإنما فُسرت الوصية بالوالدين بما فيه الأمرُ بشكر الله مع شكرهما على وجه الإدماج تمهيداً لقوله { وإن جاهداك على أن تُشْرِك بي } الخ .وجملة { إلي المصير } استئناف للوعظ والتحذير من مخالفة ما أوصى الله به من الشكر له . وتعريف { المصير } تعريف الجنس ، أي مصير الناس كلهم . ولك أن تجعل أل عوضاً عن المضاف إليه . وتقديم المجرور للحصر ، أي ليس للأصنام مصير في شفاعة ولا غيرها .\n\n",
      "translations": [
        {
          "translation": "(And We have enjoined upon man) the reference here is to Sa'd Ibn Abi Waqqas (concerning his parents) that he should be dutiful to them. (His mother beareth him) in her womb (in weakness upon weakness) and hardship upon hardship, the more the child grows in her womb the harder it is for her, (and his weaning is in two years. Give thanks unto Me) through believing in My divine Oneness and by obeying Me (and unto thy parents) by looking after them. (Unto Me is the journeying) your destination and the destination of your parents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَمَلَتْهُ أُمُّهُ وَهْناً } معناه ضُعفٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - exalted be He - { His mother carried him and here } means weakness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والزجر عنه: { وَوَصَّيْنَا ٱلإِنْسَانَ } وألزمنا عليه أولاً بعدما أظهرناه قابلاً لحمل التكاليف المستكملة { بِوَالِدَيْهِ } أي: بإطاعتهما\n وبحفظ آداب المعاشرة والمصاحبة معهما\n ورعاية حقوقها على ما ينبغي ويليق بلا فوت شيء من حقوقهما\n سيما الوالدة المتحملة لأجله أنواع المحن والمشاق\n إذ { حَمَلَتْهُ أُمُّهُ } بواسطة حمله في بدء وجوده { وَهْناً عَلَىٰ وَهْنٍ } أي: ضعفاً على ضعف\n إذ كلما ازداد نشوءه ازداد ضعفها إلى أن انفصل عنها\n وبعد انفصاله تداوم لحفظه وحضانته إلى فطامه { وَفِصَالُهُ } أي: فطامه إنما هو { فِي عَامَيْنِ } وبعد انفطم تلازم أيضاً على حفظه إلى وقت بلوغه\n وبعدما بلغ سن التكليف قلنا له: { أَنِ ٱشْكُرْ لِي } أيها المكلف المتنعم بأنواع النعم مني أصالةً وتسبباً\n لأني خلقتك وأظهرتك من كتم العدم ولم تك شيئاً\n\n{ وَ } اشكر أيضاً { لِوَالِدَيْكَ } \n { وَٱخْفِضْ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحْمَةِ } [الإسراء: 24] لإقامتهما على حفظك وحضانتك إلى أن كبرت\n وبلغت مرتبة أشدك\n وكمال عقلك ورشدك\n واعلم أن شكرك لهما راجع إليَّ أيضاً\n إذ أقدرتهما ومكنتهما على حفظك\n وألقيت محبتك في قلبيهما\n وبالجملة: { إِلَيَّ ٱلْمَصِيرُ } [لقمان: 14] والمرجع في جميع الأفعال الصادرة من العباد ظاهراً\n إذ هم وما صدر عنهم من الأفعال مستندون إلينا أولاً وبالذات\n وكيف لا تُستند أفعالهم إلينا\n إذ جميع ما صدر عنهم تابع لوجوداتهم\n مترتب عليها؟! والحال أنه ليس لهم وجود في أنفسهم\n بل وجوداتهم إنماهي رشحة من رشحات وجود الحق\n وفيء من أضلال أوصافه وأسمائه الذاتية\n\n\n{ وَ } بعدما أكدنا عليكم أيها المكلفون في حفظ حقوق والديكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الجملتان معترضتان بين أجزاء توصية لقمان لابنه\n ووَهْناً: حال من أمه\n أي: حملته حال كونها ذَاتَ وَهْنٍ\n أو من الضمير المنصوب\n أي: حملته نُطْفَةً\n ثم علقة\n\n\n إلخ\n أو مصدر\n أي: تهن وهناً\n يقول الحق جل جلاله: { ووصينا الإنسانَ بوالديه } أن يَبَرَّهُمَا ويُطِيعَهُمَا\n ثم ذكر الحامل على البر فقال: { حَمَلَتْهُ أُمُّه وَهْناً على وَهْنٍ } أي: تضعف ضعفاً فوق ضعف\n أي: يتزايد ضعفها ويتضاعف لأن الحمل\n كلما ازداد وعظم\n ازدادت ثِقلاً\n { وفِصَالهُ في عامين } أي: فطامه لتمام عامين\n وهذا أيضاً مما يهيج الولد على بر والديه\n فيتذكر مَرْقده في بطن أمه\n وتعبَها معه في مدة حَمْلِةِ\n ثم ما قاست من وجع الطلق عند خروجه\n ثم ما عالجته في أيام رضاعه من تربيته\n وغسل ثيابه\n وسهر الليل في بكائه\n إلى غير ذلك\n { أن اشكر لي ولوالديك } \n هو تفسير لِوَصَّينَا\n أو على حذف الجار\n أي: وصيناه بشكرنا وبشكر والديه\n وقوله: { حملته أمه\n\n } إلخ: اعتراض بين المفسَّر والمفسِّر\n لأنه لَمَّا وصى بالوالدين\n ذكر ما تُكابده وتُعاينه من المشاق في حمله وفصاله\n هذه المدة الطويلة تذكيراً لحقها\n مفرداً\n وعن ابن عُيَيْنَةَ: من صلى الصلوات الخمس فقد شكر الله\n ومن دعا للوالدين\n في أدبار الصلوات الخمس\n فقد شكرهما\n هـ\n وقال القشيري: والإجماع على أن شكر الوالدين بدوام طاعتهما\n ثم قال: فشكرُ الحقِّ بالتعظيم والتكبير\n وشكرُ الوالدين بالإشفاق والتوقير\n هـ\n ثم قال تعالى: { إليَّ المصيرُ } فأحاسبك على شكرك\n أو كفرك\n { وإن جاهداك على أن تُشرك بي ما ليس لك به عِلْمٌ } \n أراد بنفي العلم به نفيَه من أصله\n أي: أن تشرك بي ما ليس بشيء\n أو: ما ليس لك به علم باستحقاقه الإشراك مع الله\n بل تقليداً لهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:126",
      "similarity": 0.4344099071998772
    },
    {
      "verse": "8:18",
      "similarity": 0.42059827347415657
    },
    {
      "verse": "3:139",
      "similarity": 0.41382877259329937
    },
    {
      "verse": "4:104",
      "similarity": 0.3925442497480756
    },
    {
      "verse": "29:14",
      "similarity": 0.31811388800608414
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}