{
  "chapter": "لقمان",
  "text": "يبنى اقم الصلوة وامر بالمعروف وانه عن المنكر واصبر على ما اصابك ان ذلك من عزم الامور",
  "translations": [
    {
      "translation": "My son, establish salat and command what is right and forbid what is wrong and be steadfast in the face of all that happens to you. That is certainly the most resolute course to follow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son, fulfil your moral obligations, bid what is known to be right and forbid what is wrong, and bear with patience what befalls you. These are indeed acts of courage and resolve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Son, establish Prayer, enjoin all that is good and forbid all that is evil, and endure with patience whatever affliction befalls you. Surely these have been emphatically enjoined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My son, be steadfast in prayer. Make others do good. Prevent them from doing evil. Be patient in hardship. Patience comes from faith and determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my son! Keep the prayer established, and enjoin goodness and forbid from evil, and be patient upon the calamity that befalls you; indeed these are acts of great courage.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! Perform the Salah, enjoin the good, and forbid the evil, and bear with patience whatever befalls you. Verily, these are some of the important commandments.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! keep up prayer and enjoin the good and forbid the evil, and bear patiently that which befalls you; surely these acts require courage;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son, perform the prayer, and bid unto honour, and forbid dishonour. And bear patiently whatever may befall thee; surely that is true constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my dear son! Establish worship and enjoin kindness and forbid iniquity, and persevere whatever may befall thee. Lo! that is of the steadfast heart of things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my dear son! Say your prayers regularly, and enjoin good, and forbid evil, and endure patiently whatever may befall you. Surely, this is something which requires firm resolve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My son! establish prayer and command that which is reputable and forbid iniquity, and bear patiently whatsoever may befall thee; verily that is of the firmness of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! Maintain the prayer and bid what is right and forbid what is wrong, and be patient through whatever may befall you. That is indeed the steadiest of courses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! establish regular prayer, enjoin what is just, and forbid what is wrong: and bear with patient constancy whatever betide thee; for this is firmness (of purpose) in (the conduct of) affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son! Aqim-is-Salat (perform As-Salat), enjoin (people) for Al-Ma'ruf (Islamic Monotheism and all that is good), and forbid (people) from Al-Munkar (i.e. disbelief in the Oneness of Allah, polytheism of all kinds and all that is evil and bad), and bear with patience whatever befall you. Verily! These are some of the important commandments ordered by Allah with no exemption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My son, establish the prayer, order with honor but forbid dishonor, and bear patiently with whatever may fall upon you, indeed that is true constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son, observe the prayer, advocate righteousness, forbid evil, and be patient over what has befallen you. These are of the most honorable traits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my son, establish prayer, enjoin what is right, forbid what is wrong, and be patient over what befalls you. Indeed, [all] that is of the matters [requiring] determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:17] O my son! Establish prayer and enjoin decency and forbid indecency. And be patient through whatever may befall you, as a result of such enjoining and forbidding. Truly that, which is mentioned, is true constancy, in other words, that is one of those necessary things regarding which one must have firm resolve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my dear son! Establish worship) perform the prescribed prayer (and enjoin kindness) through the profession of Allah's divine Oneness and beneficence (and forbid iniquity) idolatry and foul words and deeds, (and persevere whatever may befall thee) throughout. (Lo! That) i.e. enjoining good and forbidding evil; it is also said that this refers to steadfastness (is of the steadfast heart of things) of the best and most resolute of things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولطافة إطلاعه وخبرته { أَقِمِ ٱلصَّلاَةَ } أي: دوام ميلك نحوه بجميع أركان وجوارحك مخلصاً في ميلك ورجوعك إليه سبحانه\n محرماً على نفسك جميع ما يشغلك عن ربك\n مجرداً عارياً قلبك عن جميع منسوباتك ومقتضيات بشريتك ولوازم هويتك { وَأْمُرْ } يا بني على بني نوعك أولاً إن قصدت تكميلهم وإرشادهم إلى مقصد التوحيد { بِٱلْمَعْرُوفِ } المستحسن عقلاً وشرعاً\n وكلم معهم على قدر عقولهم بلا إغراء ولا إغواء\n ولا تفش عليهم سر التوحيد ما لم يستحقوا لحفظه\n ولم يستعدوا له قبوله { وَٱنْهَ عَنِ ٱلْمُنْكَرِ } المستهجن عقلاً وشرعاً\n وعادةً ومرءوةً\n ونبههم على وجه القبح والهجنة\n وألطف معهم في تبيينها لعلهم يتفطنون بمقتضى فطرتهم التي فطروا عليها في بدء الأمر\n\n\n{ وَ } بالجملة: { ٱصْبِرْ عَلَىٰ مَآ أَصَابَكَ } في تمشية سلوك التوحيد\n وتقوية طريقه\n وكن متحملاً على مشاق الطاعات ومتاعب العبادات\n وارض من ربك بجميع ما جرى عليك\n وثبت لك في لوح قضائه { إِنَّ ذَلِكَ } المذكور\n أي: كل واحد من الأمور المذكورة والخصائل المأمورة { مِنْ عَزْمِ ٱلأُمُورِ } [لقمان: 17] أي: من الأمور التي عم الحق عليها\n وأوجبها على أولي العزائم الصحيحة من خلَّص عباده إرشاداً لهم إلى وحدة ذاته\n وزلال هدايته الصافية عن كدر الضلالات والجهالات\n\nوكن يا بني في تمدنك ومعاشرتك مع بني نوعك ليناً هيناً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأْمُر بالمعروف وَانْهَ عن المنكر } تكميلاً لغيرك\n { واصبرْ على ما أصابك } في ذات الله تعالى\n إذا أمرت بالمعروف\n ونهيت عن المنكر فإن فعل ذلك تعرض للأذى\n أو: على ما أصابك من الشدائد والمحن فإنها تورث المنح والمنن\n { إِن ذلك } الذي وصيتك به\n { من عزم الأمور } أي: مما عزمه الله من الأمور\n أي: قَطَعَه قطع إيجاب وإلزام\n أي: أمر به أمراً حتماً\n وهو مصدر بمعنى المفعول\n أي: من معزومات الأمور\n أي: مقطوعاتها ومفروضاتها\n وفيه دليل على أن هذه الطاعات كانت مأموراً بها في سائر الأمم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:43",
      "similarity": 0.6997298935715285
    },
    {
      "verse": "47:21",
      "similarity": 0.6638650453767349
    },
    {
      "verse": "2:227",
      "similarity": 0.556178992608181
    },
    {
      "verse": "3:186",
      "similarity": 0.5224206246672092
    },
    {
      "verse": "20:115",
      "similarity": 0.48412406630479204
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/31:17.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/31:17.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/31:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}