{
  "chapter": "لقمان",
  "text": "ولقد ءاتينا لقمن الحكمة ان اشكر لله ومن يشكر فانما يشكر لنفسه ومن كفر فان الله غنى حميد",
  "translations": [
    {
      "translation": "We aave Luaman wisdom: 'Give thanks to Allah. Whoever aives thanks onlv does so to his own aood. Whoever is ungrateful, Allah is Rich Beyond Need, Praiseworthy.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed wisdom on Luqman that he may be grateful to God. Whosoever is grateful is so for his own good, and whoever is ungrateful (should remember) that God is above all concern, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed wisdom upon Luqman, (enjoining): “Give thanks to Allah.” Whoso gives thanks to Allah, does so to his own good. And whoso disbelieves (let him know that) Allah is All-Sufficient, Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave wisdom to Luqman so that he would give thanks to God. Those who give thanks to God do so for their own good. Those who are ungrateful should know that God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed wisdom to Luqman (saying) that, “Be grateful to Allah”; and whoever is grateful, is grateful for his own good; and whoever is ungrateful – then indeed Allah is the Absolute, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed upon Luqman Al-Hikmah saying: \"Give thanks to Allah.\" And whoever gives thanks, he gives thanks for (the good of) himself. And whoever is unthankful, then verily, Allah is All-Rich, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave wisdom to Luqman, saying: Be grateful to Allah. And whoever is grateful, he is only grateful for his own soul; and whoever is ungrateful, then surely Allah is Self-sufficient, Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave Lokman wisdom: 'Give thanks to God. Whosoever gives thanks gives thanks only for his own soul's good, and whosoever is ungrateful -- surely God is All-sufficient, All-laudable.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We gave Luqman wisdom, saying: Give thanks unto Allah; and whosoever giveth thanks, he giveth thanks for (the good of) his soul. And whosoever refuseth - Lo! Allah is Absolute, Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed wisdom on Luqman, saying, \"Be grateful to God: he who is grateful, is grateful only for the good of his own soul. But if anyone is ungrateful, then surely God is self-sufficient and praiseworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Luqman Wisdom, saying: give thanks unto Allah; and whosoever giveth thanks giveth thanks for his soul; and whosoever is unthankful--then verily Allah is self-sufficient, praiseworthy\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Luqman wisdom, saying, ‘Give thanks to Allah; and whoever gives thanks, gives thanks only for his own sake. And whoever is ungrateful, [let him know that] Allah is indeed all-sufficient, all-laudable.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we bestowed (in the past) Wisdom on Luqman: \"Show (thy) gratitude to Allah.\" Any who is (so) grateful does so to the profit of his own soul: but if any is ungrateful, verily Allah is free of all wants, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed upon Luqman Al-Hikmah (wisdom and religious understanding, etc.) saying: \"Give thanks to Allah,\" and whoever gives thanks, he gives thanks for (the good of) his ownself. And whoever is unthankful, then verily, Allah is All-Rich (Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave wisdom to Lokman (saying): 'Give thanks to Allah. He who gives thanks, thanks only for himself, but whosoever is ungrateful, surely, Allah is the Rich, the Praised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We endowed Luqman with wisdom: “Give thanks to God.” Whoever is appreciative—is appreciative for the benefit of his own soul. And whoever is unappreciative—God is Sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly given Luqman wisdom [and said], \"Be grateful to Allah.\" And whoever is grateful is grateful for [the benefit of] himself. And whoever denies [His favor] - then indeed, Allah is Free of need and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:12] And verily We gave Luqmān wisdom, comprising knowledge, religiousness, and right-mindedness in speech; his many wisdoms are well-known. He used to give legal opinions [in matters of religion] before David was summoned [to prophethood], but lived on into the latter’s summoning. He then took to acquiring knowledge from him [David] and refrained from giving [any more] legal opinions, explaining this thus: ‘Should I not be content if someone [like the prophet David] has spared me the trouble?’ He was once asked, ‘What is the worst kind of person?’ He said, ‘The one who does not care that people should see him doing evil’. In other words, [We gave him wisdom] and We said to him: ‘Give thanks to God, for the wisdom that He has given you. Whoever gives thanks only for his own sake, because the reward for his gratitude shall be his, and whoever is ungrateful, for a grace, then surely God is Independent, [without need] of His creation, Praised’, in what He does.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَقَدْ آَتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ وَمَنْ يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَمِيدٌ (12)الواو عاطفة قصة لقمان على قصة النضر بن الحارث المتقدمة في قوله تعالى { ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله } \\[ لقمان : 6 \\] باعتبار كونها تضمنت عجيب حاله في الضلالة من عنايته بلهو الحديث ليضل عن سبيل الله ويتخذ سبيل الله هزؤاً ، وباعتبار كون قصة لقمان متضمنة عجيب حال لقمان في الاهتداء والحكمة ، فهما حالان متضادان؛ فقُطِع النظر عن كون قصة النضر سيقت مساق المقدمة والمدخل إلى المقصود لأن الكلام لما طال في المقدمة خرجت عن سَنن المقدمات إلى المقصودات بالذات فلذلك عطفت عطفَ القصص ولم تُفصل فَصْل النتائج عقب مقدماتها . وقد تتعدد الاعتبارات للأسلوب الواحد فيتخير البليغ في رعيها كقوله تعالى { يسومونكم سوء العذاب يذبحون أبناءكم } في سورة البقرة ( 49 ) ، { ويذبحون أبناءكم } في سورة \\[ إبراهيم : 1 \\] . وافتتاح القصة بحرفي التوكيد : لام القسم و ( قد ) للإنباء بأنها خبر عن أمر مهم واقع .و { لقمان } اسم رجل حكيم صالح ، وأكثر الروايات في شأنه التي يعضد بعضها وإن كانت أسانيدها ضعيفة تقتضي أنه كان من السود ، فقيل هو من بلاد النوبة ، وقيل من الحبشة .وليس هو لقمان به عاد الذي قال المثل المشهور : إحدى حُظيات لقمان . والذي ذكره أبو المهوش الأسدي أو يزيد بن عمر يصعق في قوله :تراه يطوف الآفاق حرصاً ... ليأكل رأس لقمان بن عادويعرف ذلك بلقمان صاحب النسور ، وهو الذي له ابن اسمه لقيم وبعضهم ذكر أن اسم أبيه باعوراء ، فسبق إلى أوهام بعض المؤلفين أنه المسمى في كتب اليهود بلعام بن باعوراء المذكور خبره في «الإصحاحين» ( 22 و23 ) من «سفر العدد» ، ولعل ذلك وهَم لأن بلعام ذلك رجل من أهل مَدْيَن كان نبيئاً في زمن موسى عليه السلام ، فلعل التوهم جاء من اتحاد اسم الأب ، أو من ظن أن بلعام يرادف معنى لقمان لأن بلعام من البلع ولقمان من اللّقم فيكون العرب سموه بما يرادف اسمه في العبرانية . وقد اختلف السلف في أن لقمان المذكور في القرآن كان حكيماً أو نبيئاً . فالجمهور قالوا : كان حكيماً صالحاً . واعتمد مالك في «الموطأ» على الثاني ، فذكره في «جامع الموطأ» مرتين بوصف لقمان الحكيم ، وذلك يقتضي أنه اشتهر بذلك بين علماء المدينة . وذكر ابن عطية : أن ابن عمر قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" لم يكن لقمان نبيئاً ولكن كان عبداً كثير التفكر حسنَ اليقين أحبَّ الله تعالى فأحبه فمنَّ عليه بالحكمة \" ويظهر من الآيات المذكورة في قصته هذه أنه لم يكن نبيئاً لأنه لم يمتن عليه بوحي ولا بكلام الملائكة . والاقتصارُ على أنه أوتي الحكمة يومىء إلى أنه أُلهم الحكمة ونطق بها ، ولأنه لما ذكر تعليمه لابنه قال تعالى{ وهو يعظه } \\[ لقمان : 13 \\] وذلك مؤذن بأنه تعليم لا تبليغ تشريع .وذهب عكرمة والشعبي : أن لقمان نبيء ولفظ الحكمة يسمح بهذا القول لأن الحكمة أطلقت على النبوءة في كثير من القرآن كقوله في داود { وءاتيناه الحكمة وفصلَ الخطاب } \\[ ص : 20 \\] . وقد فسرت الحكمة في قوله تعالى { ومن يُؤْت الحكمة فقد أوتي خيراً كثيراً } \\[ البقرة : 269 \\] بما يشمل النبوءة . وأن الحكمة «معرفة حقائق الأشياء على ما هي عليه» وأعلاها النبوءة لأنها علم بالحقائق مأمون من أن يكون مخالفاً لما هي عليه في نفس الأمر إذ النبوءة متلقاة من الله الذي لا يعزب عن عمله شيء . وسيأتي أن إيراد قوله تعالى { ووصينا الإنسان بوالديه } \\[ لقمان : 14 \\] في أثناء كلام لقمان يساعد هذا القول .وذكر أهل التفسير والتاريخ أنه كان في زمن داود . وبعضهم يقول : إنه كان ابن أخت أيوب أو ابن خالته ، فتعين أنه عاش في بلاد إسرائيل . وذكر بعضهم أنه كان عبداً فأعتقه سيده ، وذكر ابن كثير عن مجاهد : أن لقمان كان قاضياً في بني إسرائيل في زمان داود عليه السلام ، ولا يوجد ذكر ذلك في كتب الإسرائيليين . قيل كان راعياً لغنم وقيل كان نجاراً وقيل خياطاً . وفي «تفسير ابن كثير» عن ابن وهب أن لقمان كان عبداً لبني الحسحاس وبنو الحسحاس من العرب وكان من عبيدهم سحيم العبد الشاعر المخضرم الذي قتل في مدة عثمان .وحكمة لقمان مأثورة في أقواله الناطقة عن حقائق الأحوال والمقرّبة للخفيات بأحسن الأمثال . وقد عني بها أهل التربية وأهل الخير ، وذكر القرآن منها ما في هذه السورة ، وذكر منها مالك في «الموطأ» بلاغين في كتاب «الجامع» وذكر حكمة له في كتاب «جامع العتبية» وذكر منها أحمد بن حنبل في «مسنده» ولا نعرف كتاباً جمع حكمة لقمان . وفي «تفسير القرطبي» قال وهب بن منبه : قرأت من حكمة لقمان أرجح من عشرة آلاف باب . ولعل هذا إن صح عن وهب بن منبه كان مبالغة في الكثرة .وكان لقمان معروفاً عند خاصة العرب . قال ابن إسحاق في «السيرة» : قدم سويد بن الصامت أخو بني عمرو بن عوف مكة حاجّاً أو معتمراً فتصدى له رسول الله صلى الله عليه وسلم فدعاه إلى الإسلام فقال له سويد : فلعل الذي معك مثل الذي معي؟ فقال له رسول الله صلى الله عليه وسلم وما الذي معك؟ قال : مجلة لقمان . فقال له رسول الله صلى الله عليه وسلم اعرِضها عليّ ، فعرضها عليه ، فقال : إن هذا الكلام حسن والذي معي أفضل من هذا قرآن أنزله الله . قال ابن إسحاق : فقدم المدينة فلم يلبث أن قتلته الخزرج وكان قتله قبل يوم بعاث . وكان رجال من قومه يقولون : إنّا لنراه قد قتل وهو مسلم وكان قومه يدْعُونه الكامل اه . وفي «الاستيعاب» لابن عبد البر : أنا شَاكّ في إسلامه كما شك غيري .وقد تقدم في صدر الكلام على هذه السورة أن قريشاً سألوا رسول الله صلى الله عليه وسلم عن لقمان وابنه وذلك يقتضي أنه كان معروفاً للعرب . وقد انتهى إليّ حين كتابة هذا التفسير من حِكَم لقمان المأثورة ثمان وثلاثون حكمةً غير ما ذكر في هذه الآية وسنذكرها عند الفراغ من تفسير هذه الآيات .والإيتاء : الإعطاء ، وهو مستعار هنا للإلهام أو الوحي .و { لقمان } : اسم علَم مَادته مادة عربية مشتق من اللَّقْم ، والأظهر أن العرب عربوه بلفظ قريب من ألفاظ لغتهم على عادتهم كما عربوا شاول باسم طالوت وهو ممنوع من الصرف لزيادة الألف والنون لا للعجمة .وتقدم تعريف الحكمة عند قوله تعالى { يؤتي الحكمة من يشاء } في سورة البقرة ( 269 ) ، وقوله { ادع إلى سبيل ربك بالحكمة } في سورة النحل ( 125 ) .وأنْ } في قوله { أن اشكر لله } تفسيرية وليست تفسيراً لفعل { ءاتينا } لأنه نصب مفعوله وهو الحكمة ، فتكون { أنْ } مفسرة للحكمة باعتبار أن الحكمة هنا أقوال أوحيت إليه أو ألهمها فيكون في الحكمة معنى القول دون حروفه فيصلح أن تُفسر ب { أنْ } التفسيرية ، كما فسرت حاجة في قول الشاعر الذي لم يُعرف وهو من شواهد العربية :إنْ تحملا حاجة لي خفّ محملها ... تستوجبا منة عندي بها ويَداأنْ تقرءان علي أسماء ويحكما ... مني السلامَ وأن لا تُخبرا أحداوالصوفية وحكماء الإشراق يرون خواطرَ الأصفياء حجة ويسمونها إلهاماً . ومال إليه جمّ من علمائنا . وقد قال قطب الدين الشيرازي في «ديباجة شرحه على المفتاح» : أما بعد إني قَد ألقي إليَّ على سبيل الإنذار ، من حضرة الملك الجبار ، بلسان الإلهام ، إلاَّ كوَهَم من الأوهام ، ما أورثني التجافيَ عن دار الغرور ، والإنابة إلى دار السرور ، الخ .وكان أول ما لُقنه لقمان من الحكمة هو الحكمة في نفسه بأن أمره الله بشكره على ما هو محفوف به من نعم الله التي منها نعمة الاصطفاء لإعطائه الحكمة وإعداده لذلك بقابليته لها . وهذا رأس الحكمة لتضمنه النظر في دلائل نفسه وحقيقته قبل النظر في حقائق الأشياء وقبل التصدي لإرشاد غيره ، وأن أهم النظر في حقيقته هو الشعور بوجوده على حالة كاملة والشعور بموجده ومفيض الكمال عليه ، وذلك كله مقتض لشكر موجده على ذلك . وأيضاً فإن شكر الله من الحكمة ، إذ الحكمة تدعو إلى معرفة حقائق الأشياء على ما هي عليه لقصد العمل بمقتضى العلم ، فالحكيم يبث في الناس تلك الحقائق على حسب قابلياتهم بطريقة التشريع تارة والموعظة أخرى ، والتعليم لقابليه مع حملهم على العمل بما علموه من ذلك ، وذلك العمل من الشكر إذ الشكر قد عُرف بأنه صرف العبد جميع ما أنعم الله به عليه من مواهب ونِعم فيما خلق لأجله؛ فكان شكر الله هو الأهم في الأعمال المستقيمة فلذلك كان رأس الحكمة لأن من الحكمة تقديم العلم بالأنفع على العلم بما هو دونه؛ فالشكر هو مبدأ الكمالات علماً ، وغايتها عملاً .وللتنبيه على هذا المعنى أعقب الله الشكر المأمور به ببيان أن فائدته لنفس الشاكر لا للمشكور بقوله { ومَن يشكر فإنما يشكر لنفسه } لأن آثار شكر الله كمالات حاصلة للشاكر ولا تنفع المشكور شيئاً لغناه سبحانه عن شكر الشاكرين ، ولذلك جيء به في صورة الشرط لتحقيق التعلق بين مضمون الشرط ومضمون الجزاء ، فإن الشرط أدل على ذلك من الإخبار . وجيء بصيغة حصر نفع الشكر في الثبوت للشاكر بقوله { فإنما يشكر لنفسه } أي ما يشكر إلا لفائدة نفسه ، ولام التعليل مؤذنة بالفائدة . وزيد ذلك تبيناً بعطف ضده بقوله { ومَن كفر فإن الله غنيّ حميد } لإفادة أن الإعراض عن الشكر بعد استشعاره كفر للنعمة وأن الله غنيّ عن شكره بخلاف شأن المخلوقات إذ يكسبهم الشكر فوائد بين بني جنسهم تجر إليهم منافع الطاعة أو الإعانة أو الإغناء أو غير ذلك من فوائد الشكر للمشكورين على تفاوت مقاماتهم ، والله غني عن جميع ذلك ، وهو { حميد } ، أي : كثير المحمودية بلسان حال الكائنات كلها حتى حال الكافر به كما قال تعالى { ولله يسجد مَن في السماوات والأرض طوعاً وكرهاً } سورة الرعد ( 15 ) .ومن بلاغة القرآن وبديع إيجازه أن كان قوله أن اشكر لله } جامعاً لمبدأ الحكمة التي أوتيها لقمان ، ولأمره بالشكر على ذلك ، فقد جمع قوله { أن اشكر لله } الإرشاد إلى الشكر ، مع الشروع في الأمر المشكور عليه تنبيهاً على المبادرة بالشكر عند حصول النعمة . وإنما قوبل الإعراض عن الشكر بوصف الله بأنه حميد لأن الحمد والشكر متقاربان ، وفي الحديث : « الحَمدُ رأس الشكر » فلما لم يكن في أسماء الله تعالى اسم من مادة الشكر إلا اسمه الشكور وهو بمعنى شاكر ، أي : شاكر لعباده عبادتَهم إياه عُبر هنا باسمه { حميد } . وجيء في فعل { يشكر } بصيغة المضارع للإيماء إلى جدارة الشكر بالتجديد .واللام في قوله { أن اشكر لي } \\[ لقمان : 14 \\] داخلة على مفعول الشكر وهي لام ملتزم زيادتها مع مادة الشكر للتأكيد والتقوية ، وتقدم في قوله { واشكُرُوا لي } في سورة البقرة ( 152 ) .\n\n",
      "translations": [
        {
          "translation": "(And verily We gave Luqman wisdom) knowledge, understanding and right words and actions, (saying: Give thanks unto Allah) by declaring His Oneness and obeying Him; (and whosoever giveth thanks) for His blessings through declaring His divine Oneness and obeying Him, (he giveth thanks for (the good of) his soul) for the reward of his soul. (And whosoever refuseth) and whoever is ungrateful towards His blessings, (lo! Allah is Absolute) free of need for his thanks, (Owner of Praise) for His actions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ آتَيْنَا لُقْمَانَ ٱلْحِكْمَةَ } معناهُ الفِقهُ، والإِصابةُ في القَولِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - \"And We had given Luqman wisdom\" - its meaning is the Fiqh, and being affected by the saying.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه عن سبيل إظهار الفضل الامتنان\n والتفرد بمقتضى الألوهية والربوبية: { وَلَقَدْ آتَيْنَا } من مقام عظيم لطفنا وجودنا { لُقْمَانَ } بن باعورا بن ناخور بن آزر\n فكان ابن أخت أيوب عليه السلام أو ابن خالته\n وعاش إلى أن أدرك داوود عليه السلام فأخذ منه العلم و { ٱلْحِكْمَةَ } وهي عبارة عن اعتدال الأوصاف الجبلية المودعة في النفوس البشرية على مقتضى الفطرة الأصلية\n والتخلق بالأخلاق المرضية المنشئة من الأوصاف الذاتية الإلهية\n وقلنا له بعدما أنعمنا عليه نعمة الحكمة\n وأعددناه لقبول فيضان أنواع اللطف والكرامات: { أَنِ ٱشْكُرْ للَّهِ } واصرف بمقتضى الحكمة الموهوبة لك من عندنا جميع ما أعطيناك من النعم العظام على ما جبلنا لأجله\n لتكون من زمرة الشاكرين المواظبين على أداء حقوق جودنا وكرمنا\n ومن جملة المطيعين لمقتضيات حكمتنا وأحكامنا\n\n\n{ وَ } أعلم أيها المجبول على الحكمة الفطرية أنه { مَن يَشْكُرْ } نعمنا عاد على نفسه فوائد كرمنا { فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ } إذ فائدة شكره عائدة إليه\n مزيدة لنعمنا إياه\n مستجبلة لأنواع لطفنا وإحساننا معه { وَمَن كَفَرَ } لنعمنا من خبث طينته\n وأعرض عن أداء حقوق كرمنا إياه\n فوبال كفرانه أيضاً عائد إلى نفسه\n إذ عندنا الشكر والكفر سيان\n ونحن منزهون عن الربح والخسران { فَإِنَّ ٱللَّهَ } المتجلي على عموم الأنفس والآفاق بالاستحقاق { غَنِيٌّ } بذاته عن جميع صور إحسان عباده معه { حَمِيدٌ } [لقمان: 12] هو في ذاته باعتبار أوصافه الذاتية الظاهرة آثارها على صفائح الأكوان والمكونات\n المتجهة نحو مبدعها\n المثنية له حالاً ومقالاً\n سراً وجهاراً\n\n\n{ وَ } اذكر يا أكمل الرسل لمن تبعك من المؤمنين معناه تذكيراً لهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يا بُني فيه ثلاث قراءات كسر الياء\n وفتحها مُشَدَّدةً\n وإسكانها\n وقد تتبعنا توجيهاتها في كتابنا \" الدرر الناثرة في توجيه القراءات المتواترة \"\n يقول الحق جل جلاله: { ولقد آتينا لقمان الحكمةَ } وهو لقمان بن باعوراء ابن أخت أيوب\n أو ابن خالته\n وقيل: كان من أولاد آزر\n وقيل: أخو شداد بن عاد\n أُعطى شداد القوة\n وأُعطى لقمان الحكمة\n وعاش ألف سنة\n وقيل: أكثر\n وسيأتي\n وأدرك داود عليه السلام\n وأخذ منه العلم\n وكان يُفتي قبل مبعث داود\n فلما بُعث قطع الفتوى\n فقيل له في ذلك؟ فقال: ألا أكتفي إذا كُفيت\n وقيل: كان خياطاً\n وقيل: نجاراً\n وقيل: راعياً\n وقيل: كان قاضياً في بني إسرائيل\n وقال عكرمة والشعبي: كان نبياً\n والجمهور على أنه كان حكيماً فقط\n وقد خُير بين النبوة والحكمة فاختار الحكمة\n وهي الإصابة في القول والعمل\n وقيل: تتلمذ لألف نبي وتتلمذ له ألف نبي\n قاله النسفي\n قال ابن عمر: سمعت النبي صلى الله عليه وسلم يقول:\n \" لم يكن لقمان نبياً ولكن كان عبداً كثير التفكر\n حسن اليقين\n أحب الله فأحبه\n فمنَّ عليه بالحكمة\n كان قائماً فجاءه نداء: يا لقمان\n هل لك أن يجعلك الله خليفة في الأرض\n تحكم بين الناس بالحق؟ فأجاب الصوت\n فقال: إن خيرني ربي قبلت العافية\n وإن عزم عليّ فسمعاً وطاعة\n فإني أعلم إن فعل ذلك بي عصمني وأعانني\n قالت الملائكة بصوت ولا يراهم: لِمَ يا لقمان؟ فقال: لأن الحاكم بأشد المنازل وأكدرها\n يغشاه الظلم من كل مكان\n إن يُعَن\n فالبحري أن ينجو\n وإن أخطأ أخطأ طريق الجنة\n ومن يكن في الدنيا ذليلاً\n خير من أن يكون شريفاً\n ومن يختر الدنيا على الآخرة تفُته الدنيا\n ولا يصيب الآخرة\n فعجبت الملائكة من حسن منطقه\n فنام نومة فأُعطى الحكمة\n فانتبه وتكلم بها \" \nهـ\n قال مجاهد: كان لقمان عبداً أسود\n عظيم الشفتين\n مُشققَّ القدمين\n زاد في اللباب: وكانت زوجته من أجمل أهل زمانها\n قيل: لم يزل لقمان\n ومن زمن داود مظهراً للحكمة والزهد\n إلى أيام يونس بن متى\n وكان قد عَمَّرَ عُمر سبعة أنسر\n فكان آخر نسوره \" لبذ \"\n رُوي أنه أخذ نسراً صغيراً فربّاه\n وكان يصرفه في حوائجه\n فعاش ذلك النسر ألف سنة ومات\n ثم أخذ نسراً آخر\n فعاش خمسمائة سنة\n ثم أخذ آخر\n فعاش مثل ذلك\n إلى السابع\n عاش خمسمائة سنة\n واسمه لبذ\n فقال له لقمان يوماً: يا لبذ انهض إلى كذا\n فأراد النهوض فلم يستطع\n وإذا بوتر لقمان قد اختلج\n وكان لم يألم قط\n فنادى بأهله وعشيرته\n وعلم أن أجله قد قرب\n وقال: إن أجلي قد حضر بموت هذا النسر\n كما أعلمني ربي\n فإذا مت فلا تدفنوني في الكهوف والمقابر\n كما [تدفنون] الجبابرة\n ولكن ادفنوني في ضريح الارض\n فدفنوه كما أوصاهم\n فقال ابن ثعلبة:\n\nقال البيضاوي: والحكمة في عرف العلماء: استكمال النفس الإنسانية باقتباس العلوم النظرية واكتساب الْمَلَكَةِ التامة على الأفعال الفاضلة على قدر طاقتها\n ومن حكمته أنه صحب داود شهوراً\n وكان يسرد الدرع\n فلم يسأله عنها\n فلما أتمها لبسها\n فقال: نِعْمَ لبوسُ الحرب أنتِ\n فقال: الصمت حكمة وقليل فاعله\n وأن داود قال له يوماً: كيف أصبحت؟ فقال: أصبحت في يَدَيْ غيري\n وأنه أمر لقمان بأن يذبح شاة ويأتيه بأطيب مُضْغَتين منها\n فأتى باللسان والقلب\n ثم بعد أيام أمر بأن يأتي بأخبث مضغتين منها فأتى بهما أيضاً فسأله عن ذلك فقال: هما أطيب شيء إذا طابا وأخبث شيء إذا خبثا\n والذي عند الثعلبي: أن الآمر له بإتيان المضغتين سيدهُ\n لا داود عليه السلام قيل له: بِمَ نلت هذه الحكم\n وقد كنت راعياً؟ فقال بصدق الحديث\n وأداء الأمانة\n وترك ما لا يعنيني\n هـ\n قال صلى الله عليه وسلم:\n \" أول ما رؤى من حكمة لقمان: أن مولاه أطال الجلوس في المخرج\n فناداه لقمان: إن الجلوس على الحاجة ينخلع منه الكبد\n ويورث الباسور\n ويُصعد الحرارة إلى الرأس\n فاجلس هويناً\n وقم هويناً \" \nوروي أنه قَدِمَ من سفر\n فقيل له: مات أبوك\n فقال: الحمد لله\n ملكتُ أمري\n فقيل له: ماتت امرأتك\n فقال: الحمد لله جُدِّدَ فراشي\n فقيل له: ماتت أختك\n فقال: سُترت عورتي\n فقيل له: مات أخوك\n فقال: انقطع ظهري\n هـ\n و \" أَنْ \" - في قوله: { أن أشكر }: مفسرة لأنَّ إيتاء الحكمة في معنى القول\n أي: وقلنا له اشكر الله على ما أعطاك من الحكمة\n وفيه تنبيه على أن الحكمة الأصلية والعلم الحقيقي هو العمل بهما\n وعبادةُ الله والشكر له\n حيث فسر الحكمة بالحث على الشكر\n وقيل: لا يكون الرجل حكيماً حتى يكون حليماً في قوله وفعله ومعاشرته وصُحبته\n وقال الجنيد: الشكر: ألا يُعْصَى اللهُ بنعمه\n وقال أيضاً: ألا ترى مع الله شريكاً في نعمه\n وقيل: هو الإقرار بالعجز عن الشكر\n والحاصل: أن شكر القلب: المعرفة\n وشكر اللسان: الحمد\n وشكر الأركان: الطاعة\n ورؤية العجز في الكل دليل القبول\n { ومن يشكرْ فإنما يشكر لنفسه } لأن منفعته تعود عليه\n لأنه يريد المزيد\n { ومن كفرَ فإِنَّ الله غنيٌّ } غير محتاج إلى شكر أحد\n { حميد } حقيق بأن يُحمد\n وإن لم يَحْمَدْهُ أحد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:13",
      "similarity": 0.8800093769871827
    },
    {
      "verse": "64:6",
      "similarity": 0.11575962265388845
    },
    {
      "verse": "4:131",
      "similarity": 0.1129157265324113
    },
    {
      "verse": "14:8",
      "similarity": 0.10989907633905781
    },
    {
      "verse": "22:64",
      "similarity": 0.1046534577437421
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}