{
  "chapter": "لقمان",
  "text": "ووصينا الانسن بولديه حملته امه وهنا على وهن وفصله فى عامين ان اشكر لى ولولديك الى المصير",
  "translations": [
    {
      "translation": "We have instructed man concerning his parents. Bearing him caused his mother great debility and the period of his weaning was two years: 'Give thanks to Me and to your parents. I am your final destination.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have committed man about his parents. His mother carries him in her womb in weakness and debility, weaning him in two years. So he should be grateful to Me and his parents. To Me is the journeying back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We enjoined upon man to be dutiful to his parents. His mother bore him in weakness upon weakness, and his weaning lasted two years. (We, therefore, enjoined upon him): “Give thanks to Me and to your parents. To Me is your ultimate return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Concerning his parents), We advised the man, whose mother bears him with great pain and breast-feeds him for two years, to give thanks to Me first and then to them, to Me all things proceed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We ordained upon man concerning his parents; his mother bore him enduring weakness upon weakness, and his suckling is up to two years – therefore be thankful to Me and to your parents; finally towards Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man (to be dutiful and good) to his parents. His mother bore him in weakness and hardship upon weakness and hardship, and his weaning is in two years -- give thanks to Me and to your parents. Unto Me is the final destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined man in respect of his parents-- his mother bears him with faintings upon faintings and his weaning takes two years-- saying: Be grateful to Me and to both your parents; to Me is the eventual coming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And We have charged man concerning his parents -- his mother bore him in weakness upon weakness, and his weaning was in two years -- 'Be thankful to Me, and to thy parents; to Me is the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man concerning his partners - His mother beareth him in weakness upon weakness, and his weaning is in two years - Give thanks unto Me and unto thy parents. Unto Me is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined man to show kindness to his parents -- for his mother bears him, in hardship upon hardship, and his weaning takes two years. [We said] Give thanks to Me and to your parents; all will return to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man concerning his parents--his mother beareth him in hardship upon hardship and his weaning is in two years: give thanks unto Me and unto thy parents; Unto Me is the goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined man concerning his parents: His mother carried him through weakness upon weakness, and his weaning takes two years. Give thanks to Me and to your parents. To Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man (to be good) to his parents: in travail upon travail did his mother bear him, and in years twain was his weaning: (hear the command), \"Show gratitude to Me and to thy parents: to Me is (thy final) Goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man (to be dutiful and good) to his parents. His mother bore him in weakness and hardship upon weakness and hardship, and his weaning is in two years give thanks to Me and to your parents, unto Me is the final destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We charged the human concerning his parents, for his mother bore him in weakness upon weakness, and his weaning was in two years. Be thankful to Me and to your parents, to Me is the arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have entrusted the human being with the care of his parents. His mother carried him through hardship upon hardship, weaning him in two years. So give thanks to Me, and to your parents. To Me is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man [care] for his parents. His mother carried him, [increasing her] in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents; to Me is the [final] destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:14]   And We have enjoined man concerning his parents, We commanded him to be dutiful towards them — his mother bears him, and weakens, in weakness after weakness, that is to say, she is weakened by the pregnancy, the pains of labour and the delivery; and his weaning is in two years, and We said to him [to man]: ‘Give thanks to Me and to your parents. To Me is the journey’s end, the return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have enjoined upon man) the reference here is to Sa'd Ibn Abi Waqqas (concerning his parents) that he should be dutiful to them. (His mother beareth him) in her womb (in weakness upon weakness) and hardship upon hardship, the more the child grows in her womb the harder it is for her, (and his weaning is in two years. Give thanks unto Me) through believing in My divine Oneness and by obeying Me (and unto thy parents) by looking after them. (Unto Me is the journeying) your destination and the destination of your parents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَمَلَتْهُ أُمُّهُ وَهْناً } معناه ضُعفٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - exalted be He - { His mother carried him and here } means weakness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والزجر عنه: { وَوَصَّيْنَا ٱلإِنْسَانَ } وألزمنا عليه أولاً بعدما أظهرناه قابلاً لحمل التكاليف المستكملة { بِوَالِدَيْهِ } أي: بإطاعتهما\n وبحفظ آداب المعاشرة والمصاحبة معهما\n ورعاية حقوقها على ما ينبغي ويليق بلا فوت شيء من حقوقهما\n سيما الوالدة المتحملة لأجله أنواع المحن والمشاق\n إذ { حَمَلَتْهُ أُمُّهُ } بواسطة حمله في بدء وجوده { وَهْناً عَلَىٰ وَهْنٍ } أي: ضعفاً على ضعف\n إذ كلما ازداد نشوءه ازداد ضعفها إلى أن انفصل عنها\n وبعد انفصاله تداوم لحفظه وحضانته إلى فطامه { وَفِصَالُهُ } أي: فطامه إنما هو { فِي عَامَيْنِ } وبعد انفطم تلازم أيضاً على حفظه إلى وقت بلوغه\n وبعدما بلغ سن التكليف قلنا له: { أَنِ ٱشْكُرْ لِي } أيها المكلف المتنعم بأنواع النعم مني أصالةً وتسبباً\n لأني خلقتك وأظهرتك من كتم العدم ولم تك شيئاً\n\n{ وَ } اشكر أيضاً { لِوَالِدَيْكَ } \n { وَٱخْفِضْ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحْمَةِ } [الإسراء: 24] لإقامتهما على حفظك وحضانتك إلى أن كبرت\n وبلغت مرتبة أشدك\n وكمال عقلك ورشدك\n واعلم أن شكرك لهما راجع إليَّ أيضاً\n إذ أقدرتهما ومكنتهما على حفظك\n وألقيت محبتك في قلبيهما\n وبالجملة: { إِلَيَّ ٱلْمَصِيرُ } [لقمان: 14] والمرجع في جميع الأفعال الصادرة من العباد ظاهراً\n إذ هم وما صدر عنهم من الأفعال مستندون إلينا أولاً وبالذات\n وكيف لا تُستند أفعالهم إلينا\n إذ جميع ما صدر عنهم تابع لوجوداتهم\n مترتب عليها؟! والحال أنه ليس لهم وجود في أنفسهم\n بل وجوداتهم إنماهي رشحة من رشحات وجود الحق\n وفيء من أضلال أوصافه وأسمائه الذاتية\n\n\n{ وَ } بعدما أكدنا عليكم أيها المكلفون في حفظ حقوق والديكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الجملتان معترضتان بين أجزاء توصية لقمان لابنه\n ووَهْناً: حال من أمه\n أي: حملته حال كونها ذَاتَ وَهْنٍ\n أو من الضمير المنصوب\n أي: حملته نُطْفَةً\n ثم علقة\n\n\n إلخ\n أو مصدر\n أي: تهن وهناً\n يقول الحق جل جلاله: { ووصينا الإنسانَ بوالديه } أن يَبَرَّهُمَا ويُطِيعَهُمَا\n ثم ذكر الحامل على البر فقال: { حَمَلَتْهُ أُمُّه وَهْناً على وَهْنٍ } أي: تضعف ضعفاً فوق ضعف\n أي: يتزايد ضعفها ويتضاعف لأن الحمل\n كلما ازداد وعظم\n ازدادت ثِقلاً\n { وفِصَالهُ في عامين } أي: فطامه لتمام عامين\n وهذا أيضاً مما يهيج الولد على بر والديه\n فيتذكر مَرْقده في بطن أمه\n وتعبَها معه في مدة حَمْلِةِ\n ثم ما قاست من وجع الطلق عند خروجه\n ثم ما عالجته في أيام رضاعه من تربيته\n وغسل ثيابه\n وسهر الليل في بكائه\n إلى غير ذلك\n { أن اشكر لي ولوالديك } \n هو تفسير لِوَصَّينَا\n أو على حذف الجار\n أي: وصيناه بشكرنا وبشكر والديه\n وقوله: { حملته أمه\n\n } إلخ: اعتراض بين المفسَّر والمفسِّر\n لأنه لَمَّا وصى بالوالدين\n ذكر ما تُكابده وتُعاينه من المشاق في حمله وفصاله\n هذه المدة الطويلة تذكيراً لحقها\n مفرداً\n وعن ابن عُيَيْنَةَ: من صلى الصلوات الخمس فقد شكر الله\n ومن دعا للوالدين\n في أدبار الصلوات الخمس\n فقد شكرهما\n هـ\n وقال القشيري: والإجماع على أن شكر الوالدين بدوام طاعتهما\n ثم قال: فشكرُ الحقِّ بالتعظيم والتكبير\n وشكرُ الوالدين بالإشفاق والتوقير\n هـ\n ثم قال تعالى: { إليَّ المصيرُ } فأحاسبك على شكرك\n أو كفرك\n { وإن جاهداك على أن تُشرك بي ما ليس لك به عِلْمٌ } \n أراد بنفي العلم به نفيَه من أصله\n أي: أن تشرك بي ما ليس بشيء\n أو: ما ليس لك به علم باستحقاقه الإشراك مع الله\n بل تقليداً لهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:126",
      "similarity": 0.4344099071998772
    },
    {
      "verse": "8:18",
      "similarity": 0.42059827347415657
    },
    {
      "verse": "3:139",
      "similarity": 0.41382877259329937
    },
    {
      "verse": "4:104",
      "similarity": 0.3925442497480756
    },
    {
      "verse": "29:14",
      "similarity": 0.31811388800608414
    }
  ]
}