{
  "chapter": "لقمان",
  "text": "نمتعهم قليلا ثم نضطرهم الى عذاب غليظ",
  "translations": [
    {
      "translation": "We let them enjoy themselves only for a while, then We shall drag them to a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We allow them to enjoy themselves a while in the world and then We shall drive them in utter helplessness to a harsh chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall allow them to enjoy themselves for a short while, then force them into severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall give them some usage, then making them helpless take them towards a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We let them enjoy for a little while, then in the end We shall oblige them to (enter) a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We give them to enjoy a little, then will We drive them to a severe chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To them We give enjoyment a little, then We compel them to a harsh chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We give them comfort for a little, and then We drive them to a heavy doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall let them enjoy themselves for a little while, but then We shall drive them to a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We let them enjoy for a while, and then We shall drive them to a torment rough.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will provide for them for a short time, then We will shove them toward a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We grant them their pleasure for a little while: in the end shall We drive them to a chastisement unrelenting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We let them enjoy for a little while, then in the end We shall oblige them to (enter) a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We give to them a little enjoyment for awhile, and then will compel them to a tremendous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We give them a little comfort; then We compel them to a harsh torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We grant them enjoyment for a little; then We will force them to a massive punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:24] We will give them comfort, in this world, for a little [while], for the [duration of the] days of their lives, then We will drive them, in the Hereafter, to a harsh chastisement, namely, the chastisement of the Fire from which they will find no escape.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We give them comfort for a little) in the life of this world, (and then We drive them to a heavy doom) to a severe torment, one kind of torment after another.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم يا أكمل الرسل نيابةً عنا: لا يغتروا بإمهالنا وتمتعينا إياهم، وعدم التفاتنا نحوهم، وعدم انتقامنا عنهم؛ إذ { نُمَتِّعُهُمْ قَلِيلاً } أي: زماناً قليلاً تسجيلاً للعذاب عليهم، وتغريراً { ثُمَّ نَضْطَرُّهُمْ } بعد بطشنا إياهم { إِلَىٰ عَذَابٍ غَلِيظٍ } [لقمان: 24] لا عذاب أغلظ منه وأشد؛ لغلظ غشاوتهم وقساوتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}