{
  "chapter": "لقمان",
  "text": "ومن يسلم وجهه الى الله وهو محسن فقد استمسك بالعروة الوثقى والى الله عقبة الامور",
  "translations": [
    {
      "translation": "Those who submit themselves completely to Allah and do good have grasped the Firmest Handhold. The end result of all affairs is with Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who turns his face to God in submission and does good, holds fast to a handle that is strong; for the resultance of things rests with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever surrenders himself to Allah and lives righteously grasps the most firm handle. The ultimate decision of all matters rests with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever submits himself to the will of God in righteousness has certainly achieved a strong-hold. The end of all things is in the hands of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever submits his face to Allah and is righteous – so he has indeed grasped the firm knot; and towards Allah only is the culmination of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever submits his face (himself) to Allah, while he is a Muhsin, then he has grasped the most trustworthy handhold. And to Allah return all matters for decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever submits himself wholly to Allah and he is the doer of good (to others), he indeed has taken hold of the firmest thing upon which one can lay hold; and Allah's is the end of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever submits his will to God, being a good-doer, has laid hold of the most firm handle; and unto God is the issue of all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever surrendereth his purpose to Allah while doing good, he verily hath grasped the firm hand-hold. Unto Allah belongeth the sequel of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who submits himself completely to God, and is a doer of good, has surely grasped a strong handle, for the final outcome of all events rests with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever submitteth his countenance unto Allah and he is a well doer, he hath of a surety lain hold of the firm cable. Unto Allah is the end of all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever surrenders his heart to Allah and is virtuous, has certainly held fast to the firmest handle, and with Allah lies the outcome of all matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever submits his whole self to Allah, and is a doer of good, has grasped indeed the most trustworthy hand-hold: and with Allah rests the End and Decision of (all) affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever submits his face (himself) to Allah [i.e. (follows Allah's Religion of Islamic Monotheism), worships Allah (Alone) with sincere Faith in the (1) Oneness of His Lordship, (2) Oneness of His worship, and (3) Oneness of His Names and Qualities], while he is a Muhsin (good-doer i.e. performs good deeds totally for Allah's sake without any show-off or to gain praise or fame etc. and does them in accordance with the Sunnah of Allah's Messenger Muhammad SAW), then he has grasped the most trustworthy hand-hold [La ilaha ill-Allah (none has the right to be worshipped but Allah)]. And to Allah return all matters for decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who surrenders himself to Allah and is a good doer, has grasped the firmest handle. To Allah the issue of affairs return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever submits himself wholly to God, and is a doer of good, has grasped the most trustworthy handle. With God rests the outcome of all events.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever submits his face to Allah while he is a doer of good - then he has grasped the most trustworthy handhold. And to Allah will be the outcome of [all] matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:22] And whoever surrenders his purpose to God, that is, [whoever] takes to obeying Him, and is virtuous, a believer in [His] Oneness, has certainly grasped the firmest handle, the stronger end, which is not in danger of being severed, and to God belongs the sequel of all matters, their [ultimate] return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whosoever surrendereth his purpose to Allah) whoever makes his religion and works sincere to Allah (while 466 doing good) believes sincerely that there is only one true God, (he verily hath grasped the firm hand hold) which will never split up, through \"there is no deity except Allah\". (Unto Allah belongeth the sequel of all things) the consequence of things, the states in which they die, will return to Him in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَمَن يُسْلِمْ وَجْهَهُ } الذي يلي الحق { إِلَى ٱللَّهِ } ويخلص في توجهه نحوه { وَ } الحال أنه { هُوَ مُحْسِنٌ } ناظر إلى الله بنوره سبحانه\n مطالع بوجهه الكريم { فَقَدِ ٱسْتَمْسَكَ } وتمسك { بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ } التي لا انفصام لها\n وهي حبل الله الممدود من أزل الذات إلى أبد الأسماء والصفات\n ومن تمسك بها فقد فاز بكنف حفظه وجواره\n وأمن من شر الشيطان وغوائله وتضليلاته عن طريق الحق وصراطه المستقيم { وَ } كيف لا { إِلَىٰ ٱللَّهِ } المستجمع لجميع الأسماء والصفات المترتبة لما في الكائنات لا إلى غيره من الوسائل والأظلال العادية { عَاقِبَةُ ٱلأَمُورِ } [لقمان: 22] ومصيرها؟! ومن تشبث بحبل الله مخلصاً\n فقد لحق بخلَّص أوليائه الذين\n[يونس: 62]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال في الحاشية: لّمَّا ذكر حال الكافر المجادل ذكر حال المسلم\n وعدّاه هنا بإلى\n وفي قوله:\n[البقرة: 112]\n باللام لأنه لَمَّا كان المجادل غير مُعين\n ولم يخص له واحداً بعينه\n عقَّبه بحال من حصل منه مطلق الاستسلام\n ومَدْحُهُ يتناول مَدْحَ مَنِ اتصف بأخص الاستسلام\n أو: في الآية الأخرى أتى به خاصاً\n لما رتب عليه من الثواب الجزيل بقوله: { فله أجره\n\n\n } إلخ\n الذي لم يذكر هنا إلا بعضه\n فإن اللام تقتضي الاختصاص والقصد إلى الشيء\n و \" إلى \": لا تقتضي ذلك\n انظر ابن عرفة\n وقال النسفي: عدّاه هنا بإلى وهناك باللام لأن معناه\n مع اللام: أنه جعل وجهه - وهو ذاته ونفسه - سالماً لله\n أي: خالصاً له\n ومعناه\n مع \" إلى \": أنه سلّم نفسه كما يُسلم المتاع إلى الرجل\n إذا دفع إليه\n والمراد: التوكل عليه والتفويض إليه\n هـ\n أي: فهو أبلغ من اللام\n ومثله البيضاوي\n يقول الحق جل جلاله: { ومن يُسْلِمْ وَجْهَه إلى الله } أي: ينقد إليه بكليته\n وينقطع إليه بجميع شراشره\n بأن فوض أمره إليه\n وأقبل بكُلِّيَّتِهِ عليه\n { وهو محسن } في أعماله\n قال القشيري: من أَسْلَمَ نَفْسُه\n وأخلص في الله قَصْدَهُ\n فقد استمسك بالعروة الوثقى\n هـ\n فالاستسلام قد يكون بغير إخلاص\n فلذلك قال: { وهو محسن }\n قاله المحشي\n وقلت: وفيه نظر فإن الحق تعالى إنما عبَّر بالإسلام لا بالاستسلام\n وإنما المعنى: أسلم وجهه في الباطن\n وهو محسن بالعمل في الظاهر\n { فقد استمسك بالعُرْوَةِ الوُثْقَى } \n أي: تعلق بأوثق ما يتعلق به فالعروة: ما يستمسك به\n والوثقى: تأنيث الأوثق\n مثّلَ حال المسلم المتوكل بحال من أراد أن يَتَدَلَّى من شاهق جبل\n فاحتاط لنفسه\n بأن استمسك بأوثق عروة من حبل متين\n مأمونٍ انقطاعُهُ\n قال الهروي: أي: تمسك بالعقد الوثيق\n وقال الأزهري: أصله: من عروة الكلأ\n وهو: ماله أصل ثابت في الأرض\n من الشيح وغيره من الشجر المستأصل في الأرض\n ضُربَتْ مثلاً لكل ما يُعْتَصَمُ به ويُلْجأُ إليه\n هـ\n وهو إشارة لكون التوحيد سبباً وأصلاً\n والآخِذُ به\n مُّتصلاً بالله\n لا يخشى انقطاعاً ولا هلاكاً\n بخلاف الشرك\n فإنه على الضد\n كما يرشد إليه قوله تعالى:\n[إبراهيم: 26] الآية\n وقوله تعالى:\n[الحج: 31] الآية\n { وإلى الله عاقبة الامور } أي: صائرة إليه فيُجازى عليها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:54",
      "similarity": 0.7699989748763489
    },
    {
      "verse": "2:256",
      "similarity": 0.40140164295387404
    },
    {
      "verse": "43:21",
      "similarity": 0.1649711527177961
    },
    {
      "verse": "43:43",
      "similarity": 0.1618448775126439
    },
    {
      "verse": "35:2",
      "similarity": 0.15431878038284816
    }
  ]
}