{
  "chapter": "لقمان",
  "text": "ما خلقكم ولا بعثكم الا كنفس وحدة ان الله سميعۢ بصير",
  "translations": [
    {
      "translation": "Your creation and rising is only like that of a single self. Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and resurrection is but like that of a single cell. Verily He is all-hearing and all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To create all of you or to resurrect all of you is to Him like (creating or resurrecting) a single person. Verily Allah is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For God your creation and your resurrection are only like the creation and resurrection of one soul. God is All-hearing and All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Creating you all and raising you from the dead are like that of one soul*; indeed Allah is All Hearing, All Knowing. (He can create you slowly or all at once).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of you all and the resurrection of you all are only as a single person. Verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your creation nor your raising is anything but as a single soul; surely Allah is Hearing, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and your upraising are as but as a single soul. God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and your raising (from the dead) are only as (the creation and the raising of) a single soul. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Creating and resurrecting all of you is just like creating and resurrecting a single soul. Truly, God hears all and observes all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your creation and your upraising are only as though of one soul; verily Allah is Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and your resurrection are not but as of a single soul. Indeed Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your creation or your resurrection is in no wise but as an individual soul: for Allah is He Who hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of you all and the resurrection of you all are only as (the creation and resurrection of) a single person. Verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and your resurrection are but as a single soul. Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and your resurrection are only as a single soul. God is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your creation and your resurrection will not be but as that of a single soul. Indeed, Allah is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:28] Your creation and your resurrection are only as [that of] a single soul, in terms of creation and resurrection, because it is the result of the words kun fa-yakūn, ‘“Be!” and it is!’ Truly God is Hearer, hearing everything that may be heard, Seer, seeing everything that may be seen, nothing able to distract Him from anything else.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَاحِدَةٍ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ (28)استئناف بياني متعلق بقوله { إلينا مرجعهم فننبئهم بما عملوا } \\[ لقمان : 23 \\] لأنه كلما ذكر أمر البعث هجس في نفوس المشركين استحالة إعادة الأجسام بعد اضمحلالها فيكثر في القرآن تعقيب ذكر البعث بالإشارة إلى إمكانه وتقريبه . وكانوا أيضاً يقولون : إن الله خلقنا أطواراً نطفة ثم علقة ثم مضغة ثم لحماً وعظماً فكيف يبعثنا خلقاً جديداً في ساعة واحدة وكيف يحيي جميع الأمم والأجيال التي تضمنتها الأرض في القرون الكثيرة ، وكان أُبَيّ بنُ خلف وأبو الأسد أو أبو الأسدين ونُبَيْه ، ومُنبِّه ، ابنا الحجاج من بني سهم ، يقولون ذلك وربما أسرّ به بعضهم . وضميرَا المخاطَبين مراد بهما جميع الخلق فهما بمنزلة الجنس ، أي ما خلْقُ جميع الناس أول مرة ولا بَعْثُهم ، أي خلقُهم ثاني مرة إلا كخلق نفس واحدة لأن خلق نفس واحدة هذا الخلق العجيب دال على تمام قدرة الخالق تعالى فإذا كان كامل القدرة استوى في جانب قدرته القليل والكثير والبدء والإعادة .وفي قوله { ما خلقكم ولا بعثكم } التفات من الغيبة إلى الخطاب لقصد مجابهتهم بالاستدلال المُفْحِم .وفي قوله { كنفس واحدة } حذف مضاف دل عليه { ما خلقكم ولا بعثكم . } والتقدير : إلا كخلق وبعث نفس واحدة . وذلك إيجاز كقول النابغة :وقد خِفت حتى ما تزيدُ مخافتي ... على وَعِل في ذي المَطارة عاقِلالتقدير : على مخافة وعل . والمقصود : إن الخلق الثاني كالخلق الأول في جانب القدرة .وجملة { إن الله سميع بصير } : إما واقعة موقع التعليل لكمال القدرة على ذلك الخلق العجيب استدلالاً بإحاطة علمه تعالى بالأشياء والأسباب وتفاصيلها وجزئياتها ومن شأن العالم أن يتصرف في المعلومات كما يشاء لأن العجز عن إيجاد بعض ما تتوجه إليه الإرادة إنما يتأتى من خفاء السبب الموصل إلى إيجاده ، وإذ قد كان المشركون أو عقلاؤهم يسلمون أن الله يعلم كل شيء جعل تسليمهم ذلك وسيلة إلى إقناعهم بقدرته تعالى على كل شيء ، وإما واقعة موقع الاستئناف البياني لما ينشأ عن الإخبار بأن بعثهم كنفس من تعجب فريق ممن أسروا إنكار البعث في نفوسهم الذين أومأ إليهم قوله آنفاً : { إن الله عليم بذات الصدور } \\[ لقمان : 23 \\] ، ولأجل هذا لم يقل : إن الله عليم قدير .\n\n",
      "translations": [
        {
          "translation": "(Your creation) when He created you (and your raising (from the dead)) when He will resurrect you (are only as (the creation and the raising of) a single soul. Lo! Allah is Hearer) He hears you when you say: \"how is Allah going to raise us from the dead?\", (Seer) of your resurrection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك قال سبحانه: { مَّا خَلْقُكُمْ } وإظهاركم في فضاء الوجود في النشأة الأولى { وَلاَ بَعْثُكُمْ } وحشركم في النشأة الأخرى بعدما انقرضتم عن الأولى { إِلاَّ كَنَفْسٍ وَاحِدَةٍ } يعني: إيجادكم جملة أولاً\n وبعثكم ثانياً كذلك في جنب قدرتنا وإرادتنا كإيجاد نفس واحدة بلا تفاوت\n إذ متى صدر عنا قولنا: كن\n إشارةً منَّا إلى خلقكم وبعثكم جملة\n فيكون الكل في الحال ككون نفس واحدة { إِنَّ ٱللَّهَ } المطلع لسرائر ما ظهر وبطن { سَمِيعٌ } لعموم ما صدر عن ألسنة استعداداتهم وقابلياتهم { بَصِيرٌ } [لقمان: 28] بما لاح عليهم من إشراق نور الوجود",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { ما خلْقُكُمْ ولا بعثُكُم إلا كنَفْسٍ واحدةٍ } \n أي: إلا كخلق نفس واحدة\n وبعث نفس واحدة\n فحُذف\n للعلم به\n أي: القليل والكثير في قدرة الله تعالى سواء\n فلا يشغله شأن عن شأن\n وقدرته عامة التعلق\n تَنْفُذُ أسرع من لمح البصر\n\nقال الغزالي في الإحياء: ومن غريب حِكَم الآخرة أن الرجل يُدعى به إلى الله تعالى\n فيُحاسب ويُوبخ\n وتُوزن له حسناته وسيئاته\n وهو في ذلك كله يظن أن الله لم يحاسب إلا هو\n ولعل آلاف آلاف ألف مثله في لحظة واحدة\n وكل منهم يظن ظنه\n لا يرى بعضهم بعضاً\n ولا يسمعه\n وهو قوله تعالى: { ما خلقكم ولا بعثكم إلا كنفس واحدة }\n هـ\n { إن الله سميع } لقول من يُنكر البعث من المشركين\n { بصيرٌ } بأعمالهم\n فيجازيهم\n الإشارة: أوصاف الباري سبحانه كلها كاملة\n غير محصورة ولا متناهية من علم\n وقدرةٍ\n وإرادة\n وكلام\n وغيرها\n وأوصاف العبد كلها قصيرة متناهية\n وقد يمد الحقُّ عبده بصفة من صفاته التي لا تتناهى\n فإذا أمده بصفة الكلام تكلم بكلام تعجز عنه العقول\n لا يقدر على إمساكه\n فلو بقي يتكلم عمرَه كله ما نفد كلامه\n حتى يُسكته الحق تعالى\n وقد كان بعض السادات يقول لأصحابه\n حين يتكلم عليهم: إني لأستفيد من نفسي كما تستفيدون أنتم مني\n وذلك حين الفيض الإلهي\n وإذا أمده بصفة القدرة\n قدر على كل شيء\n وإذا أمده صفة السمع سمع كل شيء\n وإذا أمده بصفة البصر\n أبصر كل موجود\n\n\n وهكذا\n وهذه الأوصاف كامنة في العبد من حيث معناه\n احتجبت بظهور أضدادها صوناً لسِّر الربوبية\n والله تعالى أعلم\n ثم برهن على كمال أوصافه\n فقال: { أَلَمْ تَرَ أَنَّ ٱللَّهَ يُولِجُ ٱلْلَّيْلَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:163",
      "similarity": 0.4438721588925515
    },
    {
      "verse": "37:4",
      "similarity": 0.4180619748430875
    },
    {
      "verse": "6:29",
      "similarity": 0.3951464779899347
    },
    {
      "verse": "23:16",
      "similarity": 0.3854651242111827
    },
    {
      "verse": "74:11",
      "similarity": 0.3814506047509577
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}