{
  "chapter": "لقمان",
  "text": "واذا قيل لهم اتبعوا۟ ما انزل الله قالوا۟ بل نتبع ما وجدنا عليه ءاباءنا اولو كان الشيطن يدعوهم الى عذاب السعير",
  "translations": [
    {
      "translation": "When you ask them to follow what God has revealed, they say: \"No. We shall follow what we found our ancestors following,\" even though the devil were calling them to the torment of Hell!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: “Follow what Allah has revealed,” they say: “We will rather follow that which we have found our forefathers following.” (Will they follow that) even though Satan might invite them to the chastisement of the Blazing Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to follow what God has revealed to them, they say, \"We shall only follow our father's way of life.\" Will they follow it even if it is Satan who is calling them to the burning torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Follow what Allah has sent down”, they say, “On the contrary, we shall only follow that upon which we found our forefathers”; even if the devil was calling them to the punishment of hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Follow that which Allah has sent down,\" they say: \"Nay, we shall follow that which we found our fathers (following).\" Even if Shaytan invites them to the torment of the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Follow what Allah has revealed, they say: Nay, we follow that on which we found our fathers. What! though the Shaitan calls them to the chastisement of the burning fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when it is said to them, 'Follow what God has sent down,' they say, 'No; but we will follow such things as we found our fathers doing.' What? Even though Satan were calling them to the chastisement of the burning?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it be said unto them: Follow that which Allah hath revealed, they say: Nay, but we follow that wherein we found our fathers. What! Even though the devil were inviting them unto the doom of flame?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to follow the [Revelations] that God has sent down, they say, \"No, we shall follow the ways that we found our fathers [following].\" Yes! Even though Satan is inviting them to the punishment of the burning Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: follow that which Allah hath sent down, they say: nay! we shall follow that which we found our fathers upon. What! even though the Satan had been calling on them unto the torment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Follow what Allah has sent down,’ they say, ‘No, we will follow what we found our fathers following.’ What! Even if Satan be calling them to the punishment of the Blaze?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to follow the (Revelation) that Allah has sent down, they say: \"Nay, we shall follow the ways that we found our fathers (following). \"What! even if it is Satan beckoning them to the Penalty of the (Blazing) Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Follow that which Allah has sent down\", they say: \"Nay, we shall follow that which we found our fathers (following).\" (Would they do so) even if Shaitan (Satan) invites them to the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Follow what Allah has sent down' they reply: 'No, rather we will follow that which we found our fathers upon' What! Even though satan is inviting them to the punishment of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Follow what God has revealed,” they say, “Rather, we follow what we found our parents devoted to.” Even if Satan is calling them to the suffering of the Blaze?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Follow what Allah has revealed,\" they say, \"Rather, we will follow that upon which we found our fathers.\" Even if Satan was inviting them to the punishment of the Blaze?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:21] And if it is said to them: ‘Follow what God has revealed’, they say, ‘We will rather follow what we found our fathers following’. He, exalted be He, says: What! Would they follow such [things], even though Satan were calling them to the chastisement of the Blaze?, that is, to what will bring it about necessarily? No!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if it be said unto them) i.e. to the disbelievers of Mecca: (Follow that which Allah hath revealed) to His Prophet of the Qur'an; i.e. recite and act upon what is in it, (they say: Nay, but we follow that wherein we found our fathers) of religion and wont. (What! Even though the devil were inviting them) were inviting their fathers (unto the doom of flame) to disbelief, idolatry and that which leads to the chastisement of the Flame, and still they follow them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لذلك { إِذَا قِيلَ لَهُمُ } على سبيل العظة والتذكير إمحاضاً للنصح: { ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ } المصلح لأحوالكم من الدين والكتاب المشتمل على أنواع الرشد والهداية، والنبي المؤيَّد من عنده، المبعوث إليكم؛ لهدايتكم وإصلاحكم { قَالُواْ } في الجواب: ما نتبع بمفترياتكم المستحدثة التي ابتدعتموها من تلقاء أنفسكم، ونسبتموها إلى الله تغريراً وترويجاً { بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ آبَآءَنَا } إذ هو مستمر قديم، فنحن بأثرهم متبعونن، وبدينهم راضون متخذون\n\n\n\n\nقل لهم يا أكمل الرسل نيابةً عنا: { أَ } يتبعون آبائهم أولئك الضالين { وَلَوْ كَانَ ٱلشَّيْطَانُ } المغوي المضل إياهم { يَدْعُوهُمْ } وآباءهم أيضاً إلى الباطل؛ ليصرفهم عن الحق، ويوصلهم { إِلَىٰ عَذَابِ ٱلسَّعِيرِ } [لقمان: 21] الذي أُعد لمتابعيه، ومن يقتفي أثره ويقبل دعوته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا قيل لهم اتبعوا ما أنزل الله } على رسوله من التوحيد، والشرائع، { قالوا بل نتبعُ ما وجدنا عليه آباءنا } من عبادة الأصنام\n وهو دليل منع التقليد في الأصول\n قاله البيضاوي قلت: والمشهور أن إيمان المقلِّد صحيح\n وأما من قلَّد الرسول عليه الصلاة والسلام، ولم ينظر، فهو مؤمن، اتفاقاً\n قال تعالى: { أَوَ لَو } أيتبعونهم، ولو { كان الشيطانُ يدعوهم إلى عذاب السعير } ، يحتمل أن يكون الضمير لهم، أي: أيقلدونهم، ولو كان يدعوهم بذلك التقليد إلى العذاب، أو: لآبائهم، أي: أيتبعون آباءهم، ولو كان الشيطان في زمانهم يدعوهم إلى عذاب السعير\n الإشارة: الأكوان كلها خُلِقَتْ لك أيها الإنسان، وأنت خُلِقْتَ للحضرة، فاعرف قَدْرَكَ، ولاتتعدَّ طَوْرَكَ، واشكر النعم لتي أسبغ عليك ظاهرة وباطنة\n الظاهرة: استقامة الظواهر في عمل الشرائع، والباطنة: تصفية البواطن لتتهيأ لأنوار الحقائق، أو: الظاهرة: المنن، والباطنة: المحن\n قال القشيري: قد تكلموا في الظاهرة والباطنة وأكثروا\n فالظاهرةُ: وجودُ النعمة، والباطنةُ: شهودُ المنعِم، أو: الظاهرةُ: الدنيويةُ، والباطنة: الدينية\n أو: الخلْق والخُلق، أو: نَفْس بلا زَلَّة، وقلبٌ بلا غفلة، أو: عطاء ورضى\n أو: الظاهرة: في الأموال ونمائها، والباطنة: في الأحوال وصفائها، أو: الظاهرة: النعمةُ، والباطنة: العصمةُ، أو: الظاهرةُ: توفيقُ الطاعات، والباطنة: قبولُها، أو: الظاهرة: صحبة العارفين، والباطنةُ: حِفْظُ حُرْمَتِهم وتعظيمهم\n\n\nأو: الظاهرة: الزهدُ في الدنيا، والباطنة: الاكتفاءُ بالله من الدنيا والعُقبى\n أو: الظاهرة: الزهد، والباطنة: الوَجْدُ\n أو: الظاهرة: توفيق المجاهدة، والباطنة: تحقيقُ المشاهدة، أو: الظاهرة: وظائف النَّفْس، والباطنة: لطائف القلب، أو: الظاهرة: اشتغالُك بنفسك عن الخلق، والباطنة: اشتغالك بربَّك عن نفسك، أو: الظاهرة: طَلَبَهُ، والباطنة: وجودُه، أو: الظاهرةُ: أنْ تَصِلَ إليه، والباطنة: أن تبقى معه\n هـ\n ببعض المعنى\n ثم قال القشيري: { وإذا قيل لهم اتبعوا ما أنزل الله\n\n\n } الآية: لم يتخطوا أمثالَهم، ولم يهتدوا إلى تحوِّل أحوالهم\n هـ\n يعني: قلدوا أسلافكم في الإقامة مع الرسوم والأشكال، والانهماك في الحظوظ، فعاقبهم ذلك عن السير والوصول\n ولا حول ولا قوة إلا بالله\n وأمّا من خالف امتثاله وأشكاله وانقاد بكليّته إلى مولاه فقد استمسك بالعروة الوثقى، كما قال تعالى: { وَمَن يُسْلِمْ وَجْهَهُ\n\n\n }\n",
      "translations": []
    }
  ]
}