{
  "chapter": "لقمان",
  "text": "لله ما فى السموت والارض ان الله هو الغنى الحميد",
  "translations": [
    {
      "translation": "Everything in the heavens and earth belongs to Allah. Allah is the Rich Beyond Need, the Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs what is in the heavens and the earth. Verily He is all-sufficient, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth belongs to Allah. Verily He is All-Sufficient, Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth. He is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah only belongs whatsoever is in the heavens and in the earth; indeed Allah only is the Absolute, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatsoever is in the heavens and the earth. Verily, Allah, He is Al-Ghani, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is in the heavens and the earth is Allah's; surely Allah is the Self-sufficient, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth; surely God -- He is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belongeth whatsoever is in the heavens and the earth. Lo! Allah, He is the Absolute, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth belongs to God. Assuredly, God is self-sufficient and praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is whatsoever is in the heavens and the earth. Verily Allah! He is the Self-sufficient, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and the earth. Indeed Allah is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong all things in heaven and earth: verily Allah is He (that is) free of all wants, worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatsoever is in the heavens and the earth. Verily, Allah, He is Al-Ghani (Rich, Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and the earth. He is the Rich, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs everything in the heavens and the earth. God is the Rich, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and earth. Indeed, Allah is the Free of need, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:26] To God belongs whatever is in the heavens and the earth, as possessions, creatures and servants, and so none other than Him deserves to be worshipped in them. Indeed God, He is the Independent, [without need] of His creatures, the Praised, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Allah belongeth whatsoever is in the heavens) of creation (and the earth. Allah, He is the Absolute) He is free of need for His creation, (the Owner of Praise) He Who is praised in His acts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:64",
      "similarity": 0.9999999999999998
    },
    {
      "verse": "14:8",
      "similarity": 0.7478109996789621
    },
    {
      "verse": "45:36",
      "similarity": 0.6984677533215046
    },
    {
      "verse": "64:6",
      "similarity": 0.6052449094385541
    },
    {
      "verse": "37:182",
      "similarity": 0.586056334563377
    }
  ]
}