{
  "chapter": "لقمان",
  "text": "الم تر ان الله يولج اليل فى النهار ويولج النهار فى اليل وسخر الشمس والقمر كل يجرى الى اجل مسمى وان الله بما تعملون خبير",
  "translations": [
    {
      "translation": "Do you not see that Allah makes night merge into day and day merge into night, and that He has made the sun and moon subservient, each one running for a specified time, and that Allah is aware of what you do?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God makes the night succeed the day, the day succeed the night? And He has harnessed the sun and the moon so that each runs its appointed course. Surely God is aware of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah makes the night phase into the day and makes the day phase into the night and has subjected the sun and the moon to His will so that each of them is pursuing its course till an appointed time? (Do you not know that) Allah is well aware of all that you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God causes the night to enter into the day and the day into the night. He has made the sun and moon subservient (to Himself). Each moves (in an orbit) for an appointed time. God is certainly All-aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O listener, did you not see that Allah brings the night in a part of the day and brings the day in a part of the night, and that He has subjected the sun and the moon – each one runs for its fixed term – and that Allah is Well Aware of your deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah merges the night into the day, and merges the day into the night, and has subjected the sun and the moon, each running its course for a term appointed; and that Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah makes the night to enter into the day, and He makes the day to enter into the night, and He has made the sun and the moon subservient (to you); each pursues its course till an appointed time; and that Allah is Aware of what you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that God makes the night to enter into the day and makes the day to enter into the night. and He has subjected the sun and the moon, each of them running to a stated term, and that God is aware of what you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how Allah causeth the night to pass into the day and causeth the day to pass into the night, and hath subdued the sun and the moon (to do their work), each running unto an appointed term; and that Allah is Informed of what ye do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God makes the night pass into the day, and makes the day pass into the night, and that He has pressed the sun and the moon into His service, each pursuing its course for an appointed term, and that God is well aware of what you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observest thou not that Allah plungeth the night into the day and plungeth the day into the night and hath subjected the sun and the moon, each running unto an appointed term, and that Allah is of that which ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah makes the night pass into the day and makes the day pass into the night; and He has disposed the sun and the moon, each moving for a specified term, and that Allah is well aware of what you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah merges Night into Day and he merges Day into Night; that He has subjected the sun, and the moon (to his Law), each running its course for a term appointed; and that Allah is well-acquainted with all that ye do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not (O Muhammad SAW) that Allah merges the night into the day (i.e. the decrease in the hours of the night are added in the hours of the day), and merges the day into the night (i.e. the decrease in the hours of day are added in the hours of night), and has subjected the sun and the moon, each running its course for a term appointed; and that Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how Allah causes the night to enter into the day, and the day enter into the night and has subjected the sun and the moon, each running to a named term? Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how God merges the night into the day, and merges the day into the night? That He subjected the sun and the moon, each running for a stated term? And that God is Cognizant of everything you do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah causes the night to enter the day and causes the day to enter the night and has subjected the sun and the moon, each running [its course] for a specified term, and that Allah, with whatever you do, is Acquainted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:29] Have you not seen, have you [not] realised, O you being addressed, that God makes the night pass into the day and makes the day pass into the night, such that the increase of the one is relative to the decrease of the other, and He has disposed the sun and the moon, each, of the two, running, in its course, to an appointed term, namely, [to] the Day of Resurrection, and that God is Aware of what you do?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed in the Qur'an (how Allah causeth the night to pass into the day) He makes the night longer than the day such that, for example, the night is 15 hours while the day is only nine hours (and causeth the day to pass into the night) He makes the day longer than the night such that, for example, the day consists of 15 hours while the night only of nine hours, (and hath subdued) made subservient (the sun and the moon, each running unto an appointed term) to an appointed time in well know trajectories; (and that Allah is Informed of what ye do) of good or evil?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألم تر } أن فلك البدن تجري في بحر الهيولى بإفاضة آثار صفاته من الحياة والقدرة والإدراك عليه وإعداده بالآلات { بنعمة الله } أي: لقبول الكمالات عليه { ليريكم } بهذا الجري والاستعداد من آيات تجليات أفعاله وصفاته { إنّ في ذلك لآيات } من تجليات أفعاله وصفاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يطلع سبحانه لجميع الكوائن والفواسد { أَلَمْ تَرَ } أيها الرائي المتأمل المتدبر { أَنَّ ٱللَّهَ يُولِجُ } ويدخل { ٱلْلَّيْلَ } أي: أجزاء منه { فِي ٱلنَّهَارِ } ويطيله بها في الربيع تتميماً لتربيتكم وأرزاقكم وأقواتكم { وَيُولِجُ } أيضاً في الخريف { ٱلنَّهَارَ } أي: أجزاءه { فِي ٱلْلَّيْلِ } ويطيله بها تقويةً وتعميراً للأرض\n لتربية ما حدث منها { وَ } بالجملة: { سَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ } لمصلحة معاشكم وتربية نفوسكم إلى حيث { كُلٌّ يَجْرِيۤ } ويدور بأمره\n ويتم دورته بحكمه { إِلَىٰ أَجَلٍ مُّسَمًّى } عيَّنه الله سبحانه\n وسمَّاه من عنده على مقتضى حكمته تربيةً لعباده\n وتقويماً لأمزجتكم\n ليشتغلوا على ما جُبلوا لأجله { وَ } اعلما أيها المجبولون على فطرة التوحيد والعرفان { أَنَّ ٱللَّهَ } الرقيب عليكم في جميع حالاتكم { بِمَا تَعْمَلُونَ } أي: بجميع ما صدر عنكم من الإعمال والأفعال { خَبِيرٌ } [لقمان: 29] لا يعزب عن خبرته ذرة من ذرائر ما لمع عليه نور الوجود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ألم تَرَ أن الله يُولج الليلَ في النهارِ } يُدخل ظلمة الليل في ضوء النهار\n إذا أقبل الليل\n { ويُولج النهارَ في الليل } يُدخل ضوء النهار في ظلمة الليل\n إذا أقبل النهار\n أو: بإدخال جزء أحدهما في الآخر بزيادة الليل أو النهار\n { وسخَّر الشمسَ والقمرَ } لمنافع العباد\n { كلٌّ } \n أي: كل واحد من الشمس والقمر { يجري } في فلكه\n ويقطعه\n { إلى أجل مُسَمّى } إلى يوم القيامة: أو: إلى وقت معلوم للشمس\n وهو تمام السنة\n والقمر إلى آخر الشهر\n { وإن الله بما تعملون خبير } عالم بكنهه\n لا يخفى عليه شيء\n فدل\n بتعاقب الليل والنهار\n أو بزيادتهما ونقصانهما\n وَجَرْي النيرين في فلكهما\n على تقدير وحساب معلوم\n وبإحاطته جميع أعمال الخلق\n على عظيم قدرته\n وكمال علمه وحكمته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:61",
      "similarity": 0.5924476632885672
    },
    {
      "verse": "57:6",
      "similarity": 0.5664978729527939
    },
    {
      "verse": "3:27",
      "similarity": 0.5476516067715387
    },
    {
      "verse": "9:16",
      "similarity": 0.5109615501931406
    },
    {
      "verse": "16:12",
      "similarity": 0.4529207985401773
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}