{
  "chapter": "لقمان",
  "text": "ولئن سالتهم من خلق السموت والارض ليقولن الله قل الحمد لله بل اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "If you ask them: \"Who created the heavens and the earth?\" They will surely answer: \"God.\" Say: \"All praise be to God.\" But most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to ask them: “Who created the heavens and the earth?” they will certainly reply: “Allah.” Say: “All praise and thanks be to Allah.” Yet most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, \"Who has created the heavens and the earth,\" they will certainly say, \"God has created them.\" Say, \"It is only God who deserves all praise, but most of them do not know\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, “Who created the heavens and the earth?” – they will surely answer, “Allah”; proclaim, “All Praise is to Allah”; in fact most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them: \"Who has created the heavens and the earth,\" they will certainly say: \"Allah.\" Say: \"All the praises and thanks be to Allah!\" But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them who created the heavens and the earth, they will certainly say: Allah. Say: (All) praise is due to Allah; nay! most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou askest them, 'Who created the heavens and the earth?' they will say, 'God.' Say: 'Praise belongs to God.' Nay, but most of them have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou shouldst ask them: Who created the heavens and the earth? they would answer: Allah. Say: Praise be to Allah! But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you should ask them, \"Who created the heavens and the earth?\" They will surely answer, \"God.\" Say, \"Praise be to God!\" But most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wert thou to ask them: who hath created the heavens and the earth they will surely say: Allah. Say thou: All praise unto Allah! But most of them know not,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, ‘Who created the heavens and the earth?’ they will surely say, ‘Allah.’ Say, ‘All praise belongs to Allah!’ But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou ask them, who it is that created the heavens and the earth. They will certainly say, \"Allah\". Say: \"Praise be to Allah!\" But most of them understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you (O Muhammad SAW) ask them: \"Who has created the heavens and the earth,\" they will certainly say: \"Allah.\" Say: \"All the praises and thanks be to Allah!\" But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them: 'Who has created the heavens and the earth' They will reply: 'Allah' Say: 'Praise belongs to Allah' But most of them do not have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, “Who created the heavens and the earth?” They will say, “God.” Say, “Praise be to God.” But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you asked them, \"Who created the heavens and earth?\" they would surely say, \"Allah.\" Say, \"[All] praise is [due] to Allah \"; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:25] And if (wa-la-in, the lām is for oaths) you were to ask them, ‘Who created the heavens and the earth?’, they will surely say, ‘God’ (la-yaqūlunna, ‘they will surely say’, the indicative nūn has been omitted because of the like [sc. the nūn] coming after it, and likewise the wāw of the [plural] person, because of two unvocalised consonants coming together). Say: ‘Praise be to God’, for the manifestation of the definitive argument against them by the affirmation of the Oneness [of God]. Nay, but most of them do not realise, that this [affirmation] is an obligation upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If thou shouldst ask them) Muhammad: Who created the heavens and the earth? They) the disbelievers of Mecca (would answer: Allah) created them. (Say: Praise be to Allah) gratitude is Allah's, therefore be grateful to Him! (But most of them) all of them (know not) Allah's divine Oneness nor do they give thanks for His blessings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نأخذ أولئك المكابرين المعاندين { لَئِن سَأَلْتَهُمْ } سؤال اختبار وإلزام: { مَّنْ خَلَقَ ٱلسَّمَٰوَٰتِ } وأوجد العلويات، وما فيها من الكواكب والبروج وأنواع الفجاج { وَٱلأَرْضَ } ومن عليها، وما عليها مما لا يُعد ولا يُحصى؟ { لَيَقُولُنَّ } في الجواب مضطرين حاصرين: { ٱللَّهُ } إذ لا يسع لهم إسناد خلقهما وإيجادهما إلى غيره سبحانه؛ لظهور الدلائل والشواهد المانعة من الاستناد إلى غيره سبحانه { قُلِ } يا أكمل الرسل بعدما اعترفوا بأن الموجد للعلويات والسلفيات هو الله سبحانه بالأصالة والاستقلال: { ٱلْحَمْدُ لِلَّهِ } حيث اعترفتم بتوحيد الله مع أنكم اعتقدتم خلافه، فيلزمهم لقولهم هذا التوحيد الحق { بَلْ أَكْثَرُهُمْ لاَ يَعْلَمُونَ } [لقمان: 25] لزومه، ولا يفهمون استلزامه؛ لذلك ينكرون له، ويشركون معه غيره عناداً واستكباراً، تعالى عما يقول الظالمون علواً كبيراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}