{
  "chapter": "لقمان",
  "text": "ولو انما فى الارض من شجرة اقلم والبحر يمده منۢ بعده سبعة ابحر ما نفدت كلمت الله ان الله عزيز حكيم",
  "translations": [
    {
      "translation": "If all the trees on earth were pens and all the sea, with seven more seas besides, was ink Allah's words still would not run dry. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees of the earth were pens and the oceans ink, with many more oceans for replenishing them, the colloquy of God would never come to end. He is indeed all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees on earth become pens, and the sea replenished by seven more seas were to supply them with ink, the Words of Allah would not be exhausted. Verily Allah is Most Mighty, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees in the earth were pens and the ocean, with seven more oceans, were ink still these could not suffice to record all the Words of God. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if all the trees in the earth were pens, and the seas were its ink, with seven more seas to back it up – the Words of Allah will not finish; indeed Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if all the trees on the earth were pens and the sea, with seven seas behind it to add to it, yet the Words of Allah would not be exhausted. Verily, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were every tree that is in the earth (made into) pens and the sea (to supply it with ink), with seven more seas to increase it, the words of Allah would not come to an end; surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though all the trees in the earth were pens, and the sea-seven seas after it to replenish it, yet would the Words of God not be spent. God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if all the trees in the earth were pens, and the sea, with seven more seas to help it, (were ink), the words of Allah could not be exhausted. Lo! Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees on earth were pens, and the sea [were] ink, with seven [more] seas added to it, the words of God would not be exhausted: for, truly, God is Almighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if whatever trees there are on the earth were pens, and the sea were ink with seven more seas to help it, the words of Allah could not be exhausted; verily Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees on the earth were pens, and the sea replenished with seven more seas [were ink], the words of Allah would not be spent. Indeed Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if all the trees on earth were pens and the ocean (were ink), with seven oceans behind it to add to its (supply), yet would not the words of Allah be exhausted (in the writing): for Allah is Exalted in Power, full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if all the trees on the earth were pens and the sea (were ink wherewith to write), with seven seas behind it to add to its (supply), yet the Words of Allah would not be exhausted. Verily, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees in the earth were pens, and the sea, with seven more seas to replenish it (with ink), the Words of Allah would never end. Allah is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If all the trees on earth were pens, filled by the ocean, with seven more oceans besides, the Words of God would not run out. God is Majestic and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if whatever trees upon the earth were pens and the sea [was ink], replenished thereafter by seven [more] seas, the words of Allah would not be exhausted. Indeed, Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:27] And if all the trees on earth were pens, and the sea (wa’l-bahru is a supplement to [mā] the subject of anna) replenished with seven more seas, were ink, the Words of God would not be spent, [those words] expressing all the things He knows, written in those pens with that [amount of] ink or with even more [ink] than that [would not be spent], for His knowledge, exalted be He, is infinite. Truly God is Mighty, nothing being beyond Him, Wise, from Whose knowledge and wisdom nothing escapes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَوْ أَنَّمَا فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلَامٌ وَالْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَا نَفِدَتْ كَلِمَاتُ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ (27)تكرر فيما سبق من هذه السورة وصف الله تعالى بإحاطة العلم بجميع الأشياء ظاهرةً وخفيةً فقال فيما حكى من وصية لقمان : { إنها إن تكُ مثقالُ حبة من خردل } إلى قوله { لطيف خبير } \\[ لقمان : 16 \\] ، وقال بعد ذلك { فنُنبئُهم بما عملوا إن الله عليم بذات الصدور } \\[ لقمان : 23 \\] فعقب ذلك بإثبات أن لعلم الله تعالى مظاهرَ يبلّغ بعضها إلى من اصطفاه من رسله بالوحي مِما تقتضي الحكمة إبلاغه ، وأنه يستأثر بعلم ما اقتضت حكمته عدم إبلاغه ، وأنه لو شاء أن يبلغ ما في علمه لما وفّت به مخلوقاته الصالحة لتسجيل كلامه بالكتابة فضلاً على الوفاء بإبلاغ ذلك بواسطة القول . وقد سُلك في هذا مسلك التقريب بضرب هذا المثل؛ وقد كان ما قُصَّ من أخبار الماضين موطئاً لهذا فقد جرت قصة لقمان في هذه السورة كما جرت قصة أهل الكهف وذي القرنين في سورة الكهف ( 109 ) فعقبتا بقوله في آخر السورة : { قل لو كان البحر مِدَاداً لكلمات ربي لَنَفِد البحر قبل أن تَنْفَد كلماتُ ربي ولو جئنا بمثله مَدَداً } وهي مشابهة للآية التي في سورة لقمان . فهذا وجه اتصال هذه الآية بما قبلها من الآيات المتفرقة .ولما في اتصال الآية بما قبلها من الخفاء أخذ أصحاب التأويل من السلف من أصحاب ابن عباس في بيان إيقاع هذه الآية في هذا الموْقع . فقيل : سبب نزولها ما ذكره الطبري وابن عطية والواحدي عن سعيد بن جبير وعكرمة وعطاء بن يسار بروايات متقاربة : أن اليهود سألوا رسول الله أو أغَروا قريشاً بسؤاله لمَّا سمعوا قول الله تعالى في شأنهم : { ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلاً } \\[ الإسراء : 85 \\] فقالوا : كيف وأنت تتلو فيما جاءك أنا قد أوتينا التوراة وفيها تبيان كل شيء فقال رسول الله صلى الله عليه وسلم لمن سألوه : هي في علم الله قليل ، ثم أنزل الله { ولو أن ما في الأرض من شجرة أقلام } الآيتين أو الآيات الثلاثَ .وعن السدّي قالت قريش : ما أكثر كلامَ محمدٍ فنزلت : { ولو أنّ ما في الأرض من شجرة أقلام } .وعن قتادة قالت قريش : سيتِمّ هذا الكلام لمحمد وينحسِر أي محمد صلى الله عليه وسلم فلا يقول بعده كلاماً . وفي رواية : سينفَدُ هذا الكلام . وهذه يرجع بعضها إلى أن هذه الآية نزلت بالمدينة فيلزم أن يكون وضعها في هذا الموضع من السورة بتوقيف نبوي للمناسبة التي ذكرناها آنفاً ، وبعضها يرجع إلى أنها مكية فيقتضي أن تكون نزلت في أثناء نزول سورة لقمان على أن توضع عقب الآيات التي نزلت قبلها .و { كلمات } جمع كلمة بمعنى الكلام كما في قوله تعالى : { كَلاَّ إنها كلمةٌ هو قائلها }\\[ المؤمنون : 100 \\] أي : الكلام المنبىء عن مراد الله من بعض مخلوقاته مما يخاطب به ملائكته وغيرَهم من المخلوقات والعناصر المعدودة للتكون التي يقال لها : كن فتكون ، ومن ذلك ما أنزله من الوحي إلى رسله وأنبيائه من أول أزمنة الأنبياء وما سينزله على رسوله صلى الله عليه وسلم أي لو فُرض إرادة الله أن يكتب كلامَه كله صُحفاً ففُرضت الأشجار كلها مقسمة أقلاماً ، وفرض أن يكون البحر مداداً فكُتب بتلك الأقلام وذلك المدادِ لنفِد البحر ونفِدت الأقلام وما نفدت كلمات الله في نفس الأمر .وأما قوله تعالى : { وتَمَّت كلمات ربّك صدقاً وعدلاً } \\[ الأنعام : 115 \\] فالتمام هنالك بمعنى التحقق والنفوذ ، وتقدم قوله تعالى : { ويريد الله أن يحق الحق بكلماته } في سورة الأنفال ( 7 ) . وقد نُظمت هذه الآية بإيجاز بديع إذ ابتُدئت بحرف { لو } فعلم أن مضمونها أمر مفروض ، وأن ل { لو } استعمالات كما حققه في «مغنى اللبيب» عن عبارة سيبويه . وقد تقدم عند قوله تعالى { ولو أسمعهم لتولَّوا وهم معرضون } في سورة الأنفال ( 23 ) .{ ومن شجرة } بيان ل { ما } الموصولة وهو في معنى التمييز فحقه الإفراد ، ولذلك لم يقل : من أشجار . والأقلام : جمع قلَم وهو العود المشقوق ليرفع به المداد ويكتب به ، أي : لو تصير كل شجرة أقلاماً بمقدار ما فيها من أغصان صالحة لذلك . والأقلام هو الجمع الشائع لقلَم فيرَد للكثرة والقلة . و { يَمّده } بفتح الياء التحتية وضم الميم ، أي : يزيده مِداداً . والمداد بكسر الميم الحِبر الذي يُكتب به . يقال : مَد الدَّوَاةَ يمدُها . فكان قوله { يمده } متضمناً فرض أن يكون البحر مداداً ثم يُزاد فيه إذا نشف مدادُه سبعةُ أبحر ، ولو قيل : يُمده ، بضم الميم من أمد لفات هذا الإيجاز .والسبعة : تستعمل في الكناية عن الكثرة كثيراً كقول النبي صلى الله عليه وسلم \" والكافر يأكل في سبعة أمعاء \" فليس لهذا العدد مفهوم ، أي والبحر يمده أبحر كثيرة .ومعنى { ما نفدت كلمات الله } ما انتهت ، أي : فكيف تحسب اليهود ما في التوراة هو منتهى كلمات الله ، أو كيف يحسب المشركون أن ما نزل من القرآن أوشك أن يكون انتهاء القرآن ، فيكون المَثل على هذا الوجه الآخر وارداً مورد المبالغة في كثرة ما سينزل من القرآن إغاظة للمشركين ، فتكون { كلمات الله } هي القرآن ، لأن المشركين لا يعرفون كلمات الله التي لا يحاط بها .وجملة { إن الله عزيز حكيم } تذييل ، فهو لعزته لا يَغلبه الذين يزعمون عدم الحاجة إلى القرآن ينتظرون انفحام الرسول صلى الله عليه وسلم وهو لحكمته لا تنحصر كلماته لأن الحكمة الحق لا نهاية لها .وقرأ الجمهور برفع { والبحرُ } على أن الجملة الاسمية في موضع الحال والواو واو الحال وهي حال مِن { ما في الأرض من شجرة ، } أي : تلك الأشجار كائنة في حال كون البحر مداداً لها ، والواو يحصل بها من الربط والاكتفاء عن الضمير لدلالتها على المقارنة . وقرأ أبو عمرو ويعقوب { والبحرَ } بالنصب عطفاً على اسم ( إنّ ) .\n\n",
      "translations": [
        {
          "translation": "(And if all the trees in the earth were pens, and the sea) were ink, (with seven more seas to help it) and seven more seas were ink and were used to write the words of Allah and the knowledge of Allah, (the words of Allah could not be exhausted) the words and knowledge of Allah would not be exhausted; it is also said that this means: Allah's providence would not be exhausted. (Allah is Mighty) in His sovereignty and dominion, (Wise) in His command and decree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّا نَفِدَتْ كَلِمَاتُ ٱللَّهِ } معناه أمرُ الله قال: الإِمامُ زيد بن علي عليهما السّلامُ: يقولُ لو كانَ البَحرُ وسَبعةُ أَبحرٍ فيها مدادٌ، لأَملى الله عليهم مَن خَلقهِ حتَّى تَفنى الأَقلامُ وتَيبسُ البُحورُ\n\n",
      "translations": [
        {
          "translation": "\nThe saying of the Most High: {The words of Allah are not exhausted} means the command of Allah. Imam Zayd ibn Ali, peace be upon him, said: If the sea were ink and seven seas after it, Allah would exhaust those who created it until the pens were exhausted and the seas became dry.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مبيناً عن عدم نهاية حضرة علمه منها لها: { وَلَوْ أَنَّ } جميع { مَا فِي ٱلأَرْضِ مِن شَجَرَةٍ } أي: كل ما لها ساق من هذا الجنس { أَقْلاَمٌ وَٱلْبَحْرُ } أي: المحيط الذي هو كرة الماء الكائن حول الأرض { يَمُدُّهُ } أي: يصير مداداً لها وحبراً لثبتها ومدها\n بل يفرض أيضاً { مِن بَعْدِهِ } أي: بعد نفاذ البحر المحيط { سَبْعَةُ أَبْحُرٍ } مثلاً محيطات كذلك تشيعه وتمد مده\n فكتب بهذه الأقلام والمداد على الدوام كلمات الله العلي العلام { مَّا نَفِدَتْ } وتمت { كَلِمَاتُ ٱللَّهِ } وتنفد المدد والأقلام المذكورة\n بل إن فرض أمثالها وأضعافها وآلافها\n إذ الأمور الغير متناهية لا تقدر بمقدار المتناه\n ولا يكال بمكيال مقدر\n وكيف يكال ويقدر علمه { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { عَزِيزٌ } غالب قادر على كل ما جرى في حضرة علمه\n مع أنه لا نهاية لمعلوماته { حَكِيمٌ } [لقمان: 27] لا ينتهي حكمته وقدرته بالنسبة إلى مقدور دون مقدور\n بل له التصرف في كل واحدة من مقدوراته ومراداته إلى ما لايتناهى أزلاً وأبداً\n إذ لا يكتنه طور علمه وخبرته\n وحكمته وقدرته مطلقاً؟!\n\n\nومن جملة مقدوراته الصادرة منه سبحانه على مقضتى حكمته إرادة واختياراً: خلقكم وإيجادكم أولاً على سبيل الإبداع بمقتضى اللطف والجمال\n وإعدامكم ثانياً على مقتضى القهر والجلال\n وإعادتكم وبعثكم ثالثاً إظهاراً للحكم المودعة فيه هوياتكم وأشباحكم\n والمصلحة المندرجة في إيجادكم وإظهاركم\n\n\nوالمحجوبون المقيدون بسلاسل الأزمان والساعات يتوهمون بين الأطوار الثلاثة والنشأة المتعاقبة أمداً بعيداً وأزمنة متطاولة\n وهي عند الله بعدما تعلق إرادته ونفذ قضاؤه\n وصدر عنه الأمر بقوله: كن\n فيكون الكل بلا تراخٍ ومهلةٍ في أقصر مدة وآن\n إذ لا يشغله شأن عن شأن\n ولا يقدر أفعاله زمان ومكان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ولو أنما في الأرض: مذهب الكوفيين وجماعة: أن ما بَعد \" لو \": فاعل بفعل محذوف\n أي: ولو ثبت كون ما في الأرض\n\n إلخ\n ومذهب سيبويه: أنه مبتدأ\n أي: ولو كون ما في الأرض واقع\n والبحر: مبتدأ\n ويمده: خبره\n أي: يمد ما ذكر من الأقلام\n ومن بعده سبعةُ أبحر: مبتدأ وخبر\n وحذف التمييز\n أي: مداداً\n يدل عليه يمده\n أو سبعة: فاعل يمده\n أي: يصب فيه سبعةُ أبحر\n والجملة: حال\n أي: ولو أن الأشجار أقلام\n في حال كون البحر ممدوداً\n ما نفدت\n\n\n إلخ\n وجملة يمده: خبر البحر\n ومن قرأ بالنصب فعطف على اسم \" إن \" \n وهو ما\n يقول الحق جل جلاله: { ولو أنّ ما في الأرض من شجرة } من الأشجار { أقلام } \n والبحر يمد تلك الأقلام\n يصب في ذلك البحر { سبعةُ أبحر } \n وتلك الأقلام كلها تكتب كلمات الله الدالة على عظمته وكمالاته\n { ما نَفِدَتْ } كلماته\n ونفدت الأقلام\n وجفت تلك الأبحر\n وهذا كقوله:\n[الكهف: 109] مع زيادة المبالغة بذكر السبعة أبحر\n يقال: مد الدواة وأمدها: جعل فيها مداداً\n فجعل البحر الأعظم بمنزلة الدواة\n والأبحر السبعة مدادها\n وفروع الأشجار كلها أقلام تكتب كلماته تعالى\n فلو قدر ذلك لتكسرت الأقلام وجفت الأبحر\n قبل ان تنفد كلماته تعالى لأنها تابعة لعلمه\n وعلمه لا نهاية له\n وإنما وحدَّ الشجرة لأن المراد تفصيل الشجر وتقَصِيها شجرة شجرة\n حتى ما يبقى من جنس الشجر\n ولا واحدة إلا وقد بُريت أقلاماً\n وأوتر الكلمات\n وهي من حيز جمع القلة\n على الكَلِم\n الذي هو جمع الكثرة لأن المعنى: أن كلماته لا يفي بها الأقلام فكيف بكلامه الكَثير؟\n { إن الله عزيزٌ } لا يُعجزه شيء\n { حكيم } لا يخرج عن علمه وحكمته شيء\n فلا تنفد كلماته وحكمته\n والآية جواب اليهود\n سألوا رسول الله صلى الله عليه وسلم\n إن قلنا: الآية مدنية\n أو: أَمروا وَفد قريش أن يسألوه عن قوله:\n[الإسراء:85]\n فقالوا: هل عنيتنا أمْ قومك؟ فقال صلى الله عليه وسلم:\n \" كُلاّ قد عنيت \" \nفقالوا: أليس فيما قد أوتيت أنَّا قد أُوتينا التوراة\n فيها علم كل شيء؟ فقال صلى الله عليه وسلم:\n \" هي في علم الله قليل \" \n\n فأنزل الله: { ولو أنما\n\n\n } إلخ\n ولما ذكر شأن كلامه وعلمه ذكر شأن قدرته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:109",
      "similarity": 0.6403961341928565
    },
    {
      "verse": "96:4",
      "similarity": 0.5342101329018057
    },
    {
      "verse": "38:54",
      "similarity": 0.5304069443877051
    },
    {
      "verse": "68:1",
      "similarity": 0.5033081674532353
    },
    {
      "verse": "16:96",
      "similarity": 0.4857139577881541
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}