{
  "chapter": "لقمان",
  "text": "الم تروا۟ ان الله سخر لكم ما فى السموت وما فى الارض واسبغ عليكم نعمه ظهرة وباطنة ومن الناس من يجدل فى الله بغير علم ولا هدى ولا كتب منير",
  "translations": [
    {
      "translation": "Do you not see that Allah has subjected to you everything in the heavens and earth and has showered His blessings upon you, both outwardly and inwardly? Yet there are people who argue about Allah without knowledge or guidance or any illuminating Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God has subjugated what is in the heavens and the earth to you, and bestowed His favours, external and esoteric, in abundance on you? And yet there are men who contend about God without any knowledge or guidance or the Book enlightening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that Allah has subjected to your service all that is in the heavens and on the earth and has abundantly bestowed upon you all His bounties, both visible and invisible? Yet some persons dispute regarding Allah without having any knowledge or guidance or any illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God has made all that is in the heavens and the earth, subservient to you (human beings), and has extended and perfected for you His apparent and unseen bounties? Some people argue about God without knowledge, guidance, or an enlightening book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see that Allah has made all whatever is in the heavens and all whatever is in the earth, subservient for you and bestowed His favours upon you in full, both visible and hidden? And some men argue regarding Allah, with neither knowledge, nor guidance, nor a clear Book!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah has subjected for you whatsoever is in the heavens and whatsoever is on the earth, and has completed and perfected His graces upon you, apparent and hidden Yet of mankind is he who disputes about Allah without knowledge or guidance or a Book giving light!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has made what is in the heavens and what is in the earth subservient to you, and made complete to you His favors outwardly and inwardly? And among men is he who disputes in respect of Allah though having no knowledge nor guidance, nor a book giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how that God has subjected to you whatsoever is in the heavens and earth, and He has lavished on you His blessings, outward and inward? And among men there is such a one that disputes concerning God without knowledge or guidance, or an illuminating Book;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See ye not how Allah hath made serviceable unto you whatsoever is in the skies and whatsoever is in the earth and hath loaded you with His favours both without and within? Yet of mankind is he who disputeth concerning Allah, without knowledge or guidance or a scripture giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God has subjected to you whatever is in the heavens and whatever is on the earth, and has completed His favours to you, both seen and unseen? Yet there are some who dispute concerning God, without knowledge or guidance or an enlightening Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe ye not that Allah hath subjected for you whatsoever is in the heavens and whatsoever is in the earth, and hath completed His favours on you outwardly and inwardly? And yet of mankind is one who disputeth concerning Allah without knowledge and with neither guidance nor a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has disposed for you whatever there is in the heavens and whatever there is in the earth and He has showered upon you His blessings, the outward, and the inward? Yet among the people are those who dispute concerning Allah without any knowledge or guidance or an illuminating scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do ye not see that Allah has subjected to your (use) all things in the heavens and on earth, and has made his bounties flow to you in exceeding measure, (both) seen and unseen? Yet there are among men those who dispute about Allah, without knowledge and without guidance, and without a Book to enlighten them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not (O men) that Allah has subjected for you whatsoever is in the heavens and whatsoever is in the earth, and has completed and perfected His Graces upon you, (both) apparent (i.e. Islamic Monotheism, and the lawful pleasures of this world, including health, good looks, etc.) and hidden [i.e. One's Faith in Allah (of Islamic Monotheism) knowledge, wisdom, guidance for doing righteous deeds, and also the pleasures and delights of the Hereafter in Paradise, etc.]? Yet of mankind is he who disputes about Allah without knowledge or guidance or a Book giving light!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how Allah has subjected to you all that is in the heavens and the earth, and lavished on you His visible and unseen favors? Yet some people would argue about Allah without knowledge, or guidance, or an Illuminating Book'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God placed at your service everything in the heavens and the earth? How He showered you with His blessings, both outward and inward? Yet among the people is he who argues about God without knowledge, without guidance, and without an enlightening Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has made subject to you whatever is in the heavens and whatever is in the earth and amply bestowed upon you His favors, [both] apparent and unapparent? But of the people is he who disputes about Allah without knowledge or guidance or an enlightening Book [from Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:20] Do you not see, do you [not] realise, O you who are being addressed, that God has disposed for you whatever is in the heavens, such as the sun, the moon, and the stars, that you may benefit from them, and whatever is in the earth, of fruits, rivers and animals, and He has showered, He has made abundant and made complete, His favours upon you, [both] outwardly, namely, [by giving you your] wholesome form, even limbs and otherwise, and inwardly?, that is, [by giving you] knowledge and so on. Yet among people, that is, [people such as] the Meccan disbelievers, there are those who dispute concerning God without any knowledge or guidance, from a messenger, or an illuminating scripture, revealed by God, rather [they dispute] by [blindly] imitating [others].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "See ye not) have you not been informed in the Qur'an (how Allah hath made serviceable) has made subservient (unto you whatsoever is in the skies) the sun, the moon, the stars, the clouds and the rain (and whatsoever is in the earth) the trees and beasts (and hath loaded you with) and perfected for you (His favours both without) through the profession of Allah's divine Oneness (and within) through knowledge; it is also said that \"without\" refers to the good works that people know, and \"within\" refers to the evil works that people are not aware of; it is also said that \"without\" refers to food, drink, money and similar things; whereas \"within\" refers to plants, fruits, the rain, water, etc; and it is also said that \"without\" refers to that which Allah blesses one with while \"within\" refers to that which Allah preserves one from? (Yet of mankind) i.e. al-Nadr Ibn al-Harth (is he who disputeth concerning Allah) who argues about the religion of Allah, (without knowledge or guidance) or proof (or a Scripture giving light) or a Scripture expositing what he says.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظَاهِرَةً وَبَاطِنَةً } معناه قَولُ لاَ إِلهَ إلاّ الله ظاهرةٌ باللسانِ باطنةٌ فِي القَلبِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And He has increased you in goodness [visible] and [in] the inner [invisible]} means the saying of \"There is no god but Allah\" is visible by the tongue and hidden in the heart.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَوْاْ } ولمت تعلموا أيها المجبولون على الدربة والدارية { أَنَّ ٱللَّهَ } الحكيم المتقن في عموم أفعاله { سَخَّرَ لَكُمْ } وسهَّل عليكم تتميماً لفضلكم وكرامتكم جميع { مَّا فِي ٱلسَّمَٰوَٰتِ } أي: العلويات التي هي علل وأسباب\n وإن كانت معلولات في أنفسها { وَمَا فِي ٱلأَرْضِ } أي: السفليات\n أي: هي مسببات عن العلويات وقوابل لما يفيض عنها بطريق جري العادة\n ليحصل من امتزاجها ما تعيشون بها\n مترفهين متنعمين من أنواع الفواضل والنعم\n\n\n{ وَ } بالجملة: { أَسْبَغَ } أي: أكثر وأوفر سبحانه { عَلَيْكُمْ } أيها المجبولون على الكرامة الفطرية\n والكمال الجبلي { نِعَمَهُ ظَاهِرَةً } تدركون بها ظواهر الآفاق من المبصرات والمسموعات الملموسات\n والمشمومات والمذوقات { وَبَاطِنَةً } تدركون بها سرائر المعلومات والمعنويات\n وتنكشفون بها إلى المعارف والحقائق الفائضة على قلوبكم التي أودعها الله العليم الحكيم في بواطنك\n ليسع فيها وينزل عليها سلطان وحدته الذاتية السارية في ظواهر الأكوان وبواطنها الكائنة أزلاً وأبداً\n مع أنه سبحانه لا يسعه في سعة السماوات والأرض وإن فرض لها أضعاف وآلاف\n لكنه يسع في قلب عبده العارف المؤمن الموقن\n المنكشف بتوحيده وبظهور وحدته الذاتية المتجلية على صفائح ما ظهر وبطن\n ومع ظهور وحدته سبحانه في ذاته واستقلاله في إظهار المظاهر الكائنة أزلاًَ وأبداً\n\n\n{ وَمِنَ ٱلنَّاسِ } المجبولين على الجدال والنسيان\n المنهمكين في بحر العناد والطغيان { مَن يُجَادِلُ فِي } توحيد { ٱللَّهِ } المتوحد المتفرد بالألوهية والربوبية\n المستقل بالتصرف في ملكه وملكوته إرادةً واختياراً\n ويثبت له شريكاً سواه ويعبده كعبادته\n مع أن جداله ما يستند إلى سندٍ يصلح للاستناد\n بل { بِغَيْرِ عِلْمٍ } دليل عقلي يمكن التوصل به إلى إثبات ما ادعاه بطريق النظر والاستدلال { وَلاَ هُدًى } أي: كشف صريح لدني نبع من قلبه بلا افتقار إلى المقدمات والوسائل العادية التي يستنتج منها المطالب { وَلاَ كِتَابٍ مُّنِيرٍ } [لقمان: 20] أي: دليل نقلي ينور خلده\n ويعده لفيضان المعارف والحقائق من المبدأ الفياض\n بل إنما نشأ ما ادعاه من محض التقليد والتخمين الحاصل من متابعة الوهم والخيال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { أَلَمْ تَرَوْا أن الله سخر لكم ما في السماوات والأرض } \n يعني: الشمس\n والقمر\n والنجوم\n والسحاب\n والمطر\n وغير ذلك\n { وما في الأرض } \n يعني: البحار والأنهار\n والأشجار\n والثمار\n والدواب\n والمعادن\n وغير ذلك\n { وأسْبَغَ }: أتم { عليكم نِعَمَه } \n بالجمع\n والإفراد إرادة الجنس\n والنعمة: ما يسر به الإنسان ويتلذذ به\n حال كونها { ظاهرةً } ما تدرك بالحس\n { وباطنة } ما تدرك بالعلم والوجدان\n فقيل: الظاهرة\n السمع\n والبصر\n واللسان\n وسائر الجوارح الظاهرة\n والباطنة: القلب\n والعقل\n والفهم\n وما أشبه ذلك\n أو: الظاهرة: الصحة والعافية\n والكفاية والباطنة: الإيمان\n واليقين\n والعلم والمعرفة بالله\n وسيأتي في الإشارة بقيتها\n رُوي أن موسى عليه السلام قال: دُلني على أخفى نعمتك على عبادك\n فقال: أخفى نعمتي عليهم: النَّفسُ\n هـ\n قلت: إذ بمجاهدتها تحصل السعادة العظمى\n ولا وصول إليه إلا بمجاهدتها والغيبة عنها\n وفي هذا المعنى كان شيخ شيخنا يقول: جزاها الله عنا خيراً ما ربحنا إلا منها\n هـ\n وقيل: الظاهرة: تحسين الخلْق\n والباطنة: حُسْنُ الخلقُ\n وقال ابن عباس: الظاهرة: ما سوى من خلقك\n والباطنة: ما ستر من عيوبك\n { ومن الناس من يُجادل في الله } بعد هذه النعم المتواترة\n أي: في توحيده وصفاته ودينه\n { بغير علم } مستفاد من دليل ولا برهان\n { ولا هُدىً } اي: هداية رسول\n { ولا كتاب منير } أنزله الله\n بل بمجرد التقليد الردي\n نزلت في النضر بن الحارث\n وقد تقدمت في الحج",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:11",
      "similarity": 0.45694410301456356
    },
    {
      "verse": "22:8",
      "similarity": 0.17539530123536326
    },
    {
      "verse": "7:33",
      "similarity": 0.16760332241853076
    },
    {
      "verse": "57:3",
      "similarity": 0.1591933812492413
    },
    {
      "verse": "43:13",
      "similarity": 0.13905978230609023
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/31:20.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/31:20.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/31:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}