{
  "chapter": "لقمان",
  "text": "ذلك بان الله هو الحق وان ما يدعون من دونه البطل وان الله هو العلى الكبير",
  "translations": [
    {
      "translation": "That is because Allah - He is the Truth, and what you call upon besides Him is falsehood. Allah is the All- High, the Most Great.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so for God is the Reality, and what they invoke other than Him is illusion. Indeed God is all-high and supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All this is because Allah, He alone, is the Truth and all that which they call upon beside Him is false. Surely Allah, He alone, is All-High, Incomparably Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because God is the supreme Truth and whatever they worship besides Him is falsehood. God is the Most High and the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because only Allah is the Truth, and all that they worship besides Him are falsehood, and because only Allah is the Supreme, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah, He is the Truth, and that which they invoke besides Him is falsehood; and that Allah, He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah is the Truth, and that which they call upon besides Him is the falsehood, and that Allah is the High, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God -- He is the Truth, and that they call upon apart from Him -- that is the false; and for that God is the All-high, the All-great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (is so) because Allah, He is the True, and that which they invoke beside Him is the False, and because Allah, He is the Sublime, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God is the Truth, and what they call upon besides Him is falsehood. God is the Most High, the Supreme One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah! He is the Truth, because whatsoever they call upon beside Him is falsehood, and because He is the Exalted, the Grand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah is the Reality, and whatever they invoke besides Him is nullity, and because Allah is the All-exalted, the All-great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah is the (only) Reality, and because whatever else they invoke besides Him is Falsehood; and because Allah,- He is the Most High, Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah, He is the Truth, and that which they invoke besides Him is Al-Batil (falsehood, Satan and all other false deities), and that Allah, He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Allah is the Truth, while that which they call upon, other than Him, is false. For that Allah is the Most High, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God is the Reality, and what they worship besides Him is falsehood, and because God is the Exalted, the Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah is the Truth, and that what they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:30] That, which is mentioned, is [so] because God, He is the Truth, the established [truth], and whatever they call on (read yad‘ūna; or tad‘ūna, ‘you call on’) whatever they worship, besides Him is, evanescent, falsehood, and because God is the High [Exalted], above His creation by virtue of [His] subjugation [of them], the Great, the Mighty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That (is so)) in order that you know and believe (because Allah, He is the True) worshipping Him is the Truth, (and that which they invoke) that which they worship (beside Him is the False) is falsehood, (and because Allah, He is the Sublime) more sublime than all things, (the Great) greater than all things. 467\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما ظهر منه سبحانه كل { ذَلِكَ } الذي سمعتم أيها المجبولون على فطرة الدراية والعرفان، والمترصد لانكشاف سرائر التوحيد والإيقان من بدائع القدرة والألوهية، وعدائب العلم والإرادة، وغرائب الشئون والأطوار اللامعة من لوائح لوامع شرقوق شمس الذات؛ ليدل { بِأَنَّ ٱللَّهَ } المتجلي على عروش الأنفس والآفاق بالأصالة والاستحقاق الوجود { هُوَ ٱلْحَقُّ } الثابت المثبت أزلاً وأبداً، القيوم المطلق، الدائم الباقي وبلا انقضاء ولا انصرام\n\n\n\n\n{ وَأَنَّ مَا يَدْعُونَ مِن دُونِهِ } ويدعون الوجود له من العكوس والأظلال الهالكة في شروق شمس الذات { ٱلْبَاطِلُ } المقصور، المنحصر على العدم والبطلان، المستهلك في مضيق الإمكان بأنواع الخذلان والحرمان { وَ } بالجملة: اعلموا أيها المتأملون في آثار الوجود الإلهي المتحقق بوحدة ذاته، وكثرة شئونه وتطوراته حسب أسمائه وصفاته { أَنَّ ٱللَّهَ } المستقل بالألوهية والربوبية، المستحق لأنواع التذلل والعبودية { هُوَ ٱلْعَلِيُّ } بذاته لا بالإضافة إلى غيره؛ إذ لا غير معه { ٱلْكَبِيرُ } [لقمان: 30] في شئونه وتطوراته حسب تجلياته الجمالية والجلالية، واللطفية والقهرية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } شاهد { بأن الله هو الحقُّ } ، وما سواه باطل، { وأن ما تدعون من دونه الباطل } المعدوم في حد ذاته، لا حقيقة لوجوده\n أو: ذلك الذي وصف بما وصف به، من عجائب قدرته وباهر حكمته، التي يعجز عنها الأحياء القادرون العالمون، فكيف بالجماد الذي يدعونه من دون الله؟ إنما هو بسبب أنه الحق الثابت الإلهية، وأن مَن دونه باطل ألوهيته، { وأن الله هو العلي الكبير } ، أي: العلي الشأن، الكبير السلطان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:62",
      "similarity": 0.9999999999999998
    },
    {
      "verse": "47:3",
      "similarity": 0.4910945152045058
    },
    {
      "verse": "47:33",
      "similarity": 0.4819077779356633
    },
    {
      "verse": "40:12",
      "similarity": 0.4504481196107419
    },
    {
      "verse": "8:8",
      "similarity": 0.43834032696509045
    }
  ]
}