{
  "chapter": "لقمان",
  "text": "يايها الناس اتقوا۟ ربكم واخشوا۟ يوما لا يجزى والد عن ولده ولا مولود هو جاز عن والده شيـا ان وعد الله حق فلا تغرنكم الحيوة الدنيا ولا يغرنكم بالله الغرور",
  "translations": [
    {
      "translation": "Mankind! have taqwa of your Lord and fear a day when no father will be able to atone for his son, or son for his father, in any way. Allah's promise is true. So do not let the life of this world delude you and do not let the Deluder delude you concerning Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, fear your Lord and dread the day when no father will avail a son, nor son his father. Truly the promise of God is true. Do not be deluded by the life of this world, and do not let the deceiver draw you away from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, fear (the wrath) of your Lord, and dread the Day when no father will stand for his child, nor any child stand for his father. Surely Allah's promise is true. So let the life of this world not beguile you, nor let the Deluder delude you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind, have fear of your Lord and the day when a father will be of no avail to his son, nor will a son carry any part of the burden of his father. The promise of God is true. Do not let the worldly life deceive you nor let your pride deceive you about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Fear your Lord, and fear the Day in which no father will benefit his child; nor will any good child be of any benefit to the father; indeed Allah’s promise is true; so never may the worldly life deceive you; and never may the great cheat deceive you in respect of Allah’s commands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Have Taqwa of your Lord, and fear a Day when no father can avail aught for his son, nor a son avail aught for his father. Verily, the promise of Allah is true, let not then this present life deceive you, nor let the chief deceiver deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! guard against (the punishment of) your Lord and dread the day when a father shall not make any satisfaction for his son, nor shall the child be the maker of any satisfaction for his father; surely the promise of Allah is true, therefore let not this world's life deceive you, nor let the archdeceiver deceive you in respect of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, fear your Lord, and dread a day when no father shall give satisfaction for his child, and no child shall give satisfaction for his father whatever. Surely God's promise is true; so let not the present life delude you, and let not the Deluder delude you concerning God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Keep your duty to your Lord and fear a Day when the parent will not be able to avail the child in aught, nor the child to avail the parent. Lo! Allah's promise is the very truth. Let not the life of the world beguile you, nor let the deceiver beguile you, in regard to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, seek protection with your Lord and fear the Day when neither will the father be of any avail to his son, nor will the son be of any avail to his father. God's promise is surely true. So let not worldly life beguile you, nor let the Deceiver deceive you concerning God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind! fear your Lord and dread a Day whereon no father shall atone for his son, and no son shall atone for his father at all. Verily the promise of Allahs is true. Let not the life of the world beguile you, and let not the great beguiler beguile you in regard to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Be wary of your Lord and fear the day when a father will not atone for his child, nor the child will atone for its father in any wise. Indeed Allah’s promise is true. So do not let the life of the world deceive you, nor let the Deceiver deceive you concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! do your duty to your Lord, and fear (the coming of) a Day when no father can avail aught for his son, nor a son avail aught for his father. Verily, the promise of Allah is true: let not then this present life deceive you, nor let the chief Deceiver deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Be afraid of your Lord (by keeping your duty to Him and avoiding all evil), and fear a Day when no father can avail aught for his son, nor a son avail aught for his father. Verily, the Promise of Allah is true, let not then this (worldly) present life deceive you, nor let the chief deceiver (Satan) deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, fear your Lord, and fear the Day when no father shall ransom a thing for his child nor a child for his father. The promise of Allah is surely true. So do not let the life of this present world delude you, nor let the deluder (satan) delude you concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Be conscious of your Lord, and dread a Day when no parent can avail his child, nor can a child avail his parent, in anything. The promise of God is true. Therefore, do not let this life deceive you, nor let illusions deceive you regarding God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, fear your Lord and fear a Day when no father will avail his son, nor will a son avail his father at all. Indeed, the promise of Allah is truth, so let not the worldly life delude you and be not deceived about Allah by the Deceiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:33] O people, namely, [such as] the people of Mecca, fear your Lord and fear a day when no parent shall avail a child, thereon in any way; and no child, thereon, shall avail its parent in any way. Surely God’s promise, of resurrection, is true. So do not let the life of this world deceive you, [and divert you] from Islam, and do not let the Deceiver, Satan, deceive you concerning God, because of His forbearance and granting [people] respite.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind) people of Mecca! (Keep your duty to your Lord) obey your Lord (and fear a Day) fear the torment of a day (when the parent will not be able to avail the child in aught) in relation to Allah's chastisement, (nor the child to avail the parent. Lo! Allah's promise) resurrection after death (is the very truth) will truly take place. (Let not the life of the world) the comfort and adornment of the life of this world (beguile you, nor let the deceiver) Satan; it is also said this means: falsehoods (beguile you, in regard to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَّ يَجْزِي وَالِدٌ عَن وَلَدِهِ وَلاَ مَوْلُودٌ هُوَ جَازٍ عَن وَالِدِهِ } يعني لا يُغْنِي\n\n\n\n\nوقوله تعالى: { وَلاَ يَغُرَّنَّكُم بِٱللَّهِ ٱلْغَرُورُ } معناه الشَّيطانُ\n\n",
      "translations": [
        {
          "translation": " The saying of the Almighty: {No father is responsible for his son, nor is a child responsible for his father}, means that no one is responsible for anyone.\n\nAnd his saying, \"Do not let Satan deceive you about Allah.\" The meaning of Satan is deception.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } المجبولون على الكفران والنسيان\n المشغولون عن البغي والعدوان { ٱتَّقُواْ رَبَّكُمْ } الذي أظهركم من كتم العدم ولم تكونوا شيئاً مذكوراً\n واحذروا عن بطشه وانتقامه\n فإن بطشه شديد\n وعذابه لعصاة عباده أليم مزيد { وَٱخْشَوْاْ يَوْماً } وأي يوماً { لاَّ يَجْزِي } أي: لا يقضي ولا يسقط ولا يحمل { وَالِدٌ } مع كمال عطفه ورأفته { عَن } وزر { وَلَدِهِ وَلاَ مَوْلُودٌ هُوَ جَازٍ عَن وَالِدِهِ شَيْئاً } بل كل نفس حينئذٍ رهينة ما كسبت\n ضمينة ما اكتسبت بمقتضى ما وعد الله لها وككتب\n وبالجملة: { إِنَّ وَعْدَ ٱللَّهِ } الذي وعده لعباده { حَقٌّ } لا ريب في إنجامه\n ولا خلف في وقوعه { فَلاَ تَغُرَّنَّكُمُ } أيها المجبولون على الغفلة والغرور { ٱلْحَيَاةُ ٱلدُّنْيَا } يتغريرها وتلبيساتها من مالها وجاهها\n ولذاتها الفانية الغير القارة { وَلاَ يَغُرَّنَّكُم بِٱللَّهِ } عفوه وغفرانه\n وسعة رحمته وجوده { ٱلْغَرُورُ } [لقمان: 33] أي: الشيطان المبالغ في الغرور والتغرير بأن يجبركم على المعاصي اتكالاً على عفو الله وغفرانه\n\n\nثمَّ لمَّا أتى الحرث بن عمرو رسول الله صلى للعلهي وسلم فقال: متى تقوم الساعة\n وأني قد ألقيت بذراً على الأرض فمتى تمطر السماء\n وامرأتي ذات حمل حملها ذكر أم أنثى\n وما أعمل غداً\n وأين أموت؟\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: بأي أرض قال في المصباح: الأفصح: استعمال \" أي \" في الشرط والاستفهام بلفظ واحد، للمذكر والمؤنث، وعليه قوله تعالى:\n\n[غافر: 81]، وقد تطابق في التذكير والتأنيث، نحو أَيُّ رَجُلٍ، وأي وأية امرأة\n وفي الشاذ: بأية أرض تموت\n هـ\n يقول الحق جل جلاله: { أيها الناس اتقوا ربكم } اجعلوا بينكم وبين غضبه وقاية، بطاعته وترك معصيته\n { واخشوا يوماً لا يجزي والدٌ عن ولده } شيئاً، لا يقضى عنه شيئاً، ولا يدفع عنه شيئاً\n والأصل: لا يجزى فيه، فحذف\n { ولا مولودٌ هو جازٍ عن والده شيئاً } ، وتغيير النظم في حق الولد، بأن أكده بالجملة الاسمية وبزيادة لفظ هو، وبالتعبير بالمولود للدلالة على حَسْمِ أطماعهم في أن ينفعوا آبائهم الذين ماتوا على الكفر بالشفاعة في الآخرة\n ومعنى التأكيد في لفظ المولود: أن الواحد منهم لو شفع للأب الأدنى الذي ولد منه لم تقبل منه، فضلاً عن أن يشفع لأجداده، لأن الولد يقع على الولد وولد الولد، بخلاف المولود لأنه لِمَا وُلِدَ منك\n كذا في الكشاف\n قلت: وهذا في حق الكفار، وأما المؤمنون فينفع الولد والده، والوالد ولده بالشفاعة، كما ورد في قارئ القرآن والعالمِ، وكل من له جاه عند الله، كما تقدم في سورة مريم\n ثم قال تعالى: { إِنَّ وعدَ الله } بالبعث والحساب والجزاء، { حقٌّ } لا يمكن خلفه، { فلا تغرنكم الحياةُ الدنيا } بزخارفها الغرارة فإِنَّ نعمها دانية، ولذاتها فانية، فلا تشغلكم عن التأهب للقاء، بالزهد فيها، والتفرغ لِمَا يرضي الله، من توحيده وطاعته، { ولا يغُرُّنَّكم بالله } ، أي: لا يعرضنكم لخطر الغرة بالله وبحلمه، أو: لا يوقعنكم في الجهل بالله والغرة به، { الغرورُ } أي: الشيطان، أو: الدنيا، أو: الأمل\n وفي الحديث:\n\n \" الكيسَ من دَانَ نَفسَهُ وعَمِلَ لَمَا بَعْدَ المَوْتِ، والأحمقُ من أَتْبَعَ نَفْسَهُ هَوَاهَا، وتمنَّى عَلَى الله الأمَاني \" \n\nوفي الحديث أيضاً:\n\n \" كَفَى بخشية الله علماً، وبالاغترار به جهلاً \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:5",
      "similarity": 0.7561464048349651
    },
    {
      "verse": "82:6",
      "similarity": 0.5125118142261682
    },
    {
      "verse": "6:130",
      "similarity": 0.42039256087105104
    },
    {
      "verse": "4:120",
      "similarity": 0.4075448323094227
    },
    {
      "verse": "33:12",
      "similarity": 0.4045048068341062
    }
  ]
}