{
  "chapter": "لقمان",
  "text": "الم تر ان الفلك تجرى فى البحر بنعمت الله ليريكم من ءايته ان فى ذلك لءايت لكل صبار شكور",
  "translations": [
    {
      "translation": "Do you not see that ships sail on the sea by Allah's blessing so that He can show you something of His Signs? There are certainly Signs in that for everyone who is steadfast and thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that the ships sail in the ocean by the grace of God, that He may show you some of His glories. Verily there are signs in this for those who are constant and give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that ships sail in the sea by Allah's Grace that He may show you some of His Signs? Surely there are Signs in this for everyone who is steadfast, thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that the ships sail in the ocean through the bounty of God so that He may show you the evidence (of His existence). There is evidence (of the truth) in this for every forbearing and grateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see that the ship sails on the sea by Allah’s grace, so that He may show you some of His signs? Indeed in this are signs for every greatly enduring, grateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that the ships sail through the sea by Allah's grace that He may show you of His signs Verily, in this are signs for every patient, grateful (person).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that the ships run on in the sea by Allah's favor that He may show you of His signs? Most surely there are signs in this for every patient endurer, grateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that the ships run upon the sea by the blessing of God, that He may show you some of His signs? Surely in that are signs for every man enduring, thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how the ships glide on the sea by Allah's grace, that He may show you of His wonders? Lo! therein indeed are portents for every steadfast, grateful (heart).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how the ships sail on the sea by God's grace so that He may show you some of His signs? Surely therein are signs for every steadfast, thankful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observest thou not that the ship saileth in the sea by the favour of Allah that he may shew you of His signs? Verily therein are signs for every persevering, grateful heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that the ships sail at sea with Allah’s blessing, that He may show you some of His signs? There are indeed signs in that for every patient and grateful [servant].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that the ships sail through the ocean by the Grace of Allah?- that He may show you of His Signs? Verily in this are Signs for all who constantly persevere and give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that the ships sail through the sea by Allah's Grace? that He may show you of His Signs? Verily, in this are signs for every patient, grateful (person).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how the ships run upon the sea, by the Favor of Allah so that He may show you His signs? Surely, there are signs in this for every steadfast, thankful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how the ships sail through the sea, by the grace of God, to show you of His wonders? In that are signs for every persevering, thankful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that ships sail through the sea by the favor of Allah that He may show you of His signs? Indeed in that are signs for everyone patient and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:31] Have you not seen that the ships run upon the sea by the grace of God, that He may show you, O you who are being addressed in this [statement], some of His signs? Surely in that there are signs, lessons, for every [servant who is] steadfast, [in abstaining] from acts of disobedience to God, grateful, for His grace.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed (how the ships glide on the sea by Allah's grace, that He may show you of His wonders? Lo! Therein) in that which I have mentioned (indeed are portents) signs and lessons (for every steadfast) in obedience, (grateful (heart)) for Allah's bounties.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وشواهد ساطعات { لِّكُلِّ صَبَّارٍ } صبر على متاعب ما جرى عليه من القضاء { شَكُورٍ } [لقمان: 31] لما وصل إليهم من الآلاء والنعماء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألم تَرَ أن الفلكَ } السفن { تجري في البحر بنعمةِ الله } بإحسانه ورحمته، أو: بالريح، لأن الريح من نعم الله\n أو: ما تحمله السفن من الطعام والأرزاق والمتاع، فالباء، حينئذٍ، للأرزاق، وهو استشهاد آخر على باهر قدرته، وكمال حكمته، وشمول إنعامه\n { ليُريَكم من آياته } من عجائب قدرته في البحر إذا ركبتموه، { إن في ذلك لآياتٍ } دالة على وحدانيته وكمال صفاته { لكل صبَّارٍ } في بلائه، { شكورٍ } لنعمائه\n وهما من صفة المؤمن\n فالإيمان نصفان، نصف شكر ونصب صبر، فلا يَعْتَبِرُ بعجائب قدرته إلا من كان هكذا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:12",
      "similarity": 0.6661112590734266
    },
    {
      "verse": "30:46",
      "similarity": 0.5132066082247995
    },
    {
      "verse": "42:32",
      "similarity": 0.4833049811201643
    },
    {
      "verse": "14:32",
      "similarity": 0.47517706117151665
    },
    {
      "verse": "23:22",
      "similarity": 0.41612626968877514
    }
  ]
}