{
  "chapter": "لقمان",
  "text": "ان الله عنده علم الساعة وينزل الغيث ويعلم ما فى الارحام وما تدرى نفس ماذا تكسب غدا وما تدرى نفسۢ باى ارض تموت ان الله عليم خبيرۢ",
  "translations": [
    {
      "translation": "Truly Allah has knowledge of the Hour and sends down abundant rain and knows what is in the womb. And no self knows what it will earn tomorrow and no self knows in what land it will die. Allah is All-Knowing, All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only God has the knowledge of the Hour. He sends rain from the heavens, and knows what is in the mothers' wombs. No one knows what he will do on the morrow; no one knows in what land he will die. Surely God knows and is cognisant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah alone has the knowledge of the Hour. It is He Who sends down the rain and knows what is in the wombs, although no person knows what he will earn tomorrow, nor does he know in which land he will die. Indeed, Allah is All-Knowing, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only God has the knowledge of the coming of the Hour of Doom. He sends down the rain and knows what is in the wombs. No soul is aware of what it will achieve tomorrow and no soul knows in which land it will die. God is All-knowing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah has the knowledge of the Last Day! And He sends down the rain; and He knows all what is in the mothers’ wombs; and no soul knows what it will earn tomorrow; and no soul knows the place where it will die; indeed Allah is the All Knowing, the Informer. (He may reveal the knowledge to whomever He wills.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah, with Him is the knowledge of the Hour, He sends down the rain, and knows that which is in the wombs. No person knows what he will earn tomorrow, and no person knows in what land he will die. Verily, Allah is All-Knower, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah is He with Whom is the knowledge of the hour, and He sends down the rain and He knows what is in the wombs; and no one knows what he shall earn on the morrow; and no one knows in what land he shall die; surely Allah is Knowing, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God -- He has knowledge of the Hour; He sends down the rain; He knows what is in the wombs. No soul knows what it shall earn tomorrow, and no soul knows in what land it shall die. Surely God is All-knowing, All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah! With Him is knowledge of the Hour. He sendeth down the rain, and knoweth that which is in the wombs. No soul knoweth what it will earn to-morrow, and no soul knoweth in what land it will die. Lo! Allah is Knower, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, God alone has knowledge of the Hour. He sends down the rain, and He knows what is in the wombs. No soul knows what it will earn tomorrow, and no soul knows in what land it will die. Surely, God is all knowing, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah! with Him alone is the knowledge of the Hour, and He it is who sendeth down the rain and knoweth that which is in the wombs: and no person knoweth whatsoever it shall earn on the morrow, and a person knoweth not in whatsoever land he shall die. Verily Allah is Knowing, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the knowledge of the Hour is with Allah. He sends down the rain, and He knows what is in the wombs. No soul knows what it will earn tomorrow, and no soul knows in what land it will die. Indeed Allah is all-knowing, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the knowledge of the Hour is with Allah (alone). It is He Who sends down rain, and He Who knows what is in the wombs. Nor does any one know what it is that he will earn on the morrow: Nor does any one know in what land he is to die. Verily with Allah is full knowledge and He is acquainted (with all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah! With Him (Alone) is the knowledge of the Hour, He sends down the rain, and knows that which is in the wombs. No person knows what he will earn tomorrow, and no person knows in what land he will die. Verily, Allah is All-Knower, All-Aware (of things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, He alone has knowledge of the Hour. He sends down the rain and He knows what is in the wombs. No soul knows what he will earn tomorrow; and no soul knows in what land it will die. Surely, Allah is the Knower, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With God rests the knowledge of the Hour. He sends down the rain, and He knows what the wombs contain. No soul knows what it will reap tomorrow, and no soul knows in what land it will die. God is All-Knowing, Well-Informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah [alone] has knowledge of the Hour and sends down the rain and knows what is in the wombs. And no soul perceives what it will earn tomorrow, and no soul perceives in what land it will die. Indeed, Allah is Knowing and Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:34] Lo! God, with Him lies knowledge of the Hour, when it will come to pass; and He sends down (read yunzilu, or yunazzilu) the rain, at times which [only] He knows; and He knows what is in the wombs, whether it is a male or a female; and not one of the three things is known by anyone other than God, exalted be He. And no soul knows what it will earn tomorrow, of good or evil, but God, exalted be He, knows this; and no soul knows in what land it will die, but God, exalted be He, knows this. Truly God is Knower, of all things, Aware, of the inward and outward aspects thereof. Al-Bukhārī reported [by way of an isnād] from [‘Abd Allāh] Ibn ‘Umar the following hadīth: ‘The Keys of the Unseen are five: Lo! God, with Him lies knowledge of the Hour … to the end of the sūra’ [above]. Meccan, except for verses 16 to 20 inclusive, which are Medinese; it consists of 30 verses revealed after [sūrat] al-Mu’minūn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Lo! Allah! With Him is knowledge of the Hour) knowledge of the advent of the Hour which is kept hidden from the servants. (He sendeth down the rain) He knows when the rain comes down but this is hidden from people, (and knoweth that which is in the wombs) whether it is a male or female, felicitous or damned while this is hidden from the servants. (No soul knoweth what it will earn tomorrow) of good or evil while this is hidden from the servants, (and no soul knoweth in what land it will die) in what manner it will die because it is hidden from the servants. (Lo! Allah is Knower) of His creation, (Aware) of their works and of what touches them of benefit or harm'. And of the surah in which prostration is mentioned, which is all Meccan and consists of 29 verses, 330 words and 1,518 letters: Surah 32: Prostration (al-Sajdah) And of the surah in which prostration is mentioned, which is all Meccan and consists of 29 verses, 330 words and 1,518 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفنزلت { إِنَّ ٱللَّهَ } المستقل باطلاع الغيوب { عِندَهُ عِلْمُ ٱلسَّاعَةِ } وقت قيامها\n ولم يطلع أحداً عليها سوى أنه سبحانه أخبر بوقوعها وقيامها في جميع الكتب المنزلة من عنده على رسله { وَ } أيضاً هو { يُنَزِّلُ ٱلْغَيْثَ } ولم يُطلع أحداً بوقت نزوله { وَيَعْلَمُ } أيضاً سبحانه { مَا فِي ٱلأَرْحَامِ } ولم يُطلع أحداً عليه { وَ } أيضاً { مَا تَدْرِي } وتعلم { نَفْسٌ } من النفوس { مَّاذَا تَكْسِبُ } وتعمل { غَداً } وإن تدبرت وتدربت\n وبذلت جهدها وسعيها لا تفوز إلى دراية أحوال غدها\n بل هو أيضاً من جملة المغيبات التي أحاط بها علمه سبحانه بلا اطلاع أحد عليها { وَمَا تَدْرِي } وتعلم { نَفْسٌ } أيضاً\n وإن بالغت في السعي وبذل الجهد والطاقة { بِأَيِّ أَرْضٍ تَمُوتُ } بل هو أيضاً من جملة الغيوب التي استأثر الله بها\n بالجملة: { إِنَّ ٱللَّهَ } المستقل بالألوهية والربوبية\n المستجمع لجميع أوصاف الكمال { عَلَيمٌ } لا يعزب عن حيطة حضرة علمه ذرة { خَبِيرٌ } [لقمان: 34] لا يخرج عن حيطة خبرته طرفة\n وإن كان لا يكتنه علمه وخبرته\n والله أعلم بحقائق أسمائه وصفاته\n ودقائق معلومات\n ورقائق آثاره ومصنوعاته المترتبتة عليها\n\n\nربنا ذرنا بفضلك وجودك علماً تنجينا عن الجهل بك وبأسمائك وأوصافك\n إنك على ما تشاء قدير\n\n\nخاتمة السورة\n\nعليك أيها الموحد المتحقق بمقام التوحيد\n والمتمكن في مقعد الصدق\n خالياً عن إمارة التخمين والتقليد ألاَّ تتأمل ولا تتمنى في نفسك حصول ما لا يسع في وسعك وطاقتك من الأمور التي ليست في استعدادك وقابليتك حصولها وانكشافها دونك\n إذ الإنسان وإن سعى\n بذل جهده في طريق العرفان بعدما وفقه الحق وجذبه نحوه لا يبلغ إلاَّ التخلق بأخلاقه الله والفناء في ذاته\n منخلعاً عن لوازم ناسوته بقدر ما يتمكن له\n ويسع فيب قابليته واستعداده\n\nوأمَّا الاطلاع على جميع معلوماته سبحانه\n والانكشاف بالمغيبات التي استأثر الله به في غيب ذاته فأمر لا يحوم حوله إدراك أحد من الأنبياء والرسل\n والكمَّل من أرباب الولاء والمحبة الخالصة\n بل لا يتفوه به أحد من خلَّص عباده أصلاً\n إذ هو خارج عن استعداداتهم مطلقاً\n وما المعجزات والكرامات الخارقة للعادة الصادرة عن خواص عباد الله من الأنبياء والأولياء\n فما صدرت أيضاً منهم هذه الأمور إلا بإطلاع اليه إياهم\n وتوفيقهم عليها\n وهم مجبورون مضطرون في ظهور أمثال تلك الكرامات عنهم\n مع أن بعض أرباب المحبة والولاء الوالهين بمطالعة جمال الله وجلاله تحزنوا\n وتغمموا عند ظهور أمثال هذه الخوارق منهم\n لمنافاتها بصرافة استغراقهم\n كما تشاهد من بعض بدلاء الزمان\n أدام الله بركته على معارف أهل الإيمان والعرفان\n\n\nوبالجملة: لا بدَّ أن يكون الموحد متمسكاً بحبل الرضا والتسليم بما جرى عليه من صلوجان القضاء بلا تطلب منه وترقب له\n\n\nجعلنا الله ممن تمكن بمقام الرضا\n ورضي بجميع ما أثبت له الحق في لوح القضاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ إن الله عنده علمُ الساعة } أي: وقت قيامها\n فلا يعلمه غيره\n فتأهبوا لها\n قبل أن تأتيكم بغتة\n { ويُنزل الغيث }: عطف على ما يقتضيه الظرف من الفعل\n أي: إن الله يُثبت عنده علم الساعة\n ويُنزل الغيث في وقته\n من غير تقديم ولا تأخير\n وفي محله\n على ما سبق في التقدير\n ويعلم كم قطرة ينزلها\n وفي أي بقعة يمطرها\n { ويعلم ما في الأرحام } أذكر أم أنثى\n أتام أم ناقص\n وشقي أو سعيد\n وحسن أو قبيح\n { وما تدري نفس ماذا تكْسِبُ غداً } من خير أو شر\n ووفاق وشقاق\n فربما كان عازمة على الخير فعملت شراً\n أو على شر فعملت خيراً\n { وما تدري نفس بأي أرضٍ تموتُ } أي: أين تموت\n فربما أقامت بأرض\n وضربت أوتادها\n وقالت: لا أبرحُها\n فترمي بها مرامي القدر حتى تموت بمكان لم يخطر ببالها\n\nرُوي أن ملك الموت مرَّ على سليمان عليه السلام فجعل ينظر إلى رجل من جلسائه\n فقال الرجل: مَن هذا؟ فقال: ملك الموت\n فقال: كأنه يُريدني\n فسأل سليمانَ أن يحمله الريح ويلقيه ببلاد لهند\n ففعل\n ثم قال ملك الموت لسليمان: كان دوام نظري إليه تعجباً منه\n لأني أُمرت أن أقبض روحه بالهند\n وهو عندك\n هـ\n وجعل العلم لله والدرايةَ للعبد\n لِمَا في الدراية من معنى التكسب والحيلة\n فهذه الأمور الخمسة قد اختص الله بعلمها\n وأما المنجم الذي يُخبر بوقت الغيث والموت فإنه يقول بالقياس والنظر في المطالع\n وما يُدرَك بالدليل لا يكون غيباً\n على أنه مجرد الظن\n والظن غير العلم\n وعن ابن عباس: من ادعى علم هذه الخمسة فقد كذب\n وجاءه يهودي منجم\n فقال: إن شئت أنبأتك أنه يحم ابنك ويموت بعد عشرة أيام\n وأنت لا تموت حتى تعمى\n وأنا لا يحول عليّ الحول حتى أموت\n قال له: أين موتك؟ قال: لا أدري\n فقال ابن عباس: صدق الله: { وما تدري نفس بأي أرض تموت }\n ورأى المنصورُ في منامه ملك الموت\n وسأله عن مدة عمره\n فأشار بأصابعه الخمس\n فعبرها المعبرون بخمس سنين\n وبخمسة أشهر وبخمسة أيام\n فقال أبو حنيفة رضي الله عنه: هو إشارة إلى هذه الآية\n فإن هذه العلوم الخمسة لا يعلمها إلا الله\n هـ\n وقال شيخ شيوخنا\n سيدي عبد الرحمن الفاسي في حاشيته: قيل: إن الله تعالى يعلم الأشياء بالوَسم والرسم\n والرسم يتغير\n والوسم لا يتغير\n فقد أخفى الله تعالى الساعة\n ولم يخف أمارتها\n كما جاء عن صاحب الشرع\n وكذا قد يطلع أولياءه على بعض غيبه\n ولكن لا من كل وجوهه\n فقد يعلم نزول المطر من غير تعين وقته واللحظة التي ينزل فيها ومقداره\n وبالجملة فعلمُ ما يكون من الخواص\n جُملة لا تفصيلي\n وجزئي لا كُلي\n ومقيد لا مطلق\n وعرضي لا ذاتي\n بخلاف علمه تعالى\n هـ\n قال المحلي: روى البخاري عن ابن عمر حديث مفاتح الغيب الخمس: { إن الله عنده علم الساعة\n\n\n } إلى آخر السورة\n\n ونقل ابن حجر عن ابن أبي جمرة\n بعد كلام\n ما نصه: والحكمة في جعلها خمسة: الإشارة إلى حصر العوالم فيها\n ففي قوله: { ما تغيض الأرحام }: الإشارة إلى ما يزيد في الإنسان وما ينقص\n وخص الرحم بالذكر\n لكون الأكثر يعرفونها بالعادة\n ومع ذلك فنفى أن يعرفها أحد بحقيقتها\n فغيرها بطريق الأولى\n وفي قوله: لا يعلم متى يأتي المطر: إشارة إلى أمور العالم العلوي\n وخص المطر مع أن له أسباباً قد تدل على وقوعه\n لكنه من غير تحقيق\n وفي قوله: \" لا تدري نفس بأي أرض تموت \": إشارة إلى أمور العالم السفلي\n مع أن عادة أكثر الناس أن يموت ببلده\n ولكن ليس ذلك حقيقة\n وإن مات ببلده لا يعلم بأي بقعة يُدفن فيها\n ولو كان هناك مقبرة لأسلافه\n بل قبر أعده هو له\n\nوفي قوله: \" ولا يعلم ما في غد إلا الله \": إشارة إلى أنواع الزمان\n وما فيها من الحوادث\n وعبَّر بلفظ غدٍ لكون حقيقته أقربَ الأزمنة إليه\n وإذا كان مع قربه لا يعلم حقيقة ما يقع فيه\n مع إمكان الأمارة والعلامة\n فما بعدُ عنه أولى\n وفي قوله: \" متى تقوم الساعة إلا الله \" إشارة إلى علوم الآخرة\n فإن يوم القيامة أولها\n وإذا انتفى علم الأقرب انتقى علم ما بعدُ\n فجمعت الآية أنواع الغيوب\n وأزالت جميع الدعاوى الفاسدة\n وقد بيّن في قوله تعالى\n في الآية الأخرى\n وهي قوله:\n[الجن:26\n 27] الآية\n أن الإطلاع على شيء من هذه الأمور لا يكون إلا بتوقيف\n هـ ملخصاً\n والحاصل: أن العوالم التي اختص الله بها خمسة: عالم القيامة وما يقع فيه\n والعالم العلوي وما ينشأ منه\n وعالم الأرض وما يقع فيه\n وعالم الإنسان وما يجري عليه\n وعالم الزمان وما يقع فيه\n { إن الله عليم خبير } عليم بالغيوب\n خبير بما كان وبما يكون\n وعن الزهري: أَكْثِرُوا من قراءة سورة لقمان فإن فيها أعاجيب هـ\n الإشارة: يا أيها الناس المتوجهون إلى الله\n إنَّ وَعْدَ الله بالفتح\n لمن أنهض همته إليه\n حق\n فلا تغرنكم الحياة الدنيا بأشغالها\n عن النهوض إليها\n ولا يغرنكم بكرم الله الشيطانُ الغرور\n فيغركم بكرم الله\n ويصرفكم عن المجاهدة والمكابدة إذ لا طريق إلى الوصول إلا منهما\n إن الله عنده علم الساعة التي يفتح عليها العبد فيها\n وينزل غيث المواهب والواردات\n ويعلم ما في أرحام الإرادة\n من تربية المعرفة واليقين\n وما تدري نفس ماذا تكسب غداً من زيادة الإيمان ونقصانه\n وما تلقاه من المقادير الغيبية\n فيجب عليها التفويض والاستسلام\n وانتظار ما يفعل الله بها في كل غد\n وما تدري نفس بأي أرض من العبودية تموت فيها\n إن الله عليم خبير\n قال القشيري: في قوله: { يا أيها الناس اتقوا ربكم }: خوّفهم\n تارةً\n بأفعاله\n فيقول:\n[البقرة: 48 وغيرها]\n وتارة بصفاته\n فيقول:\n[العلق: 14]\n وتارة بذاته\n فيقول:\n[آل عمرآن: 28]\n هـ\n وبالله التوفيق\n ولا حول ولا قوة إلا بالله العلي العظيم\n وصلى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:28",
      "similarity": 0.527985884319847
    },
    {
      "verse": "12:49",
      "similarity": 0.46262801919545715
    },
    {
      "verse": "59:18",
      "similarity": 0.2930695173183225
    },
    {
      "verse": "40:46",
      "similarity": 0.2434115885869905
    },
    {
      "verse": "57:20",
      "similarity": 0.23475031619192274
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}