{
  "chapter": "لقمان",
  "text": "واذا غشيهم موج كالظلل دعوا۟ الله مخلصين له الدين فلما نجىهم الى البر فمنهم مقتصد وما يجحد بـايتنا الا كل ختار كفور",
  "translations": [
    {
      "translation": "When the waves hang over them like canopies, they call on Allah, making their deen sincerely His. But then when He delivers them safely to the land, some of them are ambivalent. None but a treacherous, thankless man denies Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the waves overshadow them like a canopy, they pray to God with all-exclusive faith in Him. But after He has safely brought them to the shore, there are some who vacillate between doubt and belief, but no one rejects Our signs except those who are perverse and disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When waves engulf them (in the sea) like canopies, they call upon Allah, consecrating their faith solely to Him. But when He delivers them safely to the land, some of them become lukewarm. None denies Our Signs except the perfidious, the ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the waves cover them like shadows, they pray to God with sincerity in their religion, but when We bring them safely to land, only some of them follow the right path. No one rejects Our revelations except the treacherous ungrateful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a wave comes upon them like mountains, they pray to Allah believing purely in Him; then when He brings them safely to land, some of them remain upon justice; and none will deny Our signs except an extremely unfaithful, ungrateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when waves cover them like shades, they invoke Allah, making their invocations for Him only. But when He brings them safe to land, there are among them those that stop in between. And Our Ayat are not denied except by every Khattar Kafur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a wave like mountains covers them they call upon Allah, being sincere to Him in obedience, but when He brings them safe to the land, some of them follow the middle course; and none denies Our signs but every perfidious, ungrateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the waves cover them like shadows they call upon God, making their religion sincerely His; but when He has delivered them to the land, some of them are lukewarm. And none denies Our signs, except every ungrateful traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a wave enshroudeth them like awnings, they cry unto Allah, making their faith pure for Him only. But when He bringeth them safe to land, some of them compromise. None denieth Our signs save every traitor ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the waves engulf them like shadows [of death], they call to God, sincere [at that moment] in their faith in Him alone: but as soon as He has brought them safe ashore, only some of them take the right course. And none denies Our signs save the perfidious and ungrateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a wave covereth them like awnings, they call upon Allah, making their religion pure for Him. Then when He delivereth them on the land, only some of them keep to the middle course. And none gainsaith Our signssave each perfidious, ingrate one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When waves cover them like awnings; they invoke Allah, putting exclusive faith in Him. But when He delivers them towards land, [only] some of them remain unswerving. No one will impugn Our signs except an ungrateful traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a wave covers them like the canopy (of clouds), they call to Allah, offering Him sincere devotion. But when He has delivered them safely to land, there are among them those that halt between (right and wrong). But none reject Our Signs except only a perfidious ungrateful (wretch)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a wave covers them like shades (i.e. like clouds or the mountains of sea-water), they invoke Allah, making their invocations for Him only. But when He brings them safe to land, there are among them those that stop in the middle, between (Belief and disbelief). But none denies Our Signs except every perfidious ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the waves, like shadows, envelop them, they call to Allah making their religion sincerely His, but no sooner does He bring them safely to land then some of them are halfhearted. None denies Our verses, except the ungrateful traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When waves, like canopies, cover them, they call upon God, devoting their religion to Him. But when He has delivered them to dry land, some of them waver. No one renounces Our revelations except the treacherous blasphemer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when waves come over them like canopies, they supplicate Allah, sincere to Him in religion. But when He delivers them to the land, there are [some] of them who are moderate [in faith]. And none rejects Our signs except everyone treacherous and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:32] And if waves cover them, that is, [if] these rise above the disbelievers, like awnings, like mountains that act as awnings over those below them, they call on God, sincere before Him in their faith, that is, [in their] supplication, that He may deliver them, in other words, they do not call on any other [god] with Him; but when He delivers them to land, some of them compromise, middling between belief and disbelief, while others persist in their disbelief. And none denies Our signs, an example of which is Our delivering [them] from [such treacherous] waves, except every perfidious ingrate, [ungrateful] for God’s graces, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if a wave enshroudeth them like awnings) like the clouds in their tremendousness, (they cry unto Allah, making their faith pure for Him only. But when He bringeth them safe to land, some of them) some of the disbelievers (compromise) in their speech and works, such that they are softer than they were. (None denieth Our signs) Muhammad (pbuh) and the Qur'an (save every traitor ingrate) who disbelieves in Allah and is ungrateful for His bounties.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا غَشِيَهُمْ مَّوْجٌ كَٱلظُّلَلِ } معناه سَحائبٌ سُودٌ كَثيرةُ الماءِ\n\n\n\n\nوقوله تعالى: { كُلُّ خَتَّارٍ } معناه غَدَّارٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال صبرهم وشكرهم { إِذَا غَشِيَهُمْ } وغطاهم { مَّوْجٌ } عظيم، واستعلى مغلقاً عليهم { كَٱلظُّلَلِ } المغيظة إياهم من الجبال والسحب { دَعَوُاْ ٱللَّهَ } الواحد الأحد الصمد، المنجي لهم عن أمثاله { مُخْلِصِينَ لَهُ ٱلدِّينَ } منحصرين التوجه والانقياد إليه بلا ميل منهم إلى الأسباب والوسائل العادية، متضرعين نحوه، داعين إليه بلا رؤية الوسائل في البين على ما هو مقتضى التوحيد { فَلَمَّا نَجَّاهُمْ } سبحانه بفضله من أهوال البحر ومضيقه، وأوصلهم { إِلَى ٱلْبَرِّ } وسعة فضائه سالمين غانمين { فَمِنْهُمْ } حينئذٍ { مُّقْتَصِدٌ } أي: معتدل في قصده نحو الحق، غير مائل إلى طرفي الإفراط والتفريط، ومنهم مائل عن الاعتدال، منحرف عنه، ساعٍ إلى تحصيله { وَ } بالجملة: { مَا يَجْحَدُ } منهم، وينكر { بِآيَاتِنَآ } الدالة على وحدة ذاتنا، وكمال أسمائنا وصفاتنا { إِلاَّ كُلُّ خَتَّارٍ } غدار ناقض للعهد الفطري، والميثاق الجبلي { كَفُورٍ } [لقمان: 32] للآلاء والنعماء المترادفة المتوالية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا غَشِيَهُم } ، أي: الكفار، أي: علاهم وغطاهم { موجٌ كالظُّلَلِ } ، أي: كشيء يظل من جبل، أو سحاب، أو غيرهما، فالموج الكبير يرتفع فيعود كالظلل جمع ظُلة، وهو ما أظلك من جبل أو سقف\n فإذا غشيهم ذلك { دَعَوُاْ الله مخلصين له الدينَ } ، لا يدعون معه غيره، لزوال ما ينازع الفطرة بالقهرية\n { فلما نجاهم إلى البر فمنهم مقْتَصِدٌ } مقيم على الطريق القصد، باقٍ على الإيمان، الذي هو التوحيد، الذي كان منه في حال الشدة، لم يعد إلى الكفر، أو: متوسط في الظلم والكفر، انزجر بعض الانزجار\n ولم يَغْلُ في الكفر والعدوان\n أو مُقْتَصِدٌ في الإخلاص الذي كان عليه في البحر، يعني: أن ذلك الإخلاص لحادث عند الخوف لا يبقى لأحد قط، إلا النادر، { وما يجحد بآياتنا } أي: بحقيقتها { إلا كل ختَّارٍ } غدار\n\n\nوالختْر: أقبح الغدر، { كفورٍ } لنعم ربه\n وهذه الكلمات متقابلة لفظاً ومعنى، فَخَتَّارٌ: مقابل صبّار، وكفور: مقابل شكور لأن من غدر لم يصبر، ومن كفر لم يشكر\n والله تعالى أعلم\n الإشارة: ألم تر أن الله يُولج ليل القبض في نهار البسط، ونهار البسط في ليل القبض، فهما يتعاقبان على العبد تعاقب الليل والنهار، فإذا تأدب مع كل واحد منهما زاد بهما معاً، وإلا نقص بهما، أو بأحدهما\n فآداب القبض: الصبر والرضا، والسكون تحت مجاري الأقدار\n وآداب البسط: الحمد، والشكر، والإمساك عن الفضول في كل شيء\n وسخَّر شمس العيان وقمر الإيمان، كلٌّ يجري إلى أجل مسمى فقمر الإيمان يجري إلى طلوع شمس العرفان، وشمس العرفان إلى ما لا نهاية له من الأزمان\n ذلك بأن الله هو الحق، وما سواه باطل\n فإذا جاء الحق، بطلوع شمس العيان، زهق الباطل، إن الباطل كان زهوقاً\n وإنما أثبته الوهم والجهل\n ألم تر أن سفن الأفكار تجري في بحار التوحيد، لترى عجائب الأنوار وغرائب الأسرار، من أنوار الملكوت وأسرار الجبروت؟ إن في ذلك لآياتٍ لكل صبَّار على مجاهدة النفس، شكور على نعمة الظَّفَرِ بحضرة القُدُّوسِ\n وإذا غشيهم،، في حال استشرافهم على بحر الحقيقة، موج من أنوار ملكوته، فكادت تدهشهم، تضرعوا والتجأوا إلى سفينة الشريعة، حتى يتمكنوا فلما نجاهم إلى بر الشريعة، فمنهم مقتصد معتدل بين جذب وسلوك، بين حقيقة وشريعة، ومنهم: غالبٌ عليه السكر والجذب، ومنهم: غالب عليه الصحو والسلوك\n وكلهم أولياء الله، ما ينكرهم ويجحدهم إلا كل ختَّار جاحد\n قال القشيري: { وإذا غشيهم موج كالظلل } إذا تلاطمت عليهم أمواجُ بحارالتقدير، تمنوا أن تلفظهم تلك البحارُ إلى سواحل السلامة، فإذا جاء الحقُّ بتحقيق مُناهم عادوا إلى رأس خطاياهم\n\n\nثم ختم بالوعظ والتذكير، فقال: { يٰأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ\n\n\n }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:22",
      "similarity": 0.23078676247968455
    },
    {
      "verse": "24:40",
      "similarity": 0.18527445811726795
    },
    {
      "verse": "16:9",
      "similarity": 0.17681905486419772
    },
    {
      "verse": "35:32",
      "similarity": 0.1733797923240071
    },
    {
      "verse": "18:99",
      "similarity": 0.17230623731642983
    }
  ]
}