{
  "chapter": "لقمان",
  "text": "ومن الناس من يشترى لهو الحديث ليضل عن سبيل الله بغير علم ويتخذها هزوا او۟لئك لهم عذاب مهين",
  "translations": [
    {
      "translation": "But there are some people who trade in distracting tales to misguide people from Allah's Way knowing nothing about it and to make a mockery of it. Such people will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But among men are also those who spread frivolous stories to mislead (others) from the way of God, without any knowledge, and take it lightly. For such as these the nemesis will be shameful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some human beings who purchase an enchanting diversion in order to lead people away from the way of Allah without having any knowledge, who hold the call to the Way of Allah to ridicule. A humiliating chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In an attempt to show that God's revelations are only ancient legends) some people pay for meaningless tales to draw others attention away from the Quran without knowledge and treat as a matter of fun. They will suffer a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some people buy words of play, in order to mislead from Allah’s path, without knowledge; and to make it an article of mockery; for them is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who purchases idle talk (Lahw Al-Hadith) to mislead from the path of Allah without knowledge, and takes it by way of mockery. For such there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of men is he who takes instead frivolous discourse to lead astray from Allah's path without knowledge, and to take it for a mockery; these shall have an abasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some men there are who buy diverting talk to lead astray from the way of God without knowledge, and to take it in mockery; those -- there awaits them a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who payeth for mere pastime of discourse, that he may mislead from Allah's way without knowledge, and maketh it the butt of mockery. For such there is a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But among men there are some who spend their time in idle diversions only to lead people astray from the path of God, and without knowledge, hold it up to ridicule: for such there is a humiliating punishment in store.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is one who purchaseth an idle discourse, that he may mislead from Allah's way without knowledge, and taketh it by way of mockery. These! for them shall be a torment ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he who buys diversionary talk that he may lead [people] astray from Allah’s way without any knowledge, and he takes it in derision. For such there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are, among men, those who purchase idle tales, without knowledge (or meaning), to mislead (men) from the Path of Allah and throw ridicule (on the Path): for such there will be a Humiliating Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who purchases idle talks (i.e. music, singing, etc.) to mislead (men) from the Path of Allah without knowledge, and takes it (the Path of Allah, the Verses of the Quran) by way of mockery. For such there will be a humiliating torment (in the Hell-fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some people who would purchase distracting talk, to lead astray from the Path of Allah without knowledge, and take it in mockery; for those is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he who trades in distracting tales; intending, without knowledge, to lead away from God’s way, and to make a mockery of it. These will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he who buys the amusement of speech to mislead [others] from the way of Allah without knowledge and who takes it in ridicule. Those will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:6] And among people there is he who purchases idle talk, in other words, that [part of it] which diverts [people] from its [true] significance, that he may lead [people] astray (read li-yadilla; or li-yudilla) from the way of God, the religion of Islam, without knowledge and take it (read [subjunctive] wa-yattakhidhahā as a supplement to yudilla, ‘that he may lead astray’; or [indicative] wa-yattakhidhuhā as a supplement to yashtarī, ‘who buys’) in mockery, as something to be mocked. For such there will be a humiliating chastisement, one of abasement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا أُولَئِكَ لَهُمْ عَذَابٌ مُهِينٌ (6) عطف على جملة { تلك ءايات الكتاب الحكيم } \\[ لقمان : 2 \\] . والمعنى : أن حال الكتاب الحكيم هدى ورحمة للمحسنين ، وأن من الناس معرضين عنه يؤثرون لهو الحديث ليضلّوا عن سبيل الله الذي يهدي إليه الكتاب . وهذا من مقابلة الثناء على آيات الكتاب الحكيم بضد ذلك في ذم ما يأتي به بعض الناس ، وهذا تخلّص من المقدمة إلى مَدخل للمقصود وهو تفظيع ما يدعو إليه النضر بن الحارث ومشايعوه من اللهو بأخبار الملوك التي لا تكسب صاحبها كمالاً ولا حكمة .وتقديم المُسند في قوله { من الناس } للتشويق إلى تلقي خبره العجيب . والاشتراء كناية عن العناية بالشيء والاغتباط به وليس هنا استعارة بخلاف قوله { أولئك الذين اشتروا الضلالة بالهدى } في سورة البقرة ( 16 ) ؛ فالاشتراء هنا مستعمل في صريحه وكنايته : فالصريح تشويه لاقتناء النضر بن الحارث قِصص رستم وإسفنديار وبهرام ، والكناية تقبيح للذين التّفوا حوله وتلقّوا أخباره ، أي من الناس من يشغله لهو الحديث والولع به عن الاهتداء بآيات الكتاب الحكيم .واللهو : ما يُقصد منه تشغيل البال وتقصير طول وقت البطالة دون نفع ، لأنه إذا كانت في ذلك منفعة لم يكن المقصود منه اللهو بل تلك المنفعة . ولهو الحديث } ما كان من الحديث مراداً للهو فإضافة { لهو } إلى { الحديث } على معنى { مِن } التبعيضية على رأي بعض النحاة ، وبعضهم لا يثبت الإضافة على معنى { من } التبعيضية فيردها إلى معنى اللام .وتقدم اللهو في قوله { وما الحياة الدنيا إلا لعب ولهو } في سورة الأنعام ( 32 ) . والأصح في المراد بقوله { ومن الناس من يشتري لهو الحديث } أنه النضر بن الحارث فإنه كان يسافر في تجارة إلى بلاد فارس فيتلقى أكاذيب الأخبار عن أبطالهم في الحروب المملوءة أكذوبات فيقصّها على قريش في أسمارهم ويقول : إن كان محمد يحدثكم بأحاديث عاد وثمود فأنا أحدثكم بأحاديث رستم وإسفنديار وبهرام . ومن المفرسين من قال : إن النضر كان يشتري من بلاد فارس كُتب أخبار ملوكهم فيحدث بها قريشاً ، أي بواسطة من يترجمها لهم . ويشمل لفظ { النَّاس } أهل سامره الذين ينصتون لما يقصه عليهم كما يقتضيه قوله تعالى إثره { أولئك لهم عذاب مهين } .وقيل المراد ب { من يشتري لهو الحديث } من يقتني القينات المغنيات . روى الترمذي عن علي بن يزيد عن القاسم بن عبد الرحمان عن أبي أمامة عن رسول الله صلى الله عليه وسلم قال : « لا تبيعوا القينات ولا تشتروهن ولا خير في تجارةٍ فيهن وثمنُهن حرام » في مثل ذلك أُنزلت هذه الآية { ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله } إلى آخر الآية . قال أبو عيسى : هذا حديث غريب إنما يروى من حديث القاسم عن أبي أمامة وعلي بن يزيد يضعف في الحديث سمعت محمداً يعني البخاري يقول علي بن يزيد يضعف اه .وقال ابن العربي في «العارضة» : في سبب نزولها قولان : أحدهما أنها نزلت في النضر بن الحارث . الثاني أنها نزلت في رجل من قريش قيل هو ابن خطل اشترى جارية مغنية فشغل الناس بها عن استماع النبي صلى الله عليه وسلم اه . وألفاظ الآية أنسب انطباقاً على قصة النضر بن الحارث .ومعنى { ليضل عن سبيل الله } أنه يفعل ذلك ليلهي قريشاً عن سماع القرآن فإن القرآن سبيل موصل إلى الله تعالى ، أي إلى الدين الذي أراده ، فلم يكن قصده مجرد اللهو بل تجاوزه إلى الصد عن سبيل الله ، وهذا زيادة في تفظيع عمله . وقرأ الجمهور { ليُضل } بضم الياء . وقرأه ابن كثير وأبو عمرو بفتح الياء ، أي ليزداد ضلالاً على ضلاله إذ لم يكتف لنفسه بالكفر حتى أخذ يبث ضلاله للناس ، وبذلك يكون مآل القراءتين متحدّ المعنى .ويتعلق { ليضل عن سبيل الله } بفعل { يشتري } ويتعلق به أيضاً قوله { بغير علم } لأن أصل تعلق المجرورات أن يرجع إلى المتعلَّق المبني عليه الكلام ، فالمعنى : يشتري لهو الحديث بغير علم ، أي عن غير بصيرة في صالح نفسه حيث يستبدل الباطل بالحق . والضمير المنصوب في { يتخذها } عائد إلى { سبيل الله ، } فإن السبيل تؤنث . وقرأ الجمهور { ويتخذُها } بالرفع عطفاً على { يشتري ، } أي يشْغل الناس بلهو الحديث ليصرفهم عن القرآن ويتخذ سبيل الله هزؤاً . وقرأه حمزة والكسائي وحفص عن عاصم ويعقوب وخلف بالنصب عطفاً على { ليضل ، } أي يلهيهم بلهو الحديث ليضلهم وليتخذ دين الإسلام هزءاً . ومآل المعنى متّحد في القراءتين لأن كلا الأمرين من فعله ومن غرضه . وأما الإضلال فقد رُجح فيه جانب التعليل لأنه العلة الباعثة له على ما يفعل .والهزؤ : مصدر هَزأ به إذا سخر به كقوله { ولا تتخذوا آيات الله هزؤاً } \\[ البقرة : 231 \\] ولما كان { من يشتري لهو الحديث } صادقاً على النضر بن الحارث والذين يستمعون إلى قصصه من المشركين جيء في وعيدهم بصيغة الجمع { أولئك لهم عذاب مهين } .واختير اسم الإشارة للتنبيه على أن ما يرد بعد اسم الإشارة من الخبر إنما استحقه لأجل ما سبق اسمَ الإشارة من الوصف .وجملة أولئك لهم عذاب مهين } معترضة بين الجملتين جملة { من يشتري } وجملة { وإذا تتلى عليه آياتنا } فهذا عطف على جملة { يشتري } الخ . والتقدير : ومن الناس من يشتري الخ و { إذا تتلى عليه ءاياتنا ولى مستكبراً } ؛ فالموصول واحد وله صلتان : اشتراء لهو الحديث للضلال ، والاستكبار عندما تتلى عليه آيات القرآن .\n\n",
      "translations": [
        {
          "translation": "(And of mankind) the reference here is to al-Nadr Ibn al-Harith (is he who payeth for mere pastime of discourse) discourse of falsehood, books on legends, on the sun, the stars, mathematics and singing; it is also said this means: associating partners with Allah, (that he may mislead) by means of it (from Allah's way) from Allah's religion and obedience (without knowledge) or proof, (and maketh it the butt of mockery. For such there is a shameful doom) for these, there is a severe chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدثنا علي بن أحمد\n قال: حدثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السَّلامُ في قولهِ تعالى: { وَمِنَ ٱلنَّاسِ مَن يَشْتَرِي لَهْوَ ٱلْحَدِيثِ } معناه الغِناءُ والمُغنياتُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n He said: Ali ibn Ahmad narrated to us\n\n\n{And of the people is he who buys idle talk to divert [others] from the way of Allah without knowledge and who takes it in ridicule. Those will have a humiliating punishment.}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱلنَّاسِ } المجبولين على كفران نعم الله\n ونسيان حقوق كرمه وجوده { مَن يَشْتَرِي } ويستبدل آيات الكتاب المشتمل على أنواع الفضائل والكمالات\n وأصناف الهدى والكرامات { لَهْوَ ٱلْحَدِيثِ } أي: يستبدل الآيات الإلهية\n ويختار بدلها من الأراجيف الكاذبة ما يلهي النفوس\n ويشغلها عما يعينها ويفيدها\n ويقربها إلى ما لا يعنيها ويضرها\n وما ارتكب ذلك الضال المضل بما ارتكب من الاشتراء والاستبدال الفاسد إلاَّ { لِيُضِلَّ } ويصرف { عَن سَبِيلِ ٱللَّهِ } من يميل إليها ويتوجه نحوها\n ليتدين بدين الله\n وينقاد لنبيه على مقتضى فطرته الأصلية\n مع أنه صدر عنه هذا الصرف والمنع { بِغَيْرِ عِلْمٍ } يتعلق به منه نقلاً\n عن جهل مرتكز في جبلته\n وحميته مركوزة في خبث طينته طبيعته\n\n{ وَ } بسبب ذلك الجهل الجبلي { يَتَّخِذَهَا } إلى الآيات الموصلة إلى طريق الحق وتوحيده { هُزُواً } أي: محل استهزاء وسخرية\n لجهله وغفلته عن السرائر المودعة فيها\n والأسرار المكنونة في فحاويها { أُوْلَـٰئِكَ } البعداء المجبولون عن الغواية والضلالة أصلاً وفرعاً\n تابعاً ومتبوعاً { لَهُمْ } في النشأة الأخرى { عَذَابٌ مُّهِينٌ } [لقمان: 6] يهينهم فيها بدل ما استهانوا بكتاب الله\n واستهزءوا برسله ظلماً وزوراً بلا تدرب وتدبر\n\n\n{ وَ } من شدة شكيمته\n وبغضه بالله ورسوله وكتابه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ومن الناس من يشتري لَهْوَ الحديث } أي: ما يلهى به عما يقرب إلى الله كالأحاديث التي لا أصل لها\n والخرافات التي لا حقيقة لها\n والمضاحك\n وفضول الكلام\n قيل: نزلت في النَّضر بن الحارث\n كان يخرج إلى فارس للتجارة\n فيشتري أخبار الأعاجم\n ثم يُحدث قريشاً بها\n ويقول: إن محمداً يُحدثكم بأخبار عاد وثمود\n وأنا أحدثكم بحديث رُسْتُم\n وأخبار الأكاسرة\n فيستملحُون حديثه ولا يسمعون القرآن\n وقيل: كان يشتري القيان\n ويحملهن على معاشرة من أراد الإسلام ليصده عنه\n  والإشتراء من الشراء\n كما تقدم عن النضر\n ومن البدل\n كقوله:\n[آل عمران: 177]\n استبدلوه واختاروه\n أي: يختار حديث الباطل على حديث الحق\n وإضافة اللهو إلى الحديث\n للتبيين بمعنى \" من \" لأن اللهو يكون من الحديث ومن غيره\n فيبين بالحديث\n والمراد بالحديث: الحديث المكروه\n كما جاء في الحديث:\n \" الحديث في المسجد يأكل الحسنات\n كما تأكل البهيمة الحشيش \" \n\n أو: للتبعيض\n كأنه قيل: ومن الناس من يشتري بعض الحديث الذي فيه اللهو\n وقال مجاهد: يعني: شراء المغنيات والمغنيين\n أي: يشتري ذات لهو\n أو ذا لهو الحديث\n وقال أبو أمامة: قال عليه الصلاة والسلام:\n \" لا يحل تعليم المغنيات\n ولا بيعهن\n وأثْمانُهنَّ حرام \" \nوفي مثل هذا نزلت هذه الآية\n ثم قال:\n \" وما من رجل يرفع صوته بالغناء إلا بعث الله عليه شيطانين: أحدهما على هذا المنكب\n والآخر على هذا المنكب\n فلا يزالان يضربان بأرجلهما حتى يسكت \"\n \nقلت: هذا مقيد بِشِعْرِ الهوى لأهل الهوى\n وأما أهل الحق الذين يسمعون من الحق\n فلا يتوجه الحديث لهم\n وسيأتي في الإشارة تحقيقه إن شاء الله\n ثم قال أبو أمامة رضي الله عنه قال صلى الله عليه وسلم:\n \" إن الله تعالى بعثني هدى ورحمة للعالمين\n وأمرني ربي بمحو المعازف والمزامير والأوثان\n والصلب وأمر الجاهلية\n وحلف ربي بعزته لا يشرب عبد من عبيدي جرعة خمر متعمداً إلا سقيته مثلها من الصديد يوم القيامة\n مغفوراً له أو معذباً\n ولا سقاها غيره إلا فعلت به مثل ذلك\n لا يتركها عبد من مخافتي إلا سقيته من حياض القدس يوم القيامة \" \nانظر الثعلبي\n ثم قال تعالى: { ليضل عن سبيل الله } أي: فعل ذلك لِيَضل هو عن طريق الله ودينه\n أو ليُضل غيره عنه\n أو عن القرآن\n { بغير علم } أي: جهلاً منه بما عليه من الوزر\n { ويتخذها } أي: السبيل { هُزُواً } وسخرية\n فمن رفع: استأنف\n ومن نصب\n عطفها على ليضل\n { أولئك لهم عذاب مهين } يُهِينُهم ويخزيهم\n و \" مَنْ \" \n لإبهامه\n يقع على الواحد والجمع\n والمراد: النضر ومن تبعه\n\n{ وإذا تُتلى عليه آياتنا وَلَّى مُستكبراً } أعرض عن تدبرها متكبراً رافعاً نفسه عن الإصغاء إلى القرآن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:9",
      "similarity": 0.48534751855073477
    },
    {
      "verse": "80:10",
      "similarity": 0.440780332737392
    },
    {
      "verse": "102:1",
      "similarity": 0.4223792197563585
    },
    {
      "verse": "63:9",
      "similarity": 0.3769896395211602
    },
    {
      "verse": "21:17",
      "similarity": 0.3575212565167363
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/031006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/031006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/31:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}