{
  "chapter": "لقمان",
  "text": "ومن الناس من يشترى لهو الحديث ليضل عن سبيل الله بغير علم ويتخذها هزوا او۟لئك لهم عذاب مهين",
  "translations": [
    {
      "translation": "But among men are also those who spread frivolous stories to mislead (others) from the way of God, without any knowledge, and take it lightly. For such as these the nemesis will be shameful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some human beings who purchase an enchanting diversion in order to lead people away from the way of Allah without having any knowledge, who hold the call to the Way of Allah to ridicule. A humiliating chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In an attempt to show that God's revelations are only ancient legends) some people pay for meaningless tales to draw others attention away from the Quran without knowledge and treat as a matter of fun. They will suffer a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some people buy words of play, in order to mislead from Allah’s path, without knowledge; and to make it an article of mockery; for them is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who purchases idle talk (Lahw Al-Hadith) to mislead from the path of Allah without knowledge, and takes it by way of mockery. For such there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of men is he who takes instead frivolous discourse to lead astray from Allah's path without knowledge, and to take it for a mockery; these shall have an abasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some men there are who buy diverting talk to lead astray from the way of God without knowledge, and to take it in mockery; those -- there awaits them a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who payeth for mere pastime of discourse, that he may mislead from Allah's way without knowledge, and maketh it the butt of mockery. For such there is a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But among men there are some who spend their time in idle diversions only to lead people astray from the path of God, and without knowledge, hold it up to ridicule: for such there is a humiliating punishment in store.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is one who purchaseth an idle discourse, that he may mislead from Allah's way without knowledge, and taketh it by way of mockery. These! for them shall be a torment ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he who buys diversionary talk that he may lead [people] astray from Allah’s way without any knowledge, and he takes it in derision. For such there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are, among men, those who purchase idle tales, without knowledge (or meaning), to mislead (men) from the Path of Allah and throw ridicule (on the Path): for such there will be a Humiliating Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who purchases idle talks (i.e. music, singing, etc.) to mislead (men) from the Path of Allah without knowledge, and takes it (the Path of Allah, the Verses of the Quran) by way of mockery. For such there will be a humiliating torment (in the Hell-fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some people who would purchase distracting talk, to lead astray from the Path of Allah without knowledge, and take it in mockery; for those is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he who trades in distracting tales; intending, without knowledge, to lead away from God’s way, and to make a mockery of it. These will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he who buys the amusement of speech to mislead [others] from the way of Allah without knowledge and who takes it in ridicule. Those will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:6] And among people there is he who purchases idle talk, in other words, that [part of it] which diverts [people] from its [true] significance, that he may lead [people] astray (read li-yadilla; or li-yudilla) from the way of God, the religion of Islam, without knowledge and take it (read [subjunctive] wa-yattakhidhahā as a supplement to yudilla, ‘that he may lead astray’; or [indicative] wa-yattakhidhuhā as a supplement to yashtarī, ‘who buys’) in mockery, as something to be mocked. For such there will be a humiliating chastisement, one of abasement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of mankind) the reference here is to al-Nadr Ibn al-Harith (is he who payeth for mere pastime of discourse) discourse of falsehood, books on legends, on the sun, the stars, mathematics and singing; it is also said this means: associating partners with Allah, (that he may mislead) by means of it (from Allah's way) from Allah's religion and obedience (without knowledge) or proof, (and maketh it the butt of mockery. For such there is a shameful doom) for these, there is a severe chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدثنا علي بن أحمد\n قال: حدثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السَّلامُ في قولهِ تعالى: { وَمِنَ ٱلنَّاسِ مَن يَشْتَرِي لَهْوَ ٱلْحَدِيثِ } معناه الغِناءُ والمُغنياتُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱلنَّاسِ } المجبولين على كفران نعم الله، ونسيان حقوق كرمه وجوده { مَن يَشْتَرِي } ويستبدل آيات الكتاب المشتمل على أنواع الفضائل والكمالات، وأصناف الهدى والكرامات { لَهْوَ ٱلْحَدِيثِ } أي: يستبدل الآيات الإلهية، ويختار بدلها من الأراجيف الكاذبة ما يلهي النفوس، ويشغلها عما يعينها ويفيدها، ويقربها إلى ما لا يعنيها ويضرها، وما ارتكب ذلك الضال المضل بما ارتكب من الاشتراء والاستبدال الفاسد إلاَّ { لِيُضِلَّ } ويصرف { عَن سَبِيلِ ٱللَّهِ } من يميل إليها ويتوجه نحوها؛ ليتدين بدين الله، وينقاد لنبيه على مقتضى فطرته الأصلية، مع أنه صدر عنه هذا الصرف والمنع { بِغَيْرِ عِلْمٍ } يتعلق به منه نقلاً، عن جهل مرتكز في جبلته، وحميته مركوزة في خبث طينته طبيعته\n\n\n{ وَ } بسبب ذلك الجهل الجبلي { يَتَّخِذَهَا } إلى الآيات الموصلة إلى طريق الحق وتوحيده { هُزُواً } أي: محل استهزاء وسخرية؛ لجهله وغفلته عن السرائر المودعة فيها، والأسرار المكنونة في فحاويها { أُوْلَـٰئِكَ } البعداء المجبولون عن الغواية والضلالة أصلاً وفرعاً، تابعاً ومتبوعاً { لَهُمْ } في النشأة الأخرى { عَذَابٌ مُّهِينٌ } [لقمان: 6] يهينهم فيها بدل ما استهانوا بكتاب الله، واستهزءوا برسله ظلماً وزوراً بلا تدرب وتدبر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ومن الناس من يشتري لَهْوَ الحديث } أي: ما يلهى به عما يقرب إلى الله كالأحاديث التي لا أصل لها، والخرافات التي لا حقيقة لها، والمضاحك، وفضول الكلام\n قيل: نزلت في النَّضر بن الحارث، كان يخرج إلى فارس للتجارة، فيشتري أخبار الأعاجم، ثم يُحدث قريشاً بها، ويقول: إن محمداً يُحدثكم بأخبار عاد وثمود، وأنا أحدثكم بحديث رُسْتُم، وأخبار الأكاسرة، فيستملحُون حديثه ولا يسمعون القرآن\n وقيل: كان يشتري القيان، ويحملهن على معاشرة من أراد الإسلام ليصده عنه\n  والإشتراء من الشراء، كما تقدم عن النضر، ومن البدل، كقوله:\n\n[آل عمران: 177]\n استبدلوه واختاروه، أي: يختار حديث الباطل على حديث الحق\n وإضافة اللهو إلى الحديث، للتبيين بمعنى \" من \" لأن اللهو يكون من الحديث ومن غيره، فيبين بالحديث، والمراد بالحديث: الحديث المكروه، كما جاء في الحديث:\n\n \" الحديث في المسجد يأكل الحسنات، كما تأكل البهيمة الحشيش \" \n\n، أو: للتبعيض، كأنه قيل: ومن الناس من يشتري بعض الحديث الذي فيه اللهو\n وقال مجاهد: يعني: شراء المغنيات والمغنيين، أي: يشتري ذات لهو، أو ذا لهو الحديث\n وقال أبو أمامة: قال عليه الصلاة والسلام:\n\n \" لا يحل تعليم المغنيات، ولا بيعهن، وأثْمانُهنَّ حرام \" \n\nوفي مثل هذا نزلت هذه الآية، ثم قال:\n\n \" وما من رجل يرفع صوته بالغناء إلا بعث الله عليه شيطانين: أحدهما على هذا المنكب، والآخر على هذا المنكب، فلا يزالان يضربان بأرجلهما حتى يسكت \"\n \n\nقلت: هذا مقيد بِشِعْرِ الهوى لأهل الهوى، وأما أهل الحق الذين يسمعون من الحق، فلا يتوجه الحديث لهم، وسيأتي في الإشارة تحقيقه إن شاء الله\n ثم قال أبو أمامة رضي الله عنه قال صلى الله عليه وسلم:\n\n \" إن الله تعالى بعثني هدى ورحمة للعالمين، وأمرني ربي بمحو المعازف والمزامير والأوثان، والصلب وأمر الجاهلية، وحلف ربي بعزته لا يشرب عبد من عبيدي جرعة خمر متعمداً إلا سقيته مثلها من الصديد يوم القيامة، مغفوراً له أو معذباً، ولا سقاها غيره إلا فعلت به مثل ذلك، لا يتركها عبد من مخافتي إلا سقيته من حياض القدس يوم القيامة \" \n\nانظر الثعلبي\n ثم قال تعالى: { ليضل عن سبيل الله } أي: فعل ذلك لِيَضل هو عن طريق الله ودينه، أو ليُضل غيره عنه، أو عن القرآن، { بغير علم } أي: جهلاً منه بما عليه من الوزر\n { ويتخذها } أي: السبيل { هُزُواً } وسخرية\n فمن رفع: استأنف، ومن نصب، عطفها على ليضل، { أولئك لهم عذاب مهين } يُهِينُهم ويخزيهم، و \" مَنْ \" ، لإبهامه، يقع على الواحد والجمع، والمراد: النضر ومن تبعه\n\n",
      "translations": []
    }
  ]
}