{
  "chapter": "لقمان",
  "text": "واذا تتلى عليه ءايتنا ولى مستكبرا كان لم يسمعها كان فى اذنيه وقرا فبشره بعذاب اليم",
  "translations": [
    {
      "translation": "When Our verses are recited before them they turn away haughtily as though they did not hear them, as if a deafness had come into their ears. So give them tidings of a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our verses are recited to such a person, he arrogantly turns away, as though he had not heard them, or as though there was a deafness in his ears. So announce to him the tidings of a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our revelations are recited to them, they turn back on their heels out of pride as if they did not hear them or their ears had been sealed off. Warn them of the painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to him he haughtily turns away as if he did not hear them – as if there is deafness in his ears; so give him the glad tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Ayat are recited to such a one, he turns away in pride, as if he heard them not -- as if there were deafness in his ear. So announce to him a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our communications are recited to him, he turns back proudly, as if he had not heard them, as though in his ears were a heaviness, therefore announce to him a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our signs are recited to such a man he turns away, waxing proud, as though he heard them not, and in his ears were heaviness; so give him good tidings of a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our revelations are recited unto him he turneth away in pride as if he heard them not, as if there were a deafness in his ears. So give him tidings of a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our messages are conveyed to such a person, he turns away in his arrogance, as though he had not heard them -- as though his ears were sealed: give him, then, the tidings of grievous suffering [in the life to come].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our revelations are recited unto him he turneth away in his stiff-neckedness as though he heard them not: as though there was a deafness in his ears. So announce thou unto him a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our signs are recited to him he turns away disdainfully, as if he had not heard them [at all], as if there were a deafness in his ears. So inform him of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Signs are rehearsed to such a one, he turns away in arrogance, as if he heard them not, as if there were deafness in both his ears: announce to him a grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Verses (of the Quran) are recited to such a one, he turns away in pride, as if he heard them not, as if there were deafness in his ear. So announce to him a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our verses are recited to him, he turns his back in pride, as though he never heard them, and in his ears was heaviness. Give glad tidings to him of a painful punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Verses are recited to him, he turns away in pride, as though he did not hear them, as though there is deafness in his ears. So inform him of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when our verses are recited to him, he turns away arrogantly as if he had not heard them, as if there was in his ears deafness. So give him tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[31:7] And when Our signs, in other words, [in] the Qur’ān, are recited to such [a one] he turns away disdainfully as though he never heard them, as though there were a deafness in his ears (both comparisons constitute two circumstantial qualifiers referring to the subject of [the verb] wallā, ‘turns away’; or it is that the second [comparison] is an explication of the first). So give him tidings of, inform him of, a painful chastisement. The   use of [the expression] ‘good tidings’ meant derisively against such [a person] — this was al-Nadr b. alHārith. He used to visit al-Hīra for commerce and purchase books containing the stories of the non-Arab peoples and then recount these to the people of Mecca. He would say, ‘Muhammad recounts to you the stories of ‘Ād and Thamūd, whereas I relate to you the stories of the Persians and the Byzantines!’ They would thus [go to] enjoy his stories and neglect to listen to the Qur’ān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "464 (And when Our revelations) which explain the commands and prohibitions (are recited unto him he turneth away in his pride) too proud to accept faith (as if he heard them not, as if there were a deafness in his ears. So give him) Muhammad (tidings of a painful doom) and he was killed in captivity on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة شكيمته، وبغضه بالله ورسوله وكتابه، ونهاية عتوه وعناده { إِذَا تُتْلَىٰ عَلَيْهِ } وقرئ عنده { ءَايَاتُنَا } الدالة على توحيد ذاتنا، وكمال أسمائنا وصفاتنا { وَلَّىٰ } عنها، وأعرض عن استماعها، وانصرف عن قبولها { مُسْتَكْبِراً } عليها، متجافياً كشحه عنها، { كَأَن لَّمْ يَسْمَعْهَا } مع أنها تُتلى عليهم قصد الاستماع، ولم يلتفت إليها { كَأَنَّ فِيۤ أُذُنَيْهِ وَقْراً } صمماً يعوقه عن السماع والاستماع { فَبَشِّرْهُ } يا أكمل الرسل بعدما أعرض عن كتاب الله، واستنكف عن استماعه وإصغائه مستخفاً عليه، مستحقراً إياه { بِعَذَابٍ أَلِيمٍ } [لقمان: 7] مؤلم في غاية الشدة والألم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وإذا تُتلى عليه آياتنا وَلَّى مُستكبراً } أعرض عن تدبرها متكبراً رافعاً نفسه عن الإصغاء إلى القرآن، { كأن لم يَسْمَعْهَا } كأنه لم يسمعها، ولا ذُكرت على سمعه\n شبَّه حاله بحال من لم يسمعها قط، { كأنَّ في أذنيه وقراً } ثَِقَلاً وصمماً، { فبشره بعذابٍ أليم } أَخْبِرْه بأن العذاب يُوجعه لا محالة\n وذكر البشارة على سبيل التهكم\n وهذا في مقابلة مدح المحسنين المقيمين المزكين\n فكما قال في المحسنين: { أولئك على هدى من ربهم وأولئك هم المفلحون } ، قال في هؤلاء: { أولئك لهم عذاب مهين } ، بعد أن وصفهم بالضلال والإضلال، في مقابلة المحسنين بالهداية والفلاح\n والله تعالى أعلم\n الإشارة: لهو الحديث هو كل ما يشغل عن الله، ويصد عن حضرة الله، كائناً ما كان، سواء كان غناء أو غيره، وإذا كان الغناء يهيج لذكر الله، ويحرك الروح إلى حضرة الله، كان حقاً، وإذا كان يحرك إلى الهوى النفساني كان باطلاً\n والحاصل: أن السماع عند الصوفية ركن من أركان الطريقة، بشروط الثلاثة: الزمان والمكان والإخوان\n وقد ألف الغزالي تأليفاً في تكفير من أطلق تحريم السماع\n وقال في الإحياء، في جملة من احتج به المُحَرِّمُ للسماع: احتج بقوله تعالى: { ومن الناس من يشتري لَهْوَ الحديث } ، وقد قال ابن مسعود والنخَعي والحسن: إنه الغناء\n وأجاب ما حاصله: أنه إنما يحرم إذا كان استبدالاً بالدين، وليس كل غناء بدلاً عن الدين، مُشْتَرَىً به، ومضلاً عن سبيل الله، ولو قرأ القرآن ليضل عن سبيل الله كان حراماً\n كما حكي عن بعض المنافقين أنه كان يؤم الناس ولا يقرأ إلا بسورة عبس، لما فيها من العتاب مع رسول الله صلى الله عليه وسلم، فهَمَّ عمرُ بقتله\n فالإضلال بالشعر والغناء أولى بالتحريم\n هـ\n وأما إن لم يكن شيء من ذلك، فلا يحرم\n  وقال في القوت، في كتاب المحبة: ولم يزل الحجازيون، عندنا بمكة، يسمعون السماع في أفضل أيام السنة، وهي الأيام المعدودات، التي أمر الله عز وجل عبادَه فيها بذكره، أيام التشريق، من وقت عطاء بن أبي رباح، إلى وقتنا هذا، ما أنكره عالم، وكان لعطاء جاريتان تُلَحِّنانِ، فكان إخوانه يستمعون إليهما، ولم يزل أهل المدينة مواطئين لأهل مكة على السماع إلى زماننا هذا\n وأدركنا أبا مروان القاضي، له جوار يسمعن التلحين، قد أعدهن للطوافين\n فكان يجمعهن لهم، ويأمرهن بالإنشاد، وكان فاضلاً\n وسئل شيخنا أبو الحسن بن سالم، فقيل له: إنك تنكر السماع، وقد كان الجنيد وسري السقطي وذو النون يسمعون؟ فقال: كيف أنكر السماع وقد أجازه وسمعه من هو خير مني\n هـ\n وقال ابن ليون التجيبي في الإنالة: رُوي عن مصعب بن الزبير، قال حضرت مجلس مالك، فسأله أبو مصعب عن السماع، فقال: ما أدري، إلا أن أهل العلم ببلدنا لا ينكرون ذلك، ولا يقعدون عنه، ولا ينكره إلا غبي جاهل، أو ناسك عراقي غليظ الطبع\n\n\nقال التجيبي: وعن أنس كنا عند النبي صلى الله عليه وسلم، إذ نزل عليه جبريل، فقال: يا رسول الله فقراء أمتك يدخلون الجنة قبل الأغنياء بخمسمائة عام، وهو نصف يوم، ففرح فقال: أفيكم من ينشدنا؟ فقال بدوي: نعم، يارسول الله، فقال: هات، هات، فأنشد البدوي يقول:\n\nفتواجد عليه السلام، وتواجد أصحابه معه، حتى سقط رداؤه عن مَنْكِبَيْهِ، فلما خرجوا أوى كل واحد إلى مكانه، فقال معاوية: ما أحسن لَعِبَكُمْ يا رسول الله! فقال:\n\n \" مَهْ، مَهْ، يا معاوية، ليس بكريم من لم يهتز عند ذكر الحبيب \" \n\nثم اقتسم رداءه من حضرهم بأربعمائة قطعة\n وذكر المقدسي هكذا، والسهروردي في عوارفه، وتكلم الناس في هذا الحديث\n وقد تخلف الحسن البصري ذات يوم عن أصحابه، وسئل عن تخلفه، فقال: كان في جيراننا سماع\n وقال الشبلي: السماع ظاهره فتنة وباطنه عبرة\n فمن عرف الإشارة حلَّ له سماع العبرة وإلا فقد استدعى الفتنة\n هـ\n والله تعالى أعلم\n قوله تعالى: { وإذا تُتلى عليه\n\n\n } إلخ، هذا مثال لمن يَقبل الوعظ لقسوة قلبه وحُكم المشيئة يُبعده، فلا يزيده كثرة الوعظ إلا نفوراً، فسماعه كلا سماع، ومعالجته عنىً وضياع، كما قال القائل:\n\nثم بيّن فلاح المحسنين، فقال: { إِنَّ ٱلَّذِينَ آمَنُواْ\n\n\n }\n\n",
      "translations": []
    }
  ]
}