{
  "chapter": "السجدة",
  "text": "تتجافى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقنهم ينفقون",
  "translations": [
    {
      "translation": "Their sides eschew their beds as they call on their Lord in fear and ardent hope. And they give of what We have provided for them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their backs do not rest on their beds, and they pray to their Lord in fear and hope, and spend of what We have given them (in charity).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides forsake their beds, and they call upon their Lord in fear and hope, and expend (in charity) out of the sustenance We have granted them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides give-up rest in beds in order to pray before their Lord in fear and hope. They spend for the cause of God out of what we have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides stay detached from their beds and they pray to their Lord with fear and hope – and they spend from what We have bestowed upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides forsake their beds, to invoke their Lord in fear and hope, and they spend out of what We have bestowed on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides draw away from (their) beds, they call upon their Lord in fear and in hope, and they spend (benevolently) out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides shun their couches as they call on their Lord in fear and hope; and they expend of that We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who forsake their beds to cry unto their Lord in fear and hope, and spend of that We have bestowed on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They forsake their beds, calling upon their Lord in fear and in hope, and spend out of what We have provided them with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides leave off the couches calling upon their Lord in fear and in desire, and of that wherewith We have provided them they expend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides vacate their beds to supplicate their Lord in fear and hope, and they spend out of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their limbs do forsake their beds of sleep, the while they call on their Lord, in Fear and Hope: and they spend (in charity) out of the sustenance which We have bestowed on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides forsake their beds, to invoke their Lord in fear and hope, and they spend (charity in Allah's Cause) out of what We have bestowed on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whose sides forsake their couches as they supplicate to their Lord in fear and hope; who give in charity of that which We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their sides shun their beds, as they pray to their Lord, out of reverence and hope; and from Our provisions to them, they give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They arise from [their] beds; they supplicate their Lord in fear and aspiration, and from what We have provided them, they spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:16] Their sides withdraw, they rise, from their lying places, the places for lying down [to sleep] together with the bedding, in order to spend the night in prayer (tahajjud), to supplicate to their Lord in fear, of His punishment, and in hope, of His mercy, and they expend of what We have provided them, they give voluntary alms.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who forsake their beds) after sleeping a little at night (to cry unto their Lord) to worship their Lord by means of the five daily prayers; it is also said that they forsake their beds in order to pray the last night prayer ('Isha'); it is also said that this means: they leave their beds after sleeping a little at night to perform supererogatory prayers (in fear) of Him and His chastisement (and hope) in Him and His mercy, (and spend) in charity (of what we have bestowed on them) of wealth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَتَجَافَىٰ جُنُوبُهُمْ عَنِ ٱلْمَضَاجِعِ } معناه تَتَنحّى وتَرتفعُ\n\n",
      "translations": [
        {
          "translation": " And His saying - the Most High - { Their sides forsake the beds } its meaning is that they become elevated and rise up.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال إطاعتم وانقيادهم: { تَتَجَافَىٰ } أي: تتنحى وترتفع { جُنُوبُهُمْ } وضلوعهم { عَنِ ٱلْمَضَاجِعِ } أي: البسط والوسائد الي رقدوا عليها في الليل\n يعني: بعدوا عن مواضع رقودهم واستراحتهم في خلال الليالي { يَدْعُونَ رَبَّهُمْ خَوْفاً } من بشطه وخشيته { وَطَمَعاً } لمرضاته وعموم رحمته\n وسعة جده مغفرته { وَ } هم لا يقتصرون على قيام الليل للتهجد\n بل { مِمَّا رَزَقْنَاهُمْ } وسقنا نحوه من الرزق الصوري والمعنوي { يُنفِقُونَ } [السجدة: 16] في سبيلنا على الطالبين المتوجهين إلينا\n منقطعين عن لذائد الدنيا ومزخرفاتها\n سوى سدّ جوعة وستر عورة\n وهم بارتكاب هذه المتاعب والمشاق ما يريدون إلا وجه الله\n وما يطلبون إلا رضاه سبحانه\n مؤثرين رضاء الله على أنفسهم مخلصين فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { تتجافى } أي ترتفع وتتنحى { جُنُوبهم عن المضاجع } عن الفُرش ومواضع النوم للصلاة والذكر\n قال سهل: وَهَب لقوم هِبَةً، وهو أن أَذِن لهم في مناجاته، وجعلهم من أهل وسيلته ثم مدحهم عليه فقال:  { تتجافى جنوبهم عن المضاجع } ، { يَدْعُونَ } أي: داعين { ربَّهم خوفاً } ، أي: لأجل خوفهم من سخطه { وطمعاً } في رحمته، وهم المجتهدون أو المتفكرون في الليل\n وسيأتي في الإشارة\n وعن النبي صلى الله عليه وسلم في تفسيرها: \" هو قيامُ العبد من الليل \"\n وعن ابن عطاء: أبت جنوبهم أن تسكن على بساط الغفلة، وطلبت بساط القربة، وعن أنس: كان أناس من أصحاب رسول الله صلى الله عليه وسلم يصلون من صلاة المغرب إلى صلاة العشاء الأخيرة، فنزلت فيهم\n وقال ابن عمر رضي الله عنه: قال صلى الله عليه وسلم:\n\n \" من عَقَب - أي: أحيا - ما بين المغرب والعشاء بُني له في الجنة قصران مسيرة عام، وفيهما من الشجر ما لو نزلهما أهل المشرق والمغرب لأوسعهم فاكهة\n وهي صلاة الأوابين وغفلة الغافلين\n وإن من الدعاء المستجاب الذي لا يُرد: الدعاء بين المغرب والعشاء \" \n\nهـ\n وقيل: هم الذين يَصلُّونَ العَتَمَةَ، ولا ينامون عنها\n { ومما رزقناهم ينفقون } في طاعة الله، يعني: أنهم جمعوا بين قيام الليل وسخاوة النفس\n { فلا تعلم نفس ما أُخْفِيَ لهم من قُرة أعين } أي: لا يعلم أحد ما أعد الله لهم من الكرامة، مما تقرّ به العينُ من نعيم الأشباح ونعيم الأرواح\n وقرأ حمزة ويعقوب: \" أَخْفَى \" على المضارع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:34",
      "similarity": 0.2905728275551667
    },
    {
      "verse": "3:154",
      "similarity": 0.18386973979962412
    },
    {
      "verse": "7:56",
      "similarity": 0.11996852748660292
    },
    {
      "verse": "5:84",
      "similarity": 0.10666544439548435
    },
    {
      "verse": "74:15",
      "similarity": 0.10456644639757749
    }
  ]
}