{
  "chapter": "السجدة",
  "text": "ولو شئنا لءاتينا كل نفس هدىها ولكن حق القول منى لاملان جهنم من الجنة والناس اجمعين",
  "translations": [
    {
      "translation": "'Had We so willed We could have given guidance to everyone, but now My Words are shown to be true: that I shall fill up Hell entirely with jinn and human beings.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We intended We could have given every soul its guidance; but inevitable is My word that I will fill up Hell with men and jinns together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be told): “If We had so willed, We could have bestowed guidance on every person. But the Word from Me that I will fill Hell with men and jinn, all together, has been fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wanted, We could have given guidance to every soul, but My decree, that hell will be filled-up with jinn and people, has already been executed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed We would have given every soul its guidance, but My Word is decreed that I will certainly fill hell with these jinns and men, combined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had willed, surely We would have given every person his guidance, but the Word from Me took effect, that I will fill Hell with Jinn and mankind together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had pleased We would certainly have given to every soul its guidance, but the word (which had gone forth) from Me was just: I will certainly fill hell with the jinn and men together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had so willed, We could have given every soul its guidance; but now My Word is realized -- \" Assuredly I shall fill Gehenna with jinn and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had so willed, We could have given every soul its guidance, but the word from Me concerning evildoers took effect: that I will fill hell with the jinn and mankind together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet had We so willed, We could indeed have imposed Our guidance upon every human being: but My word shall come true: \"I will fill Hell with jinns and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We listed surely We could have given every soul its guidance; but true must be the word from Me; I shall surely fill Hell with the Jinn and mankind together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wished We would have given every soul its guidance, but My word became due [against the faithless]: ‘Surely I will fill hell with all the [guilty] jinn and humans.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had so willed, We could certainly have brought every soul its true guidance: but the Word from Me will come true, \"I will fill Hell with Jinns and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had willed, surely! We would have given every person his guidance, but the Word from Me took effect (about evil-doers), that I will fill Hell with jinn and mankind together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We Willed, We would have guided every soul. But My Word shall be realized, 'I will fill Gehenna (Hell) with jinn and people all together'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We willed, We could have given every soul its guidance, but the declaration from Me will come true: “I will fill Hell with jinn and humans, altogether.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had willed, We could have given every soul its guidance, but the word from Me will come into effect [that] \"I will surely fill Hell with jinn and people all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:13] God, exalted be He, says: ‘And had We [so] willed, We could have given every soul its [means to] guidance, so that it may be guided through faith and obedience, through its own choice, but My Word became due, and it is that: “Verily I shall fill Hell with jinn and mankind together”.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We had so willed, We could have given every soul its guidance) its God-fearingness, (but the word from Me concerning evil-doers took effect) My word decreed (that I will fill hell with the jinn and mankind together) with the disbelievers among the jinn and mankind. Had it not been for this, I would have honoured every single soul with knowledge and the confession of Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لآتينا كل نفس هداها } بالتوفيق للسلوك مع المساواة في الاستعداد\n ولكنه ينافي الحكمة لبقائهم حينئذ على طبيعة واحدة وبقاء سائر الطبقات الممكنة في حين الإمكان مع عدم الظهور أبداً\n وخلوّ أكثر مراتب هذا العالم عن أربابها فلا تمشي الأمور الخسيسة والدنيئة المحتاج إليها في العالم التي تقوم بها أهل الحجاب والذلّة والقسوة والظلمة\n البعداء عن المحبة والرحمة والنور والعزّة\n فلا ينضبط نظام العالم ولا يتمّ صلاح المهتدين أيضاً لوجوب الاحتياج إلى سائر الطبقات\n فإنّ النظام ينصلح بالمخافي وبالمظاهر فلو كانوا مظاهر كلهم أنبياء وسعداء لاختلّ بعدم النفوس الغلاظ وشياطين الإنس القائمين بعمارة العالم\n ألا ترى إلى قوله تعالى: \" إني جعلت معصية آدم سبباً لعمارة العالم \" \n فوجب في الحكمة الحقّة التفاوت في الاستعداد بالقوة والضعف والصفاء والكدورة والحكم بوجود السعداء والأشقياء في القضاء ليتجلى بجميع الصفات في جميع المراتب\n وهذا معنى قوله: { ولكن حقّ القول مني } أي: في القضاء السابق { لأملأنّ جهنم } الطبيعة { من الجنّة } أي: النفوس الأرضية الخفيّة عن البصر { والناس أجمعين }  { فذوقوا بما نسيتم لقاء يومكم هذا } لاحتجابكم بالغشاوات الطبيعية والملابسة البدنية { إنّا نسيناكم } بالخذلان عن الرحمة لعدم قبولكم إياها وإدباركم { وذوقوا عذاب الخُلْد } بسبب أعمالكم\n فعلى هذا التأويل المذكور تكون الخلد مجازاً وعبارة عن الزمان الطويل\n أو يكون الخطاب بذوقوا لمن حقّ عليهم القول في القضاء السابق من الجنّة والناس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويسرنا لهم الهداية والرشاد { وَلَـٰكِنْ حَقَّ } أي: صحَّ وثبت { ٱلْقَوْلُ } والحكم { مِنِّي } على مقتضى حكمتي ومصلحتي { لأَمْلأَنَّ } بمقتضى عزتي وجلالي { جَهَنَّمَ } المعدة لأصحاب الشقاوة والأزلية { مِنَ ٱلْجِنَّةِ } التي هي جنود إبليس { وَٱلنَّاسِ } الناسين مقتضى العهود الفطرية\n والمواثيق الجبلية بتغريرات شياطين نفوسهم الأمَّارة بالسوء { أَجْمَعِينَ } [السجدة: 13] وما يبدل القول لدي\n ولا معقب لحكمي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:85",
      "similarity": 0.6899384764311648
    },
    {
      "verse": "11:119",
      "similarity": 0.5298528339017157
    },
    {
      "verse": "50:30",
      "similarity": 0.4864974017219509
    },
    {
      "verse": "7:60",
      "similarity": 0.3985518048078048
    },
    {
      "verse": "15:43",
      "similarity": 0.3531299395926882
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/32:13.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/32:13.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/32:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}