{
  "chapter": "السجدة",
  "text": "اما الذين ءامنوا۟ وعملوا۟ الصلحت فلهم جنت الماوى نزلۢا بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions, they will have the Gardens of Safe Refuge as hospitality for what they used to do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do the right, there are gardens for abode as welcome for what they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and act righteously, theirs shall be Gardens to dwell in, a hospitality to reward them for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers will have Paradise for their dwelling as the reward of their good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted faith and did good deeds – for them are the Gardens of (everlasting) stay; a welcome in return for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do righteous good deeds, for them are Gardens of Abode as an entertainment for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good, the gardens are their abiding-place; an entertainment for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe, and do deeds of righteousness, there await them the Gardens of the Refuge, in hospitality for that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who believe and do good works, for them are the Gardens of Retreat - a welcome (in reward) for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do good deeds shall be lodged in the Gardens of Paradise as a reward for what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe and work rigteous works--for them are Gardens of Abode: an entertainment for that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have faith and do righteous deeds, for them will be the gardens of the Abode—a hospitality for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe and do righteous deeds are Gardens as hospitable homes, for their (good) deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, for them are Gardens (Paradise) as an entertainment, for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works, there are for them the Gardens of Refuge, in hospitality for that which they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do righteous deeds, for them are the Gardens of Shelter—hospitality for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believed and did righteous deeds, for them will be the Gardens of Refuge as accommodation for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:19] As for those who believe and perform righteous deeds, for them shall be the Gardens of the Abode — a hospitality (nuzul is what is prepared for a guest) for what they used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained the destination of both of them after they die, saying: (But as for those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between them and their Lord, (for them are the Gardens of Retreat) as a reward for them in the Hereafter, (a welcome (in reward) for what they used to 470 do) of good works in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { أَمَّا ٱلَّذِينَ آمَنُواْ } بوحدانية الحق { وَعَمِلُواْ ٱلصَّالِحَاتِ } المأمورة لهم على وجهها\n مع كونهم مخلصين فيها\n خاشعين خاضعين { فَلَهُمْ } في النشأة الأخرى بعدما انقرضوا عن دار الدنيا { جَنَّاتُ ٱلْمَأْوَىٰ } أي: المتنزهات المعدة لأهل الإيمان والقبول تأوي إليها نفوسهم على الرغبة الكاملة والطوع التام\n ليكون { نُزُلاً } لهم\n أي: منزلاً يسكنون فيه\n ويستريحون فيها { بِمَا كَانُواْ يَعْمَلُونَ } [السجدة: 19] أي: بمقابلة ما يرتكبون من حمل المتاعب والمشاق ف يطريق الطاعات والعبادات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نُزُلاً بما كانوا يعملون } أي: عطاء معجلاً بأعمالهم\n والنُزُل: ما يقدم للنازل\n ثم صار عاماً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:41",
      "similarity": 0.6400616953791924
    },
    {
      "verse": "53:15",
      "similarity": 0.6063222824128967
    },
    {
      "verse": "32:20",
      "similarity": 0.49118740546283196
    },
    {
      "verse": "10:8",
      "similarity": 0.4820035415391809
    },
    {
      "verse": "70:13",
      "similarity": 0.4665890930376539
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}