{
  "chapter": "السجدة",
  "text": "وقالوا۟ اءذا ضللنا فى الارض اءنا لفى خلق جديدۭ بل هم بلقاء ربهم كفرون",
  "translations": [
    {
      "translation": "They say, 'When we have been absorbed into the earth, are we then to be in a new creation?' In fact they reject the meeting with their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they say: \"When we have mingled with the earth, shall we be created anew?\" In fact they deny the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “Shall we be created afresh after we have become lost in the earth?” Nay, the fact is that they deny that they will meet their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"How can we be brought to life again after we have been lost in the earth?\" In fact, they have no faith in the Day of Judgment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “When we have mingled into the earth, will we be created again?”; in fact they disbelieve in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"When we are lost in the earth, shall we indeed be created anew\" Nay, but they deny the meeting with their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: What! when we have become lost in the earth, shall we then certainly be in a new creation? Nay! they are disbelievers in the meeting of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'What, when we have gone astray in the earth, shall we indeed be in a new creation?' Nay, but they disbelieve in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: When we are lost in the earth, how can we then be re-created? Nay but they are disbelievers in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"When we are lost in the earth, how can we then be recreated?\" Indeed, they deny they will ever meet their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: when we are vanished in the earth, shall we then be raised in a new creation? Aye! in the meeting with their Lord they are disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘When we have been lost in the dust, shall we be indeed created anew?’ Indeed, they disbelieve in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"What! when we lie, hidden and lost, in the earth, shall we indeed be in a Creation renewed? Nay, they deny the Meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"When we are (dead and become) lost in the earth, shall we indeed be recreated anew?\" Nay, but they deny the Meeting with their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'What, when we have been destroyed in the earth, shall we indeed be in a new creation' Indeed, they disbelieve that they will meet their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “When we are lost into the earth, shall we be in a new creation?” In fact, they deny the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"When we are lost within the earth, will we indeed be [recreated] in a new creation?\" Rather, they are, in [the matter of] the meeting with their Lord, disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:10] And they, namely, the deniers of resurrection, say, ‘When we are lost beneath the earth, [when] we have gone thereunder, having become dust mixed with its dust, shall we be indeed created anew?’ (an interrogative of denial; [read a-innā] by pronouncing both hamzas, or by not pronouncing the second one and inserting an alif between them either way, in both places). God, exalted be He, says: Nay, but they disbelieve in the encounter with their Lord, through resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. Abu Jahl and his host: (When we are lost) perished (in the earth) after we die, (how can we then be recreated) it is impossible that we be recreated after we die? (Nay but they are disbelievers in) they deny (the meeting with their Lord) resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية كفرانهم بنعم الله، ونهاية عمههم وسكرتهم فيه: { قَالُوۤاْ } أي: أُبي بن خلف ومن معه المنافقين بعدما سمعوا من البعث والحشر، ويوم العرش والجزاء مستبعدين مستفهمين، مكررين على سبيل المبالغة في الإنكار { أَءِذَا ضَلَلْنَا } وضمحللنا { فِي ٱلأَرْضِ } وصرنا من جملة الهباء المنبثة، المتلاشية المتناسلة التي لا تمايز فيها أصلاً { أَءِنَّا } بعدما كنا كذلك أيها العقلاء المجبولون على الدارية والشعور { لَفِي خَلْقٍ جَدِيدٍ } مثلما كنا عليها قبل مؤتنا؟! كلا وحاشاـ وما لنا عود إلى الحياة الدنيا، سيما بعدما متنا وصرنا تراباً وعظاماً، وهم أيضاً ما يتقصرون من شيء بمجرد قولهم هذا { بَلْ هُم } من غلظ غشاوتهم وغطائهم { بِلَقَآءِ رَبِّهِمْ } الذي رباهم بأنواع النعم في النشأة الأولى، وأفاض عليهم سجال اللطف والكرم في النشأة الأخرى، وقبض ملك الموت أرواحهم بأمر الله أياه { كَافِرُونَ } [السجدة: 10] منكرون جاحدون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا } منكرين للبعث: { أئذا ضللنا في الأرض } ، أي: صِرْنَا تراباً، وذهبنا مختلطين بتراب الأرض، لا نتميز منه، كما يضل الماء في اللبن\n أو: غبنا في الأرض بالدفن فيها، يقال: ضَلَلَ كضرب، وضِلل كفرح\n وانتصب الظرف في أإذا بقوله: { أئنا لفي خلق جديد }\n أي: أُنبعث، ونُجدد، إذا ضللنا في الأرض؟ والقائل لهذه المقالة أُبيّ بن خلف، وأسند إليهم لرضاهم بذلك، { بل هم بلقاء ربهم كافرون } جاحدون\n لَمّا ذكر كفرهم بالبعث أضرب عنه إلى ما هو أبلغ، وهو أنهم كافرون بجميع ما يكون في العاقبة، لا بالبعث وحده\n وقال المحشي: أي: ليس لهم جحود قدرته تعالى على الإعادة لأنهم يعترفون بقدرته، ولكنهم اعتقدوا ألاَّ حساب عليهم، وأنهم لا يَلْقَوْنَ الله تعالى، ولا يصيرون إلى جزائه\n هـ\n والله تعالى أعلم\n الإشارة: كل ما أظهر الحق تعالى: من تجلياته الكونية فهي في غاية الإبداع والاتفاق في أصل نشأتها، كما قال صاحب العينية:\n\nوأكملُها وأعظمُها: خلقةُ الإنسان، الذي خُلِقَ على صورة الرحمن، حيث جعل فيه أوصافه من قدرة، وإرادة، وعلم، وحياة، وسمع، وبصر، وكلام، وهيأه لحضرة القدس ومحل الأنس، وسخّر له جميع الكائنات، وهيأه لحمل الأمانة، إلى غير ذلك مما خص به عبده المؤمن\n وأما الكافر فهو في أسفل سافلين\n قال الورتجبي: ذكر حسن الأشياء، ولم يذكر هنا حسن الإنسان غيرةً، لأنه موضع محبته، واختياره الأزلي، كقول القائل:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:16",
      "similarity": 0.7912762209564281
    },
    {
      "verse": "14:19",
      "similarity": 0.769848632832509
    },
    {
      "verse": "72:3",
      "similarity": 0.7088673477749917
    },
    {
      "verse": "13:5",
      "similarity": 0.4116893770971797
    },
    {
      "verse": "17:98",
      "similarity": 0.28733512349861307
    }
  ]
}