{
  "chapter": "السجدة",
  "text": "قل يتوفىكم ملك الموت الذى وكل بكم ثم الى ربكم ترجعون",
  "translations": [
    {
      "translation": "Say: \"The angel of death appointed over you will take away your soul, then you will be sent back to your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: “The angel of death who has been charged with your souls shall gather you, and then you shall be brought back to your Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"The angel of death, who is appointed over everyone of you, will cause you to die and to your Lord you will all return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “The angel of death, who is appointed over you, causes you to die and then towards your Lord you will return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The angel of death, who is set over you, will take your souls. Then you shall be brought to your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: The angel of death who is given charge of you shall cause you to die, then to your Lord you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Death's angel, who has been charged with you, shall gather you, then to your Lord you shall be returned.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: The angel of death, who hath charge concerning you, will gather you, and afterward unto your Lord ye will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"The Angel of Death who has been given charge of you will gather in your souls. Then you will [all] be returned to your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: the angel of death who is set over you shall cause you to die, thereafter unto your Lord ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘You will be taken away by the angel of death, who has been charged with you. Then you will be brought back to your Lord.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The Angel of Death, put in charge of you, will (duly) take your souls: then shall ye be brought back to your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The angel of death, who is set over you, will take your souls, then you shall be brought to your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'The Angel of Death, who has been given charge of you will gather you then to your Lord you shall be returned'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “The angel of death put in charge of you will reclaim you. Then to your Lord you will be returned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"The angel of death will take you who has been entrusted with you. Then to your Lord you will be returned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:11]   Say, to them: ‘The Angel of death, who has been charged with you, shall receive you [in death], in other words, he shall seize your spirits, then to your Lord you shall be returned’, alive, whereat He will requite you for your deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (The angel of death, who hath charge concerning you, will gather you) will take away your souls, (and afterward unto your Lord ye will be returned) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل نيابةً عنا بعدما سمعت قولهم: { يَتَوَفَّاكُم } ويستوفي أجلَكم أيها المنهمكون في الغفلة والضلال { مَّلَكُ ٱلْمَوْتِ ٱلَّذِي وُكِّلَ بِكُمْ } بإذن الله؛ لقبض أرواحكم { ثُمَّ } بعدما قبضتم في النشأة الأولى، وبعثتم من قبوركم أحياءً في النشأة الأخرى { إِلَىٰ رَبِّكُمْ تُرْجَعُونَ } [السجدة: 11] للعرض الجزاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { قل يتوفاكم مَلَكُ الموتِ الذي وُكِّل بكم } بقبض أرواحكم فتموتون،، { ثم إلى ربكم تُرجعون } بالبعث للحساب والعقاب\n وهذا معنى لقاء الله الذي أنكروه\n والتوفي: استيفاء الروح، أي: أخذها، من قولك: توفيت حقي من فلان، إذا أَخَذْتُه وافياً من غير نقصان\n وعن مجاهد: زُويت الأرض لملك الموت، وجُعلت مثل الطست، يتناول منها حيث يشاء\n وعن مقاتل والكلبي: بلغنا أن اسم ملك الموت \" عزرائيل \" وله أربعة أجنحة: جناح بالمشرق وجناح بالمغرب، والخلق بين رجليه ورأسه وجسده كما بين السماء والأرض، وله الدنيا مثل راحة اليد، فهو يقبض أنفس الخلائق بمشارق الأرض ومغاربها، وله أعوان من ملائكة الرحمة وملائكة العذاب\n وعن معاذ بن جبل: أن لملك الموت حربة، تبلغ ما بين المشرق والمغرب، وهو يتصفح وجوه الموتى، فما من أهل بيت إلا وهو يتصفحهم كل يوم مرتين - وفي حديث آخر، خمس مرات، فإذا رأى إنساناً قد انقضى أجله ضربه بتلك الحربة\n وقال: الآن يُزار بك عسكر الأموات\n فإن قيل: ما الجمع بين قوله:\n\n[الأنعام: 61] و\n\n[النساء: 97] و { قُل يَتَوَفَاكُم مَّلَكُ المَوتِ } وقوله:\n\n[الزمر: 42]؟ فالجواب: أن توفي الملائكة، القبضُ والنزعُ، وتوفي ملك الموت الدعاء والأمر، يدعو الأرواح فتجيبه، ثم يأمر أعوانه بقبضها، ثم يذهبون بها إلى عليين، وقبض الحق تعالى: خَلْقُ الموتِ فيه: والحاصل: أنَّ قبض الملك: المباشرة، وقبض الحق: الإخراجُ حقيقةً\n قال الورتجبي: قال الحسن: ملك الموت هو الموكل بأرواح بني آدم، وملك الفناء موكل بأرواح البهائم\n فانظر فيه\n وأما حديث ملكي الموت والحياة، فقال العراقي: لم أجد له أصلاً\n ويعني بملك الحياة: كون الأرواح أنفاسَ ملك الحياة كما في الإِحْيَاء\n ومذهب أهل السُنَّة قاطبة: أن ملك الموت هو الّذي يقبض جميع الأرواح، من بني آدم والبهائِم وسائر الحيوانات\n وبه قال مالك وأشهب\n وذهب قوم إلى أن أرواح البهائم وسائر الحيوانات إنما تَقبض أرواحَهَا أعوانُ ملك الموت\n وذهب قوم إلى أن الموت في حق غير بني آدم، إنما هو عَدَمٌ مَحْضٌ، كيبس الشجر وجفاف الثياب، فلا قبض لأرواحها وهو أعم من كونها تُبعث أو: لا بأن تعاد عن عدم بخلاف المكلف فإن روحه لا تعدم، خلافاً للملاحدة، فإنهم جعلوا الموت كله عدماً محضاً، كجفاف العود الأخضر، وهو كفر\n هذا وقد اختلف في كون الموت ضد الحياة، فيكون معنىً وجودياً، أو هو عدم الحياة، فيكون عدماً، وعلى كلا القولين فالأرواح باقية بعد مفارقة الأبدان، منعّمة أو معذبة",
      "translations": []
    }
  ]
}