{
  "chapter": "السجدة",
  "text": "انما يؤمن بـايتنا الذين اذا ذكروا۟ بها خروا۟ سجدا وسبحوا۟ بحمد ربهم وهم لا يستكبرون",
  "translations": [
    {
      "translation": "The people who truly do have iman in Our Signs are those who fall to the ground prostrating when they are reminded of them, and glorify their Lord with praise, and are not arrogant.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they believe in Our revelations who, when they are reminded, bow in adoration, and give praise to their Lord, and do not become arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None believes in Our Signs except those who, when they are given good counsel through Our verses, fall down prostrate and celebrate the praise of their Lord and do not wax proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only people who believe in Our revelations are those who, when reminded about them, bow down in prostration and glorify their Lord with His praise without pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our signs who, when they are reminded of them, fall down in prostration and proclaim the Purity of their Lord while praising Him, and are not conceited. (Command of prostration # 9).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our Ayat, who, when they are reminded of them, fall down prostrate, and glorify the praises of their Lord, and they are not proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they believe in Our communications who, when they are reminded of them, fall down in prostration and celebrate the praise of their Lord, and they are not proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our signs who, when they are reminded of them, fall down prostrate and proclaim the praise of their Lord, not waxing proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our revelations who, when they are reminded of them, fall down prostrate and hymn the praise of their Lord, and they are not scornful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people who truly believe in Our messages are those who fall to the ground in prostration when they are reminded of them, and glorify their Lord with praise and are not arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They alone believe in Our revelations who, when they are reminded thereof, fall down prostrate and hallow the praise of their Lord, and they are not stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our signs who, when they are reminded of them, fall down in prostration and celebrate the praise of their Lord, and they are not arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our Signs, who, when they are recited to them, fall down in prostration, and celebrate the praises of their Lord, nor are they (ever) puffed up with pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), who, when they are reminded of them fall down prostrate, and glorify the Praises of their Lord, and they are not proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who believe in Our verses, when reminded of them, prostrate themselves and exalt with the praise of their Lord in humility;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Our communications, those who, when reminded of them, fall down prostrate, and glorify their Lord with praise, and are not proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those believe in Our verses who, when they are reminded by them, fall down in prostration and exalt [Allah] with praise of their Lord, and they are not arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:15] Only those believe in Our signs, [such as] the Qur’ān, who, when they are reminded of them, admonished [with them], fall down in prostration and make glorifications, ensconced, in praise of their Lord, in other words, they say, ‘Glory be to God through His praise’ (subhāna’Llāh wa-bi-hāmdihi), and they do not disdain, to believe and to obey.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Only those believe in Our revelations) in Muhammad (pbuh) and in the Qur'an (who, when they are reminded of them) invited through them to perform the five daily prayers with the call to prayer and the call announcing the start of the prayer, (fall down prostrate) they come in all humility (and hymn the praise of their Lord) and pray by the command of their Lord, (and they are not scornful) they are not too proud to believe in Muhammad (pbuh) and in the Qur'an or too proud to pray in congregation. This verse was revealed about the hypocrites who were sluggish in their coming to the congregational prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنما يؤمن } على التحقيق بآيات صفاتنا { الذين إذا ذُكِروا بها خرّوا } لسرعة قبولهم لها بصفاء فطرتهم { سجداً } فانين فيها { وسبّحوا بحمد ربّهم } أي: جرّدوا ذواتهم متّصفين بصفات ربّهم فذاك هو تسبيحهم وحمدهم له بالحقيقة { وهم لا يستكبرون } بظهور صفات النفس والأنائية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على مقتضى سنته المستمرة: { إِنَّمَا يُؤْمِنُ } ويذعن { بِآيَاتِنَا } الدالة على توحيد ذاتنا وكمال أسمائنا وصفاتنا الموحدون المخبتون { ٱلَّذِينَ إِذَا ذُكِّرُواْ بِهَا } أي: بالآيات تبشيراً وإنذاراً { خَرُّواْ } وسقطوا { سُجَّداً } مستقبلين مبادرين لقبولها\n وامتثال ما فيها من الأوامر والنواهي\n والعبر والتذكيرات الواردة في فحاويها { وَ } مع ذلك { سَبَّحُواْ } ونزهوا ربهم عمَّا لا يليق بجناب قدسه\n قائلين { بِحَمْدِ رَبِّهِمْ } عائدين نعمه على أنفسهم\n مواظبين على شكرها\n خاضعين خاشعين أذلاٍ\n واضعين جباههم على تراب المذلة تواضعاً وإسقاطاً للكبر والخيلاء المذمومين عقلاً وشرعاً { وَهُمْ } حنيئذٍ { لاَ يَسْتَكْبِرُونَ } [السجدة: 15] عند عبادة الله\n وعن الانقياد بأوامره وأحكامه الواردة في كتابهز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر ضدهم بقوله: { إنما يُؤمن بآياتنا } القرآن { الذين إذا ذُكَّروا بها خَرّوا سُجَّداً } سجدوا لله تواضعاً وخشوعاً\n وشكروا على ما رزقهم من الإسلام\n { وسبَّحوا بحمد ربهم } أي: نزَّهوا الله عما لا يليق به\n وأثنوا عليه حامدين له\n { وهم لا يستكبرون } عن الإيمان والسجود له\n جعلنا الله منهم بمنِّه\n آمين\n الإشارة: أهل الفَرْقِ من أهل الحجاب\n يتوفاهم ملك الموت\n وأهل الجمع مع الله من أهل العيان يتولى قبض أرواحهم ذو الجلال الإكرام كما قيل في الأخفياء من الأولياء الذين اختص الله تعالى بعلمهم - أنه يتولى قبض أرواحهم بيده\n فتطيب أجسادهم به فلا يعدوا عليها الثرى حتى يُبعثوا بها مُشْرِقَةً بنور البقاء المجعول فيهم\n بالرجوع إليه من الفناء\n فيكون بقلوبهم بَقَاءُ الأبد مع الباقي الأحد عز وجل\n وقد ورد في الخبر\n \" من واظب على قراءة آية الكرسي\n دُبر كل صلاة\n كان الذي يتولى قبض روحه ذو الجلال الإكرام \" \n \nيعني: من تدبر معناها\n والمراد بذلك خطفتها بالتجلي\n واستغراقها في الشهود\n وغيبتها عن الغير في ذلك الوقت الهائل\n فيغيب عن الواسطة في شهود الموسوط\n مع وجود الواسطة لعموم الآية\n والله تعالى أعلم\n قال القشيري: لولا غفلةُ القلوب لما أحال قبض أرواحهم على مَلَكِ الموت لأنَّ مَلَكَ الموتِ لا أَثَرَ منه في أحد\n وما يحصل في التوفِّي فمن خصائص قدرة الحق\n ولكنهم غفلوا عن شهود حقائق الربِّ\n فخاطبهم على قدر أفهامهم\n وعلَّقَ بالأغيار قلوبهم\n وكلٌّ يُخاطبه بما يحتمل على قدر قوته وضعفه\n هـ\n وقال في قوله: { ولو ترى إذ المجرمون\n\n\n\n } الآية: مَلَكَتْهُم الدهشةُ وَغَلبتهم الحجة\n فاعترفوا\n حينَ لا عُذْرَ\n واعترفوا\n حينَ لا اعتراف\n هـ\n قوله تعالى: { ولو شئنا لآتينا كل نفس هداها\n\n }\n قال القشيري: لو شاء سَهَّل سبيلَ الاستدلال\n وأدَام التوفيق لكلِّ أحدٍ\n ولكن تَعلَّقَتْ المشيئةُ بإغواء قوم\n وأردنا أن يكون للنار قُطان\n كما يكون للجنة سُكان\n لما علمنا يوم خلقناهما أنه ينزلهما قومٌ وقومٌ\n فَمن المحال أن نريد ارتفاعَ معلومنا\n إذ لو لم يقع\n ولم يحصل لم يكن عِلْماً\n فإذا لا أكون إلها\n ومن المحال أن أُريد ذلك\n ويقال: من يتسلَّطْ عليه من يحبه لم يجد في مُلْكِه ما يكرهه\n يا مسكين أفنيت عُمْرَك في النكد والعناء\n وأمضيت أيامك في الجهد والرجاء\n غيَّرت صفتك\n وأكثرتَ مجاهدتك\n فما تفعل فيما مضى\n كيف تبدله؟ وما تصنع في مشيئتي\n وبأي وسع ترُدُّها؟ وأنشدوا:\nقوله تعالى: { إنما يؤمن\n\n\n } الآية\n خروا سُجداً بظواهرهم في التراب\n وبسرائرهم\n بالخضوع لهيبة الكريم الوهاب\n فسجود الجبهة وسيلة لسجود القلب\n فإذا سجدت الجبهة وتكبر القلب على عباد الله\n كانت وسيلة بلا غاية\n وبالله التوفيق\n ثم وصف أهل الخضوع وما أكرمهم به\n فقال: { تَتَجَافَىٰ جُنُوبُهُمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:73",
      "similarity": 0.5443571041808416
    },
    {
      "verse": "15:98",
      "similarity": 0.4405747391193134
    },
    {
      "verse": "7:206",
      "similarity": 0.35884630023620273
    },
    {
      "verse": "17:107",
      "similarity": 0.3354286876788244
    },
    {
      "verse": "19:58",
      "similarity": 0.30207449251025476
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/32:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/32:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}