{
  "chapter": "السجدة",
  "text": "فذوقوا۟ بما نسيتم لقاء يومكم هذا انا نسينكم وذوقوا۟ عذاب الخلد بما كنتم تعملون",
  "translations": [
    {
      "translation": "So taste it. Because you forgot the meeting of this Day, We have forgotten you. Taste the punishment of eternal timelessness for what you did.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now suffer. As you forgot the meeting of this your Day of Doom, so have We forgotten you. Now taste the everlasting punishment for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste the chastisement on account of your forgetting the encounter of this Day. We, too, have forgotten you. Taste the eternal chastisement as a requital for your misdeeds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told, \"Suffer on this Day of Judgment. For your having ignored it, We have ignored you. Suffer everlasting torment for your evil deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore taste the recompense of your forgetting the confronting of this day of yours; We have abandoned you – now taste the everlasting punishment, the recompense of your deeds!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then taste because of your forgetting the meeting of this Day of yours. Surely, We too will forget you, so taste you the abiding torment for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste, because you neglected the meeting of this day of yours; surely We forsake you; and taste the abiding chastisement for what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now taste, for that you forgot the encounter of this your day! We indeed have forgotten you. Taste the chastisement of eternity for that you were doing!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste (the evil of your deeds). Forasmuch as ye forgot the meeting of this your day, lo! We forget you. Taste the doom of immortality because of what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall say to them, \"Taste this -- for you forgot you would ever meet this Day. We too will forget you -- taste the chastisement of Eternity for your [evil] deeds!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste ye the sequel, for as much as ye forgat the meeting of this your day, verily We have forgotten you. Taste the torment abiding for that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste [the punishment] for your having forgotten the encounter of this day of yours. We [too] have forgotten you. Taste the everlasting punishment because of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste ye then - for ye forgot the Meeting of this Day of yours, and We too will forget you - taste ye the Penalty of Eternity for your (evil) deeds!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then taste you (the torment of the Fire) because of your forgetting the Meeting of this Day of yours, (and) surely! We too will forget you, so taste you the abiding torment for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We shall say to them): 'Now taste, for you forgot the encounter of this Day, We have forgotten you. Taste Our eternal punishment, for that which you were doing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste, because you forgot the meeting of this Day of yours; We have forgotten you; so taste the eternal torment for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So taste [punishment] because you forgot the meeting of this, your Day; indeed, We have [accordingly] forgotten you. And taste the punishment of eternity for what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:14] When they enter [Hell] its Keepers shall say to them: So taste [now], the chastisement, for your having forgotten the encounter of this day of yours, in other words, for your having neglected to believe in it. We [too] shall forget you, we shall abandon you in the chastisement. And taste [now] the everlasting chastisement for what you used to practise’, of disbelief and denial.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So taste (the evil of your deeds). Forasmuch as ye forgot) the belief in and work for (the meeting of this your day, lo! We forget you) We leave you in the Fire. (Taste the doom immortality) the eternal torment (because of what ye used to do) in your state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَذُوقُواْ } أي: قلنا لهم بعدما لم نستجب دعوتهم: ذوقوا اليوم أيها الضالون المسرفون { بِمَا نَسِيتُمْ } أي: بسبب نسيانكم { لِقَآءَ يَوْمِكُمْ هَـٰذَآ } مع أن الرسل بالغوا بإخباره إياكم\n والكتب نطقت بتبيينه عليكم على أبلغ وجه وآكده\n وأنتم أصررتم على الإنكار غافلين ناسيين مكابرين { إِنَّا نَسِينَاكُمْ } اليوم أنواع العذاب\n كما نسيتم أنتم إيانا فيما مضى { وَذُوقُـواْ عَذَابَ ٱلْخُلْدِ } أي: المخلَّد المؤبَّد { بِمَا كُنتُمْ تَعْمَلُونَ } [السجدة: 14] من الكفران الدائم\n والنيسان المستمر في النشأة الأولى\n أعاذنا الله وعموم عباده من ذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فذُوقُوا بما نسيتم لقاء يومكم هذا } أي: باشروا وبال ترككم العمل للقاء يومكم هذا\n وهو الإيمان به\n { إِنا نَسيناكم }: تركناكم في العذاب\n { وذوقوا عذابَ الخُلْدَ } أي: العذاب الدائم الذي لا انقطاع له { بما كنتم تعملون } من الكفر والمعاصي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:126",
      "similarity": 0.533051177215441
    },
    {
      "verse": "45:34",
      "similarity": 0.4982398823451164
    },
    {
      "verse": "59:19",
      "similarity": 0.4409902319443715
    },
    {
      "verse": "20:52",
      "similarity": 0.4385235838079825
    },
    {
      "verse": "19:64",
      "similarity": 0.4342711046937763
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}