{
  "chapter": "السجدة",
  "text": "تنزيل الكتب لا ريب فيه من رب العلمين",
  "translations": [
    {
      "translation": "The revelation of this Book free of doubt and involution is from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book, beyond all doubt, was revealed by the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no doubt that this Book is revealed by the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book is, without doubt, from the Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book in which there is no doubt, is from the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book, there is no doubt in it, is from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sending down of the Book, wherein no doubt is, from the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Scripture whereof there is no doubt is from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book has beyond all doubt been revealed by the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revelation of this Book, whereof there is no doubt, is from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The [gradual] sending down of the Book, there is no doubt in it, is from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) the Revelation of the Book in which there is no doubt,- from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book (this Quran) is from the Lord of the 'Alamin (mankind, jinns and all that exists) in which there is not doubt!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sending down of the Book in which there is no doubt that is from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book, without a doubt, is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] the revelation of the Book about which there is no doubt from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:2] The revelation of the Book, the Qur’ān (tanzīlu’l-kitābi, the subject) whereof there is no doubt (lā rayba fīh, the first predicate) from the Lord of the Worlds (min rabbi’l-‘ālamīna, the second predicate).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The revelation of the Scripture) this Scripture is Allah's speech addressed to you (whereof there is no doubt) there is no doubt that it (is from the Lord of the Worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الم } أي: ظهور الذات الأحديّة والصفات والحضرات الأسمائية هو { تنزيل } كتاب العقل الفرقاني المطلق على الوجود المحمدي { من ربّ العالمين } بظهوره في مظهره بصورة الرحمة التامة { الله الذي خلق السموات والأرض وما بينهما } باحتجابه بها في الأيام الستة الإلهية التي هي مدة دور الخفاء من لدن آدم عليه السلام إلى دور محمد عليه الصلاة والسلام { ثم استوى } على عرش القلب المحمدي للظهور في هذا اليوم الأخير الذي هو جمعة تلك الأيام بالتجلي بجميع صفاته، فإن استواء الشمس هو كمال ظهورها في الإشراق ونشر الشعاع، ولهذا قال عليه السلام:\n\n \" بُعِثْتُ في نَسَم الساعة \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَنزِيلُ ٱلْكِتَابِ } الجامع لما في الكتب السالفة، المبيِّن لأحكام دين الإسلام، المنزل عليك يا أكمل الرسل؛ لتأييدك وتوريح دينك { لاَ رَيْبَ فِيهِ } إنه نازل من الله الجامع لجميع الأسماء والصفات، كما أن مرتبتك جامعة لجميع مراتب أهل العلم، وأنت مبعوث إلى كافة الأمم؛ ولذا صا كتابك نازلاً { مِن رَّبِّ ٱلْعَالَمِينَ } [السجدة: 2] يشكُّون ويترددون في نزوله من عنده سبحانه أولئك الطاعنون الضالون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحق جل جلاله: { الۤـم } أيها المصطفى المقرب، هذا الذي تتلوه هو { تنزيلُ الكتاب لا ريبَ فيه } ، لأنه معجز للبشر، ومثله أبعد شيء عن الريب، وهو { من ربِّ العالمين } لا محالة\n { أم يقولون افتراه } ، أي: اختلقه محمد من عنده، وهو إنكار لقولهم، وتعجيب منه لظهور أمره في عجزهم عن الإتيان بسورة منه",
      "translations": []
    }
  ]
}