{
  "chapter": "السجدة",
  "text": "ولقد ءاتينا موسى الكتب فلا تكن فى مرية من لقائه وجعلنه هدى لبنى اسرءيل",
  "translations": [
    {
      "translation": "We gave Musa the Book - be in no doubt about the meeting with him - and made it a guidance for the tribe of Israel.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We gave Moses the Book; so be not in doubt about his having received it; and We made it a guidance for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We bestowed the Book upon Moses. So entertain no doubt if (the Prophet Muhammad) received the same. We had made that Book a guidance for the Children of Israel,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to Moses - do not have any doubt about the Day of Judgment - and made it a guide for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed the Book to Moosa, therefore have no doubt in its acquisition, and made it a guidance for the Descendants of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa the Scripture. So, be not you in doubt of meeting him. And We made it a guide to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave the Book to Musa, so be not in doubt concerning the receiving of it, and We made it a guide for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave Moses the Book; so he not in doubt concerning the encounter with him; and We appointed it for a guidance to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We verily gave Moses the Scripture; so be not ye in doubt of his receiving it; and We appointed it a guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Scripture, so [Muhammad] do not doubt that you are receiving it, just as We made it a guide for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We vouchsafed the Book Unto Musa; so be thou not in doubt in thy receiving it. And We appointed it to be a guidance unto the Children of Is'rail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book, [declaring], ‘Do not be in doubt about the encounter with Him,’ and We made it a [source of] guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed aforetime give the Book to Moses: be not then in doubt of its reaching (thee): and We made it a guide to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa (Moses) the Scripture [the Taurat (Torah)]. So be not you in doubt of meeting him [i.e. when you met Musa (Moses) during the night of Al-Isra' and Al-Mi'raj over the heavens]. And We made it [the Taurat (Torah)] a guide to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given the Book to Moses, so (Prophet Muhammad) do not be in doubt concerning the meeting with him (Prophet Moses) and made it a guidance to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book; so do not be in doubt regarding His encounter; and We made it a guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly gave Moses the Scripture, so do not be in doubt over his meeting. And we made the Torah guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:23] And verily We gave Moses the Scripture, the Torah; so do not be in doubt concerning the encounter with Him, and indeed he and He met on the Night of the Journey; and We appointed him, namely, Moses — or [read ‘We appointed it’] the Scripture, a guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We verily gave Moses the Scripture) the Torah in one bulk; (so be not ye) Muhammad (in doubt of his receiving it) of meeting Moses the night you were transported to Jerusalem; (and We appointed it) the Scripture of Moses (a guidance for the Children of Israel) from guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولقد آتينا موسى الكتابَ } التوراة { فلا تكن في مِرْيةٍ } شك { من لقائه } من لقاء موسى الكتاب\n أو: من لقائك موسى ليلة المعراج\n أو: يوم القيامة\n أو: من لقاء موسى ربَّه في الآخرة\n كذا عن النبي صلى الله عليه وسلم\n { وجعلناه هدى لبني إسرائيل } وجعلنا الكتاب المنزَّل على موسى عليه السلام هُدىً لقومه { وجعلنا منهم أئمةً يَهْدُون } الناس\n ويدعون إلى الله وإلى ما في التوراة من دين الله وشرائعه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:60",
      "similarity": 0.6211620230731931
    },
    {
      "verse": "44:50",
      "similarity": 0.6069485021689002
    },
    {
      "verse": "2:147",
      "similarity": 0.6035265934481011
    },
    {
      "verse": "53:12",
      "similarity": 0.5969765029601709
    },
    {
      "verse": "15:63",
      "similarity": 0.5828880048708854
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/32:23.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/32:23.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}