{
  "chapter": "السجدة",
  "text": "اولم يروا۟ انا نسوق الماء الى الارض الجرز فنخرج به زرعا تاكل منه انعمهم وانفسهم افلا يبصرون",
  "translations": [
    {
      "translation": "Do they not see how We drive water to barren land and bring forth crops by it which their livestock and they themselves both eat? So will they not see?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We drive the rain towards a land that is dry, then grow grain from it which their cattle and they themselves eat? Will they not see even then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We drive water to the parched land, thereby bringing forth crops which they and their cattle eat? Are they unable to see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We drive the water to the barren land and cause crops to grow which they and their cattle consume? Why, then, they will not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do they not see that We send the water to the barren land and produce crops with it, so their animals and they themselves eat from it? So do they not perceive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We drive water to the dry land that has no vegetation, and therewith bring forth crops providing food for their cattle and themselves Will they not then see\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We drive the water to a land having no herbage, then We bring forth thereby seed-produce of which their cattle and they themselves eat; will they not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We drive the water to the dry land and bring forth crops therewith whereof their cattle and themselves eat? What, will they not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We lead the water to the barren land and therewith bring forth crops whereof their cattle eat, and they themselves? Will they not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We drive the water to the barren land and produce thereby crops of which their cattle and they themselves eat? Will they not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe they not that We drive water unto a land bare, and bring forth therewith crops whereof their cattle and they themselves eat? Will they not therefore be enlightened?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We carry water to the parched earth and with it We bring forth crops, from which they eat, themselves and their cattle? Will they not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do they not see that We do drive rain to parched soil (bare of herbage), and produce therewith crops, providing food for their cattle and themselves? Have they not the vision?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We drive water (rain clouds) to the dry land without any vegetation, and therewith bring forth crops providing food for their cattle and themselves? Will they not then see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how We drive the water to the parched lands and bring forth therefrom crops from which their cattle and themselves eat? Will they not see!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how We conduct the water to a dry land, and with it We produce vegetation, from which their livestock eat, and themselves? Do they not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We drive the water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:27] Or have they not seen how We drive the water to barren land (juruz), [this] is arid land that contains no vegetation), and therewith bring forth crops whereof their cattle and [they] themselves eat? Can they not see?, this and so realise that We have the power to bring them back [to life after death].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not seen) do the people of Mecca not know (how We lead the water to the barren land) wherein there is no vegetation (and therewith) with the water (bring forth crops whereof) from the grass (their cattle eat, and they themselves) eat from the grains, fruits and legumes? (Will they not then see) do they not know it is from Allah? 471\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلَى ٱلأَرْضِ ٱلْجُرُزِ } معناه البَلقعُ\n ومعناهُ الأَرضُ الغَليظةُ اليَابسةُ التي لم يُصبْها مَطرٌ\n وقال: هِي الأَرضُ التي لَيس فِيها نَباتٌ وقال: هي أَرض اليَمنِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Unto the earth, {will return}\" [Qur'an 20:55], means that the {blaq'} will return to the earth.\n\nThe {Earth} is the vast, dry land that has not been touched by rain.\n\nHe said: \"This is the land that has no plant.\" And he said: \"This is the land of Yemen.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَلَمْ يَرَوْاْ } ولم يبصروا أولئك المعاندون المنكرون على كمال قدرتنا\n ووفور حكمتنا واختيارنا { أَنَّا } من مقام جودنا ولطفنا كيف { نَسُوقُ ٱلْمَآءَ } بالتدابير العجيبة\n والحكم البديعة من تصعيد الأبخرة والأدخنة\n وتراكم السحب منها\n وتقاطر المطر من فتوقها وخلالها { إِلَى ٱلأَرْضِ ٱلْجُرُزِ } التي قطع نباتها من غاية يبسها وجمودها { فَنُخْرِجُ بِهِ } أي: الماء الذي سقنا { زَرْعاً } أي: أنواعاً من الأقوات { تَأْكُلُ مِنْهُ أَنْعَامُهُمْ } أوراقه وتبنه { وَأَنفُسُهُمْ } حبوبه وثمرته { أَفَلاَ يُبْصِرُونَ } [السجدة: 27] أولئك المصرون المنكرون هذه القدرة العجيبة\n فيستدلون بها على قدرتنا الكاملة\n وحكمتنا البليغة البالغة بعدما سمعوا منك يا أكمل الرسل أن ربك يفصل بينهم فيما كانوا فيه يختلفون؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { أوَلَمْ يَرَوا أَنَّا نسوقُ الماءَ }: المطر { إلى أرض الجُرُز } أي: التي جُرِزَ نباتها، أي: قُطِعَ، ولم يَبْقَ منه شيء إما لعدم الماء، أو لأنه رُعِيَ\n يقال: جرزت الجراد الزرع إذ استأصلته، وفي القاموس: وأرض جرز: لا تنبت، أو أكل نباتها، أو لم يصبها مطر\n ثم قال: وأرض جارزة: يابسة غليظة، وفيه أربع لغات: جُرْز وجُرُز وجَرَز وجُرَز\n ولا يقال للتي لا تنبت كالسباخ: جرز، بدليل قوله: { فنُخرج به } أي: بالماء، { زرعاً تأكل منه } أي: الزرع، { أنعامُهم } كالتبن والورق، { وأنفسُهم } كالحب والتمر، المراد بالزرع: كل ما يُزرع ويُستنبت، أفلا يُبصرون، فيستدولون به على قدرته على إحياء الموتى؟",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:8",
      "similarity": 0.7520914701537662
    },
    {
      "verse": "56:64",
      "similarity": 0.21226405512909804
    },
    {
      "verse": "44:26",
      "similarity": 0.2037002737399072
    },
    {
      "verse": "25:20",
      "similarity": 0.17852691025021394
    },
    {
      "verse": "50:21",
      "similarity": 0.16586406021304106
    }
  ]
}