{
  "chapter": "السجدة",
  "text": "وجعلنا منهم ائمة يهدون بامرنا لما صبروا۟ وكانوا۟ بـايتنا يوقنون",
  "translations": [
    {
      "translation": "We appointed leaders from among them, guiding by Our command when they were steadfast and when they had certainty about Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they persevered and firmly believed Our revelations We appointed learned men among them who guided them by Our command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they remained steadfast and firmly believed in Our Signs, We created among them leaders who guided people by Our command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed some of the Israelites as leaders for their exercising patience to guide the others to Our commands. They had firm belief in Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made some leaders among them, guiding by Our command, when they had persevered; and they used to accept faith in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made from among them, leaders, giving guidance under Our command, when they were patient and used to believe with certainty in Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made of them Imams to guide by Our command when they were patient, and they were certain of Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed from among them leaders guiding by Our command, when they endured patiently, and had sure faith in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they became steadfast and believed firmly in Our revelations, We appointed from among them leaders who guided by Our command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed leaders from among them, guiding by Our command when they were steadfast and when they had firm faith in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed, from amongst them, leaders guiding others by Our command, when they had persevered, and of Our signs they were convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had been patient and had conviction in Our signs, We appointed amongst them imams to guide [the people] by Our command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed, from among them, leaders, giving guidance under Our command, so long as they persevered with patience and continued to have faith in Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made from among them (Children of Israel), leaders, giving guidance under Our Command, when they were patient and used to believe with certainty in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they were patient, We made from them leaders, guiding with Our Command and they were certain of Our verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed leaders from among them, guiding by Our command, as long as they persevered and were certain of Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:24] And We appointed among them leaders (read a-immatan by pronouncing both hamzas, or by substituting the second one with a yā) who guided, people, by Our command, when they had endured [patiently], in [observing] their religion, and against the hardships [they suffered] because of their enemies (lammā, ‘when’: a variant reading has limā, ‘because’) and had conviction in Our signs, [the ones] indicating Our power and Our Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا وَكَانُوا بِآَيَاتِنَا يُوقِنُونَ (24)أشير إلى ما مَنّ الله به على بني إسرائيل إذ جعل منهم أيمة يهدون بأمر الله والأمر يشمل الوحي بالشريعة لأنه أمر بها ، ويشمل الانتصاب للإرشاد فإن الله أمر العلماء أن يبينوا الكتاب ويرشدوا إليه فإذا هدوا فإنما هدوا بأمره وبالعلم الذي آتاهم به أنبياؤهم وأحبارهم فأنعم الله عليهم بذلك لما صبروا وأيقنوا لما جاءهم من كتاب الله ومعجزات رسولهم فإن كان المراد من قوله { بآياتنا يُوقِنُونَ } دلائل صدق موسى عليه السلام ، فالمعنى : أنهم صبروا على مشاق التكليف والخروج بهم من أرض مصر وما لقوه من فرعون وقومه من العذاب والاضطهاد وتيههم في البرية أربعين سنة وتدبروا في الآيات ونظروا حتى أيقنوا .وإن كان المراد من الآيات ما في التوراة من الشرائع والمواعظ فإطلاق اسم الآيات عليها مشاكلة تقديرية لما هو شائع بين المسلمين من تسمية جمل القرآن آيات لأنها مُعجزة في بلاغتها خارجة عن طوق تعبير البشر . فكانت دلالات على صدق محمد صلى الله عليه وسلم وهذا نحو ما وقع في حديث رجم اليهوديين من قول الراوي : فوضع اليهودي يده على آية الرجم ، أي الكلام الذي فيه حكم الرجم في التوراة فسماه الراوي آية مشاكلة لكلام القرآن . وفي هذا تعريض بالبشارة لأصحاب رسول الله صلى الله عليه وسلم بأنهم يكونون أيمة لدين الإسلام وهداة للمسلمين إذ صبروا على ما لحقهم في ذات الله من أذى قومهم وصبروا على مشاق التكليف ومعاداة أهلهم وقومهم وظلمهم إياهم . وتقديم { بآياتنا } على { يوقنون } للاهتمام بالآيات .وقرأ الجمهور { لَمَّا صَبَروا } بتشديد الميم وهي { لمّا التي هي حرف وجود لوجود وتسمى التوقيتية ، أي : جعلناهم أيمة حين صبروا وكانوا بآياتنا يوقنون . وقرأ حمزة والكسائي وخلف ورويس عن يعقوب بتخفيف الميم على أنها مركبة من لام التعليل و ( ما ) المصدرية ، أي جعلناهم أيمة لأجل صبرهم وإيقانهم .\n\n",
      "translations": [
        {
          "translation": "(And when they became steadfast) in their faith in and obedience of Me (and believed firmly) believed from their Scripture (in Our revelations) in Muhammad (pbuh) and in the Qur'an, (We appointed from among them) from among the children of Israel (leaders) of goodness (who guided by Our command) who invite people to Our command.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا } قال الإِمام زيد بن علي عليهما السلام: لا تزال الأئمةُ منها - أَهل البيت - يَدعونَ إِلى كِتابِ الله وسُنةِ رَسولِهِ صلى الله عليه وعلى آلهِ وسلم حتَّى يَتقاربَ وَقتُ الآخرةِ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah {And We made from them Imams who guide by Our command} Imam Zayd bin Ali said: The Imams from them - the Ahlul Bayt - will continue to call to the Book of Allah and the Sunnah of His Messenger until the time of the Hereafter draws near.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ قد { جَعَلْنَا مِنْهُمْ أَئِمَّةً } أمناء هادون\n مهديون مقتدون { يَهْدُونَ } الناس { بِأَمْرِنَا } ووحينا إياهم\n وإلهامنا إليهم إلى ديننا وتوحيدنا\n وإنما أعطيناهم ما أعطيناهم من الكرامات { لَمَّا صَبَرُواْ } أي: حين وطَّنوا نفوسهم على تحمل ما لحقهم في إعلاء كلمة الحق\n وإفشاء أعلام الدين من المتاعب والمكروهات المؤدية إلى إتلاف النفس\n وبذل المهج وأنواع المصيبات { وَ } هم { كَانُواْ } في أنفسهم { بِآيَاتِنَا } النازلة إياهم\n الدالة على كمال قدرتنا\n الواردة في أي شيء أردناه { يُوقِنُونَ } [السجدة: 24] يذعنون\n لا يترددون فيها ولا يتذبذبون\n وأنت يا أكمل الرسل أولى وأحق منهم بإيقان آياتنا وإذعانها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بأمرنا } إياهم بذلك\n أو بتوفيقنا وهدايتنا لمن أردنا هدايته على أيديهم\n { لمّا صبروا } على مشاق تعليم العلم والعمل به\n أو: على طاعة الله وترك معصيته\n وقرأ الأَخَوَان: بكسر اللام\n أي: لصبرهم عن الدنيا والزهد فيها\n وفيه دليل على أن الصبر ثمرته إمامة الناس والتقدم في الخير\n { وكانوا بآياتنا } التوراة { يُوقنون } يعلمون علماً لا يخالجه شك ولا وَهْم لإمْعانِهم النظر فيها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:20",
      "similarity": 0.6353414596801048
    },
    {
      "verse": "69:51",
      "similarity": 0.6077571404933108
    },
    {
      "verse": "44:7",
      "similarity": 0.5935307511650189
    },
    {
      "verse": "26:24",
      "similarity": 0.5900886526897453
    },
    {
      "verse": "56:95",
      "similarity": 0.5890183066303073
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}