{
  "chapter": "السجدة",
  "text": "قل يوم الفتح لا ينفع الذين كفروا۟ ايمنهم ولا هم ينظرون",
  "translations": [
    {
      "translation": "Say: \"Of no use will be the acceptance of belief to unbelievers on the Day of Decision, nor will they be granted respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: “If the unbelievers were to believe on the Day of Judgement that will not avail them. For then they will be granted no respite.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"On the day of the final triumph, the faith of the disbelievers will be of no avail to them, nor will they be given any respite\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “On the Day of Decision*, the disbelievers will not benefit from their accepting faith, nor will they get respite.” (* Of death or of resurrection)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"On the Day of Al-Fath, no profit will it be to those who disbelieve if they (then) believe! Nor will they be granted a respite.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: On the day of judgment the faith of those who (now) disbelieve will not profit them, nor will they be respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'On the Day of Victory their faith shall not profit the unbelievers, nor shall they be respited.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them): On the day of the victory the faith of those who disbelieve (and who then will believe) will not avail them, neither will they be reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"On the Day of Judgement it will be of no benefit to those who were bent on denying the truth, if they [then] believe! They will be granted no respite.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: on the day of the Decision their belief will not profit those who have disbelieved; nor will they be respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘On the day of judgement their [newly found] faith will not avail the faithless, nor will they be granted any respite.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"On the Day of Decision, no profit will it be to Unbelievers if they (then) believe! nor will they be granted a respite.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"On the Day of Al-Fath (Decision), no profit will it be to those who disbelieve if they (then) believe! Nor will they be granted a respite.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'On the Day of Opening the faith of the unbelievers will not benefit them, nor shall they be respited'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “On the day of victory, the faith of those who disbelieved will be of no avail to them, and they will not be granted respite.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"On the Day of Conquest the belief of those who had disbelieved will not benefit them, nor will they be reprieved.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:29] Say: ‘On the day of [this] Judgement, [which will be effected] by sending the chastisement on them, their [newly found] faith [then] shall not benefit those who had been disbelievers, nor shall they be given respite, to make repentance or [offer] excuses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to Banu Khuzaymah and Banu Kinanah: (On the day of the victory) of the conquest of Mecca (the faith of those who disbelieve) i.e. Banu Khuzaymah ((and who then will believe) will not avail them) from being killed, (neither will they be reprieved) from being sentenced to death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ ٱلْفَتْحِ } معناه يَومُ القَضاءِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل في جوابهم: { يَوْمَ ٱلْفَتْحِ } هو يوم القيامة المعدة؛ لتنقيد الأعمال والحساب، فومئذٍ { لاَ يَنفَعُ ٱلَّذِينَ كَفَرُوۤاْ } في النشأة الأولى مدة أعمارهم { إِيَمَانُهُمْ } فيها { وَلاَ هُمْ } حينئذٍ { يُنظَرُونَ } [السجدة: 29] ويمهلون؛ حتى يتداركوا ما فوَّتوا على نفوسهم طول عمرهم من الإيمان بالله، والامتثال بأوارمه ونواهيه، وتصديق الرسل والكتب، وجميع معالم الدين وشعائر الإسلام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل يومَ الفتح } أي: يوم القيامة هو يوم الفصل بين المؤمنين وأعدائهم\n أو: يوم نصرهم عليهم\n أو: يوم بدر، أو يوم فتح مكة، { لا ينفعُ الذين كفروا إيمانُهم } لفوات محله، الذي هو الإيمان بالغيب، { ولا هم يُنْظَرون } يُمْهِلون، وهذا الكلام لم ينطبق جواباً عن سؤالهم ظاهراً، ولكن لمّا كان غرضهم في السؤال عن وقت الفتح استعجالاً منهم، على وجه التكذيب والاستهزاء، أُجيبوا على حسب ما عُرف من غرضهم من سؤالهم، فقيل لهم: لا تستعجلوا به ولا تستهزئوا، فكأني بكم وقد حصلتم في ذلك اليوم وآمنتم، فلم ينفعكم الإيمان، واستنظرتم عند درك العذاب فلم تُمهلوا\n ومن فسره بيوم بدر أو بيوم الفتح، فهو يريد المقتولين منهم فإنهم لا ينفعهم إيمانهم في حال الفعل، كما لم ينفع فرعون إيمانه عند دَرَك الغرق",
      "translations": []
    }
  ]
}