{
  "chapter": "السجدة",
  "text": "ولقد ءاتينا موسى الكتب فلا تكن فى مرية من لقائه وجعلنه هدى لبنى اسرءيل",
  "translations": [
    {
      "translation": "We gave Musa the Book - be in no doubt about the meeting with him - and made it a guidance for the tribe of Israel.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We gave Moses the Book; so be not in doubt about his having received it; and We made it a guidance for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We bestowed the Book upon Moses. So entertain no doubt if (the Prophet Muhammad) received the same. We had made that Book a guidance for the Children of Israel,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to Moses - do not have any doubt about the Day of Judgment - and made it a guide for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We bestowed the Book to Moosa, therefore have no doubt in its acquisition, and made it a guidance for the Descendants of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa the Scripture. So, be not you in doubt of meeting him. And We made it a guide to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave the Book to Musa, so be not in doubt concerning the receiving of it, and We made it a guide for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave Moses the Book; so he not in doubt concerning the encounter with him; and We appointed it for a guidance to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We verily gave Moses the Scripture; so be not ye in doubt of his receiving it; and We appointed it a guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Scripture, so [Muhammad] do not doubt that you are receiving it, just as We made it a guide for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We vouchsafed the Book Unto Musa; so be thou not in doubt in thy receiving it. And We appointed it to be a guidance unto the Children of Is'rail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book, [declaring], ‘Do not be in doubt about the encounter with Him,’ and We made it a [source of] guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed aforetime give the Book to Moses: be not then in doubt of its reaching (thee): and We made it a guide to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa (Moses) the Scripture [the Taurat (Torah)]. So be not you in doubt of meeting him [i.e. when you met Musa (Moses) during the night of Al-Isra' and Al-Mi'raj over the heavens]. And We made it [the Taurat (Torah)] a guide to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given the Book to Moses, so (Prophet Muhammad) do not be in doubt concerning the meeting with him (Prophet Moses) and made it a guidance to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book; so do not be in doubt regarding His encounter; and We made it a guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly gave Moses the Scripture, so do not be in doubt over his meeting. And we made the Torah guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:23] And verily We gave Moses the Scripture, the Torah; so do not be in doubt concerning the encounter with Him, and indeed he and He met on the Night of the Journey; and We appointed him, namely, Moses — or [read ‘We appointed it’] the Scripture, a guidance for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَقَدْ آَتَيْنَا مُوسَى الْكِتَابَ فَلَا تَكُنْ فِي مِرْيَةٍ مِنْ لِقَائِهِ وَجَعَلْنَاهُ هُدًى لِبَنِي إِسْرَائِيلَ (23)لما جرى ذكر إعراض المشركين عن آيات الله وهي آيات القرآن في قوله { ومن أظلم ممن ذكر بآيات ربه ثم أعرض عنها } \\[ السجدة : 22 \\] ، استطرد إلى تسلية النبي صلى الله عليه وسلم بأن ما لقي من قومه هو نظير ما لقيه موسى من قوم فرعون الذين أرسل إليهم فالخبر مستعمل في التسلية بالتنظير والتمثيل . فهذه الجملة وما بعدها إلى قوله { فيما كانوا فيه يختلفون } \\[ السجدة : 25 \\] معترضات . وموقع التأكيد بلام القسم وحرف التحقيق هو ما استعمل فيه الخبر من التسلية لا لأصل الأخبار لأنه أمر لا يحتاج إلى التأكيد ، وبه تظهر رشاقة الاعتراض بتفريع { فلا تكن في مرية من لقائه } على الخبر الذي قبله .وأريد بقوله { ءاتينا موسى الكتاب } أرسلنا موسى ، فذِكر إيتائه الكتاب كناية عن إرساله ، وإدماج ذكر { الكتاب } للتنويه بشأن موسى وليس داخلاً في تنظير حال الرسول صلى الله عليه وسلم بحال موسى عليه السلام في تكذيب قومه إياه لأن موسى لم يكذبه قومه ألا ترى إلى قوله تعالى : { وجعلناه هدى لبني إسرائيل } الآيات ، وليتأتى من وفرة المعاني في هذه الآية ما لا يتأتى بدون ذِكر { الكتاب .وجملة فلا تكن في مرية من لقائه } معترضة وهو اعتراض بالفاء ، ومثله وارد كثيراً في الكلام كما تقدم عند قوله تعالى : { إن يكن غنياً أو فقيراً فالله أولى بهما } الآية في سورة النساء ( 135 ) . ويأتي عند قوله تعالى : { هذا فليذوقوه حميمٌ وغساق } في سورة ص ( 57 ) .والمرية : الشك والتردد . وحرف الظرفية مجاز في شدة الملابسة ، أي لا يكن الشك محيطاً بك ومتمكناً منك ، أي لا تكن ممترياً في أنك مثله سينالك ما نالَه من قومه .والخطاب يجوز أن يكون للنبيء ، فالنهي مستعمل في طلب الدوام على انتفاء الشك فهو نهي مقصود منه التثبيت كقوله { فلا تك في مرية مما يعبد هؤلاء } \\[ هود : 109 \\] ، وليس لطلب إحداث انكفاف عن المرية لأنها لم تقع من قبل .واللقاء : اسم مصدر لَقِيَ وهو الغالب في الاستعمال دون لِقى الذي هو المصدر القياسي . واللقاء : مصادفة فاعل هذا الفعل مفعولَه ، ويطلق مجازاً على الإصابة كما يقال : لقيت عناء ، ولقيت عَرق القِربة ، وهو هنا مجاز ، أي لا تكن في مرية في أن يصيبك ما أصابه ، وضمير الغائب عائد إلى موسى . واللقاء مصدر مضاف إلى فاعله ، أي مما لقي موسى من قوم فرعون من تكذيب ، أي من مثل ما لقي موسى ، وهذا المضاف يدل عليه المقام أو يكون جارياً على التشبيه البليغ كقوله : هو البدر ، أي : من لقاء كلقائه ، فيكون هذا في معنى آيات كثيرة في هذا المعنى وردت في القرآن كقوله تعالى : { ولقد استُهْزِىء برُسُل من قبلك } \\[ الأنعام : 10 \\] { فصبَروا على ما كُذّبوا وأوذوا حتى أتاهم نصرنا }\\[ الأنعام : 34 \\] ، وقوله : { وإن كادوا لَيَسْتَفِزُّونك من الأرض لِيُخرِجُوك منها وإذاً لا يلبثون خَلْفَك إلا قليلاً سُنَّةَ من قد أرسلنا من قبلك من رُسُلِنا } \\[ الإسراء : 76 ، 77 \\] . هذا أحسن تفسير للآية وقريب منه مأثور عن الحسن .ويجوز أن يكون ضمير { لقائه } عائداً إلى موسى على معنى : من مثل ما لقي موسى من إرساله وهو أن كانت عاقبة النصر له على قوم فرعون ، وحصول الاهتداء بالكتاب الذي أوتيه ، وتأييده باهتداء بني إسرائيل ، فيكون هذا المعنى بشارة للنبيء صلى الله عليه وسلم بأن الله سيظهر هذا الدين . ويجوز أن يكون ضمير { لقائه } عائداً إلى الكتاب كما في «الكشاف» لكن على أن يكون المعنى : فلا تكن في شك من لقاء الكتاب ، أي من أن تلقى من إيتائك الكتاب ما هو شنشنة تلقِّي الكتب الإلهية كما تلقاها موسى . فالنهي مستعمل في التحذير ممن ظن أن لا يلحقه في إيتاء الكتاب من المشقة ما لقيه الرسل من قبله ، أي من جانب أذى قومه وإعراضهم . ويجوز أن يكون الخطاب في قوله { فلا تكن } لغير معين وهو موجه للذين امتروا في أن القرآن أنزل من عند الله سواء كانوا المشركين أو الذين يلقنونهم من أهل الكتاب ، أي لا تمتروا في إنزال القرآن على بشر فقد أنزل الكتاب على موسى فلا تكونوا في مرية من إنزال القرآن على محمد . وهذا كقوله تعالى : { إذ قالوا ما أنزل الله على بشر مِن شيء قل مَن أنزل الكتاب الذي جاء به موسى نوراً وهدى للناس } \\[ الأنعام : 91 \\] . فالنهي مستعمل في حقيقته من طلب الكف عن المرية في إنزال القرآن . وللمفسرين احتمالات أخرى كثيرة لا تسفر عن معنى بيِّن ، ومن أبعدها حمل اللقاء على حقيقته وعود ضمير الغائب لموسى وأن المراد لقاؤه ليلة الإسراء وعَده الله به وحقَّقه له في هذه الآية قبل وقوعه . قال ابن عطية : وقال المبرد حين امتحن أبا إسحاق الزجاج بهذه المسألةوضمير النصب في { وجعلناه هدى } يجوز أن يعود على الكتاب أو على موسى وكلاهما سبب هدى ، فوصف بأنه هدى للمبالغة في حصول الاهتداء به وهو معطوف على { ءاتينا موسى الكتاب } وما بينهما اعتراض . وهذا تعريض بالمشركين إذ لم يشكروا نعمة الله على أن أرسل إليهم محمد بالقرآن ليهتدوا فأعرضوا وكانوا أحق بأن يحرصوا على الاهتداء بالقرآن وبهدي محمد صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "(We verily gave Moses the Scripture) the Torah in one bulk; (so be not ye) Muhammad (in doubt of his receiving it) of meeting Moses the night you were transported to Jerusalem; (and We appointed it) the Scripture of Moses (a guidance for the Children of Israel) from guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولقد آتينا موسى الكتابَ } التوراة { فلا تكن في مِرْيةٍ } شك { من لقائه } من لقاء موسى الكتاب\n أو: من لقائك موسى ليلة المعراج\n أو: يوم القيامة\n أو: من لقاء موسى ربَّه في الآخرة\n كذا عن النبي صلى الله عليه وسلم\n { وجعلناه هدى لبني إسرائيل } وجعلنا الكتاب المنزَّل على موسى عليه السلام هُدىً لقومه { وجعلنا منهم أئمةً يَهْدُون } الناس\n ويدعون إلى الله وإلى ما في التوراة من دين الله وشرائعه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:60",
      "similarity": 0.6211620230731931
    },
    {
      "verse": "44:50",
      "similarity": 0.6069485021689002
    },
    {
      "verse": "2:147",
      "similarity": 0.6035265934481011
    },
    {
      "verse": "53:12",
      "similarity": 0.5969765029601709
    },
    {
      "verse": "15:63",
      "similarity": 0.5828880048708854
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}