{
  "chapter": "السجدة",
  "text": "ومن اظلم ممن ذكر بـايت ربه ثم اعرض عنها انا من المجرمين منتقمون",
  "translations": [
    {
      "translation": "Who is more wicked than he who is reminded of his Lord's revelations yet turns away from them; We will surely requite the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who is given good counsel through the Signs of his Lord and yet he turns away from them? Surely We will exact full retribution from such criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who are reminded of the revelation of their Lord, but have ignored them? We will take revenge on the criminal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who is preached to from the verses his Lord, then he turns away from them? We will indeed take revenge from the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who is reminded of the Ayat of his Lord, then turns aside therefrom Verily, We shall exact retribution from the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who is reminded of the communications of his Lord, then he turns away from them? Surely We will give punishment to the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who is reminded of the signs of his Lord, then turns away from them? We shall take vengeance upon the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who is reminded of the revelations of his Lord, then turneth from them. Lo! We shall requite the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than someone who, when revelations of his Lord are recited to him, turns away from them? We shall inflict retribution on the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who is reminded of His signs, then he turneth aside therefrom? Verily unto the culprits We are going to be Avenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who is reminded of his Lord’s signs, whereat he disregards them? Indeed, We shall take vengeance upon the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than one to whom are recited the Signs of his Lord, and who then turns away therefrom? Verily from those who transgress We shall exact (due) Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who is reminded of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of his Lord, then he turns aside therefrom? Verily, We shall exact retribution from the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more wicked than he who, when reminded of the verses of his Lord turns away from them? We take revenge on the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wrong than he, who, when reminded of his Lord’s revelations, turns away from them? We will certainly wreak vengeance upon the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:22] And who does greater wrong than he who is reminded of the signs of his Lord, [such as] the Qur’ān, but then turns away from them?, in other words, none does greater wrong than such [a person]. Assuredly We shall take vengeance upon the criminals, the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who doth greater wrong) no one is more insolent and iniquitous (than he who is reminded of) admonished by (the revelations of his Lord) this was revealed about the hypocrites and the deriders of the Qur'an, (then turneth from them) in denial. (Lo! We shall requite) We will chastise (the guilty) the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ } على الله، وأسوأ أدباً معه سبحانه { مِمَّن ذُكِّرَ } ووُعظ { بِآيَاتِ رَبِّهِ } ليهتدي بها إلى الإيمان والتوحيد، ويمتثل بمقتضاها؛ ليتخلص عن الكفر والشرك { ثُمَّ } بعدما سمعها { أَعْرَضَ عَنْهَآ } فجأة بلا تفكر وتأمل في معناها، وأنكر على مقتضاها، واستكبر على ما أنزل الله إليه، فكذبه ونسب إليه ما لا يليق بشأنه، وأصر على ما هو عليه عناداً ومكابرةً { إِنَّا } من مقام قهرنا وجلالنا { مِنَ ٱلْمُجْرِمِينَ مُنتَقِمُونَ } [السجدة: 22] أي: قل لهم يا أكمل الرسل نيابةً عنَّا بعدما بالغوا في الإنكار والإصرار: إنَّا منتقمون منهم على أبلغ وجه وأشده من عموم المجرمين الظالمين، فكيف من هو أجرم وأظلم منهم، وأصر على البغي والعناد؟! فننتقم عنهم، ونخلدهم في عذاب النار؛ إذ لا عذاب أسوأ منه وأشد، أعاذنا الله وجميع عباده منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن أظلم } أي: لا أحد أظلم { ممن ذُكِّر } أي: وُعظ { بآياتِ ربه } القرآن، { ثم أعرض عنها } اي: تولى عنها، ولم يتدبر في معناها\n و \" ثم \" للاستبعاد فإن الإعراض عن مثل هذه في ظهورها، وإنارتها، وإرشادها إلى سواء السبيل، والفوز بالسعادة العظمى، بعد التذكر بها، مُسْتَبْعَدٌ في العقل، كما تقول لصاحبك: وجدت تلك الفرصة ثم لم تنتهِزْها - استبعاداً لتركه الانتهاز\n { إنا من المجرمين منتقمون } ، ولم يقل: \" منه \" ، تسجيلاً عليه بإعراضه بالإجرام، ولأنه إذا جعله أظلم مِنْ كل ظالم، ثم توعد المجرمين، عامة، بالانتقام، دلّ على إصابة الأظلم أوفَرُ نصيب الانتقام، ولو قال بالضمير لم يفد هذه الفائدة\n الإشارة: ولنذيقن أهل الغفلة والحجاب، من العذاب الأدنى، وهو الحرص والطمع والجزع والهلع، قبل العذاب الأكبر، وهو غم الحاجب وسوء الحساب\n قال القشيري: قومٌ: الأدنى لهم: مِحَنُ الدُنيا، والأكبر: عقوبة العُقبى\n وقومٌ: الأدنى لهم: فترةٌ تُداخلهم في عبادتهم والأكبر: قسوةٌ تُصيبهم في قلوبهم\n وقومٌ: الأدنى لهم: وقفة مع سلوكهم تمسهم\n والأكبرُ: حَجْبَةٌ عن مشاهدتهم بسرهم - قلت: الأول في حق العوام، والثاني: في حق الخواص، وهم العباد والزهاد\n والثالث: في حق أهل التربية من الواصلين - ثم قال: ويقال: الأدنى: الخذلان في الزلة، والأكبر: الهجران في الوصلة\n ويقال: الأدنى: تكدّرُ مَشَارِبِهم، بعد صفوها، والأكبر: تَطَاوُلُ أيامِ الحَجْب، من غير تبيين آخرها\n وأنشدوا:\n",
      "translations": []
    }
  ]
}