{
  "chapter": "السجدة",
  "text": "ان ربك هو يفصل بينهم يوم القيمة فيما كانوا۟ فيه يختلفون",
  "translations": [
    {
      "translation": "On the Day of Rising your Lord will decide between them regarding everything about which they differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will decide between them about what they were at variance, on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will judge among them on the Day of Resurrection concerning the matters about which the Children of Israel used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will issue His decree about their (believers and disbeliever's) differences on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord will judge between them on the Day of Resurrection concerning the matters in which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will judge between them on the day of resurrection concerning that wherein they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely thy Lord will distinguish between them on the Resurrection Day, touching that whereon they were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord! He shall decide between them on the Day of Judgment concerning that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord will judge between them on the Day of Resurrection concerning that about which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord will judge between them on the Day of Judgment, in the matters wherein they differ (among themselves)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection your Lord will distinguish between them that on which they varied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will judge between them on the Day of Resurrection regarding everything they had disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:25] Surely your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ, in matters of religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ (25)استئناف بياني لأن قوله تعالى { وجعلنا منهم أيمة يَهْدُون بأمْرنا } \\[ السجدة : 24 \\] يثير سؤالاً في نفس السامع من المؤمنين الذين سمعوا ما في القرآن من وصف اختلاف بني إسرائيل وانحرافهم عن دينهم وشاهَد كثير منهم بني إسرائيل في زمانه غير متحلّين بما يناسب ما قامت به أيمتهم من الهداية فيودّ أن يعلم سبب ذلك فكان في هذه الآية جواب ذلك تعليماً للنبيء صلى الله عليه وسلم وللمؤمنين .والخطاب للنبيء والمراد أمتُه تحذيراً من ذلك وإيماءً إلى وجوب تجنب الاختلاف الذي لا يدعو إليه داع في مصلحة الأمة وفهم الدين .والفصل : القضاء والحكم ، وهو يقتضي أن اختلافهم أوقعهم في إبطال ما جاءهم من الهدى فهو اختلاف غير مستند إلى أدلة ولا جارٍ في مهيع أصل الشريعة؛ ولكنه متابعة للهوى وميل لأعراض الدنيا كما وصفه القرآن في آيات كثيرة في سورة البقرة وغيرها كقوله تعالى : { ولا تكونوا كالذين تفرّقوا واختلفوا من بعد ما جاءهم البينات وأولئك لهم عذاب عظيم } \\[ آل عمران : 105 \\] .وليس منه اختلاف أيمة الدين في تفاريع الأحكام وفي فهم الدين مما لا ينقض أصوله ولا يخالف نصوصه وإنما هو إعمال لأصوله ولأدلته في الأحوال المناسبة لها وحمل متعارضها بعضه على بعض فإن ذلك كله محمود غير مذموم؛ وقد اختلف أصحاب النبي صلى الله عليه وسلم في حياته فلم يعنّف أحداً ، واختلفوا بعد وفاته فلم يعنّف بعضهم بعضاً . ويشمل ما كانوا فيه يختلفون ما كان اختلافاً بين المهتدين والضالين منهم وما كان اتفاقاً من جميع أمتهم على الضلالة فإن ذلك خلاف بين المجمعين وبين ما نطقت به شريعتهم وسَنَّته أنبياؤهم ، ومن أعظم ذلك الاختلاف كتمانهم الشهادة ببعثة محمد صلى الله عليه وسلم وجحدهم ما أخذ عليهم من الميثاق من أنبيائهم .وضمير { هو } في قوله { هو يفصل } ضمير فصل لقصر الفصل عليه تعالى إيماء إلى أن ما يذكر في القرآن من بيان بعض ما اختلفوا فيه على أنبيائهم ليس مطموعاً منه أن يرتدعوا عن اختلافهم وإنما هو للتسجيل عليهم وقطع معذرتهم لأنهم لا يقبلون الحجة فلا يفصل بينهم إلا يوم القيامة .\n\n",
      "translations": [
        {
          "translation": "(Lo! thy Lord) Muhammad (will judge between them) between the believer and disbeliever; it is also said: between the Children of Israel (on the Day of Resurrection concerning that wherein) in Religion (they used to differ) they used to oppose.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ رَبَّكَ } الذي رباك بأنواع الكرامات\n وأيدك بأصناف الخوارق والمعجزات { هُوَ } بذاته ومقتضى حكمته المتقنة\n وأحكامه المبرمة { يَفْصِلُ } ويقضي { بَيْنَهُمْ } أي: بين المحقين والمبطلين\n ويميز كلاً منهم عن صاحبه { يَوْمَ ٱلْقَيَامَةِ } المعدة للقطع والفصل\n وتنفيذ الأحكام والحكومات\n فومئذٍ يظهر لهم الحق { فِيمَا كَانُواْ فِيهِ يَخْتَلِفُونَ } [السجدة: 25] من الأمور الدينية\n والمعارف اليقينية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو هِبَةٌ من الله تعالى: { إن ربك هو يَفْصِلُ } يقضي { بينهم يومَ القيامة } أي: بين الأنبياء وأممهم\n أو: بين المؤمنين والمشركين\n { فيما كانوا فيه يختلفون } من الدين\n فيظنه المُحِقُّ من المبطل\n الإشارة: أئمة الهدى على قسمين: أئمة يهدون إلى شرائع الدين\n وأئمة يهدون إلى التعرف بذات رب العالمين\n أئمة يهدون إلى معرفة البرهان وأئمة يهدون إلى معرفة العيان\n الأولون: من عامة أهل اليمين\n والآخرون: من خاصة المقربين\n الأولون صبروا على حبس النفس على ذل التعلم\n والآخرون صبروا على حبس النفس على الحضور مع الحق على الدوام\n صبروا على مجاهدة النفوس\n حتى وردوا حضرة القُدُّوس\n قال القشيري\n في شأن القسم الثاني: لمّا صبروا على طلبنا سَعِدوا بوجودنا\n وتعدّى ما نالوا من أفضالنا إلى متَّبِعِيهم وانبسط شعاعُ شموسهم على جميع أهلِيهم\n فهم للخلق هُداةً\n وفي الدين عيون\n وللمسترشدين نجوم\n هـ\n وفي الإحياء: للإيمان ركنان: أحدهما اليقين\n والآخر: الصبر: والمراد باليقين: المعارف القطعية\n الحاصلة بهداية اللهِ عَبْدَهُ إلى أصول الدين\n والمراد بالصبر\n العمل بمقتضى اليقين إذ النفس تعرف أن المعصية ضارة والطاعة نافعة\n ولا يمكن ترك المعصية والمواظبة على الطاعة إلا بالصبر\n فيكون الصبر نصف الإيمان لهذا الاعتبار\n هـ\n وقوله تعالى: { إن ربك هو يفصل بينهم\n\n }  قال القشيري: يحكم بينهم\n فيُبين المقبول من المردود\n والمهجور من الموصول\n والرّضي من الغَويّ\n والعدو من الوليّ\n فكم من بَهجةٍ دامت هناك! وكم من مهجةٍ ذابت كذلك\n هـ\n ثم ذكرهم بمن سلف قبلهم\n فقال: { أَوَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا مِن قَبْلِهِمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:13",
      "similarity": 0.7599174341391958
    },
    {
      "verse": "86:13",
      "similarity": 0.7150785242334692
    },
    {
      "verse": "37:21",
      "similarity": 0.6947845781797586
    },
    {
      "verse": "77:38",
      "similarity": 0.5922284367019491
    },
    {
      "verse": "7:52",
      "similarity": 0.5680194304108083
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}