{
  "chapter": "السجدة",
  "text": "واما الذين فسقوا۟ فماوىهم النار كلما ارادوا۟ ان يخرجوا۟ منها اعيدوا۟ فيها وقيل لهم ذوقوا۟ عذاب النار الذى كنتم به تكذبون",
  "translations": [
    {
      "translation": "As for those who disobey, their abode is Hell. Whensoever they wish to escape from it they would be dragged back into it, and told: \"Taste the torment of the Fire which you used to call a lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the evil-doers, their refuge shall be the Fire. Every time they want to escape from it they shall be driven back and shall be told: “Taste the chastisement of the Fire which you used to reject as a lie.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, the dwelling of the sinful ones will be hell fire. Each time they try to come out, they will be turned back with this remark, \"Suffer the torment of the fire which you had called a lie\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are lawless – their destination is the fire; whenever they wish to come out of it, they will be returned into it, and it will be said to them, “Taste the punishment of the fire you used to deny!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who rebel, their abode will be the Fire, every time they wish to get away therefrom, they will be put back thereto, and it will be said to them: \"Taste you the torment of the Fire which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who transgress, their abode is the fire; whenever they desire to go forth from it they shall be brought back into it, and it will be said to them: Taste the chastisement of the fire which you called a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for the ungodly, their refuge shall be the Fire; as often as they desire to come forth from it, they shall be restored into it, and it shall be said to them, 'Taste the chastisement of the Fire, which you cried lies to.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who do evil, their retreat is the Fire. Whenever they desire to issue forth from thence, they are brought back thither. Unto them it is said: Taste the torment of the Fire which ye used to deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who defy God, their home shall be the Fire. Whenever they try to escape it, they shall be driven back into it, and they shall be told, \"Taste the torment of the Fire, which you have persistently denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who transgress their abode is the Fire. So oft as they desire to get thereout, they shall be sent back thereto; and it will be said unto them: taste the torment of the Fire which ye were wont to belie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have transgressed, their refuge will be the Fire. Whenever they seek to leave it, they will be turned back into it and told: ‘Taste the punishment of the Fire which you used to deny.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who are rebellious and wicked, their abode will be the Fire: every time they wish to get away therefrom, they will be forced thereinto, and it will be said to them: \"Taste ye the Penalty of the Fire, the which ye were wont to reject as false.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who are Fasiqun (disbelievers and disobedient to Allah), their abode will be the Fire, every time they wish to get away therefrom, they will be put back thereto, and it will be said to them: \"Taste you the torment of the Fire which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who do evil their refuge is the Fire. As often as they desire to come out of it they shall be driven back, and it will be said to them: 'Taste the punishment of the Fire, which you have belied'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who transgressed, their shelter is the Fire. Every time they try to get out of it, they will be brought back into it, and it will be said to them, “Taste the suffering of the Fire which you used to deny.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who defiantly disobeyed, their refuge is the Fire. Every time they wish to emerge from it, they will be returned to it while it is said to them, \"Taste the punishment of the Fire which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:20] But as for those who transgressed, by disbelieving and denying, their abode shall be the Fire. Whenever they seek to exit from it, they shall be brought back into it, and it shall be said to them, ‘Taste the chastisement of the Fire which you used to deny’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for those who do evil) and as for those who were hypocrites in the life of this world, (their retreat is the Fire) as a final destination. (Whenever they desire to issue forth from thence) from the Fire, (they are brought back thither) to the Fire in shackles of iron. (Unto them it is said) the angels of the Fire say to them: (Taste the torment of the Fire which ye used to deny) in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا ٱلَّذِينَ فَسَقُواْ } أي: تركوا الإيمان بالله، وخرجوا عن مقتضى الأوامر والنواهي الموردة في كتبه وعلى ألسنة رسله { فَمَأْوَاهُمُ } أي: مرجعهم ومثواهم في النشأة الأخرى { ٱلنَّارُ } المعدة لأهل الشقاوة الأزلية، هم يها خالدون مخلدون، مؤبدون لا نجاة لهم أصلاً، بل { كُلَّمَآ أَرَادُوۤاْ } وأملوا { أَن يَخْرُجُواُ مِنْهَآ } أمهلهم الخزنة إلى أن يصلوا إلى شفيرنا، ثمَّ بعد ذلك { أُعِيدُواْ فِيهَا } زجراً وقهراً تاماً مهانين صاغرين { وَقِيلَ لَهُمْ } أي: الزبانية الموكلون عليهم بإلهما الله إياهم: { ذُوقُواْ } أيها المنكرون المصرون { عَذَابَ ٱلنَّارِ ٱلَّذِي كُنتُمْ بِهِ تُكَذِّبُونَ } [السجدة: 20] حين أخبركم الرسل والكتب، وأنذروكم به\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأما الذين فسقوا فمأواهم النارُ } أي: هي ملجأهم ومنزلُهم، { كلما أرادوا أن يخرجوا منها أُعيدوا فيها } ، فلا خروج منها، ولا موت، { وقيل } لهم: { ذُوقُوا عذابَ النار الذي كنتم به تُكذِّبون } ، هذا دليل على أن المراد بالفاسق: الكافر إذ التكذيب يقابل الإيمان\n قال ابن جزي: فإن قيل: لِمَ وصف، هنا، العذاب، وأعاد عليه الضمير، ووصف، في سبأ، النار وأعاد عليها الضمير، فقال:\n",
      "translations": []
    }
  ]
}