{
  "chapter": "السجدة",
  "text": "ومن اظلم ممن ذكر بـايت ربه ثم اعرض عنها انا من المجرمين منتقمون",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who is reminded of the Signs of his Lord and then turns away from them? We will take revenge on the evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wicked than he who is reminded of his Lord's revelations yet turns away from them; We will surely requite the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who is given good counsel through the Signs of his Lord and yet he turns away from them? Surely We will exact full retribution from such criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who are reminded of the revelation of their Lord, but have ignored them? We will take revenge on the criminal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who is preached to from the verses his Lord, then he turns away from them? We will indeed take revenge from the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who is reminded of the Ayat of his Lord, then turns aside therefrom Verily, We shall exact retribution from the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who is reminded of the communications of his Lord, then he turns away from them? Surely We will give punishment to the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who is reminded of the signs of his Lord, then turns away from them? We shall take vengeance upon the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who is reminded of the revelations of his Lord, then turneth from them. Lo! We shall requite the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than someone who, when revelations of his Lord are recited to him, turns away from them? We shall inflict retribution on the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who is reminded of His signs, then he turneth aside therefrom? Verily unto the culprits We are going to be Avenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who is reminded of his Lord’s signs, whereat he disregards them? Indeed, We shall take vengeance upon the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than one to whom are recited the Signs of his Lord, and who then turns away therefrom? Verily from those who transgress We shall exact (due) Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who is reminded of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of his Lord, then he turns aside therefrom? Verily, We shall exact retribution from the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more wicked than he who, when reminded of the verses of his Lord turns away from them? We take revenge on the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wrong than he, who, when reminded of his Lord’s revelations, turns away from them? We will certainly wreak vengeance upon the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:22] And who does greater wrong than he who is reminded of the signs of his Lord, [such as] the Qur’ān, but then turns away from them?, in other words, none does greater wrong than such [a person]. Assuredly We shall take vengeance upon the criminals, the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَنْ أَظْلَمُ مِمَّنْ ذُكِّرَ بِآَيَاتِ رَبِّهِ ثُمَّ أَعْرَضَ عَنْهَا إِنَّا مِنَ الْمُجْرِمِينَ مُنْتَقِمُونَ (22)عطف على جملة { إنما يؤمن بآياتنا الذين إذا ذُكِّروا بها } \\[ السجدة : 15 \\] إلى آخرها حيث اقتضت أن الذين قالوا : { أإذا ضللنا في الأرض إنا لفي خلق جديد } \\[ السجدة : 10 \\] ليسوا كأولئك فانتُقل إلى الإخبار عنهم بأنهم أشد الناس ظلماً لأنهم يُذَكِّرون بآيات الله حين يتلى عليهم القرآن فيعرضون عن تدبرها ويَلْغون فيها ، فآيات الله مراد بها القرآن .وجيء في عطف جملة { أعرضَ } بحرف { ثم } لقصد الدلالة على تراخي رتبة الإعراض عن الآيات بعد التذكير بها تراخي استبعاد وتعجيب من حالهم كقول جعفر بن علبة الحارثي :لا يكشف الغماء إلا ابنُ حرة ... يرى غمراتتِ الموت ثُم يزورهاأي : عجيب إقدامه على مواقع الهلاك بعد مشاهدة غمرات الموت تغمر الذين أقدموا على تلك المواقع .و { مَن } للاستفهام الإنكاري كقوله { ومن أظلم ممن مَنَع مساجدَ الله أن يذكر فيها اسمه } \\[ البقرة : 114 \\] أي : لا أظلم منه ، أي لا أحَد أظلم منه لأنه ظلَم نفسه بحرمانها من التأمل فيما فيه نفعه ، وظلَم الآيات بتعطيل نفعها في بعضضِ مَن أريد انتفاعهم بها ، وظَلَم الرسول عليه الصلاة والسلام بتكذيبه والإعراض عنه ، وظَلَم حق ربه إذ لم يمتثل ما أراد منه .وجملة { إنا من المجرمين منتقمون } مستأنفة استئنافاً بيانياً ناشئاً عن تفظيع ظلم الذي ذُكِّر بآيات ربِّه فأعرض عنها لأن السامع يترقب جزاء ذلك الظالم . والمراد بالمجرمين هؤلاء الظالمون ، عدل عن ذكر ضميرهم لزيادة تسجيل فظاعة حالهم بأنهم مجرمون مَع أنهم ظالمون ، وقد يقال : إن المجرمين أعم من الظالمين فيكون دخولهم في الانتقام من المجرمين أحروِيّاً وتصير جملة { إنا من المجرمين منتقمون } تذييلاً .\n\n",
      "translations": [
        {
          "translation": "(And who doth greater wrong) no one is more insolent and iniquitous (than he who is reminded of) admonished by (the revelations of his Lord) this was revealed about the hypocrites and the deriders of the Qur'an, (then turneth from them) in denial. (Lo! We shall requite) We will chastise (the guilty) the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ } على الله\n وأسوأ أدباً معه سبحانه { مِمَّن ذُكِّرَ } ووُعظ { بِآيَاتِ رَبِّهِ } ليهتدي بها إلى الإيمان والتوحيد\n ويمتثل بمقتضاها\n ليتخلص عن الكفر والشرك { ثُمَّ } بعدما سمعها { أَعْرَضَ عَنْهَآ } فجأة بلا تفكر وتأمل في معناها\n وأنكر على مقتضاها\n واستكبر على ما أنزل الله إليه\n فكذبه ونسب إليه ما لا يليق بشأنه\n وأصر على ما هو عليه عناداً ومكابرةً { إِنَّا } من مقام قهرنا وجلالنا { مِنَ ٱلْمُجْرِمِينَ مُنتَقِمُونَ } [السجدة: 22] أي: قل لهم يا أكمل الرسل نيابةً عنَّا بعدما بالغوا في الإنكار والإصرار: إنَّا منتقمون منهم على أبلغ وجه وأشده من عموم المجرمين الظالمين\n فكيف من هو أجرم وأظلم منهم\n وأصر على البغي والعناد؟! فننتقم عنهم\n ونخلدهم في عذاب النار\n إذ لا عذاب أسوأ منه وأشد\n أعاذنا الله وجميع عباده منها\n\n\n{ وَ } لا تظنن يا أكمل الرسل أنَّا لم ننجز وعدنا الذي وعدنا معك في كتابك من أنَّا ننتقم من أهل الشرك والكفر والإصرار على أبلغ وجه وآكده\n بل لك أن تتيقن وتذعن عن إنجاز وعدنا إياك مثلما أنجزنا مواعيدنا مع أخيك موسى الكليم\n إذ { لَقَدْ آتَيْنَا } من مقام جودننا أخاك { مُوسَى ٱلْكِتَابَ } أي: التوراة مثلما آتيناك الفرقان\n ووعدنا فيه معه مثلما وعدنا معك في كتابك هذا من انتقام أهل الفساد والعناد\n بل وعدنا هذا الوعد مع كل نبي ورسول آتيناه الكتاب والصحف { فَلاَ تَكُن } أنت أيضاً يا أكمل الرسل { فِي مِرْيَةٍ } أي: شك وارتياب { مِّن لِّقَآئِهِ } أي: إنجاز هذا الموعود وإتيانه على الوجه الذي وعدناه في التوراة { وَ } كيف ترتاب في وعدنا هذا مع أنَّا قد { جَعَلْنَاهُ } أي: التوراة { هُدًى لِّبَنِيۤ إِسْرَائِيلَ } [السجدة: 23] يهتدون به إلى المعالم الدينية\n والمعارف اليقينية\n والحقائق العليَّة\n والمكتشفات السنيَّة؟!\n\n\n{ وَ } كيف لا وهم من خواص عبادنا وخلَّصهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن أظلم } أي: لا أحد أظلم { ممن ذُكِّر } أي: وُعظ { بآياتِ ربه } القرآن\n { ثم أعرض عنها } اي: تولى عنها\n ولم يتدبر في معناها\n و \" ثم \" للاستبعاد فإن الإعراض عن مثل هذه في ظهورها\n وإنارتها\n وإرشادها إلى سواء السبيل\n والفوز بالسعادة العظمى\n بعد التذكر بها\n مُسْتَبْعَدٌ في العقل\n كما تقول لصاحبك: وجدت تلك الفرصة ثم لم تنتهِزْها - استبعاداً لتركه الانتهاز\n { إنا من المجرمين منتقمون } \n ولم يقل: \" منه \" \n تسجيلاً عليه بإعراضه بالإجرام\n ولأنه إذا جعله أظلم مِنْ كل ظالم\n ثم توعد المجرمين\n عامة\n بالانتقام\n دلّ على إصابة الأظلم أوفَرُ نصيب الانتقام\n ولو قال بالضمير لم يفد هذه الفائدة\n الإشارة: ولنذيقن أهل الغفلة والحجاب\n من العذاب الأدنى\n وهو الحرص والطمع والجزع والهلع\n قبل العذاب الأكبر\n وهو غم الحاجب وسوء الحساب\n قال القشيري: قومٌ: الأدنى لهم: مِحَنُ الدُنيا\n والأكبر: عقوبة العُقبى\n وقومٌ: الأدنى لهم: فترةٌ تُداخلهم في عبادتهم والأكبر: قسوةٌ تُصيبهم في قلوبهم\n وقومٌ: الأدنى لهم: وقفة مع سلوكهم تمسهم\n والأكبرُ: حَجْبَةٌ عن مشاهدتهم بسرهم - قلت: الأول في حق العوام\n والثاني: في حق الخواص\n وهم العباد والزهاد\n والثالث: في حق أهل التربية من الواصلين - ثم قال: ويقال: الأدنى: الخذلان في الزلة\n والأكبر: الهجران في الوصلة\n ويقال: الأدنى: تكدّرُ مَشَارِبِهم\n بعد صفوها\n والأكبر: تَطَاوُلُ أيامِ الحَجْب\n من غير تبيين آخرها\n وأنشدوا:\nهـ\n ببعض المعنى\n أذقناهم ذلك لعلهم يرجعون إلى الله\n في الدنيا بالتوبة واليقظة\n فإن جاء من يُذكِّرهم بالله من الداعين إلى الله\n ثم أعرضوا عنه\n فلا أحد أظلم منهم\n ولا أعظم جُرماً\n إنا من المجرمين منتقمون\n ولما قرر الأصول الثلاثة\n الرسالة\n وبدء الخلق\n والمعاد\n عاد إلى الأصل الذي بدأ به وهو الرسالة\n فقال: { وَلَقَدْ آتَيْنَا مُوسَى ٱلْكِتَابَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:47",
      "similarity": 0.7132515443298965
    },
    {
      "verse": "15:79",
      "similarity": 0.6900117011046145
    },
    {
      "verse": "85:8",
      "similarity": 0.6311277134213639
    },
    {
      "verse": "43:25",
      "similarity": 0.5952933949865309
    },
    {
      "verse": "39:37",
      "similarity": 0.5951161812560772
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}