{
  "chapter": "السجدة",
  "text": "ام يقولون افترىه بل هو الحق من ربك لتنذر قوما ما اتىهم من نذير من قبلك لعلهم يهتدون",
  "translations": [
    {
      "translation": "Or do they say, 'He has invented it'? No indeed! It is the truth from your Lord to warn a people to whom, before you, no warner came, so that hopefully they will be guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say he has fabricated it? In fact, it is the truth from your Lord so that you may warn the people to whom no admonisher was sent before you. They may haply come to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: “He has fabricated it?” Nay, it is the Truth from your Lord so that you may warn a people to whom no warner came before you; perhaps they will be guided to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say that he, (Muhammad), has invented it? No, it is the truth from your Lord so that you will warn the people who have not received a warning before you. Perhaps they will seek guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! They dare say that, “He has fabricated it”? In fact it is the Truth from your Lord, in order that you warn a nation towards whom no Herald of Warning came before you, in the hope of their attaining guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: \"He has fabricated it\" Nay, it is the truth from your Lord, so that you may warn a people to whom no warner has come before you, in order that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: He has forged it? Nay! it is the truth from your Lord that you may warn a people to whom no warner has come before you, that they may follow the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, 'He has forged it'? Say: 'Not so; it is the truth from thy Lord that thou mayest warn a people to whom no warner came before thee, that haply so they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: He hath invented it? Nay, but it is the Truth from thy Lord, that thou mayst warn a folk to whom no warner came before thee, that haply they may walk aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say, \"He has invented it himself.\"? No indeed! It is the truth from your Lord to warn a people to whom, before you, no warner came, so that hopefully they may be rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they say: he hath fabricated it? Aye! it is the truth from thy Lord, that thou mayest warn therewith a people unto whom no warner came before thee, that haply they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they say, ‘He has fabricated it.’ No, it is the truth from your Lord, that you may warn a people to whom there did not come any warner before you, so that they may be guided [to the right path].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He has forged it\"? Nay, it is the Truth from thy Lord, that thou mayest admonish a people to whom no warner has come before thee: in order that they may receive guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: \"He (Muhammad SAW) has fabricated it?\" Nay, it is the truth from your Lord, that you may warn a people to whom no warner has come before you (O Muhammad SAW), in order that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: 'He has forged it himself' Say: 'No, it is the truth from your Lord so that you can warn a nation to whom none has warned before you, in order that they are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they say, “He made it up.” In fact, it is the Truth from your Lord, to warn a people who received no warner before you, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He invented it\"? Rather, it is the truth from your Lord, [O Muhammad], that you may warn a people to whom no warner has come before you [so] perhaps they will be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:3]   Or do they say, ‘He, Muhammad (s), has invented it’? Nay, but it is the truth from your Lord, that you may warn, thereby, a people to whom no warner came before you (mā is for negation) that perhaps they may find [right] guidance, by your warning.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ يَقُولُونَ افْتَرَاهُ بَلْ هُوَ الْحَقُّ مِنْ رَبِّكَ لِتُنْذِرَ قَوْمًا مَا أَتَاهُمْ مِنْ نَذِيرٍ مِنْ قَبْلِكَ لَعَلَّهُمْ يَهْتَدُونَ (3)جاءت { أَمْ } للإضراب عن الكلام السابق إضرابَ انتقال ، وهي { أَمْ } المنقطعة التي بمعنى بل التي للإضراب . وحيثما وقعت { أمْ } فهي مؤذنة باستفهام بالهمزة بعدها الملتزم حذفها بعد { أمْ . } والاستفهام المقدر بعدها هنا تعجيبي لأنهم قالوا هذا القول الشنيع وعُلِّمه الناس عنهم فلا جرم كانوا أحقَّاء بالتعجيب من حالهم ومقالهم لأنهم أبدوا به أمراً غريباً يُقضى منه العجب لدى العقلاء ذوي الأحلام الراجحة والنفوس المنصفة ، إذ دلائل انتفاء الريب عن كونه من رب العالمين واضحة بَله الجزم بأنه مفترى على الله تعالى .وصيغ الخبر عن قولهم العجيب بصيغة المضارع لاستحضار حالة ذلك القول تحقيقاً للتعجيب منه حتى لا تغفل عن حال قولهم أذهانُ السامعين كلفظ ( تقول ) في بيت هُذْلول العنبري من شعراء الحماسة :تقول وصكّت صدرَها بيمينها ... أبعلي هذا بالرَّحَى المتقاعسُوفي المضارع مع ذلك إيذان بتجدد مقالتهم هذه وأنهم لا يقلعون عنها على الرغم مما جاءهم من البينات رغم افتضاحهم بالعجز عن معارضته .والضمير المرفوع في { افتراه } عائد إلى النبي صلى الله عليه وسلم لأنه معلوم من مقام حكاية مقالهم المشتهر بين الناس ، والضمير المنصوب عائد إلى { الكتاب } \\[ السجدة : 2 \\] . وأضرب على قولهم { افتراه } إضراب إبطال ب { بل هو الحق من ربك } لإثبات أن القرآن حق ، ومعنى الحق : الصدق ، أي : فيما اشتمل عليه الذي منه أنه منزَّل من الله تعالى . وتعريف { الحق } تعريف الجنس المفيد تحقيق الجنسية فيه . أي : هو حق ذلك الحق المعروفة ماهيته من بين الأجناس والمفارق لجنس الباطل . وفي تعريف المسند بلام الجنس ذريعة إلى اعتبار كمال هذا الجنس في المسند إليه وهو معنى القصر الادعائي للمبالغة نحو : أنت الحبيب وعمرو الفارس .و { من ربك } في موضع حال من { الحق ، } والحق الوارد من قِبل الله لا جرم أنه أكمل جنس الحق . وكاف الخطاب للنبيء صلى الله عليه وسلم واستحضرت الذات العلية هنا بعنوان { ربك } لأن الكلام جاء رداً على قولهم { افتراه ، } يعنون النبي صلى الله عليه وسلم فكان مقام الرد مقتضياً تأييد من ألصقوا به ما هو بريء منه بإثبات أن الكتاب حق من ربِّ من ألصقوا به الافتراء تنويهاً بشأن الرسول عليه الصلاة والسلام وتخلصاً إلى تصديقه لأنه إذا كان الكتاب الذي جاء به حقاً من عند الله فهو رسول الله حقاً .وقد جاءت هذه الآية على أسلوب بديع الإحكام إذ ثبت أن الكتاب تنزيل من رب جميع الكائنات ، وأنه يحق أن لا يرتاب فيه مرتاب ، ثم انتقل إلى الإنكار والتعجيب من الذين جزموا بأن الجائي به مفتر على الله ، ثم رد عليهم بإثبات أنه الحق الكامل من ربِّ الذي نَسبوا إليه افتراءه فلو كان افتراه لقدر الله على إظهار أمره كما قال تعالى :{ ولو تقوَّل علينا بعض الأقاويل لأخذنا منه باليمين ثم لَقَطعْنَا منه الوَتِين فما منكم من أحد عنه حاجزين } \\[ الحاقة : 44 47 \\] . ثم جاء بما هو أنكى للمكذبين وأبلغ في تسفيه أحلامهم وأوغل في النداء على إهمالهم النظر في دقائق المعاني ، فبين ما فيه تذكرة لهم ببعض المصالح التي جاء لأجلها هذا الكتاب بقوله : { لتُنْذِر قوماً ما أتاهم من نذير من قبلك لعلهم يهتدون } فقد جمعوا من الجهالة ما هو ضِغْث على إبَّالَة ، فإن هذا الكتاب ، على أن حقيته مقتضية المنافسة في الانتفاع به ولو لم يُلفَتُوا إلى تقلده وعلى أنهم دعوا إلى الأخذ به وذلك مما يوجب التأمل في حقّيته؛ على ذلك كلِّه فهم كانوا أحوج إلى اتباعه من اليهود والنصارى والمجوس لأن هؤلاء لم تسبق لهم رسالة مرسل فكانوا أبعد عن طرق الهدى بما تعاقب عليهم من القرون دون دعوة رسول فكان ذلك كافياً في حرصهم على التمسك به وشعورهم بمزيد الحاجة إليه رجاء منهم أن يهتدوا ، قال تعالى : { وهذا كتاب أنزلناه مبارك فاتّبعوه واتقوا لعلكم ترحمون أن تقولوا إنما أنزل الكتاب على طائفتين مِن قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنّا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذّب بآيات الله وصدَف عنها } \\[ الأنعام : 155 157 \\] ، فمثَل هؤلاء المكذبين كمَثل قول المعري :هل تَزجرنَّكُمُ رِسالةُ مرسَل ... أم ليس ينفع في أُولاَك ألُوكُوالقوم : الجماعة العظيمة الذين يجمعهم أمر هو كالقِوام لهم من نسب أو موطن أو غرض تجمعوا بسببه . وأكثر إطلاقه على الجماعة الذين يرجعون في النسب إلى جَدّ اختصوا بالانتساب إليه . وتميزوا بذلك عمن يشاركهم في جدّ هو أعلى منه ، فقُريش مثلاً قومٌ اختصوا بالانتساب إلى فِهر بن مالك بن النضر بن كنانة فتميزوا عمن عداهم من عقب كنانة فيقال : فلان قرشي وفلان كناني ولا يقال لمن هو من أبناء قريش كناني .ووصف القوم بأنهم { ما أتاهم من نذير } قبلَ النبي صلى الله عليه وسلم والنبي حينئذ يدعو أهل مكة ومن حولها إلى الإسلام وربما كانت الدعوة شملت أهل يثرب وكلّهم من العرب فظهر أن المراد بالقوم العرب الذين لم يأتهم رسول قَبْل محمد عليه الصلاة والسلام فإما أن يكون المراد قريشاً خاصة ، أو عرب الحجاز أهلَ مكة والمدينة وقبائل الحجاز ، وعرب الحجاز جذمان : عدنانيون وقحْطانيون؛ فأما العدنانيون فهم أبناء عدنان وهم من ذرية إسماعيل وإنما تقومت قوميتهم في أبناء عدنان : وهم مُضَرٌ وربيعةٌ وأنمار ، وإيادٌ . وهؤلاء لم يأتهم رسول منذ تقومت قوميتهم . وأما جدهم إسماعيل بن إبراهيم عليهما السلام فإنه وإن كان رسولاً نبيئاً كما وصفه الله تعالى في سورة مريم ، فإنما كانت رسالته خاصة بأهله وأصهاره من جُرهُم ولم يكن مرسلاً إلى الذين وجُدوا بعده لأن رسالته لم تكن دائمة ولا منتشرة ، قال تعالى :{ وكان يأمر أهلَه بالصلاة والزكاة } \\[ مريم : 55 \\] .وأما القحطانيون القاطنون بالحجاز مثل الأوس والخزرج وطيْء فإنهم قد تغيرت فرقهم ومواطنهم بعد سَيْل العَرم وانقسموا أقواماً جُدداً ولم يأتهم نذير منذ ذلك الزمن وإن كان المنذِرون قد جاءوا أسلافَهم مثلُ هود وصالح وتُبع ، فذلك كان قبل تقوُّم قوميتهم الجديدة .وإما أن يكون المراد العرَب كلَّهم بما يشمل أهل اليمن واليمامة والبحرين وغيرهم ممن شملتهم جزيرة العرب وكلّهم لا يعْدون أن يرجعوا إلى ذيْنك الجِذمين ، وقد كان انقسامهم أقواماً ومواطن بعد سَيل العَرم ولم يأتهم نذير بعد ذلك الانقسام كما تقدم في حال القحطانيين من أهل الحجاز . وأما ما ورد من ذكر حنظلة بن صَفوان صاحب أهل الرَّسّ ، وخالد بن سِنان صاحب بني عَبْس فلم يثبت أنهما رسولان واختُلف في نبوّتهما . وقد روي أن ابنة خالد بن سنان وفدت إلى النبي صلى الله عليه وسلم وهي عجوز وأنه قال لها : « مرحباً بابنة نبيء ضَيَّعه قومُه » . وليس لذلك سند صحيح . وأيَّاً مَّا كان فالعرب كلهم أو الذين شملتهم دعوة الإسلام يومئذ يحق عليهم وصف { ما أتاهم من نذير } من وقت تحقق قوميتهم .والمقصود به : تذكيرهم بأنهم أحوج الأقوام إلى نذير ، إذ لم يكونوا على بقية من هُدى وأثارةُ هِمَمهم لاغتباط أهل الكتاب ليتقبلوا الكتاب الذي أنزل إليهم ويسبقوا أهل الكتاب إلى اتّباعه؛ فيكون للمؤمنين منه السبْق في الشرع الأخير كما كان لمن لم يُسلم من أهل الكتاب السبق ببعض الاهتداء وممارسة الكتاب السابق . وقد اهتم بعض أهل الأحلام من العَرب بتطلب الدين الحق فتهوّد كثير من عرب اليمن ، وتنصّرتْ طيء وكَلْب وتغلب وغيرهم من نصارى العرب ، وتتبع الحنيفية نفر مثل قُسّ بن ساعدة ، وزيد بن عمرو بن نُفيل ، وأمية بن أبي الصلت ، وكان ذلك تطلباً للكمال ولم يأتهم رسول بذلك .وهذا التعليل لا يقتضي اقتصار الرسالة الإسلامية على هؤلاء القوم ولا ينافي عموم الرسالة لمن أتاهم نذير ، لأن لام العلة لا تقتضي إلا كون ما بعدها باعثاً على وقوع الفعل الذي تعلقت به دون انحصار باعثثِ الفعل في تلك العلة ، فإن الفعل الواحد قد تكون له بواعث كثيرة ، وأفعال الله تعالى منوطة بحكم عديدة ، ودلائلُ عموم الرسالة متواترة من صريح القرآن والسنّة ومن عموم الدعوة .وقيل : أُريد بالقوم الذين لم يأتهم نذير من قبلُ جميعُ الأمم ، وأن المراد بأنهم لم يأتهم نذير أنهم كلَّهم لم يأتهم نذير بعد أن ضلّوا ، سواء منهم من ضلّ في شرعه مثل أهل الكتاب ، ومن ضلّ بالخلو عن شرع كالعَرب . وهذا الوجه بعيد عن لفظ ( قوم ) وعن فعل { أتاهم } ومفيتٌ للمقصود من هذا الوصف كما قدمناه . وأما قضية عموم الدعوة المحمدية فدلائلها كثيرة من غير هذه الآية . و ( لعلّ ) مستعارة تمثيلاً لإرادة اهتدائهم والحرص على حصوله .\n\n",
      "translations": [
        {
          "translation": "468 Or say they) the disbelievers of Mecca say: (He hath invented it) Muhammad invented the Qur'an? (Nay, but it) i.e. the Qur'an (is the Truth from thy Lord) Gabriel brought down to you, (that thou mayst warn a folk) i.e. the Quraysh (to whom no warner came before you) no warning messenger came to them before you, Muhammad, (that haply they may walk aright) that they may be guided from error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب قال عن أبي خالد عن الإِمام زيد بن علي عليهما السلام [في قوله تعالى]: { أَمْ يَقُولُونَ ٱفْتَرَاهُ } معناه أم يَقُولونَ اختَلَقَهُ مِن قَِبْلِ نَفسِهِ\n\n",
      "translations": [
        {
          "translation": "\n\nWe were informed by Abu Jafar\n\n\nHe said: Ali ibn Ahmad narrated to us\n\n\nImam Zaid ibn Ali said, regarding the verse {Do they say He has fabricated it?}, that it means \"Do they say that He created it from before Himself?\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ يَقُولُونَ ٱفْتَرَاهُ } واختلقه من تلقاء نفسه\n ونسبه إلى الله افتراءً ومراءً\n تغريراً وتلبيساً\n لا تحزن يا أكمل الرسل عليهم\n ولا تلتفت إلى قولهم هذا { بَلْ هُوَ ٱلْحَقُّ } الثابت المحقق\n المثبت نزوله { مِن رَّبِّكَ } الذي رباك بأنواع الكرم\n واصطفاك من بين البرايا لرسالته العامة\n أنزله إليه مشتملاً على الإنذارات الشديدة\n والتخويفات البليغة { لِتُنذِرَ } بوعيداته { قَوْماً } انقطع عنهم آثار النبوة والرسالة\n لبعد العهد أو { مَّآ أَتَاهُم } بعد عيسى - صلوات الله عليه وسلامه - { مِّن نَّذِيرٍ } أنذرهم عن الباطل وأرشدهم إلى طريق الحق { مِّن قَبْلِكَ } بل هم على فترة من ارسل فارسلك إليهم { لَعَلَّهُمْ يَهْتَدُونَ } [السجدة: 3] بهدايتك وإرشادك إلى توحيد الحق\n واتصافه بأوصاف الكمال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم يقولون افتراه } \n أي: اختلقه محمد من عنده\n وهو إنكار لقولهم\n وتعجيب منه لظهور أمره في عجزهم عن الإتيان بسورة منه\n قال تعالى: { بل هو الحقُّ } الثابت { من ربك } \n ولم تفتره\n كما زعموا تعنتاً وجهلاً\n أنزله عليك { لتُنذر قوماً } أي: العرب\n { ما أتاهم من نذير من قَبلك } \n بل طالت عليهم الفترة من زمن إسماعيل وعيسى - عليهما السلام - { لعلهم يهتدون } إلى الصواب من الدين\n والترجي مصروفٌ إلى رسول الله صلى الله عليه وسلم\n كما كان\n[طه: 44] مصروفاً إلى موسى وهارون\n الإشارة: الۤـم الألف: أَلِفَ المحبون قُربى\n فلا يصبرون عني\n اللام: لمع نوري لقلوب السائرين\n فزاد شوقهم إليّ\n الميم: مَلَك الواصلون ملكي وملكوتي\n فلا يغيبون عني\n تنزيل الكتاب\n إذا طال أمد لقاء الأحباب\n فأعزّ شيء على المحبين كتاب الأحباب\n أنزلت على أحبابي كتابي\n وحَمَلتْ إليهم بالرسل خطابي\n ولا عليهم إن قرع أسماعَهم عتابي\n فإنهم مني في أمان من عذابي\n { أم يقولون افتراه } \n إنكار الأعداء على المحبين سُنَّة لازمة\n فإن أُلبِسَ الحق على الأعداء فلا يضركم\n ولا عليكم\n فإنَّ صحبة الحبيب للحبيب أَلَدُّ ما تكون عند فقد الرقيب\n قاله القشيري\n ثم ذكر المقصود بالذات وهو الاستدلال على البعث\n فقال: { ٱللَّهُ ٱلَّذِي خَلَقَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:8",
      "similarity": 0.504745660630356
    },
    {
      "verse": "61:7",
      "similarity": 0.4129752401065047
    },
    {
      "verse": "16:101",
      "similarity": 0.39539056007578555
    },
    {
      "verse": "52:33",
      "similarity": 0.38448571521448976
    },
    {
      "verse": "16:105",
      "similarity": 0.3840563665872011
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}