{
  "chapter": "السجدة",
  "text": "الله الذى خلق السموت والارض وما بينهما فى ستة ايام ثم استوى على العرش ما لكم من دونه من ولى ولا شفيع افلا تتذكرون",
  "translations": [
    {
      "translation": "Allah is He who created the heavens and the earth and everything between them in six days and then established Himself firmly upon the Throne. You have no protector or intercessor apart from Him. So will you not pay heed?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created the heavens and the earth and all that lies between them, in six spans, then assumed all authority. You have no protector other than Him, nor any intercessor. Will you not be warned even then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created the heavens and the earth and all that is between the two, in six days, and then He established Himself on the Throne. You have no guardian or intercessor other than He. Will you, then, not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the one who created the heavens and the earth and all that is between them in six days, then He established His dominion over the Throne. No one besides Him is your guardian or intercessor. Will you then not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created the heavens and the earth, and all what is between them, in six days, then (befitting His Majesty) established Himself over the Throne (of control); leaving Allah, there is neither a friend nor an intercessor for you; so do you not ponder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is He Who has created the heavens and the earth, and all that is between them in six Days. Then He Istawa over the Throne. You have none, besides Him, as a protector or an intercessor. Will you not then remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created the heavens and the earth and what is between them in six periods, and He mounted the throne (of authority); you have not besides Him any guardian or any intercessor, will you not then mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He that created the heavens and the earth, and what between them is, in six days, then seated Himself upon the Throne. Apart from Him, you have no protector neither mediator; will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who created the heavens and the earth, and that which is between them, in six Days. Then He mounted the Throne. Ye have not, beside Him, a protecting friend or mediator. Will ye not then remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was God who created the heavens and the earth and whatsoever is in between in six Days, and then He established Himself on the throne. You have no patron nor any intercessor besides Him. So will you not pay heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who created the heavens and the earth and whatsoever is betwixt the twain in six days, and then He established Himself on the throne. No patron have ye nor an intercessor, besides Him. Will ye not then be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who created the heavens and the earth and whatever is between them in six days, then He settled on the Throne. You do not have besides Him any guardian or intercessor. Will you not then take admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has created the heavens and the earth, and all between them, in six Days, and is firmly established on the Throne (of Authority): ye have none, besides Him, to protect or intercede (for you): will ye not then receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is He Who has created the heavens and the earth, and all that is between them in six Days. Then He Istawa (rose over) the Throne (in a manner that suits His Majesty). You (mankind) have none, besides Him, as a Wali (protector or helper etc.) or an intercessor. Will you not then remember (or be admonished)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was Allah, who, in six days created the heavens and the earth and all that is between them, and then willed to the Throne. You have no guardian nor intercessor other than Him. Will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He who created the heavens and the earth and everything between them in six days, and then established Himself on the Throne. Apart from Him, you have no master and no intercessor. Will you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who created the heavens and the earth and whatever is between them in six days; then He established Himself above the Throne. You have not besides Him any protector or any intercessor; so will you not be reminded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:4] God is He Who created the heavens and the earth and whatever is between them in six days, the first of which was Sunday and the last of which was Friday, then He presided upon the Throne (al-‘arsh in the [classical Arabic] idiom denotes the seat of a king), a presiding worthy of Him. You do not have, O disbelievers of Mecca, besides Him, in other words, other than Him, any protector (min waliyyin is the subject of the particle mā with the min added [extra]) in other words, [any] helper, or intercessor, to ward off His chastisement from you. Will you not then remember?, this and become believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah it is Who created the heavens and the earth, and that which is between them) of creation and marvels, (in six Days) the days of the beginning of creation which equal 1,000 years of the years of the life of this world; the first day being Sunday and the last Friday. (Then He mounted the throne) Allah was on the Throne before He created them. (Ye have not) people of Mecca, (beside Him, a protecting friend) a relative to help you (or mediator) to intercede for you in order for you to forgo Allah's punishment. (Will ye not then remember) will you then not take admonition through the Qur'an and accept faith?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يوحدون ولا يؤمنون بتوحيده وأسمائه وصفاته { ٱللَّهُ } وأوجد بقدرته الكاملة { ٱلسَّمَٰوَٰتِ } أي: العلويات { وَٱلأَرْضَ } أي: السفليات { وَمَا بَيْنَهُمَا } أي: الممتزجات { فِي سِتَّةِ أَيَّامٍ } وساعات منبسطة في الأقطار والجهات الست { ثُمَّ } الواحد الأحد\n الفرد الصمد { ٱلَّذِي خَلَقَ } بعدما تم التمهيد والبسط { ٱسْتَوَىٰ } واستولى\n وتمكن سبحانه { عَلَى ٱلْعَرْشِ } أي: انبسط على عروش عموم ما ظهر وبطن من الآفاق والأنفس بالاستقلال التام\n والتصرف العام على صرافة وحدته الذاتية بلا شائبة شركة وطرق كثرة\n لذلك { مَا لَكُمْ } أيها الأظلال المنعكسة من شمس ذاته { مِّن دُونِهِ } سبحانه { مِن وَلِيٍّ } يولي أموركم ويتصرف فيكم { وَلاَ شَفِيعٍ } ينصركم\n ويعاون عليكم سواه سبحانه { أَ } تشكَّون وتترددون في توحيده وولايته سبحانه أيها المنهمكون في الغفلة والضلال { فَلاَ تَتَذَكَّرُونَ } [السجدة: 4] وتتعظون بمواعظه وتذكيراته مع أنه كررها مراراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { اللهُ الذي خلق السماوات والأرضَ وما بينهما في } مقدار { ستةِ أيام ثم استوى على العرش } أي: استولى بقهرية ذاته\n وسئل مالك عنه\n فقال: الاستواء معلوم\n والكيفية مجهولة\n والسؤال عن هذا بدعة\n هـ\n ولم تتكلم الصحابة على الاستواء\n بل أمسكوا عنه\n ولذلك قال مالك: السؤال عنه بدعة\n وسيأتي شيء في الإشارة\n { ما لكم من دونه } من دون الله { من وليٍّ ولا شفيعٍ } أي: إذا جاوزتم رضاه لم تجدوا لأنفسكم ولياً\n أي: ناصراً ينصركم\n ولا شفيعاً يشفع لكم\n { أفلا تتذكرون } تتعظون بمواعظ الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:3",
      "similarity": 0.8777066400484137
    },
    {
      "verse": "25:59",
      "similarity": 0.808915105096803
    },
    {
      "verse": "11:7",
      "similarity": 0.6484372411893019
    },
    {
      "verse": "57:4",
      "similarity": 0.5080785739886623
    },
    {
      "verse": "58:4",
      "similarity": 0.3690654409106627
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/32:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/32:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/32:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}