{
  "chapter": "السجدة",
  "text": "يدبر الامر من السماء الى الارض ثم يعرج اليه فى يوم كان مقداره الف سنة مما تعدون",
  "translations": [
    {
      "translation": "He regulates all affairs from high to low, then they rise to perfection step by step in a (heavenly) day whose measure is a thousand years of your reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He governs from the heaven to the earth and then the record (of this governance) goes up to Him in a day whose measure is a thousand years in your reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends the regulation of the affair from the heavens to the earth, then on the day which is equal to one thousand years of yours, it will ascend to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He plans (all) the job(s) from the heaven to the earth – then it will return to Him on the Day which amounts to a thousand years in your count.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He directs the command from the heavens to the earth; then it will go up to Him, in one Day, the space whereof is a thousand years of your reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He regulates the affair from the heaven to the earth; then shall it ascend to Him in a day the measure of which is a thousand years of what you count.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He directs the affair from heaven to earth, then it goes up to Him in one day, whose measure is a thousand years of your counting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He directeth the ordinance from the heaven unto the earth; then it ascendeth unto Him in a Day, whereof the measure is a thousand years of that ye reckon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He directs all affairs from heaven to earth. Then all will again ascend to Him on a Day whose length is a thousand years by the way you measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He disposeth every affair from the heaven unto the earth; thereafter it shall ascend unto Him in a Day the measure whereof is one thousand years of that which ye compute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He directs the command from the heaven to the earth; then it ascends toward Him in a day whose span is a thousand years by your reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He rules (all) affairs from the heavens to the earth: in the end will (all affairs) go up to Him, on a Day, the space whereof will be (as) a thousand years of your reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He arranges (every) affair from the heavens to the earth, then it (affair) will go up to Him, in one Day, the space whereof is a thousand years of your reckoning (i.e. reckoning of our present world's time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He directs the affair from heaven to earth. Then it will ascend to Him in one day, a day whose value is a thousand years by your reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He regulates all affairs, from the heavens, to the earth. Then it ascends to Him on a Day the length of which is a thousand years by your count.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:5] He directs the command from the heaven to the earth, for the duration of this world, then it ascends, then the command and the direction [thereof] returns, to Him in a day whose measure is a thousand years by your reckoning, in this world. In sūrat sa’ala, [An asker] asked [the measure is said to be]: ‘fifty thousand years’ [Q. 70:4] — and this [day] is the Day of Resurrection, [reckoned so] because of the severity of its terrors for the disbeliever. As for the believer, however, for him it will be easier than performing any one of [his] obligatory prayers in this world — as is stated in hadīth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He directeth the ordinance from the heaven unto the earth) He sends the angels with revelation, Scriptures and misfortunes; (then it ascendeth unto Him) the angels ascend to Him (in a Day, whereof the measure) the measure of its ascent for other than the angels (is a thousand years of that you reckon) of the years of the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ يَعْرُجُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ } معناه تَعرُجُ الملائكةُ إِلى السَّماءِ وتَنزِلُ في يومٍ من أيامِ الدُّنيا، وهو مَسيرةُ ألفِ سَنةٍ\n وقالَ عليه السّلامُ: السّتةُ الأَيامُ التي خَلَقَ فِيها السَّمواتِ والأَرضَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا هو الذي { يُدَبِّرُ ٱلأَمْرَ } أي: عالم الأمر المنبئ عن الإيجاد والإظهار بإنزال الملائكة الذين هم مظاهر أوصافه وأسمائه { مِنَ ٱلسَّمَآءِ } أي: سماء الأسماء المتعالية عن الأقطار والجهات مطلقاً { إِلَى ٱلأَرْضِ } أي: الطبيعة القابلة لقبول آثارها، وإنما أنزلهم وأهبطهم إليها؛ ليعد حسب حكمته المظاهر والمصنوعات؛ لقبول آثارها، وإنما أنزلهم وأهبطهم إليها؛ ليعد حسب حكمته المظاهر والمصنوعات؛ لقبول فيضان سلطان توحيده { ثُمَّ } بعدما تم على الوجه الأبدع، والنظام الأتم الأبلغ { يَعْرُجُ } ويصعد { إِلَيْهِ } سبحانه ما يترتب على عالم الأمر من المعارف والحقائق، والأسرار الكامنة في سريان الوحدة الذاتية بعد انقراض النشأة الأولى { فِي يَوْمٍ } معد لعروجه وصعوده { كَانَ مِقْدَارُهُ } أي: مقدار ذلك اليوم في الطول والامتداد { أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ } [السجدة: 5] في هذه النشأة من الأيام والأعوام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يُدبّرُ الأمرَ } أي: أمر الدنيا\n وما يكون من شؤونه تعالى في ملكه، فهو كقوله:\n\n[الرحمن:29]، أي: يُبديه لا يبتديه\n وهو إشارة إلى القضاء التفصيلي، الجزئي، لا الكلي، فإنه كان دفعة\n يكون ذلك التدبير { من السماء إلى الأرض } ، فيدبر أمر الدنيا بأسباب سماوية، نازلة آثارها إلى الأرض\n { في يوم كان مقداره ألفَ سنةٍ مما تعدُّون } من أيام الدنيا\n قال الأقليشي: جاء في حديث:\n\n \" إن بُعد ما بين السماء والأرض، وما بين سماء إلى سماء، مسيرة خمسمائة سنة \" \n\nوفي حديث آخر:\n\n \" إن بين ذلك نَيِّفاً وسبعين سنة \" \n\n، وإنما وقع الاختلاف في ذلك بالنسبة إلى سير الملائكة\n وإن سرعة بعضها أكثر من سرعة بعض\n كما يقول القائل: من موضع كذا إلى كذا مسيرة شهر للفارس وشهرين للراجل، وعليه يخرج قوله تعالى: { يُدَبِّرُ ٱلأَمْرَ مِنَ ٱلسَّمَآءِ إِلَى ٱلأَرْضِ ثُمَّ يَعْرُجُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ }\n وقال في آية أخرى:\n\n[المعارج:4]\n وهكذا الوجود مَنْ علوه إلى سفله، مِنْ الملائكة من يقطعه في مدةٍ ما، ويقطعه غيره في أكثر منها أو أقل\n هـ\n وقيل: المعنى: أنه يدبر أمر الدنيا إلى أن تقوم الساعة، ثم يعرج إليه ذلك الأمر، فيحكم فيه في يوم كان مقداره ألف سنة، أو خمسين ألف سنة\n فقد قيل: إن مواقف يوم القيامة خمسون موقفاً، كل موقف ألف سنة\n وقد حكى هذا ابن عطية، فقال: يُدبر الأمر في مدة الدنيا، ثم يعرج إليه يوم القيامة\n ويوم القيامة: مقداره ألف سنة من عَدِّنا\n وهو على الكفار قدر خمسين ألف سنة لِهوله، حسبما في سورة المعارج\n هـ\n قلت: والتحقيق، في الفرق بين الآيتين، أن الحق تعالى، حيث لم يختص بمكان دون مكان، وكانت الأمكنة في حقه تعالى كلها واحدة، وهو موجود معها وفيها بعلمه وأسرار ذاته، كان العروج إنما هو إليه على كل حال، بعدت المسافة أو قربت\n لكن لما علقَ العروج بتدبير الأمور وتنفيذها، قرّب المسافة ليعلم العبد أن القضاء نافذ فيه بسرعة\n\n\nولمَّا عَلَّقَ عروج الملائكة والروح إلى مطلق الذات المقدسة بَعَّدَ المسافة زيادة في علو شأنه ورفعة قدره\n وكل هذا العروج في دار الدنيا\n على قول من عَلَّقَ في يوم بتَعْرج في سورة المعارج\n فتأمله",
      "translations": []
    }
  ]
}