{
  "chapter": "السجدة",
  "text": "ثم سوىه ونفخ فيه من روحه وجعل لكم السمع والابصر والافـدة قليلا ما تشكرون",
  "translations": [
    {
      "translation": "then formed him and breathed His Ruh into him and gave you hearing, sight and hearts. What little thanks you show!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then proportioned and breathed into him of His spirit, and gave you the senses of hearing, sight and feeling. And yet how little are the thanks you offer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then He duly proportioned him, and breathed into him of His spirit, and bestowed upon you ears and eyes and hearts. And yet, little thanks do you give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then He gave it proper shape and blew His spirit in it. He made ears, eyes and hearts for you, but you give Him very little thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then made him proper and blew into him a spirit from Him, and bestowed ears and eyes and hearts to you; very little thanks do you offer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He fashioned him in due proportion, and breathed into him the soul; and He gave you hearing, sight and the sense of deduction. Little is the thanks you give!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He made him complete and breathed into him of His spirit, and made for you the ears and the eyes and the hearts; little is it that you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then He shaped him, and breathed His spirit in him. And He appointed for you hearing, and sight, and hearts; little thanks you show.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He fashioned him and breathed into him of His Spirit; and appointed for you hearing and sight and hearts. Small thanks give ye!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He moulded him; He breathed His Spirit into him; He gave you hearing, sight, and hearts. How seldom you are grateful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He fashioned him and breathed into him something of a spirit from Him; and He ordained for you hearing and sight and hearts. Little is the thanks ye return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He proportioned him and breathed into him of His Spirit, and made for you hearing, sight, and hearts. Little do you thank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But He fashioned him in due proportion, and breathed into him something of His spirit. And He gave you (the faculties of) hearing and sight and feeling (and understanding): little thanks do ye give!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He fashioned him in due proportion, and breathed into him the soul (created by Allah for that person), and He gave you hearing (ears), sight (eyes) and hearts. Little is the thanks you give!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He created him and (caused the angel to) breathe into him his (created) spirit. He gave you eyes and ears, and hearts, yet little do you thank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He proportioned him, and breathed into him of His Spirit. Then He gave you the hearing, and the eyesight, and the brains—but rarely do you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He proportioned him and breathed into him from His [created] soul and made for you hearing and vision and hearts; little are you grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[32:9] then He proportioned him, that is to say, He created Adam, and breathed into him of His spirit, in other words, He made him a living sensory being after having been an inanimate thing. And He made for you, in other words, for [you] his descendants, hearing, meaning, ears, and sight and hearts. Little thanks do you give (mā here is extra, emphasising the ‘littleness’ [of the thanks]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nثُمَّ سَوَّاهُ وَنَفَخَ فِيهِ مِنْ رُوحِهِ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ قَلِيلًا مَا تَشْكُرُونَ (9)والنفخ : تمثيل لسريان اللطيفة الروحانية في الكثيفة الجسدية مع سرعة الإيداع ، وقد تقدم في قوله تعالى : { فإذا سوّيته ونفخْتُ فيه من رُوحي } في سورة الحجر ( 29 ) .والانتقال من الغيبة إلى الخطاب في قوله : وجعل لكم } التفات لأن المخاطبين من أفراد الناس وجَعْل السمع والأبصار والأفئدة للناس كلهم غير خاص بالمخاطبين فلما انتهض الاستدلال على عظيم القدرة وإتقان المراد من المصنوعات المتحدث عنهم بطريق الغيبة الشامل للمخاطبين وغيرهم ناسب أن يُلتفت إلى الحاضرين بنقل الكلام إلى الخطاب لأنه آثرُ بالامتنان وأسعدُ بما يرد بعده من التعريض بالتوبيخ في قوله { قليلاً ما تشكرون } . والامتنان بقوى الحواس وقوى العقل أقوى من الامتنان بالخلق وتسويته لأن الانتفاع بالحواس والإدراك متكرر متجدد فهو محسوس بخلاف التكوين والتقويم فهو محتاج إلى النظر في آثاره .والعدول عن أن يقال : وجعلكم سامعين مبصرين عالمين إلى { جعل لكم السمع والأبصار والأفئدة } لأن ذلك أعرق في الفصاحة ، ولما تؤذن به اللام من زيادة المنة في هذا الجعل إذ كان جعلاً لفائدتهم ولأجلهم ، ولما في تعليق الأجناس من السمع والأبصار والأفئدة بفعل الجعل من الروعة والجلال في تمكن التصرف ، ولأن كلمة { الأفئدة } أجمع من كلمة عاقلين لأن الفؤاد يشمل الحواس الباطنة كلها والعقل بعضٌ منها .وأفرد { السَّمع } لأنه مصدر لا يجمع ، وجمع { الأبصار والأفئدة } باعتبار تعدد الناس . وتقديم السمع على البصر تقدّم وجهه عند قوله تعالى : { ختم الله على قلوبهم وعلى سمعهم وعلى أبصارهم غشاوة } في سورة البقرة ( 7 ) . وتقديم السمع والأبصار } على { الأفئدة } هنا عكس آية البقرة لأنه روعي هنا ترتيب حصولها في الوجود فإنه يكتسب المسموعات والمبصرات قبل اكتساب التعقل .و { قليلاً } اسم فاعل منتصب على الحال من ضمير { لكم ، } و { ما تشكرون } في تأويل مصدر وهو مرتفع على الفاعلية ب { قليلاً ، } أي : أنعم عليكم بهذه النعم الجليلة وحالكم قلة الشكر . ثم يجوز أن يكون { قليلاً } مستعملاً في حقيقته وهي كون الشيء حاصلاً ولكنه غير كثير . ويجوز أن يكون كناية عن العدم كقوله تعالى : { فلا يؤمنون إلا قليلاً } \\[ النساء : 46 \\] . وعلى الوجهين يحصل التوبيخ لأن النعم المستحقة للشكر وافرة دائمة فالتقصير في شكرها وعدمُ الشكر سواء .\n\n",
      "translations": [
        {
          "translation": "(Then He fashioned him) He gathered his creation in the womb of his mother (and breathed into him of His Spirit) He placed the spirit in him; (and appointed for you hearing) He created for you hearing so that you hear the Truth and guidance (and sight) so that you see through them the Truth and guidance (and hearts) in order to perceive the Truth and guidance. (Small thanks give you) for that which you have been given!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وثانيا من الماء المهين { سَوَّاهُ } سبحانه إظهاراً لقدرته\n أي: قوَّم وعدَّ أركانه على أحسن التقويم { وَ } بعد تسويته وتعديله { نَفَخَ فِيهِ مِن رُّوحِهِ } المضافة إلى ذاته المستجمع لجميع أوصافه وأسمائه تتميماً لرتبة خلافته ونيابته\n واستحقاقه لمرآتية الحق\n قابليته انعكاس شئونه وتطوراته ولياقته\n للتخلق بأخلاقه { وَ } بالجملة: { جَعَلَ } وهيَّأ { لَكُمُ } أيها المجبولون على فطرة المعرفة والتوحيد { ٱلسَّمْعَ } لتسمعوا بها آيات التوحيد\n ودلائل اليقين والعرفان { وَٱلأَبْصَارَ } ليشاهدوا بها آثار القدرة والإرادة الكاملة المحيطة بذرائر الأكوان { وَٱلأَفْئِدَةَ } المودعة فيكم\n لتتأملوا بها سريان الوحدة الذاتية على هياكل الأشباح الكائنة والفاسدة\n وتتفكروا بها في آلاء الله ونعمائه المتوالية المتوافرة\n ومع وفور تلك النعم العظام\n والفواضل الجسام { قَلِيلاً مَّا تَشْكُرُونَ } [السجدة: 9] وتصرفونها إلى ما مقتضياتها التي جبلها الحق لأجلها\n\n\n{ وَ } من غاية كفرانهم بنعم الله\n ونهاية عمههم وسكرتهم فيه: { قَالُوۤاْ } أي: أُبي بن خلف ومن معه المنافقين بعدما سمعوا من البعث والحشر\n ويوم العرش والجزاء مستبعدين مستفهمين\n مكررين على سبيل المبالغة في الإنكار { أَءِذَا ضَلَلْنَا } وضمحللنا { فِي ٱلأَرْضِ } وصرنا من جملة الهباء المنبثة\n المتلاشية المتناسلة التي لا تمايز فيها أصلاً { أَءِنَّا } بعدما كنا كذلك أيها العقلاء المجبولون على الدارية والشعور { لَفِي خَلْقٍ جَدِيدٍ } مثلما كنا عليها قبل مؤتنا؟! كلا وحاشاـ وما لنا عود إلى الحياة الدنيا\n سيما بعدما متنا وصرنا تراباً وعظاماً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم سوّاه } أي: سوّى صورته في أحسن تقويم\n { ونفخ فيه من روحه } \n أضافه إلى نفسه\n تشريفاً\n إشارة إلى أنه خلق عجيب\n وأن له شأناً ومناسبة إلى حضرة الربوبية\n ولذلك قيل: من عرف نفسه عرف ربه\n وقد تقدم في سورة الإسراء\n في الكلام على الروح\n وجه المعرفة منه\n { وجعل لكم السمعَ والأَبْصارَ والافئدة } لتسمعوا كلامه\n وتُبصروا آثار قدرته وعجائب حكمته\n وتعقلوا\n فتعرفوا صانعكم ومُدبرَ أمرِكم\n { قليلاً ما تشكرون } أي: تشكرون شكراً قليلاً على هذه النعم لقلة التدبر فيها\n { وقالوا } منكرين للبعث: { أئذا ضللنا في الأرض } \n أي: صِرْنَا تراباً\n وذهبنا مختلطين بتراب الأرض\n لا نتميز منه\n كما يضل الماء في اللبن\n أو: غبنا في الأرض بالدفن فيها\n يقال: ضَلَلَ كضرب\n وضِلل كفرح\n وانتصب الظرف في أإذا بقوله: { أئنا لفي خلق جديد }\n أي: أُنبعث\n ونُجدد\n إذا ضللنا في الأرض؟ والقائل لهذه المقالة أُبيّ بن خلف\n وأسند إليهم لرضاهم بذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:23",
      "similarity": 0.6282283305203569
    },
    {
      "verse": "23:78",
      "similarity": 0.6170664922519676
    },
    {
      "verse": "16:78",
      "similarity": 0.5322449067851817
    },
    {
      "verse": "15:29",
      "similarity": 0.5027797930547693
    },
    {
      "verse": "38:72",
      "similarity": 0.5027797930547693
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/032009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/032009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/32:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}