{
  "chapter": "الأحزاب",
  "text": "ولقد كانوا۟ عهدوا۟ الله من قبل لا يولون الادبر وكان عهد الله مسـولا",
  "translations": [
    {
      "translation": "Whereas earlier they had made a promise to God that they would never turn their backs; and a promise made to God is answerable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had earlier covenanted with Allah that they would not turn their backs in flight. And a covenant made with Allah must needs be answered for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had certainly promised God that they would not turn away. To promise God is certainly a (great) responsibility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed before this they had agreed with Allah that they would not turn their backs; and the covenant of Allah will be questioned about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed they had already made a covenant with Allah not to turn their backs, and a covenant with Allah must be answered for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly they had made a covenant with Allah before, that) they would not turn (their) backs; and Allah's covenant shall be inquired of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they had made covenant with God before that, that they would not turn their backs; and covenants with God shall be questioned of\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily they had already sworn unto Allah that they would not turn their backs (to the foe). An oath to Allah must be answered for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had already vowed before God that they would never turn their backs: and a vow made to God must be answered for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And arruredly they had already covenanted with Allah that they would not turn their backs; verily the covenant with Allah must be questioned about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "though they had already pledged to Allah before that they would not turn their backs [to flee], and pledges given to Allah are accountable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet they had already covenanted with Allah not to turn their backs, and a covenant with Allah must (surely) be answered for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed they had already made a covenant with Allah not to turn their backs, and a covenant with Allah must be answered for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet before that, they made a covenant with Allah never to turn their backs. And covenants with Allah shall be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Although they had made a pledged to God, in the past, that they will not turn their backs. A pledge to God is a responsibility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they had already promised Allah before not to turn their backs and flee. And ever is the promise to Allah [that about which one will be] questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:15] Though they had assuredly pledged to God before that, that they would not turn their backs [to flee]; and a pledge given to God must be answered for, regarding whether it was fulfilled [or not].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily they had already sworn unto Allah) before the battle of the Ditch, on the occasion of the battle of the Clans (that they would not turn their backs) fleeing from the idolaters. (An oath to Allah) the one who breaks his oath to Allah (must he answered for) will be asked about it on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يعطونها وهم { لَقَدْ كَانُواْ } أي: بنو حارثة وبنو سلمة { عَاهَدُواْ ٱللَّهَ } أي: عهدوا العهد الوثيق مع الله { مِن قَبْلُ } أي: قبل حفر الخندق، وذلك في يوم أحد حين أرادوا أن يُفشلوا عن رسوله الله صلى الله عليه وسلم أو تخلفوا عنه يوم بدر، فلما رأوا ما أعطى الأحديون والبدريون من الكرامة العظيمة آجلاً وعاجلاً قالوا معاهدين: لئن أشهدنا الله قتالاً فالنقاتلن، وحلفوا { لاَ يُوَلُّونَ ٱلأَدْبَارَ } أصلآً، فالآن قد تذبذبوا وتضعفوا، وكادوا أن يولوا { وَ } لم يعلموا أنه { كَانَ عَهْدُ ٱللَّهِ } الذين عاهدوا معه سبحانه من قبل { مَسْئُولاً } [الأحزاب: 15] عنه وعن نقضه ووفائه، وهم مجزيون بمقتضى ما ظهر منهم من النقض والوفاء؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}