{
  "chapter": "الأحزاب",
  "text": "اشحة عليكم فاذا جاء الخوف رايتهم ينظرون اليك تدور اعينهم كالذى يغشى عليه من الموت فاذا ذهب الخوف سلقوكم بالسنة حداد اشحة على الخير او۟لئك لم يؤمنوا۟ فاحبط الله اعملهم وكان ذلك على الله يسيرا",
  "translations": [
    {
      "translation": "and are begrudging towards you. Then when fear comes, you see them looking at you, their eyes rolling like people scared to death. But when fear departs they flay you with sharp tongues, grasping for wealth. Such people have no iman and Allah will make their actions come to nothing. That is easy for Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being chary of helping you. But when danger appears you will find them looking at you with eyes turning like a man's in the swoon of death. Yet when the danger is past they lash you with sharp tongues, covetous of the best (of booty). Such as these have not come to belief. So God nullifies whatever they have done. This is how (the innate law of) God works inevitably.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are utterly niggardly (in coming to your aid). Whenever there is danger, you will see them looking at you, their eyes rolling as though they were on the verge of fainting at the approach of death. But when the danger passes away, their greed for wealth prompts them to greet you with their sharp, scissor-like tongues. These are the ones who never truly believed, and so Allah has caused their deeds to be reduced to naught. That is easy enough for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are niggardly in spending for you. When fear comes, you can see them looking at you, their eyes rolling about like to faint because of the agony of death. When their fear subsides, they start to bite you with their sharp tongues. They are miserly in spending for a virtuous cause and have no faith. God has turned their deeds devoid of all virtue. This was not at all difficult for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They reduce the help towards you; so when a fearful time comes, you will observe them looking at you with eyes rolling like one enveloped by death; then when the time of fear is over, they begin slandering you with sharp tongues in their greed for the war booty; they have not accepted faith, therefore Allah has nullified their deeds; and this is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being miserly towards you. Then when fear comes, you will see them looking to you, their eyes revolving like one over whom hovers death; but when the fear departs, they will smite you with sharp tongues, miserly towards good. Such have not believed. Therefore, Allah makes their deeds fruitless and that is ever easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being niggardly with respect to you; but when fear comes, you will see them looking to you, their eyes rolling like one swooning because of death; but when the fear is gone they smite you with sharp tongues, being niggardly of the good things. These have not believed, therefore Allah has made their doing naught; and this is easy to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being niggardly towards you. When fear comes upon them, thou seest them looking at thee, their eyes rolling like one who swoons of death; but when the fear departs, they flay you with sharp tongues, being niggardly to possess the good things. Those have never believed; God has made their works to fail; and that is easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being sparing of their help to you (believers). But when the fear cometh, then thou (Muhammad) seest them regarding thee with rolling eyes like one who fainteth unto death. Then, when the fear departeth, they scald you with sharp tongues in their greed for wealth (from the spoil). Such have not believed. Therefor Allah maketh their deeds fruitless. And that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Begrudging you all help, but when danger comes, you can see them looking at you with rolling eyes as if in their death throes; but once their fear has passed, they come to you and do glib-talking in their greed for wealth. Such men have no faith, so God has foiled their actions. This is indeed easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being niggardly toward you. Then when the fightin cometh, thou beholdest them look unto thee, their eyes rolling about, like the eyes of him who fainteth unto death. Then when the fighting is over they inveigh against you with sharp tongues, being niggardly of the good things. These have not believed; wherefore Allah hath made their works of none effect, and that is with Allah ever easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "grudging you [their help]. So when there is panic, you see them looking at you, with their eyes rolling like someone fainting at death. Then, when the panic is over, they scald you with [their] sharp tongues in their greed for the spoils. They never have had faith. So Allah has made their works fail, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Covetous over you. Then when fear comes, thou wilt see them looking to thee, their eyes revolving, like (those of) one over whom hovers death: but when the fear is past, they will smite you with sharp tongues, covetous of goods. Such men have no faith, and so Allah has made their deeds of none effect: and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being miserly towards you (as regards help and aid in Allah's Cause). Then when fear comes, you will see them looking to you, their eyes revolving like (those of) one over whom hovers death, but when the fear departs, they will smite you with sharp tongues, miserly towards (spending anything in any) good (and only covetous of booty and wealth). Such have not believed. Therefore Allah makes their deeds fruitless, and that is ever easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being mean towards you. When fear comes to them, you see them looking at you, their eyes rolling as though they were on the point of death. But once the fear departs they assail you with their sharp tongues, being greedy to possess good things. Those have never believed; Allah has annulled their deeds. That is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being stingy towards you. And when fear approaches, you see them staring at you—their eyes rolling—like someone fainting at death. Then, when panic is over, they whip you with sharp tongues. They resent you any good. These have never believed, so God has nullified their works; a matter easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indisposed toward you. And when fear comes, you see them looking at you, their eyes revolving like one being overcome by death. But when fear departs, they lash you with sharp tongues, indisposed toward [any] good. Those have not believed, so Allah has rendered their deeds worthless, and ever is that, for Allah, easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:19] grudging to you, in their help (ashihha, ‘grudging’, is the plural of shahīh, and is a circumstantial qualifier referring to the subject [of the verb] ya’tūna, ‘they engage’). And when there is a panic, you see them looking at you, their eyes rolling like one, that is, like the look of one, or the rolling of one, fainting at death, in other words, [one] in the throes thereof; but when the panic subsides, and the spoils have been secured, they scald you, they hurt you, or they smite you, with [their] sharp tongues, in their greed for the riches, in other words, for the spoils, which they demand [greedily]. Those, they never believed, really. Therefore God has invalidated their works, and that, invalidation, is easy for God, by His will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Being sparing of their help to you (believers)) they claimed they took pity on the believers; it is also said that this means: they are too niggardly when it is a question of spending on the believers. (But when the fear) of the enemy (cometh, then thou (Muhammad) seetthem) the hypocrites in the Ditch (regarding thee with rolling eyes like one who fainteth unto death) like the one suffering from the pangs of death. (Then, when the fear) of the enemy (departeth, they scald you with sharp tongues) they attack and vilify you (in their greed for wealth (from the spoil)) they are stingy when it comes to spending in the way of Allah. (Such) those who have such traits (have not believed) are not sincere in their faith. (Therefore Allah maketh their deeds fruitless) Allah thwarts their good deeds by means of their evil works. (And that) thwarting good deeds (is easy for Allah).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَا ذَهَبَ ٱلْخَوْفُ سَلَقُوكُمْ بِأَلْسِنَةٍ حِدَادٍ } معناه بالَغوا فِي عَيبِكُمْ ولائِمتِكُمْ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So when fear has departed, they will strike you with a sharp sword}, [means that] they will find fault with you and find you blameworthy.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أتوا ما أتوا إلا { أَشِحَّةً } أي: بخلاء { عَلَيْكُمْ } أيها المؤمنون المخلصون لما معكم من المعاونة والنفقة في سبيل الله\n أو خوف الظفر وفوت الغنيمة\n أو من خوف العاقبة\n وإنما فعلوا ذلك قبل القتال { فَإِذَا جَآءَ ٱلْخَوْفُ } وظهرت أمارات القتال والحراب { رَأَيْتَهُمْ } أيها الرائي حين { يَنظُرُونَ إِلَيْكَ } من شدة خوفهم وخشيتهم { تَدُورُ } أي: تتحرك وتضطرب { أَعْيُنُهُمْ } أي: آماقهم في أحداقهم { كَٱلَّذِي يُغْشَىٰ } أي: يحل ويدور { عَلَيْهِ مِنَ } أمارات { ٱلْمَوْتِ } ولاح عليه علامات السكرات { فَإِذَا ذَهَبَ ٱلْخَوْفُ } وزال الرعب والخشية\n وانهزم العدو\n واجتمعت الغنائم { سَلَقُوكُمْ } أي: جاءوكم مستلقين متسلطين عليكم { بِأَلْسِنَةٍ حِدَادٍ } ذربة قاطعة\n باسطين أيديهم إلى الغنائم وقت قسمتكم\n صائحين عليكم: لستم أولى منَّا وأحق بهذه الغنائم\n لأنَّا شهدنا القتال معكم\n بل نحن لا نقصِّر وأنتم قاصرون\n فبم ترجحون أنتم علينا\n وإنما سلقوكم بها حال كونهم { أَشِحَّةً } بخلاء { عَلَى ٱلْخَيْرِ } الذي وصل إليكم من الغنائم العظام؟!\n\n\nوبالجملة: { أوْلَـٰئِكَ } البعداء الهالكون في تيه النفاق والشقاق { لَمْ يُؤْمِنُواْ } بتوحيد الله\n ولم يخلصوا الإيمان به وبرسوله وكتابه\n بل: إنما آمنوا واعترفوا باللسان\n لحقن الدماء والأموال خداعاً ومكراً\n ولذلك مكر الله المطلع على نيَّاتهم بهم { فَأَحْبَطَ ٱللَّهُ أَعْمَالَهُمْ } الصالحة\n وأبطلها عليهم بلا ترتيب الجزاء والمثوبات\n كما لأعمال المخلصين من المؤمين { وَكَانَ ذَلِكَ } الإحباط والإبطال { عَلَى ٱللَّهِ } القادر لجميع ما ثبت في لوح قضائه { يَسِيراً } [الأحزاب: 19] سهلاً غير عسير عنده\n\n\nوإن استعسرتم أيها المحجوبون بالحجب الظلمانية الكثيفة\n ومن كمال غيِّهم وضلالهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أشِحَّةٌ عليكم } جمع شحيح\n وهو البخيل\n نُصب على الحال من ضمير { يأتون } أي: لا يأتون الحرب بُخلاً عليكم بالمعاونة أو بالنفقة في سبيل الله\n أو: في الظفر والغنيمة\n أي: عند الظفر وقَسْم الغنيمة\n { فإذا جاء الخوفُ } من قِبَلَ العدو\n أو: منه صلى الله عليه وسلم\n { رأيتهم ينظرون إليك } في تلك الحالة\n { تدور أعينُهم } يميناً وشمالاً { كالذي يُغْشى عليه من الموت } كما ينظر المغشي عليه معالجة سكرات الموت حذراً وخوفاً ولِواذاً بك\n { فإذا ذهبَ الخوفُ } أي: زال ذلك الخوف وأمِنوا\n وحيزت الغنائم { سلقوكم بألسنةٍ حِدَادٍ } خاطبوكم مخاطبة شديدة\n وآذوكم بالكلام\n يقال: خطيب سِلق: فصيح\n ورجل مِسْلق وسَلاَّق: مبالغ في الكلام\n يعني: بسطوا ألسنتهم فيكم\n وقت قسم الغنيمة\n ويقولون: أعطنا فإنا قد شهدنا معكم\n وبمكاننا غَلبتم عدوكم\n { أشِحَّةً على الخير } أي: خاطبوكم أشحة على المال والغنيمة\n فهو حال من فاعل سلقوكم\n فهم أشح القوم عند القسم\n وأجبنهم عند الحرب\n { أولئك لم يؤمنوا } في الحقيقة\n بل بالألسنة فقط\n { فأحبط اللهُ أعمالهم } أبطلها\n بإضمار الكفر مع ما أظهروا من الأعمال الخبيثة\n { وكان ذلك } الإحباط { على الله يسيراً } هيناً\n الإشارة: هذه صفة منافقي الصوفية\n يدخلون معهم على تذبذب\n فإذا رأوا قوماً توجهوا لخرق عوائدهم وتخريب ظواهرهم\n أو: أرادوا الخروج عن دنياهم\n عَوَّقُوهُمْ عن ذلك\n وثبطوهم\n وكذلك إذا تواجهوا في سفر لشُقة بعيدة ليستتروا بهم\n وقالوا لأخوانهم في الطريق: هلم إلينا\n ولا يأتون مكان حرب أنفسهم إلا قليلاً\n أشحةً بأنفسهم عليكم\n فإذا جاء الخوف\n وتجلّى لهم الحق تعالى باسمه الجليل بأن نزلت بالفقراء محنة\n رأيْتَهُمْ ينظرون إليك\n تدور أعينهم\n نظر المغشي عليه من الموت\n فإذا ذهب الخوف\n وجاء النصر والعز سلقوكم بألسنة حداد\n وقالوا: إنا كنا معكم\n أولئك لا نصيب لهم مما للقوم من الخصوصية\n والله تعالى أعلم\n ثم تمم وصفهم فقال: { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:16",
      "similarity": 0.27281394997028463
    },
    {
      "verse": "4:128",
      "similarity": 0.22083120305257026
    },
    {
      "verse": "59:9",
      "similarity": 0.20701665858143148
    },
    {
      "verse": "6:88",
      "similarity": 0.08317391253317
    },
    {
      "verse": "39:65",
      "similarity": 0.08250780731847435
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/33:19.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/33:19.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/33:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}