{
  "chapter": "الأحزاب",
  "text": "يايها النبى اتق الله ولا تطع الكفرين والمنفقين ان الله كان عليما حكيما",
  "translations": [
    {
      "translation": "O Prophet! have taqwa of Allah and do not obey the kafirun and hypocrites. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O PROPHET FEAR God and do not follow the unbelievers and the hypocrites.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear Allah and do not obey the unbelievers and the hypocrites. Verily Allah is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, have fear of God and do not yield to the infidels and hypocrites. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden (the Prophet), continue to fear Allah and never listen to the disbelievers and the hypocrites; indeed Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Have Taqwa of Allah, and obey not the disbelievers and the hypocrites. Verily, Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! be careful of (your duty to) Allah and do not comply with (the wishes of) the unbelievers and the hypocrites; surely Allah is Knowing, Wise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear God, and obey not the unbelievers and the hypocrites. God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Keep thy duty to Allah and obey not the disbelievers and the hypocrites. Lo! Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, have fear of God and do not yield to those who deny the truth and the hypocrites. God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! fear Allah and obey not the infidels and the hypocrites; verily Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Be wary of Allah and do not obey the faithless and the hypocrites. Indeed Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Fear Allah, and hearken not to the Unbelievers and the Hypocrites: verily Allah is full of Knowledge and Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Keep your duty to Allah, and obey not the disbelievers and the hypocrites (i.e., do not follow their advices). Verily! Allah is Ever AllKnower, AllWise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear Allah, and do not obey the unbelievers and the hypocrites. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Fear God, and do not obey the unbelievers and the hypocrites. God is Knowledgeable and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear Allah and do not obey the disbelievers and the hypocrites. Indeed, Allah is ever Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:1] O Prophet! Fear God, remain in fear of Him, and do not obey the disbelievers and the hypocrites, [and so follow them] in what contravenes your Law. Truly God is Knower, of what will happens before it happens, Wise, in what He creates.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا النَّبِيُّ اتَّقِ اللَّهَ وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا (1)افتتاح السورة بخطاب النبي صلى الله عليه وسلم وندائه بوصفه مُؤذِنٌ بأن الأهم من سوق هذه السورة يتعلق بأحوال النبي صلى الله عليه وسلم وقد نودي فيها خمس مرات في افتتاح أغراض مختلفة من التشريع بعضها خاص به وبعضها يتعلق بغيره وله ملابسة له .فالنداء الأول : لافتتاح غرض تحديد واجبات رسالته نحو ربه .والنداء الثاني : لافتتاح غرض التنويه بمقام أزواجه واقترابه من مقامه .والنداء الثالث : لافتتاح بيان تحديد تقلبات شؤون رسالته في معاملة الأمة .والنداء الرابع : في طالعَة غرض أحكام تزوجه وسيرته مع نسائه .والنداء الخامس : في غرض تبليغه آداب النساء من أهل بيته ومن المؤمنات .فهذا النداء الأول افتتح به الغرض الأصلي لبقية الأغراض وهو تحديد واجبات رسالته في تأدية مراد ربه تعالى على أكمل وجه دون أن يفسد عليه أعداء الدين أعماله ، وهو نظير النداء الذي في قوله { يا أيها الرسول بلغ ما أنزل إليك من ربك } \\[ المائدة : 67 \\] الآية ، وقوله : { يا أيها الرسول لا يحزنك الذين يسارعون في الكفر } \\[ المائدة : 41 \\] الآيات .ونداء النبي عليه الصلاة والسلام بوصف النبوءة دون اسمه العلم تشريف له بفضل هذا الوصف ليُربأ بمقامه عن أن يخاطب بمثل ما يخاطب به غيره ولذلك لم يناد في القرآن بغير { يا أيها النبي } أو { يا أيها الرسول } \\[ المائدة : 67 \\] بخلاف الإخبار عنه فقد يجيء بهذا الوصف كقوله { يوم لا يُخزِي الله النبي } \\[ التحريم : 8 \\] { وقال الرسول يا رب } \\[ الفرقان : 30 \\] { قل الأنفال لله والرسول } \\[ الأنفال : 1 \\] { النبي أولى بالمؤمنين من أنفسهم } \\[ الأحزاب : 6 \\] ، ويجيء باسمه العلم كقوله { ما كان محمدٌ أبا أحد من رجالكم } \\[ الأحزاب : 40 \\] .وقد يتعين إجراء اسمه العلم ليوصف بعده بالرسالة كقوله تعالى { محمد رسولُ الله } \\[ الفتح : 29 \\] وقوله { وما محمد إلا رسولٌ } \\[ آل عمران : 144 \\] . وتلك مقامات يقصد فيها تعليم الناس بأن صاحب ذلك الاسم هو رسول الله ، أو تلقين لهم بأن يسمُّوه بذلك ويدْعوه به ، فإن علم أسمائه من الإيمان لئلا يلتبس بغيره ، ولذلك قال رسول الله صلى الله عليه وسلم « لي خمسة أسماءٍ : أنا محمد ، وأنا أحمد ، وأنا الماحي الذي يمحو الله بي الكفر ، وأنا الحاشر الذي يحشر الناس على قدمي ، وأنا العاقب » تعليماً للأمة . وقد أنهى أبو بكر ابن العربي أسماء النبي صلى الله عليه وسلم إلى سبعة وستين وأنهاها السيوطي إلى ثلاثمائة . وذكر ابن العربي أن بعض الصوفية قال : أسماء النبي ألفَا اسم كما سيأتي عند قوله تعالى : { يأيها النبي إنا أرسلناك شاهداً ومبشراً ونذيراً } \\[ الأحزاب : 45 \\] .والأمر للنبيء بتقوى الله توطئة للنهي عن اتّباع الكافرين والمنافقين ليحصل من الجملتين قصرُ تقواه على التعلق بالله دون غيره ، فإن معنى { لا تطع } مرادف معنى : لاَ تَتَّققِ الكافرين والمنافقين ، فإن الطاعة تقوى؛ فصار مجموع الجملتين مفيداً معنى : يأيها النبي لا تتق إلا الله ، فعدل عن صيغة القصر وهي أشهر في الكلام البليغ وأوجز إلى ذكر جملتي أمر ونهي لقصد النص على أنه قصر إضافي أريد به أن لا يطيع الكافرين والمنافقين لأنه لو اقتصر على أن يُقال : لا تتق إلا الله لما أصاخت إليه الأسماع إصاخة خاصة لأن تقوى النبي صلى الله عليه وسلم ربه أمر معلوم ، فسلك مسلك الإطناب لهذا ، كقول السموْأل :تَسِيل على حدّ الظُبات نفوسنا ... وليستْ على غير الظُبات تسيلفجاء بجملتي إثبات السيلان يِقَيْدٍ ونفيه في غير ذلك القيد للنص على أنهم لا يكرهون سيلان دمائهم على السيوف ولكنهم لا تسيل دماؤهم على غير السيوف .فإن أصل صيغة القصر أنها مختصرة من جملتي إثبات ونفي ، ولكون هذه الجملة كتكملة للتي قبلها عطفت عليها لاتحاد الغرض منهما . وقد تعين بهذا أن الأمر في قوله { اتّققِ الله } والنهي في قوله { ولا تُطِععِ الكافرين والمنافقين } مستعملان في طلب الاستمرار على ما هو ملازم له من تقوى الله ، فأشعر ذلك أن تشريعاً عظيماً سيلقى إليه لا يخلو من حرج عليه فيه وعلى بعض أمته ، وأنه سيلقى مطاعن الكافرين والمنافقين .وفائدة هذا الأمر والنهي التشهير لهم بأن النبي صلى الله عليه وسلم لا يقبل أقوالهم ليَيْأسوا من ذلك لأنهم كانوا يدبرون مع المشركين المكايد ويظهرون أنهم ينصحون النبي صلى الله عليه وسلم ويلحّون عليه بالطلبات نصحاً تظاهراً بالإسلام .والمراد بالكافرين المجاهرون بالكفر لأنه قوبل بالمنافقين ، فيجوز أن يكونوا المشركين كما هو غالب إطلاق هذا الوصف في القرآن والأنسبُ بما سيعقبه من قوله { مَا جَعَلَ الله لِرَجُللٍ مِنْ قَلْبَيْن في جوفه } \\[ الأحزاب : 4 \\] إلى آخر أحكام التبنِّي ، والموافق لما روي في سبب نزولها على ضعف فيه سنبينه؛ ويجوز أن يكونوا اليهودَ كما يقتضيه ما يروى في سبب النزول ، ولو حمل على ما يعمّ نوعي الكافرين المجاهرين لم يكن بعيداً .والطاعة : العمل على ما يأمر به الغير أو يشير به لأجل إجابة مرغوبة . وماهيتها متفاوتة مقول عليها بالتشكيك ، ووقوع اسمها في سياق النهي يقتضي النهي عن كل ما يتحقق فيه أدنى ماهيتها ، مثل أن يعدل عن تزوج مُطَلَّقة متبناه لقول المنافقين : إن محمداً ينهَى عن تزوج نساء الأبناء وتزوج زوج ابنه زيد بن حارثة ، وهو المعنى الذي جاء فيه قوله تعالى : { وتَخشى الناسَ والله أحق أن تَخشاه } \\[ الأحزاب : 37 \\] ، وقوله : { ولا تطِع الكافرين والمنافقين ودَعْ أذاهم } \\[ الأحزاب : 48 \\] عقب قضية امرأة زيد . ومثل نقض ما كان للمشركين من جعل الظهار موجباً مصير المظاهرَة أُمًّا للمُظاهِر حراماً عليه قربانها أبداً ، ولذلك أردفت الجملة بجملة { إن الله كان عليماً حكيماً } تعليلاً للنهي .والمعنى : أن الله حقيق بالطاعة له دون الكافرين والمنافقين لأنه عليم حكيم فلا يأمر إلا بما فيه الصلاح .ودخول { إنّ } على الجملة قائم مقام فاء التعليل ومغننٍ غناءها على ما بُيّن في غير موضع ، وشاهده المشهور قول بشار :بَكِّرَا صَاحِبَيّ قبل الهجيرإن ذاك النجاحَ في التبكيروقد ذكر الواحدي في «أسباب النزول» والثعلبي والقشيري والماوردي في «تفاسيرهم» : أن قوله تعالى { ولا تُطِععِ الكافرين والمنافقين } نزل بسبب أنه بعد وقعة أُحُد جاء إلى المدينة أبو سفيان بن حرب وعكرمة بن أبي جهل وأبو الأعور السُّلَمي عَمرُو بن سفيان من قريش وأذن لهم رسول الله صلى الله عليه وسلم بالأمان في المدينة وأن ينزلوا عند عبد الله بن أبيّ ابن سلول ثم جاءوا إلى رسول الله صلى الله عليه وسلم مع عبد الله بن أُبيّ ومعتِّب بن قُشير ، والجدّ بن قيس ، وطمعةَ بن أُبَيْرِق فسألوا رسول الله أن يترك ذكر آلهة قريش ، فغضب المسلمون وهَمّ عُمر بقتل النفر القرشيين ، فمنعه رسول الله لأنه كان أعطاهم الأمان ، فأمرهم أن يخرجوا من المدينة فنزلت هذه الآية ، أي : اتق الله في حفظ الأمان ولا تطع الكافرين وهم النفر القرشيون والمنافقين وهم عبد الله بن أبّي ومن معه . وهذا الخبر لا سند له ولم يعرج عليه أهل النقد مثل الطبري وابن كثير .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (O Prophet! Keep thy duty to Allah): '(O Prophet! Keep thy duty to Allah) He says: fear Allah in relation to breaking your pledge before the time of its expiry (and obey not the disbelievers) from among the people Mecca: Abu Sufyan Ibn Harb, 'Ikrimah Ibn Abi Jahl and Abu'l-A'war al-Aslami (and the hypocrites) of Medina: 'Abdullah Ibn Ubayy Ibn Salul, Mu'attib Ibn Qushayr and Jadd Ibn Qays; do not obey them in what they ask you to commit of transgression. (Lo! Allah is Knower) of what they say and of their intent to kill you, (Wise) He enjoined that one should honour one's pledge and forbade breaking pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها النبي اتقّ الله } بالفناء عن ذاتك بالكلية دون بقاء البقية { ولا تُطِع الكافرين } بموافقتهم في بعض الحجب لظهور الأنائية { والمنافقين } بالنظر إلى الغير فتكون ذا وجهين وبالانتهاء بحكم هذا النهي وصف بقوله:\n[النجم\n الآية:17]\n { إن الله كان عليماً } يعلم ذنوب الأحوال { حكيماً } في ابتلائك بالتلوينات فإنها تنفع في الدعوة وإصلاح أمر الأمة إذ لو لم يكن له تلوين لم يعرف ذلك من أمّته فلا يمكنه القيام بهدايتهم { واتّبع } في ظهور التلوينات { ما يوحى إليك من ربّك } من التأديبات وأنواع العتاب والتشديدات بحسب المقامات كما ذكر غير مرة في قوله:\n[الإسراء\n الآية:74] وأمثاله { إن الله كان بما تعلمون خبيراً } يعلم مصادر الأعمال وأنها من - أي الصفات - تصدر من الصفات النفسانية أو الشيطانية أو الرحمانية فيهديك إليها ويزكيك منها ويعلمك سبيل التزكية والحكمة في ذلك { وتوكل على الله } في دفع تلك التلوينات ورفع تلك الحجب والغشاوات { وكفى بالله وكيلاً } فإنها لا ترتفع ولا تنكشف إلا بيده لا بنفسك وعلمك وفعلك\n أي: لا تحتجب برؤية الفناء في الفناء فإنه ليس من فعلك سواء كان في الأفعال أو الصفات أو الذات أو إزالة التلوينات فإنها كلها بفعل الله لا مدخل لك فيها وإلا لما كنت فانياً\n { النبيّ أولى بالمؤمنين من أنفسهم } لأنه مبدأ وجوداتهم الحقيقية ومبدأ كمالاتهم ومنشأ الفيضين الأقدس الاستعدادي أولاً والمقدس الكمالي ثانياً\n فهو الأب الحقيقي لهم ولذلك كانت أزواجه أمّهاتهم في التحريم ومحافظة الحرمة مراعاة لجانب الحقيقة وهو الواسطة بينهم وبين الحق في مبدأ فطرتهم فهو المرجع في كمالاتهم ولا يصل إليهم فيض الحق بدونه لأنه الحجاب الأقدس واليقين الأول\n كما قال:\n \" أول ما خلق الله نوري \" \n\n فلو لم يكن أحبّ إليهم من نفسهم لكانوا محجوبين بأنفسهم عنه\n فلم يكونوا ناجين\n إذ نجاتهم إنما هي بالفناء فيه لأنه المظهر الأعظم\n { وأولوا الأرحام بعضهم أولى ببعض في كتاب الله من المؤمنين والمهاجرين } بعضهم أولى ببعض من غيرهم للاتصال الروحاني والجسماني والأخوة الدينية والقرابة الصورية ولا تخلو القرابة من تناسب ما في الحقيقة لاتصال الفيض الروحاني بحسب الاستعداد المزاجي\n فكما تتناسب أمزجة أولي الأرحام وهياكلهم الصورية فكذلك أرواحهم وأحوالهم المعنوية { إلا إن تفعلوا إلى أوليائكم } المحبوبين في الله للتناسب الروحي والتقارب الذات { معروفاً } إحساناً بمقتضى المحبة والاشتراك في الفضيلة زائداً عما بين الأقارب { كان ذلك في الكتاب } أي: اللوح المحفوظ { مسطوراً }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰأَيُّهَا ٱلنَّبِيُّ } المؤيَّد من عند العليم الحكيم مقتضى نبوتك التي صرت بها خاتماً لدائرة النبوة والرسالة\n متمماً لمكارم الأخلاق\n مكملاً لأمر التشريع والتدوين: التقوى والتحفظ من مقتضيات الأراء الباطلة\n والأهواء الفاسدة\n والتحصن بالله والثقة إليه\n وجعله وقايتك عند نزول البلاء وهجوم الأعداء { ٱتَّقِ ٱللَّهَ } حق تقاته\n واجتنب عما لا يرضى به ربك مطلقاً { وَلاَ تُطِعِ } في حال من الأحوال أمر { ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } الذين خاصموا معك في إسرارهم وإعلانهم\n ولا تتبع أهواءهم الفاسدة وآراءهم الباطلة\n وابتغ فيما آتاك الله من مقتضيات استعدادك\n وما تفضل عليك امتناناً لك\n لرضاء الله والفوز بشرف لقاء الله { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { كَانَ عَلِيماً } في حضرةة علمه الحضوري بقابليتك وبمقتضياتها { حَكِيماً } [الأحزاب: 1] في إفاضة ما يعينك وينبغي لك\n ويليق بشأنك\n\n\n{ وَ } بعدما جعلت ربك وقاية نفسك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها النبي } أي: المُشرِّف حالاً\n المفخم قدراً\n العلي رتبة لأن النبوة مشتقة من النَّبْوَةَ\n وهو الارتفاع\n أو: يا أيها المخبرُ عنا\n المأمون على وحينا\n المبلغ خطابنا إلى أحبابنا\n وإنما لم يقل: يا محمد\n كما قال: \" يا آدم\n يا موسى \" تشريفاً وتنويهاً بفضله\n وتصريحُه باسمه في قوله:\n[الفتح: 29]\n ونحوه\n ليعلم الناس بأنه رسول الله\n { اتقِ الله } أي: اثبت على تقوى الله\n { ولا تُطع الكافرين والمنافقين } لا تساعدهم على شيء\n واحترس منهم فإنهم أعداء لله وللمؤمنين\n رُوي أن أبا سُفيان بن حرب\n وعكرمة بن أبي جهل\n وأبا الأعور السُّلمي\n نزلوا المدينة على ابن أُبيّ\n رأس المنافقين\n بعد أُحد\n وقد أعطاهم النبيُّ صلى الله عليه وسلم الأمان على أن يكلموه\n فقام معهم عبد الله بن أبي سَرْح\n وطُعْمَة بن أُبيْرق\n فقالوا للنبي صلى الله عليه وسلم\n وعنده عمر بن الخطاب: ارفض ذكر آلهتنا اللات\n والعزى\n ومناة\n وقل: إن لها شفاعة ومنفعة لِمن عَبَدَها\n وندعك وَرَبَّك\n فشقّ على النبي صلى الله عليه وسلم قولهم\n فقال عمر: ائذن لنا\n يا رسول الله\n في قتلهم\n فقال صلى الله عليه وسلم:\n \" إني قد أعطيتهم الأمان \" \nفقال عمر: اخرُجوا في لعنة الله وغضبه\n فخرجوا من المدينة\n فنزلت\n أي: اتق الله في نقض العهد\n ولا تُطع الكافرين من أهل مكة\n كأَبي سفيان وأصحابه\n والمنافقين من أهل المدينة\n فيما طلبوا\n { إن الله كان عليماً } بخبث أعمالهم\n { حكيماً } بتأخير الأمر بقتالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:108",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:110",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:126",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:131",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:144",
      "similarity": 0.42302729618278667
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}