{
  "chapter": "الأحزاب",
  "text": "واذ قالت طائفة منهم ياهل يثرب لا مقام لكم فارجعوا۟ ويستـذن فريق منهم النبى يقولون ان بيوتنا عورة وما هى بعورة ان يريدون الا فرارا",
  "translations": [
    {
      "translation": "and a group of them said, 'People of Yathrib, Your position is untenable so return!' some of them asked the Prophet to excuse them, saying, 'Our houses are exposed,' when they were not exposed; it was merely that they wanted to run away.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a section of them said: \"O people of Yathrib, there is no place for you here, turn back;\" and a section of them asked leave of the Prophet, saying: \"Our homes lie exposed,\" -- while they were not exposed. Their only intention was to run away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a section of them said: “(O people of Yathrib), now there is no place for you to stay, so turn back.” (And call to mind) when a section of them was seeking permission from the Prophet to leave, saying: “Our houses are exposed (to attack),” although they were not exposed (to attack); they only wished to flee (from the battle-front).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was there that a group of them said, \"People of Yathrib, turn back for there is no place for you to stay.\" Another group, asking for the Prophet's permission, said, \"Our homes are defenseless.\" In fact, they were not defenseless. They only wanted to run away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a group among said, “O people of Medinah! This is no place of stay for you, therefore go back to your homes”; and a group among them sought exemption from the Prophet by saying, “Our homes are unprotected” whereas their homes were not unprotected; they willed nothing except to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: \"O people of Yathrib! There is no postition for you. Therefore go back!\" And a band of them ask for permission of the Prophet saying: \"Truly, our homes lie open.\" And they lay not open. They but wished to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: O people of Yasrib! there is no place to stand for you (here), therefore go back; and a party of them asked permission of the prophet, saying. Surely our houses are exposed; and they were not exposed; they only desired to fly away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said, 'O people of Yathrib, there is no abiding here for you, therefore return!' And a part of them Were asking leave of the Prophet, saying, 'Our houses are exposed'; yet they were not exposed; they desired only to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: O folk of Yathrib! There is no stand (possible) for you, therefor turn back. And certain of them (even) sought permission of the Prophet, saying: Our homes lie open (to the enemy). And they lay not open. They but wished to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Others said, \"People of Yathrib, you cannot withstand [the enemy] here: so go back!\" Yet others asked leave of the Prophet, saying, \"Our houses are exposed and [defenceless].\" They were in truth not exposed: they only wished to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: O inhabitants of Yathrib! there is no place for you, so return. And a part of them asked leave of the Prophet, saying: verily our houses lie open; whereas they lay not open; they only wished to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a group of them said, ‘O people of Yathrib! [This is] not a place for you, so go back!’ A group of them sought the Prophet’s permission [to leave the scene of battle], saying, ‘Our homes lie exposed [to the enemy],’ although they were not exposed. They only sought to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! A party among them said: \"Ye men of Yathrib! ye cannot stand (the attack)! therefore go back!\" And a band of them ask for leave of the Prophet, saying, \"Truly our houses are bare and exposed,\" though they were not exposed they intended nothing but to run away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: \"O people of Yathrib (AlMadinah)! There is no stand (possible) for you (against the enemy attack!) Therefore go back!\" And a band of them ask for permission of the Prophet (SAW) saying: \"Truly, our homes lie open (to the enemy).\" And they lay not open. They but wished to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: 'People of Yathrib (Madinah), there is no place for you here, therefore return' And a party of them asked leave of theProphet, saying: 'Our houses are exposed' whereas they were not, they only wished to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a group of them said, “O people of Yathrib, you cannot make a stand, so retreat.” And a faction of them asked the Prophet to excuse them, saying, “Our homes are exposed,” although they were not exposed. They only wanted to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a faction of them said, \"O people of Yathrib, there is no stability for you [here], so return [home].\" And a party of them asked permission of the Prophet, saying, \"Indeed, our houses are unprotected,\" while they were not exposed. They did not intend except to flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:13] And when a party of them, namely, the hypocrites, said, ‘O people of Yathrib!, namely, the region of Medina (it [Yathriba] is a diptote because of its being a proper noun and because of the [morphological similarity it bears to a] verbal form) there is not a stand [possible] (read muqām or maqām) for you [here], in other words, no place to stay and no [strategic] position, so turn back, to your dwellings in Medina — they had set out with the Prophet (s) towards the foot of a mountain outside Medina for battle. And a group of them [even] sought the permission of the Prophet, to turn back, saying, ‘Our homes are exposed, unprotected and we fear for them’. God, exalted be He, says: although they were not exposed. They only sought to flee, from battle.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when a party of them) from Banu Harithah Ibn al-Harth to their friends in the Ditch (said: folk of Yathrib!) they mean: people of Medina! (There is no stand (possible) for you) there is no place for you in the Ditch to fight, (therefore turn back) to Medina. (And certain of them) from the hypocrites among Banu Harithah ((even) sought permission of the Prophet) Allah bless him and give him peace, (saying) allow us, Prophet of Allah, to go back to Medina: (Our homes lie open (to the enemy)) there are no men in our homes and we fear that thieves may steal from them. (And they lay not open) and they are not without men. (They but wished to flee) from fighting.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰأَهْلَ يَثْرِبَ } يَثربُ: أَرضُ المَدينةِ\n ومَدينةُ النبي صلى الله عليه وعلى آلهِ وسلم في نَاحيةٍ مِن يَثرب\n\n\n\n\nوقوله تعالى: { لاَ مُقَامَ لَكُمْ } معناه لاَ مكانَ لَكُم تُقيمون فِيهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"O Ahl al-Yathrib,\" Yathrib is the land of Madinah.\n\n\nAnd the city of the Prophet (peace be upon him and his family) in a part of Yemen.\n\nAnd His saying, {There is no place for you [to stand]} [means that] there is no place for you to stand in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم يا أكمل الرسل { إِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ } أي: من منافقي المدينة، والذين في قلوبهم مرض وضعف اعتقاد ويقين من المؤمنين: { يٰأَهْلَ يَثْرِبَ } أي: أصحاب المدينة { لاَ مُقَامَ لَكُمْ } أي: لا يحسن إقامتكم الآن ومقاومتكم في مقابلة هذه الأحزاب؛ أذ هم ذوو عَدد وعُدد كثيرة، وأنتم شرذمة قليلون بالنسبة إليهم { فَٱرْجِعُواْ } عن دين محمد، وتشتتوا عن حوله؛ حى تسلموا من يد الأعادي { وَ } بعدما سمعوا قول أولئك المنافقين آمرين بالرجوع والارتداد صاروا مترددين متزلزلين في دينهم؛ حتى { يَسْتَئْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ يَقُولُونَ } معتذرين معللين للرجوع والذب عن حول النبي: { إِنَّ بُيُوتَنَا عَوْرَةٌ } غير حصينة، خالية عن المحافظ، فأذن لنا حتى نرجع إلى بيوتنا ونستحفظها { وَ } الحال أن بيوتهم { مَا هِيَ بِعَوْرَةٍ } بل هي حصينة محفوظة لا خلل فيها، بل { إِن يُرِيدُونَ } أي: ما يريدون ويقصدون من هذا القول { إِلاَّ فِرَاراً } [الأحزاب: 13] عن الزحف، وإعراضاً عن الدين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذ قالت طائفةٌ منهم } من المنافقين، وهم عبد الله بن أُبيّ وأصحابه: { يا أهلَ يثربَ } ، وهم أهل المدينة، { لا مقَام لكم } أي: لا قرار لكم هنا، ولا مكان تقيمون فيه - وقرأ حفص: بضم الميم - اسم مكان، أو مصدر، { فارجعوا } من عسكر رسول الله صلى الله عليه وسلم إلى المدينة هاربين، أو: إلى الكفر، فيمكنكم المقام بها، أو: لا مقام لكم على دين محمد، فارجعوا إلى الشرك وأظهروا الإسلام لتسلموا، { ويستأذن فريقٌ منهم النبيَّ } أي: بنو حارثة، { يقولون إن بيوتنا عورةٌ }: ذات عورة، أي: خالية غير حصينة، وهي مما يلي العدو\n وأصلها: الخلل\n وقرأ ابن عباس بكسر الواو: عَوِرَة، يعني: قصيرة الجدران، فيها خلل\n تقول العرب: دار فلان عورة إذا لم تكن حصينة، وعَوِرَ المكان: إذا بَدا فيه خلل يُخاف منه العدو والسارق، ويجوز أن يكون عَوْرَة: تخفيفَ عَوِرة\n اعتذروا أن بيوتهم عُرضة للعدو والسارق لأنها غير محصنة، فاستأذنوا ليحصنوها ثم يرجعوا إليه، فأكذبهم الله تعالى بقوله: { وما هي بعوْرةٍ } ، بل هي حصينة، { إن يريدون إلا فراراً } من القتل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:58",
      "similarity": 0.31050431077779256
    },
    {
      "verse": "24:31",
      "similarity": 0.16876496275876735
    },
    {
      "verse": "62:8",
      "similarity": 0.12728405742821988
    },
    {
      "verse": "51:50",
      "similarity": 0.12192054310248289
    },
    {
      "verse": "75:10",
      "similarity": 0.12167242554124076
    }
  ]
}