{
  "chapter": "الأحزاب",
  "text": "يايها النبى اتق الله ولا تطع الكفرين والمنفقين ان الله كان عليما حكيما",
  "translations": [
    {
      "translation": "O Prophet! have taqwa of Allah and do not obey the kafirun and hypocrites. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O PROPHET FEAR God and do not follow the unbelievers and the hypocrites.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear Allah and do not obey the unbelievers and the hypocrites. Verily Allah is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, have fear of God and do not yield to the infidels and hypocrites. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden (the Prophet), continue to fear Allah and never listen to the disbelievers and the hypocrites; indeed Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Have Taqwa of Allah, and obey not the disbelievers and the hypocrites. Verily, Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! be careful of (your duty to) Allah and do not comply with (the wishes of) the unbelievers and the hypocrites; surely Allah is Knowing, Wise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear God, and obey not the unbelievers and the hypocrites. God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Keep thy duty to Allah and obey not the disbelievers and the hypocrites. Lo! Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, have fear of God and do not yield to those who deny the truth and the hypocrites. God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! fear Allah and obey not the infidels and the hypocrites; verily Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Be wary of Allah and do not obey the faithless and the hypocrites. Indeed Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Fear Allah, and hearken not to the Unbelievers and the Hypocrites: verily Allah is full of Knowledge and Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Keep your duty to Allah, and obey not the disbelievers and the hypocrites (i.e., do not follow their advices). Verily! Allah is Ever AllKnower, AllWise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear Allah, and do not obey the unbelievers and the hypocrites. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Fear God, and do not obey the unbelievers and the hypocrites. God is Knowledgeable and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fear Allah and do not obey the disbelievers and the hypocrites. Indeed, Allah is ever Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:1] O Prophet! Fear God, remain in fear of Him, and do not obey the disbelievers and the hypocrites, [and so follow them] in what contravenes your Law. Truly God is Knower, of what will happens before it happens, Wise, in what He creates.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (O Prophet! Keep thy duty to Allah): '(O Prophet! Keep thy duty to Allah) He says: fear Allah in relation to breaking your pledge before the time of its expiry (and obey not the disbelievers) from among the people Mecca: Abu Sufyan Ibn Harb, 'Ikrimah Ibn Abi Jahl and Abu'l-A'war al-Aslami (and the hypocrites) of Medina: 'Abdullah Ibn Ubayy Ibn Salul, Mu'attib Ibn Qushayr and Jadd Ibn Qays; do not obey them in what they ask you to commit of transgression. (Lo! Allah is Knower) of what they say and of their intent to kill you, (Wise) He enjoined that one should honour one's pledge and forbade breaking pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها النبي اتقّ الله } بالفناء عن ذاتك بالكلية دون بقاء البقية { ولا تُطِع الكافرين } بموافقتهم في بعض الحجب لظهور الأنائية { والمنافقين } بالنظر إلى الغير فتكون ذا وجهين وبالانتهاء بحكم هذا النهي وصف بقوله:\n\n[النجم، الآية:17]، { إن الله كان عليماً } يعلم ذنوب الأحوال { حكيماً } في ابتلائك بالتلوينات فإنها تنفع في الدعوة وإصلاح أمر الأمة إذ لو لم يكن له تلوين لم يعرف ذلك من أمّته فلا يمكنه القيام بهدايتهم { واتّبع } في ظهور التلوينات { ما يوحى إليك من ربّك } من التأديبات وأنواع العتاب والتشديدات بحسب المقامات كما ذكر غير مرة في قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰأَيُّهَا ٱلنَّبِيُّ } المؤيَّد من عند العليم الحكيم مقتضى نبوتك التي صرت بها خاتماً لدائرة النبوة والرسالة، متمماً لمكارم الأخلاق، مكملاً لأمر التشريع والتدوين: التقوى والتحفظ من مقتضيات الأراء الباطلة، والأهواء الفاسدة، والتحصن بالله والثقة إليه، وجعله وقايتك عند نزول البلاء وهجوم الأعداء { ٱتَّقِ ٱللَّهَ } حق تقاته، واجتنب عما لا يرضى به ربك مطلقاً { وَلاَ تُطِعِ } في حال من الأحوال أمر { ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } الذين خاصموا معك في إسرارهم وإعلانهم، ولا تتبع أهواءهم الفاسدة وآراءهم الباطلة، وابتغ فيما آتاك الله من مقتضيات استعدادك، وما تفضل عليك امتناناً لك؛ لرضاء الله والفوز بشرف لقاء الله { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { كَانَ عَلِيماً } في حضرةة علمه الحضوري بقابليتك وبمقتضياتها { حَكِيماً } [الأحزاب: 1] في إفاضة ما يعينك وينبغي لك، ويليق بشأنك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها النبي } أي: المُشرِّف حالاً، المفخم قدراً، العلي رتبة لأن النبوة مشتقة من النَّبْوَةَ، وهو الارتفاع\n أو: يا أيها المخبرُ عنا، المأمون على وحينا، المبلغ خطابنا إلى أحبابنا\n وإنما لم يقل: يا محمد، كما قال: \" يا آدم، يا موسى \" تشريفاً وتنويهاً بفضله، وتصريحُه باسمه في قوله:\n\n[الفتح: 29]، ونحوه، ليعلم الناس بأنه رسول الله\n { اتقِ الله } أي: اثبت على تقوى الله، { ولا تُطع الكافرين والمنافقين } لا تساعدهم على شيء، واحترس منهم فإنهم أعداء لله وللمؤمنين\n رُوي أن أبا سُفيان بن حرب، وعكرمة بن أبي جهل، وأبا الأعور السُّلمي، نزلوا المدينة على ابن أُبيّ، رأس المنافقين، بعد أُحد، وقد أعطاهم النبيُّ صلى الله عليه وسلم الأمان على أن يكلموه، فقام معهم عبد الله بن أبي سَرْح، وطُعْمَة بن أُبيْرق، فقالوا للنبي صلى الله عليه وسلم، وعنده عمر بن الخطاب: ارفض ذكر آلهتنا اللات، والعزى، ومناة، وقل: إن لها شفاعة ومنفعة لِمن عَبَدَها، وندعك وَرَبَّك\n فشقّ على النبي صلى الله عليه وسلم قولهم، فقال عمر: ائذن لنا، يا رسول الله، في قتلهم، فقال صلى الله عليه وسلم:\n\n \" إني قد أعطيتهم الأمان \" \n\nفقال عمر: اخرُجوا في لعنة الله وغضبه، فخرجوا من المدينة، فنزلت\n أي: اتق الله في نقض العهد، ولا تُطع الكافرين من أهل مكة، كأَبي سفيان وأصحابه، والمنافقين من أهل المدينة، فيما طلبوا، { إن الله كان عليماً } بخبث أعمالهم، { حكيماً } بتأخير الأمر بقتالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:108",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:110",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:126",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:131",
      "similarity": 0.42302729618278667
    },
    {
      "verse": "26:144",
      "similarity": 0.42302729618278667
    }
  ]
}