{
  "chapter": "الأحزاب",
  "text": "ولو دخلت عليهم من اقطارها ثم سئلوا۟ الفتنة لءاتوها وما تلبثوا۟ بها الا يسيرا",
  "translations": [
    {
      "translation": "If they had been overrun from every side, and had then been asked to revert to kufr, they would have done so and hesitated very little about it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the (enemy) had entered the city from every side and asked them to rise in revolt, they would have done so, and not hesitated but a little;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the enemy were to enter the town from various directions, and they were summoned to act treacherously, they would have succumbed to it and would have shown little reluctance in doing so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the army of the enemies invaded their homes and asked them to give-up their religion, they would have yielded to them without delay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the armies had come upon them from the outskirts of Medinah and demanded disbelief from them, they would certainly have given them their demand and would not have hesitated in it except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the enemy had entered from all sides, and they had been exhorted to Al-Fitnah, they would surely have committed it and would have hesitated thereupon but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an entry were made upon them from the outlying parts of it, then they were asked to wage war, they would certainly have done it, and they would not have stayed in it but a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if entrance had been forced against them from those quarters, and then they had been asked to apostatise, they would have done so, and but tarried about it briefly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the enemy had entered from all sides and they had been exhorted to treachery, they would have committed it, and would have hesitated thereupon but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If their town had been stormed, and they had been incited to sedition, they would have rebelled with little hesitation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they were to be entered upon from the sides thereof and they were asked to sedition, they would surely have committed it, and they would have tarried therein but slightly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they been invaded from its flanks and had they been asked to apostatize, they would have done so with only a mild hesitation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an entry had been effected to them from the sides of the (city), and they had been incited to sedition, they would certainly have brought it to pass, with none but a brief delay!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the enemy had entered from all sides (of the city), and they had been exhorted to AlFitnah (i.e. to renegade from Islam to polytheism) they would surely have committed it and would have hesitated thereupon but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an entrance had been forced against them from its quarters, and then they had been asked to incite, they would have done so, and remained in it (the city) but a little (time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been invaded from its sides, and they were asked to dissent, they would have done so with little hesitation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had been entered upon from all its [surrounding] regions and fitnah had been demanded of them, they would have done it and not hesitated over it except briefly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:14] And had they been invaded in it, namely, Medina, from all sides and had they been exhorted, in other words, had the invaders exhorted them, to treachery, [a return to] idolatrous ways, they would have committed it (read la-ātawhā, or la-atawhā, meaning, ‘they would have offered it’, or ‘they would have committed it’ [respectively]) and would have hesitated thereupon but a little.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If the enemy had entered) in on the hypocrites in Medina (from all sides and they had been exhorted to treachery) to idolatry, (they would have committed it) they would have swiftly committed it, (and would have hesitated thereupon but little) they would not have hesitated to respond; it is also said that this means: they would have remained in Medina but a little while.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَوْ دُخِلَتْ عَلَيْهِمْ مِّنْ أَقْطَارِهَا } أي مِن جَوانبِها ونَواحِيها\n واحدُها قُطْرٌ\n\n\n\n\nوقوله تعالى: { ثُمَّ سُئِلُواْ ٱلْفِتْنَةَ لآتَوْهَا } الفِتنةُ: هي الكُفرُ وأَتَوْها: أعطوها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كما ضعفهم في الدين، وعدم تثبتهم ورسوخهم ي الاعتقاد واليقين: { لَوْ دُخِلَتْ عَلَيْهِمْ مِّنْ أَقْطَارِهَا } وحصنت جميع جوانبها، بحيث لا يمكن الظفر علكيها إلا لهؤلاء الأحزاب ولا لغيرهم من عساكر الأعداء { ثُمَّ } ب عدما تحصنت عليهم بيوتهم كذلك صاروا آمنين من ظفر العدو مطلقاً { سُئِلُواْ ٱلْفِتْنَةَ } أي: الارتداد عن الإيمان والإسلامن والنصر على المؤمنين { لآتَوْهَا } وأعطوها ألبتة هؤلاء الجهلة الضعفة، المتماثلين إلى الكفر ومؤاخاة الكفرة عن صميم فؤادهم، ولجاءوا بالردة عن الدين والقتال مع المسلمين على الفور { وَمَا تَلَبَّثُواْ } وتوقفوا { بِهَآ } أي: بإعطاء الفتنة والردة بعدما سئلوا عنها { إِلاَّ يَسِيراً } [الأحزاب: 14] أي: آناً واحداً إلاَّ زماناً مقدرا ما يفهمون سؤال السائل واقتراحه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو دُخِلَت عليهم } مدينتهم، أو: بيوتهم\n من قولك: دخلت على فلان داره\n { من أَقْطارها } ، من جوانبها، أي: ولو دَخلت هذه العساكر المتحزبة - التي يفرَّون خوفاً منها - مدينتَهم، أو بيوتهم، من نواحيها كلها ناهبين سارقين، { ثم سُئِلوا } عند ذلك الفزع، { الفتنةَ } أي: الردة والرجعة إلى الكفر ومقاتلة المسلمين، أو: القتال في العصبية، وهو أحسن لأنهم مسلمون، { لأتوها } لجاؤوها وفعلوا\n ومَن قرأ بالمد فمعناه: لأعطوها من أنفسهم، { وما تلبثوا بها } بإجابتها وإعطائها، أي: ما احتبسوا عنها { إلا يسيراً } ، أو: ما لبثوا بالمدينة، بعد ارتدادهم، إلا زماناً يسيراً، ثم يهلكهم الله لأن المدينة كالكير تنفي خبثها، وينصع طيبها، والمعنى أنهم يتعلّلون بإعوار بيوتهم ليفرُّوا عن نصرة رسول الله صلى الله عليه وسلم والمؤمنين، وعن مصافة الأحزاب الذين ملأوهم رُعباً، وهؤلاء الأحزاب كما هم لو سألوهم أن يقاتلوا فتنة وعصبية لأجابوهم، وما تعلّلوا بشيء، وما ذلك إلا لضعف إيمانهم، والعياذ بالله\n\n\nالإشارة: وإذ قالت طائفة من شيوخ التربية لأهل الفناء: لا مقام تقفون معه إذ قد قطعتم المقامات، حين تحققتم بمقام الفناء، فارجعوا إلى البقاء لتقوموا بآداب العبودية، وتنزلون في المقامات ثم ترحلون عنها، كما تنزل الشمس في بروجها، فكل وقت يبرز فيه ما يقتضي النزول إلى مقامه\n فتارة يبرز ما يقتضي التوبة، وتارة ما يقتضي الخوف والهيبة، أي: خوف القطيعة، وتارة ما يقتضي الرجاء والبسط، وتارة ما يقتضي الشكر، وتارة الصبر، وتارة ما يقتضي الرضا والتسليم، وتارة ما يهيج المحبة أو المراقبة أو المشاهدة\n وهكذا ينزل في المقامات ويرحل عنها، ولا يقيم في شيء منها\n ويستأذن بعض المريدين في الرجوع إلى مقامات الإيمان أو الإسلام، أو شيء من أمور البدايات، يقولون: إن بيوت تلك المقامات لم نُتقنها، بل فيها عورة وخلل، وما هي بعورة، ما يريدون إلا فراراً من ثِقَل أعباء الحضرة\n ولو دُخلت بيوت قلوبهم من أقطارها، ثم سئلوا الرجوع إلى الدنيا لأتوها لأنها قريبةُ عَهْدٍ بتركها، وما تلبّثوا بها إلا زماناً يسيراً، بل يبغتهم الموت، ويندمون، قل متاع الدنيا قليل، والآخرة خير لمَن اتقى\n وقد كانوا عاهدوا الله ألاّ يرجعوا إليها، كما قال تعالى: { وَلَقَدْ كَانُواْ عَاهَدُواْ ٱللَّهَ مِن قَبْلُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:50",
      "similarity": 0.37497368159928735
    },
    {
      "verse": "18:96",
      "similarity": 0.326127988563955
    },
    {
      "verse": "34:12",
      "similarity": 0.30993763004325714
    },
    {
      "verse": "55:33",
      "similarity": 0.25271537517112885
    },
    {
      "verse": "23:114",
      "similarity": 0.23476829167603755
    }
  ]
}