{
  "chapter": "الأحزاب",
  "text": "قل لن ينفعكم الفرار ان فررتم من الموت او القتل واذا لا تمتعون الا قليلا",
  "translations": [
    {
      "translation": "Say: 'Flight will not benefit you if you try to run away from death or being killed. Then you will only enjoy a short respite.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Of no gain will be your running away if you run from death or being killed, even then you will enjoy the good things of life but only for a while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), tell them: “If you run away from death or slaying, this flight will not avail you. You will have little time after that to enjoy (the pleasures of life).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"Running away will never be of any benefit to you even if you run away from death or being killed. Still you would not be able to enjoy yourselves except for a short while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Fleeing will never benefit you if you flee from death or killing, and even then you will not be given the usage of this world except a little.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Flight will not avail you if you flee from death or killing and then you will enjoy no more than a little while!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Flight shall not do you any good if you fly from death or slaughter, and in that case you will not be allowed to enjoy yourselves but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Flight will not profit you, if you flee from death or slaying; you will be given enjoyment of days then but little.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Flight will not avail you if ye flee from death or killing, and then ye dwell in comfort but a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Flight shall not avail you: if you manage to escape from death or killing, you will enjoy life only for a short while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: flight shall not profit you if ye flee from death or slaughter, and lo! ye will not enjoy life except for a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Flight will not avail you, if you flee from death, or from being killed, and then you will be let to enjoy only for a little while.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Running away will not profit you if ye are running away from death or slaughter; and even if (ye do escape), no more than a brief (respite) will ye be allowed to enjoy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these hypocrites who ask your permission to run away from you): \"Flight will not avail you if you flee from death or killing, and then you will enjoy no more than a little while!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Flight will not avail you, if you flee from death or slaughter, you would enjoy (this world) only for a little (time)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Flight will not benefit you, if you flee from death or killing, even then you will be given only brief enjoyment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Never will fleeing benefit you if you should flee from death or killing; and then [if you did], you would not be given enjoyment [of life] except for a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:16] Say: ‘Flight will not avail you should you flee from death or [from] being slain, and then, if you were to flee, you would not be extended comfort, in this world, after you have fled, except a little’, [except for] the remainder of your terms [of life]. 1756381685\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to Banu Harithah: (Flight will not avail you if ye flee from death or killing, and then ye dwell in comfort) you will not live in the life of this world (but a little while) a short time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } لهم يا أكمل الرسل بعدما تحقق عندك قصد فرارهم وذبهم عنك: { لَّن يَنفَعَكُمُ ٱلْفِرَارُ } أبداً، بل { إِن فَرَرْتُمْ } من ضعف يقينكم، ووهو اعتقادكم { مِّنَ ٱلْمَوْتِ } حتف الأنف، كما يفر الناس من الطاعون والوباء والزلزلة وغير ذلك { أَوِ ٱلْقَتْلِ } في يم الوغاء { وَإِذاً } أي: بعدما تفرون حينئذٍ { لاَّ تُمَتَّعُونَ } تمتيعاً كثيراً مؤبداً، بل ما تمتعون { إِلاَّ قَلِيلاً } [الأحزاب: 16] في زمان قليل؛ إذ لكل منكم أجل، ولكل أجل قضاء وانقضاء، ولا دوام إلا لمن هو متعال عن الأجل والقضاء والانقضاء، منزه عنه الابتداء والانتهاء، وعن الإعادة والإبداء، مقدس عن تعديد الأزمنة وتحديد الأمكنة مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:50",
      "similarity": 0.6708262946229129
    },
    {
      "verse": "71:6",
      "similarity": 0.6480041166361497
    },
    {
      "verse": "80:34",
      "similarity": 0.6124985771294913
    },
    {
      "verse": "62:8",
      "similarity": 0.5985753785047655
    },
    {
      "verse": "75:10",
      "similarity": 0.5791787566794373
    }
  ]
}