{
  "chapter": "الأحزاب",
  "text": "هنالك ابتلى المؤمنون وزلزلوا۟ زلزالا شديدا",
  "translations": [
    {
      "translation": "at that point the muminun were tested and severely shaken.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful were sorely tried there and were shaken completely,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers were then put to a severe test and were most violently convulsed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There the believers were tested and tremendously shaken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That proved be the testing ground for the Muslims, and they were subjected to a severe shake.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, the believers were tried and shaken with a mighty shaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There the believers were tried and they were shaken with severe shaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there it was that the believers were tried, and shaken most mightily.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There were the believers sorely tried, and shaken with a mighty shock.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There the faithful were put to the proof and they were shaken as if by an earthquake.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There were the believers proven and shaken with a mighty shaking\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it was there that the faithful were tested and jolted with a severe agitation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that situation were the Believers tried: they were shaken as by a tremendous shaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, the believers were tried and shaken with a mighty shaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there the believers were tried, they were shaken, a severe quake.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There and then the believers were tested, and were shaken most severely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There the believers were tested and shaken with a severe shaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:11] it was there that the believers were [sorely] tried, [there] they were tested, to distinguish the sincere individual from the one otherwise, and were shaken with a mighty shock, because of the severity of the terror.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There) at that point of fear (were the believers sorely tried) they were tested with a trial, (and shaken with a mighty shock) they were terribly exhausted and violently moved.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { هُنَالِكَ ٱبْتُلِيَ ٱلْمُؤْمِنُونَ } وجرِّبوا واختُبروا؛ كي يتيمز المخلص منهم من المنافق، والثابت الراسخ من المتردد المتزلزل { وَ } لذلك { زُلْزِلُواْ زِلْزَالاً شَدِيداً } [الأحزاب: 11] من شدة الفزع والهول المفرط إلى حيث كاد أن يخرج أرواحهم من أجسادهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { هنالك ابْتُلي المؤمنون } أي: اختبروا، فظهر المخلص من المنافق، والثابت من المزلزل، { وزُلزلوا زلزالاً شديداً } وحُركوا بالخوف، تحريكاً شديداً\n الإشارة: يا أيها الذين آمنوا إيمان الخصوص اذكروا نعمة الله عليكم بالتأييد والنصر، فحين تَوَجَّهْتُمْ إليّ، ودخلتم في طريق ولايتي، رفضتكم الناس، ونكرتكم، ورمتكم عن قوس واحدة، فجاءتكم جنود الخواطر والوساوس من كل جانب، حتى هممتم بالرجوع أو الوقوف\n\n\nوإذ زاغت الأبصار: مالت عن قصدها بالاهتمام بالرجوع، وبلغت القلوبُ الحناجرَ، ممن كان ضعيف الإرادة واليقين، وتظنون بالله الظنونا، فمنهم مَن يظن الامتكان بعد الامتحان، فيفرحون بالبلاء، ومنهم مَن يظن أنه عقوبة\n\n\n إلى غير ذلك، هنالك ابتلي المؤمنون المتوجهون ليظهر الصادق، في الطلب، من الكاذب فيه، فعند الامتحان يعز المرء أو يُهان، ويظهر الخَوّافون من الشجعان، وزُلزلوا زلزالاً شديداً ليتخلصوا ويتمحصوا، كما يتخلص الذهب والفضة من الناس، ومَن عرف ما قصد هان عليه ما ترك\n قال القشيري: { يا أيها الذين آمنوا اذكروا نعمة الله عليكم\n\n } يعني: بمقابلتها بالشكر، وتَذَكُّرِ ما سَلَفَ من الذي دفع عنك، يهون عليك مقاساة البلاءِ في الحال\n وبذكرك لما أولاك في الماضي يقرب من الثقة بوصول ما تؤمِّلهُ في الاستقبال\n فمن جملة ما ذكّرهم قوله: { إذ جاءتكم جنود\n\n } الآية: كم بلاء صَرَفَه عن العبد وهو لا يشعر، وكم شغل كنت بصدده، فصدّه عنك ولم تعلم، وكم أمر صرفه، والعبد يضج، وهو - سبحانه - يعلم أن في تيسيره هلاكَه، فيمنعه منه رحمة عليه، والعبد يتهمه ويضيق به صَدْرُه\n هـ\n ثم ذكر سبحانه نتيجة الابتلاء فقال: { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ\n\n\n }\n",
      "translations": []
    }
  ]
}