{
  "chapter": "الأحزاب",
  "text": "قل من ذا الذى يعصمكم من الله ان اراد بكم سوءا او اراد بكم رحمة ولا يجدون لهم من دون الله وليا ولا نصيرا",
  "translations": [
    {
      "translation": "Say: 'Who is going to shield you from Allah if He desires evil for you or desires mercy for you?' They will find no one to protect or help them besides Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who will save you from God if He decide to afflict you or show you His mercy?\" They will never find a friend or helper apart from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to them): “Who can protect you from Allah if He desires an evil for you? And who can prevent Him if He desires to show mercy to you?” They shall find none other than Allah to be their protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who can prevent God from punishing you or granting you mercy? They will not find anyone besides God as their guardian or helper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who is he who can avert the command of Allah from you, if He wills harm for you or wills to have mercy upon you?” And other than Allah, they will not find any friend or supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is he who can protect you from Allah if He intends to harm you, or intends mercy on you\" And they will not find, besides Allah, for themselves any protector or any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is it that can withhold you from Allah if He intends to do you evil, rather He intends to show you mercy? And they will not find for themselves besides Allah any guardian or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who is he that shall defend you from God, if lie desires evil for you, or desires mercy for you?' They shall find for themselves, apart from God, neither protector nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is he who can preserve you from Allah if He intendeth harm for you, or intendeth mercy for you. They will not find that they have any friend or helper other than Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is there to shield you from God if He wishes to harm you? If God wishes to show you mercy, who can prevent Him.\" Besides God they shall find none to protect them, and none to bring them succour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who is there that will protect you from Allah if He intendeth to bring evil on you or intendeth mercy for you? And they shall not find for themselves, besides Allah, a patron or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who is it that can protect you from Allah if He desires to cause you harm or desires to grant you His mercy?’ Besides Allah they will not find for themselves any protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is it that can screen you from Allah if it be His wish to give you punishment or to give you Mercy?\" Nor will they find for themselves, besides Allah, any protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is he who can protect you from Allah if He intends to harm you, or intends mercy on you?\" And they will not find, besides Allah, for themselves any Wali (protector, supporter, etc.) or any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who can defend you from Allah if He desires harm for you, or if He desires mercy for you' They shall find for themselves none, other than Allah, to protect or help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who is it who will shield you from God, if He intends adversity for you, or intends mercy for you?” Besides God, they will find for themselves neither friend nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is it that can protect you from Allah if He intends for you an ill or intends for you a mercy?\" And they will not find for themselves besides Allah any protector or any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:17] Say: ‘Who is it that can protect you, grant you sanctuary, from God should He desire [to cause] you ill, [whether it be] destruction or defeat, or, [who is it that] can cause you ill, should He, God, desire for you mercy?’, good. And they shall not find for themselves besides God, in other words, other than God, any protector, to avail them, or helper, to ward off harm from them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to Banu Harithah: (Who is he who can preserve you from Allah) from Allah's chastisement (if He intendeth harm for you) if He intends to punish you by killing you, (or intendeth mercy for you) or intends well-being for you by sparing you from being killed. (They will not find) i.e. Banu Harithah (that they have any friend or helper other than Allah) that they have anyone to spare them from or help them against Allah's chastisement. 474\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن جادلوا معك يا أكمل الرسل، وعاندوا بالفرار والتحصن ننجي من العدو وإهلاكه بحيث لا تبقى لهم يد علينا { قُلْ } لهم يا أكمل الرسل على سبيل التبكيت والإلزام: { مَن ذَا ٱلَّذِي يَعْصِمُكُمْ } ويحفظكم ويحرزكم { مِّنَ } قهر { ٱللَّهِ } وعذابه { إِنْ أَرَادَ بِكُمْ سُوۤءاً } أي: إصابة بلاء وشدة ومحنة { أَوْ } من ذا الذي يمنع نعكم لطفه سبحانه إن { أَرَادَ بِكُمْ رَحْمَةً } عطفاً ومحبةً؟! { وَ } بالجملة: { لاَ يَجِدُونَ } أولئك المتذبذبون المتضعفون { لَهُمْ } أي: لأنفسهم المراقب عليهم في جميع أحوالهم { مِّن دُونِ ٱللَّهِ } يولي أمور تحصنهم وتحفظهم { وَلِيّاً وَلاَ نَصِيراً } [الأحزاب: 17] ينصرهم على أعدائهم، وبالجملة: جميع أعمال العباد وأفعالهم مفوضة إلى الله أولاً وبالذات، مقهورة تحت قدرته الكاملة، فلهم أن يفوضوها إليه؛ ليسلموا من غوائل العناد والإصرار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:33",
      "similarity": 0.6728496023411877
    },
    {
      "verse": "5:67",
      "similarity": 0.6095839985980305
    },
    {
      "verse": "3:101",
      "similarity": 0.5764051685576043
    },
    {
      "verse": "4:175",
      "similarity": 0.5736442757754019
    },
    {
      "verse": "4:146",
      "similarity": 0.4997225627220931
    }
  ]
}