{
  "chapter": "الأحزاب",
  "text": "ورد الله الذين كفروا۟ بغيظهم لم ينالوا۟ خيرا وكفى الله المؤمنين القتال وكان الله قويا عزيزا",
  "translations": [
    {
      "translation": "Allah sent back those who were kafir in their rage without their achieving any good at all. Allah made saved the muminun from having to fight. Allah is Most Strong, Almighty.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God drove the unbelievers back in their fury, and they gained no advantage. God was sufficient (to help) the believers in the battle. God is all-powerful and all-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sent back the unbelievers empty-handed, their hearts seething with rage. Allah sufficed the believers in their fight. Allah is Most Powerful, Most Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God repelled the unbelievers in their rage. They could not achieve anything good. God rendered sufficient support to the believers in fighting. God is All-powerful and Majestic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah turned back the disbelievers in their hearts’ jealousy, gaining no good; and Allah sufficed the Muslims in their fight; and Allah is Almighty, Most Honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah drove back those who disbelieved in their rage: they gained no advantage. Allah sufficed for the believers in the fighting. And Allah is Ever All-Strong, All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah turned back the unbelievers in their rage; they did not obtain any advantage, and Allah sufficed the believers in fighting; and Allah is Strong, Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God sent back those that were unbelievers in their rage, and they attained no good; God spared the believers of fighting. Surely God is All-strong, All-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah repulsed the disbelievers in their wrath; they gained no good. Allah averted their attack from the believers. Allah is ever Strong, Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God turned back those who denied the truth in their rage, without their having gained any advantage. God was enough to [protect] the believers in battle. God is strong and all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah drave baCk those who disbelieved in their rage; they obtained no advantage, and Allah sufficed for the believers in the fighting; and Allah is ever Strong, Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sent back the faithless in their rage, without their attaining any advantage, and Allah spared the faithful of fighting, and Allah is all-strong, all-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah turned back the Unbelievers for (all) their fury: no advantage did they gain; and enough is Allah for the believers in their fight. And Allah is full of Strength, able to enforce His Will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah drove back those who disbelieved in their rage, they gained no advantage (booty, etc.). Allah sufficed for the believers in the fighting (by sending against the disbelievers a severe wind and troops of angels). And Allah is Ever AllStrong, AllMighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sent back the unbelievers in their rage, and they gained no good. Allah spared the believers from fighting, surely Allah is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God repelled the disbelievers in their rage; they gained no advantage. God thus spared the believers combat. God is Strong and Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah repelled those who disbelieved, in their rage, not having obtained any good. And sufficient was Allah for the believers in battle, and ever is Allah Powerful and Exalted in Might.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:25] And God repulsed those who were disbelievers, namely, the confederates, in their rage, without their attaining any good, [without achieving] their desire in any way to triumph over the believers. And God spared the believers from fighting, by [unleashing] the wind and the angels. And truly God is Strong, in bringing about what He wants, Mighty, prevailing with His way.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَرَدَّ اللَّهُ الَّذِينَ كَفَرُوا بِغَيْظِهِمْ لَمْ يَنَالُوا خَيْرًا وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا (25)عطف على جملة { فأرسلنا عليهم ريحاً } \\[ الأحزاب : 9 \\] وهو الأنسب بسياق الآيات بعدها ، أي أرسل الله عليهم ريحاً وردّهم ، أو حال من ضمير { يحسبون الأحزاب لم يذهبوا } \\[ الأحزاب : 20 \\] ، أي : يحسبون الأحزاب لم يذهبوا وقد رد الله الأحزاب فذهبوا .والرد : الإرجاع إلى المكان الذي صُدر منه فإنَّ ردهم إلى ديارهم من تمام النعمة على المسلمين بعد نعمة إرسال الريح عليهم لأن رجوعهم أعمل في اطمئنان المسلمين . وعُبر عن الأحزاب بالذين كفروا للإيماء إلى أن كفرهم هو سبب خيبتهم العجيبة الشأن .والباء في { بغيظهم } للملابسة ، وهو ظرف مستقرّ في موضع الحال ، أي : ردهم مُغِيظين .وإظهار اسم الجلالة دون ضمير المتكلم للتنبيه على عظم شأن هذا الرد العجيب كما تقدم في قوله تعالى : { ليجزي الله الصادقين بصدقهم } \\[ الأحزاب : 24 \\] .والغيظ : الحَنق والغضب ، وكان غضبهم عظيماً يناسب حال خيبتهم لأنهم تجشموا كلفة التجمّع والإنفاق وطولِ المكث حول المدينة بلا طائل وخابت آمالهم في فتح المدينة وأكل ثمارها وإفناء المسلمين ، وهم يحسبون أنها منازلة أيام قليلة ، ثم غاظهم ما لحقهم من النكبة بالريح والانهزام الذي لم يعرفوا سببه .وجملة { لم ينالوا خيراً } حال ثانية . ولك أن تجعل جملة { لم ينالوا خيراً } استئنافاً بيانياً لبيان موجب غيظهم .و { كفى } بمعنى أغنى ، أي : أراحهم من كلفة القتال بأن صرف الأحزاب . و { كفى } بهذا المعنى تتعدى إلى مفعولين يقال : كفيتُك مُهمك وليست هي التي تزاد الباء في مفعولها فتلك بمعنى : حسب .وفي قوله { وكفى الله المؤمنين القتال } حذف مضاف ، أي كلفة القتال ، أو أرزاء القتال ، فإن المؤمنين كانوا يومئذ بحاجة إلى توفير عددهم وعُددهم بعد مصيبة يوم أُحُد ولو التقوا مع جيش المشركين لكانت أرزاؤهم كثيرة ولو انتصروا على المشركين .والقول في إظهار اسم الجلالة في قوله { وكفى الله المؤمنين القتال } كالقول في { وردّ اللَّه الذين كفروا بغيظهم .وجملة { وكان الله قوياً عزيزاً } تذييل لجملة { وردّ الله الذين كفروا } إلى آخرها .والقوة : القدرة ، وقد تقدمت في قوله { لو أنّ لي بكم قوة } في سورة \\[ هود : 80 \\] .والعزة : العظمة والمنعة ، وتقدمت في قوله تعالى : { أخذته العزّة بالإثم } في سورة \\[ البقرة : 206 \\] .وذكر فعل { كان } للدلالة على أن العزة والقوة وصفان ثابتان لله تعالى ، ومن تعلُّقات قوتِه وعزته أن صرف ذلك الجيش العظيم خائبين مفتضحين وألقى بينه وبين أحلافه من قريظة الشك ، وأرسل عليهم الريح والقرّ ، وهدَى نُعيماً بن مسعود الغطفاني إلى الإسلام دون أن يشعر قومه فاستطاع النصح للمسلمين بالكَيد للمشركين . ذلك كله معجزة للنبي صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "(And Allah repulsed the disbelievers) of Mecca: Abu Sufyan and his host (in their wrath) in their rancour; (they gained no good) they gained no happiness, booty or the upper hand. (Allah averted their attack from the believers) Allah relieved the believers from fighting by sending the wind and the angels. (Allah is Strong) in helping the believers, (Mighty) in retribution against the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال لطف الله على المؤمنين\n ووفور رحمته وإحسانه عليهم { رَدَّ ٱللَّهُ } عنهم كيد أعدائهم { ٱلَّذِينَ كَفَرُواْ } يعني: الأحزاب المزدحمين حواليهم\n المتفقين على مقتهم { بِغَيْظِهِمْ } أي: مع كمال غيظهم في مقت المؤمنين\n ووفور تهورهم وجرأتهم عليك\n لذلك طردهم سبحانه خائبين خاسرين\n بحيث { لَمْ يَنَالُواْ خَيْراً } مما أملوا في نفوسهم من الظفر على المؤمنين واستئصالهم { وَ } من كمال رأفته سبحانه عل المؤمنين: { كَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } أي: مؤنة قتال الأحزاب بريح الصبا وجنود الملائكة\n بحيث لم يقدم أحد من المؤمنين لقتالهم فانهزموا إلى حيث لم يلتفت أحد منهم خلفه\n ولم يعاون أخاه { وَ } ليس ببدع من الله أمثال هذه الكرامات لأنبيائه وأوليائه\n إذ { كَانَ ٱللَّهُ } المراقب لأحوال عباده { قَوِيّاً } قديراً في نفسه يقوي أولياءه { عَزِيزاً } [الأحزاب: 25] غالباً ينصرهم ويغلبهم على أعدائهم فضلاً لهم وكرامةً عليهم\n\n\n{ وَ } بعدما كفى الله المؤمنين مؤنة الأحزاب أراد أن يكفيهم مؤنة معاوينهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وَرَدَّ اللهُ الذين كفروا } أي: الأحزاب { بغَيْظِهم } ملتبسين بغيظهم\n فهو حال كقوله:\n[المؤمنون: 20] أي: ردهم غائظين { لم ينالوا خيراً } ظفراً\n أي: لم يظفروا بالمسلمين\n وسمّاه \" خيراً \" بزعمهم\n وهو أيضاً حال\n أي: غير ظافرين\n { وكفى اللهُ المؤمنين القتال } بالريح\n والملائكة\n { وكان اللهُ قوياً عزيزاً } قادراً غالباً\n فقهرهم بقدرته وغلبهم بقهريته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:55",
      "similarity": 0.4917026447090388
    },
    {
      "verse": "9:15",
      "similarity": 0.4416647627128948
    },
    {
      "verse": "3:92",
      "similarity": 0.4164543388540257
    },
    {
      "verse": "7:49",
      "similarity": 0.41084299004546077
    },
    {
      "verse": "7:152",
      "similarity": 0.3469641607996794
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}