{
  "chapter": "الأحزاب",
  "text": "من المؤمنين رجال صدقوا۟ ما عهدوا۟ الله عليه فمنهم من قضى نحبه ومنهم من ينتظر وما بدلوا۟ تبديلا",
  "translations": [
    {
      "translation": "Among the muminun there are men who have been true to the contract they made with Allah. Some of them have fulfilled their pact by death and some are still waiting to do so, not having changed in any way at all.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are men among the faithful who have been true to the covenant they had made with God; and some of them fulfilled their vows (by dying in His cause), and some still wait (prepared for death), and stand firm,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers there are those who have remained true to the covenant they made with Allah. Among those some of them have fulfilled their vow and others await the appointed time. They have not changed in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers there are people who are true in their promise to God. Some of them have already passed away and some of them are waiting. They never yield to any change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Muslims are the men who have proved true what they had covenanted with Allah; so among them is one who has already fulfilled his vow, and among them is one still waiting; and they have not changed a bit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers are men who have been true to their covenant with Allah; of them some have fulfilled their Nahbah; and some of them are still waiting, but they have never changed in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the believers are men who are true to the covenant which they made with Allah: so of them is he who accomplished his vow, and of them is he who yet waits, and they have not changed in the least\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers are men who were true to their covenant with God; some of them have fulfilled their vow by death, and some are still awaiting, and they have not changed in the least;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the believers are men who are true to that which they covenanted with Allah. Some of them have paid their vow by death (in battle), and some of them still are waiting; and they have not altered in the least;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers there are men who have been true to the pledge they made with God. Among them are such as have fulfilled their vow, and some who [still] wait, without having changed [their resolve] in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the believers are men who have fulfilled that which they covenaned with Allah. Some of them have performed their vow, and some of them are waiting, so and they have not changed in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the faithful are men who fulfill what they have pledged to Allah: there are some among them who have fulfilled their pledge, and some of them who still wait, and they have not changed in the least,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Believers are men who have been true to their covenant with Allah: of them some have completed their vow (to the extreme), and some (still) wait: but they have never changed (their determination) in the least:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers are men who have been true to their covenant with Allah [i.e. they have gone out for Jihad (holy fighting), and showed not their backs to the disbelievers], of them some have fulfilled their obligations (i.e. have been martyred), and some of them are still waiting, but they have never changed [i.e. they never proved treacherous to their covenant which they concluded with Allah] in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers there are men who have been true to their covenant with Allah. Some have fulfilled their vow dying, and others await, unyielding tochange,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the believers are men who are true to what they pledged to God. Some of them have fulfilled their vows; and some are still waiting, and never wavering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers are men true to what they promised Allah. Among them is he who has fulfilled his vow [to the death], and among them is he who awaits [his chance]. And they did not alter [the terms of their commitment] by any alteration -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:23] Among the believers are men who are true to the covenant they made with God, in steadfastly remaining alongside the Prophet (s). Some of them have fulfilled their vow, having died or been killed [fighting] for God’s cause, and some are still awaiting, for this [fate], and they have not changed, [their commitment to] the covenant, in the least, and they stand in contrast to the situation with the hypocrites;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Of the believers are men who are true) loyal (to that which they covenanted with Allah. Some of them have paid their vow by death (in battle)) such as Hamzah Ibn 'Abd al-Muttalib, uncle of the Prophet (pbuh) and his fellow believers who died fighting, (and some of them still are waiting) they will continue to be loyal until they die; (and they have not altered) the covenant (in the least) by breaking it;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } معناه نِذْرُهُ\n والنَّحبُ: المَوتُ\n والنَّحبُ: الخَطرُ العَظيمُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {But among them is he who has given his life to Allah } its meaning is his vow.\n And love: death.\n\n\nThe love: the great danger.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن غاية خلوصهم في إيمانهم وتسليمهم { مِّنَ ٱلْمُؤْمِنِينَ } المشمرين لإعلاء دين الله ونصرة رسوله على العزيمة الكاملة الصادقة { رِجَالٌ } أبطال كاملون في الإخلاص والشجاعة والوفاء { صَدَقُواْ } في جميع { مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ } أي: نجزوا مواثيقهم، ووفوا عموم عهودهم التي عهدوا مع الله ورسوله من الثبات على العزيمة، والتصبر في المعركة، وعدم التزلزل من المحل الذي عين لهم الرسول صلى الله عليه وسلم في صف القتلا، ولم يجنبوا ولم يضعفوا أصلاً\n\n\n\n\n{ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } ووفى نذره بأن قاتل مع أعداء الله على مقتضى ما عاهد ونذر حتى استشهد ووصل إلى مرامه ومبتغاه، كحمزة ومصعب بن عمير وأنس بن النضر - رضون الله عليهم أجمعين - { وَمِنْهُمْ مَّن يَنتَظِرُ } الشهادة، كعثمان وطلحة فقاتلوا مع الأعداء وقتلوهم، ونجواو منهم سالمين منتظرين إلى قتال آخر؛ ليستشهدوا فيه { وَ } من كمال تثبتهم وتمكنهم في تعيينهم، وإخلاصهم في إيمانهم: { مَا بَدَّلُواْ } من النذور والعهود التي أتوا بها عازمين عليها جازمين، ولا أضمروا في أنفسهم، كالمنافقين { تَبْدِيلاً } [الأحزاب: 23] شيئاً حقيراً من التبدل والنقص، فكيف بالعظيم الكثير؟! بل زادوها وأكدوها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { من المؤمنين رجال صَدَقوا ما عاهدوا اللهَ عليه } أي: صدقوا فيما عاهدوه، فحذف الجار، وأوصل المفعول إلى \" ما \" وذلك أن رجالاً من الصحابة نَذَرُوا أنهم إذا لقوا حرباً مع رسول الله صلى الله عليه وسلم ثبتوا، وقاتلوا حتى يُسْتَشْهَدُوا، وهم: عثمان بن عفان، وطلحة، وسعيد بن زيد، وحمزة، ومصعب، وأنس بن النضر، وغيرهم\n { فمنهم مَن قضى نَحْبهُ } نذره بأن قاتل حتى استشهد كحمزة، ومصعب، وأنس بن النضر\n والنَّحْبُ: النذر، واستعير للموت لأن كل حي من المحدثات لا بد له أن يموت، فكأنه نذرٌ لازم في رقبته، فإذا مات فقد قضى نحبه، أي: نذره\n وقال في الصحاح: النحب: النذر، ثم قال: والنَّحْبَ: المدة والوقت\n يقال: قضى فلان نَحْبَه، إذا مات\n هـ\n فهو لفظ مشترك بين النذر والموت\n وصحح ابنُ عطية أن النحب الذي في الآية ليس من شرطه الموت\n بل معناه: قَضَى نذره الذي عاهد الله عليه من نصرة الدين، سواء قُتل أو بقي حيًّا\n\n\nبدليل قوله - عليه الصلاة والسلام - في طلحة:\n\n \" هذا ممن قَضَى نَحْبَه \" \n\nهـ\n { ومنهم مَن ينتظرُ } أي: الموت على الشهادة كعثمان وطلحة، { وما بدّلوا } العهد { تبديلا } ولا غيَّروه، لا المسْتَشْهَد، ولا مَن ينتظر الشهادة\n وفيه تعريض بمَن بدّل من أهل النفاق، كقوله تعالى فيما مر:\n\n[الأحزاب: 15]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:183",
      "similarity": 0.06366130023971119
    },
    {
      "verse": "9:75",
      "similarity": 0.06188790359188784
    },
    {
      "verse": "3:77",
      "similarity": 0.05610827673133309
    },
    {
      "verse": "6:115",
      "similarity": 0.051728783421874196
    },
    {
      "verse": "2:80",
      "similarity": 0.05004760559714689
    }
  ]
}