{
  "chapter": "الأحزاب",
  "text": "ولما رءا المؤمنون الاحزاب قالوا۟ هذا ما وعدنا الله ورسوله وصدق الله ورسوله وما زادهم الا ايمنا وتسليما",
  "translations": [
    {
      "translation": "When the muminun saw the Confederates they said: 'This is what Allah and His Messenger promised us. Allah and His Messenger told us the truth.' It only increased them in iman and in submission.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the faithful saw (the armies of) the allied tribes, they said: \"This is what God and His Apostle had promised us; and God and His Apostle say the truth;\" and this enhanced their faith and obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the true believers, when they saw the invading confederates, they cried out: “This is what Allah and His Messenger had promised us, and what Allah and His Messenger said was absolutely true.” This only increased their faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On seeing the confederate tribes, the believers said, \"This is what God and His Messenger had promised us. The promise of God and His Messenger is true.\" This only strengthens their faith and their desire of submission to the will of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Muslims saw the armies, they said, “This is what Allah and His Noble Messenger promised us, and Allah and His Noble Messenger have spoken the truth”; and it did not increase anything for them but faith and acceptance of Allah’s will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the Confederates, they said: \"This is what Allah and His Messenger had promised us; and Allah and His Messenger had spoken the truth.\" And it only added to their faith and to their submissiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the allies, they said: This is what Allah and His Apostle promised us, and Allah and His Apostle spoke the truth; and it only increased them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers saw the Confederates they said, 'This is what God and His Messenger promised us, and God and His Messenger have spoken truly.' And it only increased them in faith and surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the true believers saw the clans, they said: This is that which Allah and His messenger promised us. Allah and His messenger are true. It did but confirm them in their faith and resignation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers saw the confederates, they said, \"This is what God and His Messenger have promised us. Surely the promise of God and His Messenger has come true.\" It served to increase them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the confederates, they said: this is that which Allah and His apostle had promised us; and Allah and His apostle had spoken the truth. And it only increased them in belief and in self-surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the faithful saw the confederates, they said, ‘This is what Allah and His Apostle had promised us, and Allah and His Apostle were true.’ And it only increased them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Believers saw the Confederate forces, they said: \"This is what Allah and his Messenger had promised us, and Allah and His Messenger told us what was true.\" And it only added to their faith and their zeal in obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw AlAhzab (the Confederates), they said: \"This is what Allah and His Messenger (Muhammad SAW) had promised us, and Allah and His Messenger (Muhammad SAW) had spoken the truth, and it only added to their faith and to their submissiveness (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers saw the confederates they said: 'This is what Allah and His Messenger have promised us. Surely, Allah and His Messenger have spoken in truth' And this did not increase them except in belief and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the confederates, they said, “This is what God and His messenger have promised us; and God and His messenger have told the truth.” And it only increased them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the companies, they said, \"This is what Allah and His Messenger had promised us, and Allah and His Messenger spoke the truth.\" And it increased them only in faith and acceptance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:22] And when the believers saw the confederates, of disbelievers, they said, ‘This is what God and His Messenger promised us, in the way of trial and [assistance to] victory, and God and His Messenger were truthful’, about the promise. And that only increased them in faith, in belief in God’s promise, and submission, to His command.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the attributes of sincere believers, saying: (And when the true believers) the sincere believers (saw the clans) the disbelievers of Mecca: Abu Sufyan and his host, (they said: This is that which Allah and His messenger promised us) for the counting of days. (Allah and His messenger are true) in their promise, this is because the Prophet (pbuh) had informed them that the Clans will come and remain for nine to ten days, i.e. up to nine or ten days. (It) seeing the disbelievers (did but confirm them in their faith) it increased their certitude in the words of Allah and in the words of His Messenger (and resignation) to the command of Allah and to the command of the Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وما زادهم } أي: وقوع البلاء بالأحزاب { إلاّ إيماناً وتسليماً } لقوّة اعتقادهم في البداية وصحة متابعتهم في التسليم ففازوا بمقام الفتوة والانخلاع بالبلاء وعن قيود النفس لسلامة الفطرة\n فوصفهم بالوفاء الذي هو كمال مقام الفتوة\n وسماهم رجالاً على الحقيقة بقوله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والعفو عند القدرة وغير ذلك من الخصائل الحميدة والأخلاق الجميلة المرضية { وَ } من شدة تأثير هذه الخصائل الجميلة في قلوب المؤمنين { لَمَّا رَأَى ٱلْمُؤْمِنُونَ } المخلصون { ٱلأَحْزَابَ } حواليهم { قَالُواْ } متذكرين لوعد الله\n متثبتين على دينه\n متشمرين لإعلاء كلمة توحيده: { هَـٰذَا } الوقت وقت إنجاز { مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } من النصر والغلبة على الأعداء\n والفوز بأنواع الغنائم والعطاء عاجلاً وآجلاً بقوله سبحانه:\n[البقرة: 214] وقوله عليه السلام:\n \" سيشتد الأمر باجتماع الأحزاب عليكم العاقبة لكم عليهم \" \n\n وقوله صلى الله عليه وسلم:\n \" إنهم سائرون إليكم بعد تسع أو عشر \"\n \n \n{ وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } في جميع ما جاءنا من قِبَل الله ورسوله من الوعد والوعيد\n وأنواع النعم والعطاء\n والمحن والبلاء { وَ } من كمال تثبتهم وتفويضهم على الله\n وتوكلهم نحوه: { مَا زَادَهُمْ } إلمام الخطوب وحدوث الوقائع\n ونزول المحن والبليات { إِلاَّ إِيمَاناً } بالله وكمال قدرته وعلمه وإرادته\n وسائر صفات الذاتية والفعلية { وَتَسْلِيماً } [الأحزاب: 22] لعموم ما جرى عليهم من صولجان قضائه بلا تلعثم وتذبذب في إيمانهم واعتقادهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فلما جاء الأحزاب واضطربوا { قالوا هذا ما وعدنا اللهُ ورسولهُ وصدق اللهُ ورسولهُ } \n وعَلِمُوا أن الجنة والنصرة قد وجبت لهم\n وعن ابن عباس رضي الله عنه أن النبي صلى الله عليه وسلم قال لأصحابه:\n \" إنَّ الأحزاب سائِرون إليكم\n في آخر تِسْع ليال\n أو عشر \" \n\n فلما رأوهم قد أقبلوا للميعاد\n قالوا ذلك\n و { هذا }: إشارة إلى الخطب والبلاء\n أي: هذا الخطب الذي وعدنا الله ورسوله\n وصدق الله ورسوله\n { وما زادهم } \n ما رأوا من اجتماع الأحزاب ومجيئهم\n { إلا إيماناً } بالله وبمواعيده { وتسليماً } لقضائه وأقداره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:30",
      "similarity": 0.598788263432006
    },
    {
      "verse": "5:56",
      "similarity": 0.5636755659446018
    },
    {
      "verse": "19:37",
      "similarity": 0.49694730499966966
    },
    {
      "verse": "43:65",
      "similarity": 0.49286615108877213
    },
    {
      "verse": "35:6",
      "similarity": 0.4282443394180067
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/33:22.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/33:22.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/33:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}