{
  "chapter": "الأحزاب",
  "text": "وانزل الذين ظهروهم من اهل الكتب من صياصيهم وقذف فى قلوبهم الرعب فريقا تقتلون وتاسرون فريقا",
  "translations": [
    {
      "translation": "He brought down from their fortresses those of the People of the Book who supported them and cast terror into their hearts. You killed some of them and some you took prisoner.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made those of the people of the Book who had helped (the tribes) descend from their forts, and filled their hearts with dread, so that you killed some and made many captive;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah brought down from their fortresses those People of the Book who had supported the invading confederates and cast such terror into their hearts that some of them you kill and some of them you take captive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God brought down those among the People of the Book who had supported the confederate tribes from their castles and struck their hearts with terror. You did away with some of them and captured the others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He brought down from their forts, the People given the Book(s) who had supported them, and instilled awe into their hearts – you slay a group among them and another group you make captive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of the People of the Scripture who backed them, Allah brought them down from their forts and cast terror into their hearts; a group you killed, and a group you made captives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He drove down those of the followers of the Book who backed them from their fortresses and He cast awe into their hearts; some you killed and you took captive another part.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He brought down those of the People of the Book who supported them from their fortresses and cast terror in their hearts; some you slew, some you made captive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He brought those of the People of the Scripture who supported them down from their strongholds, and cast panic into their hearts. Some ye slew, and ye made captive some.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brought down from their strongholds those People of the Book who supported the aggressors and filled their hearts with terror. Some of them you killed and others you took captive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He brought those of the people of the Book who backed them down from their fortresses and cast into their hearts terror; a part of them ye slew, and ye made captives a part.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He dragged down from their strongholds those who had backed them from among the People of the Book, and He cast terror into their hearts, [so that] you killed a part of them, and took captive [another] part.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of the People of the Book who aided them - Allah did take them down from their strongholds and cast terror into their hearts. (So that) some ye slew, and some ye made prisoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of the people of the Scripture who backed them (the disbelievers) Allah brought them down from their forts and cast terror into their hearts, (so that) a group (of them) you killed, and a group (of them) you made captives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brought down from their fortresses those who had supported them from among the People of the (Jewish) Book and cast terror into their hearts, so that some you killed and others you took captive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He brought down from their strongholds those of the People of the Book who backed them, and He threw terror into their hearts. Some of them you killed, and others you took captive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He brought down those who supported them among the People of the Scripture from their fortresses and cast terror into their hearts [so that] a party you killed, and you took captive a party.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:26] And He brought down those of the People of the Scripture, namely, the [Banū] Qurayza, who had supported them from their strongholds (sayāsī is the plural of sīsa, and is that in which one fortifies himself [against an enemy]) and He cast terror into their hearts, [so that] some, of them, you slew, and these were the combatants, and some, of them, you took captive, namely, their children.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He brought those of the People of the Scripture) they are Banu Qurayzah and Banu'l-Nadir: Ka'b Ibn Ashraf and Huyayy Ibn Akhtab and their hosts (who supported them) who supported the disbelievers of Mecca (down from their strongholds) from their mansions and towers, (and cast panic into their hearts) from Muhammad (pbuh) and his Companions, whereas before that they did not fear them and fought against them. (Some you slew) He says: you kill some of them, you sentence them to death, (and you made captive some) their children and women.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلَّذِينَ ظَاهَرُوهُم } معناه أعانُوهم\n\n\n\n\nوقوله تعالى: { مِن صَيَاصِيهِمْ } معناه من حُصُونِهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {those who openly oppose them} [refers to] those who help them.\n\n\nAnd His saying, \"From their loins.\" This means from their protected areas.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك { أَنزَلَ } سبحانه { ٱلَّذِينَ ظَاهَرُوهُم } وعاونوهم\n أي: الأحزاب { مِّنْ أَهْلِ ٱلْكِتَابِ } يعني: يهود قريظة والنضير { مِن صَيَاصِيهِمْ } أي: حصونهم وقلاعهم\n جميع صيصية\n وهي ما يُتحصن به من الجبل وغيره\n وذلك أنه بعدما انهم الأحزاب\n ورجعوا خائبين خاسرين إلى بلادهم\n ورجع صلى الله عليه وسلم إلى المدينة مع أصحابه\n وشرع يغسل رأسه\n والأصحاب قد انتزعوا عن أسلحتهم\n فجاءه جبريل معتجراً بعمامة من إستبرق\n والنقع على ثناياه وعلى فرسه الذي اسمه حيزوم\n وقال: وضعتم السلاح\n إن الملائكة لم تضع أسلحتها منذ أربعين ليلة\n إن الله يأمرك بالمسير إلى قريظة\n وإني مزلزل حصونها\n وكان صلى الله عليه وسلم قد غسل نصف رأسه فعصبه وأذن بالرحيل\n فقال:\n \" من كان سامعاً ومطيعاً فلا يصلين العصر إلى في بني قريظة \"\n \n \nوأعطى رايته علياً - كرم الله وجهه - فسار بالناس حتى دنا من الحصن فحاصرهم عليه السلام إحدى و عشرين\n أو خمساً وعشرين ليلة\n وأجهدهم الحصار وضعفوا { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ } أي: الخوف مع كونهم متحصنين\n فأرسل عليه السلام فقال لهم: أتنزلون بحكمي فأبوا\n فقال: على حكم سعد بن معاذ\n فرضوا بحكمه فنزلوا\n فحكم بقتل مقاتليهم وسبي ذراريهم ونسائهم\n فكبَّر النبي صلى الله عليه وسلم فقال:\n \" لقد حكمت بحكم الله يا سعد من فوق سبعة أرقعة \" \nفقتل منهم ستمائة وأكثر\n وأسر منهم سبعمائة\n كما قال سبحانه { فَرِيقاً تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقاً } [الأحزاب: 26]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنزل الذين ظاهروهم }: عاونوا الأحزاب وجاؤوا بهم { من أهلِ الكتاب } \n يعني بني قريظة\n أنزلهم { من صَياصِيهم } من حصونهم\n والصيصة: ما يتحصّن به\n قال الهروي: وكل ما يتحصّن به فهو صيصة\n ويقال لقرون البقر والظبي: صَيَاصي لأنها تتحصن بها\n وفي وصف أصحاب الدجال: \" شواربهم كالصياصي \" \n لطولها\n وفتلها\n فصارت كالقرون\n هـ\n رُوي أن جبريل عليه السلام أتى النبي صلى الله عليه وسلم صبيحة الليلة التي انهزم فيها الأحزاب\n ورجع المسلمون إلى المدينة - على فَرَسه الحيزوم\n والغُبار على وجه الفَرَس والسَّرْج\n فقال: ما هذا جبريلُ؟ فقال: من مُتَابعةِ قُريش\n ثم قال: إن الله يأمرك بالمسير إلى بني قريظة\n وأنا عائدٌ إليهم\n فإن الله داقهُمْ دَقَّ البيض على الصَّفا\n وهم لكم طُعْمةٌ\n وفي رواية: لَمَّا رجع - عليه الصلاة والسلام - ودخل مغتسله\n جاءه جبريل بعمامة من استبرق\n على بغلة\n عليها قطيفة من ديباج\n فقال: قد وضعتَ السِّلاح\n والله ما وضعت الملائكةُ السلاحَ\n وما رجعت إلا من طلب القوم\n وإن الله يأمرك بالمسير إلى بني قريظة\n فأذّن رسول الله صلى الله عليه وسلم في الناس: أنَّ من كان سَامِعاً مُطيعاً فلا يُصلَّين العَصْرَ إلا في بني قُريظة\n فخرج إليهم\n فحاصرهُم خمساً وعشرين ليلةٌ\n فقال رسول الله صلى الله عليه وسلم: تنزلُون على حُكْمي؟ فأبَوْا\n فقال: تنزلون على حكم سَعد بن مُعاذِ؟ فرضوا به\n فقال سعد: نحكم فيهمْ: أن تُقتل مقاتِلتَهُم\n وتُسبى ذَرارِيهمْ ونساؤُهُم\n فكبَّر النبيُّ صلى الله عليه وسلم وقال:\n \" لقد حكم فيهم بحكم الله من فوق سبع أرقعة \"\n \nثم استنْزلهم\n وخَنْدَق في سوق المدينة خندقاً\n وقدَّمَهُم\n فضرب أعناقَهُم\n وهم من ثمانمائة إلى تسعمائة\n وقيل: كانوا ستمائة مقاتل\n وسبعمائة أسير\n فقتل المقاتلة\n وقسم الأسارى\n وهم الذراري والنساء\n وكان عليّ والزبير رضي الله عنهما يضربان أعناق بني قريظة\n والنبي صلى الله عليه وسلم جالس هناك\n والقصة مطولة في كتب السير\n { وقذَفَ في قلوبهم الرعبَ } الخوف\n وفيه السكون والضم\n { فريقاً تقتلون } وهم الرجال { وتأسرون فريقاً } وهم النساء والذراري\n قالت عائشة رضي الله عنها: لم يقتل صلى الله عليه وسلم من نساء بني قريظة امرأة إلا واحدة\n قتلها بخلاد بن سويد\n كانت شدخت رأسه بِحجَر من فوق الحصن\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:2",
      "similarity": 0.2442126504420241
    },
    {
      "verse": "3:151",
      "similarity": 0.2180461567760687
    },
    {
      "verse": "2:85",
      "similarity": 0.2025570090438194
    },
    {
      "verse": "8:70",
      "similarity": 0.19648241170999747
    },
    {
      "verse": "76:28",
      "similarity": 0.18802191182928105
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}