{
  "chapter": "الأحزاب",
  "text": "ولما رءا المؤمنون الاحزاب قالوا۟ هذا ما وعدنا الله ورسوله وصدق الله ورسوله وما زادهم الا ايمنا وتسليما",
  "translations": [
    {
      "translation": "When the muminun saw the Confederates they said: 'This is what Allah and His Messenger promised us. Allah and His Messenger told us the truth.' It only increased them in iman and in submission.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the faithful saw (the armies of) the allied tribes, they said: \"This is what God and His Apostle had promised us; and God and His Apostle say the truth;\" and this enhanced their faith and obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the true believers, when they saw the invading confederates, they cried out: “This is what Allah and His Messenger had promised us, and what Allah and His Messenger said was absolutely true.” This only increased their faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On seeing the confederate tribes, the believers said, \"This is what God and His Messenger had promised us. The promise of God and His Messenger is true.\" This only strengthens their faith and their desire of submission to the will of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Muslims saw the armies, they said, “This is what Allah and His Noble Messenger promised us, and Allah and His Noble Messenger have spoken the truth”; and it did not increase anything for them but faith and acceptance of Allah’s will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the Confederates, they said: \"This is what Allah and His Messenger had promised us; and Allah and His Messenger had spoken the truth.\" And it only added to their faith and to their submissiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the allies, they said: This is what Allah and His Apostle promised us, and Allah and His Apostle spoke the truth; and it only increased them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers saw the Confederates they said, 'This is what God and His Messenger promised us, and God and His Messenger have spoken truly.' And it only increased them in faith and surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the true believers saw the clans, they said: This is that which Allah and His messenger promised us. Allah and His messenger are true. It did but confirm them in their faith and resignation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers saw the confederates, they said, \"This is what God and His Messenger have promised us. Surely the promise of God and His Messenger has come true.\" It served to increase them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the confederates, they said: this is that which Allah and His apostle had promised us; and Allah and His apostle had spoken the truth. And it only increased them in belief and in self-surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the faithful saw the confederates, they said, ‘This is what Allah and His Apostle had promised us, and Allah and His Apostle were true.’ And it only increased them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Believers saw the Confederate forces, they said: \"This is what Allah and his Messenger had promised us, and Allah and His Messenger told us what was true.\" And it only added to their faith and their zeal in obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw AlAhzab (the Confederates), they said: \"This is what Allah and His Messenger (Muhammad SAW) had promised us, and Allah and His Messenger (Muhammad SAW) had spoken the truth, and it only added to their faith and to their submissiveness (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers saw the confederates they said: 'This is what Allah and His Messenger have promised us. Surely, Allah and His Messenger have spoken in truth' And this did not increase them except in belief and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the confederates, they said, “This is what God and His messenger have promised us; and God and His messenger have told the truth.” And it only increased them in faith and submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the believers saw the companies, they said, \"This is what Allah and His Messenger had promised us, and Allah and His Messenger spoke the truth.\" And it increased them only in faith and acceptance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:22] And when the believers saw the confederates, of disbelievers, they said, ‘This is what God and His Messenger promised us, in the way of trial and [assistance to] victory, and God and His Messenger were truthful’, about the promise. And that only increased them in faith, in belief in God’s promise, and submission, to His command.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَمَّا رَأَى الْمُؤْمِنُونَ الْأَحْزَابَ قَالُوا هَذَا مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ وَصَدَقَ اللَّهُ وَرَسُولُهُ وَمَا زَادَهُمْ إِلَّا إِيمَانًا وَتَسْلِيمًا (22)لما ذكرت أقوال المنافقين والذين في قلوبهم مرض المؤذنة بما يداخل قلوبهم من الخوف وقلة الإيمان والشك فيما وعد الله به رسوله صلى الله عليه وسلم والمؤمنين من النصر ابتداء من قوله { وإذ يقول المنافقون والذين في قلوبهم مرض } \\[ الأحزاب : 12 \\] قوبلت أقوال أولئك بأقوال المؤمنين حينما نزلت بهم الأحزاب ورأوا كثرتهم وعددهم وكانوا على بصيرة من تفوقهم عليهم في القوة والعدد أضعافاً وعلموا أنهم قد ابتلوا وزلزلوا ، كل ذلك لم يُخِرْ عزائمهم ولا أدخل عليهم شكاً فيما وعدهم الله من النصر .وكان الله وعدهم بالنصر غير مرة منها قوله في سورة البقرة { أم حسبتم أن تدخلوا الجنة ولما يأتكم مثل الذين خلوا من قبلكم مَسَّتْهُمُ البأساءُ والضَّراءُ وزُلْزِلُوا حتى يقولُ الرسول والذين ءامنوا معه مَتَى نصرُ الله ألا إن نصر الله قريب } \\[ البقرة : 214 \\] . فلما رأى المسلمون الأحزاب وابتُلوا وزُلْزِلوا ورأوا مثل الحالة التي وصفت في تلك الآية علموا أنهم منصورون عليهم ، وعلموا أن ذلك هو الوعد الذي وعدهم الله بآية سورة البقرة . وكانت آية البقرة نزلت قبل وقعة الأحزاب بعام ، كذا روي عن ابن عباس ، وأيضاً فإن النبي صلى الله عليه وسلم أخبر المسلمين : أن الأحزاب سائرون إليكم بعد تسع أو عشر ، فلما رأى المؤمنون الأحزاب وزُلزلوا راجعهم الثبات الناشىء عن قوة الإيمان وقالوا : { هذا ما وعدنا الله ورسوله } أي : من النظر ومن الإخبار بمسير الأحزاب وصدَّقوا وعد الله إياهم بالنصر وإخبار النبي صلى الله عليه وسلم بمسير الأحزاب ، فالإشارة { بهذا } إلى ما شاهدوه من جيوش الأحزاب وإلى ما يتبع ذلك من الشدة والصبر عليها وكل ذلك وعد الله ورسوله صلى الله عليه وسلم ثم أخبروا عن صدق الله ورسوله عليه الصلاة والسلام فيما أخبرا به وصدَقوا الله فيما وعدهم من النصر خلافاً لقول المنافقين : { ما وعدنا الله ورسوله إلاّ غروراً } \\[ الأحزاب : 12 \\] فالوعد راجع إلى الأمرين والصدق كذلك .والوعد : إخبار مخبر بأنه سيعمل عملاً للمُخبَر بالفتح .ففعل { صدق } فيما حكي من قول المؤمنين { وصدق الله ورسوله } مستعمل في الخبر عن صدق مضى وعن صدق سيقع في المستقبل محقق وقوعه بحيث يُجعل استقباله كالمضي مثل { أتى أمرُ الله } \\[ النحل : 1 \\] فهو مستعمل في معنى التحقق . أو هو استعمال اللفظ في حقيقته ومجازه ، ولا شك أن محمل الفعل على الصدق في المستقبل أنسب بمقام الثناء على المؤمنين وأعلق بإناطة قولهم بفعل { رأى المؤمنون الأحزاب } دون أن يقال : ولما جاءت الأحزاب . فإن أبيتَ استعمال اللفظ في حقيقته ومجازه فاقصره على المجاز واطرح احتمال الإخبار عن الصدق الماضي .وضمير { زادهم } المستتر عائد إلى ما عاد إليه اسم الإشارة ، أي : وما زادهم ما رأوا إلا إيماناً وتسليماً ، أي : بعكس حال المنافقين إذ زادهم شكاً في تحقق الوعد ، والمعنى : وما زاد ذلك المؤمنين إلا إيماناً ، أي : ما زاد في خواطر نفوسهم إلا إيماناً ، أي : لم يزدهم خوفاً على الخوف الذي من شأنه أن يحصل لكل مترقِّب أن ينازله العدوّ الشديد ، بل شغلهم عن الخوف والهلع شاغل الاستدلال بذلك على صدق الرسول صلى الله عليه وسلم فيما أخبرهم به وفيما وعدهم الله على لسان رسوله عليه الصلاة والسلام من النصر فأعرضت نفوسهم عن خواطر الخوف إلى الاستبشار بالنصر المترقب .والتسليم : الانقياد والطاعة لأن ذلك تسليمُ النفس للمنقاد إليه ، وتقدم في قوله تعالى { ويسلّموا تسليماً } في سورة النساء ( 65 ) . ومن التسليم هنا تسليم أنفسهم لملاقاة عدوّ شديد دون أن يتطلبوا الإلقاء بأيديهم إلى العدوّ وأن يصالحوه بأموالهم . فقد ذكر ابن إسحاق وغيره أنه لما اشتدّ البلاء على المسلمين استشار رسول الله السعدَيْن سعدَ بن عُبادة وسعدَ بن معاذ في أن يعطي ثلث ثمار المدينة تلك السنة عيينةَ بنَ حصن ، والحارثَ بن عوف وهما قائدا غطفان على أن يرجعا عن المدينة ، فقالا : يا رسول الله أهو أمر تحبه فنصنعه ، أم شيء أمرك الله به لا بدّ لنا من العمل به ، أم شيء تصنعه لنا؟ قال رسول الله : بل شيء أصنعه لكم والله ما أصنع ذلك إلا لأني رأيت العرب قد رمتْكم عن قوس واحد وكَالَبُوكم من كل جانب فأردت أن أكسر عنكم من شوكتهم إلى أمرٍ مَّا . فقال سعد بن معاذ : يا رسول الله قد كنا نحن وهؤلاء القوم على الشرك بالله لا نعبد الله ولا نعرفه وهم لا يطمعون أن يأكلوا منها ثمرة واحدة إلا قِرى أو بَيْعاً أفحين أكرمنا الله بالإسلام وهدانا إليه وأعزَّنا بك وبه نعطيهم أموالنا؟ ما لنا بهذا من حاجة ، والله لا نعطيهم إلا السيفَ حتى يحكم الله بيننا وبينهم ، قال رسول الله : فأنت وذاك . فهذا موقف المسلمين في تلك الشدة وهذا تسليم أنفسهم للقتال .ومن التسليم الرضى بما يأمر به الرسول من الثبات معه كما قال تعالى : { ويُسَلِّمُوا تَسلِيماً } \\[ النساء : 65 \\] .وإذ قد علم أنهم مؤمنون لقوله { ولمَّا رأى المؤمنون الأحزاب } إلى آخره . . . فقد تعين أن الإيمان الذي زادهم ذلك هو زيادة على إيمانهم ، أي : إيمان مع إيمانهم .والإيمان الذي زادهُمُوه أريد به مظهر من مظاهر إيمانهم القويّ ، فجعل تكرر مظاهر الإيمان وآثاره كالزيادة في الإيمان لأن تكرر الأعمال يقوِّي الباعث عليها في النفس يباعد بين صاحبه وبين الشك والارتداد فكأنه يزيد في ذلك الباعث ، وهذا من قبيل قوله تعالى : { ليزدادوا إيماناً مع إيمانهم } \\[ الفتح : 4 \\] وقوله : { فأما الذين ءامنوا فزادتهم إيماناً } كما تقدم في سورة براءة ( 124 ) ، فكذلك القول في ضد الزيادة وهو النقص ، وإلا فإن حقيقة الإيمان وهو التصديق بالشيء إذا حصلت بمقوماتها فهي واقعة ، فزيادتها تحصيل حاصل ونقصها نقض لها وانتفاء لأصلها . وهذا هو محمل ما ورد في الكتاب والسنة من إضافة الزيادة إلى الإيمان وكذلك ما يضاف إلى الكفر والنفاق من الزيادة كقوله تعالى : { الأعراب أشدُّ كُفْراً ونِفاقاً } \\[ التوبة : 97 \\] وقوله : { وأما الذين في قلوبهم مرض فزادتهم رجساً إلى رجسهم وماتوا وهم كافرون } \\[ التوبة : 125 \\] . وإلى هذا المحمل يرجع خلاف الأيمة في قبول الإيمان الزيادة والنقص فيؤول إلى خلاف لفظي .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned the attributes of sincere believers, saying: (And when the true believers) the sincere believers (saw the clans) the disbelievers of Mecca: Abu Sufyan and his host, (they said: This is that which Allah and His messenger promised us) for the counting of days. (Allah and His messenger are true) in their promise, this is because the Prophet (pbuh) had informed them that the Clans will come and remain for nine to ten days, i.e. up to nine or ten days. (It) seeing the disbelievers (did but confirm them in their faith) it increased their certitude in the words of Allah and in the words of His Messenger (and resignation) to the command of Allah and to the command of the Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وما زادهم } أي: وقوع البلاء بالأحزاب { إلاّ إيماناً وتسليماً } لقوّة اعتقادهم في البداية وصحة متابعتهم في التسليم ففازوا بمقام الفتوة والانخلاع بالبلاء وعن قيود النفس لسلامة الفطرة\n فوصفهم بالوفاء الذي هو كمال مقام الفتوة\n وسماهم رجالاً على الحقيقة بقوله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والعفو عند القدرة وغير ذلك من الخصائل الحميدة والأخلاق الجميلة المرضية { وَ } من شدة تأثير هذه الخصائل الجميلة في قلوب المؤمنين { لَمَّا رَأَى ٱلْمُؤْمِنُونَ } المخلصون { ٱلأَحْزَابَ } حواليهم { قَالُواْ } متذكرين لوعد الله\n متثبتين على دينه\n متشمرين لإعلاء كلمة توحيده: { هَـٰذَا } الوقت وقت إنجاز { مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } من النصر والغلبة على الأعداء\n والفوز بأنواع الغنائم والعطاء عاجلاً وآجلاً بقوله سبحانه:\n[البقرة: 214] وقوله عليه السلام:\n \" سيشتد الأمر باجتماع الأحزاب عليكم العاقبة لكم عليهم \" \n\n وقوله صلى الله عليه وسلم:\n \" إنهم سائرون إليكم بعد تسع أو عشر \"\n \n \n{ وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } في جميع ما جاءنا من قِبَل الله ورسوله من الوعد والوعيد\n وأنواع النعم والعطاء\n والمحن والبلاء { وَ } من كمال تثبتهم وتفويضهم على الله\n وتوكلهم نحوه: { مَا زَادَهُمْ } إلمام الخطوب وحدوث الوقائع\n ونزول المحن والبليات { إِلاَّ إِيمَاناً } بالله وكمال قدرته وعلمه وإرادته\n وسائر صفات الذاتية والفعلية { وَتَسْلِيماً } [الأحزاب: 22] لعموم ما جرى عليهم من صولجان قضائه بلا تلعثم وتذبذب في إيمانهم واعتقادهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فلما جاء الأحزاب واضطربوا { قالوا هذا ما وعدنا اللهُ ورسولهُ وصدق اللهُ ورسولهُ } \n وعَلِمُوا أن الجنة والنصرة قد وجبت لهم\n وعن ابن عباس رضي الله عنه أن النبي صلى الله عليه وسلم قال لأصحابه:\n \" إنَّ الأحزاب سائِرون إليكم\n في آخر تِسْع ليال\n أو عشر \" \n\n فلما رأوهم قد أقبلوا للميعاد\n قالوا ذلك\n و { هذا }: إشارة إلى الخطب والبلاء\n أي: هذا الخطب الذي وعدنا الله ورسوله\n وصدق الله ورسوله\n { وما زادهم } \n ما رأوا من اجتماع الأحزاب ومجيئهم\n { إلا إيماناً } بالله وبمواعيده { وتسليماً } لقضائه وأقداره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:30",
      "similarity": 0.598788263432006
    },
    {
      "verse": "5:56",
      "similarity": 0.5636755659446018
    },
    {
      "verse": "19:37",
      "similarity": 0.49694730499966966
    },
    {
      "verse": "43:65",
      "similarity": 0.49286615108877213
    },
    {
      "verse": "35:6",
      "similarity": 0.4282443394180067
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}