{
  "chapter": "الأحزاب",
  "text": "يحسبون الاحزاب لم يذهبوا۟ وان يات الاحزاب يودوا۟ لو انهم بادون فى الاعراب يسـلون عن انۢبائكم ولو كانوا۟ فيكم ما قتلوا۟ الا قليلا",
  "translations": [
    {
      "translation": "They think that the Confederates have not departed and if the Confederates did appear then they would wish they were out in the desert with the Arabs, asking for news of you. If they were with you they would only fight a very little.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think the allied tribes have not withdrawn; and if the allied tribes had advanced they would have wished that they were rather with the Arabs of the desert asking news of you; and had they been among you they would have fought but just a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think that the invading confederates have not yet gone. But if the confederates were to mount another assault, they would wish to be in the desert among the bedouins and keep themselves informed about you from there. But even if they remained in your midst, hardly would they fight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think that the confederate tribes have not yet gone. If the confederate tribes were to attack them, they would have wished to be left alone among the bedouin Arabs where they would only follow the news about you. Even if they were with you, only a few of them would take part in the fight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assume that the armies of the disbelievers have not gone away; and were the armies to come again, their wish would be to go out to the villages seeking information about you; and were they to stay among you even then they would not fight, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think that the Confederates have not yet withdrawn; and if the Confederates should come, they would wish they were in the deserts among the bedouins, seeking news about you; and if they were to be among you, they would not fight but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think the allies are not gone, and if the allies should come (again) they would fain be in the deserts with the desert Arabs asking for news about you, and if they were among you they would not fight save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think the Confederates have not departed; and if the Confederates come, they will wish that they were desert-dwellers among the Bedoums asking for news of you. If they were among you, they would fight but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hold that the clans have not retired (for good); and if the clans should advance (again), they would fain be in the desert with the wandering Arabs, asking for the news of you; and if they were among you, they would not give battle, save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thought the confederate tribes would never withdraw. Indeed, if the confederates should come again, they would prefer to be in the desert, among the Bedouins. There they would ask news of you [from a distance]. But if they were with you, they would take very little part in the fighting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deem that the confederates have not yet departed; and if the confederates should come, they would fain to be in the desert with the wandering Arabs inquiring for tidings of you. And if they happen to be amongst you, they would fight but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They suppose the confederates have not left yet, and were the confederates to come [again], they would wish they were in the desert with the Bedouins asking about your news, and if they were with you they would fight but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think that the Confederates have not withdrawn; and if the Confederates should come (again), they would wish they were in the deserts (wandering) among the Bedouins, and seeking news about you (from a safe distance); and if they were in your midst, they would fight but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think that AlAhzab (the Confederates) have not yet withdrawn, and if AlAhzab (the Confederates) should come (again), they would wish they were in the deserts (wandering) among the bedouins, seeking news about you (from a far place); and if they (happen) to be among you, they would not fight but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think the confederates have not departed. Indeed, if the confederates should come again they would sooner be in the desert among the Bedouins asking news of you. If they were among you, they would fight but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assumed that the confederates had not withdrawn. But were the confederates to advance, they would wish they were in the desert with the Bedouins, inquiring about your news. And if they were among you, they would have done little fighting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think the companies have not [yet] withdrawn. And if the companies should come [again], they would wish they were in the desert among the bedouins, inquiring [from afar] about your news. And if they should be among you, they would not fight except for a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:20] They suppose that the confederates, of disbelievers, have not [yet] departed, to Mecca, because of their fear of them, and were the confederates to come, a second time, they would wish that they were in the   desert with the Bedouins asking about your news, your encounters with the disbelievers. And if they were among you, this second time, they would fight but a little, for show and for fear of being reviled.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They hold that the clans) 'Abdullah Ibn Ubayy and his host think that the disbelievers of Mecca (have not retired (for good)) because of their fear and cowardice; it is also said: they think that the disbelievers of Mecca will not leave until they kill Muhammad (pbuh); (and if the clans) the disbelievers of Mecca (should advance (again), they) 'Abdullah Ibn Ubayy and his host (would fain be in the desert with the wandering Arabs) they would wish to leave Medina because of their fear and cowardice, (asking) in Medina (for the news of you) about your situation in the Ditch (and if they were among you) and if they were with you in the Ditch, (they would not give battle, save a little) out of ostentation and seeking fame.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ونهاية جبنهم ورعبهم من الأحزاب { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ } ولم ينهزموا\n مع أنهم ذهبوا منهزمين إلى حيث لم يبق منهم أحد { وَ } هم من كمال محبتهم ومودتهم مع الأحزاب { إِن يَأْتِ ٱلأَحْزَابُ } ويكروا بعد الفرار { يَوَدُّواْ } هؤلاء المنافقون إتيانهم إلى حيث تمنوا { لَوْ أَنَّهُمْ بَادُونَ } ظاهرون { فِي } البدو { ٱلأَعْرَابِ } أي: فيما بينهم\n خارجون عن أظهر المسلمين\n لا حقون بالكفرة\n معدودون من عدادهم حتى { يَسْأَلُونَ } كل قادم من قبلكم { عَنْ أَنبَآئِكُمْ } وأخباركم\n وما جرى عليكم أيها المؤمنون من الوقائع الهائلة والمصيبات المهولة { وَ } من كمال ودادتهم مع الكفرة: { لَوْ } فُرض أنهم { كَانُواْ فِيكُمْ } وقت كر الكفرة عليكم { مَّا قَاتَلُوۤاْ } من المنافقين من قبلكم مع أعدائكم { إِلاَّ قَلِيلاً } [الأحزاب: 20] منهم\n وهو أيضاً على سبيل الرياء والسمعة\n ومقتضى ما زعموا من جلب النفع أو دفع الضر\n لا لرضاء الله وإعلاء دينه ونصرة نبيه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يَحْسَبُون } أي: هؤلاء المنافقون { الأحزابَ } ، يعني: قريشاً وغطفان، الذين تحزّبوا على رسول الله صلى الله عليه وسلم، أي: اجتمعوا، أنهم { لم يذهبوا } ولم ينصرفوا لشدة جُبنهم، مع أنهم انصرفوا. { وإن يأتِ الأحزابُ } كرة ثانية { يودُّوا لو أنهم بادون في الأعراب } ، والبادون: جمع باد، أي: يتمنى المنافقون - لجُبنهم - أنهم خارجون من المدينة إلى البادية، حاصلون بين الأعراب ليأمنوا على أنفسهم، ويعتزلوا مما فيه الخوف من الحرب، { يسألون } كل قادم منهم من جانب المدينة. وقرئ { يَسَاءلون } ، بالشد. أي: يتساءلون، بعضهم بعضاً { عن أنبائكم } عن أخباركم وعما جرى عليكم، { ولو كانوا } أي: هؤلاء المنافقون { فيكم } أي: حاضرون في عسكركم، وَضَرَ قِتَالٌ، { ما قاتلوا إلا قليلاً } رياءً وسمعة، ولو كان لله لكان كثيراً إذ لا يقل عمل لله. الإشارة: الجبان يخاف والناس آمنون، والشجاع يأمن والناس خائفون، ولا ينال من طريق القوم شيئاً جبانٌ ولا مستحي ولا متكبر. فمن أوصاف الضعفاء: أنهم، إذا نزلت بالقوم شدة أو محنة - كما امْتُحِنَ الجنيد وأصحابه - يتمنون أنهم خارجون عنهم، وربما خرجوا بالفعل، وإن ذهبت شوكتهم يحسبون أنهم لم يذهبوا لشدة جزعهم. ومن أوصافهم: أنهم يكثر سؤالهم عن أخبار القوم، والبحث عما جرى بهم خوفاً وجزعاً، ولو مضوا معهم لم يغنوا شيئاً. والله تعالى أعلم. ثم ذكرهم من أهل القوة، فقال: { لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ ٱللَّهِ أُسْوَةٌ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:30",
      "similarity": 0.34805609694856454
    },
    {
      "verse": "5:56",
      "similarity": 0.32858186017917723
    },
    {
      "verse": "33:22",
      "similarity": 0.3264946732924178
    },
    {
      "verse": "19:37",
      "similarity": 0.31393141002045966
    },
    {
      "verse": "43:65",
      "similarity": 0.31229780393758644
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/33:20.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/33:20.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}