{
  "chapter": "الأحزاب",
  "text": "لقد كان لكم فى رسول الله اسوة حسنة لمن كان يرجوا۟ الله واليوم الءاخر وذكر الله كثيرا",
  "translations": [
    {
      "translation": "You have an excellent model in the Messenger of Allah, for all who put their hope in Allah and the Last Day and remember Allah much.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have indeed a noble paradigm in the Apostle of God for him who fears God and the Day of Resurrection, and remembers God frequently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there was a good example for you in the Messenger of Allah, for all those who look forward to Allah and the Last Day and remember Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger of God is certainly a good example for those of you who have hope in God and in the Day of Judgment and who remember God very often.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed following the Noble Messenger of Allah is better for you – for one who is confident of Allah and the Last Day, and remembers Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in the Messenger of Allah you have a good example to follow for him who hopes in Allah and the Last Day, and remembers Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly you have in the Apostle of Allah an excellent exemplar for him who hopes in Allah and the latter day and remembers Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have had a good example in God's Messenger for whosoever hopes for God and the Last Day, and remembers God oft.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in the messenger of Allah ye have a good example for him who looketh unto Allah and the Last Day, and remembereth Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have indeed in the Prophet of God a good example for those of you who look to God and the Last Day, and remember God always.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly there hath been for you: in the apostle of Allah an excellent pattern for him who hopeth in Allah and the Last Day and remembereth Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is certainly a good exemplar for you in the Apostle of Allah—for those who look forward to Allah and the Last Day, and remember Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye have indeed in the Messenger of Allah a beautiful pattern (of conduct) for any one whose hope is in Allah and the Final Day, and who engages much in the Praise of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in the Messenger of Allah (Muhammad SAW) you have a good example to follow for him who hopes in (the Meeting with) Allah and the Last Day and remembers Allah much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Messenger of Allah you have a fine example for he who hopes for Allah and the Last Day and remembers Allah abundantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have an excellent example in the Messenger of God; for anyone who seeks God and the Last Day, and remembers God frequently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has certainly been for you in the Messenger of Allah an excellent pattern for anyone whose hope is in Allah and the Last Day and [who] remembers Allah often.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:21] Verily there is for you a good example (read iswa or uswa) in the Messenger of God, to emulate in combat and in holding one’s ground [therein], for whoever (li-man substitutes for lakum, ‘for you’) hopes for [the encounter with] God, fears Him, and the Last Day, and remembers God often, in contrast to those who do not.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily in the Messenger of Allah ye have a good example) a good wont and goodly imitation in staying with him in the Ditch (for him who looketh unto Allah) for he who longs for Allah's bounty and reward; it is also said that this means: for he who fears Allah (and the last Day) and fears the chastisement of the Hereafter, (and remembereth Allah much) with his tongue and heart.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لقد كان لكم في رسول الله أسوة حسنة } وجب على كل مؤمن متابعة رسول الله صلى الله عليه وسلم مطلقاً حتى يتحقق رجاؤه ويتم عمله لكونه الواسطة في وصولهم والوسيلة في سلوكهم للرابطة وقرن به الذكر الكثير الذي هو عمل ذلك المقام ليعلم أن من كان في بدايته يلزمه متابعته في الأعمال والأخلاق والمجاهدة والمواساة بالنفس والمال، إذ لو لم يحكم البداية لم يفلح بالنهاية\n ثم إذا تجرّد وتزكى عن صفات نفسه فليتابعه في موارد القلب، أي: الصدق والإخلاص، والتسليم والتوكل، كما تابعه في منازل النفس ليحتظي ببركة متابعته بالمواهب والأحواب وتجليّات الصفات في مقامه كما احتظى بالمكاسب والمقامات وتجليّات الأفعال في مقام النفس، وكذا في مقام السرّ والروح حتى الفناء\n ومن صحة المتابعة تصديقه في كل ما أخبر به بحيث لا يعتروه الشك في شيء من أخباره وإلا فترت العزيمة وبطلت المتابعة، فإن الأصل والعمدة في العمل الاعتقاد الجازم، ولهذا مدحهم بقوله: { ولما رأى المؤمنون الأحزاب قالوا هذا ما وعدنا الله ورسوله وصدق الله ورسوله } إذ وعدهم الابتلاء والزلزال حتى ينخلعوا عن أبدانهم ويتجرّدوا في التوجه إليه عن نفوسهم في قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تحريكاً لحمية المؤمنين: { لَّقَدْ كَانَ لَكُمْ } أيها المؤمنون المخلصون\n الطالبون التخلق بأخلاق الله\n الهاربون عن أخلاق أعدائه { فِي رَسُولِ ٱللَّهِ } المبعوث\n لإرشادكم وإهدائكم { أُسْوَةٌ حَسَنَةٌ } أي: خصلة حميدة بديعة يجب التأسي والاتصاف بها { لِّمَن كَانَ يَرْجُواْ ٱللَّهَ } أي: لقاءه ومطالعة وجهه الكريم { وَ } يرجو أيضاً { ٱلْيَوْمَ ٱلآخِرَ } الموعود يه هذه الكرامة العظيمة\n وبواسطة هذا الرجاء وغلبة هذه الأمنية العظيمة في خاطره { وَذَكَرَ ٱللَّهَ كَثِيراً } [الأحزاب: 21] في عموم الأعيان والأحياز\n لتلذذه بذكره سبحانه\n حتى ينال ما وعد من الفوز بشرف اللقاء\n ومن كان كذلك\n وهمه ذلك فهو مؤتسٍ بالرسول صلى الله عليه وسلم في تلك الخصلة المحمودة\n والديدنة المسعودة المقبولة عند الله التي هي الرضا بجميع ما جرى عليه من القضاء\n\n\nومن علامات الثبات على العزيمة\n وتحمل الشدائد\n ومقاساة الأحزان\n وارتكاب المتاعب والمشاق في إعلاء دين الله وكلمة توحيده\n والتوكل نحوه في الضراء والسراء\n وكظم الغيظ عند هجوم الغضب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { لقد كان لكم في رسول الله } محمد صلى الله عليه وسلم { أسوَةٌ حَسَنَة } خَصْلَةٌ حسنة، من حقها أن يُؤتسى بها كالثبات في الحرب، ومقاساة الشدائد، ومباشرة القتال\n أو: في نفسه قدوة يحسن التأسي به\n كما تقول: في البيضة عشرون رطلاً من حديد، أي: هي في نفسها عشرون\n وفيه لغتان: الضم والكسر، كالعِدوة والعُدوة، والرِشوة والرُشوة\n وهي { لمَن كان يرجو اللهَ واليوم الآخر } أي: يخاف الله ويخاف اليوم الآخر، أو: لأجل ثواب الله ونعيم اليوم الآخر\n و \" لمن \": قيل: بدل من ضمير \" لكم \" ، وفيه ضعف إذ لا يبدل من ضمير المخاطب إلا ما يدل على الإحاطة\n وقيل: يتعلق بحسنة، أي: أسوة حسنة كائنة لمَن آمن، { وذكر الله كثيراً } أي: في الخوف والرجاء، والشدة والرخاء، فإن المؤتسِي بالرسول يكون كذلك\n { ولمَّا رأى المؤمنون الأحزابَ } قد أقبلوا عليهم ليستأصلوهم، وقد وعدهم الله أن يسلط عليهم المحن، ويُزَلْزَلُوا حتى يستغيثوا ويستنصروا بقوله:\n\n[البقرة:214] إلى قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "60:6",
      "similarity": 0.8933143950149713
    },
    {
      "verse": "7:93",
      "similarity": 0.6026716252642466
    },
    {
      "verse": "5:68",
      "similarity": 0.4977080937918368
    },
    {
      "verse": "60:4",
      "similarity": 0.3471346054624234
    },
    {
      "verse": "78:27",
      "similarity": 0.2924007180742344
    }
  ]
}