{
  "chapter": "الأحزاب",
  "text": "ليجزى الله الصدقين بصدقهم ويعذب المنفقين ان شاء او يتوب عليهم ان الله كان غفورا رحيما",
  "translations": [
    {
      "translation": "So that Allah might recompense the sincerely true for their sincerity and punish the hypocrites, if He wills, or turn towards them. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may recompense the truthful for their truthfulness, and punish the hypocrites or relent towards them, as He will. God is surely forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All this is) in order that Allah may reward the truthful for their truthfulness, and either punish the hypocrites or, if He so wills, accept their repentance. Verily Allah is Most Pardoning, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will certainly reward the truthful ones for their truthfulness and punish or pardon the hypocrites as He wishes. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may reward the truthful for their truthfulness, and punish the hypocrites if He wills, or give them repentance; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward the men of truth for their truth, and punish the hypocrites, if He wills, or accept their repentance by turning to them. Verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward the truthful for their truth, and punish the hypocrites if He please or turn to them (mercifully); surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that God may recompense the truthful ones for their truthfulness, and chastise the hypocrites, if He will, or turn again unto them. Surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward the true men for their truth, and punish the hypocrites if He will, or relent toward them (if He will). Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will surely reward the truthful for their truthfulness and punish the hypocrites, if He so wishes, or He may accept their repentance, for God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All this happened in order that Allah may recompense the truthful for their truth, and may punish the hypocrites if He would, or relent toward them. Verily Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that Allah may reward the true for their truthfulness, and punish the hypocrites, if He wishes, or accept their repentance. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward the men of Truth for their Truth, and punish the Hypocrites if that be His Will, or turn to them in Mercy: for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward the men of truth for their truth (i.e. for their patience at the accomplishment of that which they covenanted with Allah), and punish the hypocrites if He will or accept their repentance by turning to them in Mercy. Verily, Allah is OftForgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah will recompense the truthful for their truthfulness and punish the hypocrites if He will, or turn again to them. Surely, Allah is the Forgiver and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may reward the truthful for their truthfulness; and punish the hypocrites, if He wills, or pardon them. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward the truthful for their truth and punish the hypocrites if He wills or accept their repentance. Indeed, Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:24] that God may reward the truthful for their truthfulness and chastise the hypocrites, if He will, by causing them to die in [a state of] hypocrisy, or relent to them. Surely God is Forgiving, to he who repents, Merciful, to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "475 (That Allah may reward the true men for their truth) that Allah may reward the loyal for their loyalty, (and punish the hypocrites if He will) if they die as hypocrites, (or relent towards them (if He will)) before they die. (Lo! Allah is Forgiving) He forgives those who repent, (Merciful) he shows mercy towards those who die repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وبهيئات نفوسهم المظلمة { إن شاء } لرسوخها { أو يتوب عليهم } لعروضها وعدم رسوخها { إن الله كان غفوراً } يستر هيئات النفوس بنوره { رحيماً } يفيض الكمال عند إمكان قبوله\n { يا أيها النبي قل لأزواجك } إلى آخره\n اختبر النساء هو إحدى خصال التجريد وأقدام الفتوة التي يجب متابعته فيها\n فإنه عليه السلام مع ميله إليهنّ لقوله:\n \" حبّب إليّ من دنياكم ثلاث \" \n\n إذ شوّشن وقته بميلهنّ إلى الحياة الدنيا وزينتها خيرهنّ وجرّد نفسه عنهنّ وحكمهنّ بين اختيار الدنيا ونفسه\n فإن اخترنه لقوة إيمانهن بقين معه بلا تفريق لجمعيته وتشويش لوقته بطلب الزينة والميل إليها\n بل على التجرد والتوجه إلى الحق كقوى نفسهن وإن اخترن الدنيا وزينتها متعهنّ وسرّحهنّ وفرّغ قلبه عنهنّ بمثابة إماتة القوى المستولية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أو بواسطة صدقهم وإخلاصهم { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } منهم\n وليجازيهم بمقتضى كفرهم ونفاقهم تعذيباً مخلداً مؤبداً { إِن شَآءَ } وتعلق إرادته ومشيئته بتخليدهم في العذاب { أَوْ يَتُوبَ عَلَيْهِمْ } ويوفقهم على الإيمان والإخلاص\n إن علق إرادته بإيمانهم وإنقاذهم من العذاب الأبدي { إِنَّ ٱللَّهَ } القادر المقتدر على جميع ما أحاط تحت قدرته { كَانَ غَفُوراً } ساتراً لذنوب من وفقهم على التوبة من عصاة عباده { رَّحِيماً } [الأحزاب: 24] يقبل توبتهم\n ويرحم عليهم بعدما أخلصوا فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويُعذِّب المنافقين إن شاء } إذا لم يتوبوا\n { أو يتوبَ عليهم } إن تابوا { إن الله كان غفوراً } بقبول التوبة\n { رحيماً } بعفو الحوبة\n الإشارة: قد تقدّم ما يتعلق بالاقتداء بالرسول - عليه الصلاة والسلام - والاهتداء بهديه\n وأنه منهاج الأكابر\n وقوله تعالى: { ولَمَّا رأى المؤمنون الأحزاب\n\n\n } الآية\n كذلك الأقوياء من هذه الطائفة\n إذا رأوا ما يهولهم ويروعهم زادهم ذلك إيماناً وتسليماً\n ويقيناً وطمأنينة\n وتحققوا بصحة الطريق إذ هو منهاج السائرين والأولياء الصادقين\n وسنة الأنبياء والمرسَلين\n قال تعالى:\n[العنكبوت:2] الآية\n وتقدم في إشارتها ما يتعلق بهذا المعنى\n قال بعضهم: نحن كالنجوم\n كلما اشتدت الظلمة قَوِيَ نُورُنَا\n وقال القشيري: كما أن المنافقين اضطربت عقائدهمُ عند رؤية الأعداء\n فالمؤمنون وأهل اليقين زادوا ثِقَةٌ\n وعلى الأعداء جرأةً\n ولحكم الله استسلاماً\n وفي الله قوة\n ثم قال: قوله تعالى: { من المؤمنين رجال صدقوا\n\n\n } الآية\n شَكَرَ صنيعَهم في المِرَاسَ\n ومدح يقينهم عند شهود الناس\n وسمّاهم رجالاً إثباتاً لهم بالخصوصية في الرتبة\n وتمييزاً لهم من بين أشكالهم بعلوِّ الحال\n فمنهم مَنْ خرج من دنياه على صِدْقه\n ومنهم مَنْ ينتظر حكم الله في الحياة والممات\n وحقيقة الصدق: حفْظُ العهد وترك مجاوزة الحدَّ\n ويقال: استواءُ السِّرِّ والجهر\n ويقال: هو الثبات عندما يكون الأمر جدًّا\n قوله تعالى: {\n\n\n ليجزي الله الصادقين بصدقهم\n\n } في الدنيا بالتمكين\n والنصرة على العدو\n وإعلاء الرتبة\n وفي الآخرة بجزيل الثواب\n وجميل المآب\n والخلودِ في النعيم المقيم\n والتقدم على الأشكال بالتكريم والتعظيم\n وقوله: { ويُعذب المنافقين إن شاء } يقال: إذا لم يجَزم بعقوبة المنافق\n وتعلَّق القول فيه على الرجاء\n فبالحريّ ألا يُخيِّبَ المؤمنَ في رجائه\n انتهى كلام القشيري\n ثم ذكر رجوع الأحزاب\n فقال: { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:73",
      "similarity": 0.7128786935393724
    },
    {
      "verse": "9:27",
      "similarity": 0.5341955536001871
    },
    {
      "verse": "5:74",
      "similarity": 0.5050268851596773
    },
    {
      "verse": "5:39",
      "similarity": 0.47699267948057966
    },
    {
      "verse": "3:128",
      "similarity": 0.47392197932846764
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/33:24.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/33:24.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/33:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}