{
  "chapter": "الأحزاب",
  "text": "واورثكم ارضهم وديرهم وامولهم وارضا لم تطـوها وكان الله على كل شىء قديرا",
  "translations": [
    {
      "translation": "He bequeathed their land, their houses and their wealth to you, and another land you had not yet trodden on. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He made you inherit their lands and mansions and wealth, and a country you had not traversed before, for God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made you inherit their land, their dwellings, and their goods, and a piece of land on which you had not yet trodden. Verily Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made you inherit their land, houses, property, and a land on which you had never walked. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He bequeathed you their lands and their houses and their wealth, and land that you have not yet set foot upon; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He caused you to inherit their lands, and their houses, and their riches, and a land which you had not trodden. And Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He made you heirs to their land and their dwellings and their property, and (to) a land which you have not yet trodden, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He bequeathed upon you their lands, their habitations, and their possessions, and a land you never trod. God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He caused you to inherit their land and their houses and their wealth, and land ye have not trodden. Allah is ever Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made you heirs to their lands, and their houses, and their possessions and lands on which you had not set foot before. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He caused you to inherit their land and their houses and their riches, and land which ye have not yet trodden. And Allah is over everything ever potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He bequeathed you their land, their houses and their possessions, and a territory you had not trodden, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He made you heirs of their lands, their houses, and their goods, and of a land which ye had not frequented (before). And Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He caused you to inherit their lands, and their houses, and their riches, and a land which you had not trodden (before). And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made you inheritors of their land, their houses, and their possessions, and another land on which you had never set foot before. Truly, Allah is Powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He made you inherit their land, and their homes, and their possessions, and a region you have never stepped on. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He caused you to inherit their land and their homes and their properties and a land which you have not trodden. And ever is Allah, over all things, competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:27] And He made you inherit their land and their homes and their possessions, and a land you had not trodden, thitherto, and this was [the territory of] Khaybar, which was captured after [that of] Qurayza. And God has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضًا لَمْ تَطَئُوهَا وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرًا (27)وعلى هذه التفاسير يتعين أن يكون فعل { أورثكم } مستعملاً في حقيقته ومجازه؛ فأما في حقيقته فبالنسبة إلى مفعوله وهو { أرضهم وديارهم وأموالهم ، } وأما استعماله في مجازه فبالنسبة إلى تعديته إلى { أرضاً لم تطؤوها ، } أي : أن يورثكم أرضاً أخرى لم تطؤوها ، من باب : { أتى أمر الله } \\[ النحل : 1 \\] أو يُؤوَّل فعل { أورثكم } بمعنى : قَدَّر أن يُوَرِّثكم . وأظهر هذه الأقوال أنها أرض خيبر فإن المسلمين فتحوها بعد غزوة قريظة بعام وشهر . ولعلّ المخاطبين بضمير { أورثكم } هم الذين فتحوا خيبر لم ينقص منهم أحد أو فقد منه القليل ولأن خيبر من أرض أهل الكتاب وهم ممن ظاهروا المشركين فيكون قصدُها من قوله { وأرضاً } مناسباً تمام المناسبة .وفي التذييل بقوله { وكان الله على كل شيء قديراً } إيماء إلى البشارة بفتح عظيم يأتي من بعده .وعندي : أن المراد بالأرض التي لم يَطؤوها أرض بني النضير وأن معنى { لم تطؤوها } لم تفتحوها عنوة ، فإن الوطء يطلق على معنى الأخذ الشديد ، قال الحارث بن وَعْلَة الذهلي :وطَأَتَنا وَطْئاً على حَنَق ... وَطْءَ المقيَّد نابت الهَرْمومنه قوله تعالى : { ولولا رجالٌ مؤمنون ونساءٌ مؤمناتٌ لم تعلموهم أن تطؤوهم } \\[ الفتح : 25 \\] ، فإن أرض بني النضير كانت مما أفاء الله على رسوله من غير إيجاف .\n\n",
      "translations": [
        {
          "translation": "(And He caused you to inherit their land) their mansions (and their houses and their wealth) He made their wealth booty for you, (and land) the land of Khaybar (ye have not trodden) which did not belong to you but which will soon belong to you. (Allah is Able to do all things) whether it is a conquest or assistance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما استأصلوا بالأسر والقتل { أَوْرَثَكُمْ } الله سبحانه إليكم أيها المؤمنون { أَرْضَهُمْ } أي: مزارعهم { وَدِيَارَهُمْ } التي تسكنون فيها مع ما فيه من الأمتعة والرخوة { وَأَمْوَالَهُمْ } أي: مواشيهم ونقودهم وتجارتهم تفضلاً عليكم\n وامتناناً { وَ } كذا تفضل سبحانه عليكم\n وأورثكم { أَرْضاً لَّمْ تَطَئُوهَا } أي: لم تتحركوا عليها\n بل لم تبصروها ولم تسيروا إليها أصلاً\n وهي خيبر أو مكة\n أو فارس أو الروم\n أو كل أرض يفتح الله إلى يوم القيامة { وَ } لا تتعجبوا من كمال فضل الله وسعة جوده أمثال هذه الكرامات\n إذ { كَانَ ٱللَّهُ } المتفرد بالقدرة الكاملة\n والقوة التامة الشاملة { عَلَىٰ كُلِّ شَيْءٍ } من مقدوراته ومراداته { قَدِيراً } [الأحزاب: 27] لا يعسر عنده مقدور دون مقدور\n بل الكل في جنب قدرته على السواء\n\n[الملك: 3] في مقدور حكيم قدير\n[الملك: 4]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وأورثكم أرضَهم وديارَهم وأموالهم } كالمواشي والنقود والأمتعة\n رُوي أن رسول الله صلى الله عليه وسلم جعل عقارهم للمهاجرين دون الأنصار\n وقال لهم:\n \" إنكم في منازلكم \" \n{ و } أورثكم { أرضاً لم تطؤوها } بعدُ\n قيل: خيبر\n ولم يكونوا نالوها\n أو: مكة\n أو: فارس والروم\n أو: كل أرض لم تُفتح إلى يوم القيامة\n فمكّنهم الله من ذلك كله\n وفتح عليهم مشارق الأرض ومغاربها\n { وكان الله على كل شيءٍ قديراً } فيقدر على جميع ذلك\n الإشارة: هذه عادة الله مع خواصه\n أن يُخوفهم ثم يُؤمنهم\n ويذلهم ثم يعزهم\n ويفقرهم ثم يغنيهم\n ويجعل دائرة السوء على مَن ناوأهم\n ويكفيهم أمرهم من غير محاربة ولا قتال\n { وكفى الله المؤمنين القتال\n\n\n } الآية\n ثم يكون لهم التصرف في الوجود بأسره\n أمرهم بأمر الله\n وحكمهم بحكمه\n والله غالب على أمره\n ولَمَّا نصر الله رسولَه\n وفرّق الأحزاب\n وفتح عليه قريظة والنضير\n ظنّ أزواجه أنه اختص بنفائس أموال اليهود وذخائرهم\n فقعدن حوله وقلن: يا رسول الله بنات كسرى وقيصر في الحلي والحلل والإماء والخول ونحن على ما تراه من الفاقه والضيق\n وآلمن قلبه - عليه الصلاة والسلام - لمطالبتهن له بتوسعة الحال\n وأن يعاملهن به بما يعامل به الملوكُ والأكابرُ أزواجَهم\n فأنزل الله تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "73:6",
      "similarity": 0.7311486883640366
    },
    {
      "verse": "9:37",
      "similarity": 0.32088769616274015
    },
    {
      "verse": "48:25",
      "similarity": 0.2924730470200109
    },
    {
      "verse": "9:120",
      "similarity": 0.20185320000683113
    },
    {
      "verse": "19:40",
      "similarity": 0.20033398221468948
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}