{
  "chapter": "الأحزاب",
  "text": "واذكرن ما يتلى فى بيوتكن من ءايت الله والحكمة ان الله كان لطيفا خبيرا",
  "translations": [
    {
      "translation": "And remember the Signs of Allah and the wise words which are recited in your rooms. Allah is All- Pervading, All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember God's revelations and the wisdom that are recited in your homes. God is indeed all perceiving, well-informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the Signs of Allah and the words of wisdom which are rehearsed in your homes. Verily Allah is All-Subtle, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, remember the revelations of God and Words of wisdom that are recited in your homes. God is Most Kind and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember what is recited in your houses, from Allah’s verses and wisdom*; indeed Allah knows the minutest things, is All Aware. (The Holy Qur’an and the sayings- hadith – of the Holy Prophet.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember, that which is recited in your houses of the Ayat of Allah and Al-Hikmah. Verily, Allah is Ever Most Courteous, Well-Acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep to mind what is recited in your houses of the communications of Allah and the wisdom; surely Allah is Knower of subtleties, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember that which is recited in your houses of the signs of God and the Wisdom; God is All-subtle, All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear in mind that which is recited in your houses of the revelations of Allah and wisdom. Lo! Allah is Subtile, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear in mind all that is recited in your homes of the revelations of God and of wisdom. God is all pervading and all aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear in mind that which is rehearsed in your homes of the revelations of Allah and the wisdom. Verily Allah is ever Subtile, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember what is recited in your homes of the signs of Allah and wisdom. Indeed Allah is all-attentive, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite what is rehearsed to you in your homes, of the Signs of Allah and His Wisdom: for Allah understands the finest mysteries and is well-acquainted (with them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember (O you the members of the Prophet's family, the Graces of your Lord), that which is recited in your houses of the Verses of Allah and AlHikmah (i.e. Prophet's Sunnah legal ways, etc. so give your thanks to Allah and glorify His Praises for this Quran and the Sunnah). Verily, Allah is Ever Most Courteous, WellAcquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember that which is recited in your houses of the verses of Allah and the Wisdom. Allah is the Subtle, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember what is recited in your homes of God's revelations and wisdom. God is Kind and Informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember what is recited in your houses of the verses of Allah and wisdom. Indeed, Allah is ever Subtle and Acquainted [with all things].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:34] And remember that which is recited in your houses of the revelations of God, [of] the Qur’ān, and wisdom, the Sunna. Truly God is Kind, to His friends, Aware, of all His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاذْكُرْنَ مَا يُتْلَى فِي بُيُوتِكُنَّ مِنْ آَيَاتِ اللَّهِ وَالْحِكْمَةِ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا (34)لما ضمِن الله لهن العظمة أمرهن بالتحلي بأسبابها والتملّي من آثارها والتزود من علم الشريعة بدراسة القرآن ليجمع ذلك اهتداءَهن في أنفسهن ازدياداً في الكمال والعلم ، وإرشادَهن الأمة إلى ما فيه صلاح لها من علم النبي صلى الله عليه وسلموفعل { اذْكُرن } يجوز أن يكون من الذُّكر بضم الذال وهو التذكّر ، وهذه كلمة جامعة تشمل المعنى الصريح منه ، وهو أن لا ينسَيْن ما جاء في القرآن ولا يغفلن عن العمل به ، ويشمل المعنى الكنائي وهو أن يراد مراعاة العمل بما يتلى في بيوتهن مما ينزل فيها وما يقرأه النبي صلى الله عليه وسلم فيها ، وما يبيّن فيها من الدين ، ويشمل معنى كنائياً ثانياً وهو تذكر تلك النعمة العظيمة أَن كانت بيوتهن موقع تلاوة القرآن .ويجوز أن يكون من الذِّكر بكسر الذال ، وهو إجراء الكلام على اللسان ، أي بلّغْنَه للناس بأن يقرأن القرآن ويبلغن أقوال النبي صلى الله عليه وسلم وسيرته . وفيه كناية عن العمل به . والتلاوة : القراءة ، أي إعادة كلام مكتوب أو محفوظ ، أي ما يتلوه الرسول صلى الله عليه وسلم و { من آيات الله والحكمة } بيان لما يتلى فكل ذلك متلوّ ، وذلك القرآن ، وقد بين المتلو بشيئين : هما آيات الله ، والحكمة ، فآيات الله يعم القرآن كلَّه ، لأنه معجز عن معارضته فكان آية على أنه من عند الله .وعطف { والحكمة } عطف خاص على عام وهو ما كان من القرآن مواعظ وأحكاماً شرعية ، قال تعالى بعد ذكر الأحكام التي في سورة الإِسراء ( 39 ) { ذلك مما أوحى إليك ربك من الحكمة } أي ما يتلى في بيوتهن عند نزوله ، أو بقراءة النبي ودراستهن القرآن ، ليتجدد ما علِمْنه ويلمع لهن من أنواره ما هو مكنون لا ينضُب معينه ، وليكُنّ مشاركاتتٍ في تبليغ القرآن وتواتره ، ولم يزل أصحاب رسول الله والتابعون بعدهم يرجعون إلى أمهات المؤمنين في كثير من أحكام النساء ومن أحكام الرجل مع أهله ، كما في قوله تعالى : { اذكرني عند ربك } \\[ يوسف : 42 \\] ، أي بلغ خبر سجني وبقائي فيه .وموقع مادة الذكر هنا موقع شريف لتحملها هذه المحامل ما لا يتحمله غيرها إلا بإطناب . قال ابن العربي : إن الله تعالى أمر نبيئه عليه الصلاة والسّلام بتبليغ ما أنزل إليه فكان إذا قرأ على واحد أو ما اتفق سقط عنه الفرض ، وكان على من تبعه أن يبلغه إلى غيره ولا يلزمه أن يذكره لجميع الصحابة .وقد تكرر ذكر الحكمة في القرآن في مواضع كثيرة ، وبيّنّاه في سورة البقرة .وتقدم قريباً اختلاف القراء في كسر باء ( بيوت ) أو ضمها .وجملة { إن الله كان لطيفاً خبيراً } تعليل للأمر وتذييل للجمل السابقة .والتعليل صالح لمحامل الأمرِ كلها لأن اللطف يقتضي إسداء النفع بكيفية لا تشقّ على المُسدَى إليه .وفيما وُجّه إلى نساء النبي صلى الله عليه وسلم من الأمر والنهي ما هو صلاح لهن وإجراء للخير بواسطتهن ، وكذلك في تيسيره إياهن لمعاشرة الرسول عليه الصلاة والسلام وجعلهن أهل بيوته ، وفي إعدادهن لسماع القرآن وفهمه ، ومشاهدة الهدي النبوي ، كل ذلك لطف لهن هو الباعث على ما وجهه إليهن من الخطاب ليتلقّيْن الخبرَ ويبلغنه ، ولأن الخبير ، أي العليم إذا أراد أن يُذهب عنهن الرجس ويطهرهن حصل مراده تاماً لا خلل ولا غفلة .فمعنى الجملة أنه تعالى موصوف باللطف والعلم كما دلّ عليه فعل { كان } فيشمل عمومُ لطفِه وعلمِه لطفَه بهن وعلمَه بما فيه نفعهن .\n\n",
      "translations": [
        {
          "translation": "And bear in mind) and remember (that which is recited in your houses of the revelations of Allah) the Qur'an (and wisdom) the commands and prohibitions, the lawful and the unlawful. (Lo! Allah is Subtile) He knows what is in their hearts, (Aware) of their works; it is also said: He is Subtile in that He commanded the Prophet (pbuh) to divorce them, and He is Aware of their righteousness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكمال أسمائه وصفاته { وَٱلْحِكْـمَةِ } المتقنة الدالة على متانة فعله ووثاقة تبديره { إِنَّ ٱللَّهَ } المطلع للسرائر والخفايا { كَانَ لَطِيفاً } يعلم دقائق ما في ضمائر عباده ورقائقه { خَبِيراً } [الأحزاب: 34] ذو خبرة كاملة على سوانح صدورهمه\n وخواطر قلوبهم\n فعليهم أن يخلصوا الله في جميع ما أتوا به\n واجتنبوا من الأوامر والنواهي وانقادوا له\n ويسلموا إليه مفوضين أمورهم كلها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن الله كان لطيفاً } عالماً بغوامض الأشياء\n { خبيراً } عالماً بحقائقها\n أو: هو عالم بأقوالكن وأفعالكن\n فاحذرن مخالفة أمره ونهيه\n ومعصية رسوله صلى الله عليه وسلم\n  الإِشارة: علَّق الحق تعالى شرف نساء النبي صلى الله عليه وسلم وتفضيلهن على سبعة أمور\n ويقاس عليهن غيرهن من سائر النساء\n فمَن فعل هذه الأمور حاز شرف الدنيا والآخرة\n الأول: تقوى الله في السر والعلانية\n وهي أساس الشرف\n الثاني: التحصُّن مما يُوجب مَيْل الرجال إليهن من التخنُّث في الكلام وغيره\n الثالث: لزوم البيوت والقرار بها\n وقد مدح الله نساء الجنة بذلك فقال:\n[الرحمن: 72]\n الرابع: عدم التبرُّج\n وهو إظهار الزينة حيث يحضر الرجال\n الخامس: إقامة الصلاة وإتقانها وإيتاء الصدقة\n السادس: طاعة الله ورسوله\n ويدخل فيه طاعة الزوج\n السابع: لزوم ذكر الله\n وتلاوة كتابه لمن تُحسن ذلك في بيتها\n فمَن فعلت من النساء هذه الأمور أذهب الله عنها دنس المعاصي والعيوب\n وطهّرها تطهيراً\n وأبدلها بمحاسن الأخلاق والشيم الكريمة\n والله تعالى أعلم\n ولمَّا نزل في نساء النبي صلى الله عليه وسلم ما نزل\n قال نساء المؤمنين ما نزل فينا فأنزل الله تعالى: { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَاتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:14",
      "similarity": 0.8339552187680512
    },
    {
      "verse": "42:19",
      "similarity": 0.68222171080562
    },
    {
      "verse": "6:103",
      "similarity": 0.6613042759463744
    },
    {
      "verse": "22:63",
      "similarity": 0.5568545589788253
    },
    {
      "verse": "18:19",
      "similarity": 0.29911550886664395
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}