{
  "chapter": "الأحزاب",
  "text": "ما كان على النبى من حرج فيما فرض الله له سنة الله فى الذين خلوا۟ من قبل وكان امر الله قدرا مقدورا",
  "translations": [
    {
      "translation": "There is no restriction on the Prophet regarding anything Allah allots to him. This was Allah's pattern with those who passed away before - and Allah's command is a pre-ordained decree -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no constraint on the Prophet in what God has decreed for him. This has been the way of God with (apostles) who have gone before you, and God's command is a determined act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There could be no hindrance to the Prophet regarding what Allah ordained for him. Such has been Allah's Way (with the Prophets) who went before. Allah's command is a decree firmly determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet cannot be blamed for carrying out the commands of God. It was the tradition of God with those who lived before. The command of God has already been decreed and ordained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon the Prophet regarding the matter that Allah has decreed for him; it has been Allah’s tradition in those who passed before; and the command of Allah is a certain destiny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on the Prophet in that which Allah has made legal for him. That has been Allah's way with those who have passed away of old. And the command of Allah is a decree determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm in the Prophet doing that which Allah has ordained for him; such has been the course of Allah with respect to those who have gone before; and the command of Allah is a decree that is made absolute:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no fault in the Prophet, touching what God has ordained for him -- God's wont with those who passed away before; and God's commandment is doom decreed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no reproach for the Prophet in that which Allah maketh his due. That was Allah's way with those who passed away of old - and the commandment of Allah is certain destiny -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No blame shall be attached to the Prophet for doing what is sanctioned for him by God. This was God's way with those who went before him -- and the command of God is a decree determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No blame there is upon the Prophet in that which Allah hath decreed for him. That hath been Allah's dispensation with those who have passed away afore - and the ordinance of Allah hath been a destiny destined\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on the Prophet in respect of that which Allah has made lawful for him: Allah’s precedent with those who passed away earlier (and Allah’s commands are ordained by a precise ordaining),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There can be no difficulty to the Prophet in what Allah has indicated to him as a duty. It was the practice (approved) of Allah amongst those of old that have passed away. And the command of Allah is a decree determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on the Prophet (SAW) in that which Allah has made legal for him. That has been Allah's Way with those who have passed away of (the Prophets of) old. And the Command of Allah is a decree determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No fault shall be attached to the Prophet for doing what Allah has obligated for him. Such was the way of Allah with those who passed away before the decree of Allah is a decree determined\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on the Prophet regarding what God has ordained for him. Such is the pattern of God among those who passed before. The command of God is an absolute decree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not to be upon the Prophet any discomfort concerning that which Allah has imposed upon him. [This is] the established way of Allah with those [prophets] who have passed on before. And ever is the command of Allah a destiny decreed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:38] There is no restriction for the Prophet in what God has ordained, [in what] He has made lawful, for him: [that is] God’s precedent (sunnata’Llāhi is in the accusative because the operator of the oblique has been removed [from the oblique construction ka-sunnati’Llāhi, ‘as is God’s precedent’) with those who passed away before, of prophets, which is that there is no restriction for them in this respect, a [special] dispensation for them regarding marriage — and God’s commandment, what He does, is inexorable destiny\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا كَانَ عَلَى النَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ اللَّهُ لَهُ سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا (38) استئناف لزيادة بيان مساواة النبي صلى الله عليه وسلم للأمة في إباحة تزوج مطلقة دعيّه وبيان أن ذلك لا يخل بصفة النبوءة لأن تناول المباحات من سنة الأنبياء ، قال تعالى : { يا أيها الرسل كلوا من الطيبات واعملوا صالحاً } \\[ المؤمنون : 51 \\] ، وأن النبي إذا رام الانتفاع بمباح لميل نفسه إليه ينبغي له أن يتناوله لئلا يجاهد نفسه فيما لم يؤمر بمجاهدة النفس فيه ، لأن الأليق به أن يستبقي عزيمته ومجاهدته لدفع ما أمر بتجنبه .وفي هذا الاستئناف ابتداء لنقض أقوال المنافقين أن النبي صلى الله عليه وسلم تزوج امرأة ابنه .ومعنى : { فرض الله له } قدّره ، إذْ أَذِنَه بفعله . وتعدية فعل { فرض } باللام تدل على هذا المعنى بخلاف تعديته بحرف ( على ) كقوله : { قد علمنا ما فرضنا عليهم في أزواجهم } \\[ الأحزاب : 50 \\] .والسُّنَّة : السيرة من عمل أو خُلق يلازمه صاحبه . ومضى القول في هل السنة اسم جامد أو اسم مصدر عند قوله تعالى : { قد خلت من قبلكم سنن } في سورة آل عمران ( 137 ) ، وعلى الأول فانتصاب سنة الله } هنا على أنه اسم وضع في موضع المصدر لدلالته على معنى فعل ومصدر . قال في «الكشاف» كقولهم : تُرباً وجندَلاً ، أي في الدعاء ، أي تَرب تُرباً . وأصله : تُرْب له وجندَلٌ له . وجاء على مراعاة الأصل قول المعري :تمنتْ قُوَيْقاً والسراة حِيالها ... تُرَابٌ لها من أَينق وجِمالساقه مساق التعجب المشوب بغضب .وعلى الثاني فانتصاب { سنة } على المفعول المطلق ، وعلى كلا الوجهين فالفعل مقدّر دل عليه المصدر أو نائبه . فالتقدير : سَنّ الله سنته في الذين خلوا من قبل .والمعنى : أن محمداً صلى الله عليه وسلم متَّبع سُنَّة الأنبياء الذين سبقوه اتباعاً لما فرض الله له كما فرض لهم ، أي أباح .والمراد ب { الذين خلوا } : الأنبياء بقرينة سياق لفظ النبي ، أي الذين خلوا من قبل النبوءة ، وقد زاده بياناً قوله : { الذين يبلغون رسالات الله ويخشونه } ، فالأنبياء كانوا متزوجين وكان لكثير منهم عدة أزواج ، وكان بعض أزواجهم أحب إليهم من بعضهن .فإن وقفنا عند ما جاء في هذه الآية وما بيّنته الآثار الصحيحة فالعبرة بأحوال جميع الأنبياء .وإن تلقَّيْنا بشيء من الإغضاء بعضَ الآثار الضعيفة التي أُلصِقت بقصة تزوج زينب كان داود عليه السلام عبرة بالخصوص فقد كانت له زوجات كثيرات وكان قد أحب أن يتزوج زَوجة ( أوريا ) وهي التي ضرب الله لها مثلاً بالخصم الذين تسَوّرُوا المحراب وتشاكوا بين يديه . وستأتي في سورة ص ، وقد ذكرت القصة في «سفر الملوك» . ومحلّ التمثيل بداود في أصل انصراف رغبته إلى امرأة لم تكن حلالاً له فصارت حلالاً له ، وليس محلّ التمثيل فيما حَفّ بقصة داود من لوم الله إياه على ذلك كما قال :{ وظن داود أنما فتناه فاستغفر ربه } \\[ ص : 24 \\] الآية لأن ذلك منتففٍ في قصة تزوّج زينب .وجملة { وكان أمر الله قدراً مقدوراً } معترضة بين الموصول والصفة إن كانت جملة { الذين يبلغون } صفة ل { الذين خلوا من قبل } ، أو تذييل مثل جملة { وكان أمر الله مفعولا } \\[ الأحزاب : 37 \\] إن كانت جملة { الذين يبلغون } مستأنفة كما سيأتي ، والقول فيه مثل نظيره المتقدم آنفاً .والقَدَر بفتح الدال : إيجاد الأشياء على صفة مقصودة وهو مشتق من القَدْر بسكون الدال وهو الكمية المحددة المضبوطة ، وتقدم في قوله تعالى : { فسالت أودية بقدرها } في سورة الرعد ( 17 ) وقوله : { وما ننزله إلا بقدر معلوم } في سورة الحجر ( 21 ) . ولما كان من لوازم هذا المعنى أن يكون مضبوطاً محكماً كثرت الكناية بالقدَر عن الإِتقان والصدور عن العلم . ومنه حديث : كل شيء بقضاء وقَدر ، أي من الله .واصطلح علماء الكلام : أن القدَر اسم للإِرادة الأزلية المتعلقة بالأشياء على ما هي عليه ، ويطلقونه على الشيء الذي تعلق به القدَر وهو المقدور كما في هذه الآية ، فالمعنى : وكان أمر الله مُقَدَّراً على حكمة أرادها الله تعالى من ذلك الأمر ، فالله لما أمر رسوله عليه الصلاة والسلام بتزوج زينب التي فارقها زيد كان عالماً بأن ذلك لائق برسوله عليه الصلاة والسلام كما قدر لأسلافه من الأنبياء .\n\n",
      "translations": [
        {
          "translation": "(There is no reproach) there is no sin or offence (for the Prophet in that which Allah maketh his due) in the dispensation Allah makes for him, by making him marry. (That was Allah's way) thus was Allah's decree (with those who passed away of old) before Muhammad (pbuh); the reference here is to David and his marriage to the wife of Uriya; and it is also said that this refers to the marriage of Solomon with Balqis (and the commandment of Allah is certain destiny) the decree of Allah must necessarily take place.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ } معناه من ضِيقٍ وإثمٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no blame on the Prophet} means that there is no hardship or sin on him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ووخامة عاقبة { فِيمَا فَرَضَ ٱللَّهُ لَهُ } صلى الله عليه سولم\n أي: في جميع ما قدر الله له\n وكتب لأجله في لوح قضائه من الحوادث الكائنة الجارية عليه صلى الله عليه وسلم على تعاقب الأزمان والأوقات\n ومن جملتها: هذا النكاح\n وليس أمثال هذا ببدع منَّا مخصوص بهذا النبي صلى الله عليه وسلم\n بل { سُنَّةَ ٱللَّهِ } الحكيم العليم\n المتقن في أفعاله المستمرة القديمة التي سنها سبحانه { فِي ٱلَّذِينَ خَلَوْاْ } ومضوا { مِن قَبْلُ } من الأنبياء والرسل { وَكَانَ أَمْرُ ٱللَّهِ } المثبت في لوح قضائه\n وحكمه المبرم في حضرة علمه { قَدَراً مَّقْدُوراً } [الأحزاب: 38] حتماً مقضياً\n مبرماً محكوماً به ألبتة\n\nوكيف لا يقضي ولا يحكم بالسنن المقدرة للأنبياء والرسل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكان أمرُ الله قَدَراً مقدوراً } أي: قضاءً مقضياً\n وحكماً مثبوتاً مبرماً\n لا مرد له\n  { الذين يُبلِّغون رسالاتِ الله } هو صفة لـ { الذين خلوا من قبل } \n أو: بدل منه\n أو: مدح لهم منصوب\n أو: مرفوع\n أي: هم الذين\n أو: أعني الذين يُبلغون رسالات الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:13",
      "similarity": 0.5021631681374528
    },
    {
      "verse": "33:62",
      "similarity": 0.4873531575047775
    },
    {
      "verse": "48:23",
      "similarity": 0.4820859184682035
    },
    {
      "verse": "3:137",
      "similarity": 0.4462309815936
    },
    {
      "verse": "7:2",
      "similarity": 0.43112349555001184
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}