{
  "chapter": "الأحزاب",
  "text": "ينساء النبى لستن كاحد من النساء ان اتقيتن فلا تخضعن بالقول فيطمع الذى فى قلبه مرض وقلن قولا معروفا",
  "translations": [
    {
      "translation": "Wives of the Prophet! you are not like other women provided you have taqwa. Do not be too soft-spoken in vour sDeech lest someone with sickness in his heart becomes desirous. Soeak correct and courteous words.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, you are not like other women. If you are mindful of God, do not be too obliging in your speech, lest some one sick of heart should covet your person; so say only customary things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not like other women. If you fear Allah, do not be too complaisant in your speech lest those with diseased hearts should covet you; but speak in a straight forward manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not like other women. If you have fear of God, do not be tender in your speech lest people whose hearts are sick may lust after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O the wives of the Prophet! You are not like any other women – if you really fear Allah, do not speak softly lest the one in whose heart is a disease have any inclination, and speak fairly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like any other women. If you keep you have Taqwa, then be not soft in speech, lest he in whose heart is a disease should be moved with desire, but speak in an honorable manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! you are not like any other of the women; If you will be on your guard, then be not soft in (your) speech, lest he in whose heart is a disease yearn; and speak a good word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not as other women. If you are godfearing, be not abject in your speech, so that he in whose heart is sickness may be lustful; but speak honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye wives of the Prophet! Ye are not like any other women. If ye keep your duty (to Allah), then be not soft of speech, lest he in whose heart is a disease aspire (to you), but utter customary speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not like any other women. If you fear God, do not be too soft-spoken in case the ill-intentioned should feel tempted. Speak in an appropriate manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "wives of the prophet! ye are not like any others of women, if ye are God-fearing. So be not soft in speech, lest one in whose heart is disease should be moved with desire, bun speak a reputable speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like other women: if you are wary [of Allah], do not be complaisant in your speech, lest he in whose heart is a sickness should aspire; speak honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Consorts of the Prophet! Ye are not like any of the (other) women: if ye do fear (Allah), be not too complacent of speech, lest one in whose heart is a disease should be moved with desire: but speak ye a speech (that is) just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like any other women. If you keep your duty (to Allah), then be not soft in speech, lest he in whose heart is a disease (of hypocrisy, or evil desire for adultery, etc.) should be moved with desire, but speak in an honourable manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, you are not like other women. If you fear (Allah), do not be to complaisant in your speech, lest he in whose heart there is a sickness may desire (of his mother); but speak honorable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like any other women, if you observe piety. So do not speak too softly, lest the sick at heart lusts after you, but speak in an appropriate manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, you are not like anyone among women. If you fear Allah, then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:32] O wives of the Prophet! You are not like any other, group of, women. If you fear, God, for you are more exalted [in status], then do not be complaisant in your speech, with men, lest he in whose heart is a sickness, hypocrisy, aspire [to you], but speak honourable words, without any complaisance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye wives of the Prophet! Ye are not like any other women) you are not like the rest of women in relation to transgression, obedience, reward and punishment. (If ye keep your duty (to Allah)) if you obey Allah and His Messenger, (then be not soft of speech) with strangers, (lest he in whose heart is a disease) lust for 476 adultery (aspire (to you), but utter customary speech) straight speech, containing no ambiguity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ ناداهن سبحانه تعظيماً لهن\n وتنبيهاً عليهن فقال: { يٰنِسَآءَ ٱلنَّبِيِّ } الأفضل الأكمل من بين الأنبياء والرسل\n كما أن صلى الله عليه وسلم ليس في الكرمة والنجابة كآحاد الناس\n بل ليس كآحاد الأنبياء والرسل\n كذلك { لَسْتُنَّ } أيضاً\n لنسبتكنَّ إليه صلى الله عليه وسلم { كَأَحَدٍ } أ ي: كواحدة { مِّنَ ٱلنِّسَآءِ } لأن فضيلته صلى الله عليه وسلم تسري إليكن\n فعليكن ألاَّ تغفلن عنها\n ولا تذهلن عن مقتضاها ورعاية حقوقها\n بل من شأنكن التحصن والتقوى\n والتحرز من ملهيات الهوى مطلقاً\n فلكن { إِنِ ٱتَّقَيْتُنَّ } يعني: إن أردتن أن تتصفن بالتقوى عن محارم الله { فَلاَ تَخْضَعْنَ } أي: لا تُلن وتلطفن { بِٱلْقَوْلِ } وقت احتياجكن إلى التكلم مع آحاد الرجال من الأجانب\n ولا تجبن عن سؤالهم هينات لينات مريبات\n مثل تكلم النساء المريدات لأنواع الفسادات مع المفسدين من الرجال { فَيَطْمَعَ ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } وميل إلى الفجور إليكن بعدما سمع منكن تليينكن في قولكن { وَ } بالجملة: { قُلْنَ } بعدما تحتجن إلى التكلم معهم ضرورة { قَوْلاً مَّعْرُوفاً } [الأحزاب: 32] مستحسناً عقلاً وشرعاً\n بعيداً عن الريبة المثيرة للطمع\n خالياً عن وصمة الملاينة المحركة للشهوات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا نساء النبي لستُنَّ كأحدٍ من النساء } أي: لستن كجماعة من جماعات النساء\n أي: إذا تقصيت أمة النساء\n جماعةً جماعةً\n لم توجد منهن جماعة واحدة تُساويكن في الفضل\n فكما أنه ـ عليه الصلاة والسلام ـ ليس كأحد من الرجال\n كما قال:\n \" إني لسْتُ كَأَحَدِكُمْ\n\n\n \" \nكذلك زوجاته التي شرُفن به\n وأصل \" أحد \": وَحَدٍ\n بمعنى: واحد\n فوضع في النفي العامّ\n مستوياً فيه المذكّر والمؤنّث\n والواحد وما وراءه\n أي: لستن في الشرف كأحد من النساء\n { إنِ اتقيْتنَّ } مخالفةَ الله ورضا رسوله\n { فلا تَخْضَعْنَ بالقولِ } أي: إذا كلمتن الرجال من وراء الحجاب\n فلا تجئنَ بقولكنّ خاضعاً\n أي: ليناً خنثاً مثل قول المُريبات\n { فيَطْمَع الذي في قلبه مرضٌ } ريبة\n وفجور\n وهو جواب النهي\n { وقُلْنَ قولاً معروفاً } حسناً مع كونه خشيناً\n  { وقَرْنَ في بُيُوتِكُنَّ } أي: استكِن فيه\n والْزَمن بيوتكن من غير خروج\n وقرأ نافع وعاصم بالفتح\n وهو من: قرَر يَقْرَرُ\n لغة في قرّ بالمكان\n وأصله: اقرَرن\n فحذفت الراء\n تخفيفاً\n وألقيت فتحتها على ما قبلها\n وقيل: من: قار يقار: إذا اجتمع\n والباقون بالكسر\n من: قرّ بالمكان يقِرّ ـ بالكسر\n وأصله: اِقْررْن\n فنقلت كسرة الراء إلى القاف\n وحذفت الراء\n وقيل: من: وَقَر يَقِر وقاراً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:4",
      "similarity": 0.7314353786718794
    },
    {
      "verse": "5:84",
      "similarity": 0.20455884085819476
    },
    {
      "verse": "74:15",
      "similarity": 0.20338166180040665
    },
    {
      "verse": "7:56",
      "similarity": 0.1982951268780057
    },
    {
      "verse": "70:38",
      "similarity": 0.19625235570522978
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/33:32.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/33:32.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}