{
  "chapter": "الأحزاب",
  "text": "وتوكل على الله وكفى بالله وكيلا",
  "translations": [
    {
      "translation": "Trust in God. God is sufficient as guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in Allah: Allah is sufficient as Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Trust in God and be sure that He is a Sufficient Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And trust Allah; and Allah is Sufficient as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in Allah, and sufficient is Allah as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely on Allah; and Allah is sufficient for a Protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust in God; God suffices as a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust in Allah, for Allah is sufficient as Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in God; God is sufficient as a Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust in Allah and Allah sufficeth as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in Allah; Allah suffices as trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust in Allah, and enough is Allah as a disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in Allah, and Sufficient is Allah as a Wakil (Trustee, or Disposer of affairs).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "put your trust in Allah; Allah suffices as a Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in God. God is enough as a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely upon Allah; and sufficient is Allah as Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:3] And put your trust in God, regarding this affair of yours; and God suffices as Guardian, to preserve you. And [the members of] his [the Prophet’s] community are subject to the same [admonitions] in all of the above.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And put thy trust in Allah, for Allah is Sufficient as Trustee) He is sufficient to fulfil His promise to you: to give you victory and the upper hand; it is also said that this means: He is sufficient to protect you from them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n[الإسراء، الآية:74] وأمثاله { إن الله كان بما تعلمون خبيراً } يعلم مصادر الأعمال وأنها من - أي الصفات - تصدر من الصفات النفسانية أو الشيطانية أو الرحمانية فيهديك إليها ويزكيك منها ويعلمك سبيل التزكية والحكمة في ذلك { وتوكل على الله } في دفع تلك التلوينات ورفع تلك الحجب والغشاوات { وكفى بالله وكيلاً } فإنها لا ترتفع ولا تنكشف إلا بيده لا بنفسك وعلمك وفعلك، أي: لا تحتجب برؤية الفناء في الفناء فإنه ليس من فعلك سواء كان في الأفعال أو الصفات أو الذات أو إزالة التلوينات فإنها كلها بفعل الله لا مدخل لك فيها وإلا لما كنت فانياً\n { النبيّ أولى بالمؤمنين من أنفسهم } لأنه مبدأ وجوداتهم الحقيقية ومبدأ كمالاتهم ومنشأ الفيضين الأقدس الاستعدادي أولاً والمقدس الكمالي ثانياً، فهو الأب الحقيقي لهم ولذلك كانت أزواجه أمّهاتهم في التحريم ومحافظة الحرمة مراعاة لجانب الحقيقة وهو الواسطة بينهم وبين الحق في مبدأ فطرتهم فهو المرجع في كمالاتهم ولا يصل إليهم فيض الحق بدونه لأنه الحجاب الأقدس واليقين الأول، كما قال:\n\n \" أول ما خلق الله نوري \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتَوَكَّلْ عَلَىٰ ٱللَّهِ } أيها المتحصن بكنف حفظه وجواره، وثق بكرمه ولطفه { وَكَفَىٰ بِٱللَّهِ } أي: كفى بالله المراقب عليك في جميع أحوالك { وَكِيلاً } [الأحزاب: 3] لك يراقبك ويحفظظ من شرور من قصد مقتك، وهجومهم عليك، ومكرهم معك، وكن في نفسك متوجهاً إلى ربك، مخلصاً فيه، مائلاً بوجه قلبك إلى قبلة وجهه الكريم، ولا تفلتفت إلى من سواه ولا تُخطر ببالك غيره؛ إذ لا يسع في القلب الواحد إلا همٌّ واحد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتوكل على الله } أَسْنِدْ أمرك إليه، وكِلْهُ إلى تدبيره\n { وكفى بالله وكيلاً } حافظاً موكولاً إليه كل أمر\n وقال الزجاج: لفظه، وإن كان لفظ الخبر، فالمعنى: اكتفِ بالله وكيلاً\n الإشارة: أُمر بتقوى الله، وبالغيبة عما يشغل عن الله، وبالتوكل على الله، فالتقوى أساس الطريق، والغيبة عن الشاغل: سبب الوصول إلى عين التحقيق، والتوكل زاد رفيق\n قال القشيري بعد كلام: يا أيها المُرقَّى إلى أعلى المراتب، المُتَلقَّى بأسنى القُرَب والمناقب اتقِ الله أن تلاحظ غَيْراً معنا، أو تُساكِن شيئاً دوننا، أو تُثبت شيئاً سوانا، { ولا تطع الكافرين } إشفاقاً منك عليهم، وطمعاً في إيمانهم، بموافقتهم في شيء مما أرادوه منك\n والتقوى رقيب على الأولياء، تمنعهم، في أنفاسهم وسكناتهم وحركاتهم، أن ينظروا إلى غيره، أو يُثْبِتُوا معه سواه، إلا منصوباً بقدرته، مصرَّفاً بمشيئته، نافذاً فيه حُكْمُ قضيته\n\n\nالتقوى لجامٌ يمنعك عمَّا لا يجوز، زمامٌ يقودك إلى ما تُحب، سوطٌ يسوقك إلى ما أمر به، حِرْزٌ يعصمك من تَوَصُّل عقابه إليك، عوذَةٌ تشفيك من داء الخطايا\n التقوى وسيلةٌ إلى ساحة كرمه، ذريعةٌ يُتَوصَّلُ بها إلى عفوه وجوده\n { واتبع ما يوحى إليك\n\n\n } لا تبتدع، واقتِد بما نأمرك، ولا تقتدِ، باختيارك، غَيْرَ ما نختار لك، ولا تُعَرِّج - أي: تقم - في أوطان الكسل، ولا تجنجْ إلى ناحية التواني، وكن لنا لا لك، وقم بنا لا بِكَ\n \" وتوكل \" انسلخْ عن إهابك لنا، واصدق في إيابك إلينا، وتشاغلك عن حُسْبَانِكَ معنا، واحذرْ ذهابَكَ عنا، ولا تُقَصِّرْ في خطابك معنا\n ويقال: التوكل: تَخلُّقُ، ثم تَخلُّقٌ، ثم تَوَثُقٌ، ثم تَمَلُّقٌ، تحققٌ في العقيدة، وتخلقٌ بإقامة الشريعة، وتَوثُّقٌ بالمقسوم من القضية، وتملقٌ بين يديه بحُسْن العبودية\n ويقال: التوكل: استواءُ القلب في العدم والوجود\n هـ\n والتقوى محلها القلب، ولا يحصل منتهاها إلأا بانفراد القلب إلى مولاه كما أبان ذلك بقوله: { مَّا جَعَلَ ٱللَّهُ لِرَجُلٍ مِّن قَلْبَيْنِ\n\n\n }\n",
      "translations": []
    }
  ]
}