{
  "chapter": "الأحزاب",
  "text": "ومن يقنت منكن لله ورسوله وتعمل صلحا نؤتها اجرها مرتين واعتدنا لها رزقا كريما",
  "translations": [
    {
      "translation": "But those of you who are obedient to Allah and His Messenger and act rightly will be given their reward twice over; and We have prepared generous provision for them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever of you is obedient to God and His Apostle, and does the right, will be given a two-fold reward by Us; and We have a rich provision in readiness for her.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever of you is obedient to Allah and His Messenger and does good deeds, Allah will double her reward. We have prepared for her a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whoever of you obeys God and His Messenger and acts righteously, We will give double reward and a honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever among you remains obedient towards Allah and His Noble Messenger and does good deeds – We shall give her double the reward of others, and have kept prepared for her an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever of you is obedient to Allah and His Messenger, and does righteous good deeds, We shall give her, her reward twice over, and We have prepared for her a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of you is obedient to Allah and His Apostle and does good, We will give to her reward doubly, and We have prepared for her an honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever of you is obedient to God and His Messenger, and does righteousness, We shall pay her her wage twice over; We have prepared for her a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever of you is submissive unto Allah and His messenger and doeth right, We shall give her her reward twice over, and We have prepared for her a rich provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those of you who obey God and His Messenger and do good deeds, shall be doubly rewarded. For them We have made an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever of you shall be obedient unto Allah and His apostle and shall work righteously, her hire We shall give her twice over, and We have gotten ready for her a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever of you is obedient to Allah and His Apostle and acts righteously, We shall give her a twofold reward, and We will have in store for her a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But any of you that is devout in the service of Allah and His Messenger, and works righteousness,- to her shall We grant her reward twice: and We have prepared for her a generous Sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever of you is obedient to Allah and His Messenger SAW, and does righteous good deeds, We shall give her, her reward twice over, and We have prepared for her Rizqan Karima (a noble provision Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she who obeys Allah and His Messenger and does good works shall be doubly recompensed; for her We have made a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever of you remains obedient to God and His Messenger, and acts righteously, We will give her a double reward; and We have prepared for her a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of you devoutly obeys Allah and His Messenger and does righteousness - We will give her her reward twice; and We have prepared for her a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:31] But whoever of you is obedient to God and His Messenger, and acts righteously, We shall give her a twofold reward, in other words, twice the reward for other women (variant readings [for ta‘mal and nu’tihā] are [impersonal] ya‘mal, ‘[whoever] acts’, and yu’tihā, ‘He will give her’). And We have prepared a noble provision for her, in Paradise, in addition [to the twofold reward].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And whosoever of you is submissive) obedient (unto Allah and His messenger and doeth right) between herself and her Lord, (We shall give her reward twice over) a double reward, (and We have prepared for her a rich provision) a fair reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ } معناه نُعطِها ثَوَابَها\n\n",
      "translations": [
        {
          "translation": " And His saying, {We will give her her reward twice} [means that] We will give her her reward.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَقْنُتْ } ويطع على سبيل الخضوع { مِنكُنَّ للَّهِ وَرَسُولِهِ } ويداوم على إطاعتهما وانقيادهما بإتيان الواجبات\n وترك المحظورات والمكروهات { وَتَعْمَلْ صَالِحاً } من النوافل والمندوبات { نُؤْتِهَـآ أَجْرَهَا } أي: جزاء أعمالها وطاعاتها في يوم الجزاء { مَرَّتَيْنِ } مرة على مقابلة الأعمال المأتية ومقتضى الطاعات المرضية\n ومرة على ترجيحها رضا الله ورضا رسوله على مشتهيات نفسها { وَأَعْتَدْنَا } تفضلاً { لَهَا } وامتناناً عليها وراء ما استحقت بالأعمال والطاعات { رِزْقاً كَرِيماً } [الأحزاب: 31] صورياً في الجنة مما تشتهي نفسها وتلذ عينها\n ومعنوياً من الحالات الطارئة عليها عند اسغراقها بمطالعة جمال الله وجلاله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن يَقْنُتْ منكن } أي: يدم على الطاعة { لله ورسوله وتعمل صالحاً نُؤْتِها أجْرَها مرتين } أي: مثل ثوابي غيرها\n مرة على الطاعة\n ومرة على طلبهن رضا النبي صلى الله عليه وسلم\n بالقناعة\n وحسن المعاشرة\n وقرأ حمزة والكسائي بالغيب على لفظ \" من \" \n { وأعتدنا لها رِزقاً كريماً } جليل القدر\n وهو الجنة\n الإشارة: من شأن الملِك أن يُعاتب الوزراء بما لا يعاتب غيرهم\n ويهددهم بما لا يهدد به غيرهم\n ويعطيهم من التقريب والكرامة ما لا يُعطي غيرهم\n فإن هفوا وزلُّوا عاتبهم\n ثم يردهم إلى مقامهم\n وربما سمح وأغضى\n والغالب: أن الحق تعالى يعجل عتاب خواصه\n في الدنيا قبل الآخرة\n بمصائب وأهوال\n تصفيةً وتطهيراً\n ولا يُبعدهم من حضرته بما اقترفوا\n قال القشيري: زيادةُ العقوبة على الجُرْمِ من أمارات الفضيلة\n كحدّ الحر والعبد\n وتقليل ذلك من أمارات النقص\n ولَمَّا كانت منزلتُهن في الشرف تزيد وتربو على منزلة جميع النساء\n تضاعفت عقوبتهن على أجْرامهن\n وتضاعف ثوابَهن على طاعتِهن\n فقال: { ومن يقنت منكن لله\n\n\n } وقال: { لستن كأحد من النساء\n\n\n } الآية هـ\n والله تعالى أعلم\n ثم وصَّاهنَّ بما يليق بجنابهنَّ المعظم فقال: { يٰنِسَآءَ ٱلنَّبِيِّ لَسْتُنَّ كَأَحَدٍ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:26",
      "similarity": 0.5167533756326389
    },
    {
      "verse": "2:116",
      "similarity": 0.46392258537379644
    },
    {
      "verse": "3:17",
      "similarity": 0.4533449395965133
    },
    {
      "verse": "17:10",
      "similarity": 0.39190037287632407
    },
    {
      "verse": "16:120",
      "similarity": 0.3873545399296977
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/33:31.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/33:31.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}