{
  "chapter": "الأحزاب",
  "text": "وقرن فى بيوتكن ولا تبرجن تبرج الجهلية الاولى واقمن الصلوة وءاتين الزكوة واطعن الله ورسوله انما يريد الله ليذهب عنكم الرجس اهل البيت ويطهركم تطهيرا",
  "translations": [
    {
      "translation": "Remain in your houses and do not display your beauty as it was previously displayed in the Time of Ignorance Establish salat and pay zakat and obey Allah and His Messenger. Allah desires to remove all impurity from you, People of the House, and to purify you completely.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stay at home, and do not deck yourselves with ostentation as in the days of paganism; fulfil your devotional obligations, pay the zakat, and obey God and His Apostle. God desires to remove impurities from you, O inmates of this house, and to cleanse and bring out the best in you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay in your homes and do not go about displaying your allurements as in the former Time of Ignorance. Establish Prayer, give Zakah, and obey Allah and His Messenger. Allah only wishes to remove uncleanness from you, O members of the (Prophet's) household, and to purify you completely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not display yourselves after the manner of the (pre-Islamic) age of darkness. Be steadfast in the prayer, pay the religious tax, and obey God and His Messenger. People of the house, God wants to remove all kinds of uncleanliness from you and to purify you thoroughly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remain in your houses and do not unveil yourselves like the unveiling prevalent in the times of ignorance, and keep the prayer established, and pay the charity, and obey Allah and His Noble Messenger; Allah only wills to remove all impurity from you, O the People of the Household, and by cleansing you make you utterly pure. (*The Holy Prophet’s household.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay in your houses, and do not Tabarruj yourselves like the Tabarruj of the times of ignorance, and perform the Salah, and give Zakah and obey Allah and His Messenger. Allah wishes only to remove the Ar-Rijs from you, O members of the family, and to purify you with a thorough purification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay in your houses and do not display your finery like the displaying of the ignorance of yore; and keep up prayer, and pay the poor-rate, and obey Allah and His Apostle. Allah only desires to keep away the uncleanness from you, O people of the House! and to purify you a (thorough) purifying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remain in your houses; and display not your finery, as did the pagans of old. And perform the prayer, and pay the alms, and obey God and His Messenger. People of the House, God only desires to put away from you abomination and to cleanse you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay in your houses. Bedizen not yourselves with the bedizenment of the Time of Ignorance. Be regular in prayer, and pay the poor-due, and obey Allah and His messenger. Allah's wish is but to remove uncleanness far from you, O Folk of the Household, and cleanse you with a thorough cleansing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stay in your homes and do not flaunt your charms as in the former times of ignorance. Attend to your prayers, pay the zakat and obey God and His Messenger. Women of the [Prophet\"s] Household, God seeks only to remove all impurity from you, and to make you completely pure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay in Your houses. and display not yourselves! with the display of the times of former Paganism; and establish the prayer and give the poor-rate and obey Allah and His apostle. Allah only desireth to take away uncleanness from you, people of the house-hold, and to purify you with a thorough purification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stay in your houses and do not flaunt your finery like the former [days of pagan] ignorance. Maintain the prayer and pay the zakat, and obey Allah and His Apostle. Indeed Allah desires to repel all impurity from you, O People of the Household, and purify you with a thorough purification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay quietly in your houses, and make not a dazzling display, like that of the former Times of Ignorance; and establish regular Prayer, and give regular Charity; and obey Allah and His Messenger. And Allah only wishes to remove all abomination from you, ye members of the Family, and to make you pure and spotless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And stay in your houses, and do not display yourselves like that of the times of ignorance, and perform As-Salat (IqamatasSalat), and give Zakat and obey Allah and His Messenger. Allah wishes only to remove ArRijs (evil deeds and sins, etc.) from you, O members of the family (of the Prophet SAW), and to purify you with a thorough purification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stay in your homes and do not display your finery as pagan women used to do in the olden Days of Ignorance. Establish your prayers, pay the obligatory charity, and obey Allah and His Messenger. O family of the House, Allah only wishes to distance fault from you, and to cleanse you, and to purify you abundantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And settle in your homes; and do not display yourselves, as in the former days of ignorance. And perform the prayer, and give regular charity, and obey God and His Messenger. God desires to remove all impurity from you, O People of the Household, and to purify you thoroughly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And abide in your houses and do not display yourselves as [was] the display of the former times of ignorance. And establish prayer and give zakah and obey Allah and His Messenger. Allah intends only to remove from you the impurity [of sin], O people of the [Prophet's] household, and to purify you with [extensive] purification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:33] And stay in your houses (read qirna or qarna, derived from al-qarār, and is actually, aqrirna or aqrarna from qarirtu or qarartu: the vowelling of the rā’ is moved to the qāf and [the rā’] is omitted together with the conjunctive hamza) and do not flaunt your finery (tabarrajna, with one of the two original tā’ [of tatabarrajna] letters omitted) in the [flaunting] manner of the former Time of Ignorance, in other words, before Islam, when they used to display their beauty to men — [the stipulation regarding] such ‘displays’ after [the coming of] Islam is mentioned in the verse: and not to display their adornment except what is apparent [Q. 24:31]. And maintain prayer and pay the alms, and obey God and His Messenger. Indeed God will but to rid you of sin, O, People of the House, in other words, [O] women of the Prophet (s), and to purify you, of it, with a thorough purification.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And stay in your houses) and do not go out and display gravity. (Bedizen not yourselves with the bedizenment of the Time of Ignorance) and do not adorn yourselves with the adornment of the disbelievers in their thin, colourful clothes. (Be regular in prayer) perform the five daily prayers, (and pay the poor-due) from your wealth, (and obey Allah and His messenger) in that which is customary. (Allah's wish) in this (is but to remove uncleanness) sin (far from you, Folk of the Household) of the Prophet, (and cleanse you) from sins (with a thorough cleansing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَرْنَ فِي بُيُوتِكُنَّ } يعني إِلزمنَّ بِيوتَكُنَّ\n\n\n\n\nوقوله تعالى: { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَاهِلِيَّةِ ٱلأُولَىٰ } التَّبرجُ: إِظهارُ الزِّينةِ والمَحاسنِ، وإبرازُهَا\n والجَاهليةُ الأَولى: ما بينَ إِدريس ونوح عليهما السَّلامُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {And stay in your homes} means that you should be committed to your homes.\n\nAnd His saying, {And do not display yourselves as [was] the display of the former times of ignorance.} The display: the showing of adornment and beauty, and the displaying of it.\n\n\nAnd the first ignorance: that between Idris and Noah, peace be upon them both.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَرْنَ } أي: اسكن { فِي بُيُوتِكُنَّ } يعني: يا نساء النبي من شأنكن التقرر والتخلي في البيوت بلا تبرز إلى الملأ بلا ضرورة رعايةً لمرتبتكن التي هي أعلى مرتبة عموم النساء { وَ } إناحتجتن إلى التبرز والخروج أحياناً { لاَ تَبَرَّجْنَ } ولا تبخترن في مشيتكن مظهرات زينتكن\n مهيجات لشهوات الناظرين { تَبَرُّجَ ٱلْجَاهِلِيَّةِ ٱلأُولَىٰ } أي: كتبختر النساء المثيرات لشهوات الرجال في الجاهلية القديمة التي هي جاهلية الكفر\n والجاهلية الأخرى جاهلية الفسوق في الإسلام\n\n\nخصَّ سبحانه الأولى بالذكر\n وإن كانت كلتاهما مذمومتان محظورتان شرعاً\n لأنها أفحش وأقبح وأظهر فساداً\n لأن النساء فيها يتزينَّ بأنواع الزينة\n ويظهرن على الرجال بلا تستر واستحياء\n بل بملاينة تامة وملاطفة كاملة على سبيل الغنج والدلال\n وأنوع الحركات المطمعة للرجال { وَ } من حقكن يا نساء النبي الاجتناب عن مطلق المنكرات\n والاشتغال بالطاعات والأعمال الصالحات\n سيما المواظبة على الصلوات النوافل والمفروضات { أَقِمْنَ ٱلصَّلاَةَ } المقربة لكُنَّ إلى الله على الوجه الذي علمتن من النبي صلى الله عليه وسلم { وَآتِينَ ٱلزَّكَـاةَ } المطهرة لنفوسكن عن الشح\n وأنواع المرض المتولدة من حب الدنيا وأمانيها إن بلغ أموالكن النصاب المقدر في الشرع\n\n\n{ وَ } بالجملة: { أَطِعْنَ ٱللَّهَ وَرَسُولَهُ } إطاعة مقارنة بكمال الخشوع والخضوع\n والتذلل التام بالعزيمة الصحيحة الخالصة\n الخالية عن شوب الرياء والرعونات مطلقاً في جميع ما أُمرتن بها\n ونهيتن عنها { إِنَّمَا يُرِيدُ ٱللَّهُ } المصلح لأحوال عباده الخلَّص بإتيان هذه المواعيظ والتذكيرات البليغة\n والتنبيهات العجيبة البديعة { لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ } أي: يزيل القذر المستقبح المستهجن عقلاً وشرعاً بالمرة يا { أَهْلَ ٱلْبَيْتِ } المجبولين على الكرامة والنجابة { وَيُطَهِّرَكُمْ } عن أدناس الطبيعة\n وأكدار الهيولي المانعة عن الصفاء الجبلي الذاتي { تَطْهِيـراً } [الأحزاب: 33] بليغاً\n بحيث لا تبقى فيكم شائبة شين\n ووصمة عيب أصلاً\n ذكر الضمير\n لأن النبي وعلياً وابنيه صلى الله عليه وسلم فيهم فغلب هؤلاء الذكور له على فاطمة وأزواج النبي\n رضوان الله عليهم\n\n{ وَ } بعدما سمعتن يا نساء النبي ما يليق وينبغي بشأنكن { ٱذْكُـرْنَ مَا يُتْـلَىٰ } لإصلاح أحوالكن وتكميلكن في الدين { فِي بُيُوتِكُـنَّ } غير مخرجات لطلبه\n إذ بيوتكن مهبط الوحي الإلهي\n ومحل نزول الآيات المنزلة\n فلكُنذَ أن تلازمن خدمة النبي صلى الله عليه وسلم\n وتشاهدن عليه من برحاء الوحي الموجب لقوة الإيمان وكمال اليقين والعرفان\n فليس لكُنَّ أن تخرجن من بيوتكن\n وتتعبن أنفسكن في طلب ما يُتلى { مِنْ آيَاتِ ٱللَّهِ } الدالة على توحيد ذاته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ولا تبرَّجْنَ تبرجَ الجاهليةِ الأُولى } أي: لا تتبخترن في المشي تبختر أهل الجاهلية\n فالتبرُّج: التبختر في المشي وإظهار الزينة\n أي: ولا تبرجن تبرجاً مثل { تبرج الجاهلية الأولى } أي: القديمة\n وهو الزمان الذي وُلد فيه إبراهيم عليه السلام\n فكانت المرأة تتخذ فيه الدرع من اللؤلؤ\n وتعرض نفسها على الرجال\n زمان نمرود الجبار\n والناس كلهم كفار\n أو: ما بين آدم ونوح عليهما السلام ثمانمائة سنة\n وكان نساؤهم أقبح ما يكون\n ورجالهم حِسَان\n فتريده المرأة على نفسها\n أو: زمن داود وسليمان عليهما السلام\n وكان للمرأة قميص من الدرّ\n غير مخيط الجانبين\n فتظهر صورتها فيه\n والجاهلية الأخرى: ما بين عيسى ومحمد عليهما السلام أو: الجاهلية الأولى: جاهلية الكفر قبل الإسلام\n والجاهلية الأخرى: جاهلية الفسوق والفجور في الإسلام\n  { وأقِمْنَ الصلاةَ وآتينَ الزكاة } خصهما بالذكر تفضيلاً لهما لأن مَن واظب عليهما جرتاه إلى غيرهما\n { وأَطِعْنَ اللهَ ورسولَه } في سائر ما أمرَكن به\n ونهاكن عنه\n  { إِنما يُريد اللهُ ليُذهبَ عنكم الرجسَ أهلَ البيت } أي: يا أهل البيت\n أو: أخص أهل البيت\n وفيه دليل على أن نساءه من أهل بيته\n قال البيضاوي: وتخصيص أهل البيت بفاطمة وعلي وابنيهما\n لِما رُوي أنه ـ عليه الصلاة والسلام ـ خرج ذات غدوة عليه مِرْطٌ مُرَحَّل من شعر أسود\n فجاءت فاطمة\n فأدخلها\n ثم جاء عليّ\n فأدخله فيه\n ثم جاء الحسن والحسين\n فأدخلهما فيه\n فقال:\n\n \" إنما يريد الله ليذهب عنكم الرجس أهلَ البيت\n\n\n \" \nوالاحتجاج بذلك على عصمتهم\n وكون اجتماعهم حجة\n ضعيف لأن التخصيص بهم لا يناسب ما قبل الآية وما بعدها\n والحديث يقتضي أنهم من أهل البيت\n لا أنه ليس غيرهم\n هـ\n وإنما قال: { عنكم } لأنه أُريد الرجال والنساء\n والرجس: كل ما يدنس\n من ذنب\n أو عيب\n أو غير ذلك\n وقيل: الشيطان\n  { ويُطهركم تطهيراً } من نجاسات الآثام والعيوب\n وهو كالتعليل لِمَا قبله\n فإنما أَمَرَهن\n ونهاهن\n ووعظهن لئلا يقارف أهل البيت ما يدنس\n من المآثم\n وليتصوّنوا عنها بالتقوى\n واستعار للذنب الرجس\n وللتقوى الطُهر لأن عِرض المقترف للمستقبحات يتلوث بها كما يتلوث بدنه بالأرجاس وأما مَن تحصّن منها فعرضه مصون\n نقي كالثوب الطاهر\n وفيه تنفير لأُولي الألباب عن كل ما يدنس القلوب من الأكدار\n وترغيب لهم في كل ما يطهر القلوب والأسرار\n من الطاعات والأذكار\n  { واذْكُرْنَ ما يُتلى في بيوتِكُنَّ من آياتِ الله } القرآن { والحكمةِ } السُنَّة\n أو: بيان معاني القرآن\n أو: ما يُتلى عليكن من الكتاب الجامع بين الأمرين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:1",
      "similarity": 0.49671304424119384
    },
    {
      "verse": "15:16",
      "similarity": 0.4772344359686117
    },
    {
      "verse": "10:100",
      "similarity": 0.34706662639544605
    },
    {
      "verse": "25:61",
      "similarity": 0.3369574749209498
    },
    {
      "verse": "9:125",
      "similarity": 0.31716453010798507
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}