{
  "chapter": "الأحزاب",
  "text": "ينساء النبى لستن كاحد من النساء ان اتقيتن فلا تخضعن بالقول فيطمع الذى فى قلبه مرض وقلن قولا معروفا",
  "translations": [
    {
      "translation": "Wives of the Prophet! you are not like other women provided you have taqwa. Do not be too soft-spoken in vour sDeech lest someone with sickness in his heart becomes desirous. Soeak correct and courteous words.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, you are not like other women. If you are mindful of God, do not be too obliging in your speech, lest some one sick of heart should covet your person; so say only customary things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not like other women. If you fear Allah, do not be too complaisant in your speech lest those with diseased hearts should covet you; but speak in a straight forward manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not like other women. If you have fear of God, do not be tender in your speech lest people whose hearts are sick may lust after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O the wives of the Prophet! You are not like any other women – if you really fear Allah, do not speak softly lest the one in whose heart is a disease have any inclination, and speak fairly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like any other women. If you keep you have Taqwa, then be not soft in speech, lest he in whose heart is a disease should be moved with desire, but speak in an honorable manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! you are not like any other of the women; If you will be on your guard, then be not soft in (your) speech, lest he in whose heart is a disease yearn; and speak a good word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not as other women. If you are godfearing, be not abject in your speech, so that he in whose heart is sickness may be lustful; but speak honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye wives of the Prophet! Ye are not like any other women. If ye keep your duty (to Allah), then be not soft of speech, lest he in whose heart is a disease aspire (to you), but utter customary speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, you are not like any other women. If you fear God, do not be too soft-spoken in case the ill-intentioned should feel tempted. Speak in an appropriate manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "wives of the prophet! ye are not like any others of women, if ye are God-fearing. So be not soft in speech, lest one in whose heart is disease should be moved with desire, bun speak a reputable speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like other women: if you are wary [of Allah], do not be complaisant in your speech, lest he in whose heart is a sickness should aspire; speak honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Consorts of the Prophet! Ye are not like any of the (other) women: if ye do fear (Allah), be not too complacent of speech, lest one in whose heart is a disease should be moved with desire: but speak ye a speech (that is) just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like any other women. If you keep your duty (to Allah), then be not soft in speech, lest he in whose heart is a disease (of hypocrisy, or evil desire for adultery, etc.) should be moved with desire, but speak in an honourable manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, you are not like other women. If you fear (Allah), do not be to complaisant in your speech, lest he in whose heart there is a sickness may desire (of his mother); but speak honorable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! You are not like any other women, if you observe piety. So do not speak too softly, lest the sick at heart lusts after you, but speak in an appropriate manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, you are not like anyone among women. If you fear Allah, then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:32] O wives of the Prophet! You are not like any other, group of, women. If you fear, God, for you are more exalted [in status], then do not be complaisant in your speech, with men, lest he in whose heart is a sickness, hypocrisy, aspire [to you], but speak honourable words, without any complaisance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا نِسَاءَ النَّبِيِّ لَسْتُنَّ كَأَحَدٍ مِنَ النِّسَاءِ إِنِ اتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا مَعْرُوفًا (32){ يانسآء النبى لَسْتُنَّ كَأَحَدٍ مِّنَ النسآء إِنِ اتقيتن }أعيد خطابهن من جانب ربهنّ وأعيد نداؤهن للاهتمام بهذا الخبر اهتماماً يخصُّه .وأحد : اسم بمعنى واحد مثل : { قل هو الله أحد } \\[ الإخلاص : 1 \\] وهمزته بدل من الواو . وأصلهُ : وَحَد بوزن فَعَل ، أي متوحِّد ، كما قالوا : فَرَد بمعنى منفرد . قال النابغة يذكر ركوبه راحلته :كان رحلي وقد زال النهار بنا ... يوم الجليل على مستأنس وَحديُريد على ثور وحشي منفرد . فلما ثقل الابتداء بالواو شاع أن يقولوا : أَحد ، وأكثر ما يستعمل في سياق النفي ، قال تعالى : { فما منكم من أحد عنه حاجزين } \\[ الحاقة : 47 \\] فإذا وقع في سياق النفي دل على نفي كل واحد من الجنس .ونفي المشابهة هُنا يراد به نفي المساواة مكنَّى به عن الأفضلية على غيرهنّ مثل نفي المساواة في قوله تعالى : { لا يستوي القاعدون من المؤمنين غير أولي الضرر والمجاهدون في سبيل الله } \\[ النساء : 95 \\] ، فلولا قصد التفضيل ما كان لزيادة { غير أولي الضرر } وجد ولا لسبب نزولها داع كما تقدم في سورة النساء ( 95 ) . فالمعنى : أنتُنَّ أفضل النساء ، وظاهره تفضيل لجملتهن على نساء هذه الأمة ، وسبب ذلك أنهن اتصَلْنَ بالنبي عليه الصلاة والسلام اتصالاً أقرب من كل اتصال وصرن أنيساته ملازمات شؤونه فيختصصن باطلاع ما لم يطلع عليه غيرُهن من أحواله وخلقه في المنشط والمكره ، ويتخلقن بخلقه أكثر مما يقتبس منه غيرهن ، ولأن إقباله عليهن إقبالٌ خاص ، ألا ترى إلى قوله : حُبِّب إليكم من دنياكم النساء والطيب ، وقال تعالى : { والطيبات للطيبين } \\[ النور : 26 \\] . ثم إن نساء النبي عليه الصلاة والسلام يتفاضلن بينهن .والتقييد بقوله : { إن اتقيتن } ليس لقصد الاحتراز عن ضد ذلك وإنما هو إلْهاب وتحريض على الازدياد من التقوى ، وقريب من هذا المعنى قول النبي صلى الله عليه وسلم لحفصة : \" إن عبد الله يعني أخاها رجل صالح لو كان يَقوم من الليل \" فلما أبلغت حفصة ذلك عبد اللَّه بن عمر لم يترك قيام الليل بعد ذلك لأنه علم أن المقصود التحريض على القيام .وفعل الشرط مستعمل في الدلالة على الدوام ، أي إن دمتنّ على التقوى فإن نساء النبي صلى الله عليه وسلم مُتَّقِيات من قبلُ ، وجواب الشرط دل عليه ما قبله .واعلم أن ظاهر هذه الآية تفضيل أزواج النبي صلى الله عليه وسلم على جميع نساء هذه الأمة . وقد اختُلِف في التفاضل بين الزوجات وبين بنات النبي صلى الله عليه وسلم وعن الأشعري الوقف في ذلك ، ولعل ذلك لتعارض الأدلة السمعية ولاختلاف جهات أصول التفضيل الدينية والروحية بحيث يعسر ضبطها بضوابط . أشار إلى جملة منها أبو بكر بن العربي في «شرح الترمذي» في حديث رؤيا رجل من أصحاب النبي صلى الله عليه وسلم أنه رأى ميزاناً نزل من السماء فوُزن النبي صلى الله عليه وسلم وأبو بكر ، فرجح النبي صلى الله عليه وسلم ووُزن أبو بكر وعُمر فرجح أبو بكر ، ووُزن عمر وعثمان فرجح عُمر ، ثم رُفع الميزان .والجهات التي بنى عليها أبو بكر بن العربي أكثرها من شؤون الرجال . وليس يلزم أن تكون بنات النبي ولا نساؤه سواء في الفضل . ومن العلماء مَن جزموا بتفضيل بنات رسول الله صلى الله عليه وسلم على أزواجه وبخاصة فاطمة رضي الله عنها وهو ظاهر كلام التفتزاني في كتاب «المقاصد» . وهي مسألة لا يترتب على تدقيقها عمل فلا ينبغي تطويل البحث فيها .والأحسن أن يكون الوقف على { إن اتقيتن } ، وقوله { فلا تخضعن } ابتداء تفريع وليس هو جواب الشرط .فُرع على تفضيلهن وترفيع قدرهن إرشادُهُنّ إلى دقائق من الأخلاق قد تقع الغفلة عن مراعاتها لخفاء الشعور بآثارها ، ولأنها ذرائع خفية نادرة تفضي إلى ما لا يليق بحرمتهن في نفوس بعض ممن اشتملت عليه الأمة ، وفيها منافقوها .وابتدىء من ذلك بالتحذير من هيئة الكلام فإن الناس متفاوتون في لينه ، والنساءُ في كلامهن رقّة طبيعية وقد يكون لبعضهن من اللطافة ولِين النفس ما إذا انضمّ إلى لينها الجبليّ قرُبت هيئته من هيئة التَدلّل لقلة اعتياد مثله إلا في تلك الحالة . فإذا بدا ذلك على بعض النساء ظَنّ بعض من يُشافِهُها من الرجال أنها تتحبّب إليه ، فربما اجترأت نفسُه على الطمع في المغازلة فبدرت منه بادرة تكون منافية لحرمة المرأة ، بله أزواج النبي صلى الله عليه وسلم اللاتي هنّ أمهات المؤمنين .والخضوع : حقيقته التذلّل ، وأطلق هنا على الرقة لمشابهتها التذلل .والباء في قوله : { بالقول } يجوز أن تكون للتعدية بمنزلة همزة التعدية ، أي لا تُخضعن القول ، أي تَجعَلْنَه خاضعاً ذليلاً ، أي رقيقاً متفكّكا . وموقع الباء هنا أحسن من موقع همزة التعدية لأن باء التعدية جاءت من باء المصاحبة على ما بيّنه المحققون من النحاة أن أصل قولك : ذهبت بزيد ، أنك ذهبتَ مصاحباً له فأنت أذهبته معك ، ثم تنوسي معنى المصاحبة في نحو : { ذهب الله بنورهم } \\[ البقرة : 17 \\] ، فلما كان التفكك والتزيين للقول يتبع تفكك القائل أسند الخضوع إليهن في صورة ، وأفيدت التعدية بالباء . ويجوز أن تكون الباء بمعنى ( في ) ، أي لا يكن منكُن لِين في القول .والنهي عن الخضوع بالقول إشارة إلى التحذير مما هو زائد على المعتاد في كلام النساء من الرقة وذلك ترخيم الصوت ، أي ليكن كلامكن جزلاً .والمرض : حقيقته اختلال نظام المزاج البدني من ضعف القوة ، وهو هنا مستعار لاختلال الوازع الديني مثل المنافقين ومن كان في أول الإيمان من الأَعراب ممن لم ترسخ فيه أخلاق الإسلام ، وكذلك من تخلّقوا بسوء الظن فيرمون المحصنات الغافلات المؤمنات ، وقضية إفك المنافقين على عائشة رضي الله عنها شاهد لذلك .وتقدم في قوله تعالى : { في قلوبهم مرض } في سورة البقرة ( 10 ) .وانتصب يطمَع } في جواب النهي بعد الفاء لأن المنهي عنه سبب في هذا الطمع .وحذف متعلِق { فيطمع } تنزهاً وتعظيماً لشأن نساء النبي صلى الله عليه وسلم مع قيام القرينة .وعَطْفُ { وقلن قولاً معروفاً } على { لا تَخْضَعْنَ بالقول بمنزلة الاحتراس لئلا يحسبن أن الله كلفهن بخفض أصواتهن كحديث السرار .والقول : الكلام .والمعروف : هو الذي يألفه الناس بحسب العُرففِ العام ، ويشمل القول المعروف هيئة الكلام وهي التي سيق لها المقام ، ويشمل مدلولاته أن لا ينتهرن من يكلمهن أو يسمعنه قولاً بذيئاً من باب : فليقل خيراً أو ليصمت . وبذلك تكون هذه الجملة بمنزلة التذييل .\n\n",
      "translations": [
        {
          "translation": "(0 ye wives of the Prophet! Ye are not like any other women) you are not like the rest of women in relation to transgression, obedience, reward and punishment. (If ye keep your duty (to Allah)) if you obey Allah and His Messenger, (then be not soft of speech) with strangers, (lest he in whose heart is a disease) lust for 476 adultery (aspire (to you), but utter customary speech) straight speech, containing no ambiguity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ ناداهن سبحانه تعظيماً لهن\n وتنبيهاً عليهن فقال: { يٰنِسَآءَ ٱلنَّبِيِّ } الأفضل الأكمل من بين الأنبياء والرسل\n كما أن صلى الله عليه وسلم ليس في الكرمة والنجابة كآحاد الناس\n بل ليس كآحاد الأنبياء والرسل\n كذلك { لَسْتُنَّ } أيضاً\n لنسبتكنَّ إليه صلى الله عليه وسلم { كَأَحَدٍ } أ ي: كواحدة { مِّنَ ٱلنِّسَآءِ } لأن فضيلته صلى الله عليه وسلم تسري إليكن\n فعليكن ألاَّ تغفلن عنها\n ولا تذهلن عن مقتضاها ورعاية حقوقها\n بل من شأنكن التحصن والتقوى\n والتحرز من ملهيات الهوى مطلقاً\n فلكن { إِنِ ٱتَّقَيْتُنَّ } يعني: إن أردتن أن تتصفن بالتقوى عن محارم الله { فَلاَ تَخْضَعْنَ } أي: لا تُلن وتلطفن { بِٱلْقَوْلِ } وقت احتياجكن إلى التكلم مع آحاد الرجال من الأجانب\n ولا تجبن عن سؤالهم هينات لينات مريبات\n مثل تكلم النساء المريدات لأنواع الفسادات مع المفسدين من الرجال { فَيَطْمَعَ ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } وميل إلى الفجور إليكن بعدما سمع منكن تليينكن في قولكن { وَ } بالجملة: { قُلْنَ } بعدما تحتجن إلى التكلم معهم ضرورة { قَوْلاً مَّعْرُوفاً } [الأحزاب: 32] مستحسناً عقلاً وشرعاً\n بعيداً عن الريبة المثيرة للطمع\n خالياً عن وصمة الملاينة المحركة للشهوات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا نساء النبي لستُنَّ كأحدٍ من النساء } أي: لستن كجماعة من جماعات النساء\n أي: إذا تقصيت أمة النساء\n جماعةً جماعةً\n لم توجد منهن جماعة واحدة تُساويكن في الفضل\n فكما أنه ـ عليه الصلاة والسلام ـ ليس كأحد من الرجال\n كما قال:\n \" إني لسْتُ كَأَحَدِكُمْ\n\n\n \" \nكذلك زوجاته التي شرُفن به\n وأصل \" أحد \": وَحَدٍ\n بمعنى: واحد\n فوضع في النفي العامّ\n مستوياً فيه المذكّر والمؤنّث\n والواحد وما وراءه\n أي: لستن في الشرف كأحد من النساء\n { إنِ اتقيْتنَّ } مخالفةَ الله ورضا رسوله\n { فلا تَخْضَعْنَ بالقولِ } أي: إذا كلمتن الرجال من وراء الحجاب\n فلا تجئنَ بقولكنّ خاضعاً\n أي: ليناً خنثاً مثل قول المُريبات\n { فيَطْمَع الذي في قلبه مرضٌ } ريبة\n وفجور\n وهو جواب النهي\n { وقُلْنَ قولاً معروفاً } حسناً مع كونه خشيناً\n  { وقَرْنَ في بُيُوتِكُنَّ } أي: استكِن فيه\n والْزَمن بيوتكن من غير خروج\n وقرأ نافع وعاصم بالفتح\n وهو من: قرَر يَقْرَرُ\n لغة في قرّ بالمكان\n وأصله: اقرَرن\n فحذفت الراء\n تخفيفاً\n وألقيت فتحتها على ما قبلها\n وقيل: من: قار يقار: إذا اجتمع\n والباقون بالكسر\n من: قرّ بالمكان يقِرّ ـ بالكسر\n وأصله: اِقْررْن\n فنقلت كسرة الراء إلى القاف\n وحذفت الراء\n وقيل: من: وَقَر يَقِر وقاراً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:4",
      "similarity": 0.7314353786718794
    },
    {
      "verse": "5:84",
      "similarity": 0.20455884085819476
    },
    {
      "verse": "74:15",
      "similarity": 0.20338166180040665
    },
    {
      "verse": "7:56",
      "similarity": 0.1982951268780057
    },
    {
      "verse": "70:38",
      "similarity": 0.19625235570522978
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}