{
  "chapter": "الأحزاب",
  "text": "واذ تقول للذى انعم الله عليه وانعمت عليه امسك عليك زوجك واتق الله وتخفى فى نفسك ما الله مبديه وتخشى الناس والله احق ان تخشىه فلما قضى زيد منها وطرا زوجنكها لكى لا يكون على المؤمنين حرج فى ازوج ادعيائهم اذا قضوا۟ منهن وطرا وكان امر الله مفعولا",
  "translations": [
    {
      "translation": "When you said to him whom Allah has blessed and you yourself have greatly favoured, 'Keep your wife to yourself and have taqwa of Allah,' while concealing something in yourself which Allah wished to bring to light, you were fearing people when Allah has more right to your fear. Then when Zayd divorced her We married her to you so that there should be no restriction for the muminun regarding the wives of their adopted sons when they have divorced them. Allah's command is always carried out.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you said to him who had been favoured by God and was favoured by you: \"Keep your wife to yourself and fear God,\" you were hiding something God was about to bring to light, for you had fear of men, though you should fear God more. And when Zaid was through with her, We gave her to you in marriage, so that it may not remain a sin for the faithful (to marry) the wives of their adopted sons when they are through with them. God's command is to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), call to mind when you said to him whom Allah had favoured and you had favoured: “Cleave to your wife and fear Allah,” and you concealed within yourself for fear of people what Allah was to reveal, although Allah has greater right that you fear Him. So when Zayd had accomplished what he would of her, We gave her in marriage to you so that there should not be any constraint for the believers regarding the wives of their adopted sons after they had accomplished whatever they would of them. And Allah's command was bound to be accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the person to whom you and God have granted favor, \"Keep your wife and have fear of God. You hide within yourself what God wants to make public. You are afraid of people while it is God whom one should fear.\" When Zayd set her free, We gave her in marriage to you so that the believers would not face difficulties about the wives of their adopted sons when they are divorced. God's decree has already been issued.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet, remember when you said to him upon whom Allah has bestowed favour and you had bestowed favour, “Keep your wife with you, and fear Allah”, and you kept in your heart what Allah willed to make known, and you feared criticism from the people; and Allah has more right that you should fear Him; so when Zaid became unconcerned with her, We gave her to you in marriage, so that there may be no sin upon believers in respect of the wives of their adopted sons when they have become unconcerned with them; and the command of Allah must be carried out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you said to him on whom Allah has bestowed grace and you have done a favor: \"Keep your wife to yourself, and have Taqwa of Allah.\" But you did hide in yourself that which Allah will make manifest, you did fear the people whereas Allah had a better right that you should fear Him. So, when Zayd had completed his aim with her, We gave her to you in marriage, so that there may be no difficulty to the believers in respect of the wives of their adopted sons when the latter have no desire to keep them. And Allah's command must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said to him to whom Allah had shown favor and to whom you had shown a favor: Keep your wife to yourself and be careful of (your duty to) Allah; and you concealed in your soul what Allah would bring to light, and you feared men, and Allah had a greater right that you should fear Him. But when Zaid had accomplished his want of her, We gave her to you as a wife, so that there should be no difficulty for the believers in respect of the wives of their adopted sons, when they have accomplished their want of them; and Allah's command shall be performed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou saidst to him whom God had blessed and thou hadst favoured, 'Keep thy wife to thyself, and fear God,' and thou wast concealing within thyself what God should reveal, fearing other men; and God has better right for thee to fear Him. So when Zaid had accomplished what he would of her, then We gave her in marriage to thee, so that there should not be any fault in the believers, touching the wives of their adopted sons, when they have accomplished what they would of them; and God's commandment must be performed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou saidst unto him on whom Allah hath conferred favour and thou hast conferred favour: Keep thy wife to thyself, and fear Allah. And thou didst hide in thy mind that which Allah was to bring to light, and thou didst fear mankind whereas Allah hath a better right that thou shouldst fear Him. So when Zeyd had performed that necessary formality (of divorce) from her, We gave her unto thee in marriage, so that (henceforth) there may be no sin for believers in respect of wives of their adopted sons, when the latter have performed the necessary formality (of release) from them. The commandment of Allah must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You said to the man who had been favoured by God and by you, \"Keep your wife to yourself and have fear of God.\" You sought to hide in your heart what God wished to reveal. You were afraid of people, whereas it would have been more proper to fear God. When Zayd divorced his wife, We gave her to you in marriage, so that there should be no restriction on believers marrying the spouses of their adopted sons when they have divorced them. The commandment of God must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thou wast saying unto him on whom Allah had conferred favour and thou hadst conferred favour: keep thy wife to thyself and fear Allah; so and thou wast concealing in thy mind that which Allah was going to disclose, and thou wast fearing mankind, whereas Allah had a better right that Him thou shouldst fear. Then when Zaid had performed his purpose concerning her, We wedded her to thee, that there should be no blame for believers in respect of wives of their adopted sons, when they have performed their purpose concerning them. And the ordinance of Allah was to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you said to him whom Allah had blessed, and whom you [too] had blessed, ‘Retain your wife for yourself, and be wary of Allah,’ and you had hidden in your heart what Allah was to divulge, and you feared the people though Allah is worthier that you should fear Him, so when Zayd had got through with her, We wedded her to you, so that there may be no blame on the faithful in respect of the wives of their adopted sons, when the latter have got through with them, and Allah’s command is bound to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! Thou didst say to one who had received the grace of Allah and thy favour: \"Retain thou (in wedlock) thy wife, and fear Allah.\" But thou didst hide in thy heart that which Allah was about to make manifest: thou didst fear the people, but it is more fitting that thou shouldst fear Allah. Then when Zaid had dissolved (his marriage) with her, with the necessary (formality), We joined her in marriage to thee: in order that (in future) there may be no difficulty to the Believers in (the matter of) marriage with the wives of their adopted sons, when the latter have dissolved with the necessary (formality) (their marriage) with them. And Allah's command must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you said to him (Zaid bin Harithah, the freedslave of the Prophet SAW) on whom Allah has bestowed Grace (by guiding him to Islam) and you (O Muhammad SAW too) have done favour (by manumitting him) \"Keep your wife to yourself, and fear Allah.\" But you did hide in yourself (i.e. what Allah has already made known to you that He will give her to you in marriage) that which Allah will make manifest, you did fear the people (i.e., Muhammad SAW married the divorced wife of his manumitted slave) whereas Allah had a better right that you should fear Him. So when Zaid had accomplished his desire from her (i.e. divorced her), We gave her to you in marriage, so that (in future) there may be no difficulty to the believers in respect of (the marriage of) the wives of their adopted sons when the latter have no desire to keep them (i.e. they have divorced them). And Allah's Command must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you said to he whom Allah had favored and yourself have favored: 'Keep your wife and fear Allah' and you sought to hide in yourself what Allah was to reveal, fearing people; although Allah has a better right for you to fear Him. And when Zayd had accomplished what he would of her (divorce), We gave her to you (Prophet Muhammad) in marriage, so that there is no fault in believers concerning (marriage to) the former spouse of their foster children if they divorced them. The decree of Allah must be done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you said to him whom God had blessed, and you had favored, “Keep your wife to yourself, and fear God.” But you hid within yourself what God was to reveal. And you feared the people, but it was God you were supposed to fear. Then, when Zaid ended his relationship with her, We gave her to you in marriage, that there may be no restriction for believers regarding the wives of their adopted sons, when their relationship has ended. The command of God was fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember, O Muhammad], when you said to the one on whom Allah bestowed favor and you bestowed favor, \"Keep your wife and fear Allah,\" while you concealed within yourself that which Allah is to disclose. And you feared the people, while Allah has more right that you fear Him. So when Zayd had no longer any need for her, We married her to you in order that there not be upon the believers any discomfort concerning the wives of their adopted sons when they no longer have need of them. And ever is the command of Allah accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:37] And when (idh is dependent because of [an implied preceding] udhkur, ‘mention [when]’) you said to him to whom God had shown favour, by [guiding him to] Islam, and to whom you [too] had shown favour: by manumitting him — this was Zayd b. Hāritha, who had been a prisoner of war before [the coming of] Islam (in the period of al-jāhiliyya). The Messenger of God (s) purchased him before his call to prophethood, and then manumitted him and adopted him as his son — ‘Retain your wife for yourself and fear God’, before divorcing her. But you had hidden in your heart what God was to disclose, [what] He was to manifest of your love for her and of [the fact] that should Zayd part with her you would marry her, and you feared people, would say, ‘He has married his son’s wife!’, though God is worthier that you should fear Him, in all things, so take her in marriage and do not be concerned with what people say. Zayd subsequently divorced her and her [obligatory] waiting period was completed. God, exalted be He, says: So when Zayd had fulfilled whatever need he had of her, We joined her in marriage to you — the Prophet consummated his marriage with her without [the customary] permission [from her legal guardian] and gratified the Muslims with [a feast of] bread and meat — so that there may not be any restriction for the believers in respect of the wives of their adopted sons, when the latter have fulfilled whatever wish they have of them. And God’s commandment, that which He has decreed, is bound to be realised.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ فَلَمَّا قَضَى زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا (37){ وَإِذْ تَقُولُ للذى أَنعَمَ الله عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ واتق الله وَتُخْفِى فِى نِفْسِكَ مَا الله مُبْدِيهِ وَتَخْشَى الناس والله أَحَقُّ أن تَخْشَاهُ ب } .و { إذ } اسم زمان مفعول لفعل محذوف تقديره : اذْكُر ، وله نظائر كثيرة . وهو من الذكر بضم الذال الذي هو بمعنى التذكُّر فلم يأمره الله بأن يذكر ذلك للناس إذ لا جدوى في ذلك ولكنه ذَكَّر رسوله صلى الله عليه وسلم ليُرتب عليه قوله : { وتخفي في نفسك ما الله مبديه } . والمقصود بهذا الاعتبارُ بتقدير الله تعالى الأسبابَ لمسبباتها لتحقيق مراده سبحانه ، ولذلك قال عقبه : { فلما قضى زيد منها وطراً زوجناكها } إلى قوله : { وكان أمر اللَّه مفعولاً } وقوله : { وكان أمر الله قدراً مقدوراً } \\[ الأحزاب : 38 \\] .وهذا مبدأ المقصود من الانتقال إلى حكم إبطال التبنّي ودحض ما بناه المنافقون على أساسِه الباطِل بناءً على كفر المنافقين الذين غَمزوا مغامز في قضية تزوّج رسول الله صلى الله عليه وسلم زينبَ بنت جحش بعد أن طلّقها زيد بن حارثة فقالوا : تزوج حليلة ابنه وقد نهَى عن تزوج حلائل الأبناء . ولذلك ختمت هذه القصة وتوابعها بالثناء على المؤمنين بقوله : { هو الذي يصلي عليكم } \\[ الأحزاب : 43 \\] الآية . وبالإِعراض عن المشركين والمنافقين وعن أذاهم .وزيد هو المعنيُّ من قوله تعالى : { للذي أنعم الله عليه وأنعمت عليه } ، فالله أنعم عليه بالإِيمان والخلاص من أيدي المشركين بأن يسَّر دخولَه في ملك رسوله صلى الله عليه وسلم والرسول عليه الصلاة والسلام أنعم عليه بالعتق والتبنّي والمحبة ، ويأتي التصريح باسمه العلم إثر هذه الآية في قوله : { فلما قضى زيد منها وطراً } وهو زيد بن حارثة بن شُراحيل الكلبي من كَلْب بن وَبَرة وبنو كلب من تغلب . كانت خيل من بني القين بن جَسْر أغاروا على أبيات من بني مَعن من طيء ، وكانت أم زيد وهي سعدى بنت ثعلبة من بني مَعْن خرجت به إلى قومها تَزورهم فسبقته الخيل المُغيرة وباعوه في سوق حُباشة ( بضم الحاء المهملة ) بناحية مكة فاشتراه حكيم بن حِزام لعمته خديجةَ بنت خويلد زوج رسول الله صلى الله عليه وسلم قبل أن يتزوّجها رسول الله صلى الله عليه وسلم فلمّا تزوجها رسول الله صلى الله عليه وسلم وهبته خديجة لرسول الله صلى الله عليه وسلم ( وزيد يومئذٍ ابن ثمان سنين ) وذلك قبل البعثة ، فحج ناس من كلب فرأوا زيداً بمكة فعرفوه وعرفهم فأعلموا أباه ووصفوا موضعه وعند مَن هو ، فخرج أبوه حارثة وعمه كعب لفدائه فدخلا مكة وكَلَّمَا النبي صلى الله عليه وسلم في فدائه ، فأتى به النبي صلى الله عليه وسلم إليهما فعرفهما ، فقال له النبي عليه الصلاة والسلام :« اخترني أو اخترهما » . قال زيد : ما أنا بالذي أختار عليك أحداً ، فانصرف أبوه وعمّه وطابت أنفسهما ببقائه ، فلما رأى النبي صلى الله عليه وسلم منه ذلك أخرجه إلى الحِجر وقال : « يا من حضَرَ اشهدوا أن زيداً ابني يرثني وأرثه » فصار ابناً للنبيء صلى الله عليه وسلم على حكم التبني في الجاهلية وكان يُدعى : زيد بنَ محمد .وكان رسول الله صلى الله عليه وسلم زوَّجه أمَّ أيمن مولاته فولدت له أسامة بن زيد وطلقها . ثم إن رسول الله صلى الله عليه وسلم زوّجه زينب بنت جَحش الأسدي حليف آل عبد شمس وهي ابنة عمته أُميمة بنت عبد المطلب ، وهو يومئذٍ بمكة . ثم بعد الهجرة آخى النبي صلى الله عليه وسلم بينه وبين حمزة بن عبد المطلب ولما بطل حكم التبنّي بقوله تعالى : { وما جعل أدعياءَكم أبناءَكم } \\[ الأحزاب : 4 \\] صار يُدْعى : حِبَّ رسول الله . وفي سنة خمس قبل الهجرة بعد غزوة الخندق طلق زيد بن حارثة زينب بنت جحش فزوجه رسول الله صلى الله عليه وسلم أمَّ كلثوم بنت عقبة بن أبي معيط وأمها البيضاء بنت عبد المطلب وولدت له زيد بن زيد ورقية ثم طلّقها ، وتزوج دُرَّة بنت أبي لهب ، ثم طلّقها وتزوج هند بنت العوام أخت الزبير .وشهد زيد بدراً والمغازي كلّها . وقُتل في غزوة مُؤتة سنة ثمان وهو أمير على الجيش وهو ابن خمس وخمسين سنة .وزوجُ زيد المذكورة في الآية هي زينبُ بنت جَحْش الأسدية وكان اسمها بَرَّة فلما تزوجها النبي صلى الله عليه وسلم سمّاها زَينب ، وأبوها جحش من بني أسد بن خزيمة وكان أبوها حليفاً لآل عبد شمس بمكة وأمها أُميمة بنت عبد المطلب عمةُ رسول الله صلى الله عليه وسلم تزّوجها زيد بن حارثة في الجاهلية ثم طلّقها بالمدينة ، وتزوجها النبي صلى الله عليه وسلم سنة خمس ، وتوفيت سنة عشرين من الهجرة وعمرها ثلاث وخمسون سنة ، فتكون مولودة سنة ثلاث وثلاثين قبل الهجرة ، أي سنة عشرين قبل البعثة .والإِتيان بفعل القول بصيغة المضارع لاستحضار صورة القول وتكريره مثل قوله تعالى : { يجادلنا في قوم لوط } \\[ هود : 74 \\] وقوله : { ويصنع الفلك } \\[ هود : 38 \\] ، وفي ذلك تصوير لحثِّ النبي صلى الله عليه وسلم زيداً على إمساك زوجه وأن لا يطلقها ، ومعاودته عليه .والتعبير عن زيد بن حارثة هنا بالموصول دون اسمه العَلم الذي يأتي في قوله : { فلما قضى زيد } لما تشعر به الصلة المعطوفة وهي { وأنعمت عليه } من تنزه النبي صلى الله عليه وسلم عن استعمال ولائه لحمله على تطليق زوجه ، فالمقصود هو الصلة الثانية وهي { وأنعمت عليه } لأن المقصود منها أن زيداً أخص الناس به ، وأن الرسول عليه الصلاة والسلام أحرص على صلاحه وأنه أشار عليه بإمساك زوجه لصلاحها به ، وأما صلة { أنعم الله عليه } فهي توطئة للثانية .واعلم أن المأثور الصحيح في هذه الحادثة : أن زيد بن حارثة بقيت عنده زينب سنين فلم تلد له ، فكان إذا جرى بينه وبينها ما يجري بين الزوجين تارة من خلاف أدلّت عليه بسؤددها وغضّت منه بولايته فلما تكرّر ذلك عزم على أن يطلقها وجاء يُعلم رسول الله صلى الله عليه وسلم بعزمه على ذلك لأنه تزوجها من عنده .وروي عن علي زين العابدين : أن الله أوحى إلى النبي صلى الله عليه وسلم أنه سينكح زينب بنت جحش . وعن الزهري : نزل جبريل على النبي صلى الله عليه وسلم يُعلمه أن الله زوّجه زينب بنت جحش وذلك هو ما في نفسه . وذكر القرطبي أنه مختار بكر بن العلاء القشيري وأبي بكر بن العربي .والظاهر عندي : أن ذلك كان في الرؤيا كما أُري أنه قال لعائشة : \" أتاني بككِ الملك في المنام في سَرَقَة من حرير يقول لي : هذه امرأتك فأكْشِفُ فإذا هي أنتتِ فأقول : إن يكن هذا من عند الله يُمضه \" . فقول النبي صلى الله عليه وسلم لزيد : \" أمسك عليك زوجك \" توفية بحقّ النصيحة وهو أمر نصح وإشارة بخير لا أمر تشريع لأن الرسول عليه الصلاة والسلام في هذا المقام متصرف بحق الولاء والصحبة لا بصفة التشريع والرسالة ، وأداء هذه الأمانة لا يتأكد أنه كان يعلم أن زينب صائرة زوجاً له لأن علم النبي بما سيكون لا يقتضي إجراءَه إرشادَه أو تشريعه بخلاف علمه أو ظنه فإن النبي صلى الله عليه وسلم كان يعلم أن أبا جهل مثلاً لا يؤمن ولم يمنعه ذلك من أن يبلغه الرسالة ويعاوده الدعوة ، ولأن رغبته في حصول شيء لا تقتضي إجراء أمره على حسب رغبته إن كانت رغبته تخالف ما يحمِل الناسَ عليه ، كما كان يرغب أن يقوم أَحد بقتل عبدَ الله بنَ سعد بن أبي سرح قبل أن يسمع منه إعلانه بالتوبة من ارتداده حين جاء به عثمان بن عفان يوم الفتح تائباً .ولذلك كله لا يعد تصميم زيد على طلاق زينب عصياناً للنبي صلى الله عليه وسلم لأن أمره في ذلك كان على وجه التوفيق بينه وبين زوجه . ولا يلزم أحداً المصير إلى إشارة المشير كما اقتضاه حديث بريرة مع زوجها مغيث إذ قال لها : «لو راجعته؟ فقالت : يا رسول الله تأمرني؟ قال : لا إنما أنا أشفع ، قالت : لا حاجة لي فيه» .وقوله : { أمسك عليك زوجك } يؤذن بأنه جواب عن كلام صدر من زيد بأن جاء زيد مستشيراً في فراق زوجه ، أو معلماً بعزمه على فراقها .و { أمسك عليك } معناه : لازِم عشرتها ، فالإِمساك مستعار لبقاء الصحبة تشبيهاً للصاحب بالشيء الممسَك باليد .وزيادة { عليك } لدلالة ( على ) على الملازمة والتمكن مثل { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] أو لتضمن { أمسك } معنى احبس ، أي ابق في بيتك زوجك ، وأمرُه بتقوى الله تابع للإِشارة بإمساكها ، أي اتق الله في عشرتها كما أمر الله ولا تحِدْ عن واجب حسن المعاشرة ، أي اتق الله بملاحظة قوله تعالى : { فإمساك بمعروف } \\[ البقرة : 229 \\] .وجملة { وتخفى في نفسك ما الله مبديه } عطف على جملة { تقول } . والإِتيان بالفعل المضارع في قوله : { وتخفي } للدلالة على تكرر إخفاء ذلك وعدم ذكره والذي في نفسه علمه بأنه سيتزوج زينب وأن زيداً يُطَلّقها وذلك سرّ بينه وبين ربّه ليس مما يجب عليه تبليغه ولا مما للناس فائدة في علمه حتى يبلَّغوه؛ ألا ترى أنه لم يُعلم عائشة ولا أباهَا برؤيا إتياننِ الملَك بها في سَرَقةٍ من حرير إلا بعد أن تزوجها .فما صْدَقُ «ما في نفسك» هو التزوج بزينب وهو الشيء الذي سيبديه الله لأن الله أبدى ذلك في تزوج النبي صلى الله عليه وسلم بها ولم يكن أحد يعلم أنه سيتزوجها ولم يُبْدِ الله شيئاً غير ذلك ، فلزم أن يكون ما أخفاه في نفسه أمراً يصلح للإظهار في الخارج ، أي أن يكون من الصور المحسوسة .وليست جملة { وتخفي في نفسك } حالاً من الضمير في { تقول } كما جعله في «الكشاف» لأن ذلك مبني على توهم أن الكلام مسوق مساق العتاب على أن يقول كلاماً يخالف ما هو مخفيّ في نفسه ولا يستقيم له معنى ، إذ يفضي إلى أن يكون اللائق به أن يقول له غير ذلك وهو ينافي مقتضى الاستشارة ، ويفضي إلى الطعن في صلاحية زينب للبقاء في عصمة زيد ، وقد استشعر هذا صاحب «الكشاف» فقال : «فإن قلت فماذا أراد الله منه أن يقوله حين قال له زيد : أُريدُ مفارقتها ، وكان من الهُجنة أن يقول له : افعَلْ فإني أريد نكاحَها . قلت : كأنَّ الذي أراد منه عز وجل أن يصمُت عند ذلك أو يقول : أنتَ أعلم بشأنك حتى لا يخالف سِرّه في ذلك علانيته» ا ه وهو بناء على أساس كونه عتاباً وفيه وهَن .وجملة { وتخشى الناس } عطف على جملة { وتخفي في نفسك } ، أي تخفي ما سيبديه الله وتخشى الناس من إبدائه .والخشية هنا كراهية ما يرجف به المنافقون ، والكراهةُ من ضروب الخشية إذ الخشية جنس مقول على أفراده بالتشكيك فليست هي خشية خوف ، إذ النبي صلى الله عليه وسلم لم يكن يخاف أحداً من ظهور تزوجه بزينب ، ولم تكن قد ظهرت أراجيف المنافقين بعدُ ، ولكن النبي صلى الله عليه وسلم كان يتوسم من خبثهم وسوء طويتهم ما يبعثهم على القالة في الناس لفتنة الأمة ، فكان يعلم ما سيقولونه ويمتعض منه ، كما كان منهم في قضية الإِفك ، ولم تكن خشيةً تبلغ به مبلغَ صرفه عما يرغبه بدليل أنه لم يتردد في تزوج زينب بعد طلاق زيد ، ولكنها استشعار في النفس وتقدير لما سيرجفه المنافقون .والتعريف في { الناس } للعهد ، أي تخشى المنافقين ، أي يؤذوك بأقوالهم .وجملة { والله أحق أن تخشاه } معترضة لمناسبة جريان ذكر خشية الناس ، والواو اعتراضية وليست واو الحال ، فمعنى الآية معنى قوله تعالى : { فلا تخشوا الناس واخشون } \\[ المائدة : 44 \\] . وحملها على معنى الحال هو الذي حمل كثيراً من المفسرين على جعل الكلام عتاباً للنبيء صلى الله عليه وسلمو { أحق } اسم تفضيل مسلوب المفاضَلَة فهو بمعنى حقيق ، إذ ليس في الكلام السابق ما يفيد وقوع إيثار خشية الناس على خشية الله ، ولا ما يفيد تعارضاً بين الخشيتين حتى يحتاج إلى ترجيح خشية الله على خشية الناس ، والمعنى : والله حقيق بأن تخشاه .وليس في هذا التركيب ما يفيد أنه قدم خشية الناس على خشية الله ، لأن الله لم يكلفه شيئاً فعمل بخلافه .وبهذا تعلم أن النبي صلى الله عليه وسلم ما فعل إلا ما يرضي الله ، وقد قام بعمل الصاحب الناصح حين أمر زيداً بإمساك زوجه وانطوى على علم صالح حين خشي ما سيفترصه المنافقون من القالة إذا تزوج زينب خفية أن يكون قولهم فتنة لضعفاء الإِيمان كقوله للرجلين اللذين رأياه في الليل مع زينبَ فأسرعا خُطاهما فقال : « على رسلكما إنما هي زينب » . فكبر ذلك عليهما وقالا : سبحان الله يا رسول اللَّه . فقال : « إن الشيطان يجري من ابن آدم مجرى الدم وإني خشيت أن يقذف في قلوبكما » . فمقام النبي صلى الله عليه وسلم في الأمة مقام الطبيب الناصح في بيمارستانَ يحوي أصنافاً من المرضى إذا رأى طعاماً يجلب لما لا يصلح ببعض مرضاه أن ينهى عن إدخاله خشية أن يتناوله من المرضى من لا يصلح ذلك بمرضه ويزيد في علته أو يفضي إلى انتكاسه .وليس في قوله : { وتخشى الناس } عتاب ولا لوم ، ولكنه تذكير بما حصل له من توقيه قالة المنافقين . وحمله كثير من المفسرين على معنى العتاب وليس من سياق الكلام ما يقتضيه فأحسبهم مخطئين فيه ، ولكنه تشجيع له وتحقير لأعداء الدين وتعليم له بأن يمضي في سبيله ويتناول ما أباح الله له ولرسله من تناول ما هو مباح من مرغوباتهم ومحباتهم إذا لم يصدهم شيء من ذلك عن طاعة ربهم كما قال تعالى : { ما كان على النبي من حرج فيما فرض الله له سنة الله في الذين خلوا من قبل وكان أمر الله قدراً مقدوراً الذين يبلغون رسالات الله ويخشونه ولا يخشون أحداً إلا الله } \\[ الأحزاب : 38 ، 39 \\] ، وأن عليه أن يعرض عن قول المنافقين ، وعلى نحو قوله : { لعلك باخع نفسك ألا يكونوا مؤمنين }\\[ الشعراء : 3 \\] ، فهذا جوهر ما أشارت إليه الآية ، وليس فيها ما يشير إلى غير ذلك .وقد رويت في هذه القصة أخبار مخلوطة ، فإياك أن تتسرب إلى نفسك منها أغلوطة ، فلا تصْغغِ ذهنك إلى ما ألصقه أهل القصص بهذه الآية من تبسيط في حال النبي صلى الله عليه وسلم حين أمر زيداً بإمساك زوجه ، فإن ذلك من مختلقات القصاصين؛ فإما أن يكون ذلك اختلافاً من القصاص لتزيين القصة ، وإما أن يكون كله أو بعضه من أراجيف المنافقين وبهتانهم فتلقفه القصاص وهو الذي نجزم به . ومما يدل لذلك أنك لا تجد فيما يؤثر من أقوال السلف في تفسير هذه الآية أثراً مسنداً إلى النبي صلى الله عليه وسلم أو إلى زيد أو إلى زينب أو إلى أحد من الصحابة رجالهم ونسائهم ، ولكنها كلها قصص وأخبار وقيل وقال .ولسوء فهم الآية كبر أمرها على بعض المسلمين واستفزّت كثيراً من الملاحدة وأعداء الإسلام من أهل الكتاب . وقد تصدى أبو بكر بن العربي في «الأحكام» لوهن أسانيدها وكذلك عياض في «الشفاء» .والآن نريد أن ننقل مجرى الكلام إلى التسليم بوقوع ما روي من الأخبار الواهية السند لكي لا نترك في هذه الآية مهواة لأحد . ومجموع القصة من ذلك : أن النبي صلى الله عليه وسلم جاء بيت زيد يسأل عنه فرأى زينب متفضلة ، وقيل رفعتْ الريحُ ستار البيت فرأى النبي عليه الصلاة والسلام زينب فجأة على غير قصد فأعجبه حسنها وسبَّح للَّه ، وأن زينب علمت أنه وقعت منه موقع الاستحسان وأن زيداً علم ذلك وأنه أحب أن يطلقها ليؤثر بها مولاه النبي صلى الله عليه وسلم وأنه لما أخبر النبي صلى الله عليه وسلم بذلك قال له : { أمسك عليك زوجك } ( وهو يودّ طلاقها في قلبه ويعلم أنها صائرة زوجاً له ) .وعلى تفاوت أسانيده في الوهن أُلقي إلى الناس في القصة فانتُقل غَثه وسمينه ، وتُحُمِّل خِفه ورزينه ، فأخذ منه كلٌّ ما وسعه فهمُه ودينه ، ولو كان كله واقعاً لما كان فيه مغمز في مقام النبوءة .فأما رؤيته زينب في بيت زيد إن كانت عن عمد فذلك أنه استأذن في بيت زيد ، فإن الاستئذان واجب فلا شك أنه رأى وجهها وأعجبته ولا أحسب ذلك لأن النساء لم يكُنَّ يستْرنَ وجوههن قال تعالى : { ولا يبدين زينتهن إلا ما ظهر منها } \\[ النور : 31 \\] ( أي الوجه والكفين ) وزيد كان من أشد الناس اتصالاً بالنبي ، وزينبُ كانت ابنةَ عمته وزوجَ مولاه ومتبنّاه ، فكانت مختلطة بأهله ، وهو الذي زوجها زيداً ، فلا يصح أن يكون ما رآها إلا حين جاء بيتَ زيد ، وإن كانت الريح رفعت الستر فرأى من محاسنها وزينتها ما لم يكن يراه من قبلُ ، فكذلك لا عَجب فيه لأن رؤية الفُجأة لا مؤاخذة عليها ، وحصولَ الاستحسان عقب النظر الذي ليس بحرام أمر قهري لا يملك الإنسان صرفه عن نفسه ، وهل استحسان ذات المرأة إلا كاستحسان الرياض والجنّات والزهور والخيل ونحو ذلك مما سماه الله زينة إذا لم يتبعه النظار نظرة .وأما ما خطر في نفس النبي صلى الله عليه وسلم من مودة تزوجها فإن وقع فما هو بخطب جليل لأنه خاطر لا يملك المرء صرفه عن نفسه وقد علمت أن قوله : { وتخشى الناس } ليس بلوم ، وأن قوله : { والله أحق أن تخشاه } ليس فيه لوم ولا توبيخ على عدم خشية الله ولكنه تأكيد لعدم الاكتراث بخشية الناس .وإنما تظهر مجالات النفوس في ميادين الفُتوة بمقدار مصابرتها على الكمال في مقاومة ما ينشأ عن تلك المَرائِي من ضعف في النفوس وخور العزائم وكفاك دليلاً على تمكن رسول الله صلى الله عليه وسلم من هذا المقام وهو أفضل من ترسخ قدمه في أمثاله أنه لم يزل يراجع زيداً في إمساك زوجه مشيراً عليه بما فيه خير له وزيد يرى ذلك إشارةً ونصحاً لا أمراً وشرعاً .ولو صح أن زيداً علم مودة النبي صلى الله عليه وسلم تزوج زينب فطلقها زيد لذلك دون أمر من النبي عليه الصلاة والسلام ولا التماس لما كان عجباً فإنهم كانوا يؤثرون النبي صلى الله عليه وسلم على أنفسهم ، وقد تنازل له دِحية الكلبي عن صفية بنت حُيَي بعد أن صارت له في سهمه من مغانم خَيبر ، وقد عرض سعد بن الربيع على عبد الرحمان بن عوف أن يتنازل له عن إحدى زوجتيه يختارها للمؤاخاة التي آخى النبي صلى الله عليه وسلم بينهما .وأما إشارة النبي عليه الصلاة والسلام على زيد بإمساك زوجه مع علمه بأنها ستصير زوجة له فهو أداء لواجب أمانة الاستنصاح والاستشارة ، وقد يشير المرء بالشيء يعلمه مصلحةً وهو يوقن أن إشارته لا تمتثل . والتخليط بين الحالين تخليط بين التصرف المستند لما تقتضيه ظواهر الأحوال وبين ما في علم اللَّه في الباطن ، وأشبه مقام به مقام موسى مع الخضر في القضايا الثلاث . وليس هذا من خائنة الأعين ، كما توهمه من لا يُحسن ، لأن خائنة الأعين المذمومة ما كانت من الخيانة والكيد .وليس هو أيضاً من الكذب لأن قول النبي عليه الصلاة والسّلام لزيد { أمسك عليك زوجك واتق الله } لا يناقض رغبته في تزوجها وإنما يناقضه لو قال : إنّي أُحب أن تمسك زوجك ، إذ لا يخفى أن الاستشارة طلب النظر فيما هو صلاح للمستشير لا ما هو صلاح للمستشار . ومن حق المستشار إعلام المستشير بما هو صلاح له في نظر المشير ، وإن كان صلاح المشير في خلافه ، فضلاً على كون ما في هذه القصة إنما هو تخالُف بين النصيحة وبين ما علمه الناصح من أن نصحه لا يؤثّر .فإن قلت : فما معنى ما روي في الصحيح عن عائشة أنها قالت : لو كان رسول الله كاتماً شيئاً من الوحي لكتم هذه الآية : { وإذ تقول للذي أنعم الله عليه وأنعمت عليه أمسك عليك زوجك } الآية .قلت : أرادت أن رغبة النبي صلى الله عليه وسلم في تزوج زينب أو إعلام الله إياه بذلك كان سراً في نفسه لم يطلع عليه أحدٌ إذ لم يؤمر بتبليغه إلى أحد . وعلى ذلك السر انبنى ما صدر منه لزيد من قوله : { أمسك عليك زوجك } . فلما طلقها زيد ورام تزوجها علم أن المنافقين سيرجفون بالسوء ، فلما أمره الله بذكر ذلك للأمة وتبليغ خَبره بلَّغه ولم يكتمه مع أنه ليس في كتمه تعطيل شرع ولا نقص مصلحة ، فلو كان كاتماً لكتم هذه الآية التي هي حكاية سر في نفسه وبينه وبين ربّه تعالى ، ولكنه لما كان وحياً بلّغه لأنه مأمور بتبليغ كل ما أنزل إليه .واعلم أن للحقائق نِصابها ، وللتصرفات موانعها وأسبابَها ، وأن الناس قد تمتلكهم العوائد ، فتحول بينهم وبين إدراك الفوائد ، فإذا تفشَّت أحوال في عاداتهم استحسنوها ولو ساءت ، وإذا ندرت المحامد دافعوها إذا رامت مداخلة عقولهم وشاءت ، وكل ذلك من تحريف الفطرة عن وضعها ، والمباعدة بين الحقائق وشرعها .ولما جاء الإسلام أخذ يغزو تلك الجيوش ليقلعها من أقاصيها ، وينزلها من صياصيها ، فالحسن المشروع ما تشهد الفطرة لحسنه ، والقبيح الممنوع الذي أماتته الشريعة وأمرت بدفنه .{ فَلَمَّا قضى زَيْدٌ مِّنْهَا وَطَراً زوجناكها لِكَىْ لاَ يَكُونَ عَلَى المؤمنين حَرَجٌ فى أَزْوَاجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْاْ مِنْهُنَّ وَطَراً وَكَانَ أَمْرُ اللهِ مَفْعُولاً } .تفريع على جملة { وإذ تقول للذي أنعم الله عليه وأنعمت عليه } الآية ، وقد طوي كلام يدل عليه السياق ، وتقديره : فلم يقبل منك ما أشرت عليه ولم يمسكها .ومعنى { قضى } استوفى وأتم . واسم { زيد } إظهار في مقام الإضمار لأن مقتضى الظاهر أن يقال : فلما قضى منها وطراً ، أي قضى الذي أنعم الله وأنعمت عليه ، فعدل عن مقتضى الظاهر للتنويه بشأن زيد . قال القرطبي : قال السهيلي : كان يقال له زيد بن محمد فلما نزع عنه هذا الشرف حين نزل { ادعوهم لآبائهم } \\[ الأحزاب : 5 \\] وعلم الله وحشته من ذلك شرّفه بخصيصة لم يكن يخص بها أحداً من أصحاب محمد صلى الله عليه وسلم وهي أنه سماه في القرآن ، ومن ذكره الله تعالى باسمه في الذكر الحكيم نوّه غاية التنويه ا ه .والوطر : الحاجة المهمة ، والنهمة قال النابغة :فمن يكن قد قضى من خَلة وطَراً ... فإنني منككِ ما قَضَّيت أوطاريوالمعنى : فلما استتم زيد مدة معاشرة زينب فطلقها ، أي فلما لم يبق له وطرٌ منها .ومعنى { زوجناكها } أَذِنَّا لك بأن تتزوجها ، وكانت زينب أيِّماً فتزوجها الرسول عليه الصّلاة والسّلام برضاها .وذكر أهل السِير : أنها زوّجها إياه أخوها أبو أحمد الضرير واسمه عبد بن جَحش ، فلما أمره الله بتزوجها قال لزيد بن حارثة : ما أجد في نفسي أوثق منك فاخطُب زينب عليَّ ، قال زيد : فجئتها فوليتها ظهري توقيراً لرسول الله صلى الله عليه وسلم وقلت : يا زينب أرسل رسول الله يذكرك . فقالت : ما أنا بصانعة شيئاً حتى أُوَامر ربي ، وقامت إلى مسجدها وصلَّت صلاة الاستِخارة فرضيت ، فجاء رسول الله صلى الله عليه وسلم فدخل فبنى بها . وكانت زينب تفخر على نساء النبي صلى الله عليه وسلم وتقول : زوجكنَّ آباؤكن وزوّجني ربّي . وهذا يقتضي إن لم يتول أخوها أبو أحمد تزويجها فتكون هذه خصوصية للنبيء صلى الله عليه وسلم عند الذين يشترطون الولي في النكاح كالمالكيّة دون قول الحنفية . ولم يذكر في الروايات أنّ النبي عليه الصلاة والسلام أصدقها فعدّه بعض أهل السير من خصوصياته صلى الله عليه وسلم فيكون في تزوُّجها خصوصيتان نبويّتان .وأشار إلى حكمة هذا التزويج في إقامة الشريعة ، وهي إبطال الحرج الذي كان يتحرجه أهل الجاهلية من أن يتزوج الرجل زوجة دَعِيِّه ، فلما أبطله الله بالقول إذ قال : { وما جعل أدعياءكم أبناءكم } \\[ الأحزاب : 4 \\] أكد إبطاله بالفعل حتى لا يبقى أدنى أثر من الحرج أن يقول قائل : إن ذاك وإن صار حلالاً فينبغي التنزه عنه لأهل الكمال ، فاحتيط لانتفاء ذلك بإيقاع التزوج بامرأة الدعيّ من أفضل الناس وهو النبي صلى الله عليه وسلموالجمع بين اللام وكي توكيد للتعليل كأنه يقول : ليست العلة غير ذلك ، ودلت الآية على أن الأصل في الأحكام التشريعية أن تكون سواء بين النبي صلى الله عليه وسلم والأمة حتى يدل دليل على الخصوصية .وجملة { وكان أمر الله مفعولاً } تذييل لجملة { زوجناكها } . وأمر الله يجوز أن يراد به من أمر به من إباحة تزوج من كنّ حلائل الأدعياء ، فهو بمعنى الأمر التشريعي فيه . ومعنى { مفعولاً } أنه متّبع ممتثل فلا يتنزه أحد عنه ، قال تعالى : { قل من حرم زينة الله التي أخرج لعباده والطيبات من الرزق } \\[ الأعراف : 32 \\] .ويجوز أن يراد الأمر التكويني وهو ما علم أنه يكون وقَدّر أسباب كونه ، فيكون معنى { مفعولاً } واقعاً ، والأمر من إطلاق السبب على المسبب ، والمفعول هو المسبب .وتزوُّج النبي صلى الله عليه وسلم زينب من أمر الله بالمعنيين .\n\n",
      "translations": [
        {
          "translation": "(And when thou saidst unto him on whom Allah hath conferred favour) through Islam, i.e. Zayd (and thou hast conferred favour) on him by emancipating him: (Keep thy wife to thyself) and do not divorce her, (and fear Allah) and fear Allah and do not let her go. (And thou didst hide in your mind) her love and the desire to marry her (that which Allah was to bring to light) in the Qur'an, (and thou didst fear mankind) and you feel ashamed of people because of this (whereas Allah had a better right that thou shouldst fear Him) whereas you should be ashamed of Allah. (So when Zayd had performed the necessary formality (of divorce) from her) when she has finished her waiting period after her divorce from Zayd, (We gave her unto thee in marriage, so that (henceforth)) after you (there may be no sin for believers about wives of their adopted sons, when the latter have performed the necessary formality (of release) from them) when they had finished their waiting period after they are divorced or after the death of their husband. (The commandment of Allah) marrying Zayd to Muhammad (pbuh) (must be fulfilled) must take place. 477\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً } الوطرُ: الحَاجةُ والإِربُ\n وزيدُ: هو زيد بن حارثة الكَلبي رضي الله تعالى عنه مولى النبي صلى الله عليه وعَلَى آله وسلَّم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And when Zayd had finished with her}, {wa-qadha Zaydun minha wa-taran}: need and yearning.\n\n\nWazeefa: This is Wazeefa, the son of Haritha al-Kalbi, may Allah be pleased with him, the companion of the Prophet Muhammad (peace and blessings of Allah be upon him and his family).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعت يا أكمل الرسل من زيد ما سمعت اذكر { إِذْ تَقُولُ لِلَّذِيۤ أَنعَمَ ٱللَّهُ عَلَيْهِ } بأن وفقه للإيمان وقبول الإسلام\n وشرفه بشرف خدمتك وصحبتك { وَأَنْعَمْتَ عَلَيْهِ } بأن أعتقته ودعوته ابناً { أَمْسِكْ عَلَيْكَ زَوْجَكَ } بعدم لم يريك منها شيئاً { وَٱتَّقِ ٱللَّهَ } المنتقم الغيور\n واحذر عن بطشه بطلاق العفيفة\n والمفارقة منها بلا وصمة عيب ظهرت عنها\n وسمة نقص لاحت منها { وَ } أنت يا أكمل الرسل حينئذٍ { تُخْفِي فِي نَفْسِكَ } حين قولك لزيد هذا { مَا ٱللَّهُ } المظهر لما في الصدور { مُبْدِيهِ } مظهره ومعلنه من ميلك إلى زينب ونكاحها\n وأرادتك لطلاق زيد وافتراقه عنها { وَ } سبب إخفائك هذا\n وإظهارك ضد مطلوبك أنك { تَخْشَى ٱلنَّاسَ } من أن يعيروك بمناكحة زوجة عتيقك ودعيتك\n ويرموك بما لا يليق بشأنك\n مع أنك بريء عنه { وَٱللَّهُ } المطلع على جميع ما ظهر وبطن { أَحَقُّ } وأولى من { أَن تَخْشَاهُ } وتستحي منه\n إذ هو سبحانه غيور ينتقم عمن يشاء\n ويأخذه على من يشاء\n\n\nوهذا عتاب شديد وتأديب بليغ\n قالت عائشة - رضي الله عنها: لو كتم النبي شيئاً مما أنزل إليه لكتم هذه الآية\n فطلقها زيد ومضى عليها العدة\n قال صلى الله عليه وسلم: اذهب فاذكرها عليَّ فذهب\n فقال: يا زينب إن نبي الله أرسنلي إليك بذكرك\n فقالت: ما أنا بصانعة شيئاً حتى أؤمر من ربي\n وقامت إلى الصلاة\n فنزلت: { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا } أي: من زينب { وَطَراً } أي: حاجة\n وطلقها ومضت عدتها { زَوَّجْنَاكَهَا } يعني: زوجناك يا أكمل الرسل زينب بلا نصب ولي من الجانبين على المعهود في الشرع\n بل أبحنا لك الدخول عليها بلا عقد\n وجعلناها زوجتك بلا مهر\n لذلك كانت تباهي على سائر نسائه صلى الله عليه وسلم قائلة: إن الله تولى نكاحي\n وأنتن زوجكن أولياؤكن\n\n\nفدخل صلى الله عليه وسلم بلا إذن\n ولا عقد نكاح\n ولا صداق\n ولا شهود\n وأطعم الناس خبزاً ولحماً\n ثمَّ قال سبحانه: { لِكَيْ لاَ } يعني: فعلنا ذلك\n لكيلا { يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ } ضيق وإثم { فِيۤ } تزوج { أَزْوَاجِ أَدْعِيَآئِهِمْ } الذين تبنوهم { إِذَا قَضَوْاْ مِنْهُنَّ وَطَراً } يعني: بعدما طقوهن وسرحوهن سراحاً جميلاً { وَكَانَ أَمْرُ ٱللَّهِ } وحكمه المبرم\n المثبت في لوح قضائه { مَفْعُولاً } [الأحزاب: 37] مقضياً نافذاً كائناً على تعاقب الأحيان والأزمان\n\n\nثمَّ قال سبحانه تسليةً لنبيه\n وحطاً عنه العار في أمثال هذه الأفعال الكائنة في قضاء الله\n المقضية في حضرة علمه: { مَّا كَانَ } أي: ما لحق وعرض { عَلَى ٱلنَّبِيِّ } المؤيَّد من عند الله بأنواع التأييدات المنتظرة على لاوحي الإلهام في جميع أفعاله وأعماله { مِنْ حَرَجٍ } ضيق وإثم سآمة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهو زيد بن حارثة: { أمسِكْ عليك زوجك } زينب\n { واتقِ اللهَ } فلا تطلقها\n وهو نهي تنزيه\n أو: اتقِ الله\n فلا تذمها بالنسبة إلى الكِبْر وأذى الزوج\n { وتخفي في نفسك ما الله مُبْديهِ } أي: تُخفي في نفسك نكاحها إن طلقها زيد\n وقد أبداه الله وأظهره\n وقيل: الذي أخفاه في نفسه: تعلُّق قلبه بها\n ومودة مفارقة زيد إياها\n قال شيخ شيوخنا سيدي عبد الرحمن الفاسي: والصواب أن المعنى: وتُخفي في نفسك ما اطلعت عليه من مفارقة زيد لها\n وتزوجك إياها بعده\n فإن هذا هو الذي أبداه سبحانه وأظهره بعد ذلك\n وأما قوله: { وتخشى الناسَ واللهُ أحقُّ أن تخشاه } فإنما يعني به الحياء من الناس في أن يقابلهم بما يسوؤهم\n وهو إخبار زيد بما أطلعه الله عليه من صيرورة زوجته زينب له\n بعد مفارقة زيد لها\n لأنه لم يؤمر بإفشاء ذلك\n وإلا لبلَّغ من غير رَوية ولا حشمة\n سالكاً في ذلك سُنَّة مَن خلا قبله من الأنبياء\n الذين لا يخشون في التبليغ أحداً إلا الله\n  وقال القشيري: أي: تخشى عليهم أن يقعوا في الفتنة في قصة زيد [والفتنة التي يقعون فيها هي ظنهم أنه عليه الصلاة والسلام عشقها\n وأمره بطلاقها] وكانت تلك الخشية إشفاقاً منه عليهم\n ورحمة لهم ألا يُطيقوا سماع هذه الحالة\n بأن يخطر ببالهم ما ليس في وسعهم\n وأما قوله: { أمسك عليك\n\n\n } الآية ـ مع علمه بما يؤول إليه الأمر في العاقبة\n بما أطلعه الله عليه من فراقه لها ـ فإقامة الشريعة\n هـ\n ملخصاً\n  وفي الوجيز: { وتخشى الناس } أي: تكره مقالة الناس لو قلت طَلِّقْها\n فيقال: أمر رجلاً فطلّق امرأته ثم تزوجها\n وقد نقل في نوادر الأصول عن عليّ بن الحسين: أن الله أعلم نبيه أنها تكون من أزواجه\n فأخفى ذلك\n فلما جاء زيد يشكوها قال له: اتقِ الله\n وأمسك عليك زوجك\n قال: فعليُّ بن حسين جاء بها من خزانة العلم\n جوهراً من الجواهر\n ودرًّا من الدرر\n وأنه إنما عتب الله عليه في أنه قد أعلمه\n ثم قال بعد ذلك لزيد: أمسك\n\n\n رعاية لِما يقال\n وتركاً لتدبير الله\n مع كونه أحق بالرعاية\n وكيف\n وفي ذلك تشريع لئلا يكون على المؤمنين حرج وضيق فيما فرض الله له فيما أعلمه\n ثم قال: والحاصل أنه ـ عليه الصلاة والسلام ـ لم يلمّ بخطيئة\n بدليل أنه لم يؤمر بتوبة ولا استغفار\n وإنما أخبره بما أضمر في نفسك\n خشية افتتان الغير\n والله أحق أن يخشى\n بأن يبتهل إليه ليزيل عنهم ما يخشى فيهم\n  قال ابن عرفة: الصواب: أن ما أخفاه في نفسه هو: أن الله أخبره أن سيتزوجها\n وما قاله ابن عطية لا يحل أن يقال\n لأنه تنقيص لم يرد في حديث صحيح\n وإنما ذكره المفسرون\n هـ\n قلت: إنما يكون تنقيصاً إذا كان ذلك الواقع في القلب ثابتاً\n وأما إن كان خاطراً مارًّا فلا نقص إذ ليس في طوق البشر لأنه من أوصاف العبودية\n بل الكمال في دفعه بعد هجومه\n  ثم قال ابن عرفة\n على قوله: { وتخشى الناس } هو تمهيد لعذره\n وإن كان لمجرد أمر الله له بذلك\n ولا ينبغي حمله على أنه خاف الناس فقط\n بل المراد: عتابه على خلط خوفه من الله بخوفه من الناس\n وأَمَرهُ ألا يخاف إلا من الله فقط\n خوفاً غير مشوب بشيء\n هـ\n قلت: إذا فسرنا الخشية بالحياء لا يحتاج إلى هذا التعسُّف\n مع أن الخوف من الخَلْق مذموم\n وحده أو مع خوف الله\n والنبي صلى الله عليه وسلم منزَّه عن ذلك\n أي: تستحي من الناس أن يقولوا: نكح امرأة ابنه\n وكان ـ عليه الصلاة والسلام ـ أشد الناس حياء من العذراء في خدرها\n والحياء ممدوح عند الخاص والعام\n وأما قوله تعالى: { والله أحقُّ أن تخشاه } فتنبيه على أن الحياء في بعض المواضع تركه أَولى\n فهو ترقية له\n وتربية لوقت آخر\n أو: وتخشى أن يفتتن الناس بذلك\n والله أرحم بهم من غيره\n فالله أحق أن تَخشى\n فتبتهل إليه في زوال ذلك عنهم\n والله تعالى أعلم\n الإشارة: في الآية الأولى حث على التفويض وترك الاختيار\n مع ما أمر به الواحد القهّار\n وفي الحِكَم: \" ما ترك من الجهل شيئاً مَن أراد أن يظهر في الوقت غير ما أظهر الله \"\n فالواجب على العبد أن يكون في الباطن مستسلماً لقهره\n وفي الظاهر متمثلاً لأمره\n تابعاً لسُنَّة نبيه صلى الله عليه وسلم\n ولِمَا يُوجب رضاه ومحبته\n وفي الآية الثانية تنبيه على أن خواص الخواص يُعاتبون على ما لا يُعاتب عليه الخواص\n والخواص\n يُعاتبون على ما لا يعاتب عليه العوام\n فكلما علا المقام\n واشتد القرب\n اشتدت المطالبة بالأدب\n ووقع العتاب على أدنى ما يخل بشيء من الأدب\n على عادة الوزراء مع الملك\n وذلك أمر معلوم\n مذوق عند أهل القلوب\n\nوبالله التوفيق\n ثم ذكر تزوجه ـ عليه الصلاة والسلام ـ لزينب بعد مفارقة زيد\n فقال: { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً زَوَّجْنَاكَهَا لِكَيْ لاَ يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِيۤ أَزْوَاجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْاْ مِنْهُنَّ وَطَراً وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولاً مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ ٱللَّهُ لَهُ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوْاْ مِن قَبْلُ وَكَانَ أَمْرُ ٱللَّهِ قَدَراً مَّقْدُوراً ٱلَّذِينَ يُبَلِّغُونَ رِسَالاَتِ ٱللَّهِ وَيَخْشَوْنَهُ وَلاَ يَخْشَوْنَ أَحَداً إِلاَّ ٱللَّهَ وَكَفَىٰ بِٱللَّهِ حَسِيباً }\n  يقول الحق جلّ جلاله: { فلما قضى زيدٌ منها وَطَراً } حاجة\n بحيث ملَّها ولم تبقَ له فيها حاجة\n والوطر: الحاجة\n فإذا بلغ البالغ حاجته من شيء له فيه همّة\n يقال: قضى منه وطراً\n أي: فلما قضى حاجته منها\n وطلقها\n وانقضت عدّتها\n { زوجناكَها }\n رُوي أنها لما اعتدت قال ـ عليه الصلاة والسلام ـ لزيد:\n \" ما أجد أحداً أوثقُ في نفسي منكَ\n أيت زينبَ فاخطبها لي \" \nقال زيدٌ: فأتيتُها وولَّيتُها ظهْرِي\n إعظاماً لأمر النبي صلى الله عليه وسلم\n وقلت: يا زينبُ إنَّ النبي صلى الله عليه وسلم يخطبُك\n فَفَرحَتْ\n وقالت: ما أنا بصانعةٍ شيئاً حتى أؤامِرَ ربِّي\n فقامت إلى مسجدها\n فنزَلَ القرآنُ: { فلما قضى زيد\n\n\n } الآية\n فتزوجها عليه الصلاة والسلام\n ودخل بها حينئذ\n ومَا أوْلَمَ على امْرأةٍ ما أوْلَمَ عليها\n ذبح شاةٍ\n وأطعمَ الناسَ الخبزَ واللحمَ حتى امتد النهار\n وقيل: زوّجه الله تعالى إياها بلا واسطة عقد\n ويؤيده: أنها كانت تقول لسائر أزواج النبي صلى الله عليه وسلم: إن الله زوجني من فوق سبع سماوات\n وأنتن زوَّجَكُنَّ أولياؤكُنَّ\n وكانت تقول للنبي صلى الله عليه وسلم: إني لأدُلّ عليك بثلاث\n ما من نسائك امرأة تدِل عليك بهنّ: جدّي وجدّك واحد\n وإياي أنكحك الله من السماء\n وإن السفير لي جبريل\n ثم علل تزويجه إياها\n فقال: { لكيلا يكون على المؤمنين حرجٌ في أزواج أدعيائهم } الذين يتبنونهم { إِذا قَضَوْا منهنَّ وَطَراً } قال الحسن: ظنت العرب أن حُرمة المتبني مشتبكة كاشتباك الرحم\n فبيّن اللهُ تعالى الفرق بينهما\n وأن حلائل الأدعياء غير محرمة\n وليست كحلائل أبناء الصلب\n قال البيضاوي: وفيه دليل على أن حكمه وحكم الأَمة واحد\n إلا ما خصّه الدليل\n هـ\n { وكان أمرُ اللهِ } الذي يريد أن يكونه { مفعولاً } مكوناً لا محالة\n كما كان تزويج زينب\n  { ما كان على النبيّ من حرجٍ فيما فَرَضَ اللهُ له } أي: حلّ له\n أو: قسم له\n من قولهم: فرض له في الديوان كذا\n وفروض العساكر\n لأرزاقهم\n أي: لا حرج على النبي فيما حلّ له وأمر به\n كتزويج زينب\n أو: قسم له من عدد النساء بلا حدّ\n { سُنَّة الله } مصدر مؤكد لِما قبله من قوله: { ما كان على النبي من حرج } أي: سُنَّ ذلك سُنَّة في الأنبياء الماضين\n وهو: ألا حرج عليهم في الإقدام على ما أحلّ لهم ووسع عليهم في باب النكاح وغيره\n\nوكانت تحتهم المهائر والسراري\n وكانت لداود عليه السلام مائة امرأة\n وثلاثمائة سُرِّية\n { في الَّذين خَلَواْ مِن قبلُ } في الأنبياء الذين مضوا من قبله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:50",
      "similarity": 0.11770210777813418
    },
    {
      "verse": "4:65",
      "similarity": 0.08889313736949123
    },
    {
      "verse": "28:13",
      "similarity": 0.0811783500673581
    },
    {
      "verse": "20:33",
      "similarity": 0.07881721397343097
    },
    {
      "verse": "22:78",
      "similarity": 0.07626649718542194
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}