{
  "chapter": "الأحزاب",
  "text": "ينساء النبى من يات منكن بفحشة مبينة يضعف لها العذاب ضعفين وكان ذلك على الله يسيرا",
  "translations": [
    {
      "translation": "Wives of the Prophet! if any of you commits an obvious act of indecency she will receive double the punishment. That is an easy matter for Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, whosoever of you commits an act of clear shamelessness, her punishment will be doubled. This is how (the innate law of) God works inevitably.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, if any of you commit flagrant indecency, her chastisement shall be doubled. That is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, if anyone among you commits indecency, her torment will be double. This is not at all difficult for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O the wives of the Prophet! If any among you dares to commit an act contrary to decency, for her will be double the punishment of others; and this is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! Whoever of you commits an open Fahishah, the torment for her will be doubled, and that is ever easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the prophet! whoever of you commits an open indecency, the punishment shall be increased to her doubly; and this is easy to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet, whosoever among you commits a flagrant indecency, for her the chastisement shall be doubled; that is easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye wives of the Prophet! Whosoever of you committeth manifest lewdness, the punishment for her will be doubled, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wives of the Prophet! Any one of you who commits a flagrant act of misconduct shall be doubly punished. That is easy enough for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye wives of the Prophet! whosoever of you shall commit a manifest Indecency, doubled for her would be the punishment twice over; and with Allah that is easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! Whoever of you commits a gross indecency, her punishment shall be doubled, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Consorts of the Prophet! If any of you were guilty of evident unseemly conduct, the Punishment would be doubled to her, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! Whoever of you commits an open illegal sexual intercourse, the torment for her will be doubled, and that is ever easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! Whosoever among you commit a flagrant indecency, for her the punishment shall be doubled, that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet! Whoever of you commits a proven indecency, the punishment for her will be doubled. And that would be easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O wives of the Prophet, whoever of you should commit a clear immorality - for her the punishment would be doubled two fold, and ever is that, for Allah, easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:30] O wives of the Prophet! Whoever of you commits manifest indecency (read mubayyana, or mubayyina, meaning [respectively], ‘it has become evident’, meaning, ‘one that is evident’) the chastisement shall be doubled (yudā‘af: a variant reading has [2nd form] yuda‘‘af, and still another has nuda‘‘if, ‘We shall double’, in which case [read] al-‘adhāba, as accusative) for her, in other words, twice the chastisement for other women; and that is easy for God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا نِسَاءَ النَّبِيِّ مَنْ يَأْتِ مِنْكُنَّ بِفَاحِشَةٍ مُبَيِّنَةٍ يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ وَكَانَ ذَلِكَ عَلَى اللَّهِ يَسِيرًا (30)تولى الله خطابهن بعد أن أمر رسوله بتخييرهِنّ فخيرهُنّ فاخترْنَ الله ورسوله والدار الآخرة ، فخاطبهن ربُّهُنّ خطاباً لأنهن أصبحْنَ على عهد مع الله تعالى أن يؤتِيَهُنّ أجراً عظيماً . وقد سمّاه عمر عهداً فإنه كان كثيراً ما يقرأ في صلاة الصبح سورة الأحزاب فإذا بلغ هذه الآية رَفَعَ بها صوته فقيلَ له في ذلك ، فقال : أُذكِّرهُنّ العهدَ ، ولما كان الأجر الموعود منوطاً بالإحسان أُريد تحذيرهن من المعاصي بلوغاً بهن إلى مرتبة الملكية مبالغة في التحذير إذ جعل عذاب المعصية على فرض أن تأتيها إحداهن عذاباً مضاعفاً . ونِدَاؤُهُنّ للاهتمام بما سيُلْقَى إليهن . ونَادَاهُنّ بوصف { نساء النبي } ليعلَمْنَ أن ما سيُلقَى إليهن خبر يناسب علوّ أقدارهِنّ . والنساء هنا مراد به الحلائل ، وتقدم في قوله تعالى : { ونساءَنا ونساءَكم } في سورة آل عمران ( 61 ) . وقرأ الجمهور { يَأتِ } بتحتية في أوله مراعاة لمدلول { مَن } الشرطية لأن مدلولها شيء فأصله عدم التأنيث . وقرأه يعقوب { مَن تأت } بفوقية في أوله مراعاة لِمَا صْدَق { مَن } أي : إحدى النساء . وقرأ الجمهور { يضاعَف } بتحتية في أوله للغائب وفتح العين مبنياً للنائب ورفع { العذابُ } على أنه نائب فاعل . وقرأه ابن كثير وابن عامر { نضَعِّف } بنون العظمة وبتشديد العين مكسورة ونصب { العذابَ } على المفعولية؛ فيكون إظهار اسم الجلالة في قوله بعده : { وكان ذلك على الله يسيراً } إظهاراً في مقام الإضمار . وقرأه أبو عمرو ويعقوب { يُضَعَّف } بتحتية للغائب وتشديد العين مفتوحة . ومفاد هذه القراءات متّحِدُ المعنى على التحقيق .وروى الطبري عن أبي عمرو بن العلاء وعن أبي عبيدة مَعمَر بن المثنَّى : أن بين ضاعف وضَعَّف فرقاً ، فأما ضاعف فيفيد جعْل الشيء مِثْلَيْه فتصير ثلاثة أعْذِبة . وأما ضَعَّف المشدّد فيفيد جَعْل الشيء مثله . قال الطبري : وهذا التفريق لا نعلم أحداً من أهل العلم ادعاه غيرهما . وصيغة التثنية في قوله { ضعفين } مستعملة في إرادة الكثرة كقوله تعالى : { ثم ارجع البصر كرَّتيْن ينقلب إليك البصر خاسئاً وهو حسير } \\[ الملك : 4 \\] لظهور أن البصر لا يرجع خاسئاً وحسيراً من تكرّر النظر مرتين ، والتثنية ترِدُ في كلام العرب كناية عن التكرير ، كقولهم : لَبَّيْك وسَعْديك ، وقولهم : دَوَالَيْك ، ولذلك لا نشتغل بتحديد المضاعفة المرادة في الآية بأنها تضعيف مرة واحدة بحيث يكون هذا العذاب بمقدار ما هو لأمثال الفاحشة مرتين أو بمقدار ذلك ثلاث مرات وذلك ما لم يشتغل به أحد من المفسرين ، وما إعراضهم عنه إلا لأن أفهامهم سبقت إلى الاستعمال المشهور في الكلام ، فما روي عن أبي عمرو وأبي عبيدة لا يلتفت إليه .والفاحشة : المعصية ، قال تعالى : { قل إنما حرَّم ربيَ الفواحش ما ظهر منها وما بطن } \\[ الأعراف : 33 \\] وكلما وردت الفاحشة في القرآن نكرة فهي المعصية وإذا وردت معرفة فهي الزنا ونحوه .والمبيِّنة : بصيغة اسم الفاعل مبالغة في بيان كونها فاحشة ووضوحه حتى كأنها تبيِّن نفسها وكذلك قرأها الجمهور . وقرأ ابن كثير وأبو بكر بفتح الياء ، أي : يبيّنها فاعِلها .والمضاعفة : تكرير شيء ذي مقدار بمثل مقداره .والضعف : مماثل عدد ما . وتقدم في قوله تعالى { فآتِهِمْ عَذَاباً ضِعْفاً من النار } في سورة الأعراف ( 38 ) . ومعنى مضاعفة العذاب : أنه يكون ضعف عذاب أمثال تلك المعصية إذا صدرت من غيرهنّ ، وهو ضعف في القوة وفي المدة ، وأريد : عذاب الآخرة .وجملة وكان ذلك على الله يسيراً } معترضة ، وتقدم القول في نظيرها آنفاً . والمعنى : أن الله يحقق وعيده ولا يمنعه من ذلك أنها زوجة نبيء ، قال تعالى : { كانتا تحتَ عبدَيْن من عِبادنا صالحيْن إلى قوله : { فلم يُغْنِيَا عنهما من الله شيئاً } \\[ التحريم : 10 \\] .والتعريف في { العذاب } تعريف العهد ، أي : العذاب الذي جعله الله للفاحشة .\n\n",
      "translations": [
        {
          "translation": "(0 ye wives of the Prophet! Whosoever of you committeth manifest lewdness) plain adultery with witnesses to testify against you, (the punishment for her will be doubled) flogging and stoning, (and that) punishment (is easy for Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والتحرز عن المكروهات مطلقاً { مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ } وفعلة قبيحة\n وخصلة ذميمة عقلاً وشرعاً { مُّبَيِّنَةٍ } أي: بينة ظاهرة فحشها بنفسها\n أو ظاهرة واضحة قبحها شرعاً وعرفاً - على كلتا القراءتين - { يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ } يعني: عذابكن ضعف عذاب سائر الحرائر لا أزيد منها\n حتى لا يؤدي إلى الظلم المنافي للعدالة الإلهية\n كما يضاعف عذاب سائر الحرائر بالنسبة إلى الإماء { وَكَانَ ذَلِكَ } التضعيف { عَلَى ٱللَّهِ يَسِيراً } [الأحزاب: 30] يعذبكن أن تأتي إحداكنن بها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا نساءَ النبيّ من يأتِ منكن بفاحشةٍ } بسيئة بليغة في القُبح { مُبَيِّنَة } ظاهرٌ فحشها\n من: بيّن\n بمعنى: تبيّن\n وقرأ المكي وشعبة بفتح الياء\n وهي عصيانهنّ رسولَ الله صلى الله عليه وسلم\n ونشوزهن\n قال في المقدمات: كل فاحشة نُعتت في القرآن بالبينة فهي بالنطق\n والتي لم تُنعت بها زنى\n هـ\n { يُضَاعَفْ لها العذابُ ضِعْفين } أي: ضِعفي عذاب غيرهنّ من النساء لأن الذنب منهن أقبح فإنَّ قُبح الذنب يتبع زيادة فضل المذنب والنعمة عليه\n ولذلك قيل: ليست المعصية في القُرب كالمعصية في البُعد\n وليس لأحد من النساء مثل فضل النساء النبي صلى الله عليه وسلم\n ولذا كان الذم للعاصي العالم أشدّ منه للعاصي الجاهل لأن المعصية من العالِم أقبح\n وفي الحديث:\n \" أشدُّ الناس عذاباً يومَ القيامة عالمٌ لم ينفعه الله بعلمه \" \nلقوة الجرأة في العالم دون غيره\n ولهذا أيضاً فضل حدّ الأحرار على العبيد\n ولم يرجح الكافر\n { وكان ذلك } أي: تضعيف العذاب عليهن { على الله يسيراً } هيناً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:169",
      "similarity": 0.47445928312683
    },
    {
      "verse": "7:28",
      "similarity": 0.41783070182152043
    },
    {
      "verse": "27:54",
      "similarity": 0.4035141873233048
    },
    {
      "verse": "4:15",
      "similarity": 0.3716442405386903
    },
    {
      "verse": "29:28",
      "similarity": 0.3573347302528777
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}