{
  "chapter": "الأحزاب",
  "text": "يايها الذين ءامنوا۟ اذا نكحتم المؤمنت ثم طلقتموهن من قبل ان تمسوهن فما لكم عليهن من عدة تعتدونها فمتعوهن وسرحوهن سراحا جميلا",
  "translations": [
    {
      "translation": "You who have iman! when you marry believing women and then divorce them before you have touched them, there is no 'idda for you to calculate for them, so give them a gift and let them go with kindness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, when you marry believing women then divorce them before having (sexual) contact with them, you have no right to demand observance of the 'waiting period' of them. But provide suitably for them, and let them go with honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you marry believing women and then divorce them before you have touched them, you may not require them to observe a waiting period that you might reckon against them. So make provision for them and release them in an honourable manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you marry believing women and then divorce them before the consummation of the marriage, they do not have to observe the waiting period. Give them their provisions and set them free in an honorable manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you marry Muslim women and divorce them without having touched them, so for you there is no waiting period for the women, which you may count; therefore give them some benefit and release them with a proper release.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you marry believing women, and then divorce them before you have sexual intercourse with them, no `Iddah have you to count in respect of them. So, give them a present, and set them free in a handsome manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when you marry the believing women, then divorce them before you touch them, you have in their case no term which you should reckon; so make some provision for them and send them forth a goodly sending forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you marry believing women and then divorce them before you touch them, you have no period to reckon against them; so make provision for them, and set them free with kindliness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye wed believing women and divorce them before ye have touched them, then there is no period that ye should reckon. But content them and release them handsomely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you marry believing women, and divorce them before the marriage is consummated, you are not required to observe a waiting period: make provision for them and release them in an honourable way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! when ye marry believing women and then divorce them before ye have touched them, then there is no waiting-period from you incumbent on them that ye should count. So make provision for them and release them with a seemly release.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When you marry faithful women and then divorce them before you touch them, there shall be no period for you to reckon. But provide for them and release them in a graceful manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye marry believing women, and then divorce them before ye have touched them, no period of 'Iddat have ye to count in respect of them: so give them a present. And set them free in a handsome manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you marry believing women, and then divorce them before you have sexual intercourse with them, no 'Iddah [divorce prescribed period, see (V. 65:4)] have you to count in respect of them. So give them a present, and set them free i.e. divorce, in a handsome manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you marry believing women and divorce them before the marriage is consummated, you have no period to count against them. Provide for them and release them kindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you marry believing women, but then divorce them before you have touched them, there is no waiting period for you to observe in respect to them; but compensate them, and release them in a graceful manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O You who have believed, when you marry believing women and then divorce them before you have touched them, then there is not for you any waiting period to count concerning them. So provide for them and give them a gracious release.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:49] O you who believe if you marry believing women and then divorce them before you have touched them (read tamassūhunna or tumāsūhunna) that is, before you have copulated with them, there shall be no [waiting] period for you to reckon against them, [no] waiting period [needed to preclude pregnancy] or otherwise. But provide for them, give them what they can use for [securing] comforts, in cases where no dowry has been fixed for them; otherwise theirs is to retain half of what was fixed, but no more — this is what Ibn ‘Abbās said and it is [the opinion] followed by al-Shāfi‘ī’; and release them in a gracious manner, leave them be without [the intention to cause them any] harm.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا نَكَحْتُمُ الْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا (49)جاءت هذه الآية تشريعاً لحكم المطلقات قبل البناء بهن أن لا تلزمهن عِدَّة بمناسبة حدوث طلاق زيد بن حارثة زوجه زينب بنت جحش لتكون الآية مخصصة لآيات العدة من سورة البقرة ، فإن الأحزاب نزلت بعد البقرة ، وليخصص بها أيضاً آية العِدّة في سورة الطلاق النازلة بعدها لئلاَّ يظنّ ظانّ أن العدة من آثار العقد على المرأة سواء دخل بها الزوج أم لم يدخل . قال ابن العربي : وأجمع علماء الأمة على أن لا عدّة على المرأة إذا لم يدخل بها زوجها لهذه الآية .والنكاح : هو العقد بين الرجل والمرأة لتكون زوجاً بواسطة وليها . وهو حقيقة في العقد لأن أصل النكاح حقيقة هو الضمّ والإِلصاق فشبه عقد الزواج بالالتصاق والضم بما فيه من اعتبار انضمام الرجل والمرأة فصارا كشيئين متّصلَيْن . وهذا كما سمي كلاهما زوجاً ، ولا يعرف في كلام العرب إطلاق النكاح على غير معنى العقد دون معنى الوطء ولذلك يقولون : نكحت المرأة فُلاناً ، أي تزوجته ، كما يقولون : نكح فلان امرأة . وزعم كثير من مدوِّني اللغة أن النكاح حقيقة في إدخال شيء في آخر . فأخذوا منه أنه حقيقة في الوطء ، ودرج على ذلك الأزهري والجوهري والزمخشري ، وهو بعيد ، وعلى ما بنوه أخطأ المتنبي في استعماله إذ قال :أنكحتُ صم حصاها خُفّ يعملة ... تَغَشْمَرت بي إليكَ السهل والجبلاولا حجة في كلامه ، ولذلك تأوله أبو العلاء المعرّي في معجز أحمد بأنه أراد جمعت بين صم الحصى وخف اليعملة .وتعليق الحكم في العِدَّة بالمؤمنات جرى على الغالب لأن نساء المؤمنين يومئذٍ لم يكنَّ إلا مؤمنات وليس فيهن كتابيات فينسحب هذا الحكم على الكتابية كما شملها حكم الاعتداد إذا وقع مسيسها بطرق القياس .والمس والمسيس : كناية عن الوطء ، كما سمي ملامسة في قوله : { أو لامستم النساء } \\[ النساء : 43 \\] .والعِدّة بكسر العين : هي في الأصل اسم هيئة من العَدّ بفتح العين وهو الحساب فأطلقت العِدّة على الشيء المعدود ، يقال : جاء عِدة رجال ، وقال تعالى : { فعدة من أيام أخر } البقرة ( 184 ) . وغلب إطلاق هذا اللفظ في لسان الشرع على المدة المحددة لانتظار المرأة زواجاً ثانياً ، لأن انتظارها مدة معدودة الأزمان إما بالتعيين وإما بما يحدث فيها من طهر أو وضع حمل فصار اسمَ جنس ولذلك دخلت عليه { مِن } التي تدخل على النكرة المنفية لإِفادة العموم ، أي فما لكم عليهن من جنس العدة .والخطاب في { لكم } للأزواج الذين نكحوا المؤمنات . وجعلت العدة لهم ، أي لأجلهم لأن المقصد منها راجع إلى نفع الأزواج بحفظ أنسابهم ولأنهم يملكون مراجعة الأزواج ما دُمْن في مدة العدّة كما أشار إليه قوله تعالى : { لا تدري لعل الله يحدث بعد ذلك أمراً } \\[ الطلاق : 1 \\] .وقوله : { وبعولتهن أحق بردهن في ذلك إن أرادوا إصلاحاً } \\[ البقرة : 228 \\] . ومع ذلك هي حق أوجبه الشرع ، فلو رام الزوج إسقاط العِدّة عن المطلقة لم يكن له ذلك لأن ما تتضمنه العِدّة من حفظ النسب مقصد من أصول مقاصد التشريع فلا يسقط بالإِسقاط .ومعنى : { تعتدونها } تَعُدّونها عليهن ، أي تعدُّون أيّامها عليهن ، كما يقال : اعتدت المرأة ، إذا قضت أيام عِدّتها .فصيغة الافتعال ليست للمطاوعة ولكنها بمعنى الفعل مثل : اضطُرّ إلى كذا . ومحاولة حمل صيغة المطاوعة على معروف معناها تكلف .ويشبه هذا مَن راجع المعتدة في مدة عِدّتها ثم طلقها قبل أن يمَسَّها فإن المراجعة تشبه النكاح وليست عينه إذ لا تفتقر إلى إيجاب وقبول . وقد اختلف الفقهاء في اعتدادها من ذلك الطلاق ، فقال مالك والشافعي في أحد قوليه وجمهور الفقهاء : إنها تنشىء عِدة مستقبَلة من يومَ طلقها بعد المراجعة ولا تبني على عِدّتها التي كانت فيها لأن الزوج نقض تلك العدة بالمراجعة . ولعل مالكاً نظر إلى أن المسيس بعد المراجعة قد يخفى أمره بخلاف البناء بالزوجة في النكاح فلعله إنما أوجب استئناف العِدة لهذه التهمة احتياطاً للأنساب . وقال عطاء بن أبي رباح والشافعي في أحد قوليه وسعيد بن المسيب وإبراهيم النخعي والحسن وأبو قلابة وقتادة والزهري : تبني على عدتها الأولى التي راجعها فيها لأن طلاقه بعد المراجعة ودون أن يمسها بمنزلة إرداف طلاق ثان على المرأة وهي في عدتها فإن الطلاق المردف لا اعتداد له بخصوصه . ونسب القرطبي إلى داود الظاهري أنه قال : المطلقة الرجعية إذا راجعها زوجها قبل أن تنقضي عِدّتها ثم فارقها قبل أن يمسها إنه ليس عليها أن تتمّ عدتها ولا عدةً مستقبلة لأنها مطلقة قبل الدخول بها ا ه . وهو غريب ، وكلام ابن حزم في «المحلَّى» صريح في أنها تبتدىء العِدة فلعله من قول ابن حزم وليس مذهب داود ، وكيف لو راجعها بعد يوم أو يومين من تطليقها فبماذا تعرف براءة رحمها .وفاء التفريع في قوله : { فمتعوهن } لأن حكم التمتيع مقرّر من سورة البقرة ( 236 ) في قوله : { ومتعوهن على الموسع قدره وعلى المقتر قدره } الخ . والمتعة : عطية يعطيها الزوج للمرأة إذا طلقها . وقد تقدم قوله تعالى : { لا جناح عليكم إن طلقتم النساء مالم تمسوهن أو تفرضوا لهن فريضة ومتعوهن على الموسع قدره وعلى المقتر قدره متاعاً بالمعروف حقاً على المحسنين } \\[ البقرة : 236 \\] فلذلك جيء بالأمر بالتمتيع مفرعاً على الطلاق قبل المسيس .وقد جعل الله التمتيع جبراً لخاطر المرأة المنكسرِ بالطلاق وتقدم في سورة البقرة أن المتعة حق للمطلقة سواء سمي لها صداق أم لم يسم بحكم آية سورة الأحزاب لأن الله أمر بالتمتيع للمطلقة قبل البناء مطلقاً فكان عمومها في الأحوال كعمومها في الذوات ، وليست آية البقرة بمعارضة لهذه الآية إذ ليس فيها تقييد بشرط يَقتضي تخصيص المتعة بالتي لم يسم لها صداق لأنها نازلةٌ في رفع الحرج عن الطلاق قبل البناء وقبل تسمية الصداق ، ثم أمرتْ بالمتعة لِتَينِك المطلقتين فالجمع بين الآيتين ممكن .والسراح الجميل : هو الخلي عن الأذى والإِضرار ومنع الحقوق .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! If ye wed believing women) without naming the amount of their dowry (and divorce them before ye have touched them) before you had sexual intercourse with them, (then there is no period that ye should reckon) by counting the months or the periods of menstruation. (But content them) as is due by divorce by giving them at least a scarf or shawl (and release them handsomely) divorce them without any harm done to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مقتضى إيمانكم { إِذَا نَكَحْتُمُ } وعقدتم { ٱلْمُؤْمِنَاتِ } اللاتي هن أحقاء بنكاحكم من المسلمات والكتابيات { ثُمَّ طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ } أي تطئوهن وتجامعوهن { فَمَا لَكُمْ } أي: ما لزم ووجب لكم فيما يتلى عليكم { عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا } وتحصونها\n كما للمدخلات بهن والمتوفات عنهن من المدة المقدرة في الشرع\n وبعدما لم تلزم عليكم العدة أيها المطلقون { فَمَتِّعُوهُنَّ } أي: أعطوهن المتعة المستحسنة عقلاً وشرعاً إن لم يكن صدقاتهن مقدرة\n وإن كانت مقدرة فأعطونهن نصف ما قدر من المهر بلا تنقيص ومماطلة { وَ } بعد أن أعطيتموهن المتعة أو النصف من المهر المقدر { سَرِّحُوهُنَّ } وأخرجوهن من منازلكم { سَرَاحاً جَمِيلاً } [الأحزاب: 49] إخراجاً ليناً\n بلا ضرر وإضرار\n وتنقيص ما استحققن عليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يا أيها الذين آمنوا إِذا نكحتُم المؤمناتِ } أي: تزوجتموهن. والنكاح في الأصل: الوطء، من: تناكحت الأشجار: إذا التصق بعضها ببعض. وتسمية العقد نكاحاً مجاز لملابسته له، من حيث إنه طريق إليه، كتسمية الخمر إثماً لأنها سببه، ولم يَرد لفظ النكاح في كتاب الله إلا في معنى العقد لأنه لو استعمل في الوطء لكان تصريحاً به، ومن آداب القرآن الكناية عنه بلفظ الملامسة، والمماسة، والقربان، والتغشي، والإتيان، تعليماً للأدب والحياء. وفي تخصيص المؤمنات، مع أن الكتابيات تُساوي المؤمنات في هذا الحُكُم، إشارة إلى أن الأولَى للمؤمن أن ينكح المؤمنة، تخييراً للنطفة. والمعنى: إذا تزوجتم النساء { ثم طلقتموهن مِن قَبْلِ أن تمسوهن } تجامعوهن. والخلوة الصحيحة كالمسّ، { فما لكم عليهن من عِدَّةٍ تعتدُّونها } أي: تستوفون عددها، وتَعُدونها عليهن، من: عددته الدراهم فاعتدها، كقوله: كِلته الطعام فاكتاله. والإسناد إلى الرجال للدلالة على أن العِدَّة تجب على النساء لحق الأزواج، كما يشعر به، { فما لكم } والإتيان بـ \" ثم \" إزاحة ما عسى أن يتوهم أن تراخي الطلاق ربما يمكن الإصابة فتجب العدة. { فمَتّعوهُنّ } بشيء من المال، وهذا في المفوض لها قبل الفرض، وأما المفروض لها، أو المسمى صداقها، فتأخذ نصف مَهرها، ولا متعة لها على المشهور. { وسَرِّحوهن سَرَاحاً جميلاً } أي: لا تمسكوهنّ ضراراً، وأخرجوهن من بيوتكم إذ لا عدة لكم عليهن. قال القشيري: سراحاً جميلاً لا تذكروهن بعد الفراق إلا بخير، ولا تستردوا منهن شيئاً، ولا تجمعوا عليهن سوء الحال والإضرار من جهة المال. هـ. الإشارة: أيها المريدون إذا طلقتم نفوسكم، وغبتم عنها بخمرةٍ قوية، من قَبل أن تمسوهن بمجاهدة ولا مخالفة، فمتعوها بالشهود، وسرحوا فكرتها في ذات المعبود، سَراحاً جميلاً، لا حجر فيه ولا حصر، فمن رزقه الله الغيبة عن نفسه، حتى غاب عن حظوظها وهواها، فقد كفاه الله قتالها، فيدخل الحضرة بلا مشقة ولا تعب، لكنه نادر، وعلى تقدير وجوده يكون ناقص التربية لأنه يكون كمن طُويت له الطُرق للحج، فلا يعرفها كما يعرفها مَن سافر فيها، وكابد مشقتها، وعرف منازلها ومياهها، ووعرها وسهلها، ومخوفها ومأمونها، وكلهم أولياء لله تعالى، لكن طريق التربية أن يكون المريد سلك الطريقة، وقاس شدائد نفسه، وعالجها ليُعالج غيره بما يُعالج نفسه، على يد شيخ عارف بالطريق. وبالله التوفيق. ثم وسَّع على نبيه في باب النكاح فقال تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحْلَلْنَا... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:28",
      "similarity": 0.7279093001961076
    },
    {
      "verse": "16:6",
      "similarity": 0.7211724582615596
    },
    {
      "verse": "2:231",
      "similarity": 0.513406767141864
    },
    {
      "verse": "2:229",
      "similarity": 0.4852899863531938
    },
    {
      "verse": "70:5",
      "similarity": 0.3213155064445831
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}