{
  "chapter": "الأحزاب",
  "text": "ولا تطع الكفرين والمنفقين ودع اذىهم وتوكل على الله وكفى بالله وكيلا",
  "translations": [
    {
      "translation": "Do not obey the kafirun and hypocrites and disregard their abuse of you. Put your trust in Allah. Allah suffices as a Protector.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not listen to the unbelievers and the hypocrites. Ignore what they do to hurt you, and put your trust in God. God is sufficient as protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not yield to the unbelievers and the hypocrites, and disregard the hurt that comes from them, and put your trust in Allah. Allah suffices as the Guardian to entrust one's affairs to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not yield to the disbelievers or the hypocrites. Ignore their annoying you. Trust in God. God is your all Sufficient Protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not please the disbelievers and the hypocrites, and overlook the pain they cause and rely upon Allah; and Allah suffices as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey not the disbelievers and the hypocrites, and harm them not. And put your trust in Allah, and sufficient is Allah as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not compliant to the unbelievers and the hypocrites, and leave unregarded their annoying talk, and rely on Allah; and Allah is sufficient as a Protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey not the unbelievers and the hypocrites; heed not their hurt, but put thy trust in God; God suffices as a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And incline not to the disbelievers and the hypocrites. Disregard their noxious talk, and put thy trust in Allah. Allah is sufficient as Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not yield to those who deny the truth and the hypocrites: ignore their hurtful talk. Put your trust in God; God is your all sufficient guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey thou not the infidels and the hypocrites, and heed not their annoyances, and trust in Allah; and Allah sufficeth as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not obey the faithless and the hypocrites, and disregard their torments, and put your trust in Allah, and Allah suffices as trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey not (the behests) of the Unbelievers and the Hypocrites, and heed not their annoyances, but put thy Trust in Allah. For enough is Allah as a Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey not the disbelievers and the hypocrites, and harm them not (till you are ordered). And put your trust in Allah, and Sufficient is Allah as a Wakil (Trustee, or Disposer of affairs).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not obey the unbelievers and the hypocrites, pay no attention to their hurt. Put your trust in Allah; Allah suffices as a Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not obey the blasphemers and the hypocrites, and ignore their insults, and rely on God. God is a sufficient protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not obey the disbelievers and the hypocrites but do not harm them, and rely upon Allah. And sufficient is Allah as Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:48] And do not obey the disbelievers and the hypocrites, in [assenting to do] what contravenes your Law; and disregard, leave aside, their injuriousness — do not retaliate against them for it until you receive a command [from God] regarding [how to deal with] them. And put your trust in God, for He will suffice you, and God suffices as Guardian, One to Whom matters are entrusted.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ وَدَعْ أَذَاهُمْ وَتَوَكَّلْ عَلَى اللَّهِ وَكَفَى بِاللَّهِ وَكِيلًا (48)جاء في مقابلة قوله : { وبشر المؤمنين } \\[ الأحزاب : 47 \\] بقوله : { ولا تطع الكافرين والمنافقين } تحذيراً له من موافقتهم فيما يسألون منه وتأييداً لفعله معهم حين استأذنه المنافقون في الرجوع عن الأحزاب فلم يأذن لهم ، فنُهي عن الإِصغاء إلى ما يرغبونه فيترك ما أحلّ له من التزوّج ، أو فيعطي الكافرين من الأحزاب ثَمر النخل صلحاً أو نحو ذلك ، والنهي مستعمل في معنى الدوام على الانتهاء .وعلم من مقابلة أمر التبشير للمؤمنين بالنهي عن طاعة الكافرين والمنافقين أن الكافرين والمنافقين هم متعلَّق الإِنذار من قوله : { ونذيراً } \\[ الأحزاب : 45 \\] لأن وصف «بشيراً» قد أخذ متعلّقه فقد صار هذا ناظراً إلى قوله : { ونذيراً } \\[ الأحزاب : 45 \\] .وقوله : { ودع أذاهم } يجوز أن يكون فعل { دع } مراداً به أن لا يعاقبهم فيكون { دع } مستعملاً في حقيقته وتكون إضافة أذاهم من إضافة المصدر إلى مفعوله ، أي دع أذاك إياهم . ويجوز أن يكون { دع } مستعملاً مجازاً في عدم الاكتراث وعدممِ الاغتمام ، فما يقولونه مما يؤذي ويكون إضافة أذاهم من إضافة المصدر إلى فاعله ، أي لا تكترث بما يصدر منهم من أذىً إليك فإنك أجلّ من الاهتمام بذلك ، وهذا من استعمال اللفظ في حقيقته ومجازه . وأكثر المفسرين اقتصروا على هذا الاحتمال الأخير . والوجه : الحمل على كلا المعنيين ، فيكون الأمر بترك أذاهم صادقاً بالإِعراض عما يؤذون به النبي صلى الله عليه وسلم من أقوالهم ، وصادقاً بالكف عن الإِضرار بهم ، أي أن يترفع النبي صلى الله عليه وسلم عن مؤاخذتهم على ما يصدر منهم في شأنه ، وهذا إعراض عن أذى خاص لا عموم له ، فهو بمنزلة المعرف بلام العهد ، فليست آيات القتال بناسخة له .وهذا يقتضي أنه يترك أذاهم ويكلهم إلى عقاب آجل وذلك من معنى قوله : { شاهداً } \\[ الأحزاب : 45 \\] لأنه يشهد عليهم بذلك كقوله : { فتول عنهم حتى حين وأبصرهم } \\[ الصافات : 174 175 \\] .والتوكل : الاعتماد وتفويض التدبير إلى الله . وقد تقدم عند قوله تعالى : { فإذا عزمت فتوكل على الله } في سورة آل عمران ( 159 ) وقوله : { وعلى الله فتوكلوا إن كنتم مؤمنين } في سورة العقود ( 23 ) ، أي اعتمد على الله في تبليغ الرسالة وفي كفايته إياك شر عدوك ، فهذا ناظر إلى قوله : وداعياً إلى الله } \\[ الأحزاب : 46 \\] .وقوله : { وكفى بالله وكيلاً } تذييل لجملة { وتوكل على الله } .والمعنى : فإن الله هو الوكيل الكافي في الوكالة ، أي المجزي من توكّل عليه ما وكله عليه فالباء تأكيد ، وتقدم قوله : { وكفى بالله وكيلاً } في سورة النساء ( 81 ) . والتقدير : كفى الله و { وكيلاً } تمييز .فقد جاءت هذه الجمل الطلبية مقابلة وناظرة للجمل الإِخبارية من قوله : { إنا أرسلناك شاهداً إلى وسراجاً منيراً } \\[ الأحزاب : 45 ، 46 \\] فقوله : { وبشر المؤمنين } \\[ الأحزاب : 47 \\] ناظراً إلى قوله : { ومبشراً } \\[ الأحزاب : 45 \\] .وقوله : { ولا تطع الكافرين } ناظر إلى قوله : { ونذيراً } \\[ الأحزاب : 45 \\] لأنه جاء في مقابلة بشارة المؤمنين كما تقدم .وقوله : { ودع أذاهم } ناظر إلى قوله : { شاهداً } \\[ الأحزاب : 45 \\] كما علمت . وقوله : { وتوكل على الله } ناظر إلى قوله : { وداعياً إلى الله } \\[ الأحزاب : 46 \\] . وأما قوله : { وسراجاً منيراً } \\[ الأحزاب : 46 \\] فلم يذكَر له مقابل في هذه المطالب إلا أنه لما كان كالتذييل للصفات كما تقدم ناسب أن يقابله ما هو تذييل للمطالب ، وهو قوله : { وكفى بالله وكيلاً } . وهذا أقرب من بعض ما في «الكشاف» من وجوه المقابلة ومن بعض ما للآلوسي فانظرهما واحكم .\n\n",
      "translations": [
        {
          "translation": "Allah then went back to the subject of the beginning of the surah, saying: (And incline not) Muhammad (to the disbelievers) of Mecca: Abu Sufyan and his host (and the hypocrites) of Medina. (Disregard their noxious talk) and do not proceed to kill them, Muhammad, (and put thy trust in Allah) rely on Allah. (Allah is sufficient as Trustee) He is sufficient to fulfil His promise to give you victory; it is also said that this means: He is sufficient as a Protector.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعت وظيفتك يا أكمل الرسل مع المؤمنين المسترشدين منك الطالبين هدايتك وشرف صحبتك { لاَ تُطِعِ ٱلْكَافِرِينَ } المصرين على الكفر والعناد المجاهرين به { وَٱلْمُنَافِقِينَ } الذي يخفون كفرهم وضلالهم عنك لمصلحة دنيوية ويظهرون عندك خلاف ما في نفوسهم\n ولا تجلس معهم ولا تصاحبهم أصلاً { وَ } إن آذوك في مرورك عنهم وملاقاتك معهم بغتة { دَعْ أَذَاهُمْ } أي: اتركهم وأذاهم ولا تلتفت إلى الانتقام عنهم\n واصبر على مضضهم\n فإن صبرك يقتلهم عن الغيظ\n ويطفئ لهب غضبهم { وَتَوَكَّـلْ عَلَى ٱللَّهِ } في دفع شرورهم\n وثق إليه { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } [الأحزاب: 48] حسيباً كافياً يكفي عنك مؤنة أعدائك\n ويكفي عنك أذاهم عناية لك واهتماماً بشأنك\n\n\nثمَّ لمَّا أشار سبحانه إلى ما أباح على نبيه صلى الله عليه وسلم بلا حرج أراد أن يشير إلى ما أباح أيضاً على عموم المؤمنين بلا حرج لهم فيه وضيق\n وقال سبحانه منادياً لهم على وجه العموم: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } بالله\n وصدقوا بجميع أوامره ونواهيه المنزلة من عنده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تُطع الكافرين والمنافقين } أي: دُم على مخالفتهم\n وهو تهييج وتنفير عن حالهم\n { ودَعْ أذاهم } أي: لا تلتفت إليه\n ولا تحتفل بشأنه\n وهو من إضافة المصدر إلى الفاعل\n أي: اجعل إيذائهم إياك في جانب\n وأنت في جانب\n ولا تُبال بهم\n ولا تخفْ من إيذائهم\n أو: إلى المفعول\n أي: دع إيذاءك إياهم مجازاةً ومؤاخذة على كفرهم\n ولذلك قيل: إنه منسوخ\n { وتوكلْ على اللهِ } فإنه يكفيكهم\n { وكفى بالله وكيلاً } موكولاً عليه\n ومفوضاً إليه الأمر في الأحوال كلها\n ولعله تعالى لَمّا وصفه بخمسة أوصاف\n قابل كُلاًّ منها بخطاب مناسب له\n فقابل الشاهد بقوله: { وبُشِّر المؤمنين } لأنه يكون شاهداً عل أمته\n وهم يكونون شهداء على سائر الأمم\n وهو الفضل الكبير\n وقابل المبشِّر بالإعراض عن الكافرين والمنافقين لأنه إذا أعرض عنهم أقبل بكليته على المؤمنين\n وهو مناسب للبشارة\n وقابل النذير بدَعْ أذاهم لأنه إذا ترك أذاهم في العاجل\n والأذى له\n لا بد له من عقاب عاجل أو آجل\n كانوا منذرين به في المستقبل\n\nوقابل الداعي إلى الله بأمره بالتوكل عليه لأن مَن توكل على الله يسَّر عليه كل عسير\n فتسهل الدعوة\n ويتيسر أمرها\n وقابل السراج المنير بالاكتفاء به وكيلاً لأن مَن أناره الله وجعله بُرهاناً على جميع خلقه كان حقيقاً بأن يَكتفي به عن جميع خلقه\n والله تعالى أعلم\n الإشارة: قال الورتجبي: إنا أرسلناك بالحقيقة شاهداً\n أنت شاهِدُنا\n شاهدناك وشهدت علينا\n فألبستك أنوار ربوبيتي\n فمَن شهدك بالحقيقة فقد شَهِدنَا\n قُلتُ: لأن نوره صلى الله عليه وسلم أول نور ظهر من نور الحق\n فمَن شَهِدَه شَهِدَ الحق\n ثم قال: ومَن نظر إليك فقد نظر إلينا\n قال صلى الله عليه وسلم:\n \" فقد عرف الحق\n ومَن رآني فقد رأى الحق \" \nثم قال: { وسراجاً منيراً } أسرجت نورك من نوري\n فتُنور بنوري عيون عبادي المؤمنين\n فيأتون إليّ بنورك\n ثم أمره بأن يُبشر المؤمنين بأنهم يصلون إلى مشاهدته\n بلا حجاب ولا عتاب\n هـ\n قال القشيري: يا أيها المُشَرَّفُ مِنْ قِبَلِنا إنّا أرسلناك شاهداً بوحدانيتنا\n ومبشراً\n تُبشر عبادنا بنا\n وتحذِّرُهم مخالفة أَمْرِنا\n وتُعلمهم مواضع الخوف منا\n وداعياً الخلق إلينا بنا\n وسراجاً منيراً يستضيئون بك\n وشمساً ينبسط شعاعك على جميع من صَدَّقَك وآمَنَ بك\n ولا يصل إلينا إلا مَن اتَّبعكَ وخَدَمَك وقَدَّمك\n { وبَشِّر المؤمنين } بفضلنا عليهم\n ونَيْلِهم طَوْلَنا عليهم\n وإحساننا إليهم\n ومَن لم تُؤثِر فيهم بركة إيمانهم بك فلا قَدْرَ لهم عندنا\n ولا تُطع مَن أعرضنا عنه وأضللناه\n من أهل الكفر والنفاق\n وأهل البدع والشقاق\n وتوكل على الله بدوام الانقطاع إليه\n وكفى بالله وكيلاً\n هـ\n ثم ذكر حكم المطلقة بعد الدخول وأنه لا عدة عليها مناسب لقوله { فلما قضي زيد\n\n\n } إلخ فقال: { يٰأَيُّهَا ٱلَّذِينَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:6",
      "similarity": 0.6921852043166471
    },
    {
      "verse": "6:98",
      "similarity": 0.636929344327098
    },
    {
      "verse": "93:3",
      "similarity": 0.44665820407240736
    },
    {
      "verse": "14:12",
      "similarity": 0.2779468113097912
    },
    {
      "verse": "33:3",
      "similarity": 0.23799389219783876
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033048.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033048.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}