{
  "chapter": "الأحزاب",
  "text": "ما كان محمد ابا احد من رجالكم ولكن رسول الله وخاتم النبين وكان الله بكل شىء عليما",
  "translations": [
    {
      "translation": "Muhammad is not the father of any of your men, but the Messenger of Allah and the Final Seal of the Prophets. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any man among you, but a messenger of God, and the seal of the prophets. God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but he is the Messenger of Allah and the seal of the Prophets. Allah has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your males. He is the Messenger of God and the last Prophet. God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mohammed (peace and blessings be upon him) is not the father of any man among you – but he is the Noble Messenger of Allah and the Last of the Prophets*; and Allah knows all things. (* Prophet Mohammed – peace and blessings be upon him – is the Last Prophet. There can be no new Prophet after him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but he is the Messenger of Allah and the last of the Prophets. And Allah is Ever All-Aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but he is the Apostle of Allah and the Last of the prophets; and Allah is cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any one of your men, but the Messenger of God, and the Seal of the Prophets; God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any man among you, but he is the messenger of Allah and the Seal of the Prophets; and Allah is ever Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but is God's Messenger and the seal of the Prophets. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your males, but the apostle of Allah and the seal of the prophets; and Allah of everything is ever the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any man among you, but he is the Apostle of Allah and the Seal of the Prophets, and Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but (he is) the Messenger of Allah, and the Seal of the Prophets: and Allah has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad (SAW) is not the father of any man among you, but he is the Messenger of Allah and the last (end) of the Prophets. And Allah is Ever AllAware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men. He is the Messenger of Allah and the Seal of the Prophets. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men; but he is the Messenger of God, and the seal of the prophets. God is Cognizant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of [any] one of your men, but [he is] the Messenger of Allah and last of the prophets. And ever is Allah, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:40] Muhammad is not the father of any man among you: he is not Zayd’s biological father and so it is not unlawful for him to marry his [former] wife Zaynab [after him]; but, he is, the Messenger of God and the Seal of the Prophets, and so he will not have a son that is a [fully grown] man to be a prophet after him (a variant reading [for khātim al-nabiyyīna] has khātam al-nabiyyīn, as in the instrument [known as a] ‘seal’, in other words, their [prophethood] has been sealed by him). And God has knowledge of all things, among these is the fact that there will be no prophet after him, and even when the lord Jesus descends [at the end of days] he will rule according to his [Muhammad’s] Law.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَكِنْ رَسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا (40)استئناف للتصريح بإبطال أقوال المنافقين والذين في قلوبهم مرض وما يلقيه اليهود في نفوسهم من الشك .وهو ناظر إلى قوله تعالى : { وما جعل أدعياءكم أبناءكم } \\[ الأحزاب : 4 \\] . والغرض من هذا العموم قطعُ توهّم أن يكون للنبيء صلى الله عليه وسلم ولد من الرجال تجري عليه أحكام البنوّة حتى لا يتطرق الإِرجاف والاختلاق إلى من يتزوجهن من أيامى المسلمين أصحابِه مثل أمِّ سلمة وحفصة .و { من رجالكم } وصف ل { أحد } ، وهو احتراس لأن النبي صلى الله عليه وسلم أبو بنات . والمقصود : نفي أن يكون أبا لأحد من الرجال في حين نزول الآية لأنه كان وُلد له أولادٌ أو وَلَدَاننِ بمكة من خديجة وهم الطيّب والطاهر ( أو هما اسمان لواحد ) والقاسم ، ووُلد له إبراهيم بالمدينة من مارية القبطية ، وكلهم ماتوا صبياناً ولم يكن منهم موجود حين نزول الآية .والمنفي هو وصف الأبوّة المباشرة لأنها الغرض الذي سيق الكلام لأجله والذي وَهِم فيه من وَهِم فلا التفات إلى كونه جَدًّا للحسن والحسين ومحسن أبناء ابنته فاطمة رضي الله عنها إذ ليس ذلك بمقصود ، ولا يخطر ببال أحد نفي أبوته لهم بمعنى الأبوة العليا ، أو المراد أبوّة الصلب دون أبوة الرّحم .وإضافة ( رجال ) إلى ضمير المخاطبين والعدول عن تعريفه باللام لقصد توجيه الخطاب إلى الخائضين في قضية تزوج زينب إخراجاً للكلام في صيغة التغليط والتغليظ .وأما توجيهه بأنه كالاحتراز عن أحفاده وأنه قال : { من رجالكم } وأما الأحفاد فهم من رجاله ففيه سماجة وهو أن يكون في الكلام توجيه بأن محمداً صلى الله عليه وسلم بريء من المخاطبين أعني المنافقين وليس بينه وبينهم الصلة الشبيهة بصلة الأبوة الثابتة بطريقة لحن الخطاب من قوله تعالى { وأزواجه أمهاتهم } \\[ الأحزاب : 6 \\] كما تقدم .واستدراك قوله : { ولكن رسول الله } لرفع ما قد يُتوهم مِن نفي أبوته ، من انفصال صلة التراحم والبّرِ بينه وبين الأمة فذُكِّروا بأنه رسول الله صلى الله عليه وسلم فهو كالأب لجميع أمته في شفقته ورحمته بهم ، وفي برّهم وتوقيرهم إياه ، شأن كل نبيء مع أمته .والواو الداخلة على { لكن } زائدة و { لكنْ } عاطفة ولم ترد { لكن } في كلام العرب عاطفة إلاّ مقترنة بالواو كما صرح به المرادي في «شرح التسهيل» . وحرف { لكن } مفيد الاستدراك .وعَطَف صفة { وخاتم النبيئين } على صفة { رسول الله } تكميل وزيادة في التنويه بمقامه صلى الله عليه وسلم وإيماء إلى أن في انتفاء أبوته لأحد من الرجال حكمةً قدَّرها الله تعالى وهي إرادة أن لا يكون إلا مثل الرُّسل أو أفضل في جميع خصائصه .وإذ قد كان الرسل لم يخل عمود أبنائهم من نبيء كان كونه خاتم النبيئين مقتضياً أن لا يكون له أبناء بعد وفاته لأنهم لو كانوا أحياء بعد وفاته ولم تخلع عليهم خلعة النبوءة لأجل ختم النبوءة به كان ذلك غضاً فيه دون سائر الرسل وذلك ما لا يريده الله به .ألا ترى أن الله لما أراد قطع النبوءة من بني إسرائيل بعد عيسى عليه السّلام صرف عيسى عن التزوج .فلا تجعل قوله : { وخاتم النبيئين } داخلاً في حيّز الاستدراك لما علمت من أنه تكميل واستطراد بمناسبة إجراء وصف الرسالة عليه . وببيان هذه الحكمة يظهر حسن موقع التذييل بجملة { وكان الله بكل شيء عليما } إذْ أظهر مقتضى حكمته فيما قدره من الأقدار كما في قوله تعالى : { جعل الله الكعبة البيت الحرام قياماً للناس } إلى قوله : { ذلك لتعلموا أن الله يعلم ما في السماوات وما في الأرض وأن الله بكل شيء عليم } \\[ المائدة : 97 \\] .والآية نصّ في أن محمداً صلى الله عليه وسلم خاتم النبيئين وأنه لا نبيء بعده في البشر لأن النبيئين عام فخاتم النبيئين هو خاتمهم في صفة النبوءة . ولا يعكر على نصيِّة الآية أن العموم دلالتُه على الأفراد ظنية لأن ذلك لاحتمال وجود مخصّص . وقد تحققنا عدم المخصص بالاستقراء .وقد أجمع الصحابة على أن محمداً صلى الله عليه وسلم خاتم الرسل والأنبياء وعُرف ذلك وتواتر بينهم وفي الأجيال من بعدهم ولذلك لم يترددوا في تكفير مسيلمة والأسود العَنْسِي فصار معلوماً من الدين بالضرورة فمن أنكره فهو كافر خارج عن الإِسلام ولو كان معترفاً بأن محمداً صلى الله عليه وسلم رسول الله للناس كلّهم . وهذا النوع من الإِجماع موجب العلم الضروري كما أشار إليه جميع علمائنا ولا يدخل هذا النوع في اختلاف بعضهم في حُجِّية الإِجماع إذ المختلف في حجّيته هو الإِجماع المستند لنظر وأدلة اجتهادية بخلاف المتواتر المعلوم بالضرورة في كلام الغزالي في خاتمة كتاب «الاقتصاد في الاعتقاد» مخالفة لهذا على ما فيه من قلة تحرير . وقد حمل عليه ابن عطية حملة غير منصفة وألزمهُ إلزاماً فاحشاً ينزه عنه علمه ودينه فرحمة الله عليهما .ولذلك لا يتردد مسلم في تكفير من يُثبت نبوءةً لأحد بعد محمد صلى الله عليه وسلم وفي إخراجه من حظيرة الإِسلام ، ولا تعرف طائفة من المسلمين أقدمت على ذلك إلا البابِيَّة والبَهائية وهما نحْلتان مشتقة ثانيتهما من الأولى . وكان ظهور الفرقة الأولى في بلاد فارس في حدود سنة مائتين وألف وتسربت إلى العراق وكان القائم بها رجلاً من أهل شيراز يدعوه أتباعه السيد علي محمد ، كذا اشتهر اسمه ، كان في أول أمره من غلاة الشيعة الإِمامية . أخذ عن رجل من المتصوفين اسمه الشيخ أحمد زين الدين الأَحسائي الذي كان ينتحل التصوف بالطريقة الباطنية وهي الطريقة المتلقاة عن الحلاج . وكانت طريقته تعرف بالشيخية ، ولما أظهر نحلته علي محمد هذا لقبَ نفسه بَاب العلم فغلب عليه اسم الباب .وعرفت نحلته بالبَابِيّة وادعى لنفسه النبوءة وزعم أنه أوحي إليه بكتاب اسمه «البيان» وأن القرآن أشار إليه بقوله تعالى : { خلق الإنسان علمه البيان } \\[ الرحمن : 3 4 \\] .وكتاب «البيان» مؤلف بالعربية الضعيفة ومخلوط بالفارسية . وقد حكم عليه بالقتل فقتل سنة 1266 في تبريز .وأما البهائية فهي شعبة من البابِيّة تنسب إلى مؤسسها الملقّب ببهاء الله واسمه ميرزا حُسين عَلي من أهل طهران تتلمذ للباب بالمكاتبة وأخرجته حكومة شاه العجم إلى بغداد بعد قتل الباب . ثم نقلته الدولة العثمانية من بغداد إلى أدرنة ثم إلى عكا ، وفيها ظهرت نحلته وهم يعتقدون نبوءة الباب وقد التفّ حوله أصحاب نحلة البابيّة وجعلوه خليفة البَاب فقام اسم البهائية مقام اسم البَابية فالبهائية هم البابية . وقد كان البهاء بَنى بناء في جبل الكرمل ليجعله مدفناً لرفات ( الباب ) وآل أمره إلى أن سجنته السلطنة العثمانية في سجن عَكا فلبث في السجن سبعَ سنوات ولم يطلق من السجن إلا عند ما أُعلن الدستور التركي فكان في عداد المساجين السياسيين الذين أُطلقوا يومئذٍ فرحل منتقلاً في أوروبا وأميركا مدة عامين ثم عاد إلى حيفا فاستقرّ بها إلى أن توفي سنة 1340 وبعد موته نشأ شقاق بين أبنائه وإِخوته فتفرقوا في الزعامة وتضاءلت نحلتهم .فمن كان من المسلمين متّبعاً للبَهائية أو البابية فهو خارج عن الإِسلام مرتدّ عن دينه تجري عليه أحكام المرتدّ . ولا يرث مسلماً ويرثه جماعة المسلمين ولا ينفعهم قولهم : إنا مسلمون ولا نطقهم بكلمة الشهادة لأنهم يثبتون الرسالة لمحمد صلى الله عليه وسلم ولكنهم قالوا بمجيء رسول من بعده . ونحن كفَّرنا الغُرابية من الشيعة لقولهم : بأن جبريل أرسل إلى علي ولكنه شُبّه له محمد بعليّ إذ كان أحدهما أشبه بالآخر من الغراب بالغراب ( وكذبوا ) فبلغ الرسالة إلى محمد صلى الله عليه وسلم فهم أثبتوا الرسالة لمحمد صلى الله عليه وسلم ولكنهم زعموه غير المعيّن من عند الله .وتشبه طقوس البهائية طقوس الماسونية إلا أن البهائية تنتسب إلى التلقي من الوحي الإِلهي ، فبذلك فارقت الماسونية وعُدّت في الأديان والملل ولم تعد في الأحزاب .وانتصب { رسول الله } معطوفاً على { أبا أحد من رجالكم } عطفاً بالواو المقترنة ب { لكن } لتفيد رفع النفي الذي دخل على عامل المعطوف عليه .وقرأ الجمهور { وخاتِمَ النبيئين } بكسر تاء { خاتِم } على أنه اسم فاعل من ختم . وقرأ عاصم بفتح التَاء على تشبيهه بالخاتَم الذي يختم به المكتوب في أن ظهوره كان غلقاً للنبوءة .\n\n",
      "translations": [
        {
          "translation": "(Muhammad is not the father of any man among you) i.e. Zayd, (but he is the Messenger of Allah) but Muhammad is the Messenger of Allah (and the Seal of the Prophets) with him Allah has sealed the advent of prophets, such that there is no prophet after him; (and Allah is Aware of all things) of your words and works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا عيَّر الناس رسول الله صلى الله عليه وسلم بأنه تزوج زوجة ابنه ودعيه\n وهو زيد ردَّ الله عليهم تعييرهم هذا وتشنيعهم فقال: { مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ } أيها الأجانب من المؤمنين على الحقيقة سواء كان زيداً أو غيره\n حتى تسري حكم الحرمة في تزويج زوجته بعدما قضى الوطر عنها { وَلَـٰكِن } كان صلى الله عليه وسلم { رَّسُولَ ٱللَّهِ } الهادي لعباده أرسله إليكم\n ليهديكم إلى طريق الرشاد على مقتضى سنته المستمرة في الأمم السابقة { وَ } لكن من شأنه أنه صار { خَاتَمَ ٱلنَّبِيِّينَ } وختم المرسلين\n إذ ببعثته صلى الله عليه وسلم كملت دائرة النبوة وتمت جريدة الرسالة\n كما قال:\n \" بُعثت لأتمم مكارم الأخلاق \" \n\n وقال تعالى: { ٱلْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ } [المائدة: 3] أي: ببعثته صلى الله عليه وسلم\n\n\nوالسر فيه والله أعلم: إنه صلى الله عليه وسلم بُعث على التوحيد الذاتي\n وسائر الأنبياء إنما بعثوا على التوحيد الوصفي والفعلي\n وبعدما بُعث صلى الله عليه وسلم على توحيد الذات خُتم به أمر البعثة والرسالة\n وكمُل أمر الدين\n إذ ليس وراء الذات مرمى ومنتهى { وَكَانَ ٱللَّهُ } المطلع على جميع ما ظهر وبطن { بِكُلِّ شَيْءٍ } جرى أو يجري في ملكه { عَلِيماً } [الأحزاب: 40] يعلم بعلمه الحضوري جميع ما لمع عليه نور وجوده\n حكيماً في بعثة الرسل في تنبيه من وفقه وجبله في سابق قضائه على فطرة التوحيد والإيمان\n مختاراً في ختم البعثة وتكميل الدين بعدما وصل غاية كماله وظهوره\n\n\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله\n وعرفوه حق معرفته وتوحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { ما كان محمدٌ أَبَا أحدٍ من رجالكم } أي: لم يكن أبا رجل منكم حقيقة، حتى يثبت بينه وبينه ما يثبت بين الأب وولده من حرمة الصهر والنكاح، والمراد: من رجالكم البالغين، وأما أولاده: القاسم، والطيب، والطاهر، فماتوا قبل أن يكونوا رجالاً، وأما الحسن والحسين، فأحفاد، لا أولاد. { ولكن } كان { رسولَ اللهِ } وكل رسول أبو أمته، فيما يرجع إلى وجوب التوقير والتعظيم له عليهم، ووجوب الشفقة والنصيحة لهم عليه، لا في سائر الأحكام الثابتة بين الآباء والأبناء. وزيد واحد من رجالكم، الذين ليسوا بأولاد حقيقة، فكان حكمُه حكمهم. والتبني من باب الاختصاص والتقريب، لا غير. { و } كان أيضاً صلى الله عليه وسلم { خاتمَ النبيين } أي: آخرهم الذي ختمهم، أو: ختموا به على قراءة عاصم. بفتح التاء، بمعنى: الطابع، كأنه طبع وختم على مقامات النبوة، كما يختم على الكتاب لئلا يلحقه شيء. فلا نبي بعده. وعيسى ممّن نُبىء قبله، وحين ينزل ينزل عاملاً على شريعته صلى الله عليه وسلم، كأنه بعض أمته. ومَن قرأ بكسر التاء، فمعناه: فاعل الختم، كما قال ـ عليه الصلاة والسلام ـ:\n \" أنا خاتم النبيين فلا نبي بعدي \" \nويصح أن يكون بمعنى الطابع أيضاً إذ فيه لغات خاتِم ـ بالفتح والكسر ـ وخاتام، وخَيْتام. { وكان الله بكل شيءٍ عليماً } فيعلم مَن يليق بأن يختم به النبوة، وكيف ينبغي شأنه. الإشارة: كان صلى الله عليه وسلم أبا الأرواح حقيقة إذ الوجود كله ممتد من نوره، وأبا الأشباح باعتبار أنه السابق نوره. فأول ما ظهر نوره ـ عليه الصلاة والسلام ـ ومنه امتدت الكائنات، فهو بذرة الوجود. وسيأتي في قوله:\n[الزخرف: 81] تتميم ذلك إن شاء الله. ولم يكن أباً باعتبار تولُّد الصلب، وهو الذي نفاه الله تعالى عنه. ثم حض على الذكر إذ هو سبب التهذيب والتأديب فيزجر صاحبه عن الخوض فيما لا يعنيه فقال: { يٰأَيُّهَا ٱلَّذِينَ... }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:26",
      "similarity": 0.6654341603269007
    },
    {
      "verse": "2:7",
      "similarity": 0.6292090198213416
    },
    {
      "verse": "36:65",
      "similarity": 0.6011225208149275
    },
    {
      "verse": "45:23",
      "similarity": 0.5677504763707242
    },
    {
      "verse": "6:46",
      "similarity": 0.3319940603824485
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033040.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033040.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}