{
  "chapter": "الأحزاب",
  "text": "ما كان محمد ابا احد من رجالكم ولكن رسول الله وخاتم النبين وكان الله بكل شىء عليما",
  "translations": [
    {
      "translation": "Muhammad is not the father of any of your men, but the Messenger of Allah and the Final Seal of the Prophets. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any man among you, but a messenger of God, and the seal of the prophets. God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but he is the Messenger of Allah and the seal of the Prophets. Allah has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your males. He is the Messenger of God and the last Prophet. God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mohammed (peace and blessings be upon him) is not the father of any man among you – but he is the Noble Messenger of Allah and the Last of the Prophets*; and Allah knows all things. (* Prophet Mohammed – peace and blessings be upon him – is the Last Prophet. There can be no new Prophet after him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but he is the Messenger of Allah and the last of the Prophets. And Allah is Ever All-Aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but he is the Apostle of Allah and the Last of the prophets; and Allah is cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any one of your men, but the Messenger of God, and the Seal of the Prophets; God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any man among you, but he is the messenger of Allah and the Seal of the Prophets; and Allah is ever Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but is God's Messenger and the seal of the Prophets. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your males, but the apostle of Allah and the seal of the prophets; and Allah of everything is ever the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any man among you, but he is the Apostle of Allah and the Seal of the Prophets, and Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men, but (he is) the Messenger of Allah, and the Seal of the Prophets: and Allah has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad (SAW) is not the father of any man among you, but he is the Messenger of Allah and the last (end) of the Prophets. And Allah is Ever AllAware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men. He is the Messenger of Allah and the Seal of the Prophets. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of any of your men; but he is the Messenger of God, and the seal of the prophets. God is Cognizant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not the father of [any] one of your men, but [he is] the Messenger of Allah and last of the prophets. And ever is Allah, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:40] Muhammad is not the father of any man among you: he is not Zayd’s biological father and so it is not unlawful for him to marry his [former] wife Zaynab [after him]; but, he is, the Messenger of God and the Seal of the Prophets, and so he will not have a son that is a [fully grown] man to be a prophet after him (a variant reading [for khātim al-nabiyyīna] has khātam al-nabiyyīn, as in the instrument [known as a] ‘seal’, in other words, their [prophethood] has been sealed by him). And God has knowledge of all things, among these is the fact that there will be no prophet after him, and even when the lord Jesus descends [at the end of days] he will rule according to his [Muhammad’s] Law.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Muhammad is not the father of any man among you) i.e. Zayd, (but he is the Messenger of Allah) but Muhammad is the Messenger of Allah (and the Seal of the Prophets) with him Allah has sealed the advent of prophets, such that there is no prophet after him; (and Allah is Aware of all things) of your words and works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا عيَّر الناس رسول الله صلى الله عليه وسلم بأنه تزوج زوجة ابنه ودعيه، وهو زيد ردَّ الله عليهم تعييرهم هذا وتشنيعهم فقال: { مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ } أيها الأجانب من المؤمنين على الحقيقة سواء كان زيداً أو غيره؛ حتى تسري حكم الحرمة في تزويج زوجته بعدما قضى الوطر عنها { وَلَـٰكِن } كان صلى الله عليه وسلم { رَّسُولَ ٱللَّهِ } الهادي لعباده أرسله إليكم؛ ليهديكم إلى طريق الرشاد على مقتضى سنته المستمرة في الأمم السابقة { وَ } لكن من شأنه أنه صار { خَاتَمَ ٱلنَّبِيِّينَ } وختم المرسلين؛ إذ ببعثته صلى الله عليه وسلم كملت دائرة النبوة وتمت جريدة الرسالة، كما قال:\n\n \" بُعثت لأتمم مكارم الأخلاق \" \n\n، وقال تعالى: { ٱلْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ } [المائدة: 3] أي: ببعثته صلى الله عليه وسلم\n\n\n\n\nوالسر فيه والله أعلم: إنه صلى الله عليه وسلم بُعث على التوحيد الذاتي، وسائر الأنبياء إنما بعثوا على التوحيد الوصفي والفعلي، وبعدما بُعث صلى الله عليه وسلم على توحيد الذات خُتم به أمر البعثة والرسالة، وكمُل أمر الدين؛ إذ ليس وراء الذات مرمى ومنتهى { وَكَانَ ٱللَّهُ } المطلع على جميع ما ظهر وبطن { بِكُلِّ شَيْءٍ } جرى أو يجري في ملكه { عَلِيماً } [الأحزاب: 40] يعلم بعلمه الحضوري جميع ما لمع عليه نور وجوده، حكيماً في بعثة الرسل في تنبيه من وفقه وجبله في سابق قضائه على فطرة التوحيد والإيمان، مختاراً في ختم البعثة وتكميل الدين بعدما وصل غاية كماله وظهوره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ما كان محمدٌ أَبَا أحدٍ من رجالكم } أي: لم يكن أبا رجل منكم حقيقة، حتى يثبت بينه وبينه ما يثبت بين الأب وولده من حرمة الصهر والنكاح، والمراد: من رجالكم البالغين، وأما أولاده: القاسم، والطيب، والطاهر، فماتوا قبل أن يكونوا رجالاً، وأما الحسن والحسين، فأحفاد، لا أولاد\n { ولكن } كان { رسولَ اللهِ } وكل رسول أبو أمته، فيما يرجع إلى وجوب التوقير والتعظيم له عليهم، ووجوب الشفقة والنصيحة لهم عليه، لا في سائر الأحكام الثابتة بين الآباء والأبناء\n وزيد واحد من رجالكم، الذين ليسوا بأولاد حقيقة، فكان حكمُه حكمهم\n والتبني من باب الاختصاص والتقريب، لا غير\n { و } كان أيضاً صلى الله عليه وسلم { خاتمَ النبيين } أي: آخرهم الذي ختمهم، أو: ختموا به على قراءة عاصم\n بفتح التاء، بمعنى: الطابع، كأنه طبع وختم على مقامات النبوة، كما يختم على الكتاب لئلا يلحقه شيء\n فلا نبي بعده\n وعيسى ممّن نُبىء قبله، وحين ينزل ينزل عاملاً على شريعته صلى الله عليه وسلم، كأنه بعض أمته\n ومَن قرأ بكسر التاء، فمعناه: فاعل الختم، كما قال ـ عليه الصلاة والسلام ـ:\n\n \" أنا خاتم النبيين فلا نبي بعدي \" \n\nويصح أن يكون بمعنى الطابع أيضاً إذ فيه لغات خاتِم ـ بالفتح والكسر ـ وخاتام، وخَيْتام\n { وكان الله بكل شيءٍ عليماً } فيعلم مَن يليق بأن يختم به النبوة، وكيف ينبغي شأنه\n الإشارة: كان صلى الله عليه وسلم أبا الأرواح حقيقة إذ الوجود كله ممتد من نوره، وأبا الأشباح باعتبار أنه السابق نوره\n فأول ما ظهر نوره ـ عليه الصلاة والسلام ـ ومنه امتدت الكائنات، فهو بذرة الوجود\n وسيأتي في قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:26",
      "similarity": 0.6654341603269007
    },
    {
      "verse": "2:7",
      "similarity": 0.6292090198213416
    },
    {
      "verse": "36:65",
      "similarity": 0.6011225208149275
    },
    {
      "verse": "45:23",
      "similarity": 0.5677504763707242
    },
    {
      "verse": "6:46",
      "similarity": 0.3319940603824485
    }
  ]
}