{
  "chapter": "الأحزاب",
  "text": "ما جعل الله لرجل من قلبين فى جوفه وما جعل ازوجكم الـى تظهرون منهن امهتكم وما جعل ادعياءكم ابناءكم ذلكم قولكم بافوهكم والله يقول الحق وهو يهدى السبيل",
  "translations": [
    {
      "translation": "Allah has not allotted to any man two hearts within his breast, nor has He made those of your wives you equate with your mothers your actual mothers,* nor has He made your adopted sons your actual sons. These are just words coming out of your mouths. But Allah speaks the truth and He guides to the Way.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not provided two hearts in the breast of a man, nor made your wives, whom you pronounce \"mothers\" (in order to divorce them), your real mothers, nor has He made your adopted sons your real sons. This is only what your lips pronounce. God says what is just, and shows the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has never put two hearts within one person's body; nor has He made your wives, whom you compare to your mothers' backs (to divorce them), your true mothers; nor has He made those whom you adopt as sons your own sons. These are only words that you utter with your mouths. But Allah proclaims the Truth and directs you to the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not created two hearts inside any one human being. God does not consider your wives whom you renounce by zihar as your mothers nor those whom you adopt as your sons. These are only words of your mouth. God tells the Truth and shows the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not kept two hearts in the body of any man; nor has He made them your mothers those wives of yours, whom you declare to be your mothers; nor has He made them your sons, whom you have adopted; this is the statement of your mouths; and Allah proclaims the truth and it is He Who shows the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not made for any man two hearts inside his body. Neither has He made your wives whom you declare to be like your mothers' backs, your real mothers nor has He made your adopted sons your real sons. That is but your saying with your mouths. But Allah says the truth, and He guides to the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not made for any man two hearts within him; nor has He made your wives whose backs you liken to the backs of your mothers as your mothers, nor has He made those whom you assert to be your sons your real sons; these are the words of your mouths; and Allah speaks the truth and He guides to the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not assigned to any man two hearts within his breast; nor has He made your wives, when you divorce, saying, 'Be as my mother's back,' truly your mothers, neither has He made your adopted sons your sons in fact. That is your own saying, the words of your mouths; but God speaks the truth, and guides on the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath not assigned unto any man two hearts within his body, nor hath He made your wives whom ye declare (to be your mothers) your mothers, nor hath He made those whom ye claim (to be your sons) your sons. This is but a saying of your mouths. But Allah saith the truth and He showeth the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not placed two hearts in any man's body, nor has He made your wives -- from whom you keep away by saying, \"Be as my mother's back\" -- your [real] mothers, neither He has made your adopted sons as your own sons. These are merely words which you utter with your mouths: but God speaks the truth and gives guidance to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath not placed unto any man two hearts in his inside, nor hath He made your spouses whom ye declare to be as your mother's backs, your real mothers, nor hath He made your adopted sons your real sons. This is only your saying by your mouths, whereas Allah saith the truth and He guideth the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not put two hearts within any man, nor has He made your wives whom you repudiate by zihar your mothers, nor has he made your adopted sons your [actual] sons. These are mere utterances of your mouths. But Allah speaks the truth and He guides to the [right] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not made for any man two hearts in his (one) body: nor has He made your wives whom ye divorce by Zihar your mothers: nor has He made your adopted sons your sons. Such is (only) your (manner of) speech by your mouths. But Allah tells (you) the Truth, and He shows the (right) Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not put for any man two hearts inside his body. Neither has He made your wives whom you declare to be like your mothers' backs, your real mothers. [AzZihar is the saying of a husband to his wife, \"You are to me like the back of my mother\" i.e. You are unlawful for me to approach.], nor has He made your adopted sons your real sons. That is but your saying with your mouths. But Allah says the truth, and He guides to the (Right) Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has never made any man with two hearts inside him. Nor has He made your wives, when you divorce, saying: 'Be as my mother's back' your mothers. Neither has He made your fostered sons as your own sons. These are your own sayings, words which you utter with your mouths; but Allah speaks the truth and guides to the Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God did not place two hearts inside any man's body. Nor did He make your wives whom you equate with your mothers, your actual mothers. Nor did He make your adopted sons, your actual sons. These are your words coming out of your mouths. God speaks the truth, and guides to the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not made for a man two hearts in his interior. And He has not made your wives whom you declare unlawful your mothers. And he has not made your adopted sons your [true] sons. That is [merely] your saying by your mouths, but Allah says the truth, and He guides to the [right] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:4] God has not placed two hearts inside any man: [this was revealed] in order to refute those disbelievers who said that they each had two hearts with which they could reason better than Muhammad’s single mind; nor has He made your wives whom (read as allā’ī, or allā’) you repudiate by zihār (read tazzahharūna, or tuzāhirūna; the original tā’ [of tatazāharūna] has been assimilated with the zā’) — a man would say to his wife for example, ‘You are for me as [untouchable as] my mother’s back’ — your mothers, in other words, [He has not made you wives] like [your] mothers, so that they are illicit [for conjugality] in that respect, [a practice] which in pre-Islamic times was considered a [valid form of] divorce. An atonement with [necessary] conditions is necessary in such a case, as mentioned in sūrat al-Mujādila [Q. 58:2-3]. Nor has He made those whom you claim as [adopted] sons (ad‘iyā’, the plural of da‘iyy, which is one claimed as the son of one who is not his [biological] father) your sons, in reality. That is a mere utterance of your mouths, namely, [of] the Jews and the hypocrites. When the Prophet (s) married Zaynab bt. Jahsh, who had been Zayd b. Hāritha’s wife, the adopted son of the Prophet (s), they said, ‘Muhammad married his son’s wife!’, and so God proved them liars in this. But God speaks the truth, in this [matter], and He guides to the way, the way of truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath not assigned unto any man two hearts within his body) this was revealed about Abu Ma'mar Jamil Ibn Asad who was called \"the one with two hearts\" because of his measured speech, (nor hath He made your wives whom ye declare (to be your mothers)) by a simple oath ((to be your mothers) your mothers) as your mother in relation to unmarriageability-this was revealed about Aws Ibn al-Samit the 472 brother of 'Ubadah Ibn al-Samit and his wife Khawlah-, (nor hath he made those whom ye claim (to be your sons)) those whom you adopted in order to help and strengthen you (your sons) like your real sons. (This is but a saying of your mouths) between yourselves. (But Allah saith the Truth) Allah explains the Truth (and He showeth the way) and lead to what is right.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولهذه الحكمة العليَّة { مَّا جَعَلَ } وخلق { ٱللَّهُ } العليم الحكيم\n المتقن في أفعاله { لِرَجُلٍ } واحد { مِّن قَلْبَيْنِ } مشعرين مدركين { فِي جَوْفِهِ } حتى لا يتفتت ميله\n ولا يتعدد قبلة مقصده ومرماه\n وإن خلق له عينين وأذنين ويدين وغيرهما { وَ } كذا { مَا جَعَلَ } الله العليم الحكيم { أَزْوَاجَكُمُ ٱللاَّئِي تُظَاهِرُونَ مِنْهُنَّ } وتقولون لهن: أنت عليَّ كظهر أمي { أُمَّهَاتِكُمْ } حقيقة\n ليترتب عليها أحكام الأمهات من التحريم\n وعدم القربان والفراش معها وغيرها { وَمَا جَعَلَ } أيضاً { أَدْعِيَآءَكُمْ } أي: الأجانب الذين تدعونهم أبناءً من إفراط المحبة والمودة { أَبْنَآءَكُمْ } حقيقةً\n حتى يترتب عليهم أحكام الأبناء من الميراث والمحرمية\n وحرمة زوجتهم وابنتهم وغير ذلك من الأحكام\n\n\n{ ذَٰلِكُمْ } أي: الأمور الثلاثة المذكورة { قَوْلُكُم } أي: مجرد قول صدر عن ألسنتكم وتكلمتكم { بِأَفْوَاهِكُمْ } لا حقيقة لها سوى الاشتهار { وَٱللَّهُ } المدبر لأموركم\n المصلح لأحوالكم { يَقُولُ ٱلْحَقَّ } أي: الحكم الثابت المتحقق عنده سبحانه\n المترتب عليه أحكامه إرشاداً لكم\n وإصلاحاً لحالكم { وَ } كيف لا { هُوَ } بمقتضى ألوهيته وربوبيته { يَهْدِي ٱلسَّبِيلَ } [الأحزاب: 4] السوي والصراط المستقيم إلى عباده الذين انحرفوا عن سبل السلامة\n وطرق الاستقامة في الوقائع والأحكام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ما جعل اللهُ لرجلِ من قلبين في جوفه } فيؤمن بأحدهما ويكفر بالآخر، أو: يتقي بأحدهما ويعصي بالآخر، أو: يُقبل على الله بأحدهما ويُقبل على الدنيا بالآخر، بل ما للعبد إلا قلب واحد، إن أقبل به على الله أدبر عمن سواه، وإن أقبل به على الدنيا، أدبر عن الله\n قيل: الآية مثل المنافقين، أي: إنه لا يجتمع الكفر والإيمان، وقيل: لا تستقر التقوى ونقض العهد في قلب واحد\n وقال ابن عطية: يظهر من الآية، بجملتها، أنها نفي لأشياء كانت العرب تعتقدها في ذلك الوقت، وإعلام بحقيقة الأمر فيها، فمنها: أن العرب كانت تقول: الإنسان له قلب يأمره وقلب ينهاه، وكان تَضَادُّ الخواطر يحملها على ذلك\n\n الخ كلامه\n قال النسفي: والمعنى: أنه تعالى لم يجعل للإنسان قلبين لأنه لا يخلو: إما أن يفعل بأحدهما مثل ما يفعل بالآخر من أفعال القلوب، فأحدهما فَضْلَةٌ، غير مُحْتاَج إليه، وإما أن يفعل بهذا غير ما يفعل بذلك، فيؤدي إلى اتصاف الجملة بكونه مريداً كارهاً، عالماً ظانّاً، موقناً شاكّاً في حالة واحدة\n هـ\n وكانت العرب تعتقد أيضاً أن المرأة المظاهَرَ منها: أُمًّا، فردّ ذلك بقوله: { وما جعل أزواجَكم اللائي تُظاهرون منهن أمهاتِكم } أي: ما جمع الزوجية والأمومة في امرأة واحدة لتضاد أحكامهما لأن الأم مخدومة، والمرأة خادمة\n وكانت تعتقد أن الدّعي ابن، فردّ عليهم بقوله: { وما جعل أدعياكم أبناءكم } أي: لم يجعل المُتَبَنَّى من أولاد الناس ابناً لمَن تبناه لأن البنوة أصالة في النسب، والدعوة إلصاق عارض بالتسمية، لا غير، ولا يجتمع في شيء واحد أن يكون أصيلاً وغير أصيل\n ونزل هذا في \" زيد بن حارثة \" ، وهو رجل من كلب، سُبي صغيراً، فاشتراه حكيم بن حزام، لعمته خديجة، فلما تزوجها رسول الله صلى الله عليه وسلم وهبته له، فطلبه أبوه وعمه، وجاءا بفدائه، فخُيَّر، فاختار رسولَ الله صلى الله عليه وسلم، فأعتقه وتبنّاه\n وكانوا يقولون: زيد بن محمد، فلما تزوج النبيُّ صلى الله عليه وسلم زينب وكانت تحت زيد - على ما يأتي - قال المنافقون: تزوج محمد امرأة ابنه وهو ينهى عنه، فأنزل الله هذه الآية\n وقيل: كان المنافقون يقولون: لمحمد قلبان، قلب معكم، وقلب مع أصحابه\n وقيل: كان \" أبو مَعْمَر \" أحفظ العرب، فقيل: ذو القلبين، فأكذب اللهُ قولَهم\n والتنكير في رجل، وإدخال \" مِن \" الاستغراقية على \" قلبين \" ، وذكر الجوف للتأكيد\n و \" اللائي \": جمع \" التي \"\n وفيها قراءات: \" اللاء \" بالهمزة مع المد والقصر، وبالتسهيل، وبالياء، بدلاً من الهمز\n\n\nوأصل { تظاهرون }: تتظاهرون، فأدغم\n وقرأ عاصم بالتخفيف منْ: ظَاَهَر\n ومعنى الظهار: أن تقول للزوجة: أنت عليّ كظهر أمي\n مأخوذ من الظهر، وتعديته بمن لتضمنه معنى التجنُّب لأنه كان طلاقاً في الجاهلية\n وهو في الإسلام يقتضي الحرمة حتى يُكفَّر، كما يأتي في المجادلة\n والأدعياء: جمع دعي، فقيل: بمعنى مفعول، وهو الذي يُدعى ولداً، وجمعه على أَفْعِلاَء: شاذ لأن بابه ما كان منه بمعنى فاعل كتقي وأتقياء، وشقي وأشقياء\n ولا يكون في ذلك نحو رَمِيَّ وسَمي، على الشذوذ\n وكأنه شبهه بفعيل بمعنى فاعل، فَجُمِعَ جَمْعَهُ\n { ذلكم قولُكُم بأفواهكم } إذ إن قولكم للزوجة: أُمًّا، والدعيّ: هو ابن، قول تقولونه بألسنتكم لا حقيقة له، إذ الابن يكون بالولادة، وكذا الأم\n { واللهُ يقولُ الحقِّ } ما له حقيقة عينية، مطابقة له ظاهراً وباطناً { وهو يهدي السبيلَ } سبيل الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:65",
      "similarity": 0.12957323108054236
    },
    {
      "verse": "3:167",
      "similarity": 0.124880484116204
    },
    {
      "verse": "13:14",
      "similarity": 0.12342763356231862
    },
    {
      "verse": "18:5",
      "similarity": 0.12269992854272341
    },
    {
      "verse": "14:9",
      "similarity": 0.11630303823261848
    }
  ]
}