{
  "chapter": "الأحزاب",
  "text": "هو الذى يصلى عليكم وملئكته ليخرجكم من الظلمت الى النور وكان بالمؤمنين رحيما",
  "translations": [
    {
      "translation": "It is He Who calls down blessing on you, as do His angels, to bring you out of the darkness into the light. He is Most Merciful to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends His blessings on you, as (do) His angels, that He may lead you out of darkness into light, for He is benevolent to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who lavishes His blessings on you and His angels invoke blessings on you that He may lead you out of darkness into light. He is Most Compassionate to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who forgives you and His angels pray for you so that He will take you out of darkness into light. God is All-merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends blessings upon you*, and so do His angels, so that He may bring you out from darkness into light; and He is Most Merciful upon the Muslims. (* Upon the companions of the Holy Prophet).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends Salah on you, and His angels too, that He may bring you out from darkness into light. And He is Ever Most Merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends His blessings on you, and (so do) His angels, that He may bring you forth out of utter darkness into the light; and He is Merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who blesses you, and His angels, to bring you forth from the shadows into the light. He is All-compassionate to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who blesseth you, and His angels (bless you), that He may bring you forth from darkness unto light; and He is ever Merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends blessings to you, as do His angels, so that He may bring you out of the darkness into the light. He is most merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sendeth His benedictions to you and His angels also that he may bring you forth from darknessess into light; and unto the believers He is ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who blesses you—and so do His angels—that He may bring you out from darkness into light, and He is most merciful to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends blessings on you, as do His angels, that He may bring you out from the depths of Darkness into Light: and He is Full of Mercy to the Believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends Salat (His blessings) on you, and His angels too (ask Allah to bless and forgive you), that He may bring you out from darkness (of disbelief and polytheism) into light (of Belief and Islamic Monotheism). And He is Ever Most Merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has mercy on you, and His angels to bring you out from the darkness into light. He is the Most Merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who reaches out to you, and His angels, to bring you out of darkness into the light. And He is Ever-Merciful towards the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who confers blessing upon you, and His angels [ask Him to do so] that He may bring you out from darknesses into the light. And ever is He, to the believers, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:43] It is He Who blesses you, that is to say, Who shows mercy to you, and His angels, ask forgiveness for you, that He may bring you forth, that He may always bring you forth, from darkness, namely, [from] disbelief, into light, namely, faith. And He is Merciful to the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who blesseth you) who forgives you, (and His angels (bless you)) and His angels seek forgiveness for you, (that He may bring you forth from darkness unto light) and He has indeed taken you out of disbelief to faith; (and He is Merciful to the believers) and He is kind to the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ وَمَلاَئِكَتُهُ } معناه هو الذِي يَرحمُكُمْ وتَدعُوا لَكم مَلائكتُهُ\n وقال: معنى يُصلّى: يُباركُ عَليكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تذكرون الله، ولا تسبحون له أيها المؤمنون، مع أن شكر المنعم المفضل واجب عقلاً وشرعاً؟! { هُوَ ٱلَّذِي } سبحانه { يُصَلِّي } ويرحم { عَلَيْكُمْ } أيها المؤمنون بذاته، وبمقتضيات أسمائه وصفاته { وَمَلاَئِكَتُهُ } يستغفرون لكم بإذنه، وإنما يفعل بكم سبحانه هذه الكرامة العظيمة { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ } ظلمة العدم الأصلي، وظلمة الطبيعة الهيولي، وظلمة الحجبة التعينية { إِلَى ٱلنُّورِ } أي: نور الوجود البحث، الخالص على ظلمات التعينات والكثرات مطلقاً { وَكَانَ } سبحانه { بِٱلْمُؤْمِنِينَ } الموفقين على التوحيد الذاتي { رَحِيماً } [الأحزاب: 43] يوفقهم إلى الإيمان بمقتضى رحمته الواسعة، ثمَّ يصولهم إلى مرتبة التوحيد والعرفان، مترقياً من مضيق الإمكان إلى سعة فضاء الوجوب عنايةً لهم وتفضلاً عليهم، ثمَّ يشرفهم بشرف لقائه بلا كيف، ولا أين بعدما انخلعوا عن جلباب الناسوت، وتشرفوا بخلعة اللاهوت\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n بدليل: { ليُخرجكم من الظلمات إلى النور } من ظلمات الكفر إلى نور الإيمان، ثم من ظلمات المعاصي إلى نور الطاعة، ثم من ظلمات الغفلة إلى نور اليقظة، ثم من ظلمات الحجاب إلى نور العيان\n وقيل: يُصَلِّي عليكم: يشيع لكم الذكر الجميل في عباده\n  { وكان } الله { بالمؤمنين رحيماً } قد اعتنى بصلاح أمرهم، وإثابة أجرهم، واستعمل في خدمتهم ملائكتَه المقربين، وهو دليل على أن المراد بالصلاة: الرحمة، حيث صرَّح بكونه رحيماً بهم\n قال أنس: لمّا نزل قوله تعالى: { إن الله وملائكته يصلون على النبي } قال أبو بكر: يا رسول الله ما خصك الله بشريف إلا وقد اشتركنا فيه، فأنزل قوله: { هو الذي يُصلي عليكم\n\n\n } الخ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:157",
      "similarity": 0.4988823493752591
    },
    {
      "verse": "33:56",
      "similarity": 0.47022366564338003
    },
    {
      "verse": "74:43",
      "similarity": 0.42969186705108314
    },
    {
      "verse": "70:22",
      "similarity": 0.41081811153744596
    },
    {
      "verse": "5:37",
      "similarity": 0.39104025822858585
    }
  ]
}