{
  "chapter": "الأحزاب",
  "text": "ان الله وملئكته يصلون على النبى يايها الذين ءامنوا۟ صلوا۟ عليه وسلموا۟ تسليما",
  "translations": [
    {
      "translation": "Allah and His angels call down blessings on the Prophet. You who have iman! call down blessings on him and ask for complete peace and safety for him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God and His angels shower their blessings on the Prophet. O believers, you should also send your blessings on him, and salute him with a worthy greeting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah and His angels bless the Prophet. Believers, invoke blessings and peace on him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God showers His blessings upon the Prophet and the angels seek forgiveness for him. Believers, pray for the Prophet and greet him with, \"Peace be with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah and His angels send blessings on the Prophet; O People who Believe! Send blessings and abundant salutations upon him. (Everlasting peace and unlimited blessings be upon the Holy Prophet Mohammed.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends His Salah on the Prophet, and also His angels (do so). O you who believe! Send your Salah on him, and greet him with Taslim.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God and His angels bless the Prophet. O believers, do you also bless him, and pray him peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah and His angels shower blessings on the Prophet. O ye who believe! Ask blessings on him and salute him with a worthy salutation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God and His angels bestow blessings on the Prophet. O believers, you also should invoke blessings on him and give him greetings of peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah and His angels send their benedictions upon the prophet. O ye who believe! send your benedictions upon him and salute him with a goodly Salutation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah and His angels bless the Prophet; O you who have faith! Invoke blessings on him and invoke Peace upon him in a worthy manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah and His angels send blessings on the Prophet: O ye that believe! Send ye blessings on him, and salute him with all respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends His Salat (Graces, Honours, Blessings, Mercy, etc.) on the Prophet (Muhammad SAW) and also His angels too (ask Allah to bless and forgive him). O you who believe! Send your Salat on (ask Allah to bless) him (Muhammad SAW), and (you should) greet (salute) him with the Islamic way of greeting (salutation i.e. AsSalamu 'Alaikum).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah and His angels praise and venerate the Prophet. Believers, praise and venerate him and pronounce peace upon him in abundance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God and His angels give blessings to the Prophet. O you who believe, call for blessings on him, and greet him with a prayer of peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah confers blessing upon the Prophet, and His angels [ask Him to do so]. O you who have believed, ask [Allah to confer] blessing upon him and ask [Allah to grant him] peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:56] Indeed God and His angels bless the Prophet, Muhammad (s). O you who believe, invoke blessings on him and invoke peace upon him in a worthy manner, in other words, say: ‘O God, bless our master Muhammad and grant him peace’ (Allāhumma sallī ‘alā sayyidinā Muhammad wa-sallim).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah and His angels shower blessings on the Prophet. ye who believe! Ask blessings on him) pray for him (and salute him with a worthy salutation) and resign yourselves to his command.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى تعظيم النبي صلى الله عليه وسلم وتوقيره، والاعتناء بشأنه وعلو منزلته ومكانه، فقال: { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { وَمَلاَئِكَـتَهُ } المهيمين عنده، الوالهين بمطالعة جماله، المتسغرقين بشرف لقائه { يُصَلُّونَ } يعتنون ويهتمون بإظهار فضله؛ تبجيلاً وتعظيماً { عَلَى ٱلنَّبِيِّ } الحقيق لأنواع التوقير والتمجيد، المستحق لأصناف الكرامة والتحميد { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله بوسيلة نبيه صلى الله عليه وسلم، وتحققوا بتوحيده سبحانه بإرشاده صلى الله عليه وسلم أنتم أولى وأحق بتعظيمه وتصليته وتسليمه { صَلُّواْ عَلَيْهِ } مهما سمعتم اسمه وذكرتم بأنفسكم، وقولوا: اللهم صل على محمد { وَسَلِّمُواْ } له { تَسْلِيماً } [الأحزاب: 56] قائلين: السلام عليك أيها النبي ورحمة الله وبركاته، والآية تدل على وجوب الصلاة عليه صلى الله عليه وسلم للمؤمنين كلما جرى ذكره في أي حال من الأحوال والأحيان اللائقة للدعاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن اللهَ وملائكتَهُ يُصلُّون على النبي } يعتنون بإظهار شرفه وتعظيم شأنه\n وقال صاحب المُغني: الصواب عندي: أن الصلاة لغة بمعنى واحد، وهو العطف، ثم العطف بالنسبة إلى الله تعالى: الرحمة، وإلى الملائكة: الاستغفار، وإلى الآدميين: دعاء\n واختاره السُّهيلي قبله\n والمراد بالرحمة منه تعالى غايتها، وهو إفاضة الخير والإحسان، لا رقة القلب، الذي هو معنى الرحمة حقيقة\n { يا أيها الذين آمنوا صلُّوا عليه } أي: قولوا: اللهم صلِّ على محمد ـ أو: صلى الله على محمد\n { وسلّموا تسليماً } أي: قولوا: اللهم سلّم على محمد، أو: صلّ وسلِّم على محمد، أو: انقادوا لأمره وحكمه، انقياداً كليًّا\n وعن كعب بن عُجْرَة: قلنا: يا رسول الله، أما السلام عليك، فقد عرفناه، فكيف الصلاة عليك؟ قال:\n\n \" قولوا اللهم صلِّ على مُحمدٍ وعلى آل محمد، كما صلّيت على إبراهيم، إنك حميدٌ مجيدٌ، اللهمَّ بارِكْ على محمدٍ وعلى آل محمدٍ، كما بَارَكْت على إبراهيمَ، إنك حميد مجيد \" \n\nومعرفتهم السلام من التشهُّد\n والصلاة على غير الأنبياء بالتبع جائزة\n وأما بالاستقلال فمكروه، وهو من شعار الروافض\n هـ\n قال الكواشي: رُوي أنه قيل يا رسول الله: أرأيت قول الله تعالى: { إن الله وملائكته يُصلُّون على النبي\n\n\n } الآية؟ فقال: هذا من العلم المكنون، ولولا أنكم سألتموني عنه ما أخبرتكم، إن الله وكَل بي ملكين، فلا أُذكر عند عبدٍ مسلم، فيُصلي عليّ، إلا قال ذانك الملكان: غفر الله لك، وقال الله وملائكته جواباً لذينك الملّكين: آمين\n ولا أُذكر عند عبد مسلم، فلا يُصلي عليّ إلا قال ذانك الملكان: لا غفر الله لك\n وقال الله جواباً لذينك الملكين: آمين\n هـ\n  والصلاة على النبي صلى الله عليه وسلم واجبة\n فمنهم مَن أوجبها عند ذكره كلما ذكر، وعليه الجمهور، وهو الاحتياط للحديث المتقدم\n ولقوله صلى الله عليه وسلم:\n\n \" مَن ذُكرتُ عنده فلم يُصلِّ عليّ دَخَلَ النار \" \n\nومنهم مَن أوجبها في كل مجلس مرة، وإن تكرر ذكره، كتشميت العاطس وآية السجدة، ومنهم مَن أوجبها مرة في العمر\n قالوا: وكذلك الخلاف في إظهار الشهادتين، وأما ذكرها في الصلاة فليست شرطاً عند أبي حنيفة ومالك، خلافاً للشافعي، والاحتياط: الإكثار منها بغير حصر، ولا يغفل عنها إلا مَن لا خير فيه\n واختلف هل كانت الأمم الماضية متعبدة بالصلاة على أنبيائهم\n قال القسطلاني: إنه لم ينقل إلينا ذلك، ولا يلزم من عدم النقل عدم الوقوع\n هـ\n الإشارة: اعلم أن الصلاة عليه صلى الله عليه وسلم سُلم ومعراج الوصول إلى الله لأن تكثير الصلاة عليه صلى الله عليه وسلم تُوجب محبته، ومحبتُه ـ عليه الصلاة والسلام ـ توجب محبة الله تعالى، ومحبته تعالى للعبد تجذبه إلى حضرته، بواسطة وبغيرها\n\n\nوأيضاً: الرسول صلى الله عليه وسلم وزير مقرب، ومَن رام دخول حضرة الملوك يخدم الوزير، ويتقرّب إليه، حتى يُدخله على الملِك\n فهو صلى الله عليه وسلم حجاب الله الأعظم، وبابه الأكرم، فمَن رام الدخول من غير بابه طُرد وأُبعد، وفي ذلك يقول ابن وفا:\n\nوقال الشيخ الجزولي رضي الله عنه في دلائل الخيرات: وهي من أهم المهمات لمَن يريد القرب من رب الأرباب\n وقال شارحه: ووجه أهميتها من وجوه، منها: ما فيها من التوسُّل إلى الله سبحانه بحبيبه ومصطفاه\n وقد قال تعالى:\n\n[المائدة: 35]، ولا وسيلة إليه أقرب، ولا أعظم، من رسوله الأكرم صلى الله عليه وسلم\n  ومنها: أن الله تعالى أمر بها، وحضَّنا عليها، تشريفاً له وتكريماً، وتفضيلاً لجلاله، ووعد مَن استعملها حُسن المآب، وجزيل الثواب، فهي من أنجح الأعمال، وأرجح الأقوال، وأزكى الأحوال، وأحظى القربات، وأعم البركات، وبها يتوصل إلى رضا الرحمن، وتنال السعادة والرضوان، وتجاب الدعوات، ويرتقي إلى أرفع الدرجات\n وأوحى الله تعالى إلى موسى عليه السلام: يا موسى أتُريد أن أكون أقرب إليك من كلامك إلى لسانك، ومن وسواس قلبك إلى قلبك، ومن روحك إلى بدنك، ومن نور بصرك إلى عينيك؟ قال: نعم يا رب، قال: فأكثر من الصلاة على محمد صلى الله عليه وسلم\n ومنها: أنه صلى الله عليه وسلم محبوب لله عزّ وجل، عظيم القدر عنده، وقد صلّى عليه وهو وملائكتُه، فوجبت محبة المحبوب، والتقرُّب إلى الله تعالى بمحبته، وتعظيمه، والاشتغال بحقه، والصلاة عليه، والاقتداء بصلاته، وصلاة ملائكته، وصلاة ملائكته عليه\n قلت: وهذا التشريف أتم وأعظم من تشريف آدم عليه السلام، بأمر الملائكة بالسجود له لأنه لا يجوز أن يكون الله مع الملائكة في ذلك التشريف\n فتشريف يصدر عنه مع ملائكته أبلغ من تشريف تختص به الملائكة\n ومنها: ما ورد في فضلها، ووعَدَ عليها من جزيل الأجر وعظيم القدر، وفوز مستعملها برضا الله، وقضاء حوائج آخرته ودنياه\n ومنها: ما فيها مِن شُكر الواسطة في نعم الله علينا المأمور، بشكره، وما من نعمة لله علينا، سابقة ولا لا حقة من نعمة الإيجاد والإمداد، في الدنيا والآخرة، إلا وهو السبب في وصولها إلينا، وإجرائها علينا، فوجب حقه علينا، ووجب علينا في شكر نعمته ألا نفتر عن الصلاة عليه، مع دخول كل نفس وخروجه\n ومنها: ما فيها من القيام برسم العبودية، بالرجوع لِما يقتضي الأصلُ نفيه، فهو أبلغ في الامتثال، ومن أجل ذلك كانت فضيلة الصلاة على النبي صلى الله عليه وسلم على كل عمل\n والذي يقتضي الأصل نفيه، هو كون العبد يتقرب إلى الله بالاشتغال بحق غيره لأن قولنا:\n\n\n\n \" اللهم صَلِّ على محمد \" \n\nهو الاشتغال بحق محمد صلى الله عليه وسلم، وأصل التعبدات: ألا يتقرب إلى الله تعالى إلا بالاشتغال بحقه\n ولكن لمّا كان الاشتغال بالصلاة على محمد بإذن من الله تعالى، كان الاشتغال بها أبلغ في امتثال الأمر، فهي بمثابة أمر الله تعالى للملائكة بالسجود لآدم، فكان شرفهم في امتثال أمر الله، وإهانة إبليس في مخالفة أمره سبحانه\n ومنها: ما جُرب من تأثيرها، والنفع بها في التنوير ورفع الهمة، حتى قيل: إنها تكفي عن الشيخ في الطريق، وتقوم مقامه، حسبما نقله الشيخ السنوسي، والشيخ زروق، وغيرهما\n ومنها: ما فيها من سير الاعتدال، الجامع لكمال العبد وتكميله، ففي الصلاة على رسول الله صلى الله عليه وسلم ذكر الله ورسوله، ولا كذلك عكسه، فلذلك كانت المثابرة على الأذكار والدوام عليها يحصل به الانحراف، وتُكسب نورانية تحرق الأوصاف، وتثير وهجاً وحرارة في الطباع، والصلاة على رسول الله صلى الله عليه وسلم تُذهب وهَج الطِّباع، وتقوي النفوس لأنها كالماء البارد، فكانت تقوم مقام شيخ التربية\n انتهى كلامه\n قلت: والحق الذي لا غُبار عليه: إن الصلاة عليه صلى الله عليه وسلم، والإكثار منها، تدلّ صاحبها على مَن يأخذ بيده، وتُوصله إلى شيخ التربية، الذي هو خليفة رسول الله صلى الله عليه وسلم، إن كان صادق الطلب، وأما كونها تقوم مقام الشيخ في دخول مقام الفناء والبقاء، حتى تعتدل حقيقته وشريعته فلا إذ لا تنقطع رعونات النفوس إلا بآمر وناهٍ من غيره، يكون عالماً بدسائس النفوس وخِدعها، وغاية ما توصل إليه الصلاة على رسول الله صلى الله عليه وسلم ـ إن لم يظفر بالشيخ ـ الفناء في الصفات، وينال مقام الصلاح الأكبر، ويظهر له كرامات وخوارق، ويكون من أرباب الأحوال، وإن وصل إلى مقام الفناء تكون شريعته أكبر من حقيقته\n هذا ما ذقناه، وشهدناه، وسمعناه من أشياخنا، والطريق التي أدركناهم يستعملونها، وأخذناها منهم، أنهم يأمرون المريد إن رأوه أهلاً للتربية أن يلتزم الاسم المفرد، ويفنى فيه، حتى تنهدم به عوالمه، فإذا تحقق فناؤه وغاب عن نفسه ورسمه، ردُّوه إلى مقام البقاء، وحينئذ يأمرونه بالصلاة على رسول الله صلى الله عليه وسلم، لتكون صلاته عليه كاملة، يُصلي على روحه وسره بلا حجاب، ويشاهده في كل ساعة كما يشاهدونه\n وبالله التوفيق\n ثم ذكر أهل الغفلة والبعد فقال: { إِنَّ ٱلَّذِينَ يُؤْذُونَ ٱللَّهَ وَرَسُولَهُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:43",
      "similarity": 0.47022366564338003
    },
    {
      "verse": "3:80",
      "similarity": 0.4657138795759302
    },
    {
      "verse": "43:69",
      "similarity": 0.4338771983170396
    },
    {
      "verse": "3:102",
      "similarity": 0.42667519686140937
    },
    {
      "verse": "8:64",
      "similarity": 0.4236150187973774
    }
  ]
}