{
  "chapter": "الأحزاب",
  "text": "يايها النبى انا احللنا لك ازوجك التى ءاتيت اجورهن وما ملكت يمينك مما افاء الله عليك وبنات عمك وبنات عمتك وبنات خالك وبنات خلتك التى هاجرن معك وامراة مؤمنة ان وهبت نفسها للنبى ان اراد النبى ان يستنكحها خالصة لك من دون المؤمنين قد علمنا ما فرضنا عليهم فى ازوجهم وما ملكت ايمنهم لكيلا يكون عليك حرج وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "O Prophet! We have made halal for you: your wives to whom you have given dowries and any slavegirls you own from the booty Allah has allotted you and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who have made hijra with you and any mumin woman who gives herself to the Prophet if the Prophet desires to prescribed for them regarding their wives and any slavegirls they possess - in order that there be no restriction on you. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made lawful for you, O Prophet, wives to whom you have given their dower, and God-given maids and captives you have married, and the daughters of your father's brothers and daughters of your father's sisters, and daughters of your mother's brothers and sisters, who migrated with you; and a believing woman who offers herself to the Prophet if the Prophet desires to marry her. This is a privilege only for you and not the other believers. We know what We have ordained for them about their wives and maids they possess, so that you may be free of blame, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, We have made lawful for you your wives whose bridal dues you have paid, and the slave-girls you possess from among the prisoners of war, and the daughters of your paternal uncles and paternal aunts, and the daughters of your maternal uncles and maternal aunts who have migrated with you, and a believing woman who gives herself to the Prophet and whom he wants to take in marriage. (O Prophet), this privilege is yours alone to the exclusion of other believers. We know well what restrictions We have imposed upon them as regards their wives and those whom their right hands possess, (and have exempted you from those restrictions) that there may be no constraint upon you. Allah is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, We have made lawful for you your wives whom you have given their dowry, slave girls whom God has given to you as gifts, the daughters of your uncles and aunts, both paternal and maternal, who have migrated with you. The believing woman, who has offered herself to the Prophet and whom the Prophet may want to marry, will be specially for him, not for other believers. We knew what to make obligatory for them concerning their wives and slave girls so that you would face no hardship (because we have given distinction to you over the believers). God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden! We have indeed made lawful for you the wives to whom you have paid their bridal money, and the bondwomen you possess whom Allah gave you as war booty, and the daughters of your paternal uncles, and the daughters of your paternal aunts, and the daughters of your maternal uncles, and the daughters of your maternal aunts, those who migrated with you; and the believing woman if she gifts her life to the Prophet, if the Prophet desires to take her in marriage; this is exclusively for you, not for your followers; We indeed know what We have enjoined upon the Muslims concerning their wives and the bondwomen they possess – this exclusivity for you is so that you may not have constraints; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Verily, We have made lawful to you your wives, to whom you have paid their due (dowery), and those (slaves) whom your right hand possesses -- whom Allah has given to you, and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who migrated with you, and a believing woman if she offers herself to the Prophet, and the Prophet wishes to marry her -- a privilege for you only, not for the (rest of) the believers. Indeed We know what We have enjoined upon them about their wives and those (slaves) whom their right hands possess, in order that there should be no difficulty on you. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! surely We have made lawful to you your wives whom you have given their dowries, and those whom your right hand possesses out of those whom Allah has given to you as prisoners of war, and the daughters of your paternal uncles and the daughters of your paternal aunts, and the daughters of your maternal uncles and the daughters of your maternal aunts who fled with you; and a believing woman if she gave herself to the Prophet, if the Prophet desired to marry her-- specially for you, not for the (rest of) believers; We know what We have ordained for them concerning their wives and those whom their right hands possess in order that no blame may attach to you; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, We have made lawful for thee thy wives whom thou hast given their wages and what thy right hand owns, spoils of war that God has given thee, and the daughters of thy uncles paternal and aunts paternal, thy uncles maternal and aunts maternal, who have emigrated with thee, and any woman believer, if she give herself to the Prophet and if the Prophet desire to take her in marriage, for thee exclusively, apart from the believers -- We know what We have imposed upon them touching their wives and what their right hands own -- that there may be no fault in thee; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Lo! We have made lawful unto thee thy wives unto whom thou hast paid their dowries, and those whom thy right hand possesseth of those whom Allah hath given thee as spoils of war, and the daughters of thine uncle on the father's side and the daughters of thine aunts on the father's side, and the daughters of thine uncle on the mother's side and the daughters of thine aunts on the mother's side who emigrated with thee, and a believing woman if she give herself unto the Prophet and the Prophet desire to ask her in marriage - a privilege for thee only, not for the (rest of) believers - We are Aware of that which We enjoined upon them concerning their wives and those whom their right hands possess - that thou mayst be free from blame, for Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, We have made lawful for you the wives to whom you have given their dowers, as well as those whom your right hand possesses from among the captives of war whom God has bestowed upon you. and [We have made lawful to you] the daughters of your paternal uncles and aunts, and the daughters of your maternal uncles and aunts, who have migrated with you; and any believing woman who gives herself to the Prophet, provided the Prophet wants to marry her. This applies only to you and not to the rest of the believers. We know what We have prescribed for them concerning their wives and those whom their right hands may possess, in order that there may be no blame on you. God is most forgiving, most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! verily We have allowed unto thee thy wives unto whom thou hast given their hires, and also those whomsoever thy right hand ownEth of those whomsoever Allah hath given thee as spoils of war, and the daughters of thy paternal uncle, and the daughters of thy paternal aunts, and the daughters of thy maternal uncle, and the daughters of thy maternal aunts, who migrated with thee, and any believing woman, when she offereth herself unto the Prophet if the Prophet desire to wed her --purely for thee, above the rest of the believers. Surely We know that which We have ordained unto them concerning their wives and those whom their right hands won: in order that there may be no blame upon thee: And Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Indeed We have made lawful to you your wives whom you have given their dowries, and those whom your right hand owns, of those whom Allah gave you as spoils of war, and the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who migrated with you, and a faithful woman if she offers herself to the Prophet and the Prophet desires to take her in marriage (a privilege exclusively for you, not for [the rest of] the faithful; We know what We have made lawful for them with respect to their wives and those whom their right hands own, so that there may be no blame on you ), and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! We have made lawful to thee thy wives to whom thou hast paid their dowers; and those whom thy right hand possesses out of the prisoners of war whom Allah has assigned to thee; and daughters of thy paternal uncles and aunts, and daughters of thy maternal uncles and aunts, who migrated (from Makka) with thee; and any believing woman who dedicates her soul to the Prophet if the Prophet wishes to wed her;- this only for thee, and not for the Believers (at large); We know what We have appointed for them as to their wives and the captives whom their right hands possess;- in order that there should be no difficulty for thee. And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Verily, We have made lawful to you your wives, to whom you have paid their Mahr (bridal money given by the husband to his wife at the time of marriage), and those (captives or slaves) whom your right hand possesses - whom Allah has given to you, and the daughters of your 'Amm (paternal uncles) and the daughters of your 'Ammah (paternal aunts) and the daughters of your Khal (maternal uncles) and the daughters of your Khalah (maternal aunts) who migrated (from Makkah) with you, and a believing woman if she offers herself to the Prophet, and the Prophet wishes to marry her; a privilege for you only, not for the (rest of) the believers. Indeed We know what We have enjoined upon them about their wives and those (captives or slaves) whom their right hands possess, - in order that there should be no difficulty on you. And Allah is Ever OftForgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, We have made lawful to you the wives to whom you have given dowries and those whom your right hand possesses, of whatever spoils of war that Allah has given you; and the daughters of your paternal uncles and paternal aunts, and of your paternal and maternal aunts who migrated with you; and any believing woman who gives herself to the Prophet, if the Prophet wishes to take her in marriage. This is only for you and not any other believer. We know the duties We have imposed on them concerning their wives and those whom their right hand possesses, so that there should be no fault in you. Allah is the Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! We have permitted to you your wives to whom you have given their dowries, and those you already have, as granted to you by God, and the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who emigrated with you, and a believing woman who has offered herself to the Prophet, if the Prophet desires to marry her, exclusively for you, and not for the believers. We know what We have ordained for them regarding their wives and those their right-hands possess. This is to spare you any difficulty. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, indeed We have made lawful to you your wives to whom you have given their due compensation and those your right hand possesses from what Allah has returned to you [of captives] and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who emigrated with you and a believing woman if she gives herself to the Prophet [and] if the Prophet wishes to marry her, [this is] only for you, excluding the [other] believers. We certainly know what We have made obligatory upon them concerning their wives and those their right hands possess, [but this is for you] in order that there will be upon you no discomfort. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:50] O Prophet! Indeed We have made lawful for you your wives whom you have given their dowries and what   your right hand owns, of those whom God has given you as spoils of war, from the disbelievers, [whom you have] taken captive, such as Safiyya and Juwayriyya, and the daughters of your paternal uncles and the daughters of your paternal aunts, and the daughters of your maternal uncles and the daughters of your maternal aunts who emigrated with you, as opposed to those who did not emigrate, and any believing woman if she gift herself [in marriage] to the Prophet and if the Prophet desire to take her in marriage, and ask for her hand in marriage without paying [her] a dowry — a privilege for you exclusively, not for the [rest of the] believers (nikāh, ‘marriage’, when expressed by the term hiba, ‘gift’, denotes [marriage] without dowry). Indeed We know what We have imposed upon them, namely, the believers, with respect to their wives, in the way of rulings, to the effect that they should not take more than four wives and should only marry with [the consent of] a legal guardian, [the presence of] witnesses and [the payment of] a dowry, and, with respect to, what their right hands own, of slavegirls, in the way of purchase or otherwise, so that the handmaiden be one lawful for her master, such as a slavegirl belonging to the People of the Scripture (kitābiyya), and not a Magian or an idolater, and that she should be ascertained [as not carrying child] with the necessary waiting period (istibrā’) before copulation; so that (li-kaylā is semantically connected to what came before [this last statement]) there may be no [unnecessary] restriction for you, [no] constraint in marriage [for you]. And God is Forgiving, of what is difficult to guard against, Merciful, in giving dispensations [allowing for latitude] in this respect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا النَّبِيُّ إِنَّا أَحْلَلْنَا لَكَ أَزْوَاجَكَ اللَّاتِي آَتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّا أَفَاءَ اللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالَاتِكَ اللَّاتِي هَاجَرْنَ مَعَكَ وَامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَنْ يَسْتَنْكِحَهَا خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِي أَزْوَاجِهِمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا (50){ ياأيها النبى إِنَّآ أَحْلَلْنَا لَكَ أزواجك اللاتى ءَاتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ الله عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عماتك وَبَنَاتِ وبنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ اللاَّتِى هَاجَرْنَ مَعَكَ وامْرَأَةً مُّؤمِنَةً إن وَهَبَتْ نَفْسَهَا للنَّبِىِّ إنْ أَرَادَ النَّبِىُّ أن يَسْتَنكِحَهَا خَالِصَةً لَكَ مِن دُونِ المُؤمِنِينَ } .نداء رابع خوطب به النبي صلى الله عليه وسلم في شأن خاص به هو بيان ما أحلّ له من الزوجات والسراري وما يزيد عليه وما لا يزيد مما بعضه تقرير لتشريع له سابق وبعضه تشريع له للمستقبل ، ومما بعضه يتساوى فيه النبي عليه الصلاة والسلام مع الأمة وبعضه خاص به أكرمه الله بخصوصيته مما هو توسعة عليه ، أو مما روعي في تخصيصه به علوّ درجته .ولعل المناسبة لورودها عقب الآيات التي قبلها أنه لما خاض المنافقون في تزوّج النبي صلى الله عليه وسلم زينب بنتتِ جحش وقالوا : تزوج من كانت حليلة متبنّاه ، أراد الله أن يجمع في هذه الآية مَن يحل للنبيء تزوجهن حتى لا يقع الناس في تردد ولا يفتنهم المرجفون . ولعل ما حدث من استنكار بعض النساء أن تهدي المرأة نفسها لرجل كان من مناسبات اشتمالها على قوله : { وامرأة مؤمنة إن وهبت نفسها للنبيء } الآية ، ولذلك جمعت الآية تقرير ما هو مشروع وتشريع ما لم يكن مشروعاً لتكون جامعة للأحوال ، وذلك أوعب وأقطع للتردد والاحتمال .فأما تقرير ما هو مشروع فذلك من قوله تعالى : { إنا أحللنا لك أزواجك التي آتيت أجورهن } إلى قوله : { وبنات خالاتك } ، وأما تشريع ما لم يكن مشروعاً فذلك من قوله : { التي هاجرن معك } إلى قوله : { ولا أن تبدل بهن من أزواج } \\[ الأحزاب : 52 \\] .فقوله تعالى : { إنا أحللنا لك أزواجك } خبر مُراد به التشريع . ودخول حرف ( إنّ ) عليه لا ينافي إرادة التشريع إذ موقع ( إنَّ ) هنا مجرد الاهتمام ، والاهتمام يناسب كلاّ من قصد الإِخبار وقصدِ الإِنشاء ، ولذلك عُطفت على مفعول { أحللنا } معطوفات قيدت بأوصاف لم يكن شرعها معلوماً من قبل وذلك في قوله : { وبنات عمك } وما عطف عليه باعتبار تقييدهن بوصف { الاتي هاجرن معك } ، وفي قوله : { وامرأة مؤمنة إن وهبت نفسها } باعتبار تقييدها بوصف الإِيمان وتقييدها ب«إن وهبت نفسها للنبي وأراد النبي أن يستنكحها» . هذا تفسير الآية على ما درج عليه المفسرون على اختلاف قليل بين أقوالهم .وعندي : أن الآية امتنان وتذكير بنعمة على النبي صلى الله عليه وسلم وتؤخذ من الامتنان الإِباحة ويؤخذ من ظاهر قوله : { لا يحل لك النساء من بعد } \\[ الأحزاب : 52 \\] الاقتصار على اللاتي في عصمته منهن وقت نزول الآية ، ولتكون هذه الآية تمهيداً لقوله تعالى : { لا يحل لك النساء من بعد } الخ .وسيجيء ما لنا في معنى قوله : { من بعدُ } وما لنا في موضع قوله { إن أراد النبي أن يستنكحها } .ومعنى { أحللنا لك } الإِباحة له ، ولذلك جاءت مقابلته بقوله عقب تعداد المحلّلات له { لا يحل لك النساء من بعد } .وإضافة أزواج إلى ضمير النبي صلى الله عليه وسلم تفيد أنّهن الأزواج اللاتي في عصمته ، فيكون الكلام إخباراً لتقرير تشريع سابق ومسوقاً مساق الامتنان ، ثم هو تمهيد لما سيتلوه من التشريع الخاص بالنبي صلى الله عليه وسلم من قوله : { اللاتي هاجرن معك } إلى قوله : { لا يحل لك النساء من بعد ولا أن تبدل بهن من أزواج } \\[ الأحزاب : 52 \\] . وهذا هو الوجه عندي في تفسير هذه الآية .وحكى ابن الفرس عن الضحاك وابن زيد أن المعنى بقوله : { أزواجك اللاتي آتيت أجورهن } أن الله أحلّ له أن يتزوج كل امرأة يُصدقها مهرها فأباح له كل النساء ، وهذا بعيد عن مقتضى إضافة أزواج إلى ضميره . وعن التعبير ب { آتيت أجورهن } بصيغة المضيّ . واختلف أهل التأويل في محمل هذا الوجه مع قوله تعالى في آخر الآية : { لا يحل لك النساء من بعد } فقال قوم : هذه ناسخة لقوله : { لا يحل لك النساء من بعد } ولو تقدمت عليها في التلاوة . وقال آخرون : هي منسوخة بقوله : { لا يحل لك النساء من بعد } .و { اللاتي آتيت أجورهن } صفة ل { أزواجك } ، أي وهن النسوة اللاتي تزوجتهن على حكم النكاح الذي يعم الأمة ، فالماضي في قوله : { آتيت أجورهن } مستعمل في حقيقته . وهؤلاء فيهن من هن من قراباته وهن القرشيات منهن : عائشة ، وحفصة ، وسودة ، وأم سلمة ، وأم حبيبة ، وفيهن من لسن كذلك وهنّ : جويرية من بني المصطلق ، وميمونة بنت الحارث من بني هلال ، وزينب أم المساكين من بني هلال ، وكانت يومئذٍ متوفاة ، وصفية بنت حيي الإِسرائيلية .وعطف على هؤلاء نسوة أخر وهنّ ثلاثة أصناف :«الصنف الأول» : ما ملكت يمينه مما أفاء الله عليه ، أي مما أعطاه الله من الفيء ، وهو ما ناله المسلمون من العدوّ بغير قتال ولكن تركَه العدو ، أو مما أعطي للنبيء صلى الله عليه وسلم مثل مارية القبطية أمّ ابنه إبراهيم فقد أفاءها الله عليه إذ وهبها إليه المقوقس صاحب مصر ، وإنما وهبها إليه هدية لمكان نبوءته فكانت بمنزلة الفيء لأنها ما لوحظ فيها إلا قصد المسالمة من جهة الجوار ، إذ لم تكن له مع الرسول صلى الله عليه وسلم سابق صحبة ولا معرفة ، والمعروف أن النبي صلى الله عليه وسلم لم يتسرّ غير مارية القبطية . وقيل : إنه تسرى جارية أخرى وهبتها له زوجه زينبُ ابنة جحش ولم يثبت . وقيل أيضاً : إنه تسرى ريحانَة من سبي قريظة اصطفاها لنفسه ولا تشملها هذه الآية لأنها ليست من الفيء ولكن من المغنم إلا أن يراد ب { مما أفاء الله عليك } المعنى الأعم للفيء وهو ما يشمل الغنيمة .وهذا الحكم يشركه فيه كثير من الأمة من كل من أعطاه أميره شيئاً من الفيء ، كما قال تعالى : { ما أفاء اللَّه على رسوله من أهل القرى فللَّه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل } \\[ الحشر : 7 \\] فمن أعطاه الأمير من هؤلاء الأصناف أمة من الفيء حلّت له .وقوله : { مما أفاء الله عليك } وصف لما ملكت يمينك وهو هنا وصف كاشف لأن المراد به مارية القبطية ، أو هي وريحانة إن ثبت أنّه تسراها .«الصنف الثاني» : نساء من قريب قرابته صلى الله عليه وسلم من جهة أبيه أو من جهة أمه مؤمنات مهاجرات . وأغنى قوله : { هاجرن معك } عن وصف الإِيمان لأن الهجرة لا تكون إلا بعد الإِيمان ، فأباح الله للنبيء عليه الصلاة والسلام أن يتزوج من يشاء من نساء هذا الصنف بعقد النكاح المعروف ، فليس له أن يتزوج في المستقبل امرأة من غير هذا الصنف المشروط بشرط القرابة بالعمومة أو الخؤولة وشرط الهجرة . وعندي : أن الوصفين ببنات عمه وعمّاته وبناتتِ خاله وخالاته ، وبأنهن هاجَرْن معه غير مقصود بهما الاحتراز عمن لسن كذلك ولكنه وصف كاشف مسوق للتنويه بشأنهن .وخص هؤلاء النسوة من عموم المنع تكريماً لشأن القرابة والهجرة التي هي بمنزلة القرابة لقوله تعالى : { والذين آمنوا ولم يهاجروا ما لكم من ولايتهم من شيء حتى يهاجروا } \\[ الأنفال : 72 \\] . وحكم الهجرة انقضى بفتح مكة . وهذا الحكم يتجاذبه الخصوصية للرسول صلى الله عليه وسلم والتعميم لأمته ، فالمرأة التي تستوفي هذا الوصف يجوز للرسول عليه الصلاة والسلام ولأمته الذين تكون لهم قرابة بالمرأة كهذه القرابة تزوجُ أمثالها ، والمرأة التي لم تستوف هذا الوصف لا يجوز للرسول عليه الصلاة والسلام تزوجها ، وهو الذي درج عليه الجمهور ، ويؤيده خبر روي عن أمّ هاني بنت أبي طالب . وقال أبو يوسف : يجوز لرجال أمته نكاح أمثالها . وباعتبار عدم تقييد نساء الرسول صلى الله عليه وسلم بعدد يكون هذا الإطلاق خاصاً به دون أمته إذ لا يجوز لغيره تزوج أكثر من أربع .وبنات عمّ النبي صلى الله عليه وسلم هن بنات إخوة أبيه مثل : بنات العباس وبنات أبي طالب وبنات أبي لهب . وأما بنات حمزة فإنهن بنات أخ من الرضاعة لا يحللن له ، وبناتُ عماته هن بنات عبد المطلب مثل زينب بنت جحش التي هي بنت أميمة بنت عبد المطلب .وبناتُ خاله هنّ بنات عبد مناف بن زُهرة وهن أخوال النبي صلى الله عليه وسلم عبد يغوث بن وهب أخو آمنة ، ولم يذكروا أن له بنات ، كما أني لم أقف على ذكر خالة لرسول الله فيما رأيت من كتب الأنساب والسير . وقد ذكر في «الإصابة» فريعة بنتَ وهب وذكروا هالة بنت وهب الزهرية إلا أنها لكونها زوجةَ عبد المطلب وابنتها صفية عمة رسول الله فقد دخلت من قبل في بنات عمه .وإنما أُفرد لفظ ( عم ) وجُمع لفظ ( عمات ) لأن العم في استعمال كلام العرب يطلق على أخي الأب ويطلق على أخي الجد وأخي جد الأب وهكذا فهم يقولون : هؤلاء بنو عم أو بنات عم ، إذا كانوا لعم واحد أو لعدة أعمام ، ويفهم المراد من القرائن . قال الراجز أنشده الأخفش :ما بَرئتْ من ريبة وذمّ ... في حربنا إلا بناتُ العمّوقال رؤبة بن العجاج :قالت بنات العم يا سلمى وإنْ ... كان فقيراً مُعدماً قالت وإنْفأما لفظ ( العمة ) فإنه لا يراد به الجنس في كلامهم ، فإذا قالوا : هؤلاء بنو عمةٍ ، أرادوا أنهم بنو عمةٍ معيّنة ، فجيء في الآية : { عماتك } جمعاً لئلا يفهم منه بنات عمة معينة . وكذلك القول في إفراد لفظ ( الخال ) من قوله : { بنات خالك } وجمع الخالة في قوله : { وبنات خالاتك } .وقال قوم : المراد ببنات العم وبنات العمات : نساء قريش ، والمراد ببنات الخال : النساء الزهريات ، وهو اختلاف نظري محض لا ينبني عليه عمل لأن النبي قد عُرفت أزواجه .وقوله : { اللاني هاجرن معك } صفة عائدة إلى { بنات عمك وبنات عماتك وبنات خالك وبنات خالاتك } كشأن الصفة الواردة بعد مفردات ، وهو شرط تشريع لم يكن مشروطاً من قبل .والمعية في قوله : { اللاتي هاجرن معك } معية المقارنة في الوصف المأخوذ من فعل { هاجرن } فليس يلزم أن يكنَّ قد خرجْنَ مصاحبات له في طريقه إلى الهجرة .«الصنف الثالث» : امرأة تَهب نفسها للنبيء صلى الله عليه وسلم أي تجعل نفسها هبة له دون مهر ، وكذلك كان النساء قبل الإسلام يفعلن مع عظماء العرب ، فأباح الله للنبيء أن يتخذها زوجة له بدون مهر إذا شاء النبي صلى الله عليه وسلم ذلك ، فهذا حقيقة لفظ { وهبت } ، فالمراد من الهبة : تزويج نفسها بدون عوض ، أي بدون مهر ، وليست هذه من الهبة التي تستعمل في صيغ النكاح إذا قارنها ذكر صداق لأن ذلك اللفظ مجاز في النكاح بقرينة ذكر الصداق ويصح عقد النكاح به عندنا وعند الحنفية خلافاً للشافعي .فقوله : { وامرأة } عطف على { أزواجك } . والتقدير : وأحللنا لك امرأة مؤمنة .والتنكير في { امرأة } للنوعية : والمعنى : ونُعلمك أنا أحللنا لك امرأة مؤمنة بقيد أن تهب نفسها لك وأن تريد أن تتزوجها فقوله : { للنبيء } في الموضعين إظهار في مقام الإِضمار . والمعنى : إن وهبتْ نفسها لك وأردتَ أن تنكحها . وهذا تخصيص من عموم قوله : { وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك اللاتي هاجرن معك } فإذا وهبت امرأة نفسها للنبيء صلى الله عليه وسلم وأراد نكاحها جاز له ذلك بدون ذينك الشرطين ولأجل هذا وصفت { امرأة } ب { مؤمنة } ليعلم عدم اشتراط ما عدا الإيمان . وقد عُدّت زينب بنت خُزيمة الهلالية وكانت تدعى في الجاهلية أمَّ المساكين في اللاتي وهبن أنفسهن ، ولم تلبث عنده زينب هذه إلا قليلاً فتوفيت وكان تزوجها سنة ثلاث من الهجرة فليست مما شملته الآية .ولم يثبت أن النبي صلى الله عليه وسلم تزوج غيرها ممن وهبت نفسها إليه وهن : أم شريك بنت جابر الدوسية واسمها عزية ، وخولة بنت حكيم عرضت على رسول الله صلى الله عليه وسلم نفسها فقالت عائشة : أما تستحيي المرأة أن تهب نفسها للرجل ، وامرأة أخرى عرضت نفسها على النبي صلى الله عليه وسلم روى ثابت البناني عن أنس قال : «جاءت امرأة إلى رسول الله فعرضت عليه نفسها فقالت : يا رسول الله ألك حاجة بي؟ فقالت ابنةُ أنس وهي تسمع إلى رواية أبيها : ما أقل حياءها وَاسَوأتاه واسوأتاه . فقال أنس : هي خير منك رغبت في النبي فعرضت عليه نفسها» . وعن سهل بن سعد أن امرأة عرضت نفسها على النبي صلى الله عليه وسلم فلم يجبها . فقال رجل : «يا رسول الله زوجنيها ، إلى أن قال له ، ملّكناكها بما معك من القرآن» فهذا الصنف حكمه خاص بالنبي صلى الله عليه وسلم وذلك أنه نكاح مخالف لسنة النكاح لأنه بدون مهر وبدون ولي .وقد ورد أن النسوة اللاتي وهبن أنفسهن للنبيء صلى الله عليه وسلم أربع هن : ميمونة بنت الحارث ، وزينب بنت خزيمة الأنصارية الملقبة أمّ المساكين ، وأم شريك بنت جابر الأسدية أو العامرية ، وخولة بنت حكيم بنت الأوقص السَلَمية . فأما الأوليان فتزوجهما النبي صلى الله عليه وسلم وهما من أمهات المؤمنين والأخريان لم يتزوجهما .ومعنى { وهبت نفسها للنبيء } أنها ملّكته نفسها تمليكاً شبيهاً بملك اليمين ولهذا عطفت على { ما ملكت يمينك } ، وأردفت بقوله : { خالصة لك من دون المؤمنين } أي خاصة لك أن تتخذها زوجة بتلك الهبة ، أي دون مهر وليس لبقية المؤمنين ذلك . ولهذا لما وقع في حديث سهل بن سعد المتقدم أن امرأة وهبت نفسها للنبيء صلى الله عليه وسلم وعلم الرجل الحاضر أن النبي عليه الصلاة والسلام لا حاجة له بها سأل النبي عليه الصلاة والسلام أن يُزوجه إياها علماً منه بأن تلك الهبة لا مهر معها ولم يكن للرجل ما يصدقها إياه ، وقد علم النبي صلى الله عليه وسلم منه ذلك فقال له ما عندك؟ قال : ما عندي شيء . قال : اذهب فالتمس ولو خاتماً من حديد فذهب ثم رجع فقال : لا والله ولا خاتَماً من حديد ، ولكن هذا إزاري فلها نصفه . قال سهل : ولم يكن له رداء ، فقال النبي : \" وما تصنع بإزارك إن لبستَه لم يكن عليها منه شيء وإن لبستْه لم يكن عليك منه شيء ثم قال له ماذا معك من القرآن؟ فقال : معي سورة كذا وسورة كذا لسُور يُعدّدها ، فقال النبي صلى الله عليه وسلم ملكناكها بما معك من القرآن \" .وفي قوله : { إن وهبت نفسها للنبي } إظهار في مقام الإضمار لأن مقتضى الظاهر أن يقال : إن وهبت نفسها لك . والغرض من هذا الإِظهار ما في لفظ { النبي } من تزكية فعل المرأة التي تهب نفسها بأنها راغبة لكرامة النبوءة .وقوله : { إن أراد النبي أن يستنكحها } جملة معترضة بين جملة { إن وهبت } وبين { خالصة } وليس مسوقاً للتقييد إذ لا حاجة إلى ذكر إرادته نكاحها فإن هذا معلوم من معنى الإِباحة ، وإنما جيء بهذا الشرط لدفع توهم أن يكون قبوله هبتها نفسها له واجباً عليه كما كان عرف أهل الجاهلية . وجوابه محذوف دل عليه ما قبله ، والتقدير : إن أراد أن يستنكحها فهي حلال له ، فهذا شرط مستقل وليس شرطاً في الشرط الذي قبله .والعدول عن الإِضمار في قوله : { إن أراد النبي } بأن يقال : إن أراد أن يستنكحها لما في إظهار لفظ { النبي } من التفخيم والتكريم .وفائدة الاحتراز بهذا الشرط الثاني إبطال عادة العرب في الجاهلية وهي أنهم كانوا إذا وهبت المرأة نفسها للرجل تعين عليه نكاحها ولم يجز له ردُّها ، فأبطل الله هذا الالتزام بتخيير النبي عليه الصلاة والسلام في قبول هِبة المرأة نفسها له وعدمه ، وليرفع التعيير عن المرأة الواهبة بأن الرد مأذون به .والسين والتاء في { يستنكحها } ليستا للطلب بل هما لتأكيد الفعل كقول النابغة :وهم قتلوا الطائي بالحجر عنوةً ... أبا جابر فاستنكحوا أم جابرأي بنو حُنّ قتلوا أبا جابر الطائي فصارت أم جابر المزوجة بأبي جابر زوجة بني حُنّ ، أي زوجة رجل منهم . وهي مثل السين والتاء في قوله تعالى : { فاستجاب لهم ربهم } \\[ آل عمران : 195 \\] .فتبيَّن من جعل جملة { إن أراد النبي أن يستنكحها } معترضة أن هذه الآية لا يصح التمثيل بها لمسألة اعتراض الشرط على الشرط كما وقع في رسالة الشيخ تقي الدين السبكي المجعولة لاعتراض الشرط على الشرط ، وتبعه السيوطي في الفن السابع من كتاب «الأشباه والنظائر النحوية» ، ويلوح من كلام صاحب «الكشاف» استشعار عدم صلاحية الآية لاعتبار الشرط في الشرط فأخذ يتكلف لتصوير ذلك .وانتصب { خالصة } على الحال من { امرأة } ، أي خالصة لك تلك المرأة ، أي هذا الصنف من النساء ، والخلوص معنيٌّ به عدم المشاركة ، أي مشاركةِ بقية الأمة في هذا الحكم إذ مادة الخلوص تجمع معاني التجرّد عن المخالطة . فقوله : { من دون المؤمنين } لبيان حال من ضمير الخطاب في قوله : { لك } ما في الخلوص من الإجمال في نسبته . وقد دل وصف { امرأة } بأنها { مؤمنة } أن المرأة غير المؤمنة لا تحل للنبيء عليه الصلاة والسلام بهبة نفسها . ودل ذلك بدلالة لحن الخطاب أنه لا يحلّ للنبيء صلى الله عليه وسلم تزوج الكتابيات بَلْهَ المشركات ، وحكى إمام الحرمين في ذلك خلافاً .قال ابن العربي : والصحيح عندي تحريمها عليه . وبهذا يتميز علينا؛ فإن ما كان من جانب الفضائل والكرامة فحظه فيه أكثر وإذا كان لا تحل له من لم تُهاجر لنقصانها فضلَ الهجرة فأحرى أن لا تحلّ له الكتابية الحرة .{ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فى أزواجهم وَمَا مَلَكَتْ أيْمَانُهُمْ } .جملة معترضة بين جملة { من دون المؤمنين } وبين قوله : { لكيلا يكون عليك حرج } أو هي حال سببي من المؤمنين ، أي حال كونهم قد علمنا ما نَفرض عليهم .والمعنى : أن المؤمنين مستمر ما شُرع لهم من قبلُ في أحكام الأزواج وما ملكتْ أيمانهم ، فلا يَشملهم ما عُيّن لك من الأحكام الخاصة المشروعة فيما تقدم آنفاً ، أي قد علمنا أن ما فرضناه عليهم في ذلك هو الَّلائق بحال عموم الأمة دون ما فرضناه لك خاصة .و { ما فرضنا عليهم } موصول وصلته ، وتعدية { فرضنا } بحرف ( على ) المقتضي للتكليف والإِيجاب للإِشارة إلى أن من شرائع أزواجهم وما ملكَتْ أيمانهم ما يَوَدُّون أن يخفف عنهم مثل عدد الزوجات وإيجاب المهور والنفقات ، فإذا سمعوا ما خص به النبي صلى الله عليه وسلم من التوسعة في تلك الأحكام وَدّوا أن يلحقوا به في ذلك ، فسجل الله عليهم أنهم باقون على ما سبق شرعه لهم في ذلك ، والإخبار بأن الله قد علم ذلك كناية عن بقاء تلك الأحكام لأن معناه أنّا لم نغفل عن ذلك ، أي لم نبطله بل عن علم خصصنا نبيئنا بما خصصناه به في ذلك الشأن ، فلا يشمل ما أحللناه له بقيةَ المؤمنين .وظرفية { في } مجازية لأن المظروف هو الأحكام الشرعية لا ذَوات الأزواج وذواتُ ما ملكته الأيمان .{ لِكَيْلاَ يَكُونَ عَلَيْكَ حَرَجٌ وَكَانَ الله غَفُوراً رَحِيماً } .تعليل لما شرعه الله تعالى في حق نبيئه صلى الله عليه وسلم في الآيات السابقة من التوسعة بالازدياد من عدد الأزواج وتزوج الواهبات أنفسهن دون مهر ، وجَعل قبول هبتها موكولاً لإِرادته ، وبما أبقى له من مساواته أمته فيما عدا ذلك من الإباحة فلم يضيّق عليه ، وهذا تعليم وامتنان .والحرج : الضيق ، والمراد هنا أدنى الحرج ، وهو ما في التكليف من بعض الحرج الذي لا تخلو عنه التكاليف ، وأما الحرج القوي فمنفي عنه وعن أمته . ومراتب الحرج متفاوتة ، ومناط ما يُنفى عن الأمة منها وما لا ينفى ، وتقديراتُ أحوال انتفاء بعضها للضرورة هو ميزان التكليف الشرعي فالله أعلم بمراتبها وأعلم بمقدار تحرج عباده وذلك مبين في مسائل العزيمة والرخصة من علم الأصول ، وقد حرر ملاّكه شهاب الدين القرافي في الفرق الرابع عشر من كتابه «أنواء البروق» . وقد أشبعنا القول في تحقيق ذلك في كتابنا المسمى «مقاصد الشريعة الإسلامية» .وأعلم أن النبي صلى الله عليه وسلم سلك في الأخذ بهذه التوسعات التي رفع الله بها قدره مسلك الكُمّل من عباده وهو أكملهم فلم ينتفع لنفسه بشيء منها فكان عبداً شكوراً كما قال في حديث استغفاره ربه في اليوم استغفاراً كثيراً .والتذييل بجملة { وكان الله غفوراً رحيماً } تذييل لما شرعه من الأحكام للنبيء صلى الله عليه وسلم لا للجملة المعترضة ، أي أن ما أردناه من نفي الحرج عنك هو من متعلقات صفتي الغفران والرحمة اللتين هما من تعلقات الإِرادة والعلم فهما ناشئتان عن صفات الذات ، فلذلك جعل اتصاف الله بهما أمراً متمكّناً بما دلّ عليه فعل { كان } المشير إلى السابقية والرسوخ كما علمته في مواضع كثيرة .\n\n",
      "translations": [
        {
          "translation": "(O Prophet! Lo! We have made lawful unto thee thy wives unto whom thou hast paid their dowries, and those whom thy right hand possesseth) Maria the Copt (of those whom Allah hath given thee as spoils of war, and the daughters of thine uncles on the father's side) and it is lawful for you to marry the daughters of your paternal uncle (and the daughters of thine aunts on the father's side) from the Banu 'Abd al-Muttalib, (and the daughters of thine uncles on the mother's side) from the Banu 'Abd Manaf Ibn Zahrah (who emigrated with thee) from Mecca to Medina, (and a believing woman) who believes in Allah's divine Oneness: i.e. Umm Sharik Bint Jabir al-'Amiriyyah (if she give herself unto the Prophet and the Prophet desire to ask her in marriage, a privilege for thee only) and a dispensation for you only, (not for the (rest of) believers. We are aware of that which We enjoined upon them) what We have made lawful for and enjoined upon the believers (concerning their wives) concerning marrying up to four wives after giving them their dowry and making a proper marriage contract (and those whom their right hands possess) without limit (that thou mayst be free from blame) regarding marrying that which Allah has made lawful for you to marry, (for Allah is Forgiving) of that which has ensued from you, (Merciful) regarding that which He made a dispensation for you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "ثمَّ أشار سبحانه إلى تعداد ما أحل لحبيبه صلى الله عليه وسلم من الأزواج، فقال منادياً له تبجيلاً وتعظيماً: { يٰأَيُّهَا ٱلنَّبِيُّ } المفضل المكرم من لدنا على سائر الأنبياء والرسل بالعنايات العليَّة والكرامات السنيَّة { إِنَّآ } من مقام عظيم جودنا { أَحْلَلْنَا } وأبحنا { لَكَ } في شرعك ودينك { أَزْوَاجَكَ ٱللاَّتِيۤ آتَيْتَ } وأعطيت { أُجُورَهُنَّ } أي: مهورهن معجلاً { وَ } أبحنا لك أيضاً { مَا مَلَكَتْ يَمِينُكَ } من الإماء المردودة إليك { مِمَّآ أَفَآءَ ٱللَّهُ } المنعم المفضل { عَلَيْكَ } ورده سبحانه من خيار المسببات وصفيات المغنم إليك، وصفية - رضي الله عنها - منهن { وَ } أحللنا لك أيضاً في دينك { بَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ ٱللاَّتِي هَاجَرْنَ مَعَكَ } من مكة حباً لك، وطلباً لمرضاة ربك، وما أبحنا لك ممن لم تهاجر معك.\n\n{ وَ } أبحنا لك أيضا خاصة { ٱمْرَأَةً مُّؤْمِنَةً } قيّد بها؛ لأن الكافرة لا تليق بفراشه صلى الله عليه وسلم { إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ } تبرعاً بلا جعلٍ ومهرٍ، فعليه الخيار { إِنْ أَرَادَ ٱلنَّبِيُّ أَن يَسْتَنكِحَهَا } أي: يطلب أن يدخل عليها ويقبلها للفراش أحللناها { خَالِصَةً } خاصة { لَّكَ } يا أكمل الرسل؛ تكريماً لك وتعظيماً لشأنك { مِن دُونِ ٱلْمُؤْمِنِينَ } أي: لم نبحها لغيرك من أمتك، بل هي من جملة الأمور التي اختصصت بها، كالتزوج فوق الأربعة وغيرها، وإنما نخص أمثال هذا لك يا أكمل الرسل ولم نعممها من أمتك؛ لأنَّا من وفور حكتنا { قَدْ عَلِمْنَا } بعلمنا الحضوري من ظواهر أحوال المؤمنين وبواطنهم استعدادهم على { مَا فَرَضْنَا } وقدرنا { عَلَيْهِمْ } حتماً { فِيۤ } حقوق { أَزْوَاجِهِـمْ } من المهر والولي والشهود، وجميع متمما النكاح ومكملاته.\n\n{ وَ } علمنا أيضاً منهم سبب ما قدرنا عليهم في حق { مَا مَلَكَتْ أَيْمَانُهُمْ } من المسببات الزائدة، ألاَّ يدخلوا عليهن إلا أن يُتملكوا بوجه آخر، لكن أنزلنا عندك يا أكمل الرسل بعض ما أوحينا عليهم، وخصصناك بها دونهم { لِكَيْلاَ يَكُونَ عَلَيْكَ حَرَجٌ } ضيق في تحميلها، مع أنا نعلم من ظواهرك وبواطنك أنك لا تهمل شيئاً من حقوق الله ولا حقوق عباده، ولا يقع منك ظلم على أحدٍ من خلق الله؛ لذلك لم نضيق عليك أمر النكاح وضيقنا على المؤمنين { وَكَانَ ٱللَّهُ } المراقب لأحوال عباده، المصلح لمفاسدهم { غَفُوراً } يستر ويعفو عنهم بعضه ما يعسر عليهم التحرز في رعاية حقوق المؤمنين والمؤمنات { رَّحِيماً } [الأحزاب: 50] يرحمهم ويعين عليهم في حفظها ورعايتها.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يَا أَيُّها النَّبِيُّ إِنَّا أَحْلَلْنا لَكَ أَزْوَاجَكَ اللاَّتِي آتَيْتَ أُجُورَهُنَّ } مهورهن إذ المهر أجر البضع، ولذا قال الكرخي ـ من الحنفية ـ: إن النكاح بلفظ الإجارة جائز، والجواب أن التأبيد من شرط النكاح، والتأقيت من شرط الإجارة، وبينهما منافاة، وإيتاؤها: إعطاؤها عاجلاً، أو فرضها في المفوض، وتسميته في المسمى. والمراد بالأزواج المحلَّلة له ـ عليه الصلاة والسلام ـ: نساؤه اللاتي في عصمته حينئذ، كعائشة وغيرها، وكان قد أعطاهن مهورهن، أو: جميع النساء اللاتي يريدُ أن يتزوجهن، فأباح له جميع النساء. وهذا أوسع. { و } أحللنا لك { ما ملكت يمينُك } من السّراري { مما أفاءَ الله عليك } من الغنائم، وهي صفية، أعتقها وتزوجها. { وبناتِ عمِّك وبناتِ عماتِك وبناتِ خَالِك وبنات خَالاتِك } يعني قرابتك، التي من جهة أبيك، ومن جهة أمك. وكان له ـ عليه الصلاة والسلام ـ أعمام وعمات، إخوة لأبيه، ولم يكن لأمه صلى الله عليه وسلم أخ ولا أخت، فإنما يعني بخاله وخالته: عشيرة أمه، وهم بنو زهرة، ولذلك كانوا يقولون: نحن أخوال رسول الله صلى الله عليه وسلم. فإذا قلنا: المراد بقوله: { أحللنا لك أزواجك } مَن كان في عصمته، فهذا عطف عليهن، وإباحة لأن يتزوج قرابته، زيادة على مَن كان في عصمته، وإذا قلنا: المراد: جميع النساء، فهذا تحديد لهن، على وجه التشريف، بعد دخولهن في العموم. وقوله: { اللاتي هاجَرْنَ معك } قيد في حلّية قرابته ـ عليه الصلاة والسلام ـ. قالت أم هانىء: خطبني رسولُ الله صلى الله عليه وسلم، فاعتذرتُ إليه، فعَذَرَني، فأنزل الله هذه الآية، فلم أَحِلَ له لأني لم أُهاجر معه، كنت من الطُلَقَاءِ.  و \" مع \" هنا: ليست للاقتران، بل لوجود الهجرة فقط، كقوله:\n[النمل: 44]. { و } أحللنا لك { امرأةً مؤمنةً إِن وهبت نفسَها للنبي } من غير مَهر ولا عقد، فهو منصوب بفعل يُفسره ما قبله، أو: عطف على ما سبقه، ولا يدفعه أن \" التي \" للاستقبال لأن المعنى بالإحلال: الإعلام بالحِلّ، أي: أعلمناك حِلّ امرأة مؤمنة وهبت لك نفسها، ولا تطلب مهراً إن اتفق، ولذلك نكّرها. واختلف في اتفاق ذلك، والقائل به ذكر أربعاً: ميمونة بنت الحارث، حين جاءها الخاطب، قالت: البعير وما عليه لرسول الله صلى الله عليه وسلم، فتزوجها. وزينب بنت خزيمة الأنصارية، أم المساكين، وتوفيت في حياته صلى الله عليه وسلم، وأم شريك بنت جابر الأسدية، وقيل: أم شريك العامرية، قيل: إن رسول الله صلى الله عليه وسلم تزوجها، ولم يثبت ذلك. ذكره ابن عبد البر. وخولة بنت حكيم السُلَمية. ذكر البخاري عن عائشة أنها قالت: كانت خولة بنت حكيم من اللائي وهبن أنفسهن.\nقال أبو نعيم: تزوجها رسول الله صلى الله عليه وسلم ولم يدخل بها. قال السهيلي: فدلّ أنهن كن غير واحدة. والله أعلم. هـ. وقال ابن عباس: هو بيان حكم في المستقبل، ولم يكن عنده أحد منهن بالهبة، فانظره.  وقرأ الحسن بفتح \" أن \" ، على حذف لام التعليل. وقرأ ابن مسعود رضي الله عنه بغير \" إن \" أي: وأحللنا لك امرأة مؤمنة وهبت نفسها للنبي إن أراد النبي أن يستنكحها، أي: طلب نكاحها والرغبة فيها. وقيل: نكح واستنكح بمعنى واحد. والشرط الثاني تقييد للأول، كأنه قال: أحللنا لك امرأة إن وهبت نفسها، وأنت تريد أن تستنكحها، وإرادته هي: قبول الهبة.  جعلنا ذلك { خالصةً لك من دون المؤمنين } بل يجب عليهم المهر، تسمية أو فرضاً. وفيه إيذان بأنه مما خصّ به ـ عليه الصلاة والسلام ـ لشرف نبوته، وتقرير لاستحقاقه الكرامة. قال ابن جزي: وانظر كيف رجع من الغيبة إلى الخطاب ليخص المخاطب وحده. وقيل: إن \" خالصة \" يرجع إلى كل ما تقدم من النساء المباحات له صلى الله عليه وسلم لأن سائر المؤمنين قصّروا على أربع نسوة، وأبيح له ـ عليه الصلاة والسلام ـ أكثر من ذلك. ومذهب مالك: أن النكاح بلفظ الهبة لا ينعقد، خلافاً لأبي حنيفة. هـ. قلت: إن قرنه ذكر الصداق جاز، كما في المختصر. و خالصة: مصدر مؤكد، أي: خلُص إحلالها، أو: إحلال ما أحللنا لك على القيود المذكورة خلوصاً لك. أو: حال من الضمير في وهبت، أو: صفة لمصدر محذوف، أي: هبة خالصة لك. { قد عَلِمْنَا ما فرضنا عليهم في أزواجهم } أي: ما أوجبنا من المهور على أمتك في زوجاتهم، أو: ما أوجبنا عليهم في أزواجهم من الحقوق، كالنفقة وحسن المعاشرة، أو: ما فرضنا عليهم من الاقتصار على الأربع، أو: ما أوجبنا عليهم من الإشهاد والولي، { وما ملكت أيمانُهم } بالشراء وغيره من وجوه الملك، فقد علمنا ما فرضنا عليهم من الإنفاق والرفق، وألا يكلفوهن ما لا طاقة لهن به، مع حلية الوطء، ولو تعددن. وإنما وسَّعنا عليك في أمر النساء { لِكَيْلاَ يكونَ عليك حرجٌ } ضيق، وهو راجع لقوله: { خالصة لك من دون المؤمنين } والجملة من قوله: { قد علمنا ما فرضنا... } الخ: اعتراضية للدلالة على أن الفرق بينه وبين المؤمنين في نحو ذلك ليس لمجرد التوسيع عليه، بل لمعان تقتضي التوسيع عليه والتضييق عليهم تارة، والعكس أخرى، كنكاح الكتابية والأَمة، فتحرمان عليه صلى الله عليه وسلم دون أُمته. { وكان الله غفوراً رحيماً } بالتوسعة على عباده، أو: غفوراً لما يُعسر التجرُّد عنه، رحيماً بالتوسعة في مظان الحرج. الإشارة: قد وسَّع الله على خواصه في باب النكاح، وأمدّهم في ذلك بالقوة، وأعطاهم من الباءة ما لم يُعط غيرهم، تشريفاً وترغيباً في هذا الأمر، لإبقاء النسل الطيب، ولِما فيه من التوسعة في المعرفة، وحسن الخلق، وتعلم السياسة، فدلّ ذلك أن كثرة النساء لا يُنافي الزهد، ولا يقدح في كمال المعرفة، بل يزيد فيها.\nقال الإمام ابن منصور المقدسي، في شرح منازل السائرين ـ في باب الزهد ـ: ومتعلق الزهد ستة أشياء، لا يستحق العبد اسم الزهد حتى يزهد فيها، وهي: المال، والرئاسة، والناس، والنفس، وكل ما دون الله. وليس المراد رفضها عن الملِك، فقد كان داود وسليمان ـ عليهما السلام ـ من أزهد أهل زمانهما، ولهما من المُلك والنساء والمِلك ما لهما. وكان نبينا صلى الله عليه وسلم أزهد البشر على الإطلاق، وله تسع نسوة، وكان عليّ بن أبي طالب كرّم الله وجهه، وعبد الرحمن بن عوف، والزبير، وعثمان ـ رضوان الله عليهم ـ من الزهّاد، مع ما لهم من الأموال ـ أي: والنساء ـ فكان لعليّ رضي الله عنه أربع حرائر، وسبعة عشر سرية، ولعبد الرحمن بن عوف والزبير أربع أربع، ولعثمان كذلك. وتزوج المغيرة بن شعبة تسعاً وتسعين امرأة. ثم قال: وكان الحسن بن عليّ رضي الله عنهما من الزهّاد، مع أنه كان من أكثر الأمة محبة للنساء ونكاحهن. ثم قال: ومن أحسن ما قيل في الزهد كلام الحسن وغيره، قال: ليس الزهد في الدنيا بتحريم الحلال، ولا بإضاعة المال، وإنما الزهد أن تكون بما في يد الله أوثق منك بما في يدك، وأن تكون في ثواب المصيبة إذا أُصبت بها أرغب منك فيها لو لم تُصبك. انتهى المقصود منه.  ثم وسع على نبيه في القسمة فقال: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِيۤ إِلَيْكَ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:61",
      "similarity": 0.47941238583107265
    },
    {
      "verse": "4:23",
      "similarity": 0.4574648219236817
    },
    {
      "verse": "59:7",
      "similarity": 0.251605771201575
    },
    {
      "verse": "39:49",
      "similarity": 0.22606659495095427
    },
    {
      "verse": "33:38",
      "similarity": 0.22452663630807568
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}