{
  "chapter": "الأحزاب",
  "text": "ان الذين يؤذون الله ورسوله لعنهم الله فى الدنيا والءاخرة واعد لهم عذابا مهينا",
  "translations": [
    {
      "translation": "As for those who abuse Allah and His Messenger, Allah's curse is on them in this world and the Next World. He has prepared a humiliating punishment for them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who offend God and His Prophet will be damned in this world and the next. There is a shameful punishment ready for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who cause annoyance to Allah and His Messenger - Allah has cursed them in this world and in the Hereafter and has prepared for them a humiliating chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who annoy God and His Messenger will be condemned by God in this life and in the life to come. He has prepared for them a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who trouble Allah and His Noble Messenger – upon them is Allah’s curse in the world and in the Hereafter, and Allah has kept prepared a disgraceful punishment for them. (To disrespect / trouble the Holy Prophet – peace and blessings be upon him – is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who annoy Allah and His Messenger, Allah has cursed them in this world and in the Hereafter, and has prepared for them a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who speak evil things of Allah and His Apostle, Allah has cursed them in this world and the here after, and He has prepared for them a chastisement bringing disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hurt God and His Messenger -- them God has cursed in the present world and the world to come, and has prepared for them a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who malign Allah and His messenger, Allah hath cursed them in the world and the Hereafter, and hath prepared for them the doom of the disdained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who annoy God and His Messenger shall be cursed by God in this world and in the Hereafter. God has prepared for them a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who annoy Allah and His apostle, --Allah hath cursed them in the world and the Hereafter, and hath gotten ready for them a torment Ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who offend Allah and His Apostle are cursed by Allah in the world and the Hereafter, and He has prepared a humiliating punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who annoy Allah and His Messenger - Allah has cursed them in this World and in the Hereafter, and has prepared for them a humiliating Punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who annoy Allah and His Messenger (SAW) Allah has cursed them in this world, and in the Hereafter, and has prepared for them a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who (try to) hurt Allah and His Messenger shall be cursed by Allah in this present life and in the Everlasting Life, and He has prepared for them a humbling punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who insult God and His Messenger, God has cursed them in this life and in the Hereafter, and has prepared for them a demeaning punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who abuse Allah and His Messenger - Allah has cursed them in this world and the Hereafter and prepared for them a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:57] Indeed those who are injurious to God and His Messenger — and they are the disbelievers, who attribute to God what He is exalted above of such things as [His having] a son or a partner and they deny His Messenger — God has cursed them in this world and the Hereafter, He has banished them [from His mercy], and has prepared for them a humiliating chastisement, and that is the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who malign Allah and His messenger) by inventing lies about them; this verse was revealed about the Jews and Christians, (Allah hath cursed them) Allah will torment them (in the world) through being killed and expelled from their lands (and the Hereafter) in the Fire, (and hath prepared for them the doom of the disdained) they will be humiliated in their torture. 480\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { إِنَّ ٱلَّذِينَ يُؤْذُونَ ٱللَّهَ وَرَسُولَهُ } حيث يأتون بالأفعال الذميمة القبيحة\n المستكرهة عقلاً وشرعاً عنده صلى الله عليه وسلم فيؤذونه بها\n ذكر سبحانه نفسه\n تعظيماً لشأن حبيبه صلى الله عليه وسلم وإلا فهو منزه عن التأذي والتأثر\n أو لأن إيذاءه صلى الله عليه وسلم مستلزم لإذائه سبحانه { لَعَنَهُمُ ٱللَّهُ } المنتقم عنهم\n وطردهم عن سعة رحمته { فِي ٱلدُّنْيَا } على ألسنة خلَّص عباده\n وأبعدهم عن مجالسهم ومحافلهم { وَٱلآخِرَةِ } عن عز حضوره وسعة رحمته وجنته { وَأَعَدَّ لَهُمْ } في النار { عَذَاباً مُّهِيناً } [الأحزاب: 57] مؤلماً مزعجاً\n لا عذاب أسوأ منه وأشد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن الذين يُؤذون اللهَ ورسولَه } بارتكابهم ما يكرهانه من الكفر والمعاصي والبدع\n وقال ابن عباس: هم اليهود والنصارى والمشركون\n فقالت اليهود:\n\n[المائدة: 64]،\n\n[آل عمران: 181] وقالت النصارى:\n\n[التوبة: 30]،\n\n[المائدة: 73]\n وقال المشركون: الملائكة بنات الله، والأصنام شركاؤه\n وقيل: يؤذونه: يُلحدون في أسمائه وصفاته\n ويؤذون رسول الله، حين شُج وجهه، وكُسرت رباعيتُه، وقيل له: هو ساحر وشاعر ومجنون\n أو: بترك سُنَّته ومخالفة شريعته\n ويحتمل أن يكون المراد يؤذون رسولَ الله فقط بالتنقيص، أو بالتعرُّض لنسائه\n وذكرُ اسم الله للتشريف\n { لعنَهُم اللهُ في الدنيا والآخرة } أي: أبعدهم من رحمته في الدارين { وأعدَّ لهم عذاباً مهيناً } يُهينهم ويُخزيهم في النار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:61",
      "similarity": 0.42583882806432544
    },
    {
      "verse": "22:57",
      "similarity": 0.4176980996403709
    },
    {
      "verse": "4:16",
      "similarity": 0.390416968747018
    },
    {
      "verse": "33:64",
      "similarity": 0.38669266092558835
    },
    {
      "verse": "14:12",
      "similarity": 0.3778300057627704
    }
  ]
}