{
  "chapter": "الأحزاب",
  "text": "يايها الذين ءامنوا۟ لا تدخلوا۟ بيوت النبى الا ان يؤذن لكم الى طعام غير نظرين انىه ولكن اذا دعيتم فادخلوا۟ فاذا طعمتم فانتشروا۟ ولا مستـنسين لحديث ان ذلكم كان يؤذى النبى فيستحى منكم والله لا يستحى من الحق واذا سالتموهن متعا فسـلوهن من وراء حجاب ذلكم اطهر لقلوبكم وقلوبهن وما كان لكم ان تؤذوا۟ رسول الله ولا ان تنكحوا۟ ازوجه منۢ بعده ابدا ان ذلكم كان عند الله عظيما",
  "translations": [
    {
      "translation": "You who have iman! do not go into the Prophet's rooms except when you are invited to come and eat. Do not wait there while the food is being cooked. However, when you are called, go in, and when you have eaten, disperse, not remaining there to chat with one another. Doing that causes annoyance to the Prophet though he is too reticent to tell you so. But Allah is not reticent with the truth. When you ask his wives for something, ask them from behind a screen. That is purer for your hearts and their hearts. It is not right for you to cause annoyance to the Messenger of Allah or ever to marry his wives after him. To do that would be a dreadful thing in Allah's sight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not enter the houses of the Prophet for a meal without awaiting the proper time, unless asked, and enter when you are invited, and depart when you have eaten, and do not stay on talking. This puts the Prophet to inconvenience, and he feels embarrassed before you; but God is not embarrassed in (saying) the truth. And when you ask his wife for some thing of utility, ask for it from behind the screen. This is for the purity of your hearts and theirs. It does not behove you to annoy the prophet of God, or to ever marry his wives after him. This would indeed be serious in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, enter not the houses of the Prophet without his permission, nor wait for a meal to be prepared; instead enter when you are invited to eat, and when you have had the meal, disperse. Do not linger in idle talk. That is hurtful to the Prophet but he does not express it out of shyness; but Allah is not ashamed of speaking out the Truth. And if you were to ask the wives of the Prophet for something, ask from behind a curtain. That is more apt for the cleanness of your hearts and theirs. It is not lawful for you to cause hurt to Allah's Messenger, nor to ever marry his wives after him. Surely that would be an enormous sin in Allah's sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not enter the houses of the Prophet for a meal without permission. if you are invited, you may enter, but be punctual (so that you will not be waiting while the meal is being prepared). When you have finished eating, leave his home. Do not sit around chatting among yourselves. This will annoy the Prophet but he will feel embarrassed to tell you. God does not feel embarrassed to tell you the truth. When you want to ask something from the wives of the Prophet, ask them from behind the curtain. This would be more proper for you and for them. You are not supposed to trouble the Prophet or to ever marry his wives after his death, for this would be a grave offense in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not enter the houses of the Prophet without permission, as when called for a meal but not to linger around waiting for it – and if you are invited then certainly present yourself and when you have eaten, disperse – not staying around delighting in conversation; indeed that was causing harassment to the Prophet, and he was having regard for you; and Allah does not shy in proclaiming the truth; and when you ask the wives of the Prophet for anything to use, ask for it from behind a curtain; this is purer for your hearts and for their hearts; and you have no right to trouble the Noble Messenger of Allah, nor ever marry any of his wives after him; indeed that is a very severe matter in the sight of Allah. (To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Enter not the Prophet's houses, unless permission is given to you for a meal, (and then) not (so early as) to wait for its preparation. But when you are invited, enter, and when you have taken your meal, disperse without sitting for a talk. Verily, such (behavior) annoys the Prophet, and he is shy of (asking) you (to go); but Allah is not shy of (telling you) the truth. And when you ask (his wives) for anything you want, ask them from behind a screen, that is purer for your hearts and for their hearts. And it is not (right) for you that you should annoy Allah's Messenger, nor that you should ever marry his wives after him (his death). Verily, with Allah that shall be an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not enter the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished-- but when you are invited, enter, and when you have taken the food, then disperse-- not seeking to listen to talk; surely this gives the Prophet trouble, but he forbears from you, and Allah does not forbear from the truth And when you ask of them any goods, ask of them from behind a curtain; this is purer for your hearts and (for) their hearts; and it does not behove you that you should give trouble to the Apostle of Allah, nor that you should marry his wives after him ever; surely this is grievous in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, enter not the houses of the Prophet, except leave is given you for a meal, without watching for its hour. But when you are invited, then enter; and when you have had the meal, disperse, neither lingering for idle talk; that is hurtful to the Prophet, and he is ashamed before you; but God is not ashamed before the truth. And when you ask his wives for any object, ask them from behind a curtain; that is cleaner for your hearts and theirs. It is not for you to hurt God's Messenger, neither to marry his wives after him, ever; surely that would be, in God's sight, a monstrous thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! Enter not the dwellings of the Prophet for a meal without waiting for the proper time, unless permission be granted you. But if ye are invited, enter, and, when your meal is ended, then disperse. Linger not for conversation. Lo! that would cause annoyance to the Prophet, and he would be shy of (asking) you (to go); but Allah is not shy of the truth. And when ye ask of them (the wives of the Prophet) anything, ask it of them from behind a curtain. That is purer for your hearts and for their hearts. And it is not for you to cause annoyance to the messenger of Allah, nor that ye should ever marry his wives after him. Lo! that in Allah's sight would be an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not enter the houses of the Prophet, unless you are invited for a meal. Do not linger until a meal is ready. When you are invited enter and when you have taken your meal, depart. Do not stay on, indulging in conversation. Doing that causes annoyance to the Prophet, though he is too reticent to tell you so, but God is not reticent with the truth. When you ask [the wives of the Prophet] for anything, ask them from behind a curtain. That will be purer for your hearts as well as their hearts. It is not right for you to cause annoyance to the Messenger of God or for you ever to marry his wives after him. Indeed that would be an enormity in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! enter not the houses of the Prophet, except when leave is given you, for a meal and at a time that ye will have to wait for its preparation; but when ye are invited, then enter, and when ye have eaten, then disperse, without lingering to enter into familiar discourse. Verily that incommodeth the Prophet, and he is shy of asking you to depart, bur Allah is not shy of the truth. And when ye ask of them aught, ask it of them from behind a curtain. That shall be purer for your hearts and for their hearts. And it is not lawful for you that ye should cause annoyance to the apostle of Allah, nor that ye should ever marry his wives after him; verily that in the sight of Allah shall be an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not enter the Prophet’s houses for a meal until you are granted permission, without hanging around for it to be readied. But enter when you are invited, and disperse when you have taken your meal, without cozying up for chats. Such conduct on your part offends the Prophet, and he is ashamed of [asking] you [to leave]; but Allah is not ashamed of [expressing] the truth. When you ask [his] womenfolk for something, do so from behind a curtain. That is more chaste for your hearts and theirs. You should not offend the Apostle of Allah, nor may you ever marry his wives after him. Indeed that would be a grave [sin] with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Enter not the Prophet's houses,- until leave is given you,- for a meal, (and then) not (so early as) to wait for its preparation: but when ye are invited, enter; and when ye have taken your meal, disperse, without seeking familiar talk. Such (behaviour) annoys the Prophet: he is ashamed to dismiss you, but Allah is not ashamed (to tell you) the truth. And when ye ask (his ladies) for anything ye want, ask them from before a screen: that makes for greater purity for your hearts and for theirs. Nor is it right for you that ye should annoy Allah's Messenger, or that ye should marry his widows after him at any time. Truly such a thing is in Allah's sight an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Enter not the Prophet's houses, except when leave is given to you for a meal, (and then) not (so early as) to wait for its preparation. But when you are invited, enter, and when you have taken your meal, disperse, without sitting for a talk. Verily, such (behaviour) annoys the Prophet, and he is shy of (asking) you (to go), but Allah is not shy of (telling you) the truth. And when you ask (his wives) for anything you want, ask them from behind a screen, that is purer for your hearts and for their hearts. And it is not (right) for you that you should annoy Allah's Messenger, nor that you should ever marry his wives after him (his death). Verily! With Allah that shall be an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not enter the houses of the Prophet for a meal without waiting for the proper time, unless you are given permission. But if you are invited, enter, and when you have eaten, disperse, not desiring conversation, for that is hurtful to the Prophet and he would be shy before you; but of the truth Allah is not shy. And when you ask his wives for anything, speak to them from behind a curtain, that is cleaner for your hearts and theirs. You must not hurt the Messenger of Allah, nor shall you ever wed his wives after him, surely, this would be a monstrous thing with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not enter the homes of the Prophet, unless you are given permission to come for a meal; and do not wait for its preparation. And when you are invited, go in. And when you have eaten, disperse, without lingering for conversation. This irritates the Prophet, and he shies away from you, but God does not shy away from the truth. And when you ask his wives for something, ask them from behind a screen; that is purer for your hearts and their hearts. You must never offend the Messenger of God, nor must you ever marry his wives after him, for that would be an enormity with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not enter the houses of the Prophet except when you are permitted for a meal, without awaiting its readiness. But when you are invited, then enter; and when you have eaten, disperse without seeking to remain for conversation. Indeed, that [behavior] was troubling the Prophet, and he is shy of [dismissing] you. But Allah is not shy of the truth. And when you ask [his wives] for something, ask them from behind a partition. That is purer for your hearts and their hearts. And it is not [conceivable or lawful] for you to harm the Messenger of Allah or to marry his wives after him, ever. Indeed, that would be in the sight of Allah an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:53] O you who believe, do not enter the Prophet’s houses unless permission is granted you, to enter by invitation, to [share] a meal, and so you enter, without waiting for the [right] moment, [for] when it is ready (ināhu, a verbal noun from anā, ya’nī). But when you are invited, enter, and, when you have had your meal, disperse, without, lingering for, any [leisurely] conversation, amongst yourselves. Indeed that, lingering, is upsetting for the Prophet, and he is [too] shy of you, to make you leave, but God is not shy of the truth, that you should leave — in other words, He would never refrain from declaring it (a variant reading [for yastahyī] has yastahī). And when you ask anything of [his] womenfolk, in other words, the wives of the Prophet (s), ask them from behind a screen, a curtain. That is purer for your hearts and their hearts, than [entertaining] sinful thoughts. And you should never cause the Messenger of God hurt, in any way; nor ever marry his wives after him. Assuredly that in God’s sight would be very grave, as a sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ وَاللَّهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا إِنَّ ذَلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا (53){ ياأيها الذين ءَامَنُواْ لاَ تَدْخُلُواْ بُيُوتَ النبى إِلاَّ أَن يُؤْذَنَ لَكُمْ إلى طَعَامٍ غَيْرَ ناظرين إناه وَلَكِنْ إِذَا دُعِيتُمْ فادخلوا فَإِذَا طَعِمْتُمْ فانتشروا وَلاَ مُسْتَئنِسِينَ لِحَدِيثٍ إنَّ ذَلِكَ كَانَ يُؤْذِى النَّبِىَّ فَيَسْتَحِى مِنكُمْ واللهُ لاَ يَسْتَحِى مِنَ الحَقِّ } .لما بين الله في الآيات السابقة آداب النبي صلى الله عليه وسلم مع أزواجه قفّاه في هذه الآية بآداب الأمة معهن ، وصدره بالإِشارة إلى قصة هي سبب نزول هذه الآية . وهي ما في «صحيح البخاري» وغيره عن أنس بن مالك قال : لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش صنع طعاماً بخبز ولحم ودعا القوم فطعِموا ثم جلسوا يتحدثون وإذا هو كأنه يتهيّأ للقيام فلم يقوموا ، فلما رأى ذلك قام فلما قام قام مَن قام وقعد ثلاثة نفر ، فجاء النبي ليدخل فإذا القوم جلوس ، فجعل النبي صلى الله عليه وسلم يخرج ثم يرجع فانطلق إلى حجرة عائشة . . . فتقَرَّى حُجَرَ نسائه كلهن يسلّم عليهن ويسلمن عليه ويدعون له ، ثم إنهم قاموا فانطلقتُ فجئت فأخبرتُ النبي صلى الله عليه وسلم أنهم قد انطلقوا فجاء حتى دخل فذهبتُ أدخل فألقى الحجاب بيني وبينه فأنزل الله : { يا أيها الذين آمنوا لا تدخلو بيوت النبي } إلى قوله : { من وراء حجاب } .وفي حديث آخر في الصحيح عن أنس أيضاً أن عمر بن الخطاب رضي الله عنه قال له : «يا رسول الله يدخل عليك البَّرُ والفاجر فلو أمرتَ أمهاتِ المؤمنين بالحجاب» فأنزل الله آية الحجاب . وليس بين الخبرين تعارض لجواز أن يكون قول عمر كان قبل البناء بزينب بقليل ثم عقبته قصة وليمة زينب فنزلت الآية بإثرها .وابتدىء شرع الحجاب بالنهي عن دخول بيوت النبي صلى الله عليه وسلم إلا لطعام دعاهم إليه ، لأن النبي عليه الصلاة والسلام له مجلس يجلس في المسجد فمن كان له مهمّ عنده يأتيه هنالك .وليس ذكر الدعوة إلى طعام تقييداً لإباحة دخول بيوت النبي صلى الله عليه وسلم لا يدخلها إلا المدعو إلى طعام ولكنه مثال للدعوة وتخصيص بالذكر كما جرى في القضية التي هي سبب النزول فيلحق به كل دعوة تكون من النبي صلى الله عليه وسلم وكل إذن منه بالدخول إلى بيته لغير قصد أن يطعم معه كما كان يقع ذلك كثيراً . ومن ذلك قصة أبي هريرة حين استقرأ من عمر آية من القرآن وهو يطمع أن يَدعوه عمر إلى الغدَاء ففتح عليه الآية ودخل فإذا رسول الله قائم على رأس أبي هريرة وقد عرف ما به فانطلق به إلى بيته وأمر له بعُسّ من لبن ثم ثاننٍ ثم ثالث ، وإنما ذكر الطعام إدماجاً لتبيين آدابه ، ولذلك ابتدىء بقوله : { غير ناظرين إناه } مع أنه لم يقع مثله في قصة سبب النزول .وقرأ الجمهور { بيوت } بكسر الباء . وقرأه أبو عمرو وورش عن نافع وحفص عن عاصم وأبو جعفر بضم الباء ، وقد تقدم في سورة النساء وغيرها .و { إناه } بكسر الهمزة وبالقصر : إما مصدر أَنَى الشيءُ إذا حان ، يقال : أنى يأنِي ، قال تعالى : { ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله } \\[ الحديد : 16 \\] . ومقلوبه : آن . وهو بمعناه . والمعنى : غير منتظرين حضور الطعام ، أي غير سابقين إلى البيوت وقبْل تهيئته .والاستثناء في { إلا أن يؤذن لكم } استثناء من عموم الأحوال التي يقتضيها الدخول المنهي عنه ، أي إلا حال أن يؤذن لكم .وضُمِّن { يؤذن } معنى تُدعون فعدي ب { إلى فكأنه قيل : إلا أن تُدعَوْا إلى طعام فيؤذن لكم لأن الطفيلي قد يؤذن له إذا استأذن وهو غير مدعو فهي حالة غير مقصودة من الكلام .فالكلام متضمن شرطين هما : الدعوة ، والإِذن ، فإن الدعوة قد تتقدم على الإذن وقد يقترنان كما في حديث أنس بن مالك .وغير ناظرين } حال من ضمير { لكم } فهو قيد في متعلق المستثنى فيكون قيداً في قيدٍ فصارت القيود المشروطة ثلاثة .و { ناظرين } اسم فاعل من نظَر بمعنى انتظر ، كقوله تعالى : { فهل ينتظرون إلا مثل أيام الذين خلوا من قبلهم } \\[ يونس : 102 \\] الآية .ومعنى ذلك : لا تحضروا البيوت للطعام قبل تهيئة الطعام للتناول فتقعدوا تنتظرون نُضجه . وعن ابن عباس نزلت في ناس من المؤمنين كانوا يتحينون طعام النبي فيدخلون قبل أن يُدرك الطعام فيقعدون إلى أن يُدرك ثم يأكلون ولا يخرجون ا ه . وقد يقتضي أن ذلك تكرر قبل قضية النَفر الذين حضروا وليمة البناء بزينب فتكون تلك القضية خاتمة القضايا ، فكُني بالانتظار عن مبادرة الحضور قبل إبان الأكل . ونكتة هذه الكناية تشويه السبق بالحضور بجعله نهماً وجشعاً وإن كانوا قد يحضرون لغير ذلك ، وبهذا تعلم أن ليس النهي متوجهاً إلى صريح الانتظار .وموقع الاستدراك لرفع توهم أن التأخر عن إبان الطعام أفضل فأرشد الناس إلى أن تأخر الحضور عن إبان الطعام لا ينبغي بل التأخر ليس من الأدب لأنه يجعل صاحب الطعام في انتظار ، وكذلك البقاء بعد انقضاء الطعام فإنه تجاوز لحد الدعوة لأن الدعوة لحضور شيء تقتضي مفارقة المكان عند انتهائه لأن تقيد الدعوة بالغرض المخصوص يتضمن تحديدها بانتهاء ما دُعي لأجله ، وكذلك الشأن في كل دخول لغرض من مشاورة أو محادثة أو سمَر أو نحو ذلك ، وكل ذلك يتحدد بالعرف وما لا يَثقل على صاحب المحل ، فإن كان محل لا يختص به أحد كدار الشورى والنادي فلا تحديد فيه .و { طعمتم } معناه أكلتم ، يقال : طعم فلان فهو طاعم ، إذا أكل .والانتشار : افتعال من النشر ، وهو إبداء ما كان مطوياً ، أطلق على الخروج مجازاً وتقدم في قوله :{ وجعل النهار نُشوراً } في سورة الفرقان ( 47 ) .والواو في ولا مستأنسين } عطف على { ناظرين } وما بينهما من الاستدراك وما تفرع عليه اعتراض بين المتعاطفين . وزيادة حرف النفي قبل { مستأنسين } لتأكيد النفي كما هو الغالب في العطف على المنفي وفي تصدير المنفي نحو قوله : { فلا وربك يؤمنون } الآية \\[ النساء : 65 \\] وقوله : { لا يسخر قوم من قوم } \\[ الحجرات : 11 \\] ثم قوله : { ولا نساء من نساء } \\[ الحجرات : 11 \\] .والاستئناس : طلب الأنس مع الغير . واللام في { لحديث } للعلة ، أي ولا مستأنسين لأجل حديث يجري بينكم .والحديث : الخبر عن أمر حدث ، فهو في الأصل صفة حُذف موصوفها ثم غلبت على معنى الموصوف فصار بمعنى الإِخبار عن أمر حدث ، وتُوسّع فيه فصار الإِخبار عن شيء ولو كان أمراً قد مضى . ومنه سمي ما يروى عن النبي صلى الله عليه وسلم حديثاً كما يسمى خبراً ، ثم توسع فيه فصار يطلق على كل كلام يجري بين الجلساء في جد أو فكاهة ، ومنه قولهم : حديثُ خرافة ، وقول كثير :أخذنا باكتراث الأحاديث تبييناً ... . . . . البيتواستئناس الحديث : تسمُّعه والعناية بالإِصغاء إليه ، قال النابغة :كأن رحلي وقد زال النهار بنا ... يوم الجليل على مُستأنس وَحَدِأي كأني راكب ثوراً وحشياً منفرداً تسمَّع صوت الصائد فأسرع الهروب .وإضافة { بيوت النبي } على معنى لام الملك لأن تلك البيوت ملك له ملكها بالعطية من الذين كانت ساحة المسجد ملكاً لهم من الأنصار ، وبالفيء لقبور المشركين التي كانت ثمة ، فإن المدينة فتحت بكلمة الإِسلام فأصبحت داراً للمسلمين . ومصير تلك البيوت بعد وفاة النبي صلى الله عليه وسلم مصير تركته كلها فإنه لا يورث وما تركه ينتفع منه أزواجه وآله بكفايتهم حياتهم ثم يرجع ذلك للمسلمين كما قضى به عمر بين علي والعباس فيما كان للنبيء صلى الله عليه وسلم من فَدَك ونخللِ بني النضير ، فكان لأزواج النبي صلى الله عليه وسلم حق السكنى في بيوتهن بعده حتى توفّاهن الله من عند آخرتهن ، فلذلك أدخلها الخلفاء في المسجد حين توسعته في زمن الوليد بن عبد الملك وأمير المدينة يومئذٍ عمر بن عبد العزيز . ولم ينكر ذلك أحد من الصحابة ولم يُعطَ ورثتُهن شيئاً ولا سألوه . وإضافتها إلى ضميرهن في قوله : { ما يتلى في بيوتكن } \\[ الأحزاب : 34 \\] على معنى لام الاختصاص لا لام الملك .قال حماد بن زيد وإسماعيل بن أبي حكيم : هذه الآية أدبٌ أدَّبَ اللَّهُ به الثقلاء ، وقال ابنُ أبي عائشة : حسبك من الثقلاء أن الشرع لم يحتملهم .ومعنى الثقل فيه هو إدخال أحَدٍ القلقَ والغمّ على غيره من جراء عمل لفائدة العامل أو لعدم الشعور بما يلحق غيره من الحرج من جراء ذلك العمل . وهو من مساوىء الخلق لأنه إن كان عن عمد كان ضراً بالناس وهو منهي عنه لأنه من الأذى وهو ذريعة للتباغض عند نفاد صبر المضرور ، فإن النفوس متفاوتة في مقدار تحمل الأذى ، ولأن المؤمن يحب لأخيه ما يحب لنفسه فعليه إذا أحس بأن قوله أو فعله يُخدل الغم على غيره أن يكف عن ذلك ولو كان يجتني منه منفعة لنفسه إذ لا يُضر بأحد لينتفع غيره إلا أن يكون لمن يأتي بالعمل حق على الآخر فإن له طلبه مع أنه مأمور بحسن التقاضي ، وإن كان إدخاله الغم على غيره عن غباوة وقلة تفطن له فإنه مذموم في ذاته وهو يصل إلى حدّ يكون الشعور به بديهياً .وللحكماء والشعراء أقوال كثيرة في الثقلاء طفحت بها كتب أدب الأخلاق .ومعاملة الناس النبي صلى الله عليه وسلم بهذا الخلق أشد بعداً عن الأدب لأن للنبيء صلى الله عليه وسلم أوقاتاً لا تخلو ساعة منها عن الاشتغال بصلاح الأمة ويجب أن لا يَشغل أحد أوقاتَه إلا بإذنه ، ولذلك قال تعالى : { إلا أن يؤذن لكم } .والأمر في قوله : { فادخلوا } للندب لأن إجابة الدعوة إلى الوليمة سنة ، وتقييد النهي بقوله : { غير ناظرين إناه } للتنزيه لأن الحضور قبل تهيّؤ الطعام غير مقتضى للدعوة ولا يتضمنه الإِذن فهو تطفل .والأمر في قوله : { فانتشروا } للوجوب لأن دخول المنزل بغير إذن حرام ، وإنما جاز بمقتضى الدعوة للأكل فهو إذن مقيد المعنى بالغرض المأذوننِ لأجله فإذا انقضى السبب المبيح للدخول عاد تحريم الدخول إلى أصله؛ إلا أنه نظري قد يُغفل عنه لأن أصله مأذون فيه والمأذون فيه شرعاً لا يتقيّد بالسلامة إلا إذا تجاوز الحد المعروف تجاوزاً بيناً . وعطف { ولا مستأنسين لحديث } راجع إلى هذا الأمر بقوله : { فانتشروا } فلذلك ذكر عقبه فإن استدامة المكث في معنى الدخول ، فذكر بإثره وحصل تفنن في الكلام .وفي هذه الآية دليل على أن طعام الوليمة وطعام الضيافة ملك للمتضيف وليس ملكاً للمدعوين ولا للأضياف لأنهم إنما أذن لهم في الأكل منه خاصة ولم يملكوه فلذلك لا يجوز لأحد رفع شيء من ذلك الطعام معه .وجملة { إن ذلكم كان يؤذي النبي فيستحيي منكم } استئناف ابتدائي للتحذير ودفع الاغترار بسكوت النبي صلى الله عليه وسلم أن يحسبوه رضي بما فعلوا . فمناط التحذير قوله : { ذلكم كان يؤذي النبي } فإن أذى النبي صلى الله عليه وسلم مقرر في نفوسهم أنه عمل مذموم لأن النبي عليه الصلاة والسلام أعز خلق في نفوس المؤمنين وذلك يقتضي التحرز مما يؤذيه أدنى أذى . ومناط دفع الاغترار قوله : { فيستحيي منكم } فإن السكوت قد يظنه الناس رضى وإذناً وربما تطرق إلى أذهان بعضهم أن جلوسهم لو كان محظوراً لما سكت عليه النبي صلى الله عليه وسلم فأرشدهم الله إلى أن السكوت الناشىء عن سبببٍ هو سكوت لا دلالة له على الرضى وأنه إنما سكت حياء من مباشرتهم بالإخراج فهو استحياء خاص من عمل خاص .وإنما كان ذلك مؤذياً النبي صلى الله عليه وسلم لأن فيه ما يحول بينه وبين التفرغ لشؤون النبوءة من تلقي الوحي أو العبادة أو تدبير أمر الأمة أو التأخر عن الجلوس في مجلسه لنفع المسلمين ولشؤون ذاته وبيته وأهله . واقتران الخبر بحرف { إنّ } للاهتمام به . ولك أن تجعله من تنزيل غير المُتردد منزلة المتردد لأن حال النفَر الذين أطالوا الجلوس والحديث في بيت النبي عليه الصلاة والسلام وعدم شعورهم بكراهيته ذلك منهم حين دخل البيت فلما وجدهم خرج ، فغفلوا عما في خروج النبي صلى الله عليه وسلم من البيت من إشارة إلى كراهيتِهِ بقاءَهم ، تلك حالة من يظن ذلك مأذوناً فيه فخوطبوا بهذا الخطاب تشديداً في التحذير واستفاقة من التغرير .وإقحام فعل { كان } لإِفادة تحقيق الخبر .وصيغ { يؤذي } بصيغة المضارع دون اسم الفاعل لقصد إفادة أذى متكرر ، والتكرير كناية عن الشدة .والأذى : ما يكدر مفعوله ويسيء من قول أو فعل . وتقدم في قوله تعالى : { لن يضروكم إلا أذى } في آل عمران ( 111 ) ، وهو مراتب متفاوتة في أنواعه .والتفريع في قوله : { فيستحيي منكم } تفريع على مقدر دلت عليه القصة . والتقدير : فيهمّ بإخراجكم فيستحيي منكم إذ ليس الاستحياء مفرعاً على الإِيذاء ولا هو من لوازمه .ودخول { مِن } المتعلقة ب { يستحيي } على ضمير المخاطبين على تقدير مضاف ، أي يستحيي من إعلامكم بأنه يؤذيه .وتعدية المشتقات من مادة الحياء إلى الذوات شائع يساوي الحقيقة لأن الاستحياء يختلف باختلاف الذوات ، فقولك : أردت أن أفعل كذا فاستحيت من فلان ، يجوز أن تكون الحقيقة هي التعليق بذات فلان وأن تكون هي التعليق بالأحوال الملابسة له التي هي سبب الاستحياء لأجل ملابستها له . ولك أن تقول : استحييت من أن أفعل كذا بمرأى من فلان . وعلى التقدير الأول تكون { مِن } للتعليل ، وعلى التقدير الثاني تكون { مِن } للابتداء . وظاهر كلام «الكشاف» يقتضي أن : استحييت من فلان مجاز أو توسع ، وأن : استحييت من فعل كذا لأجل فلان هو الحقيقة . وظاهر كلام صاحب «الكشاف» عكس ذلك والأمر هيّن .وصيغ فعل { يستحيي } بصيغة المضارع لأنه مفرع على { يؤذي النبي } ليدل على ما دل عليه المفرع هو عليه .وفي هذه الآية دليل على أن سكوت النبي صلى الله عليه وسلم على الفعل الواقع بحضرته إذا كان تعدياً على حق لذاته لا يدل سكوته فيه على جواز الفعل لأن له أن يسامح في حقه ، ولكن يؤخذ الحظر أو الإِباحة في مثله من أدلة أخرى مثل قوله تعالى هنا : { إن ذلكم كان يؤذي النبي } ولذلك جزم علماؤنا بأن من آذى النبي صلى الله عليه وسلم بالصراحة أو الالتزام يعزر على ذلك بحسب مرتبة الأذى والقصدِ إليه بعد توقيفه على الخفي منه وعدم التوبة مما تقبل في مثله التوبة منه .ولم يجعلوا في إعراض النبي عليه الصلاة والسلام عن مؤاخذة من آذاه في حياته دليلاً على مشروعية تسامح الأمة في ذلك لأنه كان له أن يعفو عن حقه لقوله تعالى : { فاعف عنهم } \\[ المائدة : 13 \\] وقوله : { ولو كنت فظاً غليظ القلب لانفضوا من حولك } \\[ آل عمران : 159 \\] . فهذا ملاك الجمع بين الإِيذاء والاستحياءِ والحقّ في هذه الآية ، فقد تولى الله تعالى الذبّ عن حق رسوله وكفاه مؤونة المضض الداعي إليه حياؤه . وقد حقق هذا المعنى وما يحف به القاضي أبو الفضل عياض في تضاعيف القسم الرابع من كتابه «الشفاء» .فإن قلت : ورد في الحديث عن أنس أن النبي صلى الله عليه وسلم خرج من البيت ليقومَ الثلاثةُ الذين قعَدُوا يتحدثون ، فلماذا لم يأمرهم بالخروج بدلاً من خروجه هو . قلت : لأن خروجه غيرُ صريح في كراهية جلوسهم لأنه يحتمل أن يكون لغرض آخر ، ويحتمل أن يكون لقصد انفضاض المجلس فكان من واجب الألمعية أن يخطر ببالهم أحد الاحتمالين فيتحفزوا للخروج فليس خروجه عنهم بمناف لوصف حيائه صلى الله عليه وسلموجملة { والله لا يستحيي من الحق } معطوفة على جملة { فيستحيي منكم } والمعنى : أن ذلك سوء أدب مع النبي صلى الله عليه وسلم فإذا كان يستحيي منكم فلا يباشركم بالإِنكار ترجيحاً منه للعفو عن حقه على المؤاخذة به فإن الله لا يستحيي من الحق لأن أسباب الحياء بين الخلق منتفية عن الخالق سبحانه : { والله يقول الحق وهو يهدي السبيل } \\[ الأحزاب : 4 \\] .وصيغت الجملة المعطوفة على بناء الجملة الاسمية مخالِفةً للمعطوفة هي عليها فلم يقل : ولا يستحيي الله من الحق ، للدلالة على أن هذا الوصف ثابت دائم لله تعالى لأن الحق من صفاته ، فانتفاء ما يمنع تبليغه هو أيضاً من صفاته لأن كل صفة يجب اتصاف الله بها فإن ضدها يستحيل عليه تعالى .والتعريف في { الحق } تعريف الجنس المراد منه الاستغراق مثل التعريف في { الحمد لله } \\[ الفاتحة : 2 \\] . والمعنى : والله لا يستحيي من جميع أفراد جنس الحق .و { الحق } : ضد الباطل . فمنه حق الله وحق الإِسلام ، وحق الأمة جمعاء في مصالحها وإقامة آدابها ، وحق كل فرد من أفراد الأمة فيما هو من منافعه ودفع الضر عنه .ويشتمل حقَ النبي صلى الله عليه وسلم في بيته وأوقاته ، وبهذا العموم في الحق صارت الجملة بمنزلة التذييل .و { مِن } في قوله : { من الحق } ليست مثل { من } التي في قوله : { فيستحيي منكم } لأن { مِن هذه متعينة لكونها للتعليل إذ الحق لا يُستحيَى من ذاته فمعنى إن الله لا يستحيي من الحق أنه لا يستحيي لبيانه وإعلانه .وقد أفاد قوله : والله لا يستحيي من الحق } أن من واجبات دِين الله على الأمة أن لا يستحيي أحد من الحق الإِسلامي في إقامته ، وفي معرفته إذا حل به ما يقتضي معرفته ، وفي إبلاغه وهو تعليمه ، وفي الأخذ به ، إلا فيما يرجع إلى الحقوق الخاصة التي يرغب أصحابها في إسقاطها أو التسامح فيها مما لا يغمص حقاً راجعاً إلى غيره لأن الناس مأمورون بالتخلق بصفات الله تعالى اللائقة بأمثالهم بقدر الإِمكان .وهذا المعنى فهمته أمُّ سُليم وأقرها النبي صلى الله عليه وسلم على فهمها ، فقد جاء في الحديث الصحيح : \" عن أم سَلَمة قالت : جاءت أم سُليم إلى النبي فقالت : يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة من غسل إذا احتلمت؟ فقال رسول الله : نعم إذا رأت الماء \" . فهي لم تستح في السؤال عن الحق المتعلق بها ، والنبي صلى الله عليه وسلم لم يستححِ في إخبارها بذلك . ولعلها لم تجد من يسأل لها أو لم تر لزاماً أن تستنيب عنها من يسأل لها عن حكم يخص ذاتها . وقد رأى علي بن أبي طالب الجمع بين طلب الحق وبين الاستحياء ، ففي «الموطأ» عن المقداد بن الأسود أن علي بن أبي طالب أمره أن يسأل له رسول الله صلى الله عليه وسلم عن الرجل إذا دنا من أهله فخرج منه المذي ماذا عليه؟ قال علي : فإن عندي ابنة رسول الله وأنا أستحيي أن أسأله» الحديث .على أن بين قضية أم سُليم وقضية علي تفاوتاً من جهات في مقتضى الاستحياء لا تخفى على المتبصر .واعلمْ أن في ورود { يؤذي } هنا ما يبطل المثال الذي أورده ابن الأثير في كتاب «المثل السائر» شاهداً على أن الكلمة قد تروق السامعَ في كلام ثم تكون هي بعينها مكروهة للسامع . وجاء بكلمة { يؤذي } في هذه الآية ، ونظيرها ( تؤذي ) في قول المتنبي :تَلذ له المروءة وهي تُوذي ... وزعم أن وجودها في البيت يحط من قدر المعنى الشريف الذي تضمنه البيت وأحال في الجزم بذلك على الطبع السليم ، ولا أحسب هذا الحكم إلا غضباً من ابن الأثير لا تُسوِّغه صناعة ولا يشهد به ذوق ، ولقد صرف أيمة الأدب همهم إلى بحث شعر المتنبي ونقده فلم يَعُدَّ عليه أحد منهم هذا منتقَداً ، مع اعتراف ابن الأثير بأن معنى البيت شريف فلم يبق له إلا أن يزعم أن كراهة هذا اللفظ فيه راجعة إلى أمر لفظي من الفصاحة ، وليس في البيت شيء من الإِخلال بالفصاحة وكأنه أراد أن يقفي على قدم الشيخ عبد القاهر فيما ذكر في الفصل الذي جعله ثانياً من كتاب «دلائل الإعجاز» فإن ما انتقده الشيخ في ذلك الفصل من مواقع بعض الكلمات لا يخلو من رجوع نقده إياها إلى أصول الفصاحة أو أصول تناسب معاني الكلمات بعضها مع بعض في نظم الكلام ، وشتان ما بين الصنيعين .{ وَإِذَا سَأَلْتُمُوهُنَّ متاعا فاسالوهن مِن وَرَآءِ حِجَابٍ ذلكم أَطْهَرُ لقُلُوبِكُمْ وقُلُوبِهِنَّ } .عطف على جملة { لا تدخلوا بيوت النبي } فهي زيادة بيان للنهي عن دخول البيوت النبوية وتحديد لمقدار الضرورة التي تدعو إلى دخولها أو الوقوف بأبوابها .وهذه الآية هي شارعة حكم حجاب أمهات المؤمنين ، وقد قيل : إنها نزلت في ذي القعدة سنة خمس .وضمير { سألتموهن } عائد إلى الأزواج المفهوم من ذِكر البيوت في قوله : { بيوت النبي } فإن للبيوت ربَّاتهن وزوجُ الرجل هي ربة البيت ، قال مرة بن مَحْكَان التميمي :يا ربةَ البيت قُومي غيرَ صاغرة ... ضمّي إليك رجال الحي والغُرباوقد كانوا لا يبني الرجل بيتاً إلا إذا أراد التزوج . وفي حديث ابن عمر : كنت عزباً أبيت في المسجد . ومن أجل ذلك سَموا الزفاف بناء . فلا جرم كانت المرأة والبيت متلازمين فدَلت البيوت على الأزواج بالالتزام . ونظير هذا قوله تعالى : { وفرش مرفوعة إنا أنشأناهن إنشاء فجعلناهن أبكاراً عرباً أتراباً لأصحاب اليمين } \\[ الواقعة : 34 38 \\] فإن ذكر الفرش يستلزم أن للفراش امرأة ، فلما ذكر البيوت هنا تبادر أن للبيوت رباتتٍ .والمتاع : ما يحتاج إلى الانتفاع به مثل عارية الأواني ونحوها ، ومثل سؤال العفاة ويلحق بذلك ما هو أولى بالحكم من سؤاللٍ عن الدِّين أو عن القرآن ، وقد كانوا يسألون عائشة عن مسائل الدين .والحجاب : السَّتْر المُرخَى على باب البيت .وكانت الستور مرخاة على أبواب بيوت النبي صلى الله عليه وسلم الشارعة إلى المسجد . وقد ورد ما يبين ذلك في حديث الوفاة حين خرج النبي صلى الله عليه وسلم على الناس وهم في الصلاة فكشف الستر ثم أرخى الستر .و { من وراء حجاب } متعلق ب { فاسألوهن } فهو قيد في السائل والمسؤول المتعلق ضميراهما بالفعل الذي تعلق به المجرور . و { من } ابتدائية . والوراء : مكان الخلف وهو مكان نسبي باعتبار المتجه إلى جهة ، فوراء الحجاب بالنسبة للمتجهين إليه فالمسؤولة مستقبلة حجابها والسائل من وراء حجابها وبالعكس .والإِشارة ب { ذلكم } إلى المذكور ، أي السؤال المقيد بكونه من وراء حجاب .واسم التفضيل في قوله : { أطهر } مستعمل للزيادة دون التفضيل .والمعنى : ذلك أقوى طهارة لقلوبكم وقلوبهن فإن قلوب الفريقين طاهرة بالتقوى وتعظيم حرمات الله وحرمة النبي صلى الله عليه وسلم ولكن لما كانت التقوى لا تصل بهم إلى درجة العصمة أراد الله أن يزيدهم منها بما يكسب المؤمنين مراتب من الحفظ الإِلهي من الخواطر الشيطانية بقطع أضعف أسبابها وما يقرب أمهات المؤمنين من مرتبة العصمة الثابتة لزوجهن صلى الله عليه وسلم فإن الطيبات للطيبين بقطع الخواطر الشيطانية عنهن بقطع دابرها ولو بالفرض .وأيضاً فإن للناس أوهاماً وظنوناً سُوأَى تتفاوت مراتب نفوس الناس فيها صرامة ووهناً ، ونَفَاقاً وضعفاً ، كما وقع في قضية الإِفك المتقدمة في سورة النور فكان شَرع حجاب أمهات المؤمنين قاطعاً لكل تقول وإرجاف بعمد أو بغير عمد .ووراء هذه الحِكَم كلها حكمة أخرى سامية وهي زيادة تقرير معنى أمومتهن للمؤمنين في قلوب المؤمنين التي هي أُمومة جَعلية شرعية بحيث إن ذلك المعنى الجعلي الروحي وهو كونهن أمهات يرتد وينعكس إلى باطن النفس وتنقطع عنه الصور الذاتية وهي كونهن فلانة أو فلانة فيصبحْن غير متصوَّرات إلا بعنوان الأمومة فلا يزال ذلك المعنى الروحي ينمى في النفوس ، ولا تزال الصور الحسية تتضاءل من القوة المدركة حتى يصبح معنى أمهات المؤمنين معنى قريباً في النفوس من حقائق المجردات كالملائكة ، وهذه حكمة من حكم الحجاب الذي سنه الناس لملوكهم في القدم ليكون ذلك أدخل لطاعتهم في نفوس الرعية .وبهذه الآية مع الآية التي تقدمتها من قوله : { يا نساء النبي لستن كأحد من النساء } \\[ الأحزاب : 32 \\] تحقق معنى الحجاب لأمهات المؤمنين المركبُ من ملازمتهن بيوتهن وعدممِ ظهور شيء من ذواتهن حتى الوجه والكفين ، وهو حجاب خاص بهن لا يجب على غيرهن ، وكان المسلمون يقتدون بأمهات المؤمنين ورعاً وهم متفاوتون في ذلك على حسب العادات ، ولما أنشد النميري عند الحجاج قوله :يُخمرن أطرافَ البنان من التقى ... ويَخرجن جَنح الليللِ مُعْتَجِراتقال الحجاج : وهكذا المرأة الحرة المسلمة .ودل قوله : { لقلوبكم وقلوبهن } أن الأمر متوجه لرجال الأمة ولنساء النبي صلى الله عليه وسلم على السواء . وقد أُلحق بأزواج النبي عليه السلام بنته فاطمة فلذلك لما خرجوا بجَنازتها جعلوا عليها قبة حتى دُفنت ، وكذلك جعلت قبة على زينبَ بنت جَحش في خلافة عمر بن الخطاب .{ وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ الله وَلاَ أَن تنكحوا أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً إِنَّ ذلكم كَانَ عِندَ الله عَظِيمًا } .لما جيء في بيان النهي عن المكث في بيوت النبي صلى الله عليه وسلم بأنه يؤذيه أُتبع بالنهي عن أذى النبي صلى الله عليه وسلم نهياً عاماً ، فالخطاب في { لكم } للمؤمنين المفتتح بخطابهم آية : { يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم } الآية .والواو عاطفة جملة على جملة أو هي واو الاعتراض بين جملة { وإذا سألتموهن متاعاً } وجملة { لا جناح عليهن في آبائهن } \\[ الأحزاب : 55 \\] .ودلت جملة { ما كان لكم } على الحظر المؤكد لأن { ما كان لكم } نفيٌ للاستحقاق الذي دلت عليه اللام ، وإقحام فعل { كان } لتأكيد انتفاء الإِذن . وهذه الصيغة من صيغ شدة التحريم .وتضمنت هذه الآية حكمين :أحدهما : تحريم أن يؤذوا رسول الله صلى الله عليه وسلم والأذى : قول يقال له ، أو فعل يُعامل به ، من شأنه أن يغضبه أو يسوءه لذاته .والأذى تقدم في أول هذه الآيات آنفاً . والمعنى : أن أذى النبي عليه الصلاة والسلام محظور على المؤمنين . وانظر الباب الثالث من القسم الثاني من كتاب «الشفاء» لعياض .والحكم الثاني : تحريم أزواج رسول الله صلى الله عليه وسلم على الناس بقوله تعالى : { ولا أن تنكحوا أزواجه من بعده أبداً } وهو تقرير لحكم أُمومة أزواجه للمؤمنين السالف في قوله : { وأزواجه أمهاتهم } \\[ الأحزاب : 6 \\] .وقد حُكيت أقوال في سبب نزول هذه الآية : منها أن رجلاً قال : لو مات محمد تزوجتُ عائشة ، أي قاله بمسمع ممن نقلَه عنه فقيل : هذا الرجل من المنافقين وهذا هو المظنون بقائل ذلك . وقيل : هو من المؤمنين ، أي خطر له ذلك في نفسه ، قاله القرطبي . وذكروا رواية عن ابن عباس وعن مقاتل أنه طلحة بن عبيْد الله . وقال ابن عباس : كانت هفوة منه وتاب وكفَّر بالحج ماشياً وبإِعتاق رقاب كثيرة وحمل في سبيل الله على عشرة أفراس أو أبعرة . وقال ابن عطية : هذا عندي لا يصح على طلحة والله عاصمه من ذلك ، أي إنْ حمل على ظاهر صدور القول منه فأما إن كان خطر له ذلك في نفسه فذلك خاطر شيطاني أراد تطهير قلبه فيه بالكفارات التي أعطاها إن صح ذلك . وأقول : لا شك أنه من موضوعات الذين يطعنون في طلحة بن عبيد الله . وهذه الأخبار واهية الأسانيد ودلائل الوضع واضحة فإن طلحة إن كان قال ذلك بلسانه لم يكن ليخفى على الناس فكيف يتفرد بروايته من انفرد . وإن كان خطر ذلك في نفسه ولم يتكلم به فمن ذا الذي اطَّلع على ما في قلبه ، وليس بمتعين أن يكون لنزول هذه الآية سبب . فإن كان لها سبب فلا شك أنه قول بعض المنافقين لما يؤذن به قوله تعالى عَقب هذه الآيات { لئن لم ينته المنافقون والذين في قلوبهم مرض } \\[ الأحزاب : 60 \\] الآية . وإنما شرعت الآية أن حكم أمومة أزواج النبي صلى الله عليه وسلم للمؤمنين حكم دائم في حياة النبي عليه الصلاة والسلام أو من بعده ولذلك اقتصر هنا على التصريح بأنه حكم ثابت من بعد ، لأن ثبوت ذلك في حياته قد عُلم من قوله : { وأزواجه أمهاتهم } \\[ الأحزاب : 6 \\] .وإضافة البعدية إلى ضمير ذات النبي عليه الصلاة والسلام تُعيِّن أن المراد بعد حياته كما هو الشائع في استعمال مثل هذه الإِضافة فليس المراد بعد عصمته من نحو الطَلاق لأن طلاق النبي صلى الله عليه وسلم أزواجه غير محتمل شرعاً لقوله : { ولا أن تبدل بهن من أزواج } \\[ الأحزاب : 52 \\] .وأكد ظرف ( بعدُ ) بإدخال { من الزائدة عليه ، ثم أكد عمومه بظرف { أبداً } ليُعلم أن ذلك لا يتطرقه النسخ ثم زيد ذلك تأكيداً وتحذيراً بقوله : { إن ذلكم كان عند الله عظيماً } ، فهو استئناف مؤكد لمضمون جملة { وما كان لكم أن تؤذوا رسول الله } . والإِشارة إلى ما ذكر من إيذاء النبي صلى الله عليه وسلم وتزوج أزواجه ، أي ذلكم المذكورُ .والعظيم هنا في الإثم والجريمة بقرينة المقام .وتقييد العظيم بكونه عند الله للتهويل والتخويف لأنه عظيم في الشناعة .وعلة كون تزوج أحد المسلمين إحدى نساء النبي صلى الله عليه وسلم إثماً عظيماً عند الله ، أن الله جعل نساء النبي عليه الصلاة والسلام أمهات للمؤمنين فاقتضى ذلك أن تزوج أحد المسلمين إحداهن له حكم تزوج المرء أمَّه ، وذلك إثم عظيم .واعلم أنه لم يتبين هل التحريم الذي في الآية يختص بالنساء اللاتي بنى بهن رسول الله صلى الله عليه وسلم أو هو يعم كل امرأة عقد عليها مثل الكندية التي استعاذت منه فقال لها : الحقي بأهلك ، فتزوجها الأشعث بن قيس في زمن عمر بن الخطاب . ومثل قتيلة بنت قيس الكلبية التي زوّجها أخوها الأشعث بن قيس من رسول الله صلى الله عليه وسلم ثم حملها معه إلى حضرموت فتوفي رسول الله قبل قفولهما فتزوجها عكرمة بن أبي جهل وأن أبا بكر همّ بعقابه فقال له عمر : إن رسول الله لم يدخل بها .والمرويات في هذا الباب ضعيفة . والذي عندي أن البناء والعقد كانا يكونان مقترنيْن وأن ما يسبق البناء مما يسمونه تزويجاً فإنما هو مراكنة ووعد ، ويدل لذلك ما في الصحيح أن رسول الله لما أحضرت إليه الكندية ودخل عليها رسول الله فقال لها : هبي لي نفسك ( أي ليعلم أنها رضيت بما عقد لها وليها ) فقالت : ما كان لملكة أن تهب نفسها لسوقة أعوذ بالله منك . فقال لها : لقد استعذت بمعاذ . فذلك ليس بطلاق ولكنه رجوع عن التزوج بها دال على أن العقد لم يقع وأن قول عمر لأبي بكر أو قول من قال لعمر : إن رسول الله لم يدخل بها هو كناية عن العقد .وعن الشافعي تحريم تزوج من عقد عليها النبي صلى الله عليه وسلم ورجع إمام الحرمين والرافعي أن التحريم قاصر على التي دخل بها . على أنه يظهر أن الإضافة في قوله : { أزواجه } بمعنى لام العهد ، أي الأزواج اللائي جاءت في شأنهن هذه الآيات من قوله : { لا يحل لك النساء من بعد } \\[ الأحزاب : 52 \\] فهن اللاءِ ثبت لهن حكم الأمهات .وبعد فإن البحث في هذه المسألة مجرد تفقه لا يبنى عليه عمل .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! Enter not the dwellings of the Prophet for a meal) this verse was revealed concerning a group of believers who used to enter the rooms of the Prophet (pbuh) in the morning and evening and wait for the food to be served. They used to eat and speak with the wives of the Prophet (pbuh). The Prophet (pbuh) did not like this but felt shy of these believers and could not tell them to stop coming to his rooms without permission, or ask them to leave once they were inside. But Allah forbade them from this, saying: believers, do not enter the rooms of the Prophet (pbuh) without permission from the Prophet to come and eat (without waiting for the proper time) for the food to be ready, (unless permission be granted you) to come in. (But if ye are invited, enter, and, when, your meal is ended) when you have finished eating, (then disperse) then leave. (Linger not for conversation) with the wives of the Prophet (pbuh). (Lo! That) coming in, sitting down and having conversation with the wives of the Prophet (pbuh) (would cause annoyance to the Prophet) Allah bless him and give him peace, (and he would be shy of (asking) you (to go)) or not to come in the first place; (but Allah is not shy of the Truth) Allah is not shy to command you to leave and not go in his rooms without his permission. (And when ye ask of them (the wives of the Prophet) anything) and when you speak with them, (ask it of them) speak with them (from behind a curtain. That is purer for your hearts and for their hearts) i.e. from doubts. (And it is not for you to cause annoyance to the Messenger of Allah) by entering his rooms without his permission and conversing with his wives, (nor that ye should ever marry his wives after him) after his death. This verse was revealed about Talhah Ibn 'Ubaydullah who had in mind to marry 'A'ishah after the death of the Prophet (pbuh). (Lo! That) your open declaration and intention to marry the Prophet's wives after his death (in Allah's sight would be an enormity) it is an enormous sin which merits severe punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ } معناه إدراكُهُ وبِلوغُهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {To food not watching} means His knowledge and reach.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أشار سبحانه إلى آداب المؤمنين مع النبي صلى الله عليه وسلم في استئذانهم منه\n ودخولهم عليه وتناولهم الطعام عنده وبين يديه\n وتكلمهم مع أزواجه صلى الله عليه وسلم\n إلى غير ذلك من الأدب\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله ورسوله\n مقتضى إيمانكم رعاية الأدب مع رسولكم صلى الله عليه وسلم\n سيما من قبل بيوته ومحارمه ومساكنه { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ } بغتةً بلا استئذانٍ منكم\n بل بيوت سائر المسلمين أيضاً { إِلاَّ أَن يُؤْذَنَ لَكُمْ } دعوةً { إِلَىٰ طَعَامٍ } حاضر عنده حال كونكم { غَيْرَ نَاظِرِينَ إِنَاهُ } أي: منتظرين لوقته { وَ } عليكم ألاَّ تدخلوا بلا دعوةٍ { لَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ } واطعموا { فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } واخرجوا على الفور وتفرقوا\n\n\n{ وَلاَ } تتمكنوا بعد الطعام عنده { مُسْتَأْنِسِينَ لِحَدِيثٍ } يتحدث بعضهم مع بعض\n أو تسمعونه منه صلى الله عليه وسلم أو من أهل بيته\n أو لمهمٍ آخر من مهماتكم { إِنَّ ذَٰلِكُمْ } أي: اللبث على أيّ وجه { كَانَ يُؤْذِي ٱلنَّبِيَّ فَيَسْتَحْيِي } صلى الله عليه وسلم { مِنكُمْ } أن يخرجكم حسب مقتضى حميته البشرية\n لأنه صلى الله عليه سولم حييّ حليم\n يصبر على أذاكم ولا يخرجكم عنوة { وَٱللَّهُ } المصلح لأحوال عباده\n المنبه لهم مصالحهم { لاَ يَسْتَحْيِي مِنَ } إظهار كلمة { ٱلْحَقِّ } التي يجب إيصاله إلى المؤمنين\n ليترسخ في قلوبهم ويتمرنوا عليه ويتصفوا به { وَإِذَا سَأَلْتُمُوهُنَّ } أي: أزواجه صلى الله عليهم وسلم { مَتَاعاً } وحوائج { فَٱسْأَلُوهُنَّ } متسترين { مِن وَرَآءِ حِجَابٍ } بحيث لا يقع نظركم إليهن { ذٰلِكُمْ } أي: الستر والتحجب من أزواج النبي { أَطْهَرُ لِقُلُوبِكُمْ } من أمارات الإثم ومخائل المعصية وسوء الأدب { وَقُلُوبِهِنَّ } أيضاً ترغيماً للشيطان\n وتطهيراً لنفوسكم من غوائله وتلبيساته\n\n\n{ وَ } بالجملة: اعلموا أيها المؤمنون { مَا كَانَ } أي: ما صح وجاز { لَكُمْ } في حال من الأحوال { أَن تؤْذُواْ رَسُولَ ٱللَّهِ } بشيء يكرهه ويستنزه عنه مطلقاً { وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ } المدخولة عليها { مِن بَعْدِهِ أَبَداً } سواء كنَّ حرائر أم إماء { إِنَّ ذٰلِكُمْ } إي: إيذاءه صلى الله عليه وسلم ونكاح نسائه بعده { كَانَ عِندَ ٱللَّهِ } المنتقم الغيور\n المقتدر على أنواع الانتقام { عَظِيماً } [الأحزاب: 53] مستجلباً لأليم العذاب وعظيم العقاب\n\n\nواعلموا أيها المؤمنون { إِن تُبْدُواْ } تظهروا { شَيْئاً } حقيراً مما يتعلق بإيذائه صلى الله عليه وسلم من قِبَل أزواجه في حياته صلى الله عليه وسلم وبعد مماته { أَوْ تُخْفُوهُ } في أنفسكم غير مجاهرين به { فَإِنَّ ٱللَّهَ } المطلع على مكنونات صدوركم { كَانَ بِكُلِّ شَيْءٍ } ظهر على ألسنتكم أو خطر ببالكم { عَلِيماً } [الأحزاب: 54] لا يعزب عن علمه شيء من الدقائق والرقائق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي ٱلنَّبِيَّ فَيَسْتَحْيِي مِنكُمْ وَٱللَّهُ لاَ يَسْتَحْيِي مِنَ ٱلْحَقِّ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعاً فَٱسْأَلُوهُنَّ مِن وَرَآءِ حِجَابٍ ذٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ\n\n\n }\n  يقول الحق جلّ جلاله: { يا أيها الذين آمنوا لا تدخلوا بيوتَ النبي } وكانت تسعاً\n { إلا أن يُؤذنَ لكم إِلى طعامٍ } أي: إلا وقت أن يُؤذن لكم\n أو: إلا مأذوناً لكم\n فجملة: { إلا أن يُؤذن }: في موضع الحال\n أو الظرف\n و { غير ناظرين }: حال من { لا تدخلوا } \n وقع الاستثناء على الوقت الحال\n كأنه قيل: لا تدخلوا بيوت النبي إلا وقت الإذن\n ولا تدخلوها إلا { غير ناظرين } أي: منتظرين { إِنَاهُ } أي: إدراكه ونضجه\n قال ابن عزيز: إِناهُ بلوغ وقته\n يقال: أنِيَ يَأنَى\n وآن يئين: إذا شهى\n بمنزلة: حان يحين\n هـ\n وقال الهروي: أي: غير ناظرين نضجه وبلوغ وقته\n مكسور الهمزة مقصور\n فإذا فتحت مددت\n فقلت: الإناء\n أي غير ناظرين وقت الطعام وساعة أكله\n رُوي أن النبي صلى الله عليه وسلم أَوْلَمَ على زينب بتمر وسويق\n وذبح شاةً\n وأمر أنساً أن يدعو الناس\n فترادفوا أفواجاً\n يأكل كل فوج\n فيخرج\n ثم يدخل فوج\n إلى أن قال: يا رسول الله دعوتُ حتى ما أجد أحداً أدعوه\n فقال:\n \" أرفعوا طعامكم \" \nوتفرّق الناس\n وبقي ثلاثة نفر يتحدثون\n فأطالوا\n فقام رسول الله صلى الله عليه وسلم ليخرجوا\n فطاف بالحجرات\n وسلّم عليهن\n ودعون له\n ورجع\n فإذا الثلاثة جلوس يتحدثون\n وكان صلى الله عليه وسلم شديد الحياء\n فتولى\n فلما رأوه متولياً خرجوا\n فنزلت الآية\n وهي آية الحجاب\n قال أنس: فضرب بيني وبينه الحجاب\n  قال تعالى: { ولكن إِذا دُعيتم فادخلوا فإِذا طَعِمْتُم فانتشروا } تفرقوا\n { ولا مستأنسين لحديثٍ } أي: ولا تدخلوها حال كونكم مستأنسين لحديث\n أو: غير ناظرين ولا مستأنسين\n فهو منصوب\n أو مجرور\n عطف على \" ناظرين \" \n نُهوا أن يُطيلوا الجلوس في بيته صلى الله عليه وسلم مستأنسين بعضهم ببعض\n لأجل حديث يتحدثون به\n { إِن ذلكم كان يُؤذي النبيَّ فيستَحْي منكم } من إخراجكم { والله لا يستحي من الحق } يعني أن إخراجكم حق\n ما ينبغي أن يُستحى منه\n ولا يُترك بيانه\n حياءً\n أو: لا يأمر بالحياء في الحق\n ولا يَشرع ذلك\n  { وإِذا سألتموهنّ } أي: نساء النبي صلى الله عليه وسلم\n بدلالة البيوت عليهن لأن فيها نساءه\n { متاعاً } عارية أو حاجة\n { فاسألوهنّ من وراءِ حجابٍ } ستر\n { ذلكم أطهرُ لقلوبكم وقلوبهنّ } من خواطر الشيطان وعوارض الفتن\n وكانت النساء قبل هذه الآية يبرزن للرجال\n وكان عمر رضي الله عنه يُحب ضَرْبَ الحجاب عليهن\n ويودّ أن ينزلَ فيه\n وقال: يا رسول الله: يدخل عليك البرّ والفاجر\n فلو أمرتَ أمهاتِ المؤمنين بالحجاب؟ فنزلت\n\nوقيل: إنه عليه الصلاة والسلام\n كان يَطعمَ ومعه بعض أصحابه\n فأصابت يدُ رجلٍ يدَ عائشة\n فكَرِهَ النبيُّ صلى الله عليه وسلم ذلك فنزلت الآية\n والله تعالى أعلم\n  الإشارة: العلماء ومشايخ التربية ورثة الأنبياء\n فإذا دَعوا إلى طعام فلا يدخل أحد حتى يُؤذن له\n فإذا طعموا فلينتشروا\n وإذا سأل أحدٌ حاجته من أهل دار الشيخ فليسأل من وراء الباب\n وليتنحَّ عن مقابلة الباب لئلا يتكشف على عِرض شيخه\n فيسيء الأدب معه\n وهو سبب الخسران\n ثم نهى عن تزوج نساء النبي صلى الله عليه وسلم\n فقال: {\n\n\n\n وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً إِنَّ ذٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً إِن تُبْدُواْ شَيْئاً أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيماً }\n يقول الحق جلّ جلاله: { وما كان لكم أن تُؤذوا رسولَ الله } أي: ما صحَّ لكم إيذاء رسول الله صلى الله عليه وسلم\n وهو كفر\n { ولا أن تَنكِحُوا أزواجَه من بعده أبداً } تعظيماً لحُرمته صلى الله عليه وسلم\n ولبقاء عصمته عليهن\n ولذلك وجبت نفقتهن بعده\n لقوله:\n \" ما بقي بعد نفقة أهلي صدقة \" \nوكذا السكنى كما قد علم\n وبه قال ابن العربي\n وعَطفُ ولا أن تنكحوا على أن تؤذوا من عطف الخاص على العام إذ تزوج نسائه من أعظم الإيذاء\n { إِنَّ ذلكم } أي: الإيذاء أو التزوُّج { كان عند الله } ذنباً { عظيماً }\n { إِن تُبدوا شيئاً } من أذى رسول الله صلى الله عليه وسلم\n أو نكاح أزواجه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:51",
      "similarity": 0.36535473476347974
    },
    {
      "verse": "38:32",
      "similarity": 0.34399535388931474
    },
    {
      "verse": "19:17",
      "similarity": 0.28342639975870415
    },
    {
      "verse": "83:15",
      "similarity": 0.28149687740072404
    },
    {
      "verse": "41:5",
      "similarity": 0.2802497409577724
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}