{
  "chapter": "الأحزاب",
  "text": "لا يحل لك النساء منۢ بعد ولا ان تبدل بهن من ازوج ولو اعجبك حسنهن الا ما ملكت يمينك وكان الله على كل شىء رقيبا",
  "translations": [
    {
      "translation": "After that no other women are halal for you nor may you exchange them for other wives, even though their beautv miaht be Dleasina to vou. with the exception of anv vou own as slaves. Allah is watchful over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No other women are lawful for you after this except those you have married, nor to change your present wives for other women even though their beauty should appeal to you. God is watchful of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter women will not be lawful for you, and it will not be lawful for you to take other wives in place of them, even though their beauty might please you, unless they be those whom your right hand owns. Allah is watchful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides these, other women are not lawful for you to marry nor is it lawful for you to exchange your wives for the wives of others (except for the slave girls), even though they may seem attractive to you. God is watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other women are not permitted for you after these, nor that you change them for other wives even if their beauty pleases you except the bondwomen whom you possess; and Allah is the Guardian over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not lawful for you (to marry other) women after this, nor to change them for other wives even though their beauty attracts you, except those whom your right hand possesses. And Allah is Ever a Watcher over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not allowed to you to take women afterwards, nor that you should change them for other wives, though their beauty be pleasing to you, except what your right hand possesses and Allah is Watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter women are not lawful to thee, neither for thee to take other wives in exchange for them, though their beauty please thee, except what thy right hand owns; God is watchful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not allowed thee to take (other) women henceforth, nor that thou shouldst change them for other wives even though their beauty pleased thee, save those whom thy right hand possesseth. And Allah is ever Watcher over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not lawful for you to marry more women after this, nor to change them for other wives, even though their beauty may please you, except any that your right hand possesses. God is watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women are not allowed unto thee henceforth, nor mayest thou change them for other wives although their beauty please thee, save those whom thy right hand shall own; and Allah is ever over everything a Watcher.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beyond that, women are not lawful for you, nor that you should change them for other wives even though their beauty should impress you, except those whom your right hand owns. Allah is watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not lawful for thee (to marry more) women after this, nor to change them for (other) wives, even though their beauty attract thee, except any thy right hand should possess (as handmaidens): and Allah doth watch over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not lawful for you (to marry other) women after this, nor to change them for other wives even though their beauty attracts you, except those (captives or slaves) whom your right hand possesses. And Allah is Ever a Watcher over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be unlawful for you to take more wives or to exchange your present wives for other women, though their beauty pleases you, except those whom your right hand possesses. Allah is watchful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beyond that, no other women are permissible for you, nor can you exchange them for other wives, even if you admire their beauty, except those you already have. God is Watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not lawful to you, [O Muhammad], are [any additional] women after [this], nor [is it] for you to exchange them for [other] wives, even if their beauty were to please you, except what your right hand possesses. And ever is Allah, over all things, an Observer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:52] Women are not lawful for you (read lā tahillu, or lā yahillu) beyond that, beyond the nine that have chosen you [as their husband], nor [is it lawful] for you to change (tabaddala: one of the two original tā’ letters [of tatabaddala] has been omitted) them for other wives, by divorcing them or some of them and marry in place of those whom you divorce, even though their beauty impress you, except those whom your right hand owns, of slavegirls, which is [in contrast] lawful for you. In addition to these [slavegirls] the Prophet (s) came to own Māriya [the Copt]. She bore for him Ibrāhīm, who died during his lifetime. And God is Watcher over, Preserver [of], all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not allowed thee to take (other) women) to marry other women (henceforth) after explaining these criteria; it is also said this means: after your nine wives: 'A'ishah the daughter of Abu Bakr, Hafsah the 479 daughter of 'Umar, Zaynab Bint Jahsh al-Asdiyyah, Umm Salamah Bint Abi Umayyah al-Makhzumi, Umm Habibah Bint Abi Sufyan Ibn Harb, Safiyyah Bint Huyayy Ibn Akhtab, Maymunah Bint al-Harth al-Hilaliyyah, Sawdah Bint Zam'ah Ibn al-Aswad and Juwayriyyah Bint al-Harith al-Mustaliqiyyah, (nor that thou shouldst change them for other wives) among those I explained amongst the daughters of your uncles and aunts (even though their beauty pleased thee) you are not allowed to marry them, (save those whom thy right hand possesseth) Maria the Copt. (And Allah is Watcher over all things) and Allah is Guardian over all things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رَّقِيباً } معناه حَفيظٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"O Guardian!\" - meaning, a Preserver.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { لاَّ يَحِلُّ لَكَ } يا أكمل الرسل { ٱلنِّسَآءُ } أي: تزويجهن { مِن بَعْدُ } أي: بعد أن يتفقن أولئك التسعة على حكمك وأمرك\n وفوَّضن أمورهن إليكم { وَلاَ } لا يحل لك أيضاً { أَن تَبَدَّلَ بِهِنَّ } أي: تطلق بعضهن وتبدل بدلهن { مِنْ أَزْوَاجٍ } أخر من الأجنبيات { وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ } أي: حسن الأجنبيات\n لا يحل لك تزوجهن كما حل لك فيما مضى { إِلاَّ مَا مَلَكَتْ يَمِينُكَ } من الإماء\n فلا حرج عليك بدخولها { وَكَانَ ٱللَّهُ } المطلع على مقادير أفعال عباده { عَلَىٰ كُلِّ شَيْءٍ } مما جرى في ملكه وملكوته { رَّقِيباً } [الأحزاب: 52] يراقبه ويحافظه إلى أن يكمل\n ثمَّ يمنع عنه على مقتضى حكمته البالغة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:59",
      "similarity": 0.36581986595712834
    },
    {
      "verse": "4:1",
      "similarity": 0.3506248447071679
    },
    {
      "verse": "28:21",
      "similarity": 0.3276279569503261
    },
    {
      "verse": "50:2",
      "similarity": 0.3096736105725081
    },
    {
      "verse": "38:5",
      "similarity": 0.30905000739106686
    }
  ]
}