{
  "chapter": "الأحزاب",
  "text": "ترجى من تشاء منهن وتـوى اليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك ذلك ادنى ان تقر اعينهن ولا يحزن ويرضين بما ءاتيتهن كلهن والله يعلم ما فى قلوبكم وكان الله عليما حليما",
  "translations": [
    {
      "translation": "You may refrain from any of them you will and keep close to you any of them you will. And if you desire any you have left alone, there is nothing wrong in that. This makes it more likely they will be comforted and not be grieved, and all of them will be content with what you give them. Allah knows what is in your hearts. Allah is All-Knowing, All-Forbearing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer the turn of any of your wives you like, and may take any other you desire. There is no harm if you take any of those (whose turn) you had deferred. This would be better as it would gladden their hearts and they will not grieve, and each will be happy with what you have given her. God knows what is in your heart, for He is all-wise and benign.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them you may put off any of them you wish, and you may take any of them whom you wish, and you may call back any of those whom you had (temporarily) set aside: there will be no blame on you (on this account). It is likelier that they will thus be comforted, and will not grieve, and every one of them will be well-pleased with what you give them. Allah knows what is in your hearts. Allah is All-Knowing, All-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may refuse whichever (of the woman who offer themselves to you) as you want and accept whichever of them you wish. There is no blame on you if you marry (one whom you had refused previously). This would be more delightful for them. They should not be grieved but should be happy with whatever you have given to every one of them. God knows what is in your hearts. God is All-knowing and All-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put back in the order whom you wish among them and give your proximity to whomever you wish; and if you incline towards one whom you had set aside, there is no sin upon you in it; this command is closer to their eyes remaining soothed and not grieving, and all of them remaining happy with whatever you give them; and Allah knows what is in the hearts of you all; and Allah is All Knowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can postpone whom you will of them, and you may receive whom you will. And whomsoever you desire of those whom you have set aside, it is no sin on you: that is better that they may be comforted and not grieved, and may all be pleased with what you give them. Allah knows what is in your hearts. And Allah is Ever All-Knowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may put off whom you please of them, and you may take to you whom you please, and whom you desire of those whom you had separated provisionally; no blame attaches to you; this is most proper, so that their eyes may be cool and they may not grieve, and that they should be pleased, all of them with what you give them, and Allah knows what is in your hearts; and Allah is Knowing, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou mayest put off whom thou wilt of them, and whom thou wilt thou mayest take to thee; and if thou seekest any thou hast set aside there is no fault in thee. So it is likelier they will be comforted, and not sorrow, and every one of them will be well-pleased with what thou givest her. God knows what is in your hearts; God is All-knowing, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou canst defer whom thou wilt of them and receive unto thee whom thou wilt, and whomsoever thou desirest of those whom thou hast set aside (temporarily), it is no sin for thee (to receive her again); that is better; that they may be comforted and not grieve, and may all be pleased with what thou givest them. Allah knoweth what is in your hearts (O men), and Allah is ever Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer [the turn of] any of them that you please, and you may receive any you please: and there is no blame on you if you invite one whose [turn] you have set aside. That is more proper, so that their eyes may be cooled, and so that they may not grieve, and so that they will be satisfied with what you have given them. God knows what is in your hearts; and God is all knowing, and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou myest put off such of them as thou wilt, and thou mayest take unto thee such of them as thou wilt; and whomsoever thou desirest if such as thou hadst set aside there is no blame upon thee. This is likelier to cool their eyes and not let them grieve and to keep them pleased with whatsoever thou shalt give every one of them. Allah knoweth that which is in your hearts. and Allah is ever Knowing, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may put off whichever of them you wish and consort with whichever of them you wish, and there is no sin upon you [in receiving again] any [of them] whom you may seek [to consort with] from among those you have set aside [earlier]. That makes it likelier that they will be comforted and not feel unhappy, and all of them will be pleased with what you give them. Allah knows what is in your hearts, and Allah is all-knowing, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou mayest defer (the turn of) any of them that thou pleasest, and thou mayest receive any thou pleasest: and there is no blame on thee if thou invite one whose (turn) thou hadst set aside. This were nigher to the cooling of their eyes, the prevention of their grief, and their satisfaction - that of all of them - with that which thou hast to give them: and Allah knows (all) that is in your hearts: and Allah is All-Knowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You (O Muhammad SAW) can postpone (the turn of) whom you will of them (your wives), and you may receive whom you will. And whomsoever you desire of those whom you have set aside (her turn temporarily), it is no sin on you (to receive her again), that is better; that they may be comforted and not grieved, and may all be pleased with what you give them. Allah knows what is in your hearts. And Allah is Ever AllKnowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer any of them (your wives) if you please and invite any of them if you please. If you seek any you have put aside there is no fault in you. So that it is likelier they will be comforted, and not sorrow, and every one of them will be pleased, and all are pleased with what you give them. Allah knows what is in your hearts. Allah is the Knower, the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer any of them you wish, and receive any of them you wish. Should you desire any of those you had deferred, there is no blame on you. This is more proper, so that they will be comforted, and not be grieved, and be content with what you have given each one of them. God knows what is within your hearts. God is Omniscient and Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You, [O Muhammad], may put aside whom you will of them or take to yourself whom you will. And any that you desire of those [wives] from whom you had [temporarily] separated - there is no blame upon you [in returning her]. That is more suitable that they should be content and not grieve and that they should be satisfied with what you have given them - all of them. And Allah knows what is in your hearts. And ever is Allah Knowing and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:51] You may put off (read turji’ or turjī), you may postpone [consorting with], whomever of them you wish, namely, of your wives, from their turn [for intimacy], and consort, embrace [in conjugality], whomever you wish, of them, and come unto her, and as for whomever you may desire of those whom you have set aside, from their share, you would not be at fault, to desire her and consort with her [again]. He was given the choice in this respect after it had been obligatory for him to give each wife her [equal] share [of conjugality]. That, freedom of choice, makes it likelier that they will be comforted and not grieve, and that they will be satisfied with what you give them, of what has been mentioned of your freedom to choose [whom to consort with], every one of them (kulluhunna emphasises the subject of [the verb] yardayna, ‘they will be satisfied’) will be well-pleased with what you give her. And God knows what is in your hearts, with respect to [your] women and [your] preferring some [to others]. We have given you the freedom to choose [from among them] in order to make it easier for you to have what you desire. And God is Knower, of His creatures, Forbearing, in refraining from punishing them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ذَلِكَ أَدْنَى أَنْ تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَا آَتَيْتَهُنَّ كُلُّهُنَّ وَاللَّهُ يَعْلَمُ مَا فِي قُلُوبِكُمْ وَكَانَ اللَّهُ عَلِيمًا حَلِيمًا (51){ تُرْجِى مَن تَشَآءُ مِنْهُنَّ وتؤوى إِلَيْكَ مَن تَشَآءُ وَمَنِ ابتغيت مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ ذَلِكَ أدنى أَن تَقَرَّ أَعْيُنُهُنَّ وَلاَ يَحْزَنَّ وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ والله يَعْلَمُ مَا فِى قلُوبِكُمْ وَكَانَ الله عَلِيماً حَلِيماً } .استئناف بياني ناشىء عن قوله : { إنا أحللنا لك أزواجك } إلى قوله : { لكيلا يكون عليك حرج } \\[ الأحزاب : 50 \\] فإنه يثير في النفس تطلباً لبيان مدى هذا التحليل . والجملةُ خبر مستعمل في إنشاء تحليل الإِرجاء والإِيواء لمن يشاء النبي صلى الله عليه وسلموالإِرجاء حقيقته : التأخير إلى وقت مستقبل . يقال : أرجأت الأمر وأرجيْته مهموزاً ومخففاً ، إذا أخرته .وفعله ينصرف إلى الأحوال لا الذوات ، فإذا عدي فعله إلى اسم ذات تعين انصرافه إلى وصف من الأوصاف المناسبة والتي تراد منها ، فإذا قلت : أرجأت غريمي ، كان المراد : أنك أخرت قضاء دينه إلى وقت يأتي .والإِيواء : حقيقته جعل الشيء آوياً ، أي راجعاً إلى مكانه . يقال : آوى ، إذا رجع إلى حيث فارق ، وهو هنا مجاز في مطلق الاستقرار سواء كان بعد إبعاد أم بدونه ، وسواء كان بعد سبق استقرار بالمكان أم لم يكن .ومقابلة الإِرجاء بالإِيواء تقتضي أن الإِرجاء مراد منه ضد الإِيواء أو أن الإِيواء ضد الإِرجاء وبذلك تنشأ احتمالات في المراد من الإِرجاء والإِيواء صريحهما وكنايتهما .فضمير { منهن } عائد إلى النساء المذكورات ممن هن في عصمته ومن أحل الله له نكاحهن غيرهن من بنات عمه وعماته وخاله وخالاته ، والواهبات أنفسهن ، فتلك أربعة أصناف :الصنف الأول : وهنّ اللاء في عصمة النبي عليه الصّلاة والسّلام فهن متصلن به فإرجاء هذا الصنف ينصرف إلى تأخير الاستمتاع إلى وقت مستقبل يريده ، والإِيواء ضده . فيتعين أن يكون الإِرجاء منصرفاً إلى القَسْم فوسع الله على نبيئه صلى الله عليه وسلم بأن أباح له أن يسقط حق بعض نسائه في المبيت معهن فصار حق المبيت حقاً له لا لهن بخلاف بقية المسلمين ، وعلى هذا جرى قول مجاهد وقتادة وأبي رزين ، قاله الطبري .وقد كانت إحدى نساء النبي صلى الله عليه وسلم أسقطت عنه حقها في المبيت وهي سودة بنت زمعة ، وهبت يومها لعائشة فكان النبي صلى الله عليه وسلم يقسم لعائشة بيومها ويوم سودة وكان ذلك قبل نزول هذه الآية ، ولما نزلت هذه الآية صار النبي عليه الصلاة والسلام مخيراً في القسم لأزواجه . وهذا قول الجمهور ، قال أبو بكر بن العربي : وهو الذي ينبغي أن يعول عليه . وهذا تخيير للنبيء صلى الله عليه وسلم إلا أنه لم يأخذ لنفسه به تكرماً منه على أزواجه . قال الزهري . ما علمنا أن رسول الله أرجأ أحداً من أزواجه بل آواهن كلَّهن .قال أبو بكر بن العربي : وهو المعنى المراد . وقال أبو رَزين العُقيلي : أرجأ ميمونة وسَودة وجويرية وأم حبيبة وصفية ، فكان يقسم لهن ما شاء ، أي دون مساواة لبقية أزواجه . وضعفه ابن العربي .وفسر الإِرجاء بمعنى التطليق ، والإِيواءُ بمعنى الإِبقاء في العصمة ، فيكون إذناً له بتطليق من يشاء تطليقها وإطلاق الإِرجاء على التطليق غريب .وقد ذكروا أقوالاً أخر وأخباراً في سبب النزول لم تصح أسانيدها فهي آراء لا يوثق بها . ويشمل الإِرجاء الصنف الثاني وهن ما ملكت يمينه وهو حكم أصلي إذ لا يجب للإِماء عدل في المعاشرة ولا في المبيت .ويشمل الإِرجاء الصنف الثالث وهن : بنات عمه وبنات عماته وبنات خاله وبنات خالاته ، فالإِرجاء تأخير تزوج مَن يحلّ منهن ، والإِيواء العقد على إحداهن ، والنبي صلى الله عليه وسلم لم يتزوج واحدة بعد نزول هذه الآية ، وذلك إرجاء العمل بالإِذن فيهن إلى غير أجل معين .وكذلك إرجاء الصنف الرابع اللاء وهَبْن أنفسهن ، سواء كان ذلك واقعاً بعد نزول الآية أم كان بعضه بعد نزولها فإرجاؤهن عدم قبول نكاح الواهبة ، عُبر عنه بالإِرجاء إبقاء على أَملها أن يقبلها في المستقبل ، وإيواؤهن قبول هبتهن .قرأ نافع وحمزة والكسائي وحفص عن عاصم وأبو جعفر وخلف { ترجي } بالياء التحتية في آخره مخَّفف ( تُرجىء ) المهموز . وقرأه ابن كثير وابن عامر وأبو عمرو وأبو بكر عن عاصم ويعقوب { ترجىءُ } بالهمز في آخره . وقال الزجاج : الهمز أجود وأكثر . والمعنى واحد .واتفق الرواة على أن النبي صلى الله عليه وسلم لم يستعمل مع أزواجه ما أبيح له أخذاً منه بأفضل الأخلاق ، فكان يعدل في القسم بين نسائه ، إلاّ أن سَودة وهبت يومها لعائشة طلباً لمسرّة رسول الله صلى الله عليه وسلموأما قوله : { ومن ابتغيت ممن عزلت فلا جناح عليك } فهذا لبياننِ أن هذا التخيير لا يوجب استمرار ما أخذ به من الطرفين المخيَّرِ بينهما ، أي لا يكون عمله بالعزل لازمَ الدوام بمنزلة الظهار والإِيلاء ، بل أَذن الله أن يرجع إلى من يعزلها منهن ، فصرح هنا بأن الإِرجاء شامل للعزل .ففي الكلام جملة مقدرة دل عليها قوله : { ابتغيت } إذ هو يقتضي أنه ابتغى إبطال عزلها ، فمفعول { ابتغيت } محذوف دل عليه قوله : { وتؤوي إليك من تشاء } كما هو مقتضى المقابلة بقوله : { ترجي من تشاء } ، فإن العزل والإِرجاء مؤداهما واحد .والمعنى : فإن عزلْتَ بالإِرجاء إحداهن فليس العزل بواجب استمراره بل لك أن تعيدها إن ابتَغَيْتَ العود إليها ، أي فليس هذا كتخيير الرجل زوجه فتختار نفسها المقتضي أنها تَبِين منه . ومتعلق الجُناح محذوف دل عليه قوله : { ابتغيت } أي ابتغيت إيواءها فلا جناح عليك من إيوائها .و { من } يجوز أن تكون شرطية وجملة { فلا جناح عليك } جواب الشرط . ويجوز أن تكون موصولة مبتدأ فإن الموصول يعامل معاملة الشرط في كلامهم بكثرة إذا قصد منه العموم فلذلك يقترن خبر الموصول العام بالفاء كثيراً كقوله تعالى :{ فمن تعجل في يومين فلا إثم عليه } \\[ البقرة : 203 \\] ، وعليه فجملة { فلا جناح عليك } خبر المبتدأ اقترن بالفاء لمعاملة الموصول معاملة الشرط ومفعول { عزلت } محذوف عائد إلى { مَن } أي التي ابتغيتها ممن عزلتهن وهو من حذف العائد المنصوب .{ ذَلِكَ أدنى أَن تَقَرَّ أَعْيُنُهُنَّ وَلاَ يَحْزَنَّ وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ والله يَعْلَمُ مَا فِى قلُوبِكُمْ وَكَانَ الله عَلِيمًا حَلِيمًا } .الإِشارة إلى شيء مما تقدم وهو أقربه ، فيجوز أن تكون الإشارة إلى معنى التفويض المستفاد من قوله : { ترجي من تشاء منهن وتؤوي إليك من تشاء } ، ويجوز أن تكون الإشارة إلى الابتغاء المتضمن له فعل { ابتغيت } أي فلا جناح عليك في ابتغائهن بعد عزلهن ذلك أدنى لأن تقرَّ أعينهُنّ . والابتغاء : الرغبة والطلب ، والمراد هنا ابتغاء معاشرة مَن عَزلَهن .فعلى الأول يكون المعنى أن في هذا التفويض جعل الحق في اختيار أحد الأمرين بيد النبي صلى الله عليه وسلم ولم يبق حقاً لهن فإذا عين لإِحداهن حالة من الحالين رضيته به لأنه يجعل الله تعالى على حكم قوله : { وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمراً أن تكون لهم الخيرة من أمرهم } \\[ الأحزاب : 36 \\] فقرت أعين جميعهن بما عُينت لكل واحدة لأن الذي يعلم أنه لا حق له في شيء كان راضياً بما أوتي منه ، وإن علم أنّ له حقاً حسب أن ما يؤتاه أقل من حقه وبالغ في استيفائه . وهذا التفسير مروي عن قتادة وتبعه الزمخشري وابن العربي والقرطبي وابن عطية ، وهذا يلائم قوله : { ويرضين } ولا يلائم قوله : { أن تقر أعينهن } لأن قرة العين إنما تكون بالأمر المحبوب ، وقوله : { ولا يحزن } لأن الحزن من الأمر المكدّر ليس باختياري كما قال النبي صلى الله عليه وسلم \" فلا تَلمنِي فيما لا أملك \" . وعلى الوجه الثاني يكون المعنى : ذلك الابتغاء بعد العزل أقرب لأن تَقَرَّ أعين اللاتي كنت عزلتَهُن . ففي هذا الوجه ترغيب للنبي صلى الله عليه وسلم في اختيار عدم عزلهن عن القسم وهو المناسب لقوله : { أن تقر أعينهن ولا يحزن } كما علمت آنفاً ، ولقوله : «ويرضَيْنَ كلُّهن» ، ولما فيما ذكر من الحسنات الوافرة التي يرغب النبي صلى الله عليه وسلم في تحصيلها لا محالة وهي إدخال المسرّة على المسلم وحصول الرضى بين المسلمين وهو مما يعزّز الأخوة الإسلامية المرغب فيها . ونقل قريب من هذا المعنى عن ابن عباس ومجاهد واختاره أبو علي الجبّائي وهو الأرجح لأن قرة العين لا تحصل على مضض ولأن الحط في الحق يوجب الكدر . ويؤيده أن النبي صلى الله عليه وسلم لم يأخذ إلا به ولم يحفظ عنه أنه آثر إحدى أزواجه بليلة سوى ليلة سودة التي وهبتها لعائشة ، استمر ذلك إلى وفاته صلى الله عليه وسلم وقد جاء في الصحيح أنه كان في مرضه الذي توفي فيه يُطاف به كل يوم على بيوت أزواجه ، وكان مبدأ شكواه في بيت ميمونة إلى أن جاءت نوبة ليلة عائشة فأذِنَّ له أزواجُه أن يمرض في بيتها رفقاً به .وروي عنه صلى الله عليه وسلم أنه قال حين قَسَم لَهُن \" اللهم هذه قسمتي فيما أملك فلا تلمني فيما لا أملك \" ولعل ذلك كان قبل نزول التفويض إليه بهذه الآية .وفي قوله : { ويرضين بما آتيتهن كلهن } إشارة إلى أن المراد الرضى الذي يتساوَيْن فيه وإلا لم يكن للتأكيد ب { كلهن } نكتة زائدة ، فالجمع بين ضميرهن في قوله : { كلهن } يومىء إلى رضى متساوٍ بينهن .وضميرا { أعينهن ولا يحزن } عائدان إلى ( مَن ) في قوله : { ممن عزلت } . وذكر { ولا يحزن } بعد ذكر { أن تقر أعينهن } مع ما في قُرّة العين من تضمّن معنى انتفاء الحزن بالإيماء إلى ترغيب النبي صلى الله عليه وسلم في ابتغاء بقاء جميع نسائه في مواصلته لأن في عزل بعضهن حزناً للمعزولات وهو بالمؤمنين رؤوف لا يحب أن يُحْزِن أحداً .و { كلهن } توكيد لضمير { يَرْضَيْنَ } أو يتنازعه الضمائر كلّها .والإِيتاء : الإِعطاء وغلب على إعطاء الخير إذا لم يذكر مفعوله الثاني ، أو ذكر غير معيّن كقوله : { فخذ ما آتيتك وكن من الشاكرين } \\[ الأعراف : 144 \\] ، فإذا ذكر مفعوله الثاني فالغالب أنه ليس بسوء . ولم أره يستعمل في إعطاء السوء فلا تقول : آتاه سجناً وآتاه ضرباً ، إلا في مقام التهكم أو المشاكلة ، فما هنا من القبيل الأول ، ولهذا يبعد تفسيره بأنهن يرضين بما أذِن الله فيه لرسوله من عزلهن وإرجائهن . وتوجيهه في «الكشاف» تكلف .والتذييل بقوله : { والله يعلم ما في قلوبكم وكان الله عليماً حليماً } كلام جامع لمعنى الترغيب والتحذير ففيه ترغيب النبي صلى الله عليه وسلم في الإِحسان بأزواجه وإمائه والمتعرضات للتزوج به ، وتحذير لهن من إضمار عدم الرضى بما يلقَيْنَه من رسول الله صلى الله عليه وسلموفي إجراء صفتي { عليماً حليماً } على اسم الجلالة إيماء إلى ذلك ، فمناسبة صفة العلم لقوله : { والله يعلم ما في قلوبكم } ظاهرة ، ومناسبة صفة الحليم باعتبار أن المقصود ترغيب الرسول صلى الله عليه وسلم في أليق الأحوال بصفة الحليم لأن همه صلى الله عليه وسلم التخلق بخلق الله تعالى وقد أجرى الله عليه صفات من صفاته مثل رؤوف رحيم ومثل شاهد . وقالت عائشة رضي الله عنها : ما خُيّر رسول الله صلى الله عليه وسلم بين شيئين إلا اختار أيسرهما ما لم يكن إثماً . ولهذا لم يأخذ رسول الله بهذا التخيير في النساء اللاتي كنّ في معاشرته ، وأخذ به في الواهبات أنفسهن مع الإحسان إليهن بالقول والبذل فإن الله كتب الإحسان على كل شيء . وأخذ به في ترك التزوج من بنات عمه وعماته وخاله وخالاته لأن ذلك لا حرج فيه عليهن .\n\n",
      "translations": [
        {
          "translation": "(Thou canst defer) you can leave (whom thou wilt of them) from among the daughters of your aunts from your father's side, and or the daughters of your uncles from your mother's side, and not marry them (and receive unto thee whom thou wilt) and marry them, (and whomsoever thou desirest) to marry (of those whom thou hast set aside (temporarily), it is no sin for thee (to receive her again)) it is also said that this could be understood in this manner: you can abstain from whoever you will of your wives and you can go to whoever you will of your wives and there is no sin for you in abstaining from some and going to others; (that) the widening of the scope and dispensation (is better; that they may be comforted) when they know that this widening of scope is from Allah (and not grieve) for fear of divorce, (and may all be pleased with what thou givest them) of sharing your physical presence with them. (Allah knoweth what is in your hearts) whether it is contentment or resentment; (and Allah is Knower) of your righteousness and theirs, (Clement) in that which He explained to you and forgave you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ } يعني تؤخر { وَتُؤْوِيۤ إِلَيْكَ مَن تَشَآءُ } معناه تَضمُّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Turn to whom you will of them,\" means that you should {delay/postpone/defer} {and take to yourself whoever you will of them}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا وسّعنا يا أكمل الرسل أمر نكاحك\n وأبحنا لك ما لم يبح لغيرك\n فلك الخيار في أزواجك { تُرْجِي } أي: تؤخر وتترك مضاجعة { مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِيۤ } أي: تلصق وتضم { إِلَيْكَ مَن تَشَآءُ } منهم بلا حرج وضيق\n بل { وَمَنِ ٱبْتَغَيْتَ } وطلبت نكاحها { مِمَّنْ عَزَلْتَ } وطلقت تطليقاً ثلاثاً أو أقل { فَلاَ جُنَاحَ } ولا إثم { عَلَيْكَ } أن تعيد إلى نكاحها بلا تحليل وتزويج للغير\n إذ من جملة خواصك: تحريم مدخولتك على الغير مطلقاً { ذَلِكَ } أي: تفويض أمورهن إليك { أَدْنَىٰ } وأقرب { أَن تَقَرَّ أَعْيُنُهُنَّ } إذ نسبتك إليهن حينئذٍ على السواء\n بلا ميل منكر وترجيح\n\n\n{ وَ } المناسب لهن أن { لاَ يَحْزَنَّ } بعد التفويض\n بل { وَ } لهن أن { يَرْضَيْنَ بِمَآ آتَيْتَهُنَّ كُلُّهُنَّ } إذ لا تتفاوت نسبتك إليهن أصلاً\n لأنك مجبول على العدل القويم والصراط المستقيم\n سيما بين أزواجك المنتسبين إليك كلهن بنسبة واحدة { وَٱللَّهُ } المطلع لضمائر عباده { يَعْلَمُ مَا } يجري { فِي قلُوبِكُمْ } وضمائركم أيها المؤمنون من الميل إلى بعض النساء دون بعض\n ونبينا صلى الله عليه وسلم منزه عن هذا الميل وأمثاله { وَكَانَ ٱللَّهُ } المراقب لأحوالكم { عَلِيماً } بما جرى عنه في صدوركم من الميل إلى الهوى { حَلِيماً } [الأحزاب: 51] ينتقم عليه ولكن لا يعجل\n\n\nثمَّ لمَّا خيَّر سبحانه حبيبه صلى الله عليهم في أمر نسائه\n وفوض أمورهن كلها إليه صلى الله عليه وسلم\n ورضين كلهن بحكمه بلا إباء ومنع\n أراد سبحانه أنه يمنع وينهي حبيبه صلى الله عليه وسلم عن تطليقهن وتبديلهن والزيادة عليهم بعدما بلغن التسعة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله لرسوله صلى الله عليه وسلم: { تُرْجي من تشاء منهن } أي: تؤخرها في القسمة، { وتُؤوي إِليك من تشاء } أي: تضمها إليك، والمعنى: تترك مضاجعة مَن تشاء منهن وتضاجع مَن تشاء، فقد خيّره الله في القسمة وعدمها. قال أبو رزين: لما نزلت آية التخيير أشفقن أن يُطلَّقن، فقلن: يا نبيَّ الله اجعل لنا من مالك ونفسك ما شئت، ودَعْنا على حالنا، فكان ممن أرجى منهن: سودة، وجويرية، وصفية، وميمونة، وأم حبيبة، فكان يقيم لهن ما يشاء، وكان ممن آوى إليه عائشة، وحفصة، وأم سلمة، وزينب، فكان يقسم لهن بالسوية، لا يفضل بعضهن على بعض. فآوى أربعاً وأرجى خمساً. وقيل: إنه كان صلى الله عليه وسلم يسوّي بين الجميع في القسم، إلا سودة، فإنها وهبت ليلتها لعائشة، حين همّ بطلاقها، وقالت: لا تطلّقني حتى أُحْشَر في زمرتك وفي نسائك. والجمهور على أنه صلى الله عليه وسلم كان يعدل في القسمة بين نسائه، أخذاً منه بأفضل الأخلاق، مع أن الله خيّره. وقيل: { تُرجي من تشاء } أي: تطلق من تشاء منهن، وتُمسك من تشاء. وقيل: تترك تزوج من شئت من أمتك، وتتزوج من شئت. { ومن ابتغيتَ مِمَّنْ عزلتَ فلا جُناحَ عليك } أي: ومَن دعوت إلى فراشك، وطلبت صحبتها، ممن عزلت عن نفسك بالإرجاء، فلا ضيق في ذلك، أي: ليس إذا عزلتها من القسمة، أو من العصمة، لم يجز لك ردّها إلى نفسك، بل افعل ما شئت، فلا حرج عليك. { ذلك } التفويض إلى مشيئتك { أَدْنَى أَن تَقَرَّ أَعْيُنهنَّ ولاَ يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُن } أي: هو أقرب إلى قرة أعينهن، وقلة حزنهن، ورضاهن جميعاً لأنه إذا علمن أنّ هذا الحكم من عند الله اطمأنت نفوسهنّ، وذهب التغاير، وحصل الرضا، وقرّت العيون.  قلت: والذي يظهر أن مَن أرجاه صلى الله عليه وسلم من النساء إنما كان بوحي، ومَن ضمه كذلك إذ لا يتصرف إلا بإذن من الله، فإذا عَلِمَ النساءُ أن الإرجاء والإيواء كان بوحي من الله رضين بذلك، وقرّت أعينهن، وزال تغايرهن، وأما مطلق التفويض إليه فقط، فلا يقطع الغيرة في العادة، فالإشارة تعود إلى حكم الإرجاء والإيواء فتأمله. و \" كلهن \": تأكيد ضمير \" يَرْضَيْن \". { واللهُ يعلم ما في قلوبكم } من أمر النساء، والميل إلى بعضهن، أو: يعلم ما في قلوبكم من الرضا بحُكم الله والتفويض إليه، ففيه تهديد لمَن لم يرضَ منهم بما دبَّر الله، وفوّض إلى رسوله، { وكان الله عليماً } بذات الصدور، { حليماً } لا يُعاجل بالعقوبة، فهو حقيق بأن يُتقى ويُحذر. الإشارة: إذا تحقق فناء العبد وزواله، وتكملت ولايته، كان مفوضاً إليه في الأمور، يفعل ما يشاء، ويترك ما يشاء، لم يبقَ عليه تحجير، ولم يتوجه إليه عتاب لأن العبد المملوك إذا تحققت محبة سيده له، كتب له عقد التحرير.\nوشاهده حديث:\n \" إِذَا أحَبَّ الله عَبْداً لمْ يضُره ذَنْبٌ \" \n،وحديث البخاري:\n \" لعلَّ الله اطَّلَعَ على أهلِ بَدْرٍِ فقال: اعملوا ما شئتم، فقد غَفَرتُ لكُمْ \" \nوسببه معلوم. وفي القوت عن زيد بن أرقم: إن الله عزّ وجل ليُحب العبد، حتى يبلغ من حبه أن يقول له: اصنع ما شئت، فقد غفرت لك. وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: يبلغ الولي مبلغاً يُقال له: أصحبناك السلامة، وأسقطنا عنك الملامة، فاصنع ما شئت. ومصداقه من كتاب الله: قوله تعالى في حق سليمان عليه السلام:\n[ص: 39]. وهذا وإن كان للنبي من أجل العصمة، فلَمِنْ كان من الأولياء في مقام الإمامة قسط منه، من أجل الحفظة. وقال أيضاً رضي الله عنه في بعض أدعيته: وأدرج أسمائي تحت أسمائك، وصفاتي تحت صفاتك، وأفعالي تحت أفعالك، درج السلامة، وإسقاط الملامة، وتنزُل الكرامة، وظهور الإمامة. هـ. فإذا اندرجت أسماء العبد وصفاته وأفعاله تحت أسماء الرب، وصفاته، وأفعاله، لم يبقَ للعبد وجود أصلاً، وكان الفعل كله بالله، ومن الله، وإلى الله. وهذا مقام عزيز، لا يناله إلا الأفراد من أهل الفناء في الله، والبقاء بالله، وقد غطى وصفهم بوصفه، ونعتهم بنعته، فغيَّبهم عن اسمهم ورسمهم، فهم بالله فيما يفعلون ويذرُون. والله تعالى أعلم.  ثم قال تعالى: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:21",
      "similarity": 0.42252235460447174
    },
    {
      "verse": "26:212",
      "similarity": 0.4164948179341033
    },
    {
      "verse": "19:48",
      "similarity": 0.3444251466935609
    },
    {
      "verse": "19:49",
      "similarity": 0.31185652426950244
    },
    {
      "verse": "22:59",
      "similarity": 0.2992930665305169
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}