{
  "chapter": "الأحزاب",
  "text": "ادعوهم لءابائهم هو اقسط عند الله فان لم تعلموا۟ ءاباءهم فاخونكم فى الدين وموليكم وليس عليكم جناح فيما اخطاتم به ولكن ما تعمدت قلوبكم وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "Call them after their fathers. That is closer to justice in Allah's sight. And if you do not know who their fathers were then they are your brothers in the deen and people under your patronage. You are not to blame for any honest mistake you make but only for what your hearts premeditate. Allah is Ever-Forgiving, Most",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them by the names of their fathers. This is the right course in the sight of God. If you do not know their fathers, they are then your brothers in religion and your friends. It will not be a sin if you make a mistake, unless you do so intentionally; for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call your adopted sons after their true fathers; that is more equitable in the sight of Allah. But if you do not know their true fathers, then regard them as your brethren in faith and as allies. You will not be taken to task for your mistaken utterances, but you will be taken to task for what you say deliberately. Allah is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them sons of their own fathers. It is more just in the eyes of God. If you do not know their fathers, they are your brothers and friends in religion. You will not be responsible for your mistakes, but you will be responsible for what you do intentionally. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them with their fathers’ names – this is more suitable in the sight of Allah; and if you do not know their fathers, then they are your brothers in the faith, (and your cousins as humans) and your friends; and there is no sin upon you for what you did unknowingly in the past – however it is a sin what you do with your heart’s intention; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them by their fathers, that is more just with Allah. But if you know not their father's, your brothers in faith and Mawalikum (your freed servants). And there is no sin on you concerning that in which you made a mistake, except in regard to what your hearts deliberately intend. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assert their relationship to their fathers; this is more equitable with Allah; but if you do not know their fathers, then they are your brethren in faith and your friends; and there is no blame on you concerning that in which you made a mistake, but (concerning) that which your hearts do purposely (blame may rest on you), and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them after their true fathers; that is more equitable in the sight of God. If you know not who their fathers were, then they are your brothers in religion, and your clients. There is no fault in you if you make mistakes, but only in what your hearts premeditate. God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim their real parentage. That will be more equitable in the sight of Allah. And if ye know not their fathers, then (they are) your brethren in the faith, and your clients. And there is no sin for you in the mistakes that ye make unintentionally, but what your hearts purpose (that will be a sin for you). Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them after their own fathers; that is closer to justice in the sight of God. If you do not know their fathers, regard them as your brothers in faith and your proteges. You will not be blamed if you make a mistake, you will be held accountable only for what in your hearts you have done intentionally. God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them by their fathers: that will be most equitable in the sight of Allah. And if ye know not their fathers then they are your brethren in religion and your friends. And there is no fault upon you in regard to the mistake ye have made therein, but in regard to that which your hearts intend purposely. And Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them after their fathers. That is more just with Allah. If you do not know their fathers, then they are your brethren in the faith and your kinsmen. Excepting what your hearts may intend deliberately, there will be no sin upon you for any mistake that you may make therein. And Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them by (the names of) their fathers: that is juster in the sight of Allah. But if ye know not their father's (names, call them) your Brothers in faith, or your maulas. But there is no blame on you if ye make a mistake therein: (what counts is) the intention of your hearts: and Allah is Oft-Returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them (adopted sons) by (the names of) their fathers, that is more just with Allah. But if you know not their father's (names, call them) your brothers in faith and Mawalikum (your freed slaves). And there is no sin on you if you make a mistake therein, except in regard to what your hearts deliberately intend. And Allah is Ever OftForgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Name them after their fathers, that is more just with Allah. If you do not know their fathers, regard them as your brothers in the religion, or those under your sponsorship. There is no fault in you if you make mistakes, but only in what your hearts intended. Allah is Forgiving and the Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them after their fathers; that is more equitable with God. But if you do not know their fathers, then your brethren in faith and your friends. There is no blame on you if you err therein, barring what your hearts premeditates. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them by [the names of] their fathers; it is more just in the sight of Allah. But if you do not know their fathers - then they are [still] your brothers in religion and those entrusted to you. And there is no blame upon you for that in which you have erred but [only for] what your hearts intended. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:5] Instead, attribute them to their [true] fathers. That is more equitable, [that is] more just, in the sight of God. If you do not know their [true] fathers, then they are your brethren in religion and [as] your associates. And you would not be at fault for any mistake you make, in this respect, except, in, what your hearts may premeditate, after the prohibition [has been issued]. And God is Forgiving, of whatever you said   before the prohibition [was issued], Merciful, to you in this respect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Proclaim their real parentage) name them in relation to their real fathers. (That will be more equitable) better, more correct and fairer (in the sight of Allah) in relation to lineage. (And if ye know not their fathers) if you do not know the lineage of their fathers, (then (they are) your brethren in the faith) name them with names showing brotherhood in faith: 'Abdullah, 'Abd al-Rahman, 'Abd al-Rahim and 'Abd al-Raziq, (and your clients) and name them as your clients. (And there is no sin for you in the mistakes that ye make unintentionally) regarding the identification of one's parentage, (but what your hearts purpose (that will be a sin for you)) what is a sin for you is to attribute intentionally someone to other than his real father. (Allah is Forgiving) of what was done in the past, (Merciful) in relation to what will happen in the future. This verse was revealed about Zayd Ibn Harithah who was adopted by the Prophet (pbuh). People used to call him Zayd Ibn Muhammad, but Allah forbade them from calling him so and guided them to what is proper.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعتم حقيقة القول في أدعياءكم وحقيته { ٱدْعُوهُمْ } أي: سموهنم أدعياءكم بأسمائهم\n وانسبوهم حين دعائكم وندائكم:إيها { لآبَآئِهِمْ } المولدين لهم حقيقة لا إلى الداعي إن علموا آباءهم الأصلية النسلية { هُوَ } أي: انتسابهم إلى آبائهم { أَقْسَطُ عِندَ ٱللَّهِ } وأقوم بين المؤمنين\n وأقرب إلى الصدق\n وأبعد عن الكذب والفرية\n إذ كثيراً ما اشتهر دعيٌّ باسم من تبناه فأراد أن يأخذ منه الميراث\n فعليكم ألاَّ تنسبوهم إلاَّ لآبائهم الحقيقيين { فَإِن لَّمْ تَعْلَمُوۤاْ آبَاءَهُمْ } لتنسبوهم إليهم { فَإِخوَانُكُمْ فِي ٱلدِّينِ وَمَوَالِيكُمْ } أي: فهم إخوانكم في الدين وأولياؤكم فيه كسائر المؤمنين\n فخاطبوهم مثل خطاب بعضكم بعضاً\n فقولوا له: يا أخي\n ويا صاحبي\n ووليي في الدين وغير ذلك\n\n\n{ وَلَيْسَ عَلَيْكُمْ } أيها المؤمنون { جُنَاحٌ } إثم ومؤاخذة { فِيمَآ أَخْطَأْتُمْ بِهِ } أي: بقولكم هذا ونسبتكم هذه إذا صدرت عنكم هفوةً على سبيل الخطأ والنسيان\n سواء كان قبل ورورد النهي أو بعده { وَلَـٰكِن } تؤاخذون في { مَّا تَعَمَّدَتْ قُلُوبُكُمْ } وصدرت عنكم هذا قصداً\n إذ قصدكم به يؤدي إلى الافتراء\n وتضييع حقوق المؤمنين { وَكَانَ ٱللَّهُ غَفُوراً } في حق من أخطأ ونسي ثمَّ ذكر فتاب { رَّحِيماً } [الأحزاب: 5] عليه يقبل توبته\n ويغفر ذاته\n\n\nثمَّ أشار سبحانه إلى تأديب كل من الأمم مع نبيه المؤيَّد من عنده سبحانه بأنواع التأييدات\n والمعجزات الخارقة للعادات\n المبعوث إليهم\n لإرشادهم وتكميلهم\n وأمرهم بحسن الأدب معهم والمحافظة على خدمتهم وحرمتهم\n\n\nوكيف لا يحسنون الأدب من الأنبياء والرسل - صلوات الله عليهم - إذ كل نبي بالنسبة إلى أمته كالأب المشفق العطوف معهم\n بل هو خير آبائهم يرشدهم إلى ما هو أصلح لهم في دينهم الذي هو حياتهم الحقيقية\n فلهم أن يكونوا معه في مقام التذلل والانكسار التام\n والانخفاض المفرط بأضعاف ما وجب عليهم من حقوق الولد النسبي\n إذ آثار تربية الأنبياء مؤبدة مخلدة\n وآثار تربية هؤلاء الآباء متناهية منقطعة\n وإن ترتب على تأديبهم وانخافضهم معه من المثوبة الأخروية\n فإنما هي راجعة إلى تربية نبيهم\n\n\nولا شك أن نبينا صلى الله عليه وسلم أفضل الأنبياء\n وأكملهم في التربية والإرشاد\n فيكون أبوته أيضاً أكمل\n وإشفاقه ومرحمته لأمته التي هي أفضل الأمم أتم وأوفر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: الدعاء { أقْسَطُ } أعدل { عند الله }\n بيّن أن دعاءهم لآبائهم هو أدخل الأمرين في العدل\n وقيل: كان الرجل في الجاهلية إذا أعجبه ولد الرجل ضمّه إليه\n وجعل له مثل نصيب الذكر من أولاده\n من ميراثه\n وكان ينسب إليه\n فيقال: فلان بن فلان\n { فإن لم تعلموا آباءهم } أي: فإن لم تعلموا لهم آباء تنسبونهم إليهم\n { فإِخوانُكُم في الدين ومواليكم } أي: فهم إخوانكم في الدين\n وأولياؤكم فيه\n فقولوا: هذا أخي\n وهذا مولاي\n ويا أخي\n ويا مولاي\n يريد الأخوة في الدين والولاية فيه\n { وليس عليكم جناح فيما أخطأتم به } أي: لا إثم عليكم فيما فعلتموه من ذلك\n مخطئين جاهلين\n قبل ورود النهي\n أو بعده\n نسياناً\n { ولكن ما تعمَّدَتْ قلوبُكم } أي: ولكن الإثم فيما تعمِّدتموه بعد النهي\n أو: لا إثم عليكم إذا قلتم لولد غيركم: يا بنيّ\n على سبيل الخطأ\n أو: الشفقة\n ولكن إذا قلتموه متعمدين على وجه الانتساب\n { وكان الله غفوراً رحيماً } لا يؤاخذكم بالخطأ\n ويقبل التوبة من المعتمِّد\n الإشارة: العبد إنما له قلب واحد\n إذا أقبل به على مولاه أدبر عن ما سواه\n وملأه اللهُ تعالى بأنواع المعارف والأسرار\n وأشرقت عليه الأنوار\n ودخل حضرة الحليم الغفار\n وإذا أقبل به على الدنيا أدبر عن الله\n وحُشي بالأغيار والأكدار\n وأظلمت عليه الأسرار\n وطبع فيه صور الكائنات\n فّحُجِبَ عن المُكَوِّنِ\n وكان مأوى للخواطر والوساوس\n فلم يَسْوَ عند الله جناح بعوضة\n قال القشيري: القلب إذا اشتغل بشيء اشتغل عما سواه\n فالمشتغلُ بما مِنَ العَدَمِ منفصلٌ عَمن له القِدَمُ\n والمتصل بقلبه بِمَنْ نَعْتُهُ القِدَم مشتغلٌ عمِّا من العدم\n والليل والنهار لا يجتمعان\n والغيبُ والغيرُ لا يلتقيان\n هـ\n وقوله تعالى: { وما جعل أزواجكم\n\n\n } الآية\n يمكن أن تكون الإشارة فيها إلى أنَّ مَنْ ظاهَرَ الدنيا\n وتباعد عنها لا يحل له أن يرجع\n ويتخذّها أُمًّا في المحبة والخدمة\n\nوقوله تعالى: { وما جعل أدعياءكم أبناءكم\n\n }: تشير إلى أنه لا يحل أن يَدَّعِيَ الفقيرُ حالاً\n أو مقاماً\n ما لم يتحقق به\n وليس هو له\n أوْ: يَنْسِبَ حِكْمَةً أوْ عِلْماً رفيعاً لنفسه\n وهو لغيره\n { ادعوهم لآبائهم هو أقسط عند الله }\n وقوله: { فإن لم تعلموا آباءهم فإخوانكم في الدين\n\n }: إخوان الدين أّوْلَى\n وإخوان الطريق أحب وأصفى\n قال القشيري: وقرابةُ الدين\n في الشكلية\n أولى من قرابة النَّسَب\n وأنشدوا\n\nثم ذكر أبوّة النبي صلى الله عليه وسلم وأمومة أزواجه لجميع أمَّته\n فقال: { ٱلنَّبِيُّ أَوْلَىٰ بِٱلْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "104:9",
      "similarity": 0.5303669936155042
    },
    {
      "verse": "4:93",
      "similarity": 0.44285091219661027
    },
    {
      "verse": "13:2",
      "similarity": 0.3438134537012281
    },
    {
      "verse": "12:97",
      "similarity": 0.28806231119744957
    },
    {
      "verse": "31:10",
      "similarity": 0.26911303973598766
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/33:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/33:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/33:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}