{
  "chapter": "الأحزاب",
  "text": "ان تبدوا۟ شيـا او تخفوه فان الله كان بكل شىء عليما",
  "translations": [
    {
      "translation": "Whether you divulge a thing or conceal it, Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you discuss a thing or conceal it, surely God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It does not matter) whether you disclose something or conceal it, for Allah certainly knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal something or hid it, God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you disclose a thing or keep it hidden – then indeed Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal anything or conceal it, verily, Allah is Ever All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do a thing openly or do it in secret, then surely Allah is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal anything, or whether you conceal it, surely God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether ye divulge a thing or keep it hidden, lo! Allah is ever Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal anything or hide it, God is aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether ye disclose a thing or conceal it, verily Allah is of everything ever Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you disclose anything or hide it, Allah indeed knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether ye reveal anything or conceal it, verily Allah has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal anything or conceal it, verily, Allah is Ever AllKnower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal a thing or conceal it, Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you declare a thing, or hide it, God is Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you reveal a thing or conceal it, indeed Allah is ever, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:54] Whether you disclose anything or keep it hidden, regarding marrying them after him, truly God has knowledge of all things, and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whether ye divulge a thing) of this intent (or keep it hidden, lo! Allah is ever Knower) He takes you to task (of all things) regarding all things, whether they are made public or kept hidden.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن تُبدوا شيئاً } من أذى رسول الله صلى الله عليه وسلم، أو نكاح أزواجه، { أو تُخفوه } في أنفسكم، { فإِنَّ الله كان بكل شيءٍ عليماً } فيُعاقبكم عليه\n رُوي أن رجلاً من الصحابة قال: لئن قُبض النبي صلى الله عليه وسلم لأنكحنَّ عائشة، فنزلت، فَحُرّمن\n وفيه نزلت: { إن تبدوا شيئاً } أي: من نكاح عائشة، { أو تخفوه\n\n\n } إلخ\n وكان ـ عليه الصلاة والسلام ـ مَلَك قتيبة بنت الأشعث بن قيس، ولم يبنِ بها، فتزوجها عكرمة بن أبي جهل، بعد ذلك، فهمَّ به أبو بكر، وشقّ عليه، حتى قال له عمر: يا خليفة رسول الله، ليست من نسائه، ولم يُخيرها، ولم يحجبها، وقد برأها الله منه بالردة، حين ارتدت مع قومها، فسكن أبو بكر\n وقال الزهري: إن العالية بنت ظبيان، التي طلق النبيُّ صلى الله عليه وسلم تزوجت رجلاً وولدت له قبل أن يحرم أزواج النبي صلى الله عليه وسلم\n  الإشارة: مذهب الصوفية تشديد الأدب مع الأشياخ، فإذا مات الشيخ، أو طلَّق امرأة بعد الدخول، فلا يتزوجها أحد من تلامذته أبداً، تعظيماً وأدباً مع الشيخ\n وأما تزوج بنت الشيخ فلا بأس، إن قدر على القيام بالأدب معها، والصبر على أذاها، وإلا فالبُعد أحسن وأسلم، والله تعالى أعلم\n قال القشيري: قوله تعالى: { إن تبدوا شيئاً\n\n\n } الآية: حِفْظُ القلبِ مع الله تعالى، ومراعاةُ الأمر بينه وبين الله على الصِّحَّةِ في دوام الأوقات لا يَقْوى عليه إلا الخواصُّ، من أهل الحضور\n هـ\n ثم رخص للأقارب أن يدخلوا على أزواج النبي صلى الله عليه وسلم فقال: { لاَّ جُنَاحَ عَلَيْهِنَّ فِيۤ آبَآئِهِنَّ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:284",
      "similarity": 0.795477074620378
    },
    {
      "verse": "3:29",
      "similarity": 0.7906251356926003
    },
    {
      "verse": "4:149",
      "similarity": 0.7039321782984688
    },
    {
      "verse": "6:28",
      "similarity": 0.6001387015883914
    },
    {
      "verse": "3:5",
      "similarity": 0.572124240171255
    }
  ]
}