{
  "chapter": "الأحزاب",
  "text": "ترجى من تشاء منهن وتـوى اليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك ذلك ادنى ان تقر اعينهن ولا يحزن ويرضين بما ءاتيتهن كلهن والله يعلم ما فى قلوبكم وكان الله عليما حليما",
  "translations": [
    {
      "translation": "You may defer the turn of any of your wives you like, and may take any other you desire. There is no harm if you take any of those (whose turn) you had deferred. This would be better as it would gladden their hearts and they will not grieve, and each will be happy with what you have given her. God knows what is in your heart, for He is all-wise and benign.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them you may put off any of them you wish, and you may take any of them whom you wish, and you may call back any of those whom you had (temporarily) set aside: there will be no blame on you (on this account). It is likelier that they will thus be comforted, and will not grieve, and every one of them will be well-pleased with what you give them. Allah knows what is in your hearts. Allah is All-Knowing, All-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may refuse whichever (of the woman who offer themselves to you) as you want and accept whichever of them you wish. There is no blame on you if you marry (one whom you had refused previously). This would be more delightful for them. They should not be grieved but should be happy with whatever you have given to every one of them. God knows what is in your hearts. God is All-knowing and All-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put back in the order whom you wish among them and give your proximity to whomever you wish; and if you incline towards one whom you had set aside, there is no sin upon you in it; this command is closer to their eyes remaining soothed and not grieving, and all of them remaining happy with whatever you give them; and Allah knows what is in the hearts of you all; and Allah is All Knowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can postpone whom you will of them, and you may receive whom you will. And whomsoever you desire of those whom you have set aside, it is no sin on you: that is better that they may be comforted and not grieved, and may all be pleased with what you give them. Allah knows what is in your hearts. And Allah is Ever All-Knowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may put off whom you please of them, and you may take to you whom you please, and whom you desire of those whom you had separated provisionally; no blame attaches to you; this is most proper, so that their eyes may be cool and they may not grieve, and that they should be pleased, all of them with what you give them, and Allah knows what is in your hearts; and Allah is Knowing, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou mayest put off whom thou wilt of them, and whom thou wilt thou mayest take to thee; and if thou seekest any thou hast set aside there is no fault in thee. So it is likelier they will be comforted, and not sorrow, and every one of them will be well-pleased with what thou givest her. God knows what is in your hearts; God is All-knowing, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou canst defer whom thou wilt of them and receive unto thee whom thou wilt, and whomsoever thou desirest of those whom thou hast set aside (temporarily), it is no sin for thee (to receive her again); that is better; that they may be comforted and not grieve, and may all be pleased with what thou givest them. Allah knoweth what is in your hearts (O men), and Allah is ever Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer [the turn of] any of them that you please, and you may receive any you please: and there is no blame on you if you invite one whose [turn] you have set aside. That is more proper, so that their eyes may be cooled, and so that they may not grieve, and so that they will be satisfied with what you have given them. God knows what is in your hearts; and God is all knowing, and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou myest put off such of them as thou wilt, and thou mayest take unto thee such of them as thou wilt; and whomsoever thou desirest if such as thou hadst set aside there is no blame upon thee. This is likelier to cool their eyes and not let them grieve and to keep them pleased with whatsoever thou shalt give every one of them. Allah knoweth that which is in your hearts. and Allah is ever Knowing, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may put off whichever of them you wish and consort with whichever of them you wish, and there is no sin upon you [in receiving again] any [of them] whom you may seek [to consort with] from among those you have set aside [earlier]. That makes it likelier that they will be comforted and not feel unhappy, and all of them will be pleased with what you give them. Allah knows what is in your hearts, and Allah is all-knowing, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou mayest defer (the turn of) any of them that thou pleasest, and thou mayest receive any thou pleasest: and there is no blame on thee if thou invite one whose (turn) thou hadst set aside. This were nigher to the cooling of their eyes, the prevention of their grief, and their satisfaction - that of all of them - with that which thou hast to give them: and Allah knows (all) that is in your hearts: and Allah is All-Knowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You (O Muhammad SAW) can postpone (the turn of) whom you will of them (your wives), and you may receive whom you will. And whomsoever you desire of those whom you have set aside (her turn temporarily), it is no sin on you (to receive her again), that is better; that they may be comforted and not grieved, and may all be pleased with what you give them. Allah knows what is in your hearts. And Allah is Ever AllKnowing, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer any of them (your wives) if you please and invite any of them if you please. If you seek any you have put aside there is no fault in you. So that it is likelier they will be comforted, and not sorrow, and every one of them will be pleased, and all are pleased with what you give them. Allah knows what is in your hearts. Allah is the Knower, the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may defer any of them you wish, and receive any of them you wish. Should you desire any of those you had deferred, there is no blame on you. This is more proper, so that they will be comforted, and not be grieved, and be content with what you have given each one of them. God knows what is within your hearts. God is Omniscient and Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You, [O Muhammad], may put aside whom you will of them or take to yourself whom you will. And any that you desire of those [wives] from whom you had [temporarily] separated - there is no blame upon you [in returning her]. That is more suitable that they should be content and not grieve and that they should be satisfied with what you have given them - all of them. And Allah knows what is in your hearts. And ever is Allah Knowing and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:51] You may put off (read turji’ or turjī), you may postpone [consorting with], whomever of them you wish, namely, of your wives, from their turn [for intimacy], and consort, embrace [in conjugality], whomever you wish, of them, and come unto her, and as for whomever you may desire of those whom you have set aside, from their share, you would not be at fault, to desire her and consort with her [again]. He was given the choice in this respect after it had been obligatory for him to give each wife her [equal] share [of conjugality]. That, freedom of choice, makes it likelier that they will be comforted and not grieve, and that they will be satisfied with what you give them, of what has been mentioned of your freedom to choose [whom to consort with], every one of them (kulluhunna emphasises the subject of [the verb] yardayna, ‘they will be satisfied’) will be well-pleased with what you give her. And God knows what is in your hearts, with respect to [your] women and [your] preferring some [to others]. We have given you the freedom to choose [from among them] in order to make it easier for you to have what you desire. And God is Knower, of His creatures, Forbearing, in refraining from punishing them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thou canst defer) you can leave (whom thou wilt of them) from among the daughters of your aunts from your father's side, and or the daughters of your uncles from your mother's side, and not marry them (and receive unto thee whom thou wilt) and marry them, (and whomsoever thou desirest) to marry (of those whom thou hast set aside (temporarily), it is no sin for thee (to receive her again)) it is also said that this could be understood in this manner: you can abstain from whoever you will of your wives and you can go to whoever you will of your wives and there is no sin for you in abstaining from some and going to others; (that) the widening of the scope and dispensation (is better; that they may be comforted) when they know that this widening of scope is from Allah (and not grieve) for fear of divorce, (and may all be pleased with what thou givest them) of sharing your physical presence with them. (Allah knoweth what is in your hearts) whether it is contentment or resentment; (and Allah is Knower) of your righteousness and theirs, (Clement) in that which He explained to you and forgave you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ } يعني تؤخر { وَتُؤْوِيۤ إِلَيْكَ مَن تَشَآءُ } معناه تَضمُّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا وسّعنا يا أكمل الرسل أمر نكاحك، وأبحنا لك ما لم يبح لغيرك، فلك الخيار في أزواجك { تُرْجِي } أي: تؤخر وتترك مضاجعة { مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِيۤ } أي: تلصق وتضم { إِلَيْكَ مَن تَشَآءُ } منهم بلا حرج وضيق، بل { وَمَنِ ٱبْتَغَيْتَ } وطلبت نكاحها { مِمَّنْ عَزَلْتَ } وطلقت تطليقاً ثلاثاً أو أقل { فَلاَ جُنَاحَ } ولا إثم { عَلَيْكَ } أن تعيد إلى نكاحها بلا تحليل وتزويج للغير؛ إذ من جملة خواصك: تحريم مدخولتك على الغير مطلقاً { ذَلِكَ } أي: تفويض أمورهن إليك { أَدْنَىٰ } وأقرب { أَن تَقَرَّ أَعْيُنُهُنَّ } إذ نسبتك إليهن حينئذٍ على السواء، بلا ميل منكر وترجيح\n\n\n\n\n{ وَ } المناسب لهن أن { لاَ يَحْزَنَّ } بعد التفويض، بل { وَ } لهن أن { يَرْضَيْنَ بِمَآ آتَيْتَهُنَّ كُلُّهُنَّ } إذ لا تتفاوت نسبتك إليهن أصلاً؛ لأنك مجبول على العدل القويم والصراط المستقيم، سيما بين أزواجك المنتسبين إليك كلهن بنسبة واحدة { وَٱللَّهُ } المطلع لضمائر عباده { يَعْلَمُ مَا } يجري { فِي قلُوبِكُمْ } وضمائركم أيها المؤمنون من الميل إلى بعض النساء دون بعض، ونبينا صلى الله عليه وسلم منزه عن هذا الميل وأمثاله { وَكَانَ ٱللَّهُ } المراقب لأحوالكم { عَلِيماً } بما جرى عنه في صدوركم من الميل إلى الهوى { حَلِيماً } [الأحزاب: 51] ينتقم عليه ولكن لا يعجل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله لرسوله صلى الله عليه وسلم: { تُرْجي من تشاء منهن } أي: تؤخرها في القسمة، { وتُؤوي إِليك من تشاء } أي: تضمها إليك، والمعنى: تترك مضاجعة مَن تشاء منهن وتضاجع مَن تشاء، فقد خيّره الله في القسمة وعدمها\n قال أبو رزين: لما نزلت آية التخيير أشفقن أن يُطلَّقن، فقلن: يا نبيَّ الله اجعل لنا من مالك ونفسك ما شئت، ودَعْنا على حالنا، فكان ممن أرجى منهن: سودة، وجويرية، وصفية، وميمونة، وأم حبيبة، فكان يقيم لهن ما يشاء، وكان ممن آوى إليه عائشة، وحفصة، وأم سلمة، وزينب، فكان يقسم لهن بالسوية، لا يفضل بعضهن على بعض\n فآوى أربعاً وأرجى خمساً\n وقيل: إنه كان صلى الله عليه وسلم يسوّي بين الجميع في القسم، إلا سودة، فإنها وهبت ليلتها لعائشة، حين همّ بطلاقها، وقالت: لا تطلّقني حتى أُحْشَر في زمرتك وفي نسائك\n والجمهور على أنه صلى الله عليه وسلم كان يعدل في القسمة بين نسائه، أخذاً منه بأفضل الأخلاق، مع أن الله خيّره\n وقيل: { تُرجي من تشاء } أي: تطلق من تشاء منهن، وتُمسك من تشاء\n وقيل: تترك تزوج من شئت من أمتك، وتتزوج من شئت\n { ومن ابتغيتَ مِمَّنْ عزلتَ فلا جُناحَ عليك } أي: ومَن دعوت إلى فراشك، وطلبت صحبتها، ممن عزلت عن نفسك بالإرجاء، فلا ضيق في ذلك، أي: ليس إذا عزلتها من القسمة، أو من العصمة، لم يجز لك ردّها إلى نفسك، بل افعل ما شئت، فلا حرج عليك\n { ذلك } التفويض إلى مشيئتك { أَدْنَى أَن تَقَرَّ أَعْيُنهنَّ ولاَ يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُن } أي: هو أقرب إلى قرة أعينهن، وقلة حزنهن، ورضاهن جميعاً لأنه إذا علمن أنّ هذا الحكم من عند الله اطمأنت نفوسهنّ، وذهب التغاير، وحصل الرضا، وقرّت العيون\n  قلت: والذي يظهر أن مَن أرجاه صلى الله عليه وسلم من النساء إنما كان بوحي، ومَن ضمه كذلك إذ لا يتصرف إلا بإذن من الله، فإذا عَلِمَ النساءُ أن الإرجاء والإيواء كان بوحي من الله رضين بذلك، وقرّت أعينهن، وزال تغايرهن، وأما مطلق التفويض إليه فقط، فلا يقطع الغيرة في العادة، فالإشارة تعود إلى حكم الإرجاء والإيواء فتأمله\n و \" كلهن \": تأكيد ضمير \" يَرْضَيْن \"\n { واللهُ يعلم ما في قلوبكم } من أمر النساء، والميل إلى بعضهن، أو: يعلم ما في قلوبكم من الرضا بحُكم الله والتفويض إليه، ففيه تهديد لمَن لم يرضَ منهم بما دبَّر الله، وفوّض إلى رسوله، { وكان الله عليماً } بذات الصدور، { حليماً } لا يُعاجل بالعقوبة، فهو حقيق بأن يُتقى ويُحذر\n الإشارة: إذا تحقق فناء العبد وزواله، وتكملت ولايته، كان مفوضاً إليه في الأمور، يفعل ما يشاء، ويترك ما يشاء، لم يبقَ عليه تحجير، ولم يتوجه إليه عتاب لأن العبد المملوك إذا تحققت محبة سيده له، كتب له عقد التحرير\n\n\nوشاهده حديث:\n\n \" إِذَا أحَبَّ الله عَبْداً لمْ يضُره ذَنْبٌ \" \n\n،وحديث البخاري:\n\n \" لعلَّ الله اطَّلَعَ على أهلِ بَدْرٍِ فقال: اعملوا ما شئتم، فقد غَفَرتُ لكُمْ \" \n\nوسببه معلوم\n وفي القوت عن زيد بن أرقم: إن الله عزّ وجل ليُحب العبد، حتى يبلغ من حبه أن يقول له: اصنع ما شئت، فقد غفرت لك\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: يبلغ الولي مبلغاً يُقال له: أصحبناك السلامة، وأسقطنا عنك الملامة، فاصنع ما شئت\n ومصداقه من كتاب الله: قوله تعالى في حق سليمان عليه السلام:\n\n[ص: 39]\n وهذا وإن كان للنبي من أجل العصمة، فلَمِنْ كان من الأولياء في مقام الإمامة قسط منه، من أجل الحفظة\n وقال أيضاً رضي الله عنه في بعض أدعيته: وأدرج أسمائي تحت أسمائك، وصفاتي تحت صفاتك، وأفعالي تحت أفعالك، درج السلامة، وإسقاط الملامة، وتنزُل الكرامة، وظهور الإمامة\n هـ\n فإذا اندرجت أسماء العبد وصفاته وأفعاله تحت أسماء الرب، وصفاته، وأفعاله، لم يبقَ للعبد وجود أصلاً، وكان الفعل كله بالله، ومن الله، وإلى الله\n وهذا مقام عزيز، لا يناله إلا الأفراد من أهل الفناء في الله، والبقاء بالله، وقد غطى وصفهم بوصفه، ونعتهم بنعته، فغيَّبهم عن اسمهم ورسمهم، فهم بالله فيما يفعلون ويذرُون\n والله تعالى أعلم\n  ثم قال تعالى: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ\n\n\n }\n",
      "translations": []
    }
  ]
}