{
  "chapter": "الأحزاب",
  "text": "يايها النبى قل لازوجك وبناتك ونساء المؤمنين يدنين عليهن من جلبيبهن ذلك ادنى ان يعرفن فلا يؤذين وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "O Prophet! Tell your wives and daughters and the women of the muminun to draw their outer garments closely round themselves. This makes it more likely that they will be recognised and not be harmed. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, tell your wives and daughters, and the women of the faithful, to draw their wraps a little over them. They will thus be recognised and no harm will come to them. God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, enjoin your wives and your daughters and the believing women, to draw a part of their outer coverings around them. It is likelier that they will be recognised and not molested. Allah is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, tell your wives, daughters, and the wives of the believers to cover their bosoms and breasts. This will make them distinguishable from others and protect them from being annoyed. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Command your wives and your daughters and the women of the Muslims to cover their faces with a part of their cloaks; this is closer to their being recognised and not being harassed; and Allah is Oft Forgiving, Most Merciful. (It is incumbent upon women to cover themselves properly.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell your wives and your daughters and the women of the believers to draw their Jalabib over their bodies. That will be better that they should be known so as not to be annoyed. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! say to your wives and your daughters and the women of the believers that they let down upon them their over-garments; this will be more proper, that they may be known, and thus they will not be given trouble; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, say to thy wives and daughters and the believing women, that they draw their veils close to them; so it is likelier they will be known, and not hurt. God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell thy wives and thy daughters and the women of the believers to draw their cloaks close round them (when they go abroad). That will be better, so that they may be recognised and not annoyed. Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell your wives and your daughters and wives of the believers that they should draw over themselves some of their outer garments [when in public], so as to be recognized and not harmed. God is most forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! say unto thy wives and thy daughters and women of the believers that they should let down upon them their wrapping- garments. That would be more likely to distinguish them so that they will not be affronted. And Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell your wives and your daughters and the women of the faithful to draw closely over themselves their chadors [when going out]. That makes it likely for them to be recognized and not be troubled, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell thy wives and daughters, and the believing women, that they should cast their outer garments over their persons (when abroad): that is most convenient, that they should be known (as such) and not molested. And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell your wives and your daughters and the women of the believers to draw their cloaks (veils) all over their bodies (i.e. screen themselves completely except the eyes or one eye to see the way). That will be better, that they should be known (as free respectable women) so as not to be annoyed. And Allah is Ever OftForgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, tell your wives, your daughters and the believing women to draw their veils close to them, so it is likelier they will be known, and not hurt. Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Tell your wives, and your daughters, and the women of the believers, to lengthen their garments. That is more proper, so they will be recognized and not harassed. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, tell your wives and your daughters and the women of the believers to bring down over themselves [part] of their outer garments. That is more suitable that they will be known and not be abused. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:59] O Prophet! Tell your wives and daughters and the women of the believers to draw their cloaks closely over themselves (jalābīb is the plural of jilbāb, which is a wrap that covers a woman totally) — in other words, let them pull part of it [also] over their faces, leaving one eye [visible], when they need to leave [the house] for something. That makes it likelier that they will be known, to be free women, and not be molested, by being approached. In contrast, slavegirls did not use to cover their faces and so the disbelievers used to pester them. And God is Forgiving, of any occasion in the past when they may have neglected to cover themselves, Merciful, to them in His veiling them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O Prophet! Tell thy wives and thy daughters and the women of the believers to draw their cloaks close round them) to cover their necks and bosoms ((when they go abroad). That will be better, that so they may be recognised) as free women (and not annoyed) and not be harmed by the fornicators. (Allah is ever Forgiving) He forgives what they have done in the past, (Merciful) He shows mercy on them regarding that which they will do in the future.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى آداب النساء\n وصيانتهن عن الرجال واستحيائهن منهم\n ليسلمن عن افتراء المفترين ورمي الرامين\n فقال منادياً لحبيبه صلى الله عليه وسلم ليبلِّغ إلى أمته وأزواجه وأزواجهم أيضاً: { يٰأَيُّهَا ٱلنَّبِيُّ } المؤيد من عندنا\n المبعوث إلى أرشاد البرايا ذكورهم وإناثهم { قُل لأَزْوَاجِكَ } أولاً على سبيل الشفقة والنصيحة { وَبَنَاتِكَ } أيضاً { وَ } عموم { نِسَآءِ ٱلْمُؤْمِنِينَ } إذا برزن لحوائجهن أحياناً { يُدْنِينَ } ويغطين { عَلَيْهِنَّ } أي: على أيديهن وأرجلهن وجميع معاطفهن { مِن } فواضل { جَلاَبِيبِهِنَّ } وملاحفهن\n بحيث لا يبدو من أعضائهن شيء سوى العينين\n بل عين واحدة\n ليتميزن بها عن الإمامء والبغيات المريبات\n المطمعات لأهل الفجور والفسوق { ذٰلِكَ } التستر والتغطي على الوجه الأتم الأبلغ { أَدْنَىٰ } وأقرب { أَن يُعْرَفْنَ } ويُميزن أولئك الحرائر والعفائق عن الإماء والمربيات\n وبعدما عرفن { فَلاَ يُؤْذَيْنَ } ولا يفترين بهتاناً { وَكَانَ ٱللَّهُ } المطلع لما اختلج في جوانحهن { غَفُوراً } لهن بعدما تُبن إلىالله وأَنَبْنَ { رَّحِيماً } [الأحزاب: 59] يقبل توبتهن ويرحم عليهن إن أخلصن فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يا أيها النبي قل لأزواجك وبناتِك ونساءِ المؤمنين يُدْنِينَ عليهن من جَلابِيبهن } أي: يُرخين على وجوههنّ من جلابيبهن فيغطين بها وجوهَهن. والجلباب: كل ما يستر الكل، مثل الملحفة، والمعنى: قل للحرائر يُرخين أرديتهن وملاحفَهن ويغَطين بها وجوههن ورؤوسهن، ليعلم أنهن حرائر فلا يؤذين. و { ذلك أَدْنَى } أي: أقرب وأجدر، { أن يُعْرَفْنَ } من الإماء { فلا يُؤْذَين } وذلك أن النساء في أول الإسلام كن على زيهنَّ في الجاهلية متبذّلات، تبرز المرأةُ في درج وخمار، لا فَصْل بين الحُرّة والأَمَة. وكان الفتيان يتعرّضون للإماء، إذا خرجن بالليل لقضاء حاجتهنّ في النخيل والغَيْضات، وكن يخرجن مختلطات مع الحرائر، فربما تعرّضوا للحُرّة، يحسبونها أَمَة، فأُمِرن أن يخالفن بزيهنّ عن زي الإماء بلباس الجلابيب، وستر الرؤوس والوجوه، فلا يطمع فيهنّ طامع. قال ابن عباس رضي الله عنه: أمر الله تعالى نساء المؤمنين أن يغطين رؤوسهن ووجوههن بالجلابيب، ويُبدين عيناً واحدة. قلت: وقد مرَّ في سورة النور أن الوجه والكفين ليس بعورة، إلا لخوف الفتنة، وأما الإماء فلا تسترن شيئاً إلا ما بين السرة والركبة، كالرجل. قال أنس: مرتْ جارية متقنعة بعمر بن الخطاب فعلاها بالدرة، وقال: يا لكاع أنت تشبهين بالحرائر، فألقِ القناع، { وكان اللهُ غفوراً } لِما سلف منهن من التفريط، { رحيماً } بتعليمهن آداب المكارم. الإشارة: ينبغي لنساء الخواص أن يتميزن من نساء العامة بزيادة الصَوْن والتحفُّظ، وقلة الخروج، فإذا لزمهنَّ الخروج، فليخرجن في لباس خشين، بحيث لا يُعرفن، أو يخرجن ليلاً. وثبت أن زوجة الشيخ أبي الحسن الشاذلي رضي الله عنه لم تخرج من دارها إلا خرجتين خرْجة حين زُفت إلى زوجها، وخرجة إلى المقابر. نفعنا الله ببركاتهم. آمين.  ثم هدّد المنافقين حيث كانوا يؤذوان رسول الله صلى الله عليه وسلم والمؤمنين، فقال: { لَّئِن لَّمْ يَنتَهِ ٱلْمُنَافِقُونَ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:64",
      "similarity": 0.524655723226085
    },
    {
      "verse": "2:263",
      "similarity": 0.1725047226694854
    },
    {
      "verse": "9:61",
      "similarity": 0.16080578393535
    },
    {
      "verse": "33:69",
      "similarity": 0.15059946297706397
    },
    {
      "verse": "6:34",
      "similarity": 0.14369627550511813
    }
  ]
}