{
  "chapter": "الأحزاب",
  "text": "والذين يؤذون المؤمنين والمؤمنت بغير ما اكتسبوا۟ فقد احتملوا۟ بهتنا واثما مبينا",
  "translations": [
    {
      "translation": "Those who slander believing men and women for what they have not done, will bear the burden of calumny and clear iniquity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who cause hurt to believing men and to believing women have invited upon themselves a calumny and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who annoy the believing men and women without reason will bear the sin for a false accusation, a manifest offense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who unnecessarily harass Muslim men and women, have burdened themselves with slander and open sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who annoy believing men and women undeservedly, they bear the crime of slander and plain sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who speak evil things of the believing men and the believing women without their having earned (it), they are guilty indeed of a false accusation and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who hurt believing men and believing women, without that they have earned it, have laid upon themselves calumny and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who malign believing men and believing women undeservedly, they bear the guilt of slander and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who affront believing men and believing women without their having deserved it [done any wrong] shall bear the weight of slander and flagrant sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who annoy the believing men and the believing women, without their earning it, shall surely bear the guilt of calumny and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who offend faithful men and women undeservedly, certainly bear the guilt of slander and flagrant sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who annoy believing men and women undeservedly, bear (on themselves) a calumny and a glaring sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who annoy believing men and women undeservedly, bear on themselves the crime of slander and plain sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hurt believing men and believing women undeservedly, shall bear the guilt of slander and a major sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who harm believing men and believing women, for acts they did not commit, bear the burden of perjury and a flagrant sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who harm believing men and believing women for [something] other than what they have earned have certainly born upon themselves a slander and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:58] And those who cause hurt to believing men and believing women without the latter’s having done anything, [those who] accuse them of what they have not done, have verily borne [the guilt of] calumny, they have borne lies, and [the burden of] manifest sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who malign believing men) the reference here is to Safwan (and believing women) i.e. 'A'ishah by accusing them of unchastity (undeservedly) when they are chaste, (they bear the guilt of slander and manifest sin) it is also said that this was revealed about a group of fornicators in Medina who used to harm, by their acts, the believing men and women. Allah commanded them to cease their harm and they complied.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أردف سبحانه إيذاءه صلى الله عليه وسلم بإيذاء المؤمنين فقال: { وَٱلَّذِينَ يُؤْذُونَ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } بذمائم الأفعال والأقوال، وقبائح الحركات { بِغَيْرِ مَا ٱكْتَسَبُواْ } أي: بغير جريمة صدرت عنهم واستحقوا الجناية عليها { فَقَدِ ٱحْتَمَلُواْ } وتحملوا هؤلاء المؤذين المفترين { بُهْتَاناً } جالباً لأنواع العقوبات { وَإِثْماً مُّبِيناً } [الأحزاب: 58] ظاهراً عظيماً مستعقباً، مستتبعاً لأسوأ الجزاء، وأشد العقاب والنكال؛ إذ رمي المحصنات من أفحش الجنابات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين يُؤذون المؤمنين والمؤمنات بغير ما اكتسبوا } بغير جناية يستحقون بها الإيذاء، { فقد احتملوا بُهتاناً } كذباً { وإِثماً مبيناً } ظاهراً، وإنما أطلق في إيذاء الله ورسوله، وقيّد إيذاء المؤمنين والمؤمنات لأن إيذاء الله ورسوله لا يكون إلا بغير حق، وأما إيذاء المؤمنين فمنه ما يكون بحق، كالحدّ والتعزير، ومنه باطل\n وقيل: نزلت في ناس من المنافقين، كانوا يؤذون عليًّا رضي الله عنه، ويُسْمِعُونه، وقيل: في زُناة المدينة، كانوا يمشون في طرق المدينة، ويتبعون النساء إذا تبرزن بالليل لقضاء حوائجهن، فيغمزون المرأة، فإن سكتتْ اتبعوها، وإن زجرتهم انتهوا\n وعن الفضيل: لا يحلّ أن تؤذي كلباً أو خنزيراً بغير حق، فكيف بالمؤمنين؟ هـ\n الإشارة: إذاية الله ورسوله هي إذاية أوليائه، ونقله الثعلبي عن أهل المعاني، فقال: فأراد الله تعالى المبالغة في النهي عن أذى أوليائه، فجعل أذاهم أذاه\n هـ\n ويؤيده الحديث القدسي:\n\n \" مَن آذى لي وليًّا فقد بارزني بالمحاربة \" \n",
      "translations": []
    }
  ]
}