{
  "chapter": "الأحزاب",
  "text": "يايها الذين ءامنوا۟ لا تكونوا۟ كالذين ءاذوا۟ موسى فبراه الله مما قالوا۟ وكان عند الله وجيها",
  "translations": [
    {
      "translation": "O you who believe, do not be like those who maligned Moses, whilst God cleared him of what they alleged; and he was held in high esteem with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be like those who distressed Moses and then Allah declared him quit of the ill they spoke about him; and he had a high standing with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be like those who annoyed Moses. God proved him to be innocent of what they had said about him. Moses was a honorable person in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not be like the people who troubled Moosa – so Allah freed him from the allegations they had uttered; and Moosa is honourable in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be not like those who annoyed Musa, but Allah cleared him of that which they alleged, and he was honorable before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be not like those who spoke evil things of Musa, but Allah cleared him of what they said, and he was worthy of regard with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, be not as those who hurt Moses, but God declared him quit of what they said, and he was high honoured with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be not as those who slandered Moses, but Allah proved his innocence of that which they alleged, and he was well esteemed in Allah's sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not behave like those who slandered Moses. God cleared him of their allegations. He was honourable in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! be not like unto those who annoyed Musa; but Allah cleared him of that which they said, and he was in the sight of Allah illustrious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not be like those who offended Moses, whereat Allah cleared him of what they alleged, and he was distinguished in Allah’s sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be ye not like those who vexed and insulted Moses, but Allah cleared him of the (calumnies) they had uttered: and he was honourable in Allah's sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be not like those who annoyed Musa (Moses), but Allah cleared him of that which they alleged, and he was honourable before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be like those who hurt Moses. Allah cleared him of what they said. His face is honorable with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not be like those who abused Moses; but God cleared him of what they said. He was distinguished with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, be not like those who abused Moses; then Allah cleared him of what they said. And he, in the sight of Allah, was distinguished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:69] O you who believe, do not behave, towards your Prophet, as did those who harmed Moses — when they would say, for example, ‘The only reason he does not wash with us is that he has an inflammation in his testicles’ — whereat God absolved him of what they alleged: when Moses placed his robe on a rock to go to wash, the rock hurtled away with it until it came to a halt amid a group of men from the Children of Israel. As Moses chased it and took his robe to cover himself, they saw that he had no such inflammation (udra is an inflammation of the testicle). And he was distinguished in God’s sight. An instance of our Prophet (s) being subjected to hurt was when [on one occasion] while dividing up the spoils a man said to him, ‘This is a division that I do not want to please God!’, whereat the Prophet (s) became angered and said, ‘May God have mercy upon Moses, for truly he was hurt with worse than this, but endured’ — reported by al-Bukhārī.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Be not) in harming the Prophet (pbuh) (as those who slandered Moses) they accused him of having swollen testicles, (but Allah proved his innocence of that which they alleged, and he was well esteemed in Allah's sight) he has a high standing and status in Allah's sight.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم وصى سبحانه عموم المؤمنين بألاَّ يكونوا مع نبيهم صلى الله عليه وسلم مثل بني إسرائيل مع موسى - صلوت الرحمن عليه وسلامه - ولا يقصدوا أذاه صلى الله عليه وسلم كما قصدوا، ولا يرموه بشيء لا يليق بشأنه كما رموا به موسى عليه السلام؛ لأن معاشر الأنبياء كلهم معصومون عن الكبائر مطلقاً، بل عن الصغائر أيضاً، فلا بدَّ لمن آمن لهم ألاَّ يرموهم بمكروه، ولا يليق بشأنهم مع أنه سبحانه أظهر براءتهم وطهارة ذيلهم، فبقي إثم الافتراء والمراء على المفترين، فينتقم سبحانه عنهم منها ويأخذهم بها\n\n\n\n\nفقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بمحمد صلى الله عليه وسلم مقتضى إيمانكم به أن { لاَ تَكُونُواْ } قاصدين أذاه صلى الله عليه وسلم بنسبة المكروه المنكر إليه، وبتعبيره وتشنيعه بأمر صدر عنه ولم تفهموا سره { كَٱلَّذِينَ آذَوْاْ مُوسَىٰ } صلوات الله وسلامه عليه، فاغتم منها وتحزن حزناً شديداً { فَبرَّأَهُ ٱللَّهُ } المطلع على نجابة طينته وطهارى ذيله وأظهر طهارته { مِمَّا قَالُواْ } أي: من مقولهم؛ يعني: مؤداة ومضمونه\n\n\n\n\nوذلك أن قارون استأجر بغية بجعل كثير على أن تمري موسى عليه السلام بنفسها، فرموه بها، ثم أحضروها في المجلس؛ لتفضحه عليه السلام على رءوس الملأ، فأقرت لعصمته عليه السلام وأظهرت ما أعطوها من الجعل، فدعا موسى عليه، ففعل بهم وبما معهم سبحاه ما فعل من الخسف على ما مر في سورة \" القصص \" أو قذفوه بعيب في بدنه من برص أو أدرة، فبرأه الله سبحانه بأن تذهب الحجر بثيابه بين الملأ وهو يمشي على عقب ثيابه عرياناً يظهر، حتى يظهر براءته من العيب لهم { وَ } كيف لا يبرؤه سبحانه، ولا يظهر طهارته؛ إذ { كَانَ } موسى عليه السلام { عِندَ ٱللَّهِ } الذي اصطفاه للنوبة والرسالة والتكلم معه { وَجِيهاً } [الأحزاب: 69] في كمال الوجاهة والقربة؛ لذلك اختاره بسمع كلامه بلا واسطة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا لا تكونوا كالذين آذَوْا موسى } من بني إسرائيل { فبرأه اللهُ مما قالوا } وذلك أن بني إسرائيل كانوا يغتسلون عرايا، ينظر بعضهم إلى بعض، وكان موسى عليه السلام يستتر لشدة حيائه، فقالوا: ما يمنع موسى من الاغتسال معنا إلا أنه آدر ـ والأدْرَة: انتفاخ الأنثيين ـ أو: به عيب من برص أو غيره، فذهب يغتسل وحده، فوضع ثوبه على حجر، ففرّ الحجر بثوبه، فلجّ في أثره يقول: ثَوْبي حَجَر، ثوبي حجر! حتى نظروا إلى سوأته، فقالوا: والله ما بموسى من بأس، فقام الحجر من بعد ما نظروا إليه، وأخذ ثوبه، فطفق بالحجر ضرباً، ثلاثاً أو أربعاً\n وقيل: كان أذاهم: ادعاءهم عليه قتل أخيه\n قال عليّ رضي الله عنه: صعد موسى وهارون الجبل، فمات هارون، فقالت بنو إسرائيل: أنت قتلته\n وكان أشدَّ لنا حبًّا، وألين منك، فآذوه بذلك، فأمر الله تعالى الملائكة فحملته، حتى مرت به على بني إسرائيل، وتكلمت الملائكة بمماته، حتى تحققت بنو إسرائيل أنه قد مات، فبرّأ الله موسى من ذلك، ثم دفنوه\n فلم يطلع على قبره إلا الرَّخَم من الطير، وإن الله جعله أصم أبكم، وقيل: إنه على سرير في كهف الجبل\n وقيل: إن قارون استأجر امرأة مومسة، لتقذف موسى بنفسها على رأس الملأ، فعصمها الله، وبرأ موسى، وأهلك قارون\n وقد تقدّم\n { وكان عند الله وجيهاً } ذا جاه ومنزلة رفيعة، مستجاب الدعوة\n وقرأ ابن مسعود والأعمش \" وكان عبداً لله وجيهاً \"",
      "translations": []
    }
  ]
}