{
  "chapter": "الأحزاب",
  "text": "سنة الله فى الذين خلوا۟ من قبل ولن تجد لسنة الله تبديلا",
  "translations": [
    {
      "translation": "Such was the law of God among those before you; and you will not find any change in the law of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This has been Allah's Way with those who have gone before, and you shall find no change in Allah's Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was the tradition of God with those who lived before. There will never be any change in the tradition of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The tradition of Allah prevalent among those who passed away before; and you will never find the traditions of Allah changing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was the way of Allah in the case of those who passed away of old, and you will not find any change in the way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such has been) the course of Allah with respect to those who have gone before; and you shall not find any change in the course of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's wont with those who passed away before; and thou shall find no changing the wont of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was the way of Allah in the case of those who passed away of old; thou wilt not find for the way of Allah aught of power to change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such has been God's way with those who have gone before them. You shall find no change in the ways of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That hath been the dispensation of Allah with those who have passed away afore; and thou shalt not find in the dispensation of Allah any change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah’s precedent with those who passed away before, and you will never find any change in Allah’s precedent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such was) the practice (approved) of Allah among those who lived aforetime: No change wilt thou find in the practice (approved) of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was the Way of Allah in the case of those who passed away of old, and you will not find any change in the Way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such has been the way of Allah with those who have passed before them, and you shall find no change in the ways of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such has been God’s precedent with those who passed away before. You will find no change in God’s system.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] the established way of Allah with those who passed on before; and you will not find in the way of Allah any change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:62] God’s precedent, in other words, God has made this His precedent [in dealing], with those who passed away before, with regard to the hypocrites of past communities who used to alarm believers with their scaremongery, and you will find that there is no changing God’s precedent, [no changing of it] from Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "That was the way of Allah) such is Allah's chastisement in the life of this world (in the case of those who passed away of old) before them, from among the hypocrites when they were arrogant with their prophets and the believers, Allah commanded their prophets to kill them; (thou wilt not find for the way of Allah) for the chastisement of Allah (aught of power to change) when this verse was revealed, they ceased their evil acts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواستئصال أمثال هذه الغواة المطرودين المردودين ليس ببدع، بل { سُنَّةَ ٱللَّهِ } القدير الحكيم، القديمة المستمرة، التي سنها سبحانه { فِي } حق المؤذين المفترين { ٱلَّذِينَ خَلَوْاْ } ومضوا { مِن قَبْلُ } يا أكمل الرسل { وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ } المستمرة الجارية على مقتضى حكمته المتقنة { تَبْدِيلاً } [الأحزاب: 62] إذ لا يبدل حكمه، ولا يغير حكمته، بل له أن يفعل ما يشاء ويحكم ما يريد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}