{
  "chapter": "الأحزاب",
  "text": "يايها الذين ءامنوا۟ لا تكونوا۟ كالذين ءاذوا۟ موسى فبراه الله مما قالوا۟ وكان عند الله وجيها",
  "translations": [
    {
      "translation": "You who have iman! do not be like those who abused Musa. Allah absolved him of what they said and he was highly honoured with Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not be like those who maligned Moses, whilst God cleared him of what they alleged; and he was held in high esteem with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be like those who distressed Moses and then Allah declared him quit of the ill they spoke about him; and he had a high standing with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be like those who annoyed Moses. God proved him to be innocent of what they had said about him. Moses was a honorable person in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not be like the people who troubled Moosa – so Allah freed him from the allegations they had uttered; and Moosa is honourable in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be not like those who annoyed Musa, but Allah cleared him of that which they alleged, and he was honorable before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be not like those who spoke evil things of Musa, but Allah cleared him of what they said, and he was worthy of regard with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, be not as those who hurt Moses, but God declared him quit of what they said, and he was high honoured with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be not as those who slandered Moses, but Allah proved his innocence of that which they alleged, and he was well esteemed in Allah's sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not behave like those who slandered Moses. God cleared him of their allegations. He was honourable in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! be not like unto those who annoyed Musa; but Allah cleared him of that which they said, and he was in the sight of Allah illustrious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not be like those who offended Moses, whereat Allah cleared him of what they alleged, and he was distinguished in Allah’s sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be ye not like those who vexed and insulted Moses, but Allah cleared him of the (calumnies) they had uttered: and he was honourable in Allah's sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be not like those who annoyed Musa (Moses), but Allah cleared him of that which they alleged, and he was honourable before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be like those who hurt Moses. Allah cleared him of what they said. His face is honorable with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not be like those who abused Moses; but God cleared him of what they said. He was distinguished with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, be not like those who abused Moses; then Allah cleared him of what they said. And he, in the sight of Allah, was distinguished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:69] O you who believe, do not behave, towards your Prophet, as did those who harmed Moses — when they would say, for example, ‘The only reason he does not wash with us is that he has an inflammation in his testicles’ — whereat God absolved him of what they alleged: when Moses placed his robe on a rock to go to wash, the rock hurtled away with it until it came to a halt amid a group of men from the Children of Israel. As Moses chased it and took his robe to cover himself, they saw that he had no such inflammation (udra is an inflammation of the testicle). And he was distinguished in God’s sight. An instance of our Prophet (s) being subjected to hurt was when [on one occasion] while dividing up the spoils a man said to him, ‘This is a division that I do not want to please God!’, whereat the Prophet (s) became angered and said, ‘May God have mercy upon Moses, for truly he was hurt with worse than this, but endured’ — reported by al-Bukhārī.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا لَا تَكُونُوا كَالَّذِينَ آَذَوْا مُوسَى فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا وَكَانَ عِنْدَ اللَّهِ وَجِيهًا (69)لما تقضى وعيد الذين يؤذون الرسول عليه الصلاة والسلام بالتكذيب ونحوه منالأذى المنبعث عن كفرهم من المشركين والمنافقين من قوله : { إن الذين يؤذون الله ورسوله لعنهم الله في الدنيا والآخرة } \\[ الأحزاب : 57 \\] حذر المؤمنين مما يؤذي الرسول صلى الله عليه وسلمبتنزيههم عن أن يكونوا مثل قوم نَسبوا إلى رسولهم ما هو أذى له وهم لا يعبأون بما فيذلك من إغضابه الذي فيه غضب الله تعالى . ولما كان كثير من الأذى قد يحصل عن غفلةأصحابه عما يوجبه فيصدر عنهم من الأقوال ما تجيش به خواطرهم قبل التدبر فيما يحفّبذلك من الاحتمالات التي تقلعه وتنفيه ودون التأمل يترتب عليه من إخلالبالواجبات . وكذلك يصدر عنهم من الأعمال ما فيه ورطة لهم قبل التأمل في مغبة عملهم ،نبه الله المؤمنين كي لا يَقعُوا في مثل تلك العنجهية لأن مدارك العقلاء في التنبيه إلىمعاني الأشياء وملازماتها متفاوتة المقادير ، فكانت حَرية بالإِيقاظ والتحذير . وفائدة التشبيهتشويه الحالة المشبَّهة لأن المؤمنين قد تقرر في نفوسهم قبْح ما أوذي به موسى عليهالسلام بما سبق من القرآن كقوله : { وإذ قال موسى لقومه يا قوم لم تؤذونني وقد تعلمون أني رسول الله إليكم فلما زاغوا أزاغ الله قلوبهم } \\[ الصف : 5 \\] الآية .والذين آذوا موسى هم طوائف من قومه ولم يكن قصدهم أذاه ولكنهم أهملوا واجبكمال الأدب والرعاية مع أعظم الناس بينهم . وقد حكى الله عنهم ذلك إجالاً وتفصيلاًبقوله : { وإذ قال موسى لقومه } الآية ( فلم يكن هذا الأذى من قبيل التكذيب لأجل قوله :{ وقد تعلمون أني رسول الله إليكم } والاستفهام في قوله : { لم تؤذونني } إنكاري ) . فكانتوجيه الخطاب للمؤمنين من أمة محمد صلى الله عليه وسلم مراعى فيه المشابهة بين الحالين في حصولالإِذاية .فالذين آذوا موسى قالوا مرة { فاذهب أنت وربك فقاتلا إنَّا ههنا قاعدون } \\[ المائدة : 24 \\]فآذوه بالعصيان وبضرب من التهكم . وقالوا مرة { أَتتَّخِذُنا هزؤا } \\[ البقرة : 67 \\] فنسبوه إلىالطيش ولاسخرية ولذلك قال لهم { أعوذ بالله أن أكون من الجاهلين } \\[ البقرة : 67 \\] . وفيالتوراة في الإصحاح الرابع عشر من الخروج « وقالوا لموسى فإذا صنعت بنا حتى أخرجتنامن مصر فإنه خير لنا أن نخدُم المصريين من أن نموت في البرية » . وفي الإصحاجحالسادس عشر « وقالوا لموسى وهراون إنكما أخرجتمونا إلى هذا القفر لكي تميتا كل هذاالجمهور بالجوع » . وفي الحديث « إن موسى كان رجلاً حييّاً ستِّيراً فقال فريق من قومه : مانراه يستتر إلا مِن عاهة فيه . فقال قوم : به برص ، وقال قوم : هو آدر » ونحو هذا ، وكانقريباً من هذا قول المنافقين : إن محمداً تزوج مطلقة ابنه زيد بن حارثة .وقد دلت هذه الآية على وجوب توقير النبيء صلى الله عليه وسلم وتجنب ما يؤذيه وتلك سنةالصحابة والمسلمين وقد عرضَت فلتاتٌ من بعض أصحابه الذين لم يبلغوا قبلها كمالالتخلق بالقرآن مثل الذي قال له لما حَكَم بينه وبين الزُبير في ماء شراح الحَرّة : أنْ كانابنَ عمتِك يا رسول الله . ومثل التميمي خرفوص الذي قال في قسمَة مغانم حُنين : « هذهقسمة ما أريد بها وجه الله ، فقال رسول الله صلى الله عليه وسلم : يرحم الله موسى لقد أوذي بأكثر من هذافصبَر » .واعلم أن محل الشتبيه هو قوله : { كالذين آذوا موسى } دون ما فرع عليه من قوله :{ فبرأه الله مما قالوا } وإنما ذلك إدماج وانتهاز للمقام بذكر براءة موسى مما قالوا ، ولااتصال له بوجه التشبيه لأن نبيئنا صلى الله عليه وسلم لم يُوذَ إيذاء يقتضي ظهور براءته ما أوذي به .ومعنى « بَرَّأه » أظهر براءته عيَاناً لأن موسى كان بريئاً مما قالوه من قبل أن يؤذوهبأقوالهم فليس وجود البراءة منه متفرعة على أقوالهم ولكن الله أظهرها عقب أقوالهم فإِنالله أظهر براءته من التغرير بهم إذ أمرهم بدخول أريحا فثبّت قلوبهم وافتتحوها وأظهربراءته من الاستهزاء بهم إذ أظهر معجزته حين ذبحوا البقرة التي أمرهم بذبحها فتبين منقتل النفس التي ادّارأوا فيها .وأظهر سلامته من البرص والأدرة حين بدا لهم عرياناً لما انتقل الحجر الذي عليهثيابه . ومعنى : « برأه مما قالوا » برأه من مضمون قولهم لا من نفس قولهم لأن قولهم قدحصل وأوذي به وهذا كما سموا السُّبة القالة . ونظيره قوله تعالى : { ونرثه ما يقول } \\[ مريم : 80 \\] ،أي ما دل عليه مقاله وهو قوله : { لأوتين مالاً وولداً } \\[ مريم : 77 \\] أي نرثه مالهوولده .وجملة { وكان عند الله وجيهاً } معترضة في آخر الكلام ومفيدة سبب عناية اللهبتبرئته .والوجيه صفة مشبهة ، أي ذو الوجاهة . وهي الجاه وحسن القبول عند الناس . يقال :وجُه الرجل ، بضم الجيم ، وجاهة فهو وجيه . وهذا الفعل مشتق من الاسم الجامد وهوالوجْه الذي للإِنسان ، فمعنى كونه وجيهاً عند الله أنه مرضيّ عنه مقبول مغفور له مستجابالدعوة .وقد تقدم قوله تعالى : { وجيهاً في الدنيا والآخرة } في سورة \\[ آل عمران : 45 \\] ،فضُمّه إلى هنا . وذكر فعل { كان } دال على تمكن وجاهته عند الله تعالى .وهذا تسفيه للذين آذوه بأنهم آذوه بما هو مبرأ منه ، وتنويه وتوجيه لتنزيه الله إياه لأنهمستأهل لتلك التبرئة لأنه وجيه عند الله وليس بخامل .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! Be not) in harming the Prophet (pbuh) (as those who slandered Moses) they accused him of having swollen testicles, (but Allah proved his innocence of that which they alleged, and he was well esteemed in Allah's sight) he has a high standing and status in Allah's sight.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم وصى سبحانه عموم المؤمنين بألاَّ يكونوا مع نبيهم صلى الله عليه وسلم مثل بني إسرائيل مع موسى - صلوت الرحمن عليه وسلامه - ولا يقصدوا أذاه صلى الله عليه وسلم كما قصدوا\n ولا يرموه بشيء لا يليق بشأنه كما رموا به موسى عليه السلام\n لأن معاشر الأنبياء كلهم معصومون عن الكبائر مطلقاً\n بل عن الصغائر أيضاً\n فلا بدَّ لمن آمن لهم ألاَّ يرموهم بمكروه\n ولا يليق بشأنهم مع أنه سبحانه أظهر براءتهم وطهارة ذيلهم\n فبقي إثم الافتراء والمراء على المفترين\n فينتقم سبحانه عنهم منها ويأخذهم بها\n\n\nفقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بمحمد صلى الله عليه وسلم مقتضى إيمانكم به أن { لاَ تَكُونُواْ } قاصدين أذاه صلى الله عليه وسلم بنسبة المكروه المنكر إليه\n وبتعبيره وتشنيعه بأمر صدر عنه ولم تفهموا سره { كَٱلَّذِينَ آذَوْاْ مُوسَىٰ } صلوات الله وسلامه عليه\n فاغتم منها وتحزن حزناً شديداً { فَبرَّأَهُ ٱللَّهُ } المطلع على نجابة طينته وطهارى ذيله وأظهر طهارته { مِمَّا قَالُواْ } أي: من مقولهم\n يعني: مؤداة ومضمونه\n\n\nوذلك أن قارون استأجر بغية بجعل كثير على أن تمري موسى عليه السلام بنفسها\n فرموه بها\n ثم أحضروها في المجلس\n لتفضحه عليه السلام على رءوس الملأ\n فأقرت لعصمته عليه السلام وأظهرت ما أعطوها من الجعل\n فدعا موسى عليه\n ففعل بهم وبما معهم سبحاه ما فعل من الخسف على ما مر في سورة \" القصص \" أو قذفوه بعيب في بدنه من برص أو أدرة\n فبرأه الله سبحانه بأن تذهب الحجر بثيابه بين الملأ وهو يمشي على عقب ثيابه عرياناً يظهر\n حتى يظهر براءته من العيب لهم { وَ } كيف لا يبرؤه سبحانه\n ولا يظهر طهارته\n إذ { كَانَ } موسى عليه السلام { عِندَ ٱللَّهِ } الذي اصطفاه للنوبة والرسالة والتكلم معه { وَجِيهاً } [الأحزاب: 69] في كمال الوجاهة والقربة\n لذلك اختاره بسمع كلامه بلا واسطة\n\n\nوبعدما سمعتم حكاية ما جرى على أولئك البغاة الغواة المؤذين المفترين { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله ورسوله { ٱتَّقُواْ ٱللَّهَ } المنتقم الغيور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا لا تكونوا كالذين آذَوْا موسى } من بني إسرائيل { فبرأه اللهُ مما قالوا } وذلك أن بني إسرائيل كانوا يغتسلون عرايا\n ينظر بعضهم إلى بعض\n وكان موسى عليه السلام يستتر لشدة حيائه\n فقالوا: ما يمنع موسى من الاغتسال معنا إلا أنه آدر ـ والأدْرَة: انتفاخ الأنثيين ـ أو: به عيب من برص أو غيره\n فذهب يغتسل وحده\n فوضع ثوبه على حجر\n ففرّ الحجر بثوبه\n فلجّ في أثره يقول: ثَوْبي حَجَر\n ثوبي حجر! حتى نظروا إلى سوأته\n فقالوا: والله ما بموسى من بأس\n فقام الحجر من بعد ما نظروا إليه\n وأخذ ثوبه\n فطفق بالحجر ضرباً\n ثلاثاً أو أربعاً\n وقيل: كان أذاهم: ادعاءهم عليه قتل أخيه\n قال عليّ رضي الله عنه: صعد موسى وهارون الجبل\n فمات هارون\n فقالت بنو إسرائيل: أنت قتلته\n وكان أشدَّ لنا حبًّا\n وألين منك\n فآذوه بذلك\n فأمر الله تعالى الملائكة فحملته\n حتى مرت به على بني إسرائيل\n وتكلمت الملائكة بمماته\n حتى تحققت بنو إسرائيل أنه قد مات\n فبرّأ الله موسى من ذلك\n ثم دفنوه\n فلم يطلع على قبره إلا الرَّخَم من الطير\n وإن الله جعله أصم أبكم\n وقيل: إنه على سرير في كهف الجبل\n وقيل: إن قارون استأجر امرأة مومسة\n لتقذف موسى بنفسها على رأس الملأ\n فعصمها الله\n وبرأ موسى\n وأهلك قارون\n وقد تقدّم\n { وكان عند الله وجيهاً } ذا جاه ومنزلة رفيعة\n مستجاب الدعوة\n وقرأ ابن مسعود والأعمش \" وكان عبداً لله وجيهاً \"\n { يا أيها الذين آمنوا اتقوا الله } في ارتكاب ما يكرهه\n فضلاً عما يؤذي رسوله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:16",
      "similarity": 0.45021392104731944
    },
    {
      "verse": "9:61",
      "similarity": 0.44706426049483566
    },
    {
      "verse": "10:41",
      "similarity": 0.4443008415092021
    },
    {
      "verse": "14:12",
      "similarity": 0.4348735001020381
    },
    {
      "verse": "98:7",
      "similarity": 0.42378803668382276
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033069.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033069.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:69.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}