{
  "chapter": "الأحزاب",
  "text": "يسـلك الناس عن الساعة قل انما علمها عند الله وما يدريك لعل الساعة تكون قريبا",
  "translations": [
    {
      "translation": "People will ask you about the Last Hour. Say: 'Only Allah has knowledge of it. What will make you understand? It may be that the Last Hour is very near.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you about the Hour (of the great change). Say: \"Only God has knowledge of it. Who knows? The Hour may be close at hand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you concerning the Hour (of Resurrection). Say: “Allah alone has knowledge of it. What do you know? Perhaps the Hour is nigh.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), people ask you about the Day of Judgment. Say, \"Only God has knowledge about it. Perhaps the Hour of Doom will soon come to pass.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you regarding the Last Day; proclaim, “Its knowledge is only with Allah; and what do you know, the Last Day may really be near!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you concerning the Hour, say: \"The knowledge of it is with Allah only. What do you know It may be that the Hour is near!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men ask you about the hour; say: The knowledge of it is only with Allah, and what will make you comprehend that the hour may be nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people will question thee concerning the Hour. Say: 'The knowledge of it is only with God; what shall make thee know? Haply the Hour is nigh.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men ask thee of the Hour. Say: The knowledge of it is with Allah only. What can convey (the knowledge) unto thee? It may be that the Hour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People will ask you about the Hour. Say, \"God alone has knowledge of it. Who knows? The Hour may well be near at hand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask thee ccncerning the Hour. Say thou: the knowledge there of is only with Allah: and what knowest thou! --belike the Hour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people question you concerning the Hour. Say, ‘Its knowledge is only with Allah.’ What do you know, maybe the Hour is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men ask thee concerning the Hour: Say, \"The knowledge thereof is with Allah (alone)\": and what will make thee understand?- perchance the Hour is nigh!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you concerning the Hour, say: \"The knowledge of it is with Allah only. What do you know? It may be that the Hour is near!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people will ask you about the Hour. Say: 'The knowledge of it is with Allah alone, what makes you to know that the Hour is near'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people ask you about the Hour. Say, “The knowledge thereof rests with God. But what do you know? Perhaps the hour is near.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you concerning the Hour. Say,\" Knowledge of it is only with Allah. And what may make you perceive? Perhaps the Hour is near.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:63] People, [such as] the people of Mecca, question you concerning the Hour: when will it be? Say: ‘Knowledge thereof lies only with God — and what do you know, [what would] provide you with knowledge thereof? In other words, you do not know it, perhaps the Hour is near’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Men) the people of Mecca (ask you) Muhammad (of the Hour) about the coming of the Last Hour. (Say) Muhammad: (The knowledge of it) the knowledge of its coming (is with Allah only. What can convey (the knowledge) unto thee? It may be that the Hour is nigh) very near.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم نبه سبحانه على حبيبه صلى الله عليه وسلم بما سيسأل عنه الكافرون تهكماً واستهزاءً\n وأشار إلى جواب سؤالهم\n تعليماً له صلى الله عليه وسلم وإرشاداً\n فقال: { يَسْأَلُكَ } يا أكمل الرسل { ٱلنَّاسُ } الناسون عهودهم التي عهدوا مع الله في مبدأ فطرتهم { عَنِ ٱلسَّاعَةِ } التي جئت بهامن عند ربك\n وأُخبرت بقيامها بوحي الله وإلهامه\n كما أخبر بها سائر الرسل والأنبياء السالفة - صلوات الله عليهم - مستهزئين معك\n سائلين عن تعيين وقتها وقيامها\n أقريب هو أم بعيد؟ { قُلْ } لهم يا أكمل الرسل بعدما اقترحوا عليك عنها: { إِنَّمَا عِلْمُهَا } أي: علم قيامها وتعيين وقتها { عِندَ ٱللَّهِ } العليم الحكيم\n لا يطلع عليها أحداً من خلقه\n بل هي من جملة الغيوب اليت استأثر الله بها في غيبه\n بل أخبر سبحانه بوقوعها حتماً\n وأبهم تعيين وقتها\n فمجرد تحقق وقوعها يكفي في الخوف من أهوالها { وَ } بعدما أخبر سبحانه بوقوعها وأبهم في تعيين وقتها { مَا يُدْرِيكَ } ويطلعك أيها المخاطب تعيينها\n ومن أنَّى لك أن تبعدها أو تنكر وقوعها { لَعَلَّ ٱلسَّاعَةَ } الموعودة { تَكُونُ } شيئاً { قَرِيباً } [الأحزاب: 63] تقع عن قريب\n فأنَّى لم تتزود لها\n ولم تتهيأ أسبابها أيها المغرور في الدنيا الدنية وأمتعتها الفانية ولذاتها المتناهية؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يسألُكَ الناسُ عن الساعةِ } كان المشركون يسألون رسول الله صلى الله عليه وسلم عن وقت الساعة، استعجالاً واستهزاءً، واليهود يسألون امتحاناً لأن الله تعالى أخْفى وقتها في التوراة وفي كل كتاب، فأمر رسولَه صلى الله عليه وسلم أن يجيبهم بأنه علم قد استأثر الله به، ثم بيّن لرسوله عليه الصلاة والسلام أنها قريبة الوقوع، تهديداً للمستعجلين، وإسكاتاً للممْتحنين فقال: { قُلْ إِنما عِلْمُها عند الله } لم يُطلع عليها ملكاً ولا نبيًّا\n { وما يُدريكَ لعل الساعة تكونُ قريباً } أي: شيئاً قريباً، أو: في زمان قريب، فتنصب على الظرفية، ويجوز أن يكون التذكير لأن الساعة في معنى اليوم أو الزمان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:17",
      "similarity": 0.6553960728533046
    },
    {
      "verse": "80:3",
      "similarity": 0.5418705232657353
    },
    {
      "verse": "101:10",
      "similarity": 0.5281439479948297
    },
    {
      "verse": "69:3",
      "similarity": 0.5165528498137982
    },
    {
      "verse": "90:12",
      "similarity": 0.48352844048792715
    }
  ]
}