{
  "chapter": "الأحزاب",
  "text": "يوم تقلب وجوههم فى النار يقولون يليتنا اطعنا الله واطعنا الرسولا۠",
  "translations": [
    {
      "translation": "They will say on the Day their faces are rolled over in the Fire, 'If only we had obeyed Allah and obeyed the Messenger!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day their faces would be turned on the fire (as on a spit), they will say: \"Alas! If only we had obeyed God, and obeyed the Prophet.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day when their faces shall be turned around in the Fire, they will say: “Would that we had obeyed Allah and obeyed the Messenger.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their faces will be turned from side to side on the fire, they will say, \"Would that we had obeyed God and the Messenger!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their faces will be overturned being roasted inside the fire, they will say, “Alas – if only we had obeyed Allah and obeyed His Noble Messenger!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their faces will be turned over in the Fire, they will say: \"Oh, would that we had obeyed Allah and obeyed the Messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their faces shall be turned back into the fire, they shall say: O would that we had obeyed Allah and obeyed the Apostle!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when their faces are turned about in the Fire they shall say, 'Ah, would we had obeyed God and the Messenger!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their faces are turned over in the Fire, they say: Oh, would that we had obeyed Allah and had obeyed His messenger!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their faces are turned over in the Fire, they shall say: \"Oh, would that we had obeyed God, and obeyed the Messenger!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon their faces shall be rolled in the Fire, they will say: Oh that we had obeyed Allah and had obeyed the apostle!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when their faces are turned about in the Fire, they will say, ‘We wish we had obeyed Allah and obeyed the Apostle!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that their faces will be turned upside down in the Fire, they will say: \"Woe to us! Would that we had obeyed Allah and obeyed the Messenger!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their faces will be turned over in the Fire, they will say: \"Oh, would that we had obeyed Allah and obeyed the Messenger (Muhammad SAW).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day when their faces are turned about in the Fire, they shall say: 'Would that we had obeyed Allah and obeyed the Messenger'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their faces are flipped into the Fire, they will say, “If only we had obeyed God and obeyed the Messenger.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day their faces will be turned about in the Fire, they will say, \"How we wish we had obeyed Allah and obeyed the Messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:66] On the day when their faces are turned about in the Fire they shall say, ‘O (yā is for alerting) would that we had obeyed God and obeyed the Messenger!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when their faces are turned over) are dragged (in the Fire, they say) both the leaders and the 481 followers: (Oh, would that we had obeyed Allah) by accepting faith (and had obeyed His messenger) by accepting their message!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل { يَوْمَ تُقَلَّبُ } وتصرف { وُجُوهُهُمْ فِي ٱلنَّارِ } أي: من جهة إلى جهة؛ تشديداً للعذاب عليهم { يَقُولُونَ } حينئذ متمنين متحسرين: { يٰلَيْتَنَآ أَطَعْنَا ٱللَّهَ } كما أخبر علينا الرسل والأنبياء { وَأَطَعْنَا ٱلرَّسُولاَ } [الأحزاب: 66] المبعوث إلينا، المنذر عن هذه العقوبات التي تلحق بنا اليوم، فلن نُبتلى ونصيب بهذا العذاب المؤبد المخلد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:26",
      "similarity": 0.7215787679585091
    },
    {
      "verse": "69:27",
      "similarity": 0.7149253833434573
    },
    {
      "verse": "89:24",
      "similarity": 0.6869010431127094
    },
    {
      "verse": "69:25",
      "similarity": 0.482131959375332
    },
    {
      "verse": "43:38",
      "similarity": 0.4793693029896365
    }
  ]
}