{
  "chapter": "الأحزاب",
  "text": "النبى اولى بالمؤمنين من انفسهم وازوجه امهتهم واو۟لوا۟ الارحام بعضهم اولى ببعض فى كتب الله من المؤمنين والمهجرين الا ان تفعلوا۟ الى اوليائكم معروفا كان ذلك فى الكتب مسطورا",
  "translations": [
    {
      "translation": "The Prophet more right to the muminun than their own selves, and his wives are their mothers. But blood- relations have more rights to one another in the Book of Allah than the muminun and Muhajirun. All the same you should act correctly by your friends; that is inscribed in the Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the faithful than they are themselves; and his wives are as their mothers. Yet blood relations are closer to one another according to God's decree, more than (other) believers and the emigrants (who left their homes in the cause of God), but you should be kind to your friends. This is inscribed in the Book (of decrees).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the Prophet has a greater claim over the believers than they have over each other, and his wives are their mothers. According to the Book of Allah, blood relatives have greater claim over each other than the rest of the believers and the Emigrants (in the cause of Allah), except that you may do some good to your allies (if you so wish). This is inscribed in the Book of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet has more authority over the believers than themselves. His wives are their mothers. The relatives are closer to each other, according to the Book of God, than the believers and the emigrants. However, you may show kindness to your guardians. This also is written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the Muslims than their own lives, and his wives are their mothers; and the relatives are closer to each other in the Book of Allah, than other Muslims and immigrants, except that you may be kind towards your friends; this is written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the believers than themselves, and his wives are their mothers. And blood relations among each other have closer personal ties in the decree of Allah than the believers and the Muhajirin, except that you do kindness to those brothers. This has been written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet has a greater claim on the faithful than they have on themselves, and his wives are (as) their mothers; and the possessors of relationship have the better claim in the ordinance of Allah to inheritance, one with respect to another, than (other) believers, and (than) those who have fled (their homes), except that you do some good to your friends; this is written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is nearer to the believers than their selves; his wives are their mothers. Those who are bound by blood are nearer to one another in the Book of God than the believers and the emigrants; nevertheless you should act towards your friends honourably; that stands inscribed in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the believers than their selves, and his wives are (as) their mothers. And the owners of kinship are closer one to another in the ordinance of Allah than (other) believers and the fugitives (who fled from Mecca), except that ye should do kindness to your friends. This is written in the Book (of nature).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet has a higher claim on the believers than [they have on] their own selves, and his wives are their mothers. Blood relatives are closer to one another in God's Book than are believers and the Emigrants except that you want to show your friends a kindness. That is decreed in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is nigher unto the believers than themselves, and his wives are their mothers. And kinsmen are nigher one to another in the ordinance of Allah than other believers and the emigrants except that ye may act reputably unto your friends. This hath been written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the faithful than their own souls, and his wives are their mothers. The blood relatives are more entitled to inherit from one another in the Book of Allah than the [other] faithful and Emigrants, barring any favour you may do your comrades. This has been written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the Believers than their own selves, and his wives are their mothers. Blood-relations among each other have closer personal ties, in the Decree of Allah. Than (the Brotherhood of) Believers and Muhajirs: nevertheless do ye what is just to your closest friends: such is the writing in the Decree (of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is closer to the believers than their ownselves, and his wives are their (believers') mothers (as regards respect and marriage). And blood relations among each other have closer personal ties in the Decree of Allah (regarding inheritance) than (the brotherhood of) the believers and the Muhajirun (emigrants from Makkah, etc.), except that you do kindness to those brothers (when the Prophet SAW joined them in brotherhood ties). This has been written in the (Allah's Book of Divine) Decrees (AlLauh AlMahfuz).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet has a greater right on the believers than their own selves, his wives are their mothers. Kinsmen are closer to one another in the Book of Allah than to other believers and the emigrants; although you should act honorably towards those you sponsor, that is written in the Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is more caring of the believers than they are of themselves, and his wives are mothers to them. And blood-relatives are closer to one another in God’s Book than the believers or the emigrants, though you should do good to your friends. That is inscribed in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is more worthy of the believers than themselves, and his wives are [in the position of] their mothers. And those of [blood] relationship are more entitled [to inheritance] in the decree of Allah than the [other] believers and the emigrants, except that you may do to your close associates a kindness [through bequest]. That was in the Book inscribed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:6] The Prophet is closer to the believers than their [own] souls, in terms of what he calls them to and what their own souls have called them to contravene, and his wives are their mothers, insofar as they [the believers] are forbidden to marry them. And those related by blood, kinsmen, are more entitled, to inherit [from], one another in the Book of God than the [other] believers and the Emigrants, in other words, than inheriting on account of [their sharing] faith and the Emigration, which had been the case at the beginning of Islam but was then abrogated; barring any favour you may do your friends, by [making] a bequest, which is permissible. This, namely, the abrogation of inheritance on account of [shared] faith and Emigration by the inheritance on account of kinship, is written in the Book — in both instances al-kitāb, ‘the Book’, denotes the Preserved Tablet (al-lawh al-mahfūz).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالنَّبِيُّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ وَأَزْوَاجُهُ أُمَّهَاتُهُمْ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ مِنَ الْمُؤْمِنِينَ وَالْمُهَاجِرِينَ إِلَّا أَنْ تَفْعَلُوا إِلَى أَوْلِيَائِكُمْ مَعْرُوفًا كَانَ ذَلِكَ فِي الْكِتَابِ مَسْطُورًا (6){ النبى أولى بالمؤمنين مِنْ أَنْفُسِهِمْ }استئناف بياني أن قوله تعالى : { وما جعل أدعياءكم أبناءكم } \\[ الأحزاب : 4 \\] وقوله { ادعوهم لآبائهم } \\[ الأحزاب : 5 \\] كان قد شمل في أول ما شمله إبطال بنوّة زيد بن حارثة للنبيء صلى الله عليه وسلم فكان بحيث يثير سؤالاً في نفوس الناس عن مدى صلة المؤمنين بنبيئهم صلى الله عليه وسلم وهل هي علاقة الأجانب من المؤمنين بعضهم ببعض سواء فلأجل تعليم المؤمنين حقوق النبي وحرمته جاءت هذه الآية مبينة أن النبي أوْلى بالمؤمنين من أنفسهم . والمعنى : أنه أولى بكل مؤمن من أنفس المؤمنين . و { مِنْ } تفضيلية .ثم الظاهر أن الأنفس مراد بها جمع النفس وهي اللطيفة الإنسانية كقوله { تعلم ما في نفسي } \\[ المائدة : 116 \\] ، وأن الجمع للتوزيع على كل مؤمن آيل إلى كل فرد من الأنفس ، أي : أن النبي أولى بكل مؤمن من نفس ذلك المؤمن ، أي : هو أشد ولاية ، أي : قرباً لكل مؤمن من قرب نفسه إليه ، وهو قرب معنوي يراد به آثار القرب من محبة ونصرة . ف { أولى } اسم تفضيل من الوَلْي وهو القرب ، أي : أشد قرباً . وهذا الاسم يتضمن معنى الأحقية بالشيء فيتعلق به متعلِّقه ببناء المصاحبة والملابسة . والكلام على تقدير مضاف ، أي : أولى بمنافع المؤمنين أو بمصالح المؤمنين ، فهذا المضاف حذف لقصد تعميم كل شأن من شؤون المؤمنين الصالحة .والأنفس : الذوات ، أي : هو أحق بالتصرف في شؤونهم من أنفسهم في تصرفهم في شؤونهم . ومن هذا المعنى ما في الحديث الصحيح من قول عمر بن الخطاب للنبي صلى الله عليه وسلم « لأنتَ أحبّ إليّ من كل شيء إلاّ من نفسي التي بين جنبَيّ » فقال له النبي صلى الله عليه وسلم « لا يؤمن أحدكم حتى أكون أحبَّ إليه من نفسه . فقال عمر : والذي أنزل عليك الكتاب لأنت أحبّ إليّ من نفسي » . ويجوز أن يكون المراد بالأنفس مجموع نوعهم كقوله : { إذ بعث فيهم رسولاً من أنفسهم } \\[ آل عمران : 164 \\] ، ويجوز أن يكون المراد بالأنفس الناس . والمعنى : أنه أولى بالمؤمنين من ولاية بعضهم لبعض ، أي : من ولاية جميعهم لبعضهم على نحو قوله تعالى : { ثم أنتم هؤلاء تقتلون أنفسكم } \\[ البقرة : 85 \\] ، أي : يقتل بعضكم بعضاً ، وقوله : { ولا تقتلوا أنفسكم إن الله كان بكم رحيماً } \\[ النساء : 29 \\] .والوجه الأول أقوى وأعمّ في اعتبار حرمة النبي صلى الله عليه وسلم وهو يفيد أولويته بمن عدا الأنفس من المؤمنين بدلالة فحوى الخطاب . وأما الاحتمال الثاني فإنه لا يفيد أنه أولى بكل مؤمن بنفس ذلك المؤمن إلا بدلالة قياس الأدْوَن ، ولذلك استثنى عمر بن الخطاب بادىء الأمر نفسه فقال : لأنت أحب إليّ إلا مِن نفسي التي بين جنبيّ . وعلى كلا الوجهين فالنبي عليه الصلاة والسلام أولى بالمؤمنين من آبائهم وأبنائهم ، وعلى الاحتمال الأول أولى بكل مؤمن من نفسه .وسننبه عليه عند قوله تعالى : { وأزواجه أمهاتهم } فكانت ولاية النبي صلى الله عليه وسلم بالمؤمنين بعد إبطال التبني سواء على جميع المؤمنين .وفي الحديث : \" ما من مؤمن إلا وأنا أولى الناس به في الدنيا والآخرة اقرأوا إن شئتم { النبي أولى بالمؤمنين من أنفسهم } \" ولِما علمتَ من أن هذه الولاية راجعة إلى حرمته وكرامته تعلم أنها لا تتعدّى ذلك فيما هو من تصرفات الناس وحقوق بعضهم من بعض ، مثل ميراث الميت من المسلمين فإن ميراثه لورثته ، وقد بينه قول النبي : أنا أولى بالمؤمنين من أنفسهم فأيّما مؤمن ترك مالاً فليرثه ورثته من كانوا ، فإن ترك ديناً أو ضياعاً فليأتني فأنا مولاه . وهذا ملاك معنى هذه الآية .{ مِنْ أَنْفُسِهِمْ }عَطَف على حقوق النبي صلى الله عليه وسلم حقوقَ أزواجه على المسلمين لمناسبة جريان ذكر حق النبي عليه الصلاة والسلام فجعَل الله لهن ما للأمهات من تحريم التزوج بهن بقرينة ما تقدم من قوله { وما جعَل أزواجَكُم اللاء تظّهرون منهنّ أمهاتكم } \\[ الأحزاب : 4 \\] .وأما ما عدا حكم التزوج من وجوه البر بهن ومواساتهن فذلك راجع إلى تعظيم أسباب النبي صلى الله عليه وسلم وحرماته ولم يزل أصحاب النبي والخلفاء الراشدون يتوخّون حُسن معاملة أزواج النبي صلى الله عليه وسلم ويؤثرونهنّ بالخير والكرامة والتعظيم . وقال ابن عباس عند حمل جنازة ميمونة : «هذه زوج نبيئكم فإذا رفعتم نعشها فلا تزعزعوا ولا تزلزلوا وارفقوا» رواه مسلم . وكذلك ما عدا حكم الزواج من وجوه المعاملة غير ما يرجع إلى التعظيم . ولهذه النكتة جيء بالتشبيه البليغ للمبالغة في شبههن بالأمهات للمؤمنين مثل الإرث وتزوج بناتهن ، فلا يُحسب أن تركاتهن يرثها جميع المسلمين ، ولا أن بناتهن أخوات للمسلمين في حرمة التزوج بهن .وأما إطلاق وصف خال المؤمنين على الخليفة معاوية لأنه أخو أم حبيبة أم المؤمنين فذلك من قبيل التعظيم كما يقال : بنُو فلان أخوال فلان ، إذا كانوا قبيلة أمه .والمراد بأزواجه اللآتي تزوجهنّ بنكاح فلا يدخل في ذلك ملك اليمين ، وقد قال الصحابة يوم قريظة حين تزوج النبي صلى الله عليه وسلم صفية بنت حيّي : أهي إحدى ما ملكت يمينه أم هي إحدى أمهات المؤمنين؟ فقالوا : ننظر ، فإذا حجبها فهي إحدى أمهات المؤمنين وإذا لم يحجبها فهي ما ملكت يمينه ، فلما بنى بها ضرب عليها الحجاب ، فعلموا أنها إحدى أمهات المؤمنين ، ولذلك لم تكن مارية القبطية إحدى أمهات المؤمنين .ويشترط في اعتبار هذه الأمومة أن يكون النبي صلى الله عليه وسلم بنى بالمرأة ، فأما التي طلقها قبل البناء مثل الجَونية وهي أسماء بنت النعمان الكِندية فلا تعتبرمن أمهات المؤمنين .وذكر ابن العربي أن امرأة كان عقد عليها النبي صلى الله عليه وسلم تزوجت في خلافة عمر فهَمَّ عمر برجمها . فقالت : لِمَ وما ضرَب عليّ النبي حجاباً ولا دُعيت أمَّ المؤمنين؟ فكفَّ عنها . وهذه المرأة هي ابنة الجَون الكندية تزوجها الأشعث بن قيس . وهذا هو الأصح وهو مقتضى مذهب مالك وصححه إمام الحرمين والرافعي من الشافعية . وعن مقاتل : يحرم تزوج كل امرأة عقد عليها النبي صلى الله عليه وسلم ولو لم يبن بها . وهو قول الشافعي وصححه في «الروضة» ، واللآء طلّقهنُ الرسول عليه الصلاة والسلام بعد البناء بهن فاختلف فيهن على قولين ، قيل : تثبت حرمة التزوج بهن حفظاً لحرمة رسول الله صلى الله عليه وسلم وقيل : لا يثبت لهن ذلك ، والأول أرجح . وقد أُكد حكم أمومة أزواج النبي صلى الله عليه وسلم للمؤمنين بقوله تعالى : { وإذا سألتموهن متاعاً فاسألوهن من وراء حجاب } \\[ الأحزاب : 53 \\] ، وبتحريم تزوج إحداهن على المؤمنين بقوله ( تعالى ) : { ولا أن تنكِحوا أزواجه من بعده أبداً إن ذلكم كان عند الله عظيماً } \\[ الأحزاب : 53 \\] . وسيجيء بيان ذلك عند ذكر هاتين الآيتين في أواخر هذه السورة .وروي أن ابن مسعود قرأ بعدها : وهو أب لهم . وروي مثله عن أُبَيّ بن كعب وعن ابن عباس . وروي عن عكرمة : كان في الحرف الأول «وهو أبوهم» .ومحملها أنها تفسير وإيضاح وإلا فقد أفاد قوله تعالى : { النبي أولى بالمؤمنين من أنفسهم } أكثر من مفاد هذه القراء .{ وَأُوْلُو الارحام بَعْضُهُمْ أولى بِبَعْضٍ فِى كتاب الله مِنَ المؤمنين والمهاجرين إِلاَّ أَن تفعلوا إلى أَوْلِيَآئِكُمْ مَّعْرُوفاً كَانَ ذَلِكَ فِى الكِتَابِ مَسْطُوراً }أعقب نسخ أحكام التبنّي التي منها ميراث المتبنِّي مَن تبناه والعكس بإبطال نظيره وهو المَواخاة التي كانت بين رجال من المهاجرين مع رجال من الأنصار وذلك أن النبي صلى الله عليه وسلم لمّا نزل بالمدينة مع من هاجر معه ، جعل لكل رجل من المهاجرين رجلاً أخاً له من الأنصار فآخى بين أبي بكر الصديق وبين خارجة بن زيد ، وبين الزبير وكعب بن مالك ، وبين عبد الرحمان بن عوف وسعد بن الربيع ، وبين سلمان وأبي الدرداء ، وبين عثمان بن مظعون وأبي قتادة الأنصاري؛ فتوارث المتآخون منهم بتلك المؤاخاة زماناً كما يرث الإخوة ثم نسخ ذلك بهذه الآية ، كما نسخ التوارث بالتبنّي بآية { ادعوهم لآبائهم } \\[ الأحزاب : 5 \\] ، فبينت هذه الآية أن القرابة هي سبب الإرث إلا الانتساب الجعلي .فالمراد بأولي الأرحام : الإخوة الحقيقيون . وعبر عنهم بأولي الأرحام لأن الشقيق مقدم على الأخ للأب في الميراث وهم الغالب ، فبينت الآية أن أُولي الأرحام بعضهم أولى ببعض في الميراث من ولاية المتآخين المهاجرين والأنصار فعمَّ هذا جميع أولي الأرحام وخُصص بقوله { من المؤمنين والمهاجرين } على أحد وجهين في الآيتين في معنى { مِن } وهو بمنزلة العام الوارد على سبب خاص وهو مطلق في الأولوية والمطلق من قبيل المجمل ، وإذ لم يكن معه بيان فمحمل إطلاقه محمل العموم ، لأن الأولوية حال من أحوال أولي الأرحام وعموم الأشخاص يستلزم عموم الأحوال ، فالمعنى : أن أولي الأرحام بعضهم أولى ببعض في جميع الولايات إلا ما خصصه أو قيَّده الدليل .والآية مبيّنة في أن القرابة الحقيقية أرجح من الأخوة الجعلية ، وهي مجملة في تفصيل ذلك فيما بين أولي الأرحام ، وذلك مفصل في الكتاب والسنة في أحكام المواريث . وتقدم الكلام على لفظ { أولوا } عند قوله تعالى { واتقون يا أولي الألباب } في سورة البقرة ( 197 ) .ومعنى في كتاب الله } فيما كتبه ، أي : فرضه وحكم به . ويجوز أن يراد به القرآن إشارة إلى ما تضمنته آية المواريث ، وقد تقدم نظير هذه الآية في آخر سورة الأنفال . وتقدم الكلام في توريث ذوي الأرحام إن لم يكن للميت وارث معلوم سهمه .و { أولوا الأرحام } مبتدأ ، و { بعضهم } مبتدأ ثان و { أوْلَى } خبرُ الثاني والجملة خبر المبتدأ الأول ، و { في كتاب الله } متعلق ب { أوْلى .وقوله من المؤمنين والمهاجرين } يجوز أن يتعلق باسم التفضيل وهو { أولى } فتكون { مِن } تفضيلية . والمعنى : أولوا الأرحام أولى بإرث ذوي أرحامهم من إرث أصحاب ولاية الإيمان والهجرة بتلك الولاية ، أي : الولاية التي بين الأنصار والمهاجرين . وأريد بالمؤمنين خصوصُ الأنصار بقرينة مقابلته بعطف { والمهاجرين } على معنى أصحاب الإيمان الكامل تنويهاً بإيمان الأنصار لأنهم سبقوا بإيمانهم قبل كثير من المهاجرين الذين آمنوا بعدهم فإن الأنصار آمنوا دَفعة واحدة لمّا أبلغهم نقباؤهم دعوة محمد صلى الله عليه وسلم إياهم بعد بيعة العقبة الثانية . قال تعالى : { والذين تبوّءوا الدار والإيمان من قبلهم } \\[ الحشر : 9 \\] أي : من قبل كثير من فقراء المهاجرين عدا الذين سبق إيمانهم . فالمعنى : كل ذي رحم أولى بإرث قريبه من أن يرثه أنصاري إن كان الميت مهاجراً ، أو أن يرثه مهاجر إن كان الميت من الأنصار ، فيكون هذا ناسخاً للتوارث بالهجرة الذي شرع بآية الأنفال ( 72 ) : { والذين ءامنوا ولم يهاجروا ما لكم من ولاَيَتهم من شيء حتى يهاجروا } فتوارث المسلمون بالهجرة فكان الأعرابي المسلم لا يرث قريبه المهاجر ، ثم نسخ بآية هذه السورة . ويجوز أن يكون قوله { من المؤمنين } ظرفاً مستقرّاً في موضع الصفة ، أي : وأولوا الأرحام الكائنون من المؤمنين والمهاجرين ، بعضهم أولى ببعض ، أي : لا يرث ذو الرحم ذا رحمه إلا إذا كانا مؤمنيْن ومهاجرين ، فتكون الآية ناسخة للتوارث بالحلف والمؤاخاة الذي شرع عند قدوم المهاجرين إلى المدينة ، فلما نزلت هذه الآية رجعوا إلى مواريثهم فبينت هذه الآية أن القرابة أولى من الحلف والمواخاة ، وأيّاً مَّا كان فإن آيات المواريث نسخت هذا كله . ويجوز أن تكون { من } بيانية ، أي : وأولوا الأرحام المؤمنون والمهاجرون ، أي : فلا يرث أولوا الأرحام الكافرون ولا يرث من لم يهاجر من المؤمنين لقوله تعالى : { والذين كَفَروا بعضُهم أولياء بعض }\\[ الأنفال : 73 \\] ثم قال : { والذين ءامنوا ولم يهاجروا ما لكم من ولايتهم من شيء حتى يهاجروا } \\[ الأنفال : 72 \\] .والاستثناء بقوله { إلا أن تفعلوا إلى أوليائكم معروفاً } منقطع ، و { إلا } بمعنى ( لكنْ ) لأن ما بعد { إلا ليس من جنس ما قبلها فإن الأولوية التي أثبتت لأولي الأرحام أولوية خاصة وهي أولوية الميراث بدلالة السياق دون أولوية حسن المعاشرة وبذل المعروف . وهذا استدراك على ما قد يتوهم من قطع الانتفاع بأموال الأولياء عن أصحاب الولاية بالإخاء والحلف فبين أن الذي أُبطل ونسخ هو انتفاع الإرث وبَقي حكم المواساة وإسداء المعروف بمثل الإنفاق والإهداء والإيصاء .وجملة كان ذلك في الكتاب مسطوراً } تذييل لهذه الأحكام وخاتمة لها مؤذنة بانتهاء الغرض من الأحكام التي شُرعت من قوله { ادعوهم لآبائهم } \\[ الأحزاب : 5 \\] إلى هنا ، فالإشارة بقوله { ذلك } إلى المذكور من الأحكام المشروعة فكان هذا التذييل أعمّ مما اقتضاه قوله { بعضهم أوْلَى ببعض في كتاب الله . } وبهذا الاعتبار لم يكن تكريراً له ولكنه يتضمنه ويتضمن غيره فيفيد تقريره وتوكيده تبعاً وهذا شأن التذييلات .والتعريف في { الكِتَاب } للعهد ، أي : كتاب الله ، أي : ما كتبه على الناس وفرضه كقوله { كتابُ الله عليكم } \\[ النساء : 24 \\] ، فاستعير الكتاب للتشريع بجامع ثبوته وضبطه التغيير والتناسي ، كما قال الحارث بن حلزة :حذر الجور والتطاخي وهل ين ... قض ما في المهارق الأهواءومعنى هذا مثل قوله تعالى : { وأولوا الأرحام بعضهم أولى ببعض في كتاب الله } في سورة الأنفال ( 75 ) . فالكتاب : استعارة مكنية وحرف الظرفية ترسيخ للاستعارة .والمسطور : المكتوب في سطور ، وهو ترشيح أيضاً للاستعارة وفيه تخييل للمكنية .وفعل كان } في قوله { كان ذلك } لتقوية ثبوته في الكتاب مسطوراً ، لأن { كان } إذا لم يقصد بها أن اسمها اتصف بخبرها في الزمن الماضي كانت للتأكيد غالباً مثل { وكان الله غفوراً رحيماً } \\[ الأحزاب : 4 \\] أي : لم يزل كذلك .\n\n",
      "translations": [
        {
          "translation": "He said: (The Prophet is closer to the believers) the Prophet has a better right to preserve the children of the believers (than their selves) after they die, due to the saying of the Prophet (pbuh): \"Whoever dies and leaves behind a burden I will carry it for him, or a debt I will pay it back for him, or wealth it will go to his inheritors\", (and his wives) the wives of the Prophet (pbuh) (are (as) their mothers) are like their mother in unmarriageability. (And the owners of kinship) those related with ties of kinship (are closer one to another) have more right to one another in relation to inheritance (in the ordinance of Allah) thus it is written in the Guarded Tablet; and it is said: thus it is written in the Torah; and it is said: thus it is written in the Qur'an (than (other) believers and the fugitives (who fled from Mecca) except that ye should do kindness) a bequest not exceeding a third of the whole inheritance (to your friends) your custodians in religion or your friends. (This) inheritance for relatives and bequests for friends or clients (is written in the Book) in the Guarded Tablet; it is also said: it is written in the Torah and the Children of Israel practise it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { النبيُّ أولى بالمؤمنين } أي: أحق بهم في كل شيء من أمور الدين والدنيا، وحكمه أنفذ عليهم { من أنفسهم } ، فإنه لا يأمرهم، ولا يرضى منهم إلا بما فيه صلاحهم ونجاحهم، فيجب عليهم أن يبذلوها دونه. ويجعلوها فداء منه. وقال ابن عباس وعطاء: يعني: \" إذا دعاهم النبي صلى الله عليه وسلم إلى شيء، ودعتهم أنفسهم إلى شيء، كانت طاعةُ النبي صلى الله عليه وسلم أولى. أو: هو أولى بهم، أي: أرأف، وأعطف عليهم، وأنفع لهم، كقوله:\n[التوبة: 128] وفي الصحيح عنه عليه الصلاة والسلام:\n \" ما من مؤمن إلا وأنَا أوْلَى الناس به في الدنيا والاخرة، اقرؤوا إن شئتم: { النبيُّ أوْلَى بالمؤمنين من أنْفُسِهِمْ } فأيُّمَا مُؤْمِن هَلَكَ، وتركَ مالاً فلورَثَته ما كانوا، ومَن تَرَكَ دَيْناً أو ضَيَاعاً فليَأتني، فإني أنا مَوْلاه \". \nوفي قراءة ابن مسعود \" النبي أولى بالمؤمنين من أنفسهم وهو أب لهم \". وقال مجاهد: كل نبي أبو أمته، ولذلك صار المؤمنون إخوة لأن النبي صلى الله عليه وسلم أبوهم في الدين، وأزواجه أمهاتهم، في تحريم نكاحهن ووجوب تعظيمهن، وهن فيما وراء ذلك - كالإرث وغيره - كالأجنبيات، ولهذا لم يتعدَّ التحريم إلى بناتهن. { وأولوا الأرحام } أي: ذوو القرابات { بعضهم أوْلى ببعض } في المواريث. وكان المسلمون في صدر الإسلام يتوارثون بالولاية في الدين وبالهجرةِ، لا بالقرابة، ثم نسخ، وجعل التوارث بالقرابة. ذلك { في كتاب الله } أي: في حُكْم الله وقضائه، أو: في اللوح المحفوظ، أو: فيما فرض الله، فهم أولى بالميراث، { من المؤمنين } بحق الولاية في الدين، { و } من { المهاجرين } بحق الهجرة. وهذا هو الناسخ. قال قتادة: كان المسلمون يتوارثون بالهجرة، ولا يرث الأعرابي المسلم من المهاجر شيئاً. فنزلت. وقال الكلبي: آخى النبيُّ صلى الله عليه وسلم بين الناس، فكان يؤاخي بين الرجلين، فإذا مات أحدهما ورثه الآخر، دون عصبته، حتى نزلت: { وأولوا الأرحام بعضهم أولى ببعض في كتاب الله } في حكمه، { من المؤمنين والمهاجرين } ، ويجوز أن يكون { من المؤمنين }: بياناً لأولي الأرحام، أي: وأولو الأرحام، من هؤلاء بعضهم أولى بأن يرث بعضاً من الأجانب، { إلا أن تفعلوا إلى أوليائكم معروفاً } أي: لكن فعلكم إلى أوليائكم معروفاً، وهو أن تُوصوا لمَن أحببتم من هؤلاء بشيء، فيكون له ذلك بالوصية، لا بالميراث فالاستثناء منقطع. وعَدّى \" تفعلوا \" بإلى، لأنه في معنى تُسْنِدُوا، والمراد بالأولياء: المؤمنون، والمهاجرون: المتقدمون الذين نسخ ميراثهم. { كان ذلك } أي: التوارث بالأرحام { في الكتاب مسطوراً } أي: اللوح المحفوظ، أو: القرآن. وقيل: في التوراة. الإشارة: متابعته عليه الصلاة والسلام، والاقتباس من أنواره، والاهتداء بهديه، وإيثار محبته، وأمره على غيره لا ينقطع عن المريد أبداً، بدايةً ونهايةً إذ هو الواسطة العظمى، وهو أولى بالمؤمنين من أنفسهم وأرواحهم وأسرارهم.\nفكل مدد واصل إلى العبد فهو منه صلى الله عليه وسلم، وعلى يده، وكل ما تأمر به الأشياخ من فعل وترك في تربية المريدين، فهو جزء من الذي جاء به. وهم في ذلك بحسب النيابة عن النبي صلى الله عليه وسلم لأنهم خلفاء عنه. وكل كرامة تظهر فهي معجزة له صلى الله عليه وسلم، وكل كشف ومشاهدة فمن نوره صلى الله عليه وسلم، قال ابن العربي الحاتمي رضي الله عنه: اعلم أن كل وَليّ لله تعالى إنما يأخذ ما يأخذ بِوَاسِطَةِ رُوحَانِيَّةِ النبي صلى الله عليه وسلم، فمنهم مَن يعرف ذلك، ومنهم مَن لا يعرفه، ويقول: قال لي الله، وليس إلا تلك الروحانية. هـ. وهو موافق لما أشار إليه الشيخ أبو العباس المرسي رضي الله عنه، حيث قال: الوليّ إنما يكاشف بالمثال، كما يرى مثلاً البدر في الماء بواسطته، وكذلك الحقائق الغيبية، والأمور الإشهادية مجلوة وظاهرة في بصيرة النبي صلى الله عليه وسلم، وله عياناً لا مثالاً. والوليّ لقربه منه ومناسبته له لهديه بهديه، ومتابعته له يُكاشف بمثال ذلك فيه، فظهر الفرق وثبتت مزية النبي صلى الله عليه وسلم، وانتفى اللبس بين النبوة والولاية. قاله شيخ شيوخنا سيدي \" عبد الرحمن العارف \". قال القشيري: { النبي أَوْلَى بالمؤمنين من أنفسهم } الإشارة: تقديم سُنّته على هواك، والوقوف عند إشارته دون ما يتعلقُ به مُناك، وإيثار مَن تتوسل به نسباً وسبباً على أعِزَّتكَ ومَن والاك، { وأولوا الأرحام.. } الآية: ليكنْ الأجانبُ منك على جانب، ولتكن صلتك للأقارب وصلةُ الرحم ليس لمقاربة الدار وتعاقب المزار، وليكن بموافقة القلوب، والمساعدة في حالتي المكروه والمحبوب.\nولما كان كل نبي أباً لأمته أخذ عليهم العهد في إرشادهم ونصحهم كما ينصح الأب إبنه، فقال: { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ... }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:2",
      "similarity": 0.4990765384998703
    },
    {
      "verse": "88:22",
      "similarity": 0.45829494325698567
    },
    {
      "verse": "8:75",
      "similarity": 0.45314249071061424
    },
    {
      "verse": "23:83",
      "similarity": 0.4422272014542235
    },
    {
      "verse": "27:68",
      "similarity": 0.4422272014542235
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}