{
  "chapter": "الأحزاب",
  "text": "وقالوا۟ ربنا انا اطعنا سادتنا وكبراءنا فاضلونا السبيلا۠",
  "translations": [
    {
      "translation": "And they will say, 'Our Lord, we obeyed our masters and great men and they misguided us from the Way.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"O our Lord, we obeyed our leaders and the elders, but they only led us astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: “Our Lord, we obeyed our chiefs and our great ones, and they turned us away from the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Lord, we obeyed our chiefs and elders and they caused us to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, “Our Lord! We followed our chiefs and our elders – so they misled us from the path!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"Our Lord! Verily, we obeyed our chiefs and our great ones, and they misled us from the way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say: O our Lord! surely we obeyed our leaders and our great men, so they led us astray from the path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'Our Lord, we obeyed our chiefs and great ones, and they led us astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Our Lord! Lo! we obeyed our princes and great men, and they misled us from the Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, \"Our Lord, we paid heed to our leaders and our elders, but they led us away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: our Lord! verily we obeyed our chiefs and our great ones, and they led us astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Our Lord! We obeyed our leaders and elders, and they led us astray from the way.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they would say: \"Our Lord! We obeyed our chiefs and our great ones, and they misled us as to the (right) Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"Our Lord! Verily, we obeyed our chiefs and our great ones, and they misled us from the (Right) Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say: 'Our Lord, We obeyed our masters and our eminent ones, but they misled us from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, “Lord, we have obeyed our superiors and our dignitaries, but they led us away from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, \"Our Lord, indeed we obeyed our masters and our dignitaries, and they led us astray from the [right] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:67] And they, namely, those who had been the followers [of the leaders of error], shall say, ‘Our Lord, we obeyed our leaders (read [plural] sādatanā, or sādātanā, which is the plural of the plural) and elders, and they led us astray from the way, the path of guidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. the followers: (Our Lord!) our Lord! (Lo! we obeyed our princes) our chieftains (and great men) our noble and eminent men, (and they misled us from the Way) they barred us from Religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالُواْ } أيضاً: متضرعين إلى الله على سبيل التمني والتناجي: { رَبَّنَآ } يا من ربانا بأنواع الكرامات وأحسن تربتنا بإرسال الرسل وإنزال الكتب، فكذبنا الكتب والرسل وأنكرنا عليهما عناداً { إِنَّآ أَطَعْنَا } يا ربنا في إنكار كتبك وتكذيب رسلك { سَادَتَنَا وَكُبَرَآءَنَا } الذين هم أصحاب الثورة والرئاسة بيننا، فحلُّ جميع أمورنا وعقدها بأيدي أولئك الرؤساء البعداء الضالين { فَأَضَلُّونَا ٱلسَّبِيلاْ } [الأحزاب: 67] السوي المستقيم الموصل إلى توحيدك وتصديق رسلك وكتبك، وأنت أعلم منا يا ربنا بأنَّا ما ضللنا إلا بإضلال أولئك الطغاة الضالين المضلين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا ربنا إِنا أطعنا سادتَنا وكبراءَنا } والمراد: رؤساء الكُفر، الذين لقنوهم الكفر، وزيّنوه لهم\n وقرأ ابن عامر ويعقوب \" ساداتنا \" بالجمع، جمع: سادة، وسادة: جمع سيد، فهو جمع الجمع، { فأضلونا السبيلا } أي: أتلفونا عن طريق الرشد\n يقال: ضلّ السبيلَ وأضلّه إياه، وزيادة الألف للإطلاق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:60",
      "similarity": 0.6113779811013751
    },
    {
      "verse": "3:106",
      "similarity": 0.553319827119706
    },
    {
      "verse": "43:17",
      "similarity": 0.4300312820923519
    },
    {
      "verse": "16:58",
      "similarity": 0.4226261755006377
    },
    {
      "verse": "3:39",
      "similarity": 0.3732065597782357
    }
  ]
}