{
  "chapter": "الأحزاب",
  "text": "ربنا ءاتهم ضعفين من العذاب والعنهم لعنا كبيرا",
  "translations": [
    {
      "translation": "Our Lord, give them double the punishment and curse them many times over!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Lord, give them a double punishment, and put a grievous curse upon them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, mete out to them a double chastisement and lay upon them a mighty curse.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, make them to suffer double torment and subject them to the greatest condemnation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord! Give them double the punishment of the fire and send upon them a mighty curse!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Give them double torment and curse them with a mighty curse!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! give them a double punishment and curse them with a great curse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, give them chastisement twofold, and curse them with a mighty curse!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Oh, give them double torment and curse them with a mighty curse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, give them double punishment and curse them with a mighty curse.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! give them double torment and curse them with a great curse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Give them a double punishment and curse them with a mighty curse.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Give them double Penalty and curse them with a very great Curse!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! give them double torment and curse them with a mighty curse!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, let their punishment be doubled; and curse them with a mighty curse'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, give them double the punishment, and curse them with a great curse.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, give them double the punishment and curse them with a great curse.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:68] Our Lord, give them a double chastisement, in other words, twice the like of our chastisement, and curse them, chastise them, with numerous curses!’, with the equivalent number [of chastisements] (la‘nan kathīran, ‘numerous curses’, is also read la‘nan kabīran, [which means] ‘with a mighty curse’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) they say: our Lord! (Oh, give them) the leaders and chieftains (double torment) double of what You give us of torment (and curse them with a mighty curse) and chastise them with a great chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبَّنَآ آتِهِمْ } جزاء لإضلالهم وانتقاماً عنهم { ضِعْفَيْنِ مِنَ ٱلْعَذَابِ } يعني: آتهم ضعف عذابنا، ضعفاً لضلالهم وضعفاً لإضلاله إيَّانا { وَٱلْعَنْهُمْ } واطردهم ربنا وأبعدهم عن سعة رحمتك الواسعة { لَعْناً كَبِيراً } [الأحزاب: 68] طرداً عظيماً وتبعيداً بعيداً حيث لا يُرجى نجاتهم، طرداً كثيراً متوالياً متتالياً مستمراً على التعاقب والترادف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربّنا آتهم ضِعفين من العذاب } أي: مثلي ما آتيتنا منه للضلال والإضلال، { والعنْهُم لعناً كثيراً } كثير العدد، تكثيراً لأعداد اللاعنين، أو: العنهم المرة بعد المرة\n وقرأ عاصم بالباء، أي: لعناً هو أشد اللعن وأعظمه\n وهو يدلّ على تعدُّد الأجزاء والأفراد\n الإشارة: مذهب العباد والزهّاد والصالحين: جعل الساعة نُصب أعينهم، لا يغيبون عنها، فهم يجتهدون في التأهُّب لها ليلاً ونهاراً\n ومذهب العارفين الموحّدين: الغيبة عنها، بالاستغراق في شهود الحق، فلا يشغلهم الحق، دنيا ولا آخرة، ولا جنة ولا نار لما دخلوا جنة المعارف، غابوا عن كل شيء، فانخلعوا عن الكونين بشهود المكوِّن، وجعلوا الوجود وجوداً واحداً إذ المتجلي هنا وثَم واحد\n وإذا كان كُبراء الضلال يُضاعَف عذابهم، وكان كبراء الهداية يُضاعف ثوابهم، يأخذون ثواب الاهتداء والإرشاد، فمَن دلّ على هُدىً كان له أجره وأجر مَن اتبعه إلى يوم القيامة، ومَن اهتدى على يديه أحد جرى عليه أجره، وكان في ميزانه كل مَن تبعه كذلك، وفي ذلك يقول القائل:\n",
      "translations": []
    }
  ]
}