{
  "chapter": "الأحزاب",
  "text": "يصلح لكم اعملكم ويغفر لكم ذنوبكم ومن يطع الله ورسوله فقد فاز فوزا عظيما",
  "translations": [
    {
      "translation": "He will put your actions right for you and forgive you your wrong deeds. All who obey Allah and His",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may straighten your affairs for you and forgive your sins; and he who obeys God and His Prophet will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will set your deeds right for you and will forgive you your sins. Whoever obeys Allah and His Messenger has achieved a great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will reform your deeds and forgive your sins. One who obeys God and His Messenger will certainly achieve a great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will rectify your deeds for you and forgive you your sins; and whoever obeys Allah and His Noble Messenger, has indeed achieved a great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will direct you to do righteous good deeds and will forgive you your sins. And whosoever obeys Allah and His Messenger, he has indeed achieved a great victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will put your deeds into a right state for you, and forgive you your faults; and whoever obeys Allah and His Apostle, he indeed achieves a mighty success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He will set right your deeds for you and will forgive you your sins. Whosoever obeys God and His Messenger has won a mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will adjust your works for you and will forgive you your sins. Whosoever obeyeth Allah and His messenger, he verily hath gained a signal victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will bless your works for you and forgive you your sins. Whoever obeys God and His Messenger has indeed achieved a great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He WiLL rectify for you your works, and forgive you your sins. And Whosoever obeyeth Allah and His apostle, he hath indeed achieved a mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will rectify your conduct for you and forgive you your sins. Whoever obeys Allah and His Apostle will certainly achieve a great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may make your conduct whole and sound and forgive you your sins: He that obeys Allah and His Messenger, has already attained the highest achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will direct you to do righteous good deeds and will forgive you your sins. And whosoever obeys Allah and His Messenger (SAW) he has indeed achieved a great achievement (i.e. he will be saved from the Hell-fire and made to enter Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He will mend your deeds for you and forgive your sins. Whosoever obeys Allah and His Messenger shall win a great victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will rectify your conduct for you, and will forgive you your sins. Whoever obeys God and His Messenger has won a great victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:71]   He will rectify your deeds for you, He will accept them, and will forgive you your sins. And whoever obeys God and His Messenger has verily achieved a great success, he has attained his ultimate goal.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He will adjust your works) He will accept your works which are carried out because of belief in Allah's divine Oneness (for you and will forgive you your sins) due to your profession of Allah's divine Oneness. (Whosoever obeyeth Allah) in that which He commands him (and His messenger) in that which he commands him, (he verily hath gained a signal victory) he gained Paradise and is clearly safe from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولكم الإخلاص بالله ورسوله، وأخلصوا واستقيموا في الأفعال والأقوال وأطيعوا { يُصْلِحْ لَكُمْ } سبحانه { أَعْمَالَكُمْ } لتثمر لكم الثمرات العجيبة والدرجات الرفيعة عنده سبحانه { وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ } التي صدرت عنكم { وَمَن يُطِعِ ٱللَّهَ } حق إطاعته ويخلص في أعماله { وَ } يطع { رَسُولَهُ } إطاعة خالية عن وصمة الأذى والرعونات المؤدية إلى أنواع المكروهات والمنكرات { فَقَدْ فَازَ } ونال { فَوْزاً عَظِيماً } [الأحزاب: 71] هو الدخول بدار الخلود، والفوز بلقاء الخلاق الودود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والحثُّ على أن يُسددوا قولهم في كل باب لأن حفظ اللسان، وسداد القول رأس كل خير، ولذلك قال: { يُصلحْ لكم أعمالَكم } أي: يوفقكم لصالح الأعمال، أو: يقبل طاعتكم، ويثيبكم عليها، { ويغفرْ لكم ذنوبَكم } أي: يمحها\n والمعنى: راقبوا الله في حفظ ألسنتكم، وتسديد قولكم، فإنكم إن فعلتم ذلك أعطاكم ما هو غايةُ الطُلبة من تقبل حسنَاتكم، ومن مغفرة سيئاتكم\n وهذه الآية مقررة للتي قبلها، فدلت تلك على النهي عما يؤذي رسول الله صلى الله عليه وسلم، وهذه على الأمر باتقاء الله في حفظ اللسان، ليترادف عليها النهي والأمر، مع اتباع النهي ما يتضمن الوعيد من قصة موسى عليه السلام، واتباع الأمر الوعد البليغ بتقوى الله الصارف عن الأذى والداعي إلى تركه\n ثم وعدهم بالفوز العظيم بقوله: { ومن يُطع اللهَ ورسولَه } في الأوامر والنواهي { فقد فاز فوزاً عظيماً } يعيش في الدنيا حميداً، وفي الآخرة سعيداً\n\n\nجعلنا الله منهم، آمين\n الإشارة: في الآية تسلية لمَن أوذي من الأولياء بالتأسي بالأنبياء\n رُوي أن موسى عليه السلام قال: يا رب احبس عليّ ألسنة الناس، فقال له: هذا شيء لم أصنعه لنفسي، فكيف أفعله بك\n وأوحى تبارك وتعالى إلى عزير: إن لم تطِبْ نفساً بأن أجعلك علكاً في أفواه الماضغين، لم أثبتك عندي من المتواضعين\n هـ\n واعلم أن تعظيم الرسول صلى الله عليه وسلم هو سبب السعادة والفوز الكبير، وتعظيم أولياء الله وخدمتهم هو سبب الوصول إلى الله العلي الكبير، وتقوى الله أساس الطريق، وحفظ اللسان وتحرِّي القول السديد هو سبب الوصول إلى عين التحقيق\n قال الشيخ زروق رضي الله عنه في بعض وصاياه ـ بعد كلام ـ: ولكن قد تصعب التقوى على النفس لاتساع أمرها، فتوجّهْ لترك العظائم والقواعد المقدور عليها، تُعَنْ على ما بعدها، وأعظم ذلك معصية: الغيبة قولاً وسماعاً، فإنها خفيفة على النفوس لإِلْفها، مستسهلة لاعتيادها، مع أنها صاعقة الدين، وآفة المذنبين، مَن اتقاها أفلح في بقية أمره، ومَن وقع فيها خسر فيما وراءها\n قال الله تعالى: { يا أيها الذين آمنوا اتقوا الله وقولوا قولاً سديداً يُصلح لكم أعمالكم ويغفر لكم ذنوبكم\n\n\n } الآية، فجعل صلاحَ العمل متوقفاً على سداد القول، وكذلك ورد: أن الجوارح تُصبح تشتكي اللسان، وتقول: اتق الله فينا، فإنك إن استقمت استقمنا، وإن اعوججت اعوججنا\n فلا تهمل يا أخي لسانك، وخصوصاً في هذه الخصلة، فتورع فيها أكثر ما تورعُ في مأكلك ومشربك، فإذا فعلت طابت حياتك، وكفيت الشواغب، ظاهراً وباطناً\n هـ\n فإذا تحققت بالتقوى، وحصّنت لسانك بالقول السديد، كنت أهلاً لحمل الأمانة، كما قال تعالى: { إِنَّا عَرَضْنَا ٱلأَمَانَةَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:60",
      "similarity": 0.6012669680191157
    },
    {
      "verse": "40:9",
      "similarity": 0.5711587118297986
    },
    {
      "verse": "44:57",
      "similarity": 0.5697565762456027
    },
    {
      "verse": "24:52",
      "similarity": 0.545615746760745
    },
    {
      "verse": "78:31",
      "similarity": 0.5204814224738453
    }
  ]
}