{
  "chapter": "الأحزاب",
  "text": "ليعذب الله المنفقين والمنفقت والمشركين والمشركت ويتوب الله على المؤمنين والمؤمنت وكان الله غفورا رحيمۢا",
  "translations": [
    {
      "translation": "This was so that Allah might punish the men and women of the hypocrites, and the men and women of the idolaters, and turn towards the men and women of the muminun. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that God punishes men and women hypocrites, the idolaters and idolatrous women, but He turns to faithful men and women in forgiveness, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The consequence of man's carrying the trust is) that Allah may chastise hypocritical men and hypocritical women and accept the repentance of believing men and believing women. He is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As a result of this) God will punish the hypocrites and the pagans, but He will accept the repentance of the believers. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may punish the hypocrite men, and the hypocrite women, and the polytheist men, and the polytheist women – and accept the repentance of believing men and believing women; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that Allah will punish the hypocrites, men and women, and the men and women who are idolators. And Allah will pardon the believers, men and women. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah will chastise the hypocritical men and the hypocritical women and the polytheistic men and the polytheistic women, and Allah will turn (mercifully) to the believing women, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may chastise the hypocrites, men and women alike, and the idolaters, men and women alike; and that God may turn again unto the believers, men and women alike. God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah punisheth hypocritical men and hypocritical women, and idolatrous men and idolatrous women. But Allah pardoneth believing men and believing women, and Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will punish the hypocrites, both men and women, and polytheists, both men and women, but God will turn in His mercy to believing men and believing women; God is most forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that Allah will torment the hypocritical men and the hypocritical women and the associators and the associatoresses and Allah will relent toward believing men and the believing women; and Allah is ever Forgiving, Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will surely punish the hypocrites, men and women, and the polytheists, men and women, and Allah will turn clemently to the faithful, men and women, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(With the result) that Allah has to punish the Hypocrites, men and women, and the Unbelievers, men and women, and Allah turns in Mercy to the Believers, men and women: for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that Allah will punish the hypocrites, men and women, and the men and women who are AlMushrikun (the polytheists, idolaters, pagans, disbelievers in the Oneness of Allah, and in His Messenger Muhammad SAW). And Allah will pardon (accept the repentance of) the true believers of the Islamic Monotheism, men and women. And Allah is Ever OftForgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah punishes the hypocrites, men and women alike, and the idolaters, both men and women alike; and Allah turns to the believers, men and women alike. Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will punish the hypocrites, men and women, and the idolaters, men and women. And God will redeem the believers, men and women. God is Ever-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It was] so that Allah may punish the hypocrite men and hypocrite women and the men and women who associate others with Him and that Allah may accept repentance from the believing men and believing women. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:73] so that God may chastise (li-yu‘adhdhiba, the lām therein is semantically connected to ‘aradnā, ‘We offered’, which resulted in ‘Adam’s undertaking’) the hypocrites, men and women, and the idolaters, men and women, those who forsake the Trust, and that God may relent to the believing men and believing women, who fulfil the Trust. And God is Forgiving, to believers, Merciful, to them. Meccan, except for verse 6, which is Medinese; it consists of 54 or 55 verses, revealed after [sūrat] Luqmān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And when Allah revealed His glad tidings to the believers that He will bestow His favour upon them, the hypocrites asked: \"and what do we get, Messenger of Allah?\" Allah said: (Allah punisheth hypocritical men and hypocritical women) it is also said that this means: Adam accepted the trust so that Allah punishes the hypocrites among men and women, (and idolatrous men and idolatrous women) because they rejected the trust, since they were in the loins of Adam when he accepted this trust. (But Allah pardoneth believing men and believing women) who are true in their faith in relation to any shortcomings regarding the bearing of this trust, (and Allah is Forgiving) He forgives whoever repents from amongst them, (Merciful) towards the believers'. And of the surah in which Sheba is mentioned, which is all Meccan and consists of 54 verses, 883 words and 1,512 letters: Surah 34: Sheba {Saba') 482 And of the surah in which Sheba is mentioned, which is all Meccan and consists of 54 verses, 883 words and 1,512 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإنما حمّلها سبحانه عليهم ابتلاءً لهم واختباراً { لِّيُعَذِّبَ ٱللَّهُ } الحكيم المتقن في أفعاله { ٱلْمُنَافِقِينَ } المخفين\n الساترين كفرهم وشركهم والخيانات الصادرة عنهم لمصلحة دنيوية { وَٱلْمُنَافِقَاتِ } منهم كذلك { وَٱلْمُشْرِكِينَ } المصرين المجاهرين بكفرهم وشركهم وخياناتهم { وَٱلْمُشْرِكَاتِ } أيضاً كذلك تعذيباً شديداً\n لعدم وفائهن على الأمانات المحمولة عليهم { وَيَتُوبَ ٱللَّهُ عَلَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } أي: يوفقهم على التوبة والإنابة بعدما صدر عنهم شيء من الخيانة وعدم الوفاء بالأماننة التي ائتمنوا بها من حقوق الله وحقوق العباد\n وبعدما تابوا وأنابوا على وجه الإخلاص والندامة\n فقد أدوا حق الأمانة ووفوا بها على وجهها { وَكَانَ ٱللَّهُ } المطلع لإخلاصهم { غَفُوراً } لما صدر عنهم من الخيانة قبل التوبة { رَّحِيماً } [الأحزاب: 73] يقبل توبتهم ويرحم عليهم بعدما تابوا وأخلصوا\n\n\nرب اغفر وارحم وأنت خير الراحمين\n\n\nخاتمة السورة\n\nعليك أيها الطالب لمرتبة الخلافة والنيابة\n القاصد لحمل الأمانة الإلهية\n المتحمل لأعباء العبودية بالقوة الذاتية القدسية والقابلية الفطرية\n يسَّر الله عليك الأداء والوفاء بجميع حققه وعهوده وأماناته\n وحقوق جميع عباده ورعاية لوازم الإخاء المصاحبة معهمه\n وأطاقك سبحانه على حمل التكاليف من المفترضات والنوافل المسنونات\n وأعانك على التخلق بأخلاقه\n أن تتوجه بوجه قلبك إلى ربك وتتخذه وكيلاً في أمرك الذي هو التخلق بأخلاقه سبحانه\n ليتيسر لك مرتبة الخلافة ويتم عليك أمر النيابة\n\nفلك أن تعرف أولاً شياطينك التي هي أمانيك النفسانية\n المتولدة من القوى البهيمية\n المانعة عن الوصول إلى الدرجات العلية\n وتفصلها على وجه لا يشذ عنك منها شيء\n وتلازم على زجرها ومنعها إلى أن تصير الكل منزجرة مقهورة للقوى الروحانية\n بحيث لا يبقى لها قوة مقاومة ومقابلة مع الروحانيات أصلاً\n\n\nثم لك أن تنفي وتفني أوصافك وأخلاقك في أوصاف الحق وأخلاقه إلى أن تضمحل وتتلاشى أوصافك وأخلاقك في صافته وأخلاقه سبحانه\n ويرتفع اسمك ورسمك عن البين\n ويتصفى العين من الغين\n والشأن عن الشين\n ولم يبق البون والبين\n واتصل العين بالعين\n وحينئذ صرت ما صرت\n وفزت بما فزت\n وتمكنت في مقعهد صدق الخلافة والنيابة عند مليك مقتدر\n\n\nرزقنا الله التقرر والتمكن في مقعد الصدق بلا تلوين وتبديل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم علل عرضها، وهو: لتقوم الحجة على عباده، فقال: { ليُعذبَ اللهُ المنافقين والمنافقاتِ والمشركينَ والمشركاتِ } حيث لم يقوموا بها، وخانوا فيها، فتقوم الحجة عليهم، ولا يظلم ربك أحداً\n وقال أبو حيان: اللام للصيرورة والعاقبة\n وقال أبو البقاء: اللام متعلق بحَمَلَها، وحينئذ تكون للعاقبة قطعاً\n { ويتوبَ اللهُ على المؤمنين والمؤمنات } حيث حملوا الأمانة، إلا أن العبد لا يخلو من تفريط، قال تعالى:\n\n\n\n[عبس: 23] وقال:\n\n[الزمر: 67] ولذلك قال: { وكان الله غفوراً رحيماً } فالغفران لمن لَحِقه تفريط وتقصير، والرحمة لمَن اجتهد قدر طاقته، كالأولياء وكبار الصالحين\n والحاصل: أن العذاب لمَن تحملها أولاً، ولم يقم بحقها ثانياً\n والغفران لمَن تحملها وقام بحقها، والرحمة لمَن تحملها ورعاها حق رعايتها\n والله تعالى أعلم\n الإشارة: الأمانة التي عرضها الله على السماوات والأرض والجبال هي شهود أسرار الربوبية في الباطن، والقيام بآداب العبودية في الظاهر، أو تقول: هي إشراق أسرار الحقائق في الباطن، والقيام بالشرائع في الظاهر، مع الاعتدال، بحيث لا تغلب الحقائق على الشرائع، ولا الشرائع على الحقائق، فلا يغلب السُكْرُ على الصحو، ولا الصحو على السُكْر\n وهذا السر خاص بالآدمي لأنه اجتمع فيه الضدان اللطافة والكثافة، النور والظلمة، المعنى والحس، القدرة والحكمة، فهو سماوي أرضي، رُوحاني بشري، معنوي وحسي\n ولذلك خصّه الله تعالى من بين سائر الأكوان بقوله:\n\n[ص: 75] أي: بيد القدرة والحكمة، فكان جامعاً للضدين، ملكياً ملكوتيًّا، حسه حكمة، ومعناه قدرة: وليست هذه المزية لغيره من الكائنات، فالملائكة والجن معناهم غالب على حسهم، فإذا أشرقت عليهم أنوار الحقائق غلب عليهم السكر والهَيَمان، والحيوانات والجمادات حسهم غالب على معناهم، فلا يظهر عليهم شيء من الأنوار والأَسرار\n وهذا السر الذي خُصّ به الآدمي هو كامن فيه، من حيث هو، كان كافراً أو مؤمناً، كما كَمُن الزبد في اللبن، فلا يظهر إلا بعد الترتيب والضرب والمخض، وإلا بقي فيه كامناً، وكذلك الإنسان، السر فيه كامن، وهو نور الولاية الكبرى، فإذا آمن ووحّد الله تعالى، واهتز بذكر الله، وضرب قلبه باسم الجلالة، ظهر سره، إن وجد شيخاً يُخرجه من سجن نفسه وأسر هواه\n وله مثال آخر، وهو أن كمون السر فيه ككمون الحَب في الغصون قبل ظهوره، فإذا نزل المطر، وضربت الرياح أغصان الأشجار، أزهرت الأغصان وأثمرت، وإليه أشار في المباحث الأصلية، حيث قال:\n\nثم قال:\n\nفلا يظهر هذا السر الكامن في الإنسان إلا بعد إرعاد الرعود فيه، وهي المجاهدة والمكابدة، وقتل النفوس، بخرق عوائدها، وبعد نزول أمطار النفحات الإلهية، والخمرة الأزلية، على يد الأشياخ، الذين أهَّلهم الله لسقي هذا الماء، وتجول في أغصان عوالمه رياح الواردات، وينحط مع أهل الفن، حتى يسري فيه أنوارهم، ويتأدّب بآدابهم، فحينئذ ينتظر لقاح السر فيه، ويجني ثمار معارفه، وإلا بقي السر أبداً كامناً فيه\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:24",
      "similarity": 0.7128786935393722
    },
    {
      "verse": "5:74",
      "similarity": 0.6081443851292208
    },
    {
      "verse": "9:27",
      "similarity": 0.5806597505630622
    },
    {
      "verse": "5:39",
      "similarity": 0.5503232574270799
    },
    {
      "verse": "3:89",
      "similarity": 0.5417966774041922
    }
  ]
}