{
  "chapter": "الأحزاب",
  "text": "انا عرضنا الامانة على السموت والارض والجبال فابين ان يحملنها واشفقن منها وحملها الانسن انه كان ظلوما جهولا",
  "translations": [
    {
      "translation": "We offered the Trust to the heavens, the earth and the mountains but they refused to take it on and shrank from it. But man took it on. He is indeed wrongdoing and ignorant.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had offered the Trust (of divine responsibilities) to the heavens, the earth, the mountains, but they refrained from bearing the burden and were frightened of it; but man took it on himself. He is a faithless ignoramus.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We offered the trust to the heavens and the earth and the mountains, but they refused to carry it and were afraid of doing so; but man carried it. Surely he is wrong-doing, ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We offered Our Trust (Our deputation) to the heavens, to the earth, and to the mountains, but they could not bear this burden and were afraid to accept it. Mankind was able to accept this offer but he was unjust to himself and ignorant of the significance of this Trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed offered the trust to the heavens and the earth and the mountains, but they refused it and were afraid of it – and man accepted it; indeed he is one who puts himself into hardship, is extremely unwise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, We did offer the Amanah to the heavens and the earth, and the mountains, but they declined to bear it and were afraid of it. But man bore it. Verily, he was unjust and ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We offered the trust to the heavens and the earth and the mountains, but they refused to be unfaithful to it and feared from it, and man has turned unfaithful to it; surely he is unjust, ignorant;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We offered the trust to the heavens and the earth and the mountains, but they refused to carry it and were afraid of it; and man carried it. Surely he is sinful, very foolish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We offered the trust unto the heavens and the earth and the hills, but they shrank from bearing it and were afraid of it. And man assumed it. Lo! he hath proved a tyrant and a fool.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We offered the Trust to the heavens and the earth and the mountains, but they refused to bear it, because they were afraid of it. But man bore it: he surely proved unjust and ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We offered the trust unto the heavens and the earth and the mountains, but they refused to bear it and shrank therefor. And man bore it; verily he was very iniquitous and very ignorant-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We presented the Trust to the heavens and the earth and the mountains, but they refused to undertake it and were apprehensive of it; but man undertook it. Indeed he is most unjust and ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed offer the Trust to the Heavens and the Earth and the Mountains; but they refused to undertake it, being afraid thereof: but man undertook it;- He was indeed unjust and foolish;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, We did offer AlAmanah (the trust or moral responsibility or honesty and all the duties which Allah has ordained) to the heavens and the earth, and the mountains, but they declined to bear it and were afraid of it (i.e. afraid of Allah's Torment). But man bore it. Verily, he was unjust (to himself) and ignorant (of its results).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We offered the trust to the heavens, and the earth, and the mountains, but they refused to bear it, and were afraid of it, and the human carried it. Surely, he is a harmdoer, and ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We offered the Trust to the heavens, and the earth, and the mountains; but they refused to bear it, and were apprehensive of it; but the human being accepted it. He was unfair and ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, we offered the Trust to the heavens and the earth and the mountains, and they declined to bear it and feared it; but man [undertook to] bear it. Indeed, he was unjust and ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:72] Indeed We offered the Trust — [the obligation to] prayer and other matters which, when performed, result in reward and when neglected, result in punishment — to the heavens and the earth and the mountains, and created in them the power of comprehension and speech [at the time of that offer], but they refused to bear it and were apprehensive of it; but man, Adam, undertook it, when it was offered to him. Truly he is a wrongdoer, to his own soul because of what he undertook, ignorant, of [the responsibility that comes with] it —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We offered the trust) obedience and worship (unto the heavens) unto the inhabitants of the heavens (and the earth and the hills) by way of choice and selection, (but they shrank from bearing it) through reward and punishment (and were afraid of it) and were afraid of bearing it. (And man assumed it) Adam assumed it, accepting both the possibility of reward and punishment. (Lo! he hath proved a tyrant) by assuming its bearing; it is also said that this means: he has proved a tyrant by eating from the tree (and a fool) and ignorant of its consequence.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّا عرضنا الأمانة على السماوات الأرض والجبال } بإيداع حقيقة الهوية عندها واحتجابها بالتعينات بها { فأبين أن يحملنها } بأن تظهر عليهنّ مع عظم إجرامها لعدم استعدادها لقبولها { وأشفقن منها } لعظمها عن أقدارها وضعفها عن حملها وقبولها { وحملها الإنسان } لقوة استعداده واقتداره على حملها فانتحلها لنفسه بإضافتها إليه { إنه كان ظلوماً } بمنعه حق الله حين ظهر بنفسه وانتحالها { جهولا } لا يعرفها لاحتجابه بأنائيته عنها\n { لعذّب الله المنافقين والمنافقات } الذين ظلموا بمنع ظهور نور استعدادهم بظلمة الهيئات البدنية والصفات النفسانية ووضعوه في غير موضعه فجهلوا حقه { والمشركين والمشركات } الذين جهلو لاحتجابهم بالأنائية والوقوف مع الغير بغلبة الرين وكثافة الحجب الخلقية فعظم ظلمهم لانطفاء نورهم بالكلية وامتناع وفائهم بالأمانة الإلهية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أراد سبحانه بمقتضى تجلياته الحبيبة اللطيفة أن يطالع ذاته الكاملة المتصفة بصفات الكمال في مرآة مجلوة تصير نائبة عنها\n خليفة لها\n يتراءى فيها جميع أوصافه وأسمائه الذاتية على ما أشار إليه الحديث القدسي\n عرض سبحانه أمانة الخلافة والنيابة على استعدادات المظاهر وقابليات المصنوعات فامتنع الكل عن حملها\n وأبى عن قبولها كما قال سبحانه: { إِنَّا } بمقتضى تجلياتنا الجمالية المنبعثة عن الشئون الحِبِّية والتطورات اللطيفة { عَرَضْنَا ٱلأَمَانَةَ } أي: أمانة الخلافة والنيابة\n وأردنا أن نحمّل أعباء العبودية المشتملة على التخلق بالأخلاق الإلهية والتكليفات الشاقة\n القالعة للأوصاف البهيمية والأدناس الإسكانية الراسخة في القوى الطبيعية\n لتحصل التصفية والتزكية عن أكدار الهيولي المانعة عن الوصول إلى الملأ الأعلى { عَلَى } استعدادات { ٱلسَّمَٰوَٰتِ } العلا { وَ } قابليات { ٱلأَرْضِ } السفلى { وَٱلْجِبَالِ } الأسنى\n وعلى استعدادات ما بينهما من المركبات العظمى والمؤلفات الكبرى { فَأبَيْنَ } وامتنعن\n أي: كل منهم { أَن يَحْمِلْنَهَا } إذ ما أودع سبحانه في استعداداتهم وقابلياتهم ما يسع لحمل هذه الأمانة العظيمة والكرامة الكريمة\n\n\n{ وَ } لذلك { أَشْفَقْنَ مِنْهَا } أي: خفن وخشين من حملها ألاَّ يفين حقها { وَ } بعدما امتنعن وخفن جميعاً عن حملها { حَمَلَهَا ٱلإِنْسَانُ } المجبول على صورة الرحمن\n المنتخب من بين الأكوان بالقوة القدسية المودعة فيه\n المقتضية لحملها { إِنَّهُ } حينئذ من كمال شوقه ووفور تحننه وذوقه { كَانَ ظَلُوماً } على نفسه بارتكاب هذه التحميلات البليغة والتكليفات الشديدة الثقيلة من ققطع المألوفات الطبيعية\n والمشتهيات البهيمية واللذات الحسية { جَهُولاً } [الأحزاب: 72] ذهولاً عن مقتضيات ناسوته وملائماتها بحسب القوى البشرية لغلبة القوى الروحانية الجالبة للسعادة الأزلية الأبدية على القوى الجسمانية المستتبعة للشقاوة السرمدية\n فأين هذامن ذلك؟!\n\nرزقنا الله المنعم المفضل ألاَّ نظلم على نفوسنا\n ونمنعها عن مقتضياتها وأمانيها\n بمنِّه وجوده\n\n\nومن جملة الأمانات المحمولة على الإنسان: حفظ السرائر ورعاية الآداب والحقوق الجارية بين ذوي الألباب من الرجال والنساء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنا عرضنا الأمانةَ على السماواتِ والأرضِ والجبالِ } الأمانة هنا هي التوحيد في الباطن\n والقيام بوظائف الدين في الظاهر\n من الأوامر والنواهي\n فالإيمان أمانة الباطن\n والشريعة بأنواعها كلها أمانة الظاهر\n فمَن قام بهاتين الخصلتين كان أميناً\n وإلا كان خائناً\n والمعنى: إنا عرضنا هذه الأمانة على هذه الأجرام العظام\n ولها الثواب العظيم\n إن أحسنت القيام بها\n والعقاب الأليم إن خانت\n فأبتْ وأشفقتْ واستعفتْ منها\n مخافةَ ألاَّ تقدر عليها\n فطلبت السلامة\n ولا ثواب ولا عقاب\n وهذا معنى قوله: { فأبَيْنَ أن يحْمِلنَها وأشفقنَ منها } فيحتمل أن يكون الإباء بإدراكٍ\n خلقه الله فيها\n وقيل: أحياها وأعقلها\n كقوله:\n[فصلت: 11] ويحتمل أن يكون هذا العرض على أهلها من الملائكة والجن\n وقال شيخ شيوخنا سيدي عبد الرحمن الفاسي: وقد يقال: الأمانة هي ما أخذ عليهم من عهد التوحيد في الغيب بعد الإشهاد لربوبيته\n وينظر لذلك قوله:\n \" لن يسعني أرضي ولا سمائي ووسعني قلب عبدي المؤمن \" \nوأما حملها على التكاليف فلا يختص بالآدمي لأن الجن أيضاً مكلف\n ومناسبة الآية لِمَا قبلها: أن الوفاء بها من جملة التقوى المأمور بها\n هـ\n وقيل: لم يقع عَرض حقيقةً\n وإنما المقصود: تعظيم شأن الطاعة\n وسماها أمانة من حيث إنها واجبة الأداء\n والمعنى: أنها لعظمة شأنها لو عُرضت على هذه الأجرام العظام\n وكانت ذا شعور وإدراك\n لأبيْن أن يحمِلْنها\n وأشفقن منها\n وحملها الإنسان\n مع ضعف بنيته\n ورخاوة قوته\n لا جرم\n فإن الراعي لها\n والقائم بحقوقها\n بخير الدارين\n هـ\n قاله البيضاوي\n والمراد بالإباية: الاستعفاء\n لا الاستكبار\n أي: أشفقن منها فعفا عنهن وأعفاهن\n { وحَمَلَها الإِنسانُ } أي: آدم\n قيل: فما تمّ له يوم من تحملها حتى وقع في أمر الشجرة\n وقيل: جنس الإنسان\n وهذا يناسب حملَ الأمانة على العهد الذي أخذ على الأرواح في عالم الغيب\n { إِنه كان ظلوماً جهولاً } حيث تعرض لهذا الخطر الكبير\n ثم إن قام بها ورعاها حق رعايتها خرج من الظلم والجهل\n وكان صالحاً أميناً عدولاً\n وإن خانها ولم يقم بها\n كان ظلوماً جهولاً\n كلٌّ على قدر خيانته وظُلمه\n فالكفار خانوا أصل الأمانة\n وهي الإيمان فكفروا\n ومن دونهم خانوا بارتكاب المناهي أو ترك الطاعة\n فبعضهم أشد\n وبعضهم أهون\n وكل واحد عقوبته على قدر خيانته\n ثم علل عرضها\n وهو: لتقوم الحجة على عباده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:27",
      "similarity": 0.4696483834632508
    },
    {
      "verse": "52:26",
      "similarity": 0.4626411179241917
    },
    {
      "verse": "23:57",
      "similarity": 0.4456402109481121
    },
    {
      "verse": "84:16",
      "similarity": 0.43786099549392615
    },
    {
      "verse": "20:56",
      "similarity": 0.4285535602388659
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/033072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/033072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/33:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}