{
  "chapter": "الأحزاب",
  "text": "واذ اخذنا من النبين ميثقهم ومنك ومن نوح وابرهيم وموسى وعيسى ابن مريم واخذنا منهم ميثقا غليظا",
  "translations": [
    {
      "translation": "When We made a covenant with all the Prophets - with you and with Nuh and Ibrahim and Musa and 'Isa son of Maryam - We made a binding covenant with them,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We made the covenant with the prophets, and with you, as with Noah and Abraham, Moses and Jesus son of Mary, a binding covenant,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind, (O Prophet), when We took the covenant from all Prophets; and also from you and Noah and Abraham, Moses, and Jesus the son of Mary. We took from them a solemn covenant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had a solemn covenant with you (Muhammad), and the Prophets: Noah, Abraham, Moses, and Jesus, the son of Mary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember O dear Prophet (Mohammed – peace and blessings be upon him) when We took a covenant from the Prophets – and from you – and from Nooh, and Ibrahim, and Moosa, and Eisa the son of Maryam; and We took a firm covenant from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took from the Prophets their covenant, and from you, and from Nuh, Ibrahim, Musa, and `Isa son of Maryam. We took from them a strong covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a covenant with the prophets and with you, and with Nuh and Ibrahim and Musa and Isa, son of Marium, and We made with them a strong covenant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took compact from the Prophets, and from thee, and from Noah, and Abraham, Moses, and Jesus, Mary's son; We took from them a solemn compact,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We exacted a covenant from the prophets, and from thee (O Muhammad) and from Noah and Abraham and Moses and Jesus son of Mary. We took from them a solemn covenant;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took a solemn pledge from the prophets, from you and Noah, Abraham, Moses and Jesus, the son of Mary -- We took a solemn pledge from all of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We took a bond from the prophets and from thee and from Nuh and Ibrahim and Musa and 'Isa son of Maryam. And We took from them a solemn bond;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Recall] when We took a pledge from the prophets, and from you and from Noah and Abraham and Moses and Jesus son of Mary, and We took from them a solemn pledge,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We took from the prophets their covenant: As (We did) from thee: from Noah, Abraham, Moses, and Jesus the son of Mary: We took from them a solemn covenant:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took from the Prophets their covenant, and from you (O Muhammad SAW), and from Nuh (Noah), Ibrahim (Abraham), Musa (Moses), and 'Iesa (Jesus), son of Maryam (Mary). We took from them a strong covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took from the Prophets their covenant and from you (Prophet Muhammad), from Noah and Abraham, from Moses and Jesus the son of Mary. We took a solemn covenant from them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall that We received a pledge from the prophets, and from you, and from Noah, and Abraham, and Moses, and Jesus son of Mary. We received from them a solemn pledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when We took from the prophets their covenant and from you and from Noah and Abraham and Moses and Jesus, the son of Mary; and We took from them a solemn covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:7] And, mention, when We took a pledge from the prophets, at the point when they were brought forth from the loins of Adam, the size of atoms, and from you, and from Noah and Abraham and Moses and Jesus son of Mary, that they worship [only] God and call others to worship Him (the mention of the five [names] is an instance of supplementing the specific to the general). And We took from them a solemn pledge, a solid [one], that they fulfil what they have been charged with, and this was [effected] by [swearing] an oath to God, after which the pledge was consummated;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We exacted a covenant from the Prophets) to honour their pledges and that they should convey the message to one another, (and from thee (0 Muhammad)) and We exacted from you that you should convey to your people the events of the messengers and Scriptures before you and that you should command them to believe in it (and from Noah) and We exacted from Noah [the same] (and Abraham) and exacted from Abraham [the same] (and Moses) and exacted from Moses [the same] (and Jesus son of Mary) and exacted from Jesus of Mary [the same]. (We took from them a solemn covenant) that they should convey the message, the first to the last and that the last should believe in the first, and also command their respective people to believe in it;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لم يحسنوا الأدب أولئك المؤمنون الماضون مع أنبيائهم، وهؤلاء معك، مع أنَّا ما بعثنا الأنبياء والرسل؛ إلا لإرشاد المؤمنين، وهدايتهم إلى توحيدنا، وإيصالهم إلى زلال تفريدنا، وعلى ذلك أخذنا العهود والمواثيق المؤكدة من الأنبياء تأكيداً وإلزاماً، اذكر يا أكمل الرسل لمن تبعك من المؤمنين؛ ليحافظوا على ما أُمروا { إِذْ أَخَذْنَا مِنَ } عموم { ٱلنَّبِيِّيْنَ } المبعوثين إلى الأمم الماضين { مِيثَاقَهُمْ } أي: عهودهم الوثيقة المؤكدة { وَ } خصوصاً { مِنْكَ } يا أكمل الرسل { وَمِن نُّوحٍ } النجي { وَإِبْرَاهِيمَ } الخليل { وَمُوسَىٰ } الكليم { وَعِيسَى } الصفي الخالص عن كدر الناسوت من قبل الأب؛ لأنه { ٱبْنِ مَرْيَمَ }  لم يمسها ذكر من بني نوعها، بل إنما ولدته بلا أب إرهاصاً لها، ومعجزةً لابنها\n\n\nخصَّ هؤلاء سبحانه بالذكر اهتماماً بشأنهم - صلوات الله عليهم - { وَأَخَذْنَا مِنْهُمْ } كرره تأكيداً ومبالغةً؛ أي: كل واحد منهم، وممن لم نذكر أساميهم من ذوي الغزائم الخالصة { مِّيثَاقاً غَلِيظاً } [الأحزاب: 7] أي: عهداً وثيقاً مؤكداً على ألاَّ تتهاونوا، ولا تتكاسلوا في إرشاد العباد وإبعادهم عن الجور والفساد، وإيصالهم إلى ما أعددنا لهم من المراتب العليَّة والدرجات السنيَّة\n\n\n\n\nوأنزلنا عليهم الكتب والصحف المشتملة على الأوامر والأحكام المقربة لتوحيدنا، والعبر والنواهي المعبدة عن الكفر والضلال، وأمرناهم أيضاً بتيين الأوامر والنواهي إلى أممهم وتنبيهها عليهم؛ ليتفطنوا على فطرتهم التي جُبلوا عليها في عالم الغيب؛ وليتميز عندهم الحق الحقيق بالاتباع من الباطل الزاهق الزائل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { و } اذكر { إذ أخذنا } حين أخذنا { من النبيين ميثاقهم } بتبليغ الرسالة، والدعاء إلى الدين القيم، وإرشاد العباد ونصحهم\n وقيل: أخذه عليهم في عالم الذر\n قال أُبيّ بن كعب: لما أخرج الله الذرية، كانت الأنبياء فيهم مثل السُرُج، عليهم النور، فخُصُّوا بميثاقٍ وأخذ الرسالة والنبوة، وقال القشيري: أخذ الميثاق الأوَل وقت استخراج الذرية من صُلب آدم، عندَ بعثة كل رسول، ونُبُوَّة كل نبيٍّ، أخذ ميثاقه، وذلك على لسان جبريل عليه السلام، ومنَ اختصه بإسماعه كَلاَمَهُ بلا واسطة ملك كنبينا ليلة المعراج، وموسى - عليهما السلام - فأخذ الميثاق منهم بلا واسطة، وكان لنبينا - عليه الصلاة والسلام - زيادة حال بأن كان مع سماع الخطاب كشف الرؤية\n ثم أخذ المواثيق من العباد بقلوبهم وأسرارهم\n هـ\n قال في الحاشية: والذي يظهر: أن أخذ الميثاق منهم مباشرة لا بوحي، وذلك في الغيب، ولذلك قدّم نبينا محمد صلى الله عليه وسلم لأنه النور الأول قبل آدم، ثم انتقل إلى ظهره، وحينئذ، فأخذ الميثاق هنا غيبي، ولذلك قدّمه\n وفي قوله:\n\n[الشورى: 13] في عالم الظهور، فلذلك قدّم نوحاً، وثنَّى بنبينا لأن نوحاً أول أُولي العزم، ونبينا خاتمهم\n والله أعلم\n هـ\n والحاصل: أن أخذ الميثاق كان مرتين في عالم الغيب وفي عالم الشهادة\n وهل المراد به هنا الأول أو الثاني؟ قولان\n { ومنك ومن نوحٍ وإبراهيمَ وموسى وعيسى ابنِ مريم } ، قال النسفي: وقدَّم رسول الله صلى اله عليه وسلم على نوح ومَن بعده لأن هذا العطف لبيان فضيلة هؤلاء لأنهم أولو العزم، وأصحاب الشرائع، فلمَّا كان نبينا محمد صلى الله عليه وسلم أفضل هؤلاء قُدّم عليهم، ولولا ذلك لقدّم مَن قدمه زمانه\n هـ { وأخذنا منهم ميثاقا غليظاً } وثيقاً\n وأعاد ذكر الميثاق لانضمام الوصف إليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:116",
      "similarity": 0.41323002465682696
    },
    {
      "verse": "9:123",
      "similarity": 0.4103774305744001
    },
    {
      "verse": "31:24",
      "similarity": 0.4047976199002794
    },
    {
      "verse": "19:34",
      "similarity": 0.40455686391680545
    },
    {
      "verse": "11:58",
      "similarity": 0.3805295881805983
    }
  ]
}