{
  "chapter": "الأحزاب",
  "text": "ليسـل الصدقين عن صدقهم واعد للكفرين عذابا اليما",
  "translations": [
    {
      "translation": "so that He would be able to question the sadiqun about their sincerity; and He has prepared a painful punishment for the kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It was) so that God may ask the truthful of their sincerity. As for the infidels, He has prepared a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that (their Lord) may question the truthful about their truthfulness. As for the unbelievers, He has kept a painful chastisement in store for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was a firm agreement. God will ask the truthful ones about their truthfulness and prepare a painful torment for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He may question the truthful regarding their truth; and He has kept prepared a painful punishment for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may ask the truthful about their truth. And He has prepared for the disbelievers a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may question the truthful of their truth, and He has prepared for the unbelievers a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He might question the truthful concerning their truthfulness; and He has prepared for the unbelievers a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may ask the loyal of their loyalty. And He hath prepared a painful doom for the unfaithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that God might ask those men of truth as to [what response] their truthfulness [had received on earth]. But for those who deny the truth, He has prepared a woeful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That he may question the truthful of their truth. And for the Infidels He hath gotten ready a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may question the truthful concerning their truthfulness. And He has prepared for the faithless a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (Allah) may question the (custodians) of Truth concerning the Truth they (were charged with): And He has prepared for the Unbelievers a grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may ask the truthfuls (Allah's Messengers and His Prophets) about their truth (i.e. the conveyance of Allah's Message that which they were charged with). And He has prepared for the disbelievers a painful torment (Hell-fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah might question the truthful about their truthfulness. But for the unbelievers He has prepared a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may ask the sincere about their sincerity. He has prepared for the disbelievers a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may question the truthful about their truth. And He has prepared for the disbelievers a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:8] that He, God, may question the truthful about their truthfulness, in delivering the Message, as a way thereby to [justifiably] reproach the disbelievers; and He, exalted be He, has prepared for those who disbelieve, in them, a painful chastisement (‘adhāban alīman is a supplement to akhadhnā, ‘We took’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That He may ask the loyal of their loyalty) that He may ask the conveyors of the message about their conveyance, and the loyal about their loyalty and the believers about their faith. (And He hath prepared a painful doom) whose pain extends to their hearts (for the unfaithful) for the disbelievers in Scriptures and messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ أخذنا من النبيين ميثاقهم } وخصوصاً الخمسة المذكورة لاختصاصهم بمزيد المرتبة والفضيلة ميثاق التوحيد والتكميل والهداية بالتبليغ عند الفطرة وهو الميثاق الغليظ المضاعف بالكمال والتكميل ولذلك أضافه إليهم بقوله: ميثاقهم، أي: الميثاق الذي ينبغي لهم ويختص بهم، وقدّم في الاختصاص بالذكر نبينا عليه السلام بقوله منك، لتقدّمه على الباقين في الرتبة والشرف { ليسأل } الله بسبب عهدهم وميثاقهم وبواسطة هدايتهم { الصادقين } الذين صدّقوا العهد الأول والميثاق الفطري في قوله:\n\n[الأعراف، الآية:172]، { عن صدقهم } بالوفاء والوصول إلى الحق بإخراج ما في استعدادهم من الكمال بحضور الأنبياء كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكل ذلك { لِّيَسْأَلَ } سبحانه في النشأة الأخرى عن أنبيائه ورسله - صلوات الله عليهم - عن أحوال العباد { ٱلصَّادِقِينَ } الممتثلين بأوامر الله، المجتنبين عن نواهيه { عَن صِدْقِهِمْ } وأخلاصهم في أعمالهم ونيَّاتهم فيها، وأحوالهم ومواجيدهم واعتقادهم، وتلقيهم لقبول الحق والمحافظة عليه؛ ليشهد الأنبياء لهم فيفوزوا إلى ما أعد لهم من المراتب والمقامات، وأنواع السعادات والكرامات، مع أن علمه سبحانه بحالهم بغني عن شهادتهم؛ ليسأل أيضاً سبحانه عن عناد العباد المصرين على الجور والفساد، المجترئين على الله بالخروج عن حدوده وعن مقتضيات أحكامه؛ ليشهدوا - صلوات الله عليهم - فيساقوا صاغرين مهانين إلى ما أعد الله لهم من الدركات والهوية الجهنمية { وَ } اعلموا أن الله سبحانه { أَعَدَّ لِلْكَافِرِينَ } الجاحدين لأوامر الله ونواهيه المنزلة في كتبه على رسله { عَذَاباً أَلِيماً } [الأحزاب: 8] لا عذاب أشد إيلاماً منه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وإنما فعلنا ذلك { ليَسْألَ } اللهُ { الصادقين } أي: الأنبياء: { عن صِدْقِهم } عما قالوه لقومهم، وهل بلغوا ما كلفهم به\n وفيه تبكيت للكفار، كقوله:\n\n[الأعراف: 6]، أو: ليسأل المصدّقين للأنبياء عن تصديقهم: هل كان بإخلاص أم لا؟ لأن مَن قال للصادق: صدقت كان صادقاً في قوله\n أو: ليسأل الأنبياء: ما الذي أجابتهم أممهم؟ وهو كقوله:\n\n[المائدة: 109]، { وأعَدَّ للكافرين } بالرسل { عذاباً أليماً } ، وهو عطف على \" أخذنا \" ، لأن المعنى: أن الله تعالى أخذ على الأنبياء العهد بالدعوة إلى دينه لأجل إثابة المؤمنين، وأعَدَّ للكافرين عذاباً أليماً\n أو: على ما دلّ عليه: { ليسأل الصادقين } ، كأنه قال: فأثاب المؤمنين، وأعدَّ للكافرين عذاباً أليماً\n الإشارة: كما أخذ الله الميثاق على الأنبياء والرسل أخذ الميثاق على العلماء والأولياء\n\n\nأمّا العلماء فعلى تبيين الشرائع وتغيير المناكر، وألا تأخذهم في الله لومة لأئم، وأما أخذه على الأولياء فعلى تذكير العباد وإرشادهم إلى معرفة الله، وتربية مَن تعلّق بهم، وسياسة الخلق، ودلالتهم على الحق، فمَن قصَّر من الفريقين استحق العتاب\n قال القشيري: فلكلِّ من الأولياء والأكابر حال، على ما يؤهلهم له قال صلى الله عليه وسلم:\n\n \" لقد كان في الأمم مُحَدِّثون، وإن يكُن في أمتي فَعُمر \" \n\n،وغير عُمَر مشارك لعُمر في خواص كثيرة، وذلك سر بينهم وبين ربِّهم\n ثم قال: قوله تعالى: { ليَسْأل الصادقين عن صدقهم } سؤال تشريف لا تعنيف، وإيجاب لا عتاب، والصدقُ: ألا يكون في أحوالك شَوْبٌ، ولا في اعتقادك ريب، ولا في عملك عَيْبٌ، ويقال: من أمارات الصدق في المعاملة\n وجودُ الإخلاص من غير ملاحظة، وفي الأحوال: تصفيتُها [من غير مداخلة الحجاب]، وفي القول: سلامته من المعاريض، فيما بينك وبين نفسك\n وفيما بينك وبين الناس: تباعدٌ في التلبيس والتدليس، وفيما بينك وبين الله: إدامة التبرَّي من الحَوْل والقوة، ومواصلة الاستقامة، وحفظ العهود معه على الدوام\n في التوكل: عدَم الانزعاج عند الفَقْدِ، وزوالِ البِشْر بالوجد، وفي الأمر بالمعروف: التحرُّز من تخلل المداهنة، قليلها وكثيرها، وألاَّ يترك ذلك لِفَزَعٍ ولا طَمَع، ولكن تَشْرَبُ مما تَسْقي، وتتصف بما تأمر، وتنتهي عما تَزْجُر\n ويقال: الصدق: أن يهتدي إليك كل أحد، ويكون عليك، فيما تقول وتضمر، اعتماد\n ويقال: الصدق: ألا تجنحَ إلى التأويلات\n انتهى كلام القشيري\n ثم شرع في غزة الأحزاب التي هي المقصودة من السوّرة، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ\n\n\n }\n",
      "translations": []
    }
  ]
}