{
  "chapter": "الأحزاب",
  "text": "يايها الذين ءامنوا۟ اذكروا۟ نعمة الله عليكم اذ جاءتكم جنود فارسلنا عليهم ريحا وجنودا لم تروها وكان الله بما تعملون بصيرا",
  "translations": [
    {
      "translation": "O you who believe, remember the favours of God to you when an army came against you and We sent a wind against them and forces that you did not see. But God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, call to mind Allah's favour to you when enemy hosts invaded you. Then We sent against them a wind and hosts that you did not see although Allah was observing all that you were then doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, recall God's favor to you when the army attacked you. We sent a wind and the armies, which you did not see, to support you. God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who believe! Remember the favour of Allah upon you when some armies came against you, so We sent against them a windstorm and the armies you could not see; and Allah sees your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Remember Allah's favor to you, when there came against you hosts, and We sent against them a wind and forces that you saw not. And Allah is Ever All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! call to mind the favor of Allah to you when there came down upon you hosts, so We sent against them a strong wind and hosts, that you saw not, and Allah is Seeing what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, remember God's blessing upon you when hosts came against you, and We loosed against them a wind, and hosts you saw not; and God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Remember Allah's favour unto you when there came against you hosts, and We sent against them a great wind and hosts ye could not see. And Allah is ever Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You who have attained to faith, remember God's blessings upon you when mighty armies massed against you. We sent a violent wind against them and hosts that you could not see. God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! remember Allah's favour unto you when there came unto you hosts, and We sent against them a wind and hosts which ye saw not, and Allah was of that which ye were working a Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Remember Allah’s blessing upon you when the hosts came at you, and We sent against them a gale and hosts whom you did not see, and Allah sees best what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Remember the Grace of Allah, (bestowed) on you, when there came down on you hosts (to overwhelm you): But We sent against them a hurricane and forces that ye saw not: but Allah sees (clearly) all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Remember Allah's Favour to you, when there came against you hosts, and We sent against them a wind and forces that you saw not [i.e. troops of angels during the battle of AlAhzab (the Confederates)]. And Allah is Ever AllSeer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, remember the Favor of Allah to you when there came against you hosts (armies). We unleashed against them a wind and hosts (angels) you could not see. Allah sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Remember God’s blessings upon you, when forces came against you, and We sent against them a wind, and forces you did not see. God is Observant of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, remember the favor of Allah upon you when armies came to [attack] you and We sent upon them a wind and armies [of angels] you did not see. And ever is Allah, of what you do, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[33:9] O you who believe! Remember God’s favour to you when hosts, of disbelievers, came against you, as confederates, at the time the Ditch (al-khandaq) was being dug, and We unleashed against them a [great] wind and hosts, of angels, you did not see. And God is ever Seer of what you do (read ta‘malūna to imply ‘in the way of [your] digging of the ditch’; or read ya‘malūna, ‘[of what] they do’, to imply ‘the idolaters’ forming of a confederation’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe Remember Allah's favour unto you) preserve Allah's favour in that He repelled the enemy from you by sending the east wind and angels (when there came against you hosts) the host of disbelievers, (and We sent against them a great wind) the east wind (and hosts) and a row of angels (you could not see. And Allah is ever Seer of what ye do) whether it is the digging of the trench or other things. 473\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ نادى سبحانه المؤمنين الموحدين، المواظبين على الطاعات بارتكاب الأوامر واجتناب المنهيات؛ كي يصلوا إلى ما أعد لهم ربهم من المثوبات المكرمات فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: تعداد نعم الله عليكم، وإحصاء فواضله المتوالية المتتالية المتسقة { ٱذْكُرُواْ } في عموم أوقاتكم وأحوالكم { نِعْمَةَ ٱللَّهِ } الفائضة { عَلَيْكُمْ } على تعاقب الأزمان، وتلاحق الآناء والأحيان، سيما نعمة إنجائكم من أعدائكم ونصركم عليهم، مع كونكم آيسين منه، أذكروا يا أهل يثرب { إِذْ جَآءَتْكُمْ جُنُودٌ } متعددة وأحزاب متعاقبة متلاصقة قاصدين لمقتكم واستئصالكم، وهم قريش وغطفان، ويهود بني قريظة وبني النضير، وكانوا زهاء اثني عشر ألفاً، وأنتم قليلون فحفرتم الخندق على المدينة، ثمَّ خرجتم تجاه الأعداء ثلاثة آلاف، والخندق بينكم وبينهم فقعدتم متقابلين، ومضى عليها قريب شهر لا حرب بينكم إلاَّ بالترامي بالنبل والحجارة فاضطررتم واضطربتم، فأوجستم في نفوسكم خيفة، وصرتم متذبذبين متزلزلين لا إلى القرار ولا إلى الفرار\n\n\n\n\nوبعدما أبصرناكم كذلك فاجأنا بإرسال الريح والملائكة إمداداً لكم، وتأييداً { فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً } أي: الصبا، فهبت عليهم إلى حيث تقلع أوتادهم، وتسقط الخيام عليهم، وتطفئ نيرانهم، وتكفي قدورهم، وتجيل خيولهم، وكانت في ليلة شاتية باردة في غاية البرودة { وَ } أرسلنا عليهم أيضاً { جُنُوداً } من الملائكة ظهرت جوانب معسكرهم، بحيث { لَّمْ تَرَوْهَا } في تلك الليلة المظلمة، بل لم تروها جنداً مثلها أصلاً، فقال حينئذٍ صناديدهم وكبراؤهم: النجاء النجاء، فإن محمداً قد بدأ بالسحر فانهزموا من غير قتال، فنجوتم سالمين عنايةً من الله، وإنجازاً لوعده، ومعجزةً لرسوله صلى الله عليه وسلم { وَكَانَ ٱللَّهُ } المطلع لأحوال عباده { بِمَا تَعْمَلُونَ } من حفر الخندق، والتزلزل والتذبذب، والرعب الخفي، وبما يعملون من التحزب والتوافق على استئصالكم { بَصِيراً } [الأحزاب: 9] رائيً عليماً منكم أمارات التذبذب والتزلزل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا اذكروا نعمةَ الله عليكم } ، أي: ما أنعم الله به عليكم يوم الأحزاب، وهو يوم الخندق، وكان بعد حرب أُحد بِسَنَةٍ\n { إذ جاءتكُمْ جنودٌ } أي: الأحزاب، وهم قريش، وغطفان، ويهود قريظة والنضير، وهو السبب في إيتانهم، { فأرسلنا عليهمْ ريحاً } أي: الصَّبَا، قال عليه الصلاة والسلام:\n\n \" نُصرت بالصَّبَا، وأُهْلكَتْ عاد بالدَّبُور \" \n\nقيل: كانت هذه الريح معجزة لأن النبي صلى الله عليه وسلم والمسلمين كانوا قريباً منها، ولم يكن بينهم إلا عُرض الخندق، وكانوا في عافية منها\n { و } لا شعور لهم بها\n وأرسلنا عليهم { جنوداً لم تروها } وهو الملائكة، وكانوا ألفاً، فقلعت الأوتاد، وقطعت الأطناب، وأطفأت النيران، وأكفأت القدور\n وكان سبب غزوة الأحزاب: أن نفراً من اليهود، منهم ابن أَبي الحقيق، وحُيَي بن أخطب، في نفر من بني النضير، لَمَّا أجلاهم النبيُّ صلى الله عليه وسلم من بلدهم، قَدِموا مكة فحرّضوا قريشاً على حرب رسول الله صلى الله عليه وسلم، ثم خرجوا إلى غطفان، وأشجع، وفزارة، وقبائلَ مِنَ العرب، يُحرضونهم على ذلك، على أن يعطوهم نصف تمر خَيْبَرَ كل سنة\n فخرجت قريش، وقائدها أبو سفيان، وخرجت غطفان، وقائدها عيينة بن حِصن، والحارث بن عوف في مُرة، وسعد بن رخيلة في أشجع، وعامر بن الطفيل في هوازن\n فلما سمع النبي صلى الله عليه وسلم بهم، ضرب الخندق على المدينة، برأي سلمان\n وكان أول مشهد شهده مع رسول الله صلى الله عليه وسلم، وهو يؤمئذ حُر\n وقال: يا رسول الله: إنا كنّا بفارس، إذا حُوصرنا: خَنْدَقْناَ علينا، فحفر الخندق، وباشر الحفر معهم بيده صلى الله عليه وسلم\n فنزلت قريش بمجتمع الأسيال من الجُرُفِ والغابة، في عشرة آلاف من أحابيشهم\n ونزلت عطفان وأهل نجد بذنب نَقَمَي، إلى جانب أُحد\n فخرج النبي صلى الله عليه وسلم والمسلمون حتى جعلوا ظهورهم إلى سَلْع، في ثلاثة آلاف من المسلمين، فضرب هناك عسكره، والخندق بينه وبين القوم، وأمر بالذراري والنساء فرفعوا في الآطام\n واشتد الخوف، فأقام النبي صلى الله عليه وسلم، وأقام المشركون، بِضعاً وعشرين ليلة، ولم يكن حرب غير الرمي بالنبل والحصى\n فلما اشتد البلاء بعث النبي صلى الله عليه وسلم إلى عُيينة بن حصن، والحارث بن عوف، وأعطاهما ثلث ثمار المدينة، على أن يرجعا بمَن معهما، وكتبوا الكتاب ولم يقع الإشهاد، فاستشار النبي صلى الله عليه وسلم سعد بن معاذ، وسعد بن عبادة، فقال سعد بن معاذ: أشيء أمرك الله به، لا بدّ من العمل به، أم شيء تُحبه فتصنعه، أم شيء تصنعه لنا؟ قال:\n\n \" لا، بل شيء أصنعه لكم، أردتُ أن أكْسِر عنكم شوكتهم \" \n\n \n\nفقال سعد: يا رسول الله لقد كنا مع القوم على شرك وعبادة الأوثان، لا نعبد الله ولا نعرفه، وهم لا يطعمون أن يأكلوا منها تمرة، إلا قِرىً، أو شراءً، أفحين أكرمنا الله بالإسلام، وأعزَّنا بك، نعطيهم أموالنا! لا نعطيهم إلا السيف\n فقال عليه الصلاة والسلام:\n\n \" فأنت وذاك \" \n\n، فمحا سعدُ ما في الكتاب، وقال: ليجهدوا علينا\n ثم إن الله تعالى بعث عليهم ريحاً باردة، في ليلة شاتية، فأحصرتهم، وأحثت الترابَ في وجوههم، وأمر الملائكة فقلعت الأوتاد، وقطعت الأطناب، وأكفأت القدور، وأطفأت النيران، وجالت الخيل بعضها في بعض\n وأرسل الله تعالى عليهم الرُعب، وكثر تكبير الملائكة في جوانب عسكرهم، حتى كان سيد كل خباء يقول: يَا بَني فلان، علمُّوا، فإذا اجتمعوا إليه قال: النَّجا، النَّجا، أوتيتم\n فانهزموا من غير قتال\n { وكان الله بما تعملون بصيراً } ، أي: بصيراً بعملكم، من حَفر الخندق، ومعاونة النبي صلى الله عليه وسلم، والثبات معه، فيجازيكم عليه، وقرأ أبو عمرو: بالغيب، أي: بما يعمل الكفار من البغي، والسعي في إطفاء نور الله، { إِذ جاؤوكم } هو بدل من: إذ جاءتكم، { من فوقكم } من أعلى الوادي، من قِبَل المشرق\n وهم بنو غطفان",
      "translations": []
    }
  ]
}