{
  "chapter": "سبإ",
  "text": "الحمد لله الذى له ما فى السموت وما فى الارض وله الحمد فى الءاخرة وهو الحكيم الخبير",
  "translations": [
    {
      "translation": "Praise be to Allah, to Whom everything in the heavens and everything in the earth belongs, and praise be to Him in the Next World. He is the All-Wise, the All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL PRAISE BE to God to whom belongs whatsoever is in the heavens and the earth, and His the praise in the world to come. He is all-wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise be to Allah to Whom belongs all that is in the heavens and all that is in the earth, and all praise be to Him in the World to Come. He is Most Wise, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only God who deserves all praise. To Him belongs all that is in the heavens and the earth and it is only He who deserves to be praised in the life to come. He is All-wise and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is to Allah – to Him only belongs all whatever is in the heavens and all whatever is in the earth – and His is the praise in the Hereafter; and He is the Wise, the All Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, to Whom belongs all that is in the heavens and all that is on the earth. His is all praise in the Hereafter, and He is the All-Wise, the All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All) praise is due to Allah, Whose is what is in the heavens and what is in the earth, and to Him is due (all) praise in the hereafter; and He is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to God to whom belongs whatsoever is in the heavens and whatsoever is in the earth. To Him belongs praise also in the Hereafter; He is the All-wise, the All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth. His is the praise in the Hereafter, and He is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, to whom belongs all that the heavens and the earth contain and praise be to Him in the Hereafter. He is the All Wise, the All Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise Unto Allah whose is whatsoever is in the heavens and whatsoever is in the earth; and His is the praise in the Hereafter And He is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to Allah to whom belongs whatever is in the heavens and whatever is in the earth. To Him belongs all praise in the Hereafter, and He is the All-wise, the All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, to Whom belong all things in the heavens and on earth: to Him be Praise in the Hereafter: and He is Full of Wisdom, acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the praises and thanks be to Allah, to Whom belongs all that is in the heavens and all that is in the earth. His is all the praises and thanks in the Hereafter, and He is the AllWise, the AllAware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise is for Allah, to whom belongs all that is in the heavens and the earth! And the Praise belongs to Him in the Everlasting Life. He is the Wise, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, to Whom belongs everything in the heavens and the earth; and praise be to Him in the Hereafter. He is the Wise, the Expert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[All] praise is [due] to Allah, to whom belongs whatever is in the heavens and whatever is in the earth, and to Him belongs [all] praise in the Hereafter. And He is the Wise, the Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:1] Praise be to God — God, exalted be He, praises Himself with these [words]; the import constitutes the eulogy that ‘praise’ is ever-established [for God] and it entails the attribution to Him of all that is beautiful, exalted be He — to Whom belongs whatever is in the heavens and whatever is in the earth, as possessions and creation. And to Him belongs [all] praise in the Hereafter, as in this world, for His friends praise Him as they enter Paradise. And He is the Wise, in what He does, the Aware, of His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said in the interpretation of Allah's saying (Praise be to Allah): '(Praise be to Allah) He says: Gratitude belongs to Allah; this is because He is kind to His creation and the latter thanks Him for it, (unto Whom belongeth whatsoever is in the heavens) of creation (and whatsoever is in the earth) of created beings. (His is the praise) the favour (in the Hereafter) upon the dwellers of Paradise in Paradise, (and He is the Wise) in His command and decree; He commanded that none should be worshipped save Him, (the Aware) He knows His created beings as well as their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الحمد لله الذي له ما في السماوات وما في الأرض } بجعله مظاهر لصفاته الظاهرة وكمالاته الباهرة وظهوره فيها بالحجب الجلالية { وله الحمد في الآخرة } بتجليه على الأرواح بالكمالات الباطنة والصفات الجمالية\n أي: له الحمد بالصفات الرحمانية في الدنيا ظاهراً\n وله الحمد بالصفات الرحيمية في الآخرة باطناً { وهو الحكيم } الذي أحكم ترتيب عالم الشهادة بمقتضى حكمته { الخبير } الذي نفذ علمه في بواطن عالم الغيب للطافته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَمْدُ } المحيط\n المستوعب لجميع المحامد الناشئة من ألسنة عموم ما لمع عليه برق الوجود\n ثابت { للَّهِ } المستجمع لجميع الأوصاف والأسماء المربية لعموم الأشياء الكائنة غيباً وشهادةً { ٱلَّذِي } ثبت { لَهُ } ملكاً وتصرفاً وإظهاراً وإعداماً وإعادةً جميع { مَا فِي ٱلسَّمَٰوَٰتِ } أي: علويات عالم الأسماء والصفات والأعيان الثابتة في الأزل { وَمَا فِي ٱلأَرْضِ } أي: سفليات عالم الطبيعة المنعكسة من العلويات وما بينهما من الكوائن والفواسد التي برزت بنور الوجود على مقتضى الوجود\n من مكمن العدم إلى فضاء الظهور { وَ } بعدما ثبت أن الكل منه بدأ وإليه يعود في الانتهاء\n ثبت { لَهُ ٱلْحَمْدُ } والثناء الصادر من عموم ألسنة المظاهر\n المتوجه نحو المظهر الموجد طوعاً لا غيره من الوسائل والأسباب العادية\n إذ منتهى الكل إليه { فِي ٱلآخِرَةِ } كما أن مبدأه منه في الأولى\n فله الحمد في الأولى والأخرى { وَ } كيف لا { هُوَ ٱلْحَكِيمُ } المتقن في أفعاله بالاستقلال بلا شريك وظهير { ٱلْخَبِيرُ } [سبأ: 1] عن كيفية اتحاد المظاهر وإعدامها\n أولاًَ وآخراً\n أزلاً وأبداً\n\n\nإذا هو سبحانه بمقتضى علمه الحضوري { يَعْلَمُ مَا يَلِجُ فِي ٱلأَرْضِ } أي: ظلمة الطبيعة القابلة لفيضان الاستعدادات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { الحمدُ لله } إن أُجري على المعهود فهو بما حمد به نفسه محمود\n وإن أجرى على الاستغراق فله لكل المحامد الاستحقاق\n واللام في لله للتمليك لأنه خالقُ ناطقِ الحمد أصلاً\n فكان بملكه مالك للحمد\n وللتحميد أهلاً\n { الذي له ما في السماوات وما في الأرض } خلقاً\n وملكاً\n وقهراً\n فكان حقيقياً بأن يُحمد سرًّا وجهراً\n { وله الحمدُ في الآخرة } كما له الحمد في الدنيا إذ النعم في الدارين هو مُوليها والمُنعم بها\n غير أن الحمد هنا واجب لأن الدنيا دار التكليف\n وثمَّ لا لأن الدار دار التعريف\n لا دار التكليف\n وإنما يحمد أهل الجنة سروراً بالنعيم\n وتلذذاً بما نالوا من الفوز العظيم\n كقوله:\n[الزمر: 74] و\n[فاطر: 34] فأشار إلى استحقاقه الحمد في الدنيا بقوله: { الحمد لله الذي له ما في السماوات وما في الأرض } وأشار إلى استحقاقه في الآخرة بقوله: { وله الحمدُ في الآخرة وهو الحكيمُ } بتدبير ما في السماوات والأرض\n { الخبيرُ } بضمير مَن يحمده ليوم الجزاء والعَرْض\n { يعلمُ ما يَلِجُ } ما يدخل { في الأرض } من الأموات والدفائن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:36",
      "similarity": 0.5618520433627243
    },
    {
      "verse": "28:70",
      "similarity": 0.5274395737214894
    },
    {
      "verse": "22:64",
      "similarity": 0.5107588231337674
    },
    {
      "verse": "31:26",
      "similarity": 0.5107588231337674
    },
    {
      "verse": "100:11",
      "similarity": 0.49040546880057073
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/34:1.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/34:1.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/34:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}