{
  "chapter": "سبإ",
  "text": "يعملون له ما يشاء من محريب وتمثيل وجفان كالجواب وقدور راسيت اعملوا۟ ءال داود شكرا وقليل من عبادى الشكور",
  "translations": [
    {
      "translation": "They made for him anything he wished: high arches and statues, huge dishes like cisterns, great built-in cooking vats. 'Work, family of Dawud, in thankfulness!' But very few of My slaves are thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him whatever he wished, synagogues and statues, dishes large as water-troughs, and cauldrons firmly fixed (on ovens; and We said): \"O House of David, act, and give thanks.\" But few among My creatures are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him whatever he would desire: stately buildings, images, basins like water-troughs and huge, built-in-cauldrons: “Work, O house of David, in thankfulness (to your Lord). Few of My servants are truly thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would make for him anything that he wanted like fortresses, statues, large basins like reservoirs, and huge immovable cooking pots. It was said, \"Family of David, worship and act gratefully. Only few of my servants are grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him whatever he wished – synagogues and statues, basins like ponds, and large pots built into the ground; “Be thankful, O the people of Dawud!” And few among My bondmen are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worked for him as he desired on Maharib, Tamathil, large basins like Jawab and Qudur Rasiyat. \"Work you, O family of Dawud, with thanks!\" But few of My servants are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him what he pleased of fortresses and images, and bowls (large) as watering-troughs and cooking-pots that will not move from their place; give thanks, O family of Dawood! and very few of My servants are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "fashioning for him whatsoever he would -- places of worship, statues, porringers like water-troughs, and anchored cooking-pots. 'Labour, O House of David, in thankfulness; for few indeed are those that are thankful among My servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him what he willed: synagogues and statues, basins like wells and boilers built into the ground. Give thanks, O House of David! Few of My bondmen are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him whatever he desired: palaces and statues, basins like reservoirs, and large cooking vessels fixed in their places. We said, \"Give thanks, house of David, for few of My servants are truly grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worked for him whatsoever he pleased, of lofty halls and statues and basins like cisterns and cauldrons Standing firm. Work ye, house of Da'ud! with thanksgiving; few of My bondmen are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They built for him as many temples as he wished, and figures, basins like cisterns, and caldrons fixed [in the ground]. ‘O House of David, act thankfully, and few of My servants are grateful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worked for him as he desired, (making) arches, images, basons as large as reservoirs, and (cooking) cauldrons fixed (in their places): \"Work ye, sons of David, with thanks! but few of My servants are grateful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worked for him what he desired, (making) high rooms, images, basins as large as reservoirs, and (cooking) cauldrons fixed (in their places). \"Work you, O family of Dawud (David), with thanks!\" But few of My slaves are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him whatever he wanted, arches, statues, bowls as basins, and fixed cauldrons. (We said:) 'Give thanks, House of David and work' Yet only a few of My worshipers are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him whatever he wished: sanctuaries, statues, bowls like pools, and heavy cauldrons. “O House of David, work with appreciation,” but a few of My servants are appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made for him what he willed of elevated chambers, statues, bowls like reservoirs, and stationary kettles. [We said], \"Work, O family of David, in gratitude.\" And few of My servants are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:13] They fashioned for him whatever he wished: lofty shrines (mahārīb are high edifices which are ascended by stairs) and statues (tamāthīl is the plural of timthāl, which is any thing which you fashion as a likeness [of another]), in other words, brass, crystal or marble figures — the use of figures was not prohibited according to his Law; and basins (jifān is the plural of jafna) like cisterns (jawābin is the plural of jābiya, which is a large basin) — around each ‘basin’ a thousand men would gather to eat — and cauldrons built into the ground, fixed with foundations, and cannot be moved from their places: these were made from the [rocks of the] mountains of Yemen, and to which one ascended by climbing up a ladder. And We said: ‘Work, O, House of David, in obedience to God, in thankfulness, to Him for what He has given you. And few indeed of My servants are thankful’, labouring in obedience to Me in thanks for My favours.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They made for him what he willed: synagogues and statues) of angels, prophets and other righteous servants so that people look at them and follow their example of worshipping Allah, (basins like wells) stable basins (and boilers built into the ground) from which up to 1,000 can eat. (Give thanks, House of David) i.e. Solomon! He says: do works of goodness in order that you give thanks for the blessings I gave you. (Few of My bondmen are thankful) to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَعْمَلُونَ لَهُ مَا يَشَآءُ مِن مَّحَارِيبَ وَتَمَاثِيلَ وَجِفَانٍ كَٱلْجَوَابِ وَقُدُورٍ رَّاسِيَاتٍ }\n المَحاريبُ: مَقاديمُ المَساجدِ والمَجالسِ: واحدُها مِحرابٌ\n والتَماثيلُ: الصُّورُ\n والجِفانُ: [القِصاعُ الكِبارُ\n والجَوابُ]\n الحِياضُ واحدُها جَابيةٌ\n وقُدُورٌ راسياتٌ\n معناه عظامٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {They work for him whatever he wills of treasuries and images and hewn graves like the open grave.}\n\n\nThe minarets are the columns of mosques and assemblies: one of them is a minaret.\n\n\nAnd the likenesses: the images\n\n\nAnd the great river: {the great river}\n\n\nAnd the answer is...\n\n\nThe menstrual period is one of the things that can be cured.\n\n\nAnd {the} {mighty} {ones} {are} {prostrate}.\n\n\nThis refers to bones.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك صارا مقهورين تحت حكمه، أمرهم ما يشاء حيث { يَعْمَلُونَ لَهُ مَا يَشَآءُ مِن مَّحَارِيبَ } أي: مساجد لطيفة وحصون حصينة وأماكن منيعة، إنما سمي بها، يحرب عليها ويتلجأ إليها في الشدة ولدى الحاجة، ومن جملة ما علموا له من المساجد الحصينة العجيبة: بيت المقدس، في غاية الحسن والبهاء وكمال المنعة، ولم يزل على عمارته عليه السلام إلى أن خربه بختنصر { وَتَمَاثِيلَ } هي الصور من الزجج ورخام ونحاص وصفر وشبهه، فكانوا يعملون صور الملائكة والأنبياء والصالحين في البقاع الشريفة والمساجد والمعابد؛ ترغيباً للناس في دخولها والعبادة فيها وتنشيطاً، وقد عملوا له في أسفل كرسيه أسدين، وفي فوقه نسرين، فإذا أراد الصعود عليه بسط له الأسدان ذراعيهما فارتقى، وإذا تمكن عليه أظله النسران بجناحيهما، وحرمة التصاوير شرع مجدد { وَجِفَانٍ } أي: صحاف عظيمة وقصاع كبيرة وسيعة { كَٱلْجَوَابِ } أي: كالحياض الكبار، ومن غاية كبرها يقعد على كل جفنة عند الأكل ألف رجل { وَقُدُورٍ رَّاسِيَاتٍ } ثابتات على أثافيهن بحث لا تنزل عنها؛ لثقلها وكبرها، وقيل: أثافيها متصلة بها، وكانت يُرتقى إليها بالسلالم\n\n\nوبعدما أعطى آل داوود من الجاه والثروة والعظمة ما لم يعط أحداً من العالمين، قيل لهم من قبل الحق؛ تنبيهاً عليهم وحثاً لهم إلى مواظبة الشرك ومدوامة الرجوع نحو المفضل الكريم: { ٱعْمَلُوۤاْ } يا { آلَ دَاوُودَ } عملاً صالحاً مرضياً عند الله، ولا سيما اشكروا { شُكْراً } مستوعباً لجميع جوارحكم وجوانحكم وأوقاتكم وحالاتكم بحيث لا يشذ عنكم وقت لم يصدر عنكم فيها شكر { وَ } اعلموا وإن بالغتم في أداء شكر نعم الله وبالغتم بمقتضى المرتبة القصوى منه، ما أديتم حق شكره؛ إذ { قَلِيلٌ مِّنْ عِبَادِيَ ٱلشَّكُورُ } [سبأ: 13] لأنه وإن استوفى واستوفر في أدائه إلى حيث يستوعب جميع أركانه وجوارحه وجوانحه وجميع خواطره وهواجس نفوسه وسره ونجواه، ومع ذل كلا يوفي حقه؛ لأن توفيقه وإقداره سبحاه عليه أيضاً نعمة مستحقة للشكر، مستدعية له لا إلى نهاية، ولذا قيل: الشكور من يرى نفسه عاجزاً عن الشكر؛ إذ لا يمكن الإتيان به على وجه لا يترتب عليه نعمة أخرى مستلزمة لشكر آخر\n\n\n\n\nثم لما كان داوود عليه السلام أسس بيت المقدس ي موضع فسطاط موسى عليه السلام، فمات قبل تمامه، فوصى بإتمامه إلى سليمان عليه السلام، فاستعمل الجن فيه، فلم يتم أيضاً، إذا أُخبر من قِبل الحق بأجله، فتغمم غماً شديداً بعدم إتمام البيت، فأراد أن يعمِّي ويستر على الجن موته ليتموه، فأمرهم أن يعلموا له صرحاً من قوارير له باب، فعملوا له صرحاً كذلك\n\n\n\n\nفدخل عليه على مقتضى عادته المستمرة من التحنث والتخلي للعبادة شهراً وشهرين وسنة وسنتين، فاشتغل بالصلاة متكئاً على عصاه، فقبض وهو متكئ عليها، فبقي كذلك إلى أن أكلت الأرضة عصاه، فخرَّ، ثم فتحوا عنه وأرادوا أن يعرفوا وقت موته، فوضعوا الأرضة على العصا، فأكلت يوماً وليلةً مقداراً منها، فقاسوا على ذلك، فعلموا أنه قد مات منذ سنة، وكان عمره حنيئذٍ ثلاثاً وخمسين سنة، وملك وهو ابن ثلاثة عشرة سنة، وابتدأ لعمارة البيت لأربع مضين عن ملكه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يعملون له ما يشاءُ من محَاريبَ } أي: مساجد، أو مساكن وقصور، والمحراب: مقدم كل مسجد ومجلس وبيت\n { وتماثيلَ } صور الملائكة والأنبياء، على ما اعتادوا من العبادات، ليراها الناس، فيعبدوا نحو عبادتهم\n صنعوا له ذلك في المساجد، ليجتهد الناس في العبادة\n أو: صور السباع والطيور، رُوي أنهم عملوا له أسدين في أسفل كُرسيه، ونسْريْن فوقه، فإذا أراد أن يصعد بسطَ الأسدان له ذرَاعيهما، وإذا قعد أظلّه النسران بأجنحتهما\n وكان التصوير مباحاً\n { وجِفانٍ } وصحاف، جمع: جفنة، وهي القصعة، { كالجَوَاب } جمع جابية، وهي الحياض الكبار\n قيل: كان يقعد على الجفنة ألف رجل، يأكون بين يديه، { وقدور راسياتٍ } ثابتات على الأثافي، لا تنزل لِعظمها، ولا تعطل لدوام طبخها\n وقيل: كان قوائمها من الجبال، يصعد إليها بالسلالم، وقيل: باقية باليمن\n وقلنا: { اعملوا آلَ داودَ شُكراً } أي: اعملوا بطاعة الله، واجهدوا أنفسكم في عبادته، شكراً لِما أولاكم من نعمه\n قال ثابت: كان داود جزأ ساعات الليل والنهار على أهله، فلم تكن تأتي ساعة من ساعات الليل والنهار إلا وإنسان من آل داود قائم يُصلّي\n هـ\n وقال سعيد بن المسيب: لما فرغ سليمان من بيت المقدس انغلقت أبوابه، فعالجها، فلم تنفتح، حتى قال: بصلوات آل داود إلا فُتحت الأبواب، ففتحت، ففرغ له سليمان عشرة آلاف من قراء بني إسرائيل خمسة آلاف بالليل، وخمسة آلاف بالنهار، فلا تأتي ساعة من ليل ولا نهار إلا والله عزّ وجل يُعبد فيها\n هـ\n وعن الفضيل: { اعملوا آل داود } أي: ارحموا أهل البلاء، وسلوا ربكم العافية\n و { شكراً }: مفعول له، أو حال، أي: شاكرين، أو مصدر، أي: اشكروا شكراً لأن \" اعملوا \" فيه معنى اشكروا، من حيث إن العمل للنعم شكرٌ، أو: مفعول به، أي: إنَّا سخرنا لكم الجن يعملون لكم ما شئتم، فاعملوا أنتم شكراً\n { وقليل من عباديَ الشكورُ } يحتمل أن يكون من تمام الخطاب لداود عليه السلام، أو خطاب لنبينا صلى الله عليه وسلم\n\n\nوالشكور: القائم بحق الشكر، الباذل وسعه فيه، قد شُغل به بقلبه ولسانه وجوارحه في أكثر أوقاته، اعتقاداً واعترافاً وكدحاً\n وعن ابن عباس: هو مَن يشكر على أحواله كلها\n وقيل: مَن شكر على الشكر، ومَن يرى عجزه عن الشكر\n قال البيضاوي: لأن توفيقه للشكر نعمة، فتقتضي شكراً آخر، لا إلى نهاية، ولذلك قيل: الشكور مَن يرى عجزه عن الشكر\n هـ\n  الإشارة: وسخرنا لسليمان ريح الهداية، تهب بين يديه، يُهتدى به مسيرة شهر وأكثر، وأسلنا لوعظه وتذكيره العيون الجامدة، فقطرت بالدموع خُشوعاً وخضوعاً\n وكل مَن أقبل على الله بكليته سخرت له الكائنات، جنها وإنسها، يتصرف بهمته فيها\n فحينئذ يقال له ما قيل لآل داود: اعملوا آل داود شكراً\n قال الجنيد: الشكر: بذل المجهود بين يدي المعبود\n وقال أيضاً: الشكر ألا يُعصى الله بنعمه\n والشكر على ثلاثة أوجه: شكر بالقلب، وشكر باللسان، وشكر بسائر الأركان\n فشكر القلب: أن يعتقد أن النعم كلها من الله، وشكر اللسان: الثناء على الله وكثرة المدح له، وشكر الجوارح: أن يعمل العمل الصالح\n وسئل أبو حازم: ما شكر العينين؟ قال: إذا رأيت بهما خيراً أعلنته، وإذا رأيت بهما شرًّا سترته، قيل: فما شكر الأذنين؟ قال: إذا سمعت بهما خيراً وعيته، وإذا سمعت بهما شرًّا دفنته، قيل: فما شكر اليدين؟ قال: ألا تأخذ بهما ما ليس لك، ولا تمنع حقًّا هو لله فيهما، قيل: فما شكر البطن؟ قال: أن يكون أسفلُه صبراً، وأعلاه علماً، قيل: فما شكر الفرج؟ قال: كما قال الله تعالى:\n\n[المؤمنون: 5] الآية، قيل: فما شكر الرجلين؟ قال: إن رأيت شيئاً غبطته استعملتهما، وإن رأيت شيئاً مقته كفقتهما\n هـ\n والناس في الشكر درجات: عوام، وخواص، وخواص الخواص\n فدرجة العوام: الشكر على النِّعم، ودرجة الخواص: الشكر على النِّعم والنقم، وعلى كل حال، ودرجة خواص الخواص: أن يغيب عن النِعم بمشاهدة المُنعم\n قال رجل لإبراهيم بن أدهم: إن الفقراء إذا أُعطوا شكروا، وإذا مُنعوا صبروا، فقال: هذه أخلاق الكلاب عندنا، ولكن الفقراء إذا مُنعوا شكروا، وإذا أُعطوا آثروا\n هـ\n وهذان الآخران يصدق عليهما قوله تعالى: { وقليل من عبادي الشكور } ، وخصه القشيري بالقسم الثالث، فقال: فكان الشاكر يشكر على البَذْلِ، والشكور على المنع، فكيف بالبذل؟ ثم قال: ويقال في { قليل من عبادي الشكور }: قليل مَن يأخذ النعمة مني، فلا يحملها على الأسباب، فيشكر الوسائط ولا يشكرني\n وفي الحِكَم: \" مَن لم يشكر النعم فقد تعرّض لزوالها، ومَن شكرها فقد قيّدها بعقالها \"\n فالشكر قيد الموجود، وصيد المفقود\n والله تعالى أعلم\n ثم ذكر موت سليمان عليه السلام فقال: { فَلَمَّا قَضَيْنَا عَلَيْهِ ٱلْمَوْتَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:121",
      "similarity": 0.13037310208656563
    },
    {
      "verse": "2:279",
      "similarity": 0.11595698748943734
    },
    {
      "verse": "68:50",
      "similarity": 0.11431296046347522
    },
    {
      "verse": "38:21",
      "similarity": 0.11347428723841965
    },
    {
      "verse": "12:6",
      "similarity": 0.11289386218796561
    }
  ]
}