{
  "chapter": "سبإ",
  "text": "فقالوا۟ ربنا بعد بين اسفارنا وظلموا۟ انفسهم فجعلنهم احاديث ومزقنهم كل ممزق ان فى ذلك لءايت لكل صبار شكور",
  "translations": [
    {
      "translation": "They said, 'Our Lord, put more distance between our staging posts.' They wronged themselves so We is steadfast and thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: \"O Lord, make the distance between the stages of our journeys longer;\" but (by doing so) they wronged themselves. So We turned them into bygone tales, and dispersed them, scattered in all directions. Surely there are signs in this for those who endeavour and are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: “Lord, make the stages of our journeys longer.” They wronged their own selves so We reduced them to bygone tales, and utterly tore them to pieces. Verily there are Signs in this for everyone who is steadfast and thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Lord, make the distances of our journeys longer.\" They did injustice to themselves and We turned their existence into ancient tales by making them disintegrate totally. In this there is evidence (of the truth) for every forbearing and grateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they said, “Our Lord! Make the stage between our journeys longer” and they wronged themselves – We therefore turned them into fables and scattered them completely with adversity; indeed in this are signs for every greatly enduring, most grateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: \"Our Lord! Make the stages between our journey longer,\" and they wronged themselves; so We made them as tales (in the land), and We dispersed them all totally. Verily, in this are indeed signs for every steadfast, grateful (person).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: O our Lord! make spaces to be longer between our journeys; and they were unjust to themselves so We made them stories and scattered them with an utter scattering; most surely there are signs in this for every patient, grateful one\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said, 'Our Lord, prolong the stages of our travel'; and they wronged themselves, so We made them as but tales, and We tore them utterly to pieces. Surely in that are signs for every man enduring, thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: Our Lord! Make the stage between our journeys longer. And they wronged themselves, therefore We made them bywords (in the land) and scattered them abroad, a total scattering. Lo! herein verily are portents for each steadfast, grateful (heart).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but they said, \"Our Lord! Make the stages of our journeys longer.\" Thus they wronged themselves and We made them bygone tales and scattered them throughout the land. There are certainly signs in that for everyone who is steadfast and thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they said: Our Lord make the distance between our journeys longer. And they wronged themselves. Wherefore We made them by words and dispersed them with a total dispersion. Verily herein are signs for every persevering, grateful persons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said, ‘Our Lord! Make the stages between our journeys far apart,’ and they wronged themselves. So We turned them into folktales and caused them to disintegrate totally. There are indeed signs in that for every patient and grateful [servant].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: \"Our Lord! Place longer distances between our journey-stages\": but they wronged themselves (therein). At length We made them as a tale (that is told), and We dispersed them all in scattered fragments. Verily in this are Signs for every (soul that is) patiently constant and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: \"Our Lord! Make the stages between our journey longer,\" and they wronged themselves, so We made them as tales (in the land), and We dispersed them all, totally. Verily, in this are indeed signs for every steadfast grateful (person).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: 'Lord, make the stages between our journeys longer' so they wronged themselves; so We made them news and We tore them utterly into pieces. Surely, there are signs in this for every one who is patient, thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said, “Our Lord, lengthen the distances of our journeys.” They wronged themselves; so We made them history, and We scattered them in every direction. In this are lessons for every steadfast and appreciative person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But [insolently] they said, \"Our Lord, lengthen the distance between our journeys,\" and wronged themselves, so We made them narrations and dispersed them in total dispersion. Indeed in that are signs for everyone patient and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:19] But they said, ‘Our Lord, make far apart (ba‘‘id: a variant reading has bā‘id) the stages of our travel’, to Syria: make these [stages through] deserts, so that they could glory before the poor in riding their camels and bearing their supplies and water, and so they behaved wantonly with the graces [bestowed on them by God], and they wronged their souls, through disbelief, and so We made them bywords, [of wrongdoing] in this respect, for those who came after them, and We caused them to disintegrate totally, We scattered them all over the lands. Surely in that, which is mentioned, there are signs, lessons, for every [servant who is] steadfast, [in refraining] from acts of disobedience, grateful, for [God’s] graces.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "After this their prophets said to them: \"Give thanks for the blessings of your Lord lest He takes them away as He took away the blessings he gave you before\". (But they said: Our Lord!) our Lord! (Make the stage between our journeys longer. And they wronged themselves) by means of disbelief and idolatry and failed to give thanks for those bounties, (therefore We made them bywords (in the land)) for people who came after them (and scattered them abroad) in different lands, (a total scattering) and We destroyed them completely. (Lo! Herein) in what We have done to them (verily are portents) signs and lessons (for each steadfast) in obedience, (grateful (heart)) for the bounties of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَجَعَلْنَاهُمْ أَحَادِيثَ } معناه عِبرٌ\n\n\n\n\nوقوله تعالى: { وَمَزَّقْنَاهُمْ كُلَّ مُمَزَّقٍ } معناه فَرقْناهُم وبَدَّدناهُم كُلَّ مُفرقٍ مُبددٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We made them {ahadeeth}\" means an allegory.\n\n\nAnd His saying, {And We have torn them asunder}, means that We have divided them and increased them in every way.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعد توجه الفقراء إلى ديارهم\n وازدحموا لكمال الخصب والرفاهية والمعيشة الوسيعة وسهولة الطريق { فَقَالُواْ } متشكين إلى الله من مزاحمة الفقراء وإلمامهم عليهم\n كافرين لنعمة التوسعة والسهولة: { رَبَّنَا بَاعِدْ بَيْنَ } منازل { أَسْفَارِنَا } حتى نحتاج إلى حمل الزاد وشد الرواحل\n ليشق الأمر على الفقراء\n فيتنحوا عنا ولم يزدحموا علينا { وَظَلَمُوۤاْ أَنفُسَهُمْ } بطلب هذا التعب\n فأجاب الله دعاءهم\n وخرب القرى التي بينهم وبين الشام\n وانصرف الفقراء عنهم\n وانقطع دعاؤهم لهم\n فاشتد الأمر عليهم\n وتشتتوا في البلاد\n ولم يبق عليهم شيء من التوسعة والرفاهية\n بل صاروا متفرقين مشتتين { فَجَعَلْنَاهُمْ } أي: قصة أمنهم وفاهيتهم وجمعيتهم\n بعدما عكسنا الأمر عليهم { أَحَادِيثَ } لمن بعدهم\n يتحدثون بينهم\n متعجبين قائلين على سبيل التحسر في أمثالهم: \" تفرق أيدي سبأ \"\n\n\n{ وَمَزَّقْنَاهُمْ كُلَّ مُمَزَّقٍ } أي: فرقناهم في البلاد تفريقاً كلياً إلى حيث لحق غسان منهم بـ \" الشامِ \" \n وأنمار بـ \" يثرب \" وجذام بـ \" تهامة \" والأزد بـ \" عمان \" { إِنَّ فِي ذَلِكَ } التبديل والتشتيت\n وأنواع المحن والنقم بعد النعم { لآيَاتٍ } دلائل واضحات على قدرة القدير الحكيم العليم\n المقتدر على الإنعام والانتقام { لِّكُلِّ صَبَّارٍ } على المتاعب والمشاق الواردة عليه بمقتضى ما ثبت له في لوح القضاء\n ومضى على الرضا بمقتضيات الحكيم العليم { شَكُورٍ } [سبأ: 19] لنعم الله الفائضة عليه\n مواظب أداء حقوقه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فقالوا ربَّنا باعِدْ بين أسفارِنَا } قالوا: يا ليتها كانت بعيدة\n نسير على نجائبنا\n ونتخذ الزاد\n ونختص بالربح في تجاراتنا\n أرادوا أن يتطاولوا على الفقراء بالركوب على الرواحل\n ويختصوا بالأرباح\n وقرأ يعقوب \" ربُّنا \" بالرفع \" باعَدَ \" بفتح العين\n فربنا: مبتدأ\n والجملة: خبر\n على أنه شكوى منهم ببُعد سفرهم\n إفراطاً في الترفيه وعدم الاعتداد بالنعمة\n وقرأ ابن كثير وأبو عمرو وهشام بشد العين\n من \" بعِّد \" المضعف\n والباقون بالألف والتخفيف\n من: باعد\n بمعنى \" بعد \" المشددة\n { وظلموا أنفسَهم } بما قالوا\n وما طلبوا\n ففرّق الله شملهم\n كما قال تعالى: { فجعلناهم أحاديثَ } يتحدث الناس بهم\n ويتعجبون من أحوالهم\n ويضرب بهم الأمثال\n يقال: تفرقوا أيادي سبأ\n وأيدي سبأ\n يقال بالوجهين\n وفي الصحاح: ذهبوا أيادي سبأ\n أي: متفرقين\n فهو من المُركّب تركيب مزج\n { ومزَّقناهم كل مُمزّقٍ } أي: فرقناهم كل تفريق\n فتيامن منهم ست قبائل\n وتشاءمت أربعة\n حسبما تقدم في الحديث\n قال الشعبي: أما غسان فلحقوا بالشام\n وأما أنمار فلحقوا بيثرب\n وأما خزاعة فلحقوا بتهامة\n والأزد بنعمان\n هـ\n قلت: وفيه مخالفة لظاهر الحديث\n فإن أنمار جد خثعم وبجيلة\n ولم يكونوا في المدينة\n والذي هو المشهور أن الأوس والخزرج هما اللذان قدما المدينة\n فوجدوا فيها طائفة من بني إسرائيل\n بعد قتلهم للعماليق\n وسبب نزولهم بها: أن حَبْرين منهم مَرَّا بيثرب مع تُبع\n فقالا له: نجد في علمنا أن هذه المدينة مهاجرَ نبي\n يخرج في آخر الزمان\n يكون سنه كذا وكذا\n فاستوطناها\n يترصَّدان خروجه صلى الله عليه وسلم\n فمن نسلهما بقيت اليهود في المدينة\n والأوس والخزرج هما ابنا حارثة بن ثعلبة بن عمرو بن حارثة بن امرىء القيس بن ثعلبة بن مازن بن الأسد بن الغوث ابن بنت مالك بن زيد بن كهلان بن سبأ\n\nوولد مازن بن الأسد هم غسان\n سموا بماء اليمن\n شربوا منه\n ويقال: غسان: ماء بالشمال شربوا منه\n نُسبوا إليه\n قال حسان:\n{ إنَّ في ذلك لآيَاتٍ لكل صبَّارٍ } عن المعاصي { شكورٍ } للنعم\n أو: لكل مؤمن لأن الإيمان نصفان نصفه صبر\n ونصفه شكر\n الإشارة: وجعلنا بين السائرين وبين منازل الحضرة المقدسة منازلَ ظاهرة\n ينزلوها\n ويرحلون عنها\n آمنين من الرجوع\n إن صَدَقوا في الطلب\n وهي منازل كثيرة\n وأهمها اثنا عشر مقاماً: التوبة\n والخوف\n والرجاء\n والزهد\n والصبر\n والشكر\n والتوكُّل\n والرضا\n والتسليم\n والمراقبة\n والمشاهدة\n ومنازل الحضرة هي الفناء\n والبقاء\n وبقاء البقاء\n والترقِّي في معاريج الأسرار والكشوفات\n أبداً سرمداً\n يقال للسائرين: سيروا فيها\n وأقيموا في كل منزل منها\n ليالي وأياماً\n حتى يتحقق به نازله\n ثم يرحل عنه إلى ما بعده\n ثم إن قوماً سئموا من السير وادَّعوا القوة\n فقالوا: ربَّنا باعد بين أسفارنا حتى يظهر عزمنا وقوتنا\n وظلموا أنفسهم بذلك\n ففرقناهم عنا كل تفريق\n وعوّقناهم عن السير كل تعويق\n ليكون ذلك آية وعبرة لمَن بعدهم\n فلا يخرجون عن مقام الاستضعاف والمسكنة\n والانكسار والذلة\n \" أنا عند المنكسرة قلوبهم من أجلي \"\n وسبب الحرمان هو إبليس كما قال تعالى: { وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:7",
      "similarity": 0.7031670603361645
    },
    {
      "verse": "80:15",
      "similarity": 0.22041256615271168
    },
    {
      "verse": "80:38",
      "similarity": 0.21747460682023662
    },
    {
      "verse": "74:34",
      "similarity": 0.21627044979150442
    },
    {
      "verse": "62:5",
      "similarity": 0.1700158383864317
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}