{
  "chapter": "سبإ",
  "text": "لقد كان لسبا فى مسكنهم ءاية جنتان عن يمين وشمال كلوا۟ من رزق ربكم واشكروا۟ له بلدة طيبة ورب غفور",
  "translations": [
    {
      "translation": "There was also a sign for Saba in their dwelling place: two gardens - one to the right and one to the left. 'Eat of your Lord's provision and give thanks to Him: a bountiful land and a forgiving Lord.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a sign for the people of Saba in their habitations: Two gardens, on the right and left. (And they were told:) \"Eat of what your Lord has given you and be thankful. Fair is your land, and forgiving your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Sheba there was also a Sign in their dwelling place: the two gardens to the right and to the left. “Eat of your Lord's provision, and render thanks to Him. Most pleasant is your land and Most Forgiving is your Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was evidence (of the truth) for the people of Sheba in their homeland. (We gave them) two gardens, one on the left and one on the right and (told them), \"Consume the sustenance which your Lord has given to you and give Him thanks. You have a blessed land and an All-forgiving Lord\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed for (the tribe of) Saba was a sign in their dwelling-place – two gardens on the right and the left; “Eat the sustenance provided by your Lord and be grateful to Him”; a pure land and an Oft Forgiving Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there was for Saba' a sign in their dwelling place -- two gardens on the right and on the left; (and it was said to them:) \"Eat of the provision of your Lord, and be grateful to Him.\" A fair land and an Oft-Forgiving Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly there was a sign for Saba in their abode; two gardens on the right and the left; eat of the sustenance of your Lord and give thanks to Him: a good land and a Forgiving Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Sheba also there was a sign in their dwelling-place -- two gardens, one on the right and one on the left: 'Eat of your Lord's provision, and give thanks to Him; a good land, and a Lord All-forgiving.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was indeed a sign for Sheba in their dwelling-place: Two gardens on the right hand and the left (as who should say): Eat of the provision of your Lord and render thanks to Him. A fair land and an indulgent Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the people of Sheba there was a sign in their homeland: two gardens, one on the right hand and the other on the left. We said to them: \"Eat what your Lord has provided for you, and be grateful. You have a good land and a Lord most forgiving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly there was for Saba a sign in their own dwelling- place: two gardens on the right hand and on the left. And it was said Unto them: eat ye of the provision of your Lord and give thanks Unto Him: a fair land' and a forgiving Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was certainly a sign for Sheba in their habitation: two gardens, to the right and to the left. ‘Eat of the provision of your Lord and give Him thanks: a good land and an all-forgiving Lord!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was, for Saba, aforetime, a Sign in their home-land - two Gardens to the right and to the left. \"Eat of the Sustenance (provided) by your Lord, and be grateful to Him: a territory fair and happy, and a Lord Oft-Forgiving!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there was for Saba' (Sheba) a sign in their dwelling place, - two gardens on the right hand and on the left (and it was said to them) \"Eat of the provision of your Lord, and be grateful to Him, a fair land and an OftForgiving Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Sheba there was indeed a sign. In their dwelling place there were two gardens, on the right and left side. (We said): 'Eat of your Lord's provisions and give thanks to Him, a good land, and a Lord who is the Forgiving'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Sheba’s homeland there used to be a wonder: two gardens, on the right, and on the left. “Eat of your Lord’s provision, and give thanks to Him.” A good land, and a forgiving Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was for [the tribe of] Saba' in their dwelling place a sign: two [fields of] gardens on the right and on the left. [They were told], \"Eat from the provisions of your Lord and be grateful to Him. A good land [have you], and a forgiving Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:15] Verily there was for Sheba (Saba’, declined [as li-Saba’in] or left as indeclinable [li-Saba’a], is [the name of] a tribe that took its name from one of their Arab ancestors) in their dwelling-place, in Yemen, a sign: indicating God’s power, exalted be He, two gardens (jannatān, a substitution [for āyatun, ‘a sign’]) to the right and to the left, in other words, on the right side of their valley and on its left side. And it was said to them: ‘Eat of your Lord’s provision and give thanks to Him, for the graces He has bestowed on you in the land of Sheba. A good land — in which there was no dung, gnats, flies, fleas, scorpions, or snakes, and in which when a stranger passed through with his clothes lice-infected, these [lice] would be killed off because of the purity of its air — and, God is, a forgiving Lord.’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There was indeed a sign for Sheba) for the inhabitants of Sheba, which is a township in Yemen (in their dwelling-place: Two gardens on the right hand) of the road (and the left) of the road. There were about 13 townships in the direction of Yemen. Allah sent them 13 prophets, who said to them: (Eat of the provision of your Lord) eat from the bounty and blessing of your Lord (and render thanks to Him) by declaring your belief in His divine Oneness. (A fair land) this is a good township which is not swampy (and an indulgent Lord) for he who believes in Him and repents!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لقد كان لسبأ } أهل مدينة البدن { في مساكنهم } في مقارّهم ومحالهم { آية } دالة لهم على صفات الله وأفعاله { جنتان } جنة الصفات والمشاهدات عن يمينهم من جهة القلب والبرزخ التي هي أقوى الجهتين وأشرفهما، وجنّة الآثار والأفعال عن شمالهم من جهة الصدر والنفس التي هي أضعف الجهتين وأخسّهما { كلوا من رزق ربّكم } من الجهتين كقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ذكر سبحانه قصة آل داوود وسليمان ومواظبتهم على شكر نعم الله وأداء حقوق كرمه\n أردف سبحانه بكفران أهل سبأ على نعمه سبحانه\n وإنكارهم على حقوق كرمه\n فقال: { لَقَدْ كَانَ لِسَبَإٍ } أي: لأولاد سبأ بن يشجب بن يعرب بن قحطان { فِي مَسْكَنِهِمْ } أي: مواضع سكناهم\n وهي باليمن\n يقال لها: مأرب\n بقرب صنعاء\n مسيرة ثلاث مراحل { آيَةٌ } عظيمة ونعمة جسيمة دالة على كمال معطيها وموجدها\n وعلى اتصافه بالأوصاف الكاملة والأسماء الحسنى\n وهي { جَنَّتَانِ } حافتان محيطتان { عَن يَمِينٍ وَشِمَالٍ } أي: جنة عجيبة عن يمين بلدهم\n وأخرى عن يسارها\n\n\nوبعدما أعطيناهم هاتين الجنتين المشتملتين على غرائب صنيعنا وبدائع مخترعاتنا\n قلنا لهم على طريق الإلهام: { كُلُواْ } أيها المتنعمون المتفضلون من عندنا { مِن رِّزْقِ رَبِّكُمْ } الذي رباكم بأنواع الكرامات { وَٱشْكُرُواْ لَهُ } نعمه\n وواطبوا على أداء حقوق كرمه مع أن بلدتكم التي تسكنون فيها { بَلْدَةٌ طَيِّبَةٌ } ماء وهواء\n بريئة عن المؤذيات مطلقاً { وَ } ربكم الذي رباكم فيها بأنواع الكرم { رَبٌّ غَفُورٌ } [سبأ: 15] ساتر عليكم فرطاتكم بعدما أخلصتم في شكر نعمه وأداء حقوق كرمه\n\n\nوبعدما نبهنا عليهم بشكر النعم والمداومة عليها\n لم ينتبهوا ولم يتفطنوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لسبأ } فيه الصرف، بتأويل الحي، وعدمه، بتأويل القبيلة\n و { مسكنهم } ، مَن قرأ بالإفراد وفتح الكاف على القياس في الاسم والمصدر، كمدخَل، ومَن كسره فلغة، والسماع في المصدر كمسجِد\n و { جنتان } بدل من { آية } أو: خبر عن مضمر، أي: هي جنتان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:22",
      "similarity": 0.6703209024917102
    },
    {
      "verse": "7:17",
      "similarity": 0.2716951811949003
    },
    {
      "verse": "50:17",
      "similarity": 0.24056652098296502
    },
    {
      "verse": "56:41",
      "similarity": 0.2135444203425299
    },
    {
      "verse": "69:25",
      "similarity": 0.193470006463429
    }
  ]
}