{
  "chapter": "سبإ",
  "text": "ولسليمن الريح غدوها شهر ورواحها شهر واسلنا له عين القطر ومن الجن من يعمل بين يديه باذن ربه ومن يزغ منهم عن امرنا نذقه من عذاب السعير",
  "translations": [
    {
      "translation": "We (subjugated) the wind to Solomon. Its morning's journey took one month, and the evening's one month. We made a spring of molten brass to flow for him; and many jinns laboured for him by the will of his Lord. Anyone of them who turned from Our command was made to taste the torment of blazing fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We subdued the wind to Solomon: its morning course was a month's journey and its evening course was a month's journey. We gave him a spring flowing with molten brass, and We subdued for him jinn who, by his Lord's permission, worked before him. Such of them as swerved from Our commandment, We let them taste the chastisement of the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We made subservient to) Solomon the wind that travelled a month's journey in the morning and a month's journey in the evening. We made a stream of brass flow for him and some of the jinn worked for him by his Lord's command. We would make whichever of them (jinn) who turned away from Our command to suffer a burning torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave the wind in Sulaiman’s control – its morning journey equal to a month’s course and the evening journey equal to a month’s course; and We sprung a stream of molten copper for him; and from the jinns, who worked before him by the command of his Lord; and those among them who turned away from Our command – We shall make them taste the punishment of the blazing fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Sulayman (We subjected) the wind, its morning was a month's (journey), and its afternoon was a month's (journey). And We caused a fount of Qitr to flow for him, and there were Jinn that worked in front of him, by the leave of his Lord. And whosoever of them turned aside from Our command, We shall cause him to taste of the torment of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We made) the wind (subservient) to Sulaiman, which made a month's journey in the morning and a month's journey in the evening, and We made a fountain of molten copper to flow out for him, and of the jinn there were those who worked before him by the command of his Lord; and whoever turned aside from Our command from among them, We made him taste of the punishment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon the wind; its morning course was a month's journey, and its evening course was a month's journey. And We made the Fount of Molten Brass to flow for him. And of the jinn, some worked before him by the leave of his Lord; and such of them as swerved away from Our commandment, We would let them taste the chastisement of the Blaze;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Solomon (We gave) the wind, whereof the morning course was a month's journey and the evening course a month's journey, and We caused the fount of copper to gush forth for him, and (We gave him) certain of the jinn who worked before him by permission of his Lord. And such of them as deviated from Our command, them We caused to taste the punishment of flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We subjected the wind to Solomon; its morning course was a month and its evening course a month; and We caused a fount of molten copper to flow for him. And of the jinn there were some who worked under him, by the command of his Lord. If any one of them turned away from Our command, We would make him taste the punishment of the burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Unto Sulaiman We subjected the wind, whereof the morning journeying was a month and the evening journeying a month. And We made a fount of brass to flow for him. And of the Jinn were some who worked before him by the Will Of his Lord. And whosoever of them swerved from Our command, him We shall cause to taste the torment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for Solomon [We subjected] the wind: its morning course was a month’s journey and its evening course was a month’s journey. We made a fount of [molten] copper flow for him, and [We placed at his service] some of the jinn who would work for him by the permission of his Lord, and if any of them swerved from Our command, We would make him taste the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon (We made) the Wind (obedient): Its early morning (stride) was a month's (journey), and its evening (stride) was a month's (journey); and We made a Font of molten brass to flow for him; and there were Jinns that worked in front of him, by the leave of his Lord, and if any of them turned aside from our command, We made him taste of the Penalty of the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon (We subjected) the wind, its morning (stride from sunrise till midnoon) was a month's (journey), and its afternoon (stride from the midday decline of the sun to sunset) was a month's (journey i.e. in one day he could travel two months' journey). And We caused a fount of (molten) brass to flow for him, and there were jinns that worked in front of him, by the Leave of his Lord, and whosoever of them turned aside from Our Command, We shall cause him to taste of the torment of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Solomon the morning course of the wind was a month's journey, and its evening course was also a month's journey. We caused copper to be (as a) molten spring for him. And the jinn, some served him by the permission of his Lord. But as for those amongst them that swerved away from Our Command, We shall let them taste the punishment of the Blaze (the Fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for Solomon the wind—its outward journey was one month, and its return journey was one month. And We made a spring of tar flow for him. And there were sprites that worked under him, by the leave of his Lord. But whoever of them swerved from Our command, We make him taste of the punishment of the Inferno.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon [We subjected] the wind - its morning [journey was that of] a month - and its afternoon [journey was that of] a month, and We made flow for him a spring of [liquid] copper. And among the jinn were those who worked for him by the permission of his Lord. And whoever deviated among them from Our command - We will make him taste of the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:12] And, We disposed, for Solomon the wind (the nominative reading of al-rīhu would be based on an implicit [missing verb] sakhkharnā, ‘We disposed’) its morning course, meaning its journey from the morning to the noon, was a month’s journey and its evening course, that is, its journey from the noon to sunset, was a month’s journey. And We caused a fount of [molten] copper to flow for him, in other words, We caused the   copper to melt for him, and so the fount flowed for three days and nights like water, and to this day people have been using of that [copper] which was given to Solomon [at that time]. And of the jinn [there] were those who worked before him by the leave, by the command, of his Lord. And such of them as deviated from Our command, to him to obey him [Solomon], We would make them taste the chastisement of the Blaze, the Fire in the Hereafter — but it is also said, [that their chastisement was] in this world, in which case an angel would smite one of them with a lash thereof that would scorch him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto Solomon (We gave) the wind) and We made the wind subservient to Solomon, (whereof the morning course was a month's journey) He would go in the morning from Jerusalem to Istakhr, which was a month's journey (and the evening course a month's journey) and come back in the evening from Istakhr to Jerusalem which was another month's journey, (and We caused the fount of copper to gush forth for him) to make of it what whatever he pleased, (and (We gave him) certain of the jinn) and made the jinn subservient to him (who worked before him) by means of magic buildings and other things (by permission of his Lord) by command of his Lord. (And such of them as deviated from) as disobey or rebel against (Our command) with which We commanded them; it is also said that this means: the command of Solomon, (them We caused to taste the punishment of flaming fire) it is also said that an angel hit with a pillar of fire whoever disobeyed among the jinn.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَسَلْنَا لَهُ عَيْنَ ٱلْقِطْرِ } معناه أَجرَينا والقِطْرُ: النُّحاس\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من مقام فضلنا وجودنا سخرنا { لِسُلَيْمَانَ } بن داوود، عليهما السلام { ٱلرِّيحَ } العاصفة، وجعلناها مسخرة تحت حكمه وتصرفه، بحيث تحمل كرسي سليمان وجنوده عليها وتسير إلى حيث أشار وشاء { غُدُوُّهَا شَهْرٌ } أي جريها في الغداة مسيرة شهر { وَرَوَاحُهَا شَهْرٌ } أيضاً كذلك { وَ } أيضاً من كمال جودنا إياه { أَسَلْنَا } وأذبنا { لَهُ عَيْنَ ٱلْقِطْرِ } أي: النحاس، فذاب في معدنه، ونبع منه نبوع العيون الجارية في كل شهر ثلاثة أيام، قيل: أكثر ما في الناس من النحس من ذلك\n\n\n\n\n{ وَ } سخرنا له أيضاً؛ عناية منها معه { مِنَ ٱلْجِنِّ مَن يَعْمَلُ بَيْنَ يَدَيْهِ } مقهوراً تحت حكمه وتصرفه { بِإِذْنِ رَبِّهِ } أمرهم سبحانه بإطاعته وانقياده بحيث لا ينصرفون ولا يستنكفون عن حكمه أصلاً { وَ } شرط معهم سبحانه تأكيداً لإطاعتهم إياه، أنه { مَن يَزِغْ } أي: يعدل ويمل { مِنْهُمْ } أي: من الجن { عَنْ أَمْرِنَا } المبرم المحكم إياهم، وهو إطاعتهم نبينا سليمان عليه السلام { نُذِقْهُ } في هذه النشأة { مِنْ عَذَابِ ٱلسَّعِيرِ } [سبأ: 12] لأنه قد وكَّل سبحانه على الجن ملكاً بيده سوط من نار، فمن مال منهم عن حكم سليمان ضربه به، فأحرقه ولا يراه الجني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" الريح \": مفعول بمحذوف، أي: وسخرنا له الريح، ومَن رفعه فمبتدأ تقدّم خبره\n يقول الحق جلّ جلاله: { و } سخرنا { لسليمانَ الريحَ } وهي الصبا، { غُدُوُّها شهرٌ ورَوَاحُهَا شهرٌ } أي: جريها بالغد مسيرة شهر، إلى نصف النهار، وجريها بالعشي كذلك\n فتسير في يوم واحد مسيرة شهرين\n وكان يغدو من دمشق، مكان داره، فيقيل بإصطخر فارس، وبينهما مسيرة شهر، ويروح من إصطخر فيبيت بكابُل، وبينهما مسيرة شهر للراكب المسرع\n وقيل: كان يتغذّى بالريّ، ويتعشّى بسمرقند\n وعن الحسن: لَمَّا عقر سليمان الخيل، غضباً لله تعالى، أبدله الله خيراً منها الريح، تجري بأمره حيث شاء، غدوها شهر ورواحها شهر\n هـ\n قال ابن زيد: كان لسليمان مركب من خشب، وكان فيه ألف ركن، في كل ركن ألف بيت معه، فيه الجن والإنس، تحت كل ركن ألف شيطان، يرفعون ذلك المركب، فإذا ارتفع أتت الريح الرخاء فتسير به وبهم\n قلت: وقد تقدّم أن العاصفة هي التي ترفعه، والرخاء تسير به، وهو أصح\n ثم قال: فتقيل عند قوم، وتُمسي عند قوم، وبينهما شهر، فلا يدري القوم إلا وقد أظلّهم، معه الجيوش\n ويُروى أن سليمان سار من أرض العراق، فقال بمدينة مرو، وصلّى العصر بمدينة بلخ، تحمله الريح، وتظله الطير، ثم سار من بلخ متخللاً بلاد الترك، ثم سار به إلى أرض الصين، ثم عطف يُمنة على مطلع الشمس، على ساحل البحر، حتى أتى أرض فارس، فنزلها أياماً، وغدا منها فقال بكسكر، ثم راح إلى اليمن، وكان مستقره بها بمدينة تدْمُر، وقد كان أمر الشياطين قبل شخوصه من الشام إلى العراق، فبنوها له بالصفاح، والعُمد، والرخام الأبيض والأصفر\n هـ\n قلت: وذكر أبو السعود في سورة \" ص \" أنه غزا بلاد المغرب الأندلسي وطنجة وغيرهما، والله تعالى أعلم\n ووُجدت هذه الأبيات منقورة في صخرة بأرض كسكر، أنشأها بعض أصحاب سليمان عليه السلام:\n\nقال القشيري: وفي القصة أنه لاحظ يوماً مُلْكَه، فمال الريحُ، فقال له: استوِ، فقال له ما دمت أنت مستوياً بقلبك كنتُ مستوياً لك، فحيث مِلْتَ مِلتُ\n هـ\n ثم قال: { وأسَلْنَا له عينَ القِطْرِ } أي: معدن النحاس\n والقطر: النحاس، وهو الصُفر، ولكنه أذابه له، وكان يسيل في الشهر ثلاثة أيام، كما يسيل الماء\n\n\nوكان قبل سليمان لا يذوب\n قال ابن عباس: كانت تسيل له باليمن عين من نحاس، يصنع منها ما أحب\n وقيل: القطر: النحاس والحديد، وما جرى مجرى ذلك، كان يسيل له منه عيون\n وقيل: ألانه كما ألان الحديد لأبيه، وإنما ينتفع الناسُ اليوم بما أجرى الله تعالى لسليمان، كما قيل\n { و } سخرنا له { من الجنِّ من يعملُ بين يديه } ما يشاء { بإِذنِ ربه } أي: بأمر ربه، { ومن يزغْ منهم عن أمرنا } أي: ومَن يعدل منهم عن أمرنا الذي أمرنا به من طاعة سليمان { نُذقه من عذاب السعير } عذاب الآخرة\n وقيل: كان معه ملك بيده سوط من نار، فمَن زاغ عن طاعة سليمان ضربه بذلك ضربة أحرقته",
      "translations": []
    }
  ]
}