{
  "chapter": "سبإ",
  "text": "فاعرضوا۟ فارسلنا عليهم سيل العرم وبدلنهم بجنتيهم جنتين ذواتى اكل خمط واثل وشىء من سدر قليل",
  "translations": [
    {
      "translation": "But they turned away so We unleashed against them the flood from the great dam and exchanged their two gardens for two others containing bitter-tasting plants and tamarisk and a few lote trees.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away. So We let loose on them the inundation of (the dyke of) al-'Arim, replacing their gardens with two other gardens which bore only bitter gourd, and tamarisks and a few sparse lote-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away and so We let loose upon them a devastating flood that swept away the dams and replaced their gardens by two others bearing bitter fruits, tamarisks, and a few lote trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ignored (the evidence) and We sent to them a flood, arising from a broken dam. Nothing was left in their gardens but bitter fruits, some tamarisk and a few lotus trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response they turned away – We therefore sent upon them a tremendous flood, and in exchange of their two gardens gave them two gardens bearing bitter fruit, and tamarisk, and some berries.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away, so We sent against them flood released from the dam, and We converted their two gardens into gardens producing bitter bad fruit, and Athl, and some few lote trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned aside, so We sent upon them a torrent of which the rush could not be withstood, and in place of their two gardens We gave to them two gardens yielding bitter fruit and (growing) tamarisk and a few lote-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away; so We loosed on them the Flood of Arim, and We gave them, in exchange for their two gardens, two gardens bearing bitter produce and tamarisk-bushes, and here and there a few lote-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they were froward, so We sent on them the flood of 'Iram, and in exchange for their two gardens gave them two gardens bearing bitter fruit, the tamarisk and here and there a lote-tree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they turned away [from the truth]. So We let loose on them a flood from the dam and replaced their two gardens by two others bearing bitter fruits, tamarisks, and a few lote trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away. Wherefore We sent upon them the inundation of the dam and We exchanged their two gardens for two gardens bearing bitter fruit, and tamarisk. And some few lote-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they disregarded [the path of Allah], so We unleashed upon them a violent flood and replaced their two gardens with two gardens bearing bitter fruit, tamarisk, and sparse lote trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away (from Allah), and We sent against them the Flood (released) from the dams, and We converted their two garden (rows) into \"gardens\" producing bitter fruit, and tamarisks, and some few (stunted) Lote-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away (from the obedience of Allah), so We sent against them Sail Al'Arim (flood released from the dam), and We converted their two gardens into gardens producing bitter bad fruit, and tamarisks, and some few lotetrees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away. So We sent against them the Flood (at the city) of Arim, and exchanged their gardens with two others bearing bitter fruit andTamarisks, and here and there a few Lotus trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away, so We unleashed against them the flood of the dam; and We substituted their two gardens with two gardens of bitter fruits, thorny shrubs, and meager harvest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they turned away [refusing], so We sent upon them the flood of the dam, and We replaced their two [fields of] gardens with gardens of bitter fruit, tamarisks and something of sparse lote trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:16] But they were disregardful, of giving thanks to Him and became disbelievers, so We unleashed upon them the flood of the Dam (al-‘arim is the plural of ‘arima, which is a structure or something similar that holds water back [to be stored] for when it is needed), in other words, [We unleashed upon them] the floodwaters of their valley which had been held back by the mentioned [structure] so that they engulfed their two gardens together with all their property. And We gave them in place of their two gardens two gardens bearing (dhawātay, a dual form of [feminine plural] dhawāt; usually [the form dhātay from] the singular   [would have been used]) bitter fruit, bitter and vile (ukul may be read as a genitive annexation [ukulin khamtin] in the sense of ‘that which is eaten [thereof being bitter]; or it may be read without [as ukuli khamtin]; and this [phrase] is supplemented [by the following, wa-athlin wa-shay’in min sidrin qalīl) and tamarisk and sparse lote trees.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they were froward) they turned away from faith and acceptance of the messengers and failed to give thanks, (so We sent on them the flood of 'Iram) the flood of a river which destroyed their gardens, houses and all their bounties. 'Iram was the name of a river in Yemen within which they built a dam. This dam had three superimposed openings, Allah destroyed the dam and destroyed them by means of its water, (and in exchange for their two gardens) which were destroyed (gave them two gardens bearing bitter fruit, the tamarisk and here and there a lote tree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَيْلَ ٱلْعَرِمِ } معناه المُسَنَّاةُ بلسان اليمن واحدُها عرِمةٌ\n\n\n\n\nوقوله تعالى: { أُكُلٍ خَمْطٍ [وَأَثْلٍ] } فالخَمطُ: كلُّ شَجرٍ ذو شَوكٍ والأُكُلُ: الجَنى\n وقال البَريرُ\n وقال هو الأَراكُ\n والأَثْلُ: شَجرةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the rain of the 'Arim} means the rainfall in the Yemeni dialect and one of them is 'Arimah.\n\n\nAnd His saying, {Every [kind of] thorns [and every kind of] thistles} - the thorns are every tree with thorns, and the thistles are the jinn.\n\n\nThe preacher said,\n\n\nAnd He said, \"It is I.\"\n\n\nAnd the athl (a kind of tree): a shajarah (a type of tree).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فأعرضوا } عن القيام بالشكر والتوسل بها إلى الله بل عن الأكل من ثمراتها التي هي العلوم النافعة والحقيقية بالانهماك في اللذات والشهوات والانغماس في ظلمات الطبائع والهيئات\n { فأرسلنا عليهم سيل } الطبيعة الهيولانية بنقب جرذان سيول الطبائع العنصرية سكر المزاج الذي سدّته بلقيس النفس التي هي ملكتهم\n والعرم الجرذ { وبدّلناهم بجنتيهم جنتين } من شوك الهيئات المؤذية وأصل الصفات السيئة البهيمية والسبعية والشيطانية { ذواتي أكل خمط } أي: ثمرة مرّة بشعة كقوله:\n[الصافات\n الآية: 65]\n { وشيء من سدر } بقاء الصفات الإنسانية { قليل }  { ذلك } العقاب { جزيناهم } بكفرانهم النعم { وهل نجازي } بذلك { إلا الكفور } الذي يستعمل نعمة الرحمن في طاعة الشيطان { وجعلنا بينهم وبين القرى التي باركنا فيها } من الحضرة القلبية والسرية والروحية والإلهية بالتجليات الأفعالية والصفاتية والأسمائية الذاتية وأنوار المكاشفات والمشاهدات { قرى ظاهرة } مقامات ومنازل مترائية متواصلة كالصبر والتوكل والرضا وأمثالها { وقدّرنا فيها السير } إلى الله وفي الله مرتباً يرتحل السالك في الترقي من مقام وينزل في مقام { سيروا } في منازل النفوس { ليالي } وفي مقامات القلوب ومواردها { وأياماً آمنين } بين القواطع الشيطانية وغلبات الصفات النفسانية بقوة اليقين والنظر الصحيح على منهاج الشرع المبين\n { فقالوا } بلسان الحال والتوجه إلى الجهة السفلية المبعدة عن الحضرة القدسية والميل إلى المهاوي البدنية والسير في المهامة الطبيعية والمهالك الشيطانية { ربنا باعد بين أسفارنا وظلموا أنفسهم } بالاحتجاب عن أنوار القرى المباركة لظلمات البرازخ المنحوسة { فجلعناهم أحاديث } وآثاراً سائرة بين الناس في الهلاك والتدمير { ومزّقناهم } بالغرق والتفريق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { فَأَعْرَضُواْ } عن الشرك\n واشتغلوا بأنواع الكفران والطغيان والإنكار على المفضل المنان\n المكرم الديان\n وبعدما انصرفوا عنا وعن شكر نعمنا { فَأَرْسَلْنَا عَلَيْهِمْ سَيْلَ ٱلْعَرِمِ } وهي الحجارة المركومة بالجص والنورة\n وأنواع التدبيرات المحكمة للأبنية والأساس\n\n\nوذلك أنه كان لهم سد قد بنته بلقيس بين الجبلين\n وجعلت لها ثلاث كوات بعضها فوق بعض\n وبنت دونها بركة عظيمة\n فإذا جاء المطر اجمتع عليها مياه أوديتهم\n فاحتبس السيل من وراء السد\n فيفتح الكوة العليا عند الاحتياج\n ثم الثانية\n ثم الثالثة السفلى\n فلا ينفد ماؤها إلى السنة القابلة\n\n\nفلما طغوا وكفروا لنعم الله بعدما أُمروا بالشكر على ألسنة الرسل\n قيل: أرسل الله عليهم ثلاثة عشر نبياً\n فكذبوا الكل وأنكروا لهم\n سلط الله على سدهم الجُرذ - قيل: هي من من الفأرة - فنقَّبت في أسفل السد بإلهام الله إياها\n فسال الماء\n فغرقت جنتهم ودفنت بيوتهم في الرمل\n وكان ذلك من غضب الله عليهم على كفران نعمه\n\n\n{ وَ } بعدما أعرضوا عن شركنا\n وأرسلنا عليهم من السيل ما أرسلنا { بَدَّلْنَاهُمْ بِجَنَّتَيْهِمْ } المذكورتين\n المشابهتين للجنة الأخروية { جَنَّتَيْنِ } أخريين\n سماهما سبحانه على سبيل التهكم والاستهزاء: { ذَوَاتَيْ أُكُلٍ } وثمر { خَمْطٍ } بشع سمج كزقوم أهل النار { وَ } ذواتي { أَثْلٍ } طرفاء لا ثمر لها { وَشَيْءٍ مِّن سِدْرٍ } نبق { قَلِيلٍ } [سبأ: 16] أي: قليل النفع\n إذ لا يسمن ولا يغني من جوع\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أُكل خَمْطٍ } \n فمَن أضافه فإضافة الشيء إلى جنسه\n كثوب خز\n ومَن نوّنه قطعه عن الإضافة\n وجعله عطف بيان\n أو صفة\n بتأويل خمطٍ ببشيع\n يقول الحق جلّ جلاله: { لقد كان لسبأٍ } سُئل صلى الله عليه وسلم أرجلاً كان أو امرأة\n أو أرضاً أو جبلاً أو وادياً\n فقال صلى الله عليه وسلم:\n \" هو رجل من العرب\n ولد عشرة من الولد\n فتيامن ستةٌ\n وتشاءم أربعةٌ: فالذين تيامنوا كثرة\n فكندة\n والأشعريون\n والأزد\n ومذحج\n وأنمارُ\n وحميرُ\n فقال رجل: مَن أنمار يا رسول الله؟ قال منهم خَثْعَمُ وبَجِيلَةُ\n والذين تشاءموا: عاملة\n وجذام\n ولخم\n وغسان \" \nقلت: وسبأ هو ابن يشخب بن يعرب بن قحطان\n واختلف في قحطان\n فقيل: هو ابن عابر بن شالح بن أرفخشد بن سام بن نوح\n وقيل: هو أخو هود عليه السلام\n وقيل: هو هود\n بنفسه\n وإن هوداً هو ابن عبدالله بن رباح\n لا ابن عابر\n على الأصح\n فهو على هذا القول ابن أرم بن سام\n وقيل: قحطان من ولد إسماعيل\n فهو ابن أيمن بن قيذر بن إسماعيل\n وقيل: هو ابنُ الهميسع بن أيمن\n وبأيمن سميت اليمن\n وقيل: لأنها عن يمين الكعبة\n هذا والعربُ كلها يجمعها أصلان: عدنان وقحطان\n فلا عربي في الأرض إلا وهو ينتهي إلى أحدهما\n فيقال: عدناني أو قحطاني\n  ومَن جعل العرب كلها من ولد إسماعيل مرّ على أن قحطان من ذرية إسماعيل\n كما تقدّم\n واختلف في خزاعة\n فقيل: قحطانية\n وقيل: عدنانية\n وأن جدهم عمرو بن لحي\n وأما الأوس والخزرج فهما من ذرية سبأ\n نزلت يثرب\n بعد سيل العرم\n كما يأتي\n قال تعالى: { لقد كان لسبأٍ في مسكنهم } أي: في بلدهم\n أو أرضهم\n التي كانوا مقيمين فيها باليمن\n { آيةٌ } دالة على وحدانيته تعالى\n وباهر قدرته\n وإحسانه\n ووجوب شكر نعمه\n وهي: { جنتانِ } أي: جماعة من البساتين\n { عن يمينٍ } واديهم\n { وَشِمَالٍ } وعن شماله\n وكل واحدة من الجماعتين في تقاربها وتصافها كأنها جنة واحدة\n كما يكون في بساتين البلاد العامرة\n قيل: كان الناس يتعاطون ذلك على جَنْبتي الوادي\n مسيرة أربعين يوماً\n وكلها تُسقى من ذلك الوادي لارتفاع سده\n أو: أراد بُسْتانين\n لكل رجل بستان عن يمين داره\n وبستان عن شماله\n ومعنى كونهما آية: أن أهلها لَمّا أعرضوا عن شكر النعم سلبهم الله النعمة\n ليعتبروا ويتَعظوا\n فلا يعودوا لِمَا كانوا عليه من الكفر وغمط النعم\n فلما أثمرت البساتين قلنا لهم ـ على لسان الرسل المبعوثين إليهم\n أو بلسان الحال\n أو هم أحقاء بأن يقال لهم ذلك: { كُلُوا من رزق ربكم واشكرُوا له } بالإيمان والعمل الصالح\n { بلدةٌ طيبةٌ } أي: هذه البلدة التي فيها رزقكم بلدة طيبة\n { وربُّ غفور } أي: وربكم الذي رزقكم وطلب شكركم ربٌّ غفور لمَن شكره\n\nقال ابن عباس: كانت سبأ على ثلاثة فراسخ من صنعاء\n وكانت أخصب البلاد\n فتخرج المرأة على رأسها المكتل\n وتسير بين تلك الشجر\n فيمتلىء المِكْتَل مما يتساقط فيه من الشجر ولقد كان الرجل يخرج لزيارة أقاربه\n وعلى رأسه مكتل\n أو قُفة\n أو طبق فارغ\n فلا يصل إلى حيث يريد إلا والطبق قد امتلأ فاكهة\n مما تسقطه الرياح\n دون أن يمد يده إلى شيء من ثمرها\n ومن طيبها: أنها لم تُرَ في بلدهم بعوضة قط\n ولا ذباب\n ولا برغوث\n ولا عقرب\n ولا حية\n وإذا جاءهم الركب في ثيابهم القمل والدواب ماتت الدواب والقمل لطيب هواها\n { فأَعْرَضوا } عن الشكر\n بتكذيب أنبيائهم\n وكفر نعمة الله عليهم\n وقالوا: ما نعرف لله علينا من نعمة\n عائذاً بالله\n قال وهب: بعث الله إلى سبأ ثلاثة عشر نبيًّا\n يدعونهم إلى الله تعالى\n فكذّبوهم\n { فأرسلنا عليهم سيلَ العَرِم } أي: سيل الأمر العرم\n أي: الصعب\n من: عرَم الرجل فهو عارم\n وعَرِمَ: إذا شَرِسَ خُلقه وصعب\n أي: أرسلنا عليهم سيلاً شديداً\n مزَّق سدهم\n وغرق بساتينهم\n قيل: جمع عَرمة\n وهي السد الذي يمسك الماء إلى وقت حاجته\n قال ابن عباس رضي الله عنه: كان هذا السد يسقي جنتها\n وبنته بلقيس لأنه لَمّا ملَكت جعل قومها يقتتلون على ماء مواشيهم\n فنهتهم\n فأبَوا\n فنزلت عن ملكها\n فلما كثر الشرُّ بينهم أرادوها أن ترجع إلى مُلكها\n فأبت\n فقالوا: لترجعي أو لنَقتلنك\n فجاءت\n وأمرت بواديهم فسُد أعلاه بالعرم\n وهو المُسنّاة ـ بلغة حِمْير ـ فسدت ما بين الجبلين بالصخر والنار\n وجعلت له أبواباً ثلاثة\n بعضها فوق بعض\n وبنت من دونه بركة عظيمة\n وجعلت فيها اثني عشر مخرجاً\n على عدة أنهارهم\n فلما جاء المطر اجتمع ماء الصخر وأودية اليمن\n فاحتبس السيل من وراء السدّ\n ففتحت الباب الأعلى\n وجرى ماؤه في البركة\n وألقت البقر فيها\n فخرج بعض البقر أسرع من بعض\n فلم تزل تضيق تلك الأنهار\n وترسل البقر في الماء\n حتى خرجت جميعاً معاً\n فكانت تقسمه بينهم على ذلك\n حتى كان من شأنها وشأن سليمان ما كان\n فكانوا يسْقُون من الباب الأعلى\n ثم من الثاني\n ثم من الأسفل\n فلا ينفد حتى يثوب الماء من السنة المقبلة\n فلما كفروا وطغوا\n سلّط الله عليهم جُرذاً\n يُسمى الخلد ـ وهو الفأر ـ فنقبه من أسفله\n فغرَّق الماء جنتهم\n وخرّب أرضهم\n هـ\n قال وهب: وكانوا يزعمون أنهم يجدون في عِلْمِهم وكهانتهم أنهم يُخرب سدهم فأرة\n فلم يتركوا فرجة بين صخرتين إلا ربطوا عندها هِرًّا\n فلما حان ما أراد الله بهم\n أقبلت فأرة حمراء\n إلى بعض الهِرَر\n فساورتها ـ أي: حاربتها\n حتى استأخرت عنها ـ أي: عن تلك الفرجة ـ الهرة\n فدخلت في الفرجة التي كانت عندها\n ونقبت السد\n حتى أوهنته للسيل\n وهم لا يدرون\n فلما جاء السيل دخل في تلك الخلل\n حتى بلغ السد\n فخربه\n وفاض على أموالهم\n فغرقتها\n ودفن بيوتهم\n ومُزقوا\n حتى صاروا مثلاً عند العرب\n فقالوا: تفرّقوا أياديَ سبأ\n\nهـ\n { وبدلناهم بجنتيهم } المذكورتين { جنتين } أخريَيْن\n وتسمية المبدلتين جنتين للمشاكلة وازدواج الكلام\n كقوله:\n[الشورى: 40]\n { ذواتي أُكُل خَمْطٍ } الأُكل: الثمر المأكول\n يخفف ويثقل\n والخمط\n قال ابن عباس: شجر الأراك\n وقال أبو عبيد: كل شجر مؤذ مشوِّك\n وقال الزجاج: كل شجر مُر\n هـ\n وفي القاموس: الخمط: الحامض المر من كل شيء\n وكل نبت أخذ طعماً من مرارة وحموضة\n وشجر كالسدر\n وشجر قاتل\n أو كل شجر لا شوك له\n هـ\n وقرأ البصريان بالإضافة\n من إضافة الشيء إلى جنسه\n كثوب خز لأن المراد بالأكل المأكول\n أي: ذواتي ثمر شجر بشيع\n والباقون: بالتنوين\n عطف بيان\n أو صفة\n بتأويل خمط ببشيع\n أي: مأكول بشيع\n { وأثْلٍ } هو شجر يشبه الطرفاء\n أعظم منه\n وأجود عوداً\n { وشيءٍ من سِدْرٍ قليل } والحاصل أن الله تعالى أهلك أشجارهم المثمرة\n وأنبت مكانها الطرفاء والسدر\n وإنما قال: السدر\n لأنه أكرمُ ما بُدلوا به لأنه يكون في الجنان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:12",
      "similarity": 0.14601937009264537
    },
    {
      "verse": "53:14",
      "similarity": 0.12706478623523815
    },
    {
      "verse": "53:16",
      "similarity": 0.12646581179099647
    },
    {
      "verse": "56:28",
      "similarity": 0.10171843509994348
    },
    {
      "verse": "13:17",
      "similarity": 0.10000104944128944
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}