{
  "chapter": "سبإ",
  "text": "يعلم ما يلج فى الارض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو الرحيم الغفور",
  "translations": [
    {
      "translation": "He knows what goes into the earth and what comes out of it, and what comes down from heaven and what goes up into it. And He is the Most Merciful, the Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows whatever goes into the earth and whatsoever issues from it, whatsoever comes down from the sky, and whatsoever goes up to it. He is all-merciful, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what penetrates into the earth and what goes forth from it, what descends from the heaven and what ascends to it. He is the Most Merciful, the Most Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows all that enters the earth, all that comes out of it, all that descends from the sky and all that ascends to it. He is All-merciful and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows all that goes into the earth and all that comes out of it, and all that descends from the skies and all that ascends into it; and only He is the Most Merciful, the Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows that which goes into the earth and that which comes forth from it, and that which descends from the heaven and that which ascends to it. And He is the Most Merciful, the Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows that which goes down into the earth and that which comes out of it, and that which comes down from the heaven and that which goes up to it; and He is the Merciful, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what penetrates into the earth, and what comes forth from it, what comes down from heaven, and what goes up to it; He is the All-compassionate, the All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knoweth that which goeth into the earth and that which cometh forth from it, and that descendeth from the heaven and that which ascendeth into it. He is the Merciful, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows whatever goes into the earth and whatever comes forth from it, and whatever descends from heaven and whatever ascends into it. He is the Merciful, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knoweth whatsoever penetrateth into the earth and whatsoever cometh forth therefrom and whatsoever descendeth from the heaven and whatsoever ascendeth thereto. And He is the Merciful, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows whatever enters into the earth and whatever emerges from it, and whatever descends from the sky and whatever ascends into it, and He is the All-merciful, the All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows all that goes into the earth, and all that comes out thereof; all that comes down from the sky and all that ascends thereto and He is the Most Merciful, the Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows that which goes into the earth and that which comes forth from it, and that which descend from the heaven and that which ascends to it. And He is the Most Merciful, the OftForgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows all that penetrates the earth and all that comes forth from it, all that comes down from heaven and all that ascends to it. He is the Most Merciful, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what penetrates into the earth, and what comes out of it, and what descends from the sky, and what ascends to it. He is the Merciful, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein. And He is the Merciful, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:2] He knows what penetrates the earth, of water and so forth, and what issues out of it, of vegetation and so on, and what comes down from the heaven, of provision and so on, and what ascends into it, of deeds and so on, and He is the Merciful, to His friends, the Forgiving, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He knoweth that which goeth down into the earth) of rain, water, dead people and treasures (and that which cometh forth from it) and He knows what comes forth from it of plants, water, treasures and dead people, (and that which descendeth from the heaven) of rain, sustenance and other things (and that which ascendeth into it) of angels and guardian angels who carry the scrolls of the servants. (He is the Merciful) towards the believers, (the Forgiving) He forgives whoever repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدثنا علي بن أحمد\n قال: حدثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السَّلامُ في قولهِ تعالى: { مَا يَلِجُ فِي ٱلأَرْضِ } معناه يَدْخُلُ ويَغيبُ فِيها\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad narrated to us.\"\n\n\nHe said: It was narrated to us by `Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn `Ali, may peace be upon them, regarding the saying of Allah Almighty, { Nothing enters it [the earth] but } its meaning is that it enters and leaves it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يعلم ما يلج في الأرض } من الملكوت الأرضية والقوى الطبيعية { وما يخرج منها } بالتجريد من النفوس الإنسانية والكمالات الخلقية { وما ينزل من السماء } من المعارف والحقائق الروحانية { وما يعرج فيها } من هيئات الأعمال الصالحة والأخلاق الفاضلة { وهو الرحيم } بإفاضة الكمالات السماوية النورانية { الغفور } بستر الهيئات الأرضية الظلمانية\n { ويرى الذين أوتوا العلم } أي: العلماء المحققون يرون حقيّة ما أنزل إليك عياناً لأن المحجوب لا يمكنه معرفة العارف وكلامه\n إذ كل عارف بشيء لا يعرفه إلا بما فيه من معناه\n فمن لم يكن له حظ من العلم ونصيب من المعرفة لا يعرف العالم العارف وعلمه لخلوّه عما به يمكن معرفته { ويهدي إلى } طريق الوصول إلى الله { العزيز } الذي يغلب المحجوبين ويمنعهم بالقهر والقمع { الحميد } الذين ينعم على المؤمنين بأنواع اللطف ولو لم يعتبر تطبيق الصفتين على قوله:\n[سبأ\n الآية:4] إلى آخره\n واعتبر التطبيق على قوله: { ويرى الذين أُوتوا العلم } لكان معنى { العزيز } القوي الذي يغلب الواصلين بالإفناء { الحميد } الذي ينعم عليهم بصفاته عند البقاء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n الفائضة من المبدأ الفياض { وَمَا يَخْرُجُ مِنْهَا } من المعارف والحقائق الكامنة المختفية فيها على مقتضى تربية مربيها ومظهرا { وَ } كذا يعلم بعلمه الحضوري { مَا يَنزِلُ مِنَ ٱلسَّمَآءِ } أي: عالم الأسماء إلى أرض المظاهر والمسميات من الفيوضات والفتوحات\n الشاملة لأنواع الكمالات { وَمَا يَعْرُجُ فِيهَا } متصاعدة من المكاشفات والمشاهدات الحاصلة من تلك الفتوحات الهابطة { وَ } بالجملة: { هُوَ ٱلرَّحِيمُ } لعباده بإفاضة أنواع الكرامات بمقتضى رحمته الواسعة { ٱلْغَفُورُ } [سبأ: 2] لذنوب أنانياتهم وتعيناتهم الباطلة بعدما رجعوا إليه وتوجهوا نحوه تائبين آيبين مخلصين\n\n\nرزقنا الله الوصول إلى محل القبول\n\n\n{ وَ } بعدما أخبر سبحانه بقيام الساعة في كتبه وعلى ألسنة رسله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما يخرج منها } من النبات وجواهر المعادن\n { وما ينزلُ من السماء } من الأمطار وأنواع البركات\n { وما يعرجُ } يصعد { فيها } من الملائكة والدعوات\n { وهو الرحيمُ } بإنزال ما يحتاجون إليه\n { الغفورُ } بما يجترئون عليه\n قاله النسفي\n الإشارة: المستحق للحمد هو الذي بيده ما في سماوات الأرواح من الكشوفات وأنواع الترقيات\n إلى ما لا نهاية له\n من عظمة الذات\n وبيده ما في أرض النفوس من القيام بالطاعات وآداب العبودية وتحسين الحالات\n وما يلحق ذلك من المجاهدات والمكابدات\n وبيده ما يتحفهم به في الآخرة\n من التعريفات الجمالية\n والفتوحات الربانية\n والترقي في الكشوفات السرمدية\n فله الحمد في هذه العوالم الثلاثة إذ كلها بيده\n يخص بها مَن يشاء من عباده\n مع غناه عن الكل\n وإحاطته بالكل\n ورحمته للكل\n يعلم ما يلج في أرض النفوس من الهواجس والخواطر\n وما يعرج منها من الصغائر والكبائر\n أو من الطاعة والإحسان من ذوي البصائر\n وما ينزل من سماء الملكوت من العلوم والأسرار\n وما يعرج فيها من الطاعات والأذكار\n وهو الرحيم بالتقريب والإقبال\n الغفور لمساوئ الضمائر والأفعال\n ثم ردَّ على من أنكر الآخرة التي تقدم ذكرها فقال: { وَقَالَ ٱلَّذِينَ كَفَرُواْ لاَ تَأْتِينَا\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:4",
      "similarity": 0.6496631310399752
    },
    {
      "verse": "70:3",
      "similarity": 0.6067740654126305
    },
    {
      "verse": "22:61",
      "similarity": 0.5605540437321619
    },
    {
      "verse": "3:27",
      "similarity": 0.5511671062011981
    },
    {
      "verse": "57:6",
      "similarity": 0.5469947595850919
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/34:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/34:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}