{
  "chapter": "سبإ",
  "text": "قل لا تسـلون عما اجرمنا ولا نسـل عما تعملون",
  "translations": [
    {
      "translation": "Say: 'You will not be asked about any evil we committed and we will not be asked about what you did.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"You will not be questioned about the sins that we have committed, nor shall we be questioned about your deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: “You will not be called to account about the guilt we committed, nor will we be called to account for what you did.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"You will not be questioned about our sins nor shall we about your deeds\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “You will not be questioned regarding the sins you assume we have committed, nor will we be questioned regarding your misdeeds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"You will not be asked about our sins, nor shall we be asked of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: You will not be questioned as to what we are guilty of, nor shall we be questioned as to what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'You will not be questioned concerning our sins, neither shall we be questioned as to what you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Ye will not be asked of what we committed, nor shall we be asked of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"You will not be called to account for our sins and we shall not be called to account for what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: ye will not be questioned about that which we have committed, nor shall we be questioned about that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘You will not be questioned about our guilt, nor shall we be questioned about what you do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Ye shall not be questioned as to our sins, nor shall we be questioned as to what ye do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists, pagans, etc.) \"You will not be asked about our sins, nor shall we be asked of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'You will not to be questioned about our sins, neither will we be questioned for your actions'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “You will not be asked about our misdeeds, nor will we be asked about what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"You will not be asked about what we committed, and we will not be asked about what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:25] Say: ‘You will not be questioned about the sins we committed, nor shall we be questioned about what you do’, for we are quit of you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Ye will not be asked of what we committed) of sins, (nor shall we be asked of what ye do) in your state of disbelief. But this was later abrogated by the verse of the sword.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } لهم أيضاً على سبيل المجاراة والمبالغة في المداراة معهم، بحيث تسند الجرم إلى أنفسكم والعمل إليهم؛ مبالغة في الإسكات والتبكيت: { لاَّ تُسْأَلُونَ } أنتم { عَمَّآ أَجْرَمْنَا } وجئنا به من الآثام { وَلاَ نُسْأَلُ } نحن أيضاً { عَمَّا تَعْمَلُونَ } [سبأ: 25] من الأعمال، بل كل منا ومنكم رهين ما اكتسبنا من العمل، فعليكم ما حملتم، وعلينا ما حملنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل لا تُسألون عمّا أجرمنا ولا نُسأل عما تعملون } أي: ليس القصد بدعائي إياكم خوفاً من ضرر كفركم، وإنما القصد بما أدعوكم إليه الخير لكم، فلا يُسأل أحد عن عمل الآخر، وإنما يُسأل كل واحد عن عمله\n وهذا أيضاً أدخل في الإنصاف، حيث أسند الإجرام إلى أنفسهم، وهو محظورٌ، والعمل إلى المخَاطبين، وهو مأمورٌ به مشكورٌ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:41",
      "similarity": 0.7146294030972512
    },
    {
      "verse": "15:58",
      "similarity": 0.598239249609613
    },
    {
      "verse": "51:32",
      "similarity": 0.598239249609613
    },
    {
      "verse": "26:99",
      "similarity": 0.5806056510587446
    },
    {
      "verse": "78:1",
      "similarity": 0.528705817551631
    }
  ]
}