{
  "chapter": "سبإ",
  "text": "قل من يرزقكم من السموت والارض قل الله وانا او اياكم لعلى هدى او فى ضلل مبين",
  "translations": [
    {
      "translation": "Say: 'Who provides for you from the heavens and earth?' Say: 'Allah. It is certain that one or the other of us, either we or you, is following guidance or else clearly astray.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who gives you food from the heavens and the earth?\" Say: \"God. Surely either you or we are on guidance, or are lost in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, (O Prophet): “Who provides you sustenance from the heavens and the earth?” Say: “Allah. Now, inevitably only one of us is rightly guided, either we or you; and the other is in manifest error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who provides you with sustenance from the heavens and the earth?\" Say, \"It is God. Only one group among us has the true guidance. The others must certainly be in plain error\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Who provides you sustenance from the sky and the earth?” Proclaim, “Allah – and indeed either we or you are upon guidance, or in open error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who gives you provision from the heavens and the earth\" Say: \"Allah. And verily, (either) we or you are rightly guided or in plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who gives you the sustenance from the heavens and the earth? Say: Allah. And most surely we or you are on a right way or in manifest error\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who provides for you out of the heavens and the earth?' Say: 'God.' Surely, either we or you are upon right guidance, or in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who giveth you provision from the sky and the earth? Say: Allah, Lo! we or you assuredly are rightly guided or in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"Who provides sustenance for you from the heavens and the earth?\" Say, \"It is God\"; either you or we are rightly guided or in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who provideth food for you from the heavens and the earth? Say thou: Allah; verily either we or ye are on the guidance or in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who provides for you from the heavens and the earth?’ Say, ‘Allah! Indeed either we or you are rightly guided or in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who gives you sustenance, from the heavens and the earth?\" Say: \"It is Allah; and certain it is that either we or ye are on right guidance or in manifest error!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists, pagans, etc.) \"Who gives you provision from the heavens and the earth?\" Say: \"Allah, And verily, (either) we or you are rightly guided or in a plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who provides for you from the heavens and earth' Say: 'Allah' Surely, either we or you are rightly guided or in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who provides for you from the heavens and the earth?” Say, “God. And Either you, or we, are rightly guided, or in evident error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who provides for you from the heavens and the earth?\" Say, \"Allah. And indeed, we or you are either upon guidance or in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:24] Say: ‘Who provides for you from the heavens, rain, and [from] the earth?’, vegetation. Say: ‘God!’ — [even] if they do not say it, there is no other [valid] answer. And indeed either we or you are — in other words [either] one of the two parties [is] — rightly guided or in manifest error. The ambiguity here [concerning which of the two is rightly guided] is intended as a gentle invitation for them to [embrace] faith if their way to it is facilitated [by God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the disbelievers of Mecca: (Who giveth you provision from the sky) through rain (and the earth) through vegetation? If they answer you that it is Allah, then it is fine; if not, (Say: Allah) gives you provision. (Lo! we or you) people of Mecca (assuredly are rightly guided or in error manifest) regarding Allah's provision; it is also said that this means: we are, group of believers, following the guidance, while you, people of Mecca, in manifest disbelief and error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّآ أَوْ إِيَّاكُمْ لَعَلَىٰ هُدًى أَوْ فِي ضَلاَلٍ مُّبِينٍ } معناه أَنتم فِي ضَلالٍ ونحن على هُدى\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {And either We will show you part of what We threaten them with or We will surely take you to Us}, its meaning is that you are in error and We are on guidance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم أيضاً على سبيل التبكيت والإلزام\n مقرعاً إياهم: { مَن يَرْزُقُكُمْ مِّنَ ٱلسَّمَٰوَٰتِ } أي: عالم الأسباب { وَٱلأَرْضِ } أي: عالم المسببات\n فيبهتون عن سؤالك { قُلِ } يا أكمل الرسل بعدما بهتوا: { ٱللَّهُ } إذ هو متعين للجواب وإن سكتوا عنه وتلعثموا مخافة الإلزام\n أضمروا في قلوبهم هذا\n إذ لا جواب لهم سواه\n ولا رازق إلا هو ولا معطي غيره { وَ } بعدما بهتوا وانحسروا\n واستولى الحيرة والقلق عليهم\n قل لهم على سبيل المجاراة والمداراة: { إِنَّآ } يعني: فرق الموحدين { أَوْ إِيَّاكُمْ } يعني: فرق المشركين\n أي: كل منا ومنكم { لَعَلَىٰ هُدًى } أي: على الحق المطابق للواقع { أَوْ فِي ضَلاَلٍ مُّبِينٍ } [سبأ: 24] ظاهر انحرافه\n موصل إلى الباطل الزاهق الزائل\n المضاد للحق الحقيق بالمتابعة والانقياد\n\n\n{ قُل } لهم أيضاً على سبيل المجاراة والمبالغة في المداراة معهم\n بحيث تسند الجرم إلى أنفسكم والعمل إليهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قلْ } لهم: { من يرزقكم من السماوات والأرض } أي: بأسباب سماوية وأرضية؟ { قل اللهُ } وحده\n أمره أن يقرّرهم\n ثم أمره بأن يتولى الإجابة والإقرار عنهم\n أي: يرزقكم الله لا غيره\n وذلك للإشعار بأنهم مقرُّون به بقلوبهم\n إلا أنهم ربما أبَوا أن يتكلموا به\n لأنهم إن تفوّهوا بأن الله رازقهم لزمهم أن يقال لهم: فما لكم لا تعبدون مَن يرزقكم\n وتؤثرون عليه مَن لا يقدر على شيء؟ ثم أمره أن يقول لهم بعد الإلزام والإحجاج: { وإِنا وإِياكم لعلى هُدىً أو في ضلالٍ مبين } أي: ما نحن وأنتم على حالة واحدة\n بلى على حالين متضادين\n واحدنا مهتد\n وهو مَن اتضحت حجته\n والآخر ضال\n وهو مَن قامت عليه الحجة\n ومعناه: أن أحد الفريقين من الموحدين ومن المشركين لعلى أحد الأمرين من الهدى والضلال\n وهذا من كلام المنصف\n الذي كل مَن سمعه\n من مُوالٍ ومعاند\n قال لمَن خوطب به: قد أنصفك صاحبك\n وفي ذكره بعد تقديم ما قدّم من التقرير: دلالة واضحة على مَن هو من الفريقين على الهدى\n ومَن هو في الضلال المبين\n ولكن التعريض أوصل بالمجادل إلى الغرض\n ونحوه قولك لمَن تحقق كذبه: إن أحدنا لكاذب\n ويحتمل أن يكون من تجاهل العارف\n  قال الكواشي: وهذا من المعاريض\n وقد ثبت أن مَن اتبع محمداً على الهدى\n ومَن لم يتبعه على الضلال\n هـ ويحتمل أن يكون من اللف والنشر المرتّب\n وفيه ضعف\n وخولف بين حرفي الجار\n الداخلين على الهدى والضلال لأن صاحب الهدى كأنه مستعلٍ على فرس جواد\n يركضُه حيث شاء\n والضال كأنه منغمس في ظلام\n لا يدري أين يتوجّه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:172",
      "similarity": 0.5636686841485021
    },
    {
      "verse": "29:56",
      "similarity": 0.5474698911183139
    },
    {
      "verse": "34:40",
      "similarity": 0.5109125533186953
    },
    {
      "verse": "16:114",
      "similarity": 0.5029869407322761
    },
    {
      "verse": "4:131",
      "similarity": 0.45032488742869203
    }
  ]
}