{
  "chapter": "سبإ",
  "text": "قل لا تسـلون عما اجرمنا ولا نسـل عما تعملون",
  "translations": [
    {
      "translation": "Say: 'You will not be asked about any evil we committed and we will not be asked about what you did.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"You will not be questioned about the sins that we have committed, nor shall we be questioned about your deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: “You will not be called to account about the guilt we committed, nor will we be called to account for what you did.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"You will not be questioned about our sins nor shall we about your deeds\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “You will not be questioned regarding the sins you assume we have committed, nor will we be questioned regarding your misdeeds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"You will not be asked about our sins, nor shall we be asked of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: You will not be questioned as to what we are guilty of, nor shall we be questioned as to what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'You will not be questioned concerning our sins, neither shall we be questioned as to what you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Ye will not be asked of what we committed, nor shall we be asked of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"You will not be called to account for our sins and we shall not be called to account for what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: ye will not be questioned about that which we have committed, nor shall we be questioned about that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘You will not be questioned about our guilt, nor shall we be questioned about what you do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Ye shall not be questioned as to our sins, nor shall we be questioned as to what ye do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists, pagans, etc.) \"You will not be asked about our sins, nor shall we be asked of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'You will not to be questioned about our sins, neither will we be questioned for your actions'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “You will not be asked about our misdeeds, nor will we be asked about what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"You will not be asked about what we committed, and we will not be asked about what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:25] Say: ‘You will not be questioned about the sins we committed, nor shall we be questioned about what you do’, for we are quit of you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ لَا تُسْأَلُونَ عَمَّا أَجْرَمْنَا وَلَا نُسْأَلُ عَمَّا تَعْمَلُونَ (25)أعيد الأمر بأن يقول لهم مقالاً آخر إعادة لزيادة الاهتمام كما تقدم آنفاً واستدعاء لأسماء المخاطبين بالإِصغاء إليه .ولما كان هذا القول يتضمن بياناً للقول الذي قبله فُصِلتْ جملة الأمر بالقول عن أختها إذ لا يعطف البيان على المبين بحرف النسق ، فإنه لما ردَّد أمر الفريقين بين أن يكون أحدهما على هدى والآخر في ضلال وكان الضلال يأتي بالإِجرام اتّسِعَ في المحاجة فقيل لهم : إذا نحن أجرمنا فأنتم غير مُؤَاخَذِين بجُرمنا وإذا عمِلْتُم عملاً فنحن غير مؤاخذين به ، أي أن كل فريق مؤاخذ وحده بعمله فالأجدى بكلا الفريقين أن ينظر كل في أعماله وأعمال ضده ليعلم أيّ الفريقين أحق بالفوز والنجاة عند الله .وأيضاً فُصِلت لتكون هذه الجملة مستقلة بنفسها ليخصها السامع بالتأمل في مدلولها فيجوز أن تعتبر استئنافاً ابتدائياً ، وهي مع ذلك اعتراض بيّن أثناء الاحتجاج .فمعنى : { لا تسألون } { ولا نسأل } ، أن كل فريق له خويّصته .والسؤال : كناية عن أثره وهو الثواب على العمل الصالح والجزاء على الإِجرام بمثله ، كما هو في قول كعب بن زهير: ... وقيل إنك منسُوب ومسؤولأراد ومؤاخَذ بما سبَق منك لقوله قبلَه: ... لَذَاك أَهيبُ عندي إذْ أُكلمهوإسناد الإِجرام إلى جانب المتكلم ومن معه مبنيّ على زعم المخاطبين ، قال تعالى : { وإذا رأوهم قالوا إن هؤلاء لضالون } \\[ المطففين : 32 \\] كان المشركون يؤنِّبون المؤمنين بأنهم خاطئون في تجنب عبادة أصنام قومهم .وهذه نكتة صوغه في صيغة الماضي لأنه متحقق على زعم المشركين . وصيغ ما يعمل المشركون في صيغة المضارع لأنهم ينتظرون منهم عملاً تعريضاً بأنهم يأتون عملاً غير ما عملوه ، أي يؤمنون بالله بعد كفرهم .وهذا ضرب من المشاركة والموادعة ليخلوا بأنفسهم فينظروا في أمرهم ولا يلهيهم جدال المؤمنين عن استعراض ومحاسبة أنفسهم . وفيه زيادة إنصاف إذ فرض المؤمنون الإِجرام في جانب أنفسهم وأسندوا العمل على إطلاقه في جانب المخاطبين لأن النظر والتدبر بعد ذلك يكشف عن كنه كلا العملين .وليس لهذه الآية تعلق بمشاركة القتال فلا تجعل منسوخة بآيات القتال .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Ye will not be asked of what we committed) of sins, (nor shall we be asked of what ye do) in your state of disbelief. But this was later abrogated by the verse of the sword.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مبالغة في الإسكات والتبكيت: { لاَّ تُسْأَلُونَ } أنتم { عَمَّآ أَجْرَمْنَا } وجئنا به من الآثام { وَلاَ نُسْأَلُ } نحن أيضاً { عَمَّا تَعْمَلُونَ } [سبأ: 25] من الأعمال\n بل كل منا ومنكم رهين ما اكتسبنا من العمل\n فعليكم ما حملتم\n وعلينا ما حملنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل لا تُسألون عمّا أجرمنا ولا نُسأل عما تعملون } أي: ليس القصد بدعائي إياكم خوفاً من ضرر كفركم\n وإنما القصد بما أدعوكم إليه الخير لكم\n فلا يُسأل أحد عن عمل الآخر\n وإنما يُسأل كل واحد عن عمله\n وهذا أيضاً أدخل في الإنصاف\n حيث أسند الإجرام إلى أنفسهم\n وهو محظورٌ\n والعمل إلى المخَاطبين\n وهو مأمورٌ به مشكورٌ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:41",
      "similarity": 0.7146294030972512
    },
    {
      "verse": "15:58",
      "similarity": 0.598239249609613
    },
    {
      "verse": "51:32",
      "similarity": 0.598239249609613
    },
    {
      "verse": "26:99",
      "similarity": 0.5806056510587446
    },
    {
      "verse": "78:1",
      "similarity": 0.528705817551631
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}