{
  "chapter": "سبإ",
  "text": "قل ادعوا۟ الذين زعمتم من دون الله لا يملكون مثقال ذرة فى السموت ولا فى الارض وما لهم فيهما من شرك وما له منهم من ظهير",
  "translations": [
    {
      "translation": "Say: 'Call on those you make claims for besides Allah. They have no power over even the smallest particle, either in the heavens or in the earth. They have no share in them. He has no need of their support.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Call on those you imagine are gods apart from God. They are not masters even of an atom's weight in the heavens and the earth, nor do they have a share in them, nor is any one of them a helper (of God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), say to those who associate others with Allah in His Divinity: “Call upon those whom you fancied to be deities beside Allah. They own not even the smallest particle, neither in the heavens nor on the earth; nor do they have any share in the ownership of either of them. Nor is any of them even a helper of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (Muhammad), \"Ask help from those whom you worship besides God. They do not possess an atom's weight in the heavens and the earth, have no share therein, nor will any of their idols be able to support them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Call those whom you assume (as Gods) besides Allah”; they do not own anything equal even to an atom either in the heavens or in the earth, nor do they have any share in them, nor is any one among them an aide to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Call upon those whom you assert besides Allah, they possess not even the weight of a speck of dust, either in the heavens or on the earth, nor have they any share in either, nor there is for Him any supporter from among them. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Call upon those whom you assert besides Allah; they do not control the weight of an atom in the heavens or in the earth nor have they any partnership in either, nor has He among them any one to back (Him) up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Call on those you have asserted apart from God; they possess not so much as the weight of an ant in the heavens nor in the earth; they have no partnership in either of them, nor has He in them any supporter.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Call upon those whom ye set up beside Allah! They possess not an atom's weight either in the heavens or in the earth, nor have they any share in either, nor hath He an auxiliary among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call upon those whom you set up beside God! They possess not an atom's weight either in the heavens or on the earth, nor have they any share in either, nor has He any helpers among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: call upon those whom ye assert beside Allah. They own not an atom's weight either in the heavens or in the earth, nor have they any partnership in either, nor is there for Him from among them any supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Invoke those whom you claim [to be gods] besides Allah! They do not control [even] an atom’s weight in the heavens or the earth, nor do they have any share in [either of] them, nor is any of them His helper.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Call upon other (gods) whom ye fancy, besides Allah: They have no power,- not the weight of an atom,- in the heavens or on earth: No (sort of) share have they therein, nor is any of them a helper to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: (O Muhammad SAW to those polytheists, pagans, etc.) \"Call upon those whom you assert (to be associate gods) besides Allah, they possess not even the weight of an atom (or a small ant), either in the heavens or on the earth, nor have they any share in either, nor there is for Him any supporter from among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Call on those whom you assert, other than Allah. They do not possess as much as the weight of an atom in the heavens or earth, nor do they have a partnership in either, neither does He have supporters among them'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Call upon those whom you claim besides God. They possess not an atom's weight in the heavens or the earth, and they possess no share of either, and He has no backers from among them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Invoke those you claim [as deities] besides Allah.\" They do not possess an atom's weight [of ability] in the heavens or on the earth, and they do not have therein any partnership [with Him], nor is there for Him from among them any assistant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:22] Say, O Muhammad (s), to the disbelievers of Mecca: ‘Call on those whom you have asserted, those whom you have asserted to be gods, besides God, in other words, other than Him, so that they might benefit you, as you are wont to assert. God, exalted be He, says of them: They do not possess [even] so much as the weight of an atom, of good or evil, in the heavens or in the earth, and they do not have any share in either of them, nor has He, exalted be He, among them, the gods, any auxiliary’, [anyone required as His] helper.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the disbelievers of Mecca, the Banu Malih: (Call upon those whom ye set up) you worship (beside Allah) so that they answer you! This is because the Banu Malih worshipped the jinn, thinking they were angels. Allah said to them: (They possess not) they cannot benefit you (an atom's weight either in the heavens or the earth, nor have they) the angels (any share) partnership with Allah (either, nor hath He an auxiliary among them) nor has He a helper among the angels who helped Him to create the heavens and the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا لَهُ مِنْهُمْ مِّن ظَهِيرٍ } معناه من مُعينٍ\n\n",
      "translations": [
        {
          "translation": " And his saying, {And he has no helper from among them} its meaning is from a supporter.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسموهم شفعاء وعبدوا لهم مثل عبادته سبحانه { قُلِ } لهم يا أكمل الرسل إلزاماً وتبكيتاً: { ٱدْعُواْ } أيها الضالون المشركون الآلهة { ٱلَّذِينَ زَعَمْتُمْ } وأثبتهم { مِّن دُونِ ٱللَّهِ } ليستجيبوا لكم في مهماتكم\n ويستجلبوا لكم المنافع\n ويدفعوا عنكم المضار\n كما هو شأن الألوهية والربوبية\n وكيف تدعونهم لأمثال هذه المهام مع أنهم { لاَ يَمْلِكُونَ } لأنفسهم { مِثْقَالَ ذَرَّةٍ } من الخير والشر والنفع والضر\n لا { فِي ٱلسَّمَٰوَٰتِ وَلاَ فِي ٱلأَرْضِ } لا استقلالاً\n إذ هم ليسوا قابلين للألوهية { وَ } لا مشاركة\n إذ { مَا لَهُمْ فِيهِمَا } أي: في خلقهما وإيجادهما { مِن شِرْكٍ } مشاركة مع الله في ألوهيتهم\n لأنهم من جملة مخلوقاته\n بل من أدناها\n ولا شركة للمخلوق مع خالقه { وَ } لا مظاهرة\n إذ { مَا لَهُ } سبحانه { مِنْهُمْ مِّن ظَهِيرٍ } [سبأ: 22] ولا من غيرهم أيضاً\n معاون له في ألوهيته وربوبيته\n إذ هو سبحانه منزه عن المعاونة والمظاهرة مطلقاً\n\n\n{ وَ } كذلك ليس لهم عنده سبحانه شفاعة مقبولة حتى يشفعوا لهم ويخلصوهم من عذاب الله بعدما نزل عليهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: حذف مفعولي زعم\n أي: زعمتموهم آلهة تعبدونهم من دون الله\n بدلالة السياق عليهما\n يقول الحق جلّ جلاله: { قُلْ } لهم { ادعوا الذين زعمتم من دون الله } أي: زعمتموهم آلهة\n فعبدتموهم من دون الله\n من الأصنام والملائكة\n وسميتموهم باسْمِهِ\n فالتجئوا إليهم فيما يعروكم\n كما تلتجئون إليه في اقتحام الشدائد الكبرى\n وانتظروا استجابتهم لدعائكم كما تنتظرون استجابته\n وهذا تعجيز وإقامة حجة على بطلان عبادتها\n ويُروى أنها نزلت عند الجوع الذي أصاب قريشاً\n ثم ذكر عجزهم فقال: { لا يملكون مثقال ذرةٍ } من خير أو شر\n ونفع أو ضر { في السماوات ولا في الأرض وما لهم فيهما من شِرْكٍ } أي: وما لهم في هذين العالَمين العلوي والسفلي\n من شرك في الخلق\n ولا في المُلك\n { وما له } تعالى { منهم } من آلهتهم { من ظهيرٍ } معين يعينه على تدبير خلقه\n يريد أنه على هذه الصفة من العجز\n فكيف يصحُّ أن يُدْعَوا كما يدعى تعالى\n أو يُرْجَوا كما يُرجى سبحانه؟  ثم أبطل قولهم:",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "99:7",
      "similarity": 0.5110446358092019
    },
    {
      "verse": "68:40",
      "similarity": 0.49074912970453977
    },
    {
      "verse": "99:8",
      "similarity": 0.4638710897739553
    },
    {
      "verse": "17:56",
      "similarity": 0.44851877902694737
    },
    {
      "verse": "28:62",
      "similarity": 0.43312525336105506
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/34:22.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/34:22.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}