{
  "chapter": "سبإ",
  "text": "قل ارونى الذين الحقتم به شركاء كلا بل هو الله العزيز الحكيم",
  "translations": [
    {
      "translation": "Say: 'Show me those you have joined to Him as associates. No indeed! He is Allah, the Almighty, the All- Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Just show me those you associate with Him as compeers.\" No, (you cannot), for He is God, the all-mighty and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “Show me those whom you have attached to Him as His associates (in Divinity).” Nay, Allah alone is Most Mighty, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Show me those whom you have related to God as His partner. He is too Exalted to have any partners. He is the Majestic and All-wise God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “(Dare you) Show me those whom you have matched with Him – never! Rather only He is Allah, the Most Honourable, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Show me those whom you have joined with Him as partners. Nay! But He is Allah, the Almighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Show me those whom you have joined with Him as associates; by no means (can you do it). Nay! He is Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Show me those you have joined to Him as associates. No indeed; rather He is God, the All-mighty, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Show me those whom ye have joined unto Him as partners. Nay (ye dare not)! For He is Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"Show me those whom you have joined with Him as partners. No indeed! For He alone is God, the Mighty One, the Wise One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: show me those whom ye have joined with Him as associates. By no means! Aye! He is Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Show me those whom you associate with Him as partners.’ No! [They can never show any such partner]. Indeed, He is Allah, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Show me those whom ye have joined with Him as partners: by no means (can ye). Nay, He is Allah, the Exalted in Power, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists and pagans): \"Show me those whom you have joined to Him as partners. Nay (there are not at all any partners with Him)! But He is Allah (Alone), the AllMighty, the AllWise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Show me those whom you joined with Him as associates; no, indeed; rather He is Allah, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Show me those you have attached to Him as associates. No indeed! But He is God, the Powerful, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Show me those whom you have attached to Him as partners. No! Rather, He [alone] is Allah, the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:27] Say: ‘Show me, apprise me of, those whom you have joined to Him as associates, in worship. No indeed! — [this is] meant to deter them from [even] supposing that He has an associate. Rather He is God, the Mighty, Whose way will prevail, the Wise’, in the way in which He manages [the affairs of] His creation and so He could not have any associate in His kingdom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ أَرُونِيَ الَّذِينَ أَلْحَقْتُمْ بِهِ شُرَكَاءَ كَلَّا بَلْ هُوَ اللَّهُ الْعَزِيزُ الْحَكِيمُ (27)أعيد الأمر بالقول رابع مرة لمزيد الاهتمام وهو رجوع إلى مهيع الاحتجاج على بطلان الشرك فهو كالنتيجة لجملة { قل من يرزقكم من السماوات والأرض } \\[ سبأ : 24 \\] .والأمر في قوله : { أروني } مستعمل في التعجيز ، وهو تعجيز للمشركين عن إبداء حجة لإِشراكهم ، وهو انتقال من الاحتجاج على بطلان إلهية الأصنام بدليل النظير في قوله : { قل من يرزقكم } إلى إبطال ذلك بدليل البداهة .وقد سُلك من طرق الجدل طريقُ الاستفسار ، والمصطلح عليه عند أهل الجدل أن يكون الاستفسار مقدَّماً على طرائق المناظرة وإنما أخّر هنا لأنه كان مفضياً إلى إبطال دعوى الخصم بحذافيرها فأريد تأخيره لئلا يَفوت افتضاح الخصم بالأدلة السابقة تبسيطاً لبساط المجادلة حتى يكون كل دليل منادياً على غلط الخصوم وباطلهم . وافتضاح الخطأ من مقاصد المناظِر الذي قامت حجته .والإِراءة هنا من الرؤية البصرية فيتعدى إلى مفعولين : أحدهما بالأصالة ، والثاني بهمزة التعدية .والمقصود : أروني شخوصهم لنبصر هل عليها ما يناسب صفة الإِلهية ، أي أن كل من يشاهد الأصنام بادىء مرة يتبيّن له أنها خليّة عن صفات الإِلهية إذ يرى حجارة لا تسمع ولا تبصر ولا تفقه لأن انتفاء الإِلهية عن الأصنام بديهي ولا يحتاج إلى أكثر من رؤية حالها كقول البحْتري: ... أَن يَرى مُبْصِرٌ ويسمعَ واعوالتعبير عن المرئِي بطريق الموصولية لتنبيه المخاطبين على خطئهم في جعلهم إياهم شركاء لله تعالى في الربوبية على نحو قول عبدة بن الطيب: ... إن الذينَ ترونهم إخوانَكميشفي غليل صدورهم أن تُصْرَعوا ... وفي جعل الصلة { ألحقتم } إيماء إلى أن تلك الأصنام لم تكن موصوفة بالإِلهية وصفاً ذاتياً حقاً ولكن المشركين ألحقوها بالله تعالى ، فتلك خلعة خلعها عليهم أصحاب الأهواء .وتلك حالة تخالف صفة الإِلهية لأن الإِلهية صفة ذاتية قديمة ، وهذا الإِلحاق اخترعه لهم عَمرو بن لُحَيّ ولم يكن عند العرب من قبل ، وضمير { به } عائد إلى اسم الجلالة من جملة { قل ما يرزقكم من السماوات والأرض قل الله } \\[ سبأ : 24 \\] .وانتصب { شركاء } على الحال من اسم الموصول . والمعنى : شركاء له .ولما أعرض عن الخوض في آثار هذه الإِراءة علم أنهم مفتضحون عند تلك الإِراءة فقُدرت حاصلة ، وأُعقب طلب تحصيلها بإِثبات أثرها وهو الردع عن اعتقاد إلهيتها ، وإبطالُها عنهم بإثباتها لله تعالى وحده فلذلك جمع بين حرفي الردع والإِبطال ثم الانتقال إلى تعيين الإِله الحق على طريقة قوله : { كلا بل لا تكرمون اليتيم } \\[ الفجر : 17 \\] .وضمير { هو الله } ضمير الشأن . والجملة بعده تفسير لمعنى الشأن و { العزيز الحكيم } خبراننِ ، أي بل الشأن المهمّ الله العزيز الحكيم لا آلهتكم؛ ففي الجملة قصر العزة والحكم على الله تعالى كناية عن قَصر الإِلهية عليه تعالى قصرَ إفراد .ويجوز أن يكون الضمير عائداً إلى الإِله المفهوم من قوله : { الذين ألحقتم به شركاء } وهو مبتدأ والجملة بعده خبر .ويجوز أن يكون عائداً إلى المستحضر في الذهن وهو الله . وتفسيره قوله : { الله } فاسم الجلالة عطف بيان . و { العزيز الحكيم } خبرَان عن الضمير . والفرق بين هذا الوجه وبين الوجه الأول يظهر في اختلاف مدلول الضمير المنفصل واختلاففِ موقع اسم الجلالة بعده ، واختلاف موقع الجملة بعد ذلك .والعِزَّة : الاستغناء عن الغير . و { الحكيم } : وصف من الحكمة وهي منتهى العلم ، أو من الإِحكام وهو إتقان الصنع ، شاع في الأمرين . وهذا إثبات لافتقار أصنامهم وانتفاء العلم عنها . وهذا مضمون قول إبراهيم عليه السلام : { يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئاً } \\[ مريم : 42 \\] .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Show me those whom ye have joined) ascribe (unto Him as partners) from among the idols; what have they created? Allah then said to them: (Nay (ye dare not)) because, they truly have not created anything! (For He is Allah) He created all that, (the Mighty) in retribution against the disbelievers, (the Wise) in His command and judgement; He commanded that none should be worshipped save Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وادعيتموه { شُرَكَآءَ } معه\n مستحقين للعبادة مثله\n وأخبروني عن أخص أوصافهم التي بها يستحقون الألوهية والمعبودية\n لا تأمل أيضاً في شأنهم والتدبر في حقهم\n ثم رد عليهم سبحانه\n ردعاً لهم وزجراً عا هم عليه\n وإرشاداً لهم إلى ما هو الحق الحقيق بالاتباع\n فقال: { كَلاَّ } أي: ارتدعوا أيها المشركون\n المسرفون عن دعوى الشركة مع الله الواحد الأحد الصمد\n الفرد الوتر\n الذي ليس له شريك ولا نظير ولا وزير ولا ظهير { بَلْ هُوَ ٱللَّهُ } الواحد الأحد\n المستقل بالألوهية والربوبية\n بل هو في الوجود والتحقق { ٱلْعَزِيزُ } الغالب القادر الظاهر على من دونه من الأظلال الهالكة المضمحلة\n المتلاشية في شمس ذاته\n المتشعشعة المتجلية حسب أسمائه وصفاته { ٱلْحْكِيمُ } [الحكيم: 27] المقتن في أفعاله المترتبة على علمه وإرادته وقدرته\n يفعل ما يشاء إرادة واختياراً\n ويحكم ما يريد استقلالاً\n ليس لأحد أن يتصرف في ملكه وملكوته\n\n\n{ وَ }  بعدما ثبت ألاَّ معبود في الوجود سوانا\n ولا مستحق للعبادة غيرنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك زجرهم بقوله: { كلا } أي: ارتدعوا عن هذه المقالة الشنعاء\n وتنبّهوا عن ضلالكم\n { بل هو الله العزيزُ } أي: الغالب القاهر\n فلا يشاركه أحد\n \" وهو \": ضمير الشأن\n { الحكيمُ } في تدبيره وصنعه\n والمعنى: بل الوحدانية لله وحده لأن الكلام إنما وقع في الشركة\n ولا نزاع في إثبات الله ووجوده\n وإنما النزاع في وحدانيته\n أي: بل هو الله وحده العزيز الحكيم\n الإشارة: أرزاق الأرواح والأشباح بيد الله\n فأهل القلوب من أهل التجريد اشتغلوا بطلب أرزاق الأرواح\n وغابوا عن طلب أرزاق الأشباح\n مع كونهم مفتقرين إليه\n أي: غابوا عن أسبابه\n وأهل الظاهر اشتغلوا بطلب أرزاق الأشباح\n وغابوا عن التوجُّه إلى أرزاق الأرواح\n مع كونهم أحوج الناس إليه\n وكل فريق يرجح ما هو فيه\n فأهل الأسباب يعترضون على أهل التجريد\n ويرجحون تعاطي الأسباب\n وأهل التجريد يرجحون مقام التجريد\n فيقولون لهم: وإنا أو إياكم لعلى هُدىً أو في ضلال مبين\n قل: لا تُسألون عما أجرمنا\n بزعمكم\n من ترك الأسباب\n ولا نُسأل عما تعملون\n وسيجمع الله بيننا\n ويحكم بما هو الحق\n فإن كنتم تعتمدون على الأسباب\n وتركنون إليها\n فهو شرك\n أروني الذين ألحقتم به شركاء\n كلا\n بل هو الله العزيز الحكيم\n يُعز أولياءه\n المتوجهين إليه\n الحكيم في إسقاط مَن أعرض عنه إلى غيره\n  قال القشيري: { قل يجمع بيننا ربنا } أخبر سبحانه أنه يجمع بين عباده\n ثم يعاملهم في حال اجتماعهم\n بغير ما يعاملهم في حال افتراقهم\n وللاجتماع أثرٌ كبيرٌ في الشريعة\n وللصلاة في الجماعة أثر مخصوص\n ثم قال: وللشيوخ في الاجتماع زوائد\n ويستروحون إلى هذه الآية: { قل يجمع بينا ربنا ثم يفتح\n\n\n }\nهـ\n ولمَّا ذكر ما منّ به على داود وسليمان\n وذكر وبال مَن لم يشكر النعم\n ذكر ما منّ به على نبينا محمد صلى الله عليه وسلم من عموم الرسالة والدعوة\n فقال: { وَمَآ أَرْسَلْنَاكَ إِلاَّ كَآفَّةً لِّلنَّاسِ بَشِيراً\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:3",
      "similarity": 0.855222011539851
    },
    {
      "verse": "26:83",
      "similarity": 0.7556578136487667
    },
    {
      "verse": "3:170",
      "similarity": 0.6516206681521676
    },
    {
      "verse": "12:101",
      "similarity": 0.6058369386603779
    },
    {
      "verse": "82:9",
      "similarity": 0.2696156386512218
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}