{
  "chapter": "سبإ",
  "text": "قل ارونى الذين الحقتم به شركاء كلا بل هو الله العزيز الحكيم",
  "translations": [
    {
      "translation": "Say: 'Show me those you have joined to Him as associates. No indeed! He is Allah, the Almighty, the All- Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Just show me those you associate with Him as compeers.\" No, (you cannot), for He is God, the all-mighty and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “Show me those whom you have attached to Him as His associates (in Divinity).” Nay, Allah alone is Most Mighty, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Show me those whom you have related to God as His partner. He is too Exalted to have any partners. He is the Majestic and All-wise God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “(Dare you) Show me those whom you have matched with Him – never! Rather only He is Allah, the Most Honourable, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Show me those whom you have joined with Him as partners. Nay! But He is Allah, the Almighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Show me those whom you have joined with Him as associates; by no means (can you do it). Nay! He is Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Show me those you have joined to Him as associates. No indeed; rather He is God, the All-mighty, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Show me those whom ye have joined unto Him as partners. Nay (ye dare not)! For He is Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"Show me those whom you have joined with Him as partners. No indeed! For He alone is God, the Mighty One, the Wise One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: show me those whom ye have joined with Him as associates. By no means! Aye! He is Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Show me those whom you associate with Him as partners.’ No! [They can never show any such partner]. Indeed, He is Allah, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Show me those whom ye have joined with Him as partners: by no means (can ye). Nay, He is Allah, the Exalted in Power, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists and pagans): \"Show me those whom you have joined to Him as partners. Nay (there are not at all any partners with Him)! But He is Allah (Alone), the AllMighty, the AllWise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Show me those whom you joined with Him as associates; no, indeed; rather He is Allah, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Show me those you have attached to Him as associates. No indeed! But He is God, the Powerful, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Show me those whom you have attached to Him as partners. No! Rather, He [alone] is Allah, the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:27] Say: ‘Show me, apprise me of, those whom you have joined to Him as associates, in worship. No indeed! — [this is] meant to deter them from [even] supposing that He has an associate. Rather He is God, the Mighty, Whose way will prevail, the Wise’, in the way in which He manages [the affairs of] His creation and so He could not have any associate in His kingdom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Show me those whom ye have joined) ascribe (unto Him as partners) from among the idols; what have they created? Allah then said to them: (Nay (ye dare not)) because, they truly have not created anything! (For He is Allah) He created all that, (the Mighty) in retribution against the disbelievers, (the Wise) in His command and judgement; He commanded that none should be worshipped save Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وادعيتموه { شُرَكَآءَ } معه\n مستحقين للعبادة مثله\n وأخبروني عن أخص أوصافهم التي بها يستحقون الألوهية والمعبودية\n لا تأمل أيضاً في شأنهم والتدبر في حقهم\n ثم رد عليهم سبحانه\n ردعاً لهم وزجراً عا هم عليه\n وإرشاداً لهم إلى ما هو الحق الحقيق بالاتباع\n فقال: { كَلاَّ } أي: ارتدعوا أيها المشركون\n المسرفون عن دعوى الشركة مع الله الواحد الأحد الصمد\n الفرد الوتر\n الذي ليس له شريك ولا نظير ولا وزير ولا ظهير { بَلْ هُوَ ٱللَّهُ } الواحد الأحد\n المستقل بالألوهية والربوبية\n بل هو في الوجود والتحقق { ٱلْعَزِيزُ } الغالب القادر الظاهر على من دونه من الأظلال الهالكة المضمحلة\n المتلاشية في شمس ذاته\n المتشعشعة المتجلية حسب أسمائه وصفاته { ٱلْحْكِيمُ } [الحكيم: 27] المقتن في أفعاله المترتبة على علمه وإرادته وقدرته\n يفعل ما يشاء إرادة واختياراً\n ويحكم ما يريد استقلالاً\n ليس لأحد أن يتصرف في ملكه وملكوته\n\n\n{ وَ }  بعدما ثبت ألاَّ معبود في الوجود سوانا\n ولا مستحق للعبادة غيرنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل أَرونيَ الذي ألحقتم } أي: ألحقتموهم { به شركاءَ } في العبادة معه، بأي صفة ألحقتموهم به شركاء في استحقاق العبادة، وهم أعجز شيء\n قال القشيري: كانوا يقولون في تلبيتهم: لبيك لا شريك لك، إلا شريكاً هو لك، تملكه وما ملك لانهماكهم في ضلالهم، مع تحققهم بأنها جمادات لا تفقه ولا تعقل، ولا تسمع ولا تبصر، ولا شبهة لهم غير تقليد أسلافهم\n\n\nهـ\n والمعنى قوله: { أَروني } مع كونه يراهم: أن يريهم الخطأ العظيم في إلحاق الشركاء بالله، وأن يطلعهم على حالة الإشراك به، ولذلك زجرهم بقوله: { كلا } أي: ارتدعوا عن هذه المقالة الشنعاء، وتنبّهوا عن ضلالكم\n { بل هو الله العزيزُ } أي: الغالب القاهر، فلا يشاركه أحد، \" وهو \": ضمير الشأن، { الحكيمُ } في تدبيره وصنعه\n والمعنى: بل الوحدانية لله وحده لأن الكلام إنما وقع في الشركة، ولا نزاع في إثبات الله ووجوده، وإنما النزاع في وحدانيته\n أي: بل هو الله وحده العزيز الحكيم\n الإشارة: أرزاق الأرواح والأشباح بيد الله، فأهل القلوب من أهل التجريد اشتغلوا بطلب أرزاق الأرواح، وغابوا عن طلب أرزاق الأشباح، مع كونهم مفتقرين إليه، أي: غابوا عن أسبابه\n وأهل الظاهر اشتغلوا بطلب أرزاق الأشباح، وغابوا عن التوجُّه إلى أرزاق الأرواح، مع كونهم أحوج الناس إليه\n وكل فريق يرجح ما هو فيه، فأهل الأسباب يعترضون على أهل التجريد، ويرجحون تعاطي الأسباب، وأهل التجريد يرجحون مقام التجريد، فيقولون لهم: وإنا أو إياكم لعلى هُدىً أو في ضلال مبين\n قل: لا تُسألون عما أجرمنا، بزعمكم، من ترك الأسباب، ولا نُسأل عما تعملون\n وسيجمع الله بيننا، ويحكم بما هو الحق، فإن كنتم تعتمدون على الأسباب، وتركنون إليها، فهو شرك، أروني الذين ألحقتم به شركاء، كلا، بل هو الله العزيز الحكيم، يُعز أولياءه، المتوجهين إليه، الحكيم في إسقاط مَن أعرض عنه إلى غيره\n  قال القشيري: { قل يجمع بيننا ربنا } أخبر سبحانه أنه يجمع بين عباده، ثم يعاملهم في حال اجتماعهم، بغير ما يعاملهم في حال افتراقهم، وللاجتماع أثرٌ كبيرٌ في الشريعة، وللصلاة في الجماعة أثر مخصوص\n ثم قال: وللشيوخ في الاجتماع زوائد، ويستروحون إلى هذه الآية: { قل يجمع بينا ربنا ثم يفتح\n\n\n }\nهـ\n ولمَّا ذكر ما منّ به على داود وسليمان، وذكر وبال مَن لم يشكر النعم، ذكر ما منّ به على نبينا محمد صلى الله عليه وسلم من عموم الرسالة والدعوة، فقال: { وَمَآ أَرْسَلْنَاكَ إِلاَّ كَآفَّةً لِّلنَّاسِ بَشِيراً\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:3",
      "similarity": 0.855222011539851
    },
    {
      "verse": "26:83",
      "similarity": 0.7556578136487667
    },
    {
      "verse": "3:170",
      "similarity": 0.6516206681521676
    },
    {
      "verse": "12:101",
      "similarity": 0.6058369386603779
    },
    {
      "verse": "82:9",
      "similarity": 0.2696156386512218
    }
  ]
}