{
  "chapter": "سبإ",
  "text": "وما كان له عليهم من سلطن الا لنعلم من يؤمن بالءاخرة ممن هو منها فى شك وربك على كل شىء حفيظ",
  "translations": [
    {
      "translation": "He had no authority over them except to enable Us to know those who have iman in the Next World from those who are in doubt about it. Your Lord is the Preserver of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He had no authority over them save for the purpose of Our knowing who believed in the world to come, and who doubted it. For your Lord keeps a watch over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iblis had no authority over them and whatever happened was in order that We might know him who believes in the Hereafter as distinct from him who is in doubt about it. Your Lord is watchful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He did not have any authority over them except to the extent that would allow Us to know who had faith in the life to come and who had doubts about it. Your Lord is a Guard over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan had no control over them at all, except that We willed to reveal as to who believes in the Hereafter and who is in doubt of it; and your Lord is a Guardian over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he had no authority over them, -- except that We might test him who believes in the Hereafter, from him who is in doubt about it. And your Lord is Watchful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he has no authority over them, but that We may distinguish him who believes in the hereafter from him who is in doubt concerning it; and your Lord is the Preserver of all things\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet he had no authority over them, but that We might know him who believed in the Hereafter from him who was in doubt thereof Thy Lord is Guardian over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he had no warrant whatsoever against them, save that We would know him who believeth in the Hereafter from him who is in doubt thereof; and thy Lord (O Muhammad) taketh note of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but he had no authority over them; We only desired to distinguish those who believed in the Hereafter from those who were in doubt concerning it. Your Lord is watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he hath no authority over them except that We would know him who believeth in the Hereafter from him who is in doubt thereof. And thy Lord is over everything a Warden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He had no authority over them, but that We may ascertain those who believe in the Hereafter from those who are in doubt about it, and your Lord is watchful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he had no authority over them,- except that We might test the man who believes in the Hereafter from him who is in doubt concerning it: and thy Lord doth watch over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he (Iblis Satan) had no authority over them, except that We might test him, who believes in the Hereafter from him who is in doubt about it. And your Lord is a Hafiz over everything. (AllKnower of everything i.e. He keeps record of each and every person as regards deeds, and then He will reward them accordingly).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet he had no authority over them except that We would know who believed in the Everlasting Life, from he who doubted. Your Lord is the Watcher over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He had no authority over them; except that We willed to distinguish him who believes in the Hereafter, from him who is doubtful about it. Your Lord is Guardian over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he had over them no authority except [it was decreed] that We might make evident who believes in the Hereafter from who is thereof in doubt. And your Lord, over all things, is Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:21] And he did not have any warrant over them, any power to sway [them], from Us, but that We might know, by [this] knowledge being made manifest, him who believed in the Hereafter from him who was in doubt thereof, and so requite each of the two accordingly. And your Lord is Preserver, Watcher, of all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he) Satan (had no warrant) no power or the ability to impose his will (whatsoever against them) against the Children of Israel, (save) except to the measure (that We would know him who believeth in the Hereafter) that We know he who, in preeternity, believed in resurrection after death (from him who is in doubt thereof) from him who is in doubt about the coming of the Hour; (and thy Lord) Muhammad (taketh note of all things) relating to their works. 485\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ لِنَعْلَمَ } معناه لِنميزَ ونُظهرَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Except that we know,\" means to distinguish and make apparent.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والفريق المستثنون هم المخلصون { وما كان له عليهم من سلطان } أي: ما سلطناه عليهم إلا لظهور علمنا في مظاهر العلماء المحققين المخلصين وامتيازهم عن المحجوبين المرتابين\n فإن المستعدّ الموفق الصافي القلب ينبع علمه من مكمن الاستعداد ويتفجر من قلبه عند وسوسة الشيطان فيرجمه بمصابيح الحجج النيّرة ويطرده بالعياذ بالله عند ظهور مفسدته الغوية بخلاف غيره من الذين اسودّت قلوبهم بصفات النفوس وناسبت بجهالاتهم مكايد الشيطان وأحوال القيامة الكبرى من الجمع والفصل والفتح بين المحق والمبطل ومقالات الظالمين كلها تظهر عند ظهور المهدي عليه السلام",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنه { مَا كَانَ لَهُ عَلَيْهِمْ مِّن سُلْطَانٍ } حجة قاهرة غالبة ملجئة لهم إلى متابعته وقبول وسوسته من قِبله\n بل من قِبلنا أيضاً\n وما ابتلينا وإغرينا هؤلاء البغاء بمتابعته - لعنه الله - { إِلاَّ لِنَعْلَمَ } ونميز ونظهر التفرقة بين { مَن يُؤْمِنُ بِٱلآخِرَةِ } وبجميع المعتقدات التي أخبرها الله بها { مِمَّنْ هُوَ مِنْهَا } أي: من النشأة الأخرى\n والأمور الكائنة فيها { فِي شَكٍّ } تردد وارتياب\n ولهذه التفرقة والتمييز\n أتبعناهم إليه { وَ } لا تستبعد يا أكمل الرسل أمثال هذه الابتلاءات والاختبارات من الله\n إذ { رَبُّكَ } الذي رباك على الهداية العامة { عَلَى كُلِّ شَيْءٍ } من مقدوراته ومراداته الكائنة والتي ستكون\n والجارية على سرائر عباده وضمائرهم\n والتي ستجري { حَفُيظٌ } [سبأ: 21] شهيد\n لا يغيب عنه إيمان مؤمن\n وكفر كافر\n وشكر شاكر\n وشك شاك\n وإخلاص مخلص\n\nوبعدما أثبت المشركون المصرون على كفران نعم الله أمثال هؤلاء الغواة المذكورين آلهة سوى الله سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وما كان له عليهم من سلطانٍ } أي: ما كان لإبليس على مَن صدق ظنه عليهم من تسلُّط واستيلاء بالوسوسة\n { إِلا لِنَعْلَم } موجوداً ما علمناه معدوماً { من يؤمنُ بالآخرةِ ممن هو منها في شكٍّ } أي: إِلا ليتعلق علمنا بذلك تعلُّقاً تنجيزيًّا\n يترتب عليه الجزاء\n أو: ليتميز المؤمن من الشاك\n أو: ليؤمن مَن قُدّر إيمانُه\n ويشك من قُدر ضلالُه\n { وربك على كل شيءٍ حفيظٌ } محافظ رقيب\n وفعيل ومفاعل أخوان\n الإشارة: كل مَن لم يصل إلى حضرة العيان صدق عليه بعض ظن الشيطان لأنه لما رأى بشرية آدم مجوفة\n ظن أنه يجري معه مجرى الدم\n فكل مَن لم يسد مجاريه بذكر الله\n حتى يستولي الذكر على بشريته\n فيصير قطعة من نور\n فلا بد أن يدخل معه بعض وساوسه\n ولا يزال يتسلّط على قلب ابن آدم\n حتى يدخل حضرة القدس\n فحينئذ يحرس منه\n لقوله تعالى:\n[الحجر: 42]\n وعباده الحقيقيون هم الذين تحرّروا مما سواه\n فلم يبقَ لهم في هذا العالم علقة\n وهم المرادون بقوله تعالى: { إِلا فريقاً من المؤمنين } وما سلَّطه عليهم إلا ليتميز الخواص من العوام\n فلولا ميادين النفوس\n ومجاهدة إبليس\n ما تحقق سير السائرين\n أي: وما كان له عليهم من تسلُّط إلا لنعلم علم ظهور مَن يؤمن بالخصلة الآخرة\n وهي الشهود\n ممن هو منها في شك\n { وربك على كل شيء حفيظ } يحفظ قلوب أوليائه من استيلاء غيره عليها\n وبالله التوفيق\n  ولمَّا كان تسلط إبليس جُلَّة من الشرك الذي زينه لهم ردّه بقوله: { قُلِ ٱدْعُواْ ٱلَّذِينَ زَعَمْتُمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:8",
      "similarity": 0.5497451308522392
    },
    {
      "verse": "10:104",
      "similarity": 0.5193241784949381
    },
    {
      "verse": "44:9",
      "similarity": 0.5159940506431134
    },
    {
      "verse": "14:10",
      "similarity": 0.47304550475561297
    },
    {
      "verse": "10:94",
      "similarity": 0.4564626701537806
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034021.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034021.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:21.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}