{
  "chapter": "سبإ",
  "text": "وقال الذين استضعفوا۟ للذين استكبروا۟ بل مكر اليل والنهار اذ تامروننا ان نكفر بالله ونجعل له اندادا واسروا۟ الندامة لما راوا۟ العذاب وجعلنا الاغلل فى اعناق الذين كفروا۟ هل يجزون الا ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Those deemed weak will say to those deemed great, 'No, it was your scheming night and day when you commanded us to reject Allah and assign equals to Him.' But they will show their remorse when they see the punishment. We will put iron collars round the necks of those who are kafir. Will they be repaid for anything but what they did?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the weak will say to the arrogant: \"Not in the least. It was your plotting night and day when you ordered us to disbelieve in God and associate compeers with Him.\" When they see the punishment they will express repentance. But We shall put iron collars round the necks of infidels. Will they be requited for anything but what they did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were suppressed will say to those who waxed arrogant: “By no means; it was your scheming, night and day, when you would enjoin us to disbelieve in Allah and set up others as equals to Him.” When they are confronted with the chastisement, they will be remorseful in their hearts. We shall put fetters around the necks of the unbelievers. Can people be requited except for their deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The oppressed ones will say to them, \"It was you who planned night and day, ordering us to disbelieve God, and consider other things equal to Him.\" They will hide their regret on seeing their torment. We shall chain the necks of the disbelievers. Can they be recompensed with other than what they deserved for their deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were subdued will say to those who were conceited, “Rather it was your deceit during night and day, for you commanded us to deny Allah and to set up equals to Him”; and inwardly they began regretting when they saw the punishment; and We placed shackles around the necks of the disbelievers; what recompense will they get except what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were deemed weak will say to those who were arrogant: \"Nay, but it was your plotting by night and day, when you ordered us to disbelieve in Allah and set up rivals to Him!\" And each of them (parties) will conceal their own regrets, when they behold the torment. And We shall put iron collars round the necks of those who disbelieved. Are they requited aught except what they used to do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were deemed weak shall say to those who were proud. Nay, (it was) planning by night and day when you told us to disbelieve in Allah and to set up likes with Him. And they shall conceal regret when they shall see the punishment; and We will put shackles on the necks of those who disbelieved; they shall not be requited but what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those that were abased will say to those that waxed proud, 'Nay, but devising night and day, when you were ordering us to disbelieve in God, and to set up compeers to Him.' They will be secretly remorseful when they see the chastisement and We put fetters on the necks of the unbelievers; shall they be recompensed except for what they were doing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were despised say unto those who were proud: Nay but (it was your) scheming night and day, when ye commanded us to disbelieve in Allah and set up rivals unto Him. And they are filled with remorse when they behold the doom; and We place carcans on the necks of those who disbelieved. Are they requited aught save what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those deemed weak will say to those deemed great, \"No, it was your scheming night and day when you commanded us to reject God and assign equals to Him.\" But they will show their remorse when they see the punishment. We will put iron collars round the necks of those who had been bent on denying the truth. They will be requited only in proportion to their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were deemed weak will say Unto those who were stiff necked: aye, it was your plotting by night and by day, When ye were commanding us that we should disbelieve in Allah and set up peers Unto Him. And they Will keep secret their shame when they behold the torment. And We shall place shackles on the necks of those who disbelieved. They shall be requited not save according to that which they had been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were abased will say to those who were arrogant, ‘No, [it was your] night and day plotting, when you prompted us to forswear Allah and to set up equals to Him.’ They will hide their remorse when they sight the punishment, and We will put iron collars around the necks of the faithless. Shall they not be requited for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had been despised will say to the arrogant ones: \"Nay! it was a plot (of yours) by day and by night: Behold! Ye (constantly) ordered us to be ungrateful to Allah and to attribute equals to Him!\" They will declare (their) repentance when they see the Penalty: We shall put yokes on the necks of the Unbelievers: It would only be a requital for their (ill) Deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were deemed weak will say to those who were arrogant: \"Nay, but it was your plotting by night and day, when you ordered us to disbelieve in Allah and set up rivals to Him!\" And each of them (parties) will conceal their own regrets (for disobeying Allah during this worldly life), when they behold the torment. And We shall put iron collars round the necks of those who disbelieved. Are they requited aught except what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that were abased will say to those who were proud: 'Rather, it was scheming night and day, when you ordered us to disbelieve in Allah and set up equals to Him' And they will regret in secret when they see the punishment and We put (iron) fetters on the necks of the unbelievers. Shall they be recompensed except for what they were doing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were oppressed will say to those who were arrogant, “It was your scheming by night and day; as you instructed us to reject God, and to set up rivals to Him.” They will hide their remorse when they see the retribution. We will put yokes around the necks of those who disbelieved. Will they be repaid for anything other than what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were oppressed will say to those who were arrogant, \"Rather, [it was your] conspiracy of night and day when you were ordering us to disbelieve in Allah and attribute to Him equals.\" But they will [all] confide regret when they see the punishment; and We will put shackles on the necks of those who disbelieved. Will they be recompensed except for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:33] And those who were oppressed will say to those who were arrogant, ‘Nay, but [it was your] scheming night and day, in other words, [such were] your schemes against us during both [of these times], when you used to command us to disbelieve in God and set up partners with Him’. And they, that is, the two parties, will conceal their remorse, for not having believed in Him, when they see the chastisement, in other words, each person will hide it [his remorse] from the next for fear of being reviled; and We will place fetters around the necks of the disbelievers, [while they are] in the Fire. Shall they be requited except, the requital, for what they used to do?, in the world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who were despised) those who were oppressed, who are the lowly among people (say unto those who were proud) their leaders: (Nay but (it was your) scheming night and day) it is what you said to us by day and night, (when ye commanded us to disbelieve in Allah) when you told us to disbelieve in Muhammad (pbuh) and in the Qur'an (and set up rivals) equals and forms (unto Him. And they are filled with remorse) both the leaders and those who obeyed them (when they behold the doom; and We place carcans on the necks of those who disbelieved) in Muhammad (pbuh) and in the Qur'an. He says: their hands were tied to their necks. (Are they requited) on the Day of Judgement (aught save what they did) and said in their state of disbelief?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلْ مَكْرُ ٱلَّيلِ وَٱلنَّهَارِ } معناهُ منهما، وقال: بل مكرُهُم بالليلِ والنَّهارِ\n\n\n\n\nوقوله تعالى: { وَنَجْعَلَ لَهُ أَندَاداً } معناه أشباهٌ وأمثالٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {But the plot of night and day} its meaning from both of them, and He said: Rather, their plot is by night and by day.\n\nAnd His saying, {And We will make for him a successor} [means] likenesses and examples.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ ٱلَّذِينَ ٱسْتُضْعِفُواْ لِلَّذِينَ ٱسْتَكْبَرُواْ } الضعفاء { بَلْ مَكْرُ ٱلَّيلِ وَٱلنَّهَارِ }: لم يكن إضلالكم إيَّانا وتغريركم علينا وحيلتكم في تضليلنا دائماً مستوعباً للأيام والليالي\n ليس مخصوصاً بوقت دون وقت\n لأنكم رؤساء بيننا\n أصحاب الثروة فينا\n فتخدعون بنا قولاً وفعلاً\n وتميل قلوبنا إلى ما أنتم عليه { إِذْ تَأْمُرُونَنَآ أَن نَّكْفُرَ بِٱللَّهِ } وتوحيده وننكر رسله وكتبه { وَنَجْعَلَ لَهُ } أي: نثبت ونعتقد لله الواحد الأحد\n المنزه عن الشريك { أَندَاداً } شركاء معه في استحقاق العبادة والإطاعة والتوجه والرجوع في مطلق المهام\n\n\n{ وَ } بالجملة: { أَسَرُّواْ } أي: أظهروا وأخفوا { ٱلنَّدَامَةَ } على ما فات عنهم { لَمَّا رَأَوُاْ ٱلْعَذَابَ } النازل عليهم بما صدره عنهم في النشأة الأخرى\n أظهروا الندامة\n تحسراً وتحزناً\n أو أخفوها\n مخافة التعيير والتقريع { وَ } بعدما أردنا تعذيبهم { جَعَلْنَا ٱلأَغْلاَلَ } الممثلة لهم من تعديهم وظلمهم بالخروج عن مقتضى الحدود الإلهية { فِيۤ أَعْنَاقِ ٱلَّذِينَ كَفَرُواْ } بتوحيد الله\n وأثبتوا له أنداداً\n وأنكروا لكتبه ورسله تابعاً ومتبوعاً\n ضالاً ومضلاً\n وقلنا لهم توبيخاً وتعييراً: { هَلْ يُجْزَوْنَ } هؤلاء البعداء عن ساحة عز القبول { إِلاَّ مَا كَانُواْ يَعْمَلُونَ } [سبأ: 33] أي: ما يجازون إلا بمقتضى أعمالهم وأفعالهم\n وعلى طبقها على مقتضى العدل الإلهي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذ تأمروننا أن نكفرَ بالله ونَجْعَلَ له أنداداً } أشباهاً\n نعبدها معه\n والحاصل: أن المستكبرين لَمَّا أنكروا أن يكونوا هم السبب في كفر المستضعفين\n وأثبتوا أن ذلك بسبب اختيارهم\n كرّ عليهم المستضعفون بقولهم: { بل مكر الليل والنهار } فأبطلوا إضرابهم بإضرابهم\n كأنهم قالوا: ما كان الإجرامُ من جهتنا\n بل من جهة مكركم بنا دائماً\n ليلاً ونهاراً\n وحملُكم إيّانا على الشرك واتخاذ الأنداد\n\nثم حصل الندم حيث لم ينفع\n كما قال تعالى: { وأسَرُّوا الندامةَ لَمَّا رَأَوُا العذابَ } أي: أضمرَ الندم كِلاَ الفريقين\n وأخفاه عن رفيقه\n مخافة التعيير\n لَمّا رأوا العذاب\n وتحققوا لحوقه بهم\n فندم المستكبرون على إضلالهم وضلالهم\n والمستضعفون على ضلالهم واتباعهم\n وقيل: معنى أسروا: أظهروا\n فهو من الأضداد\n { وجعلنا الأغلالَ في أعناق الذين كفروا } أي: في أعناقهم\n فأظهر في محل الإضمار للدلالة على ما استوجبوا به الأغلال\n وهو كفرهم\n { هل يُجزون إِلا ما كانوا يعملون } أي: لا يفعل بهم إلا ما استوجبته أعمالُهم الخبيثة في الدنيا\n الإشارة: كل مَن له رئاسة وجاه\n عالماً كان أو جاهلاً\n وصدّ الناس عن طريق التربية على يد المشايخ\n يقع له هذا الخصام\n مع مَن صدّهم من ضعفاء الناس\n حيث يرتفع المقربون\n ويسقط الغافلون من تلك المراتب\n فيقع الندم والتحسُّر\n ويتبرأ الرؤساء من المرؤوسين من عامة أهل اليمين\n قال القشيري: وهكذا أصحابُ الزلاتِ\n الأخلاء في الفساد ـ أي: يتبرأ بعضهم من بعض ـ وكذلك الجوارحُ والأعضاء\n يشهد بعضها على بعض\n اليدُ تقول للجملة: أخذت\n العين تقول: أبْصرت\n والاختلاف في الجملة عقوبة\n ومَنْ عمل بالمعاصي أخرج الله عليه مَن كان أطوع له\n ولكنهم لا يعلمون ذلك\n ولو علموا لاعتذروا\n ولو اعتذروا لتابوا وتوقفوا\n ولكن ليقضي الله أمراً كان مفعولاً\n هـ\n ثم سلّى رسوله فقال: { وَمَآ أَرْسَلْنَا فِي قَرْيَةٍ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:9",
      "similarity": 0.4025802518599299
    },
    {
      "verse": "2:165",
      "similarity": 0.38042234327846436
    },
    {
      "verse": "14:30",
      "similarity": 0.371381308965591
    },
    {
      "verse": "10:54",
      "similarity": 0.3570219474087874
    },
    {
      "verse": "13:5",
      "similarity": 0.3525296636043497
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/34:33.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/34:33.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}