{
  "chapter": "سبإ",
  "text": "وما امولكم ولا اولدكم بالتى تقربكم عندنا زلفى الا من ءامن وعمل صلحا فاو۟لئك لهم جزاء الضعف بما عملوا۟ وهم فى الغرفت ءامنون",
  "translations": [
    {
      "translation": "It is not your wealth and children that will bring you closer to Us, except those who believe and do the right. These will be given a two-fold reward for their deeds, and will dwell in peace in the high empyrean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your riches nor your children that make you near-stationed to Us, except for him who has faith and acts righteously; it is they who will receive double the recompense for their deeds. They shall live in lofty mansions in perfect peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your property and children cannot bring you closer to Us. Only those who believe and act righteously will have double reward for their deeds and will live in secure mansions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your wealth and your children are not capable of bringing you near to Us, but one who believes and did good deeds (is brought close); for them is double the reward – the recompense of their deeds and they are in high positions, in peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth, nor your children that bring you nearer to Us, but only he who believes, and does righteous deeds; as for such, there will be multiple rewards for what they did, and they will reside in the high dwellings (Paradise) in peace and security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not your wealth nor your children, are the things which bring you near Us in station, but whoever believes and does good, these it is for whom is a double reward for what they do, and they shall be secure in the highest places.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth nor your children that shall bring you nigh in nearness to Us, except for him who believes, and does righteousness; those -- there awaits them the double recompense for that they did, and they shall be in the lofty chambers in security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth nor your children that will bring you near unto Us, but he who believeth and doeth good (he draweth near). As for such, theirs will be twofold reward for what they did and they will dwell secure in lofty halls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth or your children that will confer on you nearness to Us. It is those who believe and act righteously who will be doubly rewarded for their good deeds, and will dwell in peace in the high pavilions [of paradise],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your riches nor your children that shall draw you nigh Unto us with a near approach, but whoso ever believeth and worketh righteously- then those! theirs shall be a twofold meed for that which they will have worked, and they will be in upper apartments secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth, nor your children, that will bring you close to Us in nearness, excepting those who have faith and act righteously. It is they for whom there will be a twofold reward for what they did, and they will be secure in lofty abodes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth nor your sons, that will bring you nearer to Us in degree: but only those who believe and work righteousness - these are the ones for whom there is a multiplied Reward for their deeds, while secure they (reside) in the dwellings on high!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth, nor your children that bring you nearer to Us (i.e. pleases Allah), but only he (will please Us) who believes (in the Islamic Monotheism), and does righteous deeds; as for such, there will be twofold reward for what they did, and they will reside in the high dwellings (Paradise) in peace and security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither your riches nor your children that shall bring you close in nearness to Us, except he who believes and does good work. For those their awaits a double recompense for their deeds, they shall live in safety in their lofty chambers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither your wealth nor your children that bring you closer to Us, but it is he who believes and does good deeds. These will have a double reward for what they did; and they will reside in the Chambers, in peace and security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth or your children that bring you nearer to Us in position, but it is [by being] one who has believed and done righteousness. For them there will be the double reward for what they did, and they will be in the upper chambers [of Paradise], safe [and secure].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:37] Nor is it your wealth or your children that will bring you near to Us in closeness, except for, but [it is], those who believe and act righteously: those, they shall have a twofold reward for what they did, in other words, [they shall have it] as the reward of their action — as a good deed, for example, is rewarded tenfold or more — and they shall be in the lofty abodes, of Paradise, secure, from death and otherwise (a variant reading [for al-ghurufāt] is al-ghurfa [the generic noun] implying a plural).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "487 (And it is not your wealth) the abundance of your wealth, people of Mecca, (nor your children) nor the abundance of your children (that will bring you near unto Us) that will make your rank closer to Allah, (but he who believeth) in Allah, but it is the faith of he who believes in Allah (and doeth good) between him and his Lord that bring one close to Allah. (As for such, theirs will be twofold reward for what they did) as believers, (and they will dwell secure in lofty halls) secure from death and evanescence.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِٱلَّتِي تُقَرِّبُكُمْ عِندَنَا زُلْفَىٰ } معناه قُربى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تقريعاً على المفتخرين بالأموال والأولاد: { وَمَآ أَمْوَالُكُمْ وَلاَ أَوْلاَدُكُمْ } أيها المغرورون بهما، المحرومون عن اللذات الأخروية بسببهما، إلا وسيلة وواسطة { بِٱلَّتِي } أي: بالخلصة الحسنة التي { تُقَرِّبُكُمْ } أيها المأمورون بالتقرب إلينا بالأعمال المقبولة { عِندَنَا زُلْفَىٰ } أي: تقريباً مطلوباً لكم، مصلحاً لأحوالكم وأعمالكم ومواجيدكم { إِلاَّ مَنْ آمَنَ } منكم أيها المتمولون المتكثرون للأولاد، وأيقن بتوحيده سبحانه وصدق رسله وكتبه { وَعَمِلَ } عملاً { صَالِحاً } مقبولاً عند الله، متقرباً إليه سبحانه، بأن أنفق ماله في سبيل الله طلباً لمرضاته، وعلَّم أولاده علم التوحيد والأحكام والعقائد المتعلقة بدين الإسلام { فَأُوْلَـٰئِكَ } السعداء المقبولون عند الله، المبسوطون من عنده بالرزق الصوري في هذه النشأة { لَهُمْ } في النشأة الأخرى { جَزَآءُ ٱلضِّعْفِ بِمَا عَمِلُواْ } أي: جزاؤهم من الرزق المعنوي أضعاف ما استحقوا بأعمالهم إلى العشرة، بل إلى ما شاء الله من الكثرة، بل { وَهُمْ فِي ٱلْغُرُفَاتِ } المعدة لأهل الجنة في الجنة { آمِنُونَ } [سبأ: 37] مصونون عن جميع المؤذيات والمكروهات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جمع التكسير يُذكّر ويؤنث للعقلاء وغيرهم، ولذلك قال: { بالتي }\n و { زلفى }: مفعول مطلق، أي: وما جماعة أموالكم ولا جماعة أولادكم، و { إلا من آمن }: مستثنى من الكاف في \" تُقربكم \" ، متصل، وقيل: منقطع\n و { من }: شرط، جوابه: { فأولئك }\n وعلى الاتصال فـ \" مَن \" منصوبة بتُقرب\n يقول الحق جلّ جلاله: { وما أموالُكم ولا أولادُكم بالتي تٌقربكم عندنا زلفى } أي: قُربة، { إِلا مَن آمن وعمل صالحاً } يعني أن الآمال لا تُقرب أحداً إلا المؤمن الصالح، الذي يُنفقها في سبيل الله\n والأولاد لا تُقرب أحداً من الله إلا مَن علَّمهم الخير، وفقَّههم في الدين، وأرشدهم للصلاح والطاعة، فإنَّ علمهم يجري عليه بعد موته لقوله صلى الله عليه وسلم:\n\n \" إذا مات ابن آدم انقطع عملُهُ إلا من ثلاثٍ: صدقةٍ جاريةٍ، وعلمٍ بثه في صدور الرجال، وولدٍ صالح يدعو له بعد موته \"\n \n",
      "translations": []
    }
  ]
}