{
  "chapter": "سبإ",
  "text": "قال الذين استكبروا۟ للذين استضعفوا۟ انحن صددنكم عن الهدى بعد اذ جاءكم بل كنتم مجرمين",
  "translations": [
    {
      "translation": "Those deemed great will say to those deemed weak, 'Did we debar you from the guidance when it came to you? No, it is you who were evildoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The arrogant will say to the weak: \"Did we hold you back from guidance after it had come to you? Certainly not. In fact you were yourselves guilty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The arrogant ones will retort to those who were suppressed: “What! Did we bar you from the guidance after it came to you? Not at all; rather you yourselves were evil-doers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The suppressing ones will say to the oppressed ones, \"Did we prevent you from having guidance after it had come to you? In fact, you yourselves were criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were conceited will say to those who were subdued, “Did we stop you from the guidance after it came to you? In fact you yourselves were guilty!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were arrogant will say to those who were deemed weak: \"Did we keep you back from guidance after it had come to you Nay, but you were criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were proud shall say to those who were deemed weak: Did we turn you away from the guidance after it had come to you? Nay, you (yourselves) were guilty\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that waxed proud will say to those that were abased, 'What, did we bar you from the guidance after it came to you? Nay, rather you were sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were proud say unto those who were despised: Did we drive you away from the guidance after it had come unto you? Nay, but ye were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The haughty ones will then reply to the weak ones, \"Did we keep you away from the guidance when it came to you? Indeed not. You yourselves were the guilty ones.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were stiff-necked will say Unto those who were deemed weak: was it we who prevented you from the guidance after it had come Unto you? Aye! ye have been guilty yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were arrogant will say to those who were abased, ‘Did we keep you from guidance after it had come to you? No, you were guilty [yourselves].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The arrogant ones will say to those who had been despised: \"Was it we who kept you back from Guidance after it reached you? Nay, rather, it was ye who transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were arrogant will say to those who were deemed weak: \"Did we keep you back from guidance after it had come to you? Nay, but you were Mujrimun (polytheists, sinners, criminals, disobedient to Allah, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, those who were proud will say to those who were abased, 'Was it we who barred you from the Guidance after it had come to you? No, you yourselves were sinners'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were arrogant will say to those who were oppressed, “Was it us who turned you away from guidance when it came to you? No indeed, you yourselves were sinful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were arrogant will say to those who were oppressed, \"Did we avert you from guidance after it had come to you? Rather, you were criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:32] Those who were arrogant will say to those who were oppressed, ‘Was it us who barred you from guidance after it had come to you?, Nay! Rather you were guilty’, of your own accord.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who were proud) too proud to accept faith, i.e. the leader, (say unto those who were despised) those who were oppressed, i.e. the lowly people: (Did we drive you away) did we bar you (from the guidance) from faith (after it had come unto you) after it came to you from Muhammad (pbuh)? (Nay, but ye were guilty) you were idolaters before the coming of Muhammad to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم { قَالَ ٱلَّذِينَ ٱسْتَكْبَرُواْ } أي: المتبوعون المتعظمون بعز الرئاسة والثورة والسيادة { لِلَّذِينَ ٱسْتُضْعِفُوۤاْ } أي: الأتباع السفلة: { أَنَحْنُ صَدَدنَاكُمْ عَنِ ٱلْهُدَىٰ } أي: لم نكن صادِّين\n صارفين لكم عن الإيمان بالرسل والكتب { بَعْدَ إِذْ جَآءَكُمْ } الرسل بالكتب المشتملة على الهدى والبينات\n وعودم إلى الإيمان\n ونحن ما صددنا إلا نفوسنا بلا تغرير وتضعيف منا إياكم { بَلْ كُنتُمْ } حينئذ { مُّجْرِمِينَ } [سبأ: 32] تاركين الإيمان والهداية تقليداً علينا لا صد منَّا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال الذين استكبروا للذين استُضْعِفوا أَنحنُ صَدَدْناكم } رددناكم { عن الهُدى بعد إِذ جاءكم بل كنتم مجرمين } أي: بل أنتم صددتم باختباركم\n ولم نقهركم على الكفر\n أنكروا أنهم كانوا صادّين لهم عن الإيمان\n وأثبتوا أنهم هم الذين صدُّوا أنفسهم\n حيث أعرضوا عن الهدى\n وآثروا التقليد عليه\n وإنما وقعت \" إذ \" مضافاً إليها\n وإن كانت \" إذ \" و \" إذا \" من الظروف اللازمة للظرفية لأنه قد اتّسع في الزمان ما لم يتَسع في غيره\n { وقال الذين استُضعفوا للذين استكبروا بل مكرُ الليلِ والنهارِ } أي: بل مكركم بنا بالليل والنهار هو الذي صدّنا عن الهدى\n أو: مَكَرَ بنا الليل والنهار\n وطولُ السلامة\n حتى ظننا أنكم على حق فقلدناكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:87",
      "similarity": 0.4379228644861817
    },
    {
      "verse": "4:167",
      "similarity": 0.42800150271022214
    },
    {
      "verse": "43:37",
      "similarity": 0.41823392031496215
    },
    {
      "verse": "47:1",
      "similarity": 0.37921054974286716
    },
    {
      "verse": "7:75",
      "similarity": 0.37753222541162046
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}