{
  "chapter": "سبإ",
  "text": "قل ان ربى يبسط الرزق لمن يشاء من عباده ويقدر له وما انفقتم من شىء فهو يخلفه وهو خير الرزقين",
  "translations": [
    {
      "translation": "Say: 'My Lord expands the provision of any of His slaves He wills or restricts it. But anything you expend will be replaced by Him. He is the Best of Providers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Verily my Lord increases or restricts the provision of any of His creatures as He will, and repays whatsoever you spend. He is the best of all providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (O Prophet): “Verily, my Lord grants provision abundantly to whomsoever He pleases and straitens it for whomsoever He pleases. Whatever you spend, He will replace it. He is the Best of all Providers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is my Lord who determines and increases the sustenance of whomever He wants. He will replace whatever you spend for His cause and He is the best Sustainer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Indeed my Lord eases the sustenance for whomever He wills among His bondmen, and restricts it for whomever He wills; and whatever you spend in Allah's cause, He will restore it; and He is the Best Sustainer.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Truly, my Lord expands the provision for whom He wills of His servants, and (also) restricts (it) for him, and whatsoever you spend of anything, He will replace it.\" And He is the Best of those who make provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Surely my Lord amplifies the means of subsistence for whom He pleases of His servants and straitens (them) for whom (He pleases), and whatever thing you spend, He exceeds it in reward, and He is the best of Sustainers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My Lord outspreads and straitens His provision to whomsoever He will of His servants; and whatever thing you shall expend, He will replace it. He is the best of providers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Lo! my Lord enlargeth the provision for whom He will of His bondmen, and narroweth (it) for him. And whatsoever ye spend (for good) He replaceth it. And He is the Best of Providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"It is my Lord who increases the provision for such of His servants as He pleases, and decreases it for such of them as He pleases. Whatever you spend, He will recompense you for it. He is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: verily my Lord expandeth the provision for whomsoever He listeth of His bondmen, and stinteth it for him. And whatsoever ye expend of aught He shall replace it. And He is the Best of Providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Indeed my Lord expands the provision for whomever of His servants that He wishes and tightens it, and He will repay whatever you may spend, and He is the best of providers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Verily my Lord enlarges and restricts the Sustenance to such of his servants as He pleases: and nothing do ye spend in the least (in His cause) but He replaces it: for He is the Best of those who grant Sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Truly, my Lord enlarges the provision for whom He wills of His slaves, and (also) restricts (it) for him, and whatsoever you spend of anything (in Allah's Cause), He will replace it. And He is the Best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My Lord outspreads and withholds His provision to whomsoever He will of His worshipers. Whatsoever you expend He will replace it. He is the Best of providers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “My Lord extends the provision to whomever He wills of His servants, or withholds it. Anything you spend, He will replace it. He is the Best of providers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Indeed, my Lord extends provision for whom He wills of His servants and restricts [it] for him. But whatever thing you spend [in His cause] - He will compensate it; and He is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:39] Say: ‘My Lord extends provision, He makes it abundant, for whomever He will of His servants, as a test, and restricts [it] for him, after having extended it — or [He restricts it] for him whom He will to try, and whatever thing you may expend, for [the cause of] good, He will replace it. And He is the best of providers’. It is said that every man ‘provides for’ his dependants (yarzuqu ‘ā’ilatahu), meaning that [he does so] from   the provision given [to him] by God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ إِنَّ رَبِّي يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يُخْلِفُهُ وَهُوَ خَيْرُ الرَّازِقِينَ (39)أتبع إبطال أن تكون الأموال والأولاد بذاتهما وسيلة قرب لدى الله تعالى ردّاً على مزاعم المشركين بما يشبه معنى الاستدراك على ذلك الإِبطال من إثبات انتفاع بالمال للتقرب إلى رضَى الله إن استعمل في طلب مرضاة الله تفضيلاً لما أشير إليه إجمالاً من أن ذلك قد يكون فيه قربة إلى الله بقوله : { إلا من آمن وعمل صالحاً } \\[ سبأ : 37 \\] كما تقدم .وقوله : { قل إن ربي يبسط الرزق لمن يشاء من عباده ويقدر له } تقدم نظيره قريباً تأكيداً لذلك وليبنَى عليه قوله : { وما أنفقتم من شيء } الآية . فالذي تقدم ردٌّ على المشركين ، والمذكور هنا ترغيب للمؤمنين ، والعبارات واحدة والمقاصد مختلفة . وهذا من وجوه الإِعجاز أن يكون الكلام الواحد صالحاً لغرضين وأن يتوجه إلى طائفتين .ولما كان هذا الثاني موجهاً إلى المؤمنين أشير إلى تشريفهم بزيادة قوله : { من عباده } أي المؤمنين ، وضمير { له } عائد إلى { من } ، أي ويقدر لمن يشاء من عباده . ومفعول { يقدر } محذوف دلّ عليه مفعول { يبسط } .وكان ما تقدم حديثاً عن بسط الرزق لغير المؤمنين فلم ينعموا بوصف { من عباده } لأن في الإِضافة تشريفاً للمؤمنين ، وفي هذا امتنان على الذين يبسط عليهم الرزق بأن جمع الله لهم فضل الإِيمان وفضل سعة الرزق ، وتسلية للذين قدر عليهم رزقهم بأنهم نالوا فضل الإِيمان وفضل الصبر على ضيق الحياة .وفي تعليق { له } ب { يقْدر } إيماء إلى أن ذلك القَدْر لا يخلو من فائدة للمقدور عليه رزقُه ، وهي فائدة الثواب على الرضى من قسم له والسلامة من الحساب عليه يوم القيامة . وفي الحديث « ما من مصيبة تصيب المؤمن إلا كُفِّر بها عنه حتى الشوكةُ يُشاكُها » .ولولا هذا الإِيماء لقيل : ويقدر عليه ، كما قال : { ومن قدر عليه رزقه فلينفق مما آتاه اللَّه } \\[ الطلاق : 7 \\] . وأما حال الكافرين فإنهم ينعم على بعضهم برزق يحاسبون عليه أشد الحساب يوم القيامة إذ لم يشكروا رازقهم ، ويُقدر على بعضهم فلا يناله إلا الشقاء . وهذا توطئة لقوله : { وما أنفقتم من شيء فهو يخلفه } حثاً على الإِنفاق . والمراد الإِنفاق فيما أذن فيه الشرع .وهذا تعليم للمسلمين بأن نعيم الآخرة لا ينافي نعيم الدنيا ، قال تعالى : { ومنهم من يقول ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار أولئك لهم نصيب مما كسبوا } \\[ البقرة : 201 ، 202 \\] . فأما نعيم الدنيا فهو مسبب عن أحوال دنيوية رتبها الله تعالى ويسّرها لمن يسّرها في علمه بغيبه ، وأما نعيم الآخرة فهو مسبب عن أعمال مبينة في الشريعة وكثير من الصالحين يحصل لهم النعيم في الدنيا مع العلم بأنهم منعَّمون في الآخرة كما أنعم على داود وسليمان وعلى كثير من أصحاب محمد صلى الله عليه وسلم وكثير من أيمة الدين مثل مالك بن أنس والشافعي والشيخ عبد الله بن أبي زيد وسحنون .فأما اختيار الله لنبيئه محمد صلى الله عليه وسلم حالة الزهادة في الدنيا فلتحصل له غايات الكمال من التمحّض لتلقي الوحي وجميل الخصال ومن مساواة جمهور أصحابه في أحوالهم ، وقد بسطناه بياناً في رسالة طعام رسول الله عليه السلام . وأعقب ذلك بترغيب الأغنياء في الإِنفاق في سبيل الله فجعل الوعد بإخلاف ما ينفقه المرء كناية عن الترغيب في الإِنفاق لأن وعد الله بإِخلافه معَ تأكيد الوعد يقتضي أنه يحب ذلك من المنفقين .وأكد ذلك الوعد بصيغة الشرط وبجعل جملة الجواب اسمية وبتقديم المسند إليه على الخبر الفعلي بقوله : { فهو يخلفه } ، ففي هذا الوعد ثلاثة مؤكدات دالة على مزيد العناية بتحقيقه لينتقل من ذلك إلى الكناية عن كونه مرغوبه تعالى .و { من شيء } بيان لما في { ما } من العموم ، وجملة { وهو خير الرازقين } تذييل للترغيب والوعد بزيادة ، لبيان أن ما يخلفه أفضل مما أنفقه المنفق . { خير } بمعنى أخير لأن الرزق الواصل من غيره تعالى إنما هو من فضله أجراه على يد بعض مخلوقاته فإذا كان تيسيره برضى من الله على المرزوق ووعد به كان ذلك أخلق بالبركة والدوام ، وظاهر الآية أن إخلاف الرزق يقع في الدنيا وفي الآخرة .والمراد بالإِنفاق : الإِنفاق المرغب فيه في الدين كالإِنفاق على الفقراء والإِنفاق في سبيل الله بنصر الدين . رَوى مالك عن النبي صلى الله عليه وسلم أنه قال : \" يقول الله تعالى : يا بن آدم أَنفق أُنفق عليك \" . قال ابن العربي : قد يعوّض مثله أو أزيد ، وقد يعوض ثواباً ، وقد يدخر له وهو كالدعاء في وعد الإِجابة» ا ه . قلت : وقد يعوّض صحة وقد يعوّض تعميراً . ولله في خلقه أسرار .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Lo! my Lord enlargeth the provision for whom He will of His bondmen) as a lure to perdition, (and narroweth (it) for him) out of care for him. (And whatsoever ye spend (for good)) in the way of Allah (He replaceth it) in the life of this world with wealth and in the Hereafter with rewards. (And He is the Best of Providers) He is the Best Giver and the Best Replacer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَقْدِرُ } معناه وَيقْدِرُ من قولهِ:\n\n[الطلاق: 7]\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He is Able,\" - His saying that He is Able, from His saying:\n\n\nDivorce: 7",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل للمسرفين المنحرفين عن جادة العدالة الإلهية\n متكئين بما عندهم من الأموال والأولاد الفانية الزائلة\n مفتخرين بها تفوقاً وتبجحاً: { إِنَّ رَبِّي } العليم\n المطلع على جميع استعدادات العباد\n الحكيم في إفاضة ما يليق لهم { يَبْسُطُ } يزيد ويفيض { ٱلرِّزْقَ } الصوري { لِمَن يَشَآءُ مِنْ عِبَادِهِ } تارة على مقتضى مشيئته ومراده { وَيَقْدِرُ لَهُ } أي: ينقص ويقبض الرزق عنه مرة أخرى إرادةً واختياراً على مقتضى حكمته ومصلحته التي استأثر الله بها في غيبه وحضرة علمه { وَ } بعدما سمعتم هذا اعلما أيها المبسوطون المنعمون { مَآ أَنفَقْتُمْ مِّن شَيْءٍ } استخلفكم الله سبحانه عليه من الرزق\n وأمركم بإنفاقه على فقرائه { فَهُوَ } سبحانه { يُخْلِفُهُ } ويعوض عنه بأضعافه وآلافه\n إن صدر عنكم الإنفاق بالاعتدال بلا تبذير وتقتير { وَ } كيف لا يخلف سبحانه الرزق الصوري لخلَّص عباده مع أنه { هُوَ } سبحانه { خَيْرُ ٱلرَّازِقِينَ } [سبأ: 39] بالرزق الصوري المعنوي\n المخلص لهم عن مقتضيات بشريتهم ومشتيهات أهويتهم البهيمية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { قل إِن ربي يبسط الرزق لمن يشاء من عباده ويقدر له } إنما كرره تزهيداً في المال، وحضًّا على إنفاقه في سبيل الله. ولذلك عقبه بقوله: { وما أنفقتم من شيءٍ فهو يُخلفه } إما عاجلاً في الدنيا إذا شاء، أو آجلاً في الآخرة، ما لم يكن إسرافاً، كنزهة لهو، أو في بنيان، أو معصية. وذكر الكواشي هنا أحاديث منها:\n \" كُلُّ معروفٍ صدقةً، وكل ما أنفق الرجلُ على نفسِه وأهلِه صدقةٌ، وما وَقَى به الرجلُ عِرْضَهُ كُتِبت له بها صدقةً ـ وهو ما أعطى لشاعر، أو لذي اللسان المتَّقَى ـ وما أنفق المؤمنُ صدقة فعلى الله خلفها ضامناً، إلا ما كان من نفقةٍ في بُنيانٍ أو معصيةٍ \" \nقلتُ: يُقيد النفقة في البنيان بما زاد على الحاجة والضرورة، وإلا فهو مأمور به، فيؤجر عليه. والله تعالى أعلم. { وهو خيرُ الرازقين } المطعمين لأن كل مَن رزق غيره من سلطان، أو سيّد، أو زوج، أو غيره، فهو من رزق الله، أجراه على يد هؤلاء، وهو خالقُ الرزق، والأسباب التي بها ينتفع المرزوق بالرزق. وعن بعضهم قال: الحمد لله الذي أوجده، وجعلني ممن يشتهي، فكم من مشتَهٍ لا يجد، وواجد لا يشتهي!. الإشارة: في الآية إشارة إلى منقبة السخاء، وإطلاق اليد بالعطاء، وهو من علامة اليقين، وخروج الدنيا من القلب. وذكر الترمذي الحكيم حديثاً طويلاً عن الزبير رضي الله عنه رأيت أن أذكره لكثرة فوائده مع مناسبته لهذا المعنى. قال: جئتُ حتى جلستُ بين يدي رسول الله صلى الله عليه وسلم فأخذ بطرف عمامتي من ورائي، ثم قال:\n \" يا زبير إني رسول الله إليك خاصة، وإلى الناس عامة. أتدرون ما قال ربكم؟ قلت: الله ورسوله أعلم. قال: قال ربكم حين استوى على عرشه ونظر إلى خلقه: عبادي أنتم خلقي وأنا ربكم، أرزاقكم بيدي، فلا تتعبوا فيما تكفلتُ لكم به، فاطلبوا مني أرزاقكم، وإليّ فارفعوا حوائجكم، انصُبُوا إليَّ أنفسَكم أصُبُّ عليكم أرزاقكم. أتدرون ما قال ربكم؟ قال الله تبارك وتعالى: يا ابن آدم أَنفق أُنفق عليك، وأوسع أُوسع عليك، ولا تضيق فأضيق عليك، ولا تَصُرّ فأصر عليك، ولا تخزُنُ فأخزنُ عليك، إن باب الرزق مفتوح من فوق سبع سماوات، متواصل إلى العرش، لا يغلق ليلاً ولا نهاراً، ينزل الله منه الرزق، على كل امرىء بقدر نيته، وعطيته، وصدقته، ونفقته، مَنْ أكثر أكثر عليه، ومَنْ أقل أقل عليه، ومَنْ أمسك أمسك عليه. يا زبير فكُل وأَطعم، ولا تُوك فيُوك عليك، ولا تحْصِ فيُحصَ عليك، ولا تقترّ فيقترْ عليك، ولا تعسر فيعسرْ عليك. يا زبير، إن الله يحب الإنفاق، ويبغض الإقتار، وإن السخاء من اليقين، والبخل من الشك، فلا يدخل النار مَن أيقن، ولا يدخل الجنة مَن شك. يا زبير إن الله يُحب السخاوة، ولو بفلق تمرة، والشجاعة، ولو بقتل عقرب أو حية. يا زبير إن الله يُحب الصبر عند زلزلة الزلازل، واليقين النفاذ عند مجيء الشهوات، والعقل الكامل عند نزول الشبهات. والورع الصادق عند الحرام والخبيثات. يا زبير عظِّم الإخوان، وأجلّ الأبرار، ووقر الأخيار، وصل الجار، ولا تماشِ الفجار، تدخل الجنة بلا حساب ولا عقاب، هذه وصية الله إليّ، ووصيتي إليك \". \nثم ذكر توبيخه على الشرك فقال: { وَيَوْمَ يَحْشُرُهُمْ جَمِيعاً ثُمَّ... }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:62",
      "similarity": 0.8020250850242915
    },
    {
      "verse": "39:52",
      "similarity": 0.731577207807053
    },
    {
      "verse": "34:36",
      "similarity": 0.7266721942858636
    },
    {
      "verse": "30:37",
      "similarity": 0.7234458859501336
    },
    {
      "verse": "17:30",
      "similarity": 0.7164999697382521
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}