{
  "chapter": "سبإ",
  "text": "وما ارسلنا فى قرية من نذير الا قال مترفوها انا بما ارسلتم به كفرون",
  "translations": [
    {
      "translation": "We never sent a warner into any city without the affluent people in it saying, 'We reject what you have been sent with.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never sent an admonisher to a habitation but its well-to-do people said: \"We do not believe in what you have brought.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never sent a warner to any town but its wealthy ones said: “We disbelieve in the Message you have brought.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time We sent a warner to a town, the rich ones therein said (to Our Messenger), \"We have no faith in what you have brought (to us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever We sent a Herald of Warning to any town, its wealthy people said, “We disbelieve in what you have been sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send a warner to a township but those who were given the worldly wealth and luxuries among them said: \"We believe not in what you have been sent with.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We never sent a warner to a town but those who led lives in ease in it said: We are surely disbelievers in what you are sent with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent no warner into any city except its men who lived at ease said, 'We disbelieve in the Message you have been sent with.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not unto any township a warner, but its pampered ones declared: Lo! we are disbelievers in that wherewith ye have been sent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For it has been thus whenever We sent a warner to any community. Its affluent ones said, \"We reject what you have been sent with.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not a warner Unto a town but the affluent thereof said:' verily in that wherewith ye have been sent we are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send a warner to any town without its affluent ones saying, ‘We indeed disbelieve in what you have been sent with.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did We send a warner to a population, but the wealthy ones among them said: \"We believe not in the (Message) with which ye have been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send a warner to a township, but those who were given the worldly wealth and luxuries among them said: \"We believe not in the (Message) with which you have been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never sent a warner to a village except that those (who lived) in luxury said: 'We disbelieve in the Message you have been sent with'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent no warner to any town, without its affluent saying, “We reject what you are sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send into a city any warner except that its affluent said, \"Indeed we, in that with which you were sent, are disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:34] And We did not send a warner to any town without its affluent ones, its leaders, those enjoying [life’s] comforts, saying, ‘Indeed we disbelieve in that [Message] with which you have been sent’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We sent not unto any township) to the inhabitants of any township (a warner) a warning Messenger, (but its pampered ones) its tyrants and despots (declared: Lo! we are disbelievers in that which ye bring unto us) we deny what you brought us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ قَالَ مُتْرَفُوهَآ } معناه متكبِرُوهَا من الكُفَّارِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نأخذهم بشؤم أعمالهم وأفعالهم؛ إذ { مَآ أَرْسَلْنَا فِي قَرْيَةٍ } من القرى الهالكة { مِّن نَّذِيرٍ } من النذر المبعوثين لإصلاح مفسادهم { إِلاَّ قَالَ مُتْرَفُوهَآ } أي: متنعموها، للرسل من فرط عتوهم وعنادهم، اتكاءً على ما عندهم من الجاه والثروة على سبيل التأكيد والمبالغة: { إِنَّا بِمَآ أُرْسِلْتُمْ بِهِ } أي: بجميع ما أرسلتم أيها المدعون للرسالة والهداية والدعوة العامة، وإقامة الحدود بين الأنام { كَافِرُونَ } [سبأ: 34] جاحدون منكرون، لا نقبل منكم أمثال هذه الخرافات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:45",
      "similarity": 0.8558269468339655
    },
    {
      "verse": "23:33",
      "similarity": 0.6457815932003955
    },
    {
      "verse": "17:16",
      "similarity": 0.5946179139919189
    },
    {
      "verse": "11:116",
      "similarity": 0.524418003476488
    },
    {
      "verse": "23:64",
      "similarity": 0.3935830213370275
    }
  ]
}