{
  "chapter": "سبإ",
  "text": "وقال الذين كفروا۟ لا تاتينا الساعة قل بلى وربى لتاتينكم علم الغيب لا يعزب عنه مثقال ذرة فى السموت ولا فى الارض ولا اصغر من ذلك ولا اكبر الا فى كتب مبين",
  "translations": [
    {
      "translation": "Those who are kafir say, 'The Hour will never come.' Say: 'Yes, by my Lord, it certainly will come!' He is the Knower of the Unseen, Whom not even the weight of the smallest particle eludes, either in the heavens or in the earth; nor is there anything smaller or larger than that which is not in a Clear Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: \"There is no coming of the Hour for us.\" Say: \"Why not? By my Lord, the knower of the unknown, it will certainly come for you. Not even an atom's weight in the heavens and the earth, or something smaller or greater than it, is hidden from Him, and which is not recorded in the all-too-manifest Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: “How come the Hour is not coming upon us!” Say to them: “Yes indeed, by my Lord, by Him Who fully knows the realm beyond the ken of perception, that the Hour shall inevitably come upon you. Nothing escapes Him, not even the smallest particle in the heavens or the earth; nor is anything smaller or bigger than that but is in a Manifest Book.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers have said, \"There will be no Hour of Doom.\" Say, \"By my Lord, it certainly will come. My Lord knows the unseen. Not even an atom's weight in the heavens or the earth remains hidden from Him. Nothing exists greater or smaller than this without its record in the illustrious Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “The Last Day will never come upon us”; proclaim, “Surely yes, why not? By oath of my Lord, it will surely come upon you – the All Knowing of the hidden; nothing is hidden from Him – equal to an atom or less than it or greater – in the heavens or in the earth, but it is in a clear Book.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"The Hour will not come to us.\" Say: \"Yes, by my Lord, the All-Knower of the Unseen, it will come to you; not even the weight of a speck of dust or less than that or greater escapes His knowledge in the heavens or in the earth but it is in a Clear Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: The hour shall not come upon us. Say: Yea! by my Lord, the Knower of the unseen, it shall certainly come upon you; not the weight of an atom becomes absent from Him, in the heavens or in the earth, and neither less than that nor greater, but (all) is in a clear book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'The Hour will never come to us.' Say: 'Yes indeed, by my Lord, it shall come to you, by Him who knows the Unseen; not so much as the weight of an ant in heaven and earth escapes from Him, neither is aught smaller than that, or greater, but it is in a Manifest Book;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: The Hour will never come unto us. Say: Nay, by my Lord, but it is coming unto you surely. (He is) the Knower of the Unseen. Not an atom's weight, or less than that or greater, escapeth Him in the heavens or in the earth, but it is in a clear Record,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth declare, \"The Hour will never come upon us.\" Say, \"Yes, by my Lord, it will surely come upon you! Who knows the unseen. Not the smallest particle in the heavens or the earth, or anything less or greater than that escapes Him; all is recorded in an open Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: the Hour will not come Unto us. Say thou: yea, by my Lord the Knower of the unseen, it will surely come Unto you. Not the weight of an atom escapeth Him in the heavens or in the earth; nor is there anything less than it nor greater but it is inscribed in a Luminous Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘The Hour will not overtake us.’ Say, ‘Yes, indeed it will surely overtake you, by my Lord,’ the Knower of the Unseen; not [even] an atom’s weight escapes Him in the heavens or in the earth, nor [is there] anything smaller than that nor bigger, but it is in a manifest Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say, \"Never to us will come the Hour\": Say, \"Nay! but most surely, by my Lord, it will come upon you;- by Him Who knows the unseen,- from Whom is not hidden the least little atom in the heavens or on earth: Nor is there anything less than that, or greater, but is in the Record Perspicuous:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"The Hour will not come to us.\" Say: \"Yes, by my Lord, it will come to you.\" (Allah, He is) the AllKnower of the unseen, not even the weight of an atom (or a small ant) or less than that or greater, escapes from His Knowledge in the heavens or in the earth, but it is in a Clear Book (AlLauh AlMahfuz).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: 'The Hour will never come to us' Say: 'By my Lord, yes, it is surely coming to you! By Him who knows the Unseen, not even the weight of an atom in heavens and earth escapes Him; neither is there anything smaller than that, nor greater except that it is in a Clear Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “The Hour will not come upon us.” Say, “Yes indeed, by my Lord, it will come upon you. He is the Knower of the unseen.” Not an atom's weight in the heavens and the earth, or anything smaller or larger, escapes His knowledge. All are in a Clear Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve say, \"The Hour will not come to us.\" Say, \"Yes, by my Lord, it will surely come to you. [Allah is] the Knower of the unseen.\" Not absent from Him is an atom's weight within the heavens or within the earth or [what is] smaller than that or greater, except that it is in a clear register -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:3] And those who disbelieve say, ‘The Hour, the Resurrection, will never come to us’. Say, to them: ‘Yes indeed, by my Lord, it shall come to you — [by] the Knower of the Unseen (read ‘ālimi’l-ghaybi as an adjectival qualification [of wa-rabbī, ‘by my Lord’], or read ‘ālimu’l-ghaybi, as the predicate of a [missing] subject [such as huwa, ‘He is’]; or read ‘allāmi’l-ghaybi). Not [even] the weight of an atom escapes, is hidden [from], Him in the heavens or in the earth, nor [is there] anything smaller than that or greater, but it is in a Manifest Book, namely, the Preserved Tablet (al-lawh al-mahfūz),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) the disbelievers of Mecca: Abu Jahl and his host (say: The Hour will never come unto us. Say) to them, Muhammad: (Nay, by my Lord) Allah swore by Himself, (but it is coming) the Hour is coming (unto you surely. (He is) the Knower of the Unseen) He knows what is hidden from people. (Not an atom's weight) not even a small red ant, (or less than that or greater, escapes Him) is hidden from Allah (in the heavens or in the earth) as regard the works of the servants, (but it is in a clear Record) in the Guarded Tablet well preserved,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَعْزُبُ عَنْهُ } معناه لاَ يَغيبُ عَنهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أخبر سبحانه بقيام الساعة في كتبه وعلى ألسنة رسله، سيما في كتابك يا أكمل الرسل وعلى لسانك { قَالَ } الجاحدون المنكرون { ٱلَّذِينَ كَفَرُواْ } بالحق، وستروه بالباطل وكذبوا الرسل وعاندوا معهم يا أكمل الرسل، مستهزئين: { لاَ تَأْتِينَا ٱلسَّاعَةُ } الموعدة على لسانك أيها المدعي مع أنك أدعيت الصدق في جميع أخبارك وأقوالك، فكيف لا تأتي الساعة التي ادعيت إتيانها، وأخبرت بها؟! لعلك كذبت وافتريت إلى ربك { قُلْ } لهم يا أكمل الرسل بعدما استهزءوا معك، ونسبوك إلى الكذب والافتراء، وأنكروا بإتيان الساعة: { بَلَىٰ } تأتي الساعة الموعودة عليَّ وعلى حميع الرسل والأنبياء، لاشك في إتيانها وقيامها { وَ } حق { رَبِّي } القادر المقتدر على إنجاز جميع ما وعد بلا خلف { لَتَأْتِيَنَّكُمْ } الساعة الموعودة من عندهح إذ وعده سبحانه مقضي حتماً جزماً بلا شائبة شك وطريان غفلة عليه وسهو عنه، وكيف يطرأ عليه سبحانه سهو وذهول، وهو { عَالِمِ ٱلْغَيْبِ } بالعلم الحضوري، فالمغيبات حاضرة عنده غير مغيبة عنه؛ إذ { لاَ يَعْزُبُ } ولا يغيب { عَنْهُ } سبحانه وعن حيطة حضرة علمه { مِثْقَالُ ذَرَّةٍ } ومقدار خردلة لا من الكوائن { فِي ٱلسَّمَٰوَٰتِ } أي: العلويات { وَلاَ } من الكوائن { فِي ٱلأَرْضِ } أي: السفليات، ولا من المكونات الحادثة بينهما { وَلاَ أَصْغَرُ مِن ذَلِكَ } المقدار { وَلاَ أَكْبَرُ } منه { إِلاَّ } وهو مثبت { فِي كِتَابٍ مُّبِينٍ } [سبأ: 3] هو حضرة علمه ولوح قضائه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}