{
  "chapter": "سبإ",
  "text": "وما امولكم ولا اولدكم بالتى تقربكم عندنا زلفى الا من ءامن وعمل صلحا فاو۟لئك لهم جزاء الضعف بما عملوا۟ وهم فى الغرفت ءامنون",
  "translations": [
    {
      "translation": "It is not your wealth or your children that will bring you near to Us - only in the case of people who have iman and act rightly; such people will have a double recompense for what they did. They will be safe from all harm in the High Halls of Paradise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth and children that will bring you closer to Us, except those who believe and do the right. These will be given a two-fold reward for their deeds, and will dwell in peace in the high empyrean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your riches nor your children that make you near-stationed to Us, except for him who has faith and acts righteously; it is they who will receive double the recompense for their deeds. They shall live in lofty mansions in perfect peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your property and children cannot bring you closer to Us. Only those who believe and act righteously will have double reward for their deeds and will live in secure mansions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your wealth and your children are not capable of bringing you near to Us, but one who believes and did good deeds (is brought close); for them is double the reward – the recompense of their deeds and they are in high positions, in peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth, nor your children that bring you nearer to Us, but only he who believes, and does righteous deeds; as for such, there will be multiple rewards for what they did, and they will reside in the high dwellings (Paradise) in peace and security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not your wealth nor your children, are the things which bring you near Us in station, but whoever believes and does good, these it is for whom is a double reward for what they do, and they shall be secure in the highest places.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth nor your children that shall bring you nigh in nearness to Us, except for him who believes, and does righteousness; those -- there awaits them the double recompense for that they did, and they shall be in the lofty chambers in security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth nor your children that will bring you near unto Us, but he who believeth and doeth good (he draweth near). As for such, theirs will be twofold reward for what they did and they will dwell secure in lofty halls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth or your children that will confer on you nearness to Us. It is those who believe and act righteously who will be doubly rewarded for their good deeds, and will dwell in peace in the high pavilions [of paradise],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your riches nor your children that shall draw you nigh Unto us with a near approach, but whoso ever believeth and worketh righteously- then those! theirs shall be a twofold meed for that which they will have worked, and they will be in upper apartments secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth, nor your children, that will bring you close to Us in nearness, excepting those who have faith and act righteously. It is they for whom there will be a twofold reward for what they did, and they will be secure in lofty abodes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your wealth nor your sons, that will bring you nearer to Us in degree: but only those who believe and work righteousness - these are the ones for whom there is a multiplied Reward for their deeds, while secure they (reside) in the dwellings on high!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth, nor your children that bring you nearer to Us (i.e. pleases Allah), but only he (will please Us) who believes (in the Islamic Monotheism), and does righteous deeds; as for such, there will be twofold reward for what they did, and they will reside in the high dwellings (Paradise) in peace and security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither your riches nor your children that shall bring you close in nearness to Us, except he who believes and does good work. For those their awaits a double recompense for their deeds, they shall live in safety in their lofty chambers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither your wealth nor your children that bring you closer to Us, but it is he who believes and does good deeds. These will have a double reward for what they did; and they will reside in the Chambers, in peace and security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not your wealth or your children that bring you nearer to Us in position, but it is [by being] one who has believed and done righteousness. For them there will be the double reward for what they did, and they will be in the upper chambers [of Paradise], safe [and secure].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:37] Nor is it your wealth or your children that will bring you near to Us in closeness, except for, but [it is], those who believe and act righteously: those, they shall have a twofold reward for what they did, in other words, [they shall have it] as the reward of their action — as a good deed, for example, is rewarded tenfold or more — and they shall be in the lofty abodes, of Paradise, secure, from death and otherwise (a variant reading [for al-ghurufāt] is al-ghurfa [the generic noun] implying a plural).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ بِالَّتِي تُقَرِّبُكُمْ عِنْدَنَا زُلْفَى إِلَّا مَنْ آَمَنَ وَعَمِلَ صَالِحًا فَأُولَئِكَ لَهُمْ جَزَاءُ الضِّعْفِ بِمَا عَمِلُوا وَهُمْ فِي الْغُرُفَاتِ آَمِنُونَ (37)يجوز أن تكون جملة { وما أموالكم } عطفاً على جملة { قل إن ربي يبسط الرزق } \\[ سبأ : 36 \\] الخ فيكون كلاماً موجهاً من جانب الله تعالى إلى الذين قالوا : { نحن أكثر أموالاً وأولاداً } \\[ سبأ : 35 \\] فتكون ضمائر الخطاب موجهة إلى الذين قالوا : { نحن أكثر أموالاً وأولاداً } .ويجوز أن تكون عطفاً على جملة { إن ربي يبسط الرزق لمن يشاء } \\[ سبأ : 36 \\] ، فيكون مما أُمر الرسول صلى الله عليه وسلم بأن يقوله لهم ويبلغه عن الله تعالى ، ويكون في ضمير { عندنا } التفات ، وضمائر الخطاب تكون عائدة إلى الذين قالوا : { نحن أكثر أموالاً وأولاداً وما نحن بمعذبين } \\[ سبأ : 35 \\] وفيها وجه ثالث ننبه عليه قريباً .وهو ارتقاء من إبطال الملازمة إلى الاستدلال على أنهم ليسوا بمحل الرضى من الله تعالى على طريقة النقض التفصيلي المسمى بالمناقضة أيضاً في علم المناظرة . وهو مقام الانتقال من المنع إلى الاستدلال على إبطال دعوى الخصم ، فقد أبطلت الآية أن تكون أموالُهم وأولادهم مقربة عند الله تعالى ، وأنه لا يقرّب إلى الله إلا الإِيمان والعمل الصالح .وجيء بالجملة المنفية في صيغة حصر بتعريف المسند إليه والمسند ، لأن هذه الجملة أريد منها نفي قولهم : { نحن أكثر أموالاً وأولاداً وما نحن بمعذبين } أي لا أنتم ، فكان كلامهم في قوة حصر التقريب إلى الله في كثرة الأموال والأولاد فنُفي ذلك بأسره .وتكرير { لا } النافية بعد العاطف في { ولا أولادكم } لتأكيد تسلط النفي على كلا المذكورْين ليكون كل واحد مقصوداً بنفي كونه مما يقرب إلى الله وملتفتاً إليه .ولما كانت الأموال والأولاد جمعَيْ تكسير عوملا معاملة المفرد المؤنث فجيء بخبرهما اسم موصول المفرد المؤنث على تأويل جماعة الأموال وجماعة الأولاد ولم يلتفت إلى تغلب الأولاد على الأموال فيخبر عنهما معاً ب ( الذين ) ونحوه .وعدل عن أن يقال : بالتي تقربكم إلينا ، إلى { تقربكم عندنا } لأن التقريب هنا مجاز في التشريف والكرامة لا تقريب مكان .والزلفى : اسم للقرب مثل الرُّجعى وهو مفعول مطلق نائب عن المصدر ، أي تقربكم تقريباً ، ونظيره { واللَّه أنبتكم من الأرض نباتاً } \\[ نوح : 17 \\] .وقوله : { إلا من آمن وعمل صالحاً } استثناء منقطع . و { إلا } بمعنى ( لكنْ ) المخففة النون التي هي للاستدراك وما بعدها كلام مستأنف ، وذلك من استعمالات الاستثناء المنقطع؛ فإنه إذا كان ما بعد { إلا } ليس من جنس المستثنى منه كان الاستثناء منقطعاً ، ثم إن كان ما بعد { إلا } مفرداً فإن { إلا } تقدّر بمعنى ( لكنّ ) أخت ( إنّ ) عند أهل الحجاز فينصبون ما بعدها على توهم اسم ( لكنّ ) وتقدر بمعنى ( لكنْ ) المخففة العاطفة عند بني تميم فيتبع الاسم الذي بعدها إعراب الاسم الذي قبلها وذلك ما أشار إليه سيبويه في باب يختار فيه النصب من أبواب الاستثناء .فأما إن كان ما بعد { إلا } جملة اسمية أو فعلية فإن { إلا } تقدر بمعنى ( لكنْ ) المخففة وتجعل الجملة بعدُ استئنافاً ، وذلك في نحو قول العرب : «والله لأفعلن كذا إلا حِلُّ ذلك أن أفعل كذا وكذا» قال سيبويه : «فإن : أَن أفعل كذا ، بمنزلة : إلاّ فِعْل كذا ، وهو مبني على حِلّ ( أي هو خبر له ) . وحِلّ مبتدأ كأنه قال : ولكنْ حِلُّ ذلك أن أفعل كذا وكذا» ا ه .قال ابن مالك في «شرح التسهيل» : وتقرير الإِخراج في هذا أن تجعل قولهم : إلا حلُّ ذلك ، بمنزلة : لا أرى لهذا العَقد مبطِلاً إلا فِعْلَ كذا . وجعل ابن خروف من هذا القبيل قوله تعالى : { لست عليهم بمسيطر إلا من تولى وكفر فيعذبه اللَّه العذاب الأكبر } \\[ الغاشية : 22 24 \\] على أن يكون { مَن } مبتدأ و «يعذبه الله» الخبر ودخل الفاء لتضمين المبتدأ معنى الجزاء . وقال أبو يَسعود : إن { إلاّ } في الاستثناء المنقطع يكون ما بعدها كلاماً مستأنفاً ا ه .وعلى هذا فقوله تعالى هنا : { إلا من آمن وعمل صالحاً } تقديره : لكن من آمن وعمل صالحاً فأولئك لهم جزاء الضعف ، فيكون { مَن } مبتدأ مضمَّناً معنى الشرط و { لهم جزاء الضعف } جملة خبر عن المبتدأ وزيدت الفاء في الخبر لتضمين المبتدأ معنى الشرط .وأسهل من هذا أن نجعل { مَن } شرطية وجملة { فأولئك لهم جزاء الضعف } جواب الشرط ، واقترن بالفاء لأنه جملة اسمية . وهذا تحقيق لمعنى الاستثناء المنقطع وتفسير للآية بدون تكلف ولا تردد في النظم .ويجوز أن تكون جملة { وما أموالكم ولا أولادكم } الخ اعتراضاً بين جملة { قل إن ربي يبسط الرزق لمن يشاء ويقدر } \\[ سبأ : 36 \\] وجملة { قل إن ربي يبسط الرزق لمن يشاء من عباده ويقدر له } \\[ سبأ : 39 \\] وتكون ضمائر الخطاب موجهة إلى جميع الناس المخاطبين بالقرآن من مؤمنين وكافرين . وعليه فيكون قوله : { إلا من آمن وعمل صالحاً } الخ مستثنى من ضمير الخطاب ، أي ما أموالكم بالتي تقربكم إلا الذين آمنوا وعملوا الصالحات منكم ، وتكون جملة { فأولئك لهم جزاء الضعف بما عملوا } ثناء على الذين آمنوا وعملوا الصالحات .وجيء باسم الإِشارة في الإِخبار عن { من آمن } للتنويه بشأنهم والتنبيه على أنهم جديرون بما يرد بعد اسم الإِشارة من أجل تلك الأوصاف التي تقدمت اسم الإِشارة على ما تقدم في قوله تعالى : { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] وغيره . ووزان هذا المعنى وزان قوله : { لا يغرنك تقلب الذين كفروا في البلاد متاع قليل } إلى قوله : { لكن الذين اتقوا ربهم لهم جنات } \\[ آل عمران : 198 \\] الآية .و { الضِعف } المضاعف المكرر فيصدق بالمكرر مرة وأكثر . وفي الحديث \" والحسنة بعشر أمثالها إلى سبعمائة ضِعف إلى أضعاف كثيرة \" وقد أشار إليه قوله تعالى : { كمثل حبّة أنبتت سبعَ سنابل في كل سنبلة مائةُ حبة واللَّه يضاعف لمن يشاء } \\[ البقرة : 261 \\] .وإضافة { جزاء } إلى { الضعف } إضافة بيانية ، أي الجزاء الذي هو المضاعفة لأعمالهم ، أي لما تستحقه كما تقدم .وكنّي عن التقريب بمضاعفة الجزاء لأن ذلك أمارة كرامة المجزي عند الله ، أي أولئك الذين يقربون زلفى فيجزون جزاء الضعف على أعمالهم لا على وفرة أموالهم وأولادهم ، فالاستدراك ورد على جميع ما أفاده كلام المشركين من الدعوى الباطلة والفخر الكاذب لرفع توهم أن الأموال والأولاد لا تقرب إلى الله بحال ، فإن من أموال المؤمنين صدقات ونفقات ، ومن أولادهم أعواناً على البرّ ومجاهدين وداعين لآبائهم بالمغفرة والرحمة .والباء في قوله : { بما عملوا } تحتمل السببية فتكون دليلاً على ما هو المضاعف وهو ما يناسب السبب من الصالحات كقوله تعالى : { هل جزاء الإِحسان إلا الإِحسان } \\[ الرحمن : 60 \\] ، وتحتمل العوض فيكون «ما عملوا» هو المجازَى عليه كما تقول : جزيته بألف ، فلا تقدير في قوله : { جزاء الضعف } .و { الغرفات } جمع غُرفة . وتقدم في آخر الفرقان وهي البيت المعتلي وهو أجمل منظراً وأشمل مرأى . و { آمنون } خبر ثان يعني تلقي في نفوسهم الأمن من انقطاع ذلك النعيم .وقرأ الجمهور { في الغرفات } بصيغة الجمع ، وقرأ حمزة «في الغُرْفة» بالإِفراد .\n\n",
      "translations": [
        {
          "translation": "487 (And it is not your wealth) the abundance of your wealth, people of Mecca, (nor your children) nor the abundance of your children (that will bring you near unto Us) that will make your rank closer to Allah, (but he who believeth) in Allah, but it is the faith of he who believes in Allah (and doeth good) between him and his Lord that bring one close to Allah. (As for such, theirs will be twofold reward for what they did) as believers, (and they will dwell secure in lofty halls) secure from death and evanescence.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِٱلَّتِي تُقَرِّبُكُمْ عِندَنَا زُلْفَىٰ } معناه قُربى\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the one that draws you near to Us} means nearness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تقريعاً على المفتخرين بالأموال والأولاد: { وَمَآ أَمْوَالُكُمْ وَلاَ أَوْلاَدُكُمْ } أيها المغرورون بهما\n المحرومون عن اللذات الأخروية بسببهما\n إلا وسيلة وواسطة { بِٱلَّتِي } أي: بالخلصة الحسنة التي { تُقَرِّبُكُمْ } أيها المأمورون بالتقرب إلينا بالأعمال المقبولة { عِندَنَا زُلْفَىٰ } أي: تقريباً مطلوباً لكم\n مصلحاً لأحوالكم وأعمالكم ومواجيدكم { إِلاَّ مَنْ آمَنَ } منكم أيها المتمولون المتكثرون للأولاد\n وأيقن بتوحيده سبحانه وصدق رسله وكتبه { وَعَمِلَ } عملاً { صَالِحاً } مقبولاً عند الله\n متقرباً إليه سبحانه\n بأن أنفق ماله في سبيل الله طلباً لمرضاته\n وعلَّم أولاده علم التوحيد والأحكام والعقائد المتعلقة بدين الإسلام { فَأُوْلَـٰئِكَ } السعداء المقبولون عند الله\n المبسوطون من عنده بالرزق الصوري في هذه النشأة { لَهُمْ } في النشأة الأخرى { جَزَآءُ ٱلضِّعْفِ بِمَا عَمِلُواْ } أي: جزاؤهم من الرزق المعنوي أضعاف ما استحقوا بأعمالهم إلى العشرة\n بل إلى ما شاء الله من الكثرة\n بل { وَهُمْ فِي ٱلْغُرُفَاتِ } المعدة لأهل الجنة في الجنة { آمِنُونَ } [سبأ: 37] مصونون عن جميع المؤذيات والمكروهات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جمع التكسير يُذكّر ويؤنث للعقلاء وغيرهم\n ولذلك قال: { بالتي }\n و { زلفى }: مفعول مطلق\n أي: وما جماعة أموالكم ولا جماعة أولادكم\n و { إلا من آمن }: مستثنى من الكاف في \" تُقربكم \" \n متصل\n وقيل: منقطع\n و { من }: شرط\n جوابه: { فأولئك }\n وعلى الاتصال فـ \" مَن \" منصوبة بتُقرب\n يقول الحق جلّ جلاله: { وما أموالُكم ولا أولادُكم بالتي تٌقربكم عندنا زلفى } أي: قُربة\n { إِلا مَن آمن وعمل صالحاً } يعني أن الآمال لا تُقرب أحداً إلا المؤمن الصالح\n الذي يُنفقها في سبيل الله\n والأولاد لا تُقرب أحداً من الله إلا مَن علَّمهم الخير\n وفقَّههم في الدين\n وأرشدهم للصلاح والطاعة\n فإنَّ علمهم يجري عليه بعد موته لقوله صلى الله عليه وسلم:\n \" إذا مات ابن آدم انقطع عملُهُ إلا من ثلاثٍ: صدقةٍ جاريةٍ\n وعلمٍ بثه في صدور الرجال\n وولدٍ صالح يدعو له بعد موته \"\n \n{ فأولئك لهم جزاءُ الضِّعْفِ } أي: تضاعف لهم حسناتهم\n الواحدة عشراً إلى سبعمائة\n على قدر النية والإخلاص\n وهو من إضافة المصدر إلى المفعول\n والأصل: يجازون الضعفَ\n ثم جزاءٌ الضعفَ\n ثم أضيف\n وقرأ يعقوب بالنصب على التمييز\n أي: فأولئك لهم الضعف لأعمالهم جزاءُ { بما عَمِلُوا } أي: بأعمالهم { وهم في الغرفاتِ آمنون } أي: في غرفات الجنان آمنون من كل هائل وشاغل\n وقرأ حمزة: \" في الغرفة \" إرادة الجنس\n { والذين يَسْعَون في آياتنا } في إبطالها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:75",
      "similarity": 0.6687718048563203
    },
    {
      "verse": "39:20",
      "similarity": 0.578740935911166
    },
    {
      "verse": "29:58",
      "similarity": 0.567308512960637
    },
    {
      "verse": "26:64",
      "similarity": 0.40282416798792675
    },
    {
      "verse": "81:13",
      "similarity": 0.4027549422472635
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}