{
  "chapter": "سبإ",
  "text": "قل انما اعظكم بوحدة ان تقوموا۟ لله مثنى وفردى ثم تتفكروا۟ ما بصاحبكم من جنة ان هو الا نذير لكم بين يدى عذاب شديد",
  "translations": [
    {
      "translation": "Say: 'I exhort you to do one thing alone: to stand before Allah in pairs and on your own and then reflect. Your companion is not possessed. He is only a warner come to you ahead of a terrible punishment.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I urge upon you only one thing: Stand up for God two by two or one by one, and think and reflect!\" There is no madness about your companion. He is a warner against the dreadful affliction (that awaits).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, (O Prophet): “I give you but one counsel: stand up (for heaven's sake), singly and in pairs, and then think: what is it in your companion (to wit, Muhammad) that could be deemed as madness?” He is nothing but a warner, warning you before the coming of a grevious chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I advise you to believe only in One God and worship Him individually or two people together.\" Think carefully; your companion is not possessed by jinn. He is only warning you of the coming severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “I advise you just one thing; that stand up for Allah's sake, in twos and ones, and then think”; there is not a trace of insanity in this companion of yours; he is not but a Herald of Warning for you, before the advent of a severe punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I exhort you to one (thing) only, that you stand up for Allah's sake in pairs and singly, and reflect, there is no madness in your companion. He is only a warner to you in face of a severe torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I exhort you only to one thing, that rise up for Allah's sake in twos and singly, then ponder: there is no madness in your fellow-citizen; he is only a warner to you before a severe chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I give you but one admonition, that you stand unto God, two by two and one by one, and then reflect: no madness is in your comrade. He is naught but a warner unto you, before a terrible chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): I exhort you unto one thing only: that ye awake, for Allah's sake, by twos and singly, and then reflect: There is no madness in your comrade. He is naught else than a warner unto you in face of a terrific doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"I exhort you to do one thing: and that is to stand up before God in pairs, or singly, and then reflect. You will thus realize that your companion is not afflicted with madness. He is only a warner, warning you of an impending severe chastisement.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I but exhort you Unto one thing: that ye stand, for Allah's sake, by twos and singly, and then ponder; in your companion there is no madness; he is naught but a warner Unto you preceding a torment severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I give you just a single advice: that you rise up for Allah’s sake, in pairs or singly, and then reflect: there is no madness in your companion; he is just a warner to you before [the befalling of] a severe punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I do admonish you on one point: that ye do stand up before Allah,- (It may be) in pairs, or (it may be) singly,- and reflect (within yourselves): your Companion is not possessed: he is no less than a warner to you, in face of a terrible Penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to them O Muhammad SAW): \"I exhort you on one (thing) only: that you stand up for Allah's sake in pairs and singly, and reflect (within yourselves the life history of the Prophet SAW): there is no madness in your companion (Muhammad SAW), he is only a warner to you in face of a severe torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I give you only one admonition, that you stand before Allah either two by two, or one by one and reflect. There is no madness is in your companion. He (Prophet Muhammad) is only a warner to you, before a terrible punishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I offer you a single advice: devote yourselves to God, in pairs, or individually; and reflect. There is no madness in your friend. He is just a warner to you, before the advent of a severe punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I only advise you of one [thing] - that you stand for Allah, [seeking truth] in pairs and individually, and then give thought.\" There is not in your companion any madness. He is only a warner to you before a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:46] Say: ‘I will give you just one [piece of] admonition: namely, that you rise up for God, in other words, for His sake, in twos and individually, and then reflect: and realise [that], there is no madness in your companion, Muhammad (s). He is just a warner to you before [the befalling of] a severe chastisement’, in the Hereafter, if you disobey him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to the disbelievers of Mecca, Muhammad: (I exhort you unto one thing only) with \"there is no deity save Allah\": (that ye awake, for Allah's sake, by twos and singly, and then reflect) upon whether Muhammad (pbuh) is a magician, fortune teller, a liar or madman: (There is no madness in your comrade) in your Prophet. (He) Muhammad (pbuh) (is naught else than a warner) a warning Messenger (unto you in face of a terrific doom) on the Day of Judgement if you reject faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلْ إِنَّمَآ أَعِظُكُمْ بِوَاحِدَةٍ } معناه بقولِ لا إله إِلاَّ الله\n\n\n\n\nوقوله تعالى: { مَثْنَىٰ وَفُرَادَىٰ } معناه اثنين اثنين، وفُرادى فُرادى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل بعدما بلغ إلزامهم وتهديدهم غايته: { إِنَّمَآ أَعِظُكُمْ بِوَاحِدَةٍ } أي: ما أذكر لكم وأنبه عليكم إلا بخصلة واحدة كريمة، وهي: { أَن تَقُومُواْ لِلَّهِ } وحده، وتوحدوه عن وصمة الكثرة مطلقاً، وتواظبوا على أداء الأعمال الصالحة المقربة إليه، المقبولة عنده سبحانه، وتخلصوها لوجهه الكريم بلا شوب شركة ولوث كثرة وخباثة، رياء ورعونة، سمعة وعجب، واسترشدوا من رسول الله صلى الله عليه وسلم { مَثْنَىٰ } أي: اثنين اثنين { وَفُرَادَىٰ } أي: واحد واحد؛ يعني: متفرقين بلا زخام مشوش للخاطر، مخلط للأقوال، حتى يظهر لكم شأنه صلى الله عليه وسلم ويتبين دونكم برهانه { ثُمَّ } بعدما ترددتم عليه صلى الله عليه وسلم على وجه التعاقب والتفريق { تَتَفَكَّرُواْ } فيما لاح عنكم منه صلى الله عليه وسلم، وتأملوا فيه حق التأمل والتدبر على وجه الإنصاف، معرضين عن الجدل والاعتساف؛ لينكشف لكم أنه { مَا بِصَاحِبِكُمْ } يعني: محمد صلى الله عليه وسلم { مِّن جِنَّةٍ } أي: جنون وخبط يعرضه ويحمله على ادعاء الرسالة بلا برهان واضح يتضح له وينكشف دونه، كما زعم في حقه صلى الله عليه وسلم مشركوا مكة - لعنهم الله - كي يفتضح على رءوس الأشهاد، كما نشاهد من متشيخة زماننا - خذلهم الله - أمثال هذه الخرافات بلا سند صحيح\n\n\n\n\nوبعدما لم يساعدهم البرهان والكرامة افتُضحوا، وهو صلى الله عليه وسلم مع كمال عقله ورزانة رأيه ومتانة حكمته، كيف يختار ما هو سبب الشنعة والافتضاح؟! تعالى شأنه صلى الله عليه وسلم عما يقول الظالمون علواً كبيراً\n\n\n\n\nوالمعنى: ثم بعدما جلستم عنده صلى الله عليهم وسلم على الوجه المذكور، تكلمتم معه على طريق الإنصاف، تتفكرون وتتأملون، هل تجدونه صلى الله عليه وسلم معروضاً للخبط والجنون، أم للأمر السماوي الباعث له صلى الله عليه وسلم على أمثال هذه الحكم والأحكام والعبر والأمثال التي عجزت دونها فحول العقلاء وجماهير الفصحاء والبلغاء، البالغون أقصى نهاية الإدراك، مع وفور دعاويهم، وبمعارضتها والتحدي معها؟! بل { إِنْ هُوَ } أي: ما هذا الرسول المرسل إليكم المؤيد بالبراهين الواضحة والمعجزات اللائحة المثبتة لرسالته { إِلاَّ نَذِيرٌ لَّكُمْ } من قبل الحق { بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ } [سبأ: 46] أي: قبيل الساعة، وقدام يوم القيامة المعدة لأنواع العذاب والنكال على عصاة العباد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" أن تقوموا \": بدل من \" واحدة \" ، أو خبر عن مضمر\n يقول الحق جلّ جلاله: { قلْ } لهم: { إِنما أَعِظُكُم بواحدةٍ } بخصلة واحدة، وهي: { أن تقوموا لله } أي: لوجه الله خالصاً، لا لحمية، ولا عصبية، بل لطلب الحق والاسترشاد\n فالقيام على هذا معنوي، وهو القصد والتوجُّه بالقلب، وقيل: حسي، وهو قيامهم وتفرقهم عن مجلس رسول الله صلى الله عليه وسلم، فيقوم كل واحد منفرداً بنفسه، يتفكر، أو مع صاحبه\n وهذا معنى قوله: { مَثْنَى وفُرَادَى } أي: اثنين اثنين، أو فرداً فرداً\n والمعنى: أعظكم بواحدة أن تعملوا ما أصبتم الحق، وتخلصتم من الجهل\n وهي أن تقوموا فرداً\n والمعنى: أعظكم بواحدة أن تعملوا ما أصبتم الحق، وتخلصتم من الجهل\n وهي أن تقوموا وتنهضوا لله، معرضين عن المِراء والتقليد، متفرقين اثنين اثنين، أو واحداً واحداً فإنَّ الازدحام يُشوّش الخاطر، ويخلط القول، ويمنع من الرويّة، ويقلّ فيه الإنصاف، ويكثر الاعتساف\n { ثم تتفكروا } في أمر محمد صلى الله عليه وسلم، وما جاء به، حتى تعلموا أنه حق، أما الاثنان فيتفكران ويعرض كل واحد منهما محصول فكره على صاحبه، وينظران فيه نظر الصدق والإنصاف، حتى يؤديهما النظرُ الصحيح إلى الحق، وكذلك المفرد، يتفكر في نفسه ويعرض فكره على عقله\n فإذا تفكرتم بالإنصاف عرفتم أن { ما بصَاحِبِكم } يعني محمداً صلى الله عليه وسلم { مِن جِنَّةٍ } من جنون، وهذا كقوله:\n\n[الأعراف: 184]\n ومنهم مَن يقف على \" تتفكروا \" ثم يستأنف النفي\n قال القشيري: يقول: إذا سَوَّلَتْ لكم أنفسكم تكذيبَ الرسل، فأمعنوا النظرَ، هل تَرَوْنَ فيهم آثار ما رميتموهم به ـ هذا محمد صلى الله عليه وسلم قُلْتُم ساحر، فأين آثار السحر في أحواله وأفعاله وأقواله؟ قلتم: فأيّ قسم من أقسام الشعر كلامه؟ قُلْتُم مجنون، فأيُّ جنون ظهر منه؟ وإذا عجزتم فهلاَّ اعترفتم به أنه صادق؟!\n هـ\n { إِن هو إِلا نذير لكم بين يَديْ عذابٍ شديدٍ } أي: قُدَّام عذاب شديد، وهو عذاب الآخرة، وهو كقوله صلى الله عليه وسلم:\n\n \" بُعثتُ بين يَديِ الساعة \"\n \n",
      "translations": []
    }
  ]
}