{
  "chapter": "سبإ",
  "text": "فاليوم لا يملك بعضكم لبعض نفعا ولا ضرا ونقول للذين ظلموا۟ ذوقوا۟ عذاب النار التى كنتم بها تكذبون",
  "translations": [
    {
      "translation": "'Today you possess no power to help or harm one another.' And We will say to those who did wrong, 'Taste the punishment of the Fire which you denied.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day you will have no power to profit or harm each other; and We shall say to the sinners: \"Taste the punishment of Fire which you had denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today none of you has the power to benefit or harm another; and We shall say to the evil-doers: “Taste now the chastisement of the Fire which you used to deny, calling it a lie.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None of them can help or harm each other on this day. We shall tell the unjust ones, \"Suffer the torment of the fire which you had called a lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day you will not have the power to benefit or hurt one another; and We shall say to the unjust, “Taste the punishment of the fire which you used to deny!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Today, none of you can profit or harm one another. And We shall say to those who did wrong: \"Taste the torment of the Fire which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on that day one of you shall not control profit or harm for another, and We will say to those who were unjust: Taste the chastisement of the fire which you called a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore today none of you shall have power to profit or hurt another.' And We shall say to the evildoers, 'Taste the chastisement of the Fire, which you cried lies to!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day ye will possess no use nor hurt one for another. And We shall say unto those who did wrong: Taste the doom of the Fire which ye used to deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today you possess no power to benefit or harm one another. We shall say to the wrongdoers, \"Suffer the punishment of the Fire that you persistently denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To-day ye own not for one another either benefit or hurt. And We shall say Unto those who did wrong: taste the torment of the Fire which ye were wont to belie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Today you have no power to benefit or harm one another,’ and We shall say to those who did wrong, ‘Taste the punishment of the Fire which you used to deny.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on that Day no power shall they have over each other, for profit or harm: and We shall say to the wrong-doers, \"Taste ye the Penalty of the Fire,- the which ye were wont to deny!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Today (i.e. the Day of Resurrection), none of you can profit or harm one another. And We shall say to those who did wrong [i.e. worshipped others (like angels, jinns, prophets, saints, righteous persons, etc.) along with Allah]: \"Taste the torment of the Fire which you used to belie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, today none of you shall have the power to either benefit or harm one another' To the evildoers We shall say: 'Taste the punishment of the Fire, which you belied'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Today, none of you has the power to profit or harm the other.” And We will say to those who did wrong, “Taste the agony of the Fire which you used to deny.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But today you do not hold for one another [the power of] benefit or harm, and We will say to those who wronged, \"Taste the punishment of the Fire, which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:42] God, exalted be He, says: ‘So today none among you has any power over another, in other words, none of those worshipped [have any power] over any of those who worshipped, either to benefit, [through] intercession, or to hurt’, [through] chastisement. And We shall say to those who did wrong, who disbelieved: ‘Taste the chastisement of the Fire which you used to deny!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That day) which is the Day of Judgement (ye will possess no use) no intercession (nor hurt) by driving away the torment (one for another) i.e. the angels and the jinn for Banu Malih. (And We shall say unto those who did wrong) those who ascribed partners to Allah: (Taste the doom of the Fire which ye used to deny) in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱلْيَوْمَ } تبلى السرائر، وظهر ما في الضمائر، ولا سلطان الوحدة الذاتية، وانقهر الأظلال الأغيار، وظهر أن الأمور كلها مفوضة إليه سبحانه، وإن كان قبل ذلك أيضاً، كذلك { لاَ يَمْلِكُ بَعْضُكُمْ } أيها الأظلال المستهلكة في شمس الذات { لِبَعْضٍ نَّفْعاً وَلاَ ضَرّاً } لا جلباً ولا دفعاً، ولا لطفاً ولا قهراً { وَ } بعدما انقطع عنهم التصرف مطلقاً، لا معنى ولا صورة، ولا مجازاً ولا حقيقة { نَقُولُ } على مقتضى قهرنا وجلالنا { لِلَّذِينَ ظَلَمُواْ } وخرجوا عن ربقة عبوديتنا ومقتضيات حدودنا الموضوعة لإصلاح أحوال عبادنا: { ذُوقُواْ } أيها الضالون المنهمكون في بحر العدوان والطغيان { عَذَابَ ٱلنَّارِ ٱلَّتِي كُنتُم بِهَا تُكَذِّبُونَ } [سبأ: 42] في نشأتكم الأولى بعدما أُخبرتم على ألسنة الرسل والكتب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}