{
  "chapter": "سبإ",
  "text": "واذا تتلى عليهم ءايتنا بينت قالوا۟ ما هذا الا رجل يريد ان يصدكم عما كان يعبد ءاباؤكم وقالوا۟ ما هذا الا افك مفترى وقال الذين كفروا۟ للحق لما جاءهم ان هذا الا سحر مبين",
  "translations": [
    {
      "translation": "When Our Clear Signs are recited to them, they say, 'This is nothing but a man who wants to debar you from what your fathers used to worship.' They say, 'This is nothing but an invented lie.' Those who are kafir say to the truth when it comes to them, 'This is nothing but downright magic'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are read out to them, they say: \"This is only a man who wants to turn you away from what your fathers used to worship.\" And they say: \"This is nothing but a fabricated lie.\" And those who do not believe say of the truth when it has reached them: \"This is nothing but pure sorcery.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Clear Signs are rehearsed to them they say: “This is a person who wants to turn you away from the deities whom your ancestors worshipped.” They say: “This is nothing but an invented falsehood.” And when the Truth came to the unbelievers they declared: “This is nothing but plain sorcery,”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our illustrious revelations are recited to them, they say, \"This man only wants to prevent you from worshipping what your father's had worshipped.\" They say \"This, (the Quran), is a mere invented lie.\" The unbelievers have said about the truth when it came to them, \"This only is plain magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Our clear verses are recited to them, they say, “He is nothing but a man who wishes to turn you away from the deities of your forefathers!”; and they say, “This is nothing but a fabricated lie”; and said the disbelievers regarding the truth when it reached them, “This is nothing but obvious magic.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, they say: \"This is naught but a man who wishes to hinder you from that which your fathers used to worship.\" And they say: \"This is nothing but an invented lie.\" And those who disbelieve say of the truth when it has come to them: \"This is nothing but evident magic!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear communications are recited to them, they say: This is naught but a man who desires to turn you away from that which your fathers worshipped. And they say: This is naught but a lie that is forged. And those who disbelieve say of the truth when it comes to them: This is only clear enchantment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our signs are recited to them, clear signs, they say, 'This is naught but a man who desires to bar you from that your fathers served'; and they say, 'This is nothing but a forged calumny.' And the unbelievers say to the truth, when it has come to them, 'This is nothing but manifest sorcery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Our revelations are recited unto them in plain terms, they say: This is naught else than a man who would turn you away from what your fathers used to worship; and they say: This is naught else than an invented lie. Those who disbelieve say of the truth when it reacheth them: This is naught else than mere magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our messages are conveyed to them in all their clarity, they say, \"This [Muhammad] is nothing but a man who wants to turn you away from what your forefathers worshipped.\" And they say, \"This [Quran] is nothing but an invented falsehood.\" And they who are bent on denying the truth speak thus of the truth when it comes to them, \"This is clearly nothing but plain sorcery!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there are rehearsed Unto them Our plain revelations, they this messenger is naught but as a man who seeketh to prevent you from that which your fathers have been worshipping. And they say: this message is naught but a fraud fabricated. And those who disbelieve say of the truth When it is come Unto them: this is naught but manifest magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our manifest signs are recited to them, they say, ‘This is just a man who desires to keep you from what your fathers used to worship.’ And they say, ‘This is nothing but a fabricated lie.’ The faithless say of the truth when it comes to them: ‘This is nothing but plain magic,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Clear Signs are rehearsed to them, they say, \"This is only a man who wishes to hinder you from the (worship) which your fathers practised.\" And they say, \"This is only a falsehood invented!\" and the Unbelievers say of the Truth when it comes to them, \"This is nothing but evident magic!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, they say: \"This (Muhammad SAW) is naught but a man who wishes to hinder you from that which your fathers used to worship.\" And they say: \"This is nothing but an invented lie.\" And those who disbelieve say of the truth when it has come to them (i.e. Prophet Muhammad SAW when Allah sent him as a Messenger with proofs, evidences, verses, lessons, signs, etc.): \"This is nothing but evident magic!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear verses, are recited to them, they say: 'This is nothing but a man whose wish is to prevent you from that which your fathers used to worship. 'And they say: 'This is nothing but a forged lie' And those who disbelieve say of the truth when it reaches them: 'This is nothing but clear sorcery.?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our enlightening Verses are recited to them, they say, “This is nothing but a man who wants to divert you from what your ancestors used to worship.” And they say, “This is nothing but a fabricated lie.” And when the Truth comes to them, the blasphemers say of the Truth, “This is nothing but plain magic.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when our verses are recited to them as clear evidences, they say, \"This is not but a man who wishes to avert you from that which your fathers were worshipping.\" And they say, \"This is not except a lie invented.\" And those who disbelieve say of the truth when it has come to them, \"This is not but obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:43] And when Our signs, [from] the Qur’ān, are recited to them, [being] clear signs, evident [ones], by the tongue of our Prophet Muhammad (s), they say, ‘This is just a man who desires to bar you from [worshipping] what your fathers used to worship’, of idols. And they say, ‘This, Qur’ān, is nothing but a calumny, a lie, that has been invented, against God. And those who disbelieve say to the truth, the Qur’ān, when it comes to them, ‘This is nothing but plain sorcery’. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if Our revelations) the verses of the Qur'an (are recited unto them) unto the disbelievers of Mecca (in plain terms) expositing the lawful and the unlawful, (they say: This) i.e. Muhammad (pbuh) (is naught else than a man who would turn you away) bar you (from what your fathers used to worship) of idols; (and they say: This) what Muhammad (pbuh) say (is naught else than an invented lie. Those who disbelieve) the disbelievers of Mecca (say of the Truth) the Qur'an (when it reacheth them) when Muhammad (pbuh) brings it to them: (This is naught else than mere magic) this is nothing but a manifest lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ هم كانوا من غاية عدوانهم وظملهم على الله وعلى رسله وكتبه { إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا } الدالة على إصلاح أحوالهم المتعقلة بالنشأتين مع كونها { بَيِّنَاتٍ } واضحات في الدلالة على أهل مقاصدهم ومطالبهم { قَالُواْ } من شدة شكيمتهم وغيظهم على رسول الله: { مَا هَـٰذَا } المدعي للرسالة والنبوة - يعنون الرسول صلى الله عليه وسلم - { إِلاَّ رَجُلٌ } حقير مستبد برأيه\n مستبدع أمراً من تلقاء نفسه { يُرِيدُ أَن يَصُدَّكُمْ } ويصرفكم { عَمَّا كَانَ يَعْبُدُ آبَآؤُكُمْ } ويستتبعكم\n أي: يجعلكم تابعين له\n بل يستبعدكم بأمثال هذا التلبيس والتقرير { وَقَالُواْ } أيضاً في حق القرآن: { مَا هَـٰذَآ } الذي جاء به { إِلاَّ إِفْكٌ مُّفْتَرًى } أي: كذب مختلق غير مطابق للواقع\n افتراه على الله\n تلبيساً وتقريراً على ضعفاء الأنام { وَ } بالجملة: { قَالَ ٱلَّذِينَ كَفَرُواْ لِلْحَقِّ } الصريح\n وستروه بالباطل عدواناً وعناداً { لَمَّا جَآءَهُمْ } أي: حين عاينوا به وعلموا أنه من الخوارق العجيبة\n واضطروا خائبين حائرين عن جميع طرق الرد والمنع\n غير أنهم نسبوه إلى السحر وقالوا: { إِنْ هَـٰذَآ } أي: ما هذا الذي سماه قرآناً { إِلاَّ سِحْرٌ مُّبِينٌ } [سبأ: 43] ظاهر سحريته\n عظيم إعجازه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِذا تُتلى عليهم آياتنا } أي: إذا قُرئت عليهم آيات القرآن\n { بيناتٍ } واضحات\n { قالوا } أي: المشركون { ما هذا }؟ يعنون محمداً صلى الله عليه وسلم { إِلا رَجُل يُريد أن يَصُدَّكُم }: يصرفكم { عما كان يعبد آباؤُكم } من الأصنام\n { وقالوا ما هذا } أي: القرآن { إِلا إِفْكٌ }: كذب { مُّفترىً } بإضافته إلى الله تعالى\n { وقال الذين كفروا } أي: وقالوا\n والعدول عنه دليلٌ على إنكار عظيم\n وغضب شديد\n حيث سجّل عليهم بالكفر والجحد\n { للحقِّ لَمَّا جاءهم } أي: للقرآن\n أو لأمر النبوة كله\n لما عجزوا عن معارضته\n قالوا: { إِن هذا إِلا سحر مبين } أي: ما هذا إلا سحر ظاهر سِحريتُه\n وإنكارهم أولاً باعتبار معناه\n وثانياً باعتبار لفظه وإعجازه\n ولذلك سمُّوه سحراً\n قال تعالى: { وما آتيناهم من كُتُبٍ يَدْرُسُونها } أي: ما أعطينا مشركي مكة كُتباً يدرسونها\n فيها برهان على صحة الشكر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:7",
      "similarity": 0.5067581129484314
    },
    {
      "verse": "28:36",
      "similarity": 0.4819658067817625
    },
    {
      "verse": "46:28",
      "similarity": 0.39222161565078634
    },
    {
      "verse": "37:86",
      "similarity": 0.36191418762167143
    },
    {
      "verse": "46:22",
      "similarity": 0.3530128277097416
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/34:43.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/34:43.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}