{
  "chapter": "سبإ",
  "text": "وكذب الذين من قبلهم وما بلغوا۟ معشار ما ءاتينهم فكذبوا۟ رسلى فكيف كان نكير",
  "translations": [
    {
      "translation": "Those before them also denied the truth but these people do not have even a tenth of what We gave to them. They denied My Messengers. And how complete was My denial!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them had also denied, and they could not reach a tenth of (the possibilities) We had given them, and still they called My apostles liars. How great was the change that I wrought in their condition then!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who went before them also denounced (Allah's Messengers) as liars. They have not attained even a tenth of what We had given them. But when they rejected My Messengers, calling them liars, how terrible was My chastisement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These people have not one tenth of power or wealth that we had given to those who lived before them. They called Our Messengers liars. Thus, how terrible was My vengeance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them had denied – and these have not reached even a tenth of what We had given them – so they denied My Noble Messengers; so how did My rejection turn out?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them denied; these have not received even a tenth of what We had granted to those (of old); yet they denied My Messengers. Then how (terrible) was My denial!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them rejected (the truth), and these have not yet attained a tenth of what We gave them, but they gave the lie to My apostles, then how was the manifestation of My disapproval?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that were before them also cried lies, yet they reached not a tenth of what We gave them; they cried lies to My Messengers, and how was My horror!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them denied, and these have not attained a tithe of that which We bestowed on them (of old); yet they denied My messengers. How intense then was My abhorrence (of them)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their predecessors also rejected the truth. These have not attained to one tenth of the power that We had bestowed upon the earlier people. But they rejected My messengers. Then how terrible, was My chastisement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them belied; and these have not arrived Unto a tithe of that which We vouchsafed Unto them. But they belied My apostles. So how terrible was My disapproval\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were before them had also denied—and these have not attained one-tenth of what We had given them—they impugned My apostles, so how was My rebuttal!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their predecessors rejected (the Truth); these have not received a tenth of what We had granted to those: yet when they rejected My messengers, how (terrible) was My rejection (of them)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them belied; these have not received one tenth (1/10th) of what We had granted to those (of old), yet they belied My Messengers, then how (terrible) was My denial (punishment)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have gone before them belied, yet they did not reach a tenth of what We gave them; yet they belied My Messengers. And how was (My) rejection (their destruction)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them also denied the Truth, yet they have not attained one-tenth of what We had given them. They rejected My messengers, so how was My disapproval?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them denied, and the people of Makkah have not attained a tenth of what We had given them. But the former peoples denied My messengers, so how [terrible] was My reproach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:45] And those who were before them [also] denied, and they, these ones [the Meccans], have not received [even] a tenth of what We gave those [others], in the way of might, long life and abundance of wealth. Yet they denied My messengers, [who were sent] to them, so how was My abhorrence! [so how was] My rebuttal against them through punishment and destruction, in other words, it was appropriate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَكَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ وَمَا بَلَغُوا مِعْشَارَ مَا آَتَيْنَاهُمْ فَكَذَّبُوا رُسُلِي فَكَيْفَ كَانَ نَكِيرِ (45)هذا تسلية للرسول صلى الله عليه وسلم وتهديد للذين كذّبوه ، فموقع التسلية منه قوله : { وكذب الذين من قبلهم } ، وموقع التهديد بقية الآية ، فالتسلية في أن له أسوة بالرسل السابقين ، والتهديد بتذكيرهم بالأمم السالفة التي كذَّبتْ رُسلَها وكيف عاقبهم الله على ذلك وكانوا أشد قوة من قريش وأعظم سطوة منهم وهذا كقوله تعالى : { فأهلكنا أشدّ منهم بطشاً } \\[ الزخرف : 8 \\] .ومفعول { كذّب } محذوف دل عليه ما بعده ، أي كذبوا الرسل ، دل عليه قوله : { فكذبوا رسلي } .وضمير { بلغوا } عائد إلى { الذين من قبلهم } ، والضمير المنصوب في { آتيناهم } عائد إلى { الذين كفروا } في قوله : { وقال الذين كفروا للحق لما جاءهم إن هذا سحر مبين } \\[ سبأ : 43 \\] . والمقام يردّ على كل ضمير إلى معاده ، كما تقدم قريباً عند قوله تعالى : { أكثرهم بهم مؤمنون } \\[ سبأ : 41 \\] .والمِعشار : العشر ، وهو الجزء العاشر مثل المِرباع الذي كان يجعل لقائد الكتيبة من غنائم الجيش في الجاهلية .وذُكر احتمالان آخران في معاد الضميرين من قوله : { وما بلغوا معشار ما آتيناهم } لا يستقيم معهما سياق الآية .وجملة { وما بلغوا معشار ما آتيناهم } معترضة ، والاعتراض بها تمهيد للتهديد وتقريب له بأن عقاب هؤلاء أيسر من عقاب الذين من قبلهم في متعارف الناس مثل قوله تعالى : { وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه } \\[ الروم : 27 \\] .والفاء في قوله : { فكذبوا رسلي } للتفريع على قوله : { وكذب الذين من قبلهم } باعتبار أن المفرع عطف عليه قوله : { فكيف كان نكير } ، وبذلك كانت جملة { فكذبوا رسلي } تأكيداً لجملة { وكذب الذين من قبلهم } ونظيره قوله تعالى : { كذبت قبلهم قوم نوح فكذبوا عبدنا } في سورة القمر ( 9 ) ، ولكون الفاء الثانية في قوله : فكيف كان نكير } تأكيداً لفظياً للفاء في قوله : { فكذبوا رسلي } .وقوله : { فكيف كان نكير } مفرع على قوله : { وكذب الذين من قبلهم } .و ( كيف ) استفهام عن الحالة وهو مستعمل في التقرير والتفريع كقول الحجاج للعُدَيل ابن الفرخ «فكيفَ رأيتَ الله أمْكَنَ منك» ، أي أمكنني منك ، في قصة هروبه .فجملتا { فكذبوا رسلي فكيف كان نكير } في قوة جملة واحدة مفرعة على جملة { وكذب الذين من قبلهم } . والتقدير : وكذب الذين من قبلهم فكيف كان نكيري على تكذيبهم الرسل ، ولكن لما كانت جملة { وكذب الذين من قبلهم } مقصوداً منها تسلية الرسول ابتداءً جعلت مقصورة على ذلك اهتماماً بذلك الغرض وانتصاراً من الله لرسوله صلى الله عليه وسلم ثم خُصّت عِبرة تسبب التكذيب في العقاب بجملة تخصها تهويلاً للتكذيب وهو من مقامات الإِطناب ، فصادف أن كان مضمون الجملتين متحداً اتحاد السبب لمسببين أو العلةِ لمعلولين كعلة السرقة للقطع والغرم . وبني النظم على هذا الأسلوب الشيق تجنباً لثقل إعادة الجملة إعادةً ساذجة ففرعت الثانية على الأولى وأظهر فيها مفعول { كذب } وبني عليه الاستفهام التقريري التفظيعي ، أو فرع للتكذيب الخاص على التكذيب الذي هو سجيتهم العامة على الوجه الثاني في معنى : { وكذَّب الذين من قبلهم } كما تقدم ، ونظيره قوله تعالى :{ كذبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدجر } \\[ القمر : 9 \\] .والنكير : اسم للإِنكار وهو عدّ الشيء منكراً ، أي مكروهاً ، واستعمل هنا كناية عن الغضب وتسليط العقاب على الآتي بذلك المنكر فهي كناية رمزية .والمعنى : فكيف كان عقابي لهم على ما جاءوا به مما أنكره ، أي كان عقاباً عظيماً على وفق إنكارنا تكذيبهم .و { نكير } بكسر الراء وهو مضاف إلى ياء المتكلم ، وحذفت الياء للتخفيف مع التنبيه عليها ببقاء الكسرة على آخر الكلمة وليناسب الفاصلة وأختها . وكتب في المصحف بدون ياء وبوقف عليه بالسكون .\n\n",
      "translations": [
        {
          "translation": "(Those before them denied) before your people, the Quraysh, denied the messengers, (and these have not attained a tithe of that which We bestowed on them (of old)) i.e. on the disbelievers of old; it is also said 488 that this means: their wealth and children have not reached even a tithe of the wealth and children that which We bestowed upon the disbelievers of old; (yet they denied My messengers. How intense then was My abhorrence (of them)) how intense was My chastisement when they disbelieved!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا بَلَغُواْ مِعْشَارَ مَآ آتَيْنَاهُمْ } معناهُ عُشْرُ ما أَعطيناهم\n\n\n\n\nوقوله تعالى: { فَكَيْفَ كَانَ نَكِيرِ } معناه تَغْييري وعُقُوبتي\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And they have not reached a tenth of what We have given them} means that they have not yet reached a tenth of what We have given them.\n\n\nAnd His saying, {So how could it be a rejection?} Its meaning is my change and my punishment.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَ } كما كذب هؤلاء المكذبون بك أكمل الرسل وبكتابك { كَذَّبَ الَّذِينَ مِن قَبلِهِمْ } من الأمم رسلهم والكتب المنزل عليهم { وَ } هم\n أي: هؤلاء الغواة المكذبون لك يا أكمل الرسل { مَا بَلَغُواْ مِعْشَارَ مَآ آتَيْنَاهُمْ } أي: عشر ما أعطينا لأولئك المكذبين الماضين من الجاه والثروة والأمتعة الدنيوية وطول العمر\n ومع ذلك { فَكَذَّبُواْ رُسُلِي } فأخذناهم مع كمال قوتهم وشوكتهم { فَكَيْفَ كَانَ نَكِيرِ } [سبأ: 45] أي: إنكاري وانتقامي إياهم بالتدمير والهلاك\n مع إنكارهم على رسلي وكتبي بالتكذيب والاستخفاف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  ثم هدّدهم بقوله: { وكذّب الذين من قبلهم } أي: وكذّب الذين تقدّموا من الأمم الماضية\n والقرون الخالية\n الرسل\n كما كذّب هؤلاء\n { وما بَلَغُوا مِعْشَارَ ما آتيناهم } أي: وما بلغ أهل مكة عُشر ما أُوتي الأولون\n من طول الأعمار\n وقوة الأجرام\n وكثرة الأموال والأولاد\n وتوالي النعم\n والظهور في البلاد\n والمِعشار: مِفعال\n من: العشر\n ولم يأتِ هذا البناء إلا في العشرة والأربعة\n قالوا: معشار ومرباع\n وقال في القوت: المعشار: عشر العشر\n { فكذَّبوا رسلي } أي: فكذبت تلك الأمم رسلي\n { فكيف كان نكيرِ } أي: فانظر كيف كان إنكاري عليهم بالهلاك والتدمير\n فالنكير: مصدر\n كالإنكار معنى\n وكالنذير وزناً\n و كيف للتعظيم\n لا لمجرد الاستفهام\n أي: فحين كذبوا رسلي جاءهم إنكاري بالتدمير والاستئصال\n ولم تغن عنهم تلك الأموال والأولاد\n وما كانوا مستظهرين به من الرئاسة والجاه\n فليحذر هؤلاء أن يحل بهم مثل ما حل بأولئك لمشاركتهم لهم في الكفر والعدوان\n الإشارة: تكذيب الصادقين سُنَّة ماضية\n وكل مَن ظهر بخصوصية يجذب الناس إلى الله\n ويخرجهم من عوائدهم\n قالوا: ما هذا إلا سحر مفترى\n وما سمعنا بهذا في آبائنا الأولين\n فحين كذَّبوا أولياء زمانهم حُرموا بركتهم\n فبقوا في عذاب الحرص والتعب\n والهلع والنصب\n قال القشيري: إن الحكماء والأولياء ـ الذين هم الأئمة في هذه الطريقة ـ إذا دَلوا الناسَ على الله\n قال إخوانهم من إخوان السوء ـ وربما كان من الأقارب وأبناء الدنيا: مَن ذا الذي يطيق هذا؟ ولا بُد من الدنيا ما دمت تعيش!\n\n وأمثال هذا كثير\n حتى يميل ذلك المسكين من قِبل النصح\n فيهلك ويضل\n هـ\n باختصار\n وقال في قوله تعالى: { وما آتيناهم من كُتُب يدرسونها\n\n } ما حاصله: إن أرباب القلوب إذا تكلموا بالحقائق\n على سبيل الإلهام والفيض\n لا يطلب منهم البرهان على ما نطقوا به\n فإذا طالبهم أهل القبلة بذلك\n فسبيلهم السكوت عنهم\n حتى يجيب عنهم الحق تعالى\n هـ\n وبالله التوفيق\n ثم أمر بالتفكر والاعتبار فقال: { قُلْ إِنَّمَآ أَعِظُكُمْ بِوَاحِدَةٍ أَن تَقُومُواْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:18",
      "similarity": 0.6213139268351664
    },
    {
      "verse": "35:26",
      "similarity": 0.5244532863082889
    },
    {
      "verse": "89:2",
      "similarity": 0.4916431483974314
    },
    {
      "verse": "26:214",
      "similarity": 0.4690392550569996
    },
    {
      "verse": "6:160",
      "similarity": 0.4276436907507781
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}