{
  "chapter": "سبإ",
  "text": "قالوا۟ سبحنك انت ولينا من دونهم بل كانوا۟ يعبدون الجن اكثرهم بهم مؤمنون",
  "translations": [
    {
      "translation": "they will say, 'Glory be to You! You are our Protector, not them. No, they were worshipping the jinn. They",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God forbid!\" (they will answer). \"You are our protector not they. In fact, they worshipped the devils. Most of them believed in them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply: “Glory to You! You are our Protector, not they. Nay, they rather used to worship the jinn. Most of them believe in them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply, \"All glory belongs to you. You are our guardian, not they. They had been worshipping the jinn and most of them had strong faith\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Purity is to you – only you are our Supporter, not they; in fact they worshipped the jinns; most of them believed only in them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the angels) will say: \"Glorified be You! You are our Protector instead of them. Nay, but they used to worship the Jinn; most of them were believers in them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: Glory be to Thee! Thou art our Guardian, not they; nay! they worshipped the jinn; most of them were believers in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'Glory be to Thee'! Thou art our Protector, apart from them; nay rather, they were serving the jinn; most of them believed in them.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: Be Thou Glorified. Thou (alone) art our Guardian, not them! Nay, but they worshipped the jinn; most of them were believers in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Glory be to You! You are our protector, not them. Indeed no! They worshipped the jinn; it was in them that most of them believed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: hallowed be Thou! Thou art our protecting friend, not they; Aye! they have been worshipping the jinn; In them most of them were believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Immaculate are You! You are our wali, not they! No, they used to worship the jinn; most of them had faith in them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Glory to Thee! our (tie) is with Thee - as Protector - not with them. Nay, but they worshipped the Jinns: most of them believed in them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (angels) will say: \"Glorified be You! You are our Wali (Lord) instead of them. Nay, but they used to worship the jinns; most of them were believers in them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to You' they will answer. 'You are our Guardian other than them! No, rather they worshipped the jinn, and it was them which most believed'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Be You glorified; You are our Master, not them. In fact, they used to worship the jinn, and most of them had faith in them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Exalted are You! You, [O Allah], are our benefactor not them. Rather, they used to worship the jinn; most of them were believers in them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:41] They will say, ‘Glory be to You, exalted above that You should have an associate! You are our Supporter, not they, in other words, as far as we are concerned there are no bonds of association between us and them. Nay, (bal, is to indicate transition) rather, they used to worship the jinn, the devils, in other words, [they used to] obey them and [agree to] worship us; most of them were believers in them’, accepting as truth what these [jinn] used to say to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They) i.e. the angels (will say: Be Thou glorified) they will exonerate Allah. (Thou art our Protector) our Lord (from them! Nay, but they worshipped the jinn; most of them were believers in them) thinking they were angels.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } أي: الملائكة خائفين من بطشه سبحانه، مستحيين، متضرعين نحو جنابه: { سُبْحَانَكَ } ننزهل يا مولانا عما لا يليق بشأنك { أَنتَ وَلِيُّنَا مِن دُونِهِمْ } وأنت المراقب علينا، المطلع على سرائرنا وضمائرنا، المتولي لجميع ما صدر عنا، وأنت تعلم يا مولانا ألاَّ موالاة بيننا وبينهم؛ إذ لا يخفى عليك خافية، ومن أين يسع لنا ويتأتى من الرضا بأمثال هذه الجرأة والجرائم العظيمة، وأنت أعلم يا مولانا بمعبوداتهم التي اتخذوها هؤلاء الغواة الطغاة، الهالكون في تيه الجهل والغفلة؛ لعلو شأنك وشأن ألوهيتك وربوبيتك { بَلْ كَانُواْ يَعْبُدُونَ ٱلْجِنَّ } أي: الشياطين الداعين لهم إلى عبادتهم، الراضين بها؛ لأنهم يتمثلون بصور الملائكة، ويدعون الألوهية والربوبية لأنفسهم، ويأمرونهم بالعبادة لأنفسهم، بل { أَكْـثَرُهُم } أي: كل المشركين، وجملة المتخذين أنداداً لله { بِهِم مُّؤْمِنُونَ } [سبأ: 41] أي: بالشياطين، عابدون لهم، متوجهون نحوهم في عموم مهامهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}