{
  "chapter": "سبإ",
  "text": "قل جاء الحق وما يبدئ البطل وما يعيد",
  "translations": [
    {
      "translation": "Say: 'The Truth has come. Falsehood cannot originate or regenerate.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The truth has come, and falsehood had neither precedence nor will reappear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “The Truth has come and falsehood can neither originate nor recreate anything.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"The truth has come. Falsehood has vanished and it will not come back again\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “The truth has come, and falsehood dare not commence nor return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The truth has come, and the falsehood can neither create anything nor resurrect.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: The truth has come, and the falsehood shall vanish and shall not come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say. 'Truth has come; falsehood originates not, nor brings again.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: The Truth hath come, and falsehood showeth not its face and will not return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"The Truth has come and will endure. Falsehood has no power to originate any good, nor to reproduce it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: the truth is come, and falsehood shall neither originate nor be restored.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘The truth has come, and falsehood neither originates nor restores [anything].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The Truth has arrived, and Falsehood neither creates anything new, nor restores anything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"The truth (the Quran and Allah's Inspiration) has come, and AlBatil [falsehood - Iblis (Satan)] can neither create anything nor resurrect (anything).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Truth has come. Falsehood has vanished and shall return no more.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “The Truth has come; while falsehood can neither originate, nor regenerate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"The truth has come, and falsehood can neither begin [anything] nor repeat [it].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:49] Say: ‘The truth, Islam, has come. And falsehood, disbelief, neither originates nor restores [anything]’, in other words, it leaves no trace [of itself] behind.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (The Truth hath come) Islam has become manifest and the Muslims numerous, (and falsehood showeth not its face) Satan and the idols do not create (and will not return) and will not revive the dead.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل بعدما بينت لهم طريق الحق كلاماً ناشئاً عن محض الحكمة، خالياً عن وصمة الكذب مطلقاً: { جَآءَ ٱلْحَقُّ } الحقيق بالاتباع، وظهر الإسلام الجدير بالإطاعة والاستسلام، فلكم أن تغتنموا الفرصة وتنقادوا له مخلصين { وَ } نبههم ويا أكمل الرسل أيضاً أنه بعدما ظهر نور الإسلام، وعلا قدره، وارتفع شأنه { مَا يُبْدِىءُ } ويحدث { ٱلْبَاطِلُ } الذي زق واضمحل ظلمته بنور الإسلام، وغار مناره في مهاوي الجهل وأغوار الخذلان { وَ } صار إلى حيث { مَا يُعِيدُ } [سبأ: 49] أصلاً في حين من الأحيان\n\n\n\n\nسبحان من أظهر أنوار الإسلام ورفع أعلامه، وقمع الكفر وأخفض أصنامه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل جاء الحقُّ } أي: الإسلام: أو: القرآن، { وما يُبْدِىءُ الباطلُ وما يُعيدُ } أي: زال الباطل وهلك، لأن الإبداء والإعادة من صفات الحي، فعدمهما عين الهلاك، والمعنى: جاء الحق وهلك الباطل، كقوله:\n\n[الإسراء: 81] قال الكواشي: المعنى: ذهب الباطل لمجيء الحق، فلم يبقَ له بقية حتى يبدىء شيئاً أو يعيده\n ثم قال: وهذا مثلٌ، يقال: فلان لا يبدىء ولا يعيد، إذا كان لا يلتفت إليه ولا يعتمد عليه\n وقال الهروي: الباطل: إبليس، ما يبدىء ولا يعيد: لا يخلق ولا يبعث، والله تعالى هو المبدىء المعيد، ومعناهما: الخالق الباعث\n وقال في الصحاح: وفلان ما يبدىء وما يعيد، أي: ما يتكلم ببادية ولا عائدة، ومثله في القاموس\n والحاصل: أنه عبارة عن زهوق الباطل، حتى لا يبقى له ظهور\n وعن ابن مسعود رضي الله عنه دخل النبيُّ صلى الله عليه وسلم مكةَ يوم الفتح، وحول الكعبة أصنام، فجعل يطعنُها بعودٍ، فتقطع لقفاها، ويقول:\n\n \" { جَآءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقاً } [الإسراء: 81] قل جاء الحق وما يُبدىءُ الباطلُ وما يُعيد \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:13",
      "similarity": 0.819878414420244
    },
    {
      "verse": "30:11",
      "similarity": 0.7534540659285807
    },
    {
      "verse": "29:19",
      "similarity": 0.6522575549595243
    },
    {
      "verse": "30:27",
      "similarity": 0.5824267781724436
    },
    {
      "verse": "10:34",
      "similarity": 0.5695223190690858
    }
  ]
}