{
  "chapter": "سبإ",
  "text": "ليجزى الذين ءامنوا۟ وعملوا۟ الصلحت او۟لئك لهم مغفرة ورزق كريم",
  "translations": [
    {
      "translation": "This is so that He may recompense those who have iman and do right actions. They will have forgiveness and generous provision.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may recompense those who have believed and done the right. For them will be forgiveness and worthy sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The Hour shall come) that He may reward those who believe and do righteous deeds. Theirs shall be forgiveness and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will certainly reward the righteously striving believers. These are the ones who will receive forgiveness and honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He may reward those who believed and did good deeds; it is these for whom is forgiveness, and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may recompense those who believe and do righteous good deeds. Those, theirs is forgiveness and generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and do good; these it is for whom is forgiveness and an honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may recompense those who believe, and do righteous deeds; theirs shall be forgiveness and generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and do good works. For them is pardon and a rich provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will surely reward those who believe and do good deeds: they shall have forgiveness and an honourable provision.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may recompense these who believed and worked righteous works. Those! theirs shall be forgiveness and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may reward those who have faith and do righteous deeds.’ For such there will be forgiveness and a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and work deeds of righteousness: for such is Forgiveness and a Sustenance Most Generous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may recompense those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds. Those, theirs is forgiveness and Rizqun Karim (generous provision, i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in order that He recompenses those who believe and do good works; theirs shall be forgiveness and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may recompense those who believe and do good works. Those will have forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may reward those who believe and do righteous deeds. Those will have forgiveness and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:4] that He may requite, thereat, those who believe and perform righteous deeds — for such there will be forgiveness and a fair provision, in Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That He may reward those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between them and their Lord. (For them is pardon) their sins are pardoned in the life of this world (and a rich provision) and a fair reward in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإنما أثبت وأحضر الكل في لوح قضائه { لِّيَجْزِيَ } سبحانه المؤمنين { ٱلَّذِينَ آمَنُواْ } بتوحيده، واعترفوا بتصديق رسله { وَعَمِلُواْ ٱلصَّالِحَاتِ } المقربة إليه سبحانه، المقبولة عنده، خير الجزاء ويعطيهم أحسن المواهب والعطاء { أُوْلَـٰئِكَ } السعداء المقبولون عنده المستحقون لأنواع الكرامات { لَهُمْ مَّغْفِرَةٌ } لما تقدم من ذنوبهم تفضلاً عليهم { وَرِزْقٌ كَرِيمٌ } [سبا: 4] صوري في الجنة، ومعنوي عند وصولهم إلى شرف لقائه، بلا كيف وأين ووجهة وجهة ومكان وزمان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}