{
  "chapter": "سبإ",
  "text": "قل ما سالتكم من اجر فهو لكم ان اجرى الا على الله وهو على كل شىء شهيد",
  "translations": [
    {
      "translation": "Say: 'I have not asked you for any wage - it is all for you. My wage is the responsibility of Allah alone. He is witness of everything.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The reward I ask is for yourself. My reward is due from none but God; and He is witness over everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: “Whatever recompense I might ask of you, it shall be yours. My recompense is with Allah, and He is witness over everything.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Whatever reward I ask you (for my preaching) will be for your own good. No one can reward me except God. He is the Witness over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Whatever fee I might have asked from you upon this, is yours; my reward is only upon Allah; and He is Witness over all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Whatever wage I might have asked of you is yours. My wage is from Allah only, and He is a Witness over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Whatever reward I have asked of you, that is only for yourselves; my reward is only with Allah, and He is a witness of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I have asked no wage of you; that shall be yours. My wage falls only upon God; and He is witness over everything.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Whatever reward I might have asked of you is yours. My reward is the affair of Allah only. He is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If I have asked you for any recompense, you can keep it. It is God alone who will reward me: He is the witness of all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: whatsoever hire might have asked of you is yours; my hire is with Allah only. And He is of everything a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Whatever reward I may have asked you is for your own good. My [true] reward lies only with Allah, and He is witness to all things.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"No reward do I ask of you: it is (all) in your interest: my reward is only due from Allah: And He is witness to all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Whatever wage I might have asked of you is yours. My wage is from Allah only. and He is Witness over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I ask no wage of you; that shall be yours. My wage is only upon Allah and He is Witness over everything'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Whatever compensation I have asked of you, is yours. My compensation comes only from God, and He is Witness over all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Whatever payment I might have asked of you - it is yours. My payment is only from Allah, and He is, over all things, Witness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:47] Say, to them: ‘I have not asked you, in return for [my] warning and delivering the Message [to you], any reward, since it is for [the benefit of] you, in other words, I do not ask you for any reward in return for this. Indeed my reward lies only with God, and He is Witness over all things’, observing [them all], knowing my truthfulness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ مَا سَأَلْتُكُمْ مِنْ أَجْرٍ فَهُوَ لَكُمْ إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ وَهُوَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ (47)هذا استقصاء لبقايا شبه التكذيب لدحضها سواء منها ما تعلقوا به من نحو قولهم : كاهن وشاعر ومجنون وما لم يدعوه ولكنه قد يخطر ببال واحد منهم أن يزعموا أنه يريد بهذه الدعوة نفعاً لنفسه يكون أجراً له على التعليم والإِرشاد .وهم لما ادّعوا أنه ساحر أو أنه شاعر أو أنه كاهن لزم من دعواهم أنه يتعرض لجائزة الشاعر ، وحُلوان الكاهن؛ فلما نفيت عنه تلك الخلال لم يبق لهم في الكنانة سهم طعن ، إلا أن يزعموا أنه يطلب أجراً على الإِرشاد فقيل لهم : { ما سألتكم من أجر فهو لكم } إن كان بكم ظنّ انتفاعي منكم بما دعوتكم إليه ، فما كان لي من أجر عليه فخذوه . وهذه طريقة بديعة في الكناية التهكمية عن عدم انتفاعه بما يدعوهم إليه بأن يفرض كالواقع ثم يرتب عليه الانكفاف عنه ورد ما فات منه ليفضي بذلك إلى البراءة منه ومن التعرض له ، فهي كناية رمزية وأنهم يعلمون أنه لم يسألهم أجراً { قل ما أسألكم عليه من أجر وما أنا من المتكلفين إن هو إلا ذكر للعالمين } \\[ ص : 86 ، 87 \\] أو إن كنت سألتكم أجراً فلا تعطونيه ، وإن كنتم أعطيتم شيئاً فاستردّوه ، فكُنِّي بهذا الشرط المحقّق انتفاؤه عند انتفاء أن يكون طالباً أجراً منهم على حدّ قوله تعالى : { إن كنت قلته فقد علمته } \\[ المائدة : 116 \\] . وهذا ما صرح به عقبه من قوله { إن أجري إلا على الله } ، فجيء بالشرط بصيغة الماضي ليدلّ على انتفاء ذلك في الماضي فيكون انتفاؤه في المستقبل أجدر؛ على أن وقوعه في سياق الشرط يقضي بانتفائه في المستقبل أيضاً . وهذا جار مجرَى التحدِّي لأنه لو كان لجماعتهم أو آحادهم علم بأنه طلب أجراً منهم لجَارُوا حين هذا التحدّي بمكافحته وطالبوه بردّه عليهم .وينتقل من هذا إلى تعين أن ما دعاهم إليه لا ينتفع به غيرهم بالنجاة من العذاب ، وقد تكرر في القرآن التبرؤ من أن يكون النبي صلى الله عليه وسلم يريد منهم أجراً أو يتطلب نفعاً لأن انتفاء ذلك ما يلاقيه من العناء في الدعوة دليل أنه مأمور بذلك من الله لا يريد جزاء منهم .و { مَا } يجوز أن تكون شرطية ، و { من أجر } بياناً لإِبهام { ما } وجملة { فهو لكم } جواب الشرط . ويجوز أن تكون { ما } نافية . وتكون { من } لتوكيد عموم النكرة في النفي ، وتكون الفاء في قوله : { فهو لكم } تفريعاً على نفي الأجر ، وضمير «هو» عائداً على القرآن المفهوم من المقام ومن تقدم قوله : { وإذا تتلى عليهم آياتنا بينات } \\[ سبأ : 43 \\] أي فهذا القرآن لفائدتكم لا لفائدتي لأن قوله : { ما سألتكم من أجر } يفيد أن لا فائدة له في هذه الدعوة .ويكون معنى الآية نظيرَ معنى قوله تعالى : { قل ما أسألكم عليه من أجر وما أنا من المتكلفين إن هو إلا ذكر للعالمين } \\[ ص : 86 ، 87 \\] .والأجْر تقدم عنه قوله تعالى : { ليجزيك أجر ما سقيت لنا } في سورة القصص ( 25 ) .وجملة إن أجري إلا على الله } مستأنفة استئنافاً بيانياً جواباً لسؤال مقدر أن يسأل السامع : كيف لا يكون له على ما قام به أجر ، فأجيب بأن أجره مضمون وَعَده الله به لأنه إنما يقوم بعمل لمرضاته وامتثال أمره فعليه أجره .وحرف { على } يقتضي أنه حق الله وذلك بالنظر إلى وَعده الصادق ، ثم ذيّل ذلك باستشهاد الله تعالى على باطنه ونيته التي هي من جملة الكائنات التي الله شهيد عليها ، وعليم بخفاياها فهو من باب : { قل كَفى بالله شهيداً بيني وبينكم } \\[ الرعد : 43 \\] أي وهو شاهد على ذلك كله .والأجر : عوض نافع على عمل سواء كان مالاً أو غيره .وقرأ نافع وأبو عَمرو وابن عامر وحفص ياء { أجريَ } مفتوحة . وقرأها ابن كثير وأبو بكر وحمزة والكسائي ساكنة ، وهما وجهان من وجوه ياء المتكلم في الإِضافة .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Whatever reward) or exchange (I might have asked of you is yours. My reward is the affair of Allah only. He is Witness over all things) regarding your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فاعلموا أن { مَا سَأَلْتُكُم مِّن أَجْرٍ } على إرشادكم وتكميلكم { فَهُوَ لَكُمْ } أي: هبة لكم\n مردود عليكم { إِنْ أَجْرِيَ } أي: ما أجري وجعلي على تحمل هذه المشاق والمتاعب الورادة في تبليغ الرسالة وإظهار الدعوة { إِلاَّ عَلَى ٱللَّهِ } الذي أرسلني بالحق\n وبعثني بالصدق\n وهو المراقب المطلع على جميع أحوالي\n الحكيم بإفاضة ما ينبغي ويليق بي وبشأني { وَ } كيف لا يطلع سبحانه على أحوال عباده\n إذ { هُوَ } بذاته { عَلَىٰ كُلِّ شَيْءٍ } ظهر من الموجودات ولاح عليه لمعة الوجود { شَهِيدٌ } [سبأ: 47] حاضر دونه\n غير بعيد عنه ومغيب عليه\n\n\n{ قُلْ } يا أكمل الرسل بعدما تمادى مراءة أهل الضلال وتطاول جدالهم: لا أبالي باساتهدائكم واسترشادكم\n ولا أبالغ في تمكيلكم\n بل { إِنَّ رَبِّي } العليم باسعتدادات عباده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { قل ما سألتكم عليه } أي: على إنذاري وتبليغ الرسالة { من أَجْرٍ } إذ لو كنتُ كذلك لاتهمتموني أني أطمع في أموالكم. وما طلبتُ من ذلك { فهو لكم } ومعناه: نفي سؤاله الأجر رأساً. نحو: ما لي في هذا فهو لك، وما تعطني تصدق به على نفسك. { إِنْ أَجْريَ } في ذلك { إِلا على الله وهو على كل شيءٍ شهيدٌ } فيعلم أني لا أطلب الأجر في نصيحتكم، ودعائكم إليه، إلا منه تعالى. الإشارة: تقدم مراراً أن الدعاة إلى الله ينبغي لهم أن يتنزّهوا عن الطمع في الناس جهدهم، ولو اضطروا إلى ذلك إذ لا يقع النفع العام على أيديهم إلا بعد الزهد التام، والتعفُّف التام عما في أيدي الناس، فإذا تحققوا بهذا الأمر جعلهم الله حُجةً، يدمغ بهم على الباطل، كما قال تعالى: { قُلْ إِنَّ رَبِّي يَقْذِفُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:109",
      "similarity": 0.7164636025105535
    },
    {
      "verse": "26:127",
      "similarity": 0.7164636025105535
    },
    {
      "verse": "26:145",
      "similarity": 0.7164636025105535
    },
    {
      "verse": "26:164",
      "similarity": 0.7164636025105535
    },
    {
      "verse": "26:180",
      "similarity": 0.7164636025105535
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034047.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034047.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}