{
  "chapter": "سبإ",
  "text": "فاليوم لا يملك بعضكم لبعض نفعا ولا ضرا ونقول للذين ظلموا۟ ذوقوا۟ عذاب النار التى كنتم بها تكذبون",
  "translations": [
    {
      "translation": "'Today you possess no power to help or harm one another.' And We will say to those who did wrong, 'Taste the punishment of the Fire which you denied.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day you will have no power to profit or harm each other; and We shall say to the sinners: \"Taste the punishment of Fire which you had denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today none of you has the power to benefit or harm another; and We shall say to the evil-doers: “Taste now the chastisement of the Fire which you used to deny, calling it a lie.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None of them can help or harm each other on this day. We shall tell the unjust ones, \"Suffer the torment of the fire which you had called a lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day you will not have the power to benefit or hurt one another; and We shall say to the unjust, “Taste the punishment of the fire which you used to deny!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Today, none of you can profit or harm one another. And We shall say to those who did wrong: \"Taste the torment of the Fire which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on that day one of you shall not control profit or harm for another, and We will say to those who were unjust: Taste the chastisement of the fire which you called a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore today none of you shall have power to profit or hurt another.' And We shall say to the evildoers, 'Taste the chastisement of the Fire, which you cried lies to!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day ye will possess no use nor hurt one for another. And We shall say unto those who did wrong: Taste the doom of the Fire which ye used to deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today you possess no power to benefit or harm one another. We shall say to the wrongdoers, \"Suffer the punishment of the Fire that you persistently denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To-day ye own not for one another either benefit or hurt. And We shall say Unto those who did wrong: taste the torment of the Fire which ye were wont to belie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Today you have no power to benefit or harm one another,’ and We shall say to those who did wrong, ‘Taste the punishment of the Fire which you used to deny.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on that Day no power shall they have over each other, for profit or harm: and We shall say to the wrong-doers, \"Taste ye the Penalty of the Fire,- the which ye were wont to deny!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Today (i.e. the Day of Resurrection), none of you can profit or harm one another. And We shall say to those who did wrong [i.e. worshipped others (like angels, jinns, prophets, saints, righteous persons, etc.) along with Allah]: \"Taste the torment of the Fire which you used to belie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, today none of you shall have the power to either benefit or harm one another' To the evildoers We shall say: 'Taste the punishment of the Fire, which you belied'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Today, none of you has the power to profit or harm the other.” And We will say to those who did wrong, “Taste the agony of the Fire which you used to deny.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But today you do not hold for one another [the power of] benefit or harm, and We will say to those who wronged, \"Taste the punishment of the Fire, which you used to deny.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:42] God, exalted be He, says: ‘So today none among you has any power over another, in other words, none of those worshipped [have any power] over any of those who worshipped, either to benefit, [through] intercession, or to hurt’, [through] chastisement. And We shall say to those who did wrong, who disbelieved: ‘Taste the chastisement of the Fire which you used to deny!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَالْيَوْمَ لَا يَمْلِكُ بَعْضُكُمْ لِبَعْضٍ نَفْعًا وَلَا ضَرًّا وَنَقُولُ لِلَّذِينَ ظَلَمُوا ذُوقُوا عَذَابَ النَّارِ الَّتِي كُنْتُمْ بِهَا تُكَذِّبُونَ (42){ بِهِم مُّؤْمِنُونَ \\* فاليوم لاَ يَمْلِكُ بَعْضُكُمْ لِبَعْضٍ نَّفْعاً وَلاَ ضَرّاً وَنَقُولُ لِلَّذِينَ ظَلَمُواْ ذُوقُواْ } .الأظهر أن هذا من خطاب الله تعالى المشركين والجنَّ . والفاء فصيحة ناشئة عن المقاولة السابقة . وهي كلام موجه من جانب الله تعالى إلى الملائكة والمقصود به : التعريض بضلال الذين عبدوا الملائكة والجن لأن الملائكة يعلمون مضمون هذا الخبر فلا نقصد إفادتهم به . والمعنى : إذ علمتم أنكم عبدتم الجن فاليوم لا يملك بعضكم لبعض نفعاً ولا ضراً .ويجوز أن يكون من خطاب الملائكة للفريقين بعد أداء الشهادة عليهم توبيخاً لهم وإظهاراً للغضب عليهم تحقيقاً للتبرؤ منهم ، والفاء أيضاً فصيحة وهي ظاهرة .وقُدم الظرف على عامله لأن النفع والضر يومئذٍ قد اختص صغيرهما وكبيرهما بالله تعالى خلاف ما كان في الدنيا من نفع الجن عُبَّادهم ببعض المنافع الدنيوية ونفع المشركين الجن بخدمة وساوسهم وتنفيذ أغراضهم من الفتنة والإِضلال ، وكذلك الضر في الدنيا أيضاً .والمِلك هنا بمعنى : القدرة ، أي لا يقدر بعضكم على نصر أو نفع بعض . وتقدم عند قوله تعالى : { قل فمَن يملك من اللَّه شيئاً إن أراد أن يهلك المسيحَ ابن مريم } في سورة العقود ( 17 ) .وقدم النفع في حَيز النفي تأييساً لهم لأنهم كانوا يرجون أن يشفعوا لهم يومئذٍ و { يقولون هؤلاء شفعاؤنا عند الله } \\[ يونس : 18 \\] .وعطف نفي الضر على نفع النفع للدلالة على سلب مقدرتهم على أي شيء فإن بعض الكائنات يستطيع أن يضر ولا يستطيع أن ينفع كالعقرب .{ وَلاَ ضَرّاً وَنَقُولُ لِلَّذِينَ ظَلَمُواْ ذُوقُواْ عَذَابَ النار التى كُنتُم } .عطف على قوله : { ثم نقول للملائكة } \\[ سبأ : 40 \\] . وقد وقع الإِخبار عن هذا القول بعد الإِخبار عن الحوار الذي يجري بين الملائكة وبين المشركين يومئذٍ إظهاراً لاستحْقاقهم هذا الحكم الشديد ، ولكونه كالمعلول لقوله : { لا يملك بعضكم لبعض نفعاً ولا ضراً } .والذوق : مجاز لمطلق الإِحساس ، واختياره دون الحقيقة لشهرة استعماله .ووصف النار بالتي كانوا يكذبون بها لما في صلة الموصول من إيذان بغلطهم وتنديمهم .وقد علق التكذيب هنا بنفس النار فجيء باسم الموصول المُناسب لها ولم يعلق بالعذاب كما في آية سورة السجدة ( 20 ) { وقيل لهم ذوقوا عذاب النار الذي كنتم به تكذبون } لأن القول المخبر عنه هنا هو قول الله تعالى وحكمه وقد أذن بهم إلى جهنم وشاهدوها كما قال تعالى آنفاً : { وأسروا الندامة لما رأوا العذاب } \\[ سبأ : 33 \\] فإن الذي يرى هو ما به العذاب ، وأما القول المحكي في سورة السجدة ( 20 ) فهو قول ملائكة العذاب بدليل قوله : { كلما أرادوا أن يخرجوا منها أعيدوا فيها وقيل لهم ذوقوا عذاب النار الذي كنتم به تكذبون . } وتقديم المجرور للاهتمام والرعاية على الفاصلة .\n\n",
      "translations": [
        {
          "translation": "(That day) which is the Day of Judgement (ye will possess no use) no intercession (nor hurt) by driving away the torment (one for another) i.e. the angels and the jinn for Banu Malih. (And We shall say unto those who did wrong) those who ascribed partners to Allah: (Taste the doom of the Fire which ye used to deny) in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱلْيَوْمَ } تبلى السرائر\n وظهر ما في الضمائر\n ولا سلطان الوحدة الذاتية\n وانقهر الأظلال الأغيار\n وظهر أن الأمور كلها مفوضة إليه سبحانه\n وإن كان قبل ذلك أيضاً\n كذلك { لاَ يَمْلِكُ بَعْضُكُمْ } أيها الأظلال المستهلكة في شمس الذات { لِبَعْضٍ نَّفْعاً وَلاَ ضَرّاً } لا جلباً ولا دفعاً\n ولا لطفاً ولا قهراً { وَ } بعدما انقطع عنهم التصرف مطلقاً\n لا معنى ولا صورة\n ولا مجازاً ولا حقيقة { نَقُولُ } على مقتضى قهرنا وجلالنا { لِلَّذِينَ ظَلَمُواْ } وخرجوا عن ربقة عبوديتنا ومقتضيات حدودنا الموضوعة لإصلاح أحوال عبادنا: { ذُوقُواْ } أيها الضالون المنهمكون في بحر العدوان والطغيان { عَذَابَ ٱلنَّارِ ٱلَّتِي كُنتُم بِهَا تُكَذِّبُونَ } [سبأ: 42] في نشأتكم الأولى بعدما أُخبرتم على ألسنة الرسل والكتب\n\n\n{ وَ } كيف لا نقول لهم ما نقول",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فاليومَ لا يملكُ بعضُكم لبعضٍ نفعاً ولا ضرًّا } لأن الأمر في ذلك اليوم إليه وحده\n لا يملك أحد فيه منفعة ولا مضرة لأحد لأن الدار دار ثواب وعقاب\n والمثيب والمعاقبُ هو الله\n فكانت حالها خلاف حال الدنيا\n التي هي دار تكليف\n والناس فيها مخلَّى بينهم\n يتضارون\n ويتنافعون\n وأما يوم القيامة فلا فعل لأحد قط\n ثم ذكر معاقبة الظالمين بقوله: { ونقول للذين ظلموا } بوضع العبادة في غير موضعها: { ذُوقوا عذابَ النار التي كنتم بها تُكذِّبون } في الدنيا\n الإشارة: ما أحببت شيئاً إلا وكنت له عبداً\n ولا يُحب أن تكون لغيره عبداً\n فإذا تحققت الحقائق\n التحق كل عابد بمعبوده\n وكل حبيب بمحبوبه\n فيرتفع الحق بأهله\n ويهوي الباطلُ بأهله\n وكل ما سوى الله باطل\n فارفع همتك أيها العبد عن هذه الدار وما فيها\n وتعلق بالباقي\n دون الفاني\n ولا تتعلق بشيء سوى المتكبر المتعالي\n قال القشيري: قوله تعالى: { فاليوم لا يملك بعضكم\n\n\n } الخ\n الإشارة في هذا: أنَّ مَن علّقَ قلبه بالأغيار\n وظنّ صلاحَ حاله في الاختيار\n والاستعانة بالأمثال والأشكال\n نزع اللهُ الرحمة من قلوبهم\n وتركهم\n وتشوش أحوالهم\n فلا لهم من الأشكال والأمثال معونة\n ولا لهم في عقولهم استبصار\n ولا إلى الله رجوع\n فإنْ رجعوا لا يرحمهم ولا يحبهم\n ويقول: ذوقوا وبالَ ما به استوجبتم هذه العقوبة\n هـ\n قلت: قوله: \" فإن رجعوا لا يرحمهم \" يعني أنهم فزعوا أولاً إلى المخلوق\n فلما لم ينجح مسعاهم\n رجعوا إلى الله\n فلم ينفعهم\n ولو تابوا في المستقبل لقبل توبتهم\n وقال أيضاً: ومن تشديد العقوبة الافتضاح في السؤال\n وفي بعض الأخبار: أن عبيداً يسألهم الحق غداً\n فيقع عليهم من الخجل ما يقولون: يا ربنا لو عذبتنا بما شئت من ألوان العقوبة\n ولا تعذبنا بهذا السؤال\n هـ\n وبالله التوفيق\n ثم ذكر حال أهل الغفلة فقال: { وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:89",
      "similarity": 0.5605766910765057
    },
    {
      "verse": "5:76",
      "similarity": 0.5435053970868065
    },
    {
      "verse": "26:73",
      "similarity": 0.5316120471250422
    },
    {
      "verse": "21:66",
      "similarity": 0.5092943872003336
    },
    {
      "verse": "10:106",
      "similarity": 0.5052724818249203
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}