{
  "chapter": "سبإ",
  "text": "وما ءاتينهم من كتب يدرسونها وما ارسلنا اليهم قبلك من نذير",
  "translations": [
    {
      "translation": "We have not given them any books which they are studying nor did We send, before you, any warner to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not give them any scripture to study, nor sent any warner before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereas We gave them no Books that they could study nor sent to them any warner before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send to them, (the pagans), any books to study nor a Messenger to warn them, and those who lived before them had rejected the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not give them any Books which they may read, nor did We send to them any Herald of Warning before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had not given them Scriptures that they could study, nor sent to them before you any warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not given them any books which they read, nor did We send to them before you a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not given them any Books to study, nor have We sent them before thee any warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have given them no scriptures which they study, nor sent We unto them, before thee, any warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had not given them books to study, nor have We sent them a warner before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had not vouchsafed Unto them Books they should have been studying, nor had We sent Unto them, before thee, any warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "though We did not give them any scriptures that they might have studied, nor did We send them any warner before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We had not given them Books which they could study, nor sent messengers to them before thee as Warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had not given them Scriptures which they could study, nor sent to them before you (O Muhammad SAW) any warner (Messenger).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet We have not given them any Books to study, nor, before you, have We sent them a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We gave them no book to study, and We did not send them any warner before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had not given them any scriptures which they could study, and We had not sent to them before you, [O Muhammad], any warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:44] And We did not give them any scriptures for them to study, nor did We send them any warner before you, so on what grounds do they deny you?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have given them) i.e. the disbelievers of Mecca (no Scriptures which they study) in which they recite that which they claim, (nor sent We unto them, before thee) Muhammad, (any warner) any warning Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى غاية تجهيل المشركين ونهاية تسفيههم، فقال: { وَمَآ آتَيْنَاهُمْ } وأنزلنا عليهم { مِّنْ كُتُبٍ يَدْرُسُونَهَا } وفيها دليل الإشراك وإثبات الآلهة، بل كل الكتب منزلة على التوحيد وبيان طريقه { وَ } كذلك { مَآ أَرْسَلْنَا إِلَيْهِمْ قَبْلَكَ } يا أكمل الرسل { مِّن نَّذِيرٍ } [سبأ: 44] ينذرهم عن التوحيد، ويدعوهم إلى الشرك، بل كل من أرسل من الرسل، فإنما هو على إرشاد التحيد والإنذار عن الشرك المنافي له\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}