{
  "chapter": "سبإ",
  "text": "ولو ترى اذ فزعوا۟ فلا فوت واخذوا۟ من مكان قريب",
  "translations": [
    {
      "translation": "If you could only see when they are terrified, and there is no way out, and they are seized from a nearby place.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could see when they are gripped by terror without any escape, and are seized from close at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could only see when the unbelievers will go about in a state of terror. They will have no escape and will be seized from a place near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that you could see how the unbelievers will be terrified by death from which they cannot escape. They will be seized from a nearby place\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only you see, when they will be forced into a terror from which they will be unable to escape, and are seized from a place nearby. (Wherever they go, they are never far).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you could but see, when they will be terrified with no escape, and they will be seized from a near place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And could you see when they shall become terrified, but (then) there shall be no escape and they shall be seized upon from a near place\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah, if thou couldst see when they are terrified, and there is no escape, and they are seized from a place near at hand,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Couldst thou but see when they are terrified with no escape, and are seized from near at hand,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could only see when those who denied the truth are terrified, and there is no way out, and they are seized from a place nearby;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And couldst thou see the time when they shall be terrified! Then there shall be no escaping, and they shall be laid hold of from a place quite nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you to see them when they will be stricken with terror, without any escape, and are seized from a close quarter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst but see when they will quake with terror; but then there will be no escape (for them), and they will be seized from a position (quite) near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you could but see, when they will be terrified with no escape (for them), and they will be seized from a near place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could only see when they (the unbelievers) are seized with terror, and there is no escape. They shall be seized from a nearby place,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could only see when they are terrified, and there is no escape, and they are seized from a nearby place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you could see when they are terrified but there is no escape, and they will be seized from a place nearby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:51] If you could but see, O Muhammad (s), when they are stricken with terror, at the Resurrection, you would see a dreadful thing, and so there is no escape, for them, from Us, that is to say, they will not [be able to] elude Us, and they are seized from a close quarter, namely, [from] the graves.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Couldst thou but see) Muhammad (when they are terrified) when the earth swallows them (with no escape) for anyone among them, (and are seized from near at hand) from beneath their feet the earth swallows them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ فَوْتَ } معناه فلا هَربَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"So do not flee,\" means do not run away.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال قرب الله سبحانه لعباده { لَوْ تَرَىٰ } أيها الرائي وقت { إِذْ فَزِعُواْ } أي: الكفرة والمشركون وقت حلول الأجل ونزول العذاب عليهم في يوم الساعة، لرأيت أمراً فظيعاً { فَلاَ فَوْتَ } أي: حين لا فوت لهم عن الله، لا منهم ولا من أعمالهم و أحوالهم شيء { وَ } إن تحصنوا بالحصون الحصينة والقلاع المنيعة والبروج المشيدة، بل { أُخِذُواْ } حيثما كانوا { مِن مَّكَانٍ قَرِيبٍ } [سبأ: 51] من الله، ولو كانوا في قعر الأرض، أو قلل الجبال، أو في قلب الصخرة، أو فوق السماء، أو في أي مكان من الأماكن المخفية، وبالجملة: أُخذوا من مكان قريب بالنسبة إليه سبحانه؛ إذ هو سبحانه منزه عن الأمكنة، شهيد حاضر في جميعها، غير مغيب عنها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" مُرِيب \": اسم فاعل، من أراب، أي: أتى بريبة، وأربته: أوقعته في الريبة\n ونسبة الإرابة إلى الشك مجاز\n والمراد: وصفه بالشدة والإظلام، بحيث إنه يوقع في شك آخر\n يقول الحق جلّ جلاله: { ولو ترى } يا محمد، أو: يا مَن تصح منه الرؤية، الكفرةَ\n { إِذ فَزِعُوا } حين فزعوا عند صيحة البعث، لرأيت أمراً فظيعاً هائلاً، { فلا فَوْتَ } أي: لا مهرب لهم، أو: فلا يفوتون الله ولا يسبقونه\n { وأُخذوا } إلى النار { من مكان قريبٍ } من المحشر إلى قعر جنهم\n أو: ولو ترى إذ فزعوا عند الموت فلا فوت منه، وأُخذوا من ظهر الأرض إلى بطنها، أو: إذا فزعوا يوم بدر، وأُخذوا من صحراء بدر إلى القليب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "60:11",
      "similarity": 0.5931651320886304
    },
    {
      "verse": "27:89",
      "similarity": 0.582712181409693
    },
    {
      "verse": "21:103",
      "similarity": 0.5416043343307195
    },
    {
      "verse": "34:23",
      "similarity": 0.4629757701334375
    },
    {
      "verse": "67:3",
      "similarity": 0.3819149718504043
    }
  ]
}