{
  "chapter": "سبإ",
  "text": "وحيل بينهم وبين ما يشتهون كما فعل باشياعهم من قبل انهم كانوا۟ فى شك مريبۭ",
  "translations": [
    {
      "translation": "A barrier will be set up between them and the thing that they desire, just as was done with their kind before. They too were in a state of crippling doubt.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A barrier shall be raised between them and what they desired, as was done with their partisans before. They too were filled with disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A barrier will be placed between them and what they desire, as was done with the likes of them before. Surely they were in a disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A gulf will exist between them and their desires on the Day of Judgment like the similar people who lived before. They, too, had lived in doubt and uncertainty (about the life hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a barrier is set between them and what they desire*, as was done for their earlier groups; indeed they are in a doubt that deceives. (To accept faith or return to earth)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a barrier will be set between them and that which they desire, as was done in the past with the people of their kind. Verily, they have been in grave doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a barrier shall be placed between them and that which they desire, as was done with the likes of them before: surely they are in a disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a barrier is set between them and that they desire, as was done with the likes of them aforetime; they were in doubt disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a gulf is set between them and that which they desire, as was done for people of their kind of old. Lo! they were in hopeless doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them and their desires a barrier shall be placed as was done in the past with people of their ilk; for they were indeed in disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be shut off from that which they will eagerly desire, as shall be done with the likes of them of yore. Verily they have been in doubt perplexing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a barrier is set between them and what they desire, as was done aforetime with their likes, who had remained in grave doubt?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them and their desires, is placed a barrier, as was done in the past with their partisans: for they were indeed in suspicious (disquieting) doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a barrier will be set between them and that which they desire [i.e. At-Taubah (turning to Allah in repentance) and the accepting of Faith etc.], as was done in the past with the people of their kind. Verily, they have been in grave doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a barrier is set between them and that which they desire, as it was done before with their like; they were in suspicious doubt'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A barrier will be placed between them and what they desire, as was done formerly with their counterparts. They were in disturbing doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And prevention will be placed between them and what they desire, as was done with their kind before. Indeed, they were in disquieting denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:54] And a barrier is set between them and what they crave, in the way of faith — in other words, [their craving] to embrace it — just as was done with their counterparts, in [respect to] disbelief, formerly, in other words, before them. Indeed they used to be in grave doubt, [doubt] causing them to have misgivings about that in which they now believe, but the proofs for which they never considered in this world. Meccan: it consists of 45 or 46 verses, revealed after [sūrat] al-Furqān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ كَمَا فُعِلَ بِأَشْيَاعِهِمْ مِنْ قَبْلُ إِنَّهُمْ كَانُوا فِي شَكٍّ مُرِيبٍ (54)عطف على الجمل الفعلية نظائر هذه وهي جُمل { فَزِعوا وأُخذوا وقالوا } \\[ سبأ : 51 ، 52 \\] أي وحَال زَجُّهم في النار بينهم وبين ما يأملُونه من النجاة بقولهم : { آمنا به } \\[ سبأ : 52 \\] . وما يشتهونه هو النجاة من العذاب أَوْ عودتهم إلى الدنيا؛ فقد حُكي عنهم في آيات أُخرى أنهم تمنَّوه { فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين } \\[ الأنعام : 27 \\] ، «ربنا أرجعنا نعمل صالحاً غير الذي كنا نعمل» .والتشبيه في قوله : { كما فعل بأشياعهم من قبل } تشبيه للحيلولة بحيلولة أخرى وهي الحيلولة بين بعض الأمم وبين الإِمهال حين حلّ بهم عذاب الدنيا ، مثل فرعون وقومه إذ قال : { آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل وأنا من المسلمين } \\[ يونس : 90 \\] ، وكذلك قوم نوح حين رأوا الطوفان ، وما من أمة حلّ بها عذاب إلا وتمنّت الإِيمان حينئذٍ فلم ينفعهم إلاّ قوم يونس .والأشياع : المشابهون في النحلة وإن كانوا سالفين . وأصل المشايعة المتابعة في العمل والحلف ونحوه ، ثم أطلقت هنا على مطلق المماثلة على سبيل المجاز المرسل بقرينة قوله : { من قبل } ، أي كما فعل بأمثالهم في الدنيا من قبل ، وأما يوم الحشر فإنما يحال بينهم وبين ما يشتهون وكذلك أشياعهم في وقت واحد .وفائدة هذا التشبيه تذكير الأحياء منهم وهم مشركو أهل مكة بما حل بالأمم من قبلهم ليُوقنوا أن سنة الله واحدة وأنهم لا تنفعهم أصنامهم التي زعموها شفعاء عند الله .وجملة { إنهم كانوا في شك مريب } مسوقة لتعليل الجمل التي قبلها . وفُعِل بهم جميع ما سمعت لأنهم كانوا في حياتهم في شك من ذلك اليوم وما وُصف لهم من أهواله .وإنما جعلت حالتهم شكاً لأنهم كانوا في بعض الأمور شاكّين وفي بعضها موقنين ، ألا ترى قوله تعالى : { قلتم ما ندري ما الساعة إن نظن إلا ظناً وما نحن بمستيقنين } \\[ الجاثية : 32 \\] . وإذا كان الشك مفضياً إلى تلك العقوبة فاليقين أولى بذلك ، ومآل الشك واليقين بالانتفاء واحد إذ ترتب عليهما عدم الإِيمان به وعدم النظر في دليله .ويجوز أن تكون جملة { إنهم كانوا في شك مريب } مستأنفة استئنافاً بيانياً ناشئة عن سؤال يثيره قولُه : { وحيل بينهم وبين ما يشتهون } كأن سائلاً سأل هل كانوا طامعين في حصول ما تمنّوه؟ فأجيب بأنهم كانوا يتمنون ذلك ويشكون في استجابته فلما حيل بينهم وبينه غشِيَهم اليأس ، واليأس بعد الشك أوقع في الحزن من اليأس المتأصل .والمريب : المُوقع في الريب . والريب : الشك ، فوصفُ الشك به وصفٌ له بما هو مشتق من مادته لإِفادة المبالغة كقولهم : شِعْر شاعر ، وليْل أَليل ، أو ليلٌ داج . ومحاولة غير هذا تعسف .\n\n",
      "translations": [
        {
          "translation": "(And a gulf is set between them and that which they desire) of returning to the life of this world, (as was 489 done for people of their kind of old) and the adherents of their religion from among the disbelievers. (Lo! they were in hopeless doubt) they were in manifest doubt about the Creator of the heavens and the earth. And Allah knows best the secrets of His Book'. And of the surah in which the angels are mentioned, which is all Meccan and consists of 45 verses, 197 words and 3,130 letters: Surah 35: The Creator of Angels (Fatir) And of the surah in which the angels are mentioned, which is all Meccan and consists of 45 verses, 197 words and 3,130 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَمَا فُعِلَ بِأَشْيَاعِهِم مِّن قَبْلُ } معناه بأعوانِهِم وأصحابِهم\n وقال: بالأُمم الذي كانوا على منهاجِهم ومَذهبِهم\n\n",
      "translations": [
        {
          "translation": "\n\nAs He did with those before them, Allah will do with them according to their actions and those of their companions.\n He said: \"By the nations who were on their way and their belief.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما آيسوا عن قبول الإيمن وقت الاضطرار { حِيلَ } وحجب { بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ } من الإيمان والنجاة المترتبة عليه\n ففعل بهم حينئذ { كَمَا فُعِلَ بِأَشْيَاعِهِم } وأشباههم { مِّن قَبْلُ } من الكفرة المضاين الهالكين\n الملتجئين إلى الإيمان وقت اضطرارهم وهجوم العذاب عليهم\n كفرعون وقارون وغيرهما { إِنَّهُمْ } قد { كَانُواْ } أمثال هؤلاء الغواة المنهمكين { فِي شَكٍّ } أي: غفلة وتردد { مُّرِيبٍ } [سبأ: 54] موقع أصحابه في ريب عظيم\n وكفر شديد\n وإنكار غليظ\n\n\nأعاذنا الله وجميع عباده عن أمثاله بمنِّه وجوده\n\n\nخاتمة السورة\n\nعليك أيها السالك\n المتدرج في درجات اليقين من العلم إلى العين إلى الحق - وفقك الله إلى أعلى مطالبك\n وأعانك في إنجائه - أن تتمكن في مقعد الصدق الذي هو مرتبة الرضا\n معرضاً عن الشك والتردد في مقتضيات القضاء\n ومبرمات الأحكام المثبتة في حضرة العلم الإلهي\n وأن تتوجه نحوه سبحانه في جميع حالاتك بذيل كرم نبيه المؤيد من عنده الذي أرشدك إلى توحيده\n مسترشداً من آيات كتاب الله المنزنل على رسوله\n المبين لسلوك طريق التوحيد واليقين\n وأحاديث النبي الموضح لمغلقات الكتاب\n المشير إلى رموزه وإشاراته\n\n\nفلك في كل الأحوال التبتل إلى الله\n والتوكل نحوه\n والتفويض إليه\n فاتخذه سبحانه وكيلك في جميع حوائجك\n وحسيبك في جميع مهماتك\n يكفيك معيناً\n وكيف عنك شرور أعدائك مطلقاً\n\n\nوإياك إياك أن تختلط مع أصحاب الغفلة وأرباب الثروة\n المفتخرين بما عندهم من المال الجاه\n والنسب العلي والحسب الذي يباهي صاحبه ويتفوق على أقرانه ويطلب الرئاسة والسيادة بسببه\n\n\nوإن أردت أن تجلس مع بني نوعك وتصاحب معهم\n فاختر منهم من انقطع عن الدنيا وأمنايها\n وتزهد عنها وما فيها\n سوى سد جوعة وستر عورة وكنِّ يحفظه عن البرد والحر\n وصاحب معه مصاحبة الحائر التائه في بيداء\n لا يدري أين طرفاها\n متفكرين متدبرين للخروج منها\n والنجاة عن أهوالها وأغوالها\n\n\nفلك أن تتذكر في عموم أوقاتك قوله صلى الله عليه وسلم\n واجعله نصب عينيك في جميع حالاتك وهو:\n \" كن في الدنيا كأنك غريب أو كعابر سبيل\n وعد نفسك من أصحاب القبور \"\n \n \nجعلنا الله ممن امتثل به\n وتذكر وعمل بمقتضاه\n ووجد في نفسه حلاوة معناه بفضله ولطفه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { وحِيلَ بينهم وبين ما يشتهون } من نفع الإيمان يومئذ\n والنجاة به من النيران\n والفوز بنعيم الجنان\n أو بين الرد إلى الدنيا\n كما حُكِيَ عنهم بقوله:\n\n[السجدة: 12] { كما فُعل بأشياعهم من قبلُ } أي: بأشباههم من الكفرة الدارجة مِن قبلهم\n فإنه قد حيل بينهم وبين ما يشتهون من الإيمان والعمل الصالح بالموت\n وهذه الأفعال كلها تقع في المستقبل\n عبَّر عنها بالماضي لتحقُّق وقوعها\n { إِنهم كانوا في شكٍّ } في أمر الرسول والبعث\n { مُريب } موقع للريبة\n أو: ذي ريبة\n نعت به للمبالغة\n وفيه رد على مَن زعم أن الله لا يُعذّب على الشك\n قاله النسفي\n الإشارة: قوم غفلوا عن تحقيق الإيمان\n وتربيته\n بصحبة أهل الإيقان\n حتى إذا كُشف ـ بعد الموت ـ عن مقامهم القصير\n ومكانهم البعيد\n قالوا: آمنا وتيقَّنَّا\n وأنى لهم التناوش من مكان بعيد\n وقوم اشتغلوا بالبطالة والتقصير\n وصرفوا في الشهوات والحظوظ عمرهم القصير\n وتوغلوا في أشغال الدنيا وزخارفها\n فذهلوا عن الجد والتشمير\n فإذا انقضت عنهم أيام الدنيا حيل بينهم وبين ما يشتهون\n من اغتنام الأوقات\n وتعمير الساعات\n لنيل المراتب والدرجات\n وهنالك يقع الندم حين لم ينفع\n ويُطلب الرجوع فلا يُسْمَع\n قال القشيري: إذا تابوا ـ وقد أُغْلِقَت الأبواب\n وندمُوا ـ وقد تقطعت بهم الأسباب\n فليس إلا الحسرات مع الندم\n ولات حين ندامة! كذلك مَن استهان بتفاصيل فترته\n ولم يَسْتَفِقْ من غَفْلَتِه فتجاوز حده\n ويُعْفَى عنه كَرَّه\n فإذا استمكن في القسوة\n وتجاوز في سوء الأدب حدَّ القلة\n وزاد على مقدار الكثرة\n فيحصل لهم من الحق رَدّ\n ويستقبلهم حجاب البُعد\n فعند ذلك لا يُسمع لهم دعاء\n ولا يُرْحَمُ لهم بكاء\n كما قيل\n وأنشد:\nوقوم شمروا عن سابق الجد والتشمير\n ولم يقنعوا من مولاهم بقليل ولا كثير\n قد انتهزوا فرصة الأعمار\n ولم يشغلهم عن الله ربع ولا ديار\n عمّروا أوقاتهم بالذكر والتذكار\n وفكرة الاعتبار والاستبصار\n حتى وردوا دار القرار\n أولئك المصطفون الأخيار\n يدفع الله تعالى بهم عن أهل الدنيا الأنكاد والأغيار\n ويكشف عن قلوبهم الحُجب والأستار\n وقوم حققوا مقام الإيمان\n واشتغلوا بتربيته\n بصحبة أهل الإيقان\n حتى أفضوا إلى مقام العيان\n فلا تعلم نفس ما أخفي لهم من قرة أعين\n جعلنا الله من خواصهم بمنِّه وكرمه\n وبمحمد نبيه وحبه صلى الله عليه وسلم وعلى آله وصحبه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:10",
      "similarity": 0.4396743857499543
    },
    {
      "verse": "6:159",
      "similarity": 0.4278848655065898
    },
    {
      "verse": "37:83",
      "similarity": 0.42380992116537386
    },
    {
      "verse": "54:51",
      "similarity": 0.40506780561784794
    },
    {
      "verse": "11:62",
      "similarity": 0.39008521894688164
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034054.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034054.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}