{
  "chapter": "سبإ",
  "text": "قل ان ضللت فانما اضل على نفسى وان اهتديت فبما يوحى الى ربى انه سميع قريب",
  "translations": [
    {
      "translation": "Say: 'If I am misguided, it is only to my detriment. But if I am guided, it is by what my Lord reveals to me. He is All-Hearing, Close-at-hand.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If I am in error it is to my own loss; if I am on guidance that is so because of what my Lord reveals to me. He is all-hearing and all-too-near.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “If I go astray then the hurt of straying will come only upon me. But if I am rightly-guided, that is only because of the revelation that my Lord makes to me. He is All-Hearing, Ever Nigh.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If I go astray it will only be against my own soul, but if I receive guidance, it will be through my Lord's revelations.\" He is All-hearing and Omnipresent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “If I stray, I stray only for my own harm; and if I attain guidance, it is because of what my Lord has sent down to me; indeed He is All Hearing, Close.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If (even) I go astray, I shall stray only to my own loss. But if I remain guided, it is because of the Revelation of my Lord to me. Truly, He is All-Hearer, Ever Near.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If I err, I err only against my own soul, and if I follow a right direction, it is because of what my Lord reveals to me; surely He is Hearing, Nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If I go astray, I go astray only to my own loss; if I am guided, it is by what my Lord reveals to me. He is All-hearing, Ever-nigh.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If I err, I err only to my own loss, and if I am rightly guided it is because of that which my Lord hath revealed unto me. Lo! He is Hearer, Nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Affirm, \"If I am in error, I shall carry the burden thereof; and if I am rightly guided, it is because of what my Lord has revealed to me. Truly, He is all-hearing and near at hand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if ever I go astray, I shall stray only against myself, and if I remain guided it is because of that which my Lord hath revealed Unto me. Verily He is Hearing, Nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If I go astray, my going astray is only to my own harm, and if I am rightly guided that is because of what my Lord has revealed to me. Indeed He is all-hearing and nearmost.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If I am astray, I only stray to the loss of my own soul: but if I receive guidance, it is because of the inspiration of my Lord to me: it is He Who hears all things, and is (ever) near.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If (even) I go astray, I shall stray only to my own loss. But if I remain guided, it is because of the Inspiration of my Lord to me. Truly, He is AllHearer, Ever Near (to all things).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If I go astray, then I go astray only against myself; if I am guided it is because of that which my Lord has revealed to me. He is the Hearer, and theNear'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If I err, I err only to my own loss; but if I am guided, it is by what my Lord inspires me. He is Hearing and Near.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If I should err, I would only err against myself. But if I am guided, it is by what my Lord reveals to me. Indeed, He is Hearing and near.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:50] Say: ‘If I go astray, from the truth, I will be going astray only to my own loss, that is to say, the sin of my going astray shall be held against me; and if I am rightly guided, it will have been by what my Lord reveals to me, of the Qur’ān and wisdom. Truly He is Hearer, of supplications, Nigh’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (If I err) from the Truth and guidance, (I err only to my own loss) he says: the punishment of that is against my soul, (and if I am rightly guided) to the Truth and guidance (it is because of that which my Lord hath revealed unto me) that I am guided. (Lo! He is Hearer) of he who calls Him, (Nigh) in responding to whoever calls Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n آمراً لنبيه على وجه الامتنان: { قُلْ } لهم يا أكمل الرسل بعدما عيروك وطعنوا في شأنك ودينك: { إِن ضَلَلْتُ } وانحرفت عن سبيل السلامة وجادة الاستقامة { فَإِنَّمَآ أَضِلُّ } وأنحرف { عَلَىٰ نَفْسِي } وبمقتضى أهويتها ومشتهياتها\n وشؤم لذاتها وشهواتها { وَإِنِ ٱهْتَدَيْتُ } إلى التوحيد والعرفان\n ونلت إلى أسباب درجات الجنان { فَبِمَا يُوحِي إِلَيَّ رَبِّي } أي: بسبب وحيه وإلهامه إليّ\n وامتنانه عليّ بالهداية إلى أنواع الكرامات وأصناف اللذات الروحانية { إِنَّهُ } سبحانه { سَمِيعٌ قَرِيبٌ } [سبأ: 50] يسمع مناجاتي\n ويقضي جميع حاجاتي على وجهها إن تعلق إرادته ومشيئته بها بعدما جرى وثبت في حضرة علمه\n ومضى عليها قضاؤه في لوحه بحيث لا يفوته شيء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنه سميع } لما أقوله لكم\n { قريبٌ } مني ومنكم\n فيجازيني ويجازيكم على ما أخفيتم وما أعلنتم\n  الإشارة: الحق هو العلم بالله\n والباطل الجهل بالله\n أو: ما سوى الله\n فإذا حصل للعبد العلم بالله غاب عنه كل ما سواه\n وما بقي في الوجود إلا الله\n وفي ذلك يقول الشاعر: >\nوفي القوت في تفسير الآية: أي: لما جاء الحق أبطل الباطل وأعاده\n فأظهر حقيقة الأمر بدءاً وعوداً\n أي: كشف ما يبدىء الباطل للابتداء\n وما يعيد على العبد من الأحكام\n يعني: أن نور الحق يكشف حقيقةَ الباطل وضررَ عاقبته\n وقُبحه في ذاته\n والله أعلم\n هـ\n ومَن رُمي بباطل أو بدعة\n وهو محقق بالحق\n متمسك بالسنة النبوية\n فليقل لمَن رماه: { إِن ضللتُ فإنما أضل على نفسي\n\n } الآية\n ثم ذكر حسرة من فاته الإيمان في إبانه فقال: { وَلَوْ تَرَىٰ إِذْ فَزِعُواْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:13",
      "similarity": 0.5489553599622672
    },
    {
      "verse": "53:10",
      "similarity": 0.4669480665410421
    },
    {
      "verse": "99:5",
      "similarity": 0.4640562662695358
    },
    {
      "verse": "53:4",
      "similarity": 0.4371708628945893
    },
    {
      "verse": "38:70",
      "similarity": 0.41207014097155525
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/34:50.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/34:50.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/34:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}