{
  "chapter": "سبإ",
  "text": "ويرى الذين اوتوا۟ العلم الذى انزل اليك من ربك هو الحق ويهدى الى صرط العزيز الحميد",
  "translations": [
    {
      "translation": "Those who have been given knowledge see that what has been sent down to you from your Lord is the truth and that it guides to the Path of the Almighty, the Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been given knowledge realise what has been revealed by the Lord is the truth, and leads to the path of the mighty and praiseworthy (God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), those who have knowledge see clearly that what has been revealed to you from your Lord is the Truth and directs to the Way of the Most Mighty, the Immensely Praiseworthy Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been given knowledge will see that whatever has been revealed to you from your Lord is the truth and that it guides to the straight path of the Majestic and Praiseworthy One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who received the knowledge know that what is sent down upon you from your Lord is the truth, and it shows the path of the Most Honourable, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have been given knowledge see that what is revealed to you from your Lord is the truth, and that it guides to the path of the Exalted in might, Owner of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those to whom the knowledge has been given see that which has been revealed to you from your Lord, that is the truth, and it guides into the path of the Mighty, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been given the knowledge see that what has been sent down to thee from thy Lord is the truth, and guides to the path of the All-mighty, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been given knowledge see that what is revealed unto thee from thy Lord is the truth and leadeth unto the path of the Mighty, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been given knowledge know that what has been revealed to you from your Lord is the truth, and that it guides to the path of the Almighty, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who have been vouchsafed knowledge beholding that the Book which hath been sent down Unto thee from thy Lord, - it is the truth and it guideth Unto the path of the Mighty, the Praiseworthy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been given knowledge see that what has been sent down to you from your Lord is the truth and [that] it guides to the path of the All-mighty, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those to whom knowledge has come see that the (Revelation) sent down to thee from thy Lord - that is the Truth, and that it guides to the Path of the Exalted (in might), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have been given knowledge see that what is revealed to you (O Muhammad SAW) from your Lord is the truth, and guides to the Path of the Exalted in Might, Owner of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the knowledge has been given can see that what has been sent down to you from your Lord is the truth, guiding to the Path of the Almighty, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who received knowledge know that what is revealed to you from your Lord is the truth; and it guides to the path of the Majestic, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have been given knowledge see that what is revealed to you from your Lord is the truth, and it guides to the path of the Exalted in Might, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:6] And those who have been given knowledge — the believers from among the People of the Scripture, such as ‘Abd Allāh b. Salām and his companions — see, they know, that what has been revealed to you from your Lord, that is, the Qur’ān, is the, decisive, truth, and [that] it guides to the path, the way, of the Mighty, the Praised, in other words, of God, the Lord of Might Who is ever-praised.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who have been given knowledge) the knowledge of the Torah, i.e. 'Abdullah Ibn Salam and his followers (see that what is revealed unto thee from thy Lord) i.e. the Qur'an (is the Truth and leadeth unto the path of the Mighty) guides to the religion of He Who is Mighty in retribution against those who do not believe in Him, (the Owner of Praise) as regards those who declare His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَرَى } يا أكمل الرسل العلماء العرفاء { ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } من قبلنا فضلاً منا إياهم المتعلق بأن الكتاب { ٱلَّذِيۤ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ } تأييداً لشأنك وترويجاً لأمرك { هُوَ ٱلْحَقَّ } المطابق للواقع\n الحقيق بالمتابعة والإطاعة\n الثابت المثبت نزوله عندنا بلا ريب وتردد { وَ } كيف لا يكون حقاً { يَهْدِيۤ } بأوامره ونواهيه أو تذكيراته الضالين المنصرفين عن جادة العدالة { إِلَىٰ صِرَاطِ ٱلْعَزِيزِ } الغالب\n القادر المقتدر على انتقام المنحرفين عن منهج الرشاد { ٱلْحَمِيدِ } [سبأ: 6] المستحق في ذاته لجميع المحامد الكرمات\n لولا تحميد الناس له وتمجيدهم إياه\n وصراطه هو التوحيد الذاتي المستلزم لتوحيد الصفات والأفعال\n المنبئ عن إسقاط عموم الإضافات\n\n\n{ وَ } بعدما سمع المشركون عن رسول الله صلى الله عليه وسلم من أحوال الحشر والنشر والمعاد الجسماني",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { ويرى }: مرفوع، استئناف، أو منصوب، عطف على { ليجزي }. و { الحق }: مفعول ثان ليرى العلمية. والمفعول الأول: { الذي أُنزل } وهو ضمير فصل.  يقول الحق جلّ جلاله: { ويَرَى الذين أُوتوا العلم } من الصحابة، وممن شايعهم من علماء الأمة ومن ضاهاهم، أو علماء أهل الكتاب الذين أسلموا، كعبد الله بن سلام، وكعب الأحبار، أي: يعلمون { الذي أُنزل إِليك من ربك } يعني القرآن { هو الحق } لا يرتابون في حقيّته لِما نطوى عليه من الإعجاز، وبموافقته للكتب السالفة، على يد مَن تحققت أميته. أو: ليجزي المؤمنين، وليعلم أولو العلم عند مجيء الساعة أنه الحق، علماً لا يزاد عليه في الإيقان، لكونه محل العيان، كما علموه في الدنيا من طريق البرهان. { ويهدي إِلى صراط العزيز الحميد } وهو دينُ الله، من التوحيد، وما يتبعه من الاستقامة. الإشارة: أول ما يرتفع الحجاب عن العبد بينه وبين كلام سيده، فيسمع كلامه منه، لكن من وراء رداء الكبرياء، وهو رداء الحس والوهم، فيجد حلاوة الكلام ويتمتع بتلاوته، فيلزمه الخشوع والبكاء والرِقة عند تلاوته. قال جعفر الصادق: \" لقد تجلّى الحق تعالى في كلامه ولكن لا تشعرون \". ثم يرتفع الحجاب بينه وبين الحق تعالى، فيسمع كلامه بلا واسطة ولا حجاب، فتغيب حلاوة الكلام في حلاوة شهود المتكلم، فينقلب البكاء سروراً، والقبض بسطاً. وعن هذا المعنى عبّر الصدِّيق عند رؤيته قوماً يبكون عند التلاوة، فقال: \" كذلك كنا ولكن قست القلوب \" فعبّر عن حال التمكُّن والتصلُّب بالقسوة لأن القلب قبل تمكُّن صاحبه يكون سريعَ التأثُّر للواردات، فإذا تمكّن واشتد لم يتأثر بشيء. وصراط العزيز الحميد هو طريق السلوك إلى حضرة ملك الملوك. وبالله التوفيق. ثم ذكر مقالة أخرى للكفرة فقال: { وَقَالَ ٱلَّذِينَ كَفَرُواْ هَلْ نَدُلُّكُمْ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:1",
      "similarity": 0.6815165742087679
    },
    {
      "verse": "22:24",
      "similarity": 0.6470370259212517
    },
    {
      "verse": "24:46",
      "similarity": 0.5721354100490378
    },
    {
      "verse": "37:118",
      "similarity": 0.547115903341225
    },
    {
      "verse": "1:6",
      "similarity": 0.5437748487590652
    }
  ]
}