{
  "chapter": "سبإ",
  "text": "وقال الذين كفروا۟ هل ندلكم على رجل ينبئكم اذا مزقتم كل ممزق انكم لفى خلق جديد",
  "translations": [
    {
      "translation": "Those who are kafir say, 'Shall we show you to a man who will tell you that when you have completely disintegrated, you will then be recreated all anew?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers say: \"Shall we tell you of a man who prophesies that when you are reduced to particles and vanished in the dust, you will become a new creation\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: “Shall we direct you to the man who tells you that when you have been utterly broken to pieces, you will be raised to life again?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers have said, \"Should we tell you about a man who says that you will be brought back to life again after your having been completely disintegrated?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “Shall we show you a man who will tell you that ‘When you have disintegrated into the smallest pieces, you are to be created again’?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"Shall we direct you to a man who will tell you (that) when you have become fully disintegrated into dust with full dispersion, then you will be created (again) anew\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: Shall we point out to you a man who informs you that when you are scattered the utmost scattering you shall then be most surely (raised) in (to) a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'Shall we point you to a man who will tell you, when you have been utterly torn to pieces, then you shall be in a new creation?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: Shall we show you a man who will tell you (that) when ye have become dispersed in dust with most complete dispersal still, even then, ye will be created anew?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say, \"Shall we point out to you a man who will tell you that when you are broken up into particles, you will be put together again in a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: shall we direct you toward a man declaring Unto you that when ye have become dispersed\" with full dispersion, then ye will be raised Unto a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘Shall we show you a man who will inform you [that] when you have been totally rent to pieces you will indeed have a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say (in ridicule): \"Shall we point out to you a man that will tell you, when ye are all scattered to pieces in disintegration, that ye shall (then be raised) in a New Creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"Shall we direct you to a man (Muhammad SAW) who will tell you (that) when you have become fully disintegrated into dust with full dispersion, then, you will be created (again) anew?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: 'Shall we direct you to a man who will tell you that when you have been utterly torn into pieces you will be raised in a new creation?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved said, “Shall we point out to you a man, who will tell you that, once torn into shreds, you will be in a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve say, \"Shall we direct you to a man who will inform you [that] when you have disintegrated in complete disintegration, you will [then] be [recreated] in a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:7] And those who disbelieve say, that is, some of them say to others in order to provoke disbelief [in them]: ‘Shall we show you a man — namely, Muhammad (s) — who will inform you that when you have been utterly torn to pieces you shall indeed be created anew?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) the disbelievers of Mecca: Abu Sufyan and his host (say) to the lowly among people: (Shall we show you a man who will tell you (that) when ye have become dispersed in dust with most complete dispersal) such that the skin and bones are separated from each other, (still, even then), Muhammad claims (ye will be created anew) the spirit will be given back to us after death? 483\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمع المشركون عن رسول الله صلى الله عليه وسلم من أحوال الحشر والنشر والمعاد الجسماني، وأهوال الفزع الأكبر { قَالَ ٱلَّذِينَ كَفَرُواْ } أي: بعض لبعض على سبيل الاستهزاء والتهكم مع رسول الله صلى الله عليه وسلم مستفهمين مستنكرين، متعجبين من قوله: { هَلْ نَدُلُّكُمْ عَلَىٰ رَجُلٍ } يعنون الرسول صلى الله عليه وسلم، وإنما أنكروه لاستبعادهم قوله إنكارهم على مقوله، وإنما يتحدثون به بينهم؛ لغرابته { يُنَبِّئُكُمْ } بالمحال العجيب ويخبركم بالممتنع الغريب معتقداً إمكانه، بل جازماً بوقوعه ووجوده، وهو أنكم { إِذَا مُزِّقْتُمْ } وفُرقتم { كُلَّ مُمَزَّقٍ } أي: تفريقاً بليغاً وتشتيتاً شديداً، إلى حيث صرتم هباء تذهب به الرياح { إِنَّكُمْ } بعدما صرتم كذلك { لَفِي خَلْقٍ جَدِيدٍ } [سبأ: 7] على النحو الذي كنتم عليها في حياتكم قبل موتكم بلا تفاوت، كما يتجدد الأعراض بأمثالها\n\n\n\n\nبعدما سمعتم قوله هذا، كيف تتفكرون في شأن هذا الرجل الذي يدعي النبوة والوحي والرسالة من عند الحكيم العليم، مع أنه صدر عنه أمثال هذه المستحيلات، أي شيء تظنون في أمره هذا؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذا }: العامل فيه محذوف، دلّ عليه: { لفي خلق جديد }\n و { مُمَزَّقٍ }: مصدر، أي: تجددون إذا مزقتم كل تمزيق، و { جديد }: فعيل بمعنى فاعل، عند البصريين\n تقول: جَدَّ الثوب فهو جديد، أو بمعنى مفعول، كقتيل، من جد النساج الثوب: قطعه\n ولا يجوز فتح { إنكم } للاّم في خبره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:19",
      "similarity": 0.7031670603361645
    },
    {
      "verse": "61:10",
      "similarity": 0.2563868402384335
    },
    {
      "verse": "32:10",
      "similarity": 0.244519303113053
    },
    {
      "verse": "25:45",
      "similarity": 0.24053077284857938
    },
    {
      "verse": "35:16",
      "similarity": 0.2334874198099447
    }
  ]
}