{
  "chapter": "سبإ",
  "text": "افترى على الله كذبا ام به جنةۢ بل الذين لا يؤمنون بالءاخرة فى العذاب والضلل البعيد",
  "translations": [
    {
      "translation": "Has he invented a lie against Allah or is he possessed?' No indeed! Those who do not believe in the Next World are in punishment and deeply misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he fabricated a lie about God, or is he possessed?\" Not so; but those who believe not in the Hereafter are themselves afflicted and far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he forged a lie against Allah, or is he afflicted with madness?” Nay, but those who do not believe in the Hereafter are doomed to be chastised and are far gone in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he invented this falsehood against God or is he possessed by jinn?\" However, those who do not have any faith in the life to come will suffer torment for their serious error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Has he fabricated a lie against Allah, or is he insane?” Rather those who disbelieve in the Hereafter are in the punishment and extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he invented a lie against Allah, or is there a madness in him Nay, but those who disbelieve in the Hereafter are (themselves) in a torment, and in far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forged a lie against Allah or there is madness in him. Nay! those who do not believe in the hereafter are in torment and in great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has he forged against God a lie, or is he possessed? Not so; but those who believe not in the Hereafter are in chastisement and far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath he invented a lie concerning Allah, or is there in him a madness? Nay, but those who disbelieve in the Hereafter are in torment and far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he invented a lie about God, or is he afflicted with madness?\" Indeed no. It is those who do not believe in the Hereafter who will suffer torment, for they have strayed far into error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath he fabricated a lie against Allah, or is therein him a madness? Nay, but those who disbelieve in the Hereafter are themselves in a torment and error far-reaching:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he fabricated a lie against Allah, or is there a madness in him?’ Indeed, those who do not believe in the Hereafter languish in punishment and extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he invented a falsehood against Allah, or has a spirit (seized) him?\"- Nay, it is those who believe not in the Hereafter, that are in (real) Penalty, and in farthest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he (Muhammad SAW) invented a lie against Allah, or is there a madness in him? Nay, but those who disbelieve in the Hereafter are (themselves) in a torment, and in far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has he forged a lie about Allah, or is he mad' No, those who do not believe in the Everlasting Life are in the punishment and in far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did he invent a lie about God, or is there madness in him?” Indeed, those who do not believe in the Hereafter are in torment, and far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he invented about Allah a lie or is there in him madness?\" Rather, they who do not believe in the Hereafter will be in the punishment and [are in] extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:8] Has he invented (read a’ftarā; the hamza, read with a fatha vowelling, is for the interrogative and suffices in place of the conjunctive hamza) a lie against God, in this [respect], or is there a madness in him, [does he suffer] a dementia on account of which he has imagined that? God, exalted be He, says: Nay, but those who do not believe in the Hereafter, that comprises resurrection and chastisement, will be in the chastisement, thereat, and in error that is far, from the truth, in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَفْتَرَى عَلَى اللَّهِ كَذِبًا أَمْ بِهِ جِنَّةٌ بَلِ الَّذِينَ لَا يُؤْمِنُونَ بِالْآَخِرَةِ فِي الْعَذَابِ وَالضَّلَالِ الْبَعِيدِ (8)ويرجح ذلك إتمامها بالاستفهام { أفترى على الله كذباً أم به جنة } .ثم إن كان التقاول بين المشركين بعضِهم لبعض ، فالتعبير عن الرسول صلى الله عليه وسلم ب { رجل } منكَّر مع كونه معروفاً بينهم وعن أهل بلدهم ، قصدوا من تنكيره أنه لا يعرف تجاهلاً منهم . قال السكاكي «كأنْ لم يكونوا يعرفون منه إلا أنه رجل ما» .وإن كان قول المشركين موجهاً إلى الواردين مكّة في الموسم ، كان التعبير ب { رجل } جرياً على مقتضى الظاهر لأن الواردين لا يعرفون النبي صلى الله عليه وسلم ولا دعوتَه فيكون كقول أبي ذَرّ ( قبل إسلامه ) لأخيه «اذهب فاستعلم لنا خبر هذا الرجل الذي يزعم أنه نبيء» .ومعنى : { ندلكم } نُعرفكم ونُرشدكم . وأصل الدلالة الإِرشاد إلى الطريق الموصل إلى مكان مطلوب . وغالب استعمال هذا الفعل أن يكون إرشادَ من يطلبُ معرفةً ، وبذلك فالآية تقتضي أن هذا القول يقولونه للذين يسألونهم عن خبر رجل ظهر بينهم يدّعي النبوءة فيقولون : هل ندلكم على رجل يزعم كذا ، أي ليس بنبيء بل مُفْترٍ أو مجنون ، فمورد الاستفهام هو ما تضمنه قولهم : { إذا مزقتم كل ممزق إنكم لفي خلق جديد أفترى على الله كذباً أم به جنة } أي هل تريدون أن ندلكم على من هذه صفته ، أي وليس من صفته أنه نبيء بل هو : إما كاذب أو غير عاقل .والإِنباء : الإِخبار عن أمر عظيم ، وعظمةُ هذا القول عندهم عظمة إقدام قائله على ادعاء وقوع ما يرونه محال الوقوع .وجملة { إنكم لفي خلق جديد } هي المنبَّأُ به . ولمّا كان الإِنباء في معنى القول لأنه إخبار صح أن يقع بعده ما هو من قول المنبِّىء . فالتقدير من جهة المعنى : يقول إنكم لفي خلق جديد ، ولذلك اجتلبت ( إنَّ ) المكسورة الهمزة دون المفتوحة لمراعاة حكاية القول .وهذا حكاية ما نبَّأ به لأن المنبىء إنما نَبّأ بأن الناس يصيرون في خلق جديد .وأما شبه الجملة وهو قوله : { إذا مزقتم كل ممزق } فليس مما نَبَّأ به الرجلُ وإنما هو اعتراض في كلام الحاكين تنبيهاً على استحالة ما يقوله هذا الرجل على أنّه لازم لإِثبات الخلق الجديد لكل الأموات . وليس { إذَا } بمفيد شرطاً للخلق الجديد لأنه ليس يلزم للخلق الجديد أن يتقدمه البِلى ، ولكن المراد أنه يكون البِلى حائلاً دون الخلق الجديد المنبَّأ به .وتقديم هذا الاعتراض للاهتمام به ليتقرر في أذهان السّامعين لأنه مناط الإِحالة في زعمهم ، فإن إعادة الحياة للأموات تكون بعد انعدام أجزاء الأجساد ، وتَكون بعد تفرقها تفرقاً قريباً من العدم ، وتَكون بعدَ تفرق مَّا ، وتَكون مع بقاء الأجساد على حالها بقاء متفاوتاً في الصلابة والرطوبة ، وهم أنكروا إعادة الحياة في سائر الأحوال ، ولكنهم خَصُّوا في كلامهم الإِعادة بعد التمزق كل ممزق ، أي بعد اضمحلال الأجساد أو تفرقها الشديد ، لقوة استحالة إرجاع الحياة إليها بعدئذٍ .والتمزيق : تفكيك الأجزاء المتلاصقة بعضها عن بعض بحيث تصير قطعاً متباعدة .والممزَّق : مصدر ميمي لمزَّقه مثل المسرَّح للتسريح .و { كل } على الوجهين مستعملة في معنى الكثرة كقوله تعالى : { ولو جاءتهم كل آية } \\[ يونس : 97 \\] وقول النابغة: ... بها كل ذيّال. . . . . . . . . . . . . . . . . . . . . . ... وقد تقدم غير مرة .والخلق الجديد : الحديث العهد بالوجود ، أي في خلق غير الخلق الأول الذي أبلاه الزمان ، فجديد فعيل من جَدّ بمعنى قطع . فأصل معنى جديد مقطوع ، وأصله وصف للثوب الذي ينسجه الناسج فإذا أتمه قطعه من المنوال . أريد به أنه بحدثان قطعه فصار كناية عن عدم لبسه ، ثم شاع ذلك فصار الجديد وصفاً بمعنى الحديث العهد ، وتنوسي معنى المفعولية منه فصار وصفاً بمعنى الفاعلية ، فيقال : جَدّ الثوب بالرقع ، بمعنى : كان حديث عهد بنسج . ويشبه أن يكون ( جد ) اللازم مطاوعاً ل ( جدّه ) المتعدّي كما كان ( جَبر العظمُ ) مطاوعاً ل ( جبر ) كما في قول العجاج: ... قد جبر الدينَ الإِله فجَبروبهذا يحق الجمع بين قول البصريين الذين اعتبروا جديداً فعيلاً بمعنى فاعل ، وقول الكوفيين بأنه فعيل بمعنى مفعول ، وعلى هذين الاعتبارين يجوز أن يقال : ملحفة جديد كما قال : { إن رحمة الله قريب } \\[ الأعراف : 56 \\] .ووصف الخلق الجديد باعتبار أن المصدر بمنزلة اسم الجنس يكون قديماً فهو إذن بمعنى الحاصل بالمصدر ، ويكون جديداً فهو بمنزلة اسم الفاعل ، فوصف بالجديد ليتمحّض لأحد احتماليه ، والظرفية من قوله : { في خلق جديد } مجازية في قوة التلبس بالخلق الجديد تلبساً كتلبس المظروف بالظرف .وجملة { أفترى على الله كذباً أم به جنة } في موضع صفة ثانية ل { رجل } أتوا بها استفهامية لتشريك المخاطبين معهم في ترديد الرجل بين هذين الحالين .وحذفت همزة فعل { أفترى } لأنها همزة وصل فسقطت لأن همزة الاستفهام وُصلت بالفعل فسقطت همزة الوصل في الدرج .وجعلوا حال الرسول صلى الله عليه وسلم دائراً بين الكذب والجنون بناء على أنه إن كان ما قاله من البعث قاله عن عمد وسلامة عقل فهو في زعمهم مفتر لأنهم يزعمون أن ذلك لا يطابق الواقع لأنه محال في نظرهم القاصر ، وإن كان قاله بلسانه لإِملاء عقل مختلّ فهو مجنون وكلام المجنون لا يوصف بالافتراء . وإنما ردَّدوا حاله بين الأمرين بناء على أنه أخبر عن تلقي وحي من الله فلم يبق محتملاً لقسم ثالث وهو أن يكون متوهماً أو غالطاً كما لا يخفى .وقد استدل الجاحظ بهذه الآية لرأيه في أن الكلام يصفه العرب بالصدق إن كان مطابقاً للواقع مع اعتقاد المتكلم لذلك ، وبالكذب إن كان غير مطابق للواقع ولا للاعتقاد ، وما سوى هذين الصنفين لا يوصف بصدق ولا كذب بل هو واسطة بينهما وهو الذي يخالف الواقع ويوافق اعتقاد المتكلم أو يخالف الاعتقاد الواقع أو يخالفهما معاً ، أو لم يكن لصاحبه اعتقاد ، ومن هذا الصنف الأخير كلام المجنون .ولا يصح أن تكون هذه الآية دليلاً له لأنها حكت كلام المشركين في مقام تمويههم وضلالهم أو تضليلهم فهو من السفسطة ، ثم إن الافتراء أخص من الكذب لأن الافتراء كان عن عمد فمقابلته بالجنون لا تقتضي أن كلام المجنون ليس من الكذب بل إنه ليس من الافتراء .والافتراء : الاختلاق وإيجاد خبر لا مخبر له . وقد تقدم عند قوله تعالى : { ولكن الذين كفروا يفترون على اللَّه الكذب } في سورة العقود ( 103 ) .وقد ردّ الله عليهم استدلالهم بما أشار إلى أنهم ضالّون أو مُضِلُّون ، وواهِمون أو مُوهِمون فأبطل قولهم بحذافره بحرف الإِضراب ، ثم بجملة الذين لا يؤمنون بالآخرة في العذاب والضلال البعيد } . فقابل ما وصَفوا به الرسول صلى الله عليه وسلم بوصفين : أَنهم في العذاب وذلك مقابل قولهم : { أفترى على الله كذباً } لأن الذي يكذب على الله يسلِط الله عليه عذابه ، وأنهم في { الضلال البعيد } وذلك مقابل قولهم : { به جنة } .وعدل عن أن يقال : بل أنتم في العذاب والضلال إلى { الذين لا يؤمنون بالآخرة } إدماجاً لتهديدهم .و { الضلال } : خطأ الطريق الموصّل إلى المقصود . و { البعيد } وصف به الضلال باعتبار كونه وصفاً لطريق الضالّ ، فإسناد وصفه إلى الضلال مجازي لأنه صفة مكان الضلال وهو الطريق الذي حاد عن المكان المقصود ، لأن الضالّ كلما توغّل مسافة في الطريق المضلول فيه ازداد بُعداً عن المقصود فاشتد ضلاله ، وعسر خلاصه ، وهو مع ذلك ترشيح للإِسناد المجازي .وقوله : { في العذاب } إدماج يصف به حالهم في الآخرة مع وصف حالهم في الدنيا .والظرفية بمعنى الإِعداد لهم فحصل في حرف الظرفية مجازان إذا جُعِل العذاب والضلال لتلازمهما كأنهما حاصلان معاً ، فهذا من استعمال الموضوع للواقع فيما ليس بواقع تنبيهاً على تحقيق وقوعه .\n\n",
      "translations": [
        {
          "translation": "(Hath he) Muhammad (invented a lie concerning Allah, or is there in him a madness?) Allah said: (Nay, but those who disbelieve in the Hereafter) those who disbelieve in resurrection after death (are in torment) in the Hereafter (and far error) from the Truth and guidance in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفْتَرَىٰ } وكذب عن عمد ونسبه { عَلَى ٱللَّهِ كَذِباً } تغريراً وتلبيساً على ضعفاء الأنام\n ليقبلوا منه أمثال هذه الخرافات\n ويعتقدوه رسولاً مخبراً عن المغيبات وعجائب الأمور وغرائبه { أَم بِهِ جِنَّةٌ } خبط واختلال يعرض في دماغه\n فيتكلم بأمثال هذه الهذيانات هفوة بلا قصد وشعور بها\n كما يتكلم بأمثاله سائر المجانين\n وسماه وحياً وإلهاماً؟!\n\nثم لما بالغ المشركون في قدحه صلى الله عليه وسلم وتجهيله\n رد الله عليهم بأنه لا افتراء في كلامه صلى الله عليه وسلم وإخباره\n ولا خبط في عقله\n إذ هو صلى الله عليه وسلم من أعقل الناس وأبعدهم عن الافتراء والمراء وأسلمهم عن الكذب وجميع الكدورات الطبيعية مطلقاً { بَلِ } الكافرون الضالون { ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } والأمور التي أخبر الله بوقوعها فيها\n ولا يصدقون أيضاً بما نطق به الكتب والرسل\n مخلدون في النشأة الأخرى { فِي ٱلْعَذَابِ } المؤبد المخلد { وَ } متوغلون في { ٱلضَّلاَلِ ٱلْبَعِيدِ } [سبأ: 8] عن الهداية أبد الآباد\n لا نجاة لهم منها\n ومن شدة غيَّهم وضلالهم تكلموا بأمثال هذه الهذيانات الباطلة بالنسبة إلى من هو منزه عن أمثالها مطلقاً\n\n\nثم أشار سبحانه إلى كمال قدرته واقتداره على انتقام المكذبين ليوم الحشر والجزاء والمفترين على رسوله صلى الله عليه وسلم على سبيل الجزاء من الخبط والجنون\n وغير ذلك من الأمور التي لا يليق بشأنه صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أَفْترى }: الهمزة للاستفهام\n وحذفت همزة الوصل للآستغناء عنها\n يقول الحق جلّ جلاله: { وقال الذين كفروا } من منكري البعث: { هل نَدلُّكم على رجلٍ } يعنون محمداً صلى الله عليه وسلم\n وإنما نكّروه ـ مع أنه كان مشهوراً عَلَماً في قريش\n وكان إنباؤه بالبعث شائعاً عندهم ـ تجاهلاً به وبأمره\n وباب التجاهل في البلاغة معلوم\n دال على سِحْرها\n { يُنَبئُكم إِذا مُزِّقْتمْ كلَّ مُمزَّقٍ إِنكم لفي خلقٍ جديدٍ } أي: يحدثكم بأعجوبة من الأعاجيب\n إنكم تُبعثون وتنشئون خلقاً جديداً\n بعد أن تكونوا رفاتاً وتراباً\n وتمزق أجسادكم بالبلى\n كل تمزيق\n وتفرقون كل تفريق\n { افْترَى على الله كذباً } أي: أهو مفترٍ على الله كذباً فيما يُنسب إليه من ذلك؟ { أم به جِنَّة } جنون توهمه ذلك\n وتلقيه على لسانه\n واستدلت المعتزلة بالآية على أن بين الصدق والكذب واسطة\n وهو كل خبر لا يكون عن بصيرة بالمخبر عنه\n وأجيب: بأن الافتراء أخص من الكذب\n لاختصاص الافتراء بالتعمُّد\n والكذب أعم\n وكأنه قيل: أتعمّد الكذب أو لم يتعمّد بل به جنون\n  قال تعالى: { بل الذين لا يؤمنون بالآخرة في العذاب والضلالِ البعيدِ } أي: ليس محمد من الافتراء والجنون في شيء\n وهو منزّه عنهما\n بل هؤلاء الكفرة\n المنكرون للبعث\n واقعون في عذاب النار\n وفيما يؤديهم إليه من الضلال البعيد عن الحق\n بحيث لا يرجى لهم الخلاص منه\n وهم لا يشعرون بذلك\n وذلك أحق بالجنون\n جُعل وقوعهم في العذاب رسيلاً لوقوعهم في الضلال\n مبالغة في استحقاقهم له\n كأنهما كائنان في وقتٍ واحد لأن الضلال\n لمّا كان العذاب من لوازمه\n جُعلا كأنهما مقترنان\n ووَصْف الضلال بالبعيد من الإسناد المجازي لأنَّ البعيد في صفة الضالّ إذا بَعُدَ عن الجادة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:94",
      "similarity": 0.5497237651980258
    },
    {
      "verse": "16:105",
      "similarity": 0.5362542908249123
    },
    {
      "verse": "32:3",
      "similarity": 0.5047456606303558
    },
    {
      "verse": "6:24",
      "similarity": 0.4619780755372579
    },
    {
      "verse": "23:38",
      "similarity": 0.4559946200399793
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/034008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/034008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/34:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}