{
  "chapter": "سبإ",
  "text": "افلم يروا۟ الى ما بين ايديهم وما خلفهم من السماء والارض ان نشا نخسف بهم الارض او نسقط عليهم كسفا من السماء ان فى ذلك لءاية لكل عبد منيب",
  "translations": [
    {
      "translation": "Have they not looked at the sky and the earth in front of them and behind them? If We willed We would cause the earth to swallow them up or make great lumps fall down on them from the sky. There is certainly a Sign in that for every remorseful slave.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see what is before them and what is behind them of the heavens and the earth? We could cleave the earth and sink them, if We pleased, or drop a fragment of the sky upon them. There is surely a sign in this for every penitent creature.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how the heavens and the earth encompass them from the front and the rear? We could, if We so wished, cause the earth to swallow them or let fragments of the sky fall upon them. Verily there is a Sign in this for every servant (of Allah) who penitently turns to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the heavens and the earth in front and behind them. Had We wanted, We could have caused the earth to swallow them up or made a part of the sky fall upon them. In this there is evidence (of the truth) for every repenting person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So did they not see what is before them and what is behind them in the sky and the earth? If We will, We can bury them into the earth or cause a part of the sky to fall on them; indeed in this is a sign for every repentant bondman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not what is before them and what is behind them, of the heaven and the earth If We will, We shall sink the earth with them, or cause a piece of the heaven to fall upon them. Verily, in this is a sign for every servant who turns (to Allah) in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then consider what is before them and what is behind them of the heaven and the earth? If We please We will make them disappear in the land or bring down upon them a portion from the heaven; most surely there is a sign in this for every servant turning (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded what lies before them and what lies behind them of heaven and earth? Did We will, We would make the earth to swallow them, or We would drop down on them lumps from heaven. Surely in that is a sign to every penitent servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed what is before them and what is behind them of the sky and the earth? If We will, We can make the earth swallow them, or cause obliteration from the sky to fall on them. Lo! herein surely is a portent for every slave who turneth (to Allah) repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not observe how they are encompassed by what is before them and what is behind them in heaven and on earth? We could, if We pleased, cause the earth to swallow them up, or cause a piece of the sky to fall upon them. In that certainly there is a sign for every servant of Ours who turns to us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold they not that which is before them and that which is behind them of the heaven and the earth If We will, We shall sink the earth with them or cause a fragment of the heaven to fall on them. Verily therein is a sign Unto every repentant bondman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded that which is before them and that which is behind them of the sky and the earth? If We like, We can make the earth swallow them, or let a fragment from the sky fall on them. There is indeed a sign in that for every penitent servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not what is before them and behind them, of the sky and the earth? If We wished, We could cause the earth to swallow them up, or cause a piece of the sky to fall upon them. Verily in this is a Sign for every devotee that turns to Allah (in repentance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not what is before them and what is behind them, of the heaven and the earth? If We will, We shall sink the earth with them, or cause a piece of the heaven to fall upon them. Verily, in this is a sign for every faithful believer that [believes in the Oneness of Allah], and turns to Allah (in all affairs with humility and in repentance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen what is before them and behind them in heaven and earth? If We willed, We would make the earth swallow them up, or We would let lumps from heaven fall down on them. Surely, there is a sign in this for every penitent worshiper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect upon what lies before them and behind them, of the heaven and the earth? If We will, We can make the earth cave in beneath them, or make pieces of the sky fall down on them. In that is a sign for every devout servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, do they not look at what is before them and what is behind them of the heaven and earth? If We should will, We could cause the earth to swallow them or [could] let fall upon them fragments from the sky. Indeed in that is a sign for every servant turning back [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[34:9] Have they not observed what is before them and what is behind them, in other words, what is above them and what is beneath them, of heaven and earth? If We will [it], We can make the earth swallow them or let fall on them fragments (read kisfan or kisafan: ‘large pieces’) from the heaven (a variant reading has the third person singular for all three verbs [sc. yashā’, ‘He will’, yakhsif, ‘He makes to swallow’, yusqit, ‘He lets fall’]). Surely in that, which is observed, there is a sign for every penitent servant, turning back to his Lord, [signs] indicating God’s power to resurrect and to do what He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not observed) i.e. the disbelievers of Mecca (what is before them) what is above and below them of the sky and the earth (and what is behind them) and what is above and below them (of the sky and the earth? If We will, We can make the earth swallow them, or cause obliteration from the sky to fall on them) and thus destroy them. (Lo! herein) in what I have mentioned concerning the sky and the earth (surely is a portent) a lesson (for every slave who turneth (to Allah) repentant) who hastens to Allah and to His obedience.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى كمال قدرته واقتداره على انتقام المكذبين ليوم الحشر والجزاء والمفترين على رسوله صلى الله عليه وسلم على سبيل الجزاء من الخبط والجنون، وغير ذلك من الأمور التي لا يليق بشأنه صلى الله عليه وسلم، فقال مستفهماً على سبيل التقريع والتوبيخ: { أَ } عموا وفقدوا أبصارهم أولئك المعاندون { فَلَمْ يَرَوْاْ } ولم ينظروا ويبصروا { إِلَىٰ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ مِّنَ ٱلسَّمَآءِ } المحيط بهم خلفاً ووراء { وَٱلأَرْضِ } الممهدة لهم بين أيديهم، يتمكنون عليها ويتنعمون بمستخرجاتها وبما نزل عليها من السماء، ولم تتفكروا وتتأملوا أن إحياء الموتى أهون من خلق السماوات العلا على إيجادهما أكمل من القدرة على إعادة المعدوم، فينكروا قدرتنا عليها مع أنهم يرون منا أمثال هذه المقدورات، ولم يخافوا من بطشنا وانتقامنا، ولم يعلموا أنَّا من مقام قهرنا وجودنا وجلالنا { إِن نَّشَأْ } إهلاكهم واستئصالهم { نَخْسِفْ بِهِمُ ٱلأَرْضَ } كما خسفنا على قارون وأمثاله { أَوْ نُسْقِطْ عَلَيْهِمْ كِسَفاً } بالتحريك والتسكين على القراءتين؛ أي: قطعاً { مِّنَ ٱلسَّمَآءِ } فنهلكهم بها { إِنَّ فِي ذَلِكَ } البيان على وجه التقريع والتعبير { لآيَةً } دالة على قدرتنا وقهرنا على انتقام من خرج عن ربقة عبوديتنا { لِّكُلِّ عَبْدٍ } تحقق بمقام العبودية وفوض أموره كلها إليها { مُّنِيبٍ } [سبأ: 9] رجع إلينا وهرب عن مقتضيات قهرنا وجلالنا، بعدما عرف أن الكل منا بدأ، ويحولنا وقوتنا ظهر وعاد أيضاً كما بدأ؛ إذ منا المبدأ وإلينا المنتهى، وليس وراءنا مقصد ومرمى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفلم يَرَوا إِلى ما بين أيديهم وما خلفَهُم من السماءِ والأرض إِن نشأ نَخْسِفُ بهم الأرضَ أو نُسْقِطْ عليهم كِسَفاً من السماء } أي: أعموا فلم ينظروا إلى السماء والأرض، وأنهما أينما كانوا، وحيثما ساروا، وجدوهما أمامهم وخلفهم، محيطتان بهم، لا يقدرون أن ينفذوا من أقطارهما، وأن يخرجوا عما هم فيه، من ملكوت الله، ولم يخافوا أن يخسفَ الله بهم في الأرض، أو يسقط عليهم { كِسفاً } قطعة، أو قطعاً من السماء بتكذيبهم الآيات، وكفرهم بما جاء به الرسول، كما فعل بقارون وأصحاب الأيكة\n وقرأ حمزة والكسائي \" يخسف \" ، و \" يسقط \" بالياء لعود الضمير على الله في قوله: { أَفترى على الله } ، وقرأ حفص: \" كَسَفاً \" بالتحريك، جمعاً\n\n\n{ إِن في ذلك لآيةً } إن في النظر إلى السماء والأرض والتفكُّر فيهما، وما يدلان عليه من كمال قدرته تعالى لدلالةً ظاهرة على البعث والإنشاء من بعد التفريق، { لكل عبدٍ مُّنِيب } راجع بقلبه إلى ربه، مطيع له تعالى، إذ المنيب لا يخلو من النظر في آيات الله، فيعتبر، ويعلم أن مَن قدر على إنشاء هذه الأجرام العظام، قادر على إحياء الأموات وبعثها، وحسابها وعقابها\n الإشارة: يقول شيوخ التربية: بقدر ما يمزق الظاهر بالتخريب والإهمال يحيى الباطن ويعمر بنور الله، وبقدر ما يعمر الظاهر يخرب الباطن، فيقع الإنكار عليهم، ويقول الجهلة: هل ندلكم على رجل يُنبئكم إذا مُزقتم في الظاهر كل مُمَزقٍ، يُجدد الإيمان والإحسان في بواطنكم، أَفْترى على الله كذباً أم به جِنة؟ بل الذين لا يؤمنون بالنشأة الآخرة ـ وهي حياة الروح بمعرفة الله ـ في عذاب الحجاب والضلال، عن معرفة العيان بعيد، ما داموا على ذلك الاعتقاد، ثم يهددون بما يُهدد به منكرو البعث\n والله تعالى أعلم\n ثم ذكر تعالى نعمته على داود وسليمان، احتجاجاً على ما منح محمد ـ عليه الصلاة والسلام ـ من الرسالة والوحي، ردًّا لقولهم: { أَفترى على الله كذباً } ، ودلالة على قدرته تعالى على البعث وغيره\n فقال: { وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا فَضْلاً\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:187",
      "similarity": 0.7339234701176359
    },
    {
      "verse": "17:92",
      "similarity": 0.6873961544707164
    },
    {
      "verse": "52:44",
      "similarity": 0.5040805952242259
    },
    {
      "verse": "7:149",
      "similarity": 0.3792596676904458
    },
    {
      "verse": "75:8",
      "similarity": 0.3456672800078217
    }
  ]
}