{
  "chapter": "فاطر",
  "text": "ان تدعوهم لا يسمعوا۟ دعاءكم ولو سمعوا۟ ما استجابوا۟ لكم ويوم القيمة يكفرون بشرككم ولا ينبئك مثل خبير",
  "translations": [
    {
      "translation": "If you call on them they will not hear your call, and were they to hear, they would not respond to you. On the Day of Rising they will reject your making associates of them. No one can inform you like One who is All- aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You pray to them, but they do not hear your call; and even if they heard you, they could not answer your prayer; and on the Day of Resurrection they will deny your having worshipped them. None can acquaint you (with the reality) as He who is informed of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call upon them, they cannot hear your prayer. And if they hear it, they cannot answer it. On the Day of Resurrection they will disown you for associating others with Allah in His Divinity. No one can inform you of the truth save the All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not listen to your prayers if you pray to them. Even if they would listen, they would not be able to answer you. On the Day of Judgment they will reject your worship of them. Not even an expert reporter can tell you the truth in the way that God can do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them, they do not hear your call; and supposedly if they heard it, they cannot fulfil your needs; and on the Day of Resurrection they will deny your ascribed partnership; and none will inform you like Him Who informs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you invoke them, they hear your call; and if (in case) they were to hear, they could not grant it to you. And on the Day of Resurrection, they will disown your worshipping them. And none can inform you like Him Who is the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call on them they shall not hear your call, and even if they could hear they shall not answer you; and on the resurrection day they will deny your associating them (with Allah); and none can inform you like the One Who is Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call upon them, they will not hear your prayer, and if they heard, they would not answer you; and on the Day of Resurrection they will disown your partnership. None can tell thee like One who is aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye pray unto them they hear not your prayer, and if they heard they could not grant it you. On the Day of Resurrection they will disown association with you. None can inform you like Him Who is Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if you invoke them, they do not hear your call; and even if they could hear, they would not respond to you. And on the Day of Resurrection they will disown your having associated them with God. No one can tell you [the Truth] like the One who is all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye call Unto them, they hear not your calling, and even if they heard, they could not answer you. On the Day of Judgment they will deny your associating. And none can declare Unto thee the truth like Him who is Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you invoke them they will not hear your invocation, and even if they heard they cannot respond to you, and on the Day of Resurrection they will forswear your polytheism, and none can inform you like the One who is all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye invoke them, they will not listen to your call, and if they were to listen, they cannot answer your (prayer). On the Day of Judgment they will reject your \"Partnership\". and none, (O man!) can tell thee (the Truth) like the One Who is acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you invoke (or call upon) them, they hear not your call, and if (in case) they were to hear, they could not grant it (your request) to you. And on the Day of Resurrection, they will disown your worshipping them. And none can inform you (O Muhammad SAW) like Him Who is the AllKnower (of each and everything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you supplicate to them they cannot hear your supplication, and if they heard, they cannot answer you. On the Day of Resurrection they will disown your associating. None can tell you like He who is the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you pray to them, they cannot hear your prayer. And even if they heard, they would not answer you. And on the Day of Resurrection, they will reject your partnership. None informs you like an Expert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association. And none can inform you like [one] Acquainted [with all matters].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:14] If you call on them, they will not hear your call, and [even] if they heard —hypothetically [speaking] — they would not [be able to] respond to you; and on the Day of Resurrection they will disown your [idolatrous] associations, in other words, your associating them with God [in power], that is to say, they will declare themselves innocent of you and of your worship of them. And none can inform you, about the state in the two abodes, like One Who is Aware, Knower, and this is God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If ye pray unto them) i.e. the deities (they hear not your prayer) because they are deaf and dumb, (and if they heard they could not grant it you) because they despise you. (On the Day of Resurrection they will disown association with you) the deities will absolve themselves from you for associating them as partners with Allah and for worshipping them beside Allah. (None can Inform you) of them and their works (like Him Who is Aware) i.e. Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَوْمَ ٱلْقِيَامَةِ يَكْفُرُونَ بِشِرْكِـكُمْ } معناه يَتبرؤن منكم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd on the Day of Judgment, they will reject your {false} gods.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لكونهم جمادات لا شعور لهم أصلاً إلى حيث { إِن تَدْعُوهُمْ } وتلتجئوا نحوهم { لاَ يَسْمَعُواْ دُعَآءَكُمْ } إذ ليس لهم قابلية السماع والاستماع { وَلَوْ سَمِعُواْ } يعني: لو فُرض أنه سمعوا على سبيل الفرض المحال { مَا ٱسْتَجَابُواْ لَكُمْ } إذ ليس لهم القدرة والإرادة والأوصاف الكاملة اللازمة للألوهية والربوبية { وَ } مع عدم نفعهم إياكم أنتم أيها الجاهلون { يَوْمَ ٱلْقِيَامَةِ يَكْفُرُونَ } ويؤاخذون { بِشِرْكِـكُمْ } وإشراككم\n أي: اتخاذكم إياهم شركاء مع الله\n وهم يتبرءون عنكم وأنتم عنهم { وَلاَ يُنَبِّئُكَ } ويخبرك أيها المخاطب النبيه الفطن أحوال النشأة الأخرى\n وما سيجري بينك وبين شركائك من البراءة والملاعنة { مِثْلُ خَبِيرٍ } [فاطر: 14] وهو الله العليم الحكيم\n الذي لا يعزب عن إحاطة حضرة علمه مثقال ذرة في الأرض ولا في السماء\n لا في الأولى ولا في الأخرى\n وعنده مفاتح الغيب ومقاليد الأمور لا يعلمها إلاَّ هو",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن تدْعُوهُم } أي: الأصنام { لا يسمعوا دعاءَكم } لأنهم جماد\n { ولو سَمِعُوا } على سبيل الفرض { ما استجابوا لكم } لأنهم لا يدّعون ما تدّعون لهم من الإلهية\n بل يتبرؤون منها\n { ويومَ القيامة يكفرون بشِرْكِكم } بإشراككم لهم\n وعبادتكم إياهم\n ويقولون:\n[يونس: 28]\n { ولا يُنبئك مِثْلُ خبيرٍ } أي: ولا يخبرك بالأمر على حقيقته مخبر مثل خبير به\n وهو الله تعالى فإنه خبير به على الحقيقة\n دون سائر المخبرين\n والمراد: تحقيق ما أخبر به من حال آلهتهم\n ونفي ما يدعون لها\n أو: ولا يخبرك أيها المفتون بأسباب الغرور\n كما ينبئك الله الخبير بخبايا الأمور وتحقيقها\n أي: لا يخبرك بالأمور مخبر هو خبير عالم به\n يريد أنَّ الخبير بالأمور وحده هو الذي يُخبرك بالحقيقة\n دون سائر المخبرين\n والمعنى: أنَّ هذا الذي أخبرتكم به من حال الأوثان هو الحق أنه خبيرٌ بما أخبرتُ به\n والله تعالى أعلم\n الإشارة: قال الشيخ: أبو العباس المرسي رضي الله عنه: يُولج الليل في النهار\n ويولج النهارَ في الليل\n يُولج المعصية في الطاعة\n ويُولج الطاعة في المعصية\n يعمل العبد الطاعة فيُعجب بها\n ويعتمد عليها\n ويستصغر مَن لم يفعلها\n ويطلب من الله العوض عليها\n فهذه حسنات أحاطت بها سيئات\n ويُذنب العبدُ الذنبَ\n فيلتجىء إلى الله فيه\n ويعتذر منه\n ويستصغر نفسه\n ويُعظم مَن لم يفعله\n فهذه سيئة أحاطت بها حسنات\n فأيتهما الطاعة\n وأيتهما المعصية؟ هـ\n أو: يولج ليلَ القبض في نهار البسط\n وبالعكس\n أو: يولج ليلَ الحجبة في نهار الكشف\n ونهارَ الكشف في ليل القطيعة\n يتواردان إلى حال طلوع شمس العرفان\n فلا غروب لها\n كما قال الشاعر:\nقال القشيري: يُولج الليل في النهار\n تغلب النَّفسُ مرةً على القلب\n وبالعكس\n وكذلك القبضُ والبسط\n فقد يستويان\n وقد يغلب أحدُهما\n وكذلك الصحو والسُكْرُ\n والفناء والبقاء\n وآثار شموس التوحيد\n وأقمار المعرفة على ما يريد من إظهارها على القلوب\n فهذه كلها يولج أحدها في الآخر\n ولا يعرف هذا إلا مَن تحقق بفقره إلى الله تعالى\n كما قال: { يٰأَيُّهَا ٱلنَّاسُ أَنتُمُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:64",
      "similarity": 0.5744840967878517
    },
    {
      "verse": "7:194",
      "similarity": 0.5046106042287186
    },
    {
      "verse": "10:89",
      "similarity": 0.44512168706246297
    },
    {
      "verse": "46:5",
      "similarity": 0.41236017451597196
    },
    {
      "verse": "6:36",
      "similarity": 0.3988543164309745
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/035014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/035014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}