{
  "chapter": "فاطر",
  "text": "الحمد لله فاطر السموت والارض جاعل الملئكة رسلا او۟لى اجنحة مثنى وثلث وربع يزيد فى الخلق ما يشاء ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "Praise be to Allah, the Bringer into Being of the heavens and earth, He who made the angels messengers, with wings - two, three or four. He adds to creation in any way He wills. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL PRAISE BE to God, the originator of the heavens and the earth, who appointed angels as His messengers, with wings, two, three and four. He adds what He pleases to His creation. He has certainly power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise be to Allah, the Fashioner of the heavens and earth, Who appointed angels as His message bearers, having two, three, four wings. He adds to His creation whatever He pleases. Verily Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to God, the creator of the heavens and the earth who has made the angels Messengers of two or three or four wings. He increases the creation as He wills. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is to Allah, the Maker of the heavens and the earth, Who assigns angels as messengers – who have pairs of two, three, four wings; He increases in creation whatever He wills; indeed Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, Fatir of the heavens and the earth, Who made the angels messengers with wings, two or three or four. He increases in creation what He wills. Verily, Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, the Originator of the heavens and the earth, the Maker of the angels, apostles flying on wings, two, and three, and four; He increases in creation what He pleases; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to God, Originator of the heavens and earth, who appointed the angels to be messengers having wings two, three and four, increasing creation as He wills. Surely God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, the Creator of the heavens and the earth, Who appointeth the angels messengers having wings two, three and four. He multiplieth in creation what He will. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise be to God, Creator of the heavens and the earth, who made the angels His messengers, with wings -- two, or three, or four pairs. He adds to His creation whatever He wills; for God has the power to will anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise Unto Allah, the Creator Of the heavens and the earth, the Appointer of the angels as His messengers, with wings of twos and threes and fours. He addeth in creation what soever He listeth Verily Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to Allah, originator of the heavens and the earth, maker of the angels [His] messengers, possessing wings, two, three or four [of them]. He adds to the creation whatever He wishes. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, Who created (out of nothing) the heavens and the earth, Who made the angels, messengers with wings,- two, or three, or four (pairs): He adds to Creation as He pleases: for Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the praises and thanks be to Allah, the (only) Originator [or the (only) Creator] of the heavens and the earth, Who made the angels messengers with wings, - two or three or four. He increases in creation what He wills. Verily, Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs for Allah, the Originator of the heavens and earth, who appointed the angels to be Messengers, with wings, two, three, and four. He increases the creation as He wills. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, Originator of the heavens and the earth, Maker of the angels messengers with wings—double, triple, and quadruple. He adds to creation as He wills. God is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[All] praise is [due] to Allah, Creator of the heavens and the earth, [who] made the angels messengers having wings, two or three or four. He increases in creation what He wills. Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:1] Praise be to God, God praises Himself with in these [terms], as explained at the beginning of [the preceding] sūrat Saba’, Originator of the heavens and the earth, the One Who created them without any precedent, Appointer of the angels as messengers, to [His] prophets, having wings in [sets of] two or three or four. He multiplies in creation, in angels and other [creatures], what He will. Surely God has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said upon explaining Allah's words: (Praise be to Allah): '(Praise be to Allah) He says: gratitude and favour belong to Allah, (the Creator of the heavens and the earth, who appointeth the angels) Who created and honoured the angels and made them (messengers) i.e. He sends them with a message to His created beings; this refers to Gabriel, Michael, Seraphiel, the angel of death, thunder and the Guardian angels (having wings) i.e. the angels have wings (two, three and four) wings with which to fly. (He multiplieth in creation) in the creation of angels (what He will) it is also said that in those wings are what He wills; and it is also said: whomever He wills is in good fortune; and it is said that this means: whomsoever He wills has a good voice. (Lo! Allah is Able to do all things) of increase and decrease.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السَّلامُ في قولهِ: { ٱلْحَمْدُ للَّهِ فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه مُبتدئُ خَلقهَا\n\n\n\n\nوقوله تعالى: { يَزِيدُ فِي ٱلْخَلْقِ مَا يَشَآءُ } معناه يزيد في الأجنحةِ\n وقال في حُسنِ الصَّوتِ\n\n",
      "translations": [
        {
          "translation": "\n\nWe were told by Abu Jafar\n\n\nHe said: Ali ibn Ahmad narrated to us\n\n\nHe said: It was narrated to us by 'Ata' ibn al-Sa'ib from his father from Zayd ibn Ali, may peace be upon them, that he said regarding the words {Praise be to Allah, the Lord of the heavens and the earth}: \"This means that He is the One who created them.\"\n\n\nAnd His saying, \"He increases in creation what He wills,\" means that He increases in the number of His creatures.\n\n\nAnd he said in a beautiful voice,",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ جاعل الملائكة رسلاً أُولِي أجنحة } عن جهات التأثير الكائنة في الملكوت السماوية والأرضية بالأجنحة\n جعلها الله رسلاً مرسلة إلى الأنبياء بالوحي وإلى الأولياء بالإلهام وإلى غيرهم من الأشخاص الإنسانية وسائر الأشياء بتصريف الأمور وتدميرها\n فما يصل بتأثيرهم إلى ما يتأثر منه فهو جناح\n فكل جهة تأثير جناح مثلاً: إنّ العاقلتين العلمية والنظرية جناحان للنفس الإنسانية والمدركة والمحركة الباعثة والمحركة الفاعلة ثلاثة أجنحة للنفس الحيوانية والغاذية والنامية والمولدة والمصوّرة أربعة أجنحة للنفس النباتية\n ولا تنحصر أجنحتهم في العدد بل لهم بحسب تنوّعات التأثيرات أجنحة\n ولهذا\n \" حكى رسول الله صلى الله عليه وسلم أنه رأى جبريل عليه السلام ليلة المعراج وله ستمائة جناح\n وأشار إلى كثرتها بقوله تعالى: { يزيد في الخلق ما يشاء } \" ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَمْدُ للَّهِ } المحيط المشتمل على جميع ما صدر عن ألسنة عموم المظاهر حالاً ومقالاً ثابت { فَاطِرِ ٱلسَّمَٰوَٰتِ } أي: الذي فطر\n أي: أظهر وأبدع الأجرام العلوية من كتم العدم بعدما شق وفلق ظلمته بأشعة نور الوجود\n المنعكسة من الصفات الأسنى والأسماء الحسنى الإلهية { وَٱلأَرْضِ } أي: الأجسام أيضاً كذلك\n ليتحقق الفاعل والقابل ويتكون منهما من الكوائن والفواسد ما شاء الله بحوله وقوته { جَاعِلِ ٱلْمَلاَئِكَةِ } أي: الذي جعل الملائكة الذين هم سدنة سدته العلية وخدمة عتبته السنية { رُسُلاً } أي: وسائل ووسائط بينه سبحانه وبين خواص عباده من الأنبياء والرسل والأولياء المؤيدين من عنده سبحانه بالرتبة العلية والدرجة الرفيعة\n يبلغون إليهم من قِبَل الحق ما تفضل بهم سبحانه من الوحي المتعلق بخير الدارين ونفع النشأتين\n ولذلك صيرهم سبحانه { أُوْلِيۤ أَجْنِحَةٍ } متعددة مفتاوتة يسرعون بها نحو مصلحة بعثهم الله إليها وأمرهم بتبليغها { مَّثْنَىٰ وَثُلاَثَ وَرُبَاعَ } أي: لبعضهم أجنجة انثني اثنين\n ولبعضهم ثلاثة ثلاثة\n ولبعضهم أربعة أربعة إلى ما شاء الله\n بلا انحصار في عدد دون عدد\n بل { يَزِيدُ } سبحانه { فِي ٱلْخَلْقِ } أي: في جميع مخلوقاته { مَا يَشَآءُ } بلا حد وحصر\n إذ لا ينتهي قدرته دون مقدور\n بل له أن يتصرف فيه إلى مالا يتناهى\n كما روي:\n \" أنه صلى الله عليه وسلم رأى جبريل عليه السلام ليلة المعراج وله ستمائة جناح \"\n \n \nوهذا دليل على أن ذكر العدد ليس للحصر\n فالآية تدل على أن له سبحانه أن يتصرف في ملكه وملكته كما شاء وكيف شاء ومتى شاء\n فيجوز أن يخلق أنواعاً لم يخلقها قبل من أي جنس كان\n ويخلق أيضاً في فردع نوع أموراً عجيبة من الملاحة والصباحة وحسن الصوت والصورة\n وكمال العقل ورزانة الرأي\n وخواص غريبة لم يخلقها قبل لأفراد أُخر من هذا النوع\n\n\nولهذا يتفاوت أشخاص الإنسان في المعارف والحقائق وجميع الأمور المتعلقة بالعقل المتفرعة على الإدراك بحسب الأدوار والأعصار\n بل في زمان واحد أيضاً\n إذ بعضهم في نهاية البلادة\n وبعضهم في كمال الجلادة\n وبعضهم في كمال الحسن واللطافة\n وبعضهم في نهاية الكثافة والقباحة\n\n\nوبالجملة: له سبحانه التصرف في ملكه وملكوته بالاستقلال والاختيار بلا فترة وفتور في علمه وقدرته وإرادته\n إذ هو سبحانه منزه عن السآمة والملال\n وأوصافه بريئة عن وسمة الفترة والكلال { إِنَّ ٱللَّهَ } القادر المقتدر بالقدرة التامة { عَلَىٰ كُلِّ شَيْءٍ } تعلق به إرادته ومشيئته { قَدِيرٌ } [فاطر: 1] لا بدَّ أن يتكون باختياره بلا تخلف كل ما لمع عليه برق إرادته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ  قلت: { أولِي }: اسم جمع، كذُو، وهو بدل من \" رسلاً \" ، أو نعت له، و { مثْنَى وثُلاثَ ورُباع }: نعوت لأجنحة، وهو غير منصرف لأنه معدول عن اثنين اثنين، وثلاثة ثلاثة، وهو باعتبار الأشخاص، أي: منهم مَن له اثنان، ومنهم مَن له ثلاثة، هذا ظاهر الكشاف. يقول الحق جلّ جلاله: { الحمدُ لله } ، حمد نفسه تعليماً وتعظيماً، { فاطرِ السماواتِ والأرض } مبديهما ومبدعهما. قال ابن عباس رضي الله عنه: \" ما كنت أدري معنى فاطر حتى اختصم إليّ أعرابيان في بئر، فقال أحدهما: أنا فطرتها، أي: ابتدأتها \". قال البيضاوي: من الفطر، بمعنى الشق، كأنه شق العدم بإخراجهما منه. قلت: وكأنه شق النور الكثيف من النور اللطيف، فنور السموات والأرض من نوره الأزلي، وسره الخفي. { جاعلِ الملائكةِ رسلاً } إلى عباده، أي: وسائط بين الله وبين أنبيائه والصالحين من عباده، فيُبلغون إليهم رسالاته بالوحي، والإلهام، والرؤيا الصادقة. { أُولي أجنحةٍ } متعددة { مَثْنَى وَثُلاثَ وَرُبَاع } أي: منهم ملائكة لهم اثنان لكل واحد جناحان، ومنهم مَن له ثلاثة، ومنهم مَن له أربعة، بتفاوت ما لهم من المراتب، ينزلون بها، ويعرجون، أو: يُسرعون نحو ما وكلهم الله عليه، يتصرفون فيه على ما أمرهم به، ولعله تعالى لم يرد الحصر ونفى ما زاد عليها، لِمَا رُوي أنه صلى الله عليه وسلم رأى جبريل ليلة المعراج، وله ستمائة جناح. وَرُويَ أنه طلب منه أن يريه صورته التي خلقه اللهُ عليها، فلما رآه كذلك خرّ مغشِياً عليه. وقال: ما كنت أرى شيئاً من الخلق هكذا. فقال له: لو رأيت إسرافيل، إِنَّ له لاثني عشر جناحاً بالمشرق، واثني عشر جناحاً بالمغرب، وإنَّ العرش لعلى كاهله، وإنه ليتضاءل لعظمة الله تعالى. هـ. { يَزيدُ في الخلق ما يشاء } أي: يزيد في خَلْق الأجنحة وغيره ما يريد. وقيل: هو الوجه الحسن، والشَعْر الحسن، والصوت الحسن، والحظّ الحسن. والملاحة في العينين. والآية مطلقة تتناول كلَّ زيادة في الخلق، من طول قامة، واعتدال صورة، وتمام في الأعضاء، وقوة في البطش، وحصافة العقل، وجزالة في الرأي، وفصاحة في اللسان، وحُسن خلق في المعاشرة، ومحبة في قلوب المؤمنين وغير ذلك. { إِن الله على كل شيءٍ قدير } فيقدر على ما يشاء، من زيادةٍ في الخلق، ونقصان فيها، على حسب المشيئة السابقة. الإشارة: الحمدُ في القرآن وقع على أربعة أقسام: حمد مطلق، وهو الواقع على عظمة ذاته، من غير أن يكون في مقابلة شيء، وهو قوله:\n[النمل: 59]،\n[النحل: 75] وحمدٌ وقع في مقابلة تنزيه ذاته عن النقائص، وهو قوله:\n\n[الإسراء: 111] الآية. وحمدٌ وقع في مقابلة نعمة الإيجاد، وهو قوله:\n[الأنعام: 1]، وحمدٌ وقع في مقابلة نعمة الإمداد الحسي، كقوله: { الحمد لله رب العالمين } ،\n[الجاثية: 36]، فإن التربية تقتضي وصول ما يحتاج إليه المربّي، أو الإمداد المعنوي، وهو إمداد القلوب والأرواح بالهداية، وهو قوله:\n[الكهف: 1]\n[الأعراف: 43] فهذه أربعة: حمد مطلق، أو مقيد بشأن التنزيه، أو بنعمة الإيجاد، أو الإمداد، وما وقع هنا في إظهار تجلياته، من أرضه وسماواته، ولطائف ملائكته، فإن ذلك كله من نور جبروته. وقوله تعالى: { يَزِيدُ في الخلق ما يشاء } قال القشيري: يقال: هو الفهم عن الله، أو السخاء والجود، أو: الرضا بالتقدير، أو: علو الهمة، أو: التواضع في الشرف، أو: العفة في الفقر، أو: الظَرفُ ـ أي: الظرافة ـ في الشمائل، أو: أن يكون مُحَبباً في القلوب، أو: خفة الروح، أو: تحرُّر القلب عن رِقِّ الحرمان ـ أي بالوقوف مع الأكوان ـ أو: ألا يطْلُب لنفسه منزلةً في الدارين ـ أي: بأن يكون عبد الله حقيقة ـ. هـ. ملخصاً.  والصواب أن الزيادة تشمل ذلك كله ولك من خصه بشيء فإنما ذلك رحمة منه تعالى كما قال تعالى: { مَّا يَفْتَحِ ٱللَّهُ لِلنَّاسِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:14",
      "similarity": 0.4168299063036552
    },
    {
      "verse": "42:5",
      "similarity": 0.3339754939811051
    },
    {
      "verse": "21:56",
      "similarity": 0.3251371572197253
    },
    {
      "verse": "82:1",
      "similarity": 0.3242036589393047
    },
    {
      "verse": "9:36",
      "similarity": 0.31105149655962533
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/35:1.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/35:1.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/35:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}