{
  "chapter": "فاطر",
  "text": "ولا تزر وازرة وزر اخرى وان تدع مثقلة الى حملها لا يحمل منه شىء ولو كان ذا قربى انما تنذر الذين يخشون ربهم بالغيب واقاموا۟ الصلوة ومن تزكى فانما يتزكى لنفسه والى الله المصير",
  "translations": [
    {
      "translation": "No burden-bearer can bear another's burden. If someone weighed down calls for help to bear his load, none of it will be borne for him, even by his next of kin. You can only warn those who fear their Lord in the Unseen and establish salat. Whoever is purified, is purified for himself alone. Allah is your final destination.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one who carries a burden bears another's load; and even if the burdened soul cry out for help none will carry the least of its burden, however close a relative it may be. You can only warn those who fear their Lord in secret and fulfil their devotional obligations. Whoever grows in goodness does so for himself. To God is the journeying back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can bear another's burden. If a heavily laden one should call another to carry his load, none of it shall be carried by the other, even though he be a near of kin. (O Prophet), you can warn only those who fear their Lord without seeing Him and establish Prayer. Whoever purifies himself does so to his own good. To Allah is the final return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one will bear the burden of another. Even if an overburdened soul should ask another to bear a part of his burden, no one, not even a relative, will do so. (Muhammad), you can only warn those who have fear of their Lord without seeing Him and who are steadfast in prayer. Whoever purifies himself, does so for his own good. To God do all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no burdened soul will carry another soul’s burden; and if a burdened soul calls another to share the burden, no one will carry any part of it, even if he is a close relative; O dear Prophet (Mohammed – peace and blessings be upon him), your warning only benefits those who fear their Lord without seeing and who keep the prayer established; and whoever cleansed himself, has cleansed for his own benefit; and towards Allah only is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no bearer of burdens shall bear another's burden; and if one heavily laden calls another to (bear) his load, nothing of it will be lifted even though he be near of kin. You can warn only those who fear their Lord unseen and perform the Salah. And he who purifies himself (from all kinds of sins), then he purifies only for the benefit of himself. And to Allah is the Return (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a burdened soul cannot bear the burden of another and if one weighed down by burden should cry for (another to carry) its burden, not aught of it shall be carried, even though he be near of kin. You warn only those who fear their Lord in secret and keep up prayer; and whoever purifies himself, he purifies himself only for (the good of) his own soul; and to Allah is the eventual coming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul laden bears the load of another; and if one heavy-burdened calls for its load to be carried, not a thing of it will be carried, though he be a near kinsman. Thou warnest only those who fear their Lord in the Unseen and perform the prayer; and whosoever purifies himself, purifies himself only for his own soul's good. To God is the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no burdened soul can bear another's burden, and if one heavy laden crieth for (help with) his load, naught of it will be lifted even though he (unto whom he crieth) be of kin. Thou warnest only those who fear their Lord in secret, and have established worship. He who groweth (in goodness), groweth only for himself, (he cannot by his merit redeem others). Unto Allah is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No burden-bearer shall bear another's burden, and if some over-laden soul should call out for someone else to carry his load, not the least portion of it will be borne for him, even though he were a near relative. You can only warn those who fear their Lord in the unseen, and pray regularly. Anyone who purifies himself will benefit greatly from doing so. To God all shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a bearer of burthen will not bear another's burthen, and if one heavy-laden calleth for his load, naught thereof will be borne although he be of kin. Thou canst warn only those who fear their Lord, unseen, and establish prayer. And whosoever becometh clean becometh clean only for himself; and Unto Allah is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No bearer shall bear another’s burden, and should someone heavily burdened call [another] to carry it, nothing of it will be carried [by anyone] even if he should be a near relative. You can only warn those who fear their Lord in secret and maintain the prayer. Whoever purifies himself, purifies only for his own sake, and to Allah is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can a bearer of burdens bear another's burdens if one heavily laden should call another to (bear) his load. Not the least portion of it can be carried (by the other). Even though he be nearly related. Thou canst but admonish such as fear their Lord unseen and establish regular Prayer. And whoever purifies himself does so for the benefit of his own soul; and the destination (of all) is to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no bearer of burdens shall bear another's burden, and if one heavily laden calls another to (bear) his load, nothing of it will be lifted even though he be near of kin. You (O Muhammad SAW) can warn only those who fear their Lord unseen, and perform As-Salat (IqamatasSalat). And he who purifies himself (from all kinds of sins), then he purifies only for the benefit of his ownself. And to Allah is the (final) Return (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No laden soul shall bear another's load. If one is heavyburdened and calls for his load to be carried, nothing of it will be carried, not even if he is a close relative. You warn only those who fear their Lord in the Unseen, and establish the prayer. He who purifies himself, purifies himself for the good of his own soul. To Allah is the arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No burdened soul can carry the burden of another. Even if one weighted down calls for help with its burden, nothing can be lifted from it, even if they were related. You are to warn those who fear their Lord inwardly, and perform the prayer. He who purifies himself purifies himself for his own good. To God is the ultimate return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no bearer of burdens will bear the burden of another. And if a heavily laden soul calls [another] to [carry some of] its load, nothing of it will be carried, even if he should be a close relative. You can only warn those who fear their Lord unseen and have established prayer. And whoever purifies himself only purifies himself for [the benefit of] his soul. And to Allah is the [final] destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:18] And no burdened soul shall bear the burden of another [sinful soul]. And should one, soul, burdened heavily, with sin, call for, some of, its burden to be borne, by another, nothing of it will be borne, even if, the one called, be a relative, kin, such as a father or a son — the impossibility of ‘having something borne [by another]’ in both instances is something ordained by God. You can only warn those who fear their Lord in secret, in other words, those who fear Him despite not having seen Him, for they are the ones to benefit from the warning, and observe the prayer, maintain [performance of] it. For whoever purifies himself, cleansing himself of idolatry and other [similar abominations], is purifying himself only for [the sake of] his own soul, because the reforming of his self pertains to him. And to God is the [end of the] journeying, the return in the Hereafter when He will requite according to deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And no burdened soul can bear another's burden) i.e. with a good disposition of the soul but only insofar as it is forced to do so; it is also said that this means: no soul will be taken to task for the crime of another; and it is also said that this means: no soul will be tormented without having committed a crime, (and if one heavy laden) with sins (crieth for (help with) his load, naught of it) none of the sins (will be lifted even though he (unto whom he crieth) be of kin) his father, mother, son or daughter. (Thou warnest only) your warning, Muhammad, benefits only (those who fear their Lord in secret) those who work for their Lord even though He is invisible to them, but nothing is invisible to Him, (and have established worship) and perform the five daily prayers. (He who groweth (in goodness)) he who believes in Allah's divine Oneness, does good works and spends of his wealth in charity, (groweth only for himself) the reward of all this goes to his own soul. (Unto Allah is the journeying) unto Allah is the return in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما عرفتم قدرة الله وسمعتم كمال استغنائه، فلكل منكم الإتيان بمأموراته والاجتناب عن منهياته؛ إذ { لاَ تَزِرُ } تحمل نفس { وَازِرَةٌ } آثمة عاصية { وِزْرَ } نفس عاصية { أُخْرَىٰ وَإِن تَدْعُ } تطلب نفسه { مُثْقَلَةٌ } بالأوزار والمعاصي { إِلَىٰ حِمْلِهَا } أي: حمل بعض من الأوزار المحمول عليها { لاَ يُحْمَلْ مِنْهُ شَيْءٌ } أي: لا يحمل أحد شيئاً من أوزاره، وإن رضي بحملها على مقتضى العدل الإلهي { وَلَوْ كَانَ } المدعو للحمل { ذَا قُرْبَىٰ } أي: من قرابة الداعي، بل كل واحد من النفوس يومئذ رهينة ما اقترفت من المعاصي، ما حملت إلا عليها وما حوسبت بها إلا هي\n\n\n\n\nثم قال سبحانه مخاطباً لحبيبه صلى الله عليه وسلم في شأن عباده: { إِنَّمَا تُنذِرُ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِٱلْغَيْبِ } يعني: ما تفيد إنذاراتك التي تلوت يا أكمل الرسل على هؤلاء الغفلة إلا القوم الذين يخافون من الله، ومن عذابه وعقابه حال كونهم غائبين عنه، سامعين له، خاشعين من نزوله، خائفين من حلوله بغتة { وَ } مع ذلك { أَقَامُواْ ٱلصَّلاَةَ } المأمورة، المقربة لهم إلى جانب قدسه، المخلصين فيها، المطهرين نفوسهم عن الميل إلى ما سوى الحق { وَمَن تَزَكَّىٰ } وظهر نفسه عن الميل إلى البدع والأهواء { فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِ } إذ نفع تزيكته عائد إليه، مفيد له في أولاه وأخراه { وَ } بعد تزكيته عن لوازم بشريته ومقتضيات بهيميته العائقة عن الوصول إلى مبدأ فطرته { إِلَى ٱللَّهِ } المنزه عن مطلق النقائص، المبرء عن جملة الرذائل { ٱلْمَصِيرُ } [فاطر: 18] أي: المنقلب والمآب يعني: مرجع الكل إلأيه، ومقصده دونه سبحانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" وازرة \": صفة لمحذوف، أي: نفس آثمة\n و \" إن تدع \": شرط، و \" لا يُحمل \": جواب، و \" لا \" النافية لا تمنع الجواب من الجزم\n يقول الحق جلّ جلاله: { ولا تَزِرُ وازرة وِزْرَ أُخرى } أي: ولا تحمل نفس آثمة إثمَ نَفْسٍ أخرى، والوزر والوِقر أخوان، ووزَر الشيء: حمله\n والمعنى: أن كل نفس يوم القيامة لا تحمل إلا وزرها الذي اقترفته، فلا تؤخذ نفس بذنب نفس أخرى، كما تأخذ جبابرةُ الدنيا الظلمةُ الجارَ بجريمة الجار، والقريبَ بالقريب، فذلك ظلم محض\n وأما قوله تعالى:\n\n[العنكبوت: 13] ففي الضالّين المضلّين، فإنهم يحملون أثقال إضلالهم وأثقال ضلالهم، وكل ذلك أوزارهم، ليس فيها شيء من أوزار غيرهم\n ألا ترى كيف كذّبهم الله تعالى في قوله:\n\n[العنكبوت: 12]\n قال ابن عطية: مَن تطرق من الحكام إلى أخذ قريب بقريبه في جريمة ـ كفعل زياد ونحوه، فإن ذلك، لأن المأخوذ ربما أعان المجرم بمؤازرة، أو مواصلة، أو اطلاع على حاله، أو تقرير له، فهذا قد أخذ من الجُرم بنصيب\n وهذا هو المعنى بقوله تعالى: { وليحملن أثقالهم\n\n\n } الآية لأنهم أغروهم، وهو معنى قوله صلى الله عليه وسلم:\n\n \" مَن سنَّ سُنَّة حسنة\n\n \" \n\nالحديث، فراجعه\n قلت: لا يجوز الإقدام على ظلم أحد بمجرد الظن، فالصواب حسم هذا الباب، والتصريح بتحريمه لكثرة جوز الحُكام\n ثم قال تعالى: { وإِن تَدْعُ } نفس { مثقلةً } بالذنب أحداً { إِلى حِمْلِها } أي: إلى حمل ثِقل ذنوبها، ليتحمل عنها بعض ذلك، { لا يُحْمَل منه شيءٌ ولو كان } المدعو، المفهوم من قوله: { وإِن تدع } ، { ذا قُربى } ذا قرابة قريبة، كأب، وولد، وأخ\n والفرق بين معنى قوله: { ولا تزر وازرة وزر أخرى } وبين قوله: { إِن تدع مثقلة إلى حِمْلها لا يُحمل منه شيء } أنَّ الأول دالّ على عدل الله في حكمه، وأنه لا يؤاخذ نفساً بغير ذنبها، والثاني: في بيان أنه لا غياث يومئذ لمَن استغاث، فمَن أثقلته ذنوبه ثم استغاث بأحد لم يُغثه، وهذا غاية الإنذار\n ثم بيّن مَن ينتفع به بقوله: { إِنما تُنذِرُ الذين يخشون ربهم } أي: إنما ينتفع بإنذارك مَن خشي ربه { بالغيب } أي: يخشون ربهم غائبين عنه، أو: يخشون عذابه غائباً عنهم، فهو حال، إما من الفاعل أو المفعول المحذوف\n أو: يخشون ربهم في حال الغيب، حيث لا اطلاع للغير عليهم، فيتقون الله في السر، كما يتقون في العلانية\n { وأقاموا الصلاةَ } أتقنوها في مواقيتها، { ومَن تزكَّى } أي: تطهّر بفعل الطاعات، وترك المنهيات، { فإِنما يتزكَّى لنفسه } إذ نفعه يعود لها، وهو اعتراض مؤكد لخشيتهم، وإقامتهم الصلاة لأنها من جملة التزكي\n\n\n{ وإِلى الله المصيرُ } المرجع، فيجازيهم على تزكيتهم، وهو وعد للمتزكِّين بالثواب\n  الإشارة: وبال الوزر خاص بصاحبه، إلا إذا كان مقتدى به، فإنَّ عيبه أو نقصه يسري في أصحابه، حتى يطهر منه أن الصحبة صيرت الجسدين واحداً\n وراجع ما تقدّم عند قوله:\n\n[الأنفال: 25] الآية\n قال القشيري: { ولا تزر وازرة وزر أخرى } كلٌّ مُطَالَبٌ بعمله، ومحاسبٌ عن ديوانه\n ولكلٍّ معه شأن، وله مع كلِّ أحدٍ شأن، ومن العبادات ما تجري فيها النيابة، ولكن في المعارف لا تجري النيابة ولو أن عبداً عاصياً منهمكاً في غوايته فاتته صلاةٌ مفروضةٌ، فلو قضى عنه ألفُ وليٍّ، وألفُ صَفِيٍّ، تلك الصلاة الواحدة، عن كل ركعةٍ ألف ركعةٍ لم تُقْبَلْ\n هـ\n وقال في قوله تعالى: { إِنما تُنذر\n\n\n } الخ: الإنذار هو الإعلام بموضع المخافة\n والخشيةُ هي المخافة، فمعنى الآية: لا ينتفع بالتخويف إلا صَاحِبُ الخوف ـ طيرُ السماء على إلافها تقع\n هـ\n ثم ضرب المثل ومن لم يترك، فقال: { وَمَا يَسْتَوِي ٱلأَعْمَىٰ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:100",
      "similarity": 0.46611564374877584
    },
    {
      "verse": "53:38",
      "similarity": 0.4118491837666893
    },
    {
      "verse": "17:15",
      "similarity": 0.40167654105533335
    },
    {
      "verse": "6:164",
      "similarity": 0.38889670593576636
    },
    {
      "verse": "20:29",
      "similarity": 0.38396958749247256
    }
  ]
}