{
  "chapter": "فاطر",
  "text": "يايها الناس انتم الفقراء الى الله والله هو الغنى الحميد",
  "translations": [
    {
      "translation": "Mankind! you are the poor in need of Allah whereas Allah is the Rich Beyond Need, the Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, it is you who stand in need of God. As for God, He is above all need, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, it is you who stand in need of Allah; as for Allah, He is Self-Sufficient, Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, you are always in need of God and God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! You are dependant on Allah; and Allah only is the Independent (Absolute, Not Needing Anything), the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! it is you who stand in need of Allah. But Allah is the Rich, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! you are they who stand in need of Allah, and Allah is He Who is the Self-sufficient, the Praised One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, you are the ones that have need of God; He is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Ye are the poor in your relation to Allah. And Allah! He is the Absolute, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! It is you who stand in need of God -- God is self-sufficient, and praiseworthy --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! ye are needers Unto Allah, and Allah! He is the Selfsufficient, the Praiseworthy\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! You are the ones who stand in need of Allah, and Allah—He is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye men! It is ye that have need of Allah: but Allah is the One Free of all wants, worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! it is you who stand in need of Allah, but Allah is Rich (Free of all wants and needs), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, it is you who are in need of Allah. He is the Rich, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! It is you who are the poor, in need of God; while God is the Rich, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:15] O mankind! You are the ones who are in need of God, in every state. And God, He is the Independent, [without any need] of His creatures, the Praised, the One Who is praised in whatever He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind! Ye are the poor in your relation to Allah) in relation to His forgiveness, mercy, provision and well-being in the life of this world and to His Paradise in the Hereafter. (And Allah! He is the Absolute) He is free of need for what you have of wealth, (the Owner of Praise) He is praiseworthy in His acts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم نادى سبحانه عموم عباده على سبيل الاستغناء عنهم وعن أعمالهم وعن محامدهم وأثنيتهم الجارية على ألسنتهم\n فقال: { يٰأَيُّهَا ٱلنَّاسُ } الناسون عهود الله ومواثيقه التي واثقكم بها ربكم مع أنكم تنسون نعمه\n وتذهلون عن حقوق كرمه { أَنتُمُ ٱلْفُقَرَآءُ } المحتاجون بالذات المقصورون على الافتقار { إِلَى ٱللَّهِ } الذي أظهركم من كتم العدم ولم تكونوا شيئاً مذكوراً\n ورباكم بأنواع النعم\n سيما العقل المفاض\n الذي هو مذكركم عن مبدئكم ومنشئكم\n فلم تشكروا نعمة مبدعكم ومربيكم أيها الغافلون الجاهلون مع أنكم محتاجون إليه\n\n\n{ وَٱللَّهُ } المنزه بذاته عن شكر الشاكرين وكفر الكافرين { هُوَ ٱلْغَنِيُّ } المنحصر على الغنى الذاتي\n بحيث لا احتياج له ولا استكمال أصلاً\n إذ كمالاته سبحانه كلها بالفعل بحيث لا ترقب في شئونه مطلقاً { ٱلْحَمِيدُ } [فاطر: 15] المحمود في نفسه على الوجه الذي يليق بشأنه\n إذ لا يتأتى عن مصنوعاته الحمد الحقيقي بذاته\n وإنما أظهركم أيها الأظلال الهالكة بمقتضى جماله ولطفه\n لتواظبوا على عبادته وعرفانه\n كي تصلوا إلى توحيده صاعدين من حضيض الإمكان إلى أوج الوجوب الذاتي علماً وعيناً وحقاً\n فأنتم تتكاسلون وتتمايلون إلى أهوية نفوسكم البهيمية ومشتهيات قواكم البشرية\n أَمَّا تخافون وتتأملون أيها المغرورون؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الناس أنتم الفقراءُ إِلى الله } في دقائق الأمور وجليلها\n في كل لحظة لا يستغني أحد عنه طرفة عين\n ولا أقل من ذلك إذ لا قيام للعبد إلا به\n فهو مفتقر إلى الله\n إيجاداً وإمداداً\n قال البيضاوي: وتعريف الفقراء للمبالغة في فقرهم\n كأنهم لشدة افتقارهم\n وكثرة احتياجهم\n هم الفقراء دون غيرهم\n وأن افتقار سائر الخلق بالإضافة إلى فقرهم غير مُعتد به\n ولذلك قال:\n[النساء:28] قلت: ويمكن أن يكون الحصر باعتبار الحق تعالى\n أي: أنتم فقراء دون خالقكم\n بدليل وصله بقوله: { والله هو الغنيُّ الحميدُ }\n وقال ذو النون رضي الله عنه: الخلقُ محتاجون إليه في كل نَفَسٍ\n وطرفة\n ولحظة\n وكيف لا ووجودهم به\n وبقاؤهم به؟ { والله هو الغنيُّ } عن الأشياء كلها\n { الحميدُ } أي: المحمود بكل لسان\n ولم يَسمِّهم بالفقر للتحقير\n بل للتعظيم لأن العبد إذا أظهر فقره لسيده الغني أغناه عن أشكاله وأمثاله\n وذكر \" الحميد \" ليدل به على أنه الغني النافع بغناه خَلْقه\n والجواد المنعم عليهم إذ ليس كلّ غنيّ نافعاً بغناه\n إلا إذا كان الغنيُّ جواداً منعماً\n وإذا جاد وأنعم\n حمده المُنعَم عليهم\n ولَمَّا ذكر افتقارم إلى نعمة الإيجاد\n ذكر افتقارهم إلى نعمة الإمداد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:25",
      "similarity": 0.6692981564443072
    },
    {
      "verse": "28:24",
      "similarity": 0.5192560280846104
    },
    {
      "verse": "2:268",
      "similarity": 0.47282871381223573
    },
    {
      "verse": "2:271",
      "similarity": 0.46629747193605087
    },
    {
      "verse": "59:8",
      "similarity": 0.4571124935912929
    }
  ]
}