{
  "chapter": "فاطر",
  "text": "يولج اليل فى النهار ويولج النهار فى اليل وسخر الشمس والقمر كل يجرى لاجل مسمى ذلكم الله ربكم له الملك والذين تدعون من دونه ما يملكون من قطمير",
  "translations": [
    {
      "translation": "He makes night run into day, the day run into night, and has harnessed the sun and the moon so that each runs to its determined course. This is God your Lord; His is the kingdom; and those you invoke apart from Him are not masters even of the film on a date-palm stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to phase into the day and the day into the night, and He has subjected the sun and the moon, each running its course to an appointed term. That is Allah, your Lord; to Him belongs the Kingdom; but those whom you call upon, apart from Allah, possess not so much as the skin of a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter into the day and the day to enter into the night. He has made subservient to Himself the sun and moon, each moving in an orbit for an appointed time. Such is God, your Lord, to whom belongs the kingdom. Those whom you worship besides Him do not posses even a single straw.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings the night in a part of the day and He brings the day in a part of the night; and He has subjected the sun and moon; each one runs to its fixed term; such is Allah, your Lord – only His is the kingship; and those whom you worship instead of Him do not own even the husk of a date-seed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges the night into the day, and He merges the day into the night. And He has subjected the sun and the moon, each runs its course for a term appointed. Such is Allah, your Lord; His is the kingdom. And those, whom you invoke or call upon instead of Him, own not even a Qitmir.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter in upon the day, and He causes the day to enter in upon the night, and He has made subservient (to you) the sun and the moon; each one follows its course to an appointed time; this is Allah, your Lord, His is the kingdom; and those whom you call upon besides Him do not control a straw.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes the night to enter into the day and makes the day to enter into the night, and He has subjected the sun and the moon, each of them running to a stated term. That is God, your Lord; to Him belongs the Kingdom; and those you call upon, apart from Him, possess not so much as the skin of a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He maketh the night to pass into the day and He maketh the day to pass into the night. He hath subdued the sun and moon to service. Each runneth unto an appointed term. Such is Allah, your Lord; His is the Sovereignty; and those unto whom ye pray instead of Him own not so much as the white spot on a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes the night pass into the day and He makes the day pass into the night. He has subjected the sun and the moon, each running for an appointed term. Such is God, your Lord: His is the kingdom. Those whom you invoke besides Him do not own so much as the skin of a date stone;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He plungeth the night into the day and He plungeth the day into the night, and He hath subjected the sun and moon, each running till an appointed term. Such is Allah, your Lord; His is the dominion; and those whom ye call on besides Him own not even the husk of a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes the night pass into the day and makes the day pass into the night, and He has disposed the sun and the moon, each moving for a specified term. That is Allah, your Lord; to Him belongs all sovereignty. As for those whom you invoke besides Him, they do not control so much as the husk of a date stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges Night into Day, and he merges Day into Night, and he has subjected the sun and the moon (to his Law): each one runs its course for a term appointed. Such is Allah your Lord: to Him belongs all Dominion. And those whom ye invoke besides Him have not the least power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges the night into the day (i.e. the decrease in the hours of the night are added to the hours of the day), and He merges the day into the night (i.e. the decrease in the hours of the day are added to the hours of the night). And He has subjected the sun and the moon, each runs its course for a term appointed. Such is Allah your Lord; His is the kingdom. And those, whom you invoke or call upon instead of Him, own not even a Qitmir (the thin membrane over the datestone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter into the day and the day into the night. He has subjected the sun and the moon each running for a named term. Such is Allah, your Lord. To Him belongs the Kingdom; and those whom you call upon, other than Him, do not possess even as much as the membrane of a datestone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges the night into the day, and He merges the day into the night; and He regulates the sun and the moon, each running for a stated term. Such is God, your Lord; His is the sovereignty. As for those you call upon besides Him, they do not possess a speck.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter the day, and He causes the day to enter the night and has subjected the sun and the moon - each running [its course] for a specified term. That is Allah, your Lord; to Him belongs sovereignty. And those whom you invoke other than Him do not possess [as much as] the membrane of a date seed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:13] He, God, makes the night pass, enter, into the day, so that it becomes longer, and He makes the day pass into the night, so that it becomes longer, and He has disposed the sun and the moon, each, of them, moving, in its course, to an appointed term — [to] the Day of Resurrection. That is God, your Lord; to Him belongs [all] sovereignty. As for those on whom you call, [whom] you worship, besides Him, in other words, other than Him — and they are the idols — they do not possess [even] so much as the husk of a date-stone.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "491 (He maketh the night to pass into the day) such that the night is longer than the day by, for instance, six hours (and He maketh the day to pass into the night) such that the day is longer than the night by, let us say, six hours. (He hath subdued the sun and moon to service) He subdued the light of the sun and the moon to the service of human beings. (Each runneth unto an appointed term) round appointed trajectories. (Such is Allah, your Lord) it is Allah, your Lord, Who does so, not the deities; (His is the Sovereignty) the storehouses of the universe; (and those unto whom you pray) those whom you worship (instead of Him) instead of Allah (own not so much as the white spot on a date stone) they are unable to own of all that even the white spot on a date stone.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَا يَمْلِكُونَ مِن قِطْمِيرٍ } معناه القِشرُ الذي يكونُ عَلَى ظَهرِ النَّواةِ\n وقال: إِنها الفُوفةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال فضل الله عليكم ورحمته أنه { يُولِجُ ٱلْلَّيْلَ } أي: يدخل ظلمته { فِي } في { ٱلنَّهَارِ } فيطول أجزاء النهار بإيلاج أجزاء الليل في الصيف؛ تتميماً لمصالح معيش عباده { وَ } كذا في الشتاء { يُولِجُ ٱلنَّهَارَ } أي: أجزاء منه { فِي ٱلْلَّيْلِ } فيطوله بأجزائه؛ تسكيناً للقوى النامية، وتمكيناً لها؛ ليجددها للخدمة المفوضة إليها { وَسَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ } أيضاً؛ تتميماً لمصالح عباده إلى حيث { كُلٌّ } منهما { يَجْرِي } ويدور بإذن الله وإلهامه { لأَجَلٍ مُّسَمًّى } هي من مبدأ دوره إلى منتهاه، أو إلى انقراض نشأة الدنيا { ذَلِكُمُ } المتصرف بالاستقلال والاختيار، المدبر بكمال العلم والخبرة ووفور الحكمة والدرية، هو { ٱللَّهُ رَبُّكُمْ } الذي أظهركم من كتم العدم، ورباكم بأنواع النعم والكرم، كيف لا يربيكم سبحانه بعدما أبدعكم؛ إذ لا متصرف في الكائنات إلا هو { لَهُ ٱلْمُلْكُ } لا مالك له سواه ولا مدبر غيره\n\n\n\n\n{ وَ } المحجوبون { ٱلَّذِينَ تَدْعُونَ } وتدعون { مِن دُونِهِ } من التماثيل الباطلة والأظلال الهالكة العاطلة تعنتاً وعناداً، مع أو ما يسمون أولئك الجاهلون آلهة سواه سبحانه، ويسندون الأمور إليهم مكابرة { مَا يَمْلِكُونَ مِن قِطْمِيرٍ } [فاطر: 13] أي: ليس لهم أن يتصرفوا في قشرة رقيقة ملتفة على ظهر النواة، وهذه مثل في القلة عند العرب فيكف في غيرها؛ إذ الألوهية مسبوقة بوجوب الوجود بالصفات الكاملة الذاتية والأسماء الحسنى التي لا تعد ولا تحصى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يُولج الليلَ في النهار ويُولج النهارَ في الليل } أي: يُدخل من ساعات أحدهما في الآخر، حتى يصير الزائدُ منهما خمس عشرة ساعة، والناقص تسعاً\n { وسخَّر الشمسَ والقمرَ } ذللها لِمَا يُراد منهما، { كُلٌّ يجري لأجلٍ مسمى } أي: يوم القيامة، فينقطع جريهما، { ذلكم اللهُ ربكم } الإشارة إلى فاعل هذه الأشياء، وهي: مبتدأ، و \" الله \" وما بعده: أخبار، { له الملكُ } له التصرف التام\n { والذين تَدْعُون من دونه } من الأصنام، أي: تعبدونهم، { ما يملكون من قِطْمِير } وهي القشرة الرقيقة الملتفة على النواة، كما أن النقير: النقطة في ظهره\n وهما كنايتان عن حقارة الشيء وتصغيره",
      "translations": []
    }
  ]
}