{
  "chapter": "فاطر",
  "text": "وما ذلك على الله بعزيز",
  "translations": [
    {
      "translation": "That is not difficult for Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is well within the power of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That surely is not difficult for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This would not cost God dear at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this not at all difficult for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is not hard for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is not hard to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that is surely no great matter for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is not a hard thing for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that is not difficult for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Allah that shall not be hard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that is not a hard thing for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor is that (at all) difficult for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is not hard for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "this is not a great matter for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that would not be difficult for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is for Allah not difficult.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:17] And that is not an arduous thing for God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) i.e. destroying you and bringing a new creation (is not a hard thing for Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها الهالكون في تيه الغفلة أنه { مَا ذَلِكَ } التبديل والإتيان { عَلَى ٱللَّهِ } القادر المقتدر على إظهار جميع ما لاح عليه برق علمه وإرادته { بِعَزِيزٍ } [فاطر: 17] غير متعذر، بل عنده ويجنب سرعة نفوذ قضائه سهل يسير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما ذلك } أي: الإفناء والإنشاء { على الله بعزيز } بممتنع\n وعن ابن عباس: يخلق بعدكم مَن يعبده، لا يشرك به شيئاً\n قال القشيري: فقر الخِلْقَة عام لكلِّ أحدٍ، في أول حال وجوده ليُبديه وينْشيه، وفي ثاني حال بقائه ليُديمَه ويُبقيَه\n هـ\n قلت: وإليه أشار في الحِكَم بقوله: \" نعمتان ما خلا موجود عنهما، ولا بد لكل موجود منهما: نعمة الإيجاد، ونعمة الإمداد، أنعم أولاً بالإيجاد، وثانياً بتوالي الإمداد \"\n الإشارة: الفقر على أربعة أقسام: فقر من الدين، وفقر من اليقين، وفقر من المال، وفقر مما سوى الله\n فالأولان مذمومان، وصاحبهما موسوم بالإفلاس والهلع، ومنهما وقع التعوُّذ في الحديث\n والثالث: إن صحبه الرضا فممدوح، وفيه وردت الأحاديث النبوية، وإلاَّ فمذموم، ويشمله التعوُّذ في الحديث\n الرابع: هو مطلب القاصدين والعارفين، وهو الغيبة عما سوى الله، والغنى بالله، كما قال الشيخ أبو الحسن: \" أسألك الفقر عما سواك، والغنى بك، حتى لا نشهد إلا إياك \" وهو ينشأ عن التحقُّق بالفقر ظاهراً وباطناً لأن الفقر من وصف العبد، والغنى من وصف الرب، فمَن تحقق بوصفه أمدّه الله بوصفه، \" تحقق بوصفك يُمدك بوصفه، تحقق بفقرك يمدك بغناه، تحقق بذلك يمدك بعزه \"\n\n\nوقال القشيري: بعد كلام ـ: والفقراءُ على أقسام: فقير إلى الله، وفقير إلى شيء هو من الله معلومٍ ومرسوم\n ومَن افتقر إلى شيءٍ استغنى بوجود ذلك الشيء، فالفقير إلى الله هو الغني بالله، فالافتقار إلى الله لا يخلو من الاستغناء بالله\n فالفقير إليه مُسْتَغْنٍ به، والمستغنى به فقيرٌ إليه\n ومن شرف الفقر اقترانه بالتواضع والخشوع، ومن آفات الغنى امتزاجُه بالتكبُّر\n وشَرَفُ العبد وعزه في فقره، وذُلُّه وصغاره في توهمه الغنى، وأنشدوا:\n\nومن شرط الفقير: ألا يملك شيئاً، ولا يملكه شيء\n ومن آداب الفقير الصادق: إظهارُ التكثُّر عند وجود التقتُّر، والشكر على البلوى، والبُعد عن الشكوى\n ويقال: الفقر المحمود: العيش مع الله براحة الفراغ على سَرْمَدِ الوقت، من غير استكراه شيء منه بكلِّ وجْهٍ\n هـ\n ملخصاً\n قال الورتجبي: فطرة الإنسانية وقعت من الغيب مضطربة متحركة إلى الأزل، بنعت الافتقار إليه، كانجذاب الحديد إلى المغناطيس لأنها وقعت بنعت العشق، والعاشق مفتقر إلى معشوقه، انفعالاً، فمَن عرفه بالأزلية والأبدية يفتقر إليه افتقاراً قطعيًّا لأن بقاءه لا يكون إلا به\n وإذا كان كذلك صار غنيًّا بالله، متصفاً بغناه، غنيًّا به عن غيره، مفتقراً إليه\n فإذا كان في محل الصحو يكون مفتقراً إليه، وإذا كان في محل السكر بقي في رؤية غناه عنه، فصار محجوباً عنه، ولا يدري\n هـ\n وقال سهل رضي الله عنه: لَمَّا خلق الله الخلقَ حَكَمَ لنفسه بالغِنى، ولهم بالفقر، فمَن ادّعى الغِنى، حُجب عن الله، ومَن أظهر فقره أوصله فَقْرُه إليه\n فينبغي للعبد أن يكون مفتقراً بالسرّ إليه، ومنقطعاً عن الغير إليه، حتى يكون عبوديّته لله محضة، فالعبودية هي الذل والخضوع\n هـ\n وقال الواسطي: مَن استغنى بالله لا يفتقر، ومَن يتعزّز بالله لا يَذل\n وقال يحيى بن معاذ: الفقرُ خير للعبد من الغِنى لأن الذلة في الفقر، والكبر في الغِنى، والرجوع إلى الله بالتواضع والذلة خير من الرجوع إليه بكثرة الأعمال\n وقيل: صفة الأولياء ثلاثة: الثقة بالله في كل شيء، والفقر إليه في كل شيء، والرجوع إليه من كل شيء\n وكيف يفتقر العبد إلى العبد وهو لا يغني عنه شيئا، قال تعالى: { وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ وَإِن تَدْعُ\n\n\n }\n",
      "translations": []
    }
  ]
}