{
  "chapter": "فاطر",
  "text": "وما يستوى البحران هذا عذب فرات سائغ شرابه وهذا ملح اجاج ومن كل تاكلون لحما طريا وتستخرجون حلية تلبسونها وترى الفلك فيه مواخر لتبتغوا۟ من فضله ولعلكم تشكرون",
  "translations": [
    {
      "translation": "The two seas are not the same: the one is sweet, refreshing, delicious to drink, the other salty, bitter to the taste. Yet from both of them you eat fresh flesh and extract ornaments for yourselves to wear; and you see ships on them, cleaving through the waves so that you can seek His bounty and so that hopefully you will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alike are not two bodies of water: This one is sweet and fresh and pleasant to drink, and this one brine and bitter; yet you get fresh meat to eat from both, and take out ornaments to wear. You see how the ships churn through them so that you may seek of His bounty and, perhaps, give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two masses of water are not alike. The one is sweet, sates thirst, and is pleasant to drink from, while the other is salt, bitter on the tongue. Yet from both you eat fresh meat, and extract from it ornaments that you wear; and you see ships cruising through it that you may seek of His Bounty and be thankful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two oceans, one sweet and the other salty, are not alike. From each you can eat fresh meat and obtain ornaments to use. You see ships ploughing their way through them so that you may seek His favor and give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two seas are not alike; this is sweet, very sweet and palatable – and this is salty, bitter; and from each you eat fresh meat and extract the ornament which you wear; and you see the ship cleaving through it, so that you may seek His munificence, and in some way become grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two seas (kinds of water) are not alike: this is palatable, sweet and pleasant to drink, and that is salty and bitter. And from them both you eat fresh tender meat (fish), and derive the ornaments that you wear. And you see the ships cleaving, that you may seek of His bounty, and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two seas are not alike: the one sweet, that subdues thirst by its excessive sweetness, pleasant to drink; and the other salt, that burns by its saltness; yet from each of them you eat fresh flesh and bring forth ornaments which you wear; and you see the ships cleave through it that you may seek of His bounty and that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are the two seas; this is sweet, grateful to taste, delicious to drink, and that is salt, bitter to the tongue. Yet of both you eat fresh flesh, and bring forth out of it ornaments for you to wear; and thou mayest see the ships cleaving through it, that you may seek of His bounty, and so haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two seas are not alike: this, fresh, sweet, good to drink, this (other) bitter, salt. And from them both ye eat fresh meat and derive the ornament that ye wear. And thou seest the ship cleaving them with its prow that ye may seek of His bounty, and that haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two seas are not alike. The one is sweet, thirst-quenching, and pleasant to drink from, while the other is salty and bitter. Yet from each you eat fresh fish and extract ornaments to wear, and in each you see the ships ploughing through the waves so that you may seek His bounty and so that you may feel thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two seas are not alike: this, sweet, thirst- quenching, pleasant to drink; and that, saltish and bitter. And yet from each ye eat flesh fresh and bring forth the ornaments that ye wear. And thou seest therein ships cleaving the water, that ye may seek of His graCe, and that haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not alike are the two seas: this one sweet and agreeable, pleasant to drink, and that one briny and bitter, and from each you eat fresh meat and obtain ornaments, which you wear. And you see the ships plowing through them, that you may seek of His bounty, and so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor are the two bodies of flowing water alike,- the one palatable, sweet, and pleasant to drink, and the other, salt and bitter. Yet from each (kind of water) do ye eat flesh fresh and tender, and ye extract ornaments to wear; and thou seest the ships therein that plough the waves, that ye may seek (thus) of the Bounty of Allah that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two seas (kinds of water) are not alike, this fresh sweet, and pleasant to drink, and that saltish and bitter. And from them both you eat fresh tender meat (fish), and derive the ornaments that you wear. And you see the ships cleaving (the seawater as they sail through it), that you may seek of His Bounty, and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two seas are not alike. One is fresh, sweet and pleasant to taste, while the other is salt and bitter. Yet, from each you eat fresh flesh and bring forth out of it ornaments for you to wear. And you see the ships plow their course through it so that you may seek His bounty, and in order that you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two seas are not the same. One is fresh, sweet, good to drink, while the other is salty and bitter. Yet from each you eat tender meat, and extract jewelry which you wear. And you see the ships plowing through them, so that you may seek of His bounty, so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not alike are the two bodies of water. One is fresh and sweet, palatable for drinking, and one is salty and bitter. And from each you eat tender meat and extract ornaments which you wear, and you see the ships plowing through [them] that you might seek of His bounty; and perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:12] Nor are the two [kinds of] seas alike: this one is extremely sweet, pleasant to drink and that one is salty, extremely bitter. Yet from each, of the two, you eat fresh meat, namely, fish, and obtain, from the salt — and it is also said, from both of them — ornaments which you wear, namely, pearls and coral. And you see, you sight, the ships therein, in each of the two [seas], ploughing through (mawākhira, in other words, tamkhuru’l-mā’a, meaning, ‘it cleaves it as it makes its way through it, coming and going by the same wind) that you may seek of His bounty, exalted be He, through commerce, and that perhaps you may give thanks, to God for this [bounty].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the two seas) the sweet and salty (are not alike: this, fresh, sweet, food to drink, this (other) bitter, salt. And from them both) the sweet and salty seas (ye eat fresh meat) fresh fish (and derive) especially from the salty sea (the ornament) gems and pearls (that ye wear. And thou seest the ship cleaving them) i.e. the seas (with its prow) coming and going driven by the same wind (that ye may seek of His bounty) of His provision, (and that haply ye may give thanks) so that you may give thanks for His bounty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا يَسْتَوِي ٱلْبَحْرَانِ هَـٰذَا عَذْبٌ فُرَاتٌ } معناه أعذبُ العَذبِ { وَهَـٰذَا مِلْحٌ أُجَاجٌ } معناه أملحُ المُلوحةِ\n\n\n\n\nوقوله تعالى: { وَتَرَى ٱلْفُلْكَ فِيهِ مَوَاخِرَ } معناه جَوارٍ تَجري فيهِ تَشُقُّ الماءَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم مثَّل سبحانه كلا الفريقين المؤمن والكافر بالبحرين العذب والمالح، فقال: { وَمَا يَسْتَوِي ٱلْبَحْرَانِ } في النفع والفائدة الحاصلة منهما؛ إذ { هَـٰذَا } أي: المؤمن المصدق لبحر الإيمان والعرفان، المترشح من بحر الوحدة الذاتية { عَذْبٌ } حلو في كمال الحلاوة { فُرَاتٌ } يكسر غليل أكباد المتعطشين في سراب الدنيا ببرد اليقين { سَآئِغٌ شَرَابُهُ } أي: سهل انحداره للمجبولين على فطرة التوحيد\n\n\n\n\n{ وَهَـٰذَا } أي: الكافر المتوغل في بحر الغفلة { مِلْحٌ } لا مصلح يصلح من يذوق منه، بل { أُجَاجٌ } مر مفسد للمزاج، من ذاق منه هلك هلاكاً أبدياً بحيث لا نجاة له، بل { وَ } البحر الأجاج له نفع، ولا نفع للكفر والضلال أصلاً؛ إذ { مِن كُلٍّ } من البحرين { تَأْكُلُونَ لَحْماً طَرِيّاً } مثل السمك وغيرها { وَتَسْتَخْرِجُونَ } منهما { حِلْيَةً } أي: أنواعاً من التزيينات اللاتي { تَلْبَسُونَهَا } وإنما أباح لكم سبحانه أيها المكلفون منافع بره وبحره { وَتَرَى ٱلْفُلْكَ فِيهِ مَوَاخِرَ لِتَبْتَغُواْ مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ } [فاطر: 12] أي: رجاء أن تشكروا نعمه، وتزيدوا على أنفسكم مزيد كرمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما يستوي البحرانِ } في العذوبة والملوحة، بل هما مختلفان، والماء واحد، { هذا عذب فُرات } أي: شديد العذوبة\n وقيل: هو الذي يَكْسر العطش لشدة برودته، { سائغ شَرابُهُ } أي: سهل الانحدار، مريء، لعذوبته، { وهذا مِلحٌ أُجاج } شديد الملوحة، وقيل: الذي تُحرِق ملوحته\n { ومن كُلِّ } أي: من كل واحد منهما { تأكلون لحماً طرياً } وهو السمك، { وتستخرجون حِليةً } وهي اللؤلؤ والمرجان\n قيل: من الملح فقط\n وقيل: منهما\n قال بعضهم: نسب استخراج الحلية إليهما لأنه تكون في البحر عيون عذبة، تمتزج بماء الملح، فيكون اللؤلؤ من ذلك\n هـ\n { تلبسونها } أي: نساؤكم لأن القصد بالتزيُّن هو الرجال\n { وترى الفلكَ } السفن، { فيه مواخِرَ } شواقّ للماء بجريها، يقال: مخرت السفينة الماء: شَقَّته، وهي جمع ماخرة، { لتبتغوا من فضله } من فضل الله، ولم يتقدم له ذكر في الآية ولكن فيما قبلها، ولو لم يجرِ له ذكر، لم يشكل لدلالة المعنى عليه\n { ولعلكم تشكرون } الله على ما أولاكم من فضله\n وقيل: هو ضرب مثل للكافر والمؤمن، فالمؤمن يجري عذب فُرات، والكافر ملحٌ أُجاج\n ثم ذكر ـ على سبيل الاستطراد ـ ما يتعلق بالبحرين من نِعَم الله وعطائه\n ويحتملُ أن يكون على غير الاستطراد، وهو أن يشبّه الجنسيْن، ثم يفضّل البحر الأجاج على الكافر، وهو ما خصّ به من المنافع، كاستخراج اللؤلؤ، والمرجان، والسمك، وجري الفلك فيه، وغير ذلك\n والكافر خلوّ من المنافع بالكلية، فهو على طريقة قوله تعالى: { ثُمَّ قَسَتْ قُلُوبُكُم مِّنْ بَعْدِ ذَلِكَ } ثم قال:\n",
      "translations": []
    }
  ]
}