{
  "chapter": "فاطر",
  "text": "ومن الناس والدواب والانعم مختلف الونه كذلك انما يخشى الله من عباده العلمؤا۟ ان الله عزيز غفور",
  "translations": [
    {
      "translation": "And mankind and beasts and livestock are likewise of varying colours. Only those of His slaves with knowledge have fear of Allah. Allah is Almighty, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so are among men, beasts and cattle, different shades. Only those of His creatures fear God who have knowledge. Verily He is all-mighty and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and human beings too, and beasts, and cattle -- diverse are their hues. From among His servants, it is only those who know that fear Allah. Verily Allah is Most Mighty, Most Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has also created people, beasts, and cattle of various colors. Only God's knowledgeable servants fear Him. God is Majestic and All-pardoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly the colours of men and beasts and cattle, are different; among the bondmen of Allah, only the people of knowledge fear Him; indeed Allah is the Most Honourable, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise, men and moving creature and cattle are of various colors. It is only those among His servants who have knowledge that fear Allah. Verily, Allah is Almighty, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of men and beasts and cattle are various species of it likewise; those of His servants only who are possessed of knowledge fear Allah; surely Allah is Mighty, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "men too, and beasts and cattle -- diverse are their hues. Even so only those of His servants fear God who have knowledge; surely God is All-mighty, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of men and beasts and cattle, in like manner, divers hues? The erudite among His bondmen fear Allah alone. Lo! Allah is Mighty, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in like manner, men, beasts, and cattle have their diverse hues too. Only those of His servants, who possess knowledge, fear God. God is almighty and most forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of men and beasts and cattle, likewise of diverse colours. Those only of His bondmen who have knowledge fear Allah Verily Allahis the Mighty, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of humans and beasts and cattle there are likewise diverse hues. Only those of Allah’s servants having knowledge fear Him. Indeed Allah is all-mighty, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so amongst men and crawling creatures and cattle, are they of various colours. Those truly fear Allah, among His Servants, who have knowledge: for Allah is Exalted in Might, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of men and AdDawab (moving living creatures, beasts, etc.), and cattle, in like manner of various colours. It is only those who have knowledge among His slaves that fear Allah. Verily, Allah is AllMighty, OftForgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People too, and beasts and cattle have their different colors. But it is only those amongst His worshippers that fear Allah who have knowledge. Indeed, Allah is the Almighty and the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, human beings, animals, and livestock come in various colors. From among His servants, the learned fear God. God is Almighty, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among people and moving creatures and grazing livestock are various colors similarly. Only those fear Allah, from among His servants, who have knowledge. Indeed, Allah is Exalted in Might and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:28] And of humans and beasts and cattle, there are diverse hues likewise, like the diversity of the [hues of] fruits and mountains. Indeed only those of God’s servants who have knowledge fear Him, in contrast to the ignorant, such as the disbelievers of Mecca. Truly God is Mighty, in His kingdom, Forgiving, of the sins of His faithful servants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of men) there are also different colours (and beasts) there are different kinds of beasts (and cattle, in like manner, diverse hues) there are different kinds of cattle? (The erudite among His bondsmen fear Allah alone) He says: from among all His servants, it is the erudite who fears Allah. (Lo! Allah is Mighty) in His dominion and kingdom, (Forgiving) He forgives whoever believes in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّمَا يَخْشَى ٱللَّهَ مِنْ عِبَادِهِ ٱلْعُلَمَاءُ } فيخشى: يَخافُ\n ويَخشى: يعلمُ\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Indeed, Allah is only fearful of His servants the knowledgeable} - He is fearing: He fears\n He is afraid: He knows.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أي: من الآثار تربية الماء وإحيائها أموات الأراضي { مِنَ ٱلنَّاسِ } المنهمكين في الغفلة والنسيان { وَٱلدَّوَآبِّ } المنسلخة عن رتبة الإدراك والشعور المتعلق بالمبدأ والمعاد { وَٱلأَنْعَامِ } المشغوفة بتوفير اللذات الجسمانية والمشتهيات النفسية { مُخْتَلِفٌ أَلْوَانُهُ كَذَلِكَ } أي: أجناسه وأنواعه وأصنافه وأشكاله وهيئاته\n وبالجملة: { إِنَّمَا يَخْشَى ٱللَّهَ } ويخاف من بطشه { مِنْ عِبَادِهِ } الذين أبدعهم وأظهرهم من كتم العدم بإفاضة رشاشات رشحات بحر وجوده بمقتضى جوده { ٱلْعُلَمَاءُ } العرفاء بالله وبأوصافه الكاملة الفائضة عليهم\n وأسمائه الحسنى الشاملة\n المتحققون بمرتبة التوحيد\n المنكشفون بسر سريان الوحدة الذاتية على عموم المظاهر\n إذ أخشى الناس من الله أعرفهم بشأنه\n لذا قال صلى الله عليه وسلم:\n \" إني أخشاكم الله وأتقاكم به \" \n\n وكيف لا يخشى العارفون منه سبحانه { إِنَّ ٱللَّهَ } المتردي برداء العظمة والكبرياء { عَزِيزٌ } غالب على انتقام من أراد انتقامه من عباده { غَفُورٌ } [فاطر: 28] ذنوب من تاب إلى الله ورجع نحوه عن ظهر قلب\n\n\nثم أشار سبحانه إلى خواص عباده\n وبنبههم على ما هو المقبول منهم عنده سبحانه من أعمالهم\n وحثهم عليها امتناناً لهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ومن الناس والدوابِّ والأنعامِ مختلفٌ ألوانه } أي: ومنهم صنفٌ مختلف ألوانه بالحمرة والصفرة والبياض والسواد\n { كذلك } أي: كاختلاف الثمرات والجبال\n قال القشيري: تخصيص الفعل بهيئته وألوانه من أدلة قصد الفاعل وبرهانه\n فإتقان الفعل وإحكامه شواهد الصنع وإعلامه\n وكذلك أيضاً الناس والدواب والأنعام\n بل جميع المخلوقات\n متجانس الأعيان\n مختلف الصفات\n وهو دليل ثبوت منشئها بنعت الجلال هـ\n الإشارة: ألم تر أن الله أنزل من سماء الغيوب ماء الواردات الإلهية\n فأخرجنا به ثمرات\n وهي العلوم والأذواق والوجدان\n مختلف ألوانها\n فمنها علوم الشرائع\n وتحقيق مسائلها\n ومنها علم العقائد\n وتشييد أدلتها وبراهينها\n ومنها علوم اللسان بإتقان قواعدها\n ومنها علم القلوب وتصفيتها من العيوب\n وهو علم الطريقة\n ومنها علم الأسرار\n وهي أسرار الذات والصفات\n وهو علم الحقيقة\n ومن جبال العقل طُرق بيض\n وحمر\n وسود\n فالبيض: طرق الكشف والبيان\n وحلاوة الذوق والوجدان\n والحُمر: طُرق الدليل والبرهان لأنها قد تظهر وتخفى\n والسود الغرابيب: عقول الفلاسفة والطبائعيين\n أهل الحدس والتخمين\n إذا لم يقتدوا بالكتاب المبين\n وشرعِ النبي الأمين\n\nأولئك هم الضالون المضلُّون\n ولمّا كان النظر في هذه المصنوعات إنما يكون بالعلم\n ذكر أهله\n فقال: {\n\n\n إِنَّمَا يَخْشَى ٱللَّهَ مِنْ عِبَادِهِ ٱلْعُلَمَاءُ إِنَّ ٱللَّهَ عَزِيزٌ غَفُورٌ }  يقول الحق جلّ جلاله: { إِنما يخشى اللهَ } أي: يخافه { من عباده العلماءُ } لأنهم هم الذين يتفكرون في عجائب مصنوعاته\n ودلائل قدرته\n فيعرفون عظمته وكبرياءه\n وجلاله وجماله\n ويتفكرون فيما أعد الله لمَن عصاه من العذاب ومناقشة الحساب\n وفيما أعد لمَن خافه وأطاعه من الثواب\n وحسن المآب\n فيزدادون خشية\n ورهبة\n ومحبة\n ورغبة في طاعته\n وموجب رضوانه\n دون مَن عداهم من الجهّال\n وفي الحديث عنه صلى الله عليه وسلم:\n \" أعلمكم بالله أشدكم له خشية \" \nوقال صلى الله عليه وسلم:\n \" رأس الحكمة مخافة الله \"\n \nوقال الربيع بن أنس: مَن لم يَخشَ الله فليس بعالم\n وقال ابن عباس في تفسير الآية: كفى بالزهد عِلماً\n وقال ابن مسعود: كفى بخشية الله عِلماً\n وبالاعتذار جهلاً\n وفي الحِكَم: \" خيرُ علم ما كانت الخشية معه \"\n وقال في التنوير: اعلم أن العلم حيثما تكرر في الكتاب والسُنَّة فإنما المراد به العلم النافع\n الذي تٌقارنه الخشية\n وتكتنفه المخافة\n قال تعالى: { إِنما يخشى اللهَ من عباده العلماءُ } بيّن سبحانه أن الخشية تلازم العلم\n وفهم من هذا أن العلماء إنما هم أهل الخشية\n هـ\n وقال الشيخ ابن عباد رضي الله عنه: واعلم أن العلم النافع\n المتفق عليه فيما سلف وخلف\n إنما هو العلم الذي يؤدي بصاحبه إلى الخوف والخشية\n وملازمة التواضع والذلة\n والتخلُّق بأخلاق الإيمان\n إلى ما يتبع ذلك من بغض الدنيا والزهادة فيها\n وإيثار الآخرة عليها\n ولزوم الأدب بين يدي الله تعالى\n إلى غير ذلك من الصفات العلية\n والمناحي السنية\n هـ\n وقال في لطائف المنن: شاهد العلم\n الذي هو مطلب الله تعالى: الخشية\n وشاهد الخشية: موافقة الأمر\n فأما علم تكون معه الرغبة في الدنيا\n والتملُّق لأربابها\n وصرف الهمة لاكتسابها\n والجمع\n والادخار\n والمباهاة\n والاستكثار\n وطول الأمل\n ونسيان الآخرة\n فما أبعد مَنْ هذا نعته مِنْ أن يكون من ورثة الأنبياء! وهل ينتقل الشيء الموروث إلى الوارث إلا بالصفة التي كان بها عند الموروث عنه\n ومثل مَنْ هذه الأوصاف أوصافه من العلماء كالشمعة\n تُضيء على غيرها\n وهي تحرق نفسها\n جعل الله العلم ـ الذي علمه من هذا وصفه ـ حجة عليه\n وسبباً في تكثير العقوبة لديه\n هـ\n وتقديم اسم الله تعالى\n وتأخير العلماء\n يُؤذِن أن معناه: إن الذين يخشون الله من عباده العلماء دون غيرهم\n ولو عكس\n بأن قال: إنما يخشى العلماءُ الله\n لكان المعنى: أنهم لا يخشون إلا الله\n وقرأ أبو حنيفة وعمر بن عبد العزيز: بنصف \" العلماء \" ورفع \" الله \"\n\nوالخشية في هذه القراءة بمعنى التعظيم\n والمعنى: إنما يعظم اللهُ من عباده العلماءَ\n وعنه صلى الله عليه وسلم:\n \" يقول الله للعلماء يوم القيامة ـ إِذا قَعَدَ على كُرسيِّه\n يفصل قضاء عباده: إني لم أجعلْ عِلْمي وحِلْمي فِيكُمْ إلا وأنا أُريدُ أن أغفرَ لكم\n على ما كان فيكم\n ولا أبالي \" \nقال المنذري: انظر إلى قوله: \" علمي وحلمي \" يتضح لك بإضافته إليه أنه لم يرد به علم أكثر أهل الزمان المجرّد عن العلم به والإخلاص\n وفي رواية: \" لم أجعل حكمتي فيكم إلا لخير أُريده بكم\n ادخلوا الجنة بما فيكم \"\n وقال ـ عليه الصلاة والسلام ـ:\n \" يُوزن يوم القيامة مداد العلماء ودماء الشهداء\n فيرجح مداد العلماء على دماء الشهداء \"\n \n{ إِن الله عزيزٌ غفور } هو تعليل لوجوب الخشية لدلالته على عقوبة العصاة لعزته وغلبته\n وإثابة أهل الطاعة\n والعفو عنهم لعظيم غفرانه\n والمعاقب والمثيب حقه أن يُخشى\n الإشارة: العلماء على قسمين: علماء بأحكام الله\n وعلماء بالله\n العلماء بالأحكام يخشون غضبه وعقابه\n والعلماء بالله يخشون إبعاده واحتجابه\n العلماء بالأحكام يتقون مواطن الآثام\n والعلماء بالله يتقون سوء الأدب في حضرة الملك العلاّم\n فخشية العلماء بالله أرق وأشد\n العلماء بالله أخذوا علمهم من الله\n والعلماء بالأحكام أخذوا علمهم عن الأموات\n قال الشيخ أبو يزيد رضي الله عنه: في علماء أهل الرواية: مساكين أخذوا علمهم ميت عن ميت\n وأخذنا علمنا عن الحي الذي لا يموت\n هـ\n والفرق بين الخوف والرهبة والخشية: أن الخوف من العقاب\n والرهبة من العتاب\n والخشية من الإبعاد\n قال القشيري: والفرق بين الخشية والرهبة: أنَّ الرهبة: خوفٌ يُوجِبُ هَرَبَ صاحبه\n فيجري في تفرقته\n والخشية إذا حصلت كَبَحَت صاحبها\n فيبقى مع الله\n فقدمت الخشية على الرهبة في الجملة\n والخوف قضية الإيمان\n قال تعالى:\n[آل عمران: 175]\n والخشية قضية العلم والهيبة\n هـ\n ثم قال: العالم يخاف تقصيره في حقِّ ربه\n والعارف يخشى من سوء أدبه وترْك احترامٍ\n وانبساط في غير وقت\n بإطلاق لَفْظٍ\n أو تَرخِيص بِترْكِ الأَوْلى\n هـ\n قال الورتجبي: الخوف عموم\n والخشية خصوص\n وقد قرن سبحانه الخشية بالعلم\n أي: العلم بالله وجلاله وقدره وربوبيته وعبوديته له\n وحقيقة الخشية: وقوع إجلال الحق في قلوب العارفين\n ممزوجاً بسنا التعظيم\n ورؤية الكبرياء والعظمة\n ولا يحصل ذلك إلا لمَن شاهد القدم\n والأزل\n والبقاء\n والأبد\n فمَن زاد علمه بالله زاد خشية\n لقوله صلى الله عليه وسلم: أنا أعرفكم بالله وأخشاكم منه \"\n هـ\n وفي الحديث:\n \" قيل يا رسول الله: أي الأعمال أفضل؟ قال:العلم قيل: أيُّ العلم؟ قال: العلم بالله سبحانه \" \nوقال صلى الله عليه وسلم:\n \" ما بال أقوام يتنزهون عن الشيء أصنعُه؟ والله إني لأعلمُكم بالله\n وأشدُّكم له خشيةً \"\n \n \nثم قال: عن جعفر الصادق: العلم أمْرُ تركِ الحرمة في العبادات\n وترك الحرمة في الحياء من الحق\n وترك الحرمة في متابعة الرسول\n وترك الحرمة في خدمة الأولياء الصدّيقين\n هـ\n ومعنى كلامه: أن العلم الحقيقي هو الذي يأمن صاحِبُه من انتهاك حرمة العبادات\n ومِن هتْك حرمة الاحتشام من الله ورسوله وأوليائه\n ومَن أراد من العلماء السلامة من الاغترار بالعلم فليطالع شرح ابن عباد\n في قول الحِكَم: \" العلم إن قارنته الخشية فلك\n وإلا\n فعليك \"\n وبالله التوفيق\n ولمَّا ذكر العلماء وذكر حملة القرآن فقال: { إِنَّ ٱلَّذِينَ يَتْلُونَ كِتَابَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:22",
      "similarity": 0.6502765424814487
    },
    {
      "verse": "16:13",
      "similarity": 0.5142835459364299
    },
    {
      "verse": "16:69",
      "similarity": 0.34002911060995855
    },
    {
      "verse": "16:49",
      "similarity": 0.32341176225511414
    },
    {
      "verse": "8:55",
      "similarity": 0.3071430617579798
    }
  ]
}