{
  "chapter": "فاطر",
  "text": "وان يكذبوك فقد كذب الذين من قبلهم جاءتهم رسلهم بالبينت وبالزبر وبالكتب المنير",
  "translations": [
    {
      "translation": "If they deny you, those before them also denied the truth. Their Messengers came to them with Clear Signs, and psalms and the Illuminating Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they call you a liar, so had those before them called their apostles liars, who had come to them with clear proofs, scriptures and the splendent Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they give the lie to you now, those that went before them also gave the lie to their Messengers when they came to them with Clear Proofs, with Scriptures, and with the Illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they reject you, (know that) others who lived before them had also rejected their Messengers, Messengers who had brought them miracles, scriptures, and the enlightening Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if these disbelievers deny you, those before them had also denied; their Noble Messengers came to them with clear proofs and scriptures and the bright Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you, those before them also denied. Their Messengers came to them with clear signs, and with the Scriptures, and with the Book giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they call you a liar, so did those before them indeed call (their apostles) liars; their apostles had come to them with clear arguments, and with scriptures, and with the illuminating book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they cry thee lies, those before them also cried lies; their Messengers came to them with the clear signs, the Psalms, the Illuminating Book;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny thee, those before them also denied. Their messengers came unto them with clear proofs (of Allah's Sovereignty), and with the Psalms and the Scripture giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they reject you, so did their predecessors. Messengers came to them with clear signs, with scriptures, and with the enlightening Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie thee, then surely those before them have also belied. Their apostles came Unto them with evidences and scriptures and a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they impugn you, those before them have impugned [likewise]: their apostles brought them manifest proofs, [holy] writs, and illuminating scriptures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they reject thee, so did their predecessors, to whom came their messengers with Clear Signs, Books of dark prophecies, and the Book of Enlightenment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie you, those before them also belied. Their Messengers came to them with clear signs, and with the Scriptures, and the book giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you, those before them also belied. Their Messengers came to them with clear signs; the Psalms, and the Illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they disbelieve you, those before them also disbelieved. Their messengers came to them with the clear proofs, with the Psalms, and with the Enlightening Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you - then already have those before them denied. Their messengers came to them with clear proofs and written ordinances and with the enlightening Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:25] And if they, that is, the people of Meccans, deny you, those before them also denied: their messengers brought them manifest signs, miracles, and with scriptures, such as the scrolls of Abraham, and with the illuminating Book, namely, the Torah and the Gospel, so endure [patiently] as they endured.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِنْ يُكَذِّبُوكَ فَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ وَبِالزُّبُرِ وَبِالْكِتَابِ الْمُنِيرِ (25) أعقب الثناء على النبي صلى الله عليه وسلم بتسليته على تكذيب قومه وتأنيسه بأن تلك سنة الرسل مع أممهم .وإذ قد كان سياق الحديث في شأن الأمم جعلت التسلية في هذه الآية بحال الأمم مع رسلهم عكس ما في آية آل عمران ( 184 ) : { فإن كذبوك فقد كذّب رسل من قبلك جاءوا بالبينات والزبر والكتاب المنير } لأن سياق آية آل عمران كان في ردّ محاولة أهل الكتاب إفحام الرسول لأن قبلها { الذين قالوا إن الله عهد إلينا أن لا نؤمن لرسول حتى يأتينا بقربان تأكله النار } \\[ آل عمران : 183 \\] .وقد خولف أيضاً في هذه الآية أسلوب آية آل عمران إذ قرن كل من «الزبر والكتاب المنير» هنا بالباء ، وجُرّدا منها في آية آل عمران وذلك لأن آية آل عمران جرت في سياق زعم اليهود أن لا تقبل معجزة رسول إلا معجزة قُربان تأكله النار ، فقيل في التفرد ببهتانهم : قد كُذّبت الرسل الذين جاء الواحد منهم بأصناف المعجزات مثل عيسى عليه السلام ومن معجزاتهم قرابين تأكلها النار فكذبتموهم ، فترك إعادة الباء هنالك إشارة إلى أن الرُسل جاءوا بالأنواع الثلاثة .ولما كان المقام هنا لتسلية الرسول صلى الله عليه وسلم ناسب أن يذكر ابتلاء الرسل بتكذيب أممهم على اختلاف أحوال الرسل؛ فمنهم الذين أتَوا بآيات ، أي خوارق عادات فقط مثل صالح وهود ولوط ، ومنهم من أتوا بالزبر وهي المواعظ التي يؤمر بكتابتها وزَبرها ، أي تخطيطها لتكون محفوظة وتردد على الألسن كزبور داود وكتب أصحاب الكتب من أنبياء بني إسرائيل مثل أرمياء وإيلياء ، ومنهم من جاءوا بالكتاب المنير ، يعني كتاب الشرائع مثل إبراهيم وموسى وعيسى ، فذكر الباء مشير إلى توزيع أصناف المعجزات على أصناف الرسل .فزبور إبراهيم صُحُفه المذكورة في قوله تعالى : { صحف إبراهيم وموسى } \\[ الأعلى : 19 \\] .وزبور موسى كلامه في المواعظ الذي ليس فيه تبليغ عن الله مثل دعائه الذي دعا به في قادش المذكور في الإِصحاح التاسع من سفر التثنية ، ووصيته في عَبر الأردن التي في الإِصحاح السابع والعشرين من السفر المذكور ، ومثل نشيده الوعظي الذي نطق به وأمر بني إسرائيل بحفظه والترنّم به في الإِصحاح الثاني والثلاثين منه ، ومثل الدعاء الذي بارك به أسباط إسرائيل في عَربات مُؤاب في آخر حياته في الإِصحاح الثالث والثلاثين منه .وزبور عيسى أقواله المأثورة في الأناجيل مما لم يكن منسوباً إلى الوحي .فالضمير في «جاءوا» للرسل وهو على التوزيع ، أي جاء مجموعهم بهذه الأصناف من الآيات ، ولا يلزم أن يجيء كل فرد منهم بجميعها كما يقال بنو فلان قتلوا فلاناً .وجواب { إن يكذبوك } محذوف دلت عليه علته وهي قوله : { فقد كذبت رسل من قبلك }\\[ فاطر : 4 \\] . والتقدير : إن يكذبوك فلا تحزن ، ولا تحسبهم مفلِتين من العقاب على ذلك إذ قد كذب الأقوام الذين جاءتهم رسل من قبل هؤلاء وقد عاقبناهم على تكذيبهم .فالفاء في قوله : { فقد كذب الذين من قبلهم } فاء فصيحة أو تفريع على المحذوف .وجملة { جاءتهم } صلة { الذين } ، و { من قبلهم } في موضع الحال من اسم الموصول مقدّم عليه أو متعلق ب { جاءتهم } .\n\n",
      "translations": [
        {
          "translation": "(And if they) the Quraysh (deny thee) Muhammad: (those before them also denied) those before your own folk, the Quraysh, have also denied their messengers. (Their messengers came unto them with clear proofs (of Allah's Sovereignty)) they came to them with commands, prohibitions and signs, (and with the Psalms and the Scripture) and with the events of the Scriptures of the people of old (giving light) expositing the lawful and the unlawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعت يا أكمل الرسل ما سمعت { إِن يُكَذِّبُوكَ } أولئك الكفرة المصرون على الشرك والعناد\n وأنكروا بك وبكتابك\n لا تبال بهم وبإنكارهم { فَقَدْ كَذَّبَ } الكفرة { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } أي: قبل هؤلاء المشركين رسلهم مع أنه { جَآءَتْهُمْ رُسُلُهُم } المبعوثون إليهم حال كونهم مؤيدين { بِٱلْبَيِّنَاتِ } أي: الدلائل الواضحات من المعجزات المثبتة لنبوتهم ورسالاتهم { وَبِٱلزُّبُرِ } والصحف المنزلة إليهم\n المشتملة على أصول أديانهم وبيان طرقهم { وَبِٱلْكِتَابِ ٱلْمُنِيرِ } [فاطر: 25] المظهر لسرائر التوحيد بحججه وبراهنيه القاطعة وحكمه وأحكامه الساطعة آثارها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِن يُكذّبوك } أي: قومك { فقد كَذَّب الذين مِن قبلهم } رسلهم\n حال كونهم قد { جاءتهم رُسُلُهم بالبينات } بالمعجزات الواضحة\n { وبالزُّبر } وبالصحف { وبالكتاب المنير } أي: التوراة\n والإنجيل\n والزبور\n ولَمَّا كانت هذه الأشياء من جنسهم\n أسند المجيء بها إليهمْ إسناداً مطلقاً\n وإن كان بعضُها في جميعهم\n وهي البينات\n وبعضها في بعضهم\n وهي الزُبُر والكتاب\n ويجوز أن يراد بالزُبر والكتاب واحد\n والعطف لتغاير الوصفين\n فكونها زُبُر باعتبار ما فيها من المواعظ التي تزبر القلوب\n وكونها كتباً منيرة لِمَا فيها من الأحكام والبراهين النيِّرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:184",
      "similarity": 0.9966910664616725
    },
    {
      "verse": "26:196",
      "similarity": 0.8235628666739113
    },
    {
      "verse": "54:52",
      "similarity": 0.798985161911104
    },
    {
      "verse": "21:105",
      "similarity": 0.7205002851724379
    },
    {
      "verse": "54:43",
      "similarity": 0.6802529158332851
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/035025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/035025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}