{
  "chapter": "فاطر",
  "text": "الم تر ان الله انزل من السماء ماء فاخرجنا به ثمرت مختلفا الونها ومن الجبال جددۢ بيض وحمر مختلف الونها وغرابيب سود",
  "translations": [
    {
      "translation": "Do you not see how God sends water from the sky, then We produce fruits from it variegated in colour; and on mountains are tracts of red and white, in different shades and raven black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah sent down water from the sky with which We brought forth fruits of diverse hues? In the mountains there are white and red, of diverse hues, and pitchy black;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God has sent water down from the sky, has produced fruits of various colors, and has made streaks of various colors in the mountains, white, red, and intense black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that it is Allah Who causes the water to descend from the sky? So with it We have grown various colourful fruits; and among the mountains are tracks white and red, of different hues, and others dark black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah sends down water from the sky, and We produce therewith fruits of various colors, and among the mountains are Judad, white and red, of varying colors and (others) Gharabib black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah sends down water from the cloud, then We bring forth therewith fruits of various colors; and in the mountains are streaks, white and red, of various hues and (others) intensely black?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that God sends down out of heaven water, and therewith We bring forth fruits of diverse hues? And in the mountains are streaks white and red, of diverse hues, and pitchy black;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen that Allah causeth water to fall from the sky, and We produce therewith fruit of divers hues; and among the hills are streaks white and red, of divers hues, and (others) raven-black;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see how God sent down water from the sky with which We bring forth fruit of diverse colours. In the mountains there are streaks of various shades of white and red, and jet-black rocks;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah sendeth down water from the heaven, and then We thereby bring fruit of diverse colours? And in the mountains are steaks white and red, of diverse colours, and also intensely black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah sends down water from the sky, with which We produce fruits of diverse hues. And in the mountains are stripes, white and red, of diverse hues, and [others] pitch black?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah sends down rain from the sky? With it We then bring out produce of various colours. And in the mountains are tracts white and red, of various shades of colour, and black intense in hue.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah sends down water (rain) from the sky, and We produce therewith fruits of varying colours, and among the mountains are streaks white and red, of varying colours and (others) very black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see how Allah sends down water from the sky and with it brings forth different colored fruits? In the mountains there are paths of various colors, of white and red, and jetblack.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God sends down water from the sky? With it We produce fruits of various colors. And in the mountains are streaks of white and red—varying in their hue—and pitch-black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah sends down rain from the sky, and We produce thereby fruits of varying colors? And in the mountains are tracts, white and red of varying shades and [some] extremely black.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:27] Have you not seen, [have you not] realised, that God sends down water from the heaven, wherewith We bring forth (there is here a shift from the third person [to the first person] address) fruits of diverse hues, such as green, red, and yellow [fruits] and so on? And in the mountains are streaks (judad is the plural of judda, which is a mountain trail or the like) white and red, and yellow, of diverse hues, some intense and some pale, and [others] pitch-black? (gharābību sūd is a supplement to judadun, ‘streaks’, meaning, darkblack rocks: one commonly says aswad ghirbīb, but rarely ghirbīb aswad).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) do you not know (that Allah causeth water) the rain (to fall from the sky, and We produce therewith fruit of diverse hues) sweet and sour fruits as well as other kinds; (and among the hills are streaks white and red, of diverse hues) like the diverse fruits, (and (others) raven black) black mountains, very intense in their blackness;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جُدَدٌ بِيضٌ } معناه طَرائقُ بيضٍ\n\n\n\n\nوقوله تعالى: { وَغَرَابِيبُ سُودٌ } معناه جِبالٌ سُودٌ\n والغَرابيبُ: هي السّودُ\n ويقال: أسود غربيب\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي المعتبر { أَنَّ ٱللَّهَ } المقتدر بالقدرة الكاملة كيف { أنزَلَ } وأفاض { مِنَ } جانب { ٱلسَّمَآءِ } أي: سماء الأسماء والصفات الذاتية { مَآءً } محيياً لأموات الأراضي المائتة الجامدة، الباقية على صرافة العدم { فَأَخْرَجْنَا بِهِ } أي: بالماء المفاض، المترشح من بحر الذات على أرض الطبيعة { ثَمَرَاتٍ } فواكه متنوعة من المعارف والحقائق والخواطف والواردات المختطفة على قلوب أرباب المحبة والولاء حسب حالاتهم ومقاماتهم { مُّخْتَلِفاً أَلْوَانُهَا } وكيفيتها علماً وعيناً وحقاً { وَمِنَ ٱلْجِبَالِ } التي هي الأوتاد والأقطاب القابلة لفيضان تلك الكرامات والفتوحات { جُدَدٌ } أي: ذوو طرق وسبل إلى كعبة الذات، وعرفات الأسماء والصفات { بِيضٌ } مصفى في غاية الصفا، بلا خلط ومزج لها بألوان التعينات والهويات أصلاً { وَ } بعضها { حُمْرٌ مُّخْتَلِفٌ أَلْوَانُهَا } باختلاف مراتب قربهم وبعدهم عن المرتبة الأولى { وَ } بعضها { غَرَابِيبُ سُودٌ } [فاطر: 27] أي: متناه في السواد والظلمة، بحيث لا يبقى فيها شائبة شبه بالمرتبة الأولى، بل هي مباين لها، مناقض إياها بحيث لا يبقى المناسبة بينهما أصلاً\n\n\n\n\nقيل: يشير سبحانه بالجدد البيض إلى طائفة الصوفية الذين هم صفّوا بواطنهم عما سوى الحق من الأمور المنصبغة بصبغ الأكوان وألوان الإمكان، وبالحمر المختلف الألوان إلى طائفة المتكلمين الذين بحثوا عن ذات الله وصفاته، متشبثين بالدلائل العقلية والنقلية الغير المؤيدة بالكشف والشهود، المفيدة للظلن والتخمين إلا نادراً، وبالغرابيب السود إلى طائفة الفقهاء الذين كثفت حجبهم وغلظت أغشيتهم وأعطيتهم إلى حيث لم يبق في فضاء قلوبهم موضع يليق لقبول انعكاس أشعبة أنوار الحق، بل سوَّدوها وصبغوها إلى حيث أخرجوها عن فطرة الله التي فطر الناس عليها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ أَلَمْ تَرَ أَنَّ ٱللَّهَ أنَزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُّخْتَلِفاً أَلْوَانُهَا وَمِنَ ٱلْجِبَالِ جُدَدٌ بِيضٌ وَحُمْرٌ مُّخْتَلِفٌ أَلْوَانُهَا وَغَرَابِيبُ سُودٌ وَمِنَ ٱلنَّاسِ وَٱلدَّوَآبِّ وَٱلأَنْعَامِ مُخْتَلِفٌ أَلْوَانُهُ كَذَلِكَ\n\n\n\n }  قلت: { مختلفاً }: نعت { ثمرات }\n و { مختلف ألوانه }: صفة لمحذوف، أي: صنف مختلف\n يقول الحق جلّ جلاله: { ألم تَرَ أن الله أنزلَ من السماء ماءً فأخرجنا به } بالماء { ثمراتٍ مختلفاً ألوانُها } أي: أجناسها، كالرمان، والتفاح، والتين، والعنب، وغيرها مما لا يُحصى، أو: ألوانها: هيئاتها من الحُمرة والصفرة ونحوهما\n { ومن الجبال جُدَد } طُرق مختلفة اللون\n جمع: جُدَّة، كمُدَّةٍ ومُدَدٍ\n والجُدة: الطريقة والخطة، تكون في الجبل، تخالف لون ما يليها\n وكل طريقة من سواد أو بياض فهي جُدة\n قاله الهروي\n وهي مبتدأ وخبر، أي: وطرق { بِيض وحُمْرٌ } كائنة من الجبال\n { وغرابيبُ سود } أي: ومنها غرابيب سود، أي: ومن الطرق سود غرابيب جمع: غربيب، وهي الذي أبعد في السواد وأغرب، ومنه: الغراب\n قال الهروي: هي الجواد ذوات الصخور السود، والغربيب: شديد السواد\n هـ\n وفي الصحاح: تقول هذا أَسود غربيب، أي: شديد السواد، وإذا قلت: غرابيب سود تجعل السود بدلاً من غرابيب لأن توكيد الألوان لا يتقدم\n هـ\n تقول: أصفر فاقع، وأسود حالك، ولا يتقدم الوصف، ونقل الكواشي عن أبي عبيد: أن في الآية تقديماً وتأخيراً، تقديره: وسود غرابيب\n وفائدته: أن يكون المؤكد مضمراً، والمظهر تفسيراً له، فيدل على الاعتناء به، لكونهما معاً يدلان على معنىً واحد\n هـ\n ولا بد من تقدير حذف مضاعف في قوله: { ومن الجبال جُدَد } أي: من الجبال ذو جدد بيض، وحمر، وسود غرابيب حتى يؤول إلى قولك: ومن الجبال مختلف ألوانه، كما قال: { ثمرات مختلفاً ألوانها }",
      "translations": []
    }
  ]
}