{
  "chapter": "فاطر",
  "text": "انا ارسلنك بالحق بشيرا ونذيرا وان من امة الا خلا فيها نذير",
  "translations": [
    {
      "translation": "We have sent you with the truth bringing good news and giving warning. There is no community to which a warner has not come.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you with the truth, to give glad tidings and to warn. Never has there been a community to which an admonisher was not sent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you with the Truth to proclaim good news and to warn. Never has there been a nation but a warner came to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you in all truth as a bearer of glad news and a warner. No nation who lived before was left without a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him), We have indeed sent you with the Truth, giving glad tidings and heralding warnings; and there was a Herald of Warning in every group.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have sent you with the truth, a bearer of glad tidings and a warner. And there never was a nation but a warner had passed among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent you with the truth as a bearer of good news and a warner; and there is not a people but a warner has gone among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent thee with the truth good tidings to bear, and warning; not a nation there is, but there has passed away in it a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have sent thee with the Truth, a bearer of glad tidings and a warner; and there is not a nation but a warner hath passed among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you with the truth as a bearer of good news and a warner, there is no community to which a warner has not come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have sent thee with the truth, as a bearer of glad tidings and as a warner; and there is not a community but there hath passed among them a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have sent you with the truth as a bearer of good news and as a warner; and there is not a nation but a warner has passed in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have sent thee in truth, as a bearer of glad tidings, and as a warner: and there never was a people, without a warner having lived among them (in the past).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! We have sent you with the truth, a bearer of glad tidings, and a warner. And there never was a nation but a warner had passed among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you with the truth, a bearer of glad tidings and warning, for there is no nation, that has not had a warner pass away in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent you with the truth; a bearer of good news, and a warner. There is no community but a warner has passed through it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have sent you with the truth as a bringer of good tidings and a warner. And there was no nation but that there had passed within it a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:24] Truly We have sent you with the truth, with [right] guidance, as a bearer of good tidings, to him who responds to it, and a warner, to him who does not respond to it. And there is not a community but there has passed, there has been, in it a warner, a prophet to warn it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We have sent thee) Muhammad (with the Truth) with the Qur'an, (a bearer of glad tidings) announcing Paradise for whoever believes in Allah (and a warner) from the Fire for whoever disbelieves in Allah; (and there is not a nation but a warner has passed among them) except that they had a warning messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّآ أَرْسَلْنَاكَ } من كمال لطفنا معك ملتبساً { بِٱلْحَقِّ } الصدق المطابق للواقع، داعياً لعموم عبادنا إلى توحيدنا { بَشِيراً } بما أعددنا لهم من المراتب العلية والمقامات السنية { وَنَذِيراً } لهم أيضاً بما أعتدنا من دركات النيران الموجبة لزفرات القلوب وحسرات الجنان { وَ } إرسالنا إياك ليس ببدع منا، بل { إِن مِّنْ أُمَّةٍ } أي: ما من أمة من ألامم الماضية { إِلاَّ خَلاَ } ومضى { فِيهَا نَذِيرٌ } [فاطر: 24] ينذرهم عا لا يعنيهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّا أرسلناك بالحق } أي: محقاً، أو: محقين: أو: إرسالاً مصحوباً بالحق، فهو حال من الفاعل، أو المفعول، أو صفة لمصدر محذوف، { بشيراً } لمَن آمن { ونذيراً } لمَن كفر، { وإِن من أُمَّةٍ إلا خلا فيها نذيرٌ } أي: ما من أمة من الأمم الماضية، قبل أمتك، إلا فيها نذير نبيّ، أو عالم، يخوفهم\n ويقال لأهل كل عصر: أمة\n والمراد هنا: أهل العصر\n قال ابن عطية: معناه: أن دعوة الله تعالى قد عمَّت جميع الخلق، وإن كان فيهم مَن لم تباشره النِّذارة، فهو ممن بَلَغَته الدعوة، لأن آدم بُعث إلى بنيه، ثم لم تنقطع النذارة إلى وقت محمد صلى الله عليه وسلم\n والآية تتضمن أن قريشاً لم يأتهم نذيرٌ، ومعناه: نذيرٌ مباشر، وما ذكر المتكلمون من فرض أصحاب الفترات ونحوهم، فإنما ذلك بالفرض، لا أنه توجد أُمةً لم تعلم أن في الأرض دعوة إلى عبادة الله\n هـ\n وذكر في الإحياء، في باب التوبة: أنه يشبه أن يكون مَن لم تبلغهم الدعوة في أطراف البلاد، وعاشوا على البله وعدم المعرفة، فلم تكن لهم معرفة، ولا جحود، ولا طاعة، ولا معصية، هم أهل الأعراف لأنه لا وسيلة تقربهم، ولا جناية تُبعدهم، فما هم من أهل الجنة، ولا من أهل النار، ويُتركون في منزلة بين المنزلتين، ومقام بين المقامين\n\n\nهـ\n وقال ابن مرزوق في شرح حديث هرَقْل: الدين الحق هو الإسلام، وما سواه باطل، عقلاً ونقلاً، فلا عذر لمنتحليه بالإجماع، كان متأولاً مجتهداً، أو مقلداً جاهلاً لأن أدلة الإسلام واضحة قطعية، ومخالف مقتضاها مخطىء قطعاً\n هـ\n وقال ابن عطية أيضاً، ما نصه: آدم عليه السلام فمن بعده، دعا إلى توحيد الله تعالى دعاءً عاماً، واستمر ذلك على العالم، فواجب على الآدمي أن يبحث عن الشرع، الآمر بتوحيد الله تعالى، وينظر في الأدلة المنصوبة على ذلك، بحسب إيجاب الشرع النظر فيها، ويؤمن، ولا يعبد غير الله، فمَن فرضناه لم يجد سبيلاً إلى العلم، فأولئك أهل الفترات، الذين أطلق عليهم أهل العلم أنهم في الجنة، وهم بمنزلة الأطفال والمجانين، ومن قصر في النظر والبحث، فَعَبَد صنماً أو غيره، وكفر، فهذا ترك الواجب عليه، مستوجب للعقاب بالنار\n هـ\n وقال أيضاً: إنما صاحب الفترة بفرض أنه آدمي، لم يصل إليه: أن الله بعث رسولاً، ولا دعا إلى دين ـ وهذا قليل الوجود ـ إلا إن شذ في أطراف الأرض، والمواضع المنقطعة عن العمران\n هـ\n والحاصل: أن مَن بلغه خبر الشرائع السابقة، والدعاء إلى توحيد الله، لا عذر له، وإنما بُعثت الرسل بعد ذلك تجديداً، ومبالغة في إزاحة العذر، وإكمال البيان\n قاله المحشي\n الإشارة: وما يستوي الأعمى، الذي لا يرى إلا حس الكائنات، والبصير، الذي فتحت بصيرته، فشاهد المكوّن، ولم يقف مع حس الكون، ولا الظلمات: المعاصي والغفلة ودائرة الحس، ونور اليقظة والعفة والمعرفة، ولا ظل برْد الرضا والتسليم، وحرور التدبير والاختيار، وما يستوي الأحياء، وهم العارفون بالله، الذاكرون الله، والأموات الجاهلون، أو الغافلون\n قال القشيري: { وما يستوي الأعمى والبصير\n\n\n } الآية، كذلك لا يستوي الموصول بنا والمشغول عنَّا، والمجذوبُ إلينا والمحجوبُ عنَّا، ومَن أشهدناه حقَّنا، ومَن أغفلنا قلبه عن ذِكْرِنا\n هـ\n وقوله تعالى: { وإِن من أُمةٍ إِلا خلا فيها نذير } النذير على قسمين: نذير من وبال الذنوب، ونذير من وبال العيوب\n فوبال الذنوب: العذاب، ووبال العيوب: الحجاب، فمَن تطهَّر من الذنوب استوجب نعيم الجنان، ومَن تطهّر من العيوب استوجب لذيذ الشهود والعيان\n فالنذير الأول عالم بأحكام الله، والثاني عارف بالله الأول مقتصد، والثاني سابق، ولا يخلو الدهر منهما، حتى يأتي أمر الله، فالشريعة باقية قائمة بقيام العلماء، والطريقة والحقيقة قائمتان بقيام الأولياء العارفين بالله، أهل التربية النبوية، بالاصطلاح، والهمة، والحال\n ومَن قال خلاف هذا فقد قال بالمحال\n ثم سلّى نبيه لأنه لمَّا أنذر قومه قابلوه بالتكذيب فقال: { وَإِن يُكَذِّبُوكَ فَقَدْ كَذَّبَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:18",
      "similarity": 0.6412510496196284
    },
    {
      "verse": "84:4",
      "similarity": 0.6261651866116598
    },
    {
      "verse": "2:134",
      "similarity": 0.584874492413792
    },
    {
      "verse": "2:141",
      "similarity": 0.584874492413792
    },
    {
      "verse": "10:102",
      "similarity": 0.5072554331925924
    }
  ]
}