{
  "chapter": "فاطر",
  "text": "ان الذين يتلون كتب الله واقاموا۟ الصلوة وانفقوا۟ مما رزقنهم سرا وعلانية يرجون تجرة لن تبور",
  "translations": [
    {
      "translation": "Those who recite the Book of Allah and establish salat and give of what We have provided for them, secretly and openly, hope for a transaction which will not prove profitless:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who read the Book of God, are firm in devotion, and spend of what We have given them in secret or openly, can hope for a commerce that will not decline,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who recite the Book of Allah and establish Prayer and spend, privately and publicly, out of what We have provided them, look forward to a trade that shall suffer no loss;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who recite the Book of God, who are steadfast in prayer and, who spend out of what We have given them for the cause of God, both in public and in private, have hope in an indestructible bargain\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who read the Book of Allah, and keep the prayer established, and spend from what We have bestowed upon them in secret and publicly, are hopeful of a trade in which there is never a loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who recite the Book of Allah, and perform the Salah, and spend out of what We have provided for them, secretly and openly, they hope for a (sure) trade-gain that will never perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they who recite the Book of Allah and keep up prayer and spend out of what We have given them secretly and openly, hope for a gain which will not perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who recite the Book of God and perform the prayer, and expend of that We have provided them, secretly and in public, look for a commerce that comes not to naught,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who read the Scripture of Allah, and establish worship, and spend of that which We have bestowed on them secretly and openly, they look forward to imperishable gain,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who read the Book of God and attend to their prayers and spend in charity in private and in public out of what We have provided them, may hope for a commerce that suffers no loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those Who read the book of Allah and establish prayer and expend of that wherewith We have provided them, secretly and in open, hope for a merchandise that shall not perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who recite the Book of Allah and maintain the prayer, and spend secretly and openly out of what We have provided them, expect a commerce that will never go bankrupt,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who rehearse the Book of Allah, establish regular Prayer, and spend (in Charity) out of what We have provided for them, secretly and openly, hope for a commerce that will never fail:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who recite the Book of Allah (this Quran), and perform AsSalat (IqamatasSalat), and spend (in charity) out of what We have provided for them, secretly and openly, hope for a (sure) tradegain that will never perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who recite the Book of Allah and establish their prayers and spend, in secret and in public of that which We have provided them, look for a trade that does not come to nothing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who recite the Book of God, and perform the prayer, and spend of what We have provided for them, secretly and publicly, expect a trade that will not fail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who recite the Book of Allah and establish prayer and spend [in His cause] out of what We have provided them, secretly and publicly, [can] expect a profit that will never perish -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:29] Indeed those who recite the Book of God and observe prayer, they maintain [performance of] it, and expend of what We have provided them secretly and openly, [to give] as alms and otherwise, anticipate a commerce that will never be ruined,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who read the Scripture of Allah) those who read the Qur'an, i.e. Abu Bakr and his fellow believers, (and establish worship) and perform the five daily prayers, (and spend) in charity (of that which We have bestowed on them) of wealth (secretly) between them and Allah (and openly) in front of people, (they look forward to imperishable gain) i.e. Paradise,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الذين يتلون كتاب الله } الذي أعطاهم في بدء الفطرة من العقل القرآني بإظهاره وإبرازه ليصير فرقاناً { وأقاموا } صلاة الحضور القلبي عند ظهور العلم الفطري { وأنفقوا مما رزقناهم } من صفة العلم والعمل الموجب لظهوره عليهم { سرّاً } بالتجريد عن الصفات { وعلانية } بترك الأفعال { يرجون } في مقام القلب بالترك والتجريد { تجارة لن تبور } من استبدال أفعال الحق وصفاته بأفعالهم وصفاتهم { ليوفيهم أجورهم } في جنات النفس والقلب من ثمرات التوكل والرضا { ويزيدهم من فضله } في جنات الروح مشاهدات وجهه في التجليات { إنه غفور } يستر لهم ذنوب أفعالهم وصفاتهم { شكور } يشكر سعيهم بالإبدال من أفعاله وصفاته\n { والذي أوحينا إليك من الكتاب } الفرقاني المطلق { هو الحق } الثابت المطلق الذي لا مزيد عليه ولا نقص فيه { مصدّقاً لما بين يديه } لكونه مشتملاً عليها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { إِنَّ ٱلَّذِينَ يَتْلُونَ كِتَابَ ٱللَّهِ } المنزل على رسوله { وَأَقَامُواْ ٱلصَّلاَةَ } المفروضة\n المكتوبة في الأوقات المحفوظة\n المأمورة إياهم في كتاب الله { وَأَنفَقُواْ } طلباً لمرضاتنا { مِمَّا رَزَقْنَاهُمْ } وسقنا إليهم من الرزق الصوري والمعنوي { سِرّاً } خفية من الناس\n اتقاءً عن وصمة الرياء والسمعة\n ومن الفقراء المستحقين أيضاً\n صوناً لهم عن أن يتأذوا حين أخذوا { وَعَلاَنِيَةً } أيضاً بعدما اقتضى المحل إعلامه\n ولم يتأت منه الإخفاء { يَرْجُونَ } من الله بالأفعال المذكورة { تِجَارَةً } من الأحوال والمقامات { لَّن تَبُورَ } [فاطر: 29] أي: لن تهلك وتفسد وتفنى أصلاً\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن الذين يتلون كتابَ الله } أي: يُداومون على تلاوة القرآن { وأقاموا الصلاةَ } أتقنوها في أوقاتها\n { وأنفقوا مما رزقناهم } فرضاً ونفلاً { سراً وعلانيةً } مسرّين النفل\n ومعلنين الفرض\n ولم يقنعوا بتلاوته عن العمل به\n وخبر \" إن \": قوله: { يرجُونَ تجارةً لن تبور } لن تكسد\n وهو ثواب أعمالهم\n يعني: يطلبون تجارة ينتفي عنها الكسد\n وتنفق عند الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:28",
      "similarity": 0.5055467969423069
    },
    {
      "verse": "48:12",
      "similarity": 0.5036699854983242
    },
    {
      "verse": "25:18",
      "similarity": 0.489062507907428
    },
    {
      "verse": "35:10",
      "similarity": 0.404496077427366
    },
    {
      "verse": "4:29",
      "similarity": 0.343943713516273
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/35:29.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/35:29.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/35:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}