{
  "chapter": "فاطر",
  "text": "وان يكذبوك فقد كذب الذين من قبلهم جاءتهم رسلهم بالبينت وبالزبر وبالكتب المنير",
  "translations": [
    {
      "translation": "If they call you a liar, so had those before them called their apostles liars, who had come to them with clear proofs, scriptures and the splendent Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they give the lie to you now, those that went before them also gave the lie to their Messengers when they came to them with Clear Proofs, with Scriptures, and with the Illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they reject you, (know that) others who lived before them had also rejected their Messengers, Messengers who had brought them miracles, scriptures, and the enlightening Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if these disbelievers deny you, those before them had also denied; their Noble Messengers came to them with clear proofs and scriptures and the bright Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you, those before them also denied. Their Messengers came to them with clear signs, and with the Scriptures, and with the Book giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they call you a liar, so did those before them indeed call (their apostles) liars; their apostles had come to them with clear arguments, and with scriptures, and with the illuminating book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they cry thee lies, those before them also cried lies; their Messengers came to them with the clear signs, the Psalms, the Illuminating Book;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny thee, those before them also denied. Their messengers came unto them with clear proofs (of Allah's Sovereignty), and with the Psalms and the Scripture giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they reject you, so did their predecessors. Messengers came to them with clear signs, with scriptures, and with the enlightening Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie thee, then surely those before them have also belied. Their apostles came Unto them with evidences and scriptures and a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they impugn you, those before them have impugned [likewise]: their apostles brought them manifest proofs, [holy] writs, and illuminating scriptures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they reject thee, so did their predecessors, to whom came their messengers with Clear Signs, Books of dark prophecies, and the Book of Enlightenment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie you, those before them also belied. Their Messengers came to them with clear signs, and with the Scriptures, and the book giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you, those before them also belied. Their Messengers came to them with clear signs; the Psalms, and the Illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they disbelieve you, those before them also disbelieved. Their messengers came to them with the clear proofs, with the Psalms, and with the Enlightening Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you - then already have those before them denied. Their messengers came to them with clear proofs and written ordinances and with the enlightening Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:25] And if they, that is, the people of Meccans, deny you, those before them also denied: their messengers brought them manifest signs, miracles, and with scriptures, such as the scrolls of Abraham, and with the illuminating Book, namely, the Torah and the Gospel, so endure [patiently] as they endured.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they) the Quraysh (deny thee) Muhammad: (those before them also denied) those before your own folk, the Quraysh, have also denied their messengers. (Their messengers came unto them with clear proofs (of Allah's Sovereignty)) they came to them with commands, prohibitions and signs, (and with the Psalms and the Scripture) and with the events of the Scriptures of the people of old (giving light) expositing the lawful and the unlawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعت يا أكمل الرسل ما سمعت { إِن يُكَذِّبُوكَ } أولئك الكفرة المصرون على الشرك والعناد، وأنكروا بك وبكتابك، لا تبال بهم وبإنكارهم { فَقَدْ كَذَّبَ } الكفرة { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } أي: قبل هؤلاء المشركين رسلهم مع أنه { جَآءَتْهُمْ رُسُلُهُم } المبعوثون إليهم حال كونهم مؤيدين { بِٱلْبَيِّنَاتِ } أي: الدلائل الواضحات من المعجزات المثبتة لنبوتهم ورسالاتهم { وَبِٱلزُّبُرِ } والصحف المنزلة إليهم، المشتملة على أصول أديانهم وبيان طرقهم { وَبِٱلْكِتَابِ ٱلْمُنِيرِ } [فاطر: 25] المظهر لسرائر التوحيد بحججه وبراهنيه القاطعة وحكمه وأحكامه الساطعة آثارها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}