{
  "chapter": "فاطر",
  "text": "ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له منۢ بعده وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "Any mercy Allah opens up to people, no one can withhold, and any He withholds, no one can afterwards release. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none who can take away the favours He bestows on man; and there is none apart from Him to restore what He has withheld. He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever Mercy Allah accords to people, none can withhold; and whatever He withholds, no other will be able to release after Him. He is Most Mighty, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can withhold whatever mercy God grants to the human being, nor can one release whatever He withholds. He is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can withhold the mercy which Allah opens to mankind; and whatever He withholds – so after it, none can release it; and only He is the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever of mercy, Allah may grant to mankind, none can withhold it; and whatever He may withhold, none can grant it thereafter. And He is the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever Allah grants to men of (His) mercy, there is none to withhold it, and what He withholds there is none to send it forth after that, and He is the Mighty, the Wise\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever mercy God opens to men, none can withhold and whatsoever He withholds, none can loose after Him. He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which Allah openeth unto mankind of mercy none can withhold it; and that which He withholdeth none can release thereafter. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can withhold the blessings God bestows upon people, nor can anyone apart from Him bestow whatever He withholds: He is the Almighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever of mercy Allah may grant Unto mankind none there is to withhold it; and whatsoever He may with hold none there is to release it thereafter. And He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever mercy Allah unfolds for the people, no one can withhold it; and whatever He withholds no one can release it except Him, and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What Allah out of his Mercy doth bestow on mankind there is none can withhold: what He doth withhold, there is none can grant, apart from Him: and He is the Exalted in Power, full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever of mercy (i.e. of good), Allah may grant to mankind, none can withhold it, and whatever He may withhold, none can grant it thereafter. And He is the AllMighty, the AllWise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever mercy Allah opens to people, none can withhold; and whatever He withholds none can release after Him. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever mercy God unfolds for the people, none can withhold it. And if He withholds it, none can release it thereafter. He is the Exalted in Power, Full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever Allah grants to people of mercy - none can withhold it; and whatever He withholds - none can release it thereafter. And He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:2]   Whatever mercy God unfolds for mankind, in the way of provision or rain, none can withhold it; and whatever He withholds, thereof, none can release it after Him, that is, after His withholding it. And He is the Mighty, Whose way prevails, the Wise, in what He does.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That which Allah openeth) that which Allah sends (unto mankind of mercy) of rain, provision or well-being (none can withholdeth it) none can stop such a mercy; (and that which He withholds none can release thereafter) none can release it after He withholds it. (He is the Mighty) in His withholding, (the Wise) in that which He sends.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال قدرته سبحانه أنه { مَّا يَفْتَحِ ٱللَّهُ } المدبر لأحوال عباده { لِلنَّاسِ } الناسين حقوق تربيته وتدبيره سبحانه { مِن رَّحْمَةٍ } فائضة لهم بمقتضى جوده تفضلاً عليهم من النبوة والرسالة والولاية والكرامة والعلم والمعرفة والرشد والهداية\n وغير ذلك من الكمالات الفائضة من عنده سبحانه { فَلاَ مُمْسِكَ لَهَا } أي: لا مانع لها يمنعها عنهم { وَمَا يُمْسِكْ } ويمنع سبحانه من أمر بمقتضى قهره وجلاله { فَلاَ مُرْسِلَ لَهُ } يرسله إليهم { مِن بَعْدِهِ } أي: بعد منعه سبحانه { وَ } كيف يسع لأحد ما يمنعه\n إذ { هُوَ ٱلْعَزِيزُ } المقصود\n المنحصر ذاته على العزة والغلبة\n لا عزيز دونه { ٱلْحَكِيمُ } [فاطر: 2] المستقل في المنع والإرسال إرادةً\n لا يُسأل عن فعله\n ولا مبدل لقوله: ولا معقب لحكمه\n\nثم نادى سبحانه أهل النعمة وخاطبهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "الحق جلّ جلاله: { ما يَفْتَح اللهُ للناسِ من رحمة } أي: ما يطلق ويرسل من رحمة، كنعمة، ومطر، وأمن، وعافية، ورزق، وعلم، ومعرفة، ونبوة، وغيرها، { فلا مُمسِكَ لها } فلا أحد يقدر على إمساكها وردها، واستعير الفتح للإطلاق لأنه مسبب عنه. ونكّر الرحمة للإشاعة والإبهام، كأنه قال: من أيّ رحمة كانت، فتشمل نعمة الدفع والجلب، كدفع المحن وجلب المنن. والاعترافُ بالمنعم من تمام النعمة، والأمران مدرجان في الفتح والإمساك، { وما يُمْسِكْ } أي: يمنع ويحبس من ذلك { فلا مُرسل له } فلا مُطلق له { من بعده } من بعد إمساكه. وأنث الضمير الراجع إلى الاسم المتضمِّن معنى الشرط على معنى الرحمة، وذكّره حملاً على لفظ المرجوع إليه إذ لا تأنيث فيه لأن الأول فسّر بالرحمة، فحسن اتباع الضمير التفسير، ولم يفسر الثاني فتُرك على أصل التذكير. وعن معاذ رضي الله عنه مرفوعاً: \" لا تزال يدُ الله مبسوطة على هذه الأمة ما لم يرفُقْ خيارُهم بشرارهم، ويُعظّمْ بَرُّهُم فاجرَهم، وتعِنْ قراؤهم أمراءهم على معصية الله. فإذا فعلوا ذلك نزع الله يده عنهم \" قال ابن عرفة: يُؤخذ من قوله تعالى: { وما يُمسك... } أن العدم السابق الإضافي متعلق للقدرة، وجعله بعض الأصوليين متعلقاً للإرادة أيضاً، وذلك لأن المصحح للتعلُّق الإمكان. هـ. قال الأُبي: لا دليل في الآية لاحتمال أن يكون التقدير: وما يريد إمساكه، فيكون من متعلقات الإرادة، ويحتمل: وما يُمسك عن الإرسال بعد وجوده، كإمساك الماء عن النزول بعد خلقه في السحاب. هـ. { وهو العزيزُ } الغالب، القادر على الإرسال والإمساك. { الحكيمُ } الذي يُرسل ويُمسك، بما تقتضي الحكمة إرساله، أو إمساكه. الإشارة: ما يفتح الله لقلوب عباده من نفحات، وواردات، وإلهامات، وعلوم لدنية، وحِكَم ربانية، وتعرفات جمالية وجلالية، فلا ممسك لها، بل الله يفتح على مَن يشاء، ويسد الباب في وجه مَن شاء. وسدُّ الباب في وجه العبد عن معرفته الخاصة، علامته: عدم إيصاله إلى أوليائه. فكل مَن وصله إليهم، وصَحِبهم، وعظَّمهم، وخدمهم، فقد فتح الله له الباب في وصوله إليه، وكل مَن نكبه عنهم، ولم يصحبهم، كما ذكر، فقد سُدّ الباب في وجهه عن معرفته العيانية. وفي الحكم: \" سبحان مَن لم يجعل الدليل على أوليائه إلا من حيث الدليل عليه، ولم يوصل إليهم إلا مَن أراد أن يوصله إليه \". وما يُمسك من ذلك فلا مرسل له من بعده، ولو صلّى وصام ألف عام. قال القشيري: ما يلوح لقلوب العارفين من أنوار التحقيق لا سحاب يستره، ولا ضباب يقهره. ويقال: ما يلزم قلوبَ أوليائه وأحوالهم من التيسير فلا مُمسك له، والذي يمنع من أعدائه ـ بسبب ما يُلقيهم فيه من انغلاق الأمور واستصعابها ـ فلا مُيَسِّرَ له من دونه. هـ. وبالله التوفيق. ثم ذكرهم بالميعاد لأن تذكر النعم سبب الفتح فقال: { يٰأَيُّهَا ٱلنَّاسُ ٱذْكُرُواْ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:21",
      "similarity": 0.5221540024369249
    },
    {
      "verse": "48:1",
      "similarity": 0.45126534512114586
    },
    {
      "verse": "43:43",
      "similarity": 0.4504880162715464
    },
    {
      "verse": "110:1",
      "similarity": 0.42486855820048325
    },
    {
      "verse": "26:118",
      "similarity": 0.40178878635886306
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/35:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/35:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}