{
  "chapter": "فاطر",
  "text": "وقالوا۟ الحمد لله الذى اذهب عنا الحزن ان ربنا لغفور شكور",
  "translations": [
    {
      "translation": "They will say, 'Praise be to Allah who has removed all sadness from us. Truly our Lord is Ever-Forgiving, Ever-Thankful:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"All praise be to God who has removed all care from us. Indeed our Lord is forgiving and rewarding,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: “All praise be to Allah Who has taken away all sorrow from us. Surely our Lord is Most Forgiving, Most Appreciative;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"It is only God who deserves all praise. He has removed all of our suffering. Our Lord is certainly All-forgiving and All-appreciating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say; “All praise is to Allah Who has put away our grief; indeed Our Lord is Oft Forgiving, Most Appreciative.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"All praise and thanks be to Allah, Who has removed from us (all) grief. Verily, our Lord is indeed Oft-Forgiving, Most Ready to appreciate.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say: (All) praise is due to Allah, Who has made grief to depart from us; most surely our Lord is Forgiving, Multiplier of rewards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say, 'Praise belongs to God who has put away all sorrow from us. Surely our Lord is All-forgiving, All-thankful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Praise be to Allah Who hath put grief away from us. Lo! Our Lord is Forgiving, Bountiful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Praise be to God who has taken away all sorrow from us. Our Lord is forgiving and appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will Say: all praise Unto Allah who hath taken away grief from us. verily, our Lord is Forgiving, Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘All praise belongs to Allah, who has removed all grief from us. Indeed Our Lord is all-forgiving, all-appreciative,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"Praise be to Allah, Who has removed from us (all) sorrow: for our Lord is indeed Oft-Forgiving Ready to appreciate (service):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"All the praises and thanks be to Allah, Who has removed from us (all) grief. Verily, our Lord is indeed OftForgiving, Most Ready to appreciate (good deeds and to recompense).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: 'Praise belongs to Allah who has removed all sorrow from us. Indeed, our Lord is the Forgiver, the Thanker.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, “Praise God, who has lifted all sorrow from us. Our Lord is Most Forgiving, Most Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, \"Praise to Allah, who has removed from us [all] sorrow. Indeed, our Lord is Forgiving and Appreciative -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:34] And they will say, ‘Praise be to God Who has removed, all, grief from us. Truly our Lord is Forgiving, of sins, Appreciative, of obedience,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) the inhabitants of Paradise say in Paradise: (Praise be to Allah) thanks and gratitude belong to Allah (who hath put grief) the grief of death, evanescence and the terrors of the Day of Judgement; it is also said that this means: the grief of the risks involved in the life of this world (away from us. Lo! Our Lord is Forgiving) He forgives great sins, (Bountiful) He is grateful for even the slightest of good works,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلْحَمْدُ للَّهِ ٱلَّذِيۤ أَذْهَبَ عَنَّا ٱلْحَزَنَ } معناه خوفُ النَّارِ\n وقال: هَمُّ الدّنيا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما وصلوا إلى مقام القرب، بل اتصلوا برفع أنانيتهم وهوياتهم الباطلة عن البين إلى ما انقلبوا { قَالُواْ } بألسنة استعداداتهم موافقاً لقلوبهم: { ٱلْحَمْدُ } أي: جنس الحمد والثناء الشامل لجميع محامد جميع الحامدين قولاً وفعلاً وحالاً مقالاً، مختص { للَّهِ } المستحق بالاستحقاق الذاتي والوصفي { ٱلَّذِيۤ أَذْهَبَ } وأزال { عَنَّا ٱلْحَزَنَ } المورث لنا من لوازم تعيناتنا وإمكاننا { إِنَّ رَبَّنَا } الذي ربانا بأنواع الكرامة، ونجانا عن مضيق الإمكان المورث لأنواع الخذلان والخسران { لَغَفُورٌ } لذنوب أنانياتنا { شَكُورٌ } [فاطر: 34] يقبل منا، يقربنا إلى فضاء توحيده بتوفيقه وتأييده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا } بعد دخولهم الجنة: { الحمدُ لله الذي أذْهَبَ عنا الحزَن } خوف النار، أو: خوف الموت، أو: الخاتمة، أو: هَم الرزق\n والتحقيق: أنه يعم جميع الأحزان والهموم، دنيوية أو أخروية، وعن ابن عمر: قال النبي صلى الله عليه وسلم:\n\n \" ليس على أهل لا إله إلا الله وحشة، في قبورهم، ولا في محشرهم، وكأني بأهل لا إله إلا الله يخرجون من قبورهم، وهم ينفضون التراب عن وجوههم، فيقولون: الحمد لله الذي أذهب عنا الحزن \" \n\n{ إِنَّ ربنا لغفور شكور } يغفر الجنايات، وإن كثرت، ويقبل الطاعات، ويشكر عاملها، وإن قلَّت\n { الذي أحللنا دارَ المُقَامة } أي: دار الإقامة لا نبرح عنها ولا نُفارقها",
      "translations": []
    }
  ]
}