{
  "chapter": "فاطر",
  "text": "يايها الناس اذكروا۟ نعمت الله عليكم هل من خلق غير الله يرزقكم من السماء والارض لا اله الا هو فانى تؤفكون",
  "translations": [
    {
      "translation": "Mankind! remember Allah's blessing to you. Is there any creator other than Allah providing for you from heaven and earth? There is no god but Him. So how have you been perverted?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you people, remember the favours of God to you. Is there any creator other than God who gives you food from the heavens and the earth? There is no god but He: How then can you turn aside?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, remember Allah's favour upon you. Is there any creator, apart from Allah, who provides you your sustenance out of the heavens and earth? There is no god but He. Whither are you, then, being misdirected?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, remember the bounty of God that He has granted to you. Is their any creator besides God who could provide you with sustenance from the heavens and the earth? He is the only God. Where then can you turn away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Remember the favour of Allah upon you; is there a Creator other than Allah who can provide you sustenance from the sky and the earth? There is no God except Him; so where are you reverting?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Remember the grace of Allah upon you! Is there any creator other than Allah who provides for you from the sky (rain) and the earth La ilaha illa Huwa. How then are you turning away (from Him)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! call to mind the favor of Allah on you; is there any creator besides Allah who gives you sustenance from the heaven and the earth? There is no god but He; whence are you then turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, remember God's blessing upon you; is there any creator, apart from God, who provides for you out of heaven and earth? There is no god but He: how then are you perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Remember Allah's grace toward you! Is there any creator other than Allah who provideth for you from the sky and the earth? There is no Allah save Him. Whither then are ye turned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, remember God's favour to you. Is there any creator other than God who provides for you from the heavens and the earth? There is no God save Him. How then are you turned away from the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! remember the favour of Allah toward you. Is there any Creator other than Allah who provideth for you from the heaven and the earth? There is no god but He. Wither then are ye deviating?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Remember Allah’s blessing upon you! Is there any creator other than Allah who provides for you from the sky and the earth? There is no god except Him. So where do you stray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! Call to mind the grace of Allah unto you! is there a creator, other than Allah, to give you sustenance from heaven or earth? There is no god but He: how then are ye deluded away from the Truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Remember the Grace of Allah upon you! Is there any creator other than Allah who provides for you from the sky (rain) and the earth? La ilaha illa Huwa (none has the right to be worshipped but He). How then are you turning away (from Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, remember the blessings of Allah to you. Except for Allah, is there any other creator who provides for you out of heaven and earth? There is no god except He. Where then do you turn?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Remember God’s blessings upon you. Is there a creator other than God who provides for you from the heaven and the earth? There is no god but He. So how are you misled?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, remember the favor of Allah upon you. Is there any creator other than Allah who provides for you from the heaven and earth? There is no deity except Him, so how are you deluded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:3] O people, that is, the people of Mecca, remember God’s grace to you, in His making you dwell within the [Meccan] Sanctuary and preventing raids against you. Is there any creator (min khāliqin: min is extra; khāliq is the subject) other than God (read ghayru’Llāhi or gharyri’Llāhi, as an adjectival qualification of khāliq, ‘creator’, either concording with the [oblique] form [of min khāliqin] or concording with the syntactical status [thereof]; the predicate of the subject [is the following]) who provides for you from the heaven, rain, and, from the, earth?, vegetation (the interrogative is [actually] an affirmative, that is to say, ‘there is no creator or provider other than Him). There is no god except Him. So how then do you deviate?, how are you turned away from affirming His Oneness when you already affirm that He is the Creator and the Provider?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind) people of Mecca! (Remember Allah's grace towards you) in the form of rain, provision and well-being! (Is there any creator) any god (other than Allah who provideth for you from the sky) rain (and the earth) vegetation? (There is no God save Him) who provides you. (Whither then are ye turned) from whence do you lie and claim that your deities provide for you?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليقبلوا عليه ويواظبوا على شكر نعمه فقال: { يٰأَيُّهَا ٱلنَّاسُ } المجبولون على الغفلة والنسيان { ٱذْكُرُواْ نِعْمَتَ ٱللَّهِ } الفائضة { عَلَيْكُمْ } واشكروا له\n أداء لحقوق كرمه\n وتفكروا في آلائه ونعمائه { هَلْ مِنْ خَالِقٍ غَيْرُ ٱللَّهِ } المتوحد بوجوب الوجود ودوام البقاء { يَرْزُقُكُمْ مِّنَ ٱلسَّمَآءِ وَٱلأَرْضِ } أي: من امتزاج العلويات بالسفليات\n واختلاط الفواعل والأسباب مع القوابل والمسببات المسخرة تحت قدرة العليم الحكيم\n لينكشف لكم ويتبين أنه { لاَ إِلَـٰهَ } يعبد بالحق ويُتوجه إليه\n ويُسند الحوادث إلى حكمه والنعم الفائضة إلى فضله وجوده { إِلاَّ هُوَ } الله الحق الحقيق بالإطاعة والرجوع\n لا مرجع سواه ولا مقصد إلا هو { فَأَنَّىٰ تُؤْفَكُونَ } [فاطر: 3] وكيف تُصرفون عن توحيد\n وتُردون عن بابه أيها الآفكون المجرمون\n\n\n{ وَ } بعدما بعثت يا أكمل الرسل لإرشاد أهل الضلال وتبليغ الرسالة إليهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { غيرُ الله }: من رفعه فنعت للمحل\n أي: هل خالق غير الله\n ومن جره: فنعت للفظ\n و { يرزقكم }: إما استئناف\n أو: صفة ثانية لخالق\n و { لا إله إلا هو }: مستأنفة\n لا محل لها\n يقول الحق جلّ جلاله: { يا أيها الناس اذكروا نعمةَ اللهِ عليكم } باللسان والقلب\n وهي التي تقدمت\n من بسط الأرض كالمهاد\n ورفع السماء بلا عماد\n وإرسال الرسل للهداية والإرشاد\n والزيادة في الخلق\n وفتح أبواب الرزق\n ثم نبَّه على أصل النعم\n وهو توحيد المُنْعم\n فقال: { هل من خالق غيرُ اللهِ يرزقكم من السماء } بالمطر { والأرض } بالنبات\n بل لا خالق يرزق غيره\n { لا إِله إِلا هو فأنى تُؤفكون } فمن أيِّ وجه تُصرفون عن التوحيد إِلى الشرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:62",
      "similarity": 0.713070900532231
    },
    {
      "verse": "43:87",
      "similarity": 0.6782736089014698
    },
    {
      "verse": "10:34",
      "similarity": 0.5462268348169121
    },
    {
      "verse": "29:61",
      "similarity": 0.4971204983665316
    },
    {
      "verse": "44:13",
      "similarity": 0.4324715367505935
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/35:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/35:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/35:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}