{
  "chapter": "فاطر",
  "text": "جنت عدن يدخلونها يحلون فيها من اساور من ذهب ولؤلؤا ولباسهم فيها حرير",
  "translations": [
    {
      "translation": "They will enter the gardens of Eden, where they will be adorned with bracelets of gold and pearls, and of silk will be their garments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall enter the everlasting Gardens, shall be adorned with bracelets of gold and with pearls, and their apparel therein shall be silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will enter the gardens of Eden wherein they will be decked with bracelets of gold, pearls, and silk garments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall enter the Gardens of everlasting stay (Eden) – in which they shall be given to adorn armlets of gold and pearls; and their garment in it is silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`Adn (Gardens) will they enter, therein will they be adorned with bracelets of gold and pearls, and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of perpetuity, they shall enter therein; they shad be made to wear therein bracelets of gold and pearls, and their dress therein shall be silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eden they shall enter; therein they shall be adorned with bracelets of gold and with pearls, and their apparel there shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eden! They enter them wearing armlets of gold and pearl and their raiment therein is silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they shall enter the Gardens of Eternity, where they shall be adorned with bracelets of gold and pearls, and wear silk garments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens Everlasting! these they Shall enter, wearing therein bracelets of gold and pearls, and their raiment therein shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eden, which they will enter, adorned therein with bracelets of gold and pearl, and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eternity will they enter: therein will they be adorned with bracelets of gold and pearls; and their garments there will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adn (Eden) Paradise (everlasting Gardens) will they enter, therein will they be adorned with bracelets of gold and pearls, and their garments there will be of silk (i.e. in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall enter the Gardens of Eden, where they shall be adorned with bracelets of gold and with pearls, and there, their robes shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Gardens of Eden, which they will enter. They will be adorned therein with gold bracelets and pearls, and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[For them are] gardens of perpetual residence which they will enter. They will be adorned therein with bracelets of gold and pearls, and their garments therein will be silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:33] Gardens of Eden, as a [permanent] residence, into which they will be admitted, the three [types of servants mentioned] (read active yadkhulūnahā, ‘they will enter it’, or passive yudkhalūnahā, ‘into which they will be admitted’, as the predicate of the subject jannāt, ‘gardens’) — therein they will be adorned (yuhallawna is a second predicate) with, some, bracelets of gold and pearls, studded with gold, and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then showed their abode, saying: (Gardens of Eden!) the chamber of the Beneficent is their dwelling, with the Gardens surrounding it. (They enter them wearing armlets of gold and pearl) this is the attire of women while the attire of men will be made of gold (and their raiment therein) in Paradise (is silk).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة فضل الله إياهم في أخراهم: { جَنَّاتُ عَدْنٍ } معدة لهم نزلاً ومنزلاً من عند الله { يَدْخُلُونَهَا } فريحن مسرورين آمنين فائزين فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر { يُحَلَّوْنَ فِيهَا } تزييناً وتفضلاً { مِنْ أَسَاوِرَ } جزاء ما اقترفوا بأيديهم من الحسنات { مِن ذَهَبٍ } خالص مقابلة إخلاصهم في أعمالهم { وَلُؤْلُؤاً } أي: يحلون أيضاً من أنواع اللآلئ بدل ما يتقون نفوسهم من الميل إليها في نشأتهم الأولى { وَلِبَاسُهُمْ فِيهَا حَرِيرٌ } [فاطر: 33] بدل ما يلبسون من الخشن في طريق المجاهدة والسلوك نحو الحق في النشأة الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يُحلَّون فيها من أساورَ } جمع أَسورة، جمع سوار، { من ذَهَبٍ ولؤلؤاً } أي: من ذهب مرصَّع باللؤلؤ\n وقرأ نافع بالنصب، عطف على محل أساور، أي: يحلون أساور ولؤلؤاً\n { ولباسُهُم فيها حريرٌ } لِمَا فيه من اللذة والليونة والزينة",
      "translations": []
    }
  ]
}