{
  "chapter": "فاطر",
  "text": "والذى اوحينا اليك من الكتب هو الحق مصدقا لما بين يديه ان الله بعباده لخبيرۢ بصير",
  "translations": [
    {
      "translation": "What We have revealed to you of the Book is the truth, confirming what came before it. Allah is aware of and sees His slaves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What We have revealed to you of the Book is the truth, and proves (what has been sent) before it to be true. Verily God is informed of His creatures and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), the Book We have revealed to you is the Truth, confirming the Books that came before it. Verily Allah is well aware of His servants and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever We have revealed to you from the Book is all truth. It confirms what was revealed before. God sees His servants and is All-aware of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book which We have divinely revealed to you – that is the Truth, confirming the Books which were before it; indeed Allah is Aware of His bondmen, All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what We have revealed to you of the Book, it is the (very) truth confirming that which was (revealed) before it. Verily, Allah is indeed All-Aware and All-Seer of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which We have revealed to you of the Book, that is the truth verifying that which is before it; most surely with respect to His servants Allah is Aware, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that We have revealed to thee of the Book is the truth, confirming what is before it; God is aware of and sees His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for that which We inspire in thee of the Scripture, it is the Truth confirming that which was (revealed) before it. Lo! Allah is indeed Observer, Seer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Book which We have revealed to you is the truth confirming previous scriptures. God knows and observes His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which We have revealed Unto thee of the Book - it is the very truth confirming that which hath been before it; verily, Allah is Unto His servants Aware, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to you of the Book is the truth, confirming what was [revealed] before it. Indeed Allah is all-aware, all-seeing about His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to thee of the Book is the Truth,- confirming what was (revealed) before it: for Allah is assuredly- with respect to His Servants - well acquainted and Fully Observant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what We have inspired in you (O Muhammad SAW), of the Book (the Quran), it is the (very) truth [that you (Muhammad SAW) and your followers must act on its instructions], confirming that which was (revealed) before it. Verily! Allah is indeed AllAware, and AllSeer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to you of the Book is the truth and it confirms what was before it. Allah is Aware and sees His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What We inspired in you, of the Book, is the truth, confirming what preceded it. God is Well-Informed of His servants, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which We have revealed to you, [O Muhammad], of the Book is the truth, confirming what was before it. Indeed, Allah, of His servants, is Acquainted and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:31] And that which We have revealed to you of the Book, the Qur’ān, is the truth, confirming what was [revealed] before it, in other words, [confirming] the Books that came before it. Indeed, with regard to His servants, God is truly Aware and Seeing, knowing [both their] inward and outward aspects.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالَّذِي أَوْحَيْنَا إِلَيْكَ مِنَ الْكِتَابِ هُوَ الْحَقُّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ إِنَّ اللَّهَ بِعِبَادِهِ لَخَبِيرٌ بَصِيرٌ (31){ غَفُورٌ شَكُورٌ \\* والذى أَوْحَيْنَآ إِلَيْكَ مِنَ الكتاب هُوَ الحق } .لما كان المبدأ به من أسباب ثواب المؤمنين هو تلاوتهم كتاب الله أعقب التنويه بهم بالتنويه بالقرآن للتذكير بذلك ، ولأن في التذكير بجلال القرآن وشرفه إيماء إلى علة استحقاق الذين يتلونه ما استحَقوا . وابتدىء التنويه به بأنه وحي من الله إلى رسوله ، وناهيك بهذه الصلة تنويهاً بالكتاب ، وهو يتضمن تنويهاً بشأن الذي أنزل عليه من قوله : { والذي أوحينا إليك } ، ففي هذا مسرة للنبيء صلى الله عليه وسلم وبشارة له بأنه أفضل الرسل وأن كتابه أفضل الكتب .وهذه نكتة تعريف المسند إليه باسم الموصول لما في الصلة من الإِيماء إلى وجه كونه الحق الكامل ، دون الإِضمار الذي هو مقتضى الظاهر بأن يقال : وهو الكتاب الحق .فالتعريف في { الكتاب } تعريف العهد .و { مِن } بيانية لما في الموصول من الإِبهام ، والتقدير : والكتاب الذي أوحينا إليك هو الحقّ . فقدم الموصول الذي حقه أن يَقع صفة للكتاب تقديماً للتشويق بالإِبهام ليقع بعده التفصيل فيتمكن من الذهن فضْلَ تمكن .فجملة { والذي أوحينا إليك من الكتاب } معطوفة على جملة { إن الذين يتلون كتاب الله } \\[ فاطر : 29 \\] فهي مثلها في حكم الاستئناف .وضمير { هو } ضمير فصل ، وهو تأكيد لما أفاده تعريفَ المسند من القصر .والتعريف في { الحق } تعريف الجنس . وأفاد تعريفُ الجزأين قصر المسند على المسند إليه ، أي قصر جنس الحق على { الذي أوحينا إليك } ، وهو قصر ادعائي للمبالغة لعدم الاعتداد بحقيّة ما عداه من الكتب .فأما الكتب غير الإِلهية مثل ( الزند فسْتَا ) كتاب ( زرادشت ) ومثل كتب الصابئة فلأنَّ ما فيها من قليل الحق قد غمر بالباطل والأوهام .وأما الكتب الإِلهية كالتوراة والإِنجيل وما تضمنته كتب الأنبياء كالزبور وكتاب أرميا من الوحي الإِلهي ، فما شهد القرآن بحقيته فقد دخل في شهادة قوله : { مصدقاً لما بين يديه } ، وما جاء نسخُه بالقرآن فقد بين النسخ تحديد صلاحيته في القرآن . وذلك أيضاً تصديق لها لأنه يدفع موهم بطلانها عند من يجد خلافها في القرآن وما عسى أن يكون قد نقل على تحريف أو تأويل فقد دخل فيما أخرجه القصر . وقد بين القرآن معظمهُ وكشف عن مواقعه كقوله : { وهو محرم عليكم إخراجهم } \\[ البقرة : 85 \\] .ومعنى «ما بين يديه» ما سبقه لأن السابق يجيء متقدِّماً على المسبوق فكأنه يمشي بين يديه كقوله تعالى : { إن هو إلا نذير لكم بين يدي عذاب شديد } \\[ سبأ : 46 \\] . والمراد بما بين يديه ما قبله من الشرائع ، وأهمها شريعة موسى وشريعة عيسى عليهما السلام .وانتصب { مصدقاً } على الحال من { الكتاب } والعامل في الحال فعل { أوحينا } ليفيد أنه مع كونه حقّاً بالغاً في الحقيَّة فهو مصدق للكتب الحقّة ، ومقرر لما اشتملت عليه من الحق .{ بَيْنَ يَدَيْهِ إِنَّ الله بِعِبَادِهِ } .تذييل جامع لما تضمنته الآيات قبله من تفضيل بعض عباد الله على بعض ومن انطواء ضمائرهم على الخشية وعدمها ، وإقبال بعضهم على الطاعات وإعراض بعض ، ومن تفضيل بعض كتب الله على بعض المقتضي أيضاً تفضيل بعض المرسلين بها على بعض ، فموقع قوله : { إن الله بعباده لخبير بصير } موقع إقناع السامعين بأن الله عليم بعباده وهو يعاملهم بحسب ما يعلم منهم ، ويصطفي منهم من علم أنه خلقه كفئاً لاصطفائه ، فأَلْقَمَ بهذا الذين قالوا : { أأنزل عليه الذكر من بيننا } \\[ ص : 8 \\] حَجراً ، وكأولئك أيضاً الذين ينكرون القرآن من أهل الكتاب بعلة أنه جاء مبطلاً لكتابهم .والخبير : العالم بدقائق الأمور المعقولة والمحسوسة والظاهرة والخفية .والبصير : العالم بالأمور المبصرة . وتقديم الخبير على البصير لأنه أشمل . وذكر البصير عقبه للعناية بالأعمال التي هي من المبصرات وهي غالب شرائع الإِسلام ، وقد تكرر إرداف الخبير بالبصير في مواضع كثيرة من القرآن .والتأكيد ب { إنَّ } واللام للاهتمام بالمقصود من هذا الخبر .\n\n",
      "translations": [
        {
          "translation": "(As for that which We inspire in thee) as for that with which We send Gabriel to you (of the Scripture) i.e. the Qur'an, (it is the Truth confirming) Allah's divine Oneness and also agrees with some laws (that which was (revealed) before it) of earlier Scriptures. (Lo! Allah is indeed Observer) He is aware of those who believe and those who do not, (Seer of his slaves) He sees their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n حاوياً لما فيها بأسرها { إنّ الله بعباده لخبير } يعلم أحوال استعداداتهم { بصير } بأعمالهم\n يعطيهم الكمال على حسب الاستعداد بقدر الاستحقاق بالأعمال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِيۤ أَوْحَيْنَآ إِلَيْكَ } يا أكمل الرسل { مِنَ ٱلْكِتَابِ } الجامع لما في الكتب السالفة\n الحاوي لمعظمات أصول الدين { هُوَ ٱلْحَقُّ } المنزل من عندنا\n المثبت في حضرة علمنا { مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ } وما يقدم عليه من الكتب والصحف المنزَّلة من عندنا\n المبيِّنة لحكمنا وأحكامنا { إِنَّ ٱللَّهَ بِعِبَادِهِ لَخَبِيرٌ } أي: مطلع لجميع أحوالهم الظاهرة والباطنة حتى استعداداتهم وقابلياتهم { بَصِيرٌ } [فاطر: 31] بما جرى وسيجري عليهم في أولاهم وأخراهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هو الحقُّ } لا مرية فيه\n { مصدّقاً لما بين يديه } لما تقدمه من الكتب\n { إِن الله بعباده لخبير بصير } عالم بالظواهر والبواطن\n فعلِمَك وأبصر أحوالك\n ورآك أهلاً لأن يُوحي إليك هذا الكتاب المعجز\n الذي هو عِيار على سائر الكتب\n الإشارة: كل ما ورد في فضل أهل القرآن\n فالمراد به في حق مَن عَمِلَ به\n وأخلص في قراءته\n وحافظ على حدوده\n ورعاه حق رعايته\n وقد ورد فيمن لم يعمل به\n أو قرأه لغير الله\n وعيد كبير\n وورد أنهم أول مَن يدخل جهنم\n قال شيخ شيوخنا\n سيدي عبد الرحمن الفاسي\n بعد ذكر الحديثين في فضل حامل القرآن: وهذا مقيد بالعمل\n أي: فإنَّ منزلتك عند آخر آية مما عملتَ\n لا مما تلوتَ وخالفتَ بعملك لأنه لو كان كذلك لانخرقت أصول الدين\n ويؤدي إلى أن مَن حفظ سرد القرآن اليوم\n يكون أفضل من كثير من الصحابة الأخيار\n والصالحين الأبرار فإن كثيراً من خيارهم مات قبل حفظ جميعه\n هـ\n ثم فصّل أحوالهم فقال: { ثُمَّ أَوْرَثْنَا ٱلْكِتَابَ ٱلَّذِينَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:2",
      "similarity": 0.6030777982442102
    },
    {
      "verse": "17:96",
      "similarity": 0.4546954159647219
    },
    {
      "verse": "53:10",
      "similarity": 0.42036927774152116
    },
    {
      "verse": "21:25",
      "similarity": 0.399881790480058
    },
    {
      "verse": "100:11",
      "similarity": 0.39859281161521143
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/035031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/035031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}