{
  "chapter": "فاطر",
  "text": "ليوفيهم اجورهم ويزيدهم من فضله انه غفور شكور",
  "translations": [
    {
      "translation": "that He will pay them their wages in full and give them more from His unbounded favour. He is Ever- Forgiving, Ever-Thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He may reward them in full, and give them a greater increase by His grace. He is verily forgiving and rewarding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(a trade in which they have invested their all) so that Allah may pay them their wages in full and may add to them out of His Bounty. He is Most Forgiving, Most Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in receiving their reward from God and in further favors. He is All-forgiving and All-appreciating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may reward them with goodness in full, and further increase it with His munificence; indeed He is Oft Forgiving, Most Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may pay them their wages in full, and give them (even) more, out of His grace. Verily, He is Oft-Forgiving, Most Ready to appreciate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may pay them back fully their rewards and give them more out of His grace: surely He is Forgiving, Multiplier of rewards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may pay them in full their wages and enrich them of His bounty; surely He is All-forgiving, All-thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He will pay them their wages and increase them of His grace. Lo! He is Forgiving, Responsive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will give them their full rewards and give them more out of His bounty. He is forgiving and appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may pay them their hires in full and increase Unto them of His grace; verily, He is Forgiving, Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may pay them their full reward and enhance them out of His bounty. Indeed He is all-forgiving, all-appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For He will pay them their meed, nay, He will give them (even) more out of His Bounty: for He is Oft-Forgiving, Most Ready to appreciate (service).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may pay them their wages in full, and give them (even) more, out of His Grace. Verily! He is OftForgiving, Most Ready to appreciate (good deeds and to recompense).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may pay them in full their wages and enrich them from His bounty. Surely, He is the Forgiver and the Thanker.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will pay them their dues in full, and will increase them from His bounty. He is Forgiving and Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may give them in full their rewards and increase for them of His bounty. Indeed, He is Forgiving and Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:30] that He may pay them in full their rewards, the reward for their mentioned deeds, and enrich them out of His bounty. Truly He is Forgiving, of their sins, Appreciative, of their obedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "493 (That He) Allah (will pay them their wages) their reward in Paradise (and increase them of His grace) one to tenfolds. (Lo! He is Forgiving) He forgives their great sins, (Responsive) for their works; He is thankful for people's little works and rewards them abundantly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما فعلوا ذلك { لِيُوَفِّيَهُمْ } ويوفر عليهم سبحانه { أُجُورَهُمْ } التي يستحقون بأعمالهم بها { وَيَزِيدَهُم } عليها { مِّن فَضْلِهِ } ما لا يعد ولا يحصى من الكرامات؛ امتناناً لهم، وكيف لا يوفيهم ويزيدهم سبحانه { إِنَّهُ } عز شأنه وجل برهانه { غَفُورٌ } في ذاته لفرطات عباده، يغفر لهم ذنوبهم { شَكُورٌ } [فاطر: 30] يقبل منهم يسير طاعاتهم التي أتَوْا بها مخلصلين، فكيف بعسيرها؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ليُوَفّيَهم } متعلق بـ \" تبور \" ، أي: ليوفيَهم بإنفاقها عند الله { أُجُورهم } ثواب أعمالهم { ويَزيدَهُم من فضله } بتفسيح القبور، أو: تشفيعهم في أهلهم، ومَنْ أحسن إليهم، أو: تضعيف حسناتهم، أو: بتحقيق وعد لقائه\n أخرج ابن أبي شيبة عن بريدة، قال: سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" إن القرآن يلقى صاحبه يوم القيامة، حين ينشق عنه القبر، كالرجل الشاحب، يقول له: هل تعرفني؟ فيقول: ما أعرفك، فيقول: أنا صاحبك الذي أظمأتك في الهواجر، وأسهرت ليلتك، فإنَّ كل تاجر وراء تجارته\n قال: فيُعطى المُلك بيمينه، والخُلد بشماله، ويوضع على رأسه تاج الوقار، ويُكسى والداه حُلَّتين، لا تُقوّم لهما الدنيا، فيقولان: بِمَ كُسِينَا هذا؟ فيقال لهما: بأخْذِ وَلَدِكُما القرآنَ\n ثم يقال له: اقرأ، واصعد في درج الجنة وغرفها، فهو في صعود ما دام يقرأ \"\n \n",
      "translations": []
    }
  ]
}