{
  "chapter": "فاطر",
  "text": "والذين كفروا۟ لهم نار جهنم لا يقضى عليهم فيموتوا۟ ولا يخفف عنهم من عذابها كذلك نجزى كل كفور",
  "translations": [
    {
      "translation": "Whereas for those who are kafir there will be the Fire of Hell. They will not be killed off so that they die and its punishment will not be lightened for them. That is how We repay every thankless man.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, there is the fire of Hell. It will neither consume them wholly that they should die, nor will its torment be lessened for them. That is how We requite the ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieved, the Fire of Hell awaits them. There they shall not be finished off and die; nor will the torment (of Hell) be lightened for them. Thus do We requite every thankless being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will dwell in hell. It will not be decreed for them to die nor will their torment be relieved. Thus do We recompense the ungrateful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those who disbelieved is the fire of hell; neither does their final seizure come that they may die, nor is its punishment lightened for them; this is how We punish every extremely ungrateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve, for them will be the fire of Hell. Neither will it have a complete killing effect on them so that they die nor shall its torment be lightened for them. Thus do We requite every disbeliever!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who disbelieve, for them is the fire of hell; it shall not be finished with them entirely so that they should die, nor shall the chastisement thereof be lightened to them: even thus do We retribute every ungrateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, theirs shall be the fire of Gehenna; they shall neither be done with and die, nor shall its chastisement be lightened for them. Even so We recompense every ungrateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who disbelieve, for them is fire of hell; it taketh not complete effect upon them so that they can die, nor is its torment lightened for them. Thus We punish every ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth shall remain in the fire of Hell. Death will not be decreed for them, so that they could escape by way of death, nor will its torment ever be eased for them. Thus do We requite every ungrateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve-for them shall be Hell-Fire. It shall not be decreed to them that they should die, nor shall the torment thereof be lightened for them. Thus We requite Every ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, there is for them the fire of hell: they will neither be done away with so that they may die, nor shall its punishment be lightened for them. Thus do We requite every ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject (Allah) - for them will be the Fire of Hell: No term shall be determined for them, so they should die, nor shall its Penalty be lightened for them. Thus do We reward every ungrateful one!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve, (in the Oneness of Allah - Islamic Monotheism) for them will be the Fire of Hell. Neither it will have a complete killing effect on them so that they die, nor shall its torment be lightened for them. Thus do We requite every disbeliever!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, theirs is the Fire of Gehenna. They shall neither be done away with nor die, and its punishment shall never be lightened for them. As such shall We recompense every unbeliever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, for them is the Fire of Hell, wherein they will never be finished off and die, nor will its punishment be lightened for them. Thus We will repay every ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those who disbelieve will be the fire of Hell. [Death] is not decreed for them so they may die, nor will its torment be lightened for them. Thus do we recompense every ungrateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:36] And as for those who disbelieve, there will be for them the fire of Hell: they will neither be done away with, through death, so that they may die, and find rest, nor will any [aspect] of its chastisement be lightened for them, [not even for] a single moment. In this way, in the way that We requite these, We requite every ingrate, [every] disbeliever (read yujzā kullu kafūrin, ‘every ingrate is [so] requited’; or najzī kulla kafūrin, ‘[so] We requite every ingrate’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. Abu Jahl and his host, (for them is fire of hell) in the Hereafter; (it taketh not complete effect upon them) they are not sentenced to death (so that they can die) and find rest, (nor is its torment lightened for them) not even for a twinkle of an eye. (Thus We punish) in the Hereafter (every ingrate) every disbeliever in Allah who is ungrateful for His bounties.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والذين كفروا } المحجوبون منك بالإنكار\n الذين لا يقبلون الكتاب ولا يرثونه لبعدهم عنك في الحقيقة\n فلا تقارب ولا تواصل بينك وبينهم\n { لهم نار } جهنم الطبيعة يعذبون فيها بأنواع الحرمان والآلام دائماً { لا يقضي عليهم فيموتوا } ويستريحوا { ولا يخفّف عنهم من عذابها } فيتنفسوا\n والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nنفى سبحانه بعد نفي الملزوم\n مبالغاً وتأكيداً\n ثم أردف سبحانه وعد المؤمنين بوعيد الكافرين على مقتضى سنته المستمرة في كتابه\n فقال: { وَٱلَّذِينَ كَفَرُواْ } بالله وأعرضوا عن كتبه ورسله\n وأنكروا بالبعث والحشر وإعادة المعدوم { لَهُمْ نَارُ جَهَنَّمَ } أي: معدة مسعرة لهم\n ليعذبوا بها في النشأة الأخرى تعذيباً شديداً إلى حيث { لاَ يُقْضَىٰ } ولا يحكم { عَلَيْهِمْ } بالموت من عنده سبحانه { فَيَمُوتُواْ } كي يستريحوا\n بل كلما أشرفوا على الهلاك يعادوا ويعذبوا { وَلاَ يُخَفَّفُ عَنْهُمْ مِّنْ عَذَابِهَا } أبداً\n ولا يمهلون ساعة حتى يتنفسوا\n بل صاروا معذبين على التعاقب والتوالي أبداً بلا فرجة أصلاً\n كأبناء الدنيا المعذبين في دار الحرمان بنيران الإمكان إلى حيث تستوعب جميع أوقاتهم وأزمانهم\n بحيث لا يسع لهم التنفس والتفرج أصلاً { كَذَلِكَ } أي: مثل ما نجازي أولئك المصرين على الكفر والعناد { نَجْزِي كُلَّ كَفُورٍ } [فاطر: 36] لحقوق نعمنا\n منكر لمقتضيات جودنا وكرمنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" فيموتوا \": جواب النفي\n يقول الحق جلّ جلاله: { والذين كفروا لهم نارُ جهنَّمَ } يُخلدون فيها\n { لا يُقْضَى عليهم فيموتوا } أي: لا يحكم بموت ثان فيستريحوا\n { ولا يُخفف عنهم من عذابها } ساعة\n بل كلما خبت زِيد إسعارها\n وهذا مثل قوله:\n[الزخرف: 75]\n وذكر عياض انعقاد الإجماع على أن الكفار لا تنفعهم أعمالهم\n ولا يُثابون عليها\n ولا تخفيف عذاب\n وقد ورد في الصحيح سؤال عائشة عن ابن جدعان\n وأنه كان يصل الرحم\n ويطعم المساكين\n فهل ذلك نافعُه\n فقال عليه السلام:\n \" لا\n فإنه لم يقل يوماً: رب اغفر لي خطيئتي يوم الدين \" \nثم قال عياض: ولكن بعضهم يكون أشد عذاباً\n بحسب جرائمهم\n وذكر أبو بكر البيهقي: أنه يجوز أن يراد بما ورد في الآيات والأخبار من بطلان خيرات الكفار: أنهم لا يتخلصون بها من النار\n ولكن يُخفف عنهم ما يستوجبونه بجناية سوى الكفر\n ودافعه المازري\n قال شارح الصغاني بعد هذا النقل: وعلى ما قاله عياض\n فما ورد في أبي طالب من النفع بشفاعته صلى الله عليه وسلم\n بسبب ذبِّه عنه ونصرته له\n مختص به\n هـ\n ويرد عليه ما ورد من التخفيف في حاتم بكرمه\n فالظاهر ما قاله البيهقي\n والله أعلم\n ومثل ما قاله في أبي طالب\n قيل في انتفاع أبي لهب بعتق ثويبة\n كما في الصحيح\n والحاصل: أن التخفيف يقع في بعض الكفار\n لبره في الدنيا\n تفضلاً منه تعالى\n لا في مقابلة عملهم لعدم شرط قبوله\n انظر الحاشية\n { كذلك } أي: مثل ذلك الجزاء الفظيع\n { نجزي كلَّ كفور } مبالغ في الكفران { وهم يصطرخون فيها }: يستغيثون\n فهو يفتعلون\n من: الصراخ\n وهو الصياح بجهد ومشقة\n فاستعمل في الاستغاثة لجهر صوت المستغيث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:85",
      "similarity": 0.6203999886472367
    },
    {
      "verse": "2:162",
      "similarity": 0.6033545229989091
    },
    {
      "verse": "3:88",
      "similarity": 0.6033545229989091
    },
    {
      "verse": "40:49",
      "similarity": 0.5611689147204679
    },
    {
      "verse": "43:54",
      "similarity": 0.5417488632127971
    }
  ]
}