{
  "chapter": "فاطر",
  "text": "والذى اوحينا اليك من الكتب هو الحق مصدقا لما بين يديه ان الله بعباده لخبيرۢ بصير",
  "translations": [
    {
      "translation": "What We have revealed to you of the Book is the truth, confirming what came before it. Allah is aware of and sees His slaves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What We have revealed to you of the Book is the truth, and proves (what has been sent) before it to be true. Verily God is informed of His creatures and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), the Book We have revealed to you is the Truth, confirming the Books that came before it. Verily Allah is well aware of His servants and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever We have revealed to you from the Book is all truth. It confirms what was revealed before. God sees His servants and is All-aware of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book which We have divinely revealed to you – that is the Truth, confirming the Books which were before it; indeed Allah is Aware of His bondmen, All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what We have revealed to you of the Book, it is the (very) truth confirming that which was (revealed) before it. Verily, Allah is indeed All-Aware and All-Seer of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which We have revealed to you of the Book, that is the truth verifying that which is before it; most surely with respect to His servants Allah is Aware, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that We have revealed to thee of the Book is the truth, confirming what is before it; God is aware of and sees His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for that which We inspire in thee of the Scripture, it is the Truth confirming that which was (revealed) before it. Lo! Allah is indeed Observer, Seer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Book which We have revealed to you is the truth confirming previous scriptures. God knows and observes His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which We have revealed Unto thee of the Book - it is the very truth confirming that which hath been before it; verily, Allah is Unto His servants Aware, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to you of the Book is the truth, confirming what was [revealed] before it. Indeed Allah is all-aware, all-seeing about His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to thee of the Book is the Truth,- confirming what was (revealed) before it: for Allah is assuredly- with respect to His Servants - well acquainted and Fully Observant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what We have inspired in you (O Muhammad SAW), of the Book (the Quran), it is the (very) truth [that you (Muhammad SAW) and your followers must act on its instructions], confirming that which was (revealed) before it. Verily! Allah is indeed AllAware, and AllSeer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to you of the Book is the truth and it confirms what was before it. Allah is Aware and sees His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What We inspired in you, of the Book, is the truth, confirming what preceded it. God is Well-Informed of His servants, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which We have revealed to you, [O Muhammad], of the Book is the truth, confirming what was before it. Indeed, Allah, of His servants, is Acquainted and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:31] And that which We have revealed to you of the Book, the Qur’ān, is the truth, confirming what was [revealed] before it, in other words, [confirming] the Books that came before it. Indeed, with regard to His servants, God is truly Aware and Seeing, knowing [both their] inward and outward aspects.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for that which We inspire in thee) as for that with which We send Gabriel to you (of the Scripture) i.e. the Qur'an, (it is the Truth confirming) Allah's divine Oneness and also agrees with some laws (that which was (revealed) before it) of earlier Scriptures. (Lo! Allah is indeed Observer) He is aware of those who believe and those who do not, (Seer of his slaves) He sees their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِيۤ أَوْحَيْنَآ إِلَيْكَ } يا أكمل الرسل { مِنَ ٱلْكِتَابِ } الجامع لما في الكتب السالفة، الحاوي لمعظمات أصول الدين { هُوَ ٱلْحَقُّ } المنزل من عندنا، المثبت في حضرة علمنا { مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ } وما يقدم عليه من الكتب والصحف المنزَّلة من عندنا، المبيِّنة لحكمنا وأحكامنا { إِنَّ ٱللَّهَ بِعِبَادِهِ لَخَبِيرٌ } أي: مطلع لجميع أحوالهم الظاهرة والباطنة حتى استعداداتهم وقابلياتهم { بَصِيرٌ } [فاطر: 31] بما جرى وسيجري عليهم في أولاهم وأخراهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}