{
  "chapter": "فاطر",
  "text": "ولو يؤاخذ الله الناس بما كسبوا۟ ما ترك على ظهرها من دابة ولكن يؤخرهم الى اجل مسمى فاذا جاء اجلهم فان الله كان بعباده بصيرۢا",
  "translations": [
    {
      "translation": "If Allah were to take mankind to task for what they have earned, He would not leave a single creature crawling on it, but He is deferring them until a specified time. Then, when their time comes, Allah sees His slaves!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to seize men for their doings, not a living being would be left upon the earth. But He gives them respite for a time ordained. When their time is come, surely God will keep (the interest of) His creatures in view.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to take people to task for their deeds, He would not leave any living creature on earth, but He grants them respite to an appointed time. When their appointed time comes to an end, surely Allah fully observes His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were God to punish people for their deeds immediately, not one creature would have survived on earth. However, He has given them a respite for an appointed time and when their term comes to an end, let it be known that God watches over His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to seize people upon their deeds, He would leave no creature walking on the surface of the earth, but He gives them respite till a fixed term; and when their term comes – so indeed Allah is observing all His bondmen!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to punish men for that which they earned, He would not leave a moving creature on the surface of the earth; but He gives them respite to an appointed term, and when their term comes, then verily, Allah is Ever All-Seer of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were Allah to punish men for what they earn, He would not leave on the back of it any creature, but He respites them till an appointed term; so when their doom shall come, then surely Allah is Seeing with respect to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God should take men to task for what they have earned He would not leave upon the face of the earth one creature that crawls; but He is deferring them to a stated term. But when their term is come -- surely God sees His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah took mankind to task by that which they deserve, He would not leave a living creature on the surface of the earth; but He reprieveth them unto an appointed term, and when their term cometh - then verily (they will know that) Allah is ever Seer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to take men to task for their misdeeds, He would not leave a single living creature on the surface of the earth; but He grants them respite until an appointed time; and when their appointed time comes, then they will know that God is indeed observant of all His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to take mankind to task for that which they earn, He would not leave a moving creature on the back thereof; but He putteth them off until a term appointed; then when their term cometh, - then, verily Allah is ever of His bondmen a Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to take humans to task because of what they have earned, He would not leave any living being on its back. But He respites them until a specified time, and when their time comes, [He retributes them in accordance with their works], for Allah has been watching His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to punish men according to what they deserve. He would not leave on the back of the (earth) a single living creature: but He gives them respite for a stated Term: when their Term expires, verily Allah has in His sight all His Servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to punish men for that which they earned, He would not leave a moving (living) creature on the surface of the earth, but He gives them respite to an appointed term, and when their term comes, then verily, Allah is Ever AllSeer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah should take people to task for what they have earned, He would not leave one creature that crawls upon the face (of the earth)! But, He is deferring them to a named time. And when their time comes, indeed, Allah is the Seer of His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to punish the people for what they have earned, He would not leave a single living creature on its surface. But He defers them until a stated time. Then, when their time has arrived—God is Observant of His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to impose blame on the people for what they have earned, He would not leave upon the earth any creature. But He defers them for a specified term. And when their time comes, then indeed Allah has ever been, of His servants, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:45] Were God to take mankind to task for what they have acquired, of acts of disobedience, He would not leave on its surface, that is, the earth’s, a single creature, a single living thing moving thereon. But He reprieves them to an appointed term, namely, [to] the Day of Resurrection. And when their term comes — then truly [they will know that] God is ever Seer of His servants, and so He will requite them according to [the nature of] their deeds, rewarding the believers and punishing the disbelievers. Meccan, except for verse 45, which is Medinese; it consists of 83 verses, revealed after [sūrat] al-Jinn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَى ظَهْرِهَا مِنْ دَابَّةٍ وَلَكِنْ يُؤَخِّرُهُمْ إِلَى أَجَلٍ مُسَمًّى فَإِذَا جَاءَ أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا (45)تذكير لهم عن أن يغرهم تأخير المؤاخذة فيحسبوه عجزاً أو رضى من الله بما هم فيه فهم الذين قالوا : { اللهم إن كان هذا هو الحقَّ من عندك فأمْطِرْ علينا حجارة من السماء أو ائتنا بعذاب أليم } \\[ الأنفال : 32 \\] فعلَّمهم أن لعذاب الله آجالاً اقتضتها حِكمتهُ ، فيها رَعْي مصالح أمم آخرين ، أو استبقاءُ أجيال آتين . فالمراد ب { الناس } مجموع الأمة ، وضمير «ما كسبوا» وضمير { يؤخرهم } عائد إلى { أجل } .ونظير هذه الآية تقدم في سورة النحل إلى قوله : { فإذا جاء أجلهم } إلا أن هذه الآية جاء فيها { بما كسبوا } وهنالك جاء فيها { بظلمهم } \\[ النحل : 61 \\] لأن ما كسبوا يعم الظلم وغيره . وأوثر في سورة النحل { بظلمهم } لأنها جاءت عقب تشنيع ظلم عظيم من ظلمهم وهو ظلم بناتهم المَوْءُودَات وإلا أن هنالك قال : { ما ترك عليها } \\[ النحل : 61 \\] وهنا { ما ترك على ظهرها } وهو تفنن تبعه المعري في قوله: ... وإن شئت فازعم أن مَن فوق ظهرهاعبيدُك واستشهدْ إلهاك يَشْهَدِ ... والضمير للأرض هنا وهناك في البيت لأنها معلومة من المقام . والظهر : حقيقته متن الدابة الذي يظهر منها ، وهو ما يعلو الصلب من الجسد وهو مقابل البطن فأطلق على ظهر الإِنسان أيضاً وإن كان غير ظاهر لأن الذي يظهر من الإِنسان صدره وبطنه . وظهر الأرض مستعار لبسطها الذي يستقر عليه مخلوقات الأرض تشبيهاً للأرض بالدابة المركوبة على طريقة المكنية . ثم شاع ذلك فصار من الحقيقة .فأما قوله هنا : { فإن اللَّه كان بعباده بصيراً } ، وقد قال هنالك { لا يستأخرون ساعة ولا يستقدمون } \\[ النحل : 61 \\] ، فما هنا إيماء إلى الحكمة في تأخيرهم إلى أجل مسمى . والتقدير : فإذا جاء أجلهم آخذَهم بما كسبوا فإن الله كان بعباده بصيراً ، أي عليماً في حالي التأخير ومجيء الأجل ، ولهذا فقوله : { فإن اللَّه كان بعباده بصيراً } دليل جواب ( إذَا ) وليس هو جوابها ، ولذلك كان حقيقاً بقرنه بفاء التسبب ، وأما ما في سورة النحل فهو الجواب وهو تهديد بأنهم إذا جاء أجلهم وقع بهم العذاب دون إمهال .وقوله : { فإن اللَّه كان بعباده بصيراً } هو أيضاً جواب عن سؤال مقدر أن يقال : ماذا جنت الدوابّ حتى يستأصلها الله بسبب ما كسب الناس ، وكيف يهلك كل من على الأرض وفيهم المؤمنون والصالحون ، فأفيد أن الله أعلم بعدله . فأما الدواب فإنها مخلوقة لأجل الإِنسان كما قال تعالى : { هو الذي خلق لكم ما في الأرض جميعاً } \\[ البقرة : 29 \\] ، فإهلاكها قد يكون إنذاراً للناس لعلهم يقلعون عن إجرامهم ، وأما حال المؤمنين في حين إهلاك الكفار فالله أعلم بهم فلعل الله أن يجعل لهم طريقاً إلى النجاة كما نجّى هوداً ومن معه ، ولعله إن أهلكهم أن يعوض لهم حسن الدار كما قال النبي صلى الله عليه وسلم «ثم يحشرون على نياتهم» .\n\n",
      "translations": [
        {
          "translation": "(If Allah took mankind) and the jinn (to task by that which they deserve) by their sins, (He would not leave a living creature on the surface of the earth; but He reprieveth them unto an appointed term, and when their term) when the time of their destruction (cometh then verily (they will know that) Allah is ever Seer of His slaves) He knows who to destroy and who to spare'. And of the surah in which Ya-Sin is mentioned, which is all Meccan and consists of 92 (sic) verses, 729 words and 3,000 letters: Surah 36: Ya-Sin And of the surah in which Ya-Sin is mentioned, which is all Meccan and consists of 92 (sic) verses, 729 words and 3,000 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَوْ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ } معناه يعاقبُهُم ويكافِئُهُم\n\n",
      "translations": [
        {
          "translation": "\nAnd if Allah were to punish people for their wrongdoings, He would not leave any creature alive on the earth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ونهاية رأفته ورحمته منهم أنه { لَوْ يُؤَاخِذُ ٱللَّهُ } المطلع لجميع ما جرى في ملكه من الجرائم الموجبة للأخذ والانتقام { ٱلنَّاسَ } الذين كلفوا من عنده سبحانه بترك الجرائم والآثام المانعة من الوصول إلى المبدئ الحقيقي { بِمَا كَسَبُواْ } أي: شؤم ما اكتسبوا لأنفسهم من المعاصي التي منعوا عنها { مَا تَرَكَ } سبحانه { عَلَىٰ ظَهْرِهَا } أي: على ظهر الأرض { مِن دَآبَّةٍ } أي: متحركة من المكلفين غير مأخوذة بجرم\n بل بجرائم كثيرة عظيمة\n إذ قلما يخلوا إنسان عن طغيان ونسيان { وَلَـٰكِن يُؤَخِّرُهُمْ } أي: يؤخر أخذهم سبحانه ويمهلهم { إِلَىٰ أَجَلٍ مُّسَمًّى } معين مقدر للأخذ والانتقام\n وهو يوم القيامة { فَإِذَا جَآءَ أَجَلُهُمْ } الموعود المعين عند الله\n المعلوم له سبحانه فقط\n بلا إفشاء وإطلاع منه لأحد من أنبيائه ورسله\n أُخذوا حينئذ بما اقترفوا من الجرائم والمعاصي بلا فوت شيء منها { فَإِنَّ ٱللَّهَ } المراقب\n المحافظ على جميع ما جرى في ملكه وملكوته { كَانَ بِعِبَادِهِ } في جميع أوقات وجودهم\n بل باستعداداتهم وقابلياتهم\n وما جرى عليهم فيها { بَصِيراً } [فاطر: 45] شهيداً مطلعاً يجازيهم على مقتضى إطلاعه وخبرته بأعمالهم ونياتهم فيها\n\n\nربنا أصلح لنا عواقب أمورنا ويسر علينا كل عسير\n\n\nخاتمة السورة\n\nعليك أيها السالك\n المتشمر لإعداد زاد يوم الميعاد\n وفقك الله على إتمامه أن تلف شملك وتجمع همك للركون إلى الآخرة التي هي دار الخلود والقرار\n وتجتهد في رفع الموانع والشواغل العائقة عن هذا الميل\n وفلك أن تنقطع عن مألوفاتك ومشتهياتك التي هي أسباب الأخذ والبطش الإلهي\n وتنخلع عن لوازم تعيناتك المشتملة على أنواع الفتن والمحن حسب ما يسَّر الله عليك\n معرضاً عن الدنيا الدنية ومستلذاتها البهية ومشتهياتها الشهية\n إذ لا قرار لها ولا مدار لما يترتب عليها\n بل كلها زائدل فإنٍ\n مورث لأنواع الحسرات في النشأة الأولى\n ولأشد العذاب والزفرات في النشأة الأخرى\n\n\nوالمؤيد من عند الله بالعقل المفاض المميز بين الصلاح والفساد\n وبين الفاني والباقي\n والمرشد والهادي إلى فضاء التوحيد\n والمتذكر له\n كيف يختار الفاني على الباقي واللذات الجسمانية الزائلة سريعاً\n الجالبة للأحزان الطويلة على اللذات الروحانية القارة المستتبعة للحالات العلية\n والمقامات السنية التي لا يعرضها انقراض ولا انقضاء ولا نفوذ ولا انتهاء؟!\n\n\nربِّ اختم بفضلك عواقب أمورنا بالخير والحسنى\n إنك على ما تشاء قدير وبرجاء الراجين جدير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلَ جلاله: { ولو يُؤاخِذُ اللهُ الناسَ بما كسبوا } بما اقترفوا من المعاصي { ما ترك على ظهرها } على ظهر الأرض لأنه جرى ذكرها في قوله:\n[فاطر: 44]، { من دابةٍ } من نسمة تدبُّ عليها. قيل: أهل المعاصي فقط من الناس، وقيل: من الجن والإنس. والمشهور: أنه عام في كل ما يدب لأن الكل خُلق للآدمي. وعن ابن مسعود: إِن الجُعل ليُعذب في جحره بذنب ابن آدم، يعني ما يصيبه من القحط، بشؤم معاصيه. وقال أبو هرير: إن الحبارى لتموت هزالاً في وكرها بظلم الظالم. هـ. قال القشيري: لو عَجَّل لهم ما يستوجبونه من الثواب والعقاب، لم تَفِ أعمارُهم القليلةُ، وما اتسعت أفهامُهم القصيرة له، فأخَّرَ ذلك ليوم الحَشْرِ، فإِنَّه طويل، والله على كل شيء قدير، بأمور عباده بصير، وإليه المصير هـ وهذا معنى قوله: { ولكن يُؤخرهم إِلى أجَلٍ مسمىً } هو يوم القيامة، { فإِذا جاء أجَلُهُم } أجل جمعهم، { فإِن الله كان بعباده بصيراً } أي: لن يخفى عليه حقيقة أمرهم، وحكمة حكمهم، فيجازيهم على قدر أعمالهم. الإشارة: تعجيل العقوبة في دار الدنيا للمؤمن إحسان، وتأخيرها لدار الدوام استدراج وخذلان. فكل مَن له عناية سابقة عاتبه الله في الدنيا، بمصيبة في بدنه، أو ماله، أو في أهله، ومَن لا عناية له أُخرت عقوباته كلها لدار الجزاء. نسأل الله العصمة بمنِّه وكرمه، وبسيدنا محمد نبيه صلى الله عليه، وعلى آله وصحبه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:61",
      "similarity": 0.7506420927892966
    },
    {
      "verse": "16:49",
      "similarity": 0.43458424081555935
    },
    {
      "verse": "8:55",
      "similarity": 0.39511029069894427
    },
    {
      "verse": "27:82",
      "similarity": 0.35478613822041694
    },
    {
      "verse": "71:4",
      "similarity": 0.32471910879690097
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/035045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/035045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}