{
  "chapter": "فاطر",
  "text": "ان الله يمسك السموت والارض ان تزولا ولئن زالتا ان امسكهما من احد منۢ بعده انه كان حليما غفورا",
  "translations": [
    {
      "translation": "Verily God holds the heavens and the earth in position lest they deviate; and if they deviated there will be none to hold them in place, apart from Him He is sagacious and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah holds the heavens and the earth, lest they should be displaced there, for if they were displaced none would be able to hold them after Him. Surely He is Most Forbearing, Most Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God prevents the heavens and the earth from falling apart. If they do fall apart, then, no one besides Him can restore them. He is All-forbearing and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah restrains the heavens and the earth from convulsing; and were they to convulse, who could stop them except Allah? Indeed He is Most Forbearing, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah grasps the heavens and the earth lest they should move away from their places, and if they were to move away from their places, there is not one that could grasp them after Him. Truly, He is Ever Most Forbearing, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah upholds the heavens and the earth lest they come to naught; and if they should come to naught, there Is none who can uphold them after Him; surely He is the Forbearing, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God holds the heavens and the earth, lest they remove; did they remove, none would hold them after Him. Surely He is All-clement, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah graspeth the heavens and the earth that they deviate not, and if they were to deviate there is not one that could grasp them after Him. Lo! He is ever Clement, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, God holds the heavens and the earth, lest they should deviate [from their places]. Were they to deviate, none could hold them after Him. Surely, He is forbearing and most forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah withholdeth the heavens and the earth lest they cease; and should they cease, not any one could withhold them after Him. Verily He is ever Forbearing, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah sustains the heavens and the earth lest they should fall apart, and if they were to fall apart, there is none who can sustain them except Him. Indeed He is all-forbearing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who sustains the heavens and the earth, lest they cease (to function): and if they should fail, there is none - not one - can sustain them thereafter: Verily He is Most Forbearing, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Allah grasps the heavens and the earth lest they move away from their places, and if they were to move away from their places, there is not one that could grasp them after Him. Truly, He is Ever Most Forbearing, OftForgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who holds the heavens and the earth lest they vanish. Should they vanish, none would hold them after Him. He is the Clement, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God holds the heavens and the earth, lest they fall apart. And were they to fall apart, there is none to hold them together except He. He is Most Clement, Most Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah holds the heavens and the earth, lest they cease. And if they should cease, no one could hold them [in place] after Him. Indeed, He is Forbearing and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:41] Truly God sustains the heavens and the earth lest they disappear, in other words, He prevents them from disappearing. And if (wa-la-in: the lām is for oaths) they were to disappear there is none that can sustain them after Him, in other words, other than Him. Truly He is ever Forbearing, Forgiving, in deferring the punishment of the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah graspeth) holds (the heavens and the earth that they deviate not) so that they do not move from their actual place because of the enormity of the claim of the Jews and Christians when they maintained that Ezra and Jesus were the sons of Allah, (and if they were to deviate) and if they were to move from their actual place (there is not one that could grasp them after Him. Lo! He is ever Clement) despite the claim of the Jews and Christians, (Forgiving) He forgives whoever repents of them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱللَّهَ } المتعزز برداء العظة والكبرياء { يُمْسِكُ } ويضبط { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } ويمنعهما من { أَن تَزُولاَ } بشرك المشركين، وافترائهم على الله بإثبات الشركاء له، وبشؤم عصيانهم وفسقهم فيما بينهم { وَلَئِن زَالَتَآ } ولم يمسكهما سبحانه { إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِّن بَعْدِهِ } أي: ما أمسكهما عن الزوال من أحد بعد الله سبحانه، لكنه سبحانه أمسكهما، ولم يعاجل بانتقام عصاة عباده { إِنَّهُ } سبحانه { كَانَ } في ذاته { حَلِيماً } لا يعاجل بالانتقاممم عند ظهور الجرائم { غَفُوراً } [فاطر: 41] لمن تاب عنهما، وأناب إلى الله مخلصاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن الله يُمسك السماواتِ والأرضَ أن تزولاَ } أي: يمنعهما من أن تزولا لأن إمساكهما منع\n والمشهور عند المنجمين: أن السموات هي الأفلاك التي تدور دورة بين الليل والنهار\n وإنكار ابن يهود على كعب، كما في الثعلبي، تحامل إذ لا يلزم من دورانها عدم إمساكها بالقدرة، وانظر عند قوله:\n\n[يس: 38] قال القشيري: أمسكهما بقدرته، وأتقنهما بحكمته، وزينهما بمشيئته، وخلق أهلهما على موجب قضيته، فلا شبيه في إبقائهما وإمساكهما يُسَاهِمُه، ولا شريك في إيجادهما وإعدامهما يقاسمه\n هـ\n { ولَئِن زَالَتَا } على سبيل الفرض، { إِنْ أَمْسَكَهُما من أحدٍ من بعده } من بعد إمساكه\n و \" من \" الأولى: مزيدة، لتأكيد النفي، والثانية: ابتدائية، { إِنه كان حليماً غفوراً } غير معاجل بالعقوبة، حيث أمسكهما على مَن يشرك به ويعصيه، وكانتا جديرتين بأن تهدّ هدّاً، كما قال:\n",
      "translations": []
    }
  ]
}