{
  "chapter": "فاطر",
  "text": "اولم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم وكانوا۟ اشد منهم قوة وما كان الله ليعجزه من شىء فى السموت ولا فى الارض انه كان عليما قديرا",
  "translations": [
    {
      "translation": "Have they not travelled in the land and seen the final fate of those before them? They were far greater than them in strength. Allah cannot be withstood in any way, either in the heavens or on earth. He is All- Knowing, Ail-Powerful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the land and seen how the end of those before them, who were far more powerful, came about? There is nothing in the heavens and the earth that can defeat (the law of) God. He is all-knowing and all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the earth to behold the end of those who went before them though they were stronger than them in might? Nothing in the heavens nor on earth can frustrate Him in the least. He is All-Knowing, All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled (sufficiently) through the land to see how terrible was the end of the mightier people who lived before them. Nothing in the heavens or the earth can challenge God. God is All-knowing and All-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And did they not travel in the land in order to see what sort of fate befell those who were before them, whereas they exceeded them in strength? And Allah is not such that anything in the heavens or in the earth can break away from His control; indeed He is All Knowing, Able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled in the land, and seen what was the end of those before them -- though they were superior to them in power Allah is not such that anything in the heavens or in the earth escapes Him. Verily, He is All-Knowing, All-Able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land and seen how was the end of those before them while they were stronger than these in power? And Allah is not such that any thing in the heavens or in the earth should escape Him; surely He is Knowing, Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not journeyed in the land and beheld how was the end of those before them? They were stronger than themselves in might; but God -- there is naught in the heavens or the earth that can frustrate Him. Surely He is All-knowing, All-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land and seen the nature of the consequence for those who were before them, and they were mightier than these in power? Allah is not such that aught in the heavens or in the earth escapeth Him. Lo! He is the Wise, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled around the earth and seen the fate of those who preceded them? And they were far superior to them in strength. Nothing in the heavens or the earth can ever frustrate God's [plans]. He is all-knowing and all powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled on the earth, so that they might see what wise hath been the end of those before them. although they were stronger than these in Power? And Allah is not such that aught in the heavens and the earth can frustrate him. Verily, He is ever the Knowing, the potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled over the land so that they may observe how was the fate of those who were before them? They were more powerful than them, and Allah is not to be frustrated by anything in the heavens or on the earth. Indeed, He is all-knowing, all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not travel through the earth, and see what was the End of those before them,- though they were superior to them in strength? Nor is Allah to be frustrated by anything whatever in the heavens or on earth: for He is All-Knowing. All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land, and seen what was the end of those before them, and they were superior to them in power? Allah is not such that anything in the heavens or in the earth escapes Him. Verily, He is AllKnowing, AllOmnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not journeyed through the land and seen the end of those who went before them? They were stronger and mightier than themselves. Allah! There is nothing in heavens or earth that can frustrate Him, He is the Knower, the Able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the land and observed the fate of those who preceded them? They were superior to them in strength. But nothing can defeat God in the heavens or on Earth. He is indeed Omniscient and Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the land and observed how was the end of those before them? And they were greater than them in power. But Allah is not to be caused failure by anything in the heavens or on the earth. Indeed, He is ever Knowing and Competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:44] Have they not travelled in the land and seen the nature of the consequence for those who were before them — and they were mightier than these in power?, but [still] God destroyed them for their denial of the messengers. And God is not such that anything in the heavens or in the earth can escape Him, pre-empt Him or elude Him. Truly He is ever Knower, of all things, Omnipotent.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they) i.e. the disbelievers of Mecca (not travelled in the land and seen) and reflect upon (the nature of the consequence) the punishment (for those who were before them) when they disbelieved in their messengers, (and they were mightier) in physical strength (than these in power) and had more children? (Allah is not such that aught in the heavens or in the earth) of creation (escapeth Him. Lo! He is the Aware) He knows His creation, (the Mighty) He has power over them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا كَانَ ٱللَّهُ لِيُعْجِزَهُ } معناه يَفُوتُهُ ويَسبِقُهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {And Allah is not to be defeated}, its meaning is that He [i.e. Allah] will not be defeated and will not be preceded [i.e. in time].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } ينكرون سنة الله في الأمم الماضية الهالكة بتعذيب الله إياهم بسبب تكذيب الرسل والإنكار عليهم { وَلَمْ يَسِيرُواْ فِي ٱلأَرْضِ فَيَنظُرُواْ } بنظرة العبرة { كَيْفَ كَانَ عَاقِبَةُ } القوم { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } مكذبين لرسله { وَ } الحال أ نهم قد { كَانُوۤاْ أَشَدَّ مِنْهُمْ } أي: من هؤلاء المكذبين لك يا أكمل الرسل { قُوَّةً } وقدرة\n وأكثر شوكة وأموالاً وأولاداً { وَ } مع ذلك { مَا كَانَ ٱللَّهُ } المتعزز برداء العز والعلاء على جميع ما جرى في ملكه من الأشياء { لِيُعْجِزَهُ مِن شَيْءٍ } بأن يفوت عنه شيء حقير ويعزب عن حضرة علمه ذرة يسير لا { فِي ٱلسَّمَٰوَاتِ } أي: العلويات { وَلاَ فِي ٱلأَرْضِ } أي: السفليات\n وكيف يفوت عن خبرته سبحانه شيء { إِنَّهُ } في ذاته { كَانَ عَلِيماً } لا يعزب عن حضرة علمه شيء { قَدِيراً } [فاطر: 44] على إظهار ما في خزانة علمه بلا فترة وفتور\n وفطور وقصور\n\n\n{ وَ } من كمال حلم الله على عباده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } قد { كانوا أشدَّ منهم قوةً } واقتداراً، فلم يتمكنوا من الفرار، { وما كان الله ليُعْجِزَه } ليسبقه ويفوته { من شيءٍ } أيَّ شيء كان { في السماوات ولا في الأرض إِنه كان عليماً } بأحوالهم { قديراً } على أخذهم\n وبالله التوفيق\n الإشارة: ترى بعض الناس يقول: لئن ظهر شيخ التربية لنكونن أول مَن يدخل معه، فلما ظهر، عاند واستكبر، وربما أنكر ومكر\n\n\nنعوذ بالله من سابق الخذلان\n قال القشيري: ليس لقولهم تحقيق، ولا لضمانهم توثيق، وما يَعدُون من أنفسهم فصريحُ زورٍ، وما يُوهمُون من وِفاقهم فصِرْفُ غرور\n وكذلك المريد في أول نشاطه، تُمَنِّيه نَفْسُه ما لا يقدر عليه، فربما يعاهد الله، ويؤكد فيه عقداً مع الله، فإذا عَضّتْهُ شهوتُه، وأراد الشيطانُ أن يكذبه، صَرَعه بكيده، وأركسه في كُوةِ غيِّه، وفتنةِ نَفْسه فيسودُّ وجْهُه، ويذهب ماء وجهه\n ثم قال في قوله: { أولم يسيروا\n\n\n } الخ: ما خاب له وليٌّ، وما ربح له عدو، ولا تنال الحقيقةُ بمَن انعكس قَصْدُه، وارتدَ عليه كيدُه، دَمّر على أعدائه تدميراً، وأوسع لأوليائه فضلاً كبيراً\n هـ\n ثم تمّم قوله: { إِنه كان حليماً غفوراً } ، بقوله: { وَلَوْ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:21",
      "similarity": 0.6438709934888573
    },
    {
      "verse": "40:82",
      "similarity": 0.6355426919011966
    },
    {
      "verse": "30:42",
      "similarity": 0.5978354287923547
    },
    {
      "verse": "6:11",
      "similarity": 0.5839330218196672
    },
    {
      "verse": "27:69",
      "similarity": 0.5690545677715497
    }
  ]
}