{
  "chapter": "فاطر",
  "text": "يايها الناس ان وعد الله حق فلا تغرنكم الحيوة الدنيا ولا يغرنكم بالله الغرور",
  "translations": [
    {
      "translation": "Mankind! Allah's promise is true. Do not let the life of the dunya delude you and do not let the Deluder delude you about Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you people, the promise of God is true. So do not let the life of this world delude you, nor let that (arch) deceiver deceive you about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, assuredly Allah's promise is true. So let the life of the world not delude you, and let not the Deluder delude you concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, the promise of God is true. Let not the worldly life deceive you. Let not the devil deceive you about God\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Allah’s promise is indeed true; therefore do not ever let the worldly life deceive you; nor ever let the great cheat deceive you in respect of Allah’s commands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Verily, the promise of Allah is true. So, let not this present life deceive you, and let not the chief deceiver deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! surely the promise of Allah is true, therefore let not the life of this world deceive you, and let not the archdeceiver deceive you respecting Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, God's promise is true; so let not the present life delude you, and let not the Deluder delude you concerning God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Lo! the promise of Allah is true. So let not the life of the world beguile you, and let not the (avowed) beguiler beguile you with regard to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Men. The promise of God is true. Let not the life of this world deceive you, nor let the Deceiver deceive you about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! verily the promise of Allah is true. So let not the life of the world beguile you, and with respect to Allah let not beguile you the great be guiler.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Allah’s promise is indeed true. So do not let the life of the world deceive you, nor let the Deceiver deceive you concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! Certainly the promise of Allah is true. Let not then this present life deceive you, nor let the Chief Deceiver deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Verily, the Promise of Allah is true. So let not this present life deceive you, and let not the chief deceiver (Satan) deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, the promise of Allah is true, so do not let this present life delude you, and do not let the deluder (satan) delude you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! The promise of God is true; so let not the lowly life seduce you, and let not the Tempter tempt you away from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, indeed the promise of Allah is truth, so let not the worldly life delude you and be not deceived about Allah by the Deceiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:5] O mankind! Indeed God’s promise, of resurrection and of other issues, is true. So do not let the life of this world deceive you, from believing in [all of] that, and do not let the Deceiver, Satan, deceive you concerning God, on account of His forbearance and respiting [of sinners in this life].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind) people of Mecca! (Lo! the promise of Allah) i.e. resurrection after death (is true) it will surely happen. (So let not the life of the world) let not what is in the life of the world of comfort and adornment (beguile you) with regard to the obedience of Allah, (and let not the (avowed) beguiler) Satan; and it is said: the falsehoods of the life of this world (beguile you with regard to Allah) with regard to the religion of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ يَغُرَّنَّكُمْ بِٱللَّهِ ٱلْغَرُورُ } معناه أن يَعمل بالمعصيةِ، ويتَمنّى المَغفرةَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } المهمكون في بحر الغفلة والنيسان، التائهون في تيه الغرور والخسران { إِنَّ وَعْدَ ٱللَّهِ } الذي وعده في النشأة الأخرى لعموم عباده شقيهم وسعيدهم، مطيعهم وكافرهم { حَقٌّ } ثابت، لازم إنجازه على الله بلا خلف، فلكم أن تتزودوا لأخراكم وتهيئوا أمر عقباكم؛ كي تصلوا إلى ما أعد لكم مولاكم { فَلاَ تَغُرَّنَّكُمُ } وتعوقنكم { ٱلْحَيَاةُ ٱلدُّنْيَا } ولذاتها الفانية وشهواتها الزائلة عن الحياة السرمدية، والبقاء الأبدي واللذات الأزلية { وَلاَ يَغُرَّنَّكُمْ بِٱللَّهِ ٱلْغَرُورُ } [فاطر: 5] يعني لا يلبّس عليكم الشيطان المكار الغرار الغدار بأن يوقع في قلوبكم أن رحمة الله واسعة وفضله كثير ولطفه عام، وأن الله سبحانه مستغني عن طاعتكم وعبادتكم، وأن فعل الإيلام لا يتصور من الحكيم العلام، إلى غير ذلك من الحيل العائقة لكم عن التقوى والتزود للنشأة الأخرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الناسُ إِن وعدَ الله } بالبعث والجزاء { حق } أي: كائن لا محالة، فاستعدُّوا للقائه، { فلا تَغُرنَّكم الحياةُ الدنيا } لا تخدعنكم زخارف الدنيا الغرارة، ولا يُذهلنكم التمتُّع بها، والتلذُّذ بملاذها، والاشتغال بجمعها واحتكارها، عن التأهُّب للقاء الله، وطلب ما عنده\n وفي الحديث:\n\n \" فلا تخدعنكم زخارف دنيا دنية، عن مراتب جنات علية، فكأنْ قد كشف القناع، وارتفع الارتياب، ولاقى كل امرىء مستقره، وعرف مثواه ومنقلبه \" \n\n{ ولا يغرنكم بالله الغرورُ } أي: الشيطان، فإنه يُمنِّيكم الأماني الكاذبة، ويقول: إن الله غني عن عبادتك وعن تكذيبك\n أو: إن الله غفور لمَن عصاه",
      "translations": []
    }
  ]
}