{
  "chapter": "فاطر",
  "text": "يايها الناس ان وعد الله حق فلا تغرنكم الحيوة الدنيا ولا يغرنكم بالله الغرور",
  "translations": [
    {
      "translation": "Mankind! Allah's promise is true. Do not let the life of the dunya delude you and do not let the Deluder delude you about Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you people, the promise of God is true. So do not let the life of this world delude you, nor let that (arch) deceiver deceive you about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, assuredly Allah's promise is true. So let the life of the world not delude you, and let not the Deluder delude you concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, the promise of God is true. Let not the worldly life deceive you. Let not the devil deceive you about God\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Allah’s promise is indeed true; therefore do not ever let the worldly life deceive you; nor ever let the great cheat deceive you in respect of Allah’s commands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Verily, the promise of Allah is true. So, let not this present life deceive you, and let not the chief deceiver deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! surely the promise of Allah is true, therefore let not the life of this world deceive you, and let not the archdeceiver deceive you respecting Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, God's promise is true; so let not the present life delude you, and let not the Deluder delude you concerning God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Lo! the promise of Allah is true. So let not the life of the world beguile you, and let not the (avowed) beguiler beguile you with regard to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Men. The promise of God is true. Let not the life of this world deceive you, nor let the Deceiver deceive you about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! verily the promise of Allah is true. So let not the life of the world beguile you, and with respect to Allah let not beguile you the great be guiler.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Allah’s promise is indeed true. So do not let the life of the world deceive you, nor let the Deceiver deceive you concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! Certainly the promise of Allah is true. Let not then this present life deceive you, nor let the Chief Deceiver deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Verily, the Promise of Allah is true. So let not this present life deceive you, and let not the chief deceiver (Satan) deceive you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, the promise of Allah is true, so do not let this present life delude you, and do not let the deluder (satan) delude you about Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! The promise of God is true; so let not the lowly life seduce you, and let not the Tempter tempt you away from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, indeed the promise of Allah is truth, so let not the worldly life delude you and be not deceived about Allah by the Deceiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:5] O mankind! Indeed God’s promise, of resurrection and of other issues, is true. So do not let the life of this world deceive you, from believing in [all of] that, and do not let the Deceiver, Satan, deceive you concerning God, on account of His forbearance and respiting [of sinners in this life].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ (5)أعيد خطاب الناس إعذاراً لهم وإنذاراً بتحقيق أن وعد الله الذي وعده من عقابه المكذبين في يوم البعث هو وعد واقع لا يتخلف وذلك بعد أن قدّم لهم التذكير بدلائل الوحدانية المشتملة عليْها ، مع الدلالة على نعم الله عليهم ليعلموا أنه لا يستحق العبادة غيره وأنه لا يتصف بالإِلهية الحق غيره .وبعد أن أشار إليهم بأن ما أنتجته تلك الدلائل هو ما أنبأهم به الرسول صلى الله عليه وسلم فيعلمون صدقه فيما أنبأهم من توحيد الله وهو أكبر ما قرع آذانهم وأحرج شيء لنفوسهم ، فإذا تأيّد بالدليل البرهاني تمهّد السبيل لتصديق الرسول صلى الله عليه وسلم فيما أخبرهم به من وعد الله وهو يوم البعث لأنه لما تبين صدقه في الأولى يعلم صدقه في الثانية بحكم قياس المساواة .والخطاب للمشركين ، أوْ لَهم وللمؤمنين لأن ما تلاه صالح لموعظة الفريقين كل على حسب حاله .وتأكيد الخبر ب { إنَّ } إمّا لأن الخطاب للمنكرين ، وإمّا لتغليب فريق المنكرين على المؤمنين لأنهم أحوج إلى تقوية الموعظة .والوعد مصدر ، وهو الإِخبار عن فعل المخبِر شيئاً في المستقبل ، والأكثر أن يكون فيما عدا الشر ، ويُخص الشر منه باسم الوعيد ، يعمهما وهو هنا مستعمل في القدر المشترك . وقد تقدم عند قوله تعالى : { الشيطان يعدكم الفقر } الآية في سورة البقرة ( 268 ) .وإضافته إلى الاسم الأعظم توطئة لكونه حقّاً لأن الله لا يأتي منه الباطل .والحق هنا مقابل الكذب . والمعنى : أن وعد الله صادق . ووصفه بالمصدر مبالغة في حقيته .والمراد به : الوعد بحلول يوم جزاء بعد انقضاء هذه الحياة كما دل عليه تفريع فلا تغرنكم الحياة الدنيا } الآية .والغُرور بضم الغين ويقال التغرير : إيهام النفع والصلاح فيما هو ضرّ وفساد . وتقدم عند قوله تعالى : { لا يغرنك تقلب الذين كفروا } في سورة آل عمران ( 196 ) وعند قوله : { زخرف القول غروراً } في سورة الأنعام ( 112 ) .والمراد بالحياة : ما تشتمل عليه أحوال الحياة الدنيا من لهو وترف ، وانتهائها بالموت والعدم مما يسول للناس أن ليس بعد هذه الحياةِ أخرى .وإسناد التغرير إلى الحياة ولو مع تقدير المضاف إسناد مجازي لأن الغَارَّ للمرء هو نفسه المنخدعة بأحوال الحياة الدنيا فهو من إسناد الفعل إلى سببه والباعث عليه .والنهي في الظاهر موجه إلى الناس والمنهي عنه من أحوال الحياة الدنيا ، وليست الحياة الدنيا من فعل الناس ، فتعين أن المقصود النهي عن لازم ذلك الإِسناد وهو الاغترار لمظاهر الحياة . ونظيره كثير في كلام العرب كقولهم : لا أعرفنَّك تفعل كذا ، ولا أرَيَنَّك ههنا ، { ولا يجرمنكم شنآن قوم } \\[ المائدة : 2 \\] ، وتقدم نظيره في قوله تعالى : { لا يغرنك تقلب الذين كفروا في البلاد } آخر آل عمران ( 196 ) .وكذلك القول في قوله تعالى : ولا يغرنكم بالله الغرور } .والغرور بفتح الغين : هو الشديد التغرير . والمراد به الشيطان ، قال تعالى : { فدلاهما بغرور } \\[ الأعراف : 22 \\] . وهو يغير الناس بتزيين القبائح لهم تمويهاً بما يلوح عليها من محاسن تلائم نفوس الناس .والباء في قول { بالله } للملابسة وهي داخلة على مضاف مقدر أي ، بشأن الله ، أي يتطرق إلى نقض هدى الله فإن فعل غرّ يتعدّى إلى مفعول واحد فإذا أريد تعديته إلى بعض متعلقاته عُدّي إليه بواسطة حرف الجرّ ، فقد يعدّى بالباء وهي باء الملابسة كقوله تعالى : { يا أيها الإنسان ما غرك بربك الكريم } \\[ الانفطار : 6 \\] وقوله في سورة الحديد ( 14 ) : { وغركم بالله الغرور } وذلك إذا أريد بيان من الغرور ملابس له على تقدير مضاف ، أي بحال من أحواله . وتلك ملابسة الفعل للمفعول في الكلام على الإِيجاز . وليست هذه الباء باء السببية .وقد تضمنت الآية غرورين : غروراً يغتَرّه المرء من تلقاء نفسه ويزيّن لنفسه من المظاهر الفاتنة التي تلوح له في هذه الدنيا ما يتوهمه خيراً ولا ينظر في عواقبه بحيث تخفى مضارّه في بادىء الرأي ولا يظنّ أنه من الشيطان .وغروراً يتلقاه ممن يغرّه وهو الشيطان ، وكذلك الغرور كله في هذا العالم بعضه يمليه المرء على نفسه وبعضه يتلقاه من شياطين الإِنس والجن ، فتُرِك تفصيل الغرور الأول الآن اعتناء بالأصل والأهم ، فإن كل غرور يرجع إلى غرور الشيطان . وسيأتي تفصيله عند قوله تعالى : { من كان يريد العزة فللّه العزة جميعاً } \\[ فاطر : 10 \\] .\n\n",
      "translations": [
        {
          "translation": "(0 mankind) people of Mecca! (Lo! the promise of Allah) i.e. resurrection after death (is true) it will surely happen. (So let not the life of the world) let not what is in the life of the world of comfort and adornment (beguile you) with regard to the obedience of Allah, (and let not the (avowed) beguiler) Satan; and it is said: the falsehoods of the life of this world (beguile you with regard to Allah) with regard to the religion of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ يَغُرَّنَّكُمْ بِٱللَّهِ ٱلْغَرُورُ } معناه أن يَعمل بالمعصيةِ، ويتَمنّى المَغفرةَ\n\n",
      "translations": [
        {
          "translation": "\n{And let not Allah's Deceiver deceive you} His saying, Almighty, means that he works with sin and desires forgiveness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } المهمكون في بحر الغفلة والنيسان\n التائهون في تيه الغرور والخسران { إِنَّ وَعْدَ ٱللَّهِ } الذي وعده في النشأة الأخرى لعموم عباده شقيهم وسعيدهم\n مطيعهم وكافرهم { حَقٌّ } ثابت\n لازم إنجازه على الله بلا خلف\n فلكم أن تتزودوا لأخراكم وتهيئوا أمر عقباكم\n كي تصلوا إلى ما أعد لكم مولاكم { فَلاَ تَغُرَّنَّكُمُ } وتعوقنكم { ٱلْحَيَاةُ ٱلدُّنْيَا } ولذاتها الفانية وشهواتها الزائلة عن الحياة السرمدية\n والبقاء الأبدي واللذات الأزلية { وَلاَ يَغُرَّنَّكُمْ بِٱللَّهِ ٱلْغَرُورُ } [فاطر: 5] يعني لا يلبّس عليكم الشيطان المكار الغرار الغدار بأن يوقع في قلوبكم أن رحمة الله واسعة وفضله كثير ولطفه عام\n وأن الله سبحانه مستغني عن طاعتكم وعبادتكم\n وأن فعل الإيلام لا يتصور من الحكيم العلام\n إلى غير ذلك من الحيل العائقة لكم عن التقوى والتزود للنشأة الأخرى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الناسُ إِن وعدَ الله } بالبعث والجزاء { حق } أي: كائن لا محالة\n فاستعدُّوا للقائه\n { فلا تَغُرنَّكم الحياةُ الدنيا } لا تخدعنكم زخارف الدنيا الغرارة\n ولا يُذهلنكم التمتُّع بها\n والتلذُّذ بملاذها\n والاشتغال بجمعها واحتكارها\n عن التأهُّب للقاء الله\n وطلب ما عنده\n وفي الحديث:\n \" فلا تخدعنكم زخارف دنيا دنية\n عن مراتب جنات علية\n فكأنْ قد كشف القناع\n وارتفع الارتياب\n ولاقى كل امرىء مستقره\n وعرف مثواه ومنقلبه \" \n{ ولا يغرنكم بالله الغرورُ } أي: الشيطان\n فإنه يُمنِّيكم الأماني الكاذبة\n ويقول: إن الله غني عن عبادتك وعن تكذيبك\n أو: إن الله غفور لمَن عصاه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:33",
      "similarity": 0.756146404834965
    },
    {
      "verse": "82:6",
      "similarity": 0.6737146710027374
    },
    {
      "verse": "4:120",
      "similarity": 0.5193495003452997
    },
    {
      "verse": "3:196",
      "similarity": 0.5178326442778172
    },
    {
      "verse": "33:12",
      "similarity": 0.5131050046003472
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/035005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/035005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}