{
  "chapter": "فاطر",
  "text": "ان الشيطن لكم عدو فاتخذوه عدوا انما يدعوا۟ حزبه ليكونوا۟ من اصحب السعير",
  "translations": [
    {
      "translation": "Shaytan is your enemy so treat him as an enemy. He summons his party so they will be among the people of the Searing Blaze.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan is certainly your enemy, so hold him as a foe. He only calls his faction to be the residents of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Satan is an enemy to you. Therefore, do take him as an enemy. He calls his followers to his way so that they may be among the inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan is your enemy. Thus, consider him as your enemy. His party only calls you to make you the dwellers of the burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Satan is your enemy, therefore you too take him as an enemy; he only calls his group so that they become the people of hell!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, Shaytan is an enemy to you, so take (treat) him as an enemy. He only invites his followers that they may become the dwellers of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the Shaitan is your enemy, so take him for an enemy; he only invites his party that they may be inmates of the burning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Satan is an enemy to you; so take him for an enemy. He calls his party only that they may be among the inhabitants of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the devil is an enemy for you, so treat him as an enemy. He only summoneth his faction to be owners of the flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Satan is your enemy: so treat him as an enemy: he calls on his followers only so that they should become inmates of the burning Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the Satan is an enemy Unto you, wherefore hold him for an enemy; he only calleth his confederates that they become of the fellows of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan is indeed your enemy, so treat him as an enemy. He only invites his confederates so that they may be among the inmates of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Satan is an enemy to you: so treat him as an enemy. He only invites his adherents, that they may become Companions of the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, Shaitan (Satan) is an enemy to you, so take (treat) him as an enemy. He only invites his Hizb (followers) that they may become the dwellers of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "satan is indeed your enemy; therefore take him for an enemy. He calls his party so that they will become the companions of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan is an enemy to you, so treat him as an enemy. He only invites his gang to be among the inmates of the Inferno.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Satan is an enemy to you; so take him as an enemy. He only invites his party to be among the companions of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:6] Truly Satan is an enemy to you. So treat him as an enemy, by being obedient to God and do not obey him; he only summons his faction, his followers in disbelief, so that they may be among the inhabitants of the Blaze, the fierce Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the devil is an enemy for you) as regards religion and obedience, (so treat him as an enemy) so fight him and do not obey him as far as religion and obedience are concerned. (He only summoneth his faction) 490 the adherents of his religion and obedient ones (to be owners of the flaming Fire) to be gathered with the inhabitants of hell in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلشَّيْطَانَ لَكُمْ } يا بني آدم { عَدُوٌّ } قديم، مستمر عداوته من زمان أبيكم { فَٱتَّخِذُوهُ } أي: الشيطان، أنتم أيضاً { عَدُوّاً } لأنفسكم عداوة مستمرة بحيث لا تصغوا إليه ولا تقبلوا منه قوله، ولا تلتفتوا إلى تغريره وتلبيسه أصلاً، فإنه يواسيكم ويغريكم إلى مشتهيات نفوسكم، ويوقعكم في فتنة عظيمة، كما أوقع أباكم آدم عليه السلام فعليكم أن تجتنبوا عن غوائله، حتى لا تكونوا من حزبه { إِنَّمَا يَدْعُواْ حِزْبَهُ } على الغواية والضلال { لِيَكُونُواْ مِنْ أَصْحَابِ ٱلسَّعِيرِ } [فاطر: 6] المعد لأصحاب الشقاوة الأزلية مثل الشيطان وأحزابه وأتباعه\n\n\n\n\nنجنا بفضلك من سخطك، وأعدنا بلطفك من تغرير عدونا وعدوك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ الشيطانَ لكم عدوٌّ } ظاهر العداوة، فعل بأبيكم ما فعل، وأنتم تعاملونه معاملة الحبيب الناصح، { فاتخِذوه عدواً } فلا تقبلوا غروره في عقائدكم وأفعالكم، وكُونوا على حذر منه في جميع أحوالكم إذ لا يوجد منه إلا ما يدل على عداوته في سركم وجهركم\n قال الورتجبي: إنه عدو لأنه من عالم القهر خُلق، ونحن من عالم اللطف خُلقنا\n والطبعان متخالفان أبداً، لأن القهر واللطف تسابقا في الأزل، فسبق اللطفُ القهر، فعداوته من جهة الطبع الأول، والجهل بالعصمة، وأنوار التأييد والنصرة، ومَن لا يعرفه بما وصفنا، كيف يتخذه عدواً؟ وهو لا يعرف مكائده، ولا يعرف مكائده إلا وليّ أو صدِّيق\n هـ\n ثم خطّأ مَن اتبعه بأن غرضه أن يورد شيعَته موارد الهلاك، بقوله: { إِنما يدعو حزبه ليكونوا من أصحاب السعير } فهو تقرير لعداوته، وبيان لغرضه في دعوى شيعته إلى اتباع الهوى، والركون إلى الدنيا، أي: إنما يدعوهم إلى الهوى، ليكونوا من أهل النار",
      "translations": []
    }
  ]
}