{
  "chapter": "فاطر",
  "text": "الذين كفروا۟ لهم عذاب شديد والذين ءامنوا۟ وعملوا۟ الصلحت لهم مغفرة واجر كبير",
  "translations": [
    {
      "translation": "Those who are kafir will suffer a harsh punishment. But those who have iman and do right actions will receive forgiveness and an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who are unbelievers, there is severe punishment; but for those who believe and do the right is forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A severe chastisement lies in store for those that disbelieve, but there is pardon and a great reward for those that believe and work righteous deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will suffer a severe torment, but the righteously striving believers will receive forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the disbelievers is a severe punishment; and for those who accepted faith and did good deeds is forgiveness, and an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, theirs will be a severe torment; and those who believe and do righteous good deeds, theirs will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve, they shall have a severe punishment, and (as for) those who believe and do good, they shall have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve -- there awaits them a terrible chastisement; but those who believe, and do deeds of righteousness -- theirs shall be forgiveness and a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, theirs will be an awful doom; and those who believe and do good works, theirs will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are bent on denying the truth will have a severe punishment, while those who believe and do good deeds will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve - theirs shall be a torment severe; and those who believe and work righteous works, - theirs shall be forgiveness and a great hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a severe punishment for the faithless; but for those who have faith and do righteous deeds, there will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who reject Allah, is a terrible Penalty: but for those who believe and work righteous deeds, is Forgiveness, and a magnificent Reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, theirs will be a severe torment; and those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, theirs will be forgiveness and a great reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the unbelievers awaits a terrible punishment, but for those who believe and do good deeds is forgiveness and a great recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve will suffer a harsh punishment, but those who believe and do righteous deeds will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve will have a severe punishment, and those who believe and do righteous deeds will have forgiveness and great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:7] Those who disbelieve, theirs will be a severe chastisement; but those who believe and perform righteous deeds, theirs will be forgiveness and a great reward — this is a declaration of what [fate] will be for the adherents of Satan and what will be for his opponents [respectively].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. Abu Jahl and his host, (theirs will be an awful doom; and those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and do acts of obedience between them and their Lord, (theirs will be forgiveness) their sins will be forgiven in the life of this world (and a great reward) in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مشتملاً على الوعد والوعيد بكلا الفريقين: { ٱلَّذِينَ كَفَرُواْ } أي: ستروا الحق وأعرضوا عنه في النشأة الأولى عناداً ومكابرة { لَهُمْ عَذَابٌ شَدِيدٌ } إي: إحراق بالنار في النشأة الأخرى\n جزاء لما اقترفوا في النشأة الأولى\n إذ لا عذاب أشد من الإحراق { وَٱلَّذِينَ آمَنُواْ } بتوحيد الله\n وصدقوا رسله المؤيدين من عنده بالصحف والكتب المنزلة إليهم\n المبينة لسلوك طريق التوحيد والعرفان { وَعَمِلُواْ ٱلصَّالِحَاتِ } المأمورة لهم في تلك الكتب والصحف { لَهُم } في النشأة الأخرى { مَّغْفِرَةٌ } ستر وعفو لما صدر عنهم من الذنوب قبل الإيمان والتصديق { وَأَجْرٌ كَبِيرٌ } [فاطر: 7] وجزاء عظيم على ما عملوا بعده بمقتضى الأمر الإلهي المبين في الكتب المنزلة من عنده\n\n\n{ أَفَمَن زُيِّنَ لَهُ سُوۤءُ عَمَلِهِ فَرَآهُ حَسَناً } يعني: أيزعم أن من زين وحسن له الشيطان عمله السويِّء القبيح في الوقاع فخيله حسناً بحسب زعمه الفاسد واعتقاده الباطل\n كمن كان عمله حسناً في الواقع حقاً في نفس الأمر واعتقده أيضاً كذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن مآل مَن اتبعه ومَن عاداه، فقال: { الذين كفروا لهم عذاب شديد } أي: فمَن أجابه إلى ما دعي فله عذاب شديد لأنه صار من حزبه وأتباعه، { والذين آمنوا وعملوا الصالحات } ولم يجيبوه، ولم يصيروا من حزبه، بل عادوه، { لهم مغفرةٌ وأجر كبير } لكبر جهاده ودوامه\n الإشارة: وَعْد الله هنا عام، وكله حق، واجب الوقوع، لا يتخلّف، فيصدق بوعد الرزق، وكفاية مَن انقطع إليه عن الخلق، لقوله:\n\n[الطلاق: 3] وتولى مَن أصلح حالَه لقوله:\n\n[الأعراف: 196] ويصدق بإثابة المطيع، وعتاب المعاصي، أو حلمه عنه، وغير ذلك من المواعد كلها، فيجب على العبد كفه عن الاهتمام بالرزق، وخوف الخلق، والتشمير في الطاعة، والفرار من المعصية، إِنْ كان له ثقة بوعد ربه، وإلا فالخلل في إيمانه\n وقوله تعالى: { إِن الشيطان لكم عدو\n\n\n } الخ، قوم فهموا من الخطاب أنهم أُمروا بعداوة الشيطان، فاشتغلوا بعداوته ومحارتبه، فشغلهم ذلك عن محبة الحبيب، وقوم فهموا من سر الخطاب: إن الشيطان لكم عدو، وأنا لكم حبيب، فاشْتَغلُوا بمحبة الحبيب، فكفاهم عداوة العدو\n\n\nقيل لبعضهم: كيف صُنعك مع الشيطان؟ فقال: نحن قوم صرفنا هِممنا إلى الله، فكفانا مَن دونه\n فالشيطان كالكلب إن اشتغلت بدفعه مزّق الثياب، أو قطع الإهاب، وإن رفعته إلى مولاه كفاك شره\n وكذلك النفس إن اشتغلت بتصفيتها ومجاهدتها على الدوام شغلتك عن ذكر الله، والفناء فيه، ولكن الدواء هو الغيبة عنها، والاشتغال بالله دائماً، فإذا أظهرتْ رأسها بقيام شهوتها، دُقّه، بعكس مرادها، وغِبْ عنها في ذكر الله\n ومن حِكم شيخنا البوزيدي رضي الله عنه: \" انس نفسك بالله، واعتمد على فضل الله، وامتثل شيئاً ما، وينوب الله \"\n وفي الحكم العطائية: \" إذا علمت أن الشيطان لا يغفل عنك، فلا تغفل أنت عمن ناصيتك بيده \"\n وقال أيضاً: \" وحرّك عليك النفس ليدون إقبالك عليه \"\n وقال: \" لو كنت لا تصل إليه إلا بعد فناء مساوئك، ومحو دعاويك، لم تصل إليه أبداً\n ولكن إذا أراد أن يُوصلك إليه، غطى وصفك بوصفه، ونعتك بنعته، فوصلك بما منه إليك، لا بما منك إليك \"\n ومن جملة عداوته تزيين القبائح كما قال تعالى: { أَفَمَن زُيِّنَ لَهُ سُوۤءُ عَمَلِهِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:11",
      "similarity": 0.6823320252847666
    },
    {
      "verse": "5:9",
      "similarity": 0.5890629411619009
    },
    {
      "verse": "17:9",
      "similarity": 0.5267301521199712
    },
    {
      "verse": "42:26",
      "similarity": 0.42407332806876563
    },
    {
      "verse": "67:12",
      "similarity": 0.3993448963610679
    }
  ]
}