{
  "chapter": "فاطر",
  "text": "افمن زين له سوء عمله فرءاه حسنا فان الله يضل من يشاء ويهدى من يشاء فلا تذهب نفسك عليهم حسرت ان الله عليمۢ بما يصنعون",
  "translations": [
    {
      "translation": "And what of him the evil of whose actions appears fine to him so that he sees them as good? Allah them. Allah knows what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he, the evil of whose deed is made to look attractive to him so that he considers it good, (be like him who is guided)? God leads whosoever He please astray and guides whosoever He will. So do not waste away your self with grief for them. God is indeed cognisant of things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(How awful is the straying of the person) for whom his evil deed has been embellished so that it looks fair to him? The fact is that Allah causes whomsoever He will to fall into error and shows the Right Way to whomsoever He will. So, (O Prophet), let not your life go to waste sorrowing over them. Allah is well aware of all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can one whose evil deeds seem attractive and virtuous to him (be compared to a truly righteous person)? God guides or causes to go astray whomever He wants. (Muhammad), do not be grieved because of their disbelief. God knows well whatever they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will one whose misdeeds are made seeming good to him – so he deems them good – be ever equal to the one who is upon guidance? Therefore indeed Allah sends astray whomever He wills, and guides whomever He wills; so may not your life be lost in despairing after them; Allah knows their deeds very well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he, then, to whom the evil of his deeds is made fairseeming, so that he considers it as good Verily, Allah sends astray whom He wills, and guides whom He wills. So destroy not yourself in sorrow for them. Truly, Allah is the All-Knower of what they do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! is he whose evil deed is made fairseeming to him so much so that he considers it good? Now surely Allah makes err whom He pleases and guides aright whom He pleases, so let not your soul waste away in grief for them; surely Allah is Cognizant of what they do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what of him, the evil of whose deeds has been decked out fair to him, so that he thinks it is good? God leads astray whomsoever He will, and whomsoever He will He guides; so let not thy soul be wasted in regrets for them; God has knowledge of the things they work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he, the evil of whose deeds is made fairseeming unto him so that he deemeth it good, (other than Satan's dupe)? Allah verily sendeth whom He will astray, and guideth whom He will; so let not thy soul expire in sighings for them. Lo! Allah is Aware of what they do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whose evil deeds are made alluring to him so that he looks upon them as good, [equal to the man who is rightly guided]? God leaves to stray whom He wills, and guides whom He wills. Do not destroy yourself with grief for them. God has full knowledge of all their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he, then, whose evil work hath been made fair-seeming unto him, so that he deemeth it good, be as he who rightly perceiveth the truth? Verily Allah sendeth astray whomsoever He listeth, and guideth whomsoever He listeth; so let not thine soul expire after them in sighings; verily Allah is the Knower of that which they perform.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is someone the evil of whose conduct is presented as decorous to him, so he regards it as good.... Indeed Allah leads astray whomever He wishes, and guides whomever He wishes. So do not fret yourself to death regretting for them. Indeed Allah knows best what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he, then, to whom the evil of his conduct is made alluring, so that he looks upon it as good, (equal to one who is rightly guided)? For Allah leaves to stray whom He wills, and guides whom He wills. So let not thy soul go out in (vainly) sighing after them: for Allah knows well all that they do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he, then, to whom the evil of his deeds made fairseeming, so that he considers it as good (equal to one who is rightly guided)? Verily, Allah sends astray whom He wills, and guides whom He wills. So destroy not yourself (O Muhammad SAW) in sorrow for them. Truly, Allah is the AllKnower of what they do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What then of he whose evil deeds have been decorated fair to him and thinks them to be good? Allah leads astray whomsoever He will and whomsoever He will He guides. Do not let your soul be wasted in regrets for them; Allah has knowledge of all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What of him whose evil deed was made attractive to him, and so he regards it as good? God leads astray whomever He wills, and He guides whomever He wills. Therefore, do not waste yourself sorrowing over them. God knows exactly what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is one to whom the evil of his deed has been made attractive so he considers it good [like one rightly guided]? For indeed, Allah sends astray whom He wills and guides whom He wills. So do not let yourself perish over them in regret. Indeed, Allah is Knowing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:8] The following was revealed regarding Abū Jahl and others: Is he, the evil of whose deeds is made [to seem] fair to him, by distortion, so that he deems it good […]? (a-fa-man, ‘is he [whose]’ constitutes the subject, the predicate of which is [an omitted] ‘like one whom God has guided?’ No! And this [predicate] is indicated by [what follows]). Indeed God leads astray whomever He will and guides whomever He will. So do not let your soul expire for their sake, for those to whom it has made [to seem] fair, out of sighings, by becoming anguished lest they do not believe. Indeed God is Knower of what they do, and He will requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he, the evil of whose deeds is made fair-seeming unto him so that he deemeth it good) right-the reference here is to Abu Jahl-like those whom We honoured with faith and obedience, i.e. Abu Bakr al-Siddiq and his fellow believers? (Allah verily sendeth whom He will astray) He sends away from His religion whoever deserves it, (and guideth) to His religion (whom He will) whoever deserves it, i.e. Abu Bakr and his fellow believers, (so let not thy soul expire) do not kill yourself with grief (in sighings for them) in remorse about their destruction, if they reject faith. (Lo! Allah is Aware of what they do) in their state of disbelief of scheming in Dar al-Nadwah and treachery in order to kill Muhammad (pbuh)!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حتى يكونا متساويين في استحقاق الأمر الجزيل والجزاء الجميل؟! كلا وحاشا { فَإِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء\n المقتدر على جميع ما يشاء { يُضِلُّ } عن صراط توحيده بمقتضى قهره وجلاله { مَن يَشَآءُ } من عصاة عباده { وَيَهْدِي مَن يَشَآءُ } منهم الإضلال والضلال\n والإرشاد والهداية إنما هي مستمدة أولاً وبالذات إلى مشيئة الله وإرادته\n لا مدخل لأحد من خلقه فيها أصلاً { فَلاَ تَذْهَبْ نَفْسُكَ } أي: لا تتعب ولا تهلك نفسك { عَلَيْهِمْ } أي: على غواية من أردت أو أحببت هدايته { حَسَرَاتٍ } أي: حال كونك متحسراً ومتأسفاً تحسراً فوق تحسر\n وتحزناً فوق تحزن على ضلالهم وعدم قبولهم الهداية\n والمعنى: أفمن زين له سوء عمله\n فحسنه على نفسه واعتقده حقاً جهلاً مع أنه باطل في نفسه\n وبذلك ضل عن طريق الحق وانحرف عن سوء السبيل\n وبعُد بمراحل عن الهداية\n وأنت يا أكمل الرسل أذهبت وأهلكت نفسك حسرة عليهم وضجرة لما لم يهتدوا ولم يؤمنوا\n فإن الله يضل من يشاء ويهدي من يشاء\n فلا تذهب نفسك عليهم حسرات\n وبالجملة: { إِنَّ ٱللَّهَ } المراقب على جميع حالاتهم { عَلِيمٌ بِمَا يَصْنَعُونَ } [فاطر: 8] يجازيهم على مقتضى علمه بسوء صنيعهم\n ولا تتعب نفسك عليهم بما يفوتون على نفوسهم من الرشد والهداية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أفمن }: مبتدأ حُذف خبره، أي: كمن هداه الله، أو ذهبت نفسك عليه حسرات. و { حسرات }: مفعول له. وجَمعها لتضاعف اغتمامه، أو تعدُّد مساوئهم. و { عليهم }: صلة لتذهب، كما تقول: هلك عليه حُبًّا، ومات عليه حُزناً. ولا يتعلق بحسرات لأن المصدر لا يتقدَّم عليه صلته، إلا أن يتسامح في الجار والمجرور. يقول الحق جلّ جلاله: { أفمن زُيّن له سُوءُ عمله } بأنْ غلَب هواه على عقله، وجهله على علمه، حتى انعكس رأيه، { فرآه حَسَناً } فرأى الباطل حقًّا، والقبيح حسناً، كمَن هداه الله واستبصر، فرأى الحق حقًّا، والباطل باطلاً، فتبع الحق، وأعرض عن الباطل، ليس الأمر كذلك، { فإِن الله يُضِلُّ من يشاء ويهدي من يشاء } فمَن أضله رأى الباطل حقًّا، فتبعه، ومَن هداه رأى الباطل باطلاً، فاجتنبه، والحق حقًّا فاتبعه. { فلا تَذْهَبْ نفسُك عليهم حسرات } أي: فلا تهلك نفسك عليهم للحسرات على غيهم وإصرارهم على التكذيب، فإن أمرهم بيدي، وأنا أرحم بهم منك، فإنما عليك البلاغ، وعلينا الحساب. { إِن الله عليم بما يصنعون } فيجازيهم عليه، وهو وعيد لهم بالعقاب على سوء صنيعهم. الإشارة: إذا أراد الله إبعاد قوم غطّى نور بصيرتهم بظلمة الهوى فيُزيّن في عينهم القبيح، ويستقبح المليح، فيرون القبيح حسناً، والحسن قبيحاً، كما قال الشاعر:\nقال القشيري: ومعنى التزيين كالكافر، يَتَوَهَّمُ أنَّ فعله حَسَنٌ، وهو عند الله من أقبح القبيح، ثم الراغب في الدنيا يجمع حلالها وحرامها، ويحوّش حُطَامها، لا يتفكر في زوالها، ولا في ارتحاله عنها من قبل كمالها، ولقد زيَّن له سوء عمله، والذي يتبع الشهوات يبيع مؤبد راحته في الجنة، بمتابعة شهوة ساعة، فلقد زُين له سُوءُ عمله، والذي يُؤيِرُ على ربِّه شيئاَ من المخلوقات، فهُو من جملتهم، والذي يتوهَّمُ أنه إذا وَجَدَ النجاة والدرجات في الجنة فقد اكتفى، فقد زُيِّن له سوءُ عمله، حيث تغافل عن حلاوة مناجاته. والذي هو في صحبة حظوظه، دون إيثار حقوق الله، فقد زُين له سوء عمله فرآه حسناً. هـ. قلت: وكذلك مَن وقف مع الكرامات والمقامات، وحلاوة الطاعات، دون درجة المشاهدة، فقد زُين له سوء عمله. والحاصل: كل مَن وقف مع شيء، دون تحقيق الفناء في الذات، فهو مُزيَّن له سوء عمله. وكل مَن لم يصحب الرجال فهو غالط، يظن أنه واصل، وهو منقطع في أول البدايات. وبالله التوفيق. وقوله تعالى: { فلا تَذهب نفسك عليهم حسرات } ، كذلك يقال للواعظ، إذا رأى إدبار الخلق، وعدم تأثير الوعظ فيهم، فليكتفِ بعلم الله فيهم، ولا يتأسّف على أحد، فإن التوفيق بيد الله. ورما يحييهم بعد حيث كما يحيي الأرض بعد موتها كما أشار إلى ذلك بقوله: { وَٱللَّهُ ٱلَّذِيۤ أَرْسَلَ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:50",
      "similarity": 0.5541544309185276
    },
    {
      "verse": "21:19",
      "similarity": 0.516491314730303
    },
    {
      "verse": "36:30",
      "similarity": 0.48811348761947504
    },
    {
      "verse": "19:39",
      "similarity": 0.4543994537999444
    },
    {
      "verse": "20:41",
      "similarity": 0.41090361198073677
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/35:8.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/35:8.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/35:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}