{
  "chapter": "فاطر",
  "text": "والله الذى ارسل الريح فتثير سحابا فسقنه الى بلد ميت فاحيينا به الارض بعد موتها كذلك النشور",
  "translations": [
    {
      "translation": "It is Allah who sends the winds which raise the clouds which We then drive to a dead land and by them bring the earth to life after it was dead. That is how the Resurrection will be.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends the winds that raise the clouds. Then We drive the clouds towards the land that was dead, and restore the earth to life after it had died. So will be the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who sends forth winds which then set the clouds in motion, which We drive to some dead land giving a fresh life to earth after it had become dead. Such will be the resurrection of the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends the winds to raise the clouds. We then drive them unto barren areas and revive the dead earth. (The Resurrection) will also be executed in the same way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah Who sent the winds – so they raise clouds and We then direct it towards a dead city – so with it We revive the earth after its death; and this is how the resurrection will be.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah Who sends the winds, so that they raise up the clouds, and We drive them to a dead land, and revive therewith the earth after its death. As such (will be) the Resurrection!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah is He Who sends the winds so they raise a cloud, then We drive it on to a dead country, and therewith We give life to the earth after its death; even so is the quickening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He that looses the winds, that stir up cloud, then We drive it to a dead land and therewith revive the earth, after it is dead. Even so is the Uprising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah it is Who sendeth the winds and they raise a cloud; then We lead it unto a dead land and revive therewith the earth after its death. Such is the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends forth the winds so that they raise up the clouds. We drive them to a dead land, and by them bring the earth to life after its death. Such is the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah Who sendeth the winds, and they raise a cloud; then We drive it unto a dead land and We quicken thereby the earth after the death thereof. Even so shall be the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who sends the winds and they raise a cloud; then We drive it toward a dead land and with it revive the earth after its death. Likewise will be the resurrection [of the dead].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who sends forth the Winds, so that they raise up the Clouds, and We drive them to a land that is dead, and revive the earth therewith after its death: even so (will be) the Resurrection!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah Who sends the winds, so that they raise up the clouds, and We drive them to a dead land, and revive therewith the earth after its death. As such (will be) the Resurrection!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He who sends the winds that stir up the clouds. Then, We drive them on to a dead land and revive the earth after it's death. Such is the Raising Up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He who sends the winds, which agitate clouds, which We drive to a dead land, and thereby revive the ground after it had died. Likewise is the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah who sends the winds, and they stir the clouds, and We drive them to a dead land and give life thereby to the earth after its lifelessness. Thus is the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[35:9] And it is God Who unleashes the winds (al-riyāha: a variant reading has al-rīha) and they raise clouds (fatuthīru’l-sahāba: the imperfect tense here is used to narrate the past), that is, they stir them up, then We drive them (there is a shift here from the third person [to the first person] address) to a dead land (read mayyitin or maytin), wherein is no plant life, and therewith revive the earth, of that land, after it has been dead, [after] its having been dried-out. In other words, We made seeds and grass grow in it: Such will be   the Raising, that is, the Resurrection and the bringing [of the dead] back to life.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah it is Who sendeth the winds and they raise a cloud; then We lead it) through rain (unto a dead land) wherein there is no plants (and revive therewith) by means of the rain (the earth after its death) after its dryness and exposure to draught. (Such is the Resurrection) in the same way you will be quickened and raised from the graves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يعلم سبحانه ضمائر عباده واستعداداتهم مع أنه { ٱللَّهُ } المدبر لعموم أفعالهم وأحوالهم وحوائجهم\n هو { ٱلَّذِيۤ أَرْسَلَ } بلطفه ومقتضى جوده { ٱلرِّيَاحَ } العاصفة { فَتُثِيرُ } وتهيج { سَحَاباً } هامرة\n مركبة من الأبخرة والأدخنة المتصاعدة\n القابلة لأن تتكون منها مياهاً بمجاورة الهواء البارد والرطب { فَسُقْنَاهُ } بعدما تم تركيبه عناية منا { إِلَىٰ بَلَدٍ مَّيِّتٍ } يابس في غاية اليبس بحيث لا اخضرار له أصلاً { فَأَحْيَيْنَا بِهِ } أي: بالمطر الحاصل من السحاب { ٱلأَرْضَ بَعْدَ مَوْتِهَا } أي: جفافها ويبسها { كَذَلِكَ } أي: مثل إحيائنا الأرض اليابسة بعد يبسها وجمودها { ٱلنُّشُورُ } [فاطر: 9] أي: أحياؤنا الأموات الجامدة ونشرهم من قبورهم\n بإعادة الروح المنفصل منهم إلى أبدانهم التي تفتت أجزاؤها\n بإرسال نفحات نسمات لطفنا ورحمتنا لتثير سحاب العناية الماطرة قطرات ماء الحياة المسوقة إلى أراضي الأبدان اليابسة والجامدة بالموت الطبيعي\n إنما أحييناهم وأخرجناهم من الأجداث\n إظهاراً لقدرتنا\n وتتميماً لحكمتنا واستقلالنا في آثار تصرفنا في ملكنا وملكوتنا\n وتعززنا وكبريائنا في ذاتنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" كذلك \": خبر مقدّم، و \" النشور \": مبتدأ\n يقول الحق جلّ جلاله: { واللهُ الذي أرسلَ الرياحَ } وفي قراءة بالإفراد، للجنس، { فتُثير سحاباً } أي: تزعجه، وعبَّر بالمضارع على حكاية الحال الماضية استحضاراً لتلك الصورة البديعة، التي تقع فيها إثارة الرياح السحاب، الدالة على كمال القدرة وباهر الحكمة\n { فسُقناه إِلى بلدٍ ميتٍ } لا نبات فيه، { فأحيينا به } أي: بالمطر النازل منه { الأرضَ بعد موتها } بعد يبسها\n وعدل من الغيبة إلى التكلم لأنه أدخل في الاختصاص لِمَا فيه من مزيد بديع الصنع، { كذلك النشورُ } أي: مثل إحياء الموات نشور الأموات\n وقيل: يحيي الله الخلق بماء يرسله من تحت العرش، كمنيّ الرجال، فتنبت به الأجسادُ في قبورها، ثم يرسل الأرواح فتدخل في أشباحها\n\n\n \" قال أبو رزين: قلت: يا رسول الله كيف يحيي الله الموتى؟ وما آية ذلك في خلقه؟ فقال: هل مررت بواد أهلك مَحْلاً؟ ـ أي جدباً ـ قلت: نعم، قال: فكذلك يُحيي الله الموتى، وتلك آية الله في خلقه \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:57",
      "similarity": 0.5255971409070551
    },
    {
      "verse": "30:9",
      "similarity": 0.4538225027790116
    },
    {
      "verse": "30:48",
      "similarity": 0.3695311480941409
    },
    {
      "verse": "43:11",
      "similarity": 0.35323233806993815
    },
    {
      "verse": "2:164",
      "similarity": 0.2502219617022031
    }
  ]
}