{
  "chapter": "يس",
  "text": "انما تنذر من اتبع الذكر وخشى الرحمن بالغيب فبشره بمغفرة واجر كريم",
  "translations": [
    {
      "translation": "You can only warn those who act on the Reminder and fear the All-Merciful in the Unseen. Give them the good news of forgiveness and a generous reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can only warn him who listens to the warning and fears Ar-Rahman secretly. So give him good news of forgiveness and a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can warn only him who follows the Admonition and fears the Merciful Lord without seeing Him. Give such a one good tidings of forgiveness and a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You should only warn those who follow the Quran and have fear of the Beneficent God without seeing Him. Give them the glad news of their receiving forgiveness and an honorable reward (from God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You warn only him who follows the advice and fears the Most Gracious without seeing; therefore give him glad tidings of forgiveness and an honourable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can only warn him who follows the Reminder, and fears the Most Gracious unseen. Bear you to such one the glad tidings of forgiveness, and a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can only warn him who follows the reminder and fears the Beneficent Allah in secret; so announce to him forgiveness and an honorable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou only warnest him who follows the Remembrance and who fears the All-merciful in the Unseen; so give him the good tidings of forgiveness and a generous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou warnest only him who followeth the Reminder and feareth the Beneficent in secret. To him bear tidings of forgiveness and a rich reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can warn only those who would follow the Reminder and fear the Gracious God, unseen. Give them the good news of forgiveness and a noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou canst warn only him who followeth the admonition and feareth the Compassionate, unseen. So bear thou Unto him the glad tidings of forgiveness and a generous hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can only warn someone who follows the Reminder and fears the All-beneficent in secret; so give him the good news of forgiveness and a noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou canst but admonish such a one as follows the Message and fears the (Lord) Most Gracious, unseen: give such a one, therefore, good tidings, of Forgiveness and a Reward most generous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can only warn him who follows the Reminder (the Quran), and fears the Most Beneficent (Allah) unseen. Bear you to such one the glad tidings of forgiveness, and a generous reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You only warn he who follows the Remembrance and fears the Merciful in the Unseen. Give to him glad tidings of forgiveness and a generous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You warn only him who follows the Message, and fears the Most Gracious inwardly. So give him good news of forgiveness, and a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can only warn one who follows the message and fears the Most Merciful unseen. So give him good tidings of forgiveness and noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:11] You can only warn, in other words, your warning will only benefit, him who follows the Remembrance, the Qur’ān, and fears the Compassionate One in secret, who fears Him despite not having seen Him; so give him the good tidings of forgiveness and a noble reward, namely, Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thou warnest only) your warning by means of the Qur'an benefits only (him who followeth the Reminder) i.e. the Qur'an and acts upon its teachings, like Abu Bakr and his fellow believers (and feareth the Beneficent in secret) and works for the Beneficent even though he does not see him. (To him bear tidings of forgiveness) of his sins in the life of this world (and a rich reward) and a fair reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنما تنذر } أي: يؤثر الإنذار وينجع في { من اتّبع الذكر } لنورية استعداده وصفائه فيتأثر به ويقبل الهداية بما في استعداده من التوحيد الفطري والمعرفة الأصلية\n فيتذكر ويخشى الرحمن بتصوّر عظمته مع غيبته من التجلي فيتبعه بالسلوك ليحضر ما هو غائب عنه ويرى ما استضاء بنوره { فبشّره بمغفرة } عظيمة من ستر ذنوب حجب أفعاله وصفاته وذاته { وأجرٍ كريم } من جنات أفعال الحق وصفاته وذاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا تُنذِرُ } ويقبل منك الإنذار المصلح والإرشاد المفيد { مَنِ ٱتَّبَعَ ٱلذِّكْرَ } أي: سمع القرآن سمع قبول\n وامتثل بأوامره ونواهيه عن تدرب تام وتأمل صادق\n واتعظ بتذكيراته\n واعتبر عن عبره وأمثاله { وَخشِيَ ٱلرَّحْمـٰنَ } أي: خاف عن قهره وانتقامه واجتنب عن سخطه وغضبه ملتبساً { بِٱلْغَيْبِ } أي: قبل نزول العذاب وحلوله\n معتقداً أنه سبحانه قادر على جميع أنواع الانتقامات { فَبَشِّرْهُ } يا أكمل الرسل بعدما سمع بالآيات سمع قبول ورضاً\n وامتثل بما فيها مخلصاً\n خائفاً\n راجياً { بِمَغْفِرَةٍ } لفرطاته المتقدمة { وَأَجْرٍ كَرِيمٍ } [يس: 11] لأعماله الصالحة الخالصة بلا فوت شيء منها\n بل بأضعافها وآلافها عناية منا إياه وتفضلاً عليه\n\n\nوكيف يفوت عن إحاطة علمنا شيء من حقوق عبادنا { إِنَّا } من مقام عظيم جودنا وكمال قدرتنا { نَحْنُ نُحْيِي } ونهدي حسب اقتضاء تجلياتنا اللطيفة والجمالية { ٱلْمَوْتَىٰ } الهالكين بموت الجهل والضلال\n التائهين في بيداء الوهم والخيال حيارى سكارى\n مدهوشين\n محبوسين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَبَشِّرْهُ بمغفرةٍ } وهو العفو عن ذنوبه\n { وأجرٍ كريمٍ } الجنة وما فيها\n الإشارة: كل مَن تصدّى لوعظ الناس\n وإنذارهم\n على فترة من الأولياء\n يقال له: لِتُنذر قوماً ما أُنذر آباؤهم فهم غافلون\n ويقال في حق مَن سبق له الإبعاد عن طريق أهل الرشاد: لقد حقَّ القولُ على أكثرهم\n فهم لا يؤمنون\n إنا جعلنا في أعناقهم أغلالاً تمنعهم من حط رؤوسهم لأولياء زمانهم\n وجعلنا من بين أيديهم سدًّا: موانع تمنعهم من النهوض إلى الله\n ومن خلفهم سدّاً: علائق تردهم عن حضرة الله\n فأغشيناهم: غطَّينا أعين بصيرتهم\n فلا يرون خصوصية أحد ممن يدلّ على الله\n فهم لا يُبصرون داعياً\n ولا يُلبون منادياً\n فالإنذار وعدمه في حقهم سواء\n ومعالجة دائهم عناء\n قال الورتجبي: سد ما خلفهم سد قهر الأزل\n وسد ما بين أيديهم شقاوة الأبد\n فبنفسه منعهم من نفسه\n لا جرم أنهم في غشاوة القسوة\n لا يبصرونه أبداً\n هـ\n إنما ينتفع بتذكير الداعين إلى الله مَن خشع قلبه بذكر الله\n واشتاقت رُوحه إلى لقاء الله\n فبشِّره بمغفرة لذنوبه\n وتغطية لعيوبه\n وأجر كريم\n وهو النظر إلى وجه الله العظيم\n ثم ردّ على من أنكر البعث\n ممن سبق له الشقاء\n فقال: { إِنَّا نَحْنُ نُحْيِي ٱلْمَوْتَىٰ وَنَكْتُبُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:12",
      "similarity": 0.6522460005149553
    },
    {
      "verse": "79:45",
      "similarity": 0.4775141487776165
    },
    {
      "verse": "50:33",
      "similarity": 0.4146713214242023
    },
    {
      "verse": "20:3",
      "similarity": 0.4073668082274322
    },
    {
      "verse": "36:27",
      "similarity": 0.39364675080939193
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/36:11.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/36:11.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}