{
  "chapter": "يس",
  "text": "وسواء عليهم ءانذرتهم ام لم تنذرهم لا يؤمنون",
  "translations": [
    {
      "translation": "Whether you warn them or do not warn, it is all the same; they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is all the same for them whether you warn them or do not warn them for they shall not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you warn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is the same for them, whether you warn them or do not warn them – they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same to them whether you warn them or you warn them not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is alike to them whether you warn them or warn them not: they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alike it is to them whether thou hast warned them or thou hast not warned them, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether thou warn them or thou warn them not, it is alike for them, for they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It makes no difference to them whether you warn them or do not warn them: they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is alike Unto them, whather thou warnest them or warnest them not; they shall not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same to them whether you warn them or do not warn them, they will not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The same is it to them whether thou admonish them or thou do not admonish them: they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same to them whether you warn them or you warn them not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same whether you have warned them or you have not warned them, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same for them, whether you warn them, or do not warn them—they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is all the same for them whether you warn them or do not warn them - they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:10] And it is the same to them whether you warn them (read a-andhartuhum, pronouncing both hamzas; or by substituting an alif for the second one; or by not pronouncing the second one but inserting an alif between the one not pronounced and the other one, or without [the insertion]) or do not warn them, they will not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whether thou warn them) whether you warn the Banu Makhzum: Abu Jahl and his host, by means of the Qur'an (or thou warn them not, it is alike for them, for they believe not) they do not want to believe; and they were later killed on the Day of Badr in their state of disbelief. The verses from (Lo! we have put on their necks) to (...so that they are made stiff necked) were revealed about Abu Jahl, al-Walid and their hosts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سجلنا عليهم الكفر وحكمنا شقاوتهم حكماً مبرماً، لا يفيدهم إنذارك يا أكمل الرسل وإرشادك إياهم، بل { سَوَآءُ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لاَ يُؤمِنُونَ } [يس: 10] إذ ختمنا على قلوبهم وعلى سمعهم وعلى أبصارهم غشاوة غليظة مانعة عن قبول الحق والتذكر به وإبصار علاماته، وبالجملة: هم مقضيون في سباق علمنا ولوح قضائنا بالعذاب الأليم والضلال البعيد، فلا تتعب نفسك يا أكمل الرسل في هدايتهم وإرشادهم، إنك لا تهدي من أحببت من قرابتك وأرحامك، ولكن الله يهدي من يشاء، فلا تذهب نفسك عليهم حسرات، إن الله عليم بما يصنعون من الكفر والإصرار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والأول أرجح وأنسب لقوله: { وسواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون } أي: الإنذار وتركه في حقهم سواء إذ لا هادي لمَن أضلّه الله\n رُوي أن عمر بن عبد العزيز قرأ الآية في غيلان القدريّ، فقال غيلان: كأني لم أقرأها قط، أُشهِدك أني تائب عن قولي في القدر\n فقال عمر: اللهم إِنْ صَدَقَ فتُبْ عليه، وإن كذب فسلّطْ عليه مَن لا يرحمه، فأخذه هشام بن عبد الملك من غده، فقطع يديه ورجليه، وصلبه على باب دمشق",
      "translations": []
    }
  ]
}