{
  "chapter": "يس",
  "text": "انا نحن نحى الموتى ونكتب ما قدموا۟ وءاثرهم وكل شىء احصينه فى امام مبين",
  "translations": [
    {
      "translation": "We bring the dead to life and We record what they send ahead and what they leave behind. We have listed everything in a clear register.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We indeed who bring back the dead to life, and write down what they send ahead (of their deeds), and traces that they leave behind. We keep an account of all things in a lucid register.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall surely raise the dead to life and We record what they did and the traces of their deeds that they have left behind. We have encompassed that in a Clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We who bring the dead to life and records the deeds of human beings and their consequences (of continual effects). We keep everything recorded in an illustrious Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely bring the dead to life and We record what they send ahead and the signs they will leave behind; and We have accounted all things in a clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We give life to the dead, and We record that which they send before (them), and their traces and all things We have recorded with numbers in Imam Mubin (a Clear Book).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We give life to the dead, and We write down what they have sent before and their footprints, and We have recorded everything in a clear writing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely it is We who bring the dead to life and write down what they have forwarded and what they have left behind; everything We have numbered in a clear register.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We it is Who bring the dead to life. We record that which they send before (them, and their footprints. And all things We have kept in a clear Register.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall surely bring the dead back to life and We record what they send ahead and what they leave behind. We have recorded everything in a clear book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We shall guicken the dead. And We write down that which they send before and their footsteps. And everything We have counted up in a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is We who revive the dead and write what they have sent ahead and their effects [which they left behind], and We have figured everything in a manifest Imam.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We shall give life to the dead, and We record that which they send before and that which they leave behind, and of all things have We taken account in a clear Book (of evidence).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We give life to the dead, and We record that which they send before (them), and their traces [their footsteps and walking on the earth with their legs to the mosques for the five compulsory congregational prayers, Jihad (holy fighting in Allah's Cause) and all other good and evil they did, and that which they leave behind], and all things We have recorded with numbers (as a record) in a Clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, it is We who revive the dead and write down what they have forwarded and what they have left behind; We have counted everything in a Clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We who revive the dead; and We write down what they have forwarded, and their traces. We have tallied all things in a Clear Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear register.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:12] Truly it is We Who bring the dead to life, for the resurrection, and record, in the Preserved Tablet, what they have sent ahead, during their lives, of good or evil, that they may be requited for it, and their vestiges, what conduct was followed after them as good practice. And everything (kulla shay’in is in the accusative because of the verb that governs it [and is the following]) We have numbered, We have recorded precisely, in a clear register, a clear Book, namely, the Preserved Tablet.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّا نَحْنُ نُحْيِي الْمَوْتَى وَنَكْتُبُ مَا قَدَّمُوا وَآَثَارَهُمْ وَكُلَّ شَيْءٍ أحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ (12)لما اقتضى القصر في قوله : { إنما تنذر من اتبع الذكر وخشي الرحمن بالغيب } \\[ يس : 11 \\] نفى أن يتعلق الإِنذار بالذين لم يتبعوا الذكر ولم يخشوا الرحمان ، وكان في ذلك كناية تعريضية بأن الذين لم ينتفعوا بالإِنذار بمنزلة الأموات لعدم انتفاعهم بما ينفع كل عاقل ، كما قال تعالى : { لتنذر من كان حياً } \\[ يس : 70 \\] وكما قال : { إنك لا تسمع الموتى } \\[ النمل : 80 \\] استطرد عقب ذلك بالتخلّص إلى إثبات البعث فإن التوفيق الذي حفّ بمن اتبع الذكر وخشي الرحمان هو كإحياء الميت لأن حالة الشرك حالة ضلال يشبه الموت ، والإِخراج منه كإحياء الميت؛ فهذه الآية اشتملت بصريحها على علم بتحقيق البعث واشتملت بتعريضها على رمز واستعارتيْن ضمنيتين : استعارة الموتى للمشركين ، واستعارة الإحياء للإِنقاذ من الشرك ، والقرينة هي الانتقال من كلام إلى كلام لما يومىء إليه الانتقال من سبق الحضور في المخيلة فيشمل المتكلم مما كان يتكلم في شأنه إلى الكلام فيما خطر له . وهذه الدلالة من مستتبعات المقام وليست من لوازم معنى التركيب . وهذا من أدق التخلص بحرف ( إنَّ ) لأن المناسبة بين المنتقل منه والمنتقل إليه تحتاج إلى فطْنة ، وهذا مقام خطاب الذكِيّ المذكور في مقدمة علم المعاني .فيكون موقع جملة «إنا نحيي الموتى» استئنافاً ابتدائياً لِقصد إنذار الذين لم يتبعوا الذكر ، ولم يخشوا الرحمان ، وهم الذين اقتضاهم جانب النفي في صيغة القصر .ويجوز أن يكون الإِحياء مستعاراً للإنقاذ من الشرك ، والموتى : استعارة لأهل الشكر ، فإحياء الموتى توفيق من آمن من الناس إلى الإِيمان كما قال تعالى : { أفمن كان ميتاً فأحييناه وجعلنا له نوراً يمشي به في الناس كمن مثله في الظلمات } \\[ الأنعام : 122 \\] الآية .فتكون الجملة امتناناً على المؤمنين بتيسير الإِيمان لهم ، قال تعالى : { فمن يرد اللَّه أن يهديه يشرح صدره للإسلام } \\[ الأنعام : 125 \\] ، وموقع الجملة موقع التعليل لقوله : { فبشره بمغفرة وأجر كريم } \\[ يس : 11 \\] .والمراد بكتابة ما قدموا الكناية عن الوعد بالثواب على أعمالهم الصالحة والثواب على آثارهم .وهذا الاعتبار يناسبه الاستئناف الابتدائي ليكون الانتقال بابتداء كلاممٍ منبهاً السامعَ إلى ما اعتبره المتكلم في مطاوي كلامه .والتأكيد بحرف ( إنّ ) منظور فيه إلى معنى الصريح كما هو الشأن ، و { نحن } ضمير فصل للتقوية وهو زيادة تأكيد . والمعنى : نحييهم للجزاء ، فلذلك عطف { ونكتب ما قدموا } ، أي نُحْصي لهم أعمالهم من خير وشر قدموها في الدنيا لنجازيهم .وعطفُ ذلك إدماج للإِنذار والتهديدِ بأنهم محاسبون على أعمالهم ومجازَون عليها .والكناية : كناية عن الإِحصاء وعدم إفلات شيء من أعمالهم أو إغفاله . وهي ما يعبر عنه بصحائف الأعمال التي يسجلها الكِرام الكاتبون .فالمراد ب { ما قدموا } ما عملوا من الأعمال قبل الموت؛ شبهت أعمالهم في الحياة الدنيا بأشياء يقدمونها إلى الدار الآخرة كما يقدم المسافر ثَقله وأحماله .وأما الآثار فهي آثار الأعمال وليست عينَ الأعمال بقرينة مقابلته ب { ما قدموا } مثل ما يتركون من خير أو يثير بين الناس وفي النفوس .والمقصود بذلك ما عملوه موافقاً للتكاليف الشرعية أو مخالفاً لها وآثارهم كذلك قال رسول الله صلى الله عليه وسلم « من سَنَّ سُنة حسنة فله أجْرُها وأجر مَن عمل بها إلى يوم القيامة ومَن سَنّ سنة سيئة فعليه وزرُها ووزرُ من عمل بها إلى يوم القيامة لا يَنقص ذلك من أعمالهم شيئاً » .فالآثار مسببات أسباب عملوا بها . وليس المراد كتابة كل ما عملوه لأن ذلك لا تحصل منه فائدة دينية يترتب عليها الجزاء . فهذا وعد ووعيد كلٌّ يأخذ بحظه منه .وقد ورد عن جابر أن النبي صلى الله عليه وسلم بلغه أن بني سلمة أرادوا أن يتحوّلوا من منازلهم في أقصى المدينة إلى قُرب المسجد وقالوا : البقاع خالية ، فقال لهم النبي صلى الله عليه وسلم « يا بني سَلِمة ديارَكم تُكتبْ آثاركم » مرتين رواه مسلم . ويعني آثار أرجلهم في المشي إلى صلاة الجماعة .وفي رواية الترمذي عن أبي سعيد زاد : أنَّه قرأ عليهم : { ونكتب ما قدموا وآثارهم } فجعل الآثار عامّاً للحسية والمعنوية ، وهذا يلاقي الوجه الثاني في موقع جملة { إنا نحن نحيى الموتى } . وهو جار على ما أسسناه في المقدمة التاسعة . وتوهَّم راوي الحديث عن الترمذي أن هذه الآية نزلت في ذلك وسياق الآية يخالفه ومكيتها تنافيه .والإِحصاء : حقيقته العدّ والحساب وهو هنا كناية عن الإِحاطة والضبط وعدم تخلف شيء عن الذكر والتعيين لأن الإِحصاء والحساب يستلزم أن لا يفوت واحد من المحسوبات .والإِمام : ما يُؤتم به في الاقتداء ويُعمَل على حسب ما يَدلّ عليه ، قال النابغة: ... بنوا مجد الحياة على إمامأطلق الإِمام على الكتاب لأن الكتاب يتّبع ما فيه من الأخبار والشروط ، قال الحارث بن حلزة: ... حذر الجور والتطاخي وهل ينقض ما في المهارق الأهواء ... والمراد ب { كل شيء } بحسب الظاهر هو كل شيء من أعمال الناس كما دل عليه السياق ، فذكر { كل شيء } لإِفادة الإِحاطة والعموم لما قدموا وآثارهم من كبيرة وصَغيرة . فكلمة { كلّ } نص على العموم من اسم الموصول ومن الجمع المعرّف بالإِضافة ، فتكون جملة { وكل شيء أحصيناه في إمام مبين } مؤكدة لجملة { ونكتب ما قدموا وآثارهم } ، ومبينة لمُجملها ، ويكون عطفها دون فصلها مراعىً فيه ما اشتملت عليه من زيادة الفائدة .ويجوز أن يكون المراد ب { كل شيء } كل ما يوجد من الذوات والأعمال ، ويكون الإحصَاء إحصاء علم ، أي تعلق العلم بالمعلومات عند حدوثها ، ويكون الإِمام المبين علم الله تعالى . والظرفية ظرفية إحاطة ، أي عدم تفلت شيء عن علمه كما لا ينفلت المظروف عن الظرف .وجعل علم الله إماماً لأنه تجري على وفقه تعلقات الإِرادة الربانية والقدرةِ فتكون جملة { وكل شيء أحصيناه } على هذا تذييلاً مفيداً أن الكتابة لا تختص بأعمال الناس الجارية على وفق التكاليف أو ضدها بل تعمّ جميع الكائنات . وإذ قد كان الشيء يرادف الموجود جاز أن يراد ب { كل شيء } الموجود بالفعل أو ما يقبل الإِيجاد وهو الممكن ، فيكون إحصاؤه هو العلم بأنه يكون أو لا يكون ومقادير كونه وأحواله ، كقوله تعالى : { وأحصى كلّ شيء عدداً } \\[ الجن : 28 \\] .\n\n",
      "translations": [
        {
          "translation": "(Lo! We it is Who bring the dead to life) for the resurrection. (We record that which they send before (them)) We record what they did before of good and evil, (and their footprints) and what they left behind of praiseworthy or blameworthy wont which were acted upon after their death. (And all things) relating to their works (We have kept in a clear register) We have written down in the Guarded Tablet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنَكْتُبُ مَاَ قَدَّمُواْ وَآثَارَهُمْ } معناه ما سَنّوا من السُّننِ\n\n\n\n\nوقوله تعالى: { وَكُلَّ شيْءٍ أَحْصَيْنَاهُ فِيۤ إِمَامٍ مُّبِينٍ } معناه علمناهُ وحفظناهُ\n والإِمامُ: الكِتابُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of God: {And We will record what they have put forward and their trace} means what they have done of deeds.\n\nAnd His saying - {All things have We preserved in a clear record} - means that We have knowledge of it and We have preserved it.\n The Imam: The Book",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مسجونين في مضيق الإمكان بحياة العلم الإيمان والتوحيد والعرفان { وَنَكْتُبُ } في لوح قضائنا وحضرة علمنا جميع { مَا قَدَّمُواْ } وأسلفوا لأنفسهم من خير وشر\n وحسنة وسيئة\n بحيث لا يشذ منها شيء لنجازيهم بها على مقتضاها { وَ } نكتب أيضاً { آثَارَهُمْ } من السنن المستحسنة والأخلاق المحمودة والآداب المرضية المقبولة\n وكذا أيضاً ما سنوا ووضعوا من أسوأ العادات والأخلاق وأخسها { وَ } بالجملة: { كُلَّ شيْءٍ } صدر ويصدر من عبادنا { أَحْصَيْنَاهُ } وفصلناه بحيث لا يشذ عن حيطة إحصائنا وتفصيلنا شيء من نقير وقطمير\n بل الكل مكتوب مثبت { فِيۤ إِمَامٍ مُّبِينٍ } هو لوح قضائنا وحضرة علمنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { إِنَّا نحنُ نحيي الموتَى } أي: نبعثهم بعد مماتهم، أو: نُخرجهم من الشرك إلى الإيمان. قال شيخ شيوخنا سيدي عبد الرحمن الفاسي: لَمَّا أمر بالتبشير بالمغفرة، والأجر الكريم، لمَن انتفع بالإنذار، أعلم بحكم مَن لم يؤمن، ولم ينتفع بالإنذار، وأنه يبعثهم، وإليه حكمهم، كما قال:\n[الأنعام: 36] هـ. { ونكتُبُ ما قدّموا } ما أسلفوا من الأعمال الصالحات وغيرها، { وآثارَهُمْ } ما تركوه، بعدهم من آثار حسنة، كعِلْم علَّموه، أو كتاب صنَّفوه، أو حبس حبسوه، أو رباط أو مسجد صنعوه. أو آثار سيئة، كبدعة ابتدعوها في الإسلام. ونحوه قوله تعالى:\n[القيامة: 13] أي: قدّم من عمله وأخّر من آثاره. وفي الحديث:\n \" مَن سنَّ في الإسلام سُنَّةً حسنةً، فعمل بها من بعده، كان له أجرُها ومثل أجر مَن عمل بها إلى يوم القيامة، من غير أن يَنْقُص من أجورِهِمْ شيءٌ. ومَن سَنَّ في الإسلام سُنَّة سيئةً فعليه وزرها، ووزرُ مَن عمل بها، من غير أن يَنْقُص من أوزارهم شيءٌ \" \nوفي خبر آخر:\n \" سبع تجري على العبد بعد موته: مَن غرس غرساً، أو حفر بئراً، أو أجرى نهراً، أو علَّمَ علماً، أو بنى مسجداً، أو ورَّث مصحفاً، أو ولداً صالحاً \" \nانظر المنذري. وهذا كله داخل في قوله تعالى: { وآثارهم } قيل: آثارهم: خطاهم إلى المساجد، للجمعة وغيرها. { وكل شيءٍ أحصيناه } حفظناه، أو عددناه وبيَّنَّاه { في إِمامٍ } كتاب { مبينٍ } اللوح المحفوظ لأنه أصل الكتب وإمامها، وقيل: صحف الأعمال. والمراد: تهديد العباد بإحصاء ما صنعوه من خير أو شر، لينزجروا عن معاصي الله، وينهضوا إلى طاعة الله. الإشارة: إنّا نحن نُحيي القلوب الميتة بالغفلة والجهل، فنحييها بالعلم والمعرفة، ونكتب ما قدّموا من العلوم، والأسرار والمعارف، وآثارهم، أي: الأنوار المتعدية إلى الغير، ممن اقتبس منهم وأخذ عنهم. قال القشيري: نُحيي قلوباً ماتت بالقسوة، بما نُمطر عليها من صنوف الإقبال والزلفة، ونكتب ما قدموا { وآثارهم } خطاهم إلى المساجد، ووقوفهم على بساط المناجاة معنا، وما ترقرقَ من دموعهم على عَرَصات خدودهم، وتَصَاعُدَ أنفاسهم. هـ. ثم ضرب مثلاً لقريش في تكذيبهم، وفيه تسلية للنبي صلى الله عليه وسلَّم، فقال: { وَٱضْرِبْ لَهُمْ مَّثَلاً... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:29",
      "similarity": 0.6775118884012457
    },
    {
      "verse": "19:94",
      "similarity": 0.5902417016695412
    },
    {
      "verse": "16:18",
      "similarity": 0.5661383952926384
    },
    {
      "verse": "14:34",
      "similarity": 0.5621266476629992
    },
    {
      "verse": "58:6",
      "similarity": 0.5302006029246512
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}