{
  "chapter": "يس",
  "text": "اذ ارسلنا اليهم اثنين فكذبوهما فعززنا بثالث فقالوا۟ انا اليكم مرسلون",
  "translations": [
    {
      "translation": "When We sent them two and they denied them both, so We reinforced them with a third. They said, 'Truly We have been sent to you as Messengers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent two of them they called them liars; so We sent a third to strengthen them. \"We have been sent to you,\" they said.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to them two Messengers and they rejected both of them as liars. Then We strengthened them with a third (Messenger).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent them two Messengers whom they rejected. We supported them by sending a third one who told the people, \"We are the Messengers (of God) who have been sent to you\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We had sent two towards them and they denied them both, so We fortified them with a third, and they all said, “Indeed we have been sent to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent to them two Messengers, they denied them both; so We reinforced them with a third, and they said: \"Verily, we have been sent to you as Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent to them two, they rejected both of them, then We strengthened (them) with a third, so they said: Surely we are apostles to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when We sent unto them two men, but they cried them lies, so We sent a third as reinforcement. They said, 'We are assuredly Envoys unto you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent unto them twain, and they denied them both, so We reinforced them with a third, and they said: Lo! we have been sent unto you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent them two messengers, they rejected them both, so We strengthened them with a third. They said, \"Truly, we have been sent to you [by God] as messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What time We sent Unto them two, then they belied the twain, wherefore We strengthened them with a third, and they said: verily we are Unto you the sent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent to them two [apostles], they impugned both of them. Then We reinforced them with a third, and they said, ‘We have indeed been sent to you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We (first) sent to them two messengers, they rejected them: But We strengthened them with a third: they said, \"Truly, we have been sent on a mission to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent to them two Messengers, they belied them both, so We reinforced them with a third, and they said: \"Verily! We have been sent to you as Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to them two, but they belied them so We reinforced them with a third. They said: 'We have surely been sent as Messengers to you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent them two messengers, but they denied them both, so We reinforced them with a third. They said, “We are messengers to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent to them two but they denied them, so We strengthened them with a third, and they said, \"Indeed, we are messengers to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:14] When We sent to them two men, and they denied them both (from idh arsalnā ilayhim ithnayni fakadhdhabūhumā to the end is a substitution for the previous idh, ‘when’), so We reinforced [them] (read fa‘azaznā or fa-‘azzaznā, in other words, We reinforced the two men) with a third, and they said, ‘We have indeed been sent to you [by God]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When We sent unto them twain) two apostles: Simon the Canaanite and Thomas, (and they denied them both, so We reinforced them with a third) We strengthened them with Simon Peter who confirmed the message conveyed by the other two apostles, (and they said; Lo! we have been sent unto you. 497\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَعَزَّزْنَا بِثَالِثٍ } معناه قَوينا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We have strengthened [the believers] with a third [angel],\" means that We have made them powerful.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذْ أَرْسَلْنَآ } وأمرنا لنبينا عيسى عليه السلام أولاً بالإرسال { إِلَيْهِمُ ٱثْنَيْنِ } هما يونس ويحيى، وقيل: غيرهما، فلما جاءا إليهم وأظهرا دعوتهم، وكانوا من عبدة الأوثان { فَكَذَّبُوهُمَا } أي: فاجئوا في تكذيبهما بلا تراخ ومهلة وتأمل وتدبر، وبعدما كذبوهما لم يقبلوا منهما دعوتهما، بل ضربوهما وحسبوهما، واستهزءوا بقولهما ودعوتهما { فَعَزَّزْنَا } أي: قويناهما وأيدنا أمرهما { بِثَالِثٍ } أي: برسول ثالث، وهو: شمعون { فَقَالُوۤاْ } أي: الرسل بعدما صاروا جماعة: { إِنَّآ إِلَيْكُمْ مُّرْسَلُونَ } [يس: 14] من قبل عيسى، المرسل من قبل الحق، ينذركم عما أنتم عليه من الباطل الفاسد، وهو عبادة الأوثان، وندعوكم إلى دعوة الحق الحقيق بالألوهية والربوبية، المستحق للعبدية، نرشدكم ونهديكم إلى دينه المنزل من قبل ربه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذ أرسلنا }: بدل من \" إذ \" الأولى، أي: إذ بعثنا { إِليهم اثنين } بعثهما عيسى عليه السلام، وهما يوحنا وبولس، أو: صادقاً وصدوقاً، أو غيرهما\n فلما قربا إلى المدينة، رأيا شيخاً يرعى غنيمات له، وهو حبيب النجار، فسأل عن حالهما، فقالا: نحن رسولا عيسى، ندعوكم من عبادة الأوثان إلى عبادة الرحمن؟ فقال: أمعكما آية؟ فقالا: نشفي المريض، ونُبرىء الأكمه والأبرص، وكان له ابن مريض منذ سنين، فمسحاه، فقام، فآمن حبيب، وفشا الخبر، فَشُفِي على أيديهما خلق كثير، فدعاهما الملك، وقال: ألنا إِلهٌ سوى آلهتنا؟ فقالا: نعم، مَن أوجدك وآلهتك، فقال: قُوما حتى أنظر في أمركما، فحبسهما\n ثم بعث عيسى عليه السلام شمعونَ، فدخل متنكراً، وعاشر حاشية الملك، حتى استأنسوا به، ورفعوا خبره إلى الملك، فاستأنس به\n فقال له ذات يوم: بلغني أنك حبستَ رجلين، فهل سمعتَ قولهما؟ قال: لا، فدعاهما\n فقال شمعون: مَن أرسلكما؟ فقالا: الله الذي خَلَق كل شيء، ورَزَق كل حيّ، وليس له شريك\n فقال: صِفاه وأوجزا، فقالا: يفعل ما يشاء، ويحكم ما يريد، قال: وما آيتكما؟ قالا: ما يتمنّى الملك، فدعا بغلام أكمه، فدعَوا الله، فأبصر الغلامُ، فقال شمعون للملك: أرأيت لو سألت إلهك حتى يصنع مثل هذا، فيكون لك وله الشرف؟ فقال: ليس لي عنك سرٌّ، إن إلهنا لا يُبصر ولا يَسمع، ولا يضر، ولا ينفع\n فقال: إِنْ قدر إلاهكما على إحياء ميّت آمنا، فدعَوا بغلام مات منذ سبعة أيام، فقام، فقال: إني دخلت في سبعة أودية من النار لِمَا مت عليه من الشرك، وأنا أُحذّركم ما أنتم عليه! فآمِنوا\n قال: وفُتحت أبواب السماء، فرأيت شابّاً حسن الوجه، يشفع لهؤلاء الثلاثة، قال الملك: مَن هم؟ قال: شمعون وهذان، فتعجّب الملك\n فلمّا رأى شمعون أن قوله أثّر فيه، نصَحه وآمن، وآمن قوم، ومَن لم يؤمن صاح عليهم جبريل، فهلكوا\n\n\nكما سيذكره بقوله: { إن كانت إلا صيحة واحدة فإذا هم خامدون }\n وهذا معنى قوله هنا: { فَكذَّبُوهُما } أي: فكذّب أصحابُ القرية المرسلين، { فعَزَّزْنَا }: قويناهما\n وقرأ شعبة بالتخفيف، من: عزّه: غلبه، أي: فغلبنا وقهرنا { بثالثٍ } وهو شمعون، وترك ذكر المفعول به لأنَّ المراد ذكر المعزّز به، وهو شمعون، وما لطف به من التدبير حتى عزّ الحق، وذلّ الباطل\n وإذا كان الكلامُ مُنصبًّا إلى غرض من الأغرض جُعل سياقه له وتوجُّهه إليه كأنما سواه مرفوض\n { فقالوا } أي: الثلاثة لأهلِ القرية: { إِنا إِليكم مُرْسَلُونَ } من عند عيسى، الذي هو من عند الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:18",
      "similarity": 0.5867024427917594
    },
    {
      "verse": "56:7",
      "similarity": 0.47604437515938763
    },
    {
      "verse": "35:1",
      "similarity": 0.4168299063036552
    },
    {
      "verse": "15:87",
      "similarity": 0.3985632750641965
    },
    {
      "verse": "40:11",
      "similarity": 0.3980393909001345
    }
  ]
}