{
  "chapter": "يس",
  "text": "ءاتخذ من دونه ءالهة ان يردن الرحمن بضر لا تغن عنى شفعتهم شيـا ولا ينقذون",
  "translations": [
    {
      "translation": "Should I take other gods apart from Him, who would neither be able to intercede for me nor save me if Ar-Rahman brings me harm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Shall I take any deities apart from Him whose intercession will not avail me the least were the Merciful One to bring any adversity upon me, nor will they be able to rescue me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I worship other gods besides Him? If the Beneficent God was to afflict me with hardship, the intercession of the idols can be of no benefit to me nor could it rescue me from hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“What! Shall I appoint Gods other than Allah? So that if the Most Gracious should wish me any harm, their intercession would be of no use to me, nor would they be able to save me?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take besides Him gods If the Most Gracious intends me any harm, their intercession will be of no use for me whatsoever, nor can they save me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! shall I take besides Him gods whose intercession, If the Beneficent Allah should desire to afflict me with a harm, shall not avail me aught, nor shall they be able to deliver me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shall I take, apart from Him, gods whose intercession, if the All-merciful desires affliction for me, shall not avail me anything, and who will never deliver me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take (other) gods in place of Him when, if the Beneficent should wish me any harm, their intercession will avail me naught, nor can they save?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take others besides Him as gods? If the Gracious God should intend me any harm, their intercession will be of no avail, nor can they deliver me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take beside Him gods when, if the Compassionate should intend me any harm, their intercession will avail me not at all, nor would they save me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take gods besides Him? If the All-beneficent desired to cause me any distress, their intercession will not avail me in any way, nor will they rescue me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take (other) gods besides Him? If (Allah) Most Gracious should intend some adversity for me, of no use whatever will be their intercession for me, nor can they deliver me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take besides Him aliha (gods), if the Most Beneficent (Allah) intends me any harm, their intercession will be of no use for me whatsoever, nor can they save me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shall I take, other than Him, gods whose intercession, if the Merciful desires to afflict me, cannot help me at all, and they will never save me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I take other gods instead of Him? If the Merciful desires harm for me, their intercession will not avail me at all, nor will they save me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I take other than Him [false] deities [while], if the Most Merciful intends for me some adversity, their intercession will not avail me at all, nor can they save me?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:23] Shall I take (a-attakhidu: regarding the two hamzas here, the same applies as mentioned with regard to aandhartuhum above; this is an interrogative meant as a denial) besides Him, in other words, other than Him, [other] gods, idols, whose intercession, [that intercession of theirs] which you assert, if the Compassionate One should wish me any harm, will not avail me in any way, nor will they [be able to] save me? (wa-lā yunqidhūn is an adjectival qualification of ālihatan, ‘gods’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Shall I take) shall I worship ((other) gods in place of Him) idols because of your command (when, if the Beneficent should wish me any harm) any severe punishment, (their intercession will avail me naught) they have no intercession when it comes to Allah's chastisement, (nor can they save) nor can the idols save me from Allah's chastisement?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } أنكروا المعبود على الحق، المظهر لما في الوجود { أَتَّخِذُ مِن دُونِهِ آلِهَةً } باطلة من الأوثان، عاطلة عن التصرفات مطلقاً، منحطة عن رتبة العبودية، فكيف عن الربوبية والألوهية؟! وسميتهم شفعاء مغيثين لدى الحاجة مع أنه { إِن يُرِدْنِ ٱلرَّحْمَـٰنُ } القادر المقتدر على أصناف الإنعام والانتقام { بِضُرٍّ } أي: مصيبة وسوء يتعلق مشيئته على إنزاله إليّ { لاَّ تُغْنِ } ولا تدفع { عَنِّي شَفَاعَتُهُمْ شَيْئاً } من بأس الله وعذابه، بل لا تنفعني شفاعتهم أصلاً { وَلاَ يُنقِذُونَ } [يس: 23] بالمعاونة والمظاهرة عن عذابه سبحانه أيضاً\n\n\n\n\nوبالجملة: { إِنِّيۤ } بواسطة اتخاذهم شركاء لله، شفعاء عنده { إِذاً لَّفِي ضَلاَلٍ مُّبِينٍ } [يس: 24] وغواية عظيمة ظاهرة؛ إذ اختيار ما لا ينفع ولا يضر على الضار النافع المعطي المانع، أو ادعاء مشاركتهم معه وشفاعتهم عنده سبحانه من أشد الضلالات وأردأ الجهالات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال: { أأتخذُ من دونه آلهةً } يعني الأصنام، { إِن يُرِدْنِ الرحمنُ بضُرٍّ } وهو شرطٌ جوابه: { لا تُغْنِ عني شفاعَتُهم شيئاً ولا يُنقِذُون } من مكروه بالنصر والمظاهرة، { إِني إِذاً } أي: إذا اتخذت إلهاً غيره { لفي ضلالٍ مبين } لفي خطأ بيّن، لا يخفى على عاقل، { إِني آمنتُ بربكم فاسمَعُون } أي: اسمعوا إيماني، لتشهدوا به لي يوم القيامة، فقتله قومُه\n ولمَّا مات { قيل } له: { ادخُلِ الجنةَ } فدُفن في أنطاكية، وقبره بها\n ولم يقل: قيل له لأن الكلام مسوق لبيان القول، لا لبيان المقول له لكونه معلوماً\n وفيه دلالة على أن الجنة مخلوقة الآن\n وقال الحسن: لَمَّا أراد القوم أن يقتلوه رفعه الله، فهو في الجنة، ولا يموت إلا بفناء السماوات والأرض، فلما دخل الجنة ورأى نِعَمَهَا، وما أعدّ الله لأهل الإيمان، { قال يا ليت قومي يعلمون بما غفرَ لي ربي } أي: بالسبب الذي غفر لي ربي به، { وجعلني من المكرمين } بالجنة، وهو الإيمان بالله ورسله، أو: بمغفرة ربي وإكرامي، فـ \" ما \": موصولة، حُذف عائدها المجرور، لكونه جُرّ بما جُرّ به الموصول، أو: مصدرية، وقيل: استفهامية\n ورُدّ بعدم حذف ألفها\n قال الكواشي: تمنى أن يعلم قومُه أنَّ الله قد غفر له، وأكرمه، ليرغب قومُه في اتباع الرسل، فيُسلموا، فنصح قومَه حيًّا وميتاً\n وكذلك ينبغي أن يكون كل داع إلى الله تعالى، في المجاهدة والنصيحة لعباد الله، وألاَّ يحقد عليهم إن آذوه، وأن يكظّم كل غيظ يناله بسببهم\n\n\nوعن رسول الله صلى الله عليه وسلم:\n\n \" سُبَّاق الأمم ثلاثة: علي بن أبي طالب، وصاحب يس، ومؤمن آل فرعون \" \n\nهـ\n قال القشيري: قد أَبْلَغَ ـ حبيب الوَعْظَ، وصَدَقَ النُّصْح، ولكن كما قالوا وأنشدوا:\n\nفلمَّا صَدَقَ في حاله، وصَبَرَ على ما لَقِيَ من قومه، ورجع إلى ربه، تلقَّاه بحسن إقباله، وآواه إلى كنف إفضاله، ووجد ما وعده به من لُطْفِ نواله، فتَمنَّى أنْ يعلم قومُه حاله، فَحَقَّقَ مُناة، وأخبر عن حاله، وأنزل فيه خطابه، وعَرَفَ قومُه هـ\n الإشارة: أحبُّ الخلق إلى الله أنفعهم لعياله وأنصحهم لهم\n وفي الحديث:\n\n \" لئن يهدي الله بك رَجُلاً واحداً خيرٌ لك من حُمْرِ النِّعَم \" \n\nفينبغي لمَن أراد الظفر بمحبة الحبيب، وينال منه الحظوة والتقريب، أن يتحمّل المشاق في إرشاد عباد الله، ويستعمل الأسفار في ذلك، لينال عنده الجاه الكبير، والقُرب العظيم\n حققنا الله بذلك بمنِّه وكرمه\n ثم ذكر هلاك قومه، فقال: { وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِ\n\n\n }\n",
      "translations": []
    }
  ]
}