{
  "chapter": "يس",
  "text": "وما انزلنا على قومه منۢ بعده من جند من السماء وما كنا منزلين",
  "translations": [
    {
      "translation": "We did not send down to his people any host from heaven after him nor would We send one down.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send down any army against his people from heaven, nor did We have to send one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him, We did not send down any hosts from the heaven; We stood in no need to send down any host.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send an army against his people from the heaven after his death nor did We need to send one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And after him, We did not send down any army from heaven against his people, nor did We intend to send down an army.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not against his people after him an army from the heaven, nor was it needful for Us to send (such a thing).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send down upon his people after him any hosts from heaven, nor do We ever send down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not down upon his people, after him, any host out of heaven; neither would We send any down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent not down against his people after him a host from heaven, nor do We ever send.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him We did not send down against his people a host from heaven, nor do We send down such hosts:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not against his people after him a host from heaven, nor have We been sending down any such.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him We did not send down on his people a host from the sky, nor We would have sent down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not down against his People, after him, any hosts from heaven, nor was it needful for Us so to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not against his people after him a host from heaven, nor do We send (such a thing).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send down to his nation after him any army from heaven, neither would We send any down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him, We sent down no hosts from heaven to his people; nor would We ever send any down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send down upon his people after him any soldiers from the heaven, nor would We have done so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:28] And We did not send (mā here is for negation) down on his people, namely, Habīb’s, after him, after his death, any host from the heaven, that is, any angels to destroy them, nor do We [ever] send down, any angels to destroy anyone.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا أَنْزَلْنَا عَلَى قَوْمِهِ مِنْ بَعْدِهِ مِنْ جُنْدٍ مِنَ السَّمَاءِ وَمَا كُنَّا مُنْزِلِينَ (28) رجوع إلى قصة أصحاب القرية بعد أن انقطع الحديث عنهم بذكر الرجل المؤمن الذي جاء من أقصى المدينة ناصحاً لهم وكان هذا الرجوع بمناسبة أن القوم قومُ ذلك الرجل .فجملة { وما أنزلنا على قومه } الخ عطف على جملة { قيل ادخُل الجَنَّة } \\[ يس : 26 \\] فهي مستأنفة أيضاً استئنافاً بيانياً لأن السامع يتشوف إلى معرفة ما كان من هذا الرجل ومِن أمر قومه الذين نصحهم فلم ينتصحوا فلما بيّن للسامع ما كان من أمره عطف عليه بيان ما كان من أمر القوم بعدَه .وافتتاح قصة عقابهم في الدنيا بنفي صورة من صُور الانتقام تمهيد للمقصود من أنهم ما حلّ بهم إلا مثل ما حلّ بأمثالهم من عذاب الاستئصال ، أي لم ننزل جنوداً من السماء مخلوقة لقتال قومه ، أو لم ننزل جنوداً من الملائكة من السماء لإِهلاكهم ، وما كانت عقوبتهم إلا صيحة واحدة من مَلَك واحد أهلكتهم جميعاً .و { مِن } في قوله : { مِن بَعْدِهِ } مزيدة في الظرف لتأكيد اتصال المظروف بالظرف وأصلها { مِن } الابتدائية ، وإضافة { بعد } إلى ضمير الرجل على تقدير مضاف شائع الحذف ، أي بعدَ موته كقوله تعالى : { إذ قال لبنيه ما تعبدون من بعدي } \\[ البقرة : 133 \\] .و { مِن } في قوله : { مِن جُندٍ } مؤكدة لعموم { جُنْدٍ } في سياق النفي ، و { مِن } في قوله : { مِنَ السَّمَاءِ } ابتدائية وفي الإِتيان بحرف { مِن } ثلاثَ مرات مع اختلاف المعنى مُحسّن الجناس . وفي هذا تعريض بالمشركين من أهل مكة إذ قالوا للنبيء صلى الله عليه وسلم { أو تأتَي بالله والملائكة قبيلاً } \\[ الإسراء : 92 \\] أي تأتي بالله الذي تدّعي أنه أرسلك ومعه جنده من الملائكة ليثأر لك .فجملة { وما كُنَّا مُنزِلينَ } معترضة بين نوعي العقاب المنفي والمثبَت ، لقصد الرد على المشركين بأن سنة الله تعالى لم تجر بإنزال الجنود على المكذبين وشأن العاصين أَدْوَنُ من هذا الاهتمام .\n\n",
      "translations": [
        {
          "translation": "(We sent not down) as destruction (against his people after him) after they killed him (a host from heaven) angels from heaven, (nor do We ever send) down to them angels; it is also said that this means: We did not send to them messengers after they killed him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما قتلوه ورفعناه عنايةً منا إياه\n وأدخلناه في جنة وحدتنا مغفوراً مسروراً\n وكشفنا عنه غطاءه\n أخذنا في انتقام قومه عنه\n فأهلكناهم بصيحة واحدة صاح بها جبريل عليه السلام بأمرنا إياه { مَآ أَنزَلْنَا عَلَىٰ قَوْمِهِ } أي: قوم الحبيب\n وهم أهل أنطاكية { مِن بَعْدِهِ } أي: بعد قتله\n لننتقم عنهم لأجله { مِن جُندٍ مِّنَ } جنود { ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ } [يس: 28] أي: ما ثبت منا\n وما جرى في لوح قضائنا إنمال الملائكة لإهلاكهم كما جرت سنتنا لإهلاك سائر الأمم الهالكة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما أنزلنا على قومه من بعده } أي: من بعد قتله\n أو رفعه { من جُندٍ من السماء } فيهلكهم\n { وما كنا مُنزِلينَ } وما كان يصحّ في حكمنا في إهلاك قوم أن نُنزل عليهم جنداً من السماء\n كما فعلنا معك يوم بدر والخندق لحظوتك عندنا\n وفيه تحقير لإهلاكهم\n وتعظيم لشأن الرسول ـ عليه الصلاة والسلام ـ قال في الكشاف: فإن قلت: لِمَ أنزل الجنود من السماء يوم بدر والخندق\n مع أنه كان يكفي ملك واحد\n فقد أهلكت مدائن قوم لوط بريشة من جناح جبريل\n وبلاد ثمود وقوم صالح بصيحة واحدة؟ قلت: لأن الله فضَّل محمداً صلى الله عليه وسلم بكل شيء\n على كبار الأنبياء وأولي العزم\n فضلاً عن حبيب النجار\n هـ\n ملخصاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:7",
      "similarity": 0.7407629041476183
    },
    {
      "verse": "9:26",
      "similarity": 0.5996473776735053
    },
    {
      "verse": "37:173",
      "similarity": 0.5900544851831474
    },
    {
      "verse": "48:4",
      "similarity": 0.5788336433718203
    },
    {
      "verse": "85:17",
      "similarity": 0.567532298087208
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}