{
  "chapter": "يس",
  "text": "وما لى لا اعبد الذى فطرنى واليه ترجعون",
  "translations": [
    {
      "translation": "Why should I not worship Him who brought me into being, to whom you will be brought back in the end?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I not serve the One Who created me and to Whom all of you shall be sent back?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I not worship God who has created me? To him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And what is the matter with me that I should not worship Him Who created me, whereas it is towards Him that you are to return?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should I not worship Him Who has created me and to Whom you shall be returned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what reason have I that I should not serve Him Who brought me into existence? And to Him you shall be brought back;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should I not serve Him who originated me, and unto whom you shall be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For what cause should I not serve Him Who hath created me, and unto Whom ye will be brought back?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I not worship Him who has brought me into being, and to whom you shall all be recalled?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth me that I should not worship Him who hath created me, and Unto whom ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I not worship Him who has originated me, and to whom you shall be brought back?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It would not be reasonable in me if I did not serve Him Who created me, and to Whom ye shall (all) be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should I not worship Him (Allah Alone) Who has created me and to Whom you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I not worship Him who has originated me and to whom you shall all be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And why should I not worship Him Who created me, and to Whom you will be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should I not worship He who created me and to whom you will be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:22]   And why should I not worship Him Who originated me, [Him Who] created me — in other words: there is nothing to prevent me from worshipping Him when the necessitating factors for this exist, and the same applies to you — and to Whom you shall be returned?, after death, whereupon He will requite you for your disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And he said to them in reply: (For what cause should I not serve Him Who hath created me, and unto Whom ye will be brought back) after you die?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمع القوم من الحبيب ما سمعوا، عيروه وشنعوا عليه، وقالوا له: لست أنت أيضاً على ديننا ودين آبائنا، بل ما أنتم إلا على دين هؤلاء المدعين { وَ } بعدما ما تفرس الحبيب منهم الإكار عليه أيضاً، قال كلاماً ناشئاً عن محض الحكمة والفطنة على وجه العظة والتذكر لنفسه؛ ليتعظوا به على سبيل الالتزام؛ إذ هو أسلم الطرق في العظة والتذكير، وأدخل في النصيحة والتنبيه: { مَا لِيَ } أي: أيّ شيء عرض عليّ ولحق بي { لاَ أَعْبُدُ } وأتوجه على وجه التذلل والانكسار للمعبود { ٱلَّذِي فَطَرَنِي } على فطرة العبودية؛ أي: أبدعني وأظهرني من كتم العدم ولم أك شيئاً مذكوراً، ورباني بأنواع اللطف والكرم وأفاض عليّ من موائد لطفه وإحسانه، سيما العقل المفاض المرشد إلى المبدأ والمعاد { وَ } كيف لا أعبد وأتوجه نحوه؛ إذ { إِلَيْهِ } سبحانه الموصوف بالأسماء الحسنى ونعوت الجلال والجمال، لا إلى غيره من الأوثان والأصنام الحادثة، الهالكة في ذواتها، العاطلة عن الأوصاف الكاملة، المنحطة عن رتبة الألوهية والربوبية { تُرْجَعُونَ } [يس: 22] أنتم أيها الأظلال الهالكون، التائهون في بيداء ظهوره، حيارى هائمين رجوع الأضواء إلى شمس الذات، والأمواج إلى بحر الوحدة الذاتية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقالوا: وأنت على دين هؤلاء؟ فقال: { وما لي لا أعبدُ الذي فطرني }: خلقني { وإِليه تُرجعون } وفيه التفات من التكلُّم إلى الخطاب، ومقتضى الظاهر: وإليه أرجع\n والتحقيق: أن المراد: ما لكم لا تعبدون، لكن لمّا عبَّر عنهم بطريق التكلُّم تلطّف في الإرشاد، بإيراده في معرض المناصحة لنفسه، وإمحاض النصح، حيث أراد لهم ما أراد لها، جرى على ذلك في قوله: { وإليه ترجعون } والمراد: تقريعهم على ترك عبادة خالقهم إلى عبادة غيره",
      "translations": []
    }
  ]
}