{
  "chapter": "يس",
  "text": "اتبعوا۟ من لا يسـلكم اجرا وهم مهتدون",
  "translations": [
    {
      "translation": "Follow those who do not ask you for any wage and who have received guidance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who do not ask for any recompense of you, and are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "follow those who do not ask any recompense from you and are rightly-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who do not ask you for any reward and who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Obey those who do not ask any fee from you, and they are on guidance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey those who ask no wages of you, and who are rightly guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow him who does not ask you for reward, and they are the followers of the right course;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow such as ask no wage of you, that are right-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who ask of you no fee, and who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who ask no recompense of you and are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who ask not of you any hire, and who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow them who do not ask you any reward and they are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey those who ask no reward of you (for themselves), and who have themselves received Guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey those who ask no wages of you (for themselves), and who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "follow those who ask no wage of you and are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who ask you of no wage, and are themselves guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow those who do not ask of you [any] payment, and they are [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:21] Follow (ittabi‘ū, this reiterates the preceding [ittabi‘ū]) them who do not ask you for any reward, in return for [delivering to you] the message, and who are rightly guided. And so he was asked, ‘Do you follow their religion?’ So he replied:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاتَّبِعُوا مَنْ لَا يَسْأَلُكُمْ أَجْرًا وَهُمْ مُهْتَدُونَ (21) وجملة { اتبعوا من لا يسألكم أجراً } مؤكدة لجملة { اتبعوا المرسلين } مع زيادة الإِيماء إلى علة اتّباعهم بلوائح علامات الصدق والنصح على رسالتهم إذ هم يَدْعُون إلى هُدى ولا نفع ينجرّ لهم من ذلك فتمحّضت دعوتهم لقصد هداية المرسَل إليهم ، وهذه كلمة حكمة جامعة ، أي اتبعوا من لا تخسرون معهم شيئاً من دنياكم وتربحون صحة دينكم .وإنما قدم في الصلة عدم سؤال الأجر على الاهتداء لأن القوم كانوا في شك من صدق المرسلين وكان من دواعي تكذيبهم اتّهامهم بأنهم يجرّون لأنفسهم نفعاً من ذلك لأن القوم لما غلب عليهم التعلق بحب المال وصاروا بعداء عن إدراك المقاصد السامية كانوا يَعُدّون كل سعي يلوح على امرىء إنما يسعى به إلى نفعه . فقدم ما يزيل عنهم هذه الاسترابة وليَتهَيّؤوا إلى التأمل فيما يدعونهم إليه ، ولأن هذا من قبيل التخلية بالنسبة للمرسلين والمرسل إليهم ، والتخلية تُقدَّم على التحلية ، فكانت جملة { لا يسألكم أجراً } أهم في صلة الموصول .والأجر يصدق بكل نفع دنيوي يحصل لأحد من عمله فيشمل المال والجاه والرئاسة . فلما نفي عنهم أن يسألوا أجراً فقد نفي عنهم أن يكونوا يرمون من دعوتهم إلى نفع دنيوي يحصل لهم .وبعد ذلك تهيّأ الموقع لجملة { وهُم مهتدون } ، أي وهم متّصفون بالاهتداء إلى ما يأتي بالسعادة الأبدية ، وهم إنما يدعونكم إلى أن تسيروا سِيرتهم فإذا كانوا هم مهتدين فإن ما يدعونكم إليه من الاقتداء بهم دعوة إلى الهدى ، فتضمنت هذه الجملة بموقعها بعد التي قبلها ثناء على المرسلين وعلى ما يدعون إليه وترغيباً في متابعتهم .وأعلم أن هذه الآية قد مثل بها القزويني في «الإِيضاح» و «التلخيص» للإِطناب المسمى بالإِيغال وهو أن يُوتَى بعد تمام المعنى المقصود بكلام آخر يتمّ المعنى بدونه لنكتة ، وقد تبين لك مما فسّرنا به أن قوله : { وهم مهتدون } لم يكن مجرد زيادة بل كان لتوقف الموعظة عليها ، وكان قوله : { من لا يسألكم أجراً } كالتوطئة له . ونعتذر لصاحب «التلخيص» بأن المثال يكفي فيه الفرض والتقدير .وجاءت الجملة الأولى من الصلة فعلية منفية لأن المقصود نفي أن يحدث منهم سؤال أجر فضلاً عن دوامه وثباته ، وجاءت الجملة الثانية اسمية لإِفادة إثبات اهتدائهم ودوامه بحيث لا يخشى من يتبعهم أن يكون في وقت من الأوقات غير مهتد .\n\n",
      "translations": [
        {
          "translation": "(Follow those who ask of you no fee) or reward for believing in Allah, (and who are rightly guided) and who guide to belief in Allah's divine Oneness. They said to him: you have absolved yourself from us and from the religion of our forefathers and embraced the religion of our enemy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱتَّبِعُواْ مَن لاَّ يَسْأَلُكُمْ أَجْراً } أي: اتبعوا هادياً بالحق على الحق إلى الحق\n خالصاً لوجه الحق بلا غرض نفساني من جعل وغيره\n كالمشتيخة المزورين الذين يجمعون بتلبيساتهم وتغريراتهم أموالاً كثيرة من الحمقى المتماثلين نحو أباطليهم وتزويراتهم { وَ } كيف لا تتبعون أيها العقلاء الطالبون للهداية والصواب { هُمْ مُّهْتَدُونَ } [يس: 21] مصيبون\n متصفون بالرشد والهداية قولاً وفعلاً\n\n\nثم لما سمع القوم من الحبيب ما سمعوا\n عيروه وشنعوا عليه\n وقالوا له: لست أنت أيضاً على ديننا ودين آبائنا\n بل ما أنتم إلا على دين هؤلاء المدعين { وَ } بعدما ما تفرس الحبيب منهم الإكار عليه أيضاً\n قال كلاماً ناشئاً عن محض الحكمة والفطنة على وجه العظة والتذكر لنفسه\n ليتعظوا به على سبيل الالتزام\n إذ هو أسلم الطرق في العظة والتذكير\n وأدخل في النصيحة والتنبيه: { مَا لِيَ } أي: أيّ شيء عرض عليّ ولحق بي { لاَ أَعْبُدُ } وأتوجه على وجه التذلل والانكسار للمعبود { ٱلَّذِي فَطَرَنِي } على فطرة العبودية\n أي: أبدعني وأظهرني من كتم العدم ولم أك شيئاً مذكوراً\n ورباني بأنواع اللطف والكرم وأفاض عليّ من موائد لطفه وإحسانه\n سيما العقل المفاض المرشد إلى المبدأ والمعاد { وَ } كيف لا أعبد وأتوجه نحوه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n اتبعوا مَن لا يسأَلُكُم أجراً } على تبليغ الرسالة { وهم مهتدون } على جادة الهداية والنصح وتبليغ الرسالة\n فقالوا: وأنت على دين هؤلاء؟ فقال: { وما لي لا أعبدُ الذي فطرني }: خلقني { وإِليه تُرجعون } وفيه التفات من التكلُّم إلى الخطاب\n ومقتضى الظاهر: وإليه أرجع\n والتحقيق: أن المراد: ما لكم لا تعبدون\n لكن لمّا عبَّر عنهم بطريق التكلُّم تلطّف في الإرشاد\n بإيراده في معرض المناصحة لنفسه\n وإمحاض النصح\n حيث أراد لهم ما أراد لها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:109",
      "similarity": 0.6907996006219791
    },
    {
      "verse": "26:127",
      "similarity": 0.6907996006219791
    },
    {
      "verse": "26:145",
      "similarity": 0.6907996006219791
    },
    {
      "verse": "26:164",
      "similarity": 0.6907996006219791
    },
    {
      "verse": "26:180",
      "similarity": 0.6907996006219791
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036021.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036021.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:21.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}