{
  "chapter": "يس",
  "text": "والشمس تجرى لمستقر لها ذلك تقدير العزيز العليم",
  "translations": [
    {
      "translation": "And the sun runs to its resting place. That is the decree of the Almighty, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While the sun keeps revolving in its orbit. This is the dispensation of the mighty, all-knowing (God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun is running its course to its appointed place. That is the ordaining of the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "how the sun moves in its orbit and this is the decree of the Majestic and All-knowing God;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs its course for its final destination; this is a command of the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs on its fixed course for a term (appointed). That is the decree of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs on to a term appointed for it; that is the ordinance of the Mighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun -- it runs to a fixed resting-place; that is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runneth on unto a resting-place for him. That is the measuring of the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun, too, follows its determined course laid down for it by the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runneth to its appointed term: that is the disposition of the Mighty, the Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun runs on to its place of rest: That is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs his course for a period determined for him: that is the decree of (Him), the Exalted in Might, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs on its fixed course for a term (appointed). That is the Decree of the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun runs to its fixed restingplace; that is the decree of the Almighty, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs towards its destination. Such is the design of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs [on course] toward its stopping point. That is the determination of the Exalted in Might, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:38] And the sun [which] runs (from wa’l-shamsu tajrī to the end [of the statement] is subsumed by [the introductory] wa-āyatun lahum, ‘and a sign for them’; alternatively, it constitutes another sign [for them]; similar is the case with wa’l-qamara, ‘and the moon’ [further below]) to its resting-place, in other words, it does not overstep it. That, namely, its running, is the ordaining of the Mighty, in His kingdom, the Knower, of His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ (38){ الشمس } يجوز أن يكون معطوفاً على { اللَّيْلُ } من قوله : { وءايَةٌ لهم اللَّيْلُ } \\[ يس : 37 \\] عطفَ مفرد على مفرد ويقدر له خبر مماثل لخبر الليل ، والتقدير : والشمس آية لهم ، وتكون جملة { تَجْرِي } حالاً من { الشمس } مثل جملة { نَسْلَخُ منه النَّهَارَ } \\[ يس : 37 \\] .ويجوز أن يكون عطفَ جملة على جملة ويكون قوله : { تَجْرِي } خبراً عن { الشمس } . وأيَّاما كان فهو تفصيل لإِجمال جملة { وءاية لهم الليل نسلخ منه النهار } \\[ يس : 37 \\] الخ كما دل عليه قوله الآتي : { ولا اللَّيْلُ سَابِقُ النَّهَارِ } \\[ يس : 40 \\] ، وكان مقتضى الظاهر من كونه تفصيلاً أن لا يعطف فيقال : الشمسُ تجري لمستقر لها ، فخولف مقتضى الظاهر لأن في هذا التفصيل آيةً خاصة وهي آية سير الشمس والقمر .وقدم التنبيه على آية الليل والنهار لما ذكرناه هنالك؛ فكانت آية الشمس المذكورة هنا مراداً بها دليل آخر على عظيم صنع الله تعالى وهو نظام الفصول .وجملة { تَجْرِي لِمُسْتقر لها } يحتمل الوجوه التي ذكرناها في جملة { أحييناها } \\[ يس : 33 \\] من كونها حالاً أو بياناً لجملة { وءَايَةٌ لهُم } \\[ يس : 37 \\] أو بدل اشتمال من { وءَايَةٌ .والجري حقيقته : السير السريع وهو لذوات الأرْجل ، وأطلق مجازاً على تنقل الجسم من مكان إلى مكان تنقلاً سريعاً بالنسبة لتنقل أمثال ذلك الجسم ، وغلب هذا الإِطلاق فساوى الحقيقة وأريد به السير في مسافات متباعدة جِدَّ التباعد فتقطعها في مدة قصيرة بالنسبة لتباعد الأرض حول الشمس . وهذا استدلال بآثار ذلك السير المعروفةِ للناس معرفةً إجمالية بما يحسبون من الوقت وامتداد الليل والنهار وهي المعرفة لأهل المعرفة بمراقبة أحوالها من خاصة الناس وهم الذين يرقبون منازل تنقلها المسماة بالبروج الاثني عشر ، والمعروفةِ لأهل العلم بالهيئة تفصيلاً واستدلالاً وكل هؤلاء مخاطبون بالاعتبار بما بلغه علمهم .والمستقر : مكان الاستقرار ، أي القرار أو زمانه ، فالسين والتاء فيه للتأكيد مثل : استجاب بمعنى أجاب . واللام في لِمُستَقَرٍ } يجوز أن تكون لام التعليل على ظاهرها ، أي تجري لأجل أن تستقر ، أي لأجل أن ينتهي جريها كما ينتهي سير المسافر إذا بلغ إلى مكانه فاستقر فيه ، وهو متعلق ب { تجري } على أنه نهاية له لأن سير الشمس لما كانت نهايته انقطاعَه نُزّل الانقطاع عنه منزلة العلة كما يقال : «لِدُوا للموت وابنوا للخراب» .وتنزيل النهاية منزلة العلة مستعمل في الكلام ، ومنه قوله تعالى : { فالتقطه آل فرعون ليكون لهم عدواً وحزناً } \\[ القصص : 8 \\] . والمعنى : أنها تسير سيراً دائباً مشاهداً إلى أن تبلغ الاحتجاب عن الأنظار .ويجوز أن تكون اللام بمعنى ( إلى ) ، أي تجري إلى مكان استقرارها وهو مكان الغروب ، شبه غروبها عن الأبصار بالمستقَر والمأوَى الذي يأوي إليه المرء في آخر النهار بعد الأعمال . وقد ورد تقريب ذلك في حديث أبي ذر الهروي في صحيحي «البخاري» و«مسلم» و«جامع الترمذي» بروايات مختلفة حاصل ترتيبها أنه قال :\" كنتُ مع رسول الله في المسجد عند غروب الشمس فسألته ( أو فقال ) : إن هذه تجري حتى تنتهي إلى مستقرها تحت العرش فتخرَّ ساجدة فلا تزال كذلك حتى يقال لها : ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعةً من مطلعها ثم تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها : ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ، ثم تجري لا يستنكر الناس منها شيئاً حتى تنتهي إلى مستقرها ذاك تحت العرش فيقال لها : ارتفعي أصبحي طالعة من مغربك فتصبح طالعة من مغربها فذلك مستقرّ لها ومستقرها تحت العرش فذلك قوله تعالى : { والشمس تجري لمستقر لها } \" وهذا تمثيل وتقريب لسير الشمس اليومي الذي يبتدىء بشروقها على بعض الكرة الأرضية وينتهي بغروبها على بعض الكرة الأرضية ، في خطوط دقيقة ، وبتكرر طلوعها وغروبها تتكون السنة الشمسية .وقد جعل الموضع الذي ينتهي إليه سيرها هو المعبر عنه بتحت العرش وهو سمت معيّن لا قبل للناس بمعرفته ، وهو منتهى مسافة سيرها اليومي ، وعنده ينقطع سيرها في إبان انقطاعه وذلك حين تطلع من مغربها ، أي حين ينقطع سير الأرض حول شعاعها لأن حركة الأجرام التابعة لنظامها تنقطع تبعاً لانقطاع حركتها هي وذلك نهاية بقاء هذا العالم الدنيوي .واللام في قوله { لها } لام الاختصاص وهو صفة { لِمُسْتَقَر } . وعُدل عن إضافة مستقر لضمير الشمس المغنية عن إظهار اللام إلى الإِتيان باللام ليتأتى تنكير «مستقر» تنكيراً مشعراً بتعظيم ذلك المستقر .وكلام النبي صلى الله عليه وسلم هذا تمثيل لحال الغروب والشروق اليوميين . وجعل سجود الشمس تمثيلاً لتسخرها لتسخير الله إياها كما جعل القول تمثيلاً له في آية { فقال لها وللأرض ائتيا طوعاً أو كرهاً قالتا أتينا طائعين } \\[ فصلت : 11 \\] .واعلم أن قوله : { لِمُستقر لها } إدماج للتعليم في التذكير وليس من آية الشمس للناس لأن الناس لا يشعرون به فهو كقوله تعالى : { ليقضى أجل مسمى } \\[ الأنعام : 60 \\] عقب الامتنان بقوله : { وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه ليقضى أجل مسمى ثم إليه مرجعكم } \\[ الأنعام : 60 \\] .والإشارة ب { ذلك تقديرُ العَزِيزِ العلِيمِ } إلى المذكور : إما من قوله : { والشَّمْسُ تَجْرِي } أي ذلك الجري ، وإما منه ومن قوله : { وءايَة لهم اللَّيْلُ } \\[ يس : 37 \\] أي ذلك المذكور من تعاقب الليل والنهار .وذكر صفتي { العَزِيزِ العَلِيمِ } لمناسبة معناهما للتعلق بنظام سير الكواكب ، فالعزة تناسب تسخير هذا الكوكب العظيم ، والعلم يناسب النظام البديع الدقيق ، وتقدم تفصيله عند قوله تعالى : { تبارك الذي جعل في السماء بروجاً } في سورة الفرقان } ( 61 ) .\n\n",
      "translations": [
        {
          "translation": "(And the sun runneth on unto a resting place for him) to the sun's mansion; it is also said that this means: it runs in the day and at night without any resting place. (That is the measuring of the Mighty) that is the providence of the Mighty in retribution against those who disbelieve in Him, (the Wise) He knows His creation and their providence.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَّهَـا } فمستقرُّها تَحتَ العَرشِ\n\n",
      "translations": [
        {
          "translation": " And {the sun} runs to an appointed time. Under the Throne it rests.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n الغالب على الكل بالقهر والفناء { العليم } الذي يعلم حدّ كمال كل سيّار وانتهاء سيره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من جملة آياتنا العظام: { ٱلشَّمْسُ } المضيئة\n المشرقة على صفائح الكائنات كإشراق نور الوجود المطلق\n الفائض على هياكل الموجودات حسب التجليات الإلهية { تَجْرِي } وتسري بلا قرار وثبات بمقتضى أمرنا وحكمنا { لِمُسْتَقَرٍّ لَّهَـا } بقدرناه إياها منتهى ومنزلاً بمقتضى حكمتنا المتقنة المرتبتة على تجلياتنا الحِبِّية\n المنتشئة من ذاتنا المتصفة بالأوصاف اللطيفة الجمالية { ذَلِكَ } الجري والسراية على هذا النظام الأبلغ الأبدع { تَقْدِيرُ ٱلْعَزِيزِ } القادر الغالب المتقدر على عموم المقادير { ٱلْعَلِيمِ } [يس: 39] باستعداداتها وقابلياتها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:12",
      "similarity": 0.4207055904975697
    },
    {
      "verse": "25:66",
      "similarity": 0.41917823726816844
    },
    {
      "verse": "25:76",
      "similarity": 0.3868290826315075
    },
    {
      "verse": "6:67",
      "similarity": 0.37109767102804825
    },
    {
      "verse": "75:9",
      "similarity": 0.3682464134395317
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}