{
  "chapter": "يس",
  "text": "وءاية لهم اليل نسلخ منه النهار فاذا هم مظلمون",
  "translations": [
    {
      "translation": "And there is a sign in the night for them. We strip off the day from it and they are left in darkness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the night is another Sign for them. We strip the day from it and they become plunged in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the signs for them is how We separated the day from the night and thus they remained in darkness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the night; We strip the day out of it, thereupon they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the night. We withdraw therefrom the day, and behold, they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign to them is the night: We draw forth from it the day, then lo! they are in the dark;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the night; We strip it of the day and lo, they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A token unto them is night. We strip it of the day, and lo! they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have a sign in the night: We withdraw from it the [light of] day -- and they are left in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign Unto them is the night. We draw off the day therefrom, and lo! they are darkened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sign for them is the night, which We strip of daylight, and, behold, they find themselves in the dark!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a Sign for them is the Night: We withdraw therefrom the Day, and behold they are plunged in darkness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the night, We withdraw therefrom the day, and behold, they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sign for them is the night. From it We withdraw the day and they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Another sign for them is the night: We strip the day out of it—and they are in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the night. We remove from it [the light of] day, so they are [left] in darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:37] And a sign for them, of the tremendous power [of God], is the night, from which We strip, We separate, the day and, behold, they find themselves in darkness, passing into the darkness [of the night].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A token) a lesson and sign (unto them) to the people of Mecca (is night) the dark night. (We strip it) We clear it (of the day, and lo! they are in darkness) at night.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً { آيَةٌ } عظيمة منا إياهم { لَّهُمُ } أن يتأملوا فيها ويستدلوا بها على كمال قدرتنا وأحكامنا وعلمنا وإرادتنا { ٱلَّيلُ } المظلم؛ أي: العدم الأصلي، حين { نَسْلَخُ } ننزع ونظهر { مِنْهُ } أي: من الليل المظلم { ٱلنَّهَارَ } المضيء؛ أي: نور الوجود الفائض منا إياهم حسب امتداد أظلال أسمائنا وصفاتنا عليهم { فَإِذَا هُم مُّظْلِمُونَ } [يس: 37] مستقرون في ظلمة العدم لولا إفاضة الوجود عليهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وآيةٌ لهم الليلُ نسْلَخُ منه النهارَ } نُخرج منه النهار، إخراجاً لا يبقى معه شيء من ضوء النهار\n مستعار من: سلخ الجلد عن الشاة، أو: ننزع عنه الضوء نزع القميص الأبيض، فيعري نفس الزمان، كشخص أسود، نزع عنه قميص أبيض لأن أصل ما بين السماء والأرض من الهواء: الظلمة، فاكتسى بعضه ضوء الشمس، كبيت مظلم أُسرج فيه، فإذا غاب السراج أظلم\n { فإِذا هم مُّظلِمُونَ } داخلون في الظلام\n { و } آية لهم أيضاً { الشمسُ تجري لمُسْتَقَرٍّ لها } لحدّ لها مؤقّت، تنتهي إليه من فَلكِها في آخر السنة\n شبهت بمستقرّ المسافر إذا انتهى سفره، أو: لحدّ لها من مسيرها كلّ يوم في مرائي عيون الناس، وهو المغرب\n وفي الحديث الصحيح ـ من طريق أبي ذرٍّ ـ:\n\n \" إنها تسجد كل يوم تحت العرش، فتستأذن، فيُؤذن لها، ويوشك أن تستأذن فلا يُؤذن لها، فتَطلُعُ من مغربها \" \n\n،ذرٍّ قال صلى الله عليه وسلم:\n\n \" وذلك قوله: { والشمس تجري لمستقر لها } \"\n \n\nوعن ابن عباس: أن الشمس بمنزلة السانية، تجري بالنهار في السماء في فلكها، فإذا غربت جرت في الليل تحت الأرض في فَلَكِها، حتى تطلع من مشرقها، وكذلك القمر\n كذا نقل الكواشي عنه\n ولعله لا يناقض ما جاء في الحديث، من أنها تسجد تحت العرش، لإحاطة العرش بالجميع، فهي حيث ما انتهت تحته\n ونقل الأقليشي من حديث عكرمة، عن ابن عباس: ما طلعت شمس حتى ينخسها سبعون ألف ملك، فيقولون لها: اطلعي، فتقول: لا أطلع على قوم يعبدونني من دون الله، فيأتيها ملك من الله، فيأمرها بالطلوع، فتستقل بضياء بني آدم، فيأتيها شيطان يريد أن يصدها عن الطلوع، فتطلع بين قرينه، فيحرقه الله تعالى تحتها، وما غربت شمس قط إلا خرَّت لله ساجدة، فيأتيها شيطان، يُريد أن يصدها عن السجود، فتغرب بين قرنيه، فيحرقه الله تعالى، وذلك قوله صلى الله عليه وسلم:\n\n \" ما طلعت شمس إلا بين قرنَي الشيطان، ولا غربت إلا بين قرنَي الشيطان \" \n\nهـ\n على نقل شيخ شيوخنا الفاسي\n وقرأ ابن عباس وابن مسعود: \" تجري لا مستقر لها \" ، ومعناها: إنها جارية أبداً، لا تثبت في مكان\n وقراءة الجماعة أوفق بالحديث\n { ذلك تقديرُ العزيزِ الحكيمِ } أي: ذلك الجري على ذلك التقدير البديع، والحساب الدقيق، تقدير الغالب بقدرته على كل مقدور، العليم بكل معلوم",
      "translations": []
    }
  ]
}