{
  "chapter": "يس",
  "text": "وءاية لهم الارض الميتة احيينها واخرجنا منها حبا فمنه ياكلون",
  "translations": [
    {
      "translation": "A Sign for them is the dead land which We bring to life and from which We bring forth grain of which they eat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a sign in the dead earth for them which We quicken, and produce from it grain which they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the dead earth be a Sign for them. We gave it life and produced from it grain whereof they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evidence (of the truth) for them is how We revived the dead earth\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the dead earth; We gave it life and We produced from it grain, so they eat from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the dead land. We give it life, and We bring forth from it grains, so that they eat thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign to them is the dead earth: We give life to it and bring forth from it grain SQ they eat of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the dead land, that We quickened and brought forth from it grain, whereof they eat;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A token unto them is the dead earth. We revive it, and We bring forth from it grain so that they eat thereof;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a sign for them in the lifeless earth. We revive it and We produce grain from it of which they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign Unto them is the dead land. We quicken it and therecut We bring forth grain, so that thereof they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sign for them is the dead earth, which We revive and bring forth grain out of it, so they eat of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Sign for them is the earth that is dead: We do give it life, and produce grain therefrom, of which ye do eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the dead land. We gave it life, and We brought forth from it grains, so that they eat thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dead land is a sign for them. We revive it, and from it produce grain from which they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is a sign for them in the dead land: We give it life, and produce from it grains from which they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a sign for them is the dead earth. We have brought it to life and brought forth from it grain, and from it they eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:33] And a sign for them, of the [truth of] resurrection (wa-āyatun lahum is a preceding predicate) is the dead earth (read maytatu or mayyitatu) which We revive, with water (ahyaynāhā is the subject) and out of which We bring forth grain, such as wheat, so that they eat thereof;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A token) a sign and admonition (unto them) unto the people of Mecca (is the dead earth) the earth which has no vegetation. (We revive it) by means of the rain, (and We bring forth from it grain) all types of grain (so that they eat thereof;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَآيَةٌ } عظيمة منا، دالة على كمال قدرتنا على جمعهم وإحضارهم يوم الجزاء { لَّهُمُ } أن يستدلوا بها على صدقها { ٱلأَرْضُ ٱلْمَيْتَةُ } اليابسة الجامدة، التي { أَحْيَيْنَاهَا } وأحضرناها في وقت الربيع بإنزال قطرات الماء المترشحة من بحر الحياة عليها { وَأَخْرَجْنَا مِنْهَا حَبّاً } أي: جنساً من الحبوبات التي يقتاتون بها { فَمِنْهُ يَأْكُلُونَ } [يس: 33] وبه يعيشون وينعمون، كذلك في النشور أحيينا الأبدان المائتة الجامدة البالية، المتلاشية في أراضي الأجداث بإنزال الرشحات الفائضة من بحر حياة الوجود بمقتضى الجود، فأعدناهم أحياء كما أبدعناهم أولاً من العدم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" وآية لهم \": مبتدأ، وجملة \" الأرضُ الميتة \": خبر\n يقول الحق جلّ جلاله: { وآية لهم الأرضُ الميتةُ أحييناها } أي: وعلامة لهم تدلُّ على أن الله يبعثُ الموتى، ويُحضرهم للحساب، إحياءُ الأرض اليابسة بالمطر، فاهتزت وربت بالنبات\n { وأخرجنا منها حَبّاً } جنس الحب، { فمنه يأكلون } هم وأنعامهم\n وقدَّم الظرف ليدل على أن الحبّ هو الشيء الذي يتعلق به معظمُ العيش، ويقوم، بالارتفاق به، صلاحُ الإنسان، إذا قلَّ جاء القحط، ووقع الضرّ، وإذا فُقد حضر الهلاك، ونزل البلاء",
      "translations": []
    }
  ]
}