{
  "chapter": "يس",
  "text": "يحسرة على العباد ما ياتيهم من رسول الا كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "Alas for men! No apostle ever came to them but they made fun of him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas for My servants! Never does a Messenger come to them but they mock him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to human beings! Whenever a Messenger came to them, they mocked him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said, “Woe to those bondmen – whenever a Noble Messenger comes to them, they mock at him!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas for mankind! There never came a Messenger to them but they used to mock at him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas for the servants! there comes not to them an apostle but they mock at him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah, woe for those servants! Never comes unto them a Messenger, but they mock at him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah, the anguish for the bondmen! Never came there unto them a messenger but they did mock him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas for human beings! They ridicule every messenger that comes to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah the misery of the bondmen! there cometh not: Unto them an apostle but him they have been mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How regrettable of the servants! There did not come to them any apostle but that they used to deride him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah! Alas for (My) Servants! There comes not a messenger to them but they mock him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas for mankind! There never came a Messenger to them but they used to mock at him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, for those (unbelieving) worshipers! They mocked every Messenger that came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas for the servants. No messenger ever came to them, but they ridiculed him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How regretful for the servants. There did not come to them any messenger except that they used to ridicule him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:30] Ah, the anguish for servants, [such as] these and their like from among those who denied the messengers and were destroyed (this [word, hasra] denotes ‘extreme agony’; the vocative here is being used metaphorically, in other words, ‘It is time for you [O anguish], so come now!’). Never did a messenger come to them but that they mocked him (this [statement] is given as an explanation of the cause thereof [of the ‘agony’] since it [the statement] entails their mockery which itself results in their being destroyed and which in turn is the cause of the ‘anguish’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ah, the anguish) regret and remorse (for the bondmen) on the Day of Judgement because they did not believe! (Never came there unto them a messenger but they did mock him!) they used to mock the messengers, kill them and throw them in a well.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحاه من قبل عصاة عباده، المأخوذين بشؤم ما اقترفوا من المعاصي والآثام: { يٰحَسْرَةً } وندامة وكآبة عظيمة وحزناً شديداً { عَلَى ٱلْعِبَادِ } المصرين على العناد بعدما عاينوا العذاب الدنيوي أو الأخروي النازل عليهم حتماً بسبب إنكارهم على الرسل والمرسل جميعاً، وتكذيبهم بجميع ما جاءوا به من عند ربهم، ولس لهم حنيئذ قوة المقاومة والمدافعة؛ لذلك صاروا حيارى، سكارى، هائمين، متحسرين بلا ناصر ومعين وشفيع حميم من نبي ورسول كريم؛ إذ { مَا يَأْتِيهِمْ مِّن رَّسُولٍ } في نشأتهم الأولى يصلح أحوالهم وأعمالهم لئلا يترتب عليهم الوبال والنكال الموعود في النشأة الأخرى { إِلاَّ كَانُواْ } من غاية كبرهم وخيلائهم { بِهِ } أي: بالرسول المصلح المرشد لهم { يَسْتَهْزِئُونَ } [يس: 30] ويستحقرونه ويستنكفون عن قبول دينه ودعوته، وينكرون عليه كهؤلاء المسرفين المشركين معك يا أكمل الرسل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}