{
  "chapter": "يس",
  "text": "سبحن الذى خلق الازوج كلها مما تنۢبت الارض ومن انفسهم ومما لا يعلمون",
  "translations": [
    {
      "translation": "Glory be to Him who created all the pairs: from what the earth produces and from themselves and from things unknown to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All glory to Him who created pairs of everything that grows from the earth, and out of themselves, and other things they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He Who created all things in pairs, whether it be of what the earth produces, and of themselves, and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All glory belongs to the One Who has created pairs out of what grow from the earth, out of their soul and out of that which they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Purity is to Him Who created all pairs, from what the earth grows, and of themselves, and from the things they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who has created all the pairs of that which the earth produces, as well as of their own kind, and of that which they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who created pairs of all things, of what the earth grows, and of their kind and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him, who created all the pairs of what the earth produces, and of themselves, and of what they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who created all the sexual pairs, of that which the earth groweth, and of themselves, and of that which they know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He who created all things in pairs; of what the earth grows, and of themselves, and other things which they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hallowed be He who hath created all the pairs of that which the earth groweth, and of themselves and of that which they know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immaculate is He who has created all the kinds of what the earth grows, and of themselves, and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory to Allah, Who created in pairs all things that the earth produces, as well as their own (human) kind and (other) things of which they have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him, Who has created all the pairs of that which the earth produces, as well as of their own (human) kind (male and female), and of that which they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to Him who created pairs of all the things the earth produces and of themselves, and that of which they have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him who created all the pairs; of what the earth produces, and of their own selves, and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is He who created all pairs - from what the earth grows and from themselves and from that which they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:36] Glory be to Him Who created all the pairs, the specimens, of what the earth produces, of seeds and other things, and of themselves, of males and females, and of what they do not know, of marvellous and strange creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Glory be to Him) Allah exonerates Himself (Who created all the sexual pairs) of all kinds, (of that which the earth groweth) the sweet, the sour and other things, (and of themselves) the male and female, (and of that which they know not) of other different kinds in the land and sea!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سُبْحَانَ } القادر المقتدر القيوم المطلق المنزه عن الشيبه والنظير\n المبترئ عن الشريك والوزير\n والمستقل في التصرف والتدبير { ٱلَّذِي خَلَق ٱلأَزْوَاجَ } وقدر الأصناف المتوالدة المتزايدة { كُلَّهَا مِمَّا تُنبِتُ ٱلأَرْضُ } من الشجر والنبات بأجناسهما وأنواعهما وأصنافهما { وَمِنْ أَنفُسِهِمْ } ذكورهم وإناثهم أنواعاً وأصنافاً وأشخاصاً\n وكذا من جميع ما يعلمون من أجناس الحيوانات وأصنافها وأنواعها { وَمِمَّا لاَ يَعْلَمُونَ } [يس: 36] من المخلوقات التي لا اطلاع لهم عليها\n إذ ما من مخلوق إلا وقد خلق شفعاً\n لأن الفردية والوترية والصمدية كوجود الوجود\n والقيومية المطلقة من أخص أوصاف الربوبية والألوهية\n لا شركة فيها للمصنوع أصلاً\n إذ لا يتوهم التعدد والكثرة في الوجود الذي هو الواجب قطعاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { سبحانَ الذي خلق الأزواجَ } الأصناف { كُلَّها مما تُنبتُ الأرضُ } من النخيل، والشجر، والزرع، والثمار، كيف جعلها مختلفة في الطعوم، والروائح، والشكل، والهيئة، واختلاف أوراق الأشجار، وفنون أغصانها، وأصناف نورها وأزهارها، واختلاف أشكال ثمارها، في تفرُّدها واجتماعها، مع ما بسط فيها من الطبائع الأربع: من الحرورة، والبرودة، والرطوبة، واليبوسة، وما فيها من المنافع المتنوعة\n { ومن أنفسِهم } الأولاد ذكوراً وإناثاً، { ومما لا يعلمون } من أصنافٍ لم يُطلعهم الله عليها، ولم يتوصَّلوا إلى معرفتها، ففي البحار عجائب لا يعلمها الناس\n قال تعالى:\n\n[النحل: 8]\n وفائدة التنزيه: نفي تشبيه الذات بشيء من هذه الأزواج\n والله تعالى أعلم\n قال القشيري: والعَجَبُ مِمَّن يُنكر أصول الدين، ويقول: ليس في الكتاب عليه دليل، وأكثر ما في القرآن من الآيات تدل على سبيل الاستدلال، ولكن يَهْدِي لنوره مَن يشاء، ولو أنهم أنصفوا واشتغلوا بأهم شيءٍ لهم ما ضيَّعوا أصول الدين، ورضوا فيها بالتقليد، وادَّعَوْا في الفروع رتبة الإمامة والتصدير، وفي معناها قيل:\n\nقلت: وحاصله: مدح علم الأصول وترك علم أصل الأصل، وهو علم التوحيد الخاص، أعني الشهود والعيان\n وقد قلتُ في ذلك: تذليلاً:\n\nالإشارة: وآية لهم النفس الميتة بالجهل أحييناها بالعلم، وأخرجنا منها علماً لَدُنيًّا، فمنه تتقوّت القلوب والأرواح، وجعلنا فيها جناتِ المعارف، من نخيل الحقائق، وأعناب الشرائع، وفجَّرنا فيها من عيون الحِكَم، ليأكلوا من ثمره، ومما عملته أيديهم، من المجاهدات والمكابدات، فإنها تُثمر المشاهدات\n سبحان الذي خلق الأزواج كلها من الأحوال، والمقامات، والعلوم، والمعارف، مما يُستخرج من النفوس والأرواح، ومما لا يعلمه إلا الله\n ثم ذكر برهاناً آخر، فقال: { وَآيَةٌ لَّهُمُ ٱلَّيلُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:17",
      "similarity": 0.6970117594893046
    },
    {
      "verse": "80:27",
      "similarity": 0.6079338986799592
    },
    {
      "verse": "78:15",
      "similarity": 0.585344512567901
    },
    {
      "verse": "26:7",
      "similarity": 0.5504573643103264
    },
    {
      "verse": "51:49",
      "similarity": 0.3577754666529153
    }
  ]
}