{
  "chapter": "يس",
  "text": "سبحن الذى خلق الازوج كلها مما تنۢبت الارض ومن انفسهم ومما لا يعلمون",
  "translations": [
    {
      "translation": "Glory be to Him who created all the pairs: from what the earth produces and from themselves and from things unknown to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All glory to Him who created pairs of everything that grows from the earth, and out of themselves, and other things they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He Who created all things in pairs, whether it be of what the earth produces, and of themselves, and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All glory belongs to the One Who has created pairs out of what grow from the earth, out of their soul and out of that which they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Purity is to Him Who created all pairs, from what the earth grows, and of themselves, and from the things they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who has created all the pairs of that which the earth produces, as well as of their own kind, and of that which they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who created pairs of all things, of what the earth grows, and of their kind and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him, who created all the pairs of what the earth produces, and of themselves, and of what they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who created all the sexual pairs, of that which the earth groweth, and of themselves, and of that which they know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He who created all things in pairs; of what the earth grows, and of themselves, and other things which they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hallowed be He who hath created all the pairs of that which the earth groweth, and of themselves and of that which they know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immaculate is He who has created all the kinds of what the earth grows, and of themselves, and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory to Allah, Who created in pairs all things that the earth produces, as well as their own (human) kind and (other) things of which they have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him, Who has created all the pairs of that which the earth produces, as well as of their own (human) kind (male and female), and of that which they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to Him who created pairs of all the things the earth produces and of themselves, and that of which they have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him who created all the pairs; of what the earth produces, and of their own selves, and of what they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is He who created all pairs - from what the earth grows and from themselves and from that which they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:36] Glory be to Him Who created all the pairs, the specimens, of what the earth produces, of seeds and other things, and of themselves, of males and females, and of what they do not know, of marvellous and strange creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nسُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنْبِتُ الْأَرْضُ وَمِنْ أَنْفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ (36)اعتراض بين جملة { وءاية لهم الأرض } \\[ يس : 33 \\] وجملة { وءاية لهم الليل } \\[ يس : 37 \\] ، أثارُه ذكر إحياء الأرض وإخراج الحبّ والشجر منها فإن ذلك أحوالاً وإبداعاً عجيباً يذكّر بتعظيم مُودِع تلك الصنائع بحكمته وذلك تضمن الاستدلال بخلق الأزواج على طريقة الإِدماج . و { سبحان } هنا لإِنشاء تنزيه الله تعالى عن أحوال المشركين تنزيهاً عن كل ما لا يليق بإلهيته وأعظمه الإِشراك به وهو المقصود هنا . وإجراء الموصول على الذات العلية للإِيماء إلى وجه إنشاء التنزيه والتعظيم . وقد مضى الكلام على { سُبْحَانَ في سورة البقرة وغيرها .والأزواج } : جمع زوج وهو يطلق على كل من الذكر والأنثى من الحيوان ، ويطلق الزوج على معنى الصنف المتميز بخواصه من نوع الموجودات تشبيهاً له بصنف الذكر وصنف الأنثى كما في قوله تعالى : { فأخرجنا به أزواجاً من نبات شتى } وتقدم في سورة طه } ( 53 ) ، والإِطلاق الأول هو الكثير كما يؤخذ من كلام الراغب ، وهو الذي يناسبه نقل اللفظ من الزوج الذي يكون ثانِياً لآخرَ ، فيجوز أن يحمل { للأزْواجَ } في هذه الآية على المعنى الأول فيكون تذكيراً بخلق أصناف الحيوان الذي منه الذكر والأنثى ، وتكون { مِن } في المواضع الثلاثة ابتدائية متعلقة بفعل { خَلَقَ .وهذا إدماج لذكر آية أخرى من آيات الانفراد بالخَلق ، فخلْق الحيوان بما فيه من القوى لتناسله وحماية نوعه وإنتاج منافعه ، هو أدق الخلق صنعاً وأعمقه حكمة ، وأدخله في المنة على الإِنسان ، بأن جعلت منافع الحيوان له كما في آية سورة المؤمنين . فمن أجل ذلك خصّ من بين الخلق الآخر بقَرْنه بالتسبيح لخالقه تنويهاً بشأنه وتفنناً في سرد أعظم المواليد الناشئة عن إيداع قوة الحياة للأرض وانبثاق أنواع الأحياء وأصنافها منها ، كما أشار إليه الابتداء بذكر مِمَّا تُنبِتُ الأرْضُ } قبلَ غيره من مبادىء التخلق لأنه الأسبق في تكوين مواد حياة الحيوان فإنه يتولد من النطف الذكور والإِناث ، وتتولد النطف من قوى الأغذية الحاصلة من تناول النبات فذلك من معنى قوله : { مما تنبت الأرض ومن أنفسهم } أي ومما يتكون فيهم من أجزائهم الحيوانية .وجيء بضمير جماعة العقلاء تغليباً لنوع الإِنسان نظراً لكونه المقصود بالعبرة بهذه الآية ، وللتخلص إلى تخصيصه بالعبرة في قوله : { ومِمَّا لاَ يَعْلمُونَ } .وإشارة قوله تعالى : { ومِمَّا لاَ يَعْلمونَ } إلى أسرار مودعة في خلق أنواع الحيوان وأصنافه هي التي ميزت أنواعه عن بعض وميزت أصنافه وذكورَه عن إناثه ، وأودعت فيه الروح الذي امتاز به عن النبات بتدبير شؤونه على حسب استعداد كل نوع وكل صنف حتى يبلغ في الارتقاء إلى أشرف الأنواع وهو نوع الإِنسان ، فمعنى { ومِمَّا لاَ يَعْلمُونَ } : مما لا يعلمونه تفصيلاً وإن كانوا قد يشعرون به إجمالاً ، فإن المتأمل يعلم أن في المخلوقات أسراراً خفية لم تصل أفهامهم إلى إدراك كنهها ، ومن ذلك الروح فقد قال تعالى :{ قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلاً } \\[ الإسراء : 85 \\] .وقد يتفاضل الناس في إدراك بعض تلك الخصائص إجمالاً وتفصيلاً ثم يستوون في عدم العلم ببعضها ، وقد يمتاز بعض الطوائف أو الأجيال بمعرفة شيء من دقائق الخلق بسبب اكتشاف أو تجربة أو تقضي آثار لم يكن يعرفها غير أولئك ثم يستوون فيما بقي تحت طيّ الخفاء من دقائق التكوين ، فبهذا الشعور الإجمالي بها وقع عدّها في ضمن الاعتبار بآية خلق الأزواج من جميع النواحي .وإذا حمل { الأزواج } في قوله : { سبحان الذي خَلَقَ الأزْواجَ كُلَّهَا } على المعنى الثاني لهذا اللفظ وهو إطلاقه على الأصناف والأنواع المتمايزة كما في قوله : { فأخرجنا به أزواجاً من نبات شتى } \\[ طه : 53 \\] كانت { من في المواضع الثلاثة بيانية ، والمجرور بها في فحوى عطف البيان ، أو بدل مفصل من مجمل من قوله : الأزواج } والمعنى : الأزواج كلها التي هي : ما تنبت الأرض ، وأنفسهم ، وما لا يعلمون . ويدل قوله { ومِمَّا لاَ يَعْلمُونَ } على محذوف تقديره : وما يعلمون ، وذلك من دلالة الإِشارة .فخص بالذكر أصناف النبات لأن بها قوام معاش الناس ومعاش أنعامهم ودوابهم ، وأصناف أنفس الناس لأن العبرة بها أقوى ، قال تعالى : { وفي أنفسكم أفلا تبصرون } \\[ الذاريات : 21 \\] . ثم ذكر ما يعمّ المخلوقات مما يعلمه الناس وما لا يعلمونه في مختلف الأقطار والأجيال والعصور . وقدم ذكر النبات إيثاراً له بالأهمية في هذا المقام لأنه أشبه بالبعث الذي أومأ إليه قوله : { وإن كُلٌّ لما جَميعٌ لدينا مُحْضَرُونَ } \\[ يس : 32 \\] .وتكرير حرف { مِن } بعد واو العطف للتوكيد على كلا التفسيرين .وضمير { أنفسهم } عائد إلى { العِبَادِ } في قوله : { يا حَسْرَةً على العِباد } \\[ يس : 30 \\] . والمراد بهم : المكذبون للرسول صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "(Glory be to Him) Allah exonerates Himself (Who created all the sexual pairs) of all kinds, (of that which the earth groweth) the sweet, the sour and other things, (and of themselves) the male and female, (and of that which they know not) of other different kinds in the land and sea!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سُبْحَانَ } القادر المقتدر القيوم المطلق المنزه عن الشيبه والنظير\n المبترئ عن الشريك والوزير\n والمستقل في التصرف والتدبير { ٱلَّذِي خَلَق ٱلأَزْوَاجَ } وقدر الأصناف المتوالدة المتزايدة { كُلَّهَا مِمَّا تُنبِتُ ٱلأَرْضُ } من الشجر والنبات بأجناسهما وأنواعهما وأصنافهما { وَمِنْ أَنفُسِهِمْ } ذكورهم وإناثهم أنواعاً وأصنافاً وأشخاصاً\n وكذا من جميع ما يعلمون من أجناس الحيوانات وأصنافها وأنواعها { وَمِمَّا لاَ يَعْلَمُونَ } [يس: 36] من المخلوقات التي لا اطلاع لهم عليها\n إذ ما من مخلوق إلا وقد خلق شفعاً\n لأن الفردية والوترية والصمدية كوجود الوجود\n والقيومية المطلقة من أخص أوصاف الربوبية والألوهية\n لا شركة فيها للمصنوع أصلاً\n إذ لا يتوهم التعدد والكثرة في الوجود الذي هو الواجب قطعاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن أنفسِهم } الأولاد ذكوراً وإناثاً\n { ومما لا يعلمون } من أصنافٍ لم يُطلعهم الله عليها\n ولم يتوصَّلوا إلى معرفتها\n ففي البحار عجائب لا يعلمها الناس\n قال تعالى:\n[النحل: 8]\n وفائدة التنزيه: نفي تشبيه الذات بشيء من هذه الأزواج\n والله تعالى أعلم\n قال القشيري: والعَجَبُ مِمَّن يُنكر أصول الدين\n ويقول: ليس في الكتاب عليه دليل\n وأكثر ما في القرآن من الآيات تدل على سبيل الاستدلال\n ولكن يَهْدِي لنوره مَن يشاء\n ولو أنهم أنصفوا واشتغلوا بأهم شيءٍ لهم ما ضيَّعوا أصول الدين\n ورضوا فيها بالتقليد\n وادَّعَوْا في الفروع رتبة الإمامة والتصدير\n وفي معناها قيل:\nقلت: وحاصله: مدح علم الأصول وترك علم أصل الأصل\n وهو علم التوحيد الخاص\n أعني الشهود والعيان\n وقد قلتُ في ذلك: تذليلاً:\nالإشارة: وآية لهم النفس الميتة بالجهل أحييناها بالعلم\n وأخرجنا منها علماً لَدُنيًّا\n فمنه تتقوّت القلوب والأرواح\n وجعلنا فيها جناتِ المعارف\n من نخيل الحقائق\n وأعناب الشرائع\n وفجَّرنا فيها من عيون الحِكَم\n ليأكلوا من ثمره\n ومما عملته أيديهم\n من المجاهدات والمكابدات\n فإنها تُثمر المشاهدات\n سبحان الذي خلق الأزواج كلها من الأحوال\n والمقامات\n والعلوم\n والمعارف\n مما يُستخرج من النفوس والأرواح\n ومما لا يعلمه إلا الله\n ثم ذكر برهاناً آخر\n فقال: { وَآيَةٌ لَّهُمُ ٱلَّيلُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:17",
      "similarity": 0.6970117594893046
    },
    {
      "verse": "80:27",
      "similarity": 0.6079338986799592
    },
    {
      "verse": "78:15",
      "similarity": 0.585344512567901
    },
    {
      "verse": "26:7",
      "similarity": 0.5504573643103264
    },
    {
      "verse": "51:49",
      "similarity": 0.3577754666529153
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}