{
  "chapter": "يس",
  "text": "والقمر قدرنه منازل حتى عاد كالعرجون القديم",
  "translations": [
    {
      "translation": "We have determined the stations of the moon, so that (after its wanderings) it returns as a dried up inflorescent spike of dates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed stages for the moon till it returns in the shape of a dry old branch of palm-tree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "how We ordained the moon to pass through certain phases until it seems eventually to be like a bent twig;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have appointed positions for the moon till it returns like an old branch of the date palm.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon, We have decreed for it stages, till it returns like the old dried curved date stalk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) the moon, We have ordained for it stages till it becomes again as an old dry palm branch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon -- We have determined it by stations, till it returns like an aged palm-bough.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the moon We have appointed mansions till she return like an old shrivelled palm-leaf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have ordained phases for the moon until finally it becomes like an old date-stalk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon! For it We have decreed mansions till it reverteth like the old branch of a palm-tree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the moon, We have ordained its phases, until it becomes like an old palm leaf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Moon,- We have measured for her mansions (to traverse) till she returns like the old (and withered) lower part of a date-stalk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon, We have measured for it mansions (to traverse) till it returns like the old dried curved date stalk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon, We have determined it in phases till it returns like an old palmbranch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon: We have disposed it in phases, until it returns like the old twig.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the moon - We have determined for it phases, until it returns [appearing] like the old date stalk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:39] And the moon — (read wa’l-qamaru, in the nominative, or wa’l-qamara, in the accusative; and it may be in   the accusative because of a following verb that governs it) We have determined it, with respect to its course, [to run] in phases — twenty eight phases in twenty eight nights of every month; it becomes concealed for two nights when the month has thirty days, and for one night when it has twenty nine days — until it returns, during its final phase seeming to the [human] eye, like an aged palm-bough, in other words, like the stalk with a date cluster when it ages, becoming delicate, arched and yellowish.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And for the moon We have appointed mansions) like the mansions of the sun: it increases and decreases (till she return like an old shrivelled palm leaf.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ عَادَ كَٱلعُرجُونِ ٱلْقَدِيمِ } فعادَ معناه صَارَ والعُرجونُ: الذَّكرُ من النَّخلِ! ويقالُ عِذقُ النَّخلةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلْقَمَرَ قَدَّرْنَاهُ } أي: عينَّا حسب قدرتنا الغالبة وحكمتنا البالغة لمرآة القمر الخالية عن النور الذاتي، القابلة لأن يكتسبه من قرص الشمس حسب المقابلة والمحاذاة بينهما، كذلك جعلنا له { مَنَازِلَ } متفاوتة في الوضع، فعند تمام المقابلة والمحاذاة يبدو بدراً كاملاً بلا نقصان في قرصه أصلاً، ثم ينقص شيئاً فشيئاً، يوماً فيوماً { حَتَّىٰ عَادَ } القمر في أخر المنازل الثمانية والعشرين التي وضت له في علم التنجيم والتقويم لاستفادته النور من الشمس { كَٱلعُرجُونِ ٱلْقَدِيمِ } [يس: 39] أي: كعذق النخل العتيق الذي عليه الشماريخ المعوجة المصفرة من طول المدى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والقمرَ قدَّرناه } من نصبه فبِفِعْل مضمر، ومن رفعه فمبتدأ، والخبر: { قدَّرناه منازلَ } وهي ثمانية وعشرون منزلاً: فرع الدلو المقدم، فرع الدلو المؤخر، بطن الحوت، النطْح، البُطَيْن، الثُّريَّا، الدَّبَران، الهَقْعَة، الهَنْعَة، الذِّراع، النَّثْرة، الصَّرْفَة، الجَبْهَة، الطَّرْفة، الزَّبرة، العَوَّاء، السِّمَاك، الغَفْر، الزَّبَاني، الإِكْليل، القَلْب، الشَّوْلة، النعَائِم، البَلَدة، سَعْدُ الذَّابح، سعد السُّعُود، سَعْد الأخبية، ينزل القمر كل ليلة في واحد منها لا يتخطاها، ولا يتقاصر عنها\n\n\nعلى تقدير مستوٍ، يسيرُ فيها من ليلة المستهلّ إلى الثامنة والعشرين، ثم يستتر ليلتين، أو ليلة إذا نقص الشهر\n ولا بد في { قدّرناه منازلَ } من تقدير مضاف أي: قدّرنا سيره، أو نوره، فيزيد وينقص، إذ لا معنى لتقدير القمر منازل، فيكون \" منازل \" ظرفاً\n فإذا كان في آخر منازله، دقّ وتقوّس، { حتى عادَ كَالعُرْجُون } أي: كالشّمراخ، وهو عنقود التمر إذا يبس واعوج\n ووزنه فعلون، من الانعطاف، وهو الانعراج، { القديم } العتيق المُحْوِل، وإذا قُدم دقّ، وانحنى، واصفرّ، فشبه القمر به من ثلاثة أوجه",
      "translations": []
    }
  ]
}