{
  "chapter": "يس",
  "text": "الم يروا۟ كم اهلكنا قبلهم من القرون انهم اليهم لا يرجعون",
  "translations": [
    {
      "translation": "Do they not see how many generations before them We have destroyed and that they will not return to them?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations have We destroyed before them who will not return again?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many nations before them did We destroy? Thereafter they never came back to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations, living before them, had We destroyed and they cannot ever come back to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations We destroyed before them, which will not return to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how many of the generations We have destroyed before them Verily, they will not return to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider how many of the generations have We destroyed before them, because they do not turn to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not seen how many generations We have destroyed before them, and that it is not unto them that they return?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations We destroyed before them, which indeed returned not unto them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how many generations We have destroyed before them? Never shall they return to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold they not how many We have destroyed before them of the generations! verily Unto them they shall not return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded how many generations We have destroyed before them who will not come back to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how many generations before them we destroyed? Not to them will they return:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how many of the generations We have destroyed before them? Verily, they will not return to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations We destroyed before them? They shall never return to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered how many generations We destroyed before them; and that unto them they will not return?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered how many generations We destroyed before them - that they to them will not return?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:31]   Have they — that is, those inhabitants of Mecca who said to the Prophet, ‘You have not been sent [by God]!’ [Q. 13:43] — not seen, [not] come to know (the interrogative is meant [rhetorically] as an affirmative) how many (kam here is predicative [as opposed to interrogative], in other words [it is to be understood as] kathīran, ‘many’; it is operated by the statement that comes next [below] and it comments on the operative clause for the statement that preceded it); the meaning then is as follows: indeed, many, generations, communities, We have destroyed before them, [how] that they, the ones destroyed, never return?, to those deniers [who are now alive]? So will they not learn from their example? (from annahum, ‘[how] that they’, to the end [of the verse] is a substitution for the preceding clause [kam ahlaknā qablahum mina’l-qurūni], bearing in mind the aforementioned general meaning).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَلَمْ يَرَوْا كَمْ أَهْلَكْنَا قَبْلَهُمْ مِنَ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ (31)هذه الجملة بيان لجملة { ما يأتيهم من رسول إلا كانوا به يستهزئؤن } \\[ يس : 30 \\] لما فيها من تفصيل الإِجمال المستفاد من قوله : { ما يأتيهم من رسول إلا كانوا به يستهزئون فإن عاقبة ذلك الاستهزاء بالرسول كانت هلاك المستهزئين ، فعدمُ اعتبار كل أمة كذبت رسولها بعاقبة المكذبين قبلها يثير الحسرة عليها وعلى نظرائها كما أثارها استهزاؤهم بالرسول وقلة التبصر في دعوته ونذارته ودلائل صدقه .وضمير يَرَوا } عائد إلى العباد كما يقتضيه تناسق الضمائر . والمعاد فيه عموم ادعائي كما تقدم آنفاً ، فيتعين أن تخص منه أول أمة كذبت رسولها وهم قوم نوح فإنهم لم يسبق قبلهم هلاك أمة كذبت رسولَها ، فهذا من التخصيص بدليل العقل لأن قوله : { قَبْلَهُم } يرشد بالتأمل إلى عدم شموله أول أمة أرسل إليها .وقيل : يجوز أن يكون ضمير { أَلم يَروا } عائداً إلى ما عاد إليه ضمير { واضْرِب لهُمْ مَثَلاً } \\[ يس : 13 \\] ويكون المثَل قد انتهى بجملة { ياحَسْرَةً على العِبَادِ } \\[ يس : 30 \\] الآية . وهذا بعيد لأنه كان يقتضي أن تعطف الجملة على جملة { واضْرِب لهم مَثَلاً } كما عطفت جملة { وءَايَةٌ لهم الأرض الميتة أحييناها } \\[ يس : 33 \\] الآية ، وجملة { وءاية لهم اللَّيْل نسلَخُ منه النهار } \\[ يس : 37 \\] ، وجملة { وءايةٌ لهم أنَّا حملنا ذريتهم في الفلك المشحون } \\[ يس : 41 \\] ، ولا مُلجىء إلى هذا الاعتبار في المعاد ، وقد علمت توجيه الاعتبار الأول لتصحيح العموم .والاستفهام يجوز أن يكون إنكارياً؛ نزلت غفلتهم عن إهلاك القرون منزلة عدم العلم فأنكر عليهم عدم العلم بذلك وهو أمر معلوم مشهور ، ويجوز كون الاستفهام تقريرياً بُني التقرير على نفي العلم بإهلاك القرآن استقصاء لمعذرتهم حتى لا يسعهم إلا الإِقرار بأنهم عالمون فيكون إقرارهم أشد لزوماً لهم لأنهم استفهموا على النفي فكان يسعهم أن ينفوا ذلك .والرؤية على التقديرين علمية وليست بصرية لأن إهلاك القرون لم يكن مشهوداً لأمة جاءت بعد الأمة التي أهلكت قبلها . وفعل الرؤية معلق عن العمل بورود { كم } لأن { كم } لها صدر الكلام سواء كانت استفهاماً أم خبراً ، فإن { كم } الخبرية منقولة من الاستفهامية وما له صدر الكلام لا يعمل ما قبله فيما بعده .و { كم } في موضع نصب ب { أَهْلَكْنَا : } ومفادها كثرة مبهمة فسّرت بقوله : { مِنَ القُرُونِ } ووقعت { كم } في موضع المفعول لقوله : { أَهْلَكنا } .و { قَبْلَهُم } ظرف ل { أهْلَكْنَا } ومعنى { قَبْلَهُم : } قبل وجودهم .وقوله : { أنَّهُم إليهم لا يَرْجِعون } بدل اشتمال من جملة { أهلكنا } لأن الإِهلاك يشتمل على عدم الرجوع؛ أبدل المصدر المنسبك من «أنَّ» وما بعدها من معنى جملة { كم أهلكنا قبلهم من القرون } لأن معنى تلك الجملة كثرة الإِهلاك أو كثرة المهلكين . وفعل الرؤية عامل في { أنَّهم إليهِم لا يَرْجِعُونَ } بالتبعية لتسلط معنى الفعل على جملة { كَمْ أهْلَكْنَا } لأن التعليق يبطل العمل في اللفظ لا في المحل .وفائدة هذا البدل تقرير تصوير الإِهلاك لزيادة التخويف ، ولاستحضار تلك الصورة في الإِهلاك أي إهلاكاً لا طماعية معه لرجوع إلى الدنيا ، فإن ما يشتمل عليه الإِهلاك من عدم الرجوع إلى الأهل والأحباب مما يزيد الحسرة اتضاحاً .و { إلَيْهِم } متعلق ب { يَرجِعون } وتقديمه على متعلقه للرعاية على الفاصلة .وضمير { إليهم } عائد إلى { العِبَادِ } \\[ يس : 30 \\] ، وضمير { أنَّهُمْ } عائد إلى { القُرُونِ .\n\n",
      "translations": [
        {
          "translation": "(Have they not seen) have the disbelievers of Mecca not been informed (how many generations) past nations (We destroyed before them, which indeed return not unto them) that is until the Day of Judgement;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يستهزئون معك - يعني: أهل مكة - وينكرون بدينك وكتابك { لَمْ يَرَوْاْ } ولم يخبروا ولم يعلموا { كَمْ أَهْلَكْنَا } أي: كثرة إهلاكنا واستئصالنا { قَبْلَهُمْ مِّنَ ٱلْقُرُونِ } الماضية\n ولم يعتبروا مما جرى عليهم بشؤم تكذيبهم وإنكارهم على رسله مع { أَنَّهُمْ } أي: الأمم الهالكة السالفة { إِلَيْهِمْ لاَ يَرْجِعُونَ } [يس: 31] أي: لا يرجعون إلى هؤلاء المفسدين\n المسرفين في تكذيبك وإكارك يا أكمل الرسل في نشأتهم هذه\n بل مضوا وانقرضوا إلى حيث لم يعودوا إلى ما كانوا\n وهؤلاء أيضاً سينقرضون إثرهم\n ولِمَ لم يتنبهوا ولم يعتبروا مما جرى عليهم مع أنهم إن أُخذوا صاروا كأن لم يكونوا شيئاً مذكوراً أمثالهمه؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كم أهلكنا } معلّقة ليَرَوُا عن المفعولين\n و { أنهم }: بدل من { كم } \n والتقدير: ألم يَرَوا كثرة إهلاكنا قبلهم من القرون كونهم غير راجعين إليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:26",
      "similarity": 0.6822322622187315
    },
    {
      "verse": "20:128",
      "similarity": 0.6386180498994464
    },
    {
      "verse": "17:17",
      "similarity": 0.5657152447145203
    },
    {
      "verse": "43:6",
      "similarity": 0.5205507370182483
    },
    {
      "verse": "44:25",
      "similarity": 0.44646803144716896
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}