{
  "chapter": "يس",
  "text": "والشمس تجرى لمستقر لها ذلك تقدير العزيز العليم",
  "translations": [
    {
      "translation": "And the sun runs to its resting place. That is the decree of the Almighty, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While the sun keeps revolving in its orbit. This is the dispensation of the mighty, all-knowing (God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun is running its course to its appointed place. That is the ordaining of the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "how the sun moves in its orbit and this is the decree of the Majestic and All-knowing God;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs its course for its final destination; this is a command of the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs on its fixed course for a term (appointed). That is the decree of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs on to a term appointed for it; that is the ordinance of the Mighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun -- it runs to a fixed resting-place; that is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runneth on unto a resting-place for him. That is the measuring of the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun, too, follows its determined course laid down for it by the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runneth to its appointed term: that is the disposition of the Mighty, the Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun runs on to its place of rest: That is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs his course for a period determined for him: that is the decree of (Him), the Exalted in Might, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs on its fixed course for a term (appointed). That is the Decree of the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun runs to its fixed restingplace; that is the decree of the Almighty, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs towards its destination. Such is the design of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the sun runs [on course] toward its stopping point. That is the determination of the Exalted in Might, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:38] And the sun [which] runs (from wa’l-shamsu tajrī to the end [of the statement] is subsumed by [the introductory] wa-āyatun lahum, ‘and a sign for them’; alternatively, it constitutes another sign [for them]; similar is the case with wa’l-qamara, ‘and the moon’ [further below]) to its resting-place, in other words, it does not overstep it. That, namely, its running, is the ordaining of the Mighty, in His kingdom, the Knower, of His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the sun runneth on unto a resting place for him) to the sun's mansion; it is also said that this means: it runs in the day and at night without any resting place. (That is the measuring of the Mighty) that is the providence of the Mighty in retribution against those who disbelieve in Him, (the Wise) He knows His creation and their providence.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَّهَـا } فمستقرُّها تَحتَ العَرشِ\n\n",
      "translations": [
        {
          "translation": " And {the sun} runs to an appointed time. Under the Throne it rests.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n الغالب على الكل بالقهر والفناء { العليم } الذي يعلم حدّ كمال كل سيّار وانتهاء سيره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من جملة آياتنا العظام: { ٱلشَّمْسُ } المضيئة\n المشرقة على صفائح الكائنات كإشراق نور الوجود المطلق\n الفائض على هياكل الموجودات حسب التجليات الإلهية { تَجْرِي } وتسري بلا قرار وثبات بمقتضى أمرنا وحكمنا { لِمُسْتَقَرٍّ لَّهَـا } بقدرناه إياها منتهى ومنزلاً بمقتضى حكمتنا المتقنة المرتبتة على تجلياتنا الحِبِّية\n المنتشئة من ذاتنا المتصفة بالأوصاف اللطيفة الجمالية { ذَلِكَ } الجري والسراية على هذا النظام الأبلغ الأبدع { تَقْدِيرُ ٱلْعَزِيزِ } القادر الغالب المتقدر على عموم المقادير { ٱلْعَلِيمِ } [يس: 39] باستعداداتها وقابلياتها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:12",
      "similarity": 0.4207055904975697
    },
    {
      "verse": "25:66",
      "similarity": 0.41917823726816844
    },
    {
      "verse": "25:76",
      "similarity": 0.3868290826315075
    },
    {
      "verse": "6:67",
      "similarity": 0.37109767102804825
    },
    {
      "verse": "75:9",
      "similarity": 0.3682464134395317
    }
  ]
}