{
  "chapter": "يس",
  "text": "لياكلوا۟ من ثمره وما عملته ايديهم افلا يشكرون",
  "translations": [
    {
      "translation": "so they may eat its fruits - they did not do it themselves. So will they not be thankful?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they may eat of its fruit; yet it was not done by their hands. Then why do they not acknowledge thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they might eat of its fruits. It was not their hands that made them. Will they not, then, give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they may consume the fruits and whatever their hands prepare. Will they not then be grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they may eat from its fruits, whereas they are not manufactured by their hands! So will they not be grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they may eat of the fruit thereof -- and their hands made it not. Will they not then give thanks\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may eat of the fruit thereof, and their hands did not make it; will they not then be grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they might eat of its fruits and their hands' labour. What, will they not be thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they may eat its fruit, though it was not their hands that made this. Will they not then be grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may eat of the fruit thereof; and their hands worked it not. Will they not, therefore, give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they may eat of its fruit and what their hands have cultivated. Will they not then give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may enjoy the fruits of this (artistry): It was not their hands that made this: will they not then give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they might eat of its fruit and the labor of their hands. Will they not give thanks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may eat from its fruits, although their hands did not make it. Will they not be appreciative?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may eat of His fruit. And their hands have not produced it, so will they not be grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:35] that they might eat of its fruits (read thamarihi or thumurihi) in other words, [of] the fruits of the mentioned date-palms and otherwise; but it was not their hands that made it, namely, they did not cultivate the fruits. Will they not then give thanks?, for His favours to them, exalted be He?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That they may eat of the fruit thereof) of the fruit of the palm-tree, (and their hand made it not) their hands did not make it grow; it is also said that this means: their hands did not plant it. (Will they not, then, 499 give thanks) to the One Who did it and hence believe in Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكل ذلك { لِيَأْكُلُواْ مِن ثَمَرِهِ } أي: من ثمر ما ذكر وقوته\n ويقوِّموا أمزجتهم بأنواع ما وهبنا عليهم من النعم حتى يقوموا ويواضبوا على شكرها\n أداء لحقوقنا إياهم { وَ } كذا علمناهم وأقدرناهم على عموم { مَا عَمِلَتْهُ أَيْدِيهِمْ } من العقارات والمزارع والبساتين وإجراء الأنهار والقنوات وحفر الآبار { أَ } ينكرون على كمال قدرتنا ووفور حولنا وقوتنا { فَلاَ يَشْكُرُونَ } [يس: 35] نعمنا الفائضة إياهم على التعاقب والتوالي ولا ينسبونها إلينا\n بل ينسبونها إلى الوسائق والأسباب العادية جهلاً وعناداً\n وطغياناً كفراً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ليأكلوا من ثَمره } أي: من ثمر الله، أي: ليأكلوا مما خلق الله تعالى من الثمر، أو: من ثَمَرة، يخلقها الله من ذلك، على قراءة الأخوين\n { وما عملته أيديهم } أي: ومما عملته أيديهم من الغرس، والسقي، والتلقيح، وغير ذلك، مما تتوقف عليه في عالم الحكمة، إلى أن يبلغ الثمر منتهاه\n يعني: أن الثمر في نفسه فعل الله، وفيه آثارٌ من عمل ابن آدم، حكمةً، وتغطيةً لأسرار الربوبية\n وأصله: من ثمرنا، كما قال: { وجعلنا }  { وفجرنا } ، فالتفت إلى الغيبة\n ويجوز أن يرجع الضميرُ إلى النخيل، ويترك الأعناب غير مرجوع إليها لأنه عُلم أنها في حكم النخيل\n وقيل: \" ما \" نافية، على أن الثمرة خلق الله، ولم تعمله أيدي الناس، ولا يقدرون عليه\n { أفلا يشكرون } الله على هذه النعم الجسيمة، وهو حثّ على الشُكر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:32",
      "similarity": 0.3065136502330963
    },
    {
      "verse": "2:152",
      "similarity": 0.298660924237584
    },
    {
      "verse": "18:34",
      "similarity": 0.2932886462706393
    },
    {
      "verse": "7:130",
      "similarity": 0.2848884053713152
    },
    {
      "verse": "39:66",
      "similarity": 0.2674500645266919
    }
  ]
}