{
  "chapter": "يس",
  "text": "واذا قيل لهم اتقوا۟ ما بين ايديكم وما خلفكم لعلكم ترحمون",
  "translations": [
    {
      "translation": "They are told, 'Have taqwa of what is before you and behind you so that hopefully you will have mercy shown to you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Beware of what is before you and what is past, that you may be treated with kindness;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to such people: “Guard yourselves against what is ahead of you and what has preceded you that mercy be shown to you” (they pay scant heed to it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they are told to guard themselves against sin and the forth coming torment so that perhaps they could receive mercy\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Beware of what is before you and what is behind you, in the hope of your gaining mercy”, they turn away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Beware of that which is before you, and that which is behind you, in order that you may receive mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Guard against what is before you and what is behind you, that mercy may be had on you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, 'Fear what is before you and what is behind you; haply you will find mercy' --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said unto them: Beware of that which is before you and that which is behind you, that haply ye may find mercy (they are heedless).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"guard yourselves against what is before you and what is behind you, in order that you may be shown mercy,\" [they turn away].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said Unto them: fear that which is before you and that which is behind you, that haply ye may find mercy, they withdraw.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, ‘Beware of that which is before you and that which is behind you, so that you may receive [His] mercy…’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Fear ye that which is before you and that which will be after you, in order that ye may receive Mercy,\" (they turn back).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Beware of that which is before you (worldly torments), and that which is behind you (torments in the Hereafter), in order that you may receive Mercy (i.e. if you believe in Allah's Religion Islamic Monotheism, and avoid polytheism, and obey Allah with righteous deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Have fear of that which is before you and behind you in order that you find mercy'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when it is said to them, “Beware of what lies before you, and what lies behind you, that you may receive mercy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when it is said to them, \"Beware of what is before you and what is behind you; perhaps you will receive mercy... \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:45] And when it is said to them, ‘Beware of that which is before you, of the chastisement of this world, as [it is said] to others, and that which is behind you, of the chastisement of the Hereafter, that perhaps you might find mercy’, they turn away [in aversion].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When it is said unto them) when the Prophet (pbuh) said to the people of Mecca: (Beware of that which is before you) of the matter of the Hereafter; you should believe in and strive for it (and that which is behind 500 you) of the matter of this worldly life, such that you do not become deluded by it and by its splendour, (that haply ye may find mercy) in the Hereafter and do not get tormented.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم - أي: أسلافهم - مثل هؤلاء الضالين { إِذَا قِيلَ لَهُمُ } إصلاحاً لأحوالهم { ٱتَّقُواْ مَا بَيْنَ أَيْدِيكُمْ } مما جرى على أسلافكم من الوقائع الهائلة والنوائب الشديدة السالفة، والواصلة إليهم بشئوم مفاسدهم وطغيانهم على الله وعلى أنبيائه ورسله بالخروج عن إطاعتهما وانقيادهما { وَ } احذروا عن { مَا خَلْفَكُمْ } من العذاب الموعود لعصاة العباد، المتمردين على ربقة العبودية وصراط التوحيد، الضالين عن جادة السلامة بترك مقتضيات الحدود الإلهية { لَعَلَّكُمْ تُرْحَمُونَ } [يس: 45] من عند الله بتقواكم عن محارمه ومحظوراته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جواب \" إذا \" محذوف، أي: أعرضوا، فدلّ عليه قوله: \" معرضين \"\n يقول الحق جلّ جلاله: { وإِذا قيل لهم } أي: كفار قريش: { اتقوا ما بين أيديكُم وما خلفَكُم } أي: ما تقدّم من ذنوبكم، وما تأخّر مما أنتم تعملونه بعدُ، أو: ما بين أيديكم: ما سلف من مثل الوقائع التي حلَّت بالأمم المكذبة قبلكم، وما خلفكم من أمر الساعة، أو: ما بين أيديكم من فتنة الدينا، وما خلفكم من عذاب الآخرة\n { لعلكم تُرحمون } لتكونوا في رجاء رحمة الله، فإذا قيل لهم ذلك أعرضوا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:76",
      "similarity": 0.5300259525440562
    },
    {
      "verse": "49:10",
      "similarity": 0.4615571921259272
    },
    {
      "verse": "41:14",
      "similarity": 0.43037801341403176
    },
    {
      "verse": "19:64",
      "similarity": 0.41594887077985526
    },
    {
      "verse": "20:110",
      "similarity": 0.4138700413225563
    }
  ]
}