{
  "chapter": "يس",
  "text": "ما ينظرون الا صيحة وحدة تاخذهم وهم يخصمون",
  "translations": [
    {
      "translation": "What are they waiting for but one Great Blast to seize them while they are quibbling?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are only waiting for a single blast that will seize them, but they will go on contending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Truth is that they are waiting for nothing but a mighty Blast to seize them the while they are disputing (in their worldly affairs),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not have to wait long. When the Day of Judgment comes, it will only take a single blast of sound to strike them while they are quarrelling with one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await just one scream, which will overcome them while they are involved in worldly disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await only but a single Sayhah which will seize them while they are disputing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wait not for aught but a single cry which will overtake them while they yet contend with one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are awaiting only for one Cry to seize them while they are yet disputing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await but one Shout, which will surprise them while they are disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They must be waiting for but one single blast, which will overtake them while they are still disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await not but one shout, which shall lay hold of them while they are yet wrangling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not await but a single Cry that will seize them as they wrangle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not (have to) wait for aught but a single Blast: it will seize them while they are yet disputing among themselves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await only but a single Saihah (shout, etc.), which will seize them while they are disputing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await but one Shout, which will seize them while they dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All they can expect is a single blast, which will seize them while they feud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not await except one blast which will seize them while they are disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:49] God, exalted be He, says: They await but a single Cry, namely [the cry of] Isrāfīl’s First Blast, that will seize them while they are disputing (read yakhassimūna, which is actually yakhtasimūna, where the vowel of the tā’ has been moved to the khā’ and it [the tā’] has been assimilated with the sād, in other words: while they are oblivious to it, busily engaged in disputes, concluding bargains, eating and drinking and so on; a variant reading has yakhsimūna similar [in pattern] to yadribūna, in which case the meaning is: while they dispute with one another).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا يَنْظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ (49) وفعل { يَنظُرُونَ } مشتق من النَّظِرة وهو الترقب ، وتقدم في قوله تعالى : { هل ينظرون إلا أن تأتيهم الملائكة في سورة } \\[ الأنعام : 158 \\] .والصيحة : الصوت الشديد الخارج من حلق الإِنسان لزجر ، أو استغاثة . وأطلقت الصيحة في مواضع في القرآن على صوت الصاعقة كما في قوله تعالى في شأن ثمود : { فأخذتهم الصيحة } \\[ الحجر : 73 \\] . فالصيحة هنا تحتمل المجاز ، أي ما ينتظرون إلا صعقة أو نفخة عظيمة . والمراد النفخة الأولى التي ينقضي بها نظام الحياة في هذا العالم ، والأخرى تنشأ عنها النشأة الثانية وهي الحياة الأبدية ، فيكون أسلوب الكلام خارجاً على الأسلوب الحكيم إعراضاً عن جوابهم لأنهم لم يقصدوا حَقيقة الاستفهام فأجيبوا بأن ما أعد لهم من العذاب هو الأجدر بأن ينتظروه .ومعنى { تأخُذُهُم } تُهلكهم فجأة ، شبه حلول صيحة العقاب بحلول المُغِيرين على الحيّ لأخذ أنعامه وسَبْي نِسائه ، فأطلق على ذلك الحلوللِ فعل { تأخُذُهُم } كقوله تعالى : { فعصوا رسول ربهم فأخذهم أخذة رابية } \\[ الحاقة : 10 \\] أي تحلّ بهم وهم يختصمون . وإسناد الأخذ إلى الصيحة حقيقة عقلية لأنهم يهلكون بصعقتها .ويحتمل أن تكون الصيحة على حقيقتها وهي صيحة صائحين ، أي ما ينتظرون إلا أن يصاح بهم صيحة تنذر بحلول القتل ، فيكون إنذاراً بعذاب الدنيا . ولعلها صيحة الصارخ الذي جاءهم بخبر تعَرّض المسلمين لركب تجارة قريش في بدر .و { يَخصّمُونَ } من الخصومة والخصام وهو الجدال ، وتقدم في قوله : { ولا تكن للخائنين خصيماً } في سورة النساء } ( 105 ) ، وقوله : { هذان خصمان } في سورة الحج } ( 19 ) . وأصله : يختصمون فوقع إبدالُ التاء ضاداً لقرب مخرجيهما طلباً للتخفيف بالإِدغام .واختلَف القراء في كيفية النطق بها ، فقرأه الجميع بفتح الياء واختلفوا فيما عدا ذلك : فقرأ ورش عن نافع وابنُ كثير وأبو عمرو في رواية عنه { يَخصّمُونَ } بتشديد الصاد مكسورة على اعتبار التاء المبدلة صاداً والمسَكَّنةُ لأجل الإِدغام ، ألقيت حركتُها على الخاء التي كانت ساكنة . وقرأه قالون عن نافع وأبو عمرو في المشهور عنه بسكون الخاء سكوناً مختلَساً ( بالفتح ) لأجل التخلص من التقاء الساكنين وبكسر الصاد مشدّدة .وقرأه عاصم والكسائي وابنُ ذكوان عن ابن عامر ويعقوبُ وخلف { يَخصّمُونَ } بكسر الخاء وكسر الصاد مشدّدة . وقرأه حمزة { يخْصِمون } بسكون الخاء وكسر الصاد مخففة مضارع ( خَصم ) قيل بمعنى جادل . وقرأ أبو جعفر { يخْصِّمون } بإسكان الخاء وبكسر الصاد مشددة على الجمع بين الساكنين .والاختصام : اختصامهم في الخروج إلى بدر أو في تعيين من يخرج لما حلّ بهم من مفاجآت لهم وهم يختصمون بين مصدق ومكذب للنذير . وإسناد الأخذ إلى الصيحة على هذا التأويل مجاز عقلي لأن الصيحة وقت الأخذ وإنما تأخذهم سيوف المسلمين . وتقديم المسند إليه على المسند الفعلي في قوله : { وهُمْ يَخصّمُونَ } لإِفادة تقوّي الحكم وهو أن الصيحة تأخذهم .\n\n",
      "translations": [
        {
          "translation": "(They await) if they disbelieve in you, your folk await as punishment nothing (but one Shout) which is the first blow of the Trumpet, (which will surprise them while they are disputing) in the marketplace.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه في جواب هؤلاء الضالين المبطلين: { مَا يَنظُرُونَ } وينتظرون هؤلاء المنكرون المعاندون { إِلاَّ صَيْحَةً وَاحِدَةً } هائلة { تَأْخُذُهُمْ } بغتة { وَهُمْ } حين وقوعها { يَخِصِّمُونَ } [يس: 49] أي: يختصمون ويتخاصمون بعضهم مع بعض في العقود والمعاملات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { ما ينظرون } ينتظرون { إِلا صيحةً واحدةً } هي: النفخة الأولى\n { تأخذُهُم وهم يَخِصِّمُون } يختصمون\n يخصم بعضهم بعضاً في المعاملات\n لا يخطر ببالهم أمرها\n فتأتيهم بغتة\n وقرأ حمزة ـ بسكون الخاء ـ من: خصمه: إذا غلبه في الخصومة\n وفتح الباقون\n مع الاختلاس والنقل وعدمهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:15",
      "similarity": 0.69286931946459
    },
    {
      "verse": "15:83",
      "similarity": 0.5982092707185176
    },
    {
      "verse": "50:42",
      "similarity": 0.5836827273442424
    },
    {
      "verse": "15:73",
      "similarity": 0.5287783626109506
    },
    {
      "verse": "26:96",
      "similarity": 0.5216092188062289
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}