{
  "chapter": "يس",
  "text": "ما ينظرون الا صيحة وحدة تاخذهم وهم يخصمون",
  "translations": [
    {
      "translation": "What are they waiting for but one Great Blast to seize them while they are quibbling?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are only waiting for a single blast that will seize them, but they will go on contending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Truth is that they are waiting for nothing but a mighty Blast to seize them the while they are disputing (in their worldly affairs),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not have to wait long. When the Day of Judgment comes, it will only take a single blast of sound to strike them while they are quarrelling with one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await just one scream, which will overcome them while they are involved in worldly disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await only but a single Sayhah which will seize them while they are disputing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wait not for aught but a single cry which will overtake them while they yet contend with one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are awaiting only for one Cry to seize them while they are yet disputing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await but one Shout, which will surprise them while they are disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They must be waiting for but one single blast, which will overtake them while they are still disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await not but one shout, which shall lay hold of them while they are yet wrangling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not await but a single Cry that will seize them as they wrangle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not (have to) wait for aught but a single Blast: it will seize them while they are yet disputing among themselves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await only but a single Saihah (shout, etc.), which will seize them while they are disputing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await but one Shout, which will seize them while they dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All they can expect is a single blast, which will seize them while they feud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not await except one blast which will seize them while they are disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:49] God, exalted be He, says: They await but a single Cry, namely [the cry of] Isrāfīl’s First Blast, that will seize them while they are disputing (read yakhassimūna, which is actually yakhtasimūna, where the vowel of the tā’ has been moved to the khā’ and it [the tā’] has been assimilated with the sād, in other words: while they are oblivious to it, busily engaged in disputes, concluding bargains, eating and drinking and so on; a variant reading has yakhsimūna similar [in pattern] to yadribūna, in which case the meaning is: while they dispute with one another).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They await) if they disbelieve in you, your folk await as punishment nothing (but one Shout) which is the first blow of the Trumpet, (which will surprise them while they are disputing) in the marketplace.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه في جواب هؤلاء الضالين المبطلين: { مَا يَنظُرُونَ } وينتظرون هؤلاء المنكرون المعاندون { إِلاَّ صَيْحَةً وَاحِدَةً } هائلة { تَأْخُذُهُمْ } بغتة { وَهُمْ } حين وقوعها { يَخِصِّمُونَ } [يس: 49] أي: يختصمون ويتخاصمون بعضهم مع بعض في العقود والمعاملات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}