{
  "chapter": "يس",
  "text": "لا الشمس ينۢبغى لها ان تدرك القمر ولا اليل سابق النهار وكل فى فلك يسبحون",
  "translations": [
    {
      "translation": "It is not for the sun to overtake the moon nor for the night to outstrip the day; each one is swimming in a sphere.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither can the sun overtake the moon, nor the night outpace the day: Each of them keeps coursing in its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither does it lie in the sun's power to overtake the moon nor can the night outstrip the day. All glide along, each in its own orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "how the sun is not supposed to catch-up with the moon, nor is the night to precede the day. All of them are to float in a certain orbit;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to catch up with the moon, nor does the night surpass the day; and each one of them floats in its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither is it allowable to the sun that it should overtake the moon, nor can the night outstrip the day; and all float on in a sphere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It behoves not the sun to overtake the moon, neither does the night outstrip the day, each swimming in a sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to overtake the moon, nor doth the night outstrip the day. They float each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun cannot overtake the moon, nor can the night outpace the day: each floats in [its own] orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not permitted to the sun that it should overtake the moon, nor can the night outstrip the day: each in an orbit, they float.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither it behooves the sun to overtake the moon, nor may the night outrun the day, and each swims in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not permitted to the Sun to catch up the Moon, nor can the Night outstrip the Day: Each (just) swims along in (its own) orbit (according to Law).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun shall not outstrip the moon, nor shall the night outstrip the day. Each is floating in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun is not to overtake the moon, nor is the night to outpace the day. Each floats in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not allowable for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:40] It does not behove — it is [neither] facilitated nor is it right for — the sun to catch up with the moon, and so appear together with it at night, nor may the night outrun the day, and thus it [the night] never arrives before the latter ends and each (kullun: the nunation compensates for the [missing] genitive annexation [that would have been constructed] with al-shams, ‘the sun’, al-qamar, ‘the moon’, and al-nujūm, ‘the stars’) [of these] is in an orbit, swimming, moving — these [celestial bodies] are being treated as [though they were] rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَا الشَّمْسُ يَنْبَغِي لَهَا أَنْ تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ (40)لما جرى ذكر الشمس والقمر في معرض الآيات الدالة على انفراده تعالى بالخلق والتدبير وعلى صفات إلهيته التي من متعلِّقاتها تعلق صفة القدرة بآية الشمس وسيرها ، والقمر وسيره ، وقد سمّاها بعض المتكلمين صفات الأفعال وكان الناس يعرفون تقارب الشمس والقمر فيما يراه الراءون ، وكانوا يقدرون سيرهما بأسمات معلَّمة بعلامات نجومية تسمى بُروجاً بالنسبة لسير الشمس ، وتسمى منازل بالنسبة لسير القمر ، وكانوا يعلمون شدة قرب المنازل القمرية من البروج الشمسية فإن كل برج تسامته منزلتان أو ثلاث منازل ، وبعض نجوم المنازل هي أجزاء من نجوم البروج ، زادهم الله عبرة وتعليماً بأن للشمس سيراً لا يلاقي سير القمر ، وللقمر سيراً لا يلاقي سير الشمس ولا يمر أحدهما بطرائق مسير الآخر وأن ما يتراءى للناس من مشاهدة الشمس والقمر في جو واحد وفي حجمين متقاربين ، وما يتراءى لهم من تقارب نجوم بروج الشمس ونجوم منازل القمر ، إن هو إلا من تخيلات الأبصار وتفاوت المقادير بين الأجرام والأبعاد .فالكرة العظيمة كالشمس تبدو مقاربة لكرة القمر في المرأى وإنما ذلك من تباعد الأبعاد فأبعاد فلك الشمس تفوت أبعاد فلك القمر بمئات الملايين من الأميال ، حتى يلوح لنا حجم الشمس مقارباً لحجم القمر . فبين الله أنه نظم سير الشمس والقمر على نظام يستحيل معه اتصال إحدى الكرتين بالأخرى لشدة الأبعاد بين مداريهما .فمعنى : { لا الشَّمْسُ يَنْبغي لها أن تُدْرِكَ القَمَر } نفي انبغاء ذلك ، أي نفي تأتِّيه ، لأن انبغى مطاوع بغى الذي هو بمعنى طلب ، فانبغى يفيد أن الشيء طُلب فحصل للذي طَلبه ، يقال : بغاه فانبغَى له ، فإثبات الانبغاء يفيد التمكن من الشيء فلا يقتضي وجوباً ، ونفي الانبغاء يفيد نفي إمكانه ولذلك يكنى به عن الشيء المحظور . يقال : لا ينبغي لك كذا ، ففرقٌ ما بين قولك : ينبغي أن لا تفعل كذا ، وبين قولك : لا ينبغي لك أن تفعل كذا ، قال تعالى : { قالوا سبحانك ما كان ينبغي أن نتخذ من دونك من أولياء } \\[ الفرقان : 18 \\] وتقدم قوله تعالى : { وما ينبغي للرحمان أن يتخذ ولداً } في سورة مريم ( 92 ) ، ومنه قوله تعالى : { وما علمناه الشعر وما ينبغي له } \\[ يس : 69 \\] في هذه السورة .والإِدراك : اللحاق والوصول إلى البُغية فقوله : { أن تُدرك } فاعل { يَنْبَغِي } فأفاد الكلام نفي انبغاء إدراك الشمسسِ القمرَ . والمعنى : نفي أن تصطَدم الشمس بالقمر ، خلافاً لما يبدو من قرب منازلهما فإن ذلك من المسامتة لا من الاقتراب . وصوغ هذا بصيغة الإِخبار عن المسند إليه بالمسند الفعلي لإِفادة تقوّي حكم النفي فذلك أبلغ في الانتفاء مما لو قيل : لا ينبغي للشمس أن تدرك القمر .وافتتاح الجملة بحرف النفي قبل ذكر الفعل المنفي ليكون النفي متقرراً في ذهن السامع أقوى مما لو قيل : الشمسُ لا ينبغي لها أن تدرك القمر ، فكان في قوله : { لا الشَّمْسُ ينبغي لها أن تُدْرِكَ القَمَر } خُصوصيتان .ولمَّا ذكر الشمس والقمر وكانت الشمس مقارنة للنهار في مخيلات البشر ، وكان القمر مقارناً لليل ، وكان في نظام الليل والنهار منافع للناس اعترض بذكر نظام الشمس والقمر أثناء الاعتبار بنظام الليل والنهار .ومعنى : { ولاَ الليْلُ سَابِقُ النَّهَارِ } أن الليل ليس بمفلتتٍ للنهار ، فالسبق بمعنى التخلص والنجاة ، كقول مُرة بن عَدَّاء الفقعسي: ... كأنَّكَ لم تَسبَقْ من الدهر مَرَّةًإذا أنتَ أدركت الذي كنتَ تطلب ... { أم حسب الذين يعملون السيئات أن يسبقونا } في سورة العنكبوت } ( 4 ) ، والمعنى : أن انسلاخ النهار على الليل أمر مسخّر لا قبل لليل أن يتخلف عنه .ولا يستقيم تفسير السبق هنا بمعناه المشهور وهو الأوَّلية بالسير لأن ذلك لا يُتصور في تداول الليل والنهار ، ولا أن يكون المراد بالسبق ابتداءَ التكوين إذ لا يتعلق بذلك غرض مهم في الآية ، على أن الشأن أن تكون الظلمة أسبق في التكوين . والغرض التذكير بنعمة الليل ونعمة النهار فإن لكليهما فوائد للناس فلو تخلص أحدهما من الآخرِ فاستقرّ في الأفق لتعطلت منافع جمّة من حياة الناس والحيوان .وفي الكلام اكتفاء ، أي لأن التقدير : ولا القمرُ يدرك الشمسَ ، ولا النهارُ سابق الليل .وقوله : { وكُلٌّ في فَلَككٍ يَسْبَحُونَ } عطف على جملة { لا الشمس ينبغي لها أن تدرك القمر } . والواو عاطفة ترجيحاً لِجانب الإِخبار بهذه الحقيقة على جانب التذييل ، وإلا فحقّ التذييل الفصل . وما أضيف إليه { كلّ } محذوف ، وتنوين { كل } تنوين عوض عن المضاف إليه المحذوففِ ، فالتقدير : وكلّ الكواكب .وزيدت قرينة السياق تأكيداً بضمير الجمع في قوله : { يَسْبَحُونَ } مع أن المذكور من قبل شيئان لا أشياء ، وبهذا التعميم صارت الجملة في معنى التذييل .والفَلَك : الدائرة المفروضة في الخلاء الجوّي لسير أحد الكواكب سيراً مطّرداً لا يحيد عنه ، فإن أهل الأرصاد الأقدمين لما رصدوا تلك المدارات وجدوها لا تتغير ووجدوا نهايتها تتصل بمبتداها فتوهموها طرائق مستديرة تسير فيها الكواكب كما تتقلب الكرة على الأرض وربما توسعوا في التوهم فظنوها طرائق صلبة ترتكز عليها الكواكب في سيرها وبعض الأمم يتوهمون الشمس في سيرها مجرورة بسلاسل وكلاليب وكان ذلك في معتقد القبط بمصر .وسمّى العرب تلك الطرائق أفلاكاً واحدها فَلَك اشتقوا له اسماً من اسم فَلْكَة المِغْزَل ، وهي عُود في أعلاه خشبة مستديرة متبطحة مثل التفاحة الكبيرة تلفُّ المرأة عليها خيوط غزلها التي تفتلها لتديرها بكفّيها فتلتف عليها خيوط الغزل ، فتوهموا الفلك جسماً كُرويا وتوهموا الكواكب موضوعة عليه تدور بدورته ولذلك قدروا الزمان بأنه حركة الفَلَك . وسمّوا ما بين مبدأ المُدّتين حتى ينتهي إلى حيث ابتدأ دورة الفلك . ولكن القرآن جاراهم في الاسم اللغوي لأن ذلك مبلغ اللغة وأصلح لهم ما توهموا بقوله : { يَسْبَحُونَ } ، فبطل أن تكون أجرام الكواكب ملتصقة بأفلاكها ولزم من كونها سابحة أن طرائق سيرها دوائر وهمية لأن السبح هنا سبح في الهواء لا في الماء ، والهواء لا تخطط فيه الخطوط ولا الأخاديد .وجيء بضمير { يَسْبَحُونَ } ضمير جمع مع أن المتقدم ذِكره شيئان هما الشمس والقمر لأن المراد إفادة تعميم هذا الحكم للشمس والقمر وجميع الكواكب وهي حقيقة علمية سبق بها القرآن .وجملة { كل في فلك } فيها محسن الطرد والعكس فإنها تقرأ من آخرها كما تقرأ من أولها .\n\n",
      "translations": [
        {
          "translation": "It is not for the sun to overtake the moon) it is not proper for the sun to rise where the moon appears such that it takes away its light, (nor doth the night outstrip the day) nor does the night come at the time of the day such that it eclipses its brightness. (They) the sun, the moon and the planets (float each in an orbit) revolve and turn round an orbit.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ ٱلشَّمْسُ يَنبَغِي لَهَآ أَن تدْرِكَ ٱلقَمَرَ } معناه يَعلو ضَوءُ هذا على هذا\n\n\n\n\nوقوله تعالى: { وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ } يَجْرُونَ والفَلكُ: القُطبُ الذي تدور عليه السماء\n وقال الفَلكُ: السَّماءُ!\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {the sun should not catch the moon} means that the light of this is greater than that.\n\n\nAnd the saying of Allaah {And all in the ship will be praising Allaah} They will be running and the ship: the pole on which the sky revolves.\n The ship said: \"Heaven!\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n تقطع البروج الاثنى عشر في سنة والقمر سريع السير يقطعها في كل شهر { وَلاَ ٱلَّيلُ سَابِقُ ٱلنَّهَارِ } أي: لا يسع ويتيسر له أن يسبق ويدخل في الهار\n بل لكل منهما مدة مخصوصة مقدرة من عند الحكيم الع ليم\n لا يسع لهما التجاوز عنها { وَ } لذلك { كُلٌّ } أي: كل واحد من الشمس والقمر وسائر السيارات { فِي فَلَكٍ } مخصوص معين من الأفلاك السبعة المتسعة { يَسْبَحُونَ } [يس: 40] ويسيرون فيه ويدورون فيه على الانبساط والاستقلال\n بلا توهم السبق والإدراك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:33",
      "similarity": 0.6805752421489248
    },
    {
      "verse": "26:61",
      "similarity": 0.44591763269536006
    },
    {
      "verse": "41:37",
      "similarity": 0.421901090705678
    },
    {
      "verse": "75:9",
      "similarity": 0.3913706742719247
    },
    {
      "verse": "55:5",
      "similarity": 0.3889836698189722
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036040.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036040.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}