{
  "chapter": "يس",
  "text": "لا الشمس ينۢبغى لها ان تدرك القمر ولا اليل سابق النهار وكل فى فلك يسبحون",
  "translations": [
    {
      "translation": "It is not for the sun to overtake the moon nor for the night to outstrip the day; each one is swimming in a sphere.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither can the sun overtake the moon, nor the night outpace the day: Each of them keeps coursing in its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither does it lie in the sun's power to overtake the moon nor can the night outstrip the day. All glide along, each in its own orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "how the sun is not supposed to catch-up with the moon, nor is the night to precede the day. All of them are to float in a certain orbit;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to catch up with the moon, nor does the night surpass the day; and each one of them floats in its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither is it allowable to the sun that it should overtake the moon, nor can the night outstrip the day; and all float on in a sphere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It behoves not the sun to overtake the moon, neither does the night outstrip the day, each swimming in a sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to overtake the moon, nor doth the night outstrip the day. They float each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun cannot overtake the moon, nor can the night outpace the day: each floats in [its own] orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not permitted to the sun that it should overtake the moon, nor can the night outstrip the day: each in an orbit, they float.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither it behooves the sun to overtake the moon, nor may the night outrun the day, and each swims in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not permitted to the Sun to catch up the Moon, nor can the Night outstrip the Day: Each (just) swims along in (its own) orbit (according to Law).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun shall not outstrip the moon, nor shall the night outstrip the day. Each is floating in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun is not to overtake the moon, nor is the night to outpace the day. Each floats in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not allowable for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:40] It does not behove — it is [neither] facilitated nor is it right for — the sun to catch up with the moon, and so appear together with it at night, nor may the night outrun the day, and thus it [the night] never arrives before the latter ends and each (kullun: the nunation compensates for the [missing] genitive annexation [that would have been constructed] with al-shams, ‘the sun’, al-qamar, ‘the moon’, and al-nujūm, ‘the stars’) [of these] is in an orbit, swimming, moving — these [celestial bodies] are being treated as [though they were] rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "It is not for the sun to overtake the moon) it is not proper for the sun to rise where the moon appears such that it takes away its light, (nor doth the night outstrip the day) nor does the night come at the time of the day such that it eclipses its brightness. (They) the sun, the moon and the planets (float each in an orbit) revolve and turn round an orbit.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ ٱلشَّمْسُ يَنبَغِي لَهَآ أَن تدْرِكَ ٱلقَمَرَ } معناه يَعلو ضَوءُ هذا على هذا\n\n\n\n\nوقوله تعالى: { وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ } يَجْرُونَ والفَلكُ: القُطبُ الذي تدور عليه السماء\n وقال الفَلكُ: السَّماءُ!\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {the sun should not catch the moon} means that the light of this is greater than that.\n\n\nAnd the saying of Allaah {And all in the ship will be praising Allaah} They will be running and the ship: the pole on which the sky revolves.\n The ship said: \"Heaven!\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n تقطع البروج الاثنى عشر في سنة والقمر سريع السير يقطعها في كل شهر { وَلاَ ٱلَّيلُ سَابِقُ ٱلنَّهَارِ } أي: لا يسع ويتيسر له أن يسبق ويدخل في الهار\n بل لكل منهما مدة مخصوصة مقدرة من عند الحكيم الع ليم\n لا يسع لهما التجاوز عنها { وَ } لذلك { كُلٌّ } أي: كل واحد من الشمس والقمر وسائر السيارات { فِي فَلَكٍ } مخصوص معين من الأفلاك السبعة المتسعة { يَسْبَحُونَ } [يس: 40] ويسيرون فيه ويدورون فيه على الانبساط والاستقلال\n بلا توهم السبق والإدراك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:33",
      "similarity": 0.6805752421489248
    },
    {
      "verse": "26:61",
      "similarity": 0.44591763269536006
    },
    {
      "verse": "41:37",
      "similarity": 0.421901090705678
    },
    {
      "verse": "75:9",
      "similarity": 0.3913706742719247
    },
    {
      "verse": "55:5",
      "similarity": 0.3889836698189722
    }
  ]
}