{
  "chapter": "يس",
  "text": "واذا قيل لهم انفقوا۟ مما رزقكم الله قال الذين كفروا۟ للذين ءامنوا۟ انطعم من لو يشاء الله اطعمه ان انتم الا فى ضلل مبين",
  "translations": [
    {
      "translation": "And when they are told, 'Spend from the provision Allah has given you,' those who are kafir say to those who have iman, 'Why should we feed someone whom, if He wished, Allah would feed Himself? You are clearly in error.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: \"Spend of what God has given you,\" the unbelievers say to those who believe: \"Why should we feed those whom God should have fed if He pleased?\" You are only in palpable error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: “Spend (in the Way of Allah) out of the sustenance that Allah has provided you,” the unbelievers say to the believers: “Shall we feed him whom, Allah would have fed, had He so wished?” Say: “You are in evident error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to spend for the cause of God out of what He has provided for them for their sustenance, the disbelievers say to the believers, \"Should we feed those whom God has decided to feed? You are in plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Spend in Allah’s cause, from what Allah has provided you”, the disbelievers say regarding the believers, “Shall we feed these, whom if Allah willed, would have fed? You are not but in open error!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Spend of that with which Allah has provided you,\" those who disbelieve say to those who believe: \"Shall we feed those whom, if Allah willed, He would have fed You are only in a plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Spend out of what Allah has given you, those who disbelieve say to those who believe: Shall we feed him whom, if Allah please, He could feed? You are in naught but clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, 'Expend of that God has provided you,' the unbelievers say to the believers, 'What, shall we feed such a one whom, if God willed, He would feed? You are only in manifest error!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Spend of that wherewith Allah hath provided you, those who disbelieve say unto those who believe: Shall we feed those whom Allah, if He willed, would feed? Ye are in naught else than error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they are told, \"Give to others out of what God has provided for you,\" those who are bent on denying the truth say to the believers, \"Why should we feed those whom God could feed if He wanted? You are clearly in error!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said Unto them: expend of that wherewith Allah hath provided you, those who disbelieve say Unto those who believe: shall we feed those whom God Himself would have fed, if He listed? Ye are in naught else than error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Spend out of what Allah has provided you,’ the faithless say to the faithful, ‘Shall we feed [someone] whom Allah would feed, if He wished? You are only in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, \"Spend ye of (the bounties) with which Allah has provided you,\" the Unbelievers say to those who believe: \"Shall we then feed those whom, if Allah had so willed, He would have fed, (Himself)?- Ye are in nothing but manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Spend of that with which Allah has provided you,\" those who disbelieve say to those who believe: \"Shall we feed those whom, if Allah willed, He (Himself) would have fed? You are only in a plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: 'Spend of that which Allah has given you' the unbelievers say to the believers: 'Are we to feed those whom Allah can feed if He chooses? Surely, you are only in clear error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Spend of what God has provided for you,” those who disbelieve say to those who believe, “Shall we feed someone whom God could feed, if He so willed? You must be deeply misguided.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Spend from that which Allah has provided for you,\" those who disbelieve say to those who believe, \"Should we feed one whom, if Allah had willed, He would have fed? You are not but in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:47] And when it is said, that is, [when] the poor ones from among the Companions [of the Prophet] say, to them: ‘Expend, on us, of what God has provided you’, of wealth, those who disbelieve say to those who believe, in mockery of them: ‘Are we to feed those whom, if God willed, He would feed?, as you are wont to believe? You, in saying this to us, together with this believe of yours, are only in manifest error!’ — as an explicit declaration of their disbelief this [statement] is very effective [in the way that it has been expressed].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا قِيلَ لَهُمْ أَنْفِقُوا مِمَّا رَزَقَكُمُ اللَّهُ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آَمَنُوا أَنُطْعِمُ مَنْ لَوْ يَشَاءُ اللَّهُ أَطْعَمَهُ إِنْ أَنْتُمْ إِلَّا فِي ضَلَالٍ مُبِينٍ (47)كانوا مع ما هم عليه من الكرم يشحّون على فقراء المسلمين فيمنعونهم البذل تشفّياً منهم فإذا سمعوا من القرآن ما فيه الأمر بالإِنفاق أو سألهم فقراء المسلمين من فضول أموالهم أو أن يعطوهم ما كانوا يجعلونه لله من أموالهم الذي حكاه الله عنهم بقوله : { وجعلوا للَّه مما ذرأ من الحرث والأنعام نصيباً } \\[ الأنعام : 136 \\] فلعل من أسلم من الفقراء سألوا المشركين ما اعتادوا يعطونهم قَبْل إسلامهم فيقولون أعطوا مما رزقكم الله وقد سمعوا منهم كلمات إسلامية لم يكونوا يسمعونها من قبل ، وربما كانوا يحاجونهم بأن الله هو الرزاق ولا يقع في الكون كائن إلا بإرادته فجعل المشركون يتعللون لمنعهم بالاستهزاء فيقولون : لا نُطعم من لو يشاء الله لأطعمه ، وإذا كان هذا رزقناه الله فلماذا لم يرزقكم ، فلو شاء الله لأطعمكم كما أطعمنا . وقد يقول بعضهم ذلك جهلاً فإنهم كانوا يجهلون وضع صفات الله في مواضعها كما حكى الله عنهم : { وقالوا لو شاء الرحمان ما عبدناهم } \\[ الزخرف : 20 \\] .وإظهار الموصول من قوله : { قَالَ الذيِنَ كَفَرُوا } في مقام الإِضمار مع أن مقتضى الظاهر أن يقال : قالوا أنطعم الخ لنكتة الإِيماء إلى أن صدور هذا القول منهم إنما هو لأجل كفرهم ولأجل إيمان الذين سئل الإِنفاق عليهم .روى ابنُ عطية : أن النبي صلى الله عليه وسلم أمر المشركين بالإِنفاق على المساكين في شدة أصابت الناس فشحّ فيها الأغنياء على المساكين ومنعوهم ما كانوا يعطونهم .واللام في قوله : { لِلَّذِينَ ءَامَنُوا } يجوز أن تكون لتعدية فعل القول إلى المخاطب به أي خاطبوا المؤمنين بقولهم : { أنُطعِمُ مَن لو يَشاءُ الله أطعَمَهُ } ، ويجوز أن تكون اللام للعلة ، أي قال الذين كفروا لأجل الذين آمنوا ، أي قالوا في شأن الذين آمنوا كقوله تعالى : { الذين قالوا لإخوانهم وقعدوا لو أطاعونا ما قتلوا } \\[ آل عمران : 168 \\] وقوله : { وقال الذين كفروا للذين آمنوا لو كان خيراً ما سبقونا إليه } \\[ الأحقاف : 11 \\] أي قالوا ذلك تعلة لعدم الإِنفاق على فقراء المؤمنين .والاستفهام في { أنُطْعِمُ } إنكاري ، أي لا نطعم من لو شاء الله لأطعمهم بحسب اعتقادكم أن الله هو المطعم .والتعبير في جوابهم بالإِطعام مع أن المطلوب هو الإِنفاق : إمّا لمجرد التفنن تجنباً لإِعادة اللفظ فإن الإِنفاق يراد منه الإِطعام ، وإمّا لأنهم سئلوا الإِنفاق وهو أعمّ من الإِطعام لأنه يشمل الإِكساء والإِسكان فأجابوا بإمساك الطعام وهو أيسر أنواع الإِنفاق ، ولأنهم كانوا يعيّرون من يشحّ بإطعام الطعام وإذا منعوا المؤمنين الطعام كان منعهم ما هو فوقه أحرى .وجملة { إنْ أنتُمْ إلاَّ في ضَلاللٍ مُبِينٍ } من قول المشركين يخاطبون المؤمنين ، أي ما أنتم في قولكم : { أنفِقُوا مِمَّا رَزَقَكُمُ الله } وما في معناه من اعتقاد أن الله متصرف في أحوالنا إلا متمكن منكم الضلال الواضح . وجعلوه ضلالاً لجهلهم بصفات الله ، وجعلوه مبيناً لأنهم يحكمون الظواهر من أسباب اكتساب المال وعدمه .والجملة تعليل للإِنكار المستفاد من الاستفهام .\n\n",
      "translations": [
        {
          "translation": "(And when it is said unto them) to the people of Mecca; the poor among the believers said to them: (Spend) on the poor (of that wherewith Allah hath provided you. Those who disbelieve) the disbelievers of Mecca (say unto those who believe) the poor believers: (Shall we feed) shall we spend on (those whom Allah, if He willed, would feed) would provide for? (Ye are) group of believers; it is also said that the believers said to them: you are (in naught else than error manifest) it is also said that this verse was revealed about the atheists of Quraysh.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم أيضاً من كمال قسوتهم وبغيهم أمثالكم { إِذَا قِيلَ لَهُمْ } إمحاضاً للنصح وتنبيهاً لهم على حض الخير: { أَنفِقُواْ مِمَّا رَزَقَكُمُ ٱلله } من فواضل نعمكم إلى الفقراء الفاقدين لها\n لتتصفوا بالكرم وتفوزوا بمرتبة الإيثار { قَالَ ٱلَّذِينَ كَفَرُواْ } وكذبوا منهم بآيات الله بعدما سمعوا الأمر الإلهي الوارد على الإنفاق من ألسن المؤمنين { لِلَّذِينَ آمَنُوۤاْ } إلى المصدقين الممتثلين بأوامر الله ونواهيه إيماناً واحتساباً على سبيل الإنكار والاستبعاد: { أَنُطْعِمُ } أي: تأمروننا أيها الجاهلون الضالون أن نعطي ونطعم { مَن لَّوْ يَشَآءُ ٱللَّهُ } القادر المقتدر على إطعام عباده جملة { أَطْعَمَهُ } وبعدما لم يشأ مع قدرته لم يطعمهم\n فأنتم من تلقاء أنفسكم تأمروننا بالإطعام\n وبالجملة: { إِنْ أَنتُمْ } أي: ما أنتم بدينكم وأمركم بما لا يشاء ولا يرضى منه سبحانه { إِلاَّ فِي ضَلاَلٍ مُّبِينٍ } [يس: 47] وغواية عظيمة ظاهرة\n ادعيتم الإيمان بالله\n وأمرتم بخلاف مشيئته وإرادته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا قيل لهم أَنفقوا مما رزقكم اللهُ } أي: تصدّقوا على الفقراء\n { قال الذين كفروا } من مشركي مكة { للذين آمنوا أَنُطْعِمُ من لو يشاءُ اللهُ أَطْعَمَهُ } عن ابن عباس رضي الله عنه: كان بمكة زنادقة\n فإذا أُمروا بالصدقة على المساكين\n قالوا: لا والله\n أيُفقره الله ونُطعمه نحن؟!\n قيل: سبب الآية: أن قريشاً لَمّا أسلم ضعفاؤهم\n قطعوا عنهم صِلاتهم\n فندبهم بعضُ المؤمنين إلى ذلك\n فقالوا تلك المقالة\n وقيل: إن قريشاً شَحَّتْ ـ بسبب أزمة نزلت بهم ـ على المساكين\n مؤمِنهم وكافرهم\n فندبهم النبي صلى الله عليه وسلم إلى النفقة على المساكين\n فقالوا على سبيل الجهل: أَنُطعم قوماً أراد الله فقرهم وتعذيبهم\n ومن أمثالهم: كن مع الله على المدبر\n حتى كان الرجل يرعى إبله\n فيجعل السِمَان في الخصب\n والمهازيل في الجدب\n فإذا قيل له في ذلك\n قال: أُكرم ما أَكرم الله\n وأُهين ما أهان الله\n ويحتمل أن يكون قولهم ذلك استهزاءً\n فكأنهم قالوا: لِمَ لا يرزقهم إلهك الذي تزعم\n قال الكواشي: قد يتمسّك بهذه الآية بعضُ البخلاء\n فيقول: لا أُعطي مَن حرمه الله\n وليس هذا بصحيح لأن الله تعالى أغنى وأفقر\n وجعل للفقير جزءاً من مال الغني كما يشاء\n وفي الإحياء: أن المراد بالصدقة وشرعها: التخلُّص من رذيلة البخل\n وذكل نفع يعود على المتصدق\n بإخراجه عن حب الدنيا\n وتعلُّق قلبه بها\n الصادّ عن الله\n وهؤلاء لم يفهموا حكمة الله\n فقالوا ما قالوا\n هـ\n ثم قال: { إِن أنتم إِلا في ضلال مبين } في أمركم لنا بالنفقة\n أو في غير ذلك من دينكم\n أو: يكون من قول الله تعالى للكفرة\n الإشارة: وإذا قيل للعامة: اتقوا ما بين أيديكم\n من شدائد الدنيا\n وما خلفكم\n من أهوال الآخرة\n لعلكم تُرحمون فيهما فإن التقوى الكاملة تحفظ الرجل في حياته وبعد مماته\n وربما يسري الحفظ إلى عقبه\n كما هو مشاهد في عقب أولياء الله\n\nأو: إذا قيل لهم: اتقوا خواطر التدبير فيما بين أيديكم إذ ليس أمره بيدكم\n فجُل ما تبنيه من التدبير تهدمه رياح التقدير\n وخواطر التدبير\n فيما سلف قبلكم\n إذ فيه تحصيل الحاصل\n وتعطيل الوقت بلا فائدة\n { لعلكم تُرحمون } بمقام الرضا\n وسكون القلب وراحته تحت مجاري القضاء\n أعرضوا وانهمكوا في أودية الغفلة والخواطر\n وما تأتيهم من آية دالة على وحدانيته تعالى\n وانفراده بالخلق والتدبير\n إلا كانوا عنها معرضين\n قال القشيري: هذه صفة مَن سَيَّبَهم في أودية الخذلان\n ووَسَمَهم بسِمَة الحرمان\n وأصَمَّهم عن سماع الرُّشْد\n وصَدَّهم بالخذلان عن سلوك القصد\n فلا تأتيهم آيةٌ في الزَّجْرِ إلا قابلوها بإعراضهم\n وتجافوا عن الاعتبار بها\n على دوام انقباضهم\n وإذا أُمِرُوا بالإنفاق والإطعام عارضوا بأنَّ الله رازقُ الأنام\n وإذا شاءَ نَظَرَ إليهم بالإِنعام\n هـ\n ثم ذكر استعجالهم البعث\n فقال: { وَيَقُولُونَ مَتَىٰ هَذَا\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:57",
      "similarity": 0.5808458273670785
    },
    {
      "verse": "80:24",
      "similarity": 0.43371521594867707
    },
    {
      "verse": "74:44",
      "similarity": 0.41300846394440227
    },
    {
      "verse": "8:3",
      "similarity": 0.4098594128243478
    },
    {
      "verse": "44:44",
      "similarity": 0.3942798727270449
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036047.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036047.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}