{
  "chapter": "يس",
  "text": "ونفخ فى الصور فاذا هم من الاجداث الى ربهم ينسلون",
  "translations": [
    {
      "translation": "When the trumpet blast is sounded they will come out of their graves and hasten to their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Trumpet shall be blown and lo! they will come out of their graves and be on the move towards their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the trumpet is sounded, they will be driven out of their grave into the presence of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown – so they will come forth from the graves, running towards their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown and behold from the graves they will come out quickly to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the trumpet shall be blown, when lo! from their graves they shall hasten on to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet shall be blown; then behold, they are sliding down from their tombs unto their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the trumpet is blown and lo! from the graves they hie unto their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The trumpet will be blown and, at once, they will rise up from their graves, and hasten to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the trumpet shall be blown, and lo! from the tombs Unto their Lord they shall be hastening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Trumpet is blown, behold, there they will be, scrambling towards their Lord from their graves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The trumpet shall be sounded, when behold! from the sepulchres (men) will rush forth to their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown (i.e. the second blowing) and behold! From the graves they will come out quickly to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Horn is blown, and, from the graves they rush forth to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Trumpet will be blown, then behold, they will rush from the tombs to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Horn will be blown; and at once from the graves to their Lord they will hasten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:51] And the Trumpet is blown — this is the Horn — at the second Blast for the Resurrection [to take place]; between the two Blasts is an interval of forty years; and lo! they, those interred, will be scrambling out of their graves towards their Lord, emerging therefrom hurriedly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the trumpet is blown) this is the blowing of the resurrection (and lo! from the graves they hie unto their Lord) they emerge from their graves and proceed towards their Lord,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَا هُم مِّنَ ٱلأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ } معناه من القُبورِ\n واحدُها جَدثٌ\n ويَنسِلون: معناه يُسرعونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: متى سمعوا الصيحة الأولى ماتوا فجأة بلا إمهال لهم ساعة { وَ } بعدما ماتوا بالصيحة الأولى، وصاروا كسائر الأموات { نُفِخَ فِي ٱلصُّورِ } مرة أخرى بعد الصيحة الأولى { فَإِذَا هُم } أي: جميع الأموات، صاروا أحياء قائمين هائمين، خارجين { مِّنَ ٱلأَجْدَاثِ } أي: القبور { إِلَىٰ رَبِّهِمْ } الذي يناديهم للعرض والجزاء { يَنسِلُونَ } [يس: 51] يذهبون ويسرعون طوعاً وكرهاً؛ إذ لا مرجع لهم سواه، ولا ملجأ إلا هو\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}