{
  "chapter": "يس",
  "text": "قالوا۟ يويلنا منۢ بعثنا من مرقدنا هذا ما وعد الرحمن وصدق المرسلون",
  "translations": [
    {
      "translation": "They will say, 'Alas for us! Who has raised us from our resting-place? This is what the All-Merciful promised us. The Messengers were telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: \"Ah woe, who has roused us from our sleep?\" This is what Ar-Rahman had promised, and whose truth the apostles had affirmed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(nervously) exclaiming. “Alas for us! Who roused us out of our sleeping-place?” “This is what the Merciful One had promised, and what (His) Messengers had said was true.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Woe to us! Who has raised us up from our graves? This is what the Beneficent God has promised. The Messengers have also spoke the truth\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying, “O our misfortune! Who has raised us from our sleep? This is what the Most Gracious had promised, and the Noble Messengers had spoken the truth!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Woe to us! Who has raised us up from our place of sleep.\" (It will be said to them): \"This is what the Most Gracious had promised, and the Messengers spoke truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: O woe to us! who has raised us up from our sleeping-place? This is what the Beneficent Allah promised and the apostles told the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Alas for us! Who roused us out of our sleeping place? This is what the All-merciful promised, and the Envoys spoke truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Crying: Woe upon us! Who hath raised us from our place of sleep? This is that which the Beneficent did promise, and the messengers spoke truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe betide us!\" they will say, \"Who has roused us from our sleep?\" This is what the Lord of Mercy promised: the messengers spoke the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: Ah woe Unto us! who hath roused us from our sleeping-place? This is that which the Compassionate had promised, and truly spake the sent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Woe to us! Who raised us from our place of sleep?’ ‘This is what the All-beneficent had promised, and the apostles had spoken the truth!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Ah! Woe unto us! Who hath raised us up from our beds of repose?\"... (A voice will say:) \"This is what (Allah) Most Gracious had promised. And true was the word of the messengers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Woe to us! Who has raised us up from our place of sleep.\" (It will be said to them): \"This is what the Most Beneficent (Allah) had promised, and the Messengers spoke truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe for us' they will say. 'Who has roused us from our sleepingplace? This is what the Merciful promised; the Messengers have spoken the truth'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Woe to us! Who resurrected us from our resting-place?” This is what the Most Gracious had promised, and the messengers have spoken the truth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"O woe to us! Who has raised us up from our sleeping place?\" [The reply will be], \"This is what the Most Merciful had promised, and the messengers told the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:52] They, the disbelievers among them, will say, ‘O (yā is for calling attention [to something]) woe to us! (waylanā means halākanā, ‘[O] our destruction!’, and it is a verbal noun which has no [regular] verbal conjugation) Who has raised us from our place of sleep?, [they say this] because they will have been asleep in the interval between the two blasts and will not have been punished [yet]. This, that is, [this] raising, is that which the Compassionate One had promised and, regarding which, the messengers had spoken the truth’: they affirm [this truth] when such affirmation is no longer of any benefit to them — but it is also said that this is said to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا هَذَا مَا وَعَدَ الرَّحْمَنُ وَصَدَقَ الْمُرْسَلُونَ (52)استئناف بياني لأن وصف هذه الحال بعد حكاية إنكارهم البعث وإحالتهم إياه يثير سؤال من يسأل عن مقالهم حينما يرون حقية البعث .و { يا وَيْلَنَا } كلمة يقولها الواقع في مصيبة أو المُتحسِّر . والويل : سوء الحال ، وإنما قالوا ذلك لأنهم رأوا ما أُعدّ لهم من العذاب عندما بعثوا . وقد تقدم عند قوله تعالى : { فويل للذين يكتبون الكتاب بأيديهم } في سورة البقرة ( 79 ) .وحكي قولهم بصيغة الماضي اتباعاً لحكاية ما قبله بصيغة المضيّ لتحقيق الوقوع .وحرف النداء الداخل على { ويلنا } للتنبيه وتنزيل الويل منزلة من يسمع فيُنادَى ليحضر ، وقد تقدم عند قوله تعالى : { قالت يا ويلتى } في سورة هود ( 72 ) .و { مَن } استفهام عن فاعل البعث مستعمل في التعجّب والتحسّر من حصول البعث . ولما كان البعث عندهم محالاً كنّوا عن التعجب من حصوله بالتعجب من فاعله لأن الأفعال الغريبة تتوجه العقول إلى معرفة فاعلها لأنهم لما بُعثوا وأزْجي بهم إلى العذاب علموا أنه بعثٌ فعَله من أراد تعذيبهم .والمَرْقَد : مكان الرقاد . وحقيقة الرقاد : النوم . وأطلقوا الرقاد على الموت والاضطجاععِ في القبور تشبيهاً بحالة الراقد .ثم لم يلبثوا أن استحضرت نفوسهم ما كانوا يُنذرون به في الدنيا فاستأنفوا عن تعجبهم قولهم : { هذا ما وَعَدَ الرحمن وصَدَقَ المُرْسَلُونَ } . وهذا الكلام خبر مستعمل في لازم الفائدة وهو أنهم علموا سبب ما تعجبوا منه فبطل العجب ، فيجوز أن يكونوا يقولون ذلك كما يتكلم المتحسّر بينه وبين نفسه ، وأن يقوله بعضهم لبعض كل يظن أن صاحبه لم يتفطن للسبب فيريد أن يعلمه به .وأتوا في التعبير عن اسم الجلالة بصفة الرحمان إكمالاً للتحسر على تكذيبهم بالبعث بذكر ما كان مقارناً للبعث في تكذيبهم وهو إنكار هذا الاسم كما قال تعالى : { وإذا قيل لهم اسجدوا للرحمان قالوا وما الرحمان } \\[ الفرقان : 60 \\] .والإِشارة بقوله : { هذا } إشارة إلى الحالة المرْئية لِجميعهم وهي حالة خروجهم من الأرض .وجملة { وصَدَقَ المُرْسَلُونَ } عطف على جملة { هذا ما وعَدَ الرحمن } وهو مستعمل في التحسّر على أن كذبوا الرسل .وجَمع المرسلين مع أن المحكي كلامُ المشركين الذين يقولون { متى هذا الوعد } \\[ يس : 48 \\] إمّا لأنهم استحضروا أن تكذيبهم محمداً صلى الله عليه وسلم كان باعثَه إحالتُهم أن يكون الله يرسل بَشراً رسولاً ، فكان ذلك لأنهم لا يصدقون أحداً يأتي برسالة من الله كما حكى عنهم قوله تعالى : { وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء } \\[ الأنعام : 91 \\] فلما تحسروا على خطئهم ذكَروه بما يشمله ويشمل سبَبَه كقوله تعالى : { كذبت قوم نوح المرسلين } من سورة الشعراء ( 105 ) ، وقوله في سورة الفرقان ( 37 ) { وقوم نوح لما كذبوا الرسل أغرقناهم } ، وإما لأن ذلك القول صدر عن جميع الكفار المبعوثين من جميع الأمم فعلِمت كل أمة خطأها في تكذيب رسولها وخطأ غيرها في تكذيب رسلهم فنطقوا جميعاً بما يفصح عن الخطأيْن ، وقد مضى أن ضمير { فَإذَا هُم جَمِيعٌ } \\[ يس : 53 \\] يجوز أن يعود على جميع الناس .ومن المفسرين من جعل قوله : { هذا ما وعد الرحمن وصَدَقَ المُرْسَلُونَ } من كلام الملائكة يجيبون به قول الكفار { مَنْ بعَثَنا مِن مَرْقَدِنا } فهذا جواب يتضمن بيان مَن بعثهم مع تنديمهم على تكذيبهم به في الحياة الدنيا حين أبلغهم الرسل ذلك عن الله تعالى . واسم { الرحمن } حينئذٍ من كلام الملائكة لزيادة توبيخ الكفار على تجاهلهم به في الدنيا .\n\n",
      "translations": [
        {
          "translation": "(Crying) i.e. the disbelievers after they come out of their graves: (Woe upon us! Who hath raised us) who has awakened us (from our place of sleep?) And then some will say to others: (This is that which the Beneficent did promise) in the life of the world; it is also said that it is the angels, the guardian angels, who say: this is that which the Beneficent did promise on the tongue of the messengers in the life of the world, (and the messengers spoke truth) concerning resurrection after death,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَن بَعَثَنَا مِن مَّرْقَدِنَا } معناه من أَهبَّنا من مَّرقدِنا معناه من مَنامِنا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He who raised us from our sleep} means He who brought us back to life from our sleep, meaning He who revived us from our slumber.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أفاقوا من ولههم وحيرتهم ورأوا مقدمات العذاب والنكال { قَالُواْ } أي: بعضهم لبعض متحيرين متحسرين: { يٰوَيْلَنَا } وهلكنا\n تعال فهذا أوانك { مَن بَعَثَنَا مِن مَّرْقَدِنَا } أي: قبرنا الذي كنا فيه مستودعين\n أي: كل منا مستودع على صاحبه\n وإن كان هناك عذاب أيضاً\n لكن لا تفضيح\n أو المعنى: من أيقظنا عن نومنا الذي كنا عليه قبل النفخة الثانية المجيئة\n وبعد النفخة الأولى المهيئة\n إنما قالوا تحسراً وتحزناً\n\n\nثم قيل لهم حينئذ من قبل الحق: { هَذَا مَا وَعَدَ ٱلرَّحْمـٰنُ } أي: يومكم هذا هو اليوم الموعود الذي وعده الرحمن\n وأخبره على ألسنة رسله وكتبه\n لينقذكم من عذابه بمقتضى سعة رحمته { وَصَدَقَ ٱلْمُرْسَلُونَ } [يس: 52] في جميع ما جاءوا من قِبل ربهم من الأمور المتعلقة بالنشأة الأخرى\n وأنتم من كمال بغيكم وبغضكم على الله ورسوله في النشأة الأولى أنكرتم الرحمن وكذبتم الرسل الكرام\n فاليوم يلقاكم ما كذبتم به\n\n\nثم قال سحبانه تقريعاً وتوبيخاً على المشركين المنكرين لقدرته وكمال عزته وسطوته واستقلاله في تصرفات ملكه وملكوته\n وإظهاراً لعلو شأنه وسمو برهانه بأن أمثال هذه المقدورات في جنب قدرتنا الكاملة في غاية اليسر والسهولة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فتقول الملائكة في جوابهم: { هذا ما وَعَدَ الرحمنُ وَصَدَقَ المرسلون } أو يقوله المؤمنون\n أو: الكفار\n يتذكرون ما سمعوه من الرسل\n فيُجيبون به أنفسهم\n أو بعضهم بعضاً\n و \" ما \": مصدرية\n أي: هذا وَعْدُ الرحمن وصِدق المرسلين\n على تسمية الموعود والمصدوق فيه بالوعد والصدْق\n أو: موصولة\n أي: هذا الذي وعده الرحمن والذي صَدَقه المرسلون\n أي: والذي صدق فيه المرسلون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:18",
      "similarity": 0.2886589554657208
    },
    {
      "verse": "51:60",
      "similarity": 0.11265225268831544
    },
    {
      "verse": "37:20",
      "similarity": 0.10858717164621096
    },
    {
      "verse": "21:14",
      "similarity": 0.0986352667297375
    },
    {
      "verse": "68:31",
      "similarity": 0.09514456489136261
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}