{
  "chapter": "يس",
  "text": "فاليوم لا تظلم نفس شيـا ولا تجزون الا ما كنتم تعملون",
  "translations": [
    {
      "translation": "Today no self will be wronged in any way. You will only be repaid for what you did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul will be wronged the least that Day, nor would be recompensed but only for what it had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today no one shall suffer the least injustice, and you shall not be recompensed except according to your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul will be in the least bit wronged on that Day and no one will receive any recompense other than what he deserves for his deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day no soul will be wronged in the least; and you will not be compensated except for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Day, none will be wronged in anything, nor will you be requited anything except that which you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day no soul shall be dealt with unjustly in the least; and you shall not be rewarded aught but that which you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today no soul shall be wronged anything, and you shall not be recompensed, except according to what you have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day no soul is wronged in aught; nor are ye requited aught save what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day no soul shall suffer the least injustice. You shall be rewarded only according to your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To-day no soul will be wronged at all; nor shall ye be requited but for that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Today no soul will be wronged in the least, nor will you be requited except for what you used to do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that Day, not a soul will be wronged in the least, and ye shall but be repaid the meeds of your past Deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Day (Day of Resurrection), none will be wronged in anything, nor will you be requited anything except that which you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today, no soul shall be wronged a thing. You shall not be recompensed except according to your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, no soul will be wronged in the least, and you will be recompensed only for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today no soul will be wronged at all, and you will not be recompensed except for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:54] So today no soul shall be wronged in any way, and you shall not be requited, except, the requital of, what you used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنْتُمْ تَعْمَلُونَ (54)إن كان قوله تعالى : { هذا ما وعَدَ الرحمن } \\[ يس : 52 \\] حكاية لكلام الكفار يوم البعث كان هذا كلاماً من قبل الله تعالى بواسطة الملائكة وكانت الفاء في قوله : { فاليوم لا تُظلمُ نفسٌ شَيْئاً } فاء فصيحة وهي التي تفصح وتنبىء عن كلام مقدّر نشأ عن قوله : { فإذا هم جميع لدينا محضرون } \\[ يس : 53 \\] فهو خطاب للذين قالوا : { من بعثنا من مرقدنا } \\[ يس : 52 \\] . والمعنى : فقد أيقنتم أن وعد الله حق وأن الرسل صدقوا فاليوم يوم الجزاء كما كان الرسل ينذرونكم .وإن كان قوله : { هذا ما وعَدَ الرحمن } \\[ يس : 52 \\] من كلام الملائكة كانت الفاء تفريعاً عليه وكانت جملة { إن كانَتْ إلاَّ صيحَةً واحِدَةً } \\[ يس : 53 \\] الخ معترضة بين المفرع والمفرع عليه .و«اليوم» ظرف وتعريفه للعهد ، وهو عهد حضور يعني يوم الجزاء . وفائدة ذكر التنويه بذلك اليوم بأنه يوم العدل .وأشعر قوله : { لا تُظلم نفسٌ شيئاً } بالتعريض بأنهم سيلقون جزاء قاسياً لكنه عادل لا ظلم فيه لأن نفي الظلم يشعر بأن الجزاء مما يُخال أنه متجاوز معادَلَةَ الجريمة ، وهو معنى { ولاَ تُجْزونَ إلاَّ ما كنتم تعملون } أي إلا على وفاق ما كنتم تعملون وعلى مقداره . وانتصب { شيئاً } على المفعول المطلق ، أي شيئاً من الظلم .ووقوع { نَفْسٌ } و { شَيْئاً } وهما نكرتان في سياق النفي يعمّ انتفاء كل ذلك عن كل نفس وانتفاء كل شيء من حقيقة الظلم وذلك يعمّ جميع الأنفس . . ولكن المقصود أنفس المعاقَبين ، أي أن جزاءهم على حسب سيّئاتهم جزاء عادل . وإذ قد كان تقديره من الله تعالى وهو العليم بكل شيء كانت حقيقة العدل محققة في مقدار جزائهم إذ كلّ عدل غير عدل الله معرض للزيادة والنقصان في نفس الأمر ولكنه يجري على حسب اجتهاد الحاكمين ، والله لم يكلف الحاكم إلاّ ببذل جهده في إصابة الحق ، ولهذا قال النبي صلى الله عليه وسلم \" إذا اجتهد الحاكم فأصاب فله أجران ، وإذا اجتهد فأخطأ فله أجر واحد \" .\n\n",
      "translations": [
        {
          "translation": "(This day) which is the Day of Judgement (no soul is wronged in aught) none will have his good deeds decreased or evil works increased; (nor are you requited) in the Hereafter (aught save what ye used to do) and say in the life of this world. 501\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱلْيَوْمَ } أي: بعد حضر الكل لدينا واجتمع عندنا للعرض والحساب وتنقيد الأعمال\n وجزاء الأفعال الصادرة عنهم في دار الاختبار { لاَ تُظْلَمُ نَفْسٌ شَيْئاً } ولا تنقص من أجور أعمالها الصالحة { وَ } لا تزاد أيضاً على فاسدها على مقتضى عدلنا\n بل { لاَ تُجْزَوْنَ إِلاَّ مَا كُنْتُمْ تَعْمَلُونَ } [يس: 54] أي: بمقتضى عملهم\n إن كان خيراً فخير وإن شراً فشر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:39",
      "similarity": 0.7040889589496206
    },
    {
      "verse": "56:24",
      "similarity": 0.638776490936239
    },
    {
      "verse": "28:84",
      "similarity": 0.49151150654078407
    },
    {
      "verse": "12:74",
      "similarity": 0.490684201299802
    },
    {
      "verse": "39:34",
      "similarity": 0.4475301961581798
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036054.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036054.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}