{
  "chapter": "يس",
  "text": "وما علمنه الشعر وما ينۢبغى له ان هو الا ذكر وقرءان مبين",
  "translations": [
    {
      "translation": "We did not teach him poetry nor would it be right for him. It is simply a reminder and a clear Qur'an",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not taught (Muhammad) to versify, nor is it worthy of him. This is nothing but a reminder and illuminating discourse,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not teach him (to wit, the Messenger) poetry and it does not behove him. This is none but an Admonition, and a Clear Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not teach him (Muhammad) poetry, nor was he supposed to be a poet. It is only the word (of God) and the illustrious Quran\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not taught him (Prophet Mohammed- peace and blessings be upon him) to recite poetry, nor does it befit him; it is nothing but an advice and the bright Qur’an.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not taught him poetry, nor is it suitable for him. This is only a Reminder and a plain Qur'an.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not taught him poetry, nor is it meet for him; it is nothing but a reminder and a plain Quran,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not taught him poetry; it is not seemly for him. It is only a Remembrance and a Clear Koran,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not taught him (Muhammad) poetry, nor is it meet for him. This is naught else than a Reminder and a Lecture making plain,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not taught him any poetry nor would it be fitting for him. This is merely a Reminder and a clear Quran\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not taught him poetry, nor it befitteth him. This is but an admonition and a Recital luminous:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not teach him poetry, nor does it behoove him. This is just a reminder and a manifest Quran,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not instructed the (Prophet) in Poetry, nor is it meet for him: this is no less than a Message and a Qur'an making things clear:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not taught him (Muhammad SAW) poetry, nor is it meet for him. This is only a Reminder and a plain Quran.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not taught him (Prophet Muhammad) poetry, nor does it become him. This is only a Remembrance and a Clear Holy Reading (Koran)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not teach him poetry, nor is it proper for him. It is only a reminder, and a Clear Quran.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not give Prophet Muhammad, knowledge of poetry, nor is it befitting for him. It is not but a message and a clear Qur'an\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:69] And We did not teach him, that is, the Prophet, poetry — this was [revealed] to refute their saying, ‘This Qur’ān that he has brought is but poetry!’ — nor is it, poetry, seemly, [nor is it] facilitated, for him. It — that which he has brought — is just Remembrance, an admonition, and a Qur’ān that clarifies, that manifests [God’s] rulings and other matters;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And we have not taught him) i.e. Muhammad (pbuh) (poetry, nor is it meet for him) poetry is not appropriate for him. (This is) i.e. the Qur'an (naught else than a Reminder) an admonition (and a Lecture making plain) the lawful and unlawful, the commands and prohibitions,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما قال كفار مكة خذلهم الله: إن محمداً شاعر، وما جاء به مفترى إلى ربه من جملة الأشعار والقياسات المخيلة المشتملة على الترغيبات والتنفيرات والمواعيد والوعيدات، وإدِّعاء النبوة والوحي والمعجزة ما هو إلا قول باطل وزور ظاهر\n\n\n\n\nرد الله عليهم قولهم هذا على وجه المبالغة والتأكيد فقال: { وَمَا عَلَّمْنَاهُ ٱلشِّعْرَ } أي: ما جعلنا فطرته الأصلية واستعداده الجبلي قابلة على القياسات الشعرية المبنية على محض الكذب والخيال والمرغب أو المنفر، بل ما جعلناها إلا منزهة عنها، بريئة عن أمثالها، طاهرة عن أدناس الطبيعة مطلقاً، خالصة عن شوائب الإمكان ولوث الجهل والتقليد، متحلية باليقين والبرهان المنتهي إلى الكشف والعيان، ثم إلى الحق الذي هو منتهى الأمر في باب العرفان، بل { وَمَا يَنبَغِي لَهُ } ويليق بشأنه وبشأن كتابه أن ينسب هو وهو إلى الشعر والشعراء اللذين هما أبعد بمراحل عن ساحة جلالهما، بل { إِنْ هُوَ } أي: ما الكلام المنزل على خير الأنام { إِلاَّ ذِكْرٌ } عظة وتذكير ناشئ عن العلم والحكمة المتقنة الإلهية مشير إلى التوحيد الذاتي، منبه عليه { وَقُرْآنٌ مُّبِينٌ } [يس: 69] مشتمل على أحكام ظاهره وآيات واضحة وبينات لائحة، محتوية على الأوامر والنواهي الإلهية، والحدود والقوانين الموضوعة بالوضع الإلهي بين عباده؛ ليوصلهم إلى طريق توحيده، منزلة على رسوله المستعد لحمله وقبوله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما علَّمناه الشِّعْرَ } أي: وما علّمنا نبينا محمداً الشعر، حتى يقدر أن يقول شعراً، فيُتهم على القرآن، أو: وما علّمناه بتعلُّم القرآن الشعر، على معنى: أن القرآن ليس بشعر، فإنه غير مقفّى ولا موزون، وليس معناه ما يتوقاه الشعراء من التخييلات المرغبة والمنفرة ونحوها\n فأين الوزن فيه؟ وأين التقفيه؟ فلا مناسبة بينه وبين كلام الشعراء، { وما ينبغي له } أي: وما يليق بحاله، ولا يتأتى له لو طلبه، أي: جعلناه بحيث لو أراد قَرْضَ الشعر لم يتأتّ له، ولم يسهل، كما جعلناه أُميًّا لم يهتدِ إلى الخط لتكون الحجة أثبت، والشبهة أدحض\n وأما قوله ـ عليه الصلاة والسلام ـ:\n\n \" أَنَا النَّبِيُّ لاَ كَذِبْ، أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ \" \n\n، وقوله:\n\n \" هَلْ أَنْتِ إِلاَّ إِصبعٌ دَمِيتِ، وفِي سَبِيلِ الله ما لَقِيتِ \" \n\n، فهو مما اتفق وزنه من غير قصد، كما يتفق في خطاب الناس ورسائلهم ومحاوراتهم، ولا يسمى شعراً إلا ما قصد وزنه\n ولَمَّا نفى القرآن أن يكون من جنس الشعر، قال: { إِن هو إِلا ذِكْرٌ } أي: ما الذي يُعلِّم ويقوله إلا ذكر من الله، يُوعظ به الإنس والجن، { وقرآنٌ } أي: كتاب سماوي، يُقرأ في المحاريب، ويُتلى في المتعبّدات، ويُنال بتلاوته والعملِ به أعلا الدرجات\n فكم بينه وبين الشعر، الذي هو من همزات الشيطان؟!",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:49",
      "similarity": 0.5819927086673254
    },
    {
      "verse": "26:113",
      "similarity": 0.5232151974622711
    },
    {
      "verse": "69:41",
      "similarity": 0.5072311083659711
    },
    {
      "verse": "22:32",
      "similarity": 0.4923604304058121
    },
    {
      "verse": "37:36",
      "similarity": 0.43041168405988445
    }
  ]
}