{
  "chapter": "يس",
  "text": "ومن نعمره ننكسه فى الخلق افلا يعقلون",
  "translations": [
    {
      "translation": "When We grant long life to people, We return them to their primal state. So will you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever reaches old age, We reverse in natural disposition. Do they not have sense (to see)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomsoever We grant a long life, We reverse him in his constitution. Do they still not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The physical growth of those whom We grant a long life will be reversed. Will you then not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomever We bring to an old age, We reverse him in creation; so do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whom We grant long life -- We reverse him in creation. Will they not then understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever We cause to live long, We reduce (him) to an abject state in constitution; do they not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to whomsoever We give long life, We bend him over in His constitution; what, do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He whom we bring unto old age, We reverse him in creation (making him go back to weakness after strength). Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We extend anyone's life, We reverse his development. Can they not use their reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever We grant long life, We reverse him in creation. Reflect then they not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomever We give a long life, We cause him to regress in creation. Then, will they not exercise their reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We grant long life to any, We cause him to be reversed in nature: Will they not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whom We grant long life, We reverse him in creation (weakness after strength). Will they not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whoever We give a long life We make him stoop. Do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomever We grant old age, We reverse his development. Do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he to whom We grant long life We reverse in creation; so will they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:68] And whomever We give long life, by prolonging his term [of life], We cause him to regress (nankushu; a variant reading has [2nd verbal form] nunakkishu, derived from al-tankīs) in creation, that is, in terms of his physical form, so that after having enjoyed strength and youth, he becomes feeble and decrepit. Will they then not understand?, that One Who is able to effect such [a state] — with which they are familiar — is also able to resurrect, that they might then become believers? (a variant reading [for ya‘qilūna, ‘they understand’] has [the second person plural] ta‘qilūna, ‘you understand’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَنْ نُعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ أَفَلَا يَعْقِلُونَ (68)قد يلوح في بادىء الرأي أن موقع هذه الآية كالغريب عن السياق فيظن ظانّ أنها كلام مستأنف انتقل به من غرض الحديث عن المشركين وأحوالهم والإِملاء لهم إلى التذكير بأمر عجيب من صنع الله حتى يخال أن الذي اقتضى وقوع هذه الآية في هذا الموقع أنها نزلت في تِباع نزول الآيات قبلها لسبب اقتضى نزولها .فجعل كثير من المفسرين موقعها موقع الاستدلال على أن قدرة الله تعالى لا يستصعب عليها طمس أعينهم ولا مسخهم كما غيّر خلقة المعمرين من قوة إلى ضعف ، فيكون قياس تقريب من قبيل ما يسمى في أصول الفقه بالقياس الخَفيّ وبالأدْوَن ، فيكون معطوفاً على علة مقدرة في الكلام كأنه قيل : لو نشاء لطمسنا الخ لأنا قادرون على قلب الأحوال ، ألا يرون كيف نقلب خلق الإِنسان فنجعله على غير ما خلقناه أولاً . وبعد هذا كله فموقع واو العطف غير شديد الانتظام . وجعلها بعض المفسرين واقعة موقع الاستدلال على المكان البعيد ، أي أن الذي قدر على تغيير خلقهم من شباب إلى هرم قادر على أن يبعثهم بعد الموت فهو أيضاً قياس تقريب بالخفيّ وبالأدون .ومنهم من تكلم عليها معرضاً عما قبلها فتكلموا على معناها وما فيها من العبرة ولم يبيّنوا وجه اتصالها بما قبلها . ومنهم من جعلها لقطع معذرة المشركين في ذلك اليوم أن يقولوا : ما لبثنا في الدنيا إلاّ عمراً قليلاً ولو عُمِّرنا طويلاً لما كان منا تقصير ، وهو بعيد عن مقتضى قوله : { نَنْكُسْهُ في الخَلْقِ } . وكل هذه التفاسير تحوم حول جعل الخلق بالمعنى المصدري ، أي في خلقته أو في أثر خلقه .وكل هذه التفسيرات بعيد عن نظم الكلام ، فالذي يظهر أن الذي دفع المفسرين إلى ذلك هو ما ألِفه الناس من إطلاق التعمير على طول عمر المُعمّر ، فلما تأولوه بهذا المعنى ألحقوا تأويل { نَنْكُسْهُ في الخَلْقِ } على ما يناسب ذلك .والوجه عندي أن لكون جملة { ومَن نُعَمِرهُ } عطفاً على جملة { ولو نشَاءُ لمَسخْناهُم على مكانتِهم } \\[ يس : 67 \\] فهي جملة شرطية عطفت على جملة شرطية ، فالمعطوف عليها جملة شرط امتناعي والمعطوفة جملة شرط تعليقي ، والجملة الأولى أفادت إمهالهم والإِملاء لهم ، والجملة المعطوفة أفادت إنذارهم بعاقبة غير محمودة ووعيدَهم بحلولها بهم ، أي إن كنا لم نمسخهم ولم نطمس على عيونهم فقد أبقيناهم ليكونوا مغلوبين أذلة ، فمعنى { ومَن نُّعَمِرْهُ } من نعمره منهم .فالتعمير بمعنى الإبقاء ، أي من نُبْقِيه منهم ولا نستأصله منهم ، أي من المشركين فجعله بين الأمم دليلاً ، فالتعمير المرادُ هنا كالتعمير الذي في قوله تعالى : { أولم نعمركم ما يتذكر فيه من تذكر } \\[ فاطر : 37 \\] ، بأن معناها : ألم نبقكم مدة من الحياة تكفي المتأمل وهو المقدر بقوله : { ما يتذكر فيه من تذكر } .وليس المراد من التعمير فيها طول الحياة وإدراك الهرم كالذي في قولهم : فلان من المُعَمَّرين ، فإن ذلك لم يقع بجميع أهل النار الذين خوطبوا بقوله : { أولم نعمركم . وقد طويت في الكلام جملة تقديرها : ولو نشاء لأهلكناهم ، يدل عليها قوله : ومن نعمره } أي نبقه حياً .والنكس : حقيقته قلب الأعلى أسفل أو ما يقرب من الأسفل ، قال تعالى : { ناكسوا رؤوسهم } \\[ السجدة : 12 \\] . ويطلق مجازاً على الرجوع من حال حسنة إلى سيئة ، ولذلك يقال : فلان نكِس ، إذا كان ضعيفاً لا يرجى لنجدة ، وهو فَعِل بمعنى مفعول كأنه منكوس في خلائق الرجولة ، ف { ننكسْهُ } مجاز لا محالة إلا أنا نجعله مجازاً في الإِذلال بعد العزة وسوء الحالة بعد زهرتها .و { الخلق } : مصدر خلقه ، ويطلق على المخلوق كثيراً وعلى الناس . وفي حديث عائشة عن الكنيسة التي رأتها أم سلمة وأم حبيبة بالحبشة قال النبي صلى الله عليه وسلم « وأولئك شرار الخلق عند الله يوم القيامة » أي شرار الناس .ووقوع حرف { في } هنا يعين أن الخلق هنا مراد به الناس ، أي تجعله دليلاً في الناس وهو أليق بهذا المعنى دون معنى في خلقته لأن الإِنكاس لا يكون في أصل الخلقة وإنما يكون في أطوارها ، وقد فسر بذلك قوله تعالى : { وزادكم في الخلق بسطة } \\[ الأعراف : 69 \\] أي زادكم قوة وسعة في الأمم ، أي في الأمم المعاصرة لكم ، فهو وعيد لهم ووعد للمؤمنين بالنصر على المشركين ووقوعهم تحت نفوذ المسلمين ، فإن أولئك الذين كانوا رؤوساً للمشركين في الجاهلية صاروا في أسر المسلمين يوم بدر وفي حكمهم يوم الفتح فكانوا يُدْعَون الطلقاء .وقرأ الجمهور : { نَنْكُسْه بفتح النون الأولى وسكون النون الثانية وضمّ الكاف مخففة وهو مضارع نكس المتعدّي ، يقال : نكس رأسه . وقرأه عاصم وحمزة بضم النون الأولى وفتح النون الثانية وكسر الكاف مشددة مضارع نكس المضاعف .وفرّع على الجمل الشرطية الثلاث وما تفرع عليها قوله : أفَلاَ يَعْقِلُونَ } استئنافاً إنكارياً لعدم تأملهم في عظيم قدرة الله تعالى الدالة على أنه لو شاء لطمَس على أعينهم ولو شاء لمسخهم على مكانتهم ، وأنه إن لم يفعل ذلك فإنهم لا يسلمون من نصره المسلمين عليهم لأنهم لو قاسوا مقدورات الله تعالى المشاهدة لهم لعلموا أن قدرته على مسخهم فما دونه من إنزال مكروه بهم أيسر من قدرته على إيجاد المخلوقات العظيمة المتقنة وأنه لا حائل بين تعلق قدرته بمسخهم إلا عدم إرادته ذلك لحكمة علمها فإن القدرة إنما تتعلق بالمقدورات على وفق الإرادة .وقرأ نافع وابن ذكوان عن أبي عامر وأبو جعفر { أَفَلا تَعْقلُونَ } بتاء الخطاب وهو خطاب للذين وجه إليهم قوله : { ولو نشاء لطمسنا على أعينهم } \\[ يس : 66 \\] الآية . وقرأ الباقون بياء الغيبة لأن تلك الجمل الشرطية لا تخلو من مواجهة بالتعريض للمتحدث عنهم فكانوا أحرياء أن يعقلوا مغزاها ويتفهموا معناها .\n\n",
      "translations": [
        {
          "translation": "(He whom We bring unto old age, We reverse him in creation (making him go back to weakness after strength)) until he becomes like a little child, possessing no teeth or power, he urinates and defecates on himself like a young child. (Have ye then no sense) do you then not believe in this?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نقدر على الطمس والمسخ مع أنَّا بمقتضى قدرتنا وقوتنا { مَن نُّعَمِّرْهُ } منهم\n ونطيل عمره في الدنيا { نُنَكِّـسْهُ فِي ٱلْخَلْقِ } ونضعفه بالآخرة إلى أن نرده إلى أرذل العمر\n لكيلا يعلم بعد علم شيئاً\n ثم نميت الكل ونصيرهم تراباً وعظاماً\n ولا شك أن من قدر على الإحياء والإماتة والتطويل والتنكيس\n قادر على المسخ والتطميس\n فمن أين يتأتى لهم أن ينكروا قدرتنا واختيارنا في أفعالنا\n واستقلالنا في تصرفات ملكنا وملكوتنا؟! { أَفَلاَ يَعْقِلُونَ } [يس: 68] ويتأملون آثار قدرتنا الكاملة الظاهرة على الآفاق والأنفس أولئك العقلاء المتأملون حتى يتفطنوا ويتيقنوا بها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفلا يعقلون } أنّ مَن قدر أن ينقلهم من الشباب إلى الهرم\n ومن القوة إلى الضعف\n ومن رجاحة العقل إلى الخرف وقلة التمييز\n قادرٌ على أن يطمسَ على أعينهم\n ويمسخهم على مكانتهم\n ويبعثهم بعد الموت\n الإشارة: ولو نشاء لطمسنا على أعينهم\n فلا يهتدون إلى طريق السلوك\n ولا يسلكونها\n فيبقوا في الحجاب على الدوام\n ولو نشاء لمسخنا قلوبهم على مكانتهم\n من رجاحة العقل والفهم\n فلا يتدبّرون إلا في الأمور الحسية\n فلا يستطيعون مُضيًّا في بلاد المعاني\n ولا رجوعاً عن الحسيّات\n ومَن نُعَمّره من هؤلاء نُنكّسْهُ في الخلق\n فيلحقه الخرف والضعف\n وأما مَن اهتدى إلى طريق السير\n وسلك بلاد المعاني\n فلا يزيده طول العمر إلا رجاحةً في العقل\n وقوةً في العلم\n وتمكيناً في المعاني والمعرفة\n قال القشيري: ومَن نُعَمِّرْهُ ننكِّسْه في الخلق: نرده إلى العكس\n فكما كان يزداد في القوة\n يأخذ في النقصان\n إلى أن يبلغَ أرذلَ العُمر\n فيصير إلى مثل حال الطفولية من الضعف\n ثم لا يبقى بعد النقصان شيءٌ\n كما أنشدوا:\nوهذا في الجثة والمباني\n دون الأحوال والمعاني\n فإن الأحوال ـ في حق الجثة ـ في الزيادة إلى بلوغ حَد الخَرَفِ\n فيَخْتَلُّ رأيُه وعَقْلُه\n وأصحاب الحقائق تشيب ذوائبُهم\n ولكنَّ محابَّهم ومعانيَهم في عنفوان شبابها\n وطراوة جدَّتها\n هـ\n ثم أنكر على من رمى القرآن بكونه شعراً\n فقال: { وَمَا عَلَّمْنَاهُ ٱلشِّعْرَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:12",
      "similarity": 0.7336746841299469
    },
    {
      "verse": "21:65",
      "similarity": 0.731642638187814
    },
    {
      "verse": "10:16",
      "similarity": 0.2592741225483195
    },
    {
      "verse": "52:4",
      "similarity": 0.21783711292590757
    },
    {
      "verse": "9:17",
      "similarity": 0.18185359730651976
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/036068.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/036068.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:68.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}