{
  "chapter": "يس",
  "text": "الم اعهد اليكم يبنى ءادم ان لا تعبدوا۟ الشيطن انه لكم عدو مبين",
  "translations": [
    {
      "translation": "Did I not make a contract with you, tribe of Adam, not to worship Shaytan, who truly is an outright enemy to you,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not commit you, O children of Adam, not to worship Satan who is your acknowledged foe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, did I not command you not to serve Satan -- he is to you an open enemy\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, did We not command you not to worship satan. He was your sworn enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Descendants of Adam! Did I not take a covenant from you that you shall not worship the devil? Undoubtedly, he is your open enemy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not command you, O Children of Adam, that you should not worship Shaytan Verily, he is a plain enemy to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not charge you, O children of Adam! that you should not serve the Shaitan? Surely he is your open enemy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Made I not covenant with you, Children of Adam, that you should not serve Satan -- surely he is a manifest foe to you --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not charge you, O ye sons of Adam, that ye worship not the devil - Lo! he is your open foe! -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not enjoin you, sons of Adam, not to worship Satan -- for he is your sworn enemy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoined I not on you, ye children of Adam, that ye shall not worship the Satan - verily he is Unto you manifest foe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Did I not exhort you, O children of Adam, saying, “Do not worship Satan. He is indeed your manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not enjoin on you, O ye Children of Adam, that ye should not worship Satan; for that he was to you an enemy avowed?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not ordain for you, O Children of Adam, that you should not worship Shaitan (Satan). Verily, he is a plain enemy to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, did I not make a covenant with you, that you should not worship satan he is surely a clear enemy to you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not covenant with you, O Children of Adam, that you shall not serve the devil? That he is your sworn enemy?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did I not enjoin upon you, O children of Adam, that you not worship Satan - [for] indeed, he is to you a clear enemy -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:60] Did I not charge you, command you, O children of Adam, by the tongues of My messengers, that you should not worship Satan, [that you should] not obey him; truly he is a manifest enemy to you, one whose enmity is evident,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He will also say to them: (Did I not charge you) did I not present to you, in the Scripture brought by the Messenger, (0 ye sons of Adam, that ye worship not the devil) that you should not obey the devil. (Lo! he is your open foe) whose enmity is quite manifest!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إنما أحذركم يا ابن آدم عن إطاعته وانقياده { إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ } [يس: 60] ظاهر العداوة يريد أن يصدكم عمَّا جبلتم عليه بإغرائه وإغوائه\n\n\n{ وَأَنِ ٱعْبُدُونِي } ووحدوني\n واعتقدوا كمال أسمائي وأوصافي واستقلالي في عموم تدبيراتي وتصرفاتي في ملكي وملكوتي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله، في توبيخ الكفرة يوم القيامة: { أَلَمْ أعهدْ إِليكم يا بني آدمَ ألا تعبدوا الشيطان إِنه لكم عدو مبين } يقال: عهِد إليه: إذا وصّاه\n وهذا العهد إما على ألسنة الرسل، أو: يوم: { ألست بربكم } ، أو: ما نصبه لهم من الحُجج العقلية، والدلائل السمعية، الآمرة بعبادته، الزاجرة عن عبادة غيره\n وعبادة الشيطان: طاعته فيما يُوسوس به إليهم، ويُزيِّنه لهم\n { وأن اعبدوني }: عطف على { ألاَّ تعبدوا } ، أي: عهدنا إليكم ألاَّ تُطيعوا الشيطان ووحّدوني، وأطيعوني، { هذا صراطٌ مستقيم } إشارة إلى ما عهد إليهم فيه من معصية الشيطان، وطاعة الرحمن، أي: هذا طريق بليغ في الاستقامة، لا طريق أقوم منه\n وفيه إشارة إلى جنايتهم على أنفسهم بعد النصح التام، فلا حجة بعد الإعذار، ولا ظلم بعد التذكير والإنذار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:115",
      "similarity": 0.4214628522220794
    },
    {
      "verse": "2:37",
      "similarity": 0.4082308751885105
    },
    {
      "verse": "5:27",
      "similarity": 0.40543856389712085
    },
    {
      "verse": "2:31",
      "similarity": 0.39275461947690604
    },
    {
      "verse": "7:35",
      "similarity": 0.38400192770921937
    }
  ]
}