{
  "chapter": "يس",
  "text": "ولو نشاء لمسخنهم على مكانتهم فما استطعوا۟ مضيا ولا يرجعون",
  "translations": [
    {
      "translation": "If We wished, We could transform them where they stand so they would neither be able to go out nor return.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We pleased We could paralyse them in their tracks, and they would not be able to move forward or turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We so willed, We would have transformed them where they were so that they would not go forward or backward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We could have turned them into other creatures on the spot had We wanted and they would not have been able to precede or turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We could have disfigured their faces while they were in their homes, therefore unable to go forward or turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it had been Our will, We could have transformed them in their places. Then they would have been unable to go forward (move about) nor they could have turned back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We please We would surely transform them in their place, then they would not be able to go on, nor will they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We will, We would have changed them where they were, then they could not go on, nor could they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We verily could have fixed them in their place, making them powerless to go forward or turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had been Our will, We could have paralysed them where they stood, so that they would not be able to go forward or turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We listed, surely We should transform them in their places, so that they would be able neither to go forward nor to return\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We wished We would have deformed them in their place; then they would neither have been able to move ahead nor to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it had been Our Will, We could have transformed them (to remain) in their places; then should they have been unable to move about, nor could they have returned (after error).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it had been Our Will, We could have transformed them (into animals or lifeless objects) in their places. Then they should have been unable to go forward (move about) nor they could have turned back. [As it happened with the Jews see Verse 7:166 The Quran].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been Our will We would have transmuted them (into monkeys, pigs and stones) where they were, so that they could neither go forward nor yet return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We will, We can cripple them in their place; so they can neither move forward, nor go back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed, We could have deformed them, [paralyzing them] in their places so they would not be able to proceed, nor could they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:67] And had We willed We would have transformed them, [into] apes or swine or stones, in their place   (makānatihim, variant reading has makānātihim, the plural of makāna, meaning makān, in other words ‘in their dwellings’); then they would have neither been able to go ahead nor to return, in other words, they would not then be able to come and go.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And had We willed, We verily could have fixed them in their place) We could have turned them into apes and swine in their own homes, (making them powerless to go forward) making them unable to come and go (or turn back) to their initial state.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَوْ نَشَآءُ لَمَسَخْنَاهُمْ عَلَىٰ مَكَـانَتِهِمْ } فالمَكانُ والمَكانةُ: واحدٌ\n ومَسخناهُمْ: معناه أَقعدناهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And if We had willed, We could have destroyed them where they stood}, the place and the location are one.\n We will punish them: We will sit them down",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { وَلَوْ نَشَآءُ } أي: نسقطهم عن ربقة التكليف ودرجة الاعتبار { لَمَسَخْنَاهُمْ } وأخرجناهم عن رتبة الإنسانية إلى الحيوانية\n بل عن الحيوانية إلى الجمادية أيضاً\n إلى أن صاروا جامدين خامدين { عَلَىٰ مَكَـانَتِهِمْ } كالجمادات الأخر بحيث لا يسع أن يتحولوا عنها أصلاً { فَمَا ٱسْتَطَاعُواْ مُضِيّاً وَلاَ يَرْجِعُونَ } [يس: 67] يعني: لو نشاء مسخناهم وأخرجناهم عن رتبة الخلافة والنيابة وفطرة التكليف والتوحيد\n لصيرناهم جمادات لا قدرة لهم على الذهاب والإياب أصلاً\n\nوبالجملة: هم بسبب أعمالهم الفاسدة وأفعالهم القبيحة وأوصافهم الذميمة وأخلاقهم الغير مرضية أحقاء أن يُفعل لهم ما ذكرنا\n لكن سبقت رحمتنا واقتضت حكمتنا أن نمهلهم زماناً إلى أن يتنبهوا أو يتولد منهم من يتنبه ويتفطن\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو نشاء لَمَسَخْناهم } قردة، وخنازير، أو حجارة، { على مكانتهم }: على منازلهم، وفي ديارهم، حيث يأمنون من المكاره\n والمكانة والمكان واحد، كالمقامة والمقام\n { فما استطاعوا مُضيًّا ولا يرجِعُون } فلم يقدروا على ذهاب ومجيء، أو: مُضِياً أمامهم، ولا يرجعون خلفهم\n والمعنى: أنهم لكفرهم ونقضهم ما عهد إليهم أحقاء بأن نفعل بهم ذلك، لكنا لم نفعل لشمول الرحمة لهم، واقتضاء الحكمة إمهالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:8",
      "similarity": 0.2513019299042269
    },
    {
      "verse": "8:38",
      "similarity": 0.24011137875502284
    },
    {
      "verse": "15:65",
      "similarity": 0.19953885288597356
    },
    {
      "verse": "18:60",
      "similarity": 0.1686489437847435
    },
    {
      "verse": "31:15",
      "similarity": 0.0313073542653061
    }
  ]
}