{
  "chapter": "يس",
  "text": "ولو نشاء لطمسنا على اعينهم فاستبقوا۟ الصرط فانى يبصرون",
  "translations": [
    {
      "translation": "If We wished, We could put out their eyes. Then, though they might race for the path, how would they see?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We could take away their sight if We pleased; then they would run around to find the way: But how then would they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We so willed, We would have put out their eyes, then they would rush to see the Way, but how would they be able to see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We could have blinded them had We wanted. Then they would have raced along to cross the Bridge but how could they have seen (their way)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We could have quenched their eyes so they would rush towards the path, unable to see a thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it had been Our will, We would surely have wiped out their eyes, so that they would struggle for the path, how then would they see\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We please We would certainly put out their eyes, then they would run about groping for the way, but how should they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We will, We would have obliterated their eyes, then they would race to the path, but how would they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We verily could have quenched their eyesight so that they should struggle for the way. Then how could they have seen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had been Our will, We could have put out their eyes. They would have struggled to find the way, but how could they have seen it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We listed, surely We should wipe out their eyes so that they would struggle for the way how then would they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wished We would have blotted out their eyes: then, were they to advance towards the path, how would have they seen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had been our Will, We could surely have blotted out their eyes; then should they have run about groping for the Path, but how could they have seen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it had been Our Will, We would surely have wiped out (blinded) their eyes, so that they would struggle for the Path, how then would they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been Our will We would have obliterated their sight so that they raced to the Path. But, how would they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can blind their eyes as they rush towards the path—but how will they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed, We could have obliterated their eyes, and they would race to [find] the path, and how could they see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:66] And had We willed We would have obliterated their eyesight, We would have rendered them blind by obliterating them, then, they [would have tried to] advance towards the path, to be on their way as usual, but how would they have seen?, then. In other words, they would not have been to see.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "502 (And had We willed, We verily could have quenched their eyesight) verily, We would have quenched the eyes of their error (so that they should struggle for the way) so that they would see the way. (Then how could they have seen) how could they see the way when their error has not been removed?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nو: { لَطَمَسْنَا عَلَىٰ أَعْيُنِهِمْ } معناه تَركناهُمْ عمياً يترددون\n\n",
      "translations": [
        {
          "translation": " We { have blinded their eyes }. This means we have left them in darkness to wander aimlessly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه إظهاراً لكمال قدرته واختباره: { وَ } كما ختمنا على أفواههم حينئذ وطبعنا على قلوبهم قبل ذلك حينما قبلوا دعوة الرسل { لَوْ نَشَآءُ } أن نعيمهم ونذهب بأبصارهم { لَطَمَسْنَا عَلَىٰ أَعْيُنِهِمْ } وصيرناها مطموسة ممسوحة كسائر أعضائهم\n بحيث لا يبدو لها جفن ولا شق { فَٱسْتَبَقُواْ } وبادروا { ٱلصِّرَاطَ } والطريق المعهود لهم\n وهم قد مروا عليها مراراً كثيرة { فَأَنَّىٰ يُبْصِرُونَ } [يس: 66] فكيف يبصرون بعدما صاروا مطموسين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولم نشاءُ لطَمَسْنَا على أعيُنِهِم } اليوم، أي: أعميناهم وأذهبنا أبصارهم\n والطمس: سد شق العين حتى تعود ممسوخة\n { فاستَبَقُوا الصِّرَاطَ } على حذف الجار، وإيصال الفعل، أي: فاستبقوا إلى الطريق الذي اعتادوا سلوكه، وبادَروا إليه لِما يلحقهم من الخوف، { فأنَّى يُبصرون } فكيف يُبصرون حينئذ من جهة سلوكهم، فيضلون في طريقهم عن بلوغ أملهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:8",
      "similarity": 0.669885049843717
    },
    {
      "verse": "10:88",
      "similarity": 0.5910479847359842
    },
    {
      "verse": "54:37",
      "similarity": 0.5830239105164413
    },
    {
      "verse": "4:47",
      "similarity": 0.49329464822005126
    },
    {
      "verse": "44:13",
      "similarity": 0.19726666224423142
    }
  ]
}