{
  "chapter": "يس",
  "text": "ومن نعمره ننكسه فى الخلق افلا يعقلون",
  "translations": [
    {
      "translation": "When We grant long life to people, We return them to their primal state. So will you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever reaches old age, We reverse in natural disposition. Do they not have sense (to see)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomsoever We grant a long life, We reverse him in his constitution. Do they still not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The physical growth of those whom We grant a long life will be reversed. Will you then not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomever We bring to an old age, We reverse him in creation; so do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whom We grant long life -- We reverse him in creation. Will they not then understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever We cause to live long, We reduce (him) to an abject state in constitution; do they not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to whomsoever We give long life, We bend him over in His constitution; what, do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He whom we bring unto old age, We reverse him in creation (making him go back to weakness after strength). Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We extend anyone's life, We reverse his development. Can they not use their reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever We grant long life, We reverse him in creation. Reflect then they not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomever We give a long life, We cause him to regress in creation. Then, will they not exercise their reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We grant long life to any, We cause him to be reversed in nature: Will they not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whom We grant long life, We reverse him in creation (weakness after strength). Will they not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whoever We give a long life We make him stoop. Do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomever We grant old age, We reverse his development. Do they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he to whom We grant long life We reverse in creation; so will they not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:68] And whomever We give long life, by prolonging his term [of life], We cause him to regress (nankushu; a variant reading has [2nd verbal form] nunakkishu, derived from al-tankīs) in creation, that is, in terms of his physical form, so that after having enjoyed strength and youth, he becomes feeble and decrepit. Will they then not understand?, that One Who is able to effect such [a state] — with which they are familiar — is also able to resurrect, that they might then become believers? (a variant reading [for ya‘qilūna, ‘they understand’] has [the second person plural] ta‘qilūna, ‘you understand’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He whom We bring unto old age, We reverse him in creation (making him go back to weakness after strength)) until he becomes like a little child, possessing no teeth or power, he urinates and defecates on himself like a young child. (Have ye then no sense) do you then not believe in this?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نقدر على الطمس والمسخ مع أنَّا بمقتضى قدرتنا وقوتنا { مَن نُّعَمِّرْهُ } منهم\n ونطيل عمره في الدنيا { نُنَكِّـسْهُ فِي ٱلْخَلْقِ } ونضعفه بالآخرة إلى أن نرده إلى أرذل العمر\n لكيلا يعلم بعد علم شيئاً\n ثم نميت الكل ونصيرهم تراباً وعظاماً\n ولا شك أن من قدر على الإحياء والإماتة والتطويل والتنكيس\n قادر على المسخ والتطميس\n فمن أين يتأتى لهم أن ينكروا قدرتنا واختيارنا في أفعالنا\n واستقلالنا في تصرفات ملكنا وملكوتنا؟! { أَفَلاَ يَعْقِلُونَ } [يس: 68] ويتأملون آثار قدرتنا الكاملة الظاهرة على الآفاق والأنفس أولئك العقلاء المتأملون حتى يتفطنوا ويتيقنوا بها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن نُعَمِّرْهُ } نُطِل عمره { نُنكِّسْهُ في الخلقِ } نقلبه فيه\n وقرأ عاصم وحمزة بالتشديد\n والنكس والتنكيس: جعل الشيء أعلاه أسفله\n والمعنى: مَن أطلنا عمره نكَسنا خلقه، وهو نوع من المسخ، فصار بدل القوة ضعفاً، وبدل الشباب هرماً، وذلك أنا خلقناه على ضعف في جسده، وخلو من عقل وعلم، ثم جعلناه يتزايدُ إلى أن يبلغ أشده، ويستكمل قوته، ويعْقل، ويعلم ما له وعليه، فإذا انتهى نكّسناه في الخلق، فجعلناه يتناقصُ حتى يرجع إلى حال شبيهة بحال الصبيّ، في ضعف جسده، وقلّة عقله، وخلوّه من العلم، كما ينكس السهم، فيجعل أعلاه أسفله\n قال تعالى:\n\n[النحل: 70]\n قال ابن عباس: \" مَن قرأ القرآن ـ أي وعمل به ـ لم يرد إلى أرذل العمر \"\n { أفلا يعقلون } أنّ مَن قدر أن ينقلهم من الشباب إلى الهرم، ومن القوة إلى الضعف، ومن رجاحة العقل إلى الخرف وقلة التمييز، قادرٌ على أن يطمسَ على أعينهم، ويمسخهم على مكانتهم، ويبعثهم بعد الموت\n الإشارة: ولو نشاء لطمسنا على أعينهم، فلا يهتدون إلى طريق السلوك، ولا يسلكونها، فيبقوا في الحجاب على الدوام\n ولو نشاء لمسخنا قلوبهم على مكانتهم، من رجاحة العقل والفهم، فلا يتدبّرون إلا في الأمور الحسية، فلا يستطيعون مُضيًّا في بلاد المعاني، ولا رجوعاً عن الحسيّات\n ومَن نُعَمّره من هؤلاء نُنكّسْهُ في الخلق، فيلحقه الخرف والضعف، وأما مَن اهتدى إلى طريق السير، وسلك بلاد المعاني، فلا يزيده طول العمر إلا رجاحةً في العقل، وقوةً في العلم، وتمكيناً في المعاني والمعرفة\n قال القشيري: ومَن نُعَمِّرْهُ ننكِّسْه في الخلق: نرده إلى العكس، فكما كان يزداد في القوة، يأخذ في النقصان، إلى أن يبلغَ أرذلَ العُمر، فيصير إلى مثل حال الطفولية من الضعف، ثم لا يبقى بعد النقصان شيءٌ، كما أنشدوا:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:12",
      "similarity": 0.7336746841299469
    },
    {
      "verse": "21:65",
      "similarity": 0.731642638187814
    },
    {
      "verse": "10:16",
      "similarity": 0.2592741225483195
    },
    {
      "verse": "52:4",
      "similarity": 0.21783711292590757
    },
    {
      "verse": "9:17",
      "similarity": 0.18185359730651976
    }
  ]
}