{
  "chapter": "يس",
  "text": "اولم ير الانسن انا خلقنه من نطفة فاذا هو خصيم مبين",
  "translations": [
    {
      "translation": "Does not man see that We created him from a drop yet there he is, an open antagonist!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not man see We created him from a drop of semen? Even then he becomes an open contender,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does man not see that We created him of a sperm drop, and lo! he is flagrantly contentious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the human being not considered that We have created him from a drop of fluid. He is openly quarrelsome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And did not man see that We have created him from a drop of semen? Yet he is an open quarreller!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not man see that We have created him from Nutfah. Yet behold he (stands forth) as an open opponent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not man see that We have created him from the small seed? Then lo! he is an open disputant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not man regarded how that We created him of a sperm-drop? Then lo, he is a manifest adversary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not man seen that We have created him from a drop of seed? Yet lo! he is an open opponent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not man see that We created him from a drop. Yet there he is, flagrantly contentious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest not man that We have created him from a sperm? Yet lo! he is a manifest disputer?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not man see that We created him from a drop of [seminal] fluid, and, behold, he is an open contender!?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Doth not man see that it is We Who created him from sperm? yet behold! he (stands forth) as an open adversary!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not man see that We have created him from Nutfah (mixed male and female discharge semen drops). Yet behold! He (stands forth) as an open opponent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the human not seen how We created him from a drop (of sperm)? Yet he is a clear opponent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does the human being not consider that We created him from a seed? Yet he becomes a fierce adversary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does man not consider that We created him from a [mere] sperm-drop - then at once he is a clear adversary?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:77] Or has man — namely, [the like of] al-‘Āsī b. Wā’il — not seen, [has he not] realised, that We created him from a drop, of sperm [and so on in stages] until We made him powerful and strong. Then lo! he is an open adversary, severely antagonistic towards Us, [openly] making this manifest by his denial of resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hath not man seen) does not Ubayy Ibn Khalaf know (that We have created him from a drop of seed) of a weak and stinking sperm drop? (Yet lo! he is an open opponent) he openly argues in falsehood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بالغ الكفرة المنكرون المصرون في إنكار البعث وتكذيبه، وجادلوا مع رسول الله صلى الله عليه وسلم وعلى وجه العناد والمكابرة، حتى أتى أُبي بن خلف، أتى بعظم بال، وفته عند النبي صلى الله عليه وسلم فقال متعجباً على سبيل الإنكار مستبعداً:\n\n[المؤمنون: 82] كذلك إنا مخرجون مبعوثون\n\n[المؤمنون: 36]\n\n\n\n\nرد الله سبحانه لمن أنكر قدرته على البعث فقال: { أَ } ينكر المنكر قدرتنا على إعادة الروح إلى الجمادات { وَلَمْ يَرَ ٱلإِنسَانُ } المجبول على الدارية والشعور، ولم يتذكر ولم يعلم { أَنَّا خَلَقْنَاهُ } وقدرنا وجوده أولاً { مِن نُّطْفَةٍ } مهينة، وهي أرذل من التراب { فَإِذَا هُوَ } اليوم بعدما سويناه رجلاً كاملاً في العقل والرشد { خَصِيمٌ مُّبِينٌ } [يس: 77] ومجادل زعيم، ظاهر المراء والمجادلة معنا، منكراً لقدرتنا، مع أنه كان جماداً أرذل في غاية الرذالة والحقارة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أَوَلَمْ يَرَ الإِنسانُ أَنَّا خَلقناه من نُطفةٍ } مَذِرة، خارجة من الإحليل، الذي هو قناة النجاسة، { فإِذا هو خَصِيم مبين } بيّن الخصومة، أي: فهو على مهانة أصله، ودناءة أوله، يتصدّى لمخاصمة ربه، ويُنكر قدرته على إحياء الميت بعدما رمّت عظامه\n وهي تسلية ثانية له صلى الله عليه وسلم، وتهوين ما يقولونه في جانب الحشر، وهو توبيخ بليغ حيث عجّب منه، وجعله إفراطاً في الخصومة بيّناً فيها\n رُوي أن أَبيّ بن خلف أتى النبي صلى الله عليه وسلم بعظم بالٍ، ففتَّه بيده، وقال: يا محمد أتُرى الله يحيي هذا بعدما رمّ؟ فقال صلى الله عليه وسلم:\n\n \" نعم ويبعثك ويدخلك جهنم \" \n\nفنزلت الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:4",
      "similarity": 0.969021612229976
    },
    {
      "verse": "80:19",
      "similarity": 0.6760780432352403
    },
    {
      "verse": "75:37",
      "similarity": 0.5771870059693259
    },
    {
      "verse": "53:46",
      "similarity": 0.5661139447322061
    },
    {
      "verse": "26:96",
      "similarity": 0.5223403058289241
    }
  ]
}