{
  "chapter": "يس",
  "text": "لقد حق القول على اكثرهم فهم لا يؤمنون",
  "translations": [
    {
      "translation": "The Word has been justly carried out against most of them so they have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sentence is surely justified against most of them, for they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely most of them merit the decree of chastisement; so they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(I swear) that most of them are doomed to be punished. They have no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly, it (their disbelief) has proved true for most of them, so they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the Word has proved true against most of them, so they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly the word has proved true of most of them, so they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word has been realised against most of them, yet they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already hath the judgment, (for their infidelity) proved true of most of them, for they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word has been proved true against the greater part of them: they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly the word hath been justified against most of them, wherefore they shall not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word has certainly become due against most of them, so they will not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word is proved true against the greater part of them: for they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the Word (of punishment) has proved true against most of them, so they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Phrase has become obligatory upon most of them, yet they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word was realized against most of them, for they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already the word has come into effect upon most of them, so they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:7] The word, for chastisement, has already proved true, it has become due, for most of them, for they, in other words, most of them, will not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Already hath the word proved true of) it has been decreed that wrath and chastisement will visit (most of them) most of the people of Mecca: Abu Jahl and his host, (for they believe not) as it is in Allah's knowledge nor do they wish to believe. And so they never accepted faith and were killed on the Day of Badr in their state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا ينذرهم سبحانه ولا سيرسل إليهم من يصلح أحوالهم { لَقَدْ حَقَّ ٱلْقَوْلُ } وسبق الحكم من الله، ومضى القضاء منه سبحانه { عَلَىٰ أَكْثَرِهِمْ } أي: أكثر أهل مكة بالكفر والعذاب، وعدم الوصول إلى خير المنقلب والمآب، وبعدما قد ثبت في حضرة علمه سبحانه كفرهم وضلالهم { فَهُمْ لاَ يُؤمِنُونَ } [يس: 7] بالله، ولا يصدقون برسوله وكتابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لقد حقَّ القولُ على أكثرهم فهم لا يؤمنون } يعني قوله:\n\n[السجدة: 13] أي: تعلق بهم هذا القول، وثبت عليهم ووجب لأنه عَلِمَ أنهم يموتون على الكفر\n قال ابن عرفة: إنذارهم مع إخباره بأنهم لا يُؤمنون ليس من تكليف ما لا يطاق عقلاً وعادة، وما لا يطاق من جهة السمع يصح التكليف به، اعتباراً بظاهر الأمر، وإلا لزم أن تكون التكاليف كلها لا تطاق، ولا فائدة فيها لأنَّ المكلفين قسمان: فمَن عَلِمَ تعالى أنه لا يؤمن فلا فائدة في أمره بالإيمان إذ لا يطيق عدمه\n هـ\n قلت: الحكمة تقتضي تكليفهم لتقوم الحجة عليهم أو لهم، والقدرة تقتضي عذرهم\n والنظر في هذه الدار ـ التي هي دار التكليف ـ للحكمة لا للقدرة",
      "translations": []
    }
  ]
}