{
  "chapter": "يس",
  "text": "وضرب لنا مثلا ونسى خلقه قال من يحى العظم وهى رميم",
  "translations": [
    {
      "translation": "He makes likenesses of Us and forgets his own creation, saying, 'Who will give life to bones when they are decayed?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And applies comparisons to Us, having forgotten his origin, and says: \"Who can put life into decayed bones?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He strikes for Us a similitude and forgot his own creation. He says: “Who will quicken the bones when they have decayed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He questions Our Resurrection of him, but has forgotten his own creation. He has said, \"Who will give life to the bones which have become ashes?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he invents an example for Us, while forgetting his own creation, saying, “Who is such that can revive the bones when they have completely rotted away?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he puts forth for Us a parable, and forgets his own creation. He says: \"Who will give life to these bones after they are rotten and have become dust\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he strikes out a likeness for Us and forgets his own creation. Says he: Who will give life to the bones when they are rotten?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he has struck for Us a similitude and forgotten his creation; he says, 'Who shall quicken the bones when they are decayed?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he hath coined for Us a similitude, and hath forgotten the fact of his creation, saying: Who will revive these bones when they have rotted away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "producing arguments against Us, and forgetting his own creation. He asks, \"Who can give life back to bones after they have rotted away?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he propoundeth for us a similitude, and forgetteth his creation, He saith: who shall quicken the bones when they are decayed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He draws comparisons for Us, and forgets his own creation. He says, ‘Who shall revive the bones when they have decayed?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he makes comparisons for Us, and forgets his own (origin and) Creation: He says, \"Who can give life to (dry) bones and decomposed ones (at that)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he puts forth for Us a parable, and forgets his own creation. He says: \"Who will give life to these bones when they have rotted away and became dust?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he has struck for Us a parable, and forgotten his own creation. He asks: 'Who will quicken the bones after they have decayed'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he produces arguments against Us, and he forgets his own creation. He says, “Who will revive the bones when they have decayed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he presents for Us an example and forgets his [own] creation. He says, \"Who will give life to bones while they are disintegrated?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:78] And he strikes for Us a similitude, in this respect, and forgets [the manner of] his creation, from a spermdrop, a thing more curious than his similitude; he says, ‘Who will revive the bones when they are rot?’, in other words, [when they have become] withered (He does not say ramīmatun, ‘decayed’, because it [ramīmun, ‘rot’] is a noun and not an adjective). It is reported that he [al-‘Āsī] took some withered bones and crushed them into pieces and said to the Prophet (s), ‘Do you think that God can revive these [bones] after they have decayed and become rot?’ And so the Prophet (s) said, ‘Yes indeed! And He will also throw you into the Fire’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he hath coined for Us a similitude) he gave Us a similitude regarding bones, (and hath forgotten the fact of his creation) he left out the mention of his initial creation, (saying: Who will revive these bones when they have rotted away) who will revive these bones when they become dust?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهِيَ رَمِيمٌ } معناه رُفاتٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Be!\" - it is {with} {force} and {determining}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ما يستحقي منا ومن قدرتنا حتى { ضَرَبَ لَنَا مَثَلاً } موضحاً لنفي قدرتنا { وَ } قد { نَسِيَ خَلْقَهُ } أي: خلقنا إياه\n ومن كمال نسيانه وضلاله { قَالَ } متعجباً على سبيل الإنكار: { مَن يُحيِي ٱلْعِظَامَ } البالية { وَ } الحال أنه { هِيَ رَمِيمٌ } [يس: 78] بالية في غاية البلى إلى حيث تتفتت أجزاؤها وتطيرت بالرياح\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وضَرَبَ لنا مثلاً } أمراً عجيباً، بأن جَعَلنا مثل الخلق العاجزين، فنعجز عما عجزوا عنه من إحياء الموتى، { ونَسِيَ خَلْقَه } من المنيّ المهين، فهو أغرب من إحياء العظم الرميم\n و \" خلقه \": مصدر مضاف للمفعول، أي: خلقنا إياه، { قال مَن يحيي العظامَ وهي رميمٌ } بالٍ مفتت، وهو اسم لما بَلِيَ من العظام، لا صفة، ولذلك لم يؤنّث\n وقد وقع خبراً لمؤنث، وقيل: صفة بمعنى مفعول، من: رممته، فيكون كقتيل وجريح\n وفيه دليل على أن العظم تحله الحياة، فإذا مات صار نجساً، وهو مذهب مالك والشافعي، وقال أبو حنيفة: لا تحلّه الحياة، فهو طاهر كالشعر والعصب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:42",
      "similarity": 0.9013681467429786
    },
    {
      "verse": "20:126",
      "similarity": 0.09328340502962124
    },
    {
      "verse": "20:52",
      "similarity": 0.09030618544625342
    },
    {
      "verse": "45:34",
      "similarity": 0.08781394129973924
    },
    {
      "verse": "59:19",
      "similarity": 0.08720158719529407
    }
  ]
}