{
  "chapter": "يس",
  "text": "قل يحييها الذى انشاها اول مرة وهو بكل خلق عليم",
  "translations": [
    {
      "translation": "Say 'He who made them in the first place will bring them back to life. He has total knowledge of each created thing;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He who created you the first time. He has knowledge of every creation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “He Who first brought them into being will quicken them; He knows well about every kind of creation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell him, \"He who gave them life in the first place will bring them back to life again. He has the best knowledge of all creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “They will be revived by the One Who created them the first time; and He is the All Knowing of every creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He will give life to them Who created them for the first time! And He is the All-Knower of every creation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He will give life to them Who brought them into existence at first, and He is cognizant of all creation\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He shall quicken them, who originated them the first time; He knows all creation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He will revive them Who produced them at the first, for He is Knower of every creation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He who brought them into being in the first instance will give them life again: He has knowledge of every type of creation:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou:\" He shall quicken them Who brought them forth for the first time, and He is of every kind of creation the Knower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘He will revive them who produced them the first time, and He has knowledge of all creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He will give them life Who created them for the first time! for He is Well-versed in every kind of creation!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: (O Muhammad SAW) \"He will give life to them Who created them for the first time! And He is the All-Knower of every creation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He will quicken them who originated them the first time; He has knowledge of every creation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “He who initiated them in the first instance will revive them. He has knowledge of every creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He will give them life who produced them the first time; and He is, of all creation, Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:79] Say: ‘He will revive them Who originated them the first time, and He is Knower of all creation, [of every single] creature, generally and in detail, before and after it has been created —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to him, Muhammad: (He will revive them Who produced them) Who created them (at the first) from a sperm drop, (for He is Knower of every creation) He is Knower of the creation of everything,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل في جوابهم بعدما بالغوا في الإنكار والاستبعاد: { يُحْيِيهَا } أي: العظام، ويعيد الروح إليها { ٱلَّذِيۤ أَنشَأَهَآ } أي: المحيي، القادر المقتدر على خلقها وإبرائها { أَوَّلَ مَرَّةٍ } من كتم العدم إنشاءً إبداعياً بلا سبق مادة ومدة { وَ } إن استبعدوا واستحالوا جميع الأجزاء المنبثة المفتتة، الممتزجة بعضها مع بعض إلى حيث يستحيل امتيازها وافتراقها أصلاً، قل: { هُوَ بِكُلِّ خَلْقٍ } ومخلوق من نقير وقطمير { عَلِيمٌ } [يس: 79] بعلمه الحضوري، لا يغيب عن حيطة علمه ذرة، ولا يشبته عليه شيء من معلوماته، فله سبحانه أن يميز أجزاء كل شخص شخص، ويركبها على الوجه الذي كان عليه في النشأة الأولى، ثم يعيد الروح عليه، فاصر حياً كما كان، وما ذلك على الله بعزيز\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قُل يُحْييها الذي أنشأها } خلقها { أولَ مرة } أي: ابتداء، { وهو بكل خَلْقٍ } مخلوق { عليمٌ } لا يخفى عليه أجزاؤه، وإن تفرقت في البر أو البحر، فيجمعه، ويُعيده كما كان",
      "translations": []
    }
  ]
}