{
  "chapter": "يس",
  "text": "اوليس الذى خلق السموت والارض بقدر على ان يخلق مثلهم بلى وهو الخلق العليم",
  "translations": [
    {
      "translation": "Does He who created the heavens and earth not have the power to create the same again? Yes indeed! He is the Creator, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can He who created the heavens and the earth not be able to create others like them? Why not? He is the real creator all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has He Who created the heavens and the earth no power to create the likes of them? Yes, indeed, He is the Superb Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the One who has created the heavens and the earth not able to create another creature like the human being? He certainly has the power to do so. He is the Supreme Creator and is All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And is it not possible for the One Who created the heavens and the earth to create the likes of them? It is surely possible, why not? And He is the Great Creator, the All Knowing of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who created the heavens and the earth, able to create the like of them Yes, indeed! He is the All-Knowing Supreme Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who created the heavens and the earth able to create the like of them? Yea! and He is the Creator (of all), the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He, who created the heavens and earth, able to create the like of them? Yes indeed; He is the All-creator, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who created the heavens and the earth Able to create the like of them? Aye, that He is! for He is the All-Wise Creator,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who created the heavens and earth not able to create others like these people? Of course He is! He is indeed the Supreme Creator, the All Knowing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He who created the heavens and the earth able to create the like of these? Yea! He is the Supreme Creator, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He who created the heavens and the earth able to create the like of them? Yes indeed! He is the All-creator, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who created the heavens and the earth able to create the like thereof?\" - Yea, indeed! for He is the Creator Supreme, of skill and knowledge (infinite)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He, Who created the heavens and the earth Able to create the like of them? Yes, indeed! He is the All-Knowing Supreme Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who created the heavens and the earth unable to create their like? Yes, indeed, He is the Creator, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He who created the heavens and the earth able to create the like of them? Certainly. He is the Supreme All-Knowing Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He who created the heavens and the earth Able to create the likes of them? Yes, [it is so]; and He is the Knowing Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:81] Is not He Who created the heavens and the earth, in all their immensity, able to create the like of them?, namely, human beings, in all their minuteness? Yes indeed, He is able to do this — God Himself replies here. And He is the Creator (khallāq means Creator of many things), the Knower, of all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is not He Who created the heavens and the earth Able to create) to revive (the like of them? Aye that He is!) He is Able to do so, (for He is the All-Wise Creator) Who will resurrect the dead,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه أيضاً إلى كمال قدرته واختياره فقال: { أَ } ينكر المنكرون قدرتنا على البعث وحشر الموتى { وَلَـيْسَ } القادر المقتدر { ٱلَذِي خَلَقَ } وأوجد { ٱلسَّمَاواتِ } أي: العلويات وما فيها { وَٱلأَرْضَ } أي: السفليات وما عليها { بِقَادِرٍ عَلَىٰ أَن يَخْلُقَ مِثْلَهُم } ويعيدهم أحياء كما كانوا { بَلَىٰ } من قدر على خلق السماوت العلا والأرضين السفلى\n قادر على بعث الموتى وحشرهم في النشأة الأخرى { وَ } كيف لا يقدر { هُوَ ٱلْخَلاَّقُ } المبالغ في تكثير الخلق والإيجاد\n إبداء وإعادة { ٱلْعَلِيمُ } [يس: 81] بجميع المعلومات\n أزلاً وأبداً على التفصيل بحيث لا يخرج عن حيطة حضوره ذرة من ذرائرها ما كان ويكون\n بل الكل عنده ممتاز محفوظ\n\n\nولا تستبعدوا أيها الجاهلون بالله وبعلمه\n وقدرته وسائر أوصافه الكاملة وأسمائه الشاملة أمثال هذا\n بل هي بالنسبة إليه سبحانه سهل ويسير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وعظم شأنهما { بقادرٍ على أن يَخْلُقَ مِثْلَهم } مثل أجسامهم في الصِّغر والحقارة\n بالإضافة إلى السموات والأرض\n أو: أن يعيدهم مثل ما كانوا عليه في الذات والصفات لأن المعاد مثل المبْدأ\n بل أسهل\n { بَلى } أي: قُل: بَلى هو قادر على ذلك\n { وهو الخلاَّقُ } كثير الخلق والاختراع\n { العليمُ } بأحوال خلقه\n أو: كثير المخلوقات والمعلومات\n { إِنما أمْرُهُ } شأنه { إِذا أراد شيئاً } بكونه { أن يقولَ له كُن فيكون } فيحدث\n أي: فهو كائن موجود\n لا محالة\n وهو تمثيل لتأثير قدرته في الأشياء\n بأمر المطاع للمطيع في حصول المأمور\n من غير امتناع وتوقف\n من غير أن يحتاج إلى كاف ولا نون\n وإنما هو بيان لسرعة الإيجاد\n كأنه يقول: كما لا يثقل عليكم قول \" كن \" \n فكذلك لا يصعب على الله إنشاؤكم وإعادتكم\n قال الكواشي: ثم أومأ إلى كيفية خلقه الأشياء المختلفة في الزمان المتحد\n وذلك ممتنع على غيره\n فقال: { إِنما أمره\n\n\n } الآية\n فيحدث من غير توقف\n فمَن رفع \" فيكونُ \" \n فلأنه جملة من مبتدأ وخبر\n أي: فهو يكون\n ومَن نصب فللعطف على \" يقول \"\n والمعنى: أنه ليس ممن يلحقه نصَب ولا مشقة\n ولا يتعاظمه أمر\n بل إيجاد المعدومات\n وإعدام الموجودات\n عليه أسرع من لمح البصر هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:15",
      "similarity": 0.6343841704382658
    },
    {
      "verse": "46:34",
      "similarity": 0.6031737468093266
    },
    {
      "verse": "39:59",
      "similarity": 0.5872861175070347
    },
    {
      "verse": "40:50",
      "similarity": 0.5849634154070158
    },
    {
      "verse": "67:9",
      "similarity": 0.5131194834450203
    }
  ]
}