{
  "chapter": "يس",
  "text": "فسبحن الذى بيده ملكوت كل شىء واليه ترجعون",
  "translations": [
    {
      "translation": "Glory be to Him Who has the Dominion of all things in His Hand. To Him you will be returned,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So all glory to Him who holds all power over everything, to whom you will go back in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He Who has full control over everything, and to Him you shall all be recalled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All glory belongs to the One in whose hands is the control of all things. To Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Purity is to Him in Whose Hand* is the control over all things and it is towards Him that you will be returned. (Used as a metaphor to mean Power).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorified be He and exalted (above all that they associate with Him), and in Whose Hand is the dominion of all things, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore glory be to Him in Whose hand is the kingdom of all things, and to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glory be to Him, in whose hand is the dominion of everything, and unto whom you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor Glory be to Him in Whose hand is the dominion over all things! Unto Him ye will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glory be to Him who has control over all things. It is to Him that you will all be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore hallowed be He in whose hand is the governance of everything, and Unto whom ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So immaculate is He in whose hand is the dominion of all things, and to whom you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glory to Him in Whose hands is the dominion of all things: and to Him will ye be all brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Glorified is He and Exalted above all that they associate with Him, and in Whose Hands is the dominion of all things, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to Him in whose Hand is the Kingdom of all things, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glory be to Him in whose hand is the dominion of everything, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So exalted is He in whose hand is the realm of all things, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[36:83] So glory be to Him in Whose hand is the dominion of all things (malakūt means mulk: the wāw and tā’ have been added for hyperbole) and to Whom you will be returned, restored, in the Hereafter. Meccan: it consists of 182 verses, revealed after [sūrat] al-An‘ām.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore glory be to Him) Allah glorified Himself (in Whose hand is the dominion over all things) the stores of all things and the creating of all things! (Unto Him you will be brought back) after death and He will requite you each according to his works'. And of the surah in which those who set the ranks are mentioned, which is all Meccan and consists of 181 verses, 860 words and 3,829 letters: Surah 37: Those Who Set the Ranks (al-Saffat) And of the surah in which those who set the ranks are mentioned, which is all Meccan and consists of 181 verses, 860 words and 3,829 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَلَكُوتُ كُلِّ شَيْءٍ } معناه مَلِكَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"All things belong to Him\" - this means that He is their Lord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { إِلَيْهِ } لا إلى غيره\n إذ لا غير معه في الوجود ولا إله سواه موجود ومشهود { تُرْجَعُونَ } [يس: 83] رجوع الأمواج إلى الماء\n والأضواء إلى الذكاء\n سبحانه من لا يجري في ملكه إلا ما يشاء\n\n\nخاتمة السورة\n\nعليك أيها السالك المتدبر المتأمل في كيفية رجوع الكائنات إلى الوحدة الذاتية وإيناط المظاهر والمصنوعات إلى المبدأ الحقيقي والمنشأ الأصلي - أزال الله عن بصر بصيرتك سبل الحول\n وأعانك على رفع الحجب وكشف العلل - أن تصفِّي باطنك عن الميل إلى الغير مطلقاً\n بحيث يصير باطنك مملوءاً بمحبة الله\n فتترسخ تلك المحبة فيه وتتمون إلى أن خفي عليك خواطرك وهواجس نفسك\n ثم تسري من باطنك إلى ظاهرك\n فيشغلك عن جميع مشتهياتك ومستلذاتك\n ومتقضيات قواك وجوارحك\n فيمتلئ منها ظاهرك وباطنك\n فحينئذ لم يبق لك التفات إلى الغير مطلقاً\n فصرت حيراناً\n مدهوشاً\n مستغرقاً بمطالعة وجهه الكريم\n وبعدما صرت كذلك\n جذبك الحق عنك وسترك عليك إن إبت فيه وفنيت\n فحينئذ حق لك أن تقول بلسان استعدادك بعدما فنيت آثار رسومك في الله: إن لله وإنا إليه راجعون { فَسُبْحَانَ ٱلَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ } [يس: 83]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فسبحان } تنزيهاً له مما وصفه به المشركون\n وتعجيب مما قالوا\n { الذي بيده ملكوتُ } أي: ملك { كُلِّ شيءٍ } والتصرُّف فيه على الإطلاق\n وزيادة الواو والتاء للمبالغة\n أي: مالك كلّ شيء\n { وإِليه تُرجَعُون } بالبعث للجزاء والحساب\n الإشارة: أَوَلَمْ ير الإنسان أنَّا خلقناه من نطفة مهينة\n فإذا هو خصيم لنا في تدبيرنا واختيارنا\n ويُنازعنا في مُرادنا من خلقنا\n ومرادنا منهم: ما هم عليه\n فاستحي أيها الإنسان أن تُخاصم الله في حكمه\n أو تنازعه في تقديره وتدبيره\n وسلِّم الأمور لمَن بيده الخلق والأمر\n بكى بعضُ الصالحين أربعين سنة على ذنب أذنبه\n قيل له: وما هو؟ قال: قلت لشيء كان: ليته لم يكن\n فارْضَ بما يختاره الحق لك\n جلاليًّا كان أو جماليًّا ولا تختر من أمرك شيئاً\n والله يعلم وأنتم لا تعلمون\n وكل مَن اهتم بأمر نفسه\n واشتغل بتدبير شؤونها\n فقد ضرب لله مثلاً\n بأن أشرك نفسه معه\n ونَسِي خلقه\n ولو فكر في ضعف أصله\n وحاله\n لاستحيا أن يُدبِّر لنفسه مع ربه\n وفي الإشارات عن الله تعالى: أيها العبد لو أَذِنْتُ لك أن تدبر لنفسك لكنت تستحيي مني أن تدبر لها\n فكيف وقد نهيتك عن الندية!\n وكما قَدَرَ على إحياء العظام الرميمة\n يَقْدر على إحياء القلوب الميتة\n ومَن قَدَرَ على استخراج النار من محل الماء\n يقدر على استخراج العلم من الجهل\n واليقظة من الغفلة\n ومَن كان أمره بين الكاف والنون\n بل أسرع من لحظ العيون\n ينبغي أن يُرجع إليه في جميع الشؤون\n\nقال القشيري: فسبحان الذي بيده ملكوت كل شيء\n فلا يحدث شيء ـ قلَّ أو كثر ـ إلا بإبداعه وإنشائه\n ولا يبقى منها شيء إلا بإبقائه\n فمنه ظهر ما يحدث\n وإليه يصير ما يخلق\n هـ\n قال النسفي: قال صلى الله عليه وسلم:\n \" مَن قرأ يس يريد بها وجه الله غفر اللهُ له\n وأُعطي من الأجر كمَن قرأ القرآن اثنتين وعشرين مرة \" \nوبالله التوفيق\n ولا حول ولا قوة إلا بالله العلي العظيم\n وصلّى الله على سيدنا ومولانا محمد\n وآله وصحبه\n وسلَم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:76",
      "similarity": 0.4975555389998318
    },
    {
      "verse": "11:4",
      "similarity": 0.46976790577855104
    },
    {
      "verse": "57:5",
      "similarity": 0.46713410109911196
    },
    {
      "verse": "64:1",
      "similarity": 0.4493297217351864
    },
    {
      "verse": "79:3",
      "similarity": 0.4178222138180802
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/36:83.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/36:83.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/36:83.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}