{
  "chapter": "الصافات",
  "text": "فلما بلغ معه السعى قال يبنى انى ارى فى المنام انى اذبحك فانظر ماذا ترى قال يابت افعل ما تؤمر ستجدنى ان شاء الله من الصبرين",
  "translations": [
    {
      "translation": "When he was of an age to work with him, he said, 'My son, I saw in a dream that I must sacrifice you. What do you think about this?' He said, 'Do as you are ordered, father. Allah willing, you will find me resolute.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he was old enough to go about with him, he said: \"O my son, I dreamt that I was sacrificing you. Consider, what you think?\" He replied: \"Father, do as you are commanded. If God pleases you will find me firm.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when he was old enough to go about and work with him, (one day) Abraham said to him: “My son, I see in my dream that I am slaughtering you. So consider (and tell me) what you think.” He said: “Do as you are bidden. You will find me, if Allah so wills, among the steadfast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his son was old enough to work with him, he said, \"My son, I have had a dream that I must sacrifice you. What do you think of this?\" He replied, \"Father, fulfill whatever you are commanded to do and you will find me patient, by the will of God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he became capable of working with him, Ibrahim said, “O my son, I dreamt that I am sacrificing you – therefore now consider what is your opinion”; he said, “O my father! Do what you are commanded! Allah willing, you will soon find me patiently enduring!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when he (his son) was old enough to walk with him, he said: \"O my son! I have seen in a dream that I am slaughtering you. So look what you think!\" He said: \"O my father! Do that which you are commanded, if Allah wills, you shall find me of the patient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained to working with him, he said: O my son! surely I have seen in a dream that I should sacrifice you; consider then what you see. He said: O my father! do what you are commanded; if Allah please, you will find me of the patient ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when he had reached the age of running with him, he said, 'My son, I see in a dream that I shall sacrifice thee; consider, what thinkest thou?' He said, 'My father, do as thou art bidden; thou shalt find me, God willing, one of the steadfast.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when (his son) was old enough to walk with him, (Abraham) said: O my dear son, I have seen in a dream that I must sacrifice thee. So look, what thinkest thou? He said: O my father! Do that which thou art commanded. Allah willing, thou shalt find me of the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached the age when he could work with him, he said, \"O my son, I have seen in a dream that I am sacrificing you. So tell me what you think of it!\" He replied, \"O my father, do as you are commanded; and God willing, you will find me steadfast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained the age of, running with him, he said: O my son! verily I have seen in a dream that I am slaughtering thee; so look, what considerest thou? He said: O my father! do that which thou art commanded; thou shalt find me, Allah willing, of the patients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he was old enough to assist in his endeavour, he said, ‘My son! I see in dreams that I am sacrificing you. See what you think.’ He said, ‘Father! Do whatever you have been commanded. If Allah wishes, you will find me to be patient.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when (the son) reached (the age of) (serious) work with him, he said: \"O my son! I see in vision that I offer thee in sacrifice: Now see what is thy view!\" (The son) said: \"O my father! Do as thou art commanded: thou will find me, if Allah so wills one practising Patience and Constancy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when he (his son) was old enough to walk with him, he said: \"O my son! I have seen in a dream that I am slaughtering you (offer you in sacrifice to Allah), so look what you think!\" He said: \"O my father! Do that which you are commanded, Insha' Allah (if Allah will), you shall find me of As-Sabirin (the patient ones, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached the age of traveling with him, he said: 'My son, while I was sleeping I saw that I shall slaughter (sacrifice) you, tell me what is your opinion' He replied: 'Father, do as you are ordered (by Allah). Allah willing, you shall find me one of those who are steadfast'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he was old enough to accompany him, he said, “O My son, I see in a dream that I am sacrificing you; see what you think.” He said, “O my Father, do as you are commanded; you will find me, God willing, one of the steadfast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached with him [the age of] exertion, he said, \"O my son, indeed I have seen in a dream that I [must] sacrifice you, so see what you think.\" He said, \"O my father, do as you are commanded. You will find me, if Allah wills, of the steadfast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:102] And when he was old enough to walk with him, that is, to go about with him and help him out — this is said to have been [either] at the age of seven or at the age of thirteen — he said, ‘O my dear son, I see, that is, I have seen, in a dream that I shall sacrifice you — and the visions of prophets are [always] true and their actions are [inspired] by the command of God, exalted be He. So see what you think’, of this dream. He consulted him so that he [his son] might accept the idea of being sacrificed and comply with the command for it. He said, ‘O my father (the [final] tā’ [in abati] replaces the yā’ of the genitive [possessive] annexation [yā abī]) do whatever you have been commanded, to do. You shall find me, God willing, of the steadfast’, in this [affair].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَلَمَّا بَلَغَ مَعَهُ السَّعْيَ قَالَ يَا بُنَيَّ إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ فَانْظُرْ مَاذَا تَرَى قَالَ يَا أَبَتِ افْعَلْ مَا تُؤْمَرُ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ مِنَ الصَّابِرِينَ (102)والفاء في { فلمَّا بلغَ معهُ السَّعي } فصيحة لأنها مفصحة عن مقدر ، تقديره : فولد له ويفع وبلغ السعي فلما بلغ السعي قال يا بنيّ الخ ، أي بلغ أن يسعى مع أبيه ، أي بلغ سنّ من يمشي مع إبراهيم في شؤونه .فقوله : { معه } متعلق بالسعي والضمير المستتر في { بلغ } للغلام ، والضمير المضاف إليه { معه } عائد إلى إبراهيم . و { السعي } مفعول { بلغ } ولا حجة لمن منع تقدم معمول المصدر عليه ، على أن الظروف يتوسع فيها ما لا يتوسع في غيرها من المعمولات .وكان عمُر إسماعيل يومئذٍ ثلاث عشرة سنة وحينئذٍ حدّث إبراهيم ابنه بما رآه في المنام ورؤيا الأنبياء وحي وكان أول ما بُدىء به رسول الله صلى الله عليه وسلم الرؤيا الصادقة ولكن الشريعة لم يوح بها إليه إلا في اليقظة مع رؤية جبريل دون رؤيا المنام ، وإنما كانت الرؤيا وحياً له في غير التشريع مثل الكشف على ما يقع وما أعد له وبعض ما يحل بأمته أو بأصحابه ، فقد رأى في المنام أنه يهاجِر من مكة إلى أرض ذات نخل فلم يهاجر حتى أُذن له في الهجرة كما أخبر بذلك أبا بكر رضي الله عنه ، ورأى بَقراً تُذبح فكان تأويل رؤياه مَن استشهد من المسلمين يوم أحد ، ولقد يُرجَّح قول القائلين من السلف بأن الإِسراء برسول الله صلى الله عليه وسلم كان يقظة وبالجسد على قول القائلين بأنه كان في المنام وبالروح خاصة ، فإن في حديث الإِسراء أن الله فرَض الصلاة في ليلته والصلاة ثاني أركان الإِسلام فهي حقيقة بأن تفرض في أكمل أحوال الوحي للنبيء صلى الله عليه وسلم وهو حال اليقظة فافهم .وأمر الله إبراهيم بذبح ولده أمرُ ابتلاء .وليس المقصود به التشريع إذ لو كان تشريعاً لما نسخ قبل العمل به لأن ذلك يفيت الحكمة من التشريع بخلاف أمر الابتلاء .والمقصود من هذا الابتلاء إظهار عزمه وإثبات علوّ مرتبته في طاعة ربّه فإن الولد عزيز على نفس الوالد ، والولد الوحيد الذي هو أمل الوالد في مستقبله أشدّ عزّة على نفسه لا محالة ، وقد علمتَ أنه سأل ولداً لِيرثه نسله ولا يرثه مواليه ، فبعد أن أقرّ الله عينه بإجابة سؤله وترعرع ولده أمره بأن يذبحه فينعدم نسله ويخيب أمله ويزول أنسه ويتولى بيده إعدام أحب النفوس إليه وذلك أعظم الابتلاء . فقابَل أمر ربه بالامتثال وحصلت حكمة الله من ابتلائه ، وهذا معنى قوله تعالى : { إنَّ هذا لهو البلاء المبينُ } \\[ الصافات : 106 \\] .وإنما برز هذا الابتلاء في صورة الوحي المنامي إكراماً لإِبراهيم عن أن يزعج بالأمر بذبح ولده بوحي في اليقظة لأن رُؤَى المنام يعقبها تعبيرها إذ قد تكون مشتملة على رموز خفيّة وفي ذلك تأنيس لنفسه لتلقّي هذا التكليف الشاقّ عليه وهو ذبح ابنه الوحيد .والفاء في قوله : { فانظر ماذا ترى } فاء تفريع ، أو هي فاء الفصيحة ، أي إذا علمت هذا فانظر ماذا ترى . والنظر هنا نظر العقل لا نظر البصر فحقه أن يتعدّى إلى مفعولين ولكن علّقه الاستفهام عن العمل . والمعنى : تأمل في الذي تقابل به هذا الأمر ، وذلك لأن الأمر لما تعلق بذات الغلام كان للغلام حظ في الامتثال وكان عرض إبراهيم هذا على ابنه عرض اختبار لمقدار طواعيته بإجابة أمر الله في ذاته لتحصل له بالرضى والامتثال مرتبة بذل نفسه في إرضاء الله وهو لا يرجو من ابنه إلا القبول لأنه أعلم بصلاح ابنه وليس إبراهيم مأموراً بذبح ابنه جبراً ، بل الأمر بالذبح تعلق بمأمورين : أحدهما بتلقي الوحي ، والآخرِ بتبليغ الرسول إليه ، فلو قدر عصيانه لكان حاله في ذلك حال ابن نوح الذي أبى أن يركب السفينة لما دعاه أبوه فاعتُبر كافراً .وقرأ الجمهور { ماذا ترى } بفتح التاء والراء . وقرأ حمزة والكسائي وخلف بضم التاء وكسر الراء ، أي مَاذا تُريني من امتثال أو عدمه . وحكى جوابه فقال : { يأبتتِ افعل ما تُؤمرُ } دون عطف ، جرياً على حكاية المقاولات كما تقدم عند قوله تعالى :{ قالوا أتجعل فيها من يُفسد فيها } في سورة \\[ البقرة : 30 \\] .( وابتداء الجواب بالنداء واستحضار المنادى بوصف الأبوة وإضافة الأب إلى ياء المتكلم المعوض عنها التاء المشعر تعويضها بصيغة ترقيق وتحنّن .والتعبير عن الذبح بالموصول وهو { ما تُؤمَرُ } دون أن يقول : اذْبَحني ، يفيد وحده إيماء إلى السبب الذي جَعل جوابه امتثالاً لذبحه . وحُذف المتعلق بفعل { تُؤمرُ } لظهور تقديره : أي ما تؤمر به . وبقي الفعل كأنه من الأفعال المتعدية ، وهذا الحذف يسمى بالحذف والإِيصال ، كقول عمرو بن معد يكرب :أمرتك الخيرَ فافعل ما أمرتَ به ... فقد تركتُكَ ذا مال وذا نشَبوصيغة الأمر في قوله : { افْعَلْ } مستعملة في الإِذن . وعدل عن أن يقال : اذبحني ، إلى { افعل ما تؤمرُ } للجمع بين الإِذن وتعليله ، أي أذنت لك أن تذبحني لأن الله أمرك بذلك ، ففيه تصديق أبيه وامتثال أمر الله فيه .وجملة { ستَجِدُني } هي الجواب لأن الجمل التي قبلها تمهيد للجواب كما علمت فإنه بعد أن حثّه على فعل ما أُمر به وَعَده بالامتثال له وبأنه لا يجزع ولا يهلع بل يكون صابراً ، وفي ذلك تخفيف من عبْء ما عسى أن يعرض لأبيه من الحزن لكونه يعامل ولده بما يكره . وهذا وعد قد وفّى به حين أمكن أباه من رقبته ، وهو الوعد الذي شكره الله عليه في الآية الأخرى في قوله : { واذكر في الكتاب إسماعيل إنه كان صادق الوعد } \\[ مريم : 54 \\] ، وقد قرن وعده ب { إن شاء الله } استعانةً على تحقيقه .وفي قوله : { مِنَ الصابِرينَ } من المبالغة في اتصافه بالصبر ما ليس في الوصف : بصابر ، لأنه يفيد أنه سيجده في عِداد الذين اشتهروا بالصبر وعرفوا به ، ألاَ ترى أن موسى عليه السلام لما وعد الخضر قال : { ستجدني إن شاء الله صابِراً } \\[ الكهف : 69 \\] لأنه حُمل على التصبر إجابة لمقترح الخضر .\n\n",
      "translations": [
        {
          "translation": "(And when (his son) was old enough to walk with him) when his son was old enough to strive for Allah and obey Him; it is also said that this means: when his son was old enough to walk with him in the mountains, ((Abraham) said) to his son Ishmael; and it is also said: to his son Isaac: (0 my dear son, I have seen in a dream that I must sacrifice thee) I am commanded in a dream vision to sacrifice you. (So look, what thinkest thou) what do you say? (He said: O my father! Do that which thou art commanded) of sacrificing me. (Allah willing, thou shalt find me of the steadfast) in the face of this sacrifice.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعْيَ } معناه أطاقَ العَملَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when He {reached maturity} with him, he {began to work} with him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فلما بلغ معه السعي } بالسلوك في طريق الكمالات الخلقية والفضائل النفسانية\n أوحى إليه أن يذبحه بالفناء في التوحيد والتسليم لربّه الحق بالتجريد من الصفات الكمالية: فأخبره بذلك\n فانقاد وأسلم وجهه بالفناء في ذاته عن صفاته\n ففدى على يد جبريل العقل الفعّال بذبح النفس الشريفة\n السمينة العلوم\n العظيمة الأخلاق وكمالات الفضائل\n فذبحت بالفناء فيه\n وأنجى إسماعيل القلب بالفناء الحقاني الموهوب المفدّى من جهة الله\n وترك الله عليه السلام في العالمين المتخلفين عن مقامه لاهتدائهم بنوره واقتدائهم بإيمانه وهديه\n { وإنّ يونس } القلب { لَمِن المُرْسَلين } إلى أهل النقصان\n المحتجبين بالأبدان\n المتّبعين للشيطان\n المتظاهرين بالطغيان { إذ أبق } إلى فلك البدن { المشحون } بالقوى البدنية وكمالاتها الحسيّة الجاري في بحر الهيولى { فساهم } أي: فاقترع معهم في الحظوظ البدنية واختيارها بالأفكار العقلية { فكان من المدحضين } المحجوبين\n المزلقين بالحجة البرهانية اليقينية لأنهم بدنيون أهل البحر والسفينة\n وهو القدسيّ المجرّد من سكان الحضرة الإلهية\n الآبق من سيده إلى السفينة\n الملقي بيده إلى التهلكة\n فألقي في البحر\n فالتقمه حوت الرحم كلقطة النطفة { وهو مليم } مستحق للملامة للتعلق بالملابس البدنية الموجبة لوقوعه في تلك البليّة\n { فلولا أنه كان من المسبحين } المنزهين لربّه بالتقديس حالة التجريد والتوحيد { للبث في بطنه } كسائر القوى الطبيعية والنفسانية المنغمسة في بطون حيتان الصور النوعية الجسمانية من الطبائع الهيولانية { إلى يوم يبعثون } أي: يوم يبعث المجرّدون عن مراقد أبدانهم مع بقائه في مرقده كسائر الغافلين\n أو يوم يبعث رفقاؤه البدنيون في القيامة الصغرى { فنبذناه بالعراء } أي: بالفضاء من عرصة الدنيا بالولادة { وهو سقيم } ضعيف ممنوّ بالأعراض المادية واللواحق الطبيعية { وأنبتنا عليه شجرة من يقطين } لا تقوم على ساق وتنسرح على وجه الأرض تظلل عليه بأوارقها من الغواشي البدنية\n وقد قيل في التفاسير الظاهرة: إنه قد ضعف بدنه في بطن الحوت وصار كطفل ساعة يولد { وأرسلناه } عند الكمال { إلى مائة ألف أو يزيدون } والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهدياً نحوه { فَٱنظُرْ } يا بني وتأمل { مَاذَا تَرَىٰ } أي: أي أمر تفكر وتفتي في هذه الواقعة الهائلة أتصبر على بلاء الله أم لا؟\n\n\nوبعدما سمع ابنه ما سمع من الرؤيا { قَالَ } معتصماً بحبل التوفيق\n راضياً بما جرى عليه من قضاء الله مسلماً نحوه\n مستقبلاً منادياً لأبيه لينبئ عن كمال إطاعته له وانقياده لحكم ربه: { يٰأَبَتِ ٱفْعَلْ مَا تُؤمَرُ } من قبل الحق\n فاذبحني في سبيل الله تقرباً منك نحوه\n وطلباً لمرضاته\n ولا تلفت إلى لوازم الأبوة والنبوة\n وكن أنت صابراً لبلاء الله بذبح ولدك بيدك بإذنه وفي سبيله { سَتَجِدُنِيۤ } أيضاً { إِن شَآءَ ٱللَّهُ } وتعلق إرادته بأن اصبر على بلائه الذي هو قتل أبي إياي بيده { مِنَ ٱلصَّابِرِينَ } [الصافات: 102] المتكنين على تحمل الشدائد والمصيبات الآتية من قبل الحق\n\nوبعدما تشاورا وتقاولا\n فوَّضا الأمر إليه سبحانه\n وانقادا لحكمه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n بدليل قوله: { افعل ما تؤمر }\n وقيل: رأى أنه يُعالج ذبحه\n ولم يرَ إراقة الدم\n وقال قتادة: رؤيا الأنبياء حق\n إذا رأوا شيئاً فعلوه\n وفي رؤيا ذلك في النوم وتحققه إياه حتى عمل بما رأى\n إيذان بأن الأنبياء قد تجوهرت نفوسهم\n فلا مجال للكذب فيما يُوحى إليهم\n وفيما يصدر عنهم\n فهم صادقون مصدِّقون\n فليس للشيطان عليهم سبيل\n وإيذان بأن مَن كان في منامه صادقاً كان يقظته أولى بالصدق\n هـ\n وإنما لم يقل: \" رأيت \" لأنه رأى مرة بعد أخرى\n فقد قيل: رأى ليلة التروية كأنّ قائلاً يقول له: إن الله يأمرك بذبح ابنك هذا\n فلما أصبح روَّى في ذلك من الصباح إلى الرواح ليعلم أَمِنَ اللهِ هذا الحلم\n أم لا\n فسُمِّي يوم التروية\n فلما أمسى رأى مثل ذلك\n فعرف أنه من الله\n فسُمِّي يوم عرفة\n ثم رأى مثله في الليلة الثالثة\n فهمَّ بنحره\n فسُمِّي يوم النحر\n\nواخْتُلِف مَن المخاطب المأمور بذبحه\n فقال أهل الكتابين: هو إسحاق\n وبه قال عمر\n وعليّ\n وابن مسعود\n والعباس\n وابنه عبد الله\n وكعب الأحبار\n وسعيد بن جبير\n وقتادة\n ومسروق\n وعكرمة\n والقامس بن أبي بَرّة\n وعطاء\n ومقاتل\n والزهري\n والسدي\n قال سعيد بن جبير: أُريَ إبراهيم ذبح إسحاق في المنام\n فسار به على البراق مسيرة شهر في غداة واحدة\n حتى أتى المنحر بمِنى\n فلما صرف عنه الذبح\n وأمره أن يذبح الكبش\n وذبحه\n سار به مسيرة شهر في روحة واحدة\n طُويت له الأودية والجبال\n هـ\n واحتج أهل هذا القول بأنه ليس في القرآن أن إبراهيم بُشِّر بولد إلا بإسحاق\n وقال هنا: { فبشرناه بغلام } فتعيَّن أنه إسحاق إذ هو المبَشَّر به في غير هذه الآية\n وبأن الذي كان يسعى معه في حوائجه وأشغاله إنما هو إسحاق\n وأما إسماعيل فإنما كان بمكة غائباً عنه\n ولم يثبت في الصحيح أن إبراهيم قَدِمَ مكة إلا ثلاث مرات وإسماعيل متزوج\n وبما رُوي أن موسى عليه السلام قال: يا رب الناس يقولون: إله إبراهيم وإسحاق ويعقوب\n فبمَ ذلك؟ فقال: إن إبراهيم لم يعدل بي شيئاً قط إلا اختارني\n وإن إسحاق جاد لي بالذبح\n وهو لي بغير ذلك أجود\n وإن يعقوب كلما زدته بلاءً زاد لي حسن ظن\n وقال يوسف للملك: أترغب أن تأكل معي\n وأنا ـ والله ـ يوسف بن يعقوب\n نبي الله\n ابن إسحاق\n ذبيح الله\n ابن إبراهيم\n خليل الله\n وبما رُوي أن نبينا ـ عليه الصلاة والسلام ـ سُئل: أي النسب أشرف؟ فقال:\n \" يوسف صدِّيق الله\n ابن يعقوب إسرائيل الله\n ابن إسحاق ذبيح الله\n ابن إبراهيم خليل الله \" \nوفي الجامع الصغير: \" الذبيح إسحاق \" رواه الدارقطني عن ابن مسعود\n والبزار وابن مردويه عن العباس\n وأبي هريرة\n وقال آخرون: هو إسماعيل\n وبه قال عُمر\n وأبو الطفيل عامر بن واثلة\n وسعيد بن المسيب\n والشعبي\n ويوسف بن مهران\n ومجاهد\n وابن عباس أيضاً\n وغيرهم\n واحتجُّوا بأن البشارة بإسحاق متأخرة عن قصة الذبح\n وبقوله عليه السلام:\n \" أنا ابن الذبيحين \" \nفأحدهما: جده إسماعيل\n والآخر: أبوه\n فإن عبد المطلب نذر أن يذبح ولداً إن سَهُل له حفر زمزم\n أو بلغ بنوه عشراً\n فلما سَهُل\n أقرع بينهم\n فخرج السهم على عبد الله\n فَفَدَاه بمائة من الإبل\n ولذلك سنت الدية مائة\n وبأن ذلك كان بمكة\n وكان قرنا الكبش معلَّقين بالكعبة حتى احترقا معها في أيام ابن الزبير\n ولم يكن إسحاق ثمة\n هـ\n وقد يُجاب بأن البشارة أولاً كانت بولادته\n والثانية بنبوته\n أو: بسلامته\n وبأن الثانية تفسير للأولى\n كأنه قال بعدما فرغ من ذكر المبشر به: وكانت تلك البشارة بإسحاق\n قاله الفاسي في حاشيته\n\nوعن الحديث بأن العم يُطلق عليه أباً\n كقوله تعالى:\n[البقرة: 133] وكان عمًّا له\n وتقدّم عن ابن جبير أن إبراهيم سار بابنه على البراق إلى مكة وحيث كان الذبح بها بقي القربان فيها\n والله تعالى أعلم بغيبه\n ولَمَّا قال له: { إِني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر } به { ستجدني إِن شاء الله من الصابرين } على الذبح\n رُوي أن إبراهيم قال لابنه: انطلق بنا نُقرب قرباناً لله تعالى\n فأخذ سكيناً وحبلاً\n ثم انطلق معه\n حتى إذا ذهب بين الجبال\n قال له الغلام: يا أبتِ أين قربانك؟ فقال: { يا بُني إِني أرى في المنام\n\n\n } الآية\n فقال: يا أبت خذ بناصيتي\n واجلس بين كتفي\n حتى لا أؤذيك إذا أصابتني الشفرة\n ولا تذبحني وأنا ساجد\n واقرأ على أمي السلام\n وإن رأيت أن تردّ قميصي إلى أمي فافعل\n عسى أن يسليها عني\n قال إبراهيم: نِعْمَ العون أنت على أمر الله تعالى\n فربطه إبراهيم عليه السلام ثم جعل يُقبّله\n وهو يبكي\n والابن يبكي\n حتى استنقعت الدموع تحت خده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:19",
      "similarity": 0.40848835552526563
    },
    {
      "verse": "30:23",
      "similarity": 0.39351071200255955
    },
    {
      "verse": "27:21",
      "similarity": 0.3896494356577065
    },
    {
      "verse": "7:97",
      "similarity": 0.38719769001114923
    },
    {
      "verse": "37:107",
      "similarity": 0.3690819713225038
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/037102.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/037102.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/37:102.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}