{
  "chapter": "الصافات",
  "text": "فاستفتهم الربك البنات ولهم البنون",
  "translations": [
    {
      "translation": "Ask them for a fatwa: does your Lord have daughters while they themselves have sons?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask them if their Lord has daughters, and they sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ask their opinion: “(Are you convinced) that your Lord should have daughters and you should have sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Do daughters belong to your Lord and sons to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore ask them (O dear Prophet Mohammed – peace and blessings be upon him), whether the daughters are for your Lord and the sons for them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask them: \"Are there (only) daughters for your Lord and sons for them\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ask them whether your Lord has daughters and they have sons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ask them for a pronouncement -- Has thy Lord daughters, and they sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask them (O Muhammad): Hath thy Lord daughters whereas they have sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask them whether your Lord has daughters, whereas they have sons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask thou them: there for thy Lord daughters and for them sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, are daughters to be for your Lord while sons are to be for them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask them their opinion: Is it that thy Lord has (only) daughters, and they have sons?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now ask them (O Muhammad SAW): \"Are there (only) daughters for your Lord and sons for them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, ask them, has your Lord daughters, and they sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, “Are the daughters for your Lord, while for them the sons?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So inquire of them, [O Muhammad], \"Does your Lord have daughters while they have sons?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:149] So ask them, inquire of the Meccan disbelievers, by way of reproach: are daughters to be for your Lord, after their claim that the angels were God’s daughters, while sons are to be for them?, so that the best becomes exclusively theirs?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Now ask them (0 Muhammad)) ask the people of Mecca, and specifically the Banu Malih: (Hath thy Lord daughters) females (whereas they have sons) males? They said: \"yes!\" And the Prophet (pbuh) said to them: \"do you wish for Allah what you do not wish for yourselves?\"\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nردَّ الله عليهم أبلغ وجه وآكده، حيث أمر حبيبه صلى الله عليه وسلم بالاستفتاء والاستفسار عن قولهم هذا، ونسبتهم هذه فقال: { فَٱسْتَفْتِهِمْ } ورسلهم؛ أي: كفار مكة يا أكمل الرسل، واستخبرهم على سبيل التوبيخ والتقريع { أَلِرَبِّكَ } أي: أيثبتون لربك الواحد الأحد الصمد، الذي\n\n[الإخلاص: 3-4] { ٱلْبَنَاتُ } أي: أوضع الاولاد وأرادها { وَلَهُمُ } أي: لأنفسهم { ٱلْبَنُونَ }  [الصافات: 149] تعالى سبحانه عما يقولون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فاسْتَفتهم ألِرَبِّكَ البناتُ ولهم البنونَ } أَمَرَ رسولَه أولاً في أول السورة باستفتاء قريش على وجه إنكار البعث، بقوله:\n",
      "translations": []
    }
  ]
}