{
  "chapter": "الصافات",
  "text": "فاستفتهم اهم اشد خلقا ام من خلقنا انا خلقنهم من طين لازبۭ",
  "translations": [
    {
      "translation": "Ask them for a fatwa: is it they who are stronger in structure or other things We have created? We created them from sticky clay.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ask them if they are more difficult to create, or the rest We have created? Indeed (man) We created from fermented clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ask them (that is, human beings): “Were they harder to create than the objects We created?” We created them from sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Have they (people) been created stronger than what We have created?\" We have created them from moist clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore ask them (O dear Prophet Mohammed – peace and blessings be upon him), “Are they a stronger creation, or are other things of our creation, (the angels, the heavens etc.)?” We have indeed created them from sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ask them: \"Are they harder to create, or those whom We have created\" Verily, We created them of a sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ask them whether they are stronger in creation or those (others) whom We have created. Surely We created them of firm clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ask them for a pronouncement -- Are they stronger in constitution, or those We created? We created them of clinging clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ask them (O Muhammad): Are they stronger as a creation, or those (others) whom we have created? Lo! We created them of plastic clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, ask those who deny the truth if it was harder to create them than all the other things We have created? We created them from sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them thou: are they stronger in structure or those others whom We have created? Verily We! We have created them of a sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, is their creation more prodigious or [that of other creatures] that We have created? Indeed, We created them from a viscous clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just ask their opinion: are they the more difficult to create, or the (other) beings We have created? Them have We created out of a sticky clay!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ask them (i.e. these polytheists, O Muhammad SAW): \"Are they stronger as creation, or those (others like the heavens and the earth and the mountains, etc.) whom We have created?\" Verily, We created them of a sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ask them, are they stronger in constitution, or those whom We have created. We have created them of sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Inquire of them, “Are they more difficult to create, or the others We created?” We created them from sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then inquire of them, [O Muhammad], \"Are they a stronger [or more difficult] creation or those [others] We have created?\" Indeed, We created men from sticky clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:11] So ask them, in other words, inquire of the people of Mecca for affirmation or by way of rebuke: Are they stronger as a creation, or those [others] whom We created?, of angels, heavens, the two earths and all that is in them (the use of man, ‘those whom’ [in man khalaqnā] indicates that the reference is predominantly to [other] rational creatures). Indeed We created them, that is, their origin, Adam, from a viscous clay, that sticks to the hand. The [intended] meaning is that their physical make-up is fragile so let them not behave arrogantly by rejecting the Prophet and the Qur’ān, a fact which will result in their — easily accomplished — destruction.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا دِيَارِهِمْ خَلَقْنَا إِنَّا خَلَقْنَاهُمْ مِنْ طِينٍ لَازِبٍ (11)الفاء تفريع على قوله : { إنَّا زيَّنا السَّماء الدنيا بزينةٍ الكواكب } \\[ الصافات : 6 \\] باعتبار ما يقتضيه من عظيم القدرة على الإِنشاء ، أي فسَلْهُم عن إنكارهم البعث وإحالتِهم إعادةَ خلقهم بعد أن يصيروا عظاماً ورفاتاً ، أخَلْقُهم حينئذٍ أشدّ علينا أم خلق تلك المخلوقات العظيمة؟وضمير الغيبة في قوله : { فَاستفتِهِم } عائد إلى غير مذكور للعلم به من دلالة المقام وهم الذين أحالوا إعادة الخلق بعد الممات . وكذلك ضمائر الغيبة الآتية بعده وضمير الخطاب منه موجه إلى النبي صلى الله عليه وسلم أي فسَلْهم ، وهو سؤال محاجة وتغليط .والاستفتاء : طلب الفَتوى بفتح الفاء وبالواو ، ويقال : الفُتْيَا بضم الفاء وبالياء . وهي إخبار عن أمر يخفَى عن غير الخواصّ في غرض مَّا . وهي :إمّا إخبار عن علم مختص به المخبِر قال تعالى : { يوسف أيها الصديق أفتنا في سبع بقرات } \\[ يوسف : 46 \\] الآية ، وقال : { يستفتونك قل الله يفتيكم في الكلالة } \\[ النساء : 176 \\] ، وتقدم في قوله : { الذي فيه تستفتيان } في سورة \\[ يوسف : 41 \\] .وإمَّا إخبار عن رأي يطلب من ذي رأي موثوق به ومنه قوله تعالى : { قالت يا أيها الملأ أفتوني في أمري } في سورة \\[ النمل : 32 \\] .والمعنى : فاسألهم عن رأيهم فلما كان المسؤول عنه أمراً محتاجاً إلى إعمال نظر أطلق على الاستفهام عنه فعل الاستفتاء .وهمزة : أهُم أشدُّ خَلْقاً } للاستفهام المستعمل للتقرير بضعف خلق البشر بالنسبة للمخلوقات السماوية لأن الاستفهام يؤول إلى الإقرار حيث إنه يُلجىء المستفهم إلى الإِقرار بالمقصود من طرفي الاستفهام ، فالاستفتاء في معنى الاستفهام فهو يستعمل في كل ما يستعمل فيه الاستفهام . و { أشدّ } بمعنى : أصعب وأعسر .و { خَلْقاً } تمييز ، أي أخلقهم أشدّ أم خَلْق من خلقنا الذي سمعتم وصفه .والمراد ب { مَن خَلَقْنا } ما خَلَقَه الله من السماوات والأرض وما بينهما الشامل للملائكة والشياطين والكواكب المذكورة آنفاً بقرينة إيراد فاء التعقيب بعد ذكر ذلك ، وهذا كقوله تعالى : { أأنتم أشد خلقاً أم السماء } \\[ النازعات : 27 \\] ونحوه .وجيء باسم العاقل وهو { مَن } الموصولة تغليباً للعاقلين من المخلوقات .وجملة { إنا خلقناهم من طين لازب } في موضع العلة لما يتولد من معنى الاستفهام في قوله : { أهم أشد خلقاً أم من خلقنا } من الإِقرار بأنهم أضعف خلقاً من خلق السماوات وعوالمها احتجاجاً عليهم بأن تأتِّي خلقهم بعد الفناء أهون من تَأتي المخلوقات العظيمة المذكورة آنفاً ولم تكن مخلوقة قبلُ فإنهم خلقوا من طين لأن أصلهم وهو آدم خلق من طين كما هو مقرر لدى جميع البشر فكيف يحيلون البعث بمقالاتهم التي منها قولُهم : { أإذَا مِتنا وكنا تُراباً وعِظاماً أءِنَّا لَمَبْعُوثونَ } \\[ الصافات : 16 \\] .والطينُ : التراب المخلوط بالماء .واللازب : اللاصق بغيره ومنه أطلق على الأمر الواجب «لازب» في قول النابغة :ولا يحسبون الشر ضَربةَ لازب ... وقد قيل : إن باء لازب بدل من ميم لازم ، والمعنى : أنه طين عتيق صار حَمْأة . وضمير { إنَّا خلقناهُم } عائد إلى المشركين وهو على حذف مضاف ، أي خلقنا أصلهم وهو آدم فإنه الذي خلق من طين لازب ، فإذا كان أصلهم قد أنشىء من تراب فكيف ينكرون إمكان إعادة كل آدمي من تراب .\n\n",
      "translations": [
        {
          "translation": "(Then ask them (0 Muhammad)) ask the people of Mecca: (Are they stronger as a creation) as a resurrected people, (or those (others) whom We have created) of angels and all other people? (Lo! We created them of plastic) sticking (clay) We created them from Adam and Adam is from clay.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱسْتَفْتِهِمْ } معناه فسَلْهُمْ\n\n\n\n\nوقوله تعالى: { مِّن طِينٍ لاَّزِبٍ } معناه لاَزمٌ لاَزقٌ\n واللازبُ من الطينِ اللزجُ\n ويقال: الجَيدُ\n\n",
      "translations": [
        {
          "translation": " And His saying, \"Ask them,\" its meaning is \"consult them.\"\n\n\nAnd His saying, {from a clay that is not wet} [means that] it is not necessary [for the clay] to be wet.\n\n\nAnd the {lazb} is from the {tayin} {lazaj}.\n\n\nIt is said that goodness is the best.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱسْتَفْتِهِمْ } أي: المشركين المتخذين الشياطين أولياء آلهة من دوننا\n واستخبرهم يا أكمل الرسل على سبب التبكيت والتعبير تنصيصاً على غيهم\n وتصريحاً بكفرهم واستحقاقهم العذاب المؤبد والنكال المخلد { أَهُمْ } أي: آلهتهم وشياطينهم { أَشَدُّ خَلْقاً } أي: إيجاداً وتأثيراً { أَم مَّنْ خَلَقْنَآ } وأظهرنا بمقتضى قدرتنا الكاملة من المخلوقات المذكورة التي هي الملائكة الصافات\n والسماوات المطبقات\n والكواكب المتفاوتة في التأثيرات فيها\nت والأرض وما عليها من المركبات والمواليد\n وبينهما من الممتزجات وغير ذلك من الاستعدادات القابلة لشروق شمس الذات\n سيما { إِنَّا خَلَقْنَاهُم } وقدرنا وجوده هؤلاء المتخذين لغيرنا أرباباً أولاً { مِّن طِينٍ لاَّزِبٍ } [الصافات: 11] لاصق منتن مهين لازم النتن و الهوان\n ثم ربيناهم بانواع التربية إلى أن سويناهم رجالاً عقلاء\n ليعترفوا بتوحيدنا وبألوهيتنا وربوبيتنا\n ويواظبوا على شكر نعمتنا\n فعكسوا الأمر واتخذوا أولياء من دوننا\n واعتقدوهم آلهة سوانا\n وبالجملة: انقلبوا خاسرين\n\n\nأو المعنى: { فَٱسْتَفْتِهِمْ } وسلهم\n أي: المشركين { أَهُمْ } في أنفسهم { أَشَدُّ خَلْقاً } وأعظم مخلوقاً { أَم مَّنْ خَلَقْنَآ } من المخلوقات المذكورة سابقاً مع أنهم لم يتخذوا إلهاً سوانا\n ولم يعبدوا غيرنا\n هؤلاء الحمقى كيف اتخذوا من دوننا أولياء\n ويسمونهم آلهة شفعاء\n مع أنهم أضعف بالنسبة إليهم\n مخلوقين من أدون الأشياء وأرذلها؟! { إِنَّا خَلَقْنَاهُم } وقدرنا وجودهم { مِّن طِينٍ لاَّزِبٍ } [الصافات: 11] مسترذل منتن تستكرهه الطبائع\n\n\nومهما سمعت يا أكمل الرسل قولهم وإنكارهم للتوحيد وإشراكهم بالله أدون الأشياء مع ضعف خلقهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فَاسْتَفْتِهِمْ } أي: فاستخبر كفّار مكّة { أَهُمْ أَشَدُّ خَلْقاً } أي: أقوى خلقاً وأعظم\n أو: أصعب خلقاً وأشقه\n { أَم مَّنْ خَلَقْنَا } يعني ما ذكر من السماء والأرض وما بينهما\n وما يعمرهما من الملائكة والكواكب\n والشُهب الثواقب؟ وجيء بـ \" مَنْ \" تغليباً للعقلاء\n ويدلّ عليه قراءة مَن قرأ: أم من عددنا بالتشديد والتخفيف\n والقصد: الرد على منكري البعث\n فإنَّ مَن قدرَ على خلق هذه العوالم\n على عظمها\n كان على بعثهم أقدر\n ثم ذكر ضعف أصلهم بقوله: { إِنا خلقناهم من طين لازب } لاصق باليد\n أو: لازم\n وقرىء به\n أي: يلزم مَن جاوره ويلصق به\n وهذا شاهد عليهم بالضعف لأن ما يصنع من الطين غير موصوف بالصلابة والقوة\n أو احتجاج عليهم بأن الطين اللازب الذي خُلقوا منه إنما هو تراب\n فمن أين استنكروا أن نخلق من تراب مثله خلقاً آخر؟ حيث قالوا:\n[الرعد: 5]\n الخ\n وهذا المعنى يعضده ما يتلوه بعدُ من ذكر إنكارهم البعث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:76",
      "similarity": 0.1398586560704358
    },
    {
      "verse": "38:71",
      "similarity": 0.13981483414208593
    },
    {
      "verse": "32:7",
      "similarity": 0.13209363838365704
    },
    {
      "verse": "7:12",
      "similarity": 0.1313705776676008
    },
    {
      "verse": "6:2",
      "similarity": 0.1304992999250099
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/037011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/037011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/37:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}