{
  "chapter": "الصافات",
  "text": "الا من خطف الخطفة فاتبعه شهاب ثاقب",
  "translations": [
    {
      "translation": "except for him who snatches a snippet and then is pursued by a piercing flame.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who eavesdrop and are pursued by a shooting flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any is able to snatch a fragment, he is pursued by a piercing flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them who stealthily steal words from the heavens are pursued by a glistening flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except one who sometimes steals a part, so a blazing flame goes after him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except such as snatch away something by stealing, and they are pursued by a flaming fire of piercing brightness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him who snatches off but once, then there follows him a brightly shining flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except such as snatches a fragment, and he is pursued by a piercing flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who snatcheth a fragment, and there pursueth him a piercing flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if anyone does succeed in snatching a glimpse [of such knowledge], he shall be pursued by a piercing flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him who snatcheth away a word by stealth, and him then pursueth a glowing flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except any who snatches a snatch, whereat a piercing flame pursues him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except such as snatch away something by stealth, and they are pursued by a flaming fire, of piercing brightness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except such as snatch away something by stealing and they are pursued by a flaming fire of piercing brightness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except such as snatches a fragment, and he is pursued by a piercing flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for him who snatches a fragment—he gets pursued by a piercing projectile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except one who snatches [some words] by theft, but they are pursued by a burning flame, piercing [in brightness].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:10] except him who snatches a fragment (al-khatfa is the verbal noun, that is to say, ‘[that] one time’; the exceptive clause refers to the subject [of the verb] yasma‘ūna, in other words, ‘the only devil that is able to   listen is the one that hears a word from the angels and snatches it away quickly’) and who is then pursued by a piercing flame (shihāb is a meteor) that pierces him, or burns him or robs him of his senses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save him who snatcheth a fragment) save him who snatches a little of the words of the angels, (and there pursueth him a piercing flame) and is chased by a bright star which burns him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ مَنْ خَطِفَ ٱلْخَطْفَةَ } معناه استلَبَ { فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ } معناه مُضيءٌ بَيّنٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, the Most High, {Except for whoever steals the stealing} means: he who {then follows him is a piercing flame} meaning: a clear light.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَنْ خَطِفَ ٱلْخَطْفَةَ } أي: يُطرد الماردون، ولا يسمعون إلا من اختطف واختلس من الملائكة الخطفة على سبيل المسارقة { فَأَتْبَعَهُ } أي: تبعه ولحقه على الفور حين اختطافه واختلاسه { شِهَابٌ ثَاقِبٌ } [الصافات: 10] أي: كوكب مضيء كجذوة النار، يثقب الجني فيقتله، أو يحرقه، أو يخبله\n\n\n\n\nوالقول بأن الشهب من الأمور الكائنة في الجو من الكواكب قول تخميني ابتدعه الفلاسفة من تلقاء نفوسهم، لا يعضده عقل، ولا يوافقه نقل\n\n\n\n\nوأما قولهم في ضبط الحركات الفلكية والأجرام العلوية، وتقويم الكواكب والبروج، وتقدير الأشكال والصور إلى غير ذلك من الأمورم المؤدية إلى الحس رما يؤدي إلى اليقين، أمَّا في طبائع المكونات وحقائق الموجودات، وكيفية تراكيب الماهيات وغير ذلك من الأمور الحقيقية التي لا مجال للحس فيها ولا لعقل، ما هو إلا تخمين زائل وزور باطل؛ إذ لا يعرف كنه الأشياء إلا خالقها ومظهرها، لا يسع لأحد أن يتفوه عنها، وعن كيفيتها وكميتها وكمية التئامها على ما هي عليها والتركيبات الحقيقية\n\n\n\n\nوهم؛ أي: مرادة الشياطين بمجرد تلك الخطفة المختلسة يضلون كثيراً من الناس إلى حيث يستبعدونهم، ويأمرونهم بالإطاعة والانقياد إلى أنفسهم، والعبادة إياهم باتخاذهم أولياء آلهة من دوننا جهلاً وعناداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "86:3",
      "similarity": 0.6886028766400959
    },
    {
      "verse": "15:18",
      "similarity": 0.3383240810559448
    },
    {
      "verse": "29:67",
      "similarity": 0.2903751473857076
    },
    {
      "verse": "72:9",
      "similarity": 0.28207183424182125
    },
    {
      "verse": "27:7",
      "similarity": 0.2632438473247461
    }
  ]
}