{
  "chapter": "الصافات",
  "text": "وما منا الا له مقام معلوم",
  "translations": [
    {
      "translation": "'There is not one of us who does not have a known station.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of us who does not have his appointed place,\" (declare the angels.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for us, there is none but has an appointed station.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels say, \"Each of us has an appointed place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the angels say, “Each one of us has an appointed known position.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not one of us (angels) but has his known place;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none of us but has an assigned place,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None of us is there, but has a known station;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of us but hath his known position.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The angels say], \"Every single one of us has his place assigned:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of us there is none but hath a station assigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘There is none among us but has a known place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Those ranged in ranks say): \"Not one of us but has a place appointed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of us (angels) but has his known place (or position);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Gabriel said to the Prophet): 'Each of us has a known place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“There is not one of us but has an assigned position.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The angels say], \"There is not among us any except that he has a known position.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:164] Gabriel said to the Prophet (s): And there is not one of us, [us] the company of angels, but has a known station, in the heavens, in which he worships God and which he does not transgress.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is not one of us) said Gabriel (pbuh) (but hath his known position) a known position in heaven.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما اتخذ بعض المشركين الملائكة آلهة، واعتقدوهم بنات الله، وعبدوا لهم كعبادته سبحانه، ردَّ الله عليهم حاكياً عن اعتراف الملائكة بالعبودية، فقال سبحانه من قبل الملائكة: { وَ } كيف يلي بنا أن نرضى بما افترى المشركون علينا من استحقاق العبادة والشركة في الألوهية؛ إذ { مَا مِنَّآ } أحد { إِلاَّ لَهُ مَقَامٌ } في العبودية والتوجه نحن الحق { مَّعْلُومٌ } [الصافات: 164] معين مقدر من عنده سبحانه، لا يسع له أن يتجاوز عنه بلا إذن منه سبحانه، بل يلازم كل منا مقامه لمقدر له من ربه، متوجهاً إليه سبحانه، منتظراً لأمره وحكمه بلا غفلة وفترة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله حاكياً عن الملائكة: { وما منّا إِلا له مَقامٌ معلومٌ } في العبادة، أو: في السموات، نعبد الله فيه، أو: في القُرب والمشاهدة لا نتعداه، ولا نترقى عنه إلى غيره، ففيه تنبيه واعتراف بافتقارهم لمخصصهم، القاضي بحدوثهم\n وفي اعترافهم بذلك ردٌّ على زعم الكفار أنهم بنات الله، أو شركاء له، وتنزيه له تعالى عن ذلك لتنافي العبودية والطاعة التي اعترفوا بها، والبنوة المدّعاة من الكفار، تعالى الله عن قولهم\n وهذا يجري أيضاً في القول الذي يقول: إنهم قسم ثالث، ليسوا بجوهر ولا عرض، كالأرواح، فإنها على تقدير كونها كذلك، جائزة لقبولها التفاوت في العلوم والمعارف وغير ذلك\n وذلك قاضٍ بالافتقار، والتخصيص لِمَا هي عليه، المستلزم للحدوث\n قاله في الحاشية\n قلت: القول بأن الملائكة مجردات عن المادة، هو قول الفلاسفة، ونحى إليه الغزالي\n وهو مناقض للقرآن والحديث لأن كونهم صفوفاً قائمين، أو ساجدين، أو سائرين، يقتضي تشكيلَهم وتحييزَهم، فيستلزم المادة إلا أنها نورانية لطيفة، وكذلك الأرواح، على ما في الأحاديث، فإنها متحيزة على أشكال لطيفة\n والله أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:52",
      "similarity": 0.5769220761395156
    },
    {
      "verse": "21:107",
      "similarity": 0.5148453243022234
    },
    {
      "verse": "81:29",
      "similarity": 0.4938230567402117
    },
    {
      "verse": "38:87",
      "similarity": 0.47907983341923965
    },
    {
      "verse": "81:27",
      "similarity": 0.47907983341923965
    }
  ]
}