{
  "chapter": "الصافات",
  "text": "وانا لنحن الصافون",
  "translations": [
    {
      "translation": "We are those drawn up in ranks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we are truly those who stand in rows,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily we range ourselves in rows (as humble servants)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We stand in ranks (for prayer)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And indeed we, with our wings spread, await the command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, we (angels), we stand in rows;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely we are they who draw themselves out in ranks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we are the rangers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! we, even we are they who set the ranks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we are those who stand ranged in ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily we! we are ranged in ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is we who are the ranged ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we are verily ranged in ranks (for service);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, we (angels), we stand in rows for the prayers (as you Muslims stand in rows for your prayers);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are surely those who are arranged in ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we are the arrangers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, we are those who line up [for prayer].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:165] And indeed it is we who are the rangers, of our feet in prayer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! we, even we, are they who set the ranks) in prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّا } معشر الملائكة { لَنَحْنُ ٱلصَّآفُّونَ } [الصافات: 165] على الاستقامة حول عرش الرحمن كصفوف الناس في المساجد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِنا لنحن الصافُّون } نصفّ أقدامنا في الصلاة، أو: نصفّ حول العرش داعين للمؤمنين، { وإِنا لنحنُ المسبِّحُون } المنزّهون الله تعالى عما نسبته إليه الكفرة، من الولد، وغير ذلك من الأباطيل المذكورة\n أو: المشتغلون بالتسبيح على الدوام، أو: المصلُّون\n ويحتمل أن يكون هذا وما قبله من قوله: { سبحان الله\n\n\n } الخ، من كلام الملائكة، حتى يتصل بذكرهم، كأنه قيل: ولقد عَلِمَ الملائكةُ أن المشركين محضرون للعذاب على افترائهم على الله فيما نسبوا إليه، وقالوا: سبحان الله، ونزّهوه عن ذلك، واستثنوا عباد الله المخلصين، وبرّؤوهم من ذلك، وقالوا للكفرة: وإذا صحّ ذلك فإنكم وآلهتكم لا تقدرون أن تفتنوا على الله أحداً من خلقه، وتضلُّوه، إلاّ مَن كان من أهل النار، وكيف نكون مناسِبين لرب العزة! وما نحن إلا عبيد أذلاء بين يديه، لكلّ منا مقامٌ من الطاعة معلومٌ، لا يستطيع أن يزلَّ عنه، ونحن نصفّ أقدامنا لعبادته، مسبِّحين بحمده، كما يجب على العباد\n ولعل قولهم: { وما منا إِلا له مقام معلوم } إشارة إلى تفاوتهم في درجات القُرب ومقامات اليقين: وقولهم: { وإِنا لنحن الصافُّون } إشارة إلى تفاوتهم في الطاعات والعبادات، وهم طبقات: منهم هائمون مستغرقون في الشهود، ومنهم مستغرقون في مقام الهيبة والمراقبة، ومنهم مستغرقون في الخدمة والعبادة\n والله تعالى أعلم\n الإشارة: مادة الآدمي أكمل من مادة الملائكة، فإذا اتصل العبد بشيخ كامل، واعتنى بتصفية روحه وسره، طَوى نوره الوجودَ بأسره، ولا يزال يترقى في معاريج أسرار التوحيد والتفريد، وتتوارد عليه الكشوفات، والعلوم، والأسرار، في هذه الدار الفانية، وفي تلك الدار الباقية، أبداً سرمداً، بخلاف الملائكة، فإنَّ لكل واحد مقاماً معلوماً لا يتعداه، كما أخبر تعالى: وسرُّ ذلك: أن الآدمي فيه بشرية وروحانية، فكلما جاهد نفسه، وغاب عن حس بشريته ترقى في معارج التوحيد، والمجاهدة لا تنقطع عنه في هذه الدار لأنها دار أكدار، فلا ينقطع عنه الترقي في المشاهدة، وأما في تلك الدار فالترقي فيها من باب الكرم والإثابة على ما هنا\n\n\nوأيضاً: البشرية للآدمي بمنزلة الطلاء للمِرآة، فالمرآة بلا طلاء لا ترى فيها صور الأشياء، كذلك الملائكة لا بشرية لهم، فلا تنكشف لهم الحقائق كما تنكشف للآدمي، ولو كشف لهم ما انكشف له لذابوا\n والله أعلم\n قال في القوت: لَعمري إن سائر الملائكة لا ينتقلون في المقامات كترقي المؤمنين، إنما لكلٍّ مقام معلوم، لا ينتقل إلى غيره، إلا أنهم يُمدّون من ذلك بمدد لا نهاية له إلى يوم القيامة، بأكثر ما يزاد جملة البشر هـ\n قلت: ومعنى كلامه: أن الملائكة يُمدون في مقامهم بقوة لا يستطيعها البشر، فمَن كان في مقام الهيبة دام فيها، وقَوِي عليها، ومَن كان في مقام الخدمة، دام عليها، وقوي عليها، قوةً لا يطيقها البشر، ولا يترقى عنها، بخلاف الآدمي، فليست فيه هذه القوة، لكنه يترقى من مقام إلى مقام، ويترقى في المعارف على الدوام\n ثم بسط صاحب القوت في ذلك الكلام في فضائل الصلاة، وأنها جامعة لما فُرق على الملائكة من الأعمال والأذكار\n قال: وبذلك فضل المؤمنون الملائكة، وكذلك فضل الموقن أيضاً في مقامات اليقين من أعمال القلوب، على الأملاك بالتنقيل بأن جُمعت فيه، ورُفع فيها مقامات، والملائكة لا يُنقلون، بل كل ملك موقوف في مقام معلوم، لا ينقل منه إلى غيره، وإنما له المزيد من المقام الواحد على قدر قواه، وجمع ذلك كله في قلب المؤمن، ونقل فيه مقامات\n وكان له من كل مقام مشاهدات\n هـ\n قال المحشي الفاسي: وفيه نظر، مع تلقيهم ضروب الوحي الجامع للمقامات، فكيف لا يُمكّنهم تحققاً بها على اختلافها؟ ولو كان كما قال لكان كل مَلَكٍ إنما يتلقى من الوحي ما يناسبه، ويختص بمقامه، وليس الأمر كذلك ضرورة\n هـ\n قلت: وفي نظره نظر إذ لا يلزم من تلقيهم للوحي على أنواعه أن يترقوا به إذ ليس الترقي هو مجرد العلم، بل الترقي إنما هو أذواق ووجدان، وكشوفات بعد حصول العلم\n وقد يتحقق العلم بالمقام، ولا ينتقل عنه إلى غيره، بل قد يعلمه ولا يذوقه، كما هو محقق عند أهل الفن، ثم قال: والحق ما نبّه عليه البيضاوي\n وكلام القوت ينظر لقول الحكماء، ومثله كلام الإحياء\n هـ\n ونص البيضاوي في قوله تعالى:\n\n[البقرة: 33] الآية: إنَّ علوم الملائكة وكمالاتهم تقبل الزيادة، والحكماء مَنعوا ذلك في الطبقات العليا منهم، وحملوا عليه قوله تعالى: { وما منا إِلا له مقام معلوم }\n\n\nهـ\n قلت: ترقي الآدمي هو انتقاله من مقام إلى مقام، حتى يُكاشف بأسرار الذات وأنوار الصفات، ثم لا يزال يترقى في الأذواق والكشوفات، يتجدّد له في كل يوم وساعة، حلاوة وكشف لم تكن عنده قبلُ، بخلاف الملائكة، فإنما يترقى كل واحد في كشف أسرار مقامه، ويجد حلاوة في ذلك المقام لم تكن له قبلُ، ولا ينتقل عنه، فمَن كان من أهل الخدمة زاده الله حلاوتها\n ومَن كان من أهل المراقبة فكذلك\n ومَن كان من أهل المشاهدة غلب عليه السكر والهذيان، ولا يزيد على ذلك\n وهم الطبقة العليا، فلا منافاة بين كلام القوت وكلام البيضاوي لأن الترقي إنما هو في الأذواق والكشوفات، لا في العلوم الغيبية، ولا في الكمالات النفسية\n فتأمله\n وقال القشيري: الملائكة لا يتخطون مقامهم، ولا يتعدَّوْن حدَّهم، والأولياء مقامهم مستورٌ بينهم وبين الله، لا يطلع عليه أحد، والأنبياء ـ عليهم السلام ـ لهم مقام مشهورٌ، مُؤَيَّدٌ بالمعجزات الظاهرة لأنهم للخَلْقِ قدوة، فأمْرُهُم على الشهرة، وأَمْرُ الأولياء على السَّتْرِ\n هـ\n وقال الورتجبي: أهل البدايات في مقام الطاعات، والأوْسَاط في المقامات، مثل التوكل والرضا، والتسليم، والمُحبُّون في مقامات الحالات والمواجيد، وأهل المعرفة في مقام المعارف، ينقلون في المشاهدة من مقام إلى مقام، ولا يبقى المقام للموحدين، فإنهم مستغرقون في بحار الذات والصفات، فليس لهم مقام معلوم لأن هناك لم يكن لهم وقوف، حيث أفناهم قهرُ الجلال، والجمال، والعظمة، والكبرياء، عن كل ما وجدوا من الحق، فيبقوا في الفناء إلى الأبد\n هـ\n قلت: ما ذكر من الطبقات الثلاث هم العباد، والزهّاد، وأرباب الأحوال، وحالهم كحال الملائكة، يُمَدُّون في مقامهم، ولا ينتقلون منه، فلكل واحدة قوة في مقامه، لا يطبقها العارف، لكنه فاتهم بالترقي عنهم إلى مشاهدة الذات، والترقي فيها أبداً\n ثم قال الورتجبي في قوله تعالى: { وإِنا لنحن الصافُّون }: لمَّا كانوا من أهل المقامات المعلومات افتخروا بمقاماتهم في العبودية، من الصلاة والتسبيح، ولو كانوا من أهل الحقائق في المعرفة لفنوا عن ملاحظة طاعتهم، من استيلاء أنوار مشاهدة الحق عليهم، والاستغراق في بحارٍ من الألوهية\n قال بعضهم: لذلك قطعت بهم مقاماتُهم عن ملاحظة المِنَّة، حتى قالوا بالتفخيم: { إِنا لنحن } فلما أظهروا سرائرهم عارضوا إظهار أفعال الربوبية بالمعارضة، حتى قالوا:\n\n[البقرة: 30]\n هـ\n وكلامنا كله مع عامة الملائكة، وأما المقربون فالأدب الإمساك عنهم صلوات الله وسلامه عليهم\n ثم رجع إلى الكلام مع قريش، فقال: { وَإِن كَانُواْ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:1",
      "similarity": 0.9948255655411413
    },
    {
      "verse": "89:22",
      "similarity": 0.9380301026202782
    },
    {
      "verse": "78:38",
      "similarity": 0.681255319537473
    },
    {
      "verse": "20:64",
      "similarity": 0.6399881939014891
    },
    {
      "verse": "24:41",
      "similarity": 0.6298125157678487
    }
  ]
}