{
  "chapter": "الصافات",
  "text": "وبركنا عليه وعلى اسحق ومن ذريتهما محسن وظالم لنفسه مبين",
  "translations": [
    {
      "translation": "We showered blessings upon him and upon Ishaq. Among their descendants are good-doers and also people who clearly wrong themselves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him and Isaac. Among their descendants are some who do good, but some who wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him and Isaac. Among the offspring of the two some did good and some plainly wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had blessed him and Isaac. Some of their offspring were righteous and others were openly unjust to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent blessings upon him and Ishaq; and among their descendants – some who do good deeds, and some who clearly wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We blessed him and Ishaq. And of their progeny are (some) that do right, and some that plainly wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We showered Our blessings on him and on Ishaq; and of their offspring are the doers of good, and (also) those who are clearly unjust to their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him, and Isaac; and of their seed some are good-doers, and some manifest self-wrongers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him and Isaac. And of their seed are some who do good, and some who plainly wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and blessed him and Isaac too: some of their offspring were good, but some clearly sinned against their souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him and Is-haq; and of their offspring are some well-doers and some who wrong themselves manifestly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him and Isaac. Among their descendants [some] are virtuous, and [some] who manifestly wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We blessed him and Isaac: but of their progeny are (some) that do right, and (some) that obviously do wrong, to their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We blessed him and Ishaque (Isaac), and of their progeny are (some) that do right, and some that plainly wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We blessed him and Isaac, and from their offspring are some gooddoers, and others who clearly wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him, and Isaac. But among their descendants are some who are righteous, and some who are clearly unjust to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We blessed him and Isaac. But among their descendants is the doer of good and the clearly unjust to himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:113] And We blessed him, by multiplying his descendants, and Isaac, his son, [We also blessed] by appointing the majority of prophets from among his progeny. And among their descendants is he who is virtuous, [he who is] a believer, and he who plainly wrongs his soul, [he who is] a disbeliever, whose disbelief is manifest.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We blessed him) with good praise and righteous offspring (and Isaac. And of their seed) and of the offspring of Abraham and Isaac (are some who do good) who believe in Allah's divine Oneness, (and some who plainly wrong themselves) through disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { بَارَكْنَا عَلَيْهِ } أي: كثرنا الخير والبركة على إبراهيم { وَ } كذا { عَلَىٰ } ابنه { إِسْحَاقَ } كثرنا نسلهما إلى أن جعلنا { وَمِن ذُرِّيَّتِهِمَا مُحْسِنٌ } في الأعمال والأخلاق والأحوال، ذو نفع كثير على عباد الله وفقراء سبيله { وَظَالِمٌ لِّنَفْسِهِ } أي: تارك لحظوظ نفسه من الدنيا { مُبِينٌ } [الصافات: 113] ظاهر في الترك، مبالغ فيه إلى حيث يمنع عنها ضروريتها أيضاً، منجذباً نحو عالم اللاهوت، منخلعاً عن لوازم الناسوت، مائلاً نحو الحق بجميع قواه وجوارحه، طالباً الفناء فيه والبقاء ببقائه، ومنهم النبي صلى الله عليه وسلم والوصيّ - كرم الله وجهه - وابناه وأولادهما بطناً بعد بطن سلام الله عليهم أجمعين؛ حيث لا يلتفتون إلى حطام الدنيا ومزخرفاتها، إلا مقدار سدّ جوعة ولبس خرقة خشن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:112",
      "similarity": 0.5656707270944562
    },
    {
      "verse": "29:27",
      "similarity": 0.47716306597171293
    },
    {
      "verse": "38:45",
      "similarity": 0.403939968293075
    },
    {
      "verse": "14:39",
      "similarity": 0.347782610164993
    },
    {
      "verse": "23:29",
      "similarity": 0.3468967498832236
    }
  ]
}