{
  "chapter": "الصافات",
  "text": "وجعلوا۟ بينه وبين الجنة نسبا ولقد علمت الجنة انهم لمحضرون",
  "translations": [
    {
      "translation": "They claim there is a blood-tie between Him and the jinn but the jinn know very well that they will be arraigned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They link Him with jinns by lineage, yet the jinns know they will be brought before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have established a kinship between Allah and the angels; and the angels know well that these people will be arraigned (as culprits).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said that there is a relationship between Him and the jinn. The jinn certainly know that they will all be brought to suffer torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have appointed a relationship between Him and the jinns; and indeed the jinns surely know that they will be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have invented a kinship between Him and the Jinn, but the Jinn know well that they have indeed to appear (before Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assert a relationship between Him and the jinn; and certainly the jinn do know that they shall surely be brought up;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have set up a kinship between Him and the jinn; and the jinn know that they shall be arraigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they imagine kinship between him and the jinn, whereas the jinn know well that they will be brought before (Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They claim that He has kinship with the jinn, yet the jinn themselves know that they will be produced before Him [for judgement].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have made a kinship between Him and the jinn a kinship whereas the jinn assuredly know that they are to be brought up\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have set up a kinship between Him and the jinn, while the jinn certainly know that they will be presented [before Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have invented a blood-relationship between Him and the Jinns: but the Jinns know (quite well) that they have indeed to appear (before his Judgment-Seat)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have invented a kinship between Him and the jinns, but the jinns know well that they have indeed to appear (before Him) (i.e. they will be brought for accounts).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assert kinship between Him and the angels. But the angels know that they (the liars) will be arraigned (in Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they invented a relationship between Him and the jinn. But the jinn know that they will be arraigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have claimed between Him and the jinn a lineage, but the jinn have already known that they [who made such claims] will be brought to [punishment].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:158] And they, namely, the idolaters, have set up between Him, exalted be He, and the jinn, namely, the angels (jinna: they are so called because they are hidden [ijtinān] from vision) a kinship, by saying that they are God’s daughters, while the jinn certainly know that they, that is, those who say this, shall indeed be arraigned, into the Fire, to be chastised therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَجَعَلُوا بَيْنَهُ وَبَيْنَ الْجِنَّةِ نَسَبًا وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُونَ (158)عطف على جملة { ليقُولونَ } \\[ الصافات : 151 \\] أي شفَّعوا قولهم : { ولَدَ الله } \\[ الصافات : 152 \\] ، فجعلوا بين الله وبين الجنّ نسباً بتلك الولادة ، أي بينوا كيف حصلت تلك الولادة بأن جعلوها بين الله تعالى وبين الجنة نسباً .و { الجنّة } : الجماعة من الجن ، فتأنيث اللفظ بتأويل الجماعة مثل تأنيث رَجْلَة ، الطائفة من الرجال ، ذلك لأن المشركين زعموا أن الملائكة بنات الله من سَروات الجن ، أي من فريققِ نساء من الجن من أشراف الجن ، وتقدم في قوله تعالى : { أولم يتفكروا ما بصاحبهم من جِنة } في سورة \\[ الأعراف : 184 \\] .والنسب : القرابة العَمودية أو الأُفقية أي من الأطراف والكلام على حذف مضاف ، أي ذوي نسب لله تعالى وهو نسب النبوءة لزعمهم أن الملائكة بنات الله تعالى ، أي جعلوا لله تعالى نسباً للجِنّة وللجنة نسباً لله . وقوله : { بينه وبين الجِنَّة } يجوز أن يكون حالاً من { نَسَباً } أي كائناً بينه وبين الجنة ، أي أن نسبه تعالى ، أي نسله سبحانه ناشىء من بينه وبين الجن . ويجوز أن يكون متعلقاً ب { جعلوا } ، أي جعلوا في الاقتران بينه وبين الجن نسباً له ، أي جعلوا من ذلك نسباً يتولد له ، فقوله : { بينه وبين الجنة نسباً } هو كقولك : بين فلان وفلانة بنُون ، أي له منها ولها منه بنون ، وهذا المعنى هو مراد من فسره بأن جعلوا الجن أصهاراً لله تعالى ، فتفسيره النسب بالمصاهرة تفسير بالمعنى وليس المراد أن النسب يطلق على المصاهرة كما توهمه كثير ، لأن هذا الإِطلاق غير موجود في دواوين اللغة فلا تغتررْ به . ولعدم الغوص في معنى الآية ذهب من ذهب إلى أن المراد بالجنة الملائكة ، أي جعلوا بين الله وبين الملائكة نسب الأبوّة والبنوّة ، وهذا تفسير فاسد لأنه يصير قوله : { وجعلوا بينه وبين الجنة نسباً } إعادةً لما تقدم من قوله : { ألا إنهم من إفكهم ليقولون ولد الله } \\[ الصافات : 151 - 152 \\] ومن قوله : { أم خلقنا الملائِكَة إناثا وهم شاهِدونَ } \\[ الصافات : 150 \\] .ومن ذهب إلى أن المراد من { الجِنَّةِ } أصل الجِنّة وهو الشيطان وأن معنى الآية : أنهم جعلوا الله نسيباً للشيطان نسب الأخوة ، تعالى الله عن ذلك . على أنه إشارة إلى قول الثَّنَوية من المجوس بوجود إله للخير هو الله ، وإله للشر هو الشيطان وهم من ملل مجوس فارس وسموا إله الخير ( يَزْدَانَ ) وإله الشر ( أَهْرُمُنْ ) وقالوا : كان إله الخير وحده فخطر له خاطر في نفسه من الشر فنشأ منه إله الشر هو ( أهرمُن ) وهو ما نعاه المعري عليهم بقوله :قال أناسٌ باطلٌ زعمهم ... فراقبوا الله ولا تزعُمُنْفَكَّر ( يزدانُ ) على غِرة ... فصيغ من تفكيره ( أهرمُن )وهذا الدين كان معروفاً عند بعض العرب في الجاهلية من عرب العراق المجاورين لبلاد فارس والخاضعين لسلطانهم ولم يكن معروفاً بين أهل مكة المخاطبين بهذه الآيات ، ولأن الجِنّة لا يشمل الشياطين إذا أطلق فإن الشيطان كان من الجن إلا أنه تميز به صنف خاص منهم .وجملة { ولقد علمت الجنة إنهم لمحضرون } معترضة بين جملة { وجعلوا بينه وبين الجنة نسباً } وبين جملة { سُبحانَ الله عمَّا يصِفُونَ } \\[ الصافات : 159 \\] و { جعلوا بينه } الخ . . . حال والواو حالية ، وضمير { أنهم } عائد إلى المشركين أو إلى الجِنة ، والوجهان مرادان فإن الفريقين معاقبان . والمحضَرون : المجلوبون للحضور ، والمراد : محضَرون للعقاب ، بقرينة مقام التوبيخ فإن التوبيخ يتبعه التهديد ، والغالب في فعل الإِحضار أن يراد به إحضار سوء قال تعالى : { ولولا نعمة ربي لكنت من المحضرين } \\[ الصافات : 57 \\] ولذلك حذف متعلِّق «محضرون» ، فأما الإِتيان بأحد لإِكرامه فيطلق عليه المجيء . والمعنى : أن الجن تعلم كذب المشركين في ذلك كذباً فاحشاً يُجازَون عليه بالإِحضار للعذاب ، فجعل «محضرون» كناية عن كذبهم لأنهم لو كانوا صادقين ما عذبوا على قولهم ذلك . وظاهره أن هذا العلم حاصل للجن فيما مضى ، ولعل ذلك حصل لهم من زمان تمكنهم من استراق السمع . ويجوز أن يكون من استعمال الماضي في موضع المستقبل لتحقيق وقوعه مثل { أتى أمر الله } \\[ النحل : 1 \\] ، أي ستعلم الجِنة ذلك يوم القيامة . والمقصود : أنهم يتحققون ذلك ولا يستطيعون دفع العذاب عنهم فقد كانوا يعبدون الجن لاعتقاد وجاهتهم عند الله بالصهر الذي لهم .\n\n",
      "translations": [
        {
          "translation": "(And they) the disbelievers of Mecca, and the Banu Malih specifically (imagine kinship between him and the jinn) they claimed that there is a kinship between Allah and the angels when they said that the angels are Allah's daughters; it is also said that this was revealed about the dualists who claimed that Iblis, may Allah curse him, is Allah's partner in that Allah created good while Iblis created evil, (whereas the jinn) the angels (know well that they) i.e. the disbelievers of Mecca: the Banu Malih (will be brought before (Him)) will be chastised in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وجعلهم بكمال ذاته وصفاته وأسمائه { جَعَلُواْ } وأثبتوا { بَيْنَهُ } سبحانه { وَبَيْنَ ٱلْجِنَّةِ } الذين هم مخلوقون من النار { نَسَباً } أي: نسبة بالمصاهرة\n ويزعمون - العياذ بالله - أنه سبحانه تزوج منهم امرأة\n فحصلت منها الملائكة { وَ } والله { لَقَدْ عَلِمَتِ ٱلجِنَّةُ إِنَّهُمْ } أي: أولئك المفترين على الله بأمثال هذه المفتريات البعيدة عن جنابه مراء { لَمُحْضَرُونَ } [الصافات: 158] في العذاب المخلد\n والنكال المؤبد بقولهم هذا\n ونسبتهم هذه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:101",
      "similarity": 0.7830867491558126
    },
    {
      "verse": "25:54",
      "similarity": 0.5316804935576609
    },
    {
      "verse": "81:14",
      "similarity": 0.19032732980467065
    },
    {
      "verse": "37:127",
      "similarity": 0.18818924030719078
    },
    {
      "verse": "37:57",
      "similarity": 0.18005328958348657
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/037158.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/037158.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/37:158.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}