{
  "chapter": "الصافات",
  "text": "فلما بلغ معه السعى قال يبنى انى ارى فى المنام انى اذبحك فانظر ماذا ترى قال يابت افعل ما تؤمر ستجدنى ان شاء الله من الصبرين",
  "translations": [
    {
      "translation": "When he was of an age to work with him, he said, 'My son, I saw in a dream that I must sacrifice you. What do you think about this?' He said, 'Do as you are ordered, father. Allah willing, you will find me resolute.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he was old enough to go about with him, he said: \"O my son, I dreamt that I was sacrificing you. Consider, what you think?\" He replied: \"Father, do as you are commanded. If God pleases you will find me firm.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when he was old enough to go about and work with him, (one day) Abraham said to him: “My son, I see in my dream that I am slaughtering you. So consider (and tell me) what you think.” He said: “Do as you are bidden. You will find me, if Allah so wills, among the steadfast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his son was old enough to work with him, he said, \"My son, I have had a dream that I must sacrifice you. What do you think of this?\" He replied, \"Father, fulfill whatever you are commanded to do and you will find me patient, by the will of God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he became capable of working with him, Ibrahim said, “O my son, I dreamt that I am sacrificing you – therefore now consider what is your opinion”; he said, “O my father! Do what you are commanded! Allah willing, you will soon find me patiently enduring!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when he (his son) was old enough to walk with him, he said: \"O my son! I have seen in a dream that I am slaughtering you. So look what you think!\" He said: \"O my father! Do that which you are commanded, if Allah wills, you shall find me of the patient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained to working with him, he said: O my son! surely I have seen in a dream that I should sacrifice you; consider then what you see. He said: O my father! do what you are commanded; if Allah please, you will find me of the patient ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when he had reached the age of running with him, he said, 'My son, I see in a dream that I shall sacrifice thee; consider, what thinkest thou?' He said, 'My father, do as thou art bidden; thou shalt find me, God willing, one of the steadfast.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when (his son) was old enough to walk with him, (Abraham) said: O my dear son, I have seen in a dream that I must sacrifice thee. So look, what thinkest thou? He said: O my father! Do that which thou art commanded. Allah willing, thou shalt find me of the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached the age when he could work with him, he said, \"O my son, I have seen in a dream that I am sacrificing you. So tell me what you think of it!\" He replied, \"O my father, do as you are commanded; and God willing, you will find me steadfast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he attained the age of, running with him, he said: O my son! verily I have seen in a dream that I am slaughtering thee; so look, what considerest thou? He said: O my father! do that which thou art commanded; thou shalt find me, Allah willing, of the patients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he was old enough to assist in his endeavour, he said, ‘My son! I see in dreams that I am sacrificing you. See what you think.’ He said, ‘Father! Do whatever you have been commanded. If Allah wishes, you will find me to be patient.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when (the son) reached (the age of) (serious) work with him, he said: \"O my son! I see in vision that I offer thee in sacrifice: Now see what is thy view!\" (The son) said: \"O my father! Do as thou art commanded: thou will find me, if Allah so wills one practising Patience and Constancy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when he (his son) was old enough to walk with him, he said: \"O my son! I have seen in a dream that I am slaughtering you (offer you in sacrifice to Allah), so look what you think!\" He said: \"O my father! Do that which you are commanded, Insha' Allah (if Allah will), you shall find me of As-Sabirin (the patient ones, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached the age of traveling with him, he said: 'My son, while I was sleeping I saw that I shall slaughter (sacrifice) you, tell me what is your opinion' He replied: 'Father, do as you are ordered (by Allah). Allah willing, you shall find me one of those who are steadfast'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he was old enough to accompany him, he said, “O My son, I see in a dream that I am sacrificing you; see what you think.” He said, “O my Father, do as you are commanded; you will find me, God willing, one of the steadfast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached with him [the age of] exertion, he said, \"O my son, indeed I have seen in a dream that I [must] sacrifice you, so see what you think.\" He said, \"O my father, do as you are commanded. You will find me, if Allah wills, of the steadfast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:102] And when he was old enough to walk with him, that is, to go about with him and help him out — this is said to have been [either] at the age of seven or at the age of thirteen — he said, ‘O my dear son, I see, that is, I have seen, in a dream that I shall sacrifice you — and the visions of prophets are [always] true and their actions are [inspired] by the command of God, exalted be He. So see what you think’, of this dream. He consulted him so that he [his son] might accept the idea of being sacrificed and comply with the command for it. He said, ‘O my father (the [final] tā’ [in abati] replaces the yā’ of the genitive [possessive] annexation [yā abī]) do whatever you have been commanded, to do. You shall find me, God willing, of the steadfast’, in this [affair].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when (his son) was old enough to walk with him) when his son was old enough to strive for Allah and obey Him; it is also said that this means: when his son was old enough to walk with him in the mountains, ((Abraham) said) to his son Ishmael; and it is also said: to his son Isaac: (0 my dear son, I have seen in a dream that I must sacrifice thee) I am commanded in a dream vision to sacrifice you. (So look, what thinkest thou) what do you say? (He said: O my father! Do that which thou art commanded) of sacrificing me. (Allah willing, thou shalt find me of the steadfast) in the face of this sacrifice.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعْيَ } معناه أطاقَ العَملَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ يٰبُنَيَّ } ناداه وصغَّره تحنناً وعطفاً: { إِنِّيۤ أَرَىٰ فِي ٱلْمَنَامِ أَنِّي أَذْبَحُكَ } بأمر الله إياي، تقرباً مني إليه سبحانه، وهدياً نحوه { فَٱنظُرْ } يا بني وتأمل { مَاذَا تَرَىٰ } أي: أي أمر تفكر وتفتي في هذه الواقعة الهائلة أتصبر على بلاء الله أم لا؟\n\n\n\n\nوبعدما سمع ابنه ما سمع من الرؤيا { قَالَ } معتصماً بحبل التوفيق، راضياً بما جرى عليه من قضاء الله مسلماً نحوه، مستقبلاً منادياً لأبيه لينبئ عن كمال إطاعته له وانقياده لحكم ربه: { يٰأَبَتِ ٱفْعَلْ مَا تُؤمَرُ } من قبل الحق، فاذبحني في سبيل الله تقرباً منك نحوه، وطلباً لمرضاته، ولا تلفت إلى لوازم الأبوة والنبوة، وكن أنت صابراً لبلاء الله بذبح ولدك بيدك بإذنه وفي سبيله { سَتَجِدُنِيۤ } أيضاً { إِن شَآءَ ٱللَّهُ } وتعلق إرادته بأن اصبر على بلائه الذي هو قتل أبي إياي بيده { مِنَ ٱلصَّابِرِينَ } [الصافات: 102] المتكنين على تحمل الشدائد والمصيبات الآتية من قبل الحق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال الكواشي: لم يرَ أنه يذبحه في النوم، ولكنه أُمر في النوم بذبحه، بدليل قوله: { افعل ما تؤمر }\n وقيل: رأى أنه يُعالج ذبحه، ولم يرَ إراقة الدم\n وقال قتادة: رؤيا الأنبياء حق، إذا رأوا شيئاً فعلوه\n وفي رؤيا ذلك في النوم وتحققه إياه حتى عمل بما رأى، إيذان بأن الأنبياء قد تجوهرت نفوسهم، فلا مجال للكذب فيما يُوحى إليهم، وفيما يصدر عنهم، فهم صادقون مصدِّقون، فليس للشيطان عليهم سبيل، وإيذان بأن مَن كان في منامه صادقاً كان يقظته أولى بالصدق\n هـ\n وإنما لم يقل: \" رأيت \" لأنه رأى مرة بعد أخرى، فقد قيل: رأى ليلة التروية كأنّ قائلاً يقول له: إن الله يأمرك بذبح ابنك هذا، فلما أصبح روَّى في ذلك من الصباح إلى الرواح ليعلم أَمِنَ اللهِ هذا الحلم، أم لا، فسُمِّي يوم التروية، فلما أمسى رأى مثل ذلك، فعرف أنه من الله، فسُمِّي يوم عرفة، ثم رأى مثله في الليلة الثالثة، فهمَّ بنحره، فسُمِّي يوم النحر\n\n\nواخْتُلِف مَن المخاطب المأمور بذبحه، فقال أهل الكتابين: هو إسحاق، وبه قال عمر، وعليّ، وابن مسعود، والعباس، وابنه عبد الله، وكعب الأحبار، وسعيد بن جبير، وقتادة، ومسروق، وعكرمة، والقامس بن أبي بَرّة، وعطاء، ومقاتل، والزهري، والسدي\n قال سعيد بن جبير: أُريَ إبراهيم ذبح إسحاق في المنام، فسار به على البراق مسيرة شهر في غداة واحدة، حتى أتى المنحر بمِنى، فلما صرف عنه الذبح، وأمره أن يذبح الكبش، وذبحه، سار به مسيرة شهر في روحة واحدة، طُويت له الأودية والجبال\n هـ\n واحتج أهل هذا القول بأنه ليس في القرآن أن إبراهيم بُشِّر بولد إلا بإسحاق، وقال هنا: { فبشرناه بغلام } فتعيَّن أنه إسحاق إذ هو المبَشَّر به في غير هذه الآية، وبأن الذي كان يسعى معه في حوائجه وأشغاله إنما هو إسحاق، وأما إسماعيل فإنما كان بمكة غائباً عنه، ولم يثبت في الصحيح أن إبراهيم قَدِمَ مكة إلا ثلاث مرات وإسماعيل متزوج\n وبما رُوي أن موسى عليه السلام قال: يا رب الناس يقولون: إله إبراهيم وإسحاق ويعقوب، فبمَ ذلك؟ فقال: إن إبراهيم لم يعدل بي شيئاً قط إلا اختارني، وإن إسحاق جاد لي بالذبح، وهو لي بغير ذلك أجود، وإن يعقوب كلما زدته بلاءً زاد لي حسن ظن\n وقال يوسف للملك: أترغب أن تأكل معي، وأنا ـ والله ـ يوسف بن يعقوب، نبي الله، ابن إسحاق، ذبيح الله، ابن إبراهيم، خليل الله\n وبما رُوي أن نبينا ـ عليه الصلاة والسلام ـ سُئل: أي النسب أشرف؟ فقال:\n\n \" يوسف صدِّيق الله، ابن يعقوب إسرائيل الله، ابن إسحاق ذبيح الله، ابن إبراهيم خليل الله \" \n\nوفي الجامع الصغير: \" الذبيح إسحاق \" رواه الدارقطني عن ابن مسعود، والبزار وابن مردويه عن العباس، وأبي هريرة\n وقال آخرون: هو إسماعيل، وبه قال عُمر، وأبو الطفيل عامر بن واثلة، وسعيد بن المسيب، والشعبي، ويوسف بن مهران، ومجاهد، وابن عباس أيضاً، وغيرهم\n واحتجُّوا بأن البشارة بإسحاق متأخرة عن قصة الذبح\n وبقوله عليه السلام:\n\n \" أنا ابن الذبيحين \" \n\nفأحدهما: جده إسماعيل، والآخر: أبوه، فإن عبد المطلب نذر أن يذبح ولداً إن سَهُل له حفر زمزم، أو بلغ بنوه عشراً، فلما سَهُل، أقرع بينهم، فخرج السهم على عبد الله، فَفَدَاه بمائة من الإبل، ولذلك سنت الدية مائة\n وبأن ذلك كان بمكة، وكان قرنا الكبش معلَّقين بالكعبة حتى احترقا معها في أيام ابن الزبير، ولم يكن إسحاق ثمة\n هـ\n وقد يُجاب بأن البشارة أولاً كانت بولادته، والثانية بنبوته، أو: بسلامته\n وبأن الثانية تفسير للأولى، كأنه قال بعدما فرغ من ذكر المبشر به: وكانت تلك البشارة بإسحاق\n قاله الفاسي في حاشيته\n\n\nوعن الحديث بأن العم يُطلق عليه أباً، كقوله تعالى:\n\n[البقرة: 133] وكان عمًّا له، وتقدّم عن ابن جبير أن إبراهيم سار بابنه على البراق إلى مكة وحيث كان الذبح بها بقي القربان فيها\n والله تعالى أعلم بغيبه\n ولَمَّا قال له: { إِني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر } به { ستجدني إِن شاء الله من الصابرين } على الذبح\n رُوي أن إبراهيم قال لابنه: انطلق بنا نُقرب قرباناً لله تعالى، فأخذ سكيناً وحبلاً، ثم انطلق معه، حتى إذا ذهب بين الجبال، قال له الغلام: يا أبتِ أين قربانك؟ فقال: { يا بُني إِني أرى في المنام\n\n\n } الآية، فقال: يا أبت خذ بناصيتي، واجلس بين كتفي، حتى لا أؤذيك إذا أصابتني الشفرة، ولا تذبحني وأنا ساجد، واقرأ على أمي السلام، وإن رأيت أن تردّ قميصي إلى أمي فافعل، عسى أن يسليها عني\n قال إبراهيم: نِعْمَ العون أنت على أمر الله تعالى\n فربطه إبراهيم عليه السلام ثم جعل يُقبّله، وهو يبكي، والابن يبكي، حتى استنقعت الدموع تحت خده",
      "translations": []
    }
  ]
}