{
  "chapter": "الصافات",
  "text": "ولولا نعمة ربى لكنت من المحضرين",
  "translations": [
    {
      "translation": "If it were not for the blessing of my Lord, I would have been among those arraigned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the grace of my Lord I too would have been there (in Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for Allah's favour, I should be one of those who have been mustered here.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had I not the guidance of my Lord, I would certainly have been brought into torment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And were it not for the munificence of my Lord, I too would have been seized and brought forth (captive)!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the grace of my Lord, I would certainly have been among those brought forth (to Hell).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been for the favor of my Lord, I would certainly have been among those brought up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for my Lord's blessing, I were one of the arraigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been for the favour of my Lord, I too had been of those haled forth (to doom).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had not been for the blessing of my Lord, I would also have been taken to Hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And but for the favourcf my lord, I should have been of those brought forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for my Lord’s blessing, I too would have been among those mustered [in hell]!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the Grace of my Lord, I should certainly have been among those brought (there)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the Grace of my Lord, I would certainly have been among those brought forth (to Hell).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for the Favor of Allah I should have surely been among those who were arraigned (with you in Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for the grace of my Lord, I would have been among the arraigned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If not for the favor of my Lord, I would have been of those brought in [to Hell].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:57] And had it not been for the favour of my Lord, His grace to me in giving me faith, I [too] would have been of those arraigned’, with you, in the Fire. The inhabitants of Paradise will say:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And had it not been for the favour of my Lord) Who bestowed faith upon me and protected me from disbelief, (I too had been of those haled forth (to doom)) I too would be tormented with you in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و \" إن \" مخففة، واللام: فارقة، أي: إنه قربت لتهلكني، { ولولا نعمةُ ربي } عليَّ بالهداية، والعصمة، والتوفيق للتمسُّك بعروة الإسلام، { لكنتُ من المحْضَرين } معك، أو: من الذين أُحضروا العذاب، كما أُحْضِرْتَه أنت وأمثالك\n { أفما نحن بميتين إِلا مَوْتتنا الأولى وما نحن بمعذَّبين } الفاء للعطف على محذوف، أي: أنحن مخلّدون فما نحن بميتين ولا معذّبين\n وعلى هذا يكون الخطاب لرفقائه في الجنة، لما رأى ما نزل بقرينه، ونظر إلى حاله وحال رفقائه في الجنة، تحدُّثاً بنعمة الله\n أو: قاله بمرأى من قرينه ومسمع ليكون توبيخاً له، وزيادة تعذيب، ويحتمل أن يكون الخطاب لقرينه، كأنه يقول: أين الّذي كنت تقول في الدنيا من أنَّا نموت، وليس بعد الموت عقاب ولا عذاب؟ كقوله:\n\n[الدخان: 35] والتقدير: أكما كنت تزعم هو ما نحن بميتين إلا موتتنا الأولى، وما نحن بمعذَّبين، بل الأمر وقع خلافَه، وكان يقال له: نحن نموت ونُسأل في القبر، ثم نموت ونحيا، فيقول: ما نحن بميتين إلا موتتنا الأولى وما نحن بمعذَّبين\n\n\nوقوله تعالى: { إِنَّ هذا لهو الفوزُ العظيمُ\n\n\n } إلخ، يحتمل أن يكون من خطاب المؤمن لقرينه، وأن يكون من خطاب الله تعالى لنبيه عليه الصلاة والسلام، أي: إن هذا النعيم الذي نحن فيه لهو الفوز العظيم\n ثم قال الله عزّ وجل: { لمِثْلِ هذا فليعملِ العاملون } أي: لنيل مثل هذا يجب أن يعمل العاملون، لا للحظوظ الدنيوية، المشوبة بالآلام، السريعة الانصرام\n أو: لمثل هذا فليجتهد المجتهدون، ما دام يُمكنهم الاجتهاد، فإنَّ الدنيا دار عمل، والآخرة دار جزاء، فبقدر ما يزرع هذا يحصد ثَمَّ، وسيندم المفرط إذا حان وقت الحصاد\n الإشارة: تنسحب الآية من طريق الإشارة على مَن رام النهوض إلى الله، بصحبة الرجال في طريق التجريد، فينهاه رفقاؤه، فيخالفهم، وينهض إلى الله، فإذا كان يوم القيامة رُفع مع المقربين، فيقول لهم: إني كان قرين يُنكر طريقَ الخصوص، وينهاني عن صحبتهم، فيطلع عليه، فيراه في أسفل الجنة، مع عامة أهل اليمين، فيحمد الله على مخالفته، ويقول: لولا نعمةُ ربي لكنتُ من المحضَرِينَ معك\n قال القشيري: فيقول الوليُّ له: إن كدتَّ لتُردين، لولا نعمةُ ربي\n نطقوا بالحق، ولكنهم لم يُصَرِّحوا بعين التوحيد إذ جَعَلوا الفضلَ واسطة، والأَوْلى أن يقول: ولولا ربي لكنتُ من المحضَرين\n ثم يقول: لمثل هذا فليعملِ العاملون\n ثم قال: فإذا بدت شظيةٌ، من الحقائق، أو ذَرةٌ من نسيم القربة، فبالحريِّ أَن يقول القائل: لمِثل هذا الحال تُبذلُ الأرواحُ، وأنشدوا:\n\nثم قال تعالى: { أَذَلِكَ خَيْرٌ نُّزُلاً أَمْ\n\n\n }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:127",
      "similarity": 0.7369110360024631
    },
    {
      "verse": "81:14",
      "similarity": 0.7277947137274821
    },
    {
      "verse": "30:16",
      "similarity": 0.538556785800451
    },
    {
      "verse": "36:75",
      "similarity": 0.5121252850239947
    },
    {
      "verse": "23:98",
      "similarity": 0.4977053561655931
    }
  ]
}