{
  "chapter": "الصافات",
  "text": "دحورا ولهم عذاب واصب",
  "translations": [
    {
      "translation": "repelled with harshness - they will suffer eternal punishment -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kept far away. There is perpetual punishment for them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and are repelled. Theirs is an unceasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and driven away to suffer the necessary torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To make them flee, and for them is a never-ending punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Outcast, and theirs is a constant torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being driven off, and for them is a perpetual chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "rejected, and theirs is an everlasting chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Outcast, and theirs is a perpetual torment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "driven away, and will suffer eternal punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With a driving fusillade, and theirs shall be a torment perpetual;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to drive them away, and there is a perpetual punishment for them—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repulsed, for they are under a perpetual penalty,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Outcast, and theirs is a constant (or painful) torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are rejected and theirs is an everlasting punishment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repelled—they will have a lingering torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repelled; and for them is a constant punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[37:9] to repel [them] (duhūran is a verbal noun from daharahu, meaning, ‘he repelled him, driving him away’; it is an object denoting reason) and theirs, in the Hereafter, is an everlasting chastisement;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Outcast) they are driven away from heaven and from listening to the angels, (and theirs is a perpetual torment) by means of the stars; and it is also said that this means: in the Fire;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَهُمْ عَذابٌ وَاصِبٌ } معناه دائمٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ دُحُوراً } طرداً بليغاً وزجراً شديداً { وَ } مع ذلك الطرد الزجر { لَهُمْ } أي: للشياطين { } في النشأة الأخرى { عَذابٌ وَاصِبٌ } [الصافات: 9] مؤبَّد دائم، لا ينفك عنهم في حين من الأحيان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { دُحُوراً } مفعول له، أي: ويُقذفون للدحور، وهو الطرد، أو: مدحورين، على الحال، أو: لأن القذف والطرد متقاربان في المعنى، فيكون مصدراً له، فكأنه قيل: ويُقذفون قذفاً، { ولهم عذابٌ } آخر { واصبٌ } دائم، أو شديد، وهو عذاب الآخرة، أو: عذاب الدنيا لأنه دائم الوجوب لأنهم في الدنيا مرجمون بالشهب دائماً، { إِلا مَنْ خَطِفَ الخَطْفَةَ } \" مَنْ \": بدل من ضمير \" يسمعون \" ، أي: لا يتسمّع الشياطين إلا الشيطان الذي خَطِفَ الخطفةَ، أي: اختلس شيئاً من كلام الملائكة بسرعة، { فَأَتْبَعه شِهَابٌ ثاقبٌ } أي: نجم مضيء يثقبه، أو يحرقه، أو يخبله، ومنه تكون الغيلان\n والله تعالى أعلم\n الإشارة: أقسم الحق تعالى بصفوف الذاكرين، الزاجرين للخواطر عن قلوبهم، في طلب الحضور، التالين لذكر ربهم لرفع الستور، إنه منفرد في ألوهيته، متوحِّد في ربوبيته إذ هو ربُّ كل شيء، ربُّ سموات الأرواح، وربُّ أرض النفوس والأشباح، وربُّ مشارق أنوار العرفان، وهي قلوب أهل العيان، ولم يذكر المغارب لأن شمس القلوب إذا طلعت ليس لها مغيب\n قوله تعالى: { إِنا زَيَّنا السماءَ الدنيا\n\n\n } إلخ، قال القشيري: زيَّن السماء بالنجوم، وزيَّن قلوب أوليائه بنجوم المعارف والأحوال\n هـ\n وقوله تعالى: { وحِفظاً من كل شيطان مارد } قال القشيري: كذلك حفظ القلوب بأنوار التوحيد، فإذا قَرُبَ منها الشيطان رَجَمَهَا بنجوم معارفهم، إلا مَن خَطِفَ الخطفة، كذلك إذا اغتنم الشيطان من الأولياء أن يُلْقِيَ شيئاً من وساوسه تَذَكَّروا، فإذا هم مُبْصِرون\n هـ\n وقال في لطائف المنن: إن الله تعالى إذا تولى وليًّا صان قلبه من الأغيار، وحرسه بدوام الأنوار، حتى لقد قال بعض العارفين: إذا كان سبحانه قد حرس السماء بالكواكب والشُّهب كي لا يسترق السمع منها، فقلبُ المؤمن أولى بذلك، لقول الله سبحانه، فيما يحكيه عنه رسول الله صلى الله عليه وسلم:\n\n \" لم تسعني أرضي ولا سمائي، ووسعني قلب عبدي المؤمن \" \n\nوالمراد: المؤمن الكامل، الذي تولّى الله حفظه، وهو الولي العارف\n ثم ردّ على من أنكر البعث بعد هذه الدلائل الباهرة، فقال: { فَٱسْتَفْتِهِمْ أَهُمْ أَشَدُّ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:52",
      "similarity": 0.7782510672592119
    },
    {
      "verse": "17:39",
      "similarity": 0.43633477009386723
    },
    {
      "verse": "17:18",
      "similarity": 0.3853189004888426
    },
    {
      "verse": "7:18",
      "similarity": 0.24200099634273387
    },
    {
      "verse": "8:33",
      "similarity": 0.009293688238673948
    }
  ]
}