{
  "chapter": "ص",
  "text": "انا سخرنا الجبال معه يسبحن بالعشى والاشراق",
  "translations": [
    {
      "translation": "We subjected the mountains to glorify with him in the evening and at sunrise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We subjugated the chiefs (of tribes) to struggle day and night with him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With him We had subjected the mountains that they join him in celebrating Allah's glory, evening and morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the mountains join him in glorifying Us in the evening and in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We subjected the hills to say the praise with him, at night and at morn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We made the mountains to glorify Our praises with him in the `Ashi and Ishraq.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We made the mountains to sing the glory (of Allah) in unison with him at the evening and the sunrise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With him We subjected the mountains to give glory at evening and sunrise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We subdued the hills to hymn the praises (of their Lord) with him at nightfall and sunrise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the mountains join him in glorifying Us at sunset and sunrise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We so subjected the mountains that they should hallow Us with him at nightfall and sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We disposed the mountains to glorify [Allah] with him at evening and dawn,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was We that made the hills declare, in unison with him, Our Praises, at eventide and at break of day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We made the mountains to glorify Our Praises with him [Dawud (David)] in the 'Ashi (i.e. after the mid-day till sunset) and Ishraq (i.e. after the sunrise till mid-day).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We subjected the mountains to exalt (Me) with him in the evening and at sunrise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We committed the mountains to glorify with him, in the evening and at daybreak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We subjected the mountains [to praise] with him, exalting [Allah] in the [late] afternoon and [after] sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:18] Truly We disposed the mountains to glorify [God] with him, with the same glorification, at evening, at the time of the night prayer, and at sunrise, at the time of the morning prayer, which is when the sun has fully risen with its light extending everywhere.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We subdued) We made subservient (the hills to hymn) with him (the praises (of their Lord) with him at nightfall and sunrise) in the morning and evening,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال رجوعه إلينا وحفظه لمرضاتنا { إِنَّا } من مقام لطفنا وجودنا { سَخَّرْنَا ٱلجِبَالَ } له، وجعلناها تحت حكمه إلى حيث سارت { مَعَهُ } حيث شاء { يُسَبِّحْنَ } بمشايعته وموافقته حين يسبح { بِٱلْعَشِيِّ وَٱلإِشْرَاقِ } [ص: 18] أي: بالليل والنهار؛ يعني: ما دام يميل ويتوجه إلى ربه، مالت الجبال معه ازدياداً لثوابه وتكثيراً لفضائله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنا سخَّرنا الجبالَ معه } أي: ذللناها له، تسير معه حيث يريد\n ولم يقل \" له \" لأن تسخير الجبال له عليه السلام لم يكن بطريق التفويض الكلي، كتسخير الرياح وغيرها لابنه، بل بطريق التبعية، والاقتداء به في عبادة الله تعالى\n وقيل: { معه } متعلق بـ { يُسَبّحْن } ، أي: سخرناها تُسبِّح معه، إما بلسان المقال، يخلق الله لها صوتاً، أو: بلسان الحال، أي: يقدس الله تعالى ويُنزهه عما لا يليق به\n والجملة: حال، أي: مسبِّحات، واختيار الفعل ليدل على حدوث التسبيح من الجبال، وتجدُّده شيئاً بعد شيء، وحالاً بعد حال، { بالعَشِيّ } في طرفي النهار، والعشيّ: وقت العصر إلى الليل { والإِشراقِ } ، وهو حين تُشرق الشمس، أي: تضيء، وهو وقت الضحى، وأما شروقها ـ الثلاثي فطلوعها، تقول: شرقت الشمس ولمّا تُشرق، أي: طلعت ولم تضىء\n وعن ابن عباس رضي الله عنه: ما عرفت صلاة الضحى إلا بهذه الآية\n وعنه ـ عليه الصلاة والسلام ـ أنه صلّى عند أم هانىء صلاة الضحى، وقال:\n\n \" هذه صلاة الإشراق \"\n \n",
      "translations": []
    }
  ]
}