{
  "chapter": "ص",
  "text": "جند ما هنالك مهزوم من الاحزاب",
  "translations": [
    {
      "translation": "Even a whole army of Confederates will be routed there!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be one more army vanquished among the many routed hordes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is only a small army out of the several armies that will suffer defeat here.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are only a small band among the defeated confederate tribes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is just one of the disgraced armies, that will be routed there and then.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be a defeated host like the Confederates of the old times.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A host of deserters of the allies shall be here put to flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A very host of parties is routed there!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A defeated host are (all) the factions that are there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "this host too, among other hosts, is bound to suffer defeat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here there is a host of the confederates only to be defeated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are but] a host routed out there of the factions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there - will be put to flight even a host of confederates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As they denied Allah's Message) they will be a defeated host like the confederates of the old times (who were defeated).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The army is defeated as (were) the confederates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An army of confederates with be defeated there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are but] soldiers [who will be] defeated there among the companies [of disbelievers].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:11]   A routed (mahzūmun is an adjectival qualification of jundun, ‘host’) host [is all that they are], in other words, they are [nothing but] a despicable host, nothing more — in their denial of you — from among the factions (mina’l-ahzābi, also an adjectival qualification of jundun) in other words, [they are] like those hosts of factions who were in confederation against prophets before you: these were defeated and destroyed, and likewise We shall destroy these [people].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A defeated) and slain (host are (all) the factions) of disbelievers: the disbelievers of Mecca (that are there) they were defeated and killed on the Day of Badr when they intended to kill the Prophet (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: من أين يتأتى لأولئك الكفرة العجزة المقهورين الصاغرين الخيرة في أمره سبحانه وحكمه بمقتضى قضائه، حتى يتفوهوا عنه عن أفعاله وأحكامه؛ إذ لا يسع لأحد من أقوياء عباده أن يسأل عن فعله مع أن أولئك الحمقى { جُندٌ مَّا } أي: شرذمة قليلة في غاية القلة { هُنَالِكَ } أي: وضعوا ونصبوا أنفسهم بمعاداتك في أبعد الأمكنة وأعلى المرتبة، مع أنهم { مَهْزُومٌ } مغلوب { مِّن } جمع { ٱلأَحَزَابِ } [ص: 11] الذين تحزبوا على رسل الله وأنبيائه، مع كمال شدتهم وقوتهم ووفور شوكتهم وصولتهم، فانهزموا واستؤصلوا إلى حيث لم يبقَ منهم أحد على وجه الأرض\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم وعد نبيه ـ عليه الصلاة والسلام ـ بالنصر عليهم بقوله: { جندٌ مَّا هنالك مهزومٌ من الأحزاب } أي: هم جند ما من الكفار المتحزبين على الرسل { مهزومٌ } مكسور عما قريب، فلا تُبالِ بما يقولون، ولا تكترث بما يَهْذُون\n و \" جُند \": خبر، أو مبتدأ، و \" مهزوم \": خبره و \" مَّا \": صلة مقوّية للنكرة\n أو: للتقليل والتحقير\n و \" من الأحزاب \": متعلق بجند، أو: بمهزوم، و \" هنالك \": إشارة إلى بدر ومصارعهم، أو: إلى حيث وضعوا في أنفسهم من الانتداب لمثل ذلك القول العظيم، من قولهم لمَن ينتدب لأمر وليس من أهله: لست هنالك\n الإشارة: يُقال في جانب أهل الغفلة: بل في شك من حلاوة ذكري ومعرفتي، حيث لم يذوقوا\n قال إبراهيم بن أدهم رضي الله عنه: خرج الناس من الدنيا ولم يذوقوا شيئاً، قيل: وما فاتهم؟ قال: حلاوة المعرفة\n بل لَمَّا يذوقوا عذابي، هو وبال القطيعة والبُعد، والانحطاط عن درجات المقرَّبين، وسيذوقونه إذا تحققت الحقائق، حيث لا ينفع مال ولا بنون، إلا مَن أتى الله بقلب سليم\n ويقال في جانب من حسد أهل الخصوصية: { أم عندهم خزائنُ رحمة ربك العزيزِ الوهاب\n\n\n } الآية\n ثم هدّد كفار قريش بقوله: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ }\n\n",
      "translations": []
    }
  ]
}