{
  "chapter": "ص",
  "text": "اصبر على ما يقولون واذكر عبدنا داود ذا الايد انه اواب",
  "translations": [
    {
      "translation": "Be steadfast in the face of what they say and remember Our slave Dawud, who possessed true strength. He truly turned to his Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with patience what they say, and remember Our votary David, man of strength. He surely turned to Us in penitence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), bear with patience what they say, and call to mind Our servant David, who was endowed with great strength and who constantly turned (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), bear patiently what they say and recall Our servant, David, who had strong hands and who was most repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have patience upon what they say, and remember Our bondman Dawud, the one blessed with favours; he is indeed most inclined (towards His Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient of what they say and remember Our slave Dawud, endued with Al-Ayd. Verily, he was ever oft-returning in all matters and in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently what they say, and remember Our servant Dawood, the possessor of power; surely he was frequent in returning (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently what they say, and remember Our servant David, the man of might; he was a penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with what they say, and remember Our bondman David, lord of might, Lo! he was ever turning in repentance (toward Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with their words patiently. Remember Our servant David, a man of strength who always turned to Us:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear thou with that which they say, and remember Our bondman, Da-ud, endured with strength; verily he was oft-returning onto Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient over what they say, and remember Our servant, David, [the man] of strength. Indeed he was a penitent [soul].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have patience at what they say, and remember our servant David, the man of strength: for he ever turned (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient (O Muhammad SAW) of what they say, and remember Our slave Dawud (David), endued with power. Verily, he was ever oft-returning in all matters and in repentance (toward Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently with what they say, and remember Our worshiper David, a man of might. He was ever turning in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient in the face of what they say, and mention Our servant David, the resourceful. He was obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:17] God, exalted be He, says: Bear patiently what they say and remember Our servant David, the one of fortitude, that is to say, [the one] of fortitude in worship: he used to fast every other day and keep vigil for half the night, sleep for a third and then keep vigil for the [last] sixth. Indeed he was a penitent [soul], always returning to what pleases God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Bear) Muhammad (with what they say) in your rejection, (and remember Our bondman David) He says: mention to them the event of Our slave David, (lord of might) who had strength for our worship. (Lo! he was ever turning in repentance (towards Allah)) he was obedient, always engaged in the worship of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱذْكُرْ عَبْدَنَا دَاوُودَ ذَا ٱلأَيْدِ إِنَّهُ أَوَّابٌ } فذو الأيدِ: ذُو القُوةِ\n والأَوابُ: التَّوابُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما قالوا كذلك، واستهزءوا مع الرسول، وضحكوا من قوله، ونسبوه إلى الخبط والجنون، أمر سبحانه حبيبه بالتصبر على مقاساة ما جاءوا به مما لا يليق بشأنه، فقال: { ٱصْبِر } يا أكمل الرسل { عَلَىٰ مَا يَقُولُونَ } لك، وفي شأنك أولئك الجاهلون عناداً أو مكابرة، ولا تلتفت إلى هذياناتهم، ولا تحزن من أباطيلهم والمستهجنة، فعليك يا أكمل الرسل أن توطن نفسك على الصبر المأمور، ولا تتجاوز عن مقتضاه، ولا تتعب نفسك بالقلق والاضطراب والمجادلة معهم والمخاصمة إياهم إلى أن نكف عنك شرورهم، ولا تفلتفت إلى هواجس نفسك، حتى لا تقع في محل الخطاب والعتاب { وَٱذْكُرْ عَبْدَنَا دَاوُودَ } وما جرى عليه من العتاب الإلهي من عدم حفظه نفسه عن مقتضيات ومشتهياتها حتى ابتلاه الله سبحانه بما ابتلي مع أنه { ذَا ٱلأَيْدِ } أي: صاحب القدرة والقوة في الحفظ وحفظ النفس عن محارم الله ومنهياته، وكيف لا يكون كذلك { إِنَّهُ أَوَّابٌ } [ص: 17] رجَّاع إلى الله وإلى مرضاته سبحانه في جميع حالاته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اصْبِرْ على ما يقولون } من أمثال هذه المقالات الباطلة\n ثم سلاّه بما يقص عليه من خبر الأنبياء ـ عليهم السلام ـ الذين كانت بدايتهم أيام المحن، ثم جاءتهم أيام المنن، وبدأ بنبيه داود عليه السلام، فقال: { واذكر عبدَنا داودَ } ، فإنه كان في أول أمره ضعيفاً، يرعى الغنم، ثم صار نبيّاً مَلِكاً، ذا الأيادي العظام\n وقوله: { ذَا الأيدِ } أي: ذا القوة في الدين، والملكَ، والنبوة\n يقال: فلان ذو يد وأيد وأياد، بمعنى القوة، وأياد كل شيء: ما يتقوّى به\n { إِنه أوَّابٌ }: رجّاع إلى الله في كل شيء، أو: إلى مرضاة الله تعالى\n وهو تعليلٌ لكونه ذا الأيد، ودليل على القوة في الدين فإنه كان عليه السلام يصوم يوماً ويُفطر يوماً، وهو أشدُّ الصوم، ويقومُ نصفَ الليل، مع مكابدة سياسة النبوة والمُلك والشهود، فقد أعطى القوة في الجهتين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:30",
      "similarity": 0.5231190130794695
    },
    {
      "verse": "51:47",
      "similarity": 0.4869415188756785
    },
    {
      "verse": "38:49",
      "similarity": 0.40032747954931025
    },
    {
      "verse": "88:25",
      "similarity": 0.3935908941775924
    },
    {
      "verse": "17:25",
      "similarity": 0.37489004472297144
    }
  ]
}