{
  "chapter": "ص",
  "text": "اصبر على ما يقولون واذكر عبدنا داود ذا الايد انه اواب",
  "translations": [
    {
      "translation": "Be steadfast in the face of what they say and remember Our slave Dawud, who possessed true strength. He truly turned to his Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with patience what they say, and remember Our votary David, man of strength. He surely turned to Us in penitence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), bear with patience what they say, and call to mind Our servant David, who was endowed with great strength and who constantly turned (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), bear patiently what they say and recall Our servant, David, who had strong hands and who was most repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have patience upon what they say, and remember Our bondman Dawud, the one blessed with favours; he is indeed most inclined (towards His Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient of what they say and remember Our slave Dawud, endued with Al-Ayd. Verily, he was ever oft-returning in all matters and in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently what they say, and remember Our servant Dawood, the possessor of power; surely he was frequent in returning (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently what they say, and remember Our servant David, the man of might; he was a penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with what they say, and remember Our bondman David, lord of might, Lo! he was ever turning in repentance (toward Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with their words patiently. Remember Our servant David, a man of strength who always turned to Us:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear thou with that which they say, and remember Our bondman, Da-ud, endured with strength; verily he was oft-returning onto Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient over what they say, and remember Our servant, David, [the man] of strength. Indeed he was a penitent [soul].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have patience at what they say, and remember our servant David, the man of strength: for he ever turned (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient (O Muhammad SAW) of what they say, and remember Our slave Dawud (David), endued with power. Verily, he was ever oft-returning in all matters and in repentance (toward Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently with what they say, and remember Our worshiper David, a man of might. He was ever turning in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient in the face of what they say, and mention Our servant David, the resourceful. He was obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:17] God, exalted be He, says: Bear patiently what they say and remember Our servant David, the one of fortitude, that is to say, [the one] of fortitude in worship: he used to fast every other day and keep vigil for half the night, sleep for a third and then keep vigil for the [last] sixth. Indeed he was a penitent [soul], always returning to what pleases God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاصْبِرْ عَلَى مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ إِنَّهُ أَوَّابٌ (17) أعقب حكاية أقوالهم من التكذيب ابتداء من قوله : { وقَالَ الكافرون هذا ساحِرٌ كذَّابٌ } \\[ ص : 4 \\] إلى هنا ، بأمرِ الله رسولَه صلى الله عليه وسلم بالصبر على أقوالهم إذ كان جميعها أذى : إما صريحاً كما قالوا : { ساحر كذَّاب } وقالوا : { إن هذا إلا اختلاقٌ } \\[ ص : 7 \\] { إن هذا لشيء يُرادُ } \\[ ص : 6 \\] ، وإمّا ضِمناً وذلك ما في سائر أقوالهم من إنكار ما جاء به الرسول صلى الله عليه وسلم والاستهزاء بقولهم : { ربَّنَا عَجِل لنا قِطَّنَا } \\[ ص : 16 \\] من إثبات أن الإله واحد ، ويشمل ما يقولونه مما لم يحك في أول هذه السورة .وقوله : { واذكر عبدنا داوودَ } إلى آخره يجوز أن يكون عطفاً على قوله : { اصبر على ما يقولون } بأن أُتبع أمره بالصبر وبالائتساء ببعض الأنبياء السابقين فيما لَقُوه من الناس ثم كانت لهم عاقبة النصر وكشف الكرب . ويجوز أن يكون عطفاً على مجموع ما تقدّم عطْفَ القصة على القصة والغرض هو هو . وابتدىء بذكر داود لأن الله أعطاه مُلْكاً وسلطاناً لم يكن لآبائه ففي ذكره إيماء إلى أن شأن محمد صلى الله عليه وسلم سيصير إلى العزة والسلطان ، ولم يكن له سلف ولا جند فقد كان حال النبي صلى الله عليه وسلم أشبه بحال داود عليه السلام .وأدمج في خلال ذلك الإِيماء إلى التحذير من الضجر في ذات الله تعالى واتقاءِ مراعاة حظوظ النفس في سياسة الأمة إبعاداً لرسوله صلى الله عليه وسلم عن مهاوي الخطأ والزلَل وتأديباً له في أول أمره وآخره مما أن يتلقى بالعَذَل . وكان داود أيضاً قد صبر على ما لقِيَه من حسد شاول ( طالوت ) ملك إسرائيل إياه على انتصاره على جالوت ملك فلسطين .فالمصدر المتصرِّف منه { واذكر عبدنا داوود } هو الذكر بضم الذال وهو التذكرُّ وليس هو ذِكر اللسان لأنه إنما أمر النبي صلى الله عليه وسلم بذلك لتسليته وحفظ كماله لا لِيُعْلمه المشركين ولا لِيُعْلِمه المسلمين على أن كِلا الأمرين حاصل تبعاً حين إبلاغ المنزَّل في شأن داود إليهم وقراءته عليهم . ومعنى الأمر بتذكر ذلك تذكر ما سبق إعلام النبي صلى الله عليه وسلم به من فضائله وتذكير ما عسى أن يكون لم يعلمه مما يعلم به في هذه الآية .ووصفُ داود ب { عَبْدَنَا } وصفُ تشريف بالإِضافة بقرينة المقام كما تقدم عند قوله : { إلا عباد اللَّه المخلصين } في سورة \\[ الصافات : 40 \\] .و { الأَيْد } : القوة والشدة ، مصدر : آدَ يئيد ، إذا اشتدّ وقَوي ، ومنه التأييد التقوية ، قال تعالى : { فآواكم وأيدكم بنصره } في سورة \\[ الأنفال : 26 \\] .( وكان داود قد أعطي قوة نادرة وشجاعة وإقداماً عجيبين وكان يرمي الحجر بالمقلاع فلا يخطىءُ الرميَّة ، وكان يلوي الحديد ليصنعه سرداً للدروع بأصابعه ، وهذه القوة محمودة لأنه استعملها في نصر دين التوحيد .وجملة { إنَّه أوَّابٌ } تعليل للأمر بذكره إيماء إلى أن الأمر لقصد الاقتداء به ، كما قال تعالى :{ فبهداهم اقتده } \\[ الأنعام : 90 \\] ، فالجملة معترضة بين جملة { واذكُرْ }\n\n",
      "translations": [
        {
          "translation": "(Bear) Muhammad (with what they say) in your rejection, (and remember Our bondman David) He says: mention to them the event of Our slave David, (lord of might) who had strength for our worship. (Lo! he was ever turning in repentance (towards Allah)) he was obedient, always engaged in the worship of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱذْكُرْ عَبْدَنَا دَاوُودَ ذَا ٱلأَيْدِ إِنَّهُ أَوَّابٌ } فذو الأيدِ: ذُو القُوةِ\n والأَوابُ: التَّوابُ\n\n",
      "translations": [
        {
          "translation": "\nAnd remember Our servant David, the possessor of power; indeed, he was one who constantly turned back [to Allah ].\n\n\nAnd the responder: the one who responds.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوقوله: { اصبر على ما يقولون } معناه: داوم استقامتك في التوحيد\n وعارض أذاهم بالصبر في التمكين\n ولا تظهر نفسك في مقابلة أذاهم بالتلوين\n فإنك قائم بالله متحقق بالحق فلا تتحرك إلا به { واذكر } حال أخيك { عبدنا } المخصوص بعنايتنا القديمة { داود ذا الأيد } أي: القوّة والتمكين والاضطلاع في الدين\n كيف زلّ عن مقام استقامته في التلوين فلا يكن حالك في ظهور النفس حاله\n ثم وصف قوّة حال داود عليه السلام وكماله بقوله: { إنه أوّاب } رجّاع إلى الحق عن صفاته وأفعاله بالفناء فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { ٱصْبِر } يا أكمل الرسل { عَلَىٰ مَا يَقُولُونَ } لك\n وفي شأنك أولئك الجاهلون عناداً أو مكابرة\n ولا تلتفت إلى هذياناتهم\n ولا تحزن من أباطيلهم والمستهجنة\n فعليك يا أكمل الرسل أن توطن نفسك على الصبر المأمور\n ولا تتجاوز عن مقتضاه\n ولا تتعب نفسك بالقلق والاضطراب والمجادلة معهم والمخاصمة إياهم إلى أن نكف عنك شرورهم\n ولا تفلتفت إلى هواجس نفسك\n حتى لا تقع في محل الخطاب والعتاب { وَٱذْكُرْ عَبْدَنَا دَاوُودَ } وما جرى عليه من العتاب الإلهي من عدم حفظه نفسه عن مقتضيات ومشتهياتها حتى ابتلاه الله سبحانه بما ابتلي مع أنه { ذَا ٱلأَيْدِ } أي: صاحب القدرة والقوة في الحفظ وحفظ النفس عن محارم الله ومنهياته\n وكيف لا يكون كذلك { إِنَّهُ أَوَّابٌ } [ص: 17] رجَّاع إلى الله وإلى مرضاته سبحانه في جميع حالاته\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اصْبِرْ على ما يقولون } من أمثال هذه المقالات الباطلة\n ثم سلاّه بما يقص عليه من خبر الأنبياء ـ عليهم السلام ـ الذين كانت بدايتهم أيام المحن\n ثم جاءتهم أيام المنن\n وبدأ بنبيه داود عليه السلام\n فقال: { واذكر عبدَنا داودَ } \n فإنه كان في أول أمره ضعيفاً\n يرعى الغنم\n ثم صار نبيّاً مَلِكاً\n ذا الأيادي العظام\n وقوله: { ذَا الأيدِ } أي: ذا القوة في الدين\n والملكَ\n والنبوة\n يقال: فلان ذو يد وأيد وأياد\n بمعنى القوة\n وأياد كل شيء: ما يتقوّى به\n { إِنه أوَّابٌ }: رجّاع إلى الله في كل شيء\n أو: إلى مرضاة الله تعالى\n وهو تعليلٌ لكونه ذا الأيد\n ودليل على القوة في الدين فإنه كان عليه السلام يصوم يوماً ويُفطر يوماً\n وهو أشدُّ الصوم\n ويقومُ نصفَ الليل\n مع مكابدة سياسة النبوة والمُلك والشهود\n فقد أعطى القوة في الجهتين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:30",
      "similarity": 0.5231190130794695
    },
    {
      "verse": "51:47",
      "similarity": 0.4869415188756785
    },
    {
      "verse": "38:49",
      "similarity": 0.40032747954931025
    },
    {
      "verse": "88:25",
      "similarity": 0.3935908941775924
    },
    {
      "verse": "17:25",
      "similarity": 0.37489004472297144
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}