{
  "chapter": "ص",
  "text": "وقالوا۟ ربنا عجل لنا قطنا قبل يوم الحساب",
  "translations": [
    {
      "translation": "They say, 'Our Lord, advance our share to us before the Day of Reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Still they say: \"O Lord, give us our share before the Day of Reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “Our Lord, hasten to us our share (of chastisement) before the Day of Reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They scornfully said, \"Lord, show us the record of our deeds before the day when everyone must present the account of their deeds.\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Our Lord! Give us our share quickly, before the Day of Reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Our Lord! Hasten to us Qittana before the Day of Reckoning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: O our Lord! hasten on to us our portion before the day of reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Our Lord, hasten to us our share before the Day of Reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Our Lord! Hasten on for us our fate before the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Our Lord! Hasten on for us our fate before the Day of Reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: our Lord! hasten our portion unto us before the Day of Reckoning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Our Lord! Hasten on for us our share before the Day of Reckoning.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Our Lord! hasten to us our sentence (even) before the Day of Account!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Our Lord! Hasten to us Qittana (i.e. our Record of good and bad deeds so that we see it) before the Day of Reckoning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Our Lord, hasten to us our share before the Day of Recompense'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Our Lord, hasten Your writ upon us, before the Day of Account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Our Lord, hasten for us our share [of the punishment] before the Day of Account\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:16] And they said — after the following [verse] was revealed, As for him who is given his book in his right hand … to the end [of the verse, Q. 69:19] — ‘Our Lord, hasten on for us the record of our deeds before the Day of Reckoning’ — they said this mockingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say) i.e. the disbelievers of Mecca said upon hearing Allah's saying (Then, as for him who is given his record in his right hand, he will say: Take, read my book! ... But as for him who is given his record in his left hand) [al-Haqqah: 69:19-25], they said: (Our Lord!) our Lord! (Hasten on for us our fate) our records, they mean the registers of their deeds (before the Day of Reckoning) so that we know what is in them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ ٱلْحِسَابِ } معناه نَصيبُنا من الآخرةِ قبلَ يومِ الحِسابِ\n والقِطُّ: الكِتابُ\n والجمعُ القُطوطُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمع كفار مكة أوصاف أهوال يوم الجزاء، وافتراق الناس فيها فرقاً وأحزاباً، بعضهم أصحاب يمين، وبعضهم أصحاب شمال، فيُعطى لكل فرد كتاباً كُتب فيه أعمالهم الصالحة والفاسدة، فيُحاسب كل على أعماله، فيُجازى على وفقها { قَالُواْ } مستهزئين متهكمين؛ يعني: أهل مكة بعدما سمعوا أهوال يوم الجزاء وأفزاعها: { رَبَّنَا عَجِّل لَّنَا قِطَّنَا } أي: صحيفة أعمالنا، وقسطنا من العذاب المترتب عليها { قَبْلَ يَوْمِ ٱلْحِسَابِ } [ص: 16] ونحن نرضى بها وبالعذاب المترتب عليها بلا حساب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقالوا } أي: كفار مكة لَمَّا سمعوا بتأخير عقابهم إلى الآخرة: { ربنا عَجِّل لنا قِطَّنَا } أي: حظّنا من العذاب الذي وعدتنا به، { قبل يوم الحساب } ولا تؤخره إلى الصيحة المذكورة\n وفي القاموس: القِط ـ بالكسر ـ النصيب، والصَّك، وكتاب المحاسبة\n هـ\n أو: عَجِّل لنا صحيفة أعمالنا لننظر فيها، أو: حظنا من الجنة لأنه صلى الله عليه وسلم ذكر وعد الله المؤمنين بالجنة، فقالوا على سبيل الهزء: عَجِّل لنا نصيبنا منها\n وتصدير دعائهم بالنداء للإمعان في الاستهزاء، كأنهم يدعون ذلك بكمال الرغبة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:46",
      "similarity": 0.04943033400617056
    },
    {
      "verse": "20:114",
      "similarity": 0.04928330243566098
    },
    {
      "verse": "13:6",
      "similarity": 0.04824320422282564
    },
    {
      "verse": "20:84",
      "similarity": 0.044444904493779046
    },
    {
      "verse": "2:203",
      "similarity": 0.04436556610354136
    }
  ]
}