{
  "chapter": "ص",
  "text": "يداود انا جعلنك خليفة فى الارض فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله ان الذين يضلون عن سبيل الله لهم عذاب شديدۢ بما نسوا۟ يوم الحساب",
  "translations": [
    {
      "translation": "'Dawud! We have made you a khalif on the earth, so judge between people with truth and do not follow your own desires, letting them misguide you from the Way of Allah. Those who are misguided from the Way of Allah will receive a harsh punishment because they forgot the Day of Reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O David, We have made you trustee on the earth. So judge between men equitably, and do not follow your lust lest it should lead you astray from the way of God. Surely for those who go astray from the way of God, is severe punishment, for having forgotten the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We said to him): “O David, We have appointed you vicegerent on earth. Therefore, rule among people with justice and do not follow (your) desire lest it should lead you astray from Allah's Path. Allah's severe chastisement awaits those who stray away from Allah's Path, for they had forgotten the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told him. \"David, We have appointed you as Our deputy on earth so judge among the people with truth. Do not follow (worldly) desires lest you go astray from the way of God. Those who go astray from the way of God will suffer severe torment for forgetting the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Dawud! We have indeed appointed you as a Viceroy in the earth, therefore judge between mankind with the truth, and do not follow desire for it will lead you astray from Allah’s path; indeed for those who stray away from Allah’s path is a severe punishment, because they forgot the Day of Reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Dawud! Verily, We have placed you as a successor on the earth; so judge you between men in truth (and justice) and follow not your desire -- for it will mislead you from the path of Allah. Verily, those who wander astray from the path of Allah (shall) have a severe torment, because they forgot the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "o Dawood! surely We have made you a ruler in the land; so judge between men with justice and do not follow desire, lest it should lead you astray from the path of Allah; (as for) those who go astray from the path of Allah, they shall surely have a severe punishment because they forgot the day of reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "David, behold, We have appointed thee a viceroy in the earth; therefore judge between men justly, and follow not caprice, lest it lead thee astray from the way of God. Surely those who go astray from the way of God -- there awaits them a terrible chastisement, for that they have forgotten the Day of Reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And it was said unto him): O David! Lo! We have set thee as a viceroy in the earth; therefor judge aright between mankind, and follow not desire that it beguile thee from the way of Allah. Lo! those who wander from the way of Allah have an awful doom, forasmuch as they forgot the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"David, We have given you mastery over the land. Judge fairly between people. Do not follow your desires, lest they divert you from God's path: those who wander from His path will have a severe punishment, because they ignore the Day of Reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Da-ud! verily We have appointed thee a vicegerent in the earth, so judge between mankind with truth, and follow not desire, lest it cause thee to err from the path of Allah. Verily those who err from the path of Allah - Unto them shall be a severe torment, for they forgat the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O David! Indeed, We have made you a vicegerent on the earth. So judge between people with justice, and do not follow your desires, or they will lead you astray from the way of Allah. Indeed there is a severe punishment for those who stray from the way of Allah, because of their forgetting the Day of Reckoning.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O David! We did indeed make thee a vicegerent on earth: so judge thou between men in truth (and justice): Nor follow thou the lusts (of thy heart), for they will mislead thee from the Path of Allah: for those who wander astray from the Path of Allah, is a Penalty Grievous, for that they forget the Day of Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Dawud (David)! Verily! We have placed you as a successor on earth, so judge you between men in truth (and justice) and follow not your desire for it will mislead you from the Path of Allah. Verily! Those who wander astray from the Path of Allah (shall) have a severe torment, because they forgot the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We said): 'David, We have made you a caliph in the earth. Judge with justice among people and do not yield to your own preference in case it should lead you from the Path of Allah. Surely, a terrible punishment awaits those who stray from the Path of Allah, because they forget the Day of Reckoning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O David, We made you a ruler in the land, so judge between the people with justice, and do not follow desire, lest it diverts you from God’s path. Those who stray from God’s path will have a painful punishment, for having ignored the Day of Account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We said], \"O David, indeed We have made you a successor upon the earth, so judge between the people in truth and do not follow [your own] desire, as it will lead you astray from the way of Allah.\" Indeed, those who go astray from the way of Allah will have a severe punishment for having forgotten the Day of Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:26] ‘O David! We have indeed made you a vicegerent on the earth, managing the affairs of people; so judge justly between people and do not follow desire, that is, the desires of the soul, that it then lead you astray from the way of God, that is to say, from the proofs that indicate [the truth of] His Oneness. Truly those who go astray from the way of God, in other words, from belief in God — for them there will be a severe chastisement because of their forgetting the Day of Reckoning’, as a result of their having neglected faith. For had they been certain of [the truth of] the Day of Reckoning, they would have [first] been believers in   this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((And it was said unto him): David! Lo! We have set thee as a vicegerent in the earth) We appointed you a prophet king for the Children of Israel; (therefore judge aright between mankind) judge justly between people, (and follow not desire) that as you did regarding Bathseba, the wife of Uriah, who was also David's cousin (that it beguile thee from the way of Allah) from the obedience of Allah. (Lo! those who wander from the way of Allah) from the obedience of Allah (have an awful doom, forasmuch as they forgot the Day of Reckoning) because they forsake working for the Day of Reckoning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إظهاراً لكمال اللطف والكرم معه: { يٰدَاوُودُ } المتأثر عن عتبنا\n التائب إلينا\n المنيب نحونا عن محض الندم والإخلاص { إِنَّا } بعدما طهرناك عن لوث بشريتك\n وغفرنا لك ما طرأ عليه من لوازم هويتك ولواحق ناسوتك { جَعَلْنَاكَ خَلِيفَةً فِي ٱلأَرْضِ } التي هي محل الكون والفساد\n وأنواع الفتن والعناد\n فلك أن تستخلف عليها نيابة عنَّا\n\n{ فَٱحْكُمْ بَيْنَ ٱلنَّاسِ } المستحكمين لك\n المتمردين إليك في الوقائع والخطوب ملتبساً { بِٱلْحَقِّ } السوي بلا ميل إلى كلا طرفي الإفراط والتفريط على الوجه الذي وصل إليك في كتابنا صريحاً أو استنبط منه ضمناً { وَ } عليك أن { لاَ تَتَّبِعِ ٱلْهَوَىٰ } في حكوماتك وقطعك للخصومات بين الأنام\n يعني: عليك أن ترجع في جميع الأحكام إلى كتابنا\n ولا تميل في حال من الأحوال إلى ما تهواه نفسك ويقتضيه رأيك ويشتهيه قلبك\n إن كان مخالفاً لما في الكتاب\n وإن اتبعت إليه بعدما نهيناك { فَيُضِلَّكَ } اتباعك أياه { عَن سَبِيلِ ٱللَّهِ } الموصل إلى توحيده\n المبني على القسط والاعتدال { إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ } الواحد الأحد الصمد الذي استوى على عروش عموم ما لمع عليه بروق تجلياته بالقسط والاستقامة { لَهُمْ عَذَابٌ شَدِيدُ } يوم يرجعون إلى الله\n ويحشرون إلى عرصات العرض { بِمَا نَسُواْ يَوْمَ ٱلْحِسَابِ } [ص: 26] أي: بسبب فطرتهم الأصلية\n وعهدهم الذي عهدوا مع الله فيها\n وإنكارهم على تنقية الحق أعمالهم في يوم البعث والجزاء\n وضلالهم عن الإيمان به وبجميع ما فيه من الأمور الأخروية\n\n\n{ وَ } كيف لا نبعث الأموات\n ولا نحاسب أعمالهم التي أتوا بها في دار الاختبار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا داودُ إِنا جعلناك خليفةً في الأرض } أي: استخلفناك على المُلك فيها\n والحُكم فيما بين أهلها\n أو: جعلناك عمَّن كان قبلك من الأنبياء القائمين بالحق\n وفيه دليل على أن حاله عليه السلام بعد التوبة\n كما كان قبلها\n لم يتغير قط\n خلاف ما نقله الثعلبي من تغيُّر حاله وصوته\n ومنع الطيور من إجابته\n فانظره\n { فاحكمْ بين الناس بالحق } بحكم الله تعالى\n إذ كنت خليفته\n أو: بالعدل\n { ولا تتبع الهوى } أي: هوى النفس في الحكومات\n وغيرها من أمور الدين والدنيا\n بل قِفْ عند ما حدّ لك\n وفيه تنبيه على أن أقبح جنايات العبد متابعةُ هواه\n { فيُضلك عن سبيل الله } أي: فيكون الهوى\n أو اتباعه\n سبباً لضلالك عن دلائله اللاتي نصبها على الحق\n تكويناً وتشريعاً\n و \" يُضلك \": منصوب في جواب النهي\n أو: مجزوم\n فُتح لالتقاء الساكنين\n { إِن الذين يَضِلُّون عن سبيل الله } عن طريقه الموصلة إليه\n وأظهر \" سبيلَ الله \" في موضع الإضمار للإيذان بكمال شناعة الضلال عنه\n { لهم عذاب شديد بما نَسُوا } بسبب نسيانهم { يوم الحساب } فإنَّ تذكره وترداده على القلب يقتضي ملازمة الحق ومباعدة الهوى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:15",
      "similarity": 0.3474679155074768
    },
    {
      "verse": "17:55",
      "similarity": 0.3364090805700855
    },
    {
      "verse": "30:29",
      "similarity": 0.31212026824376987
    },
    {
      "verse": "19:64",
      "similarity": 0.3025746796620121
    },
    {
      "verse": "28:50",
      "similarity": 0.3004607875510736
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/38:26.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/38:26.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}