{
  "chapter": "ص",
  "text": "وما خلقنا السماء والارض وما بينهما بطلا ذلك ظن الذين كفروا۟ فويل للذين كفروا۟ من النار",
  "translations": [
    {
      "translation": "We did not create heaven and earth and everything between them to no purpose. That is the opinion of those who are kafir. Woe to those who are kafir, because of the Fire!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and the earth and all that lies between them, all for nothing. Only those who deny imagine so. So for the unbelievers there is woe from the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create this heaven and earth and all that lies between them in vain. That is the fancy of those who denied the Truth. So woe from the Fire to all who deny the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and the earth and all that is between them without purpose, even though this is the belief of the disbelievers. Woe to the disbelievers; they will suffer the torment of fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not created the heaven and the earth and all that is between them without purpose; this is what the disbelievers assume; therefore ruin is for the disbelievers, by the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created not the heaven and the earth and all that is between them without purpose! That is the consideration of those who disbelieve! Then woe to those who disbelieve from the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not create the heaven and the earth and what is between them in vain; that is the opinion of those who disbelieve then woe to those who disbelieve on account of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and earth, and what between them is, for vanity; such is the thought of the unbelievers, wherefore woe unto the unbelievers because of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created not the heaven and the earth and all that is between them in vain. That is the opinion of those who disbelieve. And woe unto those who disbelieve, from the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create heaven and earth and all that is between them in vain. That is the opinion of those who deny the truth. Woe betide those who deny the truth, when they are cast into the Fire --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not created the heaven and the earth and whatsoever is in-between the twain in vain.\" That is the opinion of those who disbelieve. And woe Unto those who disbelieve the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the sky and the earth and whatever is between them in vain. That is a conjecture of the faithless. So woe to the faithless for the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not without purpose did We create heaven and earth and all between! that were the thought of Unbelievers! but woe to the Unbelievers because of the Fire (of Hell)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created not the heaven and the earth and all that is between them without purpose! That is the consideration of those who disbelieve! Then woe to those who disbelieve (in Islamic Monotheism) from the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not in falsehood that We created the heavens and the earth and all that is between them. That is the thought of the unbelievers. But woe to the unbelievers because of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heaven and the earth and everything between them in vain. That is the assumption of those who disbelieve—so woe to those who disbelieve because of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:27] And We did not create the heavens and the earth and all that is between them in vain, frivolously. That, namely, the creation of what has been mentioned as being for no [particular] purpose, is the supposition of those who disbelieve, from among the people of Mecca. So woe — a valley [in hell-fire] — to the disbelievers from the Fire!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We created not the heaven and the earth and all that is between them) of created beings and marvels (in vain) for nothing, without ordaining commands and prohibitions. (That is the opinion of those who disbelieve) that is the denial of those who disbelieve in resurrection after death. (And woe) severe chastisement is (unto those who disbelieve) in resurrection after death, (from the Fire) in the Fire!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما خلقنا السماء والأرض وما بينهما } خلقاً { باطلاً } لا حق فيها\n بل حقاً محتجباً بصورها لا وجود لها بنفسها فتكون باطلاً محضاً\n { ذلك ظنّ } المحجوبين عن الحق بمظاهر الكون { فويل } لهم من نار الحرمان والاحتجاب والتقلّب في نيران الطبيعة والأنائية بأشدّ العذاب\n بل لم نجعل { الذين آمنوا } بشهود جماله في مظاهر الأكوان { وعملوا الصالحات } من الأعمال المقصودة بذاتها\n المتعلقة بصلاح العالم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { مَا خَلَقْنَا ٱلسَّمَآءَ } وجميع ما فيها ومن فيها { وَٱلأَرْضَ } وجميع من عليها وما عليها { وَ } كذا { مَا بَيْنَهُمَا } من الممتزجات الكائنة فوق الأرض وتحت السماء { بَاطِلاً } عبثاً بلا طائل ومصلحة تقتضيها الحكمة الباعثة على إظهارها\n مع أنَّا ما كنَّا من العابثين اللاعبين\n\n\nوما يليق بشأننا أن ينسب أفعالنا إلى البطلان\n والخلو عن الحكمة { ذَلِكَ } أي: القول ببطلان أفعالنا\n وخلائها عن الفائدة\n وعرائها عن الحكمة والمصلحة { ظَنُّ ٱلَّذِينَ كَفَرُواْ } بالحق العليم الحكيم\n وأعرضوا عن الإيمان وأنكروا توحيده\n فاستحقوا بذلك الظن أسوأ العذاب وأشد النكال { فَوَيْلٌ } عظيم وعذاب أليم { لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ } [ص: 27] إذ هم في أوحش أمكنة جهنم وأهولها وأعمقها\n\n\n{ أَمْ نَجْعَلُ ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ كَٱلْمُفْسِدِينَ فِي ٱلأَرْضِ } أي: بل ظنوا وزعموا من شدة جهلهم وسخافة فطنتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما خلقنا السماء والأرضَ وما بينهما } من المخلوقات على هذا النظام البديع { باطلاً } أي: خلقاً باطلاً\n عارياً عن الحكمة\n أو: مبطلين عابثين\n بل لحِكَم بالغة\n وأسرارٍ باهرة\n حيث خلقنا من بيْنها نفوساً\n أودعناها العقل لتميز بين الحق والباطل\n والنافع والضار\n ومكنَّاها من التصرفات العلمية والعملية\n في استجلاب منافعها\n واستدفاع مضارها\n ونصبنا لها للحق دلائل آفاقية\n ونفسية\n ومنحناها القدرة على الاستشهاد بها\n ثم لم نقتصر على ذلك المقدار من الألطاف\n بل أرسلنا إليها رسلاً\n وأنزلنا عليها كتباً\n بيَّنَّا فيها كيفية الأدب معنا\n وهيئة السير إلى حضرة قدسنا\n وقيَّضنا لها جهابذة\n غاصوا على جواهر معانيها\n فاستخرجوا منها كيفية المعاملة معنا\n ظاهراً وباطناً\n وأوعدنا فيها بالعِقَاب لمَن أعرض عنها\n ووعدنا بالثواب الجزيل لمَن تمسّك بها\n ولم نخلق شيئاً باطلاً\n { ذلك ظنُّ الذين كفروا } \n الإشارة إلى خلق العبث\n والظن بمعنى المظنون\n أي: خَلْقُها عبثاً هو مظنون الذين كفروا\n وإنما جُعلوا ظانين أنه خلقها للعبث\n وإن لم يصرحوا بذلك لأنه لمّا كان إنكارهم للبعث\n والثواب\n والحساب\n والعقاب\n التي عليها يدور فلك تكوين العالم\n مؤدياً إلى خلقها عبثاً\n جُعِلوا كأنهم يظنون ذلك ويقولونه لأن الجزاء هو الذي سيقت إليه الحكمة في خلق العالم\n فمَن جحده فقد جحد الحكمة في خَلْق العالم\n { فويل للذين كفروا من النار }\n الفاء سببية لإفادة ثبوت الويل لهم على ظنهم الباطل\n وأظهر في موضع الإضمار للإشعار بأن الكفر علة ثبوت الويل لهم\n و \" من النار \": تعليلية\n كما في قوله:\n\n[البقرة: 79] أي: فويل لهم بسبب النار المترتبة على ظنهم وكفرهم\n { أم نجعلُ الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض } \n \" أم \": منقطعة\n والاستفهام فيها للإنكار\n والمراد أنه لو بطل الجزاء ـ كما تقول الكفَرة ـ لاستوت أحوال أتقياء المؤمنين وأشقياء الكفرة\n ومَن سوّى بينهما كان سفيهاً\n ولم يكن حكيماً\n أي: بل أنجعل المؤمنين المصلحين كالكفرة المفسدين في أقطار الأرض\n كما يقتضيه عدم البعث وما يترتب عليه من الجزاء لاستواء الفريقين في التمتُّع في الحياة الدينا\n بل الكفرة أوفر حظًّا فيها من المؤمنين\n مع صبر المؤمنين\n وتعبهم في مشاق الطاعات\n لكن ذلك الجعل محال\n فتعيّن البعث والجزاء لرفع الأولين إلى أعلى عليين\n وخفض الآخرين إلى أسفل سافلين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:2",
      "similarity": 0.4896405476541261
    },
    {
      "verse": "51:60",
      "similarity": 0.4430373743214651
    },
    {
      "verse": "29:52",
      "similarity": 0.4169166645837478
    },
    {
      "verse": "52:11",
      "similarity": 0.4081846828143253
    },
    {
      "verse": "47:33",
      "similarity": 0.4056376698245345
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/38:27.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/38:27.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/38:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}