{
  "chapter": "ص",
  "text": "قال لقد ظلمك بسؤال نعجتك الى نعاجه وان كثيرا من الخلطاء ليبغى بعضهم على بعض الا الذين ءامنوا۟ وعملوا۟ الصلحت وقليل ما هم وظن داود انما فتنه فاستغفر ربه وخر راكعا واناب",
  "translations": [
    {
      "translation": "He said, 'He has wronged you by asking for your ewe to add to his ewes. Truly many partners are unjust to one another - except those who have iman and do right actions, and how few they are!' Dawud realised that We had put him to the test. He begged forgiveness from his Lord and fell down prone, prostrating, and repented.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(David) said: \"He is unjust in demanding your ewe to add to his (many) ewes. Many partners are surely -- unjust to one another, except those who believe and do the right; but there are only a few of them.\" It occurred to David that he was being tried by Us, and he begged his Lord to forgive him, and fell down in homage and repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "David said: “He has certainly wronged you in seeking to add your ewe to his ewes; and indeed many who live together commit excesses, one to the other, except those that believe and act righteously; and they are but few.” (While so saying) David realized that it is We Who have put him to test; therefore, he sought the forgiveness of his Lord, and fell down, bowing and penitently turning (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "David said, \"He has certainly been unjust in demanding your ewe from you. Most partners transgress against each other except for the righteously striving believers who are very few.\" David realized that it was a test from Us so he asked forgiveness from his Lord and knelt down before him in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Dawud, “He is indeed being unjust to you in that he demands to add your ewe to his ewes; and indeed most partners wrong one another, except those who believe and do good deeds – and they are very few!” Thereupon Dawud realised that We had tested him, so he sought forgiveness from his Lord, and fell prostrate and inclined (towards his Lord). (Command of Prostration # 10)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Dawud] said: \"He has wronged you in demanding your ewe in addition to his ewes. And, verily, many partners oppress one another, except those who believe and do righteous good deeds, and they are few.\" And Dawud guessed that We have tried him and he sought forgiveness of his Lord, and he fell down prostrate and turned (to Allah) in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Surely he has been unjust to you in demanding your ewe (to add) to his own ewes; and most surely most of the partners act wrongfully towards one another, save those who believe and do good, and very few are they; and Dawood was sure that We had tried him, so he sought the protection of his Lord and he fell down bowing and turned time after time (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'Assuredly he has wronged thee in asking for thy ewe in addition to his sheep; and indeed many intermixers do injury one against the other, save those who believe, and do deeds of righteousness -- and how few they are!' And David thought that We had only tried him; therefore he sought forgiveness of his Lord, and he fell down, bowing, and he repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(David) said: He hath wronged thee in demanding thine ewe in addition to his ewes, and lo! many partners oppress one another, save such as believe and do good works, and they are few. And David guessed that We had tried him, and he sought forgiveness of his Lord, and he bowed himself and fell down prostrate and repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "David said, \"He has certainly wronged you by demanding that your ewe be added to his ewes! Thus many partners wrong one another -- [all] save those who believe [in God] and do righteous deeds: but how few are they!\" And [suddenly] David understood that We were only putting him to the test, and so he asked his Lord to forgive him his sins; he fell to his knees, and turned to Him in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Da-ud said: assuredly he hath wronged thee in demanding thine ewe in addition to his ewes, and verily many of the partners oppress each other save such as believe and work righteous works, and few are they. And Da-ud imagined that We had tried him; so he asked forgiveness of his Lord, and he fell down bowing and turned in penitence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘He has certainly wronged you by asking your ewe in addition to his own ewes, and indeed many partners bully one another, except such as have faith and do righteous deeds, and few are they.’ Then David knew that We had tested him, whereat he pleaded with his Lord for forgiveness, and fell down in prostration and repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(David) said: \"He has undoubtedly wronged thee in demanding thy (single) ewe to be added to his (flock of) ewes: truly many are the partners (in business) who wrong each other: Not so do those who believe and work deeds of righteousness, and how few are they?\"... and David gathered that We had tried him: he asked forgiveness of his Lord, fell down, bowing (in prostration), and turned (to Allah in repentance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Dawud (David)] said (immediately without listening to the opponent): \"He has wronged you in demanding your ewe in addition to his ewes. And, verily, many partners oppress one another, except those who believe and do righteous good deeds, and they are few.\" And Dawud (David) guessed that We have tried him and he sought Forgiveness of his Lord, and he fell down prostrate and turned (to Allah) in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (David) replied: 'He has without doubt wronged you in seeking to add your ewe to his sheep. Many intermixers wrong one another; except those who believe, and do good works, and they are few indeed' David realized that We had tried him and sought the forgiveness of his Lord and fell down, prostrate and repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “He has done you wrong by asking your ewe in addition to his ewes. Many partners take advantage of one another, except those who believe and do good deeds, but these are so few.” David realized that We were testing him, so he sought forgiveness from his Lord, and fell down to his knees, and repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[David] said, \"He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds - and few are they.\" And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:24] He said, ‘He has certainly wronged you by asking for your ewe that he may add it to his sheep. And indeed many associates infringe upon [the rights of] one another, except such as believe and perform righteous deeds, but few are they!’ (mā emphasises the ‘fewness’). As the two angels were ascending to the heaven one said to the other, ‘He has certainly passed judgement on himself!’ David was thus alerted [to his deed]. God, exalted be He, says: And David thought, in other words, he became certain, that We had indeed tried him, that We had caused him to fall into a trial, that is, a test, through his love for that woman. So he sought forgiveness of his Lord and fell down bowing, in other words, prostrate, and repented.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَى نِعَاجِهِ وَإِنَّ كَثِيرًا مِنَ الْخُلَطَاءِ لَيَبْغِي بَعْضُهُمْ عَلَى بَعْضٍ إِلَّا الَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَا هُمْ وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ (24) أي علم داود بعد انتهاء الخصومة أن الله جعلها له فتنة ليشعره بحال فعلته مع ( أُوريا ) وقد أشعره بذلك ما دلّه عليه انصراف الخصمين بصورة غير معتادة ، فعلم أنهما ملَكان وأن الخصومة صورية فعلم أن الله بعثهما إليه عَتْباً له على متابعة نفسه زوجةَ ( أوريا ) وطلبه التنازل عنها . وعبر عن علمه ذلك بالظن لأنه علم نظري اكتسبه بالتوسم في حال الحادثة وكثيراً ما يعبر عن العلم النظري بالظن لمشابهته الظن من حيث إنه لا يخلو من تردد في أول النظر .و { أنما مَّا هُمْ وَظَنَّ دَاوُودُ أَنَّمَا فتناه فاستغفر رَبَّهُ وَخَرَّ رَاكِعاً وَأَنَابَ \\* فَغَفَرْنَا لَهُ ذلك وَإِنَّ لَهُ عِندَنَا لزلفى وَحُسْنَ مَھَابٍ } مفتوحة الهمزة أخت ( إنما ) تفيد الحصر ، أي ظنّ أن الخصومة ليست إلاّ فتنة له ، أو ظن أن ما صدر منه في تزوج امرأة أوريا ليس إلا فتنة . ومعنى { فتنَّاهُ } قدّرنا له فتنة ، فيجوز أن تكون الفتنة بالمعنى المشهور في تدبير الحيلة لقتل ( أوريا ) فعبر عنها بالفتنة لأنها أورثت داود مخالفةً للأليق به من صرف نفسه عن شيء غيره ، وعدم متابعته ميله النفساني وإن كان في دائرة المباح في دينهم ، فيكون المعنى : وعلم أن ما صدر منه فتنة من النفس . وإنما علم ذلك بعد أن أحسّ من نفسه كراهية مثلها مما صوره له الخصمان .ويجوز أن يكون الفتن بمعنى الابتلاء والاختبار ، كقوله تعالى لموسى : { وفتناك فتوناً } \\[ طه : 40 \\] ، أي ظن أنا اختبرنا زكانته بإرسال الملكين ، يصور أن له صورةً شبيهةً بفعله ففطن أن ما فعله أمر غير لائق به . وتفريع { فاستغفر ربَّهُ } على ذلك الظنّ ظاهر على كلا الاحتمالين ، أي لما علم ذلك طلب الغفران من ربه لِما صنع .وخرّ خروراً : سقط ، وقد تقدم في قوله تعالى : { فخر عليهم السقف من فوقهم في سورة } \\[ النحل : 26 \\] .والركوع : الانحناء بقصد التعظيم دون وصول إلى الأرض قال تعالى : { تراهم ركعاً سجداً } \\[ الفتح : 29 \\] ، فذكر شيئين . قالوا : لم يكن لبني إسرائيل سجود على الأرض وكان لهم الركوع ، وعليه فتقييد فعل { خرّ } بحال { رَاكِعاً } تمَجَّز في فعل { خرّ } بعلاقة المشابهة تنبيهاً على شدة الانحناء حتى قارب الخرور . ومن قال : كان لهم السجود جعل إطلاق الرجوع عليه مجازاً بعلاقة الإِطلاق . وقال ابن العربي : لا خلاف في أن الركوع هاهنا السجود ، قلت : الخلافُ موجود .والمعروف أنه ليس لبني إسرائيل سجود بالجبهة على الأرض ، ويحتمل أن يكون السجود عبادة الأنبياء كشأن كثير من شرائع الإِسلام كانت خاصة بالأنبياء من قبل كما تقدم في قوله تعالى : { فلا تموتن إلا وأنتم مسلمون } \\[ البقرة : 132 \\] ، وتقدم قوله تعالى : { وخروا له سجداً } في سورة \\[ يوسف : 100 \\] . وكان ركوع داود عليه السلام تضرعاً لله تعالى ليقبل استغفاره .والإِنابة : التوبة : يقال : أناب ، ويقال : نَاب . وتقدم عند قوله تعالى : { إن إبراهيم لحليم أوّاه منيب } في سورة \\[ هود : 75 \\] . وعند قوله : { منيبين إليه } في سورة \\[ الروم : 31 \\] .وهنا موضع سجدة من سجود القرآن من العزائم عند مالك لثبوت سجود النبي صلى الله عليه وسلم عندها . ففي «صحيح البخاري» عن مجاهد «سألتُ ابن عباس عن السجدة في ص فقال : أوَ ما تقرأ { ومن ذريته داود وسليمان } \\[ الأنعام : 84 \\] إلى قوله : { أولئك الذين هدى الله فبهداهم اقتده } \\[ الأنعام : 90 \\] فكان داود ممن أُمر نبيئكم أن يقتدِيَ به فسجدها داود فسجدها رسول الله» . وفي «سنن أبي داود» عن ابن عباس «ليس ص من عزائم السجود ، وقد رأيت رسول الله صلى الله عليه وسلم سجد فيها» . وفيه عن أبي سعيد الخُدْري قال : «قرأ رسول الله وهو على المنبر ص فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تَشَزَّنَ الناس للسجود ( أي تهيّأَوا وتحركوا لأجله ) فقال رسول الله : إنما هي توبة نبيء ولكني رأيتكم تشزَّنْتم للسجود فنزل فسجد وسجدوا» ، وقول أبي حنيفة فيها مثل قول مالك ولم يرَ الشافعي سجوداً في هذه الآية إمَّا لأجل قول النبي صلى الله عليه وسلم \" إنما هي توبة نبيء \" فرجع أمرُها إلى أنها شرْعُ من قبلنا ، والشافعي لا يرى شرع من قبلنا دليلاً .ووجه السجود فيها عند من رآه أن ركوع داود هو سجود شريعتهم فلما اقتدى به النبي صلى الله عليه وسلم أتى في اقتدائه بما يساوي الركوع في شريعة الإِسلام وهو السجود . وقال أبو حنيفة : الركوع يقوم مقام سجود التلاوة أخذاً من هذه الآية .\n\n",
      "translations": [
        {
          "translation": "((David) said: He hath wronged thee in demanding thine ewe) in taking your ewe (in addition to his ewes) even though he has many ewes, (and lo! many partners) and brothers (oppress one another) transgress against one another, (save such as believe) in Allah (and do good works) between them and their Lord, (and they are few) those who do not transgress. And the two went out from whence they came. (And David guessed) he knew and was certain (that We had tried him) because of the sin he committed, (and he sought forgiveness of his Lord) from his sin, (and he bowed himself and fell down prostrate and repented) feeling remorse for what he did.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّ كَثِيراً مِّنَ ٱلْخُلَطَآءِ } معناه من الشُّركاءِ\n\n\n\n\nوقوله تعالى: { وَظَنَّ دَاوُودُ } معناه أَيقنَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And indeed, many of the allies} [means] from the partners.\n\n\nAnd the saying of Allah, \"And Dawood believed,\" means that he was certain.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n متعجباً مستبعداً عما جرى عليه من الظلم والعدوان حيث { قَالَ }: تالله { لَقَدْ ظَلَمَكَ } هذا الظالم ظلماً صريحاً { بِسُؤَالِ نَعْجَتِكَ } ليأخذها منك ويضيفها { إِلَىٰ نِعَاجِهِ } ليكثرها بها ويخلطها عليه حرصاً منه إلى تكميل مشتهاة نفسه الأمارة { وَ } لا تستبدع هذا الأمر\n ولا تستبعد منه هذا\n بل { إِنَّ كَثِيراً مِّنَ ٱلْخُلَطَآءِ } الذين خلطوا أموالهم وتشاركوا فيها { لَيَبْغِيۤ } أي: يظلم ويتعدى { بَعْضُهُمْ عَلَىٰ بَعْضٍ } ظلماً وزوراً { إِلاَّ ٱلَّذِينَ آمَنُواْ } من الخلطاء بالله\n واستقاموا على صراطه الموضوع من عنده على العدالة الاستقامة { وَعَمِلُواْ ٱلصَّالِحَاتِ } المرضية عنده سبحانه\n سيما في الأمور المتعلقة لحقوق عباده\n ولكن { وَقَلِيلٌ مَّا هُمْ } أي: هم قليل في الدنيا في غاية القلة والندرة\n و \" ما \" مزيدة لكمال القلة والإبهام\n\nثم التفت عليه السلام إلى المدعى عليه\n فقال له بعدما سمع منه اعترافه: إن رمت هذا\n ضربنا منك هذا\n إشارة إلى طرف أنفه\n فقال المدعى عليه: أنت أيها الحاكم أحق بذلك الضرب\n فنظر عليه السلام ولم يرَ أحداً { وَ } حنيئذ { ظَنَّ } بل تيقن { دَاوُودُ أَنَّمَا فَتَنَّاهُ } وابتليناه بالذنب { فَٱسْتَغْفَرَ رَبَّهُ } عما جرى عليه من افتتان الله إياه { وَخَرَّ } ساجداً من خشية الله\n بعدما كان { رَاكِعاً } مكسور الظهر\n منكوس الرأس عن ارتكاب الذنب { وَأَنَابَ } [ص: 24] إلينا على وجه الندم والخجل مستحيياً عنَّا\n مستوحشاً عن سخطنا وغضبنا إياه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ليحكم بما حكم به من قوله: { قال لقد ظَلَمَكَ بسؤال نعجَتِكَ إلى نِعَاجِه } \n حتى يكون محجوباً بحكمه\n وهو جوابُ عن قسم محذوف\n قصد به عليه السلام المبالغة في إنكار فعل صاحبه به\n وتهجين طمعه في نعجة مَن ليس له غيرها\n مع أنَّ له قطيعاً منها\n ولعله عليه السلام قال ذلك بعد اعتراف صاحبه بما ادّعاه عليه\n أو: بناه على تقدير صدق المدعي\n أي: إن كنت صدقت فقد ظلمك\n والسؤال: مصدر مضاف إلى المفعول\n وتعديته إلى مفعول آخر لتضمينه معنى الضم { وإِنَّ كثيراً من الخُلَطاءِ } الشركاء الذين خلطوا أموالهم\n { لَيبغي بعضُهم على بعضٍ } غير مراع لحق الصحبة والشركة\n { إِلا الذين آمنوا وعملوا الصالحات } منهم\n فإنهم يتحامَوْن عن البغي والعدوان\n { وقليلٌ ماهم }  أي: وهم قليل\n\nو \" ما \": مزيدة للإبهام\n والتعجُّب من قِلتهم\n والجملة: اعتراض\n { وظنَّ داودُ أَنما فتناه } \n الظن مستعار للعلم الاستدلالي لما بينهما من المشابهة الظاهرة\n أي: علم بما جرى في مجلس الحكومة وقيل: لمّا قضى بينهما نظر أحدُهما إلى الآخر\n فضحك\n ثم صعدا إلى السماء فعلم عليه السلام أنه تعالى ابتلاه\n والقصر مُنصَّب على الفتنة\n أي: علم أنما فعلناه به فتنة وامتحان\n واختلف في سبب امتحانه\n قيل: لأنه تمنّى منزلة آبائه إبراهيم وإسحاق ويعقوب\n وقال: يا رب أرى الخير كله ذهب به آبائي\n فأوحى إليه: إني ابتليتهم\n فصبروا\n فابتلي إبراهيم بنمروذ وبذبح ولده\n وإسحاق بالذبح\n ويعقوب بالحزن على يوسف وذهاب بصره\n وأنت لم تُبتل بشيءٍ\n فقال: يا رب ابتلني بمثل ما ابتليتهم به\n فابتلي بالمرأة\n وقيل: إنه ادعى القوة\n وقال: إنه لا يخاف من نفسه قط\n فامتُحن\n { فاستغفر ربَّه } إثر ما علم أن ما صدر منه ذنب { وخَرَّ راكعاً } أي: ساجداً\n على تسمية السجود ركوعاً\n أو: خرَّ راكعاً مصلياً صلاة التوبة\n { وأنابَ } أي: رجع إلى الله بالتوبة\n رُوي: أنه بقي ساجداً أربعين يوماً يبكي\n حتى نبت البقل من دموعه\n ولم يشرب ماءً إلا وثلثاه دموع\n واشتغل بذلك عن المُلك\n حتى وثب ابن له\n يقال له: \" إيشا \" على ملكه ودعا إلى نفسه\n واجتمع إليه أهل الزيغ من بني إسرائيل\n فلما غفر له حاربه فهزمه\n هـ\n وهذا الموضع فيه سجدة عند مالك\n خلافاً للشافعي\n إلا أنه اختلف في مذهب مالك هل سجد عند قوله: { وأناب } أو عند قوله: { وحُسنَ مآبٍ }\n وروى الترمذي\n \" عن أبي سعيد الخدري: أنه رأى في المنام شجرة تقرأ سورة \" ص \" \n فلما بلغت: \" وأناب \" سَجَدَت\n وقالت: اللهم اكتب لي بها أجراً\n وحطّ عني بها وزراً\n وارزقني بها شكراً\n وتقبلها مني كما تقبلتها من عبدك داود\n فقال له ـ عليه الصلاة والسلام ـ: \" وسجدتً أنت يا أبا سعيد؟ \" قلت: لا\n قال: \" كنتَ أحق بالسجود من الشجرة \" \n\nثم تلى نبي الله الآيات\n حتى بلغ: { وأناب } فسجد\n وقال كما قالت الشجرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:23",
      "similarity": 0.5079319763505119
    },
    {
      "verse": "9:102",
      "similarity": 0.2671227320415022
    },
    {
      "verse": "2:220",
      "similarity": 0.2308921999456118
    },
    {
      "verse": "77:48",
      "similarity": 0.17014533621902106
    },
    {
      "verse": "5:55",
      "similarity": 0.16857218701242122
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}