{
  "chapter": "ص",
  "text": "ام نجعل الذين ءامنوا۟ وعملوا۟ الصلحت كالمفسدين فى الارض ام نجعل المتقين كالفجار",
  "translations": [
    {
      "translation": "Would We make those who have iman and do right actions the same as those who cause corruption on the earth? Would We make those who have taqwa the same as the dissolute?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should We equate those who do the right with those who spread corruption in the land? Should We make those who are morally integrated equal to those who seek disintegration?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then treat alike those that believe and act righteously and those that create mischief on earth? Or treat alike the God-fearing and the wicked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do We consider the righteously striving believers equal to the evil-doers in the land? Are the pious ones equal to those who openly commit sin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We make those who believe and do good deeds equal to those who spread turmoil in the earth? Or shall We equate the pious with the disobedient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who believe and do righteous good deeds as those who cause mischief on the earth Or shall We treat those who have Taqwa as the evildoers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who believe and do good like the mischief-makers in the earth? Or shall We make those who guard (against evil) like the wicked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or shall We make those who believe and do righteous deeds as the workers of corruption in the earth, or shall We make the godfearing as the transgressors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who believe and do good works as those who spread corruption in the earth; or shall We treat the pious as the wicked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "shall We treat those who believe and do good works the same as those who spread corruption in the land; shall We treat the pious the same as the wicked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We make those who believe and work righteous works I i ke Unto the corrupters in the earth; Or Shall We make the God-fearing like Unto the wicked!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who have faith and do righteous deeds like those who cause corruption on the earth? Shall We treat the Godwary like the vicious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who believe and work deeds of righteousness, the same as those who do mischief on earth? Shall We treat those who guard against evil, the same as those who turn aside from the right?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, as Mufsidun (those who associate partners in worship with Allah and commit crimes) on earth? Or shall We treat the Muttaqun (pious - see V. 2:2), as the Fujjar (criminals, disbelievers, wicked, etc)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are We to make those who believe and do good works the same as those who corrupt the earth? Are We to make the righteous as the wicked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are We to treat those who believe and do righteous deeds like those who make trouble on earth? Or are We to treat the pious like the shameless?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or should we treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allah like the wicked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:28] Or shall We treat those who believe and perform righteous deeds like those who cause corruption in the earth; or shall We treat the God-fearing like the profligate? This was revealed when the Meccan disbelievers said to the believers, ‘In the Hereafter we will receive the same [reward] as that which you will receive’ (am, ‘or’, contains the [rhetorical] hamza of denial).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Shall We treat those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and perform acts of obedience between themselves and their Lord; the reference here is to 'AN Ibn Abi Talib, Hamzah Ibn 'Abd al-Muttalib and 'Ubaydah Ibn al-Harth (as those who spread corruption) as the idolaters (in the earth) i.e. 'Utbah and Shaybah the sons of Rabi'ah, and al-Walid Ibn 'Utbah; (or shall We treat the Pious) who ward off disbelief, idolatry and indecent acts, i.e. 'AN and his two fellow believers (as the wicked) as the disbelievers: 'Utbah and Shaybah the sons of Rabi'ah, and al-Walid Ibn 'Utbah? Each one of these three had, on the Day of Badr, a dual with 'AN, Hamzah and 'Ubaydah, respectively; 'AN killed al-Walid Ibn 'Utbah, Hamzah killed 'Utbah Ibn Rabi'ah and 'Ubaydah killed Shaybah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n الصادرة عن أسمائه { كالمفسدين } المحجوبين الفاعلين بأنفسهم وصفاتهم الأفعال البهيمية والسبعية والشيطانية في أرض الطبيعة { أم نجعل المتّقين } المجرّدين عن صفاتهم { كالفجّار } المتلبسين بالغواشي النفسانية والشيطانية في أعمالهم { ليدّبروا آياته } بالنظر العقلي ما داموا في مقام النفس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أنَّا نسوي في الرتبة بين أرباب الهداية والإيمان وأصحاب الضلال والطغيان { أَمْ نَجْعَلُ ٱلْمُتَّقِينَ كَٱلْفُجَّارِ } [ص: 28] بل زعموا\n واعتقدوا مساواة أهل المغفرة والتقوى مع أصحاب الغفلة والهوى\n المنهمكين في أودية الضلالات بمتابعة اللذات والشهوات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم نجعلُ المتقين كالفجارِ } إنكار للتسوية بين الفريقين المذكورين\n وحمل الفجار على فجرة المؤمنين مما لا يُساعده المقام\n ويجوز أن يراد بهذين الفريقين عين الأولين\n ويكون التكرير باعتبار وصفين آخرين\n هما أدخل في إنكار التسوية من الوصفين الأولين\n وقيل: قالت قريش للمؤمنين: إنا نُعْطَى من الخير يوم القيامة مثل ما تُعْطَونَ\n فنزلت\n الإشارة: قال الورتجبي: ولَمَّا خرج داودُ من امتحان الحق وبلائه\n كساه خلعة الربوبية\n وألبسه لباسَ العزة والسلطنة\n كآدم خرج من البلاء\n وجلس في الأرض على بساط فلك الخلافة\n وذلك بعد كونهما متخلقين بخلق الرحمن\n مصوّرين بصورة الروح الأعظم\n فإذا تمكن داود في العشق\n والمحبة\n والنبوة\n والرسالة\n والتخلٌّق\n صار أمرُه أمرَ الحق\n ونهيُه نهيَ الحق\n هـ\n وقال ابن عطية: لا يُطلق خليفة الله إلا لنبي\n وإطلاقه في غير الأنبياء تجوُّز وغلوٌّ\n هـ\n قلت: يُطلق عند الأولياء على مَن تحققت حريته\n ورسخت ولايته\n وظهر تصرفه في الوجود بالهمة\n حتى يكون أمره بأمر الله\n غالباً\n وهو مقام القطبانية\n فالمراتب ثلاث: صلاح\n وولاية\n وخلافة\n فالصلاح لِمن صلح ظاهره بالتقوى\n والولاية لِمن تحقق شهوده\n مع بقية من نفسه\n بحيث تقل عثراته جدًّا\n والخلافة لِمن تحققت حريته\n وظهرت عصمته\n بجذب العناية\n والله تعالى أعلم\n وقوله تعالى: { ولا تتبع الهوى } \n الهوى: ما تهواه النفس\n وتميل إليه\n من الحظوظ الفانية\n قلبية كانت\n كحب الجاه\n والمال\n وكالميل في الحُكم عن صريح الحق\n أو: نفسانية\n كالتأنُّق في المآكل\n والمشارب\n والمناكح\n واتباعُ الهوى: طلبُه\n والسعي في تحصيله\n فإن كان حراماً قدح في الإيمان\n وإن كان مباحاً قدح في نور مقام الإحسان\n فإن تَيسَّرَ من غير طلب وتشوُّف\n وكان موافقاً للسان الشرع\n جاز تناول الكفاية منه\n مع الشكر وشهود المنَّة\n قال عمر بن عبد العزيز: إذا وافق الحقُّ الهوى\n كان كالزبد بالبرسَام\n أي: السكر\n وفي الحِكَم: \" لا يخاف أن تلتبس الطرق عليك\n إنما يخاف من غلبة الهوى عليك \" وغلبة الهوى: قهره وسلطنته\n بحيث لا يملك نفسه عند هيجان شهوتها\n وقوله تعالى: { وما خلقنا السماء والأرضَ وما بينهما باطلاً } أي: بل خلقناهما لنُعرف بهما\n فما نُصبت الكائنات لتراها\n بل لترى فيها مولاها\n وقد تقدّم هذا مراراً\n ولا ينال هذا المقام إلا بعبادة التفكُّر والتدبُّر\n كما أشار إلى ذلك بقوله: { كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِّيَدَّبَّرُوۤاْ آيَاتِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:1",
      "similarity": 0.6371250252314867
    },
    {
      "verse": "80:42",
      "similarity": 0.6219620956614564
    },
    {
      "verse": "82:3",
      "similarity": 0.5391579681106493
    },
    {
      "verse": "75:5",
      "similarity": 0.5315519735118528
    },
    {
      "verse": "82:14",
      "similarity": 0.5111581628688728
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/38:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/38:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}