{
  "chapter": "ص",
  "text": "وشددنا ملكه وءاتينه الحكمة وفصل الخطاب",
  "translations": [
    {
      "translation": "We made his kingdom strong and gave him wisdom and decisive speech.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We further strengthened his kingdom, and bestowed wisdom on him, and judgement in legal matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened his kingdom and endowed him with wisdom and decisive judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We strengthened his kingdom, giving him wisdom and the power of sound Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened his kingdom and gave him wisdom and just speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made his kingdom strong and gave him Al-Hikmah and sound judgement in speech and decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened his kingdom and We gave him wisdom and a clear judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We strengthened his kingdom, and gave him wisdom and speech decisive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made his kingdom strong and gave him wisdom and decisive speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made his kingdom strong, and bestowed upon him wisdom and sagacity in judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made his dominion strong and vouchsafed him wisdom and decisive speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We consolidated his kingdom and gave him wisdom and conclusive speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We strengthened his kingdom, and gave him wisdom and sound judgment in speech and decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made his kingdom strong and gave him Al-Hikmah (Prophethood, etc.) and sound judgement in speech and decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made his kingdom strong and gave him wisdom and decisive speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened his kingdom, and gave him wisdom and decisive speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened his kingdom and gave him wisdom and discernment in speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:20]   And We strengthened his Kingdom, We reinforced it with guards and hosts: every night there thirty thousand men would be standing guard at his sanctuary; and gave him wisdom, prophethood and sound judgement in [all] matters, and decisive speech, [the ability to formulate] a satisfactory statement [for a decision] in any endeavour.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We made his kingdom strong) with guardsmen; his royal chamber was guarded every night by 30,000 men (and gave him wisdom) prophethood (and decisive speech) and judgement; he never stumbled in his speech when he judged between people. In his judgement proof was required from the claimant while an oath was required from the defendant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآتَيْنَاهُ ٱلْحِكْمَةَ وَفَصْلَ ٱلْخِطَابِ } معناه الفهمُ والعلمُ بالقضاءِ\n وقال: الشهودُ والإِيمانُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال جودنا ولطفنا معه { شَدَدْنَا } له { مُلْكَهُ } الظاهر؛ أي: قوينا استيلاءه وتسليطه على الأنام، وألقينا هيبته على قلوبهم إلى حيث لم يخرجوا عن الحدود الموضوعة في شرعه خوفاً من اطلاعه\n\n\n\n\nوسبب هيبته أن تحاكم عنده رجلان، فادعى أحدهما على الآخر بأن غصب منه بقرة عدواناً وظلماً، فأنكر الآخر، ولم يكن للمدعي بينة، فأريناه في منامه أن يقتل المدعى عليه، ويحكم بالبقرة للمدعي، فلما استيقظ كذب نفسه واستغفر، فنام فأريناه مثل ذلك، واستيقظ فاستغفر ثانياً، فنام فرأى ثالثاً مثل ذلك، فتيقن أنه من الله، فهمَّ أن يقتله تنفيذاً لما أُلهم إليه، فقال للمدعى عليه: أتقتلني بلا بينة\n\n\n\n\nفقال عليه السلام: نعم والله لأنفذنَّ حكم الله تعالى فيك، فلما تفطن الرجل منه الجزم في عزمه، اضطر إلى الاعتراف، حيث قال: لا تعجل يا نبي الله حتى أخبرك، والله ما أخذت بهذا الذنب ظلماً وزوراً، ولكني قتلت والد هذا المدعي اغتيالاً وخداعاً\n\n\n\n\nفتقله عليه السلام: وعظمت هيبته في قلوب الناس، حتى انزجروا عن مطلق المحرمات والمنهيات خوفاً من اطلاعه، وقالوا: لا نعمل شيئاً إلا علمه، فيقضي علينا بمقتضى علمه، هذا تأييدنا وتقويتنا إياه بحسب الظاهر والسلطنة الصورية\n\n\n\n\n{ وَ } أمَّا بحسب الباطن والحقيقة { آتَيْنَاهُ ٱلْحِكْمَةَ } المتقنة التي يتصرف بها في حقائق الأمور، ويطلع على سرائرها بنور النبوة والولاية الموروثة له من أسلافه الكرام، الموهوبة إياه من الحكيم العلام تأييداً له وتقوية لشأنه { وَ } آتيناه أيضاً { فَصْلَ ٱلْخِطَابِ } [ص: 20] أي: قطع الخصومات على التفصيل الذي وقع بين المتخاصمين بلا حيف وميل إلى جانب على ما هو مقتضى العدل الإلهي بالخطاب المفصول الموضح الواضح المقتصد بلا اقتصار مخل وإطناب ممل، وبالجملة: بلا إغلاق يشتبه مضمونه على المتخاصمين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وشَدَدْنا مُلْكَه } أي: قوّيناه بالهيبة والنصرة وكثرة الجنود\n قيل: كان بيت المقدس حول محرابه ثلاثة وثلاثون ألف رجل\n قال القشيري: ويقال: وشددنا ملكه بالعدل في القضية، وحسن السيرة في الرعية، أو: بدعاء المستضعفين، أو: بقوم مناصحين، كانوا يَدُلونه على ما فيه صلاح ملكه، أو: بقبوله الحق من كل أحد، أو: برجوعه إلينا في عموم الأوقات\n هـ\n وقال ابن عباس: أن رجلاً من بني إسرائيل استعدى على رجل من عظمائهم إلى داود، فقال المستعدي: إن هذا غصبني بقرتي، فجحد الآخر، ولم تكن له بينة، فقال داود: قُوما حتى أنظر في أمركما، فأوحى الله تعالى إلى داود في منامه: أن اقْتُل الرجل الذي استعدِيَ عليه، فتثبت داود حتى أوحى الله إليه ثلاثاً أن يقتله، أو تأتيه العقوبة من الله، فأرسل داود إلى الرجل: أن الله قد أوحى إليَّ أن أقتلك، فقال: تقتلني بغير بينة؟ فقال: نعم، والله لأنفذنَّ أمرَ الله فيك، فلما عرف الرجلُ أنه قاتله، فقال: لا تعجل عليَّ حتى أخبرك أن الله تعالى لم يأخذني بهذا الذنب، الذي هو السرقة، ولكني كنتُ قتلتُ أبا هذا غِيلة، وأخذتُ البقرة، فقتله داود، فقال الناس: إذا أذنب أحد ذنباً أظهره الله عليه فقتله، فهابوه، وعظمت هيبته في القلوب هـ\n { وآتيناه الحكمة } النبوة، وكمال العلم، وإتقان العمل، والإصابة في الأمور، أو: الزبور وعلم الشرائع\n وكل كلام وافق الحق فهو حكمة\n { وفَصْلَ الخطاب } علم القضاء وقطع الخصام، فكان لا يتتعتع في القضاء بين الناس، أو: الفصل بين الحق والباطل\n والفصل: هو التمييز بين الشيئين، وقيل: الكلام البيِّن، بحيث يفهمه المخاطب بلا التباس، فصْل بمعنى مفصول، أو: الكلام البيِّن الذي يبين المراد بسرعة، فيكون بمعنى فاصل، والمراد: ما أعطاه الله من فصاحة الكلام، الذي كان يفصل به بين الحق والباطل، والصحيح والفاسد، في قضاياه وحكوماته، وتدابير الملك، والمشورات\n وعن عليّ رضي الله عنه: \" هو الْبَيِّنَةُ على المُدَّعِي، وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ \" وعن الشعبي: \" هو: أما بعد \" فهو أول مَن تكلم بها، فإنَّ مَن تكلم في الذي له شأن يفتتح بذكر الله وتحميده، فإذا أراد أن يخرج إلى الغرض المسوق له الكلام، فصل بينه وبين ذكر الله بقوله: أما بعد\n الإشارة: فاصبر أيها الفقير على ما يقولون فيك، وتسلّ بمَن قبلك من أهل الخصوصية الكبرى والصغرى، ففيهم أُسوة حسنة لمَن يرجو الوصول إلى الله تعالى\n وقوله تعالى: { إِنَّا سخَّرنا الجبالَ معه\n\n\n } الخ\n قال القشيري: كل مَن تحقق بحالة ساعده كل شيء\n هـ\n قلت: وفي الحِكَم: \" أنت مع الأكوان ما لم تشهد المكوِّن، فإذا شهدت المكوِّن كانت الأكوان معك \" وبالله التوفيق\n ثم ذكر امتحان داود عليه السلام، فقال: { وَهَلْ أَتَاكَ نَبَأُ ٱلْخَصْمِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:37",
      "similarity": 0.76523400733447
    },
    {
      "verse": "15:57",
      "similarity": 0.7532761041076019
    },
    {
      "verse": "51:31",
      "similarity": 0.7532761041076019
    },
    {
      "verse": "25:63",
      "similarity": 0.4574824629518533
    },
    {
      "verse": "11:37",
      "similarity": 0.4328851776917634
    }
  ]
}