{
  "chapter": "ص",
  "text": "وهل اتىك نبؤا۟ الخصم اذ تسوروا۟ المحراب",
  "translations": [
    {
      "translation": "Has the story of the litigants reached you? How they climbed up to the Upper Room",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you heard of the litigants who jumped over the wall into his chamber?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of the litigants reached you -- of those who entered his private chambers by climbing over the wall?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you heard the news of the disputing parties who climbed the walls of the prayer room\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And did the news of the two disputants reach you? When they scaled over the wall into Dawud’s mosque.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has the news of the litigants reached you When they climbed over the wall into (his) Mihrab (private chamber of worship);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has there come to you the story of the litigants, when they made an entry into the private chamber by ascending over the walls?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the tiding of the dispute come to thee? When they scaled the Sanctuary,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hath the story of the litigants come unto thee? How they climbed the wall into the royal chamber;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you heard the story of the disputants who entered his chamber by climbing over the wall?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hath the tidings of the contending parties reached thee, when they walled the apartment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the account of the contenders, when they scaled the wall into the sanctuary?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the Story of the Disputants reached thee? Behold, they climbed over the wall of the private chamber;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has the news of the litigants reached you? When they climbed over the wall into (his) Mihrab (a praying place or a private room,).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the news of the dispute reached you (Prophet Muhammad)? When they scaled the Sanctuary\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of the two disputants reached you? When they scaled the sanctuary?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has there come to you the news of the adversaries, when they climbed over the wall of [his] prayer chamber -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:21] And has there come to you, O Muhammad (s) (the purpose of the interrogative [indicated by hal] here is to provoke curiosity and a desire to listen to what will follow) the tale of the disputants, when they scaled the sanctuary?, David’s sanctuary, that is, his place of prayer, for they had been prohibited from entering by the [front] gates because of his being engaged in worship, in other words, [has it come to you] their tale and their account?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And hath the story of the litigants come unto thee?) Then came to you the story of the opponents of David. (How they climbed the wall into the royal chamber;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَهَلْ أَتَاكَ } وحصل عندك يا أكمل الرسل { نَبَؤُاْ ٱلْخَصْمِ } أي: خبر الملكين المكلفين المصورين بصورة الخصمين اللذين جاءوا للحكومة عند أخيك داوود عليه السلام، حين اعتزل في محرابه للعبادة على ما هو عادته في تقسيم أيامه ثلاثة أقسام: يوم لعيش النساء، ويوم لقطع الخصومات بين الأنام، ويوم للتوجه نحو الحق والمناجاة معه سبحانه في محرابه\n\n\n\n\nوكان في محرابه والباب مغلق عليه، والحراس على الباب فجاءا - أي: الملكان - في صورة رجلين متخاصمين على الباب، فمنعهما البواب، فأخذا يستعليان المحراب\n\n\n\n\nاذكر نبأهما وقت { إِذْ تَسَوَّرُواْ } أي: صعدوا على حائط { ٱلْمِحْرَابَ } [ص: 21] واستعلوا على سوره بقصد الدخول عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وهل أتاك نبأ الخصم } استفهام، معناه التعجُّب والتشويق إلى استماع ما في حيزه لأنه من الأنباء البديعة، والأخبار العجيبة\n والخصم ـ في الأصل: مصدر، ولذلك يطلق على الواحد والجمع، كالضيف والزوْر\n وأريد هنا اثنان، وإنما جمع الضمير بناء على أن أقل الجمع اثنان\n { إذ تسوَّروا المحراب } أي: تصعّدوا سوره ونزلوا إليه\n والسور: الحائط المرتفع، ونظيره: تسنمه: إذا علا سنمه\n والمحراب: الغرفة، أو: المسجد، سمي محراباً لتحارب الشيطان فيه والخواطر الردية",
      "translations": []
    }
  ]
}