{
  "chapter": "ص",
  "text": "اذ دخلوا۟ على داود ففزع منهم قالوا۟ لا تخف خصمان بغى بعضنا على بعض فاحكم بيننا بالحق ولا تشطط واهدنا الى سواء الصرط",
  "translations": [
    {
      "translation": "and came in on Dawud who was alarmed by them. They said, 'Do not be afraid. We are two litigants, one of whom has acted unjustly towards the other, so judge between us with truth and do not be unjust and guide us to the Right Path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they came before David, he was frightened of them. \"Do not be afraid,\" they said. \"The two of us are disputing the wrong one has done the other. So judge between us with equity, and do not be unjust, and guide us to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As they came upon David -- and he was frightened of them -- they said: “Be not afraid. We are just two litigants: one of us has committed excess against the other. So judge rightly between us, and be not unjust; and guide us to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and entered where David was (praying). He was frightened, so they said, \"Do not be afraid. We are only two disputing parties of which one of us has transgressed against the other. Judge between us with truth and justice and guide us to the right path\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered upon David, so he feared them – they said, “Do not fear! We are two disputants, one of whom has wronged the other, therefore judge fairly between us and do not judge unjustly – and show us the right way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered in upon Dawud, he was terrified of them. They said: \"Fear not! (We are) two litigants, one of us has wronged the other, therefore judge between us with truth, and treat us not with injustice, and guide us to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered in upon Dawood and he was frightened at them, they said: Fear not; two litigants, of whom one has acted wrongfully towards the other, therefore decide between us with justice, and do not act unjustly, and guide us to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they entered upon David, and he took fright at them; and they said, 'Fear not; two disputants we are -- one of us has injured the other; so judge between us justly, and transgress not, and guide us to the right path.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How they burst in upon David, and he was afraid of them. They said: Be not afraid! (We are) two litigants, one of whom hath wronged the other, therefor judge aright between us; be not unjust; and show us the fair way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they reached David, he took fright, but they said, \"Do not be afraid. We are two disputants, one of whom has wronged the other: judge between us fairly, do not be unjust, and guide us to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they went in unto Da-ud, he was frightened at them. They said: fear not we are two contending parties; one of us hath oppressed the other, so judge between us with truth, and be not iniquitious, and guide us unto the even path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered into the presence of David, he was alarmed by them. They said, ‘Do not be afraid. [We are only] two contenders: one of us has bullied the other. So judge justly between us, and do not exceed [the bounds of justice], and show us the right path.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered the presence of David, and he was terrified of them, they said: \"Fear not: we are two disputants, one of whom has wronged the other: Decide now between us with truth, and treat us not with injustice, but guide us to the even Path..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered in upon Dawud (David), he was terrified of them, they said: \"Fear not! (We are) two litigants, one of whom has wronged the other, therefore judge between us with truth, and treat us not with injustice, and guide us to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they went to David whereupon he was afraid of them, but they said: 'Do not be afraid, we are two that have a dispute, one of us has wronged the other. Judge between us justly, and do not transgress, and guide us to the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered upon David, and he was startled by them. They said, “Do not fear. Two disputants; one of us has wronged the other; so judge between us fairly, and do not be biased, and guide us to the straight way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered upon David and he was alarmed by them? They said, \"Fear not. [We are] two adversaries, one of whom has wronged the other, so judge between us with truth and do not exceed [it] and guide us to the sound path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:22] When they entered upon David, and he was frightened by them. And they said, ‘Do not fear; we are, two disputants (some say that this means ‘two groups’, in order to agree with the plural person [of the verb dakhalū, ‘they entered’]; others say, ‘two individuals’ with the plural person actually denoting these two; alkhasm may refer to a one or more individuals. These two were angels who had come in the form of two disputants, between whom there [was supposed to have] occurred the situation mentioned — [but] only hypothetically — in order to alert David, peace be upon him, to what he had done: he had ninety nine women but desired the woman of a man who had only her and no other. He [David] had married her and consummated the marriage. One of us has infringed upon the [rights of the] other, so judge justly between us and do not transgress, [do not] be unjust, and guide us, direct us, to the right path’, the correct way.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "How they burst in upon David, and he) David (was afraid of them. They) i.e. the two angels who entered in on David (said: Be not afraid (We are) two litigants, one of whom hath wronged the other, therefore judge aright) justly (between us; be not unjust) do not be partial and transgress not; (and show us the fair way) show us what is right.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُشْطِطْ } معناه لا تُسرِفْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And do not be excessive,\" means do not be excessive.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر وقت { إِذْ دَخَلُواْ عَلَىٰ دَاوُودَ } من غير الباب بأن شُق لهما الجدار\n فدخلا عليه { فَفَزِعَ } داوود { مِنْهُمْ } واستوحش من دخولهم لا من الطريق المعهود\n وبعدما تفرسوا منه الرعب والفزع { قَالُواْ } له تسلية وتسكيناً: { لاَ تَخَفْ } منَّا\n ولا تحزن من إلمامنا إياك\n إذ نحن { خَصْمَانِ } تحاكمنا إليك حتى تقضي بيننا\n وقد { بَغَىٰ } أي: ظلم واستولى { بَعْضُنَا عَلَىٰ بَعْضٍ } أي: أحدنا على الآخر { فَٱحْكُمْ } أيها الحاكم العدل العالم { بَيْنَنَا بِٱلْحَقِّ } أي: بالعدل السوي { وَلاَ تُشْطِطْ } أي: لا تجر ولا تتجاوز عن مقتضى القسط الإلهي { وَ } بالجملة: { ٱهْدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَاطِ } [ص: 22] أي: أعدل الطرق وأقوم السبل في سلوك طريق النجاة\n\n\nثم أخذوا في تقرير المسألة\n فقال أحدهما: { إِنَّ هَذَآ أَخِي } في الدين ورفيقي في سلوك طريق التوحيد واليقين { لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً } وهي الأنثى من الضأن\n كنى بها العرب عن المرأة { وَلِي نَعْجَةٌ وَاحِدَةٌ } فقط",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذ دخلوا على داودَ }: بدل مما قبله\n أو: ظرف لتَسوروا\n { فَفَزِعَ منهم }: تروَّع منهم\n رُويَ أن الله تعالى بعث إليه ملكين في صورة إنسانين\n قيل: جبريل وميكائيل\n فطلبا أن يدخلا عليه\n فوجداه في عبادته\n فمنعهما الحرس\n فتسوّروا عليه المحراب\n فلم يشعر إلا وهما بين يديه\n جالسان\n ففزع منهم لأنهم دخلوا عليه في غير يوم القضاء\n ولأنهم نزلوا من فوق\n وفي يوم الاحتجاب\n والحرس حوله لا يتركون مَن يدخل عليه\n قال الحسن: جزأ داود عليه السلام الدهر أربعة أجزاء يوماً لنسائه\n ويوماً للعبادة\n ويوماً للقضاء\n ويوماً للمذاكرة مع بني إسرائيل\n فدخلوا عليه يوم عبادته\n فلما فزع { قالوا لا تخفْ } \n نحن { خصمانِ بَغَى بعْضُنا على بعض } أي: ظلم وتطاول عليه\n { فاحكمْ بيننا بالحق ولا تشْطِطْ } لا تَجُرْ\n من: الشطط\n وهو مجاوزةُ الحدّ وتخطي الحق\n { واهدنا إِلى سواء الصراط } وأرشدنا إلى وسط الطريق ومحجته\n والمراد: عين الحق وصريحه\n  رُوي: أن أهل زمان داود عليه السلام كان يسألُ بعضهم بعضاً أن ينزل له عن امرأته\n فيتزوجها إذا أعجبته\n وكان لهم عادة في المواساة بذلك\n وكان في أول الإسلام شيء من ذلك بين المهاجرين والأنصار\n فاتفق أنَّ عَيْنَ داودَ عليه السلام وقعت على امرأة أورِيا\n وكانت جميلة\n فأحبّها\n فسأله النزولَ له عنها\n فاستحيا أن يردّه\n ففعل\n فتزوجها\n وهي أم سليمان فعُوتب في ذلك\n وقيل له: إنك مع عظيم منزلتك\n وكثرة نسائك\n لم يكن ينبغي لك أن تسأل رجلاً ليس له إلا امرأة واحدة\n كان الواجب عليك مغالبةُ هواك\n وقهر نفسك\n واصبر على ما امتحِنْتَ به\n وقيل: خطبها أوريا\n وخطبها داود\n فآثره أهلها\n فكانت زلته أن خطب على خطبة أخيه المؤمن مع كثرة نسائه\n هـ\n ولعلم لم يكن محرماً في شرعهم\n وإنما كان خلاف الأَولى\n وقال شيخ شيوخنا في حاشيته: لا يصح هذا في حق الأنبياء\n وما يُحكى أنه بعث أوريا إلى الغزو مرة بعد مرة\n وأحبّ أن يُقتل ليتزوجها\n فلا يليق من المتسمين بالصلاح من أبناء الناس\n فضلاً عن بعض أعلام الأنبياء\n\nوقال عليّ ـ كرّم الله وجهه ـ: مَن حدّثكم بحديث داود عليه السلام على ما يرويه القصَّاص جلدتْه مائةً وستين\n وهو حدّ الفرية على الأنبياء ـ يعني الحدّ مرتين ـ\n ورُويَ: أن رجلاً حدّث بها عند عُمر بن عبد العزيز\n وعند رجلٌ من أهل الحق\n فكذَّب المحدِّث\n وقال: إن كانت القصة على ما في كتاب الله\n فما ينبغي أن يُلتمَس خلافُها\n ولا أن يُقال غير ذلك\n وإن كانت على ما ذكرتَ\n وقد سترها الله على نبيه\n فما ينبغي إظهارَها عليه\n فقال عمر: لَسَماعي لهذا الكلام أحبّ إليّ مما طلعت عليه الشمس\n والذي يدلُّ عليه المثل الذي ضربه الله لقصته عليه السلام ليس إلا أنه طلب من زوج المرأة أن ينزل عنها فحسب\n فتزوجها\n وإنما جاءت على طريق التمثيل والتعريض\n دون التصريح لكونها أبلغ في التوبيخ\n من قِبَل أنّ المتأمل إذا أدّاه إلى الشعور بالمعرِّض به كان أوقع في نفسه\n وأَشَدّ تمكُّناً من قلبه\n وأعظم أثراً فيه\n مع مراعاة حسن الأدب\n بترك المجاهرة بالعتاب\n قاله النفسي\n ثم ذكر التعريض بقوله: { إِن هذا أَخي } في الدين\n أو: في الصداقة\n أو: الشركة\n والتعبير به لبيان كمال قُبح ما فعل به صاحبه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:4",
      "similarity": 0.5785361628498904
    },
    {
      "verse": "18:14",
      "similarity": 0.5212679269454482
    },
    {
      "verse": "27:89",
      "similarity": 0.37718154500003437
    },
    {
      "verse": "21:103",
      "similarity": 0.35477673641551977
    },
    {
      "verse": "34:23",
      "similarity": 0.32910925130584173
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}