{
  "chapter": "ص",
  "text": "كتب انزلنه اليك مبرك ليدبروا۟ ءايته وليتذكر او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "It is a Book We have sent down to you, full of blessing, so let people of intelligence ponder its Signs and take heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down a Book to you which is blessed, so that people may apply their minds to its revelations, and the men of wisdom may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Blessed Book that We have revealed to you, (O Muhammad), that people with understanding may reflect over its verses and those with understanding derive a lesson.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a blessed Book which We have revealed for you so that you will reflect upon its verses and so the people of understanding will take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book which We have sent down upon you, a blessed Book, for them to ponder upon its verses, and for men of intellect to accept advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) a Book which We have sent down to you, full of blessings, that they may ponder over its Verses, and that men of understanding may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) a Book We have revealed to you abounding in good that they may ponder over its verses, and that those endowed with understanding may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book We have sent down to thee, Blessed, that men possessed of minds may ponder its signs and so remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) a Scripture that We have revealed unto thee, full of blessing, that they may ponder its revelations, and that men of understanding may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a blessed Book which We sent down to you [Muhammad], for people to ponder over its messages, and for those with understanding to take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book We have sent down Unto thee, blest, that they may ponder the revelations thereof, and that there may be admonished men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a blessed Book that We have sent down to you, so that they may contemplate its signs, and that those who possess intellect may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Here is) a Book which We have sent down unto thee, full of blessings, that they may mediate on its Signs, and that men of understanding may receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) a Book (the Quran) which We have sent down to you, full of blessings that they may ponder over its Verses, and that men of understanding may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a Blessed Book that We have sent down to you (Prophet Muhammad), so that those possessed with minds might ponder its verses and remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A blessed Book that We sent down to you, that they may ponder its Verses, and for those with intelligence to take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:29] A Book (kitābun, the predicate of a missing subject, namely, hādhā, ‘this is’) that We have revealed to you, full of blessing, that they may contemplate (yaddabbarū is actually yatadabbarū, but the tā’ has been assimilated with the dāl) its signs, [that] they may reflect upon its meanings and become believers, and that they may remember, that they may be admonished — those people of pith, those possessors of intellect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((This is) a Scripture that We have revealed unto you) We have sent with Gabriel to you, (full of blessing) wherein there is forgiveness and mercy for those who believe in it, (that they may ponder its revelations, and that men of understanding) and that those possessed of intellects among people (may reflect) take heed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مخاطباً لحبيبه صلى الله عليه وسلم على سبيل العظة والتذكير: هذا { كِتَابٌ } جامع لفوائد الكتب السالفة\n مشتمل على زوائد خلت عنها تلك الكتب { أَنزَلْنَاهُ إِلَيْكَ } أيها الجامع لجميع مراتب الوجود من مقام عظيم جودنا معك\n ومع من تبعك من المؤمنين { مُبَارَكٌ } كثير الخبر والبركة على من أمتثل بأوامره\n واجتنب عن نواهيه\n وانكشف بما فيه من الرموز والإشارات المنبهة إلى التوحيد وإسقاط الإضافات\n والتخلق بصفات الحق وأخلاقه\n والاتصاف بمقتضيات أسمائه الحسنى\n وإنما أنزلناه { لِّيَدَّبَّرُوۤاْ } أي: ليتدبر المتدبرون المتفكرون في أساليب { آيَاتِهِ } الكريمة\n واتساق تراكيبه البديعة\n وإفاضاتها المعاني العجيبة المنتشئة المترشحة من بحر الذات حسب شئون الأسماء والصفات الظاهرة آثارها على وفق التجليات الحبية\n { وَلِيَتَذَكَّرَ } ويتعظ بعدما تأمل وتدبر { أُوْلُواْ ٱلأَلْبَابِ } [ص: 29] المستكشفون عن حقائق الموجودات\n ولباب الكائنات والفاسدات المعرضين عن قشورها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" كتابٌ \": خبر عن مضمر، أي: هذا، و \" أنزلناه \": صفة له، و \" مبارك \": خبر ثان، أو: صفة الكتاب، و \" لِّيدبروا \": متعلق بأنزلناه\n قيل: لمَّا نفى التسوية بين الصالح المتقِّي، والمفسد الفاجر، بيَّن ما تحصل به لمتبعيه السعادة الأبدية، ويحصل به الصلاح التام، والتقوى الكاملة\n وهو كتاب الله فقال جلّ جلاله: { كتابٌ } وهو القرآن { أَنزلناه إليك مباركٌ } كثير المنافع الدينية والدنيوية، أنزلناه { ليدَّبّروا آياته } أي: ليتفكروا في آياته، التي من جملتها هذه الآيات المعربة عن أسرار التكوين والتشريع، فيعرفوا ما في ظاهرها من المعاني الفائقة، والتأويلات اللائقة\n وقرى: { لتدبروا } على الخطاب، أي: أنت وعلماء أمتك، بحذف إحدى التاءين\n { وليتذكَّر أولوا الألباب } أي: وليتّعِظ به ذوو العقول الصافية، السليمة من الهوى، فيقفوا على ما فيه، ويعملوا به، فإنَّ الكتب الإلهية ما نزلت إلا ليُتدبر ما فيها، ويُعمَل به\n وعن الحسن: قد قرأ هذا القرآن عبيدٌ وصبيان، لا علم لهم بتأويله، حفظوا حروفه وضيّعوا حدوده\n هـ\n الإشارة: كتاب الله العزيز بطاقة من عند الملك، والمراد من البطاقة فَهْمُ ما فيها، والعمل به، لا قراءة حروفها ورسومها فقط، فمَن فعل ذلك فهو مقصّر\n وذكر في الإحياء أن آداب القراءة عشرة، أي: الآداب الباطنية: الأول: فَهْمُ عظمة الكلام وعُلوّه، وفضل الله سبحانه بخلقه، في نزوله عن عرش جلاله، إلى درجة أفهام خلقه، فلولا استتار كُنه جلال كلام الله تعالى، بكسوة الحروف، لما ثبت لكلام الله عرش ولا ثرى، ولَتَلاشى ما بينهما من عظمة سلطانه، ولولا تثبيت الله موسى عليه السلام ما أطاق سماع كلامه، كما لم يطق الجبل مبادر نوره\n الثاني: تعظيم المتكلم به، وهو الله سبحانه، فيخطر في قلبه عظمة المتكلم، ويعلم أن ما يقرأه ليس من كلام البشر، وأن في تلاوة كتابه غاية الخطر، ولهذا كان عكرمة إذا نشر المصحف غشي عليه\n الثالث: حضور القلب، وترك حديث النفس، فإذا قرأ آية غافلاً أعادها\n الرابع: التدبُّر، وهو وراء الحضور، فإنه قد لا يتفكّر في غير القرآن، ولكنه مقتصر على سماع القرآن من نفسه وهو لا يتدبّره\n قال عليٌّ رضي الله عنه: لا خير في عبادة لا فقه فيها، ولا خير في قراءة لا تدبُّر فيها\n الخامس: التفهُّم، وهو أن يستوضح كل آية ما يليق بها إذ القرآن مشتمل على ذكر صفات الله تعالى، وذكر أفعاله، وذكر أحوال أنبيائه ـ عليهم السلام ـ، وذكر أحوال المكذّبين، وكيف أُهلكوا، وذكر أوامره وزواجره، وذكر الجنة والنار، قال عبد الله بن مسعود رضي الله عنه: \" مَن أراد علم الأولين والآخرين فليثوّر القرآن \" أي: فإنه مشتمل على فعل الله، وصفاته، وكشف أسرار ذاته، لمَن تأمّله حق تأمله\n\n\nالسادس: التخلي عن موانع الفهم، ومعظمها أربعة: أولها: صرف الهمة إلى إخراج الحروف من مخارجها، وهذا تولى حفظه شيطان وُكل بالقراء\n وكذلك الاشتغال بضبط رواياته، فأنى تنكشف لهذا أسرار المعاني\n ثانيها: أن يكون مقيَّداً بمذهب، أخذه بالتقليد، وجمد عليه، فهذا شخص قيَّده معتقدُه، فلا يمكن أن يخْطر بباله غير معتقده، فلا يتبحَّر في معاني القرآن لأنه مقيّد بما جمد عليه\n ثالثها: أن يكون مصرًّا على ذنب، أو متصفاً بكبر، أو: مبتلى بهوى في الدنيا، وبهذا ابتلى كثير من الناس، وإليه الإشارة بقوله تعالى:\n\n[الأعراف: 146] أي: عن فهم آياتي\n رابعها: أن يكون قد قرأ تفسيراً ظاهراً، واعتقد أنه لا معنى لكلمات القرآن إلا ما يتناوله النقل عن ابن عباس وغيره، وأمَّا ما وراء ذلك تفسير بالرأي، فهذا أيضاً من أعظم الحُجب فإن القرآن العظيم له ظاهر وباطن، وحدّ ومُطلع، فالفهم فيه لا ينقطع إلى الأبد، فهو بحر مبذول، يغرف منه كل واحد على قدر وسعه، إلى يوم القيامة\n السابع: التخصيص، وهو أن يعتقد أن المقصود بكل خطاب في القرآن، فإن سمع أمراً أو نهياً، قدر أنه المأمور والمنهي، وكذلك إن سمع وعداً ووعيداً، وإن سمع قصص الأولين عَلِمَ أن المقصود به الاعتبار، ليأخذ من تضاعيفه ما يحتاج إليه، ويتقوّى إيمانه، قال تعالى:\n\n[هود: 120] فالقرآن لم ينزل خاصّاً برسول الله صلى الله عليه وسلم، بل هو شفاء ورحمة ونور للعالمين، فيثبت فؤاد كل مَن يسمعه\n الثامن: التأثير، وهو أن يتأثر قلبه بآثار مختلفة، بحسب اختلاف الآيات، فيكون له بحسب كل فهم حال ووجد، يتصف به قلبه من الخوف، والرجاء، والقبض، والبسط، وغير ذلك\n التاسع: الترقي وهو أن يترقى إلى أن يسمع الكلام من الله سبحانه، لا من نفسه، ولا من غيره\n فدرجات القرآن ثلاث: أدناها: أن يُقدر العبد كأنه يقرأ على الله تعالى، واقفاً بين يديه، فيكون حاله السؤال والتملُّق\n ثانيها: أن يشهد بقلبه كأن الله تعالى يُخاطبه بألفاظه، ويُناجيه بإنعامه وإحسانه، فمقامه الحياء والتعظيم\n الثالثة: أن يرى في الكلام المتكلِّم، فلا ينظر إلى نفسه، ولا إلى قراءته، بل يكون مقصور الهم على المتكلم، مستغرقاً في شهوده، وهذه درجة المقرَّبين، وما قبلها درجة أصحاب اليمين، وما خرج عن هذا فهو درجة الغافلين\n وعن الدرجة العليا أخبر جعفر الصادق رضي الله عنه بقوله: والله لقد تجلّى الله لخلقه في كلامه ولكن لا يُبصرون\n هـ\n وقال بعض الحكماء: كنتُ أقرأ القرآن ولا أجد حلاوة، حتى تلوته كأنه أسمعه من رسول الله صلى الله عليه وسلم يتلوه على أصحابه، ثم رُفعت إلى مقام، كأني أسمعه من جبريل، يلقيه على رسول الله صلى الله عليه وسلم، ثم جاء الله بمنزلة أخرى، فأنا الآن أسمعه من المتكلِّم به، فعندها وجدت له لذة ونعيماً لا أصبر عنه\n العاشر: التبري، وهو أن يتبرأ من حوله، وقوته، والالتفات إلى نفسه بعين الرضا\n انظر بقية كلامه فقد اختصرناه غاية\n ثم ذكر سليمان عليه السلام، فقال: { وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.6833638534726227
    },
    {
      "verse": "2:269",
      "similarity": 0.6149257839144311
    },
    {
      "verse": "65:10",
      "similarity": 0.6001660130798199
    },
    {
      "verse": "39:18",
      "similarity": 0.5966975390262281
    },
    {
      "verse": "13:19",
      "similarity": 0.5949375753766535
    }
  ]
}