{
  "chapter": "ص",
  "text": "ان هذا اخى له تسع وتسعون نعجة ولى نعجة وحدة فقال اكفلنيها وعزنى فى الخطاب",
  "translations": [
    {
      "translation": "This brother of mine has ninety-nine ewes and I have only one. He said, \"Let me have charge of it,\" and got the better of me with his words.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This man here is my brother. He has ninety and nine ewes while I have only one. He demands that I should give him my ewe, and wants to get the better of me in argument.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, this is my brother; he has ninety-nine ewes and I have only one ewe.” And yet he said: “Give her into my charge,” and he got the better of me in argument.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said, \"This is my brother who has ninety-nine ewes when I have only one. He has demanded me to place that one in his custody; he had the stronger argument\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is my brother; he has ninety nine ewes and I have one ewe; and he now says ‘Give that one also to me’ – and he is very demanding in speech.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this my brother (in religion) has ninety-nine ewes, while I have (only) one ewe, and he says: \"Hand it over to me, and he overpowered me in speech.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this is my brother; he has ninety-nine ewes and I have a single ewe; but he said: Make it over to me, and he has prevailed against me in discourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, this my brother has ninety-nine ewes, and I have one ewe. So he said, \"Give her into my charge\"; and he overcame me in the argument.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! this my brother hath ninety and nine ewes while I had one ewe; and he said: Entrust it to me, and he conquered me in speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This brother of mine has ninety-nine ewes and I have only one. He said, \"Let me have charge of it,\" and got the better of me with his words.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this my brother hath nine and ninety ewes while I have one ewe; and he saith: entrust it to me, and he hath prevailed upon me in speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘This brother of mine has ninety-nine ewes, while I have only a single ewe, and [yet] he says, ‘Commit it to my care,’ and he browbeats me in speech.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This man is my brother: He has nine and ninety ewes, and I have (but) one: Yet he says, 'commit her to my care,' and is (moreover) harsh to me in speech.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this my brother (in religion) has ninety nine ewes, while I have (only) one ewe, and he says: \"Hand it over to me, and he overpowered me in speech.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This, my brother has ninetynine ewes, but I have only one ewe (a female sheep). He said: \"Give her into my keeping\" and overcame me in the argument'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This brother of mine has ninety nine ewes, and I have one ewe, and he said, ‘Entrust it to me,’ and he pressured me with words.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, 'Entrust her to me,' and he overpowered me in speech.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:23] ‘Behold, this brother of mine, in other words, my fellow co-religionist, has ninety-nine ewes — here used to represent the women — while I have a single ewe; yet he said, “Entrust it to me”, in other words, make me in charge of it, and he overcame me in speech’, in other words, in the argument; so the latter conceded charge of it to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ هَذَا أَخِي لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِيَ نَعْجَةٌ وَاحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِي فِي الْخِطَابِ (23)وقد قال علماؤنا في قول الخصم للقاضي : ( اتق الله في أمري ) إنه لا يعد جفاء للقاضي ولا يجوز للقاضي أن يعاقبه عليه كما يعاقب من أساء إليه . وأفتى مالك بسجن فتى ، فقال أبوه لمالك : اتق الله يا مالك ، فوالله ما خُلقت النار باطلاً ، فقال مالك : من الباطل ما فعله ابنك . فهذا فيه زيادة بالتعريض بقوله فوالله ما خلقت النار باطلاً . وقولهما : { واهدنا إلى سواء الصراطِ } يصرف عن إرادة الجفاء من قولهما : { ولا تُشْطِط } لأنهما عرفا أنه لا يقول إلا حقاً وأنهما تطلبا منه الهُدى .والهدى : هنا مستعار للبيان وإيضاح الصواب . و { سواء الصراط } : مستعار للحق الذي لا يشوبه باطل لأن الصراط الطريق الواسع ، والسواء منه هو الذي لا التواء فيه ولا شُعب تتشعب منه فهو أسرع إيصالاً إلى المقصود باستوائه وأبعد عن الالتباس بسلامته من التشعب .ومجموع { اهدنا إلى سواء الصراط } تمثيل لحال الحاكم بالعدل بحال المرشد الدال على الطريق الموصلة فهو من التمثيل القابِل تجزئة التشبيه في أجزائه ، ويؤخذ من هنا أن حكم القاضي العدل يُحمل على الجري على الحق وأن الحكم يجب أن يكون بالحق شرعاً لأنه هدي فهو والفتيا سواء في أنهما هدي إلا أن الحكم فيه إلزام .ومعنى { أكفِلْنِيها } اجعلها في كفالتي ، أي حفظي وهو كناية عن الإِعطاء والهبة ، أي هَبْهَا لي .وجملة { إنَّ هذا أخِي } إلى آخرها بيان لجملة { خصمان بغى بعضنا على بعضٍ } وظاهر الأخ أنهما أرادا أخوّة النسب . وقد فرضا أنفسهما أخوين وفرضا الخصومة في معاملات القرابة وعلاقة النسب واستبقاء الصلات ، ثم يجوز أن يكون { أخِي } بدلاً من اسم الإِشارة . ويجوز أن يكون خبر { إنَّ } وهو أولى لأن فيه زيادة استفظاع اعتدائه عليه .و { عَزّني } غلبني في مخاطبته ، أي أظهر في الكلام عزّة عليّ وتطاولاً . فجَعل الخطاب ظرفاً للعزّة مجازاً لأن الخطاب دل على العزة والغلبة فوقع تنزيل المدلول منزلة المظروف وهو كثير في الاستعمال .والمعنى : أنه سأله أن يعطيه نعجته ، ولمّا رأى منه تمنّعاً اشتدّ عليه بالكلام وهدّده ، فأظهر الخصم المتشكي أنه يحافظ على أواصر القرابة فشكاه إلى الملك ليصدّه عن معاملة أخيه معاملة الجفاء والتطاول ليأخذ نعجته عن غير طيب نفس . وبهذا يتبين أن موضع هذا التحاكم طلب الإِنصاف في معاملة القرابة لئلا يفضي الخلافُ بينهم إلى التواثب فتنقطع أواصر المبرة والرحمة بينهم .وقد عَلم داود من تساوقهما للخصومة ومن سكوت أحد الخصمين أنهما متقاربان على ما وصفه الحاكي منهما ، أو كان المدعَى عليه قد اعترف . فحكم داود بأن سؤال الأخ أخاه نعجته ظلم لأن السائل في غنى عنها والمسؤول ليس له غيرها فرغبة السائل فيما بيد أخيه من فرط الحرص على المال واجتلاب النفع للنفس بدون اكتراث بنفع الآخر . وهذا ليس من شأن التحابّ بين الأخوين والإِنصاف منهما فهو ظلم وما كان من الحق أن يسأله ذلك أعطاه أو منعه ، ولأنه تطاول عليه في الخطاب ولامه على عدم سماح نفسه بالنعجة ، وهذا ظلم أيضاً .والإِضافة في قوله : { بسؤال نعجتِكَ } للتعريف ، أي هذا السؤال الخاص المتعلق بنعجة معروفة ، أي هذا السؤال بحذافره مشتمل على ظلم ، وإضافة سؤال من إضافة المصدر إلى مفعوله . وتعليق { إلى نعاجه } ب«سؤال» تعليق على وجه تضمين «سؤال» معنى الضم ، كأنه قيل : بطلب ضم نعجتك إلى نعاجه .فهذا جواب قولهما : { فاحكم بيننا بالحق ولا تُشطط } ثم أعقبه بجواب قولهما : { واهدنا إلى سواءِ الصراط } إذ قال : { وإنَّ كثيراً من الخُلطاءِ ليبغي بعضهم على بعضضٍ إلاَّ الذين ءَامنوا وعَمِلوا الصَّالحاتِ } المفيد أن بَغْي أحد المتعاشرين على عشيره متفشَ بين الناس غير الصالحين من المؤمنين ، وهو كناية عن أمرهما بأن يكونا من المؤمنين الصالحين وأن ما فعله أحدهما ليس من شأن الصالحين .وذِكر غالب أحوال الخلطاء أراد به الموعظة لهما بعد القضاء بينهما على عادة أهل الخير من انتهاز فرص الهداية فأراد داود عليه السلام أن يرغبهما في إيثار عادة الخلطاء الصالحين وأن يكرّه إليهما الظلم والاعتداء . ويستفاد من المقام أنه يَأسف لحالهما ، وأنه أراد تسلية المظلوم عما جرى عليه من خليطه ، وأن له أسوة في أكثر الخلطاء .وفي تذييل كلامه بقوله : { وقليلٌ ما هُم } حثّ لهما أن يكونا من الصالحين لما هو متقرر في النفوس من نفاسة كل شيء قليل ، قال تعالى : { قل لا يستوي الخبيث والطيب ولو أعجبك كثرةُ الخبيث } \\[ المائدة : 100 \\] . والسبب في ذلك من جانب الحكمة أن الدواعي إلى لذات الدنيا كثيرة والمشي مع الهوى محبوب ومجاهدة النفس عزيزة الوقوع ، فالإِنسان محفوف بجواذب السيئات ، وأمّا دواعي الحق والكمال فهو الدين والحكمة ، وفي أسباب الكمال إعراض عن محركات الشهوات ، وهو إعراض عسير لا يسلكه إلا من سما بدينه وهمته إلى الشرف النفساني وأعرض عن الداعي الشهواني ، فذلك هو العلة في هذا الحكم بالقلة .وزيادة { ما } بَعد { قليل } لقصد الإِبهام كما تقدم آنفاً في قوله : { جند ما هنالك } \\[ ص : 11 \\] ، وفي هذا الإِبهام إيذان بالتعجب من ذلك بمعونة السياق والمقام كما أفادت زيادتها في قول امرىء القيس: ... وحديث الركب يوم هُناوحديث مَّا على قِصره ... معنى التلهف والتشوق .وقد اختلف المفسرون في ماهية هاذين الخصمين ، فقال السديّ والحسن ووهب بن مُنبّه : كانا ملَكَيْن أرسلهما الله في صورة رجلين لداود عليه السلام لإِبلاغ هذا المثل إليه عتاباً له . ورواه الطبري عن أنس مرفوعاً . وقيل كانا أخوين شقيقين من بني إسرائيل ، أي ألهمهما الله إيقاع هذا الوعظ .واعلم أن سوق هذا النبأ عقب التنويه بداود عليه السلام ليس إلا تتميماً للتنويه به لدفع مَا قد يُتوهم أنه ينقض ما ذكر من فضائله مما جاء في كتاب «صمويل الثاني» من كتب اليهود في ذكر هذه القصة من أغلاط باطلة تنافي مقام النبوءة فأريد بيان المقدار الصادق منها وتذييله بأن ما صدر عن داود عليه السلام يستوجب العتاب ولا يقتضي العقاب ولذلك ختمت بقوله تعالى : { وإن له عندنا لزُلفى وحُسن مئابٍ } \\[ ص : 40 \\] . وبهذا تعلم أن ليس لهذا النبأ تعلق بالمقصد الذي سيق لأجله ذكر داود ومن عطف عليه من الأنبياء .وهذا النبأ الذي تضمنته الآية يُشير به إلى قصة تزوج داود عليه السلام زوجة ( أُوريا الحثّي ) من رجال جيشه وكان داود رآها فمال إليها ورام تزوجها فسأله أن يتنازل له عنها وكان في شريعتهم مباحاً أن الرجل يتنازل عن زوجه إلى غيره لصداقة بينهما فيطلقها ويتزوجها الآخر بعد مضيّ عدتها وتحقق براءة رحمها كما كان ذلك في صدر الإِسلام . وخرج أُوريا في غزو مدينة ( رَبة ) للعمونيّين وقيل في غزو عَمَّان قصبة البلقاء من فلسطين فقُتل في الحرب وكان اسم المرأة ( بثشبع بنت اليعام وهي أم سليمان ) . وحكى القرآن القصة اكتفاء بأن نبأ الخصمين يشعر بها لأن العبرة بما أعقبه نبأ الخصمين في نفس داود فعتب الله على داود أن استعمل لنفسه هذا المباح فعاتبه بهذا المثل المشخص ، أرسل إليه ملكين نزلا من أعلى سور المحراب في صورة خصمين وقصّا عليه القصة وطلبا حكمه وهديه فحكم بينهما وهداهما بما تقدم تفسيره لتكون تلك الصورة عظة له ويشعر أنه كان الأليق بمقامه أن لا يتناول هذا الزواج وإن كان مباحاً لما فيه من إيثار نفسه بما هو لغيره ولو بوجه مباح لأن الشعور بحسن الفعل أو قبحه قد لا يحصل عليه حين يفعله فإذا رأى أو سمع أن واحداً عمله شعر بوصفه .ووقع في سفر «صمويل الثاني» من كتب اليهود سوق هذه القصة على الخلاف هذا .وليس في قول الخصمين : { هذا أخِي } ولا في فرضهما الخصومة التي هي غير واقعة ارتكابُ الكذب لأن هذا من الأخبار المخالفة للواقع التي لا يريد المخبِر بها أن يظن المخبَر ( بالفتح ) وقوعَها إلاّ ريثما يحصل الغرض من العبرة بها ثم ينكشف له باطنها فيعلم أنها لم تقع . وما يجري في خلالها من الأوصاف والنسب غير الواقعة فإنما هو على سبيل الفرض والتقدير وعلى نية المشابهة .وفي هذا دليل شرعي على جواز وضع القِصص التمثيلية التي يقصد منها التربية والموعظة ولا يتحمل واضعها جرحة الكذب خلافاً للذين نبزوا الحريري بالكَذب في وضع «المقامات» كما أشار هو إليه في ديباجتها . وفيها دليل شرعي لجواز تمثيل تلك القصص بالأجسام والذوات إذا لم تخالف الشريعة ، ومنه تمثيل الروايات والقصص في ديار التمثيل ، فإن ما يجري في شرع من قبلنا يصلح دليلاً لنا في شرعنا إذا حكاه القرآن أو سنة النبي صلى الله عليه وسلم ولم يرد في شرعنا ما ينسخه .وأخذ من الآية مشروعية القضاء في المسجد ، قالوا : وليس في القرآن ما يدل على ذلك سوى هذه الآية بناء على أن شرع من قبلنا شرع لنا إذا حكاه الكتاب أو السنة . وقد حكيت هذه القصة في سفر «صمويل الثاني» في الإِصحاح الحادي عشر على خلاف ما في القرآن وعلى خلاف ما تقتضيه العصمة لنبوءة داود عليه السلام فاحذروه .والذي في القرآن هو الحق ، والمنتظم مع المعتاد وهو المهيمن عليه ، ولو حكي ذلك بخبر آحاد في المسلمين لوجب ردُّه والجزم بوضعه لمعارضته المقطوع به من عصمة الأنبياء من الكبائر عند جميع أهل السنة ومن الصغائر عند المحققين منهم وهو المختار .\n\n",
      "translations": [
        {
          "translation": "(Lo! this my brother hath ninety and nine ewes) meaning 99 wives (while I had one ewe) i.e. one wife; (and he said: Entrust it to me, and he conquered me in speech) this is a similitude which they struck for David in order for him to understand what he did to Uriah. 522\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَزَّنِي فِي ٱلْخِطَابِ } معناه غَلبني\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Exalt me in [your] speech,\" means \"overcome me.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { فَقَالَ } لي عدواناً وظلماً: { أَكْفِلْنِيهَا } أي: اجعلني كافلاً لها\n مالكاً إياها\n حتى صارت نعاجي مائة\n ولم تبقَ لك نعجة { وَ } لم يقتصر على مجرد القول\n بل { عَزَّنِي } وغلب عليّ { فِي } مضمون { ٱلْخِطَابِ } [ص: 23] المذكور بحجج لا أقدر على دفع\n ولا أسمع المقاومة معه\n\n\nوبعدما سمع كلام المدعي وتأمل في تقريره\n قال للمدعى عليه: هل تصدقه فيما ادعاه عليك؟ قال: بلى\n\n\nثم التفت عليه السلام نحو المدعي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { له تِسعٌ وتسعونَ نَعْجَةً } النعجة: الأنثى من الضأن\n وقد يُكنى بها عن المرأة\n والكناية والتعريض أبلغ من التصريح\n { وَلِيَ نَعْجةٌ واحدة } لا أملك غيرها\n { فَقال اكْفِلنيهَا } أي: ملِّكنيها\n واجعلني أكفلها كما أكفل ما تحت يدي\n { وعَزَّني } غلبني { في الخطاب } في الخصومة\n أي: كان أقدر مني على الاحتجاج والمجادلة\n أو: غلبني في الخِطبة\n حيث خطبتُ وخطبَ\n فأخذها\n وهذا منهما تعريض وتمثيل\n كأنهما قالا: نحن كخصمين هذه حالهما\n فمثّلت قصة أورِيا مع داود بقصة رجل له نعجة واحدة\n وخليطه له تسع وتسعون\n فأراد صاحبه تتمة المائة\n فطمع في نعجة خليطه\n وحاجّه في أخذها\n محاججة حريص على بلوغ مراده\n وإنما كان ذلك على وجه التحاكم إليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:24",
      "similarity": 0.5079319763505119
    },
    {
      "verse": "74:30",
      "similarity": 0.3034609014018775
    },
    {
      "verse": "17:101",
      "similarity": 0.2871582219980273
    },
    {
      "verse": "27:48",
      "similarity": 0.2296769822891813
    },
    {
      "verse": "18:25",
      "similarity": 0.22211702086921734
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}