{
  "chapter": "ص",
  "text": "فغفرنا له ذلك وان له عندنا لزلفى وحسن مـاب",
  "translations": [
    {
      "translation": "So We forgave him for that and he has nearness to Us and a good Homecoming.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him. He has surely a high rank with Us and an excellent place of return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon We forgave him his shortcoming and indeed (an exalted position of) nearness awaits him, and an excellent resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We forgave him for this. In Our eyes he certainly has a good position and the best share (of the world to come).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore forgave him this; and indeed for him in Our presence are, surely, proximity and an excellent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We forgave him that, and verily, for him is a near access to Us, and a good place of return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore We rectified for him this, and most surely he had a nearness to Us and an excellent resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accordingly We forgave him that, and he has a near place in Our presence and a fair resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him that; and lo! he had access to Our presence and a happy journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We forgave him his sins. His reward will be nearness to Us, a good place to return to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him that; and verily for him is an approach with us, and a happy retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him that, and indeed he has [a station of] nearness with Us and a good destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him this (lapse): he enjoyed, indeed, a Near Approach to Us, and a beautiful place of (Final) Return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him that, and verily, for him is a near access to Us, and a good place of (final) return (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We forgave him that, and he has a near place with Us and a fine return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him that. And for him is nearness to Us, and a good place of return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We forgave him that; and indeed, for him is nearness to Us and a good place of return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:25] So We forgave him that and indeed he has [a station of] nearness with Us, that is, [even] more good [things] in this world, and a fair return, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So We forgave him that) sin; (and lo! he had access to Our presence) he is close in rank (and a happy journey's end) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ } معناه قُربى ومَنزلةٌ\n واحدُها زُلفةٌ { وَحُسْنَ مَـآبٍ } معناه حُسنُ مَرجعٍ\n\n",
      "translations": [
        {
          "translation": " And His saying, {Indeed, with Us is its transcriber} [means that] He is close and His abode is exalted.\n\n\nOne of them is zulfah {wa-husnun ma'abin}, which means \"a beautiful reference point\".",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَغَفَرْنَا لَهُ ذَلِكَ } الذنب بعدما أخلص في الإنابة والرجوع إلينا، بل جميع ذنوبه التي صدرت عنه { وَ } كيف لا نغفر { إِنَّ لَهُ } أي: لداوود عليه السلام { عِندَنَا } وفي ساحة قربتنا وعزتنا { لَزُلْفَىٰ } لقربة ومنزلة رفيعة { وَحُسْنَ مَـآبٍ } [ص: 25] أي: خير مرجع ومنقلب من مقامات القرب ودرجات الوصول\n\n\n\n\nوأسر في ابتلاء الله إياه أنه لما رأى في كتب التواريخ أوصاف أسلافه إبراهيم وإسحاق ويعقوب، أضمر في نفسه أن يؤتى له مثل ما أتى إياهم من الخير الحسنى، فأوحى إليه أنهم قد ابتلوا فصبروا، فأعطي لهم ما أعطي فقال داود عليه السلام: يا رب لو ابتليت لصبرت أيضاً مثلهم، فأوحى أنك تُبتلى في شهر كذا في يوم كذا فاستحفظ الأوقات\n\n\n\n\nفلما جاء الموعد دخل محرابه وأغلق الباب على نفسه، فجاءه الشيطان في صورة حمامة من ذهب في غاية الحسن والبهاء ووقعت بين رجليه، فأراد أخذها؛ ليُري بني إسرائيل عجائب صنع الله وبدائع قدرته، فطارت وجلست في كوة هناك فأراد أخذها فذهبت فنظر من الكوة فإذا هو بامرأة حسناء من أجمل النساء تغتسل فتعجب منها، فالتفت وأبصرت ظله فنفضت شعرها، فغطى جميع بدنها، فازداد داوود عجباً فوق العجب\n\n\n\n\nوبالجملة: قد ابتلي عليه السلام بمحبة تلك المرأة، وكان عمره حينئذ سعبين سنة، فسأل عنها، فقيل: هي امرأة أوريا بن حنان، فأوجس في نفسه قتله ليتزوج امرأته، وكان أوريا حينئذ مع ابن أخت داود في جيش، فأرسل إلى ابن أخته أن يقدم أوريا قدام التابوت، وكان من عادته من يقدمه قدام التابوت لا يحل له الرجوع حتى يُفتح أو يُقتل، فقدمه ففتح، فأمره أن يقدمه إلى أخرى، فقدمه ففتح أيضاً، ثم أمر أن يقدمه ثالثاً، فقدمه إلى جيش عظيم فقتل\n\n\n\n\nوبعدما انقضت عدة امرأته تزوجها داود عليه السلام، وهي أم سليمان عليه السلام، فعاتبه سبحانه بما عاتبه، فاستغفر ربه وخرَّ راكعاً وأناب، والعهدة على الراوي، وأنكر بعضهم هذه القصة؛ لأن الأنبياء معصومون عن أمثاله\n\n\n\n\nوعن علي بن أبي طالب - كرم الله وجهه -: من تحدث بحديث داوود عليه السلام على ما يرويه القصاص جلدته مائة وستين جلدة، وهي حد الفرية على الأنبياء، والعلم عند الله\n\n\n\n\nثم لما عاتب سبحانه داود عليه السلام بما عاتب، وقبل توبته بعدما اتسغفر وأناب، أراد سبحانه من كمال خلوصه في توبته رجوعه نحو الحق عن صميم طويته أن يشرفه بخلعة الخلافة، فقال منادياً له، إظهاراً لكمال اللطف والكرم معه: { يٰدَاوُودُ } المتأثر عن عتبنا، التائب إلينا، المنيب نحونا عن محض الندم والإخلاص { إِنَّا } بعدما طهرناك عن لوث بشريتك، وغفرنا لك ما طرأ عليه من لوازم هويتك ولواحق ناسوتك { جَعَلْنَاكَ خَلِيفَةً فِي ٱلأَرْضِ } التي هي محل الكون والفساد، وأنواع الفتن والعناد، فلك أن تستخلف عليها نيابة عنَّا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فغفرنا له ذلك } أي: ما استغفر منه\n قال القشيري: ولمّا أوحى الله بالمغفرة، قال: يا رب كيف بحديث الخصم؟ ـ أي: الرجل الذي ظلمته ـ فقال: قد استوهبتك منه\n هـ\n وفي رواية: إني أعطيه يوم القيامة ما لم ترَ عيناه، فأستوهِبك منه فيهبك لي، قال: يا رب الآن قد عرفتُ أنك غفرت لي\n هـ\n قال تعالى: { وإِن له عندنا لزُلْفَى } لقُربى وكرامة بعد المغفرة، { وحُسْنَ مَآبٍ } مرجع في الجنة\n الإشارة: إنما عُوتب داود عليه السلام لأنه التفت إلى الجمال الحسي الفرقي، دون الجمال المعنوي الجمعي، ولو سبته المعاني بجمالها ما التفت إلى الجمال الفرقي، فلما نبّهه الحق تعالى استغفر ورجع إلى الجمال المعنوي، الذي هو جمال الحضرة القدسية، وعبارة شيخ شيوخنا سيدي عبد الرحمن الفاسي رضي الله عنه: عدَّ عليه التفاته عن الجمال المطلق عن الأشكال والصُور إلى المقيد بهما، وهي مقام تفرقة، لا مقام جمع، فاستغفر ورجع إلى شهود الفاعل جمعاً، عن شهود فعله فرقاً، فخلع عليه خلعة الخلافة والله أعلم\n\n\nهـ\n قال القشيري: قال داود عليه السلام: يا رب إني أجد في التوراة أنك أعطيت الأنبياء الرتب العالية، فأعطينها؟ فقال: إنهم صبروا لمّا ابتليتهم، فوعد من نفسه الصبر إذا ابتلاه، طمعاً في مثل تلك الرتب، فأخبر أنه يبتليه يوم كذا، فلما جاء ذلك اليوم دخل خلوته، وأغلق أبوابه، ولم يُمكنه غلق باب السماء\n وقد قال الحكماء: الهارب مما هو كائن في كف الطالب يتقلّب\n ثم إنه كان في البيت كوة، يدخل منها النور، فدخل منها طير صغير، كأنه من ذهب، وكان لداود ولد صغير، فهمَّ أن يقبضه لابنه، فما زال يحاول ويتبعه حتى وقع بصره على المرأة، فامتحن بها، فلم يدع به الاهتمام بولده حتى فعل ما فعل، وفي ذلك لأولي الأبصار عبرة\n هـ\n وقال عند قوله: { فغفرنا له ذلك }: التجأ داود عليه السلام في أوائل البلاء إلى التوبة، والبكاء، والتضرُّع، والاستكانة، فوجد المغفرةَ والتجاوز\n وهكذا مَن رَجع في أوائل الشدائد إلى الله، فالله يكفيه ويتوب عليه، وكذلك مَن صَبَرَ إلى حينِ طالت عليه المحنة\n ويقال: إن زلة قدّرها عليك، توصلك إليه بندمك، أحرى بك من طاعة، إعجابك بها يُقصيك عن ربك\n هـ\n وفي الحِكَم: \" معصية أورثت ذُلاًّ وافتقاراً، خير من طاعة أورثت عزًّا واستكباراً \" وقال الشيخ أبو العباس المرسي رضي الله عنه: كل سوء أدب يُثمر لك حُسن أدب فهو أدب\n هـ\n ولمَّا تحققتْ إنابته، جعله اللهُ خليفةً، كما قال: { يٰدَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي ٱلأَرْضِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:40",
      "similarity": 0.9814678009100851
    },
    {
      "verse": "26:64",
      "similarity": 0.7027679101868839
    },
    {
      "verse": "81:13",
      "similarity": 0.7025567250956434
    },
    {
      "verse": "26:90",
      "similarity": 0.6997820819662192
    },
    {
      "verse": "50:31",
      "similarity": 0.6732378653357942
    }
  ]
}