{
  "chapter": "ص",
  "text": "ووهبنا لداود سليمن نعم العبد انه اواب",
  "translations": [
    {
      "translation": "We bestowed Solomon on David who was an excellent devotee, for he turned to God in penitence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed upon David (an illustrious son), Solomon. How excellent a servant (of Ours he was)! Indeed he constantly turned to Us in devotion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted Solomon to David, a blessed servant of Ours and certainly the most repentant person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed Sulaiman to Dawud; what an excellent bondman! He is indeed most inclined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Dawud We gave Sulayman. How excellent a servant! Verily, he was ever turning in repentance (to Us)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave to Dawood Sulaiman, most excellent the servant! Surely he was frequent in returning (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave unto David Solomon; how excellent a servant he was! He was a penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on David, Solomon. How excellent a slave! Lo! he was ever turning in repentance (toward Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave David Solomon. He was an excellent servant who always turned to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We vouchsafed Unto Da-ud Sulaiman. How excellent a bondman! j Verily he was oft-returning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to David We gave Solomon—what an excellent servant he was! Indeed, he was a penitent [soul].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To David We gave Solomon (for a son),- How excellent in Our service! Ever did he turn (to Us)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Dawud (David) We gave Sulaiman (Solomon). How excellent (a) slave! Verily, he was ever oft-returning in repentance (to Us)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Solomon to David; and he was an excellent worshiper, he was penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted David, Solomon, an excellent servant. He was penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:30] And We bestowed on David, Solomon, his son — what an excellent servant!, that is, Solomon. Truly he was a penitent [soul], always returning [to God] with glorification and remembrance at all times.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We bestowed on David, Solomon. How excellent a slave! Lo! he was ever turning in repentance (towards Allah)) he is ever betaking himself to Allah and engaged in His obedience.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ثم ذكر تلوين سليمان وابتلاءه تأكيداً لتثبيته، وتقوية له في استقامته وتمكينه { نِعْم العبد } لصلاحية استعداده للكمال النوعي الإنساني وهو مقام النبوّة { إنه أوّاب } رجّاع إليّ بالتجريد\n { إذ عرض عليه بالعشيّ } وقت قرب غروب شمس الروح في الأفق الجسماني بميل القلب إلى النفس وظهور ظلمتها بالميل إلى المال واستيلاء محبة الجسمانيات واستحسانها، كما قال الله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما كرمناه بتشريف خلعة الخلافة { وَهَبْنَا لِدَاوُودَ } ولداً خلفاً عنه، وارثاً لملكه وخلافته، محيياً اسمه ومراسم دينه ومعالم ملته؛ يعني: { سُلَيْمَانَ نِعْمَ ٱلْعَبْدُ } سليمان؛ لأنه مقبول عندنا، مقرب من حضرتنا، مكرم لدينا، وكيف يكون كذلك { إِنَّهُ أَوَّابٌ } [ص: 30] رجَّاع إلينا، ملتجئ نحونا في عموم الأوقات وشمول الحالات على وجه الخلوص والتفويض التام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ووهبنا لداودَ سليمانَ نِعْمَ العبدُ } أي: سليمان، فهو المخصوص، { إِنه أوابٌ } أي: رجَّاع إلى الله تعالى في السرّاء والضراء، وفي كل أموره، { إِذ عُرِضَ عليه } أي: واذكر ما صدر عنه حين عُرض عليه { بالعشِيّ } وهو ما بين الظهر إلى آخر النهار، { الصافناتُ الجياد } أي: الخيل الصافنات، وهي التي تقوم على طرف سنبك يدٍ أو رِجل\n وهي من الصفات المحمودة، لا تكاد توجد إلا في الخيل العِراب، الخُلَّص\n وقيل: هو الذي يجمع يديه ويستبق بهما، والجياد: جمع جواد، أو: جود، وهو الذي يسرع في جريه، أو: الذي يجود عند الركض، وقيل: وصفت بالصفون والجودة لبيان جمعها بين الوصفين المحمودين، واقفة وجارية، أي: إذا وقفت كانت ساكنة، وإذا جرت كانت سِراعاً خفافاً في جريها\n رُوي أنه عليه السلام غزا أهل دمشق ونصيبين، وأصاب ألف فرس، وقيل: أصابها أبوه من العمالقة، وورثها منه، وفيه نظر فإن الأنبياء لا يورثون، إلا أن يكون تركها حبساً، فورث النظر فيها\n ويكون عقرها بنية إبدالها\n وقيل: خرجت من البحر لها أجنحة، فقعد يوماً بعدما صلّى الظهر على كرسيه، فاستعرضها، فلم تزل تُعرض عليه حتى غربت الشمس، وغفل عن العصر، أو: عن الوِرد، كان له من الذكْر وقتئذ، وهو أليق بالعصمة، فاغتم لِما فاته، فاستردها، فعقرها، تقرُّباً إلى الله تعالى، وبقي مائة، فما في أيدي الناس اليوم مِن الجياد فمِن نسلها\n وقيل: لَمَّا عقرها أبدل الله تعالى له خيراً منها، وهي الريح تجري بأمره، { فقال إِني أحببتُ حُبَّ الخيرِ عن ذكر ربي } ، قاله عليه السلام عند غروب الشمس، اعترافاً بما صدر عنه من الاشتغال بها عن الصلاة أو الذكر، وغايته حينئذ: أن الأَوْلى استغراق الأوقات في ذكر الله من الاشتغال بالدنيا\n فترَكَ الأَوْلى، وتحسّر لذلك، وأمر بالقطع\n وأما حمله على الصلاة والاشتغال بها حتى يفوت الوقت، فذنب عظيم، تأباه العصمة\n قاله شيخ شيوخنا الفاسي\n وقد يُجاب بأنَّ تركه كان نسياناُ وذهولاً، لا عمداً، فلا معصية",
      "translations": []
    }
  ]
}