{
  "chapter": "ص",
  "text": "ردوها على فطفق مسحۢا بالسوق والاعناق",
  "translations": [
    {
      "translation": "Return them to me!' And he set about slashing through their shanks and necks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back to me,\" and he began to rub and stroke their shanks and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(he ordered): “Bring these horses back to me,” and then he began to gently stroke their shanks and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Bring them back to me.\" Then he started to rub their legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He then ordered, “Bring them back to me”; and he began caressing their shins and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said: \"Bring them back to me.\" Then he began to pass his hand over their legs and their necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back to me; so he began to slash (their) legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return them to me!' And he began to stroke their shanks and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then he said): Bring them back to me, and fell to slashing (with his sword their) legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back to me!\" -- [he said] and began to stroke their legs and their necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back Unto me; and he set about slashing their legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Bring it back for me!’ Then he [and others] began to wipe [their] legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back to me.\" then began he to pass his hand over (their) legs and their necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said \"Bring them (horses) back to me.\" Then he began to pass his hand over their legs and their necks (till the end of the display).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back to me' And he hacked their legs and necks (slaughtering them for Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring them back to me.” And he began caressing their legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He said], \"Return them to me,\" and set about striking [their] legs and necks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:33] Bring them back to me!, that is, the horses that were displayed; and they so brought them back. Then he set about slashing, with his sword, [their] legs (al-sūq is the plural of sāq) and necks, in other words, he slaughtered them and cut off their legs as an offering [of atonement] to God, exalted be He, for having been distracted by them from the prayer. He gave all the meat thereof as voluntary alms and so God compensated him what was better and faster that these [horses], and this was the wind, which blew at his command as he wished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Then he said): Bring them back to me) bring back whatever was shown to me, (and fell to slashing (with his sword their) legs and necks) it is also said that he began slashing their necks and legs until the sun disappeared and he missed the 'Asr prayer; this is why he did what he did.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَطَفِقَ مَسْحاً بِٱلسُّوقِ } معناه ما زَالَ يَضرِبُ أسواقَ الخَيلِ وأعناقَها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما وقع ما وقع من الغفلة، تسارع إلى التدارك والتلافي، فأخذ يقطع عرق الباعث إلى الإلهاء والإغفال، فقال للشرطة: { رُدُّوهَا } أي: الصافنات { عَلَيَّ } وكُرّوها إليّ، فأعدوها معرضين ثانياً { فَطَفِقَ } سليمان، وأخذ السيف الصارم بيده، يمسح ويمضي { مَسْحاً } وإمضاء ملاصقاً { بِٱلسُّوقِ } وهي جمع: ساق { وَٱلأَعْنَاقِ } [ص: 33] يعني: أخذ بقطع قوائمها ورءوسها، ليزول حبها عن قلبه، ويتصدق بها طلباً لمرضاة ربه، وجبراً لما انكسر من ورده\n\n\n\n\nوعن المرتضى المجتبى - كرم الله وجهه -: أن الضمير في { رُدُّوهَا } راجع إلى الشمس؛ يعني: أمر سليمان الموكلين على الشمس بإذن الله ووحيه أياه، أن يردوا الشمس بعدما غربت؛ ليأتي سليمان بورده، فأتى بما أتى، وذلك من كمال كرم الله معه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { رُدُّوها عليَّ } ، هو من مقالة سليمان، { فطَفِقَ مسْحاً } ، الفاء فصيحة، مفصحة عن جملة حُذفت، لدلالة الكلام عليها، إيذاناً بسرعة الامتثال، أي: فَردُّوها عليه، فأخذ بمسح السيف مسحاً { بالسُّوقِ والأعناقِ } أي: بسوقها وأعناقها يقطعها، من قولهم: مسح عنقه بالسيف، وقيل: جعل يمسح بيده أعناقها وسوقها، حبّاً لها، وإعجاباً بها، وهو يُنافي سياق الكلام\n\n\nالإشارة: لم يذكر الحق تعالى لسليمان ترجمة مخصوصة، كما ذكر لغيره بقوله: { واذكر عبدنا داود } ، { واذكر عبدنا أيوب } ، بل خرطه في سلك ترجمة أبيه، وجعله هبة له تنبيهاً على أن مقام أهل الجمال الدنيوي، لا يبلغ مقام أهل الجلال ففيه تنبيه على أن الفقير الصابر أعظم من الغني الشاكر\n قاله في القوت\n وقوله تعالى: { فَطَفِقَ مَسْحاً بالسُوق } ، فيه: أن مَن ترك شيئاً عوَّضه الله خيراً منه، فمَن كان في الله تلفه، كان على الله خلفه، وفيه حجة للصوفية على إتلاف كل ما شغل القلب عن الله، كما فعل الشبلي من تمزيق الثياب الرفهة\n والله تعالى أعلم\n ثم ذكر امتحانه فقال: { وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ }\n\n",
      "translations": []
    }
  ]
}