{
  "chapter": "ص",
  "text": "كم اهلكنا من قبلهم من قرن فنادوا۟ ولات حين مناص",
  "translations": [
    {
      "translation": "How many generations We have destroyed before them! And they cried out when it was too late to escape.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed before them who cried (for mercy) when it was too late for escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a nation did We destroy before them! (When they approached their doom) they cried out (for deliverance), but the time for deliverance was already past.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many ancient generations did We destroy? (On facing Our torment) they cried out for help, but it was too late for them to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many a generation We did destroy before them – thereupon they cried out whereas it is not the time to escape!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation have We destroyed before them! And they cried out when there was no longer time for escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many did We destroy before them of the generations, then they cried while the time of escaping had passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation We destroyed before them, and they called, but time was none to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation We destroyed before them, and they cried out when it was no longer the time for escape!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations We have destroyed before them! And they cried out when it was too late to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation have We destroyed afore them, and they cried when there was not time of fleeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation We have destroyed before them! They cried out [for help], but gone was the time for escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations before them did We destroy? In the end they cried (for mercy)- when there was no longer time for being saved!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation We have destroyed before them, and they cried out when there was no longer time for escape!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed before them. They called: 'The time is neither of escape, nor safety'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed before them? They cried out when it was too late to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:3]   How many — in other words, many — a generation, a community of past communities, We have destroyed before them, and they cried out, when the chastisement was sent down on them, when it was no longer the time for escape, that is to say, the time was not one for fleeing (the [suffixed] tā’ [of wa-lāta] is extra; the sentence is a circumstantial qualifier referring to the subject of [the verb] nādaw, ‘they cried out’) in other words, they called for help but the situation was such that there could be no escape or deliverance; but still the Meccan disbelievers have not taken heed from their example.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ فَنَادَوْا وَلَاتَ حِينَ مَنَاصٍ (3)استئناف بياني لأن العزة عن الحق والشقاقَ لله ولرسوله صلى الله عليه وسلم مما يثير في خاطر السامع أن يسأل عن جزاء ذلك فوقع هذا بياناً له ، وهذه الجملة معترضة بين جملة { بل الذين كفروا في عزَّةٍ وشقاق } \\[ ص : 2 \\] ، وبين جملة { وعجبوا أن جاءهم منذرٌ منهم } \\[ ص : 4 \\] .وكان هذا البيان إخبَاراً مُرفَقاً بحجة من قبيل قياس تمثيل ، لأن قوله : { مِن قبلهم } يؤذن بأنهم مثلهم في العزة والشقاق ومتضمناً تحذيراً من التريث عن إجابة دعوة الحق ، أي ينزل بهم العذاب فلا ينفعهم ندم ولا متاب كما لم ينفع القرون من قبلهم . فالتقدير : سيجازَوْن على عزتهم وشقاقهم بالهلاك كما جُوزِيَتْ أمم كثيرة من قبلهم في ذلك فليحذروا ذلك فإنهم إن حقت عليهم كلمة العذاب لم ينفعهم متاب كما لم ينفع الذين من قبلهم متاب عند رؤية العذاب .و { كم } اسم دال على عدد كثير . و { مِن قَرنٍ } تمييز لإِبهام العدد ، أي عدداً كثيراً من القرون ، وهي في موضع نصب بالمفعولية ل { أهْلَكنا } .والقرن : الأمة كما في قوله تعالى : { ثم أنشأنا من بعدهم قروناً آخرين } \\[ المؤمنون : 42 \\] . و { من قبلهم } يجوز أن يكون ظرفاً مستقراً جعل صفة ل { قَرْنٍ } مقدمة عليه فوقعت حالاً ، وإنما قدم للاهتمام بمضمونه ليفيد الاهتمامُ إيماء إلى أنهم أسوة لهم في العِزّة والشقاق وأن ذلك سبب إهلاكهم . ويجوز أن يكون متعلقاً ب { أهلكنا } على أنه ظرف لغو ، وقدم على مفعول فعله مع أن المفعول أولى بالسبق من بقية معمولات الفعل ليكون تقديمه اهتماماً به إيماء إلى الإِهلاك كما في الوجه الأول .وفرع على الإِهلاك أنهم نادوا فلم ينفعهم نداؤهم ، تحذيراً من أن يقع هؤلاء في مثل ما وقعت فيه القرون من قبلهم إذ أضاعوا الفرصة فنادوا بعد فواتها فلم يفدهم نداؤهم ولا دعاؤهم . والمراد بالنداء في { فنَادوا } نداؤهم الله تعالى تَضرعاً ، وهو الدعاء كما حكي عنهم في قوله تعالى : { ربنا اكشف عنا العذاب إنا مؤمنون } \\[ الدخان : 12 \\] . وقوله : { حتى إذا أخذنا مترفيهم بالعذاب إذا هم يجأرون } \\[ المؤمنون : 64 \\] .وجملة { ولاَتَ حينَ منَاصٍ } في موضع الحال ، والواو واو الحال ، أي نادوا في حال لا حين مناص لهم .و { لات } حرف نفي بمعنى ( لا ) المشبهة ب ( ليس ) و { لات } حرف مختص بنفي أسماء الأزمان وما يتضمن معنى الزمان من إشارة ونحوها . وهي مركبة من ( لا ) النافية وصُلت بها تاء زائدة لا تفيد تأنيثاً لأنها ليست هاء وإنما هي كزيادة التاء في قولهم : رُبَّت وثُمَّت . والنفي بها لغير الزمان ونحوه خطَأ في اللغة وقع فيه أبو الطيب إذ قال: ... لقد تَصبرت حتى لاتَ مصطبَروالآن أقحم حتى لات مقتحم ... وأغفل شارحو ديوانه كلُّهم وقد أدخل { لات على غير اسم زمان . وأيًّا مَّا كان فقد صارت ( لا ) بلزوم زيادة التاء في آخرها حرفاً مستقلاً خاصاً بنفي أسماء الزمان فخرجت عن نحو : رُبَّت وثَمَّتَ .وزعم أبو عبيد القاسم بن سلام أن التاء في ولاَتَ حينَ مناصٍ } متصلة ب { حِينَ } وأنه رآها في مصحف عثمان متصلة ب { حين } وزعم أن هذه التاء تدخل على : حين وأوان وآن يريد أن التاء لاحقة لأول الاسم الذي بعد ( لا ) ولكنه لم يفسر لدخولها معنى . وقد اعتذر الأيمة عن وقوع التاء متصلة ب { حين } في بعض نسخ المصحف الإِمام بأن رسم المصحف قد يخالف القياس ، على أن ذلك لا يوجد في غير المصحف الذي رآه أبو عبيد من المصاحف المعاصرة لذلك المصحف والمرسومة بعده . والمناص : النجاء والفوت ، وهو مصدر ميمي ، يقال : ناصه ، إذا فاته .والمعنى : فنادَوا مبتهلين في حال ليس وقت نجاء وفَوت ، أي قد حق عليهم الهلاك كما قال تعالى : { فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنة اللَّه التي قد خلت في عباده } \\[ غافر : 85 \\] .\n\n",
      "translations": [
        {
          "translation": "(How many a generation) past generation (We destroyed before them) before the Quraysh, (and they cried out when it was no longer the time for escape!) the angels cried out to them upon their destruction: this is no context for attacking or fleeing; stop! And they stopped until Allah destroyed all of them. This is because before this, upon fighting an enemy, they used to say: attack all together! (Manas! Manas!). Some would therefore survive and others die. But when they were defeated by the enemy they used to cry: flee! Flee! (Manasa! Manasa!), and so they used to flee all together from the battlefield. These were two different signs whenever they engaged in fighting either to attack or to flee from the enemy. When Allah wished to destroy them, the angels cried out to them: this is no context for attacking or fleeing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَّلاَتَ حِينَ مَنَاصٍ } معناه ليس بحينِ نَزوٍ ولا فِرارٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {and do not take a step forward when you are in doubt} [means] not [taking a step] when you are in [a state of] negligence or [trying to] escape.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n اذكر { كَمْ } أي: كثير { أَهْلَكْنَا } أمثالهم { مِن قَبْلِهِم مِّن } أهل { قَرْنٍ } مغمورين في الكبر والخيلاء\n متمكنين في الخلاف والشقاق أمثالهم { فَنَادَواْ } واستغاثوا متضرعين إلينا\n راجين منَّا عفونا إياهم حين أخذناهمم بظلمهم بغتة { وَّلاَتَ حِينَ مَنَاصٍ } [ص: 3] أي: ليس حينئذ وقت تأخير ونجاة لهم وخلاص\n فلم نجبهم لذلك\n لمضي وقت الاختبار والاعتبار\n بل أهلكناهم واستأصلناهم\n[النور: 44]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم هدّدهم بقوله: { كم أهلكنا من قبلهم } من قبل قومك { من قَرْنٍ } من أُمّة أو جيل\n { فَنَادَوا } أي: فدعوا واستغاثوا حين رأوا العذاب: { ولاتَ حين مَنَاصٍ } أي: وليس الوقت وقت خلاص ونجاة وفرار\n والمعنى: أنهم استغاثوا حين لم ينفعهم ذلك\n { ولات } هي \" لا \" المشبّهة بـ \" ليس \" \n زيدت عليها تاء التأنيث\n كما زيدت على \" ربّ \" \n و \" ثمّ \" للتوكيد\n وتغيّر بذلك حكمها\n حيث لم تدخل إلا على الأحيان\n ولم يبرز إلا أحد معموليها\n إما الاسم أو الخبر\n وامتنع بروزهما بنفي الأحيان\n وهذا مذهبُ الخليل وسيبويه\n وعند الأخفش أنها النافية للجنس\n زيدت عليها الهاء\n وخصّت بنفي الأحيان\n وقال أبو محمد مكي: الوقف عليها عند سيبويه\n والفراء وأبي إسحاق\n وابن كيسان\n بالتاء\n وعليه جماعة القراء\n وبه أتى خط المصحف\n وعند المبرد والكسائي بالهاء\n بمنزلة \" رب \"\n اهـ\n الإشارة: افتتح الحق جلّ جلاله هذه السورة\n التي ذكر فيها أكابر أصفيائه\n بحرف الصاد\n إشارة إلى مادة الصبر\n والصدق\n والصمدانية\n والصفاء إذ بهذه المقامات ارتفع مَن ارتفع\n وبالإخلال بها سقط مَن سقط\n فبالصبر على المجاهدات تتحقق الإمامة والقدوة\n وبالصدق في الطلب يقع الظفر بكل مطلب\n وبالصمدانية تقع الحرية من رقّ الأشياء\n وبالصفاء تحصل المشاهدة والمكالمة\n فكأن الحق تعالى أقسم بهذه الأشياء وبكتابه العزيز إن المتكبرين على أهل الخصوصية ما أنكروا إلا جُحوداً وعناداً\n وتعزُّزاً واستكباراً\n لا لخلل فيهم\n ثم أوعدهم بالهلاك\n كما أهلك مَن قبلهم\n فاستغاثوا حين لم ينفعهم الغياث\n ثم ذكر تعجبهم من كون المنذرِ منهم فقال: { وَعَجِبُوۤاْ أَن جَآءَهُم مٌّنذِرٌ مِّنْهُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:31",
      "similarity": 0.0854480327975102
    },
    {
      "verse": "32:26",
      "similarity": 0.08367874680378758
    },
    {
      "verse": "20:128",
      "similarity": 0.0828422568229281
    },
    {
      "verse": "17:17",
      "similarity": 0.07926151337479641
    },
    {
      "verse": "6:6",
      "similarity": 0.0722053009733778
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}