{
  "chapter": "ص",
  "text": "فسخرنا له الريح تجرى بامره رخاء حيث اصاب",
  "translations": [
    {
      "translation": "So We subjected the wind to him to blow at his command, softly, wherever he directed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So we subjugated the wind to his service which carried his merchandise wheresoever he wished;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We subjected the wind to him, so that it blew gently at his bidding, wherever he directed it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the wind subservient to him, to blow gently wherever he desired at his command\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore gave the wind under his control, moving steadily by his command wherever he wished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We subjected to him the wind; it blew gently by his order wherever he willed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the wind subservient to him; it made his command to run gently wherever he desired,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We subjected to him the wind, that ran at his commandment, softly, wherever he might light on,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made the wind subservient unto him, setting fair by his command whithersoever he intended.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We subjected the wind to his power, so that it blew gently, at his behest, wherever he willed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We subjected to him the wind: it ran gently by his command withersoever he directed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We disposed the wind for him, blowing softly wherever he intended by his command,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We subjected the wind to his power, to flow gently to his order, Whithersoever he willed,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We subjected to him the wind, it blew gently to his order whithersoever he willed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We subjected the wind to him, so that it ran softly by his command wherever he wished;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We placed the wind at his service, blowing gently by his command, wherever he directed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We subjected to him the wind blowing by his command, gently, wherever he directed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:36] So We disposed for him the wind, which blew softly, gently, at his command wherever he intended.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So We made the wind subservient unto him) after that, (setting fair) setting gently (by his command) and it is said: by Allah's command (whithersoever he intended) wherever he wished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رُخَآءً حَيْثُ أَصَابَ } فالرُّخاءُ: الرّخوةُ اللينةُ\n وأصابَ: أَرادَ\n وهي بِلغةِ هجر\n وقال طوعٌ حيثُ أَرادَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما توجه إلينا وتضرع نحونا على وجه الإنابة والخضوع والتذلل والخشوع، آتينا ملكه، وأجرينا حكمه كما كان { فَسَخَّرْنَا لَهُ ٱلرِّيحَ } بعدما انتقمنا عنه، وجعلناها مقهورة له، محكومة بحكمة؛ حيث { تَجْرِي بِأَمْرِهِ } منقادة بحكمه { رُخَآءً } لينة هينة، بلا تضعضع وتزعزع يتعب منه الراكب { حَيْثُ أَصَابَ } [ص: 36] أي: يجري بأمره أي صوب أراد، وجانب قصد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنك أنت الوهابُ } تعليل للدعاء بالهبة والمغفرة معاً، فإن المغفرة من أحكام وصف الوهَّابية قطعاً، { فسخَّرنا له الريحَ } فذللناها لطاعته، إجابة لدعوته، فعاد أمره عليه السلام إلى ما كان عليه قبل الفتنة، قيل: فتن سليمان بعدما ملك عشرين، وملك بعد الفتنة عشرين، فسخرت له الريح { تجري بأمره } بيان لتسخيرها، { رُخَاءً } أي: لينة، من الرخاوة، أو: طيبة لا تزعج، وهذا بعد أن تُقِلّ السرير من الأرض الإعصارُ، فإذا صار في الهواء حملته الرخاء الطيبة، { حيث أصابَ } أي: قصد وشاء، بلغة حمير\n تقول العرب: أصاب الصواب فأخطأ الجواب، أي: أراد الصواب فأخطأ\n قال الشاعر:\n",
      "translations": []
    }
  ]
}