{
  "chapter": "ص",
  "text": "ولقد فتنا سليمن والقينا على كرسيه جسدا ثم اناب",
  "translations": [
    {
      "translation": "We tested Sulayman and placed a lifeless body on his throne. Then he made tawba.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We surely tried Solomon, and placed another body on his throne. So he turned to God\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We put Solomon to the test and cast upon his throne a mere body. Thereupon he penitently turned (to Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tested Solomon by (causing death to his son) and leaving his body on Solomon's chair. Then he turned to Us in repentance,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed tested Sulaiman, and placed a dead body on his throne – he therefore inclined towards His Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We tried Sulayman and We placed on his throne Jasad (a body), and he returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We tried Sulaiman, and We put on his throne a (mere) body, so he turned (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We tried Solomon, and We cast upon his throne a mere body; then he repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We tried Solomon, and set upon his throne a (mere) body. Then did he repent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tried Solomon by placing upon his throne a [lifeless] body; and thereupon he turned towards Us].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We tried Sulaiman, and set upon his throne a mere body. Thereafter he was penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We tried Solomon, and cast a [lifeless] body on his throne. Thereupon he was penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did try Solomon: We placed on his throne a body (without life); but he did turn (to Us in true devotion):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, indeed We did try Sulaiman (Solomon) and We placed on his throne Jasadan (a devil, so he lost his kingdom for a while) but he did return (to his throne and kingdom by the Grace of Allah and he did return) to Allah with obedience and in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We tried Solomon and placed a body (of a child) upon his throne, then he repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tested Solomon, and placed a body on his throne; then he repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly tried Solomon and placed on his throne a body; then he returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:34]   And We certainly tried Solomon: We tested him by wresting his kingdom from him, because he had married a woman [solely] out of his desire for her. She used to worship idols in his [own] home without his knowledge. Now, [control of] his kingdom lay in his ring. On one occasion, needing to withdraw [to relieve himself], he took it off and left it with this woman of his, whose name was al-Amīna, as was his custom; but a jinn, [disguised] in the form of Solomon, came to her and seized it from her. And We cast upon his throne a [lifeless] body, which was that [very] jinn, and he was [the one known as] Sakhr — or it was some other [jinn]; he sat upon Solomon’s throne and so [as was the case with Solomon] the birds and other [creatures] devoted themselves to him [in service]. When Solomon came out [of his palace], having seen him [the jinn] upon his throne, he said to the people, ‘I am Solomon [not him]!’ But they did not recognise him. Then he repented — Solomon returned to his kingdom, many days later, after he had managed to acquire the ring. He wore it and sat upon his throne [again].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We tried Solomon) by the loss of his kingdom for 40 days, the number of days in which the idols were worshipped in his house, (and set upon his throne a (mere) body) a devil. (Then did he repent) then did he return to his kingdom and to the obedience of his Lord and repented from his sin.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَداً } معناه شَيطانٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd We placed on his throne a body { } meaning Satan.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولقد فتنا سليمان } ابتليناه مرة أخرى بما هو أشدّ من هذا التلوين وهو إلقاء الجسد على كرسيه\n وقد اختلف في تفسيره على ثلاثة أوجه\n أحدها: أنه ولد له ابن فهمّ الشياطين بقتله مخافة أن يسخّرهم كأبيه\n فعلم بذلك فكان يغدوه في السحابة فما راعه إلا أن ألقي على كرسيه ميتاً فتنبه على خطئه في أن لم يتوكل فيه على ربّه\n والثاني: أنه قال ذات يوم: لأطوفنّ على سبعين امرأة كل واحدة تأتي بفارس يجاهد في سبيل الله\n ولم يقل: إن شاء الله\n فطاف عليهنّ ولم تحمل إلا امرأة واحدة جاءت بشق رجل\n فعلى هذين الوجهين يكون ابتلاؤه بمحبة الولد\n فظهور النفس بميله إليه إما بشدّة الاهتمام بحفظه وتربيته وصونه عن شياطين الأوهام والتخيلات في سحاب العقل العملي وتغذيته بالحكمة العقلية واعتماده في ذلك على العقل والمعقول واستحاكم أهله لكماله دون تفويض أمره فيه إلى الله واتكاله في شأنه عليه\n فابتلاه الله بموته\n فتنبه على خطئه في شدّة حبه للغير وغلبة أهله\n وإما بظهور النفس في الاقتراح والتمني وغلبة الحسبان والظنّ والاحتجاب عن الاستيهاب بالعادة والفعل وبالتدبير عن التقدير والذهول عن أمر الحق بغلبة صفات النفس\n فابتلاه الله بالمعلول البعيد عن المراد الذي تصوّره في نفسه وقدّره\n فأناب الرجوع إلى الحق عند التنبه على ظهور النفس وتدارك التلوين بالاستغفار والاعتذار في التقصير\n والوجه الثالث: أنه غزا صيدون مدينة في بعض جزائر البحر\n فقتل ملكها وكان عظيم الشأن\n وأصاب بنتاً له اسمها جرادة من أحسن الناس وجهاً\n فاصطفاها لنفسه بعد أن أسلمت وأحبها وقد اشتدّ حزنها على أبيها فأمر الشياطين فمثلوا لها صورة أبيها فكستها مثل كسوته وكانت تغدو إليها وتروح مع ولائدها يسجدن لها كعادتهن في ملكه\n فأخبر آصف سليمان بذلك\n فكسر الصورة وعاقب المرأة ثم خرج وحده إلى فلاة وفرش لنفسه الرماد\n فجلس عليه تائباً إلى الله متضرّعاً\n وكانت له أمّ ولد يقال لها: أمينة\n إذا دخل للطهارة أو لإصابة امرأة وضع خاتمه عندها\n وكان ملكه في خاتمه\n فوضعه عندها يوماً وأتاها الشيطان صاحب البحر اسمه صخر على صورة سليمان فقال: يا أمينة\n خاتمي! فتختم به وجلس على كرسيّ سليمان وغيّر سليمان على هيئته فأنكرته وطردته\n فعرف أن الخطيئة قد أدركته فأخذ يدور على البيوت بتكفف\n وإذا قال أنا سليمان حثوا عليه التراب وسبوه\n ثم عمد إلى السمّاكين يخدمهم\n فمكث على ذلك أربعين صباحاً ثم طار الشيطان وقذف الخاتم في البحر\n فابتلعته سمكة ووقعت السمكة في يد سليمان\n فبقر بطنها فإذا هو بالخاتم\n فتختم به وخرّ ساجداً ورجع إليه ملكه وجاب صخرة لصخر فجعله فيها وقذفه في البحر\n\nفإن صحت الحكاية في مطابقتها للواقع كان قد اشتدّ تلوينه وابتلى بمثل ما ابتلي به ذو النون وآدم عليهما السلام\n والحكاية من موضوعات حكماء اليهود وعظمائهم كسائر ما وضعت الحكماء في تمثيلاتهم من حكايات إيسال وسلامان وأمثالها\n وتأويلها والله أعلم بصحتها ووضعها: أنّ سليمان قصد مدينة صيدون البدن\n جزيرة في بحر الهيولى\n وقتل ملكها النفس الأمارة العظيم الشأن ظاهر الطغيان بالمجاهدة في سبيل الله\n وأصاب بنتاً له اسمها جرادة وهي القوى المتخيلة بالطيارة كالجرادة\n تجرّد أشجار الأجسام والأشياء كلها بنزع صورها عن موادّها مكتوفة بلواحقها حزينة\n وهي من أحسن الناس صورة في تزيينها وتسويلها نفسها وما تخيلته من مدركاتها\n وأسلمت على يده\n أي: انقادت للعقل ورجعت عن دين الوهم\n فصارت مفكرة\n فاصطفاها لنفسه وأحبها لتوقف حصول كماله عليها\n وحزنها على أبيها: ميلها إلى النفس بطبعها وتأسفها على فوات حظوظها\n وأمره للشيطان بتمثيل صورة أبيها وكسوتها مثل كسوته هو إشارة إلى منشأ تلوينه وابتلائه بالميل إلى النفس واغتراره بكماله واشتغاله بحظوظ النفس قبل أوانه\n كما قال أمير المؤمنين عليه السلام: \" نعوذ بالله من الضلال بعد الهدى \"\n وطاعة الشيطان له: تسخير القوّة الوهمية له في إعادة النفس إلى الهيئة الأولى وإن لم تكن على قوّتها الأولى\n وحياتها من الهوى: لكونه مصوناً عن الاحتجاب معنياً به في العناية\n وسجود جرادة وولائدها له كعادتهنّ في ملكه: تعبّد الفكرية وسائر القوى البدنية للنفس بالانقياد والمراعاة والخدمة وإيصال الحظوظ إليها كعادتهنّ في الجاهلية الأولى\n وإخبار آصف سليمان بذلك: تنبيه العقل للقلب على تلوينه عند قرب موته\n وكسر الصورة وعقاب المرأة: ندامته وتوبته عن حاله\n وتنصله متضرّعاً إلى الله وكسره للنفس بالرياضة وخروجه وحده إلى الفلاة: تجرّده عن البدن عند سقوط قواه\n وفرش الرماد وجلوسه فيه: تغير المزاج وترمد الأخلاط مع بقاء العلاقة البدنية\n وأمّ الولد المسماة أمينة هي: الطبيعة البدنية أمّ الأولاد القوى النفسانية التي يضع هو خاتم بدنه عندها وقت الاشتغال بالأمور الطبيعية والضروريات البدنية كالدخول في الخلوة وإصابة المرأة وأمثالها\n وهي أمينة على حفظه\n وكون ملكه في خاتمه: إشارة إلى توقف كماله المعنوي والصوري على البدن\n والشيطان الذي جاءها فأخذ منها الخاتم: هو الطبيعة العنصرية الأرضية صاحب بحر الهيولى السفلية سمي صخراً لميله إلى السفل وملازمته كالحجر للثقل\n وتختمه به: لبسه به بانضمامه إلى نفسه\n وجلوسه على كرسي سليمان: هو إلقاء الله تعالى بدنه ميتاً على موضعه وسرير سلطنته كما قال تعالى: { وألقينا على كرسيه جسداً } وتغيّر سليمان عن هيئته بقاء الهيئات الجسمانية والآثار الهيولانية من بقايا الصفات النفسانية عليه بعد المفارقة البدنية وتغيره عن النورانية الفطرية والهيئة الأصلية\n وإتيانه أمينة لطلب الخاتم: ميله إلى البدن ومحبته له وشوقه إليه\n وإنكارها إياه وطردها له: عبارة عن عدم قبول الطبيعة البدنية الحياة لبطلان المزاج\n ودوره على البيوت متكففاً: ميله إلى الحظوظ واللذات الجسمانية وانجذابه إليها بالشوق للهيئات النفسانية\n وحثيهم التراب على وجهه وسبّهم إياه عبارة عن: حرمانه من تلك الحظوظ واللذات وفقدان أسباب تلك الشهوات\n وقصده إلى السمّاكين وخدمته لهم: إشارة إلى الميل إلى قرارة الأرحام المتعلق بالنطفة\n ومكثه أربعين يوماً في خدمة السمّاكين: إشارة إلى قوله عليه الصلاة والسلام في الحديث الرباني:\n\n \" خمرت طينة آدم بيدي أربعين صباحاً \" \n\n وطيران الشيطان: سريان الطبيعة العنصرية في التركيب\n وإلقاؤه الخاتم في البحر: تلاشي التركيب البدني في البحر الهيولاني\n وابتلاع السمكة إياه: جذب الرحم للمادة البدنية التي هي النطفة\n ووقوع السمكة في يد سليمان: تعلقه في الرحم بها واستيلاؤه على الرحم بالاغتذاء منه والتصرّف فيه\n وبقر بطنها وأخذ الخاتم منه وتختمه به: فتح الرحم وإخراج البدن منه وتلبسه به وخروره ساجداً ورجوع ملكه: حصول كماله به بالانقياد لأمر الله والفناء فيه\n وجعله لصخر في صخرة وإلقاؤه إياه في البحر: إبقاء الطبيعة الأرضية على حالها منطبعة محبوسة في باطن الجرم ملازمة للثقل\n والميل إلى السفل في بحر الهيولى عند وجود الطبيعة البدنية وتركه إياه فيه غير قادر على استيلاء أمينة وأخذ الخاتم منها إلى حين: { ثم أناب } بعد اللتيا والتي إلى الله بالتجريد والتزكية\n { قال ربّ اغفر لي } ذنوب تعلقاتي وهيئاتي الساترة لنوري المظلمة المكدّرة لصفائي بنورك { وهب لي ملكاً لا ينبغي لأحد من بعدي } أي: كمالاً خالصاً باستعدادي يقتضيه هويتي لا ينبغي لغيري لاختصاصه به وهو الغاية التي يمكنه بلوغها { إنك أنت الوهَاب } لجميع الاستعدادات وكل ما سئلت من الكمالات كما قال تعالى:\n[إبراهيم: الآية: 34]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع كونه مقبولاً عندنا ممدوحاً لدينا { لَقَدْ فَتَنَّا } وابتلينا { سُلَيْمَانَ } بفتنة عظيمة\n وأخذنا منه ملكه بجريمة صدرت من أهل بيته بأدنى ملابسة له ورضا من جانبه\n\n\nوذلك أنه عليه السلام غزا \" صيدون \" من الجزائر\n فقتل ملكها فأصاب ابنته اسمها جرادة\n وهي من أجمل النساء وأحسنها شكلاً\n فأعجب سليمان بحسنها وخصها لنفسه\n وهي أحب عليه من سائر نسائه\n وكانت من شدة حزنها وكآبتها على أبيها لا يرقى دمعها\n ولا يزال همها\n فأمر عليه السلام الشياطين فمثل لها صورة أبيها\n فكانت تغدو إليها و تروح مع ولائدها يسجدون لها\n على ما هي عادتها في حياته وملكه\n\nومضى عليها أربعون يوماً\n فاستشعر بها آصف بن برخيا فأخبره\n فكسر الصورة وضرب المرأة والولائد\n فخرج عليه السلام إلى الصحراء باكياً متألماً مستحيياً من ربه\n وكان من عادته عليه السلام إذا دخل الخلاء أعطى خاتمه الذي فيه ملكه إلى أمة له اسمها أمينة\n فأعطاها يوماً فتمثل بصورة سليمان شيطان امسه صخر\n فجاء فطلب الخاتم من أمينة فأخذه فتختم به\n وجلس على كرسيه\n واجتمع الخلق عليه\n وقضى ما قضى ونفذ حكمه في كل شيء إلا في نسائه\n وغيّر سليمان عن هيئته وسلطنته\n فأتى أمينة بطلب الخاتم فطردته وأنكرت عليه\n فعرف أن الفتنة قد أدركته\n\n\nفأخذ يدور حول البيوت يتكفف حتى مضى أربعون يوماً عاد ما عبد في بيته الصورة\n وبعد انقضاء المدة المذكورة\n طار الشيطان من كرسيه وقذف الخاتم في البحر\n فابتلعته سمكة فوقعت في يد سليمان من قضاء الله ومزيد كرمه وعطائه عليه\n فبقر بطنها فوجد الخاتم فتختم به\n فعاد ملكه عليه\n وخرَّ ساجداً وأناب إلى الله متضرعاً كما أخبر سبحانه\n\n\nوبعدما فتناه بفتنة عظيمة وهي عبادة غيرنا في بيته برضاء منه\n وأخذناه عليها وأخرجناه من ملكه بفقد الخاتم عنه { وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ } وأجلسنا بدله عليها { جَسَداً } تمثالاً وصورة لا حقيقة لها\n { ثُمَّ } بعدما ابتليناه بما ابتليناه قد { أَنَابَ } [ص: 34] إلينا مخلصاً متضرعاً\n فقبلنا توبته عناية منَّا إياه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولقد فتنَّا سليمانَ } أي: ابتليناه\n { وألقينا على كرسيه } سرير ملكه\n { جسداً } شق ولد\n أو جِنياً\n { ثم أنابَ } رجع إلى الله تعالى\n وأظهر ما قيل في فتنته عليه السلام ما رُوي مرفوعاً: أنه قال: لأطُوفَنَّ الليلةَ على سبعين ـ أو تسع وتسعين ـ امرأةً\n تأتي كل واحدة منهن بفارس\n يُجاهد في سبيل الله\n ولم يقل \" إن شاء الله \" فطاف عليهنَّ\n فلم تحمل إلا امرأة واحدة\n جاءت بشقّ رجل\n قال نبينا عليه الصلاة والسلام:\n \" والذي نفسي بيده لو قال: إن شاء اللهُ\n لجاهدوا في سبيل الله فُرساناً أجمعون \" \nفالفتنة على هذا: كونه لم يقل: \" إن شاء الله \" والجسد هو شق الإنسان الذي وُلد له\n وقيل: إنه ولد له ابن\n فأجْمعَت الشياطين على قتله\n وقالوا: إن عاش له ولد لم ننفك من خدمته\n فلمَّا عَلِمَ ذلك\n حمله في السحاب\n فما شعر حتى ألقي على كرسيه جسداً ميتاً\n فتنبّه لخطئه\n حيث لم يتوكل على الله\n وقيل: إنه غزا صيدون من الجزائر\n فقتل مَلِكها\n وأخذ بنتاً له تُسمى جرادة\n من أحسن الناس\n فاصطفاها لنفسه\n وأسلمت على جفاء\n وأحبها\n وكان لا يرقأ دَمْعها\n جزعاً على أبيها\n فأمر الشياطين فمثَّلوا لها صورته\n فكانت تغدو عليها وتروح مع ولائدها\n فيسجدْنَ لها\n كعادتهن في ملكه\n فأخبره صاحبه آصف بذلك\n فكسر الصورة\n وعاقب المرأة\n ثم خرج إلى فلاة\n وفُرش له الرماد\n وجلس عليه تائباً إلى الله متضرعاً\n وكانت له أم ولد\n يقال لها: \" أمينة \" إذا دخل للطهارة\n أو لإصابة امرأة\n يعطيها خاتمه\n وكان فيها مُلكه\n فأعطاها يوماً\n فتمثّل لها بصورته شيطان\n اسمه \" صخر \" وأخذ الخاتم\n فتختّم به\n وجلس على كرسيه\n فاجتمع عليه الخلق\n ونفذ حكمه في كل شيء\n إلا في نسائه\n على المشهور\n وغُيرَ سليمان عن هيئته\n فأتى \" أمينة \" لطلب الخاتم\n فأنكرته وطردته\n فعلم أن الخطيئة قد أدركته\n فكان يطوف على البيوت يتكفف\n وإذا قال: أنا سليمان\n حثوا التراب عليه\n وسبُّوه\n ثم عمد إلى السمَّاكين ينقل لهم السمك\n فيُعطونه كل يوم سمكتين\n فمكث على ذلك أربعين صباحاً\n عدد ما عبد الوثن في بيته\n فأنكر آصف وعظماءُ بني إسرائيل حُكمَ الشيطان\n حتى دخلوا على نسائه\n فقالوا: قد أنكرنا حُكمه\n فذهبوا حتى جلسوا بين يديه\n فنشروا التوراة\n فقرؤوها\n فطار من بين أيديهم\n والخاتم معه\n ثم قذفه في البحر\n فابتلعته سمكة\n فوقعت في يد سليمان\n فبَقَر بطنها\n فإذا هو بالخاتم\n فتختّم به\n وخرّ ساجداً لله\n وعاد إليه مُلكه\n وقبض الجني \" صخر \" فجعله في وسط صخرة\n وشدّ عليه بأخرى\n ثم أوثقهما بالحديد والرصاص\n وقذفه في البحر\n فهو باق فيه\n\nفالجسد على هذا عبارة عن \" صخر \" سمي به\n وهو جسم لا روح فيه لأنه تمثيل بما لم يكن كذلك\n والخطيئة: تغافُلُه عليه السلام عن حال أهله لأن اتخاذ التماثيل لم يكن محظوراً حينئذ\n والسجود للصورة بغير علم منه لا يضره\n وأنكر بعض المحققين هذه القصة\n وقال: لا يصح ما نقله الإخباريون وأهل التفسير في هذا الموضع\n من تشبُّه الشيطان بنبيه\n وتسلُّطه على ملكه\n وتصرُّفه في أمته والجور في حكمه\n قال القاضي عياض: الشياطين لا يتسلطون على مثل هذا\n وقد عصم الله الأنبياء عن مثله\n ومثله لابن العربي أيضاً\n وحكى إنكاره عن السمرقندي\n وقال الطيبي: أشبه الأقاويل في إلقاء الجسد هو شق الولد\n كما تقدّم\n وخالفه ابن حجر\n فقال: قال غير واحد من المفسرين: أن المراد بالجسد المذكور شيطان\n وهو المعتمد\n فالله أعلم\n غير أن التنزيه أسلم\n قال شيخُ شيوخنا الفاسي في حاشيته\n وليس هذه كقصة أيوب\n فيما يذكر أنه تسلّط الشيطان على إتلاف ماله وولده\n وضرره في جسده لأن ذلك إنما فيه تسلُّط على محض ضرر دنيوي لا ديني\n وقد قال عليه الصلاة والسلام:\n \" تفلت عليّ البارحة عفريتٌ\n\n\n \" \nالحديث\n وكذا سُحر\n وسُمّ\n وشُجّ\n والتسلُّط المذكور في حق سليمان\n فيه تلبيس في الدين فلا يصح\n إلا أن يقال: إنه لم يقر\n بل رُفع اللبس بعد ذلك\n كما في آية:\n[الحج:52]\n والله أعلم هـ\n { قال ربِّ اغفر لي } \n هو بدل من \" أناب \" \n أي: اغفر لي ما صدر عني من الزلة\n { وهب لي مُلكاً لا ينبغي لأحد من بعدي } \n ليكون معجزةً لي\n مناسبة لحالي\n فإنه عليه السلام لمَّا نشأ في بيت الملك والنبوة\n وورثهما معاً\n استدعى من ربه معجزة جامعة لحكمهما\n أو: لا ينبغي لأحد يسلبه مني بعد هذه السلبة\n أو: لا يصح لأحد من بعدي لعظمته وشدته\n  قال القشيري: ويُقال: لا ينبغي لأحد من بعدي أن يسأل المُلْك\n بل يجب أن يَكِلَ أمرَه إلى الله ـ ومثله للجنيد\n وزاد: فإن المُلْكَ شُغل عن المالك ـ أو يقال: لا ينبغي لأحدٍ من بعدي من الملوك\n لا من الأنبياء\n وإنما سأل المُلكَ لسياسة الناس\n وإنصافِ بعضهم من بعض\n والقيام بحقِّ الله\n ولم يسأله لأجل مَيْلِه إلى الدنيا\n وهو كما قال يوسف عليه السلام:\n[يوسف: 55]\n ثم قال: عَلِمَ أن نبينا عليه الصلاة والسلام لا يلاحِظَ الدنيا\n ولا يملكها\n تحقيراً لها فقال: { لا ينبغي لأحد من بعدي } لا لأنه بَخِلَ به عليه\n ولكن لِعِلْمِه أنه لا ينظر إلى ذلك\n هـ\n هذا\n وقد يُقال: إن قوله: { وهب لي مُلْكاً } قد جرى على لسانه\n كما هو حال النطق بالله من أهل الله\n ولذلك كان الأمر كذلك\n ولم يزاحمه أحد\n كقول الخليل:\n\n[البقرة: 129]\n لما جرى به القضاء أنطقه الله بما سيكون\n وتقديم الاستغفار على الاستيهاب لمزيد اهتمامه بأمر الدين\n جرياً على سنَن الأنبياء والصالحين\n وكون ذلك أدخل في الإجابة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:8",
      "similarity": 0.4164142051374222
    },
    {
      "verse": "20:88",
      "similarity": 0.2914868397739761
    },
    {
      "verse": "7:148",
      "similarity": 0.27215422169499337
    },
    {
      "verse": "2:255",
      "similarity": 0.2682506305367205
    },
    {
      "verse": "27:30",
      "similarity": 0.12919128000348074
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/38:34.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/38:34.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}