{
  "chapter": "ص",
  "text": "هذا عطاؤنا فامنن او امسك بغير حساب",
  "translations": [
    {
      "translation": "'This is Our gift: so bestow it or withhold it without reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Our gift,\" (We said to him), \"so bestow freely or withhold without reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is Our bestowal. So give or withhold as you wish without account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told him, \"This is Our gift to you so give them away free or keep them as you like\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is Our bestowal – you may therefore bestow favours or withhold them – you will not be questioned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah said to Sulayman]: \"This is Our gift, so spend you or withhold, no account will be asked of you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Our free gift, therefore give freely or withhold, without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Our gift; bestow or withhold without reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): This is Our gift, so bestow thou, or withhold, without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: \"This is Our gift, so give or withhold as you wish without reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Our gift, SO bestow thou or withhold, without rendering an account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘This is Our bounty: so withhold or bestow without any reckoning.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are Our Bounties: whether thou bestow them (on others) or withhold them, no account will be asked.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Saying of Allah to Sulaiman (Solomon)]: \"This is Our gift, so spend you or withhold, no account will be asked.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Our gift, give or withhold without reckoning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is Our gift; so give generously, or withhold; without account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We said], \"This is Our gift, so grant or withhold without account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:39] And We said to him: ‘This is Our gift. So bestow, grant thereof to whomever you wish, or withhold, from giving, without any reckoning’, in other words, without your being called to account for any of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Saying): This is Our gift) this is Our sovereignty, Solomon. We made you a sovereign over the devils, (so bestow thou) favour whom you will among the rebellious and relieve them from their chains, (or withhold) or keep them chained, (without reckoning) without taking anyone to task or incur a sin as a result.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَـٰذَا عَطَآؤُنَا فَٱمْنُنْ } أي اعطِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه امتناناً عليه، وتنبيهاً على تعظيمه وتكريمه: { هَـٰذَا } المذكور من الحكومة والخلافة والتسخيرات السالفة { عَطَآؤُنَا } عليك يا من اصطفيناك لوارثة النبوة والخلافة { فَٱمْنُنْ } منه لمن شئت، واجعل حق المستحقين محفوظاً به { أَوْ أَمْسِكْ } لنفسك، ولا تعطِ أحداً؛ يعني: لكل الخيار في المنع والإعطاء { بِغَيْرِ حِسَابٍ } [ص: 39] عليك، وسؤال عن فعلك، إذ أمره مفوض إليك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هذا عطاؤنا } ، هو حكاية لما خُوطب به سليمان من قِبَل الحق تعالى، أي: وقلنا له هذا الذي أعطيناك من المُلك العظيم، والسلطنة، والتسلُّط على ما لم يُسلط عليه غيرُك، هو عطاؤنا الخاص بك، { فامْنُنْ أو أَمْسِكْ } أي: أعطِ مَن شئت، وامنع مَن شئت، { بغير حسابٍ } أي: غير محاسَب على منِّه ومنعه لتفويض التصرُّف فيه إليك، فكان إذا أعطى أُجر، وإذا منع لم يأثم، بخلاف غيره\n قال الحسن: إن الله لم يعطِ أحداً عطية إلا جعل فيها حساباً، إلا سليمان، فإن الله أعطاه عطاءً هيناً\n وهذا مما خُصّ به سليمان عليه السلام، وأما غيره، فيؤخر على بذله، ويُعاقب على منعه من حقه، و { بغير حساب }: قيل: متعلق بعطاؤنا، وقيل: حال من المستكن في الأمر، أي: هذا عطاؤنا جمّاً كثيراً، لا يكاد يقدر على حصره، أو: هذا التسخير عطاؤنا فامنن على مَن شئت من الشياطين بالإطلاق، أو: أمسك مَن شئت منهم في الوثاق، لا حساب عليك في ذلك\n\n",
      "translations": []
    }
  ]
}