{
  "chapter": "ص",
  "text": "قال رب اغفر لى وهب لى ملكا لا ينۢبغى لاحد منۢ بعدى انك انت الوهاب",
  "translations": [
    {
      "translation": "He said, 'My Lord, forgive me and give me a kingdom the like of which will never be granted to anyone after me. Truly You are the Ever-Giving.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: \"O Lord, forgive me, and give me such a dominion as none will merit after me. You are the great bestower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: “My Lord, forgive me and bestow upon me a kingdom such as none other after me will deserve. Surely You are the Bounteous Giver.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying, \"Lord, forgive me and grant me a kingdom that no one after me can have the like. You are All-munificent\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! Forgive me and bestow upon me a kingdom, which shall not befit anyone after me; indeed only You are the Great Bestower.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! Forgive me, and bestow upon me a kingdom such as shall not belong to any other after me. Verily, You are the Bestower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! do Thou forgive me and grant me a kingdom which is not fit for (being inherited by) anyone after me;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'My Lord, forgive me, and give me a kingdom such as may not befall anyone after me; surely Thou art the All-giver.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Forgive me and bestow on me sovereignty such as shall not belong to any after me. Lo! Thou art the Bestower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He prayed, \"Lord forgive me! Grant me such power as no one after me will have -- You are the Most Generous Provider.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! forgive me, and bestow on me a dominion which no one may obtain beside me: verily Thou! Thou art the Bestower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! Forgive me, and grant me a kingdom that will not befit anyone except me. Indeed You are the All-munificent.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my Lord! Forgive me, and grant me a kingdom which, (it may be), suits not another after me: for Thou art the Grantor of Bounties (without measure).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! Forgive me, and bestow upon me a kingdom such as shall not belong to any other after me: Verily, You are the Bestower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Forgive me my Lord, and give me a kingdom the like of which will not befall any after me, surely, You are the Giver'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, forgive me, and grant me a kingdom never to be attained by anyone after me. You are the Giver.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:35] He said, ‘My Lord! Forgive me and grant me a kingdom that shall not belong to anyone after me, in other words, other than me (this [use of min ba‘dī to mean ‘other than me’] is similar to [Q. 45:23] fa-man yahdīh min ba‘di’Llāh, ‘who will guide him other than God?’). Truly You are the Bestower’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي إِنَّكَ أَنْتَ الْوَهَّابُ (35) فكنّى ب { لا ينبغي } عن معنى لا يُعطَى لأحد ، أي لا تعطيه أحداً من بعدي .ففعل : { ينبغِي } مطاوع بغاه ، يقال : بغاه فانبغى له وليس للملْك اختيار وانبغاء وإنما الله هو المعطي والميسّر فإسناد الانبغاء إلى الملك مجاز عقلي ، وحقيقته : انبغاء سببه . وهذا من التأدّي في دعائه إذ لم يقل : لا تعطه أحداً من بعدي .وسأل الله أن لا يقيم له منازعاً في ملكه وأن يبقى له ذلك الملكُ إلى موته ، فاستجاب فكان سليمان يخشى ظهور عبده ( يربعام بن نباط ) من سبط أفرايم عليه إذ كان أظهر الكيد لسليمان فطلبه سليمان ليقتله فهرب إلى ( شيشق ) فرعون مصر وبقي في مصر إلى وفاة سليمان . فهذا أيضاً مما حمل سليمان أن يسأل الله تثبيت ملكه وأن لا يعطيه أحداً غيره . وكان لسليمان عدوَّان آخران هما ( هدد ) الأدومي و ( رزون ) من أهل صرفة مقيمين في تخوم مملكة إسرائيل فخشي أن يكون الله هيأهما لإِزالة ملكه .واستعمل { مِن بعدي } في معنى : من دوني ، كقوله تعالى : { فمن يهديه من بعد الله } \\[ الجاثية : 23 \\] ، فيكون معنى { لا ينبغِي } أنه لا ينبغي لأحد غيري ، أي في وقت حياتي فهذا دعاء بأن لا يُسلط أحد على ملكه مدة حياته .وعلى هذا التفسير لا يكون في سؤاله هذا الملك شيء من الاهتمام بأن لا ينال غيره مثل ما ناله هو فلا يرد على ذلك أن مثل هذا يعدّ من الحسد .ويجوز أن يبقى { مِن بعدي } على ظاهره ، أي بعد حياتي . فمعنى { لا يَنبغِي } : لا ينبغي مثله لأحد بعد وفاتي . وتأويل ذلك أنه قصد من سؤاله الإِشفاق من أن يلِي مثل ذلك الملك من ليس له من النُبوءة والحكمة والعصمة ما يضطلع به لأعباء ملك مثل ذلك الملك ومن ليس له من النفوذ على أمته ما لسليمان على أمته فلا يلبث أن يحسد على الملك فينجم في الأمة منازعون للمَلِك على مُلْكه ، فينتفِي أيضاً على هذا التأويل إيهام أنه سأل ذلك غيرة على نفسه أن يعطَى أحد غيرُه مثلَ ملكه ( مما تشمّ منه رائحة الحسد ) .وقد تضمنت دعوته شيئين : هما أن يعطى ملكاً عظيماً ، وأن لا يُعطَى غيرُه مثلَه في عظمته . وقد حكى الله دعاء سليمان وهو سرّ بينه وبين ربه إشعاراً بأنه ألهمه إياه ، وأنه استجاب له دعوته تعريفاً برضاه عنه وبأنه جعل استجابته مكرمة توبتِه . ومعنى ذلك أنه لا يأتي ملك بعده له من السلطان جميع ما لسليمان فإن ملك سليمان عمّ التصرف في الجن وتسخير الريح والطير ، ومجموعُ ذلك لم يحصل لأحد من بعده .وفي «الصحيح» عن أبي هريرة أن النبي صلى الله عليه وسلم قال : «إن عفريتاً من الجن تفلَّتَ البارحةَ ليقطع عليَّ صلاتي فأمكنني الله منه فأخذته فأردتُ أن أربطه بسارية من سواري المسجد حتى تنظروا إليه كلُّكُم فذكرتُ دعوة أخي سليمان : «رب هَبْ لي مُلْكاً لا يَنْبَغي لأحَدٍ مِنْ بَعْدي فرددته خاسِئاً» .وجملة { إنَّك أنتَ الوهابُ } علة للسؤال كله وتمهيد للإِجابة ، فقامت ( إنّ ) مقام حرف التفريع ودلت صيغة المبالغة في { الوَهَّابُ } على أنه تعالى يهب الكثير والعظيم لأن المبالغة تفيد شدة الكمية أو شدة الكيفية أو كلتيهما بقرينة مقام الدعاء ، فمغفرة الذنب من المواهب العظيمة لما يرتب عليه من درجات الآخرة وإعطاء مثل هذا الملك هو هبة عظيمة . و { أنْتَ } ضميرُ فصل ، وأفاد الفصل به قصراً فصار المعنى : أنت القوي الموهبة لا غيرك ، لأن الله يَهَب ما لا يملك غيره أن يهبه .\n\n",
      "translations": [
        {
          "translation": "(He said: My Lord! Forgive me) my sin (and bestow on me sovereignty such shall not belong to any after me) it is also said that this means: that will not be taken from me as the first time. (Lo! Thou art the Bestower) of sovereignty and prophethood to whomever you will.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَّ يَنبَغِي لأَحَدٍ } معناه لاَ يكونُ لَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"It is not for anyone\" - this means that it is not for anyone to have",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حيث { قَالَ } في مناجاته معنا\n وعرض حاجاته إلينا: { رَبِّ } يا من رباني بمقتضى لطفك وجودك\n وأعطيتني من مواهبك ما لم تعطِ أحداً من خلقك { ٱغْفِرْ لِي } ذنبي\n واعفُ زلتي بسعة رحمتك وجودك { وَ } بعدما غفرتني ومحوت عني معصيتي { هَبْ لِي مُلْكاً } كما وهبتني قبل هذا\n وخصصتني به بمقتضى جودك وإحسانك علي\n إذ { لاَّ يَنبَغِي } ويليق بشأنك وبمزيد لطفك وإحسانك أن تعطيه { لأَحَدٍ مِّن بَعْدِيۤ } إذ لا راد لفظلك\n ولا مانع لعطائك { إِنَّكَ أَنتَ } المحسن { ٱلْوَهَّابُ } [ص: 35] المقصور المنحصر على إعطاء المواهب والكرامات\n بلا عوض ولا غرض\n إذ لا معطي سواك ولا مفضل غيرك\n\n\nوبعدما توجه إلينا وتضرع نحونا على وجه الإنابة والخضوع والتذلل والخشوع\n آتينا ملكه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنك أنت الوهابُ } تعليل للدعاء بالهبة والمغفرة معاً\n فإن المغفرة من أحكام وصف الوهَّابية قطعاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:100",
      "similarity": 0.6737290205623706
    },
    {
      "verse": "42:49",
      "similarity": 0.5324353218447193
    },
    {
      "verse": "19:50",
      "similarity": 0.4552171277432049
    },
    {
      "verse": "19:53",
      "similarity": 0.44950878411703427
    },
    {
      "verse": "19:19",
      "similarity": 0.41254228575092133
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}