{
  "chapter": "ص",
  "text": "فقال انى احببت حب الخير عن ذكر ربى حتى توارت بالحجاب",
  "translations": [
    {
      "translation": "he said, 'I have put the love of good things above the remembrance of my Lord until the sun disappeared behind its veil.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"The love of horses is worthy of desire to me for the remembrance of my Lord;\" and when they were out of sight, (he said):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said: “Lo! I have come to love this wealth on account of the remembrance of my Lord.” And when the horses disappeared,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said, \"My love of horses for the cause of God has made me continue watching them until sunset, thus making me miss my prayer\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Sulaiman said, “I cherish the love of these horses*, out of remembrance of my Lord”; he then ordered them to be raced until they vanished in a curtain out of sight. (To be used in holy war.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I did love the good instead of remembering my Lord,\" till the time was over, and (the sun) had hidden in the veil (of night).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said: Surely I preferred the good things to the remembrance of my Lord-- until the sun set and time for Asr prayer was over, (he said):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said, 'Lo, I have loved the love of good things better than the remembrance of my Lord, until the sun was bidden behind the veil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: Lo! I have preferred the good things (of the world) to the remembrance of my Lord; till they were taken out of sight behind the curtain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said, \"I have put the love of good things above the remembrance of my Lord,\" until [the sun] disappeared behind its veil and the horses disappeared from sight,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: verily I have loved the love of earthly good above the remembrance of my Lord until the sun hath disappeared behind the veil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said, ‘Indeed I have preferred the love of [worldly] niceties to the remembrance of my Lord until [the sun] disappeared behind the [night’s] veil.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, \"Truly do I love the love of good, with a view to the glory of my Lord,\"- until (the sun) was hidden in the veil (of night):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"Alas! I did love the good (these horses) instead of remembering my Lord (in my 'Asr prayer)\" till the time was over, and (the sun) had hidden in the veil (of night).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said: 'Indeed I have loved the love of good things better than the remembrance of my Lord until the sun has vanished behind a veil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I have preferred the love of niceties to the remembrance of my Lord—until it disappeared behind the veil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, \"Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:32] He said, ‘Lo! I have loved, I have desired, the love of [worldly] good things, that is, [of] horses, over the remembrance of my Lord’, that is, [over] the afternoon prayer, until it, that is, the sun, disappeared behind the [night’s] veil, [until] it was concealed by that which veils it from sight.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي حَتَّى تَوَارَتْ بِالْحِجَابِ (32) وأصل تركيب { أحْببتُ حبَّ الخيرِ : } أحببتُ الخير حُبًّا ، فحول التركيب إلى { أحببتُ حب الخيرِ } فصار { حُبَّ الخيرِ } تمييزاً لإِسناد نسبة المحبة إلى نفسه لغرض الإِجمال ثم التفصيل كقوله تعالى : { وفجرنا الأرض عيوناً } \\[ القمر : 12 \\] وقول كعب بن زهير: ... أكرم بها خلةوقولهم : لله دره فَارساً .وضمن { أحْبَبْتُ } معنى عَوَّضت ، فعدِّي ب { عن } في قوله : { عن ذِكرِ ربي } فصار المعنى : أحببت الخير حبّاً فجاوزت ذكر ربي . والمراد بذكر الرّب الصلاة ، فلعلها صلاة كان رتبها لنفسه لأن وقت العشي ليست فيه صلاة مفروضة في شريعة موسى إلا المغرب .و { الخير } : المال النفيس كما في قوله تعالى : { إن ترك خيراً } \\[ البقرة : 180 \\] . والخيل من المال النفيس . وقال الفراء : الخير بالراء من أسماء الخيل . والعرب تعاقب بين اللام والراء كما يقولون : انهملت العين وانهمرت . وختل وختر إذا خدع .وقلت : إن العرب من عادتهم التفاؤل ولهم بالخيل عناية عظيمة حتى وصفوا شياتها وزعموا دلالتها على بخت أو نحس فلعلهم سموها الخير تفاؤلاً لتتمحض للسعد والبخت . وضمير { تَوارَتْ } للشمس بقرينة ذكر العشي وحرف الغاية ولفظ الحجاب ، على أن الإِضمار للشمس في ذكر الأوقات كثير في كلامهم . كما قال لبيد: ... حتى إذا ألقتْ يداً في كافروأجنّ عَورات الثغور ظلامها ... أي ألقت الشمس يدها في الظلمة ، أي ألقت نفسها فهو من التعبير عن الذات ببعض أعضائها .والتواري : الاختفاء ، والحجاب : الستر في البيت الذي تحتجب وراءه المرأة وغيرها ومنه قول أنس بن مالك : فأنزل الله آية الحجاب .والكلام تمثيل لحالة غروب الشمس بتواري المرأة وراء الحجاب وكل من أجزاء هذه التمثيلية مستعار؛ فللشمس استعيرت المرأة على طريقة المكنية ، ولاختفائها عن الأنظار استعير التواري ، ولأُفق غروب الشمس استعير الحجاب .والمعنى : عرضت عليه خيله الصافنات الجياد فاشتغل بأحوالها حباً فيها حتى غربت الشمس ففاتته صلاة كان يصليها في المساء قبل الغروب ، فقال عقب عرض الخيل وقد انصرفت : إني أحببتُ الخيل فغفلت عن صلاتي لله .وكلامه هذا خبر مستعمل في التحسر كقول أم مريم { رب إني وضعتها أنثى } \\[ آل عمران : 36 \\] . والخطاب في قوله : { رُدّوها عليَّ } لسواس خيله . والضمير المنصوب عائد إلى الخيل بالقرينة ، أي أرجعوا الخيل إليّ ، وقيل : هو عائد إلى الشمس والخطاب للملائكة ، وهذا في غاية البعد ولولا كثرة ذكره في كتب المفسرين لكان الأولى بنا عدم التعرض له . وأحسن منه على هذا الاعتبار في معاد ضمير الغيبة أن يكون الأمر مستعملاً في التعجيز ، أي هل تستطيعون أن تردوا الشمس بعد غروبها ، كقول مهلهل: ... يَا لَبَكْر انشروا لي كليباوقول الحارث الضبي أحد أصحاب الجمل: ... رُدوا علينا شيخَنا ثم بَجليريد : عثمان بن عفان رضي الله عنه ، فلا استبعاد في هذا المحمل . والفاء في قوله : { فَطَفِقَ } تعقيبية ، وطفق من أفعال الشروع ، أي فشرع .و { مَسْحاً } مصدر أقيم مقام الفعل ، أي طفق يمسح مَسحاً . وحرف التعريف في { بالسُّوققِ والأعناقِ } عوض عن المضاف إليه ، أي بسوقها وأعناقها كقوله تعالى : { فإن الجنة هي المأوى } \\[ النازعات : 41 \\] . والمسح حقيقته : إمرار اليد على الشيء لإِزالة ما عليه من غبش أو ماء أو غبار وغير ذلك مما لا يراد بقاؤه على الشيء ويكون باليد وبخرقة أو ثوب ، وقد يطلق المسح مجازاً على معان منها : الضرب بالسيف يقال : مسحه بالسيف . ويقال : مسحَ السيفَ به . ولعل أصله كناية عن القتل بالسيف لأن السيف يمسح عنه الدم بعد الضرب به .والسُّوق : جمع ساق . وقرأه الجمهور بواو ساكنة وبوزن فُعْل مثل : دار ودُور ، ووزن فُعل في جمع مثلِه قليل . وقرأه قنبل عن ابن كثير وأبو جعفر «السُّؤق» بهمزة ساكنة بعد السين جمع : سأق بهمزة بعد السين وهي لغة في ساق .و { الأعناق } : جمع عنق وهو الرقبة . والباء في { بالسُّوقِ } مزيدة للتأكيد ، أي تأكيد اتصال الفعل بمفعوله كالتي في قوله تعالى : { وامسحوا برؤوسكم } \\[ المائدة : 6 \\] وفي قول النابغة: ... لك الخير إن وارت بك الأرض واحداوأصبح جد الناس يضلع عاثرا ... وقد تردد المفسرون في المعنى الذي عنى بقوله : { فَطَفِق مسْحَاً بالسُّوققِ والأعناقِ ، } فعن ابن عباس والزهري وابن كيسان وقطرب : طفق يمسح أعراف الخيل وسوقها بيده حُبًّا لها . وهذا هو الجاري على المناسب لمقام نبيءٍ والأوفق بحقيقة المسح ولكنه يقتضي إجراء ترتيب الجمل على خلاف مقتضى الظاهر بأن يكون قوله : { رُدُّوهَا عليَّ فطفق مسحاً بالسوق والأعناق } متصلاً بقوله : { إذ عرض عليه بالعشي الصافنات } أي بعد أن استعرضها وانصرفوا بها لتأوي إلى مذاودها قال : { ردُّوها عليَّ فطفق مسحاً بالسوق والأعناقِ } إكراماً لها ولحبها .ويجعل قوله : { فقَالَ إني أحببتُ حبَّ الخيرِ عن ذِكرِ ربي حتى توارتْ بالحجابِ } معترضاً بينهما ، وإنما قدم للتعجيل بذكر ندمه على تفريطه في ذكر الله في بعض أوقات ذكره ، أي أنه لم يستغرق في الذهول بل بادر الذكرى بمجرد فوات وقت الذكر الذي اعتاده ، إذ لا يناسب أن يكون قوله : { ردوها عليَّ فطفِقَ } الخ من آثار ندمه وتحسّره على هذا التفسير ، وهذا يفيد أن فوات وقت ذكره نشأ عن ذلك الرد الذي أمر به بقوله : { ردُّها عليَّ } فإنهم اعتادوا أن يعرضوها عليه وينصرفوا وقد بَقي ما يكفي من الوقت للذكر فلما حملته بهجته بها على أن أمر بإرجاعها واشتغل بمسح أعناقها وسُوقها خرج وقت ذكره فتندّم وتحسّر .وعن الحسن وقتادة ومالك بن أنس في رواية ابننِ وَهب والفراء وثعلب : أن سليمان لما ندِم على اشتغاله بالخيل حتى أضاع ذكر الله في وقت كان يذكر الله فيه أمر أن تُردّ عليه الخيل التي شغلتْه فجعل يعرقب سوقها ويقطع أعناقها لحرمان نفسه منها مع محبته إياها توبة منه وتربية لنفسه . واستشعروا أن هذا فساد في الأرض وإضاعة للمال فأجابوا : بأنه أراد ذبحها ليأكلها الفقراء لأن أكل الخيل مباح عندهم وبذلك لم يكن ذبحها فساداً في الأرض .\n\n",
      "translations": [
        {
          "translation": "(And he said: Lo! I have preferred the good things (of the world)) I have preferred the wealth of this world (to the remembrance of my Lord) to the obedience of my Lord; (till they were taken out of sight behind the curtain) until the sun disappeared behind the mountain of Qaf.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّيۤ أَحْبَبْتُ حُبَّ ٱلْخَيْرِ } فالخَيرُ: الخَيلُ\n\n\n\n\nوقوله تعالى: { حَتَّىٰ تَوَارَتْ بِٱلْحِجَابِ } معناه غابتْ بالحِجابِ يعني الشَّمسِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, I have preferred the love of good} so the good is: the horses.\n\n\nAnd His saying, {Until it covers the hijab} means it has set with the hijab, i.e. the sun.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { حتى توارتْ } أي: استترت { بالحجابِ } أي: غربت واحتجبت عن العيون\n و \" عن \": متعلق بأحببت\n باعتبار استمرار المحبة ودوامها\n حسب استمرار العَرض\n أي: أنبتُ حب الخير عن ذكر ربي\n واستمر ذلك حتى غربت الشمس\n وإضمارها من غير تقدُّم ذكر لدلالة \" العَشي \" عليها\n { رُدُّوها عليَّ } \n هو من مقالة سليمان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:51",
      "similarity": 0.7327395184498735
    },
    {
      "verse": "83:15",
      "similarity": 0.7244681615321689
    },
    {
      "verse": "19:17",
      "similarity": 0.6607323681247331
    },
    {
      "verse": "41:5",
      "similarity": 0.4652289485767447
    },
    {
      "verse": "7:46",
      "similarity": 0.44755010177263904
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}