{
  "chapter": "ص",
  "text": "وان له عندنا لزلفى وحسن مـاب",
  "translations": [
    {
      "translation": "He will have nearness to Us and a good Homecoming.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has a high position with Us and an excellent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed an exalted position of nearness awaits him and an excellent resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Our eyes he certainly has a high position and the best place to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed for him in Our presence are, surely, proximity and an excellent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, for him is a near access to Us, and a good (final) return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely he had a nearness to Us and an excellent resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he had a near place in Our presence and a fair resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! he hath favour with Us, and a happy journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His reward will be nearness to Us, a good place to return to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily for him is an approach with us, and a happy end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed he has [a station of] nearness with Us and a good destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he enjoyed, indeed, a Near Approach to Us, and a beautiful Place of (Final) Return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, he enjoyed a near access to Us, and a good final return (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he has a place near to Us, and a fine return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For him is nearness to Us, and a beautiful resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, for him is nearness to Us and a good place of return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:40] And indeed he has [a station of] nearness with Us and a fair resort — a similar [statement] has already appeared [in another verse above].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! he hath favour) close rank (with Us, and a happy journey's end) and a happy return in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يفوض لأمر ما أعطيناه إياه إلينا { إِنَّ لَهُ } أي: لسليمان عليه السلام { عِندَنَا } وفي ساحة عز حضورنا { لَزُلْفَىٰ } درجة قريبة من درجات الوصال { وَحُسْنَ مَآبٍ } [ص: 40] أي: خبر مرجع ومنقلب من مراتب التمكن في التوحيد\n والتقرب في مقر القبول",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وإِنَّ له عندنا لزُلفى } لقُربى في الآخرة، مع ما له في الدنيا من الملك العظيم، { وحُسنَ مآب } مرجع، وهي الجنة\n وزُلفى: اسم إن، و \" له \": خبر، و \" عند \": متعلق بالاستقرار\n رُوي أن سليمان عليه السلام لما ورث مُلك أبيه، سار من الشام إلى العراق، فبلغ خبره كسرى، فهرب إلى خراسان، فلم يلبث حتى هلك\n ثم سار سليمان عليه السلام إلى مرو، ثم إلى بلاد الترك، فأوغل فيها، ثم جاز بلاد الصين، ثم عطف إلى أن وافى بلد فارس، فنزلها أياماً، ثم عاد إلى الشام، فأمر ببناء بيت المقدس، فلما فرغ منه سار إلى تهامة، ثم إلى صنعاء، وكان من حديثه مع صاحبتها ما ذكر الله، وغزا بلاد المغرب الأندلس وطنجة وغيرهما\n انظر أبا السعود\n والله تعالى أعلم\n الإشارة: ما أعطى اللهُ عبداً مُكنةً إلا بعد محنة، ولا رفع مقاماً إلا بعد ابتلاء، إما في البدن والمال، وإما في الدين، إنْ صَحِبه رجوع وانكسار\n كأنّ الله تعالى إذا أراد أن يرفع عبداً أهبطه إلى أرض قهرية العبودية، ثم يرفعه إلى مشاهدة عظمة الربوبية، ثم يملكه الوجود بأسره، يتصرف فيه بهمّته كيف شاء\n ولذلك قيل في معصية آدم: نعمت المعصية أورثت الخلافة\n وشاهده حديث:\n\n \" أنا عند المنكسرة قلوبهم من أجلي \" \n\nومَن كان الله عنده، ماذا يفوته؟ وقوله تعالى: { وهَبْ لي مُلكاً\n\n\n } الخ، قال القشيري: لم يطلب المُلكَ الظَاهر، وإنما أراد به أن يَمْلِكَ نَفْسَه، فإن المَلِكَ ـ على الحقيقة ـ مَن ملَك نفسَه، فمَن مَلِكَها لم يَتَّبعْ هواه، أي: فيكون حرّاً، فيملكه الله التصرُّف في الوجود\n ثم قال: ويُقال أراد به كمالَ حاله في شهود ربه، حتى لا يَرى معه غيرَه، ويقال: سأل القناعةَ التي لا يبقى معها اختيار\n هـ\n وقوله تعالى: { هذا عطاؤنا فامنُنْ أو أَمسك بغير حساب } ، هو عند الأولياء ليس خاصّاً بسليمان، فكل مَن تمكَّن مع الله التمكُّن الكبير يُفوض إليه الأمر، ويقال: افعل ما شئت، وشاهده: حديث أهل بدر\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: يبلغ الوليّ مبلغاً يُقال له: أصحبناك السلامة، وأسقطنا عنك الملامة، فاصنع ما شئت\n ثم استشهد بالآية في حق سليمان، هذا، وإن كان للنبي من أجل العصمة، فلِمن كان من الأولياء في مقام الإمامة قسط منه، من أجل الحفظة\n ثم ذكر أيوب عليه السلام، فقال: { وَٱذْكُرْ عَبْدَنَآ أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:25",
      "similarity": 0.9814678009100851
    },
    {
      "verse": "26:64",
      "similarity": 0.719034079298393
    },
    {
      "verse": "81:13",
      "similarity": 0.7188130064844428
    },
    {
      "verse": "26:90",
      "similarity": 0.7158503894127943
    },
    {
      "verse": "50:31",
      "similarity": 0.6880973402307544
    }
  ]
}