{
  "chapter": "ص",
  "text": "وعجبوا۟ ان جاءهم منذر منهم وقال الكفرون هذا سحر كذاب",
  "translations": [
    {
      "translation": "They are surprised that a warner should come to them from among themselves. The kuffar say, This is a lying magician.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were surprised that one of them had come to them as warner; and the unbelievers said: \"He is a deceiving sorcerer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wondered that a warner had come to them from among themselves, and the deniers of the Truth said: “This is a sorcerer, and a big liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It seems strange to the pagans that a man from their own people should come to them as a Prophet. The unbelievers have said, \"He is only a lying magician\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were surprised that a Herald of Warning came to them from among themselves; and the disbelievers said, “He is a magician, a great liar!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wonder that a warner has come to them from among themselves. And the disbelievers say: \"This is a sorcerer, a liar.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wonder that there has come to them a warner from among themselves, and the disbelievers say: This is an enchanter, a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now they marvel that a warner has come to them from among them; and the unbelievers say, 'This is a lying sorcerer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they marvel that a warner from among themselves hath come unto them, and the disbelievers say: This is a wizard, a charlatan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are surprised that a warner should come to them from among themselves. They say, \"This is a magician, a great liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they marvel that there should come Unto them a warner from among themselves. And the infidels say: this is a magician and a liar!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They consider it odd that there should come to them a warner from among themselves, and the faithless say, ‘This is a magician, a mendacious liar.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they wonder that a Warner has come to them from among themselves! and the Unbelievers say, \"This is a sorcerer telling lies!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Arab pagans) wonder that a warner (Prophet Muhammad SAW) has come to them from among themselves! And the disbelievers say: \"This (Prophet Muhammad SAW) is a sorcerer, a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They marvel now that, from among themselves, a warner has come to them. The unbelievers say: 'This is a lying sorcerer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they marveled that a warner has come to them from among them. The disbelievers said, “This is a lying magician.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wonder that there has come to them a warner from among themselves. And the disbelievers say, \"This is a magician and a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:4] And they marvel that a warner has come to them from among themselves, a messenger from among their number, to warn them and to threaten them with [the punishment of] the Fire after resurrection — and this [warner] is the Prophet (s). And those who disbelieve (the overt noun [al-kāfirūnā] has replaced the [third person] pronominalisation) say, ‘This is a sorcerer, a liar.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they) i.e. the Quraysh (marvel that a warner) a warning messenger (from among themselves) from their own lineage (hath come unto them, and the disbelievers) the disbelievers of Mecca (say: This) meaning Muhammad (pbuh) (is a wizard) who sows dispute between people, (a charlatan) who lies about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة شقاقهم وخلافهم { عَجِبُوۤاْ } وتعجبوا؛ أي: أهل مكة { أَن جَآءَهُم } وأرسل عليهم { مٌّنذِرٌ مِّنْهُمْ } أي: من جنسهم وبني نوعهم؛ يعني: محمداً صلى الله عليه وسلم { وَقَالَ ٱلْكَافِرُونَ } من كمال تعجبهم وشدة إنكارهم واستبعادهم، وضع الظاهر موضع الضمير تنصيصاً بأنه ما حملهم على هذا القول إلا كفرهم وإنكارهم: { هَـٰذَا } أي: محمد صلى الله عليه وسلم فيما أظهره في صورة المعجزة الخارقة للعادة { سَاحِرٌ } يسميه معجزة تغريراً وتلبيساً، وفيما نسبه إلى الوحي والإنزال { كَذَّابٌ } [ص: 4] مبالغ في الكذب مستغرق فيه\n\n\n\n\nثم لما أسلم عمر بن الخطاب رضي الله عنه، فشق ذلك على قريش، وفرح المؤمنون، فازدحم صناديدهم عند أبي طالب، وقالوا له: أنت شيخنا وسيدنا، وقد لعمت ما فعل هؤلاء، فأتيناك لتقضي بينننا وبين ابن أخيك، فأرسل أبو طالب إلى النبي صلى الله عليه وسلم، فأحضره معهم، فقال: يا ابن أخي، هؤلاء قومك يسألونك السُؤْل، فلا تم ل كل الميل على قومك\n\n\n\n\n \" فقال صلى الله عليه وسلم: \" وماذا يسألون \"\n \n\n \n\n قالوا له: ارفض ذكر آلهتنا وندعك وإلهك، وعلى هذا نعاهد معك عند عمك؟ \n\n \n\n فقال صلى الله عليه وسلم: \" أتعطونني كلمة واحدة، وتملكون بها العرب وتدين بها العجم؟ \"\n \n\n \n\n فقال أبو جهل: لتعطينكها وعشر أمثالها\n \n\n \n\n فقال رسول الله صلى الله عليه وسلم: \" قولوا لا إله إلا الله \"\n \n\n \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَعَجِبُوۤاْ أَن جَآءَهُم مٌّنذِرٌ مِّنْهُمْ وَقَالَ ٱلْكَافِرُونَ هَـٰذَا سَاحِرٌ كَذَّابٌ أَجَعَلَ ٱلآلِهَةَ إِلَـٰهاً وَاحِداً إِنَّ هَـٰذَا لَشَيْءٌ عُجَابٌ وَٱنطَلَقَ ٱلْمَلأُ مِنْهُمْ أَنِ ٱمْشُواْ وَاْصْبِرُواْ عَلَىٰ آلِهَتِكُمْ إِنَّ هَـٰذَا لَشَيْءٌ يُرَادُ مَا سَمِعْنَا بِهَـٰذَا فِى ٱلْمِلَّةِ ٱلآخِرَةِ إِنْ هَـٰذَا إِلاَّ ٱخْتِلاَقٌ أَأُنزِلَ عَلَيْهِ ٱلذِّكْرُ مِن بَيْنِنَا\n\n\n }  يقول الحق جلّ جلاله: { وعَجِبُوا } أي: كفار قريش من { أن جاءهم مُّنذر منهم } رسول من أنفسهم، استبعدوا أن يكون الرسل من البشر\n قال القشيري: وعَجِبُوا أن جاءهم مُنذرٌ منهم، ولم يعجبوا أن يكون المنحوت إلهاً لهم، وهذه مناقضة ظاهرة\n هـ\n يعني: لأن المستحق للإعجاب إلهية المنحوت من الحجر، لا وجود منذر من البشر، وهم عكسوا القضية\n { وقال الكافرون هذا ساحر كذَّابٌ } أي: ساحر فيما يُظهر من المعجزات، كذَّاب فيما يدَّعيه من الرسالة\n وضع الظاهر موضع المضمر تسجيلاً عليهم بالكفر، وغضباً عليهم، وإشعاراً بأن كفرهم هو الذي جسرهم على هذه المقالة الشنعاء",
      "translations": []
    }
  ]
}