{
  "chapter": "ص",
  "text": "ووهبنا له اهله ومثلهم معهم رحمة منا وذكرى لاو۟لى الالبب",
  "translations": [
    {
      "translation": "We gave him back his family and the same again with them as a mercy from Us and a reminder for people of intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We restored his family to him with others similar to them, as a blessing from Us and a reminder for men of wisdom. --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted to him his family and also the like of them, as a mercy from Us, and as a reminder to people of understanding,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave him back his family and doubled their number as a blessing from Us and as a reminder to the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed his household to him and one more similar to it – as a mercy from Us, and as a remembrance for the people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him (back) his family, and along with them the like thereof, as a mercy from Us, and a reminder for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him his family and the like of them with them, as a mercy from Us, and as a reminder to those possessed of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave to him his family, and the like of them with them, as a mercy from us, and a reminder unto men possessed of minds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him (again) his household and therewith the like thereof, a mercy from Us, and a memorial for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We restored his family to him, doubling their number as an act of grace from Us, and as a reminder to all who are endowed with insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him his household and along with them the like thereof, out of mercy from us, and a remembrance Unto men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave [back] his family to him along with others like them, as a mercy from Us and an admonition for those who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him (back) his people, and doubled their number,- as a Grace from Ourselves, and a thing for commemoration, for all who have Understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him (back) his family, and along with them the like thereof, as a Mercy from Us, and a Reminder for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We restored to him to his family and like those with them, a mercy from Us and a reminder to a nation that understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We restored his family for him, and their like with them; as a mercy from Us, and a lesson for those who possess insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:43]   And We gave him [back] his family along with others like them, that is, God brought back to life all the children of his that had died and provided him with as many [in addition to them], as a mercy, a grace, from us, and a reminder, an admonition, to people of pith, possessors of intellect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُمْ مَعَهُمْ رَحْمَةً مِنَّا وَذِكْرَى لِأُولِي الْأَلْبَابِ (43)اقتصار أيوب في دعائه على التعريض بإزالة النُّصْب والعذاب يشعر بأنه لم يُصب بغير الضر في بدنه . ويحتمل أن يكون قد أصابه تلف المال وهلاك العيال كما جاء في كتاب «أيوب» من كتب اليهود فيكون اقتصاره على النُّصْب والعذاب في دعائه لأن في هلاك الأهل والمال نُصْباً وعذاباً للنفس . ولم يتقدم في هذه الآية ولا في آية سورة الأنبياء أن أيوب رُزِىءَ أهله فيجوز أن يكون معنى { ووهبنا له أهله ومثلهم معهم } أن الله أبقى له أهله فلم يصب فيهم بما يكره وزاده بنين وحفدة .ويكون فعل { وهبنا } مستعملاً في حقيقته ومجازه . ويؤيد هذا المحمل وقوع كلمة { معهم } عقب كلمة { ومثلهم } فإن ( مع ) تشعر بأن الموهوب لاحق بأهله ومزيد فيهم فليس في الآية تقدير مضاف في قوله : { ووهبنا له أهله } .وليس في الأخبار الصحيحة ما يخالف هذا إلا أقوالاً عن المفسرين ناشئة عن أفهام مختلفة . ويحتمل أن يكون مما أصابه أنه هلَك وأولاده في مدة ضرّه كما جاء في كتاب «أيوب» من كتب اليهود وأقوال بعض السلف من المفسرين فيتعين تقدير مضاف ، أي وهبنا له عوض أهله . وألفاظ الآية تنبو عن هذا الوجه الثاني .ومعنى { ومثلهم } مماثلهم . والمراد : مماثل عددهم ، أي ضعف عدد أهله من بنين وحفدة .وتقدم نظير هذه الآية في قوله : { وآتيناه أهله ومثلهم معهم رحمة من عندنا وذكرى للعابدين } في سورة \\[ الأنبياء : 84 \\] . وما بين الآيتين من تغيير يسير هو مجرد تفنّن في التعبير لا يقتضي تفاوتاً في البلاغة . وأما ما بينهما من مخالفة في قوله هنا : { وذِكرى لأُوْلِي الألباب } وقوله في سورة الأنبياء { وذكرى للعابدين ، فأما قوله هنا وذِكرى لأُوْلِي الألباب } فإن الذكر التذكير بما خفي أو بما يخفَى وأولو الألباب هم أهل العقول ، أي تذكرة لأهل النظر والاستدلال . فإن في قصة أيوب مجملها ومفصَّلها ما إذا سمعه العقلاء المعتبِرون بالحوادث والقائسون على النظائر استدلوا على أن صبره قدوة لكل من هو في حرج أن ينتظر الفرج ، فلما كانت قصص الأنبياء في هذه السورة مسوقة للاعتبار بعواقب الصابرين وكان النبي صلى الله عليه وسلم والمسلمون مأمورين بالاعتبار بها من قوله : { اصبر على ما يقولون واذكر عبدنا داود ذا الأيد } كما تقدم حُقّ أن يشار إليهم «بأولي الألباب» .وأما الذي في سورة الأنبياء فإنه جيء به شاهداً على أن النبوءة لا تنافي البشرية وأن الأنبياء تعْتريهم من الأحداث ما يعْتري البشر مما لا ينقص منهم في نظر العقل والحكمة وأنهم إنما يقومون بأمر الله ، ابتداءً من قوله تعالى : { وما أرسلنا قبلك إلا رجالاً يوحى إليهم } \\[ الأنبياء : 7 \\] وأنهم معرَّضون لأذَى الناس مما لا يخلّ بحرمتهم الحقيقية وأقصى ذلك الموت من قوله :{ وما جعلنا لبشر من قبلك الخلد أفإن مت فهم الخالدون } \\[ الأنبياء : 34 \\] .وإذ كان المشركون يقولون : { نتربص به ريب المنون } \\[ الطور : 30 \\] ، وحاولوا قتله غير مرة فعصمه الله ، ثم من قوله : { ولقد استهزىء برسل من قبلك فحاق بالذين سخروا منهم ما كانوا به يستهزئون } \\[ الأنعام : 10 \\] ثم قال : { ولقد آتينا موسى وهارون الفرقان وضياء وذكراً للمتقين الذين يخشون ربهم بالغيب وهم من الساعة مشفقون } \\[ الأنبياء : 48 ، 49 \\] ، وذُكر من الأنبياء من ابتلي من قومه فصبَر ، ومن ابتلي من غيرهم فصبَر ، وكيف كانت عاقبة صبرهم واحدة مع اختلاف الأسباب الداعية إليه . فكانت في ذلك آيات للعابدين ، أي المْمتثلين أمر الله المجتَنبين نهيَه ، فإن مما أمر به الله الصبر على ما يلحق المرء من ضرّ لا يستطيع دفعَه لكون دفعه خارجاً عن طاقته فختم بخاتمة أن في ذلك لآيات للعابدين .\n\n",
      "translations": [
        {
          "translation": "(And We bestowed on him (again) his household) which We made to perish (and therewith the like thereof) in the life of this world and it is said in the Hereafter, (a mercy from Us) a blessing from Us to him, (and a memorial) an admonition (for men of understanding) for those possessed of intellect among people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ووهبنا له أهله } قيل: كان له سبعة أبناء وسبع بنات\n فانهدم عليهم البيت في الابتلاء فهلكوا فأحياهم الله عند كشف الضرّ وإعادة أموال الكمالات عليه\n وهي إشارة إلى الروحانية والنفسانية الهالكة في التلوين واستيلاء الطبيعة البدنية أو البالغة في التلوين الأعظم وخراب البدن واستئكال الديدان إياه حتى لم يبق منه إلا القلب ولسان الاستعداد الفطري\n فأحياهم عند الإنابة والرجوع إلى حال الصحة والقوة وكشف المرض والزمانة بالشرب والغسل من العينين المذكورتين { ومثلهم معهم } باكتساب الملكات الفاضلة والأخلاق الحميدة والصفات الجميلة حتى صارت القوى الطبيعية النفسانية أيضاً روحانية في النشأة الثانية وحدوث القوى البدنية الفانية { رحمة منّا } بإفاضة الكمالات التي سألها استعداده { وذكرى } وتذكيراً { لأولي } الحقائق المجرّدة عن قشور المواد الجسمانية الذين يفهمون بسمع القلب حتى يعتبروا أحوالهم بحاله ويتذكروا ما في فطرتهم من العلوم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مخلصاً متضرعاً { وَهَبْنَا لَهُ } تتميماً لكمال لطفنا وعنايتنا معه { أَهْلَهُ } أي: جميع من مات من أولاده بسقوط السقف عليهم { وَمِثْلَهُمْ مَّعَهُمْ } أي: وهبنا له إحساناً عليه وامتناناً منَّا مثل أهله مع أهله\n وإنما فعلنا معه ذلك بعدما ابتليناه واخبترناه\n ليكون { رَحْمَةً مِّنَّا } إياه { وَذِكْرَىٰ لأُوْلِي ٱلأَلْبَابِ } [ص: 43] الذين يتذكرون بقصته\n ويتخلقون بأخلاقه\n ليفوزوا بما فاز\n\n\nوبعدما صححناه من الأسقام ووهبنا له أهله وماله\n وزدنا عليه مثله تفضلاً منَّا إياه\n أمرناه ثانياً تعليماً له بأن يتدارك قسمه وحلفه الذي حلف في مرضه\n حين ذهبت امرأته ليا أو رحمة بنت إفرائيم بن يوسف لحاجة\n فأبطأت\n فحلف: إن برئت عن مرضي لأضربنك مائة جلدة\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ووهبنا له أهلَه ومثلَهم معهم } \n قيل: أحياهم الله بأعيانهم\n وزاد مثلهم\n وقيل: جمعهم بعد تفرُّقهم\n وقيل: أعطاه أمثالهم وزاده ضِعفهم\n قال القشيري: وكان له سبع بنات\n وثلاثة بنين\n في مكتب واحد\n فحرّك الشيطانُ الأسطوانةَ\n فانهدم البيت عليهم\n هـ\n ولم يذكر كم كان له من الزوجات\n فقد سلمت منهن \" رحمة \" \n وهلك الباقي\n أعطيناه ذلك { رحمةً منا } أي: رحمة عظيمة علية من قِبلنا\n\n{ وذِكْرى لأُولي الألبابِ } أي: ولنذكرهم بذلك ليصبروا على الشدائد\n ويلتجئوا إلى الله فيما ينزل بهم لأنهم إذا سمعوا بما أنعمنا به عليه\n لِصبره\n رغَّبهم في الصبر على البلاء\n ولمّا حلف: لَيَضْربنَّ امرأته مائةَ ضربة\n حيث أبطأت عليه في حاجتها\n وقيل: باعت ذوائبها واشترت به رغيفين\n وكانت متعلق أيوب\n وقيل: طمع الشيطان فيها أن يسجد زوجُها له فيشفيه\n أمره الله تعالى ببر يمينه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.6657099168191938
    },
    {
      "verse": "2:269",
      "similarity": 0.6037176517289917
    },
    {
      "verse": "39:18",
      "similarity": 0.582410439115568
    },
    {
      "verse": "14:52",
      "similarity": 0.5552585654106355
    },
    {
      "verse": "65:10",
      "similarity": 0.5471255068232291
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}