{
  "chapter": "ص",
  "text": "وخذ بيدك ضغثا فاضرب به ولا تحنث انا وجدنه صابرا نعم العبد انه اواب",
  "translations": [
    {
      "translation": "'Take a bundle of rushes in your hand and strike with that but do not break your oath.' We found him steadfast. What an excellent slave! He truly turned to his Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take a handful of herbs,\" (We said to him), and apply and rub them, and do not make a mistake.\" We found him patient in adversity, an excellent devotee, always turning in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(and We said to him): “Take in your hand a bundle of rushes and strike with it, and do not break your oath.” Indeed We found him steadfast. How excellent a servant (of Ours) he was. Indeed he constantly turned (to his Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told him, \"Take a handful of straw. Strike your wife with it to fulfill your oath.\" We found him to be patient. What an excellent servant he was. He was certainly most repenting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said, “Take a broom in your hand and strike her with it, and do not break your vow”; We indeed found him patiently enduring; what an excellent bondman! He is indeed most inclined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And take in your hand a bundle of thin grass and strike therewith (your wife), and break not your oath.\" Truly, We found him patient. How excellent a servant! Verily, he was ever oft-returning in repentance (to Us)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And take in your hand a green branch and beat her with It and do not break your oath; surely We found him patient; most excellent the servant! Surely he was frequent in returning (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, 'Take in thy hand a bundle of rushes, and strike therewith, and do not fail in thy oath.' Surely We found him a steadfast man. How excellent a servant he was! He was a penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it was said unto him): Take in thine hand a branch and smite therewith, and break not thine oath. Lo! We found him steadfast, how excellent a slave! Lo! he was ever turning in repentance (to his Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said to Him, \"Take a handful of twigs in your hand and strike with that but do not break your oath.\" We found him steadfast. What an excellent servant! He turned constantly to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And take in thine hand a handful of twigs, and strike therewith, and break not thine oath. Verily We! We found him patient. How excellent a bondman! Verily he was oft-returning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We told him:] ‘Take a faggot in your hand and then strike [your wife] with it, but do not break [your] oath.’ Indeed, We found him to be patient. What an excellent servant! Indeed he was a penitent [soul].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And take in thy hand a little grass, and strike therewith: and break not (thy oath).\" Truly We found him full of patience and constancy. How excellent in Our service! ever did he turn (to Us)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And take in your hand a bundle of thin grass and strike therewith (your wife), and break not your oath. Truly! We found him patient. How excellent (a) slave! Verily, he was ever oft-returning in repentance (to Us)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We said to him): 'Take a bundle of rushes and strike with it; and do not break your oath' We found him to be patient, a good worshiper and he was penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Take with your hand a bundle, and strike with it, and do not break your oath.” We found him patient. What an excellent servant! He was obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We said], \"And take in your hand a bunch [of grass] and strike with it and do not break your oath.\" Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:44] And [We said to him], ‘Take in your hand a bunch of twigs, or some blades of grass, and smite therewith, your wife — for he had sworn to smite her a hundred times on one occasion when she was late in coming to him — and do not break [your] oath’, by not smiting her: so he took a hundred rushes and smote her with them once [and that sufficed to fulfil his oath]. Truly We found him to be steadfast. What an excellent servant!, [was] Job. Indeed he was a penitent [soul], always returning to God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (it was said unto him): Take in thine hand) Job (a branch) of 100 spikes of grain (and smite therewith) and smite with it your wife, Rahmah the daughter of the Prophet Joseph, (and break not thine oath) this is because he vowed before that if Allah were to cure him, he would flog his wife 100 lashes because she said something which did not please Allah. (Lo! We found him steadfast) in trial, (how excellent a slave! Lo! he was ever turning in repentance (to his Lord)) he is ever obedient to Allah and betaking himself to Allah's obedience.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَخُذْ بِيَدِكَ ضِغْثاً } معناه أثلٌ\n وقال: جماعةٌ من شجرٍ وقال: حُزمةٌ من رطبةٍ\n\n\n\n\nوقوله تعالى: { إِنَّهُ أَوَّابٌ } بمعنى تَوابٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd take in your hand a stick { } which means a club.\n\n\nAnd he said, \"A group of trees,\" and he said, \"A bundle of fresh dates.\"\n\n\nAnd His saying, \"Indeed, He is the responder,\" [means that] He is the One who responds [to His servants].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ وخذ بيدك ضغثاً } قيل: إنه حلف في مرضه ليضربن امرأته مائة إن برىء، واختلف في سبب حلفه فقيل: أبطأت ذاهبة في حاجة، وقيل: أوهمها الشيطان أن تسجد له سجدة ليردّ أموالهم الذاهبة، وقيل: باعت ذؤابتين لها برغيفين وكانتا متعلق أيوب عند قيامه. وقيل: أشارت إليه ليشرب الخمر، كلها إشارات إلى التلوين المذكور بظهور النفس بإبطائها وتكاسلها في الطاعات أو طاعة شيطان الوهم وانقيادها له في تمني الحظوظ وترك ما يتعلق به القلب في القيام عن مرقد البدن والتجرّد عن الهيئات المنشطة المشجعة من العلوم النافعة والأعمال الفضيلة، واستبدال الحظوظ القليلة المقدار، اليسيرة الوقع، والخطر بها، أو المراءاة بها، لاستجلاب حظ النفس أو شرب خمر الهوى والميل إلى ما يخالف العقل. وحلفه إشارة إلى نذره المخالفات والرياضات المتعبة والمجاهدات المؤلمة أو ما ركز في استعداده في محبته التجريد والتزكية بالرياضة وعزيمة تأديب النفس بالأخلاق والآداب بالمخالفات المؤلمة بمقتضى العهد الأول وحكم ميثاق الفطرة وأخذ الضغث. والضرب به إشارة إلى الرخصة والطريقة السهلة السمحة من تعديل الأخلاق بالاقتصار على الأوساط والاعتدالات من الرياضات والمخالفات لصفاء الاستعداد وشرف النفس ونجابة جوهرها دون الإفراط فيها، والأخذ بالعزائم الصعبة كما قال عليه الصلاة والسلام:\n \" بعثت بالحنيفية السمحة السهلة \". \n{ ولا تَحْنث } بترك التأديب بالكلية ونقص العزيمة في طلب الكمال، وترك الوفاء بالنذر الفطري { إنّا وجدناه صابراً } في بليته وطلبه للكمال، فرحمناه، وليس كل طالب صابراً { نِعْمَ العبد إنه } رجّاع إلى الله بالتجرّد والمحو والفناء.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قلنا له تعليماً: { خُذْ بِيَدِكَ } لحلفط { ضِغْثاً } حزمة مشتملة على مائة من إغصان صغار\n فاضرب به - أي: بالضغث - امرأتك بحيث وصل أثر جميع ما في الحزمة من الأغصان إليها { فَٱضْرِب بِّهِ وَلاَ تَحْنَثْ } حينئذ في حلفك\n فحللنا يمينك بها\n عناية منَّا لك ولأمرأتك\n فصارت رخصة باقية في حدود الشرائع إلى الآن\n\n\nوكيف لا نزيل شكواه\n ولا نحسن إليه\n ولا نجزيه أحسن الجزاء؟ { إِنَّا وَجَدْنَاهُ } عبداً { صَابِراً } لجميع ما هجم عليه من أنواع البلاء المتعلقة بماله وأولاده وبدنه { نِّعْمَ ٱلْعَبْدُ } عبدنا أيوب الصبور المسلِّم المفوض بلا جزع وتزعزع\n فكيف يجزع ويتزعزع { إِنَّهُ أَوَّابٌ } [ص: 44] رجَّاع الينا\n متشمر نحونا في عموم أوقاته وحالاته\n طلباً للفناء فينا والبقاء ببقائنا\n\n\nروي أن أيوب عليه السلام كان متمولاً منعماً عظيماً\n وكان له جميع أنواع متاع الدنيا\n ومع ذلك شاكراً راضياً منفقاً في سبيل الله لفقراء الله طلباً لمرضاته\n وبعدما بالغ في شكر نعم الله وأداء حقوق كرمه\n حسد عليه إبليس فقال مناجياً إلى الله: نظرت في عبدك أيوب فوجدته عبداً أنعمت عليه فشكر لك\n ولو ابتليته بالفاقة لم يكن كذلك\n فقال سبحانه: \" سلطتك يا ملعون علا ماله \" فقال: إبليس لعفاريت: أيكم أشد وأقوى على إتلاف ماله؟ فقام أحدهم وتحول إعصاراً من نار فأحرق إبله\n وجميع من كان معها من الراعي\n وصاح أحدهم منهم على أغنامه ورعاتها فهلكوا بالمرة\n وآخر جاء بريح عاصفة على حرثه فنسفت ولم يبقَ منهما شيء\n\n\nفتمثل إبليس بصورة راعٍ\n وآخر من أعوانه بصورة حارث\n وأتياه وهو يصلي وقالا: أقبلت نار فغشيت إبلك فأحرقتها ومن معها\n وصاح على غنمك شيطان فهلكت بالمرة\n وهبت على حرثك ريح فنسفت وصار كأن لم يكن\n فقال أيوب: الحمد لله إنها مال الله أعارينها وهو أولى بها\n وقد كنت قدماً قد وطنت نفسي ومالي على القضاء\n\n\nوبعدما آيس إبليس من هذا الطريق قال: إلهي إنك متعته بأولاد فشكر لك لأجلها\n فهل أنت مسلطي على أولاده\n إذ هي من أعظم المصيبات لا يصبر عليها أحد من الناس؟ فقال: \" نعم \" \n فأتاهم اللعين وهم مجتمعون في قصر عند معلم أ>يب\n فلم يزل يزلزلها ويحركها حتى أسقطها عليهم فأهلكهم بالمرةن فتمثل اللعين بصورة معلهم فأتاه وهو صريخ جزوع\n فقال: لو رأيت بنيك كيف عذبوا\n ونكسوا إلىحيث سال دمهم ودماغهم وشقت بطونهم وتناثرت أمعاؤهم\n فقال أيوب عليه السلام متأوهاً: ليت أمي لم تلدني\n ثم أفاق واستغفر عن ضجرته سريعاً\n\n\nورجع خاسئاً وقنط اللعني من هذا أيضاً\n وقال: إليه إنما صبر أيوب عليه السلام على إهلاك أمواله وأولاده\n ولازم توجهه نحوك\n لأنك متعته بصحة البدن وسلامة الجسد\n وهل أنت مسلطي على جسده؟ قال سبحانه: \" سلطتك على غير لسانه وقلبه\n فأتاه فوجده ساجداً\n فنفخ في منخره نفخة اشتغل منها جسده\n فخرج من قرنه إلى قدمه ثآليل مثل أليات الغنم\n فوقعت فيه حكة فلم يزل يحكه حتى قرح جسده وأنتن لحمه\n فأخرجه أهل القرية منها\n ورفضوه من كان من أرحامه سوى امرأته \" رحمة \" فتمثل لها إبليس في صورة رجل\n فقال لها: أين بعلك؟ هو ذلك يحك قروحه وتردد الديدان في جسده\n\nفلما سمعتها خيلت أنها كلمة جزع صدرت منه\n فذكر لها تغريراً ما كان فيه من النعيم ثم أتى بسخلة\n فقال لها: ادفعيها إلى أيوب عليه السلام ليذبح لي حتى يبرأ من السقم فجاءت مع السخلة تصرخ يا أيوب إلى متى يعذبك ربك أين الأموالم والأولاد والوجه الحسن؟! اذبح هذه واسترح\n فقال أيوب: أتاك عدو الله فنفخ فيك\n أرأيت ما تبكين عليه من المال والولد الصحة من أعطانيه؟ قالت: الله\n قال: فكم متعنا به؟ قالت: ثمانين سنة\n قال: فمنذ كم ابتلينا؟ قالت: سبع سنين وأشهراً\n قال: ويلك ما أنصفت لنصبرن في هذا البلاء ثمانين سنة كما لنا في الرخاء\n أمَا تستحين من الله؟! أمرتني أن أذبح لعدو الله\n لا أذوق شيئاً مما تأتيني به بعد اليوم\n اعزلي عني ودعي معي ربي\n\n\nفلما ذهبت امرأته ورأى أيوب ليسي عنده طعام ولا شراب ولا صديق\n اضطر إلى بث الشكوى مع المولى فسقط ساجداً\n وقال مناجياً صارخاً ضارعاً: { أَنِّي مَسَّنِيَ ٱلشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ } [ص: 41] وسمع حنيئذ من الهاتف: ارفع رأسك فقد استجبت لك\n فرفع رأسه وأوحي إليه من قبل ربه { ٱرْكُضْ بِرِجْلِكَ هَـٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ } [ص: 42]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { وخُذْ بيدك ضِغْثاً } حُزمة صغيرة من حشيش أو رَيحان\n وعن ابن عباس رضي الله عنه: قبضة من الشجر\n { فاضرِبْ به ولا تَحْنَثْ } \n وهذه الرخصة باقية عند الشافعي وأبي حنيفة\n خلافاً لمالك لأن الأَيْمَان عنده مبنية على الأعراف\n قال تعالى: { إِنَّا وجدناه } علمناه { صابراً } على البلاء\n وأما شكواه فليست جزعاً\n بل رجوعاً إلى مولاه\n على أنه عليه السلام إنما طلب الشفاء خيفة على قومه\n حيث كان الشيطانُ يوسوس إليهم: لو كان نبيّاً لما ابتلي بمثل ما ابتلي به\n وإرادة القوة على الطاعة\n فقد بلغ أمره إلى أن لم يبقَ منه إلا القلب واللسان\n قلت: طلب الشفاء لا ينافي الرضا لأن العبد ضعيف\n لا قوة له على قهرية الحق\n ثم قال تعالى: { نِعْمَ العبدُ إِنه أوَّابٌ } رجَّاع إلى الله تعالى\n قال القشيري: لم يشغله البلاء عن المُبْلِي\n وهو تعليل لمرضه\n الإشارة: كثير من الصوفية اختاروا البلاء على العافية\n وبعضهم اختار العافية\n قال عليّ رضي الله عنه: لأَن أُعطَى فأَشكر أحبُّ إِليَّ من أن أُبتلى فأَصبرِ\n أي: لأنه طريق السلامة\n وبه وردت الأحاديث\n والأولى للعبد ألا يختار مع سيده شيئاً\n بل يكون مفوضاً مستسلماً\n يتلقى ما يرد عليه بالترحيب\n أيّ شيء كان\n وبالله التوفيق\n ثم ذكر إبراهيم وبنيه\n فقال: { وَٱذْكُرْ عِبَادَنَآ إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:46",
      "similarity": 0.611915961351603
    },
    {
      "verse": "12:44",
      "similarity": 0.4936900896689178
    },
    {
      "verse": "21:5",
      "similarity": 0.47280915686067065
    },
    {
      "verse": "38:17",
      "similarity": 0.12426995222971014
    },
    {
      "verse": "78:39",
      "similarity": 0.12290401939791475
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/38:44.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/38:44.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}