{
  "chapter": "ص",
  "text": "هذا ذكر وان للمتقين لحسن مـاب",
  "translations": [
    {
      "translation": "This is a Reminder. Those who have taqwa will have a good Homecoming:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a commemoration. Surely for those who take heed for themselves is an excellent place of return --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was a remembrance. An excellent retreat awaits the God-fearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is their noble story. The pious ones will certainly have the best place to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an advice; and indeed for the pious is an excellent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Reminder. And verily, for those who have Taqwa is a good final return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a reminder; and most surely there is an excellent resort for those who guard (against evil),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Remembrance; and for the godfearing is a fair resort,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a reminder. And lo! for those who ward off (evil) is a happy journey's end,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Reminder. The righteous shall have a good place to return to:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an admonition, and verily for the God-feoring is a happy retreat:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Reminder, and indeed the Godwary have a good destination:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Message (of admonition): and verily, for the righteous, is a beautiful Place of (Final) Return,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Reminder, and verily, for the Muttaqun (pious and righteous persons - see V. 2:2) is a good final return (Paradise),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Reminder, and indeed for the cautious is a fine return,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a reminder. The devout will have a good place of return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a reminder. And indeed, for the righteous is a good place of return\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:49] This is a remembrance, of them, [made] by [the mention of] fair praise [of them] here; and indeed for the God-fearing, who comprise them, there will truly be a fair return, in the Hereafter —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This is a reminder) this is a remembrance of the righteous; it is also said that this means: this Qur'an contains the events of the people of old as well as of future generations. (And lo! for those who ward off (evil)) disbelief, idolatry and indecent acts (is a happy journey's end) a happy return in the Hereafter,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَـٰذَا } الذي يتلى عليكم من الأمر بتذكير أولئك الثقات الكرام { ذِكْرٌ } جميل وإثبات شريف وكمال لهم، إنما ذكرناهم وأمرناك بذكرهم تنبيهاً على جلال قدرهم وعظم شأنهم { وَ } بالجملة: { إِنَّ لِلْمُتَّقِينَ } المجتنبين عن محظوراتنا، المتصفين بمأموراتنا، الطالبين لمرضاتنا، الهاربين من سخطنا وانتقاماتنا { لَحُسْنَ مَآبٍ } [ص: 49] عندنا، وخير منقلب ومتاب في كنف جوارنا وساحة عز قبولنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}