{
  "chapter": "ص",
  "text": "واذكر عبدنا ايوب اذ نادى ربه انى مسنى الشيطن بنصب وعذاب",
  "translations": [
    {
      "translation": "Remember Our slave Ayyub when he called on his Lord: 'Shaytan has afflicted me with exhaustion and suffering.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Our votary Job because he called to his Lord: \"Satan has afflicted me with disease and distress.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servant Job: when he cried to his Lord: “Behold, Satan has afflicted me with much hardship and suffering.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), recall Our servant Job. When he prayed to his Lord saying, \"Satan has afflicted me with hardship and torment,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our bondman Ayyub (Job); when he cried out* to his Lord, “The devil has struck me with hardship and pain.” (After seven years of patience.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servant Ayyub, when he invoked his Lord (saying): \"Verily, Shaytan has afflicted me with distress and torment!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servant Ayyub, when he called upon his Lord: The Shaitan has afflicted me with toil and torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember also Our servant Job; when he called to his Lord, 'Behold, Satan has visited me with weariness and chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make mention (O Muhammad) of Our bondman Job, when he cried unto his Lord (saying): Lo! the devil doth afflict me with distress and torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring to mind Our servant Job who cried to his Lord, \"Satan has afflicted me with distress and suffering.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember thou Our bondman Ayyub, what time he cried Unto his Lord: verily the Satan hath touched me with affliction and suffering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servant Job [in the Quran]. When he called out to his Lord, ‘The devil has visited on me hardship and torment,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Commemorate Our Servant Job. Behold he cried to his Lord: \"The Evil One has afflicted me with distress and suffering!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our slave Ayub (Job), when he invoked his Lord (saying): \"Verily! Shaitan (Satan) has touched me with distress (by losing my health) and torment (by losing my wealth)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, remember Our worshiper Job. He called out to his Lord, (saying): 'satan has afflicted me with harm and pain'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention Our servant Job, when he called out to his Lord, “Satan has afflicted me with hardship and pain.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servant Job, when he called to his Lord, \"Indeed, Satan has touched me with hardship and torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:41] And mention also Our servant Job, when he called out to his Lord, [saying], ‘Lo! Satan has afflicted me with hardship, harm, and suffering’, pain: he attributes all this to Satan, even though all things are from God, to show reverence [in his call] to Him, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And make mention (0 Muhammad) of Our bondman) mention to the disbelievers of Mecca the event of Our bondman (Job, when he cried) when he prayed (unto his Lord (saying): Lo! the devil doth afflict me) I am 524 afflicted because You set Satan on me (with distress) toil and tiredness (and torment) trial and sickness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنِّي مَسَّنِيَ ٱلشَّيْطَانُ بِنُصْبٍ } معناه ببلاءٍ وشرٍ في جَسدي { وَعَذَابٍ } في بَدني!\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱذْكُرْ } يا أكمل الرسل { عَبْدَنَآ أَيُّوبَ } هو ابن عيص بن اسحاق، وامرأته ليّا بنت يعقوب، أضافه سبحانه إلى نفسه لكمال رضاه منه ولطفه معه؛ حيث صبر على ما مضى عليه من بلائه وجرى عليه من قضائه، كما شكر على آلائه ونعمائه، ولم ينقص من إخلاصه جالتي السراء والضراء\n\n\n\n\nاذكر يا أكمل الرسل كمال تصبر أخيك أيوب، وإخلاصه في توجهه إلينا للمتذكرين المعتبرين من أمتك؛ كي يتذكروا من قصته، ويتخلقوا بشيء من تصبره وتمكنه في مقر التفويض والتسليم { إِذْ نَادَىٰ رَبَّهُ } الذي رباه بين الخوف والرجاء وأنواع العناء والعطاء؛ لكمال اصطباره ووقاره بما جرى عليه من مقتضيات ربه، قائلاً حين اضطراره إلى الالتجاء نحو ربه والتضرع إليه: { أَنِّي مَسَّنِيَ ٱلشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ } [ص: 41] أي: نفخ فيَّ، وأحاط نفخه جميع أجزاء بدني؛ بحيث لم يبقَ فيَّ عضو لم يلحقه ضرر من شؤم نفخه، وعذاب شديد مؤلم مزعج، فاضطرني هجوم الأعداء والعناء وتزول أنواع المحن والبلاء إلى بث الشكوى نحوك يا مولاي، فأنا عبدك، وعلى عهدك ما استطعت، ما توفيقي إلا بك وثقتي إلا عليك، فارحمني بسعة رحمتك؛ إذ لا راحم سواك ولا مغيث غيرك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { واذكر عبدنَا أيوبَ } ، وهو ابن عيصو بن إسحاق عليه السلام، أي: من ذريته لأنه بعد يوسف، وامرأته: رحمة بنت إفراثيم بن يوسف\n { إِذ نادى ربَّه } ، وهو بدل اشتمال من \" عبدنا \"\n و \" أيوب \": عطف له، { أَنِّي } أي: بأني { مسني الشيطان بنُصْبٍ } أي: تعب، وفيه قراءات بفتحتين، وبضمتين، وبضم وسكون، وبنصب وسكون\n { وعذابٍ } أي: ألم، يريد ما كان يقاسيه من فنون الشدائد، وهو الضر في قوله:\n\n[الأنبياء: 83]، وهو حكاية لكلامه الذي ناداه به، وإلا لقيل: إنه مسّه\n وإسناده إلى الشيطان على طريق الأدب في إسناد ما كان فيه كمال إلى الله تعالى، وما كان فيه نقص إلى الشيطان أو غيره، كقول الخليل:\n\n[الشعراء: 80] ولم يقل: أمرضني\n وكقول يوشع عليه السلام:\n\n[الكهف: 63]\n وفي الحقيقة: كلٌّ من عند الله\n وقيل: أراد ما كان يوسوس به إليه في مرضه، من تعظيم ما نزل به من البلاء، ويغريه على الكراهة والجزع، فالتجأ إلى الله في أن يكفيه ذلك، بكشف البلاء، أو بدفعه وردّه بالصبر الجميل\n ورُوي: أنه كان يعوده ثلاثة من المؤمنين، فارتدّ أحدهم، فسأل عنه، فقيل: ألقى إليه الشيطان: أن الله لا يبتلي الأنبياء والصالحين، فشكا ذلك إلى ربه\n وذكر في سبب بلائه أنه ذبح شاة فأكلها، وجاره جائع، أو: رأى منكراً فسكت عنه، أو: استغاثه مظلوم فلم يغثه، أو: كانت مواشيه في ناحية ملك كافر، فداهنه، فلم يغزه، أو: سؤاله امتحاناً لصبره، أي: هل يصبر أم لا، أو: ابتلاه لرفع درجاته بلا سبب، وهو أولى",
      "translations": []
    }
  ]
}