{
  "chapter": "ص",
  "text": "انا اخلصنهم بخالصة ذكرى الدار",
  "translations": [
    {
      "translation": "We purified their sincerity through sincere remembrance of the Abode.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We distinguished them for the distinct remembrance of the abode (of the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We exalted them in consideration of a sterling quality: their remembrance of the Abode of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave them this pure distinction because of their continual remembrance of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed gave them distinction with a genuine affair – the remembrance of the (everlasting) abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We did choose them by granting them the remembrance of the Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We purified them by a pure quality, the keeping in mind of the (final) abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We purified them with a quality most pure, the remembrance of the Abode,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We purified them with a pure thought, remembrance of the Home (of the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We chose them for a special [purpose] -- proclaiming the message of the Hereafter:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We distinguished them with a distinct quality: the remembrance of the Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We purified them with exclusive remembrance of the abode [of the Hereafter].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We did choose them for a special (purpose)- proclaiming the Message of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We did choose them by granting them (a good thing, i.e.) the remembrance of the home [in the Hereafter and they used to make the people remember it, and also they used to invite the people to obey Allah and to do good deeds for the Hereafter].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We purified them with a most pure quality, the remembrance of the Everlasting Life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We distinguished them with a distinct quality: the remembrance of the Home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:46] Assuredly We purified them with an exclusive [thought], namely, the remembrance of the Abode, of the Hereafter: in other words to [always] remember it and to work for it (a variant reading [for bi-khālisatin dhikrā’l-dār] has the genitive construction [bi-khālisati dhikrā’l-dār], making this [dhikrā al-dār, ‘remembrance of the Abode’] the explicative thereof).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We purified them with a pure thought) We selected them, (remembrance of the Home (of the Hereafter) for the remembrance of Allah and the remembrance of the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّآ أَخْلَصْنَاهُمْ بِخَالِصَةٍ ذِكْرَى ٱلدَّارِ } معناه مالَهم همٌ إلاّ هَم الآخرةِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Indeed, We have purified them with a pure [intention] as a remembrance of the [final] home} - this means that their wealth is for them nothing but a reminder of the hereafter.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا { إِنَّآ } من مقام عظيم جودنا معهم { أَخْلَصْنَاهُمْ } وجعلناهم مخصوصين { بِخَالِصَةٍ } أي: بخصلة خالصة صافية عن كدر التعلقات الناسوتية، خالية عن شوب مقتضيات القوى الشهوية البشرية، العائقة عن التحقق بمرتبة اللاهوتية ألا وهي { ذِكْرَى ٱلدَّارِ } [ص: 46] الدار الآخرة التي هي مقام التمكن في التوحيد والانكشاف بسرائر الوحدة الذاتية، وسريانها في ملابس الأسماء والصفات المقتضية للتعدد والتكثر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنا أخلصناهم بخالصةٍ } أي: جعلناهم خالصين لنا بخصلة عظيمة الشأن، لا شوب فيها، هي { ذِكْرَى الدَّارِ } أي: تذكر للدار الآخرة على الدوام، فإنَّ خلوصهم في الطاعة بسبب تذكرهم لها، وذلك لأن مطمح أنظارهم، ومسرح أفكارهم، في كل ما يأتون وما يذرون، جوار الله عزّ وجل، والفوز بلقائه، ولا يتأتى ذلك على الدوام إلا في الآخرة، فمطلبهم إنما هو الجوار والرؤية\n لا مجرد الحضور في تلك الدار، كما قال ابن الفارض رضي الله عنه:\n\nقال ابن عطية: يحتمل أن يكون معنى الآية: { إِنا أخلصناهم } بأن خلص لهم التذكير بالدار الآخرة، ودعاء الناس إليها، أي: وتزهيدهم في الدنيا، كما هو دَيدن الأنبياء والرسل\n وهذا قول قتادة، أو: إنا أخلصناهم بأن خلص لهم ذكرهم للدار الآخرة وخوفهم والعمل بحسب ذلك\n وهذا قول مجاهد\n هـ\n قلت: مرتبة الرسل تنافي العمل لحرف، فإنَّ أولياء هذه الأمة تحرّروا من العمل للحرف، بل عبدوا الله شكراً ومحبة وعبودية، لا طمعاً في شيء، فكيف بأكابر الرسل\n وإطلاق الدار للإشعار بأنها الدار في الحقيقة، وإنما الدنيا معبر إليها\n ومَن قرأ بالإضافة، فمن إضافة الشيء إلى ما بيَّنَهُ لأن الخالصة تكون ذكرى وغير ذكرى، و \" ذكرى \": مصدر مضاف إلى المفعول، أي: بإخلاصهم ذكرى الدار\n وقيل: خالصة بمعنى خلوص، وهي مضافة إلى الفاعل، أي: بأن خلصت لهم ذكرى الدار، على أنهم لا يشوبون ذكرى الدار بشيء آخر، إنما همّهم ذكرى الدار الآخرة لجوار الحبيب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:169",
      "similarity": 0.6953618248726786
    },
    {
      "verse": "15:40",
      "similarity": 0.6930901525060005
    },
    {
      "verse": "38:83",
      "similarity": 0.6930901525060005
    },
    {
      "verse": "37:40",
      "similarity": 0.6920811203923253
    },
    {
      "verse": "37:74",
      "similarity": 0.6920811203923253
    }
  ]
}