{
  "chapter": "ص",
  "text": "واذكر عبدنا ابرهيم واسحق ويعقوب او۟لى الايدى والابصر",
  "translations": [
    {
      "translation": "And remember Our slaves Ibrahim, Ishaq and Ya'qub, men of true strength and inner sight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Our votaries Abraham, Isaac and Jacob, men of power and insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servants -- Abraham, Isaac and Jacob -- they were endowed with great strength and vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), recall Our servants Abraham, Isaac, and Jacob, all of whom possessed virtuous hands and clear visions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our bondmen Ibrahim, and Ishaq, and Yaqub – the men of power and knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servants, Ibrahim, Ishaq, and Ya`qub, Ulil-Aydi wal-Absar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servants Ibrahim and Ishaq and Yaqoub, men of power and insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember also Our servants Abraham, Isaac and Jacob -- men of might they and of vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make mention of Our bondmen, Abraham, Isaac and Jacob, men of parts and vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Our servants Abraham, Isaac, and Jacob -- possessors of strength and vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember thou Our bond men, Ibrahim and Is-haq and Ya'qub. owners of might ana insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servants, Abraham, Isaac and Jacob, men of strength and insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And commemorate Our Servants Abraham, Isaac, and Jacob, possessors of Power and Vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our slaves, Ibrahim (Abraham), Ishaque (Isaac), and Ya'qub (Jacob), (all) owners of strength (in worshipping Us) and (also) of religious understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, remember Our worshipers Abraham, Isaac, and Jacob, those of might and vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention Our servants Abraham, Isaac, and Jacob—endowed with ability and vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Our servants, Abraham, Isaac and Jacob - those of strength and [religious] vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:45] And mention [also] Our servants Abraham, and Isaac and Jacob — men of fortitude, vigorous in their worship, and insight, deep understanding of religion (a variant reading [for ‘ibādanā, ‘Our servants’] has [singular] ‘abdanā, ‘Our servant’, with Ibrāhīma as the explication thereof, and what follows as being a supplement to ‘abdanā, ‘Our servant’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And make mention of our bondmen, Abraham) the friend of the Beneficent, (Isaac and Jacob, men of parts) men of strength in the worship of Allah (and vision) regarding Religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أُوْلِي ٱلأَيْدِي وَٱلأَبْصَارِ } فالأيدي: القوةُ في العَملِ\n والأَبصارُ: العُقولُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱذْكُرْ } يا أكمل الرسل { عِبَادَنَآ } الذين هم أجدادك وأسلافك { إِبْرَاهِيمَ وَ } ابنه { إِسْحَاقَ وَ } سبطه { يَعْقُوبَ } واذكر من شمائلهم الجميلة وخصائلهم الحميدة؛ ليتعظ من سماعها ذوو الاعتبار من المؤمنين، ويقتدون بمآثرهم؛ لأنهم كانوا { أُوْلِي ٱلأَيْدِي وَٱلأَبْصَارِ } [ص: 45] أي: ذوي القوة في الطاعة والبصيرة في مراسم الدين ومعالم اليقين، ولهم التمكن في مقر التوحيد، والوصول إلى درجات التجريد والتفريد\n\n\n\n\nولا بدَّ للذين يلونهم أن يقتدوا بهم، ويسترشدوا من أخلاقهم وآثارهم، ويتصفوا بأوصافهم؛ كي يفوزوا بمعارفهم، وينكشفوا بمكاشفتهم ومشاهدتهم؛ لأنهم قدوة أصحاب التوحيد، وزبدة أرباب الشهود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { واذكر عبادنا } ، وقرأ المكي: \" عبدنا \" ، إما على إرادة الخبر، وإما أن يريد \" إبراهيم \" وحده لشرفه، ثم عطف عليه من بعده، ثم بيَّنهم بقوله: { إِبراهيمَ وإِسحاقَ ويعقوبَ أُولي الأيدي والأبصارِ } أي: أُولي القوة في الطاعة والبصيرة في الدين، أو: أُولي الأعمال الجليلة، والعلوم الشريفة\n فعبَّر بالأيدي عن الأعمال لأن أكثرها تُباشر بها، وبالأبصار عن المعارف لأنها أقوى مبادئها\n وفيه تعريض بالجهلة الباطلين، كأنهم كالزّمنى والعماة، وتوبيخ على ترك المجاهدة والفكرة مع تمكنهم منهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:38",
      "similarity": 0.626986381442957
    },
    {
      "verse": "29:27",
      "similarity": 0.6027663820327841
    },
    {
      "verse": "2:133",
      "similarity": 0.5648775175678419
    },
    {
      "verse": "12:6",
      "similarity": 0.5447021952470953
    },
    {
      "verse": "19:49",
      "similarity": 0.5435914999690682
    }
  ]
}