{
  "chapter": "ص",
  "text": "اجعل الءالهة الها وحدا ان هذا لشىء عجاب",
  "translations": [
    {
      "translation": "Has he turned all the gods into One God? That is truly astonishing!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he turned so many gods into one deity? This is indeed a strange thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he made the gods one single God? This is truly astounding.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Has he condemned all other gods but One? This is certainly strange\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Has he made all the Gods into One God? This is really something very strange!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he made the gods into One God. Verily, this is a curious thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! makes he the gods a single Allah? A strange thing is this, to be sure!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has he made the gods One God? This is indeed a marvellous thing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maketh he the gods One Allah? Lo! that is an astounding thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he make all the deities out to be one God? This is indeed a strange thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maketh he the gods One God? Verily that is a thing astounding!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Has he reduced the gods to one god? This is indeed an odd thing!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he made the gods (all) into one Allah? Truly this is a wonderful thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he made the aliha (gods) (all) into One Ilah (God - Allah). Verily, this is a curious thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has he made the gods One God? This is indeed a wondrous thing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Did he turn all the gods into one God? This is something strange.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he made the gods [only] one God? Indeed, this is a curious thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:5] Has he made the gods One God? — for he had said to them, ‘Say: there is no god except God’ — in other words [they objected]: how could one god suffice for all of creation? Lo! that is indeed a curious thing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "520 (Maketh he the gods One God) could one God be sufficient to fulfil all our needs, as Muhammad claims? (Lo! That) which Muhammad says (is an astounding thing) is a bizarre thing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفنفروا من ذلك، وقاموا قائلين على سبيل الإنكار والاستبعاد: { أَجَعَلَ ٱلآلِهَةَ إِلَـٰهاً وَاحِداً } فمن أنَّى يسع الإله الواحد للخلق الكثير؟ { إِنَّ هَـٰذَا } الذي يطلب هذا المدعي { لَشَيْءٌ عُجَابٌ } [ص: 5] أي: عجيب بديع ابتدعه من تلقاء نفسه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قالوا: { أجَعَلَ الآلهةَ إلهاً واحداً } بأن نفى الألوهية التي كانت لآلهتهم وقصرها على واحد، { إِنَّ هذا لشيءٌ عُجَابٌ } بليغ في العجب، وذلك لأنه خلاف ما ألفوا عليه آباءهم، الذين أطبقوا على عبادة آلهتهم، كابراً عن كابر، فإنَّ مدار كل ما يأتون ويذورن، من أمور دينهم، هو التقليد والاعتياد، فيَعُدون ما يخالف ما اعتادوه عجباً من العجاب، بل محالاً، وأما جعل مدار تعجبهم عدم وفاء علم الواحد، وقدرته بالأشياء الكثيرة، فلا وجه له لأنهم لا يدّعون أن لآلهتهم علماً وقدرة ومدخلاً في حدوق شيءٍ من الأشياء، حتى يلزم من ألوهيتهم بقاء الأثر بلا مؤثر، قاله أبو السعود منتقداً على البيضاوي\n قال القشيري: لم تباشر خلاصةُ التوحيد قلوبَهم، وبُعدوا عن ذلك تجويزاً، فضلاً عن أن يكون إثباتاً وحكماً، فلا عَرَفُوا أولاً معنى الإلهية فإن الإلهية هي القدرة على الاختراع\n وتقديرُ قادِرَيْن على ذلك غيرُ صحيح لِمَا يجب من وجود التمانع بينهما وجوازه، وذلك يمنع من كمالها، ولو لم يكونا كامِلَي الوصفِ لم يكونا إِلَهيْن، وكلُّ مَن جرّ ثبوته لسقوطه فهو مطرح باطل\n هـ\n رُوي أنه لما أسلم عمر رضي الله عنه فرح به المؤمنون، وشقّ على قريش، فاجتمع خمسة وعشرون نفساً من صناديدهم، ومشوا إلى أبي طالب، وقالوا: أنت كبيرنا، وقد علمت ما فعل هؤلاء السفهاء ـ أي: الذين دخلوا في الإسلام ـ وجئناك لتقضي بيننا وبين ابن أخيك، فاستحضر أبو طالب رسولَ الله صلى الله عليه وسلم، فقال: يا ابن أخي هؤلاء قومك يسألونك السواء، فلا تَمِلْ كل الميل على قومك، فقال ـ عليه الصلاة والسلام ـ:\n\n \" ماذا يسألونني؟ \" \n\nفقالوا: ارفضنا وارفض ذكر آلهتنا، وندعك وإلهك، فقال ـ عليه الصلاة والسلام ـ:\n\n\n\n \" أعطوني كلمة واحدة تملكون بها العرب، وتدين لكم العجم \" \n\n، قالوا: نعم، وعشراً\n قال:\n\n \" قولوا: لا إله إلا الله \" \n\nفقاموا، وقالوا: { أجعل الآلهة إلهاً واحداً إن هذا لشيء عُجاب }\n قيل: العجب: ما له مِثل، والعجاب: لا مثل له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:2",
      "similarity": 0.6667005768293159
    },
    {
      "verse": "53:59",
      "similarity": 0.6520825464364468
    },
    {
      "verse": "38:4",
      "similarity": 0.5931667077211523
    },
    {
      "verse": "37:12",
      "similarity": 0.564089105635837
    },
    {
      "verse": "7:63",
      "similarity": 0.5387861339897322
    }
  ]
}