{
  "chapter": "ص",
  "text": "هذا فوج مقتحم معكم لا مرحبۢا بهم انهم صالوا۟ النار",
  "translations": [
    {
      "translation": "This! A crowd hurtling in with you. There is no welcome for them. They will certainly roast in the Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here is a multitude rushing headlong with you. There is no welcome for them. They will roast in the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Observing their followers advancing to Hell they will say, among themselves: “This is a troop rushing in to you. There is no welcome for them. They are destined to roast in the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their leaders will be told, \"This band will also be thrown headlong with you into hell.\" Their leaders will exclaim, \"May condemnation fall upon them! Let them suffer the torment of fire\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Here is another group that was with you, falling along with you”; they will answer, “Do not give them plenty of open space; they surely have to enter the fire – let them also be confined!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a troop entering with you (in Hell), no welcome for them! Verily, they shall enter in the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an army plunging in without consideration along with you; no welcome for them, surely they shall enter fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a troop rushing in with you; there is no Welcome for them; they shall roast in the Fire.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here is an army rushing blindly with you. (Those who are already in the Fire say): No word of welcome for them. Lo! they will roast at the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And they will say to one another: \"Do you see] this crowd of people rushing headlong to join you?\" \"No welcome to them! Indeed, they are headed for the fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a crowd rushing in along with you; no welcome for them; verily they are to roast in the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The leaders of the faithless will be told,] ‘This is a group [of your followers] plunging [into hell] along with you.’ [They will repond,] ‘May wretchedness be their lot! For they will enter the Fire.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here is a troop rushing headlong with you! No welcome for them! truly, they shall burn in the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a troop entering with you (in Hell), no welcome for them! Verily, they shall burn in the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We shall say to their leaders): 'This is a troop rushing in with you, there is no welcome for them, they shall roast in the Fire'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is a crowd rushing headlong with you.” There is no welcome for them. They will be scorched by the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Its inhabitants will say], \"This is a company bursting in with you. No welcome for them. Indeed, they will burn in the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:59] And it will be said to them as they enter the Fire with their followers: ‘This is a horde about to plunge, to enter, with you, into the Fire violently — at which point those who used to be followed say: no welcome [is there] for them [here]!, in other words, [they will find] no comfort for them [here]. They will indeed roast in the Fire’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah will say to the first generation of people who entered the Fire: (Here is an army) a group of people (rushing blindly with you) into the Fire. Those who entered hell first will say to those who entered it after them: (No word of welcome for them) may Allah not make it spacious for them. (Lo! they will roast at the Fire) they will abide in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قال الخزنة لهم بعدما سمعوا صيحتهم وصراخهم: { هَـٰذَا فَوْجٌ مُّقْتَحِمٌ } بعدكم\n معقبين عليكم مضيقين عليكم\n فالتفتوا أثرهم أهؤلاء أتباعنا { مَّعَكُمْ لاَ مَرْحَباً بِهِمْ } ولا يوسع عليهم { إِنَّهُمْ } أيضاً { صَالُواْ ٱلنَّارِ } [ص: 59] أي: داخلوها أمثالنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هذا فوج مُّقْتَحِمٌ معكم } ، حكاية لِمَا يقوله الخزنة للطاغين إذا دخلوا النار، واقتحمها معهم فوج كانوا يتبعونهم في الكفر والضلالة\n والاقتحام: الدخول في الشيء بشدة، أو: من كلام الطاغين بعضهم من بعض\n { لا مرحباً بهم } ، هو من تمام كلام الخزنة، على الأول، أو: من كلام الطاغين، دعاء منهم على أتباعهم\n يُقال لمَن يدعو له أو يفرح به\n مرحباً، أي: وجدت مكاناً رَحْباً، لا ضيقاً، ثم تدخل عليه النفي في دعاء السوء، فتقول: لا مرحباً\n و \" بهم \": بيان للمدعو عليهم، { إِنهم صالُوا النارِ } أي: داخلوها\n وهو تعليل لاستحقاقهم الدعاء عليهم\n وقيل: { هذا فوج\n\n\n } إلخ، من كلام الخزنة لرؤساء الكفرة\n و { لا مرحباً بهم\n\n\n } الخ، من كلام الرؤساء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:11",
      "similarity": 0.658195239552774
    },
    {
      "verse": "38:60",
      "similarity": 0.37800928866777594
    },
    {
      "verse": "110:2",
      "similarity": 0.3239760096651298
    },
    {
      "verse": "78:18",
      "similarity": 0.3016688043291089
    },
    {
      "verse": "9:118",
      "similarity": 0.28277672168921725
    }
  ]
}