{
  "chapter": "ص",
  "text": "قالوا۟ بل انتم لا مرحبۢا بكم انتم قدمتموه لنا فبئس القرار",
  "translations": [
    {
      "translation": "They will say, 'No, it is you who have no welcome. It is you who brought it upon us. What an evil place to settle!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"In fact, it is you who will have no welcome. It is you who brought this upon us. What an evil place of rest!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply: “Rather, no welcome to you. (You will roast in Hell.) It is you who led us to this end. What an evil resort!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their followers will say, \"In fact, it is you who deserve condemnation. It was you who led us to hell, a terrible dwelling\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The followers will say, “In fact, for you! May you not get open space! It is you who brought this calamity upon us!” So what a wretched destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The followers will say to those who misled): \"Nay, you (too)! No welcome for you! It is you who brought this upon us, so evil is this place to stay in!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: Nay! you-- no welcome to you: you did proffer it to us, so evil is the resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'No, it is you have no Welcome; you forwarded it for us; how evil a stablishment!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Nay, but you (misleaders), for you there is no word of welcome. Ye prepared this for us (by your misleading). Now hapless is the plight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say to them, \"You are not welcome! It was you who brought this on us, an evil place to stay,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say nay! it is ye, for whom there is no welcome: it is ye who have brought it upon us. Evil shall be the resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘No, may wretchedness be your lot! You prepared this [hell] for us. What an evil abode!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The followers shall cry to the misleaders:) \"Nay, ye (too)! No welcome for you! It is ye who have brought this upon us! Now evil is (this) place to stay in!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The followers of the misleaders will say): \"Nay, you (too)! No welcome for you! It is you (misleaders) who brought this upon us (because you misled us in the world), so evil is this place to stay in!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will say: 'No, it is you that has no welcome. It was you who brought it upon us, an evil place'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “But it is you! There is no welcome for you! It is you who brought it upon us! What a miserable end!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Nor you! No welcome for you. You, [our leaders], brought this upon us, and wretched is the settlement.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:60] They, the followers, say, ‘Nay, but for you [there is] no welcome! You prepared this, that is, disbelief, for us. So what an evil abode!’, for us and for you, is the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say) those who entered the Fire afterward will say: (Nay, but ye (misleaders), for you there is no word of welcome) may Allah not make it spacious for you. (You prepared) you prescribed (this for us) i.e. the religion which we followed you on. (Now hapless is the plight) evil is the abode for both of us. 526\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ مَرْحَباً بِكُمْ } معناه لا سِعةً لَهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no welcome for you} means that there is no space for them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمع الأتباع قول قادتهم هذا: { قَالُواْ } على سبيل المعارضة والمخاصمة: { بَلْ أَنتُمْ } أيها الضالون المضلون حقاً أن يقال لكم: { لاَ مَرْحَباً بِكُمْ } إذ { أَنتُمْ } بشؤم إضلالكم وإغرائكم { قَدَّمْتُمُوهُ } اي: الكفر الذي هو سبب دخول النار، وابتدأتموه أولاً، ثم أغريتمونا بتغريركم وتضليلكم، حتى كفرنا بسعيكم، وابتلينا بها أمثالكم { لَنَا فَبِئْسَ ٱلْقَرَارُ } [ص: 60] أي: بئس مقرنا ومقركم جنهم الطرد والحرمان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا } أي: الأتباع، { بل أنتم لا مرحباً بكم } أي: الدعاء الذي دعوتم به علينا أنتم أحقّ به، وعلّلوا ذلك بقوله: { أنتم قدمتموه لنا } أي: إنكم دعوتمونا للكفر، فتبعناكم، فقدمتمونا به للعذاب، { فبئس القرارُ } أي: بئس المقر جهنم، قصدوا بذمها تغليظ جناية الرؤساء عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:118",
      "similarity": 0.45847808158038944
    },
    {
      "verse": "38:59",
      "similarity": 0.3780092886677759
    },
    {
      "verse": "14:29",
      "similarity": 0.19871173821474952
    },
    {
      "verse": "9:25",
      "similarity": 0.1810286851897641
    },
    {
      "verse": "75:12",
      "similarity": 0.15184593717684983
    }
  ]
}