{
  "chapter": "ص",
  "text": "ما كان لى من علمۭ بالملا الاعلى اذ يختصمون",
  "translations": [
    {
      "translation": "I knew nothing of the Highest Assembly when they debated.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the higher Assembly when they discussed it among themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Tell them): “I had no knowledge of the High Council when they were disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have no knowledge of the dispute among the angels (concerning their attitude towards Adam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“What did I know of the heavenly world, when the angels had disputed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the chiefs (angels) on high when they were disputing and discussing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the exalted chiefs when they contended:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the High Council when they disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the Highest Chiefs when they disputed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the Exalted Assembly when they argued [against the creation of man]:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the chiefs on high when they disputed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have no knowledge of the Supernal Elite when they contend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No knowledge have I of the Chiefs on high, when they discuss (matters) among themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the chiefs (angels) on high when they were disputing and discussing (about the creation of Adam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the High Assembly's dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have no knowledge of the Highest Assembly as they dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:69] I had no knowledge of the High Council, that is to say, [of] the angels, when they disputed, in the matter of Adam, when God, exalted be He, said [to them]: ‘I am appointing on earth a vicegerent’, to the end [of the verse, Q. 2:30].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I had no knowledge of the Highest Chiefs) i.e. of the angels, if it was not Allah Who sent me (when they disputed) when they spoke and said: (Wilt Thou place therein one who will do harm therein and will shed blood;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { مَا كَانَ لِيَ مِنْ عِلْمٍ بِٱلْمَلإِ ٱلأَعْلَىٰ } أي: الملائكة السامويين { إِذْ يَخْتَصِمُونَ } [ص: 69] وقت خلافة آدم ونبوته ونيابته، فألهمني الله بوحيه ما جرى عليهم من الحجج والمعارض، وإفحامهم بعد جدالهم واصطفاء الله إياه، وأمرهم بسجوده تكريماً وتعظيماً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إِذ يختصمون }: متعلق بمحذوف يقتضيه المقام إذ المراد نفي علمه ـ عليه الصلاة والسلام ـ بحالهم لا بذواتهم، والتقدير: ما كان لِيَ فيما سبق علم بما يوحيه في شأن الملأ الأعلى وقت اختصامهم\n وانظر أبا السعود\n { إِن يُوحَى إِليَّ أَنَّما أنا نذير مبينٌ } أي: ما يُوحى إليَّ ما يوحى من الأمور الغيبية، التي من جملتها حال الملأ الأعلى، إلا لأنما أنا نذير مبين من جهته تعالى، فحذف اللام وانتصب بإيصال الفعل إليه، ويجوز أن يرتفع بالنيابة عن الفاعل، أي: ما يوحى إليّ إلا هذا، وهو أن أُنذر وأُبلّغ، ولا أُفرط في ذلك، أي: ما أومرَ إلا بهذا الأمر وحده، وليس إليَّ غير ذلك\n\n\nوقرىء بكسر \" إنما \" على الحكاية، أي: إلا هذا القول، وهو: أن أقول لكم: إنما أنا نذير مبين، ولا أدّعي شيئاً آخر\n الإشارة: تربية اليقين تُطلب في ثلاثة أمور في توحيد الألوهية، بالتبري من الشرك الجلي والخفي\n وهو مفاد قوله: { وما من إِله إِلا الله\n\n\n } الخ\n وفي تصديق الواسطة، وهو النذير المبين، بتعظيمه واتباع سُنَّته ومنهاجه القويم، وفي التصديق بما جاء به، وهو النبأ العظيم، على أيّ تفسير كان، إما القرآن، باتباعه، والتدبُّر في معانيه، أو: يوم القيامة، بالتأهُّب له، وجعله نُصب العين\n وبالله التوفيق\n ثم فسَّر الاختصام المتقدم، فقال: { إِذْ قَالَ رَبُّكَ لِلْمَلاَئِكَةِ }\n\n",
      "translations": []
    }
  ]
}