{
  "chapter": "ص",
  "text": "قل انما انا۠ منذر وما من اله الا الله الوحد القهار",
  "translations": [
    {
      "translation": "Say: 'I am only a warner. There is no god except Allah, the One, the All-Conquering,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am only a warner, and there is no other god but God, the one, the omnipotent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “I am nothing but a warner. There is no deity but Allah, the One, the Supreme,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad) say, \"I am only a warner. The only Lord is God, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I am purely a Herald of Warning – and there is no God except Allah, the One, the All Dominant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am only a warner and there is no God (worthy of worship) except Allah the One, the Irresistible,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am only a warner, and there is no god but Allah, the One, the Subduer (of all):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am only a warner. There is not any god but God, the One, the Omnipotent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): I am only a warner, and there is no Allah save Allah, the One, the Absolute,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [Prophet], \"I am only a warner. There is no god but God, the One, the All-Powerful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I am but warner, and there is no god but Allah, the One, the Subduer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I am just a warner, and there is no god except Allah, the One, the All-paramount,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Truly am I a Warner: no god is there but the one Allah, Supreme and Irresistible,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I am only a warner and there is no Ilah (God) except Allah (none has the right to be worshipped but Allah) the One, the Irresistible,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am only a warner. There is no god except Allah, the One, the Conqueror,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am only a warner, and there is no god except God—the One, the Conqueror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"I am only a warner, and there is not any deity except Allah, the One, the Prevailing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:65] Say, O Muhammad (s), to the disbelievers of Mecca: ‘I am only a warner, to threaten [disbelievers] with [punishment in] the Fire. And there is no god except God, the One, the All-Compelling, of [all] His creatures;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to the people of Mecca, Muhammad: (I am only a warner) a warning messenger, (and there is no God save Allah) He has no son or partner, (the One, the Absolute) Superior over His creation,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nما أنا إلا منذر لا أدعوكم إلى نفسي ولا أقدر على هدايتكم لأني فان عن نفسي وعن قدري\n قائم في الإنذار بالله وصفاته\n { وما من إله } في الوجود { إلا الله الواحد } بذاته { القهّار } الذي يقهر كل من سواه بإفنائه في وحدانيته { ربّ } الكل الذي يربّ كل شيء في حضرة واحديته باسم من أسمائه { العزيز } الذي يغلب المحجوب بقوّته فيعذبه بما حجب به في سترات جلاله لاستحقاقه فيض الربوبية من حضرة القهّار المنتقم وسطوات العذاب المحتجب { الغفّار } الذي يستر ظلمات صفات النفس بأنوار تجليات جماله لمن بقي فيه نور فطرته فيقبل نور المغفرة لبقاء مسكة من نوريته { قل هو } أي: الذي أنذرتكم به من التوحيد الذاتي والصفاتي { نبأ عظيم أنتم عنه معرضون } ثم احتجّ على صحة نبوّته باطلاعه على اختصام الملأ الأعلى من غير تعلم إذ لا سبيل إليه إلا الوحي\n وفرّق بين اختصام الملأ الأعلى واختصام أهل النار بقوله في تخاصم أهل النار: إن ذلك لحق\n وفي اختصام الملأ الأعلى { إذ يختصمون } لأن ذلك حقيقي لا ينتهي إلى الوفاق أبداً\n وهذا عارضي نشأ من عدم اطلاعهم على كمال آدم عليه السلام الذي هو فوق كمالاتهم\n وانتهى إلى الوفاق عند قولهم:\n[البقرة\n الآية: 32]\n وقوله تعالى:\n[البقرة\n الآية: 33] على ما ذكر في سورة البقرة عند تأويل هذه القصة\n وسجودهم لآدم عليه السلام: تعظيمهم له وانقيادهم وخضوعهم لانكشاف كماله الذي هو فوق كمالاتهم عليهم السلام\n وإباء إبليس واستكباره: عدم انقياد شيطان الوهم وإذعانه لاحتجابه عن حقيقته بانطباعه في المادة\n ولهذا قال تعالى: { وَكَانَ مِنَ ٱلْكَافِرِينَ } [ص\n الآية: 74]\n { لما خلقت بيدي } أي: خلقته بصفتي الجمال والجلال والقهر واللطف وجميع أسمائي المتقابلة المندرجة تحت صفتي القهر والمحبة لتحصل عند الجمعية الإلهية في الحضرة الواحدية بخلاف حال الملأ الأعلى\n فإنّ من خلق منهم بصفة القهر لا يقدر على اللطف وبالعكس { أسْتَكْبرت } أي: أعرض لك التكبر والاستنكاف { أم كنت } عالياً عليه\n زائداً في المرتبة؟ فأجاب المحجوب: بأني عال خير منه في الأصل لعدم اطلاعه على حقيقته المجرّدة واطلاعه على بشريته\n ولا شك أن الروح الحيواني الناري الذي خلق منه اللعين أشرف من المادة الكثيفة البدنية ولكن الاحتجاب عن الجمعية الإلهية واللطيفة الروحانية بعث اللعين على الإباء حتى تمسك بالقياس وعصى الله في سجود الناس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بالغ سبحانه في حقية ما حكى عن أهل النار\n أمر حبيبه صلى الله عليه وسلم بأن بلغ للأنام التوحيد المبعد لهم عن النار والعذاب المؤبد فيها\n فقال: { قُلْ } يا أكمل الرسل للمشركين المستحقين لعذاب النار إنقاذاً لهم عنها\n وإن قبلوا منك قولك: { إِنَّمَآ أَنَاْ مُنذِرٌ } لكم بإذن الله ووحيه عن أمثال ما ذكر من العذاب في النشأة الأخرى { وَ } أعلموا أنه { مَا مِنْ إِلَـٰهٍ } يُعبد بالحق\n ويُرجع إليه في الخطوب\n ويُلتجأ نحوه في النوائب والمصائب { إِلاَّ ٱللَّهُ ٱلْوَاحِدُ } الأحد الصمد الحي القيوم الذي لا شريك له في الوجود\n ولا شيء غيره في الشهود { ٱلْقَهَّارُ } [ص: 65] للأغيار مطلقاً\n إذ\n[القصص: 88] رجوع الأظلال إلى الشمس\n والأمواج إلى البحر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قُلْ } يا محمد للمشركين: { إِنما أنا مُنذِر } من جهته تعالى\n أُنذركم عذابه\n { وما من إِلهٍ } في الوجود { إِلا اللهُ الواحدُ } الذي لا يقبل الشركة أصلاً\n { القهَّارُ } لكل شيء سواه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:18",
      "similarity": 0.7129844380344396
    },
    {
      "verse": "93:9",
      "similarity": 0.6796141727459324
    },
    {
      "verse": "39:4",
      "similarity": 0.6522454755445523
    },
    {
      "verse": "12:39",
      "similarity": 0.6192896270968875
    },
    {
      "verse": "14:48",
      "similarity": 0.5868096210913766
    }
  ]
}