{
  "chapter": "ص",
  "text": "ما سمعنا بهذا فى الملة الءاخرة ان هذا الا اختلق",
  "translations": [
    {
      "translation": "We never heard of it in the former faith. It is surely a fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard this in the religious community close to our time. This is nothing but a fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have heard nothing like this in the latest religion. This is only his own false invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We never heard of this even in Christianity, the latest religion; this is clearly a newly fabricated matter.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard (the like) of this in the religion of these later days. This is nothing but an invention!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never heard of this in the former faith; this is nothing but a forgery:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard of this in the last religion; this is surely an invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard of this in later religion. This is naught but an invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard of any such thing in the old religion. This is nothing but a fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We heard not thereof in the later faith; this is naught but an invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not hear of this in the latter-day creed. This is nothing but a fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never heard (the like) of this among the people of these latter days: this is nothing but a made-up tale!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard (the like) of this among the people of these later days. This is nothing but an invention!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never heard of this in the former religion. It is nothing but an invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never heard of this in the former faith. This is nothing but a fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not heard of this in the latest religion. This is not but a fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:7] We never heard of this in the latter-day creed, namely, the creed of Jesus. This is surely [nothing] but an invention, [mere] lies.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We have not heard of this) which Muhammad says (in later religion) in Judaism and Christianity; they mean to say: we did not hear from the Jews or Christian that God is One. (This) which Muhammad says (is naught but an invention) which Muhammad has invented.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوما لنا إلا الصبر والثبات إلى أن تتجلى الغياهب وترتفع النوائب، مع أنَّا { مَا سَمِعْنَا بِهَـٰذَا } أي: بالتوحيد الذي يقوله هذا الداعي { فِى ٱلْمِلَّةِ ٱلآخِرَةِ } التي هي النصرانية؛ إذ النصارى يقولون بالأقانيم الثلاثة، ولم ينقل منهم توحيد الإله، ولا من الذين مضوا قبلهم من أرباب الملل السالفة، وبالجملة: { إِنْ هَـٰذَا } أي: ما هذا التوحيد الذي ظهر به { إِلاَّ ٱخْتِلاَقٌ } [ص: 7] أي: كذب اخترعه من تلقاء نفسه، ونسبه إلى الوحي افتراء ومراء، قاصداً به التغرير والتلبيس على ضعفه الأنام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما سَمِعْنَا بهذا } الذي يقوله من أمر التوحيد { في الملةِ الآخرة } أي: في ملة عيسى، التي هي آخر الملل لأن النصارى مثلثة غير موحدة، أو: في ملّة قريش التي أدركنا عليها آباءنا، ويجوز أن يكون الجار والمجرور حالاً من \" هذا \" ، أي: ما سمعنا بهذا من أهل الكتاب ولا الكهّان كائناً في الملة المترقبة\n\n\nولقد كذّبوا في ذلك أقبح كذب فإن حديث البعثة والتوحيد، وإبطال عبادة الأصنام، كان أشهر الأمور قبل الظهور\n { إِنْ هذا } أي: ما هذا { إِلا اختلاقٌ } أي: كذب، اختلقه من تلقاء نفسه",
      "translations": []
    }
  ]
}