{
  "chapter": "ص",
  "text": "قال رب فانظرنى الى يوم يبعثون",
  "translations": [
    {
      "translation": "He said, 'My Lord, grant me a reprieve until the Day they are raised again.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O Lord, give me respite till the day the dead rise from their graves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan said: “My Lord, then grant me respite till the Day that they are raised up.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Lord, grant me respite until the Day of Resurrection\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! Therefore give me respite till the day when all will be raised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis] said: \"My Lord! Give me then respite till the Day the (dead) are resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! then respite me to the day that they are raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'My Lord, respite me till the day they shall be raised.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Reprieve me till the day when they are raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan said, \"My Lord, grant me respite until the Day of Resurrection,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! respite me till the Day whereon they are raised up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! Respite me till the day they will be resurrected.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Iblis) said: \"O my Lord! Give me then respite till the Day the (dead) are raised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis (Satan)] said: \"My Lord! Give me then respite till the Day the (dead) are resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (satan) replied: 'Respite me my Lord till the Day of Resurrection'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Lord, defer me until the Day they are resurrected.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:79] He said, ‘My Lord, then reprieve me until the day when they, mankind, will be raised’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Iblis said: (My Lord!) my Lord! (Reprieve me) give me a respite (till the day when they are raised) from the graves. The wicked one wanted to escape the taste of death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما قنط إبليس عن روح الله وسعة رحمته { قَالَ } بعدما آيس مناجياً: { رَبِّ } يا من رباني على فطرة الإطاعة، فعصيت أمرك بشؤم عُجبي ونخوتي { فَأَنظِرْنِيۤ } وأمهل علي، بعدما بعدتني عن كنف قربك وجوارك، وطردتني عن محل كرامتك وجودك { إِلَىٰ يَوْمِ يُبْعَثُونَ } [ص: 79]\n\n\n\n\n{ قَالَ } سبحانه: { فَإِنَّكَ مِنَ ٱلْمُنظَرِينَ * إِلَىٰ يَوْمِ ٱلْوَقْتِ ٱلْمَعْلُومِ } [ص: 80-81] وهو النفخة الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الأعراف: 44] وهو إمامُهم؟ { قال } إبليسُ: { رَبِّ فأَنظِرْنِي } أمهلني وأخِّرني، أي: إذا جعلتني رجيماً فأمهلني ولا تمتني، { إِلى يوم يبعثون } أي: آدم وذريته للجزاء بعد فنائهم\n\n\nوأراد بذلك فسْحته لإغوائهم، وليأخذ منهم ثأره، وينجو من الموت بالكلية إذ لا موت بعد البعث، { قال } تعالى: { فإِنك من المنظرين إلى يوم الوقتِ المعلوم } ، وهو وقت النفخة الأولى، ومعنى \" معلوم \" أنه معلوم عند الله، لا يتقدم ولا يتأخر، وورود الجواب بالجملة الاسمية مع التعرُّض لشمول ما سأله لآخرين، على وجهٍ يُشعر بكون السائل تبعاً لهم في ذلك، دليل واضح على أنه إخبار بالإنظار المقدر لهم أزلاً، لا إنشاء لإنظار خاص به، قد وقع إجابة لدعائه، أي: إنك من جملة الذين أخرت آجالهم أزلاً، حسبما تقتضيه حكمة التكوين\n { قال فبعزَّتك لأُغْوِينَّهم أجمعين } ، أقسم بعزّة الله، وهو سلطانه وقهره على إغواء بني آدم، بتزيين المعاصي والكفر، { إِلا عبادَكَ منهم المخلصِين } ، وهم الذين أخلصهم الله للإيمان به وطاعته، وعصمهم من الغواية، أو: الذين أخلصوا قلوبهم وأعمالهم لله في قراءة الكسر\n { قال } تعالى: { فالحقّ والحقَّ أقولُ } أي: أقسم بالحق ولا أقول إلا الحق، أو: الحق قسَمي وأقول الحق: { لأملأَنَّ جهنمَ منك } من جنسك، وهم الشياطين، { وممن تَبِعَكَ منهم } من ذرية آدم { أجمعين } أي: لأعمرنَّ جهنم من المتبوعين والتابعين أجمعين، لا أترك منهم أحداً\n الإشارة: التجلي بهذا الهيكل الآدمي فاق جميع التجليات، وصورته البديعة فاقت جميع الصور، ولذلك لم يقل الحق تعالى في شيء أنه خلقه في أحسن تقويم إلا الآدمي، وذلك لأنه اجتمع فيه الضدان، واعتدل فيه الأمران الظلمة والنور، الحس والمعنى، الروحانية والبشرية، القدرة والحكمة\n ولذلك قال تعالى فيه: { لِما خلقت بيدي } ، ولم يقله في غيره، أي: خلقته بيد القدرة ويد الحكمة\n فالقدرة كناية عما في باطنه من أسرار المعاني الإلهية، والحكمة عبارة عما في قالَبه من عجائب التصوير، وغرائب التركيب، ولذلك كانت معرفته أتم، وترقِّيه لا ينقطع، إن كان من أهله، وراجع ما تقدّم في قوله تعالى:\n\n[الإسراء: 70]\n وقال القشيري بعد كلام: فسبحان الله! خلق أعَزَّ خَلْقِه من أذّلِّ شيءٍ وأَخَسِّه\n ثم قال: ما أودع عند آدم لم يوجد عند غيره، فيه ظهرت الخصوصية\n هـ\n ثم نزّه نبيه عن الطمع في الأجر على التبليغ و التكلُّف، فقال: { قُلْ مَآ أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:36",
      "similarity": 1.0
    },
    {
      "verse": "7:14",
      "similarity": 0.9728422369898219
    },
    {
      "verse": "23:16",
      "similarity": 0.6617999105313134
    },
    {
      "verse": "75:23",
      "similarity": 0.5436141879284242
    },
    {
      "verse": "6:29",
      "similarity": 0.5078952017643901
    }
  ]
}