{
  "chapter": "ص",
  "text": "فاذا سويته ونفخت فيه من روحى فقعوا۟ له سجدين",
  "translations": [
    {
      "translation": "When I have formed him and breathed My Ruh into him, fall down in prostration to him!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I have made him and have breathed into him of My spirit. Fall down in homage before him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After I have created him and breathed into him of My spirit, fall you down, prostrating yourselves to him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when I give it proper shape and blow My spirit into it, bow down in prostration to him,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So when I have perfected him and breathed into him a spirit from Myself, (you all) fall down before him in prostration.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when I have fashioned him and breathed into him (his) soul created by Me, then you fall down prostrate to him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when I have made him complete and breathed into him of My spirit, then fall down making obeisance to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When I have shaped him, and breathed My spirit in him, fall you down, bowing before him!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I have fashioned him and breathed into him of My Spirit, then fall down before him prostrate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when I have formed him fully and breathed My spirit into him, prostrate yourselves before him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when I have formed him and breathed into him of My spirit, fall down before him prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when I have proportioned him and breathed into him of My spirit, then fall down in prostration before him.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When I have fashioned him (in due proportion) and breathed into him of My spirit, fall ye down in obeisance unto him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when I have fashioned him and breathed into him (his) soul created by Me, then you fall down prostrate to him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "after I have shaped him and breathed of My spirit (I created) into him, fall down prostrate before him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When I have formed him, and breathed into him of My spirit, fall prostrate before him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:72] So when I have proportioned him, completed him, and breathed in him, [when I have] caused to flow [therein], My spirit, so that he becomes a living [being] — the addition of ‘the spirit’ to Adam is an honour for him; the ‘spirit’ is a subtle body that gives life to a human being by permeating him — then fall down in prostration before him!’ — a prostration of salutation [that is actually] a bow.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when I have fashioned him) and when I have gathered his creation (and breathed into him of My spirit) and placed in him My spirit, (then fall down before him prostrate) then prostrate before him,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِذا سوَّيتُه } أي: صوَّرْتُه بالصورة الإنسانية، والخلقة البشرية، أو: سويت أجزاء بدنه، بتعديل أعضائه، { ونَفَخْتُ فيه من روحي } الذي خلقته قبلُ، وأضافه إليه تخصيصاً، كبيت الله، وناقة الله\n والروح سر من أسرار الله، لطيفة ربانية، سارية في كثيفة ظلمانية، فإذا سرت فيه حيى بإذن الله، أي: فإذا أحييته { فَقَعُوا } أي: اسقطوا { له } ، وهو أمر، مِن وقع، { ساجدين } قيل: كان انحناء يدلّ على التواضع، وقيل: كان سجوداً لله، أو سجود تحية لآدم وتكريماً له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:29",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "32:9",
      "similarity": 0.5027797930547693
    },
    {
      "verse": "56:1",
      "similarity": 0.48413095183367066
    },
    {
      "verse": "52:7",
      "similarity": 0.4578073833797124
    },
    {
      "verse": "69:15",
      "similarity": 0.45555856261542105
    }
  ]
}