{
  "chapter": "ص",
  "text": "قال يابليس ما منعك ان تسجد لما خلقت بيدى استكبرت ام كنت من العالين",
  "translations": [
    {
      "translation": "He said, 'Iblis, what prevented you prostrating to what I created with My own Hands? Were you overcome by arrogance or are you one of the exalted?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (God): \"O Iblis, what hindered you from adoring what I created by My own authority? Are you too proud, or too high and mighty?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord said: “O Iblis, what prevented you from prostrating yourself before him whom I created of My Two Hands. Are you waxing proud, or fancy yourself to be too exalted?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord said, \"Iblis, what prevented you from prostrating before what I have created with My own hands? Was it because of your pride or are you truly exalted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Allah, “O Iblis! What prevented you from prostrating before one whom I have created with My hands*? Have you become proud or were you haughty from the beginning?” (Used as a metaphor).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"O Iblis! What prevents you from prostrating yourself to one whom I have created with Both My Hands. Are you too proud or are you one of the high exalted\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Iblis! what prevented you that you should do obeisance to him whom I created with My two hands? Are you proud or are you of the exalted ones?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Iblis, what prevented thee to bow thyself before that I created with My own hands? Hast thou waxed proud, or art thou of the lofty ones?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Iblis! What hindereth thee from falling prostrate before that which I have created with both My hands? Art thou too proud or art thou of the high exalted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Satan, what prevented you from prostrating yourself to what I created with My own Hands? Were you overcome by arrogance, or are you of those who think [only] of themselves as exalted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: O Iblis! what preventeth thee from prostrating thyself before that which have created with both my hands? Becomest thou stiff-necked, or art thou of the exalted ones?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘O Iblis! What keeps you from prostrating before that which I have created with My [own] two hands? Are you arrogant, or are you one of the exalted ones?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"O Iblis! What prevents thee from prostrating thyself to one whom I have created with my hands? Art thou haughty? Or art thou one of the high (and mighty) ones?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"O Iblis (Satan)! What prevents you from prostrating yourself to one whom I have created with Both My Hands. Are you too proud (to fall prostrate to Adam) or are you one of the high exalted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) said: 'iblis, what prevented you from prostrating yourself towards that which I have created with My Hands? Have you become too proud, or areyou among the grand'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O Satan, what prevented you from prostrating before what I created with My Own hands? Are you too proud, or were you one of the exalted?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [already] among the haughty?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:75] He said, ‘O Iblīs! What prevents you from prostrating before that which I have created with My own hands?, in other words, whose creation I [Myself] have undertaken. This [in itself] is an honour for Adam, as God has [Himself] undertaken the [unmediated] creation of all creatures. Are you being arrogant, now, in refraining from prostrating (an interrogative meant as a rebuke); or are you of the exalted?’, of the proud, and have therefore disdained to prostrate yourself, because you are one of them?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ أَسْتَكْبَرْتَ أَمْ كُنْتَ مِنَ الْعَالِينَ (75) أي خاطب الله إبليس ولا شك أن هذا الخطاب حينئذٍ كان بواسطة ملَك من الملائكة لأن إبليس لما استكبر قد انسلخ عن صفة الملكية فلم يعد بعد أهلاً لتلقي الخطاب من الله ولم يكن أرفع رتبة من الرسل الذين قال الله فيهم { وما كان لبشر أن يكلمه اللَّه إلا وحياً أو من وراء حجاب أو يرسل رسولاً فيوحي بإذنه ما يشاء } \\[ الشورى : 51 \\] ، وبذلك تكون المحاورة المحكية هنا بواسطة ملَك فيكون الاختصام بينه وبين الملائكة على جعل ضمير { يختَصِمُونَ } \\[ ص : 69 \\] عائداً إلى الملأ الأعلى كما تقدم .وجيء بفعل { قال } غير معطوف حسب طريقة المقاولات . وتقدم قريب من هذه الآية في سورة الحجر إلا قوله هنا { ما مَنَعَكَ أن تَسْجُدَ } ، أي ما منعك من السجود ، ووقع في \\[ سورة الأعراف : 12 \\] { أن لا تسجد } على أن لا زائدة . وحُكي هنا أن الله قال له : لِمَا خلقْتُ بِيدي } ، أي خلقته بقدرتي ، أي خلقاً خاصّاً دفعة ومباشرة لأمر التكوين ، فكان تعلق هذا التكوين تعلقاً أقربَ من تعلقه بإيجاد الموجودات المرتَّبة لها أسباب تباشرها من حمل وولادة كما هو المعروف في تخلق الموجودات عن أصولها . ولا شكّ في أن خلق آدم فيه عناية زائدة وتشريف اتصال أقرب . فاليدان تمثيل لتكوّن آدم من مُجرد أمر التكوين للطين بهيئة صنع الفخَّاري للإِناء من طين إذ يسوّيه بيديه . وكان السلف يُقِرّون أن اليدين صفة خاصة لله تعالى لورودهما في القرآن مع جزمهم بتنزيه الله عن مشابهة المخلوقات وعن الجسمية وقصدهم الحذر من تحكيم الآراء في صفات الله ، أو أن تحمل العقول القاصرة صفاتتِ الله على ما تعارفته { ولتصنع على عيني } \\[ طه : 39 \\] وقال مرة { فإنك بأعيننا } \\[ الطور : 48 \\] . وقد تقدم القول في الآيات المشاهبة في أول سورة آل عمران .وفي إلقاء هذا السؤال إلى إبليس قطع بمعذرته . والمعنى : أمن أجل أنك تتعاظم بغير حق أم لأنك من أصحاب العلو ، والمراد بالعلو الشرف ، أي من العالين على آدم فلا يستحق أن تعظمه فأجاب إبليس مما يشق الثاني . فتبين أنه يعدّ نفسه أفضل من آدم لأنه مخلوق من النار وآدم مخلوق من الطين ، يعني والنار أفضل من الطين ، أي في رأيه . وعبر عن آدم باسم «مَا» الموصولة وهو حينئذٍ إنسان لأن سجود الملائكة لآدم كان بعد خلقه وتعليمه الأسماء كما في سورة البقرة . ويؤيد قول أهل التحقيق أن «ما» لا تختص بغير العاقل وشواهده كثيرة في القرآن وغيره من كلام العرب .وقال : { أنَا خيرٌ منه } قولٌ من الشيطان حكي على طريقة المحاورات . وجملة { خلقتني من نارٍ وخلقته من طِينٍ }\n\n",
      "translations": [
        {
          "translation": "(He said) Allah said to him: (0 Iblis!) wicked one! (What hindereth thee from falling prostrate before that which I have created with both My hands) what prevented you from prostrating before that which I have shaped with My hands? (Art thou too proud) to prostrate before Adam (or art thou of the high) or are you of those who disobey My command?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما امتنع إبليس عن إطاعته وتعظيمه مع ورود الأمر الوجوبي من قبل الحق { قَالَ } معاتباً عليه منادياً له سائلاً عن سبب امتناعه: { يٰإِبْلِيسُ } المستكبر المتخلف عن أمرنا { مَا مَنَعَكَ أَن تَسْجُدَ } أي: أي شيء منعك عن سجود التكريم { لِمَا خَلَقْتُ بِيَدَيَّ } وصورته بقدرتي\n وبمقتضى صورتي\n وبكمال حولي وقوتي\n ليكون مرآتي ويليق بخلتي وخلافتي { أَسْتَكْبَرْتَ } عن طاعة حكمنا وامتثال أمرنا { أَمْ كُنتَ } احتسبت نفسك { مِنَ ٱلْعَالِينَ } [ص: 75] المتفوقين عليه\n بحيث لا يجوّز لنفسك أن تتذلل عنده وتنقاد له؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال له تعالى: { أَسْتَكْبَرْتَ } \n بهمزة الاستفهام\n وطرح همزة الوصل\n أي: أتكبرت من غير استحقاق\n { أم كنت من العالين } المستحقين للتفوُّق\n أو: أستكبرت عن السجود ولم تكن قبل ذلك من المتكبرين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:32",
      "similarity": 0.6625615387159386
    },
    {
      "verse": "38:74",
      "similarity": 0.6225275218901184
    },
    {
      "verse": "26:95",
      "similarity": 0.5177539312889363
    },
    {
      "verse": "15:31",
      "similarity": 0.5127197507374234
    },
    {
      "verse": "34:20",
      "similarity": 0.5107029246499062
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}