{
  "chapter": "ص",
  "text": "اءنزل عليه الذكر منۢ بيننا بل هم فى شك من ذكرى بل لما يذوقوا۟ عذاب",
  "translations": [
    {
      "translation": "Has the Reminder been sent down to him out of all of us?' They are in doubt about My Reminder. They have yet to taste My punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To him of all of us has the Reminder been sent down?\" They are still in doubt about My admonition; but they have not tasted My punishment yet!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has this Exhortation been sent down among us only to him, to the exclusion of all others?” Nay, they are in doubt regarding My Exhortation, and are saying all this because they have not yet had any taste of My chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can it be that he alone has received the Quran?\" In fact, they have doubts about My Quran and this is because they have not yet faced (My) torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Is the Qur’an which is sent to him, among us?” In fact they are in a doubt concerning My Book; in fact, they have not yet tasted My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the Reminder been sent down to him (alone) from among us\" Nay, but they are in doubt about My Reminder! Nay, but they have not tasted (My) torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the reminder been revealed to him from among us? Nay! they are in doubt as to My reminder. Nay! they have not yet tasted My chastisement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has the Remembrance been sent down on him out of us all?' Nay, but they are in doubt of My Remembrance; nay, they have not yet tasted My chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath the reminder been unto him (alone) among us? Nay, but they are in doubt concerning My reminder; nay but they have not yet tasted My doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was the message sent only to him out of all of us?\" In fact, they doubt My warning; in fact, they have not yet tasted My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath Unto him the admonition been sent down from amongst us! Yea! they are in doubt concerning My admonition. Yea! they have not yet tasted My torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the Reminder been sent down to him out of [all of] us?’ Indeed, they are in doubt concerning My Reminder. Indeed, they have not yet tasted My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! has the Message been sent to him - (Of all persons) among us?\"... but they are in doubt concerning My (Own) Message! Nay, they have not yet tasted My Punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the Reminder been sent down to him (alone) from among us?\" Nay! but they are in doubt about My Reminder (this Quran)! Nay, but they have not tasted (My) Torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, out of all of us, has the Remembrance been sent down to him (Prophet Muhammad)' No, they are doubtful about My Remembrance, no, they have not yet tasted My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was the message sent down to him, out of all of us?” In fact, they are doubtful of My warning. In fact, they have not yet tasted My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the message been revealed to him out of [all of] us?\" Rather, they are in doubt about My message. Rather, they have not yet tasted My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:8] Has the Remembrance, the Qur’ān, been revealed to him, Muhammad (s), out of [all of] us’, when he is neither the elder nor the noblest among us? In other words, it could not have been revealed to him (read aunzila pronouncing both hamzas, or not pronouncing the second one, but in both cases inserting an intervening alif or without [this insertion]). God, exalted be He, says: Nay, but they are in doubt concerning My Remembrance, My revelation, that is, the Qur’ān, for they deny the one who has brought it. Nay, but they have not yet tasted My chastisement, and if they were to taste it, they would certainly believe the Prophet (s) in what he has brought — but then [in such a case] their belief [in the Prophet] would be of no benefit to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَؤُنْزِلَ عَلَيْهِ الذِّكْرُ مِنْ بَيْنِنَا بَلْ هُمْ فِي شَكٍّ مِنْ ذِكْرِي بَلْ لَمَّا يَذُوقُوا عَذَابِ (8){ أَءَنزِلَ عَلَيْهِ الذكر مِن بَيْنِنَا } .يجوز أن يكون { أءُنزِلَ عليه الذكر من بيننا } من كلام عموم الكافرين المحكي بقوله : { وقال الكافِرُونَ هذا ساحِرٌ كذَّابٌ } \\[ ص : 4 \\] فيكون متصلاً بقوله : { أجعَلَ الآلِهة إلها واحداً } \\[ ص : 5 \\] ويكون قوله { أءُنزلَ عليه الذكرُ } بياناً لجملة { كَذَّابٌ } \\[ ص : 4 \\] ، لأن تقديره : هذا كذّاب إذ هو خبر ثان ل ( كان ) ، ولكونه بياناً للذي قبله لم يعطف عليه ويكون ما بينهما من قوله : { وانطلق الملأُ منهم } \\[ ص : 6 \\] إلى قوله : { إن هذا إلا اختلاقٌ } \\[ ص : 7 \\] اعتراضاً بين جملتي البيان .ويجوز أن يكون من تمام كلام الملأ واستغني به عن بيان جملة { كَذَّابٌ } لأن نطق الملأ به كاففٍ في قول الآخرين بموجَبه فاستغنوا عن بيان جملة { كذابٌ } .والاستفهام إنكاري ، ومناط الإِنكار هو الظرف { من بيننا } وهو في موضع حال من ضمير { عليه } ، فأنكروا أن يُخص محمد صلى الله عليه وسلم بالإِرسال وإنزاللِ القرآن دون غيره منهم ، وهذا هو المحكي في قوله تعالى : { وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم } \\[ الزخرف : 31 \\] أي من مكة أو الطائف ولم يريدوا بهذا الإِنكار تجويز أصل الرسالة عن الله وإنما مرادهم استقصاء الاستبعاد فإنهم أنكروا أصل الرسالة كما اقتضاه قوله تعالى : { وعَجِبوا أن جاءَهم مُنذرٌ منهم } \\[ ص : 4 \\] وغيره من الآيات ، وهذا الأصل الثاني من أصول كفرهم التي تقدم ذكرها عند قوله تعالى : { أجعل الآلهة إلها واحداً } \\[ ص : 5 \\] وهو أصل إنكار بعثه رسول منهم { بَلْ هُمْ فِي شَكٍّ مِّن ذِكْرِ }يجوز أن يكون هذا جواباً عن قولهم : { أءُنزِلَ عليه الذكر من بيننا } أي ليس قصدهم الطعن في اختصاصك بالرسالة ولكنهم شاكُّون في أصل إنزاله ، فتكون { بل } إضراباً إبطالياً تكذيباً لما يظهر من إنكارهم إنزال الذكر عليه من بينهم على ما تقدم ، أي إنما قصدهم الشك في أن الله يوحي إلى أحد بالرسالة ، فيكون معنى { في شَكّ من ذِكري } شكّاً من وقوعه . والشك يطلق على اليقين مجازاً مرسلاً بعلاقة الإِطلاق والتقييد فيكون كمعنى قوله تعالى : { فإنهم لا يكذبونك ولكن الظالمين بآيات اللَّه يجحدون } \\[ الأنعام : 33 \\] . ويجوز أن يكون انتقالاً من خبر عنهم إلى خبر آخر فيكون استئنافاً وتكون { بل } للإِضراب الانتقالي ، والمعنى : وهم في شك من ذكري ، أي في شك من كنه القرآن ، فمرة يقولون : افتراه ، ومرة يقولون : شعر ، ومرة : سحر ، ومرة : أساطير الأولين ، ومرة : قول كاهن . فالمراد بالشك حقيقتهُ أي التردد في العلم . وإضافة الذكر إلى ضمير المتكلم وهو الله تعالى إضافة تشريف ولتحقيق كونه من عند الله . والذكر على هذا الوجه هو عين المراد من قوله : { أءُنزل عليه الذكر } وإنما وقع التعبير عنه بالظاهر دون الضمير توصلاً إلى التنويه به بأنه من عند الله .و { في } للظرفية المجازية ، جُعلت ملابسة الشك إياهم بمنزلة الظرف المحيط بمحويه في أنه لا يخلو منه جانب من جوانبه .و { مِن } في قوله : { مِن ذِكري } ابتدائية لكون الشك صفة لهم ، أي نشأ لهم الشك من شأن ذكري ، أي من جانب نفي وقوعه ، أو في جانب ما يصفونه به .{ ذِكْرِى بَل لَّمَّا يَذُوقُواْ } .أتبع ذلك الإِضراب بإضراب آخر يبين أن الذي جرّأهم على هذا الشقاق أنهم لما تأخر حلول العذاب بهم ظنوا وعيده كاذباً فأخذوا في البذاءة والاستهزاء ولو ذاقوا العذاب لألقمت أفواههم الحجر .و { لمّا } حرف نفي بمعنى ( لم ) إلاّ أن في { لمّا } خصوصية ، وهي أنها تدلّ على المنفي بها متصل الانتفاء إلى وقت التكلم بخلاف ( لم ) فلذلك كان النفي ب { لمّا } قد يُفهم منه ترقب حصول المنفي بعد ذلك قال صاحب «الكشاف» في قوله تعالى : { ولما يدخل الإيمان في قلوبكم } في سورة الحجرات } ( 14 ) ما في { لمّا من معنى التوقع دال على أن هؤلاء قد آمنوا فيما بعدُ ، أي دال بطريق المفهوم الحاصل من معنى غاية النفي إلى زمن التكلم ، أي لا أضمن ما بعد ذلك ، وقد ذاقوا عذاب السيف يوم بدر بعد نزول هذه الآية بأربع سنين .وإضافة عذاب } إلى ياء المتكلم لاختصاصه بالله لأنه مُقدِّره وقاض به عليهم ولوقوعه على حالة غير جارية على المعتاد إذ الشأن أن يستأصل الجيش القوي الجيشَ القليل . وحذفت ياء المتكلم تخفيفاً للفاصلة ، وأبقيت الكسرة دليلاً عليها وهو حذف كثير في الفواصل والشعر على نحو حذفها من المنادَى .\n\n",
      "translations": [
        {
          "translation": "(Hath the reminder been revealed unto him (alone) among us) has he been selected from among us to have prophethood and the Scripture? (Nay, but they) the disbelievers of Mecca (are in doubt concerning My reminder) concerning My Scripture and the prophethood of My Prophet; (nay but they have not yet tasted My doom) they have not tasted My chastisement, this is why they lie about Me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } تعتقدون أيها العقلاء المتدبرون أنه { ءُنزِلَ عَلَيْهِ } أي: على يتيم أبي طالب { ٱلذِّكْرُ } أي: الوحي والقرآن { مِن بَيْنِنَا } من أنه مثلنا ومن بني نوعنا\n بل أدون منَّا\n ونحن أشرف منه\n وأكبر سناً\n وأكثر أموالاً وأولاداً\n وأكرم جاهاً وثروة\n وأعلى سيادة ورئاسة\n إنما يقولون هذا على سبيل الإنكار والاستبعاد لا أنهم معتقدون على الوحي والإنزال { بَلْ هُمْ فَي شَكٍّ } وريب عظيم { مِّن ذِكْرِي } ووحيي إليه\n بل إلى جميع المرسلين { بَل لَّمَّا يَذُوقُواْ عَذَابِ } [ص: 8] أي: إنما قالوا هذا\n وشكوا في الوحي وارتابوا\n لأنهم لم يذوقوا عذابي\n ولو أنهم ذاقوه لما قالوا\n فمن أين يقولون هذا ويحكمون أن الوحي لو نزل لنزل على رؤسائنا وسادتنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أأُنزل عليه الذكرُ } أي: القرآن { من بيننا } ونحن رؤساء الناس وأشرافهم\n أنكروا أن يُختص بالشرف من بين أشرافهم\n وينزل عليه الكتاب من بينهم\n حسداً من عند أنفسهم\n كقولهم:\n[الزخرف: 31]\n وأمثال هذه المقالات الباطلة دليل على أن مناط تكذيبهم ليس إلا الحسد\n وقصر النظر على الحطام الدنيوية\n والعياذ بالله\n قال الورتجبي: كانوا منطمسة العيون عما ألبسه الحق من أنوار ربوبيته\n وسنا جلاله وجماله\n لم يروا إلا الصورة الإنسانية\n التي هي ميراث آدم من ظاهر الخلقة\n وهذا كقوله:\n[الأعراف: 198]\n استبعدوا اصطفائيته بالوحي\n ولم يعرفوا أنه أثرُ اللهِ في العالم\n ومشكاةُ تجلِّيه\n حتى قالوا مثل ما قالوا: { وعَجبوا أن جاءهم مُّنذر منهم } \n رأوا أنفسهم خالية عن مشاهدة الغيوب\n وإدراك نور صفات الحق\n فقاسوا نفس محمد صلى الله عليه وسلم بأنفسهم\n ولم يعلموا أنه كان نفسَ النفوس\n وروحَ الأرواح\n وأصل الخليقة\n وباكورةً من بساتين الربوبية\n يا ليتهم لو رأوه في مشاهدة الملكوت\n ومناصب الجبروت\n إذ خاطبه الحق بلولاك ما خلقتُ الأفلاك\n هـ\n الإشارة: هذه عادة الله تعالى في خلقه\n كل مَن يأمر الناس بالتجريد\n وخرق العوائد\n وصريح التوحيد\n وترك ما عليه الناس من جمع الدنيا\n وحب الرئاسة\n والجاه\n أنكروه\n وسفَّهوا رأيه\n وقالوا فيه: ساحر كذَّاب\n ويقول بعضهم لبعض: امشوا واصبروا على ما أنتم عليه\n من جمع الدنيا\n والخدمة على العيال\n وعلى ما وجدتم عليه أسلافكم\n من الوقوف مع العوائد\n ما سمعنا بهذا الذي يدلّ عليه هذا الرجل من ترك الأسباب والانقطاع إلى الله في هذا الزمان\n إن هذا إلا اختلاق\n أأُنزلت عليه الخصوصية من بيننا\n ولم يعلموا أن الله يختص برحمته مَن يشاء\n ويبعث في كل زمان مَن يُجدد الدين بتربية مخصوصة\n والله تعالى أعلم\n ثم رَدّ عليهم بقوله: {\n\n\n بْل هُمْ فَي شَكٍّ مِّن ذِكْرِي بَل لَّمَّا يَذُوقُواْ عَذَابِ أَمْ عِندَهُمْ خَزَآئِنُ رَحْمَةِ رَبِّكَ ٱلْعَزِيزِ ٱلْوَهَّابِ أَمْ لَهُم مٌّلْكُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ وَمَا بَيَنَهُمَا فَلْيَرْتَقُواْ فِى ٱلأَسْبَابِ جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّن ٱلأَحَزَابِ }\n يقول الحق جلّ جلاله: { بل هم } أي: كفار قريش { في شكٍّ من ذكري } من القرآن\n أو الوحي\n لميلهم إلى التقليد\n وإعراضهم عن النظر في الأدلة المؤدية إلى علم حقيقته\n { بل لمَّا يذوقوا عذاب } أي: بل لم يذوقوا عذابي الموعود في القرآن\n ولذلك شكُّوا فيه\n فإذا ذاقوه زال ما بهم من الشك والحسد حينئذ\n أي: إنهم لا يُصدِّقون به إلا أن يمسّهم العذاب\n فحينئذ يُصدّقون\n ولات حين تصديق\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:9",
      "similarity": 0.6287203805508459
    },
    {
      "verse": "34:21",
      "similarity": 0.5497451308522391
    },
    {
      "verse": "10:104",
      "similarity": 0.5422870231374222
    },
    {
      "verse": "10:94",
      "similarity": 0.4956280857115527
    },
    {
      "verse": "27:66",
      "similarity": 0.47527464735091296
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/038008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/038008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/38:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}