{
  "chapter": "ص",
  "text": "ولتعلمن نباه بعد حينۭ",
  "translations": [
    {
      "translation": "You will come to know its truth in time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will know the truth of the matter after a while.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will certainly know its truthfulness after a certain time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And you will come to know of its tidings, after a while.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall certainly know the truth of it after a while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most certainly you will come to know about it after a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you shall surely know its tiding after a while.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye will come in time to know the truth thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you shall before long know its truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye shall surely come to know the truth thereof after a season.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you will surely learn its tidings in due time.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye shall certainly know the truth of it (all) after a while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall certainly know the truth of it after a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and after a while you shall know its news'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will know its message after a while.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will surely know [the truth of] its information after a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:88] And you will assuredly come to know, O disbelievers of Mecca, its tiding, the news of its truth, in [due] time’, that is to say, on the Day of Resurrection (‘ilm, ‘knowing’, is here being used in the sense of ‘urf, ‘experience’; the prefixed lām [in la-ta‘lamunna, ‘you will assuredly know’] is for an implicit oath, in other words [what is meant is] wa’Llāhi [la-ta‘lamunna, ‘By God you will assuredly know’]). Meccan, except for verses 52, 53 and 54, which are Medinese; it consists of 75 verses, revealed after [sūrat] Saba’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ye will come in time to know the Truth thereof) you will know the Truth of the Qur'an and that which it contains of promises and threats after you believe; and it is also said: after death. Some came to know after they accepted faith: these are the believers; and some came to know after death and these are the disbelievers. Both came to know that what Allah said in the Qur'an is the Truth'. And of the surah in which the Troops are mentioned, which is all Meccan to the exception of Allah's saying (Say: My slaves who have been prodigal to their own hurt! Despair not of the mercy of Allah, Who forgiveth all sins. Lo! He is the Forgiving, the Merciful. )-which is Medinan-, and it consists of 92 (sic) verses, 1,192 words and 4,000 letters: Surah 39: The Troops (al-Zumar) And of the surah in which the Troops are mentioned, which is all Meccan to the exception of Allah's saying {Say: My slaves who have been prodigal to their own hurt! Despair not of the mercy of Allah, Who forgiveth all sins. Lo! He is the Forgiving, the Merciful.)— which is Medinan—, and it consists of 92 (sic) verses, 1,192 words and 4,000 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَتَعْلَمُنَّ } أيها المتذكرون بتذكيراته، والمعرضون عنها { نَبَأَهُ } أي: صدق إخباره ومواعيده ووعيداته، وما يترتب عليها وعلى قصصه وأحكامه، وما ينكشف من حكمه ورموزه وإشارته { بَعْدَ حِينِ } [ص: 88] أي: بعد انخلاعكم عن لوازم ناسوتكم، واتصافكم بخلع اللاهوت في النشأة الأخرى، حين تُبلى السرائر، وتُكشف الضمائر، وترتفع الجب والأستار، فاعتبروا الآن يا أولي الأبصار، وذوي الاعتبار ما فيه من السرائر والأسرار\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها السائلك المتأمل في مرموزات القرآن، والمتدبر في درك إشاراته الخفية تحت أستار ألفاظه وأحكامه المتعلقة لتهذيب الظاهر والباطن، وتصفية السر عن التوجه نحو الغير مطلقاً، أن تعرف أولاً ما في نفسك من أعونة الشيطان وجنوده الأمارة بالسوء، المزعجة لك إلى قبول مأموراتها المقتضية للبعد عن جادة العدالة التوحيدية الإلهية، التي هي صراط الله الأقوم، وتجاهد معها مهما أمكنك وأعانك الحق ووفقك لتسخيرها إلى أن صارت مغلوبة لك مقهورة تحت قهرك، حسبما يسر الله ووفقك على غلبته\n\n\n\n\nثم بعد ذلك نبع من صدرك ينابيع الحكمة المترشحة من بحر الوحدة الذاتية، وجرى على لسانك ما أراد الله جريه وشاء، بعدما أفناك عنك، وأبقاك ببقائه، وصار سبحانه قلبك وسمعك وبصرك وجميع قواك، وحينئذ اجتامع الفرق، وارتبق الفتق، واتحد الظهور والبطون، وانطوى الأزل والأبد، واتصل الأول والآخر والظاهر والباطن\n\n\n\n\nوبالجملة: هو بكل شيء عليم ليس كمثله شيء ولا معه حي، وهو الحي القيوم السميع العليم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}