{
  "chapter": "ص",
  "text": "ام عندهم خزائن رحمة ربك العزيز الوهاب",
  "translations": [
    {
      "translation": "Or do they possess the treasuries of your Lord's mercy, the Almighty, the Ever-Giving?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have the stores of the mercy of your Lord, the mighty and munificent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they possess the treasures of your Lord, the Most Mighty, the Great Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they possess the treasures of the mercy of your, (Muhammad's), Lord, the Majestic and Munificent God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they hold the treasures of the mercy of your Lord, the Almighty, the Great Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they the treasures of the mercy of your Lord, the Almighty, the Real Bestower\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they have the treasures of the mercy of your Lord, the Mighty, the great Giver?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they the treasuries of thy Lord's mercy, the All-mighty, the All-giving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are theirs the treasures of the mercy of thy Lord, the Mighty, the Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they possess the treasures of the mercy of your Lord, the Mighty, the Great Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, are with them the treasures of the mercy of thy Lord, the Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they possess the treasuries of the mercy of your Lord, the All-mighty, the All-munificent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they the treasures of the mercy of thy Lord,- the Exalted in Power, the Grantor of Bounties without measure?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they the treasures of the Mercy of your Lord, the All-Mighty, the Real Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, have they the treasuries of the Mercy of your Lord, the Almighty, the Giving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they possess the treasuries of the mercy of your Lord—the Majestic, the Giver?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have the depositories of the mercy of your Lord, the Exalted in Might, the Bestower?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[38:9] Or do they possess the treasuries of your Lord’s mercy, the Mighty, the Victor, the Bestower?, [treasuries] such as prophethood and otherwise, so that they might give it to whomever they want?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or are theirs the treasures of the mercy of thy Lord, the Mighty, the Bestower) He says: or do they have in their hands prophethood and the Scriptures such that they bestow them upon whomever they wish, when He is the Mighty in retribution against whoever does not believe in Him, the Bestower Who has bestowed prophethood and the Scripture upon Muhammad (pbuh)?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأهم يعلمون الغيب { أَمْ عِندَهُمْ } أي: عند أولئك البعداء والمهمكين في بحر الغفلة والضلال { خَزَآئِنُ رَحْمَةِ رَبِّكَ } يا أكمل الرسل ومقاليد نعمه ومفاتيح كرمه\n ليكون لهم الخيرة في أمره سبحانه\n فيعطونها على من يشاء\n ويمنعونها عمَّن يشاء\n فكيف يحكمون على { ٱلْعَزِيزِ } الغالب على أمره في تصرفات مكله وملكوته بالاستقلال والاختيبار { ٱلْوَهَّابِ } [ص: 9] على من شاء وأراد بلا مشاورة ومظاهرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ أم عندهم خزائنُ رحمةِ ربك العزيزِ الوهَّاب } أي: ما هم بمالكي خزائن الرحمة حتى يُصيبوا بها مَن شاؤوا\n ويصرفوها عمَّن شاؤوا\n ويختاروا للنبوة بعض صناديدهم\n ويترفَّعوا بها عن محمد صلى الله عليه وسلم\n وإنما يملك الرحمة وخزائنها العزيزُ القاهر على خلقه\n الوهّاب الكثير المواهب\n المصيب بها مَن يشاء\n والمعنى: أن النبوة عطية من الله تعالى\n يتفضّل بها على مَن يشاء من عباده المصطفين\n لا مانع له\n فإنه الغالب\n الذي له أن يهب كل ما يشاء لكل مَن يشاء\n وفي إضافة اسم الرب المنبىء عن التربية والتبليغ إلى الكمال إلى ضميره ـ عليه الصلاة والسلام ـ من تشريفه واللطف به ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:21",
      "similarity": 0.6557031151280912
    },
    {
      "verse": "52:37",
      "similarity": 0.6051840340212058
    },
    {
      "verse": "12:55",
      "similarity": 0.5962094759222469
    },
    {
      "verse": "40:49",
      "similarity": 0.48770101223822243
    },
    {
      "verse": "37:100",
      "similarity": 0.4628956633823035
    }
  ]
}