{
  "chapter": "الزمر",
  "text": "الذين يستمعون القول فيتبعون احسنه او۟لئك الذين هدىهم الله واو۟لئك هم او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "Those who listen well to what is said and follow the best of it, they are the ones whom Allah has guided, they are the people of intelligence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word and then follow the best it contains, are the ones who have been guided by God, and are men of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to those who pay heed to what is said and follow the best of it. They are the ones whom Allah has guided to the Right Way; they are the ones endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), give the glad news to those of Our servants who listen to the words and only follow the best ones. Tell them that they are those whom God has guided. They are the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who heed attentively and follow the best from it; it is these whom Allah has guided, and it is these who have intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word and follow the best thereof, those are (the ones) whom Allah has guided and those are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the word, then follow the best of it; those are they whom Allah has guided, and those it is who are the men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who give ear to the Word and follow the fairest of it. Those are they whom God has guided; those -- they are men possessed of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hear advice and follow the best thereof. Such are those whom Allah guideth, and such are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to what is said and follow what is best in it. These are the ones God has guided; these are the people endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hearken Unto the word and follow that which is the exceLlent there of. These are they whom Allah hath guided, and those are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to the word [of Allah] and follow the best [interpretation] of it. They are the ones whom Allah has guided, and it is they who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word, and follow the best (meaning) in it: those are the ones whom Allah has guided, and those are the ones endued with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word [good advice La ilaha ill-Allah (none has the right to be worshipped but Allah) and Islamic Monotheism, etc.] and follow the best thereof (i.e. worship Allah Alone, repent to Him and avoid Taghut, etc.) those are (the ones) whom Allah has guided and those are men of understanding (like Zaid bin 'Amr bin Nufail, Salman Al-Farisi and Abu Dhar Al-Ghifari). [Tafsir Al-Qurtubi, Vol. 12, P. 244]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to the Words and follow what is finest of it. These are they whom Allah has guided. They are those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word, and follow the best of it. These are they whom God has guided. These are they who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who listen to speech and follow the best of it. Those are the ones Allah has guided, and those are people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:18] who listen to the words [of God] and follow the best [sense] of it, which is that which contains [the means to] righteousness for them. Those, they are the ones whom God has guided; and those, they are the people of pith, the possessors of intellect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Who hear advice) words (and follow the best thereof) and follow the wisest and clearest of these words, in that they desire it and act upon it. (Such are those whom Allah guideth) to veracity and right way; it is also said that this means: to the best of things, (and such are men of understanding) such are those possessed of intellect among people, i.e. Abu Bakr and his fellow believers and whoever follows them in the practice of the Sunnah and adherence to the community of believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبَشِّرْ } بها يا أكمل الرسل { عِبَادِ * ٱلَّذِينَ يَسْتَمِعُونَ ٱلْقَوْلَ } [الزمر: 17-18] الحق الذي صدر منَّا، ولا يمترون فيه، بل { فَيَـتَّبِعُونَ أَحْسَنَهُ } ويتمثلون بما أمروا به، ويجتنبون عما نُهوا عنه { أُوْلَـٰئِكَ } السعداء الموفقون على استماع قول الحق والامتثال به، هم { ٱلَّذِينَ هَدَاهُمُ ٱللَّهُ } إلى طريق توحيده، ووفقهم إلى الفناء فيه والبقاء ببقائه { وَ } بالجملة: { أُوْلَـٰئِكَ هُمْ أُوْلُواْ ٱلأَلْبَابِ } [الزمر: 18] الواصلون إلى لُبِّ اللباب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فبشِّرْ عبادِ الذين يستمعون القولَ } أي: ما نزل من الوحي { فيتبعون أحسَنَه } أرجحه وأكثره ثواباً، أو: أبْينه، الذي هو ضد المتشابه\n وهؤلاء هم الموصوفون باجتناب الطاغوت، والإنابة إلى ربهم، لكن وضع موضع ضميرهم الظاهر تشريفاً لهم بالإضافة، ودلالةً على أن مدار اتصافهم بالوصفين الجليلين كونهم نُقاداً في الدين، يُميِّزون الحق من الباطل، ويُؤثرون الأفضل\n { أولئك } المنعوتون بتلك المحاسن الجميلة هم { الذين هداهُمُ الله } لدينه، والإشارة إليهم باعتبار اتصافهم بما ذكر من النعوت الجليلة، وما فيه من معنى البُعد للإيذان بعلو رتبهم، وبُعد منزلتهم في الفضل\n { وأولئك هم أولوا الألبابِ } أي: هم أصحاب العقول الصافية، السليمة من معارضة الوهم ومنازعة الهوى، المستحقون للهداية، لا غيرهم\n وفيه دليل على أن الهداية تحصل بفضل الله تعالى، لقوله: { هداهم الله } ، وقبول النفس لها لقوله: { هم أولوا الألباب }\n الإشارة: مذهب الصوفية: الأخذ بالعزائم، والأرجح من كل شيء، عقداً، وقولاً، وعملاً، فأخذوا من العقائد مقام العيان، ولم يقنعوا بالدليل والبرهان، وأخذوا من الأقوال ألينها وأطيبها، ويجمع ذلك: حسن الخلق مع كل مخلوق، فآثروا العفو على القصاص، والصفح على العتاب، وغير ذلك من عزائم الشريعة على رخصها، ومن الأذكار: أرجحها وأجمعها، وهو الاسم المفرد، الذي هو سلطان الأسماء، ومن الأعمال: أعظمها وأرجحها، وهو عمل القلوب، الذي هو الذرة منه تعدل أمثال الجبال من أعمال الجوارح، كعبادة الفكرة والنظرة، وفي الحديث:\n\n \" تفكُّر ساعة أفضل من عبادة سبعين سنة \" \n",
      "translations": []
    }
  ]
}