{
  "chapter": "الزمر",
  "text": "فاعبدوا۟ ما شئتم من دونه قل ان الخسرين الذين خسروا۟ انفسهم واهليهم يوم القيمة الا ذلك هو الخسران المبين",
  "translations": [
    {
      "translation": "so worship anything you will apart from Him!' Say: 'The real losers are those who lose themselves and their families on the Day of Rising.' Is not that clear loss?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may worship what you will apart from Him.\" Say: \"Surely the greatest losers will be those who will lose their own selves and their people on the Day of Resurrection.\" Remember, this will be an all-too-evident loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So serve, apart from Him, whomsoever you please.” Say: “Behold, the real losers shall be those who will have lost their own selves and their kith and kin on the Day of Resurrection. Behold, that is the obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship besides Him whatever you want. The greatest losers are those whose souls and family members will be lost on the Day of Judgment for this is certainly a great loss\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore you can worship what you want besides Him!” Say, “The worst losers are those who will lose themselves and their household on the Day of Resurrection; pay heed! This is the plain loss!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, worship what you like besides Him.\" Say: \"The losers are those who will lose themselves and their families on the Day of Resurrection. Verily, that will be a manifest loss!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve then what you like besides Him. Say: The losers surely are those who shall have lost themselves and their families on the day of resurrection; now surely that is the clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so serve what you will apart from Him.' Say: 'Surely the losers are they who lose themselves and their families on the Day of Resurrection; is not that the manifest loss?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then worship what ye will beside Him. Say: The losers will be those who lose themselves and their housefolk on the Day of Resurrection. Ah, that will be the manifest loss!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as for yourselves, worship anything you please besides Him!\" Say, \"The real losers will be those who lose themselves and all their kith and kin on the Day of Resurrection. That is the [most] obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So worship whatsoever ye will, besidev him. Say thou: verily the losers are those who shall have lost themselves and their household\" on the Day of judgment LO! that will be a loss manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You worship whatever you wish besides Him.’ Say, ‘The losers are those who ruin themselves and their families on the Day of Resurrection.’ Indeed, that is a manifest loss!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve ye what ye will besides him.\" Say: \"Truly, those in loss are those who lose their own souls and their People on the Day of Judgment: Ah! that is indeed the (real and) evident Loss!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So worship what you like besides Him. Say (O Muhammad SAW): \"The losers are those who will lose themselves and their families on the Day of Resurrection. Verily, that will be a manifest loss!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for yourselves) worship what you will, other than Him' Say: 'The losers are surely those who lose themselves and their families on the Day ofResurrection. Is that not a clear loss'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“But you can worship whatever you wish besides Him.” Say, “The losers are those who lose their souls and their people on the Day of Resurrection.” That is indeed the obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So worship what you will besides Him.\" Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:15] So worship whatever you wish besides Him’, other than Him — herein is a threat for them as well as a declaration [of the fact] that they do not worship God, exalted be He. Say: ‘Indeed the losers are those who [will] have lost their souls and their families on the Day of Resurrection, by condemning their souls to abide [forever] in the Fire, and their failure to attaining [the bliss promised among] the black-eyed virgins who would have been prepared for them in Paradise had they been believers. Truly that is the manifest loss!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then worship what ye will beside Him) this is a threat and rebuke to them before the Prophet (pbuh) was commanded to fight them. (Say) to them, Muhammad: (The losers will be those who lose themselves) by missing both the life of this world and the Hereafter (and their housefolk) and servants and houses in the Garden (on the Day of Resurrection. Ah, that will be the manifest loss) losing the life of this world and the Hereafter is the manifest loss! 531\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱعْبُدُواْ } أيها المنهمكون في بحر الغي والضلال { مَا شِئْتُمْ مِّن دُونِهِ } سبحانه بمقتضى أهويتكم الفاسدة وآرائكم الكاسدة\n واعلموا أنه ما يترتب على عبادة غير الله إلا الخيبة والخسران { قُلْ إِنَّ ٱلْخَاسِرِينَ ٱلَّذِينَ خَسِرُوۤاْ أَنفُسَهُمْ } بعبادة غير الله والانحراف عن جادة توحيده\n { وَ } خسروا { أَهْلِيهِمْ } أيضاً بالإغواء الإضلال { يَوْمَ ٱلْقِيَامَةِ } المعدة لجزاء الأعمال { أَلاَ ذَلِكَ هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ } [الزمر: 15] والحرمان العظيم\n نعوذ بك منه يا ذا القوة المتين\n\n\nوكيف لا يكون خسران المشركين مبنياً وحرمانهم عظيماً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الكافرون: 6] أي: لا أعبد إلا الله { مخلصاً له ديني } من كل ما يشوبه من العلل، فأمر صلى الله عليه وسلم أولاً ببيان كونه مأموراً بعبادة الله وإخلاص الدين له، ثم بالإخبار بخوفه من العذاب على تقدير العصيان، ثم بالإخبار بامتثالهِ لِمَا أمر به على أبلغ وجه إظهاراً لتصلُّبه في الدين، وحسماً لمادة أطماعهم الفارغة، وتمهيداً لتهديدهم بقوله: { فاعبدوا ما شئتم } أن تعبدوه { من دونه } تعالى\n وفيه من الدلالة على شدة الغضب عليهم ما لا يخفى، كأنهم لَمَّا لَمْ ينتهوا عما نُهوا عنه أُمِرُوا به، كي يحيق بهم العذاب\n { قلْ إِن الخاسرين } الكاملين في الخسران، الذي هو عبارة عن: إضاعة ما يهمه، وإتلاف ما لا بد منه، هم { الذين خسروا أنفُسَهم } بتعريضها للعطب، { وأهلِيِهِم } بتعريضهم للتفرُّق عنهم، فرقاً لا جمع بعده إما في عذاب الأبد، إن ماتوا على الكفر معهم، أو: في الجنة، إن آمنوا، فلا يرونهم أبداً\n وقيل: خسروا أهلهم لأنهم لم يدخلوا مدخل الذين لهم أهل في الجنة، أو: خسروا أهلهم الذين كانوا يتمتعون بهم، لو آمنوا\n { ألا ذلك هو الخسرانُ المبينُ } الذي لا خسران أظهر منه\n\n\nوتصدير الجملة بحرف التنبيه، والإشارة بذلك إلى بُعد منزلة المشار إليه في الشر\n وتوسيط ضمير الفصل، وتعريف الخسران، ووصفه بالمبين من الدلالة على كمال هوله وفظاعته، وأنه لا خسران وراءه، ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:64",
      "similarity": 0.4689677565259608
    },
    {
      "verse": "10:55",
      "similarity": 0.42230717902488835
    },
    {
      "verse": "37:151",
      "similarity": 0.4222495630728235
    },
    {
      "verse": "10:62",
      "similarity": 0.3945410571145257
    },
    {
      "verse": "2:12",
      "similarity": 0.36149440638307495
    }
  ]
}