{
  "chapter": "الزمر",
  "text": "تنزيل الكتب من الله العزيز الحكيم",
  "translations": [
    {
      "translation": "THE REVELATION OF this Book is from God, the mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of this Book is from Allah, the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book is a revelation from God, the Majestic and All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book is from Allah, the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of this Book is from Allah, the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book is from Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sending down of the Book is from God the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Scripture is from Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book is sent down by God the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of this Book is from Allah, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The [gradual] sending down of the Book is from Allah, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of this Book is from Allah, the Exalted in Power, full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of this Book (the Quran) is from Allah, the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sending down of the Book is from Allah, the Almighty, the Wise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Book is from God, the Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The revelation of the Qur'an is from Allah, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:1] The revelation of the Book, the Qur’ān (tanzīlu’l-kitābi, the subject) is from God (mina’Llāhi, its predicate) the Mighty, in His kingdom, the Wise, in His handiwork.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying: (The revelation of the Scripture): '(The revelation of the Scripture is) He says: this Scripture is an address (from Allah, the Mighty) in retribution against those who disbelieve in Him, (the Wise) in His command and decree; He commanded that none should be worshipped except Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَنزِيلُ ٱلْكِتَابِ } المبين لطريق التوحيد، المنبه على وحدة الحق وكمالات أسمائه الحسنى وأوصافه العظمى { مِنَ ٱللَّهِ } المدبر لجميع ما جرى في ملكه وملكوته؛ إلا لا منزل في الوجود سواه سبحانه { ٱلْعَزِيزِ } الغالب في أمره بالاستقلال والاختيار { ٱلْحَكِيمِ } [الزمر: 1] المتقن في فعله حسب علمه المحيط وقدرته الشاملة وإرادته الكاملة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nبِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ { تَنزِيلُ ٱلْكِتَابِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ إِنَّآ أَنزَلْنَآ إِلَيْكَ ٱلْكِتَابَ بِٱلْحَقِّ فَٱعْبُدِ ٱللَّهَ مُخْلِصاً لَّهُ ٱلدِّينِ أَلاَ لِلَّهِ ٱلدِّينُ ٱلْخَالِصُ\n\n\n }\n قلت: { تنزيل } خبر، أي: هذا تنزيل، و { من الله }: صلة لتنزيل، أو: خبر ثان، أو: حال من التنزيل، عاملها: معنى الإشارة\n يقول الحق جلّ جلاله: هذا الذي تتلوه هو { تنزيلُ الكتاب } ، نزل { من } عند { الله العزيزِ } في سلطانه { الحكيم } في تدبيره\n وإيثار الوصفين للإيذان بجريان أثريهما في الكتاب، بجريان أحكامه ونفوذ أوامره ونواهيه",
      "translations": []
    }
  ]
}