{
  "chapter": "الزمر",
  "text": "لهم من فوقهم ظلل من النار ومن تحتهم ظلل ذلك يخوف الله به عباده يعباد فاتقون",
  "translations": [
    {
      "translation": "They will have awnings of Fire above them and awnings below them. By that Allah strikes fear into His slaves: 'So have taqwa, My slaves, of Me!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Above them will be a covering of fire, below them a cloud (of flames). With this does God warn His creatures: \"O My creatures, fear Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be sheets of fire above them and beneath them. This is the end against which Allah warns His servants. So dread My wrath, O you servants of Mine!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Above and below them their will be shadows of fire. This is how God frightens His servants. My servants have fear of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Above them are mountains of fire and beneath them are mountains of fire; Allah scares His bondmen with this; “O My bondmen! Fear Me!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have coverings of Fire, above them and covering (of Fire) beneath them. With this Allah frightens His servants: \"O My servants, therefore have Taqwa of Me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have coverings of fire above them and coverings beneath them; with that Allah makes His servants to fear, so be careful of (your duty to) Me, O My servants!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Above them they shall have overshadowings. of the Fire, and underneath them overshadowings; that it is wherewith God frightens His servants: \"O My servants, so fear you Me!\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have an awning of fire above them and beneath them a dais (of fire). With this doth Allah appal His bondmen. O My bondmen, therefor fear Me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have sheets of fire above them and sheets of fire beneath them.\" That is how God puts fear into the hearts of His servants. Fear me, then, My servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them! above them shall be coverings of Fire and beneath them coverings. Therewith Allah affrighteth His bondmen. O My bondmen! wherefore fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be canopies of fire above them, and [similar] canopies beneath them. With that Allah deters His servants. So, My servants, be wary of Me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have Layers of Fire above them, and Layers (of Fire) below them: with this doth Allah warn off his servants: \"O My Servants! then fear ye Me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have coverings of Fire, above them and covering (of Fire) beneath them; with this Allah does frighten His slaves: \"O My slaves, therefore fear Me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Above them they shall have layers of fire and beneath them layers. By this Allah puts fear into His worshipers' 'O My worshipers, fear Me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have layers of Fire above them, and layers beneath them. That is how God strikes fear into His servants—“O My servants! Beware of Me!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have canopies of fire above them and below them, canopies. By that Allah threatens His servants. O My servants, then fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:16] Above them they will have canopies, layers, of fire, and beneath them [they will have [similar] canopies, of fire. That is what God frightens His servants with, that is, the believing ones, that they may have fear of Him — this [sense of the verse] is suggested by [what follows]), “So, O servants of Mine, fear Me!”’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَهُمْ مِنْ فَوْقِهِمْ ظُلَلٌ مِنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ ذَلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ يَا عِبَادِ فَاتَّقُونِ (16){ لَهُمْ مِّن فَوْقِهِمْ ظُلَلٌ مِّنَ النار وَمِن تَحْتِهِمْ ظُلَلٌ } .بدل اشتمال من جملة { ألا ذَلِكَ هو الخسرانُ المبينُ } \\[ الزمر : 15 \\] ، وخص بالإِبدال لأنه أشد خسرانهم عليهم لتسلطه على إهلاك أجسامهم . والخسران يشتمل على غير ذلك من الخزي وغضب الله واليأس من النجاة . فضمير { لهم } عائد إلى مجموع { أنفُسَهُم وأهْلِيهِم } \\[ الزمر : 15 \\] .والظلل : اسم جمع ظلة ، وهي شيء مرتفع من بناء أو أعواد مثل الصُّفَّة يستظل به الجالس تحته ، مشتقة من الظلّ لأنها يكون لها ظِلّ في الشمس ، وتقدم ذلك عند قوله تعالى : { إلا أن يأتيهم الله في ظلل من الغمام } في سورة \\[ البقرة : 210 \\] ، وقوله : { وإذا غشيهم موج كالظلل } في سورة \\[ لقمان : 32 \\] . وهي هنا استعارة للطبقة التي تعلو أهل النار في نار جهنم بقرينة قوله : { مِنَ النَّارِ } ، شبهت بالظلة في العلوّ والغشيان مع التهكم لأنهم يتمنون ما يحجب عنهم حرّ النار فعبر عن طبقات النار بالظّلَل إشارة إلى أنهم لا واقي لهم من حر النار على نحو تأكيد الشيء بما يشبه ضده ، وقوله { لهم } ترشيح للاستعارة .وأما إطلاق الظلل على الطبقات التي تحتهم فهو من باب المشاكلة ولأن الطبقات التي تحتهم من النار تكون ظللاً لكفار آخرين لأن جهنم دركات كثيرة .{ ظُلَلٌ ذلك يُخَوِّفُ الله بِهِ } .تذييل للتهديد بالوعيد من قوله تعالى : { قُل إنَّ الخاسرين الذين خسِرُوا أنفسهم } \\[ الزمر : 15 \\] الآية ، أو استئناف بياني بتقدير سؤال يخطر في نفس السامع لوصف عذابهم بأنه ظلل من النار من فوقهم وظلل من تحتهم أن يقول سائل : ما يقع إعداد العذاب لهم في الآخرة بعد فوات تدارك كفرهم؟ فأجيب بأن الله جعل ذلك العذاب في الآخرة لتخويف الله عباده حين يأمرهم بالاستقامة ويشرع لهم الشرائع ليعلموا أنهم إذا لم يستجيبوا لله ورسله تكون ذلك عاقبتهم . ولما كان وعيد الله خبراً منه ولا يكون إلا صدقاً حقق لهم في الآخرة ما توعدهم به في الحياة وتخويف الله به معناه أنه يخوفهم بالإِخبار به وبوصفه ، أما إذاقتهم إياه فهي تحقيق للوعيد .ويعلم من هذا بطريق المقابلة جعل الجنة لترغيب عباده في التقوى ، إلا أنه طوى ذكره لأن السياق موعظة لأهل الشرك فالله جعل الجنة وجهنم إتماماً لحكمته ومراده من نظام الحياة الدنيا ليكون الناس فيها على أكمل ما ترتقي إليه النفس الزكية . والظاهر أن الجنة جعلها الله مسكناً لأهل النفوس المقدسة من الملائكة والناس مثل الرسل فلذلك هي مخلوقة من قبل ظهور التكليف ، وأما جهنم فيحتمل أنها مقدمة وهو ظاهر حديث : «اشتكت النار إلى ربها فقالت : أكل بعضي بعضاً فأذن لها بنَفَسَيْن نفس في الشتاء ونفس في الصيف» . ويحتمل أنها تخلق يوم الجزاء ويتأول الحديث .وقوله تعالى : { ذلك } إشارة إلى ما وصف من الخسران والعذاب بتأويل المذكور .والتخويف : مصدر خوفه ، إذا جعله خائفاً إذا أراه ووصف له شيئاً يثير في نفسه الخوف ، وهو الشعور بما يؤلم النفس بواسطة إحدى الحواس الخمس .والعباد المضاف إلى ضمير الجلالة في الموضعين هنا يعمّ كل عبد من الناس من مؤمن وكافر إذ الجميع يخافون العذاب على العصيان ، والعذاب متفاوت وأقصاه الخلود لأهل الشرك ، وليس العباد هنا مراداً به أهل القرب لأنه لا يناسب مقام التخويف ولأن قرينة قوله : { عِبَادَهُ } تدل على أن المنادَيْن جميع العباد ، ففرق بينه وبين نحو { يا عبادِ لا خوف عليكم اليوم } \\[ الزخرف : 68 \\] .( ه4س39ش16ن14/ن15-->عِبَادَهُ ياعباد }تفريع وتعقيب لِجملة { ذلك يُخوّفُ الله بهِ عِبَادَه } لأن التخويف مؤذن بأن العذاب أعد لأهل العصيان فناسب أن يعقب بأمر الناس بالتقوى للتفادي من العذاب .وقدم النداء على التفريع مع أن مقتضى الظاهر تأخيره عنه كقوله تعالى : { واتقون يا أولي الألباب } في سورة \\[ البقرة : 197 \\] لأن المقام هنا مقام تحذير وترهيب ، فهو جدير باسترعاء ألباب المخاطبين إلى ما سيرد من بعد من التفريع على التخويف بخلاف آية البقرة فإنها في سياق الترغيب في إكمال أعمال الحج والتزود للآخرة فلذلك جاء الأمر بالتقوى فيها معطوفاً بالواو .وحذفت ياء المتكلم من قوله : { يا عِبادِ } على أحد وجوه خمسة في المنادى المضاف إلى ياء المتكلم .\n\n",
      "translations": [
        {
          "translation": "(They have) i.e. the disbelievers of Mecca (an awning) canopies (of fire above them and beneath them a dais (of fire). With this doth Allah appal His bondmen) in the Qur'an. (0 My bondmen) He means Abu Bakr and his fellow believers, (therefore fear Me) therefore obey Me in that which I have commanded you!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { لَهُمْ مِّن فَوْقِهِمْ ظُلَلٌ } وأطباق { مِّنَ ٱلنَّارِ وَمِن تَحْتِهِمْ ظُلَلٌ } كذلك بالنسبة إلى من في الطبقة السفلى\n لأن دركات النيران مثل دركات الإمكان متطابقة بعضها فوق بعض\n فيكون سكانها أيضاً كذلك { ذَلِكَ } العذاب الذي سمعت وصفه { يُخَوِّفُ ٱللَّهُ بِهِ عِبَادَهُ } في دار الاختبار\n ويحذرهم عنه\n ثم ناداهم\n ليقبلوا إليه ويعتبروا من تخويفه\n فقال: { يٰعِبَادِ فَٱتَّقُونِ } [الزمر: 16] واحذروا من بطشي وتعذيبي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لهم من فوقهم ظُلَلٌ من النار } أي: لهم ظلل كثيرة متراكمة بعضها فوق بعض\n كائنة من النار\n { ومن تحتهم } أيضاً { ظُلَلٌ } أي: أطباق كثيرة\n بعضها تحت بعض\n هي ظلل لآخرين\n { ذلك } العذاب الفظيع هو الذي { يُخوِّف اللهُ به عبادَه } ويُحذِّرهم إياه ليجتنبوا ما يوقعهم فيه\n { يا عبادِ فاتقون } ولا تتعرضوا لِما يُوجب سخطي\n وهذه موعظة من الله بالغة\n منطوية على غاية اللطف والرحمة\n جعلنا الله من أهلها بمنِّه وكرمه\n الإشارة: الإخلاص سر بين الله وبين عبده\n لا يطلع عليه ملك فيكتبه\n ولا شيطان فيُفسده\n وهو الغيبة عما سوى الله\n فلا يرى في الدارين إلا الله\n ولا يعتمد إلا عليه\n ولا يخاف إلا منه\n ولا يرجو إلا إياه\n والإسلام هو: الانقياد بالجوارح في الظاهر للأحكام التكليفية\n والاستسلام في الباطن للأحكام القهرية التعريفية\n فالإسلام صورة\n والاستسلام روحها\n فالإسلام بلا استسلام جسد بلا روح\n وقوله تعالى: { فاعبدوا ما شئتم } هو تهديد لمَن عبدَ نفسه وهواه\n وهو الخسران المبين\n ويقال: الخاسر: مَن خسر أيام عمره بالبطالة والتقصير\n وخسر آخرته بعدم التأهُّب والتشمير\n وخسر مولاه بعدم الوصول إلى مشاهدة حضرة العلي الكبير\n وهي حضرة الذات\n فمَن خسر هذا الخسران\n فقد أحاطت به نار القطيعة والحجاب من كل مكان\n { ذلك يُخوِّف اللهُ بهِ عباده } قال القشيري: إن خفتَ اليوم كُفيت خوف ذلك اليوم\n وإلا فبين يديك عقبة كُؤُود\n ثم ذكر ضد أهل الخسران\n فقال: { وَٱلَّذِينَ ٱجْتَنَبُواْ ٱلطَّاغُوتَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:41",
      "similarity": 0.4613335644022635
    },
    {
      "verse": "16:50",
      "similarity": 0.43516807591845563
    },
    {
      "verse": "26:189",
      "similarity": 0.4081098954113509
    },
    {
      "verse": "29:55",
      "similarity": 0.3901907212683496
    },
    {
      "verse": "56:30",
      "similarity": 0.3753637020655975
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}