{
  "chapter": "الزمر",
  "text": "والذين اجتنبوا۟ الطغوت ان يعبدوها وانابوا۟ الى الله لهم البشرى فبشر عباد",
  "translations": [
    {
      "translation": "Those who shun the worship of false gods and turn towards Allah will have good news. So give good news to My slaves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are happy tidings for those who keep away from the worship of false gods and turn to God in repentance. Give glad tidings to My creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the other hand), good tidings await those who eschew serving false gods and penitently return to Allah. (O Prophet), give good tidings to My servants,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have avoided worshipping idols and have turned in repentance to God will receive the glad news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who stayed away from the worship of idols, and inclined towards Allah – for them are glad tidings; therefore give glad tidings to My bondmen. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid At-Taghut by not worshipping them and turn to Allah, for them are glad tidings; so announce the good news to My servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who keep off from the worship of the idols and turn to Allah, they shall have good news, therefore give good news to My servants,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who eschew the serving of idols and turn penitent to God, for them is good tidings! So give thou good tidings to My servants\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who put away false gods lest they should worship them and turn to Allah in repentance, for them there are glad tidings. Therefor give good tidings (O Muhammad) to My bondmen\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is good news for those who shun the worship of false deities and turn to God, so give good news to My servants,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who avoid the devils lest they should worship them and turn Unto Allah in penitence, for them are glad tidings. Wherefore give thou glad tidings Unto My bondmen,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who stay clear of the worship of fake deities and turn penitently to Allah, there is good news for them. So give good news to My servants\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who eschew Evil,- and fall not into its worship,- and turn to Allah (in repentance),- for them is Good News: so announce the Good News to My Servants,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid At-Taghut (false deities) by not worshipping them and turn to Allah in repentance, for them are glad tidings; so announce the good news to My slaves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who shun the worship of idols and turn in repentance to Allah for them glad tidings. Therefore give good tidings to My worshipers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who avoid the worship of idols, and devote themselves to God—theirs is the good news. So give good news to My servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have avoided Taghut, lest they worship it, and turned back to Allah - for them are good tidings. So give good tidings to My servants\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:17] As for those who steer clear of the worship of false deities, graven images, and turn penitently, apply themselves, to God, there are good tidings for them, of Paradise. So give [such] good tidings to My servants,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who put away false gods lest they should worship them) and those who shun the worship of the devil and idols (and turn to Allah in repentance) with faith and all other kinds of acts of obedience, (for them there are glad tidings) of the Garden at the moment of their death and also they will have glad tidings of the honour that Allah will bestow upon them at the gate of Paradise. (Therefore give good tidings (0 Muhammad) to my bondmen\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } المؤمنون الموحدون { ٱلَّذِينَ ٱجْتَنَبُواْ ٱلطَّاغُوتَ } المبالغ في الطغيان والعدوان، وهي الشيطان المضل المغوي، واستنكفوا { أَن يَعْبُدُوهَا } ويقبلوا منها وسوستها، ويصغوا إلى إغوائها وتغريرها { وَ } مع ذلك { أَنَابُوۤاْ } ورجعوا { إِلَى ٱللَّهِ } في النشأة الأولى على وجه الإخلاص والخوضع، نادمين عمَّا صدر عنهم من الجراءة والجريمة { لَهُمُ ٱلْبُشْرَىٰ } في النشأة الأخرى بالدرجة العظمى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن يعبدوها }: بدل اشتمال من \" الطاغوت \" ، والطاغوت: فعلوت، من الطغيان، بتقديم اللام على العين، وأصله: طغيوت، ثم طيغوت، ثم طاغوت\n يقول الحق جلّ جلاله: { والذين اجتنبوا الطاغوتَ } أي: البالغ أقصى غاية الطغيان، وهو الشيطان { أن يعبدُوها } أي: اجتنبوا عبادة الطاغوت، الذي هو الشيطان، أو: كل ما عُبد من دون الله، وكل مَن عَبَد غيرَ الله فإنما عَبَد الشيطان لأنه هو المزيّن لها، والحامل عليها\n { وأنابوا إِلى الله } أي: وأقبلوا إليه، معرضين عما سواه، إقبالاً كليّاً، { لهم البُشرى } بالنعيم المقيم، على ألسنة الرسل والملائكة، عند حضور الموت، وحين يُحشرون، وبعد ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:8",
      "similarity": 0.5861317134645515
    },
    {
      "verse": "39:54",
      "similarity": 0.5382143463322876
    },
    {
      "verse": "30:31",
      "similarity": 0.5359120323771456
    },
    {
      "verse": "40:13",
      "similarity": 0.5298571619286243
    },
    {
      "verse": "13:27",
      "similarity": 0.517456743201226
    }
  ]
}