{
  "chapter": "الزمر",
  "text": "الذين يستمعون القول فيتبعون احسنه او۟لئك الذين هدىهم الله واو۟لئك هم او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "Those who listen well to what is said and follow the best of it, they are the ones whom Allah has guided, they are the people of intelligence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word and then follow the best it contains, are the ones who have been guided by God, and are men of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to those who pay heed to what is said and follow the best of it. They are the ones whom Allah has guided to the Right Way; they are the ones endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), give the glad news to those of Our servants who listen to the words and only follow the best ones. Tell them that they are those whom God has guided. They are the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who heed attentively and follow the best from it; it is these whom Allah has guided, and it is these who have intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word and follow the best thereof, those are (the ones) whom Allah has guided and those are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the word, then follow the best of it; those are they whom Allah has guided, and those it is who are the men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who give ear to the Word and follow the fairest of it. Those are they whom God has guided; those -- they are men possessed of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hear advice and follow the best thereof. Such are those whom Allah guideth, and such are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to what is said and follow what is best in it. These are the ones God has guided; these are the people endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hearken Unto the word and follow that which is the exceLlent there of. These are they whom Allah hath guided, and those are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to the word [of Allah] and follow the best [interpretation] of it. They are the ones whom Allah has guided, and it is they who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word, and follow the best (meaning) in it: those are the ones whom Allah has guided, and those are the ones endued with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word [good advice La ilaha ill-Allah (none has the right to be worshipped but Allah) and Islamic Monotheism, etc.] and follow the best thereof (i.e. worship Allah Alone, repent to Him and avoid Taghut, etc.) those are (the ones) whom Allah has guided and those are men of understanding (like Zaid bin 'Amr bin Nufail, Salman Al-Farisi and Abu Dhar Al-Ghifari). [Tafsir Al-Qurtubi, Vol. 12, P. 244]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to the Words and follow what is finest of it. These are they whom Allah has guided. They are those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who listen to the Word, and follow the best of it. These are they whom God has guided. These are they who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who listen to speech and follow the best of it. Those are the ones Allah has guided, and those are people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:18] who listen to the words [of God] and follow the best [sense] of it, which is that which contains [the means to] righteousness for them. Those, they are the ones whom God has guided; and those, they are the people of pith, the possessors of intellect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولَئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ وَأُولَئِكَ هُمْ أُولُو الْأَلْبَابِ (18)وجملة { أُولئِكَ الذينَ هداهُم الله } مستأنفة لاسترعاء الذهن لتلقي هذا الخبر . وأكد هذا الاسترعاء بجعل المسند إليه اسم إشارة ليتميز المشار إليهم . أكمل تميزه مع التنبيه على أنهم كانوا أحرياء بهذه العناية الربانية لأجل ما اتصفوا به من الصفات المذكورة قبل اسم الإِشارة وهي صفات اجتنابهم عبادة الأصنام مع الإِنابة إلى الله واستماعهم كلام الله واتباعهم إياه نابذين ما يلقي به المشركون من أقوال التضليل .والإِتيان باسم الإشارة عقب ذكر أوصاف أو أخبارٍ طريقة عربية في الاهتمام بالحكم والمحكوم عليه فتارة يشار إلى المحكوم عليه كما هنا وتارة يشار إلى الخبر كما في قوله : { هذا وإن للطاغين لشر مئاب } في سورة \\[ ص : 55 \\] .وقد أفاد تعريف الجزأين في قوله : { أُولئكَ الذينَ هداهُم الله } قصر الهداية عليهم وهو قصر صفة على موصوف وهو قصر إضافي قصر تعيين ، أي دون الخاسرين الذين خسروا أنفسهم وأهليهم .ومعنى { هدَاهُمُ الله } أنهم نالوا هذه الفضيلة بأن خلق الله نفوسهم قابلة للهدى الذي يخاطبهم به الرسول صلى الله عليه وسلم فتهيأت نفوسهم لذلك وأقبلوا على سماع الهدى بشَرَاشِرهم وسعوا إلى ما يبلغهم إلى رضاه وطلبوا النجاة من غضبه . وليس المراد بهدي الله إياهم أنه وجه إليهم أوامر إرشاده لأن ذلك حاصل للذين خوطبوا بالقرآن فأعرضوا عنه ولم يتطلبوا البحث عما يرضي الله تعالى فأصروا على الكفر .وأشارت جملة { وأُولئِكَ هُم أُولوا الألبَابِ } إلى معنى تهيئهم للاهتداء بما فطرهم الله عليه من عقول كاملة ، وأصل الخِلقة ميَّالة لفهم الحقائق غير مكترثة بالمألوف ولا مُرَاعاة الباطل ، على تفاوت تلك العقول في مدى سرعة البلوغ للاهتداء ، فمنهم من آمن عند أول دعاء النبي صلى الله عليه وسلم مثل خديجة وأبي بكر الصديق وعلي بن أبي طالب ، ومنهم من آمن بُعيد ذلك أو بَعده ، فأشير إلى رسوخ هذه الأحوال في عقولهم بذكر ضمير الفصل مع كلمة { أُولُوا } الدالة على أن الموصوف بها ممسك بما أضيفت إليه كملة { أُوْلُوا } ، وبما دل عليه تعريف { الألبابِ } من معنى الكمال ، فليس التعريف فيه تعريف الجنس لأن جنس الألباب ثابت لجميع العقلاء . وأشار إعادة اسم الإِشارة إلى تميزهم بهذه الخصلة من بين نظرائهم وأهل عصرهم .وفيه تنبيه على أن حصول الهداية لا بدّ له من فاعل وقابل ، فأشير إلى الفاعل بقوله تعالى : { هداهم الله } ، وإلى القابل بقوله : { هُم أُولوا الألبابِ } . وفي هذه الجملة من القصر ما في قوله : { أُولئِكَ الذينَ هداهُمُ الله } .وقد دل ثناء الله على عباده المؤمنين الكمّل بأنهم أحرزوا صفة اتباع أحسن القول الذي يسمعونه ، على شرف النظر والاستدلال للتفرقة بين الحق والباطل وللتفرقة بين الصواب والخطأ ولغلق المجال في وجه الشبهة ونفي تلبس السفسطة . وهذا منه ما هو واجب على الأعيان وهو ما يكتسب به الاعتقاد الصحيح على قدر قريحة الناظر ، ومنه واجب على الكفاية وهو فضيلة وكمال في الأعيان وهو النظر والاستدلال في شرائع الإسلام وإدراكُ دلائل ذلك والفقهُ في ذلك والفهم فيه والتهممُ برعاية مقاصده في شرائع العبادات والمعاملات ، وآداب المعاشرة لإِقامة نظام الجامعة الإِسلامية على أصدق وجه وأكمله ، وإلجامُ الخائضين في ذلك بعماية وغرور ، وإلقامُ المتنطعين والملحدين .ومما يتبع ذلك انتقاء أحسن الأدلة وأبلغغِ الأقوال الموصلة إلى هذا المقصود بدون اختلال ولا اعتلال بتهذيب العلوم ومؤلفاتها ، فقد قيل : خذوا من كل علم أحسنه أخذاً من قوله تعالى هنا : { الذين يستمعون القول فيتَّبعون أحسنَهُ } . وعن ابن زيد نزلت في زيد بن عَمرو بن نفيل وأبي ذر الغفاري وسلمان الفارسي اجتنبوا الطاغوت أن يعبدوها في جاهليتهم واتّبعوا أحسن ما بلغهم من القول .وعن ابن عباس نزل قوله : { فبشّر عِبَادِ الذينَ يستَمِعونَ القولَ } الآية في عثمان وعبد الرحمان بن عوف وطلحة والزبير وسعيد بن زيد ، وسعد بن أبي وقاص جاؤوا إلى أبي بكر الصديق حين أسلم فسألوه فأخبرهم بإيمانه فآمنوا .\n\n",
      "translations": [
        {
          "translation": "Who hear advice) words (and follow the best thereof) and follow the wisest and clearest of these words, in that they desire it and act upon it. (Such are those whom Allah guideth) to veracity and right way; it is also said that this means: to the best of things, (and such are men of understanding) such are those possessed of intellect among people, i.e. Abu Bakr and his fellow believers and whoever follows them in the practice of the Sunnah and adherence to the community of believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الذين يستمعون القول } كالعزائم والرخص والواجب والمندوب في قول الحق والغير { فيتبعون أحسنه } كالعزائم دون الرخص والواجب دون المندوب والقول حق في الكل لا غير { أولئك الذين هداهم الله } إليه بنور الهداية الأصلية { وأولئك هم أولو الألباب } المميزون بين الأقوال بألبابهم المجرّدة فيتلقون المعاني المحققة دون غيرها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { فَيَـتَّبِعُونَ أَحْسَنَهُ } ويتمثلون بما أمروا به\n ويجتنبون عما نُهوا عنه { أُوْلَـٰئِكَ } السعداء الموفقون على استماع قول الحق والامتثال به\n هم { ٱلَّذِينَ هَدَاهُمُ ٱللَّهُ } إلى طريق توحيده\n ووفقهم إلى الفناء فيه والبقاء ببقائه { وَ } بالجملة: { أُوْلَـٰئِكَ هُمْ أُوْلُواْ ٱلأَلْبَابِ } [الزمر: 18] الواصلون إلى لُبِّ اللباب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك } المنعوتون بتلك المحاسن الجميلة هم { الذين هداهُمُ الله } لدينه\n والإشارة إليهم باعتبار اتصافهم بما ذكر من النعوت الجليلة\n وما فيه من معنى البُعد للإيذان بعلو رتبهم\n وبُعد منزلتهم في الفضل\n { وأولئك هم أولوا الألبابِ } أي: هم أصحاب العقول الصافية\n السليمة من معارضة الوهم ومنازعة الهوى\n المستحقون للهداية\n لا غيرهم\n وفيه دليل على أن الهداية تحصل بفضل الله تعالى\n لقوله: { هداهم الله } \n وقبول النفس لها لقوله: { هم أولوا الألباب }\n الإشارة: مذهب الصوفية: الأخذ بالعزائم\n والأرجح من كل شيء\n عقداً\n وقولاً\n وعملاً\n فأخذوا من العقائد مقام العيان\n ولم يقنعوا بالدليل والبرهان\n وأخذوا من الأقوال ألينها وأطيبها\n ويجمع ذلك: حسن الخلق مع كل مخلوق\n فآثروا العفو على القصاص\n والصفح على العتاب\n وغير ذلك من عزائم الشريعة على رخصها\n ومن الأذكار: أرجحها وأجمعها\n وهو الاسم المفرد\n الذي هو سلطان الأسماء\n ومن الأعمال: أعظمها وأرجحها\n وهو عمل القلوب\n الذي هو الذرة منه تعدل أمثال الجبال من أعمال الجوارح\n كعبادة الفكرة والنظرة\n وفي الحديث:\n \" تفكُّر ساعة أفضل من عبادة سبعين سنة \" \n\n فأوقاتهم كلها ليلة القدر\n وكالتخلُّق بمكارم الأخلاق\n كالرضا\n والتسليم\n والحلم\n والسخاء\n والكرم\n وغير ذلك من محاسن الخِلل\n الذي هو من عمل القلوب\n فهم الذين تحققت فيهم البشارة بقوله: { فبشِّر عباد الذين يستمعون القول فيتبعون أحسنه }\n وقال الورتجبي ـ بعد كلام: ويَتبع الكلام الأزلي ـ الذي هو الخطاب ـ بالفهم العجيب\n والعلم الغريب\n والإدراك الصافي\n وانفراد الحق عن المخلوق\n في المحبة\n والشوق\n والمعرفة\n والتوحيد\n والإخلاص\n والعبودية\n والربوبية\n والحرية\n فهذا أفضل وِرد بالبديهة\n من حيث ظهور الأنباء العجيبة\n والروح القدسية\n والإلهامات الربانية\n\n انظر بقية كلامه\n وقال القشيري: الاستماع يكون لكل شيء\n والاتباع يكون للأحسن\n ثم قال: مَن عرف الله لا يسمع إلا بالله\n هـ\n { أولئك الذين هداهم الله } إلى صريح معرفته العيانية\n { وأولئك هم أولوا الألباب } \n ولب الشيء: قلبه وخالصه\n فقلوبهم خالصة لمولاهم\n وأرواحهم متنعمة بشهود حبيبها\n وأسرارهم متنزهة في رياض ملكوت سيدها\n وبالله التوفيق\n ثم ذكر ضدهم\n فقال: { أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ ٱلْعَذَابِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.850607699892293
    },
    {
      "verse": "2:269",
      "similarity": 0.7176210888427121
    },
    {
      "verse": "3:190",
      "similarity": 0.6682891753038606
    },
    {
      "verse": "14:52",
      "similarity": 0.6575393682169517
    },
    {
      "verse": "65:10",
      "similarity": 0.648197885553302
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}