{
  "chapter": "الزمر",
  "text": "افمن حق عليه كلمة العذاب افانت تنقذ من فى النار",
  "translations": [
    {
      "translation": "But as for those against whom the decree of Punishment is justly carried out, can you rescue those who are in the Fire?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he against whom the sentence of punishment has been justified (be rescued)? Can you save him who is in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), can you save him (from chastisement) against whom the sentence of chastisement has become due; him who has, (as it were), already fallen into the Fire?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you rescue the one who is destined to suffer the torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will the one upon whom the Word of punishment has proved true, ever be equal to those who are forgiven? So will you guide and save the one who deserves the fire? (Because the hearts of some disbelievers are sealed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is, then one against whom the Word of punishment is justified (equal to the one who avoids evil) Will you rescue him who is in the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! as for him then against whom the sentence of chastisement is due: What! can you save him who is in the fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He against whom the word of chastisement is realized -- shalt thou deliver him out of the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he on whom the word of doom is fulfilled (to be helped), and canst thou (O Muhammad) rescue him who is in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what of him against whom the sentence of punishment is justified? Can you rescue one who is already in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he then on whom is justified the decree of torment - wilt thou rescue him who is in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he against whom the word of punishment has become due…? Can you rescue someone who is in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is, then, one against whom the decree of Punishment is justly due (equal to one who eschews Evil)? Wouldst thou, then, deliver one (who is) in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is, then one against whom the Word of punishment justified (equal to the one who avoids evil). Will you (O Muhammad SAW) rescue him who is in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you save from the Fire he whom against the word of punishment has been realized?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What about someone who has deserved the sentence of punishment? Is it you who can save those in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, is one who has deserved the decree of punishment [to be guided]? Then, can you save one who is in the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:19] Can he against whom the word of chastisement has been fulfilled …?, namely [the words], I will surely fill Hell [with jinn and mankind together] [Q. 11:119]; Will you deliver, bring out, one who is in the Fire? (this is the response to the conditional clause, in which the overt qualification [man fī’l-nār, ‘one who is in the Fire’] replaces the pronominalisation [a-fa-man, ‘he … whom’]; the hamza [in a-fa-anta, ‘will you’] is for rejection, in other words [the sense is that] you will not be able to guide him and therefore deliver him from the Fire).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he on whom the word of doom is fulfilled) is the one upon whom the doom is decreed, i.e. Abu Jahl and his host, (and canst thou (0 Muhammad) rescue him who is in the Fire) he upon whom the Fire is decreed?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على وجه التنبيه والتأديب: { أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ ٱلْعَذَابِ } أتسعى وتجتهد يا أكمل الرسل في تخليص من ثبت منَّا في سابق قضائنا وحضرة علمنا الحكم بتعذيبه؛ يعني: أبا لهب وولده وأتباعه { أَفَأَنتَ تُنقِذُ مَن فِي ٱلنَّارِ } [الزمر: 19] أي: أتظن وتعتقد في نفسك أنك تقدر على إنقاذ من هو مخلد في نار جهنم بمقتضى قهرنا وجلالنا، فلا تتعب نفسك فيما ليس في وسعك؛ إذ لا بدل قولنا، ولا يغير حكمنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مَن }: شرطية، دخل عليها همزة الإنكار، والفاء عاطفة على جملة محذوفة ليتعلق الإنكار والنفي بمضمونها معاً، أي: أنت مالك أمر الناس، فمَنْ حَقَّ علية كلمة العذاب أفأنت تُنقذه، ثم كررت الهمزة في الجزاء لتأكيد الإنكار، وتكريره، لَمّا طال الكلام، ثم وضع موضع الضمير \" مَن في النار \" لمزيد تشديد الإنكار والاستبعاد، والتنبيه على أن المحكوم عليه بالعذاب بمنزلة الواقع في النار، ويجوز أن يكون الجزاء محذوفاً، دلّ عليه: { أفأنت تُنقذ }\n\n\n الخ، أي: أفمن حقَّ عليه العذاب تنقذه أنت\n يقول الحق جلّ جلاله: { أفمن حقّ عليه كلمةُ العذاب }\n وهم عبَدَة الطاغوت ومتبعو خطواتها، كما يلُوح إليه التعبير عنهم بـ \" مَن حق عليه كلمة العذاب \" ، فإن المراد بها قوله تعالى لإبليس:\n\n[ص: 85]، وقوله تعالى:\n\n[الأعراف: 18] أي: أفمن حقّت عليه كلمة الشقاء، تقدر أن تهديه وتُنقذه من الكفر، الذي هو سبب النار؟ أو: تقول: المحكوم عليه بالنار بمنزلة الداخل فيها، فاجتهاده صلى الله عليه وسلم في دعائهم إلى الإيمان سعي في إنقاذهم من النار بعد الدخول فيها، وهو لا يفيد\n فالمراد: تسكينه صلى الله عليه وسلم وتفريغه من الحرص عليهم\n الإشارة: مَن سبق له الإبعاد لا يفيده الكد والاجتهاد، ومَن أسدل بينه وبينه الحجاب، لا يفيده إلا الوقوف بالباب، حتى يحنّ الكريمُ الوهاب، فإنّ العواقب في هذه الدار مبهمة، والأعمال بالخواتم\n قال القشيري: والذين حقت عليهم كلمةُ العذاب، فإنهم اليوم اليوم لا يخرجون من حجاب قلوبهم\n هـ\n وبالله التوفيق\n ولمَّا كان المراد بقوله: { أفأنت تُنقذ مَن في النار } هم الذين قيل في حقهم:\n",
      "translations": []
    }
  ]
}