{
  "chapter": "الزمر",
  "text": "قل انى امرت ان اعبد الله مخلصا له الدين",
  "translations": [
    {
      "translation": "Say: 'I am commanded to worship Allah, making my deen sincerely His.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am commanded to worship God with obedience all-exclusive for Him;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “I am bidden to serve Allah, consecrating my devotion to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am commanded to worship God and be devoted to His religion\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am commanded that I must worship Allah as His sincere bondman.” (And so must you too.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Verily, I am commanded to worship Allah, making religion sincerely for Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am commanded that I should serve Allah, being sincere to Him in obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I have been commanded to serve God making my religion His sincerely;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Lo! I am commanded to worship Allah, making religion pure for Him (only).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I have been commanded to serve God, dedicating my worship entirely to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: verily I am commanded to worship Allah, making for Him religion exclusive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I have been commanded to worship Allah with exclusive faith in Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Verily, I am commanded to serve Allah with sincere devotion;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Verily, I am commanded to worship Allah (Alone) by obeying Him and doing religious deeds sincerely for Allah's sake only and not to show off, and not to set up rivals with Him in worship;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am ordered to worship Allah making my religion sincerely His.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I was commanded to serve God, devoting my religion exclusively to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:11]   Say: ‘Indeed I have been commanded to worship God devoting [my] religion purely to Him, [pure] of any idolatry,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَهُ الدِّينَ (11) بعد أن أمر الله رسوله صلى الله عليه وسلم بخطاب المسلمين بقوله : { قُل يا عِبادِ الذين ءَامنوا اتَّقُوا } \\[ الزمر : 10 \\] أمر رسوله صلى الله عليه وسلم بعد ذلك أن يقول قولاً يتعين أنه مَقول لغير المسلمين .نقل الفخر عن مقاتل : أن كفار قريش قالوا للنبيء صلى الله عليه وسلم ما يحملك على هذا الدين الذي أتيتنا به ، ألا تنظر إلى ملة أبيك وجدك وسادات قومك يعبدون اللاّت والعُزّى ، فأنزل الله : { قل إني أُمرتُ أن أعْبُدَ الله مُخلصاً له الدِّينَ } .وحقاً فإن إخبار النبي صلى الله عليه وسلم بذلك إذا حمل على صريحه إنما يناسب توجيهه إلى المشركين الذي يبْتغون صرفه عن ذلك . ويجوز أن يكون موجهاً إلى المسلمين الذين أذن الله لهم بالهجرة إلى الحبشة على أنه توجيه لبقائه بمكة لا يهاجر معهم لأن الإِذن لهم بالهجرة للأمن على دينهم من الفتن ، فلعلهم ترقبوا أن يهاجر الرسول صلى الله عليه وسلم معهم إلى الحبشة فآذنهم الرسول صلى الله عليه وسلم بأن الله أمره أن يعبد الله مخلصاً له الدين ، أي أن يوحده في مكة فتكون الآية ناظرة إلى قوله تعالى : { فاصدع بما تؤمر وأعرض عن المشركين إنا كفيناك المستهزئين } \\[ الحجر : 94 95 \\] ، أي أن الله أمره بأن يقيم على التبليغ بمكة فإنه لو هاجر إلى الحبشة لانقطعت الدعوة وإنما كانت هجرتهم إلى الحبشة رخصة لهم إذ ضعفوا عن دفاع المشركين عن دينهم ولم يرخَّص ذلك للنبيء صلى الله عليه وسلموقد جاء قريب من هذه الآية بعد ذكر أن حياة الرسول صلى الله عليه وسلم ومماته لله ، أي فلا يَفرق من الموت في سبيل الدين وذلك قوله تعالى في سورة \\[ الأنعام : 162 - 163 \\] : { قل إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين }\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca-this is when they said to him: revert to the religion of our forefathers-: (Lo! I am commanded) in the Qur'an (to worship Allah, making religion pure for Him (only)) and make my worship of Allah and faith in Allah's divine Oneness sincere to Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه آمراً لحبيبه بالتوصية والتبليغ لعموم عباده كلاماً ناشئاً عن محض الحكمة\n خالياً عن رعونات الرياء\n متمحضاً للنصح والتكميل: { قُلْ } يا أكمل الرسل { إِنِّيۤ أُمِرْتُ } من قبل ربي { أَنْ أَعْبُدَ ٱللَّهَ } حق عبادته\n وأطيعه حق إطاعته { مُخْلِصاً لَّهُ ٱلدِّينَ } [الزمر: 11] والانقياد الصادر مني\n لأتسبب بإطاعتي وانقيادي على وجه الإخلاص كي أعرفه حق معرفته\n ويفيض على قلبي زلال توحيده وكرامته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قُل } لهم: { إِني أُمرتُ أن أعبدَ اللهَ } حال كوني { مخلصاً له الدينَ } من كل ما ينافيه من الشرك والرياء\n وما أمر به صلى الله عليه وسلم يُؤمر به أمته بل هم المقصودون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:14",
      "similarity": 0.9402676739302859
    },
    {
      "verse": "39:2",
      "similarity": 0.8334435824783211
    },
    {
      "verse": "37:169",
      "similarity": 0.7999629225100319
    },
    {
      "verse": "37:40",
      "similarity": 0.7888049169681237
    },
    {
      "verse": "37:74",
      "similarity": 0.7888049169681237
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}