{
  "chapter": "الزمر",
  "text": "قل يعباد الذين ءامنوا۟ اتقوا۟ ربكم للذين احسنوا۟ فى هذه الدنيا حسنة وارض الله وسعة انما يوفى الصبرون اجرهم بغير حساب",
  "translations": [
    {
      "translation": "Say: 'Slaves of Mine who have iman! have taqwa of your Lord. For those who do good in this world there is good and Allah's earth is spacious. The steadfast will be paid their wages in full without any reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"O my creatures who have come to belief, have fear of displeasing your Lord. There is good for those who do good in this world, and productive is God's earth. Only those who persevere will get their reward measureless.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them (O Prophet): “O you servants of Mine who believe, have fear of your Lord. A good end awaits those who did good in this world. Allah's earth is spacious. Verily those who persevere shall be granted their reward beyond all reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to My believing servants, \"Have fear of your Lord. Those who act righteously in this life will receive good reward. The land of God is vast. God will recompense the deeds of those who have exercised patience, without keeping an account\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “O my slaves who have accepted faith! Fear your Lord; for those who do good deeds in this world is goodness (in return); and Allah’s earth is spacious; it is the steadfast who will be paid their full reward, without account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O My servants who believe, have Taqwa of your Lord. Good is for those who do good in this world, and Allah's earth is spacious! Only those who are patient shall receive their reward in full, without reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O my servants who believe! be careful of (your duty to) your Lord; for those who do good in this world is good, and Allah's earth is spacious; only the patient will be paid back their reward in full without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My servants who believe, fear your Lord. For those who do good in this world good, and God's earth is wide. Surely the patient will be paid their wages in full without reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O My bondmen who believe! Observe your duty to your Lord. For those who do good in this world there is good, and Allah's earth is spacious. Verily the steadfast will be paid their wages without stint.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"[God says] O My servants who have believed, fear your Lord. For those who do good in this world will have a good reward -- and God's earth is spacious. Truly, those who persevere patiently will be requited without measure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O Mine bondmen who believe! fear your Lord. For those who do good in this world there is good: and Allah's earth is spacious. Verily the patient shall be paid in full their hire without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘[Allah declares:] “O My servants who have faith! Be wary of your Lord. For those who do good in this world there will be a good [reward], and Allah’s earth is vast. Indeed the patient will be paid in full their reward without any reckoning.” ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O ye my servants who believe! Fear your Lord, good is (the reward) for those who do good in this world. Spacious is Allah's earth! those who patiently persevere will truly receive a reward without measure!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"O My slaves who believe (in the Oneness of Allah Islamic Monotheism), be afraid of your Lord (Allah) and keep your duty to Him. Good is (the reward) for those who do good in this world, and Allah's earth is spacious (so if you cannot worship Allah at a place, then go to another)! Only those who are patient shall receive their rewards in full, without reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My worshipers who believe, fear your Lord. For those who do good in this world there is good and the earth of Allah is wide surely, those who are patient will be recompensed in full without count'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O My devotees who have believed, keep your duty to your Lord. For those who do good in this world, is goodness. And God’s earth is vast. The steadfast will be paid their wages in full, without reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:10] Say: ‘O servants of Mine who believe! Fear your Lord, that is to say, [fear] His chastisement, by being obedient to Him. For those who are virtuous in this world, through obedience, there will be good, and that is Paradise, and God’s earth is vast, so emigrate throughout it, away from the [company of] disbelievers and the sight of indecencies. Truly the steadfast, in [their] obedience [of God] and in [enduring] whatever [hardship] they may be tested with, will be paid their reward in full without any reckoning’, without any measure or any scales [to work it out].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ يَا عِبَادِ الَّذِينَ آَمَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ (10)لما أجري الثناء على المؤمنين بإقبالهم على عبادة الله في أشدّ الآناء وبشدة مراقبتهم إياه بالخوف والرجاء وبتمييزهم بصفة العلم والعقل والتذكر ، بخلاف حال المشركين في ذلك كله ، أُتبع ذلك بأمر رسول الله صلى الله عليه وسلم بالإِقبال على خطابهم للاستزادة من ثباتهم ورباطة جأشهم ، والتقديرُ : قل للمؤمنين ، بقرينة قوله : { ياعِبَادِ الذين ءَامنُوا } الخ .وابتداء الكلام بالأمر بالقول للوجه الذي تقدم في نظيره آنفاً ، وابتداء المقول بالنداء وبوصف العبودية المضاف إلى ضمير الله تعالى ، كل ذلك يؤذن بالاهتمام بما سيقال وبأنه سيقال لهم عن ربهم ، وهذا وضعٌ لهم في مقام المخاطبة من الله وهي درجة عظيمة . وحذفت ياء المتكلم المضاف إليها { عباد } وهو استعمال كثير في المنادَى المضاف إلى ياء المتكلم .وقرأه العشرة { يَاعِبادِ بدون ياء في الوصل والوقف كما في إبراز المعاني } لأبي شامة وكما في «الدرة المضيئة» في القراءات الثلاث المتممة للعشر لعلي الضباع المصري ، بخلاف قوله تعالى : { قل ياعبادي الذين أسرفوا على أنفسهم } \\[ الزمر : 53 \\] الآتي في هذه السورة ، فالمخالفة بينهما مجرد تفنن . وقد يوجه هذا التخالف بأن المخاطبين في هذه الآية هم عباد الله المتقون ، فانتسابهم إلى الله مقرر فاستُغني عن إظهار ضمير الجلالة في إضافتهم إليه ، بخلاف الآية الآتية ، فليس في كلمة { يَاعِبَادِ } من هذه الآية إلاَّ وَجه واحد باتفاق العشرة ولذلك كتبها كتّاب المصحف بدون ياء بعد الدال .وما وقع في «تفسير ابن عطية» من قوله : وقرأ جمهور القراء { قل يا عباديَ } بفتح الياء . وقرأ أبو عمرو أيضاً وعاصم والأعشى وابن كثير { يا عِبَادِ } بغير ياء في الوصل ا ه . سهو ، وإنما اختلف القراء في الآية الآتية { قُل ياعِبَادي الذين أسرفوا على أنفسهم } في هذه السورة \\[ 53 \\] فإنها ثبتت فيه ياء المتكلم فاختلفوا كما سنذكره .والأمر بالتقوى مراد به الدوام على المأمور به لأنهم متّقون من قبلُ ، وهو يشعر بأنهم قد نزل بهم من الأذى في الدين ما يخشى عليهم معه أن يُقصّروا في تقواهم . وهذا الأمر تمهيد لما سيوجه إليهم من أمرهم بالهجرة للسلامة من الأذى في دينهم ، وهو ما عُرض به في قوله تعالى : { وأرْضُ الله واسِعَة } .وفي استحضارهم بالموصول وصلته إيماء إلى أن تقَرر إيمانهم مما يقتضي التقوى والامتثال للمهاجرة . وجملة { للذين أحسنوا في هذه الدُّنيا حسنةٌ } وما عطف عليها استئناف بياني لأن إيراد الأمر بالتقوى للمتصفين بها يثير سؤال سائل عن المقصود من ذلك الأمر فأريد بيانه بقوله : { أرض الله واسعة ، } ولكن جُعل قوله { للذين أحسنوا في هذه الدنيا حسنةٌ } تمهيداً له لقصد تعجيل التكفل لهم بموافقة الحسنى في هجرتهم . ويجوز أن تكون جملة { للذين أحسنوا في هذه الدنيا حسنةٌ } مسوقة مساق التعليل للأمر بالتقوى الواقع بعدها .والمراد بالذين أحسنوا : الذين اتقوا الله وهم المؤمنون الموصوفون بما تقدم من قوله : { أمن هو قانت } \\[ الزمر : 9 \\] الآية ، لأن تلك الخصال تدل على الإِحسان المفسر بقول النبي صلى الله عليه وسلم \" أن تعبد الله كأنك تراه فإن لم تكنْ تراه فإنه يراك \" ، فعدل عن التعبير بضمير الخطاب بأن يقال : لكم في الدنيا حسنة ، إلى الإِتيان باسم الموصول الظاهر وهو { الذين أحسنوا } ليشمل المخاطبين وغيرهم ممن ثبتت له هذه الصلة . وذلك في معنى : اتقوا ربكم لتكونوا محسنين فإن للذين أحسنوا حسنة عظيمة فكونوا منهم . وتقديم المسند في { للذين أحسنوا في هذه الدنيا حسنةٌ } للاهتمام بالمحسَن إليهم وأنهم أحرياء بالإِحسان .والمراد بالحسنة الحالة الحسنة ، واستغني بالوصف عن الموصوف على حد قوله : { ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة } \\[ البقرة : 201 \\] . وقولِه في عكسه { وجزاء سيئة سيئة مثلها } \\[ الشورى : 40 \\] . وتوسيط قوله : { في هذه الدنيا } بين { للذين أحسنوا } وبين { حَسَنَةٌ } نظم مما اختص به القرآن في مواقع الكلم لإِكثار المعاني التي يسمح بها النظم ، وهذا من طرق إعجاز القرآن . فيجوز أن يكون قوله : { في هذه الدُّنيا } حالاً من { حَسَنَةٌ } قدم على صاحب الحال للتنبيه من أول الكلام على أنها جزاؤهم في الدنيا ، لقلة خطور ذلك في بالهم ضمن الله لهم تعجيل الجزاء الحسن في الدنيا قبل ثواب الآخرة على نحو ما أثنى على مَن يقول : { ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة } . وقد جاء في نظير هذه الجملة في سورة \\[ النحل : 30 \\] قوله : { ولدار الآخرة خير } ، أي خير من أمور الدنيا ، ويكون الاقتصار على حسنة الدنيا في هذه الآية لأنها مسوقة لتثبيت المسلمين على ما يلاقونه من الأذى ، ولأمرهم بالهجرة عن دار الشرك والفتنة في الدين ، فأما ثواب الآخرة فأمر مقرر عندهم من قبل ومومىً إليه بقوله بعده : إنما يوفَّى الصابِرُون أجرهم بغير حسابٍ } أي يوفون أجرهم في الآخرة . قال السدّي : الحسنة في الدنيا الصحة والعافية . ويجوز أن يكون قوله : «في الدنيا» متعلقاً بفعل { أحسنوا } على أنه ظرف لغوي ، أي فعلوا الحسنات في الدنيا فيكون المقصود التنبيه على المبادرة بالحسنات في الحياة الدنيا قبل الفوات والتنبيه على عدم التقصير في ذلك .وتنوين { حَسَنَةٌ } للتعظيم وهو بالنسبة لحسنة الآخرة للتعظيم الذاتي ، وبالنسبة لحسنة الدنيا تعظيم وصفي ، أي حسنة أعظم من المتعارف ، وأيّاً ما كان فاسم الإِشارة في قوله : { في هذه الدنيا } لتمييز المشار إليه وإحضاره في الأذهان . وعليه فالمراد ب { حَسَنَةٌ } يحتمل حسنة الآخرة ويحتمل حسنة الدنيا ، كما في قوله تعالى : { الذين يقولون ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة } في سورة \\[ البقرة : 201 \\] . وقد تقدم نظير هذه الآية في سورة \\[ النحل : 30 \\] قولُه تعالى : { وقيل للذين اتقوا ماذا أنزل ربكم قالوا خيراً للذين أحسنوا في هذه الدنيا حسنة ولدار الآخرة خير }، فألْحِقْ بها ما قُرر هنا .وعطف عليه وأرضُ الله واسعةٌ } عطفَ المقصود على التوطئة . وهو خبر مستعمل في التعريض بالحث على الهجرة في الأرض فراراً بدينهم من الفتن بقرينة أن كون الأرض واسعةً أمر معلوم لا يتعلق الغرض بإفادته وإنما كني به عن لازم معناه ، كما قال إياس بن قبيصة الطائي: ... ألم تر أن الأرض رحْب فسيحةفَهَلْ تعجزنِّي بقعة من بقاعها ... والوجه أن تكون جملة { وأرضُ الله واسِعةٌ } معترضة والواو اعتراضية لأن تلك الجملة جرت مجرى المثل .والمعنى : إن الله وعدهم أن يلاقوا حسنة إذا هم هاجروا من ديار الشرك . وليس حسن العيش ولا ضده مقصوراً على مكان معين وقد وقع التصريح بما كني عنه هنا في قوله تعالى : { قالوا ألم تكن أرض الله واسعة فتهاجروا فيها } \\[ النساء : 97 \\] .والمراد : الإِيماء إلى الهجرة إلى الحَبَشَة . قال ابن عباس في قوله تعالى : { قُلْ يا عِبادِ الذين ءَامنُوا اتَّقوا ربَّكُم } يريد جعفرَ بن أبي طالب والذين خرجوا معه إلى الحبشة . ونكتة الكناية هنا إلقاء الإِشارة إليهم بلطف وتأنيس دون صريح الأمر لما في مفارقة الأوطان من الغمّ على النفس ، وأما الآية التي في سورة النساء فإنها حكاية توبيخ الملائكة لمن لم يهاجروا .وموقع جملة { إنما يُوفَّى الصَّابِرون أجرهم بغيرِ حسابٍ } موقع التذييل لجملة { للذين أحْسَنُوا } وما عطف عليها لأن مفارقة الوطن والتغرب والسفر مشاق لا يستطيعها إلا صابر ، فذُيّل الأمر به بتعظيم أجر الصابرين ليكون إعلاماً للمخاطبين بأن أجرهم على ذلك عظيم لأنهم حينئذٍ من الصابرين الذين أجرهم بغير حساب .والصبر : سكون النفس عند حلول الآلام والمصائب بأن لا تضجر ولا تضطرب لذلك ، وتقدم عند قوله تعالى : { وبشر الصابرين } في سورة \\[ البقرة : 155 \\] . وصيغة العموم في قوله : { الصابرين تشمل كل من صبر على مشقة في القيام بواجبات الدين وامتثال المأمورات واجتناب المنهيات ، ومراتب هذا الصبر متفاوتة وبقدرها يتفاوت الأجر .والتوفية : إعطاء الشيء وافياً ، أي تاماً . والأجر : الثواب في الآخرة كما هو مصطلح القرآن .وقوله : بِغَيرِ حسابٍ } كناية عن الوفرة والتعظيم لأن الشيء الكثير لا يُتصدى لعدِّه ، والشيء العظيم لا يحاط بمقداره فإن الإِحاطة بالمقدار ضرب من الحساب وذلك شأن ثواب الآخرة الذي لا يخطر على قلب بشر .وفي ذكر التوفية وإضافة الأجر إلى ضميرهم تأنيس لهم بأنهم استحقوا ذلك لا منة عليهم فيه وإن كانت المنة لله على كل حال على نحو قوله تعالى : { لهم أجر غير ممنون } \\[ الانشقاق : 25 \\] .والحصر المستفاد من { إنما منصبّ على القيد وهو بِغيرِ حسابٍ } والمعنى : ما يوفي الصابرون أجرهم إلا بِغير حساب ، وهو قصر قلب مبنيّ على قلب ظن الصَابرين أن أجر صبرهم بمقدار صبرهم ، أي أن أجرهم لا يزيد على مقدار مشقة صبرهم .والهجرة إلى الحبشة كانت سنة خمس قبل الهجرة إلى المدينة . وكان سببها أن رسول الله صلى الله عليه وسلم لما رأى ما يصيب أصحابه من البلاء وأن عمه أبا طالب كان يمنع ابن أخيه من أضرار المشركين ولا يقدر أن يمنع أصحابه قال رسول الله صلى الله عليه وسلم« لو خرجتم إلى أرض الحبشة فإن بها ملِكاً لا يُظلَم عنده أحد حتى يجعل الله لكم فرجاً مما أنتم فيه » ، فخرج معظم المسلمين مخافة الفتنة فخرج ثلاثة وثمانون رجلاً وتسع عشرة امرأة سوى أبنائهم الذين خرجوا بهم صغاراً . وقد كان أبو بكر الصديق استأذن رسول الله صلى الله عليه وسلم في الهجرة فأذن له فخرج قاصداً بلاد الحبشة فلقيه ابن الدّغِنَة فَصدّه وجعَلَه في جواره .ولما تعلقت إرادة الله تعالى بنشر الإِسلام في مكة بين العرب لحكمة اقتضت ذلك وعَذر بعض المؤمنين فيما لقُوه من الأذى في دينهم أذن لهم بالهجرة وكانت حكمته مقتضية بقاء رسوله صلى الله عليه وسلم بين ظهراني المشركين لبثّ دعوة الإِسلام لم يأذن له بالهجرة إلى موطن آخر حتى إذا تم مراد الله من توشج نواة الدين في تلك الأرض التي نشأ فيها رسوله صلى الله عليه وسلم وأصبح انتقال الرسول صلى الله عليه وسلم إلى بلد آخر أسعد بانتشار الإِسلام في الأرض أذن الله لرسوله صلى الله عليه وسلم بالهجرة إلى المدينة بعد أن هيّأ له بلطفه دخول أهلها في الإِسلام وكل ذلك جرى بقدَر وحكمة ولطف برسوله صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (0 My bondmen who believe): Abu Bakr al-Siddiq, 'Umar al-Faruq, 'Uthman Dhu'l-Nurayn, 'AN al-Murtada and their fellow believers! (Observe your duty to your Lord) obey your Lord in small and great things. (For those who do good) for those who believe in Allah's divine Oneness (in this world there is good) they will have the Garden on the Day of Judgement, (and Allah's earth) the land of Medina (is spacious) is safe from the enemy, so travel to it; this address was before the Hijrah. (Verily the steadfast) in the face of misfortunes (will be paid their wages) their rewards (without stint) without measure or delay.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل يا عباد } المخصوصين فيّ من أهل العناية { الذين آمنوا } الإيمان العملي { اتّقوا ربّكم } بمحو صفاتكم { للذين أحسنوا } أي: اتّصفوا بالصفات الإلهية فعبدوه على المشاهدة { في هذه الدنيا حسنة } لا يكتنه كنهها في الآخرة وهي شهود الوجه الباقي وجماله الكريم\n { وأرض الله } أي: النفس المطمئنة المخصوصة بالله لانقيادها له وقبولها لنوره واطمئنانها إليه\n ذات سعة بيقينها لا تتقيد بشيء ولا تلبث في ضيق من عادة ومألوف وأمر غير الحق { إنما يوفى الصابرون } الذين صبروا مع الله في فناء صفاتهم وأفعالهم وسلوكهم فيه وسيرهم في منازل النفس الواسعة باليقين { أجرهم } من جنات الصفات { بغير حساب } إذ الأجر الموفى بحسب الأعمال في مقام النفس مقدّر بالأعمال في جنّة النفوس\n متناه لكونه من باب الآثار محصوراً في الموادّ\n وأما الذي يوفى بحسب الأخلاق والأحوال فهو غير متناه لكونه من باب تجليات الصفات في جنة القلب وعالم القدس مجرّداً عن المواد { مخلصاً له الدين } عن الالتفات إلى الغير والسير بالنفس { وأمرت لأن أكون } مقدّم { المسلمين } الذين أسلموا وجوههم إلى الله بالفناء فيه وسابقهم في الصف الأول\n سائراً بالله\n فانياً عن النفس وصفاتها\n { أخاف إن عصيت ربّي } بترك الإخلاص والنظر إلى الغير { عذاب يوم عظيم } من الاحتجاب والحرمان والبُعْد { قل الله } أخصّ بالعبادة { مخلصاً له ديني } عن شوب الأنائية والاثنينية { قل إنّ الخاسرين } بالحقيقة\n الكاملين في الخسران\n هم الواقفون مع الغير\n المحجوبون عن الحق { الذين خسروا أنفسهم وأهليهم } بإهلاك الأنفس وتضييع الأهل من الجواهر المقدّسة التي تجانسهم وتناسبهم في عالمها الروحاني لاحتجابهم بالظلمات الهيولانية عنهم { ألا ذلك هو الخسران } الحقيقي الظاهر البيّن\n { لهم من فوقهم ظلل من النار ومن تحتهم ظلل } لانغمارهم في المواد الهيولانية واستقرارهم في قعر بئر الطبيعة الظلمانية\n فوقهم مراتب من الطبائع وتحتهم مراتب أخرى وهم في غمرات منها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مقتضى إيمانكم التقوى عن مقتضيات الهوى { ٱتَّقُواْ رَبَّكُمْ } واجتنبوا عن محارمه ومنهياته\n واتصفوا بمأموراته\n واعلموا أنه { لِلَّذِينَ أَحْسَنُواْ } الأدب مع الله { فِي هَـٰذِهِ ٱلدُّنْيَا } التي هي نشأة الاعتبار والاختيار { حَسَنَةٌ } وبأضعافها وآلافها أيضاً في الآخرة التي هي دار القرار\n فاعتبروا يا أولي البصائر والأبصار\n\n\nفعليكم الإتيان بالإحسان في كل حين وأوان وزمان ومكان { وَ } لا تفتروا عنه\n وعن المواظبة عليه بتفاقم الأحزان وتلاطم أمواج الفتن في الأوطان\n إذ { أَرْضُ ٱللَّهِ } المعدة لأداء العبادات والاشتغال بالطاعات { وَاسِعَةٌ } فسيحة\n فعليكم الجلاء لأجل الفراغ والخلاء\n فتهاجروا إليها متحملين ما لحقكم من الشدائد والمتاعب في الانتقال\n صابرين على مفارقة الأوطان والخلان\n ومصادفة الكروب والأحزان\n واعلموا { إِنَّمَا يُوَفَّى ٱلصَّابِرُونَ } المتحملون لأنواع الشدائد والمشاق في طريق الإيمان { أَجْرَهُمْ } ويوفر عليهم الحسنات وأنواع المثوبات والكرامات { بِغَيْرِ حِسَابٍ } [الزمر: 10] إلى توفية وتوفير لا يمكن ضبطه بالعد والإحصاء تفضلاً عليهم وتكريماً\n\n\nوفي الحديث صلوات الله على قائله:\n \" تنصب الموازين يوم القيامة لأهل الصلاة والصدقة والحج\n فيوفون بها أجورهم\n ولا ينصب لأهل البلاء\n بل يصب عليهم الأجر\n وحتى يتمنى أهل العافية في الدنيا أن أجسادهم تقرض بالمقاريض\n مما يذهب به أهل البلاء من الفضل \"\n \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { في هذه }: متعلق بأحسنوا، أو: بحسنة، على أنه بيان لمكانها، أو: حال من ضميرها في الظرف. يقول الحق جلّ جلاله: { قل يا عبادِ الذين آمنوا اتقوا ربَّكم } بامتثال أوامره، واجتناب نواهيه، أمر رسوله صلى الله عليه وسلم بأن يحثّهم على التقوى ويُذكِّرهم بها، بعد تخصيص التذكير بأولي الألباب، إيذاناً بأن أُولي الألباب هم أهل التقوى، وفي إضافتهم إلى ضمير الجلالة بقوله: { يا عبادي } تشريف لهم، ومزيد اعتناء بشأن المأمور به، وهو التقوى. ثم حرَّض على الامتثال بقوله: { للذين أحسنوا } أي: اتقوا الله وأطاعوه { في هذه الدنيا } الفانية، التي هي مزرعة الآخرة. { حسنةٌ } أي: حسنةٌ عظيمة، لا يُكتنه كُنهها، وهي الجنة ونعيمها، أو: للذين أحسنوا بالطاعة والإخلاص حسنة معجّلة في الدنيا، وهي الصحة والعافية، والحياة الطيبة، أو: للذين أحسنوا، أي: حصلوا مقام الإحسان ـ الذي عبّر عنه عليه الصلاة والسلام بقوله:\n \" أن تعبد الله كأنك تراه \" \nـ حسنة كبيرة، وهي لذة الشهود، والأنس بالملك الودود في الدارين. ولما كان هذا المقام لا يتأتى تحصيله إلا في بعض البلاد الخالية من الشواغل والموانع، أمر بالهجرة من الأرض التي لا يتأتى فيها التفرُّغ، فقال: { وأرضُ الله واسعةً } ، فمَن تعسَّر عليه التفرُّغ للتقوى، والإحسان وعمل القلوب، في وطنه، فليهاجر إلى بلد يتمكن فيه ذلك، كما هي سُنَّة الأنبياء والأولياء، فإنه لا عذر له في التفريط والبطالة أصلاً. ولمّا كان الخروج من الوطن صعباً على النفوس، يحتاج إلى صبر كبير رغَّب في الصبر بقوله: { إِنما يُوفى الصابرون } على مفارقة الأوطان، وتحمُّل مشاق الطاعات، وتحقيق الإحسان، { أجْرَهم } في مقابلة ما كابدوه من الصبر، { بغير حسابٍ } بحيث لا يحصى ولا يحصر بل يصب عليهم الأجر صبّاً، فلهم ما لا عين رأت، ولا أُذن سمعت، ولا خطر على قلب بشر. وعن ابن عباس رضي الله عنه: لا يهدي إليه حساب الحسّاب، ولا يُعرف، وفي الحديث:\n \" أنه يُنصب الموازين يوم القيامة لأهل الصلاة والصيام والحج، فيوفّون بها أجورهم، ولا تنصب لأهل البلاء بل يُصب عليهم الأجر صبّاً، حتى يتمنى أهل العافية في الدنيا أن أجسادهم تقرض بالمقاريض، مما يذهب به أهل البلاء من الفضل \" \nوكل ما يشق على النفس ويتعبها فهو بلاء، والله تعالى أعلم. الإشارة: بالتقوى الكاملة يصير العبد من أُولي الألباب، فبقدر ما تعظم التقوى يعظم إشراق النور في القلب، ويتصفّى من الرذائل، وقد تقدّم الكلام عليها مستوفياً عند قوله تعالى:\n[النساء: 100] فمَن أحسن في تقواه أحسن الله عاقبته ومثواه، وحفظه في دنياه وأخراه. فمَن تعذّرت عليه التقوى في وطنه، فليهاجر منه إلى غيره، والهجرة سُنَّة نبوية، وليتجرّع الصبر على مفارقة الأوطان، ومهاجرة العشائر والإخوان، لينخرط في سلك أهل الإحسان، قال تعالى:\n[التوبة: 100] الآية. قال القشيري: الصبر: حَبْسُ النفس على ما تكره، ويقال: تجرُّعُ كاسات التقدير، من غير استكراهٍ ولا تعبيس، ويقال: التهدُّف لسهام البلاء. هـ. ثم أمر بالإخلاص، الذي هو شرط في الجميع، فقال: { قُلْ إِنِّيۤ أُمِرْتُ أَنْ أَعْبُدَ ٱللَّهَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:98",
      "similarity": 0.4312000414144643
    },
    {
      "verse": "29:56",
      "similarity": 0.4291257033458888
    },
    {
      "verse": "7:156",
      "similarity": 0.4197555982073452
    },
    {
      "verse": "4:130",
      "similarity": 0.3585098704364775
    },
    {
      "verse": "4:97",
      "similarity": 0.3366367597479327
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}