{
  "chapter": "الزمر",
  "text": "قل يعباد الذين ءامنوا۟ اتقوا۟ ربكم للذين احسنوا۟ فى هذه الدنيا حسنة وارض الله وسعة انما يوفى الصبرون اجرهم بغير حساب",
  "translations": [
    {
      "translation": "Say: 'Slaves of Mine who have iman! have taqwa of your Lord. For those who do good in this world there is good and Allah's earth is spacious. The steadfast will be paid their wages in full without any reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"O my creatures who have come to belief, have fear of displeasing your Lord. There is good for those who do good in this world, and productive is God's earth. Only those who persevere will get their reward measureless.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them (O Prophet): “O you servants of Mine who believe, have fear of your Lord. A good end awaits those who did good in this world. Allah's earth is spacious. Verily those who persevere shall be granted their reward beyond all reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to My believing servants, \"Have fear of your Lord. Those who act righteously in this life will receive good reward. The land of God is vast. God will recompense the deeds of those who have exercised patience, without keeping an account\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “O my slaves who have accepted faith! Fear your Lord; for those who do good deeds in this world is goodness (in return); and Allah’s earth is spacious; it is the steadfast who will be paid their full reward, without account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O My servants who believe, have Taqwa of your Lord. Good is for those who do good in this world, and Allah's earth is spacious! Only those who are patient shall receive their reward in full, without reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O my servants who believe! be careful of (your duty to) your Lord; for those who do good in this world is good, and Allah's earth is spacious; only the patient will be paid back their reward in full without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My servants who believe, fear your Lord. For those who do good in this world good, and God's earth is wide. Surely the patient will be paid their wages in full without reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O My bondmen who believe! Observe your duty to your Lord. For those who do good in this world there is good, and Allah's earth is spacious. Verily the steadfast will be paid their wages without stint.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"[God says] O My servants who have believed, fear your Lord. For those who do good in this world will have a good reward -- and God's earth is spacious. Truly, those who persevere patiently will be requited without measure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O Mine bondmen who believe! fear your Lord. For those who do good in this world there is good: and Allah's earth is spacious. Verily the patient shall be paid in full their hire without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘[Allah declares:] “O My servants who have faith! Be wary of your Lord. For those who do good in this world there will be a good [reward], and Allah’s earth is vast. Indeed the patient will be paid in full their reward without any reckoning.” ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O ye my servants who believe! Fear your Lord, good is (the reward) for those who do good in this world. Spacious is Allah's earth! those who patiently persevere will truly receive a reward without measure!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"O My slaves who believe (in the Oneness of Allah Islamic Monotheism), be afraid of your Lord (Allah) and keep your duty to Him. Good is (the reward) for those who do good in this world, and Allah's earth is spacious (so if you cannot worship Allah at a place, then go to another)! Only those who are patient shall receive their rewards in full, without reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My worshipers who believe, fear your Lord. For those who do good in this world there is good and the earth of Allah is wide surely, those who are patient will be recompensed in full without count'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O My devotees who have believed, keep your duty to your Lord. For those who do good in this world, is goodness. And God’s earth is vast. The steadfast will be paid their wages in full, without reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:10] Say: ‘O servants of Mine who believe! Fear your Lord, that is to say, [fear] His chastisement, by being obedient to Him. For those who are virtuous in this world, through obedience, there will be good, and that is Paradise, and God’s earth is vast, so emigrate throughout it, away from the [company of] disbelievers and the sight of indecencies. Truly the steadfast, in [their] obedience [of God] and in [enduring] whatever [hardship] they may be tested with, will be paid their reward in full without any reckoning’, without any measure or any scales [to work it out].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (0 My bondmen who believe): Abu Bakr al-Siddiq, 'Umar al-Faruq, 'Uthman Dhu'l-Nurayn, 'AN al-Murtada and their fellow believers! (Observe your duty to your Lord) obey your Lord in small and great things. (For those who do good) for those who believe in Allah's divine Oneness (in this world there is good) they will have the Garden on the Day of Judgement, (and Allah's earth) the land of Medina (is spacious) is safe from the enemy, so travel to it; this address was before the Hijrah. (Verily the steadfast) in the face of misfortunes (will be paid their wages) their rewards (without stint) without measure or delay.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل يا عباد } المخصوصين فيّ من أهل العناية { الذين آمنوا } الإيمان العملي { اتّقوا ربّكم } بمحو صفاتكم { للذين أحسنوا } أي: اتّصفوا بالصفات الإلهية فعبدوه على المشاهدة { في هذه الدنيا حسنة } لا يكتنه كنهها في الآخرة وهي شهود الوجه الباقي وجماله الكريم\n { وأرض الله } أي: النفس المطمئنة المخصوصة بالله لانقيادها له وقبولها لنوره واطمئنانها إليه\n ذات سعة بيقينها لا تتقيد بشيء ولا تلبث في ضيق من عادة ومألوف وأمر غير الحق { إنما يوفى الصابرون } الذين صبروا مع الله في فناء صفاتهم وأفعالهم وسلوكهم فيه وسيرهم في منازل النفس الواسعة باليقين { أجرهم } من جنات الصفات { بغير حساب } إذ الأجر الموفى بحسب الأعمال في مقام النفس مقدّر بالأعمال في جنّة النفوس\n متناه لكونه من باب الآثار محصوراً في الموادّ\n وأما الذي يوفى بحسب الأخلاق والأحوال فهو غير متناه لكونه من باب تجليات الصفات في جنة القلب وعالم القدس مجرّداً عن المواد { مخلصاً له الدين } عن الالتفات إلى الغير والسير بالنفس { وأمرت لأن أكون } مقدّم { المسلمين } الذين أسلموا وجوههم إلى الله بالفناء فيه وسابقهم في الصف الأول\n سائراً بالله\n فانياً عن النفس وصفاتها\n { أخاف إن عصيت ربّي } بترك الإخلاص والنظر إلى الغير { عذاب يوم عظيم } من الاحتجاب والحرمان والبُعْد { قل الله } أخصّ بالعبادة { مخلصاً له ديني } عن شوب الأنائية والاثنينية { قل إنّ الخاسرين } بالحقيقة\n الكاملين في الخسران\n هم الواقفون مع الغير\n المحجوبون عن الحق { الذين خسروا أنفسهم وأهليهم } بإهلاك الأنفس وتضييع الأهل من الجواهر المقدّسة التي تجانسهم وتناسبهم في عالمها الروحاني لاحتجابهم بالظلمات الهيولانية عنهم { ألا ذلك هو الخسران } الحقيقي الظاهر البيّن\n { لهم من فوقهم ظلل من النار ومن تحتهم ظلل } لانغمارهم في المواد الهيولانية واستقرارهم في قعر بئر الطبيعة الظلمانية\n فوقهم مراتب من الطبائع وتحتهم مراتب أخرى وهم في غمرات منها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مقتضى إيمانكم التقوى عن مقتضيات الهوى { ٱتَّقُواْ رَبَّكُمْ } واجتنبوا عن محارمه ومنهياته\n واتصفوا بمأموراته\n واعلموا أنه { لِلَّذِينَ أَحْسَنُواْ } الأدب مع الله { فِي هَـٰذِهِ ٱلدُّنْيَا } التي هي نشأة الاعتبار والاختيار { حَسَنَةٌ } وبأضعافها وآلافها أيضاً في الآخرة التي هي دار القرار\n فاعتبروا يا أولي البصائر والأبصار\n\n\nفعليكم الإتيان بالإحسان في كل حين وأوان وزمان ومكان { وَ } لا تفتروا عنه\n وعن المواظبة عليه بتفاقم الأحزان وتلاطم أمواج الفتن في الأوطان\n إذ { أَرْضُ ٱللَّهِ } المعدة لأداء العبادات والاشتغال بالطاعات { وَاسِعَةٌ } فسيحة\n فعليكم الجلاء لأجل الفراغ والخلاء\n فتهاجروا إليها متحملين ما لحقكم من الشدائد والمتاعب في الانتقال\n صابرين على مفارقة الأوطان والخلان\n ومصادفة الكروب والأحزان\n واعلموا { إِنَّمَا يُوَفَّى ٱلصَّابِرُونَ } المتحملون لأنواع الشدائد والمشاق في طريق الإيمان { أَجْرَهُمْ } ويوفر عليهم الحسنات وأنواع المثوبات والكرامات { بِغَيْرِ حِسَابٍ } [الزمر: 10] إلى توفية وتوفير لا يمكن ضبطه بالعد والإحصاء تفضلاً عليهم وتكريماً\n\n\nوفي الحديث صلوات الله على قائله:\n \" تنصب الموازين يوم القيامة لأهل الصلاة والصدقة والحج\n فيوفون بها أجورهم\n ولا ينصب لأهل البلاء\n بل يصب عليهم الأجر\n وحتى يتمنى أهل العافية في الدنيا أن أجسادهم تقرض بالمقاريض\n مما يذهب به أهل البلاء من الفضل \"\n \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { في هذه }: متعلق بأحسنوا، أو: بحسنة، على أنه بيان لمكانها، أو: حال من ضميرها في الظرف. يقول الحق جلّ جلاله: { قل يا عبادِ الذين آمنوا اتقوا ربَّكم } بامتثال أوامره، واجتناب نواهيه، أمر رسوله صلى الله عليه وسلم بأن يحثّهم على التقوى ويُذكِّرهم بها، بعد تخصيص التذكير بأولي الألباب، إيذاناً بأن أُولي الألباب هم أهل التقوى، وفي إضافتهم إلى ضمير الجلالة بقوله: { يا عبادي } تشريف لهم، ومزيد اعتناء بشأن المأمور به، وهو التقوى. ثم حرَّض على الامتثال بقوله: { للذين أحسنوا } أي: اتقوا الله وأطاعوه { في هذه الدنيا } الفانية، التي هي مزرعة الآخرة. { حسنةٌ } أي: حسنةٌ عظيمة، لا يُكتنه كُنهها، وهي الجنة ونعيمها، أو: للذين أحسنوا بالطاعة والإخلاص حسنة معجّلة في الدنيا، وهي الصحة والعافية، والحياة الطيبة، أو: للذين أحسنوا، أي: حصلوا مقام الإحسان ـ الذي عبّر عنه عليه الصلاة والسلام بقوله:\n \" أن تعبد الله كأنك تراه \" \nـ حسنة كبيرة، وهي لذة الشهود، والأنس بالملك الودود في الدارين. ولما كان هذا المقام لا يتأتى تحصيله إلا في بعض البلاد الخالية من الشواغل والموانع، أمر بالهجرة من الأرض التي لا يتأتى فيها التفرُّغ، فقال: { وأرضُ الله واسعةً } ، فمَن تعسَّر عليه التفرُّغ للتقوى، والإحسان وعمل القلوب، في وطنه، فليهاجر إلى بلد يتمكن فيه ذلك، كما هي سُنَّة الأنبياء والأولياء، فإنه لا عذر له في التفريط والبطالة أصلاً. ولمّا كان الخروج من الوطن صعباً على النفوس، يحتاج إلى صبر كبير رغَّب في الصبر بقوله: { إِنما يُوفى الصابرون } على مفارقة الأوطان، وتحمُّل مشاق الطاعات، وتحقيق الإحسان، { أجْرَهم } في مقابلة ما كابدوه من الصبر، { بغير حسابٍ } بحيث لا يحصى ولا يحصر بل يصب عليهم الأجر صبّاً، فلهم ما لا عين رأت، ولا أُذن سمعت، ولا خطر على قلب بشر. وعن ابن عباس رضي الله عنه: لا يهدي إليه حساب الحسّاب، ولا يُعرف، وفي الحديث:\n \" أنه يُنصب الموازين يوم القيامة لأهل الصلاة والصيام والحج، فيوفّون بها أجورهم، ولا تنصب لأهل البلاء بل يُصب عليهم الأجر صبّاً، حتى يتمنى أهل العافية في الدنيا أن أجسادهم تقرض بالمقاريض، مما يذهب به أهل البلاء من الفضل \" \nوكل ما يشق على النفس ويتعبها فهو بلاء، والله تعالى أعلم. الإشارة: بالتقوى الكاملة يصير العبد من أُولي الألباب، فبقدر ما تعظم التقوى يعظم إشراق النور في القلب، ويتصفّى من الرذائل، وقد تقدّم الكلام عليها مستوفياً عند قوله تعالى:\n[النساء: 100] فمَن أحسن في تقواه أحسن الله عاقبته ومثواه، وحفظه في دنياه وأخراه. فمَن تعذّرت عليه التقوى في وطنه، فليهاجر منه إلى غيره، والهجرة سُنَّة نبوية، وليتجرّع الصبر على مفارقة الأوطان، ومهاجرة العشائر والإخوان، لينخرط في سلك أهل الإحسان، قال تعالى:\n[التوبة: 100] الآية. قال القشيري: الصبر: حَبْسُ النفس على ما تكره، ويقال: تجرُّعُ كاسات التقدير، من غير استكراهٍ ولا تعبيس، ويقال: التهدُّف لسهام البلاء. هـ. ثم أمر بالإخلاص، الذي هو شرط في الجميع، فقال: { قُلْ إِنِّيۤ أُمِرْتُ أَنْ أَعْبُدَ ٱللَّهَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:98",
      "similarity": 0.4312000414144643
    },
    {
      "verse": "29:56",
      "similarity": 0.4291257033458888
    },
    {
      "verse": "7:156",
      "similarity": 0.4197555982073452
    },
    {
      "verse": "4:130",
      "similarity": 0.3585098704364775
    },
    {
      "verse": "4:97",
      "similarity": 0.3366367597479327
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}