{
  "chapter": "الزمر",
  "text": "فاعبدوا۟ ما شئتم من دونه قل ان الخسرين الذين خسروا۟ انفسهم واهليهم يوم القيمة الا ذلك هو الخسران المبين",
  "translations": [
    {
      "translation": "so worship anything you will apart from Him!' Say: 'The real losers are those who lose themselves and their families on the Day of Rising.' Is not that clear loss?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may worship what you will apart from Him.\" Say: \"Surely the greatest losers will be those who will lose their own selves and their people on the Day of Resurrection.\" Remember, this will be an all-too-evident loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So serve, apart from Him, whomsoever you please.” Say: “Behold, the real losers shall be those who will have lost their own selves and their kith and kin on the Day of Resurrection. Behold, that is the obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship besides Him whatever you want. The greatest losers are those whose souls and family members will be lost on the Day of Judgment for this is certainly a great loss\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore you can worship what you want besides Him!” Say, “The worst losers are those who will lose themselves and their household on the Day of Resurrection; pay heed! This is the plain loss!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, worship what you like besides Him.\" Say: \"The losers are those who will lose themselves and their families on the Day of Resurrection. Verily, that will be a manifest loss!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve then what you like besides Him. Say: The losers surely are those who shall have lost themselves and their families on the day of resurrection; now surely that is the clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so serve what you will apart from Him.' Say: 'Surely the losers are they who lose themselves and their families on the Day of Resurrection; is not that the manifest loss?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then worship what ye will beside Him. Say: The losers will be those who lose themselves and their housefolk on the Day of Resurrection. Ah, that will be the manifest loss!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as for yourselves, worship anything you please besides Him!\" Say, \"The real losers will be those who lose themselves and all their kith and kin on the Day of Resurrection. That is the [most] obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So worship whatsoever ye will, besidev him. Say thou: verily the losers are those who shall have lost themselves and their household\" on the Day of judgment LO! that will be a loss manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You worship whatever you wish besides Him.’ Say, ‘The losers are those who ruin themselves and their families on the Day of Resurrection.’ Indeed, that is a manifest loss!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve ye what ye will besides him.\" Say: \"Truly, those in loss are those who lose their own souls and their People on the Day of Judgment: Ah! that is indeed the (real and) evident Loss!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So worship what you like besides Him. Say (O Muhammad SAW): \"The losers are those who will lose themselves and their families on the Day of Resurrection. Verily, that will be a manifest loss!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for yourselves) worship what you will, other than Him' Say: 'The losers are surely those who lose themselves and their families on the Day ofResurrection. Is that not a clear loss'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“But you can worship whatever you wish besides Him.” Say, “The losers are those who lose their souls and their people on the Day of Resurrection.” That is indeed the obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So worship what you will besides Him.\" Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:15] So worship whatever you wish besides Him’, other than Him — herein is a threat for them as well as a declaration [of the fact] that they do not worship God, exalted be He. Say: ‘Indeed the losers are those who [will] have lost their souls and their families on the Day of Resurrection, by condemning their souls to abide [forever] in the Fire, and their failure to attaining [the bliss promised among] the black-eyed virgins who would have been prepared for them in Paradise had they been believers. Truly that is the manifest loss!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَاعْبُدُوا مَا شِئْتُمْ مِنْ دُونِهِ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ أَلَا ذَلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ (15)والفاء في قوله : { فَاعْبُدُوا } الخ لتفريع الكلام الذي بعدها على الكلام قبلها فهو تفريع ذكري . والأمر في قوله : { فاعبدوا ما شِئتُم مِن دونِهِ } مستعمل في معنى التخلية ، ويعبر عنه بالتسوية . والمقصود التسوية في ذلك عند المتكلم فتكون التسوية كناية عن قلة الاكتراث بفعل المخاطب ، أي أن ذلك لا يضرني كقوله في سورة \\[ الكهف : 29 \\] : { فمن شاء فليؤمن ومن شاء فليكفر } ، أي اعبدوا أيّ شيء شئتم عبادتَه من دون الله . وجعلت الصلة هنا فعل المشيئة إيماء إلى أن رائدهم في تعيين معبوداتهم هو مجرد المشيئة والهوى بلا دليل .دُونِهِ قُلْ إِنَّ الخاسرين الذين خسروا أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ القيامة أَلاَ ذَلِكَ هُوَ الخسران }أعقب أمر التسوية في شأنهم بشيء من الموعظة حرصاً على إصلاحهم على عادة القرآن ، ولوحظ في إبلاغهم هذه الموعظة مقام ما سبق من التخلية بينهم وبين شأنهم جمعاً بين الإِرشاد وبين التوبيخ ، فجيء بالموعظة على طريق التعريض والحديث عن الغائب والمراد المخاطبون .وافتتح المقول بحرف التوكيد تنبيهاً على أنه واقع وتعريف { الخَاسِرِينَ } تعريف الجنس ، أي أن الجنس الذين عرفوا بالخسران هم الذين خسروا أنفسهم وأهليهم .وتعريف المسند والمسند إليه من طريق القصر ، فيفيد هذا التركيب قصر جنس الخاسرين على الذين خسروا أنفسهم وأهليهم ، وهو قصر مبالغة لكمال جنس الخسران في الذين خسروا أنفسهم وأهليهم فخسران غيرهم كَلاَ خسران ، ولهذا يقال في لام التعريف في مثل هذا التركيب إنها دالة على معنى الكمال فليسوا يريدون أن معنى الكمال من معاني لام التعريف .ولما كان الكلام مسوقاً بطريق التعريض بالذين دَار الجدال معهم من قوله : { إن تكفروا فإن الله غني عنكم إلى قوله : فاعبدوا ما شئتم من دونه } \\[ الزمر : 7 15 \\] ، عُلم أن المراد بالذين خسروا أنفسهم وأهليهم هم الذين جرى الجدال معهم ، فأفاد معنى : أن الخاسرين أنتم ، إلا أن وجه العدول عن الضمير إلى الموصولية في قوله : { الذين خسروا أنفسهم } لإِدماج وعيدهم بأنهم يخسرون أنفسهم وأهليهم يوم القيامة .ومعنى خسرانهم أنفسهم : أنهم تسببوا لأنفسهم في العذاب في حين حسبوا أنهم سعوا لها في النعيم والنجاح ، وهو تمثيل لحالهم في إيقاع أنفسهم في العذاب وهم يحسبون أنهم يُلقونها في النعيم ، بحال التاجر الذي عرض ماله للنماء والربح فأصيب بالتلف ، فأطلق على هذه الهيئة تركيب { خَسِرُوا أنفسَهُم } ، وقد تقدم في قوله تعالى :{ ومن خفَّت موازينُه فأُولئِكَ الذين خَسِروا أنفُسَهُم بما كانوا بأياتِنا يظلِمُون } في أوّل سورة \\[ الأعراف : 9 \\] .وأما خسرانهم أهليهم فهو مِثل خسرانهم أنفسهم وذلك أنهم أغروا أهليهم من أزواجهم وأولادهم بالكفر كما أوقعوا أنفسهم فيه فلم ينتفعوا بأهليهم في الآخرة ولم ينفعوهم : { لكل امرىء منهم يومئذٍ شأن يغنيه } \\[ عبس : 37 \\] ، وهذا قريب من قوله تعالى : { يا أيها الذين آمنوا قوا أنفسكم وأهليكم ناراً } \\[ التحريم : 6 \\] ، فكان خسرانهم خسراناً عظيماً .فقوله : { ألاَ ذلِكَ هو الخُسرانُ المبينُ } استئناف هو بمنزلة الفذلكة والنتيجة من الكلام السابق لأن وصف { الذين خسروا } بأنهم خسروا أحب ما عندهم وبأنهم الذين انحصر فيهم جنس الخاسرين ، يستخلص منه أن خسارتهم أعظم خسارة وأوضحها للعيان ، ولذلك أوثرت خسارتهم باسم الخسران الذي هو اسم مصدر الخسارة دالٌّ على قوة المصدر والمبالغة فيه .وأشير إلى العناية والاهتمام بوصف خسارتهم ، بأن افتتح الكلام بحرف التنبيه داخلاً على اسم الإِشارة المفيد تمييز المشار إليه أكمل تمييز ، وبتوسط ضمير الفصل المفيد للقصر وهو قصر ادعائي ، والقول فيه كالقول في الحصر في قوله : { إنَّ الخاسِرينَ الذين خَسِروا أنفسهم وأهليهم } .\n\n",
      "translations": [
        {
          "translation": "(Then worship what ye will beside Him) this is a threat and rebuke to them before the Prophet (pbuh) was commanded to fight them. (Say) to them, Muhammad: (The losers will be those who lose themselves) by missing both the life of this world and the Hereafter (and their housefolk) and servants and houses in the Garden (on the Day of Resurrection. Ah, that will be the manifest loss) losing the life of this world and the Hereafter is the manifest loss! 531\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱعْبُدُواْ } أيها المنهمكون في بحر الغي والضلال { مَا شِئْتُمْ مِّن دُونِهِ } سبحانه بمقتضى أهويتكم الفاسدة وآرائكم الكاسدة\n واعلموا أنه ما يترتب على عبادة غير الله إلا الخيبة والخسران { قُلْ إِنَّ ٱلْخَاسِرِينَ ٱلَّذِينَ خَسِرُوۤاْ أَنفُسَهُمْ } بعبادة غير الله والانحراف عن جادة توحيده\n { وَ } خسروا { أَهْلِيهِمْ } أيضاً بالإغواء الإضلال { يَوْمَ ٱلْقِيَامَةِ } المعدة لجزاء الأعمال { أَلاَ ذَلِكَ هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ } [الزمر: 15] والحرمان العظيم\n نعوذ بك منه يا ذا القوة المتين\n\n\nوكيف لا يكون خسران المشركين مبنياً وحرمانهم عظيماً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وتمهيداً لتهديدهم بقوله: { فاعبدوا ما شئتم } أن تعبدوه { من دونه } تعالى\n وفيه من الدلالة على شدة الغضب عليهم ما لا يخفى\n كأنهم لَمَّا لَمْ ينتهوا عما نُهوا عنه أُمِرُوا به\n كي يحيق بهم العذاب\n { قلْ إِن الخاسرين } الكاملين في الخسران\n الذي هو عبارة عن: إضاعة ما يهمه\n وإتلاف ما لا بد منه\n هم { الذين خسروا أنفُسَهم } بتعريضها للعطب\n { وأهلِيِهِم } بتعريضهم للتفرُّق عنهم\n فرقاً لا جمع بعده إما في عذاب الأبد\n إن ماتوا على الكفر معهم\n أو: في الجنة\n إن آمنوا\n فلا يرونهم أبداً\n وقيل: خسروا أهلهم لأنهم لم يدخلوا مدخل الذين لهم أهل في الجنة\n أو: خسروا أهلهم الذين كانوا يتمتعون بهم\n لو آمنوا\n { ألا ذلك هو الخسرانُ المبينُ } الذي لا خسران أظهر منه\n\nوتصدير الجملة بحرف التنبيه\n والإشارة بذلك إلى بُعد منزلة المشار إليه في الشر\n وتوسيط ضمير الفصل\n وتعريف الخسران\n ووصفه بالمبين من الدلالة على كمال هوله وفظاعته\n وأنه لا خسران وراءه\n ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:64",
      "similarity": 0.4689677565259608
    },
    {
      "verse": "10:55",
      "similarity": 0.42230717902488835
    },
    {
      "verse": "37:151",
      "similarity": 0.4222495630728235
    },
    {
      "verse": "10:62",
      "similarity": 0.3945410571145257
    },
    {
      "verse": "2:12",
      "similarity": 0.36149440638307495
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}