{
  "chapter": "الزمر",
  "text": "انا انزلنا اليك الكتب بالحق فاعبد الله مخلصا له الدين",
  "translations": [
    {
      "translation": "We have sent down the Book to you with truth. So worship Allah, making your deen sincerely His.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed to you the Scripture with exactitude; so worship God with devotion all exclusive for Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), it is We Who have revealed this Book to you with Truth. So serve only Allah, consecrating your devotion to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed the Book to you in all truth. Worship God and be devoted to His religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed divinely revealed the Book to you (O dear Prophet Mohammed – peace and blessings be upon him) with the truth, therefore worship Allah, as His sincere bondman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have sent down the Book to you in truth. So, worship Allah by doing religious deeds sincerely for Him only.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have revealed to you the Book with the truth, therefore serve Allah, being sincere to Him in obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to thee the Book with the truth; so worship God, making thy religion His sincerely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have revealed the Scripture unto thee (Muhammad) with truth; so worship Allah, making religion pure for Him (only).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We who sent down the Book to you [Prophet] with the Truth, so worship God with your total devotion:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have sent down the Book Unto thee With truth: wherefore worship thou Allah, making exclusion for Him in religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have sent down the Book to you with the truth; so worship Allah, putting exclusive faith in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily it is We Who have revealed the Book to thee in Truth: so serve Allah, offering Him sincere devotion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have sent down the Book to you (O Muhammad SAW) in truth: So worship Allah (Alone) by doing religious deeds sincerely for Allah's sake only, (and not to show-off, and not to set up rivals with Him in worship).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down the Book with the truth to you (Prophet Muhammad), therefore worship Allah, and make your religion sincerely His.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent down to you the Book with the truth, so serve God, devoting your religion to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have sent down to you the Book, [O Muhammad], in truth. So worship Allah, [being] sincere to Him in religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:2] Indeed We have revealed to you, O Muhammad (s), the Book with the truth (bi’l-haqqi is semantically connected to anzalnā, ‘We have revealed’); so worship God, devoting your religion purely to Him, [pure] of any idolatry, in other words, affirming His Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We have revealed the Scripture unto thee (Muhammad)) We have sent Gabriel to you with the Scripture (with truth) not with falsehood; (so worship Allah, making religion pure for Him (only)) making worship and the profession of Allah's divine Oneness sincere to Him. 529\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n البارزة في مراتب التنزيلات { بالحق } أي: أنزلناه بظهور الحق فيك بعد كمونه { فاعبد الله } فخصّصه بالعبادة الذاتية حين تجلى لك بذاته ولم يبق أحداً من خلقه { مخلصاً } ممحضاً { له الدين } عن شوب الغيرية والاثنينية\n أي: اعبده بشهوده لذاته ومطالعة تجليات صفاته بعينه وتلاوة كلامه به\n فيكون سيرك سير الله ودينك دين الله وفطرتك ذات الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ورفع رتبته ومكانه: { إِنَّآ } من مقام عظيم جودنا { أَنزَلْنَآ إِلَيْكَ } يا أكمل الرسل تعظيماً لشأنك وتأييداً لأمرك { ٱلْكِتَابَ } الجامع لجميع ما في الكتب السالفة\n مع زوائد خلت عنها كلها ملتبساً { بِٱلْحَقِّ } المطابق للواقع بلا شوب شك وريب في نزوله منَّا { فَٱعْبُدِ ٱللَّهَ } الذي اصطفاك لرسالته وخصصك بكتابه\n هذا حال كونك شاكراً لنعمه\n معترفاً بكرمه { مُخْلِصاً } في عبوديتك وعبادتك إياه\n مجتنباً عن مداخل الشرك ورعونات الرياء مطلقاً\n إذ { لَّهُ ٱلدِّينَ } [الزمر: 2] أي: لا مستحق للإطاعة الخالصة والانقياد الصافي سواه\n ولا يعبد بالحق إلا إياه\n\n\nوبعدما أمر سبحانه بالعبادة والإخلاص في الإطاعة والانقياد\n نبه على عموم عباده بالإخلاص في الطاعات\n والخلوص في نيات العبادات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنا أنزلنا إِليك الكتاب بالحق }: ليس بتكرُّر لأن الأول كالعنوان للكتاب\n والثاني لبيان ما في الكتاب\n قال أبو السعود: والمراد بالكتاب: القرآن\n وإظهاره على تقدير كونه هو المراد بالأول لتعظيمه ومزيد الاعتناء بشأنه\n والباء إما متعلقة بالإنزال\n أي: بسبب الحق وإظهاره\n أو: بداعيته واقتضائه\n وإما بمحذوف هو حال من نون العظمة\n أو: من الكتاب\n أي: أنزلناه إليه محقين في ذلك\n أو: ملتبساً بالحق والصواب\n أي: ما فيه حق لا ريب فيه موجب العمل به حتماً\n قال القشيري: بالحق\n أي: بالدين الحق والشرع الحق\n وأنا مُحِق في إنزاله\n { فاعْبُدِ اللهَ مُخْلِصاً له الدينَ } أي: فاعبده تعالى مخلصاً دينه من شوائب الشرك والرياء\n حسبما بُيِّن في تضاعيف ما أنزل إليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:14",
      "similarity": 0.8667368355465758
    },
    {
      "verse": "39:11",
      "similarity": 0.8334435824783211
    },
    {
      "verse": "37:169",
      "similarity": 0.742565881183162
    },
    {
      "verse": "37:40",
      "similarity": 0.7324575540448407
    },
    {
      "verse": "37:74",
      "similarity": 0.7324575540448407
    }
  ]
}