{
  "chapter": "الزمر",
  "text": "الله نزل احسن الحديث كتبا متشبها مثانى تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم الى ذكر الله ذلك هدى الله يهدى به من يشاء ومن يضلل الله فما له من هاد",
  "translations": [
    {
      "translation": "Allah has sent down the Supreme Discourse, a Book consistent in its frequent repetitions. The skins of those who fear their Lord tremble at it and then their skins and hearts yield softly to the remembrance of Allah. That is Allah's guidance by which He guides whoever He wills. And no one can guide those whom Allah",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent down the very best discourse, the Book conformable in its juxtapositions, which makes all of those who fear their Lord, shudder. So their hearts and bodies become receptive to the remembrance of God. This is the guidance of God with which He guides whosoever He will; but whosoever God allows to go astray has none to show him the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has revealed the best teaching, a self-consistent Book which repeats its contents in manifold forms whereat shiver the skins of those that hold their Lord in awe, and then their skins and their hearts soften for Allah's remembrance. That is Allah's Guidance wherewith He guides whosoever He pleases. And he whom Allah does not guide to the Right Path has none to guide him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has revealed the best reading material in the form of a Book with similar passages which refer to each other and make the skins of those who fear their Lord shiver. Then their skins and hearts incline to the remembrance of God. This is the guidance of God. He guides whomever He wants. No one can guide those whom God has caused to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sent down the best of Books (the Holy Qur’an), which is consistent throughout, the one with paired statements; the hairs on the skins of those who fear their Lord, stand on end with it; then their skins and their hearts soften, inclined towards the remembrance of Allah; this is the guidance of Allah, He may guide whomever He wills with it; and whomever Allah sends astray, there is no guide for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sent down the Best Statement, a Book, its parts resembling each other, (and) oft-repeated. The skins of those who fear their Lord shiver from it. Then their skin and their heart soften to the remembrance of Allah. That is the guidance of Allah. He guides therewith whom He wills; and whomever Allah sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has revealed the best announcement, a book conformable in its various parts, repeating, whereat do shudder the skins of those who fear their Lord, then their skins and their hearts become pliant to the remembrance of Allah; this is Allah's guidance, He guides with it whom He pleases; and (as for) him whom Allah makes err, there is no guide for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent down the fairest discourse as a Book, consimilar in its oft-repeated, whereat shiver the skins of those who fear their Lord; then their skins and their hearts soften to the remembrance of God. That is God's guidance, whereby. He guides whomsoever He will; and whomsoever God leads astray, no guide has he.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath (now) revealed the fairest of statements, a Scripture consistent, (wherein promises of reward are) paired (with threats of punishment), whereat doth creep the flesh of those who fear their Lord, so that their flesh and their hearts soften to Allah's reminder. Such is Allah's guidance, wherewith He guideth whom He will. And him whom Allah sendeth astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent down the best Message: a Scripture that is consimilar and oft-repeated: that causes the skins of those in awe of their Lord to creep. Then their skins and their hearts soften at the mention of God: such is God's guidance. He bestows it upon whoever He will; but no one can guide those whom God leaves to stray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath revealed the most excellent discourse, a Book consimilar oft-repeated, whereat trembleth the skins of these who fear their Lord; then their skins and their hearts soften at the remembrance of Allah. This is Allah's guidance, wherewith He guideth whomsoever He will. And whomsoever Allah sendeth astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sent down the best of discourses, a scripture [composed] of similar motifs, whereat shiver the skins of those who fear their Lord, then their skins and hearts relax at Allah’s remembrance. That is Allah’s guidance, by which He guides whomever He wishes; and whomever Allah leads astray, has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has revealed (from time to time) the most beautiful Message in the form of a Book, consistent with itself, (yet) repeating (its teaching in various aspects): the skins of those who fear their Lord tremble thereat; then their skins and their hearts do soften to the celebration of Allah's praises. Such is the guidance of Allah: He guides therewith whom He pleases, but such as Allah leaves to stray, can have none to guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sent down the best statement, a Book (this Quran), its parts resembling each other in goodness and truth, oft-repeated. The skins of those who fear their Lord shiver from it (when they recite it or hear it). Then their skin and their heart soften to the remembrance of Allah. That is the guidance of Allah. He Guides therewith whom He pleases and whomever Allah sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sent down the best discourse, a Book, consimilar in its oftrepeated (verses) that the skins of those who fear their Lord tremble; and thereafter their skins and hearts soften to the Remembrance of Allah. Such is the Guidance of Allah, whereby He guides whosoever He will; and whosoever Allah leads astray, he has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent down the best of narrations: a Scripture consistent and paired. The skins of those who reverence their Lord shiver from it, then their skins and their hearts soften up to the remembrance of God. Such is God’s guidance; He guides with it whomever He wills. But whomever God leaves astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah. That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray - for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:23] God has revealed the best of discourses, a Book (kitāban, substitutes for ahsana, ‘the best’) namely, a Qur’ān, consimilar, in other words, some of its parts are similar to others in terms of [their] arrangement and otherwise, in coupled phrases — [a Book] in which the Promise [of reward] is coupled with the Threat [of punishment], together with other such [couplings] — whereat quiver, at the mention of whose Threat shiver, the skins of those who fear their Lord; then their skins and their hearts soften to, they are reassured by, the remembrance of God, that is, at the mention of His Promise. That, Book, is God’s guidance, by which He guides whomever He will, of His servants; and whomever God leads astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "532 (Allah hath (now) revealed the fairest of statements) the best speech, i.e. the Qur'an, (a Scripture consistent) the verses of promise, mercy, victory and forgiveness are consistent with each others, and the verses of threat, chastisement, rebuke and warning are consistent with each other, wherein the mention of mercy and chastisement, promises and threats, the abrogating and abrogated, etc., are (paired), it is also said that this means: they are repeated, (whereat) from the verses of chastisement and threats (doth creep the flesh of those who fear their Lord, so that their flesh) soften through the verses of mercy (and their hearts soften) and their hearts return (to Allah's reminder) i.e. the Qur'an. (Such) i.e. the Qur'an (is Allah's guidance) is the clarification of Allah, (wherewith He guideth whom He will) to His religion. (And him whom Allah sendeth astray) from His religion, (for him there is no guide) to lead him to Allah's religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱللَّهُ نَزَّلَ أَحْسَنَ ٱلْحَدِيثِ كِتَاباً مُّتَشَابِهاً } معناه يَشبهُ بَعضُهُ بَعضاً، ويَصدقُ بَعضهُ بَعضاً و: { مَّثَانِيَ } أي قد ثُني فيهِ الأَنباءُ والأَخبارُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفكيف يتيسر لأحد أن يعرض عن ذكر الله وعن استماع كلامه؟! مع أنه: { ٱللَّهُ } الذي دبر أمور عباده، وأرشدهم إلى طريق معاده؛ حيث { نَزَّلَ } تتميماً لترتبيهم { أَحْسَنَ ٱلْحَدِيثِ } وأبلغه في الإفادة والبيان { كِتَاباً } جامعاً لما في الكتب السالفة { مُّتَشَابِهاً } بعض آياتها ببعض في حسن النظم، واتساق المعنى { مَّثَانِيَ } أي: ثنى سبحانه، وكرر الأحكام فيه تأكيداً ومبالغة، أمراً ونهياً، وعداً ووعيداً، وثواباً وعقاباً، عبراً وأمثالاً، قصصاً وتذكيراً\n\n\n\n\nوجعله في كمال الإيجاز والإعجاز والتأثير؛ بحيث { تَقْشَعِرُّ } أي: تنقبض وتضطرب على الاستمرار { مِنْهُ } أي: من سماعه { جُلُودُ ٱلَّذِينَ يَخْشَوْنَ } مهابة { رَبَّهُمْ } في جميع حالاتهم، خوفاً من سلطة سلطنة جلاله { ثُمَّ تَلِينُ جُلُودُهُمْ وَ } تطمئن { قُلُوبُهُمْ إِلَىٰ ذِكْرِ ٱللَّهِ } رجاء من سعة رحمته، بمقتضى لطفه وجماله\n\n\n\n\nوبالجملة: { ذَلِكَ } أي: الكتاب الرفيع الشأن، الواضع البرهان { هُدَى ٱللَّهِ } الهادي لعباده { يَهْدِي بِهِ } ويوفق على الهداية والرشاد بمقضتى ما فيه { مَن يَشَآءُ } من عباده، ويضل به وعن الاستفادة بما فيه من يشاء إرادة واختيارً { وَمَن يُضْلِلِ ٱللَّهُ } بمقتضى قهره وجلاله { فَمَا لَهُ مِنْ هَادٍ } [الزمر: 23] إذ لا يبدل قوله، لا ينازع حكمه، يفعل ما يشاء، ويحكم ما يريد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كتاباً }: بدل من { أحسن } ، أو: حال، لوصفه بقوله: { متشابهاً }\n و { مثاني }: صفة أخرى لكتابِ، أو: حال أخرى منه، أو: تمييز من \" متشابهاً \" ، كما تقول: رأيت رجلاً حسناً شمائلَ، أي: شمائله، والمعنى: متشابهة مثانيه\n و { تقشعر }: الأظهر أنه استئناف، وقيل: صفة لكتاب، أو: حال منه\n يقول الحق جلّ جلاله: { اللهُ نزَّل أحسنَ الحديثِ } وهو القرآن إذ لا حديث أحسن منه، لا تمله القلوب، وتسأمه الأسماع بل تِرداده يزيده تجمُّلاً وطراوة وتكثير حلاوة\n رُوي أن أصحاب رسول الله صلى الله عليه وسلم مَلُّوا ملةً، فقالوا لرسول الله صلى الله عليه وسلم: حدثنا حديثاً، فنزلت\n والمعنى: أن فيه مندوحة عن سائر الأحاديث\n وفي إيقاع اسم الجلالة مبتدأ، وبناءِ \" نزّل \" عليه، من تفخيم أحسن الحديث، ورفع محله، والاستشهاد على حسنه، وتأكيد إسناده إليه تعالى، وأنه من عنده، لا يمكن صدوره من غيره، والتنبيه على أنه وحي معجز، ما لا يخفى\n حال كونه { كتاباً مُتشابهاً } أي: يُشبه بعضُه بعضاً في الإعجاز والبلاغة، أو: تشابهت معانيه بالصحة، والإحكام، والابتناء على الحق والصدق، واستتباع منافع الخلق في المعاد والمعاش، وتناسب ألفاظه وجُمَلِه في الفصاحة والبلاغة، وتجاوب نظمه في الإعجاز\n { مَّثَانِيَ }: جمع مثنى، أي: مكرر، ومردد، لما ثنى من قصصه، وأنبائه، وأحكامه، وأوامره ونواهيه، ووعده ووعيده، ووعظه\n وقيل: لأنه يثنّى في التلاوة، ويُكرر مرة بعد أخرى\n قال القشيري: ويشتمل على نوعي الثناء عليه، بذكر سلطانه وإحسانه، وصفة الجنة والنار، والوعد والوعيد\n هـ\n { تَقْشَعِرُّ منه جُلودُ الذين يخشون ربهم } أي: ترتعد وتنقبض، والاقشعرار: التقبُّض، يقال: اقشعرّ الجلد: إذا انقبض، ويقال: اقشعر جلده ووقف شعره: إذا عرض له خوف شديد، من منكر هائل دهمه بغتة\n والمعنى: أنهم إذا سمعوا القرآن وقوارعه وزواجره، أصابتهم هيبة وخشية تقشعر منه جلودهم، وإذا ذكروا رحمة الله تعالى تبدلت خشيتهم رجاءً، ورهبتهم رغبةً، وذلك قوله تعالى: { ثم تَلينُ جُلودُهم وقلوبُهم إِلى ذكرِ الله } أي: ساكنة مطمئنة إلى ذكر الله\n { ذلك } أي: الكتاب الذي شُرِح أحواله { هُدَى اللهِ يهدي به مَن يشاءُ } أن يهديه، بصرف مجهوده إلى سبب الاهتداء به، أو بتأمله فيما في تضاعيفه من شواهد الحقيقة، ودلائل كونه من عند الله\n { ومَن يُضللِ اللهُ } أي: يخلق فيه الضلالة، بصرف قدرته إلى مبادئها، وإعراضه عما يرشد إلى الحق بالكلية، وعدم تأثُّره بوعده ووعيده، أو: مَن يخذله { فما له من هَادٍ } يُخلصه من ورطة الضلال\n أو: ذلك الذي ذكر من الخشية والرجاء هو أثر هدى الله، يهدي لذلك الأثر مَن يشاء من عباده، { ومَن يُضلل } أي: ومَن لم يؤثر فيه لطفه وهدايته لقسوة قلبه، وإصراره على فجوره { فما له من هادٍ }: من مؤثر فيه بشيء قط\n\n\nالإشارة: أول ما يظهر الفتح على قلب العبد في فَهْم كتاب الله، والتمتُّع بحلاوة تلاوته، ثم ينتقل إلى الاستغراق في ذكره باللسان، ثم بالقلب، ثم إلى الفكرة، ثم العكوف في الحضرة، إن وجد مَن يربيه وينقله عن هذه المقامات، وإلا بقي في مقامه الأول\n وقال الطيبي: مَن أراد الله أن يهديه بالقرآن، أوقع في قلبه الخشية، كقوله:\n\n[البقرة: 2] ثم يتأثر منه ظاهراً، بأن تأخذه في بدء الحال قشعريرة لضعفه، وقوة سطوة الوارد، فإذا أدمن على سماعه، وأَلِفَ أنواره، يطمئن ويلين ويسكن\n هـ\n قلت: وعن هذا عبّر الصدّيق بقوله حين رأى قوماً يبكون عند سماعه: كذلك كنا ثم قست القلوب أي: صلبت وقويت على حمل الواردات\n وقال الورتجبي: سماع المريدين بإظهار الحال عليهم، وسماع العارفين بالطمأنينة والسكون\n هـ\n وقال على قوله: { متشابهاً }: إنه أخبر عن كلية الذات والصفات، التي منبعهما أصل القدم، وصفاته كذاته، وذاته كصفاته، وكل صفة كصفة أخرى، من حيث التنزيه والقدس والتقديس، والكلام بنفسه متشابه المعاني\n هـ\n يعني: إنما كان القرآن متشابهاً لأنه أخبر عن كلية الذات والصفات القديمين، والذات لها شبه بالصفات من حيث اللطافة، والصفات تشبه بعضها بعضاً في الدلالة على التنزيه والكمال، أي: كتاباً دالاًّ على كلية الذات المشابهة للصفات\n وهذا حملٌ بعيد\n ثم ذكر مثال المهتدي والضال، فقال: { أَفَمَن يَتَّقِي بِوَجْهِهِ سُوۤءَ ٱلْعَذَابِ }\n\n",
      "translations": []
    }
  ]
}