{
  "chapter": "الزمر",
  "text": "لكن الذين اتقوا۟ ربهم لهم غرف من فوقها غرف مبنية تجرى من تحتها الانهر وعد الله لا يخلف الله الميعاد",
  "translations": [
    {
      "translation": "But those who have taqwa of their Lord will have high-ceilinged Halls, and more such Halls built one above the other, and rivers flowing under them. That is Allah's promise. Allah does not break His promise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for those who fear displeasing their Lord there are lofty mansions built above mansions, with rivers rippling past below them: A promise of God; (and) God does not go back on His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear their Lord shall have lofty mansions built over one another beneath which rivers flow. This is Allah's promise and never does Allah fail to fulfil His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have fear of their Lord will have lofty mansions built upon mansions beneath which streams flow. It is the promise of God. God does not disregard His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for those who fear their Lord, are the high chambers with more high chambers built above them – rivers flowing beneath them; a promise of Allah; Allah does not renege on His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have Taqwa of their Lord, for them are built lofty rooms, one above another under which rivers flow. (This is) the promise of Allah, and Allah does not fail in (His) promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (as for) those who are careful of (their duty to) their Lord, they shall have high places, above them higher places, built (for them), beneath which flow rivers; (this is) the promise of Allah: Allah will not fail in (His) promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear their Lord -- for them await lofty chambers, above which are built lofty chambers, underneath which rivers flow -- God's promise; God fails not the tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who keep their duty to their Lord, for them are lofty halls with lofty halls above them, built (for them), beneath which rivers flow. (It is) a promise of Allah. Allah faileth not His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for those who truly feared their Lord, there will be tall mansions, built up storey upon storey, beneath which there will be rivers flowing. This is God's promise: God never fails in His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whofear their Lord, for them are lofty chambers with lofty chambers above them, built whereunder rivers flow: the promise of Allah, and Allah faileth not the appointment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who are wary of their Lord, for them there will be lofty abodes with [other] lofty abodes built above them, with streams running beneath them—a promise of Allah. Allah does not break His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But it is for those who fear their Lord. That lofty mansions, one above another, have been built: beneath them flow rivers (of delight): (such is) the Promise of Allah: never doth Allah fail in (His) promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear Allah and keep their duty to their Lord (Allah), for them are built lofty rooms; one above another under which rivers flow (i.e. Paradise). (This is) the Promise of Allah: and Allah does not fail in (His) Promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who fear their Lord, there await high mansions above which are built (more) high mansions, beneath which rivers flow, such is the promise ofAllah; Allah will not fail His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear their Lord will have mansions upon mansions, built high, with streams flowing beneath them. The promise of God; and God never breaks a promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have feared their Lord - for them are chambers, above them chambers built high, beneath which rivers flow. [This is] the promise of Allah. Allah does not fail in [His] promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:20] But as for those who fear their Lord, and therefore obey Him — for them there will be lofty abodes with [other] lofty abodes built above them, with rivers flowing beneath them, that is, beneath [both] the upper and the lower abodes — a promise of God (wa‘da’Llāhi, in the accusative because of an implied verb governing it). God does not fail the tryst, [He does not break] His promise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But those who keep their duty to their Lord) those who believe in Allah's divine Oneness, i.e. Abu Bakr and his believing brothers, (for them are lofty halls) they have canopies (with lofty hails above them) raised above them, (built (for them), beneath which) beneath its houses and trees (rivers) of wine, water, honey and milk (flow. (It is) a promise of Allah. Allah faileth not His promise) to the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: لا يمكن إنقاذه أصلاً { لكن الذين اتّقو } أفعالهم وصفاتهم وذواتهم في التجريد والتفريد من أهل التوحيد { لهم غرف من فوقها غرف } أي: مقامات وأحوال بعضها فوق بعض كالتوكل بفناء الأفعال فوقه\n الرضاء بفناء الصفات فوقه الفناء في الذات { تجري من تحتها } أنهار علوم المكاشفات { أنزل من السماء } الروح { ماء } العلم { فسلكه ينابيع } الحكم في أراضي النفوس بحسب استعدادتها { ثم يخرج به } زرع الأعمال والأخلاق { مختلفاً } أصنافه بحسب اختلاف القوى والأعضاء { ثم يهيج } فينقطع عن أصله بأنوار التجليات { فتراه مصفرّاً } لاضمحلاله وتلاشيه بفناء أصوله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَـٰكِنِ } المؤمنين { ٱلَّذِينَ ٱتَّقَواْ رَبَّهُمْ } في جميع شئونهم وحالاتهم\n خائفين من قهره وغضبه\n راجين رحمته { لَهُمْ } عند ربهم { غُرَفٌ } درجات علية { مِّن فَوْقِهَا غُرَفٌ } درجات أعلى منها\n كأنها منزال { مَّبْنِيَّةٌ } على الأرض\n بعضها فوق بعض على تفاوت طبقاتهم في مراتب القرب { تَجْرِي } على التعاقب والتوالي { مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق المترشحة من بحر الذات على مقتضى الجود والإلهي\n وما كان ذلك إلا { وَعْدَ ٱللَّهِ } الذي وعدها لخُلَّص عباده الذين سلكوا في سبيله\n متعطشين إلى زلال توحيده\n فله أن ينجزه حتماً\n إذ { لاَ يُخْلِفُ ٱللَّهُ } القادر المتقدر على جميع ما شاء وأراد { ٱلْمِيعَادَ } [الزمر: 20] الذي وعده للعباد سيما لأهل العناية منهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { لكِنِ الذين اتقوا ربَّهم } ، وهم الذين وصفوا بقوله تعالى:\n[الزمر: 16]، ووُصفوا بالاجتناب والإنابة، وحصل لهم البُشرى، حيث استمعوا وتبعوا أحسن القول، وهم المخاطبون أيضاً بقوله:\n[الزمر: 10]... الآية. فبيَّن هنا أن لهم درجات عالية في جنات النعيم، في مقابلة ما للكفرة من دركات سافلة في الجحيم، فهي في مقابلة قوله لهم: { من فوقهم ظُلل من النار ومن تحتهم ظُلل } في حق الكفار، أي: لكن أهل التقى لهم عَلالِي، بعضها فوق بعض { مبنيةٌ } بناء المنازل المؤسسة على الأرض في الرصانة والإحكام. { تجري من تحتها } أي: من تحت تلك الغرف { الأنهارُ } من غير تفاوت بين العلو والسفل. { وَعْدَ اللهِ } أي: وعد الله ذلك وعداً، فهو مصدر مؤكد لقوله: { لهم غُرف } فإنه في قوة الوعد. { لا يُخلف الله الميعاد } لاستحالته عليه سبحانه. الإشارة: مَن اتقى الله فيما أمر ونهى، كانت له درجات حسية، مبنية من الذهب والفضة، يترقَّى فيها على قدر عمله وتقواه. ومَن اتقى ما يشغل عن الله من جنس الكائنات، كانت له درجات ومقامات معنوية، قُربية اصطفائية، يرتقي فيها بقدر تقواه وسعيه إلى مولاه، وعد الله لا يُخلف الله الميعاد. قال القشيري: وَعَدَ المطيعين الجنة ـ ولا محالة ـ لا يُخلفه، ووَعَدَ المذنبين المغفرة، ولا محالة ـ يغفر لهم، ووَعَدَ المريدين القاصدين بالوصول، فإذا لم تقع لهم فترة فلا محالةَ يَصدقُ وَعْده. هـ. ثم برهن على ما أوعد ووعد مما يكون بعد البعث من آثار قدرته، فقال: { أَلَمْ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:58",
      "similarity": 0.7380924918671181
    },
    {
      "verse": "25:75",
      "similarity": 0.7233160273210163
    },
    {
      "verse": "34:37",
      "similarity": 0.5787409359111662
    },
    {
      "verse": "3:198",
      "similarity": 0.279481015725319
    },
    {
      "verse": "10:9",
      "similarity": 0.2487687129551234
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:20.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:20.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}