{
  "chapter": "الزمر",
  "text": "افمن شرح الله صدره للاسلم فهو على نور من ربه فويل للقسية قلوبهم من ذكر الله او۟لئك فى ضلل مبين",
  "translations": [
    {
      "translation": "Is he whose breast is opened to Islam, and who is therefore illuminated by his Lord . . . ? Woe to those whose hearts are hardened against the remembrance of Allah! Such people are clearly misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will he whose breast has been opened up to peace (not be) in luminescence from his Lord? Alas for those whose hearts have been hardened to God's remembrance! They wander (astray) in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he whose breast Allah has opened up for Islam and who is thus (moving along a Path) illumined by a light from Allah (be likened to him who derives no lesson from what he observes)? Woe, then, to those whose hearts were further hardened after Allah's admonition. Such are indeed in obvious error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One whose chest (heart and mind) is left open for Islam (submission to His will) shall receive light from God. Woe to those whose hearts have become like stone against the remembrance of God. They are clearly in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will he whose bosom Allah has opened up for Islam – he is therefore upon a light from his Lord – ever be equal to one who is stone hearted? Therefore ruin is for those whose hearts are hardened towards the remembrance of Allah; they are in open error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whose breast Allah has opened to Islam, so that he is in light from his Lord So, woe to those whose hearts are hardened against remembrance of Allah! They are in plain error!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! is he whose heart Allah has opened for Islam so that he is in a light from his Lord (like the hard-hearted)? Nay, woe to those whose hearts are hard against the remembrance of Allah; those are in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whose breast God has expanded unto Islam, so he walks in a light from his Lord...? But woe to those whose hearts are hardened against the remembrance of God! Those are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whose bosom Allah hath expanded for Al-Islam, so that he followeth a light from his Lord, (as he who disbelieveth)? Then woe unto those whose hearts are hardened against remembrance of Allah. Such are in plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anyone whose heart God has opened up to Islam possesses a light from his Lord. But woe betide those whose hearts have been hardened against the rememberance of God! Such people are in obvious error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall he then whose breast Allah hath expanded for Islam, so that he followeth a light from his Lord be as he whose heart is hardened? Then woe Unto those whose hearts are hardened against remembrance of Allah. They are in an error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is someone whose breast Allah has opened to Islam so that he follows a light from His Lord…? So woe to those whose hearts have been hardened to the remembrance of Allah. They are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is one whose heart Allah has opened to Islam, so that he has received Enlightenment from Allah, (no better than one hard-hearted)? Woe to those whose hearts are hardened against celebrating the praises of Allah! they are manifestly wandering (in error)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whose breast Allah has opened to Islam, so that he is in light from His Lord (as he who is non-Muslim)? So, woe to those whose hearts are hardened against remembrance of Allah! They are in plain error!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he whose chest Allah has expanded to Islam, so that he walks upon a light from his Lord (as those whose heart is sealed)? But woe to those whose hearts are hardened against the Remembrance of Allah! Those are in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What about someone whose heart God has opened to Islam, so that he follows a light from His Lord? Woe to those whose hearts are hardened against the mention of God. Those are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is one whose breast Allah has expanded to [accept] Islam and he is upon a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allah. Those are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:22] Is he whose breast God has opened to Islam, and becomes guided, so that he follows a light from his Lord …?, like he whose heart He has sealed [with disbelief]? — this [understanding of the ellipsis] is indicated by [what follows]. So woe — an expression indicating ‘chastisement’ — to those whose hearts have been hardened against the remembrance of God, that is, [hardened] against the acceptance of the Qur’ān. Such are in manifest error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he whose bosom Allah hath expanded) and whose heart Allah made soft (for the Surrender (unto Him)) by means of the light of Islam, (so that he followeth a light from His Lord) so that he is honoured by his Lord and follows the exposition which came from his Lord-the reference here is to 'Ammar Ibn Yasir-as he whose heart is expanded for disbelief, i.e. Abu Jahl? (Then woe) then severe punishment; it is also said: then a valley of puss and blood in Gehenna (unto those whose hearts are hardened against remembrance of Allah) unto those whose hearts are not softened by the remembrance of Allah; the reference here is to Abu Jahl and his host. (Such) those who have such traits (are in plain error) in manifest disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { أَفَمَن شَرَحَ ٱللَّهُ صَدْرَهُ لِلإِسْلاَمِ } يعني: أيستوي من وسع الله قلبه بنزول توحيده، ووفقه لقبل شرائع الإسلام ومعالم الدين المبين لدلائل التوحيد واليقين { فَهُوَ } بواسطة تشرح الله وتوفيقه أياه { عَلَىٰ نُورٍ } انكشاف تام يقين كامل { مِّن رَّبِّهِ } بحيث يفنى فيه، ويبقى ببقائه، وينظر بنوره، ومن طبع الله على قلبه، وختم على سمعه وبصره، فأعماه عن إبصار آيات وجوب وجوده، وأصمته عن استماع دلائل توحيده؟! كلا وحاشا\n\n\n\n\nبل { فَوَيْلٌ } عظيم، وعذاب شديد معد { لِّلْقَاسِيَةِ } المضيقة المكدرة { قُلُوبُهُمْ مِّن } سماع { ذِكْرِ ٱللَّهِ } واستماع ما نزل من عنده من الآيات العظام الدالة على وحدة ذاته ووجوب وجوده { أُوْلَـٰئِكَ } الأشقياء المردودون عن ساحة عز القبول والحضور { فِي ضَلاَلٍ مُّبِينٍ } [الزمر: 22] وجهل عظيم، وغفلة شديدة، وغشاوة غليظة، لا نجاة لهم منها\n\n\n\n\nوبالجملة: لا يرتفع عن عيون بصائرم حجبهم الكثيفة أصلاً\n\n[النور: 40]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الهمزة للإنكار، و { من }: مبتدأ، والخبر محذوف، أي: كمَن ليس كذلك\n  يقول الحق جلّ جلاله: { أفمَنْ شرحَ الله صَدْرَه } أي: وسَّعه وهيَّأه { للإسلام } حتى قَبِله وفرح به، واستضاء بنوره، { فهو على نورٍ } عظيم { من ربه } ، وبصيرة في دينه، وهذا النور: هو اللطف الإلهي الفائض عليه عند مشاهدة الآيات التكوينية والتنزيلية، والتوفيق للاهتداء بها، أو: بمحض الإلهام من الجود والكرم، فيقذف في قلبه نور اليقين، بلا سبب، أو: بصحبة أهل النور، هل يكون هذا كمَن قسا قلبه، وحرج صدره، واستولى عليه ظلمة الغي والضلالة، فأعرض عن تلك الآيات بالكلية؟! ولما نزلت هذه الآية سئل صلى الله عليه وسلم عن الشرح المذكور، فقال:\n\n \" نور يقذفه الله في القلب، فإذا دخل النور القلب انشرح وانفسح \" \n\nقيل: وهل لذلك علامة؟ قال:\n\n \" نعم التجافي عن دار الغرور، والإنابة إلى دار الخلود، والاستعداد للموت قبل نزوله \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:25",
      "similarity": 0.6595884611920193
    },
    {
      "verse": "94:1",
      "similarity": 0.6591960160384033
    },
    {
      "verse": "16:106",
      "similarity": 0.5301630424148858
    },
    {
      "verse": "22:53",
      "similarity": 0.4562838244283328
    },
    {
      "verse": "6:125",
      "similarity": 0.41826925980560065
    }
  ]
}