{
  "chapter": "الزمر",
  "text": "فاذاقهم الله الخزى فى الحيوة الدنيا ولعذاب الءاخرة اكبر لو كانوا۟ يعلمون",
  "translations": [
    {
      "translation": "So Allah made them taste disgrace in the life of this world and the punishment of the Next World is far worse if they only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God made them taste of disgrace in this life; and the torment of the life to come is greater, if they understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them taste degradation in the life of this world, and certainly the chastisement of the Hereafter will be much more grievous. Would that they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made them suffer humiliation in this life. Would that they knew that the torment for them in the next life will be even greater.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them taste humiliation in the life of this world; and indeed the punishment of the Hereafter is the greatest; if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, Allah made them to taste the disgrace in the present life, but greater is the torment of the Hereafter if they only knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them taste the disgrace in this world's life, and certainly the punishment of the hereafter is greater; did they but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so God let them taste degradation in this present life; and the chastisement of the world to come is assuredly greater, did they but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus Allah made them taste humiliation in the life of the world, and verily the doom of the Hereafter will be greater if they did but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gave them a taste of humiliation in the life of this world, but the punishment of the Hereafter is greater, if they only knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them taste humiliation in the life of the world. And surely the torment of the Hereafter is greater - if they but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them taste disgrace in the life of the world, and the punishment of the Hereafter will surely be greater, if they knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them a taste of humiliation in the present life, but greater is the punishment of the Hereafter, if they only knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them to taste the disgrace in the present life, but greater is the torment of the Hereafter if they only knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah let them taste degradation in this present life, but the punishment of the Everlasting Life shall be greater if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made them taste disgrace in the present life, but the punishment of the Hereafter is worse, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah made them taste disgrace in worldly life. But the punishment of the Hereafter is greater, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:26] So God made them taste disgrace, abasement and humiliation, in the way of being transformed [into swine] and being killed and otherwise, in the life of this world. And the chastisement of the Hereafter will surely be greater, had they, that is, the deniers, known, [the nature of] the chastisement thereof, they would not have denied.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus Allah made them taste humiliation in the life of the world) He made them taste the chastisement of the life of this world, (and verily the doom of the Hereafter will be greater) than the chastisement they incurred in the life of this world (if they did but know) but they do not know.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَذَاقَهُمُ ٱللَّهُ } المنتقم منهم { ٱلْخِزْيَ } أي: الذل والهوان، والخيبة والخسران { فِي ٱلْحَيَاةِ ٱلدُّنْيَا وَلَعَذَابُ ٱلآخِرَةِ } المعد لهم فيها { أَكْبَرُ } أي: أشد وأفزع { لَوْ كَانُواْ يَعْلَمُونَ } [الزمر: 26] شدته وفطاعته لما ارتكبوا ما يؤول إليه ويوقعهم فيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأذاقهم اللهُ الخزيَ } أي: الذل والصغار { في الحياة الدنيا } ، كالمسخ، والخسف، والقتل، والأسر، والإجلاء، وغير ذلك من فنون النكال، { ولعذابُ الآخرة } المعد لهم { أكبرُ } لشدته ودوامه { لو كانوا يعلمون } أي: لو كان من شأنهم أن يعلموا شيئاً لعلموا ذلك واعتبروا به\n والآية، يحتمل أن تكون تهديداً لقريش، فالضمير في { قَبْلِهم } يعود إليهم لأن قوله: { ومَن يُضلل الله }\n\n\n إلخ تعرض بمَن أعرض عن كتابه من كفار قريش\n وقال أبو السعود: هو استئناف، مسوق لبيان ما أصاب بعض الكفرة من العذاب، إثر بيان ما يصيب الكل من العذاب الأخروي\n هـ\n الإشارة: الوجه هو أشرفُ الأعضاء وإِمَامُها، فإن كانت في الباطن بهجة المحبة، أو سيما المعرفة، ظهرت عليه، فيتنورُ ويبتهج، وإن كانت ظلمة المعاصي، أو كآبة الحجاب، ظهرت عليه، وإن كانت غيبة في الحق أو سكرة، كان هو أول ما يغيب من الإنسان ويغرق، ثم تغيب البشرية في البحر المحيط، وهو بحر الأحدية\n وقوله تعالى: { فأتاهم العذاب من حيث لا يشعرون } ، قال القشيري: أشدُّ العذاب ما يكون بغتةً، كما أن أتمَّ السرور ما يكون فلتةً\n وفي الهجران والفراق والشدة ما يكون بغتةً غير متوقعة، وهو أنكى للفؤاد، وأشدُّ في التأثير، وأوجعه للقلوب، وفي معناه أنشدوا:\n\nوأتمُّ السرور وأعظمه تأثيراً ما يكون فجأة، حتى قال بعضهم: أشد السرور غفلة على غفلة، وأنشدوا:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:69",
      "similarity": 0.5934225246831911
    },
    {
      "verse": "26:87",
      "similarity": 0.536579957951972
    },
    {
      "verse": "39:40",
      "similarity": 0.5320584590328253
    },
    {
      "verse": "3:192",
      "similarity": 0.507759311434125
    },
    {
      "verse": "3:194",
      "similarity": 0.507063848267495
    }
  ]
}