{
  "chapter": "الزمر",
  "text": "الم تر ان الله انزل من السماء ماء فسلكه ينبيع فى الارض ثم يخرج به زرعا مختلفا الونه ثم يهيج فترىه مصفرا ثم يجعله حطما ان فى ذلك لذكرى لاو۟لى الالبب",
  "translations": [
    {
      "translation": "Do you not see that Allah sends down water from the sky and threads it through the earth to emerge as springs and then by it brings forth crops of varying colours, which then wither and you see them turning yellow and then He makes them into broken stubble? There is a reminder in that for people of intelligence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God sends down water from the sky, then makes it flow in rills on the earth, and brings forth corn from it which, having passed through changes of shade and colour, comes to ripen, and you see it autumnal yellow; then He reduces it to chaff. There are indeed lessons in this for those who are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah sent down water from the sky, then made it flow on earth as springs and streams and rivers and then with it He brings forth vegetation of various hues; then this vegetation ripens and dries up, turning yellow, whereafter He reduces it to broken straw? Surely there is a lesson in this for those endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God has sent down water from the sky and made it flow as springs out of the earth? He makes crops of different colors grow with this water and flourish, which then turn yellow and wither away. In this there is a reminder for the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see that it is Allah Who sent down water from the sky, and then with it made springs in the earth, and then with it produces crops of various colours, and then it dries up and you see it has become yellow, and He then fragments them into small pieces; indeed in this is a reminder for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah sends down water from the sky, and causes it to penetrate the earth, as water springs, and afterward thereby produces crops of different colors, and afterward they wither and you see them turn yellow; then He makes them dry and broken pieces. Verily, in this is a reminder for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah sends down water from the cloud, then makes it go along in the earth in springs, then brings forth therewith herbage of various colors, then it withers so that you see it becoming yellow, then He makes it a thing crushed and broken into pieces? Most surely there is a reminder in this for the men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that God has sent down out of heaven water and threaded it as springs in the earth, then He brings forth therewith crops of diverse hues, then they wither, and thou seest them turning yellow, then He makes them broken orts? Surely in that is a reminder for men possessed of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how Allah hath sent down water from the sky and hath caused it to penetrate the earth as watersprings, and afterward thereby produceth crops of divers hues; and afterward they wither and thou seest them turn yellow; then He maketh them chaff. Lo! herein verily is a reminder for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God sends down water from the sky, guides it to form springs in the earth, and then, with it, brings forth vegetation of various colours, which later withers, turns yellow before your eyes, and then He makes it crumble away? There is truly a reminder in this for those who possess understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah sendeth down water from the heaven, and causeth it to enter springs in the earth, and thereafter produceth thereby corn various coloured. Thereafter it wirhereth, and thou beholdest it turn yellow; then He maketh it chaff. Verily herein is an admonition for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that Allah sends down water from the sky, then He conducts it through the ground as springs. Then He brings forth with it crops of diverse hues. Then they wither and you see them turn yellow. Then He turns them into chaff. There is indeed a lesson in that for those who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah sends down rain from the sky, and leads it through springs in the earth? Then He causes to grow, therewith, produce of various colours: then it withers; thou wilt see it grow yellow; then He makes it dry up and crumble away. Truly, in this, is a Message of remembrance to men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not, that Allah sends down water (rain) from the sky, and causes it to penetrate the earth, (and then makes it to spring up) as water-springs and afterward thereby produces crops of different colours, and afterward they wither and you see them turn yellow, then He makes them dry and broken pieces. Verily, in this, is a Reminder for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah sends down water from the sky and threaded it as springs in the earth? Then, He brings forth plants of various colors, after which they wither, and you see them turning yellow, and then He makes them into broken stubble. Surely, in this there is a reminder for those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how God sends down water from the sky, then He makes it flow into underground wells, then He produces with it plants of various colors, then they wither and you see them yellowing, then He turns them into debris? Surely in this is a reminder for those with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah sends down rain from the sky and makes it flow as springs [and rivers] in the earth; then He produces thereby crops of varying colors; then they dry and you see them turned yellow; then He makes them [scattered] debris. Indeed in that is a reminder for those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:21] Have you not seen, realised, that God sends down water from the heaven, then conducts it as springs, making it enter points of springs, in the ground? Then with it He brings forth crops of diverse hues. Then they wither, they become dried-out, and you see them, for example, after having been green, turning yellow. Then He turns them into chaff. Truly in that there is a reminder for people of pith, possessors of intellect, by which they may be reminded, for it is an indication of God’s Oneness and His power.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed, Muhammad, in the Qur'an (how Allah hath sent down water) rain (from the sky and hath caused it to penetrate the earth as water springs) producing thereof rivers in the earth, (and afterward thereby produceth) through rain (crops of diverse hues; and afterward they wither) they change (and thou seest them turn yellow) after being green in colour; (then He maketh them chaff) dry chaff; such is the life of this world, it vanishes and never lasts. (Lo! Herein) in that which I mentioned concerning the vanishing of the life of this world (verily is a reminder) an admonition (for men of understanding) for those possessed of intellect among people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَسَلَكَهُ يَنَابِيعَ فِي ٱلأَرْضِ } معناه مياهٌ\n واحدُها يَنبوعٌ { ثُمَّ يَهِـيجُ } معناه فيصيرُ يابساً\n والحُطَامُ: الرُفاتُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He let rivers flow in the earth} means that water exists.\n\n\nOne of them is a spring {then it dries up} meaning it becomes a dry riverbed.\n\n\nAnd the debris: the rufaat.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n القائم هو بها من القوى والنفوس والقلوب { ثم يجعله حطاماً } بذهابه وانكساره وانقشاعه عند ظهور صفاته تعالى واستقرارها بالتمكين\n { إن في ذلك لذكرى لأولي } الحقائق المجردة من قشرة الأنائية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأتتعجب وتستبعد من الله إنجاز المواعيد الموعودة من عنده؟! { أَلَمْ تَرَ } أيها المعتبر الرائي { أَنَّ ٱللَّهَ } القادر المقتدر بالإرادة والاختيار { أَنزَلَ } وأفاض بمقتضى جوده المعهود { مِنَ ٱلسَّمَآءِ } أي: عالم الأسماء والصفات { مَآءً } أي: حياة مترشحة من عين الوجود\n وبحر الذات { فَسَلَكَهُ يَنَابِيعَ } أي: أدخله في ينابيع التعينات\n والهويات المنعكسة من تلك السماء والصفات\n وأجراه { فِي ٱلأَرْضِ } أي: الأرض الطبيعية القابلة لقبول الآثار الفائضة { ثُمَّ } بعد إخراجه عليها { يُخْرِجُ بِهِ } يمقتضى حكمته المتقنة { زَرْعاً } أي: هياكل أنواعاً\n وأصنافاً مثمرة ثمر العقائد والمعارف والحقائق { مُّخْتَلِفاً أَلْوَانُهُ } حسب اختلاف الاستعدادات الفائضة عليها من عنده\n\n\n{ ثُمَّ يَهِـيجُ } أي: بعدما ظهر منها ما ظهر\n وترتب عليها ما ترتب\n يجف وييبس إلى حيث يذهب نضارتها ورواؤها المترتب على الإمداد الإلهي { فَـتَرَاهُ } حنيئذ { مُصْفَـرّاً } مشرفاً على الانهدام والانعدام { ثُمَّ يَجْعَلُهُ } يقبض ما فيه من رشاشات الحياة { حُطَاماً } فتاتاً ورفاتاً\n تذروه رياح الآجال\n وتعيده إلى ما عليه من العدم { إِنَّ فِي ذَلِكَ } المذكور { لَذِكْرَىٰ لأُوْلِي ٱلأَلْبَابِ } [الزمر: 21] أي: تذكيراً بليغاً\n وبرهاناً قاطعاً على وجوب وجود من هو منبع الجود\n ومبدأ جميع الموجود\n لا يطرؤه زوال\n ولا يعرضه انتقال\n ليس كمثله شيء وهو السميع البصير\n إلا أنه يتذكر به\n ولا يتنبه منه إلا أولوا الألباب\n الناظرون بنور الله على لُبِّ الأمور\n المعرضون عن قشوره\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { ألم تَرَ } أيها السامع { أن الله أنزلَ من السماء ماءً } هو المطر، وقيل: كل ماء في الأرض فهو من السماء، ينزل منها إلى الصخرة، فيقسمه الله تعالى بين البقاع. { فسَلَكَهُ }: أدخله ونظمه { ينابيعَ في الأرض } أي: عيوناً ومجاري في الأرض، كجري الدماء في العروق في الأجساد: أو: مياهاً نابعة في ظهرها، فإن الينبوع يطلق على المنبع والنابع. فنصب \" ينابيع \" على الحال، على القول الثاني، وعلى نزع الخافض، على الأول. { ثم يُخرِجُ به زرعاً مختلفاً ألوانه }: أصنافه، من بُر وشعير وغيرهما، أو: كيفياته من الألوان، كالصفرة والخضرة والحمرة، والطعوم وغيرهما. و { ثم }: للتراخي في الرتبة والزمان، وصيغة المضارع: لاستحضار الصورة البديعة، { ثم يهيجُ } أي: يتم جفافه، ويشرف على أن يثور من منابته، ويستقل على وجه الأرض، ساتراً لها، { فتراه مُصفراً } من بعد خضرته ونَضرته. { ثم يجعله حطاماً } ، فُتاتاً متكسرة، كأن لم يغنَ بالأمس، فمَن قدر على هذا قدر على إنشاء الخلق بعد فنائهم ومجازاتهم. وقيل: المراد من الآية: تمثيل الحياة الدنيا، في سرعة الزوال، وقُرب الاضمحلال، بما ذكر من أحوال الزرع، ترغيباً عن زخارفها وزينتها، وتحذيراً من الاغترار بمَن سُرّ بها، كما في قوله تعالى:\n[يونس: 24]... الآية، وقيل: للاستشهاد على تحقق الموعود من الأنهار الجارية من تحت الغُرف، بما يشاهد من إنزال المياه من السماء، وما يترتب عليه من آثار قدرته تعالى، وإحكام حكمته ورحمته. { إِن في ذلك } أي: ما ذكر تفصيلاً من إنزال الماء وما نشأ عنه. { لذِكْرى }: لتذكيراً عظيماً { لأُولي الألباب }: لأصحاب العقول الخالصة من شوائب الهوى، فيتذكرون بذلك أن الحياة الدنيا في سرعة التقضي والانصرام، كما يشاهدونه من حال الحكام كل عام، فلا يغترُّون ببهجتها، ولا يُفتنون بفتنتها، أو: يجزمون بأن مَن قدر على إنزال الماء من السماء، وإجرائه في ينابيع الأرض، قادر على إجراء الأنهار من تحت الغُرف. وأما ما قيل: من أنه استدلال على وجود الصانع فلا يليق لأن هذه الأفعال الجليلة ذُكرت مسندة إلى الله تعالى وإنما يليق الاستدلال بها على وجود الصانع لو ذُكرت غير مسندة إلى مؤثر، فتَعَيّن أن يكون متعلق التذكير والتنبيه شؤونه تعالى وشؤون آثاره، كما بيَّن، لا وجوده تعالى. قاله أبو السعود. الإشارة: قال القشيري: والإشارة في هذا أن الإنسان يكون طفلاً، ثم شابًّا، ثم كهلاً، ثم شيخاً، ثم يصير إلى أرذل العمر، ثم إلى آخره يُخترم، ويقال: إن الزرع ما لم يأخذْ في الجفاف لا يُؤخذ منه الحَبُّ، الذي هو المقصود منه، كذلك الإنسان ما لم يخل من نفسه وحَوْلِه لا يكون له قَدْرٌ ولا قيمةٌ.\nقلت: يعني أنه ما لم يمحص نفسه، وينهكها في التقرُّب إلى مولاه، لا قيمة له. ثم قال: ويقال: إن المؤمن بقوة عقله يوجبُ استقلاله بعمله إلا أن يبرُز منه كمالٌ يُمكِّنه من وفارة بصيرته، ثم إذا بدت لائحةٌ من سلطان المعارف تصير تلك الأبواب مغمورة، فإذا بَدَتْ أنوارُ التوحيد استهلكت تلك الجملة كذلك، وأنشدوا:\nقلت: استقلال العبد بعمله هو مثل بروز الزرع من منبته، ووفُورِ بصيرته هو إخراج حبه في سنبله، وبدو لائحة من سلطان المعارف هو اصفراره، وظهور أنوار التوحيد التي تفني وجوده وتغمره في وجود الحق هو صيرورتها حطاماً، فتأمل. وهذا كله نتيجة شرح الصدر الذي أشار إليه بقوله: { أَفَمَن شَرَحَ ٱللَّهُ صَدْرَهُ لِلإِسْلاَمِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:20",
      "similarity": 0.5018360489082923
    },
    {
      "verse": "17:90",
      "similarity": 0.42265227148484075
    },
    {
      "verse": "2:69",
      "similarity": 0.20795539370689659
    },
    {
      "verse": "16:69",
      "similarity": 0.20129486672689353
    },
    {
      "verse": "30:51",
      "similarity": 0.1975117073552842
    }
  ]
}