{
  "chapter": "الزمر",
  "text": "فمن اظلم ممن كذب على الله وكذب بالصدق اذ جاءه اليس فى جهنم مثوى للكفرين",
  "translations": [
    {
      "translation": "Who could do greater wrong than those who lie about Allah and deny the truth when it comes to them? Do the kuffar not have a dwelling place in Hell?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than he who tells a lie against God, and denies the truth when it has come to him? Is there no place for unbelievers in Hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, then, can be more unjust than he who lied against Allah and denied the Truth when it came to him, calling it a lie? Is there no room for such unbelievers in Hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust then one who invents falsehood against God and rejects the truth after it has come to them. Is not hell a dwelling for the disbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is more unjust than one who fabricates a lie against Allah, and denies the truth when it comes to him? Is not the destination of disbelievers in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, who does more wrong than one who utters a lie against Allah, and denies the truth when it comes to him! Is there not in Hell an abode for the disbelievers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is then more unjust than he who utters a lie against Allah and (he who) gives the lie to the truth when it comes to him; is there not in hell an abode for the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But who does greater evil than he who lies against God and cries lies to the very truth, when it comes to him? Is there not in Gehenna a lodging for the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who telleth a lie against Allah, and denieth the truth when it reacheth him? Will not the home of disbelievers be in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, then, is more unjust than he who lies about God and rejects the truth when it comes to him? Is not Hell an abode for those who deny the truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who fabricateth a lie against Allah, and belieth the truth when it cometh Unto him? Will not in Hell be an abode for the infidels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is a greater wrongdoer than him who attributes a falsehood to Allah, and denies the truth when it reaches him? Is not the [final] abode of the faithless in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, then, doth more wrong than one who utters a lie concerning Allah, and rejects the Truth when it comes to him; is there not in Hell an abode for blasphemers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, who does more wrong than one who utters a lie against Allah, and denies the truth [this Quran, the Prophet (Muhammad SAW), the Islamic Monotheism, the Resurrection and the reward or punishment according to good or evil deeds] when it comes to him! Is there not in Hell an abode for the disbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater evil than he who lies against Allah and belies the truth when it comes to him? Is there not a lodging in Gehenna (Hell) for the unbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more evil than he who lies about God, and denies the truth when it has come to him? Is there not in Hell room for the ungrateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is more unjust than one who lies about Allah and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:32] So who is — in other words, none is — a greater wrongdoer than he who imputes falsehood to God, by ascribing partners and child to Him, and [who] denies the truth, namely, the Qur’ān, when it reaches him? Is there not a [fitting] abode in Hell for the disbelievers? Indeed, there is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who doth greater wrong) in his state of disbelief (than he who telleth a lie against Allah) than the one who rejects the Qur'an and claims that Allah has a son or partner; the reference here is to Abu Jahl and his host, (and denieth the Truth) the Qur'an and belief in Allah's divine Oneness (when it reacheth him) when Muhammad brought it to him? (Will not the home) and abode (of disbelievers) Abu Jahl and his host (be in hell?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل الاستبعاد والتقريع: { فَمَنْ أَظْلَمُ } وأضل طريقاً { مِمَّن كَذَبَ علَى ٱللَّهِ } وأنكر وجوده واستقلاله فيه\n وفي الآثار المترتبة عليه { وَكَذَّبَ بِٱلصِّدْقِ إِذْ جَآءَهُ } يعني: بالقرآن الذي جاء به محمد صلى الله عليه وسلم مبيناً لتوحيد الحق\n واستقلاله في الوجود { أَلَيْسَ } يبقى { فِي جَهَنَّمَ } البعد والحرمان { مَثْوًى لِّلْكَافِرِينَ } [الزمر: 32] الساترين بغيوم هوايتهم الباطلة شمس الحق الظاهرة في الآفاق بالاستقلال والاستحقاق\n مع أنه معد لهؤلاء المردة المطرودين عن ساحة العز القبول\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فمَن أظلمُ ممن كَذَبَ على الله } بأن أضاف إليه الشريك والولد\n فإنه لا أحد أظلم منه إذ هو أظلم من كل ظالم\n { وكذَّب بالصِّدق } أي: الأمر الذي هو نفس الصدق وعين الحق\n وهو ما جاء به النبي صلى الله عليه وسلم من عند الله { إِذْ جاءه } أي: كذَّب في أول مجيئه\n من غير تأمُّل فيه ولا تدبُّر\n { أليس في جهنم مَثْوىً للكافرين }؟ أي: لهؤلاء الذين افتروا على الله\n وسارعوا إلى التكذيب بالصدق\n فأظهر موضع الإضمار تسجيلاً وإيذاناً بعلة الحكم الذي استحقوا به جهنم\n والجمع باعتبار معنى { مَن }\n كما أن الإفراد في الضمائر السابقة باعتبار لفظها\n أو: لجنس الكفرة\n وهم داخلون في الكفر دخولاً أولياً\n { والذي جاء بالصدقِ } وهو محمد صلى الله عليه وسلم { وصدَّق به }: وهم المؤمنون\n أي: والفوج\n أو: الفريق الذي جاء بالصدق\n والفريق الذي صدّق به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:68",
      "similarity": 0.8386424952080469
    },
    {
      "verse": "47:19",
      "similarity": 0.5994045422477731
    },
    {
      "verse": "16:29",
      "similarity": 0.5832271269195398
    },
    {
      "verse": "40:76",
      "similarity": 0.5815202591262589
    },
    {
      "verse": "39:72",
      "similarity": 0.580099759897739
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}