{
  "chapter": "الزمر",
  "text": "اليس الله بكاف عبده ويخوفونك بالذين من دونه ومن يضلل الله فما له من هاد",
  "translations": [
    {
      "translation": "Is Allah not enough for His slave? Yet they try to scare you with others apart from Him. If Allah misguides someone, he has no guide",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not God sufficient for His devotee? Still they frighten you with others apart from Him. Whoever God allows to go astray has none to show him the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), does Allah not suffice for His servant? They frighten you with others apart from Him, although he whom Allah lets go astray, none can guide him to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is God not sufficient (support) for His servants? They frighten you with what they worship besides God. Who can guide one whom God has caused to go astray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah Sufficient for His slave? And they threaten you with others beside Him! And whomever Allah sends astray – there is no guide for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah Sufficient for His servant Yet they try to frighten you with those besides Him! And whom Allah sends astray, for him there will be no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah sufficient for His servant? And they seek to frighten you with those besides Him; and whomsoever Allah makes err, there is no guide for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall not God suffice His servant, though they frighten thee with those apart from Him? And whomsoever God leads astray, no guide has he.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will not Allah defend His slave? Yet they would frighten thee with those beside Him. He whom Allah sendeth astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is God not enough for His servant? Yet they try to frighten you with other [deities] besides Him! For such as God lets go astray, there will be no guide;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah sufficient for His bondman? Yet they would frighten thee with those beside Him? And whomsoever Allah sendeth astray, for him there shall be no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does not Allah suffice [to defend] His servant? They would frighten you of others than Him. Yet whomever Allah leads astray, has no guide,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah enough for his Servant? But they try to frighten thee with other (gods) besides Him! for such as Allah leaves to stray, there can be no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah Sufficient for His slave? Yet they try to frighten you with those (whom they worship) besides Him! And whom Allah sends astray, for him there will be no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not that Allah suffices His worshiper, even though they frighten you with those other than Him? He whom Allah leads astray has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is God not enough for His servant? And they frighten you with those besides Him. Whomever God sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not Allah sufficient for His Servant [Prophet Muhammad]? And [yet], they threaten you with those [they worship] other than Him. And whoever Allah leaves astray - for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:36] Does God not suffice [as defender of] His servant?, the Prophet? Indeed, He does. Yet they would frighten you — the address is for him (s) — of those besides Him, namely, the idols, [by telling him] that these [idols] might kill him or render him insane. And whomever God leads astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Will not Allah defend His slave) i.e. Muhammad (pbuh); it is also said it is Khalid Ibn al-Walid; i.e. Allah will defend him from that which they plot against him? (Yet they would frighten thee) Muhammad (with those beside Him) i.e. with al-Lat, al-'Uzza and Manat; they say to you: do not vilify them or curse them lets they bewitch you. (He whom Allah sendeth astray) from His religion, (for him there is no guide) to lead him to Allah's religion; the reference here is to Abu Jahl and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَيْسَ ٱللَّهُ } القديم العليم { بِكَافٍ عَبْدَهُ } المتوكل عليه، المفوض أمره إليه ليكفيه ما ينفعه، ويكف عنه ما يضره { وَ } هم من جهلهم بالله وكمال علمه وقدرته { يُخَوِّفُونَكَ } يا أكمل الرسل؛ يعني: قريشاً { بِٱلَّذِينَ } أي: بأصنامهم الذين يدعونهم آلهة { مِن دُونِهِ } سبحانه جهلاً وعناداً، ويقولون لك على سبيل النصيحة: لا تذكرهم بسوء، فإنَّا نخاف عليك أن يخبلوك، ويفسدوا عقلك، وما ذلك إلا من نهاية جهلهم بالله، وغوايتهم عن طريق توحيده { وَمَن يُضْـلِلِ ٱللَّهُ } بمقضتى قهره وجلاله { فَمَا لَهُ مِنْ هَـادٍ } [الزمر: 36]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أليس اللهُ بكافٍ عَبْدَه } أي: نبيه صلى الله عليه وسلم\n نزلت تقوية لقلبه عليه السلام، وإزالة للخوف الذي كان الكفار يخوفونه، أو: جنس العبد، فيشمل الأنبياء كلهم والمؤمنين، وينتظم فيه النبي صلى الله عليه وسلم انتظاماً أولياً، ويُؤيده قراءة الأخويْن بالجمع\n وهو إنكار ونفي لعدم كفايته تعالى على أبلغ وجه وآكده، كأنَّ الكفاية بلغت من الظهور ما لا يقدر أحد على أن يتفوّه بعدمها، أو يتلعثم في الجواب بوجودها، وإذا علم العبدُ أن الحق تعالى قائم بكفايته، سكن قلبه واطمأن، وأسقط الأحمال والكُلَف عن ظهره، فلا جرم أن الله يكفيه ما أهمّه، ويؤمّنه مما يخافه، كما قال تعالى لنبيه صلى الله عليه وسلم: { ويُخوفونك بالذين من دُونه } أي: الأوثان التي اتخذوها آلهة دونه تعالى، وهي جوامد، لا تضر ولا تنفع، وهذا تسلية لرسول الله صلى الله عليه وسلم عما قالت قريش: إنا نخاف أن تخبُلك آلهتنا، وتُصيبك معرَّتها لعيبك إياها\n وفي رواية: قالوا: لتكفنّ عن آلهتنا، أو ليصيبنك منهم خبل أو جنون، كما قال قوم هود:\n\n[هود: 54]\n وجملة: \" ويخوفونك \": استئناف، أو: حال\n { ومَن يُضلِلِ اللهُ } حتى غفل عن كفايته وعصمته صلى الله عليه وسلم، أو: اعتقد أن الأصنام تضر وتنفع { فما له من هادٍ } يهديه إلى ما يرشده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:43",
      "similarity": 0.60639420717357
    },
    {
      "verse": "17:65",
      "similarity": 0.5620700266355498
    },
    {
      "verse": "4:70",
      "similarity": 0.5310945569557792
    },
    {
      "verse": "33:3",
      "similarity": 0.5071575760894652
    },
    {
      "verse": "4:132",
      "similarity": 0.4973645376204169
    }
  ]
}