{
  "chapter": "الزمر",
  "text": "الا لله الدين الخالص والذين اتخذوا۟ من دونه اولياء ما نعبدهم الا ليقربونا الى الله زلفى ان الله يحكم بينهم فى ما هم فيه يختلفون ان الله لا يهدى من هو كذب كفار",
  "translations": [
    {
      "translation": "Indeed is the sincere deen not Allah's alone? If people take protectors besides Him - 'We only worship them so that they may bring us nearer to Allah' - Allah will judge between them regarding the things about which they differed. Allah does not guide anyone who is an ungrateful liar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember that devotion is exclusively for God. Those who have taken protectors other than Him, say: \"We worship them that they may bring us nearer to God.\" Surely God will judge between them in what they are differing about. Verily God does not show the way to an ungrateful liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo, religion is exclusively devoted to Allah. Your religion is entirely consecrated to Him. As for those who have taken others than Allah for their guardians, (they say): “We worship them only that they may bring us nearer to Allah.” Allah will judge between them concerning what they differ about. Verily Allah does not guide anyone who is given to sheer lying, is an utter unbeliever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The religion of God is certainly pure. Concerning those whom they consider as their guardians besides God, they say, \"We only worship them so that they may make our positions nearer to God.\" God will certainly issue His decree about their differences. God does not guide the liars and the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! Worship is for Allah only; and those who have taken others as their supporters beside Him say; “We worship* them only so that they get us closer to Allah”; Allah will surely judge between them regarding the matter in which they dispute; indeed Allah does not guide one who is a big liar, extremely ungrateful. (*The pagans regarded their idols as smaller Gods and worshipped them. So did the Christians. This does not apply to Muslims who only respect their elders, and ask for their blessings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, the religion is for Allah only. And those who take protectors besides Him (say): \"We worship them only that they may bring us near to Allah.\" Verily, Allah will judge between them concerning that wherein they differ. Truly, Allah guides not him who is a liar, and a disbeliever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, surely, sincere obedience is due to Allah (alone) and (as for) those who take guardians besides Him, (saying), We do not serve them save that they may make us nearer to Allah, surely Allah will judge between them in that in which they differ; surely Allah does not guide him aright who is a liar, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Belongs not sincere religion to God? And those who take protectors, apart from Him -- 'We only serve them that they may bring us nigh in nearness to God' -- surely God shall judge between them touching that whereon they are at variance. Surely God guides not him who is a liar, unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely pure religion is for Allah only. And those who choose protecting friends beside Him (say): We worship them only that they may bring us near unto Allah. Lo! Allah will judge between them concerning that wherein they differ. Lo! Allah guideth not him who is a liar, an ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is to God alone that sincere obedience is due. And those who take other guardians besides Him say, \"We serve them only that they may bring us nearer to God.\" Surely, God will judge between them concerning that wherein they differ. God does not guide anyone who is bent on lying and is a disbelieving liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "LO! for Allah is the religion exclusive. And those who take patrons beside Him, saying: We Worship them not save in order that they may bring us nigh Unto God in approach - -verily Allah will judge between them concerning that wherein they differ. Verily Allah guideth not him who is a liar and ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, only exclusive faith is worthy of Allah, and those who take other as awliya besides Him [claiming,] ‘We only worship them so that they may bring us near to Allah,’ Allah will judge between them concerning that about which they differ. Indeed Allah does not guide someone who is a liar and an ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not to Allah that sincere devotion is due? But those who take for protectors other than Allah (say): \"We only serve them in order that they may bring us nearer to Allah.\" Truly Allah will judge between them in that wherein they differ. But Allah guides not such as are false and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, the religion (i.e. the worship and the obedience) is for Allah only. And those who take Auliya' (protectors and helpers) besides Him (say): \"We worship them only that they may bring us near to Allah.\" Verily, Allah will judge between them concerning that wherein they differ. Truly, Allah guides not him who is a liar, and a disbeliever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not that the sincere religion belongs to Allah? As for those who choose guardians, other than Him, (saying): 'We only worship them so that they will bring us near to Allah' Indeed, Allah will judge between them concerning their differences. Indeed, Allah does not guide he who is an unthankful liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not to God that sincere faith is due? As for those who take guardians besides Him, “We only worship them that they may bring us nearer to God.” God will judge between them regarding their differences. God does not guide the lying blasphemer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position.\" Indeed, Allah will judge between them concerning that over which they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:3] Surely to God belongs pure religion, none other than Him being deserving of it. And those who take besides Him, the idols [as], patrons: and they are the disbelievers of Mecca — they say: ‘We only worship them so that they may bring us near to God’ (zulfā, a verbal noun, with the sense of taqrīban, ‘for the sake of nearness’). God will indeed judge between them, and the Muslims, concerning that about which they differ, of religion, and so admit the believers into Paradise, and the disbelievers into the Fire. Truly God does not guide one who is a liar, attributing a child to Him, a disbeliever, worshipping other than God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Surely Pure religion is) sincerity in religion is enjoined upon people (for Allah only. And those who choose) and those who worship (protecting friends) deities: al-Lat, al-'Uzza and Manat (beside Him) beside Allah, i.e. the disbelievers of Mecca ((say): We worship them only that they may bring us near unto Allah) near to Allah in rank and intercession. (Lo! Allah will judge between them) and the believers on the Day of Judgement (concerning that wherein) in the matter of religion (they differ) they contravene. (Lo! Allah guideth not) to his religion (him who is a liar) about Allah, (an ingrate) and disbelieves in Allah; the reference here is to the Jews, Christians, the Banu Malih, the Magians and the Arab idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ألا لله الدين الخالص } عن شوب الغيرية والأنائية لا لك لفنائك فيه بالكلية\n فلا ذات لك\n ولا صفة\n ولا فعل\n ولا دين\n وإلا لما خلص الدين بالحقيقة فلا يكون لله { والذين } احتجبوا بالكثرة عن الوحدة واتخذوا الغير وليّاً بالمحبة للتقرّب والتوسل به إلى الله { إنّ الله يحكم بينهم } عند حشر مبعوداتهم معهم فيما اختلفوا فيه من صفاتهم وأقوالهم وأفعالهم فيقرن كلاًّ منهم مع من يتولاّه من عابد ومعبود\n ويدخل المبطل النار مع المبطلين كما يدخل المحق الجنة مع المحقين\n ويجزى كلاًّ بوصفه الغالب عليه وما وقف معه واحتجب به مع اختلافهم في الأوصاف وما وقفوا معه { إن الله لا يهدي } إلى النجاة وعالم النور وتجليات الصفات والذوات { من هو كاذب كفّار } لبعده عنه واحتجابه بلظمة الرذائل وصفات النفس عن النور وامتناعه عن قبوله { سبحانه } أي: نزّهه عن المماثلة والمجانسة واصطفاء الولد لكون الوحدة لازمة لذاته وقهره بوحدانيته لغيره\n فلا تماثل في الوجود\n فكيف في الوجوب؟",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { أَلاَ لِلَّهِ ٱلدِّينُ ٱلْخَالِصُ } أي: تنبهوا أيها المجبولون على فطرة التوحيد أن الدين الذي كلفكم الحق عليه\n واوجبه عليكم\n هو الدين الخالص عن أمارات الشرك ومقتضيات الهوى\n الصافي عن شوب العجب والسمعة وشين الرياء\n وبعدما وضح أن الدين الخالص لله\n ولا مستحق له سواه\n\n\n{ وَٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِهِ أَوْلِيَآءَ } أي: والمشركون الذين ادعوا الولاؤة لغير الله\n واستحقاق الإطاعة والانقياد لسواه\n قالوا في تعليل اتخاذهم حين سئلوا عنه ونجوا عليه { مَا نَعْبُدُهُمْ } أي: هؤلاء الغرانيق العلا التي هي الأصنام والأوثان\n وجميع ما يعبد من دونه سبحانه { إِلاَّ لِيُقَرِّبُونَآ إِلَى ٱللَّهِ زُلْفَىۤ } أي: تقريباً كاملاً\n لأنهم كملة مقبولون عنده\n مكرمون لديه سبحانه\n فنتوسل بهم\n لنصل إلى قرب الحق وجواره\n\n\nلا تبالوا أيها الموحدون المتمسكون بحبل التوفيق الإلهي بقولهم هذا\n ولا تلتفوا إلى أبطاليهم الزائغة { إِنَّ ٱللَّهَ } المطلع لما في ضمائرهم من الشرك والعناد على سبيل الرشاد والثبات { يَحْكُمُ بَيْنَهُمْ } وبينكم بمقتضى علمه وخبرته { فِي مَا هُمْ فِيهِ } من الشرك { يَخْتَلِفُونَ } معكم أيها الموحدون بأن يدخلهم في النار بأنواع المذلة والهوان\n ويوصلكم إلى الجنة بالمغفرة والرضوان\n وكيف لا يدخل سبحانه المشركين النيران بأنوع الخزي والهوان { إِنَّ ٱللَّهَ } الحكيم المتقن في أفعاله { لاَ يَهْدِي } أي: لا يوفق على الهداية والرشاد { مَنْ هُوَ كَاذِبٌ } في حق الله ومقتضى ألوهيته وربوبيته\n واستقلاقه في ملكه وملكوته { كَـفَّارٌ } [الزمر: 3] بنعمه الموهوبة له من فضله وكرمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألاَ للهِ الدينُ الخالِصُ } أي: هو الذي وجب اختصاصه بأن تخلص له الطاعة من كل شائبة لأنه المنفرد بصفات الألوهية\n التي من جملتها: الاطلاع على السرائر والضمائر\n الإشارة: قال القشيري: كتابٌ عزيزٌ\n نزل من ربٍّ عزيز\n على عبدٍ عزيز\n بلسان مَلَكٍ عزيز\n في شأنِ أمةٍ عزيزة\n بأمرٍ عزيز\n وأنشدوا:\nتنزيل تنزّهت قلوب الأحباب بعد ذُبولِ عصن سرورها\n في كتاب الأحباب\n عند قراءة فصولها\n والعجب منها كيف لا تزهو سروراً بوصولها\n وارتياحاً بحصولها\n وكتابُ موسى في الألواح\n ومنها كان يقرأ موسى\n وكتابُ نبينا صلى الله عليه وسلم نَزَلَ به الروح\n الأمين\n على قلبك\n وفَصْلٌ بين مَن يكون خطابُ ربه مكتوباً في ألواحه\n وبين مَن يكون خطاب ربه محفوظاً في قلبه\n وكذلك أمته\n\n[العنكبوت: 49]\n هـ\n وقوله تعالى: { فاعْبُد اللهَ مخلصاً له الدينَ } \n قال القشيري: العبادة: معانقة الطاعات على نعت الخضوع\n وتكون بالنفس وبالقلب وبالروح\n فالتي بالنفس ـ أي: بالجوارح ـ الإخلاص فيها: التباعد عن الانتقاص\n والتي بالقلب\n أي: كالفكرة والنظرة\n الإخلاص فيها: التباعد عن رؤية الأشخاص ـ أي: الحس من حيث هو ـ والتي بالروح\n الإخلاص فيها: التنقِّي عن رؤية طلب الاختصاص\n قوله تعالى: { ألا لله الدينُ الخالصُ } هو ما يكون جملته لله\n وما للعبد فيه نصيب فهو عن الإخلاص بعيد\n اللهم إلا أن يكون بأمره\n فإنه إذا أَمَرَ العبدَ أن يحتسب الأجرَ على طاعته\n فأطاعه\n لا يخرج عن الإخلاص بامتثاله ما أمره به\n ولولا هذا مَا صحَّ أن يكون في العالَم مُخْلِصٌ\n يعني: أن جُل الناس إنما يطيعون لاحتساب الأجر\n إلا الفرد النادر\n فمَن زال عنه الحجاب فإنه يعبد الله بالله\n شكراً\n وإظهاراً للأدب\n فإن قصد الاحتساب\n ثم طرأ عليه خواطر بعد تحقق الإخلاص\n فلا يضر\n يدل عليه قوله صلى الله عليه وسلم:\n\n \" مَن قاتل لتكون كلمة الله هي العليا فهو في سبيل الله \" \nوهذا في أصل القصد\n والعوارض غير مضرة\n كما هو صريح حديث آخر\n والله تعالى أعلم\n ثمّ ردّ على المشركين\n فقال: {\n\n\n وَٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِهِ أَوْلِيَآءَ مَا نَعْبُدُهُمْ إِلاَّ لِيُقَرِّبُونَآ إِلَى ٱللَّهِ زُلْفَىۤ إِنَّ ٱللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ إِنَّ ٱللَّهَ لاَ يَهْدِي مَنْ هُوَ كَاذِبٌ كَـفَّارٌ لَّوْ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَداً لاَّصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ سُبْحَانَهُ هُوَ ٱللَّهُ ٱلْوَاحِدُ ٱلْقَهَّارُ }\n قلت: { والذين }: مبتدأ\n و { ما نعبدهم }: محكي بقول محذوف\n حال من واو \" اتخذوا \" وجملة \" إن الله \": خبر\n والاستثناء مفرغ من أعم العلل\n و \" زلفى \": مصدر\n يقول الحق جلّ جلاله: { والذين اتخذوا من دونه أولياء } أي: لم يخلصوا في عبادتهم\n بل شاوبُوها بعبادة غيره\n كالأصنام\n والملائكة\n وعيسى\n قائلين: { ما نعبدهم } لشيء من الأشياء { إِلا لِيُقَربُونا إِلى الله زُلفى } أي: تقريباً\n { إِن الله يحكم بينهم } وبين خصمائهم\n الذين هم المخلصون للدين\n وقد حذف لدلالة الحال عليه\n كقوله:\n[البقرة: 285] على أحد الوجهين\n أي: بين أحد منهم وبين غيره\n قيل: كان المسلمون إذا قالوا للمشركين: مَن خلق السماوات والأرض؟ قالوا: الله\n فإذا قالوا لهم: فما لكم تعبدون الأصنام؟ قالوا: ما نعبدهم إلا ليقربونا إلى الله زلفى\n { إِن الله يحكُم } يوم القيامة بين المتنازعين من المسلمين والمشركين { فيما هم فيه يَختلِفُون } من التوحيد والإشراك\n وادعاء كل واحد صحة ما انتحله\n وحكمُه تعالى هو إدخال الموحدين الجنة والمشركين النار\n وقيل: الموصول واقع على الأصنام\n والعائد محذوف\n أي: والذين اتخذوهم من دونه أولياء\n قائلين: ما نعبدهم\n\n\n الخ\n إن الله يحكم بينهم\n أي: بين العبَدة والمعبودين فيما هم فيه يختلفون\n حيث يرجون منها شفاعتها وهي تلعنهم\n وهذا بعيد\n { إِن الله لا يهدي }: لا يُوفِّق للاهتداء { مَن هو كاذب كفَّار } أي: راسخ في الكذب\n مبالغ في الكفر\n كما يُعرب عنه قراءة من قرأ: \" كذاب \" أو: \" كذوب \" \n أي: لا يهديهما اليوم لدينه لسابق الشقاء\n ولا في الآخرة لثوابه لأنهما اليوم فاقدان للبصيرة\n غير قابلين للاهتداء لتغييرهما الفطرة الأصلية بالتمرُّن في الضلالة والتمادي في الغي\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:64",
      "similarity": 0.578365887609682
    },
    {
      "verse": "81:13",
      "similarity": 0.578223192400935
    },
    {
      "verse": "26:90",
      "similarity": 0.5767059063922333
    },
    {
      "verse": "50:31",
      "similarity": 0.5585992473987034
    },
    {
      "verse": "67:27",
      "similarity": 0.5365622294449935
    }
  ]
}