{
  "chapter": "الزمر",
  "text": "ثم انكم يوم القيمة عند ربكم تختصمون",
  "translations": [
    {
      "translation": "Then on the Day of Rising you will argue in the presence of your Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then on the Day of Resurrection you will dispute before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eventually all of you will contend before your Lord on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on the Day of Judgment, all of you will present your disputes before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you will dispute before your Lord on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on the Day of Resurrection, you will be disputing before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then surely on the day of resurrection you will contend one with another before. your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then on the Day of Resurrection before your Lord you shall dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then lo! on the Day of Resurrection, before your Lord ye will dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, then on the Day of Resurrection you shall place your dispute before your Sustainer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then verily on the Day of Resurrection, before your Lord ye shall contend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then on the Day of Resurrection you will contend before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the end will ye (all), on the Day of Judgment, settle your disputes in the presence of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on the Day of Resurrection, you will be disputing before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then, on the Day of Resurrection, you shall dispute before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on the Day of Resurrection, you will be quarrelling before your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed you, on the Day of Resurrection, before your Lord, will dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:31] Then you will indeed, O mankind, concerning the injustices you committed towards one another, be contending before your Lord on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then lo! on the Day of Resurrection, before your Lord ye will dispute) i.e. the Prophet (pbuh) and the chieftains of the disbelievers will present their proof against each other.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ إِنَّكُمْ } أيها الموحدون والمشركون جميعاً { يَوْمَ ٱلْقِيَامَةِ } المعدة للحساب والجزاء { عِندَ رَبِّكُمْ } المطلع على جميع ما جرى عليكم { تَخْتَصِمُونَ } [الزمر: 31] بعضكم مع بعض فيما أنتم عليه في نشأتكم الأولى، ثم تحاسبون وتجازون بمقتضاه، فستعملون حنيئذ أي منقلب ينقلبون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقيل: كانوا يتربّصون برسول الله صلى الله عليه وسلم موته، أي: إنكم جميعاً بصدد الموت، { ثم إنكم يوم القيامة عند ربكم تَخْتصمون }\n\n\nفتحتجّ عليهم بأنك بلّغت الرسالة، واجتهدت في الدعوة، فتلزمهم الحجة لأنهم قد لجُّوا في العناد، فإذا اعتذروا بتقليد آبائهم لم يُقبل عذرهم\n وقيل: المراد: الاختصام فيما دار بينهم في الدنيا\n والأول أنسب\n الإشارة: لا يستوي القلب المشترك مع القلب المفرد الخالص لله، القلب المشترك تفرّقت همومه، وتشتت أنواره، بتشتيت شواغِله وعلائقه، وتفرّقت محبته، بتفرُّق أهوائه وحظوظه، والقلب المفرد اجتمعت محبته، وتوفرت أنواره وأسراره بقدر تفرُّغه من شواغله وعلائقه\n وفي الحِكَم: \" كما لا يحب العمل المشترك، لا يحب القلب المشترك، العمل المشترك لا يقبله، والقلب المشترك لا يُقبل عليه \"\n وقال أيضاً: \" فرِّغ قلبك من الأغيار تملؤه بالمعارف والأسرار \"\n وقيل: للجنيد: كيف السبيل إلى الوصول؟ فقال: بتوبة تزيل الإصرار، وخوف يقطع التسويف، ورجاء يبعث على مسالك العمل، وبإهانة النفس، بقربها من الأجل، وبُعدها من الأمل\n قيل له: وبمَ يتوصل إلى هذا؟ فقال: بقلب مفرد، فيه توحيد مجرد\n هـ\n وفي الحديث عن رسول الله صلى الله عليه وسلم:\n\n \" مَن جعل الهموم هَمّاً واحداً ـ أي: وهو الله ـ كفاه اللهُ همَّ دنياه، ومَن تشعبت به الهمومُ لم يُبالِ اللهُ به في أيِّ أوديةِ الدنيا هَلَكَ \" \n\nوقال صلى الله عليه وسلم:\n\n \" مَن كانت الدنيا هَمَّهُ فرّق الله عليه أمره، وجعل فقرَه بين عينيه، ولم يأته من الدنيا إلا ما قُسم له، ومَن كانت الآخرة نيته، جمع الله عليه أمره، وجعل غناه في قلبه، وأتته الدنيا وهي صاغرة \" \n\nومَن كان الله همُّه بفنائه فيه جمع الله عليه سره، وأغناه به عما سواه، وخدمه الوجود بأسره، \" أنت مع الأكوان ما لم تشهد المكون، فإذا شَهِدت المكون كانت الأكوانُ معك \"\n والله تعالى أعلم\n ثم بيَّن فريقي الاختصام، فقال: { فَمَنْ أَظْلَمُ مِمَّن كَذَبَ علَى ٱللَّهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:96",
      "similarity": 0.879280738192454
    },
    {
      "verse": "38:64",
      "similarity": 0.783182969808029
    },
    {
      "verse": "38:69",
      "similarity": 0.6578740431350908
    },
    {
      "verse": "43:58",
      "similarity": 0.5563182914434478
    },
    {
      "verse": "50:28",
      "similarity": 0.5498072737458382
    }
  ]
}