{
  "chapter": "الزمر",
  "text": "لهم ما يشاءون عند ربهم ذلك جزاء المحسنين",
  "translations": [
    {
      "translation": "They will have anything they wish for with their Lord. That is the recompense of the good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have what they wish from their Lord. This is the recompense for the good,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have from their Lord all that they wish for. That is the reward of those that do good,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will receive whatever they want from their Lord. Thus is the reward of the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is whatever they wish, before their Lord; this is the reward of the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have all that they will desire with their Lord. That is the reward of the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have with their Lord what they please; that is the reward of the doers of good;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have whatsoever they will with their Lord; that is the recompense of the good-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have what they will of their Lord's bounty. That is the reward of the good:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they will have everything they wish for from their Lord. Such is the reward of those who do good:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs will be whatsoever they will desire with their Lord: that is the hire of the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have what they wish with their Lord—that is the reward of the virtuous—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have all that they wish for, in the presence of their Lord: such is the reward of those who do good:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have all that they will desire with their Lord. That is the reward of Muhsinun (good-doers - see V. 2:112).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have whatever they want with their Lord, that is the recompense of the gooddoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have whatever they please with their Lord. Such is the reward for the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have whatever they desire with their Lord. That is the reward of the doers of good -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:34] They shall have whatever they wish with their Lord. That is the reward of those who are virtuous, to their own souls through their [acceptance of] faith;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They shall have what they will) what they desire (of their Lord's bounty) in Paradise. (That) honour (is the reward of the good) of the ones who believes in Allah's divine Oneness:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبسبب اتصافهم بالتقوى عن محارم الله { لَهُم مَّا يَشَآءُونَ } من اللذات الروحانية { عِندَ رَبِّهِمْ } الذي رباهم بأنواع الكرامة، ووفقهم للهداية إلى جنابه، والعكوف حول بابه تفضلاً عليهم وتكريماً { ذَلِكَ } الذي سمعت من الكرامات { جَزَآءُ ٱلْمُحْسِنِينَ } [الزمر: 34] الذين يحسنون الأدب مع الله بحسب ظواهرهم وبواطنهم، ويأخذون ما نزل من عنده من الأوامر والنواهي على وجه العزيمة الخالصة عن شوب الرياء والرعونات المنافية لإخلاص العبودية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } الذي ذكر من حصول كل ما يشاؤونه { جزاءُ المحسنين } أي: الذين أحسنوا أعمالهم في الدنيا\n { لِيُكَفِّر الله عنهم أَسْوَأَ الذي عَمِلُوا } ، اللام متعلق بقوله: { لهم ما يشاؤون } لأنه في معنى الوعد، كأنه قيل: وعد الله لهم جميع ما يشاؤونه من دفع المضار وحصول المسار ليكفر عنهم بموجب ذلك الوعد أسوأ الذي عملوا، أي: أقبحه وأعظمه، وأولى أصغره\n وقيل: يتعلق بمحذوف، أي: يسر لهم الصدق والتصديق ليكفر\n\n\n إلخ\n { ويجْزِيَهم أجْرَهُم بأحسنِ الذي كانوا يعملون } فإذا كان في عملهم حسن وأحسنُ منه، جزاهم بجزاء الأحسن على الجميع، تكرُّماً منه وإحساناً\n والحاصل: أنه سبحانه لكرمه يُكفر السيىء والأسوأ بالأحروية، ويجزي على الحسن بجزاء الأحسن منه والأرجح، كمَن أهدى لملك هديتين صغيرة وكبيرة، فكافأه على الصغيرة بقدر ما كافأه على الكبيرة\n قال القشيري: وأحسن أعمال المؤمن: الإيمان والمعرفة، فيكون على أحسن الأعمال أحسن الثواب، وهو الرؤية\n هـ\n وإظهار اسم الجليل في موضع الإضمار، لإبراز كمال الاعتناء بمضمون الكلام، والجمع بين الماضي والمستقبل في صلة الموصول الثاني ـ أي: الذي كانوا يعملون ـ دون الأول للإيذان باستمرارهم على الأعمال الصالحة، بخلاف السيئة\n\n\nالإشارة: كل مَن ادعى حالاً مع الله، وليست متحققة فيه، فقد كذب على الله، وكل مَن أنكرعلى أولياء زمانه فقد كذّب بالصدق إذ جاءه\n { والذي جاء بالصدق } ، وهو مَن أَذِن له في التذكير أو التربية\n { وصدّق به } ، وهو مَن سمع وتبع، أولئك هم المتقون، دون غيرهم، لهم ما يتمنون عند ربهم في الدنيا والآخرة، ذلك جزاء أهل مقام الإحسان، الذين يعبدونه على العيان، يُغطي وصفهم بوصفه، ونعتهم بنعته، فيوصلهم بما منه إليهم، لا بما منهم إليه، ثم يكفيهم جميع الشرور، كما قال تعالى: { أَلَيْسَ ٱللَّهُ بِكَافٍ عَبْدَهُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:110",
      "similarity": 0.7189300532734848
    },
    {
      "verse": "37:80",
      "similarity": 0.710920289847111
    },
    {
      "verse": "37:121",
      "similarity": 0.710920289847111
    },
    {
      "verse": "37:131",
      "similarity": 0.710920289847111
    },
    {
      "verse": "77:44",
      "similarity": 0.710920289847111
    }
  ]
}