{
  "chapter": "الزمر",
  "text": "ومن يهد الله فما له من مضل اليس الله بعزيز ذى انتقام",
  "translations": [
    {
      "translation": "and if Allah guides someone, he cannot be misguided. Is Allah not Almighty, Exactor of Revenge?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And none can lead him astray who has been guided by God. Is not God all-mighty, the lord of retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whom Allah guides to the Right Way, none can lead him astray. Is not Allah the Most Mighty, the Lord of Retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who can mislead one whom God has guided? Is God not Majestic and Revengeful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no one can mislead whomever Allah guides; is not Allah the Most Honourable, the Avenger?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever Allah guides, for him there will be no misleader. Is not Allah Almighty, Possessor of Retribution\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whom Allah guides, there is none that can lead him astray; is not Allah Mighty, the Lord of retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whomso God guides, none shall lead him astray; is not God All-mighty, All-vengeful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whom Allah guideth, for him there can be no misleader. Is not Allah Mighty, Able to Requite (the wrong)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but he whom God guides cannot be led astray by anyone. Is God not mighty and capable of retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever Allah guideth, for him there shall be no misleader. Is not Allah Mighty, and Lord of Retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whomever Allah guides, there is no one who can lead him astray. Is not Allah an all-mighty avenger?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And such as Allah doth guide there can be none to lead astray. Is not Allah Exalted in Power, (Able to enforce His Will), Lord of Retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever Allah guides, for him there will be no misleader. Is not Allah All-Mighty, Possessor of Retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he whom Allah guides, none can lead astray. Is not Allah the Almighty, capable of retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomever God guides, for him there is no misleader. Is God not Powerful and Vengeful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever Allah guides - for him there is no misleader. Is not Allah Exalted in Might and Owner of Retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:37] But whomever God guides, there is no one [able] to lead him astray. Is not God Mighty, One Whose way [always] prevails, a Lord of Retribution?, against His enemies? Indeed, He is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he whom Allah guideth) to His religion, (for him there can be no misleader) from His religion; the reference here is to Abu Bakr and his fellow believers; it is also said that the reference is to the Prophet Muhammad (pbuh). (Is not Allah Mighty) in His sovereignty and dominion, (Able to Requite) Able to take revenge on those who disbelieve in Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَهْدِ ٱللَّهُ فَمَا لَهُ مِن مُّضِلٍّ } إذ هو فاعل على الإطلاق بالختيار والاستحقاق لا يجرى في ملكه إلا ما يشاء { أَلَيْسَ ٱللَّهُ } العليم القدير { بِعَزِيزٍ } منيع غالب على أمره { ذِي ٱنتِقَامٍ } [الزمر: 37] شديد على من أراد انتقامه من أعدائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَن يهدِ اللهُ } إلى توحيده وطاعته { فما له من مُضلٍّ } يصرفه عن رشده، أو يصيبه سوء يخل بسلوكه إذ لا راد لفعله، ولا معارض لقضائه، كما ينطقُ به قوله تعالى: { أليسَ اللهُ بعزيزٍ }: غالب لا يغالَب، منيع لا يمانَع ولا ينازَع، { ذي انتقامٍ } من أعدائه لأوليائه، بإعزاز أوليائه وإذلال أعدائه\n وإظهار الاسم الجليل في موضع الإضمار لتحقيق مضمون الكلام، وتربية المهابة\n والله تعالى أعلم\n الإشارة: إذا عَلِمَ العبدُ أن الله كاف جميع عباده، وثق بضمانه، فاستراح من تعبه، وأزال الهموم والأكدار عن قلبه، فيدخل جنة الرضا والتسليم، ويهب عليه من روح الوصال وريحان الجمال نسيم، فيكتفي بالله، ويقنع بعلم الله، ويثق بضمانه\n قال في لطائف المنن: مبنى الوليّ على الاكتفاء بالله، والقناعة بعلمه، والاغتناء بشهوده\n قال تعالى: { أليس الله بكافٍ عبده } وقال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:8",
      "similarity": 0.7427186621172199
    },
    {
      "verse": "14:47",
      "similarity": 0.7228566374036977
    },
    {
      "verse": "3:4",
      "similarity": 0.7199036188164383
    },
    {
      "verse": "15:79",
      "similarity": 0.713074189228867
    },
    {
      "verse": "43:25",
      "similarity": 0.6122617019364951
    }
  ]
}