{
  "chapter": "الزمر",
  "text": "والذى جاء بالصدق وصدق به او۟لئك هم المتقون",
  "translations": [
    {
      "translation": "He who brings the truth and those who confirm it - those are the people who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who brings the truth and verifies it, -- such are the people who are God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who brought the Truth, and those who confirmed it as true, such are the ones who shall be guarded against the chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have brought the truth and have acknowledged it are those who have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who brought this truth and those who testify for it – these are the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who has brought the truth and (those who) believed therein, they are those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who brings the truth and (he who) accepts it as the truth-- these are they that guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who has come with the very truth and confirms it, those they are the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso bringeth the truth and believeth therein - Such are the dutiful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who brings the truth, and he who testifies to it as such -- those are surely the people who are God-fearing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever bringeth the truth, and whosoever giveth credence thereto - these! they are the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who brings the truth and he who confirms it—it is they who are the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who brings the Truth and he who confirms (and supports) it - such are the men who do right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he (Muhammad SAW) who has brought the truth (this Quran and Islamic Monotheism) and (those who) believed therein (i.e. the true believers of Islamic Monotheism), those are Al- Muttaqun (the pious and righteous persons - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who comes with the truth, and confirms it, those are they who surely fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who promotes the truth, and testifies to it—these are the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the one who has brought the truth and [they who] believed in it - those are the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:33] And he who brings the truth — and that is the Prophet (s) — and [those] who confirm it, namely, the believers (here alladhī, ‘he who’, has the significance of alladhīna, ‘those who’), those, they are the ones who guard themselves, against idolatry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ أُولَئِكَ هُمُ الْمُتَّقُونَ (33) الذي جاء بالصدق هو محمد رسول الله صلى الله عليه وسلم والصدق : القرآن كما تقدم آنفاً في قوله : { وكذَّب بالصدق إذ جاءه } \\[ الزمر : 32 \\] .وجملة وصدَّقَ بهِ } صلة موصوللٍ محذوففٍ تقديره : والذي صدق به ، لأن المصدق غير الذي جاء بالصدق ، والقرينة ظاهرة لأن الذي صَدَّق غير الذي جاء بالصدق فالعطف عطف جملة كاملة وليس عطف جملة صِلة .وضمير { بِهِ } يجوز أن يعود على ( الصدق ) ويجوز أن يعود على الذي { جَاءَ بالصِدْق ، } والتصديق بكليهما متلازم ، وإذ قد كان المصدقون بالقرآن أو بالنبي صلى الله عليه وسلم من ثبت له هذا الوصف كان مراداً به أصحاب محمد صلى الله عليه وسلم وهم جماعة فلا تقع صفتهم صلة ل { الذي } لأن أصله للمفرد ، فتعين تأويله بفريق ، وقرينته { أولئك هم المتقون ، } وإنما أفرد عائد الموصول في قوله : { وصَدَّقَ } رعياً للفظ { الذي } وذلك كله من الإِيجاز .وروى الطبري بسنده إلى علي بن أبي طالب أنه قال : الذي جاء بالصدق محمد صلى الله عليه وسلم والذي صدق به أبو بكر ، وقاله الكلبي وأبو العالية ، ومحمله على أن أبا بكر أول من صدّق النبي صلى الله عليه وسلموجملة { أولئك هم المتقون } خبر عن اسم الموصول . وجيء باسم الإشارة للعناية بتمييزهم أكمل تمييز . وضمير الفصل في قوله { هم المتقون } يفيد قصر جنس المتقين على { الذي جاء بالصدق وصدق به } لأنه لا متقي يومئذٍ غير الرسول صلى الله عليه وسلم وأصحابه وكلهم متقون لأن المؤمنين بالنبي صلى الله عليه وسلم لما أشرقت على نفوسهم أنوار الرسول صلى الله عليه وسلم تَطهرت ضمائرهم من كل سيئة فكانوا محفوظين من الله بالتقوى قال تعالى : { كنتم خير أمة أخرجت للناس } \\[ آل عمران : 110 \\] . والمعنى : أولئك هم الذين تحقق فيهم ما أريد من إنزال القرآن الذي أشير إليه في قوله : { لعلهم يتقون } \\[ الزمر : 28 \\] .وجملة لهم ما يشاءون عند ربهم } مستأنفة استئنافاً بَيانياً لأنهم لما قصر عليهم جنس المتقين كان ذلك مشعراً بمزية عظيمة فكان يقتضي أن يَسأل السامع عن جزاء هذه المزية فبُين له أن لهم ما يشاؤون عند الله . و { ما يشاءون } هو ما يريدون ويتمنون ، أي يعطيهم الله ما يطلبون في الجنة .ومعنى { عند ربِّهم } أن الله ادّخر لهم ما يبتغونه ، وهذا من صيغ الالتزام ووعدِ الإِيجاببِ ، يقال : لك عندي كذا أي ألتزِمُ لك بكذا ، ثم يجوز أن الله يلهمهم أن يشاءوا ما لا يتجاوز قدرَ ما عَين الله من الدرجات في الجنة فإن أهل الجنة متفاوتون في الدرجات . وفي الحديث : « إن الله يقول لأحدهم : تمنَّهْ ، فلا يزال يتمنى حتى تنقطع به الأَماني فيقول الله لك ذلك وعشرةُ أمثاله معه »\n\n",
      "translations": [
        {
          "translation": "And whoso bringeth the Truth) the Qur'an and the profession of Allah's divine Oneness, i.e. Muhammad (pbuh) (and believeth therein) and those who believe in him, i.e. Abu Bakr and his fellow believers. (Such are the dutiful) such are those who ward off disbelief, idolatry and indecent acts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلَّذِي جَآءَ بِٱلصِّدْقِ وَصَدَّقَ بِهِ } قال الإِمامُ زيد بن علي عليهما السّلامُ: فالذي جَاءَ بالصّدقِ، هو رَسولُ الله صَلّى الله عليهِ وعَلَى آلهِ وسلمَ، والذي صَدَّق بهِ: أميرُ المؤمنين علي بن أبي طالب صلواتُ الله عليهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of the Most High: {And the one who came with the truth and believed in it} Imam Zaid bin Ali, peace be upon him, said: The one who came with the truth is the Messenger of Allah, may Allah's prayers be upon him, and the one who believed in it is the Commander of the Faithful, Ali bin Abi Talib. May Allah's prayers be upon him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الموحد { ٱلَّذِي } من قبل ربه { جَآءَ بِٱلصِّدْقِ } بلا افتراء ومراء { وَصَدَّقَ بِهِ } إيماناً واحتساباً بلا شوب شك وتردد فيه { أُوْلَـٰئِكَ } السعداء الصادقون المصدقون { هُمُ ٱلْمُتَّقُونَ } [الزمر: 33] الذين يحفظون عن الميل إلى ما لا يرضى منهم سبحانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك هم المتقون }: المنعوتون بالتقى\n التي هي أجلّ الرغائب\n وقرىء \" صَدَقَ \" بالتخفيف\n أي: صدق به الناس\n فأدَّاه إليهم كما أنزل عليه\n من غير تغيير\n وقيل: صار صادقاً بسببه لأن ما جاء به من القرآن معجزة دالة على صدقه صلى الله عليه وسلم\n { لهم ما يشاؤون عند ربهم }: هو بيان لِما لهم في الآخرة من حسن المآب\n بعد بيان ما لهم في الدنيا من محاسن الأعمال\n أي: لهم ما يشاؤونه من جلب المنافع ودفع المضار\n وتوالي المسار في الآخرة\n لا في الجنة فقط لأن بعض ما يشاؤون يقع قبل دخول الجنة\n من تكفير السيئات\n والأمن من الفزع الأكبر\n وسائر أهوال القيامة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:106",
      "similarity": 0.6384233347600274
    },
    {
      "verse": "9:119",
      "similarity": 0.5388274119868186
    },
    {
      "verse": "37:37",
      "similarity": 0.534682828558043
    },
    {
      "verse": "92:6",
      "similarity": 0.5055325939298083
    },
    {
      "verse": "26:31",
      "similarity": 0.5054222218366955
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}