{
  "chapter": "الزمر",
  "text": "ولئن سالتهم من خلق السموت والارض ليقولن الله قل افرءيتم ما تدعون من دون الله ان ارادنى الله بضر هل هن كشفت ضره او ارادنى برحمة هل هن ممسكت رحمته قل حسبى الله عليه يتوكل المتوكلون",
  "translations": [
    {
      "translation": "If you ask them, 'Who created the heavens and the earth?' they will say, 'Allah.' Say: 'So what do you think? If Allah desires harm for me, can those you call upon besides Allah remove His harm? Or if He desires trust in Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, \"Who created the heavens and the earth?\" they will answer: \"God.\" Say: \"Then just think. Can those whom you worship apart from God remove the distress God is pleased to visit upon me, or withhold a blessing God is pleased to favour me with?' Say: \"God is all-sufficient for me. The trusting place their trust in Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them: “Who created the heavens and the earth?” they will surely answer: “Allah.” Tell them: “What do you think, then, of the deities whom you call upon instead of Allah? If Allah should will that an affliction befall me, will those deities remove the harm inflicted by Him? Or if Allah should will that I receive (His) Mercy, will they be able to withhold His Mercy from me?” Say: “Allah is sufficient for me; those who have to put their trust, let them put their trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, \"Who has created the heavens and the earth?\" They will certainly say, \"God has created them.\" Ask them, \"Do you think that you can rescue me from the punishment of God with which He may afflict me? Can you prevent His mercy if He wants to grant it to me?\" Say, \"God is Sufficient (support) for me. In Him alone one must trust\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you ask them, “Who has created the heavens and the earth?”, they will surely say, “Allah”; say, “What is your opinion regarding those whom you worship other than Allah – if Allah wills to cause me some hardship, so will they avert the hardship sent by Him? Or if He wills to have mercy upon me, so will they restrain His mercy?” Proclaim, “Allah is Sufficient for me; the people who trust must rely only upon Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, if you ask them: \"Who created the heavens and the earth\" Surely, they will say: \"Allah.\" Say: \"Tell me then, the things that you invoke besides Allah -- if Allah intended some harm for me, could they remove His harm Or if He intended some mercy for me, could they withhold His mercy\" Say: \"Sufficient for me is Allah; in Him those who trust must put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should you ask them, Who created the heavens and the earth? They would most certainly say: Allah. Say: Have you then considered that what you call upon besides Allah, would they, if Allah desire to afflict me with harm, be the removers of His harm, or (would they), if Allah desire to show me mercy, be the withholders of His mercy? Say: Allah is sufficient for me; on Him do the reliant rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou askest them, 'Who created the heavens and the earth?' they will say, 'God.' Say: 'What think you? That you call upon apart from God -- if God desires affliction for me, shall they remove His affliction? Or if He desires mercy for me, shall they withhold His mercy?' Say: 'God is enough for me; in Him all those put their trust who put their trust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, if thou shouldst ask them: Who created the heavens and the earth? they will say: Allah. Say: Bethink you then of those ye worship beside Allah, if Allah willed some hurt for me, could they remove from me His hurt; or if He willed some mercy for me, could they restrain His mercy? Say: Allah is my all. In Him do (all) the trusting put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them who created the heavens and the earth, they will surely reply, \"God.\" Say, \"Consider those you invoke besides Him: if God wished to harm me, could they undo that harm? Or if God wished to show me mercy, could they withhold that mercy?\" Say, \"God is sufficient for me. In Him let the faithful put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wert thou to ask them: who hath created the heavens and the earth? they will surely say: Allah. Say thou: bethink ye then that those whom ye call upon beside Allah, - could they if Allah intended some hurt for me, remove His hurt? or if He intended some mercy for me, could they withhold His mercy? Say thou: enough for me is Allah; in Him the trusting put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them, ‘Who created the heavens and the earth?’ they will surely say, ‘Allah.’ Say, ‘Have you considered what you invoke besides Allah? Should Allah desire some distress for me, can they remove the distress visited by Him? Or should He desire some mercy for me, can they withhold His mercy?’ Say, ‘Allah is sufficient for me. In Him let all the trusting put their trust.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If indeed thou ask them who it is that created the heavens and the earth, they would be sure to say, \"Allah\". Say: \"See ye then? the things that ye invoke besides Allah,- can they, if Allah wills some Penalty for me, remove His Penalty?- Or if He wills some Grace for me, can they keep back his Grace?\" Say: \"Sufficient is Allah for me! In Him trust those who put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, if you ask them: \"Who created the heavens and the earth?\" Surely, they will say: \"Allah (has created them).\" Say: \"Tell me then, the things that you invoke besides Allah, if Allah intended some harm for me, could they remove His harm, or if He (Allah) intended some mercy for me, could they withhold His Mercy?\" Say: \"Sufficient for me is Allah; in Him those who trust (i.e. believers) must put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you ask them who created the heavens and the earth, they will reply: 'Allah' Say: 'Do you think that, if Allah wills to afflict me those you call upon, other than Him, could remove His affliction, or, that if He wills to let me have mercy, they could withhold His Mercy' Say: 'Allah suffices me. Those who put their trust, put their trust in Him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you asked them, “Who created the heavens and the earth?” they would say, “God.” Say, “Have you seen those you pray to instead of God? If God willed any harm for me, can they lift His harm? And if He willed a blessing for me, can they hold back His mercy?” Say, “God suffices for me. On Him the reliant rely.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you asked them, \"Who created the heavens and the earth?\" they would surely say, \"Allah.\" Say, \"Then have you considered what you invoke besides Allah? If Allah intended me harm, are they removers of His harm; or if He intended me mercy, are they withholders of His mercy?\" Say, \"Sufficient for me is Allah; upon Him [alone] rely the [wise] reliers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:38] And if (wa-la-in: the lām is for oaths) you ask them, ‘Who created the heavens and the earth?’ they will surely say, ‘God.’ Say: ‘Have you considered then those on whom you call, [those whom] you worship, besides God, namely, the idols, if God should desire some harm to befall me, would they [be able to] remove the harm imposed by Him? No! Or if He should desire some mercy for me, would they [be able to] withhold His mercy?’ No! (a variant reading for the two clauses [kāshifātun durrahu and mumsikātun rahmatahu] has the genitive construction [kāshifātu durrihi and mumsikātu rahmatihi). Say: ‘God is sufficient for me. In Him do [all] the trusting put their trust’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily, if thou shouldst ask them) i.e. the disbelievers of Mecca: (Who created the heavens and the earth? They) the disbelievers of Mecca (will say: Allah) created them. (Say) to them, Muhammad: (Bethink you then of those ye worship beside Allah) al-Lat, al-'Uzza and Manat, (if Allah willed some hurt) hardship or trial (for me, could they) i.e. al-Lat, al-'Uzza and Manat (remove from me His hurt) His hardship and trial; (or if He willed some mercy) well-being (for me, could they) i.e. al-Lat, al-'Uzza and Manat (restrain His mercy) from me, such that you ask me to worship them? (Say) Muhammad: (Allah is my all) I trust in Allah. (In Him do (all) the trusting put their trust) it is also said that this means: the believers should put their trust in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال مخاطباً لحيبيه صلى الله عليه وسلم: { وَلَئِن سَأَلْتَهُمْ } يا أكمل الرسل\n يعني: كفار قريش { مَّنْ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: العلويات والسفليات\n وما بينهما من الممتزجات\n ومن أوجدها وأحدثها وأظهر ما فيها من العجائب والغرائب { لَيَقُولُنَّ } ألبتة: { ٱللَّهُ } المتفرد بالخلق والإيجاد\n المتوحد بالألوهية والربوبية\n إذ لا يسع لهم العدول عنه لظهوره\n\n\n{ قُلْ } لهم يا أكمل الرسل بعدما سمعت منهم قولهم هذا\n إلزاماً لهم وتبكيتاً: { أَفَرَأَيْتُم } عياناً أو سمعتم بياناً من { مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ } من هؤلاء المعبودات الباطلة\n وتدعونها آلهة شركاء مع الله قوة المقاومة وقدرة المخاصمة معه سبحانه مثلاً { إِنْ أَرَادَنِيَ ٱللَّهُ } وجرى حكمه على أن يمسني { بِضُرٍّ هَلْ هُنَّ } أي: آلهتكم { كَاشِفَاتُ ضُرِّهِ } سبحانه عني على سبيل المعارضة { أَوْ أَرَادَنِي بِرَحْمَةٍ } فائضة من عنده علي { هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ } يمنعونها عني\n ويدفعون وصولها إلي؟!\n\n\nوبعدما بهتوا وسكتوا عند سماع هذه المقالة نادمين { قُلْ } يا أكمل الرسل كلاماً ناشئاً عن محض التوحيد واليقين\n خالياً عن أمارات الريب واليقين والتخمين { حَسْبِيَ ٱللَّهُ } الواحد الأحد الصمد الكافي لمهام عموم عباده\n الرقيب عليهم في جميع حجالاتهم\n إذ { عَلَيْهِ } لا على غيره من الوسائل والأسباب العادية { يَتَوَكَّـلُ ٱلْمُتَوَكِّلُونَ } المفوضون أمورهم كلها إليه\n حيث يتخذونه وكيلاً\n ويعتقدونه كافياً وحسيباً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { ولئن سألْتَهُم } أي: مَن يخوفونك ممن سوى الله، وقلت لهم: { مَن خلَقَ السماواتِ والأرض لَيقولُنَّ اللهُ } لوضوح الدلائل على انفراده بالاختراع. { قُلْ } تبكيتاً لهم: { أفرأيتم ما تدعون من دون الله } من الأصنام، { إِن أرادنيَ اللهُ بضُرٍّ هل هن كاشفاتُ ضُره } أي: إذا تحققتم أن خالق العالم العلوي والسفلي هو الله وحده، فأخبروني عن آلهتكم، إن أرادني اللهُ بضُر هل يقدر أحد منهم على كشف ذلك الضر عني؟ { أو أرادنِي برحمةٍ } أي: بنفع { هل هن مُمسكاتُ رحمته } وصارفتها عني؟! وقرأ البصري: \" كاشفاتٌ \" و \" ممسكاتٌ \" بالتنوين، ونصب \" ضره \" و \" رحمته \" على المفعول. وتعليق إرادة الضر والرحمة بنفسه صلى الله عليه وسلم، للرد في نحورهم حيث كانوا يُخوفونه من معرَّة الأوثان، ولما فيه من الإيذان بإمحاض النصيحة. وإنما قال: \" كاشفات \" و \" ممسكات \" على التأنيث، بعد قوله: { ويُخوفونك بالذين من دونه } لأنهن إناث، وهن اللات، والعزّى، ومناة، وفيه تهكّم بهم، وبمعبودهم حيث جعلهم يعبدون الإناث. { قُل حَسْبِيَ اللهُ } أي: كافيني في جميع أموري من إصابة الخير ودفع الشر. رُوي أنه صلى الله عليه وسلم لما سألهم سكتوا، فنزلت: { قل حسبي الله عليه يتوكلُ المتوكلون } ، لا على غيره أصلاً لعلمهم بأن كل ما سواه تحت قهر ملكوته. الإشارة: الناس على قسمين: أعداء وأحباب، فإن نظرت إلى الأعداء وجدتهم لا يقدرون أن ينفعوك بشيء إلا ما قدّر الله لك، وإن نظرت إلى الأعداء وجدتهم لا يقدرون أن يضروك بشيء إلا ما قدّر الله عليك، فارفض الجميع، وتعلّق بالله بغنك عن غيره، ويوصل إليك ما قسم لك بالعز والهناء. ثم توعّدهم بالعذاب، فقال: { قُلْ يٰقَوْمِ ٱعْمَلُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:17",
      "similarity": 0.43288894889457824
    },
    {
      "verse": "16:54",
      "similarity": 0.43170973611941255
    },
    {
      "verse": "10:107",
      "similarity": 0.4291703120824115
    },
    {
      "verse": "27:62",
      "similarity": 0.42322895032608193
    },
    {
      "verse": "53:58",
      "similarity": 0.4219422087736654
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:38.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:38.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}