{
  "chapter": "الزمر",
  "text": "لو اراد الله ان يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحنه هو الله الوحد القهار",
  "translations": [
    {
      "translation": "If Allah had desired to have a son He would have chosen whatever He wished from what He has created. Glory be to Him! He is Allah, the One, the All-Conquering.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God pleased to take a son, He could have chosen whom He liked from among those He has created. Glory be to Him. He is God, the one, the omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had wanted to take to Himself a son, He could have chosen anyone He wanted out of those whom He creates. Glory be to Him (that He should have a son). He is Allah: the One, the Overpowering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God wanted to have a son, He would have chosen one from His creatures according to His will. God is too Exalted to have a son. He is One and Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to create a son* for Himself, He would have chosen any one from His creation! Purity is to Him! He is Allah, the One, the All Dominant. (*Which is impossible.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed to take a son, He could have chosen whom He willed out of those whom He created. But glory be to Him! He is Allah, the One, the Irresistible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah desire to take a son to Himself, He will surely choose those He pleases from what He has created. Glory be to Him: He is Allah, the One, the Subduer (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God desired to take to Him a son, He would have chosen whatever He willed of that He has created. Glory be to Him! He is God, the One, the Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had willed to choose a son, He could have chosen what He would of that which He hath created. Be He Glorified! He is Allah, the One, the Absolute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had willed to take a son He could have chosen anyone He pleased out of His creation: but Glory be to Him! [He is above such things.] He is God, the One, the Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed to take a son, He could have chosen whatsoever He pleased out of that which He hath created. Hallowed be He! He is Allah the One, the Subduer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah intended to take a son, He could have chosen from those He has created whatever He wished. Immaculate is He! He is Allah, the One, the All-paramount.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah wished to take to Himself a son, He could have chosen whom He pleased out of those whom He doth create: but Glory be to Him! (He is above such things.) He is Allah, the One, the Irresistible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed to take a son (or offspring or children), He could have chosen whom He pleased out of those whom He created. But glory be to Him! (He is above such things). He is Allah, the One, the Irresistible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had desired to take a son, He would have chosen whatever He willed out of His creation. Exaltations to Him! He is Allah, the One, the Conqueror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God wanted to have a son, He could have selected from His creation at will. Glory be to Him. He is God, the One, the Prevailing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allah, the One, the Prevailing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:4] Had God wanted to take a son — as they allege [that He has], ‘The Compassionate One has taken [to Himself] a son’ [Q. 19:88], He could have chosen from what He has created whatever He willed, and taken it as a child, instead of the angels whom they claim to be God’s daughters, or [their claim] that ‘Ezra is the son of God’, or that ‘Jesus is the son of God’ [cf. Q. 9:30]. Glory be to Him, in exaltation of Him as being above that He should take a child. He is God, the One, the All-Compelling, over all His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Allah had willed to choose a son) from among the angels or human beings as claimed the Jews, Christians and the Banu Malih, (He could have chosen what he would of that which He hath created) in Paradise; and it is said: from among the angels. (Be He glorified!) Allah exonerated Himself. (He is Allah, the One) He has no son or partner, (the Absolute) the All-Conquering over His creation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحيث أثبت له سبحانه شريكً وولداً مع أنه { لَّوْ أَرَادَ ٱللَّهُ } الواحد الأحد الصمد، المستقل في الألوهية والوجود، المنزه عن الأهل والولد { أَن يَتَّخِذَ وَلَداً } ويختار صاحبةً { لاَّصْطَفَىٰ } واختيار { مِمَّا يَخْلُقُ } أي: من بين سائر مخلوقاته في جميع شئونه وحالاته { مَا يَشَآءُ } أولى وأنسب له، وأليق بشأنه من مريم وعيسى، فكيف من الأصنام والأوثان { سُبْحَانَهُ } أي: تعالى شأنه وتنزه ذاته الواحد الأحد الصمد الذيل لم يلد ولم يولد عن إيجاد الصاحبة والولد، بل { هُوَ ٱللَّهُ ٱلْوَاحِدُ } من جميع الوجوه، المستقل بالألوهية والوجود { ٱلْقَهَّارُ } [الزمر: 4] لعرق السوى والأغيار مطلقاً قطعاً لعرق الشركة عن أصله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ لو أراد اللهُ أن يتخذ ولداً } كما يزعم مَن يقول: الملائكة بنات الله، والمسيح وعزير ابن الله، تعالى الله عن قولهم عُلواً كبيراً، { لاصْطَفى مما يَخْلُقُ ما يشاء } أي: لاختار مِن خلقه ما يشاء، ممن له مناسبة صمدانية، كالملائكة، فإنهم منزَّهون عن نقائض البشرية، كالأكل والشرب والنكاح، لكن لم يُرد ذلك لاستحالته في حقه تعالى\n قال القشيري: خاطَبَهم على قَدْرِ عقولهم وعقائدهم، فقال: لو أراد الله أن يتخذ ولداً بالتبنِّي والكرامة لاختار من الملائكة، الذين هم مبرَّؤون من الأكل والشرب وأوصافِ الخلق، ثم أخبر عن تَقَدُّسه عن ذلك، فقال: { سبحانه } أي: تنزيهاً له عن اتخاذ الولد على الحقيقة لاستحالة معناه في نَعْتِه، ولا بالتبني، لتقدُّسه عن الجنسية، والمحالات تدل على وجه الإبعاد\n هـ\n والحاصل: أن الولد في حقه تعالى إن كان عن طريق التولُّد فهو محال، عقلاً ونقلاً، وإن كان عن طريق التبني والكرامة فمُحال سمعاً، وقيل: وعقلاً\n قال شيخ شيوخنا سيدي عبد الرحمن الفاسي رضي الله عنه: قوله، أي: القشيري: لتقدُّسه عن الجنسية، يعني لوحدته وقهره، كما رمز إلى ذلك بذكر الاسمين، أي: الواحد القهّار، وهما عاملان في كل مخلوق، ومحال تعطيلهما بالتبني المقتضي للجنسية، المباينة للوحدانية والقهر، فلا يمكن إلا العبودية، عقلاً، ونقلاً، وحقيقة، وهذا أشد من كلام ابن عطية، فإنه جوّز اتخاذه على جهة التشريف والتبني عقلاً، وإن امتنع شرعاً، لعموم آية:\n\n[مريم: 92] لاتخاذ النسل المستحيل عقلاً ونقلاً، ولاتخاذ الاصطفاء الممتنع شرعاً\n وهو أيضاً أشدُّ من كلام الزمخشري، حيث قال: معنى الآية: لو أراد الله اتخاذ الولد لامتنع ذلك، ولكنه يصطفي مَن يشاء من عباده، على وجه الاختصاص والتقريب، لا على وجه اتخاذه ولداً\n هـ\n فأجمل في الامتناع، وإن كان المتبادر منه شمول القسمين، وكذا قرر جواب \" لو \" ، أي: لامتنع، وجعل قوله: { لاصطفى } الذي هو ظاهر في كونه جواباً غير جواب \" بل \" على معنى الاستئناف، وهو خلاف المطروق والمفهوم من جري الكلام\n والله أعلم\n وما ذكره الزمخشري أيضاً من الامتناع مع الإرادة هو فرض لتعلُّق الإرادة بالممتنع، وهي إنما تتعلق بالجائز، ويحتمل بناؤه على مذهبه الفاسد في إرادة بعض ما لم يقع، وهو شنيع مذهبه، بل ويلزمه عود القهر عليه ـ تعالى عن ذلك، وهو الله الواحد القهّار، فكيف يريد ويمتنع ما يريده؟! هل ذلك إلا عين القهر؟ تعالى عن ذلك علوّاً كبيراً\n هـ\n قال تعالى: { سبحانه } أي: تنزّه بالذات عن اتخاذ الولد، تنزهه الخاص به، على أن { سبحان } مصدر، من: سبّح: إذا بعّد\n { هو اللهُ الواحدُ القهّارُ }: استئناف مبينٌ لتنزهه بحسب الصفات، إثر بيان تنزُّهه عنه بحسب الذات، فإن صفة الألوهية المستتبعة لسائر صفات الكمال، النافية لسمات النقصان، والوحدة الذاتية، الموجبة لامتناع المماثلة والمشاركة بينه تعالى وبين غيره على الإطلاق، مما يقتضي تنزهه تعالى عما قالوه، قضاء متيقناً، وكذا وصف القهارية لأن اتخاذ الولد شأنُ مَن يكون تحت ملكوت الغير، عرضة للفناء، ليقوم الولد مقامه عند فنائه، ومَن هو مستحيل الفناء، قهّار لكل الكائنات، كيف يتصور أن يتخذ من الأسماء الفانية مَن يقوم مقامه؟ قاله أبو السعود\n\n\nالإشارة: الحق سبحانه غيور، لا يرضى لغيره أن يعبد معه غيره، كان على وجه الواسطة والتقريب، أو: على وجه الاستقلال\n لذلك حَرُم السجود لغير الله، وأما الخضوع للأولياء، العارفين بالله، على غير وجه العبادة، فهو عين الخضوع لله لأن الله تعالى أمر بالخضوع للرسل، الدالين على الله، وهم ورثتهم في الدلالة، لكن لا يكون ذلك على هيئة السجود، وإنما يكون على وجه تقبيل القدم أو الأرض بين أيديهم، كما قال الشاعر:\n\nوجعل القشيري مناطَ الرد على الكفرة حيث فعلوا ذلك، وقالوا: ما نعبدهم إلا ليقربونا إلى الله، بغير إذن الله، وإنما حكموا بذلك من ذات أنفسهم\n فردَّ الله عليهم\n قال: وفي هذا إشارة إلى ما يفعله العبد من القُرَبِ، بنشاط نَفْسِه، من غير أن يقتضيه حُكْمُ الوقت، وما يعقد بينه وبين الله تعالى من عقودٍ لا يفي بها، وكان ذلك اتباعُ هوىً\n قال الله تعالى:\n\n[الحديد: 27]\n قلت: ولأجل هذا وجب على مَن أراد الوصول إلى الله أن يتخذ شيخاً عارفاً بأحكام الوقت، ذا بصيرة بدسائس النفس، فيأمره في كل وقت، وفي كل زمان، بما يناسبه ليُخرجه من هوى نفسه، وأسر طبعه، وإلا بقي في العنت والبُعد عن الله، يعبد الله على حرف، كلما زاد عبادة وقرباً ـ في زعمه ـ زاد بُعداً من ربه، وهو لا يشعر، فالنفس إن لم تتصل بمَن يرفع عنها الحجاب، كانت كدود القزِّ، تنسج الحجاب على نفسها بنفسها، حتى تموت في وسطه\n وفي ذلك يقول الششتري في نونيته رضي الله عنه:\n\nوبالله التوفيق\n ثم ذكر دلائل توحيده تعالى، قال: { خَلَقَ ٱلسَّمَاوَاتِ وَٱلأَرْضَ بِٱلْحَقِّ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:65",
      "similarity": 0.6522454755445523
    },
    {
      "verse": "6:18",
      "similarity": 0.5240847037132756
    },
    {
      "verse": "93:9",
      "similarity": 0.50662251018013
    },
    {
      "verse": "12:39",
      "similarity": 0.48779001674417466
    },
    {
      "verse": "40:16",
      "similarity": 0.4743386285840438
    }
  ]
}