{
  "chapter": "الزمر",
  "text": "قل اللهم فاطر السموت والارض علم الغيب والشهدة انت تحكم بين عبادك فى ما كانوا۟ فيه يختلفون",
  "translations": [
    {
      "translation": "Say: 'O Allah. Originator of the heavens and the earth. Knower of the Unseen and the Visible. You will judge between Your slaves regarding what they differed about.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O God, the originator of the heavens and the earth, the knower of the unknown and the known, You alone will judge between Your creatures for things they differed about.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “O Allah, the Originator of the heavens and the earth, the Knower of the unseen and the seen, You it is Who will judge among Your servants concerning what they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Lord, the Creator of the heavens and the earth, knower of the seen and unseen, it is You who will issue Your decree about the differences of Your servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invoke (O dear Prophet Mohammed – peace and blessings be upon him), “O Allah! The Creator of the heavens and the earth, the All Knowing of all the hidden and the open, You will judge between Your bondmen, regarding the matters in which they differed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O Allah! Creator of the heavens and the earth! All-Knower of the unseen and the seen! You will judge between your servants about that wherein they used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O Allah! Originator of the heavens and the earth, Knower of the unseen and the seen! Thou (only) judgest between Thy servants as to that wherein they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O God, Thou originator of the heavens and the earth who knowest the Unseen and the Visible, Thou shalt judge between Thy servants touching that whereon they are at variance.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O Allah! Creator of the heavens and the earth! Knower of the Invisible and the Visible! Thou wilt judge between Thy slaves concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O God! Originator of the heavens and earth! Knower of all that is hidden and all that is manifest, You will judge between Your servants regarding their differences.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O Allah! Creator of the heavens and the earth! Knower of the hidden and the open! Thou shalt judge between Thy bondmen concerning that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘O Allah! Originator of the heavens and the earth, Knower of the sensible and the Unseen, You will judge between Your servants concerning that about which they used to differ.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O Allah! Creator of the heavens and the earth! Knower of all that is hidden and open! it is Thou that wilt judge between Thy Servants in those matters about which they have differed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"O Allah! Creator of the heavens and the earth! All-Knower of the Ghaib (unseen) and the seen. You will judge between your slaves about that wherein they used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O Allah, the Originator of the heavens and the earth who has knowledge of the Unseen and Visible, You shall judge between the differences of Your worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Our God, Initiator of the heavens and the earth, Knower of all secrets and declarations. You will judge between your servants regarding what they had differed about.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O Allah, Creator of the heavens and the earth, Knower of the unseen and the witnessed, You will judge between your servants concerning that over which they used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:46] Say: ‘O God! (Allāhumma means yā Allāh) Originator of the heavens and the earth!, the Creator of them without precedent, Knower of the Unseen and the visible, [Knower of] what is hidden and what is witnessed, You will judge between Your servants concerning that wherein they used to differ’, in the matter of religion: guide me to the truth over which they are at variance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: Allah) lead us to that which is good! (Creator of the heavens and the earth) Creator of the heavens and the earth! (Knower of the invisible and the visible) Knower of the invisible, i.e. what is hidden from the servants, and the visible, i.e. that which the servants know! (Thou wilt judge between Thy slaves) on the Day of Judgement (concerning that wherein they used to differ) concerning that which they used to contravene.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n سيما هؤلاء المعاندين: { ٱللَّهُمَّ فَاطِرَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } ومظهرهما من كتم العدم بالإرادة والاختيار\n يا { عَالِمَ ٱلْغَيْبِ وَٱلشَّهَادَةِ } على التفصيل\n بحيث لا يعزب عن حيطة علمك مثقال ذرة من ذرائر ما لمع عليه برق وجودك بمقتضى جودك { أَنتَ } بذاتك حسب شئونك وتطوراتك { تَحْكُمُ } وتقضي { بَيْنَ عِبَادِكَ } هؤلاء وبيني { فِي مَا كَانُواْ فِيهِ يَخْتَلِفُونَ } معي في أمور الدين القويم المنزل من عندك\n والكتاب المبين طريق توحيدك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { قُلِ اللهمَّ فاطِرَ السماواتِ والأرضِ } أي: يا فاطر\n وليس بوصف\n خلافاً للفراء والمبرّد\n أي: اللهم يا مظهر السماوات والأرض\n { عالِمَ الغيبِ والشهادةِ } أي: ما غاب من أسرار ذاتك وما ظهر\n أو: السر والعلانية\n أي: التجىء إليه تعالى إذا اغتممت من شدة شكيمتهم في المكابرة والعناد فإنه القادر على الأشياء بجملتها\n والعالم بالأحوال برمتها\n { أنت تَحْكُمُ بين عبادك فيما كانوا فيه يختلفون } أي: حُكماً يُسلمه كل مكابر ومعاند\n ويخضع له كلَّ عاتٍ ومارد\n فاحكم بيني وبين معاندي\n بالنصر عليهم في الدنيا والآخرة\n وعن ابن المسيّب: \" ما أعرفُ آية قرئت فدعى عندها إلا أجيب سوى هذه \"\n يعني أنه صلى الله عليه وسلم دعا الله أن يحكم بينه وبين عدوه بالاستئصال\n فأمهل لأنه رحمة\n وعن الربيع بن خثيم ـ وكان قليل الكلام ـ: أنه أُخبر بقتل الحسين رضي الله عنه\n وقالوا: الآن يتكلم\n فما زاد على أن قال: أَوَقد فعلوا؟ وقرأ: { اللهم فاطر السماوات والأرض }\n\n\n\n الآية\n ثم قال على إثرها: قُتِل مَن كان رسول الله صلى الله عليه وسلم يُجلسه في حجره\n ويُقبِّل فاه\n هـ\n الإشارة: ينبغي للمؤمن أن يكون متعاكساً مع المشرك\n إذا سمع كلمة التوحيد \" لا إله إلا الله \" فرح وانبسط\n وإذا ذكر اللغو واللعب اشمأز وانقبض\n والعابد أو الزاهد إذا سَمِعَ ما يدل على الطاعة والاستعداد للآخرة فرح ونشط\n وإذا سمع ما يدلّ على الدنيا والبطالة اشمأز وانقبض\n والمريد السائر\n إذا سمع ما يقرب إلى الله فرح وانبسط\n وإذا سمع ما يُبعد عنه من ذكره السِّوى اشمأز وانقبض\n وأما الواصل الكامل فلا ينقبض من شيء لزيادته إلى الله بكل شيء لأنه عرف الله في كل شيء\n وسمع منه في كل شيء\n فلا يحجبه عن الله شيء\n قد فنيت دائرة حسه\n واتسعت دائرة معرفته\n يأخذ النصيب من كل شيء\n ولا يأخذ النصيبَ منه شيء\n قال الشيخ أبو الحسن الشاذلي رضي الله عنه: في بعض كتب الله المنزلة على أنبيائه\n يقول الله تعالى: مَن أطاعني في كل شيء\n بهجرانه لكل شيء\n أطعته في كل شيء\n بأن أتجلى له دون كل شيء\n حتى يراني أقرب إليه من كل شيء\n هذه طريق أُولى\n وهي طريق السالكين\n وطريق أخرى كبرى: مَن أطاعني في كل شيء\n بإقباله علي كل شيء\n لحسن إرادة مولاه في كل شيء\n أطعته في كل شيء\n بأن أتجلّى له في كل شيء\n حتى يراني كأني كل شيء\n هـ\n ثم ذكر وبال الشرك\n فقال: { وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُواْ مَا فِي ٱلأَرْضِ جَمِيعاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:10",
      "similarity": 0.7200456557529746
    },
    {
      "verse": "3:26",
      "similarity": 0.6211732177535962
    },
    {
      "verse": "8:32",
      "similarity": 0.5688661342721653
    },
    {
      "verse": "5:114",
      "similarity": 0.48591589692432935
    },
    {
      "verse": "21:56",
      "similarity": 0.34564047489234284
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039046.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039046.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:46.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}