{
  "chapter": "الزمر",
  "text": "ولو ان للذين ظلموا۟ ما فى الارض جميعا ومثله معه لافتدوا۟ به من سوء العذاب يوم القيمة وبدا لهم من الله ما لم يكونوا۟ يحتسبون",
  "translations": [
    {
      "translation": "If those who did wrong owned everything on earth, and the same again with it, they would offer it as a ransom to save themselves from the evil of the punishment on the Day of Rising. What confronts them from Allah will be something they did not reckon with.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if the sinners possessed whatever is in the heavens and the earth, and as much more, they would offer it to ransom themselves from the torment of the Day of Resurrection; yet what they did not even imagine would appear to them from God;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the wrong-doers possessed the treasures of the earth in their entirety and as much besides, they would gladly offer it on the Day of Resurrection to redeem themselves from the harrowing chastisement. This because there will appear to them from Allah something (exceedingly dismal which) they had never even imagined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the unjust possessed double the amount of the wealth of the whole earth, they would certainly have liked to offer it on the Day of Resurrection as redemption from the torment of Our scourge when God would make public what they had never expected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the unjust owned all that is in the earth, and another one in addition to it, they would surely give it in exchange for freedom from the wretched punishment on the Day of Resurrection; and a matter which they had never imagined, appeared to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who did wrong, if they had all that is on the earth and therewith as much again, they verily, would offer it to ransom themselves therewith on the Day of Resurrection from the evil torment; and there will become apparent to them from Allah what they had not been reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had those who are unjust all that is in the earth and the like of it with it, they would certainly offer it as ransom (to be saved) from the evil of the punishment on the day of resurrection; and what they never thought of shall become plain to them from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the evildoers possessed all that is in the earth, and the like of it with it, they would offer it to ransom themselves from the evil of the chastisement on the Day of Resurrection; yet there would appear to them from God that they never reckoned with,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And though those who do wrong possess all that is in the earth, and therewith as much again, they verily will seek to ransom themselves therewith on the Day of Resurrection from the awful doom; and there will appear unto them, from their Lord, that wherewith they never reckoned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the wrongdoers possessed all that is on earth, and twice as much, they would offer it to redeem themselves from the awful suffering on the Day of Resurrection. For God will show them what they had never anticipated,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were those who did wrong to own all that is in the earth, and there with as much again, they shall surely seek to ransom themselves therewith from the evil of the torment on the Day of Judgment; and there shall appear Unto them from Allah that whereon they had not been reckoning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if the wrongdoers possessed all that is on the earth, and as much of it besides, they would offer it on the Day of Resurrection to redeem themselves with it from a terrible punishment, and there will appear to them from Allah what they had never reckoned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if the wrong-doers had all that there is on earth, and as much more, (in vain) would they offer it for ransom from the pain of the Penalty on the Day of Judgment: but something will confront them from Allah, which they could never have counted upon!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who did wrong (the polytheists and disbelievers in the Oneness of Allah), if they had all that is in earth and therewith as much again, they verily, would offer it to ransom themselves therewith on the Day of Resurrection from the evil torment, and there will become apparent to them from Allah, what they had not been reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection, if the harmdoers owned all that is in the earth and as much again besides, they would offer it to ransom themselves from the evil of the punishment. From Allah will come to them that with which they had never reckoned,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If those who did wrong owned everything on earth, and the like of it with it, they would redeem themselves with it from the terrible suffering on the Day of Resurrection. But there will appear to them from God what they never anticipated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if those who did wrong had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby from the worst of the punishment on the Day of Resurrection. And there will appear to them from Allah that which they had not taken into account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:47] And [even] if the evildoers possessed all that is in the earth, and as much of it besides, they would surely offer it to ransom themselves from the terrible chastisement on the Day of Resurrection. And there will appear, [there will become] manifest, to them from God that which they had never reckoned, [what they never] supposed [they would see].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "535 (And though those who do wrong) the idolaters (possess all that is in the earth, and therewith as much again) double of that, (they verily will seek to ransom themselves therewith on the Day of Resurrection from the awful doom) from the severe chastisement; (and there will appear unto them, from their Lord) from their Lord's chastisement, (that wherewith they never reckoned) that which they never thought.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تسجيلاً على عدم قابليتهم واستعدادهم لقبول الحق وفيضان أسرار التوحيد { وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُواْ } أي: بعدما جبلوا على فطرة الشقاوة من عند الله الحكيم لو حقّ وثبت لهم ملك { مَا فِي ٱلأَرْضِ } من الزخارف الإمكانية { جَمِيعاً وَمِثْلَهُ } بل أضعافه وآلافه { مَعَهُ لاَفْتَدَوْاْ بِهِ } في سبيل الله، راجين النجاة { مِن سُوۤءِ ٱلْعَذَابِ } المعد لهم { يَوْمَ ٱلْقِيَامَةِ } جزاءً لأعمالهم لما حصل لهم هذا، ولا نجاة لهم منه أصلاً؛ إذ لا يبدل قولنا ولا نغير حكمنا، بل { وَبَدَا } أي: لاح وظهر { لَهُمْ مِّنَ ٱللَّهِ مَا لَمْ يَكُونُواْ يَحْتَسِبُونَ } [الزمر: 47] من قِبله؛ إذ هم عند الإتيان بفواسد الأعمال والعبادات على معبوداتهم، زاعمين جزاء ترتب جزاء الخير عليها، وقد انعكس الأمر عليهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولو أنّ للذين ظلموا } بالشرك، { ما في الأرض جميعاً }: من الأموال والذخائر، { ومِثْلَهُ معه } زائد عليه، { لافْتَدوا به من سوءِ العذاب } أي: شدته، { يومَ القيامةِ } أي: لو أن لهم جميع ما في الدنيا لجعلوا ذلك فدية لأنفسهم من العذاب الشديد، وهيهات هيهات، ولات حين مناص\n وهذا كما ترى وعيد شديد لأهل الشرك، وإقناط كلي لهم\n { وَبَدَا لهم من الله ما لم يكونوا يحتسبون } أي: ظهر لهم من فنون العقوبات ما لم يكن في ظنهم وحسبانهم، ولم يُحدِّثوا به نفوسهم\n وهذا غاية من الوعيد، لا غاية وراءها، ونظيره في الوعد: قوله تعالى:\n\n[السجدة: 17]\n { وبدا لهم سيئاتُ ما كسبوا } أي: ظهر لهم سيئات أعمالهم التي كسبوها، أو سيئات كسبهم حين تُعرض عليهم صحائفُهم، وكانت خافية عليهم، أو: عقاب ذلك",
      "translations": []
    }
  ]
}