{
  "chapter": "الزمر",
  "text": "الله يتوفى الانفس حين موتها والتى لم تمت فى منامها فيمسك التى قضى عليها الموت ويرسل الاخرى الى اجل مسمى ان فى ذلك لءايت لقوم يتفكرون",
  "translations": [
    {
      "translation": "Allah takes back people's souls when their death arrives and those who have not yet died, while they are asleep. He keeps hold of those whose death has been decreed and sends the others back for a specified term. There are certainly Signs in that for people who reflect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gathers up the souls of those who die, and of those who do not die, in their sleep; then He keeps back those ordained for death, and sends the others back for an appointed term. Surely there are signs in this for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who takes away the souls of people at the hour of their death, and takes away at the time of sleep the souls of those that have not died. Then He retains the souls of those against whom He had decreed death and returns the souls of others till an appointed time. Surely there are Signs in this for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will receive their souls when they die. Their souls do not die when they are sleeping. During people's sleep He withholds those souls which He has decreed to die and releases the others for an appointed time. In this there is evidence (of the Truth) for the thoughtful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who gives death* to living beings at the time of their demise, and to those who do not die, during their sleep; so He restrains the soul on which the decree of death has been passed, and leaves the other till the appointed term; indeed in this are signs for people who reflect. (*Death is of 2 types – passing to the next world, and sleeping.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who takes away the souls at the time of their death, and those that die not during their sleep. He keeps those (souls) for which He has ordained death and sends the rest for a term appointed. Verily, in this are signs for a people who think deeply.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah takes the souls at the time of their death, and those that die not during their sleep; then He withholds those on whom He has passed the decree of death and sends the others back till an appointed term; most surely there are signs in this for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God takes the souls at the time of their death, and that which has not died, in its sleep; He withholds that against which He has decreed death, but looses the other till a stated term. Surely in that are signs for a people who reflect. Or have they taken intercessors apart from God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah receiveth (men's) souls at the time of their death, and that (soul) which dieth not (yet) in its sleep. He keepeth that (soul) for which He hath ordained death and dismisseth the rest till an appointed term. Lo! herein verily are portents for people who take thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who takes away men's souls upon their death and the souls of the living during their sleep. Then He withholds those for whom He has ordained death and restores the souls of others for an appointed term. There are certainly signs in this for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is who taketh away souls at the time of their death, and those which die not in their sleep: then He withhold those on which He hath decreed death, and sendeth back the rest for an appointed term. Verily herein are signs for a people who ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah takes the souls at the time of their death, and those who have not died, in their sleep. Then He retains those for whom He has ordained death and releases the others until a specified time. There are indeed signs in that for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah that takes the souls (of men) at death; and those that die not (He takes) during their sleep: those on whom He has passed the decree of death, He keeps back (from returning to life), but the rest He sends (to their bodies) for a term appointed verily in this are Signs for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who takes away the souls at the time of their death, and those that die not during their sleep. He keeps those (souls) for which He has ordained death and sends the rest for a term appointed. Verily, in this are signs for a people who think deeply.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah takes away souls at the time of their death (the temporary death of sleep), and those who do not die during their sleep He withholds that upon whichHe has decreed death, but turns lose the other till a stated term. Surely, there are signs in this for a nation who contemplate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God takes the souls at the time of their death, and those that have not died during their sleep. He retains those for which He has decreed death, and He releases the others until a predetermined time. In that are signs for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:42] God takes the souls at the time of their death, and, He takes, those that have not died in their sleep, in other words, He takes them during sleep. Then He retains those for whom He has ordained death and releases the others until an appointed term, that is, until the time of their death. The one that is released is the soul [that possesses the faculty] of discernment, without which the soul [containing the force] of life is able to remain [temporarily] — but this cannot be the other way round. Truly in that, mentioned, there are signs, indications, for a people who reflect, and then realise that the One with the power to do this also has the power to resurrect — Quraysh, however, never reflected on this [fact].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah receiveth (men's) souls) Allah takes to Himself the souls of people (at the time of their death) their sleep, (and that (soul) which dieth not (yet) in its sleep. He keepeth that (soul) for which He hath ordained death and dismisseth the rest till an appointed term. Lo herein) in keeping and releasing souls (verily are portents) signs and admonitions (for people who take thought) for people who reflect on this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { ٱللَّهُ } المستوي على عروش ما ظهر وبطن بالاستيلاء التام والقدرة الكاملة الشاملة { يَتَوَفَّى ٱلأَنفُسَ } ويقطع إمداده بالحياة عليها بمقتضى النفس الرحماني { حِينَ مَوْتِـهَا } أي حين تعلق إرادته سبحانه بقطع علقة عنها\n وإرجاعها إلى ما كانت عليه من العدم { وَ } كذا تتوفى الأنفس { ٱلَّتِي لَمْ تَمُتْ } أي: لم تحكم عليها بقطع العلقة والإمداد عنها { فِي مَنَامِـهَا } أي: يفصل عنها ما هو مبدأ الآثار والأفعال\n وما يترتب عليه التمييز والشعور\n ويبقى رمق منه عنها { فَيُمْسِكُ } ويقبض سبحانه بعد الفصل والتوفي الانفس { ٱلَّتِي قَضَىٰ عَلَيْهَا ٱلْمَوْتَ } في لوح قضائه وحضرة علمه { وَيُرْسِلُ ٱلأُخْرَىٰ } أي: يعيدها إلى أبدانها\n ويمهلها { إِلَىٰ أَجَلٍ مُّسَمًّى } معين مقدر عنده\n الإمداد والارتباط\n\n\nوعن المرتضى الأكبر كرم الله وجهه: يخرج الروح عند النوم ويبقى شعاعه في الجسد\n فبذلك يرى الرؤيا\n فإذا انتبه من النوم عاد الروح إلى جسده بأسرع من لحظة\n\n\nولهذا قيل: إن أرواح الأحياء والأموات تلتقي في المنام\n فتتعارف ما شاء الله\n فإذا أرادت الرجوع إلى الأجساد\n أمسك الله أرواح الأموات عنده\n وأرسل أرواح الأحياء إلى أجسادها\n\n\nوبه ورد الحديث صولات الله على قائله:\n \" إذا أوى أحدكم إلى فِراشه فَلْيَنفُض فِرَاشه بِدَاخِلَةٍ إِزَارِهِ\n فَإِنه لا يَدْري ما خَلفَه عليه\n ثم يقول: باسمك ربي وَضَعْتُ جنبي\n وبك أرفعُهُ\n إنْ اَمْسكْتَ نَفْسي فأرْحَمْها\n وإنْ أَرْسَلتَها فَاحْفَظْها بما تَحْفطُ به عبادَك الصالحين \"\n \n \n{ إِنَّ فِي ذَلِكَ } التوفي والفصل\n والإمساك والإرسال { لآيَاتٍ } دلائل واضحات وشواهد لا ئحات على قدرة الصانع الحكيم القدير العليم { لِّقَوْمٍ يَتَفَكَّرُونَ } [الزمر: 42] في مقدوراته سبحانه\n ويشاهدون آثار قدرته عليها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { الله يتوفّى الأنفُسَ } أي: الأرواح { حين موتِها } فيقبضها إليه قبضاً، { و } يتوفى الأنفس { التي لم تمت في منامها } فيقبضها ويترك شعاعها في البدن، فالتي قضى عليها الموت يتوفاها ظاهراً وباطناً، والتي لم يقضِ موتها يتوفاها ظاهراً فقط عند النوم، { فيُمسك التي قَضَى عليها الموتَ } ، لا يردها إلى البدن، { ويُرْسِلُ الأخرى } أي: النائمة إلى بدنها عند التيقُّظ { إِلى أجلٍ مُسمًّى }: هو الوقت المضروب لموتها، فشبَّه النائمين بالموتى، حيث لا يميزون ولا يتصرفون، كما أن الموتى كذلك. قال الإمام: النفس الإنسانية عبارة عن جوهر مشرق روحاني، إذا تعلّق بالبدن حصل ضوؤه في جميع الأعضاء، وهي الحياة، ثم إنه في وقت النوم ينقطع تعلُّقه عن ظاهر البدن، دون باطنه، وفي وقت الموت ينقطع تعلقه عن ظاهر البدن وباطنه، فالموت والنوم من جنس واحد بهذا الاعتبار، لكن الموت انقطاع كامل، والنوم انقطاع ناقص، فظهر أن القادر الحكيم دبَّر تعلُّق جوهر النفس بالبدن على ثلاثة أوجه: أحدها: أنه دبَّر أمرها بحيث يقع ضوء الروح على جميع أجزاء البدن، ظاهره وباطنه، وذلك هو اليقظة. وثانيها: بحيث يقطع عن الظاهر والباطن، وهو الموت. وثالثها: بحيث يقطع عن ظاهر البدن دون الباطن، وهو النوم، فثبت أن النوم والموت يشتركان في كل واحد منهما بتوفي النفس، ثم يمتاز أحدهما بخواص معينة. ومثل هذا التقدير العجيب لا يمكن صدوره إلا عن القادر العليم الحكيم. هـ. وقال سهل: إن الله إذا توفى الأنفس أخرج الروح النوري من لطيف نفس الطبيعي الكثيفي، فالذي يتوفى في النوم من لطيف نفس الطبع، لا لطيف نفس الروح. فالنائم يتنفس تنفُّساً لطيفاً، وهو نَفَس الروح، الذي إذا زال لم يكن للعبد حركة، وكان ميتاً. وقال: حياة النفس الطبيعي بنور لطيف، وحياة لطيف نفس الروح بذكر الله. وقال أيضاً: الروح تقوم بلطيفة في ذاتها بغير نفس الطبع، ألا ترى أن الله تعالى خاطب الكل في الذر بنفس، وروح، وفهم، وعقل، وعلم لطيف، بلا حضور طبع كثيف. هـ. قلت: وبهذا الاعتبار يقع لها العذاب في البرزخ أو النعيم، وتذهب وتجيء في عالم البرزخ. وقال في القصد: النفس مع الروح كالجسد مع الظل، والظل يميل، والأصل لا يميل، والروح سره، والسر بربه، وهو شعاع الحقيقة الصغرى، والسر نور السر الأعلى، وكل هذا مخلوق، بقدرة الله موثوق، فلا يستفزك غير هذا فتشقى، وفي جهنم من نور البُعد تلقى. هـ. قلت: السر الأعلى هو معاني أسرار الذات القائمة بالأشياء، وهو قديم غير مخلوق. وذكر الثعلبي عن ابن عباس أنه قال: في ابن آدم نفس وروح، بينهما مثل شعاع الشمس، فالنفسُ هي التي بها العقل والتمييز، والروح التي بها التحرُّك والنَّفَس فإذا نام العبد قبض الله نفسه ولم يقبض روحه.\nهـ. هذا، وفي الصحيح: إن الله قبض أرواحنا حيث شاء، وردها حيث شاء. فأطلق القبض على الأرواح. والصواب: أن النفس والروح في هذا واحد بدليل قوله: { اللهُ يتوفى الأنفس حين موتها والتي لم تمت } والحاصل: أن الموت: توفِّ كامل، بإخراج الروح مع شعاعها من البدن، فتذهب الحياة، والنوم: توفٍّ ناقص، بإخراج الروح مع بقاء شعاعها في البدن، به الحياة والتنفُّس. وعن ابن عباس رضي الله عنه أيضاً أنه قال: إن أرواح الأحياء والأموات تلتقي في المنام، ويتعارف ما شاء الله منها، فإذا أراد الله رجوعها إلى الأجسام، يُمسك الله عنده أرواح الأموات، ويرسل أرواح الأحياء إلى أجسادها، فذلك قوله عزّ وجل: { الله يتوفى الأنفس }... الآية. وعبارة \" عز الدين بن عبد السلام \": في كل جسد روحان إحداهما: روح اليقظة، التي أجرى الله العادة أنها إذا كانت في الجسد كان الإنسان متيقظاً، فإذا خرجت من الجسد نام الإنسان، ورأت تلك الروح المنامات، والأخرى: روح الحياة، التي أجرى الله العادة أنها إذا كانت في الجسد كان حيّاً فإذا فارقته مات، فإذا رجعت إليه حَيِيَ، وهاتان الروحان في بطن الإنسان، لا يعلم مقرَّهما إلا مَن أطلعه الله عليهما، فهما كجنينين في بطن امرأة. هـ. والآية منبهة على كمال قدرته، وفيها دلالة على البعث، وأنه كاليقظة سواء، وهذا معنى قوله: { إِن في ذلك لآياتٍ لِقَومٍ يتفكرون } في عجائب قدرته، فيعلمون أن مَن قدر على إمساك الأرواح في النوم، وردها، قادر على إماتتها وإحيائها. وفي التوراة: كما تنام تموت، وكما تستيقظ تُبعث. الإشارة: الله يتوفى الأنفس المطهرة إلى حضرة قدسه، حين موتها من الهوى، ويقبض الأنفس التي لم تمت من حظوظها في سجن الأكوان، وهيكل ذاتها، في حال منام غفلتها، فيمسك التي قضى عليها الموت في حضرة قدسه، فلا يردها إلى شهود حضرة الأشباح ويرسل الأخرى تجول في حضرة الأشباح وأودية الدنيا، إلى أجل مسمًّى، إما موتها الحسي أو المعنوي، إن سبقت لها سابقة عناية. ثم تمّم الرد على مَن اعتقد أن الأصنام تنفع أو تضر، فقال: { أَمِ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ شُفَعَآءَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:19",
      "similarity": 0.4807823188070818
    },
    {
      "verse": "30:23",
      "similarity": 0.4757474869171605
    },
    {
      "verse": "7:97",
      "similarity": 0.44435224628210473
    },
    {
      "verse": "30:8",
      "similarity": 0.3915055425027604
    },
    {
      "verse": "78:9",
      "similarity": 0.38177155781368527
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:42.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:42.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}