{
  "chapter": "الزمر",
  "text": "فاذا مس الانسن ضر دعانا ثم اذا خولنه نعمة منا قال انما اوتيته على علمۭ بل هى فتنة ولكن اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "When harm touches man he calls on Us. Then when We grant him a blessing from Us he says, 'I have only been given this because of my knowledge.' In fact it is a trial but most of them do not know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a man is in trouble, he prays to God; but when We bestow a favour on him he says: \"It has come to me through my acumen.\" In fact, this is an illusion, but most men do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When an affliction befalls man, he cries out to Us; but when We grant him a favour from Us, he says: “I have been granted this on account of my knowledge.” Nay; this (favour) is a test; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the human being is afflicted with hardship, he cries out to us for help. When We grant him a favor, he says, \"I knew that I deserved it.\" In fact, it is only a test for him, but most people do not know this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when some hardship reaches man, he prays to Us; then later when We bestow a favour upon him, he says, “I obtained this only because of some knowledge”; in fact it is a test, but most of them do not have any knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When harm touches man, he calls to Us (for help); then when We have changed it into a favor from Us, he says: \"Only because of knowledge I obtained it.\" Nay, it is only a trial, but most of them know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when harm afflicts a man he calls upon Us; then, when We give him a favor from Us, he says: I have been given it only by means of knowledge. Nay, it is a trial, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some affliction visits a man, he calls unto Us; then, when We confer on him a blessing from Us, he says, 'I was given it only because of a knowledge.' Nay, it is a trial, but most of them do not know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when hurt toucheth a man he crieth unto Us, and afterward when We have granted him a boon from Us, he saith: Only by force of knowledge I obtained it. Nay, but it is a test. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When affliction befalls man, he appeals to Us; but when We bestow a favour upon him he says, \"All this has been given to me because of my own knowledge.\" By no means! It is a trial: yet most of them do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When hurt toucheth a man he calleth on us, and thereafter, when We have changed it Unto a favour from Us, he saith: have been given itso only by force of my knowledge. Aye! it is a trial, but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When distress befalls man, he supplicates Us. Then, when We grant him a blessing from Us, he says, ‘I was given it by virtue of [my] knowledge.’ Indeed, it is a test, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, when trouble touches man, he cries to Us: But when We bestow a favour upon him as from Ourselves, he says, \"This has been given to me because of a certain knowledge (I have)!\" Nay, but this is but a trial, but most of them understand not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When harm touches man, he calls to Us (for help), then when We have (rescued him from that harm and) changed it into a favour from Us, he says: \"Only because of knowledge (that I possess) I obtained it.\" Nay, it is only a trial, but most of them know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When an affliction befalls a human he calls upon Us, but when We confer Our Favor on him, he says: 'I have only been given it on account of knowledge. 'Rather, it is but a trial, yet most do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When adversity touches the human being, he calls on Us. But then, when We favor him with a blessing from Us, he says, “I have attained this by virtue of my knowledge.” However, it is a test, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when adversity touches man, he calls upon Us; then when We bestow on him a favor from Us, he says, \"I have only been given it because of [my] knowledge.\" Rather, it is a trial, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:49] So when some distress befalls man (al-insān, here a generic), he supplicates Us. Then, when We bestow on him a grace from Us, he says, ‘I was given it merely by force of knowledge’, from God that I was deserving of it. Nay, but it, this saying, is a trial, a test by which servants are tested. But most of them do not know, that such bestowal [of grace] is a way of drawing [them] on and a test [of their faith].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Now when hurt) hardship (toucheth a man) the disbelieving man (he crieth unto Us) to remove the hardship from him, (and afterward when We have granted him) then when We have substituted it for him into (a boon from Us, he saith: Only by force of knowledge I obtained it) I obtained this wealth only because Allah knows I am righteous and good. (Nay, but it is a test) it is a trial and plot against them. (But most of them) all of them (know not) this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وعدم ثباته على العزيمة الخالصة نحو ربه فقال: { فَإِذَا مَسَّ ٱلإِنسَانَ ضُرٌّ } منَّا مؤلم مزعج إلى التوجه والتحنن إلينا { دَعَانَا } واستكشف عنَّا الضر على سبيل الإلحاح والاقتراح { ثُمَّ } بعد كشفنا عنه ضره { إِذَا خَوَّلْنَاهُ } أي: أعطيناه ووسعنا عليها { نِعْمَةً } تفضلاً { مِّنَّا } وتكريماً\n لنختبر كيف يشكر على دفع الضر وحصول النعمة بعده { قَالَ } حينئذ على سبيل الكفران: { إِنَّمَآ أُوتِيتُهُ } من النعم { عَلَىٰ عِلْمٍ } مني بوجوه كسبه وجمعه وأرباحه وأخذه\n\n\nأو المعنى: ما أوتيت وأعطيت بما أوتيت إلا سبب علمي بوجوه جمعه وتحصيله\n لا من حيث لا أحتسب\n هكذا يقول من الهذيانات الدالة على الكفران والطغيان\n مع أن نعمته ما هي إلى نعمة في نفسها { بَلْ هِيَ فِتْنَةٌ } ابتلاس منَّا إياه\n واختبار لننظر أيشكر أم يكفر؟ { وَلَـٰكِنَّ أَكْثَرَهُمْ لاَ يَعْلَمُونَ } [الزمر: 49] ولا يفهمون فتنتنا واختبارنا\n لذلك ينهمكون في بحر الكفران والطغيان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فإِذا مَسَّ الإِنسانَ } أي: جنسه { ضُرٌّ }: فقر أو غيره { دعانا } معرضاً عما سوانا\n والفاء لترتيب ما بعدها على ما قبلها\n من ذكر حالتي أهل الشرك القبيحتين\n وما بينهما اعتراض مؤكد للإنكار عليهم\n أي: إنهم يشمئزون عن ذكر الله وحده\n ويستبشرون بذكر الآلهة\n فإذا مسّهم الضر دعوا مَن اشمأزوا عن ذكره\n دون مَن استبشروا بذكره\n فناقضوا فعلهم\n فإن قلت: حق الاعتراض أن يؤكّد المعترَض بينه وبينه؟ قلت: ما في الاعتراض من دعاء الرسول صلى الله عليه وسلم ربه\n بأمر من الله\n وقوله: { أنت تحكم بين عبادك } \n ثم ما عقّبه من الوعد العظيم\n تأكيد لإنكار اشمئزازهم\n واستبشارهم\n ورجوعهم إلى الله في الشدائد\n دون آلهتهم\n كأنه قيل: قل: يا ربّ لا يحكم بيني وبين هؤلاء\n الذين يجترئون عليك مثل هذه الجراءة\n إلا أنت\n ثم هددهم بقوله: ولو أن لهؤلاء الظلمة ما في الأرض جميعاً لافتدوا به\n انظر النسفي\n { ثم إِذا خوَّلناه نعمةً منا }: أعطيناه إياها\n تفضُّلاً فإن التخويل مختص به\n لا يطلق على ما أعطى جزاء\n فإذا أعطيناه ذلك { قال إِنما أُوتيته } أي: ذلك التخويل أو الإنعام { على عِلْم } مني بوجوه كسبه\n كما قال قارون:\n[القصص: 78] أو: على علم مني بأني سأُعطاه\n لِما فيّ من فضل واستحقاق\n أو: على علم من الله تعالى باستحقاقي لذلك المال\n فتذكير الضمير إما لعوده على التخويل المأخوذ من { خولناه } \n أو: بتأويل النعمة بمعنى الإنعام\n أو: المراد بشيء من النعمة\n أو: يعود على \" ما \" إذا قلنا: موصولة\n لا كافة\n أي: إن الذي أوتيته على علم مني\n قال تعالى: { بل هي فتنةٌ } أي: ليس ما خوَّلناه نعمة بل هي محنة وابتلاء له ليظهر كفره أو شكره\n ولما كان الخبر مؤنثاً ساغ تأنيث المبتدأ لأجله\n وقرىء: \" بل هو فتنة \"\n { ولكنَّ أكْثَرَهُم لا يعلمون } أنَّ الأمر كذلك\n وأنَّ التخويل إنما كان فتنة\n وفيه دلالة على أن المراد بالإنسان الجنس",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:8",
      "similarity": 0.5477446630744917
    },
    {
      "verse": "6:94",
      "similarity": 0.36138165661813004
    },
    {
      "verse": "4:23",
      "similarity": 0.24366647308469744
    },
    {
      "verse": "30:33",
      "similarity": 0.22645860130068202
    },
    {
      "verse": "33:50",
      "similarity": 0.22606659495095424
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/39:49.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/39:49.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/39:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}