{
  "chapter": "الزمر",
  "text": "ام اتخذوا۟ من دون الله شفعاء قل اولو كانوا۟ لا يملكون شيـا ولا يعقلون",
  "translations": [
    {
      "translation": "Or have they adopted intercessors besides Allah? Say: 'Even though they do not control a thing and have no awareness?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they appointed intercessors other than God? Say: \"Even though they have no power in the least, nor do they understand?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken others instead of Allah as intercessors? Say: “Will they intercede though they may have no power and though they may not even understand?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they chosen intercessors besides God? Say, \"Would you choose them as your intercessors even though they do not possess anything and have no understanding?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Have they chosen intercessors against Allah? Proclaim, “What! Even if they do not own anything nor have any intelligence?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken as intercessors besides Allah Say: \"Even if they have power over nothing whatever and have no intelligence\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken intercessors besides Allah? Say: what! even though they did not ever have control over anything, nor do they understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What, even though they have no power whatever and no understanding?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or choose they intercessors other than Allah? Say: What! Even though they have power over nothing and have no intelligence?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken others for intercessors besides God? Say, \"Even though they have no power nor understanding?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken others for intercessors beside Allah! Say thou: What! even though they own not aught and understand not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken intercessors besides Allah? Say, ‘What! Even though they do not control anything, and cannot reason?!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do they take for intercessors others besides Allah? Say: \"Even if they have no power whatever and no intelligence?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken others as intercessors besides Allah? Say: \"Even if they have power over nothing whatever and have no intelligence?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they chosen, other than Allah, to intercede for them? Say: 'What, even though they have no power at all, nor understanding'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they chosen intercessors other than God? Say, “Even though they have no power over anything, and are devoid of reason?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess [power over] anything, nor do they reason?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:43] Or have they — nay, but [they have] — taken besides God, idols, as gods [to act as], intercessors?, with God, as they [are wont to] allege. Say, to them: ‘What!, will they intercede, even though they have no power whatever, of intercession or otherwise, and are unable to comprehend?’, that you worship them or [to comprehend] anything else [for that matter]? Nay.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمِ اتَّخَذُوا مِنْ دُونِ اللَّهِ شُفَعَاءَ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ (43) { أم } منقطعة وهي للاضراب الانتقالي انتقالاً من تشنيع إشراكهم إلى إبطال معاذيرهم في شركهم ، ذلك أنهم لما دمغتهم حجج القرآن باستحالة أن يكون لله شركاء تمحّلوا تأويلاً لشركهم فقالوا : { ما نعبدهم إلا ليقربونا إلى الله زُلفى } \\[ الزمر : 3 \\] كما حكي عنهم في أول هذه السورة ، فلما استُوفيَت الحججُ على إبطال الشرك أقبل هنا على إبطال تأويلهم منه ومعذرتهم . والاستفهام الذي تشعر به أم } في جميع مواقعها هو هنا للإِنكار بمعنى أن تأويلهم وعذرهم منكَر كما كان المعتذَر عنه منكراً فلم يقضوا بهذه المعذرة وطَراً . وقد تقدم في أول السورة بيان مرادهم بكونهم شفعاء .وأمر الله رسوله صلى الله عليه وسلم بأن يقول لهم مقالةً تقطع بهتانهم وهي { أولو كانوا لا يملكون شيئاً ولا يعقلون .فالواو في أولو كانوا } عاطفة كلام المجيب على كلامهم وهو من قبيل ما سُمّي بعطف التلقين في قوله تعالى : { قال ومن ذريتي } في سورة البقرة ( 124 ) ، ولك أن تجعل الواو للحال كما هو المختار في نظيره . وتقدم في قوله : { ولو افتدى به } في سورة آل عمران ( 91 ) . وصاحب الحال مقدر دل عليه ما قبله من قوله : اتخذوا من دون الله شفعاء . } والتقدير : أيشفعون لو كانوا لا يملكون شيئاً . والظاهر أن حكم تصدير الاستفهام قبل واو الحال كحكم تصديره قبل واو العطف .وأفاد تنكير { شيئاً } في سياق النفي عموم كل ما يُملك فيدخل في عمومه جميع أنواع الشفاعة . ولما كانت الشفاعة أمراً معنوياً كان معنى ملكها تحصيل إجابتها ، والكلام تهكم إذ كيف يشفع من لا يعقل فإنه لعدم عقله لا يتصور خطور معنى الشفاعة عنده فضلاً عن أن تتوجه إرادته إلى الاستشفاع فاتخاذهم شفعاء من الحماقة .\n\n",
      "translations": [
        {
          "translation": "(Or choose they) or do the disbelievers of Mecca worship (intercessors) deities in order that the latter intercede for them (other than Allah? Say) to them, Muhammad: (What! Even though they have power over nothing) what! Even though they have no power of intercession (and have no intelligence) nor know what intercession is? And if they do not know what intercession is, how are they going to intercede?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع قريش كمال قدرة الله\n واستقلاله بالتصرفات الواقعة في ملكه وملكوته حسب إرادته واختياره\n ينبغي لهم أن يوحدوه سبحانه\n ويتخذوه وكيلاً\n ويجعلوه حسيباً وكفيلاًن مع ذلك لم يتخذوه { أَمِ ٱتَّخَذُواْ } أي: بل اتخذوا من تلقاء أنفسهم { مِن دُونِ ٱللَّهِ } أولياء من الأصنام والأوثان\n وسموهم { شُفَعَآءَ } عنده سبحانه\n لذلك يعبدونهم كعبادته { قُلْ } لهم يا أكمل الرسل إلزاماً وتبكيتاً: { أَوَلَوْ كَـانُواْ } أي: أتتخذون الأصنام والأوثان شفعاء أيها الحمقى\n وتستشفعون منهم\n ولو كانوا { لاَ يَمْلِكُونَ شَيْئاً } من جلب النفع ودفع الضر { وَلاَ يَعْقِلُونَ } [الزمر: 43] ويدركون مقاصدهم أصلاً؟! وما هو إلا وهم باطل\n وخروج عن مقتضى العقل الفطري\n\n\n{ قُل } لهم يا أكمل الرسل بعدما لاح عندك غباوتهم وضلالهم على وجه العظة والتذكير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أَمِ اتخذوا } أي: قريش { من دون الله شفعاء } \n فيزعمون أن أصنامهم تشفع لهم عند الله\n أي: إنهم اتخذوا ـ على زعمهم ـ من دون الله شفعاء بحكمهم\n لا بتعريف من قِبل الله وإخبار\n فإن الله لا يقبل الشفاعة من أحد إلا بإذن منه\n وإن الذين يقولون ذلك افتراء على الله\n { قُل أَوَلَوْ كانوا لا يملكون شيئاً ولا يعقلون } \n الهمزة لإنكار الواقع واستقباحه\n والتوبيخ عليه\n أي: قل: أتتخذونهم شفعاء ولو كانوا لا يملكون شيئاً من الأشياء ولا يعقلون شيئاً\n فضلاً عن أن يملكوا الشفاعة عند الله تعالى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:86",
      "similarity": 0.6111488265025997
    },
    {
      "verse": "26:100",
      "similarity": 0.5686781270760234
    },
    {
      "verse": "30:13",
      "similarity": 0.5343705129476664
    },
    {
      "verse": "19:87",
      "similarity": 0.5334855007489175
    },
    {
      "verse": "39:44",
      "similarity": 0.5314711628812715
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}