{
  "chapter": "الزمر",
  "text": "ام اتخذوا۟ من دون الله شفعاء قل اولو كانوا۟ لا يملكون شيـا ولا يعقلون",
  "translations": [
    {
      "translation": "Have they appointed intercessors other than God? Say: \"Even though they have no power in the least, nor do they understand?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken others instead of Allah as intercessors? Say: “Will they intercede though they may have no power and though they may not even understand?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they chosen intercessors besides God? Say, \"Would you choose them as your intercessors even though they do not possess anything and have no understanding?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Have they chosen intercessors against Allah? Proclaim, “What! Even if they do not own anything nor have any intelligence?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken as intercessors besides Allah Say: \"Even if they have power over nothing whatever and have no intelligence\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken intercessors besides Allah? Say: what! even though they did not ever have control over anything, nor do they understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What, even though they have no power whatever and no understanding?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or choose they intercessors other than Allah? Say: What! Even though they have power over nothing and have no intelligence?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken others for intercessors besides God? Say, \"Even though they have no power nor understanding?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken others for intercessors beside Allah! Say thou: What! even though they own not aught and understand not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken intercessors besides Allah? Say, ‘What! Even though they do not control anything, and cannot reason?!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do they take for intercessors others besides Allah? Say: \"Even if they have no power whatever and no intelligence?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken others as intercessors besides Allah? Say: \"Even if they have power over nothing whatever and have no intelligence?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they chosen, other than Allah, to intercede for them? Say: 'What, even though they have no power at all, nor understanding'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they chosen intercessors other than God? Say, “Even though they have no power over anything, and are devoid of reason?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess [power over] anything, nor do they reason?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:43] Or have they — nay, but [they have] — taken besides God, idols, as gods [to act as], intercessors?, with God, as they [are wont to] allege. Say, to them: ‘What!, will they intercede, even though they have no power whatever, of intercession or otherwise, and are unable to comprehend?’, that you worship them or [to comprehend] anything else [for that matter]? Nay.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or choose they) or do the disbelievers of Mecca worship (intercessors) deities in order that the latter intercede for them (other than Allah? Say) to them, Muhammad: (What! Even though they have power over nothing) what! Even though they have no power of intercession (and have no intelligence) nor know what intercession is? And if they do not know what intercession is, how are they going to intercede?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع قريش كمال قدرة الله، واستقلاله بالتصرفات الواقعة في ملكه وملكوته حسب إرادته واختياره، ينبغي لهم أن يوحدوه سبحانه، ويتخذوه وكيلاً، ويجعلوه حسيباً وكفيلاًن مع ذلك لم يتخذوه { أَمِ ٱتَّخَذُواْ } أي: بل اتخذوا من تلقاء أنفسهم { مِن دُونِ ٱللَّهِ } أولياء من الأصنام والأوثان، وسموهم { شُفَعَآءَ } عنده سبحانه، لذلك يعبدونهم كعبادته { قُلْ } لهم يا أكمل الرسل إلزاماً وتبكيتاً: { أَوَلَوْ كَـانُواْ } أي: أتتخذون الأصنام والأوثان شفعاء أيها الحمقى، وتستشفعون منهم، ولو كانوا { لاَ يَمْلِكُونَ شَيْئاً } من جلب النفع ودفع الضر { وَلاَ يَعْقِلُونَ } [الزمر: 43] ويدركون مقاصدهم أصلاً؟! وما هو إلا وهم باطل، وخروج عن مقتضى العقل الفطري\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}