{
  "chapter": "الزمر",
  "text": "قل لله الشفعة جميعا له ملك السموت والارض ثم اليه ترجعون",
  "translations": [
    {
      "translation": "Say: \"God's is the intercession entirely; His is the kingdom of the heavens and the earth; then to Him you will return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “All intercession lies with Allah. His is the dominion of the heavens and the earth. And to Him will all of you be sent back.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Intercession belongs to God. To Him belongs the heavens and the earth and to Him you will all return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “To Allah only* belongs all the intercession! For Him only is the kingship of the heavens and the earth; and then it is towards you have to return.” (*Allah does not intercede – He gives the permission to intercede with Him, to whomever He wills.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"To Allah belongs all intercession. His is the sovereignty of the heavens and the earth. Then to Him you shall be brought back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Allah's is the intercession altogether; His is the kingdom of the heavens and the earth, then to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'To God belongs intercession altogether. His is the kingdom of the heavens and the earth; then unto Him you will be returned.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Unto Allah belongeth all intercession. His is the Sovereignty of the heavens and the earth. And afterward unto Him ye will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Intercession is entirely in the hands of God. He controls the heavens and the earth; you will all return to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: Allah's is intercession altogether. His is the dominion of the heavens and the earth; then Unto Him shall ye be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘All intercession rests with Allah. To Him belongs the kingdom of the heavens and the earth; then you will be brought back to Him.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"To Allah belongs exclusively (the right to grant) intercession: to Him belongs the dominion of the heavens and the earth: In the End, it is to Him that ye shall be brought back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"To Allah belongs all intercession. His is the Sovereignty of the heavens and the earth, then to Him you shall be brought back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Intercession belongs altogether to Allah. His is the Kingdom of the heavens and the earth. To Him you shall be returned'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “All intercession is up to God. To Him belongs the kingdom of the heavens and the earth. Then to Him you will be returned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"To Allah belongs [the right to allow] intercession entirely. To Him belongs the dominion of the heavens and the earth. Then to Him you will be returned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:44] Say: ‘All intercession belongs [solely] to God, that is to say, He has exclusive control over it, and so none can intercede except with His permission. To Him belongs the kingdom of the heavens and the earth; then to Him you will be brought back’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: Unto Allah belongeth all intercession) intercession is in the Hands of Allah on the Day of Judgement. (His is the Sovereignty) the stores (of the heavens) rain (and the earth) vegetation. (And afterward unto Him ye will be brought back) in the Hereafter and will reward each according to his works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } لهم يا أكمل الرسل بعدما لاح عندك غباوتهم وضلالهم على وجه العظة والتذكير؛ لعلهم يتنبهوا: { لِلَّهِ ٱلشَّفَاعَةُ جَمِيعاً } أي: مطلق الشفاعة، مختصة لله، مستندة إليه أصالة، كائنة من عنده، لا يسع لأحد من أهل العناية أن يشفع لمجرم عنده سبحانه إلا بإذنه، وكيف لا يكون كذلك؛ إذ { لَّهُ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: ماظهر من العلويات والسفليات، وما بينهما من الممتزجات، بلا تصرف فيها بالاستقلال والاختيار، بلا مزاحمة أنداد وأغيار { ثُمَّ } لو وقعت شفاعة من أحد ممن أذن له الرحمن، ورضي له قولاً، فإنما هي أيضاً آيل إليه سبحانه؛ إذ { إِلَيْهِ } لا إلى غيره من العكوس والأظلال { تُرْجَعُونَ } [الزمر: 44] رجع الأضواء إلى الشمس\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}