{
  "chapter": "الزمر",
  "text": "واذا ذكر الله وحده اشمازت قلوب الذين لا يؤمنون بالءاخرة واذا ذكر الذين من دونه اذا هم يستبشرون",
  "translations": [
    {
      "translation": "When Allah is mentioned on His own, the hearts of those who do not believe in the akhira shrink back shuddering, but when others apart from Him are mentioned, they jump for joy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God alone is mentioned the hearts of those who do not believe in the life to come, are filled with resentment. But when others are mentioned apart from God, they begin to rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah alone is mentioned, the hearts of those who do not believe in the Hereafter contract with bitterness, but when deities apart from Allah are mentioned, they are filled with joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When one God is mentioned, the hearts of those who do not believe in the Day of Judgment begin to shrink, but when the idols are mentioned, they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah the One God is mentioned, the hearts of those who do not believe in the Hereafter get constricted; and when others (false deities) besides Him are mentioned, they rejoice!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah Alone is mentioned, the hearts of those who believe not in the Hereafter are filled with disgust and when those besides Him are mentioned, behold, they rejoice!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah alone is mentioned, the hearts of those who do not believe in the hereafter shrink, and when those besides Him are mentioned, lo! they are joyful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God is mentioned alone, then shudder the hearts of those who believe not in the Hereafter, but when those apart from Him are mentioned behold, they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah alone is mentioned, the hearts of those who believe not in the Hereafter are repelled, and when those (whom they worship) beside Him are mentioned, behold! they are glad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God alone is named, the hearts of those who do not believe in the Hereafter shrink with aversion, but when others are named instead of Him, they are filled with joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah alone is mentioned, then shrink with eversion the hearts of those who believe not in the Hereafter, and when those beside Him are mentioned, lo! they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah is mentioned alone, [thereat] shrink away the hearts of those who do not believe in the Hereafter, but when others are mentioned besides Him, behold, they rejoice!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah, the One and Only, is mentioned, the hearts of those who believe not in the Hereafter are filled with disgust and horror; but when (gods) other than He are mentioned, behold, they are filled with joy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah Alone is mentioned, the hearts of those who believe not in the Hereafter are filled with disgust (from the Oneness of Allah and when those (whom they obey or worship) besides Him [like all false deities other than Allah, it may be a Messenger like 'Iesa (Jesus) - son of Maryam (Mary), 'Uzair (Ezra), an angel, a pious man, a jinn, or any other creature even idols, graves of religious people, saints, priests, monks, etc.] are mentioned, behold, they rejoice!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah is mentioned alone, the hearts of those who do not believe in the Everlasting Life shrink in aversion. But when those, other than Him, are mentioned, see, they are filled with glad tidings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God alone is mentioned, the hearts of those who do not believe in the Hereafter shrink with resentment. But when those other than Him are mentioned, they become filled with joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah is mentioned alone, the hearts of those who do not believe in the Hereafter shrink with aversion, but when those [worshipped] other than Him are mentioned, immediately they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:45] And when God is mentioned alone, that is, without [the mention of] their gods, thereat shrink, they are repelled and they become constricted, the hearts of those who do not believe in the Hereafter; but when   those [others] besides Him, namely, the idols, are mentioned, behold, they rejoice!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Allah alone is mentioned) when it is said to them say: there is no deity except Allah, (the hearts of those who believe not in the Hereafter) in resurrection after death (are repelled, and when those (whom they worship) beside Him) i.e. al-Lat, al-'Uzza and Manat (are mentioned, behold! they are glad) for the mention of their deities.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱشْمَأَزَّتْ } معناه نَفَرَتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - exalted be He - {ishma'azza't} means that she (the camel) has given birth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة قساوة المشركين وجهلهم بالله { إِذَا ذُكِرَ ٱللَّهُ } الواحد الأحد الصمد المستقل بالألوهية والربوبية { وَحْدَهُ } على ما كان بلا مشاركة أحد معه في الثبوت والوجود { ٱشْمَأَزَّتْ } أي: انقبضت وضاقت { قُلُوبُ ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } بالانكشاف التام في النشأة الأخرى\n والمفني لأظلال السوى والعكوس مطلقاً { وَإِذَا ذُكِرَ } آلهتهم { ٱلَّذِينَ } يدعونهم { مِن دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ } [الزمر: 45] أي: فاجؤوا عند ذكر آلهتهم إلى البسط والاستبشار\n\n\n{ قُلِ } يا أكمل الرسل عند يأسك عنهم وعن إيمانهم وتنبههم\n مسترجعاً إلى ربك\n مفوضاً أمور عباده إليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" وحده \": منصوب عند سيبويه\n على المصدر\n وعند الفراء: على الحال\n والظاهر: أنه أطلق المصدر على اسمه\n  يقول الحق جلّ جلاله: { وإِذا ذُكِرَ اللهُ وَحْدَهُ } أي: إذا أُفرد الله بالذكر\n ولم تُذكر معه آلهتهم\n فمدار المعنى على قوله: { وحده } \n { اشْمَأَزَّتْ قلوبُ الذين لا يؤمنون بالآخرة } أي: انقبضت ونفرت\n كقوله:\n[الإسراء: 46]\n { وإِذا ذُكر الذين مِن دونه } يعني: آلهتهم\n ذُكر اللهُ معهم\n أو لم يُذكر\n { إِذا هم يستبشرون } لفرط افتتانهم بها\n ونسيانهم ذكر الله\n أو: وإذا قيل لهم: لا إله إلا الله وحده لا شريك له\n نفروا لأن فيه نفياً لآلهتهم\n وقال الورتجبي: صورة الآية وقعت على الجاحدين والمتكبرين\n الذين ليس في محبتهم إلا متابعة الأشكال والأمثال\n من حيث التشبيه والخيال لأن قلوبهم خلقت على مشاكلة الأضداد والأنداد\n ولم يكن في قلوبهم سجية أهل المعرفة بالله\n فإذا سَمِعُوا ذِكْر مَن لا يدخل في الخيال والمثال انقبضت قلوبهم وصدورهم\n ونفرت\n وإذا سمعوا ذكر غير الله من الصور والأشباح\n سكنت نفوسهم إليها من غاية غباوتهم\n وكمال جهالتهم\n فهم مثل الصبيان\n إذ هم يفرحون بالأفراس الطينية والأُسد الخشبية\n ولا يطيقون أن ينظروا إلى عَدْوِ العاديات\n وإلى الضراغم الباديات\n\n\n هـ\n مختصراً\n ولقد بالغ في بيان حالتيهم المتقابلتين حيث ذكر الغاية فيهما\n فإن الاستبشار: هو أن يمتلىء القلب سروراً\n حتى تنبسط له بشرة الوجه وتتهلل\n والاشمئزاز: أن يمتلىء القلب غيظاً وغمّاً\n حتى ينقبض منه أديم الوجه\n فتظهر عليه الكآبة والحزن\n والعامل في { إِذا } الأولى: \" اشمأزت \" \n وفي الثانية: ما هو العامل في \" إذا \" الفجائية\n والتقدير: وقت ذكر الذين من دونه فاجأوا وقت الاستبشار\n ثم أمر نبيه بالالتجاء إليه حين إدبارهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:22",
      "similarity": 0.053757022460272946
    },
    {
      "verse": "54:24",
      "similarity": 0.045932236237122157
    },
    {
      "verse": "2:213",
      "similarity": 0.04477926481666178
    },
    {
      "verse": "18:110",
      "similarity": 0.04358366742463357
    },
    {
      "verse": "41:6",
      "similarity": 0.04257804830615836
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}