{
  "chapter": "الزمر",
  "text": "خلق السموت والارض بالحق يكور اليل على النهار ويكور النهار على اليل وسخر الشمس والقمر كل يجرى لاجل مسمى الا هو العزيز الغفر",
  "translations": [
    {
      "translation": "He created the heavens and the earth with truth. He wraps the night around the day and wraps the day around the night, and has made the sun and moon subservient, each one running for a specified term. Is He not indeed the Almighty, the Endlessly Forgiving?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with precision. He folds the day up over the night, and folds the night up over the day. He has subjugated the sun and moon, (so that) each runs its appointed course. Is He not all-mighty and forgiving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with Truth, and He folds up the day over the night and folds up the night over the day. He has subjected the sun and the moon, each is running its course until an appointed time. Lo, He is the Most Mighty, the Most Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth for a genuine purpose. He covers the night with the day and the day with the night and has subdued the sun and the moon, each of which floats for an appointed time. God is certainly Majestic and All-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created the heavens and the earth with the truth; He envelops the night over day and envelops the day over night, and He has subjected the sun and the moon; each one runs for its appointed term; pay heed! He only is the Most Honourable, the Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with truth. He makes the night to go in the day and makes the day to go in the night. And He has subjected the sun and the moon. Each running for an appointed term. Verily, He is the Almighty, the Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with the truth; He makes the night cover the day and makes the day overtake the night, and He has made the sun and the moon subservient; each one runs on to an assigned term; now surely He is the Mighty, the great Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth in truth, wrapping night about the day, and wrapping the day about the night; and He has subjected the sun and the moon, each of them running to a stated term. Is not He the All-mighty, the All-forgiving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens and the earth with truth. He maketh night to succeed day, and He maketh day to succeed night, and He constraineth the sun and the moon to give service, each running on for an appointed term. Is not He the Mighty, the Forgiver?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth for a true purpose; He causes the night to succeed the day and the day to succeed the night; He has subjected the sun and moon, so that they run their courses for an appointed time; He is truly the Mighty, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens and the earth with truth. He rolleth the night around the day, and rolleth the day around the night, and He hath subjected the sun and the moon: each running on for a term appointed! Lo! He is the Mighty, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with consummate wisdom. He winds the night over the day, and winds the day over the night, and He has disposed the sun and the moon, each moving for a specified term. Indeed, He is the All-mighty, the All-forgiver!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth in true (proportions): He makes the Night overlap the Day, and the Day overlap the Night: He has subjected the sun and the moon (to His law): Each one follows a course for a time appointed. Is not He the Exalted in Power - He Who forgives again and again?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with truth. He makes the night to go in the day and makes the day to go in the night. And He has subjected the sun and the moon. Each running (on a fixed course) for an appointed term. Verily, He is the All-Mighty, the Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth in truth, wrapping the night about the day and wrapping the day about the night, He has subjected the sun and the mooneach to run for a stated term. Is He not the Almighty, the Forgiving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with reason. He wraps the night around the day, and He wraps the day around the night. And He regulates the sun and the moon, each running along a specific course. He is indeed the Almighty, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:5]   He created the heavens and the earth with the truth (bi’l-haqqi is semantically connected to khalaqa, ‘He created’). He turns the night into day, so that it grows, and turns the day into night, so that it grows, and He has disposed the sun and the moon, each running, in its course, for an appointed term, until the Day of Resurrection. Verily it is He Who is the Mighty, Whose way [always] prevails, Requiter of His enemies, the [ever] Forgiving, of His friends.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He hath created the heavens and the earth with truth) not in vain. (He maketh night to succeed day) He reduces the night such that the day is longer than the night, (and He maketh day to succeed night) and prolongs the night such that the night is longer than the day, (and He constraineth the sun and the moon to give service) and He makes the sun and moon subservient to the Children of Adam, (each) i.e. the sun and the moon, the day and night (running on for an appointed term) for an appointed time. (Is not He the Mighty) He Who does this is the Mighty in retribution against those who disbelieve in Him, (the Forgiver) of those who believe in Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد الواسطي عن زيد بن علي عليهما السَّلامُ في قولهِ تعالى: { يُكَوِّرُ ٱللَّيْـلَ عَلَى ٱلنَّهَـارِ } معناه يَدخُلُهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبمقتضى توحيده سبحانه وقهره، وإظهار كمالات المندمجة في وحدة ذاته باعتبار شئونه وتطوراته اللازمة للحي الأزلي الأبدي { خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: قدر وأعد الأسماء الذاتية الفعالى، المنعكسة من شئونه الذاتية والأوصاف القابلة المنفعلة من تلك الأسماء المظهرة لآثارها ملتبساً { بِٱلْحَقِّ } المطابق للواقع، ولا ينبغي أن يرتاب فيه أحد بعدما انكشف بسرائر الوجود والتوحيد حسب الود الإلهي، وبمقتضى هذا الازدواج المعنوي الجاري بين الأوصاف والأسماء الإلهية { يُكَوِّرُ ٱللَّيْـلَ عَلَى ٱلنَّهَـارِ وَيُكَوِّرُ ٱلنَّـهَارَ عَلَى ٱللَّيْلِ } أي: يغشي ويغيب سبحانه على وجه التلفيف والتخليط أضواء الأسماء والصفات بظلام الهيولي والتعينات في النشأة الأولى، فكذلك يغطي ويغيب في النشأة الأخرى حجب الطبائع وأظلال الهويات بأشعة أنوار الذات المنتشئة منها، بمقتضى الشئون والتطورات المثبتة للأسماء والصفات الإلهية\n\n\n\n\n{ وَ } بعدما كمل أمر الظهور والإظهار، وانبسط على عروش ما ظهر وبطن بالاستيلاء والاستقلال { سَخَّـرَ ٱلشَّمْسَ } أي: جذب وقبض نحوه سبحانه بمقتضى الجاذبة المعنوية الحبية الكاملة الوجود المطلق، الفائض على هياكل الموجودات المنعكسة من الأسماء والصفات الإلهية { وَٱلْقَمَرَ } أي: الهويات القابلة لانعكاس شمس الذات المستخلفة عنها، إظهاراً لكمال قدرته ومتانة حكمته؛ لذلك { كُـلٌّ } من كل أهل العناية { يَجْرِي } يكون ويدوم في مكانه ومكانته من التعينات موقوف { لأَجَـلٍ مُّسَـمًّى } أي: إلى حلول أجل معين مقدر من عند ربه بمقتضى جذبه وعنايته، فإذا حل الأجل، انقطع الجري والسير وارتفع السلوك\n\n\n\n\n{ أَلا } أي تنبهوا أيها الأظلال الهالكة في شمس الذات { هُوَ } أي: الموصوف بهذه الصفات الكاملة { ٱلْعَزِيزُ } المنيع ساحة عز ذاته عن أن يحوم حول سرادقات عزه وجلاله بإدراك العقول المتحيرة والأوهام المدهوشة، لكنه { ٱلْغَفَّارُ } [الزمر: 5] الستَّار لغيوم تعيناتكم بإشراق شمس الذات، وانقهار جميع ما لمع عليه نور الوجود على مقتضى جلاله وتفرده في نعوت كماله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { خلق السماواتِ والأرضَ } أي: وما بينهما من الموجودات، ملتبسة { بالحق } مشتملة على الحكم والمصالح الدينية والدنيوية { يُكوِّر الليلَ على النهار ويُكوِّر النهارَ على الليل } ، التكوير: اللّف والليّ، يقال: كار العمامة على رأسه وكوّرها\n والمعنى: أن كل واحد منهما يغيّب الآخر إذا طرأ عليه، ويلفه لف اللباس باللابس، أو: يغيّبه كما يغيب الملفوف باللفافة، أو: يجعله كاراً عليه كرُوراً متتابعاً، تتابع أكوار العمامة، وهذا بيان لكيفية تصرفه تعالى في السموات والأرض بعد بيان خلقهما، وعبّر بالمضارع للدلالة على التجرُّد\n { وسخَّر الشمسَ والقمرَ }: جعلهما منقادين لأمره\n { كُلٌّ يجري لأَجَلٍ مُسمًّى } ، وهو يوم القيامة، أو: كل منهما يجري لمنتهى دورته، { أَلاَ هو العزيزُ } الغالب القادر على كل شيء، ومن جملتها: عقاب العصاة، { الغفارُ }: المبالغ في المغفرة، ولذلك لا يُعاجل بالعقوبة، ولا يمنع ما في هذه الصنائع البديعة من آثار رحمته\n وتصدير الجملة بحرف التنبيه، لإظهار كمال الاعتناء بمضمونها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:1",
      "similarity": 0.8488699556989737
    },
    {
      "verse": "31:29",
      "similarity": 0.31803054631983907
    },
    {
      "verse": "16:12",
      "similarity": 0.257031762012436
    },
    {
      "verse": "14:33",
      "similarity": 0.2410052125199476
    },
    {
      "verse": "29:61",
      "similarity": 0.23818334916769515
    }
  ]
}