{
  "chapter": "الزمر",
  "text": "قل يعبادى الذين اسرفوا۟ على انفسهم لا تقنطوا۟ من رحمة الله ان الله يغفر الذنوب جميعا انه هو الغفور الرحيم",
  "translations": [
    {
      "translation": "Say: 'My slaves, you who have transgressed against yourselves, do not despair of the mercy of Allah. Truly Allah forgives all wrong actions. He is the Ever-Forgiving, the Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O creatures of God, those of you who have acted against your own interests should not be disheartened of the mercy of God. Surely God forgives all sins. He is all-forgiving and all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “My servants who have committed excesses against themselves, do not despair of Allah's Mercy. Surely Allah forgives all sins. He is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell my servants who have committed injustice to themselves, \"Do not despair of the mercy of God. God certainly forgives all sins. He is All-forgiving and All-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “O my* slaves, who have wronged themselves, do not lose hope in Allah’s mercy; indeed Allah forgives all sins; indeed He only is the Oft Forgiving, the Most Merciful.” (All Muslims are truly the slaves of Prophet Mohammed – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O My servants who have transgressed against themselves! Despair not of the mercy of Allah, verily, Allah forgives all sins. Truly, He is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O my servants! who have acted extravagantly against their own souls, do not despair of the mercy of Allah; surely Allah forgives the faults altogether; surely He is the Forgiving the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O my people who have been prodigal against yourselves, do not despair of God's mercy; surely God forgives sins altogether; surely He is the All-forgiving, the All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O My slaves who have been prodigal to their own hurt! Despair not of the mercy of Allah, Who forgiveth all sins. Lo! He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [God says] \"O My servants, who have committed excesses against their own souls, do not despair of God's mercy, for God surely forgives all sins. He is truly the Most Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: my bondmen who have committed extravagance against themselves despair not of the mercy of Allah; verily Allah will forgive the sins altogether. Verily He! He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say [that Allah declares,] ‘O My servants who have committed excesses against their own souls, do not despair of the mercy of Allah. Indeed Allah will forgive all sins. Indeed, He is the All-forgiving, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my Servants who have transgressed against their souls! Despair not of the Mercy of Allah: for Allah forgives all sins: for He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)! Despair not of the Mercy of Allah, verily Allah forgives all sins. Truly, He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O My worshipers, who have sinned excessively against themselves, do not despair of the Mercy of Allah, surely, Allah forgives all sins. He is theForgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O My servants who have transgressed against themselves: do not despair of God’s mercy, for God forgives all sins. He is indeed the Forgiver, the Clement.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:53] Say [that God declares]: ‘O My servants who have been prodigal against their own souls, do not despair (read taqnitū, taqnatū, or taqnutū), do not give up hope, of God’s mercy. Truly God forgives all sins, for those who repent from idolatry. Truly He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ (53)أُطنبتْ آيات الوعيد بأفنانها السابقة إطناباً يبلغ من نفوس سامعيها أيَّ مبلغ من الرعب والخوف ، على رغْممِ تظاهرهم بقلة الاهتمام بها . وقد يبلغ بهم وقعها مبلغَ اليأس من سَعيٍ ينجيهم من وعيدها ، فأعقبها الله ببعث الرجاء في نفوسهم للخروج إلى ساحل النجاة إذا أرادوها على عادة هذا الكتاب المجيد من مداواة النفوس بمزيج الترغيب والترهيب .والكلام استئناف بياني لأن الزواجر السابقة تثير في نفوس المواجَهين بها خاطر التساؤل عن مسالك النجاة فتتلاحم فيها الخواطر الملَكية والخواطر الشيطانية إلى أن يُرسي التلاحم على انتصار إحدى الطائفتين ، فكان في إنارة السبيل لها ما يسهل خطو الحائرين في ظلمات الشك ويرتفق بها ويواسيها بعد أن أثخنتها جروح التوبيخ والزجر والوعيد ويضمد تلك الجراحة والحليمُ يزجُر ويلين وتثير في نفس النبي صلى الله عليه وسلم خشيةَ أن يحيط غضب الله بالذين دعاهم إليه فأعرضوا أو حببهم في الحق فأبغضوا فلعله لا يَفتح لهم باب التوبة ولا تقبل منهم بعد إعراضهم أوْبَة ولاسيما بعد أن أمره بتفويض الأمر إلى حكمه المشتَمِّ منه ترقبُ قطع الجدال وفصمِه فكان أمره لرسوله صلى الله عليه وسلم بأن يناديهم بهذه الدعوة تنفيساً عليه وتفتيحاً لباب الأوْبة إليه فهذا كلام ينحل إلى استئنافين فجملة { قُل } استئناف لبيان ما ترقَّبَه أفضلُ النبيئين صلى الله عليه وسلم أي بلغ عني هذا القول .وجملةُ { ياعبادي } استئناف ابتدائي من خطاب الله لهم . وابتداء الخطاب بالنداء وعنواننِ العباد مؤذن بأن ما بعده إعداد للقبول وإطماع في النجاة .والخطاب بعنوان { ياعبادي } مراد به المشركون ابتداءً بدليل قوله : { وأسلموا له من قبل أن يأتيكم العذاب } \\[ الزمر : 54 \\] وقوله : { وإن كنت لمن الساخرين } \\[ الزمر : 56 \\] وقوله : { بلى قد جاءتك آياتي فكذبت بها واستكبرت وكنت من الكافرين } \\[ الزمر : 59 \\] . فهذا الخطاب جرى على غير الغالب في مثله في عادة القرآن عند ذكر { عبادي } بالإِضافة إلى ضمير المتكلم تعالى .وفي «صحيح البخاري» عن ابن عباس «أن ناساً من أهل الشرك كانوا قد قَتلوا وأَكثروا ، وزنَوا وأكثروا ، فأتوا محمداً صلى الله عليه وسلم فقالوا : إن الذي تقول وتدعو إليه لحسن لو تخبرُنا أَن لما عملنا كفارة يعني وقد سمعوا آيات الوعيد لمن يعمل تلك الأعمال وإلا فمن أين علموا أن تلك الأعمال جرائم وهم في جاهلية فنزل : { والذين لا يدعون مع الله إلاهاً آخر ولا يقتلون النفس التي حرم اللَّه إلا بالحق ولا يزنون } \\[ الفرقان : 68 \\] يعني إلى قوله : { إلا من تاب وآمن وعمل عملاً صالحاً } \\[ الفرقان : 70 \\] ونزل : { قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة اللَّه } .وقد رويت أحاديث عدة في سبب نزول هذه الآية غير حديث البخاري وهي بين ضعيف ومجهول ويستخلص من مجموعها أنها جزئيات لعموم الآية وأن الآية عامة لخطاب جميع المشركين وقد أشرنا إليها في ديباجة تفسير السورة .ومن أجمل الأخبار المروية فيها ما رواه ابن إسحاق عن نافع عن ابن عمر عن عمر قال : «لما اجتمعنا على الهجرة اتَّعدتُ أنا وهشامُ بن العاص السهمي ، وعيّاش بن أبي ربيعة بن عتبة . فقلنا : الموعد أَضَاةُ بني غِفَار ، وقلنا : من تأخّرَ منّا فقد حُبس فليمضضِ صاحباه . فأصبحتُ أنا وعياش بن عتبة وحُبس عنا هشام وإذا هو قد فُتِن فافتَتَنَ فكنا نقول بالمدينة : هؤلاء قد عَرفوا الله ثم افتتنوا لبلاء لحقهم لا نرى لهم توبة . وكانوا هم يقولون هذا في أنفسهم ، فأنزل الله : { قل ياعبادي الذين أسرفوا } إلى قوله : { مَثْوى للمتكبرين } \\[ الزمر : 60 \\] قال عمر فكتبتها بيدي ثم بعثتها إلى هشام . قال هشام : فلما قدمتْ عليَّ خرجتُ بها إلى ذي طوَى فقلت : اللهم فهِّمنيها فعرفت أنها نزلت فينا فرجعتُ فجلست على بعيري فلحقت برسول الله ا ه . فقول عمر : فأنزل الله يريد أنه سمعه بعد أن هاجر وأنه مما نزل بمكة فلم يسمعه عمر إذ كان في شاغل تهيئة الهجرة فما سمعها إلا وهو بالمدينة فإن عمر هاجر إلى المدينة قبل النبي .فالخطاب بقوله : ياعبادي الذين أسرفوا على أنفسهم } تمهيد بإجمال يأتي بيانه في الآيات بعده من قوله : { وأنيبوا إلى ربكم } \\[ الزمر : 54 \\] . وبعد هذا فعموم عبادي وعموم صلة الذين أسرفوا } يشمل أهل المعاصي من المسلمين وإن كان المقصود الأصلي من الخطاب المشركين على عادة الكلام البليغ من كثرة المقاصد والمعاني التي تفرغ في قوالب تسعُها .وقرأ الجمهور { ياعبادي الذين أسرفوا } بفتح ياء المتكلم ، وقرأه أبو عمرو وحمزة والكسائي ويعقوب بإسكان الياء . ولعل وجه ثبوت الياء في هذه الآية دون نظيرها وهو قوله تعالى : { قل يا عبادي الذين آمنوا اتقوا ربكم } \\[ الزمر : 10 \\] ، أن الخطاب هنا للذين أسرفوا وفي مقدمتهم المشركون وكلهم مظنة تطرق اليأس من رحمة الله إلى نفوسهم ، فكان إثبات ( يا ) المتكلم في خطابهم زيادة تصريح بعلامة التكلُّم تقوية لنسبة عبوديتهم إلى الله تعالى إيماء إلى أن شأن الرب الرحمة بعباده .والإِسراف : الإِكثار . والمراد به هنا الإِسراف في الذنوب والمعاصي ، وتقدم ذكر الإِسراف في قوله تعالى : { ولا تأكلوها إسرافاً } في سورة \\[ النساء : 6 \\] وقوله : { فلا يسرف في القتل } في سورة \\[ الإسراء : 33 \\] . والأكثر أن يعدّى إلى متعلِّقه بحرف { مِن } ، وتعديتُه هنا ب ( على ) لأن الإِكثار هنا من أعماللٍ تتحملها النفس وتثقل بها وذلك متعارف في التبِعات والعدوان تقول : أكثرت على فلان ، فمعنى { أسرفوا على أنفسهم } : أنهم جلبوا لأنفسهم ما تثقلهم تبعته ليشمل ما اقترفوه من شرك وسيئات .والقنوط : اليأس ، وتقدم في قوله : { فلا تكن من القانطين } في سورة \\[ الحِجر : 55 \\] .وجملة { إن الله يغفر الذنوب جميعاً } تعليل للنهي عن اليأس من رحمة الله .ومادة الغفر ترجع إلى الستر ، وهو يقتضي وجود المستور واحتياجَه للستر فدل { يغْفِرُ الذُّنوب } على أن الذنوب ثابتة ، أي المؤاخذة بها ثابتة والله يغفرها ، أي يزيل المؤاخذة بها ، وهذه المغفرة تقتضي أسباباً أُجملت هنا وفصلت في دلائل أخرى من الكتاب والسنة منها قوله تعالى : { وإني لغفار لمن تاب وآمن وعمل صالحاً ثم اهتدى } \\[ طه : 82 \\] ، وتلك الدلائل يجمعها أن للغفران أسباباً تطرأ على المذنب ولولا ذلك لكانت المؤاخذة بالذنوب عبثاً ينزه عنه الحكيم تعالى ، كيف وقد سماها ذنوباً وتوعد عليها فكان قوله : { إن الله يغفر الذنوب } دعوةً إلى تطلب أسباب هذه المغفرة فإذا طلبها المذنب عرف تفصيلها . و { جميعاً } حال من { الذنوب } ، أي حال جميعها ، أي عمومها ، فيغفر كل ذنب منها إن حصلت من المذنب أسباب ذلك . وسيأتي الكلام على كلمة ( جميع ) عند قوله تعالى : { والأرض جميعاً قبضته } في هذه السورة \\[ 67 \\] .وجملة { إنه هو الغفور الرحيم } تعليل لجملة { يغفر الذنوب جميعاً } أي لا يُعجزه أن يغفر جميع الذنوب ما بلغ جميعها من الكثرة لأنه شديد الغفران شديد الرحمة . فبطل بهذه الآية قول المرجئة إنه لا يضر مع الإِيمان شيء .\n\n",
      "translations": [
        {
          "translation": "(Say: My slaves who have been prodigal to their own hurt) through disbelief, idolatry, adultery and murder! (Despair not of the mercy of Allah) despair not of Allah's forgiveness, (Who forgiveth all sins. Lo! He is the Forgiving) He forgives those who repent of disbelief and believe in Allah, (the Merciful) towards those who die repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا تقنطوا من رحمة الله } فإن القنوط علامة زوال الاستعداد والسقوط عن الفطرة بالاحتجاب\n وانقطاع الوصلة من الحق والبعد\n إذ لو بقيت فيه مسكة من النور الأصلي لأدرك أثر رحمته الواسعة السابقة على غضبه بالذات فرجا وصول ذلك الأثر إليه\n وإن أسرف في الميل إلى الجهة السفلية وفرط في جنب الحضرة الإلهية لاتصاله بعالم النور بتلك البقية\n وإنما اليأس لا يكون إلا مع الاحتجاب الكلي واسوداد الوجه بالإعراض عن العالم العلويّ\n والتغشي بالغطاء الخلقي المادّي\n { إن الله يغفر الذنوب جميعاً } بشرط بقاء نور التوحيد في القلب وهو مستفاد من اختصاص العباد لإفاضتهم إلى نفسه في قوله:\n[الزمر\n الآية:53]\n ولهذا قيل: يغفر جميعها للأمة المحمدية الموحدين دون سائر الأمم\n كما قال لأمّة نوح عليه السلام:\n[نوح\n الآية:71] أي: بعضها\n { إنه هو الفغور } لهئيات الرذائل من الإفراط والتفريط { الرحيم } بإفاضة الفضائل\n { وأنيبوا إلى ربّكم } بالتنصل عن هيئات السوء { وأسلموا له } وجوهكم بالتجرّد عن ذنوب الأفعال والصفات من قبل انسداد باب المغفرة بوقوع العذاب الذي تستحقونه بالموت فلا يمكنكم الإنابة والتسليم لفقدان الآلات وانسداد الأبوب { يا حسرتا على ما فرّطت } بترك السعي في طلب الكمال والتقصير في الطاعة حين كنت في جوار الله\n قريباً منه\n لصفاء استعدادي وتمكّني من السلوك فيه بوجود الآلات البدنية المعدّة لي\n { ويوم القيامة } الكبرى { ترى الذين كذّبوا على الله } من المحجوبين الذين يسوّونه بالمخلوقات\n إذ يجسمونه ويجوّزون عليه ما يمتنع عليه من الصفات لاحتجابهم بالموادّ { وجوههم مسودّة } بارتكاب الهيئات الظلمانية ورسوخ الرذائل النفسانية في ذواتهم { أليس في جهنم } الطبيعة الهيولانية { مثوى للكافرين } الذين احتجبوا بصفات نفوسهم المستولية عليهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تنبهوا على حقية الحق وتفطنوا دلائل توحيده { قُلْ } لهم يا أكمل الرسل نيابة عنَّا\n منادياً لهم على وجه الاختصاص\n مضيفاً لهم إلينا عطفاً ولطفاً: { يٰعِبَادِيَ ٱلَّذِينَ أَسْرَفُواْ عَلَىٰ أَنفُسِهِمْ } طول دهرهم قبل انكشاف الأغطية والسدل عن عيون بصائرهم: { لاَ تَقْنَطُواْ } ولا تيأسوا { مِن } فيضان { رَّحْمَةِ ٱللَّهِ } عليكم بعد انكشافها ورفعها { إِنَّ ٱللَّهَ } المطلع على ضمائر عباده ونياتهم { يَغْفِرُ } ويستر { ٱلذُّنُوبَ } التي صدرت عنكم حين غفلتكم { جَمِيعاً } وكيف لا يغفرها سبحانه { إِنَّهُ } بمقتضى ذاته وأوصافه وأسمائه { هُوَ ٱلْغَفُورُ } المقصود على العفو والستر لعموم عباده\n سيما على أهل التوحيد منهم { ٱلرَّحِيمُ } [الزمر: 53] لهم يوصلهم بعد رفع الحجب عنهم إلى مقر التجريد والتفريد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قل } يا محمد { يا عباديَ الذين أسرفوا على أنفسهم } أي: أفرطوا في الجناية عليها\n بالإسراف في المعاصي\n والغلو فيها\n { لا تقنطوا من رحمة الله }: لا تيأسوا من مغفرته أولاً\n وتفضُّله بالرحمة ثانياً\n { إِن الله يغفرُ الذنوبَ جميعاً } \n بالعفو عنها\n إلا الشرك\n وفي قراءة النبي صلى الله عليه وسلم:\n \" يغفر الذنوب جميعاً ولا يُبالي \" \nلكنها لم تتواتر عنه\n والمغفرة تصدق بعد التعذيب وقبله\n وتقييده بالتوبة خلاف الظاهر\n كيف\n وقوله تعالى:\n[النساء: 48] ظاهر في الإطلاق مما عدا الشرك؟ وَلِمَا يدل عليه التعليل بقوله: { إِنه هو الغفور الرحيم } على المبالغة\n وإفادة الحصر\n والوعد بالرحمة بعد المغفرة\n وما في { عبادي } من الدلالة على الذلة والاختصاص\n المقتضييْن للترحُّم\n { إِنه هو الغفورُ } يستر عظام الذنوب { الرحيمُ } يكشف فظائع الكروب\n والآية\n وإن نزلت في \" وحشي \" \n قاتل \" حمزة \" \n أو في غيره\n لا تقتضي التخصيص بهم\n فإن أسباب النزول لا تخصص\n وعن النبي صلى الله عليه وسلم:\n \" ما أحب أن لي الدنيا وما فيها بهذه الآية \"\n \nولما نزلت في شأن وحشي\n وأسلم\n قال المسلمون: هذه له خاصة\n أو للمسلمين عامة؟ فقال النبي صلى الله عليه وسلم:\n \" بل هي للمسلمين عامة \" \nوقال قتادة إن ناساً أصابوا ذنوباً عظاماً\n فلما جاء الإسلام أشفقوا ألا يتاب عليهم\n فدعاهم الله تعالى بهذه الآية\n وقال ابن عمر: نزلت هذه الآيات في عياش بن أبي ربيعة\n والوليد بن الوليد\n ونفر كانوا قد أسلموا ثم فُتنوا\n فكنا نقول: لا يقبل الله منهم صرفاً ولا عدلاً\n فنزلت الآية\n وكان عمر بن الخطاب كاتباً\n فكتبها بيده\n ثم بعث بها إلى عياش بن أبي ربيعة والوليد\n وإلى أولئك النفر\n فأسلموا\n وهاجروا\n قال علي رضي الله عنه: \" ما في القرآن آية أوسع من هذه الآية \"\n فما يُقنط الناس ويشدد عليهم بعد هذه الآية إلا جهول\n أو جامد\n قال زيد بن أسلم: إنَّ رجلاً كان في الأمم الماضية مجتهداً في العبادة\n فيشدد على نفسه\n ويقنط الناس من رحمة الله\n فمات\n فقال: أيّ ربّ ما لي عندك؟ فقال: النار\n فقال: يا رب أين عبادتي؟ فقال: إنك كنت تُقنط الناس من رحمتي في الدنيا\n فاليوم أقنطك من رحمتي\n وعن عليّ ـ كرّم الله وجهه ـ قال: الفقيه كل الفقيه الذي لا يقنط الناس من رحمة الله\n ولا يؤمنهم من عذاب الله\n ولا يرخص لهم في معاصي الله\n هـ\n ثم حضَّ على التوبة لتتحقق المغفرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:56",
      "similarity": 0.755867828067236
    },
    {
      "verse": "15:55",
      "similarity": 0.7407604849482049
    },
    {
      "verse": "30:36",
      "similarity": 0.5999178244417402
    },
    {
      "verse": "42:28",
      "similarity": 0.44295183058774396
    },
    {
      "verse": "41:49",
      "similarity": 0.36195905054445376
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}