{
  "chapter": "الزمر",
  "text": "وانيبوا۟ الى ربكم واسلموا۟ له من قبل ان ياتيكم العذاب ثم لا تنصرون",
  "translations": [
    {
      "translation": "Turn in repentance to your Lord and submit to Him before punishment comes upon you, for then you cannot be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn towards your Lord and obey Him before the punishment comes upon you when you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn to your Lord and surrender yourselves to Him before the chastisement over-takes you; for then you will receive no help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn in repentance to your Lord and submit to His will before you are afflicted with the torment after which you can receive no help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And incline towards your Lord and submit to Him, before the punishment comes you and then you may not be helped.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn in repentance (and in obedience with true faith) to your Lord and submit to Him before the torment comes upon you, (and) then you will not be helped.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And return to your Lord time after time and submit to Him before there comes to you the punishment, then you shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn unto your Lord and surrender to Him, ere the chastisement comes upon you, then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn unto your Lord repentant, and surrender unto Him, before there come unto you the doom, when ye cannot be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn to your Lord and submit to Him before His scourge overtakes you, for then you shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn penitently Unto your Lord and submit Unto Him ere there cometh Unto you the torment, and then ye shall not be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn penitently to Him and submit to Him before the punishment overtakes you, whereupon you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn ye to our Lord (in repentance) and bow to His (Will), before the Penalty comes on you: after that ye shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn in repentance and in obedience with true Faith (Islamic Monotheism) to your Lord and submit to Him, (in Islam), before the torment comes upon you, then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn to your Lord and surrender yourselves to Him before the punishment overtakes you, for then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn to your Lord, and submit to Him, before the retribution comes upon you. Then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:54] And turn, return, [penitently] to your Lord and submit, perform deeds sincerely, to Him, before the chastisement comes on you, whereupon you will not be helped, to ward it off, if you have not repented.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Turn unto Him repentant) from disbelief, (and surrender unto Him) and believe in Him and obey Him, (before there come unto you the doom, when ye cannot be helped) you will not be spared from Allah's torment. This verse was revealed about Wahshiyy and his believing brothers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعتم سعة رحمة الحق وجميل عفوه ومغفرته { أَنِـيبُوۤاْ } أي: تقربوا وتوجهوا أيها المجبولون على فطرة الإسلام { إِلَىٰ رَبِّكُمْ } الذي رباكم لمصلحة المعرفة والتوحيد { وَأَسْلِمُواْ لَهُ } وانقادوا لأوامره، واجتنبوا عن نواهيه بالعزيمة الخالصة عن كدر الرعونات وشين الشهوات { مِن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ } الموعود في يوم الجزاء { ثُمَّ } بعد نزوله وإتيانه { لاَ تُنصَرُونَ } [الزمر: 54] إذ حينئذ لا يسع لكم التدارك والتلافي؛ لانقضاء زمان التوبة والرجوع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم حضَّ على التوبة لتتحقق المغفرة، فقال: { وأَنِيبوا إِلى ربكم } أي: ارجعوا إليه بالتوبة والإخلاص\n\n\nفالإنابة أخص من التوبة لأن التوبة: مطلق الندم على الزلة، والإنابة: تحقيق التوبة والنهوض إلى الله بإخلاص التوجه\n قال صلى الله عليه وسلم:\n\n \" من السعادة أن يطول عمر الرجل ويرزقه الله الإنابة \" \n\nقال القشيري: وقيل الفرق بين الإنابة والتوبة: أن التائب يرجع خوفاً من العقوبة، والمنيب يرجع حياءً منه تعالى\n هـ\n والأمر بالتوبة لا يدل على تقييد المغفرة في الآية بها، كما تقدّم إذ ليس المدعَى: أن الآية تدل على حصول المغفرة لكل أحد من غير توبة وسبْق تعذيب، حتى يغني عن الأمر بها، وإنما المراد: الإخبار بسعة غفرانه، سواء كان مع التوبة أم لا\n قال ابن عرفة: واعلم أن التوبة من الكفر مقطوع بها، ومن المعاصي، قيل: مظنونة، وقيل: مقطوع بها، هذا في الجملة، وأما في التعيين، كتوبة زيد بن عَمْرو، فلا خلاف أنها مظنونة\n هـ\n قلت: قد اقترن بتوبة زيد من الأخبار ما يقطع بصحتها\n ثم قال: وأما العاصي إذا لم يتب فهو في المشيئة، مع تغليب جانب الخوف والعقوبة، واعتقاد أن العذاب أرجح، وأما العصيان بالقتل، ففيه خلاف بين أهل السُّنة، فقيل: يخلد في النار، وقيل: في المشيئة\n هـ\n وقال أبو الحجاج الضرير رحمه الله:\n\n{ وأَسْلِمُوا له } أي: اخضعوا له، وانقادوا لأمره\n قال القشيري: أي: أَخلصوا في طاعتكم، والإسلامُ ـ الذي هو الإخلاص بعد الإنابة ـ: هو أن يعلم نجاته بفضلِه، لا بإنابته فبفضله يصل إلى إثابته، لا بإنابته يصل إلى فضله\n هـ\n { من قبل أن يأتيكم العذابُ } في الدنيا، أو في الآخرة، إن لم تتوبوا قبل نزول العقاب\n قال القشيري: العذاب هنا، قيل: الفراق، وقيل: هو أن يفوتَه وقت الرجوعِ بسوء الإياس\n هـ\n { ثم لا تُنصرون }: لا تُمنعون منه أبداً\n الإشارة: لا يعظم عندك الذنب عظمة تصدك عن حسن الظن بالله، فإن مَن استحضر عظمة ربه صغر في عينه كل شيء\n وتذكر قضية الرجل الذي قتل تسعاً وتسعين نفساً، ثم سأل راهباً: هل له توبة؟ فقال: لا، فكمل به المائة، ثم سأل عارفاً، فقال له: ومَن يحول بينك وبينها؟ لكن اخرج من القرية التي كنت تعصي فيها، واذهب إلى قوم يعبدون الله في مكان، فذهب، فأدركه الموت في الطريق، فلما أحسّ بالموت انحاز بصدره إلى القرية التي قصدها، ثم مات، فاختصمت فيه ملائكة العذاب وملائكة الرحمة فقال لهم الحق تعالى: قيسوا من القرية التي خرج منها، إلى القرية التي قصدها، فإلى أيهما هو أقرب هو منها؟ فوجدوه أقرب إلى القرية التي قصدها بشبر، فأخذته ملائكة الرحمة\n\n\nإلى غير ذلك من الحكايات التي لا تحصى في هذا المعنى\n وتأمل قضية الشاب الذي أتى النبي صلى الله عليه وسلم يبكي، فقال:\n\n \" ما يبكيك؟ قال: ذنوبي\n فقال له عليه السلام: إن الله يغفر ذنوبك، ولو كانت مثل السماوات السبع، والأرضين السبع، والجبال الرواسي، فقال: يا رسول الله، ذنب من ذنوبي أعظم من السماوات السبع والأرضين السبع، فقال له: ذنوبك أعظم أو العرش؟ قال: ذنوبي، فقال له: ذنوبك أعظم أو الكرسي؟ قال: ذنوبي، فقال: ذنوبك أعظم أو إلهك؟ فقال: الله أعظم، فقال: فأخبرني عن ذنبك\n قال: إني أستحيي، فقال: فأخبرني، فقال: إني كنت نبّاشاً أنبش القبور منذ سبع سنين، حتى ماتت جارية من بنات الأنصار، فنبشتها، وأخرجتها من كفنها، فمضيت، ثم غلبني الشيطان، فرجعت، فجامعتها، فقامت الجارية، وقالت: الويل لك يا شاب من دَيّان يوم الدين، يوم يضع كرسيه للقضاء، يأخذ من الظالم للمظلوم، تركتني عريانة في عساكر الموتى، وأوقفتني جُنباً بين يدي الله، فقام النبي صلى الله عليه وسلم وهو يضرب في قفاه، وهو يقول: يا فاسق، اخرج، ما أقربك من النار، فخرج الشاب تائباً إلى الله تعالى، حتى أتى عليه ما شاء الله، ثم قال: يا إله محمد وآدم وحواء، إن كنت غفرت لي فأَعْلِم محمداً وأصحابه، وإلا فأرسل عليَّ ناراً من السماء فأحرقني بها، ونجِّني من عذاب الآخرة، فجاء جبريل: فقال: السلام يقرئك السلام، فقال: هو السلام وإليه يعود السلام، قال: يقول أأنت خلقت خلقي؟ قال: بل هو الذي خلقهم\n قال: يقول: ترزقهم؟ قال: بل هو الذي يرزقهم، قال: يقول: أأنت تتوب عليهم؟ قال: بل هو الذي يتوب عليهم\n قال: فتب على عبدي، فإني تبتُ عليه، فدعا النبي صلى الله عليه وسلم الشاب، وتاب عليه، وقال: إن الله هو التوّاب الرحيم \" \n\nهـ\n ذكره السمرقندي والثعلبي\n ثم أمر باتباع القرآن بعد الإنابة، فقال: { وَٱتَّبِعُـوۤاْ أَحْسَنَ مَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُـمْ }\n\n",
      "translations": []
    }
  ]
}