{
  "chapter": "الزمر",
  "text": "واتبعوا۟ احسن ما انزل اليكم من ربكم من قبل ان ياتيكم العذاب بغتة وانتم لا تشعرون",
  "translations": [
    {
      "translation": "Follow the best that has been sent down to you from your Lord before the punishment comes upon you suddenly when you are not expecting it;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow the best of what has been revealed to you by your Lord before the punishment overtakes you suddenly and you are caught unawares,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow the best of what has been revealed to you from your Lord before the chastisement suddenly comes upon you without you even being aware of it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow the best of what is revealed to you from your Lord before the torment suddenly approaches you and you will not realize how it came about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And follow this, the best among all, which has been sent down towards you from your Lord, before the punishment comes suddenly upon you whilst you are unaware.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best of that which is sent down to you from your Lord, before the torment comes on you suddenly while you perceive not!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best that has been revealed to you from your Lord before there comes to you the punishment all of a sudden while you do not even perceive;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the fairest of what has been sent down to you from your Lord, ere the chastisement comes upon you suddenly while you are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the better (guidance) of that which is revealed unto you from your Lord, before the doom cometh on you suddenly when ye know not,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow the best aspect of what is sent down to you from your Lord, before the scourge comes upon you unawares,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best of that which hath been sent down Unto you from your Lord there cometh on you torment of a sudden, while ye perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow the best of what has been sent down to you from your Lord, before the punishment overtakes you suddenly while you are unaware.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best of (the courses) revealed to you from your Lord, before the Penalty comes on you - of a sudden while ye perceive not!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best of that which is sent down to you from your Lord (i.e. this Quran, do what it orders you to do and keep away from what it forbids), before the torment comes on you suddenly while you perceive not!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow the best of what has been sent down from your Lord before the punishment overtakes you suddenly, while you are unaware'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best of what was revealed to you from your Lord, before the punishment comes upon you suddenly, while you are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow the best of what was revealed to you from your Lord before the punishment comes upon you suddenly while you do not perceive,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:55] And follow the best of what has been revealed to you from your Lord — namely, the Qur’ān — before the chastisement comes on you suddenly while you are unaware’, of the time [of its arrival] until it has [actually] come;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah said: (And follow the better (guidance) of that which is revealed unto you from your Lord) i.e. the Qur'an; make lawful that which it states to be lawful and unlawful that which it states to be unlawful, 536 and act upon its clear verses and believe in its unclear verses, (before the doom cometh on you suddenly when ye know not) its coming,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: إن أردتم النجاة من العذاب { ٱتَّبِعُـوۤاْ أَحْسَنَ مَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُـمْ } أيها المكلفون على الدين المستبين\n ألا وهو القرآن الكريم المنزل على خير الأنام وأفضل الرسل الكرام\n وامتثلوا بجميع ما فيه من الأوامر والنواهي على وجه العزيمة { مِّن قَبْلِ أَن يَأْتِيَكُـمُ ٱلْعَذَابُ بَغْتَةً } فجأة { وَأَنتُمْ لاَ تَشْعُرُونَ } [الزمر: 55] علاماته حتى تتداركوا وتحذروا منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { واتَّبِعُوا أحسنَ ما أُنزل إليكم من ربكم } أي: القرآن\n فإنه أحسن الحديث\n ولا أحسن منه لفظاً ومعنى\n أو:المأمور به دون المنهي\n أو: العزائم دون الرُخص\n كقوله:\n[الزمر: 18]\n أو: الناسخ دون المنسوخ\n ولعله ما هو أعم\n فيصدق بكل ما يقرب إلى الله\n كالإنابة\n والطاعة\n ونحوهما\n { من قبل أن يأتيكم العذابُ بغتةً }: فجأة\n { وأنتم لا تشعرون } بمجيئه لتداركوا وتتأهبوا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:202",
      "similarity": 0.8825748801483658
    },
    {
      "verse": "43:66",
      "similarity": 0.7516818399349221
    },
    {
      "verse": "12:107",
      "similarity": 0.7025347748870884
    },
    {
      "verse": "29:53",
      "similarity": 0.6970015431354339
    },
    {
      "verse": "7:95",
      "similarity": 0.5592967836827071
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:55.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:55.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}