{
  "chapter": "الزمر",
  "text": "قل يعبادى الذين اسرفوا۟ على انفسهم لا تقنطوا۟ من رحمة الله ان الله يغفر الذنوب جميعا انه هو الغفور الرحيم",
  "translations": [
    {
      "translation": "Say: 'My slaves, you who have transgressed against yourselves, do not despair of the mercy of Allah. Truly Allah forgives all wrong actions. He is the Ever-Forgiving, the Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O creatures of God, those of you who have acted against your own interests should not be disheartened of the mercy of God. Surely God forgives all sins. He is all-forgiving and all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “My servants who have committed excesses against themselves, do not despair of Allah's Mercy. Surely Allah forgives all sins. He is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell my servants who have committed injustice to themselves, \"Do not despair of the mercy of God. God certainly forgives all sins. He is All-forgiving and All-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “O my* slaves, who have wronged themselves, do not lose hope in Allah’s mercy; indeed Allah forgives all sins; indeed He only is the Oft Forgiving, the Most Merciful.” (All Muslims are truly the slaves of Prophet Mohammed – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O My servants who have transgressed against themselves! Despair not of the mercy of Allah, verily, Allah forgives all sins. Truly, He is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O my servants! who have acted extravagantly against their own souls, do not despair of the mercy of Allah; surely Allah forgives the faults altogether; surely He is the Forgiving the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O my people who have been prodigal against yourselves, do not despair of God's mercy; surely God forgives sins altogether; surely He is the All-forgiving, the All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O My slaves who have been prodigal to their own hurt! Despair not of the mercy of Allah, Who forgiveth all sins. Lo! He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [God says] \"O My servants, who have committed excesses against their own souls, do not despair of God's mercy, for God surely forgives all sins. He is truly the Most Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: my bondmen who have committed extravagance against themselves despair not of the mercy of Allah; verily Allah will forgive the sins altogether. Verily He! He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say [that Allah declares,] ‘O My servants who have committed excesses against their own souls, do not despair of the mercy of Allah. Indeed Allah will forgive all sins. Indeed, He is the All-forgiving, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my Servants who have transgressed against their souls! Despair not of the Mercy of Allah: for Allah forgives all sins: for He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)! Despair not of the Mercy of Allah, verily Allah forgives all sins. Truly, He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O My worshipers, who have sinned excessively against themselves, do not despair of the Mercy of Allah, surely, Allah forgives all sins. He is theForgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O My servants who have transgressed against themselves: do not despair of God’s mercy, for God forgives all sins. He is indeed the Forgiver, the Clement.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:53] Say [that God declares]: ‘O My servants who have been prodigal against their own souls, do not despair (read taqnitū, taqnatū, or taqnutū), do not give up hope, of God’s mercy. Truly God forgives all sins, for those who repent from idolatry. Truly He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: My slaves who have been prodigal to their own hurt) through disbelief, idolatry, adultery and murder! (Despair not of the mercy of Allah) despair not of Allah's forgiveness, (Who forgiveth all sins. Lo! He is the Forgiving) He forgives those who repent of disbelief and believe in Allah, (the Merciful) towards those who die repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا تقنطوا من رحمة الله } فإن القنوط علامة زوال الاستعداد والسقوط عن الفطرة بالاحتجاب، وانقطاع الوصلة من الحق والبعد، إذ لو بقيت فيه مسكة من النور الأصلي لأدرك أثر رحمته الواسعة السابقة على غضبه بالذات فرجا وصول ذلك الأثر إليه، وإن أسرف في الميل إلى الجهة السفلية وفرط في جنب الحضرة الإلهية لاتصاله بعالم النور بتلك البقية\n وإنما اليأس لا يكون إلا مع الاحتجاب الكلي واسوداد الوجه بالإعراض عن العالم العلويّ، والتغشي بالغطاء الخلقي المادّي\n { إن الله يغفر الذنوب جميعاً } بشرط بقاء نور التوحيد في القلب وهو مستفاد من اختصاص العباد لإفاضتهم إلى نفسه في قوله:\n\n[الزمر، الآية:53]، ولهذا قيل: يغفر جميعها للأمة المحمدية الموحدين دون سائر الأمم، كما قال لأمّة نوح عليه السلام:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تنبهوا على حقية الحق وتفطنوا دلائل توحيده { قُلْ } لهم يا أكمل الرسل نيابة عنَّا\n منادياً لهم على وجه الاختصاص\n مضيفاً لهم إلينا عطفاً ولطفاً: { يٰعِبَادِيَ ٱلَّذِينَ أَسْرَفُواْ عَلَىٰ أَنفُسِهِمْ } طول دهرهم قبل انكشاف الأغطية والسدل عن عيون بصائرهم: { لاَ تَقْنَطُواْ } ولا تيأسوا { مِن } فيضان { رَّحْمَةِ ٱللَّهِ } عليكم بعد انكشافها ورفعها { إِنَّ ٱللَّهَ } المطلع على ضمائر عباده ونياتهم { يَغْفِرُ } ويستر { ٱلذُّنُوبَ } التي صدرت عنكم حين غفلتكم { جَمِيعاً } وكيف لا يغفرها سبحانه { إِنَّهُ } بمقتضى ذاته وأوصافه وأسمائه { هُوَ ٱلْغَفُورُ } المقصود على العفو والستر لعموم عباده\n سيما على أهل التوحيد منهم { ٱلرَّحِيمُ } [الزمر: 53] لهم يوصلهم بعد رفع الحجب عنهم إلى مقر التجريد والتفريد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قل } يا محمد { يا عباديَ الذين أسرفوا على أنفسهم } أي: أفرطوا في الجناية عليها، بالإسراف في المعاصي، والغلو فيها، { لا تقنطوا من رحمة الله }: لا تيأسوا من مغفرته أولاً، وتفضُّله بالرحمة ثانياً، { إِن الله يغفرُ الذنوبَ جميعاً } ، بالعفو عنها، إلا الشرك\n وفي قراءة النبي صلى الله عليه وسلم:\n\n \" يغفر الذنوب جميعاً ولا يُبالي \" \n\nلكنها لم تتواتر عنه\n والمغفرة تصدق بعد التعذيب وقبله، وتقييده بالتوبة خلاف الظاهر، كيف، وقوله تعالى:\n\n[النساء: 48] ظاهر في الإطلاق مما عدا الشرك؟ وَلِمَا يدل عليه التعليل بقوله: { إِنه هو الغفور الرحيم } على المبالغة، وإفادة الحصر، والوعد بالرحمة بعد المغفرة\n وما في { عبادي } من الدلالة على الذلة والاختصاص، المقتضييْن للترحُّم\n { إِنه هو الغفورُ } يستر عظام الذنوب { الرحيمُ } يكشف فظائع الكروب\n والآية، وإن نزلت في \" وحشي \" ، قاتل \" حمزة \" ، أو في غيره، لا تقتضي التخصيص بهم، فإن أسباب النزول لا تخصص\n وعن النبي صلى الله عليه وسلم:\n\n \" ما أحب أن لي الدنيا وما فيها بهذه الآية \"\n \n\nولما نزلت في شأن وحشي، وأسلم، قال المسلمون: هذه له خاصة، أو للمسلمين عامة؟ فقال النبي صلى الله عليه وسلم:\n\n \" بل هي للمسلمين عامة \" \n\nوقال قتادة إن ناساً أصابوا ذنوباً عظاماً، فلما جاء الإسلام أشفقوا ألا يتاب عليهم، فدعاهم الله تعالى بهذه الآية\n وقال ابن عمر: نزلت هذه الآيات في عياش بن أبي ربيعة، والوليد بن الوليد، ونفر كانوا قد أسلموا ثم فُتنوا، فكنا نقول: لا يقبل الله منهم صرفاً ولا عدلاً، فنزلت الآية، وكان عمر بن الخطاب كاتباً، فكتبها بيده، ثم بعث بها إلى عياش بن أبي ربيعة والوليد، وإلى أولئك النفر، فأسلموا، وهاجروا\n قال علي رضي الله عنه: \" ما في القرآن آية أوسع من هذه الآية \"\n فما يُقنط الناس ويشدد عليهم بعد هذه الآية إلا جهول، أو جامد، قال زيد بن أسلم: إنَّ رجلاً كان في الأمم الماضية مجتهداً في العبادة، فيشدد على نفسه، ويقنط الناس من رحمة الله، فمات، فقال: أيّ ربّ ما لي عندك؟ فقال: النار\n فقال: يا رب أين عبادتي؟ فقال: إنك كنت تُقنط الناس من رحمتي في الدنيا، فاليوم أقنطك من رحمتي\n وعن عليّ ـ كرّم الله وجهه ـ قال: الفقيه كل الفقيه الذي لا يقنط الناس من رحمة الله، ولا يؤمنهم من عذاب الله، ولا يرخص لهم في معاصي الله\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:56",
      "similarity": 0.755867828067236
    },
    {
      "verse": "15:55",
      "similarity": 0.7407604849482049
    },
    {
      "verse": "30:36",
      "similarity": 0.5999178244417402
    },
    {
      "verse": "42:28",
      "similarity": 0.44295183058774396
    },
    {
      "verse": "41:49",
      "similarity": 0.36195905054445376
    }
  ]
}