{
  "chapter": "الزمر",
  "text": "فاصابهم سيـات ما كسبوا۟ والذين ظلموا۟ من هؤلاء سيصيبهم سيـات ما كسبوا۟ وما هم بمعجزين",
  "translations": [
    {
      "translation": "The evil deeds they earned caught up with them. And the evil deeds which the wrongdoers among these people earn will also catch up with them and they can do nothing to prevent it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the worst of what they had done overtook them. So will the evil deeds of those who are sinners among them recoil back on them. They cannot get the better (of Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the evil consequences of their deeds overtook them. The wrongdoers among these will also be overtaken by the evil consequences of their deeds. They will be utterly unable to frustrate (Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were afflicted by the terrible result of whatever they gained. Besides this affliction, the unjust among them will also suffer the consequence of their deeds. They will not be able to challenge God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore the evils of their earnings befell them; and those who are unjust among them – soon the evils of the earnings will befall them, and they cannot escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, the evil results of that which they earned overtook them. And those who did wrong of these will also be overtaken by the evil results for that which they earned; and they will never be able to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So there befell them the evil (consequences) of what they earned; and (as for) those who are unjust from among these, there shall befall them the evil (consequences) of what they earn, and they shall not escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in that the evils of that they earned smote them. The evildoers of these men, they too shall be smitten by the evils -- of that they earned; they will not be able to frustrate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the evils that they earned smote them; and such of these as do wrong, the evils that they earn will smite them; they cannot escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the very evil of their deeds recoiled upon them; today's wrongdoers shall also have the evil of their deeds recoil upon them: they will never be able to frustrate [Our plan].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there befell them the evils of that which they had earned. And of these they who go wrong-anon will befall them the evils of that which they earn; nor can they frustrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the evils of what they had earned visited them, and as for the wrongdoers among these, the evils of what they earn shall be visited on them and they will not frustrate [Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, the evil results of their Deeds overtook them. And the wrong-doers of this (generation)- the evil results of their Deeds will soon overtake them (too), and they will never be able to frustrate (Our Plan)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, the evil results of that which they earned overtook them. And those who did wrong of these [people to whom you (Muhammad SAW) have been sent], will also be overtaken by the evil results (torment) for that which they earned, and they will never be able to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the evil of their earnings coiled upon them. The harmdoers among these will also be coiled by the evils of their earnings, they will be unable to defeat it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The evils of their deeds caught up with them. And the wrongdoers among these will also be afflicted by the evils of what they earned, and they cannot prevent it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the evil consequences of what they earned struck them. And those who have wronged of these [people] will be afflicted by the evil consequences of what they earned; and they will not cause failure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:51] So the evils of what they earned smote them, that is, the requital thereof [smote them]. And the evildoers among these, namely, [among] Quraysh, shall also be smitten by the evils of what they earned, and they will not be able to thwart it: [they will not] elude Our chastisement — thus they were made to suffer seven years of drought and [only] afterwards were they enriched [with provision from God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But the evils that they earned) the chastisement for what they said, did and amassed of wealth in the life of the world (smote them; and such of these) among the disbelievers of Mecca (as do wrong) ascribe partners to Allah, (the evils that they earn will smite them) the punishment for what they did will touch them, just as it touched those before them; (they cannot escape) Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَصَابَهُمْ } أي: الكفرة الماضين في النشأة الأولى { سَيِّئَاتُ مَا كَسَبُواْ } مثل الخسف والكسف والغرق وغيرها { وَٱلَّذِينَ ظَلَمُواْ مِنْ هَـٰؤُلاَءِ } الكفرة المستخلفين منهم، القائلين بقولهم؛ يعني: قريشاً { سَيُصِيبُهُمْ } عن قريب { سَيِّئَاتُ مَا كَسَبُواْ } أمثال أولئك الهالكين { وَمَا هُمْ } أي: هؤلاء { بِمُعْجِزِينَ } [الزمر: 51] الله القادر المقتدر على أنواع التعذيب والانتقام، فقُتل صناديدهم يوم بدر، وقُحطوا سبع سنين، ثم وسع عليهم رزقهم، ليتنبهوا أن مقاليد الأمور بيده، وخزائن الرزق من عنده، ومع ذلك لم يعلموا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الشورى: 40] أي: فأصابهم وبال ما كسبوا، { والذين ظلموا من هؤلاء }: المشركين، يعني قريشاً، { سيُصِيبهُم سيئاتُ ما كسبوا } من الكفر والمعاصي، كما أصاب أولئك\n\n\nوالسين للتأكيد\n وقد أصابهم ذلك، حيث قحطوا سبع سنين، وقتل صناديدهم يوم بدر\n { وما هم بمُعْجزين }: بفائتين من عذاب الله\n الإشارة: هذه الخصال الذميمة تُوجد في كثير من هذه الأمة، إذا أصابت العبد شدة أو قهرية رجع إلى الله، فإذا فرّج عنه بسب عادي كما هو دأب عالم الحكمة، أسند الفرج إلى ذلك السبب، فيقول: فلان فرّج عني، أو الدواء الفلاني شفاني، وهو شرك، كاد أن يكون جليّاً\n والواجب: النظر إلى فعل الله وقدرته، وإسقاط الوسائط من نظره، ولو وجدت حكمةً، فالكمال فعلها وجوداً، والغيبة عنها شهوداً\n وبالله التوفيق\n ثم ذكر ما جرت به عادته في خلقه، من تعاقب العسر واليسر، والقبض والبسط، فقال: { أَوَلَمْ يَعْلَمُوۤاْ أَنَّ ٱللَّهَ يَبْسُطُ ٱلرِّزْقَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:33",
      "similarity": 0.5627727633680751
    },
    {
      "verse": "6:134",
      "similarity": 0.5457916022383652
    },
    {
      "verse": "16:46",
      "similarity": 0.5294011982534707
    },
    {
      "verse": "42:31",
      "similarity": 0.5043675107777209
    },
    {
      "verse": "29:22",
      "similarity": 0.49584503130413277
    }
  ]
}