{
  "chapter": "الزمر",
  "text": "ان تقول نفس يحسرتى على ما فرطت فى جنۢب الله وان كنت لمن السخرين",
  "translations": [
    {
      "translation": "lest anyone should say, 'Alas for me for neglecting what Allah was due, and being one of the scoffers!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a soul should say: \"Alas, I was heedless of God and only laughed;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a person should say: “Alas for me for neglecting my duty towards Allah and for being among those that scoffed”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn to God in repentance before a soul says, \"Woe to me because of my failure to fulfill my duties to God. Woe to me for mocking God's guidance!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that no soul may say, “Alas! The failures that I committed regarding Allah – and indeed I used to mock!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a person should say: \"Alas, my grief that I was undutiful to Allah, and I was indeed among those who mocked.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a soul should say: O woe to me! for what I fell short of my duty to Allah, and most surely I was of those who laughed to scorn;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest any soul should say, 'Alas for me, in that I neglected my duty to God, and was a scoffer,'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest any soul should say: Alas, my grief that I was unmindful of Allah, and I was indeed among the scoffers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lest anyone should say, \"Alas for me, for having neglected what is due to God, and having been one of those who scoffed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a soul should say: Alas! for that I have been remiss in respect of Allah, and I was but of the scoffers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest anyone should say, ‘Alas for my negligence in the vicinage of Allah! Indeed I was among those who ridiculed.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest the soul should (then) say: 'Ah! Woe is me!- In that I neglected (my duty) towards Allah, and was but among those who mocked!'-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a person should say: \"Alas, my grief that I was undutiful to Allah (i.e. I have not done what Allah has ordered me to do), and I was indeed among those who mocked [at the truth! i.e. La ilaha ill-Allah (none has the right to be worshipped but Allah), the Quran, and Muhammad SAW and at the faithful believers, etc.]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest any soul should say: 'Sadly, I have neglected my duty to Allah and was of those that mocked'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that a soul may not say, “How sorry I am, for having neglected my duty to God, and for having been of the scoffers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest a soul should say, \"Oh [how great is] my regret over what I neglected in regard to Allah and that I was among the mockers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:56] so apply yourselves to this, before any soul should say, ‘Alas for me (yā hasratā is actually yā hasratī, meaning ‘O regret of mine’) for what I have neglected of my duty to God, in other words, [of] obedience to Him. Indeed (wa-in: in is softened in place of the hardened form, in other words [understand it as] wa-innī) I was among those who ridiculed’, His religion and His Book;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lest any soul should say) so that no soul should say: (Alas, my grief) I am remorseful (that I was unmindful of Allah) that I have left the obedience of Allah, (and I was indeed among the scoffers) and I was indeed among those who mocked the Scripture and Messenger!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي جَنبِ ٱللَّهِ } قال زيد بن علي عليهما السّلامُ: يومُ القِيامةِ\n وجَنبُ الله: علي بن أبي طالب، وموالاةُ أهل بيتهِ عليهم السّلامُ\n وقال: في أَمرِ الله\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"On the Day of Judgment,\" said Zayd ibn Ali, peace be upon him:\n\n\nNext to Allah is Ali ibn Abi Talib, and the Ahlul Bayt are his loyal companions.\n And he said, \"In the affair of Allah.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: احذروا من يوم هائل مهول مخافة { أَن تَقُولَ } فيه { نَفْسٌ } وازرة منكم\n مقصرة عن الإنابة والرجوع حين حلول العذاب عليها: { يٰحَسْرَتَا } ويا ندامتنا { عَلَىٰ مَا فَرَّطَتُ فِي جَنبِ ٱللَّهِ } أي: في جانبه ورعاية حقه في إطاعته وانقياده { وَإِن كُنتُ لَمِنَ ٱلسَّاخِرِينَ } [الزمر: 56] أي: فرطت في حقه سبحانه\n والحال أني حينئذ من الساخرين بالأنبياء الهادين والعلماء الراشدين المنبهين علي\n وبالجملة: فندمت حينئذ\n ما ينفع الندم\n\n\n{ أَوْ تَقُولَ } متحسراً على كرامة أهل العناية: { لَوْ أَنَّ ٱللَّهَ هَدَانِي } ووفقني على التوبة والإنابة نحوه كسائر أوليائه { لَكُـنتُ مِنَ ٱلْمُتَّقِينَ } [الزمر: 57] المتحفظين نفوسهم عن الإفراد في حق الله ورعاية جانبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أمرتكم بذلك كراهة { أن تقول نفس } ، والتنكير للتكثير، كما في قوله:\n\n[التكوير: 14]، أو: يراد به بعض الأنفس، وهي نفس الكافر، أو: يُراد نفس متميزة إما بلجاج في الكفر شديد أو بعقاب عظيم: { يا حسرتا } ، بألف بدل من ياء الإضافة لأن العرب تقلب ياء المتكلم ألفاً في الاستغاثة، فيقولون: يا ويلتا، يا ندامتا، فيخرجون ذلك على لفظ الدعاء، وربما ألحَقوا بها الهاء، فيقال: يا رباهُ، يا مولاهُ، وربما ألحقوا ياء المتكلم، جمعاً بين العوض والمعوض، وبذلك قرأ أبو جعفر: \" يا حسرتاي \" أي: يا ندامتاه ويا حزناه\n { على ما فَرَّطتُ }: قصَّرت\n و \" ما \": مصدرية، أي: على تقصيري وتفريطي { في جَنبِ اللهِ } أي: جانبه وحقه وطاعته، أو: في ذاته، أي: معرفة ذاته، أو في قربه، من قوله:\n\n[النساء: 36]، أو: في سبيل الله ودينه، والعرب تسمي السبب الموصل إلى الشيء جنباً، تقول: تجرّعت في جنبك غُصَصاً، أي: لأجلك، أو: في الجانب الذي يؤدي إلى رضوانه، وهو توحيده والإقرار بنبوة نبيه محمد صلى الله عليه وسلم\n وقرىء \" في ذكر الله \"\n { وإِن كُنتُ لمن الساخرين } أي: المستهزئين بدين الله\n قال قتادة: لم يكفهِ أن ضيّع طاعة الله حتى سخر بأهلها\n و \" إن \": مخففة، والجملة: حالية، أي: فرطت وأنا ساخر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:45",
      "similarity": 0.5682908015029803
    },
    {
      "verse": "6:31",
      "similarity": 0.5457334912156664
    },
    {
      "verse": "69:50",
      "similarity": 0.4616354530303976
    },
    {
      "verse": "16:62",
      "similarity": 0.4363021283846315
    },
    {
      "verse": "21:19",
      "similarity": 0.43488513396315476
    }
  ]
}