{
  "chapter": "الزمر",
  "text": "اولم يعلموا۟ ان الله يبسط الرزق لمن يشاء ويقدر ان فى ذلك لءايت لقوم يؤمنون",
  "translations": [
    {
      "translation": "Do they not know that Allah expands the provision of anyone He wills and restricts it? There are certainly Signs in that for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God enhances or restricts the provision of any one He will. Surely there are signs in this for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah enlarges and straitens the provision of whomsoever He pleases? Therein are Signs for those that believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not know that God determines and increases the sustenance of whomever He wants. In this there is evidence (of the truth) for the believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah eases the sustenance for whomever He wills, and restricts it? Indeed in this are signs for the People who Believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah expands the provision for whom He wills, and straitens it. Verily, in this are signs for the folk who believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah makes ample the means of subsistence to whom He pleases, and He straitens; most surely there are signs in this for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they know that God outspreads and straitens His provision to whomsoever He will? Surely in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah enlargeth providence for whom He will, and straiteneth it (for whom He will). Lo! herein verily are portents for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God grants abundant sustenance to anyone He wishes and gives sparingly to anyone He pleases? Surely there are signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allahs expandeth provision for whomsoever He will, and stinteth it for whomsoever He will! Verily herein are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah expands the provision for whomever He wishes and tightens it [for whomever He wishes]? There are indeed signs in that for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah enlarges the provision or restricts it, for any He pleases? Verily, in this are Signs for those who believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah enlarges the provision for whom He wills, and straitens it (for whom He wills). Verily, in this are signs for the folk who believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah outspreads and withholds His provision to whosoever He will? Surely, there are signs in this for a believing nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God extends the provision to whomever He wills, and constricts it? In that are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah extends provision for whom He wills and restricts [it]? Indeed in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:52] Do they not know that God extends His provision, [that He] makes it abundant, for whomever He will, as a test, and restricts [it]?, for whomever He will, as a trial? Truly in that there are signs for a people who believe, in Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Know they not) i.e. the disbelievers of Mecca (that Allah enlargeth providence for whom He will) that Allah expands wealth to whomever He will as a lure to perdition, (and straiteneth it (for whom He will)) out of care for them. (Lo! Herein) in expanding and straitening provision (verily are portents) signs and admonitions (for people who believe) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَلَمْ يَعْلَمُوۤاْ } ولم يتنبهوا { أَنَّ ٱللَّهَ } المتكفل بأرزاق عباده { يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ } من عباده { وَيَقْدِرُ } أي: يقبض عمن يشاء منهم إرادة واختياراً على مقتضى علمه بتفاوت استعداداتهم الفطرية وقابلياتهم الجبلية الفائضة عليهم من الحكيم الوهاب { إِنَّ فِي ذَلِكَ } القبض والبسط المستلزمين للدقائق والرقائق الغير المحصورة في الأمور الإلهية { لآيَاتٍ } براهني واضحات على حكمة القدير العليم { لِّقَوْمٍ يُؤْمِنُونَ } [الزمر: 52] بذات الله، وكمال أوصافه وأسمائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أَوَلَمْ يعلموا } أي: أقالوا ذلك ولم يعلموا، أو أَغفلوا ولم يعلموا { أَنَّ الله يبسُطُ الرِّزقَ } أي: يوسعه { لمَن يشاءُ ويقدرُ } أي: يضيق لمَن يشاء بلا سبب ولا علة، أو: يجعله على قدر القوت من غير زيادة ولا نقصان، وهو من إتمام النعمة\n وفي الحِكَم:\n\n \" من تمام النعمة عليك أن يعطيك ما يكفيك، ويمنعك ما يطغيك \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:37",
      "similarity": 0.9706449869499703
    },
    {
      "verse": "29:62",
      "similarity": 0.8680670234805117
    },
    {
      "verse": "34:36",
      "similarity": 0.798890688957577
    },
    {
      "verse": "34:39",
      "similarity": 0.7315772078070533
    },
    {
      "verse": "17:30",
      "similarity": 0.7307284016628768
    }
  ]
}