{
  "chapter": "الزمر",
  "text": "ويوم القيمة ترى الذين كذبوا۟ على الله وجوههم مسودة اليس فى جهنم مثوى للمتكبرين",
  "translations": [
    {
      "translation": "On the Day of Rising you will see those who lied against Allah with their faces blackened. Do not the arrogant have a dwelling place in Hell?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you see those who had imputed lies to God on the Day of Resurrection, black would be their faces (with disgrace). Is there not a place in Hell for the arrogant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection you shall see that the faces of those who had lied against Allah have turned dark. Is Hell not vast enough to provide a room to the vainglorious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Judgment you will see the faces of those who had invented falsehood against God blackened. Is not hell the dwelling of the arrogant ones?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see on the Day of Resurrection the fabricators of lies against Allah, with their faces blackened; is not the destination of the haughty in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day of Resurrection you will see those who lied against Allah - their faces will be black. Is there not in Hell an abode for the arrogant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day of resurrection you shall see those who lied against Allah; their faces shall be blackened. Is there not in hell an abode for the proud?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And upon the Day of Resurrection thou shalt see those who lied against God, their faces blackened; is there not in Gehenna a lodging for those that are proud?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day of Resurrection thou (Muhammad) seest those who lied concerning Allah with their faces blackened. Is not the home of the scorners in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection you will see those who uttered falsehoods about God with their faces blackened. Is there not enough room in Hell for the arrogant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day of Judgment thou Shalt see those who lied against Allah - their faces blackened. Is not in Hell the abode of the stiff-necked?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection you will see those who attributed lies to Allah with their faces blackened. Is not the [final] abode of the arrogant in hell?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Judgment wilt thou see those who told lies against Allah;- their faces will be turned black; Is there not in Hell an abode for the Haughty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day of Resurrection you will see those who lied against Allah (i.e. attributed to Him sons, partners, etc.) their faces will be black. Is there not in Hell an abode for the arrogant ones?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection, you shall see those who lied about Allah with blackened faces. In Gehenna is there not a lodging for those who were proud?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection, you will see those who told lies about God with their faces blackened. Is there not a place in Hell for the arrogant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day of Resurrection you will see those who lied about Allah [with] their faces blackened. Is there not in Hell a residence for the arrogant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:60] And on the Day of Resurrection you will see those who imputed lies to God, by ascribing partner and child to Him, with their faces blackened. Is there not in Hell a [fitting] abode for those who are [too] arrogant?, to believe? Indeed [there is].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on the Day of Resurrection thou (Muhammad) seest those who lied concerning Allah) regarding 'Uzayr, Jesus and the angels, when they claimed that the angels were Allah's daughters while 'Uzayr and Jesus were his sons (with their faces blackened) and their eyes turned blue. (Is not the home of the scorners in hell) Hell is the abode of the disbelievers?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا تبالوا أيها الموحدون بعتوهم واستكبارهم في هذه النشأة؛ إذ { يَوْمَ ٱلْقِيَامَةِ } التي تُبلى السرائر فيها { تَرَى } فيها أيها الرائي { ٱلَّذِينَ كَذَبُواْ عَلَى ٱللَّهِ } بإثبات الولد والشريك له، افتراء ومراء { وُجُوهُهُم مُّسْوَدَّةٌ } أي: تراهم حال كونهم مسودة الوجوه؛ لأنهم حينئذ ملازموا النار وملاصقوها، تستبعد وتستغرب أيها المعتبر الرائي حالتهم هذه { أَلَيْسَ } يبقى { فِي جَهَنَّمَ } البعد والخذلان، وجحيم الطرد والحرمان { مَثْوًى لِّلْمُتَكَبِّرِينَ } [الزمر: 60] الذين يتكبرون على الله وعلى أوليائه بأنواع الفسق والعصان والكذب والطغيان، مع أنه ما هي إلا معدة لهؤلاء البغاة الطغاة الهالكين في تيه الكبر والعناد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ويومَ القيامة ترى الذين كَذَبوا على الله } ، بأن وصفوه بما لا يليق بشأنه، كاتخاذ الولد والشريك ونفي الصفات عنه، { وجُوهُهُم مسودةٌ } بما ينالهم من الشدة والكآبة\n والجملة: حال، على أن الرؤية بصرية، أو: مفعول ثان لها، إن كانت علمية\n { أليس في جهنم مَثْوىً } أي: مقام { للمتكبرين } عن الإيمان والطاعة، وهو إشارة إلى قوله: { واستكبرت } ، ولا ينافي إشعاره بأن تكبرهم علة لاستحقاقهم النار أن يكون دخولهم فيها لأجل أن كلمة العذاب حقَّتْ عليهم لأن كبرهم مسبب عنها\n { ويُنجِّي اللهُ الذين اتَّقَوا } الشرك والمعاصي، أي: من جهنم",
      "translations": []
    }
  ]
}