{
  "chapter": "الزمر",
  "text": "واشرقت الارض بنور ربها ووضع الكتب وجا۟ىء بالنبين والشهداء وقضى بينهم بالحق وهم لا يظلمون",
  "translations": [
    {
      "translation": "And the earth will shine with the Pure Light of its Lord; the Book will be put in place; the Prophets and witnesses will be brought; it will be decided between them with the truth; and they will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The earth will light up with the effulgence of her Lord; and the ledger (of account) will be placed (in each man's hand), and the apostles and the witnesses will be called, and judgement passed between them equitably, and no wrong will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The earth shall shine with the light of its Lord, and the Scroll (of deeds) shall be set in place, and the Prophets and all witnesses shall be brought, and judgement shall be justly passed among them, and they shall not be wronged;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The earth will become bright from the light of your Lord. The Book of Records will be presented and the Prophets and witness will be summoned. All will be judged with justice and no wrong will be done to anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth will shine bright by the light of its Lord, and the Book will be established, and the Prophets and this Noble Prophet and the witnesses upon them from this nation will be brought, and it will be judged between them with the truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth will shine with the light of its Lord, and the Book will be presented, and the Prophets and the witnesses will be brought forward, and it will be judged between them with truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth shall beam with the light of its Lord, and the Book shall be laid down, and the prophets and the witnesses shall be brought up, and judgment shall be given between them with justice, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth shall shine with the light of its Lord, and the Book shall be set in place, and the Prophets and witnesses shall be brought, and justly the issue be decided between them, and they not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth shineth with the light of her Lord, and the Book is set up, and the prophets and the witnesses are brought, and it is judged between them with truth, and they are not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The earth will shine with the light of its Lord, and the Book will be laid open; the prophets and witnesses will be brought in; and judgement will be passed on them with fairness. And none shall be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth will gleam with the light of its Lord, and the Record shall be set up, and the prophets and the witnesses will be brought and judgment will be given between them with truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The earth will glow with the light of her Lord, and the Book will be set up, and the prophets and the martyrs will be brought, and judgment will be made between them with justice, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Earth will shine with the Glory of its Lord: the Record (of Deeds) will be placed (open); the prophets and the witnesses will be brought forward and a just decision pronounced between them; and they will not be wronged (in the least).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth will shine with the light of its Lord (Allah, when He will come to judge among men) and the Book will be placed (open) and the Prophets and the witnesses will be brought forward, and it will be judged between them with truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The earth will shine with the Light of its Lord, and the Book (of deeds) will be set (in place). The Prophets and witnesses shall be brought and the matter will be justly decided between them, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth will shine with the Light of its Lord; and the Book will be put in place; and the prophets and the witnesses will be brought in; and Judgment will be passed among them equitably, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:69] And the earth will shine with the light of its Lord, when God reveals Himself for the passing of judgement, and the Book, of deeds, shall be set in place, for the Reckoning, and the prophets and witnesses, namely, Muhammad (s) and his community, will be brought, to bear witness that the messengers delivered [the Message to their respective communities]. And judgement will be made between them with truth, in other words, justly, and they will not be wronged, in a single thing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the earth shineth with the light of her Lord) it is also said: with the justice of her Lord, (and the Book is set up) on the right and left hands of people; the book referred to here is the register of the Guardian angels, (and the Prophets) who were not messengers (and the witnesses) i.e. the messengers (are brought) it is also said that this means: and the prophets, messengers and witnesses-the witnesses of the messengers against their own folk-are brought, (and it is judged between them) and the prophets (with truth) with justice, (and they are not wronged) their good deeds will not be diminished nor will their evil deeds be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وأشرقت } أرض النفس حينئذ { بنور ربّها } واتّصفت بالعدالة التي هي ظلّ شمس الوحدة والأرض كلها في زمن المهدي عليه السلام بنور العدل والحق { ووضع الكتاب } أي: عُرِض كتاب الأعمال على أهلها ليقرأ كل واحد عمله في صحيفته التي هي نفسه المنتقشة فيها صور أعماله المنطبع منها تلك الصور في بدنه { وجيء بالنبيين والشهداء } من السابقين المطلعين على أحوالهم الذين قال فيهم:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد ذلك { أَشْرَقَتِ ٱلأَرْضُ بِنُورِ رَبِّهَا } أي: صارت الطبيعة والهيولي منورة بنور الله على ما كانت عليه قبل الفتح، وحينئذ عرضوا على الله { وَوُضِعَ ٱلْكِتَابُ } أي: مكتوب أعمال كل من النفوس الزكية والخبيثة بين أيديهم، وحُوسبوا بمقتضى ما فيه { وَ } بعدما تم حسابهم وتنقيد أعمالهم { جِـيءَ بِٱلنَّبِيِّيْنَ } المبعوثين كل منهم إلى أمة من الأمم؛ ليشهدوا على أممهم بما كانوا عليه في النشأة الأولى { وَٱلشُّهَدَآءِ } أي: وجيء بالشهداء أيضاً؛ يعني: أنطق الله أركانهم وجوارحهم التي أتوا بها ما أتوا من خير وشر فيشهدون\n\n\n\n\n{ وَ } بعد انكشاف أحوالهم وضبط أعمالهم { قُضِيَ بَيْنَهُم بِٱلْحَقِّ } على مقتضى العدالة الإلهية بلا حيف وميل { وَهُمْ } حينئذ { لاَ يُظْلَمُونَ } [الزمر: 69] بالزيادة والنقصان ثواباً وعقاباً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأشرقت الأرضُ } أضاءت { بنور ربها } حين يتجلّى لفصل عباده، فتُشرق الأرض ـ أي: عرَصَات القيامة ـ بنور وجهه، ويقال: إن الله يخلق في القيامة نوراً يلبسه وجهَ الأرض، فتشرق به\n قال في الحاشية الفاسية: وهذا القول هو الذي اختاره محيي السنة، وانتصر له الطيبي، بما ورد من الأحاديث المقتضية لرؤيته في عرصات القيامة، قال: وما تعسف الزمخشري، من حمل النور على العدل، إلا فراراً من ذلك\n هـ\n قال القشيري: هو نور يخلقه في القيامة، عند تكوير الشمس، وانكدار النجوم، ويستضيء به قومٌ دون قوم، والكفارُ يَبْقَون في الظلمة، والمؤمنون:\n\n[الحديد: 12] الآية\n ويقال: غداً إشراق الأرض، واليوم إشراق القلب، غداً أنوار التولي، واليوم أنوار التجلي\n هـ\n وقال السدي: بعدله، على الاستعارة، يقال للملك العادل: أشرقت الأرض بعدله، كما استعيرت الظلمة للظُلم\n وفي الحديث:\n\n \" الظلم ظلمات يوم القيامة \"\n \n\n{ ووُضِع الكتابُ } أي: صحائف الأعمال\n اكتفى باسم الجنس، أو: كتاب المحاسبة والجزاء\n { وجيء بالنبيين } ليسألهم ربهم عما أجابتهم به أممهم، { والشهداء } أي: الحفظة، ليشهدوا على كل إنسان بما عمل، والذين يشهدون للرسل بتبليغ الرسالة إذا جحدتهم أممهم، أو: الذين استُشهدوا في سبيل الله\n { وقُضِيَ بينهم }: بين العباد { بالحق وهم لا يُظلَمُون } بنقص ثواب، أو زيادة عقاب، قال ابن عطية: الضمير في { بينهم } عائد على العالم بأجمعه\n هـ\n فيقتضي دخول الملائكة، ويتصور القضاء في حقهم، من حيث جعلوا حفظة على العباد، وأمناء على الوحي والتبليغ، وغير ذلك من ترتيبهم في مقاماتهم، وترقيهم في علومهم، وتفاوتهم في ذلك\n وفي وجوه تخصيصاتهم وتصديقهم في التبليغ، ورد ما استندوا فيه لظواهر الأمور، مع علمه تعالى خلافه، مما لا اطلاعَ لهم عليه\n قاله في الحاشية",
      "translations": []
    }
  ]
}