{
  "chapter": "الزمر",
  "text": "خلقكم من نفس وحدة ثم جعل منها زوجها وانزل لكم من الانعم ثمنية ازوج يخلقكم فى بطون امهتكم خلقا منۢ بعد خلق فى ظلمت ثلث ذلكم الله ربكم له الملك لا اله الا هو فانى تصرفون",
  "translations": [
    {
      "translation": "He created you from a single self, then produced its mate from it, and sent down livestock to you - eight kinds in pairs. He creates you stage by stage in your mothers' wombs in a threefold darkness. That is Allah, your Lord. Sovereignty is His. There is no god but Him. So what has made you deviate?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from a single cell, then from it created its mate; arid provided eight varieties of cattle for you. He formed you in the mother's womb, formation after formation in three (veils of) darkness. He is God your Lord. His is the kingdom. There is no god other than He. How then can you turn away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created you from a single being, and He it is Who made from it its mate. He it is Who created for you eight heads of cattle in pairs. He creates you in your mothers' wombs, giving you one form after another in threefold depths of darkness. That, then, is Allah, your Lord. His is the kingdom. There is no god but He. So, whence are you being turned astray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created you from a single soul. Out of this He created your spouse. He sent you eight pairs of cattle. He creates you for a second time in the wombs of your mothers behind three curtains of darkness. He is your Lord to whom belongs the Kingdom. He is the only Lord. Where then will you turn away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created you from a single being, and then from the same being created its spouse, and sent down for you eight pairs of animals; He creates you in your mothers’ wombs, from one sort to another, in a triple darkness; such is Allah, your Lord – for Him only is the kingship; there is no God except Him; so where are you being turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you (all) from a single person; then made from him his wife. And He has sent down for you of An`am eight pairs. He creates you in the wombs of your mothers, creation after creation in three veils of darkness. Such is Allah your Lord. His is the kingdom. La ilaha illa Huwa. How then are you turned away\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created you from a single being, then made its mate of the same (kind), and He has made for you eight of the cattle in pairs. He creates you in the wombs of your mothers-- a creation after a creation-- in triple darkness; that is Allah your Lord, His is the kingdom; there is no god but He; whence are you then turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you of a single soul, then from it He appointed its mate; and He sent down to you of the cattle eight couples. He creates you in your mothers' wombs creation after creation in threefold shadows. That then is God, your Lord; to Him belongs the Kingdom; there is no god but He; so how are you turned about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from one being, then from that (being) He made its mate; and He hath provided for you of cattle eight kinds. He created you in the wombs of your mothers, creation after creation, in a threefold gloom. Such is Allah, your Lord. His is the Sovereignty. There is no Allah save Him. How then are ye turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from a single soul, then produced its spouse from it, and He has provided for you eight heads of cattle in pairs. He creates you stage by stage in your mothers' wombs in a threefold darkness. Such is God, your Lord. Sovereignty is His. There is no god but Him. So what has made you turn away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you Of a Single soul, and made his spouse therefrom; and of the cattle He sent down Unto you eight pairs. He createth you in the bellies of your mothers, one creation after creation, in a threefold darkness. Such is Allah, your Lord. His is the dominion, there is no god but He. Whither then turn ye away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from a single soul, then made from it its mate, and He has sent down for you eight mates of the cattle. He creates you in the wombs of your mothers, creation after creation, in a threefold darkness. That is Allah, your Lord! To Him belongs all sovereignty. There is no god except Him. Then where are you being led away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you (all) from a single person: then created, of like nature, his mate; and he sent down for you eight head of cattle in pairs: He makes you, in the wombs of your mothers, in stages, one after another, in three veils of darkness. such is Allah, your Lord and Cherisher: to Him belongs (all) dominion. There is no god but He: then how are ye turned away (from your true Centre)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you (all) from a single person (Adam); then made from him his wife [Hawwa' (Eve)]. And He has sent down for you of cattle eight pairs (of the sheep, two, male and female; of the goats, two, male and female; of the oxen, two, male and female; and of the camels, two, male and female). He creates you in the wombs of your mothers, creation after creation in three veils of darkness, such is Allah your Lord. His is the kingdom, La ilaha illa Huwa (none has the right to be worshipped but He). How then are you turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from a single soul, then from it He created its spouse. And He sent down to you eight pairs of the cattle. He creates you in your mothers' womb, creation after creation, in three (stages of) darkness. Such then is Allah, your Lord. For Him is the Kingdom. There is no god except Him. How, then, can you turn away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from one person, then made from it its mate, and brought down livestock for you—eight kinds in pairs. He creates you in the wombs of your mothers, in successive formations, in a triple darkness. Such is God, your Lord. His is the kingdom. There is no god but He. So what made you deviate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created you from one soul. Then He made from it its mate, and He produced for you from the grazing livestock eight mates. He creates you in the wombs of your mothers, creation after creation, within three darknesses. That is Allah, your Lord; to Him belongs dominion. There is no deity except Him, so how are you averted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:6] He created you from a single soul, namely, Adam, then made from it its mate, Eve; and He sent down for you of the cattle, [of] camels, cows, small cattle, sheep and goats, eight kinds, of each kind a male and a female — as He makes clear in sūrat al-An‘ām [Q. 6:143f.]. He creates you in your mothers’ wombs, creation after creation, that is to say, as a sperm-drop, then a blood clot, then a foetus, in a threefold darkness, that is, the darkness of the belly, that of the womb and that of the placenta. That is God, your Lord. To Him belongs [all] sovereignty. There is no god except Him. Why then are you being turned away?, from worshipping Him to worshipping [things] other than Him?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He created you from one being) from the being of Adam alone, (then from that (being)) i.e. from Adam (He made its mate) Eve, He created her from one of Adam's shorter ribs; (and He hath provided for you of cattle eight kinds) of sheep: a male and a female; of goat: a male and a female; of camel: a male and a female; of bovines: a male and a female. (He created you in the wombs of your mothers, creation after creation) a state after another: a sperm drop then a blood clot then a piece of flesh and then bones, (in a threefold gloom) the darkness of the belly, the darkness of the womb and the darkness of the placenta. (Such is Allah, your Lord) Who does this. (His is the Sovereignty) which is perpetual and never ending. (There is no God save Him) there is no Creator or Fashioner except Him. (How then are ye turned away) How then do you lie against Him and ascribe partners to Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { خَلْقاً مِّن بَعْدِ خَلْقٍ } معناه نُطفةٌ، ثم عَلقةٌ، ثم مُضغةٌ، ثم لَحمٌ\n\n\n\n\nوقوله تعالى: { فِي ظُلُمَاتٍ ثَلاَثٍ } معناه ظُلمةُ البَطنِ، وظُلمةُ الرحمِ، وظُلمةُ المَشيمةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ خَلَقَكُمْ } أي: أظهركم وأوجدكم بالتجليات الجمالية { مِّن نَّفْسٍ وَاحِدَةٍ } وهي طبيعة العدم القابلة لانعكاس أشعبة نور الوجود { ثُمَّ جَعَلَ } وإظهر { مِنْهَا زَوْجَهَا } إبقاءً للتناسل، وتتميماً للأزدواجات الغير المتناهية حسب الأسماء والصفات المتقابلة، الغير المتناهية الإلهية، إظهاراً لكمال القدرة\n\n\n\n\n{ وَ } بعدما أتم سبحانه أمر إيجادكم وإثباتكم { أَنزَلَ لَكُمْ } أي: قسَّم وقضى لأجلكم تتميماً لأمور معاشكم عناية منه وتكريماً { مِّنَ ٱلأَنْعَامِ } المناسبة لتغذيتكم وتقوية أمزجتكم { ثَمَانِيَةَ أَزْوَاجٍ } ذكراً وأنثى على مقتضى جبلتكم لتدوم بدوامكم، وهي الأصناف الثمانية المذكورة في سورة الأنعام، هذا في ظهوركم وبروزكم في عالم الشهادة، وفي عالم الغيب والبطون { يَخْلُقُكُمْ } ويقدر موادكم { فِي بُطُونِ أُمَّهَاتِكُـمْ خَلْقاً مِّن بَعْدِ خَلْقٍ } أي: تقديراً بعد تقدير أعجب وأغرب من سابقه؛ بأن قدركم أولاً نطفة، ثم علقة، ثم مضغة، ثم سواك إنساناً، ونفخ فيكم روحاً من روحه، وبالجملة: أظهركم بعدما أخفاكم مدة { فِي ظُلُمَاتٍ ثَلاَثٍ } هي أصلاب آبائكم وحجب تعيناتكم وبطون أمهاتكم\n\n\n\n\n{ ذَٰلِكُمُ } الذي فعل بكم هذه الأفعال الجميلة المتقنة { ٱللَّهُ } المستقل بالألوهية والتصرف في ملكه وملكوته { رَبُّكُمْ } الذي رباكم وأحسن تربيتكم لا مربي لكم سواه؛ إذ { لَهُ ٱلْمُلْكُ } الملكوت خاصة لا يشارك في ملكه، ولا ينازع في سلطانه وشأنه، فظهر أنه { لاۤ إِلَـٰهَ } يعبد له ويرجع إليه في الخطوب { إِلاَّ هُوَ } الواحد الأحد الصمد الحقيق بالحقية، المستحق بالألوهية والربوبية { فَأَنَّىٰ تُصْرَفُونَ } [الزمر: 6] وتعدلون أيها المشركون المنحرفون عن جادة توحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { خَلَقَكُم من نفسٍ واحدةٍ } ، لَمَّا ذكر ما يتعلق بالعالم العلوي، ذكر ما يتعلق بالعالم السفلي، وترك العاطف للإيذان باستقلاله في الدلالة على الوحدانية، وبدأ بالإنسان لأنه المقصود الأهم من هذا العالم، ولعَرَاقته في الدلالة على توحيد الحق وباهر قدرته لما فيه من تعاجيب آثار القدرة، وأسرار الحكمة، وأصالته في المعرفة فإن الإنسان بحال نفسه أعرف، والمراد بالنفس: نفس آدم ـ عليه السلام\n { ثم جعل منها زوجَهَا }: عطف على محذوف، صفة لنفس، أي: من نفسٍ خلقها ثم جعل منها زوجها، أو: على معنى: واحدة، أي: نفس وُجدت ثم جعل منها زوجها حواء، وعطفت بثم دلالة على مباينتها له فضلاً ومزية، فهو من التراخي في الحال والمنزلة، مع التراخي في الزمان\n وقيل: أخرج ذرية آدم من ظهره كالذّر، ثم أخرج منه حوّاء، ففيه ثلاث آيات خلق آدم من غير أب ولا أم، وخلق حواء من قصيراه، ثم تشعيب الخلق الفائت للحصر منهما\n { وأنزل لكم من الأنعامِ } أي: قضى وجعل، أو: خلقها في الجنة مع آدم عليه السلام، ثم أنزلها، أو: أحدث لكم بأسباب نازلة من السماء، كالأمطار، وأشعة الكواكب، كما تقول الفلاسفة\n { ثمانيةَ أزواج } ذكراً وأنثى، وهي: الإبل، والبقر، والضأن، والمعز\n فالزوج اسم لواحد معه آخر، فإذا انفرد فهو فرد، ووتر\n { يخلقُكم في بطونِ أمهاتِكم }: استئناف لبيان كيفية خلقهم، وأطوارهم المختلفة، الدالة على القدرة القاهرة\n وصيغة المضارع للدلالة على التجرُّد\n { خلقاً من بعد خلق }: مصدر مؤكد، أي: يخلقكم فيها خلقاً كائناً من بعد خلق، أي: خلقاً مُدرَّجاً، حيواناً سويّاً، من بعد عظام مكسوة لحماً، من بعد عظام عارية، من بعد مضغة مخلَّقة، من بعد مضغة غير مخلَّقة، من بعد علقة، من بعد نطفة، { في ظلمات ثلاث }: ظلم البطن، وظلمة الرحم، وظلمة المشيمة، أو: ظلمة الصلب، والبطن، والرحم\n\n\n{ ذلكم }: إشارة إلى الحق تعالى، باعتبار أفعاله المذكورة، وهو مبتدأ، وما فيه من معنى البُعد للإيذان ببُعد منزلته في العظمة والكبرياء، أي: ذلكم العظيم الشأن، الذي عددت أفعاله هو { اللهُ ربكُم } أي: مربيكم بنعمة الإيجاد على الأطوار المتقدمة، وبنعمة الإمداد بعد نفخ الروح فيه\n { له الملكُ }: التصرف التام على الإطلاق في الدارين\n { لا إله إِلا هو }: لا متصرف غيره\n { فأنى تُصْرَفُون }: فكيف تصرفون عن عادته تعالى، مع وفور دواعيها، وانتفاء الصارف عنها بالكلية، إلى عبادة غيره، من غير داع إليها، مع كثرة الصوارف عنها؟ والله تعالى أعلم\n الإشارة: خلق سماوات الأرواح، وأرض النفوس، بالحق، أي: لسبب معرفته، وعبادته، فالمعرفة للأرواح، والعبادة للنفوس، يُكوّر نهار البسط على ليل القبض، وبالعكس، وسخَّر شمس العيان، وقمر البرهان، كُلٌّ يجري إلى أَجل مسمى، إلا أن قمر البرهان ينتهي بطلوع شمس العيان، وشمس العيان لا انتهاء لها\n { لا إله إلا هو العزيز } فيمنع بعزته من الوصول إليه مَن أراد احتجابه، { الغفار } فيغطي بفضله مساوىء مَن أراد وصلتَه\n { خلقكم من نفس واحدة } من روح واحدة، هي الروح الأعظم، ثم تفرّعت منها الأشياء كلها\n وأنزل لكم من الأنعام ما تتصرفون فيه، وتتقربون به إلى ربكم، ثم ذكَّرهم بنعمة الإيجاد، ونعمة الإمداد، بقوله: { يخلقكم في بطون أمهاتكم\n\n\n } إلخ، فنعمة الإيجاد ظاهرة، ونعمة الإمداد: ما يتغذّى به الجنين في بطن أمه من دم الحيض\n ثم أمرهم بالشكر عليها، فقال: { إِن تَكْفُرُواْ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنكُمْ }\n\n",
      "translations": []
    }
  ]
}