{
  "chapter": "الزمر",
  "text": "ولقد اوحى اليك والى الذين من قبلك لئن اشركت ليحبطن عملك ولتكونن من الخسرين",
  "translations": [
    {
      "translation": "It has been revealed to you and those before you: 'If you associate others with Allah, your actions will come to nothing and you will be among the losers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely you have been commanded, as those before you were: \"If you associate (any one with God), wasted will be all your deeds, arid you will perish.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Tell them clearly that) it was revealed to you and to all Prophets before you: “If you associate any others with Allah in His Divinity, your works will surely come to naught and you will certainly be among the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though God has said, \"It has been revealed to you and to those who lived before you that if you consider other things equal to God, your deeds will be made devoid of all virtue and you will certainly be lost?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was indeed revealed to you and to those before you; that, “O listener! If you ascribe a partner to Allah, all your deeds will go to waste and you will surely be a loser.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed it has been revealed to you, as it was to those before you: \"If you join others in worship with Allah, surely your deeds will be in vain, and you will certainly be among the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly, it has been revealed to you and to those before you: Surely if you associate (with Allah), your work would certainly come to naught and you would certainly be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been revealed to thee, and to those before thee, 'If thou associatest other gods with God, thy work shall surely fail and thou wilt be among the losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily it hath been revealed unto thee as unto those before thee (saying): If thou ascribe a partner to Allah thy work will fail and thou indeed wilt be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has already been revealed to you and to those who have gone before you that if you ascribe any partner to God, all your works will come to nothing, and you will surely be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly it hath been revealed Unto thee and Unto those before thee: if thou associatest surely of non-effect shall be made thy work, and thou shalt surely be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly it has been revealed to you and to those [who have been] before you: ‘If you ascribe a partner to Allah your works shall fail and you shall surely be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But it has already been revealed to thee,- as it was to those before thee,- \"If thou wert to join (gods with Allah), truly fruitless will be thy work (in life), and thou wilt surely be in the ranks of those who lose (all spiritual good)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed it has been revealed to you (O Muhammad SAW), as it was to those (Allah's Messengers) before you: \"If you join others in worship with Allah, (then) surely (all) your deeds will be in vain, and you will certainly be among the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has already been revealed to you and to those who have gone before you, that if you associate (partners) with Allah, your works would be annulled and you will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was revealed to you, and to those before you, that if you idolize, your works will be in vain, and you will be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was already revealed to you and to those before you that if you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:65] And certainly it has been revealed to you and to those before you [that], by God!, if you associate others [with God], O Muhammad (s) — hypothetically — your work shall surely fail and you shall surely be among the losers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily it hath been revealed unto thee) in the Qur'an (as unto those before you) among the messengers ((saying): If thou ascribe a partner to Allah thy work will fail) in that state of idolatry (and thou indeed will be among the losers) in that you will be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتثبيتاً على محبته { وَ } اللهِ { لَقَدْ أُوْحِيَ إِلَيْكَ } يا أكمل الرسل { وَإِلَى } الرسل { ٱلَّذِينَ } مضوا { مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ } أنت من كمال ودادتك وخلتك\n وكل واحد منهم أيضاً مع كمامل محبتهم وخلوصهم\n وأتيت أنت وهم بشيء يلوح منه الإشراك المنافي للتوحيد { لَيَحْبَطَنَّ عَمَلُكَ } وعملهم\n أي: ليضيعن ألبتة صالح عملك الذي جئبت به ليفيدك { وَلَتَكُونَنَّ } حينئذ { مِنَ ٱلْخَاسِرِينَ } [الزمر: 65] خسراناً مبيناً\n\n\nفعليك ألاَّ تصاحب مع المشركين\n ولا تقبل منهم قولهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:88",
      "similarity": 0.6944374482487204
    },
    {
      "verse": "3:22",
      "similarity": 0.6474699939885368
    },
    {
      "verse": "7:147",
      "similarity": 0.5947224624657705
    },
    {
      "verse": "47:9",
      "similarity": 0.5931163754273944
    },
    {
      "verse": "18:105",
      "similarity": 0.5299121824824227
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:65.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:65.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}