{
  "chapter": "الزمر",
  "text": "له مقاليد السموت والارض والذين كفروا۟ بـايت الله او۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "The keys of the heavens and earth belong to Him. It is those who reject Allah's Signs who are the losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has the keys of the heavens and the earth; and those who deny the revelations of God will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. It is those who disbelieve in Allah's Signs who will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In His hands are the keys of the treasuries of the heavens and the earth. Those who reject God's revelations will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Him only are the keys of the heavens and the earth; and those who denied the signs of Allah – it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the Maqalid of the heavens and the earth. And those who disbelieve in the Ayat of Allah, such are they who will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the treasures of the heavens and the earth; and (as for) those who disbelieve in the communications of Allah, these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unto Him belong the keys of the heavens and the earth. And those who disbelieve in the signs of God, those they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth, and they who disbelieve the revelations of Allah - such are they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the keys of the heavens and the earth belong to Him. Those who deny God's revelations will surely be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth and those who disbelieve in the revelations of Allah-those! they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth, and those who disbelieve in the signs of Allah—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth: and those who reject the Signs of Allah,- it is they who will be in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. And those who disbelieve in the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah, such are they who will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. Those who disbelieve in the verses of Allah they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the reins of the heavens and the earth. But those who blaspheme against the revelations of God—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah - it is those who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:63] To Him belong the keys of the heavens and the earth, in other words, the keys to their storehouses of rain and vegetation and other things. And those who disbelieve in the signs of God, [such as] the Qur’ān — those, they are the losers (ūlā’ika humu’l-khāsirūna is semantically connected to His words wayunajjī’Llāhu’lladhīna ittaqaw, ‘and God will deliver those who guarded themselves …’ to the end [of that statement]; the intervening statements are parentheticals).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(His are the keys) the stores (of the heavens) rain (and the earth) vegetation, (and they who disbelieve the revelations of Allah) i.e. Muhammad (pbuh) and the Qur'an (such are they who are the losers) in the Hereafter, for they will be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه المفاتيحُ\n واحدُها مَقليدٌ\n ويقال لها الأَقاليدُ\n واحدُها إقليدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the keys of the heavens and the earth} means the keys of knowledge.\n\n\nOne of them is a maqalid.\n\n\nIt is said of her that she is {aqalid} (intellectually precocious).\n\n\nOne of them is a eunuch.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { له مقاليد السموات والأرض } هو وحده يملك خزائن غيوبها وأبواب خيرها وبركتها\n يفتح لمن يشاء بأسمائه الحسنى\n إذ كل اسم من أسمائه مفتاح لخزانة من خزائن جوده لا ينفتح بابها إلا به\n فيفيض عليه ما فيها من فيض رحمته العامة والخاصة ونعمته الظاهرة والباطنة\n { والذين كفروا بآيات الله } أي: حجبوا عن أنوار صفاته وأفعاله بظلمات طباعهم ونفوسهم { أولئك هم الخاسرون } الذين لا نصيب لهم من تلك الخزائن لإطفائهم النور الأصلي القابل لها\n وتضييعهم الاستعداد الفطري\n والاسم الذي يفتح به مقاليدها\n { قل أفغير الله تأمروني أعبد } بالجهل\n فأحتجب عن فيض رحمته ونور كماله\n فأكون { من الخاسرين } بل خصص العبادة بالله موحداً فانياً فيه عن رؤية الغير إن كنت تعبد شيئاً { وكن من الشاكرين } به له\n { وما قدروا الله حق قدره } أي: ما عرفوه حق معرفته إذ قدروه في أنفسهم وصوّروه وكل ما يتصوّرونه فهو مجعول مثلهم { والأرض جميعاً قبضته } أي: تحت تصرّفه وقبضة قدرته وقهر ملكوته { والسموات } في طيّ قهره ويمين قوته يصرفها كيف يشاء ويفعل بها ما يشاء\n يطويها وينفيها عن شهود الشاهد يوم القيامة الكبرى\n والفناء في التوحيد لفناء الكل حينئذ في شهود التوحيد\n وكل تصرّف تراه بيمينه ولك صفة تراها صفته\n ويرى عالم القدرة بيمينه\n بل كل شيء عينه فلا يرى غيره بل يرى وجهه\n فلا عين ولا أثر لغيره { سحانه وتعالى عمّا يشركون } بإثبات الغير وتأثيره وقدرته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { لَّهُ } وفي قبضة قدرته { مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: مفاتيح العلويات والسفليات\n وما يتولى بينهما\n ويتصرف فيهما بالإرادة والاختيار\n ما شاء بلا منازع ومخاصم { وَٱلَّذِينَ كَفَرُواْ بِـآيَاتِ ٱللَّهِ } وأنكروا دلائل توحيده واستقلاله في الآثار الصادرة منه سبحانه باختياره { أُوْلَـٰئِكَ } الأشقياء الضالون عن طريق التوحيد\n المنحرفون عن جادة العدالة { هُمُ ٱلْخَاسِرُونَ } [الزمر: 63] المقصورون على الخسران والحرمان\n لا يُرجى نجاتهم منه أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { له مقاليدُ السماواتِ والأرضِ } أي: مفاتح خزائنها\n واحدها \" مِقْليد \" \n أو: إقليد\n أو: لا واحد لها\n وأصلها فارسية\n والمراد: أنه مالكها وحافظها\n وهو من باب الكناية لأن حافظ الخزائن ومدبّر أمرها هو الذي يملك مقاليدها\n ومنه قولهم: فلان ألقيتْ إليه مقاليد الملك\n أي: مفاتح التصرف قد سُلّمت إليه\n وفيه مزيد دلالة على الاستقلال والاستبداد لأن الخزائن لا يدخلها ولا يتصرف فيها إلا مَن بيده مفاتحها\n وعن عثمان: أنه سأل النبي صلى الله عليه وسلم عن المقاليد\n فقال صلى الله عليه وسلم:\n \" هي لا إله إلا الله\n والله أكبر\n وسبحان الله وبحمده\n أستغفر الله\n ولا حول ولا قوة إلا بالله العلي العظيم\n هو الأول والآخر\n والظاهر والباطن\n بيده الخير\n يُحيي ويُميت وهو على كل شيء قدير \" \nومعناه: أن لله هذه الكلمات\n يُوحّد بها ويُمجّد\n وهي مفاتحُ خير السماوات والأرض\n ومَن تكلّم بها أدرك ذلك في الدنيا أو في الآخرة\n ومرجعها إلى التحقق بالعبودية في الظاهر\n ومعرفة الذات في الباطن\n وهما السبب في كل خير\n وبهما يدرك العبد التصرُّف في الوجود بأسره\n فتأمله\n { والذين كفروا بآيات الله } أي: كفروا به بعد كونه خالق كل شيء\n ومتصرفاً في ملكه كيف يشاء\n بيده مقاليد العالم العلوي والسفلي\n فكفروا بعد هذا بآياته التكوينية\n المنصوبة في الآفاق وفي الأنفس\n والتنزيلية\n التي من جملتها هذه الآيات الناطقة بذلك\n { أولئك هم الخاسرون } خسراناً لا خسرَ وراءه\n وقيل: هو متصل بقوله: { ويُنجي الله الذين اتقوا } \n وما بينهما اعتراض\n { قُلْ أفغير الله تأمروني أعبدُ أيها الجاهلون } به\n وكانوا يقولون له: أسلِم لبعض آلهتنا نؤمن بإلهك لفرط جهالتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:12",
      "similarity": 0.8490208959141664
    },
    {
      "verse": "5:97",
      "similarity": 0.5736720606622316
    },
    {
      "verse": "5:2",
      "similarity": 0.3338968395516141
    },
    {
      "verse": "29:52",
      "similarity": 0.14274030981066718
    },
    {
      "verse": "10:95",
      "similarity": 0.133260039811907
    }
  ]
}