{
  "chapter": "الزمر",
  "text": "له مقاليد السموت والارض والذين كفروا۟ بـايت الله او۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "The keys of the heavens and earth belong to Him. It is those who reject Allah's Signs who are the losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has the keys of the heavens and the earth; and those who deny the revelations of God will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. It is those who disbelieve in Allah's Signs who will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In His hands are the keys of the treasuries of the heavens and the earth. Those who reject God's revelations will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Him only are the keys of the heavens and the earth; and those who denied the signs of Allah – it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the Maqalid of the heavens and the earth. And those who disbelieve in the Ayat of Allah, such are they who will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the treasures of the heavens and the earth; and (as for) those who disbelieve in the communications of Allah, these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unto Him belong the keys of the heavens and the earth. And those who disbelieve in the signs of God, those they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth, and they who disbelieve the revelations of Allah - such are they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the keys of the heavens and the earth belong to Him. Those who deny God's revelations will surely be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth and those who disbelieve in the revelations of Allah-those! they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth, and those who disbelieve in the signs of Allah—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth: and those who reject the Signs of Allah,- it is they who will be in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. And those who disbelieve in the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah, such are they who will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. Those who disbelieve in the verses of Allah they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the reins of the heavens and the earth. But those who blaspheme against the revelations of God—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah - it is those who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:63] To Him belong the keys of the heavens and the earth, in other words, the keys to their storehouses of rain and vegetation and other things. And those who disbelieve in the signs of God, [such as] the Qur’ān — those, they are the losers (ūlā’ika humu’l-khāsirūna is semantically connected to His words wayunajjī’Llāhu’lladhīna ittaqaw, ‘and God will deliver those who guarded themselves …’ to the end [of that statement]; the intervening statements are parentheticals).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ وَالَّذِينَ كَفَرُوا بِآَيَاتِ اللَّهِ أُولَئِكَ هُمُ الْخَاسِرُونَ (63)هذا استئناف ابتدائي تمهيد لقوله : { قُل أفغير الله تأمروني أعبُد } \\[ الزمر : 64 \\] في ذكر تمسك الرسول والرسللِ من قبله بالتوحيد ونبذِ الشرك والبراءةِ منه والتصلببِ في مقاومته والتصميممِ على قطع دابره ، وجُعلت الجمل الثلاث من قوله : الله خالق كل شيء } إلى قوله : { السموات والأرض } مقدمات تؤيد ما يجيء بعدها من قوله : { قُل أفغير الله تأمروني أعبُد } \\[ الزمر : 64 \\] .وقد اشتمل هذا الاستئناف ومعطوفاته على ثلاث جمل وجملة رابعة :فالجملة الأولى : { الله خالق كل شيء } وهذه الجملة أَدْخَلت كل موجود في أنه مخلوق لله تعالى ، فهو وليّ التصرف فيه لا يخرج من ذلك إلاّ ذاتُ الله تعالى وصفاته فهي مخصوصة من هذا العموم بدليل العقل وهو أنه خالق كل شيء فلو كان خالقَ نفسه أو صفاتِه لزم توقف الشيء على ما يتوقف هُو عليه وهذا ما يسمى بالدَّوْر في الحكمة ، واستحالتُه عقلية ، فخُص هذا العموم العقل . والمقصود من هذا إثبات حقيقة ، والزامُ الناس بتوحيده لأنه خالقهم ، وليس في هذا قصد ثناء ولا تعاظم ، والمقصود من هذه المقدمة تذكير الناس بأنهم جميعاً هم وما معهم عبيد لله وحده ليس لغيره منّة عليهم بالإِيجاد .الجملة الثانية : { وهو على كل شيء وكيل } وجيء بها معطوفة لأن مدلولها مغاير لمدلول التي قبلها . والوكيلُ المتصرف في شيء بدون تعقب ولما لم يعلّق بذلك الوصف شيءٌ علم أنه موكول إليه جِنس التصرف وحقيقتُه التي تعم جميع أفراد ما يتصرف فيه ، فعم تصرفه أحوالَ جميع الموجودات من تقدير الأعمال والآجال والحركاتتِ ، وهذه المقدمة تقتضي الاحتياج إليه بالإِمداد فهم بعد أن أوجدهم لم يستغنوا عنه لَمحةً مّا .الجملة الثالثة : { لَهُ مقَاليدُ السمواتتِ والأرض } وجيء بها مفصولة لأنها تفيد بيان الجملة التي قبلها فإن الوكيل على شيء يكون هو المتصرف في العطاء والمنع .والمقاليد : جمع إِقليد بكسر الهمزة وسكون القاف وهذا جمع على غير قياس ، وإقليد قيل معرب عن الفارسية ، وأصله ( كليد ) قيل من الرومية وأصله ( اقليدس ) وقيل كلمة يمانية وهو مما تقاربت فيه اللغات وهي كناية عن حفظ ذخائرها ، فذخائر الأرض عناصرها ومعادنها وكيفيات أجوائها وبحارها ، وذخائرُ السماوات سَير كواكبها وتصرفات أرواحها في عوالمها وعوالمنا وما لا يعلمه إلا الله تعالى . ولما كانت تلك العناصر والقُوى شديدة النفع للناس وكان الناس في حاجة إليها شبهت بنفائس المخزونات فصحّ أيضاً أن تكون المقاليد استعارة مكنية ، وهي أيضاً استعارة مصرحة للأمر الإِلهي التكويني والتسخيري الذي يُفيض به على الناس من تلك الذخائر المدَّخَرة كقوله تعالى : { وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم } \\[ الحجر : 21 \\] .وهذه المقدمة تشير إلى أن الله هو معطي ما يشاء لمن يشاء من خلقه ، ومن أعظم ذلك النبوءة وهديُ الشريعة فإن جهل المشركين بذلك هو الذي جرَّأَهم على أن أنكروا اختصاص محمد صلى الله عليه وسلم بالرسالة دونهم ، واختصاص أتباعه بالهُدى فقالوا :{ أهؤلاء مَنَّ الله عليهم مِنْ بيننا } \\[ الأنعام : 53 \\] . فهذه الجمل اشتملت على مقدمات ثلاث تقتضي كل واحدة منها دلالة على وحدانية الله بالخلق ، ثم بالتصرف المطلق في مخلوقاته ، ثم بوضع النظم والنواميس الفطرية والعقلية والتهذيبية في نظام العالم وفي نظام البشر . وكل ذلك موجب توحيده وتصديقَ رسوله صلى الله عليه وسلم والاستمساك بعروته كما رَشد بذلك أهل الإِيمان .فأما الجملة الرابعة وهي : { والذين كفروا بآيات الله أولئك هم الخاسرون } فتحتمل الاعتراض ولكن اقترانها بالواو بعد نظائرها يرجح أن تكون الواو فيها عاطفة وأنها مقصودة بالعطف على ما قبلها لأن فيها زيادة على مفاد الجملة قبلها ، وتكون مقدمة رابعة للمقصود تجهيلاً للذين هم ضد المقصود من المقدمات فإن الاستدلال على الحق بإبطال ضده ضرب من ضروب الاستدلال . لأن الاستدلال يعود إلى ترغيب وتنفير فإذا كان الذين كفروا بآيات الله خاسرين لا جرم كان الذين آمنوا بآيات الله هم الفائزين ، فهذه الجملة تقابل جملة { وينجي الله الذين اتقوا بمفازتهم } \\[ الزمر : 61 \\] المنتقل منها إلى هؤلاء الآيات ، وهي مع ذلك مفيدة إنذارهم وتأفين آرائهم ، لأن موقعها بعدَ دلائل الوحدانية وهي آيات دالّة على أن الله واحد يقتضي التنديدَ عليهم في عدم الاهتداء بها .ووُصف { الذين كفروا بآيات الله } بأنهم الخاسرون لأنهم كفروا بآيات مَن له مقاليد خزائن الخير فعرَّضوا أنفسهم للحرمان مما في خزائنه وأعظمها خزائن خير الآخرة .وآيات الله هي دلائل وجوده ووحدانيتِه التي أشارت إليها الجمل الثلاث السابقة .والإِخبار عن الذين كفروا باسم الإِشارة للتنبيه عن أن المشار إليهم خسروا لأجْللِ ما وصفوا به قبلَ اسممِ الإِشارة وهو الكفر بآيات الله . وتوسطُ ضمير الفصل لإِفادة حصر الخسارة فِيهم وهو قصر ادعائي بناء على عدم الاعتداد بخسارة غيرهم بالنسبة إلى خسارتهم فخسارتهم أعظم خسارة .\n\n",
      "translations": [
        {
          "translation": "(His are the keys) the stores (of the heavens) rain (and the earth) vegetation, (and they who disbelieve the revelations of Allah) i.e. Muhammad (pbuh) and the Qur'an (such are they who are the losers) in the Hereafter, for they will be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه المفاتيحُ\n واحدُها مَقليدٌ\n ويقال لها الأَقاليدُ\n واحدُها إقليدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the keys of the heavens and the earth} means the keys of knowledge.\n\n\nOne of them is a maqalid.\n\n\nIt is said of her that she is {aqalid} (intellectually precocious).\n\n\nOne of them is a eunuch.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { له مقاليد السموات والأرض } هو وحده يملك خزائن غيوبها وأبواب خيرها وبركتها\n يفتح لمن يشاء بأسمائه الحسنى\n إذ كل اسم من أسمائه مفتاح لخزانة من خزائن جوده لا ينفتح بابها إلا به\n فيفيض عليه ما فيها من فيض رحمته العامة والخاصة ونعمته الظاهرة والباطنة\n { والذين كفروا بآيات الله } أي: حجبوا عن أنوار صفاته وأفعاله بظلمات طباعهم ونفوسهم { أولئك هم الخاسرون } الذين لا نصيب لهم من تلك الخزائن لإطفائهم النور الأصلي القابل لها\n وتضييعهم الاستعداد الفطري\n والاسم الذي يفتح به مقاليدها\n { قل أفغير الله تأمروني أعبد } بالجهل\n فأحتجب عن فيض رحمته ونور كماله\n فأكون { من الخاسرين } بل خصص العبادة بالله موحداً فانياً فيه عن رؤية الغير إن كنت تعبد شيئاً { وكن من الشاكرين } به له\n { وما قدروا الله حق قدره } أي: ما عرفوه حق معرفته إذ قدروه في أنفسهم وصوّروه وكل ما يتصوّرونه فهو مجعول مثلهم { والأرض جميعاً قبضته } أي: تحت تصرّفه وقبضة قدرته وقهر ملكوته { والسموات } في طيّ قهره ويمين قوته يصرفها كيف يشاء ويفعل بها ما يشاء\n يطويها وينفيها عن شهود الشاهد يوم القيامة الكبرى\n والفناء في التوحيد لفناء الكل حينئذ في شهود التوحيد\n وكل تصرّف تراه بيمينه ولك صفة تراها صفته\n ويرى عالم القدرة بيمينه\n بل كل شيء عينه فلا يرى غيره بل يرى وجهه\n فلا عين ولا أثر لغيره { سحانه وتعالى عمّا يشركون } بإثبات الغير وتأثيره وقدرته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { لَّهُ } وفي قبضة قدرته { مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: مفاتيح العلويات والسفليات\n وما يتولى بينهما\n ويتصرف فيهما بالإرادة والاختيار\n ما شاء بلا منازع ومخاصم { وَٱلَّذِينَ كَفَرُواْ بِـآيَاتِ ٱللَّهِ } وأنكروا دلائل توحيده واستقلاله في الآثار الصادرة منه سبحانه باختياره { أُوْلَـٰئِكَ } الأشقياء الضالون عن طريق التوحيد\n المنحرفون عن جادة العدالة { هُمُ ٱلْخَاسِرُونَ } [الزمر: 63] المقصورون على الخسران والحرمان\n لا يُرجى نجاتهم منه أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { له مقاليدُ السماواتِ والأرضِ } أي: مفاتح خزائنها\n واحدها \" مِقْليد \" \n أو: إقليد\n أو: لا واحد لها\n وأصلها فارسية\n والمراد: أنه مالكها وحافظها\n وهو من باب الكناية لأن حافظ الخزائن ومدبّر أمرها هو الذي يملك مقاليدها\n ومنه قولهم: فلان ألقيتْ إليه مقاليد الملك\n أي: مفاتح التصرف قد سُلّمت إليه\n وفيه مزيد دلالة على الاستقلال والاستبداد لأن الخزائن لا يدخلها ولا يتصرف فيها إلا مَن بيده مفاتحها\n وعن عثمان: أنه سأل النبي صلى الله عليه وسلم عن المقاليد\n فقال صلى الله عليه وسلم:\n \" هي لا إله إلا الله\n والله أكبر\n وسبحان الله وبحمده\n أستغفر الله\n ولا حول ولا قوة إلا بالله العلي العظيم\n هو الأول والآخر\n والظاهر والباطن\n بيده الخير\n يُحيي ويُميت وهو على كل شيء قدير \" \nومعناه: أن لله هذه الكلمات\n يُوحّد بها ويُمجّد\n وهي مفاتحُ خير السماوات والأرض\n ومَن تكلّم بها أدرك ذلك في الدنيا أو في الآخرة\n ومرجعها إلى التحقق بالعبودية في الظاهر\n ومعرفة الذات في الباطن\n وهما السبب في كل خير\n وبهما يدرك العبد التصرُّف في الوجود بأسره\n فتأمله\n { والذين كفروا بآيات الله } أي: كفروا به بعد كونه خالق كل شيء\n ومتصرفاً في ملكه كيف يشاء\n بيده مقاليد العالم العلوي والسفلي\n فكفروا بعد هذا بآياته التكوينية\n المنصوبة في الآفاق وفي الأنفس\n والتنزيلية\n التي من جملتها هذه الآيات الناطقة بذلك\n { أولئك هم الخاسرون } خسراناً لا خسرَ وراءه\n وقيل: هو متصل بقوله: { ويُنجي الله الذين اتقوا } \n وما بينهما اعتراض\n { قُلْ أفغير الله تأمروني أعبدُ أيها الجاهلون } به\n وكانوا يقولون له: أسلِم لبعض آلهتنا نؤمن بإلهك لفرط جهالتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:12",
      "similarity": 0.8490208959141664
    },
    {
      "verse": "5:97",
      "similarity": 0.5736720606622316
    },
    {
      "verse": "5:2",
      "similarity": 0.3338968395516141
    },
    {
      "verse": "29:52",
      "similarity": 0.14274030981066718
    },
    {
      "verse": "10:95",
      "similarity": 0.133260039811907
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039063.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039063.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}