{
  "chapter": "الزمر",
  "text": "وما قدروا۟ الله حق قدره والارض جميعا قبضته يوم القيمة والسموت مطويتۢ بيمينه سبحنه وتعلى عما يشركون",
  "translations": [
    {
      "translation": "They do not measure Allah with His true measure. The whole earth will be a mere handful for Him on the Day of Rising, the heavens folded up in His right hand. Glory be to Him! He is exalted above the partners they ascribe!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not esteem God as is rightly due to Him. The whole earth would be a fistful of His on the Day of Resurrection, and the heavens would be rolled up in His right hand. Too immaculate is He and too high for what they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not recognise the true worth of Allah. (Such is Allah's power that) on the Day of Resurrection the whole earth will be in His grasp, and the heavens shall be folded up in His Right Hand. Glory be to Him! Exalted be He from all that they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have not paid due respect to God. The whole earth will be gripped in His hands on the Day of Judgment and the heavens will be just like a scroll in His right hand. God is too Glorious and High to be considered equal to their idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they did not realise the importance of Allah as was His right; and on the Day of Resurrection, He will compress the lands and the heavens will be rolled up by His power; Purity and Supremacy are to Him, from all what they ascribe as partners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made not a just estimate of Allah such as is due to Him. And on the Day of Resurrection the whole of the earth will be grasped by His Hand and the heavens will be rolled up in His Right Hand. Glorified be He, and High be He above all that they associate as partners with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have not honored Allah with the honor that is due to Him; and the whole earth shall be in His grip on the day of resurrection and the heavens rolled up in His right hand; glory be to Him, and may He be exalted above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They measure not God with His true measure. The earth altogether shall be His handful on the Day of Resurrection, and the heavens shall be rolled up in His right hand. Glory be to Him! High be He exalted above that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they esteem not Allah as He hath the right to be esteemed, when the whole earth is His handful on the Day of Resurrection, and the heavens are rolled in His right hand. Glorified is He and High Exalted from all that they ascribe as partner (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No just estimate have they made of God, such as is due to Him. But on the Day of Resurrection, the whole earth will lie within His grasp, while heaven will be folded up in His right hand -- Glory be to Him! Exalted is He above all that they associate with Him --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they estimated not Allah with an estimation due Unto Him whereas the whole earth shall be His handful on the Day of Judgment, and the heavens shall be rolled in His right hand. Hallowed be He and Exalted above that which they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not regard Allah with the regard due to Him, yet the entire earth will be in His fist on the Day of Resurrection, and the heavens, scrolled, in His right hand. Immaculate is He and exalted above [having] any partners that they ascribe [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No just estimate have they made of Allah, such as is due to Him: On the Day of Judgment the whole of the earth will be but His handful, and the heavens will be rolled up in His right hand: Glory to Him! High is He above the Partners they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They made not a just estimate of Allah such as is due to Him. And on the Day of Resurrection the whole of the earth will be grasped by His Hand and the heavens will be rolled up in His Right Hand. Glorified is He, and High is He above all that they associate as partners with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have not valued Allah with His true value. But on the Day of Resurrection, the entire earth will be in His grip, and the heavens shall be rolled up upon in His Right. Exaltations to Him! Exalted high is He above all that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have not esteemed God as He ought to be esteemed. The entire earth will be in His grip on the Day of Resurrection, and the heavens will be folded in His righ. Immaculate is He, and Transcendent He is beyond the associations they make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:67] And they do not esteem God as He should be esteemed, they do not understand His true nature, or [it means] that they do not exalt Him with the exaltation truly worthy of Him, when they associate others with Him. And the entire earth (jamī‘an is a circumstantial qualifier) in other words, the seven [earths], will be in His grasp, in other words, it shall be grasped by Him, meaning [that it will be] in His possession and at His disposal, on the Day of Resurrection, and the heavens will be rolled up, brought together, in His Right Hand, by His power. Glory be to Him! And exalted be He above what they associate!, with Him [of partners].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they esteem not Allah as He hath the right to be esteemed) they do not magnify Allah as He should be magnified when they say: \"Allah's Hands are tight\", \"Allah is poor and is requesting a loan from us\", the latter being what the Jew Malik Ibn al-Sayf, may Allah forsake him, said, (when the whole earth is His handful) when the whole earth is in His possession (on the Day of Resurrection, and the heavens are rolled in His right hand) and the heavens are rolled by His power on the Day of Resurrection. Knowing that both Hands of Allah, Exalted is He, are right. (Glorified is He) Allah exonerated Himself from the claim of the Jews (and High Exalted) He is free and far elevated (from all that they ascribe as partner (unto Him)) of partners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلسَّمَٰوَٰتُ مَطْوِيَّاتٌ بِيَمِينِهِ } معناه مَفنياتٌ بقدرتِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: المشركون الذين اتخذوا أولياء من دونه سبحانه، وادعوا الوجود له وشركتهم معه سبحانه { مَا قَدَرُواْ ٱللَّهَ } أي: ما وسعوا الحق باعتبار ظهوره بهذا الاسم المخصوص المستجمع لجميع الأسماء والصفات، والمعبر به عن الذات الأحدية كاسمه العليم، لذلك لم يعرفوا { حَقَّ قَدْرِهِ } وقدر ظهوره وبطونه، ولو وسعوا له، وعرفوا حق قدره، لما أثبتوا له شريكاً؛ إذ كل من تحقق بوحدة الحق وكيفية سريانه على هياكل الأظلال والعكوس والمنعكسة، ولم يبقَ عنده شائبة شك في ألاَّ تعدد في ذاته سبحانه، ولا تكثر بل يتجلى ويتجدد في كل آن بشأن، ولا شك أن كل ما ظهر من الشئون فان\n\n[الرحمن: 27]\n\n\n\n\n{ وَ } من جملة ما انعكس من بعض شئونه سبحانه { ٱلأَرْضُ جَمِيعـاً } أي: جميع ما يتولد من الطبيعة والهيولي المنعكسة من التجليات الإلهية حسب اقتضاء أسمائه الحسنى وصفاته العليا، فيها { قَبْضَـتُهُ } أي: مقبوضة في كفِّ قدرته { يَوْمَ ٱلْقِيَـٰمَةِ } التي هي الطامة الكبرى التي انقهرت دونها أظلال السوى مطلقاً، مندكة في نفسها، معدومة في حد ذاتها، لا وجود لها { وَ } كذا { ٱلسَّمَٰوَٰتُ } حينئذ { مَطْوِيَّاتٌ } معطلات عن مقتضياتها التي هي الأفعال والحركات، ساقطات في زاية العدم على ما كانت عليها مقتضياتها التي هي الأفعال والحركات، ساقطات في زاوية العدم على ما كانت عليها أزلاً وأبداً؛ أي: تنزه ذاته وتقدسمت أساؤه { بِيَمِينِهِ } وقدرته { سُبْحَانَهُ وَتَعَالَىٰ } شأنه { عَمَّا يُشْرِكُونَ } [الزمر: 67] له غيره ظلماً وزرواً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما قَدرُوا اللهَ حقَّ قَدْرِه } أي: ما عظَّموه حق تعظيمه حيث جعلوا له شريكاً، أو وصفوه بما لا يليق بشؤونه الجليلة، أو: حيث دعوك إلى عبادة غيره تعالى، أو: ما عرفوه حق معرفته، حيث لم يؤمنوا بقدرة الله تعالى\n قال ابن عباس: فمَن آمن أن الله على كل شيء قدير، فقد قدر الله حق قدره\n يقال: قدرت الشيء: إذا حزرته لتعرف مبْلغه، والقدر: المقدار\n والضمير، إما لقريش، المحدث عنهم، وقيل: لليهود، حيث تكلّموا في صفات الله تعالى، فألحدوا وجسّموا\n ثم بيَّن لهم شيئاً من عظمته تعالى، فقال: { والأرضُ جميعاً قبضَتُه يومَ القيامةِ والسماواتُ مطويات بيمينهِ }: فـ \" جميعاً \": حال من الأرض لأنه بمعنى الأرضين، أي: والأرضون جميعاً مقبوضة له بقدرته يوم القيامة\n { والسماوات مطويات بيمينه } أي: بقدرته\n والقبضة: المرة من القبض، والقُبْضة: المقدار المقبوض بالكف، والمراد من الكلام: تصوير عظمته تعالى، والتوقيف على كنه جلاله، وأن تخريب هذا العالم هو عليه شيء هين، على طريقة التمثيل والتخييل، من غير اعتبار القبضة واليمين حقيقة، ولا مجازاً، هكذا قال جمهور المفسرين\n قلت: لا يبعد أن تحمل الآية على ظاهرها، فإن الله تعالى يُبدل الأرض ويجمعها بأجمعها، فتكون كخبزة النقي، ويطوي السماء كطي الكتاب، حتى يبرز العرش، كما في الحديث، ففي حديث البخاري، عن أبي سعيد الخدري، قال النبي صلى الله عليه وسلم:\n\n \" تكون الأرضُ يومَ القيامة خبزةً واحدةً، يتكفؤُها الجبارُ بيده، كما يتكفؤُ أحدُكم خُبْزَته في السفر، نُزُلاً لأهل الجنة \" \n\nوفي حديث أبي هريرة:\n\n \" إن الله يقبض الأرض، ويطوي السماء بيمينه، ثم يقول: أنا الملك، أين ملوك الأرض \"\n \n\nوقال ابن عمر: رأيت النبي صلى الله عليه وسلم قائماً على المنبر، وهو يحكي عن ربه تعالى، فقال:\n\n \" إن الله تعالى إذا كان يوم القيامة، جمع السماوات والأرضين السبع في قبضته، ثم قال هكذا، وشدّ قبضته، ثم بسطها، ثم يقول: أنا الله، أنا الرحمن\n\n\n \" \n\nالحديث\n وفي لفظ آخر:\n\n \" يطوي الله السماوات يوم القيامة، ثم يأخذهن بيده اليمنى، ثم يقول: أنا الملك، أين الجبارون أين المتكبرون؟ \" \n",
      "translations": []
    }
  ]
}