{
  "chapter": "الزمر",
  "text": "ونفخ فى الصور فصعق من فى السموت ومن فى الارض الا من شاء الله ثم نفخ فيه اخرى فاذا هم قيام ينظرون",
  "translations": [
    {
      "translation": "The Trumpet will be blown and those in the heavens and those in the earth will all lose consciousness, except those Allah wills. Then it will be blown a second time and at once they will be standing upright, looking on.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the trumpet blast is sounded whoever is in the heavens and the earth will swoon away, except those God please. When the blast is sounded the second time, they will stand up all expectant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet shall be blown and all who are in the heavens and the earth shall fall down dead save those whom Allah wills. Then the Trumpet shall be blown again, and lo! all of them will be standing and looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone in the heavens and the earth will faint in terror except for those whom God will save when the trumpet is sounded. They will all stand up and wait when the trumpet sounds for the second time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown, so everyone in the heavens and everyone in the earth will fall unconscious, except whomever* Allah wills; it will then be blown again, thereupon they will get up staring! (*Prophet Moosa and / or some angels).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown, and all who are in the heavens and all who are on the earth will swoon away, except him whom Allah wills. Then it will be blown another time, and behold they will be standing, looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the trumpet shall be blown, so all those that are in the heavens and all those that are in the earth shall swoon, except such as Allah please; then it shall be blown again, then lo! they shall stand up awaiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the Trumpet shall be blown, and whosoever is in the heavens and whosoever is in the earth shall swoon, save whom God wills. Then it shall be blown again, and lo, they shall stand, beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the trumpet is blown, and all who are in the heavens and all who are in the earth swoon away, save him whom Allah willeth. Then it is blown a second time, and behold them standing waiting!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Trumpet shall be blown and whoever is in heaven and whoever is on earth will fall down in a swoon, except those who shall be spared by God. Then the trumpet will be blown again and they shall rise and gaze around them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the trumpet will be blown, when whosoever are in the heavens and whosoever are on the earth will swoon away, save him whomsoever Allah willeth. Then it shall be blown again, and lo! They will be standing, looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown, and whoever is in the heavens will swoon and whoever is on the earth, except whomever Allah wishes. Then it will be blown a second time, behold, they will rise up, looking on!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Trumpet will (just) be sounded, when all that are in the heavens and on earth will swoon, except such as it will please Allah (to exempt). Then will a second one be sounded, when, behold, they will be standing and looking on!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be blown, and all who are in the heavens and all who are on the earth will swoon away, except him whom Allah will. Then it will blown a second time and behold, they will be standing, looking on (waiting).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Horn shall be blown and all who are in heavens and earth shall swoon, except those whom Allah wills. Then, the Horn will blow again and they shall stand and gaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Trumpet will be sounded, whereupon everyone in the heavens and the earth will be stunned, except whomever God wills. Then it will be sounded another time, whereupon they will rise up, looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:68] And the Trumpet will be blown, for the First Blast, and whoever is in the heavens and whoever is in the earth will swoon, will die, except whomever God wills, such as the houris, the beautiful youths [of Paradise] and others. Then it will be blown again, and behold, they, that is, all creatures who are dead, will rise up, looking on, waiting to see what will be done with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the trumpet is blown) this is the blowing of death, (and all who are in the heavens and the earth swoon away) die, (save him whom Allah willeth) except those who are in Paradise or hell; it is also said this means: except Gabriel, Michael, Seraphiel and the angel of death who will not die upon the first blowing of the Trumpet but will die later. (Then it is blown a second time) which is the blowing of the Resurrection. This will happen 40 years after the first blow of the Trumpet and then the sky will rain something like men's sperm drops, (and behold them standing) from the grave (waiting) for what they will be told!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَصَعِقَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلأَرْضِ } معناه ماتَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ونفخ في الصور } عند الإماتة بسريان روح الحق وظهوره في الكل وشهود ذاته بذاته وفناء الكل فيه { فصعق } أي: هلك { من في السموات ومن في الأرض } حال الفناء في التوحيد وظهور الهوية بالنفخة الروحية { إلاّ من شاء الله } من أهل البقاء بعد الفناء الذين أحياهم الله بعد الفناء بالوجود الحقاني فلا يموتون في القيامة كرّة أخرى لكون حياتهم به وفنائهم عن أنفسهم من قبل { ثم نفخ فيه أخرى } عند البقاء بعد الفناء والرجوع إلى التفصيل بعد الجمع { فإذا هم قيام } بالحق { ينظرون } بعينه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل للمشركين يوم { نُفِخَ فِي ٱلصُّورِ } لرد الأمانات التي هي الوجودات المترشحة من بحر الذات على هياكل الهوايات { فَصَعِقَ } أي: خرَّ وسقط مغشياً من فزعه { مَن فِي ٱلسَّمَٰوَٰتِ } أي: جميع العلويات { وَمَن فِي ٱلأَرْضِ } أي: جميع السلفيات خوفاً من انقطاع الأمور الإلهية بمقتضى النفس الرحماني { إِلاَّ مَن شَآءَ ٱللَّهُ } من المعتبرين الفانين في الله، الباقين ببقائه، فإنهم قد قامت قيامتهم { ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ } إيقاظاً لهم عن سنة الغفلة ونعاس النسيان { فَإِذَا هُمْ قِيَامٌ } أي: فاجؤوا على القيام، بعدما صاروا مغشياً عليهم { يَنظُرُونَ } [الزمر: 68] حينئذ حيارى سكارى مبهوتين هائمين، كأنهم صرعى مخبولين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ونُفخ في الصُّورِ } النفخة الأولى { فصَعِقَ مَنْ في السماوات ومَنْ في الأرض } أي: خرّ ميتاً، أو مغشياً عليه، { إِلا مَن شاء اللهُ } قيل: جبريل وميكائيل وإسرافيل وملك الموت، ثم يُميتهم الله بعد ذلك، وقيل: حمَلَة العرش، وقيل: خزَنة النار والجنة\n { ثم نُفخ فيه أُخرى } هي النفخة الثانية\n و \" أخرى \": في محل الرفع صفة لمحذوف، أي: نفخ نفخة أخرى، { فإِذا هم قيام } من قبورهم، حال كونهم إذا فاجأهم خطب { ينظرون } يُقلبون أبصارهم في الجوانب الأربعة، كالمبهوتين، أو: ينظرون ما يفعل بهم، ودلت الآية على أن النفخة اثنتان للموت، والبعث، وقيل: ثلاث للفزع، والموت، والبعث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:13",
      "similarity": 0.6233656598448631
    },
    {
      "verse": "50:20",
      "similarity": 0.6194506905786105
    },
    {
      "verse": "6:73",
      "similarity": 0.5538361464891227
    },
    {
      "verse": "52:45",
      "similarity": 0.521082736364309
    },
    {
      "verse": "2:55",
      "similarity": 0.4747184562423724
    }
  ]
}