{
  "chapter": "الزمر",
  "text": "وسيق الذين كفروا۟ الى جهنم زمرا حتى اذا جاءوها فتحت ابوبها وقال لهم خزنتها الم ياتكم رسل منكم يتلون عليكم ءايت ربكم وينذرونكم لقاء يومكم هذا قالوا۟ بلى ولكن حقت كلمة العذاب على الكفرين",
  "translations": [
    {
      "translation": "Those who are kafir will be driven to Hell in companies and when they arrive there and its gates are opened its custodians will say to them, 'Did Messengers from yourselves not come to you, reciting your Lord's Signs to you and warning you of the meeting on this Day of yours?' They will say, 'Indeed they did, but the decree of punishment is justly carried out against the kafirun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will be driven into Hell in groups till, when they reach it and its doors are opened up, its keepers will say to them: \"Did not apostles of your own come to you reciting your Lord's revelations, warning you of this your day of Doom?\" They will answer: \"Yes;\" but the sentence of punishment was justified against the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(After the judgement has been passed) the unbelievers shall be driven in companies to Hell so that when they arrive there, its gates shall be thrown open and its keepers shall say to them: “Did Messengers from among yourselves not come to you, rehearsing to you the Signs of your Lord and warning you against your meeting of this Day?” They will say: “Yes indeed; but the sentence of chastisement was bound to be executed against the unbelievers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers will be driven to hell in hordes. Its gates will be opened when they are brought nearby and the keepers will ask them, \"Did Messengers from your own people not come to you to recite your Lord's revelations and to warn you about this day?\" They will reply, \"Yes, the Messengers did come to us, but the unbelievers were doomed to face the torment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers will be herded towards hell in groups; to the extent that when they reach it, its gates will be opened, and its guards will say to them, “Did not the Noble Messengers come to you from amongst you, who used to recite to you the verses of your Lord and warn you of confronting this Day?” They will say, “Yes indeed, why not?” But the Word of punishment proved true upon the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved will be driven to Hell in groups till when they reach it, the gates thereof will be opened. And its keepers will say: \"Did not the Messengers come to you from yourselves, reciting to you the Ayat of your Lord, and warning you of the meeting of this Day of yours\" They will say: \"Yes,\" but the Word of torment has been justified against the disbelievers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve shall be driven to hell in companies; until, when they come to it, its doors shall be opened, and the keepers of it shall say to them: Did not there come to you apostles from among you reciting to you the communications of your Lord and warning you of the meeting of this day of yours? They shall say: Yea! But the sentence of punishment was due against the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the unbelievers shall be driven in companies into Gehenna till, when they have come thither, then its gates will be opened and its keepers will say to them, 'Did not Messengers come to you from among yourselves, reciting to you the signs of your Lord and warning you against the encounter of this your day?' They shall say, 'Yes indeed; but the word of the chastisement has been realized against the unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve are driven unto hell in troops till, when they reach it and the gates thereof are opened, and the warders thereof say unto them: Came there not unto you messengers of your own, reciting unto you the revelations of your Lord and warning you of the meeting of this your Day? they say: Yea, verily. But the word of doom of disbelievers is fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who rejected the truth will be led to Hell in throngs. When they reach it, its gates will be opened and its keepers will say to them, \"Have messengers not come to you from among yourselves, who conveyed to you the revelations of your Lord and warned you about meeting [Him] on this Day?\" They will answer, \"Yes, they did come.\" But the decree of punishment has proved true against the deniers of the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will be driven onto Hell in troops till, when they arrive thereto, the portals thereof will be opened, and the keepers thereof will say Unto them: came there not Unto you apostles from amongst you, rehearsing Unto you the revelations of you Lord and warning you of the meeting of this your Day? They shall say: Yea, but the word of torment hath been justified on the Infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless will be driven to hell in throngs. When they reach it and its gates are opened, its keepers will say to them, ‘Did there not come to you [any] apostles from among yourselves, reciting to you the signs of your Lord and warning you of the encounter of this day of yours?’ They will say, ‘Yes, but the word of punishment became due against the faithless.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers will be led to Hell in crowd: until, when they arrive, there, its gates will be opened. And its keepers will say, \"Did not messengers come to you from among yourselves, rehearsing to you the Signs of your Lord, and warning you of the Meeting of This Day of yours?\" The answer will be: \"True: but the Decree of Punishment has been proved true against the Unbelievers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved will be driven to Hell in groups, till, when they reach it, the gates thereof will be opened (suddenly like a prison at the arrival of the prisoners). And its keepers will say, \"Did not the Messengers come to you from yourselves, reciting to you the Verses of your Lord, and warning you of the Meeting of this Day of yours?\" They will say: \"Yes, but the Word of torment has been justified against the disbelievers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In companies the unbelievers shall be driven into Gehenna. As they draw near, its gates will be opened and its keepers will ask them: 'Did there not come to you Messengers of your own, who recited to you the verses of your Lord and warned you of the encounter of this your Day' 'Yes indeed' they will answer. And the word of the punishment has been realized against the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved will be driven to Hell in throngs. Until, when they have reached it, and its gates are opened, its keepers will say to them, “Did not messengers from among you come to you, reciting to you the revelations of your Lord, and warning you of the meeting of this Day of yours?” They will say, “Yes, but the verdict of punishment is justified against the disbelievers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved will be driven to Hell in groups until, when they reach it, its gates are opened and its keepers will say, \"Did there not come to you messengers from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?\" They will say, \"Yes, but the word of punishment has come into effect upon the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:71] And those who disbelieve will be driven, violently, to Hell in troops, in separate groups, until, when they reach it, its gates are opened (futihat abwābuhā is the response to idhā, ‘when’) and its keepers will say to them, ‘Did there not come to you [any] messengers from among yourselves, reciting to you the signs of your Lord, the Qur’ān and otherwise, and warning you of the encounter of this day of yours?’ They will say, ‘Yes, indeed; but the word of chastisement — namely, the verse: Assuredly I will fill Hell … [Q. 11:119] — against the disbelievers has been fulfilled’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who disbelieve are driven unto hell in troops) in nations, the first nation first and then the next that came after it and so on and so forth (till, when they reach it) i.e. the Fire (and the gates thereof) and its different pathways (are opened) because prior to this they were closed, (and the warders thereof) i.e. the angels of the Fire (say unto them: Came there not unto you) group of disbelievers (messengers of your own) human beings like you, (reciting unto you the revelations of your Lord) which detail the commands and prohibitions (and warning you of the meeting) of the chastisement (of this your Day? They say Yea) they conveyed the message, (verily. But the word of doom for disbelievers is fulfilled) is ordained before that. 538\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَسِيقَ ٱلَّذِينَ كَـفَرُوۤاْ إِلَىٰ جَهَنَّمَ زُمَراً } معناه جماعاتٌ في تَفرقةٍ بعضُهم على إثر بعضٍ\n\n",
      "translations": [
        {
          "translation": "\nThe meaning of the saying of the Most High: {And those who disbelieve will be driven to Hell in groups} is that there will be groups in disunity, some of them following the other.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وسيق } المحجوبون { إلى جهنم } بسائق العمل وقائد الهوى النفسيّ والميل السفليّ { فتحت أبوابها } لشدّة شوقها إليهم وقبولها لهم لما بينهما من المناسبة { وقال لهم خزنتها } من مالك والزباينة\n أي: الطبيعة الجسمانية والملكوت الأرضية الموكلة بالنفوس السفلية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد ذلك { سِيقَ } سوق البهائم إلى المسلخ { ٱلَّذِينَ كَـفَرُوۤاْ } بالإعراض عن الحق وأهله { إِلَىٰ جَهَنَّمَ } الطرد والخذلان { زُمَراً } فوجاً بعد فوج\n وطائفة إثر طائفة { حَتَّىٰ إِذَا جَآءُوهَا } يعني: جنهم { فُتِحَتْ } لهم { أَبْوَابُهَا } أي: أبواب النيران المعدة لأهل الكفر والطغيان على تفاوت طبقاتهم فيه\n { وَقَالَ لَهُمْ خَزَنَتُهَآ } حينئذ على سبيل التوبيخ والتقريع: { أَلَمْ يَأْتِكُمْ } أيها الضالون المستحقون لهذا الوبال والنكال { رُسُلٌ مِّنكُمْ } أي: من بني نوعكم مبعوثون إليكم من قبل الحق { يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ } أي: دلائل توحيده\n وكمال قدرته على أنواع الإنعام والانتقام { وَيُنذِرُونَكُمْ لِقَـآءَ يَوْمِكُمْ هَـٰذَا } أي: يخوفونكم عن لقاء هذا اليوم الذي تدخلون فيه النار بأنواع الخيبة والخسران؟\n\n\nوبعدما سمعوا منهم ما سمعوا { قَالُواْ } متحسرين متأوهين: { بَلَىٰ } قد جاءت إلينا رسل ربنا بالحق\n وتلوا علينا آياته المشتملة على أنواع الإنذار والنذير { وَلَـٰكِنْ } لم يفد بنا إنذارهم وتبشيرهم\n إذ { حَقَّتْ } أي: صدرت وثبتت منه سبحانه في سباق قضائه وحضرة علمه حتماً { كَلِمَةُ ٱلْعَذَابِ } وهي قوله:\n[هود: 119] { عَلَى ٱلْكَافِرِينَ } [الزمر: 71] المعرضين عن الحق وآياته\n وعن من بلغها إليهم بإذنه\n لذلك أعرضنا عنها وعنهم\n فوجبت لنا النار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وسيق الذين كفروا إلى جهنم زُمراً } أي: تسوقهم الزبانية بالعنف والإهانة\n كما تساق الأسارى والخارجين على السلطان\n إذا سيقوا للقتل أو السجن\n فتسوقهم الزبانية إلى جهنم أفواجاً متفرقة\n بعضها إثر بعض\n حسب ترتُّب طبقاتهم في الضلالة والشرارة\n والزمر: جمع زمرة\n أي: الجماعة\n واشتقاقها من الزمر\n أي: الصوت\n والجماعة لا تخلو عنه\n  { حتى إذا جاؤوها فُتِحَتْ أبوابها } ليدخلوها\n وهي سبعة\n { وقال لهم خزنتُها } تقريعاً وتوبيخاً: { ألم يأتكم رسلٌ منكم } من جنسكم\n وقرىء: \" نُذُر منكم \" \n { يتلون عليكم آياتِ ربكم ويُنذرونكم لقاء يومكم هذا } أي: وقتكم هذا\n وهو وقت دخولهم النار\n وفيه دليل على أنه لا تكليف قبل الشرع\n من حيث إنهم علّلوا توبيخهم بإتيان الرسل وتبليغ الكتب\n { قالوا بلى } قد أتونا وأنذرونا\n { ولكن حقتْ كلمةُ العذاب على الكافرين } أي: ولكن وجبت علينا كلمة الله:\n[هود: 119] بسوء أعمالنا حيث كذَّبنا\n وقلنا ما نزّل الله من شيء\n إن أنتم إلا تكذبون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:73",
      "similarity": 0.8801157063537698
    },
    {
      "verse": "40:49",
      "similarity": 0.19013149296290563
    },
    {
      "verse": "63:7",
      "similarity": 0.17004227298305516
    },
    {
      "verse": "12:55",
      "similarity": 0.16073840767081846
    },
    {
      "verse": "15:21",
      "similarity": 0.15959762581226855
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/39:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/39:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}