{
  "chapter": "الزمر",
  "text": "قيل ادخلوا۟ ابوب جهنم خلدين فيها فبئس مثوى المتكبرين",
  "translations": [
    {
      "translation": "Enter the gates of Hell,\" they will be told, \"and there abide for ever.\" How grievous a destination for the haughty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said: “Enter the gates of Hell. Herein shall you abide.” How evil is the abode of the vainglorious!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told, \"Enter the gates of hell to live therein forever. What a terrible dwelling for the arrogant ones!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said, “Enter the gates of hell to remain in it forever”; so what a wretched destination for the haughty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said: \"Enter you the gates of Hell, to abide therein. And what an evil abode of the arrogant!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be said: Enter the gates of hell to abide therein; so evil is the abode of the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be said, 'Enter the gates of Gehenna, to dwell therein forever.' How evil is the lodging of those that are proud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is said (unto them): Enter ye the gates of hell to dwell therein. Thus hapless is the journey's end of the scorners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told, \"Enter the gates of Hell, to stay therein forever.\" What an evil dwelling place for the haughty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said: enter the portals Of Hell to be abiders therein. How ill, then, is the abode of the stiff-necked!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said, ‘Enter the gates of hell to remain in it [forever]. Evil is the [ultimate] abode of the arrogant.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(To them) will be said: \"Enter ye the gates of Hell, to dwell therein: and evil is (this) Abode of the Arrogant!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said (to them): \"Enter you the gates of Hell, to abide therein. And (indeed) what an evil abode of the arrogant!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said to them: 'Enter the gates of Gehenna and live there for ever' Evil is the lodging place of the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said, “Enter the gates of Hell, to abide therein eternally.” How wretched is the destination of the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[To them] it will be said, \"Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:72] It will be said, ‘Enter the gates of Hell to abide therein’ — decreed for you to abide [therein]. For evil [indeed] is the abode of the arrogant!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is said (unto them)) the angels of the Fire say to them: (Enter ye the gates of hell to dwell therein) forever. (Thus hapless is the journey's end of the scorners) it is the abode of those who felt too proud to accept faith in the Scripture and Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: أتوا بالعذر وما ينفعهم بل { قِيلَ } لهم من قبل الحق: { ٱدْخُلُوۤاْ } أيها الضالون المجرمون { أَبْوَابَ جَهَنَّمَ } أي: كل فرقة منهم بباب يخصها في سابق القضاء، وكونوا { خَالِدِينَ فِيهَا } لا نجاة لكم منها { فَبِئْسَ مَثْوَى ٱلْمُتَكَـبِّرِينَ } [الزمر: 72] أي: الكافرين المستكبرين وأهله جهنم الخذلان وجحيم الحرمان والخسران، أعاذنا الله وعموم المؤمنين منها بفضله العظيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}