{
  "chapter": "الزمر",
  "text": "وترى الملئكة حافين من حول العرش يسبحون بحمد ربهم وقضى بينهم بالحق وقيل الحمد لله رب العلمين",
  "translations": [
    {
      "translation": "You will see the angels circling round the Throne, glorifying their Lord with praise. It will be decided between them with truth. And it will be said: 'Praise be to Allah, the Lord of all the worlds.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see the angels hover round the Throne, singing the praises of their Lord; and justice will be done between them equitably, and it would be said: \"All praise to God the Lord of all the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall see the angels surrounding the Throne, glorifying their Lord with His praise, and judgement will have been made among them with fairness, and it will be proclaimed: “All praise and thanks be to Allah, the Lord of the whole Universe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), on that day you will see the angels circling around the Throne, glorifying and praising their Lord. Judgment with justice will be decreed between the people of Paradise and hell and it will be said, \"It is only God, Lord of the Universe who deserves all praise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the angels gathered around the Throne, saying the Purity of their Lord, with praise; and a true judgement will be delivered between the people, and it will be said, “All praise is to Allah, the Lord Of The Creation!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the angels surrounding the Throne from all round, glorifying the praises of their Lord. And they will be judged with truth. And it will be said, \"All the praises and thanks be to Allah, the Lord of all that exits.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall see the angels going round about the throne glorifying the praise of their Lord; and judgment shall be given between them with justice, and it shall be said: All praise is due to Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou shalt see the angels encircling about the Throne proclaiming the praise of their Lord; and justly the issue shall be decided between them; and it shall be said, 'Praise belongs to God, the Lord of all Being.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou (O Muhammad) seest the angels thronging round the Throne, hymning the praises of their Lord. And they are judged aright. And it is said: Praise be to Allah, the Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall see the angels circling about the throne, glorifying their Lord with praise. And judgement will have been passed in justice on all and it will be said, \"Praise be to God, Lord of the Universe!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt see the angels thronging round the Throne, hallowing the praise of their Lord. And judgment shall be given between them with truth: and it will be said: all praise Unto Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the angels surrounding the Throne, celebrating the praise of their Lord, and judgment will be made between them with justice, and it will be said, ‘All praise belongs to Allah, the Lord of all the worlds!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt see the angels surrounding the Throne (Divine) on all sides, singing Glory and Praise to their Lord. The Decision between them (at Judgment) will be in (perfect) justice, and the cry (on all sides) will be, \"Praise be to Allah, the Lord of the Worlds!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the angels surrounding the Throne (of Allah) from all round, glorifying the praises of their Lord (Allah). And they (all the creatures) will be judged with truth, and it will be said. All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall see the angels encircling the Throne exalting with the praise of their Lord. And the matter will be justly decided between them, and it shall be said: 'Praise belongs to Allah, Lord of all the Worlds'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the angels hovering around the Throne, glorifying their Lord with praise. And it will be judged between them equitably, and it will be said, “Praise be to God, Lord of the Worlds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see the angels surrounding the Throne, exalting [Allah] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise to Allah, Lord of the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:75] And you will see the angels encircling (hāffīna, a circumstantial qualifier) all round the Throne, from its every side, glorifying (yusabbihūn is a circumstantial qualifier referring to the person [of the participle] hāffīn) with praise of their Lord, continuously proclaiming [His] praise — in other words, saying subhāna’Llāhi wa-bihamdih, ‘Glory, and praise, be to God!’ — and judgement will be made between them, that is, between all creatures, with truth, in other words, [with] justice, so that believers enter Paradise while the disbelievers enter the Fire, and it will be said, ‘Praise be to God, the Lord of the Worlds!’ — the [final] establishing of both groups [in their respective abodes] is concluded with [this] angelic praise. Meccan, except for verses 56 and 57, which are Medinese; it consists of 85 verses, revealed after [sūrat] alZumar.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (75){ وَتَرَى الملائكة حَآفِّينَ مِنْ حَوْلِ العرش يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ } .عطف على ما قبله من ذكر أحوال يوم القيامة التي عطف بعضها على بعض ابتداء من قوله تعالى : { ونُفِخَ في الصُّورِ فَصَعق مَن في السموات ومَن في الأرض } \\[ الزمر : 68 \\] إن من جملة تلك الأحوال حَفّ الملائكة حول العرش .والخطاب للنبيء صلى الله عليه وسلم فيكون إيذاناً بأنها رؤية دنو من العرش وملائكته ، وذلك تكريم له بأن يكون قد حواه موكب الملائكة الذين حول العرش .والحَفُّ : الإِحداق بالشيء والكون بجوانبه .وجملة { يُسَبحون بحمد ربهم } حال ، أي يقولون أقوالاً تدل على تنزيه الله تعالى وتعظيمه مُلابِسَةً لحمدهم إياه . فالباء في { بحمد ربهم } للملابسة تتعلق ب { يسبحون } . وفي استحضار الله تعالى بوصف ربهم إيماء إلى أن قربهم من العرش ترفيع في مقام العبودية الملازمة للخلائق .{ رَبِّهِمْ وَقُضِىَ بَيْنَهُمْ } .تأكيد لجملة { وقُضِي بينهم بالحقِّ وهُم لا يُظلمون } \\[ الزمر : 69 \\] المتقدمةِ .{ بالحق وَقِيلَ الحمد لِلَّهِ رَبِّ } .يجوز أن يكون توكيداً لجملة { وقالوا الحَمْدُ لله الَّذي صَدَقنا وَعْده } \\[ الزمر : 74 \\] . ويجوز أن يكون حكاية قول آخر لقائلين من الملائكة والرسل وأهل الجنة ، فهو أعم من القول المتقدم الذي هو قول المسُوقين إلى الجنة من المتقين ، فهذا قولهم يحمدون الله على عدل قضائه وجميع صفات كماله ..\n\n",
      "translations": [
        {
          "translation": "(And thou (0 Muhammad) seest the angels thronging round the Throne, hymning the praises of their Lord) by the command of Allah. (And they are judged) and it is judged between the prophets and their nations (aright) with justice. (And it is said) to them after the end of reckoning, say: (Praise be to Allah) thanks and gratitude belong to Allah, (the Lord of the Worlds!) the Master of the jinn and human beings Who separated us apart from our enemies, this is the station of Ha Mim, and He is the Mighty, the Knower'. And of the surah in which the Believer is mentioned, which is all Meccan and consists of 82 verses, 1,199 words and 4,960 letters: Surah 40: The Believer (al-Mu'min , Ghafir) And of the surah in which the Believer is mentioned, which is all Meccan and consists of 82 verses, 1,199 words and 4,960 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَآفِّينَ مِنْ حَوْلِ ٱلْعَرْشِ } معناه محيطون بجوانبِهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They will stand around the Throne} means they will surround it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n حامدين ربّهم بالكمالات الروحانية { وقضى بينهم بالحق } بتسالمهم واتحادهم في التوجه نحو الكمال بنور العدل والتوحيد واختصاص كل بما حكم بالحق في تسبيحه من غير تخاصم وتنازع { وقيل } على لسان الأحدية { الحمد } المطلق في الحضرة الواحدية للذات الإلهية الموصوفة بجميع صفاتها { ربّ العالمين } مربيهم على حسب استعدادات الأشياء وأحوالها\n أو ملائكة النفوس والأرواح السماوية حافين في جنة الفردوس من حول عرش الفلك الأعظم\n يسبحون بحمد ربّهم باتصاف ذواتهم المجرّدة بالكمالات الربانية\n { وقُضِيَ بينهم بالحق } باختصاص كل بما حكم به الحق من الأفعال والكمالات\n وقيل على لسان الكل: الكمال المطلق لله ربّ العالمين\n وإن حملت القيامة على الصغرى فمعناه: وأرض البدن جميعاً قبضته\n يتصرّف فيها بقدرته ويقبضها عن الحركة ويمسكها عن الانبساط بالحياة وقت الموت وسموات الأرواح وقواها مطويات بيمينه ونفخ في الصور عند النفس الآخر فصعق من في السموات من القوى الروحانية ومن في الأرض من القوى النفسانية الطبيعية إلا من شاء الله من الحقيقة الروحانية واللطيفة الإنسانية التي لا تموت\n ثم نفخ فيه أخرى في النشأة الثانية بنور الحياة والاعتدال ووضع الكتاب\n أي: لوح النفس المنتقش فيه صور أعماله فتنتشر بظهور تلك النفوس عليه وجيء بالنبيين والشهداء من الذين اطلعوا على استعدادهم وأحوالهم بأن يحشروا معهم فيجازوا على حسب أعمالهم\n وقضي بينهم بالعدل وهم لا يظلمون\n وباقي التأويلات بحالها إلى آخر السورة والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأهل الجنة في الجنة { تَرَى } أيها المعتبر المنكشف بكمال عظمة الله وجلاله { ٱلْمَلاَئِكَةَ } أي: الأسماء والصفات الإلهية\n عبر عنها سبحانه بالملائكة المهيمين المستغرقين بمطالعة وجهه الكريم { حَآفِّينَ } صافين محدقين محلقين { مِنْ حَوْلِ ٱلْعَرْشِ } أي: حول عرشه العظيم المستغني عن عروش مطلق المظاهر\n والحال الكائنة في عالمي الغيب والشهادة\n إذ هو سبحانه غني بذاته عن مطلق التعينات الطارئة على شئونه وتطوراته\n لذلك { يُسَبِّحُونَ } وينزهون أولئك المهيمون ذاته سبحانه عن سمات الحدوث والإمكان مطلقاً دائماً\n ويواظبون { بِحَمْدِ رَبِّهِمْ } على ما وهب هلم المعرفة بعلو شأنه وسمو برهانه\n وباستغنائه في ذاته عن مظاهر أوصافه وأسمائه جميعاً { وَقُضِيَ بَيْنَهُمْ بِٱلْحَقِّ } أي: هم يحمدونه ويثنون عليه سبحانه أيضاً على عموم قضائه وحكمه\n وأحكامه الجارية بين عباده بمقتضى العدل القويم\n\n\n{ وَ } بالجملة: { قِيلَ } من قبل كل من يتأتى منه الرجوع إليه سبحانه والتوجه نحوه طوعاً على الوجه الذي أمر به: { ٱلْحَمْدُ } المطلق المستوعب لجمع الأثنية والمحامد الصادرة من عموم المظاهر ثابت { لِلَّهِ } أي: للذات المستجمع لجميع أوصاف الكمال بالاستحقاق والاستقلال لكونه { رَبِّ ٱلْعَالَمِينَ } [الزمر: 75] بمقتضى توحيده وانفراده\n فيكون جميع محامدهم مختصة به سبحانه\n إذ لا مربي لهم سواه\n\n\nحققنا بكرمك بحق قدرك وبقدر حقك يا ذا القوة المتين\n\n\nخاتمة السورة\n\nعليك أيها المحمدي القاصد للتحقيق والإدراك بكمال عظمة الله وجلاله\n أن تتأمل في أواخر هذه السورة\n وتتعمق فيها وفي كشف سرائرها ومرموزاتها وإشاراتها الخفية وعباراتها المنبهة على وحدة الحق وحقيته\n لينكشف لك أنه لا شغله شأن عن شأن\n ولا يقدر تحقق وقيوميته زمان ومكان\n بل هو كائن على ما كان في كل آن وشأن بلا زمان ومكان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وترى الملائكةَ } حال كونهم { حافِّينَ من حول العرشِ } أي: محدقين به\n و \" من \" لابتداء الغاية\n أي: ابتداء حفوفهم من حول العرش إلى حيث شاء الله\n أو: زائدة\n { يُسبِّحون بحمدِ ربهم } أي: يقولون سبحان الله\n والحمد لله\n سُبوح قُدوس\n رب الملائكة والروح\n أو: ينزهونه تعالى عما لا يليق به\n ملتبسين بحمده\n والمعنى: ذاكرين الله تعالى بوصفي جلاله وإكرامه\n تلذُّذاً\n وفيه إشعار بأن أقصى درجات العليين في لذائذهم هو الاستغراق في شهوده عزّ وجل\n { وقيل الحمدُ لله رب العالمين } يقوله أهل الجنة شكراً لله حين دخلوها\n وتمّ وعد الله لهم: { الحمد لله رب العالمين } كما قال:\n[يونس: 10]\n الإشارة: وسيق الذين اتقوا ربهم حق تقاته إلى جنة المعارف\n زُمراً\n متفاوتين في السير\n على قدر تفاوتهم في القريحة\n والاعتناء\n والتفرُّغ من الشواغل والعلائق\n حتى إذا جاؤوها وفُتحت أبوابها\n بذهاب حجاب الكائنات\n حتى بقي المكوّن وحده\n كما كان وحده\n وجدوا من الأسرار والأنوار ما لا يدخل تحت دوائر العبارة\n ولا تحيط به الإشارة\n وقال لهم خزنتها\n وهم شيوخ التربية\n العارفون الله: سلام عليكم طِبتم\n أي: تقدّستم من العيوب والأكدار\n فادخلوها خالدين لأن مَن وصل لا يرجع أبداً\n وما رجع مَن رجع إلا من الطريق\n\nوقالوا: الحمد لله الذي صدقنا وعده\n بأن أنجز لنا ما وعدنا من الوصول\n على ألسنة المشايخ\n قال في الحِكَم: \" سبحان مَن لم يجعل الدليل على أوليائه إلا من حيث الدليل عليه\n ولم يوصل إليهم إلا مَن أراد أن يوصله إليه \"\n وأورَثَنا أرضَ الوجود بأسره\n نتبوأ من جنة المعارف\n في أقطار الوجود\n بفكرتنا وهمتنا\n حيث نشاء\n فنِعم أجر العاملين\n وترى الملائكة حافين من حول العرش\n أي: قلب العارف لأن بيت الرب\n ومحل قرار نوره\n فيحفُّونه بالحفظ والرعاية من دخول الأغيار\n ويُنزهون الله عن الحلول والاستقرار\n وقُضي بينهم بالحق\n فعزلت الشياطين عن قلوب الذاكرين\n وتسلّطت على قلوب الغافلين\n والحمد لله رب العالمين\n حيث لم يظلم أحداً من العالمين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:32",
      "similarity": 0.707515826002447
    },
    {
      "verse": "40:7",
      "similarity": 0.23216897748359583
    },
    {
      "verse": "27:8",
      "similarity": 0.14577623818176458
    },
    {
      "verse": "26:25",
      "similarity": 0.12100118517121569
    },
    {
      "verse": "26:34",
      "similarity": 0.11805156632446685
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}