{
  "chapter": "الزمر",
  "text": "وقالوا۟ الحمد لله الذى صدقنا وعده واورثنا الارض نتبوا من الجنة حيث نشاء فنعم اجر العملين",
  "translations": [
    {
      "translation": "They will say, 'Praise be to Allah Who has fulfilled His promise to us and made us the inheritors of this land, letting us settle in the Garden wherever we want. How excellent is the wage of those who work!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"All praise be to God Who has fulfilled the promise He had made to us, and bequeathed to us this land for dwelling in the garden wheresoever we like.\" How excellent the recompense for those who act!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: “All thanks and praise be to Allah Who has made His promise to us come true, and Who gave us the earth to inherit. We may now dwell in Paradise wherever we please.” How excellent is the reward of those who laboured!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"It is only God who deserves all praise. He has made His promise come true and has given the earth as an inheritance to us. Now we live in the gardens as we wished. Blessed is the reward of those who labor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, “All praise is to Allah, Who has made His promise to us come true, and has bequeathed us this land, to stay in Paradise wherever we wish!” So what an excellent reward for the performers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"All the praises and thanks be to Allah Who has fulfilled His promise to us and has made us inherit the land. We can dwell in Paradise where we will; how excellent a reward for the workers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say: (All) praise is due to Allah, Who has made good to us His promise, and He has made us inherit the land; we may abide in the garden where we please; so goodly is the reward of the workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say, 'Praise belongs to God, who has been true in His promise to us, and has bequeathed upon us the earth, for us to make our dwelling wheresoever we will in Paradise.' How excellent is the wage of those that labour!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Praise be to Allah, Who hath fulfilled His promise unto us and hath made us inherit the land, sojourning in the Garden where we will! So bounteous is the wage of workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they will say, \"Praise be to God who has fulfilled His promise to us and made us the inheritors of this land, letting us settle in the Garden wherever we want.\" How excellent is the reward of those who labour!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they Will say: all praise Unto Allah, who hath fulfilled His promise Unto us and made us inherit this land, so that we may dwell in the Garden whereever we will! Excellent then is the hire of the workers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘All praise belongs to Allah, who has fulfilled His promise to us and made us inheritors of the earth, that we may settle in paradise wherever we may wish!’ How excellent is the reward of the workers [of righteousness]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Praise be to Allah, Who has truly fulfilled His Promise to us, and has given us (this) land in heritage: We can dwell in the Garden as we will: how excellent a reward for those who work (righteousness)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: \"All the praises and thanks be to Allah Who has fulfilled His Promise to us and has made us inherit (this) land. We can dwell in Paradise where we will; how excellent a reward for the (pious good) workers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: 'Praise belongs to Allah who has been true to His promise to us and given us the earth to inherit, that we shall live in Paradise wherever we wish' How excellent is the recompense of those that labor!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, “Praise be to God, who has fulfilled His promise to us, and made us inherit the land, enjoying Paradise as we please.” How excellent is the reward of the workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say, \"Praise to Allah, who has fulfilled for us His promise and made us inherit the earth [so] we may settle in Paradise wherever we will. And excellent is the reward of [righteous] workers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:74] And they will say: (this is a supplement to the implicit [response] dakhalūhā, ‘they enter it’) ‘Praise be to God, Who has fulfilled His promise to us, of Paradise, and has made us inherit the land, the land of Paradise, that we may settle in Paradise wherever we wish’, for it is all [Paradise], and there is no spot that can be preferred to another. So how excellent is, Paradise [as], the reward of those who worked [hard]!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say) after they become aware of Allah's favour upon them: (Praise be to Allah) gratitude belongs to Allah, (Who hath fulfilled His promise unto us and hath made us inherit the land) and Who made us to dwell in the land of the Garden, (sojourning in the Garden where we will! So bounteous is the wage of workers) how good is the wage of those who strive for Allah in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وقالوا الحمد لله } بالاتّصاف بكمالاته والوصول إلى نعيم تجليات صفاته { الذي صدقنا وعده } بإيصالنا إلى ما وعدنا في العهد الأول وأودع فينا وأنبأنا عنه على ألسنة رسله { وأورثنا } جنّة الصفات { نتبوّأ } منها { حيث نشاء } بحسب شرفنا ومقتضى حالنا { فنِعْمَ أجر العالمين } الذين عملوا بما علموا فأورثوا جنّة القلب والنفس من الأنوار والآثار { وترى } ملائكة القوى الروحانية في جنّة الصفات { حافين من حول } عرش القلب { يسبّحون } بتجرّدهم عن اللواحق المادية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَوْرَثَنَا ٱلأَرْضَ } أي: المقر الموجود الذي بشرنا به الرسل الكرام\n وهي الجنة الموروثة لأهل العناية من سوابق الإيمان والمعرفة والأعمال الصالحة الصادرة منهم في دار الاختبار\n ومكننا فيه\n بحيث { نَتَبَوَّأُ مِنَ ٱلْجَنَّةِ } وننزل { حَيْثُ نَشَآءُ } يعني: ينزل ويستريح كل منَّا حي شاء وأراد من المقامات البهية الدرجات العلية\n بلا مضايقة وممانعة { فَنِعْمَ أَجْرُ ٱلْعَامِلِينَ } [الزمر: 74] المخلصين المخلِّصين نفوسهم عن أودية الجهالات والضلالات بنور الآيات البينات\n الواصلين إلى روضة الرضا وجنة التسليم\n اللهم ارزقنا بلطفك العميم\n واجعلنا من ورثة جنة النعيم\n\n\n{ وَ } بعدما تقرر أهل النار في النار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأورثنا الأرضَ } أرض الجنة\n أي: المكان الذي استقرُّوا فيه\n وقد أُورثوها وملكوها\n وأطلق تصرفهم فيها كما يشاؤون تشبيهاً بحال الوارث وتصرفه فيما يرثه\n واتساعه فيها\n { نتبوَّأُ من الجنة حيث نشاءُ } أي: يتخذ كل واحد منا جنة لا توصف\n سعة وزيادة على الحاجة\n فيتبوأ أيَّ مكان أراده من جنته الواسعة\n { فَنِعمَ أجرُ العاملين } في الدنيا الجنة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:41",
      "similarity": 0.43116811840283786
    },
    {
      "verse": "12:56",
      "similarity": 0.419637804528271
    },
    {
      "verse": "5:29",
      "similarity": 0.40051522851408666
    },
    {
      "verse": "10:93",
      "similarity": 0.3803013478412568
    },
    {
      "verse": "26:85",
      "similarity": 0.3631038032394696
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/039074.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/039074.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/39:74.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}