{
  "chapter": "الزمر",
  "text": "وسيق الذين اتقوا۟ ربهم الى الجنة زمرا حتى اذا جاءوها وفتحت ابوبها وقال لهم خزنتها سلم عليكم طبتم فادخلوها خلدين",
  "translations": [
    {
      "translation": "And those who have taqwa of their Lord will be driven to the Garden in companies and when they arrive there, finding its gates open, its custodians will say to them, 'Peace be upon you! You have done well so enter it timelessly, for ever.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were mindful of their duty to their Lord will be driven in groups to Paradise, till they reach it and its gates are opened, and its keepers say to them: \"Peace be on you; you are the joyous. So enter here to live for ever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who eschewed disobeying their Lord shall be driven in companies to Paradise so that when they arrive there its gates will have already been thrown open and its keepers shall say to them: “Peace be upon you; you have done well. So enter. Herein you shall abide.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pious ones will be led to Paradise in large groups. Its gates will be opened to them when they are brought nearby and its keepers will say, \"Welcome! Peace be with you. Enter the gates of Paradise to live therein forever\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the mounts of those who feared their Lord will be led towards Paradise, in groups; to the extent that when they reach it, its gates will be opened and its guards will say to them, “Peace be upon you! You have done well! Therefore enter Paradise, to abide in it forever.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had Taqwa will be led to Paradise in groups till when they reach it, and its gates will be opened and its keepers will say: \"Salam `Alaykum (peace be upon you)! You have done well, so enter here to abide therein forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are careful of (their duty to) their Lord shall be conveyed to the garden in companies; until when they come to it, and its doors shall be opened, and the keepers of it shall say to them: Peace be on you, you shall be happy; therefore enter it to abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then those that feared their Lord shall be driven in companies into Paradise, till, when they have come thither, and its gates are opened, and its keepers will say to them, 'Peace be upon you! Well you have fared; enter in, to dwell forever.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who keep their duty to their Lord are driven unto the Garden in troops till, when they reach it, and the gates thereof are opened, and the warders thereof say unto them: Peace be unto you! Ye are good, so enter ye (the Garden of delight), to dwell therein;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear their Lord will be led in groups towards Paradise. When they reach it, its gate will be opened, and its keepers will say to them, \"Peace be upon you. You have done well, enter Paradise and dwell in it forever,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who feared their Lord Will be driven Unto the Garden in troops till, when they arrive thereto, and the portals thereof will be opened, the keepers thereof Will say Unto them: Peace be Unto you! excellent are ye! enter it as abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are wary of their Lord will be led to paradise in throngs. When they reach it and its gates are opened, its keepers will say to them, ‘Peace be to you! You are welcome! Enter it to remain [forever].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who feared their Lord will be led to the Garden in crowds: until behold, they arrive there; its gates will be opened; and its keepers will say: \"Peace be upon you! well have ye done! enter ye here, to dwell therein.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who kept their duty to their Lord will be led to Paradise in groups, till, when they reach it, and its gates will be opened (before their arrival for their reception) and its keepers will say: Salamun 'Alaikum (peace be upon you)! You have done well, so enter here to abide therein.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, those that feared their Lord shall be driven in companies into Paradise. When they draw near its gates will be opened, and its keepers will say to them: 'Peace be upon you, you have done well. Enter and live in it for ever'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who feared their Lord will be led to Paradise in throngs. Until, when they have reached it, and its gates are opened, its keepers will say to them, “Peace be upon you, you have been good, so enter it, to abide therein eternally.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, \"Peace be upon you; you have become pure; so enter it to abide eternally therein,\" [they will enter].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:73] And those who feared their Lord will be driven, gently, to Paradise in troops, until, when they reach it, and its gates are opened (wa-futihat: the wāw here indicates a circumstantial qualifier, implying qad, ‘already’) and its keepers will say to them, ‘Peace be to you! You are good! (tibtum, a circumstantial qualifier) So enter it to abide [therein]’ — [enter it] with the decree that you are to abide in it [forever] (the response to idhā, ‘when’, is implicit and is, in other words, dakhalūhā, ‘they enter it’). [The manner of] their being driven as well as the opening of the gates before their arrival is a way of honouring them; the driving of the disbelievers, however, and the opening of the gates only upon their arrival so that [all of] its heat is retained for them, is a means of humiliating them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who keep their duty to their Lord) and those who obey their Lord (are driven unto the Garden in troops) group after group (till, when they reach it) i.e. the Garden, (and the gates thereof are opened) and they were opened before that too, (and the warders thereof) and the warder of the Garden (say unto them) at the gate of Paradise: (Peace be unto you) they salute you with greeting and peace! (Ye are good) you succeeded and are saved; it is also said that this means: you are cleansed and purified, (so enter ye (the Garden of Delight), to dwell therein) forever, never to die or leave it;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَسِيقَ } أيضاً سوق الحمام إلى المسرح { ٱلَّذِينَ ٱتَّقَوْاْ رَبَّهُمْ } عن محارم الله بمقتضى أوامره ونواهيه الجارية على ألسنة رسله وكتبهم { إِلَى ٱلّجَنَّةِ } المعدة لفيضان أنواع اللذات الروحانية على أهلها { زُمَراً حَتَّىٰ إِذَا جَآءُوهَا } فرحين مسرورين، وتحننوا نحوها { وَ } قد { فُتِحَتْ أَبْوَابُهَا } عناية من الله إياهم { وَقَالَ لَهُمْ } حينئذ { خَزَنَتُهَا } ترحيباً وتكريماً: { سَلاَمٌ عَلَيْكُـمْ } أيها المهديون المهتدون الذين { طِبْتُمْ } وطهرتم أنفسكم في دار الاختبار عن دنس الشهوات ورين المزخرفات { فَٱدْخُلُوهَا } أي: الجنة المشتملة على أنواع الكرامات وأصناف السعادات الآن، وكونوا { خَالِدِينَ } [الزمر: 73] فيها أبد الآباد بلا نقل وتحويل، إلا إلى ما شاء الله لأهل العناية من الدرجات العلية التي لا تكتنه ولا توصف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وسيقَ الذين اتقوا ربهم } مساق إعزاز وتشريف، بلا إسراع ولا تكليف، إلى دار الكرامة والتعريف\n قيل: يُساقون راكبين مبجَّلين، كما يجيء الوافدون إلى دار الملوك، يساقون { إِلى الجنة زُمراً } جماعة متفاوتين، بحسب تفاوت مراتبهم في الفضل، وعلو الطبقة، { حتى إِذا جاؤوها وفُتِحَتْ أبوابها } الثمانية\n وقرىء بالتخفيف والتشديد\n وجواب \" إذا \" محذوف للإيذان بأن لهم من فنون الكرامة ما لا تُحيط به العبارة، كأنه قيل: حتى إذا جاؤوها، وقد فتحت أبوابها، كان من الأمر والخبر ما يقصر عنه البيان\n { وقال لهم خزنتُها سلامٌ عليكم طبتم } ظفرتم، وتقدّستم في دار التقديس من كل دنس، وطبتم نفساً، بما أتيح لكم من النعيم والأمن، { فادْخُلوها خالدين } ، وحذف الواو في وصف أهل النار لأن أبواب جهنم لا تفتح لهم حتى لهم حتى يصلوا إليها، وفي وقوفهم قبل فتحها مذلة لهم، كما هي حال السجون، بخلاف أهل الجنة، فإنهم يجدونها مفتوحة، قال تعالى:\n\n[ص: 50] كما هي حال منازل الأفراح والسرور",
      "translations": []
    }
  ]
}