{
  "chapter": "الزمر",
  "text": "واذا مس الانسن ضر دعا ربه منيبا اليه ثم اذا خوله نعمة منه نسى ما كان يدعوا۟ اليه من قبل وجعل لله اندادا ليضل عن سبيله قل تمتع بكفرك قليلا انك من اصحب النار",
  "translations": [
    {
      "translation": "When man is afflicted with adversity he turns to his Lord, and prays to Him. But when He bestows His favour on him, he forgets what he prayed for before, and sets up others as compeers of God to mislead (people) from His way. Say: \"Take advantage of your denying for a while: You will be among the inmates of Hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When any affliction befalls man, he cries out to his Lord, penitently turning to Him. But when his Lord bestows His favour upon him, he forgets the affliction regarding which he had cried out and sets up compeers to Allah that they may lead others astray from His Path. Say, (O Prophet): “Enjoy your unbelief for a while. Surely you will be among the inmates of the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the human being is afflicted with hardship, he starts to pray to his Lord and turns to Him in repentance. When God grants him a favor, he forgets the hardship about which he had prayed to God and starts to consider equal to God things that lead him astray from His path. (Muhammad), tell him, \"You can only enjoy in your disbelief for a short time. You will certainly be a dweller of hell fire\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some hardship strikes man, he prays to his Lord, inclined only towards Him – then when Allah grants him a favour from Himself, he forgets why he had prayed to Him earlier, and sets up equals to Allah in order to mislead from Allah’s way; proclaim, “Revel in your disbelief for some days; you are indeed of the people of the fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some hurt touches man, he cries to his Lord, turning to Him in repentance. But when He bestows a favor upon him from Himself, he forgets that for which he cried for before, and he sets up rivals to Allah, in order to mislead others from His path. Say: \"Take pleasure in your disbelief for a while, surely, you are (one) of the dwellers of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when distress afflicts a man he calls upon his Lord turning to Him frequently; then when He makes him possess a favor from Him, he forgets that for which he called upon Him before, and sets up rivals to Allah that he may cause (men) to stray off from His path. Say: Enjoy yourself in your ungratefulness a little, surely you are of the inmates of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some affliction visits a man, he calls upon his Lord, turning to him; then when He confers on him a blessing from Him he forgets that he was calling to before and sets up compeers to God, to lead astray from His way. Say: 'Enjoy thy unbelief a little; thou shalt be among the inhabitants of the Fire.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some hurt toucheth man, he crieth unto his Lord, turning unto Him (repentant). Then, when He granteth him a boon from Him he forgetteth that for which he cried unto Him before, and setteth up rivals to Allah that he may beguile (men) from his way. Say (O Muhammad, unto such an one): Take pleasure in thy disbelief a while. Lo! thou art of the owners of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When man suffers some affliction, he prays to his Lord and turns to Him in penitence, but once he has been granted a favour from God, he forgets the One he had been praying to and sets up rivals to God, to make others stray from His path. Say, \"Enjoy your unbelief for a little while: you will be one of the inmates of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some hurt toucheth man, he calleth upon his Lord, turning Unto Him in penitence; then when He bestoweth upon him a favour from Himself, he forgetteth that for which he called on Him afore, and setteth up peers Unto Allah that He may lead astray others from His way Say thou: enjoy thou life in thy infidelity for a while, verily thou art of the fellows of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When distress befalls man, he supplicates his Lord, turning to Him penitently. Then, when He grants him a blessing from Himself, he forgets that for which he had supplicated Him earlier and sets up equals to Allah, that he may lead [people] astray from His way. Say, ‘Revel in your ingratitude for a while. Indeed you are among the inmates of the Fire.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some trouble toucheth man, he crieth unto his Lord, turning to Him in repentance: but when He bestoweth a favour upon him as from Himself, (man) doth forget what he cried and prayed for before, and he doth set up rivals unto Allah, thus misleading others from Allah's Path. Say, \"Enjoy thy blasphemy for a little while: verily thou art (one) of the Companions of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some hurt touches man, he cries to his Lord (Allah Alone), turning to Him in repentance, but when He bestows a favour upon him from Himself, he forgets that for which he cried for before, and he sets up rivals to Allah, in order to mislead others from His Path. Say: \"Take pleasure in your disbelief for a while: surely, you are (one) of the dwellers of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When an affliction befalls a human, he supplicates to his Lord and turns to Him (in repentance) yet, no sooner does He bestow on him His blessing than he forgets that for which he had just supplicated and sets up associates with Allah in order to lead (people) away from His Path. Say: 'Enjoy your disbelief for awhile, you shall surely be among the companions of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some adversity touches the human being, he prays to his Lord, repenting to Him. But then, when He confers on him a grace of His, he forgets what he was praying for before, and he attributes rivals to God, in order to lead astray from His way. Say, “Enjoy your disbelief for a little while; you will be among the inmates of the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, \"Enjoy your disbelief for a little; indeed, you are of the companions of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[39:8] And when distress befalls a person, that is, the disbeliever, he supplicates his Lord, he implores, turning, returning, to Him penitently. Then, when He bestows on him a grace from Himself, he forgets, he neglects, Him Whom he had supplicated, implored, before, namely, God (in other words mā functions as min, ‘whom’) and sets up equals, associates, with God, that he may lead [others] astray (read li-yadilla or li-yudilla) from His way — [from] the religion of Islam. Say: ‘Revel in your ingratitude for a while — for the remainder of your term [of life]. You shall indeed be among the inhabitants of the Fire’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when some hurt) hardship and trial (toucheth man) the disbelieving man, i.e. Abu Jahl and his host, 530 (he crieth unto his Lord) to lift away the hardship and trial, (turning unto Him) with prayers. (Then, when He grants him) then, when He changes into (a boon from Him he forgeteth that for which he cried unto Him before) before the blessing, (and setteth up rivals) and equals (to Allah that he may beguile (men) from His way) from His religion and obedience. (Say) to Abu Jahl: (Take pleasure in thy disbelief) dwell in your disbelief (a while) a little in the life of this world. (Lo! thou art of the owners of the Fire) you are of the inhabitants of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذَا خَوَّلَهُ نِعْمَةً مِّنْهُ } معناه أَعطاهُ\n\n\n\n\nوقوله تعالى: { وَجَعَلَ لِلَّهِ أَندَاداً } معناه أشباه وأَمثالٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما نبه سبحانه إلى أحوال عباده، شرع يعد مساوئهم وأخلاقهم الذميمة الناشئة من بشريتهم وبهيمتهم، فقال: { وَإِذَا مَسَّ ٱلإِنسَانَ } أي: لحقه وأحاط به { ضُرٌّ } مؤلم مزعج { دَعَا رَبَّهُ } متضرعاً نحوه { مُنِيباً إِلَيْهِ } إذ لا مرجع له سواه، ملحاً لكشفه وإزالته { ثُمَّ إِذَا خَوَّلَهُ } سبحانه وأزال عنه كربه وضره، وأعطاه وأفاض عليه متعهداً له، متفقداً حاله { نِعْمَةً } موهوبة له { مِّنْهُ } أي: من لدنه سبحانه تفضلاً وتكريماً إياه { نَسِيَ } ونبذ وراء ظهره { مَا كَانَ يَدْعُوۤ إِلَيْهِ مِن قَبْلُ } عن شدة ضره، وسورة كربه\n\n\n\n\n{ وَ } مع ذلك لم يقتصر على النبذ والنيسان، بل { جَعَلَ } وأثبت { لِلَّهِ } الصمد المنزه عن الضد والند { أَندَاداً } وادعاهم شركاء له سبحانه، وإنما جعل وفعل كذلك { لِّيُضِلَّ } الناس الناسين عهود ربهم { عَن سَبِيلِهِ } ويحرفهم عن طريق توحيده، ساعياً في إغوائهم وإضلالهم، مجتهداً فيه\n\n\n\n\n{ قُلْ } يا أكمل الرسل نيابة عنَّا مهدداً إياه: { تَمَتَّعْ } أيها الضال المضل { بِكُفْرِكَ } هذا في نشأتك هذه { قَلِيلاً } زماناً قليلاً، ومدة يسيرة { إِنَّكَ } ألبتة في النشأة ا لأخرى { مِنْ أَصْحَابِ ٱلنَّارِ } [الزمر: 8] أي: من ملازميها، ومن جملة ما فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِذا مَسَّ الإِنسانَ } أي: جنس الإنسان { ضُرٌّ } من مرض وغيره { دَعَا رَبَّه مُنِيباً } إليه راجعاً إليه مما كان يدعوه في حالة الرخاء لعِلمه بأنه بمعزل عن القدرة على كشف ضره، وهذا وصف للجنس ببعض أفراده، كقوله تعالى:\n\n[إِبراهيم: 34] وقيل: المراد أبو جهل، أو: كل كافر\n { ثم إِذا خَوَّلهُ نعمةً منه } أي: أعطاه نعمة عظيمة من جنابه، من التخوُّل، وهو التعهُّد، يقال: فلان خائل مال، إذا كان متعهّداً إليه حسن القيام به\n وفي الصحاح: خَوَّله اللهُ الشيء: ملَّكه إياه\n وفي القاموس: وخوَّله اللهُ المالَ: أعطاه إياه\n قال ابن عطية: خوَّله، أي: ملَّكه، وحكمه فيها ابتداء من الله، لا مجازاة، ولا يقال في الجزاء: خوّل\n هـ\n أو: من الخوَل، وهو الافتخار، أي: جعله يخول، أي: يختال ويفتخر بنعمه\n { نَسِيَ ما كان يدعو إِليه من قَبْلُ } أي: نسيَ الضر الذي كان يدعو الله تعالى كشفه من قبل التخويل، أو: نسي ربه الذي كان يدعو ويتضرّع إليه، على أن { ما } بمعنى { من } ، كقوله تعالى:\n\n[الليل: 3]، أو: إيذاناً بأن نِسْيانَه بلغ به إلى حيث لا يعرف ما يدعوه، وهو كقوله تعالى:\n\n[الحج: 2]\n { وجعل لله أنداداً }: شركاء في العبادة { ليُضل } بذلك { عن سبيله } الذي هو التوحيد، أي: ليُضل غيره، أو: ليزاد ضلالاً، أو: يثبت عليه، على القراءتين، وإلا فأصل الضلال غير متأخر عن الجعل المذكور\n واللام للعاقبة، كما في قوله:\n",
      "translations": []
    }
  ]
}