{
  "chapter": "آل عمران",
  "text": "يوم تبيض وجوه وتسود وجوه فاما الذين اسودت وجوههم اكفرتم بعد ايمنكم فذوقوا۟ العذاب بما كنتم تكفرون",
  "translations": [
    {
      "translation": "on the Day when faces are whitened and faces are blackened. As for those whose faces are blackened: 'What! Did you become kafir after having had iman? Taste the punishment for your kufr!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when some faces would be bright, and some others will be black (with despair), those with black faces (will be told): \"Having come to the faith you denied it; now taste therefore the penalty for you disbelieved.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when some faces will turn bright and ther faces will turn dark. Those whose faces have turned dark will be told: 'Did you fall into unbelief after you had been blessed with belief? Taste, then, chastisement for your unbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when some faces will become white and others black, God will ask the people with the faces which have become black, \"Why did you give up your faith? Now suffer the torment for your disbelief\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day (of Resurrection) when some faces will be shining and some faces black; so, (to) those whose faces are blackened, “What! You disbelieved after you had accepted faith! Therefore now taste the punishment, the result of your disbelief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day (i.e. the Day of Resurrection) when some faces will become white and some faces will become black; as for those whose faces will become black (to them will be said): \"Did you reject faith after accepting it Then taste the torment (in Hell) for rejecting faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when (some) faces shall turn white and (some) faces shall turn black; then as to those whose faces turn black: Did you disbelieve after your believing? Taste therefore the chastisement because you disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when some faces are blackened, and some faces whitened. As for those whose faces are blackened -- 'Did you disbelieve after you had believed? Then taste the chastisement for that you disbelieved!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when (some) faces will be whitened and (some) faces will be blackened; and as for those whose faces have been blackened, it will be said unto them: Disbelieved ye after your (profession of) belief? Then taste the punishment for that ye disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when some faces are bright and some faces are dark, it will be said to those with darkened faces, \"Did you reject faith after accepting it? Taste, then, this punishment for having denied the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On a day whereon faces become whitened and faces become blackened. Then as for those whose faces shall have become blackened: disbelieved ye after your profession of belief! taste the torment for that ye have been disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when [some] faces will turn white and [some] faces will turn black. As for those whose faces turn black [it will be said to them], ‘Did you disbelieve after your faith? So taste the punishment because of what you used to disbelieve.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when some faces will be (lit up with) white, and some faces will be (in the gloom of) black: To those whose faces will be black, (will be said): \"Did ye reject Faith after accepting it? Taste then the penalty for rejecting Faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day (i.e. the Day of Resurrection) when some faces will become white and some faces will become black; as for those whose faces will become black (to them will be said): \"Did you reject Faith after accepting it? Then taste the torment (in Hell) for rejecting Faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when faces will be whitened and faces blackened. To those whose faces have become blackened it will be said: 'Did you disbelieve after you had believed? Then taste the punishment for that you disbelieved'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when some faces will be whitened, and some faces will be blackened. As for those whose faces are blackened: “Did you disbelieve after your belief?” Then taste the punishment for having disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day [some] faces will turn white and [some] faces will turn black. As for those whose faces turn black, [to them it will be said], \"Did you disbelieve after your belief? Then taste the punishment for what you used to reject.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:106] The day when some faces are blackened, and some faces whitened, that is, the Day of Resurrection. As for those whose faces are blackened, these being the disbelievers, who are thrown into the Fire and to whom it is said in rebuke: ‘Did you disbelieve after you had believed, on the day the covenant was made? Then taste the chastisement for what you disbelieved!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day (some) faces will be whitened and (some) faces will be blackened; and as for those whose faces have been blackened it will be said unto them) the angels in-charge of hell will say to them: (Disbelieved ye) in Allah (after your (profession of) belief?) in Allah. (Then taste the punishment for that ye disbelieved) in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يوم تبيض وجُوه وتَسود وجُوه } ابيضاض الوجه عبارة عن تنوّر وجه القلب بنور الحق للتوجه إليه والإعراض عن الجهة السفلية النفسانية المظلمة\n وذاك لا يكون إلا بالتوحيد والاستقامة فيه بتنوّر النفس أيضاً بنور القلب\n فتكون الجملة متنوّرة بنور الله واسوداده ظلمة وجه القلب بالإقبال على النفس الطالبة حظوظها والإعراض عن الجهة النوريّة الحقيّة لمصادقة النفس ومتابعة الهوى في تحصيل لذاتها\n وذلك إنما يكون باتباع السبل المتفرّقة الشيطانية\n { فأمّا الذين اسودّت وجوههم } فيقال لهم: { أكَفَرْتم بعد إيمانكم } أي: احتجبتم عن نور الحق بصفات النفس الظلمانية\n وسكنتم في ظلماتها بعد هدايتكم وتنوّركم بنور الاستعداد\n وصفاء الفطرة وهداية العقل { فذوقوا } عذاب الحرمان باحتجابكم عن الحق { وأما الذين ابيضّتْ وجوههم ففي رحمة الله } التي هي روح الوصال ونور القدس وشهود الجمال { هم فيها خالدون }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل: { يَوْمَ تَبْيَضُّ وُجُوهٌ } بقبول النور من الوجه الباقي { وَتَسْوَدُّ وُجُوهٌ } ببقائها في سواد الإمكان { فَأَمَّا ٱلَّذِينَ ٱسْوَدَّتْ وُجُوهُهُمْ } ولم يرتفع غشاوة هوايتهم\n وكثافة ماهياتهم عن أعينهم وأبصارهم\n ولم تصف مرآت قلوبهم عن صداء الكثرة وشوب التنويه لذلك قيل تقريعاً وتوبيخاً: { أَكْفَرْتُمْ } أيها الهالكون في بقعة الإمكان من { بَعْدَ إِيمَانِكُمْ } بوجوب الوجود\n ووجوب الرجوع إليه { فَذُوقُواْ ٱلْعَذَابَ } أي: الطرد والحرمان { بِمَا } أي: بأنانيتكم { كُنْتُمْ تَكْفُرُونَ } [آل عمران: 106] وتسترونن\n وتستبلدون به نور الوجود وصفاء التوحيد الخالص عن الكدورات مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { أكفرتم }: محكي بقول محذوف جواب { أما } \n أي: فيقال لهم: أكفرتم\n يقول الحقّ جلّ جلاله: { ولا تكونوا } كاليهود والنصارى الذين { تفرقوا } في التوحيد والتنزيه\n { واختلفوا } في أحوال الآخرة\n قال عليه الصلاة والسلام:\n \" افْتَرقَتِ اليَهُودُ على إِحْدَى وسَبْعِين فرقَةً\n وافْتَرقَت النَّصارَى عَلَى ثَنْتَيْنِ وسَبْعِين فِرقَةٌ\n وستفترق أمتي على ثلاثٍ وسَبْعِينَ فِرْقةً\n كلُّها في النَّارِ إلا وَاحِدةً\n قيل: ومَنْ تلك الواحدة؟ قال: ما أَنَا وأَصْحابِي عَلَيْه \" \nوهذا الحديث أصح مما تقدم\n والصحابة يروْوُن الحديث بالمعنى\n فلعلَّ الأول نسي بعض الحديث\n والله أعلم\n ثم إن النهي مخصوص بالتفرق في الأصول دون الفروع\n لقوله عليه الصلاة والسلام:\n \" اخْتلاَفُ أُمَّتِي رَحْمَةٌ \" \n\n ولقوله:\n \" من اجْتَهَدَ وأصَابَ فله أجْرَانِ\n ومن اجْتَهدَ وأخطَأَ فَلَهُ أجْرٌ وَاحد \"\n \nثم إن أهل الكتاب تفرقوا { من بعد ما جاءهم البينات } أي: الآيات والحجج المبينة للحق الموجبة للاتفاق عليه\n { وأولئك لهم عذاب عظيم } \n يستقر لهم هذا العذاب { يوم تبيض وجوه } المؤمنين المتقين على التوحيد\n { وتسود وجوه } الكافرين المتفرقين فيه\n أو تبيض وجوه المخلصين وتسود وجوه المنافقين\n أو تبيض وجوه أهل السنة وتسود وجوه أهل البدعة\n وبياض الوجوه وسوادها كِنَايتَان عن ظهور بهجة السرور وكآبة الخوف فيه\n وقيل: يُوسَم أهل الحق ببياض الوجوه والصحيفة وإشراق البشرة وسعي النور بين يديه وبيمينه\n وأهل الباطل بأضداد ذلك\n { فأما الذين اسودت وجوههم } فيقال لهم يومئذ: { أكفرتم } بمحمد - عليه الصلاة والسلام - بعد ظهوره\n { بعد إيمانكم } به قبل ظهوره\n وهم اليهود أو أهل الردة\n آمنوا في حياته صلى الله عليه وسلم وكفروا بعد موته\n أو جميع الكفار\n آمنوا في عالم الذر وأقروا على أنفسهم\n ثم كفروا في عالم الشهادة\n ويقال لهم أيضاً: { ذوقوا العذاب } بسبب ما كنتم { تكفرون }\n { وأما الذين ابيضت وجوههم ففي رحمة الله } أي: جَنته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:107",
      "similarity": 0.5953078036372366
    },
    {
      "verse": "33:67",
      "similarity": 0.553319827119706
    },
    {
      "verse": "39:60",
      "similarity": 0.5146091858229618
    },
    {
      "verse": "7:108",
      "similarity": 0.4027957024100793
    },
    {
      "verse": "26:33",
      "similarity": 0.4027957024100793
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:106.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:106.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:106.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}