{
  "chapter": "آل عمران",
  "text": "يايها الذين ءامنوا۟ ان تطيعوا۟ فريقا من الذين اوتوا۟ الكتب يردوكم بعد ايمنكم كفرين",
  "translations": [
    {
      "translation": "You who have iman! if you obey a group of those given the Book, they will make you revert to being kafir after you have had iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you follow what some of the people of the Book say, it will turn you into unbelievers even after you have come to belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Were you to obey a party of those who were given the Book, they might cause you to renounce the Truth after you have attained to faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you obey a certain group among the People of the Book, they will turn you back to disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you obey some of People given the Book(s), they will definitely turn you into disbelievers after your having accepted faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey a group of those who were given the Scripture (Jews and Christians), they would (indeed) render you disbelievers after you have believed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! if you obey a party from among those who have been given the Book, they will turn you back as unbelievers after you have believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you obey a sect of those who have been given the Book, they will turn you, after you have believed, into unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye obey a party of those who have received the Scripture they will make you disbelievers after your belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you yield to some of those who were given the Scripture, they will cause you to renounce the truth after you have believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! were ye to obey any party amongst those that have been vouchsafed the Book, they would, after your having believed, render you Infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith, if you obey a part of those who were given the Book, they will turn you back, after your faith, into faithless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye listen to a faction among the People of the Book, they would (indeed) render you apostates after ye have believed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey a group of those who were given the Scripture (Jews and Christians), they would (indeed) render you disbelievers after you have believed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you obey a sect of those who were given the Book, they will turn you into unbelievers after you have believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey a party of those who were given the Scripture, they will turn you, after your belief, into disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if you obey a party of those who were given the Scripture, they would turn you back, after your belief, [to being] unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:100] The following was revealed when the Jews passed by the Aws and the Khazraj and were infuriated by their comradeship, and set about reminding them of their mutual hostility in the days before Islam, such that they caused them to quarrel and the two [tribes] were on the verge of fighting one another: O you who believe,   if you obey a party of those who have been given the Scripture, they will turn you, after you have believed, into disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! If ye obey a party of those who have received the Scripture) the Torah (they will make you disbelievers) in Allah and Muhammad (after your belief) in Allah and [the message of] Muhammad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما وبخ سبحانه الكافرين القاصدين إضلال المؤمنين بما وبخ وبالغ توبيخهم بما بالغ، أراد أن يحذر المؤمنين عن مخالطتهم وموافاتهم، فناداهم؛ لأنه دخل في قبول النصح فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } وفقوا على تشريف الإيمان، مقتضى إيمانكم الاجتناب عن مخالطة الكفار ومؤاخاتهم وادعاء المحبة والمودة معهم؛ لأنكم { إِن تُطِيعُواْ فَرِيقاً مِّنَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ } طائعين قاصدين إطاعتهم وانقيادهم { يَرُدُّوكُم } البتة { بَعْدَ إِيمَانِكُمْ } وتوحيدكم { كَافِرِينَ } [آل عمران: 100] مشركين ما أنتم عليه في جاهليتكم\n\n\n\n\n \" نزلت في فرقة من الأوس والخزرج كانوا يجتمعون ويتحدثون ويتناشدون، فمر على اجتماعهم شاس بن قيس اليهودي، فغاظه مؤاخاتهم ومخالطتهم، فأمر بشاب من اليهود أن يجلس إليهم، ويذكرهم يوم بعاث، وينشدهم بعض ما قيل فيه، وكان الظفر في ذلك اليوم للأوس ففعل، فتنازع القوم وتفاخروا إلى تغاضبوا وتخاصموا، وصاحوا: السلاح! واجتمع من الجانبين خلق عظيم\n \n\n \n\n وتوجه إليهم رسول الله صلى الله عليه وسلم وأصحابه، وقال لهم: \" أتدعون الجاهية، وأنا بين أظهركم بعد، إذ أكرمكم الله بالإسلام وشرفكم بالإيمان والتوحيد الرافع لجميع الخصومات \" فعلموا أنها نزغة من الشيطان وكيد من عدوهم، فألقوا السلاح و استغفروا وتعانقوا وتحابوا، وانصرفوا مع رسول الله صلى الله عليه وسلم \"\n \n\n \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } ، الخطاب عامٌ، والمراد: نفر من الأوس والخزرج، { إن تُطيعوا فريقاً من الذين أوتوا الكتاب } ، وهو شاسُ بن قيس اليهودي، كان شيخاً كبيراً، وكان عظيمَ الكفر شديد الضغن على المسلمين، مرَّ بنفر من الأوس والخزرج، جلوساً يتحدثون، وكان بينهما عداوة في الجاهلية، فغاظه تآلفهم واجتماعهم، وقال: قد اجتمع ملأ بني قَيْلَة بهذه البلاد، فما لنا معهم قرار، فأمر شاباً من اليهود أن يجلس بينهم ويُذكِّرهم يوم بعاث - وهو يوم حرب كان بينهم في الجاهلية - ويُنشدهم بعض ما قيل فيه، وكان الظفرُ في ذلك اليوم للأوس، ففعل، وتنازع القوم وتفاخروا وتغاضبوا، وقالوا: السلاحَ السلاحَ، واجتمع من القبيلتين خلق عظيم، فتوجه إليهم رسول الله صلى الله عليه وسلم وأصحابه، فقال:\n\n \" أبدعْوَى الجَاهِليةِ وأنا بَيْنَ أَظْهُرِكُمْ، بعدَ إذ أكْرَمَكْم اللّهُ بالإسْلام، وقَطَعَ به عَنْكُم أمْرَ الجَاهِلِية، وألْفَ بَينكُم؟ \" \n\nفعلموا أنها نزغة ٌ من الشيطان وكيدٌ من عدوهم، فَأَلَقَوا السِّلاحَ، واستغفروا وعانق بعضهم بعضاً، وانصرفوا مع الرسول - صلوات الله عليه وسلامه - فنزلت الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:47",
      "similarity": 0.5568472730629158
    },
    {
      "verse": "98:4",
      "similarity": 0.5412857531200652
    },
    {
      "verse": "3:149",
      "similarity": 0.5410253776009322
    },
    {
      "verse": "2:53",
      "similarity": 0.39114455070873766
    },
    {
      "verse": "8:29",
      "similarity": 0.38982689689845196
    }
  ]
}