{
  "chapter": "آل عمران",
  "text": "ولتكن منكم امة يدعون الى الخير ويامرون بالمعروف وينهون عن المنكر واو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "So let there be a body among you who may call to the good, enjoin what is esteemed and forbid what is odious. They are those who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among you there must be a party who invite people to all that is good and enjoin the doing of all that is right and forbid the doing of all that is wrong. It is they who will attain true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be a group among you who will invite others to do good deeds, command them to obey the Law, and prohibit them from committing sins. These people will have eternal happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there should be a group among you that invites to goodness, and enjoins good deeds and forbids immorality; it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there arise out of you a group of people inviting to all that is good (Islam), enjoining Al-Ma`ruf (all that Islam orders) and forbidding Al-Munkar (all that Islam has forbidden). And it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among you there should be a party who invite to good and enjoin what is right and forbid the wrong, and these it is that shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be one nation of you, calling to good, and bidding to honour, and forbidding dishonour; those are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there may spring from you a nation who invite to goodness, and enjoin right conduct and forbid indecency. Such are they who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be a group among you who call others to good, and enjoin what is right, and forbid what is wrong: those who do this shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let there be of you a community calling others to good and commanding that which is reputable and prohibiting that which is disreputable. And these they are the blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has to be a nation among you summoning to the good, bidding what is right, and forbidding what is wrong. It is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there arise out of you a band of people inviting to all that is good, enjoining what is right, and forbidding what is wrong: They are the ones to attain felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there arise out of you a group of people inviting to all that is good (Islam), enjoining Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do) and forbidding Al-Munkar (polytheism and disbelief and all that Islam has forbidden). And it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be one nation of you that shall call to righteousness, ordering honor, and forbidding dishonor. Those are the prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let there be among you a community calling to virtue, and advocating righteousness, and deterring from evil. These are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:104] Let there be one community of you calling to good, to Islam, and enjoining decency, and forbidding indecency; those, that call, bid and forbid, are the successful, the victorious (the particle min, ‘of’, [in minkum, ‘of you’] is partitive, since what is mentioned is a collective obligation [fard kifāya], and is not incumbent upon every individual of the community, for not every person, such as the ignorant, is up to it. However, it is also said that this particle is extra, and what is meant is, ‘so that you are a community [calling to good and so on]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then commanded goodness and reconciliation, saying: (And there may spring from you) there still exists among you (a nation) a group (who invite to goodness) who invite to reconciliation and excellence, (and enjoin right conduct) they enjoin Allah's divine Oneness and the following of Muhammad (pbuh) (and forbid indecency) they forbid disbelief, idolatry and rejection, instead following the Messenger. (Such are they who are successful) who are saved from Allah's wrath and punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولتكن منكم أمة يَدْعون إلى الخَيْر } أي: ليكن من جملتكم جماعة عالمون، عاملون، عارفون، أولو استقامة في الدين كشيوخ الطريقة { يدعونَ إلى الخَير } فإن من لم يعرف الله لم يعرف الخير، إذ الخير المطلق هو الكمال المطلق الذي يمكن للإنسان بحسب النوع من معرفة الحق تعالى، والوصول إليه، والإضافي ما يتوصل به إلى المطلق أو الكمال المخصوص بكلّ أحد على حسب اقتضاء استعداده الخاص\n فالخير المدعوّ إليه، إما الحق تعالى، وإما طريق الوصول\n والمعروف كل أمر واجب أو مندوب في الدين، يتقرّب به إلى الله تعالى، والمنكر كلّ محرّم أو مكروه يبعد عن الله تعالى ويجعل فاعله عاصياً أو مقصراً مذموماً\n فمن لم يكن له التوحيد والاستقامة، لم يكن له مقام الدعوة ولا مقام الأمر بالمعروف والنهي عن المنكر، لأن غير الموحد ربما يدعو إلى طاعة غير الله وغير المستقيم فى الدين وإن كان موحداً ربما أمر بما هو معروف عنده، منكر في نفس الأمر وربما نهى عما هو منكر عنده، معروف في نفس الأمر، كمن بلغ مقام الجمع واحتجب بالحق عن الخلق، فكثيراً ما يستحلّ محرّماً كبعض المسكرات والتصرّف في أموال الناس، ويحرّم حلالاً بل مندوباً كتواضع الخلق ومكافأة الإحسان وأمثال ذلك { وأولئك هُم } الأخصاء بالفلاح، الذين لم يبق لهم حجاب وهم خلفاء الله في أرضه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما وفقتم للإيمان، ونبهتم للتوحيد والعرفان { لْتَكُن مِّنْكُمْ أُمَّةٌ } ملتزمة للإرشاد والتكميل { يَدْعُونَ } الناس { إِلَى ٱلْخَيْرِ } أي: إلى التوحيد وإسقاط الإضافات { وَيَأْمُرُونَ بِٱلْمَعْرُوفِ } المستحسن في طريق التوحيد { وَيَنْهَوْنَ عَنِ ٱلْمُنْكَرِ } المستقبح فيه، المناسع عن الوصول إليه { وَأُوْلَـٰئِكَ } الراشدون، المهديون، المرشدون، الهادون { هُمُ ٱلْمُفْلِحُونَ } [آل عمران: 104] الفائزون من عنده بالمثوبة العظمى، والدرجة العليا التي هي طريق مقام الجمعية والرضا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مِنْ: للتبعيض لأن الأمر بالمعروف والنهي عن المنكر من فُروض الكفاية إذ لا يصلح له كُلُّ أحد، أو للبيان، أي كونوا أمة تأمرون بالمعروف، كقوله:\n\n[آل عِمرَان: 110] الخ، و { يأمرون بالمعروف وينهون عن المنكر } عطف على الخبر، من عطف الخاص على العام للإيذان بفضله\n { يقول الحقّ جلّ جلاله }: { ولتكن منكم } يا أمة محمد صلى الله عليه وسلم { أمة } أي: طائفةً { يدعون إلى الخير } ، وهو كل ما فيه صلاحٌ ديني، أو دنيوي إذ كان يؤول إلى الديني، أو صلاح قلبي أو روحاني، { ويأمرون بالمعروف } وهو ما يستحسنه الطبع ويرتضيه الشرع، { وينهون عن المنكر } وهو كل ما ينكره الطبعُ السليم والشرع المستقيم، فمن فعل ذلك فأولئك { هم المفلحون } المخصوصون بكمال الفلاح\n رُوِيَ عنه عليه الصلاة والسلام: أنه سئل مَنْ خير الناس؟ فقال:\n\n \" آمرُهم بالمعروف، وأنهاهم عن المنكر، وأتقاهم الله، وأوصلهم للرحم \" \n\nوقال أيضاً:\n\n \" مَنْ أمَرَ بالمَعْروفِ ونَهَى عَنِ المُنْكَرِ كان خَلِيفَةَ اللّهِ في أرْضِهِ وخَلِيفَةَ رَسُولِه وخَلِيفَةَ كِتَابِه \" \n\nوقال عليّ رضي الله عنه: أفضل الجهاد: الأمر بالمعروف والنهي عن المنكر وشنئان الفاسقين - أي بغضهم - فمن أمر بالمعروف شدَّ ظهرَ المؤمن، ومن نهى عن المنكر أرْغَمَ أنف المنافق، ومن شَنَأَ الفاسقين وغَضب لله غَضبَ الله له\n وقال أبو الدرداء: لتأمُرُن بالمعروف، ولتنهون عن المنكر، أو ليُسلطن الله عليكم سلطاناً ظالماً، لا يُجِلُّ كبيركم، ولا يرحم صغيركم، ويدعو عليه خيارُكم فلا يستجاب لهم، ويَسْتنصِرون فلا يُنصرون، ويستغفرون فلا يغفر لهم\n وقال حذيفة: يأتي على الناس زمان لأن تكون فيه جيفة حمار، أحب إليهم من مؤمنٍ يأمرهم بالمعروف وينهاهم عن المنكر\n وللمتصدِّي له شروط: العلم بالأحكام، ومراتب الاحْتِسَاب وكيفية إقامتها، والتمكن من القيام بها، ولذلك خاطب الحق تعالى الجميع، وطلب فعل بعضهم، إذ لا يصلح للقيام به إلا البعض، كما هو شأن فرض الكفاية، إذ هو واجب على الكل، بحيث لو تركوه لعوقبوا جميعاً، لكنه يسقط بفعل البعض\n والأمر بالمعروف يكون واجباً ومندوباً، على حسب ما يأمر به، والنهي عن المنكر واجب كله لأن جميع ما أنكره الشرع حرام\n وأما المكروه فليس بمنكر، فيستحب الإرشاد إلى تركه\n والأظهر أن العاصي يجب أن ينهى عما يرتكبه هو لأنه يجب عليه تركه، فلا يسقط بترك أحدهما وجوب الآخر\n وقد قال عليه الصلاة والسلام:\n\n \" مُرُوا بالمَعْرُوفِ وإن لَمْ تَعمَلُوا بِكُلِّهِ، وانْهَوْا عَنِ المُنْكَرِ وإنْ لم تَنْتَهُوا عنه كُلهُ \"\n \n\nالإشارة: { ولتكن منكم أمة } أي: طائفة ينهض حالهم ويدلُّ على الله مقالهم، يدعون إلى الخير العظيم، وهو شهود ذات السميع العليم، ويأمرون بالمعروف بالهمة العلية، وينهون عن المنكر بالحال القوية، فكلُّ من رآهم بالصفا ائتمر وانتهى، وكل من صحبهم بالوفاء أخذ حظه من الغنى بالمكيال الأوفى، إن لله رجالاً من نظر إليهم سعد سعادة لا يشقى بعدها أبداً، فهؤلاء يأمرون بالمعروف وينهون عن المنكر بالحال دون المقال\n\n\nيُحكى أن بعض الشيوخ مرَّ مع أصحابه بقوم يشربون الخمر تحت شجرة فأراد أصحابه أن يُغيروا عليهم، فقال لهم: إن كنتم رجالاً فَغِيرُوا عليهم بحالكم دون مقالكم، فتوجهوا إلى الله بهممهم، فإذا القوم قد كسروا الأواني، وجاءوا إلى الشيخ تائبين\n وكذلك قضية معروف الكرخي مع أصحاب السفينة، الذي كانوا مشتغلين باللهو واللعب، فقال له أصحابه: ادع عليهم، فقال: اللهم كما فرَّحتَهم في الدنيا ففرِّحْهُم في الآخرة، فتابوا على يده جميعاً\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n\n",
      "translations": []
    }
  ]
}