{
  "chapter": "آل عمران",
  "text": "واعتصموا۟ بحبل الله جميعا ولا تفرقوا۟ واذكروا۟ نعمت الله عليكم اذ كنتم اعداء فالف بين قلوبكم فاصبحتم بنعمته اخونا وكنتم على شفا حفرة من النار فانقذكم منها كذلك يبين الله لكم ءايته لعلكم تهتدون",
  "translations": [
    {
      "translation": "Hold fast to the rope of Allah all together, and do not separate. Remember Allah's blessing to you when you were enemies and He joined your hearts together so that you became brothers by His blessing. You were on the very brink of a pit of the Fire and He rescued you from it. In this way Allah makes His Signs clear to you, so that hopefully you will be guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hold on firmly together to the rope of God, and be not divided among yourselves, and remember the favours God bestowed on you when you were one another's foe and He reconciled your hearts, and you turned into brethren through His grace. You had stood on the edge of a pit of fire and He saved you from it, thus revealing to you His clear signs that you may find the right way perchance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hold fast together to the cable of Allah and be not divided. Remember the blessing that Allah bestowed upon you: you were once enemies then He brought your hearts together, so that through His blessing you became brothers. You stood on the brink of a pit of fire and He delivered you from it. Thus Allah makes His signs clear to you that you may be guided to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All of you united hold fast to the rope of God (the Quran and His Messenger), and recall how He favored you when your hostility to each other had torn you apart. He united your hearts in one faith and through His Grace you became brothers. You were on the verge of falling headlong into the abyss of fire, but God saved you. This is how God explains to you His revelations so that you may have the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast to the rope of Allah, all of you together, and do not be divided; and remember Allah’s favour on you, that when there was enmity between you, He created affection between your hearts, so due to His grace you became like brothers to each other; and you were on the edge of a pit of fire (hell), so He saved you from it; this is how Allah explains His verses to you, so that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast, all of you together, to the Rope of Allah, and be not divided among yourselves, and remember Allah's favor on you, for you were enemies of one another but He joined your hearts together, so that, by His grace, you became brethren, and you were on the brink of a pit of Fire, and He saved you from it. Thus Allah makes His Ayat clear to you, that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast by the covenant of Allah all together and be not disunited, and remember the favor of Allah on you when you were enemies, then He united your hearts so by His favor you became brethren; and you were on the brink of a pit of fire, then He saved you from it, thus does Allah make clear to you His communications that you may follow the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold you fast to God's bond, together, and do not scatter; remember God's blessing upon you when you were enemies, and He brought your hearts together, so that by His blessing you became brothers. You were upon the brink of a pit of Fire, and He delivered you from it; even so God makes clear to you His signs; so haply you will be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast, all of you together, to the cable of Allah, and do not separate. And remember Allah's favour unto you: How ye were enemies and He made friendship between your hearts so that ye became as brothers by His grace; and (how) ye were upon the brink of an abyss of fire, and He did save you from it. Thus Allah maketh clear His revelations unto you, that haply ye may be guided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hold fast to the cord of God and let nothing divide you. Remember the blessings He has bestowed upon you; you were enemies and then He united your hearts and by His grace you became brothers; you were on the brink of an abyss of Fire and He rescued you from it. Thus God makes His signs clear to you, so that you may find guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold ye fast, all of you, to the cord of Allah, so and separate not. And remember Allah's favour unto you in that ye were enemies and He joined your hearts together, so ye became by His favour brethren; and ye were on the brink of an abyss of the Fire and He rescued you therefrom. In this wise Allah expoundeth unto you His revelations that haply ye may remain guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hold fast, all together, to Allah’s cord, and do not be divided [into sects]. Remember Allah’s blessing upon you when you were enemies, then He brought your hearts together, so you became brothers with His blessing. And you were on the brink of a pit of Fire, whereat He saved you from it. Thus does Allah clarify His signs for you so that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast, all together, by the rope which Allah (stretches out for you), and be not divided among yourselves; and remember with gratitude Allah's favour on you; for ye were enemies and He joined your hearts in love, so that by His Grace, ye became brethren; and ye were on the brink of the pit of Fire, and He saved you from it. Thus doth Allah make His Signs clear to you: That ye may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast, all of you together, to the Rope of Allah (i.e. this Quran), and be not divided among yourselves, and remember Allah's Favour on you, for you were enemies one to another but He joined your hearts together, so that, by His Grace, you became brethren (in Islamic Faith), and you were on the brink of a pit of Fire, and He saved you from it. Thus Allah makes His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.,) clear to you, that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast to the Bond of Allah, together, and do not scatter. Remember the Favor of Allah bestowed upon you when you were enemies, and how He united your hearts, so that by His Favor you became brothers. And how He saved you from the Pit of Fire when you were on the brink of it. And so Allah makes plain to you His verses, in order that you will be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold fast to the rope of God, altogether, and do not become divided. And remember God’s blessings upon you; how you were enemies, and He reconciled your hearts, and by His grace you became brethren. And you were on the brink of a pit of fire, and He saved you from it. God thus clarifies His revelations for you, so that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:103] And hold fast to, clutch, God’s bond, namely, His religion, together, and do not scatter, after submitting [to Islam]; remember God’s grace, His bestowing of favours, upon you, O companies of the Aws and the Khazraj, when you were enemies, and He brought your hearts together, through Islam, so that by His grace you became brothers, in religion and comradeship; and you were upon the brink, the edge, of a pit of fire, such that to fall into it you only had to die disbelieving; but He delivered you from it, through belief. So, just as He has made clear for you what has been mentioned, God makes clear to you His signs that you might be guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And hold fast, all of you together, to the cable of Allah) hold fast to the Religion of Allah and His Book, (and do not separate) in religion. (And remember Allah's favour unto you) by giving you Islam: (how ye were enemies) before Islam (and He made friendship between your hearts) through Islam (so that ye became as brothers by His grace) by His religion, Islam; (and (how) ye were upon the brink of an abyss of fire) i.e. because of disbelief, (and He did save you from it) by means of faith. (Thus Allah maketh clear His revelations) His commands, prohibitions and favours (unto you, that haply ye may be guided) from error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱعْتَصِمُواْ بِحَبْلِ ٱللَّهِ جَمِيعاً } فالاعْتِصَامُ: التَمسّكُ بِهِ والحَبْلُ: القُرآنُ\n والحَبْلُ: الجَمَاعَةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And hold fast to the rope of Allah all together,\" the holding fast is to the Qur'an.\n\n\nThe rope: the community",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واعْتَصمُوا بحَبْل الله جَميعاً } أي: بعهده في قوله:\n[الأعراف\n الآية: 172] مجتمعين على التوحيد { ولا تُفرقوا } باختلاف الأهواء\n فإن التفرّق عن الحق إنما يكون باختلاف الطبائع واتباع الهوى وتجاذب القوى\n والموحد عنها بمعزل\n إذ تنوّر قلبه بنور الحق واستنارت نفسه من فيض القلب فتسالمت القوى وتصادقت\n { واذْكروا نِعْمَةَ الله عَليكم } بالهداية إلى التوحيد المفيد للمحبة في القلوب { إذ كُنْتم أعْدَاء } لاحتجابكم بالحجب النفسانية والغواشي الطبيعية\n بُعَدَاء عن النور والمقاصد الكلية التي تقبل الشركة وتزال بالاتفاق في مهوى الظلمة { فألّف بينَ قُلُوبكم } بالتحابّ في الله لتتنوّر بنوره { فأصبحتُم بِنِعْمته إخواناً } في الدين\n أصدقاء في الله { وكنتم على شَفَا حُفْرة من النار } هي مهوى الطبيعة الفاسقة ومحل الحرمان والتعذيب { فأنقذكُم منها } بالتواصل الحقيقيّ بينكم إلى سدرة مقام الروح\n وروح جنة الذات { كذلك يبيّن الله لكم آياته } بتجليات الصفات اللطيفة والإشراقات النورية { لعلكم تَهْتدون } إلى جماله وتجلي ذاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد موتكم عن أنانيتكم { ٱعْتَصِمُواْ } أيها المخلصون الموقنون { بِحَبْلِ ٱللَّهِ } الممتد من أزل الذات إلى أبد الأسماء والصفات\n وارفعوا أنانيتكم وهويتكم عن البين { جَمِيعاً } حتى لايبقى توهم الغير والسوى مطلقاً\n وتخلص نفوسكم عن مشتهياتها ومستلذاتها الفانية\n وتصل إلى الحياة الأزلية والبقاء السرمدي { وَلاَ تَفَرَّقُواْ } أي: لا تتفرقوا بمقتضيات أوهامكم المتفرعة على هوياتكم الباطلة عن الحقية الحقيقية { وَ } بعدما وصلتهم بمقام الجمعية والوحدة الذاتية { ٱذْكُرُواْ } أيها العكوس والأظلال { نِعْمَتَ ٱللَّهِ } المتجلي فيكم بذاته المتفضل { عَلَيْكُمْ } بلا عوض ولا غرض { إِذْ كُنْتُمْ أَعْدَآءً } بعداء متروكين في ظلمة العدم\n\n{ فَأَلَّفَ } سبحانه بتجلياته الجمالية على مرأة العدم { بَيْنَ قُلُوبِكُمْ } في قضاء الإمكان\n بأن يجعلكم أزواجاً وبنين وحفدة\n متظاهرين بعضكم ببعض على مقتضى الإضافات\n ورقائق المناسبات الرافعة بين الأوصاف والأسماء الإلهية { فَأَصْبَحْتُمْ } بعدما تيقظتم عن منام الإمكان { بِنِعْمَتِهِ } التي هي التوفيق والإقدار على طلب الرشد والرشاد { إِخْوَاناً } مجتمعين في فضاء الوحدة بلا توهم الكثرة المستدعية للعداوة والخصومة\n\n\n{ وَ } الحال أنكم { كُنْتُمْ } في طغيان الإمكان { عَلَىٰ شَفَا } طرف { حُفْرَةٍ } مُلئت { مِّنَ ٱلنَّارِ } مشرفين بالوقوع فيها\n وهي حفرة العدم المباين لقضاء الوجود\n المملوءة بنيران البعد والخذلان { فَأَنقَذَكُمْ } الله\n أي: أنجاكم وخلصكم { مِّنْهَا } بلفطه\n بأن أودع فيكم العقل الجزئي المتشعب من العقل الكلي العائد إليه { كَذٰلِكَ يُبَيِّنُ ٱللَّهُ } الهادي { لَكُمْ } دائماً مستمراً إلى توحيده الذاتي { آيَاتِهِ } آثار أسمائه وأوصافه الدالة على ذاته { لَعَلَّكُمْ تَهْتَدُونَ } [آل عمران: 103] رجاء أن تهتدوا منها إليها لغاية ظهورها ووضوحها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: أصل الحبل في اللغة: السبب المُوصِّل إلى البغية، سمى به الإيمان أو القرآن لأنه يُوصل إلى السعادة السرمدية، و { شفا حفرة } ، وأصله: شفو، فقلبت ألفاً في المذكر، وحذفت في المؤنث، فقالوا: شفة. يقول الحقّ جلّ جلاله: { واعتصموا } أي: تمسكوا يا معشر المسلمين { بحبل الله } أي: الإيمان، أو كتاب الله، لقوله عليه الصلاة والسلام:\n \" إنَّ هذا القرآن هو حَبْلُ الله المّتِين، وهو النورُ المُبِينُ، والشِّفَاءُ النافِعُ، عِصْمَةٌ لِمَنْ تَمَسَّكَ به... \" \nالحديث. حال كونكم { جميعاً } أي: مجتمعين عليه، { ولا تفرقوا } تفرقكم الجاهلي، أو لا تفرقوا عن الحق بوقوع الاختلاف بينكم كأهل الكتاب. قال عليه الصلاة والسلام:\n \" إنَّ بَني إسْرائيلَ افتَرقَتْ على إحْدى وسَبْعِينَ فِرْقةً، وإنَّ أُمَّتِي سَتَفْتَرِقُ على ثِنتَيْنِ وسَبْعِينَ فِرْقَةً، كُلّها في النَّارِ إلا واحِدَةً، فقيل: يا رسول الله، ما هذه الواحدة؟ فقبض يده وقال: الجَمَاعَةُ، ثمَّ قرأ: { وَاعْتَصِمُوا بِحَبْلِ اللّهِ جَمِيعاً وَلا تَفَرَّقُوا } \". \n{ واذكروا نعمت الله عليكم } ، التي من جملتها الهداية للإسلام المؤدِّي إلى التآلف وزوال الغِلِّ، { إذ كنتم أعداء } في الجاهلية، يقتل بعضُكم بعضاً، { فألّف بين قلوبكم } بالإسلام، { فأصبحتم بنعمته إخواناً } متحابين مجتمعين على الأخوة في الله. قال عليه الصلاة والسلام:\n \" لا تَحَاسَدُوا، ولا تَبَاغَضُوا، ولا تَدَابَرُوا، وكُونُوا عبادَ الله إخْواناً، المسلمُ أَخُوا المسلمُ لا يَظْلِمُه ولا يَخْذُلُه \" \nالحديث. رُوي أن الأوس والخزرج كانوا أخَوَيْن، فوقع بين أولادهما العداوة، وتطاولت الحرب بينهما مائة وعشرين سنة، حتى أطفأها الله بالإسلام، وألف بينهم برسول الله عليه الصلاة والسلام - فنزلت فيهم هذه الآية. ثم قال لهم: { وكنتم على شفا حفرة من النار } أي: مُشرفين على نار جهنم، إذ لو أدرككم الموت لوقعتم في النار، { فأنقذكم } الله { منها } برسوله - عليه الصلاة والسلام -: رُوِيَ أن أعرابيّاً سمع ابن عباس يقرأ هذه الآية، فقال الأعرابي: والله ما أنقذهم منها وهو يريد أن يوقعهم فيها، فقال ابن عباس رضي الله عنه خذوها من غير فقيه. هـ. { كذلك يبين الله لكم آياته } أي: مثل هذا النبيين { يبين الله لكم آياته لعلكم تهتدون } إلى الخير، وتزيدون ثباتاً فيه. الإشارة: المذاهب كلها وقع فيها الاختلاف والتفرق في الأصول والفروع، إلا مذاهب الصوفية فكلها متفقة بداية ونهاية، إذ بدايتهم مجاهدة، ونهايتهم مشاهدة، وإلى ذلك أشار في المباحث، حث قال:\nوإن وقع الاختلاف في بعض الطرق الموصلة إلى المقصود، فقد اتفقت في النهاية، بخلاف أهل الظاهر، لا تجدهم يتفقون إلا في مسائل قليلة، لأن مذهبهم مبني على غلبة الظن، ومذهب القوم مبني على التحقيق ذوقاً وكشفاً، وكذلك ائتلفت أيضاً قلوبهم وأرواحهم، إذ كلهم متخلقون بالشفقة والرأفة والمودة والألفة والصفا لأنهم دخلوا الجنة - أعني جنة المعارف - فتخلقوا بأخلاق أهل الجنة، قال تعالى:\n[الحِجر: 47]، فيقال لهم بعد الفتح: واذكروا نعمة الله عليكم، إذ كنتم أعداء قبل اتصالكم بالطبيب، فألف بين قلوبكم، فأصبحتم بنعمته أخواناً متحابين، وكنتم على شفا حفرة من نار القطيعة والحجاب { فأنقذكم منها }. مثل هذا البيان يوضح الله آياته، أي: تجلياته، لعلكم تهتدون إلى مشاهدة ذاته في أنوار صفاته. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:10",
      "similarity": 0.4662529562529775
    },
    {
      "verse": "39:19",
      "similarity": 0.22374862295703135
    },
    {
      "verse": "9:109",
      "similarity": 0.21851343022486036
    },
    {
      "verse": "36:23",
      "similarity": 0.21066439882440352
    },
    {
      "verse": "36:43",
      "similarity": 0.19011081836133165
    }
  ]
}