{
  "chapter": "آل عمران",
  "text": "ان الذين كفروا۟ لن تغنى عنهم امولهم ولا اولدهم من الله شيـا واو۟لئك هم وقود النار",
  "translations": [
    {
      "translation": "Our Lord, You are the Gatherer of mankind to a Day of which there is no doubt. Allah will not break His promise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny, neither their wealth nor their children will help them in the least against God. They shall be but faggots for (the fire of) Hell,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, neither their wealth nor their offspring will avail them at all against Allah, and it is they who will be the fuel of the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wealth and children of the unbelievers will never serve them as a substitute for their belief in God. Such people will be the fuel for the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed for those who disbelieve, neither their wealth nor their offspring will help to save them in the least from Allah; and it is they who are fuel for the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, neither their properties nor their offspring will avail them whatsoever against Allah; and it is they who will be fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve, surely neither their wealth nor their children shall avail them in the least against Allah, and these it is who are the fuel of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, their riches will not avail them, neither their children, aught against God; those -- they shall be fuel for the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On that Day) neither the riches nor the progeny of those who disbelieve will aught avail them with Allah. They will be fuel for Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny the truth, their wealth and children will not help them against God. They will be fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve-neither their riches nor their offspring shall avail them aught with Allah. and these! they shall be the fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, neither their wealth nor their children shall avail them anything against Allah; it is they who will be fuel for the Fire;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Faith,- neither their possessions nor their (numerous) progeny will avail them aught against Allah: They are themselves but fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, neither their properties nor their offspring will avail them whatsoever against Allah; and it is they who will be fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, neither their riches nor their children shall save them from Allah. They shall become the fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, neither their wealth nor their children will avail them anything against God. These will be fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all. And it is they who are fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:10] As for the disbelievers, neither their riches nor their children will avail, will protect, them against God, that is, [against] His chastisement; those — they shall be fuel for the Fire, [they shall constitute] what the Fire will be fuelled by (read waqūd [as opposed to wuqūd], ‘fuel’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف كلام ناشيء عن حكاية ما دعا به المؤمنون : من دوام الهداية ، وسؤال الرحمة ، وانتظار الفوز يوم القيامة ، بذكر حال الكافرين في ذلك اليوم ، على عادة القرآن في إرداف البشارة بالنذارة . وتعقيب دعاء المؤمنين ، بذكر حال المشركين ، إيماء إلى أنّ دعوتهم استجيبت . والمراد بالذين كفروا : المشركون ، وهذا وصف غالب عليهم في اصطلاح القرآن وقيل : الذين كفروا بنبوءة محمد صلى الله عليه وسلم أريد هنا قُريظة والنضير وأهلُ نجران؛ ويُرجَّح هذا بأنّهم ذُكِّروا بحال فرعون دون حال عاد وثمود فإنّ اليهودوالنصارى أعلق بأخبار فرعون . كما أنّ العرب أعلق بأخبار عاد وثمود ، وأنّ الردّ على النصارى من أهمّ أغراض هذه السورة . ويجوز أن يكون المراد جميع الكافرين : من المشركين ، وأهل الكتابَيْن ، ويكون التذكير بفرعون لأنّ وعيد اليهود في هذه الآية أهم .ومعنى «تُغني» تُجزِي وتكفي وتدفع ، وهو فِعل قاصر يتعدّى إلى المفعول بعن نحو : «ما أغني مَالِيَهْ» .ولدلالة هذا الفعل على الإجزاء والدفع ، كان مؤذناً بأنّ هنالك شيئاً يدفع ضُرّه ، وتُكفى كلفتُه ، فلذلك قَد يذكرون مع هذا الفعل متعلِّقاً ثانياً ويُعَدُّونَ الفعل إليه بحرف ( مِن ) كما في هذه الآية . فتكون ( مِن ) للبدل والعوض على ما ذهب إليه في «الكشاف» ، وجعل ابن عطية ( من ) للابتداء .وقوله : { من الله } أي من أمر يضاف إلى الله؛ لأنّ تعليق هذا الفعل ، تعليقاً ثانياً ، باسم ذات لايقصد منه إلاّ أخصّ حال اشتهرت به ، أو في الغرض المسوق له الكلام فيقدّر معنى اسم مضاف إلى اسم الجلالة . والتقدير هنا من رحمة الله ، أو من طاعته ، إذا كانت ( مِنْ ) للبدل وكَذا قدّره في «الكشاف» ، ونظّره بقوله تعالى : { وإنّ الظنّ لا يغني من الحق شيئاً } \\[ النجم : 28 \\] . وعلى جعل ( من ) للابتداء كما قال ابن عطية تقدّر من غضب الله ، أو من عذابه ، أي غناء مبتدِئاً من ذلك : على حدّ قولهم : نَجَّاه من كذا أي فصله منه ، ولا يلزم أن تكون ( مِن ) مَعَ هذا الفعل ، إذا عدّي بعَن ، مماثلة لمِنْ الواقعة بعد هذا الفعل الذي يُعَدّ بعن ، لإمكان اختلاف معنى التعلّق باختلاف مساق الكلام . والغالب أن يأتوا بعد فعل أغنى بلفظ ( شيء ) مع ذكر المتعلِّقين كما في الآية ، وبدون ذكر متعلِّقين ، كما في قول أبي سفيان ، يومَ أسْلَمَ : «لقد علمتُ أنْ لَوْ كان معه إله غيرُه لقد أغنى عنّي شيئاً» .وانتصب قوله : { شيئاً } على النيابة عن المفعول المطلق أي شيئاً من الغَناء . وتنكيره للتحقير أي غناء ضعيفاً ، بله الغناء المهم ، ولا يجوز أن يكون مفعولاً به لعدم استقامة معنى الفعل في التعدي .وقد ظهر بهذا كيفية تصرفّ هذا الفعل التصرّفَ العجيب في كلامهم ، وانفتح لك ما انغلق من عبارة الكشّاف ، وما دونها ، في معنى هذا التركيب .وقد مرّ الكلام على وقوع لفظ شيء عند قوله : { ولنبلونَّكم بشيء من الخوف } \\[ البقرة : 155 \\] . وإنّما خصّ الأموال والأولاد من بين أعلاق الذين كفروا؛ لأنّ الغناءَ يكون بالفداء بالمال ، كدفع الديات والغرامات ، ويكون بالنصر والقتال ، وأوْلى مَن يدافع عن الرجل ، من عشيرته ، أبناؤه ، وعن القبيلة أبناؤُها . قال قيس بن الخطيم: ... ثَأرْتُ عَدِيَّا والخَطِيمَ ولَمْ أضعْوَلاَيَة أشْيَاخخٍ جُعِلْتُ إزَاءَها ... والأموال المكاسب التي تقتات وتدخّرُ ويتعاوض بها ، وهي جمع مال ، وغلب اسم المال في كلام جلِّ العرب على الإبل قال زهير: ... صَحيحاتتِ ماللٍ طَالعات بمخرموغلب في كلام أهل الزرع والحرث على الجنّات والحوائط وفي الحديث « كان أبو طلحة أكثرَ أنصاري بالمدينة مالاً وكان أحَبُّ أمواله إليه بئر حاء » ، ويطلق المال غالباً على الدراهم والدنانير كما في قول النبي صلى الله عليه وسلم للعباس « أيْن المال الذي عند أم الفضل . » والظاهر أنّ هذا وعيد بعذاب الدنيا؛ لأنّه شُبِّه بأنّه { كدأب ءال فرعون } إلى قوله { فأخذهم الله بذنوبهم } وشأنُ المشبّه به أن يكون معلوماً؛ ولأنّه عطف عليه عذاب الآخرة في قوله : { وأولئك هم وقود النار } .وجيء بالإشارة في قوله : { وأولئك } لاستحضارهم كأنّهم بحيث يشار إليهم ، وللتنبيه على أنّهم أحرياء بما سيأتي من الخَبر وهو قوله : { هم وقود النار } . وعطفت هذه الجملة ، ولم تفصل ، لأنّ المراد من التي قبلهالا وعيد في الدنيا وهذه في وعيد الآخرة بقرينة قوله ، في الآية التي بعد هذه : { ستُغْلبون وتحشرون إلى جهنّم وبئس المهاد } \\[ آل عمران : 12 \\] . والوَقود بفتح الواو ما يوقد به كالوَضوء ، وقد تقدّم نظيره في قوله : { التي وقودها الناس والحجارة } في سورة البقرة .\n\n",
      "translations": [
        {
          "translation": "((On that day) neither the riches) the abundance of riches (nor the progeny) nor the abundance of progeny (of those who disbelieve) i.e. Ka'b Ibn al-Ashraf and his fellow companions; and it is also said that this refers to Abu Jahl and his companions (will aught avail them with Allah) will not avail them anything from Allah's torment. (They will be fuel for fire) they are the firewood of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلاَ أَوْلاَدُهُم مِّنَ ٱللَّهِ شَيْئاً } معناه من عِنْدِ الله شيئاً\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Their wealth and their children will not avail them against Allah at all\" - this means that nothing from Allah will avail them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ كَفَرُواْ } بالله\n وأعرضوا عن كتبه ورسله وأصروا عليه اغترارً بمزخرفاتهم الباطلة من الأموال والأولاد { لَن تُغْنِيَ } وترفع { عَنْهُمْ } في النشأة الأخرى { أَمْوَالُهُمْ وَلاَ أَوْلاَدُهُم مِّنَ } غضب { ٱللَّهِ شَيْئاً وَأُولَـٰئِكَ } المصرون المعاندون فيها { هُمْ وَقُودُ ٱلنَّارِ } [آل عمران: 10] أي: أجسامهم وقود نار الحسرة و الخذلان دأبهم وديدنتهم في النشأة الأولى\n\n\n{ كَدَأْبِ آلِ فِرْعَوْنَ وَٱلَّذِينَ } مضروا { مِن قَبْلِهِمْ } كعاد وثمود { كَذَّبُواْ بِآيَاتِنَا } الدالة على توحيدنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الوقود } بالفتح: الحطب\n وبالضم: المصدر\n { كدأب آل فرعون } خير\n أي: دأبهم كدأب آل فرعون\n والدأب\n مصدر دأب\n إذا دام\n ثم نقل إلى الشأن والعادة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "104:6",
      "similarity": 0.766434631134706
    },
    {
      "verse": "85:5",
      "similarity": 0.7439015112254715
    },
    {
      "verse": "2:24",
      "similarity": 0.6076315751980317
    },
    {
      "verse": "3:116",
      "similarity": 0.5351365746307962
    },
    {
      "verse": "58:17",
      "similarity": 0.5142073702945049
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}