{
  "chapter": "آل عمران",
  "text": "ولا تكونوا۟ كالذين تفرقوا۟ واختلفوا۟ منۢ بعد ما جاءهم البينت واو۟لئك لهم عذاب عظيم",
  "translations": [
    {
      "translation": "Do not be like those who split up and differed after the Clear Signs came to them. They will have a terrible punishment",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not like those who became disunited and differed among themselves after clear proofs had come to them. For them is great suffering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who fell into factions and differed among themselves after clear signs had come to them. A mighty chastisement awaits them on the Day when some faces will turn bright and ther faces will turn dark. Those whose faces have turned dark will be told: 'Did you fall into unbelief after you had been blessed with belief? Taste, then, chastise- ment for your unbelief.' And those whose faces have turned bright, they will be in the mercy of Allah, and therein they shall abide. These are the mes sages of Allah which We recite to you in truth, and Allah desires no wrong to the people of the world. To Allah belongs all that is in the heavens and the earth, and to Allah are all matters referred for decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who turned into quarrelling sects after receiving clear authoritative evidence. They will suffer a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who became divided and disputed after the clear signs had come to them; and for them is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not as those who divided and differed among themselves after the clear proofs had come to them. It is they for whom there is an awful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who became divided and disagreed after clear arguments had come to them, and these it is that shall have a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not as those who scattered and fell into variance after the clear signs came to them; those there awaits a mighty chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be ye not as those who separated and disputed after the clear proofs had come unto them. For such there is an awful doom,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who, after they had been given clear evidence, split into factions and differed among themselves: a terrible punishment awaits such people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like unto those who separated and differed among themselves after there had come unto them evidences. These! for them shall be a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who became divided [into sects] and differed after manifest signs had come to them. For such there will be a great punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not like those who are divided amongst themselves and fall into disputations after receiving Clear Signs: For them is a dreadful penalty,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not as those who divided and differed among themselves after the clear proofs had come to them. It is they for whom there is an awful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not follow the example of those who became divided and differed with one another after clear proofs had come to them. For those, there is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who separated and disputed after the clear proofs came to them; for them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like the ones who became divided and differed after the clear proofs had come to them. And those will have a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:105] Be not as those who scattered, in their religion, and disputed, over it, after the clear proofs came to them, and these are the Jews and the Christians, those there awaits a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And be ye not) divided in religion (as those who separated and disputed) in religion, such as the religious schisms that took place among the Jews and Christians (after the clear proofs) proofs from their Scriptures of Islam (had come unto them. For such) i.e. the Jews and Christians (there is an awful doom) greater than anything one can imagine.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { ولا تكونوا } ناشئين بمقتضى طباعكم غير متابعين لإمام ولا متفقين على كلمة واحدة باتباع مقدم يجمعكم على طريقة واحدة { كالذين تفرقوا } واتبعوا الأهواء والبدع { واختلفوا من بعد ما جَاءَهم } الحجج العقلية والشرعية الموجبة لاتحاد الوجهة\n واتفاق الكلمة\n فإن للناس طبائع وغرائز مختلفة وأهواء متفرّقة\n وعادات وسيراً متفاوتة\n مستفادة من أمزجتهم وأهويتهم\n ويترتب على ذلك فهوم متباينة\n وأخلاق متعادية\n فإن لم يكن لهم مقتدى وإمام تتحد عقائدهم وسيرهم وآراؤهم بمتابعته\n وتتفق كلماتهم وعاداتهم وأهواؤهم بمحبته وطاعته كانوا مهملين متفرّقين فرائس للشيطان كشريدة الغنم تكون للذئب\n ولهذا قال أمير المؤمنين عليّ عليه السلام: \" لا بدّ للناس من إمام برّ أو فاجر \"\n\nولم يرسل نبيّ الله صلى الله عليه وسلم رجلين فصاعداً لشأن إلا وأمر أحدهما على الآخر وأمر الآخر بطاعته ومتابعته ليتحد الأمر وينتظم\n وإلا وقع الهرج والمرج\n واضطراب أمر الدين والدنيا\n واختلّ نظام المعاش والمعاد\n  قال رسول الله صلى الله عليه وسلم:\n \" من فارق الجماعة قيد شبر لم ير بحبوحة الجنّة \" \nوقال صلى الله عليه وسلم:\n \" الله مع الجماعة \" \nألا ترى أن الجمعية الإنسانية إذا لم تنضبط برياسة القلب وطاعة العقل كيف اختل نظامها وآلت إلى الفساد والتفرّق الموجب لخسارة الدنيا والآخرة\n ولما نزل قوله تعالى:\n[الأنعام\n الآية: 153]\n\n \" خطّ رسول الله صلى الله عليه وسلم خطّاً فقال: \" هذا سبيل الرشد \" \n ثم خطّ عن يمينه وشماله خطوطاً فقال: \" هذه سبل كلّ سبيل شيطان يدعوه إليه \" \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَكُونُواْ } أيها المحمديون المتحققون بمقام الجمعية { كَٱلَّذِينَ تَفَرَّقُواْ وَٱخْتَلَفُواْ مِن بَعْدِ مَا جَآءَهُمُ ٱلْبَيِّنَاتُ } الدالة على الجمعية والاتفاق\n ولم ينتبهوا منها إلى التوحيد الذاتي { وَأُوْلَـٰئِكَ } الأشقياء الهاكلون في تيه الخذلان والحرمان { لَهُمْ عَذَابٌ عَظِيمٌ } [آل عمران: 105] في جهنم البعد والإمكان وسعير الشرك والطغيان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { يوم } متعلق بالاستقرار في خبر { أولئك } \n أو باذكر محذوفة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "98:4",
      "similarity": 0.6247812913528528
    },
    {
      "verse": "24:47",
      "similarity": 0.45461747826775595
    },
    {
      "verse": "77:4",
      "similarity": 0.440680733913984
    },
    {
      "verse": "8:29",
      "similarity": 0.38199529937585186
    },
    {
      "verse": "23:109",
      "similarity": 0.3693726830851036
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003105.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003105.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:105.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}