{
  "chapter": "آل عمران",
  "text": "ولتكن منكم امة يدعون الى الخير ويامرون بالمعروف وينهون عن المنكر واو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "Let there be a community among you who call to the good, and enjoin the right, and forbid the wrong. They are the ones who have success.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let there be a body among you who may call to the good, enjoin what is esteemed and forbid what is odious. They are those who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among you there must be a party who invite people to all that is good and enjoin the doing of all that is right and forbid the doing of all that is wrong. It is they who will attain true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be a group among you who will invite others to do good deeds, command them to obey the Law, and prohibit them from committing sins. These people will have eternal happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there should be a group among you that invites to goodness, and enjoins good deeds and forbids immorality; it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there arise out of you a group of people inviting to all that is good (Islam), enjoining Al-Ma`ruf (all that Islam orders) and forbidding Al-Munkar (all that Islam has forbidden). And it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among you there should be a party who invite to good and enjoin what is right and forbid the wrong, and these it is that shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be one nation of you, calling to good, and bidding to honour, and forbidding dishonour; those are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there may spring from you a nation who invite to goodness, and enjoin right conduct and forbid indecency. Such are they who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be a group among you who call others to good, and enjoin what is right, and forbid what is wrong: those who do this shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let there be of you a community calling others to good and commanding that which is reputable and prohibiting that which is disreputable. And these they are the blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has to be a nation among you summoning to the good, bidding what is right, and forbidding what is wrong. It is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there arise out of you a band of people inviting to all that is good, enjoining what is right, and forbidding what is wrong: They are the ones to attain felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there arise out of you a group of people inviting to all that is good (Islam), enjoining Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do) and forbidding Al-Munkar (polytheism and disbelief and all that Islam has forbidden). And it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be one nation of you that shall call to righteousness, ordering honor, and forbidding dishonor. Those are the prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let there be among you a community calling to virtue, and advocating righteousness, and deterring from evil. These are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:104] Let there be one community of you calling to good, to Islam, and enjoining decency, and forbidding indecency; those, that call, bid and forbid, are the successful, the victorious (the particle min, ‘of’, [in minkum, ‘of you’] is partitive, since what is mentioned is a collective obligation [fard kifāya], and is not incumbent upon every individual of the community, for not every person, such as the ignorant, is up to it. However, it is also said that this particle is extra, and what is meant is, ‘so that you are a community [calling to good and so on]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا مفرّع عن الكلام السَّابق : لأنَّه لمّا أظهر لهم نعمة نقلهم من حالتي شقاء وشناعة إلى حالتي نعيم وكَمال ، وكانوا قد ذاقوا بين الحالتين الأمَرّيْن ثُمّ الأَحْلَوَيْن ، فحلبوا الدّهر أشطريه ، كانوا أحرياء بأن يَسعوا بكل عزمهم إلى انتشال غيرهم من سُوء ما هو فيه إلى حُسنى ما هُم عليه حتَّى يكون النَّاس أمَّة واحدة خيِّرة . وفي غريزة البشر حبّ المشاركة في الخير لذلك تجد الصّبي إذا رأى شيئاً أعجبه نادى من هو حوله ليراه معه .ولذلك كان هذا الكلام حرياً بأن يعطف بالفاء ، ولو عطف بها لكان أسلوباً عربياً إلاّ أنّه عُدل عن العطف بالفاء تنبيهاً على أن مضمون هذا الكلام مقصود لذاته بحيث لو لم يسبقه الكلام السابق لكان هو حريّاً بأن يؤمر به ، فلا يكونُ مذكوراً لأجل التفرّع عن غيره والتبع .وفيه من حسن المقابلة في التَّقسيم ضرب من ضروب الخطابة : وذلك أنَّه أنكر على أهل الكتاب كفرهم وصدّهم النَّاس عن الإيمان ، فقال : { قل يا أهل الكتاب لم تكفرون بآيات الله والله شهيد على ما تعملون قل يا أهل الكتاب لم تصدون عن سبيل الله } \\[ آل عمران : 98 ، 99 \\] الآية .وقابل ذلك بأن أمر المؤمنين بالإيمان والدعاء إليه إذ قال : { يا أيها الذين آمنوا اتقوا الله حق تقاته } \\[ آل عمران : 102 \\] وقوله : { ولتكن منكم أمة يدعون إلى الخير } الآية .وصيغة { ولتكن منكم أمَّة } صيغة وجوب لأنَّها أصرح في الأمر من صيغة افعلوا لأنَّها أصلها . فإذا كان الأمر بالمعروف والنَّهي عن المنكر غير معلوم بينهم من قبل نزوللِ هذه الآية ، فالأمرُ لتشريع الوجوب ، وإذا كان ذلك حاصلاً بينهم من قبل كما يدلّ عليه قوله : { كنتم خير أمة أخرجت للناس تأمرون بالمعروف وتنهون عن المنكر } \\[ آل عمران : 110 \\] فالأمر لتأكيد ما كانوا يفعلونه ووجوبه ، وفيه زيادة الأمر بالدّعوة إلى الخير وقد كان الوجوب مقرّراً من قبل بآيات أخرى مثل : { وتواصوا بالحق وتواصوا بالصبر } \\[ العصر : 3 \\] ، أو بأوامر نبويَّة . فالأمر لتأكيد الوجوب أيضا للدلالة على الدّوام والثبات عليه ، مثل { يأيها الذين آمنوا آمنوا باللَّه } \\[ النساء : 136 \\] .والأمَّة الجماعة والطائفة كقوله تعالى : { كلما دخلت أمة لعنت أختها } \\[ الأعراف : 38 \\] .وأصل الأمَّة في كلام العرب الطَّائفة من النَّاس الَّتي تؤمّ قصداً واحداً : من نسب أو موطن أو دين ، أو مجموع ذلك ، ويتعيّن ما يجمعها بالإضافة أو الوصف كقولهم : أمَّة العرب وأمّة غسان وأمّة النصارى .والمخاطب بضمير ( منكم ) إن كان هم أصحابَ رسول الله كما هو ظاهر الخطابات السابقة آنِفاً جاز أن تكون ( مِن ) بَيانيَّة وَقُدّم البيانُ على المبيَّن ويكون ما صْدق الأمّة نفس الصّحابة ، وهم أهل العصر الأول من المسلمين فيكون المعنى : ولتكونوا أمَّة يدعون إلى الخير فهذه الأمَّة أصحاب هذا الوصف قد أمروا بأن يكوِّنوا من مجموعهم الأمَّة الموصوفة بأنهم يدعون إلى الخير ، والمقصود تكوين هذا الوصف ، لأنّ الواجب عليهم هو التَّخلق بهذا الخلق فإذا تخلّقوا به تكوّنت الأمَّة المطلوبة .وهي أفضل الأمم . وهي أهل المدينة الفاضلة المنشود للحكماء من قبل ، فجَاءت الآية بهذا الأمر على هذا الأسلوب البليغ الموجز .وفي هذا محسِّن التجريد : جُرّدت من المخاطبين أمَّة أخرى للمبالغة في هذا الحكم كما يقال : لِفلان من بنيه أنصار . والمقصود : ولتكونوا آمرين بالمعروف ناهين عن المنكر حتَّى تكونوا أمَّة هذه صفتها ، وهذا هو الأظهر فيكون جميع أصحاب رسول الله صلى الله عليه وسلم قد خوطبوا بأن يكونوا دعاة إلى الخير ، ولا جرم فهم الَّذين تلقوا الشَّريعة من رسول الله صلى الله عليه وسلم مباشرة ، فهم أولى النَّاس بتبليغها . وأعلم بمشَاهِدها وأحوالها ، ويشهد لهذا قوله صلى الله عليه وسلم في مواطن كثيرة : « ليبلغ الشاهد الغائب أَلاَ هل بلّغت » وإلى هذا المحمل مال الزجاج وغير واحد من المفسّرين ، كما قاله ابن عطية .ويجوز أيضاً على اعتبار الضّمير خطابا لأصحاب محمَّد صلى الله عليه وسلم أن تكون ( من ) للتبعيض ، والمراد من الأمّة الجماعة والفريق ، أي : وليكن بعضكم فريقاً يدعون إلى الخير فيكون الوجوب على جماعة من الصّحابة فقد قال ابن عطية : قال الضّحاك ، والطبري : أمر المؤمنين أن تكون منهم جماعة بهذه الصّفة . فهم خاصّة أصحاب الرسول وهم خاصّة الرواة .وأقول : على هذا يثبت حكم الوجوب على كلّ جيل بعدهم بطريق القياس لئلا يتعطّل الهدى . ومن النَّاس من لا يستطيع الدّعوة إلى الخير ، والأمر بالمعروف ، والنَّهي عن المنكر قال تعالى : { فلولا نفر من كل فرقة منهم طائفة ليتفقهوا في الدين ولينذروا قومهم } \\[ التوبة : 122 \\] الآية .وإن كان الخطاب بالضّمير لجميع المؤمنين تبعاً لكون المخاطب بيَأيها الّذين آمنوا إيَّاهم أيضاً ، كانت ( مِنْ ) للتبعيض لا محالة ، وكان المراد بالأمّة الطائفة إذ لا يكون المؤمنون كُلّهم مأمورين بالدعاء إلى الخير ، والأمر بالمعروف ، والنهي عن المنكر ، بل يكون الواجب على الكفاية وإلى هذا المعنى ذهب ابن عطية ، والطبري ، ومن تبعهم ، وعلى هذا فيكون المأمور جماعة غير معيّنة وإنما المقصود حصول هذا الفعل الَّذى فُرض على الأمَّة وقُوعُه .على أنّ هذا الاعتبار لا يمنع من أن تكون ( مِن ) بيانية بمعنى أن يكونوا هم الأمّة ويكون المراد بكونهم يدعون إلى الخير ، ويأمرون بالمعروف ، وينهون عن المنكر ، إقامة ذلك فيهم وأن لا يخلُوا عن ذلك على حسب الحاجة ومقدار الكفاءة للقيام بذلك ، ويكون هذا جارياً على المعتاد عند العرب من وصف القبيلة بالصّفات الشائعة فيها الغالبة على أفرادها كقولهم : بَاهِلَة لِئَام ، وعُذْرةُ عُشَّاق .وعلى هذه الاعتبارات تجري الاعتبارات في قوله : { ولا تكونوا كالذين تفرقوا } كما سيأتي .إنّ الدعوة إلى الخير تتفاوت : فمنها ما هو بيّن يقوم به كلّ مسلم ، ومنها ما يحْتاج إلى علم فيقوم به أهله ، وهذا هو المسمّى بفرض الكفاية ، يعني إذا قام به بعض النَّاس كفَى عن قيام الباقين ، وتتعيَّن الطائفة الَّتي تقوم بها بتوفّر شروط القيام بمثل ذلك الفعل فيها .كالقوة على السلاح في الحرب ، وكالسباحة في إنقاذ الغريق ، والعلم بأمور الدّين في الأمر بالمعروف والنَّهي عن المنكر ، وكذلك تَعيّن العدد الَّذي يكفي للقيام بذلك الفعل مثل كون الجيش نصفَ عدد جيش العدوّ ، ولمَّا كان الأمر يستلزم متعلِّقاً فالمأمور في فرض الكفاية الفريق الّذين فيهم الشروط ، ومجموعُ أهل البلد ، أو القبيلة ، لتنفيذ ذلك ، فإذا قام به العدد الكافي ممّن فيهم الشروط سقط التكليف عن الباقين ، وإذا لم يقوموا به كان الإثم على البلد أو القبيلة ، لسكوت جميعهم ، ولتقاعس الصَّالحين للقيام بذلك ، مع سكوتهم أيضا ثمّ إذا قام به البعض فإنَّما يُثاب البعض خاصّة .ومعنى الدعاء إلى الخير الدعاء إلى الإسلام ، وبثّ دعوة النّبيء صلى الله عليه وسلم فإنّ الخير اسم يجمع خصال الإسلام : ففي حديث حذيفة بن اليَمان « قلت : يا رسول الله إنّا كنّا في جاهلية وشَرّ فجاءَنا الله بهذا الخيْرِ فهل بعد هذا الخير من شرّ » الحديث ، ولذلك يكون عطف الأمر بالمعروف والنّهي عن المنكر عليه من عطف الشيء على مغايره ، وهو أصل العطف . وقيل : أريد بالخير ما يشمل جميع الخيرات ، ومنها الأمر بالمعروف والنَّهي عن المنكر ، فيكون العطف من عطف الخاصّ على العامّ للاهتمام به .وحذفت مفاعيل يَدعون ويأمرون وَيَنهَوْن لقصد التَّعميم أي يَدعون كلّ أحد كما في قوله تعالى : { واللَّهُ يدعو إلى دار السَّلام } \\[ يونس : 25 \\] .والمعروف هو ما يعرف وهو مجاز في المقبول المرضي به ، لأنّ الشيء إذا كان معروفاً كان مألوفاً مقبولاً مرضيّاً به ، وأريد به هنا ما يُقبل عند أهل العقول ، وفي الشَّرائع ، وهو الحقّ والصلاح ، لأنّ ذلك مقبول عند انتفاء العوارض .والمنكر مجاز في المكروه ، والكُرْه لازم للإنكار لأنّ النكر في أصل اللِّسان هو الجهل ومنه تسمية غير المألوف نكرة ، وأريد به هنا الباطل والفساد ، لأنَّهما من المكروه في الجبلّة عند انتفاء العوارض .والتَّعريف في ( الخير والمعروف والمنكر ) تعريف الاستغراق ، فيفيد العموم في المعاملات بحسب ما ينتهي إليه العلم والمقدرة فيُشبه الاستغراق العرفي .ومن المفسّرين من عيّن جعل ( مِن ) في قوله تعالى : { ولتكن منكم أمة } للبيان ، وتأوّل الكلام بتقدير تقديممِ البيان على المبيَّن فيَصِير المعنى : ولتكن أمَّة هي أنتم أي ولتكونوا أمَّة يدعون محاولة للتسويَّة بين مضمون هذه الآية ، ومضمون قوله تعالى : { كنتم خير أمة أخرجت للناس تأمرون بالمعروف } \\[ آل عمران : 110 \\] الآية . ومساواة معنيي الآيتين غير متعيّنة لِجواز أن يكون المراد من خير أمَّة هاته الأمَّة ، الَّتي قامت بالأمر بالمعروف ، على ما سنبيِّنه هنالك .والآية أوجبت أن تقوم طائفة من المسلمين بالأمر بالمعروف والنَّهي عن المنكر ، ولا شكّ أن الأمر والنَّهي من أقسام القول والكلام ، فالمكلّف به هو بيان المعروف ، والأمر به ، وبيان المنكر ، والنَّهي عنه ، وأمَّا امتثال المأمورين والمنهيين لذلك ، فموكول إليهم أو إلى ولاة الأمور الَّذين يحملونهم على فعل ما أمروا به ، وأمَّا ما وقع في الحديث : « من رأى منكم منكراً فَلْيُغَيِّرْه بيدِه ، فإنْ لم يَسْتَطِعْ فبِلِسانه فإن لم يستطع فبقلبه » فذلك مرتبةُ التغيير ، والتَّغييرُ يكون باليد ، ويكون بالقلب ، أي تمنّى التَّغيير ، وأمَّا الأمر والنَّهي فلا يكونان بهما .والمعروف والمنكر إن كانا ضروريين كان لكلّ مسلم أن يأمر وينهى فيهما ، وإن كانا نظريَّيْن ، فإنَّما يقوم بالأمر والنَّهي فيهما أهل العلم .وللأمر بالمعروف والنَّهي عن المنكر شروط مبيّنة في الفقه والآداب الشرعية ، إلاّ أنِّي أنبِّه إلى شرط ساء فهم بعض النَّاس فيه وهو قول بعض الفقهاء : يشترط أن لا يجرّ النَّهي إلى منكر أعظم . وهذا شرط قد خرم مزيّة الأمر بالمعروف والنَّهي عن المنكر ، واتّخذه المسلمون ذريعة لترك هذا الواجب . ولقد ساء فهمهم فيه إذا مراد مشترطِه أن يتحقَّق الآمر أنّ أمره يجرّ إلى منكر أعظم لاَ أن يخاف أو يتوهّم إذ الوجوب قطعي لا يعارضه إلاّ ظنّ أقوى .ولمّا كان تعيين الكفاءة للقيام بهذا الفرض ، في الأمر بالمعروف والنَّهي عن المنكر ، لتوقّفه على مراتب العلم بالمعروف والمنكر ، ومراتب القدرة على التَّغيير ، وإفهام النَّاس ذلك ، رأَى أيمة المسلمين تعيين ولاة للبحث عن المناكر وتعيين كيفية القيام بتغييرها ، وسمّوا تلك الولاية بالحسبة ، وقد أولى عمر بن الخطَّاب في هاته الولاية أم الشَفاء ، وأشهر من وليها في الدولة العبَّاسيَّة ابن عائشة ، وكان رجلاً صلباً في الحق ، وتسمّى هذه الولاية في المغرب ولاية السوق وقد وليها في قرطبة الإمام محمَّد بن خالد بن مَرْتَنِيل القرطبي المعروف بالأشجّ من أصحاب ابن القاسم توفِّي سنة 220 . وكانت في الدولة الحفصيَّة ولاية الحسبة من الولايات النبيهة وربَّما ضمّت إلى القضاء كما كان الحال في تونس بعد الدولة الحفصيَّة .وجملة { وأولئك هم المفلحون } معطوفة على صفات أمَّة وهي الَّتي تضمّنتها جُمَلُ { يدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر } والتقدير : وهم مفلحون : لأن الفلاح لمّا كان مسبّباً على تلك الصفّات الثلاث جعل بمنزلة صفة لهم ، ويجوز جعل جملة { وأولئك هم المفلحون } حالاً من أمَّة ، والواو للحال .والمقصود بشارتهم بالفلاح الكامل إن فعلوا ذلك . وكان مقتضى الظاهر فصل هذه الجملة عمّا قبلها بدون عطف ، مثل فصل جملة { أولئك على هدى من ربِّهم } \\[ البقرة : 5 \\] لكن هذه عُطفت أو جاءت حالاً لأن مضمونها جزاء عن الجمل الَّتي قبلها ، فهي أجدر بأن تُلحق بها .ومفاد هذه الجملة قصر صفة الفلاح عليهم ، فهو إمّا قصر إضافي بالنّسبة لمن لم يقم بذلك مع المقدرة عليه وإمّا قصر أريد به المبالغة لعدم الاعتداد في هذا المقام بفلاح غيرهم ، وهو معنى قصد الدّلالة على معنى الكمال\n\n",
      "translations": [
        {
          "translation": "Allah then commanded goodness and reconciliation, saying: (And there may spring from you) there still exists among you (a nation) a group (who invite to goodness) who invite to reconciliation and excellence, (and enjoin right conduct) they enjoin Allah's divine Oneness and the following of Muhammad (pbuh) (and forbid indecency) they forbid disbelief, idolatry and rejection, instead following the Messenger. (Such are they who are successful) who are saved from Allah's wrath and punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولتكن منكم أمة يَدْعون إلى الخَيْر } أي: ليكن من جملتكم جماعة عالمون\n عاملون\n عارفون\n أولو استقامة في الدين كشيوخ الطريقة { يدعونَ إلى الخَير } فإن من لم يعرف الله لم يعرف الخير\n إذ الخير المطلق هو الكمال المطلق الذي يمكن للإنسان بحسب النوع من معرفة الحق تعالى\n والوصول إليه\n والإضافي ما يتوصل به إلى المطلق أو الكمال المخصوص بكلّ أحد على حسب اقتضاء استعداده الخاص\n فالخير المدعوّ إليه\n إما الحق تعالى\n وإما طريق الوصول\n والمعروف كل أمر واجب أو مندوب في الدين\n يتقرّب به إلى الله تعالى\n والمنكر كلّ محرّم أو مكروه يبعد عن الله تعالى ويجعل فاعله عاصياً أو مقصراً مذموماً\n فمن لم يكن له التوحيد والاستقامة\n لم يكن له مقام الدعوة ولا مقام الأمر بالمعروف والنهي عن المنكر\n لأن غير الموحد ربما يدعو إلى طاعة غير الله وغير المستقيم فى الدين وإن كان موحداً ربما أمر بما هو معروف عنده\n منكر في نفس الأمر وربما نهى عما هو منكر عنده\n معروف في نفس الأمر\n كمن بلغ مقام الجمع واحتجب بالحق عن الخلق\n فكثيراً ما يستحلّ محرّماً كبعض المسكرات والتصرّف في أموال الناس\n ويحرّم حلالاً بل مندوباً كتواضع الخلق ومكافأة الإحسان وأمثال ذلك { وأولئك هُم } الأخصاء بالفلاح\n الذين لم يبق لهم حجاب وهم خلفاء الله في أرضه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما وفقتم للإيمان\n ونبهتم للتوحيد والعرفان { لْتَكُن مِّنْكُمْ أُمَّةٌ } ملتزمة للإرشاد والتكميل { يَدْعُونَ } الناس { إِلَى ٱلْخَيْرِ } أي: إلى التوحيد وإسقاط الإضافات { وَيَأْمُرُونَ بِٱلْمَعْرُوفِ } المستحسن في طريق التوحيد { وَيَنْهَوْنَ عَنِ ٱلْمُنْكَرِ } المستقبح فيه\n المناسع عن الوصول إليه { وَأُوْلَـٰئِكَ } الراشدون\n المهديون\n المرشدون\n الهادون { هُمُ ٱلْمُفْلِحُونَ } [آل عمران: 104] الفائزون من عنده بالمثوبة العظمى\n والدرجة العليا التي هي طريق مقام الجمعية والرضا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: مِنْ: للتبعيض لأن الأمر بالمعروف والنهي عن المنكر من فُروض الكفاية إذ لا يصلح له كُلُّ أحد، أو للبيان، أي كونوا أمة تأمرون بالمعروف، كقوله:\n[آل عِمرَان: 110] الخ، و { يأمرون بالمعروف وينهون عن المنكر } عطف على الخبر، من عطف الخاص على العام للإيذان بفضله. { يقول الحقّ جلّ جلاله }: { ولتكن منكم } يا أمة محمد صلى الله عليه وسلم { أمة } أي: طائفةً { يدعون إلى الخير } ، وهو كل ما فيه صلاحٌ ديني، أو دنيوي إذ كان يؤول إلى الديني، أو صلاح قلبي أو روحاني، { ويأمرون بالمعروف } وهو ما يستحسنه الطبع ويرتضيه الشرع، { وينهون عن المنكر } وهو كل ما ينكره الطبعُ السليم والشرع المستقيم، فمن فعل ذلك فأولئك { هم المفلحون } المخصوصون بكمال الفلاح. رُوِيَ عنه عليه الصلاة والسلام: أنه سئل مَنْ خير الناس؟ فقال:\n \" آمرُهم بالمعروف، وأنهاهم عن المنكر، وأتقاهم الله، وأوصلهم للرحم \" \nوقال أيضاً:\n \" مَنْ أمَرَ بالمَعْروفِ ونَهَى عَنِ المُنْكَرِ كان خَلِيفَةَ اللّهِ في أرْضِهِ وخَلِيفَةَ رَسُولِه وخَلِيفَةَ كِتَابِه \" \nوقال عليّ رضي الله عنه: أفضل الجهاد: الأمر بالمعروف والنهي عن المنكر وشنئان الفاسقين - أي بغضهم - فمن أمر بالمعروف شدَّ ظهرَ المؤمن، ومن نهى عن المنكر أرْغَمَ أنف المنافق، ومن شَنَأَ الفاسقين وغَضب لله غَضبَ الله له. وقال أبو الدرداء: لتأمُرُن بالمعروف، ولتنهون عن المنكر، أو ليُسلطن الله عليكم سلطاناً ظالماً، لا يُجِلُّ كبيركم، ولا يرحم صغيركم، ويدعو عليه خيارُكم فلا يستجاب لهم، ويَسْتنصِرون فلا يُنصرون، ويستغفرون فلا يغفر لهم. وقال حذيفة: يأتي على الناس زمان لأن تكون فيه جيفة حمار، أحب إليهم من مؤمنٍ يأمرهم بالمعروف وينهاهم عن المنكر. وللمتصدِّي له شروط: العلم بالأحكام، ومراتب الاحْتِسَاب وكيفية إقامتها، والتمكن من القيام بها، ولذلك خاطب الحق تعالى الجميع، وطلب فعل بعضهم، إذ لا يصلح للقيام به إلا البعض، كما هو شأن فرض الكفاية، إذ هو واجب على الكل، بحيث لو تركوه لعوقبوا جميعاً، لكنه يسقط بفعل البعض. والأمر بالمعروف يكون واجباً ومندوباً، على حسب ما يأمر به، والنهي عن المنكر واجب كله لأن جميع ما أنكره الشرع حرام. وأما المكروه فليس بمنكر، فيستحب الإرشاد إلى تركه. والأظهر أن العاصي يجب أن ينهى عما يرتكبه هو لأنه يجب عليه تركه، فلا يسقط بترك أحدهما وجوب الآخر. وقد قال عليه الصلاة والسلام:\n \" مُرُوا بالمَعْرُوفِ وإن لَمْ تَعمَلُوا بِكُلِّهِ، وانْهَوْا عَنِ المُنْكَرِ وإنْ لم تَنْتَهُوا عنه كُلهُ \". \nالإشارة: { ولتكن منكم أمة } أي: طائفة ينهض حالهم ويدلُّ على الله مقالهم، يدعون إلى الخير العظيم، وهو شهود ذات السميع العليم، ويأمرون بالمعروف بالهمة العلية، وينهون عن المنكر بالحال القوية، فكلُّ من رآهم بالصفا ائتمر وانتهى، وكل من صحبهم بالوفاء أخذ حظه من الغنى بالمكيال الأوفى، إن لله رجالاً من نظر إليهم سعد سعادة لا يشقى بعدها أبداً، فهؤلاء يأمرون بالمعروف وينهون عن المنكر بالحال دون المقال.\nيُحكى أن بعض الشيوخ مرَّ مع أصحابه بقوم يشربون الخمر تحت شجرة فأراد أصحابه أن يُغيروا عليهم، فقال لهم: إن كنتم رجالاً فَغِيرُوا عليهم بحالكم دون مقالكم، فتوجهوا إلى الله بهممهم، فإذا القوم قد كسروا الأواني، وجاءوا إلى الشيخ تائبين. وكذلك قضية معروف الكرخي مع أصحاب السفينة، الذي كانوا مشتغلين باللهو واللعب، فقال له أصحابه: ادع عليهم، فقال: اللهم كما فرَّحتَهم في الدنيا ففرِّحْهُم في الآخرة، فتابوا على يده جميعاً. وبالله التوفيق، وهو الهادي إلى سواء الطريق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:110",
      "similarity": 0.6649390417499735
    },
    {
      "verse": "3:114",
      "similarity": 0.6017764395611498
    },
    {
      "verse": "5:79",
      "similarity": 0.5083011210104404
    },
    {
      "verse": "9:71",
      "similarity": 0.5071341917070272
    },
    {
      "verse": "23:69",
      "similarity": 0.49161651930111505
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003104.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003104.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:104.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}