{
  "chapter": "آل عمران",
  "text": "تلك ءايت الله نتلوها عليك بالحق وما الله يريد ظلما للعلمين",
  "translations": [
    {
      "translation": "These are Allah's Signs which We recite to you with truth. Allah desires no wrong for any being.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the commandments of God We recite to you verily; God does not wish injustice to the creatures of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the mes sages of Allah which We recite to you in truth, and Allah desires no wrong to the people of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are God's revelations which We explain to you, (Muhammad), for a genuine purpose. God does not want injustice for any of His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah, which We recite to you (O dear Prophet Mohammed – peace and blessings be upon him), with truth; and Allah does not wish any injustice to the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Ayat of Allah. We recite them to you in truth, and Allah wills no injustice to the `Alamin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the communications of Allah which We recite to you with truth, and Allah does not desire any injustice to the creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the signs of God We recite to thee in truth, and God desires not any injustice to living beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are revelations of Allah. We recite them unto thee in truth. Allah willeth no injustice to (His) creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are God's revelations; We recite them to you in all truth. God desires no injustice to mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are revelations of Allah; We rehearse them unto thee with truth, and Allah intendeth not wrong unto the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the signs of Allah, which We recite to you in truth, and Allah does not desire any wrong for the creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Signs of Allah: We rehearse them to thee in Truth: And Allah means no injustice to any of His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Verses of Allah: We recite them to you (O Muhammad SAW) in truth, and Allah wills no injustice to the 'Alamin (mankind and jinns).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the verses of Allah, We recite them to you with truth. Allah does not want injustice for the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the revelations of God. We recite them to you in truth. God desires no injustice for mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah. We recite them to you, [O Muhammad], in truth; and Allah wants no injustice to the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:108] Those, that is to say, these verses, are the verses of God which We recite to you, O Muhammad (s), in truth, and God desires not any injustice for the worlds, punishing them for no crime.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These are revelations of Allah): the Qur'an. (We recite them unto thee) We send them with Gabriel to you (in truth) in order to show what is true and what is an error. (Allah willeth no injustice to (His) creatures) He does not will to be unjust to the jinn or human beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ } المواعيد والوعيدات المذكورة للأولياء والأعداء { آيَاتُ ٱللَّهِ } الدالة على كمال قدرته وتفرده في ألوهيته، واستقلاله في ربوبيته { نَتْلُوهَا عَلَيْكَ } يا أكمل الرسل؛ تفضلاً وامتناناً ملتبساً { بِٱلْحَقِّ } لا شك في وقوعها { وَمَا ٱللَّهُ } الممنتقم في يوم الميعاد { يُرِيدُ ظُلْماً لِّلْعَالَمِينَ } [آل عمران: 108] بل يجازيهم على مقتضى ما صدر عنهم في النشأة الأولى، إن خيراً فخير وإن شراً فشر، فمن يعمل مثقال ذرة خيراً فيها يره فيها، ومن يعمل مثقال ذرة شراً فيها يره فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تلك آيات الله } الواردة في وَعْده وَوَعِيدِه، { نتلوها عليك } متلبسة { بالحق } لا شبهة فيها، فقد أعذر وأنذر، { وما الله يريد ظلماً للعالمين } إذ لا يحق عليه شيء فيظلم بنقصه، ولا يُمنع من شيء فيظلم بفعله، كما بيَّنه بقوله: { ولله ما في السماوات وما في الأرض } ملكاً وخلقاً وعبيداً، فيجازي كلا بما وَعَدَه، وأوْعَدَه، { وإلى الله ترجع الأمور } كلها فيتصرف على وفْقِ مراده وسَابق مشيئته،\n\n\n\n[الأنبيَاء: 23]\n الإشارة: قد نهى الله - تعالى - أهل الجمع عن التشبه بأهل الفرق، في اختلاف قلوبهم ووجوههم وآرائهم وأنظارهم، من بعد ما جاءتهم الدلائل الواضحات على طلب جمع القلب على الله، والتودد في الله، وصرف النظرة في شهود الله، وأولئك المفترقون لهم عذاب عظيم، وأيّ عذاب أعظم من الحجاب؟ يوم تبيض وجوه العارفين، فتكون كالشمس الضاحية، يسرحون في الجنان حيث شاءوا، وتسود وجوه الجاهلين لما يعتريها من الندم، وسوادها باعتبار وجوه العارفين في النقص عنها، وإن كانت مُبْيَضَّةً بنور الإيمان، لكن فاتهم نور الإحسان، فيقال: أكفرتم بالخصوصية في زمانكم، بعد إيمانكم بها فيمن سلف قبلكم؟ فذوقوا عذاب القطيعة عن شهود الحبيب في كل حين، وأما الذين ابيضت وجوههم وأشرقت بنور البقاء، ففي رحمة الله، أي: جنة المعارف\n\n[القَمَر: 55]، فقد اتضحت الطريق، وظهرت أعلام التحقيق، لكن الهداية بيد الله، كما أنَّ الأمور كلها بيده، يهدي مَن يشاء ويضل من يشاء،\n\n[فُصّلَت: 46]\n وبالله التوفيق\n\n",
      "translations": []
    }
  ]
}