{
  "chapter": "آل عمران",
  "text": "كنتم خير امة اخرجت للناس تامرون بالمعروف وتنهون عن المنكر وتؤمنون بالله ولو ءامن اهل الكتب لكان خيرا لهم منهم المؤمنون واكثرهم الفسقون",
  "translations": [
    {
      "translation": "You are the best nation ever to be produced before mankind. You enjoin the right, forbid the wrong and have iman in Allah. If the People of the Book were to have iman, it would be better for them. Some of them are",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of all the communities raised among men you are the best, enjoining the good, forbidding the wrong, and believing in God. If the people of the Book had come to believe it was best for them; but only some believe, and transgressors are many.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are now the best people brought forth for (the guidance and reform of) mankind. You enjoin what is right and forbid what is wrong and believe in Allah. Had the People of the Book believed it were better for them. Some of them are believers but most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation that ever existed among humanity. You command people to good and prohibit them from evil, and you believe in God. Had the People of the Book accepted the faith (Islam), it would certainly have been better for them. Some of them have faith, but most of them are evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best among all the nations that were raised among mankind – you enjoin good deeds and forbid immorality and you believe in Allah; and if the People given the Book(s) believed it would be better for them; some of them are believers (Muslims) and most of them are disbelievers. (The best Ummah is that of Prophet Mohammed – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best of peoples ever raised up for mankind; you enjoin Al-Ma`ruf (all that Islam has ordained) and forbid Al-Munkar (all that Islam has forbidden), and you believe in Allah. And had the People of the Scripture (Jews and Christians) believed, it would have been better for them; among them are some who have faith, but most of them are Fasiqun (rebellious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best of the nations raised up for (the benefit of) men; you enjoin what is right and forbid the wrong and believe in Allah; and if the followers of the Book had believed it would have been better for them; of them (some) are believers and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation ever brought forth to men, bidding to honour, and forbidding dishonour, and believing in God. Had the People of the Book believed, it were better for them; some of them are believers, but the most of them are ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye are the best community that hath been raised up for mankind. Ye enjoin right conduct and forbid indecency; and ye believe in Allah. And if the People of the Scripture had believed it had been better for them. Some of them are believers; but most of them are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are indeed the best community that has ever been brought forth for [the good of] mankind. You enjoin what is good, and forbid what is evil, and you believe in God. If the People of the Book had also believed, it would have surely been better for them. Some of them are true believers, but most of them are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye are the best community sent forth unto mankind; ye command that which is reputable and ye prevent that which is disreputable. and ye believe in Allah If the people of the Book believe, surely it were better for them. Of them are believers, and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation [ever] brought forth for mankind: you bid what is right and forbid what is wrong, and have faith in Allah. And if the People of the Book had believed, it would have been better for them. Among them [some] are faithful, but most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye are the best of peoples, evolved for mankind, enjoining what is right, forbidding what is wrong, and believing in Allah. If only the People of the Book had faith, it were best for them: among them are some who have faith, but most of them are perverted transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You [true believers in Islamic Monotheism, and real followers of Prophet Muhammad SAW and his Sunnah (legal ways, etc.)] are the best of peoples ever raised up for mankind; you enjoin Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam has ordained) and forbid Al-Munkar (polytheism, disbelief and all that Islam has forbidden), and you believe in Allah. And had the people of the Scripture (Jews and Christians) believed, it would have been better for them; among them are some who have faith, but most of them are Al-Fasiqun (disobedient to Allah - and rebellious against Allah's Command).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation ever to be brought forth for people. You order honor and forbid dishonor, and you believe in Allah. Had the People of the Book believed, it would have surely been better for them. Some of them are believers, but most of them are evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best community that ever emerged for humanity: you advocate what is moral, and forbid what is immoral, and believe in God. Had the People of the Scripture believed, it would have been better for them. Among them are the believers, but most of them are sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong and believe in Allah. If only the People of the Scripture had believed, it would have been better for them. Among them are believers, but most of them are defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:110] You, O community of Muhammad (s), are the best community brought forth, manifested, to men, according to God’s knowledge, enjoining decency, and forbidding indecency, and believing in God. Had the People of the Scripture believed, it, their belief, would have been better for them; some of them are believers, such as ‘Abd Allāh b. Salām, may God be pleased with him and his companions; but most of them, the disbelievers, are wicked.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيتنزّل هذا منزلة التَّعليل لأمرهم بالدّعوة إلى الخير ، وما بعده فإن قوله { تأمرون بالمعروف } حال من ضمير كنتم ، فهو موذن بتعليل كونهم خيرَ أمَّة فيترتب عليه أنّ ما كان فيه خيريتهم يجدر أن يفرض عليهم ، إن لم يكن مفروضاً من قبل ، وأن يؤكد عليهم فرضه ، إن كان قد فرض عليهم من قبل .والخطاب في قوله { كنتم } إمَّا لأصحاب الرسول صلى الله عليه وسلم ونقل ذلك عن عمر بن الخطاب ، وابن عبَّاس . قال عمر : هذه لأوّلنَا ولا تكون لآخِرنا . وإضافة خير إلى أمّة من إضافة الصفة إلى الموصوف : أي كنتم أمَّة خير أمَّة أخرجت للنَّاس ، فالمراد بالأمّة الجماعة ، وأهل العصر النبوي ، مثل القَرن ، وهو إطلاق مشهور ومنه قوله تعالى : { وادّكَر بعد أمَّة } \\[ يوسف : 45 \\] أي بعد مدة طويلة كمدة عصر كامل . ولا شكّ أن الصحابة كانوا أفضل القرون التي ظهرت في العالم ، لأن رسولهم أفضل الرسل ، ولأن الهدى الذي كانوا عليه لا يماثله هدى أصحاب الرسل الذين مضوا ، فإن أخذت الأمة باعتبار الرسول فيها فالصحابة أفضل أمة من الأمم مع رسولها ، قال النبي صلى الله عليه وسلم « خير القرون قرني » والفضل ثابت للجموع على المجموع ، وإن أخذت الأمة من عدا الرسول ، فكذلك الصحابة أفضل الأمم التي مضت بدون رُسلها ، وهذا تفضيل للهدى الذي اهتدوا به ، وهو هدى رسولهم محمد صلى الله عليه وسلم وشريعته .وإمّا أن يكون الخطاب بضمير { كنتم } للمسلمين كلّهم في كلّ جيل ظهروا فيه ، ومعنى تفضيلهم بالأمر بالمعروف مع كونه من فروض الكفايات لا تقوم به جميع أفراد الأمّة لا يخلو مسلم من القيام بما يستطيع القيام به من هذا الأمر ، على حسب مبلغ العلم ومنتهى القدرة ، فمن التغيير على الأهل والولد ، إلى التغيير على جميع أهل البلد ، أو لأن وجود طوائف القائمين بهذا الأمر في مجموع الأمّة أوجب فضيلة لجميع الأمّة ، لكون هذه الطوائف منها كما كانت القبيلة تفتخر بمحامد طوائقها ، وفي هذا ضمان من الله تعالى بأنّ ذلك لا ينقطع من المسلمين إن شاء الله تعالى .وفعل ( كان ) يدل على وجود ما يسند إليه في زمن مضى ، دون دلالة على استمرار ، ولا على انقطاع ، قال تعالى { وكان الله غفوراً رحيماً } \\[ النساء : 96 \\] أي وما زال ، فمعنى { كنتم خير أمة } وجدتم على حالة الأخيرية على جميع الأمم ، أي حصلت لكم هذه الأخيرية بحصول أسبابها ووسائلها ، لأنّهم اتّصفوا بالإيمان ، والدّعوة للإسلام ، وإقامته على وجهه ، والذبّ عنه النقصانَ والإضاعة لتحقّق أنّهم لمّا جُعل ذلك من واجبهم ، وقد قام كُلّ بما استطاع ، فقد تحقّق منهم القيام به ، أو قد ظهر منهم العزم على امتثاله ، كُلّما سنح سانح يقتضيه ، فقد تحقّق أنهم خير أمَّة على الإجمال فأخبر عنهم بذلك .هذا إذا بنَينا على كون الأمر في قوله آنفاً { ولتكن منكم أمة يدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر } \\[ آل عمران : 104 \\] وما بعده من النهي في قوله { ولا تكونوا كالذين تفرقوا } \\[ آل عمران : 105 \\] الآية ، لم يكن حاصلاً عندهم من قبل .ويجوز أن يكون المعنى : { كنتم خير أمة } موصوفين بتلك الصّفات فيما مضى تفعلونها إمَّا من تلقاء أنفسكم ، حرصاً على إقامة الدّين واستحساناً وتوفيقاً من الله في مصادفتكم لمرضاته ومراده ، وإمّا بوجوب سابق حاصل من آيات أخرى مثل قوله : { وتواصوا بالحق } \\[ العصر : 3 \\] وحينئذٍ فلمَّا أمرهم بذلك على سبيل الجزم ، أثنى عليهم بأنَّهم لم يكونوا تاركيه من قبل ، وهذا إذا بنَينا على أنّ الأمر في قوله { ولتكن منكم أمة } \\[ آل عمران : 104 \\] تأكيداً لما كانوا يفعلونه ، وإعلام بأنَّه واجب ، أو بتأكيد وجوبه على الوجوه التي قدّمتها عند قوله { ولتكن منكم أمة } .ومن الحيرة التجاء جمع من المفسرين إلى جعل الإخبار عن المخاطبين بكونهم فيما مضى من الزمان أمة بمعنى كونهم كذلك في علم الله تعالى وقَدَره أو ثبوت هذا الكون في اللوح المحفوظ أو جعل كان بمعنى صار .والمراد بأمَّة عمومُ الأمم كلّها على ما هو المعروف في إضافة أفعل التفضيل إلى النكرة أن تكون للجنس فتفيد الاستغراق .وقوله { أخرجت للناس } الإخراج مجاز في الإيجاد والإظهار كقوله تعالء { فأخرج لهم عجلاً جسداً له خوار } \\[ طه : 88 \\] أي أظهر بصوغه عجلاً جسداً .والمعنى : كنتم خير الأمم التي وجدت في عالم الدنيا . وفاعل { أخرجت } معلوم وهو الله موجد الأمم ، والسائق إليها ما به تفاضلها . والمراد بالناس جميع البشر من أوّل الخليقة .وجملة : { تأمرون بالمعروف } حال في معنى التَّعليل إذ مدلولها ليس من الكيفيات المحسوسة حتّى تحكى الخيرية في حال مقارنتها لها ، بل هي من الأعمال النَّفسية الصالحة للتعليل لا للتوصيف ، ويجوز أن يكون استئنافاً لبيان كونهم خير أمَّة . والمعروف والمنكر تقدّم بيانهما قريباً .وإنّما قدّم { تأمرون بالمعروف وتنهون عن المنكر } على قوله { وتؤمنون بالله } لأنهما الأهم في هذا المقام المسوق للتنويه بفضيلة الأمر بالمعروف والنهي عن المنكر الحاصلة من قوله تعالى : { ولتكن منكم أمة يدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر } \\[ آل عمران : 104 \\] والاهتمام الذي هو سبب التقديم يختلف باختلاف مقامات الكلام ولا ينظر فيه إلى ما في نفس الأمر لأنّ إيمانهم ثابت محقّق من قبل .وإنَّما ذكر الإيمان بالله في عداد الأحوال التي استحقوا بها التفضيل على الأمم ، لأنّ لكلّ من تلك الأحوال الموجبة للأفضلية أثراً في التفَّضيل على بعض الفرق ، فالإيمان قصد به التفضيل على المشركين الذين كانوا يفتخروم بأنهم أهل حرم الله وسدنة بيته وقد ردّ الله ذلك صريحاً في قوله :{ أجعلتم سقاية الحاج وعمارة المسجد الحرام كمن آمن بالله واليوم الآخر وجاهد في سبيل الله لا يستوون عند الله } \\[ التوبة : 19 \\] وذكر الأمر بالمعروف والنهي عن المنكر ، قصد به التفضيل على أهل الكتاب ، الذين أضاعوا ذلك بينهم ، وقد قال تعالى فيهم { كانوا لا يتناهون عن منكر فعلوه } \\[ المائدة : 79 \\] .فإن قلت إذا كان وجه التفضيل على الأمم هو الأمر بالمعروف والنهي عن المنكر والإيمان بالله ، فقد شاركنا في هذه الفضيلة بعض الجماعات من صالحي الأمم الذين قبلنا ، لأنَّهم آمنوا بالله على حسب شرائعهم ، وأمروا بالمعروف ونهوا عن المنكر ، لتعذّر أن يترك الأمم بالمعروف لأنّ الغيرة على الدين أمر مرتكز في نفوس الصادقين من أتباعه . قلت : لم يثبت أن صالحي الأمم كانوا يلتزمون الأمر بالمعروف والنهي عن المنكر إمّا لأنه لم يكن واجباً عليهم ، أو لأنَّهم كانوا يتوسعّون في حل التقية ، وهذا هارون في زمن موسى عبدت بنو إسرائيل العجل بمرآى منه ومسمع فلم يغيّر عليهم ، وقد حكى الله محاورة موسى معه بقوله { قال يا هارون ما منعك إذ رأيتهم ضلوا ألا تتبعني أفعصيت أمري قال يابن أم لا تأخذ بلحيتي ولا برأسي إني خشيت أن تقول فرقت بين بني إسرائيل ولم ترقب قولي } \\[ طه : 92 94 \\] وأما قوله تعالى { من أهل الكتاب أمة قائمة يتلون آيات الله آناء الليل وهم يسجدون يؤمنون بالله واليوم الآخر ويأمرون بالمعروف وينهون عن المنكر } \\[ آل عمران : 113 ، 114 \\] الآية فتلك فئة قليلة من أهل الكتاب هم الذين دخلوا في الإسلام مثل عبد الله بن سلام ، وقد كانوا فئة قليلة بين قومهم فلم يكونوا جمهرة الأمّة .وقد شاع عند العلماء الاستدلال بهذه الآية على حجيّة الإجماع وعصمته من الخطأ بناء على أن التعريف في المعروف والمنكر للاستغراق ، فإذا أجمعت الأمَّة على حكم ، لم يجز أن يكون ما أجمعوا عليه منكراً ، وتعيّن أن يكون معروفاً ، لأنّ الطائفة المأمورة بالأمر بالمعروف والنَّهي عن المنكر في ضمنهم ، ولا يجوز سكوتها منكر يقع ، ولا عن معروف يترك ، وهذا الاستدلال إن كان على حجية الإجماع بمعنى الشرع المتواتر المعلوم من الدين بالضرورة فهو استدلال صحيح لأن المعروف والمنكر في هذا النوع بديهي ضروري ، وإن كان استدلالاً على حجية الإجماعات المنعقدة عن اجتهاد ، وهو الذي يقصده المستدلون بالآية ، فاستدلالهم بها عليه سفسطائي لأنّ المنكر لا يعتبر منكراً إلاّ بعد إثبات حكمه شرعاً ، وطريق إثبات حكمه الإجماع ، فلو أجمعوا على منكر عند الله خطأ منهم لما كان منكراً حتَّى ينهي عنه طائفة منهم لأنّ اجتهادهم هو غاية وسعهم .{ وَلَوْ ءَامَنَ أَهْلُ الكتاب لَكَانَ خَيْراً لَّهُمْ مِّنْهُمُ المؤمنون وَأَكْثَرُهُمُ الفاسقون } .عطف على قوله { كنتم خير أمة أخرجت للناس } لأن ذلك التفضيل قد غمر أهل الكتاب من اليهود وغيرهم فنبّههم هذا العطف إلى إمكان تحصيلهم على هذا الفضل ، مع ما فيه من التعريض بهم بأنَّهم متردّدون في اتباع الإسلام ، فقد كان مخيريق متردّداً زماناً ثمّ أسلم ، وكذلك وفد نجران تردّدوا في أمر الإسلام .وأهل الكتاب يشمل اليهود والنصارى ، لكن المقصود الأول هنا هم اليهود ، لأنَّهم كانوا مختلطين بالمسلمين في المدينة ، وكان النبي صلى الله عليه وسلم دعاهم إلى الإسلام ، وقصد بيت مدراسهم ، وٌّصهم قد أسلم منهم نفر قليل وقال النبي صلى الله عليه وسلم \" لو آمن بي عشرة من اليهود لآمن بي اليهود كلهم \" .ولم يذكر متعلق ( آمن ) هنا لأنّ المراد لو اتَّصفوا بالإيمان الذي هو لقب لدين الإسلام وهو الذي منه أطلقت صلة الذين آمنوا على المسلمين فصار كالعلم بالغلبة ، وهذا كقولهم أسْلَم ، وَصَبَأ ، وأشْرَكَ ، وألْحَد ، دون ذكر متعلّقات لهاته الأفعال لأن المراد أنَّه اتَّصف بهذه الصّفات التي صارت أعلاماً على أديان معروفة ، فالفعل نُزّل منزلة اللازم ، وأظهر منه : تَهَوّد ، وتَنَصّر ، وتَزَنْدق ، وتَحَنَّف ، والقرينة على هذا المعنى ظاهرة وهي جعل إيمان أهل الكتاب في شرط الامتناع ، مع أنّ إيمانهم بالله معروف لا ينكره أحد . ووقع في «الكشاف» أنّ المراد : لو آمنوا الإيمان الكامل ، وه تكلّف ظاهر ، وليس المقام مقامه . . وأجمل وجه كون الإيمان خيراً لهم لتذهب نفوسهم كلّ مذهب في الرجاء والإشفاق . ولمَّا أخبر عن أهْل الكتاب بامتناع الإيمان منهم بمقتضى جعل إيمانهم في حيز شرط ( لو ) الامتناعية ، تعيّن أن المراد من بقي بوصف أهل الكتاب ، وهو وصف لا يبقى وصفهم به بعد أن يتديّنوا بالإسلام ، وكان قد يتوهّم أن وصف أهل الكتاب يشمل من كان قبل ذلك منهم ولو دخل في الإسلام ، وجيء بالاحتراس بقوله : { منهم المؤمنون وأكثرهم الفاسقون } أي منهم من آمن بالنبي محمد صلى الله عليه وسلم فصدق عليه لقب المؤمن ، مثل عبد الله بن سلام ، وكان اسمه حُصيناً وهو من بني قينقاع ، وأخيه ، وعمصته خالدة ، وسعية أو سنعة بن غريض بن عاديا التيماوي ، وهو ابن أخي السموأل بن عاديا ، وثعلبة بن سعية ، وأسد بن سعية القرظي ، وأسد بن عبيد القرظي ، ومخيريق مِن بني النضير أو من بني قينقاع ، ومثل أصْمحة النَّجاشي ، فإنَّه آمن بقلبه وعوّض عن إظهاره إعمالَ الإسلام نصره للمسلمين ، وحمايته لهم ببلده ، حتَّى ظهر دين الله ، فقبل الله منه ذلك ، ولذلك أخبر رسول الله صلى الله عليه وسلم عنه بأنَّه كان مؤمناً وصلّى عليه حين أوحي إليه بموته . ويحتمل أن يكون المعنى من أهل الكتاب فريق متقّ في دينه ، فهو قريب من الإيمان بمحمَّد صلى الله عليه وسلم وهؤلاء مثل من بقي متردّداً في الإيمان من دون أن يتعرّض لأذى المسلمين ، مثل النَّصارى من نجران ونصارى الحبشة ، ومثل مخيريق اليهودي قبل أن يسلم ، على الخلاف في إسلامه ، فإنَّه أوصى بماله لرسول الله صلى الله عليه وسلم فالمراد بإيمانهم صدق الإيمان بالله وبدينهم . وفريق منهم فاسق عن دينه ، محرّف له ، مناوٍ لأهل الخير ، كما قال تعالى : { ويقتلون الذين يأمرون بالقسط من الناس } مثل الذين سَمُّوا الشاة لرسول الله يوم خيْبر ، والذين حاولوا أن يرموا عليه صخرة .\n\n",
      "translations": [
        {
          "translation": "(Ye are the best community that has been raised up for mankind) that ever was for mankind. Allah then showed how they were the best community that has been raised for mankind saying: (Ye enjoin right conduct) you enjoin the divine Oneness of Allah and the following of Muhammad (and forbid indecency) you forbid disbelief, idolatry and the opposition of the Messenger; (and ye believe in Allah) as well as in all revealed scriptures and messengers. (And if the People of the Scripture) i.e. the Jews and Christians (had believed it had been better for them) than what they are in now. (Some of them are believers) 'Abdullah Ibn Salam and his followers; (but most of them are evil-livers) unbelievers who break their pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كُنْتم خيرَ أمّة } لكونكم موحدين\n قائمين بالعدل الذي هو ظله { تأمُرون بالمَعْروف وتَنْهَون عن المُنْكر } إذ لا يقدر على ذلك إلا الموحد العادل لعلمه بالمعروف والمنكر\n كما مرّ في تأويل قوله:\n[البقرة\n الآية: 143]\n قال أمير المؤمنين عليه السلام: \" نحن النمرقة الوسطى\n بنا يلحق التأويل\n وإلينا يرجع الغالي \"\n فيأمرون المقصر بالمعروف الذي يوصله إلى مقام التوحيد\n وينهون الغالي المحجوب بالجمع عن التفصيل وبالوحدة عن الكثرة\n { وتُؤْمنون بالله } أي: تثبتون في مقام التوحيد الذي هو الوسط\n وكذا في كلّ تفريط وإفراط واعتدال في باب الأخلاق { ولو آمن أهل الكتاب } لكانوا مثلكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كُنْتُمْ } أيها المحمديون { خَيْرَ أُمَّةٍ } في علم الله مستوية على صراط التوحيد\n معتدلة بين طرفي الإفراط والتفريط { أُخْرِجَتْ لِلنَّاسِ } أي: قدرت ظهوركم\n لتكميل الناقصين من الناس\n حتى { تَأْمُرُونَ بِٱلْمَعْرُوفِ } المفروض في سلوك طريق التوحيد { وَتَنْهَوْنَ عَنِ ٱلْمُنْكَرِ } المحظور فيه { وَ } ذلك الأمر والنهي إنما صدر منكم\n لكونكم { تُؤْمِنُونَ } توقنون { بِٱللَّهِ } المستوي على عروش ذرائر الكائنات\n بالاعتدال الذي هو صراط الله الأقوم { وَلَوْ آمَنَ أَهْلُ ٱلْكِتَابِ } بأجمعهم بدينكم وملتكم { لَكَانَ خَيْراً لَّهُمْ } ينجيهم عن ورطتي الإفراد والتفريط\n ويوصلهم إلى صراط مستقيم\n وإن كان القليل { مِّنْهُمُ ٱلْمُؤْمِنُونَ } الداخلون في حصار الإيمان مع المؤمنين { وَ } لكن { أَكْثَرُهُمُ ٱلْفَاسِقُونَ } [آل عمران: 110] الخارجون عن حدوده وأحكامه\n\n\nلا تبالوا أيها الموحدون بفسهم وكفرهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كان }: على بابها من الدلالة على المُضِيِّ\n أي: كنتم في اللوح المحفوظ\n أو في علم الله\n أو فيما بين الأمم المتقدمة\n أو: صلة\n أي: أنتم خير أمة\n و { للناس }: يتعلق بأخرجت\n أو بكنتم\n أي: كنتم خير الناس للناس\n يقول الحقّ جلّ جلاله: لأمة نبينا محمد صلى الله عليه وسلم: { كنتم } في سابق علمي { خير أمة } ظهرت { للناس } تجيئون بهم إلى الجنة بالسلاسل\n ثم بيَّن وجه فضلهم فقال: { تأمرون بالمعروف وتنهون عن المنكر وتؤمنون بالله } وبجميع ما يجب الإيمان به\n وقد ورد في مدح هذه الأمة المحمدية أحاديث\n منها قوله صلى الله عليه وسلم:\n \" حُرِّمتْ الجنةُ على الأنبياء حتى أدخلها أنا\n وحُرّمتْ الجنة على الأُمَمِ حتى تدخلها أمتي \" \nومنها قوله صلى الله عليه وسلم:\n \" أمتي أمةٌ مَرْحُومَةٌ\n إذَا كَانَ يَوْمُ القِيامةِ أَعطى الله كُلَّ رَجُلٍ مِن هذه الأمة رجُلاً فيقال: هذَا فِدَاؤُكَ مِنَ النَّارِ \"\n \nوعن أنس قال: \" خرجت مع النبيّ صلى الله عليه وسلم\n فإذا صوت يجيء من شِعْبِ\n فقال: يا أنس: قُمْ فانظرْ ما هذا الصوت\n فانطلقت فإذا برجلٍ يُصلّي إلى شجرة\n ويقول: اللهم اجعلني من أمة محمد صلى الله عليه وسلم\n الأمة المرحومة\n المغفور لها\n المستجاب لها\n المتاب عليها\n فأتيتُ النبيّ صلى الله عليه وسلم\n فأخبرته\n فقال: انطلق\n فقل له: إن رسول الله صلى الله عليه وسلم يقرئك السلام\n ويقول لك: من أنت؟ فأتيت\n فأعلمته ما قال النبيّ صلى الله عليه وسلم فقال: اقرأ مني السلام على رسول الله صلى لله عليه وسلم\n وقل له: أخوك الخضر يقول لك: ادع الله أن يجعلني من أمتك المرحومة المغفور لها \"\n وقيل لعيسى ابن مريم: هل بعد هذه الأمة أمة؟ قال: نعم\n أمة أحمد\n قيل: وما أمة أحمد؟ قال: علماء\n حكماء\n أبرار أتقياء\n كأنهم من الفقه أنبياء\n يرضون باليسير من الرزق\n ويرضى الله عنهم باليسير من العمل\n يدخلهم الجنة بشهادة أن لا إله إلا الله\n هـ\n وليس أولها أولى بالمدح من آخرها\n لقوله صلى الله عليه وسلم:\n \" أُمتي كالمَطَرِ\n لا يُدْرَى أولهُ خيرٌ أو آخرُه \" \n؟ وفي خبر آخر عنه صلى الله عليه وسلم قال:\n \" اشتقْتُ إلى إخواني\n فقال أصحابُه: نحن إخوانُك يا رسول الله\n فقال أنتم أصْحَابي\n إخْواني: ناس يأتُون بعدي\n يُؤمنون بي ولم يَرَوْنِي\n يَوَدُّ أحدُهم لو يَرَاني بجميع ما يَمْلِكُ\n يَعْدِلُ عملُ أحدهم سبعين منكم\n قالوا: مِنْهم يا رسول الله؟ قال: منكم\n قالوا: ولِمَ ذلك يا رسول الله؟ قال: لأنكم وَجَدْتُم على الخير أعْواناً\n وهم لا يَجِدُوا عليه أعواناً \" \nأو كما قال - عليه الصلاة والسلام -\n\nقلت: التفضيل باعتبار أجور الأعمال\n وأما باعتبار اليقين والمعرفة\n فالصحابة أفضل الخلق بعد الأنبياء - عليهم السلام - ويدل على هذا قوله - عليه الصلاة والسلام -\n \" يعدل عمل أحدهم \" \n\n ولم يقل إيمان أحدهم\n والله تعالى أعلم\n الإشارة: كنتم يا معرش الصوفية خير أمة أخرجت للناس\n تأمرون بالجمع على الله والغيبة عما سواه\n وتنهونَ عن كلِّ ما يُبعد عن الله ويفرق العبدَ عن مولاه\n وتؤمنون بالله وبما وعد به الله\n إيمان الشهود والعيان\n الذي هو مقام الإحسان\n قال القشيري في رسالته: قد جعل الله هذه الطائفة صفوة أوليائه\n وفضَّلهم على الكافة من عباده بعد رسله وأنبيائه\n وقال الجنيد رضي الله عنه: لو نعلم أن تحت أديمِ السماء أشرف من هذا العلم الذي نتكلم فيه مع أصحابنا\n لسعيت إليه ولو حبواً\n هـ\n وكان كثيراً ما ينشد:\nوقال الشيخ الصقلي: كلُّ من صدَّقَ بهذا العلم فهو من الخاصة\n وكل من فهمه فهو من خاصة الخاصة\n وكل من عبّر به وتكلم فيه فهو من النجم الذي لا يُدرك والبحر الذي لا ينزف\n وقال في الإحياء - لمَّا تكلم على معرفة الله والعلم بالله\n قال: والرتبةُ العليا في ذلك للأنبياء\n ثم للأولياء العارفين\n ثم للعماء الراسخين\n ثم للصالحين\n فقد قدَّم الأولياء على العلماء\n قال ابن رشد: وما قاله القشيري والغزالي متفق عليه\n قال: ولا يشكُّ عاقلٌ أنَّ العارفين بالله وما يجب له من الكمال\n أفضل من العارفين بأحكام الله\n انظر تمامه في المعيار\n وقال في المباحث:\nثم قال:\nثم دعا أهل الكتاب إلى الإيمان\n وهوَّن أمرهم\n فقال: {\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:104",
      "similarity": 0.6649390417499739
    },
    {
      "verse": "3:114",
      "similarity": 0.5637207624561568
    },
    {
      "verse": "16:83",
      "similarity": 0.4955761278340912
    },
    {
      "verse": "9:71",
      "similarity": 0.47853753276673866
    },
    {
      "verse": "5:79",
      "similarity": 0.4601615170734118
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003110.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003110.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:110.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}