{
  "chapter": "آل عمران",
  "text": "مثل ما ينفقون فى هذه الحيوة الدنيا كمثل ريح فيها صر اصابت حرث قوم ظلموا۟ انفسهم فاهلكته وما ظلمهم الله ولكن انفسهم يظلمون",
  "translations": [
    {
      "translation": "The metaphor of what they spend in their life in this world is that of a wind with an icy bite to it which strikes the crops of a people who have wronged themselves and destroys them. Allah did not wrong them; rather it was themselves they were wronging.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they spend in the life of this world is like a frosty wind which smites and destroys the crops of a people who had wronged themselves. God did not wrong them, they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of what they spend in the life of this world is like that of a wind accompanied with frost which smites the harvest of a people who wronged themselves, and lays it to waste. It is not Allah who wronged them; rather it is they who wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they spend in this life is like the freezing wind that may strike and destroy the farms of the people who have wronged themselves. God has not done injustice to them, but they have wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of what they spend in this worldly life is similar to the freezing cold wind which struck the fields of a nation who wronged themselves, and destroyed it completely; and Allah did not oppress them, but it is they who wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of what they spend in this world is that of a wind of Sir; it struck the harvest of a people who did wrong against themselves and destroyed it. Allah wronged them not, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of what they spend in the life of this world is as the likeness of wind in which is intense cold (that) smites the seed produce of a people who have done injustice to their souls and destroys it; and Allah is not unjust to them, but they are unjust to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of that they expend in this present life is as the likeness of a freezing blast that smites the tillage of a people who wronged themselves, and it destroyed that; God wronged them not, but themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of that which they spend in this life of the world is as the likeness of a biting, icy wind which smiteth the harvest of a people who have wronged themselves, and devastateth it. Allah wronged them not, but they do wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that which they spend in pursuit of the life of this world is like a biting frosty blast which smites the harvest of a people who have wronged themselves, and destroys it. God is not unjust to them; they are unjust to their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of that which they expend in this life of the world is as the likeness of a wind wherein is intense cold, it befalleth the tilth of a people who have wronged themselves, and destroyeth it. Allah wronged them not, but themselves they wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of what they spend in the life of this world is that of a cold wind that strikes the tillage of a people who wronged themselves, destroying it. Allah does not wrong them, but they wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they spend in the life of this (material) world May be likened to a wind which brings a nipping frost: It strikes and destroys the harvest of men who have wronged their own souls: it is not Allah that hath wronged them, but they wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of what they spend in this world is the likeness of a wind which is extremely cold; it struck the harvest of a people who did wrong aginst themselves and destroyed it, (i.e. the good deed of a person is only accepted if he is a monotheist and believes in all the Prophets of Allah, including Christ and Muhammad SAW). Allah wronged them not, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wealth they spend in this worldly life is like a freezing wind that smites the harvest of a people who have wronged themselves and destroys it. Allah has not wronged them, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of what they spend in this worldly life is that of a frosty wind that strikes the harvest of a people who have wronged their souls, and destroys it. God did not wrong them, but they wronged their own selves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of what they spend in this worldly life is like that of a wind containing frost which strikes the harvest of a people who have wronged themselves and destroys it. And Allah has not wronged them, but they wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:117] The likeness, the description, of what they, the disbelievers, expend in the life of this world, in the way of enmity towards the Prophet or in the way of voluntary almsgiving or the like, is as the likeness of a wind wherein is a blast, of extreme hot or cold, that smote the tillage, the crops, of a people who have wronged themselves, through unbelief and disobedience, and destroyed it, so that they could not profit from it; so it is with what they expend, it perishes and they profit nothing from it. God did not wrong them, when they lost what they expended, but they wronged themselves, through unbelief, which necessitated this loss.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The likeness of that which they spend in this life of the world) He says: the likeness of what the Jews spend when they are following Judaism (is as the likeness of a biting, icy wind which smites the harvest of a people who have wronged themselves) by not giving what is due to Allah from it, (and devastateth it) ruined it; likewise, idolatry destroys one's spending just as wind destroys the harvest. (Allah wronged them not) by thwarting the benefit of their harvest and spending, (but they did wrong themselves) through disbelief and withholding what is due to Allah from the harvest.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِيهَا صِرٌّ } معناهُ بَردٌ شَدِيدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in it is a violent cold}, means a severe cold.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وما تهلكه وتفنيه بالكليّة من ريح هوى النفس التي فيها برد دنياتكم الفاسدة وأغراضكم الباطلة كالرياء ونحوه { كمثل ريح فيها صرّ أصابت حرث قوم ظلموا أنفسهم } بالشرك والكفر { فأهلكته } عقوبة من الله لظلمهم { وما ظلمهم الله } بإهلاك حرثهم { ولكن } كانوا أنفسهم يظلمون لأنه مسبب عن ظلمهم\n كما قيل: مهلاً فيداك\n وكتا وفوك نفخ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لعدم اعتقادهم بالآخرة { كَمَثَلِ رِيحٍ } عاصف { فِيهَا صِرٌّ } برد شديد { أَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوۤاْ أَنْفُسَهُمْ } بالكفر والفسق والعصيان { فَأَهْلَكَتْهُ } بالمرة\n وصاروا آيسين\n قانطين من نفعها\n وشكوا من الله بما لا يليق بدنابه من نسبة الظلم والتعدي\n تعالى عن ذلك { وَ } الحال أنه { مَا ظَلَمَهُمُ ٱللَّهُ وَلَـٰكِنْ أَنْفُسَهُمْ يَظْلِمُونَ } [آل عمران: 117] أي: ولكن هم يظلمون أنفسهم بكفرهم وفسقهم\n ولم يتفطنوا له ونسبوه إلى الله\n وما الله يريد ظلماً للعباد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: في الكلام حذف، أي: مثل تلف ما ينفقون كمثل إتلاف ربح... الخ، و { الصر }: البرد الشديد، أو ريح فيها صوت وبرد، أو السموم الحارة. يقول الحقّ جلّ جلاله: مثل ما يُنفق الكفار، قربة أو مفاخرة وسمعة، أو ما ينفق سفلة اليهود على أحبارهم، أو المنافقون رياء وخوفاً، { كمثل ريح } فيها برد شديد { أصابت حرث قوم } أي: زرعهم، فأتلفته وأهلكته، والمراد: تشبيه نفقتهم وأعمالهم في تلفه وضياعه وعدم الانتفاع به، بحرث كفار، ضربته ريح فيها برد فاجتاحته، فأصبح صعيداً زلقاً، ولم تبق فيه منفعة في الدنيا والآخرة، { وما ظلمهم الله } بأن ضيع أعمالهم من غير سبب، ولكنهم ظلموا أنفسهم بارتكاب الكفر الذي أحبط أعمالهم. الإشارة: كل من لم يحقق مقام الإخلاص، ولم يصحب أهل التخليص والاختصاص، لا تنفك أعماله من علل، ولا أحواله من دخل، فأعماله فارغة خفيفة، أقل ريح تقلعها وتسقطها عن درجة الاعتبار، وما زالت العامة تقول: الصحيح يصح، والخاوي يدريه الريح. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:135",
      "similarity": 0.5413534364111313
    },
    {
      "verse": "45:8",
      "similarity": 0.4712769272287681
    },
    {
      "verse": "56:63",
      "similarity": 0.3940935559849199
    },
    {
      "verse": "42:20",
      "similarity": 0.3740929750363526
    },
    {
      "verse": "2:223",
      "similarity": 0.33755975465582067
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:117.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:117.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:117.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}