{
  "chapter": "آل عمران",
  "text": "يؤمنون بالله واليوم الءاخر ويامرون بالمعروف وينهون عن المنكر ويسرعون فى الخيرت واو۟لئك من الصلحين",
  "translations": [
    {
      "translation": "They have iman in Allah and the Last Day, and enjoin the right and forbid the wrong, and compete in doing good. They are among the righteous.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in God and the Last Day, and enjoin what is good and forbid what is wrong, and who hasten to give in charity: they are among the upright and the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and in the Last Day and enjoin what is right and forbid what is wrong, and hasten to excel each other in doing good. These are among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in God and the Day of Judgment. They command people to follow good, prohibit others from committing evil and compete with each other in doing good deeds. These are the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They accept faith in Allah and the Last Day, and enjoin good deeds and forbid immorality, and hasten to perform good deeds; and they are the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and the Last Day; they enjoin Al-Ma`ruf and forbid Al-Munkar; and they hasten in (all) good works; and they are among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and the last day, and they enjoin what is right and forbid the wrong and they strive with one another in hastening to good deeds, and those are among the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "believing in God and in the Last Day, bidding to honour and forbidding dishonour, vying one with the other in good works; those are of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and the Last Day, and enjoin right conduct and forbid indecency, and vie one with another in good works. These are of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in God and the Last Day, who enjoin justice and forbid evil and vie with each other in good works. These are righteous men\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they believe in Allah and the Last Day and command that which is reputable and prohibit that which is disreputable, and vie with each other to virtues. And these are of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have faith in Allah and the Last Day, and bid what is right and forbid what is wrong, and they are active in [performing] good deeds. Those are among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and the Last Day; they enjoin what is right, and forbid what is wrong; and they hasten (in emulation) in (all) good works: They are in the ranks of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and the Last Day; they enjoin Al-Ma'ruf (Islamic Monotheism, and following Prophet Muhammad SAW) and forbid Al-Munkar (polytheism, disbelief and opposing Prophet Muhammad SAW); and they hasten in (all) good works; and they are among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in Allah and the Last Day, who order honor and forbid dishonor and race in good works. These are the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in God and the Last Day, and advocate righteousness and forbid evil, and are quick to do good deeds. These are among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They believe in Allah and the Last Day, and they enjoin what is right and forbid what is wrong and hasten to good deeds. And those are among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:114] They believe in God and in the Last Day, enjoining decency and forbidding indecency, vying with one another in good works; those, described in the way God has mentioned, are of the righteous, and some of them are not like this and are not righteous.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They believe in Allah) and in all the Scriptures and messengers (and the Last Day) they believe in resurrection after death as well as in the bliss of Paradise, (and enjoin right conduct) they enjoin Allah's divine Oneness and the following of Muhammad (and forbid indecency) disbelief, idolatry and the following of sorcery and the leaders of misguidance, (and vie one with another in good works) they hasten to perform good works. (They are of the righteous) of the righteous among the community of Muhammad in Paradise, such as Abu Bakr and his fellow believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:104",
      "similarity": 0.6017764395611498
    },
    {
      "verse": "3:110",
      "similarity": 0.5637207624561567
    },
    {
      "verse": "9:71",
      "similarity": 0.49261957335566803
    },
    {
      "verse": "23:61",
      "similarity": 0.4776494937286552
    },
    {
      "verse": "5:79",
      "similarity": 0.45804810213813485
    }
  ]
}