{
  "chapter": "آل عمران",
  "text": "كنتم خير امة اخرجت للناس تامرون بالمعروف وتنهون عن المنكر وتؤمنون بالله ولو ءامن اهل الكتب لكان خيرا لهم منهم المؤمنون واكثرهم الفسقون",
  "translations": [
    {
      "translation": "You are the best nation ever to be produced before mankind. You enjoin the right, forbid the wrong and have iman in Allah. If the People of the Book were to have iman, it would be better for them. Some of them are",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of all the communities raised among men you are the best, enjoining the good, forbidding the wrong, and believing in God. If the people of the Book had come to believe it was best for them; but only some believe, and transgressors are many.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are now the best people brought forth for (the guidance and reform of) mankind. You enjoin what is right and forbid what is wrong and believe in Allah. Had the People of the Book believed it were better for them. Some of them are believers but most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation that ever existed among humanity. You command people to good and prohibit them from evil, and you believe in God. Had the People of the Book accepted the faith (Islam), it would certainly have been better for them. Some of them have faith, but most of them are evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best among all the nations that were raised among mankind – you enjoin good deeds and forbid immorality and you believe in Allah; and if the People given the Book(s) believed it would be better for them; some of them are believers (Muslims) and most of them are disbelievers. (The best Ummah is that of Prophet Mohammed – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best of peoples ever raised up for mankind; you enjoin Al-Ma`ruf (all that Islam has ordained) and forbid Al-Munkar (all that Islam has forbidden), and you believe in Allah. And had the People of the Scripture (Jews and Christians) believed, it would have been better for them; among them are some who have faith, but most of them are Fasiqun (rebellious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best of the nations raised up for (the benefit of) men; you enjoin what is right and forbid the wrong and believe in Allah; and if the followers of the Book had believed it would have been better for them; of them (some) are believers and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation ever brought forth to men, bidding to honour, and forbidding dishonour, and believing in God. Had the People of the Book believed, it were better for them; some of them are believers, but the most of them are ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye are the best community that hath been raised up for mankind. Ye enjoin right conduct and forbid indecency; and ye believe in Allah. And if the People of the Scripture had believed it had been better for them. Some of them are believers; but most of them are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are indeed the best community that has ever been brought forth for [the good of] mankind. You enjoin what is good, and forbid what is evil, and you believe in God. If the People of the Book had also believed, it would have surely been better for them. Some of them are true believers, but most of them are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye are the best community sent forth unto mankind; ye command that which is reputable and ye prevent that which is disreputable. and ye believe in Allah If the people of the Book believe, surely it were better for them. Of them are believers, and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation [ever] brought forth for mankind: you bid what is right and forbid what is wrong, and have faith in Allah. And if the People of the Book had believed, it would have been better for them. Among them [some] are faithful, but most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye are the best of peoples, evolved for mankind, enjoining what is right, forbidding what is wrong, and believing in Allah. If only the People of the Book had faith, it were best for them: among them are some who have faith, but most of them are perverted transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You [true believers in Islamic Monotheism, and real followers of Prophet Muhammad SAW and his Sunnah (legal ways, etc.)] are the best of peoples ever raised up for mankind; you enjoin Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam has ordained) and forbid Al-Munkar (polytheism, disbelief and all that Islam has forbidden), and you believe in Allah. And had the people of the Scripture (Jews and Christians) believed, it would have been better for them; among them are some who have faith, but most of them are Al-Fasiqun (disobedient to Allah - and rebellious against Allah's Command).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation ever to be brought forth for people. You order honor and forbid dishonor, and you believe in Allah. Had the People of the Book believed, it would have surely been better for them. Some of them are believers, but most of them are evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best community that ever emerged for humanity: you advocate what is moral, and forbid what is immoral, and believe in God. Had the People of the Scripture believed, it would have been better for them. Among them are the believers, but most of them are sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong and believe in Allah. If only the People of the Scripture had believed, it would have been better for them. Among them are believers, but most of them are defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:110] You, O community of Muhammad (s), are the best community brought forth, manifested, to men, according to God’s knowledge, enjoining decency, and forbidding indecency, and believing in God. Had the People of the Scripture believed, it, their belief, would have been better for them; some of them are believers, such as ‘Abd Allāh b. Salām, may God be pleased with him and his companions; but most of them, the disbelievers, are wicked.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ye are the best community that has been raised up for mankind) that ever was for mankind. Allah then showed how they were the best community that has been raised for mankind saying: (Ye enjoin right conduct) you enjoin the divine Oneness of Allah and the following of Muhammad (and forbid indecency) you forbid disbelief, idolatry and the opposition of the Messenger; (and ye believe in Allah) as well as in all revealed scriptures and messengers. (And if the People of the Scripture) i.e. the Jews and Christians (had believed it had been better for them) than what they are in now. (Some of them are believers) 'Abdullah Ibn Salam and his followers; (but most of them are evil-livers) unbelievers who break their pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كُنْتم خيرَ أمّة } لكونكم موحدين، قائمين بالعدل الذي هو ظله { تأمُرون بالمَعْروف وتَنْهَون عن المُنْكر } إذ لا يقدر على ذلك إلا الموحد العادل لعلمه بالمعروف والمنكر، كما مرّ في تأويل قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كُنْتُمْ } أيها المحمديون { خَيْرَ أُمَّةٍ } في علم الله مستوية على صراط التوحيد\n معتدلة بين طرفي الإفراط والتفريط { أُخْرِجَتْ لِلنَّاسِ } أي: قدرت ظهوركم\n لتكميل الناقصين من الناس\n حتى { تَأْمُرُونَ بِٱلْمَعْرُوفِ } المفروض في سلوك طريق التوحيد { وَتَنْهَوْنَ عَنِ ٱلْمُنْكَرِ } المحظور فيه { وَ } ذلك الأمر والنهي إنما صدر منكم\n لكونكم { تُؤْمِنُونَ } توقنون { بِٱللَّهِ } المستوي على عروش ذرائر الكائنات\n بالاعتدال الذي هو صراط الله الأقوم { وَلَوْ آمَنَ أَهْلُ ٱلْكِتَابِ } بأجمعهم بدينكم وملتكم { لَكَانَ خَيْراً لَّهُمْ } ينجيهم عن ورطتي الإفراد والتفريط\n ويوصلهم إلى صراط مستقيم\n وإن كان القليل { مِّنْهُمُ ٱلْمُؤْمِنُونَ } الداخلون في حصار الإيمان مع المؤمنين { وَ } لكن { أَكْثَرُهُمُ ٱلْفَاسِقُونَ } [آل عمران: 110] الخارجون عن حدوده وأحكامه\n\n\nلا تبالوا أيها الموحدون بفسهم وكفرهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كان }: على بابها من الدلالة على المُضِيِّ، أي: كنتم في اللوح المحفوظ، أو في علم الله، أو فيما بين الأمم المتقدمة، أو: صلة، أي: أنتم خير أمة، و { للناس }: يتعلق بأخرجت، أو بكنتم، أي: كنتم خير الناس للناس\n يقول الحقّ جلّ جلاله: لأمة نبينا محمد صلى الله عليه وسلم: { كنتم } في سابق علمي { خير أمة } ظهرت { للناس } تجيئون بهم إلى الجنة بالسلاسل\n ثم بيَّن وجه فضلهم فقال: { تأمرون بالمعروف وتنهون عن المنكر وتؤمنون بالله } وبجميع ما يجب الإيمان به\n وقد ورد في مدح هذه الأمة المحمدية أحاديث، منها قوله صلى الله عليه وسلم:\n\n \" حُرِّمتْ الجنةُ على الأنبياء حتى أدخلها أنا، وحُرّمتْ الجنة على الأُمَمِ حتى تدخلها أمتي \" \n\nومنها قوله صلى الله عليه وسلم:\n\n \" أمتي أمةٌ مَرْحُومَةٌ، إذَا كَانَ يَوْمُ القِيامةِ أَعطى الله كُلَّ رَجُلٍ مِن هذه الأمة رجُلاً فيقال: هذَا فِدَاؤُكَ مِنَ النَّارِ \"\n \n\nوعن أنس قال: \" خرجت مع النبيّ صلى الله عليه وسلم، فإذا صوت يجيء من شِعْبِ، فقال: يا أنس: قُمْ فانظرْ ما هذا الصوت، فانطلقت فإذا برجلٍ يُصلّي إلى شجرة، ويقول: اللهم اجعلني من أمة محمد صلى الله عليه وسلم، الأمة المرحومة، المغفور لها، المستجاب لها، المتاب عليها، فأتيتُ النبيّ صلى الله عليه وسلم، فأخبرته، فقال: انطلق، فقل له: إن رسول الله صلى الله عليه وسلم يقرئك السلام، ويقول لك: من أنت؟ فأتيت، فأعلمته ما قال النبيّ صلى الله عليه وسلم فقال: اقرأ مني السلام على رسول الله صلى لله عليه وسلم، وقل له: أخوك الخضر يقول لك: ادع الله أن يجعلني من أمتك المرحومة المغفور لها \"\n وقيل لعيسى ابن مريم: هل بعد هذه الأمة أمة؟ قال: نعم، أمة أحمد\n قيل: وما أمة أحمد؟ قال: علماء، حكماء، أبرار أتقياء، كأنهم من الفقه أنبياء، يرضون باليسير من الرزق، ويرضى الله عنهم باليسير من العمل، يدخلهم الجنة بشهادة أن لا إله إلا الله\n هـ\n وليس أولها أولى بالمدح من آخرها، لقوله صلى الله عليه وسلم:\n\n \" أُمتي كالمَطَرِ، لا يُدْرَى أولهُ خيرٌ أو آخرُه \" \n\n؟ وفي خبر آخر عنه صلى الله عليه وسلم قال:\n\n \" اشتقْتُ إلى إخواني، فقال أصحابُه: نحن إخوانُك يا رسول الله، فقال أنتم أصْحَابي، إخْواني: ناس يأتُون بعدي، يُؤمنون بي ولم يَرَوْنِي، يَوَدُّ أحدُهم لو يَرَاني بجميع ما يَمْلِكُ\n يَعْدِلُ عملُ أحدهم سبعين منكم\n قالوا: مِنْهم يا رسول الله؟ قال: منكم\n قالوا: ولِمَ ذلك يا رسول الله؟ قال: لأنكم وَجَدْتُم على الخير أعْواناً، وهم لا يَجِدُوا عليه أعواناً \" \n\nأو كما قال - عليه الصلاة والسلام -\n\n\nقلت: التفضيل باعتبار أجور الأعمال، وأما باعتبار اليقين والمعرفة، فالصحابة أفضل الخلق بعد الأنبياء - عليهم السلام - ويدل على هذا قوله - عليه الصلاة والسلام -\n\n \" يعدل عمل أحدهم \" \n\n، ولم يقل إيمان أحدهم\n والله تعالى أعلم\n الإشارة: كنتم يا معرش الصوفية خير أمة أخرجت للناس، تأمرون بالجمع على الله والغيبة عما سواه، وتنهونَ عن كلِّ ما يُبعد عن الله ويفرق العبدَ عن مولاه، وتؤمنون بالله وبما وعد به الله، إيمان الشهود والعيان، الذي هو مقام الإحسان\n قال القشيري في رسالته: قد جعل الله هذه الطائفة صفوة أوليائه، وفضَّلهم على الكافة من عباده بعد رسله وأنبيائه\n وقال الجنيد رضي الله عنه: لو نعلم أن تحت أديمِ السماء أشرف من هذا العلم الذي نتكلم فيه مع أصحابنا، لسعيت إليه ولو حبواً\n هـ\n وكان كثيراً ما ينشد:\n\nوقال الشيخ الصقلي: كلُّ من صدَّقَ بهذا العلم فهو من الخاصة، وكل من فهمه فهو من خاصة الخاصة، وكل من عبّر به وتكلم فيه فهو من النجم الذي لا يُدرك والبحر الذي لا ينزف\n وقال في الإحياء - لمَّا تكلم على معرفة الله والعلم بالله، قال: والرتبةُ العليا في ذلك للأنبياء، ثم للأولياء العارفين، ثم للعماء الراسخين، ثم للصالحين\n فقد قدَّم الأولياء على العلماء\n قال ابن رشد: وما قاله القشيري والغزالي متفق عليه\n قال: ولا يشكُّ عاقلٌ أنَّ العارفين بالله وما يجب له من الكمال، أفضل من العارفين بأحكام الله\n انظر تمامه في المعيار\n وقال في المباحث:\n\nثم قال:\n\nثم دعا أهل الكتاب إلى الإيمان، وهوَّن أمرهم، فقال: {\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:104",
      "similarity": 0.6649390417499739
    },
    {
      "verse": "3:114",
      "similarity": 0.5637207624561568
    },
    {
      "verse": "16:83",
      "similarity": 0.4955761278340912
    },
    {
      "verse": "9:71",
      "similarity": 0.47853753276673866
    },
    {
      "verse": "5:79",
      "similarity": 0.4601615170734118
    }
  ]
}