{
  "chapter": "آل عمران",
  "text": "ان الذين كفروا۟ لن تغنى عنهم امولهم ولا اولدهم من الله شيـا واو۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "As for those who are kafir, their wealth and children will not help them against Allah in any way. They are the Companions of the Fire, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, neither wealth nor children will avail them in the least against God. They are the residents of Hell where they will live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who denied the Truth, neither their possessions nor their children will avail them against Allah. They are the people of the Fire, and therein they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wealth and the children of the unbelievers can never make them independent of God. They are the dwellers of hell wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who disbelieve – neither their wealth nor their offspring will help save them in the least, from Allah; and they are the people of fire; remaining in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who disbelieve, neither their properties nor their offspring will avail them against Allah. They are the dwellers of the Fire, therein they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve, surely neither their wealth nor their children shall avail them in the least against Allah; and these are the inmates of the fire; therein they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, their riches shall not avail them, neither their children, against God; those are the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the riches and the progeny of those who disbelieve will not avail them aught against Allah; and such are rightful owners of the Fire. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny the truth, neither their possessions nor their children shall avail them in the least against God. They will be inmates of the Fire. They will remain there for ever;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve, neither their riches nor their progeny shall avail them aught against Allah. And these are the fellows of the Fire; thereinto they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, neither their wealth nor their children will avail them anything against Allah. They shall be the inmates of the Fire and remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Faith,- neither their possessions nor their (numerous) progeny will avail them aught against Allah: They will be companions of the Fire,-dwelling therein (for ever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who reject Faith (disbelieve in Muhammad SAW as being Allah's Prophet and in all that which he has brought from Allah), neither their properties, nor their offspring will avail them aught against Allah. They are the dwellers of the Fire, therein they will abide. (Tafsir At-Tabari, Vol. 4, Page 58).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, neither their riches nor their children shall help them a thing from Allah. They are the people of the Fire, and there they shall remain for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, neither their possessions nor their children will avail them anything against God. These are the inhabitants of the Fire, abiding therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all, and those are the companions of the Fire; they will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:116] As for the disbelievers, their riches shall not avail, protect, them, neither their children, against God, that is, against His chastisement: these two are singled out for mention because a person usually avails himself either by paying a ransom, or by [resorting to] the help of his children; those are the inhabitants of the Fire,   abiding therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the riches) the abundance of riches (and the progeny) and the abundance of progeny (of those who disbelieve) in Muhammad and in the Qur'an, i.e. Ka'b [Ibn al-Ashraf] and his followers (will not avail them 68 aught against Allah) will not avail them against the punishment of Allah; (and such are rightful owners of the Fire) the dwellers of hell. (They will abide therein) for ever.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ كَفَرُواْ } بالله في النشاة الأولى\n عتواً واستكباراً مفتخرين بأموالهم وأولادهم متظاهرين بها { لَنْ تُغْنِيَ } وتدفع { عَنْهُمْ } في النشأة الأخرى { أَمْوَالُهُمْ وَلاَ أَوْلاَدُهُمْ مِّنَ } غضب { ٱللَّهِ شَيْئاً } قليلاً { وَأُوْلَـٰئِكَ } المستكبرون\n المفتخرون\n هم { أَصْحَابُ ٱلنَّارِ } لا يخصلون\n ولا يخرجون منها بل { هُمْ فِيهَا خَالِدُونَ } [آل عمران: 116] مخلقدون\n لا ترجى نجاتهم وتخفيف عذابهم أصلا\n ولا ينفع لهم إنفاقهم وإحسانهم الذي صدر عنهم في دار الدنيا\n لعدم مقارنته بالإيمان\n\n\nبل { مَثَلُ مَا يُنْفِقُونَ } رياءً وسمعةً واشتهاراً { فِي هَـٰذِهِ ٱلْحَيَاةِ ٱلدُّنْيَا } لا لمثولة أخروية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إن الذين كفروا } وجحدوا ما جاء به الرسول صلى الله عليه وسلم، { لن تغني عنهم أموالهم ولا أولاهم من } عذاب { الله شيئاً }  { وأولئك أصحاب النار } أي: مُلاَزِمُوها، كَمُلاَزَمَةِ الرجل لصاحبة، { هم فيها خالدون }. الإشارة: إن الذين كفروا بالخصوصية عند أهل زمانهم، وفاتهم اقتباس أنوارهم، لن تغني عنهم أموالهم ولا أولادهم ولا علومهم مما فاتهم من معرفة الله شيئاً، ماذا وَجَدَ مَنْ فَقَدَ الله؟ وماذا فقد من وجد الله؟! قال الشاعر:\nولا طريق لمعرفة الحق المعرفة الخاصة - أعني معرفة العيان - إلا صحبة أهل الشهود والعيان، فكلُّ من أنكرهم كان غايته الحرمان، ولزمته البطالة والخذلان، وجَرَّب، ففي التجريب علم الحقائق، ومن حُرم صحبتهم لا ينفك عن نار القطيعة وعذاب الحجاب، وعنت الحرص والتعب، عائذاً بالله من ذلك.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:17",
      "similarity": 0.9802338894022993
    },
    {
      "verse": "3:10",
      "similarity": 0.5351365746307961
    },
    {
      "verse": "2:39",
      "similarity": 0.5220272233080151
    },
    {
      "verse": "7:36",
      "similarity": 0.499364095726175
    },
    {
      "verse": "69:28",
      "similarity": 0.48412350276356003
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/3:116.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/3:116.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/3:116.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}