{
  "chapter": "آل عمران",
  "text": "يايها الذين ءامنوا۟ لا تتخذوا۟ بطانة من دونكم لا يالونكم خبالا ودوا۟ ما عنتم قد بدت البغضاء من افوههم وما تخفى صدورهم اكبر قد بينا لكم الءايت ان كنتم تعقلون",
  "translations": [
    {
      "translation": "You who have iman! do not take any outside yourselves as intimates. They will do anything to harm you. They love what causes you distress. Hatred has appeared out of their mouths, but what their breasts hide is far worse. We have made the Signs clear to you if you use your intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not make others except your own people your confidants. They will spare no effort to ruin you: They surely desire your annihilation. Hate is on their tongues, and what they hide in their hearts is worse. We have shown you the signs if you have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not take for intimate friends those who are not of your kind. They spare no effort to injure you. Indeed they love all that distresses you. Their hatred is clearly manifest in what they say, and what their breasts conceal is even greater. Now We have made Our messages clear to you, if only you can understand (the danger of their intimacy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not expose your privacy to the unbelievers. They like to mislead you and see that you are seriously harmed. Signs of animosity from their mouths have already become audible, but what they hide in their heads is even worse. We have certainly made Our evidence clear, if only you would consider it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not share your secrets with others – they do all they can to ruin you; they desire the maximum harm for you; enmity has been revealed from their speech, and what they hide in their breasts is greater; we have explained the signs clearly to you, if you have intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not as (your) Bitanah (advisors, helpers) those other than your own, since they will not fail to do their best to corrupt you. They desire to harm you severely. Hatred has already appeared from their mouths, but what their breasts conceal is far worse. Indeed We have made plain to you the Ayat if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not take for intimate friends from among others than your own people; they do not fall short of inflicting loss upon you; they love what distresses you; vehement hatred has already appeared from out of their mouths, and what their breasts conceal is greater still; indeed, We have made the communications clear to you, if you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, take not for your intimates outside yourselves such men spare nothing to ruin you; they yearn for you to suffer Hatred has already shown itself of their mouths, and what their breasts conceal is yet greater. Now We have made clear to you the signs, if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Take not for intimates others than your own folk, who would spare no pains to ruin you; they love to hamper you. Hatred is revealed by (the utterance of) their mouths, but that which their breasts hide is greater. We have made plain for you the revelations if ye will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take outsiders as your intimate friends, they will spare no effort to harm you. They love to see you suffer; their hatred is evident from the words which fall from their mouths. But what their hearts conceal is far worse. We have made Our signs clear to you; will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! take not for an intimate anyone besides yourselves; they shall not be remiss in doing you mischief. Fain would they that which distresseth you. Surely their malice hath shewn itself by their mouths, and that which their breasts conceal is greater still. Surely We have expounded unto you the signs, if ye will but reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not take your confidants from others than yourselves; they will spare nothing to ruin you. They are eager to see you in distress. Hatred has already shown itself from their mouths, and what their breasts hide [within] is yet worse. We have certainly made the signs clear for you, should you exercise your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Take not into your intimacy those outside your ranks: They will not fail to corrupt you. They only desire your ruin: Rank hatred has already appeared from their mouths: What their hearts conceal is far worse. We have made plain to you the Signs, if ye have wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not as (your) Bitanah (advisors, consultants, protectors, helpers, friends, etc.) those outside your religion (pagans, Jews, Christians, and hypocrites) since they will not fail to do their best to corrupt you. They desire to harm you severely. Hatred has already appeared from their mouths, but what their breasts conceal is far worse. Indeed We have made plain to you the Ayat (proofs, evidences, verses) if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take intimates with other than your own. They spare nothing to ruin you, they yearn for you to suffer. Hatred has already shown itself from their mouths, and what their chests conceal is yet greater. Indeed, We have made clear to you the signs, if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not befriend outsiders who never cease to wish you harm. They love to see you suffer. Hatred has already appeared from their mouths, but what their hearts conceal is worse. We have made the messages clear for you, if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not take as intimates those other than yourselves, for they will not spare you [any] ruin. They wish you would have hardship. Hatred has already appeared from their mouths, and what their breasts conceal is greater. We have certainly made clear to you the signs, if you will use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:118] O you who believe, do not take as intimates, as sincere friends, revealing to them your secret thoughts, anyone apart from yourselves, from among the Jews, Christians and the hypocrites; such men spare nothing to ruin you (khabālan is in the accusative because the preposition [that usually precedes it, sc. fī’l-khabāl] has been omitted), that is to say, they would not be remiss about corrupting you; they would love, they wish, for you to suffer ([al-‘anat means] extreme hardship). Hatred, enmity towards you, is revealed, it is manifested, by their mouths, by sowing discord among you and informing the idolaters of your secret [plans]; and what their breasts conceal, of enmity, is yet greater. Now We have made clear to you the signs, of their enmity; if you understand, this, then do not befriend them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then forbade the believers from among the Helpers to speak with the Jews or divulge secrets to them, saying: (0 ye who believe! Take not) the Jews (for intimates) confidants (others than your own folk) the sincere believers, (who would spare no pains to ruin you; they love to hamper you) they love for you to sin and become idolaters as they themselves have become. (Hatred is revealed by (the utterance of) their mouths) through vilification and defamation, (but that which their breasts hide is greater) but what they hide in their hearts of hatred and enmity is even greater. (We have made plain for you the revelations) the signs of their resentful envy (if you will understand) what is recited to you; it is also said that this means: We have made the revelations, i.e. the commands and prohibitions, clear so that you know what I command you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ تَتَّخِذُواْ بِطَانَةً مِّن دُونِكُمْ } فالبِطَانَةُ: الدَّخِيلُ\n والبَطَائِنُ: الدُّخَلاءُ\n\n\n\n\nوقوله تعالى: { لاَ يَأْلُونَكُمْ خَبَالاً } معناهُ فَسَاداً وشَرّاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {Do not take a patron other than yourselves} - so the patron is the one who comes in.\n\n\nAnd the {baṭā'in}: the {dukhlā'}\n\n\nAnd His saying, {They will not cause you any harm} means corruption and evil.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ لا تتخذوا بطانة من دونكم } بطانة الرجل صفيه وخليصه الذي يبطنه ويطلع عليه أسراره، ولا يمكن وجود مثل هذا الصديق إلا إذا اتحدا في المقصد واتفقا في الدين والصفة، متحابين في الله لا لغرض كما قيل في الأصدقاء: نفس واحدة في أبدان متفرّقة، فإذا كان من غير أهل الإيمان فبأن يكون كاشحاً أحرى. ثم بيّن نفاقه واستبطانه العداوة بقوله: { لا يألونكم خبالاً } إلى آخره، إذ المحبة الحقيقية الخالصة لا تكون إلا بين الموحدين، لكونها ظلّ الوحدة فلا تكون بين المحجوبين لكونهم في عالم التضادّ والظلمة. فأين الصفاء والوفاق في عالمهم؟ بل ربما تتآلفهم الجنسية العامة الإنسانية لاشتراكهم في النوع والمنافع والملاذ واحتياجهم إلى التعاون فيها، فإذا لم تتحصل أغراضهم من النفع واللذّة تهارشوا وتباغضوا وبطلت الإلفة التي كانت بينهم، لكونها مسببة عن أمر قد تغير إذ النفس منشأ التغير والمنافع الدنيوية لا تبقى بحالها، واللذات النفسانية سريعة الانقضاء فلا تدوم المحبة عليها بخلاف المحبة الأولى، فإنها مستندة إلى أمر لا تغير فيه أصلاً، هذا إذا كانت فيما بينهم، فكيف إذا كانت بينهم وبين من يخالفهم في الأصل والوصف؟ وأنّى يتجانس النور والظلمة؟ ومن أين يتوافق العلو والسفل؟ فبينهما عداوة حقيقية وتخالف ذاتي لا تخفى آثاره كما بيّن الله تعالى بقوله: { قد بدت البغضاء من أفواههم } لامتناع اختفاء الوصف الذاتيّ. قال النبي صلى الله عليه وسلم:\n \" ما أضمر أحد شيئاً إلا وأظهره الله في فلتات لسانه وصفحات وجهه \" \n{ وما تخفي صدورهم أكبر } لأنه نار وهذا شرار، ذاك أصل، وهذا فرعه { قد بيّنا لكم الآيات } دلائل المحبة والعداوة وأسبابهما { إن كنتم تعقلون } أي: تفهمون من فحوى الكلام.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم أن { لاَ تَتَّخِذُواْ بِطَانَةً } صديقاً وصاحب سر\n تستودعون سرائركم عنده { مِّن دُونِكُمْ } أي: الكفار دون المؤمنين\n واعلموا أنهم { لاَ يَأْلُونَكُمْ } لا يمنعون عنكم ولا يقصرون في شأنكم { خَبَالاً } ضرراً وفساداً\n بل { وَدُّواْ } رجوا دائما { مَا عَنِتُّمْ } أي: ضرركم وهلاككم\n ومن غاية وداتدتهم { قَدْ بَدَتِ } ظهرت { ٱلْبَغْضَآءُ } المكنونة في نفوسهم { مِنْ أَفْوَاهِهِمْ } بلا قصد واختبار { وَ } لا شك أن { مَا تُخْفِي صُدُورُهُمْ } قصداً واختياراً { أَكْبَرُ } مما تبدي أفواههم وألسنتهم هفوة واضطراراً { قَدْ بَيَّنَّا } أوضحنا { لَكُمُ } أيها المؤمنون { الآيَاتِ } المتعلقة لأمور معاشكم ومعادكم { إِنْ كُنْتُمْ تَعْقِلُونَ } [آل عمران: 118] تفهمون مقصادها\n وتتعظون بها\n وتعملون بمقتضاها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: بطانة الرجل: خواصه الذين يطلعهم على باطنه وسره\n وسميت بطانة تشبيهاً لها بالثوب الذي يلي بطنه كالشعار\n قال عليه الصلاة والسلام:\n \" الأَنْصَارَ شِعَارٌ والنَّاسُ دِثَارٌ \" \nوهي اسم تطلق على المفرد والجمع والمذكر والمؤنث\n والألو: التقصير\n وأصله: أن يتعدى بالحرف\n تقول: لا آلو في نصحك أي: لا أقصر فيه\n ثم عدي إلى مفعولين\n كقولهم: لا آلوك نصحاً\n على تضمن معنى المنع أو النقص\n والخبال: الفساد\n و { ما عنتم }: مصدرية\n والعنت: التعب والمشقة\n والأنامل: جمع أنملة - بضم الميم وفتحها -\n والضير والضر واحد\n ومضارع الأول: يضير\n والثاني: يضر\n وهو هنا مجزوم\n وأصله: يضرُركم\n نقلت حركة الراء إلى الضاد\n وضمت الراء\n إتباعاً لحركة الضاد طلباً للمشاكلة\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تتخذوا بطانة } أي: أصدقاء وأصفياء\n تطلعونهم على سركم\n وهم { من دونكم } ليسوا على دينكم\n فإنهم { لا يألونكم خبالاً } أي: لا يقصرون جهدَهم في إدخال الفساد بينكم بالتخليط والنميمة وإطلاع الكفار على عورتكم\n نزلت في رجال من المسلمين\n كانوا يصلون رجالاً من اليهود لما كان بينهم من القرابة والصداقة\n أو في المنافقين كان يصلهم بعض المسلمين\n ثم وصفهم بأوصاف توجب التنفير منهم فقال: { ودوا ما عنتم } أي: تمنوا عنتكم وهلاككم وضلالكم\n { قد بدت البغضاء من أفواههم } أي: ظهرت أمارة العداوة من أفواههم بالوقيعة في المسلمين\n أو بإطلاع المشركين على عوراتهم\n أو في كلامهم مع المسلمين بالغيظ\n لأنهم لا يتمالكون أنفسهم لفرط بغضهم\n { وما تخفي صدورهم } من العداوة والبغضاء\n { أكبر } مما أظهره\n لأن ظهوره منهم ليس عن روية واختيار\n بل من غلبة غيظ واضطرار\n { قد بيّنَا لكم } أيها المؤمنون { الآيات } الدالة على مجانبة الكافرين ومولاة المؤمنين\n { إن كنتم تعلقون } ما يُبين لكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:47",
      "similarity": 0.5231675595353732
    },
    {
      "verse": "60:4",
      "similarity": 0.26418114034490325
    },
    {
      "verse": "49:7",
      "similarity": 0.24654056558869933
    },
    {
      "verse": "9:128",
      "similarity": 0.2374613009070166
    },
    {
      "verse": "5:91",
      "similarity": 0.23299126955048957
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003118.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003118.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:118.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}