{
  "chapter": "آل عمران",
  "text": "ضربت عليهم الذلة اين ما ثقفوا۟ الا بحبل من الله وحبل من الناس وباءو بغضب من الله وضربت عليهم المسكنة ذلك بانهم كانوا۟ يكفرون بـايت الله ويقتلون الانۢبياء بغير حق ذلك بما عصوا۟ وكانوا۟ يعتدون",
  "translations": [
    {
      "translation": "They will be plunged into abasement wherever they are found, unless they have a treaty with Allah and with the people. They have brought down anger from Allah upon themselves, and they have been plunged into destitution. That was because they rejected Allah's Signs and killed the Prophets without any right to do so. That was because they disobeyed and went beyond the limits.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Degraded they shall live wheresoever they be unless they make an alliance with God and alliance with men, for they have incurred the anger of God, and misery overhangs them. That is because they denied the signs of God and killed the prophets unjustly, and rebelled, and went beyond the limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever they were, they were covered with ignominy, except when they were protected by either a covenant with Allah or a covenant with men. They are laden with the burden of Allah's wrath, and humiliation is stuck upon them - and all this because they rejected the signs of Allah and slayed the Prophets without right, and because they disobeyed and transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Humiliation will strike them wherever they seek protection, except when they seek protection from God and the people. They have incurred the wrath of God unto themselves and have been struck with destitution for their rejection of the revelations of God and for unjustly murdering the Prophets. It is all because of their transgression and rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disgrace has been destined for them – wherever they are they shall not find peace, except by a rope from Allah and a rope from men – and they have deserved the wrath of Allah, and misery is destined for them; that is because they used to disbelieve in the signs of Allah, and unjustly martyr the Prophets; that was for their disobedience and transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are stricken with humility wherever they may be, except when under a covenant (of protection) from Allah, and a covenant from men; they have drawn on themselves the wrath of Allah, and destitution is put over them. This is because they disbelieved in the Ayat of Allah and killed the Prophets without right. This is because they disobeyed (Allah) and used to transgress (the limits set by Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abasement is made to cleave to them wherever they are found, except under a covenant with Allah and a covenant with men, and they have become deserving of wrath from Allah, and humiliation is made to cleave to them; this is because they disbelieved in the communications of Allah and slew the prophets unjustly; this is because they disobeyed and exceeded the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abasement shall be pitched on them, wherever they are come upon, except they be in a bond of God, and a bond of the people; they will be laden with the burden of God's anger, and poverty shall be pitched on them; that, because they disbelieved in God's signs, and slew the Prophets without right; that, for that they acted rebelliously and were transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ignominy shall be their portion wheresoever they are found save (where they grasp) a rope from Allah and a rope from men. They have incurred anger from their Lord, and wretchedness is laid upon them. That is because they used to disbelieve the revelations of Allah, and slew the prophets wrongfully. That is because they were rebellious and used to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "abasement shall attend them wherever they are found, unless they make a covenant with God or with man. They have incurred God's wrath and have been utterly humbled, because they have persistently disbelieved in God's signs and killed prophets unjustly. This resulted from their disobedience and their habit of transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stuck upon them is abjection wheresoever they may be come upon, except in a compact with Allah and a compact with men; and they drew upon themselves indignation from Allah; and stuck upon them is poverty. That is because they have been disbelieving in the signs of Allah, and slaying the prophets without justice. That is because they disobeyed and have been trespassing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever they are found, abasement is stamped upon them, except for an asylum from Allah and an asylum from the people. They have earned the wrath of Allah, and poverty has been stamped upon them. That, because they would deny the signs of Allah and kill the prophets unjustly. That, because they would disobey and commit transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shame is pitched over them (Like a tent) wherever they are found, except when under a covenant (of protection) from Allah and from men; they draw on themselves wrath from Allah, and pitched over them is (the tent of) destitution. This because they rejected the Signs of Allah, and slew the prophets in defiance of right; this because they rebelled and transgressed beyond bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indignity is put over them wherever they may be, except when under a covenant (of protection) from Allah, and from men; they have drawn on themselves the Wrath of Allah, and destruction is put over them. This is because they disbelieved in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah and killed the Prophets without right. This is because they disobeyed (Allah) and used to transgress beyond bounds (in Allah's disobedience, crimes and sins).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abasement shall be pitched upon them wherever they are found, except they are in a bond from Allah, and a bond of the people. They have incurred theAnger of Allah and have been humiliated, because they disbelieved the verses of Allah and unjustly slew His Prophets and because they disobeyed and were transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be humiliated wherever they are encountered, except through a rope from God, and a rope from the people; and they incurred wrath from God, and were stricken with misery. That is because they rejected God’s revelations, and killed the prophets unjustly. That is because they rebelled and committed aggression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have been put under humiliation [by Allah] wherever they are overtaken, except for a covenant from Allah and a rope from the Muslims. And they have drawn upon themselves anger from Allah and have been put under destitution. That is because they disbelieved in the verses of Allah and killed the prophets without right. That is because they disobeyed and [habitually] transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:112] Abasement shall be cast upon them, wherever they are found, so that they have no strength and no protection, save, if they be [clinging to], a rope of God, and a rope of the, believing, people, this being the latter’s covenant of security for them on the condition that they pay the jizya, in other words, they have no protection other than this; they have incurred, they have ended up, with anger from God, and poverty shall be cast upon them; that, is, because they disbelieved in God’s signs, and slew the prophets without right; that (dhālika is [repeated] for emphasis), is, because they disobeyed, God’s command, and used to transgress, passing from what is lawful into what is unlawful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ignominy shall be their portion) the humiliation of Jizyah shall be imposed upon them (wheresoever they are found) they cannot stand against the believers (save (where they grasp) a rope from Allah) except if they believe in Allah (and a rope from men) or take a pledge with the rulers to pay the Jizyah. (They have incurred anger) they deserved anger (from their Lord, and wretchedness is laid upon them) the attire of poverty was imposed upon them. (That) ignominy (is because they used to disbelieve the revelations of Allah) in Muhammad and the Qur'an, (and slew the Prophets wrongfully) i.e. without the prophets having committed any crime. (That) anger and humiliation (is because they were rebellious) against Allah on the Sabbath (and used to transgress) by killing the prophets and take as lawful things that were prohibited.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَبَآءُوا بِغَضَبٍ مِّنَ ٱللَّهِ } معناهُ بانوا بِهِ\n\n\n\n\nوقوله تعالى: { ضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ } معناهُ أُلْزِمُوا\n\n",
      "translations": [
        {
          "translation": " And his saying, {And they repented with the wrath of Allah}, its meaning is that they repented with Him.\n The meaning of the verse {the dwelling place was inflicted on them} is that they were made to dwell.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ ضُرِبَتْ عليهم الذِلة } لأنّ العزّة لله جميعاً، فلا نصيب فيها لأحد إلا لمن تخلّق بصفاته بمحو صفات البشرية، كالرسول والمؤمنين الذين هم مظاهر عزّته، كما قال الله تعالى:\n[المنافقون، الآية: 8]، فمن خالفهم فهو مضادّ لصفة العزّة، مباين للأعزاء، فتلزمه الذلّة وتشمله على أي حال يكون، إلا برابطة ما بينه وبين أهل العزّة كقوله: { إلا بحبل من الله وحبل من الناس } أي: ذمّة وعهد، وذلك يكون أمراً عارضياً لا أصل له مرتبطاً برابطة مجعولة فلا تقابل صفتهم الذاتية اللازمة لهم التي هي الذلّة الناشئة من أصل نفوسهم. واستحقوا غضباً شديداً من عند الله لبعدهم وإعراضهم عن الحق، ولزمتهم المسكنة لانقطاعهم عن الله إلى نفوسهم فوكلهم إلى أنفسهم.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ } والصغار والهوان { أَيْنَ مَا ثُقِفُوۤاْ } وجدوا\n صاروا مهانين\n صاغرين { إِلاَّ } المعتصمين منهم { بِحَبْلٍ } موفق { مِّنَ } عند { ٱللَّهِ } وهو الانقياد لدين الإسلام { وَحَبْلٍ } عهد وثيق\n وذمة { مِّنَ ٱلنَّاسِ وَ } بعدما { بَآءُوا } رجعوا عن تصديق دين الإسلام المنزل لخير الأنام\n استحقوا { بِغَضَبٍ } نازل عظيم { مِّنَ ٱللَّهِ وَ } لا يمكنهم دفعه\n إذ { ضُرِبَتْ } تمكنت وتقررت { عَلَيْهِمُ ٱلْمَسْكَنَةُ } المذمومة الناشئة من خباثة طينتهم\n لا ترجى عزتهم أصلاً\n\n\n{ ذٰلِكَ } أي: ضرب الذلة والمسكنة\n والصغار والهوان عليهم { بِأَنَّهُمْ كَانُواْ } في أوان عزتهم وعظمتهم { يَكْفُرُونَ } يكذبون ويستهزئون { بِآيَاتِ ٱللَّهِ } المنزلة من عنده { وَيَقْتُلُونَ ٱلأَنْبِيَآءَ بِغَيْرِ حَقٍّ } بلا رخصة شرعية { ذٰلِكَ } الكفر والقتل الصادر منهم { بِمَا عَصَوْاْ } أي: بسبب عصيانهم وخروجهم عن إطاعة أمر الله\n والانقياد لأحكامه عتواً وعناداً { وَّ } متى عصوا { كَانُواْ يَعْتَدُونَ } [آل عمران: 112] يتجاوزون عن حدود الله بالمرة\n ويقتلون من يقيمها استكباراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وَلَوْ آمَنَ أَهْلُ ٱلْكِتَابِ لَكَانَ خَيْراً لَّهُمْ مِّنْهُمُ ٱلْمُؤْمِنُونَ وَأَكْثَرُهُمُ ٱلْفَاسِقُونَ لَن يَضُرُّوكُمْ إِلاَّ أَذًى وَإِن يُقَاتِلُوكُمْ يُوَلُّوكُمُ ٱلأَدُبَارَ ثُمَّ لاَ يُنصَرُونَ ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ أَيْنَ مَا ثُقِفُوۤاْ إِلاَّ بِحَبْلٍ مِّنْ ٱللَّهِ وَحَبْلٍ مِّنَ ٱلنَّاسِ وَبَآءُوا بِغَضَبٍ مِّنَ ٱللَّهِ وَضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ ذٰلِكَ بِأَنَّهُمْ كَانُواْ يَكْفُرُونَ بِآيَاتِ ٱللَّهِ وَيَقْتُلُونَ ٱلأَنْبِيَآءَ بِغَيْرِ حَقٍّ ذٰلِكَ بِمَا عَصَوْاْ وَّكَانُواْ يَعْتَدُونَ }  قلت: الاستثناء في قوله { إلا بحبل }: من أعم الأحوال\n أي: ضربت عليهم الذلة في جميع الأحوال\n إلا متلبسين بذمة من الله وذمة من الناس\n يقول الحقّ جلّ جلاله: { ولو آمن أهل الكتاب } إيماناً كإيمانكم\n { لكان خيراً لهم } مما هم عليه\n\nوليس أهل الكتاب سواء\n بل { منهم المؤمنين } كعبد الله بن سلام وأصحابه\n { وأكثرهم الفاسقون } المتمردون في الكفر والفسوق\n فلا يهولكم أمرهم\n فإنهم { لن يضروكم } إلا ضرراً يسيراً كأذى باللسان من عيب وسب وتحريش بينكم\n ولا قدرة لهم على القتال\n { وإن يقاتلوكم } ينهزموا\n و { يولوكم الأدبار ثم لا ينصرون } أبداً عليكم\n وهذه الآية من المُغيبات التي وافقها الواقع\n إذ كان كذلك في بني قريظة والنضير وبني قينقاع وخيبر\n فلم تُرْفع لهم راية أبداً\n بل { ضُربت عليهم الذلة } والخزي والهوان\n أي: أحاطت بهم إحاطة البيت المضروب على أهله\n أو لزمتهم لزوم الدرهم المضروب لضربه\n فلا تنفك عنهم { أيم ما ثقفوا } ووُجدوا\n فلا يأمنون { إلا بحبل من الله } أي: بسبب عهد من الله\n وهو عقد الذمة التي أمر الله بها\n إذا أدوا الجزية للمسلمين\n فلهم حرمة بسبب هذا العقد\n فلا يجوز التعرض لهم في مال ولا دم ولا أهل\n { وحبل من الناس } \n وهو عقد الذمة التي يعقدها مع الكفار إذا كانوا تحت ذمتهم\n والحاصل أن الذلة لازمة لهم فلا يأمنون إلا تحت الذمة\n إما من المسلمين وإما من الكفار\n { وباءوا بغضب من الله } أي: انقلبوا به مستحقين له\n { وضربت عليهم المسكنة } أي: أحاطت بهم\n فاليهود في الغالب فقراء مساكين\n لأن قلوبهم خاوية من اليقين\n فالفقر والجزع لازم لهم\n ولو ملكوا الدنيا بأجمعها\n { ذلك } الذل والمسكنة والبواء بالغضب بسبب أنهم { كانوا يكفرون بآيات الله } المنزلة على رسوله\n أو الدالة على توحيده\n { ويقتلون الأنبياء بغير حق } بل ظلماً وعدواناً\n ذلك الكفر بسبب عصاينهم واعتدائهم حدود الله\n فإن الإصرار على الصغائر يُفضي إلى الكبائر\n والإصرار عل الكبائر يؤدي إلى الكفر لأن المعاصي بريد الكفر\n والعياذ بالله\n الإشارة: ولو آمن أهل الظاهر بطريق الخصوص\n وحطو رؤوسهم لأهل الخصوصية لكان خيراً لهم\n للتسع عليهم دائرة العلوم\n وتفتح لهم مخازن الفهوم\n منهم من يقر بوجود الخصوصية\n ويعجز عن حمل شروطها\n وأكثرهم ينكرونها ويحتجون لأنفسهم بقول من قال: انقطعت التربية في القرن الثامن\n فيموتون مصرين على الإنكار والعصيان\n فلن يضركم إنكارهم أيها الفقراء\n فإنهم لا قدرة لهم عليكم\n للرعاية التي أحاطت بكم\n إلا أذى بلسانهم\n وعلى تقدير لحوق ضررهم في الظاهر\n فإن الله يُغيِّبْ ألمّ ذلك عنكم في الباطن\n كما شاهدناه من بعض الفقراء\n وإن يُهددوكم بالقتل والجلاء\n فإن الله لا يَنْصُرُهم في الغالب\n قلت: وقد هددونا بالضرب والرفع إلى السلطان والجلاء إلى برِّ النصارى\n فلم يقدروا على شيء من ذلك\n وقد وقع ذلك لبعض الصوفية زيادةً في شرفهم وعزّهم\n فالمنكر على الصوفية لا يزال في هَمٍّ وغمٍّ وذُلٍّ ومسكنة\n لخراب باطنه من نور اليقين\n فإنَّ الانتقاد على الأولياء جناية واعتقادهم عناية\n فإن استمر على أذاهم كان عاقبته سوء الخاتمة\n فيبوء بغضب من الله سبب اعتدائه على أولياء الله\n\n \" ومن آذى لي وليّاً فقد أذتني بالحرب \" \nرزقنا الله الأدب معهم\n وأماتنا على محبتهم\n آمين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:61",
      "similarity": 0.4981219099858549
    },
    {
      "verse": "2:191",
      "similarity": 0.37420970644366275
    },
    {
      "verse": "60:2",
      "similarity": 0.370406919997428
    },
    {
      "verse": "26:44",
      "similarity": 0.3442972423748276
    },
    {
      "verse": "20:66",
      "similarity": 0.3083907938603294
    }
  ]
}