{
  "chapter": "آل عمران",
  "text": "لن يضروكم الا اذى وان يقتلوكم يولوكم الادبار ثم لا ينصرون",
  "translations": [
    {
      "translation": "They will not harm you except with abusive words. If they fight you, they will turn their backs on you. Then they will not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will do you no harm but annoyance; and if they fight you they will only turn their backs, then no help will reach them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not be able to harm you except for a little hurt, and if they fight against you they will turn their backs (in flight), and then they will not be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They can never harm you beyond annoyance. In a fight, they will turn back in defeat and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They cannot harm you except cause some trouble; and if they fight against you, they will turn their backs on you; then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will do you no harm, barring a trifling annoyance; and if they fight against you, they will show you their backs, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall by no means harm you but with a slight evil; and if they fight with you they shall turn (their) backs to you, then shall they not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not harm you, except a little hurt; and if they fight with you, they will turn on you their backs; then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not harm you save a trifling hurt, and if they fight against you they will turn and flee. And afterward they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They can do you very little harm; if they come out to fight you, they will show you their backs; then they shall not be helped --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall not be able to harm you save with small hurt, and if they fight you, they shall turn upon you their backs; then they shall be succoured not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will never do you any harm, except for some hurt; and if they fight you, they will turn their backs [to flee], then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will do you no harm, barring a trifling annoyance; if they come out to fight you, they will show you their backs, and no help shall they get.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will do you no harm, barring a trifling annoyance; and if they fight against you, they will show you their backs, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not harm you except a little hurt. And if they fight against you, they will turn their backs. Then they will not be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will do you no harm, beyond insulting you. And if they fight you, they will turn around and flee, then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not harm you except for [some] annoyance. And if they fight you, they will show you their backs; then they will not be aided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:111] They, the Jews, will not harm you, O company of Muslims, in any way, except a little hurt, with their tongues, such as slander and threats; and if they fight against you, they will turn their backs to you, in retreat, then they will not be helped, against you, but you will be helped against them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They will not harm you) the Jews will not harm you (save a trifling hurt) with their tongue by vilifying and defaming you, (and if they fight against you) in Religion (they will turn and flee) defeated. (And afterward they will not be helped) they will not be saved from your swords or from being taken as captives.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لن يضرّوكم إلا أذى } لكونهم منقطعين عن أصل القوى والقدر\n كائنين في الأشياء بالنفس التي هي محل العجز والشرّ\n وأنتم معتصمون بالله\n معتضدون به\n كائنون في الأشياء بالحق الذي هو منبع القهر\n فقدرتهم لا تبلغ إلا حدّ الطعن باللسان والخبث والإيذاء الذي هو حدّ قدرة النفس ونهايتها\n وقدرتكم تفوق كلّ قدرة بالقهر والاستئصال لاتصافكم بصفات الله تعالى\n فلا جرم ينهزمون منكم عند المقاتلة ولا ينصرون",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { لَن يَضُرُّوكُمْ } ضراراً فاحشاً { إِلاَّ أَذًى } صدرت من سقطات ألسنتهم من التقريع والتشنيع { وَإِن } بالغوا في العداوة إلى أن { يُقَاتِلُوكُمْ يُوَلُّوكُمُ ٱلأَدْبَارَ } اضطراراً والزاماً { ثُمَّ لاَ يُنصَرُونَ } [آل عمران: 111] بالكبر عليكم بعد الفر منكم\n بل ينصركم الله عليهم بنصره العزيز\n ويخذلهم ويذلهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:12",
      "similarity": 0.5182134037546986
    },
    {
      "verse": "48:22",
      "similarity": 0.5131472048702264
    },
    {
      "verse": "4:16",
      "similarity": 0.4383233641176776
    },
    {
      "verse": "14:12",
      "similarity": 0.4342555202310319
    },
    {
      "verse": "9:61",
      "similarity": 0.4255128364225402
    }
  ]
}