{
  "chapter": "آل عمران",
  "text": "وما يفعلوا۟ من خير فلن يكفروه والله عليمۢ بالمتقين",
  "translations": [
    {
      "translation": "You will not be denied the reward for any good thing you do. Allah knows those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the good they do will not go unaccepted; for God is aware of those who keep away from evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever good they do shall not go unappreciated, and Allah fully knows those who are pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will never be denied the rewards of their good deeds. God knows well about the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will not be denied the reward of whatever good they do; and Allah knows the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever good they do, nothing will be rejected of them; for Allah knows well the Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever good they do, they shall not be denied it, and Allah knows those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever good you do, you shall not be denied the just reward of it; and God knows the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever good they do, they will not be denied the meed thereof. Allah is Aware of those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they will not be denied [the reward] for whatever good deeds they do: God knows the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever they do of virtue shall not be denied. And Allah is Knower of the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever good they do, they will not go unappreciated for it, and Allah knows well the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the good that they do, nothing will be rejected of them; for Allah knoweth well those that do right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever good they do, nothing will be rejected of them; for Allah knows well those who are Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever good they do, for them it shall not be denied. Allah knows the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever good they do, they will not be denied it. God knows the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever good they do - never will it be removed from them. And Allah is Knowing of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:115] And whatever good you do, O community, (taf‘alū, ‘you do’, or if this is read yaf‘alū, ‘they do’, then [it is referring to them] ‘the upright community’), you shall not be denied it ([read] in both ways [fa-lan tukfarūhu, ‘you shall not be denied it’, or fa-lan yukfarūhu, ‘they shall not be denied it’]), you shall not be deprived of its reward, but you will be rewarded for it, and God knows the God-fearing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whatever good) that was mentioned above; and it is also said: whatever act of excellence they perform towards Muhammad and his Companions (they do) i.e. 'Abdullah Ibn Salam and his followers, (they will not be denied the meed thereof) its reward will not be forgotten and they shall indeed be rewarded for it. (Allah is Aware of those who ward off (evil)) ward off disbelief, idolatry and indecency-the reference here being to 'Abdullah Ibn Salam and his followers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا يَفْعَلُواْ } هؤلاء الموصوفون منهم { مِنْ خَيْرٍ } طالبين فيه رضاء الله، راجين ثوابه حقاً خائفين من عقابه { فَلَنْ يُكْفَروهُ } أي: لن ينقصوا من أجره، بل يزادوا ويضاعفوا { وَٱللَّهُ } الهادي لجميع العباد { عَلِيمٌ بِٱلْمُتَّقِينَ } [آل عمران: 115] منهم، فيجازيهم على مقتضى علمه، وحسب لطفه وكرمه\n\n\n\n\nأدركنا بلطفك وكرمك يا أكرم الأكرمين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { آناء الليل }: ظرف: واحده: { إِنْيٌ } ، بكسر الهمة وسكون النون، كنحى وأنحاء، أو { إني } ، كمِعىً وأمعاء، و { لن تكفروه } أي: لن تحرموه، وعدي { كفر } إلى مفعولين لتضمنه معنى حرم أو منع\n يقول الحقّ جلّ جلاله: ليس أهل الكتاب { سواء } في الكفر والعدوان، بل منهم { أمة } أي: طائفة { قائمة } بالعدل مستقيمة في الدين، أو قائمة بأمر الله، أو قائمة في الصلاة { يتلون آيات الله } في تهجدهم { آناء الليل } أي: في ساعاته، { وهم يسجدون } في صلاتهم، أو في صلاة العشاء، لأن أهل الكتاب لا يصلونها، لِمَا رُوِيَ أنه صلى الله عليه وسلم أخَّرها، ثم خَرَج، فإذا الناسُ يَنْتَظُرونَها، فقال:\n\n \" أبشروا فَإِنَّه لَيْسَ مِنْ أَهْل الأَرض أحدٌ يُصَلِّي في هَذِهِ السّاعَةِ غَيْرُكُم \"\n \n",
      "translations": []
    }
  ]
}