{
  "chapter": "آل عمران",
  "text": "ليسوا۟ سواء من اهل الكتب امة قائمة يتلون ءايت الله ءاناء اليل وهم يسجدون",
  "translations": [
    {
      "translation": "They are not all the same. There is a community among the People of the Book who are upright. They recite Allah's Signs throughout the night, and they prostrate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet all of them are not alike. Among the people of the Book is a section upright, who recite the scriptures in the hours of the night and bow in adoration and pray,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet all are not alike: among the People of the Book there are upright people who recite the messages of Allah in the watches of the night and prostrate themselves in worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book are not all the same. Some of them are straightforward. They recite the words of God in prostration at night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All of them are not alike; among the People given the Book(s) are some who are firm on the truth – they recite the verses of Allah in the night hours and prostrate (before Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not all of them are alike; a party of the People of the Scripture stand for the right, they recite the verses of Allah during the hours of the night, prostrating themselves in prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are not all alike; of the followers of the Book there is an upright party; they recite Allah's communications in the nighttime and they adore (Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they are not all alike; some of the People of the Book are a nation upstanding, that recite God's signs in the watches of the night, bowing themselves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are not all alike. Of the People of the Scripture there is a staunch community who recite the revelations of Allah in the night season, falling prostrate (before Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they are not all alike. Of the People of the Book there are some who stand by their covenant; they recite the word of God during the night and prostrate themselves before Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not are they all alike. Of the people of the Book there are a community steadfast, reciting the revelations of Allah in the hours of night while they prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they are not all alike. Among the People of the Book is an upright nation; they recite Allah’s signs in the watches of the night and prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not all of them are alike: Of the People of the Book are a portion that stand (For the right): They rehearse the Signs of Allah all night long, and they prostrate themselves in adoration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not all of them are alike; a party of the people of the Scripture stand for the right, they recite the Verses of Allah during the hours of the night, prostrating themselves in prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they are not all alike. There are among the People of the Book an upstanding nation that recite the verses of Allah (the Koran) throughout the night and prostrate themselves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are not alike. Among the People of the Scripture is a community that is upright; they recite God’s revelations throughout the night, and they prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are not [all] the same; among the People of the Scripture is a community standing [in obedience], reciting the verses of Allah during periods of the night and prostrating [in prayer].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:113] Yet they, the People of the Scripture, are not all alike, equal; some of the People of the Scripture are a community upright, with integrity, adhering to the truth, such as ‘Abd Allāh b. Salām, may God be pleased with him and his companions, who recite God’s verses in the watches of the night, that is, during its hours, prostrating themselves, performing prayer (wa-hum yasjudūn, ‘prostrating themselves’, is a circumstantial qualifier).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف قصد به إنصاف طائفة من أهل الكتاب ، بعد الحكم على معظمهم بصيغة تعمّهم ، تأكيداً لِما أفاده قولُه { منهم المؤمنون وأكثرُهم الفاسقون } \\[ آل عمران : 110 \\] فالضمير في قوله { ليسوا } لأهل الكتاب المتحدّث عنهم آنفاً ، وهم اليهود ، وهذه الجملة تتنزّل من التي بعدها منزلة التمهيد .و ( سواء ) اسم بمعنى المماثل وأصله مصدر مشتق من التسوية .وجملة { من أهل الكتاب أمصة قائمة الخ . . . مبيّنة لإبهام ليسوا سواء } والإظهار في مقام الإضمار للاهتمام بهؤلاء الأمة ، فلأمّة هنا بمعنى الفريق .وإطلاق أهل الكتاب عليهم مجاز باعتبار ما كان كقوله تعالى : { وآتوا اليتامى أموالهم } \\[ النساء : 2 \\] لأنهم صاروا من المسلمين .وعدل عن أن يقال : منهم أمَّة قائمة إلى قوله من أهل الكتاب : ليكون ذا الثناء شاملاً لصالحي اليهود ، وصالحي النَّصارى ، فلا يختصّ بصالحي اليهود ، فإن صالحي اليهود قبل بعثة عيسى كانوا متمسّكين بدينهم ، مستقيمين عليه ، ومنهم الَّذين آمنوا بعيسى واتّبعوه ، وكذلك صالحو النَّصارى قبل بعثة محمّد صلى الله عليه وسلم كانوا مستقيمين على شريعة عيسى وكثير منهم أهل تهجَّد في الأديرة والصّوامع وقد صاروا مسلمين بعد البعثة المحمدية .والأمَّة : الطائفة والجماعة .ومعنى قائمة أنه تمثيل للعمل بدينها على الوجه الحقّ ، كما يقال : سوق قائمة وشريعة قائمة .والآناء أصله أأنْاء بهمزتين بوزن أفعال ، وهو جمع إنى بكسر الهمزة وفتح النُّون مقصوراً ويقال أنى بفتح الهمزة قال تعالى : { غير ناظرين إنَاه } \\[ الأحزاب : 53 \\] أي منتظرين وقته .وجملة { وهم يسجدون } حال ، أيّ يتهجّدون في الليَّل بتلاوة كتابهم ، فقيّدت تلاوتهم الكتاب بحالة سجودهم . وهذا الأسلوب أبلغ وأبين من أن يقال : يتهجّدون لأنّه يدلّ على صورة فعلهم .\n\n",
      "translations": [
        {
          "translation": "(They are not all alike) i.e. those who believed from among the people of the Book are not like those among them who have not. (Of the People of the Scripture there is a staunch community) He says: there are among them a group of upright people who are guided by Allah's divine Oneness: 'Abdullah Ibn Salam and his followers (who recite the revelations of Allah) the Qur'an (in the night season) in the hours of the night in their prayer, (falling prostrate (before Him)) praying to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { آنَآءَ ٱللَّيْلِ } معناهُ سَاعاتُهُ\n واحدُها إِنيٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"At night\" - it means its hours.\n\n\nOne of them is surely me.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ليسوا سواء من أهل الكتاب أمّة قائِمة } أي: بالله\n ثم وصفهم بأحوال أهل الاستقامة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَيْسُواْ } أي: ليس جميع أهل الكتاب { سَوَآءً } مستوية الأقدام في الاعتدال والإنكار\n بل { مِّنْ أَهْلِ ٱلْكِتَابِ } أيضاً { أُمَّةٌ قَآئِمَةٌ } مستقيمة على صراط العدل { يَتْلُونَ آيَاتِ ٱللَّهِ } الدالة على توحديه { آنَآءَ ٱللَّيْلِ } أي: جميع آنائه { وَهُمْ يَسْجُدُونَ } [آل عمران: 113] يصلون خاضعين\n متذللين\n واضعين جباههم على تراب المذلة\n تعظيماً له\n وخوفاً من خشيته\n ورجاء من سعة رحمته\n\n\nوذلك لأنهم { يُؤْمِنُونَ بِٱللَّهِ } أي: بوحدانيته { وَٱلْيَوْمِ ٱلآخِرِ } بصدقه وحقيته { وَ } مع ذلك { يَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنْكَرِ وَيُسَارِعُونَ فِي ٱلْخَيْرَاتِ } المبرات المؤدية إلى إسقاط الإضافات وقطع التعليقات المستلزمة لرفع التعيينات الحاجبة عن شهود الذات { وَأُوْلَـٰئِكَ } المتصفون منهم بهذه الصفات { مِنَ ٱلصَّالِحِينَ } [آل عمران: 114] لسلوك طريق الحق\n المستحقين للوصول إلى سواء التوحيد الذي هو السواد الأعظم\n المشار إليه في الحديث النبوي\n صلوات الله على قائله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قائمة } أي: مستقيمة\n من أقمت العود فقام\n أو قائمة بأمر الله\n و { آناء الليل }: ظرف: واحده: { إِنْيٌ } \n بكسر الهمة وسكون النون\n كنحى وأنحاء\n أو { إني } \n كمِعىً وأمعاء\n و { لن تكفروه } أي: لن تحرموه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "88:5",
      "similarity": 0.6280526896881474
    },
    {
      "verse": "55:44",
      "similarity": 0.592953350035343
    },
    {
      "verse": "39:9",
      "similarity": 0.49934069921056917
    },
    {
      "verse": "20:130",
      "similarity": 0.4127457510684095
    },
    {
      "verse": "76:15",
      "similarity": 0.33016002518851834
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003113.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003113.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:113.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}