{
  "chapter": "آل عمران",
  "text": "ليس لك من الامر شىء او يتوب عليهم او يعذبهم فانهم ظلمون",
  "translations": [
    {
      "translation": "You have no part in the affair. Either He will turn towards them or He will punish them, for they are wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have no say in the matter if He pardon them or punish them, for they are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Messenger!) It is not for you to decide whether He will accept their repentance or chastise them, for they surely are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), it is not your concern whether He forgives them or punishes them for they are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This matter is not for you to decide – whether He guides them to repent or punishes them, for they are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not for you is the decision; whether He turns in mercy to (pardon) them or punishes them; verily, they are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have no concern in the affair whether He turns to them (mercifully) or chastises them, for surely they are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No part of the matter is thine, whether He turns towards them again, or chastises them; for they are evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no concern at all of thee (Muhammad) whether He relent toward them or punish them; for they are evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have no say in this affair to decide whether He will relent towards them or He will punish them: they are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not with thee is aught of the affair: He shall either relent toward them or torment them, for verily they are wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have no hand in the matter, whether He accepts their repentance or punishes them, for they are indeed wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not for thee, (but for Allah), is the decision: Whether He turn in mercy to them, or punish them; for they are indeed wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not for you (O Muhammad SAW, but for Allah) is the decision; whether He turns in mercy to (pardons) them or punishes them; verily, they are the Zalimun (polytheists, disobedients, and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No part of the matter is yours whether He turns towards them or punishes them. They are harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no concern of yours whether He redeems them or punishes them. They are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not for you, [O Muhammad, but for Allah], is the decision whether He should [cut them down] or forgive them or punish them, for indeed, they are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:128] When, on the Day of Uhud, the Prophet received a head wound and his front tooth was broken, and he said, ‘How does a people who have drenched the face of their Prophet in blood [expect to] prosper?’, the following was revealed: It is no concern at all of yours, nay, it is God’s concern, so be patient, whether, meaning, until such time as, He relents to them, through [their acceptance of] Islam, or chastises them; for they are indeed evildoers, by [virtue of their] disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is no concern at all of thee (Muhammad)) repentance and punishment are not in your hands whereby you pray against those who were defeated on the Day of Uhud, the archers and others (whether He relent towards them) He says: if Allah chooses to relent towards them and forgive them (or punish them) because of their leaving their positions; (for they are evil-doers) for leaving their positions. It is also said that this was revealed about two tribes, the 'Asabah and Dhakwan, against whom the Prophet (pbuh) prayed when they killed some of his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا كان الكل من عند الله العزيز الحكيم { لَيْسَ لَكَ } يا أكمل الرسل { مِنَ ٱلأَمْرِ شَيْءٌ } أي: شيء من أمورهم، بل الأمر كله لله، فله أن يفعل معهم ما شاء وأراد، إما أن يستأصلهم { أَوْ يَتُوبَ عَلَيْهِمْ } توبة تنجيهم من أنانيتهم { أَوْ يُعَذِّبَهُمْ } دائماً؛ جزاء لظلمهم وكفرهم { فَإِنَّهُمْ ظَالِمُونَ } [آل عمران: 128] مستقرون على الظلم ما داموا في الحياة الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم عطلف على قوله: { ليقطع طرفاً من الذين كفروا أو يكبتهم } قوله: { أو يتوب عليهم } إن أسلموا { أو يعذبهم } إن لم يسلموا، { فإنهم ظالمون } قد استحقوا العذاب بظلمهم، والأمور كلها بيد الله، { ولله ما في السماوات وما في الأرض } خلقاً وملكاً وعبيداً، { يغفر لمن يشاء } غفرانه، { ويعذب من يشاء } تعذيبه، ولا يجب عليه شيء، { والله غفور رحيم } لعباده، فلا تبادر بالدعاء عليهم\n الإشارة: وما جعل الله التأييد الذي ينزله على أهل التجريد، حين يقابلهم بالابتلاء والتشديد، إذا أراد أن يوصلهم لصفاء التوحيد، إلا بشارة لفتحهم، ولتطمئن بمعرفته قلوبهم، فإن الامتكان على قدر الامتحان، وكل محنة تزيد مكنة، وهذه سنة الله في أوليائه، يسلط عليهم الخلق في بدايتهم، ويشدد عليهم ابلاء، حتى إذا طهروا من البقايا، وكملت فيهم المزايا، كف عنهم الأذى، وانقلب الجلال جمالاً، وذلك اعتناء بهم، ونصراً لهم على أنفسهم، فإن النصر كله { من عند الله العزيز الحكيم }\n وذلك ليقطع عنهم طرفاً من الشواغل والعلائق، التي تقبضهم عن العروج إلى سماء الحقائق، فإن الروح إذا رقدت في ظل العز والجاه صعب خروجها من هذا العالم، فإذا ضيق عليها، وعكس مرادها، رحلت إلى عالم الملكوت، والأمر كله بيد الله\n ليس لك أيها الفقير من الأمر شيء، إنما أنت مأمور بتحريك الأسباب والله يفتح الباب\n\n",
      "translations": []
    }
  ]
}