{
  "chapter": "آل عمران",
  "text": "ليقطع طرفا من الذين كفروا۟ او يكبتهم فينقلبوا۟ خائبين",
  "translations": [
    {
      "translation": "and so that He might cut off a group of those who are kafir or crush them and they might be turned back in defeat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may cut off a part of unbelievers or overthrow them, and they turn back in frustration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah provided this aid to you in order to cut off a part of those who disbelieved and frustrate them so that they retreat in utter disappointment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are sent) to break the power of the unbelievers or disgrace them and make them return after having lost all hope.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He may cut off a part of the disbelievers, or disgrace them so that they return unsuccessful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cut off a part of those who disbelieve, or expose them to infamy, so that they retire frustrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may cut off a portion from among those who disbelieve, or abase them so that they should return disappointed of attaining what they desired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He might cut off a part of the unbelievers or frustrate them, so that they turned in their tracks, disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may cut off a part of those who disbelieve, or overwhelm them so that they retire, frustrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so that He might cut off a portion of those who are bent on denying the truth or abase them so that they might be turned back frustrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may cut: off a portion of those who disbelieve, or abase them so that they may go back disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may cut down a section of the faithless, or subdue them, so that they retreat disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cut off a fringe of the Unbelievers or expose them to infamy, and they should then be turned back, frustrated of their purpose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cut off a part of those who disbelieve, or expose them to infamy, so that they retire frustrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He might cut off a part of those who disbelieve or suppress them, so that they will turn back, disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He thus cuts off a section of those who disbelieved, or subdues them, so they retreat disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cut down a section of the disbelievers or suppress them so that they turn back disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:127] And that He might cut off (li-yaqta‘, is semantically connected to the clause containing nasarakum, ‘He gave you victory’), that is to say, that He might destroy, a party of the disbelievers, by slaying them or making them fall captive, or suppress them, humiliate them through defeat, so that they fall back, return, frustrated, not having secured what they desired.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That He may cut off a part) He says: if He sends His help, it is only in order to kill a group (of those who disbelieve) the unbelievers of Mecca, (or overwhelm them) defeat them (so that they retire, frustrated) not having gained the upper hand or booty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيَقْطَعَ طَرَفاً } معناهُ لِيَهْلَكَ { أَوْ يَكْبِتَهُمْ } أَي يَصْرَعُهُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما جعله وبشر به { لِيَقْطَعَ } وليستأصل { طَرَفاً } جملة وجماعة { مِّنَ ٱلَّذِينَ كَفَرُوۤاْ } أعرضوا عن طريق التوحيد، فينهزم الباقون { أَوْ يَكْبِتَهُمْ } أي: يخزيهم ويرديهم { فَيَنقَلِبُواْ } جميعاً { خَآئِبِينَ } [آل عمران: 127] خاسرين، نادمين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ليس لك من الأمر شيء }: جملة معترضة بين قوله: { أو يكبتهم } وقوله: { أو يتوب عليهم } ، أو تكون { أو } بمعنى { إلا } ، أي: ليس لك من الأمر شيء، إلا أن يتوب عليهم فتبشرهم، أو يعذبهم فتشفى فيهم\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: وما جعل الله ذلك الإمداد إلا بشارة لكم بالنصر، { ولتطمئن قلوبكم به } فتثبتوا للقتال، { وما النصر إلا من عند الله } فهو قادر على أن ينصركم بلا واسطة، لكن أراد أن يثيبكم وينسب المزية إليكم، حيث قتلهم على أيديكم، فإن الله عزيز لا يغلب، حكيم فيما دبر وأبرم، وإنما نصركم يوم بدر { ليقطع طرفاً من الذين كفروا } بقتل بعض وأسر آخرين، فإنه قتل يومئذ سبعون، وأسر سبعون، { أو يكبتهم } أي: يحزنهم ويغيظهم، والكبت: شدة الغيظ، { فينقلبوا خائبين } مما أملوا\n ولما جُرِحَ - عليه الصلاة والسلام - في وجهه، وشُجَّ على قرن حاجبه، وكُسِرَت رباعيته، هَمَّ بالدعاء على الكفار، بل دعا عليهم، فأنزل الله: { ليس لك من الأمر شيء } إنما أنت رسول إليهم، مأمور بإنذارهم وجهادهم، وأمرهم بيد مالكم، إن شاء هداهم وإن شاء عذّبهم\n وإنما نهاه عن الدعاء عليهم لعلمه بأن منهم من يُسلم ويجاهد في سبيل الله، وقد كان كذلك فجُلَّهم أسلموا وجاهدوا، منهم خالد بن الوليد - سيف الله في أرضه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:5",
      "similarity": 0.6941926773799447
    },
    {
      "verse": "14:15",
      "similarity": 0.3411136657134198
    },
    {
      "verse": "20:61",
      "similarity": 0.29792334416981425
    },
    {
      "verse": "91:10",
      "similarity": 0.1967329789586429
    },
    {
      "verse": "20:111",
      "similarity": 0.19274586681452924
    }
  ]
}