{
  "chapter": "آل عمران",
  "text": "بلى ان تصبروا۟ وتتقوا۟ وياتوكم من فورهم هذا يمددكم ربكم بخمسة ءالف من الملئكة مسومين",
  "translations": [
    {
      "translation": "Indeed if you are patient and take heed for yourselves, and the (enemy) come rushing at you suddenly your Lord will send even five thousand angels on chargers sweeping down.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are steadfast and mindful of God, even though the enemy should suddenly fall upon you, your Lord will help you even with five thousand marked angels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, if you have patience and piety, even if the enemy attacks immediately after this, God will help you with another force of five thousand angels, all splendidly (and or distinctly marked) dressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, why not? If you patiently endure and remain pious, and the disbelievers attack you suddenly, your Lord will send down five thousand marked angels to help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, if you hold on to patience and have Taqwa, and the enemy comes rushing at you; your Lord will help you with five thousand angels having marks (of distinction).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea! if you remain patient and are on your guard, and they come upon you in a headlong manner, your Lord will assist you with five thousand of the havoc-making angels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea; if you are patient and godfearing, and the foe come against you instantly, your Lord will reinforce you with five thousand swooping angels.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but if ye persevere, and keep from evil, and (the enemy) attack you suddenly, your Lord will help you with five thousand angels sweeping on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you remain patient and God-fearing, and the enemy should fall upon you all of a sudden, Your Lord will reinforce you with five thousand angels clearly marked!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Yea! if ye but remain persevering and God-fearing, and they should come upon you in this rush of theirs, your Lord shall reinforce you with five thousand angels marked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, if you are steadfast and Godwary, and should they come at you suddenly, your Lord will aid you with five thousand angels sent in [to the scene of battle].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea, - if ye remain firm, and act aright, even if the enemy should rush here on you in hot haste, your Lord would help you with five thousand angels Making a terrific onslaught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, if you hold on to patience and piety, and the enemy comes rushing at you; your Lord will help you with five thousand angels having marks (of distinction).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, if you have patience and are cautious, and they suddenly come against you, your Lord will reinforce you with five thousand marked angels'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is; but if you persevere and remain cautious, and they attack you suddenly, your Lord will reinforce you with five thousand angels, well trained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, if you remain patient and conscious of Allah and the enemy come upon you [attacking] in rage, your Lord will reinforce you with five thousand angels having marks [of distinction]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:125] Yea, it is sufficient for you. In [sūrat] al-Anfāl [it is stated] with a thousand [Q. 8:9], because at first He reinforced them with this [thousand], then it became three [thousand] then five [thousand], as God says: if you are patient, in encountering the enemy, and fear, God in not contravening [His command], and they, the idolaters, come against you instantly, your Lord will reinforce you with five thousand angels accoutred’ (read musawimmīn or musawammīn), that is to say, distinctively marked [for the battle]. Indeed, they were patient and God fulfilled His promise to them, so that the angels fought together with them riding upon piebald horses wearing yellow or white turbans, let loose down to their shoulders.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay) it is sufficient to you, (but if you persevere) in war with your Prophet, (and keep from evil) and keep from contravening and disobeying Him, (and) the people of Mecca (attack you suddenly) from the direction of Mecca, (your Lord will help you) against your enemy (with five thousand angels sweeping on) 5,000 marked angels; it is also said this means: 5,000 angels wearing turbans of wool.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّن فَوْرِهِمْ } معناهُ مِنْ غَضَبِهِمْ هَذا\n\n\n\n\nوقوله تعالى: { بِخَمْسَةِ ءَالَٰفٍ مِّنَ ٱلْمَلاۤئِكَةِ مُسَوِّمِينَ } معناهُ مُعْلَمينَ بالصُّوفِ في نَواصِي الخَيلِ وأَذنابِها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أوحى إ ليك بأن قلت: { بَلَىۤ } يكفيكم هذا القدر، أن تستغيثوا وتستلجئوا إلى الله؛ رغباً وترهيباً من العدو، ولكن { إِن تَصْبِرُواْ } في مقابلتهم ومقاتلتهم { وَتَتَّقُواْ } عن الاستدبار والانهزام، وتصيروا فرَّارين، كرارين مراراً، طالبين رضا الله وإمضاء حكمه، وإنفاذ قضائه، يزيد عليكم { وَيَأْتُوكُمْ مِّن فَوْرِهِمْ هَـٰذَا } أي: ساعتهم الحاضرة التي هي هذه { يُمْدِدْكُمْ رَبُّكُمْ } أجراً؛ لصبركم وتقواكم { بِخَمْسَةِ ءَالَٰفٍ مِّنَ ٱلْمَلاۤئِكَةِ مُسَوِّمِينَ } [آل عمران: 125] معلمين، معلومين، ممتازين عن البشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحقّ جلّ جلاله: ولقد نصركم الله ببدر حين كنت { تقول للمؤمنين } حين رأوا كثرة عدوهم وقلة عدتهم وعددهم: { ألن يكفيكم } في القوة والكثرة، { أن يمدكم ربكم بثلاثة آلاف من الملائكة مُنزلين } في السحاب؟ { بلى } يكفيكم كما وعدكم، { إن تصبروا } وتثبتوا { وتتقوا } الله { ويأتوكم من فورهم } أي: من سرعتهم { هذا } الوقت، { يمددكم ربكم بخمسة آلاف من الملائكة } بلا تراخ ولا تأخير، { مسومين } أي: مُعَلَّمين بعمائم بيض إلا جبريل، فإنه كان عمامته صفراء\n أو معلمين أنفسَهم أو خيلَهم\n قيل: كانت مجزوزة الأذناب، وقيل: كانت بُلْقاً\n فإن قلت: ما ذكر في الأنفال إلا ألفاً، هنا خمسة آلاف\n فالجواب: أن الله تعالى أمدهم أولاً بألف، ثم صاروا ثلاثة آلاف، ثم صاروا خمسة آلاف\n قال ابن عباس: لم تقاتل الملائكة إلا يوم بدر، وفيما سوى ذلك يشهدون القتال معنا، ولا يقاتلون\n هـ\n الإشارة: كل من توجَّه لجهاد نفسه في الله، واشتغل بذكر مولاه، أمده الله في الباطن بالأنوار والأسرار، وفي الظاهر بالملائكة الأبرار، وقد شوهد ذلك في الفقراء أصحابنا، إذا كانوا ثلاثة رآهم العامة ثلاثين، وإذاكانوا ثلاثين رأوهم ثلاثمائة، وقد كنا في سَفْره سبعين، فرأونا سبعمائة على ما أخبرونا به،\n",
      "translations": []
    }
  ]
}