{
  "chapter": "آل عمران",
  "text": "ان تمسسكم حسنة تسؤهم وان تصبكم سيئة يفرحوا۟ بها وان تصبروا۟ وتتقوا۟ لا يضركم كيدهم شيـا ان الله بما يعملون محيط",
  "translations": [
    {
      "translation": "If something good happens to you, it galls them. If something bad strikes you, they rejoice at it. But if you are steadfast and have taqwa, their scheming will not harm you in any way. Allah encompasses what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good comes your way, they are vexed; but if evil befalls you they are pleased and rejoice; yet if you are patient and guard yourselves against evil, their cunning will not harm you in the least, for whatsoever they do is well within the reach of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anything good happens to you they are grieved; if any misfortune befalls you they rejoice at it. But if you remain steadfast and mindful of Allah their designs will not cause you harm. Allah surely encompasses all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hate to see your success and rejoice if any misfortune befalls you. If you will be patient and pious, their plots can cause no harm to you. God has control over all their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If some good reaches you, they feel unhappy; and if misfortune befalls you, they will rejoice; and if you remain steadfast and pious, their evil scheme will not harm you in the least; undoubtedly all what they do is encompassed by Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a good befalls you, it grieves them, but if some evil overtakes you, they rejoice at it. But if you remain patient and have Taqwa, not the least harm will their cunning do to you. Surely, Allah surrounds all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you, it grieves them, and if an evil afflicts you, they rejoice at it; and if you are patient and guard yourselves, their scheme will not injure you in any way; surely Allah comprehends what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are visited by good fortune, it vexes them; but if you are smitten by evil, they rejoice at it. Yet if you are patient and godfearing, their guile will hurt you nothing; God encompasses the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a lucky chance befall you, it is evil unto them, and if disaster strike you they rejoice thereat. But if ye persevere and keep from evil their guile will never harm you. Lo! Allah is Surrounding what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever something good happens to you, it grieves them; but when evil befalls you, they rejoice. If you persevere and fear God, their designs will never harm you in the least: God encompasses all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there happenoth unto you any good it grieveth them, and if there happenoth unto you an ill, they rejoice thereat. And if ye remain persevering and God-fearing their guile shall not harm you at all. Verily Allah is of that which they work Encompasser.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If some good should befall you, it upsets them, but if some ill befalls you, they rejoice at it. Yet if you are patient and Godwary, their guile will not harm you in any way. Indeed Allah encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If aught that is good befalls you, it grieves them; but if some misfortune overtakes you, they rejoice at it. But if ye are constant and do right, not the least harm will their cunning do to you; for Allah Compasseth round about all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a good befalls you, it grieves them, but if some evil overtakes you, they rejoice at it. But if you remain patient and become Al-Muttaqun (the pious - see V. 2:2), not the least harm will their cunning do to you. Surely, Allah surrounds all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are touched with good fortune, they grieve, but when evil befalls you, they rejoice. If you are patient and cautious, their guile will never harm you. Allah encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If something good happens to you, it upsets them; but if something bad befalls you, they rejoice at it. But if you persevere and maintain righteousness, their schemes will not harm you at all. God comprehends what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good touches you, it distresses them; but if harm strikes you, they rejoice at it. And if you are patient and fear Allah, their plot will not harm you at all. Indeed, Allah is encompassing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:120] If good fortune, a favour such as victory or booty, befalls you, it is evil for them, it grieves them; but if evil, such as defeat or drought, befalls you, they rejoice thereat (the conditional statement here is semantically connected to the previous conditional, and what comes in between is a parenthetical [statement], the meaning being that their enmity towards you is endless, so why do you befriend them? Avoid them!) Yet if you endure, their harm, and fear, God by [not] befriending them and so on, their guile will not hurt you (read either lā yadirkum or lā yadurrukum) at all; God encompasses what they do (ya‘malūn, or may be read ta‘malūn, ‘what you do’), He has knowledge of it and will requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nزاد الله كشفا لِما في صدورهم بقوله : { إن تمسسكم حسنة نسؤهم } أي تصبكم حسنة والمسّ الإصابة ، ولا يختصّ أحدهما بالخير والآخر بالشرّ ، فالتَّعبير بأحدهما في جانب الحسنة ، وبالآخر في جانب السيِّئة ، تفنّن ، وتقدّم عند قوله تعالى : { كالذي يتخبطه الشيطان } من المس في سورة البقرة ( 275 ) .والحسنة والسيِّئة هنا الحادثة أو الحالة الَّتي تحسن عند صاحبها أو تسوء وليس المراد بهما هنا الاصطلاح الشَّرعي .{ وَإِن تَصْبِرُواْ وَتَتَّقُواْ لاَ يَضُرُّكُمْ كَيْدُهُمْ شَيْئاً إِنَّ الله بِمَا يَعْمَلُونَ مُحِيطٌ } .أرشد الله المؤمنين إلى كيفية تلقّي أذى العدوّ : بأن يتلقّوه بالصّبر والحذر ، وعبّر عن الحذر بالاتّقاء أي اتّقاء كيدهم وخداعهم ، وقوله { لا يَضِركم كيدهم شيئاً } أي بذلك ينتفي الضرّ كلّه لأنّه أثبت في أوّل الآيات أنّهم لا يضرّون المؤمنين إلاّ أذى ، فالأذى ضرّ خفيف ، فلمَّا انتفى الضرّ الأعظم الَّذي يحتاج في دفعه إلى شديدِ مقاومة من القتال وحراسة وإنفاق ، كان انتفاء ما بَقي من الضرّ هيّناً ، وذلك بالصّبر على الأذى ، وقلّة الاكتراث به ، مع الحذر منهم أن يتوسّلوا بذلك الأذى إلى ما يوصل ضرّاً عظيماً . وفي الحديث : « لا أحد أصبر على أذى يسمعه من اللَّهِ يدعون له نِدّاً وهو يرزقهم » .وقرأ نافع ، وابن كثير ، وأبو عمرو ، ويعقوب : { لا يضركم } بكسر الضاد وسكون الراء من ضارُه يضيره بمعنى أضرّه . وقرأه ابن عامر ، وحمزة ، وعاصم ، والكسائي ، وأبو جعفر ، وخلف بضم الضاد وضم الراء مشدّدة مِن ضرّهُ يضُرّه ، والضمّة ضمّة إتباع لحركة العين عند الإدغام للتخلّص من التقاء الساكنين : سكون الجزم وسكوننِ الإدغام ، ويجوز في مثله من المضموم العين في المضارع ثلاثةُ وجوه في العربية : الضمّ لإتباع حركة العين ، والفتح لخفّته ، والكسر لأنَّه الأصل في التخلّص من التقاء الساكنين ، ولم يُقرأ إلاّ بالضمّ في المتواتر .\n\n",
      "translations": [
        {
          "translation": "(If a lucky chance) conquest and booty (befall you, it is evil unto them) the Jews and hypocrites do not like it, (and if disaster) drought, killing and defeat (strike you they rejoice thereat) they like it. (But if you persevere) in the face of their harm (and keep from evil) transgressing against Allah (their guile) their enmity and deeds (will never harm you. Lo! Allah is Surrounding) Allah knows (what they do) of contravention and enmity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإن تصْبِروا } على ما يبتليكم الله به من الشدائد والمحن والمصائب\n وتثبتوا على مقتضى التوحيد والطاعة { وتتقوا } الاستعانة بهم في أموركم والالتجاء إلى ولايتهم { لا يضرّكم كيدهم شيئاً } لأن المتوكل على الله\n الصابر على بلائه\n المستعين به لا بغيره\n ظافر في طلبته\n غالب على خصمه\n محفوظ بحسن كلاءة ربه\n والمستعين بغيره مخذول موكول إلى نفسه\n محروم عن نصرة ربه\n كما قال الشاعر:\n{ إن الله بما يعملون } من المكايد { محيط } فيبطلها ويهلكها\n وقد قيل: إذا أردت أن تكبت من يحسدك فازدد فضلاً في نفسك\n فالصبر والتقوى من أجمل الفضائل إن لزمتموهما تظفروا على عدوّكم\n { بلى إن تصبروا وتتقوا ويأتوكم } الآية\n\n\n الصبر على مضض الجهاد وبذل النفس في طاعة الله\n وتحمل المكروه طلباً لرضا الله لا يكون إلا عند التقوى بتأييد الحق وتنوّره بنور اليقين\n وثباته بنزول السكينة والطمأنينة عليه\n والتقوى في مخالفة أمر الحق والميل إلى النفع والغنيمة\n وخوف تلف النفس لا تكون إلا عند انكسار النفس تحت قهر سلطان القلب والروح\n إذ الثبات والوقار صفة الروح والطيش\n والاضطراب صفة النفس\n فإذا استولى سلطان الروح على القلب وأخذ مملكته عصمه من استيلاء صفات النفس وجنودها عليه\n فيعشقه القلب ويسكن إليه لنورانيته المحبوبة لذاتها ويتقوّى به على النفس وقواها فيهزمها ويكسرها ويدفع غلبتها وظلمتها عن نفسه\n ويجعلها ذلولاً مطيعة مطمئنة إليه فيزول عنها الاضطراب وتتنوّر بنوره وعند ذلك تنزل الرحمة\n ويناسب القلب ملكوت السماء في نورانيتها وقهرها لما تحتها\n ومحبتها وشوقها لما فوقها\n وبذلك التناسب يصل بها ويستنزل قواها وأوصافها في أفعاله خصوصاً عند اهتياجه وانقلاعه عن الجهة السفلية\n وانقطاعه بقوة اليقين والتوكل إلى الجهة العلوية\n ويستمد من قوى قهرها على من يغضب عليه فذلك نزول الملائكة\n وإذا جزع وهلع وتغير وخاف أو مال إلى الدنيا غلبته النفس وقهرته واستولت عليه وحجبته بظلمة صفاتها عن النور\n فلم تبق تلك المناسبة\n فانقطع المدد ولم تنزل الملائكة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن غاية حسدهم ونهاية بغضهم { إِن تَمْسَسْكُمْ } وتحيط بكم { حَسَنَةٌ } مسرة مفرحة لنفسوكم { تَسُؤْهُمْ } وتشق عليه من كمال عداوتم ونفاقهم { وَإِن تُصِبْكُمْ سَيِّئَةٌ } مملة مؤلمة { يَفْرَحُواْ بِهَا } تشفياً وتفرجاً\n شامتين بها\n سارين عليها { وَإِن تَصْبِرُواْ } على غيظهم وأذاهم { وَتَتَّقُواْ } وترجعوا إلى الله مفوضين أموركم إليه يحفظكم عن جميع ما يؤذيكم\n بحيث { لاَ يَضُرُّكُمْ كَيْدُهُمْ } مكرهم وحيلتهم { شَيْئاً } من الضرر { إِنَّ ٱللَّهَ } المطلع لسرائرهم وضمائرهم { بِمَا يَعْمَلُونَ } من الحيل والمخايل { مُحِيطٌ } [آل عمران: 120] لا يشذ عن علمه شيء ولو خطرة وطرفة\n\n\nوعلى قراءة \" تعملون \" بالخطاب\n كان المعنى { إِنَّ ٱللَّهَ } الموفّق لكم على دين الإسلام { بِمَا يَعْمَلُونَ } من الصبر والتقوى\n والتفويض والرضوخ إلى المولى { مُحِيطٌ } حاضر\n غير مغيَّب عنكم وعن علمكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإن تصبكم سيئة } كهزيمة أو قتل أو إصابة عدو منكم او اختلاف بينكم\n { يفرحوا بها وإن تصبروا } على عداوتهم وأذاهم\n وتخافوا ربكم\n { وتتقوا } ما نهاكم عنه\n { لا يضركم كيدهم شيئاً } \n بفضل الله وحفظه\n الموعود للصابرين والمتقين\n\n[البقرة: 153]\n\n[النحل: 128]\n ومن كان الحق معه لا يضره شيء\n { إن الله بما يعملون محيط } لا يخفى عليه ما يعمل أهل الكفر من العداوة والحقد\n فيجازيهم عليه\n الإشارة: لا ينبغي لأهل الخصوصية أن يتخذوا بطانة من دونهم من العامة حتى يطلعوهم على سرهم\n فإن الإطلاع على السر\n ولو كان غير الخصوصية\n كله ضعف في العقل ووهن في الرأي\n وفي ذلك يقول القائل:\nوأما سر الربوبية فإفشاؤه لغير أهله حرام\n والعامة مضادون لأهل الخصوصية\n لا يألونهم خبالاً في قلوبهم وتشتيتاً لفكرتهم\n إذا صحبوهم يودون أن لو كانوا مثلهم في العنت وتعب الأسباب\n فإذا ظهر بالفقراء نقص أو خلل ظهرت البغضاء من أفواههم\n وما تحفى صدورهم أكبر\n فإن كنتم أيها الفقراء تحبون لهم الخير فإنهم بعكس ذلك\n وإن كنتم تقرون شريعتهم فإنهم لا يؤمنون بحقيقتكم\n بل ينكرونها عليكم\n ومنهم من يتصف بالنفاق\n إذا لقي أهل الخصوصية أظهر التصديق والمحبة\n وإذا خلا مع العامة أظهر العداوة والحَنَق\n وإن تمسسكم أيها الفقراء حسنة\n كعز وفتح وشهود ومعرفة تَسؤْهم\n وإن تصبكم سيئة كمحنة أو بلية\n يفرحوا بها\n وإن تصبروا على أذاهم وجفوتهم\n وتتقوا شهود السوى فيهم\n لا يضركم كيدهم شيئاً { إن الله بما يعملون محيط }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:50",
      "similarity": 0.5166842619150088
    },
    {
      "verse": "42:48",
      "similarity": 0.3760169594426573
    },
    {
      "verse": "10:58",
      "similarity": 0.3471669531789367
    },
    {
      "verse": "18:68",
      "similarity": 0.33981848211465815
    },
    {
      "verse": "11:10",
      "similarity": 0.3382398178130069
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003120.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003120.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:120.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}