{
  "chapter": "آل عمران",
  "text": "واذ غدوت من اهلك تبوئ المؤمنين مقعد للقتال والله سميع عليم",
  "translations": [
    {
      "translation": "Remember when you left your family early in the day to instal the muminun in their battle stations.* Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you set forth in the morning from your house assigning the faithful positions for the battle, God heard everything and knew all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Messenger! Remind the Muslims of the occasion) when you went forth from your home at early dawn (to the battlefield of Uhud) and placed the believers in battle arrays. Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), remember the morning when you left home to show the believers their position in the battle? God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember O dear Prophet (Mohammed – peace and blessings be upon him) when you came forth from your house in the morning, appointing the believers on positions of battle; and Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you left your household in the morning to post the believers at their stations for the battle (of Uhud). And Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you did go forth early in the morning from your family to lodge the believers in encampments for war and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou wentest forth at dawn from thy people to lodge the believers in their pitches for the battle -- God is All-hearing, All-knowing --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou settedst forth at daybreak from thy housefolk to assign to the believers their positions for the battle, Allah was Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you set out at dawn from your home to assign battle positions to the believers -- God hears all and knows all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thou settedst forth from thy household early to settle believers in positions for the fight. And Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you left your family at dawn to settle the faithful in their positions for battle —and Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember that morning Thou didst leave Thy household (early) to post the faithful at their stations for battle: And Allah heareth and knoweth all things:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you (Muhammad SAW) left your household in the morning to post the believers at their stations for the battle (of Uhud). And Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you went out at dawn from your family to lodge the believers in their positions for the battle. Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you left your home in the morning, to assign battle-positions for the believers. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when you, [O Muhammad], left your family in the morning to post the believers at their stations for the battle [of Uhud] - and Allah is Hearing and Knowing -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:121] And, mention O Muhammad (s), when you went forth at dawn from your family, at Medina, to assign the believers, to have [them] occupy, their places, stations for them to stand at, for battle, and God hears, what you say, knows, your circumstances: this was the day of [the battle of] Uhud. The Prophet (s) set out with 1000 or 950 men, while the idolaters numbered 3000. The Prophet pitched camp at the ravine on Saturday 7th of Shawwāl in year 3 of the Hijra. He had his back and that of his troops to Uhud. He arranged their lines and placed a group of archers under the command of ‘Abd Allāh b. Jubayr at the foot of the mountain and said to them: ‘Defend us with your arrows in case they come up from behind us, and remain here whether we are being defeated or on the verge of victory’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And remember when thou settedst forth at daybreak from thy housefolk) when you left Medina for Uhud (to assign to the believers their positions for the battle) against their enemies, (Allah was Hearer) of your speech, (Knower) of what befell you and of your leaving the positions which were assigned to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُبَوِّىءُ ٱلْمُؤْمِنِينَ [مَقَاعِدَ لِلْقِتَالِ] } معناهُ تتّخَذُ لَهُمْ مَصَافاً ومُعَسْكَراً\n\n",
      "translations": [
        {
          "translation": " And His saying, {Tubawwi' al-mu'minīna [maqā'id al-qital]}, its meaning is that He has taken a position and a camp for them",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل وقت { إِذْ غَدَوْتَ } خرجت أنت مسرعاً في الغداة { مِنْ أَهْلِكَ } عائشة - رضي الله عنها - حال كونك { تُبَوِّىءُ ٱلْمُؤْمِنِينَ } تعينهم\n وتهيئ لهم { مَقَاعِدَ } أمكنة ومواقف { لِلْقِتَالِ } وبعض منهم مع جميع المنافقين يتقاعدن عنه\n ويسوفون\n معلللين بعلل ودلائل ضعيفة وبعض آخر يريدون الخروج\n ويرغبونك عليه { وَٱللَّهُ } المطلبع لضمائر الفريقين { سَمِيعٌ } لأقوالهم { عَلِيمٌ } [آل عمران: 121] بنياتهم\n\n\n \" رُوي أن المشركين نزلوا بأُحد يوم الأربعاء في عشر شوال سنة ثلاث من الهجرة\n فاستشار رسول الله صلى الله عليه وسلم أصحابه ودعا عبد الله بن أبي\n ولم يدعه قبل\n فقال هو وأكثر الأنصار: أقم يا رسول الله بمالدينة ولا تخرج\n فوالله ما خرجنا منها إلى عدو إلا أصاب منا\n ولا دخلها علينا أحد إلا أصبنا منه\n فكيف وأنت فينا\n فدعهم فإن أقاموا أقاموا شر مجلس\n وإن دخلوا قاتلهم الرجال\n ورمامهم النساء والصبيان بالحجارة\n وإن رجعوا رجعوا خائبين\n وأشار بعضهم إلى الخروج\n فقال عليه السلام: \" رأيت في منامي بقرة مذبوحة حولي\n فأولتها خيراً\n ورأيت في ذباب سيفي ثلماً فأولته هزيمة\n ورأيت كأنّي أدخلت يدي في درع حصينة فأولتها المدينة\n فإن رأيتم أن تقيموا بالمدينة وتدعوهم \"\n \n \n فقال رجال من المسلمين فاتهم بدر\n وأكرمهم الله بالشهادة يوم أحد: اخرج بنا إلى أعدائنا\n فبالغوا حتى دخل وليس لأمته\n فلما رأوا ذلك ندموا على مبالغتهم\n فقالوا: اصنع يا رسول الله ما شئت\n فقال صلى الله عليه وسلم: \" لا ينبغي لنبي أن يلبس لأمته فيضعها حتى يقاتل \" \n فخرج بعد صلاة الجمعة\n وأصبح بشعب من أُحد\n ونزل في عدوة الوادي\n وجعل ظهر عسكره\n وسوَّى صفهم\n وأمَّر عبد الله بن جبير على الرماة\n وقال: \" انضحوا عنا بالنبل لا يأتونا من ورائنا \" \n وحين استوى الصفوف\n وبلغوا الشرط\n قال ابن أُبي: علام نقتل أنفسنا وأولادنا؟ فانصرف فوقع الخلاف بين المؤمنين فتزلزوا \"\n \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: واذكر يا محمد حين { غدوت من أهلك } من منزل عائشة\n الذي نَزَلْتَ فيه بأحد\n حين خرجت بها\n حال كونك { تبوئ المؤمنين } أي: تهيئ لهم\n { مقاعد للقتال } أي: مواقف وأماكن يقفون فيها للحرب { والله سميع } لأقوالكم\n { عليم } بإخلاصكم\n قال الواقدي: خرج النبيّ صلى الله عليه وسلم من منزل عائشة - رضي الله عنها - ماشياً على رجليه إلى أُحد\n فجعل يصف أصحابه للقتال كأنما يقوم بهم القدح\n أن رأى صدراً خارجاً\n قال: تأخر\n وذلك أن المشركين نزلوا بأحد\n يوم الأربعاء\n فلما سمع النبيّ صلى الله عليه وسلم بنزولهم استشار أصحابه\n ودعا عبد الله بن أُبي بن سلول - ولم يدْعُه قط قبلها - فاستشاره\n فقال عبد الله بن أبي وأكثر الأنصار: يا رسول الله أَقِمْ بالمدينة ولا تخرجْ إليهم\n فوالله ما خرجنا منها إلى عدو قط إلا أصاب منا\n ولا دخل علينا إلا أصابنا منه\n فكيف وأنت فينا! فدعهم يا رسول الله\n فإن أقاموا أقاموا بشر محبس\n وإن دخلوا قاتلهم الرجال في وجوههم\n ورماهم النساء والصبيان بالحجارة\n وإن رجعوا رجعوا خاسئين\n فأعجب النبيّ صلى الله عليه وسلم هذا الرأي\n وقال بعض أصحابه\n يا رسول الله اخرج بنا إلى هذه الأكْلُب\n لا يرون أنا جَبُنَّا عنهم وضعفنا\n فقال النبيّ صلى الله عليه وسلم:\n \" إِنِّي رأيتُ في منامِي بَقَراً تذبح\n فأولتها ناساً من أصحابي يُقتلون\n ورأيت في ذُبابِ سَيْفي ثلماً\n فأولتها هزيمةً\n ورأيت أني أدخل يدي في درع حصينة\n فأولتها المدينة\n فإن رأيتُمْ أن تُقيموا بالمدينة وتَدَعُوهُمء فافعلوا \" \nفقال رجال ممن فاتهم بدر\n وأكرمهم الله بالشهادة يوم أحد: اخرج بنا إلى أعدائنا\n وبالغوا\n حتى دخل النبيّ صلى الله عليه وسلم ولبس لأمته\n فلما رأوه قد لبس سلاحه ندموا\n وقالوا: بئس ما صنعنا\n نشير على النبيّ صلى الله عليه وسلم والوحي يأتيه\n فقاموا واعتذروا إليه\n وقالوا: اصنع ما رأيتَ\n فقال النبيّ صلى الله عليه وسلم:\n \" لا يَنْبَغِي لنَبِي أَنْ يلبَس لأمَتَهُ فيَضَعَهَا حتَى يُقاتِلَ \"\n \nفخرج بعد صلاة الجمعة\n وأصبح بشعب من أُحُد\n يوم السبت للنصف من شوال\n سنة ثلاث من الهجرة\n ونزل في عدوة من الوادي\n وجعله ظهره وعسكره إلى أحد\n وسوى صفهم كما تقدم\n وأمَّرَ عبد الله بن جبير على الرماة\n وقال: انضحوا عنا بالنبل\n لا يأتونا من خلقنا\n فكان من أمر الله ما كان\n على ما يأتي\n وخرج مع النبيّ صلى الله عليه وسلم في غزوة أحد زهاء ألف\n ووعدهم النصر إن صبروا\n فلما بلغوا الشواط - موضع - انخزل ابنُ أُبيّ في ثلاثمائة\n وقال: علام نقتل أنفسنا! فتبعهم أبو جابر السلمي\n فقال: أُنشدكم الله في نبيكم وأنفسكم\n\nفقال ابن أُبيّ: لو نعلم قتالاً لاتبعناكم\n وهمت بنو حارثة وبنو سلمة بالانصراف معه\n فثبتوا مع النبيّ صلى الله عليه وسلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:23",
      "similarity": 0.454676189002813
    },
    {
      "verse": "59:18",
      "similarity": 0.39615908065695454
    },
    {
      "verse": "5:29",
      "similarity": 0.3930879376563705
    },
    {
      "verse": "16:41",
      "similarity": 0.3725349360400301
    },
    {
      "verse": "85:6",
      "similarity": 0.35397917013038865
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003121.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003121.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:121.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}