{
  "chapter": "آل عمران",
  "text": "ولله ما فى السموت وما فى الارض يغفر لمن يشاء ويعذب من يشاء والله غفور رحيم",
  "translations": [
    {
      "translation": "Everything in the heavens and everything in the earth belongs to Allah. He forgives whoever He wills and punishes whoever He wills. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth: He may pardon whom He please and punish whom He will. Yet God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth belongs to Allah. He forgives whom He wills, and chastises whom He wills: Allah is indeed All-Forgiving, Most-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth. He may forgive or punish whomever He wants. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only belongs all whatever is in the heavens and all whatever is in the earth; He may forgive whomever He wills, and punish whomever He wills; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs all that is in the heavens and all that is in the earth. He forgives whom He wills, and punishes whom He wills. And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever is in the heavens and whatever is in the earth is Allah's; He forgives whom He pleases and chastises whom He pleases; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and earth; He forgives whom He will, and chastises whom He will; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. He forgiveth whom He will, and punisheth whom He will. Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is on the earth belong to God. He forgives whoever He pleases and punishes whoever He pleases. God is most forgiving and ever merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is whatsoever is in the heavens and whatsoever is in the earth. He forgiveth whomsoever He listeth, and tormenteth whomsoever He listeth. And Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever there is in the heavens and the earth: He forgives whomever He wishes and punishes whomever He wishes, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongeth all that is in the heavens and on earth. He forgiveth whom He pleaseth and punisheth whom He pleaseth; but Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs all that is in the heavens and all that is in the earth. He forgives whom He wills, and punishes whom He wills. And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and the earth. He forgives whom He will and punishes whom He will. Allah is Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs everything in the heavens and the earth. He forgives whom He wills, and He punishes whom He wills. God is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs whatever is in the heavens and whatever is on the earth. He forgives whom He wills and punishes whom He wills. And Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:129]   To God belongs all that is in the heavens and the earth, as possessions, creatures and servants; He forgives whom He wills, forgiveness for, and chastises whom He wills, chastisement for. And God is Forgiving, of His friends, Merciful, to those who obey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتذييل لقوله : { أو يتوب عليهم أو يعذبهم } مشير إلى أن هذين الحالين على التوزيع بين المشركين ، ولمَّا كان مظنّة التطلّع لمعرفة تخصيص فريق دون فريق ، أو تعميم العذاب ، ذيّله بالحوالة على إجمال حضرة الإطلاق الإلهية ، لأنّ أسرار تخصيص كلّ أحد بما يعيَّن له ، أسرار خفيّة لا يعلمها إلاّ الله تعالى ، وكلّ ميسّر لما خلق له .\n\n",
      "translations": [
        {
          "translation": "(Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings. (He forgiveth whom He will) whoever deserves to be forgiven, (and punisheth whom He will) whoever deserves to be punished. (Allah is Forgiving) of those who repent, (Merciful) towards him who dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يغفر لمن يشاء } غفرانه\n { ويعذب من يشاء } تعذيبه\n ولا يجب عليه شيء\n { والله غفور رحيم } لعباده\n فلا تبادر بالدعاء عليهم\n الإشارة: وما جعل الله التأييد الذي ينزله على أهل التجريد\n حين يقابلهم بالابتلاء والتشديد\n إذا أراد أن يوصلهم لصفاء التوحيد\n إلا بشارة لفتحهم\n ولتطمئن بمعرفته قلوبهم\n فإن الامتكان على قدر الامتحان\n وكل محنة تزيد مكنة\n وهذه سنة الله في أوليائه\n يسلط عليهم الخلق في بدايتهم\n ويشدد عليهم ابلاء\n حتى إذا طهروا من البقايا\n وكملت فيهم المزايا\n كف عنهم الأذى\n وانقلب الجلال جمالاً\n وذلك اعتناء بهم\n ونصراً لهم على أنفسهم\n فإن النصر كله { من عند الله العزيز الحكيم }\n وذلك ليقطع عنهم طرفاً من الشواغل والعلائق\n التي تقبضهم عن العروج إلى سماء الحقائق\n فإن الروح إذا رقدت في ظل العز والجاه صعب خروجها من هذا العالم\n فإذا ضيق عليها\n وعكس مرادها\n رحلت إلى عالم الملكوت\n والأمر كله بيد الله\n ليس لك أيها الفقير من الأمر شيء\n إنما أنت مأمور بتحريك الأسباب والله يفتح الباب\n\nليس لك أيها الشيخ من الأمر شيء\n إنما أنت مذكر\n وعلى الله البلاغ\n فلا تأس على ما فاتك\n ولا تفرح بما آتاك\n فملكوت السماوات والأرض بيد الله\n { يغفر لمن يشاء ويعذب من يشاء والله غفور رحيم }\n قال القشيري: جرَّده - أي: نبيه صلى الله عليه وسلم لما به عرفه عن كُلِّ غيْرٍ وسبب\n حيث أخبره أنه ليس له من الأمر شيء\n ثم قال: ويقال: أقامه في وقتٍ مقاماً رمى بقبضة من التراب\n فأصابت جميع الوجوه\n وقال:\n[الأنفال: 17]\n وقال في وقت آخر:\n[آل عِمرَان: 128]\n هـ\n يشير إلى أنهما مقامان: نيابة عن الله بالله\n ونيابة الله عن عبده\n والأول بقاء\n والثاني فناء\n قاله المحشي\n قتل: الأول في مقام البسط\n والثاني في مقام القبض\n فقد قالوا: إذا بسط فلا فاقة\n وإذا قبض فلا طاعة\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:14",
      "similarity": 0.8459041754015492
    },
    {
      "verse": "8:33",
      "similarity": 0.6317666429353085
    },
    {
      "verse": "4:106",
      "similarity": 0.56059000046146
    },
    {
      "verse": "5:40",
      "similarity": 0.5366877142005668
    },
    {
      "verse": "41:32",
      "similarity": 0.5034518704772564
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003129.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003129.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:129.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}