{
  "chapter": "آل عمران",
  "text": "اذ همت طائفتان منكم ان تفشلا والله وليهما وعلى الله فليتوكل المؤمنون",
  "translations": [
    {
      "translation": "And remember when two of your clans were on the point of losing heart and Allah was their Protector. Let the muminun put their trust in Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two of your bands were about to lose heart God befriended them; and in Him should the faithful place their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when two groups from among you were inclined to flag although Allah was their protector; it is in Allah that the believers should put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two groups among you almost lost courage despite having God as their Guardian. The believers should always have trust in God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two groups among you almost decided to show cowardice – and Allah is their Protector; and in Allah only should the believers trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two parties from among you were about to lose heart, but Allah was their Wali (Supporter and Protector). And in Allah should the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two parties from among you had determined that they should show cowardice, and Allah was the guardian of them both, and in Allah should the believers trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when two parties of you were about to lose heart, though God was their Protector -- and in God let the believers put all their trust --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two parties of you almost fell away, and Allah was their Protecting Friend. In Allah let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two groups from among you were about to lose heart, God was their protector. In God let the faithful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time two sections of you bethought that they should flag whereas Allah was the Patron of the twain. In Allah, then, let the believers trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two groups among you were about to lose courage—though Allah is their guardian, and in Allah let all the faithful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember two of your parties Meditated cowardice; but Allah was their protector, and in Allah should the faithful (Ever) put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two parties from among you were about to lose heart, but Allah was their Wali (Supporter and Protector). And in Allah should the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two parties of you were about to fail, though Allah was their Guardian, and in Allah believers put all their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two groups among you almost faltered, but God was their Protector. So in God let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When two parties among you were about to lose courage, but Allah was their ally; and upon Allah the believers should rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:122]   When (idh, substitutes for the previous idh) two parties of you, the Banū Salima and the Banū Hāritha, the two flanks of the army, were about to lose heart, [about] to shrink from the battle and retreat, after ‘Abd Allāh b. Ubayy, the hypocrite, and his companions began to retreat. He [Ibn Ubayy] said, ‘Why should we get ourselves and our children killed?’ and he also said to Abū Jābir al-Salamī — who had said to him, ‘I implore you by God for your Prophet’s sake and yours’ — ‘If we knew how to fight, we would follow you!’ But God then made them [the Banū Salima and the Banū Hāritha] steadfast and they did not abandon [the field]; and God was their Protector, their Helper, and let the believers rely on God, let them place their trust in Him and none other.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When two parties of you almost) two tribes of believers, the Banu Salamah and Banu Harithah, hid the fact that they almost (fell away) shrank away from fighting against the enemy on the Day of Uhud, (and Allah was their Protecting Friend) He preserved them and prevented them from doing so. (In Allah do believers put their trust) the believers ought to put their trust in Allah when it comes to help and conquest.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَفْشَلاَ } معناه تَضْعَفا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذْ هَمَّتْ } قصرت في تلك الحالة { طَّآئِفَتَانِ مِنكُمْ } بنو سلمة من الخرزج، وبنو حارثة من الأوس، وكانا جناح العسكر { أَن تَفْشَلاَ } تنهزما ضعفاء وجبناء، وتتبعنا أثر ابن أبي فعصمهما الله عن متابعة الشيطان وجنوده، فمضيا مع رسول الله يستغفرون عمَّا جرى عليهما { وَ } كيف لا يعصمهما من مخالفتخ؛ إذ { ٱللَّهُ وَلِيُّهُمَا } ومولي أمورهما أرشدهما إلى ماهو أصح لحالهما { وَعَلَى ٱللَّهِ } المدبر لمصالح عباده لا على غيره من الأظلال { فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ } [ال عمران: 122] حتى يتحققوا بقمام العبودية والرضا والتفويض\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفقال ابن أُبيّ: لو نعلم قتالاً لاتبعناكم، وهمت بنو حارثة وبنو سلمة بالانصراف معه، فثبتوا مع النبيّ صلى الله عليه وسلم، فذكرهم نعمته بقوله: { إذ همت طائفتان منكم أن تفشلا والله وليهما } وناصرهما، حيث عصمهما من اتباع المنافقين، قال جابر: ما يسرنا أنها لم تنزل، لقوله: { والله وليهما }  فبنو سلمة من الخزرج، وبنو حارثة من الأوس، { وعلى الله فليتوكل المؤمنون } لا على غيره، إذ لا ناصر غيره\n الإشارة: من شأن شيوخ التربية أن يَدُلُّوا المريدين على محاربة النفوس ومقاتلتها، ويطلعوهم على دسائسها ومخادعتها، ليهيئوا لهم بذلك مقاعد لقتالها، والله مطلع على إخلاصهم ونياتهم، فمنهم من يمل ويكل، فيرجع إلى وطن عوائده، ومنهم من يصبر حتى يفوز بالغنيمة العظمى والسعادة القصوى، وفي ذلك يقول القائل:\n\nقال بعضهم: انتهى سير السائرين إلى الظفر بنفوسهم، فإن ظفروا بها وصلوا\n هـ\n ومنهم من يلحقه الملل والفشل فيهم بالانصراف والرجوع، ثم يثبته الله تعالى وينصره، فيلحق بالصابرين السابقين، وعمدة المريد في مجاهدة نفسه: التوكل على الله والاعتماد عليه دون شيء سواه \" من علامة النجح في النهايات: الرجوع إلى الله في البدايات \"\n { وعلى الله فليتوكل المؤمنون }\n\n",
      "translations": []
    }
  ]
}