{
  "chapter": "آل عمران",
  "text": "او۟لئك جزاؤهم مغفرة من ربهم وجنت تجرى من تحتها الانهر خلدين فيها ونعم اجر العملين",
  "translations": [
    {
      "translation": "Their recompense is forgiveness from their Lord, and Gardens with rivers flowing under them, remaining in them timelessly, for ever. How excellent is the reward of those who act!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their recompense is pardon by their Lord, and gardens with streams of running water where they will abide for ever. How fair is the recompense of those who act!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be recompensed by forgiveness from their Lord and by gardens beneath which rivers flow; there they shall abide. How good is the reward of those who labour!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward will be forgiveness from their Lord and gardens wherein streams flow and wherein they will live forever. How blessed is the reward of those who labor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such the reward is forgiveness from their Lord, and Gardens beneath which rivers flow – abiding in it forever; what an excellent reward for the performers (of good deeds)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such, the reward is forgiveness from their Lord, and Gardens with rivers flowing underneath (Paradise), wherein they shall abide forever. How excellent is this reward for the doers (of good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) these-- their reward is forgiveness from their Lord, and gardens beneath which rivers flow, to abide in them, and excellent is the reward of the laborers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those -- their recompense is forgiveness from their Lord, and gardens beneath which rivers flow, therein dwelling forever; and how excellent is the wage of those who labour!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The reward of such will be forgiveness from their Lord, and Gardens underneath which rivers flow, wherein they will abide for ever - a bountiful reward for workers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their recompense is forgiveness from their Lord, and Gardens with rivers flowing through them, where they will abide forever. How excellent will be the reward of those who do good works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those! their meed is forgiveness from their Lord and Gardens whereunder rivers flow; they shall be abiders therein. Excellent is the hire of the workers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward is forgiveness from their Lord, and gardens with streams running in them, to remain in them [forever]. How excellent is the reward of the workers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such the reward is forgiveness from their Lord, and Gardens with rivers flowing underneath,- an eternal dwelling: How excellent a recompense for those who work (and strive)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such, the reward is Forgiveness from their Lord, and Gardens with rivers flowing underneath (Paradise), wherein they shall abide forever. How excellent is this reward for the doers (who do righteous deeds according to Allah's Orders).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, their recompense is forgiveness from their Lord and Gardens underneath which rivers flow, where they shall live for ever. How excellent is the wage of those who labor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those—their reward is forgiveness from their Lord, and gardens beneath which rivers flow, abiding therein forever. How excellent is the reward of the workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those - their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:136] Those — their requital is forgiveness from their Lord, and Gardens beneath which rivers flow, abiding therein (khālidīna fīhā, an implied situation, that is, it is foreordained that they will abide in it once they enter it); excellent is the wage, this wage, of those workers, of obedience!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The reward of such will be forgiveness) of their sins (from their Lord, and Gardens beneath) beneath its trees and habitations (which rivers) of wine, water, honey and milk (flow, wherein they will abide for ever) in Paradise, never to die or leave it, (a bountiful reward for workers!) the reward of those who repent is Paradise and all that which was mentioned.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } المتذكرون، المستغفرون { جَزَآؤُهُمْ مَّغْفِرَةٌ } ستر لأنانيتهم، عطاء { مِّن رَّبِّهِمْ } لإخلاصهم في الإنابة والرجوع { وَجَنَّاتٌ } كشوف وشهود { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق { خَالِدِينَ فِيهَا } أبداً، لا يظمؤون منها أبداً، بل يطلبون دائماً مزيداً { وَنِعْمَ أَجْرُ ٱلْعَامِلِينَ } [آل عمران: 136] تلك الغفران والجنان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك جزاؤهم مغفرة من ربهم } تغطية لذوبهم، { وجنات تجري من تحتها الأنهار خالدين فيها } ، ولا يلزم من إعدادها للتائبين اختصاصهم بها، كما لا يلزم من إعداد النار للكفار اختصاصهم بها، ثم مدح أجر التائبين فقال: { ونعم أجر العالمين } ، وانظر هذا الفرق العظيم الذي بين المحسنين وأهل اليمين، قال في الآية الأولى: { والله يحب المحسنين } وقال في هذه الآية: { ونعم أجر العاملين } ، أهل الآية الأولى من خواص الأحباب، وأهل هذه يأخذون أجرهم من وراء الباب\n وبالله التوفيق، وهو الهادي إلى عين التحقيق\n الإشارة: أهل مقام الإحسان عملهم قلبي، كالسخاء والعفو وكظم الغيظ، وأهل اليمين عملهم بدني، بين طاعة ومعصية وغفلة ويقظة، إذا فعلوا فاحشة تابوا وستغفروا، وإذا فعلوا طاعة فرحوا واستبشروا، أهل مقام الإحسان غائبون عن رؤية أعمالهم ووجودهم، وأهل اليمين معتمدون على أعمالهم، إذا فعلوا طاعة قوى رجاؤهم، وإذا زلَّوا نقص رجاؤهم، أهل مقام الإحسان فانون عن أنفسهم باقون بربهم، وأهل اليمين أنفسهم موجودة وأعمالهم لديهم مشهودة، أهل مقام الإحسان محبوبون، وأهل اليمين مُحِبُّون، أهل مقام الإحسان فنيت عندهم الرسول والأشكال، وبقي في نظرهم وجود الكبير المتعال، وأهل اليمين: الأكوان عندهم موجودة، وشموس المعارف عن قلوبهم مفقودة، أهل مقام الإحسان يعبدون الله على نعت الشهود والعيان، وأهل اليمين يعبدون الله من وراء حجاب الدليل والبرهان، أهل الدليل والبرهان عموم عند أهل الشهود والعيان\n\n\nواعلم أن لمعرفة الشهود والعيان ثمرات ونتائج، حصرها بعضهم في إحدى عشرة خصلة\n الأولى: الحرية، ومعناها أن يكون العارف فرداً لِفَرْدٍ، من غير أن يكون تحت رق شيء من الموجودات، لا من إغراض الدنيا ولا من أغراض الآخرة، فالحرية عبارة عن غاية التصفية والطهارة\n قال بعضهم: ليس بحُرٍّ من بقي عليه من تصفية نفسه مقدار فص نواة، المكاتب عبد ما بقي عليه درهم\n الثانية: الوجود، وهو الفوز بحقيقة الأشياء في الأصل، وهو عبارة عن إدراك مقام تضمحل فيه الرسوم، بالاستغراق في الحقيقة الأزلية\n الثالثة: الجمع الأتم، وهو الحال الذي يقضي بقطع الإشارات، والشخوص عن الأمارات والعلامات، بعد صحة التمكين والبراءة من التلوين\n الرابعة: الصحو، وهو عبارة عن تمكين حال المشاهدة، واتصالها، مع برء الروح من لدغات الدَّهَشِ، ولا يكمل الصحو إلا بحياة الروح بوارد الجمع الدائم\n الخامسة: التحقيق، وهو الوصول إلى المعرفة بالله، التي لا تدْركُ بالحواس، لتخليص المشرب من الحق بالحق في الحق، حتى تسقط المشاهدات، وتبطل العبارات، وتفنى الإشارات\n السادسة: البسط، ونعني به: بسط الروح باسترسال شهود المعاني عند سقوط الأواني، وفي ذلك يقول ابن الفارض:\n\nالسابعة: التلبيس، وهو تغطية الأسرار بأستار الأسباب، إبقاء للحكمة وستراً عن العامة\n الثامنة: البقاء، والمراد به الخروج عن فناء المشاهدة إلى بقاء المعرفة، من غير أُفُول بُخل بشمس المشاهدة، ولا رجوع إلى شواهد الحس، إنما هو استصحاب الجمع مع استنئاس الروح بحلاوة المعاني، فهو كبائِن دانٍ\n انظر بقيتها في [بغية المسالك]\n وبالله التوفيق\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:9",
      "similarity": 0.7202989425024197
    },
    {
      "verse": "5:85",
      "similarity": 0.6511690195189708
    },
    {
      "verse": "14:23",
      "similarity": 0.6434772055434155
    },
    {
      "verse": "3:198",
      "similarity": 0.5685496586474521
    },
    {
      "verse": "22:14",
      "similarity": 0.5676224229119123
    }
  ]
}