{
  "chapter": "آل عمران",
  "text": "والذين اذا فعلوا۟ فحشة او ظلموا۟ انفسهم ذكروا۟ الله فاستغفروا۟ لذنوبهم ومن يغفر الذنوب الا الله ولم يصروا۟ على ما فعلوا۟ وهم يعلمون",
  "translations": [
    {
      "translation": "those who, when they act indecently or wrong themselves, remember Allah and ask forgiveness for their bad actions (and who can forgive bad actions except Allah?) and do not knowingly persist in what they were doing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, if they commit a shameful act or some wrong against themselves, remember God and seek forgiveness for their sins: For who can forgive except God? They should not be perverse about their doings, knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones who, when they commit any indecency and wrong against themselves, instantly remember Allah and implore forgiveness for their sins - for who will forgive sins save Allah? - and who do not wilfully persist in the wrong they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Paradise) is also for those who, when committing a sin or doing injustice to themselves, remember God and ask Him to forgive their sins. Who can forgive sins besides God? And who do not knowingly persist in their mistakes?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, when they commit an immoral act or wrong themselves, remember Allah and seek forgiveness of their sins – and who forgives sins except Allah? And those who do not purposely become stubborn regarding what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, when they have committed Fahishah (immoral sin) or wronged themselves with evil, remember Allah and ask forgiveness for their sins; and none can forgive sins but Allah, and do not persist in what (wrong) they have done, while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who when they commit an indecency or do injustice to their souls remember Allah and ask forgiveness for their faults-- and who forgives the faults but Allah, and (who) do not knowingly persist in what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, when they commit an indecency or wrong themselves, remember God, and pray forgiveness for their sins -- and who shall forgive sins but God? -- and do not persevere in the things they did and that wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, when they do an evil thing or wrong themselves, remember Allah and implore forgiveness for their sins - Who forgiveth sins save Allah only? - and will not knowingly repeat (the wrong) they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who, when they have committed an indecency or have wronged their souls, remember God and pray that their sins be forgiven, for who but God can forgive sins?, and do not knowingly persist in their misdeeds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those, who, when they have done an ill-deed or wronged themselves, remember Allah and ask forgiveness of their sins - and who forgiveth sins save Allah! Is --and persist not in that which they have done, while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who, when they commit an indecent act or wrong themselves, remember Allah, and plead [to Allah seeking His] forgiveness for their sins—and who forgives sins except Allah?—and who knowingly do not persist in what [sins] they have committed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, having done something to be ashamed of, or wronged their own souls, earnestly bring Allah to mind, and ask for forgiveness for their sins,- and who can forgive sins except Allah?- and are never obstinate in persisting knowingly in (the wrong) they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, when they have committed Fahishah (illegal sexual intercourse etc.) or wronged themselves with evil, remember Allah and ask forgiveness for their sins; - and none can forgive sins but Allah - And do not persist in what (wrong) they have done, while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who, if they commit indecency or wrong themselves remember Allah and ask forgiveness of their sins for who but Allah forgives sins and those who do not persist in what they do while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, when they commit an indecency or wrong themselves, remember God and ask forgiveness for their sins—and who forgives sins except God? And they do not persist in their wrongdoing while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, when they commit an immorality or wrong themselves [by transgression], remember Allah and seek forgiveness for their sins - and who can forgive sins except Allah? - and [who] do not persist in what they have done while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:135] And who when they commit an indecency, a despicable sin such as adultery, or wrong themselves, with less than that, such as a kiss, remember God, that is to say, His threat of punishment, and pray forgiveness for their sins — and who, that is, none, shall forgive sins but God? — and who do not persist, persevere, in what they did, but have desisted from it, knowing, that what they did was sinful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The following was then revealed about a man from the Helpers because he stared at, touched and kissed the wife of a man from Thaqif, saying: (And those who, when they do an evil thing) a transgression (or wrong themselves) by staring at [women], touching or kissing (remember Allah) fear Allah (and implore forgiveness for their sins) repent of their sins (-who forgiveth sins save Allah only?) the sins of he who repents (-and will not knowingly) i.e. knowing that it is a transgression against Allah (repeat (the wrong) they did).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والذين إذا فَعَلوا فاحشة } كبيرة من الكبائر\n برؤية أفعالهم صادرة عن قدرتهم { أو ظلموا أنفسهم } نقصوا حقوقها بارتكاب الصغائر وظهور أنفسهم فيها { ذكروا الله } في صدور أفعالهم برؤيتها واقعة بقدرة الله وتبرأ عنها إليه لرؤيتهم ابتلاءه إياهم بها { فاستغفروا } طلبوا ستر أفعالهم التي هي ذنوبهم بأفعاله بالتبرّي عن الحول والقوّة إليه { ومن يغفر الذنوب } أي وجودات الأفعال { إلا الله } أي علموا أن لا غافر إلا هو { ولم يصرّوا على ما فَعَلوا } في غفلتهم وحالة ظهور أنفسهم\n بل تابوا ورجعوا إليه في أفعالهم { وهم يَعْلمُون } أن لا فعل إلا الله { ونِعْمَ أجر العاملين } بمقتضى توحيد الأفعال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة المتقين والمعدودين من زمرتهم: { ٱلَّذِينَ إِذَا فَعَلُواْ فَاحِشَةً } فعلة قبيحة صغيرة كانت أو كبيرة\n صدرت منهم هفوة خطأ { أَوْ ظَلَمُوۤاْ أَنْفُسَهُمْ } بأن صدرت عنهم عن قصد وتعمد\n ثم { ذَكَرُواْ ٱللَّهَ } خائفاً من بطشه وانتقامه { فَٱسْتَغْفَرُواْ } منه راجين العفو والستر { لِذُنُوبِهِمْ } التي صدرت عنهم عمداً أو خطأً { وَمَن يَغْفِرُ ٱلذُّنُوبَ } مطلقاً من العباد { إِلاَّ ٱللَّهُ } غير الله الذي يغفر ما دون الشرك لمن يشاء من عباده إرادةً واختياراً { وَ } بعد استغفارهم { لَمْ يُصِرُّواْ } ولم يرجعوا { عَلَىٰ مَا فَعَلُواْ } بل تركوه بالمرة\n ولم يرجعوا عليها أصلاً { وَ } الحال أنهم { هُمْ يَعْلَمُونَ } [آل عمران: 135] قبحه ووخامة عاقبته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { والذين إذا فعلوا فاحشة } أي: فعلة بالغة في الفحش والقبح\n كالزنى\n { أو ظلموا أنفسهم } بأي ذنب كان\n أو فعلوا كبيرة أو صغيرة\n أو الفاحشة: ما يتعدى للغير\n وظلم النفس ما يخص\n أو الفاحشة بالفعل\n وظلم النفس بالقول\n { ذكروا الله } أي: عاقبه وغضبه وعرضه الأكبر\n أو { ذكروا الله } في أنفسهم أن الله سائلهم عنه\n أو كونه رقيباً عليهم\n أو { ذكروا الله } باللسان { فاستغفروا لذنوبهم } بالندم والتوبة\n { ومن يغفر الذنوب إلا الله } أي: لا أحد يغفره إلا الله\n والمراد: وصفه تعالى بسعة الرحمة وعموم المغفرة\n والحث على الاستغفار\n { ولم يصروا على ما فعلوا } أي: لم يدوموا عليها غير مستغفرين\n لقوله صلى الله عليه وسلم:\n \" ما أصَرَّ مَن اسْتَغفَر\n ولو عَادَ في اليَوم سَبْعِينَ مَرَةً \" \nوذلك إذا صحبه الندم\n وقال أيضاً:\n \" لا كَبِيرةَ مَعَ الاستغفَار\n ولا صَغيرَةَ معَ الإصْرارِ \" \nقال قتادة: إياكم والإصرار\n فإنما هلك المصرون الماضون قِدْماً في معاصي الله تعالى\n لم يتوبوا حتى أتاهم\n هـ\n { وهم يعلمون } أن الإصرار يضر بهم\n أو: وهم يعلمون أن لهم رباً يغفر الذنب لقوله - عليه الصلاة والسلام-:\n \" مَنْ أَذْنَبَ ذنْباً\n وعَلِمَ أَنَّ له ربّاً يَغْفُرِ الذنوب\n غَفَرَ له وإِنْ لمْ يسْتَغفر \" \nوفي الحديث القدسي يقول الله تعالى:\n \" من علم أني ذو قدرة على المغفرة غفرتُ له ولا أبالي \" \nوفي بعض الكتب المنزلة:\n \" يا ابْنَ آدَمَ\n إِنَّكَ ما دَعَوْتني ورَجَوْتني لأغفرن لَكَ على مَا كَانَ منكَ ولا أُبَالِي \" \nأو: { وهم يعلمون } أن التوبة تمحق الذنوب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:8",
      "similarity": 0.5508353613808005
    },
    {
      "verse": "3:117",
      "similarity": 0.5413534364111313
    },
    {
      "verse": "56:46",
      "similarity": 0.35099240387807407
    },
    {
      "verse": "71:7",
      "similarity": 0.323358895332134
    },
    {
      "verse": "7:28",
      "similarity": 0.32258940259573216
    }
  ]
}