{
  "chapter": "آل عمران",
  "text": "وسارعوا۟ الى مغفرة من ربكم وجنة عرضها السموت والارض اعدت للمتقين",
  "translations": [
    {
      "translation": "Race each other to forgiveness from your Lord and a Garden as wide as the heavens and the earth, prepared for the people who have taqwa:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten for the pardon of your Lord, and for Paradise extending over the heavens and the earth, laid out for those who take heed for themselves and fear God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to the for-giveness of your Lord and to a Paradise as vast as the heavens and the earth, prepared for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten to obtain forgiveness from your Lord and to qualify yourselves for Paradise. Paradise, vast as the heavens and the earth, is prepared for the pious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rush towards forgiveness from your Lord, and towards a Paradise that can hold all the heavens and the earth in its width – prepared for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And march forth in the way (which leads to) forgiveness from your Lord, and for Paradise as wide as the heavens and the earth, prepared for the Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to forgiveness from your Lord; and a Garden, the extensiveness of which is (as) the heavens and the earth, it is prepared for those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie with one another, hastening to forgiveness from your Lord, and to a garden whose breadth is as the heavens and earth, prepared for the godfearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie one with another for forgiveness from your Lord, and for a paradise as wide as are the heavens and the earth, prepared for those who ward off (evil);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie with one another for your Lord's forgiveness and for a Paradise as vast as the heavens and the earth, which has been prepared for the God-fearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie with each other in hastening to obtain forgiveness from your Lord and toward the Garden whereof the width equalleth the heavens and the earth, gotten ready for the God- fearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten towards your Lord’s forgiveness and a paradise as vast as the heavens and the earth, prepared for the Godwary\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be quick in the race for forgiveness from your Lord, and for a Garden whose width is that (of the whole) of the heavens and of the earth, prepared for the righteous,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And march forth in the way (which leads to) forgiveness from your Lord, and for Paradise as wide as are the heavens and the earth, prepared for Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to a forgiveness from your Lord and a Paradise as wide as heaven and earth, prepared for the cautious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And race towards forgiveness from your Lord, and a Garden as wide as the heavens and the earth, prepared for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:133] And vie with one another hastening (read wa-sāri‘ū or [simply] sāri‘ū) to forgiveness from your Lord, and to a garden as wide as the heavens and the earth, that is, as broad as both of them together if put side by side, breadth denotes ampleness, that has been prepared for those who fear God in being obedient and abandoning acts of disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And vie one with another for forgiveness from your Lord) hasten to repent of usury and from all transgressions and reach for forgiveness from your Lord, (and for a Paradise) by means of righteous works and avoidance of usury (as wide as are the heavens and the earth) if they were to be joined to each other, (prepared) created (for those who ward off (evil)) ward off disbelief, idolatry, indecencies, and the consumption of usury;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وسارِعُوا إلى } ستر أفعالكم التي هي حجابكم عن مشاهدة أفعال الحق بأفعاله تعالى\n فإنما حرمتم عن التوكل وجنة عالم المُلْك التي هي تجلي الأفعال برؤية أفعالكم\n أي: إلى ما يوجب ستر أفعالكم بأفعاله\n وجنّة الأفعال من الطاعات بعد كما ورد:\n \" أعوذ بعفوك من عقابك \" \nولأن المراد بالجنّة هنا جنة الأفعال\n وصف عرضها بمساواة عرض السموات والأرض\n إذ توحيد الأفعال هو توحيد عالم الملك وإنما قدّر طولها لأن الأفعال باعتبار السلسلة العرضية\n وهي توقف كل فعل على فعل آخر تنحصر في عالم المُلك الذي يتقدّره الناس\n وأما باعتبار الطول فلا تنحصر فيه ولا يقدّرها\n إذ الفعل مظهر الوصف\n والوصف مظهر الذات\n فلا نهاية له ولا حدّ\n فالمحجوبون عن الذات والصفات لا يرون إلا عرض هذه الجنّة\n وأما البارزون لله الواحد القهار فعرض جنتهم عين طولها ولا حدّ لطولها فلا يقدر قدرها طولاً ولا عرضاً\n { أعدّت للمتقين } الذين يتقون حجب أفعالهم وشرك نسبة الأفعال إلى غير الحق\n { الذينَ ينفقون في السرّاء والضرّاء } لا تمنعهم الأحوال المضادّة عن الإنفاق لصحة توكلهم على الله برؤية جميع الأفعال منه { والكاظمين الغيظ } لذلك أيضاً\n إذ يرون الجناية عليهم فعل الله فلا يعترضون",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { سَارِعُوۤاْ } بادروا وواظبوا { إِلَىٰ } طلب { مَغْفِرَةٍ مِّن رَّبِّكُمْ } ستر ومحو لهوياتكم { وَ } وصول { جَنَّةٍ } منزل ومقر { عَرْضُهَا ٱلسَّمَٰوَٰتُ } أي: الأسماء الصفات الإلهية القائمة بذات الله { وَٱلأَرْضُ } أي: طبيعة العدم القابل لانعكاس أشعة تلك الأسماء والصفات\n إنما { أُعِدَّتْ } وهُيئت { لِلْمُتَّقِينَ } [آل عمران: 133] من أهل التوحيد\n وهم الذين يرفعون غشاوة الغيرية وغطاء التعامي عن نور الوجود مطلقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وسارعوا أيضاً إلى { جنة عرضها السماوات والأرض } لو وصل بعضها ببعض\n وذكر العرض للمباغلة في وصفها بالسعة لأنه دون الطول\n قال بعضهم: لم يُرد العَرض الذي هو ضد الطول\n وإنما أراد عظمها\n ومعناه: كعرض السماوات السبع والأرضين السبع في ظنكم\n أي: لا تدرك ببيان\n { أُعِدّت } أي: هُيِّئَتْ { للمتقين }\n وفيه دليل على أن الجنة مخلوقة\n وأنها خارجة عن هذا العالم\n ثم وصف أهلها من المتقين بأوصاف الكمال\n فقال: { الذين ينفقون في السراء والضراء } أي: في حالتي الرخاء والشدة\n وفي الأحوال كلها\n كما هي حالة الأسخياء\n قال صلى الله عليه وسلم:\n \" الجنَّةُ دَارُ الأسخياءِ \" \nوقال أيضاً:\n \" السَّخيُّ قريب ٌ مِنَ اللهِ\n قَرِيبٌ من الجنَّةِ\n قَرِيبٌ منَ النَّاس\n بعيدً من النَّارِ\n والبَخيلُ بَعيدٌ من الله\n بَعِيدٌ مِنَ الجَنَّةِ\n بَعِيدٌ\n مِنَّ النَّاس\n قرِيبٌ مِنَ النَّارِ\n ولجَاهِلٌ سَخِيٌ أحبُّ إلى اللهِ مِنَ العالمِ البَخِيل \" \nوقال أيضاً صلى الله عليه وسلم:\n \" السّخَاء شَجَرةٌ في الجنة\n أغصانُها في الدُّنيا\n من تعلق بَغُصنٍ من أغْصَانِها قادَته إلى الجنَّةِ\n والبخْلُ شَجرةٌ في النَّارِ\n أغصَانُها في الدُّنيا\n من تعلق ببعض من أغصانها قَادَته إلى النَّارِ \"\n ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:61",
      "similarity": 0.4897586411400523
    },
    {
      "verse": "57:21",
      "similarity": 0.4764182960890852
    },
    {
      "verse": "23:56",
      "similarity": 0.4762247113442734
    },
    {
      "verse": "14:51",
      "similarity": 0.4677258181598771
    },
    {
      "verse": "40:17",
      "similarity": 0.4480584807275968
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/3:133.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/3:133.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/3:133.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}