{
  "chapter": "آل عمران",
  "text": "قد خلت من قبلكم سنن فسيروا۟ فى الارض فانظروا۟ كيف كان عقبة المكذبين",
  "translations": [
    {
      "translation": "There have been many dispensations before you; so travel in the land and see what befell those who denied the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many eras have passed before you. Go about, then, in the land and behold the end of those who gave the lie to (the directives and ordinances of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Different traditions existed in the past. Travel in the land and find out about the fate of those who rejected the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some traditions have been tried before you – therefore travel in the land and see what sort of fate befell those who denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many similar ways (and mishaps of life) were faced [by nations (believers and disbelievers) that have passed away] before you, so travel through the earth, and see what was the end of those who denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there have been examples before you; therefore travel in the earth and see what was the end of the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divers institutions have passed away before you; journey in the land, and behold how was the end of those that cried lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Systems have passed away before you. Do but travel in the land and see the nature of the consequence for those who did deny (the messengers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are many examples [of the communities] that have passed away before you: travel through the land, and see what was the end of those who rejected the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dispensations have gone forth before you go about then on the earth, and behold what wise hath been the end of the beliers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certain [Divine] precedents have passed before you. So travel through the land and observe how was the fate of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many were the Ways of Life that have passed away before you: travel through the earth, and see what was the end of those who rejected Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many similar ways (and mishaps of life) were faced by nations (believers and disbelievers) that have passed away before you (as you have faced in the battle of Uhud), so travel through the earth, and see what was the end of those who disbelieved (in the Oneness of Allah, and disobeyed Him and His Messengers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There have been examples before you. Journey in the land and see what was the fate of the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many societies have passed away before you. So travel the earth and note the fate of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similar situations [as yours] have passed on before you, so proceed throughout the earth and observe how was the end of those who denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:137] The following was revealed regarding the defeat at Uhud: Ways of life have passed away before you, all manner of unbelief has preceded, where they have been given respite but are then seized [with punishment]; so travel in the land, O believers, and behold how was the end of those who denied, the messengers, that is, how their affair ended in destruction. So do not grieve on account of their victory, I am only giving them respite until their appointed time.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Systems) with reward and forgiveness for those who repent and punishment and destruction for those who do not repent (have passed away before you) have passed in bygone nations. (Do but travel in the land and see) and reflect upon (the nature of the consequence) how the ultimate end was (for those who did deny) the messengers and did not repent of their disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَدْ خَلَتْ مِن قَبْلِكُمْ سُنَنٌ } معناهُ مَضتْ\n وسُنَنٌ: أَعْلامٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبادروا أيها المؤمنون إلى الطاعات، وداوموا على الأعمال الصالحات، ولا تغفلوا عن الله في عموم الحالات، واعلموا { قَدْ خَلَتْ } مضت { مِن قَبْلِكُمْ } في القرون الماضية { سُنَنٌ } وقائع هائلة بين الأمم الهالكة، المنهمكة في بحر الضلال والخسران، وإن أردتم أن تعتبروا منها { فَسِيرُواْ فِي ٱلأَرْضِ } أي: عالم الطبيعة أيها المفردون، السائحون في ملكوت السماوات والأرض { فَٱنْظُرُواْ } في آثارهم وأظلالهم { كَيْفَ كَانَ عَاقِبَةُ ٱلْمُكَذِّبِينَ } [آل عمران: 137] بتوحيد الله وبرسوله، المبينين له، وإذا نظرتم وتأملتم، فاعتبروا يا أولي الأبصار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}