{
  "chapter": "آل عمران",
  "text": "يايها الذين ءامنوا۟ لا تاكلوا۟ الربوا۟ اضعفا مضعفة واتقوا۟ الله لعلكم تفلحون",
  "translations": [
    {
      "translation": "You who have iman! do not feed on usury, multiplied and then remultiplied. Have taqwa of Allah so that hopefully you will be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not practice usury, charging doubled and redoubled (interest); but have fear of God: you may well attain your goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not swallow interest, doubled and redoubled, and be mindful of Allah so that you may attain true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not accept illegal interest in order to increase your wealth many times over. Have fear of God so that you will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not devour usury doubling and quadrupling it; and fear Allah, hoping that you achieve success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not consume Riba doubled and multiplied, but fear Allah that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not devour usury, making it double and redouble, and be careful of (your duty to) Allah, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, devour not usury, doubled and redoubled, and fear you God; haply so you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Devour not usury, doubling and quadrupling (the sum lent). Observe your duty to Allah, that ye may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not devour usury multiplied many times over. Fear God, so that you may prosper,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! devour not multiplied manifold; and fear usury, Allah, haply ye may fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not exact usury, twofold and severalfold, and be wary of Allah so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Devour not usury, doubled and multiplied; but fear Allah; that ye may (really) prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Eat not Riba (usury) doubled and multiplied, but fear Allah that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not consume usury, doubled and redoubled, and fear Allah, in order that you shall prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not feed on usury, compounded over and over, and fear God, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not consume usury, doubled and multiplied, but fear Allah that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:130] O you who believe, do not exact usury, twofold and severalfold (read mudā‘afatan or mud‘afatan) by increasing the amount [to be repaid] when the [loan] period comes to an end and delaying the request [of the loan]. And fear God, by abandoning such [usury], so that you may prosper, [that] you may triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O ye who believe!) i.e. Thaqif. (Devour not usury, doubling) the silver coin (and quadrupling) the appointed period for repayment. (Observe your duty to Allah) fear Allah regarding the consumption of usury, (that ye may be successful) so that you be saved from Allah's wrath and punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم خاطب سبحانه المؤمنين\n منادياً لهم بما يتعلق برسوخهم في طريق التوحيد من الخصائل الجميلة والشيم المرضية\n فقال: { يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله ورسوله\n مقتضى إيمانكم { لاَ تَأْكُلُواْ ٱلرِّبَٰواْ } سيما إذا كان { أَضْعَٰفاً مُّضَٰعَفَةً } بحيث يستغرق مال المديون مجاناً { وَٱتَّقُواْ ٱللَّهَ } المنتقم الغيور\n ولا تجاوزوا عن حدوده { لَعَلَّكُمْ تُفْلِحُونَ } [آل عمران: 130] توفوزون بامتثال مأموراته ومرضياته\n\n\n{ وَٱتَّقُواْ } أيها المؤمنون { ٱلنَّارَ ٱلَّتِيۤ أُعِدَّتْ } هُيئت { لِلْكَافِرِينَ } [آل عمران: 131] أصالة وللمقتفين إثرهم\n تبعاً\n ويعلمون معاملتهم\n استنكاراً واستكباراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الكظم هو: الكف والحبس، تقول: كظمت القربة: إذا ملأتها وسددت رأسها\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تأكلوا الربا } وتزيدوا فيها إذا حلَّ الأجل { أضعافاً مضاعفة } ، ولعل التخصيص بحسب الواقع، إذ كان الرجل يَحُلُّ أجلُ دَيْنِهِ، فيقول للمدين: إما أن تقضي وإما أن تزيد، فلا يزال يؤخره ويزيد في دينه حتى يستغرق مال المدين، فنُهوا عن ذلك\n ورغبهم في التقوى التي هي غنى الدارين\n فقال: { واتقوا الله } فيما نهيتكم عنه، { لعلك تفلحون } في الدارين\n ثم خوفهم بالنار إن لم ينتهوا، فقال: { واتقوا النار التي أعدت للكافرين } ، وفيه إشعار بأن النار موجودة إذ لا يُعدُّ المعدوم، وأنها بالذات معدة للكافرين، وبالعرض للعاصين\n قال الورتجبي: في الآية إشارة إلى أن النار لم تعد للمؤمنين، ولم تخلق لهم، ولكن خوفهم بها زجراً وعظة، كالأب البار المشفق على ولده يخوفه بالأسد والسيف، وهو لا يضربه بالسيف، ولا يلقيه إلى الأسد، فهذه الآية تلطف وشفقة على عباده\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:39",
      "similarity": 0.5962017430274648
    },
    {
      "verse": "2:278",
      "similarity": 0.5376810039678858
    },
    {
      "verse": "69:10",
      "similarity": 0.5277783529000817
    },
    {
      "verse": "4:161",
      "similarity": 0.40657897931615467
    },
    {
      "verse": "23:50",
      "similarity": 0.39720643902868275
    }
  ]
}