{
  "chapter": "آل عمران",
  "text": "الذين ينفقون فى السراء والضراء والكظمين الغيظ والعافين عن الناس والله يحب المحسنين",
  "translations": [
    {
      "translation": "Who expend both in joy and tribulation, who suppress their anger and pardon their fellowmen; and God loves those who are upright and do good,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who spend in the way of Allah both in plenty and hardship, who restrain their anger, and forgive others. Allah loves such good-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who spend their property for the cause of God in prosperity as well as in adversity and who also harness their anger and forgive the people. God loves the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend in Allah’s cause, in happiness and in grief, and who control their anger and are forgiving towards mankind; and the righteous are the beloved of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend (in Allah's cause) in prosperity and in adversity, who repress anger, and who pardon men; verily, Allah loves the Muhsinin (the good-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend (benevolently) in ease as well as in straitness, and those who restrain (their) anger and pardon men; and Allah loves the doers of good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who expend in prosperity and adversity in almsgiving, and restrain their rage, and pardon the offences of their fellowmen; and God loves the good-doers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend (of that which Allah hath given them) in ease and in adversity, those who control their wrath and are forgiving toward mankind; Allah loveth the good;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for those who spend, both in prosperity and adversity, who restrain their anger and are forgiving towards their fellow men -- God loves those who do good works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who expend in weal and woe, and the repressors of rage and the pardoners of men; and Allah loveth the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who spend in ease and adversity, and suppress their anger, and excuse [the faults of] the people, and Allah loves the virtuous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend (freely), whether in prosperity, or in adversity; who restrain anger, and pardon (all) men;- for Allah loves those who do good;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend [in Allah's Cause - deeds of charity, alms, etc.] in prosperity and in adversity, who repress anger, and who pardon men; verily, Allah loves Al-Muhsinun (the good-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who spend in prosperity and in adversity, for those who curb their anger and those who forgive people. And Allah loves the charitable\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who give in prosperity and adversity, and those who restrain anger, and those who forgive people. God loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:134] Who expend, in obedience to God, in prosperity and adversity, in [times of] ease and difficulty, and restrain their rage, [and] desist from following it up even though they are able to, and pardon their fellow-men, those who wrong them, waiving their punishment; and God loves those who are virtuous, through such actions, that is to say, He will reward them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And then He showed who they were, saying: (Those who spend (of that which Allah hath given them) in ease and in adversity) He says: those who spend their wealth in the way of Allah is times of comfort and in times of hardship, (those who control their wrath) those who check their anger, keeping their hot- temperedness to themselves (and are forgiving towards mankind) towards slaves; (Allah loveth the good) He loves those who are kind towards slaves and freemen.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك هم: { ٱلَّذِينَ يُنفِقُونَ } من طيبات ما سكبوا من رزق صوري ومعنوي للمستخقين من أهل الله، سواء كانوا { فِي السَّرَّآءِ } أي: حين الفراغة عن الشواغل العائقة عن التوجه الحقيقي { وَٱلضَّرَّآءِ } عند عروض العوارض اللاحقة عن لوازم البشر { وَٱلْكَاظِمِينَ ٱلْغَيْظَ } أي: الماسكين، الكافين غيظهم عند ثوران القوة الغضبية، وهيجان الحمية البشرية الناشئة عن مقتيضات القوى الحيوانية { وَٱلْعَافِينَ عَنِ ٱلنَّاسِ } الذين يعفون ويتركون عقوبة من يسوءهم ويظلمهم؛ لتحققهم في مقر التوحيد المسقط للإضافات والاختلافات مطلقاً { وَٱللَّهُ } المطلع لسرائر عباده { يُحِبُّ ٱلْمُحْسِنِينَ } [آل عمران: 134] منهم بجميع أنواع الإحسان، خصوصاً بكظم الغيظ والعفو عند القدرة\n\n\n\n\nوعن النبي صلى الله عليه وسلم:\n\n \" إن هؤلاء في أمتي قليل إلا من عصمه الله، وقد كانوا كثيراً في الأمم التي مضت \"\n \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ والكاظمين الغيظ } أي: الكافين عن إمضائه مع القدرة عليه، قال عليه الصلاة والسلام\n\n \" مَنْ كَظَمَ غَيْظاً وهُو يَقْدِرُ على إمْضَائِهِ مَلأَ اللهُ قَلْبَهُ أمْناً وإِيمَاناً \"\n \n\n \n\nوقال بعض الشعراء:\n\n{ والعافين عن الناس } أي: عمن ظلمهم، وعن النبيّ صلى الله عليه وسلم أنه قال عند ذلك:\n\n \" إنَّ هؤلاءِ في أُمتي قليلٌ، مَنْ عَصَمَ الله، وقد كَانُوا كثيراً في الأمم التي مَضَت \" \n\nوعَنْ أبي هريرة: أن أبا بكر كان مع النبيّ صلى الله عليه وسلم في مجلس، فجاء رجل فوقع في أبي بكر، وهو ساكت، والنبيّ صلى الله عليه وسلم يبتسم، ثم ردَّ أبو بكر بعضَ الرد، فغضب عليه الصلاة والسلام - وقام، فلحقه أبو بكر، وقال: يا رسول الله، شتمني وأنت تبتسم، ثم رَدَدْتُ عليه بعضَ ما قال، فغضبتَ وقُمتَ\n قال:\n\n \" حين كنتَ ساكتاً كان معك مَلَكٌ يردُّ عليه، فلما تكلمتَ وقع الشيطان، فلم أكُنْ لأقعدَ في مقعدْ فيه الشيطان، يا أبا بكر، ثلاثٌ حق: تعلم أنه ليس عبد يظلم مظلمة فيعفو عنها إلا أعز الله بها نصره، وليس عبد يفتح باب مسألة يريد بها كثرة إلا زاده الله قلة، وليس عبد يفتح عطية أو صلة إلا زاده الله بها كثرة \"\n \n\n{ والله يحب المحسنين } الذين أحسنوا فيما بينهم وبين الله، وفيما بينهم وبين عباد الله، و \" أل \": يحتمل أن تكون للجنس، فيعم كل محسن، أو للعهد، فتكون الإشارة إلى من تقدم ذكرهم\n  الإشارة: كل ما يُقوي مادة الحس فهو ربا لأنه يربي الحسن ويقوي مادة الغفلة، فلا ينبغي لمريد أن يضاعفه ويتعاطى أسباب تكثيره، بل ينبغي أن يفر من موارده، وهي ثلاثة: مباشرة الحس، أو الفكر فيه، أو الكلام مع أهله فيه\n والذي يقوي مادة المعنى ثلاثة: صحبة أهل المعنى، والفكرة في المعاني، وذكر الله بالقلب\n واتقوا الله في مباشرة الحسن { لعلكم تفلحون } بالوصول إلى صف المعاني، واتقوا نار القطيعة التي أعدت لمنكر الخصوصية، { وأطيعوا الله والرسول } فيما ندبكم إليه، { لعلكم ترحمون } بالوصول إلى صفة المعاني، واتقوا نار القطيعة التي أعدت لمنكر الخصوصية، { وأطيعوا الله والرسول } فيما ندبكم إليه، { لعلكم ترحمون } بإحياء قلوبكم وأرواحكم وأرواحكم بأسرار المعاني، وسارعوا إلى ما يوجب تغطية مساوءكم، حتى يغطي وصفكم بوصفه، ونعتكم بنعته، فيوصلكم بما منه إليكم، لا بما منكم إليه، فتدخلوا جنة المعارف، التي لا نهاية لفضاء شهودها، التي أعدت للمتقين السّوى، الذي يبذلون مهجهم وأموالهم في حال الجلال والجمال، { والكاظمين الغيظ } حيث ملكوا أنفسهم وأحوالهم، { والعافين عن الناس } لأن الصوفي ماله مباح ودمه هدر\n وكان بعض الصوفية يقول: إذا أردت أن تعرف حال الفقير فأغضبه، وانظر إلى ما يخرج منه\n\n\nوقال شيخ شيوخنا رضي الله عنه: قطب التصوف: لا تغضب ولا تُغضب\n هـ\n ولعروة بن الزبير - رضي الله عنه:\n\n{ والله يحب المحسنين } الذين حازوا مقام الإحسان، فعبدوا الله بالشهود والعيان، فعم إحسانهم ذا الإساءة والإحسان والإنس والجان\n قال الحسن البصري: الإحسان: أن يعم إحسانه، ولا يكون كالشمس والريح والمطر\n أي: يخص بلداً دون بلد\n وقال سفيان الثوري: ليس الإحسانُ أن تُحسنَ إلى من أحسن إليك، وإنما الإحسان أن تحسن إلى مَن أساء إليك\n فإن الإحسان إلى المحسن متاجرة كنفقد السوق، خذ مني وهَات\n وقال السري السقطي: الإحسان: أن تُحسن وقت الإمكان، فليس في كل وقت يمكنك الإحسان، وأنشدوا:\n\nوقال الورتجبي: قوله: { وسارعوا إلى مغفرة من ربكم وجنة\n\n\n } الخ، علم الحق - سبحانه - عِلَلَ الخلق وميلهم إلى مُنى النفوس، فدعاهم بطاعته إلى العلتين: المغفرة والجنة، ودعا الخاصة إلى نفسه، فقال: { ففرّوا إلى الله } ، ثم أعْلَم أن الكل في درك امتحان الجرم، وأثبت بالآية ذنب الكل، لأنهم وإن كانوا معصومين من الزلل، فذنبهم قلة معرفتهم لأقدار الحق، كما قال عليه الصلاة والسلام:\n\n \" لو أن الله عذب الملائكة لحق منه، فقيل: إنهم معصومون، فقال عليه الصلاة والسلام: من قلة معرفتهم بربهم \" \n\nولذلك دعاهم إلى المغفرة\n هـ\n قال في الحاشية: وقوله: أثبت بالآية ذنب الكل، يعني: شمول قوله: { يغفر لمن يشاء } مَنْ في السماوات الصادق بالملائكة، وإنما تكون المغفرة بعد ذنب، ولكنه في كل أحد على حسبه، وأما قوله: دعاهم إلى المغفرة، فكأنه من قوله: { سارعوا إلى مغفرة من ربكم } ، وأن الخطاب يعم من في السماوات أيضاً، وقد يتصور في حق الملائكة الاستنادُ لظواهر الأمور والاختلاف بينهم والاختصام، مما هو معرض للخطأ، وذلك من دواعي المغفرة، وكذلك القصور عن معرفة كنه جلاله الله: نقصٌ لا يخلو منه مخلوق، لاستحالة الإحاطة به علماً، ولذلك كان الترقي في المعرفة لا حد له أبداً سرمداً\n هـ\n\n",
      "translations": []
    }
  ]
}