{
  "chapter": "آل عمران",
  "text": "ولا تهنوا۟ ولا تحزنوا۟ وانتم الاعلون ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "Do not give up and do not be downhearted. You shall be uppermost if you are muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not lose heart or be grieved, for you will surely prevail if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not, then, either lose heart or grieve: for you shall surely gain the upper hand if you are true men of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be discouraged or grieved. You alone will have true dignity if you only are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be negligent nor grieve – it is you who will be victorious if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not become weak, nor be sad, and you will be triumphant if you are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not infirm, and be not grieving, and you shall have the upper hand if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Faint not, neither sorrow; you shall be the upper ones if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Faint not nor grieve, for ye will overcome them if ye are (indeed) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not become faint of heart, nor grieve, you will have the upper hand, if you are believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And faint not, nor grieve; ye shall overcome, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not weaken or grieve: you shall have the upper hand, should you be faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So lose not heart, nor fall into despair: For ye must gain mastery if ye are true in Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not become weak (against your enemy), nor be sad, and you will be superior (in victory) if you are indeed (true) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be weak, neither sorrow while you are the upper ones, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not waver, nor feel remorse. You are the superior ones, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:139] Faint not, shrink [not] from fighting the disbelievers, neither grieve, for what befell you at Uhud, for you shall prevail, through victory over them, if you are, truly, believers. (the response to this [last conditional clause] is the sum [meaning] of what has preceded it).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "71 Allah then comforted them about that which befell them on the Day of Uhud, saying: (Faint not) do not weaken in front of your enemies (nor grieve) about that which you missed of booty on the Day of Uhud, for Allah will reward you in the Hereafter, just as you should not grieve about the killings and wounds inflicted on you, (for ye will overcome them) the ultimate result will be yours through triumph and domination (if ye are (indeed) believers) that triumph and domination is from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَهِنُوا } معناهُ لاَ تَضْعُفُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd do not say {And do not be weak}. Its meaning is do not be cowardly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولا تَهنوا } في الجهاد عند استيلاء الكفار { ولا تَحزنوا } على ما فاتكم من الفتح وما جرح واستشهد من إخوانكم { وأنتُم الأعْلَون } في الرتبة لقربكم من الله وعلو درجتكم بكونكم أهل الله { إن كنتم } موحدين، لأنّ الموحد يرى ما يجري عليه من البلاء من الله فأقلّ درجاته الصبر إن لم يكن رضا يتقوّى به فلا يحظن ولا يهن { الأيام } الوقائع وكل ما يحدث من الأمور العظيمة يسمى يوماً وأياماً، كما قال تعالى:\n",
      "translations": [
        {
          "translation": "\n\nDo not be discouraged in the battle when the enemy is superior in numbers, and do not grieve over what you have lost in terms of victory or casualties. You are the superior ones in rank, due to your closeness to God and your high status in His sight. If you are truly united,,\n\nSince the monotheist sees the trials that befall him from Allah as the least of his degrees of patience, if he is not content with them, he will neither be grieved nor will he be { days } The events that occur are called a day and days.,\n\n\"As the Almighty said:\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَهِنُوا } أي: ولا تضعفوا أيها المؤمنون من متاعب مسالك الفنا { وَلاَ تَحْزَنُوا } من المكروهات التي عرضت عليكم من مقتضيات الأوصاف البشرية في النشأة الأولى { وَ } اعلموا أنكم { أَنْتُمُ } أيها المحمديون أنتم { الأَعْلَوْنَ } في دار البقاء؛ أي: المقصرون، المنحصرون على أعلى المراتب إذ لا دين ولا نبي أعلى من دينكم ونبيكم، لظهوره على التوحيد الذاتي، لذلك ختم به صلى الله عليه وسلم أمر النسخ والتبديل، وظهر سر قوله سبحانه:\n\n[ق: 29]، { إِنْ كُنْتُمْ مُّؤْمِنِينَ } [آل عمران: 139] محققين بتلك المرتبة\n\n\n\n\nآتنا من لدنك رحمة، إنك أنت الوهاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:18",
      "similarity": 0.7541043606593444
    },
    {
      "verse": "4:104",
      "similarity": 0.6867570417750857
    },
    {
      "verse": "47:35",
      "similarity": 0.41624030311602644
    },
    {
      "verse": "31:14",
      "similarity": 0.41382877259329937
    },
    {
      "verse": "3:146",
      "similarity": 0.242199993259951
    }
  ]
}