{
  "chapter": "آل عمران",
  "text": "وسارعوا۟ الى مغفرة من ربكم وجنة عرضها السموت والارض اعدت للمتقين",
  "translations": [
    {
      "translation": "Race each other to forgiveness from your Lord and a Garden as wide as the heavens and the earth, prepared for the people who have taqwa:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten for the pardon of your Lord, and for Paradise extending over the heavens and the earth, laid out for those who take heed for themselves and fear God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to the for-giveness of your Lord and to a Paradise as vast as the heavens and the earth, prepared for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten to obtain forgiveness from your Lord and to qualify yourselves for Paradise. Paradise, vast as the heavens and the earth, is prepared for the pious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rush towards forgiveness from your Lord, and towards a Paradise that can hold all the heavens and the earth in its width – prepared for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And march forth in the way (which leads to) forgiveness from your Lord, and for Paradise as wide as the heavens and the earth, prepared for the Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to forgiveness from your Lord; and a Garden, the extensiveness of which is (as) the heavens and the earth, it is prepared for those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie with one another, hastening to forgiveness from your Lord, and to a garden whose breadth is as the heavens and earth, prepared for the godfearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie one with another for forgiveness from your Lord, and for a paradise as wide as are the heavens and the earth, prepared for those who ward off (evil);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie with one another for your Lord's forgiveness and for a Paradise as vast as the heavens and the earth, which has been prepared for the God-fearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And vie with each other in hastening to obtain forgiveness from your Lord and toward the Garden whereof the width equalleth the heavens and the earth, gotten ready for the God- fearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten towards your Lord’s forgiveness and a paradise as vast as the heavens and the earth, prepared for the Godwary\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be quick in the race for forgiveness from your Lord, and for a Garden whose width is that (of the whole) of the heavens and of the earth, prepared for the righteous,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And march forth in the way (which leads to) forgiveness from your Lord, and for Paradise as wide as are the heavens and the earth, prepared for Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to a forgiveness from your Lord and a Paradise as wide as heaven and earth, prepared for the cautious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And race towards forgiveness from your Lord, and a Garden as wide as the heavens and the earth, prepared for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:133] And vie with one another hastening (read wa-sāri‘ū or [simply] sāri‘ū) to forgiveness from your Lord, and to a garden as wide as the heavens and the earth, that is, as broad as both of them together if put side by side, breadth denotes ampleness, that has been prepared for those who fear God in being obedient and abandoning acts of disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And vie one with another for forgiveness from your Lord) hasten to repent of usury and from all transgressions and reach for forgiveness from your Lord, (and for a Paradise) by means of righteous works and avoidance of usury (as wide as are the heavens and the earth) if they were to be joined to each other, (prepared) created (for those who ward off (evil)) ward off disbelief, idolatry, indecencies, and the consumption of usury;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وسارِعُوا إلى } ستر أفعالكم التي هي حجابكم عن مشاهدة أفعال الحق بأفعاله تعالى، فإنما حرمتم عن التوكل وجنة عالم المُلْك التي هي تجلي الأفعال برؤية أفعالكم، أي: إلى ما يوجب ستر أفعالكم بأفعاله، وجنّة الأفعال من الطاعات بعد كما ورد:\n\n \" أعوذ بعفوك من عقابك \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا تتكئوا، ولا تتكلوا إلى طاعاتكم وعبادتكم، ولا تزنوها عند الله، بل { سَارِعُوۤاْ } بادروا وواظبوا { إِلَىٰ } طلب { مَغْفِرَةٍ مِّن رَّبِّكُمْ } ستر ومحو لهوياتكم { وَ } وصول { جَنَّةٍ } منزل ومقر { عَرْضُهَا ٱلسَّمَٰوَٰتُ } أي: الأسماء الصفات الإلهية القائمة بذات الله { وَٱلأَرْضُ } أي: طبيعة العدم القابل لانعكاس أشعة تلك الأسماء والصفات، إنما { أُعِدَّتْ } وهُيئت { لِلْمُتَّقِينَ } [آل عمران: 133] من أهل التوحيد، وهم الذين يرفعون غشاوة الغيرية وغطاء التعامي عن نور الوجود مطلقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وسارعوا }: أي: بادروا { إلى مغفر من ربكم } كالإسلام والتوبة والإخلاص، وسائر الطاعات التي توجب المغفرة، وقرأ نافع وابن عامر بغير واو على الاستئناف\n وسارعوا أيضاً إلى { جنة عرضها السماوات والأرض } لو وصل بعضها ببعض، وذكر العرض للمباغلة في وصفها بالسعة لأنه دون الطول\n قال بعضهم: لم يُرد العَرض الذي هو ضد الطول، وإنما أراد عظمها، ومعناه: كعرض السماوات السبع والأرضين السبع في ظنكم، أي: لا تدرك ببيان\n { أُعِدّت } أي: هُيِّئَتْ { للمتقين }\n وفيه دليل على أن الجنة مخلوقة، وأنها خارجة عن هذا العالم\n ثم وصف أهلها من المتقين بأوصاف الكمال، فقال: { الذين ينفقون في السراء والضراء } أي: في حالتي الرخاء والشدة، وفي الأحوال كلها، كما هي حالة الأسخياء، قال صلى الله عليه وسلم:\n\n \" الجنَّةُ دَارُ الأسخياءِ \" \n\nوقال أيضاً:\n\n \" السَّخيُّ قريب ٌ مِنَ اللهِ، قَرِيبٌ من الجنَّةِ، قَرِيبٌ منَ النَّاس، بعيدً من النَّارِ، والبَخيلُ بَعيدٌ من الله، بَعِيدٌ مِنَ الجَنَّةِ، بَعِيدٌ، مِنَّ النَّاس، قرِيبٌ مِنَ النَّارِ، ولجَاهِلٌ سَخِيٌ أحبُّ إلى اللهِ مِنَ العالمِ البَخِيل \" \n\nوقال أيضاً صلى الله عليه وسلم:\n\n \" السّخَاء شَجَرةٌ في الجنة، أغصانُها في الدُّنيا، من تعلق بَغُصنٍ من أغْصَانِها قادَته إلى الجنَّةِ، والبخْلُ شَجرةٌ في النَّارِ، أغصَانُها في الدُّنيا، من تعلق ببعض من أغصانها قَادَته إلى النَّارِ \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:61",
      "similarity": 0.4897586411400523
    },
    {
      "verse": "57:21",
      "similarity": 0.4764182960890852
    },
    {
      "verse": "23:56",
      "similarity": 0.4762247113442734
    },
    {
      "verse": "14:51",
      "similarity": 0.4677258181598771
    },
    {
      "verse": "40:17",
      "similarity": 0.4480584807275968
    }
  ]
}