{
  "chapter": "آل عمران",
  "text": "فـاتىهم الله ثواب الدنيا وحسن ثواب الءاخرة والله يحب المحسنين",
  "translations": [
    {
      "translation": "So Allah gave them the reward in this world and the best reward in the Next World. Allah loves good- doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So God rewarded them in this world, and a better reward awaits them in the next; for God loves those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Allah granted them the reward of this world as well as a better reward of the World to Come. Allah loves those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gave them their reward in this world and the best reward of the life to come. God loves the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of this world and the best of rewards in the Hereafter; and Allah loves the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of this world, and the excellent reward of the Hereafter. And Allah loves the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of this world and better reward of the hereafter and Allah loves those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God gave them the reward of this world and the fairest reward of the world to come; and God loves the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of the world and the good reward of the Hereafter. Allah loveth those whose deeds are good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so God gave them both the rewards of this life and the excellent recompense of the life to come: God loves those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore Allah vouchsafed unto them the reward of the World, and the excellent reward of the Hereafter. And Allah loveth the well-doer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of this world and the fair reward of the Hereafter; and Allah loves the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah gave them a reward in this world, and the excellent reward of the Hereafter. For Allah Loveth those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of this world, and the excellent reward of the Hereafter. And Allah loves Al-Muhsinun (the good-doers - see the footnote of V. 3:134).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah gave them the reward of this life, and the best reward of the Everlasting Life. Allah loves the gooddoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So God gave them the reward of this world, and the excellent reward of the Hereafter. God loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah gave them the reward of this world and the good reward of the Hereafter. And Allah loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:148] And God gave them the reward of this world, victory and booty, and the fairest reward of the Hereafter, that is, Paradise (husnuhu, ‘the fairest of it’, denotes [extra] favour in addition to what is deserved); and God loves the virtuous.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So Allah gave them the reward of the world) conquest and booty (and the good reward of the Hereafter) Paradise. (Allah loveth those whose deeds are good) Allah loves believers in the act of jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أخلصوا لله، واستغفروا لذنوبهم، والتجأوا لحوله وقوته { فَآتَاهُمُ ٱللَّهُ } مجازياً لهم؛ تفضلاً وامتناناً { ثَوَابَ ٱلدُّنْيَا } من النصر والغنيمة، والفوز بالفتح، والظفر على الأعداء، والسيادة والرئاسة على الأولياء على أحيائهم { وَحُسْنَ ثَوَابِ ٱلآخِرَةِ } من المشاهدة والرضا والمكاشفة، واللقاء على شهدائهم الذين قتلوا في سبي الله، مشتشوقين إلى الفناء فيه؛ ليتحققوا ببقائه\n\n[آل عمران: 169] عن الآية، { وَٱللَّهُ } الهادي لعباده إلى فضله في معاده { يُحِبُّ ٱلْمُحْسِنِينَ } [آل عمران: 148] منهم، ويرضى عنهم، خصوصاً الذين أحسنوا في سبيل الله ببذل المهج وأعطاء الروح\n\n\n\n\nربنا اجعلنا من خدامهم وتراب أقدامهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:134",
      "similarity": 0.7047329336879278
    },
    {
      "verse": "83:36",
      "similarity": 0.6044764317876727
    },
    {
      "verse": "2:103",
      "similarity": 0.6037365488388484
    },
    {
      "verse": "74:4",
      "similarity": 0.5555767082069278
    },
    {
      "verse": "3:145",
      "similarity": 0.5147023501374486
    }
  ]
}