{
  "chapter": "آل عمران",
  "text": "ام حسبتم ان تدخلوا۟ الجنة ولما يعلم الله الذين جهدوا۟ منكم ويعلم الصبرين",
  "translations": [
    {
      "translation": "Or did you imagine that you were going to enter the Garden without Allah knowing those among you who had struggled and knowing the steadfast?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think you will go to Paradise while God does not know who among you strive and persist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you think that you would enter Paradise even though Allah has not yet seen who among you strove hard in His way and remained steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you think that you could go to Paradise before God knew which of you fought for His cause and which of you bore patience?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! You assume that you will enter Paradise while Allah has not yet tested your warriors, nor yet tested the steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you will enter Paradise before Allah knows (tests) those of you who performed Jihad and knows (tests) those who are patient\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you will enter the garden while Allah has not yet known those who strive hard from among you, and (He has not) known the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did you suppose you should enter Paradise without God know who of you have struggled and who are patient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or deemed ye that ye would enter paradise while yet Allah knoweth not those of you who really strive, nor knoweth those (of you) who are steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you suppose that you would enter the Garden, without God knowing those among you who would strive hard for His cause and endure with fortitude?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, deem ye that ye shall enter the Garden while yet Allah hath not known those of you who have striven hard nor yet known the steadfast!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you suppose that you would enter paradise, while Allah has not yet ascertained those of you who have waged jihad and He has not ascertained the steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did ye think that ye would enter Heaven without Allah testing those of you who fought hard (In His Cause) and remained steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you will enter Paradise before Allah tests those of you who fought (in His Cause) and (also) tests those who are As-Sabirin (the patient ones, etc.)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you suppose that you would enter Paradise without Allah knowing those of you who struggled and who were patient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you expect to enter Paradise, before God has distinguished those among you who strive, and before He has distinguished the steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you think that you will enter Paradise while Allah has not yet made evident those of you who fight in His cause and made evident those who are steadfast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:142] Or, nay, did you suppose you should enter Paradise without God knowing, through knowledge manifested outwardly, who among you have struggled and who are patient, in [times of] hardship?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ أم } هنا منقطعة ، هي بمعنى ( بل ) الانتقالية ، لأنّ هذا الكلام انتقال من غرض إلى آخر ، وهي إذا استعملت منقطعة تؤذن بأنّ ما بعدها استفهام ، لملازمتها للاستفهام ، حتَّى قال الزمخشري والمحقّقون : إنَّها لا تفارق الدلالة على الاستفهام بعدها ، وقال غيره : ذلك هو الغالب وقد تفارقه ، واستشهدوا على مفارقتها للاستفهام بشواهد تقبل التَّأويل .فقوله : { أم حسبتم } عطف على جملة { ولا تهنوا } \\[ آل عمران : 139 \\] وذلك أنَّهم لمّا مسّهم القرح فحزنوا واعتراهم الوهن حيث لم يشاهدوا مثل النَّصر الَّذي شاهدوه يوم بدر ، بيّن الله أنّ لا وجه للوهن للعلل الَّتي تقدّمت ، ثُمّ بيّن لهم هنا : أن دخول الجنَّة الَّذي هو مرغوبهم لا يحصل إذا لم يبذلوا نفوسهم في نصر الدّين فإذا حسبوا دخول الجنَّة يحصل دون ذلك ، فقد أخطأوا .والاستفهام المقدّر بعد ( أم ) مستعمل في التَّغليط والنَّهي ، ولذلك جاء ب ( أم ) للدلالة على التغليط : أي لا تحسبوا أن تدخلوا الجنَّة دون أن تجاهدوا وتصبروا على عواقب الجهاد .ومن المفسّرين من قدّر لِ ( أمْ ) هنا معادِلاً محذوفاً ، وجعلها متَّصلة ، فنقل الفخر عن أبي مسلم الأصفهاني أنَّه قال : عادة العرب يأتون بهذا الجنس من الاستفهام توكيداً لأنَّه لمّا قال : { ولا تهنوا ولا تحزنوا } \\[ آل عمران : 139 \\] كأنَّه قال : أفتعلمون أنّ ذلك كما تؤمرون أم حسبتم أن تدخلوا الجنَّة .وجملة { ولما يعلم الله } إلخ في موضع الحال ، وهي مصبّ الإنكار ، أي لا تحسبوا أن تدخلوا الجنَّة حين لا يعلم الله الَّذين جاهدوا .و ( لَمَّا ) حرف نفي أختُ ( لم ) إلاّ أنَّها أشدّ نفياً من ( لم ) ، لأنّ ( لم ) لِنفي قول القائل فَعَل فلان ، و ( لمّا ) لنفي قوله قد فعل فلان . قاله سيبويه ، كما قال : إنّ ( لا ) لنفي يفعل و ( لن ) لنفي سيفعل و ( ما ) لنفي لقد فعل و ( لا ) لنفي هو يفعل . فتدلّ ( لَمَّا ) على اتِّصال النَّفي بها إلى زمن التكلّم ، بخلاف ( لم ) ، ومن هذه الدلالة استفيدت دلالة أخرى وهي أنّها تؤذن بأنّ المنفي بها مترقّب الثبوت فيما يستقبل ، لأنَّها قائمة مقام قولك استمرّ النَّفي إلى الآن ، وإلى هذا ذهب الزمخشري هنا فقال : و ( لمّا ) بمعنى ( لم ) إلاّ أنّ فيها ضرباً من التوقُّع وقال في قوله تعالى : { ولما يدخل الإيمان في قلوبكم } سورة \\[ الحجرَات : 14 \\] : فيه دلالة على أنّ الأَعراب آمنوا فيما بعد .والقول في علم الله تقدّم آنفاً في الآية قبل هذه .وأريد بحالة نفي علم الله بالَّذين جاهدوا والصَّابرين الكناية عن حالة نفي الجهاد والصّبر عنهم ، لأنّ الله إذا علم شيئاً فذلك المعلوم محقّق الوقوع فكما كنّى بعلم الله عن التّحقق في قوله : { وليعلم الله الذين آمنوا } \\[ آل عمران : 140 \\] كنّى بنفي العلم عن نفي الوقوع . وشرط الكناية هنا متوفّر وهو جواز إرادة المعنى الملزوم مع المعنى اللازم لِجواز إرادة انتفاء علم الله بجهادهم مع إرادة انتفاء جهادهم .ولا يرد ما أورده التفتزاني ، وأجاب عنه بأنّ الكناية في النفي بنيت على الكناية في الإثبات ، وهو تكلّف ، إذ شأن التراكيب استقلالها في مفادها ولوازمها .وعقّب هذا النفي بقوله : { ويعلم الصابرين } معطوفاً بواو المعية فهو في معنى المفعول معه ، لتنتظم القيود بعضها مع بعض ، فيصير المعنى : أتحسبون أن تدخلوا الجنَّة في حال انتفاء علم الله بجهادكم مع انتفاء علمه بصبركم ، أي أحسبتم أن تدخلوا الجنّة ولمّا يجتمع العلمان . والجهاد يستدعي الصّبر ، لأنّ الصّبر هو سبب النَّجاح في الجهاد ، وجالب الانتصار ، وقد سئل عليّ عن الشَّجاعة ، فقال : صبر ساعة . وقال زفر بن الحارث الكلابي ، يعتذر عن انتصار أعدائهم عليهم. ... سَقَيْنَاهُمُ كأْساً سَقَوْنا بمثلهاولكنَّهم كانُوا على الموْتتِ أصبرا ... وقد تسبّب في هزيمة المسلمين يومَ أُحُد ضعفُ صبر الرماة ، وخفّتهم إلى الغنيمة ، وفي الجهاد يُتطلّب صبر المغلوب على الغلب حتَّى لا يهن ولا يستسلم .\n\n",
      "translations": [
        {
          "translation": "(Or deemed ye) do you think, group of believers (that you would enter Paradise) without fighting (while yet Allah knoweth not) has not seen (those of you who really strive) in the way of Allah on the Day of Uhud, (nor knoweth those (of you) who are steadfast?) has not see those who are steadfast in the fight against their enemies on the Day of Uhud.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أنكم مستوون عند الله في السلوك { أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ ٱلْجَنَّةَ } الوحدة الذاتية { وَلَمَّا يَعْلَمِ ٱللَّهُ } أي: لم يفرق\n ولم يميز الله بعلمه الحضري { ٱلَّذِينَ جَاهَدُواْ مِنكُمْ } في سبيله ظاهراً وباطناً\n وبذلوا جهودهم فيها إلى أن بذلوا مهجهم فتفانوا في الله حتى صاروا شهداء حضراء أمناء عند الله\n لا خوف عليهم ولا هم يحزنون عن المتقاعدين المتكاسلين { وَ } أيضاً { يَعْلَمَ } وليميز منكم { ٱلصَّابِرِينَ } [آل عمران: 142] المتمكنين في مرمى القضاء الرضا بما جرى عليهم من سهام التقدير\n بلا إقدام ولا إحجام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { يعلم الصابرين }: منصوب بأن\n على أنَّ الواو للجمع\n يقول الحقّ جلّ جلاله: { إن يمسسكم } في غزوة أحد { قرح } كقتل أو جرح\n { فقد مس القوم } من أعدائكم يوم بدر { قرح مثله } \n فإن كان قُتل منكم خمسة وسبعون يوم أحد\n فقد قتل منهم يوم بدر سبعون وأسُرَ سبعون: أو: { فقد مسّ القوم } يوم أحد { قرح } مثل ما أصابكم\n فإنكم نلتم منهم وهزمتموهم\n قبل أن تخالفوا أمر الرسول - عليه الصلاة -\n كما نالوا منكم يومئذ\n { وتلك الأيام نداولها بين الناس } أي: نُصرف دولتها بينهم\n فنديل لهؤلاء تارة ولهؤلاء أخرى\n كما قال الشاعر:\nفقد أديل المسلمون على المشركين يوم بدر\n فكانت الدولة لهم\n وأديل المشركون يوم أحد\n والمراد بالأيام: أيام الدنيا\n أو أيام النصر والغلبة\n وإنما أديل للمشركين يوم أحد ليتميز المؤمنون من المنافقين\n ويظهر علمهم للناس\n وليتخذ الله { منكم شهداء } حين ماتوا في الجهاد\n أكرمهم الله بالشهادة\n ولا تدل إدالة المشركين على أن الله يحبهم\n فإن الله { لا يحب الظالمين }\n وإنما أدلهم { ليمحص الله الذي آمنوا } أي: ليطهرهم ويصفيهم من الذنوب\n وأنما أدال المسلمين على المشركين ليمحق الكافرين ويقطع دابرهم\n والمحق: نقص الشيء قليلاً قليلاً\n ثم عاتب المسلمين فقال: { أم حسبتم } أي: ظننتم { أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم } علم ظهور\n { ويعلم الصابرين } أي: لا تظنوا أن تدخلوا الجنة كما دخلها مَنْ قُتل منكم\n ولم يقع منكم مثل ما وقع لهم من الجهاد والصبر على القتل والجرح حتى يقع العلم ظاهراً بجهادكم وصبركم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:6",
      "similarity": 0.4548815216251487
    },
    {
      "verse": "47:31",
      "similarity": 0.4448154581532169
    },
    {
      "verse": "25:52",
      "similarity": 0.437648417603665
    },
    {
      "verse": "29:69",
      "similarity": 0.42214271273080073
    },
    {
      "verse": "9:44",
      "similarity": 0.415913242530616
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003142.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003142.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:142.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}