{
  "chapter": "آل عمران",
  "text": "ان يمسسكم قرح فقد مس القوم قرح مثله وتلك الايام نداولها بين الناس وليعلم الله الذين ءامنوا۟ ويتخذ منكم شهداء والله لا يحب الظلمين",
  "translations": [
    {
      "translation": "If you have received a wound, they have already received a similar wound. We deal out such days to people turn by turn, so that Allah will know those who have iman and can gather martyrs from among you - Allah does not love wrongdoers -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you have been wounded they too have suffered a wound. We cause this alternation of night and day in the affairs of men so that God may know those who believe, taking some as witness (of truth) from your ranks, for God does not like those who are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound has befallen you a similar wound has already befallen the people who are opposed to you. We make such movements to men in turn so that Allah might mark out those who are the true men of faith and select from among you those who do really bear witness (to the Truth): for Allah does not love the wrong-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you get hurt, certainly others have also experienced injuries. We have made people pass through the different turns of history so that God would know the true believers, have some of you bear witness to the people's deeds, {God does not love the unjust}\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you have been struck by some misfortune, so they (the disbelievers) too have been struck earlier with the same misfortune; these are the days in which We have allotted turns to people; and so that Allah may make known the believers and may bestow martyrdom to some of you; and Allah does not befriend the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound has touched you, be sure a similar wound has touched the others. And so are the days, that We give to men by turns, that Allah may know (test) those who believe, and that He may take martyrs from among you. And Allah likes not the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound has afflicted you (at Ohud), a wound like it has also afflicted the (unbelieving) people; and We bring these days to men by turns, and that Allah may know those who believe and take witnesses from among you; and Allah does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound touches you, a like wound already has touched the heathen; such days We deal out in turn among men, and that God may know who are the believers, and that He may take witnesses from among you; and God loves not the evildoers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye have received a blow, the (disbelieving) people have received a blow the like thereof. These are (only) the vicissitudes which We cause to follow one another for mankind, to the end that Allah may know those who believe and may choose witnesses from among you; and Allah loveth not wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if you have suffered a wound, they too have suffered a similar wound. We bring these days to men by turns, so that God may know those who believe, and choose witnesses from among you; and God does not love the unjust,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there hath befallen you a sore, a sore like thereunto hath already befallen that people. These are the haps that We change about among man kind, that Allah may know those who believe and may take martyrs from among you and Allah loveth not the wrong doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If wounds afflict you, like wounds have already afflicted those people; and We make such vicissitudes rotate among mankind, so that Allah may ascertain those who have faith, and that He may take martyrs from among you, and Allah does not like the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound hath touched you, be sure a similar wound hath touched the others. Such days (of varying fortunes) We give to men and men by turns: that Allah may know those that believe, and that He may take to Himself from your ranks Martyr-witnesses (to Truth). And Allah loveth not those that do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound (and killing) has touched you, be sure a similar wound (and killing) has touched the others. And so are the days (good and not so good), We give to men by turns, that Allah may test those who believe, and that He may take martyrs from among you. And Allah likes not the Zalimun (polytheists and wrong-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound touches you, a similar wound already has touched the nation. Such days We alternate between the people so that Allah knows those who believe, and that He will take witnesses from among you, for Allah does not love the harmdoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound afflicts you, a similar wound has afflicted the others. Such days We alternate between the people, that God may know those who believe, and take martyrs from among you. God does not love the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wound should touch you - there has already touched the [opposing] people a wound similar to it. And these days [of varying conditions] We alternate among the people so that Allah may make evident those who believe and [may] take to Himself from among you martyrs - and Allah does not like the wrongdoers -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:140] If a wound touches you, befalls you at Uhud, a like wound (qarh or qurh, which is the exhaustion that results from a wound and the like), already, at Badr, has touched the other people, the disbelievers. Such days We deal out in turn, We dispense them, among mankind, one day for one group, the next day for another, that they might be admonished, and that God may know, through knowledge manifested outwardly, those who believe, who are sincere in their faith from others; and that He may take witnesses from among you, honouring them with martyrdom, and God loves not the evildoers, the disbelievers, that is, He will chastise them, and the blessings He bestows upon them are only a [means of] drawing out [their punishment].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If ye have received a blow) if you were harmed on the Day of Uhud, (the (disbelieving) people) the people of Mecca (have received) on the Day of Badr (a blow) harm (the like thereof) like the harm you received on the Day of Uhud: (These are (only) the vicissitudes) the days of the life of this world (which We cause to follow one another for mankind) sometimes the believers have the upper hand over the unbelievers and sometimes it is the unbelievers who have the upper hand over the believers, (to the end that Allah may know) that He may see (those who believe) at the time of jihad (and may choose witnesses from among you) He honours whom He wills among you with martyrdom; (and Allah loveth not wrong-doers) He loves not the idolaters, their religion or their domination.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن يَمْسَسْكُمْ قَرْحٌ } قالَ: القَرحُ: الجِرَاحُ والقَتلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - the Most High - \"If you are afflicted with a wound,\" He said: \"The wound is the injury and the killing.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n لأنّ الموحد يرى ما يجري عليه من البلاء من الله فأقلّ درجاته الصبر إن لم يكن رضا يتقوّى به فلا يحظن ولا يهن { الأيام } الوقائع وكل ما يحدث من الأمور العظيمة يسمى يوماً وأياماً\n كما قال تعالى:\n[إبراهيم\n الآية: 5] وقد مرّ تفسير { وليعلم الله } من ظهور العلم التفصيلي التابع لوقوع المعلوم\n { ويتخذ مِنكم شُهداء } الذين يشهدون للحق فيذهلون عن أنفسهم\n أي: نداول الوقائع بين الناس لأمور شتى وحِكَم كثيرة\n غير مذكورة\n من خروج ما في استعدادهم إلى الفعل من الصبر والجلد وقوّة اليقين\n وقلّة المبالاة بالنفس\n واستيلاء القلب عليها\n وقمعها وغير ذلك\n ولهذين العلتين المذكورتين ولتخليص المؤمنين من الذنوب والغواشي التي تبعدهم من الله بالعقوبة والبليّة إذا كانت عليهم\n ومحق الكافرين وقهرهم وتدميرهم إذا كانت لهم\n وقد اعترض بين العلل قوله: { والله لا يحب الظالمينَ } ليعلم أنّ من ليس على صفة الإيمان والشهادة وتمحيص الذنوب وقوّة الثبات لكمال اليقين\n بل حضر القتال لطلب الغنيمة أو لغرض آخر فهو ظالم والله لا يحبه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِن يَمْسَسْكُمْ } ويصبكم أيها المجاهدون في سبيل الله\n لإعلاء كلمته { قَرْحٌ } ضيق ومشقة من أعداء الله يوم أُحد\n لا تبالوا به ولا تضعفوا بسببه\n ولكم أن تذكروا يوم بدر { فَقَدْ مَسَّ ٱلْقَوْمَ } العدو { قَرْحٌ مِّثْلُهُ } بل أشد من ذلك\n ومع ذلك لم يضعفوا ولم يجنبوا\n مع كونهم ساعين على الباطل\n وأنتم أحقاء بألاَّ تجبنوا ولا تشعفوا\n لكونكم مجاهدين في طريق الحق\n ساعين لترويجه { وَ } اعلموا أن { تِلْكَ ٱلأَيَّامُ } أي: أيام النصر والظفر والقرح والغنيمة أيام وأزمان { نُدَاوِلُهَا بَيْنَ } جميع { ٱلنَّاسِ } محقهم ومبطلهم\n مؤمنهم وكافرهم\n ليعلموا أنهم جميعاً تحت حيطة أوصافنا الجمالية والجلالية\n واللطفية والقهرية\n\n\n{ وَلِيَعْلَمَ ٱللَّهُ } أي: ينبه ويرشد خصوصاً { ٱلَّذِينَ آمَنُواْ } بتوحيد الله بأمورهم على الجهاد طريق الفناء فيه\n ليفوزوا بشرف بقائه { وَ } لذلك { يَتَّخِذَ مِنكُمْ } أيها المؤمنون { شُهَدَآءَ } واصلين\n أحياء دائمين { وَٱللَّهُ } المتوحد بذاته { لاَ يُحِبُّ ٱلظَّالِمِينَ } [آل عمران: 140] المتجاوزين عن طريق توحيده المائلين عن صراطه المستقيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: القرح - بالفتح والضم -: الجرح\n وقيل: بالفتح: الجرح\n وبالضم: ألمه ووجعه\n والمداولة: المفاعلة من الدولة\n وهي الغلبة\n و { الأيام }: نعت أو خبر\n و { نداولها }: خبر أو حال\n و { ليعلم }: متعلق بمحذوف\n أي: وفعل ما فعل من الادالة ليعلم\n أو عطف على علة محذوفة\n أي: نداولها ليكون كيت وكيت\n وليعلم\n\n\n الخ\n إيذاناً بأن العلة فيه غير واحدة\n وأن ما يصيب المؤمن: فيه من المصالح ما لا يُعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:172",
      "similarity": 0.6085082117149541
    },
    {
      "verse": "59:7",
      "similarity": 0.5009200608880098
    },
    {
      "verse": "2:80",
      "similarity": 0.046263629845469154
    },
    {
      "verse": "7:73",
      "similarity": 0.04585955222268534
    },
    {
      "verse": "26:156",
      "similarity": 0.04554277579078786
    }
  ]
}