{
  "chapter": "آل عمران",
  "text": "وكاين من نبى قتل معه ربيون كثير فما وهنوا۟ لما اصابهم فى سبيل الله وما ضعفوا۟ وما استكانوا۟ والله يحب الصبرين",
  "translations": [
    {
      "translation": "Many a Prophet has been killed, when there were many thousands with him! They did not give up in the face of what assailed them in the Way of Allah, nor did they weaken, nor did they yield. Allah loves the steadfast.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many a seeker after God has fought in the way of God by the side of many an apostle, undaunted (by disaster), and did not disgrace themselves; -- verily God loves those who are steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many were the Prophets on whose side a large number of God-devoted men fought: they neither lost heart for all they had to suffer in the way of Allah nor did they weaken nor did they abase themselves. Allah loves such steadfast ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many godly people fought to help the Prophets in the cause of God. They did not lose courage, show weakness, or give in when facing hardships in their fight for the cause of God. God loves those who have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many Prophets have fought in Allah’s cause – and many devoted men were with them; so neither did they lose heart due to the calamities that befell them in Allah's cause, nor did they weaken and nor were they subdued; and the steadfast are the beloved of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a Prophet fought and along with him many Ribbiyyun. But they never lost heart for that which befall them in Allah's way, nor did nor they weaken nor degrade themselves. And Allah loves the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a prophet has fought with whom were many worshippers of the Lord; so they did not become weak-hearted on account of what befell them in Allah's way, nor did they weaken, nor did they abase themselves; and Allah loves the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many a Prophet there has been, with whom thousands manifold have fought, and they fainted not for what smote them in God's way, neither weakened, nor did they humble themselves; and God loves the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with how many a prophet have there been a number of devoted men who fought (beside him). They quailed not for aught that befell them in the way of Allah, nor did they weaken, nor were they brought low. Allah loveth the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a prophet has fought with many devout men alongside him! They did not lose heart, despite all that they had to suffer in God's path. They neither weakened nor yielded. God loves the patient!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a prophet hath fought With a number of godly men beside him. They fainted not for aught that befell them in the way of Allah, nor they weakened, nor they humbled themselves; and Allah loveth the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a prophet there has been with whom a multitude of godly men fought. They did not falter for what befell them in the way of Allah, neither did they weaken, nor did they abase themselves; and Allah loves the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many of the prophets fought (in Allah's way), and with them (fought) Large bands of godly men? but they never lost heart if they met with disaster in Allah's way, nor did they weaken (in will) nor give in. And Allah Loves those who are firm and steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a Prophet (i.e. many from amongst the Prophets) fought (in Allah's Cause) and along with him (fought) large bands of religious learned men. But they never lost heart for that which did befall them in Allah's Way, nor did they weaken nor degrade themselves. And Allah loves As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has been many a Prophet with whom many of the Lord have fought and they did not faint when they were smitten in the way of Allah, neither did they weaken, nor did they humble themselves, and Allah loves the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a prophet fought alongside him numerous godly people? They did not waver for what afflicted them in the cause of God, nor did they weaken, nor did they give in. God loves those who endure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a prophet [fought and] with him fought many religious scholars. But they never lost assurance due to what afflicted them in the cause of Allah, nor did they weaken or submit. And Allah loves the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:146] How many a prophet has been killed (qutila, a variant reading has qātala, ‘has fought’, the subject of the verb being the person governing it) and with him (ma‘ahu, the predicate, the subject of which [follows]) thousands manifold [fought], but they fainted not, they did [not] shrink, in the face of what afflicted them in God’s way, of wounds and the slaying of their prophets and companions; they neither weakened, in the face of struggle, nor did they humble themselves, [nor did they] succumb to their enemy, as you did when it was said that the Prophet (s) had been killed. And God loves the patient, during trials, meaning that He will reward them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "72 (And with how many a prophet have there been a number of devoted men who fought (beside him)) against scores of unbelievers. (They quailed not) the believers did not weaken (for aught that befell them in the way of Allah) in terms of death and injury; it is also said that this means: how many prophets were killed alongside scores of believers, but the believers did not weaken due to that which befell them in the way of Allah-the killing of their prophets-in obedience of Allah, (nor did they weaken) they did not lack strength to fight their enemies, (nor were they brought low) they did not abase themselves before their enemy; it is also said that this means: they did not surrender to their enemy. (Allah loveth the steadfast) in fighting their enemy alongside their Prophet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رِبِّيُّونَ كَثِيرٌ } معناه أُلوفٌ وجَماعَاتٌ\n والواحدُ رِبّي\n ويقالُ: عُلَماءٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - Exalted is He - {Rabbiyyoona katheerun}: many Lords.\n\n\nAnd my one and only God is my Lord.\n The scholars are said:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لترويج توحيده { قَاتَلَ مَعَهُ رِبِّيُّونَ } ربانيون مخلصون { كَثِيرٌ } منهم قتلوا وأصيبوا { فَمَا وَهَنُواْ } وما جبنوا { لِمَآ أَصَابَهُمْ } من القرْح { فِي سَبِيلِ ٱللَّهِ } لإعلاء دينه { وَمَا ضَعُفُواْ } من محاربة أعداء الله { وَمَا ٱسْتَكَانُواْ } وتضرعوا إليهم\n استبقاءً واستخلافاً\n بل كانوا كرَّارين جرَّارين\n بحيث لا يرى عليهم أمارات الجبن والخوف أصلاً\n صابرين على ما أصابهم من القرْح والجرح\n وقتل الأقارب والعشائر { وَٱللَّهُ } الهادي لعباده إلى توحيده { يُحِبُّ ٱلصَّابِرِينَ } [آل عمران: 146] منهم في البلوى\n والطائرين شوقاً إلى المولى\n الراضين بما يحب له ويرضى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كأَيِّن }: أصله: أيْ\n دخلت الكاف عليها وصارت بمعنى { كم } \n وأثبت التنوين نوناً على غير قياس\n وقرأ ابن كثير\n { وكائن } \n على وزن فاعل\n ووجهه: أنه قلب الياء قبل الهمزة فصار: كيَاءٍ\n تحركت الياء وانفتح ما قبلها فصار كائن\n وهما لغتان\n وقد جمع الشاعر بينهما في بيت\n فقال:\nو { الرِبِّيون }: جمع رُبَّة\n أي: الفرقة\n أي: معه جموع كثيرة\n وقيل: العلماء الأتقياء\n وقيل: الولاة\n وهو: إما مبتدأ فيوقف على { قُتل } \n أو نائب فاعل { قُتل } \n أو فاعل على من قرأ بالبناء له\n و { كثير }: نعت له\n كقوله:\n[التّحْريم: 4] لأن فعيلاً يخبر به عن المفرد والجمع\n يقول الحقّ جلّ جلاله: { وكأين } وكم { من نبي قتل } في المعركة ومعه جموع كثيرة\n أو ربانيون علماء أتقياء\n فلم يفشلوا ولم يضعفوا\n بل ثبتوا على دينهم وجهاد عدوهم\n أو يقول: كثير من الأنبياء قتل معهم ربانيون كثير\n أي: ماتوا في الحرب فثبت الباقون\n ولم يفتروا ولم يضعفوا عن عدوهم\n ويترجح الأول بما صرَخَ به الصارخ يوم أحد: إن محمداً قد مات\n فضرب لهم المثل بقوله: { وكأين من نبي قُتل } \n ويترجح الثاني بأنه لم يقتل نبيّ قط في المحاربة\n أو: { وكأين من نبيّ قاتل } أي: جاهد معه { ربِّيون كثير } \n وبعدما قتل نبيهم أو جموعهم { فما وهنوا لما أصابهم في سبيل الله } أي: فما فتروا: ولم ينكسر جندهم لأجل ما أصابهم من قتل نبيهم أو بعضهم\n { وما ضعفوا } عن جهاد عدوهم ولا عن دينهم\n { وما استكانوا } أي: خضعوا لعدوهم\n من السكون لأن الخاضع يسكن لعدوه يفعل به ما يريد\n فالألف إشباع زائد\n أي: فما سكنوا لعدوهم بل صبروا له\n { والله يحب الصابرين } فينصرهم ويعزهم ويُعظم قدرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:76",
      "similarity": 0.667652773278008
    },
    {
      "verse": "12:105",
      "similarity": 0.2704388731912796
    },
    {
      "verse": "47:13",
      "similarity": 0.26276900797910224
    },
    {
      "verse": "29:60",
      "similarity": 0.251019135068342
    },
    {
      "verse": "8:18",
      "similarity": 0.24444773306966794
    }
  ]
}