{
  "chapter": "آل عمران",
  "text": "وما كان لنفس ان تموت الا باذن الله كتبا مؤجلا ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الءاخرة نؤته منها وسنجزى الشكرين",
  "translations": [
    {
      "translation": "No self can die except with Allah's permission, at a predetermined time. If anyone desires the reward in this world, We will give him some of it. If anyone desires the reward in the Next World, We will give him some of it. We will recompense the thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can die before his appointed term except in accordance with the law of God. And to him who desires a reward in this world, We shall give it; and to him who desires a reward in the life to come, We shall do that. We shall certainly reward those who are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not given to any soul to die except with the leave of Allah, and at an appointed time. And he who desires his reward in this world, We shall grant him the reward of this world; and he who desires the reward of the Other World, We shall grant him the reward of the Other World. And soon shall We reward the ones who are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can die without the permission of God. This is a written decree of the appointed term for life. We shall give worldly gains to whoever wants them. Those who want rewards in the life hereafter will also receive them. We reward those who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no soul can die except by Allah’s command – a time has been appointed for each; whoever desires the rewards of this world, We bestow upon him from it; and whoever desires the reward of the Hereafter, We bestow upon him from it; and We shall soon reward the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no person can ever die except by Allah's leave and at an appointed term. And whoever desires a reward in the world, We shall give him of it; and whoever desires a reward in the Hereafter, We shall give him thereof. And We shall reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a soul will not die but with the permission of Allah the term is fixed; and whoever desires the reward of this world, I shall give him of it, and whoever desires the reward of the hereafter I shall give him of it, and I will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not given to any soul to die, save by the leave of God, at an appointed time. Whoso desires the reward of this world, We will give him of this; and whoso desires the reward of the other world, We will give him of that; and We will recompense the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul can ever die except by Allah's leave and at a term appointed. Whoso desireth the reward of the world, We bestow on him thereof; and whoso desireth the reward of the Hereafter, We bestow on him thereof. We shall reward the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul shall die except with God's permission and at an appointed time. And if one desires the rewards of this world, We shall grant it to him; and if one desires the rewards of the life to come, We shall grant it to him. We will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not Possible for any person to die except by Allah's command at a term recorded. And whosoever desireth the reward of the world, We vouchsafe unto him thereof. and whosoever desireth the reward of the Hereafter, We vouchsafe unto him thereof. And anon will we recompense the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul may die except by Allah’s leave, at an appointed time. Whoever desires the reward of this world, We will give him of it; and whoever desires the reward of the Hereafter, We will give him of it; and soon We will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can a soul die except by Allah's leave, the term being fixed as by writing. If any do desire a reward in this life, We shall give it to him; and if any do desire a reward in the Hereafter, We shall give it to him. And swiftly shall We reward those that (serve us with) gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no person can ever die except by Allah's Leave and at an appointed term. And whoever desires a reward in (this) world, We shall give him of it; and whoever desires a reward in the Hereafter, We shall give him thereof. And We shall reward the grateful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any soul to die except by the permission of Allah a postponed book and he who desires the reward of this world, We shall give him of it, and he who desires the reward of the Everlasting Life, We shall give him of it. And We will recompense the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul can die except by God’s leave, at a predetermined time. Whoever desires the reward of the world, We will give him some of it; and whoever desires the reward of the Hereafter, We will give him some of it; and We will reward the appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not [possible] for one to die except by permission of Allah at a decree determined. And whoever desires the reward of this world - We will give him thereof; and whoever desires the reward of the Hereafter - We will give him thereof. And we will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:145] It is not for any soul to die, save by the leave of God, by His decree, a prescribed (kitāban, here a verbal noun, that is, God has prescribed this) term, that is to say, [a term fixed] in time, neither brought forward nor deferred, so why did you retreat [in defeat]? Defeat does not ward off death, nor does standing one’s ground sever life. And whoever desires, by his deeds, the reward of this world, that is, his requital in it, We will give him of it, what has been alloted to him, but he shall have no share in the Hereafter; and whoever desires the reward of the Hereafter, We will give him of it, that is, of its reward; and We will requite the thankful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(No soul can ever die except by Allah's leave) except by Allah's will and decree (and at a term appointed) a man's lifespan and sustenance are both registered at an appointed term, and none shall take place before its due time. (Whoso desireth) with his works and jihad (the reward of the world) the benefit of this worldly life, (We bestow on him thereof) We shall give him from this worldly life what he desires but he does not have any share in the Hereafter; (and whoso desireth) with his works and jihad (the reward of the Hereafter) the benefit of the Hereafter, (We bestow on him thereof) We shall give him of the Hereafter what he desires. (We shall reward the thankful) reward the believers for their faith and jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كان لنفس أن تموت إلا بإذن الله كتاباً مؤجلاً } فمن كان موقناً شاهد هذا المعنى\n فكان من أشجع الناس كما حكى حاتم بن الأصمّ عن نفسه أنه شهد مع الشقيق البلخي رحمهما الله\n بعض غزوات خراسان\n قال: فلقيني شقيق وقد حمى الحرب\n فقال: كيف تجد قلبك يا حاتم؟ قلت: كما كان ليلة الزفاف\n بين الحالين\n فوضع سلاحه وقال: أما أنا فهكذا\n ووضع رأسه على ترسه ونام بين المعركة حتى سمعت غطيطه\n وهذا غاية في سكون القلب إلى الله ووثوقه به لقوة اليقين { سنلقي في قلوب الذين كفروا الرعب } الآية\n جعل إلقاء الرعب في قلوب الكفار مسبباً عن شركهم\n لأن الشجاعة وسائر الفضائل اعتدالات في قوى النفس من وقوع ظل الوحدة عليها عند تنوّرها بنور القلب المنوّر بنور الوحدة\n فلا تكون تامة حقيقة إلا للموحد الموقن في توحيده\n وأما المشرك فلأنه محجوب عن منبع القوة والقدرة بما أشرك بالله من الموجود المشوب بالعدم لإمكانه الخفيّ الوجود\n الضعيف\n الذي لم يكن له بحسب نفسه قوة ولا وجود ولا ذات في الحقيقة\n ولم ينزل الله بوجوده حجة لوجوده أصلاً لتحقق عدمه بحسب ذاته\n فليس له إلا العجز والجبن وجميع الرذائل\n إذ لا يكون أقوى من معبوده وإن اتفقت له دولة أو صولة أو شوكة فشيء لا أصل له ولا ثبات ولا بقاء كنار العرفج مثلما كانت دولة المشركين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المؤمنون بقضاء الله وقدره { مَا كَانَ لِنَفْسٍ } من النفوس الخيرة والشريرة { أَنْ تَمُوتَ } بقتل أو حتف أنفه { إِلاَّ بِإِذْنِ ٱللهِ } بتقديره ومشيئته\n الثابت المثبت في قضائه\n السابق له { كِتَٰباً } جامعاً بجميع ما يجري عليه في عالم الشهادة\n حياته وموته ورزقه { مُّؤَجَّلاً } بوقت معين لا يتأخر عنه ولا يتقدم { وَمَن يُرِدْ } منكم { ثَوَابَ ٱلدُّنْيَا } التي هي أدنى مرتبة الإنسان\n وأنزل منزلته من المفاخرة بالمال والجاه والحسب والنسب { نُؤْتِهِ } نعطه { مِنْهَا } مقدار ما يقدر لنا في سابق علمنا\n ونحاسبه عليها في يوم الجزاء في النشأة الأخرى\n\n\n{ وَمَن يُرِدْ } منكم { ثَوَابَ ٱلآخِرَةِ } من الحقائق والمعارف والمواهب العلية التي هي المقصد الأقصى\n والمطلب الأعلى من وجوده { نُؤْتِهِ مِنْهَا } مقدار ما يقتضي استعداده الفطري { وَ } اعلموا أيها المؤمنون { سَنَجْزِي } بفضلنا وجودنا بلا وساطة ووسائل { ٱلشَّٰكِرِينَ } [آل عمران: 145] المنسلخين عن الإرادة\n بل عن جميع الأمور المرادة\n الراضين بما قسم لهم\n وقدر عليهم في سابق علمنا بروضة الرضا وجنة التسليم\n\n\n{ وَكَأَيِّن مِّن نَّبِيٍّ } يجاهد في سبيل الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كتاباً }: مصدر\n أي: كتب الموت كتاباً مؤجلاً\n يقول الحقّ جلّ جلاله: { وما محمد إلا رسول } يصيبه ما أصابهم\n { قد } مضت { من قبله الرسل } \n فسيمضي كما مضوا بالموت أو القتل\n { أفإن مات أو قتل انقلبتم على أعقابكم } بعد تقرر شريعته وظهور براهينه\n عاتبهم على تقدير أن لو صار منهم انقلاب لو مات صلى الله عليه وسلم أو قتل\n أو على صدر من بعض المنافقين وهم ساكتون\n قال أصحاب المغازي: خرج النبيّ صلى الله عليه وسلم حتى نزل بالشعب من أحُد\n في سبعمائة رجل\n وأمَّر عبدَ الله بنَ جبيرٍ على الرماة\n وهم خمسون رجلاً\n وقال: انضحوا عنا بالنبل\n لا يأتونا نم خلقنا\n لا تبرحوا مكانكم كانت لنا أو علينا\n فإنا لن نزال غالبين ما ثبتُّم مكانكم\n فجاءت قريش\n وعلى ميمنتهم خالد بن الوليد\n وعلى ميسرتهم عكرمة\n ومعهم النساء\n ثم انتشب القتال فقال عليه الصلاة والسلام:\n \" مَنْ يأخذ هذا السيف بحقه؟ \" \nفجاء رجال فمنعهم\n حتى جاء أبو دُجانة\n فقال: وما حقه يا رسول الله؟ قال:\n \" تضرب به العدو حتى ينحني \" \n\n وكان رجلاً شجاعاً يختال عند الحرب\n فأخذه واعتم بعمامة حمراء\n وجعل يتبختر بين الصفين\n فقال عليه الصلاة والسلام:\n \" إنها لمشيةٌ يبغضها الله إلاّ في هذا الموضع \"\n \nثم حمل النبيّ صلى الله عليه وسلم على المشركين فهزموهم\n قال الزبير: فرأيت هنداً وصواحبها هارباتٍ مصعدات في الجبل\n فلما نظر الرماة إلى القوم قك انكشفوا\n قالوا: الغنيمة الغنيمة فقال لهم بعضهم: لا تتركوا أمر النبيّ صلى الله عليه وسلم فقال يلتفتوا\n وانطلق عامتهم\n فلما رأى خالد قلة الرماة\n صاح في خيله من المشركين\n ثم حمل على أصحاب النبي صلى الله عليه وسلم من خلفهم\n وقتل عبد الله بن جبير\n واختلط الناس\n فقتل بعضُهم بعضاً\n ورمى عبدُ الله بن قمئة الحارثي رسولَ الله صلى الله عليه وسلم بحجر\n فكسر أنفه ورباعيته\n وشجَّه في وجهه\n وكسر البيضة على رأسه\n فذبَّ عنه مصعبُ بن عمير\n وكان صاحب الراية\n فقتله ابن قمئة وهو يرى أنه قتل النبيّ صلى الله عليه وسلمن فرجع إلى قومه\n وقال: قد قتلت محمداً\n وصرخ صارخ: ألا إنَّ محمداً قد مات\n وقيل: إنه الشيطان\n فانكفأ الناس\n وجعل الرسول - عليه الصلاة والسلام - يدعو:\n \" إليَّ عباد الله \" \n\n فانحاز إليه ثلاثون من الصحابة\n وضموه حتى كشفوا عنه المشركين\n وأصيبت يد طلحة بن عبيد الله فيبست\n حتى وقَى بها النبيّ صلى الله عليه وسلم\n وأصيبت عين قتادة بن النعمان\n حتى وقعت على وجنتيه\n فردها النبيّ صلى الله عليه وسلم مكانها\n فعادت أحسن مما كانت\n\nوفشا في الناس أن رسول الله صلى الله عليه وسلم مات - فقال بعض المسلمين: ليت ابنُ أُبي يأخذ لنا أماناً من أبي سفيان\n وقال بعض المنافقين: لو كان نبيّاً ما قتل\n ارجعوا إلى دينكم الأول\n فقال أنس بن النضر - عمُّ أنس بن مالك: إن كان قد قتل محمدٌ فَإِنَّ رب محمد لا يموت\n وما تصنعون بالحياة بعده؟ فقاتلوا على ما قاتل عليه\n حتى تمتوا على ما مات عليه\n ثم قال: اللهم إني أعتذر إليك ما صنع هؤلاء - يعني المسلمين - وأبرأ إليك مما صنع هؤلاء - يعني الكفار-\n ثم شدّ سيفه وقاتل حتى قُتل\n رحمة الله عليه\n فأنزل فيما قال المنافقون: { ومن ينقلب على عقبيه } بارتداده { فلن يضر الله شيئاً } وإنما يضر نفسه\n { وسيجزي الله الشاكرين } على نعمة الإسلام بالثبات عليه\n كأنس وأضرابه\n { وما كان } ينبغي { لنفس أن تموت إلا بإذن الله } أي: بإرادته ومشيئته\n أو بإذنه لملكٍ في قبض روحه\n والمعنى: أنَّ لكل نفس أجلاً مسمى في علمه تعالى وقضائه\n لا تستأخر عنه ساعة ولا تستقدم\n بالتأخر عن القتال ولا بالإقدام عليه\n وفيه تشجيعهم على القتال ووعد للرسول بحفظه وتأخر أجله فإن الله تعالى كتب أجل الموت { كتاباً مؤجلاً } مؤقتاً لا يتقدم ولا يتأخر\n ونزل في الرماة الذين خالفوا المركز للغنيمة: { ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الآخرة نؤتها منها } الجزاء الجليل\n { وسنجزي الشاكرين } الذين كروا نعم الله\n فلم يشغلهم شيء عن الجهاد في سبيل الله\n بل كان همهم رضي الله ورسوله دون شيء سواه\n الإشارة: ينبغي للمريد أن يستغني بالله\n فلا يركن إلى شيء سواه\n وتكون بصيرته نافذة حتى يغيب عن الواسطة بشهود الموسوط\n فإن مات شيخه لم ينقلب على عقبيه\n فإن تمكن من الشهود فقد استغنى عن كل موجود\n وإن لم يتمكن نظر من يكمله\n فالوقوف من الوسائط وقوف مع النعم دون شهود المنعم\n فلا يكون شاكراً للمْنعم حتى لا يحجبه عنه شيء\n ولما مات - عليه الصلاة والسلام - دهشت الناس\n وتحيّرت لوقوفهم مع شهود النعمة\n إلاَّ الصدِّيق كان نفذ من شهود النعمة إلى شهود المُنعم\n فخطب حينئذٍ على الناس\n وقال: مَنْ كانَ يَعْبُدُ مُحَمَّداً فإن مُحَمَّداً قَدْ ماتَ\n ومَنْ كَانَ يَعْبُدُ اللَّهَ فإنَّ اللّهَ حَيٌ لاَ يَمُوتِ\n ثم قرأ: { وما محمد إلا رسول\n\n\n } إلى قوله: { وسنجزي الشاكرين } \n وهم الذين نفذوا إلى شهود المنعم\n ولم يقفوا مع النعمة\n ودخل بعض العارفين على بعض الفقراء فوجده يبكي\n فقال له: ما يبكيك؟ قال: مات أستاذي\n فقال له العارف: ولم جعلت أستاذك يموت؟ وهلا جعلته حيّاً لا يمت\n فنبهه على نفاذ بصيرته إلى شهود المنعم دون الوقوف مع النعمة\n فالشيخ الحقيقي هو الذي يغني صاحبه عنه وعن غيره\n بالدلالة على ربه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:134",
      "similarity": 0.5593899017004142
    },
    {
      "verse": "3:148",
      "similarity": 0.5147023501374486
    },
    {
      "verse": "2:103",
      "similarity": 0.4256994477371191
    },
    {
      "verse": "83:36",
      "similarity": 0.41167557310633224
    },
    {
      "verse": "5:85",
      "similarity": 0.4003273141768798
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003145.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003145.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:145.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}