{
  "chapter": "آل عمران",
  "text": "وما محمد الا رسول قد خلت من قبله الرسل افاي۟ن مات او قتل انقلبتم على اعقبكم ومن ينقلب على عقبيه فلن يضر الله شيـا وسيجزى الله الشكرين",
  "translations": [
    {
      "translation": "Muhammad is only a Messenger and he has been preceded by other Messengers. If he were to die or be killed, would you turn on your heels? Those who turn on their heels do not harm Allah in any way. Allah will recompense the thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is only a messenger; and many a messenger has gone before him. So what if he dies or is killed! Will you turn back and go away in haste? But he who turns back and goes away in haste will do no harm to God. But God will reward those who give thanks (and are grateful).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is no more than a Messenger, and Messengers have passed away before him. If, then, he were to die or be slain will you turn about on your heels? Whoever turns about on his heels can in no way harm Allah. As for the grateful ones, Allah will soon reward them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is only a Messenger. There lived other Messengers before him. Should (Muhammad) die or be slain, would you then turn back to your pre-Islamic behavior? Whoever does so can cause no harm to God. God will reward those who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Mohammed (peace and blessings be upon him) is purely* a Noble Messenger; there have been Noble Messengers before him; so if he departs or is martyred, will you turn back on your heels? So whoever turns back on his heels does not cause any harm to Allah; and Allah will soon reward the thankful. (* Neither God nor an angel, but a human being with the highest spiritual status.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is no more than a Messenger, and indeed Messengers have passed away before him. If he dies or is killed, will you then turn back on your heels And he who turns back on his heels, not the least harm will he do to Allah; and Allah will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Muhammad is no more than an apostle; the apostles have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is naught but a Messenger; Messengers have passed away before him. Why, if he should die or is slain, will you turn about on your heels? If any man should turn about on his heels, he will not harm God in any way; and God will recompense the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is but a messenger, messengers (the like of whom) have passed away before him. Will it be that, when he dieth or is slain, ye will turn back on your heels? He who turneth back on his heels doth no hurt to Allah, and Allah will reward the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is only a messenger. Messengers have passed away before him. If he should die, or be killed, will you turn back on your heels? Those who turn on their heels do not harm the Lord in the least. God will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Muhammad is naught but an apostle; apostles have surely passed away before him. Will ye then, if he dieth or be slain, turn round on your heels! And whosoever turnoth round on his heels, hurteth not Allah at all. And anon shall Allah recompense the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is but an apostle; [other] apostles have passed before him. If he dies or is slain, will you turn back on your heels? Anyone who turns back on his heels, will not harm Allah in the least, and soon Allah will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is no more than a messenger: many Were the messenger that passed away before him. If he died or were slain, will ye then Turn back on your heels? If any did turn back on his heels, not the least harm will he do to Allah; but Allah (on the other hand) will swiftly reward those who (serve Him) with gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad (SAW) is no more than a Messenger, and indeed (many) Messengers have passed away before him. If he dies or is killed, will you then turn back on your heels (as disbelievers)? And he who turns back on his heels, not the least harm will he do to Allah, and Allah will give reward to those who are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not except a Messenger; Messengers have passed away before him. If he dies or is killed, will you turn about on your heels? And he who turns on his heels will not harm Allah a thing. Allah will recompense the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is no more than a messenger. Messengers have passed on before him. If he dies or gets killed, will you turn on your heels? He who turns on his heels will not harm God in any way. And God will reward the appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is not but a messenger. [Other] messengers have passed on before him. So if he was to die or be killed, would you turn back on your heels [to unbelief]? And he who turns back on his heels will never harm Allah at all; but Allah will reward the grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:144] With regard to their being routed, when it was rumoured that the Prophet had been killed and the hypocrites had said to the believers, ‘If he has been killed, go back to your [previous] religion’, the following was revealed: Muhammad is only a messenger; messengers have passed away before him. Why, if he should die or is slain, like others, will you turn back on your heels, will you return to unbelief (the last statement is the locus of the interrogative of denial, in other words, ‘he was not a worshipped being, so that [if he were to die] you should turn back [to your previous religion]’). If any man should turn back on his heels, he will not harm God in any way, but will be harming himself, and God will requite those that are thankful, for His graces by staying firm.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they said to the Messenger of Allah (pbuh): \"O Prophet of Allah! We heard that you were killed, this is why we ran from the enemy,\" Allah revealed the following: (Muhammad is but a messenger, messengers (the like of whom) have passed away before him) before him other messengers have passed away. (Will it be that, when he) Muhammad (dieth or is slain) in the way of Allah, (you will turn back on your heels?) you will return to your old religion. (He who turneth back) returns to his old religion (does no hurt to Allah) such return will not harm Allah, (and Allah will reward the thankful) He will reward the believers for their faith and jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱنْقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ } معناهُ رَجِعْتُمْ عَمّا أَنْتُم عَليهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {You have turned back on your heels} [means that] you have returned to that which you were on.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وما محمد إلا رسول } أي: إنه رسول بشر\n سيموت أو يقتل كحال الأنبياء قبله\n فمن كان على يقين من دينه فبصيرة من ربّه لا يرتد بموت الرسول وقتله\n ولا يفتر عما كان عليه\n لأنه يجاهد لربّه لا للرسول كأصحاب الأنبياء السالفين\n وكما قال أنس عم أنس بن مالك يوم أُحد حين أُرجف بقتل رسول الله صلى الله عليه وسلم وشاع الخبر\n وانهزم المسلمون\n وبلغ إليه تقاول بعضهم: ليت فلاناً يأخذ لنا أماناً من أبي سفيان\n وقول المنافقين: لو كان نبيّاً ما قُتِلَ!\n يا قوم\n إن كان محمد قد قُتِل فإنّ ربّ محمد حيّ لا يموت!\n وما تصنعون بالحياة بعد رسول الله؟ فقاتلوا على ما قاتل عليه\n وموتوا على ما مات عليه\n ثم قال: اللهمّ إني أعتذر إليك مما يقول هؤلاء\n وأبرأ إليك مما جاء به هؤلاء\n ثم شدّ بسيفه وقاتل حتى قُتِل\n { ومن يَنْقلب على عَقبيه فلن يضرّ الله شيئاً } إنما ضرّ نفسه بنفاقه وضعف يقينه { وسيجزي الله الشاكرين } لنعمة الإسلام\n كأنس بن النضر وأضرابه من الموقنين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المسترشدون { مَا مُحَمَّدٌ إِلاَّ رَسُولٌ } من الرسل\n هادٍ لكم إلى التوحيد الذاتي ينبهكم على طريقه { قَدْ خَلَتْ } مضت { مِن قَبْلِهِ } أي: قبل ظهوره { ٱلرُّسُلُ } الهادين إليه مثله\n المنبهين لطريقه في ضمن توحيد الصفات والأفعال\n وما لهم وله إلا التبليغ والتنبيه\n فعليكم أن تتنبهوا وتتحقوا بمقام التحقيق واليقين\n معرضين عن التقليد والتخمين\n أتؤمنون به وتسترشدون منه أيها المريدون حال حياته؟\n\n\n{ أَفإِنْ مَّاتَ أَوْ قُتِلَ ٱنْقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ } غير واصلين إلى فضاء التوحيد { وَمَن يَنقَلِبْ } منكم { عَلَىٰ عَقِبَيْهِ } بلا وصول إلى الغاية { فَلَن يَضُرَّ ٱللَّهَ شَيْئاً } بنقصان أو زيادة\n إذ و مستوٍ على عرضه كما كان\n بلا تبديل ولا تغيير\n بل ما يضر إلا نفسه بعدم إيصالها إلى غياتها الممكن لها\n وبذلك حط عن رتبة الشاكرين { وَ } اعلموا أيها المؤمنون { سَيَجْزِي ٱللَّهُ } بلطفه بالجزاء الجميل والإحسان الجزيل { ٱلشَّاكِرِينَ } [آل عمران: 144] منكم\n الصادقين جميع القوى والجوارح إلى ما خلق لأجله الصابرين على ما أصابهم في سبيله\n الباذلين مهجهم في إعلاء كلمة توحيده\n الراجين منه الوصول إلى زلال تجريده وتفريده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:6",
      "similarity": 0.3899274317622846
    },
    {
      "verse": "46:18",
      "similarity": 0.3501286770094705
    },
    {
      "verse": "10:102",
      "similarity": 0.3474012225437855
    },
    {
      "verse": "84:4",
      "similarity": 0.34724159420876777
    },
    {
      "verse": "35:24",
      "similarity": 0.34524270344733
    }
  ]
}