{
  "chapter": "آل عمران",
  "text": "يايها الذين ءامنوا۟ ان تطيعوا۟ الذين كفروا۟ يردوكم على اعقبكم فتنقلبوا۟ خسرين",
  "translations": [
    {
      "translation": "You who have iman! if you obey those who are kafir, they will turn you round on your heels and you will be transformed into losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you listen to the infidels they will make you turn your backs, and you will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! If you follow those who deny the Truth, they will drive you back on your heels, and you will turn about, losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you obey the unbelievers, they will turn you back to disbelief and you will become lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you obey the disbelievers, they will make you turn back on your heels, so you will then turn back as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey those who disbelieve, they will send you back on your heels, and you will turn back as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! if you obey those who disbelieve they will turn you back upon your heels, so you will turn back losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you obey the unbelievers they will turn you upon your heels, and you will turn about, losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! if ye obey those who disbelieve, they will make you turn back on your heels, and ye turn back as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you yield to those who deny the truth, they will cause you to turn back on your heels and you will turn into losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! if ye obey those who disbelieve, they will send you back on your heels, and ye will turn back losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! If you obey the faithless, they will turn you back on your heels, and you will become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye obey the Unbelievers, they will drive you back on your heels, and ye will turn back (from Faith) to your own loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey those who disbelieve, they will send you back on your heels, and you will turn back (from Faith) as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you obey those who disbelieve they will turn you upon your heels and you will turn to be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey those who disbelieve, they will turn you back on your heels, and you end up losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if you obey those who disbelieve, they will turn you back on your heels, and you will [then] become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:149] O you who believe, if you obey the disbelievers, in what they command you, they will make you turn back on your heels, [back] to unbelief, and you will revert as losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) meaning: Hudhayfa [Ibn al-Yaman] and 'Ammar [Ibn Yasir]! (If ye obey those who disbelieve) i.e. Ka'b [Ibn al-Ashraf] and his followers, (they will make you turn back on your heels) they will make you return to your old religion: disbelief, (and ye turn back as losers) duped for loosing both this worldly life and the Hereafter and also for receiving Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لمَّا أراد سبحانه تثبيت المؤمنين على قواعد الإسلام، ورسوخهم على مقتضى شعار الدين والإيمان، حذرهم عن إطاعة الكفار ومخالطتهم، والاستعانة منهم، والاستكانة إليهم، فقال منادياً لهم: { يَا أَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِن تُطِيعُواْ } وتنقادوا وتستنصورا من { ٱلَّذِينَ كَفَرُواْ } بتوحيد الله عناداً، وأعرضوا عن كتبه ورسله؛ استكباراً { يَرُدُّوكُمْ } إلبتة بعد إهدائكم إلى الإيمان { عَلَىٰ أَعْقَابِكُمْ } التي أنتم فيها من الكفر والطغيان قبل انكشافكم بالإيمان، وإن انقلبتم { فَتَنقَلِبُواْ خَاسِرِينَ } [آل عمران: 149] خسراناً عظيماً، فعليكم أن تتركوا موالاتهم وموافاتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا إن تُطيعوا الذين كفروا } وهم المنافقون، لما قالوا للمسلمين عند الهزيمة: ارجعوا إلى دينكم الأول، ولو كان نبيّاً ما قتل، { يردوكم على أعقابكم } راجعين عن إيمانكم، { فتنقلبوا خاسرين } مفتونين عن دينكم، فتحبط أعمالكم فتخسروا الدنيا والآخرة، بل أثبتوا على إيمانكم، فإن الله { مولاكم } سينصركم ويعزكم، { وهو خير الناصرين } ، وقيل: إن تسكنوا إلى أبي سفيان وأشياعه وتستأمنوهم يردوكم إلى دينهم\n وقيل: عام في مطاوعة الكفرة والنزول على حكمهم فإنه يجر إلى موافقتهم على دينهم، لا سيما إن طالت مدة الاستئمان\n قلت: وهذا هو السبب في ارتداد من بقي من المسلمين بالأندلس حتى رجعوا نصارى، هم وأولادهم، والعياذ بالله من سوء القضاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:100",
      "similarity": 0.5410253776009321
    },
    {
      "verse": "23:34",
      "similarity": 0.4297564732447655
    },
    {
      "verse": "10:95",
      "similarity": 0.3652587179009391
    },
    {
      "verse": "9:45",
      "similarity": 0.35638715168462703
    },
    {
      "verse": "103:2",
      "similarity": 0.3533619150200891
    }
  ]
}