{
  "chapter": "آل عمران",
  "text": "يايها الذين ءامنوا۟ ان تطيعوا۟ الذين كفروا۟ يردوكم على اعقبكم فتنقلبوا۟ خسرين",
  "translations": [
    {
      "translation": "You who have iman! if you obey those who are kafir, they will turn you round on your heels and you will be transformed into losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you listen to the infidels they will make you turn your backs, and you will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! If you follow those who deny the Truth, they will drive you back on your heels, and you will turn about, losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you obey the unbelievers, they will turn you back to disbelief and you will become lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you obey the disbelievers, they will make you turn back on your heels, so you will then turn back as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey those who disbelieve, they will send you back on your heels, and you will turn back as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! if you obey those who disbelieve they will turn you back upon your heels, so you will turn back losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you obey the unbelievers they will turn you upon your heels, and you will turn about, losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! if ye obey those who disbelieve, they will make you turn back on your heels, and ye turn back as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you yield to those who deny the truth, they will cause you to turn back on your heels and you will turn into losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! if ye obey those who disbelieve, they will send you back on your heels, and ye will turn back losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! If you obey the faithless, they will turn you back on your heels, and you will become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye obey the Unbelievers, they will drive you back on your heels, and ye will turn back (from Faith) to your own loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey those who disbelieve, they will send you back on your heels, and you will turn back (from Faith) as losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you obey those who disbelieve they will turn you upon your heels and you will turn to be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey those who disbelieve, they will turn you back on your heels, and you end up losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if you obey those who disbelieve, they will turn you back on your heels, and you will [then] become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:149] O you who believe, if you obey the disbelievers, in what they command you, they will make you turn back on your heels, [back] to unbelief, and you will revert as losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي للانتقال من التَّوبيخ واللوم والعتاب إلى التَّحذير ، ليتوسّل منه إلى معاودة التسلية ، على ما حصل من الهزيمة ، وفي ضمن ذلك كلّه ، من الحقائق الحكمية والمواعظ الأخلاقية والعبر التَّاريخية ، ما لا يحصيه مريد إحصائه .والطاعة تطلق على امتثال أمْر الآمِر وهو معروف ، وعلى الدخول تحت حكم الغالب ، فيُقال طَاعَت قبيلة كذا وطوّع الجيش بلاد كذا .و { الَّذين كفروا } شائع في اصطلاح القرآن أن يراد به المشركون ، واللفظ صالح بالوضع لكلّ كافر من مشرك وكتابي ، مظهر أو منافق .والردّ على الأعقاب : الارتداد ، والانقلاب : الرجوع ، وقد تقدّم القول فيهما عند قوله : { أفأين مات أو قتل انقلبتم على أعقابكم } \\[ آل عمران : 144 \\] فالظاهر أنَّه أراد من هذا الكلام تحذير المؤمنين من أن يُخامرهم خاطر الدخول في صلح المشركين وأمانهم ، لأنّ في ذلك إظهار الضّعف أمامهم ، والحاجة إليهم ، فإذا مالوا إليهم استدرجوهم رويداً رويداً ، بإظهار عدم كراهية دينهم المخالف لهم ، حتَّى يردّوهم عن دينهم لأنَّهم لن يرضوا عنهم حتَّى يرجعوا إلى ملّتهم ، فالردّ على الأعقاب على هذا يحصل بالإخارة والمآل ، وقد وقعت هذه العبرة في طاعة مسلمي الأندلس لطاغية الجلالقة . وعلى هذا الوجه تكون الآية مشيرة إلى تسفيهِ رأي من قال : «لو كلّمنا عبد الله بن أبي يأخذ لنا أماناً من أبي سفيان» كما يدلّ عليه قوله : { بل الله مولاكم } .ويحتمل أن يراد من الطاعة طاعة القول والإشارة ، أي الامتثال ، وذلك قول المنافقين لهم : لو كان محمد نبيئاً ما قُتل فارجعوا إلى إخوانكم وملّتكم . ومعنى الردّ على الأعقاب في هذا الوجه أنَّه يحصل مباشرة في حال طاعتهم إيّاهم .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe) meaning: Hudhayfa [Ibn al-Yaman] and 'Ammar [Ibn Yasir]! (If ye obey those who disbelieve) i.e. Ka'b [Ibn al-Ashraf] and his followers, (they will make you turn back on your heels) they will make you return to your old religion: disbelief, (and ye turn back as losers) duped for loosing both this worldly life and the Hereafter and also for receiving Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n استكباراً { يَرُدُّوكُمْ } إلبتة بعد إهدائكم إلى الإيمان { عَلَىٰ أَعْقَابِكُمْ } التي أنتم فيها من الكفر والطغيان قبل انكشافكم بالإيمان\n وإن انقلبتم { فَتَنقَلِبُواْ خَاسِرِينَ } [آل عمران: 149] خسراناً عظيماً\n فعليكم أن تتركوا موالاتهم وموافاتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا إن تُطيعوا الذين كفروا } وهم المنافقون\n لما قالوا للمسلمين عند الهزيمة: ارجعوا إلى دينكم الأول\n ولو كان نبيّاً ما قتل\n { يردوكم على أعقابكم } راجعين عن إيمانكم\n { فتنقلبوا خاسرين } مفتونين عن دينكم\n فتحبط أعمالكم فتخسروا الدنيا والآخرة\n بل أثبتوا على إيمانكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:100",
      "similarity": 0.5410253776009321
    },
    {
      "verse": "23:34",
      "similarity": 0.4297564732447655
    },
    {
      "verse": "10:95",
      "similarity": 0.3652587179009391
    },
    {
      "verse": "9:45",
      "similarity": 0.35638715168462703
    },
    {
      "verse": "103:2",
      "similarity": 0.3533619150200891
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003149.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003149.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:149.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}