{
  "chapter": "آل عمران",
  "text": "اذ تصعدون ولا تلون على احد والرسول يدعوكم فى اخرىكم فاثبكم غمۢا بغم لكيلا تحزنوا۟ على ما فاتكم ولا ما اصبكم والله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "Remember when you were scrambling up the slope, refusing to turn back for anyone, and the would not feel grief for what escaped you or what assailed you. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, as you were rushing up (the hill) without turning back to look, though the Prophet was calling you from the rear, He requited you with anguish for an anguish that you do not fret for missed opportunity and what befell you, for God is aware of all that you do,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when you were fleeing without casting even a side glance at anyone, and the Messenger was calling out to you from the rear. Then Allah requited you by inflicting grief after grief upon you so as to instruct you neither to grieve for the losses you might suffer nor for the afflictions that might befall you. Allah knows all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Believers remember) when you were fleeing without even glancing to either side even though the Messengers were calling you back, God made you suffer sorrow upon sorrow to make you forget your grief of what you had lost and the injuries you had suffered. God is Well-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were leaving, unconcerned without turning to look back at anyone, and from another group Our Noble Messenger was calling you (to fight); so He gave you sorrow in lieu of sorrow, and then forgave you so that you do not grieve over what has been lost or over the calamity that befell you; and Allah is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when you ran away without even casting a side glance at anyone, and the Messenger was in your rear calling you back. There did Allah give you one distress after another by way of requital, to teach you not to grieve for that which had escaped you, nor for what struck you. And Allah is Well-Aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you ran off precipitately and did not wait for any one, and the Apostle was calling you from your rear, so He gave you another sorrow instead of (your) sorrow, so that you might not grieve at what had escaped you, nor (at) what befell you; and Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were going up, not twisting about for anyone, and the Messenger was calling you in your rear; so He rewarded you with grief on grief that you might not sorrow for what escaped you neither for what smote you; and God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye climbed (the hill) and paid no heed to anyone, while the messenger, in your rear, was calling you (to fight). Therefor He rewarded you grief for (his) grief, that (He might teach) you not to sorrow either for that which ye missed or for that which befell you. Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were running away and did not look back at anyone, while the Messenger was calling to you from behind, He paid you back with one sorrow after another, so that you might not grieve for what you lost, nor for what befell you. God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time ye were running off and would not look back on any one, albeit the apostle In your rear was calling unto you. Wherefore He caused sorrow to overtake you for sorrow. that ye might not grieve for that which ye might lose nor for that which might befall you. And Allah is Aware of that which ye Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were fleeing without paying any attention to anyone, while the Apostle was calling you from your rear, He requited you with grief upon grief, so that you may not grieve for what you lose nor for what befalls you, and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! ye were climbing up the high ground, without even casting a side glance at any one, and the Messenger in your rear was calling you back. There did Allah give you one distress after another by way of requital, to teach you not to grieve for (the booty) that had escaped you and for (the ill) that had befallen you. For Allah is well aware of all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when you ran away (dreadfully) without even casting a side glance at anyone, and the Messenger (Muhammad SAW) was in your rear calling you back. There did Allah give you one distress after another by way of requital to teach you not to grieve for that which had escaped you, nor for that which had befallen you. And Allah is Well-Aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you were going up, and paid no heed for anyone, and the Messenger was calling you from behind; so He rewarded you with grief upon grief that you might not sorrow for what escaped you neither for what smote you. And Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you fled, not caring for anyone, even though the Messenger was calling you from your rear. Then He repaid you with sorrow upon sorrow, so that you would not grieve over what you missed, or for what afflicted you. God is Informed of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when you [fled and] climbed [the mountain] without looking aside at anyone while the Messenger was calling you from behind. So Allah repaid you with distress upon distress so you would not grieve for that which had escaped you [of victory and spoils of war] or [for] that which had befallen you [of injury and death]. And Allah is [fully] Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:153] Remember, when you were ascending, fleeing in the distance, not turning around, [not] stopping, for anyone and the Messenger was calling you from your rear, saying, ‘Come to me servants of God, this way, servants of God!’, so He rewarded you, He requited you, with grief, through defeat, for grief (ghamman bighamm; the bā’ [bi-], ‘with’, is said to mean ‘alā, ‘for’) because of the grief that you caused the Prophet when you disobeyed [his command], that is, [with grief] doubled, [being] in addition to the grief of the booty forfeited, so that (li-kaylā is semantically connected either to ‘afā, ‘He has pardoned’, or athābakum, ‘He rewarded you’; the lā [of kay-lā] is thus extra) you might not grieve for what escaped you, of booty, neither for what befell you, of being slain and [of] defeat; and God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned how they turned their back on the Prophet (pbuh) because of their fear of the enemy, saying: (When ye climbed) the hill after being defeated (and paid no heed to anyone) paid no heed to the Prophet and did not wait for him, (while the messenger) Muhammad, (in your rear, was calling you (to fight)) he was behind you, group of believers, saying: I am Allah's Messenger, stop and fight! (Therefore He rewarded you grief for (his) grief) in addition to the grief wrought upon you by Khalid Ibn al-Walid, He also inflicted on you the grief of death and defeat, (that (He might teach) you not to sorrow either for that which ye missed) of booty (or for that which befell you) and that you do not sorrow for that which befell you of deaths and injuries. (Allah is Informed of what ye do) in jihad as well as in defeat.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ تُصْعِدُونَ } معناهُ تُباعِدُونَ فِي الأَرضِ\n\n\n\n\nوقوله تعالى: { فِيۤ أُخْرَٰكُمْ } معناهُ فِي أَخِرِكُم\n\n\n\n\nوقوله تعالى: { فَأَثَـٰبَكُمْ غَمّاًً بِغَمٍّ } فالغَمُّ الأَولُ: الجُرحُ والقَتْلُ\n والغَمُّ الأَخِيرُ: حِينَ سَمِعُوا بِقَتْلِ النَّبي صلى الله عليه وسلم\n ويُقالُ ما كَانوا يَرجُونَ مِنَ الغَنِيمةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواذكر أيها المؤمنون قبح صنيعكم، وستحيوا من الله، وتندموا عما صدر منكم وقت { إِذْ تُصْعِدُونَ } تذهبون إلى الأباعد؛ خوفاً من العدو، فارين من الزحف، متخالفين لرسول الله { وَ } عند ذهابكم وفراركم { لاَ تَلْوُونَ } تلتفتون على أعقابكم، ولا تنتظرون { عَلَىٰ أحَدٍ } من إخوانكم { وَٱلرَّسُولُ } صلى الله عليه وسلم في تلك الحالة { يَدْعُوكُمْ } ويناديكم صارخاً: إليَّ عباد الله، وكان الرسول صلى الله عليه وسلم { فِيۤ أُخْرَٰكُمْ } ساقتكم وعصيانكم، ولم يلتفت أحد منكم إلى عقبه لإجابة دعائه صلى الله عليه وسلم\n\n\n\n\nومع ذلك لم تنجوا سالمين { فَأَثَـٰبَكُمْ } أورثكم الله، المصلح لأحوالكم؛ تأديباً لكم، متصلاً { غَمّاًً بِغَمٍّ } آخر، حيث أحاطت بكم الغموم من القتل والجرح والإرجاف بقتل الرسول صلى الله عليه وسلم، وإنما فعل بكم ما فعل { لِّكَيْلاَ تَحْزَنُواْ عَلَىٰ مَا فَاتَكُمْ } من النهب والغنيمة { وَلاَ مَآ أَصَـٰبَكُمْ } من الفرار والهزيمة، ولتتمكنوا أو تتمرنوا في مقام الرضا والتسليم، ولا تخالفوا أمر الله ورسوله { وَٱللَّهُ } المدبر لأمروكم { خَبِيرٌ بِمَا تَعْمَلُونَ } [آل عمران: 153] بمقتضى تسويلات نفوسكم الأمَّارة بالسوء، فيجازيكم بها؛ لكي تتنبهوا وتسلموا أموركم إلى الله وتتحققوا بالتوحيد الذاتي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذْ }: ظرف لعفا، أو اذكر\n وأصعد: أبعد في الأرض، وصعد: في الجبل، فالإصعاد: الذهاب في الأرض المستوية، والصعود: الارتقاء في العلو\n وقرئ بهما معاً لأنهما وقعا معاً، فمنهم من فرّ ذاهباً في الأرض، ومنهم من صعد إلى الجبل\n و { لكيلا }: متعلق بأثابكم\n يقول الحقّ جلّ جلاله: ولقد عفا عنكم حين كنتم { تُصْعِدُون } عن نبيه - عليه الصلاة والسلام -، منهزمين عنه، تبعدون عنه، { ولا تلوون على أحد } أي: لا يلتفت بعضكم إلى بعض، ولا ينتظر بعضكم بعضاً، { والرسول } محمد صلى الله عليه وسلم { يدعوكم في أخراكم } أي: في ساقتكم، يقول:\n\n \" إليَّ عباد الله، أنا رسول الله، من يكرُّ فله الجنة \" \n\n، وفيه مدح للرسول صلى الله عليه وسلم بالشجاعة والثبات، حيث وقف في آخر المنهزمين، فإن الآخر هو موقف الأبطال، والفرار في حقه صلى الله عليه وسلم محال\n { فأثابكم } أي: فجازاكم على ذلك الفرار، { غمّاً } وهو ظهور المشركين عليكم وقتل إخوانكم، بسبب غم أوصلتموه للنبيّ صلى الله عليه وسلم بعصيانه والفرار عنه، وقدَّر ذلك { لكيلا تحزنوا على ما فاتكم } من الغنيمة، { ولا } على { ما أصابكم } من الجرح والهزيمة، لأن من استحق العقوبة والأدب لا يحزن على ما فاته ولا على ما أصابه إذ جريمته تستحق أكثر من ذلك، يرى ما نزل به بعض ما يستحقه، فيهون عليه أمر ما نزل به أو ما فاته من الخير\n أو يقول: { فأثابكم غمّاً } متصلاً { بغم } فالغم الأول: ما فاتهم من الظفر والغينمة، والثاني: ما نالهم من القتل والهزيمة، أو الأول: ما أصابهم من القتل والجراح، والثاني: ما سمعوا من الإرجاف بقتل النبيّ صلى الله عليه وسلم، وذلك ليتمرنوا على المحن والشدائد حتى لا يجزعوا من شيء، وبذلك وصفهم كعب بن زهير في لاميته، حيث قال:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:23",
      "similarity": 0.3704412774728727
    },
    {
      "verse": "60:11",
      "similarity": 0.3575148689793939
    },
    {
      "verse": "3:78",
      "similarity": 0.3574961114674567
    },
    {
      "verse": "63:5",
      "similarity": 0.3474923254849588
    },
    {
      "verse": "4:135",
      "similarity": 0.33334749452061524
    }
  ]
}