{
  "chapter": "آل عمران",
  "text": "ثم انزل عليكم منۢ بعد الغم امنة نعاسا يغشى طائفة منكم وطائفة قد اهمتهم انفسهم يظنون بالله غير الحق ظن الجهلية يقولون هل لنا من الامر من شىء قل ان الامر كله لله يخفون فى انفسهم ما لا يبدون لك يقولون لو كان لنا من الامر شىء ما قتلنا ههنا قل لو كنتم فى بيوتكم لبرز الذين كتب عليهم القتل الى مضاجعهم وليبتلى الله ما فى صدوركم وليمحص ما فى قلوبكم والله عليمۢ بذات الصدور",
  "translations": [
    {
      "translation": "Then He sent down to you, after the distress, security, restful sleep overtaking a group of you, whereas another group became prey to anxious thoughts, thinking other than the truth about Allah - thoughts belonging to the Time of Ignorance - saying, 'Do we have any say in the affair at all?' Say, 'The affair belongs entirely to Allah.' They are concealing within themselves things which they do not disclose to you, saying, 'If we had only had a say in the affair, none of us would have been killed here in this place.' Say, 'Even if you had been inside your homes, those people for whom being killed was decreed would have gone out to their place of death.' So that Allah might test what is in your breasts and purge what is in your hearts. Allah knows all that your hearts contain.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after affliction He Sent you a drowsiness as comes after security, overwhelming some among you, and making some anxious for themselves, and made them think thoughts of pagan ignorance; and they said: \"Have we a say in any affair?\" Say: \"All affairs rest with God.\" They hide in their hearts what they do not disclose to you. They say: \"If we had a say in the affair we would not have been killed in this place.\" Tell them: \"Even had you stayed at home, those of you who were ordained to fight would have gone to their place of (eternal) rest. God had to try them to bring out what they concealed in their breasts, and to bring out the secrets of their hearts, for God knows your innermost thoughts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after inflict-ing this grief, He sent down an inner peace upon you - a sleep which overtook some of you. Those who were concerned merely about themselves, entertaining false notions about Allah - the notions of the Age of Ignorance - asked: 'Have we any say in the matter?' Tell them: 'Truly, all power of decision rests solely with Allah.' Indeed, they conceal in their hearts what they would not reveal to you, saying: 'If we had any power of decision, we would not have been slain here.' Say: 'Even if you had been in your houses, those for whom slaying had been appointed would have gone forth to the places where they were to be slain.' And all this happened so that Allah might test your secret thoughts and purge your hearts of all impurities. Allah knows well what is in the breasts of men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After the sorrows you suffered, He sent you relief and some of you were encompassed by slumber. To some others of you, your lives were so important that you, like ignorant people, began thinking suspiciously of God saying, \"Do we have any say in the matter?\" (Muhammad), tell them, \"All matters belong to God.\" They try to hide within their souls what they do not reveal to you. They say, \"Had we had the matter in our hands, we would not have been killed there.\" Tell them, \"Even if you had stayed in your own homes, your sworn enemies could have attacked you and slain you while you were in your beds. God wanted to test you and purge what existed in your hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after grief, He sent down a peaceful slumber (calm), which engulfed a group among you – and another party kept fearing for their own lives, thinking wrongfully of Allah – like the thoughts of ignorance; they say, “Do we have any authority in this matter?” Say (O dear Prophet Mohammed – peace and blessings be upon him), “All authority lies only with Allah”; they hide in their hearts what they do not reveal to you; they say, “Had we any control, we would not have been slain here”; say, “Even if you had been in your houses, those destined to be slain would have come forth to their places of slaying; and in order that Allah may test what is in your breasts and reveal whatever is in your hearts”; and Allah knows well what lies within the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after the distress, He sent down security for you. Slumber overtook a party of you, while another party was thinking about themselves and thought wrongly of Allah -- the thought of ignorance. They said, \"Have we any part in the affair\" Say: \"Indeed the affair belongs wholly to Allah.\" They hide within themselves what they dare not reveal to you, saying: \"If we had anything to do with the affair, none of us would have been killed here.\" Say: \"Even if you had remained in your homes, those for whom death was decreed would certainly have gone forth to the place of their death,\" but that Allah might test what is in your breasts; and to purify that which was in your hearts (sins), and Allah is All-Knower of what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after sorrow He sent down security upon you, a calm coming upon a party of you, and (there was) another party whom their own souls had rendered anxious; they entertained about Allah thoughts of ignorance quite unjustly, saying: We have no hand in the affair. Say: Surely the affair is wholly (in the hands) of Allah. They conceal within their souls what they would not reveal to you. They say: Had we any hand in the affair, we would not have been slain here. Say: Had you remained in your houses, those for whom slaughter was ordained would certainly have gone forth to the places where they would be slain, and that Allah might test what was in your breasts and that He might purge what was in your hearts; and Allah knows what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He sent down upon you, after grief, security -- a slumber overcoming a party of you; and a party themselves had grieved, thinking of God thoughts that were not true such as the pagans thought, saying, 'Have we any part whatever in the affair?' Say: 'The affair belongs to God entirely.' They were concealing in their hearts that they show not to thee, saying, 'Ah, if we had had a part in the affair, never would we have been slain here.' Say: 'Even if you had been in your houses, those for whom slaying was appointed would have sallied forth unto their last couches'; and that God might try what was in your breasts, and that He might prove what was in your hearts; and God knows the thoughts in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after grief, He sent down security for you. As slumber did it overcome a party of you, while (the other) party, who were anxious on their own account, thought wrongly of Allah, the thought of ignorance. They said: Have we any part in the cause? Say (O Muhammad): The cause belongeth wholly to Allah. They hide within themselves (a thought) which they reveal not unto thee, saying: Had we had any part in the cause we should not have been slain here. Say: Even though ye had been in your houses, those appointed to be slain would have gone forth to the places where they were to lie. (All this hath been) in order that Allah might try what is in your breasts and prove what is in your hearts. Allah is Aware of what is hidden in the breasts (of men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after sorrow He sent down peace [of mind] upon you in the shape of drowsiness that overcame some of you, but there were others who were anxious only about themselves. They entertained false notions about God, like the notions of the days of ignorance. \"Have we any say in the matter?\" they asked. Say to them, \"All is in the hands of God.\" They conceal in their hearts what they would not reveal to you. They say, \"Had we had any say in the matter, none of us would have been killed here.\" Say to them, \"Had you stayed in your homes, those whose death had been decreed would nevertheless have gone forth to the places where they were destined to die.\" And all this befell you so that God might test what is in your minds. And in order to purify what was in your hearts. For God is aware of your innermost thoughts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after sorrow, He sent down unto you a security-- slumber coming over a section of you; While anot her section, concerned about themselves, bethought of Allah unjustly: the thought of paganism. They said: have we aught at all of the affair? Say thou: the affair is wholly Allah's. They hide within themselves that which they disclose not unto thee, saying: had we aught of the affair, we would not have been slain here. Say thou: had ye stayed in your houses, even then those decreed to be slain would surely have gone forth to their places of slaughter; and this happened in order that he might prove that which was in your breasts, and purge that which was in your hearts; and Allah is Knower of that which is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He sent down to you safety after grief—a drowsiness that came over a group of you—while another group, anxious only about themselves, entertained false notions about Allah, notions of [pagan] ignorance. They say, ‘Do we have any role in the matter?’ Say, ‘Indeed the matter belongs totally to Allah.’ They hide in their hearts what they do not disclose to you. They say, ‘Had we any role in the matter, we would not have been slain here.’ Say, ‘Even if you had remained in your houses, those destined to be slain would have set out toward the places where they were laid to rest, so that Allah may test what is in your breasts, and that He may purge what is in your hearts, and Allah knows well what is in the breasts.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After (the excitement) of the distress, He sent down calm on a band of you overcome with slumber, while another band was stirred to anxiety by their own feelings, Moved by wrong suspicions of Allah-suspicions due to ignorance. They said: \"What affair is this of ours?\" Say thou: \"Indeed, this affair is wholly Allah's.\" They hide in their minds what they dare not reveal to thee. They say (to themselves): \"If we had had anything to do with this affair, We should not have been in the slaughter here.\" Say: \"Even if you had remained in your homes, those for whom death was decreed would certainly have gone forth to the place of their death\"; but (all this was) that Allah might test what is in your breasts and purge what is in your hearts. For Allah knoweth well the secrets of your hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after the distress, He sent down security for you. Slumber overtook a party of you, while another party was thinking about themselves (as how to save their ownselves, ignoring the others and the Prophet SAW) and thought wrongly of Allah - the thought of ignorance. They said, \"Have we any part in the affair?\" Say you (O Muhammad SAW): \"Indeed the affair belongs wholly to Allah.\" They hide within themselves what they dare not reveal to you, saying: \"If we had anything to do with the affair, none of us would have been killed here.\" Say: \"Even if you had remained in your homes, those for whom death was decreed would certainly have gone forth to the place of their death,\" but that Allah might test what is in your breasts; and to Mahis that which was in your hearts (sins), and Allah is All-Knower of what is in (your) breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after sorrow, He sent down upon you safety. Slumber overtook a party, while another party cared only for themselves, thinking of Allah thoughts that were not true, the guess of ignorance, saying: 'Have we any say in the affair' Say: 'The entire affair belongs to Allah' They conceal in themselves what they do not disclose to you. They say: 'If we had any say in the affair we should not have been killed here' Say: 'Had you stayed in your homes, those of you for whom slaying was written would have come out to their (death) beds so that Allah might try what was in your chests and that He will examine what is in your hearts' And Allah knows the innermost of the chests.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after the setback, He sent down security upon you. Slumber overcame some of you, while others cared only for themselves, thinking of God thoughts that were untrue—thoughts of ignorance—saying, “Is anything up to us?” Say, “Everything is up to God.” They conceal within themselves what they do not reveal to you. And they say, “If it was up to us, none of us would have been killed here.” Say, “Even if you Had stayed in your homes, those destined to be killed would have marched into their death beds.” God thus tests what is in your minds, and purifies what is in your hearts. God knows what the hearts contain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after distress, He sent down upon you security [in the form of] drowsiness, overcoming a faction of you, while another faction worried about themselves, thinking of Allah other than the truth - the thought of ignorance, saying, \"Is there anything for us [to have done] in this matter?\" Say, \"Indeed, the matter belongs completely to Allah.\" They conceal within themselves what they will not reveal to you. They say, \"If there was anything we could have done in the matter, some of us would not have been killed right here.\" Say, \"Even if you had been inside your houses, those decreed to be killed would have come out to their death beds.\" [It was] so that Allah might test what is in your breasts and purify what is in your hearts. And Allah is Knowing of that within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:154] Then He sent down upon you, after grief, security — a slumber (nu‘āsan, ‘slumber’ substitutes for amanatan, ‘security’) overcoming (yaghshā or taghshā) a party of you, namely, the believers. They would become dizzy under their shields and their swords would fall from their hands; and a party whose own souls distressed them, that is, they caused them grief, so that their only wish was their deliverance, regardless of the Prophet and his Companions, and they were unable to fall asleep: these were the hypocrites; thinking wrongly of God, thoughts of, those thoughts during the, age of ignorance, the moment they thought that the Prophet had been killed or that he would not be given victory, saying, ‘Have we any part whatever in the affair?’ (read [interrogative] hal as [negative] mā) that is, [we have no part in] the assistance which we were promised. Say, to them: ‘The affair belongs entirely (read accusative kullahu to denote an emphasis, or nominative kulluhu as a subject [of a new sentence], the predicate of which is [what follows]) to God’, that is to say, the decree is His, He does what He wills. They conceal within their hearts what they do not disclose, what they [do not] manifest, to you, saying, (yaqūlūna, ‘saying’, is an explication of the preceding [statement]) ‘Had we had any part in the affair, we would not have been slain here’, that is to say, ‘Had the choice been ours, we would not have set out and thus been slain; but we were forced to set out’. Say, to them: ‘Even if you had been in your houses, with some among you whom God had appointed that they be slain, those, of you, for whom it had been appointed, decreed, that they be slain would have sallied forth, would have gone forth, to the places where they were to lie’, the battleground where they were to fall, and they would have been slain; and their staying put [at home] would not have saved them, for God’s decree will be, inevitably. And, He did what He did at Uhud, that God might try, [that He might] test, what was in your breasts, your hearts, of sincerity or hypocrisy, and that He might prove, [that He might] distinguish, what was in your hearts; and God knows what is in the breasts, what is in the hearts. Nothing can be hidden from Him, and He tries people only to make [matters] manifest for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned His blessings upon them, saying: (Then, after grief, He sent down security for you) from the enemy. (As slumber did it overcome a party of you) such that those among you who had sincerity and certitude slept, (while (the other) party, who were anxious on their own account) who were overcome with anxiousness about themselves. This refers to Mu'attib Ibn Qushayr, the hypocrite, and his fellows who were not overcome by sleep, (thought wrongly of Allah) that He would not come to the help of His Messenger and his Companions, (the thought of ignorance) as they did think of Him in the time of ignorance domination? (Say) Muhammad: (The cause) triumph and domination (belongeth wholly to Allah) they are in the Hand of Allah. (They hide within themselves (a thought) which they reveal not unto you) for fear that they would be killed, (saying: Had we had any part in the cause we should not have been slain here. Say) to the hypocrites, Muhammad: (Even though ye had been in your houses) in Medina, (those appointed to be slain would have gone forth to the places where they were to lie) where they were to be killed at Uhud. ((All this has been) in order that Allah might try) test (what is in your breasts) what is in the breast of the hypocrites (and prove) bring to the fore (what is in your hearts) of hypocrisy. (Allah is Aware of what is hidden in the breasts (of men)) He knows what is in people's hearts of good and evil, i.e. the hearts of hypocrites; it is also said that it refers to the hearts of the archers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ ثمّ } خلّى عنكم الغمّ بالأمن وإلقاء النعاس على الطائفة الصادقين دون المنافقين الذين { أهمتهم أنْفسهم } لا نفس الرسول ولا الذين وافقوا علامة للعفو { لبرزَ الذين كُتِب عليهم القَتل إلى مضاجعهم } لقوله تعالى:\n[الحديد، الآية: 22]. { وليَبْتَلي الله ما في صُدُوركم } أي: وليمتحن ما في استعدادكم من الصدق والإخلاص واليقين والصبر والتوكل والتجرّد وجميع الأخلاق والمقامات، ويخرجها من القوّة إلى الفعل { وليمحص ما في قلوبكم } أي: وليخلص ما برز منها من مكمن الصدر إلى مخزون القلب من عثرات وساوس الشيطان ودناءة الأحوال وخواطر النفس، فعل ذلك فإن البلاء سوط من سياط الله يسوق به عباده إليه بتصفيتهم عن صفات نفوسهم وإظهار ما فيهم من الكمالات، وانقطاعهم عنده من الخلق ومن النفس إلى الحق. ولهذا كان متوكلاً بالأنبياء ثم الأولياء ثم الأمثل. وقال رسول الله صلى الله عليه وسلم بياناً لفضله:\n \" ما أوذي نبيّ مثل ما أُوذيت \" \n، كأنه قال: ما صفى نبيّ مثل ما صفيت. ولقد أحسن من قال:\nإذ لا يظهر على كل منهم إلا ما في مكمن استعداده كما قيل: عند الامتحان يُكْرم الرجل أو يُهَان.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } لما تبتم ورجعتم إلى الله\n وندمتم عمَّا فعلتم { أَنزَلَ عَلَيْكُمْ } امتناناً لكم وتفضلاً { مِّن بَعْدِ ٱلْغَمِّ } المفرط { أَمَنَةً } طمأنينة ووقاراً\n حيث تورث { نُّعَاساً } رقدة ونوماً { يَغْشَىٰ طَآئِفَةً مِّنْكُمْ } وهم المتحقوون بمقام العبودية\n الراضون بما جرى عليهم من القضاء\n لا يشوشهم السراء والضراء { وَطَآئِفَةٌ } من منافقيكم { قَدْ أَهَمَّتْهُمْ أَنْفُسُهُمْ } أي: أوقعتهم نفوسهم وأمانيتهم في الهموم والغموم المبعدة عن مقام التفويض والتسليم إلى حيث { يَظُنُّونَ بِٱللَّهِ } ظناً باطلاً { غَيْرَ } ظن { ٱلْحَقِّ } بل { ظَنَّ ٱلْجَٰهِلِيَّةِ } حيث { يَقُولُونَ } لرسول الله استكشافاً ظاهراً\n أو استنكافاً خفيةً: { هَل لَّنَا مِنَ ٱلأَمْرِ } أي: أمر الله الذي وعدتنا والنصر والظفر { مِن شَيْءٍ } أم الأمر للعدو دائماً\n واليد له مستمراً؟\n\n{ قُلْ } لهم يا أكمل الرسل إلزاماً وتبكيتاً: { إِنَّ ٱلأَمْرَ } أي: أمر جميع ما كان وما يكون { كُلَّهُ للَّهِ } اولاً\n وبالذات بلا رؤية الوسائط والوسائل في البين\n وهم من غاية عماهم { يُخْفُونَ فِيۤ أَنْفُسِهِم } من البُغض والنفاق { مَّا لاَ يُبْدُونَ لَكَ } بل يبدون لإخوانهم\n إذا خلا بعضهم بعضاً حتى { يَقُولُونَ } متهكمين\n مستهزئين: { لَوْ كَانَ لَنَا مِنَ ٱلأَمْرِ شَيْءٌ مَّا قُتِلْنَا هَٰهُنَا } مهانين\n مظلومين { قُل } لهم يا أكمل الرسل كلاماً ناشئاً عن محض الحكمة: لا مرد لقضاء الله\n ولا معقب لحكمه\n بل يجري في ملكه ما ثبت في علمه\n\n\nواعلموا أنكم { لَّوْ كُنتُمْ } متمكنين { فِي بُيُوتِكُمْ } غير خارجين منها للقتال { لَبَرَزَ } لظهر وخرج البتة { ٱلَّذِينَ كُتِبَ } قدر وفرض في الأزل { عَلَيْهِمُ ٱلْقَتْلُ } في هذه المعركة\n مسرعين { إِلَىٰ مَضَاجِعِهِمْ } ومقاتلهم في الوقت الذي قدر بلا تأخير ولا تقديم { وَ } إنما فعل بكم ما فعل { لِيَبْتَلِيَ } ويختببر ويمتحن { ٱللَّهُ مَا فِي صُدُورِكُمْ } أهو من الرضا والإخلاص؟ أم من الشقاق والنفاق؟ { وَلِيُمَحِّصَ } يطهر ويصفي { مَا فِي قُلُوبِكُمْ } من الإيمان والتوحيد عن الكفر والنفاق { وَٱللَّهُ } المطلع لسرائركم وضمائركم { عَلِيمٌ بِذَاتِ ٱلصُّدُورِ } [آل عمران: 154] أي: الأمور المكنونة فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { نعاساً }: بد لمن { أمنة } ، أو هو المفعول، و { أمنة }: حال منه، مقدمة، أو مفعول له، أي: أنزل عليكم نعاساً لأجل الأمنة، أو حال من كاف { عليكم } ، أي: أنزل عليكم حال كونكم آمنين. والأمنة: مصدر أمِن، كالعظَمة والغَلَبة. يقول الحقّ جلّ جلاله: { ثم أنزل عليكم } أيها المؤمنون { من بعد الغم } الذي أصابكم بموت إخوانكم، والإرجاف بقتل نبيكم، الأمن والطمأنينة، حتى أخذكم النعاس وأنتم في الحرب. قال أبو طلحة: غَشينَا النعاسُ ونحن في المصافّ، حتى كان السيف يسقط من يد أحدنا فيأخذه، ثم يسقط فيأخذه. وقال الزبير رضي الله عنه. لقد رأيتني حين اشتدّ الخوف، ونحن مع النبيّ صلى الله عليه وسلم، أرسل الله - تعالى - علينا النوم، والله إني لأسمع قول معتب، والنعاس يغشاني، ما أسمعه إلا كالحلُم: { لو كان لنا من الأمر شيء ما قتلنا هاهنا }. ثم إن هذا النعاس إنما { يغشى طائفة منكم } وهم المؤمنون، أو: هذه الأمنة إنما تغشى طائفة منكم، وأما المنافقون فقد { أهمتهم أنفسهم } ، أي: أوقعتهم في الهموم والغموم، أو ما يهمهم إلا أنفسهم، يُدبرون خلاصها ونجاتها، فقد طارت قلوبهم من الخوف، فلا يتصور في حقهم النوم، { يظنون بالله غير الحق } أي: غير الظن الحق، لأنهم ظنّوا أنه لا ينصر - عليه الصلاة والسلام، وأن أمره مضمحل، أو ظنوا أنه قتل، ظنّاً كظن الجاهلية، أهل الشرك، { يقولون } أي: بعضهم لبعض: { هل لنا من الأمر من شيء } أي: عُزلنا عن تدبر أنفسنا، فلم يبق لنا من الأمر من شيء. قاله ابنُ أُبي، لَما بلغة قتل الخزرج. { قل } لهم يا محمد: { إن الأمر كله لله } ليس بيد غيره شيء من التدبير والاختيار، حال كون المنافقين { يخفون في أنفسهم } من الكفر والنفاق { ما لا يُبدون لك يقولون لو كان لنا من الأمر شيء ما قتلنا ها هنا } أي: لو كان تدبيراً أو اختياراً ما خرجنا سلسلة المقادير، رغماً على أنفكم، فلو { كنتم في بيوتكم } آمنين { لبرز الذين كتب عليهم القتل } ، ووصل أجلهم { إلى مضاجعهم } ومصارعهم، رغماً على أنفهم، فإن الله قدَّر الأمور ودبرها في سابق أزله، لا معقب لحكمه، وإنما فعل ذلك، وأخرجكم إلى المعركة { ليبتلي الله ما في صدوركم } أي: يختبر ما فيها من الخير أو الشر، { وليمحص ما في قلوبكم } أي: يكشف ما فيها من النفاق أو الإخلاص، فقد ظهر خبث سريرتكم ومرض قلوبكم بالنفاق الذي تمكن فيه، { والله عليم بذات الصدور } أي: بخفاياها قبل إظهارها. وفيه وعد ووعيد وتنبيه على أنه غني عن الابتلاء، وإنما فعل ذلك ليُميِّز المؤمنين ويُظهَر حال المنافقين. قاله البيضاوي. الإشارة: ثم أنزل عليكم أيها الواصلون المتمكنون، أو من تعلق بكم من السائرين.\nمن بعد غم المجاهدة وتعب المراقبة أمنة في قلوبكم بالطمأنينة بشهود الله، وراحة في جوارحكم من تعب الخدمة في السير إلى الله، حتى وصلتم فنمتم في ظل الأمن والأمان، وسكنتم في جوار الكريم المنان. قال بعض العارفين: إذا انتقلت المعاملة إلى القلوب استراحت الجوارح، وهذه الراحة إنما تحصل للعارفين، أو من تعلق بهم من المريدين، وطائفة من غيرهم وهم المتفقرة الجاهلون، الذين لا شيخ لهم، قد أهمتهم أنفسهم، تارة تصرعهم وتارة يصرعونها، تارة تُشرق عليهم أنوارُ التوجه، فيقوى رجاؤهم في الفتح، وتارة تنقبض عنهم فيظنون بالله غير الحق، ظن الجاهلية، يقولون: هل لنا من الفتح من شيء؟. قل لهم: { إن الأمر كله لله } يوصل من يشاء ويبعد من يشاء، يُخفون في أنفسهم من العيوب والخواطر الرديئة ما لا يبدون لك، فإذا طال عليهم الفتح، وغلب عليهم الفقر، ندموا على ما فاتهم من التمتع بالدنيا، يقولون: لو كان لنا من الأمر شيء ما قُتلنا ها هنا بالذل والفقر والجوع، قل لهم: ذلك الذي سبق في علم الله، لا محيد لأحد عنه، ليظهر الصادق في الطلب من الكاذب، [كن صادقاً تجد مرشداً]، فلو صدقتم في الطلب لأرشدكم إلى من يُوصلكم ويريحكم من التعب. وبالله التوفيق، وهو الهادي إلى سواء الطريق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:11",
      "similarity": 0.3465749785302921
    },
    {
      "verse": "3:141",
      "similarity": 0.3189377600734946
    },
    {
      "verse": "4:34",
      "similarity": 0.21920581143692172
    },
    {
      "verse": "32:16",
      "similarity": 0.18386973979962407
    },
    {
      "verse": "4:113",
      "similarity": 0.14415057569525863
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:154.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:154.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:154.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}