{
  "chapter": "آل عمران",
  "text": "فبما رحمة من الله لنت لهم ولو كنت فظا غليظ القلب لانفضوا۟ من حولك فاعف عنهم واستغفر لهم وشاورهم فى الامر فاذا عزمت فتوكل على الله ان الله يحب المتوكلين",
  "translations": [
    {
      "translation": "It is a mercy from Allah that you were gentle with them. If you had been rough or hard of heart, they would have scattered from around you. So pardon them and ask forgiveness for them, and consult with them about the matter. Then when you have reached a firm decision, put your trust in Allah. Allah loves those who put their trust in Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was through God's mercy that you dealt with them gently; for had you been stern and hard of heart they would surely have broken away from you. So pardon them and pray that forgiveness be theirs, and seek their counsel in all affairs, And when you have come to a decision place your trust in God alone, for He loves those who place their trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was thanks to Allah's mercy that you were gentle to them. Had you been rough, hard-hearted, they would surely have scattered away from you. So pardon them, and pray for their forgiveness, and take counsel from them in matters of importance. And when you are resolved on a course of action place your trust in Allah; surely Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only through the Divine Mercy have you (Muhammad) been able to deal with your followers so gently. If you had been stern and hard-hearted, they would all have deserted you a long time ago. Forgive them and ask God to forgive (their sins) and consult with them in certain matters. But, when you reach a decision, trust God. God loves those who trust Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what a great mercy it is from Allah that you (O dear Prophet Mohammed – peace and blessings be upon him), are lenient towards them; and if you had been stern and hardhearted (unsympathetic) they would have certainly been uneasy in your company; so forgive them and intercede for them and consult with them in the conduct of affairs; and when you decide upon something, rely upon Allah; indeed Allah loves those who trust (Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the mercy of Allah, you dealt with them gently. And had you been severe and harsh-hearted, they would have broken away from about you; so pardon them, and ask forgiveness for them; and consult them in the affairs. Then when you have taken a decision, put your trust in Allah, certainly, Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it is due to mercy from Allah that you deal with them gently, and had you been rough, hard hearted, they would certainly have dispersed from around you; pardon them therefore and ask pardon for them, and take counsel with them in the affair; so when you have decided, then place your trust in Allah; surely Allah loves those who trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was by some mercy of God that thou wast gentle to them; hadst thou been harsh and hard of heart, they would have scattered from about thee. So pardon them, and pray forgiveness for them, and take counsel with them in the affair; and when thou art resolved, put thy trust in God; surely God loves those who put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was by the mercy of Allah that thou wast lenient with them (O Muhammad), for if thou hadst been stern and fierce of heart they would have dispersed from round about thee. So pardon them and ask forgiveness for them and consult with them upon the conduct of affairs. And when thou art resolved, then put thy trust in Allah. Lo! Allah loveth those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is by God's grace that you were gentle with them -- for if you had been harsh and hard-hearted, they would surely have deserted you -- so bear with them and pray for forgiveness for them. Take counsel with them in the conduct of affairs; then, when you have decided upon a course of action, place your trust in God: for God loves those who place their trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was then of the mercy of Allah that thou hast been gentle with them; and wert thou rough, hardhearted, they had surely dispersed from around thee. So pardon them thou, and ask thou forgiveness for them and take thou counsel with them in the affair, and when thou hast resolved, put thy trust in Allah. Verily Allah loveth the trustful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is by Allah’s mercy that you are gentle to them; had you been harsh and hardhearted, they would have surely scattered from around you. So excuse them and plead for forgiveness for them, and consult them in the affairs, and once you are resolved, put your trust in Allah. Indeed Allah loves those who trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is part of the Mercy of Allah that thou dost deal gently with them Wert thou severe or harsh-hearted, they would have broken away from about thee: so pass over (Their faults), and ask for (Allah's) forgiveness for them; and consult them in affairs (of moment). Then, when thou hast Taken a decision put thy trust in Allah. For Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the Mercy of Allah, you dealt with them gently. And had you been severe and harsh-hearted, they would have broken away from about you; so pass over (their faults), and ask (Allah's) Forgiveness for them; and consult them in the affairs. Then when you have taken a decision, put your trust in Allah, certainly, Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was by that Mercy of Allah that you (Prophet Muhammad) dealt so leniently with them. Had you been harsh and hardhearted, they would have surely deserted you. Therefore, pardon them and ask forgiveness for them. Take counsel with them in the matter and when you are resolved, put your trust in Allah. Allah loves those who trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is by of grace from God that you were gentle with them. Had you been harsh, hardhearted, they would have dispersed from around you. So pardon them, and ask forgiveness for them, and consult them in the conduct of affairs. And when you make a decision, put your trust in God; God loves the trusting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by mercy from Allah, [O Muhammad], you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:159] It was by the mercy of God that you, O Muhammad (s), were lenient with them, that is, [that] you showed indulgence [toward them] when they disobeyed you; had you been harsh, ill-natured, and fierce of heart, brutish and coarse towards them, they would have dispersed, split away, from about you. So pardon them, pass over what they have done, and ask forgiveness for them, for their sins, until I forgive them, and consult them, find out their opinions, in the matter, that is, your affair in the battle and otherwise, in order to win their hearts over and so that you may be emulated [in this respect]; and indeed, the Prophet (s) would frequently consult them. And when you are resolved, to carry out what you wish after counsel, rely on God, put your trust in Him and not in [any] counsel; for God loves those who rely, on Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء للتفريع على ما اشتمل عليه الكلام السابق الَّذي حُكي فيه مخالفة طوائف لأمر الرسول من مؤمنين ومنافقين ، وما حكي من عفو الله عنهم فيما صنعوا . ولأنّ في تلك الواقعة المحكية بالآيات السابقة مظاهر كثيرة من لين النَّبيء صلى الله عليه وسلم للمسلمين ، حيث استشارهم في الخروج ، وحيث لم يثرِّبهم على ما صنعوا من مغادرة مراكزهم ، ولمَّا كان عفو الله عنهم يعرف في معاملة الرّسول إيّاهم ، ألاَن الله لهم الرسول تحقيقاً لرحمته وعفوه ، فكان المعنى : ولقد عفا الله عنهم برحمته فَلاَن لهم الرسول بإذن الله وتكوينه إيّاه راحماً ، قال تعالى : { وما أرسلناك إلا رحمة للعالمين } \\[ الأنبياء : 107 \\] .والباء للمصاحبة ، أي لنتَ مع رحمة الله : إذ كان لينه في ذلك كلّه ليناً لا تفريط معه لشيء من مصالحهم ، ولا مجاراةً لهم في التساهل في أمر الدّين ، فلذلك كان حقيقاً باسم الرحمة .وتقديم المجرور مفيد للحصر الإضافي ، أي : برحمة من الله لا بغير ذلك من أحوالهم ، وهذا القصر مفيد التعريض بأنّ أحوالهم كانت مستوجبة الغلظ عليهم ، ولكن الله ألاَن خلق رسوله رحمة بهم ، لحكمة علمها الله في سياسة هذه الأمَّة .وزيدت ( ما ) بعد باء الجرّ لتأكيد الجملة بما فيه من القصر ، فتعيّنَ بزيادتها كون التَّقديم للحصر ، لا لمجرد الاهتمام ، ونبّه عليه في «الكشاف» .واللِينُ هنا مجاز في سعة الخلق مع أمّة الدعوة والمسلمين ، وفي الصفح عن جَفاء المشركين ، وإقالة العثرات . ودلّ فعل المضيّ في قوله : { لنت } على أنّ ذلك وصف تقرّر وعرف من خُلقه ، وأنّ فطرته على ذلك برحمة من الله إذ خلقَه كذلك { واللَّه أعلم حيث يجعل رسالاته } \\[ الأنعام : 124 \\] ، فخلق الرسول مُناسب لتحقيق حصول مراد الله تعالى من إرساله ، لأنّ الرسول يجيء بشريعة يبلّغها عن الله تعالى ، فالتبليغ متعيّن لا مصانعة فيه ، ولا يتأثّر بخلق الرسول ، وهو أيضاً مأمور بسياسة أمَّته بتلك الشريعة ، وتنفيذها فيهم ، وهذا عمل له ارتباط قوي بمناسبة خُلق الرسول لطباع أمّته حتَّى يلائم خلقه الوسائل المتوسَّل بها لحمل أمَّته على الشَّريعة الناجحة في البلوغ بهم إلى مراد الله تعالى منهم .أرسل محمَّد صلى الله عليه وسلم مفطوراً على الرحمة ، فكان لِينه رحمة من الله بالأمَّة في تنفيذ شريعته بدون تساهل وبرفق وإعانة على تحصيلها ، فلذلك جعل لينه مصاحباً لرحمةٍ من الله أودعها الله فِيه ، إذ هو قد بعث للنَّاس كافّة ، ولكن اختار الله أن تكون دعوته بين العرب أولَ شيء لحكمةٍ أرادها الله تعالى في أن يكون العرب هم مبلغي الشَّريعة للعالم .والعرب أمَّة عُرفت بالأنفة ، وإباء الضيم ، وسلامةِ الفطرة . وسرعةِ الفهم . وهم المتلقُّون الأوّلون للدين فلم تكن تليق بهم الشّدة والغلظة ، ولكنّهم محتاجون إلى استنزال طائرهم في تبليغ الشريعة لهم ، ليتجنّبوا بذلك المكابرةَ الَّتي هي الحائل الوحيد بينهم وبين الإذعان إلى الحقّ .وورد أن صفح النَّبيء صلى الله عليه وسلم وعفوه ورحمته كان سبباً في دخول كثير في الإسلام ، كما ذكر بعض ذلك عياض في كتاب الشفاء .فضمير { لهم } عائد على جميع الأمَّة كما هو مقتضى مقام التَّشريع وسياسة الأمَّة ، وليس عائداً على المسلمين الَّذين عصوا أمر الرسول يوم أُحُد ، لأنَّه لا يناسب قوله بعده : { لانفضوا من حولك } إذ لا يُظنّ ذلك بالمسلمين ، ولأنَّه لا يناسب قوله بعده : { وشاورهم في الأمر } إذا كان المراد المشاورة للاستعانة بآرائهم ، بل المعنى : لو كنت فظّاً لنفرك كثير ممّن استجاب لك فهلكوا ، أو يكون الضّمير عائداً على المنافقين المعبّر عنهم بقوله : { وطائفة قد أهمتهم أنفسهم } \\[ آل عمران : 154 \\] فالمعنى : ولو كنت فظّاً لأعلنوا الكفر وتفرّقوا عنك ، وليس المراد أنَّك لنت لهم في وقعة أُحُد خاصّة ، لأنّ قوله بعده : { ولو كنت فظاً غليظ القلب لانفضوا من حولك } إلخ ينافي ذلك المحمل .والفَظّ : السيء الخلق ، الجافي الطبع .والغليظ القلب : القاسِيه ، إذ الغلظة مجاز عن القسوة وقلّة التسامح ، كما كان اللين مجازاً في عكس ذلك ، وقالت جواري الأنصار لعمر حين انتهرهنّ «أنت أفظّ وأغلظ من رسول الله» يردن أنت فظّ وغليظ دون رسول الله .والانفضاض : التفرق . و { من حولك } أي من جهتك وإزائك ، يقال : حَوْله وحَوْلَيه وحَوَاليْه وحَوَالَه وحِيَالَه وبِحِيَالِه . والضّمير للذين حَوْل رسول الله ، أي الَّذين دخلوا في الدّين لأنَّهم لا يطيقون الشدّة ، والكلام تمثيل : شبّهت هيئة النفور منه وكراهية الدخول في دينه بالانفضاض من حوله أي الفرار عنه متفرّقين ، وهو يؤذَّن بأنَّهم حوله متّبعون له .والتَّفريع في قوله : { فاعف عنهم } على قوله : { لنت لهم } الآية ، لأنّ جميع الأفعال المأمور بها مناسب للين ، فأمَّا العفول والاستغفار فأمرهما ظاهر ، وأمَّا عطف { وشاورهم } فلأنّ الخروج إلى أُحُد كان عن تشاور معهم وإشارتهم ، ويشمل هذا الضّميرُ جميع الَّذين لاَن لهم صلى الله عليه وسلم وهم أصحابه الَّذين حوله سواء من صدر منهم أمر يوم أحُد وغيرهم .والمشاورة مصدر شاور ، والاسم الشُّورَى والمَشُورة بفتح الميم وضم الشِّين أصلها مَفْعُلة بضمّ العين ، فوقع فيها نقل حركة الواو إلى الساكن . قيل : المشاورة مشتقّة من شار الدابّة إذا اختبر جَريها عند العرض على المشتري ، وفعل شار الدابّة مشتقّ من المِشْوَار وهو المكان الَّذي تُركض فيه الدوابّ . وأصله معرّب ( نَشْخُوَار ) بالفارسية وهو ما تبقيه الدابّة من علفها . وقيل : مشتقّة من شار العسل أي جناه من الوقَبَة لأنّ بها يستخرج الحقّ والصّواب ، وإنَّما تكون في الأمر المهمّ المشكل من شؤون المرء في نفسه أو شؤون القبيلة أو شؤون الأمة .و ( أل ) في الأمر للجنس ، والمراد بالأمر المهمّ الَّذي يؤتمر له ، ومنه قولهم : أمْر أمِر ، وقال أبو سفيان لأصحابه في حديث هرقل :« لقد أمِر أمْرُ ابن أبي كَبشة ، إنَّه يَخافُه مَلِك بَنِي الأصفر » . وقيل : أريد بالأمر أمر الحرب فاللام للعهد .وظاهر الأمر أنّ المراد المشاورة الحقيقية الَّتي يقصد منها الاستعانة برأي المستشارَيْن بدليل قوله عقبه : { فإذا عزمت فتوكل على الله } فضمير الجميع في قوله : { وشاورهم } عائد على المسلمين خاصة : أي شاور الَّذين أسلموا مِن بين مَن لنت لهم ، أي لا يصدّك خطل رأيهم فيما بدا منهم يوم أحُد عن أن تستعين برأيهم في مواقع أخرى ، فإنَّما كان ما حصل فلتة منهم ، وعشرة قد أقَلْتَهم منها .ويحتمل أن يراد استشارة عبد الله بن أبي وأصحابه ، فالمراد الأخذ بظاهر أحوالهم وتأليفهم ، لعلّهم أن يُخلصوا الإسلام أو لا يزيدوا نفاقاً ، وقطعاً لأعذارهم فيما يستقبل .وقد دلّت الآية على أن الشُّورى مأمور بها الرسُول صلى الله عليه وسلم فيما عبّر عنه ب ( الأمر ) وهو مُهمّات اللأمّة ومصالحها في الحرب وغيره ، وذلك في غير أمر التَّشريع لأنّ أمر التَّشريع إن كان فيه وحي فلا محيد عنه ، وإن لم يكن فيه وحي وقلنا بجواز الاجتهاد للنَّبيء صلى الله عليه وسلم في التَّشريع فلا تدخل فيه الشورى لأنّ شأن الاجتهاد أن يستند إلى الأدلّة لا للآراء ، والمجتهد لا يستشير غيره إلاّ عند القضاء باجتهاده . كما فعل عُمر وعُثمان .فتعيّن أنّ المشاورة المأمور بها هنا هي المشاورة في شؤون الأمَّة ومصالحها ، وقد أمر الله بها هنا ومدحها في ذكر الأنصار في قوله تعالى : { وأمرهم شورى بينهم } \\[ الشورى : 38 \\] واشترطها في أمر العائلة فقال : { فإن أرادا فصالا عن تراض منهما وتشاور فلا جناح عليهما } \\[ البقرة : 233 \\] . فشرع بهاته الآيات المشاورة في مراتب المصالح كلّها : وهي مصالح العائلة ومصالح القبيلة أو البلد ، ومصالح الأمَّة .واختلف العلماء في مدلول قوله : { وشاورهم } هل هو للوجوب أو للندب ، وهل هو خاصّ بالرسول عليه الصلاة السَّلام ، أو عامّ له ولولاة أمور الأمَّة كلّهم .فَذهب المالكية إلى الوجوب والعموم ، قال ابن خُوَيْز منداد : واجب على الولاة المشاورة ، فيُشاورون العلماء فيما يشكل من أمور الدّين ، ويشاورون وجوه الجيش فيما يتعلّق بالحرب ، ويشاورون وجوه النَّاس فيما يتعلَّق بمصالحهم ويشاورون وجوه الكتّاب والعمّال والوزراء فيما يتعلّق بمصالح البلاد وعمارتها . وأشار ابن العربي إلى وجوبها بأنَّها سبب للصّواب فقالَ : والشورى مِسبار العقل وسبب الصّواب . يشير إلى أنَّنا مأمورون بتحرّي الصّواب في مصالح الأمَّة ، وما يتوقّف عليه الواجب فهو واجب . وقال ابن عطية : الشورى من قواعد الشَّريعة وعزائم الأحكام ، ومن لا يستشير أهل العلم والدين فعزله واجب ، وهذا ما لا اختلاف فيه . واعتراض عليه ابن عرفة قوله : فعزله واجب ولم يعترض كونَها واجبة ، إلاّ أنّ ابن عطية ذكر ذلك جازماً به وابن عرفة اعترضه بالقياس على قول علماء الكلام بعدم عزل الأمير إذا ظهر فسقه ، يعني ولا يزيد تركُ الشورى على كونه تركَ واجب فهو فسق .وقلت : من حفظ حجَّة على من لم يحفظ ، وإنّ القياس فيه فارق معتبر فإنّ الفسق مضرّته قاصرة على النفس وترك التشاور تعريض بمصالح المسلمين للخطر والفوات ، ومحمل الأمر عند المالكية للوجوب والأصل عندهم عدم الخصوصية في التَّشريع إلاّ لدليل .وعن الشافعي أنّ هذا الأمر للاستحباب ، ولتقتدي به الأمّة ، وهو عامّ للرسول وغيره ، تطييباً لنفوس أصحابه ورفعاً لأقدارهم ، وروى مثله عن قتادة ، والرّبيع ، وابن إسحاق . وردّ هذا أبو بكر أحمدُ بن عليّ الرازي الحنفي المشهور بالجَصّاص بقوله : لو كان معلوماً عندهم أنَّهم إذا استَفرغوا جهدهم في استنباط الصّواب عمَّا سُئِلُوا عنه ، ثُمّ لم يكن معمولاً به ، لم يكن في ذلك تطييب لنفوسهم ولا رفع لأقدارهم ، بل فيه إيحاشُهم فالمشاورة لم تفد شيئاً فهذا تأويل ساقط . وقال النووي ، في صدر كتاب الصلاة من «شرح مسلم» : الصحيح عندهم وجوبها وهو المختار . وقال الفخر : ظاهر الأمر أنَّه للوجوب . ولم ينسب العلماء للحنفية قولاً في هذا الأمر إلا أنّ الجَصّاص قال في كتابه أحكام القرآن عند قوله تعالى : { وأمرهم شورى بينهم } ) : هذا يدلّ على جلالة وقع المَشُورة لذكرها مع الإيمان وإقامة الصّلاة ويدلّ على أنَّنا مأمورون بها . ومجموع كلامي الجصّاص يدلّ أن مذهب أبي حنيفة وجوبها .ومن السلف من ذهب إلى اختصاص الوجوب بالنَّبيء صلى الله عليه وسلم قاله الحسن وسفيان ، قالا : وإنَّما أمر بها ليقتدى به غيره وتشيع في أمَّته وذلك فيما لا وحي فيه . وقد استشار النَّبيء صلى الله عليه وسلم أصحابه في الخروج لبدر ، وفي الخروج إلى أحُد ، وفي شأن الأسرى يوم بدر ، واستشار عموم الجيش في رَدِّ سبي هوازن .والظاهر أنَّها لا تكون في الأحكام الشرعية لأنّ الأحكام إن كانت بوحي فظاهر ، وإن كانت اجتهادية ، بناء على جواز الاجتهاد للنَّبيء صلى الله عليه وسلم في الأمور الشرعية ، فالاجتهاد إنَّما يستند للأدلَّة لا للآراء وإذا كان المجتهد من أمَّته لا يستشير في اجتهاده ، فكيف تجب الاستشارة على النَّبيء صلى الله عليه وسلم مع أنَّه لو اجتهد وقلنا بجواز الخطإ عليه فإنَّه لا يُقرّ على خطإ باتّفاق العلماء . ولم يزل من سنّة خلفاء العدل استشارة أهل الرأي في مصالح المسلمين ، قال البخاري في كتاب الاعتصام من «صحيحه» : «وكانت الأئمة بعد النَّبيء صلى الله عليه وسلم يستشيرون الأمناء من أهل العلم ، وكان القُرّاء أصحابَ مشُورة عمَرَ : كُهولاً كانوا أو شُبَّاناً ، وكان وقّافاً عند كتاب الله» . وأخرج الخطيب عن عليّ قال : «قلت : يا رسول الله الأمر ينزل بعدَك لم يَنزل فيه قرآن ولم يسْمع منك فيه شيء قال : اجمعوا له العابِد من أمّتي واجعلوه بينكم شُورى ولا تقضوه برأي واحد» واستشار أبو بكر في قتال أهل الردّة ، وتشاور الصّحابةُ في أمر الخليفة بعد وفاة النَّبيء صلى الله عليه وسلم وجعل عمر رضي الله عنه الأمر شورى بعده في ستَّة عيّنهم ، وجعل مراقبة الشورى لِخمسين من الأنصار ، وكان عمر يكتب لعمّاله يأمرهم بالتَّشاور ، ويتمثّل لهم في كتابه بقول الشاعر ( لم أقف على اسمه ) :خَلِيلَيّ ليسَ الرأيُ في صَدرِ واحد ... أشِيرا عَلَيّ بالَّذِي تَرَيَانِهذا والشورى ممَّا جبل لله عليه الإنسان في فطرته السليمة أي فطره على محبّة الصلاح وتطلّب النجاح في المساعي ، ولذلك قرن الله تعالى خلق أصل البشر بالتَّشاور في شأنه إذ قال للملائكة : { إني جاعل في الأرض خليفة } \\[ البقرة : 30 \\] ، إذ قد غَنِي الله عن إعانة المخلوقات في الرأي ولكنَّه عرض على الملائكة مراده ليكون التَّشاور سنّة في البشر ضرورة أنّه مقترن بتكوينه ، فإنّ مقارنة الشيء للشيء في أصل التكوين يوجب إلفه وتعارفه ، ولمَّا كانت الشورى معنى من المعاني لا ذات لها في الوجود جعل الله إلفها للبشر بطريقة المقارنة في وقت التكوين . ولم تزل الشورى في أطوار التاريخ رائجة في البشر فقد استشار فرعون في شأن موسى عليه السَّلام فيما حكى الله عنه بقوله : { فماذا تأمرون } \\[ الأعراف : 110 \\] . واستشارت بلقيس في شأن سليمان عليه السلام فيما حكى الله عنها بقوله : { قالت يأيها الملأ أفتوني في أمري ما كنت قاطعة أمرا حتى تشهدون وإنَّما يلهي النَّاس عنها حبّ الاستبداد ، وكراهية سماع ما يخالف الهوى ، وذلك من انحراف الطبائع وليس من أصل الفطرة ، ولذلك يهرع المستبدّ إلى الشورى عند المضائق . قال ابن عبد البرّ في بهجة المجالس : الشورى محمودة عند عامّة العلماء ولا أعلم أحداً رضِي الاستبداد إلاّ رجل مفتون مخادع لمن يطلب عنده فائدة ، أو رجل فاتك يحاول حين الغفلة ، وكلا الرجلين فاسق . ومثَل أوّلهما قول عمر بن أبي ربيعة :واستَبَدّت مَرّة واحِدة ... إنَّمَا العَاجِز مَن لا يستبدّومَثل ثانيهما قول سَعْد بن نَاشِب :إذا هَمّ ألقَى بين عينيه عزمه ... ونَكَّب عن ذِكْر العواقب جانباًولم يستَشِرْ في أمره غَير نفسه ... ولم يَرْضَ إلا قَائم السيف صاحباًومن أحسن ما قيل في الشورى قول بشار بن برد :إذا بَلغ الرأيُ المَشُورة فاستَعن ... بحزم نصيح أو نصيحة حازمولا تحسب الشُورى عليك غضاضة ... مَكانُ الخَوافي قُوّة للقَوادِموهي أبيات كثيرة مثبتة في كتب الأدب .وقوله : فإذا عزمت فتوكل على الله } العزم هو تصميم الرأي على الفعل وحُذف متعلَّق ( عزمت ) لأنَّه دلّ عليه التفريع عن قوله : { وشاورهم في الأمر } ، فالتقدير : فإذا عزمت على الأمر . وقد ظهر من التفريع أنّ المراد : فإذا عزمت بعد الشورى أي تبيّن لك وجه السداد فيما يجب أن تسلكه فعزمت على تَنفيذه سواء كان على وفق بعض آراء أهل الشورى أم كان رأياً آخر لاح للرّسول سدادُه فقد يَخْرج من آراء أهل الشورى رأي ، وفي المثل : «مَا بَيْنَ الرأيَيْن رأي» .وقوله : { فتوكل على الله } التوكُّل حقيقته الاعتماد ، وهو هنا مجاز في الشروع في الفعل مع رجاء السداد فيه من الله ، وهو شأن أهل الإيمان ، فالتوكّل انفعال قلبي عقلي يتوجّه به الفاعل إلى الله راجياً الإعانة ومستعيذاً من الخيبة والعوائق ، وربَّما رافقه قول لساني وهو الدعاء بذلك . وبذلك يَظهر أن قوله : { فتوكل على الله } دليل على جواب إذَا ، وفَرع عنه ، والتقدير : فإذَا عزمت فَبَادر ولا تتأخّر وتَوكَّل على الله ، لأنّ للتأخّر آفاتتٍ ، والتردّد يضيّع الأوقات ، ولو كان التَّوكل هو جواب إذا لما كان للشورى فائدة لأنّ الشورى كما علمت لقصد استظهار أنفع الوسائل لحصول الفعل المرغوب على أحسن وجه وأقربه ، فإنّ القصد منها العمل بما يتضّح منها ، ولو كان المراد حصول التوكّل من أوّل خطور الخاطر ، لما كان للأمر بالشورى من فائدة . وهذه الآية أوضح آية في الإرشاد إلى معنى التَّوكل الَّذي حرَف القاصرون ومن كان على شاكلتهم معناه ، فأفسدوا هذا الدين من مبناه .وقوله : { إن الله يحب المتوكلين } لأنّ التوكّل علامة صدق الإيمان ، وفيه ملاحظة عظمة الله وقدرته ، واعتقادُ الحاجة إليه ، وعدم الاستغناء عنه وهذا ، أدب عظيم مع الخالق يدلّ على محبّة العبد ربّه فلذلك أحبَّه الله .\n\n",
      "translations": [
        {
          "translation": "(It was by the mercy of Allah that thou wert lenient with them (0 Muhammad), for if thou hadst been stern) harsh in speech (and fierce of heart) coarse with them (they would have dispersed from round about thee. So pardon them) pardon your Companions for that which may ensue from them (and ask forgiveness for them) from that transgression which ensues from them (and consult with them upon the conduct of affairs) in matter of war. (And when thou art resolved) to do something, (then put your trust in Allah) to give you triumph and domination. (Lo! Allah loveth those who put their trust) in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَنْفَضُّواْ مِنْ حَوْلِكَ } معناهُ لانْصَرَفوا فِي الأَرضِ بكُلِّ وَجهٍ\n\n\n\n\nوقوله تعالى: { فَإِذَا عَزَمْتَ } معناه أَجْمَعتَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They have spread out on the earth}, means that they have dispersed in all directions on the earth.\n\n\nAnd the saying of Allah, \"When you have decided\" - its meaning is that you have agreed unanimously.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبِمَا رَحْمَةٍ } أي: فبرحمة نازلة لك يا أكمل الرسل { مِّنَ ٱللَّهِ } المرسل لك\n رحمةً للعالمين { لِنتَ لَهُمْ } حين مخالفتهم عن إطاعتك واتباعك { وَلَوْ كُنْتَ فَظّاً } سيء الخلق { غَلِيظَ ٱلْقَلْبِ } قاسية { لاَنْفَضُّواْ } تفتتوا وتفرقوا البتة { مِنْ حَوْلِكَ } وإن آذوك جهلاً وغلفةً { فَٱعْفُ عَنْهُمْ } تلطفاً وترحماً على مقتضى نبوتك\n\n\n{ وَ } بعد عفوك { ٱسْتَغْفِرْ لَهُمْ } من الله ليغفر زلتهم\n لأنك مصلحهم ومولي أمرهم { وَ } بعد عفوك عما لك\n واستغفارك عما لله { شَاوِرْهُمْ فِي ٱلأَمْرِ } أي: الرخص المتعلقة لترويج الدين والإيمان بعدما تركت المشورة معهم\n بسبب جريمتهم { فَإِذَا عَزَمْتَ } فالعزيمة لك خاصة\n بلا مشورة الغير { فَتَوَكَّلْ } في عزائمك { عَلَى ٱللَّهِ } واتخذه وكيلاً\n ولا تلتفت إلى الغير مطلقاً { إِنَّ ٱللَّهَ } الهادي لعباده { يُحِبُّ ٱلْمُتَوَكِّلِينَ } [آل عمران: 159] المتخذين الله وكيلاً\n المفوضين أمورهم كلها إليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { فبما }: صلة. والفظ، الجافي، يقال: فظ فظاظةً وفظوظاً، ورجل فظ، وامرأة فظة، والفض - بغير المشالة: التفرق، ويطلق على الكسر، ومنه: لا يفضض الله فاك. يقول الحقّ جلّ جلاله: فبرحمة من الله ونعمة كنت سهلاً ليناً رفيقاً، فحين عصوا أمرك، وفروا عنك، ألنت لهم جانبك، ورفقت بهم، بل اغتممت من أجلهم مما أصابهم، { ولو كنت فظّاً } جافياً سيىء الخلق { غليظ القلب } قاسيَهُ فأغلظت لهم القول، { لانفضوا من حولك } أي: لتفرقوا عنك، ولم يسكنوا إليك، { فاعف عنهم } فيما يختص بك، { واستغفر لهم } في حق ربك حتى يشفعك فيهم { وشاورهم في الأمر } الذي يصح أن يشاور فيه تطييباً لخاطرهم، ورفعاً لأقدارهم، واستخراجاً وتمهيداً لسنة المشاورة لغيرهم، وخصوصاً الأمراء. قال عليه الصلاة والسلام:\n \" ما شقا عبد بمشورة، وما سعد باستغناء برأي \" \nقال أيضاً:\n \" مَا خَابَ من اسْتَخَارَ، وَلاَ نَدِمَ من اسْتَشَارَ \" \nوقال أيضاً - عليه الصلاة والسلام -\n \" إذَا كَانَ أُمَرَاؤُكُمْ خِيَارَكُمْ، وَأَغْنِيَاؤُكُمْ أَسخيَاءَكُمْ، وأَمرُكُم شُورَى بَيْنَكُم، فَظَهْرُ الأرْض خَيْرٌ لَكُمْ مِنْ بَطْنِهَا. وإذا كَانَ أُمَرَاؤُكُمْ شِرَارَكُمْ وأَغْنِيَاؤُكُمْ بُخَلاءَكُمْ، ولم تكن أموركم شُورَى بَيْنَكُم، فبَطْنُ الأرْضِ خَيرٌ من ظَهْرِهَا \". \n{ فإذا عزمت } على شيء بعد الشورى، { فتوكل على الله } أي: ثق به وكيلاً، { إن الله يحب المتوكلين } فينصرهم ويهديهم إلى ما فيه صلاحهم. الإشارة: ما اتصف به نبينا - عليه الصلاة والسلام - من السهولة والليونة والرفق بالأمة، اتصفت به ورثته من الأولياء العارفين، والعلماء الراسخين، ليتهيأ لهم الدعوة إلى الله، أو إلى أحكام الله، ولو كانوا فظاظاً غلاظاً لانفض الناس من حولهم، ولم يتهيأ لهم تعريف ولا تعليم، فينبغي لهم أن يعفوا ويصفحوا ويغفروا ويصبروا على جفوة الناس، ويستغفروا لهم، ويشاوروهم في أمورهم، اقتداء برسولهم، فإذا عزموا على إمضاء شيء فليتوكلوا على الله { إن الله يحب المتوكلين }. قال الجنيد - رضي الله عنه -: التوكل أن تقبل بالكلية على ربك وتعرض عمن دونه. وقال الثوري: أن تفني تدبيرك في تدبيره، وترضى بالله وكيلاً ومدبراً، قال الله تعالى:\n[النِّساء: 81]. وقال ذو النون: خُلع الأرباب، وقطع الأسباب وقال الخواص: قطع الخوف والرجاء مما سوى الله تعالى. وقال العرجي: رد العيش إلى يوم واحد، وإسقاط هم غد. هـ. وقال سهل: معرفة معطي أرزاق المخلوقين، ولا يصح لأحد التوكل حتى تكون عنده السماء كالصفر والأرض كالحديد، لا ينزل من السماء قطر، ولا يخرج من الأرض نبات، ويعلم أن الله لا ينسى له ما ضمن من رزقه بيه هذين. هـ. وقيل: هو اكتفاء العبد الذليل بالرب الجليل، كاكتفاء الخليل بالخليل، حين لم ينظر إلى عناية جبريل.\nوقيل لبهلوان المجنون: متى يكون العبد متوكلاً؟ قال: إذا كان بالنفس غريباً بين الخلق، وبالقلب قريباً إلى الحق. وقال النبيّ صلى الله عليه وسلم:\n \" مَنْ سَرَّهُ أنْ يَكُونَ أكْرَم النَّاسِ فَلْيَتقِ الله، ومَنْ سَرَّه أن يكُون أغْنَى النَّاس فليكنِ بما في يد الله أوثق منه بما في يَده \". \nقال ابن جزي: التوكل هو الاعتماد على الله في تحصيل المنافع وحفظها بعد حصولها، وفي دفع المضرات ورفعها بعد وقوعها، وهو من أعلى المقامات، لوجهين: أحدهما: قوله: { إن الله يحب المتوكلين } ، والآخر: الضمان الذي في قوله:\n[الطّلاَق: 3]، وقد يكون واجباً لقوله:\n[المَائدة: 23]، فجعله شرطاً في الإيمان، ولظاهر قوله:\n[آل عِمرَان: 122] فإن الأمر محمول على الوجوب. واعلم أن الناس في التوكل على ثلاث مراتب: الأولى: أن يعتمد العبد على ربه، كاعتماد الإنسان على وكيله المأمون عنده، الذي لا يشك في نصحيته له وقيامه بمصالحه. الثانية: أن يكون العبد مع ربه كالطفل مع أمه لا يعرف سواها ولا يلجأ إِلاَّ إليها. الثالثة: أن يكون العبد مع ربه كالميت بين يدي الغاسل، قد أسلم إليه نفسه بالكلية. فصاحب الدرجة الأولى عنده حظ من النظر لنفسه، بخلاف صاحب الثانية. وصاحب الثانية له حظ من الاختيار، بخلاف صاحب الثالثة. وهذه الدرجات مبنية على التوحيد الخاص، الذي تكلمتُ عليه في قوله:\n[البَقَرَة: 163]، فهي تقوى بقوته وتضعف بضعفه. فإن قيل: هل يشترط في التوكل ترك الأسباب أم لا؟ فالجواب: أن الأسباب على ثلاثة أقسام: أحدها: سبب معلوم قطعاً قد أجراه الله، فهذا لا يجوز تركه كالأكل لرفع الجوع وللباس لرفع البرد. الثاني: سبب مظنون: كالتجارة وطلب المعاش، وشبه ذلك، فهذا لا يقدح فعله في التوكل، فإن التوكل من أعمال القلوب لا من أعمال البدن، ويجوز تركه لمن قوي عليه. والثالث: سبب موهوم بعيد، فهذا يقدح فعله في التوكل، قلت: ولعل هذا مثل طلب الكيمياء والكنوز وعلم النار والسحر، وشبه ذلك. ثم فوق التوكل التفويض، وهو: الاستسلام لأمر الله تعالى بالكلية، فإن المتوكل له مراد واختيار، وهو يطلب مراده في الاعتماد على ربه، وأما المفوض فليس له مراد ولا اختيار، بل أسند الاختيار إلى الله تعالى، فهو أكمل أدباً مع الله. هـ. وأصله للغزالي، وسيأتي بقية الكلام عند قوله:\n[الفُرقان: 58]. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:38",
      "similarity": 0.23255797469585918
    },
    {
      "verse": "19:29",
      "similarity": 0.19695322920129962
    },
    {
      "verse": "2:233",
      "similarity": 0.18941341949609314
    },
    {
      "verse": "20:44",
      "similarity": 0.1887571071759415
    },
    {
      "verse": "59:5",
      "similarity": 0.1758631885483994
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003159.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003159.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:159.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}