{
  "chapter": "آل عمران",
  "text": "فبما رحمة من الله لنت لهم ولو كنت فظا غليظ القلب لانفضوا۟ من حولك فاعف عنهم واستغفر لهم وشاورهم فى الامر فاذا عزمت فتوكل على الله ان الله يحب المتوكلين",
  "translations": [
    {
      "translation": "It is a mercy from Allah that you were gentle with them. If you had been rough or hard of heart, they would have scattered from around you. So pardon them and ask forgiveness for them, and consult with them about the matter. Then when you have reached a firm decision, put your trust in Allah. Allah loves those who put their trust in Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was through God's mercy that you dealt with them gently; for had you been stern and hard of heart they would surely have broken away from you. So pardon them and pray that forgiveness be theirs, and seek their counsel in all affairs, And when you have come to a decision place your trust in God alone, for He loves those who place their trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was thanks to Allah's mercy that you were gentle to them. Had you been rough, hard-hearted, they would surely have scattered away from you. So pardon them, and pray for their forgiveness, and take counsel from them in matters of importance. And when you are resolved on a course of action place your trust in Allah; surely Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only through the Divine Mercy have you (Muhammad) been able to deal with your followers so gently. If you had been stern and hard-hearted, they would all have deserted you a long time ago. Forgive them and ask God to forgive (their sins) and consult with them in certain matters. But, when you reach a decision, trust God. God loves those who trust Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what a great mercy it is from Allah that you (O dear Prophet Mohammed – peace and blessings be upon him), are lenient towards them; and if you had been stern and hardhearted (unsympathetic) they would have certainly been uneasy in your company; so forgive them and intercede for them and consult with them in the conduct of affairs; and when you decide upon something, rely upon Allah; indeed Allah loves those who trust (Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the mercy of Allah, you dealt with them gently. And had you been severe and harsh-hearted, they would have broken away from about you; so pardon them, and ask forgiveness for them; and consult them in the affairs. Then when you have taken a decision, put your trust in Allah, certainly, Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it is due to mercy from Allah that you deal with them gently, and had you been rough, hard hearted, they would certainly have dispersed from around you; pardon them therefore and ask pardon for them, and take counsel with them in the affair; so when you have decided, then place your trust in Allah; surely Allah loves those who trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was by some mercy of God that thou wast gentle to them; hadst thou been harsh and hard of heart, they would have scattered from about thee. So pardon them, and pray forgiveness for them, and take counsel with them in the affair; and when thou art resolved, put thy trust in God; surely God loves those who put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was by the mercy of Allah that thou wast lenient with them (O Muhammad), for if thou hadst been stern and fierce of heart they would have dispersed from round about thee. So pardon them and ask forgiveness for them and consult with them upon the conduct of affairs. And when thou art resolved, then put thy trust in Allah. Lo! Allah loveth those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is by God's grace that you were gentle with them -- for if you had been harsh and hard-hearted, they would surely have deserted you -- so bear with them and pray for forgiveness for them. Take counsel with them in the conduct of affairs; then, when you have decided upon a course of action, place your trust in God: for God loves those who place their trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was then of the mercy of Allah that thou hast been gentle with them; and wert thou rough, hardhearted, they had surely dispersed from around thee. So pardon them thou, and ask thou forgiveness for them and take thou counsel with them in the affair, and when thou hast resolved, put thy trust in Allah. Verily Allah loveth the trustful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is by Allah’s mercy that you are gentle to them; had you been harsh and hardhearted, they would have surely scattered from around you. So excuse them and plead for forgiveness for them, and consult them in the affairs, and once you are resolved, put your trust in Allah. Indeed Allah loves those who trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is part of the Mercy of Allah that thou dost deal gently with them Wert thou severe or harsh-hearted, they would have broken away from about thee: so pass over (Their faults), and ask for (Allah's) forgiveness for them; and consult them in affairs (of moment). Then, when thou hast Taken a decision put thy trust in Allah. For Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the Mercy of Allah, you dealt with them gently. And had you been severe and harsh-hearted, they would have broken away from about you; so pass over (their faults), and ask (Allah's) Forgiveness for them; and consult them in the affairs. Then when you have taken a decision, put your trust in Allah, certainly, Allah loves those who put their trust (in Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was by that Mercy of Allah that you (Prophet Muhammad) dealt so leniently with them. Had you been harsh and hardhearted, they would have surely deserted you. Therefore, pardon them and ask forgiveness for them. Take counsel with them in the matter and when you are resolved, put your trust in Allah. Allah loves those who trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is by of grace from God that you were gentle with them. Had you been harsh, hardhearted, they would have dispersed from around you. So pardon them, and ask forgiveness for them, and consult them in the conduct of affairs. And when you make a decision, put your trust in God; God loves the trusting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by mercy from Allah, [O Muhammad], you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:159] It was by the mercy of God that you, O Muhammad (s), were lenient with them, that is, [that] you showed indulgence [toward them] when they disobeyed you; had you been harsh, ill-natured, and fierce of heart, brutish and coarse towards them, they would have dispersed, split away, from about you. So pardon them, pass over what they have done, and ask forgiveness for them, for their sins, until I forgive them, and consult them, find out their opinions, in the matter, that is, your affair in the battle and otherwise, in order to win their hearts over and so that you may be emulated [in this respect]; and indeed, the Prophet (s) would frequently consult them. And when you are resolved, to carry out what you wish after counsel, rely on God, put your trust in Him and not in [any] counsel; for God loves those who rely, on Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It was by the mercy of Allah that thou wert lenient with them (0 Muhammad), for if thou hadst been stern) harsh in speech (and fierce of heart) coarse with them (they would have dispersed from round about thee. So pardon them) pardon your Companions for that which may ensue from them (and ask forgiveness for them) from that transgression which ensues from them (and consult with them upon the conduct of affairs) in matter of war. (And when thou art resolved) to do something, (then put your trust in Allah) to give you triumph and domination. (Lo! Allah loveth those who put their trust) in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَنْفَضُّواْ مِنْ حَوْلِكَ } معناهُ لانْصَرَفوا فِي الأَرضِ بكُلِّ وَجهٍ\n\n\n\n\nوقوله تعالى: { فَإِذَا عَزَمْتَ } معناه أَجْمَعتَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They have spread out on the earth}, means that they have dispersed in all directions on the earth.\n\n\nAnd the saying of Allah, \"When you have decided\" - its meaning is that you have agreed unanimously.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبِمَا رَحْمَةٍ } أي: فبرحمة نازلة لك يا أكمل الرسل { مِّنَ ٱللَّهِ } المرسل لك\n رحمةً للعالمين { لِنتَ لَهُمْ } حين مخالفتهم عن إطاعتك واتباعك { وَلَوْ كُنْتَ فَظّاً } سيء الخلق { غَلِيظَ ٱلْقَلْبِ } قاسية { لاَنْفَضُّواْ } تفتتوا وتفرقوا البتة { مِنْ حَوْلِكَ } وإن آذوك جهلاً وغلفةً { فَٱعْفُ عَنْهُمْ } تلطفاً وترحماً على مقتضى نبوتك\n\n\n{ وَ } بعد عفوك { ٱسْتَغْفِرْ لَهُمْ } من الله ليغفر زلتهم\n لأنك مصلحهم ومولي أمرهم { وَ } بعد عفوك عما لك\n واستغفارك عما لله { شَاوِرْهُمْ فِي ٱلأَمْرِ } أي: الرخص المتعلقة لترويج الدين والإيمان بعدما تركت المشورة معهم\n بسبب جريمتهم { فَإِذَا عَزَمْتَ } فالعزيمة لك خاصة\n بلا مشورة الغير { فَتَوَكَّلْ } في عزائمك { عَلَى ٱللَّهِ } واتخذه وكيلاً\n ولا تلتفت إلى الغير مطلقاً { إِنَّ ٱللَّهَ } الهادي لعباده { يُحِبُّ ٱلْمُتَوَكِّلِينَ } [آل عمران: 159] المتخذين الله وكيلاً\n المفوضين أمورهم كلها إليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { فبما }: صلة. والفظ، الجافي، يقال: فظ فظاظةً وفظوظاً، ورجل فظ، وامرأة فظة، والفض - بغير المشالة: التفرق، ويطلق على الكسر، ومنه: لا يفضض الله فاك. يقول الحقّ جلّ جلاله: فبرحمة من الله ونعمة كنت سهلاً ليناً رفيقاً، فحين عصوا أمرك، وفروا عنك، ألنت لهم جانبك، ورفقت بهم، بل اغتممت من أجلهم مما أصابهم، { ولو كنت فظّاً } جافياً سيىء الخلق { غليظ القلب } قاسيَهُ فأغلظت لهم القول، { لانفضوا من حولك } أي: لتفرقوا عنك، ولم يسكنوا إليك، { فاعف عنهم } فيما يختص بك، { واستغفر لهم } في حق ربك حتى يشفعك فيهم { وشاورهم في الأمر } الذي يصح أن يشاور فيه تطييباً لخاطرهم، ورفعاً لأقدارهم، واستخراجاً وتمهيداً لسنة المشاورة لغيرهم، وخصوصاً الأمراء. قال عليه الصلاة والسلام:\n \" ما شقا عبد بمشورة، وما سعد باستغناء برأي \" \nقال أيضاً:\n \" مَا خَابَ من اسْتَخَارَ، وَلاَ نَدِمَ من اسْتَشَارَ \" \nوقال أيضاً - عليه الصلاة والسلام -\n \" إذَا كَانَ أُمَرَاؤُكُمْ خِيَارَكُمْ، وَأَغْنِيَاؤُكُمْ أَسخيَاءَكُمْ، وأَمرُكُم شُورَى بَيْنَكُم، فَظَهْرُ الأرْض خَيْرٌ لَكُمْ مِنْ بَطْنِهَا. وإذا كَانَ أُمَرَاؤُكُمْ شِرَارَكُمْ وأَغْنِيَاؤُكُمْ بُخَلاءَكُمْ، ولم تكن أموركم شُورَى بَيْنَكُم، فبَطْنُ الأرْضِ خَيرٌ من ظَهْرِهَا \". \n{ فإذا عزمت } على شيء بعد الشورى، { فتوكل على الله } أي: ثق به وكيلاً، { إن الله يحب المتوكلين } فينصرهم ويهديهم إلى ما فيه صلاحهم. الإشارة: ما اتصف به نبينا - عليه الصلاة والسلام - من السهولة والليونة والرفق بالأمة، اتصفت به ورثته من الأولياء العارفين، والعلماء الراسخين، ليتهيأ لهم الدعوة إلى الله، أو إلى أحكام الله، ولو كانوا فظاظاً غلاظاً لانفض الناس من حولهم، ولم يتهيأ لهم تعريف ولا تعليم، فينبغي لهم أن يعفوا ويصفحوا ويغفروا ويصبروا على جفوة الناس، ويستغفروا لهم، ويشاوروهم في أمورهم، اقتداء برسولهم، فإذا عزموا على إمضاء شيء فليتوكلوا على الله { إن الله يحب المتوكلين }. قال الجنيد - رضي الله عنه -: التوكل أن تقبل بالكلية على ربك وتعرض عمن دونه. وقال الثوري: أن تفني تدبيرك في تدبيره، وترضى بالله وكيلاً ومدبراً، قال الله تعالى:\n[النِّساء: 81]. وقال ذو النون: خُلع الأرباب، وقطع الأسباب وقال الخواص: قطع الخوف والرجاء مما سوى الله تعالى. وقال العرجي: رد العيش إلى يوم واحد، وإسقاط هم غد. هـ. وقال سهل: معرفة معطي أرزاق المخلوقين، ولا يصح لأحد التوكل حتى تكون عنده السماء كالصفر والأرض كالحديد، لا ينزل من السماء قطر، ولا يخرج من الأرض نبات، ويعلم أن الله لا ينسى له ما ضمن من رزقه بيه هذين. هـ. وقيل: هو اكتفاء العبد الذليل بالرب الجليل، كاكتفاء الخليل بالخليل، حين لم ينظر إلى عناية جبريل.\nوقيل لبهلوان المجنون: متى يكون العبد متوكلاً؟ قال: إذا كان بالنفس غريباً بين الخلق، وبالقلب قريباً إلى الحق. وقال النبيّ صلى الله عليه وسلم:\n \" مَنْ سَرَّهُ أنْ يَكُونَ أكْرَم النَّاسِ فَلْيَتقِ الله، ومَنْ سَرَّه أن يكُون أغْنَى النَّاس فليكنِ بما في يد الله أوثق منه بما في يَده \". \nقال ابن جزي: التوكل هو الاعتماد على الله في تحصيل المنافع وحفظها بعد حصولها، وفي دفع المضرات ورفعها بعد وقوعها، وهو من أعلى المقامات، لوجهين: أحدهما: قوله: { إن الله يحب المتوكلين } ، والآخر: الضمان الذي في قوله:\n[الطّلاَق: 3]، وقد يكون واجباً لقوله:\n[المَائدة: 23]، فجعله شرطاً في الإيمان، ولظاهر قوله:\n[آل عِمرَان: 122] فإن الأمر محمول على الوجوب. واعلم أن الناس في التوكل على ثلاث مراتب: الأولى: أن يعتمد العبد على ربه، كاعتماد الإنسان على وكيله المأمون عنده، الذي لا يشك في نصحيته له وقيامه بمصالحه. الثانية: أن يكون العبد مع ربه كالطفل مع أمه لا يعرف سواها ولا يلجأ إِلاَّ إليها. الثالثة: أن يكون العبد مع ربه كالميت بين يدي الغاسل، قد أسلم إليه نفسه بالكلية. فصاحب الدرجة الأولى عنده حظ من النظر لنفسه، بخلاف صاحب الثانية. وصاحب الثانية له حظ من الاختيار، بخلاف صاحب الثالثة. وهذه الدرجات مبنية على التوحيد الخاص، الذي تكلمتُ عليه في قوله:\n[البَقَرَة: 163]، فهي تقوى بقوته وتضعف بضعفه. فإن قيل: هل يشترط في التوكل ترك الأسباب أم لا؟ فالجواب: أن الأسباب على ثلاثة أقسام: أحدها: سبب معلوم قطعاً قد أجراه الله، فهذا لا يجوز تركه كالأكل لرفع الجوع وللباس لرفع البرد. الثاني: سبب مظنون: كالتجارة وطلب المعاش، وشبه ذلك، فهذا لا يقدح فعله في التوكل، فإن التوكل من أعمال القلوب لا من أعمال البدن، ويجوز تركه لمن قوي عليه. والثالث: سبب موهوم بعيد، فهذا يقدح فعله في التوكل، قلت: ولعل هذا مثل طلب الكيمياء والكنوز وعلم النار والسحر، وشبه ذلك. ثم فوق التوكل التفويض، وهو: الاستسلام لأمر الله تعالى بالكلية، فإن المتوكل له مراد واختيار، وهو يطلب مراده في الاعتماد على ربه، وأما المفوض فليس له مراد ولا اختيار، بل أسند الاختيار إلى الله تعالى، فهو أكمل أدباً مع الله. هـ. وأصله للغزالي، وسيأتي بقية الكلام عند قوله:\n[الفُرقان: 58]. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:38",
      "similarity": 0.23255797469585918
    },
    {
      "verse": "19:29",
      "similarity": 0.19695322920129962
    },
    {
      "verse": "2:233",
      "similarity": 0.18941341949609314
    },
    {
      "verse": "20:44",
      "similarity": 0.1887571071759415
    },
    {
      "verse": "59:5",
      "similarity": 0.1758631885483994
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:159.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:159.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:159.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}