{
  "chapter": "آل عمران",
  "text": "ان الذين تولوا۟ منكم يوم التقى الجمعان انما استزلهم الشيطن ببعض ما كسبوا۟ ولقد عفا الله عنهم ان الله غفور حليم",
  "translations": [
    {
      "translation": "Those of you who turned their backs on the day the two armies clashed - it was Shaytan who made them slip for what they had done. But Allah has pardoned them. Allah is Ever-Forgiving, All-Forbearing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All those among you who turned their backs on the day the two armies clashed (at 'Uhud) were surely induced by Satan to fail in their duty because of their sinful deeds. But God has already forgiven them, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those of them who turned their backs on the day when the two armies met (at Uhud) did so because Satan made them slip because of some of their lapses. But Allah has pardoned them; He is All-Forgiving, All-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows what the hearts contain. Because of some of your bad deeds, those of you who ran away, when you faced the enemy, were misled by Satan. God forgave you for He is All-forgiving and Forbearing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those of you who turned back on the day when the two armies met – for it was the devil who caused them to waver, because of some of their deeds; and undoubtedly Allah has forgiven them; indeed Allah is Oft Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned back on the day the two hosts met, Shaytan only caused them to err because of some of what they had earned. But Allah, indeed, has forgiven them. Surely, Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those of you who turned back on the day when the two armies met, only the Shaitan sought to cause them to make a slip on account of some deeds they had done, and certainly Allah has pardoned them; surely Allah is Forgiving, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned away the day the two hosts encountered -- Satan made them slip for somewhat they had earned; but God has pardoned them; God is All-forgiving, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those of you who turned back on the day when the two hosts met, Satan alone it was who caused them to backslide, because of some of that which they have earned. Now Allah hath forgiven them. Lo! Allah is Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned away on the day the two hosts met [in battle] were made to slip by Satan on account of some of their deeds. But God has pardoned them: God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of you who turned back on the day the two hosts met, it was the Satan who made them slip because of something they had earned; and of a surety Allah hath pardoned them. Verily, Allah is Forgiving, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who fled on the day when the two hosts met, only Satan had made them stumble because of some of their deeds. Certainly, Allah has excused them, for Allah is all-forgiving, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned back on the day the two hosts Met,-it was Satan who caused them to fail, because of some (evil) they had done. But Allah Has blotted out (their fault): For Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned back on the day the two hosts met (i.e. the battle of Uhud), it was Shaitan (Satan) who caused them to backslide (run away from the battlefield) because of some (sins) they had earned. But Allah, indeed, has forgiven them. Surely, Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned away on the day when the two armies met must have been seduced by satan on account of some of what they had earned. But Allah has pardoned them. He is Forgiving and Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who turned back on the day when the two armies clashed—it was Satan who caused them to backslide, on account of some of what they have earned. But God has forgiven them. God is Forgiving and Prudent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those of you who turned back on the day the two armies met, it was Satan who caused them to slip because of some [blame] they had earned. But Allah has already forgiven them. Indeed, Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:155] Truly, those of you who turned away, from the battle, the day the two hosts, the Muslim host and that of the disbelievers, encountered each other, at Uhud, the Muslims, with the exception of twelve men — truly, Satan made them slip, with his [evil] insinuations, through some of what they had earned, of sins, namely, when they disobeyed the Prophet’s command; but God pardoned them; God is Forgiving, to believers, Forbearing, hastening not against the disobedient [with punishment].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف لبيان سبب الهزيمة الخفيّ ، وهي استزلال الشيطان إيّاهم ، وأراد ب { يوم التقى الجمعان } يومَ أُحُد ، و ( استزلّهم ) بمعنى أزلّهم أي جعلهم زالّين ، والزلل مستعار لفعل الخطيئة ، والسين والتاء فيه للتأكيد ، مثل استفاد واستبشر واستنشق وقول النَّابغة: ... وهم قتلوا الطائي بالجوّ عنوةأبا جابر فاسْتَنْكحوا أم جابر ... أي نكحوا . ومنه قوله تعالى : { واستغنى اللَّه } \\[ التغابن : 6 \\] وقوله : { أبى واستكبر } \\[ البقرة : 34 \\] . ولا يحسن حمل السين والتاء على معنى الطلب لأنّ المقصود لومهم على وقوعهم في معصية الرسول ، فهو زلل واقع .والمراد بالزّلل الانهزام ، وإطلاق الزلل عليه معلوم مشهور كإطلاق ثبات القدم على ضدّه وهو النَّصر قال تعالى : { وثبت أقدامنا } \\[ آل عمران : 147 \\] .والباء في { ببعض ما كسبوا } للسببية وأريد { ببعض ما كسبوا } مفارقة موقفهم ، وعصيان أمر الرّسول ، والتنازع ، والتعجيل إلى الغنيمة ، والمعنى أن ما أصابهم كان من آثار الشيطان ، رماهم فيه ببعض ما كسبوا من صنيعهم ، والمقصد من هذا إلقاء تبعة ذلك الانهزام على عواتقهم ، وإبطال ما عرّض به المنافقون من رمى تبعته على أمر الرسول عليه الصلاة والسّلام بالخروج ، وتحريض الله المؤمنين على الجهاد . وذلك شأن ضعاف العقول أن يشتبه عليهم مقارن الفعل بسببه ، ولأجل تخليص الأفكار من هذا الغلط الخفيّ وضع أهل المنطق باب القضيّة اللزوميّة والقضيّة الاتفاقية .ومناسبةُ ذكر هذه الآية عقب الَّتي قبلها أنَّه تعالى بعد أن بيَّن لهم مرتبة حقّ اليقين بقوله : { قل لو كنتم في بيوتكم } انتقل بهم إلى مرتبة الأسباب الظاهرة ، فبيّن لهم أنَّه إن كان للأسباب تأثير فسبب مصيبتهم هي أفعالهم الَّتي أملاها الشيطان عليهم وأضلّهم ، فلم يتفطّنوا إلى السبب ، والتبس عليهم بالمقارن ، ومن شأن هذا الضلال أن يحول بين المخطىء وبين تدارك خطئه ولا يخفى ما في الجمع بين هذه الأغراض من العلم الصّحيح ، وتزكية النفوس ، وتحبيب الله ورسوله للمؤمنين ، وتعظيمه عندهم ، وتنفيرهم من الشيطان ، والأفعاللِ الذميمة ، ومعصية الرسول ، وتسفيه أحلام المشركين والمنافقين . وعلى هذا فالمراد من الذين تولّوا نفس المخاطبين بقوله : { ثم صرفكم عنهم . . . } \\[ آل عمران : 152 \\] الآيات . وضمير { منكم } راجع إلى عامّة جيش أُحُد فشمل الذين ثبتوا ولم يفرّوا . وعن السديّ أنّ الذين تولّوا جماعة هربوا إلى المدينة .وللمفسّرين في قوله : { استزلهم الشيطان ببعض ما كسبوا } احتمالات ذكرها صاحب «الكشاف» والفخر ، وهي بمعزل عن القصد .وقوله : { ولقد عفا الله عنهم } أعيد الإخبار بالعفْو تأنيساً لهم كقوله : { ولقد عفا عنكم } .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned those who fled on the Day of Uhud, saying (Lo! those of you who turned back) defeated, meaning: 'Uthman Ibn 'Affan and his fellow believers (on the day when the two hosts) the hosts of Muhammad and Abu Sufyan (met, Satan alone it was who caused them to backslide) Satan enticed them to believe that Muhammad was killed and thus fled to a place about six parasangs (farasikh) from the scene. They were six people in all, (because of some of that which they have earned) because of leaving their positions. (Now Allah hath forgiven them) since He did not exterminate them. (Lo! Allah is Forgiving) of those who repented among them. (Clement) for He did not hasten their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ اسْتَزَلهم } أي: طلب منهم الزلّة ودعاهم إليها، وهي زلّة التولي { ببعض ما كسبوا } من الذنوب. فإنّ الشيطان إنما يقدر على وسوسة الناس وإنفاذ أمره إذا كان له مجال بسبب أدنى ظلمة في القلب، حادثة من ذنب، وحركة من النفس كما قيل: الذنب بعد الذنب عقوبة للذنب الأول. { ولقد عفا الله عنهم } بالاعتذار والندم.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ تَوَلَّوْاْ } استدبروا وتخلفوا { مِنكُمْ } أيها المؤمنون\n ترهيباً وجبناً\n بلا كفر ونفاق { يَوْمَ } وقت { ٱلْتَقَى ٱلْجَمْعَانِ } الصفَّان للقتال { إِنَّمَا ٱسْتَزَلَّهُمُ ٱلشَّيْطَانُ } وأزال قدمهم عن التثبت والتفرد { بِبَعْضِ مَا كَسَبُواْ } بشؤم بعض ما كسبوا\n بتسويلات نفوسهم التي هي من جنود الشيطان { وَ } بعدما ندموا واستغفروا\n وأخلصوا الرجوع إلى الله { لَقَدْ عَفَا ٱللَّهُ عَنْهُمْ } بلطفه { إِنَّ ٱللَّهَ } العفو عن ذنوب عباده { غَفُورٌ } ستَّار لهم ما صدر عنهم الآثام { حَلِيمٌ } [آل عمران: 155] لا يعجل بالبطس والانتقام\n ليتوبوا ويرجعوا\n\n\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } عليكم أن تحافظوا على مقتضى الإيمان والتوحيد\n ولا تنسبوا الحوادث إلى غير الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إن الذين تولوا منكم } وانهزموا يوم أحد { يوم التقى الجمعان } جمع المسلمين وجمع الكفار إنما كان السبب في انهزامهم أن الشيطان { استزلهم } ، أي: طلب زللهم فأطاعوه، أي: زين لهم الفرار فأطاعوه، بسبب بعض { ما كسبوا } من الإثم، كمخالفة أمر النبيّ صلى الله عليه وسلم، والحرص على الغنيمة، وذنوب اقترفوها قبل الجهاد، فإن المعاصي تجر بعضها بعضاً، كالطاعة، { ولقد عفا الله عنهم } فيما فعلوا من الفرار لتوبتهم واعتذارهم { إن الله غفور } للذنوب، { حليم } لا يعاجل بعقوبة المذنب كي يتوب. الإشارة: إن الذين تولوا منكم يا معشر الفقراء، ورجعوا عن صحبة الشيوخ، حين التقى في قلبهم الخصمان: خصم يرغبهم في الثبوت، وخصم يدلهم على الرجوع، ثم غلب خصم الرجوع فرجعوا، إنما استزلهم الشيطان بسوء أدبهم، فإن تابوا ورجعوا، أقبلوا عليهم، وقَبل الله توبتهم، وعفا عنهم، فإنه سبحانه غفور حليم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:209",
      "similarity": 0.7314377657423972
    },
    {
      "verse": "2:36",
      "similarity": 0.6119464733687414
    },
    {
      "verse": "16:94",
      "similarity": 0.6025200223865405
    },
    {
      "verse": "5:101",
      "similarity": 0.3025212749312684
    },
    {
      "verse": "2:225",
      "similarity": 0.24141405108464561
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003155.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003155.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:155.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}