{
  "chapter": "آل عمران",
  "text": "ولقد صدقكم الله وعده اذ تحسونهم باذنه حتى اذا فشلتم وتنزعتم فى الامر وعصيتم منۢ بعد ما ارىكم ما تحبون منكم من يريد الدنيا ومنكم من يريد الءاخرة ثم صرفكم عنهم ليبتليكم ولقد عفا عنكم والله ذو فضل على المؤمنين",
  "translations": [
    {
      "translation": "Allah fulfilled His promise to you when you were slaughtering them by His permission. But then you faltered, disputing the command, and disobeyed after He showed you what you love.* Among you are those who want this world and among you are those who want the next World. Then He turned you from them in order to test you - but He has pardoned you. Allah shows favour to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The promise made to you by God was verified when you destroyed (the foe) by His leave, until you were unmanned and disputed the order, and thus disobeyed (the Apostle) even after He had brought you in sight of (victory) you longed for. Some of you desired this world, and some of you the next. Then He put you to flight before (them) in order to try you. But (now) He has forgiven you, for surely God is kind to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah surely fulfilled His promise (of succour) when you were slaying them by His leave until the moment when you flagged and quarrelled among yourselves about the matter, and acted against the order of (the Prophet). Soon He showed you what you had intensely desired - for some among you sought this world and some of you sought the Next. Thereupon, in order to put you to a test He turned you away from your foes. Still He pardoned you after that for Allah is Bounteous to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God certainly fulfilled His promise to you when you were fighting the unbelievers, by His permission. Even after We showed you what you wanted, you began to lose courage, started quarreling with each other, and disobeyed God's orders. Some of you want worldly gains and others of you want rewards in the hereafter. Then He let you face defeat in order to test you. However, He forgave you. God is Gracious to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Allah has proved true His promise to you, when you used to slay the disbelievers by His command; until the time you people lost courage and disputed about the order and disobeyed after Allah had shown you what pleases you; some of you desired the world, and some of you desired the Hereafter; thereafter He turned you away from them in order to test you; and undoubtedly He has forgiven you; and Allah is Most Munificent towards the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah did indeed fulfill His promise to you when you were killing them (your enemy) with His permission; until Fashiltum and fell to disputing about the order, and disobeyed after He showed you what you love. Among you are some that desire this world and some that desire the Hereafter. Then He made you flee from them, that He might test you. But surely, He forgave you, and Allah is Most Gracious to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly Allah made good to you His promise when you slew them by His permission, until when you became weak-hearted and disputed about the affair and disobeyed after He had shown you that which you loved; of you were some who desired this world and of you were some who desired the hereafter; then He turned you away from them that He might try you; and He has certainly pardoned you, and Allah is Gracious to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has been true in His promise towards you when you blasted them by His leave; until you lost heart, and quarrelled about the matter, and were rebellious, after He had shown you that you longed for. Some of you there are that desire this world, and some of you there are desire the next world. Then He turned you from them, that He might try you; and He has pardoned you; and God is bounteous to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah verily made good His promise unto you when ye routed them by His leave, until (the moment) when your courage failed you, and ye disagreed about the order and ye disobeyed, after He had shown you that for which ye long. Some of you desired the world, and some of you desired the Hereafter. Therefore He made you flee from them, that He might try you. Yet now He hath forgiven you. Allah is a Lord of Kindness to believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God made good His promise to you when by His leave you were about to destroy your foes, but then your courage failed you and you disagreed among yourselves [concerning the Prophet's direction] and disobeyed it, after He had brought you within sight of what you wished for, some of you desired the goods of this world and some of you desired the Hereafter, then in order that He might put you to the test, He prevented you from defeating your foes. But now He has pardoned you: God is most gracious to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah had assuredly made good His promise unto you when ye were extirpating them by His leave, until when ye flagged and ye disagreed about the command and ye disobeyed after He had shewn you that for which ye longed. Of you some desired the World and of you some desired the Hereafter, wherefore He turned you away from them that he might prove; and of a surety He hath pardoned you And Allah is Gracious unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah certainly fulfilled His promise to you when you were slaying them with His leave, until you lost courage, disputed about the matter, and disobeyed after He showed you what you loved. Some among you desire this world, and some among you desire the Hereafter. Then He turned you away from them so that He might test you. Certainly He has excused you, for Allah is gracious to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah did indeed fulfil His promise to you when ye with His permission Were about to annihilate your enemy,-until ye flinched and fell to disputing about the order, and disobeyed it after He brought you in sight (of the booty) which ye covet. Among you are some that hanker after this world and some that desire the Hereafter. Then did He divert you from your foes in order to test you but He forgave you: For Allah is full of grace to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah did indeed fulfil His Promise to you when you were killing them (your enemy) with His Permission; until (the moment) you lost your courage and fell to disputing about the order, and disobeyed after He showed you (of the booty) which you love. Among you are some that desire this world and some that desire the Hereafter. Then He made you flee from them (your enemy), that He might test you. But surely, He forgave you, and Allah is Most Gracious to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has been true in His promise towards you when you routed them by His leave, until you lost heart, and quarreled about the matter, and disobeyed, afterHe had shown you that which you loved. Some among you wanted the world, and some among you wanted the Everlasting Life. Then He made you turn away from them in order to test you. But He has forgiven you, for Allah is Bounteous to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has fulfilled His promise to you, and you defeated them by His leave; until when you faltered, and disputed the command, and disobeyed after He had shown you what you like. Some of you want this world, and some of you want the next. Then He turned you away from them, to test you; but He pardoned you. God is Gracious towards the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah had certainly fulfilled His promise to you when you were killing the enemy by His permission until [the time] when you lost courage and fell to disputing about the order [given by the Prophet] and disobeyed after He had shown you that which you love. Among you are some who desire this world, and among you are some who desire the Hereafter. Then he turned you back from them [defeated] that He might test you. And He has already forgiven you, and Allah is the possessor of bounty for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:152] God has been true to His promise, towards you, of giving you victory, when you slew them by His leave, by His will, until you lost heart, [until] you shrank from battle, and quarrelled, disagreed, over the command, that is, the command of the Prophet (s) that you remain at the foot of the mountain for the arrow attack, some of you saying, ‘Let us depart, for our comrades have been given victory’, others saying, ‘We should not disobey the command of the Prophet (s)’; and you disobeyed, his command, and abandoned your station in search of the booty, after He, God, had shown you what you longed for, of assistance (the response to the [clause containing] idhā is indicated by what precedes it, that is to say, ‘[when you lost heart] He denied you His assistance’). Some of you desired this world, abandoning his station for the sake of the booty; and some of you desired the Hereafter, holding to it until he was slain, such as ‘Abd Allāh b. Jubayr and his companions. Then He turned you away (thumma sarafakum is a supplement to the response of the [clause containing] idhā, implied to be raddakum bi’l-hazīma [‘He turned you back in defeat’]) from them, the disbelievers, so that He might try you, that He might test you and so make manifest the sincere ones from those otherwise; yet now He has pardoned you, what you have done, and God is Bounteous to the   believers, with pardon.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ولقد صدقكم } عطف على قوله : { سنلقى في قلوب الذين كفروا الرعب } \\[ آل عمران : 151 \\] وهذا عود إلى التَّسلية على ما أصابهم ، وإظهار لاستمرار عناية الله تعالى بالمؤمنين ، ورمز إلى الثقة بوعدهم بإلقاء الرعب في قلوب المشركين ، وتبيين لسبب هزيمة المسلمين : تطميناً لهم بذكر نظيره ومماثله السابققِ ، فإنّ لذلك موقعاً عظيماً في الكلام على حدّ قولهم ( التَّاريخ يعيد نفسه ) وليتوسّل بذلك إلى إلقاء تَبِعة الهزيمة عليهم ، وأنّ الله لم يُخلفهم وعده ، ولكن سوء صنيعهم أوقعهم في المصيبة كقوله : { وما أصابك من سيئة فمن نفسك } \\[ النساء : 79 \\] .وصِدق الوعد : تحقيقُه والوفاءُ به ، لأنّ معنى الصدق مطابقة الخبر للواقع ، وقد عدّي صدق هنا إلى مفعولين ، وحقّه أن لا يتعدّى إلا إلى مفعول واحد . قال الزمخشري في قوله تعالى في سورة \\[ الأحزاب : 23 \\] : { من المؤمنين رجال صَدَقوا ما عاهدوا الله عليه } يقال : صدقني أخوك وكذَبني إذا قال لك الصدق والكذب ، وأمَّا المثَل ( صَدَقَنِي سِنّ بَكْرِه ) فمعناه صدقني في سنّ بَكره بطرح الجارّ وإيصال الفعل . فنصب وعدَه } هنا على الحذف والإيصال ، وأصل الكلام صدقَكم في وعده ، أو على تضمين صَدَق معنى أعطى .والوعد هنا وعد النصر الواقعُ بمثل قوله : { يأيها الذين آمنوا إن تنصروا الله ينصركم } \\[ محمد : 7 \\] أو بخبر خاصّ في يوم أحُد .وإذْن الله بمعنى التقدير وتيسير الأسباب .و ( إذ ) في قوله : { إذ تحسونهم } نصب على الظرفية لقوله : { صدقكم } أي : صدقكم الله الوعد حين كنتم تحسّونهم بإذنه فإنّ ذلك الحسّ تحقيق لوعد الله إيّاهم بالنَّصر ، و ( إذْ ) فيه للمضيّ ، وأتى بعدها بالمضارع لإفادة التجدّد أي لحكاية تجدّد الحسّ في الماضِي .والحَسّ بفتح الحاء القَتل أطلقه أكثر اللغويين ، وقَيّده في «الكشاف» بالقتل الذريع ، وهو أصوب .وقوله : { حتى إذا فشلتم } ( حتَّى ) حرف انتهاء وغاية ، يفيد أنّ مضمون الجملة الَّتي بعدها غاية لمضمون الجملة الَّتي قبلها ، فالمعنى : إذ تقتلونهم بتيسير الله ، واستمرّ قتلكم إيّاهم إلى حصول الفشل لكم والتنازع بينكم .و ( حتَّى ) هنا جارّة و ( إذا ) مجرور بها .و ( إذا ) اسم زمان ، وهو في الغالب للزمان المستقبل وقد يخرج عنه إلى الزمان مطلقاً كما هنا ، ولعلّ نكتة ذلك أنَّه أريد استحضار الحالة العجيبة تبعاً لقوله : { تحسونهم } .و ( إذا ) هنا مجرّدة عن معنى الشرط لأنَّها إذا صارت للمضيّ انسلخت عن الصلاحية للشرطية ، إذ الشرط لا يكون ماضياً إلاّ بتأويل لذلك فهي غير محتاجة لجواب فلا فائدة في تكلّف تقديره : انقسمتم ، ولا إلى جعل الكلام بعدها دليلاً عليه وهو قوله : { منكم من يريد الدنيا } إلى آخرها .والفشل : الوهن والإعياء ، والتنازع : التخالف ، والمُراد بالعصيان هنا عصيان أمر الرسول ، وقد رتّبت الأفعال الثلاثة في الآية على حسب ترتيبها في الحصول ، إذ كان الفشل ، وهو ضجر بعض الرماة من ملازمة موقفهم للطمع في الغنيمة ، قد حصل أولاً فنشأ عنه التنازع بينهم في ملازمة الموقف وفي اللحاق بالجيش للغنيمة ، ونشأ عن التنازع تصميم معظمهم على مفارقة الموقف الَّذي أمرهم الرسول عليه الصلاة والسّلام بملازمته وعدم الانصراف منه ، وهذا هو الأصل في ترتيب الأخبار في صناعة الإنشاء ما لم يقتض الحال العدول عنه .والتعريف في قوله : { في الأمر } عوض عن المضاف إليه أي في أمركم أي شأنكم .ومعنى { من بعد ما أراكم ما تحبون } أراد به النَّصر إذ كانت الريح أوّل يوم أُحُد للمسلمين ، فهزموا المشركين ، وولوا الأدبار ، حتَّى شوهدت نساؤهم مشمّرات عن سوقهنّ في أعلى الجبل هاربات من الأسر ، وفيهنّ هند بنت عتبة بن ربيعة امرأة أبي سفيان ، فلمَّا رأى الرماة الَّذين أمرهم الرسول أن يثبتوا لحماية ظهور المسلمين ، الغنيمة ، التحقوا بالغزاة ، فرأى خالد بن الوليد ، وهو قائد خيل المشركين يومئذ ، غرّة من المسلمين فأتاهم من ورائهم فانكشفوا واضطرب بعضهم في بعض وبادروا الفرار وانهزموا ، فذلك قوله تعالى : { من بعد ما أراكم ما تحبون } فيكون المجرور متعلّقاً بفشلهم . والكلام على هذا تشديد في الملام والتنديم .والأظهر عندي أن يكون معنى ما تحبّون هو الغنيمة فإنّ المال محبوب ، فيكون المجرور يتنازعه كُلّ من ( فشلتم ، وتنازعتم ، وعصيتم ) ، وعدل عن ذكر الغنيمة باسمها ، إلى الموصول تنبيهاً على أنَّهم عجّلوا في طلب المَال المحبوب ، والكلام على هذا تمهيد لبساط المعذرة إذ كان فشلهم وتنازعهم وعصيانهم عن سبب من أغراض الحرب وهو المعبّر عنه ب ( إحدى الحسنيين ) ولم يكن ذلك عن جبن ، ولا عن ضعف إيمان ، أو قصد خذلان المسلمين ، وكلّه تمهيد لما يأتي من قوله : { ولقد عفا عنكم } .وقوله : { منكم من يريد الدنيا ومنكم من يريد الأخرة } تفصيل لتنازعتم ، وتبيين ل ( عصيتم ) ، وتخصيص له بأنّ العاصين بعض المخاطبين المتنازعين ، إذ الَّذين أرادوا الآخرة ليسوا بعاصين ، ولذلك أخّرت هاته الجملة إلى بعد الفعلين ، وكان مقتضى الظاهر أن يعقب بها قوله : { وتنازعتم في الأمر } وفي هذا الموضع للجملة ما أغنى عن ذكر ثلاث جمل وهذا من أبدع وجوه الإعجاز ، والقرينة واضحة .والمراد بقوله : { منكم من يريد الدنيا } إرادة نعمة الدنيا وخيرها ، وهي الغنيمة ، لأنّ من أراد الغنيمة لم يحرص على ثواب الامتثال لأمر الرسول بدون تأويل ، وليس هو مفرّطاً في الآخرة مطلقاً ، ولا حاسباً تحصيل خير الدنيا في فعله ذلك مفيتاً عليه ثواب الآخرة في غير ذلك الفعل ، فليس في هذا الكلام ما يدلّ على أنّ الفريق الَّذين أرادوا ثواب الدنيا قد ارتدّوا عن الإيمان حينئذ ، إذ ليس الحرص على تحصيل فائدة دنيوية من فعل من الأفعال ، مع عدم الحرص على تحصيل ثواب الآخرة من ذلك الفعل بِدالَ على استخفاف بالآخرة ، وإنكار لها ، كما هو بيّن ، ولا حاجة إلى تقدير : منكم من يريد الدنيا ، فقط .وإنَّما سمّيت مخالفة من خالف أمر الرسول عصياناً ، مع أن تلك المخالفة كانت عن اجتهاد لا عن استخفاف ، إذ كانوا قالوا : إنّ رسول الله أمرنا بالثبات هنا لحماية ظهور المسلمين ، فلمَّا نصر الله المسلمين فما لنا وللوقوف هنا حتَّى تفوتنا الغنائم ، فكانوا متأوَّلين ، فإنَّما سمّيت هنا عصياناً لأنّ المقام ليس مقام اجتهاد ، فإنّ شأن الحرب الطاعة للقائد من دون تأويل ، أو لأنّ التأويل كان بعيداً فلم يعذروا فيه ، أو لأنَّه كان تأويلاً لإرضاء حبّ المال ، فلم يكن مكافئاً لدليل وجوب طاعة الرّسول .وإنَّما قال : { ثم صرفكم عنهم ليبتليكم } ليدلّ على أنّ ذلك الصرف بإذن الله وتقديره ، كما كان القتل بإذن الله وأنّ حكمته الابتلاء ، ليظهر للرسول وللنَّاس مَن ثبت على الإيمان من غيره ، ولأنّ في الابتلاء أسراراً عظيمة في المحاسبة بين العبد وربِّه سبحانه وقد أجمل هذا الابتلاء هنا وسيبيّنه .وعُقب هذا الملام بقوله : { ولقد عفا عنكم } تسكيناً لخواطرهم ، وفي ذلك تلطّف معهم على عادة القرآن في تقريع المؤمنين ، وأعظم من ذلك تقديم العفو على الملام في ملام الرسول عليه السلام في قوله تعالى : { عفا اللَّه عنك لم أذنت لهم } \\[ التوبة : 43 \\] ، فتلك رتبة أشرف من رتبة تعقيب الملام بذكر العفو ، وفيه أيضاً دلالة على صدق إيمانهم إذ عجل لهم الإعلام بالعفو لكيلا تطير نفوسهم رهبة وخوفاً من غضب الله تعالى .وفي تذييله بقوله : { والله ذو فضل على المؤمنين } تأكيد ما اقتضاه قوله : { ولقد عفا عنكموالظاهر أنَّه عفو لأجل التأويل ، فلا يحتاج إلى التَّوبة ، ويجوز أن يكون عفواً بعدما ظهر منهم من الندم والتَّوبة ، ولأجل هذا الاحتمال لم تكن الآية صالحة للاستدلال على الخوارج والمعتزلة القائلين بأنّ المعصية تسلب الإيمان .\n\n",
      "translations": [
        {
          "translation": "Allah then mentions His promise to the believers on the Day of Uhud, saying: (Allah verily made good His promise unto you) on the Day of Uhud (when ye routed them) when you killed them at the beginning of the fight (by His leave) by His command and help, (until (the moment) when your courage failed you) to fight against the enemy, (and ye disagreed about the order) you disagreed about the question of war (and ye disobeyed) the Prophet by leaving your positions, (after He had shown you that for which ye long) victory and booty. (Some of you) some of the archers (desired the world) with their jihad and fighting. This refers to those who abandoned their positions and rushed to gather the booty, (and some of you desired the Hereafter) with their jihad and fighting. This refers to 'Abdullah Ibn Jubayr and his fellow believers who remained at their positions until they were killed. (Therefore He made you flee from them) defeated and made them triumph over you, (that He might try you) that He might test you with the archers' disobedience. (Yet now He hath forgiven you) He did not exterminate you. (Allah is a Lord of Kindness to believers) in that He did not exterminate them, i.e. the archers. 73\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ تَحُسُّونَهُمْ } معناهُ تَقتُلُونَهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When you kill them\" - this means that you kill them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولقد صدقكم الله وعده } أي: وعدكم النصر إن تصبروا وتتقوا\n فما دمتم على حالكم من قوة الصبر على الجهاد وتيقن النصر والثبات على اليقين واتفاق الكلمة بالتوجه إلى الحق والاتقاء عن مخالفة الرسول وميل النفوس إلى زخرف الدنيا والإعراض عن الحق\n مجاهدين لله لا للدنيا\n كان الله معكم بالنصر\n وإنجاز الوعد\n وكنتم تقطعونهم بإذنه وتهزمونهم { حتى إذا فَشلْتُم } أي: جبنتم بدخول الضعف في يقينكم وفساد اعتقادكم في حق نفسه بتجويز غلوله في الغنيمة { وتَنازَعتم } في أمر الحرب بعد الاتفاق وما صبرتم عن حظ الدنيا\n وعصيتم الرسول بترك ما أمركم به من ملازمة المركز\n وملتم إلى زخرف الدنيا { من بعدِ ما أرَاكم ما تحبون } من الفتح والغنيمة وحان زمان شكركم لله\n وشدّة إقبالكم عليه\n فذهلتم عنه\n فكان أشرفكم يريد الآخرة والباقون يريدون الدنيا\n ولم يبق فيكم من يريد الله منعكم نصره { ثم صرفكم عنهم ليَبْتَليكم } بما فعلتم فكان الابتلاء لطفاً بكم وفضلاً { والله ذو فضل على المؤمنين } في الأحوال كلها\n إما بالنصرة وإما بالابتلاء\n فإن الابتلاء فضل ولطف خفيّ ليعلموا أن أحوال العباد جالبة لظهور أوصاف الحق عليهم فما أعدّوا له نفوسهم موهوب لهم من عند الله كما مر في قوله: \" مطيع من أطاعني \"\n كما يكونون مع الله يكون الله معهم\n ولئلا يناموا إلى الأحوال دون المسلكات\n وليتمرّنوا بالصبر على الشدائد\n والثبات في المواطن\n ويتمكنوا في اليقين\n ويجعلوه ملكاً لهم\n ومقاماً\n ويتحققوا أن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم\n ولا يميلوا إلى الدنيا وزخرفها\n ولا يذهلوا عن الحق\n ولا يبيعوه بالدنيا والآخرة\n وليكون عقوبة عاجلة للبعض فيتمحصوا عن ذنوبهم وينالوا درجة الشهادة برفع الحجب\n خصوصاً حجاب محبة النفس\n فيلقوا الله طاهرين\n ولهذا قال تعالى:\n[آل عمران: 152]\n إذ الابتلاء كان سبب العفو",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَقَدْ صَدَقَكُمُ ٱللَّهُ } أيها المؤمنون { وَعْدَهُ } الذي وعده لكم من النصر والظفر وقت { إِذْ تَحُسُّونَهُمْ } أي: العدو\n ويحفظ كلاً منكم المكان الذي عينه رسول الله صلى الله عليه وسلم { بِإِذْنِهِ } أي: بإذن الله ووحيه بلا ميل إلى الغنيمة والنهب { حَتَّىٰ إِذَا فَشِلْتُمْ } ملتم إلى الغنيمة\n وخالفتم حكم الله ورسوله { وَتَنَازَعْتُمْ فِي ٱلأَمْرِ } أي: أمر التبادر والتسابق إلى الغنيمة { وَعَصَيْتُمْ } تركتم إطاعة رسول الله صلى الله عليه وسلم { مِّن بَعْدِ مَآ أَرَاكُمْ } أمارات { مَّا تُحِبُّونَ } وتطلبون\n وتوعدونه من النصر والظفر المشروط بالتقرر والتمكن\n وبعد رؤيتكم أنفسكم قسمين: { مِنكُم مَّن يُرِيدُ } حطام { الدُّنْيَا } فترك المركز وخالف الأمر { وَمِنكُم مَّن يُرِيدُ ٱلآخِرَةَ } فثبت على المركز وحفظ الأمر\n ولم يضطرب عن مكانه\n\n\n{ ثُمَّ } لما غيرتم ما في نفوسكم من عقد الله ورسوله { صَرَفَكُمْ } أي: بعدكم { عَنْهُمْ } وعن أموالهم خائنين\n فارين { لِيَبْتَلِيَكُمْ } ويختبركم ببلاء الهزيمة\n هل تستقرون وتثبتون على الإيمان وتصبرون على المصائب الحادثة في حفظه أم لا؟ { وَ } بعدما خالفتم أمر الله وأمر رسوله\n وملتم إلى الغنائم بعدما ورد النهي عن الله ورسوله { لَقَدْ عَفَا } الله { عَنْكُمْ } ذنوبكم بعد ندامتكم واستغفاركم\n تفضلاً عليكم وإن كان مقتضى جريمتكم استئصالكم بالمرة { وَٱللَّهُ } الهادي لعباده { ذُو فَضْلٍ } عظيم { عَلَى ٱلْمُؤْمِنِينَ } [آل عمران: 152] تجاوز عن سيئاتكم\n وإن عظمت بعدما تابوا واستغفروا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: حسَّه: إذا قتله وأبطل حسه، وجواب { إذا }: محذوف، أي: حتى إذا فشلتم وتنازعتم وعصيتم امتحناكم بالهزيمة، والواو لا ترتب، والتقدير: حتى إذا تنازعتم وعصيتم وفشلتم سلبنا النصر عنكم. يقول الحقّ جلّ جلاله: { ولقد صدقكم الله } ما وعدكم من النصر لو صبرتم واتقيتم، وذلك حين كنتم { تحسونهم } بالسيف، وتقتلونهم حتى انهزموا هاربين، بإذنه تعالى وإرادته، { حتى إذا فشلتم } أي: جبنتم وضعف رأيكم وملتم إلى الغنيمة، { وتنازعتم } في الثبات مع الرماة حين انهزم المشركون، فقلتم: الغنيمةَ الغنيمةَ، فما وقوفكم هنا! وقال آخرون: لا تخالفوا أمر الرسول، ثم تركتم المركز، { وعصيتم الرسول من بعد ما أراكم ما تحبون } من النصر والغنيمة، امتحناكم حينئذ بالهزيمة. فمنكم { من يريد الدنيا } ليصرفها في الآخرة، وهم الذين خالفوا المركز وذهبوا للغنيمة، { ومنكم من يريد الآخرة } صِرفاً، وهم الثابتون مع عبد الله بن جبير، محافظةً على أمر رسول الله صلى الله عليه وسلم، { ثم صرفكم عنهم } حين خالفتم أمر الرسول، { ليبتليكم } أي: ليختبركم، فيتبين الصابر من الجازع، والمخلص من المنافق، { ولقد عفا عنكم } فلم يستأصلكم بعد المعصية والمخالفة، لاستحقاقكم ذلك، أو تجاوز عن ذنبكم وتفضل بالتوبة والمغفرة، { والله ذو فضل } عظيم { على المؤمنين } يتفضل عليهم بالمغفرة في الأحوال كلها، سواء أديل عليهم أو لهم، فإن الابتلاء أيضاً رحمة وتطهير. والله تعالى أعلم. الإشارة: يقول للفقراء الذين استشرفوا على بلاد الخصوصية، ثم فشلوا ورجعوا إلى بلاد العمومية: ولقد صدقكم الله وعده في إدراك الخصوصية لو صبرتم، فإنكم حين كنتم تجاهدون نفوسكم وتحسونها بسيوف المخالفة، لمعت لكم أنوار المشاهدة، حتى إذا فشلتم وتفرقت قلوبكم، وعصيتم شيوخكم قلَّت أمدادكم، وأظلمت قلوبكم، من بعد ما رأيتم ما تحبون من مبادئ المشاهدة، فملتم إلى الدنيا الفانية، فمنكم يا معشر المنتسبين من يريد الدنيا، فصحب العارفين على حرف، وهو الذي رجع وفشل، ومنكم من يريد الآخرة وقطع يأسه من الرجوع إلى الدنيا، وهو الذي ثبت حتى ظفر، ثم صرفكم عن حصبة العارفين، يا من أراد الدنيا من المنتسبين، ليبتليكم، هل صحبتموهم لله أو لغيره، ولقد عفا عنكم وجعلكم من عوام المسلمين، ولم يسلب عنكم الإيمان عقوبة لترك صحبة العارفين. أو لقد عفا عنكم إن رجعتم إلى صحبتهم والأدب معهم، فإن الله { ذو فضل على المؤمنين } حيث لم يعاجلهم بالعقوبة. وبالله التوفيق. وقال الورتجبي: قوله: { منكم من يريد الدنيا } ، أي: منكم من وقع في بحر غني القدم، واتصف به بنعت التمكين ورؤية النعم في شكر المنعم، كسليمان عليه السلام. ومنكم من وقع في بحر التنزيه وتقديس الأزلية، فغلب عليه القدس والطهارة، فخرج بنعت الفقر تجريداً لتوحيده وإفرادِ قدمه من الحدث، كمحمدٍ صلى الله عليه وسلم حيث قال:\n \" الفقر فخري \". ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:46",
      "similarity": 0.5595223650664285
    },
    {
      "verse": "8:43",
      "similarity": 0.5319054431494838
    },
    {
      "verse": "3:122",
      "similarity": 0.4507841331033689
    },
    {
      "verse": "21:102",
      "similarity": 0.34478577546482286
    },
    {
      "verse": "3:52",
      "similarity": 0.327686667158173
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003152.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003152.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:152.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}