{
  "chapter": "آل عمران",
  "text": "وما كان لنبى ان يغل ومن يغلل يات بما غل يوم القيمة ثم توفى كل نفس ما كسبت وهم لا يظلمون",
  "translations": [
    {
      "translation": "No Prophet would ever be guilty of misappropriation. Those who misappropriate will arrive on the Day of Rising with what they have misappropriated. Then every self will be paid in full for what it earned. They will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a prophet to be false; and whoever is false will indeed bring his falsehood with him on the Day of Reckoning when each will receive his reward without favour or wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a Prophet to defraud; and whoever defrauds shall bring with him the fruits of his fraud on the Day of Resurrection, when every human being shall be paid in full what he has earned, and shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No Prophet can ever be treacherous. A treacherous person will be brought before God on the Day of Judgment with his treacherous deeds. Then every soul will be recompensed for its works without being wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is unimaginable that any Prophet would hide something; and whoever hides it, will bring what he hid with him on the Day of Resurrection; then every soul will be paid in full for whatever they earned; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any Prophet to illegally take a part of the booty, and whosoever deceives his companions over the booty, he shall bring forth on the Day of Resurrection that which he took. Then every person shall be paid in full what he has earned, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not attributable to a prophet that he should act unfaithfully; and he who acts unfaithfully shall bring that in respect of which he has acted unfaithfully on the day of resurrection; then shall every soul be paid back fully what it has earned, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a Prophet to be fraudulent; whoso defrauds shall bring the fruits of his fraud on the Day of Resurrection; then every soul shall be paid in full what it has earned, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any prophet to embezzle. Whoso embezzleth will bring what he embezzled with him on the Day of Resurrection. Then every soul will be paid in full what it hath earned; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any Prophet to hold back anything; he who hides anything away shall bring it forth on the Day of Resurrection, when every human being shall be repaid in full for whatever he has done, and none shall be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not the part of a prophet to hide anything away: whosoever hideth anything away, he shall bring forth on the Day of Resurrection that which he had hidden away; then shall each one be repaid in full that which he hath earned, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A prophet may not breach his trust, and whoever breaches his trust will bring his breaches on the Day of Resurrection; then every soul shall be recompensed fully for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No prophet could (ever) be false to his trust. If any person is so false, He shall, on the Day of Judgment, restore what he misappropriated; then shall every soul receive its due,- whatever it earned,- and none shall be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any Prophet to take illegally a part of booty (Ghulul), and whosoever deceives his companions as regards the booty, he shall bring forth on the Day of Resurrection that which he took (illegally). Then every person shall be paid in full what he has earned, - and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a Prophet to defraud, whosoever defrauds shall bring that fraud on the Day of Resurrection. Then, every soul shall be paid in full what it has earned, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a prophet to act dishonestly. Whoever acts dishonestly will bring his dishonesty on the Day of Resurrection. Then every soul will be paid in full for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not [attributable] to any prophet that he would act unfaithfully [in regard to war booty]. And whoever betrays, [taking unlawfully], will come with what he took on the Day of Resurrection. Then will every soul be [fully] compensated for what it earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:161] When some red velvet cloth went missing on the Day of Badr and some people began to say, ‘Perhaps the Prophet took it’, the following was revealed: It is not for a prophet to be fraudulent (an yaghulla, a variant reading has the passive an yughalla, meaning to attribute ghulūl, ‘fraud’, to him), to be treacherous with regard to the spoils, so do not presume this of him; whoever defrauds shall bring what he has defrauded on the Day of Resurrection, carrying it around his neck; then every soul, the fraudulent and the otherwise, shall be paid in full, the requital of, what it has earned, [what] it has done, and they shall not be wronged, a single thing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالأظهر أنَّه عطف على مجموع الكلام عطف الغرض رعلى الغرض وموقعه عقب جملة : { إن ينصركم الله فلا غالب لكم } \\[ آل عمران : 160 \\] . الآية لأنها أفادت أن النصر بيد الله والخذْل بيده ، وذلك يستلزم التَّحريض على طلب مرضاته ليكون لطيفاً بمن يُرضونه . وإذ قد كانت هذه النَّصائح والمواعظ موجهة إليهم ليعملوا بها فيما يستقبل من غزواتهم ، نبّهوا إلى شيء يستخفّ به الجيش في الغزوات ، وهو الغُلول ليعلموا أنّ ذلك لا يُرضي الله تعالى فيحذَروه ويكونوا ممّا هو أدعى لغضب الله أشدّ حذراً فهذه مناسبة التَّحذير من الغلول ويعضّد ذلك أنّ سبب هزيمتهم يوم أُحُد هو تعجلهم إلى أخذ الغنائم . والغلُول : تعجّل بأخذ شيء من غال الغنيمة .ولا تجد غير هذا يصلح لأن يكون مناسباً لتعقيب آية النصر بآية الغلول ، فإنّ غزوة أحُد الَّتي أتت السورة على قصّتها لم يقع فيها غُلول ولا كائن للمسلمين فيها غنيمة وما ذكره بعض المفسِّرين من قضية غلوللٍ وقعت يومَ بدر في قطيفة حمراء أو في سيف لا يستقيم هنا لبعد ما بين غزوة بدر وغزوة أُحُد فضلاً على ما ذكره بعضهم من نزول هذه الآية في حرص الأعراب على قسمة الغنائم يوم حُنين الواقععِ بعد غزوة أحُد بخمس سنين .وقرأ جمهور العشرة : يُغَلّ بضمّ التحتية وفتح الغين وقرأه ابن كثير ، وأبو عمرو وعاصم بفتح التحتية وضَمّ الغين .والفعل مشتقّ من الغلول وهو أخذ شيء من الغنيمة بدون إذن أمير الجيش ، والغلول مصدر غير قياسي ، ويطلق الغلول على الخيانة في المال مطلقاً .وصيغة { وما كان لنبي أن يُغلّ } صيغة جحود تفيد مبالغة النَّفي . وقد تقدّم القول فيها عند قوله تعالى : { ما كان لبشر أن يؤتيه الله الكتاب والحكم والنُّبَوة } \\[ آل عمران : 79 \\] في هذه السورة فإذا استعملت في الإنشاء كما هنا أفادت المبالغة في النَّهي . والمعنى على قراءة الجمهور نهي جيش النَّبيء عن أن يَغلُو لأنّ الغلول في غنائم النَّبيء صلى الله عليه وسلم غلول للنَّبيء ، إذ قسمة الغنائم إليه ، وأمَّا على قراءة ابن كثير وأبي عمرو وعاصم فمعنى أن النَّبيء لا يَغُلّ أنَّه لا يقع الغلول في جيشه فإسناد الغُلول إلى النَّبيء مجاز عقلي لملابسة جيش النَّبيء نبيئَهم ولك أن تجعله على تقدير مضاف . والتقدير : ما كَان لجيش نَبيء أن يَغُلّ .ولبعض المفسّرين من المتقدّمين ومن بعدهم تأويلات للمعنى على هذه القراءة فيها سَماجة .ومعنى و { من يغلل يأت بما غل يوم القيامة } أنَّه يأتي به مشهَّراً مفضوحاً بالسرقة .ومن اللَّطائف ما في البيان والتبيين للجاحظ : أنّ مَزْيَداً رجلاً من الأعراب سرق نافجة مسك فقيل له : كيفَ تسرقها وقد قال الله تعالى : { ومن يغلل يأت بما غل يوم القيامة } ؟ فقال : إذَنْ أحمِلُها طيّبةَ الريح خفيفة المحمل .وهذا تلميح وتلقي المخاطب بغير ما يترقّب . وقريب منه ما حكي عن عبد الله بن مسعود والدرك على مَن حكاه قالوا : لمّا بعث إليه عثمان ليسلم مصحفه ليحرقه بعد أن اتَّفق المسلمون على المصحف الَّذي كُتب في عهد أبي بكر قال ابن مسعود : إنّ الله قال : { ومن يغلل يأت بما غل يوم القيامة } وإنِّي غالّ مصحفي فمن استطاع منكم أن يَغُلّ مصحفه فليفعل . ولا أثق بصحَّة هذا الخبر لأنّ ابْن مسعود يعلم أنّ هذا ليس من الغلول .وقوله : { ثم توفى كل نفس ما كسبت } تنبيه على العقوبة بعد التفضيح ، إذ قد علم أنّ الكلام السابق مسوق مساق النَّهي ، وجيء ب ( ثمّ ) للدّلالة على طول مهلة التفضيح ، ومن جملة النُّفوس الَّتي توفَّى ما كسبت نفس من يغلل ، فقد دخل في العموم .وجملة { وهم لا يظلمون } حال مؤكدة لمضمون الجملة قبلها وهي { توفى كل نفس ما كسبت } .والآية دلّت على تحريم الغلول وهو أخذ شيء من المغنم بغير إذن أمير الجيش ، وهو من الكبائر لأنَّه مِثل السرقة ، وأصحّ ما في الغلول حديث «الموطأ» : أنّ رسول الله صلى الله عليه وسلم حين رجع من خيبر قاصداً وادي القُرى وكان له عبد أسود يدعى مِدْعَما ، فبينما هو يحطّ رحل رسول الله صلى الله عليه وسلم إذ جاءه سهم عائر فقتله ، فقال النَّاس : هنيئاً له الجنَّةُ ، فقال رسول الله صلى الله عليه وسلم \" كلاّ والَّذي نفسي بيده إن الشَّملة التي أخذها يومَ خيبر من الغنائم لم تصبها المقاسم لتشتعل عليه ناراً \"ومن غلّ في المغنم يؤخذ منه مَا غَلَّه ويؤدّب بالاجتهاد ، ولا قطع فيه باتِّفاق ، هذا قول الجمهور ، وقال الأوزاعي ، وإسحاق ، وأحمد بن حنبل ، وجماعة : يحرق متاع الغالّ كُلّه عدَا سِلاحَه وسرجه ، ويردّ ما غلّه إلى بيت المال ، واستدلّوا بحديث رواه صالح بن محمد بن زائدة أبو واقد الليثي ، عن عمر بن الخطاب : أنّ النَّبيء صلى الله عليه وسلم قال : \" إذا وجدتم الرجل قد غلّ فأحرقوا متاعه واضربوه \" وهو حديث ضعيف ، قال الترمذي سألت محمداً يعني البخاري عنه فقال : «إنَّما رواه صالح بن محمد ، وهو منكر الحديث . على أنَّه لو صَحّ لوجَبَ تأويله لأنّ قواعد الشَّريعة تدلّ على وجوب تأويله فالأخذ به إغراق في التعلّق بالظواهر وليس من التفقّه في شيء .\n\n",
      "translations": [
        {
          "translation": "Then Allah mentioned their surmise about the Prophet (pbuh) that he was not going to divide any of the booty among them, and because of this they left their positions, saying: (It is not for any Prophet) it is not permissible for any prophet (to deceive) to cheat his community regarding booty; it is also possible that the meaning is: it is not permissible for a community to deceive its prophet. (Whoso deceiveth) as regards any of the booty (will bring his deceit with him) carried on his neck (on the Day of Resurrection. Then every soul will be paid in full what it hath earned) that which it has deceived and also other things; (and they will not be wronged) their good works will not be diminished and their evil deeds will not be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنْ يَغُلَّ } معناه أَنْ يُخان\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Be!\" - that is, His command to exist - is what gives everything life.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كان لنبيّ أن يغلّ } لبعد مقام النبوّة وعصمة الأنبياء عن جميع الرذائل\n وامتناع صدور ذلك منهم مع كونهم منسلخين عن صفات البشرية\n معصومين عن تأثير دواعي النفس والشيطان فيهم\n قائمين بالله متّصفين بصفاته { يأت بما غلّ } أي: يظهر على صورة غلوله بما غلّ بعينه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما نسب المنافقون إلى رسول الله صلى الله عليه وسلم ما برأه الله ذيل عصمته عنه من الخيانة والغلول\n راد الله عليهم في ضمن الحكمة الكلية\n الشاملة لجميع الأنبياء\n إذ مرتبة النبوة مطلقاً مصونة عن أمثال هذه الخرافات\n فقال: { وَمَا كَانَ } أي: ما صح وما جاز { لِنَبِيٍّ } من الأنبياء\n خصوصاً خاتم النبوة والرسالة صلى الله عليه وسلم { أَنْ يَغُلَّ } يخون ويحيف بالنسبة إلى أحد { وَمَن يَغْلُلْ } أحداً من الناس { يَأْتِ بِمَا غَلَّ يَوْمَ ٱلْقِيَامَةِ } أي: تأتي مغلولة مع ما غل فيه على رءوس الأشهاد { ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ } مطيعة أو عاصية جزاء { مَّا كَسَبَتْ } أي: يعطي جزاء ما كسبت وافياً { وَهُمْ } في تلك الحالة { لاَ يُظْلَمُونَ } [آل عمران: 161] لا ينقصون من أجورهم\n إذ لا ظلم فيها\n بل يزاد عليها تفضلاً وامتناناً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الغلول: السرقة من الغنائم، فمن قرأ بفتح الياء وضم الغين، فمعناه: لا ينبغي له أن يأخذ شيئاً من الغنيمة خفية، والمراد: تبرئة رسوله - عليه الصلاة والسلام - من ذلك. ومن قرأ بضم الياء ففيه وجهان: أحدهما: أن يكون المعنى، ما كان لنبي أن يُخان، أي: أن تخونه أُمّتُه في المغانم، وكذلك الأمراء، وإنما خص النبيَّ صلى الله عليه وسلم بذلك لبشاعة ذلك مع النبيّ لأن المعاصي تعظم بحضرته، والثاني: أن يكون المعنى: ما كان لنبي أن يُنسب إلى الخيانة كقوله:\n[الأنعَام: 33] أي: لا ينسبونك إلى الكذب. يقوله الحقّ جلّ جلاله: { ما كان } ينبغي { لنبيٍّ أن يغل } ويأخذ شيئاً من الغنيمة خفية لأن ذلك خيانة والنبوة تنافي ذلك، والمراد: نزاهة الرسول - عليه الصلاة والسلام - عن ذلك، كقوله:\n[مريَم: 35]، ودفعُ ما توهمه الرماة، فقد رُوِيَ أنه - عليه الصلاة والسلام -قال لهم لما تركوا المركز:\n \" ألمْ أعْهَد إليكُمْ ألا تَتْركُوا المركَزَ حتَّى يأتيكُمْ أمْري؟ \" \nقالوا: تَرَكْنا بقية إخْوانِنَا وُقوفاً، فقال النبيّ صلى الله عليه وسلم:\n \" بل ظَننْتُم أنّا نَغُلّ ولا نقْسِمُ لكُمْ \" \nفنزلت الآية. وقيل إنه - عليه الصلاة والسلام -: بعث طلائع، فغنم رسول الله صلى الله عليه وسلم، وقسم على من معه فقط، فنزلت، فاسترجع ذلك منهم. وقيل: في قطيفة حمراء فُقدت يوم بدر، فقال المنافقون: لَعَلَّ رَسُولَ اللّهِ صلى الله عليه وسلم أَخَذَهَا، فنزلت. ثم ذكر وعيد الغلول، فقال: { ومن يَغْلُلْ يأت بما غَلَ يوم القيامة } أي: يأتي بالذي غله يحمله على رقبته، قال عليه الصلاة والسلام:\n \" لا ألقى أحَدكُمْ يَوْمَ القِيَامَةِ يَجِيءُ على رَقَبته بَعِيرٌ لَهُ رُغَاء، أوْ بَقَرَةٌ لَهَ خُوَارٌ، أَوْ شَاةٌ تَيْعَرُ \" \nثم قال:\n \" اللهُمَّ هَلْ بَلَّغْتُ؟ ثلاثاً \" \nكما في البخاري. { ثم توفّى كل نفس } جزاء { ما كسبت } تاماً، { وهم لا يظلمون } بنقص ثواب مُطيعهم، ولا يزاد على عقاب عاصيهم وكان اللائق بما قبله أن يقول: ثم يوفى ما كسب. لكنه عمم الحكم ليكون كالبرهان على المقصود والمبالغة فيه، وأنه إذا كان كل كاسب مجزياً بعمله، فالغال مع عظم جرمه بذلك أولى. قاله البيضاوي. الإشارة: ما قيل في النبيّ - عليه الصلاة والسلام - يقال في ورثته الكرام، كالأولياء والعلماء الأتقياء، فإنهم ورثة الأنبياء، فيُظن بهم أحسن المذاهب، ويلتمس لهم أحسن المخارج، لأن الأولياء دلّوا على معرفة الله، والعلماء دلّوا على أحكام الله، وبذلك جاءت الرسل من عند الله، فلا يظن بهم نقص ولا خلل، ولا غلول ولا دخل، فلهم قسط ونصيب من حرمة الأنبياء، ولا سيما خواص الأولياء، ومن يظن بهم نقصاً أو خللاً، ويغل قلبه على شيء من ذلك، فسيرى وباله يوم تفضح السرائر، { ثم توفّى كل نفس ما كسبت وهم لا يظلمون } ، فلحوم الأولياء والعلماء سموم قاتلة، وظن السوء بهم خيانة حاصلة. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:30",
      "similarity": 0.6937660559022274
    },
    {
      "verse": "2:281",
      "similarity": 0.4787119182280938
    },
    {
      "verse": "15:47",
      "similarity": 0.46966156186187197
    },
    {
      "verse": "59:10",
      "similarity": 0.4304251922453853
    },
    {
      "verse": "3:25",
      "similarity": 0.3885303652773558
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003161.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003161.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:161.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}