{
  "chapter": "آل عمران",
  "text": "ولا تحسبن الذين قتلوا۟ فى سبيل الله اموتۢا بل احياء عند ربهم يرزقون",
  "translations": [
    {
      "translation": "Never think that those who are killed in the way of God are dead. They are alive, getting succour from their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not of those slain in the way of Allah as dead. Indeed they are living, and with their Lord they have their sustenance,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think of those slain for the cause of God as dead. They are alive with their Lord and receive sustenance from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not ever assume that those who are slain in Allah's cause, are dead; in fact they are alive with their Lord, receiving sustenance. (Death does not mean extinction, it is the passing of the soul from this world to another. In case of virtuous believers, their bodies do not rot after death and they remain “alive”, in the manner Allah has ordained for them.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not of those as dead who are killed in the way of Allah. Nay, they are alive, with their Lord, and they have provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And reckon not those who are killed in Allah's way as dead; nay, they are alive (and) are provided sustenance from their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Count not those who were slain in God's way as dead, but rather living with their Lord, by Him provided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not of those, who are slain in the way of Allah, as dead. Nay, they are living. With their Lord they have provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think of those who have been killed in God's cause as dead. They are alive, and well provided for by their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And reckon not thou those slain in the way of Allah to be dead. Nay, they are alive, and with their Lord, and provided for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not suppose those who were slain in the way of Allah to be dead; no, they are living and provided for near their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not of those who are slain in Allah's way as dead. Nay, they live, finding their sustenance in the presence of their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not of those who are killed in the Way of Allah as dead. Nay, they are alive, with their Lord, and they have provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You must not think that those who were killed in the way of Allah are dead. But rather, they are alive with their Lord and have been provided for,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not consider those killed in the cause of God as dead. In fact, they are alive, at their Lord, well provided for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:169] The following was revealed regarding martyrs: Count not those who were slain (read qutilū or quttilū) in God’s way, that is, for the sake of His religion, as dead, but rather, that they are, living with their Lord, their spirits inside green birds that take wing freely wherever they wish in Paradise, as reported in a hadīth); provided for [by Him], with the fruits of Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Think not) consider not (of those, who are slain in the way of Allah) on the Day of Badr and Uhud, (as dead) like any other dead people. (Nay, they are living) they are like the living. (With their Lord they have provision) they are given gifts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما بيَّن سبحانه جرائم المؤمنين يوم أُحد، وذلتهم ومتابعتهم للمنافقين في التخلف عن رسول الله، والميل إلى الغنيمة، وترك المركز مع كونهم مأمورين على خلافها، أراد أن ينبه عليهم سرائر الغزو والشهادة فيه، وبذل المهج في سبيله، فقال مخاطباً لرسوله على طريق الكف والنهي؛ لينبه من يقتدي به من المؤمنين؛ لأن أمثال هذه الخطابات والتنبيهات إنما يليق لمن وصل إلى ذورة مسالك التوحيد، وتحقق بنهاية مراتب التجريد والتفريد بقوله: { وَلاَ تَحْسَبَنَّ ٱلَّذِينَ قُتِلُواْ فِي سَبِيلِ ٱللَّهِ } باذلين أرواحهم في طريق الفناء؛ ليفوزوا بشرف البقاء { أَمْوَاتاً } منقطعين عن الحياة والحركة، كالأموات الأخر { بَلْ } هم { أَحْيَاءٌ } ذو أوصاف وأسماء أزلية أبدية، مقربين بها { عِندَ رَبِّهِمْ } الجامع لجميع الأوصاف والأسماء { يُرْزَقُونَ } [آل عمران: 169] بها من عنده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}