{
  "chapter": "آل عمران",
  "text": "افمن اتبع رضون الله كمنۢ باء بسخط من الله وماوىه جهنم وبئس المصير",
  "translations": [
    {
      "translation": "Is someone who pursues the pleasure of Allah the same as someone who incurs displeasure from Allah and whose refuge is Hell? What an evil destination!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is a man who has followed the pleasure of God the same as he who has incurred His wrath, whose abode is surely Hell, a dreadful place?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who follows the good pleasure of Allah like him who is laden with Allah's wrath and whose abode is Hell? How evil that is for a resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are those who seek God's pleasure equal to those who incur His wrath and whose dwelling will be hell, the terrible destination?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is one who follows the will of Allah equal to one who has incurred the wrath from Allah and whose home is the fire? And what a wretched place to return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then one who follows (seeks) the pleasure of Allah like the one who draws on himself the wrath of Allah His abode is Hell, and worse indeed is that destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then he who follows the pleasure of Allah like him who has made himself deserving of displeasure from Allah, and his abode is hell; and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is he who follows God's good pleasure like him who is laden with the burden of God's anger, whose refuge is Gehenna? An evil homecoming!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is one who followeth the pleasure of Allah as one who hath earned condemnation from Allah, whose habitation is the Fire, a hapless journey's end?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can one who seeks the pleasure of God, be like one who incurs the wrath of God and whose abode shall be Hell -- an evil destination?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then one who followeth the pleasure of Allah like unto him who hath settled under the displeasure of Allah? His resort is Hell, and ill is that destination\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who follows [the course of] Allah’s pleasure like him who earns Allah’s displeasure and whose refuge is hell, an evil destination?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the man who follows the good pleasure of Allah Like the man who draws on himself the wrath of Allah, and whose abode is in Hell?- A woeful refuge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then one who follows (seeks) the good Pleasure of Allah (by not taking illegally a part of the booty) like the one who draws on himself the Wrath of Allah (by taking a part of the booty illegally - Ghulul)? - his abode is Hell, - and worst, indeed is that destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who follows the pleasure of Allah like he who is laden with the Anger of Allah, Gehenna (Hell) shall be his shelter. Evil shall be his return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is someone who pursues God's approval the same as someone who incurs God's wrath and his refuge is Hell—the miserable destination?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is one who pursues the pleasure of Allah like one who brings upon himself the anger of Allah and whose refuge is Hell? And wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:162] Is he who follows God’s beatitude, being obedient and not defrauding, like him who is laden, [one who] returns, with God’s anger, because of his disobedience and fraud, whose abode is Hell? An evil journey’s end, a resort, it is!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is one who followth the pleasure of Allah) in taking the fifth and shunning deceit (as one who hath earned condemnation from Allah) as one who deserves Allah's wrath due to his deception, (whose habitation) i.e. the dwelling of the deceiver (is the Fire, a hapless journey's end?) where he shall end up.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أفَمَن اتّبع رضوان الله } أي: النبيّ في مقام الرضوان التي هي جنة الصفات، لاتصافه بصفات الله، والغالّ في مقام السخط لاحتجابه بصفات نفسه { ومأواه } أسفل حضيض النفس المظلمة، فهل يتشابهان؟ { هم درجات } أي: كل من أهل الرضا وأهل السخط ذوو درجات متفاوتات أو هم مختلفون اختلاف الدرجات { قل هو من عند أنفسكم } لا ينافي قوله تعالى:\n\n[النساء، الآية: 78] لأنّ السبب الفاعلي في الجميع هو الحق تعالى، والسبب القابليّ أنفسهم، ولا يفيض من الفاعل إلا ما يليق بالاستعداد ويقتضيه، وباعتبار الفاعل يكون من عند الله، وباعتبار القابل يكون من عند أنفسهم\n واستعداد الأنفس إما أصليّ وإما عارضيّ، والأصلي من فيضه الأقدس على مقتضى مشيئته، والعارضي من اقتضاء قدره\n فهذا الجانب أيضاً ينتهي إليه، ومن وجه آخر ما يكون من أنفسهم أيضاً يكون من الله نظراً إلى التوحيد، إذ لا غير ثمة { وليعلم المؤمنين وليعلم الذين نافقوا } أي: وليتميز المؤمنون والمنافقون في العلم التفصيليّ\n { ولا تحسبن الذين قُتِلوا في سبيل الله } سواء كان قتلهم بالجهاد الأصغر، وبذل النفس طلباً لرضا الله، أو بالجهاد الأكبر، وكسر النفس، وقمع الهوى بالرياضة { أمواتاً بل أحياء عند ربّهم } بالحياة الحقيقية مجرّدين عن دنس الطبائع، مقرّبين في حضرة القدس { يُرْزَقون } من الأرزاق المعنوية، أي المعارف والحقائق واستشراق الأنوار، ويرزقون في الجنّة الصورية كما يُرْزق سائر الأحياء\n فإنّ للجنان مراتب بعضها معنوية وبعضها صورية، ولكل من المعنوية والصورية درجات على حسب الأعمال، فالمعنوية جنّة الذات وجنة الصفات وتفاضل درجاتها على حسب تفاضل درجات أهل الجبروت والملكوت، والصدورية جنّة الأفعال وتفاوت درجاتها على حسب تفاوت درجات عالم المُلك من السموات العلى، وجنات الدنيا وعن النبيّ صلى الله عليه وسلم:\n\n \" لما أُصِيبَ إخوانكم بأُحد، جَعَل الله أرواحهم في أجواف طير خضر، تدور في أنهار الجنة، وتأكل من ثمارها، وتأوي إلى قناديل من ذهب، معلقة في ظلّ العرش \" \n",
      "translations": [
        {
          "translation": "\n\n{Is he who follows the pleasure of Allah} that is, the Prophet in the state of pleasure which is the Garden of the Attributes?,\n\nDo not ascribe to Allah any attributes.,\n\nAnd the Ghall is in a state of anger due to its own {and its} attributes, below the dark soul.,\nDo they resemble each other? {They have grades} i.e., each of the content and the discontent have different grades, or are they different in terms of grades {Say, it is from among yourselves} which does not contradict the saying of the Almighty:\n The women\n\nالنساء هي الجزء الرئيسي من المجتمع ولهن دور هام جدا في الاستحكام والتعليم والصحة والثقافة والشؤون الاجتماعية. وتشكل النساء المتزوجة والأمهات أساس الأسرة والمجتمع. وتسعى النساء للتمكين والتحقيق الذاتي والاستقلال وتحقيق الحقوق المتساوية مع الرجال.\n\nWomen are the main part of the society and they play a very important role in decision-making, education, health, culture, and social affairs. Married women and mothers form the foundation of the family and society. Women strive for empowerment, self-realization, and independence and the achievement of equal rights with men.,\n\nThe active cause in everything is Allah, the Most Exalted.,\n\nThe reason for this is that they are their own worst enemy.,\n\nAnd nothing should be expected of the doer except what is in keeping with their preparation and what is required of them.,\n\nAnd inasmuch as the doer is from among those who are with God,\n\nAnd as for those who are capable, they should be from among themselves.\n\n\nPrepare yourselves, both those of you who are {originally} from here and those of you who are {adverse}.,\n\nAnd the original from within the Most Holy, according to His will.,\n\nThe opponent is required to have the ability.\n\n\nThis side also leads to it.,\n\nAnd from another perspective, whatever is of themselves is also of God, in terms of unity.,\n\nThere is no other way {for the believers and those who have gone astray to learn} that is, for the believers and the hypocrites to be distinguished in detailed knowledge.\n\nDo not think that those who were killed in the way of Allah are dead {and}. They are alive, but you do not perceive it.,\n\n{And spend in the way of Allah} in order to please Him.,\n\nOr through the greatest jihad.,\n\nAnd break your soul,\nAnd the suppression of desires with { not dead but alive } at their Lord in real life, mere mortals, unmindful of the facts.,\n\nThose close to God in Jerusalem are {provided for} from spiritual riches.,\n\n{What} knowledge and facts and {enlightenment of the lights},\n\nAnd they are provided for in the Garden of Bliss, as all other living beings are provided for.\n\n\nThere are different levels among the jinn, some of which are spiritual and some physical.,\n\nAnd for every metaphysical and physical degree, there are corresponding levels of works.,\n\nThe spiritual paradise is the paradise of selfhood and the paradise of attributes, and its degrees are according to the degrees of the people of Jabrut and Malakut.,\nAnd the Sadoriyya is the garden of the acts and its grades differ according to the different grades of the world of the kingdom from the highest heavens.,\n\nAnd gardens of the world, and about the Prophet (peace and blessings of Allaah be upon him):\n \"When your brothers were inflicted with one of them, May Allah make their souls in green birds in the necks,\n\nShe flows in the rivers of paradise., And he eats from its fruits,\n\nAnd you come to the {qanadil} of gold.,\n\n\"Hanging in the Shade of the Throne\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفَمَنِ ٱتَّبَعَ } انقاد وأطاع { رِضْوَانَ ٱللَّهِ } أي: رضاه، ورضي الله عنه؛ لتحققه بمقام الرضا ومأواه جنة التسليم { كَمَن بَآءَ } رجع وقصد بكفر وظلم مستلزم { بِسَخَطٍ } عظيم { مِّنَ ٱللَّهِ وَ } بسببه { مَأْوَاهُ جَهَنَّمُ } البعد الطرد { وَبِئْسَ ٱلْمَصِيرُ } [آل عمران: 162] والمنقلب مصير أهل الكفر والظلم وحاشا ليسوا كمثلهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:80",
      "similarity": 0.7009109857497072
    },
    {
      "verse": "47:28",
      "similarity": 0.6814812629210435
    },
    {
      "verse": "9:58",
      "similarity": 0.5103777284697937
    },
    {
      "verse": "9:73",
      "similarity": 0.2748752742225269
    },
    {
      "verse": "66:9",
      "similarity": 0.2748752742225269
    }
  ]
}