{
  "chapter": "آل عمران",
  "text": "ان ينصركم الله فلا غالب لكم وان يخذلكم فمن ذا الذى ينصركم منۢ بعده وعلى الله فليتوكل المؤمنون",
  "translations": [
    {
      "translation": "If God is there to help you none will overcome you; and if He forsake you, who will help you other than Him? So only in God should the faithful place their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah helps you none shall prevail over you; if He forsakes you then who can help you? It is in Allah that the believers should put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God is your helper, no one can defeat you. However, if He abandons you, who would help you? The true believers trust in God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah supports you, no one can overcome you; and if He forsakes you, who is there who can then help you? And in Allah only should the Muslims trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah helps you, none can overcome you; and if He forsakes you, who is there after Him that can help you And in Allah (Alone) let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah assists you, then there is none that can overcome you, and if He forsakes you, who is there then that can assist you after Him? And on Allah should the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God helps you, none can overcome you; but if He forsakes you, who then can help you after Him? Therefore in God let the believers put all their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah is your helper none can overcome you, and if He withdraw His help from you, who is there who can help you after Him? In Allah let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God helps you, none can overcome you, but if He withdraws His help from you, who is there who can help you besides Him? In God, then, let the believers place their trust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah succoureth you, there is none that can overcome you; if He abandon you, who is there that can succour you after Him? And in Allah let the believers trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah helps you, no one can overcome you, but if He forsakes you, who will help you after Him? So in Allah let all the faithful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah helps you, none can overcome you: If He forsakes you, who is there, after that, that can help you? in Allah, then, Let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah helps you, none can overcome you; and if He forsakes you, who is there after Him that can help you? And in Allah (Alone) let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah helps you, none can overcome you. If He forsakes you, who then can help you after Him? Therefore, in Allah let the believers put all their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God supports you, there is none who can overcome you. But if He fails you, who is there to help you after Him? So in God let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him? And upon Allah let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:160] If God helps you, [if] He gives you assistance against your enemy, as on the Day of Badr, then none can overcome you; but if He forsakes you, [if] He refrains from assisting you, as on the Day of Uhud, then who is there who can help you after Him?, that is, after His forsaking [you]? In other words, there is no one to help you. Therefore on God, and on no one else, let the believers rely.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Allah is your helper) as on the Day of Badr (none can overcome you) none of your enemy shall overcome you, (and if He withdraw His help from you) as on the Day of Uhud, (who is there who can help you) He will make that no one overcomes your enemy? (In Allah let believers put their trust) the believers should put their trust in Allah that He will give them triumph and domination.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقلا يا أكمل الرسل إمحاضاً للنصح: { إِن يَنصُرْكُمُ ٱللَّهُ } المولي لأموركم بعزته وسلطانه { فَلاَ غَالِبَ لَكُمْ } أي: لا أحد يغلبكم ويخاصمكم؛ لكونكم في حمى الله وكنف حوله وقوته { وَإِن يَخْذُلْكُمْ } بقهره وسخطه { فَمَن ذَا ٱلَّذِي يَنصُرُكُم مِّنْ بَعْدِهِ } أي: من بعد قهره وبطشه { وَعَلَى ٱللَّهِ } المعز المذل القوي المتين { فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ } [آل عمران: 160] في جميع أمورهم حتى خلصوا وأخلصوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إن ينصركم الله } كما نصركم يوم بدر، { فلا غالب لكم } من أحد من الناس، { وإن يخذلكم } كما خذكم يوم أحد، { فمن } هذا { الذي ينصركم من بعده } تعالى، أي: فلا ناصر سواه\n وهذا تنبيه على الحث على التوكل، وتحريض على ما يستوجب به النصر، وهو الاعتماد على الله، وتحذير مما يستوجب الخذلان، وهو مخالفة أمره وعصيان رسوله، أو الاعتماد على غيره، ولذلك قال: { وعلى الله فليتوكل المؤمنون } لِمَا علموا ألا ناصر سواه\n الإشارة: إن ينصركم الله على مجاهدة النفوس، ودوام السير إلى حضرة القدوس، فلا غالب لكم من النفس، ولا من الناس ولا من الهوى ولا من الشيطان، وإن يخلذكم - والعياذ بالله - فمن ذا الذي ينصركم من بعد خذلانه لكم؟ فليعتمد المريد في سيره على مولاه، وليستنصر به في قطع حظوظه وهواه، فإنه لا ناصر له سواه\n وأنشدوا:\n",
      "translations": []
    }
  ]
}