{
  "chapter": "آل عمران",
  "text": "اولما اصبتكم مصيبة قد اصبتم مثليها قلتم انى هذا قل هو من عند انفسكم ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "How is it that when misfortune befell you, you said: \"Where has this come from?\" -- even though you had inflicted disaster twice as great on (the enemy). Say: \"This has come from your own selves.\" Surely God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how come when a calamity befell you, you began to ask: 'How has this come about?' even though the enemy has suffered at your hands (in the Battle of Badr) double what you have suffered! Say: This calamity has been brought about by yourselves. Surely Allah is Ail-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If misfortune befell you (the believers) your enemies had suffered twice as much (in the battle of Badr) but you asked, \"Where did the misfortune come from?\" (Muhammad), tell them, \"It came from yourselves. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will you say when disaster strikes you, though you had struck them with twice as much, “Where has this come from?” Say (to them, O dear Prophet Mohammed – peace and blessings be upon him), “It has come from yourselves”; indeed Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(What is the matter with you) When a single disaster smites you, although you smote (your enemies) with one twice as great, you say: \"From where does this come to us\" Say, \"It is from yourselves.\" And Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! when a misfortune befell you, and you had certainly afflicted (the unbelievers) with twice as much, you began to say: Whence is this? Say: It is from yourselves; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, when an affliction visited you, and you had visited twice over the like of it, did you say, 'How is this?' Say: 'This is from your own selves; surely God is powerful over everything.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And was it so, when a disaster smote you, though ye had smitten (them with a disaster) twice (as great), that ye said: How is this? Say (unto them, O Muhammad): It is from yourselves. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! When a misfortune befalls you, after you had yourself inflicted twice as heavy losses, you say, \"How has this come about?\" Say, \"It was your own fault.\" Truly, God has the power to will anything:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is its that when a reverse hath befallen you, albeit ye had inflicted twice as much, ye say: whence is this? Say thou: it is but from yourselves verily Allah is over everything potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, when an affliction visits you—while you have inflicted twice as much—do you say, ‘How is this?’! Say, ‘This is from your own souls.’ Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! When a single disaster smites you, although ye smote (your enemies) with one twice as great, do ye say?- \"Whence is this?\" Say (to them): \"It is from yourselves: For Allah hath power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(What is the matter with you?) When a single disaster smites you, although you smote (your enemies) with one twice as great, you say: \"From where does this come to us?\" Say (to them), \"It is from yourselves (because of your evil deeds).\" And Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, when an affliction hits you and that you had yourselves inflicted twice the like of it, you said: 'How is this' Say: 'This is from your own selves' Surely, Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a calamity befell you, even after you had inflicted twice as much, you said, “How is this?” Say, “It is from your own selves.” God is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why [is it that] when a [single] disaster struck you [on the day of Uhud], although you had struck [the enemy in the battle of Badr] with one twice as great, you said, \"From where is this?\" Say, \"It is from yourselves.\" Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:165] And why, when distress befell you, at Uhud, when seventy of you were slain, and you had afflicted twice the like of it, at Badr, slaying seventy of them and taking another seventy captive, did you say, in amazement, ‘How is this?’, that is, how did this defeat happen to us when we are Muslims and God’s Messenger is among us (the last statement [annā hādhā, ‘how is this?’] constitutes [the locus of] the interrogative of denial). Say, to them: ‘It is from yourselves, because you abandoned your [battle] stations and were thus defeated. Surely God has power over everything’, including [the giving of] assistance and the withholding of it, and He requited you for your disputing [the Prophet’s command].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "75 He then mentioned their misfortune on the Day of Uhud, saying: (And was it so, when a disaster smote you) on the Day of Uhud, (though you had smitten (them with a disaster) twice (as great)) as you inflicted on the people of Mecca, on the Day of Badr, a disaster twice that inflicted on you on the Day of Uhud, (that ye said: How is this?) how can this befall us when we are Muslims. (Say) Muhammad: (It is from yourselves) it is due to the transgression you committed yourselves when you left your positions. (Lo! Allah is Able to do all things) whether it is punishment or something else.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَ لَمَّآ أَصَـٰبَتْكُمْ مُّصِيبَةٌ } أي: أتيأسون وتقنطون من فضل الله عليكم أيها المؤمنون حين أصابتكم مصيبة يوم أُحد، ولا تذكرون نصره يوم بدر؛ إذ { قَدْ أَصَبْتُمْ } فيه { مِّثْلَيْهَا } إذ قتلتم سبعين وأسرتم سبعين؟ { قُلْتُمْ } من غاية حزنكم وأسفكم: { أَنَّىٰ هَـٰذَا } أي: من أين حدث لنا هذه الحادثة الهائلة ونحن قد وعدنا النصر والظفر؟ { قُلْ } لهم يا أكمل الرسل إلزاماً وتبكيتاً: { هُوَ مِنْ عِندِ أَنْفُسِكُمْ } بعدم تثبتكم وتصبركم على المكان الذي عينكم رسول الله صلى الله عليه وسلم، وعدم وفائكم على العهد الذي عاهدتم معه، أو من الفدية التي أخذتم يوم بدر، مع أن الأولى قتلهم واستئصالهم { إِنَّ ٱللَّهَ } المطلع على جميع مخايلكم { عَلَىٰ كُلِّ شَيْءٍ } من المصيبة والإصابة { قَدِيرٌ } [آل عمران: 165]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الهمزة - للتفريع، و { لَمَّا }: ظرف، خافضة لشرطها، منصوبة بجوابها، وهي معطوفة على محذوف، أي: أكان من كان يوم أحد، ولمّا أصابتكم مصيبة، قلتم ما قلتم، و { قد أصبتم }: جملة حالية\n يقول الحقّ جلّ جلاله: أحين { أصابتكم مصيبة } يوم أحد بقتل سبيعن منكم، و { قد أصبتم مثليها } يوم بدر فقتلتم سبعين وأسرتم سبعين، { قلتم أنَّى هذا } أي: من أين أصابنا هذا البلاء وقد وعدنا النصر؟ { قل } لهم: { هو من عند أنفسكم } أي: مما اقترفته أنفسكم من مخالفة المركز، والنصر الموعود كان مشروطاً بالثبات والطاعة، فلما اختل الشرط اختل المشورط، { إن الله على كل شيء قدير } فيقدر على النصر بشرط وبغيره، لكن حكمته اقتضت وجود الأسباب والشروط لأن هذا العلام قائم بين قدرة وحكمة\n أو: { قل هو من عند أنفسكم } باختياركم الفداء يوم بدر: رُوِيَ عن عليّ رضي الله عنه قال: جاء جِبْريل إلى النبيّ صلى الله عليه وسلم يوم بدر فقال: خيِّرْ أصْحَابَكَ في الأسارى، إن شاءوا القتل، وإن شاءوا الفِدَاء، عَلَى أنْ يُقْتَلَ مِنْهُمْ عاماً مقبلاً مِثْلُهمْ، قالوا: الفِدَاء ويُقْتَلُ مِنَّا\n والله تعالى أعلم\n الإشارة: إذا أصاب المريد شيء من المصائب والبلايا، فلا يستغرب وقوع ذلك به، ولا يتبرم منه، فإنه في دار المصائب والفجائع، \" لا تستغرب وقوع الأكدار ما دُمتَ في هذه الدار، فإنما أبرزت ما هو مستحق وصفها وواجب نعتها \"\n وإذا كان أصابته مصيبة في وقت، فقد أصابته نعمٌ جمة في أوقات عديدة، فليشكر الله على ما أولاه، وليصبر على ما ابتلاه، ليكون صباراً شكوراً\n قال الشيخ أبو الحسن - رضي الله عنه -: العارف هو الذي عرف إساءاته في إحسان الله إليه، وعرف شدائد الزمان في الألطاف الجارية من الله عليه، فاذكروا آلاء الله لعلكم تفلحون\n وأيضاً: كل ما يصيب المؤمن فمن كسب يده، ويعفو عن كثير\n وإن كان المريد وعد بالحفظ والنصر، فقد يكون ذلك بشروط خفيت عليه، فلم تحقق فيه، فيخلف حفظه لينفذ قدر الله فيه،\n",
      "translations": []
    }
  ]
}