{
  "chapter": "آل عمران",
  "text": "وليعلم الذين نافقوا۟ وقيل لهم تعالوا۟ قتلوا۟ فى سبيل الله او ادفعوا۟ قالوا۟ لو نعلم قتالا لاتبعنكم هم للكفر يومئذ اقرب منهم للايمن يقولون بافوههم ما ليس فى قلوبهم والله اعلم بما يكتمون",
  "translations": [
    {
      "translation": "and so that He would know the hypocrites. They were told, 'Come and fight in the Way of Allah or at least help defend us.' They said, 'If we knew there would be a fight, we would certainly follow you.' They were closer to kufr that day than to iman, saying with their mouths what was not in their hearts. And Allah knows best what they are hiding.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And may distinguish the hypocrites who were told: \"Fight in the way of God, or defend yourselves,\" and who had replied: \"If we knew of the fight we would have followed you.\" They were nearer unbelief than faith on that day, and they said with their tongues what was not in their hearts; but God is aware of what they hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who are hypocrites. And when these hypocrites were asked: 'Come and fight in the wayof Allah', or (at least) 'defend yourselves', they answered: 'If we but knew that there would be fighting, we would certainly have followed. They were nearer then to infidelity than to faith. They utter from their mouths what is not in their hearts. Allah knows well what they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who were the hypocrites. When the hypocrites were asked to fight for the cause of God or to defend the city, they replied, \"Had we known before that you would fight, we would certainly not have followed you.\" At that time they were closer to disbelief than to faith. They speak words that do not come from their hearts. God knows well whatever they try to hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in order to expose them who turned hypocrites; and it was said to them, “Come, fight in Allah's cause, or repel the enemy”; they answered, “If we knew how to fight, we would certainly have been with you”; and on that day they were nearer to open disbelief than to professed faith; they utter with their mouths what is not in their hearts; and Allah knows well what they hide. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He might test the hypocrites, it was said to them: \"Come, fight in the way of Allah or defend yourselves.\" They said: \"Had we known that fighting will take place, we would certainly have followed you.\" They were that day, nearer to disbelief than to faith, saying with their mouths what was not in their hearts. And Allah has full knowledge of what they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He might know the hypocrites; and it was said to them: Come, fight in Allah's way, or defend yourselves. They said: If we knew fighting, we would certainly have followed you. They were on that day much nearer to unbelief than to belief. They say with their mouths what is not in their hearts, and Allah best knows what they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He might also know the hypocrites when it was said of them, 'Come now, fight in the way of God, or repel!' They said, 'If only we knew how to fight, we would follow you.' They that day were nearer to unbelief than to belief, saying with their mouths that which never was in their hearts; and God knows very well the things they hide;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He might know the hypocrites, unto whom it was said: Come, fight in the way of Allah, or defend yourselves. They answered: If we knew aught of fighting we would follow you. On that day they were nearer disbelief than faith. They utter with their mouths a thing which is not in their hearts. Allah is Best Aware of what they hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and know those who acted hypocritically.\" When they were told, \"Come, fight in God's cause and defend yourselves,\" they replied, \"If we knew that fighting would take place, we would surely follow you.\" They were that day nearer to unbelief than to belief. The words they utter bear no relation to what is in their hearts. God knows well what they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that he might know those who played the hypocrite. And it was said unto them: come ye, fight in the way of Allah or defend. They said: if we knew it was to be a fair fight We would surely have followed you. Nearer were they on that day to infidelity than to belief. They say with their mouths that which is not in their hearts and Allah knoweth best that which they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and ascertain the hypocrites. [When] they were told: ‘Come, fight in the way of Allah, or defend [yourselves], they said, ‘If we knew any fighting, we would have surely followed you.’ That day they were nearer to unfaith than to faith. They say with their mouths what is not in their hearts, and Allah knows well whatever they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Hypocrites also. These were told: \"Come, fight in the way of Allah, or (at least) drive (The foe from your city).\" They said: \"Had we known how to fight, we should certainly have followed you.\" They were that day nearer to Unbelief than to Faith, saying with their lips what was not in their hearts but Allah hath full knowledge of all they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He might test the hypocrites, it was said to them: \"Come, fight in the Way of Allah or (at least) defend yourselves.\" They said: \"Had we known that fighting will take place, we would certainly have followed you.\" They were that day, nearer to disbelief than to Faith, saying with their mouths what was not in their hearts. And Allah has full knowledge of what they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He might know the hypocrites' When it was said to them: 'Come, fight or repel in the way of Allah' They replied: 'If only we knew how to fight, we would follow you' On that day, they were nearer to disbelief than belief. They said with their mouths what was not in their hearts. And Allah knows what they hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may know the hypocrites. And it was said to them, “Come, fight in the cause of God, or contribute.” They said, “If we knew how to fight, we would have followed you.” On that day they were closer to infidelity than they were to faith. They say with their mouths what is not in their hearts; but God knows what they hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He might make evident those who are hypocrites. For it was said to them, \"Come, fight in the way of Allah or [at least] defend.\" They said, \"If we had known [there would be] fighting, we would have followed you.\" They were nearer to disbelief that day than to faith, saying with their mouths what was not in their hearts. And Allah is most Knowing of what they conceal -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:167] And that He might also know the hypocrites, and those who, when it was said to them, after they had fled the fighting, namely, ‘Abd Allāh b. Ubayy and his companions: ‘Come now, fight in the way of God, His enemies, or defend’, us against the enemy by increasing the multitude [of our fighters], if you are not going to fight; they said, ‘If we knew how, [if] we were skilled enough, to fight we would follow you’. God then said, showing them to be liars: They that day were nearer to unbelief than to belief, for what they manifested of their forsaking the believers, whereas before they had been outwardly nearer to belief; saying with their mouths that which was not in their hearts, for even if they had known how to fight they would not have followed you. And God knows best what they hide, of hypocrisy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And that He might know the hypocrites) and that He might see the hypocrites, 'Abdullah Ibn Ubayy and his followers, returning to Medina, (unto whom it was said) 'Abdullah Ibn Jubayr said to them: (Come) to Uhud and (fight in the way of Allah, or defend yourselves) and your wives and children against the enemy, or increase the number of believers. (They answered: If we knew) there was (aught of fighting we would follow you) to Uhud. (On that day they were nearer disbelief than faith) or the believers; it is also said that this means: their return to disbelief and the disbelievers was closer than their return to faith and the believers. (They utter with their mouths a thing which is not in their hearts) to corroborate it. (Allah is best aware of what they hide) of disbelief and hypocrisy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَاتِلُواْ فِي سَبِيلِ ٱللَّهِ أَوِ ٱدْفَعُواْ } قالَ زَيدُ بن علي عليهما السَّلامُ: معناهُ كَثِّرُوا سَوادَكُم\n ورَابِطُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Fight in the way of Allah or} pay {tribute}, Zayd ibn Ali said: Its meaning is to increase your blackness.\n\n\nAnd keep your duty to Allah, O believers, that you may be successful.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلِيَعْلَمَ } ويَفْضل أيضاً { ٱلَّذِينَ نَافَقُواْ } أظهروا النفاق مع الله ورسوله { وَ } ذلك حين { قِيلَ لَهُمْ تَعَالَوْاْ قَاتِلُواْ فِي سَبِيلِ ٱللَّهِ } مع أعداء الله إلى أن تستأصلهم { أَوِ ٱدْفَعُواْ } ضررهم عن المسلمين { قَالُواْ } في الجواب على مقتضى نفاقهم المكنوز في قلوبهم: { لَوْ نَعْلَمُ } مساواة بينكم\n أو مضاعفتهم إياكم بمثلين فنسمي { قِتَالاً } فإذن { لاَّتَّبَعْنَاكُمْ } بل هم بأضعفكم عَدداً وعُدداً وما أنتم عليه\n إنما إلقاء النفس في التهلكة لا المقاتلة\n فكيف اتبعناكم؟\n\n\n{ هُمْ } بإظهار هذا القول { لِلْكُفْرِ يَوْمَئِذٍ أَقْرَبُ مِنْهُمْ لِلإِيمَانِ } لأن القول مناسب\n مطابق لكفرهم المكنون في قلوبهم دون إيمانهم\n مجرد القول الذي { يَقُولُونَ بِأَفْوَاهِهِم } تلبيساً وتغريراً { مَّا لَيْسَ فِي قُلُوبِهِمْ } من القبول والإذعان { وَٱللَّهُ } المطلع لضمائركم { أَعْلَمُ } منهم\n فهم { بِمَا يَكْتُمُونَ } [آل عمران: 167] في قلوبهم من الكمفر والنفاق يجازيهم على مقتضى علمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وقيل لهم تعالوا }: استئناف\nأو معطوف على { نافقوا } \n و { الذين قالوا لإخوانهم }: بدل من الضمير المجرور في { لهم } \n أي وقيل للمنافقين: قاتلوا أو ادفعوا\n ثم فسرهم بقوله: وهم { الذين قالوا لإخوانهم\n\n\n } الخ\n أو من الواو في { يكتمون } \n أو منصوب على الذم\n أو مبتدأ\n والخبر: { قل\n\n\n } على من يجيز إنشاء الخبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:2",
      "similarity": 0.5397678807127919
    },
    {
      "verse": "52:8",
      "similarity": 0.49706517098826425
    },
    {
      "verse": "23:96",
      "similarity": 0.42590464553756885
    },
    {
      "verse": "22:38",
      "similarity": 0.41055538562005756
    },
    {
      "verse": "41:34",
      "similarity": 0.38686074614206056
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:167.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:167.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:167.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}