{
  "chapter": "آل عمران",
  "text": "لقد من الله على المؤمنين اذ بعث فيهم رسولا من انفسهم يتلوا۟ عليهم ءايته ويزكيهم ويعلمهم الكتب والحكمة وان كانوا۟ من قبل لفى ضلل مبين",
  "translations": [
    {
      "translation": "Allah showed great kindness to the muminun when He sent a Messenger to them from among themselves to recite His Signs to them and purify them and teach them the Book and Wisdom, even though before that they were clearly misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has favoured the faithful by sending an apostle to them from among themselves, who recites to them His messages, and reforms and teaches them the Law and the judgement, for they were clearly in error before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah conferred a great favour on the believers when He raised from among them a Messenger to recite to them His signs, and to purify them, and to teach them the Book and Wisdom. For before that they were in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God granted a great favor to the believers by sending a Messenger from their own people to recite to them God's revelations, to purify them of moral defects, to teach them the Book, and to give them wisdom. Before this they had lived in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has indeed bestowed a great favour upon the Muslims, in that He sent to them a Noble Messenger (Prophet Mohammed – peace and blessings be upon him) from among them, who recites to them His verses, and purifies them, and teaches them the Book and wisdom; and before it, they were definitely in open error. (The Holy Prophet Mohammed – peace and blessings be upon him – is one of Allah’s greatest favours to mankind.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah conferred a great favor on the believers when He sent among them a Messenger from among themselves, reciting unto them His verses (the Qur'an), and purifying them, and instructing them (in) the Book (the Qur'an) and Al-Hikmah [the wisdom and the Sunnah], while before that they had been in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah conferred a benefit upon the believers when He raised among them an Apostle from among themselves, reciting to them His communications and purifying them, and teaching them the Book and the wisdom, although before that they were surely in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly God was gracious to the believers when He raised up among them a Messenger from themselves, to recite to them His signs and to purify them, and to teach them the Book and the Wisdom, though before they were in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah verily hath shown grace to the believers by sending unto them a messenger of their own who reciteth unto them His revelations, and causeth them to grow, and teacheth them the Scripture and wisdom; although before (he came to them) they were in flagrant error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, God has conferred a great favour on the believers in sending a Messenger from among themselves, to recite His revelations to them, and purify them, and teaches them the Book and wisdom, for, before that they were surely in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly Allah hath conferred a benefit on the believers when He raised up unto them an apostle from amongst themselves, he rehearseth unto them His revelations and purifieth them and teacheth them the Book and wisdom, and afore they were in an error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah certainly favoured the faithful when He raised up among them an apostle from among themselves to recite to them His signs and to purify them and teach them the Book and wisdom, and earlier they had indeed been in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah did confer a great favour on the believers when He sent among them a messenger from among themselves, rehearsing unto them the Signs of Allah, sanctifying them, and instructing them in Scripture and Wisdom, while, before that, they had been in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah conferred a great favour on the believers when He sent among them a Messenger (Muhammad SAW) from among themselves, reciting unto them His Verses (the Quran), and purifying them (from sins by their following him), and instructing them (in) the Book (the Quran) and Al-Hikmah [the wisdom and the Sunnah of the Prophet SAW (i.e. his legal ways, statements, acts of worship, etc.)], while before that they had been in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has surely been gracious to the believers when He sent among them a Messenger from themselves to recite to them His verses, to purify them, and to teach them the Book and the Wisdom (prophetic sayings), though before that they were in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has blessed the believers, as He raised up among them a messenger from among themselves, who recites to them His revelations, and purifies them, and teaches them the Scripture and wisdom; although before that they were in evident error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly did Allah confer [great] favor upon the believers when He sent among them a Messenger from themselves, reciting to them His verses and purifying them and teaching them the Book and wisdom, although they had been before in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:164]   Truly God was gracious to the believers when He sent to them a messenger from among their own, that is to say, an Arab like them, not an angel or a non-Arab, so that they can understand what he says and feel honoured thereby, to recite to them His verses, the Qur’ān, and to purify them, to cleanse them of sins, and to teach them the Book, the Qur’ān, wisdom, the Sunna, though (in, is softened [in place of inna], that is, innahum, ‘though they…’) before, that is, before he was sent, they were in clear error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions his blessings on them, saying: (Allah verily hath shown grace to the believers by sending unto them a messenger) of the Children of Adam whose lineage is well known (of their own) an Arab, like them, from the tribe of the Quraysh (who reciteth unto them His revelations) the Qur'an containing commands and prohibitions, (and causeth them to grow) he purifies them by means of the attestation of Allah's divine Oneness from idolatry as well as by cleansing them from their sins, (and teacheth them the Scripture) the Qur'an (and wisdom) the lawful and the prohibited; (although before) the advent of Muhammad and the Qur'an (they were in flagrant error) they were adherents of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالله { لَقَدْ مَنَّ ٱللَّهُ } منة عظيمة { عَلَى ٱلْمُؤمِنِينَ } المخلصين { إِذْ بَعَثَ فِيهِمْ } لهدايتهم { رَسُولاً } مرشداً لهم، ناشئاً { مِّنْ أَنْفُسِهِمْ } يرشدهم بأنواع الإرشاد { يَتْلُواْ عَلَيْهِمْ } ويسمعهم أولاً { آيَاتِهِ } الدالة على وحدة ذاته { وَيُزَكِّيهِمْ } ثانية عن وسوسة شياطين الأهواء، المضلة عن طريق التوحيد { وَيُعَلِّمُهُمُ } ثالثاً { ٱلْكِتَابَ } المبيِّن لهم طريقة تصفية الظاهر، وما يتعلق بعالم الشهادة { وَ } رابعاً بعلمهم { ٱلْحِكْمَةَ } المصفيَّة للباطن عن الميل إلى الغير والسوى، الموصلة إلى سدرة المنتهى التي عندها جنبة المأوى { وَإِن كَانُواْ مِن قَبْلُ } أي: قبل انكشافهم بالمراتب الأربعة { لَفِي ضَلالٍ مُّبِينٍ } [آل عمران: 164] وخذلان عظيم\n\n\n\n\nنبهنا بفضلك عن نومة الغافلين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:2",
      "similarity": 0.7217040200270097
    },
    {
      "verse": "2:129",
      "similarity": 0.6442979929340893
    },
    {
      "verse": "2:151",
      "similarity": 0.5439131245803932
    },
    {
      "verse": "74:6",
      "similarity": 0.44976383555302046
    },
    {
      "verse": "49:17",
      "similarity": 0.43438898364585865
    }
  ]
}