{
  "chapter": "آل عمران",
  "text": "ما كان الله ليذر المؤمنين على ما انتم عليه حتى يميز الخبيث من الطيب وما كان الله ليطلعكم على الغيب ولكن الله يجتبى من رسله من يشاء فـامنوا۟ بالله ورسله وان تؤمنوا۟ وتتقوا۟ فلكم اجر عظيم",
  "translations": [
    {
      "translation": "Allah will only leave the muminun in the position you now are in so that He can sift out the rotten from the good. Allah has not given you access to the Unseen. But Allah chooses those of His Messengers whom He wills. So have iman in Allah and His Messengers. If you have iman and taqwa you will have an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not leave the believers in the state they are in till He has sifted the evil from the good; nor will God reveal the secrets of the Unknown. He chooses (for this) from His apostles whom He will. So believe in God and the prophets, for if you believe and fear the displeasure of God your reward will be great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not let the believers stay in the state they are: He will set the wicked apart from the good. Allah is not going to disclose to you what is hidden in the realm beyond the reach of perception, but He chooses from among His Messengers whom He wills (to intimate such knowledge). Believe, then, in Allah and in His Messengers; and if you believe and be come God-fearing, yours will be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God left the believers in their existing state for no other reason than to distinguish the evil-doers from the virtuous ones. God does not inform you of the unseen. He chooses for such information anyone of His Messengers that He wants. Have faith in God and in His Messengers. If you have faith and are pious, there will be a great reward for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not leave you, O People who Believe (the Muslims) in your present state, till He separates the evil from the good; and it does not befit Allah’s Majesty to give you, the common men, knowledge of the hidden, but Allah does chose from His Noble Messengers whomever He wills; so believe in Allah and His Noble Messengers; and if you believe and practice piety, for you is a great reward. (Allah gave the knowledge of the hidden to the Holy Prophet – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not leave the believers in the state in which you are now, until He distinguishes the wicked from the good. Nor will Allah disclose to you the secrets of the Unseen, but Allah chooses of His Messengers whom He wills. So believe in Allah and His Messengers. And if you believe and have Taqwa of Allah, then for you there is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On no account will Allah leave the believers in the condition which you are in until He separates the evil from the good; nor is Allah going to make you acquainted with the unseen, but Allah chooses of His apostles whom He pleases; therefore believe in Allah and His apostles; and if you believe and guard (against evil), then you shall have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not leave the believers in the state in which you are, till He shall distinguish the corrupt from the good, and God will not inform you of the Unseen; but God chooses out of His Messengers whom He will. Believe you then in God and His Messengers; and if you believe and are godfearing, there shall be for you a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (the purpose) of Allah to leave you in your present state till He shall separate the wicked from the good. And it is not (the purpose of) Allah to let you know the Unseen. But Allah chooseth of His messengers whom He will, (to receive knowledge thereof). So believe in Allah and His messengers. If ye believe and ward off (evil), yours will be a vast reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On no account will God leave the believers in the condition in which they are now, until He separates the evil from the good. Nor will God reveal to you the unseen. But God chooses those of his messengers whom He will. Therefore, believe in God and His messengers, for if you have faith and guard yourselves against evil, you shall have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is not one to leave the believers in the state wherein ye are until He hath discriminated the impure from the pure. And Allah is not one to acquaint you with the Unseen, but Allah chooseth him whomsoever He willeth, of His apostles. Believe wherefore in Allah and His apostles; and if ye believe and fear, yours shall be a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not leave the faithful in your present state, until He has separated the bad ones from the good. Allah will not acquaint you with the Unseen, but Allah chooses whomever He wishes from His apostles. So have faith in Allah and His apostles; and if you are faithful and Godwary, there shall be a great reward for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not leave the believers in the state in which ye are now, until He separates what is evil from what is good nor will He disclose to you the secrets of the Unseen. But He chooses of His Messengers (For the purpose) whom He pleases. So believe in Allah. And His messengers: And if ye believe and do right, ye have a reward without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not leave the believers in the state in which you are now, until He distinguishes the wicked from the good. Nor will Allah disclose to you the secrets of the Ghaib (unseen), but Allah chooses of His Messengers whom He pleases. So believe in Allah and His Messengers. And if you believe and fear Allah, then for you there is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not leave the believers in that which you are till He shall distinguish the evil from the good. Allah will not let you see the unseen. But Allah chooses from His Messengers whom He will. Therefore, believe in Allah and His Messengers, for if you believe and are cautious there shall be for you a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not leave the believers as you are, without distinguishing the wicked from the sincere. Nor will God inform you of the future, but God elects from among His messengers whom He wills. So believe in God and His messengers. If you believe and practice piety, you will have a splendid reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah would not leave the believers in that [state] you are in [presently] until He separates the evil from the good. Nor would Allah reveal to you the unseen. But [instead], Allah chooses of His messengers whom He wills, so believe in Allah and His messengers. And if you believe and fear Him, then for you is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:179] It is not God’s purpose to leave, to abandon, the believers in the state in which you, O people, are, where the sincere are intermingled with those otherwise, till He shall distinguish (read yamīza or yumayyiza), [till] He separates, the evil one, the hypocrite, from the good, the believer, through the burdensome obligations that will reveal this [distinction] — He did this on the Day of Uhud. And it is not God’s purpose to apprise you of the Unseen, so that you could recognise the hypocrites from the others, before the distinguishing; but God chooses, He selects, of His messengers whom He will, apprising him of [some of] His Unseen, as when He apprised the Prophet (s) of the position of the hypocrites. So believe in God and His messengers; and if you believe and guard against, hypocrisy, then yours shall be a great wage.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "With regard to the idolaters saying to Muhammad: \"You say to us that there are amongst us believers and unbelievers. Show us, Muhammad, who believes among us and who does not\", Allah then said: (It is not 77 (the purpose) of Allah to leave the believers) and unbelievers (in your present state) of religion until the believer becomes an unbeliever and the unbeliever becomes a believer if it is so in His decree (till He shall separate the wicked from the good) the damned from the felicitous, the unbeliever from the believer and the hypocrite from the sincere. (And it is not (the purpose of) Allah to let you know) people of Mecca (the unseen) such that you know who believes and who does not. (But Allah chooseth) selects (of His messengers whom He will) i.e. Muhammad, and informs him of some of the unseen through revelation. (So believe in Allah and His messengers) believe in all the messengers and Scriptures. (If ye believe) in Allah and all the Scriptures and messengers (and ward off (evil)) ward off disbelief and idolatry, (yours will be a vast reward) an abundant reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَجْتَبِي مِن رُّسُلِهِ } معناهُ يَخْتَارُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He will choose from His messengers,\" means He will select.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ما كان الله ليذر المؤمنين على ما أنتم عليه } من ظاهر الإسلام وتصديق اللسان { حتى يميز الخبيث } من صفات النفس وشكوك الوهم وحظوظ الشيطان\n ودواعي الهوى من طيبات صفات القلب كالإخلاص واليقين والمكاشفة ومشاهدات الروح ومناغيات السرّ ومسامراته\n وتخلص المعرفة والمحبة لله بالابتلاء ووقوع الفتن والمصائب بينكم\n { وما كان الله ليطلعكم على } غيب وجودكم من الحقائق والأحوال الكامنة فيكم بلا واسطة الرسول لبعد ما بينكم وبينه وعدم المناسبة وانتفاء استعداد التلقي منه { ولكن الله يجتبي من رسله من يشاء } فيطلعه على أسراره وحقائقه بالكشف ليهديكم إلى ما غاب عنكم من كنوز وجودكم وأسراره للجنسية النفسانية التي بينه وبينكم\n الموجبة لإمكان اهتدائكم به { فآمنوا بالله ورسله } بالتصديق القلبيّ والإرادة والتمسك بالشريعة ليمكنكم التلقي والقبول منهم { وإن تؤمنوا } بعد ذلك الإيمان بالتحقيق والسلوك إلى اليقين والمتابعة في الطريقة { وتتقوا } الحجب النفسانية وموانع السلوك { فلكم أجر عظيم } من كشف الحقيقة { بما أتاهم الله من فضله } من المال والعلم والقدرة والنفس ولا ينفقونه في سبيل الله على المستحقين والمستعدّين والأنبياء والصدّيقين في الذبّ عنهم أو الفناء في الله { سيطوقون ما بخلوا به يوم القيامة } أي: يجعل غلّ أعناقهم وسبب تقييدهم وحرمانهم عن روح الله ورحمته وموجب هوانهم وحجابهم عن نور جماله لمحبتهم له وتعلقهم به { ولله ميراث السموات والأرض } من النفوس وصفاتها كالقوى والقدر والعلوم والأموال وكل ما ينطبق عليه اسم الوجود فما لهم يبخلون بماله عنه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والمخلص من المرائي فقال: { مَّا كَانَ ٱللَّهُ } المطلع لضمائر عباده { لِيَذَرَ } وليترك { ٱلْمُؤْمِنِينَ } المخلصين { عَلَىٰ مَآ أَنْتُمْ عَلَيْهِ } من الالتباس والمشاركة مع اهل الكفر والنفاق بحسب الظاهر\n بل يختبر ويمتحن إخلاصكم بأنواع البليات والمصيبات { حَتَّىٰ يَمِيزَ } ويفصل { ٱلْخَبِيثَ } المنافق\n المصر على النفاق { مِنَ ٱلطَّيِّبِ } المؤمن\n الموقن بتوحيد الله\n الراضي بما جرى عليه من قضائه\n\n\n{ وَ } بعد تميزه وفصله سبحانه { مَا كَانَ ٱللَّهُ لِيُطْلِعَكُمْ } أي: جميعكم { عَلَى ٱلْغَيْبِ } الذي هو الاطلاع على خفيات ضمائر عباده { وَلَكِنَّ ٱللَّهَ } المحيط بجميع القابليات { يَجْتَبِي } ويختار { مِن رُّسُلِهِ مَن يَشَآءُ } بأن يوحي إليه\n ويلهمه التمييز بين استعدادات عباده للإيمان والكفر\n وإذا كان أمركم عند الله ورسوله { فَآمِنُواْ } أيها المؤمنون { بِٱللَّهِ } المميز لكم أصالة { وَرُسُلِهِ } الملهمين بالتمييز بأمره تبعاً { وَإِن تُؤْمِنُواْ } وتحافظوا على شعائر الإيمان بعدما آمنتم { وَتَتَّقُواْ } عن مخالفاته { فَلَكُمْ } عند الله { أَجْرٌ عَظِيمٌ } [آل عمران: 179] هو إيصالكم إلى التحقيق بمقام العبودية والتوحيد\n إذ لا أجر أعظم منه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: ماز يميز، وميّز يُمَيِّز، بمعنى واحد، لكن في ميّز معنى التكثير. يقول الحقّ جلّ جلاله: لعامة المؤمنين والمنافقين: { ما كان الله } ليترك { المؤمنين على ما أنتم عليه } من الاختلاط، لا يعرف مخلصكم من منافقكم، بل لا بد أن يختبركم حتى يتميز المنافق من المخلص، بالوحي أو بالتكاليف الشاقة، التي لا يصبر عليها إلا المخلصون، كبذل الأموال والأنفس في سبيل الله، ليختبر به بواطنكم، ويستدل به على عقائدكم، أو بما ظهر في غزوة أحد من الأقوال والأفعال التي تدل على الإيمان أو النفاق، { وما كان الله ليُطلعكم على الغيب } حتى تعرفوا ما في القلوب من كفر أو إيمان، أو تعرفوا: هل تَغْلُبون أو تُغْلَبُون. { ولكن الله يجتبي } لرسالته { من يشاء } ، فيوحي إليه ويخبره ببعض المغيبات، أو ينصب له ما يدل عليها، { فآمنوا بالله } الذي اختص بعلم الغيب الحقيقي، وآمنوا برسله الذين اختارهم لأسرار الغيوب، لا يعلمون إلا ما علَّمهم. رُوِيَ أن الكفرة قالوا: إن كان محمد صادقاً فليخبرنا: من يؤمن منا ومن يكفر؟ فنزلت الآية. وقيل: سببها ما تقدم من قول المنافقين، ووجه المناسبة: هو ما صَدَرَ منهم يوم أُحُد من المقالات التي ميزتهم من المؤمنين. { وإن تؤمنوا } إيماناً حقيقياً { وتتقوا } النفاق والشرك { فلكم أجر عظيم } عند الله. الإشارة: من سُنّة الله في المتوجهين إليه إذا كثروا، وظهرت فيهم دعوى القوى، أرسل الله عليهم ريح التصفية، فيثبت الصحيح، والخاوي تذروه الريح، وما ان الله ليذرهم على ما هم عليه من غير اختبار، حتى يميز الخبيث من الطيب، أي: مَنْ هِمَّتُه الله ومَنْ هِمَّتُه سواه، وما كان الله ليُطلعكم على الغيب حتى يعلموا من يثبت ممن يرجع، أو يعلموا ما يلحقهم من الجلال والجمال، وإنما ذلك خاص بالرسل عليهم السلام، وقد يُطلع على شيء من ذلك بعض خواص ورثتهم الكرام، فالواجب على المريد أن يُؤمن بالقدر المغيب، ولا يستشرف على الاطلاع عليه \" استشرافُك على ما بطن فيك من العيوب، خير من استشرافك على ما حُجب عنك من الغيوب \". { وإن تؤمنوا } بمواقع القضاء والقدر، { وتتقوا } القنوط والكدر، { فلكم أجر عظيم }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:59",
      "similarity": 0.5746647148038134
    },
    {
      "verse": "8:37",
      "similarity": 0.5503714453266083
    },
    {
      "verse": "67:8",
      "similarity": 0.38437055859666264
    },
    {
      "verse": "24:26",
      "similarity": 0.3101263763670626
    },
    {
      "verse": "5:100",
      "similarity": 0.2834358765350632
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:179.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:179.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:179.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}