{
  "chapter": "آل عمران",
  "text": "الذين استجابوا۟ لله والرسول منۢ بعد ما اصابهم القرح للذين احسنوا۟ منهم واتقوا۟ اجر عظيم",
  "translations": [
    {
      "translation": "Those who did good and had taqwa among those who responded to Allah and the Messenger after the wound had been inflicted will have an immense reward:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who obeyed the call of God and His Messenger, even after they were wounded, and took heed for themselves, shall indeed have an ample reward,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There were those who responded to the call of Allah and the Messenger after injury had smitten them - for all those who do good and fear Allah there is a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteous and pious of those who have pledged obedience to God and the Messenger, after injury had befallen them, will receive a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who responded to the call of Allah and His Noble Messenger after they had been grieved; for the virtuous and the pious among them is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who answered (the Call of) Allah and the Messenger after being wounded; for those of them who did good deeds and feared Allah, there is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who responded (at Ohud) to the call of Allah and the Apostle after the wound had befallen them, those among them who do good (to others) and guard (against evil) shall have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who answered God and the Messenger after the wound had smitten them - to all those of them who did good and feared God, shall be a mighty wage;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who heard the call of Allah and His messenger after the harm befell them (in the fight); for such of them as do right and ward off (evil), there is great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who responded to the call of God and the Messenger, despite their having received an injury, and such of them as did good deeds and feared God, shall have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who answered to the call of Allah and the apostle after the wound that befell them --for those who did well among them and feared God shall be a mighty hire-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who responded to Allah and the Apostle [even] after they had been wounded—for those of them who have been virtuous and Godwary there shall be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who answered the call of Allah and the Messenger, even after being wounded, those who do right and refrain from wrong have a great reward;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who answered (the Call of) Allah and the Messenger (Muhammad SAW) after being wounded; for those of them who did good deeds and feared Allah, there is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who answered Allah and the Messenger after the wound had afflicted them, for those of them who did good and were cautious there is a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who responded to God and the Messenger, despite the persecution they had suffered. For the virtuous and the pious among them is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those [believers] who responded to Allah and the Messenger after injury had struck them. For those who did good among them and feared Allah is a great reward -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:172] Those who (alladhīna, is the subject) responded to God and the Messenger, [to] his call to set out for battle: when Abū Sufyān and his companions wanted to resume [hostilities] they agreed with the Prophet (s) that the encounter would be at the [annual] market-fair of Badr a year from the date of Uhud; after the wounds had afflicted them, at Uhud — (the predicate of the subject [alladhīna] is [what follows]) for all those who were virtuous, by obeying him, and feared, to disobey him, shall be a great wage, namely, Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned their accompaniment of the Prophet (pbuh) in the lesser Badr (Badr al-Sughra), saying: (As for those who heard the call of Allah) answered Allah by obeying Him (and His messenger) by accompanying him in the lesser Badr (after the harm) on the Day of Uhud (befell them (in the fight); for 76 such of them as do right) by accompanying the Prophet (pbuh) at the lesser Badr (and ward off (evil)) ward off contravention against Allah and disobeying the Messenger, (there is great reward) abundant reward in Paradise,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ ٱسْتَجَابُواْ } طلبوا الإجابة { للَّهِ وَٱلرَّسُولِ } حين دعاهم الله ورسوله إلى المقاتلة { مِن بَعْدِ مَآ أَصَابَهُمُ ٱلْقَرْحُ } من العدو بلا مماطلة وتسويف، بل رغبتهم أشد من الكرة الأولى\n\n\n\n\nوذلك أن أبا سفيان وأصحابه لما رجعوا من المدينة، فبلغوا الروحاء ندموا وقصدوا الرجوع؛ ليستأصلوهم، فبلغهم الخبر إلى رسول الله صلى الله عليه وسلم فندب أصحابه للخروج في طلبهم، وقال: لا يخرج معنا اليوم إلا من كان معنا أمس\n\n\n\n\nفخرج صلى الله عليه وسلم مع جماعة من المؤمنين حتى بلغوا حمراء الأسد، وهي على ثمانية أميال من المدينة، وكان بأصحابه الفرح والسرور، متلهفين، متحسرين للشهادة، مشتوقين إلى مرتبة إخوانهم الذين استشهدوا في سبيل الله، فمر بهم معبد الخزاعي، وكان مشركاً يومئذ، فقال: يا محمد، لقد عز علينا ما أصابك وأصاحبك، ثم خرج فلقي أبا سفيان بالروحاء، فقال له أبو سفيان: ما وراءك يا معبد؟ قال: محمد قد خرج مع أصحابه، يطلبونكم على مهور لم أر مثلهم في الجراءة أحداً، يتحرقون عليكم تحرقاً لو لقيتم، قال أبو سفيان: ويلك! ما تقول؟ قال: والله، ما أراك تحل حتى ترى نواحي الخيل، قال: فوالله لقد أجمعنا للكرة عليهم؛ لنستأصل بقيتهم، قال: فإني والله، أنهاك عن ذلك\n\n\nفألقى الله الرغب في قلوبهم، فرجعوا مستوحشين منهم، لذلك قال سبحانه في حق المؤمنين { لِلَّذِينَ أَحْسَنُواْ } ببذل المهج في سبيل الله، بالخروج مع رسوله { مِنْهُمْ وَٱتَّقَواْ } عن مخالفة أمر الله ورسوله { أَجْرٌ عَظِيمٌ } [آل عمران: 172] لا أجر أعظم منه، وهو الفوز بالبقاء الأيدي والحياة السرمدية، وهم من كمال إيمانهم بهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:140",
      "similarity": 0.6085082117149541
    },
    {
      "verse": "4:79",
      "similarity": 0.08497630727281406
    },
    {
      "verse": "33:29",
      "similarity": 0.08383234330141547
    },
    {
      "verse": "7:194",
      "similarity": 0.08291746841287495
    },
    {
      "verse": "5:109",
      "similarity": 0.08222102631035247
    }
  ]
}