{
  "chapter": "آل عمران",
  "text": "فانقلبوا۟ بنعمة من الله وفضل لم يمسسهم سوء واتبعوا۟ رضون الله والله ذو فضل عظيم",
  "translations": [
    {
      "translation": "So they returned with blessings and bounty from Allah and no evil touched them. They pursued the pleasure of Allah. Allah's favour is indeed immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And returned with God's favour and grace without harm, for they attended the pleasure of God; and great is the benevolence of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with a mighty favour and a great bounty from Allah having suffered no harm. They followed the good pleasure of Allah, and Allah is the Lord of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They returned with the favors and the bounties of God untouched by evil and followed by the pleasure of God. God's favor is great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with the favour and munificence from Allah, in that no harm reached them; they followed what pleased Allah; and Allah is Extremely Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with grace and bounty from Allah. No harm touched them; and they followed the pleasure of Allah. And Allah is the Owner of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with favor from Allah and (His) grace, no evil touched them and they followed the pleasure of Allah; and Allah is the Lord of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with blessing and bounty from God, untouched by evil; they followed the good pleasure of God; and God is of bounty abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with grace and favour from Allah, and no harm touched them. They followed the good pleasure of Allah, and Allah is of Infinite Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They returned home with God's favour and blessings, without having been touched by evil; for they pursued God's pleasure. And God's bounty is infinite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They then returned with a favour from Allah and His grace: no evil touched them: and they followed Allah's pleasure and Allah is Owner of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with Allah’s blessing and grace, untouched by any harm. They pursued the pleasure of Allah, and Allah is dispenser of a great grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they returned with Grace and bounty from Allah: no harm ever touched them: For they followed the good pleasure of Allah: And Allah is the Lord of bounties unbounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with Grace and Bounty from Allah. No harm touched them; and they followed the good Pleasure of Allah. And Allah is the Owner of Great Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, they returned with the Favor and Bounty of Allah so evil did not touch them. They followed the pleasure of Allah, and Allah is of Great Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they came back with grace from God, and bounty, and no harm having touched them. They pursued what pleases God. God possesses immense grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they returned with favor from Allah and bounty, no harm having touched them. And they pursued the pleasure of Allah, and Allah is the possessor of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:174] So they returned, from Badr, with grace and bounty from God, safely and with profit, and no evil touched them, from any slaying or wounds; and they followed the beatitude of God, by obeying Him and obeying His Messenger, when they [agreed to] set out [for the battle]; and God is of bounty abounding, for those that obey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So they returned with grace) reward (and favour from Allah,) and profit from that which they traded in the market place; it is also said that this means: booty (and no harm) fighting or defeat (touched them) in going and returning. (They followed the good pleasure of Allah) by accompanying the Prophet (pbuh) at the lesser Badr, (and Allah) by driving the enemy from them (is of Infinite Bounty) favour.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما فوضوا أمورهم إلى الله، واعتصموا له، واستنصروا منه، وتوكلوا عليه، قذف في قلوب عدوهم الرعب فهربوا { فَٱنْقَلَبُواْ } رجعوا من حمراء الأسد { بِنِعْمَةٍ } عظيمة { مِّنَ ٱللَّهِ } جزاء ما صبروا { وَفَضْلٍ } زيادة عطاء لهم تفضلاً وامتناناً؛ لتحققهم في مقام الرضاء بما أصابهم من القضاء { لَّمْ يَمْسَسْهُمْ سُوۤءٌ } أصلاً بعدما أصابوا يوم أُحد، بل صاروا غالبين دائماً على الأعداء { وَ } ذلك لأنهم { ٱتَّبَعُواْ رِضْوَانَ ٱللَّهِ } ومتابعة رسوله بلا ميل منهم إلى هوية نفوسهم { وَٱللَّهُ } المجاري لعباده { ذُو فَضْلٍ عَظِيمٍ } [آل عمران: 174] ولطف جسيم على من هو من أهل الرضا والتسليم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:156",
      "similarity": 0.4953016821258186
    },
    {
      "verse": "62:4",
      "similarity": 0.43226937437092033
    },
    {
      "verse": "8:29",
      "similarity": 0.39683493189839436
    },
    {
      "verse": "9:21",
      "similarity": 0.3583902353161041
    },
    {
      "verse": "57:29",
      "similarity": 0.34788631501083334
    }
  ]
}