{
  "chapter": "آل عمران",
  "text": "الذين قال لهم الناس ان الناس قد جمعوا۟ لكم فاخشوهم فزادهم ايمنا وقالوا۟ حسبنا الله ونعم الوكيل",
  "translations": [
    {
      "translation": "those to whom people said, 'The people have gathered against you, so fear them.' But that merely increased their iman and they said, 'Allah is enough for us and the Best of Guardians.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were told: \"They have gathered an army, beware,\" and their faith increased and they said: \"God is sufficient for us, and the best of protectors,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people said to them: 'Behold, a host has gathered around you and you should fear them', it only increased their faith and they answered: 'Allah is Sufficient for us; and what an excellent Guardian He is!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people, when warned to fear those who are gathered against them, are strengthened in their faith and say, \"God is All-sufficient as our Guardian.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the people said, “The people have gathered against you, therefore fear them”, so their faith was further increased; and they said, “Allah is Sufficient for us – and what an excellent (reliable) Trustee (of affairs) is He!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the people said, \"Verily, the people have gathered against you, therefore, fear them.\" But it (only) increased them in faith, and they said: \"Allah is Sufficient for us, and He is the Best Disposer of affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the people said: Surely men have gathered against you, therefore fear them, but this increased their faith, and they said: Allah is sufficient for us and most excellent is the Protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those to whom the people said, 'The people have gathered against you, therefore fear them', but it increased them in faith, and they said, 'God is sufficient for us; an excellent Guardian is He.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom men said: Lo! the people have gathered against you, therefor fear them. (The threat of danger) but increased the faith of them and they cried: Allah is Sufficient for us! Most Excellent is He in Whom we trust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, on being told that, \"the enemy has gathered against you a great force, so fear them,\" only grew stronger in their faith and replied, \"God is sufficient for us. He is the best guardian.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom when certain men said: verily the people have mustered strong against you, so be afraid of them, it only increased them in belief, and they said: sufficient unto us is Allah, and an excellent Trustee is He!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Those to whom the people said, ‘All the people have gathered against you, so fear them.’ That only increased them in faith, and they said, ‘Allah is sufficient for us, and He is an excellent trustee.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men said to them: \"A great army is gathering against you\": And frightened them: But it (only) increased their Faith: They said: \"For us Allah sufficeth, and He is the best disposer of affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (i.e. believers) unto whom the people (hypocrites) said, \"Verily, the people (pagans) have gathered against you (a great army), therefore, fear them.\" But it (only) increased them in Faith, and they said: \"Allah (Alone) is Sufficient for us, and He is the Best Disposer of affairs (for us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the people said: 'The people have gathered against you, therefore fear them' but it increased them in belief and they said: 'Allah is Sufficient for us. He is the Best Guardian'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the people have said, “The people have mobilized against you, so fear them.” But this only increased them in faith, and they said, “God is enough for us; He is the Excellent Protector.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom hypocrites said, \"Indeed, the people have gathered against you, so fear them.\" But it [merely] increased them in faith, and they said, \"Sufficient for us is Allah, and [He is] the best Disposer of affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:173] Those to whom (alladhīna, substitutes for the previous alladhīna, ‘those who’, or an adjectival qualification [of it]) people, that is, Nu‘aym b. Mas‘ūd al-Ashja‘ī, said, ‘The people, Abū Sufyān and his companions, have gathered, their multitudes, against you, in order to exterminate you, therefore fear them’, and do not go out to [encounter] them; but that, saying, increased them in faith, in their belief in God and in certainty, and they said, ‘God is sufficient for us, He will deal fully for us with their affair; an excellent Guardian is He’ , the One to whom the matter is entrusted. They thus set out with the Prophet (s) and arrived at the market-fair of Badr, but God had cast terror into the hearts of Abū Sufyān and his followers and so they did not turn up. They [the believers] had merchandise with them, and so they traded and made profits. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن يكون { الذين قال لهم الناس } إلى آخره ، بدلاً من { الذين استجابوا لله والرسول } \\[ آل عمران : 172 \\] ، أو صفة له ، أو صفة ثانية للمؤمنين في قوله : { وأن الله لا يضيع أجر المؤمنين } \\[ آل عمران : 171 \\] على طريقة ترك العطف في الأخبار . وإنَّما جيء بإعادة الموصول ، دون أن تعطف الصلة على الصلة ، اهتماماً بشأن هذه الصلة الثانية حتّى لا تكون كجزء صلةٍ ، ويجوز أن يكون ابتداء كلام مستأنففٍ ، فيكون مبتدأ وخبره قوله : { إنما ذلكم الشيطان يخوف أولياءه } \\[ آل عمران : 175 \\] أي ذلك القول ، كما سيأتي . وهذا تخلّص بذكر شأن من شؤون المسلمين كفاهم الله به بأس عدوّهم بعد يَوم أحُد بعاممٍ ، إنجازاً لوعدهم مع أبي سفيان إذ قال : مَوعدكم بدر في العام القابل ، وكان أبو سفيان قد كره الخروج إلى لقاء المسلمين في ذلك الأجل ، وكاد للمسلمين ليُظهر إخلاف الوعد منهم ليجعل ذلك ذريعة إلى الإرجاف بين العرب بضعف المسلمين ، فجَاعَل ركباً من عبدِ القيس مارينَ بمَرّ الظَّهْرانَ قرب مكّة قاصدين المدينة للميرة ، أن يخبروا المسلمين بأنّ قريشاً جمعوا لهم جيشاً عظيماً ، وكان مع الركب نعيم بن مسعود الأشجعي ، فأخبر نعيم ومن معه المسلمين بذلك فزاد ذلك المسلمين استعداداً وحميّة للدين ، وخرجوا إلى الموعد وهو بدر ، فلم يجدوا المشركين وانتظروهم هنالك ، وكانت هنالك سوق فاتّجَرُوا ورجعوا سالمين غير مذمومين ، فذلك قوله تعالى : { الذين قال لهم الناس أي الركب العَبْدِيُّون إن الناس قد جمعوا لكم } أي إنّ قريشاً قد جمعوا لكم . وحذف مفعول { جمعوا } أي جمعوا أنفسهم وعُددهم وأحلافهم كما فعلوا يوم بدر الأول .وقال بعض المُفسّرين وأهل العربية : إنّ لفظ الناس هنا أطلق على نُعيم بن مسعود وأبي سفيان ، وجعلوه شاهداً على استعمال الناس بمعنى الواحد والآية تحتمله ، وإطلاق لفظ الناس مراداً به واحد أو نحوه مستعمل لقصد الإبهام ، ومنه قوله تعالى : { أم يحسدون الناس على ما ءاتاهم الله من فضله } \\[ النساء : 54 \\] قال المفسّرون : يعني ب ( الناس ) محمداً صلى الله عليه وسلموقوله : { فزادهم إيماناً } أي زادهم قول الناس ، فضمير الرفع المستتر في { فزادهم } عائد إلى القول المستفاد من فعل { قال لهم الناس } أو عائد إلى الناس ، ولمّا كان ذاك القول مراداً به تخويف المسلمين ورجوعهم عن قصدهم . وحصل منه خلاف ما أراد به المشركون ، جُعل ما حصل به زائداً في إيمان المسلمين . فالظاهر أنّ الإيمان أطلق هنا على العمل ، أي العزم على النصر والجهاد ، وهو بهذا المعنى يزيد وينقص . ومسألة زيادة الإيمان ونقصه مسألة قديمة ، والخلاف فيها مبنيّ على أنّ الأعمال يطلق عليها اسم الإيمان ، كما قال تعالى : { وما كان اللَّه ليضيع إيمانكم } \\[ البقرة : 143 \\] يعني صَلاتكم . أمّا التَّصديق القلبي وهو عقد القلب على إثبات وجود الله وصفاته وبعثة الرسل وصدق الرسول ، فلا يقبل النقص ، ولا يقبل الزيادة ، ولذلك لا خلاف بين المسلمين في هذا المعنى ، وإنّما هو خلاف مبني على اللفظ ، غير أنّه قد تقرّر في علم الأخلاق أنّ الاعتقاد الجازم إذا تكررت أدلّته ، أو طال زمانه ، أو قارنته التجارب ، يزداد جلاء وانكشافاً ، وهو المعبّر عنه بالمَلَكة ، فلعلّ هذا المعنى ممّا يراد بالزيادة ، بقرينة أنّ القرآن لم يطلق وصف النقص في الإيمان بل ما ذكر إلا الزيادة ، وقد قال إبراهيمُ عليه السلام :{ بلى ولكن ليطمئنّ قلبي } \\[ البقرة : 260 \\]وقولهم : { حسبنا الله ونعم الوكيل } كلمة لعلّهمُ ألهموها أو تلقّوها عن النبي صلى الله عليه وسلم وحسب أي كاف ، وهو اسم جامد بمعنى الوصف ليس له فعل ، قالوا : ومنه اسمه تعالى الحَسيب ، فهو فعيل بمعنى مُفعل . وقيل : الإحساب هو الإكفاء ، وقيل : هو اسم فعل بمعنى كفى ، وهو ظاهر القاموس . وردّه ابن هشام في توضيحه بأنّ دخول العوامل عليه نحو { فإنّ حسبك الله } ، وقولهم : بحسبك درهم ، ينافي دعوى كونه اسم فعل لأنّ أسماء الأفعال لا تدخل عليها العوامل ، وقيل : هو مصدر ، وهو ظاهر كلام سيبويه . وهو من الأسماء اللازمة للإضافة لفظاً دون معنى ، فيبنى على الضمّ مثل : قبلُ وبعدُ ، كقولهم : اعطه درهيمن فَحَسْبُ ، ويتجدّد له معنى حينئذ فيكون بمعنى لا غير . وإضافته لا تفيده تعريفاً لأنّه في قوة المشتقّ ولذلك توصف به النكرة ، وهو ملازم الإفراد والتذكير فلا يثنّى ولا يجمعُ ولا يؤنّث لأنّه لجموده شابَه المصدر ، أو لأنّه لمّا كان اسم فعل فهو كالمصدر ، أو لأنّه مصدر ، ، وهو شأن المصادر ، ومَعناها : إنّهم اكتفوا بالله ناصراً وإن كانوا في قِلّة وضعف .وجملة { ونعم الوكيل } معطوفة على { حسبنا الله } في كلام القائلين ، فالواو من المحكي لا من الحكاية ، وهو من عطف الإنشاء على الخبر الذي لا تطلب فيه إلا المناسبة . والمخصوص بالمدح محذوف لتقدّم دليله .و { الوكيل } فعيل بمعنى مفعول أي موكول إليه . يقال : وكل حاجته إلى فلان إذا اعتمد عليه في قضائها وفوّض إليه تحصيلها ، ويقال للذي لا يستطيع القيام بشؤونه بنفسه : رَجل وَكَل بفتحتين أي كثير الاعتماد على غيره ، فالوكيل هو القائم بشأن من وكّله ، وهذا القيام بشأن الموكِّل يختلف باختلاف الأحوال الموكّل فيها ، وبذلك الاختلاف يختلف معنى الوكيل ، فإن كان القيام في دفع العداء والجور فالوكيل الناصر والمدافع { قل لست عليكم بوكيل } \\[ الأنعام : 66 \\] ، ومنه { فمن يجادل اللَّه عنهم يوم القيامة أمَّن يكون عليهم وكيلاً } \\[ النساء : 109 \\] . ومنه الوكيل في الخصومة ، وإن كان في شؤون الحياة فالوكيل الكافل والكافي منه : { أن لا تتخذوا من دوني وكيلاً } \\[ الإسراء : 2 \\] كما قال : { قد جعلتم الله عليكم كفيلاً } \\[ النحل : 91 \\] ولذلك كان من أسمائه تعالى : الوكيل ، وقولُه : { وقالوا حسبنا الله ونعم الوكيل } ومنه الوكيل على المال ، ولذلك أطلق على هذا المعنى أيضاً اسم الكفيل في قوله تعالى : { وقد جعلتم اللَّه عليكم كفيلاً } .وقد حمل الزمخشري الوكيل على ما يشمل هذا عند قوله تعالى : { وهو على كل شيء وكيل } في سورة \\[ الأنعام : 102 \\] ، فقال : وهو مالك لكلّ شيء من الأرزاق والآجال رقيب على الأعمال . وذلك يدل على أنّ الوكيل اسم جامع للرقيب والحافظ في الأمور التي يُعني الناس بحفظها ورقابتها وادّخارها ، ولذلك يتقيّد ويتعمّم بحسب المقامات .\n\n",
      "translations": [
        {
          "translation": "It was also revealed about them: (Those unto whom men said) said to Nu'aym Ibn Mas'ud al-Ashja'i: (Lo! the people) Abu Sufyan and his men (have gathered against you) at the Lutaymah, the latter being a market near Mecca, (therefore fear them) fear going out to fight them. (But) this only (increased the faith of them) emboldened them even more (and they cried: Allah is sufficient for us!) Allah is sufficient to give victory. (Most Excellent is He in Whom we trust!) our trust is in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ } يعني رَجُلاً واحِداً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Those who say to the people,\" refers to one man.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الذين قال لهم الناس } قبل الوصول إلى المشاهدة { إن الناس قد جمعوا لكم فاخشوهم } أي: اعتبروا لوجودكم واعتدّوا بكم فاعتدوا بهم { فزادهم } ذلك القول { إيماناً } أي: يقيناً وتوحيداً بنفي الغير وعدم المبالاة به\n وتوصلوا بنفي ما سوى الله إلى إثباته بقولهم { حسبنا الله } فشاهدوه ثم رجعوا إلى تفاصيل الصفات بالاستقامة فقالوا: { ونِعْمَ الوكيل } وهي الكلمة التي قالها إبراهيم عليه السلام حين أُلقِيَ في النار فصارت برداً وسلاماً عليه { فانقلبوا بنعمة من الله وفضل } أي: رجعوا بالوجود الحقانيّ في جنة الصفات والذات كما مرّ آنفاً { لم يمسسهم سوء } البقية ورؤية الغير\n  { و } هم { اتّبعوا رضوان الله } الذي هو جنة الصفات في حال سلوكهم حين لم يعلموا ما أُخفي لهم من قرّة أعين وهي جنة الذات المشار إليها بقوله: { والله ذو فضل عظيم } فإن الفضل هو المزيد على الرضوان { يخوف أولياءه } المحجوبين بأنفسهم مثله من الناس أو يخوّفكم أولياءه { فلا تخافوهم } ولا تعتدوا بوجودهم { وخافونِ إن كنتم } موحدين\n أي لا تخافوا غيري لعدم عينه وأثره { ولا يحزنك الذين يسارعون في الكفر } لحجابهم الأصلي وظلمتهم الذاتية خوف أن يضروك { إنهم لن يضرّوا الله شيئاً } إملاء الكفار وطول حياتهم سبب لشدّة عذابهم وغاية هوانهم وصغارهم لازديادهم بطول عمرهم حجاباً على حجاب\n وبعداً على بعد\n وكلما ازدادوا بعداً عن الحق الذي هو منيع العزّة ازدادوا هواناً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ } المخبرون لهم\n ترحماً وتحذيراً: { إِنَّ ٱلنَّاسَ } يعني: أبو سفيان وأصحابه { قَدْ جَمَعُواْ لَكُمْ } ليكروا عليكم ويستأصلوكم { فَٱخْشَوْهُمْ } حتى لا يلحقكم شر العدو ثانياً { فَزَادَهُمْ } قول المخبرين { إِيمَاناً } إطاعة وانقياداً وتسليماً وإحساناً { وَقَالُواْ } في جوابهم من غاية رضاهم ونهاية تفويضهم: { حَسْبُنَا ٱللَّهُ } وكافينا\n يكفينا عنايته لنا في حياتنا ومماتنا { وَنِعْمَ ٱلْوَكِيلُ } [آل عمران: 173] هو لمصالحنا\n نفوض أمورنا كلها إليه\n نعتصم به من سخطه وغضبه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الموصول بدل من الموصول قبله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:9",
      "similarity": 0.42018893822297826
    },
    {
      "verse": "79:19",
      "similarity": 0.4047331641964226
    },
    {
      "verse": "20:3",
      "similarity": 0.40239028492480255
    },
    {
      "verse": "79:45",
      "similarity": 0.39263549004474163
    },
    {
      "verse": "87:10",
      "similarity": 0.3769980395818332
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003173.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003173.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:173.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}