{
  "chapter": "آل عمران",
  "text": "ولا يحزنك الذين يسرعون فى الكفر انهم لن يضروا۟ الله شيـا يريد الله الا يجعل لهم حظا فى الءاخرة ولهم عذاب عظيم",
  "translations": [
    {
      "translation": "And do not be grieved by those who rush into disbelief. They do no harm to God; and God will not give them any share in the life to come, and their torment shall be great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who run towards disbelief grieve you; they shall not hurt Allah in the least. Allah will not provide for them any share in the Next Life. A mighty punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), do not be grieved because of some people's haste to disbelieve. They can do no harm to God. God has decided not to give them any share in the life hereafter. There will be a great torment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) do not grieve for those who rush towards disbelief; they cannot cause any harm to Allah; and Allah does not will to assign them any portion in the Hereafter; and for them is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those grieve you who rush with haste to disbelieve; verily, not the least harm will they do to Allah. It is Allah's will to give them no portion in the Hereafter. For them there is a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those grieve you who fall into unbelief hastily; surely they can do no harm to Allah at all; Allah intends that He should not give them any portion in the hereafter, and they shall have a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them not grieve thee that vie with one another in unbelief; they will nothing hurt God; God desires not to appoint for them a portion in the world to come, and there awaits them a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their conduct grieve thee, who run easily to disbelief, for lo! they injure Allah not at all. It is Allah's Will to assign them no portion in the Hereafter, and theirs will be an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those grieve you who vie with one another in denying the truth: they cannot harm God in the least; it is God's will that they will have no share in the life to come -- a severe punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those grieve thee who hasten toward infidelity; verily they shall not harm Allah at all. Allah desireth not to provide for them a portion in the Hereafter; and theirs shall be a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not grieve for those who are active in unfaith; they will not hurt Allah in the least: Allah desires to give them no share in the Hereafter, and there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those grieve thee who rush headlong into Unbelief: Not the least harm will they do to Allah: Allah's plan is that He will give them no portion in the Hereafter, but a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those grieve you (O Muhammad SAW) who rush with haste to disbelieve; verily, not the least harm will they do to Allah. It is Allah's Will to give them no portion in the Hereafter. For them there is a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let those who race in disbelief sadden you. They will not harm Allah a thing. Allah does not want to give them a share in the Everlasting Life. For them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be saddened by those who rush into disbelief. They will not harm God in the least. God desires to give them no share in the Hereafter. A terrible torment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be grieved, [O Muhammad], by those who hasten into disbelief. Indeed, they will never harm Allah at all. Allah intends that He should give them no share in the Hereafter, and for them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:176] Let them not grieve you (read yuhzinka, or yahzunka from [1st form] hazanahu, ‘he made him grieve’, an alternative expression to [4th form] ahzanahu, ‘he made him grieve’) those that vie with one another in unbelief, succumbing to it promptly by supporting it, namely, the Meccans or the hypocrites: in other words, do not be concerned for their unbelief; they will not hurt God at all, by their actions, only hurting themselves. God desires not to assign them any portion, any lot, in the Hereafter, that is, in Paradise, and that is why God forsook them; and theirs is a mighty chastisement, in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned how the hypocrites hastened to ally themselves with the Jews, saying: (Let not their conduct grieve thee) Muhammad, or sadden you, (who run easily) who hasten (to disbelief) the hastening of the hypocrites to ally themselves with the Jews, (for Lo! they injure Allah not at all) they will not harm Allah by hastening to join the Jews as allies. (It is Allah's will) Allah wants (to assign them) i.e. the Jews and hypocrites (no portion) no share (in the Hereafter) in Paradise, (and theirs will be an awful doom) as awful as can be.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلاَّ يَجْعَلَ لَهُمْ حَظّاً فِي ٱلآخِرَةِ } معناهُ نَصيبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يَحْزُنكَ } ضرر { ٱلَّذِينَ يُسَارِعُونَ } يوقعون أنفسهم { فِي ٱلْكُفْرِ } سريعاً في المنافقين الذين يقولون بأفواههم ما ليس في قلوبهم { إِنَّهُمْ } إذ هم بسبب كفرهم { لَن يَضُرُّواْ ٱللَّهَ شَيْئاً } بل ضرر كفرهم إنما يعود إليهم؛ لا حق بهم { يُرِيدُ ٱللَّهُ } المقد لكفرهم { أَلاَّ يَجْعَلَ لَهُمْ حَظّاً } نصيباً { فِي } النشأة { ٱلآخِرَةِ } لذلك أقدرهم على الكفر { وَ } هيَّأ { لَهُمْ عَذَابٌ عَظِيمٌ } [آل عمران: 176] هو عذاب الطرد والخذلان، والحسرة والحرمان؛ جزاء لكفرهم ونفاقهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: حَزَنَ يحزُن كبلغ يبلُغ، وأحزن يُحْزِن، كأَكْرم يكرم، لغتان، والأولى أفصح\n يقول الحقّ جلّ جلاله: ولا يهولك شأن { الذين يسارعون في الكفر } أي: يبادرون إلى الوقوع فيه، كالمنافقين او الكفار جميعاً، فلا تخف ضررهم { إنهم لن يضروا الله شيئاً } أي: لن يضروا أولياء الله، وإنما يرجع ضررهم إلى انفسهم\n { يريد الله } - بسبب ما أظهر فيهم من المسارعة إلى الكفر - { ألاَّ يجعل لهم حظّاً في } ثواب { الآخرة } لِمَا سبق لهم من الشقاء، حتى يموتوا على الكفر\n وفي ذكر الإرادة إشعار بأن كفرهم بلغ الغاية، حتى أراد أرحم الراحمين ألاَّ يكون لهم حظ من رحمته\n { ولهم } مع ذلك { عذاب عظيم }\n ثم كرّر شأنهم تأكيد فقال: { إن الذين اشتروا الكر بالإيمان } أي: استبدلوا الإيمان الذي ينجيهم من العذاب، لو دخلوا فيه، بالكفر الذي يُوجب العذاب، { لن يضروا الله ولهم عذاب أليم } موجع، أو يكون في الكفار أصالة، وهذا في المرتدين، والله تعالى أعلم\n الإشارة: إنكار العوام على الخصوص لا يضرهم، ولا يغض من مرتبتهم، بل يزيدهم رفعةً وعلواً وعزّاً وقرباً، قال تعالى:\n",
      "translations": []
    }
  ]
}