{
  "chapter": "آل عمران",
  "text": "ولا يحسبن الذين كفروا۟ انما نملى لهم خير لانفسهم انما نملى لهم ليزدادوا۟ اثما ولهم عذاب مهين",
  "translations": [
    {
      "translation": "Those who are kafir should not imagine that the extra time We grant to them is good for them. We only allow them more time so they will increase in evildoing. They will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers must not think that the respite We give them augurs well. We do so that they sink deeper into sin, and suffer an ignominious doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let the, unbelievers imagine that the respite We give them is good for them. We give them respite so that they may grow in wickedness. A humiliating chastisement lies in store for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers must not think that Our respite is for their good. We only give them time to let them increase their sins. For them there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never must the disbelievers be under the illusion that the respite We give them is any good for them; We give them respite only for them to further advance in their sins; and for them is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the disbelievers think that Our postponing their punishment is good for them. We postpone the punishment only so that they may increase in sinfulness. And for them is a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve think that Our granting them respite is better for their souls; We grant them respite only that they may add to their sins; and they shall have a disgraceful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the unbelievers suppose that the indulgence We grant them is better for them; We grant them indulgence only that they may increase in sin; and there awaits them a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve imagine that the rein We give them bodeth good unto their souls. We only give them rein that they may grow in sinfulness. And theirs will be a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who deny the truth think that Our granting them respite is good for them: Our granting them respite will only cause them to increase in disobedience -- shameful punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve deem that We respite them for their good: We respite them only that they may increase in sin; and theirs shall be a torment ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the faithless not suppose that the respite that We grant them is good for their souls: We give them respite only that they may increase in sin, and there is a humiliating punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not the Unbelievers think that our respite to them is good for themselves: We grant them respite that they may grow in their iniquity: But they will have a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the disbelievers think that Our postponing of their punishment is good for them. We postpone the punishment only so that they may increase in sinfulness. And for them is a disgracing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let those who disbelieve think that what We delay is better for them. Indeed, We delay for them only that they will increase in sin, and for them a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve should not assume that We respite them for their own good. In fact, We only respite them so that they may increase in sinfulness. A humiliating torment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve ever think that [because] We extend their time [of enjoyment] it is better for them. We only extend it for them so that they may increase in sin, and for them is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:178]   And let not the disbelievers suppose (read lā yahsabanna, ‘let them not suppose’, or lā tahsabanna, ‘do not suppose’) that what We indulge them in, that is, [that] Our indulging [them], in extending their [terms of] life and deferring them [their death], is better for their souls (in the case of the reading yahsabanna, ‘let them [not] suppose’, anna [of anna-mā] and its two operators stand in place of the two objects, but only in place of the second in the case of the other reading [tahsabanna], ‘do [not] suppose’). We grant them indulgence, We give [them] respite, only that they may increase in sinfulness, through frequent disobedience, and theirs is a humbling chastisement, one of humiliation, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على قوله : { ولا تحسبن الذين قتلوا في سبيل الله أمواتاً } \\[ آل عمران : 169 \\] والمقصود مقابلة الإعلام بخلاف الحسبان في حالتين : إحداهما تلوح للناظر حالة ضرّ ، والأخرى تلوح حالة خير ، فأعلم الله أن كلتا الحالتين على خلاف ما يتراءى للناظرين .ويجوز كونه معطوفا على قوله : { ولا يحزنك الذين يسارعون في الكفر } \\[ آل عمران : 176 \\] إذ نهاه عن أن يكون ذلك موجباً لحزنه ، لأنهم لا يضرّون الله شيئاً ، ثم ألقى إليه خبراً لقصد إبلاغه إلى المشركين وإخوانهم المنافقين : أن لا يحسبوا أن بقاءهم نفع لهم بل هو إملاء لهم يزدادون به آثاماً ، ليكون أخذُهم بعد ذلك أشدّ . وقرأه الجمهور { ولا يَحسبنّ الذين كفروا } بياء الغيبة وفاعلُ الفعل ( الذين كفروا ) ، وقرأه حمزة وحده بتاء الخطاب .فالخطاب إما للرسول عليه السلام وهو نهي عن حسبان لم يقع ، فالنهي للتحذير منه أو عن حسبان هو خاطر خطر للرسول صلى الله عليه وسلم غير أنّه حسبان تعجّب ، لأنّ الرسول يعلم أنّ الإملاء ليس خيراً لهم ، أو المخاطب الرسول والمقصود غيره ، ممّن يظنّ ذلك من المؤمنين على طريقة التعريض مثل { لئن أشركت ليحبطنّ عملك } \\[ الزمر : 65 \\] ، أو المراد من الخطاب كلّ مخاطب يصلح لذلك .وعلى قراءة الياء التحتية فالنهي مقصود به بلوغه إليهم ليعلموا سوء عاقبتهم ، ويُمِرَّ عيشهم بهذا الوعيد ، لأنّ المسلمين لا يحسبون ذلك من قبل والإملاء : الإمهال في الحياة ، والمراد به هنا تأخير حياتهم ، وعدمُ استئصالهم في الحرب ، حيث فرحوا بالنصر يوم أُحُد ، وبأنّ قتلى المسلمين بوم أحُد كانوا أكثر من قتلاهم .ويجوز أن يراد بالإملاء التخلية بينهم وبين أعمالهم في كيد المسلمين وحربهم وعدم الأخذ على أيديهم بالهزيمة والقتل كما كان يوم بدر ، يقال : أملى لفرسه إذا أرخى له الطِّوَل في المرعى ، وهو مأخوذ من الملْو بالواو وهو سيرُ البعير الشديدُ ، ثم قالوا : أمليت للبعير والفرس إذا وسَّعت له في القيد لأنّه يتمكّن بذلك من الخَبَب والركض ، فشُبِّه فعله بشدّة السير ، وقالوا : أمليت لزيد في غيّه أى تركته : على وجه الاستعارة ، وأملى الله لفلان أخّر عقابه ، قال تعالى : { وأملي لهم إن كيدي متين } \\[ الأعراف : 183 \\] واستعير التملّي لطول المدّة تشبيهاً للمعقول بالمحسوس فقالوا : ملأَّك الله حبيبَك تمليئة ، أي أطال عمرك معه .وقوله : { أنما نملي لهم خير لأنفسهم } ( أَنّ ) أخت ( إنّ ) المكسورة الهمزة ، و ( ما ) موصولة وليست الزائدة ، وقد كتبت في المصحف كلمة واحدة كما تكتب إنّما المركبة من ( إن ) أخت ( أنّ ) و ( ما ) الزائدةِ الكافّةِ ، التي هي حرف حصر بمعنى ( مَا ) و ( إلاّ ) ، وكان القياس أن تكتب مفصولة وهو اصطلاح حدث بعد كتابة المصاحف لم يكن مطّرداً في الرسم القديم ، على هذا اجتمعت كلمات المفسّرين من المتقدّمين والمتأخّرين .وأنا أرى أنّه يجوز أن يكون ( أنّما ) من قوله : { أنما نمي خير لأنفسهم } هي أنّما أخت إنّما المكسورة وأنّها مركّبة من ( أنّ ) و ( ما ) الكافّة الزائدة وأنها طريق من طرق القصر عند المحقّقين ، وأنّ المعنى : ولا يحسبنّ الذين كفروا انحصار إمهالنا لهم في أنّه خير لهم لأنّهم لمّا فرحوا بالسلامة من القتل وبالبقاء بقيد الحياة قد أضمروا في أنفسهم اعتقاد أنّ بقاءهم ما هو إلاّ خير لهم لأنّهم يحسبون القتل شرّاً لهم ، إذ لا يؤمنون بجزاء الشهادة في الآخرة لكفرهم بالبعث . فهو قصر حقيقي في ظنّهم .ولهذا يكون رسمهم كلمة ( أنَّما ) المفتوحة الهمزة في المصحف جارياً على ما يقتضيه اصطلاح الرسم . و { أنّما نملي لهم خير لأنفسهم } هو بدل اشتمال من { الذين كفروا } ، فيكون سادّاً مسدّ المفعولين ، لأنّ المبدل منه صار كالمتروك ، وسلكت طريقة الإبدال لما فيه من الإجمال ، ثمّ التفصيل ، لأنّ تعلّق الظنّ بالمفعول الأول يستدعي تشوّف السامع للجهة التي تعلَّق بها الظنّ ، وهي مدلول المفعول الثاني ، فإذا سمع ما يسدّ مسدّ المفعولين بعد ذلك تمكّن من نفسه فضْل تمكّن وزاد تقريراً .وقوله : { إنما نملي لهم ليزدادوا إثماً } استئناف واقع موقع التعليل للنهي عن حسبان الإملاء خيراً ، أي ما هو بخير لأنّهم يزدادون في تلك المدّة إثماً .و ( إنما ) هذه كلمة مركّبة من ( إِنّ ) حرف التوكيد و ( ما ) الزائدة الكافّة وهي أداة حصر أي : ما نملي لهم إلاّ ليزدادوا إثماً ، أي فيكون أخذهم به أشدّ فهو قصر قلب .ومعناه أنّه يملي لهم ويؤخّرهم وهم على كفرهم فيزدادون إثماً في تلك المدّة ، فيشتدّ عقابهم على ذلك ، وبذلك لا يكون الإملاء لهم خيراً لهم ، بل هو شرّ لهم .واللام في { ليزدادوا إثماً } لام العاقبة كما هي في قوله تعالى : { ليكون لهم عدواً وحزناً } \\[ القصص : 8 \\] أي : إنما نملي لهم فيزدادون إثماً ، فلمّا كان ازدياد الإثم ناشئاً عن الإملاء ، كان كالعلّة له ، لا سيما وازدياد الإثم يعلمه الله فهو حين أملَى لهم علم أنّهم يزدادون به إثماً ، فكان الازدياد من الإثم شديد الشبه بالعلّة ، أمّا علّة الإملاء في الحقيقة ونفس الأمر فهي شيء آخر يعلمه الله ، وهو داخل في جملة حكمة خلق أسباب الضلال وأهله والشياطين والأشياء الضارّة . وهي مسألة مفروغ منها في علم الكلام ، وهي ممّا استأثر الله بعلم الحكمة في شأنه . وتعليلُ النهي على حسبان الإملاء لهم خيراً لأنفسهم حاصل ، لأنّ مداره على التلازم بين الإملاء لهم وبين ازديادهم من الإثم في مدّة الإملاء .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned how He gives them respite despite their indulgence in disbelief, saying: (And let not those who disbelieve) the Jews (imagine that the rein We give them) that the respite, progeny and wealth We give them (bodeth good unto their souls. We only give them rein) wealth and progeny (that they may grow in sinfulness) sinfulness in this world, later to be thrown into the dungeons of hell in the Hereafter. (And theirs will be a shameful doom) by means of which they shall be shamed day after day and hour after hour; it is also said that this means: a severe doom; and it is also said that from (Let not their conduct grieve you) to (And theirs will be a shameful doom) was revealed about the idolaters of Mecca on the Day of Uhud.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنَّمَا نُمْلِي لَهُمْ } معناهُ نُطِيلُ لَهُمْ\n\n\n\n\nوقوله تعالى: { عَذَابٌ مُّهِينٌ } معناهُ مُذَلِلٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We will prolong it for them\" - this means that We will prolong their punishment.\n\n\nAnd His saying, {the punishment is humiliating} means that it is degrading.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يَحْسَبَنَّ } المفسر بقراءة: \" ولا تحسبن \" يا أكمل الرسل { ٱلَّذِينَ كَفَرُواْ أَنَّمَا نُمْلِي لَهُمْ } أي: إمهالنا إياهم في النشأة الأولى { خَيْرٌ لأَنْفُسِهِمْ } ولهم فيه نفع وعزة\n بل { إِنَّمَا نُمْلِي لَهُمْ لِيَزْدَادُوۤاْ إِثْمَاً } موجباً للعذاب { وَلَهْمُ } في النشأة الأخرى { عَذَابٌ مُّهِينٌ } [آل عمران: 178] مذل ومخز\n جزاء لاستكبارهم واستعدائهم في الدنيا\n\n\nثم لما اختلط المنافقون مع المؤمنين\n وتشاركوا في إظهار الإيمان\n والقول به على طرفي اللسان بلا اعتقاد منهم وإخلاص\n أراد سبحانه أن يبيِّن ويميِّز المؤمن من المنافق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: من قرأ بالتحتية، فالذين كفروا: فاعل، و { إن } وما بعدها: سد مسد المفعولين، ومن قرأ بالفوقية فالذين: مفعول أول، و { إنما }: سد مسد الثاني، و { ما }: مصدرية، والإملال: الإمهال والتأخير. ومنه:\n[مريم: 46]. يقول الحقّ جلّ جلاله: ولا يظنن الذين كفروا أن إمهالي لهم وإمدادهم بطول الحياة، هو خير لهم، إنما نمهلهم استدراجاً { ليزدادوا } إثماً وعقوبة، { ولهم عذاب مهين } يهينهم، ويخزيهم يوم يُعز المؤمنين. الإشارة: إمهال العبد وإطالة عمره، إن كانت أيامه مصروفةً في الطاعة واليقطةِ، وزيادة المعرفة، فإطالتها خير، والبركة في العمر إنما هي بالتوفيق وزيادة المعرفة، وفي الحكم: \" من بورك له في عمره أدرك في يسير من الزمان ما لا تدركه العبارة ولا تلحقه الإشارة \". وإن كانت أيام العمر مصروفة في الغفلة والبطالة وزيادة المعصية، فالموت خير منها. وقد سُئل - عليه الصلاة والسلام - أيُّ الناس خَيْرٌ؟ قال:\n \" مَنْ طَالَ عُمرُه وَحَسُنَ عَمَلُهُ، قيل: فَأَيُّ النّاسِ شر؟ قال: مَنْ طَالَ عَمُرُهُ وَسَاءَ عَمله \" \nوالله تعالى أعلم. ولمّا قال عليه الصلاة والسلام:\n \" إنَّ اللهَ أطلعني على من يُؤمِنُ بي ممن يكْفُر \" \nقال المنافقون: نحن معه ولا يعرفنا.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:32",
      "similarity": 0.5541217499715131
    },
    {
      "verse": "22:44",
      "similarity": 0.5105915888215027
    },
    {
      "verse": "22:48",
      "similarity": 0.4100147804149689
    },
    {
      "verse": "19:46",
      "similarity": 0.3781048623068197
    },
    {
      "verse": "25:5",
      "similarity": 0.37380998708824575
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003178.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003178.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:178.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}