{
  "chapter": "آل عمران",
  "text": "ان الذين اشتروا۟ الكفر بالايمن لن يضروا۟ الله شيـا ولهم عذاب اليم",
  "translations": [
    {
      "translation": "Those who sell iman for kufr do not harm Allah in any way. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who barter unbelief for faith, will not harm God in the least, and the punishment for them will be painful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have purchased unbelief in exchange for faith shall not hurt Allah in the least. Theirs shall be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have traded faith in exchange for disbelief can never do any harm to God. There will be a painful torment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have purchased disbelief in exchange of faith cannot cause any harm to Allah; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who purchase disbelief at the price of faith, not the least harm will they do to Allah. For them, there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who have bought unbelief at the price of faith shall do no harm at all to Allah, and they shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who buy unbelief at the price of faith, they will nothing hurt God; and there awaits them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who purchase disbelief at the price of faith harm Allah not at all, but theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have bought a denial of truth at the price of faith can in no way harm God; painful punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who have purchased infidelity for belief shall not hurt Allah at all, and theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have bought unfaith for faith will not hurt Allah in the least, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who purchase Unbelief at the price of faith,- not the least harm will they do to Allah, but they will have a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who purchase disbelief at the price of Faith, not the least harm will they do to Allah. For them, there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who buy disbelief with belief will not harm Allah a thing, for them there is a painful punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who exchange blasphemy for faith will not harm God in the least. A painful torment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who purchase disbelief [in exchange] for faith - never will they harm Allah at all, and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:177] Those who purchase unbelief at the price of faith, that is, taking it in place of it, they will not hurt God at all, with their unbelief, and there awaits them a painful chastisement (alīm means mu’lim, ‘painful’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who purchase disbelief at the price of faith) those who preferred disbelief to faith: the hypocrites (harm Allah not at all) they do not harm Allah by choosing disbelief, (but theirs will be a painful doom) whose agony will spread to their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { وَلهُمْ عَذَابٌ أَلِيمٌ } [آل عمران: 177] مؤلم في الدنيا بالقتل والسبي والإجلاء\n وفي الآخرة بالحرمان عن مرتبة الإنسان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:175",
      "similarity": 0.5495239727893547
    },
    {
      "verse": "4:44",
      "similarity": 0.42568884706756766
    },
    {
      "verse": "2:86",
      "similarity": 0.4188589975835062
    },
    {
      "verse": "3:77",
      "similarity": 0.39113054654183754
    },
    {
      "verse": "16:95",
      "similarity": 0.36887098197105606
    }
  ]
}