{
  "chapter": "آل عمران",
  "text": "ولا يحسبن الذين كفروا۟ انما نملى لهم خير لانفسهم انما نملى لهم ليزدادوا۟ اثما ولهم عذاب مهين",
  "translations": [
    {
      "translation": "Those who are kafir should not imagine that the extra time We grant to them is good for them. We only allow them more time so they will increase in evildoing. They will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers must not think that the respite We give them augurs well. We do so that they sink deeper into sin, and suffer an ignominious doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let the, unbelievers imagine that the respite We give them is good for them. We give them respite so that they may grow in wickedness. A humiliating chastisement lies in store for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers must not think that Our respite is for their good. We only give them time to let them increase their sins. For them there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never must the disbelievers be under the illusion that the respite We give them is any good for them; We give them respite only for them to further advance in their sins; and for them is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the disbelievers think that Our postponing their punishment is good for them. We postpone the punishment only so that they may increase in sinfulness. And for them is a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve think that Our granting them respite is better for their souls; We grant them respite only that they may add to their sins; and they shall have a disgraceful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the unbelievers suppose that the indulgence We grant them is better for them; We grant them indulgence only that they may increase in sin; and there awaits them a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve imagine that the rein We give them bodeth good unto their souls. We only give them rein that they may grow in sinfulness. And theirs will be a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who deny the truth think that Our granting them respite is good for them: Our granting them respite will only cause them to increase in disobedience -- shameful punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve deem that We respite them for their good: We respite them only that they may increase in sin; and theirs shall be a torment ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the faithless not suppose that the respite that We grant them is good for their souls: We give them respite only that they may increase in sin, and there is a humiliating punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not the Unbelievers think that our respite to them is good for themselves: We grant them respite that they may grow in their iniquity: But they will have a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the disbelievers think that Our postponing of their punishment is good for them. We postpone the punishment only so that they may increase in sinfulness. And for them is a disgracing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let those who disbelieve think that what We delay is better for them. Indeed, We delay for them only that they will increase in sin, and for them a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve should not assume that We respite them for their own good. In fact, We only respite them so that they may increase in sinfulness. A humiliating torment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who disbelieve ever think that [because] We extend their time [of enjoyment] it is better for them. We only extend it for them so that they may increase in sin, and for them is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:178]   And let not the disbelievers suppose (read lā yahsabanna, ‘let them not suppose’, or lā tahsabanna, ‘do not suppose’) that what We indulge them in, that is, [that] Our indulging [them], in extending their [terms of] life and deferring them [their death], is better for their souls (in the case of the reading yahsabanna, ‘let them [not] suppose’, anna [of anna-mā] and its two operators stand in place of the two objects, but only in place of the second in the case of the other reading [tahsabanna], ‘do [not] suppose’). We grant them indulgence, We give [them] respite, only that they may increase in sinfulness, through frequent disobedience, and theirs is a humbling chastisement, one of humiliation, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned how He gives them respite despite their indulgence in disbelief, saying: (And let not those who disbelieve) the Jews (imagine that the rein We give them) that the respite, progeny and wealth We give them (bodeth good unto their souls. We only give them rein) wealth and progeny (that they may grow in sinfulness) sinfulness in this world, later to be thrown into the dungeons of hell in the Hereafter. (And theirs will be a shameful doom) by means of which they shall be shamed day after day and hour after hour; it is also said that this means: a severe doom; and it is also said that from (Let not their conduct grieve you) to (And theirs will be a shameful doom) was revealed about the idolaters of Mecca on the Day of Uhud.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنَّمَا نُمْلِي لَهُمْ } معناهُ نُطِيلُ لَهُمْ\n\n\n\n\nوقوله تعالى: { عَذَابٌ مُّهِينٌ } معناهُ مُذَلِلٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يَحْسَبَنَّ } المفسر بقراءة: \" ولا تحسبن \" يا أكمل الرسل { ٱلَّذِينَ كَفَرُواْ أَنَّمَا نُمْلِي لَهُمْ } أي: إمهالنا إياهم في النشأة الأولى { خَيْرٌ لأَنْفُسِهِمْ } ولهم فيه نفع وعزة، بل { إِنَّمَا نُمْلِي لَهُمْ لِيَزْدَادُوۤاْ إِثْمَاً } موجباً للعذاب { وَلَهْمُ } في النشأة الأخرى { عَذَابٌ مُّهِينٌ } [آل عمران: 178] مذل ومخز؛ جزاء لاستكبارهم واستعدائهم في الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ بالتحتية، فالذين كفروا: فاعل، و { إن } وما بعدها: سد مسد المفعولين، ومن قرأ بالفوقية فالذين: مفعول أول، و { إنما }: سد مسد الثاني، و { ما }: مصدرية، والإملال: الإمهال والتأخير\n ومنه:\n\n[مريم: 46]\n يقول الحقّ جلّ جلاله: ولا يظنن الذين كفروا أن إمهالي لهم وإمدادهم بطول الحياة، هو خير لهم، إنما نمهلهم استدراجاً { ليزدادوا } إثماً وعقوبة، { ولهم عذاب مهين } يهينهم، ويخزيهم يوم يُعز المؤمنين\n الإشارة: إمهال العبد وإطالة عمره، إن كانت أيامه مصروفةً في الطاعة واليقطةِ، وزيادة المعرفة، فإطالتها خير، والبركة في العمر إنما هي بالتوفيق وزيادة المعرفة، وفي الحكم: \" من بورك له في عمره أدرك في يسير من الزمان ما لا تدركه العبارة ولا تلحقه الإشارة \"\n وإن كانت أيام العمر مصروفة في الغفلة والبطالة وزيادة المعصية، فالموت خير منها\n وقد سُئل - عليه الصلاة والسلام - أيُّ الناس خَيْرٌ؟ قال:\n\n \" مَنْ طَالَ عُمرُه وَحَسُنَ عَمَلُهُ، قيل: فَأَيُّ النّاسِ شر؟ قال: مَنْ طَالَ عَمُرُهُ وَسَاءَ عَمله \" \n\nوالله تعالى أعلم\n ولمّا قال عليه الصلاة والسلام:\n\n \" إنَّ اللهَ أطلعني على من يُؤمِنُ بي ممن يكْفُر \" \n",
      "translations": []
    }
  ]
}