{
  "chapter": "آل عمران",
  "text": "فرحين بما ءاتىهم الله من فضله ويستبشرون بالذين لم يلحقوا۟ بهم من خلفهم الا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "delighting in the favour Allah has bestowed on them, rejoicing over those they left behind who have not yet joined them, feeling no fear and knowing no sorrow,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rejoicing at what God has given them of His grace, and happy for those who are trying to overtake them but have not joined them yet, and who will have no fear or regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "rejoicing in what Allah has bestowed upon them out of His bounty, jubilant that neither fear nor grief shall come upon the believers left behind in the world who have not yet joined them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are pleased with the favor from their Lord and have received the glad news that those who follow them will have no fear nor will they be grieved,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Happy over what Allah has bestowed upon them from His grace, and rejoicing for those who will succeed them, and have not yet joined them; for on them is no fear nor any grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They rejoice in what Allah has bestowed upon them of His bounty and rejoice for the sake of those who have not yet joined them, but are left behind (not yet martyred) that on them no fear shall come, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rejoicing in what Allah has given them out of His grace and they rejoice for the sake of those who, (being left) behind them, have not yet joined them, that they shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "rejoicing in the bounty that God has given them, and joyful in those who remain behind and have not joined them, because no fear shall be on them, neither shall they sorrow,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jubilant (are they) because of that which Allah hath bestowed upon them of His bounty, rejoicing for the sake of those who have not joined them but are left behind: That there shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they are joyful because of what God has bestowed on them of His grace and they rejoice that those they left behind, who have not yet joined them, that they shall have no fear, nor shall they grieve;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exulting in that which Allah hath vouchsafed them of His grace. And they rejoice in those who have not yet joined them from behind them, in the thought that unto them no fear shall come, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "exulting in what Allah has given them out of His grace, and rejoicing for those who have not yet joined them from [those left] behind them, that they will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They rejoice in the bounty provided by Allah: And with regard to those left behind, who have not yet joined them (in their bliss), the (Martyrs) glory in the fact that on them is no fear, nor have they (cause to) grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They rejoice in what Allah has bestowed upon them of His Bounty, rejoicing for the sake of those who have not yet joined them, but are left behind (not yet martyred) that on them no fear shall come, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "rejoicing in the Bounty that Allah has given to them and having glad tidings in those who remain behind and have not joined them, for no fear shall be on them neither shall they sorrow,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Delighting in what God has given them out of His grace, and happy for those who have not yet joined them; that they have nothing to fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them - that there will be no fear concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:170] Rejoicing (farihīna, a circumstantial qualifier referring to the person governing yurzaqūn, ‘sustained’) in what God has given them of His bounty, and, they are, rejoicing, joyful, for the sake of those who have not joined them but are left behind, from among their believing brothers (allādhīna, ‘those who’, may be substituted by [what follows, sc. ‘rejoicing…that no fear’]): that no fear shall befall them, those that have not yet joined them, neither shall they grieve, in the Hereafter, meaning, they rejoice for their [brothers’ future] security and felicity (allā [of allā khawfun] is an-lā, meaning, bi-an lā).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Jubilant (are they) because of that which Allah hath bestowed upon them of His bounty) of His honouring, (rejoicing for the sake of those who have not joined them but are left behind:) rejoicing because their brothers who are still in this world will join them because they have been given the good news that they will (that there shall no fear come upon them) when others are struck with fear (neither shall they grieve) when others grieve.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَرِحِينَ بِمَآ آتَاهُمُ ٱللَّهُ } من موائد المعرفة والإحسان بواسطتهما { مِن فَضْلِهِ } دائماً، خالدين فيها { وَ } مع تلك اللذة والفرح { يَسْتَبْشِرُونَ } يطلبون الباشرة والشفاعة من الله { بِٱلَّذِينَ لَمْ يَلْحَقُواْ بِهِم مِّنْ خَلْفِهِمْ } من إخوانهم الذين بقوا من خلفهم في دار الدنيا التي هي دار الخوف والعناء، محل الخطر الفناء، قابلين لهم منادين، منبيهن أن { أَلاَّ خَوْفٌ عَلَيْهِمْ } لم يحلقوا بنا { وَلاَ هُمْ يَحْزَنُونَ } [آل عمران: 170] لم يخلصوا عن الدنيا ولوازمها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ألاَّ خَوف عليهم }: بدل من { الذين لم يلحقوا } ، أو مفعول لأجله، وكرر: { يستبشرون } ليذكر ما تعلق به من الفضل والنعمة، أو: الأول بحال إخوانهم، وهذا بحال أنفسهم\n يقول الحقّ جلّ جلاله: { ولا تحسبن } أيها الرسول، أو أيها السامع، { الذين قتلوا في سبيل الله أمواتاً بل } هم { أحياء } لأن الله تعالى جعل أرواحهم في حواصل طير خضر، يسرحون في الجنة حيث شاءوا عند ربهم، بالكرامة والزلفى، يُرزقون من ثمار الجنة ونعيمها، فحالهم حال الأحياء في التمتع بأرزاق الجنة، بخلاف سائر الأموات من المؤمنين فإنهم لا يتمتعون بالأرزاق حق يدخلوا الجنة\n قاله ابن جزي\n قلت: شهداء الملكوت - وهم العارفون - أعظم قدراً من شهداء السيوف، وراجع ما تقدم في سورة البقرة\n { فرحين بما آتاهم الله من فضله } من الكرامة والزلفى والنعيم الذي لا يفنى، { ويسبشرون بالذين لم يلحقو بهم من خلفهم } أي: بإخوانهم الذي لم يُقتلوا فيلحقوا بهم من بعدهم\n وتلك البشارة هي: { ألا خوف عليهم ولا هم يحزنون } ، أو من أجل { ألا خوف عليهم ولا هم يحزنون }\n والحاصل: أنهم يستبشرون بما تبين لهم من الكرامة في الآخرة، وبحال من تركوا من خلفهم من المؤمنين، وهو أنهم إذا ماتوا أو قُتلوا، كانوا أحياء، حياة لا يدركها خوفُ وقوعِ محذور، ولا حزن فوات محبوب\n فالآية تدل على أن الإنسان غير الهيكل المحسوس، بل هو جوهر مُدرِك بذاته، لا ينفى بخراب البدن، ولا يتوقف على وجود البدن إدراكه وتألمُه والتذاذه\n ويؤيد ذلك قوله تعالى في آل فرعون:\n\n[غَافِر: 46]، وما رَوى ابنُ عباس من أنه صلى الله عليه وسلم قال:\n\n \" أرْواحُ الشهداء في أجْوافِ طَيْرِ خَضْرٍ، تَرِدُ أنْهارَ الجنّةِ، وتَأكُلُ منْ ثِمارِها، وتَأوِي إلى قَنَادِيلَ مُعلَّقةٍ في ظلِّ العَرشِ \" \n\n- قال معناه البيضاوي",
      "translations": []
    }
  ]
}