{
  "chapter": "آل عمران",
  "text": "لا تحسبن الذين يفرحون بما اتوا۟ ويحبون ان يحمدوا۟ بما لم يفعلوا۟ فلا تحسبنهم بمفازة من العذاب ولهم عذاب اليم",
  "translations": [
    {
      "translation": "Those who exult in what they have done and love to be praised for what they have not done should not suppose that they have escaped the punishment. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not that those who exult at what they have done, and who love to be praised for what they have not done, shall escape the punishment, for grievous indeed will be their doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think that those who exult in their misdeeds and love to be praised for what indeed they have not done, do not think that they are secure from chastisement. A painful chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think that those who are happy with their possessions and positions and those who love to be praised for what they themselves have not done can ever be saved from torment. For them there will be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not ever think of those who rejoice for their deeds and wish to be praised without doing (good deeds) – do not ever think that they are safe from the punishment; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not that those who rejoice in what they have done (or brought about), and love to be praised for what they have not done, think not that they are rescued from the torment, and for them is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think those who rejoice for what they have done and love that they should be praised for what they have not done-- so do by no means think them to be safe from the chastisement, and they shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reckon not that those who rejoice in what they have brought, and love to be praised for what they have not done -- do not reckon them secure from chastisement; for them awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not that those who exult in what they have given, and love to be praised for what they have not done - Think not, they are in safety from the doom. A painful doom is theirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who exult in their misdeeds and love to be praised for what they have not done should not suppose that they are secure from punishment; they shall suffer a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink not thou that those who exult in that which they have brought and love to De praised for that which they have not done, - bethink not thou that they shall be in security from the torment! And theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not suppose those who brag about what they have done, and love to be praised for what they have not done—do not suppose them saved from punishment and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not that those who exult in what they have brought about, and love to be praised for what they have not done,- think escape the penalty. For them is a penalty Grievous indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not that those who rejoice in what they have done (or brought about), and love to be praised for what they have not done,- think not you that they are rescued from the torment, and for them is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think that those who rejoice in what they have brought and love to be praised for what they have not done do not think they will be secure from the punishment. And for them there is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think that those who rejoice in what they have done, and love to be praised for what they have not done—do not think they can evade the punishment. They will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never think that those who rejoice in what they have perpetrated and like to be praised for what they did not do - never think them [to be] in safety from the punishment, and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:188] Do not reckon that (lā tahsabanna, or read lā yahsabanna, ‘let them not reckon’) those who rejoice in what they have brought, that is, [in what] they have done by leading people astray, and who love to be praised for what they have not done, in the way of adherence to the truth, being [themselves] misguided — do not reckon them (fa-lā tahsabannahum, is for emphasis [in the case of both readings above]) secure, in a place where they can escape, from the chastisement, in the Hereafter; but instead they shall be in a place of wherein they shall be tortured, and that is Hell; there shall be a painful chastisement for them, in it (alīm   means mu’lim, ‘painful’). (If one reads yahsabanna, ‘let them [not] reckon’, the two direct objects of the first h-s-b verb would be indicated by the two direct objects of the second h-s-b verb; but if one reads tahsabanna, ‘do [not] reckon’, then only second direct object would be omitted).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned their longing for praise and credit for that which they-the Jews-did not have, saying: (Think not) suppose not, Muhammad (that those who exult in what they have given) whereby they changed the traits and description of Muhammad in their Scripture, (and love to be praised for what they have not done) they like that people say they have good in them when they do not. They like that people say that they are follower of the Religion of Abraham and that they are good to the poor. (Think not) Muhammad, (they are in safety from the doom. A painful doom is theirs) a severe torment shall be theirs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِمَفَازَةٍ مِّنَ ٱلْعَذَابِ } معناه بِمَنْجَاةٍ مِنْهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in avoidance of a severe punishment}, means in escape from it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا تحسبنّ الذين يفرحون بما أتوا } أي: يعجبوا بما فعلوا من طاعة وإيثار\n وكلّ حسنة من الحسنات\n ويحجبون برؤيته { ويحبون أن يحمدوا } أي: يحمدهم الناس\n فهم محجوبون بعرض الحمد والثناء من الناس\n أو أن يكونوا محمودين في نفس الأمر عند الله { بما لم يفعلوا } بل فعله الله على أيديهم إذ لا فعل إلا لله\n\n[الصافات\n الآية: 96] فائزين من عذاب الحرمان { ولهم عذاب أليم } لمكان استعدادهم واحتجابهم عما فيه\n وكان من حقهم أن ينسبوا الفضيلة والفعل الجميل إلى الله ويتبرّأوا عن حولهم وقوّتهم إليه ولا يحتجبوا برؤية الفعل من أنفسهم\n ولا يتوقعوا به المدح والثناء\n { ولله مِلْك السموات والأرض } ليس لأحد فيها شيء حتى يعطي غيره فيعجب بعطائه { والله على كلّ شيء قدير } لا يقدر غيره على فعل مّا\n حتى يعجب برؤيته\n فيفرح به فرح إعجاب\n { الذين يذكرون الله } في جميع الأحوال وعلى جميع الهيئات { قياماً } في مقام الروح بالمشاهدة { وقعوداً } في محلّ القلب بالمكاشفة { وعلى جنوبهم } أي: تقلباتهم في مكان النفس بالمجاهدة { ويتفكرون } بألبابهم أي: عقولهم الخالصة عن شوب الوهم { في خلق } عالم الأرواح والأجساد\n يقولون عند الشهود { ربنا ما خلقت هذا } الخلق { باطلاً } أي: شيئاً غيرك\n فإنّ غير الحق هو الباطل\n بل جعلته أسماءك ومظاهر صفاتك { سبحانك } ننزهك أن يوجد غيرك\n أي: يقارن شيء فردانيتك أو يثني وحدانيتك { فقنا عذاب } نار الاحتجاب بالأكوان عن أفعالك\n وبالأفعال عن صفاتك\n وبالصفات عن ذاتك وقاية مطلقة تامة كافية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لاَ تَحْسَبَنَّ } أيها الكامل في أمر الرسالة المنافقين { ٱلَّذِينَ يَفْرَحُونَ بِمَآ أَتَوْاْ } من الخداع والنفاق مع المؤمنين وإظهار الإيمان على طرف اللسان { وَّيُحِبُّونَ أَن يُحْمَدُواْ } عند إخوانهم { بِمَا لَمْ يَفْعَلُواْ } من الإخلاص مع أهل الإيمان\n وهم وإن أخلصوا عن أيدي المؤمنين\n ظاهرٌ انخداعهم ونفاقهم { فَلاَ تَحْسَبَنَّهُمْ بِمَفَازَةٍ } منجاة ومخلص { مِّنَ ٱلْعَذَابِ } المعدّ له في يوم الجزاء\n بل { وَلَهُمْ } فيها { عَذَابٌ أَلِيمٌ } [آل عمران: 188] مؤلم عن رؤيتهم المؤمنين\n المخلصين في النعيم الدائم واللذة المستمرة\n\n\n{ وَ } إن اغتروا بإمهال الله إياهم في النشأة الدنيا\n لا يمهلون في الآخرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ بالخطاب\n فالذين: مفعول أول\n والثاني: محذوف\n أي: بمفازة من العذاب\n أو هو المذكور\n و { تحسبنهم }: تأكيد للفعل الأول\n ومن قرأ بالغيب\n فالذين: فاعل\n والمفعولان: محذوفان\n دلَّ عليهما ذكرُهما مع الثاني\n أي: لا يحسبوا أنفسهم فائزة\n { فلا تحسبنهم }: من قرأ بفتح التاء فالخطاب للرسول - عليه الصلاة والسلام-\n والفعل مبني\n ومن قرأ بالياء فالخطاب للذين يفرحون\n والفعل معرب\n أي: لا يحسبن أنفسهم بمفازة من العذاب\n يقول الحقّ جلّ جلاله: { لا تحسبن } يا محمد { الذين يفرحون بما أتَوا } أي: بما فعلوا من التدليس وكتمان الحق\n { ويُحبون أن يُحمدوا بما لم يفعلوا } من الوفاء بالعهد\n وإظهار الحق\n والإخبار بالصدق\n أنهم فائزون من العذاب\n فلا تظنهم { بمفازة من العذاب } \n بل { لهم عذاب أليم } موجع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:58",
      "similarity": 0.4109188131088651
    },
    {
      "verse": "9:50",
      "similarity": 0.36689865890288687
    },
    {
      "verse": "78:31",
      "similarity": 0.36525094169916
    },
    {
      "verse": "37:60",
      "similarity": 0.3534415636033255
    },
    {
      "verse": "23:111",
      "similarity": 0.3501670844327192
    }
  ]
}