{
  "chapter": "آل عمران",
  "text": "فان كذبوك فقد كذب رسل من قبلك جاءو بالبينت والزبر والكتب المنير",
  "translations": [
    {
      "translation": "If they deny you, Messengers before you were also denied, who brought the Clear Signs and written texts and the illuminating Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they call you a liar (remember) so had other apostles been called before you, who had come with clear signs and Scriptures and the Book enlightening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, if they give the lie to you, then other Messengers who came bearing clear signs and scriptures and the illuminating Book were also given the lie before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they reject you, they had certainly rejected the Messengers who lived before you and who showed them authoritative evidence, smaller Books, and the Book of enlightenment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O dear Prophet (Mohammed – peace and blessings be upon him) if they are denying you, Noble Messengers who came before you had also been denied, who had come with clear signs and Scriptures and the clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they reject you, so were Messengers rejected before you, who came with Al-Bayinat and the Scriptures and the Book of Enlightenment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they reject you, so indeed were rejected before you apostles who came with clear arguments and scriptures and the illuminating book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they cry lies to thee, lies were cried to Messengers before thee, who came bearing clear signs, and the Psalms, and the Book Illuminating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny thee, even so did they deny messengers who were before thee, who came with miracles and with the Psalms and with the Scripture giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they deny you, so have other messengers been denied before you, who came with clear signs, scriptures and enlightening book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they belie thee, even so were belied apostles before thee who came with evidences and scriptures, and the luminous Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they deny you, [other] apostles have been denied before you, who came with manifest signs, holy writs, and an illuminating scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they reject thee, so were rejected messengers before thee, who came with Clear Signs, Books of dark prophecies, and the Book of Enlightenment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they reject you (O Muhammad SAW), so were Messengers rejected before you, who came with Al-Baiyinat (clear signs, proofs, evidences) and the Scripture and the Book of Enlightenment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you (Prophet Muhammad), indeed other Messengers before you were belied who came with clear proofs, and the Psalms, and the Illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they accuse you of lying, messengers before you were accused of lying. They came with the proofs, and the Psalms, and the Illuminating Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they deny you, [O Muhammad] - so were messengers denied before you, who brought clear proofs and written ordinances and the enlightening Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:184] But if they deny you, so were denied messengers before you who came bearing clear proofs, miracles, and the Scriptures, such as the scrolls of Abraham, and the Illuminating, the lucid, Book, that is, the Torah and the Gospel (a variant reading establishes the [prefixed preposition] bā’ in both [words, sc. bi’l-zubur wa-bi’lkitāb l-munīr, ‘with the Scriptures and with the Illuminating Book’]), so be patient as they were.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they replied that their fathers never killed any prophet wrongfully, Allah said: (And if they deny thee) Muhammad regarding what you say to them, do not be saddened, (even so did they deny messengers who were before you) their people denied them, (who came with miracles) with commands and prohibitions and signs of prophethood (and with the Psalms) and with the news relating to the Scriptures of past nations (and with the Scripture giving light) showing the lawful and the prohibited. 78\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن كَذَّبُوكَ } وأنكروا عليك يا أكمل الرسل فلا تبال بتكذيبهم وإنكارهم { فَقَدْ كُذِّبَ رُسُلٌ مِّن قَبْلِكَ } ذو معجزات كثيرة\n وآيات عظام { جَآءُوا } على من أرسل إليهم { بِٱلْبَيِّنَاتِ } الواضحة { وَٱلزُّبُرِ } أي: الصحف المثبتة فيها الأحكام فقط { وَٱلْكِتَابِ } المبين فيه الأحكام والمواعظ والرموز والإرشادات { ٱلْمُنِيرِ } [آل عمران: 184] على كل من استنار منه واسترشد\n ومع ذلك ينكرونهم\n فمضوا هم ومنكروهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { الزبر }: جمع زبور، بمعنى مزبور، أي: مكتوب، من زبرت، أي: كتبت، وكل كتاب فهو زبور، وقال امرؤ القيس:\nيقول الحقّ جلّ جلاله: في تسلية رسوله - عليه الصلاة والسلام - من تكذيب اليهود وغيرهم له: { فإن كذبوك } فليس ذلك ببدع { فقد كُذبت رسل } مثلك { من قبلك } جاءوا قومهم بالمعجزات البينات، وبالكتب المنزلات، فيها مواعظ زاجرات، { وبالكتاب المنير } المشتمل على الأحكام الشرعيات. الإشارة: كما كُذبت الأنبياء كُذبت الأولياء، بعد أن ظهر عليها من العلوم الباهرة والحكم الظاهرة والكرامات الواضحة، وأعظمها المعرفة، وهذه سنة ماضية، ولن تجد سنة الله تبديلاً.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:25",
      "similarity": 0.9966910664616726
    },
    {
      "verse": "26:196",
      "similarity": 0.8265378588295565
    },
    {
      "verse": "54:52",
      "similarity": 0.8018008015983579
    },
    {
      "verse": "21:105",
      "similarity": 0.722635532829672
    },
    {
      "verse": "54:43",
      "similarity": 0.6822890507287199
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:184.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:184.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:184.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}