{
  "chapter": "آل عمران",
  "text": "لقد سمع الله قول الذين قالوا۟ ان الله فقير ونحن اغنياء سنكتب ما قالوا۟ وقتلهم الانۢبياء بغير حق ونقول ذوقوا۟ عذاب الحريق",
  "translations": [
    {
      "translation": "Allah has heard the words of those who say, 'Allah is poor and we are rich.' We will write down what they said and their killing of the Prophets without any right to do so and We will say, Taste the punishment of the Burning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has indeed heard the words of those who said: \"God is a pauper whereas we are rich.\" We shall make a note of their words, and the murders of the prophets they committed unjustly, and say to them: \"Now taste the agony of burning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has heard the saying of those who said: 'Allah is poor, and we are rich. We shall record what they have said, and the fact of their slaying the Prophets unjustly, and we shall say to them: Taste now the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God certainly has heard the words of those who said, \"God is poor and we are wealthy\". We shall write down what they have said and their murder of the Prophets without reason and We shall tell them to suffer the burning torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Allah heard them who said, “Allah is needy, and we are the wealthy”; We shall keep recorded their saying and their wrongfully martyring of the Prophets; and We shall say, “Taste the punishment of the fire!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah has heard the statement of those who say: \"Truly, Allah is poor and we are rich!\" We shall record what they have said and their killing of the Prophets unjustly, and We shall say: \"Taste you the torment of the burning (Fire).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly heard the saying of those who said: Surely Allah is poor and we are rich. I will record what they say, and their killing the prophets unjustly, and I will say: Taste the chastisement of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has heard the saying of those who said, 'Surely God is poor, and we are rich.' We shall write down what they have said, and their slaying the Prophets without right, and We shall say, 'Taste the chastisement of the burning --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah heard the saying of those who said, (when asked for contributions to the war): \"Allah, forsooth, is poor, and we are rich!\" We shall record their saying with their slaying of the prophets wrongfully and We shall say: Taste ye the punishment of burning!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has indeed heard the words of those who said, \"Behold, God is poor while we are rich!\" We shall record what they have said, and their slaying of the prophets unjustly, and We shall say, \"Taste the torment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly Allah hath heard the saying of those who say: verily Allah is poor and we are rich. Surely We shall write down that which they have said and their slaying of the prophets with- out justice, and We shall say taste the torment of the burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly heard the remark of those who said, ‘Allah is poor and we are rich.’ We will record what they have said, and their killing of the prophets unjustly, and We shall say, ‘Taste the punishment of the burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath heard the taunt of those who say: \"Truly, Allah is indigent and we are rich!\"- We shall certainly record their word and (their act) of slaying the prophets in defiance of right, and We shall say: \"Taste ye the penalty of the Scorching Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah has heard the statement of those (Jews) who say: \"Truly, Allah is poor and we are rich!\" We shall record what they have said and their killing of the Prophets unjustly, and We shall say: \"Taste you the torment of the burning (Fire).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has heard the saying of those who said: 'Allah is poor, but we are rich' We will write down what they have said, and their slaying of the Prophets without right. And We shall say: 'Taste the punishment of the burning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has heard the statement of those who said, “God is poor, and we are rich.” We will write down what they said, and their wrongful killing of the prophets; and We will say, “Taste the torment of the burning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly heard the statement of those [Jews] who said, \"Indeed, Allah is poor, while we are rich.\" We will record what they said and their killing of the prophets without right and will say, \"Taste the punishment of the Burning Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:181] Verily God has heard the saying of those, namely the Jews, who said, ‘Indeed God is poor, and we are rich’: they said this when the verse, who is he that will lend God a good loan [Q. 2:245] was revealed, adding that, ‘If God were [truly] rich, He would not be asking us for loans’. We shall write down, We shall order that it be written, what they have said, in the scrolls containing their deeds so that they will be requited for it (a variant reading [for active naktubu, ‘We shall write’] has the passive yuktabu, ‘it shall be written’) and, We shall write down, their slaying (read accusative qatlahum or nominative qatluhum) the prophets without right, and We shall say (naqūlu, also read yaqūlu, meaning God [shall say]) to them by the tongue of the angels in the Hereafter, ‘Taste the chastisement of the Burning, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the Jews, Finhas Ibn 'Azura' and his friends when they said: \"0 Muhammad! Allah is poor: He is asking us to give Him a loan\", saying (Verily Allah heard the saying of those) Finhas Ibn 'Azura' and his fellows (who said, (when asked for contributions to the war): \"Allah, forsooth, is poor) He needs us to give Him a loan, (and we are rich!\") and we do not need a loan from Him. (We shall record their saying) We shall preserve for them what they have said in the Hereafter (with their slaying of the Prophets) just as We shall record for them their slaying of the prophets (wrongfully) without them having committed any crime (and We shall say: Taste ye the punishment of burning!) which is very severe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَنَكْتُبُ مَا قَالُواْ } معناهُ سَنَحفِظُ\n\n\n\n\nوقوله تعالى: { عَذَابَ ٱلْحَرِيقِ } يَريدُ النَّارَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكما أخبر سبحانه عن علمه بقول اليهود وبقوله: { لَّقَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّذِينَ قَالُوۤاْ } استهزاءً وسخريةً حين نزل:\n\n[الحديد: 11] { إِنَّ ٱللَّهَ فَقِيرٌ } استقرض منا { وَنَحْنُ أَغْنِيَآءُ } وبعدما سمعنا منهم { سَنَكْتُبُ مَا قَالُواْ } اي: قولهم هذا { وَقَتْلَهُمُ ٱلأَنبِيَاءَ بِغَيْرِ حَقٍّ } فيما مضى في صحائف أعمالهم، في نظم واحد، ونجازي عليهم يوم الجزاء { وَنَقُولُ } لهم وقت جزائهم: { ذُوقُواْ } أيها المفرطون، المسيئون للأدب مع الله ورسوله { عَذَابَ ٱلْحَرِيقِ } [آل عمران: 181] المحرق غاية الإحراق، بحيث يذوق إحراقه أجسامكم وجميع قواكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وقتلهم }: معطوف على { ما } المفعولة أو النائبة عن الفاعل، على القرائتين رفعاً ونصباً، و { أن الله }: عطف على { ما } أي: ذلك العذاب بسبب ما قدمتم وبأن الله منتفٍ عنه الظلم، فلا بد أن يعاقب المسيء ويثيب المحسن، { الذين قالوا إن الله عهد إلينا }: صفة للذين { قالوا إن الله فقير } ، أو بدل منه مجرور مثله\n يقول الحقّ جلّ جلاله: { لقد سمع الله قول } اليهود { الذين قالوا إن الله فقير ونحن إغنياء } وقائله: فِنْحَاصُ بن عَازُرواء، في جماعة منهم، وذلك أن النبيّ صلى الله عليه وسلم كتب مع أبي بكر إلى يهود بن قينقاع، يدعوهم إلى الإسلام، وإلى إقامة الصلاة وإيتاء الزكاة، وأن يقرضوا الله قرضاً حسناً، فدخل أبو بكر رضي الله عنه مِدْرَاسَهُم، فوجد خلقاً كثيراً اجتمعوا إلى فنحاص، وهو من علمائهم - ومعه حبر آخر اسمه: أيشع، فقال أبو بكر لفنحاص: اتق الله وأسلم، فوالله إنك لتعلم أن محمداً رسول الله، قد جاءكم بالحق من عند الله، اتق الله وأسلم، فوالله إنك لتعلم أن محمداً رسول الله، قد جاءكم بالحق من عند الله، فأسلِمْ وصَدِّق، وأقْرِض الله قرضاً حسناً يدخلك الجنة، فقال فنحاص لعنه الله: يا أبا بكر تزعم ان ربنا يستقرضنا أموالنا، وما يستقرض إلا الفقير من الغني، ولو كان غنيّاً ما استقرض، فلطمه أبو بكر رضي الله عنه وقال: لولا ما بيننا من العهد لضربت عنقك، فشكاه إلى رسول الله صلى الله عليه وسلم فقال له: عليه الصلاة والسلام:-\n\n \" ما حملك على ما فعلت؟ \" \n\nفقال: يا رسول الله، إن عدو الله قال قولاً قولاً عظيماً، زعم أن الله فقير، وهم أغنياء، فجَحَد ما قال، فنزلت الآية تكذبياً له\n والمعنى: أن الله سمع مقالتهم الشنيعة، وأنه سيعاقبهم عليها، ولذلك قال: { سنكتب ما قالوا } أي: سنسطرها عليهم في صحائف أعمالهم، أو سنحفظها في علمنا ولا نهملها، لأنها كلمة عظيمة، فيها الكفر بالله والاستهزاء بكتاب الله وتكذيب لرسول الله صلى الله عليه وسلم، ولذلك نظمت مع قتلهم الأنبياء، حيث عطفه عليه، وفيه تنبيه على أن قولهم الشينع ليس هو أول جريمة ارتكبوها، وأن من اجترأ على قتل الأنبياء لم يستبعد أمثال هذا القول منه\n ثم ذكر عقابهم، فقال: { ونقول } لهم يوم القيامة: { ذوقوا عذاب الحريق } أي: المُحْرِق، والذوق: يطلق على إدراك المحسوسات كالمطعومات، والمعنويات كما هنا، وذكره هنا لأن عذابهم مرتب على قولهم الناشئ عن البخل، والتهالك على المال، وغالب حاجة الإنسان إليه، لتحصيل المطاعم، ومعظم بخله للخوف من فقده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:68",
      "similarity": 0.5687757163954665
    },
    {
      "verse": "29:24",
      "similarity": 0.5453451904161224
    },
    {
      "verse": "8:50",
      "similarity": 0.5390680709580995
    },
    {
      "verse": "85:10",
      "similarity": 0.5333918704931876
    },
    {
      "verse": "22:22",
      "similarity": 0.48979065196485194
    }
  ]
}