{
  "chapter": "آل عمران",
  "text": "شهد الله انه لا اله الا هو والملئكة واو۟لوا۟ العلم قائمۢا بالقسط لا اله الا هو العزيز الحكيم",
  "translations": [
    {
      "translation": "The steadfast, the truthful, the obedient, the givers, and those who seek forgiveness before dawn.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is witness there is no god but He, and so are the angels and men full of learning. He is the upholder of justice. There is no god but He, the mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah Himself bears witness that there is no God but He; and likewise do the angels and the men possessed of knowledge bear witness in truth and justice that there is no God but He, the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God Himself testifies that He is the only Lord. The angels and the men of knowledge and justice testify that God is the only Lord, the Majestic, and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has given witness that there is none worthy of worship (God) except Him – and the angels and the scholars also give witness, established with justice (with truth) – there is no God except Him, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that none has the right to be worshipped but He, and the angels, and those having knowledge (also bear witness to this); (He always) maintains His creation in justice. None has the right to be worshipped but He, the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that there is no god but He, and (so do) the angels and those possessed of knowledge, maintaining His creation with justice; there is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God bears witness that there is no god but He -- and the angels, and men possessed of knowledge -- upholding justice; there is no god but He, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah (Himself) is Witness that there is no Allah save Him. And the angels and the men of learning (too are witness). Maintaining His creation in justice, there is no Allah save Him the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God bears witness that there is no deity save Him, as do the angels and those who possess knowledge. He is the upholder of justice. There is no diety save Him, the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah beareth witness - and also the angles and those endued with knowledge that there is no god but He, the Maintainer of equity: there is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, maintainer of justice, the Almighty and the All-wise, besides whom there is no god, bears witness that there is no god except Him, and [so do] the angels and those who possess knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He: That is the witness of Allah, His angels, and those endued with knowledge, standing firm on justice. There is no god but He, the Exalted in Power, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He is always) maintaining His creation in Justice. La ilah illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that there is no god except He, and so do the angels and the knowledgeable. He upholds justice there is no god except He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God bears witness that there is no god but He, as do the angels, and those endowed with knowledge—upholding justice. There is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah witnesses that there is no deity except Him, and [so do] the angels and those of knowledge - [that He is] maintaining [creation] in justice. There is no deity except Him, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:18] God bears witness, [that is to say] He has made it clear to His creation through proofs and signs, that there is no god, none that is truly worshipped in existence, except Him, He has borne witness to this, and the angels, [have also borne witness to this] by affirming it, and those of knowledge, from among the prophets and the believers, through [their] conviction and in words; upholding, constantly and uniquely maintaining His creations with justice, (qā’iman, ‘upholding’, is in the accusative because it is a circumstantial qualifier and is governed by the import of the statement [implied to be something like] tafarrada, ‘He alone is [upholding]…’); there is no god except Him (He has repeated it for emphasis); the Mighty, in His Kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah declared then His divine Oneness, saying: (Allah (Himself) is witness) even if no one else bears witness (that there is no God save Him. And the angels) do also bear witness to that (and the men of learning) and the prophets and the believers bear witness to that. (Maintaining His creation in justice, there is no God save Him, the Almighty) in His vengeance against those who do not believe in Him, (the Wise) and He has commanded that none shall be worshipped except Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { شَهِدَ ٱللَّهُ } معناه بيَّنَ الله\n\n",
      "translations": [
        {
          "translation": " And His saying, {Allāhu} is evidence of Allāh.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فلم يبق مغرباً بقوله { شهد الله أنّه لا إله إلاّ هو } طلع الوجه الباقي\n فشهد بذاته في مقام الجمع على وحدانيته\n إذ لم يبق شاهد ولا مشهود غيره\n ثم رجع إلى مقام التفصيل فشهد بنفسه مع غيره على وحدانيته في ذلك المشهد فقال: { والملائكة وأولو العلم قائماً بالقِسْط } أي: مقيماً للعدل في تفاصيل مظاهره\n وصور كثرتها الذي هو ظلّ الوحدة في غير الجمع بإعطاء كلّ ذي حقّ بحسب استعداده واستحقاقه حقّه من جوده وكماله وتجليه فيه على قدر سعة وعائه { لا إله إلا هو } في المشهدين { العزيز } القاهر الذي يقهر كل شيء باعتبار الجمع فلا يصل إليه أحد { الحكيم } الذي يدبر بحكمته كل شيء\n فيعطيه ما يليق به باعتبار التفصيل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهو { أَنَّهُ لاَ إِلَـٰهَ } أي: لا موجود ولا وجود ولا كون ولا تحقق ولا كائن ولا ثابت { إِلاَّ هُوَ } الحي الحقيق بالحقية\n الوحيد بالقيومية\n الفريد بالديمومية\n لا شيء سواه { وَ } بما شهد بوحدته { ٱلْمَلاَئِكَةُ } أي: الأسماء والصفات القائمة بالذات الأحدية\n إذ الكل قائم به ثابت له لا مرجع لها سواه { وَ } بما شهد به { أُوْلُواْ ٱلْعِلْمِ } من مظاهر المخلوقات على صورته المتأثرة من أوصافه وأسمائه\n وإن كانت شهادة كل منها راجعة إلى شهادته\n لكون الكل { قَآئِمَاً } مقوماً متحققاً { بِٱلْقِسْطِ } أي: العدل الإلهي المنبسط على ظواهر الكائنات أزلاً وأبداً\n إذ { لاَ إِلَـٰهَ } أي: لا مظهر لها { إِلاَّ هُوَ ٱلْعَزِيزُ } الغالب القادر على إظهارها { ٱلْحَكِيمُ } [آل عمران: 18] المتقن في تربيتها وتدبيرها\n القائلين طوعاً ورغبة بعدما تحققوا بمقام العبودية:",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قائماً }: حال مِن { الله } \n وإنما جاز من بعض المعطوفات لعدم اللبس\n كقوله:\n[الأنبيَاء: 72]\n ولا يجوز: جاء زيد وعمر راكباً لعدم القرينة\n أو مِن { هو } \n والعامل الجملة لأنه حال مؤكدة\n أي: تفرد قائماً\n أو حقه قائماً\n { بالقسط } أي: العدل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:47",
      "similarity": 0.527676821539478
    },
    {
      "verse": "55:9",
      "similarity": 0.48685225884817784
    },
    {
      "verse": "3:21",
      "similarity": 0.4723749192794654
    },
    {
      "verse": "60:8",
      "similarity": 0.38137770959285533
    },
    {
      "verse": "64:18",
      "similarity": 0.3706826403372337
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}