{
  "chapter": "آل عمران",
  "text": "واذ اخذ الله ميثق الذين اوتوا۟ الكتب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم واشتروا۟ به ثمنا قليلا فبئس ما يشترون",
  "translations": [
    {
      "translation": "Allah made a covenant with those given the Book: 'You must make it clear to people and not conceal it.' But they toss it in disdain behind their backs and sell it for a paltry price. What an evil sale they make!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when God took a promise from the people of the Book to make its (truth) known to mankind, and not keep back any part of it, they set aside (the pledge), and sold it away for a little gain but how wretched the bargain that they made!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when Allah took a covenant from those who were given the Book: 'You shall explain it to men and not hide it. Then they cast the Book behind their backs, and sold it away for a trivial gain. Evil indeed is their bargain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God made a covenant with the People of the Book saying, \"Tell the people about it (Muhammad's prophesy) without hiding any part, therefrom, they threw it behind their backs and sold it for a very small price. What a miserable bargain!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when Allah took a covenant from the People given the Book(s) that, “You shall definitely preach it to the people and not hide it”; so they flung it behind their backs and gained an abject price for it; so what a wretched bargain it is!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when Allah took a covenant from those who were given the Scripture (Jews and Christians) to make it (the truth) known and clear to mankind, and not to hide it, but they threw it away behind their backs, and purchased with it some miserable gain! And indeed worst is that which they bought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah made a covenant with those who were given the Book: You shall certainly make it known to men and you shall not hide it; but they cast it behind their backs and took a small price for it; so evil is that which they buy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when God took compact with those who had been given the Book: 'You shall make it clear unto the people, and not conceal it.' But they rejected it behind their backs and sold it for a small price -- how evil was that their selling!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah laid a charge on those who had received the Scripture (He said): Ye are to expound it to mankind and not to hide it. But they flung it behind their backs and bought thereby a little gain. Verily evil is that which they have gained thereby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made a covenant with those who were given the Book to make it known to people and not conceal it. But they cast it behind their backs and bartered it for a paltry price: what an evil bargain they made!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Allah took a bond from those who were vouchsafed the Book: ye shall surely expound it to the people and ye shall hide it not; whereafter they cast it behind their backs, and bartered it for a small price. Vile is that wherewith they have bartered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah made a covenant with those who were given the Book: ‘You shall explain it for the people, and you shall not conceal it,’ they cast it behind their backs and sold it for a paltry gain. How evil is what they buy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Allah took a covenant from the People of the Book, to make it known and clear to mankind, and not to hide it; but they threw it away behind their backs, and purchased with it some miserable gain! And vile was the bargain they made!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when Allah took a covenant from those who were given the Scripture (Jews and Christians) to make it (the news of the coming of Prophet Muhammad SAW and the religious knowledge) known and clear to mankind, and not to hide it, but they threw it away behind their backs, and purchased with it some miserable gain! And indeed worst is that which they bought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah took a covenant with those to whom the Book was given, (saying): 'You shall make it clear to the people, and not conceal it. 'But they threw it behind their backs and they bought with it a little price. Evil was what they bought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God received a pledge from those who were given the Scripture: “You shall proclaim it to the people, and not conceal it.” But they disregarded it behind their backs, and exchanged it for a small price. What a miserable exchange they made.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when Allah took a covenant from those who were given the Scripture, [saying], \"You must make it clear to the people and not conceal it.\" But they threw it away behind their backs and exchanged it for a small price. And wretched is that which they purchased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:187] And, mention, when God made covenant with those who had been given the Scripture, that is, the pledge [taken] from them in the Torah, ‘You shall expound it (read tubayyinunnahu, or yubayyinunnahu, ‘they shall expound it’) the Book, to people, and not conceal it’ (read taktumūnahu, ‘you shall not conceal it’, or yaktumūnahu, ‘they shall not conceal it’). But they rejected it, they discarded the covenant, behind their backs, and so they did not act in accordance with it, and bought with it, they took in its place, a small price, of this world from the debased among them, enjoying supremacy over them in knowledge, and they concealed it, lest it [the supremacy] escape them; how evil is what they have bought, [how evil is] this purchase of theirs!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned His covenant with the people of the Book in the Scripture, which required them to exposit the traits and description of His Prophet, saying: (And (remember) when Allah laid a charge on those who had received the Scripture) i.e. the Torah and the Gospel ((He said): Ye are to expound it) the trait and description of Muhammad (to mankind and not to hide it) not to hide these traits and description of Muhammad in their Scripture. (But they flung it behind their backs) and did not act upon it (and bought thereby a little gain) a paltry acquisition in their means of living by hiding the traits and description of Muhammad in their Scripture. (Verily evil is that which they have gained thereby) evil is that which they have chosen for themselves: Judaism and the concealment of the traits and description of Muhammad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومتبعيك من أهل الكتاب وقت { إِذْ أَخَذَ ٱللَّهُ } المرسل للرسل\n المنزل للكتب { مِيثَاقَ } أي: العهد الوثيق { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ } أي: أحبار اليهود والنصارى { لَتُبَيِّنُنَّهُ } أي: الكتاب صريحاً واضحاً\n بلا تبديل ولا تغيير { لِلنَّاسِ وَلاَ تَكْتُمُونَهُ } شيئاً مما فيه من القصص والعبر والرموز والإشارات\n وخصوصاً من أوصاف النبي صلى الله عليه وسلم { فَنَبَذُوهُ } بعدما عهدوه { وَرَآءَ ظُهُورِهِمْ } وإن كان المعهود عند أولي العزائم الصحيحة أن يكون نصب عيونهم { وَٱشْتَرَوْاْ بِهِ } أي: اختاروا بدله { ثَمَناً قَلِيلاً } من الرشى من مترفيهم ومستكبريهم\n حفظاً لجاههم ورئاستهم { فَبِئْسَ مَا يَشْتَرُونَ } [آل عمران: 187] تلك الرشى بدل مما يكتمونه من أوصاف سيدنا محمد صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الضمير في { نبذوه }: يعود على الكتاب، أو الميثاق. يقول الحقّ جلّ جلاله: { و } اذكر { إذ أخذ الله ميثاق الذين أوتوا الكتاب } وهم اليهود، أخذ عليهم العهد ليبينن للناس ما في كتابهم من صفة النبيّ صلى الله عليه وسلم ولا يكتمونه، فنبذوا ذلك العهد أو الكتاب { وراء ظهورهم } فكتموا صفته - عليه الصلاة والسلام - خوفاً من زوال رئاستهم، { واشتروا } بذلك العهد، أي: استبدلوا به { ثمناً قليلاً } من حطام الدنيا، وما كانوا يأخذونه من سفلتهم، { فبئس ما يشترون } ، وهي تجر ذيلها على من كتم علماً سئل عنه، قال عليه الصلاة والسلام:\n \" مَنْ كَتَمَ عِلْماً عَنْ أَهْله ألجِمَ بلِجَامٍ مِنْ نَارٍ \" \nوعن عليّ رضي الله عنه: ما أخذ الله على أهل الجهل أن يتعلموا حتى أخذ على أهل العلم أن يُعلِّموا. وقال محمد بن كعب: لا يحل للعالم أن يسكت على علمه، ولا الجاهل أن يسكت على جهله. الإشارة: أهل العلم إذا تحققوا بوجود الخصوصية عند ولي، وكتموا ذلك حسداً وخوفاً على زوال رئاستهم، دخلوا في وعيد الآية لأنَّ العوام تابعون لهم، فإذا كتموا أو أنكروا تبعُوهم على ذلك، فيحملون أثقالهم وأثقالاً مع أثقالهم، والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:174",
      "similarity": 0.511795314295024
    },
    {
      "verse": "2:101",
      "similarity": 0.47840676809912125
    },
    {
      "verse": "16:95",
      "similarity": 0.42988645352966237
    },
    {
      "verse": "2:79",
      "similarity": 0.4237898828037151
    },
    {
      "verse": "9:9",
      "similarity": 0.4236492886928441
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:187.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:187.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:187.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}