{
  "chapter": "آل عمران",
  "text": "ولا يحسبن الذين يبخلون بما ءاتىهم الله من فضله هو خيرا لهم بل هو شر لهم سيطوقون ما بخلوا۟ به يوم القيمة ولله ميرث السموت والارض والله بما تعملون خبير",
  "translations": [
    {
      "translation": "Those who are tight-fisted with the bounty Allah has given them should not suppose that that is better for them. No indeed, it is worse for them! What they were tight-fisted with will be hung around their necks on the Day of Rising. Allah is the inheritor of the heavens and the earth and Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who are niggardly of things that God has given them of His largesse think that this is good for them. In fact, it is worse; for what they grudged will be hung around their necks on the Day of Resurrection. To God belong the heavens and the earth, and God is aware of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are niggardly about what Allah has granted them out of His bounty think that niggardli ness is good for them; it is bad for them. What they were niggardly about will turn into a halter round their necks on the Day of Resur-rection. To Allah belongs the inheritance of the heavens and the earth; and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are avaricious of the favors that God has given them should not think that this is good for them. Avarice is evil and whatever they are avaricious about will be tied to their necks on the Day of Judgment. To God belongs the heritage of the heavens and the earth. God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never must those who act miserly upon what Allah has bestowed upon them of His grace, think that it is good for them; in fact it is harmful for them; soon what they had withheld will be collars round their necks on the Day of Resurrection; and Allah only is the Inheritor (Owner) of the heavens and the earth; and Allah is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who are stingy with that which Allah has bestowed on them of His bounty think that it is good for them. Nay, it will be worse for them; the things that they were stingy with shall be tied to their necks like a collar on the Day of Resurrection. And Allah's is the inheritance of the heavens and the earth; and Allah is Well-Acquainted with all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those deem, who are niggardly in giving away that which Allah has granted them out of His grace, that it is good for them; nay, it is worse for them; they shall have that whereof they were niggardly made to cleave to their necks on the resurrection day; and Allah's is the heritage of the heavens and the earth; and Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who are niggardly with the bounty God has given them, let them not suppose it is better for them; nay, it is worse for them; that they were niggardly with they shall have hung about their necks on the Resurrection Day; and to God belongs the inheritance of the heavens and earth; and God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who hoard up that which Allah hath bestowed upon them of His bounty think that it is better for them. Nay, it is worse for them. That which they hoard will be their collar on the Day of Resurrection. Allah's is the heritage of the heavens and the earth, and Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who are niggardly with what God has granted them out of His bounty think that it is good for them. Indeed, it is evil for them. What they are niggardly about shall be hung about their necks like a collar on the Day of Resurrection. It is God who will inherit the heavens and the earth: God is aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who stint with that which Allah hath vouchsafed them in His grace deem that this is good for them: nay! it is bad for them; anon shall that wherewith they stint be hung round their necks on the Day of Judgement. And Allah's is the heritage of the heavens and the earth; and Allah is of that which ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the stingy not suppose that [their grudging] what Allah has given them out of His bounty is good for them; no, it is bad for them. They will be collared with what they grudge on the Day of Resurrection. To Allah belongs the heritage of the heavens and the earth, and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who covetously withhold of the gifts which Allah Hath given them of His Grace, think that it is good for them: Nay, it will be the worse for them: soon shall the things which they covetously withheld be tied to their necks Like a twisted collar, on the Day of Judgment. To Allah belongs the heritage of the heavens and the earth; and Allah is well-acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who covetously withhold of that which Allah has bestowed on them of His Bounty (Wealth) think that it is good for them (and so they do not pay the obligatory Zakat). Nay, it will be worse for them; the things which they covetously withheld shall be tied to their necks like a collar on the Day of Resurrection. And to Allah belongs the heritage of the heavens and the earth; and Allah is Well-Acquainted with all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not let those who are greedy with what Allah has given them of His Bounty think it is better for them, but rather, it is worse for them. They will be coiled in that which they were greedy on the Day of Resurrection. And to Allah belongs the inheritance of the heavens and the earth. And Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who withhold what God has given them of his bounty should not assume that is good for them. In fact, it is bad for them. They will be encircled by their hoardings on the Day of Resurrection. To God belongs the inheritance of the heavens and the earth, and God is well acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who [greedily] withhold what Allah has given them of His bounty ever think that it is better for them. Rather, it is worse for them. Their necks will be encircled by what they withheld on the Day of Resurrection. And to Allah belongs the heritage of the heavens and the earth. And Allah, with what you do, is [fully] Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:180] Let them not suppose (read lā yahsabanna, ‘let them not suppose’, or lā tahsabanna, ‘do not suppose’) those who are niggardly with what God has given them of His bounty, that is, with His obligatory almsgiving, that it, their niggardliness, is better for them (khayrun lahum, is the second direct object; the pronoun [huwa, ‘[that] it is’] is used to separate [the two statements]; the first [direct object] is bukhlahum ‘their niggardliness’ implicit before the relative clause [alladhīna] in the case of the reading tahsabanna [sc. wa-lā tahsabanna bukhlahum, ‘do not suppose their niggardliness…’], or before the pronoun [huwa, ‘it is’] in the case of the reading yahsabanna [sc. wa-lā yahsabanna lladhīna…bukhlahum huwa khayran lahum, ‘let them not suppose, those who…that their niggardliness is better for them’]); nay, it is worse for them; what they were niggardly with, namely, the obligatory almsgiving of their wealth, they shall have hung around their necks on the Day of Resurrection, when he will have a snake around his neck biting viciously at him, as reported in a hadīth; and to God belongs the inheritance of the heavens and the earth, inheriting them after the annihilation of their inhabitants. And God is aware of what you do (ta‘malūna, also read ya‘malūna, ‘they do’), and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the miserliness of the Jews and hypocrites in relation to that which Allah hath given them, saying: (And let not those who hoard up that which Allah hath bestowed upon them of His bounty) in terms of wealth (think that it is better for them. Nay, it is worse for them. That which they hoard) of wealth, i.e. gold and silver (will be their collar on the Day of Resurrection) will be used as a collar of fire around their necks. (Allah's is the heritage of the heavens and the earth) the stores of the heavens and earth, i.e. rain and vegetation, are Allah's; it is also said that this means: the dwellers of the heavens and earth will die and dominion shall be for Allah, the One, the Conqueror, (and Allah is Informed of what ye do) of acts of generosity or miserliness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الأمور التي يجب الاتقاء والتحرز عنه: البخل { لاَ يَحْسَبَنَّ } البخلاء { ٱلَّذِينَ يَبْخَلُونَ بِمَآ آتَاهُمُ ٱللَّهُ مِن فَضْلِهِ } اختيارهم تدخيراً أو توريثاً لأولادهم { هُوَ } أي: البخل { خَيْراً لَّهُمْ } ينفعهم عند الله\n ويثيبهم به أو يدفع عنهم العذاب بسببه { بَلْ هُوَ شَرٌّ لَّهُمْ } يستجلب العذاب عليهم\n إذ هم { سَيُطَوَّقُونَ } ويسلسلون مع { مَا بَخِلُواْ بِهِ يَوْمَ ٱلْقِيَامَةِ } ويسحبون على وجوههم إلى نار البعد والحرمان\n جزاء لبخلهم الذي كانوا عليها\n\n\n{ وَ } اعلموا أيها المؤمنون { للَّهِ } لا لغيره\n إذ لا غير { مِيرَاثُ } أي: حيازة وإحاطة ما في { ٱلسَّمَٰوَٰتِ } أي: عالم الأرواح { وَ } ما في { ٱلأَرْضِ } أي: علام الأجسام تملكاً وتصرفاً\n لا ينازعه في ملكه\n ولا يشارك في سلطانه\n له الحكم\n وإليه الرجوع في جميع ما كان ويكون { وَٱللَّهُ } المتوحد\n المتفرد في ملكوته وجبروته { بِمَا تَعْمَلُونَ } من التصرفات الجارية { خَبِيرٌ } [آل عمران: 180] لا يغيب عن شيء من أفعالكم وأقوالكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: من قرأ بالخطاب فالموصول مفعول أول، و { خيراً }: مفعول ثان، والضمير للفصل، والخطاب للرسول صلى الله عليه وسلم، ولا بد من حذف مضاف، أي: لا تحسبن بُخلَ الذين يبخلون خيراً لهم، ومن قرأ بالغيب فـ { الذين }: فاعل، والمفعول الأول محذوف، لدلالة { يبخلون } عليه، لا يحسبن البخلاء خيراً لهم، والطوق: ما يدار بالعنق. يقول الحقّ جلّ جلاله: ولا يظنن { الذين يبخلون بما آتاهم الله من فضله } من الأموال، فلم يؤدوا زكاتهم، أن بخلهم خير لهم، { بل هو شر لهم } لاستجلابه العذاب إليهم، ثم بيَّنه بقوله: { سيطوقون ما بخلوا به } أي: يلزمون وبال ما بخلوا به إلزام الطوق للعنق، وقيل: يطوق به حقيقة، لقوله عليه الصلاة والسلام:\n \" ما من رَجُل لا يؤدي زكاة ماله إلا إذا كان يوم القيامة - مُثِّلَ له شُجَاعاً أقْرع، له زَبِيبتَان، يطوِّقُه، ثم يأخُذُ بِلْهزِمتيه - أي: شدقيه - يقول: أنا كنْزكَ، أنا مَالُكَ، ثم تلا هذه الآية: { ولا يحسبن... } \" \nوقيل: يجعل يوم القيامة في أعناقهم طوقاً من نار. والمال الذي بخل به هو لله، وسيرجع لله، { ولله ميراث السماوات والأرض } فهو الذي يرث الأرض ومن عليها، فكيف يبخل العبد بمال الله، وهو يعلم أنه يرجع لله، فيموت ويتركه لمن يسعد به! ولله درّ القائل، حيث قال:\n{ والله بما تعملون خبير } لا يخفى عليه منعكم ولا إعطاؤكم، فيجازي كُلاً بعمله. الإشارة: لا يحسبن الذي يبخلون بما أتاهم الله من فضل الرئاسة والجاه، أن يبذلوها في طلب معرفة الله، وبذلها: إسقاطها وإبدالها بالخمول، والذل لله، وإسقاط المنزلة بين عباد الله، فلا يظنون أن بخلهم بذلك خير لهم، بل هو شرٌّ لهم، سيلزمون وبال ما بخلوا به يوم القيامة، حين يرون منازل المقربين كالشمس الضاحية في أعلى عليين، وهم مع عوام أهل اليمين، محجوبون عن شهود رب العالمين، إلا في وقت مخصوص وحين.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:184",
      "similarity": 0.4407360345338693
    },
    {
      "verse": "9:76",
      "similarity": 0.4330686877817821
    },
    {
      "verse": "92:8",
      "similarity": 0.3991311703707004
    },
    {
      "verse": "57:24",
      "similarity": 0.39880184863719825
    },
    {
      "verse": "4:37",
      "similarity": 0.3685552320191923
    }
  ]
}