{
  "chapter": "آل عمران",
  "text": "لتبلون فى امولكم وانفسكم ولتسمعن من الذين اوتوا۟ الكتب من قبلكم ومن الذين اشركوا۟ اذى كثيرا وان تصبروا۟ وتتقوا۟ فان ذلك من عزم الامور",
  "translations": [
    {
      "translation": "You will be tested in your wealth and in yourselves and you will hear many abusive words from those given the Book before you and from those who are idolaters. But if you are steadfast and have taqwa, that is the most resolute course to take.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will, nonetheless, be tried with your wealth and life, and will hear many untoward things from the followers of former Books and the infidels. But if you endure with patience and follow the straight path, it will surely (accord) with God's fixed resolve about human affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Believers!) You will certainly be put to test in respect of your properties and lives, and you will certainly hear many hurtful things from those who were granted the Book before you and those who have associated others with Allah in His divinity. If you remain patient and God-fearing this indeed is a matter of great resolution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You (believers) will certainly be tested by the loss of your property and lives and you will hear a great many grieving words from the People of the Book and the pagans. If you will have patience and piety, it will be a sign of firm determination and steadfastness (in life).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will surely be tried in respect of your property and lives, and you will surely hear much wrong from those who were given the Book before you, and from the polytheists; and if you remain steadfast and remain pious, it is then an act of great courage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall certainly be tried and tested in your wealth and properties and in yourselves, and you shall certainly hear much that will grieve you from those who received the Scripture before you (Jews and Christians) and from those who ascribe partners to Allah; but if you persevere patiently, and have Taqwa, then verily, that will be a determining factor in all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall certainly be tried respecting your wealth and your souls, and you shall certainly hear from those who have been given the Book before you and from those who are polytheists much annoying talk; and if you are patient and guard (against evil), surely this is one of the affairs (which should be) determined upon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall surely be tried in your possessions and your selves, and you shall hear from those who were given the Book before you, and from those who are idolaters, much hurt; but if you are patient and godfearing -- surely that is true constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly ye will be tried in your property and in your persons, and ye will hear much wrong from those who were given the Scripture before you, and from the idolaters. But if ye persevere and ward off (evil), then that is of the steadfast heart of things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will surely be tried and tested in your possessions and your persons, and you shall surely hear many hurtful things from those who were given the Book before you and from those who set up partners with God, but if you endure with fortitude and restrain yourselves, that indeed is a matter of strong determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye shall surely be proven in your riches and in your lives; and will surely bear much hurt from those who were vouchsafed the Book before you and from those who associate gods, and if ye endure and fear, then verily that is of the commandments determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will surely be tested in your possessions and your souls, and you will surely hear much affront from those who were given the Book before you and from the polytheists; but if you are patient and Godwary, that is indeed the steadiest of courses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye shall certainly be tried and tested in your possessions and in your personal selves; and ye shall certainly Hear much that will grieve you, from those who received the Book before you and from those who worship many gods. But if ye persevere patiently, and guard against evil,-then that will be a determining factor in all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall certainly be tried and tested in your wealth and properties and in your personal selves, and you shall certainly hear much that will grieve you from those who received the Scripture before you (Jews and Christians) and from those who ascribe partners to Allah, but if you persevere patiently, and become Al-Muttaqun (the pious - see V. 2:2) then verily, that will be a determining factor in all affairs, and that is from the great matters, [which you must hold on with all your efforts].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall be tried in your wealth and yourselves, and you shall hear much hurt from those who were given the Book before you, and from those who are idolaters. But if you are patient and cautious, surely, that is of the firm affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will be tested through your possessions and your persons; and you will hear from those who received the Scripture before you, and from the idol worshipers, much abuse. But if you persevere and lead a righteous life—that indeed is a mark of great determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will surely be tested in your possessions and in yourselves. And you will surely hear from those who were given the Scripture before you and from those who associate others with Allah much abuse. But if you are patient and fear Allah - indeed, that is of the matters [worthy] of determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:186] You shall surely be tried (la-tublawunna, the [final] nūn nominative indicator has been omitted because two nūn letters [would otherwise] succeed one another, as has been the plural person indicator wāw where two unvocalised consonants have come together), in other words, you shall surely be tested, in your property, through the duties [imposed] thereupon and through the damages that affect them; and in your selves, through [the obligations of] worship and through calamities, and you shall hear from those who were given the Scripture before you, the Jews and the Christians, and from those who are idolaters, from among the Arabs, much hurt, in the way of insult, slander and [their] flirting with your women; but if you are patient, through this, and fear, God — surely that is true resolve, that is, it is one of those things regarding which one must necessarily have firm resolve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف لإيقاظ المؤمنين إلى ما يعترض أهل الحقّ وأنصار الرسل من البلوى ، وتنبيه لهم على أنّهم إن كانوا ممّن توهنهم الهزيمة فليسوا أحرياء بنصر الحقّ ، وأكّد الفعل بلام القسم وبنون التوكيد الشديدة لإفادة تحقيق الابتلاء ، إذ نون التوكيد الشديدة أقوى في الدلالة على التوكيد من الخفيفة .فأصل { لتبلونّ } لتبلووننّ فلمّا توالى ثلاث نونات ثقل في النطق فحذفت نون الرفع فالتقى ساكنان : واو الرفع ونون التوكيد الشديدة ، فحذفت واو الرفع لأنّها ليست أصلاً في الكلمة فصار لتبْلَوُنّ . وكذلك القول في تصريف قوله تعالى : { ولتسمعنّ } وفي توكيده .والابتلاء : الاختبار ، ويراد به هنا لازمه وهو المصيبة ، لأنّ في المصائب اختباراً لمقدار الثبات . والابتلاء في الأموال هو نفقات الجهاد ، وتلاشي أموالهم التي تركوها بمكّة . والابتلاء في الأنفس هو القتل والجراح . وجمع مع ذلك سماع المكروه من أهل الكتاب والمشركين في يوم أُحُد وبعده .والأذى هو الضرّ بالقول كقوله تعالى : { لن يضروكم إلا أذى } \\[ آل عمران : 111 \\] كما تقدّم آنفاً ، ولذلك وصفه هنا بالكثير ، أي الخارج عن الحدّ الذي تحتمله النفوس غالباً ، وكلّ ذلك ممّا يفضي إلى الفشل ، فأمَرَهم الله بالصبر على ذلك حتّى يحصل لهم النصر ، وأمرهم بالتقوى أي الدوام على أمور الإيمان والإقبال على بثّه وتأييده ، فأمّا الصبر على الابتلاء في الأموال والأنفس فيشمل الجهاد ، وأمّا الصبر على الأذى ففي وقتى الحرب والسلم ، فليست الآية مقتضية عدم الإذن بالقتال من حيث إنه أمرهم بالصبر على أذى الكفّار حتّى تكون منسوخة بآيات السيف ، لأنّ الظاهر أنّ الآية نزلت بعد وقعة أُحُد ، وهي بعد الأمر بالقتال . قاله القفّال .وقوله : { فإن ذلك } الإشارة إلى ما تقدّم من الصبر والتقوى بتأويل : فإنّ المذكور .و ( عزم الأمور ) من إضافة الصفة إلى الموصوف أي الأمور العَزم ، ووصفَ الأمور وهو جمع بعزم وهو مفرد لأنّ أصل عزم أنه مصدر فيلزم لفظه حالة واحدة ، وهو هنا مصدر بمعنى المفعول ، أي من الأمور المعزوم عليها . والعزم إمضاء الرأي وعدم التردّد بعد تبيين السداد . قال تعالى : { وشاورهم في الأمر فإذا عزمت فتوكل على الله } \\[ آل عمران : 159 \\] والمراد هنا العزم في الخيرات ، قال تعالى : { فاصبر كما صبر أولو العزم من الرسل } \\[ الأحقاف : 35 \\] وقال : { ولم نجد له عزما } \\[ طه : 115 \\] .ووقع قوله : { فإن ذلك من عزم الأمور } دليلاً على جواب الشرط ، والتقدير : وإن تصبروا وتتّقوا تنالوا ثواب أهل العزم فإنّ ذلك من عزم الأمور .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned the harm that the unbelievers inflicted on the Prophet and his Companions, saying: (Assuredly ye will be tried) you will be tested (in your property) by the loss of your property (and in your persons) and in what befalls your persons of sicknesses, pain, killings, beatings and general misfortunes, (and ye will hear much wrong from those who were given the Scripture before you) i.e. the Jews and Christians: you will hear vilification, defamation, lies and false testimony against Allah, (and from the idolaters) i.e. the Arab idolaters. (But if ye persevere) in the face of their harm (and ward off (evil)) and ward off transgressing against Allah while facing such harm, (then that) steadfastness and endurance (is of the steadfast heart of things) is the best of things and the most firm for believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالله أيها المؤمنون { لَتُبْلَوُنَّ } ولتختبرن { فِيۤ } إتلاف { أَمْوَالِكُمْ } التي هي من حطام الدنيا { وَ } إماتة { أَنْفُسِكُمْ } وأولادكم التي هي الهالكة\n المستهلكة في ذواتها { وَلَتَسْمَعُنَّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ مِن قَبْلِكُمْ } من اليهود والنصارى { وَمِنَ ٱلَّذِينَ أَشْرَكُوۤاْ } ممن لا كتاب لهم و لانبي { أَذًى كَثِيراً } يؤذيكم سماعها\n كل ذلك لتوطنوا أنفسكم على التوحيد\n وتتمكنوا في مقام الرضا والتسليم وتستقروا في مقام العبودية\n متمكنين\n مطمئنين بلا تزلزل وتلوين { وَإِن تَصْبِرُواْ } أيها الموحدون بأمثالها { وَتَتَّقُواْ } عن الإضرار بها { فَإِنَّ ذٰلِكَ } الصبر والتقوى { مِنْ عَزْمِ ٱلأُمُورِ } [آل عمران: 186] أي: الأمور التي هي من عزائم أرباب التوحيد\n فعليكم أن تلازموها وتواظبوا عليها\n إن كنتم راسخين فيه\n\n\nثبتنا بلطفك على نهج الاستقامة\n وأعذنا من موجبات الندامة يوم القيامة\n\n\n{ وَ } اذكر يا أكمل الرسل لمن يؤذيك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: أصل { تبلونَّ }: تُبلوون كتُنصرون، ثم قلبت الواو ألفاً، ثم حذفت لالتقاء الساكنين، فصار تبلْونن، ثم أكد بالنون، فاجتمع ثلاث نونات، حذفت نون الرفع فالتقى ساكنان الواو ونون التوكيد، فحركت الواو بالضمة المجانسة، وهي النائب عن الفاعل. يقول الحقّ جلّ جلاله: والله { لتبلون } أي: لتختبرن { في أموالكم } بما يصيبها من الآفات، وما كُلفتم به من النفقات، { وأنفسكم } بالقتل والجراحات، والأسر والأمراض وسائر العاهات. { ولتسمعُن من الذين أتوا الكتاب من قبلكم } اليهود { ومن الذين أشركوا } ، كفار مكة، { أذى كثيراً } كقولهم: إن الله فقير، وهجاء الرسول - عليه الصلاة والسلام -، والطعن في الدين، وإغراء الكفرة على المسلمين، أو غير ذلك من الأذى، أعْلَمهم بذلك قبل وقوعه، ليتأهبوا للصبر والاحتمال، حتى لا يروعَهم نزولها حين الإنزال. { وتتقوا } الله فيما أمركم به، { فإن ذلك من عزم الأمور } أي: من معزومات الأمور التي يجب العزم عليها، أو مما عزم الله على فعلها، وأوْجَبه على عباده. والله تعالى أعلم. الإشارة: كل من دخل في طريق الخصوص بالصدق والعزم على الوصول، لا بد أن يُبتلى ويختبر في ماله ونفسه، ليظهر صدقه في طلبه، ولا بد أن يسمع من الناس أذى كثيراً، فإن صبر ظفر، وإن رجع خسر، وهذه سنة الله في عباده:\n[محَمَّد: 31]، قال الورتجبي: { لتبلون في أموالكم } بجمعها ومنها والتقصير في حقوق الله فيها، { وأنفسكم } باتباع شهواتها، وترك رياضتها، وملازمتها أسباب الدنيا، وخلوها من النظر في أمر الميعاد، وقيل: { لتبلون في أموالكم } بالاشتغال بها أخذاً وإعطاء.هـ.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:43",
      "similarity": 0.6564251971349195
    },
    {
      "verse": "2:227",
      "similarity": 0.5553887589710219
    },
    {
      "verse": "47:21",
      "similarity": 0.5527363801071399
    },
    {
      "verse": "31:17",
      "similarity": 0.522420624667209
    },
    {
      "verse": "20:115",
      "similarity": 0.47640470568311005
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003186.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003186.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:186.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}