{
  "chapter": "آل عمران",
  "text": "فاستجاب لهم ربهم انى لا اضيع عمل عمل منكم من ذكر او انثى بعضكم منۢ بعض فالذين هاجروا۟ واخرجوا۟ من ديرهم واوذوا۟ فى سبيلى وقتلوا۟ وقتلوا۟ لاكفرن عنهم سيـاتهم ولادخلنهم جنت تجرى من تحتها الانهر ثوابا من عند الله والله عنده حسن الثواب",
  "translations": [
    {
      "translation": "Their Lord responds to them: 'I will not let the deeds of any doer among you go to waste, male or female - you are both the same in that respect. Those who made hijra and were driven from their homes and suffered harm in My Way and fought and were killed, I will erase their bad actions from them and admit them into Gardens with rivers flowing under them, as a reward from Allah. The best of all rewards is with Allah.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord heard their prayer and answered: \"I suffer not the good deeds of any to go waste, be he a man or a woman: The one of you is of the other. And those who were deprived of their homes or banished in My cause, and who fought and were killed, I shall blot out their sins and admit them indeed into gardens with rippling streams.\" -- A recompense from God, and the best of rewards is with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Lord answered the Prayer thus: \"I will not suffer the work of any of you, whether male or female, to go to waste; each of you is from the other. Those who emigrated and were driven out from their homesteads and were persecuted in My cause, and who fought and were slain, indeed I shall wipe out their evil deeds from them and shall certainly admit them to the gardens beneath which rivers flow.\" This is their reward with their Lord; and with Allah lies the best reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Lord answered their prayers saying, \"I do not neglect anyone's labor whether the laborer be male or female. You are all related to one another. Those who migrated from Mecca, those who were expelled from their homes, those who were tortured for My cause, and those who fought and were killed for My cause will find their sins expiated by Me and I will admit them into the gardens wherein streams flow. It will be their reward from God Who grants the best rewards.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So their Lord accepted their prayer, for I do not waste the efforts of any (righteous) worker, male or female; you are all one among yourselves; so those who migrated and were driven out from their homes and were harassed in My cause, and fought, and were slain – I will certainly wipe out all their sins and will certainly admit them into Gardens beneath which rivers flow; a reward from Allah; and only with Allah is the best reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So their Lord accepted of them (their supplication and answered them), \"Never will I allow to be lost the work of any of you, be he male or female. You are (members) one of another, so those who emigrated and were driven out from their homes, and suffered harm in My cause, and who fought and were killed (in My cause), verily, I will expiate from them their evil deeds and admit them into Gardens under which rivers flow (in Paradise); a reward from Allah, and with Allah is the best of rewards.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So their Lord accepted their prayer: That I will not waste the work of a worker among you, whether male or female, the one of you being from the other; they, therefore, who fled and were turned out of their homes and persecuted in My way and who fought and were slain, I will most certainly cover their evil deeds, and I will most certainly make them enter gardens beneath which rivers flow; a reward from Allah, and with Allah is yet better reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Lord answers them: 'I waste not the labour of any that labours among you, be you male or female -- the one of you is as the other. And those who emigrated, and were expelled from their habitations, those who suffered hurt in My way, and fought, and were slain -- them I shall surely acquit of their evil deeds, and I shall admit them to gardens underneath which rivers flow.' A reward from God! And God with Him is the fairest reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Lord hath heard them (and He saith): Lo! I suffer not the work of any worker, male or female, to be lost. Ye proceed one from another. So those who fled and were driven forth from their homes and suffered damage for My cause, and fought and were slain, verily I shall remit their evil deeds from them and verily I shall bring them into Gardens underneath which rivers flow - A reward from Allah. And with Allah is the fairest of rewards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Lord accepted their prayer, saying, \"I will deny no man or woman among you the reward of their labours. You are members one of another. I will certainly forgive the sins of those who emigrated and were expelled from their homes, who suffered persecution in My cause, who fought and were killed. I will certainly admit them to Gardens through which rivers flow, as a reward from God: with God is the best reward.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their Lord hearkened unto them saying: I let not the work of a worker amongst you to waste, man or woman, one of you from the other. So those who emigrated and were driven forth from their homes and persecuted in My cause, and who fought and were slain, surely I shall expiate from them their misdeeds and surely I shall make them enter Gardens whereunder rivers flow; a reward from before Allah! And Allah! with Him is the excellent reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their Lord answered them, ‘I do not waste the work of any worker among you, whether male or female; you are all on the same footing. So those who migrated and were expelled from their homes, and were tormented in My way, and those who fought and were killed—I will surely absolve them of their misdeeds and I will admit them into gardens with streams running in them, as a reward from Allah, and Allah—with Him is the best of rewards.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Lord hath accepted of them, and answered them: \"Never will I suffer to be lost the work of any of you, be he male or female: Ye are members, one of another: Those who have left their homes, or been driven out therefrom, or suffered harm in My Cause, or fought or been slain,- verily, I will blot out from them their iniquities, and admit them into Gardens with rivers flowing beneath;- A reward from the presence of Allah, and from His presence is the best of rewards.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So their Lord accepted of them (their supplication and answered them), \"Never will I allow to be lost the work of any of you, be he male or female. You are (members) one of another, so those who emigrated and were driven out from their homes, and suffered harm in My Cause, and who fought, and were killed (in My Cause), verily, I will remit from them their evil deeds and admit them into Gardens under which rivers flow (in Paradise); a reward from Allah, and with Allah is the best of rewards.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed their Lord answers them: 'I do not waste the labor of any that labors among you, male or female you are from each other. And those who emigrated, and were expelled from their houses, those who suffered hurt in My way, and fought, and were killed those I shall surely acquit of their evil deeds, and I shall admit them to Gardens underneath which rivers flow' A reward from Allah, and Allah with Him is the best reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so their Lord answered them: “I will not waste the work of any worker among you, whether male or female. You are one of another. For those who emigrated, and were expelled from their homes, and were persecuted because of Me, and fought and were killed—I will remit for them their sins, and will admit them into gardens beneath which rivers flow—a reward from God. With God is the ultimate reward.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Lord responded to them, \"Never will I allow to be lost the work of [any] worker among you, whether male or female; you are of one another. So those who emigrated or were evicted from their homes or were harmed in My cause or fought or were killed - I will surely remove from them their misdeeds, and I will surely admit them to gardens beneath which rivers flow as reward from Allah, and Allah has with Him the best reward.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:195] And their Lord answers them, their supplication, by saying that, ‘I do not let the labour of any labourer among you go to waste, be you male or female — the one of you is as the other (this statement is a reaffirmation of the previous one): that is, they are both equal when it comes to recompensing them for their deeds and for not neglecting them. When Umm Salama asked, ‘O Messenger of God, why is there no   mention of women when it comes to the Emigration (hijra)?’, the following was revealed: and those who emigrated, from Mecca to Medina, and were expelled from their habitations, those who suffered hurt in My way, for My religion, and fought, the disbelievers, and were slain (read qutilū or quttilū) — them I shall surely absolve of their evil deeds, concealing these with forgiveness, and I shall admit them to Gardens underneath which river flow’. A reward (thawāban is a verbal noun reaffirming the import of la-ukaffiranna) from God! (there is a shift of person here). And God — with Him is the fairest reward, [the fairest] requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And their Lord hath heard them) and answered their request ((and He saith): Lo! I suffer not the work of any worker, male or female, to be lost) I thwart not the actions of any one of you. (Ye proceed one from another) if some of you follow the religion of others or are allies to them. Allah then exposited the honour He bestowed upon the Emigrants (al-Muhajirun), saying: (So those who fled) from Mecca to Medina with the Prophet (pbuh) and after the Prophet (and were driven forth from their homes) the Meccan unbelievers drove them from their homes in Mecca (and suffered damage for My cause) for My obedience, (and fought) the enemy in the way of Allah (and were slain) until they were killed, (verily I shall remit their evil deeds from them) which were committed in the course of jihad (and verily I shall bring them into Gardens beneath which) beneath its trees and habitations (rivers) rivers of wine, water, honey and milk (flow. A reward from Allah) a recompense for them from Allah. (And with Allah is the fairest of rewards) a good return which is better than their reward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما تضرعوا إلى الله، والتجأوا إليه، وندموا عمَّا هم عليه { فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ } فاستقبل عليهم بالإجابة قائلاً: { أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ } مخلص { مِّنْكُمْ } سواء كان { مِّن ذَكَرٍ أَوْ أُنْثَىٰ } إذ { بَعْضُكُم } ناشئ { مِّن بَعْضٍ } ذكركم من أنثاكم، وأنثاكم من ذكركم في الإنسانية والمظهرية الجامعة اللائقة للخلافة، { فَٱلَّذِينَ هَاجَرُواْ } منكم من دار الغرور، طالباً الوصول إلى دار السرور { وَأُخْرِجُواْ } بسبب هذا الميل { مِن دِيَـٰرِهِمْ } المألوفة التي هي بقعة الإمكان { وَأُوذُواْ فِي سَبِيلِي } بسبب قطع التعلقات وترك المألوفات { وَقَـٰتَلُواْ } مع القوى الحيوانية { وَقُتِلُواْ } في الجهاد الأكبر\n\n\n\n\n{ لأُكَفِّرَنَّ } لأمحونَّ وأطهرنَّ { عَنْهُمْ سَيِّئَاتِهِمْ } التي هي ذواتهم الباطلة، الهالكة { وَلأُدْخِلَنَّهُمْ جَنَّـٰتٍ } ملاحظات ومكاشفات ومشاهدات { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَـٰرُ } أي: أنهار المعارف والحقائق دائماً، متجدداً { ثَوَاباً } نازلاً { مِّن عِندِ ٱللَّهِ } تفضلاً وامتناناً { وَٱللَّهُ } المستجمع شتات العباد { عِندَهُ حُسْنُ ٱلثَّوَابِ } [آل عمران: 195] وخير المنقلب والمآب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { استجاب }: أخص من أجاب، لأن استجاب مُستلزم لفعل ما طلب منه، وأجاب يصدق بالوعد، ويتعدى بنفسه وباللام، و { بعضكم من بعض }: جملة معترضة\n قاله البيضاوي فانظره\n يقول الحقّ جلّ جلاله: { فاستجاب لهم ربهم } فيما طلبوه لأنه لا يرد السؤال، ولا تخيب لديه الآمال، ولذلك قال: { أني } أي: بسبب { أني لا أضيع عمل عامل منكم من ذكر أو أنثى } لأنكم { بعضكم من بعض } لأن الذكر من الأنثى، والأنثى من الذكر، ولأنهما من أصل واحد، ولفط الاتصال والاتحاد والاتفاق في الدين\n رُوِيَ \" أَنَّ أمَّ سَلَمَة قالتْ: يا رَسُولَ اللّهِ، أني أَسْمَعُ الله يَذكُر الرجَالَ في الهِجْرَةِ ولم يَذكُر النساء، فنزلت: { مِّن ذَكَرٍ أَوْ أُنثَى } [آل عِمرَان: 195] \" الخ\n ثم فصل أعمال العمال، وما أعد لهم من الثواب فقال: { فالذين هاجروا } دار الشرك، وفارقوا الأوطان والأصحاب والعشائر، { وأخرجوا من ديارهم وأُوذوا في سبيلي } بسبب إيمانهم بالله، { وقاتلوا } الكفار، و { قُتلوا } أي: ماتوا في الجهاد\n وقرئ بالعكس لأن الواو لا ترتب، أو قتل بعضهم، وقاتل الباقون ولم يضعفوا، { لأكفرنّ عنهم سيئاتهم } أي: لأمحونها، { ولأدخلنهم جنات تجري من تحتها الأنهار ثواباً من عند الله } أي: أثيبهم من عند الله تفضلاً وإحساناً، { والله عنده حسن الثواب } لا يعجزه شيء\n الإشارة: لما توجهوا إليه بهممهم العلية، وعزائمهم القوية، فقرعوا بابه بدوام ذكره، والتفكر في عظمة ذاته، وجميل إحسانه وبره، وتضرعوا إليه بلسان الذل والانكسار، وحال الخضوع والاضطرار، أجابهم ففتح في وجوههم الباب، وأدخلهم في حضرته مع الأحباب، لأنه يجيب السؤال، ولا يخيب الآمال، بعد أن هاجروا الأوطان، وفارقوا العشائر والإخوان، إلا من يزيد بهم إلى الرحمن، فقاتلوا نفوسهم حتى ماتت فحييت بالوصال، إلى جوار الكبير المتعال، قال الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:30",
      "similarity": 0.38746501419827045
    },
    {
      "verse": "11:115",
      "similarity": 0.37558837512505416
    },
    {
      "verse": "5:85",
      "similarity": 0.3590678953253262
    },
    {
      "verse": "3:171",
      "similarity": 0.35196131284899884
    },
    {
      "verse": "7:170",
      "similarity": 0.3279363490340345
    }
  ]
}