{
  "chapter": "آل عمران",
  "text": "وان من اهل الكتب لمن يؤمن بالله وما انزل اليكم وما انزل اليهم خشعين لله لا يشترون بـايت الله ثمنا قليلا او۟لئك لهم اجرهم عند ربهم ان الله سريع الحساب",
  "translations": [
    {
      "translation": "Among the people of the Book there are some who have iman in Allah and in what has been sent down to you and what was sent down to them, and who are humble before Allah. They do not sell Allah's Signs for a paltry price. Such people will have their reward with their Lord. And Allah is swift at reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly among the people of the Book are some who believe in God and in what has been revealed to you and had been revealed to them; and they bow in humility before God, and do not trade for paltry gain the signs of God. Their reward is verily with their Lord; and swift is the reckoning of God!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the People of the Book some believe in Allah and what has been revealed to you, and what has been revealed to them. They humble themselves before Allah, and do not sell Allah's revelations for a small price. For these men their reward is with their Lord. Allah is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among the People of the Book who believe in God and what is revealed to you and to them. They are humble before God and do not trade God's revelations for a small price. They will receive their reward from their Lord. God's reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And undoubtedly there are some among the People given the Book(s), who accept faith in Allah and what is sent down to you and what was sent down to them – their hearts are submitted humbly before Allah – they do not exchange the verses of Allah for an abject price; they are those whose reward is with their Lord; indeed Allah is Swift At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are, certainly, among the People of the Scripture (Jews and Christians), those who believe in Allah and in that which has been revealed to you, and in that which has been revealed to them, humbling themselves before Allah. They do not sell the verses of Allah for a small price, for them is a reward with their Lord. Surely, Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely of the followers of the Book there are those who believe in Allah and (in) that which has been revealed to you and (in) that which has been revealed to them, being lowly before Allah; they do not take a small price for the communications of Allah; these it is that have their reward with their Lord; surely Allah is quick in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some there are of the People of the Book who believe in God, and what has been sent down unto you, and what has been sent down unto them, men humble to God, not selling the signs of God for a small price; those -- their wage is with their Lord; God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! of the People of the Scripture there are some who believe in Allah and that which is revealed unto you and that which was revealed unto them, humbling themselves before Allah. They purchase not a trifling gain at the price of the revelations of Allah. Verily their reward is with their Lord. Lo! Allah is swift to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the People of the Book believe in God, and in what has been revealed to you and what was revealed to them. They humble themselves before God and do not sell God's revelations for a trifling price. These shall be rewarded by their Lord: God is swift in reckoning!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily of the people of the Book there are some who believe in Allah and in that which hath been sent down unto you and that which hath been sent down unto them, humbling themselves before Allah, and barter not the revelations of Allah for a small price, these they shall have their hire with Allah. Verily Allah swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed among the People of the Book there are some who have faith in Allah and in what has been sent down to you, and in what has been sent down to them. Humble toward Allah, they do not sell the signs of Allah for a paltry gain. They shall have their reward near their Lord; indeed Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are, certainly, among the People of the Book, those who believe in Allah, in the revelation to you, and in the revelation to them, bowing in humility to Allah: They will not sell the Signs of Allah for a miserable gain! For them is a reward with their Lord, and Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are, certainly, among the people of the Scripture (Jews and Christians), those who believe in Allah and in that which has been revealed to you, and in that which has been revealed to them, humbling themselves before Allah. They do not sell the Verses of Allah for a little price, for them is a reward with their Lord. Surely, Allah is Swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among the People of the Book who believe in Allah, and in what has been sent down to you, and what has been sent down to them, humble to Allah and do not buy with the verses of Allah a little price. Those, their wage shall be with their Lord. Allah is Swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Scripture are those who believe in God, and in what was revealed to you, and in what was revealed to them. They are humble before God, and they do not sell God’s revelations for a cheap price. These will have their reward with their Lord. God is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, among the People of the Scripture are those who believe in Allah and what was revealed to you and what was revealed to them, [being] humbly submissive to Allah. They do not exchange the verses of Allah for a small price. Those will have their reward with their Lord. Indeed, Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:199] Verily, there are some among the People of the Scripture who believe in God, like ‘Abd Allāh b. Salām and his companions and the Negus, and what has been revealed to you, that is, the Qur’ān, and what has been revealed to them, that is, the Torah and the Gospel, humble before God (khāshi‘īn is a circumstantial qualification of the person of [the verb] yu’min, ‘who believe’, and takes into account the [potentially plural] sense of man, ‘who’), not purchasing with the verses of God, which they have before them in the Torah and the Gospel pertaining to the descriptions of the Prophet (s), a small price, of this world, by concealing them for fear of losing their supremacy, as others, like the Jews, have done. Those — their wage, the reward for their deeds, is with their Lord, [a reward] which they will be given twice over, as [stated] in the sūrat alQasas [Q. 28:54]. God is swift at reckoning, reckoning with the whole of creation in about half a day of the days of this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then described those from the people of the Book who had believed-'Abdullah Ibn Salam and his followers-saying: (And Lo! of the People of the Scripture there are some who believe in Allah and that which is revealed unto you) the Qur'an (and that which was revealed unto them) of Scripture: the Torah, (humbling themselves before Allah) humble and meek vis-a-vis Allah in worship. (They purchase not a trifling gain) a paltry recompense of means of living (at the price of the revelations of Allah) by hiding the traits and description of Muhammad in the Scripture. (Verily their reward) their recompense (is with their Lord) in Paradise, (and Lo! Allah is swift to take account) when He takes people into account, He is very swift.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّ مِنْ أَهْلِ ٱلْكِتَٰبِ لَمَن يُؤْمِنُ بِٱللَّهِ } المنزل للكتب المرسلة للرسل { وَ } لا يفرق بين الكتب والرسل أصلاً، بل يؤمن بجميع { مَآ أُنزِلَ إِلَيْكُمْ } من القرآن والرسول الذي هو سيدنا محمد عليه السلام { وَمَآ أُنزِلَ إِلَيْهِمْ } من التوراة والإنجيل، المنزلين على موسى وعيسى - عليهما السلام - وكذا على سائر الكتب المنزلة من عنده؛ لتحققهم في مقام العبودية والتوحيد، وهم في هذا الإيمان والإذعان { خَٰشِعِينَ للَّهِ } مخلصين له\n\n\n\n\nوعلامة خشوعهم وإخلاصهم أنهم { لاَ يَشْتَرُونَ بِآيَـٰتِ ٱللَّهِ } أي: بتبديلها { ثَمَناً قَلِيلاً } من الرشى، مثل أحبار اليهود ومتفقهة هذه الأمة في هذا العصر - خذلهم الله - وهم الذين يحتالون في أحكام الشريعة الغراء على مقتضى هويتم الفاسدة، ويأخذون الرشى؛ لأجل حيلهم الباطلة، ويسمونها حيلة شرعية، كأنه ظهر ما قال صلى الله عليه وسلم: \" بدأ غريباً، وسيعود غريباً \" ، { أُوْلـٰئِكَ } المخلصون، الخاشعون { لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ } يوفيهم أجورهم من حيث لا يحتسبون { إِنَّ ٱللَّهَ } المطلع لضمائرهم { سَرِيعُ ٱلْحِسَابِ } آل عمران: 199] يحاسب أعمالهم، ويجازيهم عليها سريعاً، بل يزيد عليهم؛ تفضلاً وامتناناً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وإن من أهل الكتاب } كعبد الله بن سلام وأصحابه ممن أسلم من اليهود، { لمن يؤمن بالله } إيماناً حقيقياً، { وما أُنزل إليكم } من القرآن، { وما أُنزل إليهم } من التوراة، حال كونهم { خاشعين لله } خاضعين مخبتين وافين بالعهد، { لا يشترون بآيات الله ثمناً قليلاً } ، كما فعل المحرفون من أحبار اليهود، { أولئك لهم أجرهم عند ربهم } أي: ما وعدوا به من تضعيف أجرهم مرتين، { إن الله سريع الحساب } فيُسرع إلى توفية أجورهم وإكرام منقلبهم لأن الله عالم بالأعمال وما تستوجبه من النوال، فلا يحتاج إلى تأمل ولا احتياط لأنه غني عن التأمل والاحتياط\n وقيل: نزلت في النصارى: أربعين من نجران، واثنين وثلاثين من الحبشة، قدموا على النبيّ صلى الله عليه وسلم وأسلموا\n وقيل: نزلت في النجاشي، لما نَعَاه جبريل إلى رسول الله صلى الله عليه وسلم، فخرج - عليه الصلاة والسلام -، وصلّى عليه، فقال المنافقون: انظروا إلى هذا، يصلّي على عِلْجٍ نصراني، فنزلت الآية\n والله تعالى أعلم\n الإشارة: قد رأينا بعض الفقهاء حصل لهم الإيمان بخصوص أهل زمانهم، بتحققوا بولايتهم، ونالوا شيئاً من محبتهم، لكن لم تساعفهم الأقدار في صحبتهم، فظهرت عليهم آثار أنوارهم، واقتبسوا شيئاً من أسرارهم، فتنوّرت سريرتهم، وكملت شريعتهم، وأظهر عليهم آثار الخشوع، وأخذوا حظّاً من التواضع والخضوع، متخلقين بالقناعة والورع، قد ذهب عن قلبهم ما ابتلى به غيرهم من الجزع والهلع، فلا جرم أن هؤلاء لهم أجرهم مرتين: أجر ما تحملوا من الشريعة لنفع العوام، وأجبر ما اكتسبوا من محبة القوم\n\n \" المرءُ مَع مَنْ أَحب \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:95",
      "similarity": 0.5616073039212358
    },
    {
      "verse": "2:79",
      "similarity": 0.5443743384414268
    },
    {
      "verse": "9:9",
      "similarity": 0.5340844968190257
    },
    {
      "verse": "2:41",
      "similarity": 0.5183115968105265
    },
    {
      "verse": "3:77",
      "similarity": 0.4631894665691298
    }
  ]
}