{
  "chapter": "آل عمران",
  "text": "ان الدين عند الله الاسلم وما اختلف الذين اوتوا۟ الكتب الا منۢ بعد ما جاءهم العلم بغيۢا بينهم ومن يكفر بـايت الله فان الله سريع الحساب",
  "translations": [
    {
      "translation": "Allah bears witness that there is no god but Him, as do the angels and the people of knowledge, upholding justice. There is no god but Him, the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true way with God is peace; and the people of the Book did not differ until knowledge (of this revelation) had come to them, out of mutual opposition. But those who deny the signs of God (should remember) He is swift in the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true religion with Allah is Islam. The People of the Book adopted many different ways rather than follow the true way of Islam even after the knowledge of truth had reached them, and this merely to commit excesses against one another. Let him who refuses to follow the ordinances and directives of Allah know that Allah is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the sight of God Islam is the religion. The People of the Book created differences in the matters (of religion) because of their hostility among themselves, only after knowledge had come to them. Let whoever denies the revelations of God know that the reckoning of God is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the only true religion in the sight of Allah is Islam; those who had received the Books differed only after the knowledge came to them, due to their hearts’ envy; and whoever disbelieves in the signs of Allah, then Allah is Swift At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, the religion with Allah is Islam. Those who were given the Scripture (Jews and Christians) did not differ except out of rivalry, after knowledge had come to them. And whoever disbelieves in the Ayat of Allah, then surely, Allah is Swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the (true) religion with Allah is Islam, and those to whom the Book had been given did not show opposition but after knowledge had come to them, out of envy among themselves; and whoever disbelieves in the communications of Allah then surely Allah is quick in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true religion with God is Islam. Those who were given the Book were not at variance except after the knowledge came to them, being insolent one to another. And whoso disbelieves in God's signs. God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! religion with Allah (is) the Surrender (to His Will and Guidance). Those who (formerly) received the Scripture differed only after knowledge came unto them, through transgression among themselves. Whoso disbelieveth the revelations of Allah (will find that) lo! Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only true religion in God's sight is complete submission to God. And those who were given the Book disagreed only out of rivalry, after knowledge had been given to them -- he who denies God's signs should know that God is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the religion with Allah is Islam and those Who Were vouchsafed the Book differed Not save after the knowledge had come unto them, out of spite among themselves. And whosoever disbelieveth in the revelations of Allah, then verily Allah swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, with Allah religion is Islam, and those who were given the Book did not differ except after knowledge had come to them, out of envy among themselves. And whoever denies Allah’s signs [should know that] Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Religion before Allah is Islam (submission to His Will): Nor did the People of the Book dissent therefrom except through envy of each other, after knowledge had come to them. But if any deny the Signs of Allah, Allah is swift in calling to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, the religion with Allah is Islam. Those who were given the Scripture (Jews and Christians) did not differ except, out of mutual jealousy, after knowledge had come to them. And whoever disbelieves in the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah, then surely, Allah is Swift in calling to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only religion with Allah is Islam (submission). Those to whom the Book was given disagreed among themselves only after knowledge had been given to them being insolent among themselves. He who disbelieves the verses of Allah indeed Allah is Swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Religion with God is Islam. Those to whom the Scripture was given differed only after knowledge came to them, out of envy among themselves. Whoever rejects the signs of God—God is quick to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the religion in the sight of Allah is Islam. And those who were given the Scripture did not differ except after knowledge had come to them - out of jealous animosity between themselves. And whoever disbelieves in the verses of Allah, then indeed, Allah is swift in [taking] account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:19] Lo!, the religion with God, pleasing [to Him], is submission [to the One God], (al-islām), that is to say, the Divine Law with which the messengers were sent, founded upon the affirmation of God’s Oneness (a variant reading [for inna, ‘lo!’] has anna, ‘that’, as an inclusive substitution for annahu to the end [of that verse, sc. shahida Llāhu … anna l-dīna ‘inda Llāhi l-islām, ‘God bears witness that religion with God is Islām]). Those who were given the Scripture, the Jews and the Christians, differed, in religion, some affirming God’s Oneness, others rejecting it, only after the knowledge, of Oneness, came to them through transgression, on the part of the disbelievers, among themselves. And whoever disbelieves in God’s signs, God is swift at reckoning, that is, at requiting him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقرأ جمهور القرّاء إنّ الدينإِنَّ الدِّينَ عِندَ الله الإسلام } بكسر همزة إنّ فهو استئناف ابتدائي لبيان فضيلة هذا الدين بِأجمَع عبارة وأوجزَها .وهذا شروع في أول غرض أنزلت فيه هذه السورة : غرض محاجّة نصارى نجران ، فهذا الاستئناف من مناسبات افتتاح السورة بذكر تنزيل القرآن والتوراة والإنجيل ، ثم بتخصيص القرآن بالذكر وتفضيله بأنّ هديه يفوق هدي ما قبله من الكتب ، إذ هو الفرقان ، فإنّ ذلك أسّ الدين القويم ، ولما كان الكلام المتقدم مشتملاً على تعريض باليهود والنصارى الذين كذبوا بالقرآن ، وإبطاللٍ لقول وفد نجران لما طلب منهم الرسول صلى الله عليه وسلم الإسلام «أسْلَمْنَا قبلَك» فقال لهم : «كَذَبْتُم» روى الواحدي ، ومحمد بن إسحاق : أنّ وفد نجران لما دخلوا المسجد النبوي تكلم السيد والعاقب فقال لهما رسول الله : \" أسْلِمَا \" قالا : «قد أسلمنا قبلك» قال : \" كذبتما ، يمنعكما من الإسلام دعاؤكما للَّهِ ولدا ، وعبادتُكما الصليب \" ، ناسب أن ينوّه بعد ذلك بالإسلام الذي جاء به القرآن ، ولذلك عطف على هذه الجملة قوله : { وما اختلف الذين أوتوا الكتاب إلاّ من بعد ما جاءهم العلم .واعلم أنّ جمل الكلام البليغ لا يخلو انتظامها عن المناسبة ، وإن كان بعضها استئنافاً ، وإنّما لا تطلب المناسبة في المحادثات والاقتضابات .وتوكيد الكلام بأنّ } تحقيق لما تضمنَّه من حصر حقيقة الدين عند الله في الإسلام : أي الدين الكامل .وقرأ الكسائي { أنّ الدين } بفتح همزة أنّ على أنّه بدل من { أنَّه لا إله إلاّ هو } \\[ آل عمران : 18 \\] أي شهد الله بأنّ الدين عند الله الإسلام .والدين : حقيقته في الأصل الجزاء ، ثم صار حقيقة عرفية يطلق على : مجموع عقائد ، وأعمال يلقّنها رسولٌ من عند الله ويعد العاملين بها بالنعيم والمعرضين عنها بالعقاب . ثم أطلق على ما يشْبِه ذلك مما يضعه بعض زعماء الناس من تلقاء عقله فتَلتزمه طائفة من الناس . وسمّي الدين ديناً لأنّه يترقب منه مُتَّبِعُهُ الجزاءَ عاجلاً أو آجلاً ، فما من أهل دين إلاّ وهم يترقّبون جزاء من رب ذلك الدين ، فالمشركون يطمعون في إعانة الآلهة ووساطتهم ورضاهم عنهم ، ويقولون : هؤلاء شفعاؤنا عند الله ، وقال أبو سفيان يوم أحُد : أعْلُ هُبَلْ . وقال يوم فتح مكة لما قال له العباس : أما آن لك أن تشهد أن لا إله إلا الله : «لقد علمتُ أنْ لو كان معه إله غَيرُه لقد أغنى عَنّي شيئاً» . وأهل الأديان الإلهيَّة يترقّبون الجزاء الأوْفَى في الدنيا والآخرة ، فأول دين إلهي كان حقاً وبه كان اهتداء الإنسان ، ثم طرأت الأديان المكذوبة ، وتشبّهت بالأديان الصحيحة ، قال الله تعالى تعليماً لرسوله { لكم دينكم ولي ديني }\\[ الكافرون : 6 \\] وقال : { ما كان ليأخذ أخاه فِي دِين الملك } \\[ يوسف : 76 \\] .وقد عرّف العلماء الدين الصحيح بأنّه «وضعٌ إلهيٌّ سائق لذوي العقول باختيارهم المحمود إلى الخيْر باطناً وظاهراً» .والإسلام علم بالغلبة على مجموع الدِّين الذي جاء به محمد صلى الله عليه وسلم كما أُطلق على ذلك الإيمان أيضاً ، ولذلك لقب أَتباع هذا الدين بالمسلمين وبالمؤمنين ، وهو الإطلاق المراد هنا ، وهو تسمية بمصدر أَسْلَم إذا أذْعَن ولم يعاند إذعاناً عن اعتراف بحق لا عن عجز ، وهذا اللقب أولى بالإطلاق على هذا الدين من لقب الإيمان؛ لأنّ الإسلام هو المظهر البين لمتابعة الرسول فيما جاء به من الحق ، واطّراح كل حائل يحول دون ذلك ، بخلاف الإيمان فإنّه اعتقاد قلبي ، ولذلك قال الله تعالى : { هو سمَّاكم المسلمين } \\[ الحج : 78 \\] وقال : { فقل أسلمتُ وجهي للَّه ومن اتّبعني } \\[ آل عمران : 20 \\] ولأنّ الإسلام لا يكون إلاّ عن اعتقاد لأنّ الفعل أثر الإدراك ، بخلاف العكس فقد يكون الاعتقاد مع المكابرة .وربما أطلق الإسلام على خصوص الأعمال؛ والإيمان على الاعتقاد ، وهو إطلاق مناسب لحالتي التفكيك بين الأمرين في الواقع ، كما في قوله تعالى ، خطاباً لقوم أسلموا متردّدين { قل لم تؤمنوا ولكن قولوا أسلمنا ولمَّا يدخل الإيمان في قلوبكم } \\[ الحجرات : 14 \\] ، أو التفكيك في تصوير الماهية عند التعليم لحقائق المعاني الشرعية أو اللغوية كما وقع في حديث جبريل : من ذكر معنى الإيمان ، والإسلام ، والإحسان .والتعريف في الدين تعريف الجنس؛ إذ لا يستقيم معنى العهد الخارجي هنا وتعريف الإسلام تعريف العلم بالغلبة : لأنّ الإسلام صار علماً بالغَلَبة على الدين المحمّدي .فقوله : { إن الدين عند الله الإسلام } صيغة حصر ، وهي تقتضي في اللسان حصر المسند إليه ، وهو الدين ، في المسند ، وهو الإسلام ، على قاعدة الحصر بتعريف جزئي الجملة ، أي لا دين إلا الإسلام ، وقد أكّد هذا الانحصار بحرف التوكيد .وقولُه : { عند الإسلام } وصف للدين ، والعندية عندية الاعتبار والاعتناءِ وليست عندية علم : فأفاد ، أنّ الدين الصحيح هو الإسلام ، فيكون قصراً للمسند ، إليه باعتبار قيد فيه ، لا في جميع اعتباراته : نظير قول الخنساء: ... إذا قَبُحَ البُكاءُ على قتيلرأيتُ بكاءَكَ الحَسَن الجَميلا ... فحصرت الحَسَن في بكائه بقاعدة أنّ المقصور هو الحسن لأنّه هو المعرف باللاّم ، وهذا الحصر باعتبار التقييد بوقتتِ حُجْ البكاء على القتلى وهو قصر حُسْن بكائها على ذلك الوقت ، ليكون لبكائها على صخر مزية زائدة على بكاء القتلى المتعارف وإن أبى اعتبار القصر في البيت أصلاً صَاحب المطوّل .وإذ قد جاءت أديان صحيحة أمر الله بها فالحصر مؤول : إمّا باعتبار أنّ الدين الصحيح عند الله ، حينَ الإخبار ، وهو الإسلام ، لأنّ الخبر ينظر فيه إلى وقت الإخبار؛ إذ الأخبار كلّها حقائق في الحال ، ولا شك أنّ وقت الإخبار ليس فيه دين صحيح غير الإسلام؛ إذ قد عرض لبقية الأديان الإلهية ، من خلط الفاسد بالصحيح ، ما أختل لأجله مجموع الدين ، وإما باعتبار الكمال عند الله فيكون القصر باعتبار سائر الأزمان والعصور؛ إذ لا أكمل من هذا الدين ، وما تقدّمه من الأديان لم يكن بالغاً غاية المراد من البشر في صلاح شؤونهم ، بل كان كل دين مضى مقتصراً على مقدار الحاجة من أمة معيّنة في زمن معيّن ، وهذا المعنى أولي محملي الآية ، لأنّ مُفاده أعم ، وتعبيره عن حاصل صفة دين الإسلام تُجاه بقية الأديان الإلهية أتم .ذلك أنّ مراد الله تعالى من توجيه الشرائع وإرسال الرسل ، ليس مجرّد قرع الأسماع بعبارات التشريع أو التذوّق لدَقائق تراكيبه ، بل مراد الله تعالى ممّا شرع للناس هو عملهم بتعاليم رسله وكتبه ، ولما كان المراد من ذلك هو العمل ، جعل الله الشرائع مناسبة لقابليات المخاطبين بها ، وجارية على قدر قبول عقولهم ومقدرتهم ، ليتمكّنوا من العمل بها بدواممٍ وانتظام ، فلذلك كان المقصود من التدّين أن يكون ذلك التعليم الديني دأباً وعادة لمنتحليه ، وحيثُ النفوسُ لا تستطيع الانصياع إلى ما لا يتّفق مع مدركاتها ، لا جرم تعيّن مراعاة حال المخاطبين في سائر الأديان . ليمكن للأمم العمل بتعاليم شرائعها بانتظام ومواظبة .وقد كانت أحوال الجماعات البشرية ، في أول عهود الحضارة ، حالاتتِ عكوف على عوائد وتقاليد بسيطة ، ائتلفت رُويدَا رويدَا على حسب دواعي الحاجات ، وما تلك الدواعي ، التي تسبّبت في ائتلاف تلك العوائد ، إلاّ دواع غير منتشرة؛ لأنّها تنحصر فيما يعود على الفرد بحفظ حياته ، ودفع الآلام عنه ، ثم بحفظ حياة من يرى له مزيد اتّصال به ، وتحسيننِ حاله ، فبذلك ائتلف نظام الفرد ، ثم نظام العائلة ، ثم نظام العشيرة ، وهاته النُظُم المتقابسة هي نُظم متساوية الأشكال؛ إذ كلّها لا يعدو حفظ الحياة ، بالغذاء والدفاععِ عن النفس ، ودفعَ الآلام بالكساء والمسكن والزواج ، والانتصار للعائلة وللقبيلة؛ لأنّ بها الاعتزاز ، ثم ما نشأ عن ذلك من تعاون الآحاد على ذلك ، بإعداد المعدّات : وهو التعاوض والتعامل ، فلم تكن فكرة الناس تعدو هذه الحالة ، وبذلك لم يكن لإحدى الجماعات شعور بما يجري لدى جماعة أخرى ، فضلاً عن التفكير في اقتباس إحداها مما يجري لدى غيرها ، وتلك حالة قناعة العيش ، وقصور الهمة ، وانعدام الدواعي فإذا حصلت الأسباب الآنفة عدّ الناس أنفسهم في منتهى السعادة .وكان التباعد بين الجماعات في المواطن مع مشقة التواصُل ، وما يعرض في ذلك من الأخطار والمتاعب ، حائلاً عن أن يصادفهم ما يوجب اقتباس الأمم بعضها عن بعض وشعور بعضها بأخلاق بعض ، فصار الصارف عن التعاون في الحضارة الفكرية مجموع حائلين : عدم الداعي ، وانسداد وسائل الصدفة ، اللهم إلاّ ما يعرض من وفادة وافد ، أو اختلاط في نجعة أو موسم ، على أنّ ذلك إن حصل فسرعان ما يطرأ عليه النسيان ، فيصبح في خبر كان .فكيف يرجى من أقوام ، هذه حالهم ، أن يدعوهم الداعي إلى صلاح في أوسع من دوائر مدركاتهم ، ومتقارب تصوّر عقولهم ، أليسوا إذا جاءهم مصلح كذلك لبسوا له جلد النمر ، فأحسّ من سوء الطاعة حرق الجمر ، لذلك لم تتعلّق حكمة الله تعالى ، في قديم العصور ، بتشريع شريعة جامعة صالحة لجميع البشر ، بل كانت الشرائع تأتي إلى أقوام معيّنين؛ وفي حديث مسلم ، في صفة عرض الأمم للحساب أنّ رسول الله قال : « فيجيء النبي ومعه الرهط ، والنبي ومعه الرجل والرجلان ، والنبي وليس معه أحد » وفي رواية البخاري : « فجعل النبي والنّبيئان يمرّون معهم الرهط » الحديث . وبقي الحق في خلال ذلك مشاعاً بين الأمم ، ففي كلّ أمة تجد سداداً وأفناً ، وبعض الحق لم يزل مخبوءاً لم يسفر عنه البيان .ثم أخذ البشر يتعارفون بسبب الفتوح والهجرة ، وتقاتلت الأمم المتقاربة المنازل ، فحصل للأمم حظ من الحضارة ، وتقاربت العوائد ، وتوسّعت معلوماتهم ، وحضارتهم ، فكانت من الشرائع الإلهية : شريعة إبراهيم عليه السلام ، ومن غيرها شريعة ( حمورابي ) في العراق ، وشريعة البراهمة ، وشريعة المصريين التي ذكرها الله تعالى في قوله : { ما كان ليأخذ أخاه في دِين الملك } \\[ يوسف : 76 \\] .ثم أعقبتها شريعة إلهية كبرى وهي شريعة موسى عليه السلام التي اختلط أهلها بأمم كثيرة في مسيرهم في التيه وما بعده ، وجاورتها أو أعقبتها شرائع مثل شريعة ( زرادشت ) في الفرس ، وشريعة ( كنفشيوس ) في الصين ، وشريعة ( سولون ) في اليونان .وفي هذه العصور كلّها لم تكن إحدى الشرائع عامة الدعوة ، وهذه أكبر الشرائع وهي الموسوية لم تدْعُ غير بين إسرائيل ولم تدع الأممَ الأخرى التي مرّت عليها ، وامتزجت بها ، وصاهرتها ، وكذلك جاءت المسيحية مقصورة على دعوة بني إسرائيل حتى دعا الناسَ إليها القدّيس بُولس بعد المسيح بنحو ثلاثين سنة .إلى أن كان في القرن الرابع بعد المسيح حصول تقابس وتمازج بين أصناف البشر في الأخلاق والعوائد ، بسببين : اضطراري ، واختياري . أمّا الاضطراري فذلك أنّه قد ترامت الأمم بعضها على بعض ، واتّجه أهل الشرق إلى الغرب ، وأهل الغرب إلى الشرق ، بالفتوح العظيمة الواقعة بين الفرس والروم ، وهما يومئذ قطبا العالم ، بما يتبع كل واحدة من أمم تنتمي إلى سلطانها ، فكانت الحرب سجالاً بين الفريقين ، وتوالت أزماناً طويلة .وأمّا الاختياري فهو ما أبْقاه ذلك التمازج من مشاهدة أخلاق وعوائد ، حسنت في أعين رائيها ، فاقتبسوها ، وأشياء قبحت في أعينهم ، فحذِروها ، وفي كلتا الحالتين نشأت يقظة جديدة ، وتأسّست مدنيات متفنّنة ، وتهيّأت الأفكار إلى قبول التغييرات القوية ، فتهيّأت جميع الأمم إلى قبول التعاليم الغريبة عن عوائدها وأحوالها ، وتساوت الأمم وتقاربت في هذا المقدار ، وإن تفاوتت في الحضارة والعلوم تفاوتاً ربما كان منه ما زاد بعضَها تهيّئوا لقبول التعاليم الصحيحة ، وقهقر بعضاً عن ذلك بما داخلها من الإعجاب بمبلغ علمها ، أو العكوف والإلف على حضارتها .فبلغ الأجل المراد والمعيّن لمجيء الشريعة الحق الخاتمة العامة .فأظهر الله دين الإسلام في وقت مناسب لظهوره ، واختار أن يكون ظهوره بين ظهراني أمة لم تسبِق لها سابقةُ سلطان ، ولا كانت ذات سيادة يومئذ على شيء من جهات الأرض ، ولكنّها أمة سلّمها الله من معظم رعونات الجماعات البشرية ، لتكون أقرب إلى قبول الحق ، وأظهر هذا الدينَ بواسطة رجل منها ، لم يكن من أهل العلم . ولا من أهل الدولة ، ولا من ذرية ملوك ، ولا اكتسب خبرة سابقة بهجرة أو مخالطة ، ليكون ظهور هذا تحت الصريح ، والعلم الصحيح ، مِن مثله آيةً على أنّ ذلك وحي من الله نفحَ به عباده .ثم جعل أسس هذا الدين متباعدة عن ذميم العوائد في الأمم ، حتى الأمة التي ظهر بينها ، وموافقة للحق ولو كان قد سبق إليه أعداؤها ، وكانت أصوله مَبنية على الفطرة بمعنى ألاّ تكون ناظرة إلاّ إلى ما فيه الصلاح في حكم العقل السليم ، غير ماسور للعوائد ولا للمذاهب ، قال تعالى : { فأقم وجهك للدين حنيفاً فطرة الله التي فطر الناس عليها لا تبديل لِخلق الله ذلك الدين القيّم { ولكنّ أكثر الناس لا يعلمون } \\[ الروم : 30 \\] ، قال الشيخ أبو علي ابن سينا : «الفطرة أن يتوهّم الإنسان نفسه حصل في الدنيا دفعة وهو عاقل ، لم يسمع رأياً ، ولم يعتقد مذهباً ، ولم يعاشر أمة ، لكنّه شاهد المحسوسات ، ثم يعرِض على ذهنه الأشياء شيئاً فشيئاً فإن أمكنه الشك في شيء فالفطرة لا تشهد به ، وإن لم يمكنه الشك فيه فالفطرة توجبه ، وليس كلّ ما توجبه الفطرة بصادق ، بل الصادق منه ما تشهد به فطرة القوة التي تسمّى عقلاً ، قبل أن يعترضه الوهْم» .ويدخل في الفطرة الآداب العتيقة التي اصطلح عليها كافة عقلاء البشر ، وارتاضت نفوسهم بها ، إذا كانت تفيدهم كمالاً ، ولا تفضي إلى فساد ، وذلك أصول قواعد حفظ النسب والعرض خاصة . فبهذا الأصل : أصللِ الفطرة كان الإسلام ديناً صالحاً لجميع الأمم في جميع الأعصر .ثم ظهر هذا الأصل في تسعة مظاهر خادمةٍ له ومهيّئةٍ جميع الناس لقبوله .المظهر الأول : إصلاح العقيدة بحمل الذهن على اعتقادٍ لا يشوبه تردّد ولا تمويه ولا أوهام ولا خرافات ، ثم بِكون عقيدته مبنية على الخضوع لواحد عظيم ، وعلى الاعتراف باتّصاف هذا الواحد بصفات الكمال التامة التي تجعل الخضوع إليه اختيارياً ، ثم لتصيرَ تلك الكمالات مطمح أنظار المعتقد في التخلّق بها ثم بحمل جميع الناس على تطْهير عقائدهم حتى يتّحد مبدأ التخلّق فيهم { قل يأهل الكتاب تعالوا إلى كلمةٍ سَواءٍ بيننا وبينكم ألاّ نعبد إلا اللَّه ولا نشرك به شيئاً ولا يتخذ بعضنا بعضاً أرباباً من دون اللَّه } \\[ آل عمران : 64 \\] .وكان إصلاح الاعتقاد أهمّ ما ابتدأ به الإسلام ، وأكثرَ ما تعرّض له؛ وذلك لأنّ إصلاح الفكرة هو مبدأ كلّ إصلاح؛ ولأنّه لا يرجى صح لقوم تلطَّخت عقولهم بالعقائد الضالّة ، وخسئت نفوسهم بآثار تلك العقائد المثيرة : خوفاً من لا شَيء ، وطمعاً في غير شيء ، وإذا صلح الاعتقاد أمكن صلاح الباقي؛ لأنّ المرء إنسان بروحه لا بجسمه .ثم نشأ عن هذا الاعتقاد الإسلامي : عزّة النفس ، وأصلة الرأي ، وحرية العقل ، ومساواة الناس فيما عدا الفضائل .وقد أكثر الإسلام شرح العقائد إكثاراً لا يشبهه فيه دين آخر؛ بل إنّك تنظر إلى كثير من الأديان الصحيحة ، فلا ترى فيها من شرح صفات الخالق إلاّ قليلاً .المظهر الثاني : جمعه بين إصلاح النفوس ، بالتزكية ، وبين إصلاح نظام الحياة ، بالتشريع ، في حين كان معظم الأديان لا يتطرّق إلى نظام الحياة بشيء ، وبعضها وإن تطرّق إليه إلاّ أنّه لم يوفه حقه ، بل كان معظم اهتمامها منصرفاً إلى المواعظ والعبادات ، وقد قرن القرآن المصلحتين في غير ما آية قال تعالى : { من عَمِل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينَّه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون } \\[ النحل : 97 \\] .المظهر الثالث : اختصاصه بإقامة الحجة ، ومجادلة المخاطبين بصنوف المجادلات وتعليل أحكامه ، بالترغيب وبالترهيب ، وذلك رعي لمراتب نفوس المخاطبين ، فمنهم العالم الحكيم الذي لا يقتنع إلاّ بالحجة والدليل ، ومنهم المكابر الذي لا يرعوي إلاّ بالجدل والخطابة ، ومنهم المترهّب الذي اعتاد الرغبة فيما عند الله ، ومنهم المكابر المعاند ، الذي لا يقلعه عن شغبه إلاّ القوارع والزواجر .المظهر الرابع : أنّه جاء بعموم الدعوة لسائر البشر ، وهذا شيء لم يسبق في دين قبله قط ، وفي القرآن : { قل يأيها الناس إنّي رسول الله إليكم جميعاً } \\[ الأعراف : 158 \\] ، وفي الحديث الصحيح : « أعْطِيتُ خمساً لم يُعْطَهُنّ أحَدٌ قبلي فذكر وكانَ الرسول يُبعث إلى قومه خاصة وبُعِثْتُ إلى الناس عامة » وقد ذكر الله تعالى الرسل كلّهم فذكر أنّه أرسلهم إلى أقوامهم .والاختلاف في كون نوح رسولاً إلى جميع أهل الارض ، إنّما هو مبْني : على أنّه بعد الطوفان انحصر أهل الارض في أتباع نوح ، عند القائلين بعموم الطوفان سائرالارض ، ألاَ ترى قوله تعالى : { ولقد أرسلنا نوحاً إلى قومه } \\[ الأعراف : 59 \\] وأيَّاماً كان احتمال كون سكّان الارض في عصر نوح هم من ضمّهم وطن نوح ، فإن عموم دعوتة حاصل غير مقصود .المظهر الرابع : الدوام ولم يَدّععِ رسول من الرسل أنّ شريعته دائمة ، بل ما من رسول ، ولا كتاب ، إلاّ تجد فيه بشارة برسول يأتي من بعده .المظهر الخامس : الإقلال من التفريع في الأحكام بل تأتي بأصولها ويُترك التفريع لاستنباط المجتهدين وقد بيّن ذلك أبو إسحاق الشاطبي في تفسير قوله تعالى : { ما فرّطنا في الكتاب من شيء } \\[ الأنعام : 38 \\] لتكون الأحكام صالحة لكلّ زمان .المظهر السادس : أنّ المقصود من وصايا الأديان إمكان العمل بها ، وفي أصول الأخلاق أنّ التربية الصحيحة هي التي تأتي إلى النفوس بالحيلولة بينها وبين خواطر الشرور؛ لأنّ الشرور ، إذا تَسرَّبت إلى النفوس ، تعذّر أو عسر اقتلاعها منها ، وكانت الشرائع تحمل الناس على متابعة وصاياها بالمباشرة ، فجاء الإسلام يحمل الناس على الخير بطريقتين : طريقة مباشرة ، وطريقة سدّ الذرائع الموصلة إلى الفساد ، وغالب أحكام الإسلام من هذا القبيل وأحسبها أنّها من جملة ما أريد بالمشتبهات في حديث :« إن الحلال بيّن وإنّ الحرام بيّن وبينهما أمور مشتبهات لا يعلمهنّ كثير من الناس » .المظهر السابع : الرأفة بالناس حتى في حملهم على مصالحهم بالاقتصار في التشريع على موضع المصلحة ، مع تطلب إبراز ذلك التشريع في صورة ليّنة ، وفي القرآن { يريد اللَّه بكم اليسر ولا يريد بكم العسر } \\[ البقرة : 185 \\] وفي الحديث : « بُعثت بالحنيفية السَّمْحَة ولن يشادّ هذا الدين أحد إلاّ غلبه » وكانت الشرائع السابقة تحمل على المتابعة بالشدّة ، فلذلك لم تكن صالحة للبقاء؛ لأنّها روعي فيها حال قساوة أمم في عصور خاصة ، ولم تكن بالتي يُناسبها ما قُدِّر مصيرُ البشر إليه من رقّة الطباع وارتقاء الأفهام .المظهر الثامن : امتزاج الشريعة بالسلطان في الإسلام ، وذلك من خصائصه؛ إذ لا معنى للتشريع إلاّ تأسيس قانون للأمة ، وما قيمة قانون لا تحميه القوة والحكومة . وبامتزاج الحكومة مع الشريعة أمكن تعميم الشريعة ، واتّحاد الأمة في العمل والنظام .المظهر التاسع : صراحة أصول الدين ، بحيث يتكرّر في القرآن ما تُستَقْرَى منه قواطعُ الشريعة ، حتى تكونَ الشريعة معصومة من التأويلات الباطلة ، والتحريفات التي طرأت على أهل الكتب السابقة ، ويزداد هذا بياناً عند تفسير قوله تعالى : { فقل أسلمت وجهي للَّه ومن اتّبعني } \\[ آل عمران : 20 \\] .{ ه4س3ش19ن6/ن26-->وَمَا اختلف الذين أُوتُواْ الكتاب إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ العلم بَغْيًا بَيْنَهُمْ وَمَن يَكْفُرْ بآيات الله فَإِنَّ الله سَرِيعُ الحساب } .عُطِفَ { وما اختلف الذين أوتوا الكتاب } على قوله : { إن الذين عند الله الإسلام } للإخبار عن حال أهل الكتاب من سوء تلقّيهم لدين الإسلام ، ومن سوء فهمهم في دينهم .وجيء في هذا الإخبار بطريقة مؤذنة بورود سؤال؛ إذ قد جيء بصيغة الحصر : لبيان سبب اختلافهم ، وكأنّ اختلافَهم أمر معلوم للسامع . وهذا أسلوب عجيب في الإخبار عن حالهم إخباراً يتضمّن بيان سببه ، وإبطال ما يَتراءى من الأسباب غير ذلك ، مع إظهار المقابلة بين حال الدِّيننِ الذي هم عليه يومئذ من الاختلاف ، وبين سلامة الإسلام من ذلك .وذلك أنّ قوله : { إن الدين عند الله الإسلام } قد آذَن بأنّ غيره من الأدين لم يبلغ مرتبة الكمال والصلاحية للعموم ، والدوام ، قبل التغيير ، بلَه ما طرأ عليها من التغيير ، وسوء التأويل ، إلى يومَ مجيء الإسلام ، ليعلم السامعون أنّ ما عليه أهل الكتاب لم يصل إلى أكمل مراد الله من الخلق على أنّه وقع فيه التغيير والاختلاف ، وأن سبب ذلك الاختلاف هو البغي بعدما جاءهم العلم ، مع التنبيه على أنّ سبب بطلان ما هم عليه يومئذ هو اختلافهم وتغييرهم ، ومن جملة ما بدّلوه الآيات الدالة على بعثة محمد صلى الله عليه وسلم وفيه تنبيه على أنّ الإسلام بعيد عن مثل ما وقعوا فيه من التحريف ، كما تقدّم في المظهر التاسع ، ومن ثم ذمّ علماؤنا التأويلات البعيدة ، والتي لم يَدْعُ إليها داععٍ صريح .وقد جاءت الآية على نظم عجيب يشتمل على معانٍ : منها التحذير من الاختلاف في الدين ، أي في أصوله ، ووجوب تطلّب المعاني التي لا تناقض مقصد الدين ، عبرة بما طرأ على أهل الكتاب من الاختلاف .ومنها التنبيه على أنّ اختلاف أهل الكتاب حصل مع قيام أسباب العلم بالحق ، فهو تعريض بأنّهم أساءوا فهم الدين .ومنها الإشارة إلى أنّ الاختلاف الحاصل في أهل الكتاب نوعان : أحدهما اختلاف كل أمة مع الأخرى في صحة دينها كما قال تعالى : { وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب } \\[ البقرة : 113 \\] ، وثانيهما اختلاف كل أمة منهما فيما بينها وافتراقها فرقاً متباينةَ المنازع . كما جاء في الحديث : \" اختلفت اليهود على اثنتين وسبعين فرقة \" يُحَذِّر المسلمين ممّا صنعوا .ومنها أنّ اختلافهم ناشيء عن بغي بعضهم على بعض .ومنها أنّهم أجمعوا على مخالفة الإسلام والإعراضضِ عنه بغياً منهم وحسداً ، مع ظهور أحقّيته عند علمائهم وأحبارهم كما قال تعالى : { الذين ءاتيناهم الكتاب يعرفونه كما يعرفون أبناءهم وإن فريقاً منهم ليكتمون الحق وهم يعلمون الحق من ربك فلا تكوننّ من الممترين } \\[ البقرة : 146 ، 147 \\] ، وقال تعالى : { ودّ كثير من أهل الكتاب لو يردّونكم من بعد إيمانكم كفّاراً حسداً من عند أنفسهم من بعد ما تبيّن لهم الحق } \\[ البقرة : 109 \\] أي أعرضوا عن الإسلام ، وصمّموا على البقاء على دينهم ، وودّوا لو يردّونكم إلى الشرك أو إلى متابعة دينهم حسداً على ما جاءكم من الهُدى بعد أن تبيّن لهم أنّه الحق .ولأجل أن يسمح نظم الآية بهذه المعاني ، حُذِف متعلِّق الاختلاف في قوله : { اختلف الذين أوتوا الكتاب } ليشمل كلّ اختلاف منهم : من مخالفة بعضهم بعضاً في الدين الواحد ، ومخالفة أهل كلّ دين لأهل الدين الآخر ، ومخالفة جميعهم للمسلمين في صحّة الدين .وحُذف متعلّق العلم في قوله : { من بعد ما جاءهم العلم } لذلك .وجُعل «بغيا» عقب قوله : «من بعد ما جاءهم العلم» ليتنازعه كلُّ من فعل ( اختلف ) ومن لفظ ( العِلم ) .وأُخِّر بينَهم عن جميع ما يصلح للتعليق به : ليتنازعه كلّ من فعل ( اختلف ) وفِعل ( جاءَهم ) ولفظِ ( العِلم ) ولفظ ( بَغيا ) .وبذلك تعلم أنّ معنى هذه الآية أوسع معانيَ من معاني قوله تعالى : { وما اختلف فيه إلا الذين أوتوه من بعد ما جاءتهم للبينات بغيا بينهم }في سورة ا \\[ لبقرة : 213 \\] وقوله : { وما تفرق الذين أوتوا الكتاب إلاّ من بعد ما جاءتهم البيّنة } في سورة \\[ البيّنة : 4 \\] كما ذكرناه في ذينك الموضعين لاختلاف المقامين .فاختلاف الذين أوتوا الكتاب يشمل اختلافهم فيما بينهم : أي اختلاف أهل كل ملّة في أمور دينها ، وهذا هو الذي تشعر بها صيغة اختلف كاختلاف اليهود بعد موسى غيرَ مرة ، واختلافِهم بعد سليمانَ إلى مملكتين : مملكة إسرائيل ، ومملكة يَهُوذا ، وكيف صار لكلّ مملكة من المملكتين تديُّنٌ يخالف تديُّنَ الأخرى ، وكذلك اختلاف النصارى في شأن المسيح ، وفي رسوم الدين ، ويكون قوله : بينهم حالاً لبغيا : أي بغيا متفشيّا بينهم ، بأن بغَى كلّ فريق على الآخر .ويشمل أيضاً الاختلاف بيْنهم في أمر الإسلام؛ إذ قال قائل منهم : هو حق ، وقال فريق : هو مرسل إلى الأميّين ، وكفر فريق ، ونافق فريق . وهذا الوجه أوفى مناسبة بقوله تعالى : إن الدين عند الله الإسلام } ، ويكون قوله : { بينهم } على هذا وصفا لبغيا : أي بغياً واقعاً بينهم .ومجيء العلم هو الوحي الذي جاءت به رسلهم وأنبياؤُهم ، لأنّ كلمة جاء مؤذنه بعلم متلقّى من الله تعالى ، يعني أنّ العلم الذي جاءهم كان من شأنه أن يصدّهم عن الاختلاف في المراد ، إلاّ أنّهم أساءوا فكانوا على خلاف مراد الله من إرسال الهدى .وانتصب { بغيا } على أنّه مفعول لأجله ، وعامل المفعول لأجله : هو الفعل الذي تفرّغ للعمل فيما بعدَ حرف الاستثناء ، فالاستثناء كان من أزمان وعلل محذوفة والتقديرُ : ما اختلفوا إلاّ في زمن بعدما جاءهم العلم وما كان إلاّ بغياً بينهم . ولك أن تجعل بغياً منصوباً على الحال من الذين أوتوا الكتاب ، وهو وإن كان العامل فيه فعلاً منفياً في اللفظ إلاّ أن الاستثناء المفرّغ جعله في قوه المثبت ، فجاء الحال منه عقب ذلك ، أي حال كون المختلفين باغين ، فالمصدر مؤوّل بالمشتق . ويجوز أن تجعله مفعولاً لأجله من ( اختلف ) باعتبار كونه صار مثبتاً كما قرّرنا .وقد لمّحت الآية إلى أنّ هذا الاختلاف ، والبغي كُفْر ، لأنّه أفضى بهم إلى نقض قواعد أديانهم ، وإلى نكران دين الإسلام ، ولذلك ذيّله بقوله : { ومن يكفر بآيات الله } إلخ .وقولُه : { فإن الله سريع الحساب } تعريض بالتهديد ، لأنّ سريع الحساب إنّما يبتدىء بحساب من يكفر بآياته ، والحساب هنا كناية عن الجزاء كقوله : { إنْ حسابهم إلاّ على ربي } \\[ الشعراء : 113 \\] .وفي ذكر هذه الأحوال الذميمة من أحوال أهل الكتاب تحذير للمسلمين أن يقعوا في مثل ما وقع فيه أولئك ، والمسلمون وإن اختلفوا في أشياء كثيرة لم يكن اختلافهم إلاّ اختلافاً علمياً فرعياً ، ولم يختلفوا اختلافاً ينقض أصول دينهم بل غاية الكلّ الوصول إلى الحق من الدين ، وخدمة مقاصد الشريعة ، فبَنُو إسرائيل عبدوا العجل والرسولُ بين ظهرانيْهم ، وعبدوا آلهة الأمم غيرَ مرة ، والنصارى عبدوا مريم والمسيح ، ونقضوا أصول التوحيد ، وادّعوا حلول الخالق في المخلوق . فأما المسلمون لما قال أحدُ أهل التصوّف منهم كلامَاً يوهم الحُلول حكم علماؤهم بقتله .\n\n",
      "translations": [
        {
          "translation": "(Lo! Religion) that is accepted (with Allah (is) the Surrender (to His will and guidance)). It is also said that this should be understood as: Allah bears witness that Religion with Him is Islam (the Surrender), and the angels, the prophets and the believers also bear witness to this. This verse was revealed about two men from Historic Syria who asked the Prophet (pbuh) which is the greatest witness in the Book of Allah. When he informed them about it, they embraced Islam. (Those who (formerly) received the Scripture) the Jews and Christians (differed) about Islam and Muhammad (only after knowledge) the exposition of what is in their Scripture (came unto them, through transgression among themselves) out of resentful envy. (Whoso disbelieveth the revelations of Allah) Muhammad and the Qur'an ((will find that) Lo! Allah is swift at reckoning) severe in His punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ الدين عند الله } هو هذا التوحيد الذي قرّره بنفسه\n فإنّ دينه دين إسلام الوجوه كما قال إبراهيم صلى الله عليه وسلم: \" أسلمت وجهي لله \" أي: نفسي وجملتي\n وانخلعت عن أنانيتي\n ففنيت فيه\n وأمر الله تعالى حبيبه عليه الصلاة والسلام فيما بعد بقوله: { فإن حاجوك فقل أسلمت وجهي لله ومن اتّبعن }\n { إنّ الذين يَكْفرون بآياتِ الله } أي: المحجوبين عن الدين { ويقتلون النبيين بغير حقّ } لكونهم محجوبين بدينهم لا يقبلون إلا ما هم عليه من التقيد والتقليد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلدِّينَ } القيوم والشرع المستقيم المقبول المرضي { عِندَ ٱللَّهِ } الهادي للعباد إلى طريق الرشاد هو { ٱلإِسْلاَمُ } المنزل من عنده إلى خير الأنام سيدنا محمد صلى الله عليه وسلم { وَمَا ٱخْتَلَفَ } المعاندون المنكرون لدين الإسلام من { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ } أي: اليهود والنصارى { إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ } اليقيني في كتبهم المنزلة من عند الله بأنه سيظهر النبي الحق\n والدين الحق الناسخ لجميع الأديان السابقة\n وعلموا حين ظهوره حقيته بالدلائل والعلامات المبينة في كتابهم\n ومع ذلك ينكرونه { بَغْياً } حسداً ثابتاً { بَيْنَهُمْ } ناشئاً من طلب الرئاسة والاستكبار والعتو الإصرار { وَمَن يَكْفُرْ بِآيَاتِ ٱللَّهِ } بأمثال هذه الأباطيل المموهة يجازيهم على كل منها بلا فوت شيء { فَإِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ } [آل عمران: 19] لا ي عزب عن علمه شيء\n شديد العقاب لمن أنكر آياته بعد ظهور حقيتها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إن الدين }: جملة مستأنفة مؤكدة للأولى\n أي: لا دين مرضى عند الله سوى الإقرار بالشهادة والدخول فيما جاء به محمد صلى الله عليه وسلم\n ومن قرأ بالفتح فهو بدل من { أنه } \n بدل الكل\n إن فسر الإسلام بالإيمان\n وبدل الاشتمال إن فسر بالشريعة\n يقول الحقّ جلّ جلاله: { شهد الله أنه لا إله إلا هو } أي: بيَّن وحدانيتَه بنصب الدلالئل الدالة عليها وإنزال الآيات الناطقة بها\n أو بتدبيره العجيب وصنعته المتقنة وأموره المحكمة\n وفي ذلك يقول القائل:\nوقيل لبعض العرب: ما الدليل على أن للعالم صانعاً؟ فقال: البعرة تدل على البعير\n وآثار القدم تدل على المسير\n فهيكل علوي بهذه اللطافة\n ومركز سفلي بهذه الكثافة\n أمَا يدلان على الصانع الخبير؟! { و } شهدت { الملائكة } أيضاً بالإقرار بالوحدانية والإخبار بها\n { وأولوا العلم } وهم: الأنبياء والعلماء بالله\n بالإيمان بها والاحتجاج عليها\n شبه ذلك في البيان والكشف بشهادة الشاهد\n وفيه دليل شرف أهل العلم وفضلهم\n حيث قرن شهادتهم بشهادته لأن العلم صفة الله العليا ونعمته العظمى\n والعلماء أعلام الإسلام\n والسابقون إلى دار السلام\n وسُرج الأمكنة وحجج الأزمنة\n وعن جابر قال: قال النبيّ صلى الله عليه وسلم:\n \" سَاعَةٌ مِنْ عَالمِ يتَّكِئ على فِرَاشِهِ\n ينظُرُ في علمهِ\n خَيرٌ مِنْ عِبَادَة العَابِد سَبعينَ عاماً \" \nوعن معاذ قالَ: قال النبيّ صلى الله عليه وسلم:\n \" تعلموا العلم فإن تعلمه لله خشيةٌ\n ومدارستَه تسبيحٌ\n والبحث فيه جهادٌ\n وتعليمه مَنْ لا يعلمه صدقةٌ\n وتذكُّره في أهله قُرْبَة \" \nثم قال في آخر الحديث في فضل أهل العلم:\n \" وتَرْغَبُ الملائكة في خُلتِهم\n وبأجنحتها تمسحُهم\n وفي صلاتها تستغفر لهم\n وكلُّ رطب ويابس يستغفر لهم\n حتى حيتان البحر وهوامه\n وسباع الأرضين وأنعامها\n والسماء ونجومها\n ألا وإن العلم حياةُ القلوب من العمى\n ونورُ الأبصار من الظلم\n وقوة الأبدان من الضعف\n يبلغ بالعبد منزل الأحرار ومجالسة الملوك\n والفكر فيه يُعْدل بالصيام\n ومدارسته بالقيام\n وبه يُعرف الحلال والحرام\n وبه تُوصلَ الأرحام\n العلم إمام والعمل تابعه\n يُلْهَمُه بالسعداء\n ويُحْرَمه الأشقياء \"\n \nحال كون الحقّ تعالى { قائماً بالقسط } أي: مُدبراً لأمر خلقه بالعدل\n فيما حكم وأبرم\n { لا إله إلا هو } \n كرر الشهادة للتأكيد\n ومزيد الاعتبار بأمر التوحيد\n والحكم به\n بعد إقامته الدليل\n\nعليه وقال جعفر الصادق: الأُولى وصف وتوحيد\n والثانية رسم وتعليم\n أي: قولوا: { لا إله إلا هو } \n أو ليرتب عليه قوله: { العزيز الحكيم } \n فيعلم أنه الموصوف بهما\n وقدَّم { العزيز } ليتقدم العلم بقدرته على العلم بحكمته\n { إن الدين عند الله الإسلام } أي: إن الدين المرضى عند الله هو الانقياد لأمر التوحيد والإذعان لمن جاء به\n ورُوِيَ عن أنسَ رضي الله عنه قال: قال النبيّ صلى الله عليه وسلم:\n \" من قرأَ هذه الآيةَ عند منامه خَلَقَ اللَّهَ تعالى سبعين ألف خَلْقٍ يستغفرون الله له إلى يوم القيامة \" \nوهي أعظم شهادة في كتاب الله\n\n \" من قرأها إلى الحكيم وقال: وأنا أشهد بما شهد الله به\n وأستودِعُ اللّهَ هذه الشهادة\n وهي لي عند الله وديعة\n يقول الحق تعالى: إن لعبدي هذا عندي عهداً وأنا أحقُّ مَنْ وفى بالعهد\n أدخِلوا عبدي الجنة \"\n \nالإشارة: صدرُ الآية يشير إلى الفرق\n وعَجُزُها يشير إلى الجمع\n كما هي عادته تعالى في كتبه العزيز\n يشرع أولاً\n ويُحَقِّق ثانياً\n فأثبت الحق - جلّ جلاله - شهادة الملائكة وأولى العلم مع شهادته لإثبات سر الشريعة\n ثم محاها بقوله: { لا إله إلا هو العزيز الحكيم } بحكم الحقيقة\n فإثبات الرسوم شريعة\n ومحوها حقيقة\n فتوحيد أهل الرسوم والأشكال دلالة من وراء الحجاب\n وتوحيد أهل المحو والاضمحلال شهادة من داخل الحجاب\n وتوحيد أهل الرسوم دلالة وبرهان\n وتوحيد أهل المحو شهادة وعيان\n أهل الدليل والبرهان عموم عند أهل الشهود والعيان\n إثبات الرسوم إسلام وإيمان\n ومحوها شهود وإحسان\n وكل توحيد لم تظهر ثمرته على الجوارح من الإذعان والانقياد لأحكام العبودية فهو مخدج\n لقوله تعالى:\n[آل عِمرَان: 19] أي\n الانقياد والإذعان\n ظاهراً وباطناً\n لأحكام القهرية والتكليفية\n فمن لا انقياد له لا دين له كاملاً\n ثم ذكر من سبق له الخذلان بعد سطوع الدليل والبُرهان\n فقال: {\n\n\n وَمَا ٱخْتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ بَغْياً بَيْنَهُمْ وَمَن يَكْفُرْ بِآيَاتِ ٱللَّهِ فَإِنَّ ٱللَّهِ سَرِيعُ ٱلْحِسَابِ }  قلت: { بغياً }: مفعول له\n علة للاختلاف\n يقول الحقّ جلّ جلاله: { وما اختلف } اليهود والنصارى في حقيقة الإسلام والتدين به\n { إلا من بعد ما جاءهم العلم } أي: من بعد ما تمكنوا من العلم بصحته\n وأن الدين عند الله هو الإسلام\n فجحدوه ظلماً وحسداً\n أو ما اختلف أرباب الكتب المتقدمة في دين الإسلام فأثبته قوم\n وقال قوم: إنه مخصوص بالعرب\n ونفاه آخرون مطلقاً\n إلا من بعد ما ثبت لهم بصحته وعموم الدعوة له\n أو في التوحيد فثلث النصارى\n وقالت اليهود: عزير ابن الله\n بعد ما صح لهم العلم بالتوحيد فغيروا\n وقال الربيع: إن موسى عليه السلام لما حضره الموت\n دعا سبعين حبراً من قومه\n فاستودعهم التوراة\n فلما مضى القرن الأول والثاني والثالث وقعت بينهم الفرقة\n وهم: الذين أوتوا الكتاب من أبناء السبعين\n فأراقوا الدماء ووقع بينهم الشر والاختلاف\n\nوذلك من بعد ما جاءهم العلم\n يعني بيان ما في التوراة\n { بغياً بينهم } أي: طلباً للملك والرئاسة والتحاسد\n فسلّط عليهم الجبابرة\n { ومن يكفر بآيات الله } المنزلة على رسوله\n أو الدالة على وحدانيته\n { فإن الله سريع الحساب } لا يشغله شأن عن شأن\n وفيه تهديد لأهل الاختلاف\n الإشارة: الاختلاف على الصوفية\n والإنكار عليهم\n إن كان بغياً وحسداً وخوفاً على زوال رئاسة المنكر\n فهذا معرض لمقت الله\n فقد آذن بحرب الله\n وبالُه سوء الخاتمة\n والعياذ بالله\n وفي ذلك يقول القائل:\nوإن كان غيره على الشريعة\n وسدّاً لباب الذريعة\n فهذا معذور أو مأجور إن صح قصده\n وهو منخرط في سلك الضعفاء\n قال تعالى:\n[التوبة: 91]\n ولا ينكر على الفقير إلا المُحرَّم المجمع على تحريمه\n وليس فيه تأويل\n كالزنى بالمعينة\n واللواط وشبهه\n والمؤمن يلتمس المعاذر\n والمنافق يلتمس العيوب\n وبالله التوفيق وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:51",
      "similarity": 0.5178728472300216
    },
    {
      "verse": "40:17",
      "similarity": 0.5069030317893262
    },
    {
      "verse": "2:202",
      "similarity": 0.4743804960660953
    },
    {
      "verse": "6:62",
      "similarity": 0.4421923907663561
    },
    {
      "verse": "23:61",
      "similarity": 0.42812204030141965
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}