{
  "chapter": "آل عمران",
  "text": "ربنا وءاتنا ما وعدتنا على رسلك ولا تخزنا يوم القيمة انك لا تخلف الميعاد",
  "translations": [
    {
      "translation": "Our Lord, give us what You promised us through Your Messengers, and do not disgrace us on the Day of Rising. You do not break Your promise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give us what You promised, O Lord, through Your prophets; and put us not to shame on the Day of Reckoning, for never do You go back on Your promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, fulfil what You promised to us through Your Messengers, and disgrace us not on the Day of Resurrection; indeed You never go back on Your promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, grant us the victory that You have promised your Messenger and do not disgrace us on the Day of Judgment; You are the One who never ignores His promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O our Lord! And give us what You have promised us through Your Noble Messengers, and do not humiliate us on the Day of Resurrection; indeed You do not break the promise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Grant us what You promised us through Your Messengers and disgrace us not on the Day of Resurrection, for You never break (Your) Promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! and grant us what Thou hast promised us by Thy apostles; and disgrace us not on the day of resurrection; surely Thou dost not fail to perform the promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, give us what Thou hast promised us by Thy Messengers, and abase us not on the Day of Resurrection; Thou wilt not fail the tryst.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And give us that which Thou hast promised to us by Thy messengers. Confound us not upon the Day of Resurrection. Lo! Thou breakest not the tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Grant us what You have promised to us through Your messengers, and do not humiliate us on the Day of Resurrection. Surely, You never fail to fulfill Your promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! vouchsafe unto us that which Thou hast promised us by Thine apostles, and humiliate us not on the Day of Resurrection. Verily Thou failest not the tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, give us what You have promised us through Your apostles, and do not disgrace us on the Day of Resurrection. Indeed You do not break Your promise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Grant us what Thou didst promise unto us through Thine messengers, and save us from shame on the Day of Judgment: For Thou never breakest Thy promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Grant us what You promised unto us through Your Messengers and disgrace us not on the Day of Resurrection, for You never break (Your) Promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, give us what You promised us by Your Messengers, and do not abase us on the Day of Resurrection. You do not break Your promise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord, and give us what You have promised us through Your messengers, and do not disgrace us on the Day of Resurrection. Surely You never break a promise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:194] Our Lord, grant us what You have promised us through, the tongues of, Your messengers, in the way of mercy and favour: they are asking Him that they be made among those that deserve such a promise, for, God’s promise is fufilled regardless, but they are not certain that they are among those who deserve it. The repetition of the phrase, our Lord, is out of extreme humility; and abase us not on the Day of Resurrection. You will not fail the tryst’, the promise of Resurrection and Requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) and they say: our Lord. (And give us that which Thou hast promised to us by Thy messengers) on the tongue of Your Messenger, i.e. Muhammad. (Confound us not) torment us not (upon the Day of Resurrection) as You will torment the unbelievers. (Lo! Thou breakest not the tryst) resurrection after death and that which You have promised the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والاستقامة بالوجود الموهوب بعد التوحيد { ولا تخزنا يوم القيامة } الكبرى ووقت بروز الخلق لله الواحد القهار بالاحتجاب بالوحدة عن الكثرة\n وبالجمع عن التفصيل { إنك لا تُخْلِف الميعاد } فتبقى مقاماً وراءنا لم نصل إليه\n { فاستجاب لهم ربّهم أني لا أُضيع عمل عامل منكم من ذَكَر } القلب من الأعمال القلبية كالإخلاص واليقين والكشف { أو أنثى } النفس من الأعمال القالبية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبَّنَا } ثبتنا في مقام عبوديتك { وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ } لسان { رُسُلِكَ } من الكشوف والشهود وسائر ما جاءوا به\n وأخبروا عنه { وَلاَ تُخْزِنَا } تحرمنا { يَوْمَ ٱلْقِيَامَةِ } حين لقيناك عما وعدتنا من شرف لقائك { إِنَّكَ } بلطفك وفضلك على عبادك { لاَ تُخْلِفُ ٱلْمِيعَادَ } [آل عمران: 194] الذي وعدت من سعة رحمتك وجودك على عبادك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تخزنا يوم القيامة } أي: لا تُهِنَّا بسبب تقصيرنا\n { إنك لا تخلف الميعاد } بإثابة المؤمن وإجابة الداعي\n أو ميعاد البعث والحساب\n وتكرير { ربنا } للمبالغة في الابتهال\n والدلالة على استقلال المطالب وعلو شأنها\n ففي بعض الآثار: من حزبه أمر فقال خمس مرات: \" ربنا \" \n أنجاه الله مما يخاف\n\nقاله البيضاوي\n الإشارة: قدَّم الحق الذكر على الفكر على ترتيب السير\n فإن المريد يُؤمَر أول أَمرِهِ بذكر اللسان\n حتى يفضي إلى الجنان\n فينتقل الذكر إلى القلب\n ثم إلى الروح\n وهو الفكر\n ثم إلى السر\n وهو الشهود والعيان\n وهنا يخرس اللسان\n ويغيب الإنسان في أنوار العيان\n وفي ذلك يقول القائل:\nفإذا بلغ العبد هذا المقام - الذي هو مقام الإفراد - اتحدت عنده الأوراد\n وصار ورداً واحداً\n وهو عكوف القلب في الحضرة بين فكرة ونظرة\n أو إفراد القلب بالله\n وتغيبه عما سواه\n قال في الإحياء في كتاب الأوراد: الموحد المستغرق الهم بالواحد الصمد\n الذي أصبح وهمومه هم واحد\n فلا يحب إلا الله\n ولا يخاف إلا منه\n ولا يتوقع الرزق من غيره\n ولا ينظر في شيء إلا يرى الله فيه\n فمن ارتفعت رتبته إلى هذه الدرجة\n لم يفتقر إلى ترتيب الأوراد واختلافها\n بل ورده بعد المكتوبات ورد واحد\n وهو حضور القلب مع الله في كل حال\n فلا يخطر بقلبه أمر\n ولا يقرع سمعه قارع\n ولا يلوح لنظره لائح\n إلاَّ كان له فيه عبرة وفكرة ومزيد\n فلا محرك ولا مسكن إلا الله\n فهؤلاء جميع أحوالهم تصلح أن تكون سبباً لازديادهم\n فلا تتميز عندهم عبادة عن عبادة\n وهم الذين فرّوا إلى الله كما قال تعالى: { ففرّوا إلى الله } \n وتحقق فيهم قوله: { إني ذاهب إلى ربي } \n وهذه الدرجة منتهى درجة الصديقين\n ولا ينبغي أن يغتر المريد بما يسمعه من ذلك\n فيدعيه لنفسه\n ويفتر عن وظائف عباداته\n فذلك علامته ألا يحس في قلبه وسواساً\n ولا يخطر بقلبه معصية\n لا يزعجه هواجم الأحوال\n ولا يستفزه عظائم الأشغال\n وأنى تكون هذه المرتبة!\n هـ\n قلت: قوله: [لا يخطر بقلبه معصية] غير لازم لأن قلب العارف مرسى للتجليات النورانية والظلمانية لكنها تقل ولا تسكن\n وقال في موضع آخر: وأما عبادة ذوي الألباب فلا تجاوز ذكر الله تعالى والفكر فيه حُبّاً لجلاله وجماله\n وسار الأعمال تكون مؤكدات\n قال: والعامل لأجر الجنة درجته درجة البُلْه\n وإنه لينالها بعمله إذ أكثر أهل الجنة البله\n هـ\n وقال في كتاب كيمياء السعادة: وقد غلط من ظن أن وظائف الضعفاء كوظائف الأقوياء\n حتى قال بعض مشايخ الصوفية: من رأني في الابتداء\n قال: صار صديقاً\n ومن رآني في الانتهاء\n قال: صار زنديقاً\n يعني أن الابتداء يقتضي المجاهدة الظاهرة للأعين بكثرة العبادات\n وفي الانتهاء يرجع العمل إلى الباطن\n فيبقى القلب على الدوام في عين الشهود والحضور\n وتفتر ظواهر الأعضاء\n فيظن أن ذلك تهاون بالعبادة\n وهيهات هيهات!!\n فذلك استغراق لمخ العبادات ولبابها وغياتها\n ولكن أعين الخفافيش تكل عن درك نور الشمس\n\nهـ\n قال شيخ شيوخنا - سيدي عبد الرحمن العارف - بعد نقل كلام القشيري في هذا المعنى: وما أشار إليه ظاهر في أن أهل القلوب لا يتعاطون كل طاعة\n وإنما يتعاطون من الطاعات ما يجمعهم ولا يفرقهم\n ولذلك قال الجنيد: أحب للصوفي ألا يقرأ ولا يكتب لأنه أجمع لهمه\n قال: وأحب للمريد ألا يشتغل بالتكسب وطلب الحديث لئلا يتغير حاله\n هـ\n قلت: ومن رزقه الله شيخ التربية فما عيَّنه له فهو عين ذكره\n يسير به كيفما كان\n هذا ما يتعلق بحال الذكر الذي قدَّمه الله تعالى\n وأما التفكر فهو أعظم العبادات وأفضل القربات\n هو عبادة العارفين ومنتهى المقربين\n وفي الخبر: \" تفكرُ سَاعةٍ أفضَل مِنْ عَبَادَةِ سبعينَ سَنة \"\n وقال الجنيد رضي الله عنه: أشرف المجالس وأعلاها: الجلوس مع الفكرة في ميدان التوحيد\n والتنسم بنسيم المعرفة\n والشرب بكأس المحبة من بحر الوداد\n والنظر لحسن الظن بالله تعالى\n ثم قال: يا لها من مجالس\n ما أجلها\n ومن شرابٍ ما ألذه\n طوبى لمن رزقه\n وقال القشيري رضي الله عنه التفكر نعت كل طالب\n وثمرته: الوصول بشرط العلم\n فإذا سلم الفكر عن الشوائب ورد صاحبهُ على مناهل التحقيق\n هـ\n وسئلت زوجة أبي ذر عن عبادة زوجها\n فقالت: كان نهاره أجمع في ناحية يتفكر\n وكذلك زوجة أبي بكر قالت: كان ليله أجمع في ناحية يتفكر\n وكذا زوجة أبي الدرداء\n وكان سيدنا عيسى عليه السلام يقول: طوبى لمن كان قيله ذكراً وصمته تفكراً\n ونظره عبرة\n وقال الحسن رضي الله عنه: من لم يكن كلامه حكمة فهو لغو\n ومن لم يكن سكوته تفكراً فهو سهو\n ومن لم يكن نظره اعتباراً فهو لهو\n هـ\n وقال في الحكم: \" ما نفع القلب شيء مثل عزلة يدخل بها ميدان فكرة \"\n وقال أيضاً: \" الفكرة سراج القلب\n فإذا ذهبت فلا إضاءة له \"\n وقال أيضاً: \" الفكرة فكرتان فكرة تصديق وإيمان\n وفكرة شهود وعيان\n فالأولى لأرباب الاعتبار\n والثانية لأرباب الشهود والاستبصار \"\n وفكرة الشهود والعيان هي عبادة العارفين\n ولا يُحصر ثوابها في ستين ولا في سبعين\n بل وقت منها يعدل ألف سنة\n كما قال الشاعر:\nفأوقات هؤلاء كلها ليلة القدر\n ومن لم يبلغ هذا المقام فليبك على نفسه على الدوام\n ومن ظفر بها ونالها حق له الهناء\n وفي أمثاله قال القائل:\nحققنا الله بمقامهم\n وسقانا من منالهم\n آمين\n وقوله: { ربنا ما خلقت هذا باطلاً } بل هو ثابت بإثباتك\n مَمْحُوٍّ بأحدية ذاتك\n فالباطل محال\n وكل ما سواه باطل\n كما قرره الرسول - عليه الصلاة والسلام\n وقوله: { ربنا إننا سمعنا منادياً ينادي للإيمان أن آمنوا بربكم فآمنا } أي: كنا في الرعيل الأول من أهل الإيمان\n فجعل لنا سبيلاً إلى مقام الإحسان\n { ربنا وآتنا ما وعدتنا } وهو الوصول إلى العيان\n وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:69",
      "similarity": 0.7228448782747355
    },
    {
      "verse": "26:87",
      "similarity": 0.6852169042762853
    },
    {
      "verse": "39:40",
      "similarity": 0.6466551816640101
    },
    {
      "verse": "3:192",
      "similarity": 0.6147102687127765
    },
    {
      "verse": "11:39",
      "similarity": 0.5487379672255966
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003194.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003194.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:194.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}