{
  "chapter": "آل عمران",
  "text": "لكن الذين اتقوا۟ ربهم لهم جنت تجرى من تحتها الانهر خلدين فيها نزلا من عند الله وما عند الله خير للابرار",
  "translations": [
    {
      "translation": "But those who have taqwa of their Lord will have Gardens with rivers flowing under them, remaining in them timelessly, for ever: hospitality from Allah. What is with Allah is better for those who are truly good.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are pious and obedient to their Lord, will have gardens with streams of running water where they will abide as guests of God; and what is with God is best for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear their Lord: theirs shall be the gardens beneath which rivers flow and in which they will live forever: a hospitality from Allah Himself, And Allah's reward is best for the truly pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have fear of their Lord, there will be gardens wherein streams flow and they will live therein forever as a gift from their Lord. God has the best reward for the virtuous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for those who fear their Lord are Gardens beneath which rivers flow – abiding in it for ever – the hospitality from their Lord; and that which is with Allah, is the best for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, for those who have Taqwa of their Lord, are Gardens under which rivers flow (in Paradise); therein are they to dwell, an entertainment from Allah; and that which is with Allah is the best for Al-Abrar (the most righteous).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as to those who are careful of (their duty to) their Lord, they shall have gardens beneath which rivers flow, abiding in them; an entertainment from their Lord, and that which is with Allah is best for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who fear their Lord - for them shall be gardens underneath which rivers flow, therein dwelling forever -- a hospitality God Himself offers; and that which is with God is better for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who keep their duty to their Lord, for them are Gardens underneath which rivers flow, wherein they will be safe for ever. A gift of welcome from their Lord. That which Allah hath in store is better for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who fear their Lord shall have gardens through which rivers flow, wherein they will abide forever: and a goodly welcome from their Lord. God's recompense is best for the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as to those who fear their Lord, theirs shall be Gardens whereunder rivers flow; they shall be abiders therein: an entertainment from before their Lord; and that which is with Allah it still better for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are wary of their Lord—for them shall be gardens with streams running in them, to remain in them [forever], a hospitality from Allah; and what is with Allah is better for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the other hand, for those who fear their Lord, are Gardens, with rivers flowing beneath; therein are they to dwell (for ever),- a gift from the presence of Allah; and that which is in the presence of Allah is the best (bliss) for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, for those who fear their Lord, are Gardens under which rivers flow (in Paradise); therein are they to dwell (for ever), an entertainment from Allah; and that which is with Allah is the Best for Al-Abrar (those who are obedient to Allah and follow strictly His Orders).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for those who fear their Lord, for them shall be Gardens underneath which rivers flow, there they shall live for ever, a (goodly) hosting from Allah, and that which is with Allah is better for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who feared their Lord: for them will be gardens beneath which rivers flow, wherein they will abide forever—hospitality from God. What God possesses is best for the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who feared their Lord will have gardens beneath which rivers flow, abiding eternally therein, as accommodation from Allah. And that which is with Allah is best for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:198] But those who fear their Lord — for them shall be Gardens underneath which rivers flow, abiding, that is, it is decreed for them to abide, therein; a hospitality (nuzul is what is prepared for a guest; it is in the accusative [nuzulan] because it is a circumstantial qualifier referring to jannāt, ‘gardens’, and its operator is the import of the adverbial phrase) from God Himself. That which is with God, in the way of reward, is better for the pious, than the enjoyment of this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "80 (But those who keep their duty to their Lord) Allah says: and those who believe in the divine Oneness of their Lord by repenting from disbelief, (for them are Gardens beneath which) beneath its trees and habitations (rivers) of wine, water, honey and milk (flow, wherein they will be safe for ever) they dwell therein for eternity, never to die or to leave it. (A gift of welcome) a reward (from their Lord. That which Allah hath in store) in terms of reward (is better for the righteous) for those who declare Allah's divine Oneness than that which He has given the unbelievers in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نُزُلاً مِّنْ عِندِ ٱللَّهِ } معناهُ ثَوابٌ عِنْدَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"a reward from Allah,\" means a reward with Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَكِنِ ٱلَّذِينَ ٱتَّقَوْاْ رَبَّهُمْ } عن الاشتغال بزخرفة الدنيا وأمتعتها\n منيبين إليه\n متوجهين نحوه { لَهُمْ } عنده { جَنَّاتٌ } منتزها من اللذة الروحانية { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } من العلوم الدينية { خَالِدِينَ فِيهَا نُزُلاً مِّنْ عِندِ ٱللَّهِ } حين وصلوا إليه { وَ } اعلموا أيها المؤمنون { مَا عِندَ ٱللَّهِ } من المثوبات المستمرة واللذات الدائمة { خَيْرٌ لِّلأَبْرَارِ } [آل عمران: 198] المتوجهين إلى دار القرار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وانتصابه: على الحال من { جنات } \n والعامل فيه: الظرف\n أو على المصدر المؤكد\n أي: أُنزلوها نزلاً\n يقول الحقّ جلّ جلاله: { لا يغرنك } أيها السامع أو أيها الرسول\n والمراد: تثبيته على ما كان عليه\n كقوله: { فلا تطع المكذبين } \n أي: دم على ما أنت عليه من عدم اغترارك بظاهر ما ترى عليه الكفار من البسط في الدنيا\n والتقلب فيها بالتجارات والزراعات\n وما هم عليه من الخصب ولين عيش\n فإن ذلك { متاع قليل } بلغة فانية\n ومتعة زائلة\n وظلال آفلة\n وسحابة حائلة\n قال صلى الله عليه وسلم:\n \" ما الدُّنْيا في الآخِرَةِ إلاَّ مِثْلُ ما يَجْعَلُ أَحَدُكُم إصْبَعَهِ في اليَمِّ\n فَلْيَنْظُر بِمَ يَرْجِعَ \" \nفلا بد أن يرحلوا عنها قهراً\n { ثم مأواهم } أي: مصيرهم { جهنم وبئس المهاد } ما مهدوا لأنفسهم\n والمعتبر عند الأكياس هو ما أعد الله للمتقين من الناس\n قال تعالى: { لكن الذين اتقوا ربهم } وخافوا عقابه\n { لهم جنات تجري من تحتها الأنهار خالدين فيها } \n هيأ ذلك لهم وأعده { نزلاً من عند الله } هذا النزول الذي يقدم للضيف\n وأما ما أعد لهم بعد النزول فلا يُعتبر عن لسان\n ولذلك قال: { وما عند الله } من النعيم الذي لا يفنى\n جسماني وروحاني\n { خير للأبرار } مما ينقلب إليه الفجار\n قيل: حقيقة البر: هو الذي لا يؤذي الذر\n الإشارة: لا يغرنك أيها الفقير ما ترى عليه أهل الدنيا من اتخاذ المنازل المشيدة\n والفرش الممهدة\n فإن الدنيا متاعها قليل\n وعزيزها قليل\n وغنيها فقير\n وكبيرها حقير\n واعتبر بحال نبيك - عليه الصلاة والسلام\n قال أنس رضي الله عنه: دَخلتُ علَى النبيّ صلى الله عليه وسلم وهُو على سَرِير مرفل بالشريط - أي: مضفور به - وتحت رَأسِهِ وسَادَةٌ من أَدَم\n حَشْوُهَا لِيفٌ\n فدل عليه عمر\n وانحرف النبيّ صلى الله عليه وسلم انحرافة\n فرأى عمر الشريط في جَنْبِهِ\n فَبكَى\n فقال له النبيّ صلى الله عليه وسلم:\n \" ما يُبْكِيكَ يا عمر \" \n؟ فقال: مَالِيَ لا أبْكِي وكِسْرى وقَيْصَرُ يعيشان فيما يعيشان فيه من الدنيا\n وأنت على الحال الذي أرى\n فقال له النبيّ صلى الله عليه وسلم:\n \" يا عمر أمَا تَرْضَى أَنْ تَكُونَ لهُم الدُّنيا وَلَنا الآخرَةُ \" \nرواه البخاري\n وانظر ما أعدّ الله للمتقين الأبرار\n الذين صبروا قدر ساعة من نهار\n فأفضوا إلى جوار الكريم الغفار في دار القرآن\n { وما عند الله خير للأبرار } \n ولا سيما العارفين الكبار\n قال الورتجبي: بيِّن الحق - تعالى - رفعة منزل المتقين في الجنان\n ثم أبْهم لطائف العناية بقوله: { وما عند الله خير للأبرار } أي: ما عنده من نعيم المشاهدة\n ولطائف القربة\n وحلاوة الوصلة\n خير مما هم فيه من نعيم الجنة\n وأيضاً: صرح في هذه الآية ببيان مراتب الولاية\n لأنه ذكر المتقين\n والتقوى: تقديس الباطن عن لوث الطبيعة\n وتنزيه الأخلاق عن دنس المخالفة\n وذلك درجة الأولى من الولاية\n والأبرار أهل الاستقامة في المعرفة\n وبين أن أهل التقوى في الجنة\n والأبرار في الحضرة\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:136",
      "similarity": 0.568549658647452
    },
    {
      "verse": "14:23",
      "similarity": 0.5519555543356947
    },
    {
      "verse": "3:15",
      "similarity": 0.5461771416505898
    },
    {
      "verse": "10:9",
      "similarity": 0.5294968316545394
    },
    {
      "verse": "48:5",
      "similarity": 0.5265250232573858
    }
  ]
}