{
  "chapter": "آل عمران",
  "text": "ربنا اننا سمعنا مناديا ينادى للايمن ان ءامنوا۟ بربكم فـامنا ربنا فاغفر لنا ذنوبنا وكفر عنا سيـاتنا وتوفنا مع الابرار",
  "translations": [
    {
      "translation": "Our Lord, we heard a caller calling us to iman: \"Have iman in your Lord!\" and we had iman. Our Lord, forgive us our wrong actions, erase our bad actions from us and take us back to You with those who are truly good.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have heard, O our Lord, the crier call inviting us to faith (and announcing): 'Believe in your Lord.' O our Lord, to faith we have come, so forgive our trespasses, deliver us from sin, and grant us (the glory of) death with the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Indeed we heard a crier calling to the faith saying: \"Believe in your Lord\"; so we did believe. Our Lord, forgive us our sins, and wipe out our evil deeds and make us die with the truly pious.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, we have heard the person calling to the faith and have accepted his call. Forgive our sins, expiate our bad deeds, and let us die with the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O our Lord! We have heard a proclaimer calling towards faith, (saying) ‘Believe in your Lord’ so we have accepted faith; Our Lord! Therefore forgive us our sins, and wipe out our evil deeds, and make us die among the virtuous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Verily, we have heard the call of one calling to faith: `Believe in your Lord,' and we have believed. Our Lord! Forgive us our sins and expiate from us our evil deeds, and make us die along with Al-Abrar (the most righteous).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! surely we have heard a preacher calling to the faith, saying: Believe in your Lord, so we did believe; Our Lord! forgive us therefore our faults, and cover our evil deeds and make us die with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, we have heard a caller calling us to belief, saying, \"Believe you in your Lord!\" And we believe. Our Lord, forgive Thou us our sins and acquit us of our evil deeds, and take us to Thee with the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Lo! we have heard a crier calling unto Faith: \"Believe ye in your Lord!\" So we believed. Our Lord! Therefor forgive us our sins, and remit from us our evil deeds, and make us die the death of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, we have heard a caller calling to the true faith saying, \"Believe in your Lord,\" and we believed. Lord, forgive us our sins and remove from us our bad deeds and make us die with the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord verily we heard a caller calling to belief: believe in your Lord, wherefore we have come to believe. Our Lord forgive us our sins, and expiate from us our misdeeds, and let us die along with the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, we have indeed heard a summoner calling to faith, declaring, ‘‘Have faith in your Lord!’’ So we believed. Our Lord, forgive us our sins and absolve us of our misdeeds, and make us die with the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! we have heard the call of one calling (Us) to Faith, 'Believe ye in the Lord,' and we have believed. Our Lord! Forgive us our sins, blot out from us our iniquities, and take to Thyself our souls in the company of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Verily, we have heard the call of one (Muhammad SAW) calling to Faith: 'Believe in your Lord,' and we have believed. Our Lord! Forgive us our sins and remit from us our evil deeds, and make us die in the state of righteousness along with Al-Abrar (those who are obedient to Allah and follow strictly His Orders).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, we have heard the caller calling to belief, \"Believe in your Lord!\" So we believe. Our Lord, forgive us our sins and acquit us of our evil deeds, and take us to You in death with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord, we have heard a caller calling to the faith: `Believe in your Lord,' and we have believed. Our Lord! Forgive us our sins, and remit our misdeeds, and make us die in the company of the virtuous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:193] Our Lord, we have heard a caller calling, summoning people, to belief (li’l-īmān means ilā l-īmān) and this is Muhammad (s), or [summoning them] to the Qur’ān, saying, that, “Believe in your Lord!” And we believed, in Him. So, our Lord, forgive us our sins and absolve us of, conceal, our evil deeds, and so do not make them manifest by punishing us for them, and take us [in death], receive our spirits together, with the pious, the prophets and the righteous.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) they say: our Lord. (Lo! we have heard a crier) they mean Muhammad (calling unto Faith) calling to Allah's divine Oneness: (\"Believe ye in your Lord!\" So we believed) in You, in Your Scripture as well as in Your Messenger. (Our Lord! Therefore forgive us our sins) our enormities, (and remit from us) overlook (our evil deeds) other than enormities, (and make us die the death of the righteous) take our souls to You in a state of faith and gather them with the souls of the prophets and the righteous.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَّبَّنَآ إِنَّنَآ سَمِعْنَا مُنَادِياً } مشفقاً، هادياً، مرشداً؛ إذ هو { يُنَادِي } ويرشد { لِلإِيمَانِ } بتوحيدك قائلاً: { أَنْ آمِنُواْ } أيها التائهون في ظلمة الإمكان { بِرَبِّكُمْ } الذي رباكم بنور الوجود { فَآمَنَّا } فامتثلنا أمره يا { رَبَّنَا } فتحققنا بإرشاده في مرتبة اليقين العلمي بوحدة ذاتك، وبعد تحققننا فيها { فَٱغْفِرْ } استر { لَنَا ذُنُوبَنَا } أنانيتنا التي صرنا بها محرومين عن ساحة حضورك، حتى يتحقق بلطفك وتوفيقك في مرتبة اليقين العيني بمعاينة ذاتك { وَ } بعد تحققنا فيها { كَفِّرْ } طهِّر { عَنَّا سَيِّئَاتِنَا } أوصافنا التي تُشعر بالاثنينية بالكلية، حتى نتحقق بفضلك وجودك في مرتبة اليقين الحقي { وَ } بعد ذلك { تَوَفَّنَا } في فضاء الفناء { مَعَ ٱلأَبْرَارِ } [آل عمران: 193] الفانين في الله، الباقين ببقائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربنا إننا سمعنا منادياً ينادي للإيمان } ، وهو الرسول العظيم الشأن، أو القرآن قائلا: { أن آمنوا بربكم } ووحدوه، فأجبنا نداءه وآمنا، { ربنا فاغفر لنا ذنوبنا } الكبائر، { وكفر عنا سيئاتنا } الصغائر، { وتوفنا مع الأبرار } المصطفين الأخيار، مخصوصين بصحبتهم، معدودين في زمرتهم، وفيه تنبيه على أنهم يُحبون لقاء الله فأحب الله لقاءهم، { ربنا وآتنا ما وعدتنا على } تصديق { رسلك } من الثواب، أو على ألسنة رسلك من الفضل والرحمة وحسن المآب، سألوا ما وُعدوا على الامتثال، لا خوفاً من إخلاف الوعدن بل مخافة ألاَّ يكونوا موعودين لسوء عاقبة، أو قصور في الامتثال، أو تعبداً، أو استكانة\n قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:16",
      "similarity": 0.40023794520660905
    },
    {
      "verse": "82:13",
      "similarity": 0.39729322792119587
    },
    {
      "verse": "83:22",
      "similarity": 0.39729322792119587
    },
    {
      "verse": "52:28",
      "similarity": 0.3825748656047676
    },
    {
      "verse": "2:224",
      "similarity": 0.3718073373836003
    }
  ]
}