{
  "chapter": "آل عمران",
  "text": "الذين يذكرون الله قيما وقعودا وعلى جنوبهم ويتفكرون فى خلق السموت والارض ربنا ما خلقت هذا بطلا سبحنك فقنا عذاب النار",
  "translations": [
    {
      "translation": "those who remember Allah, standing, sitting and lying on their sides, and reflect on the creation of the heavens and the earth: 'Our Lord, You have not created this for nothing. Glory be to You! So safeguard us from the punishment of the Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who honour God in meditation, standing or sitting or lying on their sides, who reflect and contemplate on the creation of the heavens and the earth, (and say) \"Not in vain have You made them. All praise be to You, O Lord, preserve us from the torment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who remember Allah while standing, sitting or (reclining) on their backs, and reflect in the creation of the heavens and the earth, (saying): 'Our Lord! You have not created this in vain. Glory to You! Save us, then, from the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is these who commemorate God while standing, sitting, or resting on their sides and who think about the creation of the heavens and the earth and say, \"Lord, you have not created all this without reason. Glory be to you. Lord, save us from the torment of the fire\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember Allah while standing, and sitting, and reclining on their sides, and ponder about the creation of the heavens and the earth; “O our Lord! You have not created this without purpose; Purity is to You, therefore save us from the punishment of fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember Allah standing, sitting, and lying down on their sides, and think deeply about the creation of the heavens and the earth, (saying): \"Our Lord! You have not created this without purpose, glory to You! Give us salvation from the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember Allah standing and sitting and lying on their sides and reflect on the creation of the heavens and the earth: Our Lord! Thou hast not created this in vain! Glory be to Thee; save us then from the chastisement of the fire:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who remember God, standing and sitting and on their sides, and reflect upon the creation of the heavens and the earth: 'Our Lord, Thou hast not created this for vanity. Glory be to Thee! Guard us against the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such as remember Allah, standing, sitting, and reclining, and consider the creation of the heavens and the earth, (and say): Our Lord! Thou createdst not this in vain. Glory be to Thee! Preserve us from the doom of Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who remember God while standing, sitting and [lying] on their sides, and who ponder over the creation of the heavens and the earth, saying, \"Lord, You have not created all this without purpose. Glory be to You! Save us from the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who remember- Allah Standing and sitting and lying on their sides, and reflect on the creation of the heavens and the earth: our Lord Thou createdest not all this in vain. Hallowed be Thou! Save us, Thou, from the torment of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember Allah standing, sitting, and lying on their sides, and reflect on the creation of the heavens and the earth [and say], ‘Our Lord, You have not created this in vain! Immaculate are You! Save us from the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men who celebrate the praises of Allah, standing, sitting, and lying down on their sides, and contemplate the (wonders of) creation in the heavens and the earth, (With the thought): \"Our Lord! not for naught Hast Thou created (all) this! Glory to Thee! Give us salvation from the penalty of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember Allah (always, and in prayers) standing, sitting, and lying down on their sides, and think deeply about the creation of the heavens and the earth, (saying): \"Our Lord! You have not created (all) this without purpose, glory to You! (Exalted be You above all that they associate with You as partners). Give us salvation from the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember Allah when standing, sitting, and on their sides, and contemplate upon the creation of the heavens and the earth (saying:) 'Lord, You have not created these in falsehood. Exaltations to You! Guard us against the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remember God while standing, and sitting, and on their sides; and they reflect upon the creation of the heavens and the earth: “Our Lord, You did not create this in vain, glory to You, so protect us from the punishment of the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who remember Allah while standing or sitting or [lying] on their sides and give thought to the creation of the heavens and the earth, [saying], \"Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:191] Those who (alladhīna, an adjectival qualification of the preceding [li-ūlī l-albāb, ‘for people of pith’], or a substitution for it) remember God, standing and sitting and on their sides, reclining, that is to say, in all states: [it is reported] from Ibn ‘Abbās that they perform prayer in these ways, [each] according to [his own] capacity; and reflect upon the creation of the heavens and the earth, to deduce therefrom the power of their Creator, saying: ‘Our Lord, You have not created this, creation that we see, in vain (bātilan, a circumstantial qualifier), frivolously, but as a proof of the totality of Your power. Glory be to You!, exalted above any frivolity. So guard us against the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nو { يذكرون الله } إمّا من الذِّكر اللساني وإمّا من الذُّكر القلبي وهو التفكّر ، وأراد بقوله : { قياماً وقعوداً وعلى جنوبهم } عموم الأحوال كقولهم : ضَربه الظهرَ والبطْن ، وقولهم : اشتهر كذا عند أهل الشرق والغرب ، على أنّ هذه الأحوال هي متعارَف أحوال البشر في السلامة ، أي أحوال الشغل والراحة وقصد النوم . وقيل : أراد أحوال المصلّين : من قادر ، وعاجز ، وشديد العجز . وسياق الآية بعيد عن هذا المعنى .وقوله : { ويتفكرون في خلق السموات والأرض } عطف مرادف إن كان المراد بالذكر فيما سبق التفكّر ، وإعادتُه لأجل اختلاف المتفكَّر فيه ، أو هو عطف مغاير إذا كان المراد من قوله : { يذكرون } ذِكر اللسان . والتفكّر عبادة عظيمة . روى ابن القاسم عن مالك رحمه الله في جامع العتبية قال : قيل لأمّ الدرداء : ما كان شأن أبي الدرداء؟ قالت : كان أكثر شأنه التفكّر ، قيل له : أترى التفكّر عَمَلاً من الأعمال؟ قال : نعم ، هو اليقين .{ والخلق } بمعنى كيفية أثر الخلق ، أو المخلوقات التي في السماء والأرض ، فالإضافة إمّا على معنى اللام ، وإمّا على معنى ( في ) .وقوله : { ربنا ما خلقت هذا باطلاً } وما بعده جملة واقعة موقع الحال على تقدير قَوْلٍ : أي يتفكّرون قائلين : ربّنا إلخ لأنّ هذا الكلام أريد به حكاية قولهم بدليل ما بعده من الدعاء .فإن قلت : كيف تواطأ الجمع من أولي الألباب على قول هذا التنزيه والدعاء عند التفكّر مع اختلاف تفكيرهم وتأثّرهم ومقاصدهم . قلت : يحتمل أنّهم تلقَّوه من رسول الله صلى الله عليه وسلم فكانوا يلازمونه عند التفكّر وعقبَه ، ويحتمل أنّ الله ألهمهم إيّاه فصار هجيراهم مثلَ قوله تعالى :\n\n",
      "translations": [
        {
          "translation": "(Such as remember Allah) pray to Allah, (standing) when they are able to, (sitting) when they cannot stand, (and reclining) when they can neither stand nor sit, (and consider) the marvellous things which are contained in (the creation of the heavens and the earth, (and say): Our Lord) they say: our Lord! (Thou createdst not this in vain) for nothing. (Glory be to Thee!) exalt Allah [from any thought that He created them in vain]. (Preserve us from the doom of Fire) drive away from us the torment of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم: { ٱلَّذِينَ يَذْكُرُونَ ٱللَّهَ } المتوحد في ذاته في جميع حالالتهم { قِيَاماً } قائمين { وَقُعُوداً } قاعدين { وَعَلَىٰ جُنُوبِهِمْ } مضطجعين\n متكئين { وَيَتَفَكَّرُونَ } دائماً { فِي خَلْقِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } إلى أن سكروا\n وترقى سكرهم إلآ ان تحيروا\n بعد تحيرهم استغرقوا\n وبعدما استغرقوا تاهوا\n وبعدما تاهوا فاتوا\n وحينئذ انقطع سيرهم\n فمنهم من تمكن في تلك المرتبة واستقر عليها\n ومنهم من صحى عن سكره ورجع إلى بدنه مستكملاً\n قائلاً: { رَبَّنَآ مَا خَلَقْتَ هَذا } المحسوس\n المُشَاهد { بَاطِلاً } بلا طائل { سُبْحَانَكَ } ننزهك يا ربنا عن مدركات عقولننا وحواسنا { فَقِنَا } واحفظنا بلطفك { عَذَابَ النَّارِ } [آل عمران: 191] التي هي غفلتنا من مطالعة وجهك الكريم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: في وصف أولي الألباب: هم { الذين يذكرون الله قياماً وقعوداً وعلى جنوبهم } \n أي: يذكرونه على الدوام\n قائمين وقاعدين ومضطجعين\n وعنه - صلى الله عليه وسلم -:\n \" منْ أرادَ أن يَرْتَع في رِيَاضِ الجَنة فليُكثْر ذِكرَ الله \" \nوقيل: يُصلّون على الهيئات الثلاث\n حسب الطاعة لقوله عليه الصلاة والسلام لعمران بن حصين\n وكان مريضاً:\n \" صَلِّ قائِماً\n فإِنْ لَمْ تَسْتَطْع فقاعِداً\n فإنْ لَمْ تَستطِعْ فعلى جَنْبِكَ وتُومئ إيماء \"\n \n{ ويتفكرون في خلق السماوات والأرض } استدلالاً واعتباراً\n وهو أفضل العبادات قال صلى الله عليه وسلم:\n \" لا عبادة كالتفكر \" \nلأن المخصوص بالقلب\n والمقصود من الخلق\n وعنه صلى الله عليه وسلم:\n \" بينَمَا رجلٌ مُسْتَلقٍ على فِرَاشهِ فَنَظَر إلى السماءِ والنُجومِ\n فَقَال: أشْهدُ أن لَكِ خَالِقًَ\n اللُهمَّ اغفرْ لي\n فَنَظَر اللّهُ إِليه فَغَفر لَهْ \" \nوهذا دليل واضح على شرف علم الأصول وفضل أهله\n قاله البيضاوي\n وسيأتي مزيد من كلام على التفكر في الإشارة إن شاء الله\n فلما تفكروا في عجائب المصنوعات\n قالوا: { ربنا ما خلقت هذا باطلاً } أي: عبثاً من غير حكمة\n بل خلقته لحكمة بديعة\n من جملتها: ان يكون مبدأ لوجود الإنسان\n وسبباً لمعاشه\n ودليلاً يدله على معرفتك ويحثه على طاعتك\n لينال الحياة الأبدية\n والسعادة السرمدية في جوارك\n { سبحانك } تنزيهاً لك من العبث وخلق الباطل\n { فَقِنَا عذابَ النار } التي استحقها من أعرض عن النظر والاعتبار\n وأخلّ بما يقتضيه من أحكام الواحد القهار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:13",
      "similarity": 0.4216220802461824
    },
    {
      "verse": "74:18",
      "similarity": 0.41529326312071935
    },
    {
      "verse": "30:8",
      "similarity": 0.4152824803161899
    },
    {
      "verse": "7:184",
      "similarity": 0.38073153011748095
    },
    {
      "verse": "30:21",
      "similarity": 0.36386982218703956
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003191.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003191.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:191.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}