{
  "chapter": "آل عمران",
  "text": "ان فى خلق السموت والارض واختلف اليل والنهار لءايت لاو۟لى الالبب",
  "translations": [
    {
      "translation": "In the creation of the heavens and the earth, and the alternation of night and day, there are Signs for people with intelligence:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the creation of the heavens and the earth, the alternation of night and day, are signs for the wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in the creation of the heavens and the earth, and in the alternation of night and day, there are signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth and the alternation of the day and the night are evidence (of the existence of God) for people of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly in the creation of the heavens and the earth and the alternation of night and day are signs for the intelligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in the creation of the heavens and the Earth, and in the alternation of night and day, there are indeed signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely in the creation of the heavens and the earth and the alternation of the night and the day there are signs for men who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in the creation of the heavens and earth and in the alternation of night and day there are signs for men possessed of minds\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! In the creation of the heavens and the earth and (in) the difference of night and day are tokens (of His Sovereignty) for men of understanding,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are signs in the creation of the heavens and the earth, and in the alternation of night and day for people of understanding;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in the creation of the heavens and the earth and in the alter nation of the night and the day are signs Unto the men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in the creation of the heavens and the earth and the alternation of night and day, there are signs for those who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! in the creation of the heavens and the earth, and the alternation of night and day,- there are indeed Signs for men of understanding,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! In the creation of the heavens and the earth, and in the alternation of night and day, there are indeed signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in the creation of the heavens and the earth, and in the alternation of night and day, there are signs for those with minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the creation of the heavens and the earth, and in the alternation of night and day, are signs for people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:190] Surely in the creation of the heavens and the earth, and the marvels contained in them, and in the alternation of night and day, coming and going, increasing and diminishing, there are signs, indications of God’s power, for people of pith, for people possessing intellects.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then exposited on the sign of His ability to the unbelievers of Mecca when they said: \"0 Muhammad, bring us a clear sign to prove what you are saying\", saying: (Lo! In the creation of the heavens) in that which We created in the heavens of angels, the sun, moon, stars and clouds (and the earth) and in the creation of the earth and what is in it of mountains, seas, trees and beasts (and (in) the difference of night and day) and in the alternation of day and night (are tokens (of His sovereignty)) signs of His divine Oneness (for men of understanding) for those among them who have reasons, 79\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إن في خلق السماوات والأرض } وأظهارهما للعيان، لَدلائل واضحة على وجود الصانع، وكمال قدرته، وعلمه، لذوي العقول الكاملة الصافية، الخالصة من شوائب الحس والوهم. قال البيضاوي: ولعل الاقتصار على هذه الثلاثة في هذه الآية لأن مناط الاستدلال هو التغير، وهذه متعرضة لجملة أنواعه، فإنه - أي التغير - إما أن يكون في ذات الشيء، كتغير الليل والنهار، أو جزئه، كتغير الناميات بتبدل صورها، أو لخارج عنها، كتغير الأفلاك بتبدل أوضاعها، وعن النبيّ صلى الله عليه وسلم:\n \" وَيْلٌ لمن قَرَأَهَا ولَمْ يَتَفَكَرْ فِيْهَا \". \nالإشارة: الخلق هو الاختراع والإظهار، فإظهار هذه التجليات الأربعة يدل على الحقّ - تعالى - تجلى لعباده بين الضدين، بين النور والظلمة، بين القدرة والحكمة، بين الحس والمعنى، وهكذا خلق من كل زوجين اثنين، ليقع الفرار من إثنينية حسهما إلى فردية معناهما، ففرّوا إلى الله، فالسماوات والنهار نورانيان، والأرض والليل ظلمانيان، ففي ذلك دلالة على وحدة المعاني، فلا تقف مع الأواني، وخُض بحر المعاني، لعلك تراني. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.7332603326697563
    },
    {
      "verse": "39:18",
      "similarity": 0.6682891753038603
    },
    {
      "verse": "2:269",
      "similarity": 0.6514786357778746
    },
    {
      "verse": "14:52",
      "similarity": 0.5956921092524121
    },
    {
      "verse": "65:10",
      "similarity": 0.5859761180614594
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/3:190.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/3:190.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/3:190.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}