{
  "chapter": "آل عمران",
  "text": "يايها الذين ءامنوا۟ اصبروا۟ وصابروا۟ ورابطوا۟ واتقوا۟ الله لعلكم تفلحون",
  "translations": [
    {
      "translation": "You who have iman, be steadfast; be supreme in steadfastness; be firm on the battlefield; and have taqwa of Allah; so that hopefully you will be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you who believe, have endurance in suffering, be patient and persevere, strengthen each other and be firm, and be pious and fear God that you may find success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be steadfast, and vie in steadfastness, stand firm in your faith, and hold Allah in fear that you may attain true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have patience, help each other with patience, establish good relations with one another, and have fear of God so that you may have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Endure and surpass your enemies in endurance, and guard the frontiers of the Islamic nation; and keep fearing Allah, hoping that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Endure and be more patient, and Rabitu, and have Taqwa of Allah, so that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be patient and excel in patience and remain steadfast, and be careful of (your duty to) Allah, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, be patient, and vie you in patience; be steadfast; fear God; haply so you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Endure, outdo all others in endurance, be ready, and observe your duty to Allah, in order that ye may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, endure, vie with each other in endurance, stand firm in your faith and fear God, so that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! persevere, and excel in perseverance and be ever ready, and fear Allah that haply ye may thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be patient, stand firm, and close [your] ranks, and be wary of Allah so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Persevere in patience and constancy; vie in such perseverance; strengthen each other; and fear Allah; that ye may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Endure and be more patient (than your enemy), and guard your territory by stationing army units permanently at the places from where the enemy can attack you, and fear Allah, so that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be patient, and race in patience, be steadfast, fear Allah, in order that you will be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be patient, and advocate patience, and be united, and revere God, so that you may thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:200] O you who believe, be patient, in [performing] acts of obedience, in the face of afflictions and in refraining from acts of disobedience, and vie in patience, with the disbelievers, lest they be more patient than you; be steadfast, persist in the struggle; fear God, in all of your circumstances, so that you will prosper, [so that] you will win [admittance to] Paradise and be delivered from the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then encouraged them to be steadfast in jihad and misfortunes, saying: (0 ye who believe!) in Muhammad and the Qur'an. (Endure) in jihad along with your Prophet, (outdo all others in endurance) overwhelm and overcome your enemy, (be ready) along with your Prophet for your enemy as long as they stand in wait to attack you; it is also said that this means: (Endure) the performance of the obligations and the avoidance of transgressions, (outdo all others in endurance) overwhelm and overcome the partisans of deviant beliefs and blameworthy innovations, (be ready) with your horses for the sake of Allah, (and observe your duty to Allah) obey Allah in that which He has commanded you, such that you never abstain from it, (in order that ye may succeed) in order that you be saved from Allah's wrath and punishment'. And of the surah in which the women are mentioned, which is Medinan in its entirety and consists of 3,940 words and 16,030 letters. Surah 4: Women (al-Nisa') And of the surah in which the women are mentioned, which is Medinan in its entirety and consists of 3,940 words and 16,030 letters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَرَابِطُواْ } معناهُ اثْبِتُوا وَدُومُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And ribatu} means, \"Be firm and persistent.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ورابطوا في مقام الروح ذواتكم بالمشاهدة حتى لا يغلبكم فترة أو غفلة أو غيبة بالتلوينات { واتقوا الله } في مقام الصبر عن المخالفة والرياء\n وفي المصابرة عن الاعتراض والامتلاء وفي المرابطة عن البقية والجفاء لكي تفلحوا الفلاح الحقيقي السرمديّ الذي لا فلاح وراءه\n إن شاء الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مقتضى إيمانكم الصبر على متاعب مسالك التوحيد { ٱصْبِرُواْ } على مشاق التكليفات الواقعة فيها { وَصَابِرُواْ } عالبوا على القوى النفسانية العائقة عن الرياضات المزكية للأهوية الفاسدة { وَرَابِطُواْ } قلوبكم على المشاهدات والمكاشفات الواردة من النسمات الإلهية والنفسات الرحمانية { وَٱتَّقُواْ ٱللَّهَ } عن جميع اما يعوقكم ويشغلكم { لَعَلَّكُمْ تُفْلِحُونَ } [آل عمران: 200] تفوزون منه بما لا عينٌ رأت\n ولا أذنٌ سمعت\n ولا خطر على قلب بشر\n\n\nربنا أفرغ علينا صبراً\n وتوفنا مسلمين\n واحشرنا مع الصابرين المرابطين\n هب لنا من لدنك رحمة إنك أرحم الراحمين\n\n\nخاتمة السورة\n\nعليك أيها المحمدي المترصد لفيضان الكشف والشهود واليقين\n ونزول الاطمئنان والتمكين أن تتصبر بما جرى عليك من المصيبات والبليات المشعرة للاختبارات الإلهية\n وابتلائه عن رسوخ قدمك في جادة التوحيد\n وصدق عزيمتك في مسلك الفناء\n وعلو همتك في التحقق بدار البقاء\n\n\nوتربط قلبك بحقك الذي هو أصلك وحقيقتك\n مقبلاً عليه\n متوجهاً إليه\n مجتنباً عن جميع ما يعوقك عنه من لوازم ماهيتك وهويتك التي لا حقيقة لها عند التحقيق والإقرار لما يترتب عليها وعلى لوازمها\n إذ هي أعراض متبدلة\n وأظلال باطلة\n وإعدام صرفة زائلة لا تحقق لها\n ولا آثار لها أصلاً سوى أن الوجود الحق انبسط عليها\n وامتد إليها بجميع كمالات\n فانعكس منه فيها ما انعكس\n فيتراءى العكوس والأظلال مشعشعة متجددة دائماً بمقتضى تجدد تجليات الأوصاف والأسماء\n فظن المحجوبون أنها متناصلات\n وهي عند التحقيق تجلٍ واحد على هذا المنوال\n\nارزقنا بلطفك حلاوة معرفتك وتوحيدك\n\n\nفلك أن تصفي ضميرك عن جميع ما يؤدي إلى التقليد والتخمين\n وتفرغ خاطرك وسترك عن كل ما يوهم التعدد والكثرة\n حتى انشرح صدرك واتسع قلبك\n لتصيرمنزلاً لسلطان الوجود الذي هو منبع جميع الكمالات والجود\n وقبلة الواجد والموجود\n والحوض المورود\n والمقام المحمود\n\n\nوإياك إياك أن تقتضي أثر وساوس مقتضيات نفسك التي هي أعدى عدوك\n وأشد ما يغويك ويضلك\n بل جميع شياطينك إنما انتشأت منها\n واستتبعت عليها\n فعليك أن تلتجئ في الاجتناب من غوائلها بالرشد الكامل الذي هو القرآن المنزل من عند الله على خير الأنام\n المؤيد من عند العليم العلاَّم\n ليهدي المضلين جادةَ التوحيد عن متابعة الشيطان المَريد\n ويوصلهم إلى صفاء التجريد وزلال التفريد بتوفيق من الله وجذبٍ من جانبه\n\n\nوفقنا بلطفك وكرمك بما تحب عنا وترضى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: المرابطة: أن يربط هؤلاء خيولهم، وهؤلاء خيولهم، إرصاداً لمن حاربهم، ثم أُطلق على كل مقيم في ثغر يدفع عمن وراءه، وإن لم يكن له مركب، إذا كان بنية الدفع عن المسلمين كان بأهله أو وحده. المدار على خلوص النية، خلاف ما قاله ابن عطية، وسيأتي صوابه في تفسير المعنى، إن شاء الله. يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا اصبروا } على مشاق الطاعات، وما يصيبكم من الشدائد والأزْمَات، وعلى مجانبة المعاصي والمخالفات، وعلى شكر ما أوليتكم من مواهب العطيات { وصابروا } أي: غالبوا الأعداء في مواطن الصبر، والثبوت في مداحض الحرب، { ورابطوا } أبدانكم وخيولكم في الثغور لتحفظوا المسلمين من العدو الكفور، كي تفوزوا بعظائم الأجور قال صلى الله عليه وسلم:\n \" من رَابَط يَوْماً ولَيلَة في سبيل اللّهِ كان كعدل صِيامِ شَهْر وصِيَامه، لا يفطر ولا ينفتل عن صلاته إلا لحاجة، ومن توفي في سبيل الله - أي: مرابطاً في سبيل الله - أجْرَى الله عليه أجره حتى يقضي بين أهلِ الجنَةِ وأهل النَّارِ \" \nومما يلحق بالرباط:\n \" انتظَارُ الصَّلاَةِ بَعْدَ الصَّلاَةِ \" \n، كما في الحديث: { واتقوا الله } فيما يأمركم به وينهاكم عنه، { لعلكم تفلحون } فلاحاً لا خسران بعده أبداً. الإشارة: { يا أيها الذين آمنوا } إيمان أهل الخصوص، { اصبروا } على حفظ مراسم الشريعة، { وصابروا } على تحصيل أنوار الطريقة، { ورابطوا } قلبوكم على شهود أسرار الحقيقة، أو: اصبروا على أداء العبادة، وصابروا على تحقيق العبودية، ورابطوا في تحصيل العبودة - أي: الحرية - أو: اصبروا على تحقيق مقام الإسلام، وصابروا على دوام الإيمان، ورابطوا على العكوف في مقام الإحسان، أو: اصبروا على تخليص الطاعات، وصابروا على رفض الحظوظ والشهوات، ورابطوا أسراركم على أنوار المشاهدات، { واتقوا الله } فلا تشهدوا معه سواه، { لعلكم تفلحون } ، بتحقيق معرفة الله. وبالله التوفيق، وهو الهادي إلى سواء الطريق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:60",
      "similarity": 0.5184252856645586
    },
    {
      "verse": "28:10",
      "similarity": 0.4835974671856516
    },
    {
      "verse": "18:14",
      "similarity": 0.47791764916130813
    },
    {
      "verse": "8:11",
      "similarity": 0.31120586138807255
    },
    {
      "verse": "3:130",
      "similarity": 0.23182314553503833
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003200.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003200.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:200.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}