{
  "chapter": "آل عمران",
  "text": "ذلك بانهم قالوا۟ لن تمسنا النار الا اياما معدودت وغرهم فى دينهم ما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "Do you not see those who have been given a portion of the Book being invited to let Allah's Book be the judge between them? But then a group of them turn away.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they say: \"The Fire will not touch us for more than a few days.\" They have been deceived by the lies they have themselves fabricated, and stray from their faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they say: 'The fire of Hell shall not touch us except for a limited number of days.' The false beliefs which they have forged have deluded them in their faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because of their belief that the fire will only touch them for a few days. This fabricated belief has deceived them in matters of their religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They dared to do this because they say, “The fire will definitely not touch us except for a certain number of days”; and they are deceived in their religion by the lies they fabricated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they say: \"The Fire shall not touch us but for a number of days.\" And that which they used to invent in their religion has deceived them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they say: The fire shall not touch us but for a few days; and what they have forged deceives them in the matter of their religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, because they said, 'The Fire shall not touch us, except for a number of days'; and the lies they forged has deluded them in their religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say: The Fire will not touch us save for a certain number of days. That which they used to invent hath deceived them regarding their religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say, \"The Fire will touch us only for a limited number of days.\" Thus the false beliefs which they have invented have deluded them in the matter of their religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say, the Fire shall touch us not save for a few days numbered. And there had deluded them in their religion that which they have been fabricating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say, ‘The Fire shall not touch us except for a number of days,’ and they have been misled in their religion by what they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This because they say: \"The Fire shall not touch us but for a few numbered days\": For their forgeries deceive them as to their own religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they say: \"The Fire shall not touch us but for a number of days.\" And that which they used to invent regarding their religion has deceived them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they say: 'The Fire will not touch us except for a certain number of days' And the lies they forged have deluded them in their religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said, “The Fire will not touch us except for a limited number of days.” They have been misled in their religion by the lies they fabricated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say, \"Never will the Fire touch us except for [a few] numbered days,\" and [because] they were deluded in their religion by what they were inventing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:24] That, turning away and rejection was, because they said, ‘the Fire shall not touch us, except for a number of days’, that is, for forty days [only], the length of time their forefathers worshipped the calf, after which it would end; and the lies they used to invent, in their saying this, have deluded them in their religion (wagharrahum fī dīnihim, ‘it has deluded them in their religion’, is semantically connected to mā kānū yaftarūna, ‘the lies which they used to invent’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { ذلك بأنهم قالوا لن تمسنا النار } الإشارة إلى تولّيهم وإعراضهم ، والباء للسببية : أي إنّهم فعلوا ما فعلوا بسبب زعمهم أنّهم في أمان من العذاب إلاّ أياماً قليلة ، فانعدَم اكتراثهم باتّباع الحق؛ لأنّ اعتقادهم النجاة من عذاب الله على كل حاللٍ جَرّأهم على ارتكاب مثل هذا الإعراض . وهذا الاعتقاد مع بطلانه مؤذن أيضاً بسفالة همّتهم الدينية ، فكانوا لا ينافسون في تزكية الأنفس . وعبر عن الاعتقاد بالقول دلالة على أنّ هذا الاعتقاد لا دليل عليه وأنّه قول مفتري مدلّس ، وهذه العقيدة عقيدة اليهود ، كما تقدم في البقرة .وقوله : { وغرهم في دينهم ما كانوا يفترون } أي ما تقوّلوه على الدِّين وأدخلوه فيه ، فلذلك أتي بفي الدالة على الظرفية المجازية . ومن جملة ما كانوا يفترونه قولهم : { لن تمسنا النار إلا أياماً معدودة } \\[ البقرة : 80 \\] ، وكانوا أيضاً يزعمون أنّ الله وعد يعقوب ألاّ يعذّب أبناءه .وقد أخبر الله تعالى عن مفاسد هذا الغرور والافتراء بإيقاعها في الضلال الدائم ، لأنّ المخالفة إذا لم تكن عن غرور فالإقلاع عنها مرجوٌ ، أما المغرور فلا يترقّب منه إقلاع . وقد ابتلي المسلمون بغرور كثير في تفاريع دينهم وافتراءات من الموضوعات عادت على مقاصد الدين وقواعد الشريعة بالإبطال ، وتفصيل ذلك في غير هذا المجال .\n\n",
      "translations": [
        {
          "translation": "(That) opposition, denial and punishment (is because they say: The Fire will not touch us) in the Hereafter (save for a certain number of days) about 40 days. A group from among the Jews said: the Fire will not touch us except for a limited number of days: seven days of days of the Hereafter-each day equalling a thousand years-as punishment for the days in which our forefathers worshipped the calf. (That which they used to invent has deceived them) their lie about not being punished; it is also said this refers to their claim that punishment shall be postponed (regarding their religion) i.e. their firm adherence to their religion: Judaism.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } التولي والإعراض من كثرة الخصلة الذميمة والديدنة الخبيثة\n المتركزة في نفوسهم المنسوبة إلى دينهم افتراء { بِأَنَّهُمْ } اعتقدوا { قَالُواْ لَن تَمَسَّنَا ٱلنَّارُ } المعدة لجزاء العصاة { إِلاَّ أَيَّاماً } قلائل { مَّعْدُودَاتٍ } سواء كانت ذنوبنا كثيرة أو قليلة\n صغير أو كبيرة { وَغَرَّهُمْ فِي دِينِهِمْ مَّا كَانُواْ يَفْتَرُونَ } [آل عمران: 24] اي: جرأهم على الذنب والعصيان ما يفترون في شأن دينهم من أمثال هذه الهذايانات\n منها قولهم هذا\n ومنها اعتقادهم أن آباءهم الأنبياء سيشفعون لهم\n وإن عظمت ذنوبهم\n ومنها أن يعقوب عليه السلام ناجى مع الله ألاَّ يعذب أولاده إل تحلة القسم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ذلك } الأعراض بسبب اغترارهم وتسهيلهم أمر العقاب\n فقالوا: { لن تسمنا النار إلا أياماً معدودات } أربعين يوماً\n قدر عبادتهم العجل\n ثم يَخْلفهم المسلمون\n { وغرهم في دينهم ما كانوا يفترون } بزعمهم الفاسد وطمعهم الفارغ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:80",
      "similarity": 0.4531098530754236
    },
    {
      "verse": "82:6",
      "similarity": 0.4387215365057492
    },
    {
      "verse": "35:5",
      "similarity": 0.4178200672153076
    },
    {
      "verse": "8:49",
      "similarity": 0.4078392127489964
    },
    {
      "verse": "67:20",
      "similarity": 0.3946960198978502
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}