{
  "chapter": "آل عمران",
  "text": "يوم تجد كل نفس ما عملت من خير محضرا وما عملت من سوء تود لو ان بينها وبينه امدۢا بعيدا ويحذركم الله نفسه والله رءوفۢ بالعباد",
  "translations": [
    {
      "translation": "Say, 'Whether you conceal what is in your breasts or make it known, Allah knows it. He knows what is in the heavens and what is on earth. Allah has power over all things.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when every man will find whatever of good he has earned and of evil, and is confronted with it, he shall wish that a distance appeared between him and that day -- (that it were far away). God bids you beware of Him, though compassionate is God to His votaries.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day is approaching when every soul shall find itself confronted with whatever good it has done and whatever evil it has wrought. It will then wish there is a wide space between it and the Day! Allah warns you to beware of Him; He is most tender towards His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when every soul will see its good and bad deeds right before its very eyes, it will wish for the longest period of time to separate it from its bad deeds. God warns you about Himself. God is Compassionate to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every soul will be confronted with all the good that it has done; and all the evil that it has done – it will wish that perhaps there would have been a great distance between itself and the punishment; and Allah warns you of His punishment; and Allah is Most Compassionate towards His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every person will be confronted with the good he has done, and all the evil he has done, he will wish that there were a great distance between him and his evil. And Allah warns you against Himself and Allah is full of kindness with the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day that every soul shall find present what it has done of good and what it has done of evil, it shall wish that between it and that (evil) there were a long duration of time; and Allah makes you to be cautious of (retribution from) Himself; and Allah is Compassionate to the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day every soul shall find what it has done of good brought forward, and what it has done of evil; it will wish if there were only a far space between it and that day. God warns you that you beware of Him; and God is gentle with His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every soul will find itself confronted with all that it hath done of good and all that it hath done of evil (every soul) will long that there might be a mighty space of distance between it and that (evil). Allah biddeth you beware of Him. And Allah is Full of Pity for (His) bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every human being will find himself faced with all the good that he has done, and with all the evil that he has done, many will wish that there were a long space of time between himself and that [Day]. God admonishes you to fear Him, but God is compassionate towards His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon each soul shall find presented whatsoever it hath worked of good and whatsoever it hath worked of evil, it would fain that there were betwixt it and that Day a wide space. And Allah maketh you beware of Himself: Allah is Tender unto His bondsmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when every soul will find present whatever good it has done; and as for the evil, it has done, it will wish there were a far distance between it and itself. Allah warns you to beware of [disobeying] Him, and Allah is most kind to [His] servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every soul will be confronted with all the good it has done, and all the evil it has done, it will wish there were a great distance between it and its evil. But Allah cautions you (To remember) Himself. And Allah is full of kindness to those that serve Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every person will be confronted with all the good he has done, and all the evil he has done, he will wish that there were a great distance between him and his evil. And Allah warns you against Himself (His Punishment) and Allah is full of Kindness to the (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that every soul shall find what it has done of good brought forward, and what it has done of evil, it will wish if there were only a far space between it and that (Day). Allah warns you to be wary of Him; and Allah is Gentle with His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when every soul finds all the good it has done presented. And as for the evil it has done, it will wish there were a great distance between them. God cautions you of Himself. God is Kind towards the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day every soul will find what it has done of good present [before it] and what it has done of evil, it will wish that between itself and that [evil] was a great distance. And Allah warns you of Himself, and Allah is Kind to [His] servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:30] And remember, the day every soul shall find what it has done of good present before it, and what it has done of evil (the [last statement constitutes the] subject, the predicate of which is [what follows]), it will wish that between it and that there were a great distance, an extremely lengthy distance so that it [the evil] could never reach it. God warns you of His Self (this is repeated for emphasis), and God is Kind to His servants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day) the Day of Judgement (when every soul will find itself confronted with all that it hath done) written in its register (of good and all that it hath done of evil) it will also find it written in its register ((every soul) will long that there might be a mighty apace of distance) a long period of time separating them: from sunrise to sunset (between it and that (evil). Allah bideth you beware of Him) upon committing an act of disobedience. (And Allah is full of pity for (His) bondmen) He is full of pity for the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ يوم تَجد كل نَفس } الآية، كل ما يعمله الإنسان أو يقوله يحصل منه أثر في نفسه وتنتقش نفسه به وإذا تكرر صار النقش ملكة راسخة، وكذا ينتقش في صحائف النفوس السماوية، لكنه مشغول عن هيئات نفسه ونقوشها بالشواغل الحسيّة والإدراكات الوهمية والخيالية، لا يفرغ إليها، فإذا فارقت نفسه جسدها ولم يبق ما يشغلها عن هيئاتها ونقوشها وجدت ما عملت من خير أو شرّ محضراً، فإذا كان شرّاً تتمنى بعد ما بينها وبين ذلك اليوم أو ذلك العمل لتعذيبها به، فتصير تلك الهيئات والنقوش صورتها إن كانت راسخة وإلا وجدت جزاءها بحسبها وتكرّر { ويحذركم الله نفسه } تأكيداً لئلا يعملوا ما يستحقون به عقابه { والله رؤوف بالعباد } فلذا يحذرهم عن السيئات تحذير الوالد المشفق لولده عمّا يوبقه.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَ تَجِدُ كُلُّ نَفْسٍ } خيرة { مَّا عَمِلَتْ } في النشأة الأولى { مِنْ خَيْرٍ } إحسان وإنعام وعمل صالح ويقين وعرفان { مُّحْضَراً } بين يديه يستحضره ويود استعجاله { وَ } كذا تجد كل نفس شديدة { مَا عَمِلَتْ } فيها { مِن سُوۤءٍ } غير صالح وكفر ونفاق وشرك وشقاق محضراً بين يديه\n مشاهداً بين عينيه تستأخره وتتمنى بعده { تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُ أَمَدَاً بَعِيداً } وزماناً متطاولاً\n بل يتمنى ألاَّ تلقاه أصلاً { وَيُحَذِّرُكُمُ ٱللَّهُ } بهذا التذكير والتنبيه { نَفْسَهُ } وقدرته على الانتقام وزيادة قهره وغضبه على من استكبر عن أوامره ونواهيه { وَٱللَّهُ } القادر المقتدر على انتقام العصاة { رَؤُوفٌ } عطوف مشفق { بِٱلْعِبَادِ } [آل عمران: 30] الذين يترصدون إلى الله بين طرفي الخوف والرجاء\n معرضين عن جانبي القنوط والطمع\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { يوم }: ظرف\n والعامل فيه: اذكر\n أو اتقوا\n أو المصير\n أو تود\n و { ما عملت }: مبتدأ\n و { تود }: خبر\n أو معطوف على { ما عملت } الأولى\n و { تود }:  حال\n يقول الحقّ جلّ جلاله\n لقوم من الأنصار\n كانوا يُوالون اليهود لقرابة أو صداقة تقدمت في الجاهلية: { لا يتخذ المؤمنون الكافرين أولياء } \n أي: أصدقاء\n إذ الحب إنما يكون في الله والبغض في الله\n أو لا تستعينوا بهم في غزو ولا غيره\n فلا تودوهم { من دون المؤمنين } إذ هم أحق بالمودة\n ففيهم مَنْدُوحة عن مولاة الكفرة\n { ومن يفعل ذلك } الاتخاذ { فليس من } ولاية { الله في شيء } إذ لا تجتمع ولاية الله مع ولاية عدوه\n قال الشاعر:\nوالنُّوك - بضم النون -: الحُمْق\n فلا تُوالوا الكفار { إلا أن تتقوا منهم تقاة } أيْ: إلا أن تخافوا من جهتهم ما يجب اتقاؤه\n فلا بأس بمداراتهم ظاهراً\n والبعد منهم بطناً\n كما قال عيسى عليه السلام: كن وَسَطاً وامْشِ جانباً\n وقال ابن مسعود رضي الله عنه: خالطوا الناس وزايلوهم\n وصافحوهم بما يشتهون\n ودينكم لا تَثْلُموه\n وقال جعفر الصادق: إني لأسمع الرجل يشتمني في المسجد\n فأستتر منه بالسارية لئلا يراني\n هـ\n { ويحذركم الله نفسه } أي: يخوفكم عذابه على موالاة الكفار ومخالفة أمره وارتكاب نهيه\n تقول العرب: احذرنا فلاناً: أي: ضرره لا ذاته\n وفي ذكر النفس زيادة تهديد يُؤذِن بعقاب يصدر منه بلا واسطة\n { وإلى الله المصير } فيحسر كل قوم مَن أحب\n { قل إن تخفوا ما في صدوركم } من موالاة أعدائه\n { أو تبدوه يعلمه الله } فلا يخفى عليه ما تُكن الصدور من خير أو شر\n وقدَّم في سورة البقرة الإبداء\n وأخره هنا لأن المحاسبة لا ترتيب فيها بخلاف العلم\n فإن الأشياء التي تبرز من الإنسان يتقدم إضمارها في قلبه ثم تبرز\n فقد تعلق علم الله تعالى بها قبل أن تبرز\n فلذلك قدَّم هنا الإخفاء لتقدم وجوده في الصدر\n وأخره في البقرة\n لأن المحاسبة لا ترتيب فيها\n { ويعلم ما في السماوات وما في الأرض } فلا يخفى عليه شيء\n { والله على كل شيء قدير } فيقدر على عقوبتكم إن لم تنتهوا\n والآية بيان لقوله: { ويحذركم الله نفسه } لأن الذات العالية متصفة بعلم محيط بجميع المعلومات\n وبقدرة تحيط بجميع المقدورات\n فلا تجسروا على عصيانه\n فإنه ما من معصية إلا وهو مطلع عليها\n قادرٌ على العقاب عليها يوم القيامة\n\n{ يوم تجد كل نفس ما عملت من خير محضراً } بين يديها تنتفع به\n { وما عملت من سوء تود له أن بينها وبينه أمداً بعيداً } \n كما بين المشرق والمغرب\n ولا ينفع الندم وقد زلَّت القدم\n { ويحذركم الله نفسه } \n كرره للتأكيد وزيادة التحذير\n وسيأتي في الإشارة حكمة تكريره\n { والله رؤوف بالعباد } حيث حذرهم مما يضرهم\n وأمرهم بما يقربهم\n فكل ما يصدر منه - سبحانه - في غاية الكمال\n الأشارة: لا ينبغي للمريد الصادق أن يخالط أهل الغفلة\n ولا يتودد معه فإن ذلك يقطعه عن ربه\n ويصده عن دواء قلبه\n وفي ذلك يقول صاحب العينية:\nإلا أن يتقي منهم تقية\n بحيث تلجئه الضرورة إلى مخالطتهم\n فيخالطهم بجسمه ويفارقهم بقلبه\n وقد حذَّر الصوفية من صحبة أرْبَع طوائف: الجبابرة المتكبرون\n والقراء المداهنون\n والمتفقرة الجاهلون\n والعلماء المتجمدون لأنهم مُولَعون بالطعن على أولياء الله\n يرون ذلك قربة تُقربهم إلى الله\n ثم قال: { ويحذركم الله نفسه } أن تقصدوا معه غيره\n وهذا خطاب للسائرين بدليل تعقيبة بقوله: { وإلى الله المصير } أي: إليه ينتهي السير وإليه يكون الوصال\n ثم شدد عليهم في المراقبة فقال: { إن تُخفوا ما في صدوركم } من الميل أو الركون إلى الغير أو الوقوف عن السير\n { أو تبدوه يعلمه الله } فينقص عنكم المدد بقدر ذلك الميل\n يظهر ذلك يوم الدخول إلى بلاد المشاهدة\n { يوم تجد كل نفس } ما قدمت من المجاهدة\n فبقدر المجاهدة تكون المشاهدة\n ثم خاطب الواصلين فقال: { ويحذركم الله نفسه } من أن تشهدوا معه سواه\n فلو كُلّف الواصل أن يشهد غيره لم يتسطع\n إذ لا غير معه حتى يشهده\n ويدل على أن الخطاب هنا للواصلين تعقيبه بالمودة والرأفة\n اللائقة بالواصلين المحبوبين العارفين الكاملين\n خرطنا الله في سلكهم بمنِّه وكرمه\n ثم لا طريق للوصول إلى هذا كله إلا باتباع الرسول الأعظم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:25",
      "similarity": 0.6034854576961212
    },
    {
      "verse": "18:12",
      "similarity": 0.5175130837030552
    },
    {
      "verse": "57:16",
      "similarity": 0.39474423570841777
    },
    {
      "verse": "57:9",
      "similarity": 0.2730822592755597
    },
    {
      "verse": "2:207",
      "similarity": 0.2586381662494473
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:30.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:30.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}