{
  "chapter": "آل عمران",
  "text": "قل اطيعوا۟ الله والرسول فان تولوا۟ فان الله لا يحب الكفرين",
  "translations": [
    {
      "translation": "Say, 'If you love Allah, then follow me and Allah will love you and forgive you for your wrong actions. Allah is Ever-Forgiving, Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey God and His Messenger;\" and if they refuse (then remember) God does not love disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Obey Allah and obey the Messenger.' If they turn away from this then know that Allah does not love those who refuse to obey Him and His Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, \"Obey God and the Messenger.\" If they turn away (let it be known) that God does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Obey Allah and the Noble Messenger”; so if they turn away – then Allah is not pleased with the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey Allah and the Messenger.\" But if they turn away, then Allah does not like the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Obey Allah and the Apostle; but if they turn back, then surely Allah does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Obey God, and the Messenger.' But if they turn their backs, God loves not the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Obey Allah and the messenger. But if they turn away, lo! Allah loveth not the disbelievers (in His guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Obey God and the Messenger,\" and if they turn away, God does not love those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: obey Allah and the apostle if thereafter they turn away. then verily Allah loveth not the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Obey Allah and the Apostle.’ But if they turn away, indeed Allah does not like the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey Allah and His Messenger\": But if they turn back, Allah loveth not those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Obey Allah and the Messenger (Muhammad SAW).\" But if they turn away, then Allah does not like the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Obey Allah and the Messenger' But if they turn away, then truly, Allah does not love the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Obey God and the Messenger.” But if they turn away—God does not love the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Obey Allah and the Messenger.\" But if they turn away - then indeed, Allah does not like the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:32] Say, to them: ‘Obey God, and the Messenger’, as regards the [belief in the] Oneness of God which he enjoins upon you. But if they turn their backs, [if they] object to obedience, God loves not the disbelievers, meaning that He will chastise them (the [third person] pronominalisation [‘they’] is replaced by the overt noun [‘the disbelievers’]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Consequently, Allah revealed about their comments: (Say: Obey Allah) regarding what He has obligated (and the Messenger) in his practices. (But if they turn away) from obeying them, (Lo! Allah loveth not the disbelievers) the Jews and the hypocrites.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفقال: { قل أطيعُوا الله والرسول } أي: إن لم تكونوا محبين ولم تستطيعوا متابعة حبيبي فلا أقل من أن تكونوا مريدين، مطيعين لما أمرتم به، فإن المريد يلزمه متابعة الأمر وامتثال المأمور به { فإن تولوا فإنّ الله لا يحبّ الكَافرين } أي: إن أعرضوا عن ذلك أيضاً، فهم كفّار منكرون محجوبون، والله لا يحب من كان كافراً\n فبترك الطاعة يلزم الكفر، وبترك المتابعة لا يلزم، لأنّ تارك المتابعة يمكن أن يكون مطيعاً بمتابعة الأمر\n ومعنى { أطيعوا الله والرسول }: أطيعوا رسول الله صلى الله عليه وسلم لقوله تعالى:\n\n[النساء: 80]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم أيضاً أجل أعمالكم وأفضالها إطاعة أمر الله وإتباع رسوله المرسل إليكم { أَطِيعُواْ ٱللَّهَ } في امتثال جميع أوامره وأحكامه، واجتناب جميع نواهيه ومحظوراته مما فاز به المؤمنون { وَ } أطيعوا { ٱلرَّسُولَ } المبلغ لكم كتاب الله، المبين لكم المراد منه، فإن أطاعوا فازوا مما فاز به المؤمنون { فإِن تَوَلَّوْاْ } أعرضوا عن إطاة الله ورسوله، فقد كفروا فلهم ما سيجري عليهم من عذاب الله وغضبه في النشأة الأخرى { فَإِنَّ ٱللَّهَ } الهادي لعباده { لاَ يُحِبُّ ٱلْكَافِرِينَ } [آل عمران: 32] منهم لا يقربهم ولا يرضى عنهم، بل يعذبهم ويبعد9م عن عز حضورهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { فإن تولوا }: فعل ماض مجزوم المحل، ولم يدغمه البَزِّي هنا، على عادته في الماضي، لعدم موجبه\n يقول الحقّ جلّ جلاله: { قل } يا محمد لمن يدّعي أنه يحب الله ولا يتبع رسوله: { إن كنتم تحبون الله } كما زعمتم، { فاتبعوني } في أقوالي وأفعالي وأحوالي، { يحببكم الله } أي: يرضى عنكم ويقربكم إليه، { ويغفر لكم ذنوبكم } أي: يكشف الحجاب عن قلوبكم بغفران الذنوب ومحو العيوب، فيقربكم من جناب عزه، ويبوئكم في جِوار قدسه، { والله غفور رحيم } لمن تحبب إليه بطاعته واتباع رسوله\n { قل أطيعوا الله } فيما يأمركم به وينهاكم عنه، { والرسول } فيما يَسُنه لكم ويرغبكم فيه، { فإن تولوا } وأعرَضوا عنه، فقد تعرضوا لمقت الله وغضبه بكفرهم به { فإن الله لا يحب الكافرين } أي: لا يرضى عنهم ولا يقبل عليهم، وإنما لم يقل: لا يحبهم لقصد العموم، والدلالة على أن التولي عن الرسول كفر، وأنه بريء من محبة الله، وأن محبته مخصوصة بالمؤمنين\n رُوِيَ أن نصارى نجران قالوا: إنما نعظم المسيح ونعبده، حباً لله وتعظيماً لله\n فقال تعال: { قل } يا محمد: { إن كنتم تحبون الله } تعالى { فاتبعوني }\n\n\n الآية\n ولما نزلت الآية قال عبد الله بن أُبَيّ لأصحابه: إن محمداً يجعل طاعته كطاعة الله، ويأمرنا أن نحبه كما أحبت النصارى عيسى، فنزل قوله تعالى: { قل أطيعوا الله والرسول } الآية\n وقال - عليه الصلاة والسلام -:\n\n \" \" مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ الله، ومن أَطَاعَ الإمامَ فَقدْ أطَاعَنِي، وَمَنْ عَصَانِي فَقَدْ عَصَى الله وَمَنْ عصَى الإمامَ فَقَدْ عَصَانِي \"\n \n\nالإشارة: اتباع الرسول صلى الله عليه وسلم رُكن من أركان الطريقة، وشرط في إشراق أنوار الحقيقة، فمن لا اتباع له طريق له، ومن لا طريق له لا وصول له، قال الشيخ زروق رضي الله عنه: أصول الطريقة خمسة أشياء: تقوى الله في السر والعلانية، واتباع النبيّ صلى الله عليه وسلم في الأقوال والأفعال، والإعراض عن الخلق في الإقبال والإدبار، والرجوع إلى الله في السراء والضرء، والرضى عن الله في القليل والكثير\n فالرسول - عليه الصلاة والسلام - حجاب الحضرة وبَوَّابُها، فمن أتى من بابه بمحبته واتباعه، دخل الحضرة، وسكن فيها، ومن تنكب عنها طُرِد وأُبعد، وفي ذلك يقول القائل:  وأنتَ بابُ الله، أيُّ امرِىءٍ وَافَاه مِنح غَيْرِكَ لاَ يدْخُلُ وقال في المباحث:\n\n\n\nفمن ادّعى محبة الله أو محبة رسوله، ولم يطعهما، ولم يتخلق بأخلاقهما، فدعواه كاذبة، وفي ذلك يقول ابن المبارك:\n\nثم ذكر الحق تعالى بيان نشأة عيسى عليه السلام، وبيان أصله ونشأة أمه، توطئة للكلام مع النصارى والرد عليهم في اعتقادهم فيه\n وقال البيضاوي: لما أوجب الله طاعة الرسل، وبيَّن أنها الجالبة لمحبة الله، عقَّب ذلك ببيان مناقبهم تحريضاً عليها\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:12",
      "similarity": 0.520224585021605
    },
    {
      "verse": "8:20",
      "similarity": 0.5092496417446748
    },
    {
      "verse": "24:47",
      "similarity": 0.44922089289040096
    },
    {
      "verse": "28:56",
      "similarity": 0.4439162531612406
    },
    {
      "verse": "9:23",
      "similarity": 0.44336299577576527
    }
  ]
}