{
  "chapter": "آل عمران",
  "text": "ان الله اصطفى ءادم ونوحا وءال ابرهيم وءال عمرن على العلمين",
  "translations": [
    {
      "translation": "Say, 'Obey Allah and the Messenger.' Then if they turn away, Allah does not love the kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God had chosen Adam and Noah and the families of Abraham and 'Imran in preference to others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly Allah chose Adam and Noah and the descendants of Abraham and of 'Imran above all mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God chose (and gave distinction to) Adam, Noah, the family of Abraham, and Imran over all the people of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah chose Adam, and Nooh, and the Family of Ibrahim, and the Family of Imran over the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah chose Adam, Nuh (Noah), the family of Ibrahim and the family of `Imran above the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God chose Adam and Noah and the House of Abraham and the House of Imran above all beings, the\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah preferred Adam and Noah and the Family of Abraham and the Family of 'Imran above (all His) creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God chose Adam and Noah and the family of Abraham and the family of 'Imran above all His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily did Allah choose Adam and Nuh and the house of lbrahim and the house of 'lmran out of the worlds\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah chose Adam and Noah, and the progeny of Abraham and the progeny of Imran above all the nations;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah did choose Adam and Noah, the family of Abraham, and the family of 'Imran above all people,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah chose Adam, Nuh (Noah), the family of Ibrahim (Abraham) and the family of 'Imran above the 'Alamin (mankind and jinns) (of their times).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah chose Adam and Noah, the House of Abraham and the House of Imran above all worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God chose Adam, and Noah, and the family of Abraham, and the family of Imran, over all mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah chose Adam and Noah and the family of Abraham and the family of 'Imran over the worlds -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:33]   Lo! God preferred, He has chosen, Adam and Noah and the House of Abraham and the House of ‘Imrān, meaning [He preferred] their selves [sc. Abraham and ‘Imrān], above the worlds, by making prophethood reside in [them and] their progeny:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nانتقال من تمهيدات سبب السورة إلى واسطة بين التمهيد والمقصد ، كطريقة التخلّص ، فهذا تخلّص لمحاجّة وفد نَجْرَانَ وقد ذكرناه في أول السورة ، فابتُدىء هنا بذكر آدم ونوح وهما أبَوا البشر أو أحدُهما وذكر إبراهيم وهو أبو المقصودين بالتفضيل وبالخطاب . فأما آدم فهو أبو البشر باتفاق الأمم كلها إلاّ شذوذاً من أصحاب النزعات الإلحادية الذين ظهروا في أوروبا واخترعوا نظرية تسلسل أنواع الحيوان بعضها من بعض وهي نظرية فائلة .وآدم اسم أبي البشر عند جميع أهل الأديان ، وهو علَم عليه وضعه لنفسه بإلهام من الله تعالى كما وضع مبدأ اللغة ، ولا شك أنّ من أول ما يحتاج إليه هو وزوجه أن يعبِّر أحدهما للآخر ، وظاهر القرآن أنّ الله أسماه بهذا الاسم من قبل خروجه من جنة عدن ولا يجوز أن يكون اسمه مشتقاً من الأدمة ، وهي اللون المخصوص لأنّ تسمية ذلك اللون بالأدمة خاص بكلام العرب فلعلّ العرب وضعوا اسم ذلك اللون أخذاً من وصف لَون آدم أبي البشر .وقد جاء في سفر التكوين من كتاب العهد عند اليهود ما يقتضى : أنّ آدم وُجد على الأرض في وقت يوافق سنة 3942 اثنتين وأربعين وتسعمائة وثلاثة آلاف قبل ميلاد عيسى وأنه عاش تسعمائة وثلاثين سنة فتكون وفاته في سنة 3012 اثنتي عشرة وثلاثة آلاف قبل ميلاد عيسى هذا ما تقبّله المؤرّخون المتبعون لضبط السنين . والمظنون عند المحققين الناظرين في شواهد حَضارة البشرية أنّ هذا الضبط لا يُعتمد ، وأن وجود آدم متقادم في أزمنة مترامية البعد هي أكثر بكثير مما حدّده سفر التكوين .وأمّا نوح فتقول التوراة : إنه ابن لاَمك وسمّي عند العرب لَمَك بن متوشالخ بن أخنوخَ ( وهو إدريس عند العرب ) ابن يارد بتحتية في أوله بن مَهلئيل بميم مفتوحة فهاء ساكنة فلام مفتوحة بن قينان بن أنوش بن شيث بن آدم . وعلى تقديرها وتقدير سني أعمارهم يكون قد ولد سنة ست وثمانين وثمانمائة وألفين قبل ميلاد عيسى وتوفي سنة ست وثلاثين وتسعمائة وألف قبل ميلاد عيسى والقول فيه كما تقدم في ضبط تاريخ وجود ءادم .وفي زمن نوح وقع الطوفان على جميع الأرض ونجاه الله وأولادَه وأزواجهم في الفُلْك فيكون أباً ثانياً للبشر . ومن الناس من يدّعى أنّ الطوفان لم يعم الأرض وعلى هذا الرأي ذهب مؤرّخو الصين وزعموا أنّ الطوفان لم يشمل قطرهم فلا يكون نوح عندهم أباً ثانياً للبشر . وعلى رأي الجمهور فالبشر كلهم يرجعون إلى أبناء نوح الثلاثة سام ، حام ، ويافث ، وهو أول رسول بعثه الله إلى الناس حسب الحديث الصحيح ، وعُمِّر نوح تسعماية وخمسين سنة على ما في التوراة فهو ظاهر قوله تعالى :{ فلبث فيهم ألف سنة إلا خمسين عاما } \\[ العنكبوت : 14 \\] وفي التوراة : أنّ الطوفان حدث وعمر نوح ستمائة سنة وأنّ نوحاً صار بعد الطوفان فلاّحاً وغرس الكرم واتّخذ الخمر . وذكر الألوسي صفته بدون سند فقال : كان نوح دقيق الوجه في رأسه طول عظيمَ العينين غليظ العضدين كثير لحم الفخذين ضخم السرّة طويل القامة جسيماً طويل اللحية ، قيل : إنّ مدفنه بالعراق في نواحي الكوفة ، وقيل في ذيل جبل لبنان ، وقيل بمدينة الكرك ، وسيأتي ذكر الطوفان : في سورة الأعراف ، وفي سورة العنكبوت ، وذكر شريعته في سورة الشورى ، وفي سورة نوح .والآل : الرهط ، وآل إبراهيم : أبناؤه وحفيده وأسباطه ، والمقصود تفضيل فريق منهم . وشمل آل إبراهيم الأنبياءَ من عقبه كموسى ، ومَن قبله ومن بعده ، وكمحمد عليه الصلاة والسلام ، وإسماعيل ، وحنظلةَ بن صفوان ، وخالد بن سنان .وأما آل عمران : فهم مريم ، وعيسى ، فمريم بنت عمران بن ماتان كذا سماه المفسرون ، وكان من أحبار اليهود ، وصالحيهم ، وأصله بالعبرانية عمرام بميم في آخره فهو أبو مريم ، قال المفسّرون : هو من نسل سليمان بن داود ، وهو خطأ ، والحق أنه من نسل هارون أخي موسى ، كما سيأتي قريباً . وفي كتب النصارى : أنّ اسمه يوهاقيم ، فلعله كان له اسمان ومثله كثير . وليس المراد هنا عِمران والد موسى وهارون؛ إذ المقصود هنا التمهيد لذكر مريم وابنِها عيسى بدليل قوله : { إذ قالت امرأت عمران } .وتقدم الكلام على احتمال معنى الآل عند قوله تعالى : { وإذ نجيناكم من آل فرعون } في سورة البقرة ( 49 ) ولكنّ الآل هنا متعين للحمل على رهط الرجل وقرابته .ومعنى اصطفاء هؤلاء على العالمين اصطفاء المجموع على غيرهم ، أو اصطفاء كلّ فاضل منهم على أهل زمانه .\n\n",
      "translations": [
        {
          "translation": "56 When the Jews heard this, they said: \"we follow the religion of Adam: we are Muslims\", and so Allah revealed the following: (Lo! Allah preferred Adam) with Islam (and Noah) with Islam (and the Family of Abraham) the children of Abraham with Islam (and the Family of 'Imran) Moses and Aaron with Islam (above (all His) creatures) above all the people of their times. It is also said that Amran is not the father of Moses and Aaron.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لم وقف سبحاه محبته ورضاه لعباده على متابعة حبيبه ورسوله المصور على صورته\n المتخلق بأخلاقه\n صار مظنة أن يتوهم أن نسبة ظهوره إلى المظاهر كلها على السواء\n فما وجه التخصيص باختيار بعض بالمتابعة؟ أشار سبحانه إلى دفعه\n بأن من سنتنا تفضيل بعض مظاهرنا على بعض فقال: { إِنَّ ٱللَّهَ ٱصْطَفَىٰ } اختار واجتبى { ءَادَمَ } بالخلافة والنيابة\n وأمر الملائكة الذين يدعون الفضيلة عليه بسجوده كرمه على جميع مخلوقاته { وَ } أيضاً اصطفى { نُوحاً } بالنجاة والخلاص\n وإغراق جميع من في الأرض بدعائه { وَ } كذا اصطفى { آلَ إِبْرَاهِيمَ } أي: أهل بيته بالإمامة والخلافة\n لذلك دعا إبراهيم عليه السلام ربه بألاَّ يخرج الزمان عن إمامة ذريته إلى يوم القيامة { وَ } كذا اختار { آلَ عِمْرَانَ عَلَى ٱلْعَالَمِينَ } [آل عمران: 33] بإرهاصات ومعجزات لم يظهر من آحد مثلها\n مثل: إبراء الأكمه والأبرص وإحياء الموتى والولادة بلا أب وغير ذلك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:35",
      "similarity": 0.6664689110159908
    },
    {
      "verse": "66:12",
      "similarity": 0.5375536999405646
    },
    {
      "verse": "37:153",
      "similarity": 0.22734307219968738
    },
    {
      "verse": "38:47",
      "similarity": 0.22581844567219853
    },
    {
      "verse": "22:75",
      "similarity": 0.22244255644619176
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}