{
  "chapter": "آل عمران",
  "text": "اذ قالت امرات عمرن رب انى نذرت لك ما فى بطنى محررا فتقبل منى انك انت السميع العليم",
  "translations": [
    {
      "translation": "descendants one of the other. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, when the wife of 'Imran prayed: \"O Lord, I offer what I carry in my womb in dedication to Your service, accept it, for You hear all and know everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He also heard) when the woman of 'Imran said: 'O Lord! Behold, unto You do I vow that the child in my womb is to be devoted to Your exclusive service. Accept it, then, from me. Surely You alone are All-Hearing, All-Knowing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Imran's wife prayed to her Lord saying, \"I have made a vow to dedicate to Your service whatever is in my womb. Lord, accept it from me. You are All-hearing and All-knowing\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) When the wife of Imran said, “My Lord! I pledge to you what is in my womb – that it shall be dedicated purely in Your service, so accept it from me; indeed You only are the All Hearing, the All Knowing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the wife of `Imran said: \"O my Lord! I have vowed to You what is in my womb to be dedicated for Your services, so accept this from me. Verily, You are the All-Hearer, the All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a woman of Imran said: My Lord! surely I vow to Thee what is in my womb, to be devoted (to Thy service); accept therefore from me, surely Thou art the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the wife of Imran said, 'Lord, I have vowed to Thee, in dedication, what is within my womb. Receive Thou this from me; Thou hearest, and knowest.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the wife of 'Imran said: My Lord! I have vowed unto Thee that which is in my belly as a consecrated (offering). Accept it from me. Lo! Thou, only Thou, art the Hearer, the Knower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when the wife of 'Imran said, \"My Lord, I have dedicated what is in my womb entirely to Your service. So accept this from me. You are the One who hears and knows all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time the wife of 'lmran said my Lord verily have vowed unto Thee that which is in my belly to be dedicated; accept Thou then of me. Verily Thou! Thou art the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the wife of Imran said, ‘My Lord, I dedicate to You in consecration what is in my belly. Accept it from me; indeed You are the All-hearing, the All-knowing.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! a woman of 'Imran said: \"O my Lord! I do dedicate unto Thee what is in my womb for Thy special service: So accept this of me: For Thou hearest and knowest all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the wife of 'Imran said: \"O my Lord! I have vowed to You what (the child that) is in my womb to be dedicated for Your services (free from all worldly work; to serve Your Place of worship), so accept this, from me. Verily, You are the All-Hearer, the All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the wife of 'Imran said: 'Lord, I have vowed to You in dedication that which is hidden inside me. Accept this from me. You are the Hearer, the Knower'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wife of Imran said, “My Lord, I have vowed to You what is in my womb, dedicated, so accept from me; You are the Hearer and Knower.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention, O Muhammad], when the wife of 'Imran said, \"My Lord, indeed I have pledged to You what is in my womb, consecrated [for Your service], so accept this from me. Indeed, You are the Hearing, the Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:35] Mention, when the wife of ‘Imrān, Hanna, said, after she had reached old age and longed for a child, and supplicated to God and sensed that she was carrying child, ‘O, Lord, I have vowed to, offer, You what is within my womb as a consecration, [one] liberated and delivered from the distractions of this world for the service of Your Holy House [in Jerusalem]. Accept this from me. Lo! It is You Who are the Hearer, of petition, the Knower, of intentions. ‘Imrān died while she was still pregnant.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Remember, Muhammad (When the wife of Imran) Hannah, the mother of Mary (said: My Lord I have vowed unto Thee that which is in my belly as a consecrated (offering)) a servant at the Sanctuary of Jerusalem. (Accept it from me. Lo! Thou, only Thou, art the Hearer) of prayers, (the Knower!) of the answer and of that which is in my womb.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّراً } معناهُ خَالِصٌ دائِمٌ لاَ يُخالِطَهُ شَيءٌ مِن أَمْرِ الدُّنيا\n والمُحَرَّرُ: المُعْتَقُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والله سَميعٌ } حين قالت امرأة عمران: { رب إني نَذَرت } إلى قولها: { عليمٌ } بنيتها كما شهدت بقولها { إنك أنتَ السَميع العليم }\n واعلم أن النيّات وهيئات النفس مؤثرة في نفس الولد، كما أن الأغذية مؤثرة في بدنه\n فمن كان غذاؤه حلالاً طيباً وهيئات نفسه نورية ونيّاته صادقة حقانيّة، جاء ولده مؤمناً صديقاً أو وليّاً أو نبيّاً\n ومن كان غذاؤه حراماً وهيئات نفسه ظلمانية خبيثة ونياته فاسدة رديئة جاء ولده فاسقاً أو كافراً خبيثاً\n إذ النطفة التي يتكوّن الولد منها متولدة من ذلك الغذاء، مربّاة بتلك النفس، فتناسبها\n ولهذا قال رسول الله صلى الله عليه وسلم:\n\n \" الولد سرّ أبيه \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل لمن تبعك من مناقب آل عمران وقت { إِذْ قَالَتِ ٱمْرَأَتُ عِمْرَانَ } حين ناجت ربها في سرها بلسان استعدادها وقت ظهور حملها، بإلقاء الله إياها: { رَبِّ } يا من رباني بحولك وقولك { إِنِّي نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّراً } معتقاً عن أمور الدنيا كلها، خالصاً لعبادتك وخدمة بيتك لا أشغله شيئاً سواه، وكان من عادتهم تحرير بعض أولادهم الذكور لخدمة بيت المقدس شرفها الله { فَتَقَبَّلْ } بلطفك { مِنِّي } ما نذرت لك للتقرب إليك يا رب { إِنَّكَ } بذاتك وصفاتك وأسمائك { أَنتَ ٱلسَّمِيعُ } لمناجاتي { ٱلْعَلِيمُ } [آل عمران: 35] بحاجاتي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إذ قالت }: ظرف لعليم، أو بإضمار اذكر\n و { محرراً }: حال، والتحرير: التخلص، يقال: حررت العبد، إذا خلصته من الرق، وحررت الكتاب، إذا أصلحته وأخلصته، ولم يبق فيه ما يحتاج إلى إصلاح، ورجل حُر، أي: خالص، ليس لأحد عليه متعلق، والطين الحُر، أي: الخالص من الحمأة\n وقوله: { وإني سميتها مريم }: عطف على { إني وضعتها } ، وما بينهما اعتراض، من كلامها على قراءة التكلم، أو من كلام الله على قراءة التأنيث\n يقول الحقّ جلّ جلاله: { إن الله اصطفى آدم } بالخلافة والرسالة، { ونوحاً } بالرسالة والنِّذَارة، { وآل إبراهيم } بالنبوة والرسالة، وهم: إسحاق، ويعقوب والأسباط، وإسماعيل، وولده سيد ولد آدم نبينا محمد صلى الله عليه وسلم بالنبوة والرسالة والمحبة الجامعة\n { وآل عمران } ، وهم موسى وهارون - عليهما السلام - وهو عمران بن يصهر بن فاهث بن لاوى بن يعقوب، أو المراد بعمران: عمران بن أشهم بن أموي، من ولد سليمان عليه السلام، وهو والد مريم أم عيسى عليه السلام، وقيل: المراد عمران بن ماثان، أحد أجداد عمران والد مريم\n وإنما خصّ هؤلاء لأن الأنبياء كلهم من نَسْلهم\n وقيل: أراد إبراهيم وعمران أنفسهما\n \" وآل \" مقحمة، كقوله:\n\n[البَقَرَة: 248] أي: موسى وهارون، فقد فضل الحقّ - جلّ جلاله - هؤلاء الأنبياء بالخصائص الجسمانية والروحانية { على العالمين } أي: كلاً على عَالَمِي زمانه، وبه استدلّ على فضلهم على الملائكة\n حال كونهم { ذرية } متشعبة { بعضها من } ولد { بعض } في النسب والدين، { والله سميع } لأقوال العباد وأعمالهم، { عليم } بسرائرهم وعلانيتهم، فيصطفي من صفا قوله وعمله، وخلص سره، للرسالة والنبوة\n ثم تخلًّص لذكر نشأة مريم، توطئة لذكر ولدها، فقال: واذكر { إذ قالت امرأة عمران } وهي حنة بنت فاقوذا، جدة عيسى عليه السلام: { ربِّ إني نذرت لك ما في بطني محرراً } لخدمة بيت المقدس، لا أشغله بشيء، أو مخلصاً للعبادة، { فتقبل مني إنك أنت السميع العليم } ، وكان المحرر عندهم، إذا حُرر، جُعل في الكنيسة يقوم عليها وينكسها، ولا يبرح منها حتى يبلغ الحلم، ثم يُخَيَّر، فإن أحبَّ أقام أو ذهب حيث شاء، ولم يكن يحرر إلا الغلمان لأن الجارية لا تصلح للخدمة لما يصيبها من حيض، فحررت أمُّ مريمَ حمْلَها تَدْرِ ما هو\n وقصة ذلك: أن زكريا وعمران تزوجا أختين، فتزوج زكريا أشياعَ بنت فاقوذا، وتزوج عمران حنة بنت فاقوذا، فكان عيسى ويحيى ابني الخالة، وكانت حنة عاقراً لا تلد، فبينما هي في ظل شجرة، بصُرت بطائر يطعم فرخاً",
      "translations": []
    }
  ]
}