{
  "chapter": "آل عمران",
  "text": "فلما وضعتها قالت رب انى وضعتها انثى والله اعلم بما وضعت وليس الذكر كالانثى وانى سميتها مريم وانى اعيذها بك وذريتها من الشيطن الرجيم",
  "translations": [
    {
      "translation": "Remember when the wife of 'Imran said, 'My Lord, I have pledged to You what is in my womb, devoting it to Your service. Please accept my prayer. You are the All-Hearing, the All-Knowing.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she had given birth to the child, she said: \"O Lord, I have delivered but a girl.\" -- But God knew better what she had delivered: A boy could not be as that girl was. \"I have named her Mary,\" (she said), \"and I give her into Your keeping. Preserve her and her children from Satan the ostracized.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when she gave birth to a female child, she said: 'O Lord! I have given birth to a female' - and Allah knew full well what she had given birth to - 'and a female is not the same as a male. I have named her Mary and commit her and her offspring to You for protection from Satan, the accursed.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the baby was born she said, \"Lord, it is a female.\" God knew this. Male and female are not alike. \"I have named her Mary. I pray that You will keep her and her offspring safe from Satan, the condemned one.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she gave birth to it, she said, “My Lord! I have indeed given birth to a girl!” And Allah well knows what she gave birth to; and the boy she had prayed for is not like this girl; “And I have named her Maryam and I give her and her offspring in Your protection, against Satan the outcast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she gave birth to her, she said: \"O my Lord! I have given birth to a female child, ـ and Allah knew better what she bore, ـ \"And the male is not like the female, and I have named her Maryam, and I seek refuge with You for her and for her offspring from Shaytan, the outcast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she brought forth, she said: My Lord! Surely I have brought it forth a female-- and Allah knew best what she brought forth-- and the male is not like the female, and I have named it Marium, and I commend her and her offspring into Thy protection from the accursed Shaitan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she gave birth to her she said, 'Lord, I have given birth to her, a female.' (And God knew very well what she had given birth to; the male is not as the female.) 'And I have named her Mary, and commend her to Thee with her seed, to protect them from the accursed Satan.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she was delivered she said: My Lord! Lo! I am delivered of a female - Allah knew best of what she was delivered - the male is not as the female; and lo! I have named her Mary, and lo! I crave Thy protection for her and for her offspring from Satan the outcast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she gave birth, she said, \"My Lord, I have given birth to a girl,\" God knew very well what she had given birth to: a male is not like a female, \"I have named her Mary and placed her and her children in Your protection from the rejected Satan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she brought her forth, she said: my Lord verily have brought forth a female - and Allah knew best that which she had brought forth, - and the male is not as the female, and verily have named her Maryam, and verily seek refuge for her and her progeny with Thee from the Satan the accursed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she bore her, she said, ‘My Lord, I have borne a female [child]’—and Allah knew better what she had borne, and the male [child she expected] was no match for the female [child she had borne] —‘and I have named her Mary, and I commend her and her offspring to Your care against [the evil of] the outcast Satan.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she was delivered, she said: \"O my Lord! Behold! I am delivered of a female child!\"- and Allah knew best what she brought forth- \"And no wise is the male Like the female. I have named her Mary, and I commend her and her offspring to Thy protection from the Evil One, the Rejected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she delivered her [child Maryam (Mary)], she said: \"O my Lord! I have delivered a female child,\" - and Allah knew better what she delivered, - \"And the male is not like the female, and I have named her Maryam (Mary), and I seek refuge with You (Allah) for her and for her offspring from Shaitan (Satan), the outcast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she was delivered of her, she said: 'Lord, I have given birth to her, a female' Allah knew of what she had given birth the male is not like the female 'and I have called her Mary. Protect her and all her descendants from satan, the stoned one'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she delivered her, she said, “My Lord, I have delivered a female,” and God was well aware of what she has delivered, “and the male is not like the female, and I have named her Mary, and have commended her and her descendants to Your protection, from Satan the outcast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when she delivered her, she said, \"My Lord, I have delivered a female.\" And Allah was most knowing of what she delivered, \"And the male is not like the female. And I have named her Mary, and I seek refuge for her in You and [for] her descendants from Satan, the expelled [from the mercy of Allah].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:36] And when she gave birth to her, a girl, and she had been hoping for a boy, since only males were consecrated to the service of God, she said, apologetically, ‘O, Lord, I have given birth to a female’ — and God knew very well what she had given birth to: a parenthetical statement constituting God’s speech (a variant reading [for wada‘at, ‘she gave birth’, has wada‘tu, ‘I gave birth’ [making these Hanna’s words, sc. ‘and God knows very well what I have given birth to’]); the male, that she had asked for, is not as the female, that was bestowed upon her, because he is designed for the service [of God], while she would not be suitable on account of her lesser physical ability, her private parts, the effects of menstruation on her, and so on. ‘And I have named her Mary, and commend her to You with her seed, her children, to protect them from the accursed, the outcast, Satan’. In a hadīth [it is stated]: ‘Every new-born is touched by Satan and begins [life] by crying, except for Mary and her son’, as reported by the two Shaykhs [Bukhārī and Muslim].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when she was delivered) what was in her womb and it was a baby girl (she said: My Lord! Lo! I am delivered of a female) a baby girl. (Allah knew best of what she was delivered. The male is not as the female) in service and weakness; (and Lo! I have named her Mary, and Lo! I crave Thy protection for her) I seek for her Your protection and safety (and for her offspring from Satan the outcast) the accursed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا وَضَعَتْهَا } أنثى آيست { قَالَتْ } متحسرة متحيرة مشتكية إلى ربها في نذرها: { رَبِّ إِنِّي } وإن بالغت في إخلاص النية في نذري لم تقبله مني يا رب أن { وَضَعْتُهَآ أُنْثَىٰ } والأنثى لا تصلح لخدمة بيتك { وَ } لما امتدت في إظهار التحزن، وبث الشكوى والتحسر نودي في سرها: لا تجزعي ولا تحزني؛ إذ { ٱللَّهُ } المطلع لإخلاص نيتك { أَعْلَمُ } منك { بِمَا وَضَعَتْ } وما ظهرت منها من البدائع والغرائب والإرهاصات الخارقة للعادات { وَلَيْسَ } مطلق { ٱلذَّكَرُ } الذي حررر لخدمة هذا البيت { كَٱلأُنْثَىٰ } التي هي هذه؛ إذ يترتب على وجود عجائب صنع الله وبدائع قدرته لما سمعت بسمع سرها ما سمعت قالت نشطة فرحانة: { وَإِنِّي سَمَّيْتُهَا مَرْيَمَ } ليكون اسمها مطابقاً لمسماها؛ لأن مريم في لغتهم بمعنى العابدة، ولما تحققت عندها بإلهام الله وقاية الله إياها وذريتها، قالت مفوضة إلى الله: { وِإِنِّي أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا } أيضاً { مِنَ ٱلشَّيْطَانِ ٱلرَّجِيمِ } [آل عمران: 36] لتكون هي وهم في حفظك وحمائك من إغوائه وإضلاله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فتحركت لذلك نفسها للولد فدعت الله تعالى، وقالت: اللهم لك علي، إن رزقتني ولداً، أن أتصدق به على بيت المقدس، يكون من سدنته وخدمه، فحملت بمريم، فهلك عمران، وحنة حامل بمريم، { فلما وضعتها } أي: النذيرة، أو ما في بطنها، قالت: { ربِّ إني وضعتها أنثى } ، قالت ذلك تحسّراً وتحزناً إلى ربها، لأنها كانت ترجوا أن تلد ذكراً يصلح للخدمة، ولذلك نذرته\n\n\nقال تعالى: { والله أعلم بما وضعت } ، تعظيماً لموضوعها وتنويهاً بشأنها، أو من كلامها - على قراءة التكلم - تسلية لنفسها، أي: ولعل لله فيه سرّاً، قال تعالى: { وليس الذكر كالأنثى } أي: وليس الذكر الذي طلبت كالأنثى التي وهبت، أو من كلامها، أي: وليس الذكر والأنثى سيان فما نذرتُ\n ثم قالت: { وإني سميتها مريم } راجية أن يطابق اسمُها فعلها، فإن مريم في نعتهم في العابدة الخادمة، وكانت مريم أجمل النساء في وقتها وأفضلهن، وفي الحديث عنه صلى الله عليه وسلم:\n\n \" حَسْبُكَ من نساءِ العالمين أربع: مريم بنت عمران، وآسية امرأة فرعون، وخديجة بنت خويلد، وفاطمة بنت محمد صلى الله عليه وسلم \"\n \n\nثم قالت حنة أم مريم: { وإني أعيذها بك } أي: أحصنها بك { وذريتها من الشيطان الرجيم } أي: المرجوم بالشهب، أو المطرود، وفي الحديث:\n\n \" مَا مِنْ مَوْلُودٍ يُولَدُ إلاَّ والشَّيْطَانُ يَمَسُّهُ حِينَ يُولَد فَيَسْتَهِلُّ مِنْ مَسِّهِ، إلاَّ مَرْيَمَ وابْنهَا \" \n\nومعناه: أن الشيطان يطمع في إغواء كل مولود، بحيث يتأثر به، إلا مريم وابنها لمكان الاستعاذة، قلت: وكذا الأنبياء كلهم، لا يمسهم لمكان العصمة\n والله أعلم",
      "translations": []
    }
  ]
}