{
  "chapter": "آل عمران",
  "text": "فتقبلها ربها بقبول حسن وانۢبتها نباتا حسنا وكفلها زكريا كلما دخل عليها زكريا المحراب وجد عندها رزقا قال يمريم انى لك هذا قالت هو من عند الله ان الله يرزق من يشاء بغير حساب",
  "translations": [
    {
      "translation": "When she gave birth, she said, 'My Lord! I have given birth to a girl' - and Allah knew very well what she had given birth to, male and female are not the same - 'and I have named her Maryam and placed her and her children in Your safekeeping from the accursed Shaytan.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her Lord accepted her graciously, and she grew up with excellence, and was given into the care of Zachariah. Whenever Zachariah came to see her in the chamber, he found her provided with food, and he asked: \"Where has this come from, O Mary?\" And she said: \"From God who gives food in abundance to whomsoever He will.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon her Lord graciously accepted Mary and vouchsafed to her a goodly growth and placed her in the care of Zechariah. Whenever Zechariah visited her in the sanctuary, he found her provided with food. He asked her: 'O Mary, how did this come to you?' She said: 'It is from Allah. Allah provides sustenance to whom He wills beyond all reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her Lord graciously accepted the offer and made Mary grow up, pure, and beautiful. Zachariah took custody of her. Whenever he went to visit her in her place of worship, he would find with her some food. He would ask her, \"Where did this food come from?\" She would reply, \"God has sent it.\" God gives sustenance to whomever He wants without keeping an account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So her Lord fully accepted her (Maryam), and gave her an excellent development; and gave her in Zakaria’s guardianship; whenever Zakaria visited her at her place of prayer, he found new food with her; he said, “O Maryam! From where did this come to you?” She answered, “It is from Allah; indeed Allah gives to whomever He wills, without limit account.” (Miracles occur through the friends of Allah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So her Lord (Allah) accepted her with goodly acceptance. He made her grow in a good manner and put her under the care of Zakariyya. Every time he entered the Mihrab to (visit) her, he found her supplied with sustenance. He said: \"O Maryam! From where have you gotten this\" She said, \"This is from Allah.\" Verily, Allah provides sustenance to whom He wills, without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So her Lord accepted her with a good acceptance and made her grow up a good growing, and gave her into the charge of Zakariya; whenever Zakariya entered the sanctuary to (see) her, he found with her food. He said: O Marium! whence comes this to you? She said: It is from Allah. Surely Allah gives to whom He pleases without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her Lord received the child with gracious favour, and by His goodness she grew up comely, Zachariah taking charge of her. Whenever Zachariah went in to her in the Sanctuary, he found her provisioned. 'Mary,' he said, 'how comes this to thee?' 'From God,' she said. Truly God provisions whomsoever He will without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And her Lord accepted her with full acceptance and vouchsafed to her a goodly growth; and made Zachariah her guardian. Whenever Zachariah went into the sanctuary where she was, he found that she had food. He said: O Mary! Whence cometh unto thee this (food)? She answered: It is from Allah. Allah giveth without stint to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her Lord graciously accepted her and made her grow in goodness and entrusted her to the care of Zachariah. Every time Zachariah visited her in her chamber he found some provision with her. He asked, \"Mary, where did this provision come from?\" She replied, \"This is from God. God provides for whoever He wills without measure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then her Lord accepted her with goodly acceptance and made her grow up with a goodly growth, and He made Zakariyya take care of her. So oft as Zakariyya entered the apartment to see her, he found provision by her. He said: O Maryam! whence hast thou this! She said this is from before Allah. Verily Allah provideth for whomsoever He will without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon her Lord accepted her with a gracious acceptance, and made her grow up in a worthy fashion, and He charged Zechariah with her care. Whenever Zechariah visited her in the sanctuary, he would find provisions with her. He said, ‘O Mary, from where does this come for you?’ She said, ‘It comes from Allah. Allah provides whomever He wishes without any reckoning.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Right graciously did her Lord accept her: He made her grow in purity and beauty: To the care of Zakariya was she assigned. Every time that he entered (Her) chamber to see her, He found her supplied with sustenance. He said: \"O Mary! Whence (comes) this to you?\" She said: \"From Allah: for Allah Provides sustenance to whom He pleases without measure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So her Lord (Allah) accepted her with goodly acceptance. He made her grow in a good manner and put her under the care of Zakariya (Zachariya). Every time he entered Al-Mihrab to (visit) her, he found her supplied with sustenance. He said: \"O Maryam (Mary)! From where have you got this?\" She said, \"This is from Allah.\" Verily, Allah provides sustenance to whom He wills, without limit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her Lord graciously accepted her. He made her grow with a fine upbringing and entrusted her to the care of Zachariah. Whenever Zachariah went to her in the sanctuary, he found that she had provision with her. 'Mary' he said, 'how does this come to you' 'It is from Allah' she answered. Truly, Allah provides whomsoever He will without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her Lord accepted her with a gracious reception, and brought her a beautiful upbringing, and entrusted her to the care of Zechariah. Whenever Zechariah entered upon her in the sanctuary, he found her with provision. He said, “O Mary, where did you get this from?” She said, “It is from God; God provides to whom He wills without reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So her Lord accepted her with good acceptance and caused her to grow in a good manner and put her in the care of Zechariah. Every time Zechariah entered upon her in the prayer chamber, he found with her provision. He said, \"O Mary, from where is this [coming] to you?\" She said, \"It is from Allah. Indeed, Allah provides for whom He wills without account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:37] Her Lord accepted the child, that is, He received Mary from her mother, with gracious acceptance, and made her grow excellently, He made her grow up with excellent character. She would grow in a day by as much as a new-born grew during a year. Her mother took her to the priests, the keepers of the Holy House [of Jerusalem] and said: ‘This here before you is the dedication [I offered]’. They competed for [guardianship of] her, because she was the daughter of their religious leader, at which point Zachariah said, ‘I am most worthy of her, for, her maternal aunt lives with me’. The others said, ‘No, [not until] we have cast lots’. Thus, all twenty nine of them departed to the River Jordan, where they cast their quills, agreeing that the one whose quill remained fast and floated to the surface of the water would be most worthy of [being guardian over] her. Zachariah’s quill remained fast [and surfaced]. He took [charge of] her and built for her a gallery-room with a ladder in the temple, and none apart from him went up to her. He used to bring her food, drink and oil, and would find her with summer fruits in winter, and winter fruits in summer, just as God says, and Zachariah took charge of her, he took her to him (a variant reading [of kafalahā, ‘he took charge of her’] is kaffalahā, ‘He [God] gave Zachariah charge of her’, with Zakariyyā’, or Zakariyyā, in the accusative and ‘God’ as the subject of the verb). Whenever Zachariah went into the sanctuary, that is, the room, the most noble seat [in the temple], where she was, he found her with provisions. ‘O Mary,’ he said, ‘Whence comes this to you?’ She, still very young, said, ‘From God, He sends it to me from Paradise,’ ‘Truly God provides, abundant provision, for whomever He will without reckoning’, without consequence.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And her Lord accepted her with full acceptance) He was good to her and accepted her instead of accepting a boy (and vouchsafed to her a goodly growth) He nurtured her well in worship throughout the years, months, days and hours; (and made Zachariah her guardian) he joined her to him for training. (Whenever Zachariah went into the sanctuary where she was) the room where she worshipped, (he found that she had food) the fruit of winter in the summer, such as culms of corn, and the fruits of summer in the winter such as grapes. (He said: Mary! Whence cometh unto thee this (food)?) how did you get this food out of its season? (She answered: It is from Allah) Gabriel brought it to me. (Allah giveth without stint) without pause or measure (to whom He will) in its season or out of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَفَّلَهَا زَكَرِيَّا } معناهُ ضَمَّها\n\n\n\n\nوقوله تعالى: { كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا ٱلْمِحْرَابَ } فالمِحْرَابُ: سَيدُ المَجَالِسِ، ومُقَدمُهَا وأَشْرَفُها، وكَذَلِكَ المَساجِدُ\n\n\n\n\nوقوله تعالى: { أَنَّىٰ لَكِ هَـٰذَا } معناهُ مِن أَينَ لَكِ هَذا\n\n",
      "translations": [
        {
          "translation": " The meaning of the phrase { Kaf-fala-ha Zaka-riy-ya } is to include her.\n\n\nAnd His saying, {Whenever Zechariah entered the prayer chamber} - the prayer chamber being the master of all chambers and its foremost and most noble - similarly with mosques.\n\n\nAnd His saying, {How could this be for you?} Its meaning is, where does this come from for you?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فكان صدق مريم وبنوة عيسى عليهما السلام بركة صدق أبيها { وجدَ عندها رِزقاً } يجوز أن يراد به الرزق الروحاني من المعارف والحقائق والعلوم والحِكَم الفائضة عليها من عند الله\n إذ الاختصاص بالعندية يدلّ على كونها من الأرزاق اللدنيّة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَتَقَبَّلَهَا رَبُّهَا } ما نذرت له { بِقَبُولٍ حَسَنٍ } حتى نشطت بمكاشفة اللطف من الله بعدما آيست { وَ } بعد قبول الحسن { أَنبَتَهَا } ربها بلطفه حتى صار { نَبَاتاً حَسَناً } مظهراً لعجائب صنعه وبدائع حكمته { وَ } بعدما أنبتها وتقبلها { كَفَّلَهَا } أي: جعل كفيلها وحاضنها من أحبار البيت { زَكَرِيَّا }\n\n\nروي أن حنة لما كوشفت بأمرها بإلهام الله إياها لفتها في خرقه وحملتها إلى المسجد ووضعتها عند الأحبار المجاورين فيه على العادة المستمرة\n وقالت: دونكم هذه النذيرة\n فتخالفوا في حضانتها\n لأنها كانت بنت إمامهم وملكهم\n فقال زكريا: أنا ا\nق بحضانتها\n لأن عندي خالتها\n فأبطأ إلى أن اقترعوا وكانوا سبعة وعشرين\n فانطلقوا إلى نهر فألقوا فيها أقلامهم\n فطفا قلم زكريا ورسبت أقلامهم\n فتكلفها في بيت لا باب له إلا كوة في سقفه\n\n\nفلما أراد زكريا أن يأتي برزقها نزل منها\n ولما خرج أغلق وقفل\n ثم صار { كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا ٱلْمِحْرَابَ } لتفقدها { وَجَدَ عِندَهَا رِزْقاً } من ألوان الأطعمة والفواكة\n وكان يجد عندها فاكهة الشتاء في الصيف\n والصيف في الشتاء\n فتعجب من حالها إلى أن سألها { قَالَ يٰمَرْيَمُ أَنَّىٰ لَكِ هَـٰذَا } من أين لك هذا الرزق الآتي الذي لا يشبه أطعمة الدنيا\n والفاكهة الآتية لا على وفق العادة والأبواب مغلقة عليك؟! { قَالَتْ } بإلهام الله إياها: { هُوَ مِنْ عِندِ ٱللَّهِ } المتكفل لأرزاق عباده { إِنَّ ٱللًّهَ } المراقب المحافظ لتربية مظاهره { يَرْزُقُ مَن يَشَآءُ } ما يشاء { بِغَيْرِ حِسَابٍ } [آل عمران: 37] بلا إحصاء وتعديد من حيث لا يحتسب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فتقبلها ربها } أي: رَضِيَها في النذر مكان الذكَر\n { بقبول حسن } أي: بوجه حسن\n وهو إقامتها مقام الذكر\n وتسلمها للخدمة عقب ولادتها قبل أن تكبر وتصلح للسِّدانة\n رُوِي: أن حنة لما ولدتها لفَّتْها في خرقة\n وحملتها إلى المسجد\n ووضعتها عند الأحبار\n وقالت: دونكم هذه النذيرة\n فتنافسوا فيها\n فأنها كانت ابنة إمامهم\n وصاحب قربانهم\n فإن بني ماثان كانت رؤوس بني إسرائيل وملوكهم\n فقال زكريا: أنا أحق بها\n عندي خالتها\n فأبوا إلا القرعة\n وكانوا سبعة وعشرين\n فانطلقوا إلى نهر\n فألقوا فيه أقلامهم\n فطفا قلم زكريا - أي: علا - على وجه الماء\n ورسبت أقلامهم\n فأخذها زكريا\n { وأنبتها } الله { نباتاً حسناً } أي: رباها تربية حسنة\n فكانت تشب في اليوم ما يشب المولود في العام\n { وكفلها زكريا } أي: ضمها إليه وقام بأمرها\n وقرأ عاصم - في رواية ابن عياش - بشدِّ الفاء\n أي: وكفَّلها اللّهُ زكريا\n أي: جعله كافلاً لها وحاضناً\n رُوِيَ: أنه لما ضمها إليه بنى لها بيتاً\n واسترضع لها\n فلما بلغت\n بنى لها محراباً في المسجد\n وجعل بابه في وسطه لا يرقى إليها إلا بسلم\n ولا يصعد إليها غيره\n وكان يأتيها بطعامها وشرابها كل يوم\n وكان إذا خرج أغلق عليها سبعة أبواب\n\n{ كلما دخل عليها زكريا المحراب } ليأتيها بطعامها\n { وجد عندها رزقاً } أي: فاكهة في غير حينها\n يجد فاكهة الشتاء في الصيف\n وبالعكس\n { قال يا مريم أنى لك هذا } أي: من أين لك هذا الرزق الآتي في غير أوانه\n والأبواب مغلقة عليك؟ { قالت هو من عند الله } فلا يُستبعد\n قيل: تكلمت صغيرة\n وقيل: لم ترضع ثدياً قط\n خلاف ما تقدم\n وكان رزقها ينزل عليها من الجنة\n ثم قالت: { إن الله يرزق من يشاء بغير حساب } أي: بغير تقدير\n أو بغير استحقاق تفضلاً منه\n وقوله: { كلما }: يقتضي التكرار\n وفيه إشارة إلى أن زكريا لم يَذَرْ تَعهُّدهَا\n ولم يعتمد على ما كان يجد عندها\n بل كان يتفقد حالها كل وقت\n لأن الكرامات للأولياء ليس مما يجب أن تدوم قطعاً\n بل يجوز أن يظهر ذلك عليهم دائماً وألا يظهر\n فما كان زكريا معتمداً على ذلك\n فيترك تفقد حالها\n ثم كان يجدد السؤال بقوله: { يا مريم أنى لك هذا } \n لجواز أن يكون الذي هو اليوم لا على الوجه الذي كان بالأمسن فإنه لا واجب على الله - سبحانه - قاله القشيري\n رَوى جابر بنُ عبد الله أن النبيّ صلى الله عليه وسلم أقام أياماً لم يطعم الطعام\n فقام في منازل أزواجه\n فلم يُصِبْ عندهم شيئاً\n فأتى فاطمة فقال:\n \" يا بُنيةُ\n هل عندك شيء؟ \" \nفقالت: لا والله\n بأبي أنت وأمي\n فلما خرج النبيّ صلى الله عليه وسلم\n بعثت إليها جارتُها برَغِيفَيْن وبِضْعَة لَحْم\n فبعثت حَسَناً وحُسَيْناً إلى النبيّ صلى الله عليه وسلم\n فجاء\n فكشفت له الجفنة\n فإذا الجفنة مملوءة خُبْزاً ولَحْماً\n فَبُهِتَتْ\n وعرفت أنَّهَا بَرَكَةٌ مِن اللهِ تعالى\n فقال النبي صلى الله عليه وسلم: \" من أين لك هذا يا بُنَيْةُ؟ \" قالت: { من عند الله إن الله يرزق من يشاء بغير حساب } \n فحمد الله تعالى\n وقال:\n \" الحمْدُ للّهِ الَّذِي جَعلَك شَبِيهَةً بسَيِّدَةِ بَنِي إسْرَائِيل\n فإنها كانت إذا رزقها الله شيئاً قالت: { هو من عند الله إن الله يرزق من يشاء بغير حساب } \" \nثم بعث النبيّ صلى الله عليه وسلم إلى عَليٍّ رضي الله عنه\n ثم أكل أهلُ البيت كلهم\n وجميع أزواج النبيّ صلى الله عليه وسلم\n وبقيت الجَفْنة كما هي\n فأَوْسَعَتْ علَى الجيران\n وجعل الله فيها بركة وخيراً\n انتهى\n الإشارة: { إن الله اصطفى آدم ونوحاً وآل إبراهيم وآل عمران على العالمين } \n إنما اصطفى الحق تعالى هؤلاء الرسل لكونهم قد أظهروا الدين بعد انطماس أنواره\n وجددوه بعد خمود أسراره\n هم أئمة الهدى ومقتبس أنوار الاقتداء\n فكل من كان على قدمهم من هذه الأمة المحمدية\n بحيث يجدد للناس دينهم\n ويُبين للناس معالم الطريق وطريق السلوك إلى عين التحقيق\n فهو ممن اصطفاه الله على عالمي زمانه\n\nوفي الحيدث:\n \" إنَّ الله يَبْعَثُ عَلَى رَأسِ كُلِّ مِائَةِ سَنَةٍ مَنْ يُجَدِّدُ لهذه الأمة دِينَهَا \" \nقال الحريري: مات الحسن البصري عشية جمعة - أي: بعد زوالها - فلما صلّى الناس الجمعة حملوه\n فلم يترك الناس صلاة العصر في مسجد الجماعة بالبصرة منذ كان الإسلام\n إلا يوم مات الحسن\n واتبع الناس جنازته\n فلم يحضر أحد في المسجد صلاة العصر\n قال: وسمعت منادياً ينادي: { إن الله اصطفى آدم ونوحاً وآل إبراهيم وآل عمران على العالمين } \n واصطفى الحسن على أهل زمانه\n قلت: والحسن البصري هو الذي أظهر علم التصوّف\n وتكلم فيه وهذبه\n قال في القوت: وهو إمامنا في هذا العلم - يعني علم التصوف\n وقوله تعالى: { إذ قالت امرأة عمران }\n\n\n الآية\n كُلُّ من ذنر نفسه وحررها لخدمة مولاه\n تقبلها الله منه بقبول حسن\n وأنبت فيها المعرفة نباتاً حسناً\n وكفلها بحفظه ورعايته\n وضمها إليه بسابق عنايته\n ورزقها من طُرَفِ الحكم وفواكه العلوم\n مما لا يتحيط به العقول وغاية الفهوم\n فإذا قال لنفسه: من أين لك هذا؟ { قالت: هو من عند الله إن الله يرزق من يشاء بغير حساب }\n وأنشدوا:\nوقال القشيري: قوله تعالى: { فتقبلها ربها بقبول حسن } \n يقال: منَ القبول الحسن أنه لم يطرح كَلَّهَا وشَغْلَهَا على زكريا\n فكان إذا دخل عليها زكريا ليتعاهدها بطعام وجد عندها رزقاً\n ليعلَم العالمون أن الله - تعالى - لا يُلقى شغل أوليائه على غيره\n ومن خدم وليّاً من أوليائه كان هو في رفق الولي\n وهذه إشارة لمن يخدم الفقراء\n يعلم أنه في رفقهم\n لا أن الفقراء تحت رفقه\n هـ\n قال أهل التفسير: فلما رأى زكريا ما يأتي لمريم من الفواكه في غير أوانها\n قال: إن الذي قدر على أن يأتي مريم بالفاكهة في غير وقتها\n قادر على أن يصلح زوجتي\n ويهب لي ولداً على الكبر\n فطلب الولد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:2",
      "similarity": 0.4634018193820215
    },
    {
      "verse": "19:7",
      "similarity": 0.4259448378664919
    },
    {
      "verse": "3:38",
      "similarity": 0.34280791726376353
    },
    {
      "verse": "21:89",
      "similarity": 0.33781320750934135
    },
    {
      "verse": "57:28",
      "similarity": 0.29231225289177565
    }
  ]
}