{
  "chapter": "آل عمران",
  "text": "هنالك دعا زكريا ربه قال رب هب لى من لدنك ذرية طيبة انك سميع الدعاء",
  "translations": [
    {
      "translation": "Her Lord accepted her with approval and made her grow in health and beauty. And Zakariyya became her guardian. Every time Zakariyya visited her in the Upper Room, he found food with her. He said, 'Maryam, how did you come by this?' She said, 'It is from Allah. Allah provides for whoever He wills without any reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then prayed Zachariah to his Lord: \"O Lord, bestow on me offspring, virtuous and good, for You answer all prayers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Zechariah prayed to his Lord: 'O Lord! Grant me from Yourself out of Your grace the gift of a goodly offspring, for indeed You alone heed all Prayers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Zachariah prayed to his Lord there, saying, \"Lord, grant me, by Your Grace, virtuous offspring. You hear all prayers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is here that Zakaria prayed to his Lord; he said, “My Lord! Give me from Yourself a righteous child; indeed You only are the Listener Of Prayer.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At that time Zakariyya invoked his Lord, saying: \"O my Lord! Grant me from You, a good offspring. You are indeed the All-Hearer of invocation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There did Zakariya pray to his Lord; he said: My Lord! grant me from Thee good offspring; surely Thou art the Hearer of prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Zachariah prayed to his Lord saying, 'Lord, give me of Thy goodness a goodly offspring. Yea, Thou hearest prayer.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Zachariah prayed unto his Lord and said: My Lord! Bestow upon me of Thy bounty goodly offspring. Lo! Thou art the Hearer of Prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Zachariah prayed to his Lord, saying, \"Lord, grant me by Your own grace virtuous offspring. You are the hearer of all prayers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forthwith Zakariyya prayed unto his Lord my Lord bestow on me from Thine presence a goodly offspring; verily Thou! Thou art the Hearer of prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereat Zechariah supplicated his Lord. He said, ‘My Lord! Grant me a good offspring from You! Indeed You hear all supplications.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There did Zakariya pray to his Lord, saying: \"O my Lord! Grant unto me from Thee a progeny that is pure: for Thou art He that heareth prayer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At that time Zakariya (Zachariya) invoked his Lord, saying: \"O my Lord! Grant me from You, a good offspring. You are indeed the All-Hearer of invocation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Zachariah supplicated to his Lord, saying: 'Lord, give me from You a good offspring. You hear all prayers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Zechariah prayed to his Lord; he said, “My Lord, bestow on me good offspring from Your presence; You are the Hearer of Prayers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At that, Zechariah called upon his Lord, saying, \"My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:38] Then, when Zachariah had seen this and realised that the One with power to bring something about in other than its [natural] time, is able to bring about a child in old age, and with those of his family line all deceased, Zachariah prayed to his Lord, when he entered the sanctuary to pray in the middle of the night, saying, ‘Lord, bestow upon me from You a goodly offspring, a righteous son, verily, You are the Hearer of,   [You are] the One Who answers, supplication’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then) at that point (Zachariah prayed unto) and wished from (his Lord and said: My Lord! Bestow upon me of Thy bounty) from You (goodly offspring) a righteous child. (Lo! Thou art the Hearer of Prayer) You are the One Who answers prayers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما سمع زكريا منها ما سمع ورأى ما رأى { هُنَالِكَ } أي: في ذلك الوقت والزمان { دَعَا زَكَرِيَّا } المراقب لنفحات الله في جميع حالاته { رَبَّهُ } الذر رباه بتعرض نفحاته لإصلاح حاله متمنياً في دعائه خلفاً يحيي اسمه حيث { قَالَ رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً } بريئة عن جميع الرذائل والنقائض كما وهبتها لامرأة عمران { إِنَّكَ } بإحاطتك على سرائر عبادك { سَمِيعُ ٱلدُّعَآءِ } [آل عمران: 38] أي: الدعاء الصادر عن ألسنة استعداداتهم بإلقائك على قلوبهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { هنالك }: اسم إِشارة للبعيد، والكاف: حرف خطاب، يطابق المخاطب في التذكير والتأنيث والإفراد والجمع في الغالب\n والمحراب: مفعال، من الحرب، وهو الموضع المعد للعبادة، كالمسجد ونحوه، سمي به، لأنه محل محاربة الشيطان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:2",
      "similarity": 0.53669615924309
    },
    {
      "verse": "19:7",
      "similarity": 0.46528651455228187
    },
    {
      "verse": "21:89",
      "similarity": 0.3745535828061951
    },
    {
      "verse": "18:44",
      "similarity": 0.3544098097975875
    },
    {
      "verse": "3:37",
      "similarity": 0.34280791726376353
    }
  ]
}