{
  "chapter": "آل عمران",
  "text": "فنادته الملئكة وهو قائم يصلى فى المحراب ان الله يبشرك بيحيى مصدقۢا بكلمة من الله وسيدا وحصورا ونبيا من الصلحين",
  "translations": [
    {
      "translation": "Then and there Zakariyya called on his Lord and said, 'O Lord, grant me by Your favour an upright child. You are the Hearer of Prayer.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the angels said to him as he stood in the chamber at prayer: \"God sends you good tidings of John who will confirm a thing from God and be noble, continent, and a prophet, and one of those who are upright and do good.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As he stood praying in the sanctuary, the angels called out to him: 'Allah gives you good tidings of John (Yahya), who shall confirm a command of Allah, shall be outstanding among men, utterly chaste, and a Prophet from among the righteous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he was standing during prayer in his place of worship, the angels called him saying, \"God gives you the glad news of the birth of your son, John who will be a confirmation of (Jesus) the Word of God. He will become a chaste, noble leader and one of the righteous Prophets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the angels called out to him while he was standing, offering prayer at his place of worship, “Indeed Allah gives you glad tidings of Yahya (John), who will confirm a Word (or sign) from Allah, – a leader, always refraining from women, a Prophet from one of Our devoted ones.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the angels called him, while he was standing in prayer in the Mihrab, (saying): \"Allah gives you glad tidings of Yahya, believing in the Word from Allah, and Sayyidan, and Hasuran, a Prophet, from among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the angels called to him as he stood praying in the sanctuary: That Allah gives you the good news of Yahya verifying a Word from Allah, and honorable and chaste and a prophet from among the good ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the angels called to him, standing in the Sanctuary at worship, 'Lo, God gives thee good tidings of John, who shall confirm a Word of God, a chief, and chaste, a Prophet, righteous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the angels called to him as he stood praying in the sanctuary: Allah giveth thee glad tidings of (a son whose name is) John, (who cometh) to confirm a word from Allah lordly, chaste, a prophet of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As he stood praying in the chamber, the angels called out to him, saying, \"God gives you the good news of John, who shall confirm the Word from God, and [shall be] outstanding among men, and utterly chaste, and a prophet from among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the angels called unto him even while he stood Praying in the apartment: verily Allah announceth unto thee Yahya confessing to a word from Allah, and a leader, and a chaste and a prophet of the righteous one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, as he stood praying in the sanctuary the angels called out to him: ‘Allah gives you the good news of John, as a confirmer of a Word of Allah, eminent and chaste, a prophet, and one of the righteous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While he was standing in prayer in the chamber, the angels called unto him: \"Allah doth give thee glad tidings of Yahya, witnessing the truth of a Word from Allah, and (be besides) noble, chaste, and a prophet,- of the (goodly) company of the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the angels called him, while he was standing in prayer in Al-Mihrab (a praying place or a private room), (saying): \"Allah gives you glad tidings of Yahya (John), confirming (believing in) the Word from Allah [i.e. the creation of 'Iesa (Jesus), the Word from Allah (\"Be!\" - and he was!)], noble, keeping away from sexual relations with women, a Prophet, from among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the angels called out to him when he was standing in the sanctuary worshipping, saying: 'Allah gives you glad tidings of John, who shall confirm a Word from Allah. He shall be a master and chaste, a Prophet and from the righteous'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the angels called out to him, as he stood praying in the sanctuary: “God gives you good news of John; confirming a Word from God, and honorable, and moral, and a prophet; one of the upright.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the angels called him while he was standing in prayer in the chamber, \"Indeed, Allah gives you good tidings of John, confirming a word from Allah and [who will be] honorable, abstaining [from women], and a prophet from among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:39] And the angels, namely, Gabriel, called to him, standing in the sanctuary, in the temple, at worship that (anna, means bi-anna; a variant reading has inna, implying a direct speech statement) ‘God gives you good tidings (read yubashshiruka, or yubshiruka) of John, who shall confirm a Word, being, from God, namely, Jesus, that he is God’s Spirit; he is referred to as [God’s] ‘Word’, because he was created through the word kun, ‘Be’; a lord, with a following, and one chaste, forbidden from women, and a prophet of the righteous’: it is said that he never sinned and never so intended.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the angels) i.e. the Angel Gabriel (called to him as he stood praying in the sanctuary) in the mosque: (Allah giveth thee glad tidings of John) a son whose name is John, ((who cometh) to confirm a Word from Allah) Jesus son of Mary that he will be a word from Allah, created without a father, (lordly) who is clement when wronged, (chaste) has no desire for women, (a Prophet of the righteous) among the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَيِّداً وَحَصُوراً } فالسَّيِّدُ: التّقِيُ\n والسَّيِّدُ: الحَلِيمُ والحَصُورُ: الذي لاَ يولَدُ لَهُ\n والحَصُورُ: العِنِّينُ\n والحَصُورُ: الذَي لاَ يأْتِي النِّساءَ\n والحَصُورُ: الذي لَيسَ لَهُ ماءٌ\n والحَصُورُ: الذي يَكُونُ مَعَ النَّدامى وَلاَ يُخْرِجُ شَيئاً\n والحَصُورُ: الذي لاَ يُخْرِجُ سِراً أَبَداً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Exalted and Majestic} - the Exalted is the one who is free from all defects and the Majestic is the one who is in complete control.\n\n\nAnd the master: the patient and the prudent: the one who is not born to him\n\n\nThe eyes are the windows of the soul.\n\n\n{And al-Hasūr: the one who does not come to women}\n\n\nAnd Al-Hasūr: he who has no water.\n\n\nThe Haṣūr is one who is with the Nādāmī and does not leave anything behind.\n\n\nThe Hāsūr is the one who never reveals a secret.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ الله يبشرك بيحيى } العقل بالفعل { مصدّقاً } بعيسى القلب\n مؤمناً به\n وهو كلمة من الله لتقدّسه عن عالم الأجرام والتولّد عن الموادّ { وسيداً } لجميع أصناف القوى { وحصوراً } مانعاً نفسه عن مباشرة الطبيعة الجسمانية وملابسة طبائع القوى البدنية { ونبيّاً } بالإخبار عن المعارف والحقائق الكلية\n وتعليم الأخلاق الجميلة\n والتدابير السديدة بأمر الحق { من الصالحين }\n ومن جملة المفارقات والمجرّدات التي تصلح بأفعالها أن تكون من مقرّبي حضرة الله تعالى بعد أن بلغ الفكر كبر منتهى طوره ولم يكن منتهياً إلى إدراك الحقائق القدسية\n والمعارف الكلية\n وكانت امرأته التي هي طبيعة الروح النفسانية لأنها محل تصرّف الفكر عاقراً بالنور المجرّد\n وعلامة ذلك\n أي: علامة حصول النور المجرّد وظهوره من النفس الزكيّة\n إمساكه عن مكالمة القوى البدنية في تحصيل مطالبهم ومآربهم ومخالطتهم في فضول لذّاتهم وشهواتهم ثلاثة أيام\n كلّ يوم عقد تامّ من أطوار عمره عشر سنين\n إلا أن يرمز إليهم بإشارة خفيّة\n ويأمرهم بتسبيحهم المخصوص بكل واحد منهم من غير أن يدنو منهم في مقاصدهم\n وأن يشتغل في الأيام الثلاثة التي مداها ثلاثون سنة من ابتداء سنّ التمييز\n الذي هو العشر الأول\n بذكر ربّه في محراب الدماغ والتسبيح المخصوص به دائماً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أمر الملائكة بتبشيره { فَنَادَتْهُ ٱلْمَلاۤئِكَةُ } بأمر ربهم { وَهُوَ } في تلك الحالة مترصد للإجابة { قَائِمٌ } للخضوع والتذلل { يُصَلِّي } لله\n ويميل إليه مقبلاً عليه { فِي ٱلْمِحْرَابِ } المعد للاستقبال قائلين له\n منادين عليه: يا زكريا { أَنَّ اللَّهَ } السميع لدعائك يجيبك { يُبَشِّرُكَ بِيَحْيَـىٰ } بابن سمي من عنده بيحيى\n لتضمن دعائك بمن يحيي اسمك\n ثم لما كان الباعث لك على هذا الدعاء مشاهدة الخوارق والإرهاصات الظاهرة من مريم - رضي الله عنها - صار ابنك الموهوب لك { مُصَدِّقاً بِكَلِمَةٍ } لابنها الحاصل لها بلا مباشرة زوج بل صادرة { مِّنَ ٱللَّهِ } سمي من عنده المسيح { وَ } مع كونه مصدقاً بعيسى عليه السلام بصير { سَيِّداً } فائقاً على أهل زمانه بالزهد والتقوى\n فإنه عليه السلام كان في حايته ما هم بمعصية قط { وَ } مع كون يحيى سيداً ورئيساً في قومه { حَصُوراً } مبالغاً في حبس نفسه عن مشتهياتها مع القدرة عليها { وَ } يصير بسبب اتصافه بالأوصاف المذكورة { نَبِيّاً مِّنَ } الأنبياء { ٱلصَّالِحِينَ } [آل عمران: 39] لتبليغ أحكام الله إلى عباده وأهدائهم إلى جنابه\n\n\nولما سمع زكريا من الملائكة ما سمع { قَالَ } متحيراً مستعبداً لكونه على خلاف جري العادة: { رَبِّ } يا من رباني بنعمك إلى كبر سني { أَنَّىٰ } من أين { يَكُونُ لِي غُلاَمٌ } في هذا السن { وَقَدْ بَلَغَنِي ٱلْكِبَرُ } غايتها { وَ } الحال إن { ٱمْرَأَتِي عَاقِرٌ } ذات عقر من الأولاد في أصل الخلقة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والملائكة }: جمع تكسير\n يجوز في فعله التذكير والتأنيث\n وهو أحسن\n تقول: قام الرجال وقامت الرجال\n فمن قرأ: { فنادته الملائكة } \n فعلى تأويل الجماعة\n ومن قرأ: { فناداه } \n أراد تنزيه الملائكة عن التأنيث\n ردّاً على الكفار\n والمراد هنا: جبريل عليه السلام كقوله:\n[النّحل: 2]\n\n[آل عِمرَان: 42]\n و { بشر }: فيها لغتان: التخفيف\n وهي لغة تهامة\n تقول: بَشَرَ يَبْشُر - بضم الشين في المضارع\n والتشديد\n وهو أفصح\n تقول بَشْر يُبَشّر تبشيراً\n يقول الحقّ جلّ جلاله: مخبراً عن زكريا عليه السلام: { هنالك } أي: في ذلك الوقت الذي رأى من الخوارق عند مريم\n { دعا زكريا ربه } \n فدخل المحراب\n وغلق الأبواب\n وقال في مناجاته: { ربّ هب لي من لدنك ذرية طيبة } \n كما وهبتها لحنَّة العجوز العاقر\n { إنك سميع الدعاء } أي: مجيبه فاسمع دعائي يا مجيب\n { فنادته الملائكة } \n وهو جبريل\n لأنه رئيس الملائكة\n والعرب تنادي الرئيس بلفظ الجميع إذ لا يخلو من أصحاب\n { وهو قائم يصلي في المحراب } رُوِيَ: أنه كان قائماً يصلّي في محرابه\n فدخل عليه شاب\n عليه ثياب بيض\n ففزع منه\n فناداه\n وقال له: { إن الله يبشرك بيحيى } \n سمي به لأن الله تعالى أحيا به عقم أمه\n أو لأن الله تعالى أحيا قلبه بمعرفته\n فلم يهم بمعصية قط\n أو لأنه استشهد\n والشهداء أحياء\n { مصدقاً بكلمة من الله } وهو عيسى\n لأنه كان بكلمة: كُنْ\n من غير سبب عادي\n و { سيداً } أي: يسود قومه يوفُوقهم\n و { حصوراً } \n أي: مبالغاً في حبس النفس عن الشهوات والملاهي\n رُوِيَ أنه مرَّ في صباه على صبيان\n فدعوه إلى اللعب\n فقال: ما للعب خلقت\n أو عِنِّيناً\n رُوِيَ: \" أنه كان له ذَكَرٌ كالقذاة \" رواه ابن عباس\n وقال في الأساس: رجل حصور: لا يرغب في النساء\n قيل: كان ذلك فضيلة في تلك الشريعة\n بخلاف شريعة نبينا محمد صلى الله عليه وفي الورتجبي: الحصور: الذي يملك ولا يُملك\n وقال القشيري: { حصوراً }: أي: مُعْتَقاً من الشهوات\n مَكْفِيّاً أحكام البشرية\n مع كونه من جملة البشر\n { ونبيّاً من الصالحين } الذي صلحوا للنبوة وتأهلوا للحضرة\n ولما سمع البشارة هزَّه الفرحُ فقال: يا { رب أنى يكون لي غلام } أي: من أين يكون لي غلام؟! قاله استعظاماً أو تعجباً أو استفهاماً عن كيفية حدوثه\n هل مع كبر السن والعقم\n أو مع زوالهما\n { وقد بلغني الكبر } \n وكان له تسع وتسعون سنة\n وقيل: مائة وعشرون\n { وامرأتي عاقر }  لا تلد\n ولم يقل: عاقرة\n لأنه وصف خاص بالنساء\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:8",
      "similarity": 0.4783589716657544
    },
    {
      "verse": "33:67",
      "similarity": 0.3732065597782356
    },
    {
      "verse": "4:90",
      "similarity": 0.3512922949095057
    },
    {
      "verse": "39:60",
      "similarity": 0.3253486355645107
    },
    {
      "verse": "3:106",
      "similarity": 0.31157917284024933
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:39.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:39.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}