{
  "chapter": "آل عمران",
  "text": "من قبل هدى للناس وانزل الفرقان ان الذين كفروا۟ بـايت الله لهم عذاب شديد والله عزيز ذو انتقام",
  "translations": [
    {
      "translation": "previously, as guidance for mankind, and He has sent down the Furqan.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this as guidance for men, and has sent the criterion (of falsehood and truth). As for those who deny the signs of God, the punishment is severe; for God is all powerful and great His requital.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for the guidance of mankind; and He has also revealed the Criterion (to distinguish truth from falsehood). A severe chastisement lies in store for those who deny the signs of Allah. Allah is All-Mighty; He is the Lord of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "before as a guide for the people and now He has revealed the criteria of discerning right from wrong. Those who reject the revelations of God will face the most severe torment. God is Majestic and capable to revenge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this, a guidance to mankind; and sent down the Judgement (Criterion to judge between right and wrong); indeed for those who disbelieved in the verses of Allah, is a severe punishment; and Allah is the Almighty, the Avenger (of the wrong).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aforetime, as a guidance to mankind. And He sent down the criterion. Truly, those who disbelieve in the Ayat of Allah, for them there is a severe torment; and Allah is All-Mighty, All-Able of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they who disbelieve in the communications of Allah they shall have a severe chastisement; and Allah is Mighty, the Lord of retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "aforetime, as guidance to the people, and He sent down the Salvation. As for those who disbelieve in God's signs, for them awaits a terrible chastisement; God is All-mighty, Vengeful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aforetime, for a guidance to mankind; and hath revealed the Criterion (of right and wrong). Lo! those who disbelieve the revelations of Allah, theirs will be a heavy doom. Allah is Mighty, Able to Requite (the wrong).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in the past as guidance for mankind; He has [also] sent down the Standard by which to discern the true from the false. Surely those who deny God's signs will suffer severe punishment. God is mighty and capable of retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aforetime, for a guidance unto the people, and sent down the criterion. Verily those who disbelieve in the signs of Allah Unto them shall be torment severe. And Allah is Mighty, Lord of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "before as guidance for mankind, and He has sent down the Criterion. Indeed, there is a severe punishment for those who deny the signs of Allah, and Allah is all-mighty, avenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then those who reject Faith in the Signs of Allah will suffer the severest penalty, and Allah is Exalted in Might, Lord of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aforetime, as a guidance to mankind, And He sent down the criterion [of judgement between right and wrong (this Quran)]. Truly, those who disbelieve in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, for them there is a severe torment; and Allah is All-Mighty, All-Able of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "before, as a guidance for people, and He sent down the Criterion. As for those who disbelieve in the verses of Allah, for them is an intense punishment. Allah is Mighty, Owner of Vengeance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aforetime, as guidance for mankind; and He sent down the Criterion. Those who have rejected God’s signs will have a severe punishment. God is Mighty, Able to take revenge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before, as guidance for the people. And He revealed the Qur'an. Indeed, those who disbelieve in the verses of Allah will have a severe punishment, and Allah is exalted in Might, the Owner of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:4] before, that is to say, before revealing it [the Qur’ān], as guidance (hudan, a circumstantial qualifier meaning, hādiyīn, ‘guides from error’) to people, to those who followed these two [Books] (He uses the word anzala for the revelation of these two, and nazzala for that of the Qur’ān, for the latter entails repetition, whereas the two Books were revealed in one instance); and He revealed the Criterion (al-furqān), meaning the Scriptures that discriminate between truth and falsehood. He mentions this [Criterion] after He has mentioned the three Scriptures so that it encompasses all [revealed Scriptures] besides these. As for those who disbelieve in God’s signs, the Qur’ān or any other [revelation], for them awaits a terrible chastisement; God is Mighty, victorious in His affair, so that nothing can prevent Him from effecting His promise and His threat; Lord of Retribution, with a severe punishment for those that disobeyed Him, the like of which none can do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nو { مِنْ قَبْلُ } يتعلّق { بأنْزَلَ } ، والأحسن أن يكون حالاً أولى من التوراة والإنجيل ، و «هُدَى» حال ثانية . والمُضافُ إليه قبلُ محذوف مَنويُّ مَعْنَى ، كما اقتضاه بناء قبل على الضم ، والتقدير من قبل هذا الزمان ، وهو زمان نزول القرآن .وتقديم { مِنْ قبلُ } على { هدَى للناس } للاهتمام به .وأما ذكر هذا القيد فلكي لا يتوهّم أنّ هُدى التوراةِ والإنجيللِ مستمرّ بعد نزول القرآن . وفيه إشارة إلى أنّها كالمقدّمات لِنزول القرآن ، الذي هو تمام مراد الله من البشر { إنّ الدينَ عند الله الإسلام } \\[ آل عمران : 19 \\] فالهدى الذي سبقه غير تام .و { للناس } تعريفه إمّا للعهد : وهم الناس الذي خوطبوا بالكتابين ، وإمّا للاستغراق العُرفي : فإنّهما وإن خوطب بهما ناس معروفون ، فإنّ ما اشتملا عليه يَهتدي به كلّ من أراد أن يهتدي ، وقد تهوّد وتنصّر كثير ممّن لم تشملهم دعوة موسى وعيسى عليهما السلام ، ولا يدخل في العموم الناسُ الذين دعاهم محمد صلى الله عليه وسلم لأنّ القرآن أبطل أحكام الكتابين ، وأما كون شرع مَنْ قَبْلَنَا شرعاً لنا عند معظم أهل الأصول ، فذلك فيما حكاه عنهم القرآن لا ما يوجد في الكتابين ، فلا يستقيم اعتبار الاستغراق بهذا الاعتبار بل بما ذكرناه .والفرقان في الأصل مصدر فرَق كالشُكران والكُفران والبُهتان ، ثم أطلق على ما يُفرق به بين الحق والباطل قال تعالى : { وما أنزلنا على عبدنا يومَ الفرقان } \\[ الأنفال : 41 \\] وهو يوم بدر . وسمّي به القرآنُ قال تعالى : { تبارك الذي نزل الفرقان على عبده } \\[ الفرقان : 1 \\] والمرادبالفرقان هنا القرآن؛ لأنّه يفرق بين الحق والباطل ، وفي وصفه بذلك تفضيل لِهديه على هدى التوراة والإنجيل؛ لأنّ التفرقة بين الحق والباطل أعظم أحوال الهدي ، لما فيها من البرهان ، وإزالة الشبهة . وإعادةُ قوله : { وأنزل الفرقان } بعد قوله : { نزل عليك الكتاب بالحق } للاهتمام ، وليُوصَل الكلام به في قوله : { إن الذين كفروا بآيات اللَّه } \\[ آل عمران : 4 \\] الآية أي بآياته في القرآن .{ إِنَّ الذين كَفَرُواْ بأيات الله لَهُمْ عَذَابٌ شَدِيدٌ والله عَزِيزٌ ذُو انتقام .}استئناف بياني مُمَهّد إليه بقوله : { نزل عليك الكتاب بالحق } لأنّ نفس السامع تتطلّع إلى معرفة عاقبة الذين أنكروا هذا التنزيل .وشَمل قولُه : { الذين كفروا بآيات الله } المشركينَ واليهودَ والنصارى في مرتبة واحدة ، لأنّ جميعهم اشتركوا في الكفر بالقرآن ، وهو المراد بآيات الله هنا لأنّه الكتاب الوحيد الذي يصح أن يوصف بأنّه آيةٌ من آيات الله؛ لأنّه مُعجزة . وعبّر عنهم بالموصول إيجازاً؛ لأنّ الصلة تجمعهم ، والإيماء إلى وجه بناء الخَبَر وهو قوله : { لهم عذاب شديد .}وعطف قوله : { والله عزيز ذو انتقام } على قوله : { إن الذين كفروا بآيات الله } لأنّه من تكملة هذا الاستئناف : لمجيئه مجيء التبيين لشدّة عذابهم؛ إذ هو عذابٌ عزيزٍ منتقم كقوله : { فأخذناهم أخذ عزيز مقتدر } \\[ القمر : 42 \\] .( والعزيز تقدم عند قوله تعالى في سورة البقرة ( 209 ) : { فاعلموا أن اللَّه عزيز حكيم . } والانتقام : العقاب على الاعتداء بغضب ، ولذلك قيل للكاره : ناقم . وجيء في هذا الوصف بكلمة ( ذو ) الدالة على المِلك للإشارة إلى أنّه انتقام عن اختيار لإقامة مصالح العباد وليس هو تعالى مندفعاً للانتقام بدافع الطبع أو الحنق .\n\n",
      "translations": [
        {
          "translation": "(Aforetime) before Muhammad and the Qur'an, (for a guidance to mankind) as a guidance from error to the Children of Israel; (and hath revealed the Criterion (of right and wrong)) He revealed the Qur'an to Muhammad in instalments to differentiate the lawful from the unlawful. (Lo! those who disbelieve the revelations of Allah) Muhammad and the Qur'an, referring in this context to the delegation of Najran, (theirs will be a heavy doom) in this world and in the next. (Allah is Mighty) powerful in His vengeance, (Able to Requite (the wrong)) able to carry His vengeance out on them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مِن قَبْلُ } أي: من قبل إنزالهما عليهما { هُدًى لِّلنَّاسِ } يهديهم إلى توحيده الذاتي عند ظهور خلافه من الغي والضلالة { وَ } بعدما ظهر الظلال { أَنزَلَ ٱلْفُرْقَانَ } أي: الكتاب السماوي الفارق بين الهداية والضلالة\n ليتميز الحق عن الباطل\n وآيات الله عن تسويلات الشياطين { إِنَّ ٱلَّذِينَ كَفَرُواْ بِآيَاتِ ٱللَّهِ } بعد ظهوره ونزوله\n وكذبوا من أنزل إليهم من الكتب والآيات { لَهُمْ عَذَابٌ شَدِيدٌ } هو الطرد والحرمان عن ساحة التوحيد بسبب إنكارهم الآيات الهادية لهم إلى طريقه { وَٱللَّهُ } الهادي إلى توحيده { عَزِيزٌ } غالب قادر { ذُو ٱنْتِقَامٍ } [آل عمران: 4] عظيم وتعذيب شديد على من كفر بآياته واستكبر على من أنزل عليه الآيات\n وكيف لا؟\n\n\n{ إِنَّ ٱللَّهَ } المحيط بجميع ما كان ويكون { لاَ يَخْفَىٰ عَلَيْهِ شَيْءٌ } مما حدث { فِي ٱلأَرْضِ }  { وَلاَ فِي } ما حدث { ٱلسَّمَآءِ } [آل عمران: 5] من الإيمان والكفر والهداية والضلالة\n وغير ذلك من الأعمال والأحوال الصادرة من العباد\n\n\nفيكف يخفى عليه\n إذ { هُوَ ٱلَّذِي يُصَوِّرُكُمْ } بقدرته ابتداء { فِي ٱلأَرْحَامِ } بعد انصبابكم من أصلاب آبائكم إليها { كَيْفَ يَشَآءُ } أي: كيف تتعلق مشيئته وإرادته بلا مزاحمة ضد\n ومشاركة أحد من شريك وند",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ختم الوحي بإنزال { الفرقان } \n وكلّف بالإيمان به الإنس والجان\n فرَّق به بين الحق والباطل\n واندفع به ظلمة كل كافر وجاهل وقدَّم ذكره على الكتب لعظم شرفه\n وختم به آخراً لتأخر نزوله\n والله تعالى أعلم\n الإشارة: لمّا أراد الحقّ جلّ جلاله أن يشير إلى وحدة الذات وظهور أنوار الصفات\n قَدَّم قبل ذلك رموزاً وإشارات\n لا يفهمها إلا من غاص في قاموس بحر الذات\n وغرق في تيار الصفات\n فيستخرج بفكرته من يواقيت العلوم وغوامض الفهوم\n ما تحار فيه الأذهان\n وتكِلُّ عنه عبارةُ اللسان\n فحينئذٍ يفقهم دقائق الرموز وأسرار الإشارات\n ويطلع على أسرار الذات وأنوار الصفات\n ويفهم أسرار الكتب السماوية\n وما احتوت عليه من العلوم اللدنية\n والمواهب الربانية\n ويشرق في قلبه أنوار الفرقان\n حتى يرتقي إلى تحقيق أهل الشهود والعيان\n جعلنا الله منهم بمنِّه وكرمه\n ثم هدد من كفر بالفرقان\n بعد وضوح سواطع البرهان\n فقال: {\n\n\n إِنَّ الَّذِينَ كَفَرُواْ بِئَايَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّهُ عَزِيزٌ ذُو انتِقَامٍ }  قلت: الانتقام والنقمة: عقوبة المجرم\n\nوفعله: نقم القاف وفتحها\n يقول الحقّ جلّ جلاله: { إن الذين كفروا بآيات الله } المنزلة على نبيه أو على سائر أنبيائه\n أو الآيات الدالّة على وحدانيته\n { لهم عذاب شديد } يوم يظهر نفوذ الوعد والوعيد\n فينتقم الله فيه من المجرمين\n ويتعطف على عباده المؤمنين\n فإن { الله عزيز } لا يغلبه غالب\n ولا يفُوته هارب\n { ذو انتقام } كبير ولطف كثير\n لطف الله بنا وبجميع المسلمين\n آمين\n الإشارة: ظهور أولياء الله لطف من آيات الله\n فمن كفر بهم حُرم بركتهم\n وبقي في عذاب الحجاب وسوء الحساب\n تظهر عليه النقمة والمحنة\n حين يرفع الله المقربين في أعلى عليين\n ويكون الغافلون مع عوام المسلمين\n ذلك يوم التغابن\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:37",
      "similarity": 0.7199036188164382
    },
    {
      "verse": "85:8",
      "similarity": 0.6607535142730506
    },
    {
      "verse": "14:47",
      "similarity": 0.6528103738974663
    },
    {
      "verse": "15:79",
      "similarity": 0.6313510037899334
    },
    {
      "verse": "30:47",
      "similarity": 0.5699642510547399
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}