{
  "chapter": "آل عمران",
  "text": "قال رب انى يكون لى غلم وقد بلغنى الكبر وامراتى عاقر قال كذلك الله يفعل ما يشاء",
  "translations": [
    {
      "translation": "The angels called out to him while he was standing in prayer in the Upper Room: 'Allah gives you the good news of Yahya, who will come to confirm a Word from Allah, and will be a leader and a celibate, a Prophet and one of the righteous.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can I have a son, O Lord,\" he said, \"for I am old and my wife is barren?\" \"Thus,\" came the answer, \"God does as He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Zechariah exclaimed: 'My Lord! How shall I have a son when old age has overtaken me and my wife is barren?' He said: Thus shall it be; Allah does what He wills.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"How can there be a son for me when I am already senile and my wife is barren.\" The angel replied, \"God does as He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! How can I have a son when old age has reached me and my wife is barren?” He said, “This is how Allah brings about, whatever He wills.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! How can I have a son when I am very old, and my wife is barren\" (Allah) said: \"Thus Allah does what He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! when shall there be a son (born) to me, and old age has already come upon me, and my wife is barren? He said: even thus does Allah what He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord,' said Zachariah, 'how shall I have a son, seeing I am an old man and my wife is barren?' 'Even so,' God said, 'God does what He will.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! How can I have a son when age hath overtaken me already and my wife is barren? (The angel) answered: So (it will be). Allah doeth what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord,\" said Zachariah, \"how shall I have a son when I am now overtaken by old age and my wife is barren?\" \"Such is the will of God,\" replied [the angel], \"He does what He pleases.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! in what wise shall there be unto me a youth whereas age hath overtaken me and my wife is barren. Allah said: even so: Allah doeth whatsoever He listeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord, how shall I have a son while old age has overtaken me and my wife is barren?’ Said He, ‘So it is that Allah does whatever He wishes.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! How shall I have son, seeing I am very old, and my wife is barren?\" \"Thus,\" was the answer, \"Doth Allah accomplish what He willeth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! How can I have a son when I am very old, and my wife is barren?\" Allah said: \"Thus Allah does what He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Lord, how shall I have a son when I am overtaken by old age and my wife is barren' He said: 'Even so, Allah does what He will'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, how will I have a son, when old age has overtaken me, and my wife is barren?” He said, “Even so, God does whatever He wills.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, how will I have a boy when I have reached old age and my wife is barren?\" The angel said, \"Such is Allah; He does what He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:40] He said, ‘My Lord! How shall I have a boy, a son, when old age has overtaken me, that is, [after] I have reached extreme [old] age, 120 years [old]; and my wife is barren?’, having reached the age of 98. He said, ‘So it, the matter, will be’, with God creating a boy from both of you. ‘God does what He will’, nothing can prevent Him therefrom, and in order to manifest this great power he was inspired with the question so that he would be answered through it [this great power]. And when his soul longed for the swift fulfilment of that of which good tidings had been given:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: My Lord) Zachariah said to Gabriel: master! (How can I have a son when age hath overtaken me already) when I am very old (and my wife is barren) and cannot conceive children? ((The angel) answered: So (it will be)) as I have told you. (Allah doeth what He will). 57\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱمْرَأَتِي عَاقِرٌ } وهي التي لاَ تَلِدُ\n وَكَذَلِكَ الرَّجلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And your wife is barren,\" meaning she who does not give birth.\n\n\nAnd so it is with man -",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومع ذلك كبيرة لا يرجى منها الولادة { قَالَ } له حبرائيل بوحي الله: لا تستبعده\n فإنه يكون { كَذَلِكَ } أي: مثل ما قلت بلا سبب موافق لجري العادة\n إذ { ٱللَّهُ } القادر المختار { يَفْعَلُ } يخلق ويوجد { مَا يَشَآءُ } [آل عمران: 40] من الموجودات إيجاداً إبداعياً بلا سبق سبب ومادة\n\n\nفلك أن ترتفع غشاوة الأسباب الحاجبة عن البين\n وتنسب ما جرى في ملكه إليه بلا رؤية الوسائط والأسباب\n إذ لا حجاب عند أولي الألباب\n بل كل ما صدر عنه لا يتوقف على شيء من سوابقه\n ولا يتوقف عليه شيء من لواحقه عند أولي البصائر\n الناظرين بنور الله في تجددات تجليات الوجود الإلهي\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال له جبريل: { كذلك الله يفعل ما يشاء } من العجائب والخوارق\n فيخلق الولد من العاقر والشيخ الفاني\n أو الأمر كذلك\n أي: كما أخبرتك\n ثم استأنف: { الله يفعل ما يشاء }\n ولما تحقق بالبشارة طلبَ العلامةَ\n فقال: { رب اجعل لي آية } أعرف بها حمل المرأة\n لاستقبله بالبشاشة والشكر\n { قال آيتك ألا تكلم الناس ثلاثة أيام } أي: لا تقدر على كلام الناس ثلاثاً\n فحبس لسانه عن الكلام دون الذكر والشكر\n ليخلص المدة للذكر والشكر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:8",
      "similarity": 0.8182188169846888
    },
    {
      "verse": "19:5",
      "similarity": 0.5003945637341595
    },
    {
      "verse": "19:20",
      "similarity": 0.4950719826529628
    },
    {
      "verse": "11:65",
      "similarity": 0.48166044734454455
    },
    {
      "verse": "54:29",
      "similarity": 0.4554892911209783
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/3:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/3:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/3:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}