{
  "chapter": "آل عمران",
  "text": "قال رب اجعل لى ءاية قال ءايتك الا تكلم الناس ثلثة ايام الا رمزا واذكر ربك كثيرا وسبح بالعشى والابكر",
  "translations": [
    {
      "translation": "He said, 'My Lord, how can I possibly have a son when I have reached old age and my wife is barren?' He said, 'It will be so. Allah does whatever He wills.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zachariah said: \"Give me a token, O Lord.\" \"The token will be,\" was the reply, \"that you will speak to no man for three days except by signs; and remember your Lord much, and pray at evening and sunrise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Zechariah said: 'O my Lord! Appoint a sign for me.' The angel said: 'The sign for you shall be that you shall not speak to men for three days except by gesture. Remember your Lord and extol His glory by night and by day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Zachariah prayed to God saying, \"Lord, show me the evidence (that it is Divine revelation).\" The Lord replied, \"You must not speak to people for three days except with gestures. Commemorate your Lord often and glorify Him in the early mornings and the evenings.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! Determine a sign for me”; He said, “The sign is that you shall not be able to speak to mankind for three days except by signs; and remember your Lord profusely, and proclaim His Purity before sunset and at dawn.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! Make a sign for me.\" (Allah) said: \"Your sign is that you shall not speak to the people for three days except by signals. And remember your Lord much, and glorify (Him) in the afternoon and in the morning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! appoint a sign for me. Said He: Your sign is that you should not speak to men for three days except by signs; and remember your Lord much and glorify Him in the evening and the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord,' said Zachariah, 'appoint to me a sign.' 'Thy sign,' God said, 'is that thou shalt not speak, save by tokens, to men for three days. And mention thy Lord oft, and give glory at evening and dawn.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Appoint a token for me. (The angel) said: The token unto thee (shall be) that thou shalt not speak unto mankind three days except by signs. Remember thy Lord much, and praise (Him) in the early hours of night and morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, grant me a sign.\" [The angel] said, \"Your sign is that you will not be able to speak to people for three days except by signs. Remember your Lord much and glorify Him morning and evening.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! appoint unto me a sign. Allah said: thy sign is that thou shalt not speak unto mankind for three days save by beckoning; and remember thy Lord much and hallow Him in the evening and morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord, grant me a sign.’ Said He, ‘Your sign is that you will not speak to people for three days except in gestures. Remember Your Lord much, and glorify Him morning and evening.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! Give me a Sign!\" \"Thy Sign,\" was the answer, \"Shall be that thou shalt speak to no man for three days but with signals. Then celebrate the praises of thy Lord again and again, and glorify Him in the evening and in the morning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! Make a sign for me.\" Allah said: \"Your sign is that you shall not speak to mankind for three days except with signals. And remember your Lord much (by praising Him again and again), and glorify (Him) in the afternoon and in the morning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Lord, appoint for me a sign' He said: 'Your sign is that you shall not speak to people except by signs for three days' And remember your Lord abundantly, exalt Him in the evening and at the dawn'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, give me a sign.” He said, “Your sign is that you shall not speak to the people for three days, except by gestures. And remember your Lord much, and praise in the evening and the morning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, make for me a sign.\" He Said, \"Your sign is that you will not [be able to] speak to the people for three days except by gesture. And remember your Lord much and exalt [Him with praise] in the evening and the morning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:41] He said, ‘My Lord! Appoint for me a sign’, that is, an indication of my wife’s pregnancy. He said, ‘Your sign, for this, is that you shall not speak to men, that is, you shall refrain from speaking to them, but not from remembrance of God, save by tokens, gestures, for three days, and nights. And remember your Lord often, and glorify, perform prayer, at evening and dawn’, at the end of the day and at its beginning.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { قال رب اجعل لي آية } أراد آية على وقت حصول ما بُشِّر به ، وهل هو قريب أو بعيد ، فالآية هي العلامة الدالة على ابتداء حمل زوجه . وعن السدي والربيع : آيةَ تحقق كون الخطاب الوارد عليه وارداً من قبل الله تعالى ، وهو ما في إنجيل لوقا . وعندي في هذا نظر ، لأنّ الأنبياء لا يلتبس عليهم الخطاب الوارد عليهم من الله ويعلمونه بعلم ضروري .وقوله : { آياتك ألا تكلم الناس ثلاثة أيام إلا رمزا } جعل الله حُبْسة لسانه عن الكلام آية على الوقت الذي تحمل فيه زوجته ، لأنّ الله صرف ما لَه من القوة في أعصاب الكلام المتصلة بالدمَاغ إلى أعصاب التناسل بحكمة عجيبة يقرب منها ما يذكر من سقوط بعض الإحساس لمن يأكل البَلاذر لقوة الفكر . أوْ أمرِه بالامتناع من الكلام مع الناس إعانة على انصراف القوة من المنطق إلى التناسل ، أي متى تمت ثلاثة الأيام كان ذلك أمارة ابتداء الحمل . قال الربيع جعل الله ذلك له عقوبة لتردّده في صحة ما أخبره به الملَك ، وبذلك صرح في إنجيل لوقا ، فيكون الجواب على هذا الوجه من قبيل أسلوب الحكيم لأنه سأل آيةً فأعطي غيرها .وقوله : { واذكر ربك كثيراً وسبح بالعشي والإبكار } أمر بالشكر . والذِّكر المراد به : الذِّكر بالقلب والصلاةِ إن كان قد سلب قوة النطق ، أو الذكر اللساني إن كان قد نهي عنها فقط . والاستثناء في قوله إلاّ رمزاً استثناء منقطع .\n\n",
      "translations": [
        {
          "translation": "(He) Zachariah (said: My Lord) my Lord! (Appoint a token for me) regarding my wife's pregnancy. ((The angel) said: The token unto thee) about your wife's pregnancy ((shall be) that thou shalt not speak) will not be able to speak (unto mankind three days) without being dumb (except by signs) by moving your lips, eyebrows, eyes and hands; it is also said: except by writing on the ground. (Remember your Lord) with your tongue and heart (much) in all circumstances, (and praise (Him) in the early hours of night and morning) pray in the morning and at night as you used to do.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ رَمْزاً } معناهُ إِشَارَةٌ باللِسَانِ مِنْ غَيرِ بَيانٍ\n ويقالُ: إيماءٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Except as a sign [to them]\" - this is a reference [to something] without explanation [from Him].\n\n\nAnd it is said: \"Ema'un\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما تفطن زكريا من هذا الكلام ما تفطن { قَالَ } مستسرعاً مستنشطاً: { رَبِّ } يا من رباني بأنواع اللطف والكرم { ٱجْعَلْ لِّيۤ } بفظلك { آيَةً } علامة أعرف بها الحمل\n ليفرح بها قلبي ويخلص عن الانتظار { قَالَ آيَتُكَ أَلاَّ تُكَلِّمَ ٱلنَّاسَ } أي: لا تطيق التكلم معهم\n لعدم مساعدة آلاتك عليه مدة { ثَلاَثَةَ أَيَّامٍ } ولا تعلمهم حوائجك { إِلاَّ رَمْزاً } إشارة بيد ورأس وغير ذلك { وَ } عند حبسك عن الكلام والتنطق { ٱذْكُر رَّبَّكَ } في نفسك ذكراً { كَثِيراً وَسَبِّحْ } نزهه عن جميع النقائض تسبيحاً مقارناً { بِٱلْعَشِيِّ } أي: جميع الليل { وَٱلإِبْكَارِ } [آل عمران: 41] أي: جميع النهار لتستوعب جميع أوقاتك بذكره\n\n\nمن هذا تفطن العارف أن الداعي المستجيب من الله لا بد له أولاً أن يفرغ قلبه عن غير الله ويستوعب أوقاته بذكره\n بل يكل لسانه عن ذكر غيره مطلقاً\n حتى يفوز بمطلوبه ويجيب له بفضله وطوله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا رمزاً } بيدٍ أورأس أو حاجب أو عين\n { واذكر ربك كثيراً } في هذه المدة التي حبِسْتَ فيها عن الكلام\n وهو يُبين الغرض من الحبس عن الكلام\n وتقييد الأمر بالكثرة يدل على أنه لا يفيد التكرار\n { وسبّح بالعشي } أي: من الزوال إلى الغروب\n أو من العصر إلى جزء الليل\n { والإِبكار } من الفجر إلى الضحى\n وقيل: كانت صلاتهم ركعتين في الفجر وركعتين في المغرب\n ويؤيد هذا قوله تعالى في الآية الأخرى:\n[مريم: 11]\n والله تعالى أعلم\n الإشارة: الأصلاب الروحانية كالأصلاب الجسمانية\n منها ما تكون عقيمة مع كمالها\n ومنها ما تكون لها ولد أو ولدان\n ومنها ما تكون لها أولاد كثيرة\n ويؤخذ من قضية السيد زكريا عليه السلام: طلب الولد إذا خاف الولي اندراس علمه أو حاله بانقطاع نَسْله الروحاني\n ولا شك في فضل بقاء النسل الحسيّ أو المعنوي\n وقد قال عليه الصلاة والسلام:\n \" إِذَا مَاتَ العبدُ انْقَطَعَ عمله إلا مِنْ ثَلاَثٍ: صَدَقَةٍ جَارِيَةٍ\n أَوْ وَلَدٍ صَالِح يَدْعُو لَهُ\n أوْ عِلَم يُنْتَفَعُ به \" \nوشمل الولد البشري والروحاني\n وقال عليه الصلاة والسلام لسيدنا عليّ - كَرّم الله وجهه -:\n \" لأنْ يَهْدِيَ اللّهُ بِكَ رَجُلاً وَاحِداً خَيْرٌ لكَ مِنْ حُمْر النَعَمِ \"\n \nوقال بعض الشعراء:\nوقد سلَك هذا المسلك القطبُ بن مشيش في طلب الولد الروحاني\n حيث قال في تَصْلِيَته المشهورة: اسمه ندائي بما سمعت به نداء عبدك زكريا\n فأجابه الحق تعالى بشيخ المشايخ القطب الشاذلي\n وغير واحد من الأولياء دخل محراب الحضرة\n ونارى نداءً خفيّاً في صلاة الفكر\n فأجابته الهواتف في الحال\n بلسان الحال أو المقال: إن الله يبشرك بمن يحيي علمك ويرث حالك\n مصدقاً بكلمة من الله\n وهم أولياء الله\n وسيداً وحصوراً عن شواغل الحس\n مستغرقاً في مشاهدة القرب والأنس\n ينبئ بعلم الغيوب\n ويصلح خلل القلوب\n فإذا استعظم ذلك واستغربه\n قيل له: الأمر كذلك\n الله يفعل ما يشاء إذا قضى أمراً فإنما يقول له كن فيكون\n فحسبك الاشتغال بذكر الله\n والغيبة عما سواه\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:55",
      "similarity": 0.22758693956984005
    },
    {
      "verse": "19:11",
      "similarity": 0.21985657263430955
    },
    {
      "verse": "19:62",
      "similarity": 0.20816194713595082
    },
    {
      "verse": "33:42",
      "similarity": 0.1321609539660489
    },
    {
      "verse": "56:36",
      "similarity": 0.1301144762080771
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}