{
  "chapter": "آل عمران",
  "text": "واذ قالت الملئكة يمريم ان الله اصطفىك وطهرك واصطفىك على نساء العلمين",
  "translations": [
    {
      "translation": "He said, 'My Lord, appoint a Sign for me.' He said, 'Your Sign is that you will not speak to people for three days, except by gesture. Remember your Lord much and glorify Him in the evening and after dawn.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said: \"O Mary, indeed God has favoured you and made you immaculate, and chosen you from all the women of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then came the time when the angels said: 'O Mary! Behold, Allah has chosen you, and made you pure, and exalted you above all the women in the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold,\" the angels told Mary, \"God had chosen you, purified you, and given you distinction over all women.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said, “O Maryam! Indeed Allah has chosen you and purified you, and has this day, chosen you among all the women of the world.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when the angels said: \"O Maryam! Verily, Allah has chosen you, purified you, and chosen you above the women of the nations.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said: O Marium! surely Allah has chosen you and purified you and chosen you above the women of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said, 'Mary, God has chosen thee, and purified thee; He has chosen thee above all women.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said: O Mary! Lo! Allah hath chosen thee and made thee pure, and hath preferred thee above (all) the women of creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said, \"Mary, God has selected you and purified you. He has selected you over [all] the women of your time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time the angels said: O Maryam! verily Allah chose thee and purified thee and chose thee above the women of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said, ‘O Mary, Allah has chosen you and purified you, and He has chosen you above the world’s women.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! the angels said: \"O Mary! Allah hath chosen thee and purified thee- chosen thee above the women of all nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when the angels said: \"O Maryam (Mary)! Verily, Allah has chosen you, purified you (from polytheism and disbelief), and chosen you above the women of the 'Alamin (mankind and jinns) (of her lifetime).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said to Mary: 'Allah has chosen you and purified you. He has chosen you above all women of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said, “O Mary, God has chosen you, and has purified you. He has chosen you over all the women of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when the angels said, \"O Mary, indeed Allah has chosen you and purified you and chosen you above the women of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:42] And, mention, when the angels, namely, Gabriel, said, ‘O Mary, God has preferred you, He has elected you, and made you pure, of the touch of men; He has preferred you above all women of the worlds, that is, the inhabitants of your time.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when the angels) i.e. Gabriel (said: Mary! Lo! Allah hath chosen thee) with Islam and worship (and made thee pure) from disbelief, the association of partners with Allah and blemishes; it is also said this means: He has saved you from being killed, (and hath preferred you above (all) the women of creation) of your time by the birth of Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل لمن تبعك من مدائح آل عمران واصطفاء الله إياهم { إِذْ قَالَتِ ٱلْمَلاَئِكَةُ } بأمر الله ووحيه لمريم - رضي الله عنها - ملهمين لها\n مشافهين معها\n منادين على سرها: أبشري { يٰمَرْيَمُ إِنَّ ٱللَّهَ ٱصْطَفَـٰكِ } اختارك لخدمة بيته مع أنه لم يعهد منه اختيار النساء للخدمة { وَطَهَّرَكِ } بفضله عن جميع الخبائث والأدناس العارضة للنسوان { وَٱصْطَفَـٰكِ } خيرك وفظلك بهاتين الخصلتين الحميدتين { عَلَىٰ نِسَآءِ ٱلْعَـٰلَمِينَ } [آل عمران: 42] وإنما خصصها بما خصصها\n لتكون آية لما يترتب عليها ويظ هر بسببها من بدائع أودعه الله سبحانه في إيجادها من حبلها بلا مباشرة أحد\n بل بمجرد كلمة ملقاة من عنده ومعجزاته وخوارق ظهرت من ابنها لم يظهر مثلها من أحد\n\n\nثم لما أخبرت الملائكة بإصفائه سبحنه إياها\n نادتها الملائكة ثانياً بأمر الله أيضاً\n تعليماً لها التوجه والرجوع إلى الله على وجه الخضوع والتذلل والإخبات والخشوع { يٰمَرْيَمُ } المختارة المقبولة عند الله { ٱقْنُتِي } توجهي وتضرعي { لِرَبِّكِ } الذي رباك بلطفه وقبلك نذيرة من أمك\n واصطفاك على نساء العالمين بأنواع الفضائل شكراً لما تفضل عليك { وَٱسْجُدِي } واخضعي وتذللي نحوه ملقية جباهك على الأرض",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: واذكر { إذ قالت الملائكة } أي: جبريل، أو جماعة، كلمتها شفاهاً كرامةً لها\n وفيه إثبات كرامة الأولياء، وليست نبية للإجماع على أنه تعالى لم يستنبئ امرأة لقوله:\n\n[الأنبيَاء: 7] فقالوا لها: { يا مريم إن الله اصطفاك } لخدمة بيته، ولم يقبل قبلك أنثى قط، وفرغك لعبادته، وأغناك برزقه عن رزق غيره، { وطهرك } من الأخلاق الذميمة، ومما يستقذر من النساء، { وصطفاك } ثانياً بهدايته لك، وتخصيصك بتكليم الملائكة، وبالبشارة بالولد من غير أب، فقد اصطفاك { على نساء العالمين }\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" كَمُلَ مِنَ الرِّجَالِ كَثِيرٌ ولَمْ يَكْمُلْ مِنَ النِّسَاءِ إلا مَرْيَمَ ابنةَ عِمْرَانَ، وآسِيَةَ بنت مزاحِم وخديجة بنت خويلد \" \n\n\n\n الحديث\n قال ابن عزيز: أي: عالمي دهرها، كما فُضِّلَتْ خديجة وفاطمة بنت رسول الله صلى الله عليه وسلم على نساء أمة محمد صلى الله عليه وسلم، بل قال أبو عمر: فاطمة فُضلت على جميع النساء، وهو واضح، لحديث: سيدة نساء أهل الجنة، لكن جاء في حديث آخر استثناء مريم\n فالله أعلم\n وفي الاستيعاب:\n\n \" عن عمران بن حصين: أن النبيّ صلى الله عليه وسلم عاد فاطمة، وهي مريضة، فقال: كيف تجدك يا بُنَيَّةُ؟ فقالت له: إني لوجعة، وإنه ليزيدني أني مالي طعام آكله، فقال: يا بُنَيِّةُ، أما ترضين أنك سيدة نساء العالمين، فقالت: يا أبت، فأين مريم بنت عمران؟ قال: تلك سيدةُ نُساءِ عالمها، وأنت سيدة عالمك، والله لقد زوجتك سيّداً في الدنيا والآخرة \" \n\nهـ\n من المحشي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:75",
      "similarity": 0.5399756068102848
    },
    {
      "verse": "37:153",
      "similarity": 0.5290915531846861
    },
    {
      "verse": "38:47",
      "similarity": 0.5221107938230223
    },
    {
      "verse": "43:16",
      "similarity": 0.4920257165288436
    },
    {
      "verse": "7:144",
      "similarity": 0.47361386027768104
    }
  ]
}