{
  "chapter": "آل عمران",
  "text": "ذلك من انۢباء الغيب نوحيه اليك وما كنت لديهم اذ يلقون اقلمهم ايهم يكفل مريم وما كنت لديهم اذ يختصمون",
  "translations": [
    {
      "translation": "Maryam, obey your Lord and prostrate and bow with those who bow.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is news of the Unknown that We send you, for you were not there when they cast lots with quills (to determine) who should take care of Mary, nor when they disputed it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad!) We reveal to you this account from a realm which lies beyond the reach of your perception for you were not with them when they drew lots with their pens about who should be Mary's guardian, and you were not with them when they disputed about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), that was some of the news about the unseen, that We have revealed to you. You were not among those who cast lots by throwing their arrows to find out who would take custody of Mary, nor were you among those who disputed the matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are tidings of the hidden, which We secretly reveal to you (O dear Prophet Mohammed – peace and blessings be upon him); and you were not present with them when they threw their pens to draw lots, to know who should be the guardian of Maryam; nor were you present with them when they were quarrelling. (Yet you know of these things – this is a proof of your being a Prophet.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a part of the news of the Ghayb (Unseen) which We reveal to you. You were not with them, when they cast lots with their pens as to which of them should be charged with the care of Maryam; nor were you with them when they disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the announcements relating to the unseen which We reveal to you; and you were not with them when they cast their pens (to decide) which of them should have Marium in his charge, and you were not with them when they contended one with another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(That is of the tidings of the Unseen, that We reveal to thee; for thou wast not with them, when they were casting quills which of them should have charge of Mary; thou wast not with them, when they were disputing.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the tidings of things hidden. We reveal it unto thee (Muhammad). Thou wast not present with them when they threw their pens (to know) which of them should be the guardian of Mary, nor wast thou present with them when they quarrelled (thereupon).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an account of the unseen, which We reveal to you. You were not with them when they drew lots as to which of them should be Mary's guardian and you were not with them when they disputed with one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the tidings of things hidden which We reveal unto thee and thou wast not with them when they cast their reeds as to which of them should take care of Maryam, nor wast thou with them when they disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These accounts are from the Unseen, which We reveal to you, and you were not with them when they were casting lots [to see] which of them would take charge of Mary’s care, nor were you with them when they were contending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is part of the tidings of the things unseen, which We reveal unto thee (O Messenger!) by inspiration: Thou wast not with them when they cast lots with arrows, as to which of them should be charged with the care of Mary: Nor wast thou with them when they disputed (the point).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a part of the news of the Ghaib (unseen, i.e. the news of the past nations of which you have no knowledge) which We inspire you with (O Muhammad SAW). You were not with them, when they cast lots with their pens as to which of them should be charged with the care of Maryam (Mary); nor were you with them when they disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is from the news of the unseen. We reveal it to you (Prophet Muhammad). You were not present when they cast their quills to see which of them should look after Mary, nor were you present when they were disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are accounts from the Unseen, which We reveal to you. You were not with them when they cast their lots as to which of them would take charge of Mary; nor were you with them as they quarreled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from the news of the unseen which We reveal to you, [O Muhammad]. And you were not with them when they cast their pens as to which of them should be responsible for Mary. Nor were you with them when they disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:44] That, which has been mentioned of the matter of Zachariah and Mary, is of the tidings of the Unseen, of the news of what was unknown to you. We reveal it to you, O Muhammad (s), for you were not with them, when they were casting quills, in the water, drawing their lots so that it be manifested to them, which of them should have charge of, [which of them should] bring up, Mary; nor were you with them, when they were disputing, about the custodianship of Mary, such that you might have known it and related it; but truly you know it only through revelation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) which I mentioned of the story of Mary and Zachariah (is of the tidings of things hidden) of the things that were unknown to you, Muhammad. (We reveal it unto thee (Muhammad)) He says: We send Gabriel with it to you. (Thou wast not present with them) with the Rabbis (when they threw their pens) in the flow of water ((to know) which of them should be the guardian of Mary) to train her, (nor wast thou present with them when they quarrelled (thereupon)) each giving argument for his better claim to be Mary's guardian.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِنْ أَنَبَآءِ ٱلْغَيْبِ } معناهُ مِنْ أَخْبَارِهِ\n\n\n\n\nوقوله تعالى: { وَمَا كُنتَ لَدَيْهِمْ } معناهُ عِنْدَهُمْ\n\n\n\n\nوقوله تعالى: { إِذْ يُلْقُون أَقْلاَمَهُمْ } معناهُ قِدَاحُهُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } المذكور من اصطفاه الله آدم ونوحاً وآل إبراهيم وآل عمران، وخصوصاً قصة مريم وأمها وزكريا وزوجه وابنه { مِنْ أَنَبَآءِ ٱلْغَيْبِ } أي: من الأخبار المغيبة المجهولة عندك { نُوحِيهِ إِلَيكَ } يا أكمل الرسل مع خلاء خاطرك وضميرك عنها، ولا معلم لك سوى وحينا وإلهامنا مع كونك أمياً عن مطالعة القصص والتواريخ { وَ } الحال أنه { مَا كُنتَ } لهويتك الشخصية { لَدَيْهِمْ } وقت { إِذْ يُلْقُون } أي: الأحبار { أَقْلاَمَهُمْ } للاقتراع في أنهم { أَيُّهُمْ يَكْفُلُ } يحفظ { مَرْيَمَ وَمَا كُنْتَ لَدَيْهِمْ } أيضاً { إِذْ يَخْتَصِمُونَ } [آل عمر ان: 44] في أمرها وحفظها\n\n\n\n\nوإنما نوحيه إليك؛ ليكون آية لك على صدقك في دعواك النبوة والرسالة، والإكار على أمثال هذه الأخبارات والإنباءات الصادرة عن الأنبياء والأولياء، المستندة إلى محض الوحي والإلهام النازلة من عند الله، إما نشأ من العقل القاصر المموه المضل عن طريق الكشف واليقين، وإلا فمن صفات عقله المفاض له من حضرة العلم المحيط الإلهي عن كدورات الوهم والخيال، وانكشفت سريرة سره بسرائر الأقوال والأفعال والأحوال، ظهر عنده بلا سترة وحجاب أن من النفوس البشرية من ترقب في هذه النشأة من عالم الشهادة إلى عالم الغيب، واتصلت بالمبادئ العلية التي هي الصفات الإلهية، واضمحلت ناسوتها وغلبت اللأهوتية عليها\n\n\n\n\nوحينئذ ظهرت منها على اتفاق من الحضرة العلية الإلهية، وإرادة غيبية ومكاشفات عينية متعلقة بعضها بالغيب وبعضها بالشهادة، كالإخبار عن الوقائع الماضية والمستقبلية، كما نسمع ونشاهد أمثال ذلك من بعض بدلاء الزمان، أدام الله بركته على مفارق أهل اليقين والعرفان، في حالتي قبضه وبسطه حكايات وكلمات متعلقة بوقائع وقعت في البلاد البعيدة\n\n\nونحن نجزن بوقوع بعضها كما نسمع منه، ونجزم أيضاً بأنه ما هو حاضر عند وقوعها، وأيضاً نجزم بأنه لم يسمع من أحد لانسلاخه عن الاستخبار الاستفسار على الوجه المعتاد بين الناس، وسمع منه مدخله أيضاً عن الأحوال التي جرت بيننا وبينه بمدة متطاولة نستحضره في خلواته، ويتلفظ بها بلا فوت دقيقة، ونحن إذا راجعنا وجداننا لم نستحضر الأمور التي جرت علينا في يومنا هذا بلا فوت شيء\n\n\n\n\nوأمثال ذلك من جنابه - أدام الله بركته - كثيرة، ومن له أدنى بصيرة وإيمان صادق بطريق المكاشفة والوحي والإلهام الإلهي لم يشك في أمثال هذه الخوارق من الأنبياء والأولياء أصلاً، بل يعلم يقيناً أن الحكمة والمصلحة في إظهار نوع الإنسان وإرسال الرسل وإنزال الكتب إنما هي لهذا التفطن والتدبر،\n\n[النور: 40]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}