{
  "chapter": "آل عمران",
  "text": "اذ قالت الملئكة يمريم ان الله يبشرك بكلمة منه اسمه المسيح عيسى ابن مريم وجيها فى الدنيا والءاخرة ومن المقربين",
  "translations": [
    {
      "translation": "This is news from the Unseen which We reveal to you. You were not with them when they cast their reeds to see which of them would be the guardian of Maryam. You were not with them when they quarrelled.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels said: \"O Mary, God gives you news of a thing from Him, for rejoicing, (news of one) whose name will be Messiah, Jesus, son of Mary, illustrious in this world and the next, and one among the honoured,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the angels said: 'O Mary! Allah gives you the glad tidings of a command from Him: his name shall be Messiah, Jesus, the son of Mary. He shall be highly honoured in this world and in the Next, and shall be one of those near stationed to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold,\" the angels told Mary, \"God has given you the glad news of the coming birth of a son whom He calls His Word, whose name will be Messiah, Jesus, son of Mary, who will be a man of honor in this life and the life to come, and who will be one of the ones nearest to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when the angels said, “O Maryam! Allah gives you glad tidings of a Word from Him, whose name is the Messiah, Eisa the son of Maryam – he will be honourable in this world and in the Hereafter, and among the close ones (to Allah).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the angels said: \"O Maryam! Verily, Allah gives you the glad tidings of a Word from Him, his name will be Al-Masih, `Isa, the son of Maryam, held in honor in this world and in the Hereafter, and he will be one of those who are near to Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels said: O Marium, surely Allah gives you good news with a Word from Him (of one) whose name is the '. Messiah, Isa son of Marium, worthy of regard in this world and the hereafter and of those who are made near (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels said, 'Mary, God gives thee good tidings of a Word from Him whose name is Messiah, Jesus, son of Mary; high honoured shall he be in this world and the next, near stationed to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when the angels said: O Mary! Lo! Allah giveth thee glad tidings of a word from him, whose name is the Messiah, Jesus, son of Mary, illustrious in the world and the Hereafter, and one of those brought near (unto Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels said, \"O Mary, your Lord gives you good news of a Word from Him. His name is the Messiah, Jesus, son of Mary, honoured in this world and in the next and one of those who are granted nearness to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time the angels said: Maryam! verily Allah announceth unto thee a word from Him: his name Shall be the Masih, Isa, son of Maryam, illustrious in the world and the Hereafter and one of those brought nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels said, ‘O Mary, Allah gives you the good news of a Word from Him whose name is Messiah, Jesus son of Mary, distinguished in the world and the Hereafter and one of those brought near [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! the angels said: \"O Mary! Allah giveth thee glad tidings of a Word from Him: his name will be Christ Jesus, the son of Mary, held in honour in this world and the Hereafter and of (the company of) those nearest to Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the angels said: \"O Maryam (Mary)! Verily, Allah gives you the glad tidings of a Word [\"Be!\" - and he was! i.e. 'Iesa (Jesus) the son of Maryam (Mary)] from Him, his name will be the Messiah 'Iesa (Jesus), the son of Maryam (Mary), held in honour in this world and in the Hereafter, and will be one of those who are near to Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels said: 'O Mary, Allah gives you glad tidings of a Word (Be) from Him, whose name is Messiah, Jesus, the son of Mary. He shall be honored in this world and in the Everlasting Life and he shall be among those who are close.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Angels said, “O Mary, God gives you good news of a Word from Him. His name is the Messiah, Jesus, son of Mary, well-esteemed in this world and the next, and one of the nearest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And mention] when the angels said, \"O Mary, indeed Allah gives you good tidings of a word from Him, whose name will be the Messiah, Jesus, the son of Mary - distinguished in this world and the Hereafter and among those brought near [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:45] Mention, when the angels, namely, Gabriel, said, ‘O Mary, God gives you good tidings of a Word from Him, that is, a boy, whose name is the Messiah, Jesus, son of Mary, He addresses her attributing him to her in order to point out that she will give birth to him without a father, for, the custom is to attribute the child to its father, honoured shall he be in this world, through prophethood, and the Hereafter, through [his] intercession and the high stations [al-darajāt al-‘ulā, cf. Q. 20:75], and of those brought close, to God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((And remember) when the angels) i.e. Gabriel (said: Mary! Allah giveth you glad tidings of a Word from Him) of a son who shall come into being by means of a Word from Allah, (whose name is the Messiah) because he travels from one country to another; it is also said: the Messiah means the king, (Jesus, son of Mary, illustrious in the world) he has standing and position amidst people in the life of this world (and the Hereafter) he has standing and position with Allah, (and one of those brought near) unto Allah in the Garden of Eden.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلْمَسِيحُ عِيسَى ٱبْنُ مَرْيَمَ } فالمَسِيحُ: الصَدِّيقُ\n والمَسِيحُ: المَمْسُوحُ العَينِ\n وهو الدَّجَالُ\n\n\n\n\nوقوله تعالى: { وَجِيهاً فِي ٱلدُّنْيَا وَٱلآخِرَةِ } معناهُ شَريفٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {The Messiah, Jesus son of Mary}, then the Messiah: the truthful one.\n\n\nAnd the Messiah: the one who is anointed with the eye\n\n\nAnd he is the Dajjal.\n\n\nAnd His saying, \"Fortunate is he in this world and the Hereafter,\" means honorable.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل لمن تبعك من مدائحها وقت { إِذْ قَالَتِ ٱلْمَلاۤئِكَةُ } منادين على سرها مبشرين لها: { يٰمَرْيَمُ } المخترة المصطفاه { إِنَّ ٱللَّهَ } المتفضل عليك بأنواع اللطف والكرم { يُبَشِّرُكِ بِكَلِمَةٍ } صاردة { مِّنْهُ } مكونة لك منك ابناً بلا أب\n إظهاراً لقدرته ليكون معجزة لابنك\n وإرهاصاً لك { ٱسْمُهُ } من عنده { ٱلْمَسِيحُ } لفظ سرياني معناه: المبارك\n لأنه سبحانه بارك عليه\n وعلمه الشخصي بين الأنام { عِيسَى } وهو من الأعلام العجمية\n وكنيته { ٱبْنُ مَرْيَمَ } إذ لا أب له حتى يكنى به\n وهو مع كونه بلا أب { وَجِيهاً } مشهوراً معروفاً مرجعاً للأنام { فِي ٱلدُّنْيَا } بالنبوة والرسالة\n يتوجه إليه الناس في أمور معاشهم ومعادهم { وَ } في { ٱلآخِرَةِ } أيضاً لرجوعهم إليه للشفاعة { وَ } كيف لا يشفع للعصاة وهو { مِنَ ٱلْمُقَرَّبِينَ } [آل عمران: 45] عند الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ قالت }: بدل من { وإذ قالت } الأولى\n ويبعد إبدالها من { إذ يختصمون } \n و { المسيح } وما بعده: إخبار عن اسمه\n أو { عيسى }: خبر عن مضمر\n و { ابن مريم }: صفته\n و { المسيح }: فعيل بمعنى مفعول\n لأنه مُسِحَ من الأقذار\n أي: طهر منها\n أو مسح بالبركة\n أو كان مسيح القدم\n لا أخمص له\n أو مسحه جبريل بجناحه من الشيطان\n أو بمعنى فاعل لأنه كان يمسح المرضى فيبرؤون\n أو يمسح عين الأعمى فيبصر\n أو لأنه كان يسيح في الأرض ولا يقيم في مكان فتكون الميم زائدة\n وأما المسيح الدجّال فإنه ممسوح إحدى العينين\n أو لأنه يطوف الأرض ويمسحها\n إلا مكة والمدينة\n والحاصل: أن عيسى مسيح الخير\n والدجال مسيح الشر\n ولذلك قيل: إن المسيح يقتل المسيح\n و { وجيهاً }: حال من كلمة لتخصيصه بالصفة\n و { في المهد وكهلاً }: حالان\n أي: طفلاً وكهلاً\n والمهد: ما يمهد للصبي\n و { رسولاً }: مفعولٌ لمحذوف\n أي: ونجعله رسولاً\n و { مصدقاً }: عطف على { رسولاً } \n و { لأُحِلَّ }: متعلق بمحذوف\n أي: وجئتكم لأُحل\n أو معطوف على معنى مصدقاً\n كقولهم: جئتك معتذراً\n أو لأطيب قلبك\n يقول الحقّ جلّ جلاله: { و } اذكر أيضاً { إذ قالت الملائكة } في بشارتهم لمريم: { يا مريم إن الله يبشرك بكلمة منه } \n أي: بولد يتكوَّن بكلمة من الله كن فيكون\n وقيل: إنما سمى كلمة لكونه مظهراً لكلمة التكوين\n متحققاً ومتصرفاً بها\n ولذلك كان يظهر عليه خوارق الأقدار أكثر من غيره من الأنبياء\n { اسمه المسيح } \n واسمه { عيسى ابن مريم } \n وإنما قال: { ابن مريم } والخطاب لها\n تنبيهاً على أنه يولد من غير أب إذ الأولاد إنما تنسب لأبائها إلا إذا فقد الأب\n ثم وصف الولد بقوله: { وجيهاً في الدنيا والآخرة } أي: شريفاً في الدنيا بالنبوة والرسالة\n وفي الآخرة بالشفاعة لمن تبعه\n ويكون { من المقربين } إلى الله تعالى في الدارين\n { ويكلم الناس } طفلاً { في المهد } على وجه خَرْق العادة في تبرئة أمه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:17",
      "similarity": 0.5987159505967007
    },
    {
      "verse": "5:72",
      "similarity": 0.5387889544419253
    },
    {
      "verse": "5:75",
      "similarity": 0.4401618523794101
    },
    {
      "verse": "5:116",
      "similarity": 0.43386604905853715
    },
    {
      "verse": "19:34",
      "similarity": 0.42519609244279655
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}