{
  "chapter": "آل عمران",
  "text": "قالت رب انى يكون لى ولد ولم يمسسنى بشر قال كذلك الله يخلق ما يشاء اذا قضى امرا فانما يقول له كن فيكون",
  "translations": [
    {
      "translation": "He will speak to people in the cradle, and also when fully grown, and will be one of the righteous,'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"How can I have a son, O Lord, when no man has touched me?\" He said: \"That is how God creates what He wills. When He decrees a thing, He says 'Be', and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: 'O my Lord! How shall I have a son when no man has ever touched me?' The angel answered: Thus shall it be. Allah creates whatever He wills. When He decides something, He merely says: \"Be\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Mary) said, \"How can there be a son for me when no mortal has touched me?\" The angel replied, \"That is how God creates whatever He wants. When He decides to do something He just orders it to exist and it comes into existence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “My Lord! How can I bear a child when no man has ever touched me?” He said, “This is how Allah creates whatever He wills; when He wills a thing, He only says to it, ‘Be’ – and it happens immediately.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"O my Lord! How shall I have a son when no man has touched me.\" He said: \"So (it will be) for Allah creates what He wills. When He has decreed something, He says to it only: `Be! ـ and it is.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: My Lord! when shall there be a son (born) to I me, and man has not touched me? He said: Even so, Allah creates what He pleases; when He has decreed a matter, He only says to it, Be, and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord,' said Mary, 'how shall I have a son seeing no mortal has touched me?' 'Even so,' God said, God creates what He will. When He decrees a thing He does but say to it \"Be,\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: My Lord! How can I have a child when no mortal hath touched me? He said: So (it will be). Allah createth what He will. If He decreeth a thing, He saith unto it only: Be! and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord,\" she said, \"how can I have a child when no man has touched me?\" [The angel] replied, \"Thus it is: God creates what He wills: when He wills a thing He need only say, \"Be,\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: my Lord! in what wise shall there be unto me a son whereas no human being hath touched me. Allah said: even so. Allah createth whatsoever He will, When He hath decreed a thing, He only saith to it: Be, and it becometh;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘My Lord, how shall I have a child seeing that no human has ever touched me?’ He said, ‘So it is that Allah creates whatever He wishes. When He decides on a matter He just says to it ‘‘Be!’’ and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"O my Lord! How shall I have a son when no man hath touched me?\" He said: \"Even so: Allah createth what He willeth: When He hath decreed a plan, He but saith to it, 'Be,' and it is!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"O my Lord! How shall I have a son when no man has touched me.\" He said: \"So (it will be) for Allah creates what He wills. When He has decreed something, He says to it only: \"Be!\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord' she said, 'how can I bear a child when no human being has touched me' He replied: 'Such is the Will of Allah. He creates whom He will. When He decrees a thing, He only says: \"Be,\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “My Lord, how can I have a child, when no man has touched me?” He said, “It will be so. God creates whatever He wills. To have anything done, He only says to it, ‘Be,’ and it is.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"My Lord, how will I have a child when no man has touched me?\" [The angel] said, \"Such is Allah; He creates what He wills. When He decrees a matter, He only says to it, 'Be,' and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:47] She said, ‘Lord, how shall I have a child when no mortal has touched me?’, neither through conjugality or otherwise; He said, the command, ‘It is such, that God will create from you a child without a father. God creates what He will. When He decrees a thing, willing its creation, He says to it only: “Be”, and it is, that is, [and] ‘he is’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(She said: My Lord!) Mary said to Gabriel: master!: (How can I have a child) how is it possible for me to have a child (when no mortal hath touched me?) lawfully or unlawfully? (He) Gabriel (said: So (it will be)) as I have told you. (Allah createth what He will. If He decreeth a thing) if He wills to create a son from you without a father, (He saith unto it only: Be! and it is) a son without a father.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلما سمعت مريم ما سمعت تضرعت إلى ربها واشتكت حيث { قَالَتْ رَبِّ } يا من رباني بالستر والصلاح والعبادة والفلاح { أَنَّىٰ } من أين { يَكُونُ لِي وَلَدٌ وَ } وأنت تعلم يا رب أني { لَمْ يَمْسَسْنِي بَشَرٌ } ومن سنتك إيجاد الولد بعد مباشرة الزوج؟ { قَالَ } سبحانه إشفاقاً لها وإزالة لشكها: { كَذَلِكَ } أي: مثل حالتك التي تعجبين منها، وهي ولادتك بلا مساس أحد وجود جميع الأشياء الظاهرة من كتم العدم ظهوراً إبداعياً؛ إذ { ٱللَّهُ } بقدرته { يَخْلُقُ } يظهر جميع { مَا يَشَآءُ } بلا سباق مدة ومادة بل { إِذَا قَضَىٰ } أراد { أَمْراً } إيجاد أمر وإظهاره من الأمور المكانية الثابتة في حضرة العلم { فَإِنَّمَا يَقُولُ لَهُ } تنفيذاً لقضائه مجرد كلمة: { كُنْ فَيَكُونُ } [آل عمران: 47] بلا تراخ ولا مهلة، بلا توقف على شرط وارتفاع مانع، وحالك التي تتعجبين منها وتستبعدين وقوعها من هذا القبيل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما سمعت البشارة دهشت و { قالت }: يا { رب أنى يكون لي ولد ولم يمسسني بشر } ، والخطاب لله، فانية عن الواسطة جبريل، والاستفهام تعجباً، أو عن الكيفية: هل يكون بتزوج أم لا؟ { قال } لها الملك: { كذلك الله يخلق ما يشاء }\n أو الأمر كذلك كما تقولين، لكن { الله يخلق ما يشاء } لا يحتاج إلى وسائط ولا أسباب، بل { إذا قضى أمراً فإنما يقول له كن فيكون } ، { ويعلمه الكتاب } أي: الكتابة والخط، { والحكمة } أي: النبوة، أو الإصابة في الرأي: { والتوراة والإنجيل }\n\n\n{ و } يجعله { رسولاً إلى بني إسرائيل }\n وكان أول رسل بني إسرائيل يوسف، وآخرهم عيسى - عليهما السلام -، وقال: عليه الصلاة والسلام:\n\n \" بُعثْتُ على إِثْرِ ثمانية آلاف نبيّ، أربعة آلاف من بني إسرائيل \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:20",
      "similarity": 0.4902266134160632
    },
    {
      "verse": "19:35",
      "similarity": 0.4594281433872139
    },
    {
      "verse": "40:62",
      "similarity": 0.4523230207929141
    },
    {
      "verse": "44:13",
      "similarity": 0.42914974468666367
    },
    {
      "verse": "23:89",
      "similarity": 0.41700324772430386
    }
  ]
}