{
  "chapter": "آل عمران",
  "text": "ورسولا الى بنى اسرءيل انى قد جئتكم بـاية من ربكم انى اخلق لكم من الطين كهيـة الطير فانفخ فيه فيكون طيرۢا باذن الله وابرئ الاكمه والابرص واحى الموتى باذن الله وانبئكم بما تاكلون وما تدخرون فى بيوتكم ان فى ذلك لءاية لكم ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "He will teach him the Book and Wisdom, and the Torah and the Gospel, as a Messenger to the tribe of Israel, saying: 'I have brought you a Sign from your Lord. I will create the shape of a bird out of clay for you and then breathe into it and it will be a bird by Allah's permission. I will heal the blind and lepers, and bring the dead to life, by Allah's permission. I will tell you what you eat and what you store up in your homes. There is a Sign for you in that if you are muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he will be Apostle to the children of Israel, (saying:) 'I have come to you with a prodigy from your Lord that I will fashion the state of destiny out of mire for you, and breathe (a new spirit) into it, and (you) will rise by the will of God. I will heal the blind and the leper, and infuse life into the dead, by the leave of God. I will tell you what you devour and what you hoard in your homes. In this will be a portent for you if you do believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and he will be a Messenger to the Children of Israel.' (And when he came to them he said): 'I have come to you with a sign from your Lord. I will make for you from clay the likeness of a bird and then I will breathe into it and by the leave of Allah it will become a bird. I will also heal the blind and the leper, and by the leave of Allah bring the dead to life. I will also inform you of what things you eat and what you treasure up in your houses. Surely this is a sign for you if you are true believ-ers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will be a Messenger of God to the Israelites to whom he will say, \"I have brought you a miracle from your Lord. I can create for you something from clay in the form of a bird. When I blow into it, it will become a real bird, by the permission of God. I can heal the blind and the lepers and bring the dead back to life, by the permission of God. I can tell you about what you eat and what you store in your homes. This is a miracle for you if you want to have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And he will be a Noble Messenger towards the Descendants of Israel saying, ‘I have come to you with a sign from your Lord, for I mould a birdlike sculpture from clay for you, and I blow into it and it instantly becomes a (living) bird, by Allah’s command; and I heal him who was born blind, and the leper, and I revive the dead, by Allah’s command; and I tell you what you eat and what you store in your houses; undoubtedly in these (miracles) is a great sign for you, if you are believers.’ (Several miracles bestowed to Prophet Eisa are mentioned here.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will make him a Messenger to the Children of Israel (saying): \"I have come to you with a sign from your Lord, that I design for you out of clay, a figure like that of a bird, and breathe into it, and it becomes a bird by Allah's leave; and I heal the blind, and the leper, and I bring the dead to life by Allah's leave. And I inform you of what you eat, and what you store in your houses. Surely, therein is a sign for you, if you believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (make him) an apostle to the children of Israel: That I have come to you with a sign from your Lord, that I determine for you out of dust like the form of a bird, then I breathe into it and it becomes a bird with Allah's permission and I heal the blind and the leprous, and bring the dead to life with Allah's permission and I inform you of what you should eat and what you should store in your houses; most surely there is a sign in this for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to be a Messenger to the Children of Israel saying, \"I have come to you with a sign from your Lord. I will create for you out of clay as the likeness of a bird; then I will breathe into it, and it will be a bird, by the leave of God. I will also heal the blind and the leper, and bring to life the dead, by the leave of God. I will inform you too of what things you eat, and what you treasure up in your houses. Surely in that is a sign for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will make him a messenger unto the Children of Israel, (saying): Lo! I come unto you with a sign from your Lord. Lo! I fashion for you out of clay the likeness of a bird, and I breathe into it and it is a bird, by Allah's leave. I heal him who was born blind, and the leper, and I raise the dead, by Allah's leave. And I announce unto you what ye eat and what ye store up in your houses. Lo! herein verily is a portent for you, if ye are to be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will make him a messenger to the Children of Israel. He will say: \"I have come to you with a sign from your Lord. I will make the shape of a bird out of clay for you and then breathe into it and, by God's leave, it will become a living bird. And by God's leave I will heal the blind and the leper and bring the dead to life. I will tell you what you eat and what you store up in your homes. Surely in this there is a sign for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And an apostle Unto the children of Israi'l with this message: verily have come unto you with a sign from your Lord, verily I form for you out of clay as though the likeness of a bird and then I breathe thereunto, and a bird it becometh by Allah's command. And heal the blind from birth and the leprous and quicken the dead by Allah's command. And I declare unto you that which ye have eaten and that which ye have stored in your houses. Verily herein is a sign for you if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and [he will be] an apostle to the Children of Israel, [and he will declare,] “I have certainly brought you a sign from your Lord: I will create for you the form of a bird out of clay, then I will breathe into it, and it will become a bird by Allah’s leave. I heal the blind and the leper and I revive the dead by Allah’s leave. I will tell you what you have eaten and what you have stored in your houses. There is indeed a sign in that for you, should you be faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (appoint him) a messenger to the Children of Israel, (with this message): \"'I have come to you, with a Sign from your Lord, in that I make for you out of clay, as it were, the figure of a bird, and breathe into it, and it becomes a bird by Allah's leave: And I heal those born blind, and the lepers, and I quicken the dead, by Allah's leave; and I declare to you what ye eat, and what ye store in your houses. Surely therein is a Sign for you if ye did believe;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will make him ['Iesa (Jesus)] a Messenger to the Children of Israel (saying): \"I have come to you with a sign from your Lord, that I design for you out of clay, as it were, the figure of a bird, and breathe into it, and it becomes a bird by Allah's Leave; and I heal him who was born blind, and the leper, and I bring the dead to life by Allah's Leave. And I inform you of what you eat, and what you store in your houses. Surely, therein is a sign for you, if you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to be a Messenger to the Children of Israel, (saying): \"I have come to you with a sign from your Lord. From clay, I will create for you the likeness of a bird. I shall breathe into it and by the permission of Allah, it shall be a bird. I shall heal the blind, and the leper, and raise the dead to life by the permission of Allah. I shall tell you what you ate and what you store in your houses. Surely, that will be a sign for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A messenger to the Children of Israel: “I have come to you with a sign from your Lord. I make for you out of clay the figure of a bird; then I breathe into it, and it becomes a bird by God’s leave. And I heal the blind and the leprous, and I revive the dead, by God’s leave. And I inform you concerning what you eat, and what you store in your homes. In that is a sign for you, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [make him] a messenger to the Children of Israel, [who will say], 'Indeed I have come to you with a sign from your Lord in that I design for you from clay [that which is] like the form of a bird, then I breathe into it and it becomes a bird by permission of Allah. And I cure the blind and the leper, and I give life to the dead - by permission of Allah. And I inform you of what you eat and what you store in your houses. Indeed in that is a sign for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:49] And He will make him, to be a messenger to the Children of Israel, during his tender years, or after puberty. Gabriel breathed into the opening of her garment and she became pregnant. What happened to her after this is mentioned later in sūrat Maryam [Q. 19:21ff]. Thus, when God sent him to the Children of Israel, he said to them, ‘I am God’s Messenger to you’, and, ‘I have come to you with a sign, an indication of my truthfulness, from your Lord, and it is that, I will create (a variant reading for [the particle introducing the relative clause] annī, ‘that I’, has innī, ‘truly I’, indicating a new [independent] sentence) [that] I will fashion, for you out of clay like the shape of a bird (ka-hay’at, ‘something like the shape of’: the kāf is the subject of a passive participle) then I will breathe into it (fīhi, the [suffixed] pronoun [-hi] refers to the [preceding] kāf), and it will be a bird (tayran, is also read tā’iran) by the leave, the will, of God. So he created for them a bat, being the most perfectly-created of birds, and they would watch it flying, but when it went out of sight, it would fall dead — so that the work of a creature [sc. Jesus] may be distinguished from the work of the Creator, namely, God, exalted be He, and that he might know that perfection belongs to God [alone]. I will also heal the blind (akmah is one that is blind from birth) and the leper; these two are singled out for mention because with both afflictions the person is completely helpless. He [Jesus] was sent in an age of [characterised by] medicinal science, and he cured, through supplication, fifty thousand in one day on the condition that each person would become a believer; and I bring to life the dead, by the leave of God — He repeats this to preclude any false attributions of divinity to him — he brought back to life his friend ‘Āzar, the son of an old woman, and the daughter of the tithe-collector, all of whom lived on and produced offspring, and [he also brought back to life] Shem, son of Noah, but he died [again] immediately. I will inform you too of what things you eat, and what you treasure up, store, in your houses, and what I have never seen, and he would inform people what they had eaten and what they would eat. Surely in that, mentioned, is a sign for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And will make him a messenger) after the age of thirty (unto the Children of Israel), and when he went to them he said: (Lo! I come unto you with a sign) a token (from your Lord) for my prophethood. They said: what is this sign? He replied: (Lo! I fashion for you out of clay the likeness of a bird, and I breathe into it) like the breathing of a sleeping person (and it is a bird) flying in the air, (by Allah's leave) by Allah's command. Then he fashioned for them a bat and when it became alive, they said: this is sorcery; do you have another sign? He said: yes, (I heal him who was born blind, and the leper) also, (and I raise the dead, by Allah's leave) by Allah's greatest Name: Alive, the Eternal. And when he did this, they said: this is sorcery, do you have any other sign? He said: yes, (And I announce unto you what you eat) in the morning and at night (and what you store up in your houses) what you save from your lunch to dinner and from your dinner to the next day's lunch. (Lo! Herein) in that which I have told you (verily is a portent) a sign (for you, if ye are believers) who have faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأُبْرِىءُ ٱلأَكْمَهَ وٱلأَبْرَصَ } فالأَكمَهُ: الذي تَلِدُهُ أُمُّهُ أَعمى، والجمعُ الكُمْهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And I will clear the Akmah and the Abraas} So the Akmah are those who are born blind, and the plural is Kumh.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأنفخ فيه فيكون طيراً بإذن الله } \n وكان يخلق لهم صورة الخفاش\n لأنها أكمل الطيرلأن لها ثدياً وأسناناً وتحيض وتطير\n فيكون أبلغ في المعجزة\n وكان يطير ما دام الناس ينظرون إليه\n فإذا غاب عنهم سقط ميتاً ليتميز فعل الحق من فعل الخلق\n ثم قال لهم: ولي معجزة أخرى أني { أبرئ الأكمه } الذي ولد أعمى\n فأحرى غيره { والأبرص } الذي فيه وضح\n وخصهما لأنهما عاهتان معضلتان\n وكان الغالب في زمن عيسى الطب\n فأراهم المعجزة من جنس ذلك\n رُوِي: أنه ربما اجتمع عليه من المرضى في اليوم الواحد ألوف\n من أطاف منهم البلوغ أتاه\n ومن لم يطق أتاه عيسى عليه السلام\n وإنما كان يداويهم بالدعاء على شرط الإسلام\n { وأحيي الموتى بإذن الله } لا بقدرتي دفعاً لتوهم الألوهية\n فإن الإحياء ليس من طوق البشر\n رُوِيَ أنه أحيا أربعة أنفس: العازر\n وكان صديقاً له\n فأرسلت أخته إلى عيسى أن أخاك العازر يموت\n فأتاه من مسيرة ثلاثة أيام فوجده مات\n فقال لأخته: انطلقي بنا إلى قبره\n وهو في صخرة مطبقة\n فدعا الله تعالى\n فقام العازر يقطر ودكه\n فعاش وولده له\n و ابن العجوز\n مُر بجنازته على عيسى عليه السلام فدعا الله تعالى\n فجلس على سريره\n ونزل عن أعناق الرجال\n ولبس ثيابه\n وحمل سريره على عنقه\n ورجع إلى أهله\n وبقي حتى وُلد له\n وابنة العاشر\n كان يأخذ العشور\n قيل له: أتحييها\n وقد ماتت أمس؟ فدعا الله تعالى\n فعاشت وولد لها\n وسام بن نوح\n دعا باسم الله الأعظم\n فخرج من قبره\n وقد شاب نصف رأسه\n فقال: أقامت الساعة؟ قال: لا\n لكني دعوت الله فأحياك\n ما لي أرى الشيب في رأسك\n ولم يكن في زمانك؟ قال: سمعت الصيحة\n فظننت أن الساعة قامت فشبت من هولها\n قيل: كان يحيي الموتى بـ { يا حي يا قيوم }\n { وأنبئكم بما تأكلون وما تدخرون في بيوتكم } \n لما أبرأ الأكمه والأبرص قالوا\n هذا سحر\n أخبرنا بما نأكل وما ندخر؟ فكان يُخبر الرجل بما يأكل في غدائه وعشائه\n ورُوِيَ أنه لما كان في المكتب\n كان يحدث الغلمان بما يصنع لهم آباؤهم من الطعام\n فيقول للغلام: انطلق\n\n\n غداء أهلك كذا وكذا\n فيقول أهله: من أخبرك بهذا؟ قال: عيسى\n فحبسوا صبيانهم عنه\n وقالوا: لا تلعبوا مع هذا الساحر\n فجمعوهم في بيت\n فجاء عيسى يطلبهم\n فقالوا: ليسوا ههنا\n قال: ماذا في البيت؟ قالوا: خنازير\n قال عيسى: كذلك يكونون\n ففتحوا الباب\n فإذا هم خنازير\n فهموا بقتله\n فهربت به أمه إلى مصر\n\nقاله السُّدي\n ثم قال لهم: { إن في ذلك لآية لكم إن كنتم مؤمنين } \n فإن غير المؤمنين لا ينتفع بالمعجزات لعناده\n { ومصدقاً لما بين يدي من التوراة } أي: وجئتكم مصدقاً للتوراة\n وشاهداً على صحتها\n { ولأُحلَّ لكم بعض الذي حُرم عليكم } في شريعة موسى عليه السلام كالشحوم والثروب ولحم الإبل والعمل في السبت\n وهذا يدل على أنه ناسخ للتوراة\n ولا يخل بكونه مصدقاً له\n كما لا يخل نسخ القرآن بعضه لبعض بصحته\n فإن النسخ في الحقيقة: بيان لانتهاء العمل بذلك الحكم\n ثم قال لهم: { و } قد { جئتكم بآية } واضحة { من ربكم } \n قد شاهدتموها بأعينكم\n فما بقي إلا عنادكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:110",
      "similarity": 0.5806686185353759
    },
    {
      "verse": "18:10",
      "similarity": 0.15829469896533738
    },
    {
      "verse": "18:16",
      "similarity": 0.15009667333684001
    },
    {
      "verse": "38:71",
      "similarity": 0.06720900214457813
    },
    {
      "verse": "38:76",
      "similarity": 0.06588323896756121
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}