{
  "chapter": "آل عمران",
  "text": "ربنا ءامنا بما انزلت واتبعنا الرسول فاكتبنا مع الشهدين",
  "translations": [
    {
      "translation": "Our Lord, we have iman in what You have sent down and have followed the Messenger, so write us down among the witnesses.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Lord, we believe in Your revelations and follow this Apostle. Enroll us among the witnesses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! We believe in the com-mandment You have revealed and we obey the Messenger; make us, then, one of those who bear witness (to the Truth).'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They prayed, \"Lord, we have believed in what You have revealed to Your Messenger and we have followed him. Write down our names with those who testify in support of the Truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord! We have believed in what You have sent down and we follow the Noble Messenger, therefore record us among the witnesses of the truth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! We believe in what You have sent down, and we follow the Messenger [`Isa]; so write us down among those who bear witness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! we believe in what Thou hast revealed and we follow the apostle, so write us down with those who bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, we believe in that Thou hast sent down, and we follow the Messenger. Inscribe us therefore with those who bear witness.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! We believe in that which Thou hast revealed and we follow him whom Thou hast sent. Enrol us among those who witness (to the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, we believe in what You have sent down and we follow the messenger, so count us among those who bear witness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! we believe in that which Thou hast sent down, and, follow the apostle; write us up wherefore with the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, we believe in what You have sent down, and we follow the apostle, so write us among the witnesses.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! we believe in what Thou hast revealed, and we follow the Messenger; then write us down among those who bear witness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! We believe in what You have sent down, and we follow the Messenger ['Iesa (Jesus)]; so write us down among those who bear witness (to the truth i.e. La ilaha ill-Allah - none has the right to be worshipped but Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, we have believed in what You sent down and followed the Messenger. Write us among Your witnesses'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord, we have believed in what You have revealed, and we have followed the Messenger, so count us among the witnesses.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, we have believed in what You revealed and have followed the messenger Jesus, so register us among the witnesses [to truth].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:53] Lord, we believe in what You have revealed, of the Gospel, and we follow the Messenger, Jesus; inscribe us therefore with those who bear witness’, to Your Oneness and to the truthfulness of Your Messenger.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord) our Lord! (We believe in that which Thou hast revealed) of the Scripture, i.e. the Gospel (and we follow him whom Thou hast sent) the religion of the Messenger Jesus. (Enrol us among those who witness) make us among the first forerunners who were witnesses before us; it is also said this means: make us of the community of Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما اعترفوا بالإيمان بالله وبنصرة رسوله المبلغ لأحكامه، وأشهدوا على إيمانه وإسلامهم، ناجوا مع الله مخبتين مخلصين في سريهم حيث قالوا: { رَبَّنَآ } يا من ربانا بإرسال الرسل وإنزال الكتب { آمَنَّا } بتوفيقك وبإرشادك رسلك { بِمَآ أَنزَلَتَ } من الكتاب المبين لأحكامك المنبهة المتعلقة لتوحيدك { وَ } مع الإيمان به { ٱتَّبَعْنَا } في امتثال ما أمرت له فيه { ٱلرَّسُولَ } المنزل عليه، المتمثل بجميع أوامره الموسلة إلى الكشف والشهود { فَٱكْتُبْنَا } بفضلك { مَعَ ٱلشَّٰهِدِينَ } [آل عمران: 53] الذين لا يشهدون في الوجود سوى شمس ذاتك وتجلياتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}