{
  "chapter": "آل عمران",
  "text": "ومكروا۟ ومكر الله والله خير المكرين",
  "translations": [
    {
      "translation": "They plotted and Allah plotted. But Allah is the best of plotters.*",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they (the unbelievers) contrived a plot, and God did the like; and God's plan is the best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they schemed (against the Messiah), and Allah countered their schemes by schemes of His own. Allah is the best of schemers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers plotted and God planned, but God is a much better planner;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers conspired (to kill Eisa), and Allah covertly planned to destroy them; and Allah is the best of secret planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (disbelievers) plotted and Allah planned too. And Allah is the Best of those who plot\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they planned and Allah (also) planned, and Allah is the best of planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they devised, and God devised, and God is the best of devisers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (the disbelievers) schemed, and Allah schemed (against them): and Allah is the best of schemers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they schemed but God also schemed and God is the Best of Schemers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they plotted, and Allah plotted, and Allah is the Best of plotters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they plotted [against Jesus], and Allah also devised, and Allah is the best of devisers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (the unbelievers) plotted and planned, and Allah too planned, and the best of planners is Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (disbelievers) plotted [to kill 'Iesa (Jesus)], and Allah planned too. And Allah is the Best of the planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They devised, and Allah devised. And Allah is the Best Devisor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They planned, and God planned; but God is the Best of planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers planned, but Allah planned. And Allah is the best of planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:54] God says: And they, the disbelievers among the Children of Israel, schemed, against Jesus, by assigning someone to assassinate him; and God schemed, by casting the likeness of Jesus onto the person who intended to kill him, and so they killed him, while Jesus was raised up into heaven; and God is the best of schemers, most knowledgeable of him [Jesus].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they schemed) they, i.e. the Jews, planned to kill Jesus, (and Allah schemed (against them)) Allah wished to kill their man Tatianos: (and Allah is the best of schemers) the strongest of those who have a will; it is also said this means: the best of Makers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَكَرَ ٱللَّهُ } معناهُ أَهْلَكَ الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَكَرُواْ } احتالوا؛ أي: الكافرون المحسوسون بالكفر في قتل عيسى عليه السلام بأن وكلوا عليه من يقتله غيلة { وَمَكَرَ ٱللَّهُ } معهم في إنجائه ورفعه إلى السماء، وإلقاء شبهة على من اغتال عليه حتى قتل مجاناً على مظنة أنه هو، مع أنه رفع إلى السماء { وَٱللَّهُ } المنتقم عن من ظلم لأجل من ظلم { خَيْرُ ٱلْمَاكِرِينَ } [آل عمران: 54] أي: أقوى المحتالين لمن اغتال عليه لقتله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما أخرجه بنو إسرائيل عاد إليهم مع الحواريين، وصاح فيهم بالدعوة، فهمُّوا بقتله، وتواطؤوا عليه، { ومكروا } أي: دبروا الحيل في قتله، { ومكر الله } بهم، أي: استدرجهم حتى قتلوا صاحبهم، ورُفع عيسى عليه السلام، فالمكر في الأصل: هو حيلة يجلب بها غيره إلى مضرة\n ولا تُسند إلى الله إلى على حسب المقابلة والازدواج: كقوله:\n\nالنِّساء: 142]، وقوله:\n\n[البقرة: 15]، { والله خير الماكرين }\n أي: أشدهم مكراً، وأقواهم على إيصال الضرر من حيث لا يحتسب، أو أفضل المجازين بالعقوبة لأنه لا أحد أقدر على ذلك منه\n تنبيه: قيل للجنيد رضي الله عنه: كيف رَضِيَ المكرَ لنفسه، وقد عابه على غيره؟ قال: لا أدري، ولكن أنشدني فلان للطبرانية:\n\n\n\nفقال له السائل: أسألُك عن القرآن، وتجيبني بشعر الطبرانية؟ قال: ويحك، قد أجبتك إن كنت تعقل\n إنَّ تخليته إياهم مع المكرية، مكرٌ منه بهم\n هـ\n قلت: وجه الشاهد في قوله: وتفعله فيحسن منك ذاك، ومضمن جوابه: أن فعل الله كله حسن في غاية الإتقان، لا عيب فيه ولا نقصان، كما قال صاحب العينية:\n\nوتخليته تعالى إياهم مع المكر، تسبب عنه الرفع إلى السماء، وإبقاء عيسى حيّاً إلى آخر الزمان، حتى ينزل خليفة عن نبينا - عليه الصلاة والسلام -، فكان ذلك في غاية الكمال والإتقان، لكن لا يفطن لهذا إلا أهل العرفان\n الإشارة: يجب على المريد الصادق الذي يطلب دواء قلبه، أن يفر من الوطن الذي يظهر فيه الإنكار، إلى الوطن الذي يكثر فيه الإقرار، يفر إلى من يعينه على نصر الدين من الأبرار المقربين، الذين يجعلهم الله حواري الدين، ففي الحديث الصحيح:\n\n \" خَيْرُ مالِ المُسْلِم غَنَمٌ يَتْبَعُ بها شَعَفَ الجِبَالِ يَفِرُّ مِنَ الْفِتَنِ \" \n\nفالمؤمن يفر بدينه من شاهق جبل إلى شاهق جبل حتى يدركه الموت، وما زالت الأكابر تفر بنفسها إلى شواهق الجبال، يهربون من حس الدنيا وشغبها، ولا يرافقون إلا من يستعين بهم على ذكر الله، وهم أهل التجريد، الذي اصطفاهم الله لخالص التوحيد، فروا إلى الله فآواهم الله، قالوا: { آمنا بالله وأشهد بأنا مسلمون } منقادون لما تريد منا، { ربنا آمنا بما أنزلت } من الأحكام الجلالية والجمالية، قد عرفناك في جميع الحالات، { فاكتبنا مع الشاهدين } لحضرتك، المنعمين بشهود ذاتك، ومن مكر بنا من القواطع الخفية فَغَيَّبنا عنه بشهود أنوارك القدسية، وانصرنا فإنك خير الناصرين، ولا تدعنا مع مكر الماكرين يا رب العالمين\n\n",
      "translations": []
    }
  ]
}