{
  "chapter": "آل عمران",
  "text": "اذ قال الله يعيسى انى متوفيك ورافعك الى ومطهرك من الذين كفروا۟ وجاعل الذين اتبعوك فوق الذين كفروا۟ الى يوم القيمة ثم الى مرجعكم فاحكم بينكم فيما كنتم فيه تختلفون",
  "translations": [
    {
      "translation": "When Allah said, \"Isa, I will take you back and raise you up to Me and purify you of those who are kafir. And I will place the people who follow you above those who are kafir until the Day of Rising. Then you will all return to Me, and I will judge between you regarding the things about which you differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God said: \"O Jesus, I will take you to Myself and exalt you, and rid you of the infidels, and hold those who follow you above those who disbelieve till the Day of Resurrection. You have then to come back to Me when I will judge between you in what you were at variance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And it was part of His scheme) when Allah said: 'O Jesus! I will recall you and raise you up to Me and will purify you (of the company) of those who disbelieve, and will set your followers above the unbelievers till the Day of Resurrection. Then to Me you shall return, and I will judge between you regarding what you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He told Jesus, \"I will save you from your enemies, raise you to Myself, keep you clean from the association with the disbelievers, and give superiority to your followers over the unbelievers until the Day of Judgment. On that day you will all return to Me and I shall resolve your dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Allah said, “O Eisa! I will keep you alive till your full age, and raise you towards Me, and cleanse you of the disbelievers and give your followers dominance over the disbelievers until the Day of Resurrection; then you will all return to Me, so I shall judge between you concerning the matter in which you dispute.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah said: \"O `Isa! I will take you and raise you to Myself and purify [save] you from those who disbelieve, and I will make those who follow you superior to those who disbelieve till the Day of Resurrection. Then you will return to Me and I will judge between you in the matters in which you used to dispute.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah said: O Isa, I am going to terminate the period of your stay (on earth) and cause you to ascend unto Me and purify you of those who disbelieve and make those who follow you above those who disbelieve to the day of resurrection; then to Me shall be your return, so l will decide between you concerning that in which you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God said, 'Jesus, I will take thee to Me and will raise thee to Me and I will purify thee of those who believe not. I will set thy followers above the unbelievers till the Resurrection Day. Then unto Me shall you return, and I will decide between you, as to what you were at variance on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when Allah said: O Jesus! Lo! I am gathering thee and causing thee to ascend unto Me, and am cleansing thee of those who disbelieve and am setting those who follow thee above those who disbelieve until the Day of Resurrection. Then unto Me ye will (all) return, and I shall judge between you as to that wherein ye used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"O Jesus, I shall take you to Me and will raise you up to Me and shall clear you [of the calumnies] of the disbelievers, and shall place those who follow you above those who deny the truth, until the Day of Judgement; then to Me shall all return and I will judge between you regarding your disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time Allah said: O 'Isa! verily I shall make thee die, and am lifting thee to myself and am purifying thee from those who disbelieve, and shall place those who follow thee above those who disbelieve until the Day of Resurrection; thereafter unto Me shall be the return of you all, then I shall judge between you of that wherein ye were wont to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah said, ‘O Jesus, I shall take you[r soul], and I shall raise you up toward Myself, and I shall clear you of [the calumnies of] the faithless, and I shall set those who follow you above the faithless until the Day of Resurrection. Then to Me will be your return, whereat I will judge between you concerning that about which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! Allah said: \"O Jesus! I will take thee and raise thee to Myself and clear thee (of the falsehoods) of those who blaspheme; I will make those who follow thee superior to those who reject faith, to the Day of Resurrection: Then shall ye all return unto me, and I will judge between you of the matters wherein ye dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah said: \"O 'Iesa (Jesus)! I will take you and raise you to Myself and clear you [of the forged statement that 'Iesa (Jesus) is Allah's son] of those who disbelieve, and I will make those who follow you (Monotheists, who worship none but Allah) superior to those who disbelieve [in the Oneness of Allah, or disbelieve in some of His Messengers, e.g. Muhammad SAW, 'Iesa (Jesus), Musa (Moses), etc., or in His Holy Books, e.g. the Taurat (Torah), the Injeel (Gospel), the Quran] till the Day of Resurrection. Then you will return to Me and I will judge between you in the matters in which you used to dispute.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said' (Prophet) Jesus, I will take you to Me and will raise you to Me, and I will purify you from those who disbelieve. I will make your followers (who died before Prophet Muhammad) above those who disbelieve till the Day of Resurrection. Then, to Me you shall all return, and I shall judge between you as to that you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, “O Jesus, I am terminating your life, and raising you to Me, and clearing you of those who disbelieve. And I will make those who follow you superior to those who disbelieve, until the Day of Resurrection. Then to Me is your return; then I will judge between you regarding what you were disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention] when Allah said, \"O Jesus, indeed I will take you and raise you to Myself and purify you from those who disbelieve and make those who follow you [in submission to Allah alone] superior to those who disbelieve until the Day of Resurrection. Then to Me is your return, and I will judge between you concerning that in which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:55] And mention, when God said, ‘O Jesus, I am gathering you, seizing you, and raising you to Me, away from the world without death, and I am cleansing you of, removing you far away from, those who disbelieved, and I am setting those who follow you, those Christians and Muslims who believed in your prophethood, above those who disbelieved, in you, namely, the Jews, becoming above them through [definitive] argument and the sword, until the Day of Resurrection. Then to Me shall be your return, and I will decide between you, as to what you were at variance about, as regards religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((And remember) when Allah said: Jesus! Lo! I am gathering thee and causing thee to ascend unto Me, 59 and am cleansing) saving (thee of those who disbelieve) in you (and am setting those who follow you) follow your Religion (above those who disbelieve) with strong argument and triumph (until the Day of Resurrection) then I shall make you to die after descent; it is also said this means: I shall make your heart die to the love of the life of this world. (Then unto Me ye will (all) return) after death, (and I shall judge between you as to that wherein) in religion (ye used to differ) to argue.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل { إِذْ قَالَ ٱللَّهُ } إعلاماً لعيسى عليه السلام حين هموا بقتله وعينوا من اغتال عليه وهو غافل عن كيدههم: { يٰعِيسَىٰ إِنِّي } بغلبة لاهوتيتي عليك { مُتَوَفِّيكَ } مصفيك عن ناسوتيتك المانعة عن الوصول إلى مقر العز { وَ } بعد تصفيتك عن كدورة ناسوتيتك { رَافِعُكَ } بعد ارتفاع موانعك { إِلَيَّ } إذ لا مرجع لك غيري { وَ } بعد رفعك { مُطَهِّرُكَ } ومزكيك { مِنَ } حجاب { ٱلَّذِينَ كَفَرُواْ } ستروا بغيوب أنانتيك الباطلة شمس الذات الظاهرة على جميع الذرات { وَ } إني بعد رفعك إليَّ { جَاعِلُ ٱلَّذِينَ } آمنوا بك و { ٱتَّبَعُوكَ } في جميع ما جئت به لإصلاح حالهم { فَوْقَ ٱلَّذِينَ كَفَرُواْ } أي: أعلى رتبة وأشرف منزلة ومكانة { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } بحيث\n[البقرة: 61] ولهم عذاب أليم\n\n\nوبعد ظهور عيسى عيه السلام لم يتفق غلبة اليهود أصلاً\n بل كانوا منكوبين منكوسين دائماً إلى الآن { ثُمَّ } قال سبحانه بلسان التوحيد على وجه التنبيه لعيسى ولمن آمن له\n ولمن أنكر عليه وكفر: { إِلَيَّ مَرْجِعُكُمْ } جميعاً في النشأة الأخرى أيها المختلفون في أمر الدين والإطاعة والإيمان والكفر في النشأة الأولى { فَأَحْكُمُ بَيْنَكُمْ } بعد رجوعكم إليَّ { فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ } [آل عمران: 55] لعى مقتضى علمي وإرادتي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ قال }: ظرف لمقدر، أي: اذكر، أو وقع ذلك إذ قال، أو لمكروا، و { متوفيك } أي: رافعك إليَّ وافياً تاماً، من قولهم: توفيت كذا واستوفيته: قبضته وافياً تامّاً، أو مميتك عن الشهوات العائقة عن العروج إلى عالم الملكوت، أو منيمك بدليل قوله تعالى:\n\n[الأنعَام: 60]، رُوِيَ أنه رُفع نائماً، والإجماع على أنه لم يمت، قال تعالى: { وما قتلوه وما صلبوه ولكن شبه لهم } ، وقوله: { ذلك } مبتدأ، و { نتلوه }: خبر، و { من الآيات }: حال، أو { من الآيات }: خبر، و { نتلوه }: حال، أو خبر بعد خبر\n يقول الحقّ جلّ جلاله: اذكر { إذ قال الله } لعيسى عليه السلام لما أراد رفعه: { يا عيسى إني متوفيك } ، أي: قابضك إليّ ببدنك تامّاً، { ورافعك إليَّ } أي: إلى محل كرامتي ومقر ملائكتي، { ومطهرك من الذين كفروا } أي: من مخالطة دنس كفرهم، { وجاعل الذين اتبعوك } ممن صدق بنبوتك من النصارى والمسلمين، وقال قتادة والشعبي والربيع: هم أهل الإسلام\n هـ\n فوالله ما اتبعه من ادعاه ربا، فمن تبع دينه حقّاً وقد حقق الله فيهم هذا الأمر، فإن اليهود لم ترفع لهم راية قط، ولم يتفق لهم ملك ولا دولة إلى زمننا هذا\n ثم قال تعالى: { ثم إليَّ مرجعكم } بالبعث، { فأحكم بينكم فيما كنتم فيه تختلفون } من أمر الدين وأمر عيسى\n { فأما الذين كفروا فأعذبهم عذاباً شديداً في الدنيا والآخرة } أي: فأجمع لهم عذاباً الآخرة لعذاب الدنيا الذي أصابهم فيها من القتل والسبي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:14",
      "similarity": 0.512783697463496
    },
    {
      "verse": "43:63",
      "similarity": 0.386790207371685
    },
    {
      "verse": "6:165",
      "similarity": 0.33053919269396004
    },
    {
      "verse": "4:158",
      "similarity": 0.31634720889594153
    },
    {
      "verse": "56:79",
      "similarity": 0.28644661923609993
    }
  ]
}