{
  "chapter": "آل عمران",
  "text": "فاما الذين كفروا۟ فاعذبهم عذابا شديدا فى الدنيا والءاخرة وما لهم من نصرين",
  "translations": [
    {
      "translation": "As for those who are kafir. I will punish them with a harsh punishment in this world and the Next World. They will have no helpers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are infidels will surely receive severe punishment both in this world and the next; and none will they have to help (or save) them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieved, I shall punish them with a terrible chastisement in this world and in the Next; and they shall find none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall sternly punish the unbelievers in this life and in the life to come and no one will help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So I shall mete a severe punishment to those who disbelieve, in this world and in the Hereafter; and they will not have any supporters.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who disbelieve, I will punish them with severe torment in this world and in the Hereafter, and they will have no helpers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as to those who disbelieve, I will chastise them with severe chastisement in this world and the hereafter, and they shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, I will chastise them with a terrible chastisement in this world and the next; they shall have no helpers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve I shall chastise them with a heavy chastisement in the world and the Hereafter; and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth shall be sternly punished in this world and in the world to come: there shall be none to help them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for those who disbelieved I shall torment them with a severe torment in the world and the Hereafter, nor shall have they any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, I will punish them with a severe punishment in the world and the Hereafter; and they will have no helpers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who disbelieve, I will punish them with a severe torment in this world and in the Hereafter, and they will have no helpers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, I will sternly punish them in this world and in the Everlasting Life, there shall be none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, I will punish them with a severe punishment, in this world and the next, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who disbelieved, I will punish them with a severe punishment in this world and the Hereafter, and they will have no helpers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:56] As for the disbelievers, I will chastise them with a terrible chastisement in this world, through being killed, taken captive and made to pay the jizya, and the Hereafter, in the Fire; they shall have no helpers, none to protect them from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { فإما الذين كفروا فأعذبهم } إلى قوله { فنوفيهم أجورهم } تفصيل لما أجمل في قوله { فأحكم بينكم فيما كنتم فيه تختلفون } . وقوله { فأعذبهم عذاباً شديداً في الدنيا والأخرة } المقصود من هذا الوعيدِ هو عذاب الآخرة لأنه وقع في حَيز تفصيل الضمائر من قوله : { فأحكم بينكم فيما كنتم فيه تختلفون } وإنما يكون ذلك في الآخرة ، فذُكِر عذاب الدنيا هنا إدماج . فإن كان هذا مما خاطب الله به عيسى فهو مستعمل في صريح معناه ، وإن كان كلاماً من الله في القرآن خوطب به النبي صلى الله عليه وسلم والمسلمونَ ، صح أن يكون مراداً منه أيضاً التعريض بالمشركين في ظلمهم محمداً صلى الله عليه وسلم عن مكابرة منهم وحسد . وتقدم تفسير إسناد المحبة إلى الله عند قوله : قل إن كنتم تحبون الله في هذه السورة .وجملة { وما لهم من ناصرين } تذييل لجملة { أعذّبهم عذاباً شديداً في الدنيا والآخرة } أي ولا يجدون ناصرين ينصرونهم علينا في تعذيبهم الذي قدّره الله تعالى .واعلم أنّ قوله فأعذّبهم عذاباً شديداً في الدنيا والآخرة قضية جزئية لا تقتضي استمرار العذابين :فأما عذاب الدنيا فهو يجري على نظام أحوال الدنيا : من شدة وضعف وعدم استمرار ، فمعنى انتفاء الناصرين لهم منه انتفاءُ الناصرين في المدة التي قدّرها الله لتعذيبهم في الدنيا ، وهذا متفاوت ، وقد وَجَد اليهود ناصرين في بعض الأزمان مثل قصة استير في الماضي وقضية فلسطين في هذا العصر .وأما عذاب الآخرة : فهو مطلق هنا ، ومقيد في آيات كثيرة بالتأييد ، كما قال : { وما هم بخارجين من النار } \\[ البقرة : 167 \\] .وجملة { والله لا يحب الظالمين } تذييل للتفصيل كله فهي تذييل ثاننٍ لجملة { فأعذبهم عذاباً شديداً } بصريح معناها ، أي أعذّبهم لأنهم ظالمون والله لا يحبّ الظالمين وتذييلٌ لجملة { وأما الذين آمنوا وعملوا الصالحات } إلى آخرها ، بكناية معناها؛ لأنّ انتفاء محبة الله الظالمين يستلزم أنه يحبّ الذين آمنوا وعملوا الصالحات فلذلك يعطيهم ثوابهم وافياً .ومعنى كونهم ظالمين أنهم ظلَموا أنفسهم بكفرهم وظلَمَ النصارى الله بأن نقصوه بإثبات ولد له وظلموا عيسى بأن نسبوه ابناً للَّه تعالى ، وظلمه اليهود بتكذيبهم إياه وأذاهم .وعذاب الدنيا هو زوال الملك وضرب الذلة والمسكنة والجزية ، والتشريد في الأقطار ، وكونهم يعيشون تبعاً للناس ، وعذاب الآخرة هو جهنم . ومعنى { وما لهم من ناصرين } أنهم لا يجدون ناصراً يدفع عنهم ذلك وإن حاوله لم يظفَر به .\n\n",
      "translations": [
        {
          "translation": "(As for those who disbelieve) in Allah and in His messengers Muhammad and Jesus (I shall chastise them with a heavy chastisement in the world) by exposing them to the sword and the capitation tax Qizyah) (and the Hereafter) by throwing them into the Fire; (and they will have no helpers) to save them from Allah's punishment in this world or in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فأمّا الذين كفروا فأعذبهم عذاباً شديداً } بالحرمان عن مقام القلب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ فصل سبحانه حكمه بقوله: { فَأَمَّا ٱلَّذِينَ كَفَرُواْ } ستروا سبيل الحق الظاهر عن مشكاة النبوة والرسالة\n عناداً واستكباراً\n وكذبوا الأنبياء\n وأنكروا ما جاءوا من الأحكام والمواعظ والحكم والعبر وأصروا عليها { فَأُعَذِّبُهُمْ عَذَاباً شَدِيداً } أطردهم وأبعدهم { فِي ٱلدُّنْيَا } بالمذلة والصغار والإجلاء وضرب الجزية { وَ } في { ٱلآخِرَةِ } بجهنم البعد والخذلان\n وسعير الطرج والحرمان { وَمَا لَهُمْ } بعد ظهور الدين الناسخ للأديان المارضية { مِّن نَّاصِرِينَ } [آل عمران: 56] من الأنبياء الذين يدعون الإيمان بهم\n ويدعونهم بدينهم وكتابهم\n ينصرونهم وينقذونهم من عذاب الله\n لتركهم العمل بالناسخ\n\n\n{ وَأَمَّا ٱلَّذِينَ آمَنُوا } بالدين الناسخ والكتاب الناسخ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:92",
      "similarity": 0.45762413992494577
    },
    {
      "verse": "56:88",
      "similarity": 0.45560725844460304
    },
    {
      "verse": "80:5",
      "similarity": 0.4360686688257778
    },
    {
      "verse": "30:16",
      "similarity": 0.435748218910412
    },
    {
      "verse": "93:10",
      "similarity": 0.4215880658782625
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003056.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003056.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:56.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}