{
  "chapter": "آل عمران",
  "text": "واما الذين ءامنوا۟ وعملوا۟ الصلحت فيوفيهم اجورهم والله لا يحب الظلمين",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions, We will pay them their wages in full. Allah does not love wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good deeds shall be given their recompense in full; but God does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do righteous deeds, He will reward them in full. Allah does not love the unjust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, to the righteously striving believers I shall give their reward in full measure.\" God does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And for those who believed and did good deeds, Allah will give them their full reward; and Allah does not like the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe and do righteous good deeds, Allah will pay them their reward in full. And Allah does not like the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to those who believe and do good deeds, He will pay them fully their rewards; and Allah does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for the believers, who do deeds of righteousness, He will pay them in full their wages: and God loves not the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe and do good works, He will pay them their wages in full. Allah loveth not wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have believed and do good works, they shall be given their reward in full. God does not love evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believed and worked righteous works, He shall repay them their hires in full, and Allah loveth not the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who have faith and do righteous deeds, He will pay them in full their rewards, and Allah does not like the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who believe and work righteousness, Allah will pay them (in full) their reward; but Allah loveth not those who do wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe (in the Oneness of Allah) and do righteous good deeds, Allah will pay them their reward in full. And Allah does not like the Zalimun (polytheists and wrong-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works, He will pay them their wages in full. Allah does not love the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe and do good works, He will give them their rewards in full. God does not love the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who believed and did righteous deeds, He will give them in full their rewards, and Allah does not like the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:57] But as for the believers, who do righteous deeds, He will pay them in full (yuwaffīhim, is also read nuwaffīhim, ‘We will pay them in full’) their wages. God loves not the evildoers, that is, He will chastise them. It is reported that God, exalted be He, sent him [Jesus] a cloud which raised him up, but his mother clutched to him in tears. He then said to her, ‘Verily, the Resurrection shall bring us together again’. This took place on the Night of Ordainment (laylat al-qadr) in the Holy House [of Jerusalem], when he was thirty three years old. His mother lived on after him for six years. The two Shaykhs [Bukhārī and Muslim] narrate a hadīth [in which it is stated] that he [Jesus] will descend when the Hour is nigh and will rule according to the Law of our Prophet [Muhammad], and that he will slay the false messiah and the swine, break the cross and impose the jizya. In a hadīth recorded by Muslim, he will remain for seven years; according to Abū Dāwūd al-Tayālisī, [he will remain for] forty years, and he will die and have prayers performed over him. It is possible that what is meant [by the forty years] is the total time he will have spent on earth, before he was raised and afterwards.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { والله لا يحب الظالمين } تذييل للتفصيل كله فهي تذييل ثاننٍ لجملة { فأعذبهم عذاباً شديداً } بصريح معناها ، أي أعذّبهم لأنهم ظالمون والله لا يحبّ الظالمين وتذييلٌ لجملة { وأما الذين آمنوا وعملوا الصالحات } إلى آخرها ، بكناية معناها؛ لأنّ انتفاء محبة الله الظالمين يستلزم أنه يحبّ الذين آمنوا وعملوا الصالحات فلذلك يعطيهم ثوابهم وافياً .ومعنى كونهم ظالمين أنهم ظلَموا أنفسهم بكفرهم وظلَمَ النصارى الله بأن نقصوه بإثبات ولد له وظلموا عيسى بأن نسبوه ابناً للَّه تعالى ، وظلمه اليهود بتكذيبهم إياه وأذاهم .وعذاب الدنيا هو زوال الملك وضرب الذلة والمسكنة والجزية ، والتشريد في الأقطار ، وكونهم يعيشون تبعاً للناس ، وعذاب الآخرة هو جهنم . ومعنى { وما لهم من ناصرين } أنهم لا يجدون ناصراً يدفع عنهم ذلك وإن حاوله لم يظفَر به .وأسند { فنوفيهم } إلى نون العظمة تنبيهاً على عظمة مفعول هذا الفاعل؛ إذ العظيم يعطى عظيماً . والتقدير { فيوفيهم أجورهم في الدنيا والآخرة } بدليل مقابله في ضدّهم من قوله : { فأعذبهم عذاباً شديداً في الدنيا والآخرة } وتوفية الأجور في الدنيا تظهر في أمور كثيرة : منها رضا اللَّهِ عنهم ، وبَركاته معهم ، والحياة الطيبة ، وحسن الذكر . وجملة { والله لا يحب الظالمين } تذييل ، وفيها اكتفاء : أي ويحبّ الذين آمنوا وعملوا الصالحات .وقرأ الجمهور : فنوفيهم بالنون وقرأه حفص عن عاصم ، ورويس عن يعقوب ، فيوفيهم بياء الغائب على الالتفات .\n\n",
      "translations": [
        {
          "translation": "(And as for those who believe) in Allah, the Scripture and His messengers Muhammad and Jesus (and do good works) sincerely between them and their Lord, (He will pay them their wages in full) He will pay them their reward on the Day of Judgement. (Allah loveth not wrong-doers) the idolaters, with their transgressions and association of partners with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والاحتجاب بهيئات أعمالهم { وأما الذين آمنوا } من الروحانيات { وعملوا الصالحات } من أنواع التزكية والتحلية والتصفية في إعانة القلب على النفس ومتابعته في التوجه إلى الحق { فيوفيهم أجورهم } من الأنوار القدسية والإشراقات الروحية عليهم { والله لا يحب } الذين ينقصون الأجور من الحقوق\n وأما التأويل بغير التطبيق\n فهو أنهم مكروا ببعث من يغتال عيسى عليه السلام\n فشبّه لهم صورة جسدانية هي مظهر عيسى روح الله عليه السلام بصورة حقيقة عيسى\n فظنوها عيسى فقتلوها وصلبوها\n والله رفع عيسى عليه السلام إلى السماء الرابعة لكون روحه عليه السلام فائضاً من روحانية الشمس\n ولم يعلموا لجهالتهم أنّ روح الله لا يمكن قتله\n ولما تيقن حاله قبل الرفع قال لأصحابه: \" إني ذاهب إلى أبي وأبيكم السماويّ \" \n أي: أتطهر من عالم الرجس\n وأتصل بروح القدس الواهب الصور\n المفيض للأرواح والكمالات\n المربي للناس بالنفث في الروح\n فأمدّكم من فيضه\n وكان إذ ذاك لا تقبل دعوته ولا يتبع مثله\n فأمر الحواريين بالتفرّق بعده في البلاد والدعوة إلى الحق\n فقالوا: كيف ذاك إذا لم تكن معنا؟ والآن أنت بين أظهرنا ولا تجاب دعوتنا؟ قال: \" علامة إمدادي إيّاكم قبول الخلق دعوتكم بعدي \"\n فلما رُفِعَ لم يدع أصحابه أحداً إلا أجابهم\n وظهر لهم القبول في الخلق\n وعلت كلمتهم\n وانتشر دينهم في أقطار الأرض\n ولما لم يصل إلى السماء السابعة التي عرّج بمحمد صلى الله عليه وسلم إليها\n المعبر عنها بـ \" سدرة المنتهى \" أعني: مقام النهاية في الكمال\n ولم ينل درجة المحبة\n لم يكن له بد من النزول مرة أخرى في صورة جسمانية\n يتبع الملّة المحمدية لنيل درجتها\n والله أعلم بحقائق الأمور",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n واتبعوا النبي الذي جاء به من عند ربه { وَعَمِلُواْ ٱلصَّالِحَاتِ } المأمورة فيه\n انقياداً وامتناناً { فَيُوَفِّيهِمْ } أي: في النشأة الأخرى { أُجُورَهُمْ } أي: يوفي عليهم أجور أعمالهم بأضعاف ما عملوا\n تفضلاً عليهم بمحبة الله إياهم بسبب امتثال أوامره وإطاعة رسله { وَٱللَّهُ } الهادي للعباد { لاَ يُحِبُّ ٱلظَّالِمِينَ } [آل عمران: 57] الخارجين عن حدوده المنزلة على رسله\n المكاشفين تحقيق توحيده\n وما يحصل لهم الظلم والخروج إلا بمتابعة عقولهم السخيفة بظلام الموهم المفضل عن الطريق المستبين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والله لا يحب الظالمين } لا يرضى فعلهم ولا يقربهم إليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:19",
      "similarity": 0.4389439738813906
    },
    {
      "verse": "42:40",
      "similarity": 0.407619349509603
    },
    {
      "verse": "30:45",
      "similarity": 0.3986252738441743
    },
    {
      "verse": "45:30",
      "similarity": 0.39610204179644243
    },
    {
      "verse": "18:88",
      "similarity": 0.38896310701716275
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003057.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003057.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:57.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}