{
  "chapter": "آل عمران",
  "text": "ان مثل عيسى عند الله كمثل ءادم خلقه من تراب ثم قال له كن فيكون",
  "translations": [
    {
      "translation": "For God the likeness of Jesus is as that of Adam whom He fashioned out of dust and said \"Be\" and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in the sight of Allah, the similitude of the creation of Jesus is as the creation of Adam whom He created out of dust, and then said: 'Be', and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God the case of Jesus is as that of Adam whom He created from the earth and then said, \"Exist,\" and Adam came into existence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of Eisa with Allah is like that of Adam; He created him (Adam) from clay and then said to him, “Be” – and it thereupon happens!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the likeness of `Isa before Allah is the likeness of Adam. He created him from dust, then said to him: \"Be!\" and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the likeness of Isa is with Allah as the likeness of Adam; He created him from dust, then said to him, Be, and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, the likeness of Jesus, in God's sight, is as Adam's likeness; He created him of dust, then said He unto him, 'Be,' and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the likeness of Jesus with Allah is as the likeness of Adam. He created him of dust, then He said unto him: Be! and he is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus in the sight of God is like Adam. He created him from dust; then said to him, \"Be!\" and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the likeness of 'lsa with Allah is as the likeness of Adam: him He created out of dust, thereafter He said unto him: Be, and lo! he becometh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the case of Jesus with Allah is like the case of Adam: He created him from dust, then said to him, ‘Be,’ and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The similitude of Jesus before Allah is as that of Adam; He created him from dust, then said to him: \"Be\". And he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the likeness of 'Iesa (Jesus) before Allah is the likeness of Adam. He created him from dust, then (He) said to him: \"Be!\" - and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, the likeness of (Prophet) Jesus with Allah, is as the likeness of Adam, He created him from dust then He said to him \"Be\" and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of Jesus in God’s sight is that of Adam: He created him from dust, then said to him, “Be,” and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the example of Jesus to Allah is like that of Adam. He created Him from dust; then He said to him, \"Be,\" and he was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:59] Truly, the likeness of Jesus, his remarkable case, in God’s sight, is as Adam’s likeness, as the case of Adam, whom God created without father or mother: this is a comparison of one remarkable thing with another more remarkable, so that it convinces the disputer and establishes itself in one’s mind more effectively. He created him, Adam, that is, his form, of dust, then said He to him, ‘Be,’, a human being, and he was; similarly, He said to Jesus, ‘Be’ — without a father — and he was.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained the creation of Jesus without a father because the delegation of Najran asked the Prophet to provide proof from the Qur'an for his saying that Jesus was not the son of Allah, so Allah said: (Lo! the likeness of Jesus) the likeness of the creation of Jesus (with Allah) without a father (is as the likeness of Adam. He created him of dust) without a father or mother, (then He said unto him) to Jesus: (Be! and he is) a son without a father.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ مَثَلَ عِيسَىٰ } أي: شأنه وقصته الغريبة الخارقة للعادة، وهي وجوده بلا أب { عِندَ ٱللَّهِ كَمَثَلِ } كشأن { ءَادَمَ } في إبداعه سبحانه وإيجاده، بل قصة آدم أغرب من قصته؛ إذ لا أب له ولا أم بل { خَلَقَهُ } قدَّه وصوَّره سبحانه { مِن تُرَابٍ } جماد { ثُمَّ قَالَ لَهُ كُن } بشراً حياً { فَيَكُونُ } [آل عمران: 59] بالفور حيواناً ذا حس وحركة إرادية وإدراك وفهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إن مثل عيسى عند الله } أي: إن شأنه الغريب في كونه وجد من غير أب { كمثل آدم }\n ثم فسر شأن آدم فقال: { خلقه من تراب } أي: خلق قالبه من تراب، { ثم } نفخ فيه الروح، و { قال له كن فيكون } أي: فكان، فشأنه أغرب من شأن عيسى، لأنه وجد من غير أب ولا أم، بخلاف عيسى عليه السلام، فلا يستغرب حاله ويتغالى فيه إلا من طبع الله على قلبه، فاستعجز القدرة الإلهية، { وكان الله على كل شيء مقتدراً }",
      "translations": []
    }
  ]
}