{
  "chapter": "آل عمران",
  "text": "الحق من ربك فلا تكن من الممترين",
  "translations": [
    {
      "translation": "This is the truth from your Lord, so do not be in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the truth from your Lord; be not, then, among those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad, the essence of) the Truth is from your Lord. Never have any doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O listener! (followers of this Prophet) This is the Truth from your Lord, so never be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) the truth from your Lord, so be not of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) the truth from your Lord, so be not of the disputers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is of God; be not of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) the truth from thy Lord (O Muhammad), so be not thou of those who waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the truth from your Lord, so do not be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the truth from thy Lord, wherefore be thou not of those who dubitate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the truth from your Lord, so do not be among the skeptics.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Truth (comes) from Allah alone; so be not of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) the truth from your Lord, so be not of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from your Lord, therefore, do not be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from your Lord, so do not be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from your Lord, so do not be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:60] The truth is from your Lord (al-haqqu min rabbik, the predicate of a missing subject, which is [implied to be] amr ‘Īsā [‘the matter concerning Jesus’]); be not of those who waver, those who are uncertain about it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((This is) the Truth) this is the true fact (from your Lord) that Jesus was not Allah, His son or His partner, (so be not thou of those who waver) those who doubt what I have exposited to you regarding the creation of Jesus without a father.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تَكُنْ مِّن ٱلْمُمْتَرِينَ } معناهُ مِنَ الشَّاكِّينَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهذا الكتاب المتلو عليك يا أكمل الرسل هو { ٱلْحَقُّ } المطابق للواقع، النازل إليك؛ لتأييدك ونصرك في دعواك الرسالة { مِن رَّبِّكَ فَلاَ تَكُنْ } في حقيته { مِّن ٱلْمُمْتَرِينَ } [آل عمران: 60] الشاكين بمقتضى عقولهم السخيفة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n هذا هو { الحق من ربك فلا تكن من الممترين } أي: الشاكين في مخلوقيته، وهذا خطاب للنبيّ صلى الله عليه وسلم، على طريق التهييج لغيره، أو لكل سامع\n وسبب نزول الآية: أنَّ وفد نجران قالوا للنبيّ صلى الله عليه وسلم: مالك تشتم صاحبنا، فتقول: إنه عبد؟ قال: أجل، هو عبد الله ورسوله، وكلمته ألقاها إلى مريم العذارء البتول، فغضبوا، وقالوا: هل رأيت إنساناً قط من غير أب؟ فإن كنت صادقاً فأرنا مثله\n فنزلت: { إن مثل عيسى عند الله كمثل آدم }\n أي: فهو أعجب من عيسى، لكونه بلا واسطة أصلاً\n رُوِيَ أن مريم حملت بعيسى وهي بنت ثلاث عشر سنة، وأوحى الله إليه على رأس ثلاثين سنة، ورفعه إليه من بيت المقدس ليلة القدر، وهو ابن ثلاث وثلاثين سنة، وعاشت أمه بعد رفعه ست سنين\n قال عليه الصلاة والسلام:\n\n \" أنا أولى الناس بعيسى ابن مريم لأنه لم يكن بيني وبينه نبيّ، فإنه نازل بأمتي وخليفتي فيهم، فإذا رأيتموه فاعرفوه، فإنه رجل مربوع إلى الحمرة والبياض، سبط الشعر، كأن شعره يقطر، وإن لم يصبه بلل، يدق الصليب، ويقتل الخنزير، ويفيض المال، وليسلكن الروحاء حاجّاً أو معتمراً، أو ليَثْنِينَّهما جميعاً، ويقاتل الناس على الإسلام، حتى يُهلك الله في زمانه الملل كلها، ويهلك الله في زمانه مسيح الضلالة، الكذاب الدجال، وتقع في الأرض الأمنة، حتى ترتع الأسد مع الإبل، والنمر مع البقر، والذئاب مع الغنم، ويلعب الغلمان بالحيات، ويلبث في الأرض أربعين سنة، ثم يتزوج ويولد له ثم يتوفى\n، ويصلي المسلمون عليه \" \n\nويدفنونه في حجرة النبي صلى الله عليه وسلم\n الإشارة: اعلم أن الحق - جلّ جلاله - أظهر هذا الآدمي في شكل غريب، وسر عجيب، جمع فيه بين الضدين، وأودع فيه سر الكونين، نوراني ظلماني، روحاني جسماني، سماوي أرضي، ملكوتي ملكي، معنوي حسيّ، أودع فيه الروح نورانية لاهوتية في نطفة ناسوتية، فوقع التنازع بين الضدين، فالروح تحن إلى وطنها اللاهوتي، والنطفة الطينية تحن إلى وطنها الناسوتي، فمن غلب روحانيته على طينته التحق بالروحانيين،وكان من المقربين في أعلى عليين، فصارت همته منصرفة إلى طاعة مولاه، والارتقاء إلى مشاهدة نوره وسناه، فانياً عن حظوظه وهواه، من غلبت طينته على روحانيته التحق بالبهائم أو الشياطين، وانحط إلى أسفل سافلين، وكانت همته منصرفة إلى حظوظة وهواه، غائباً عن ذكر مولاه، قد اتخذ إلهه هواه\n\n\nوتأمل قضية السيد عيسى عليه السلام لمَّا لم ينشأ من نطفة أمشاجية، كيف غلبت روحانيته، حيث لم تجد ما يجذبها إلى الحضيض الطيني، فلم يلتفت إلى هذا العالم الظلماني أصلاً، وكذلك الأنبياء حيث طهروا من بقاياها في الأصالة، والأولياء حيث طهروها بالمجاهدة، كيف صارت أرواحهم لا تشتاق إلا إلى الأذكار والعلوم والأسرار، فانية في محبة الواحد القهار، حتى لحقت بوطنها، ورجعت إلى أصلها، محل المشاهدة والمكالمة والمناجاة والمساررة، هذا هو الحق من ربك فلا تكن من الممترين في إدراك الروح المقام، إن لم يغلب عليها عالم الصلْصَال\n والله - تعالى - أعلم\n\n",
      "translations": []
    }
  ]
}