{
  "chapter": "آل عمران",
  "text": "فمن حاجك فيه منۢ بعد ما جاءك من العلم فقل تعالوا۟ ندع ابناءنا وابناءكم ونساءنا ونساءكم وانفسنا وانفسكم ثم نبتهل فنجعل لعنت الله على الكذبين",
  "translations": [
    {
      "translation": "If anyone argues with you about him after the knowledge that has come to you, say, 'Come then! Let us summon our sons and your sons, our women and your women, ourselves and yourselves. Then let us make earnest supplication and call down the curse of Allah upon the liars.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell those who dispute this with you even after the knowledge that has reached you: \"Come, let us gather our sons and your sons, our women and your women, ourselves and yourselves, and pray and solicit God to condemn those who lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell whoever disputes with you on this matter after true knowledge has come to you: 'Come! Let us summon our sons and your sons, and our women and your women, and ourselves and yourselves, and then let us pray together and invoke the curse of Allah on those who lie.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone disputes (your prophesy) after knowledge has come to you, say, \"Let each of us bring our children, women, our people, and ourselves to one place and pray to God to condemn the liars among us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore say to those who dispute with you (O dear Prophet Mohammed – peace and blessings be upon him) concerning Eisa after the knowledge has come to you, “Come! Let us summon our sons and your sons, and our women and your women, and ourselves and yourselves – then pray humbly, thereby casting the curse of Allah upon the liars!” (The Christians did not accept this challenge.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whoever disputes with you concerning him after the knowledge that has come to you, say: \"Come, let us call our sons and your sons, our women and your women, ourselves and yourselves, then we pray and we invoke Allah's curse upon the liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever disputes with you in this matter after what has come to you of knowledge, then say: Come let us call our sons and your sons and our women and your women and our near people and your near people, then let us be earnest in prayer, and pray for the curse of Allah on the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso disputes with thee concerning him, after the knowledge that has come to thee, say: 'Come now, let us call our sons and your sons, our wives and your wives, our selves and your selves, then let us humbly pray and so lay God's curse upon the ones who lie.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso disputeth with thee concerning him, after the knowledge which hath come unto thee, say (unto him): Come! We will summon our sons and your sons, and our women and your women, and ourselves and yourselves, then we will pray humbly (to our Lord) and (solemnly) invoke the curse of Allah upon those who lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone should argue with you about this [truth] after the knowledge you have received, say to them, \"Come! Let us gather our sons and your sons, our women and your women, and ourselves and yourselves; and then let us pray earnestly and invoke the curse of God upon the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore those who contend with thee therein after that which hath come unto thee of the knowledge - say thou: come! let us call our sons and your sons, and our women and your women, and ourselves and yourselves, then let us humbly pray, and invoke the curse of Allah upon the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should anyone argue with you concerning him, after the knowledge that has come to you, say, ‘Come! Let us call our sons and your sons, our women and your women, our souls and your souls, then let us pray earnestly, and call down Allah’s curse upon the liars.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one disputes in this matter with thee, now after (full) knowledge Hath come to thee, say: \"Come! let us gather together,- our sons and your sons, our women and your women, ourselves and yourselves: Then let us earnestly pray, and invoke the curse of Allah on those who lie!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whoever disputes with you concerning him ['Iesa (Jesus)] after (all this) knowledge that has come to you, [i.e. 'Iesa (Jesus)] being a slave of Allah, and having no share in Divinity) say: (O Muhammad SAW) \"Come, let us call our sons and your sons, our women and your women, ourselves and yourselves - then we pray and invoke (sincerely) the Curse of Allah upon those who lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute with you concerning him after the knowledge has come to you, say: 'Come, let us gather our sons and your sons, our womenfolk and your womenfolk, ourselves and yourselves. Then let us humbly pray, so lay the curse of Allah upon the ones who lie'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone disputes with you about him, after the knowledge that has come to you, say, “Come, let us call our children and your children, and our women and your women, and ourselves and yourselves, and let us invoke God’s curse on the liars.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whoever argues with you about it after [this] knowledge has come to you - say, \"Come, let us call our sons and your sons, our women and your women, ourselves and yourselves, then supplicate earnestly [together] and invoke the curse of Allah upon the liars [among us].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:61] And whoever, from among the Christians, disputes with you concerning him, after the knowledge, of his affair, that has come to you, say, to them: ‘Come! Let us call our sons and your sons, our wives and your wives, our selves and your selves, and gather them together, then let us humbly pray and invoke God’s curse upon those who lie’, by saying: ‘Lord, curse the one that tells lies concerning the affair of Jesus’. The Prophet (s) had called upon the Najrān delegation to do this when they disputed with him about Jesus. They said, ‘Let us think about it and we will come back to you’. The judicious one among them said, ‘You know that he is a prophet, and that every people that has ever challenged a prophet to a mutual imprecation has been destroyed’. They left him and departed. When they went to see the Prophet (s), who had set out with al-Hasan, al-Husayn, Fātima and ‘Alī, he said to them [the Najrān delegation], ‘When I supplicate, you say ‘Amen’; but they refrained from this mutual imprecation and made peace with the Prophet on the condition that they pay the jizya, as reported by Abū Nu‘aym. According to Ibn ‘Abbās [the Prophet] said, ‘Had they set out and performed the mutual cursing, they would have gone home and found neither possessions nor family’. It is also reported that had they set out with this intention, they would have been consumed by fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the dispute of the delegation of Najran with the Prophet (pbuh) after he explained to them that the likeness of Jesus with Allah is as the likeness of Adam, for they said to the Prophet: it is not as you say that Jesus was not Allah, his son or His partner. As response Allah said: (And whoso disputeth with thee concerning him) concerning Jesus, (after the knowledge which has come unto thee) after the exposition that has come to you that Jesus was not Allah, His son or His partner, (say (unto him): Come! We will summon our sons and your sons) and you summon your sons, (and our women and your women) and you summon your women, (and ourselves and yourselves, then we will pray humbly (to our Lord)) and exert our effort in praying ((and (solemnly) invoke) all together (the curse of Allah upon those who lie) about Allah concerning Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ نَبْتَهِلْ } معناهُ نَلْتَعِنُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then let us be,\" its meaning is that we will incline.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فمن حاجكَ فِيه } أي: في عيسى\n الآية\n إن لمباهلة الأنبياء تأثيراً عظيماً سببه اتصال نفوسهم بروح القدس وتأييد الله إياهم به\n وهو المؤثر بإذن الله في العالم العنصري فيكون انفعال العالم العنصري منه كانفعال بدننا من روحنا بالهيئات الواردة عليه كالغضب والحزن والفكر في أحوال المعشوق وغير ذلك من تحرّك الأعضاء عند حدوث الإرادات والعزائم وانفعال النفوس البشرية منه كانفعال حواسنا وسائر قوانا من هيئات أرواحنا\n فإذا اتصل نفس قدسيّ به أو ببعض أرواح أجرام السماوية والنفوس الملكوتية كان تأثيرها في العالم عند التوجه الاتصالي تأثير ما يتصل به فتنفعل أجرام العناصر والنفوس الناقصة الإنسانية منه بما أراد\n ألم تر كيف انفعلت نفوس النصارى من نفسه عليه السلام بالخوف وأحجمت عن المباهلة وطلبت الموادعة بقبول الجزية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَنْ حَآجَّكَ } جادلك وخاصمك { فِيهِ } أي: في أمر عيسى وشأنه من النصارى { مِن بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ } المستنبط من الكتاب المنزل من عندنا\n المبين لشأنه وإيجاده بلا أب { فَقُلْ } لهم حين خاصموك { تَعَالَوْاْ } هلموا أيها المجادلون المدَّعون ابنية عيسى لله\n المفرطون في أمره { نَدْعُ أَبْنَآءَنَا وَأَبْنَآءَكُمْ وَنِسَآءَنَا وَنِسَآءَكُمْ وَأَنْفُسَنَا وأَنْفُسَكُمْ } ونجتمع بعد ذلك في مجمع عظيم { ثُمَّ نَبْتَهِلْ } أي: نتباهل بأن يتضرع ويدعو كلٍّ منَّا ومنكم إلى الله { فَنَجْعَل لَّعْنَتَ ٱللَّهِ عَلَى ٱلْكَاذِبِينَ } [آل عمران: 61] حتى يظهر الصادق من الكاذب\n ويتميز الحق عن الباطل\n\n\n \" روي أنهم لما دعو إلى المباهلة\n قالوا: حتى ننظر ونتأهل\n فلما خلوا مع ذي رأيهم قالوا: ما ترى في هذا الأمر؟ قال: والله\n لقد عرفتم أنه هو النبي الموعود في كتابكم\n ولقد جاءكم بالفصل في أمر صاحبكم\n والله\n ما باهل قوم نبياً إلا هلكوا\n فإن أبيتم إلا إلف دينكم\n فوادعوا الرجل وانصرفوا\n \n \n فأتوا رسول الله صلى الله عليه وسلم وقد غدا محتضناً الحسين\n آخذاً بيد الحسن\n وفاطمة تمشي خلفه\n وعلى خلفها وهو يقول: \" إذا أنا دعوت فأمِّنوا \" \n فقال أسقفهم: يا معشر النصارى إني لأرى وجوهاً لو سألوا الله أن يزسل جبلاً من مكانه لازاله\n فلا تباهلوا فتهلكوا\n فأذعنوا للرسول صلى الله عليه وسلم\n وبذلوا الجزية ألفي حُلة حمراء وثلاثين درعاً من حديد\n فقال صلى الله عليه وسلم: \" والذي نفسي بيده لو باهلوا لمسخوا قردة وخنازير\n ولا ضطرم عليم الوادي ناراً\n ولاستأصل الله نجران\n وأهله حتى الطير على الشجر \"\n \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أصل }  { تعالوا }: تَعالَيُوا\n على وزن تفاعلوا\n من العلو\n فقلبت الياء ألفاً لتحركها\n ثم حذفت\n ومن قرأ بالضم نقل\n وأصل معناها: ارتفع\n ثم أطلق على الأمر بالمجيء\n والابتهال: التضرّع والمبالغة في الدعاء\n يقول الحقّ جلّ جلاله: { فمن } خاصمك يا محمد في شأن عيسى عليه السلام\n وكان الذي خاصم في ذلك السيد والعاقب\n لما قدموا مع نصارى نجران على النبيّ صلى الله عليه وسلم\n قال لهما النبيّ صلى الله عليه وسلم:\n \" أسلما \" \n قالا: قد أسلمنا قبلك\n قال: \" كذبتما\n يمنعكما من الإسلام دعاؤكما عيسى لله ولداً\n وعبادتكما الصليب\n وأكلكما الخنزير \" \n قالا: إن لم يكن عيسى ولداً لله فمن أبوه؟ فقال لهما النبيّ صلىالله عليه وسلم: ألستم تعلمون أنه لا يكون ولد إلا وهو يشبه أباه؟ قالوا: بلى\n قال: ألستم تعلمون أن ربنا حي لا يموت\n وأن عيسى يأتي عليه الفناء؟ قالوا: بلى\n قال: ألستم تعلمون أن ربنا قيِّم كل شيء\n ويحفظه\n ويرزقه؟ قالوا: بلى\n قال: فهل ملك عيسى شيئاً من ذلك؟ فقالوا: لا\n قال: ألستم تلعمون أن الله لا يخفى عليه شيء في الأرض ولا في السماء؟ قالوا: بلى\n قال: فهل يعلم عيسى من ذلك إلا ما عُلِّم؟ قالوا: لا\n قال: فإن ربنا صوَّر عيسى في الرحم كيف شاء\n وربنا لا يأكل ولا يشرب ولا يُحدث\n قالوا: بلى\n قال: ألستم تعلمون أن عيسى حملته أمه كما تحمل المرأة ثم وضعته كما تضع المرأة ولدها\n ثم غُذِّي كما يُغَذّى الصبي\n ثم كان يطعم ويشرب ويحدث؟ قالوا: بلى\n قال: كيف يكون هذا كما زعمتم؟ فسكتوا \" \n\n\n فأنزل فيهم السورة إلى هنا\n فقال الحقّ لنبيه - عليه الصلاة والسلام -: { فمن حاجّك فيه } أي: في عيسى من النصارى\n { من بعد ما جاءك من العلم } بعبوديته\n { فقل } لهم: { تعالوا } نَتَلاَعَنُ\n أي: نلعن الكاذبَ منا { ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم } أي: يدعون كل واحد منا نفسه وأعزّة أهله وألصفهم بقلبه إلى المباهلة\n وإنما قدَّمهم على النفس لأن الرجل يخاطر بنفسه دونهم\n فكان تقديمهم أبلغ في الابتهال\n { ثم نبتهل } \n أي نجهد في الدعاء على الكاذب\n { فنجعل لعنة الله على الكاذبين }\n فلما قرأ النبيّ صلى الله عليه وسلم هذه الآية على وفد نجران\n ودعاهم إلى المباهلة\n قالوا: حتى نرجع وننظر في أمرنا\n فقالوا للعاقب - وكان ذا رأيهم -: ما ترى؟ فقال: والله لقد عرفتم يا معشر النصارى أن محمداً نبيّ مرسل\n ولقد جاءكم بالفَصْل من أمر صاحبكم\n والله ما لاعن قومٌ قط نبيّاً فعاش كبيرُهم\n ولا نبت صغيرُهم\n ولئن فعلتم ذلك لتهلكن\n فوادِعُوا الرَّجُلَ: وانصرفوا\n فأتوه وهو محتضنٌ الحسن آخذ بيد الحسين\n وفاطمةُ تمشي خلفه\n وعَلِيّ خلفها\n وهو يقول لهم: \" إِذَا دَعَوْتُ فَأمِّنُوا \" \n فقال الأسقُف: يا معشر النصارى\n إني لأرى وجُوهاً لو سألوا الله أن يُزيل جبلاً من ماكنه لأزاله\n فلا تتباهلوا فتهلكوا جميعاً إلى يوم القيامة\n\nفقالوا: يا أبا القاسم\n نرى ألا نلاعنك\n فقال النبيّ صلى لله عليه وسلم:\n \" أسْلِمُوا يَكُنْ لكم ما للمسلمين وعليكم ما عليهم \" \n\n فأَبَوا\n فقال:\n \" إني أُنابذكم \" \n\n فقال: ما لنا بحرب العرب طاقة\n ولكنا نصالحك على ألا تغزونا ولا تَرُدَّنا عن ديننا\n على أن نؤدي إليك في كل عام ألفَيْ حلة\n ألفاً في صَفَر\n وألفاً في رجب\n وثلاثين درعاً من حديد\n فصالحهم النبيّ صلى الله عليه وسلم على ذلك\n فقال النبيّ:\n \" والذي نفسي بيده لو تلاعنوا لمُسِخُوا قِرَدَة\n وخَنَازِيرَ\n ولأضْرَمَ عَلَيْهِمْ الوَادِي نَاراً ولاستأصَل اللّهُ نَجْرَان وأهْلَهُ\n ولَمَا حَالَ الحَوْلُ على النَّصَارى كُلِّهِْم حَتى هَلكوا \"\n ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:165",
      "similarity": 0.07321217918556872
    },
    {
      "verse": "3:66",
      "similarity": 0.07057968971045553
    },
    {
      "verse": "42:15",
      "similarity": 0.07054657241476962
    },
    {
      "verse": "6:80",
      "similarity": 0.06843527673997558
    },
    {
      "verse": "3:97",
      "similarity": 0.0679515773032963
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/3:61.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/3:61.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:61.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}