{
  "chapter": "آل عمران",
  "text": "ان هذا لهو القصص الحق وما من اله الا الله وان الله لهو العزيز الحكيم",
  "translations": [
    {
      "translation": "This is the true account: there is no other god besides Allah. Allah - He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this verily is the true account. There is no god but God, and God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the true story. There is no God but Allah, and assuredly Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the true story (of Jesus). There is no Lord but God. It is God who is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This undoubtedly is the true narrative; there is none worthy of worship except Allah; and Allah is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this is the true narrative, and there is no god except Allah. And indeed, Allah is the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely this is the true explanation, and there is no god but Allah; and most surely Allah-- He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the true story. There is no god but God, and assuredly God is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! This verily is the true narrative. There is no Allah save Allah, and lo! Allah, He verily is, is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the true account. There is no deity save Him. God is Mighty and Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this! it is the true recital; and God there is none save Allah, and verily Allah! He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is indeed the true account, for sure. There is no god but Allah, and indeed Allah is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the true account: There is no god except Allah; and Allah-He is indeed the Exalted in Power, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! This is the true narrative [about the story of 'Iesa (Jesus)], and, La ilaha ill-Allah (none has the right to be worshipped but Allah, the One and the Only True God, Who has neither a wife nor a son). And indeed, Allah is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is indeed the truthful narration. There is no god except Allah. It is Allah who is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the narrative of truth: there is no god but God. God is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, this is the true narration. And there is no deity except Allah. And indeed, Allah is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:62] This, mentioned above, is the true story, the report free of any doubt. There is no god but God, and assuredly God is Mighty, in His Kingdom, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "60 (Lo! This) which We have mentioned, Muhammad, regarding Jesus and the delegation of Najran (verily is the true narrative) the true fact that Jesus was not Allah, His son or His partner. (There is no God save Allah) without a son or partner, (and lo! Allah is the Mighty) Who is vengeful against those who do not believe in Him, (the Wise) Who has commanded that none should be worshipped except Him; it is also said (the Wise) means: Allah ruled that they should go out and invoke His curse on those who lie, but the delegation of Najran refused to do so because they knew they were liars and that Muhammad was a true Prophet and emissary whose traits and description were to be found in their own Scripture.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ هَـٰذَا لَهُوَ ٱلْقَصَصُ ٱلْحَقُّ } معناهُ الخَبرُ اليَقِينُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {Indeed, this is the true story} [means] the certain news.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم يا أكمل الرسل نيابة عنا: { إِنَّ هَـٰذَا } المذكور من نبأ عيسى ومرميم عليهما السلام { لَهُوَ ٱلْقَصَصُ ٱلْحَقُّ } المطابق للواقع { وَ } لا تكفروا بابنية عيسى لله وزوجية مريم\n ولا تقولوا بالتثليث والأقانيم\n إذ { مَا مِنْ إِلَـٰهٍ } معبود بالحق في الوجود { إِلاَّ ٱللَّهُ } الواحد الأحد الصمد الذي\n[الإخلاص: 3] ولم يتخذ صاحبة ولا ولداً { وَإِنَّ ٱللَّهَ } الحق الحقيق بالحقية\n المتصف بالديمومية\n المتحد بالقيومية { لَهُوَ ٱلْعَزِيزُ } الغالب القادر\n القاهر للأغيار مطلقاً { ٱلْحَكِيمُ } [آل عمران: 62] في إظهارها على مقتضى إرادته واختياره\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال الله تعالى: { إن هذا } الذي أوحينا إليك { لهو القصص الحق وما من إله إلا الله } ، خلافاً لما يزعم النصارى من التثليث، { وإن الله لهو العزيز } في ملكه { الحكيم } في صنعه، فلا أحد يساويه في قدرته التامة، ولا في حكمته البالغة، { فإن تولوا } وأعرضوا عن الإيمان، { فإن الله عليم بالمفسدين } ، الذي يعبدون غير الله\n ووضع المظهر موضع الضمير، ليدل على أن التولي عن الحجج والإعراض عن التوحيد إفساد للدين، بل يؤدي إلى فساد العالم\n والله تعالى أعلم\n الإشارة: ينبغي للمريد، الذي تحقق بخصوصية شخيه، أن يلاعن من يخاصمه فيه، ويبعد عنه كل البعد، ولا يهي له لئلا يركبه، ويدفع عن شيخه ما استطاع، فإنَّ هذا من التعظيم الذي هو سببٌ في سعادة المريد، ولا يصغي إلى المفسدين الطاعنين في أنصار الدين\n قلت: وقد جاءني بعض من ينتسب إلى العلم من أهل فاس، فقال لي: قد اتفقت علماء فاس على بدعة شيخكم، فقلت له: لو اتفق أهل السماوات السبع والأرضين السبع، على أنه من أهل البدعة، لقلت أنا: إنه من أهل السنّة، لأني تحققت بخصوصيته، كالشمس في أفق السماء، ليس دونها سحاب\n فالله يرزقنا حسن الأدب معهم والتعظيم إلى يوم الدين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:7",
      "similarity": 0.6198370071017818
    },
    {
      "verse": "4:164",
      "similarity": 0.5854586851178927
    },
    {
      "verse": "6:57",
      "similarity": 0.5768958091245237
    },
    {
      "verse": "27:76",
      "similarity": 0.5168645104150666
    },
    {
      "verse": "12:3",
      "similarity": 0.5075318763179938
    }
  ]
}