{
  "chapter": "آل عمران",
  "text": "قل ياهل الكتب تعالوا۟ الى كلمة سواءۭ بيننا وبينكم الا نعبد الا الله ولا نشرك به شيـا ولا يتخذ بعضنا بعضا اربابا من دون الله فان تولوا۟ فقولوا۟ اشهدوا۟ بانا مسلمون",
  "translations": [
    {
      "translation": "Say, 'People of the Book! come to a proposition which is the same for us and you - that we should worship none but Allah and not associate any partners with Him and not take one another as lords besides Allah.' If they turn away, say, 'Bear witness that we are Muslims.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"O people of the Book, let us come to an agreement on that which is common between us, that we worship no one but God, and make none His compeer, and that none of us take any others for lord apart from God.\" If they turn away you tell them: \"Bear witness that we submit to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book! Come to a word common between us and you: that we shall serve none but Allah and shall associate none with Him in His divinity and that some of us will not take others as lords beside Allah.' And if they turn their backs (from accepting this call), tell them: 'Bear witness that we are the ones who have submitted ourselves exclusively to Allah.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to the People of the Book, \"We must come to a common term. Let us worship no one except God, nor consider anything equal to Him, nor regard any of us as our Lord besides God.\" However, if they turn away from (the Truth), tell them, \"Bear witness that we have submitted ourselves to the will of God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “O People given the Book(s)! Come towards a word which is common between us and you, that we shall worship no one except Allah, and that we shall not ascribe any partner to Him, and that none of us shall take one another as lords besides Allah”; then if they do not accept say, “Be witness that (only) we are Muslims.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O people of the Scripture: Come to a word that is just between us and you, that we worship none but Allah the same, and that we associate no partners with Him, and that none of us shall take others as lords besides Allah.\" Then, if they turn away, say: \"Bear witness that we are Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O followers of the Book! come to an equitable proposition between us and you that we shall not serve any but Allah and (that) we shall not associate aught with Him, and (that) some of us shall not take others for lords besides Allah; but if they turn back, then say: Bear witness that we are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book! Come now to a word common between us and you, that we serve none but God, and that we associate not aught with Him, and do not some of us take others as Lords, apart from God.' And if they turn their backs, say: 'Bear witness that we are Muslims.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O People of the Scripture! Come to an agreement between us and you: that we shall worship none but Allah, and that we shall ascribe no partner unto Him, and that none of us shall take others for lords beside Allah. And if they turn away, then say: Bear witness that we are they who have surrendered (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"People of the Book, let us come to a word common to us that we shall worship none but God and that we shall associate no partner with Him and that none of us shall take others, besides God, for lords.\" And if they turn away, say, \"Bear witness that we have submitted to God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O people of the Book! come to a word common between us and between you; that we shall worship none save Allah's and that we shall not associate aught with Him, and that none of you shall take others as Lords beside Allah. Then if they turn away, say: bear witness that verily we are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘O People of the Book! Come to a common word between us and you: that we will worship no one but Allah, that we will not ascribe any partner to Him, and that some of us will not take some others as lords besides Allah.’ But if they turn away, say, ‘Be witnesses that we have submitted [to Allah].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O People of the Book! come to common terms as between us and you: That we worship none but Allah; that we associate no partners with him; that we erect not, from among ourselves, Lords and patrons other than Allah.\" If then they turn back, say ye: \"Bear witness that we (at least) are Muslims (bowing to Allah's Will).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"O people of the Scripture (Jews and Christians): Come to a word that is just between us and you, that we worship none but Allah, and that we associate no partners with Him, and that none of us shall take others as lords besides Allah. Then, if they turn away, say: \"Bear witness that we are Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book, let us come to a common word between us and you that we will worship none except Allah, that we will associate none with Him, and that none of us take others for lords besides Allah' If they turn away, say: 'Bear witness that we are Muslims'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O People of the Book, come to terms common between us and you: that we worship none but God, and that we associate nothing with Him, and that none of us takes others as lords besides God.” And if they turn away, say, “Bear witness that we have submitted.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O People of the Scripture, come to a word that is equitable between us and you - that we will not worship except Allah and not associate anything with Him and not take one another as lords instead of Allah.\" But if they turn away, then say, \"Bear witness that we are Muslims [submitting to Him].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:64] Say: ‘O People of the Scripture!, Jews and Christians, come now to a word agreed upon (sawā’, is the verbal noun, meaning mustawin amruhā, ‘[a word] regarding which the matter is upright’) between us and you, and it is, that we worship none but God (allā is [made up of] an-lā, ‘that…not’) and that we do not associate anything with Him, and do not take each other for lords, beside God’, as you have taken rabbis and monks; and if they turn their backs, in rejection of God’s Oneness, say, you to them: ‘Bear witness that we have submitted’, [that we are of] those who affirm the Oneness of God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nرجُوع إلى المجادلة ، بعد انقطاعها بالدعاء إلى المباهلة ، بعَثَ عليه الحرصُ على إيمانهم ، وإشارة إلى شيءٍ من زيغ أهل الكتابين عن حقيقة إسلاممِ الوجه لله كما تقدم بيانه . وقد جيء في هذه المجادلة بحجة لا يجدون عنها موئلاً وهو دعوتهم إلى تخصيص الله بالعبادة ونبذ عقيدة إشراك غيره في الإلهية . فجملة { قل يا أهل الكتاب } بمنزلة التأكيد لجملة { فقل تعالوا ندع أبناءنا } \\[ آل عمران : 61 \\] لأنّ مدلول الأولى احتجاج عليهم بضعف ثقتهم بأحقّية اعتقادهم . ومدلول هذه احتجاج عليهم بصحة عقيدة الإسلام ، ولذلك لم تعطف هذه الجملة . والمراد بأهل الكتاب هنا النصارى : لأنهم هم الذين اتخذوا المخلوق ربّاً وعبدوه مع الله .وتعالوا هنا مستعملة في طلب الاجتماع على كلمة سواء وهو تمثيل : جعلت الكلمة المجتمع عليها بشبه المكان المراد الاجتماع عنده . وتقدم الكلام على ( تعالوا ) قريباً .والكلمة هنا أطلقت على الكلام الوجيز كما في قوله تعالى : { كلا إنها كلمة هو قائلها } \\[ المؤمنون : 100 \\] .وسواء هنا اسم مصدر الاستواء ، قيل بمعنى العدل ، وقيل بمعنى قصدٍ لا شطط فيها ، وهذان يكونان من قولهم : مكان سَواء وسِوَى وسَوى بمعنى متوسّط قال تعالى : { فرءاه في سواء الجحيم } \\[ الصافات : 55 \\] . وقال ابن عطية : بمعنى ما يستوي فيه جميع الناس ، فإنّ اتخاذ بعضهم بعضاً أرباباً ، لا يكون على استواء حال وهو قول حسن . وعلى كل معنى فالسواء غير مؤنث ، وصف به { كلمة } ، وهو لفظ مؤنث ، لأنّ الوصف بالمصدر واسم المصدر لا مطابقة فيه .و { ألا نعبد } بدل من { كلمة } ، وقال جماعة : هو بدل من سَواء ، وردّه ابن هشام ، في النوع الثاني من الجهة السادسة من جهات قواعد الإعراب من مغني اللبيب ، واعترضه الدمامييني وغيره .والحق أنه مردود من جهة مراعاة الاصطلاح لا من جهة المعنى؛ لأنّ سَواء وصف لِكلمة وألاّ نعبد لو جعل بدلاً من سواء ءال إلى كونه في قوة الوصف لكلمة ولا يحسن وصف كلمة به .وضمير بيننا عائد على معلوم من المقام : وهو النبي صلى الله عليه وسلم والمسلمون ، ولذلك جاء بعده : { فقولوا اشهدوا بأنا مسلمون } .ويستفاد من قوله : { ألا نعبد إلا الله } إلى آخره ، التعريضُ بالذين عبدوا المسيح كُلِّهم .وقوله : { فإن تولوا } جيء في هذا الشرط بحرف إنْ لأنّ التولِّي بعد نهوض هذه الحجة وما قبلها من الأدلة غريب الوقوع ، فالمقام مشتمل على ما هو صالح لاقتلاع حصول هذا الشرط ، فصار فعل الشرط من شأنه أن يكون نادر الوقوع مفروضاً ، وذلك من مواقع ( إن ) الشرطية فإن كان ذلك منهم فقد صاروا بحيث يُؤيَس من إسلامهم فأعرِضوا عنهم ، وأمسكوا أنتم بإسلامكم ، وأشهدوهم أنكم على إسلامكم . ومعنى هذا الإشهاد التسْجيل عليهم لئلاّ يُظهروا إعراض المسلمين عن الاسترسال في محاجتهم في صورة العجز والتسليم بأحقية ما عليه أهل الكتاب فهذا معنى الإشهاد عليهم بأنا مسلمون .\n\n",
      "translations": [
        {
          "translation": "After this, Allah invited them to accept Allah's divine Oneness, saying: (Say: People of the Scripture. Come to an agreement) the agreement is: there is no god except Allah (between us and you: that we shall worship none but Allah) we shall declare Allah as the only One God, (and that we shall ascribe no partners unto Him) from among created beings, (and that none of us shall take others for lords beside Allah) that none of us shall obey another person in that which involves a transgression against Allah. (And if they turn away) and refuse to accept Allah's divine Oneness, (then say: Bear witness) know (that we are they who have surrendered (unto Him)) and acknowledge His divine Oneness and worship Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلَىٰ كَلِمَةٍ سَوَآءٍ } معناهُ عَدْلٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {to a word [that is] equal} [means] justice.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ سواء بينَنا وبينَكم } أي: لم يختلف في كلمة التوحيد نبي ولا كتاب قط { وما كان لبشر أن يُؤْتيه الله } الآية\n الاستنباء لا يكون إلا بعد مرتبة الولاية والفناء في التوحيد\n ما ينبغي لبشر محا الله بشريته بإفنائه عن نفسه وأثابه وجوداً نورانياً حقّانياً قابلاً للكتاب والحكمة الإلهية\n ثم يدعو الخلق إلى نفسه\n إذ الداعي إلى نفسه يكون محجوباً بالنفس كفرعون وأضرابه من الذين علموا التوحيد وما وجدوه حالاً وذوقاً\n ولم يصلوا إلى العيان ونفوسهم باقية ما ذاقت طعم الفناء\n فاحتجبوا بها\n فدعوا الخلق إلى نفوسهم وهم ممن قال فيهم رسول الله صلى الله عليه وسلم: \" شرّ الناس من قامت القيامة عليه وهو حيّ \"\n { ولكن } يقول { كونوا ربانيين } منسوبين إلى الربّ لاستيلاء الربوبية عليهم وطمس البشرية بسبب كونهم عالمين عاملين معلمين تالين لكتب الله\n أي: كونوا عابدين مرتاضين بالعلم والعمل والمواظبة على الطاعات حتى تصيروا ربانيين بغلبة النور على الظلمة { ولا يأمركم } بتعبد معين والتقيد بصورة\n فإنه حجاب وكفر ولا يأمر النبيّ صلى الله عليه وسلم بالاحتجاب بعد إسلامكم الوجود لله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل إمحاضاً للنصح كلاماً صادراً عن لسان الحكمة والتوحيد خالياً عن وصمة الغفلة والتقليد: { يٰأَهْلَ ٱلْكِتَابِ } الذين يدعون الإيمان بتوحيد الله وكتبه ورسله { تَعَالَوْاْ } هلموا نتفق ونرجع { إِلَىٰ كَلِمَةٍ } حق صحيحة { سَوَآءٍ } حقيتها وصحتها { بَيْنَنَا وَبَيْنَكُمْ } مسلمة ثبوتها عندنا وعندكم بلا خلاف منا ومنكم\n وهي { أَلاَّ نَعْبُدَ إِلاَّ ٱللَّهَ } المعبود بحق\n المستحق للعبادة بالأصالة { وَلاَ نُشْرِكَ بِهِ } في عبادته { شَيْئاً } من مصنوعاته { وَ } أيضاً { لاَ يَتَّخِذَ بَعْضُنَا بَعْضاً أَرْبَاباً } واجب الإطاعة والانقياد { مِّن دُونِ ٱللَّهِ } المتوحد بالألوهية\n المنفرد بالمعبودية\n وإن قبلوا ما قلت لهم عليه وانقادوا وأطاعوا فقد آمنوا { فَإِن تَوَلَّوْاْ } أعرضوا عن الكلمة الحقة المسلمة المتفقة عليها { فَقُولُواْ } إلزاماً وتبكيتاً { ٱشْهَدُواْ } أيها المنكرون الكافرون { بِأَنَّا } لا أنتم { مُسْلِمُونَ } [آل عمران: 64] موحدون\n مؤمنون منقادون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { سواء }: مصدر، نعت للكلمة، والمصادر لا تثني ولا تجمع ولا تؤنث، فإذا فتحت السين مددت، وإذا ضمت أو كسرت قصرت، كقوله: { مكاناً سوى } أي: مستوٍ. وسواء كل شيء: وسطه، قال تعالى:\n[الصَّافات: 55]، أي: وسطه. يقول الحقّ جلّ جلاله: { قل } يا محمد: { يا أهل الكتاب } اليهود والنصارى، { تعالوا }: هلموا { إلى كلمة سواء } أي: عدل مستوية، { بيننا وبينكم } لا يختلف فيها الرسل والكتب والأمم، هي { ألا نعبد إلا الله } أي: نوحده بالعبادة، ونقر له بالوحدانية، { ولا نشكر به شيئاً } أي: لا نجعل غيره شريكاً له في استحقاق العبادة، { ولا يتخذ بعضنا بعضاً أرباباً من دون الله } أي: لا نقول عزير ابن الله، ولا المسيح ابن الله، ولا نطيع الأحبار فيما أحدثوا من التحريم والتحليل، لأنهم بشر مثلنا. ولمّا نزل قوله تعالى:\n[التّوبَة: 31] قال عدي بن حاتم: ما كُنَّا نعبدهم يا رسول الله، قال:\n \" أَلّيْس كانُوا يُحِلُّون لَكُمْ ويُحرِّمون، فتأخُذُون بقَوْلِهم؟ \" \nقال: بلى، قال:\n \" هُوَ ذَاكَ \" \n{ فإن تولوا } وأعرضوا عن التوحيد { فقولوا اشهدوا بأنا مسلمون } ، فقد لزمتكم الحجة، فاعترفوا بأنا مسلمون دونكم، وأنتم كافرون بما نطقت به الكتبُ وتواطأت عليه الرسل. تنبيه: انظر ما في هذه الآية من المبالغة وحسن التدرج في الاحتجاج، بيِّن أولاً أحوال عيسى وما تطاور عليه من الأطوار المنافية للألوهية، ثم ذكر ما يحل عقدتهم ويزيح شبهتهم، فلما رأى عنادهم ولجاجهم دعاهم إلى المباهلة بنوع من الإعجاز، ثم لمّا أعرضوا عنها وانقادوا بعض الانقياد، عاد عليهم بالإرشاد، وسلك طريقاً أسهل وألزم، بأن دعاهم إلى ما وافق عليه عيسى وسائر الأنبياء والكتب، ثم لمّا لم يُجد ذلك فيهم شيئاً، وعلم أن الآيات والنذر لا تغني عنهم شيئاً أعرض عنهم، وقال: { قولوا اشهدوا بأنا مسلمون }. قاله البيضاوي. الإشارة: الطرق كثيرة والمقصد واحد، وهو التوحيد الخاص، أعني مقام الفناء والبقاء. فالداعُون إلى الله كلهم متفقون على الدعوة إلى هذا المقصد، فكل طريق لا توصل إلى هذا المقصد لا عبرة بها، وكل داع لا يُبلغ إلى هذا الجمال فهو دجال، فإنْ رضي بتعظيم الناس، ولم يَبْنِ طريقه على الأساس، فليس لصاحبه إلا الإفلاس، وكل مَن أطاع المخلوق في معصية الله فقد اتخذه ربّاً من دون الله، وكل مَن تولى عن طريق الإرشاد فقد استوجب لنفسه من الطرد والبعاد، فيقول له الواصلون أو السائرون: { فإن تولوا فقولوا اشهدوا بأنا مسلمون }. وبالله التوفيق، وهو الهادي إلى سواء الطريق. ولما قدم وفدُ نجران المدينة، التقوا مع اليهود، فاختصموا في إبراهيم عليه السلام فأتاهم النبيّ صلى الله عليه وسلم، فقالوا: يا محمد إنا اختلفنا في إبراهيم ودنيه، فقالت النصارى: كان نصرانيّاً، وقالت اليهود: كان يهوديّاً، وهم أولى الناس به، فقال النبيّ صلى الله عليه وسلم:\n \" كلا الفريقين بريء من إبراهيم، بل كان إبراهيم حنيفاً مسلماً، وأنا على دينه، فاتبعوا دينه الإسلام \". ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:92",
      "similarity": 0.3476478031301453
    },
    {
      "verse": "27:31",
      "similarity": 0.324894312650564
    },
    {
      "verse": "3:70",
      "similarity": 0.31612962279110146
    },
    {
      "verse": "3:98",
      "similarity": 0.31574553832957336
    },
    {
      "verse": "28:68",
      "similarity": 0.2948565768066443
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003064.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003064.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}