{
  "chapter": "آل عمران",
  "text": "ياهل الكتب لم تحاجون فى ابرهيم وما انزلت التورىة والانجيل الا منۢ بعده افلا تعقلون",
  "translations": [
    {
      "translation": "'People of the Book! why do you argue concerning Ibrahim when the Torah and Injil were only sent down after him? Why do you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Book, why dispute about Abraham? The Torah and the Gospel were sent down after him: Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book! Why do you dispute with us about Abraham even though the Torah and the Gospel were not revealed until after the time of Abraham? Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the People of the Book, \"Why do you argue about Abraham? The Torah and Gospel were revealed only after him. Why do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People given the Book(s)! Why do you argue about Ibrahim, whereas the Taurat (Torah) and the Injeel (Bible) were not sent down until after him? So do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Scripture! Why do you dispute about Ibrahim, while the Tawrah and the Injil were not revealed till after him Have you then no sense\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O followers of the Book! why do you dispute about Ibrahim, when the Taurat and the Injeel were not revealed till after him; do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book! Why do you dispute concerning Abraham? The Torah was not sent down, neither the Gospel, but after him. What, have you no reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture! Why will ye argue about Abraham, when the Torah and the Gospel were not revealed till after him? Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, why do you dispute about Abraham when the Torah and Gospel were only sent down after him. Do you not use your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Book! wherefore contend ye concerning Ibrahim, whereas the Taurat and the Injil were not sent down save after him! Will ye not then under stand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book! Why do you argue concerning Abraham? Neither the Torah nor the Evangel were sent down until [long] after him. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye People of the Book! Why dispute ye about Abraham, when the Law and the Gospel Were not revealed Till after him? Have ye no understanding?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Scripture (Jews and Christians)! Why do you dispute about Ibrahim (Abraham), while the Taurat (Torah) and the Injeel (Gospel) were not revealed till after him? Have you then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, why do you dispute about Abraham when both the Torah and the Gospel were not sent down till after him? Have you no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book! Why do you argue about Abraham, when the Torah and the Gospel were not revealed until after him? Will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture, why do you argue about Abraham while the Torah and the Gospel were not revealed until after him? Then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:65] When the Jews claimed that Abraham was Jewish and that they were following his religion, and the Christians made a similar claim, the following was revealed: O People of the Scripture! Why do you argue about, dispute over, Abraham?, claiming that he belonged to one of your [two] religions, when the Torah was not revealed, neither the Gospel, but, a very long time, after him, and it was only after these two were revealed that Jewry and Christianity came into being. What, do you not comprehend?, the falsehood of what   you say?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي للانتقال من دعائهم لكلمة الحق الجامعة لحق الدين ، إلى الإنكار عليهم محاجتهم الباطلة للمسلمين في دين إبراهيم ، وزعم كلّ فريق منهم أنهم على دينه توصّلاً إلى أنّ الذي خالف دينهم لا يكون على دين إبراهيم كما يدّعي النبي محمد صلى الله عليه وسلم فالمحاجة فرع عن المخالفة في الدعوى . وهذه المحاجة على طريق قياس المساواة في النفي ، أو في محاجتهم النبي في دعواه أنه على دين إبراهيم ، محاجة يقصدون منها إبطال مساواة دينِه لدين إبراهيم ، بطريقة قياس المساواة في النفي أيضاً .فيجوز أن تكون هذه الجملة من مقول القول المأمور به الرسولُ في قوله تعالى : { قل يا أهل الكتاب تعالوا } أي قل لهم : يا أهل الكتاب لِمَ تحاجون . ويجوز أن يكون الاستئناف من كلام الله تعالى عَقِبَ أمرِه الرسولَ بأن يقول { تعالَوا } فيكون توجيه خطاب إلى أهل الكتاب مباشرة ، ويكون جعل الجملة الأولى من مقول الرسول دون هذه لأنّ الأولى من شُؤون الدعوة ، وهذه من طرق المجاحّة ، وإبطال قولهم ، وذلك في الدرجة الثانِيَة مِن الدعوة . والكلُ في النسبة إلى الله سواء .ومناسبة الانتقال من الكلام السابق إلى هذا الكلام نشأت من قوله : { فإن تولوا فقولوا أشهدوا بأنا مسلمون } \\[ آل عمران : 64 \\] لأنه قد شاع فيما نزل من القرآن في مكة ، وبعدَها أنّ الإسلام الذي جاء به محمد صلى الله عليه وسلم يرجع إلى الحنيفية دين إبراهيم كما تقدم تقريره في سورة البقرة وكما في سورة النحل ( ) : { ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفاً وسيجيء أنّ إبراهيم كان حنيفاً مسلماً ، وقد اشتهر هذا وأعلن بين المشركين في مكة ، وبني اليهود في المدينة ، وبين النصارى في وَفد نجران ، وقد علم أنّ المشركين بمكة كانوا يدّعون أنهم ورثة شريعة إبراهيم وسدنة بيته ، وكان أهل الكتاب قد ادّعوا أنهم على دين إبراهيم ، ولم يتبين لي أكان ذلك منهم ادّعاء قديماً أم كانوا قد تفطنوا إليه من دعوة محمد ، فاستيقظوا لتقليده في ذلك ، أم كانوا قالوا ذلك على وجه الإفحام للرسول حين حاجهم بأنّ دينه هو الحق ، وأنّ الدين عند الله الإسلام فألْجَؤوه إلى أحد أمرين : إما أن تكون الزيادةُ على دين إبراهيم غيرَ مخرجة عن اتِّباعه ، فهو مشترَك الإلزام في دين اليهودية والنصرانية ، وإما أن تكون مخرجة عن دين إبراهيم فلا يكون الإسلام تابعاً لدين إبراهيم .وأحسب أنّ ادّعاءهم أنهم على ملة إبراهيم إنما انتحلوه لبثّ كل من الفريقين الدعوةَ إلى دينه بين العرب ، ولا سيما النصرانية ، فإنّ دعاتها كانوا يحاولون انتشارها بين العرب فلا يجدون شيئاً يروج عندهم سِوى أن يقولوا : إنها ملة إبراهيم ، ومن أجل ذلك اتُّبعت في بعض قبائل العرب ، وهنالك أخبار في أسباب النزول تثير هذه الاحتمالات : فروى أنّ وفد نجران قالوا للنبيء حين دعاهم إلى اتباع دينه : على أي دين أنتَ قال : على ملة إبراهيم قالوا : فقد زدتَ فيه ما لم يكن فيه فعلى هذه الرواية يكون المخاطبُ بأهل الكتاب هنا خصوصَ النصارى كالخطاب الذي قبْله وروى : أنه تنازعت اليهود ونصارى نجران بالمدينة ، عند النبي ، فأدّعي كل فريق أنه على دين إبراهيم دون الاخر ، فيكون الخطاب لأهل الكتاب كلهم ، من يهود ونصارى .ولعل اختلاف المخاطبين هو الداعي لتكرير الخطاب .وقوله : وما أنزلت التوراة والإنجيل إلا من بعده } يكون على حسب الرواية الأولى مَنْعاً لقولهم : فقد زدت فيه ما ليس مِنْه ، المقصودِ منه إبطال أن يكون الإسلام هو دين إبراهيم . وتفصيلُ هذا المنع : إنكم لا قبل لكم بمعرفة دين إبراهيم ، فمن أين لكم أنّ الإسلام زاد فيما جاء به على دين إبراهيم ، فإنكم لا مستند لكم في علمكم بأمور الدين إلاّ التوراةُ والإنجيلُ ، وهما قد نَزلا من بعد إبراهيم ، فمن أين يعلم ما كانت شريعة إبراهيم حتى يعلمَ المزيد عليهَا ، وذكر التوراة على هذا لأنها أصل الإنجيل . ويكون على حسب الرواية الثانية نفياً لدعوى كلّ فريق منهما أنه على دين إبراهيم ، بِأنّ دين اليهود هو التوراة ، ودينَ النصارى هو الإنجيل ، وكلاهما نزل بعد إبراهيم ، فكيف يكون شريعةً له . قال الفخر : يعني ولم يُصرّح في أحد هذين الكتابين بأنه مطابقٌ لشريعة إبراهيم ، فذكر التوراة والإنجيل على هذا نشرٌ بعد اللف : لأنّ أهل الكتاب شَمِل الفريقين ، فذكر التوراة لإبطال قول اليهود ، وذكرَ الإنجيل لإبطاللِ قول النصارى ، وذكر التوراة والإنجيل هنا لقصد جمع الفريقين في التخطئة ، وإن كان المقصود بادىء ذي بدء هم النصارى الذين مَساقُ الكلام معهم .والأظهر عندي في تأليف المحاجة ينتظم من مجموع قوله : { وما أنزلت التوراة والإنجيل إلا من بعده } وقولِه : { فلم تحاجون فيما ليس لكم به علم } وقولِه : { والله يعلم وأنتم لا تعلمون } فيبطل بذلك دعواهم أنهم على دين إبراهيم ، ودعواهم أنّ الإسلام ليس على دين إبراهيم ، ويَثْبُتُ عليهم أنّ الإسلام على دين إبراهيم ، وذلك أنّ قوله : { وما أنزلت التوراة والإنجيل إلا من بعده } يدل على أنّ علمهم في الدين منحصر فيهما ، وهما نزلا بعد إبراهيم فلا جائز أن يكونا عين صحف إبراهيم .وقولُه : { فلم تحاجون فيما ليس لكم به علم } يُبطل قولهم : إنّ الإسلام زاد على دين إبراهيم ، ولا يدل على أنهم على دين إبراهيم؛ لأنّ التوراة والإنجيل لم يَرد فيهما التصريح بذلك ، وهذا هو الفارق بين انتساب الإسلام إلى إبراهيم وانتساب اليهودية والنصرانية إليه ، فلا يقولون وكيف يُدّعَى أنّ الإسلام دين إبراهيم مع أنّ القرآن أنزل من بعد إبراهيم كما أنزلت التوراة والإنجيل من بعده .وقوله : { والله يعلم } يدل على أنّ الله أنبأ في القرآن بأنه أرسل محمداً بالإسلام ديننِ إبراهيم وهو أعلم منكم بذلك ، ولم يسبق أن امتنّ عليكم بمثل ذلك في التوراة والإنجيل فأنتم لا تعلمون ذلك ، فلما جاء الإسلام وأنبأ بذلك أردتم أن تنتحلوا هذه المزية ، واستيقظتم لذلك حَسداً على هذه النعمة ، فنهضتْ الحجة عليهم ، ولم يبق لهم معذرة في أن يقولوا : إنّ مجيء التوراة والإنجيل من بعد إبراهيم مشترَكُ الإلزام لنا ولكم؛ فإنّ القرآن أنزل بعد إبراهيم ، ولولا انتظام الدليل على الوجه الذي ذكرنا لَكَانَ مشترك الإلزام .والاستفهام في قوله : { فلم تحاجون } مقصود منه التنبيه على الغلط .وقد أعرض في هذا الاحتجاح عليهم عن إبطال المنافاة بين الزيادة الواقعة في الدين الذي جاء به محمد صلى الله عليه وسلم على الدين الذي جاء به إبراهيم ، وبين وصف الإسلام بأنّه ملّة إبراهيم : لأنّهم لم يكن لهم من صحة النظر ما يفرقون به بين زيادة الفروع ، واتحاد الأصول ، وأنّ مساواة الدينين منظور فيها إلى اتحاد أصولهما سنبينها عند تفسير قوله تعالى : { فإنْ حاجّوك فقل أسلمتُ وجهي للَّه } \\[ آل عمران : 20 \\] وعندَ قوله : { ما كان إبراهيم يهودياً ولا نصرانياً } فاكتُفي في المحاجّة بإبطال مستندهم في قولهم : «فقد زدت فيه ما ليس فيه على طريقة المنع ، ثم بقوله : { ما كان إبراهيم يهودياً ولا نصرانياً ولكن كان حنيفاً مسلماً } \\[ آل عمران : 67 \\] على طريقة الدعوى بناءً على أنّ انقطاع المعترِض كاففٍ في اتجاه دعوى المستدل .\n\n",
      "translations": [
        {
          "translation": "Then Allah mentions their dispute with the Prophet (pbuh) in that they said they are of those who have surrendered to Allah and follow the Religion of Abraham, claiming this to be in the Torah. So Allah said: (0 People of the Scripture! Why will ye argue about Abraham, when the Torah and the Gospel were not revealed till after him?) after Abraham. (Have ye then no sense?) that it is not mentioned in them that Abraham was Jew or Christian.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قل لهم إلزاماً: { يٰأَهْلَ ٱلْكِتَابِ لِمَ تُحَآجُّونَ } وتجادلون { فِيۤ } شأن { إِبْرَاهِيمَ } بأنه يهودي أو نصراني { وَ } الحال أنه { مَآ أُنزِلَتِ ٱلتَّورَاةُ } المبيّن لليهودية { وَٱلإنْجِيلُ } المبيِّن للنصرانية { إِلاَّ مِن بَعْدِهِ } بمدة متطاولة { أَفَلاَ تَعْقِلُونَ } [آل عمران: 65] أنتم أيها الكافرون المكابرون في هذه الدعوى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ها أنتم }: أصله: أنتم\n دخلت عليه هاء التنبيه\n وقال الأخفش: أصله: أأنتم\n فقلبت الهمزة الأولى هاء\n كقوله: هرقت\n وتوجيه القراءات معلوم في محله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:48",
      "similarity": 0.7352707402718801
    },
    {
      "verse": "3:3",
      "similarity": 0.7206883535103625
    },
    {
      "verse": "5:47",
      "similarity": 0.5203725974390537
    },
    {
      "verse": "5:68",
      "similarity": 0.5193911942348948
    },
    {
      "verse": "5:66",
      "similarity": 0.4489646943184534
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}