{
  "chapter": "آل عمران",
  "text": "ياهل الكتب لم تحاجون فى ابرهيم وما انزلت التورىة والانجيل الا منۢ بعده افلا تعقلون",
  "translations": [
    {
      "translation": "'People of the Book! why do you argue concerning Ibrahim when the Torah and Injil were only sent down after him? Why do you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Book, why dispute about Abraham? The Torah and the Gospel were sent down after him: Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book! Why do you dispute with us about Abraham even though the Torah and the Gospel were not revealed until after the time of Abraham? Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the People of the Book, \"Why do you argue about Abraham? The Torah and Gospel were revealed only after him. Why do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People given the Book(s)! Why do you argue about Ibrahim, whereas the Taurat (Torah) and the Injeel (Bible) were not sent down until after him? So do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Scripture! Why do you dispute about Ibrahim, while the Tawrah and the Injil were not revealed till after him Have you then no sense\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O followers of the Book! why do you dispute about Ibrahim, when the Taurat and the Injeel were not revealed till after him; do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book! Why do you dispute concerning Abraham? The Torah was not sent down, neither the Gospel, but after him. What, have you no reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture! Why will ye argue about Abraham, when the Torah and the Gospel were not revealed till after him? Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, why do you dispute about Abraham when the Torah and Gospel were only sent down after him. Do you not use your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Book! wherefore contend ye concerning Ibrahim, whereas the Taurat and the Injil were not sent down save after him! Will ye not then under stand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book! Why do you argue concerning Abraham? Neither the Torah nor the Evangel were sent down until [long] after him. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye People of the Book! Why dispute ye about Abraham, when the Law and the Gospel Were not revealed Till after him? Have ye no understanding?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Scripture (Jews and Christians)! Why do you dispute about Ibrahim (Abraham), while the Taurat (Torah) and the Injeel (Gospel) were not revealed till after him? Have you then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, why do you dispute about Abraham when both the Torah and the Gospel were not sent down till after him? Have you no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book! Why do you argue about Abraham, when the Torah and the Gospel were not revealed until after him? Will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture, why do you argue about Abraham while the Torah and the Gospel were not revealed until after him? Then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:65] When the Jews claimed that Abraham was Jewish and that they were following his religion, and the Christians made a similar claim, the following was revealed: O People of the Scripture! Why do you argue about, dispute over, Abraham?, claiming that he belonged to one of your [two] religions, when the Torah was not revealed, neither the Gospel, but, a very long time, after him, and it was only after these two were revealed that Jewry and Christianity came into being. What, do you not comprehend?, the falsehood of what   you say?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentions their dispute with the Prophet (pbuh) in that they said they are of those who have surrendered to Allah and follow the Religion of Abraham, claiming this to be in the Torah. So Allah said: (0 People of the Scripture! Why will ye argue about Abraham, when the Torah and the Gospel were not revealed till after him?) after Abraham. (Have ye then no sense?) that it is not mentioned in them that Abraham was Jew or Christian.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ها أنتم }: أصله: أنتم\n دخلت عليه هاء التنبيه\n وقال الأخفش: أصله: أأنتم\n فقلبت الهمزة الأولى هاء\n كقوله: هرقت\n وتوجيه القراءات معلوم في محله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:48",
      "similarity": 0.7352707402718801
    },
    {
      "verse": "3:3",
      "similarity": 0.7206883535103625
    },
    {
      "verse": "5:47",
      "similarity": 0.5203725974390537
    },
    {
      "verse": "5:68",
      "similarity": 0.5193911942348948
    },
    {
      "verse": "5:66",
      "similarity": 0.4489646943184534
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}