{
  "chapter": "آل عمران",
  "text": "هانتم هؤلاء حججتم فيما لكم به علم فلم تحاجون فيما ليس لكم به علم والله يعلم وانتم لا تعلمون",
  "translations": [
    {
      "translation": "You are people arguing about something of which you have no knowledge. Why do you argue about something of which you have no knowledge? Allah knows; you do not know.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember you are those who disputed the things you knew; so wherefore dispute about things you do not know? And God has the knowledge, while you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, you are those who have disputed greatly concerning matters which you knew; why are you now disputing about matters that you know nothing about? Allah knows it whereas you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You even argue about what is already known to you. What can you learn from arguing about that which you have no knowledge? God knows but you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Listen! This was what you argued about – of which you have some knowledge – why do you then argue about the matter you do not have any knowledge of? And Allah knows whereas you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you are those who have disputed about that of which you have knowledge. Why do you then dispute concerning that of which you have no knowledge It is Allah Who knows, and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! you are they who disputed about that of which you had knowledge; why then do you dispute about that of which you have no knowledge? And Allah knows while you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ha, you are the ones who dispute on what you know; why then dispute you touching a matter of which you know not anything? God knows, and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! ye are those who argue about that whereof ye have some knowledge: Why then argue ye concerning that whereof ye have no knowledge? Allah knoweth. Ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are those who disputed about things of which you had some knowledge. Must you now argue about things of which you have no knowledge? God knows, but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah! ye are those who fell to contending respecting that whereof ye had some knowledge, wherefore then should ye contend respecting that whereof ye have no knowledge! And Allah knoweth, and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah! You are the very ones who argue about that of which you have knowledge. But why do you argue about that of which you have no knowledge? And Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah! Ye are those who fell to disputing (Even) in matters of which ye had some knowledge! but why dispute ye in matters of which ye have no knowledge? It is Allah Who knows, and ye who know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you are those who have disputed about that of which you have knowledge. Why do you then dispute concerning that which you have no knowledge? It is Allah Who knows, and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, you have disputed about that which you have knowledge. Why then dispute about that of which you have no knowledge? Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here you are—you argue about things you know, but why do you argue about things you do not know? God knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here you are - those who have argued about that of which you have [some] knowledge, but why do you argue about that of which you have no knowledge? And Allah knows, while you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:66] Lo! (hā, ‘lo’, is for calling attention to something), You (antum, ‘you’, is the subject) are those (the predicate is [what follows]) who dispute about what you know, concerning the affair of Moses and Jesus, and your claim to be adhering to their religions: why do you then dispute concerning that of which you have no knowledge?, of Abraham’s circumstances; and God knows, his circumstances, and you know not.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Ye) Jews and Christians (are those who argue about that whereof ye have some knowledge) in your Scripture that Muhammad is a prophet sent by Allah and that Abraham was neither Jew nor Christian, but you rejected this: (Why then argue ye concerning that whereof ye have no knowledge) from your Scripture and say that Abraham was Jew or Christian? (Allah knoweth) that Abraham was neither Jew nor Christian. (Ye know not) that he was Jew or Christian.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هٰأَنْتُمْ } أيها الحمقى العميان في أمور الدين { هَؤُلاۤءِ } الضالون المصرون على الكفر والعناد { حَاجَجْتُمْ } جادلتم { فِيمَا لَكُم بِهِ عِلمٌ } مذكور مثبت في كتابكم من بعثه سيدنا محمد صلى الله عليه وسلم وأوصافه فتغيرونه وتحرفونه عناداً بعدما ظهر عندكم حقيته { فَلِمَ تُحَآجُّونَ فِيمَا لَيْسَ لَكُمْ بِهِ عِلْمٌ } مثبت مذكور في كتابكم من يهودية إبراهيم ونصرانيته، فتفترون وتنسبون إلى كتباكم ما لم يذكر فيه؛ مكابرة وعناداً { وَٱللَّهُ } المطلع لضمائركم { يَعْلَمُ } ما حرفتم وما افتريتم ويعاقب على مقضتى علمه { وَأَنْتُمْ لاَ تَعْلَمُونَ } [آل عمران: 66] ولا تعتقدون بعلمه على ما فرطتم فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وتوجيه القراءات معلوم في محله، و { أنتم }: مبتدأ، و { هؤلاء }: خبره، و { حاججتم }: جملة مبينة للأولى، أو { حاججتم }: خبر، و { هؤلاء }: منادى بحذف النداء، و { حنيفاً }: حال، أي: مائلاً عن الأديان إلا دين الإسلام\n يقول الحقّ جلّ جلاله: { يا أهل الكتاب لم تُحاجون في إبراهيم } ، ويدعي كل فريق أنه كان على دينه، { وما أنزلت التوراة والإنجيل إلا من بعده } ، فكيف يكون يهوديّاً، ودينكم إنما حدث بعد إبراهيم بألف سنة؟! وكيف يكون نصرانيّاً، ودين النصارنية إنما ظهر بعد إبراهيم بألفي سنة؟! { أفلا تعقلون } فتدعون المحال، { هاأنتم } يا { هؤلاء } الحمقى { حاججتم فيما لكم به علم } من أمر محمد - عليه الصلاة والسلام - ونبوته، مما وجدتموه في التوراة والإنجيل، فأنكرتموه عناداً وحسداً، فَلِمَ تجادلون فيما لا علم لكم به، ولا ذكر في كتابكم من شأن إبراهيم؟ { والله يعلم } ما خصمتم فيه، { وأنتم لا تعلمون } ، بل أنتم جاهلون",
      "translations": []
    }
  ]
}