{
  "chapter": "آل عمران",
  "text": "ما كان ابرهيم يهوديا ولا نصرانيا ولكن كان حنيفا مسلما وما كان من المشركين",
  "translations": [
    {
      "translation": "Ibrahim was neither a Jew nor a Christian, but a man of pure natural belief - a Muslim. He was not one of the idolaters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither was Abraham a Jew nor a Christian, but upright and obedient, and not an idolater.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was neither a Jew nor a Christian; he was a Muslim, wholly devoted to God. And he certainly was not amongst those who associate others with Allah in His divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was not a Jew or a Christian. He was an upright person who had submitted himself to the will of God. Abraham was not a pagan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim was neither a Jew nor a Christian; but he was a Muslim, free from all falsehood; and was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim was neither a Jew nor a Christian, but he was a true Muslim Hanifa and he was not of the Mushrikin\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim was not a Jew nor a Christian but he was (an) upright (man), a Muslim, and he was not one of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No; Abraham in truth was not a Jew, neither a Christian; but he was a Muslim and one pure of faith; certainly he was never of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was not a Jew, nor yet a Christian; but he was an upright man who had surrendered (to Allah), and he was not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was neither a Jew nor a Christian. He was an upright man, one who had surrendered himself to God. He was not one of those who associate partners with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim was not a Jew, nor a Nazarene, but he was an upright Muslim, nor was he of the associators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was neither a Jew nor a Christian. Rather, he was a Hanif, a Muslim, and he was not one of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was not a Jew nor yet a Christian; but he was true in Faith, and bowed his will to Allah's (Which is Islam), and he joined not gods with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ibrahim (Abraham) was neither a Jew nor a Christian, but he was a true Muslim Hanifa (Islamic Monotheism - to worship none but Allah Alone) and he was not of Al-Mushrikun (See V. 2:105).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, Abraham was neither a Jew nor a Nazarene. He was of pure faith, a submitter (Muslim). He was never of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was neither a Jew nor a Christian, but he was a Monotheist, a Muslim. And he was not of the Polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was neither a Jew nor a Christian, but he was one inclining toward truth, a Muslim [submitting to Allah]. And he was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:67] God, in order to dissociate Abraham [from their claims], said: No; Abraham in truth was not a Jew, neither a Christian, but he was a Muslim, professing the Oneness of God, and a hanīf, who inclined away from all other religions towards the upright one; and he was never of the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then denied their claim, saying: (Abraham was not a Jew) following the religion of the Jews, (nor yet a Christian) following the religion of the Christians; (but he was an upright man who had surrendered (to Allah)) sincerely, (and he was not of the idolaters) who adhered to their religions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { مَا كَانَ إِبْرَاهِيمُ يَهُودِيّاً } لأن موسى إنما جاء بعده بألف سنة { وَلاَ نَصْرَانِيّاً } لأن عيسى عليه السلام إنما جاء بعده بألفي سنة { وَلَكِن كَانَ حَنِيفاً } مائلاً عن إفراط اليهود والنصارى في عزير وعيسى وتفريطهم في إنكار سيدنا محمد صلى الله عليه وسلم { مُّسْلِماً } منقاداً معتدلاً، مستوياً على صراط التوحيد { وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ } [آل عمران: 67] الضالين عن طريق الحق بنسبة الحوادث إلى الأسباب والوسائل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم صرّح بتكذيب الفريقين فقال: { ما كان إبراهيم يهوديّاً ولا نصرانيّاً ولكن كان حنيفاً } مائلاً عن العقائد الزائفة، { مسلماً } منقاداً لأحكام ربه\n وليس المراد أنه كان على ملة الإسلام، وإلا لكان مشترك الإلزام، لأن دين الإسلام مؤخر أيضاً، فكان إبراهيم إمام الموحدين، { وما كان من المشركين } كما عليه اليهود والنصارى والمشركون\n ففيه تعريض بهم، ورد لادعائهم أنهم على ملته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:135",
      "similarity": 0.7570206284570404
    },
    {
      "verse": "10:105",
      "similarity": 0.6322131872523067
    },
    {
      "verse": "3:95",
      "similarity": 0.6149704625136064
    },
    {
      "verse": "16:123",
      "similarity": 0.5952476801053428
    },
    {
      "verse": "16:120",
      "similarity": 0.5805971373935573
    }
  ]
}