{
  "chapter": "آل عمران",
  "text": "ان اولى الناس بابرهيم للذين اتبعوه وهذا النبى والذين ءامنوا۟ والله ولى المؤمنين",
  "translations": [
    {
      "translation": "The people with the strongest claim to Ibrahim are those who followed him and this Prophet and those who have iman. Allah is the Protector of the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of all men the nearest to Abraham are those who follow him, and then this Prophet and the faithful; and God is the protector of all believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the people who have the best claim to a relationship with Abraham are those who followed him in the past, and presently this Prophet and those who believe in him; Allah is the guardian of the men of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The nearest people to Abraham, among mankind, are those who followed him, this Prophet (Muhammad) and the true believers. God is the Guardian of the true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly among all mankind who have the best claim to Ibrahim are those who followed him, and this Prophet (Mohammed – peace and blessings be upon him) and the believers; and Allah is the Guardian of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, among mankind who have the best claim to Ibrahim are those who followed him, and this Prophet and those who have believed. And Allah is the Wali (Protector and Helper) of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely the nearest of people to Ibrahim are those who followed him and this Prophet and those who believe and Allah is the guardian of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the people standing closest to Abraham are those who followed him, and this Prophet, and those who believe; and God is the Protector of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those of mankind who have the best claim to Abraham are those who followed him, and this Prophet and those who believe (with him); and Allah is the Protecting Guardian of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, the people who are closest to Abraham are those who followed him and this Prophet [Muhammad], and those who believe in him. God is the guardian of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the nearest of mankind to Ibrahim, surely those who followed him, and this prophet, and those who believe; and Allah is the Patron of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the nearest of all people to Abraham are those who follow him and this prophet and those who have faith, and Allah is the guardian of the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without doubt, among men, the nearest of kin to Abraham, are those who follow him, as are also this Prophet and those who believe: And Allah is the Protector of those who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, among mankind who have the best claim to Ibrahim (Abraham) are those who followed him, and this Prophet (Muhammad SAW) and those who have believed (Muslims). And Allah is the Wali (Protector and Helper) of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, the people who are nearest to Abraham are those who followed him, and this Prophet (Muhammad), and those who believe. Allah is the Guardian of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people most deserving of Abraham are those who followed him, and this prophet, and those who believe. God is the Guardian of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the most worthy of Abraham among the people are those who followed him [in submission to Allah] and this prophet, and those who believe [in his message]. And Allah is the ally of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:68] Surely the people with the best claim, most worthy of, Abraham are those who followed him, during his time, and this Prophet, Muhammad (s) on account of his according with him as regards most [of the rulings] of his Law, and those who believe, from among his community, they are the ones that ought to say, ‘We follow his religion’, and not you; and God is the Protector of the believers, their Helper and Preserver.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ناشيء عن نفي اليهودية والنصرانية عن إبراهيم ، فليس اليهود ولا النصارى ولا المشركون بأولى الناس به ، وهذا يدل على أنهم كانوا يقولون : نحن أولى بدينكم .و ( أولى ) اسم تفضيل أي أشد ولْياً أي قرباً مشتق من وَلِي إذا صار وَليّاً ، وعدّي بالباء لتضمّنه معنى الاتصال أي أخصّ الناس بإبراهيم وأقربهم منه . ومن المفسّرين من جعل أولى هنا بمعنى أجدر فيضطرّ إلى تقدير مضاف قبل قوله : { بإبراهيم } أي بدين إبراهيم .والذين اتبعوا إبراهيم هم الذين اتبعوه في حياته : مثل لوط وإسماعيل وإسحاقَ ، ولا اعتداد بمحاولة الذين حاولوا اتباع الحنيفية ولم يهتدوا إليها ، مثل زيد بن عَمْرو بن نُفَيْل ، وأميةَ ابن أبي الصّلْت ، وأبيه أبي الصَّلت ، وأبي قيْس صِرمَة بن أبي أنس من بني النجّار ، وقال النبي صلى الله عليه وسلم \" كاد أمية بن أبي الصّلْت ، أن يُسلم \" وهو لم يدرك الإسلام فالمعنى كاد أن يكون حنيفاً ، وفي «صحيح البخاري» : أنّ زيد بن عَمرو بن نُفيل خرج إلى الشام يسأل عن الدين فلقي عالماً من اليهود ، فسأله عن دينه فقال له : إنّي أريد أن أكونَ على دينك ، فقال اليهوديّ : إنّك لا تكون على ديننا حتى تأخذ نصيبك من غضب الله ، قال زيد : أفِرُّ إلاّ من غضب الله ، ولا أحمل من غضب الله شيئاً أبداً وأنا أستطيع ، فهل تدلني على دين ليس فيه هذا؟ قال : لا أعلمه إلاّ أن تكون حنيفاً ، قال : وما الحنيف؟ قال : دين إبراهيم لم يكن يهودياً ولا نصرانياً وكان لا يعبد إلاّ الله ، فخرج من عنده فلقي عالماً من النصارى فقاوله مثل مقاولة اليهودي ، غير أنّ النصراني قال : أن تأخذ بنصيبك من لَعنة الله ، فخرج من عنده وقد اتفقا له على دين إبراهيم ، فلم يزل رافعاً يديه إلى السماء وقال : اللهم أشهَدْ أنّي على دين إبراهيم وهذا أمنية منه لا تصادف الواقع . وفي «صحيح البخاري» ، عن أسماء بنت أبي بكر : قالت : رأيت زيدَ بن عَمرو بن نُفيل قبل الإسلام مسنِداً ظهره إلى الكعبة وهو يقول : «يا معشر قريش ليس منكم على دين إبراهيم غيري» وفيه أنّ النبي صلى الله عليه وسلم لقي زيدَ بن عمرو بن نُفيل بأسفل بَلْدَح قبل أن يَنزل على النبي صلى الله عليه وسلم الوحي فقُدِّمَتْ إلى النبي صلى الله عليه وسلم سُفرة فأبى زيدُ بن عمرو أنْ يأكل منها وقال : إنّي لست آكل ممّا تذبحون على أنصابكم ولا آكل إلاّ ما ذكر اسم الله عليه وهذا توهّم منه أن النبي صلى الله عليه وسلم يفعل كما تفعل قريش . وإنّ زيداً كان يعيب على قريش ذبائحهم ويقول : الشاة خلقها الله وأنزل لها من السماء الماء أنبت لها من الأرض ثم تذبحونها على غير اسم الله .واسم الإشارة في قوله : { وهذا النبي } مستعمل مجازاً في المشتهر بوصف بين المخاطبين كقوله في الحديث : \" فجعل الفَرَاشُ وهذه الدّوَابُّ تقع في النار \" فالإشارة استعملت في استحضار الدوابّ المعروفة بالتساقط على النار عند وقودها ، والنبي ليس بمشاهد للمخاطبين بالآية ، حينئذ ، ولا قُصدت الإشارة إلى ذاته . ويجوز أن تكون الإشارة مستعملة في حضور التكلم باعتبار كون النبي هو الناطق بهذا الكلام ، فهو كقول الشاعر : «نجوتتِ وهَذا تحملين طَليق» أي والمتكلّم الذي تحملينه . والاسم الواقع بعد اسم الإشارة ، بدلاً منه ، هو الذي يعين جهة الإشارة مَا هي . وعطف النبي على الذين اتبعوا إبراهيم للاهتمام به وفيه إيماء إلى أنّ متابعته إبراهيم عليه السلام ليست متابعة عامة فكون الإسلام من الحنيفية أنّه موافق لها في أصولها . والمراد بالذين آمنوا المسلمون . فالمقصود معناه اللقَبي ، فإنّ وصف الذين آمنوا صار لقباً لأمة محمد صلى الله عليه وسلم ولذلك كثر خطابهم في القرآن بيأيها الذين آمنوا .ووجه كون هذا النبي صلى الله عليه وسلم والذين آمنوا أولى الناس بإبراهيم ، مثل الذين اتبعوه ، إنّهم قد تخلقوا بأصول شرعه ، وعرفوا قدره ، وكانوا له لسان صدق دائباً بذكره ، فهؤلاء أحقّ به ممّن انتسبوا إليه لكنهم نقضوا أصول شرعه وهم المشركون ، ومن الذين انتسبوا إليه وأنسوا ذكر شرعه ، وهم اليهود والنصارى ، ومن هذا المعنى قول النبي صلى الله عليه وسلم لما سَأل عن صوم اليهود ، يوم عاشوراء فقالوا : هو يوم نجّى الله فيه موسى فقال : «نَحْن أحقّ بموسى منهم» وصامه وأمر المسلمين بصومه .وقوله : { والله ولي المؤمنين } تذييل أي هؤلاء هم أولى الناس بإبراهيم ، والله ولي إبراهيم ، والذين اتبعوه ، وهذا النبي ، والذين آمنوا؛ لأنّ التذييل يشمل المذيَّل قطعاً ، ثم يشمل غيره تكميلاً كالعام على سبب خاص . وفي قوله : { والله ولي المؤمنين } بعد قوله : { كان إبراهيم يهودياً } \\[ آل عمران : 67 \\] تعريض بأنّ الذين لم يكن إبراهيم منهم ليسوا بمؤمنين .\n\n",
      "translations": [
        {
          "translation": "Then Allah showed who follows the Religion of Abraham, saying: (Lo! those of mankind who have the best claim to Abraham) to the Religion of Abraham (are those who followed him) in his time, (and this Prophet) Muhammad follows his Religion (and those who believe) in Muhammad and in the Qur'an also follow the Religion of Abraham; (and Allah is the Protecting Friend of the believers) He protects them and helps them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ أَوْلَى ٱلنَّاسِ بِإِبْرَاهِيمَ } وأقربهم ديناً\n وأولاهم محبة ومودة { لَلَّذِينَ ٱتَّبَعُوهُ } من أمته\n وتدينوا بدينه\n وامتثلوا بما جاء به من عند ربه { وَهَـٰذَا ٱلنَّبِيُّ } المبعوث من شيعته\n المنتسب إلى ملته\n المنشعب من أهل بيته وزمرته { وَٱلَّذِينَ آمَنُواْ } بهذا النبي\n وبما جاء به من الكتاب الناسخ للكتب السافلة\n المبين لطريق التوحيد الذاتي { وَٱللَّهُ } الهادي لعباده إلى جادة توحيده { وَلِيُّ ٱلْمُؤْمِنِينَ } [آل عمران: 68] الموحدين الذين يريدون وجه الله في جميع حالاتهم\n يولي أمور دينهم بحيث لا يشغلهمه عن التوجيه إليه مزخفات الدنيا الشاغلة عن المولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { إن أولى الناس بإبراهيم } أي: أخصهم به وأقربهم منه\n { للذين اتبعوه } من أمته في زمانه\n { وهذا النبيّ } محمد صلى الله عليه وسلم\n { والذين آمنوا } لموافقتهم له في أكثر الأحكام\n قال صلى الله عليه وسلم:\n \" لكُلِّ نَبيَ وُلاة مِنَ النَّبيِّينَ\n وإنَّ وَلِيِّي منهم أبِي وَخَلِيل ربِّي \" \nيعني إبراهيم عليه السلام\n { والله ولي المؤمنين } أي: ناصرهم على سائر الأديان\n ومجازيهم بغاية الإحسان\n الإشارة: ترى كثيراً من المتفقرة يخصون الكمال بطريقهم\n ويخاصمون في طريق غيرهم\n وهي نزعة أهل الكتاب\n حائدة عن الرشد والصواب\n فأولى بالحق من اتبع السنة المحمدية\n وتخلق بالأخلاق المرضية\n وزهد في الدارين\n ورفع همته عن الكونين\n ورفع حجاب الغفلة عن قلبه\n حتى أشرقت عليه أنوار ربه\n واتصل بأهل التربية النبوية\n فزجوا به في بحار الأحدية\n ثم ردوه إلى مقام الصحو والتكميل\n فيا له من مقام جليل\n فهذه ملة إبراهيم الخليل\n وبها جاء الرسول الجليل حبيب الرحمن\n وقطب دائرة الزمان\n سيد المرسلين\n وإمام العارفين\n ورسول رب العالمين\n صلى الله عليه وسلم دائماً إلى يوم الدين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:41",
      "similarity": 0.5581813376351036
    },
    {
      "verse": "26:69",
      "similarity": 0.5363841622411508
    },
    {
      "verse": "21:62",
      "similarity": 0.5020770772630707
    },
    {
      "verse": "37:109",
      "similarity": 0.45782405644750784
    },
    {
      "verse": "8:64",
      "similarity": 0.4549991313517292
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003068.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003068.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:68.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}