{
  "chapter": "آل عمران",
  "text": "ولا تؤمنوا۟ الا لمن تبع دينكم قل ان الهدى هدى الله ان يؤتى احد مثل ما اوتيتم او يحاجوكم عند ربكم قل ان الفضل بيد الله يؤتيه من يشاء والله وسع عليم",
  "translations": [
    {
      "translation": "Do not trust anyone except for those who follow your deen.' Say, 'Allah's guidance is true guidance. But you think it is impossible for anyone to be given the same as you were given, or to argue with you before your Lord.' Say, 'All favour is in Allah's Hand and He gives it to whoever He wills. Allah is All-Encompassing, All- Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not believe those who do not belong to your faith.\" Say: \"True guidance is the guidance of God -- that any may be given the like of what has been given you.\" Will they argue with you before your Lord? Say: \"God's is the bounty. He gives whomsoever He please, for He is infinite and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say among themselves: 'Do not follow anyone except him who follows your faith.' Say: 'Surely true guidance is Allah's. It is His favour that anyone should be given the like of what you have been given in the past, and that others should have been given firm evidence to proffer against you before your Lord.' Say: 'Surely bounty is in the Hand of Allah; He gives it to whom He wills. Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say, \"Do not believe anyone except those who follow your religion, so that no one may have what you have received or may argue with you before your Lord.\" (Muhammad), tell them, \"The only guidance is the guidance of God. All favors are in the hands of God. He grants His favors to whomever He wants. He is Munificent and All-knowing\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And do not believe in anyone except him who follows your religion”; say (O dear Prophet Mohammed – peace and blessings be upon him), “Only Allah’s guidance is the true guidance” – (so why not believe in it) if someone has been given similar to what was given to you, or if someone may be able to evidence it against you before your Lord; say (O dear Prophet Mohammed – peace and blessings be upon him), “Undoubtedly the munificence lies only in Allah’s Hand (control); He may bestow upon whomever He wills; and Allah is Most Capable, All Knowing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe no one except the one who follows your religion.\" Say (O Prophet): \"Verily, right guidance is the guidance of Allah.\" (And they say:) \"Do not believe that anyone can receive like that which you have received, otherwise they would engage you in argument before your Lord.\" Say: \"All the bounty is in the Hand of Allah; He grants to whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not believe but in him who follows your religion. Say: Surely the (true) guidance is the guidance of Allah-- that one may be given (by Him) the like of what you were given; or they would contend with you by an argument before your Lord. Say: Surely grace is in the hand of Allah, He gives it to whom He pleases; and Allah is Ample-giving, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and believe not any but him who follows your religion.' Say: 'The true guidance is God's guidance -- that anyone should be given the like of what you have been given, or dispute with you before your Lord.' Say: 'Surely bounty is in the hand of God; He gives it unto whomsoever He will; and God is All-embracing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe not save in one who followeth your religion - Say (O Muhammad): Lo! the guidance is Allah's Guidance - that anyone is given the like of that which was given unto you or that they may argue with you in the presence of their Lord. Say (O Muhammad): Lo! the bounty is in Allah's hand. He bestoweth it on whom He will. Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe only in those who follow your own religion.\" Say to them, \"Surely, the true guidance is the guidance from God.\" [But you think it is impossible that] someone else may be granted [revelation] such as you were granted -- or else that they should contend against you before your Lord. Say, \"All grace is in the hands of God; He grants it to whom He wills: for God is boundless, and all knowing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe not save one who followeth your religion. Say thou: verily the guidance of Allah - that is the guidance. Envy ye that any one should be vouchsafed the like of that which was vouchsafed unto you or fear ye that those others may overcome you in Contention before your Lord! Say thou: verily the grace is in the hand of Allah He vouchsafeth it unto whomsoever He will; and Allah is Bounteous, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [they say,] ‘Do not believe anyone except him who follows your religion.’ Say, ‘Indeed [true] guidance is the guidance of Allah.’ [They also say.] ‘[Do not believe] that anyone may be given the like of what you were given, or that he may argue with you before your Lord.’ Say, ‘Indeed all grace is in Allah’s hand; He grants it to whomever He wishes, and Allah is all-bounteous, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe no one unless he follows your religion.\" Say: \"True guidance is the Guidance of Allah: (Fear ye) Lest a revelation be sent to someone (else) Like unto that which was sent unto you? or that those (Receiving such revelation) should engage you in argument before your Lord?\" Say: \"All bounties are in the hand of Allah: He granteth them to whom He pleaseth: And Allah careth for all, and He knoweth all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe no one except the one who follows your religion. Say (O Muhammad SAW): \"Verily! Right guidance is the Guidance of Allah\" and do not believe that anyone can receive like that which you have received (of Revelation) except when he follows your religion, otherwise they would engage you in argument before your Lord. Say (O Muhammad SAW): \"All the bounty is in the Hand of Allah; He grants to whom He wills. And Allah is All-Sufficient for His creatures' needs, the All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe none except those who follow your own religion' Say: 'The true guidance is the Guidance of Allah that anyone should be given the like of what you have been given, or dispute with you before your Lord' Say: 'Bounty is in the Hand of Allah' He gives it to whomsoever He will. Allah is the Embracer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And trust none except those who follow your religion.” Say, “Guidance is God’s guidance. If someone is given the like of what you were given, or they argue with you before your Lord, say, “All grace is in God’s hand; He gives it to whomever He wills.” God is Bounteous and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not trust except those who follow your religion.\" Say, \"Indeed, the [true] guidance is the guidance of Allah. [Do you fear] lest someone be given [knowledge] like you were given or that they would [thereby] argue with you before your Lord?\" Say, \"Indeed, [all] bounty is in the hand of Allah - He grants it to whom He wills. And Allah is all-Encompassing and Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:73] And they also said: And do not believe except in one who (the lām of li-man, ‘in one who’, is extra) follows, accords with, your religion’. God, exalted be He, says, Say, to them, O Muhammad (s): ‘True guidance is God’s guidance, that is Islam, everything else being error (this statement is parenthetical) — that (an [and what follows] is the direct object of the verb wa-lā tu’minū, ‘do not believe’) anyone should be given the like of what you have been given, of the Book, wisdom, and of the virtues (the term ahad, ‘anyone’, from whom the exclusion is being made, precedes that which is being excluded, ‘the like of what you have been given’,   the meaning being: ‘Do not affirm that anyone should be given this unless they follow your religion’); or that they, the believers, should dispute with you, [that they should] prevail over you, before your Lord’, on the Day of Resurrection, for you have the sounder religion (a variant reading has a-an, ‘such that’, the extra hamza denoting rebuke) in other words, [the Jews say do not believe] that another has been given the like of it, such that you might affirm it. God, exalted be He, says, Say: ‘Surely bounty is in God’s Hand; He gives it to whomever He will, so how can you say that no one else will be given what you have been given? God is Embracing, of ample bounty, Knowing, those who deserve it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And believe not) that he is a prophet (save in one who followeth your religion) Judaism, and your Qiblah, Jerusalem. (Say) to the Jews, Muhammad: (Lo! the guidance is Allah's guidance) Allah's Religion is Islam and Allah's Qiblah is the Ka'bah, (that any one is given) of Religion and Qiblah (the like of that which was given unto you) Companions of Muhammad (or that they may argue with you) that the Jews argue with you regarding this Religion and Qiblah (in the presence of their Lord) on the Day of Judgement. (Say) also, Muhammad: (Lo! the bounty) prophethood, Islam and the Qiblah of Abraham (is in Allah's hand. He bestoweth it on whom He will) Muhammad and his Companions. (Allah is All- Embracing) in His bounty, (All- Knowing) to whom He gives.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُؤْمِنُوۤاْ إِلاَّ لِمَن تَبِعَ دِينَكُمْ } معناهُ وَلاَ تَصدِّقوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تُؤْمِنُوۤاْ } أي: لا تخلصوا عن صميم القلب، ولا تظهروا تصديقكم { إِلاَّ لِمَن تَبِعَ دِينَكُمْ } من إخوانكم وأصحابكم المتدينين بدين آبائكم وأسلافكم { قُلْ } لهم يا أكمل الرسل رداً لمخادعتهم ودفعاً لحيلتهم كلاماً ناشئاً عن محض الحكمة: { إِنَّ ٱلْهُدَىٰ } الموصل إلى سواء السبيل { هُدَى ٱللَّهِ } الهادي لعباده، يهدي من يشاء إلى طريق توحيده، ويُضِّل عنه من يشاء، وإنما دبرتم وخادعتم { أَن يُؤْتَىۤ } أي: لأنْ يؤتى { أَحَدٌ مِّثْلَ مَآ أُوتِيتُمْ } من الكفر والإنكار بمحمد صلى الله عليه وسلم { أَوْ يُحَآجُّوكُمْ } أي: يغلبوكم بهذا الخداع والتدبير { عِندَ رَبِّكُمْ } على زعمكم الفاسد واعتقادكم الباطل { قُلْ } يا أكمل الرسل: لا تغتروا بمزخرفات عقولكم، ولا تطمئنوا بمقتضياتها؛ إذ هو صار عن المعرفة خصوصاً عند تزاحم الوهم، بل { إِنَّ ٱلْفَضْلَ } والهداية { بِيَدِ ٱللَّهِ } بقدرته ومشيئته { يُؤْتِيهِ مَن يَشَآءُ } بلا معاينة العقل ونصرته { وَٱللَّهُ } الهادي لعباده { وَاسِعٌ } في فضله وهدايته، لا حصر لطريق إلهامه وعلمه { عَلِيمٌ } [آل عمران: 73] باستعدادات عباده، يوصل كلاً منهم إلى توحيده بطريق يناسب استعداده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يحتمل أن يكون قوله: { أن يؤتى }: مفعولاً بـ { تؤمنوا } ، و { قل إن الهدى هدى الله }: اعترض، واللام في \" لمن \" صلة، { أو يحاجوكم }: عطف على { يؤتى } ، والتقدير: ولا تصدقوا أن يؤتى أحد مثل ما أوتيتم، إلا من كان على دينكم، ولا تصدقوا أن يحاجوكم عند ربكم، بل أنتم تحاجون غيركم\n فردَّ الله عليهم { قل إن الهدى هدى الله } ، و { إن الفضل بيد الله }\n ويحتمل أن يكون قوله: { أن يؤتى } مفعولاً لأجله، والعامل فيه محذوف، التقدير: أدبَّرتم ما دبرتم كراهية أن يؤتى أحد ما أوتيتم، ومخافة أن يحاجوكم عند ربكم؟\n يقول الحقّ جلّ جلاله: حاكياً عن اليهود: { و } قالوا { لا تؤمنوا } أي: لا تقروا أو تصدقوا { أن يؤتى أحد مثل ما أوتيتم } من العلم والحكمة وفلق البحر وسائر الفضائل، { إلا لمن تبع } دين اليهودية، وكان على { دينكم } ، ولا تؤمنوا أن { يحاجوكم عند ربكم } لأنكم أصح ديناً منهم\n قال الحقّ جلّ جلاله: { قل } لهم: { إن الهدى هدى الله } يهدي به من يشاء، و { إن الفضل بيد الله يؤتيه من يشاء }\n يقول الحقّ جلّ جلاله: وقالوا: لا تصدقوا ولا تذعنوا { إلا لمن تبع دينكم } وكان من جلدتكم، فإن النبوة خاصة بكم\n فكذبهم الحق بقوله: { قل إن الهدى هدى الله } ، يخص به من يشاء من عباده، فكيف تحصرنها فيكم؟ لأجل { أن يُؤْتَى أحدٌ مثل ما أوتيتم } قلتم ما قلتم، ودبرتم ما دبرتم، حسداً وبغياً، { أو } خوفاً أن { يحاجوكم عند ربكم } ، يغلبوكم بالحجة لظهور دينهم، { قل } يا محمد: { إن الفضل بيد الله يؤتيه من يشاء } فلا ينفع في رده حيلة ولا خدع\n أو يقول الحقّ جلّ جلاله: للمؤمنين، تثبيتاً لهم وتشجيعاً لقلوبهم: ولا تصدقوا يا معشر المؤمنين أن يعطي أحد مثل ما أوتيتم من الفضل والدين القويم إلا من تبع دينكم الحق، وجاء به من عند الحق، ولا تصدقوا { أن يحاجوكم } في دينكم { عند ربكم } أو يقدر أحد على ذلك، فإن الهدى هدى الله والفضل بيد الله، { يؤتيه من يشاء والله واسع } الفضل والكرم، { عليم } بمن يستحق الخصوصية والفضل، { يختص برحمته من يشاء } كالنبوة وغيرها، { والله ذو الفضل العظيم } لا حصر لفضله، كما لا حصر لذاته\n الإشارة: يقول الحق - جلت ذاته، وعظمت قدرته - لأهل الخصوصية: ولا تقروا بالخصوصية إلا لمن كان على دينكم وطريقكم، وتزيّاً بزيكم، وبذل نفسه وفلسه في صحبتكم، مخافة أن يؤتى أحد مثل ما أوتيتم من الخصوصية، وهو ليس أهلاً لها، فيأخذها علماً، فإما أن يتزندق أو يتفسق، أو يحاجوكم بالشريعة فيريق دماءكم كما وقع للحلاج رضي الله عنه وفي ذلك يقول الشاعر:\n\nوقال آخر:\n",
      "translations": []
    }
  ]
}