{
  "chapter": "آل عمران",
  "text": "ومن اهل الكتب من ان تامنه بقنطار يؤده اليك ومنهم من ان تامنه بدينار لا يؤده اليك الا ما دمت عليه قائما ذلك بانهم قالوا۟ ليس علينا فى الامين سبيل ويقولون على الله الكذب وهم يعلمون",
  "translations": [
    {
      "translation": "Among the People of the Book there are some who, if you entrust them with a pile of gold, will return it to you. But there are others among them who, if you entrust them with just a single dinar, will not return it to you, unless you stay standing over them. That is because they say, 'We are under no obligation where the gentiles are concerned.' They tell a lie against Allah and they know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among the people of the Book who return a whole treasure entrusted to them; yet some there are who do not give back a dinar until you demand and insist, because they say: \"It is not a sin for us to (usurp) the rights of the Arabs.\" Yet they lie against God, and they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the People of the Book there are some who would restore you even if you were to entrust a treasure of gold, and of them there are some whom were you to entrust with one gold piece, will not restore it unless you stand over them. That is because they say: 'We will not be taken to task for whatever we may do to non-Jews (ummls). Thus they falsely fix a lie upon Allah, and do so wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you entrust some of the People of the Book, with a large quantity of gold, they will return it to you while if you entrust others among them with a small quantity of gold, they will not give it back to you unless you keep insisting on its return. For they say, \"We are not bound to keep our words with the illiterate people,\" and they themselves knowingly ascribe false statements to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People given the Book(s) is one who, if you trust him with a heap of treasure, will return it to you; and among them is one who, if you trust him with (just) one coin, will not return it to you unless you constantly stand over him (keep demanding); that is because they say, “We are not obliged in any way, in the case of illiterates”; and they purposely fabricate lies against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Scripture is he who, if entrusted with a Qintar (a great amount of wealth), will readily pay it back; and among them there is he who, if entrusted with a single silver coin, will not repay it unless you constantly stand demanding, because they say: \"There is no blame on us to betray and take the properties of the illiterates (Arabs).\" But they tell a lie against Allah while they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the followers of the Book there are some such that if you entrust one (of them) with a heap of wealth, he shall pay it back to you; and among them there are some such that if you entrust one (of them) with a dinar he shall not pay it back to you except so long as you remain firm in demanding it; this is because they say: There is not upon us in the matter of the unlearned people any way (to reproach); and they tell a lie against Allah while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the People of the Book is he who, if thou trust him with a hundredweight, will restore it thee; and of them is he who, if thou trust him with one pound, will not restore it thee, unless ever thou standest over him. That, because they say, 'There is no way over us as to the common people.' They speak falsehood against God and that wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Scripture there is he who, if thou trust him with a weight of treasure, will return it to thee. And among them there is he who, if thou trust him with a piece of gold, will not return it to thee unless thou keep standing over him. That is because they say: We have no duty to the Gentiles. They speak a lie concerning Allah knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people of the Book there are some who, if you entrust them with a heap of gold, will return it to you. But there are others of them who, if you entrust them with a single dinar, will not return it to you, unless you keep demanding it from them. That is because they say, \"We are under no obligation towards the gentiles.\" They deliberately tell lies about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people of the Book is he whom if thou trustest with a talent, he will restore it unto thee, and among them is he whom if thou trustest with a dinar, he will not restore it unto thee except thou art ever standing over him that is because they say there is in the matter of the illiterates no call on us. And they forge a lie against Allah while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Book is he who if you entrust him with a quintal will repay it to you, and among them is he who, if you entrust him with a dinar will not repay it to you unless you stand persistently over him. That is because they say, ‘We have no obligation to the non-Jews.’ But they attribute lies to Allah, and they know [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Book are some who, if entrusted with a hoard of gold, will (readily) pay it back; others, who, if entrusted with a single silver coin, will not repay it unless thou constantly stoodest demanding, because, they say, \"there is no call on us (to keep faith) with these ignorant (Pagans).\" but they tell a lie against Allah, and (well) they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people of the Scripture (Jews and Christians) is he who, if entrusted with a Cantar (a great amount of wealth, etc.), will readily pay it back; and among them there is he who, if entrusted with a single silver coin, will not repay it unless you constantly stand demanding, because they say: \"There is no blame on us to betray and take the properties of the illiterates (Arabs).\" But they tell a lie against Allah while they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Book there are some, who, if you trust him with a Qintar (98, 841. 6 lbs.), will return it to you, and there are others, who, if you trust him with a dinar will not hand it back unless you stand over him, for they say: 'As for the common people, they have no recourse to us' They say lies against Allah while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the People of the Book is he, who, if you entrust him with a heap of gold, he will give it back to you. And among them is he, who, if you entrust him with a single coin, he will not give it back to you, unless you keep after him. That is because they say, “We are under no obligation towards the gentiles.” They tell lies about God, and they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the People of the Scripture is he who, if you entrust him with a great amount [of wealth], he will return it to you. And among them is he who, if you entrust him with a [single] silver coin, he will not return it to you unless you are constantly standing over him [demanding it]. That is because they say, \"There is no blame upon us concerning the unlearned.\" And they speak untruth about Allah while they know [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:75] And of the People of the Scripture is he who, if you trust him with a hundredweight, that is, with much money, he will return it to you, on account of his trustworthiness, the like of ‘Abd Allāh b. Salām to whom a man entrusted 1200 plates of gold, which he then returned to him; and of them is he who, if you trust him with one dinar, will not return it to you, on account of his treachery; unless you keep standing over him, not leaving him for one minute, for as soon as you leave him, he will deny it, as was the case with Ka‘b b. alAshraf, to whom a man from Quraysh entrusted a dinar and later denied it. That, refusal to return things, is because they say, ‘We have no duty towards, namely, [no possibility of acquiring] sin because of, the Gentiles’, the Arabs; for they considered it lawful to be unjust towards any person of a different religion, and they attributed [the source of] this conviction to God, exalted be He. God, exalted be He, says, They speak falsehood against God, by attributing such things to Him, while they are aware, that they are liars.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على قوله : { وقالت طائفة من أهل الكتاب } \\[ آل عمران : 72 \\] أو على قوله : { ودت طائفة من أهل الكتاب لو يضلونكم } \\[ آل عمران : 69 \\] عطف القصة على القصة والمناسبة بيان دخائل أحوال اليهود في معاملة المسلمين الناشئة عن حسدهم وفي انحرافهم عن ملة إبراهيم مع ادّعائهم أنهم أولَى الناس به ، فقد حكى في هذه الآية خيانة فريق منهم .وقد ذكر الله هنا أنّ في أهل الكتاب فريقين : فريقاً يؤدّي الأمانة تعففاً عن الخيانة وفريقاً لا يؤدّي الأمانة متعلّلين لإباحة الخيانة في دينهم ، قيل : ومن الفريق الأول عبد الله بن سلام ، ومن الفريق الثاني فِنْحَاص بن عازوراء وكلاهما من يهود يثرب والمقصود من الآية ذمّ الفريق الثاني إذ كان من دينهم في زعمهم إباحة الخَون قال : { ذلك بأنهم قالوا ليس علينا في الأمين سبيل } فلذلك كان المقصود هو قوله : { ومنهم من إن تأمنه بدينار لا يؤده إليك } إلخ ولذلك طُوِّل الكلام فيه .وإنما قدّم عليه قوله : { ومن أهل الكتاب من إن تأمنه بقنطار } إنصافاً لحقّ هذا الفريق ، لأنّ الإنصاف مما اشتهر به الإسلام ، وإذ كان في زعمهم أنّ دينهم يبيح لهم خيانة غيرهم ، فقد صار النعيُ عليهم ، والتعبيرُ بهذا القول لازمَاً لجميعهم أمينهم وخائنهم ، لأنّ الأمين حينئذ لا مزية له إلاّ في أنّه ترك حقاً يبيح له دينُه أخذه ، فترفّع عن ذلك كما يترفع المتغالي في المروءة عن بعض المباحات .وتقديم المسند في قوله : { ومن أهل الكتاب } في الموضعين للتعجيب من مضمون صلة المسند إليهما : ففي الأول للتعجيب من قوة الأمانة ، مع إمكان الخيانة ووجود العذر له في عادة أهل دينه ، وفي الثاني للتعجيب من أن يكون الخوْن خُلْقاً لمتبع كتاب من كتب الله ، ثم يزيد التعجيبُ عند قوله : { ذلك بأنهم قالوا } فيكسب المسند إليهما زيادة عجَب حاللٍ .وعُدّي { تأمنه } بالباء مع أنّ مثله يتعدّى بعلي كقوله : { هل آمنكم عليه } \\[ يوسف : 64 \\] ، لتضمينه معنى تُعامله بقنطار ليشمل الأمانة بالوديعة ، والأمانةَ بالمعاملة على الاستيمان ، وقيل الباء فيه بمعنى على كقول أبي ذرّ أو عباسسٍ بن مِرداس: ... أربٌّ يَبولُ الثعْلُبَان بِرَأسهوهو محمل بعيد ، لأنّ الباء في البيت للظرفية كقوله تعالى : { ببطن مكة } \\[ الفتح : 24 \\] .وقرأ الجمهور { يؤدّهِ } إليك بكسر الهاء من يؤدّهِ على الأصل في الضمائر .وقرأه أبو عمرو ، وحمزة ، وأبو بكر عن عاصم ، وأبُو جعفر : بإسكان هاء الضمير في يؤدّه ، فقال الزجاج : هذا الإسكان الذي روي عن هؤلاء غلط بيِّن لأنّ الهاء لا ينبغي أن تجزم وإذا لم تجزم فلا يجوز أن تكسر في الوصل ( هكذا نقله ابن عطية ومعناه أنّ جزم الجواب لا يظهر على هاء الضمير بل على آخر حرف من الفعل ولا يجوز تسكينها في الوصل كما في أكثر الآيات التي سكنوا فيها الهاء ) .وقيل هو إجرَاء للوصل مُجرى الوقف وهو قليل ، قال الزجاج : وأما أبو عمرو فأراه كان يختلس الكسر فغلط عليه من نقله وكلام الزجاج مردود لأنه راعى فيه المشهور من الاستعمال المقيس ، واللغة أوسع من ذلك ، والقراءة حجة . وقرأه هشام عن ابن عامر ، ويعقوب باختلاس الكسر .وحكى القرطبي عن الفرّاء : أنّ مذهب بعض العرب يجزمون الهاء إذا تحرّك ما قبلها يقولون ضربته كما يسكنون ميم أنتم وقمتم وأصله الرفع وهذا كما قال الراجز: ... لَما رَأى ألاّ دَعَهْ ولاَ شِبَعمَالَ إلى أرْطَاةِ حقف فاضطجع ... والقِنطار تقدم آنفاً في قوله تعالى : { والقَناطير المقنطرة من الذهب والفضة } \\[ آل عمران : 14 \\]والدينار اسم للمسكوك من الذهب الذي وزنه اثنتان وسبعون حبة من الشعير المتوسط وهو معرّب دِنَّار من الرومية .وقد جعل القنطار والدينار مَثَلين للكثرة والقلة ، والمقصود ما يفيده الفحوى من أداء الأمانة فيما هو دون القنطار ، ووقوع الخيانة فيما هو فوق الدينار .وقوله : { إلا ما دمت عليه قائماً } أطلق القيام هنا على الحرص والمواظبة : كقوله : { قائماً بالقسط } \\[ آل عمران : 18 \\] أي لا يفعل إلاّ العدل .وعديّ «قائماً» بحرف ( على ) لأنّ القيام مجاز على الإلحاح والترداد فتعديته بحرف الاستعلاء قرينة وتجريد للاستعارة .و ( ما ) من قوله : { إلا ما دمت عليه قائماً } حرف مصدري يصير الفعل بعده في تأويل مصدر ، ويكثر أن يقدر معها اسم زمان ملتزَمٌ حذفه يدل عليه سياق الكلام فحينئذ يقال ما ظرفية مصدرية . وليست الظرفية مدلولها بالأصالة ولا هي نائبة عن الظرف ، ولكنها مستفادة من موقع ( مَا ) في سياق كلام يؤذن بالزمان ، ويكثر ذلك في دخول ( ما ) على الفعل المتصرّف من مادة دَام ومرادفها .و ( ما ) في هذه الآية كذلك فالمعنى : لا يؤدّه إليك إلاّ في مدة دوام قيامك عليه أي إلحاحك عليه . والدوام حقيقته استمرار الفعل وهو هنا مجاز في طول المدة ، لتعذر المعنى الحقيقي مع وجود أداة الاستثناء ، لأنه إذا انتهى العمر لم يحصل الإلحاح بعدَ الموت .والاستثناء من قوله : { إلا ما دمت عليه قائماً } يجوز أن يكون استثناء مفرّغاً من أوقات يدل عليها موقع ( مَا ) والتقدير لا يؤدّه إليك في جميع الأزمان إلاّ زماناً تدوم عليه فيه قائماً فيكون ما بعد ( إلاّ ) نصباً على الظرففِ ، ويجوز أن يكون مفرّغاً من مصادر يَدل عليها معنى ( ما ) المصدرية ، فيكون ما بعده منصوباً على الحال لأنّ المصدر يقع حالاً .وقدّم المجرور على متعلقه في قوله : { عليه قائماً } للاهتمام بمعنى المجرور ، ففي تقديمه معنى الإلحاح ، أي إذا لم يكن قيامُك عليه لا يُرجعُ لك أمانتك .والإشارة في قوله : { ذلك بأنهم قالوا } إلى الحكم المذكور وهو { إن تأمنه بدينار لا يؤده إليك } وإنما أشير إليه لكمال العناية بتمييزه لاختصاصه بهذا الشأن العجيب .والباء للسبب أي ذلك مُسَببٌ عن أقوال اختلقوها ، وعبّر عن ذلك بالقول ، لأنّ القول يصدر عن الاعتقاد ، فلذا ناب منابه فأطلق على الظنّ في مواضع من كلام العرب .وأرادوا بالأميين من ليسوا من أهل الكتاب في القديم ، وقد تقدم بيان معنى الأمي في سورة البقرة .وحرف ( في ) هنا للتعليل . وإذ قد كان التعليل لا يتعلق بالذوات ، تعيَّن تقدير مضاف مجرور بحرف ( في ) والتقدير في معاملة الأمّيّين .ومعنى ليس علينا في الأميين سبيل ليس علينا في أكل حقوقهم حرج ولا إثم ، فتعليق الحكم بالأميين أي ذواتِهم مراد منه أعلق أحوالهم بالغرض الذي سبق له الكلام .فالسبيل هنا طريق المؤاخذة ، ثم أطلق السبيل في كلام العرب مجازاً مشهوراً على المؤاخذة قال تعالى : { مَا على المحسنين من سبيل } \\[ التوبة : 91 \\] وقال : { إنما السبيل على الذين يستأذنوك } \\[ التوبة : 93 \\] وربما عبّر عنه العرب بالطريق قال حُميد بن ثور: ... وهل أنا إن علّلتُ نفسي بسَرحةمن السرْح موجود عليَّ طريق ... وقصدهم بذلك أن يحقروا المسلمين ، ويتطاولوا بما أوتوه من معرفة القراءة والكتابة مِنْ قبلهم . أو أرادوا الأميين بمعرفة التوراة ، أي الجاهلين : كناية عن كونهم ليسوا من أتباع دِين موسى عليه السلام .وأيَّاماً كان فقد أنْبَأ هذا عن خلق عجيب فيهم ، وهو استخفافهم بحقوق المخالفين لهم في الدين ، واستباحةُ ظلمهم مع اعتقادهم أنّ الجاهل أو الأمّي جدير بأن يدحَضُ حقُه . والظاهر أنّ الذي جرّأهم علَى هذا سوء فهمهم في التوراة ، فإنّ التوراة ذكرت أحكاماً فرّقت فيها بين الإسرائيلي وغيره في الحقوق ، غير أنّ ذلك فيما يرجع إلى المؤاساة والمخالطة بين الأمة ، فقد جاء في سفر التثنية الإصحاح الخامس عشر : «في آخر سبع سنين تعمل إبراء يبرىء كلُ صاحب دين يدَه ممّا أقرض صاحبه . الأجنبيَّ تُطالِب ، وأما ما كان لك عند أخيك فتبرئة» وجاء في «الإصحاح» 23 منه : «لا تقرض أخاك بربا فضة أو ربا طعام وللأجنبي تُقرض بربا» ولكن شَتان بين الحقوق وبين المؤاساة فإنّ تحريم الربا إنما كان لقصد المؤاساة ، والمؤاساة غير مفروضة مع غير أهل الملّة الواحدة . وعن ابن الكلبي قالت اليهود : الأموال كلّها كانت لنا ، فما في أيدي العرب منها فهو لنا ، وإنهم ظلمونا وغصَبونا فلا إثم علينا في أخذ أموالنا منهم . وهذا الخلقان الذميمان اللذان حكاهما الله عن اليهود قد اتصف بهما كثير من المسلمين ، فاستحلّ بعضهم حقوق أهل الذمة ، وتأوّلوها بأنهم صاروا أهل حرب ، في حين لا حرب ولا ضرب .وقد كذّبهم الله تعالى في هذا الزعم فقال : { ويقولون على الله الكذب } قال المفسرون : إنهم ادّعوا أنهم وجدوا ذلك في كتابهم . وروى عن سعيد بن جبير أنه لما نزل قوله تعالى : { ومن أهل الكتاب من إن تأمنه } إلى قوله { وهم يعلمون } قال النبي صلى الله عليه وسلم «كذب أعداء الله ما من شيء كان في الجاهلية إلاّ وهو تحت قدميّ هاتين إلاّ الأمانة فإنها مؤدّاة إلى البرّ والفاجر .وقوله وهم يعلمون حال أي يعتمدون الكذب : إما لأنهم علموا أنّ ما قاسوه على ما في كتابهم ليس القياس فيه بصحيح ، وإما لأنّ التأويل الباطل بمنزلة العلم بالكذب ، إذ الشبهة الضعيفة كالعهد .\n\n",
      "translations": [
        {
          "translation": "Subsequently, Allah mentions the trustworthiness and treachery of the people of the Book, saying: (Among the People of the Scripture) i.e. the Jews (there is he who, if you trust him with a weight of treasure, will return it to you) without any problem, hardship or ever thinking to keep it for himself by declaring it lawful for him to take. The reference here is to 'Abdullah Ibn Salam and his companions. (And among them there is he who, if you trust him with a piece of gold, will not return it to you) and will declare it lawful for him to take (unless you keep standing over him) insisting on taking it back and suing him for it. The reference here is to Ka'b Ibn al-Ashraf and his followers. (That) treachery and declaring that it is lawful to take other people's property (is because they say: We have no duty to the Gentiles) there is no harm in taking the property of Arabs. (They speak a lie concerning Allah knowingly) they lie about Allah and know that they are lying. 62\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ مَا دُمْتَ عَلَيْهِ قَآئِماً } معناهُ مُلازِمٌ، [لما] يَقْتَضِيهِ إِيّاهُ\n\n",
      "translations": [
        {
          "translation": "\nThe meaning of the saying of the Most High: {Except as long as you remain standing} is obligatory, [because] it requires it of him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من تفاوت الاستعدادات\n واختلاف القابليات الفطرية ترى { مِنْ أَهْلِ ٱلْكِتَٰبِ مَنْ إِن تَأْمَنْهُ } ثقة عليه واعتماداً له { بِقِنْطَارٍ } مال كثير مفضل مخرون { يُؤَدِّهِ إِلَيْكَ } على الوجه الذي ائتمنت عليه بلا تغيير وخيانة\n لصفاء فطرته وحسن استعداده وقابليته { وَمِنْهُمْ مَّنْ إِن تَأْمَنْهُ بِدِينَارٍ } أو أقل { لاَّ يُؤَدِّهِ إِلَيْكَ } لخباثة طينته وقبح قابليته { إِلاَّ مَا دُمْتَ عَلَيْهِ قَآئِماً } دائماً مطالباً أمانتك منه على وجه الإلحاح والإتمام\n نزلت في عبد الله بن سلام حين استودعه قريشي ألفاً ومائتي أوقية ذهباً\n فأداه إليه\n وفنخاص بن عاذوراء استودعه أيضاً قريشي آخر ديناراً\n أنكر عليه وجحد\n مع اتفاقهما في الكفر والضلال\n وأنهماكهما في الإصرار والفساد\n\n\n{ ذٰلِكَ } أي: ترك البعض اليهودي { بِأَنَّهُمْ } بسبب أنهم استحلوا مال من ليس على دينهم { قَالُواْ لَيْسَ } في كتابنا المنزل { عَلَيْنَا } من ربنا { فِي } حق { ٱلأُمِّيِّينَ سَبِيلٌ } أي: طريق معاتبة ومؤاخذة\n لأنهم ليسوا من أهل الكتاب { وَ } هم بهذا القول { يَقُولُونَ } ويفترون { عَلَى اللَّهِ ٱلْكَذِبَ } لأنه ليس في كتابهم هذا الباطل بل يفترونه عناداً { وَهُمْ } أيضاً { يَعْلَمُونَ } [آل عمران: 75] أنه افتراء منهم\n وعن النبي صلى الله عليه وسلم أنه قال عند نزول هذه الآية: \" كذب أعداء الله\n ما من شيء في الجاهلية إلا هو تحت قدمي إلا الأمانة فإنها مؤداة إلى البر والفاجر \"\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الباء في { بقنطار } \n بمعنى على\n و { يؤده }: جواب الشرط مجزوم بحذف الياء\n ومن قرأ بإسكان الضمير فلأنه أقامه مقام المحذوف\n فجزمه عوضاً عنه\n وقال الفراء: مذهب بعض العرب: يسكنون الهاء إذا تحرك ما قبلها\n يقولون: ضربته ضرباً شديداً\n يقول الحقّ جلّ جلاله: { ومن أهل الكتاب } من أسلم وآمن فصار من أهل الإيمان { إن تأمنه } على { قنطار } من المال أو أكثر أداه إليك\n ولم يخن منه شيئاً\n وفي الحديث:\n \" من ائتمن على أمانة فأداها\n ولو شاء لم يؤدها\n زوجه الله من الحور العين ما شاء \" \n{ ومنهم } من بقي على دينه من أهل الخيانة والخسران\n { إن تأمنه } على { دينار } فأقل { لم يؤده إليك إلا ما دمت عليه قائماً } على رأسه\n مبالغاً في مطالبته\n نزلت في عبد الله بن سلام\n استودعه قرشي ألفاً ومائتي أوقية ذهباً\n فأداها إليه\n وفي فنحاص بن عازوراء اليهودي\n استودعه قرشي آخر ديناراً\n فجحده\n وقيل: في النصارى واليهود\n فإن النصارى: الغالب عليهم الأمانة\n واليهود الغالب عليهم الخيانة\n وذلك الاستحلال بسبب أنهم { قالوا ليس علينا في الأميين سبيل } أي: ليس علينا في شأن من ليسوا أهل كتاب\n ولم يكونوا على ديننا\n حرج في أخذ مالهم وجحدها\n ولا إثم\n { ويقولون على الله الكذب وهم يعلمون } أنهم كاذبون لأنهم استحلوا ظلم من خالفهم\n وقالوا: لم يجعل لهم في التوراة حرمة\n وقيل: عَاملَ اليهودُ رجلاً من قريش\n فلما أسلموا تقاضوهم\n فقالوا: سقط حقكم حيث تركتم دينكم\n وقال صلى الله عليه وسلم:\n \" كَذَبَ أَعْدَاءُ اللّهِ\n مَا مِنْ شَيءٍ فِي الجاهِلية إلاّ وَهُو تَحْتَ قَدَمَي\n إِلاَّ الأمَانَةَ فإِنهَا مُؤداةٌ إلى الْبَر والفَاجِر \"\n ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:20",
      "similarity": 0.2965233527833227
    },
    {
      "verse": "3:14",
      "similarity": 0.25039977960286686
    },
    {
      "verse": "44:18",
      "similarity": 0.2146032087670058
    },
    {
      "verse": "4:58",
      "similarity": 0.21070046507093945
    },
    {
      "verse": "2:178",
      "similarity": 0.18544032296912139
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}