{
  "chapter": "آل عمران",
  "text": "بلى من اوفى بعهده واتقى فان الله يحب المتقين",
  "translations": [
    {
      "translation": "No, the truth is, if people honour their contracts and have taqwa of Him, Allah loves those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But certainly whoever keeps his promise and follows the right path (will be blessed), for God loves those who shun evil and follow the right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah loves only those who fulfil their covenant and fear Allah. Truly Allah loves the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who keep their promise and observe piety should know that God certainly loves the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, why not? Whoever fulfilled his pledge and practised piety – and indeed Allah loves the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, whoever fulfills his pledge and fears Allah much; verily, then Allah loves the Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea, whoever fulfills his promise and guards (against evil)-- then surely Allah loves those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but whoso fulfils his covenant and fears God, God loves the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but (the chosen of Allah is) he who fulfilleth his pledge and wardeth off (evil); for lo! Allah loveth those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed God loves those who honour their covenants and fear Him. God loves the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye whosoever keepeth his covenant and feareth Allah--then verily Allah loveth the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, whoever fulfills his commitments and is wary of Allah—Allah indeed loves the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay.- Those that keep their plighted faith and act aright,-verily Allah loves those who act aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, whoever fulfils his pledge and fears Allah much; verily, then Allah loves those who are Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, those who keep their promise and fear Allah Allah loves the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, whoever fulfills his commitments and maintains piety—God loves the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But yes, whoever fulfills his commitment and fears Allah - then indeed, Allah loves those who fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:76] Nay, there is a duty incumbent over them in this regard; but whoever fulfils his covenant, the one he has made or the covenant of God, by restoring a trust and other such things, and has fear, of God, by refraining from disobedience and performing deeds of obedience, for truly God loves the God-fearing: ‘He loves them’ means that He will reward them (the overt noun [al-muttaqīn, ‘the God-fearing’] has replaced the [third person] pronominalisation).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay) Allah is here answering them, (but (the chosen of Allah is) he who fulfileth his pledge) He says: but he who keeps his pledge between himself and his Lord or between himself and other people (and wardeth off (evil)) ward off breaking his pledge by treachery and turning on his pledge; (for lo! Allah loveth those who ward off (evil)) ward off breaking pledges, treachery and being untrustworthy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلَىٰ } للحق سبيل معاتبة وانتقام معهم في حق كل واحد من عباده على أي دين كان وملة كانت إذا صدر عنهم التعدي إلا { مَنْ أَوْفَىٰ } منهم { بِعَهْدِهِ } الذي عهد مع الله ومع عباده { وَاتَّقَى } من غضب الله بعدم الفواء\n فهو من المحبوبين عند الله { فَإِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ } [آل عمران: 76] ويرضى عنهم\n يوفيهم أجورهم\n ويزيدهم من فضله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم كذَّبهم الحقّ - تعالى - فقال: { بلى } عليهم في ذلك سبيل، فإن { من أوفى بعهده واتقى } الشرك والمعاصي { فإن الله يحب المتقين } ومن أحبّه الله كيف يباح ماله وتسقط حرمته؟! بل من أسقط حرمته فقد حارب الله ورسوله، أو { من أوفى } ، بعهد الله من أهل الكتاب، فآمن بمحمد - عليه الصلاة والسلام - { واتقى } الخيانة، وأدى الأمانة، { فإن الله يحب المتقين }\n وأوقع المظهر موقع الضمير العائد إلى \" من \" لعمومه، فإن لفظ المتقين عام يصدق برد الودائع وغيره، إشعاراً بأن التقوى ملاك الأمر وسبب الحفظ\n والله تعالى أعلم\n الإشارة: قد رأينا بعض الفقراء دخل بلد الحقيقة فسقطت من قلبه هيبة الشريعة، فتساهل في أموال الناس وسقطت لديه حرمة العباد، حتى لا تثق به في حفظ مال ولا أهل، فإذا أودعته شيئاً أو قارضته لا يؤده إليك إلا ما دمت عليه قائماً\n وهذه زندقة ونزعة إسرائيلية\n لا يرضاها أدنى الناس، فما بالك بمن يدعي أنه أعلى الناس، وفي بعض الحكم: [كَمَالُ الديانة ترك الخيانة]، وأعظم الإفلاس خيانة الناس، وفي الحديث:\n\n \" ثَلاَثٌ مَنْ كُنَّ فِيهِ فَهُواَ مُنَافقٌ، وإنْ صَلَّى وإن صَامَ وزَعم أنه مُؤْمن، إذ حدَّثّ كَذَبَ، وإذا وعَدَ أَخْلَفَ، وإذا ائتُمِنَ خَانَ \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:28",
      "similarity": 0.5998997504533169
    },
    {
      "verse": "84:15",
      "similarity": 0.5690292962208634
    },
    {
      "verse": "39:59",
      "similarity": 0.5355735379781947
    },
    {
      "verse": "40:50",
      "similarity": 0.5087378642228251
    },
    {
      "verse": "67:9",
      "similarity": 0.4842701527746372
    }
  ]
}