{
  "chapter": "آل عمران",
  "text": "ان الذين يشترون بعهد الله وايمنهم ثمنا قليلا او۟لئك لا خلق لهم فى الءاخرة ولا يكلمهم الله ولا ينظر اليهم يوم القيمة ولا يزكيهم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "Those who sell Allah's contract and their own oaths for a paltry price, such people will have no portion in the Next World, and on the Day of Rising Allah will not speak to them or look at them or purify them. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who trade on the promises of God, and who purchase a little gain from their oaths, will have no share in the life to come. God will not address or even regard them on the Day of Resurrection, nor perfect them, and their suffering will be painful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be no share in the Life to Come for those who sell away the covenant of Allah and their oaths for a trivial gain. On the Day of Resurrection Allah will neither address them, look at them, nor will He purify them. A painful chastisement lies ahead of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who sell their covenant with God and their promises for a small price will have no share in the life hereafter. God will not speak to them nor will He look at them on the Day of Judgment nor will He purify them. They will face a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accept abject prices in exchange of Allah’s covenant and their oaths, do not have a portion in the Hereafter – Allah will neither speak to them nor look towards them on the Day of Resurrection, nor will He purify them; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who purchase a small gain at the cost of Allah's covenant and their oaths, they shall have no portion in the Hereafter (Paradise). Neither will Allah speak to them nor look at them on the Day of Resurrection, nor will He purify them, and they shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who take a small price for the covenant of Allah and their own oaths-- surely they shall have no portion in the hereafter, and Allah will not speak to them, nor will He look upon them on the day of resurrection nor will He purify them, and they shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that sell God's covenant, and their oaths, for a little price, there shall be no share for them in the world to come; God shall not speak to them neither look on them on the Resurrection Day, neither will He purify them; and for them awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who purchase a small gain at the cost of Allah's covenant and their oaths, they have no portion in the Hereafter. Allah will neither speak to them nor look upon them on the Day of Resurrection, nor will He make them grow. Theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who sell out God's covenant and their oaths for a paltry price will have no share in the life to come on the Day of Resurrection. God will neither speak to them nor cast a look upon them on the Day of Judgement, nor will He purify them. For them there shall be a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who barter Allah's covenant and their oaths at a Small price- no portion is theirs in the Hereafter; nor shall Allah speak unto them or look at them on the Day of Resurrection, nor shall He cleanse them, and theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be no share in the Hereafter for those who sell Allah’s covenant and their oaths for a paltry gain, and on the Day of Resurrection Allah will not speak to them nor will He [so much as] look at them, nor will He purify them, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who sell the faith they owe to Allah and their own plighted word for a small price, they shall have no portion in the Hereafter: Nor will Allah (Deign to) speak to them or look at them on the Day of Judgment, nor will He cleans them (of sin): They shall have a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter (Paradise). Neither will Allah speak to them, nor look at them on the Day of Resurrection, nor will He purify them, and they shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who sell the promise of Allah and their own oaths for a little price shall have no share in the Everlasting Life. Allah will neither speak to them, nor look at them, nor purify them on the Day of Resurrection. Theirs shall be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who exchange the covenant of God, and their vows, for a small price, will have no share in the Hereafter, and God will not speak to them, nor will He look at them on the Day of Resurrection, nor will He purify them. They will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who exchange the covenant of Allah and their [own] oaths for a small price will have no share in the Hereafter, and Allah will not speak to them or look at them on the Day of Resurrection, nor will He purify them; and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:77] The following was revealed with regard to the Jews when they distorted the descriptions of the Prophet (s) and God’s covenant with them in the Torah, and [God’s covenant with them] regarding one that swears an oath to a falsehood when bearing witness or when selling merchandise: Those that sell, exchange, God’s covenant, with them that they believe in the Prophet and return faithfully what has been entrusted to them, and their own oaths, their invoking God’s name in mendacity, for a small price, of this world, there shall be no share, [no] lot, for them in the Hereafter; and God shall not speak to them, out of wrath against them, nor look upon them, [nor] have mercy upon them, on the Day of Resurrection, nor will He purify them, cleanse them, and theirs will be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمناسبة هذه الآية لما قبلها أنّ في خيانة الأمانة إبطالاً للعهد ، وللحلف الذي بينهم ، وبين المسلمين ، وقريششٍ . والكلامُ استئناف قصد منه ذكر الخُلق الجامع لشتات مساوىء أهل الكتاب من اليهود ، دعا إليه قوله وَدّت طائفة من أهل الكتاب وما بعده .وقد جرت أمثال هذه الأوصاف على اليهود مفرّقة في سورة البقرة ( 40 ) : { أوفوا بعهدي ، ولا تشتروا بآياتي ثمناً قليلاً } \\[ البقرة : 41 \\] . { ماله في الآخرة من خلاق } \\[ البقرة : 102 \\] . { ولا يكلمهم الله يوم القيامة ولا يزيكهم } \\[ البرة : 174 \\] . فعلمنا أنهم المراد بذلك هنا . وقد بينا هنالك وجه تسمية دينهم بالعهد وبالميثاق ، في مواضع ، لأنّ موسى عاهدهم على العمل به ، وبينا معاني هذه الأوصاف والأخبار .ومعنى { ولا يكلمهم الله ولا ينظر إليهم يوم القيامة } غَضَبُه عليهم إذ قد شاع نفي الكلام في الكناية عن الغضب ، وشاع استعمال النظر في الإقبال والعناية ، ونفي النظر في الغَضب فالنظر المنفي هنا نظر خاص . وهاتان الكنايتان يجوز معهما إرادة المعنى الحقيقي .وقوله : { ولا يزكيهم } أي لا يطهرهم من الذنوب ولا يقلعون عن آثامهم ، لأنّ من بلغ من رقّة الديانة إلى حدّ أن يشتري بعهد الله وأيمانه ثمناً قليلاً ، فقد بلغ الغَاية القصوى في الجُرْأة على الله ، فكيف يُرجى له صلاح بعد ذلك ، ويحتمل أن يكون المعنى ولا يُنْميهم أي لا يكثر حظوظهم في الخيْرات .وفي مجيء هذا الوعيد ، عقب الصلة ، وهي يشترون بعهد الله الآية ، إيذان بأنّ من شابههم في هذه الصفات فهو لاَحِقٌ بهم ، حتى ظنّ بعض السلف أنّ هذه الآية نزلت فيمن حلَف يميناً باطلة ، وكلّ يظنّ أنها نزلت فيما يَعرفه من قصةِ يَمين فاجرة ، ففي «البخاري» ، عن أبي وائِل ، عن عبد الله بن مسعود ، قال رسول الله صلى الله عليه وسلم \" من حلف يمين صبر ليقتطع بها مال امرىء مسلم لقي الله وهو عليه غضبان \" فأنزل الله تصديق ذلك : { إنّ الذين يشترون بعهد الله وأيمانهم } الآية فدخل الأشعث بن قيس وقال : «ما يحدثكم أبو عبد الرحمان» قلنا : كذا وكذا . قال : «فيّ أنزلت كانت لي بئر في أرض ابن عم لي» فقال لي رسول الله صلى الله عليه وسلم بينتك أو يمينه قلت : إذن يحلف فقال رسول الله : من حَلف على يمين صبر الحديث .وفي «البخاري» ، عن عبد الله بن أبي أوفى : أنّ رجلاً أقام سلعة في السوق فحلف لقد أعطي بها ما لم يُعْطَه ليُوقع فيها رجلاً من المسلمين فنزلت : { إن الذين يشترون بعهد الله وأيمانهم ثمناً قليلاً } الآية .وفيه عن ابن عباس أنه قرأ هاته الآية في قصّة وجبت فيها يمين لِردّ دعوى :\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned their punishment, i.e. the punishment of the Jews, saying: (Lo! those who purchase a small gain) a small gain of in their living (at the cost of Allah's covenant) by breaking Allah's covenant (and their oaths) their pledges with their prophets, (they have no portion in the Hereafter) in Paradise. (Allah will neither speak to them) in a nice manner on the Day of Judgement (nor look upon them on the Day of Resurrection) He will have no mercy for them, (nor will He make them grow) He will neither exonerate them for being Jews nor put their minds at peace. (Theirs will be a painful doom) a severe pain which will spread to their hearts. It is also said that this was revealed about 'Abdan Ibn al-Ashu' and Imra' al-Qays because of a dispute between them, and it was also revealed about the Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ خَلاَقَ لَهُمْ } معناهُ لاَ نَصِيرَ لَهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no creator for them} means that we cannot help them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ يَشْتَرُونَ } يستبدلون { بِعَهْدِ ٱللَّهِ } الذين عهدوا مع رسوله { وَأَيْمَانِهِمْ } المغلظة الصادرة منهم على وفائه\n كقولهم: والله\n ليؤمنن به ولينصرنه { ثَمَناً قَلِيلاً } من متاع الدنيا\n مثل أخذ الرشاوى وإبقاء الرئاسة { أُوْلَـٰئِكَ } المستبدلون الخاسرون هم الذين { لاَ خَلاَقَ } لا نصيب ولا حظ { لَهُمْ فِي } النشأة { ٱلآخِرَةِ } التي هي دار الوصول والقرار { وَلاَ يُكَلِّمُهُمُ ٱللَّهُ } تكليمه من استخلفه عن مقتضيات جميع أسمائه الحسنى وصفاته العليا { وَلاَ يَنظُرُ إِلَيْهِمْ يَوْمَ ٱلْقِيَامَةِ } بنظر الرحمة حتى ينعكس بروق أنواع الوحدة الذاتية المتلأئمة المشعشعة من عالم العماء التي هي السواد الأعظم المشار إليه في الحديث النبوي - صلوات الله على قائله - على مرائي قلوبهم { وَلاَ يُزَكِّيهِمْ } ولا يثني عليهم ولا يلتفت إليهم حين ثنائه\n\n\nوالتفاته على خلَّص عباده المستصقلين مرايا قلوبهم عن صداء الالتفات إلى الغير مطلقاً\n لينعكس فيها أشعة التجليات الجمالية والجلالية اللطفية والقهرية\n حتى تعتدلوا وتستقيموا على الصراط المستقيم الذي هو صراط توحيد الله { وَلَهُمْ } في تلك الحالة { عَذَابٌ } طرد وخذلان { أَلِيمٌ } [آل عمران: 77] مؤلم لا إيلام أعظم منه\n إذ حرمان الوصول إلى غاية ما يترتب على الوجود والحصول من أشد المؤلمات والمؤذيات\n\n\nنعوذ بالله من غضب الله\n لا حول إلا بالله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إن الذين يشترون بعهد الله } أي: يستبدلون بالوفاء بعهد الله كالإيمان بالرسول - عليه الصلاة والسلم - الذي أخذ على بني إسرائيل في التوراة وبيان صفته، وأداء الأمانة، فكتموا ذلك واستبدلوا به { ثمناً قليلاً } حطاماً فانياً من الدنيا، كانوا يأخذونه من سفلتهم، فخافوا إن بيَّنوا ذلك زال ذلك عنه، وكذلك الأيمان التي أخذها الله عليهم لئن أدركوا محمداً صلى الله عليه وسلم ليؤمنن به ولينصرنه، فنقضوها، خوفاً من زوال رئاستهم، فاستبدلوا بالوفاء بها ثمناً فانياً، { أولئك لا خلاق لهم } أي: لا نصيب لهم، { في الآخرة، ولا يكلمهم الله } بما يسرهم، أو بشيء أصلاً، وإنما الملائكة تسألهم، { ولا تنظر إليهم يوم القيامة } نظرة رحمة، بل يعرض عنهم، غضباً عليهم وهواناً بهم، { ولا يزكيهم } لا يطهرهم من ذنوبهم، أو لا يُثني عليهم، { ولهم عذاب أليم } أي: موجع. قال عكرمة: نزلت في أبي رافع وكنانة بن أبي الحقيق وحُيي بن أخطب، وغيرهم من رؤساء اليهود، كتموا ما عهد الله إليهم في التوراة في شأن النبيّ صلى الله عليه وسلم من بيان صفته، فكتموا ذلك وكتبوا غيره، وحلفوا أنه من عند الله، لئلا يفوتهم الرشا من أتباعهم. وقال الكلبي: إن ناساً من علماء اليهود كانوا ذا حظ من علم التوراة، فأصابتهم سنة، فأتوا كعب بن الأشرف يستميرونه، أي: يطلبون منه الميرة - وهو الطعام -، فقال لهم كعب: هل تعلمون أن هذا الرجل رسول في كتابكم؟ قالوا: نعم، أو ما تعلمه أنت؟ قال: لا، قالوا: فإنا نشهد أنه عبد الله ورسوله، قال كعب: لقد قدمتم عليَّ، وأنا أريد أن أميركم وأكسوكم، فَحَرَمَكُم الله خيراً كثيراً، قالوا: فإنه شُبه لنا، فرُوَيْداً حتى نلقاه، فانطلقوا، فكتبوا صفة غير صفته، ثم أتوا نبيّ الله - عليه الصلاة والسلام - فكلموه، ثم رجعوا إلى كعب، فقالوا: قد كنا نرى أنه رسول الله، فأتيناه فإذا هو ليس بالنعت الذي نُعت لنا، وأخرجوا الذي كتبوه، ففرح كعب، ومارهم. فنزلت الآية. قلت: انظر الطمع، وما يصنع بصاحبه‍ والعياذ بالله. وقيل: نزلت في رجل أقام سلعته في السوق، وحلف لقد أعطى فيها كذا وكذا، وقيل: نزلت في الأشعث بن قيس، كانت بينه وبين رجل خصومة، فتوجهت اليمين على الرجل، فأراد أن يحلف. والله تعالى أعلم. الإشارة: قد أخذ الله العهد على الأرواح ألا يعبدوا معه غيره، ولا يميلوا إلى شيء سواه، فكل من مال إلى شيء، أو ركن بالمحبة إلى غير الله، فقد نقض العهد مع الله، فلا نصيب له في مقام المعرفة، ولا تحصل له مشاهدة ولا مكالمة حتى يثوب ويتوجه بكليته إلى مولاه. والله - تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:95",
      "similarity": 0.7298325210329664
    },
    {
      "verse": "2:174",
      "similarity": 0.6532275793389412
    },
    {
      "verse": "9:9",
      "similarity": 0.5731000124539355
    },
    {
      "verse": "2:79",
      "similarity": 0.5495973787452778
    },
    {
      "verse": "2:41",
      "similarity": 0.5277965113828392
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003077.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003077.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}