{
  "chapter": "آل عمران",
  "text": "وان منهم لفريقا يلون السنتهم بالكتب لتحسبوه من الكتب وما هو من الكتب ويقولون هو من عند الله وما هو من عند الله ويقولون على الله الكذب وهم يعلمون",
  "translations": [
    {
      "translation": "Among them is a group who distort the Book with their tongues so that you think it is from the Book when it is not from the Book. They say, 'It is from Allah,' but it is not from Allah. They tell a lie against Allah and they know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them is a section which distorts in reading the Scripture in a way that though it sounds like the Scripture, in fact it is not; yet they say it is from God, when they know it is not; and they lie about God, and knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is a party among them who twist their tongues while reciting the Book to make you think that it is part of the Book when in fact it is not. They say: 'It is from Allah', when in fact it is not from Allah. They falsely fix a lie upon Allah, and do so wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A group among the People of the Book when reading the Bible, deliberately mispronounce words in order to change their meaning, try to show that what they have read is from the true Bible. In fact, what they have read is not from the true Bible. They say, \"What we read is from God.\" In reality, it is not from God. They knowingly ascribe false statements to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And amongst them are some who distort (change words of) the Book with their tongues, so that you may think that this also is in the Book whereas it is not in the Book; and they say, “This is from Allah” whereas it is not from Allah; and they fabricate lies against Allah, whereas they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, among them is a party who distort the Book with their tongues, so that you may think it is from the Book, but it is not from the Book, and they say: This is from Alla0h, but it is not from Alla0h؛ and they speak a lie against Alla0h while they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely there is a party amongst those who distort the Book with their tongue that you may consider it to be (a part) of the Book, and they say, It is from Allah, while it is not from Allah, and they tell a lie against Allah whilst they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is a sect of them twist their tongues with the Book, that you may suppose it part of the Book, yet it is not part of the Book; and they say, 'It is from God,' yet it is not from God, and they speak falsehood against God, and that wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! there is a party of them who distort the Scripture with their tongues, that ye may think that what they say is from the Scripture, when it is not from the Scripture. And they say: It is from Allah, when it is not from Allah; and they speak a lie concerning Allah knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who distort the Book by the way they speak to make you think that what they say is from the Book, whereas it is not. They say it is from God whereas it is not. Thus they tell a lie about God and they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily among them, are a party who pervert the Book with their tongues, that ye might deem it of the Book whereas it is not of the Book. And they say it is from God; whereas it is not from Allah, and they forge a lie against Allah while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a group of them who alter their voice while reading out a text [that they have themselves authored], so that you may suppose it to be from the Book, though it is not from the Book, and they say, ‘It is from Allah,’ though it is not from Allah, and they attribute lies to Allah, and they know [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is among them a section who distort the Book with their tongues: (As they read) you would think it is a part of the Book, but it is no part of the Book; and they say, \"That is from Allah,\" but it is not from Allah: It is they who tell a lie against Allah, and (well) they know it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, among them is a party who distort the Book with their tongues (as they read), so that you may think it is from the Book, but it is not from the Book, and they say: \"This is from Allah,\" but it is not from Allah; and they speak a lie against Allah while they know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is a sect among them who twist their tongues with the Book, so you will think it is from the Book, whereas it is not from the Book. They say: 'This is from Allah' whereas it is not from Allah. And they knowingly tell lies against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who twist the Scripture with their tongues, that you may think it from the Scripture, when it is not from the Scripture. And they say, “It is from God,” when it is not from God. They tell lies and attribute them to God, knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, there is among them a party who alter the Scripture with their tongues so you may think it is from the Scripture, but it is not from the Scripture. And they say, \"This is from Allah,\" but it is not from Allah. And they speak untruth about Allah while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:78] And there is a group, a party, of them, the People of the Scripture, like Ka‘b b. al-Ashraf, who twist their tongues with the Book, altering it by reciting it not according to the way in which it was revealed, but according to the way in which they have distorted it, as in the case of the descriptions of the Prophet (s) and other similar matters; so that you may suppose it, such distortion, as part of the Book, that God revealed; yet it is not part of the Book; and they say, ‘It is from God’, yet it is not from God, and they speak falsehood against God, while they know, that they are liars.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Lo! there is) of the Jews (a party of them) Ka'b and his fellow men (who distort the Scripture with their tongues) by reading the traits of the anti-Christ in their Scripture, (that ye may think) that the lowly may think (that what they say is from the Scripture, when it is not from the Scripture. And they say: It is from Allah) in the Torah, (when it is not from Allah) in the Torah; (and they speak a lie concerning Allah knowingly) fully aware that this is not in their Scripture.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَلْوُونَ أَلْسِنَتَهُمْ بِٱلْكِتَابِ } معناهُ يُقَلِبُونَها ويُحْرِّفُونها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّ مِنْهُمْ } لغاية بغضهم وعداوتهم مع النبي صلى الله عليه وسلم { لَفَرِيقاً } جماعة وفئة من المحرفين الذين يحرفون اسمه ونعته في التوراة، يقصدون تشهير المحرف وترويجه على ضعفاء العوام، إضلالاً لهم حيث { يَلْوُونَ } يطلقون { أَلْسِنَتَهُمْ } بالمحرف إطلاقهم { بِٱلْكِتَابِ لِتَحْسَبُوهُ } أي: ليظن السامعون أنه { مِنَ ٱلْكِتَابِ وَ } الحال أنه { مَا هُوَ مِنَ الْكِتَابِ } المنزل لا نصاً ولا أخذاً ولا تأويلاً { وَ } مع ذلك يفترون { يَقُولُونَ هُوَ } المحرَّف منزل { مِنْ عِنْدِ اللًّهِ وَ } الحال أنه { مَا هُوَ مِنْ عِندِ ٱللَّهِ } بل من تسويلات نفوسهم الخبيثة، والباعث عليها أهويتهم الباطلة من حب الجاه والرئاسة { وَ } لترويج { يَقُولُونَ } فيه ينسبون { عَلَى ٱللَّهِ ٱلْكَذِبَ } افتراء { وَهُمْ } في ضمائرهم وبواطنهم { يَعْلَمُونَ } [آل عمران: 78] يقيناً أنه فرية صدرت عنهم؛ مكابرة وعناداً\n\n\n\n\nومع ادعائهم الإيمان والتوحيد والكتاب والرسل، وحصرهم الدين والشريعة على دينهم وشروعهم، لم يتفطنوا ولم يعلموا أن البشر و إن أُرسل وأُنزل وخُصص بفضائل جليلة وخصائل جميلة، لكن لا ينسلخ عن لوازم البشرية مطلقاً، حتى يتصف بالألوهية، بل لا يزال البعد عبداً والرب رباً\n\n\n\n\nغاية ما في الباب أن الأشخاص البشرية في التجريد عن لوازمها تتفاوت، فمن كان تجريده أكثر كان إلى الله أقرب، وإلى الفناء أميل، وإلى البقاء أشوق، وإلا فالسلوك لا ينقطع أبد الآبدين، كما قال صلى الله عليه وسلم في الحديث القدسي عن الله عز وجل:\n\n \" ألا طال شوق الأبرار إلى لقائي \" \n\nما للعباد ورب الأرباب، فعيسى - صلوات الرحمن عليه - وإن ارتفع قدره وعلت رتبته عند الله، وأظهر بنصر الله خوارق خلت عنها الأنبياء - عليهم السلام - لكن لا ينسلخ عن لوازم البشرية مطلقاً، وهم يدعون انسلاخه ويعبدونه كعبادته سبحانه وتعالى، وينسبونه إلى الله بالنبوة - والعياذ بالله - وما قدروا الله حق قدره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وإن من أهل الكتاب لفريقاً } ، وهو كعب بن الأشرف، وحيي بن أخطب، ومالك بن الصيف، وأبو ياسر، وشعبة بن عامر، { يلوون } أي: يفتلون { ألسنتهم بالكتاب } أي: التوراة عند قراءته، فيميلون عن المنزل إلى المُحرف، { لتحسبوه من الكتاب } أي: لتظنوا أن ذلك المحرف من التوراة، { وما هو من الكتاب ويقولون هو من عند الله وما هو من عند الله ويقولون على الله الكذب } فيما نسبوا إليه، { وهم يعلمون } أنه ليس من عند الله\n قال ابن عباس: نزلت في اليهود والنصارى جميعاً، حرفوا التوراة والإنجيل، وألحقوا به ما ليس منه، وأسقطوا منه الدين الحنيف، فبيَّن الله كذبهم، وقيل: في الرجم، حيث كتموا الرجم، وألقى قارئ التوراة يده على آية الرجم، وقرأ ما حولها، فقال له ابنُ سلام: ارفع يديك، فإذا آية الرجم تلوح\n والله أعلم\n الإشارة: هذه الآية تنسحب على علماء السوء، الذي يفتون بغير المشهور، لحظ يأخذونه من الدنيا، وعلى قضاة الجور الذين يحكمون بالهوى، ويعتمدون على الأقوال الواهية، ويقولون هو من عند الله، وما هو من عند الله\n وكذلك بعض المنتسبين من الفقراء، يتصنعون إلى العامة، يطمعون فيما في أيديهم من الحطام، فيظهرون لهم علوماً ومعارف وحكماً، يلوون ألسنتهم بها وقلوبهم خاوية من معناها، فظاهر حالهم يُوهم أن ذلك موافق لقلوبهم، وأنهم عاملون بذلك، وباطنهم يكذبهم في ذلك،\n",
      "translations": []
    }
  ]
}