{
  "chapter": "آل عمران",
  "text": "ما كان لبشر ان يؤتيه الله الكتب والحكم والنبوة ثم يقول للناس كونوا۟ عبادا لى من دون الله ولكن كونوا۟ ربنين بما كنتم تعلمون الكتب وبما كنتم تدرسون",
  "translations": [
    {
      "translation": "It is not right for any human being that Allah should give him the Book and Judgement and Prophethood, and then that he should say to people, 'Be worshippers of me rather than Allah.' Rather he will say, 'Be people of the Lord because of your knowledge of the Book and because you study.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a mortal to whom God reveals the Book and the judgement and the prophethood to say to the people: \"Be my votaries instead of God's,\" but (to say): \"Become learned in divine law, by virtue of teaching and studying the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not befit a man that Allah should grant him His Book and sound judgement and prophet-hood, and thereafter he should say to men: 'Become servants to me apart from Allah.' He would rather say: 'Become dedicated men of Allah, in accord with the dictates of the Book you have been teaching and studying.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God would never give the Book, authority, or prophesy to any person who would tell others to be his servants instead of being the servants of God. He would rather tell them to worship God for they had been teaching and studying the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any human to whom Allah has given the Book and wisdom and Prophethood, that he should afterwards say to the people, “Leave (the worship of) Allah and be my worshippers” – but he will surely say, “Be sincere worshippers of Allah, because you teach the Book and you preach from it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (possible) for any human being to whom Allah has given the Book and Al-Hukm and prophethood to say to the people: \"Be my worshippers rather than Allah's.\" On the contrary (he would say): \"Be you Rabbaniyyun, because you are teaching the Book, and you are studying it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not meet for a mortal that Allah should give him the Book and the wisdom and prophethood, then he should say to men: Be my servants rather than Allah's; but rather (he would say): Be worshippers of the Lord because of your teaching the Book and your reading (it yourselves).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It belongs not to any mortal that God should give him the Book, the Judgment, the Prophethood, then he should say to men, 'Be you servants to me apart from God.' Rather, 'Be you masters in that you know the Book, and in that you study.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (possible) for any human being unto whom Allah had given the Scripture and wisdom and the prophethood that he should afterwards have said unto mankind: Be slaves of me instead of Allah; but (what he said was): Be ye faithful servants of the Lord by virtue of your constant teaching of the Scripture and of your constant study thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one to whom God has given the Scriptures and on whom He has bestowed wisdom and prophethood would say to men, \"Worship me instead of God.\" [He would say rather], \"Be devoted servants of God, for you have taught and studied the Scriptures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not Possible for a human being unto whom Allah hath vouchsafed the Book and Wisdom and prophethood that he should thereafter say unto men: be ye worshippers of me, beside Allah; but be ye faithful servants of the Lord, seeing that ye are wont to teach the Books and seeing that ye are wont to exercise yourselves therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not behoove any human that Allah should give him the Book, judgement and prophethood, and then he should say to the people, ‘Be my servants instead of Allah.’ Rather [he would say], ‘Be a godly people, because of your teaching the Book and because of your studying it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (possible) that a man, to whom is given the Book, and Wisdom, and the prophetic office, should say to people: \"Be ye my worshippers rather than Allah's\": on the contrary (He would say) \"Be ye worshippers of Him Who is truly the Cherisher of all: For ye have taught the Book and ye have studied it earnestly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (possible) for any human being to whom Allah has given the Book and Al-Hukma (the knowledge and understanding of the laws of religion, etc.) and Prophethood to say to the people: \"Be my worshippers rather than Allah's.\" On the contrary (he would say): \"Be you Rabbaniyun (learned men of religion who practise what they know and also preach others), because you are teaching the Book, and you are studying it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No human to whom Allah has given the (Holy) Book, Judgement and Prophethood would say to the people: 'Be worshipers of me, other than Allah' But rather, 'Be of the Lord, for that you teach the Book, and in that you have studied'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No person to whom God has given the Scripture, and wisdom, and prophethood would ever say to the people, “Be my worshipers rather than God’s.” Rather, “Be people of the Lord, according to the Scripture you teach, and the teachings you learn.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a human [prophet] that Allah should give him the Scripture and authority and prophethood and then he would say to the people, \"Be servants to me rather than Allah,\" but [instead, he would say], \"Be pious scholars of the Lord because of what you have taught of the Scripture and because of what you have studied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:79] When the Christians of Najrān claimed that Jesus had commanded them to take him as a Divinity, and some   Muslims asked that they should be permitted to prostrate themselves before him, the Prophet (s), the following was revealed: It belongs not to any mortal that God should give him the Book, the Judgement, the understanding of the Divine Law, prophethood, then that he should say to men, ‘Be servants to me instead of God.’ Rather, he should say, ‘Be masters, scholars, labouring (rabbāniyyūn, ‘those of the Lord’, is derived from rabb, ‘lord’, with the extra alif and nūn, as a superlative [of rabbiyyūn]), by virtue of what you know (ta‘lamūn, also read as tu‘allimūn, ‘you teach’) of the Book and in what you study’, that is, on account of the fact that you used to do this, for its benefit is that you engage in action.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah said as regards their claim that they follow the Religion of Abraham and that Abraham commanded them to follow this Religion: (It is not (possible) for any human being) among the prophets (unto whom Allah had given the Scripture and wisdom) understanding (and the prophethood that he should afterwards have said unto mankind: Be slaves of me instead of Allah; but (what he said was): Be you faithful servants of the Lord) men of knowledge, people of understanding as well as people who put what they learn into practice (by virtue of your constant teaching of the Scripture) from the Scripture; it is also said that this means: by virtue of your knowledge of the Scripture (and of your constant study thereof) of your reading from the Scripture.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كُونُواْ رَبَّـٰنِيِّينَ } معناهُ حُلماءُ وعُلماءُ تُعَلِمُونَ النَّاسَ الخَيرَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Be submissive to Me,\" means that you should be patient and knowledgeable, teaching people what is good.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك رد الله عليهم على سبيل التنبيه والتعليم بقوله: { مَا كَانَ } أي: ما صح وجاز { لِبَشَرٍ } خصَّه لرسالته ونيابته { أَن يُؤْتِيهُ ٱللَّهُ } ينزله { ٱلْكِتَٰبَ } المبين له الشرائع { وَٱلْحُكْمَ } المحفوظ فيها\n المتعلق بأحوال العباد في معاشهم { وَٱلنُّبُوَّةَ } المقتبسة منها\n المتعلقة بأحوالهم في معادهم { ثُمَّ } بعدما اصطفاه الله واختاره بالتشريف الأتم الأكمل { يَقُولَ لِلنَّاسِ } المرسل إليهم تجبراً واستكباراً: { كُونُواْ عِبَاداً لِّي } اعبدوني عبادة خاصة { مِن دُونِ } عبادة { ٱللَّهِ } وما هي إلا شرك غليظ\n كيف صدر أمثال هذه الهذيانات من مشكاة النبوة\n تعالى عما يقول الظالمون علواً كبيراً { وَلَـٰكِن } قولهم وأمرهم عليهم هو كذا: { كُونُواْ } أيها الموحدون { رَبَّـٰنِيِّينَ } مخلصين\n ولا تكونوا شياطنيين مشركين { بِمَا كُنتُمْ تُعَلِّمُونَ } أي: تعلمون أنتم من { ٱلْكِتَٰبَ } من أمور دينكم { وَبِمَا كُنْتُمْ تَدْرُسُونَ } [آل عمران: 79] تعلمونه لغيركم من تلامذتكم\n وما يأمر ويوحي الأنبياء إلا مثل هذا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: البشر: اسم جمع لا مفرد له\n يطلق على الجماعة والواحد\n والرباني: هو الذي يُربي الناس ويؤدبهم ويُهذبهم بالعلم والعمل\n وقال ابن عباس: هو الذي يُربي الناس بصغار العلم قبل كباره\n والنون فيه للمبالغة\n كلحياني ورقباني",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:37",
      "similarity": 0.8412708000784818
    },
    {
      "verse": "34:44",
      "similarity": 0.8345820863448933
    },
    {
      "verse": "6:105",
      "similarity": 0.7698810664267648
    },
    {
      "verse": "6:156",
      "similarity": 0.7450411631788848
    },
    {
      "verse": "7:169",
      "similarity": 0.5914088019647555
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003079.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003079.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:79.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}