{
  "chapter": "آل عمران",
  "text": "ولا يامركم ان تتخذوا۟ الملئكة والنبين اربابا ايامركم بالكفر بعد اذ انتم مسلمون",
  "translations": [
    {
      "translation": "He will surely not bid you make the angels and the prophets your lords. Would he order you disbelief after you have submitted (and accepted the law of God)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will never enjoin you to take the angels or Prophets for your lords. Will he enjoin upon you unbelief when you have submitted yourselves to Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Prophet would never order you to take the angels and the Prophets as your Lords. Would he order you to disbelieve after you have submitted yourselves to God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nor will he command you to appoint the angels and the Prophets as Gods; would he (a Prophet) command you to disbelieve after you have become Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would he order you to take angels and Prophets for lords. Would he order you to disbelieve after you have submitted to Allah's will\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And neither would he enjoin you that you should take the angels and the prophets for lords; what! would he enjoin you with unbelief after you are Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would never order you to take the angels and the Prophets as Lords; what, would He order you to disbelieve, after you have surrendered?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he commanded you not that ye should take the angels and the prophets for lords. Would he command you to disbelieve after ye had surrendered (to Allah)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would he enjoin you to take the angels and the prophets as your lords; how could he command you to be disbelievers after you have submitted to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he would not command you that ye should take the angels and the prophets for lords. Would he command you to infidelity after ye are become Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he would not command you to take the angels and the prophets for lords. Would he call you to unfaith after you have submitted [to Allah]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would he instruct you to take angels and prophets for Lords and patrons. What! would he bid you to unbelief after ye have bowed your will (To Allah in Islam)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would he order you to take angels and Prophets for lords (gods). Would he order you to disbelieve after you have submitted to Allah's Will? (Tafsir At-Tabari).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would he order you to take the angels and the Prophets for lords, what, would he order you with disbelief after you were submitters (Muslims)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would he command you to take the angels and the prophets as lords. Would he command you to infidelity after you have submitted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor could he order you to take the angels and prophets as lords. Would he order you to disbelief after you had been Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:80] He would never order you (read lā ya’murukum, to denote a new clause, meaning ‘God [would not order you]’; or if read lā ya’murakum, it would be a supplement to yaqūla, ‘he should say’, meaning ‘[it belongs not that…] a mortal [should order you]’); to take the angels and the prophets as lords, in the way that the Sabaeans have taken the angels, the Jews, Ezra, and the Christians, Jesus. Would He order you to disbelieve, after you have submitted? He would not do this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he commanded you) people of the Quraysh, Jews and Christians (not that ye should take the angels) as daughters of Allah (and the Prophets for lords. Would he command you to disbelieve) how could Abraham command you to follow disbelief (after ye had surrendered (to Allah)) after he commanded you to follow Islam (completely Surrendering to Allah), saying to you: (Lo! Allah hath chosen for you the (true) Religion; therefore die not save as men who have surrendered [2:132]). Allah says here: Allah has not sent a Messenger except that He commanded him to follow Islam and not Judaism, Christianity or the worship of idols, as these unbelievers claim. It is also said that this verse was revealed about the claims of the Jews that Muhammad commanded them to love him and worship him as the Christians worshipped Jesus. The Christians and idolaters also made the same claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يَأْمُرَكُمْ } نبيكم إضلالاً لكم مع كونه هداياً { أَن تَتَّخِذُواْ ٱلْمَلاَئِكَةَ وَٱلنَّبِيِّيْنَ } المرسلين لكم من عد الله بوسيلة الملائكة { أَرْبَاباً } آلهة موجودين أصالة غير الله { أَيَأْمُرُكُم } أتظنون أن يأمركم النبي المرسل لهدايتكم إلى طريق التوحيد { بِٱلْكُفْرِ } بالشرك { بَعْدَ إِذْ أَنْتُمْ مُّسْلِمُونَ } [آل عمران: 80] موحدون برسالته، أفلا تعقلون؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا يأمركم } ذلك البشر الذي خصه الله بالنبوة، { أن تتخذوا الملائكة والنبيين أرباباً } من دون الله، { أيأمركم بالكفر بعد إذ أنتم مسلمون } أي: مناقدون لأحكام الله\n قيل: سبب نزول الآية: أن نصارى نجران قالوا: يا محمد تريد أن نعبدك ونتخذك ربّاً؟ فقال النبيّ صلى الله عليه وسلم:\n\n \" معاذ الله أن نعبد غيرَ الله، أو نَأمُرَ بعبادة غيره \" \n\nوقيل: إن رجلاً قال: يا رسول الله: نُسلِّم عليك كما يُسلِّم بعضُنا على بعض، أفلا نسجُد لك؟ فقال:\n\n \" لا يَنْبَغِي أن يسجد أحدٌ لأحدٍ من دُونِ اللهِ، ولكنْ أكْرِموا نَبِيَّكُمْ، واعْرِفُوا الحقَّ لأَهْلِه \"\n \n\nالإشارة: ما زال الفقراء يعظمون أشياخهم، ويبالغون في ذلك حتى يُقبِّلون أرجلهم والترابَ بين أيديهم، ويجتهدون في خدمتهم، فإذا رءاهم الأشياخ فعلوا ذلك سكتوا عنهم، لأن ذلك هو ربحهم وسبب فتحهم، وفي ذلك قال القائل:\n",
      "translations": []
    }
  ]
}