{
  "chapter": "آل عمران",
  "text": "افغير دين الله يبغون وله اسلم من فى السموت والارض طوعا وكرها واليه يرجعون",
  "translations": [
    {
      "translation": "Is it other than the deen of Allah that you desire, when everything in the heavens and earth, willingly or unwillingly, submits to Him and to Him you will be returned?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek another way than God's? But whosoever is in the heavens and the earth is submissive to God and obedient (to Him), by choice or constraint, and will be returned to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they now seek a religion other than prescribed by Allah even though all that is in the heavens and the earth is in submission to Him - willing or unwillingly - and to Him all shall return?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they want a religion other than the religion of God when all that is in the heavens and the earth have submitted themselves to His will, either by their own free will or by force? To God do all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they desire a religion other than the religion of Allah, whereas to Him has submitted whoever is in the heavens and the earth, willingly or grudgingly, and it is to Him they will return?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek other than the religion of Allah, while to Him submitted all creatures in the heavens and the earth, willingly or unwillingly. And to Him shall they all be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it then other than Allah's religion that they seek (to follow), and to Him submits whoever is in the heavens and the earth, willingly or unwillingly, and to Him shall they be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do they desire another religion than God's, and to Him has surrendered whoso is in the heavens and the earth, willingly or unwillingly, and to Him they shall be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek they other than the religion of Allah, when unto Him submitteth whosoever is in the heavens and the earth, willingly or unwillingly, and unto Him they will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek a religion other than the religion of God, when everything in the heavens and the earth has submitted to Him, willingly or unwillingly? To Him they shall all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek they then other than the religion of Allah Whereas unto Him hath submitted whosoever is in the heavens and the earth willingly or unwillingly, and unto Him shall they all be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek a religion other than that of Allah, while to Him submits whoever there is in the heavens and the earth, willingly or unwillingly, and to Him they will be brought back?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek for other than the Religion of Allah?-while all creatures in the heavens and on earth have, willing or unwilling, bowed to His Will (Accepted Islam), and to Him shall they all be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek other than the religion of Allah (the true Islamic Monotheism worshipping none but Allah Alone), while to Him submitted all creatures in the heavens and the earth, willingly or unwillingly. And to Him shall they all be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they seeking a religion other than that of Allah, and to Him whosoever is in the heavens and the earth has submitted willingly and unwillingly. To Him they shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they desire other than the religion of God, when to Him has submitted everything in the heavens and the earth, willingly or unwillingly, and to Him they will be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is it other than the religion of Allah they desire, while to Him have submitted [all] those within the heavens and earth, willingly or by compulsion, and to Him they will be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:83] What! Do they, the ones who turn away, desire (yabghūna, is also read tabghūna, ‘[do] you desire?’) other than God’s religion, when to Him has submitted, [to Him] has yielded, whoever is in the heavens and the earth, willingly, without refusal, or unwillingly, by the sword and by seeing what it [such refusal] results in, and to Him they shall be returned? (yurja‘ūna, may also be read turja‘ūna, ‘you shall be returned’; the hamza at the beginning of the verse [a-fa-ghayra, ‘what…other’] denotes a disavowal).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتفريع عن التذكير بما كان عليه الأنبياء .والاستفهام للتوبيخ والتحذير .وقرأه الجمهور { تبغون } بتاء الخطاب فهو خطاب لأهل الكتاب جارٍ على طريقة الخطاب في قوله آنفاً : { ولا يأمركم أن تتخذوا الملائكة } \\[ آل عمران : 80 \\] وقرأه أبو عَمرو ، وحفص ، ويعقوب : بياء الغيبة فهو التفات من الخطاب إلى الغيبة ، إعراضاً عن مخاطبتهم إلى مخاطبة المسلمين بالتعجيب من أهل الكتاب . وكله تفريع ذكر أحوال خلَف أولئك الأمم كيف اتبعوا غير ما أخذ عليهم العهد به . والاستفهام حينئذ للتعجيب .ودين الله هو الإسلام لقوله تعالى : { إن الدين عند الله الإسلام } \\[ آل عمران : 19 \\] وإضافته إلى الله لتشريفه على غيره من الأديان ، أو لأنّ غيره يومئذ قد نسخ بما هو دين الله .ومعنى { تبغون } وتطلبون يقال بَغى الأمرَ يبغيه بُغَاء بضم الباء وبالمد ، ويقصر والبُغية بضم الباء وكسرها وهاء في آخره قيل مصدر ، وقيل اسم ، ويقال ابتغى بمعنى بغى ، وهو موضوع للطلب ويتعدّى إلى مفعول واحد . وقياس مصدره البغي ، لكنه لم يسمع البغي إلاّ في معنى الاعتداء والجور ، وذَلك فعلُه قاصر ، ولعلهم أرادوا التفرقة بين الطلب وبين الاعتداء ، فأماتوا المصدر القياسي لبَغَى بمعنى طلب وخصّوه ببغى بمعنى اعتدى وظلم : قال تعالى : { إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق } \\[ الشورى : 42 \\] ويقال تَبَغّى بمعنى ابتغى .وجملة { وله أسلَم } » حال من اسم الجلالة وتقدم تفسير معنى الإسلام لله عند قوله تعالى : { فقل أسلمتُ وجهي للَّه } \\[ آل عمران : 20 \\] .ومعنى { طوعاً وكرهاً } أنّ من العقلاء من أسلم عن اختيار لظهور الحق له ، ومنهم من أسلم بالجبلّة والفطرة كالملائكة ، أو الإسلام كرهاً هو الإسلام بعد الامتناع أي أكرهته الأدلة والآيات أو هو إسلام الكافرين عند الموت ورؤية سوء العاقبة ، أو هو الإكراه على الإسلام قبل نزول آية لاَ إكراه في الدين .والكرهُ بفتح الكاف هو الإكراه ، والكُره بضم الكاف المكروه .ومعنى { وإليه ترجعون } أنه يرجعكم إليه ففعل رجع المتعدّي أسند إلى المجهول . لظهور فاعله ، أي يرجعكم الله بعد الموت ، وعند القيامة ، ومناسبة ذكر هذا ، عقب التوبيخ والتحذير ، أنّ الربّ الذي لا مفر من حكمه لا يجوز للعاقل أن يعدل عن ديننٍ أمره به ، وحقه أن يسلم إليه نفسه مختاراً قبل أن يسلمها اضطراراً .وقد دل قوله : { وإليه ترجعون } على المراد من قوله : { وكرهاً } .وقرأ الجمهور : وإليه تُرجعون بتاء الخطاب ، وقرأه حفص بياء الغيبة .\n\n",
      "translations": [
        {
          "translation": "Allah then mentions the dispute of the Jews and Christians and the question which they put to the Prophet (pbuh) regarding who really follows the religion of Abraham. When the Prophet (pbuh) told them that they were both far from the Religion of Abraham, they said that they did not accept this judgement. Hence, Allah said: (Seek they) with you (other than the religion of Allah) Islam (complete surrender to Allah), (when unto Him submiteth) acknowledges Islam and Allah's divine Oneness (whosoever is in the heavens) of angels (and the earth) of believers, (willingly) the dwellers of the heavens willingly, (or unwillingly) the dwellers of the earth unwillingly. It is also said that this means: the sincere among the believers acknowledge this willingly while the hypocrites do so unwillingly; it is also said this means: those who are born Muslim acknowledge this willingly while those who were made to embrace Islam do so unwillingly, (and unto Him they will be returned) after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفَغَيْرَ دِينِ ٱللَّهِ } الذي هو التوحيد الذاتي { يَبْغُونَ } تطلبون أيها المعرضون الفاسقون { وَ } الحال أن { لَهُ أَسْلَمَ } انقاد وتذلل { مَن فِي ٱلسَّمَٰوَٰتِ } من أرباب الشهود والمكاشفات { وَ } من في { ٱلأَرْضِ } من أصحاب العلوم والمعاملات { طَوْعاً } تحقيقاً ويقيناً { وَكَرْهاً } تقليداً وتخميناً { وَإِلَيْهِ } لا إلى غيره { يُرْجَعُونَ } [آل عمران: 83] رجوع الظل إلى ذي ظل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أفغير }: مفعول مقدم، و { يبغون }: معطوف على محذوف، أي: أتتولون فتبغون غير دين الله، وقدم المعمول لأنه المقصود بالإنكار، و { طوعاً وكرهاً }: حالان، أي: طائعين أو كارهين. يقول الحقّ جلّ جلاله: للنصارى واليهود، لمَّا اختصموا إلى النبيّ صلى الله عليه وسلم، وادعوا أن كل واحد على دين إبراهيم، فقال لهم - عليه الصلاة والسلام:\n \" كِلاكما بَرِيءٌ مِنْ دِينه، وأنا على دِينه، فخذوا به \" \n، فغضبوا، وقالوا: والله لا نرضى بحكمك ولا نأخذ بدينك، فقال لهم الحقّ جلّ جلاله - منكراً عليهم -: أفتبغون غير دين الله الذي ارتضاه لخليله وحبيبه، وقد انقاد له تعالى { من في السماوات والأرض } طائعين ومكرهين، فأهل السموات انقادوا طائعين، وأهل الأرض منهم من انقاد طوعاً بالنظر واتباع الحجة أو بغيرها، ومنهم من انقاد كرهاً أو بمعاينة ما يُلجئ إلى الإسلام كنتق الجبل وإدراك الغرق والإشراف على الموت، أو: \" طوعاً \" كالملائكة والمؤمنين، فإنهم انقادوا لما يراد منهم طوعاً، { وكرهاً } كالكفار فانقادوا لما يراد منهم كرهاً، وكلٍّ إليه راجعون، لا يخرج عن دائرة حكمه، أو راجعون إليه بالبعث والنشور. والله تعالى أعلم. الإشارة: اعلم أن الدين الحقيقي هو الانقياد إلى الله في الظاهر والباطن، أما الانقياد إلى الله في الظاهر فيكون بامتثال أمره واجتناب نهيه، وأما الانقياد إلى الله في الباطن فيكون بالرضى بحكمه والاستسلام لقهره. فكل من قصَّر في الانقياد في الظاهر، أو تسخط من الأحكام الجلالية في الباطن، فقد خرج عن كمال الدين، فيقال له: أفغير دين الله تبغون وقد انقاد له { من في السماوات والأرض طوعاً وكرهاً } ، فإما أن تنقاد طوعاً أو ترجع إليه كرها. وفي بعض الآثار يقول الله تبارك وتعالى:\n \" منْ لم يَرْضَ بقضائي ولم يَصْبِرْ على بَلائِي، فليخرجْ من تحت سَمَائي، وليتخذْ ربّاً سِوَاي \". \nوسبب تبرّم القلب عن نزول الأحكام القهرية مرضُه وضعف نور يقينه، فكل من استنكف عن صحبة الطبيب، فله من هذا العتاب حظ ونصيب، فالأولياء حجة الله على العلماء، والعلماء حجة الله على العوام، فمن لم يستقم ظاهره عُوتب على تفريطه في صحبة العلماء، ومن لم يستقم باطنه عاتبه الله تعالى على ترك صُحبة الأولياء، أعني العارفين. وبالله التوفيق، وهو الهادي إلى سواء الطريق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:85",
      "similarity": 0.46471741868169836
    },
    {
      "verse": "40:14",
      "similarity": 0.45560070392542507
    },
    {
      "verse": "9:33",
      "similarity": 0.45109057569667566
    },
    {
      "verse": "61:9",
      "similarity": 0.45109057569667566
    },
    {
      "verse": "10:99",
      "similarity": 0.43289172525691244
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003083.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003083.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:83.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}