{
  "chapter": "آل عمران",
  "text": "قل ءامنا بالله وما انزل علينا وما انزل على ابرهيم واسمعيل واسحق ويعقوب والاسباط وما اوتى موسى وعيسى والنبيون من ربهم لا نفرق بين احد منهم ونحن له مسلمون",
  "translations": [
    {
      "translation": "Say, 'We have iman in Allah and what has been sent down to us and what was sent down to Ibrahim, Isma'il and Ishaq and Ya'qub and the Tribes, and what Musa and 'Isa and all the Prophets were given by their Lord. We do not differentiate between any of them. We are Muslims submitted to Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"We believe in God, and in what has been revealed to us, and in what had been sent down to Abraham and Ishmael and Isaac and Jacob and their offspring, and what had been revealed to Moses and to Jesus and to all other prophets by their Lord. We make no distinction between them, and we submit to Him and obey.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'We believe in Allah and what was revealed to us and what was revealed to Abraham and Ishmael and to Issac and Jacob and his descendents, and the teachings which Allah gave to Moses and Jesus and to other Prophets. We make no distinction between any of them and to Him do we submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"We believe in God and in that which has been revealed to us and in that which was revealed to Abraham, Ishmael, Isaac, Jacob, and their descendants. We believe in that which was given to Moses, Jesus, and the Prophets by their Lord. We make no distinction between them and we have submitted ourselves to the will of God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “We believe in Allah and what is sent down to us and what was sent down to Ibrahim, and Ismael, and Ishaq, and Yaqub (Jacob) and their sons, and that which came to Moosa and Eisa and the Prophets, from their Lord; we do not make any distinction, in belief, between any of them, and to Him we have submitted ourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"We believe in Allah and in what has been sent down to us, and what was sent down to Ibrahim, Isma`il, Ishaq, Ya`qub and Al-Asbat, and what was given to Musa, `Isa and the Prophets from their Lord. We make no distinction between one another among them and to Him (Allah) we have submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: We believe in Allah and what has been revealed to us, and what was revealed to Ibrahim and Ismail and Ishaq and Yaqoub and the tribes, and what was given to Musa and Isa and to the prophets from their Lord; we do not make any distinction between any of them, and to Him do we submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'We believe in God, and that which has been sent down on us, and sent down on Abraham and Ishmael, Isaac and Jacob, and the Tribes, and in that which was given to Moses and Jesus, and the Prophets, of their Lord; we make no division between any of them, and to Him we surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): We believe in Allah and that which is revealed unto us and that which was revealed unto Abraham and Ishmael and Isaac and Jacob and the tribes, and that which was vouchsafed unto Moses and Jesus and the prophets from their Lord. We make no distinction between any of them, and unto Him we have surrendered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"We believe in God and in what has been sent down to us and to Abraham, Ishmael, Isaac, Jacob and the Tribes. We believe in what has been given to Moses, Jesus and the prophets from their Lord. We make no distinction between any of them. It is to Him that we have surrendered ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: we believe in Allah and in that which is sent down unto us, and that which was sent down unto Ibrahim and Isma'il and Is-haq and Ya'qub and the tribes, and that which was vouchsafed unto Musa and 'Isa and other prophets from their Lord: we differentiate not between any of them, and unto Him we are submistive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘We have faith in Allah and in what has been sent down to us, and what was sent down to Abraham, Ishmael, Isaac, Jacob and the Tribes, and that which Moses, Jesus and the prophets were given by their Lord. We make no distinction between any of them, and to Him do we submit.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"We believe in Allah, and in what has been revealed to us and what was revealed to Abraham, Isma'il, Isaac, Jacob, and the Tribes, and in (the Books) given to Moses, Jesus, and the prophets, from their Lord: We make no distinction between one and another among them, and to Allah do we bow our will (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"We believe in Allah and in what has been sent down to us, and what was sent down to Ibrahim (Abraham), Isma'il (Ishmael), Ishaque (Isaac), Ya'qub (Jacob) and Al-Asbat [the twelve sons of Ya'qub (Jacob)] and what was given to Musa (Moses), 'Iesa (Jesus) and the Prophets from their Lord. We make no distinction between one another among them and to Him (Allah) we have submitted (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'We believe in Allah and in what is sent down to us and in that which was sent down to Abraham, Ishmael, Isaac, Jacob and the tribes, and in that which was given to (Prophets) Moses and Jesus, and the Prophets from their Lord. We do not differentiate between any of them. To Him we are submitters (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “We believe in God, and in what was revealed to us; and in what was revealed to Abraham, and Ishmael, and Isaac, and Jacob, and the Patriarchs; and in what was given to Moses, and Jesus, and the prophets from their Lord. We make no distinction between any of them, and to Him we submit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"We have believed in Allah and in what was revealed to us and what was revealed to Abraham, Ishmael, Isaac, Jacob, and the Descendants, and in what was given to Moses and Jesus and to the prophets from their Lord. We make no distinction between any of them, and we are Muslims [submitting] to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:84] Say, to them, O Muhammad (s): ‘We believe in God, and that which has been revealed to us, and that which has been revealed to Abraham and Ishmael, and Isaac and Jacob, and the Tribes, the latter’s sons; and in that which was given to Moses and Jesus, and the prophets, from their Lord; we make no division between any of them, by believing [in some] and disbelieving [in others]; and to Him we submit’, devoting worship sincerely [to Him].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then proceeds to explain the status of faith so that this serves for them as an indication to faith, saying: (Say) Muhammad: (We believe in Allah) alone without any partner (and that which is revealed unto us) and in that which the Qur'an has revealed to us (and that which was revealed unto Abraham) and we believe in Abraham and his Scripture (and Ishmael) and his Scripture (and Isaac) and his Scripture (and Jacob) and his Scripture (and the tribes) the Children of Jacob and their scriptures, (and that which was vouchsafed unto Moses) and we believe in Moses and his Scripture (and Jesus) and his Scripture (and the Prophets) and we believe in all the prophets and their scriptures (from their Lord. We make no distinction between any of them) we do not disbelieve in any of the prophets; it is also said this means: we do not disassociate any one of them from Allah in relation to prophethood and Islam, (and unto Him we have surrendered) we acknowledge His worship and divine Oneness and we are sincere to him in Religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل بلسان الجمع { آمَنَّا } أذعنَّا وأيقنَّا { بِٱللَّهِ } الواحد الأحد، المتفرد بالتحقيق والوجود { وَ } صدقنا { مَآ أُنزِلَ عَلَيْنَا } من عنده من الكتاب المبين لتوحيده { وَمَآ أُنزِلَ } أيضاً في سالف الزمان { عَلَىٰ } أسلافنا { إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَٱلأَسْبَاطِ } أولاد يعقوب وأحفاده { وَ } صدقنا أيضاً { مَا أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَٱلنَّبِيُّونَ } الموجودون الملهمون { مِن رَّبِّهِمْ } على مقتضى استعداداتهم { لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ } بالإطاعة والتصديق { وَ } كيف نفرق ونخصص؛ إذ { نَحْنُ } المتدينون بدين الله المتجلي في الآفاق { لَهُ } باعتبار تفرده وإحاطته وظهوره في المظاهر كلها بأوصافه وأسمائه بلا تفاوت { مُسْلِمُونَ } [آل عمران: 84] مؤمنون موقنون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:136",
      "similarity": 0.9977532201454643
    },
    {
      "verse": "2:140",
      "similarity": 0.764994638509063
    },
    {
      "verse": "2:133",
      "similarity": 0.5392863046235853
    },
    {
      "verse": "4:163",
      "similarity": 0.5219217648767417
    },
    {
      "verse": "38:45",
      "similarity": 0.402830710728088
    }
  ]
}