{
  "chapter": "آل عمران",
  "text": "ومن يبتغ غير الاسلم دينا فلن يقبل منه وهو فى الءاخرة من الخسرين",
  "translations": [
    {
      "translation": "If anyone desires anything other than Islam as a deen, it will not be accepted from him, and in the Next World he will be among the losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever seeks a way other than submission to God, it will not be accepted from him, and he will be a loser in the world to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever seeks a way other than this way a submission (Islam), will find that it will not be accepted from him and in the Life to come he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No religion other than Islam (submission to the will of God) will be accepted from anyone. Whoever follows a religion other than Islam will be lost on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one seeks a religion other than Islam, it will never be accepted from him; and he is among the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever seeks a religion other than Islam, it will never be accepted of him, and in the Hereafter he will be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever desires a religion other than Islam, it shall not be accepted from him, and in the hereafter he shall be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desires another religion than Islam, it shall not be accepted of him; in the next world he shall be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso seeketh as religion other than the Surrender (to Allah) it will not be accepted from him, and he will be a loser in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone seeks a religion other than Islam [submission to God], it will not be accepted from him; he will be among the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever will seek a religion other than Islam, it shall not be accepted of Him, and he shall be of the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should anyone follow a religion other than Islam, it shall never be accepted from him, and he will be among the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone desires a religion other than Islam (submission to Allah), never will it be accepted of him; and in the Hereafter He will be in the ranks of those who have lost (All spiritual good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever seeks a religion other than Islam, it will never be accepted of him, and in the Hereafter he will be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who chooses a religion other than Islam, it will not be accepted from him, and in the Everlasting Life he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever seeks other than Islam as a religion, it will not be accepted from him, and in the Hereafter he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever desires other than Islam as religion - never will it be accepted from him, and he, in the Hereafter, will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:85] The following was revealed regarding those who apostatized and became disbelievers: Whoever desires a religion other than Islam, it shall not be accepted from him and in the Hereafter he shall be among the losers, because he will end up in the Fire, made everlasting for him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso seeketh as religion other than the Surrender (to Allah) it will not be accepted from him, and he will be a loser in the Hereafter) he will be among the duped because he will miss Paradise and all that is in it and dwell in hell with all that is in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن يبتغ غير الإسلام ديناً } المراد من الإسلام ههنا: التوحيد الذي هو دين الله في قوله: { أَسْلَمْتُ وَجْهِي لله } وهو المذكور في الآية التي قبلها\n وما وصف شموله لجميع الأديان ويلزمه الانقياد التام الطوعي المذكور في فاصلة الآية بقوله:\n[البقرة: 133]\n { فلن يُقبل منه } لعدم وصول دينه إلى الحق تعالى لمكان الحجاب { وهو في الآخرة من الخاسرين } الذين خسروا باشترائهم أنفسهم وما حجبوا به بالحق\n { كيفَ يَهْدي الله قَوماً } إلى آخره\n أنكر هدايته تعالى لقوم قد هداهم أولاً بالنور الاستعدادي إلى الإيمان\n ثم بالنور الإيماني إلى أن عاينوا حقيّة الرسول صلى الله عليه وسلم وأيقنوا بحيث لم يبق لهم شك\n وانضمّ إليه الاستدلال العقليّ بالبينات ثم ظهرت نفوسهم بعد هذه الشواهد كلها بالعناد واللجاج وحجبت أنوار قلوبهم وعقولهم وأرواحهم الشاهدة ثلاثتها بالحق للحق لشؤم ظلمهم وقوّة استيلاء نفوسهم الأمّارة عليهم الذي هو غاية الظلم\n فقال: { والله لا يهدي القوم الظالمين } لغلظ حجابهم وتعمقهم في البعد عن الحق\n وقبول النور وهم قسمان: قسم رسخت هيئة استيلاء النفوس الأمّارة على قلوبهم فيهم وتمكنت وتناهوا في الغيّ والاستشراء\n وتمادوا في البعد والعناد\n حتى صار ذلك ملكة لا تزول\n وقسم لم يرسخ ذلك فيهم بعد ولم يصر على قلوبهم ريناً\n ويبقى من وراء حجاب النفس مسكة من نور استعدادهم عسى أن تتداركهم رحمة من الله وتوفيق\n فيندموا ويستحيوا بحكم غريزة العقول\n فأشار إلى القسم الأول بقوله: { إن الذين كفروا بعد إيمانهم } إلى آخره\n وإلى الثاني بقوله: { إلاّ الذين تابوا من بعد ذلك وأصْلَحوا } بالمواظبة على الأعمال والرياضات ما أفسدوا",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَبْتَغِ } يطلب ويتدين { غَيْرَ ٱلإِسْلاَمِ } المنزل على خير الأنام { دِيناً } وشريعة { فَلَنْ يُقْبَلَ مِنْهُ } يوم الدين القويم\n المستجمع لجميع الأديان\n الناسخ لها هو الإسلام\n لابتنائه على التوحيد الذاتي المسقط للإضافات والخصوصيات مطلقاً { وَهُوَ } أي: المتدين بغير دين الإسلام { فِي } النشأة { ٱلآخِرَةِ } وقت حصاد كل ما يزرعه في النشأة الأولى { مِنَ ٱلْخَاسِرِينَ } [آل عمران: 85] خسراناً مبيناً\n\n\nنعتصم بك من إنزال قهرك يا ذا القوة المتين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:83",
      "similarity": 0.46471741868169836
    },
    {
      "verse": "27:5",
      "similarity": 0.40918700661424584
    },
    {
      "verse": "11:22",
      "similarity": 0.3858125410067076
    },
    {
      "verse": "16:109",
      "similarity": 0.3858125410067076
    },
    {
      "verse": "103:2",
      "similarity": 0.36991144552780986
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/3:85.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/3:85.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/3:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}