{
  "chapter": "آل عمران",
  "text": "كيف يهدى الله قوما كفروا۟ بعد ايمنهم وشهدوا۟ ان الرسول حق وجاءهم البينت والله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "How can Allah guide a people who have become kafir after having had iman? They bore witness that the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can God show the way to those who, having come to faith, turned away, even though they had borne witness that the Messenger was true, and the clear signs had reached them? God does not show the unrighteous the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can Allah guide people who once believed, after they received clear signs and affirmed that the Messenger was a true one, lapsed into disbelief. Allah does not guide the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why would God guide a people who disbelieves after having had faith, who have found the Messenger to be truthful, and who have received authoritative evidence? God does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should Allah will guidance for the people who disbelieved, after their having accepted faith and bearing witness that the Noble Messenger is a true one, and after clear signs had come to them? And Allah does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who disbelieved after their belief and after they bore witness that the Messenger is true and after clear proofs came to them And Allah guides not the people who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who disbelieved after their believing and (after) they had borne witness that the Apostle was true and clear arguments had come to them; and Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall God guide a people who have disbelieved after they believed, and bore witness that the Messenger is true, and the clear signs came to them? God guides not the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who disbelieved after their belief and (after) they bore witness that the messenger is true and after clear proofs (of Allah's Sovereignty) had come unto them. And Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How would God bestow His guidance upon people who have opted for unbelief after having embraced the faith and having borne witness that this Messenger is true and [after] all evidence of the truth has come to them? For, God does not guide such wrongdoers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who disbelieved after their belief and after they bore witness that the apostle was true and after evidences had come unto them! And Allah guideth not a wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who have disbelieved after their faith and [after] bearing witness that the Apostle is true, and [after] manifest proofs had come to them? Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah Guide those who reject Faith after they accepted it and bore witness that the Messenger was true and that Clear Signs had come unto them? but Allah guides not a people unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who disbelieved after their belief and after they bore witness that the Messenger (Muhammad SAW) is true and after clear proofs had come unto them? And Allah guides not the people who are Zalimun (polytheists and wrong-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who lapse into disbelief after they believed and bore witness that the Messenger is true, and after receiving clear proofs! Allah does not guide the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How will God guide a people who disbelieved after having believed, and had witnessed that the Messenger is true, and the clear proofs had come to them? God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall Allah guide a people who disbelieved after their belief and had witnessed that the Messenger is true and clear signs had come to them? And Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:86] How shall God guide, that is to say, [He shall] not [guide], a people who have disbelieved after their belief, and bore witness, that is, [and after] their bearing witness, that the Messenger is true, and after the clear signs, the manifest proofs of the truth of the Prophet, had come to them? God guides not the evildoing, that is, the disbelieving, folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي يناسب ما سبقه من التنويه بشرف الإسلام .( وكيف ) استفهام إنكاري والمقصود إنكار أن تحصل لهم هداية خاصة وهي إما الهداية الناشئة عن عناية الله بالعبد ولطفه به ، وإسنادها إلى الله ظاهر؛ وإما الهداية الناشئة عن إعمال الأدلة والاستنتاج منها ، وإسنادُها إلى الله لأنّه موجد الأسباب ومسبّباتها . ويجوز أن يكون الاستفهام مستعملاً في الاستبعاد ، فإنهم آمنوا وعلموا ما في كتب الله ، ثمّ كفروا بعد ذلك بأنبيائهم ، إذ عبدَ اليهود الأصنام غير مرة ، وعبد النصارى المسِيح ، وقد شهدوا أنّ محمداً صادق لقيام دلائل الصدق ، ثم كابروا ، وشككوا الناس . وجاءتهم الآيات فلم يتعظوا ، فلا مطمع في هديهم بعد هذه الأحوال ، وإنما تسري الهداية لمن أنصف وتهيّأ لإدراك الآيات دون القوم الذين ظلموا أنفسهم . وقيل نزلت في اليهود خاصّة . وقيل نزلت في جماعة من العرب أسلموا ثم كفروا ولحقوا بقريش ثم ندموا فراسلوا قومهم من المسلمين يسألونهم هل من توبة فنزلت ، ومِنهم الحارث بن سويد ، وأبو عامر الراهب ، وطُعيمة بن أُبَيْرِق .وقوله : { وشهدوا } عطف على { إيمانهم } أي وشهادتهم ، لأنّ الاسم الشبيه بالفعل في الاشتقاق يحسن عطفه على الفعل وعطفُ الفعل عليه .\n\n",
      "translations": [
        {
          "translation": "(How shall Allah guide) to His religion (a people who disbelieved) in Allah (after their belief and (after) they bore witness that the messenger) Muhammad (is true and after clear proofs (of Allah's sovereignty)) the exposition of the Truth and the Book (had come unto them. And Allah guideth not wrong-doing folk) the idolaters and those who are not fit for His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مستفهماً مستبعداً على سبيل التوبيخ والتريع: { كَيْفَ يَهْدِي ٱللَّهُ } الهادي لعباده { قَوْماً كَفَرُواْ بَعْدَ إِيمَانِهِمْ } بوحدانية الله { وَ } بعد أن { شَهِدُوۤاْ } أقروا واعترفوا وصدقوا { أَنَّ ٱلرَّسُولَ } المبيِّن لهم طريق التوحيد\n المرشد إليه مرسل { حَقٌّ } من عند الله صادق في دعواه { وَ } مع ذلك { جَآءَهُمُ ٱلْبَيِّنَاتُ } الدالة على صدقه\n فقبلوا جميعه ثم ارتدوا\n العياذ بالله { وَٱللَّهُ } الهادي للكل إلى سواء السبيل { لاَ يَهْدِي ٱلْقَوْمَ ٱلظَّالِمِينَ } [آل عمران: 86] الخارجين عن حدوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وشهدوا }: عطف على ما في { إيمانهم } من معنى الفعل\n والتقدير: بعد أن آمنوا وشهدوا\n يقول الحقّ جلّ جلاله: لرجال من الأنصار ارتدوا عن الإسلام ولحقوا بمكة\n منهم الحارث بن سويد الأنصاري: { ومن } يطلب { غير الإسلام ديناً } يتدين به { فلن يُقبل منه } أبداً\n { وهو في الآخرة من الخاسرين } لأنه أبطل الفطرة السليمة التي فطر الناس عليها\n واستبدلها بالتقليد الرديء\n بعد أن عاين سواطع البرهان\n وشهدت نفسه بالحق والبيان\n ولذلك وقع التعجب والاستبعاد من هدايته فقال: { كيف يهدي الله قوماً كفروا } بعد أن آمنوا\n { وشهدوا أن الرسول حق وجاءهم البينات } أي: المعجزات الواضحات\n فإن الحائد عن الحق بعدما وضح\n منهمك في الضلال\n بعيد عن الرشاد\n فقد ظلم نفسه وبخسها\n { والله لا يهدي القوم القوم الظالمين } الذين ظلموا أنفسهم بالإخلال بالنظر\n ووضعوا الكفر موضع الإيمان\n ولعل هذا في قوم مخصوصين سبق لهم الشقاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:41",
      "similarity": 0.5025095833360167
    },
    {
      "verse": "10:35",
      "similarity": 0.3716893203449946
    },
    {
      "verse": "63:1",
      "similarity": 0.34565041655122214
    },
    {
      "verse": "37:154",
      "similarity": 0.34208988247642746
    },
    {
      "verse": "68:36",
      "similarity": 0.34208988247642746
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/003086.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/003086.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/3:86.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}