{
  "chapter": "آل عمران",
  "text": "ان الذين كفروا۟ بعد ايمنهم ثم ازدادوا۟ كفرا لن تقبل توبتهم واو۟لئك هم الضالون",
  "translations": [
    {
      "translation": "Those who become kafir after having iman and then increase in their kufr, their tawba will not be accepted. They are the misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny, having once come to faith, and persist in denial, will not have their repentance accepted, for they have gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who relieved and have har-dened in their disbelief after once believing, their (pretence to) repentance shall not be accepted. Indeed such men have altogether strayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, after having been believers and increase their disbelief, are lost and their repentance will not be accepted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who disbelieve after having accepted faith, and advance further in their disbelief – their repentance will never be accepted; and it is they who are the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieved after their belief and then went on increasing in their disbelief never will their repentance be accepted. And they are those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who disbelieve after their believing, then increase in unbelief, their repentance shall not be accepted, and these are they that go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve after they have believed and then increase in unbelief -- their repentance shall not be accepted; those are the ones who stray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who disbelieve after their (profession of) belief, and afterward grow violent in disbelief: their repentance will not be accepted. And such are those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but as for those who are bent on denying the truth after accepting the true faith and grow in their refusal to acknowledge the truth, their repentance will not be accepted. They are the ones who have gone far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve after they have believed and thereafter wax in infidelity, their- repentance shall by no means be accepted. These! they are the straying ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who turn faithless after their faith, and then advance in faithlessness, their repentance will never be accepted, and it is they who are the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Faith after they accepted it, and then go on adding to their defiance of Faith,- never will their repentance be accepted; for they are those who have (of set purpose) gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieved after their Belief and then went on increasing in their disbelief (i.e. disbelief in the Quran and in Prophet Muhammad SAW) - never will their repentance be accepted [because they repent only by their tongues and not from their hearts]. And they are those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who disbelieve after they have believed and increase in disbelief, their repentance shall not be accepted. These are those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve after having believed, then plunge deeper into disbelief, their repentance will not be accepted; these are the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who reject the message after their belief and then increase in disbelief - never will their [claimed] repentance be accepted, and they are the ones astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:90] The following was revealed regarding the Jews: Surely those who disbelieve, in Jesus, after they have believed, in Moses, and then increase in unbelief, in Muhammad (s) — their repentance shall not be accepted, when they are drawing their last gasps of life, or when they have died as disbelievers; those are the ones who go astray.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who disbelieve) in Allah (after their (profession of) belief) in Allah, (and afterward grow violent in disbelief) do not waver in their disbelief: (their repentance will not be accepted) as long as they remain in that state. (And such are those who are astray) from guidance and Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ كَفَرُواْ } ارتدوا، العياذ بالله { بَعْدَ إِيمَانِهِمْ } ثم لم يتوبوا { ثُمَّ } لم يتندموا بل { ٱزْدَادُواْ كُفْراً } أو إصراراً وعتواً واستكباراً { لَّن تُقْبَلَ تَوْبَتُهُمْ } بعدما عاندوا { وَأُوْلَـٰئِكَ } المعاندون المصرون { هُمُ ٱلضَّآلُّونَ } [آل عمران: 90] المقصرون على الضلالة في بدء الفطرة، لا يرجى منهم الفلاح أصلاً بل:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}