{
  "chapter": "آل عمران",
  "text": "ان الذين كفروا۟ وماتوا۟ وهم كفار فلن يقبل من احدهم ملء الارض ذهبا ولو افتدى به او۟لئك لهم عذاب اليم وما لهم من نصرين",
  "translations": [
    {
      "translation": "As for those who are kafir and die kuffar, the whole earth filled with gold would not be accepted from any of them if they were to offer it as a ransom. They will have a painful punishment. They will have no helpers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From those who deny and die disbelieving will never be accepted an earthful of gold if proferred by them as ransom. For them is grievous punishment, and none will help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly those who disbelieved and died as unbelievers, not even an earth full of gold will be accepted from them as ransom. For such people there is painful chastisement; and none shall come to their help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From those who have rejected the truth and died in disbelief, no ransom will be accepted even though they may pay a whole earth of gold. They will suffer a painful torment and no one will help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and died as disbelievers – an earth full of gold will never be accepted from any one of them, even if he offers it, for his freedom; for them is a painful punishment and they do not have any aides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieved, and died while they were disbelievers, the (whole) earth full of gold will not be accepted from anyone of them if they offered it as a ransom. For them is a painful torment and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who disbelieve and die while they are unbelievers, the earth full of gold shall not be accepted from one of them, though he should offer to ransom himself with it, these it is who shall have a painful chastisement, and they shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve, and die disbelieving, there shall not be accepted from any one of them the whole earth full of gold, if he would ransom himself thereby; for them awaits a painful chastisement, and they shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who disbelieve, and die in disbelief, the (whole) earth full of gold would not be accepted from such an one if it were offered as a ransom (for his soul). Theirs will be a painful doom and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject faith and die in the state of rejection will not be saved, even if they offer as ransom enough gold to fill the entire earth. Painful punishment is in store for them and they will have no supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve and die while they are infidels, not an earthful of gold shall be accepted from any such, were he to offer it as a ransom. These! theirs shall be a torment afflictive, nor shall they have any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who turn faithless and die while they are faithless, a world of gold will not be accepted from any of them should he offer it for ransom. For such there will be a painful punishment, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who reject Faith, and die rejecting,- never would be accepted from any such as much gold as the earth contains, though they should offer it for ransom. For such is (in store) a penalty grievous, and they will find no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieved, and died while they were disbelievers, the (whole) earth full of gold will not be accepted from anyone of them even if they offered it as a ransom. For them is a painful torment and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve and die unbelievers, there shall be not accepted from anyone of them, the whole earth full of gold, if he would ransom himself thereby. Those, for them there is a painful punishment, and none shall help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve and die disbelievers, even the earth full of gold would not be accepted from any of them, were he to offer it for ransom. These will have a painful torment, and will have no saviors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve and die while they are disbelievers - never would the [whole] capacity of the earth in gold be accepted from one of them if he would [seek to] ransom himself with it. For those there will be a painful punishment, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:91] Surely those who disbelieve, and die disbelieving, the whole earth full, the amount needed to fill it up, of gold shall not be accepted from any one of them (the fā’ [of fa-lan yuqbala, ‘it shall not be accepted’] has been included in the predicate of the inna clause, because the statement about alladhīna, ‘those [who disbelieve]’, resembles a conditional statement; and as a declaration of the reason for it [repentance] not being acceptable in the case of one who dies in unbelief) if he would ransom himself thereby; for them awaits a painful chastisement (alīm is [the same as] mu’lim, ‘painful’), and they shall have no helpers, to protect them from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those who disbelieve) in Allah and His Messenger, (and die in disbelief) disbelieving in Allah and His Messenger, (the (whole) earth) the weight of the earth (full of gold would not be accepted from such an one if it were offered as a ransom). Allah says: If they were to give the equivalent of the earth's weight in gold to ransom themselves, it would not be accepted from them. (Theirs will be a painful doom) which will extend to their hearts (and they will have no helpers) anyone to save them from Allah's punishment. The verses from (Lo! those who disbelieve after their (profession of) belief.... Theirs will be a painful doom and they will have no helpers) were revealed about ten hypocrites, namely, Tu'mah and his companions, who left Medina to Mecca as apostates from their religion, Islam. Some of them died as apostates, some were killed while some later returned to the fold of Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فلن يقبل من أحدهم ملء الأرض ذهباً } إذ لا تقبل هناك إلا الأمور النورانية الباقية لأن الآخرة هي عالم النور والبقاء، فلا وقع ولا خطر للأمور الظلمانية فيها الفانية\n وهل كان سبب كفرهم واحتجابهم إلا محبّة هذه الفواسق الفانية؟، فكيف تكون سبب نجاتهم وقربهم وقبولهم وندبتهم وهي بعينها سبب هلاكهم وبعدهم وخسرانهم وحرمانهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ الَّذِينَ كَفَرُواْ } في مدة أعمارهم { وَمَاتُواْ وَ } الحال أنه { هُمْ كُفَّارٌ } كما كانوا { فَلَن يُقْبَلَ مِنْ أَحَدِهِم مِّلْءُ ٱلأَرْضِ ذَهَباً وَلَوِ ٱفْتَدَىٰ بِهِ } أي: لن تقبل توبتهم عند الله وإن أنفق وافتدى كل واحد منهم ملء الأرض ذهباً رجاء أن تقبل توبته\n بل { أُوْلَـٰئِكَ } الهالكون في تيه الضلال { لَهُمْ عَذَابٌ أَلِيمٌ } دائماً مستمراً { وَمَا لَهُمْ مِّن نَّاصِرِينَ } [آل عمران: 91] من أنواع النصر من الشفاعة والإنفاق والعمل الصالح والحج المبرور وغير ذلك\n\n\nثم لما سجل سبحاه عليهم العذاب بحيث لا يخفف عنهم أصلاً\n ولا تقبل توبتهم وإن أنفق كل واحد منهم ملء الأرض ذهباً\n نبه علكى المؤمنين طريق الإنفاق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ذهباً }: تمييز، و { لو افتدى به }: محمول على المعنى، كأنه قيل: فلن يقبل من أحدهم فدية، ولو افتدى بملء الأرض ذهباً، أو عطف على محذوف، أي: فلن يقبل من أحدهم ملءُ الأرض ذهباً لو تقرب به في الدنيا، ولو افتدى به من العذاب في الآخرة\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: { إن الذين كفروا } ، واستمروا على كفرهم حتى ماتوا، { يقبل } منهم فدية، ولو افتدوا بملء الأرض ذهباً، بل يحصل لهم الإياس من رحمة الله، { أولئك لهم عذاب أليم } فلا ينفعهم فداء منه ولا شفاعة ولا حميم، { وما لهم من ناصرين } ينصروهم من عذاب رب العالمين\n قال النبيّ صلى الله عليه وسلم:\n\n \" يُجَاءُ بالكَافِر، يومَ القيامةِ، فيُقال له: أرأيتَ لو كان لكَ ملءُ الأرض ذهباً - أكنْتَ مفتدِياً به؟ فيقولُ: نعم، نعم، فيُقال له: قد سُئلْتَ ما هو أيسرُ من ذلك \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:36",
      "similarity": 0.6715017292579424
    },
    {
      "verse": "70:11",
      "similarity": 0.4955954350542275
    },
    {
      "verse": "39:47",
      "similarity": 0.4922048042946039
    },
    {
      "verse": "57:15",
      "similarity": 0.4426650053402046
    },
    {
      "verse": "37:107",
      "similarity": 0.4004636491862475
    }
  ]
}