{
  "chapter": "آل عمران",
  "text": "لن تنالوا۟ البر حتى تنفقوا۟ مما تحبون وما تنفقوا۟ من شىء فان الله به عليم",
  "translations": [
    {
      "translation": "You will not attain true goodness until you give of what you love. Whatever you give away, Allah knows it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will never come to piety unless you spend of things you love; and whatever you spend is known to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall not attain righteousness until you spend out of what you love (in the way of Allah). Allah knows whatever you spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can never have extended virtue and righteousness unless you spend part of what you dearly love for the cause of God. God knows very well whatever you spend for His cause.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can never attain virtue until you spend in Allah's cause the things you love; and Allah is Aware of whatever you spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means shall you attain Al-Birr, unless you spend of that which you love; and whatever of good you spend, Allah knows it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means shall you attain to righteousness until you spend (benevolently) out of what you love; and whatever thing you spend, Allah surely knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not attain piety until you expend of what you love; and whatever thing you expend, God knows of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye will not attain unto piety until ye spend of that which ye love. And whatsoever ye spend, Allah is Aware thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never will you attain to righteousness unless you spend for the cause of God out of what you cherish; and whatever you spend is known to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye shall not attain unto virtue until ye expend of that which ye love; and whatsoever ye expend, verily Allah Is thereof Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will never attain piety until you spend out of what you hold dear, and whatever you may spend of anything, Allah indeed knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means shall ye attain righteousness unless ye give (freely) of that which ye love; and whatever ye give, of a truth Allah knoweth it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means shall you attain Al-Birr (piety, righteousness, etc., it means here Allah's Reward, i.e. Paradise), unless you spend (in Allah's Cause) of that which you love; and whatever of good you spend, Allah knows it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall not attain righteousness until you spend of what you love. Whatever you spend is known to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not attain virtuous conduct until you give of what you cherish. Whatever you give away, God is aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never will you attain the good [reward] until you spend [in the way of Allah] from that which you love. And whatever you spend - indeed, Allah is Knowing of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:92] You will not attain piety, that is, the reward for it, which is Paradise, until you expend, [until] you give voluntary alms, of what you love, of your wealth; and whatever thing you expend, God knows of it, and He will requite it accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then prompted the believers to spend in the cause of Allah, saying: (Ye will not attain unto piety) i.e. that which is with Allah of reward, honour and Paradise until you spend of that which you love of property; it is also said this means: you shall not attend to reliance in Allah and God-fearingness (until ye spend of that which ye love. And whatsoever ye spend) of property, (Allah is aware thereof) just as He is aware of your intentions, i.e. whether you intend with it His Countenance or other people's praise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَن تَنَالُواْ ٱلْبِرَّ } معناهُ الجَنةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لن تَنَالوا البرّ } كلّ فعل يقرّب صاحبه من الله فهو برّ، ولا يمكن التقرّب إليه إلا بالتبرّي عما سواه، فمن أحب شيئاً فقد حجب عن الله تعالى به وأشرك شركاً خفيّاً لتعلق محبته بغير الله، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سجل سبحاه عليهم العذاب بحيث لا يخفف عنهم أصلاً، ولا تقبل توبتهم وإن أنفق كل واحد منهم ملء الأرض ذهباً، نبه علكى المؤمنين طريق الإنفاق، وخاطبهم على وجه التأكيد والمبالغة فقال: { لَن تَنَالُواْ ٱلْبِرَّ } أي: لن تصلوا ولن تبلغوا أيها المؤمنون مرتبة الأبرار والأخيار عند الله مطلقاً { حَتَّىٰ تُنْفِقُواْ } امتثالاً لأمره وطلباً لرضاه { مِمَّا تُحِبُّونَ } أي: من أحسن ما عندكم وأكرمه { وَ } اعلموا أن { مَا تُنْفِقُواْ مِن شَيْءٍ } ولو حبة أو ذرة أو كلمة طيبة خالصاً لرضاه بلا شوب المنة والأذى { فَإِنَّ ٱللَّهَ } المطلع لجميع أحوالكم ونياتكم { بِهِ عَلِيمٌ } [آل عمران: 92] لا يغيب عن علمه شيء فيجازيكم على مقتضى علمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: البرّ: كمال الطاعة\n يقول الحقّ جلّ جلاله: { لن تنالوا } كمال الطاعة والتقرب { حتى تنفقوا مما تحبون } ، أو: لن تنالوا برَّ الله الذي هو الرضى والرضوان، { حتى تنفقوا } بعض ما { تحبون } من المال وغيره، كبذل الجاه في معاونة الناس، إن صحبه الإخلاص، وكبذل البدن في طاعة الله، وبذلك المهج في سبيل الله\n ولمّا نزلت الآية جاء أبو طلحة فقال: يا رسول الله، إن أحب أموالي إِليَّ بَيْرُحاء – وهو بستان كان خلف المسجد النبوي – وهو صدقة لله، أرجوا برّها وذخرها، فقال له – عليه الصلاة والسلام –\n\n \" بَخٍ بَخٍ ذَلَكَ مَالٌ رَابحٌ – أو رائح – وَإِنِّي أَرَى أَنْ تَجْعَلَهَا في الأَقْرَبينَ \" \n\nفقسمها أبو طلحة في أقاربة\n وجاء زيدٌ بنُ حَارِثَةَ بفرسٍ كان يُحبها، فقال: هذه في سبيل الله، فحمل عليها رسولُ الله أسامة ولده، فقال زيد: إنما أردت أن أتصدق بها، فقال – عليه الصلاة والسلام -:\n\n \" إنَّ اللَّهَ تعالى قَدْ قَبِلَهَا \" \n\nفدلّ ذلك على أن الصدقة على الأقارب أفضل\n وأعتقت امرأةٌ جارية لا تملك غيرها، كانت تحبها، واشترطت عليها أن تقيم معها، فلما عُتِقَتْ، ذهبت، فقال لها عليه الصلاة والسلام:\n\n \" دعيها فقد حجَبْتِك عن النار \"\n \n\nوأمر عمر بن الخطاب بشراء جارية من سبي العراق، فلما جيء بها، ورآها عمرُ أعجبْته غايةً، فقال: إن الله تعالى يقول: { لن تنالوا البر حتى تنفقوا مما تحبون } ، فأعتقها\n وذكر ابن عمر هذه الآية، فلم يجد عنده أحبَّ من جارية كانت عنده، يطؤها فأعتقها، وقال: لولا أني لا أعود في شيء جعلته لله لنكحتها\n وكان الربيع يعطي للسائل إذا وقف في بابه السكر، فإذا قيل له في ذلك، قال: إن الربيع يحب السكر\n ثم إن الله – تعالى – يقبل الصدقة من المحبوب أو غيره، ولذلك قال: { وما تنفقوا من شيء فإن الله به عليم } فيجازيكم بحسبه\n الإشارة: ليس للفقير شيء أحبُّ من نفسه التي بين جنبيه، بل عند جميع الناس، فمن بذل روحه في مرضاة الله نال رضوان الله ومعرفته، وهو غاية البر، فمن أذل نفسه لله أعزه الله، ومن أفقر نفسه لله أغناه الله، من تواضع لله رفع، فبذل النفس لله هو تقديمها لشيخ التربية يفعل بها ما يشاء، فكل ما يشير به إليه بادر إليه بلا تردد، فمن فعل ذلك فقد نال غاية البر، وأنفق غاية ما يُحب، وكل من بذل نفسه بذل غيرها بالأحرى، إذ ليس أعز منها، وفي ذلك يقول ابن الفارض رضي الله عنه:\n\nوقال الشيخ أبو عبد الله القرشي: حقيقة المحبة أن تهب كُلَّكَ لمن أحببته، حتى لا يبقى لك منك شيء\n هـ\n وقال الجنيد رضي الله عنه: لن تناولا محبة الله حتى تسخُوا بأنفسكم لله\n هـ\n ولما قال عليه الصلاة والسلام لليهود:\n\n \" أنا على ملة إبراهيم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:49",
      "similarity": 0.544965840331365
    },
    {
      "verse": "7:37",
      "similarity": 0.4610869126362177
    },
    {
      "verse": "7:152",
      "similarity": 0.4424844717033643
    },
    {
      "verse": "2:124",
      "similarity": 0.43282428496338604
    },
    {
      "verse": "33:25",
      "similarity": 0.4164543388540257
    }
  ]
}