{
  "chapter": "آل عمران",
  "text": "كل الطعام كان حلا لبنى اسرءيل الا ما حرم اسرءيل على نفسه من قبل ان تنزل التورىة قل فاتوا۟ بالتورىة فاتلوها ان كنتم صدقين",
  "translations": [
    {
      "translation": "All food was lawful for the tribe of Israel except what Israel made unlawful for himself before the Torah was sent down. Say, 'Bring the Torah and read it out if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the children of Israel was lawful all food except what Israel forbade himself before the Torah was revealed. Say: \"Bring the Torah and recite it, if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food (that is lawful in the Law revealed to Muhammad) was lawful to the Children of Israel, except what Israel made unlawful to themselves before the revelation of the Torah. Tell them: 'Bring the Torah and recite any passage of it if you are truthful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful for the children of Israel except for what Israel had deemed unlawful for himself before the Torah was revealed. (Muhammad), ask them to bring the Torah and read it, if they are true in their claim (that all food was not unlawful for the children of Israel).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful for the Descendants of Israel (Jacob), except what Israel forbade for himself, before the Taurat (Torah) was sent down; say, “Bring the Taurat and read it, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel, except what Isra'il made unlawful for himself before the Tawrah was revealed. Say: \"Bring here the Tawrah and recite it, if you are truthful. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the children of Israel except that which Israel had forbidden to himself, before the Taurat was revealed. Say: Bring then the Taurat and read it, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel save what Israel forbade for himself before the Torah was sent down. Say: 'Bring you the Torah now, and recite it, if you are truthful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful unto the Children of Israel, save that which Israel forbade himself, (in days) before the Torah was revealed. Say: Produce the Torah and read it (unto us) if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful for the Children of Israel, except whatever Israel had made unlawful for himself before the Torah was sent down. Say to them, \"Bring the Torah then and read it, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every foods was allowable unto the Children of Isra'il, save that which Isra'il had forbidden unto himself, ere the Taurat was revealed. Say thou: bring ye then the Taurat and recite it, if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel except what Israel had forbidden himself before the Torah was sent down. Say, ‘Bring the Torah, and read it, if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel, except what Israel Made unlawful for itself, before the Law (of Moses) was revealed. Say: \"Bring ye the Law and study it, if ye be men of truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel, except what Israel made unlawful for himself before the Taurat (Torah) was revealed. Say (O Muhammad SAW): \"Bring here the Taurat (Torah) and recite it, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel except what Israel forbade himself before the Torah had been sent down. Say: 'Bring the Torah and recite it, if you are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was permissible to the Children of Israel, except what Israel forbade for itself before the Torah was revealed. Say, “Bring the Torah, and read it, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All food was lawful to the Children of Israel except what Israel had made unlawful to himself before the Torah was revealed. Say, [O Muhammad], \"So bring the Torah and recite it, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:93] When the Jews said to the Prophet, ‘You claim that you follow the creed of Abraham, but Abraham did not eat camel’s meat nor drink its milk’, the following was revealed: All food was lawful to the Children of Israel save what Israel, Jacob, forbade for himself, namely, camels: when he was afflicted with sciatica (‘irq alnasā), he made a vow that if he were cured he would not eat of it again, and so it was forbidden him; before the Torah was revealed, which was after the time of Abraham, as it was not unlawful in his time, as they claimed. Say, to them: ‘Bring the Torah now, and recite it, so that the truth of what you say may become clear, if you are truthful’, in what you say; they were stupified and did not bring it [the Torah]. God, exalted be He, then said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(All food was lawful unto the Children of Israel) all food that is lawful for Muhammad and his community today was lawful for the Children of Israel, the sons of Jacob, (save that which Israel) Jacob (forbade himself) by the way of vows, ((in days) before the Torah was revealed) before the revelation of the Torah to Moses, Jacob forbade himself the meat and milk of camels. When this verse was revealed, the Prophet (pbuh) asked the Jews: \"What did Jacob forbid himself of food?\" They said: \"he did not forbid himself any type of food, and whatever is forbidden for us today, such as the meat of camels and other things, was already forbidden on all prophets, from Adam to Moses (pbut). It is only you who make such things lawful\". And they claimed those things were also forbidden in the Torah. Hence Allah said to Muhammad (pbuh): (Say) to them: (Produce the Torah and read it (unto us)) where they are made forbidden (if ye are truthful) in your claim. But they failed to produce the Torah and knew they were liars since there was nothing in the Torah to substantiate their claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ادعى اليهود أن ما حرم في ديننا كان حراماً في دين إبراهيم أيضاً\n وأنتم أيها المدعون موافقة دينكم وملتكم دين إبراهيم وملته\n لم تحلون ما حرم في دينه؟\n\nرد الله عليهم وكذبهم بقوله: { كُلُّ ٱلطَّعَامِ } الذي به يقتات الإنسان ويتغذى { كَانَ حِـلاًّ } حلالاً { لِّبَنِيۤ إِسْرَائِيلَ } إذ الأصل في الأشياء الحل ما لم يرد الشرع بتحريمه { إِلاَّ مَا حَرَّمَ إِسْرَائِيلُ } وهو يعقوب عليه السلام { عَلَىٰ نَفْسِهِ } على سبيل النذر بلا ورود الوحي\n إذ كان له عرق النسا\n فنذر إن شفي لم يأكل ما هو أحب الطعام عنده واللذة\n وهو لين الإبل ولحمه فشفي\n ولم يأكل بعده منها ذلك { مِن قَبْلِ أَن تُنَزَّلَ ٱلتَّوْرَاةُ } ثم لما ظهر أنواع الخبائث والقبائح من اليهود\n وحرم الله عليهم في التوراة طيبات أحلت لهم قبلها بسبب خباثتهم وكثافتهم\n فإن أنكروا عليها وقالوا: لسنا أول ما حرم عليه هذه الآشياء المحرمة فيها\n بل حرم لمن قبلنا ونحن نقتدي بهم { قُلْ } لهم إلزاماً: { فَأْتُواْ بِٱلتَّوْرَاةِ فَٱتْلُوهَا } على رءوس الأشهاد { إِن كُنتُمْ صَادِقِينَ } [آل عمران: 93] في دعواكم\n وإلا فقد افتريتم على كتاب الله ما ليس فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إسرائيل }: هو يعقوب عليه السلام\n قول الحقّ جلّ جلاله: { كل الطعام كان } حلالاً على بني إسرائيل\n كما كان حلالاً على الأنبياء كلهم\n { إلا ما حرم إسرائيل } أي: يعقوب\n { على نفسه } \n كلحوم الإبل وألبانها\n قيل: كان به عرق النسا\n فنذر: إن شفاه الله لم يأكل أحب الطعام إليه\n وكان ذلك أحب الطعام إليه\n وقيل: فعل ذلك للتداوي بإشارة الأطباء\n فترك ذلك بنوه ولم يحرم عليهم في التوراة\n وإنما هو شيء حرموه على أنفسهم\n فالطعام كله كان حلالاً على بني إسرائيل وعلى الأنبياء كلهم قبل نزول التوراة\n فلما نزلت التوراة حرم الله عليهم أشياء من الطيبات لظلمهم وبغيهم\n فإن ادعوا أن لحوم الإبل كانت حراماً على إبراهيم\n وأن كل ما حرم عليهم كان حراماً على إبراهيم وعلى الأنبياء قبله\n فقل لهم: كذبتم { فأتوا بالتوراة فاتلوها } هل تجدون ذلك فيها؟ { إن كنتم صادقين } في قولكم: إنَّ كل شيء حرم عليكم كان حراماً على إبراهيم\n رُوِيَ: أنه – عليه الصلاة والسلام – لما قال لهم ذلك بهتوا\n ولم يجسروا أن يأتوا بالتوراة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:50",
      "similarity": 0.6172562933627556
    },
    {
      "verse": "61:6",
      "similarity": 0.4571578714143789
    },
    {
      "verse": "5:43",
      "similarity": 0.4208206427733316
    },
    {
      "verse": "3:3",
      "similarity": 0.3981082773899585
    },
    {
      "verse": "3:48",
      "similarity": 0.3490293482306736
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/3:93.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/3:93.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/3:93.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}