{
  "chapter": "غافر",
  "text": "يوم هم برزون لا يخفى على الله منهم شىء لمن الملك اليوم لله الوحد القهار",
  "translations": [
    {
      "translation": "the Day when they will issue forth and when not one thing about them will be hidden from Allah. 'To whom does the kingdom belong today? To Allah, the One, the Conqueror!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when they will come out (of their graves), with nothing of them hidden from God. Whose then will be the kingdom? -- God's, the one, the omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when they will emerge and nothing of them shall be hidden from Allah. (On that Day they will be asked): “Whose is the kingdom today?” (The whole world will cry out): “It is Allah's, the One, the Overpowering.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing will remain hidden from God concerning them on the day when they appear before God (from their graves) (It will be asked), \"To whom does the kingdom belong on this Day?\" (It will be answered), \"The kingdom belongs to the Almighty One God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day when they will be fully exposed; nothing from their affairs will be hidden from Allah; “For whom is the kingship this day? For Allah, the One, the All Dominant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when they will come out, nothing of them will be hidden from Allah. Whose is the kingdom this Day It is Allah's, the One, the Irresistible!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Of) the day when they shall come forth, nothing concerning them remains hidden to Allah. To whom belongs the kingdom this day? To Allah, the One, the Subduer (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day they sally forth, and naught of theirs is hidden from God. 'Whose is' the Kingdom today?' 'God's, the One, the Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when they come forth, nothing of them being hidden from Allah. Whose is the Sovereignty this day? It is Allah's, the One, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when they shall rise up [from their graves] and nothing about them will be hidden from God. \"To whom shall the kingdom belong that Day?\" It shall belong to God, the One, the All Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon they will appear: naught of them will be concealed from Allah, Whose is the dominion to-day? It is of Allah, the One, the Subduer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when they will emerge [from their graves], nothing about them will be hidden from Allah. ‘To whom does the sovereignty belong today?’ ‘To Allah, the One, the All-paramount!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon they will (all) come forth: not a single thing concerning them is hidden from Allah. Whose will be the dominion that Day?\" That of Allah, the One the Irresistible!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when they will (all) come out, nothing of them will be hidden from Allah. Whose is the kingdom this Day? (Allah Himself will reply to His Question): It is Allah's the One, the Irresistible!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when they shall rise up with nothing hidden from Allah. And who is the Owner of the Kingdom on that Day? Allah, the One, the Conqueror!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when they will emerge, nothing about them will be concealed from God. “To whom does the sovereignty belong today?” “To God, the One, the Irresistible.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day they come forth nothing concerning them will be concealed from Allah. To whom belongs [all] sovereignty this Day? To Allah, the One, the Prevailing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:16] the day when they will emerge, [the day] they will exit from their graves; nothing about them will be hidden from God. ‘To whom does Sovereignty belong today?’ — God, exalted be He, asks this and Himself responds — ‘To God, the One, the All-compelling!’, over His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The day when they come forth) the day when they will emerge from the graves, (nothing of them being hidden from Allah) nor will any of their works be hidden from Him. Allah will then say after the blowing of death: (Whose is the sovereignty this day?) When no one answers Him, He will answer Himself: (It is Allah's, the One) Who has no son or partner, (the Almighty) the All-Conquering over His creation through death which will overtake all of them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يوم هم بارزون } عن حجاب الأنيات أو غواشي الأبدان { لا يخفى على الله منهم شيء } مما ستروا من أعمالهم واستخفوا بها من الناس توهماً أنه لا يطلع عليهم لظهورها في صحائفهم وبروزها من الكمون إلى الظهور، كما قال:\n\n[المجادلة، الآية:6]، وقالوا:\n\n[الكهف، الآية:49]، ولا يخفى عليه منهم شيء لبروزهم عن حجب الاوصاف إلى عين الذات\n { لمن الملك اليوم } ينادي به الحق سبحانه عند فناء الكل في عين الجمع فيجيب هو وحده { لله الواحد } الذي لا شيء سواه { القهار } الذي أفنى الكل بقهره { إنّ الله سريع الحساب } لوقوعه دفعة باقتضاء سيئاتهم المكتوبة في صحائف نفوسهم تبعاتها وحسناتها ثمراتها { وأنذرهم يوم الأزفة } أي: الواقعة القريبة وهي القيامة الصغرى { إذ القلوب لدى الحناجر } لشدّة الخوف\n { كذلك يضلّ الله من هو مسرف مرتاب } كقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ هو { يَوْمَ هُم بَارِزُونَ } خارجون من أجداث أجسامهم، راجعنن إلى الله جميعاً بأرواحهم، محشورون عنده معرضون عليه؛ بحيث { لاَ يَخْفَىٰ عَلَى ٱللَّهِ } المحيط بهم { مِنْهُمْ شَيْءٌ } من أعيانهم وأعمالهم ونياتهم، وبعدما برزوا لله ورجعوا نحوه صائرين إليه، فانين فيه، قيل لهم من قِبل الحق بعد فناء الكل إظهاراً لكمال قدرته وجلاله: { لِّمَنِ ٱلْمُلْكُ ٱلْيَوْمَ } أي: ملك الوجود والتحقق والثبوت، فأجيب أيضاً من قِبله؛ إذ لا موجود سواه، ولا شيء غيره: { لِلَّهِ ٱلْوَاحِدِ } من كل الوجوه { ٱلْقَهَّارِ } [غافر: 16] لنقوش استوى سبحانه على الملك المطلق بالإطاعة والاستحقاق على ما كان ويكون في ازل الآزال وأبد الآباد، أشار إلى سرائر ما ظهر منه في النشأة الأولى فقال: { ٱلْيَوْمَ } أي: يوم الجزاء والنشأة الأخرى { تُجْزَىٰ كُلُّ نَفْسٍ بِمَا كَـسَبَتْ } أي: طبق ما كسبت واقترفت في النشأة الأولى، التي هي نشأة التكلف والاختبار بلا ازدياد وتنقيص عليه؛ إذ { لاَ ظُلْمَ ٱلْيَوْمَ } أي: يوم الجزاء؛ لأنه إنما وضع لظهور العدالة الإلهية والقسط الحقيقي، بل تجزى فيه كل من النفوس بجميع ما صدرت عنها، خيراً وشراً نفعاً وضراً { إِنَّ ٱللَّهَ } المطلع على عموم ما ظهر وبطن من عباده { سَرِيعُ ٱلْحِسَابِ } [غافر: 17] عليهم بلا فترة وتلبيس؛ إذ لا يشغله شأن عن شأن، ولا يطرأ عليه سهو ونيسان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يوم هم بارزون }: بدل من \" يوم التلاق \" أي: خارجون من قبورهم، أو: ظاهرون، لا يستترون بشيء من جبل أو أكمة أو بناء لكون الأرض يومئذ قاعاً صفصفاً، ولا عليهم ثياب، إنما هم حفاةٌ عراةٌ، كما في الحديث\n أو: بارزة نفوسهم لا يحجبها غواش الأبدان، أو: بارزة أعمالهم وسرائرهم، { لا يخفى على الله منهم شيءٌ } من أعمالهم وأحوالهم، الجلية والخفية، السابقة واللاحقة، وهو استئناف لبيان بُروزهم، وإزاحة لِما كان يتوهمه المتوهمون في الدنيا من الاستتار توهماً باطلاً، فإذا برزوا وحُشروا، نادى الحق ـ جلّ جلاله: { لمَن الملكُ اليومَ }؟ فلا يجيبه أحد، ثم يعود ثلاثاً، فيجيب نفسه بنفسه بقوله: { لله الواحدِ القهارِ } أي: الذي قهر العباد بالموت\n رُوي أن الله تعالى يجمع الخلائق في صعيد واحد، في أرض بيضاء، كأنها سبيكة فضة، لم يُعصَ الله عليها قط، فأول ما يُتكلم به أن يُنادي مناد: لِمن المُلكُ اليوم؟ فيجيب نفسه: \" لله الوحد القهّار \"\n وقيل: المجيب أهلُ المحشر، ورُوي أيضاً: أن هذا القول يقوله الحق تعالى عند فناء الخلق وقبل البعث، ولعله يقال مرتين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:48",
      "similarity": 0.853257887578971
    },
    {
      "verse": "38:65",
      "similarity": 0.5809697956744477
    },
    {
      "verse": "79:36",
      "similarity": 0.5271080110220925
    },
    {
      "verse": "39:4",
      "similarity": 0.47433862858404385
    },
    {
      "verse": "6:18",
      "similarity": 0.4722297782520639
    }
  ]
}