{
  "chapter": "غافر",
  "text": "رفيع الدرجت ذو العرش يلقى الروح من امره على من يشاء من عباده لينذر يوم التلاق",
  "translations": [
    {
      "translation": "He is the Raiser of ranks, the Possessor of the Throne, He sends the Ruh by His command to whichever of His slaves He wills so that he may warn mankind about the Day of Meeting:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most exalted of position, Lord of power, He directs inspiration by His command to any of His creatures as He will, to warn (men) of the Day of Meeting,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted in Rank, Lord of the Throne: He causes the spirit to descend on whomsoever of His servants He pleases so as to warn them of the Day of Encounter;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the promoter of His servants and the owner of the Throne. He sends His spirit by His command to whichever of His servants He wants to warn them of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bestower of High Ranks, Owner of the Throne; it is He Who instils the spirit of faith into the one He wills among His bondmen, in order that he may warn of the Day of Meeting. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is Allah) Owner of high ranks and degrees, the Owner of the Throne. He sends the revelation by His command to any of His servants He wills, that he may warn of the Day of Mutual Meeting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Possessor of the highest rank, Lord of power: He makes the inspiration to light by His command upon whom He pleases of His servants, that he may warn (men) of the day of meeting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalter of ranks is He, Possessor of the Throne, casting the Spirit of His bidding upon whomever He will of His servants, that he may warn them of the Day of Encounter,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Exalter of Ranks, the Lord of the Throne. He causeth the Spirit of His command upon whom He will of His slaves, that He may warn of the Day of Meeting,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted and throned on high, He lets the Spirit descend at His behest upon whichever of His servants He will, so that he may warn of the Day of Meeting,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Lofty in degrees, Lord of the Throne. He casteth the spirit of His command upon whomsoever He will of His bondmen, that he may warn people of the Day of Meeting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Raiser of ranks, Lord of the Throne, He casts the Spirit of His command upon whomever of His servants that He wishes, that he may warn [people] of the Day of Encounter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Raised high above ranks (or degrees), (He is) the Lord of the Throne (of Authority): by His Command doth He send the Spirit (of inspiration) to any of His servants he pleases, that it may warn (men) of the Day of Mutual Meeting,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is Allah) Owner of High Ranks and Degrees, the Owner of the Throne. He sends the Inspiration by His Command to any of His slaves He wills, that he (the person who receives inspiration) may warn (men) of the Day of Mutual Meeting (i.e. The Day of Resurrection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalter in ranks, Owner of the Throne. He lets the spirit (the revelation) descend at His order on those of His worshipers whom He chooses, in order that He warns of the Day of the Meeting;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted in rank, Owner of the Throne. He conveys the Spirit, by His command, upon whomever He wills of His servants, to warn of the Day of Encounter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He is] the Exalted above [all] degrees, Owner of the Throne; He places the inspiration of His command upon whom He wills of His servants to warn of the Day of Meeting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:15] Exalter of ranks, [either means] that God is One Whose attributes are majestic — or [it means] the raiser of the ranks of believers in Paradise — Lord of the Throne, in other words, the Creator thereof, He casts the Spirit, the Revelation, of His command, that is, [of] His words, upon whomever He will of His servants, that he, the one upon whom it is cast, may warn them of, [that he may] make people fear, the Day of Encounter (read yawma’l-talāqi, omitting the [final long] yā’, or yawma’l-talāqī), that is to say, the Day of Resurrection, [so called] because thereat the inhabitants of the heavens will encounter those of the earth, and the worshipper [will encounter] the one whom he worshipped, and the wrongdoer [will encounter] the person whom he wronged;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Exalter of Ranks) the Creator of the heavens, Who has raised you above everything, (the Lord of the Throne. He casteth the Spirit of His command) He sends down Gabriel with the Qur'an (upon whom He will of His slaves) i.e. Muhammad (pbuh) (that He may warn) that Muhammad (pbuh) may warn by means of the Qur'an (of the Day of Meeting) of when the inhabitants of the earth and the inhabitants of the heavens will meet; it is also said that this means: when the Creator and created will meet,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُلْقِي ٱلرُّوحَ مِنْ أَمْرِهِ } معناه الوَحي\n\n\n\n\nوقوله تعالى: { لِيُنذِرَ يَوْمَ ٱلتَّلاَقِ يَوْمَ هُم بَارِزُونَ لاَ يَخْفَىٰ عَلَى ٱللَّهِ مِنْهُمْ شَيْءٌ لِّمَنِ ٱلْمُلْكُ ٱلْيَوْمَ } فيومُ التَّلاقِ: هو يومُ القِيامةِ، حينَ يلتقي الخَلقُ من الأَولينَ والآخرينَ، وقد بَرزوا من قِبورِهم، فيقالُ لَهُمْ لمن المُلكُ وقَدْ تَفردتُم بأربابٍ كَثيرةٍ وآلهةٍ شَتّى، فيجيبون أن المُلكَ لله الواحدِ القَهارِ\n والقولُ فيهِ مُضمرٌ كَقولهِ تعالى:\n\n[البقرة: 127] وأضمرَ يقولان رَبّنا تَقبل مِنَّا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {He will cast the Spirit from His command} - its meaning is the revelation.\n\nAnd the saying of Allah: {To warn of the Day of Meeting, the Day when they will come out, not hidden from Allah among them is anything, to whom belongs the Kingdom this Day?} The Day of Meeting: it is the Day of Resurrection, when the creatures meet from the first and the last, and they come out of their graves, it is said to them, \"To whom belongs the Kingdom, and you have become many lords and gods even?\" They reply, \"The Kingdom belongs to Allah, the One, the Conqueror.\"\n\n\nAnd the statement in it is implied, like the statement of the Almighty:\n\n\nAnd He {i.e. God} has ordained that they {i.e. the two angels} should say, \"Our Lord, accept {this act of worship} from us.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { رفيع الدرجات } أي: رفيع درجات غيوبه ومصاعد سمواته من المقامات التي يعرج فيها السالكون إليه { ذو العرش } أي: المقام الأرفع المالك للأشياء كلها { يلقي الروح } أي: الوحي والعلم اللدني الذي تحيا به القلوب الميتة { من } عالم { أمره على من يشاء من عباده } الخاصة به أهل العناية الأزلية { لينذر يوم } القيامة الكبرى الذي يتلاقى فيه العبد والربّ بفنائه فيه أو العباد في عين الجمع\n { يوم هم بارزون } عن حجاب الأنيات أو غواشي الأبدان { لا يخفى على الله منهم شيء } مما ستروا من أعمالهم واستخفوا بها من الناس توهماً أنه لا يطلع عليهم لظهورها في صحائفهم وبروزها من الكمون إلى الظهور\n كما قال:\n[المجادلة\n الآية:6]\n وقالوا:\n[الكهف\n الآية:49]\n ولا يخفى عليه منهم شيء لبروزهم عن حجب الاوصاف إلى عين الذات\n { لمن الملك اليوم } ينادي به الحق سبحانه عند فناء الكل في عين الجمع فيجيب هو وحده { لله الواحد } الذي لا شيء سواه { القهار } الذي أفنى الكل بقهره { إنّ الله سريع الحساب } لوقوعه دفعة باقتضاء سيئاتهم المكتوبة في صحائف نفوسهم تبعاتها وحسناتها ثمراتها { وأنذرهم يوم الأزفة } أي: الواقعة القريبة وهي القيامة الصغرى { إذ القلوب لدى الحناجر } لشدّة الخوف\n { كذلك يضلّ الله من هو مسرف مرتاب } كقوله:\n[غافر\n الآية:28] أي: الإضلال والخذلان كل واحد منهما مرتب على الرذيلتين العلمية والعملية\n فإن الكذب والارتياب كلاهما من باب رذيلة القوة النطقية لعدم اليقين والصدق والإسراف عن رذيلة القوتين الأخريين والإفراط في أعمالها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يدعون ويعبدون له سبحانه\n مع أنه هو في ذاته { رَفِيعُ ٱلدَّرَجَاتِ } أي: درجات قربه ووصوله رفعية\n وساحة عز حضوره منيعة لا يسع لكل قاصد أن يحوم حولها\n إلا بتوفيق منه سبحانه وجذب من جانبه { ذُو ٱلْعَرْشِ } العظيم\n إذ لا ينحصر مقر استيلائه وظهوره بمظهر دون مظهر ومجلى دون مجلى\n بل له مجالي إلى ما شاء الله\n إذ هو بمقتضى تجليه الجمالي { يُلْقِي ٱلرُّوحَ } على وجه الأمانة ويمد الظل { مِنْ أَمْرِهِ } بمقتضى حبه الذاتي { عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِ } أي: استعدادات مظاهرة المسظلين بظلال أسمائه وصفاتخ\n وبعد إلقائه ومدِّة إياهم\n كلفهم بما كلفهم من الأوامر والنواهي المصححة للعبودية اللازمة للألوهية والربوبية\n وإنما كلفهم بما كلفهم { لِيُنذِرَ يَوْمَ ٱلتَّلاَقِ } [غافر: 15] أي: يخوفهم عن زمان الوصول والرجوع في النشأة الأخرى\n والطامة الكبرى التي ترد فيها الأمانات إلى أهلها على وجهها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فإنه { رفيعُ الدرجات } أي: رافع درجات أوليائه المؤمنين\n الداعين إليه\n المخلصين في الدنيا والآخرة\n في الدنيا بالعز والنصر\n وفي الآخرة بالقُرب والاختصاص\n أو: رفيع السموات التي هي مصاعد الملائكة\n ومهابطها\n للسفارة بين المرسِل والمرسَل إليه\n وهو كالمقدمة لقوله: { يُلقي الروح\n\n\n } الخ\n هذا على أنه اسم فاعل\n مبالغة\n وقيل: هو صفة مشبهة أُضيفت إلى فاعلها\n أي: رفيعٌ درجاتُه بالعلو والقهرية\n { ذو العرش } أي: مالكه\n وهما خبران آخران عن { هو الذي\n\n\n } الخ\n إيذاناً بعلو شأنه\n وعِظم سلطانه\n الموجبين لتخصيص العبادة به\n وإخلاص الدين له بطريق الاستشهاد بهما عليهما فإنَّ ارتفاع الدرجات والاستيلاء على العرش ـ مع كون العرش محيطاً بأكناف العالم العلوي والسفلي\n وهو تحت ملكوته وقبضة قهره مما يقضي بكون علو شأنه وعظيم سلطانه ـ في غاية لا غاية ورائها\n قاله أبو السعود\n ثم ذكر سبب رفع الدرجات بقوله: { يُلقي الروح } أي: ينزل الوحي\n الجاري من القلوب بمنزلة الروح من الأجسام\n وكأنه لَمَّا ذكر رزق الأجسام أتبعه برزق الأرواح\n الذي هو العلم بالله\n وطريقُه الوحي\n والتعبير بالمضارع\n قال الطيبي: يفيد استمرار الحي من لدن آدم إلى زمن سيدنا محمد صلى الله عليه وسلم\n ثم اتصاله إلى قيام يوم التنادي\n بإقامة مَن يقوم بالدعوة\n على ما روى أبو داود\n عن أبي هريرة\n عن النبي صلى الله عليه وسلم أنه قال:\n \" إِنَّ اللهَ سَيَبْعَثُ لهذه الأمة على رأسِ كلِّ مائةِ سنَة مَن يُجَدِّدُ لها دِينَها \" \n \nومعنى التجديد: إحياء ما اندرس من العمل بالكتاب والسُنَّة\n والأمر بمقتضاهما\n هـ\n قلت: وقد رزتُ شيخنا البوزيدي رضي الله عنه مرة\n فلما وقع بصره عليّ\n قال: واللهِ\n حتى يُحْيي الله بك الدين المحمدي\n وكتب لي شيخ الجماعة\n وقطب دائرة التربية\n مولاي العربي الدرقاوي رضي الله عنه\n فقال في آخر كتابه: وأرجو من الله ألا تموت حتى تكون داعياً إلى الله\n تُذكّر أهل المشرق والمغرب\n أو ما هذا معناه\n وقد وقع ذلك\n والحمد لله\n وقوله: { مِنْ أَمره } أي: من قضائه\n أو: بأمره\n فيجوز أن يكون حالاً من الروح\n أو متعلقاً بـ يُلقِي أي: يُلقِي الروح حال كونه ناشئاً\n أو: مبتدئاً من أمره\n أو: يُلقي الوحي بسبب أمره { على مَن يشاءُ من عباده } هو الذي اصطفاه لرسالته\n وتبليغ أحكامه إلى عباده\n { ليُنذر } أي: الله\n أو: المُلْقَى عليه\n وهو النبي عليه السلام\n ويؤيده قراءة يعقوب بالخطاب\n أي: لتخوُّف { يومَ التلاقِ } يوم القيامة لأنه يتلاقى فيه أهل السموات وأهل الأرض\n والأولون والآخرون\n و يوم: ظرف للمفعول الثاني\n أي: ليُنذر الناسَ العذابَ يوم التلاق\n أو: مفعول ثان ليُنذر\n فإنه من شدة هوله وفظاعته حقيق بالإنذار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:83",
      "similarity": 0.5374747492898736
    },
    {
      "verse": "4:96",
      "similarity": 0.4329582723316862
    },
    {
      "verse": "6:165",
      "similarity": 0.417644858467643
    },
    {
      "verse": "3:163",
      "similarity": 0.41642629257479497
    },
    {
      "verse": "46:19",
      "similarity": 0.4059593186833
    }
  ]
}