{
  "chapter": "غافر",
  "text": "قالوا۟ ربنا امتنا اثنتين واحييتنا اثنتين فاعترفنا بذنوبنا فهل الى خروج من سبيل",
  "translations": [
    {
      "translation": "They will say, 'Our Lord, twice You caused us to die and twice You gave us life. We admit our wrong actions. Is there no way out?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"O Lord, twice You made us die, and twice You made us live. We admit our sins. Is there still a way out for us?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: “Our Lord, twice have You caused us to die and twice have You given us life. We have now confessed our sins. Is there, then, any way out?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Lord, You have caused us to die twice and You have brought us back to life twice. We have confessed our sins, so is there any way out of this (hell)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “O Our Lord! Twice You have given us death and twice You have given us life* – we now confess to our sins – so is there a way out of the fire?” (From nothingness to life in this world, to death and then Resurrection.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Our Lord! You have made us to die twice, and You have given us life twice! Now we confess our sins, then is there any way to get out\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: Our Lord! twice didst Thou make us subject to death, and twice hast Thou given us life, so we do confess our faults; is there then a way to get out?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'Our Lord, Thou hast caused us to die two deaths and Thou hast given us twice to live; now we confess our sins. Is there any way to go forth?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Our Lord! Twice hast Thou made us die, and twice hast Thou made us live. Now we confess our sins. Is there any way to go out?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Our Lord! Twice You have made us die, and twice You have given us life! Now we have confessed our sins: is there any way out [of this]?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: our Lord! Thou hast made us die twice, and Thou hast made us live twice now We confess our sins: there no getting out any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Our Lord! Twice did You make us die, and twice did You give us life. We admit our sins. Is there any way out [from this plight]?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Our Lord! twice hast Thou made us without life, and twice hast Thou given us Life! Now have we recognised our sins: Is there any way out (of this)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Our Lord! You have made us to die twice (i.e. we were dead in the loins of our fathers and dead after our deaths in this world), and You have given us life twice (i.e. life when we were born and life when we are Resurrected)! Now we confess our sins, then is there any way to get out (of the Fire)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: 'Our Lord, twice You have made us die, and twice You have given us life, now, we confess our sins. Is there any way we can be brought out of this'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Our Lord, you made us die twice, and twice you gave us life. Now we acknowledge our sins. Is there any way out?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Our Lord, You made us lifeless twice and gave us life twice, and we have confessed our sins. So is there to an exit any way?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:11] They will say, ‘Our Lord, You have caused us to die twice, two deaths, and You have given us life twice — for they were lifeless drops of semen, then they were given life, then made to die, then brought back to life for the Resurrection. We [now] confess our sins, in having disbelieved in the Resurrection. Is there then any way to go out?’, out of the Fire and return to the world to be obedient to our Lord? The answer given to them will be: No!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say) i.e. the disbelievers will say in the Fire: (Our Lord!) our Lord! (Twice hast Thou made us die) once when You took away our souls [in the life of the world] and once after Munkar and Nakir questioned us in the graves, (and twice hast Thou made us live) once before we were questioned by Munkar and Nakir in the graves and once for the resurrection. (Now we confess) we acknowledge (our sins) our idolatry and denial. (Is there any way to go out) is there any way we can go back to the life of the world so that we believe in You?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمَتَّنَا ٱثْنَتَيْنِ وَأَحْيَيْتَنَا ٱثْنَتَيْنِ } معناه كُنّا أَمواتاً في أَصلابِ آبائِنا، ثُمَّ أَحييتَنا، ثُمَّ أَمَتنا فيهَا، ثُمَّ أحييتَنا فِي الآخرةِ\n ومثلُهُ\n\n[البقرة: 28] [أي] أمواتاً في أصلابِ آبائِكُمْ ثُمَّ أحياكُم في أَرحامِ أُمهاتِكُم وأَخرجَكُمْ منهَا ثُمَّ أَماتكم في الدُّنيا ثُمَّ أحياكم في الآخرةِ\n\n\n\n\nوقوله تعالى: { فَٱعْتَرَفْنَا بِذُنُوبِنَا } معناه أقررنا بهَا\n\n",
      "translations": [
        {
          "translation": "\nThe meaning of His saying, {We have created you twice and given you life twice}, is that we were dead in the loins of our ancestors, then He gave us life, then we died in it, then He gave us life in the Hereafter.\n\n\nAnd like him\n\n\n{Any} dead in the loins of your fathers, then He brings you to life in the wombs of your mothers, and He brings you out from them, then He causes you to die in the world, then He brings you to life in the Hereafter.\n\n\nAnd His saying, {We have acknowledged our sins}, means that we have accepted them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعوا ما سمعوا من النداء الهائل المهول { قَالُواْ } بلسان استعداداته متحسرين متضرعين: { رَبَّنَآ } يا من ربانا على فطرة معرفتك وتوحيدك\n فكرناك وأشركنا بك غيرك\n قد ظهر لنا اليوم حقية ما ورد علينا من قبل بعدما { أَمَتَّنَا } وافنيتنا في هوتك مرتين { ٱثْنَتَيْنِ } مرة في النشأة الأولى بانقضاء الأجل المقدرمن عندك\n ومرة في النشأة الأخرى بعد النفحة { وَ } كذا { أَحْيَيْتَنَا } وأبقيتنا ببقائك مرتين { ٱثْنَتَيْنِ } مرة عند حشرنا من أجداث طبائعنا\n ومرة بعد النفخة الثانية للعرض والجزاء\n\n\nوبعدما لاح علينا من دلائل توحيدك وكمال قدرتك ما لاح { فَٱعْتَرَفْنَا } الآن { بِذُنُوبِنَا } التي صدرت عنَّا من غاية غفلتنا وجهلنا بك وبقدرتك\n ووحدة ذاتك واستقلالك في آثارك الصادرة عنك { فَهَلْ } لنا اليوم مجال { إِلَىٰ خُرُوجٍ } من عذابك الذي أعددت لنا بمقتضى عدلك حسب جرائمنا وآثمانا { مِّن سَبِيلٍ } [غافر: 11] إلى الخلاص والنجاة منه\n\n\nثم بعدما تضرعوا من شدة هولهم وفظاعة أمرهم ما تضرعوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين } أي: إماتتين وإحياءتين\n أو: موتتين وحياتين\n قال ابن عباس: كانوا أمواتاً في الأصلاب\n ثم أحياهم\n ثم أماتهم الموتة التي لا بُد منها\n ثم أحياهم للبعث يوم القيامة\n وهذا كقوله تعالى:\n[البقرة: 28] الآية\n قال السدي: أُميتوا في الدنيا\n ثم أُحْيوا في قبورهم للسؤال\n ثم أُميتوا في قبورهم\n ثم أُحيوا في الآخرة\n والحاصل: أنهم أجابوا: بأن الأنبياء دعوهم إلى الإيمان بالله واليوم الآخر\n وكانوا يعتقدون ما يعتقده الدهرية: ألاَّ حياة بعد بالموت\n فلم يلتفتوا إلى دعوتهم\n وداموا على الإنكار\n فلمّا رأوا الأمر عياناً\n اعترفوا\n ووجه مطابقة قوله: { قالوا ربنا\n\n\n } الخ لما قبله: الإقرار بما كانوا منكرين له من البعث\n الذي أوجب لهم المقت والعذاب طمعاً في الإرضاء له بذلك ليتخلصوا من العذاب\n ولذلك قالوا: { فاعترفنا بذنوبنا } \n لمّا رأوا الإماتة والإحياء قد تكرّر عليهم\n عَلِموا أن الله قادر على الإعادة\n كما هو قادر على الإنشاء\n فاعترفوا بذنوبهم التي اقترفوها من إنكار البعث وما يتبعه من جرائمهم\n ومقصدهم بهذا الإقرار: التوسل بذلك إلى ما علَّقوا به أطماعهم الفارغة من الرجوع إلى الدينا\n كما صرّحوا به في قولهم: { فهل إلى خُروج } أي: نوع من الخروج\n سريع أو بطيء\n { من سبيلٍ } أو: لا سبيل إليه قط\n وهذا كلامُ مَن غلب عليه اليأس\n وإنما يقولون ذلك تحيُّراً\n مع نوع استبعاد واستشعار يأس منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:18",
      "similarity": 0.4958422958350814
    },
    {
      "verse": "36:14",
      "similarity": 0.3980393909001345
    },
    {
      "verse": "15:87",
      "similarity": 0.3582898066874787
    },
    {
      "verse": "81:9",
      "similarity": 0.33638809198289965
    },
    {
      "verse": "3:16",
      "similarity": 0.33413874899110063
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/40:11.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/40:11.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}