{
  "chapter": "غافر",
  "text": "هو الذى يريكم ءايته وينزل لكم من السماء رزقا وما يتذكر الا من ينيب",
  "translations": [
    {
      "translation": "It is He who shows you His Signs and sends down provision to you out of heaven. But none pay heed save those who make tawba.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows you His signs, and sends you food from the heavens. Yet none takes a warning except him who turns to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who shows you His Signs and sends down provision for you from the sky. Yet none takes heed except he who constantly turns to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has shown you the evidence of His existence and has sent you sustenance from the sky, yet only those who turn to God in repentance take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who shows you His signs, and sends down sustenance from the sky for you; and none accept guidance except those who incline (towards Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who shows you His Ayat and sends down provision for you from the sky. And none remembers but those who turn in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who shows you His signs and sends down for you sustenance from heaven, and none minds but he who turns (to Him) again and again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows you His signs and sends down to you out of heaven provision; yet none remembers but he who repents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who showeth you His portents, and sendeth down for you provision from the sky. None payeth heed save him who turneth (unto Him) repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows you His signs, and sends down provision for you from heaven; but none pays heed except the repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who sheweth you His signs and sendeth down for you from the heaven provision. And none receiveth admonition save him who turneth in penitence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows you His signs and sends down provision for you from the sky. Yet no one takes admonition except those who return penitently [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who showeth you his Signs, and sendeth down sustenance for you from the sky: but only those receive admonition who turn (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He, Who shows you His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and sends down (rain with which grows) provision for you from the sky. And none remembers but those who turn (to Allah) in obedience and in repentance (by begging His Pardon and by worshipping and obeying Him Alone and none else).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows to you His signs and sends down your provision from the sky. Yet no one remembers except he who is penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows you His wonders, and sends down sustenance from the sky for you. But none pays heed except the repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shows you His signs and sends down to you from the sky, provision. But none will remember except he who turns back [in repentance].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:13] He it is Who shows you His signs, the proofs of His Oneness, and sends down from the heaven for you provision, by way of rain. Yet no one remembers, [no one] is admonished, except him who returns penitently, [who] recants idolatry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهُوَ الَّذِي يُرِيكُمْ آَيَاتِهِ وَيُنَزِّلُ لَكُمْ مِنَ السَّمَاءِ رِزْقًا وَمَا يَتَذَكَّرُ إِلَّا مَنْ يُنِيبُ (13)هذا استئناف ابتدائي إقبالٌ على خطاب الرسول صلى الله عليه وسلم والمؤمنين بعد أن انقضى وصف ما يلاقي المشركون من العذاب ، وما يدعون من دعاء لا يستجاب ، وقرينة ذلك قوله : { ولو كره الكافرون } \\[ غافر : 14 \\] .ومناسبة الانتقال هي وصفَا { العلي الكبير } \\[ غافر : 12 \\] لأن جملة { يريكم آياته } تناسب وصف العلوّ ، وجملة { ينزل لكم من السماء رزقاً } تناسب وصف { الكبير } بمعنى الغَنِيّ المطلق .والآيات : دلائل وجوده ووحدانيتِه . وهي المظاهر العظيمة التي تبدو للناس في هذا العالم كقوله : { هو الذي يريكم البرق خوفاً وطمعاً } \\[ الرعد : 12 \\] وقوله : { إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب } \\[ آل عمران : 190 \\] . وتنزيل الرزق من السماء هو نزول المطر لأن المطر سبب الرزق وهو في نفسه آية أدمج معها امتنان ، ولذلك عُقب الأمران بقوله : { ومَا يَتَذَكَّرُ إلا مَن يُنيب } .وصيغة المضارع في { يريكم } و { ينزل } تدل على أن المراد إراءة متجددة وتنزيل متجدد وإنما يكون ذلك في الدنيا ، فتعين أن الخطاب مستأنف مراد به المؤمنون وليس من بقية خطاب المشركين في جهنم ، ويزيد ذلك تأييداً قوله : { فادعوا الله مخلصين له الدين ولو كره الكافرون } \\[ غافر : 14 \\] .( وعُدي فعلاً ( يرى ) و { ينزل } إلى ضمير المخاطبين وهم المؤمنون لأنهم الذين انتفعوا بالآيات فآمنوا وانتفعوا بالرزق فشكروا بالعمل بالطاعات فجُعل غيرهم بمنزلة غير المقصودين بالآيات لأنهم لم ينتفعوا بها كما قال تعالى : { وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون } \\[ العنكبوت : 43 \\] فجَعل غير العالمين كمن لا يعقل ولا يفقه .ولذلك ذيلت إراءة الآيات وإنزالُ الرزق لهم بقوله : { وما يتذكر إلا من ينيب } أي من آمن ونبذ الشرك لأن الشرك يصدّ أهله عن الإِنصاف وإعمال النظر في الأدلة .والإِنابة : التوبة ، وفي صيغة المضارع إشارة إلى أن الإِنابة المحصلة للمطلوب هي الإِنابة المتجددة المتكررة ، وإذ قد كان المخاطبون منيبين إلى الله كان قوله : { وما يتذكر إلاّ من ينيب } دَالاً بدلالة الاقتضاء على أنهم رأوا الآيات واطمأنوا بها وأنهم عرفوا قدر النعمة وشكروها فكان بين الإِنابة وبين التذكر تلازم عادي ، ولذلك فجملة { وما يتذكر إلاّ من ينيب } تذييل .وتقديم { لكم } على مفعول { يُنزل } وهو { رزقاً } لكمال الامتنان بأن جُعل تنزيل الرزق لأجل الناس ولو أخر المجرور لصار صفة ل { رِزْقاً } فلا يفيد أن التنزيل لأجل المخاطَبين بل يفيد أن الرزق صالح للمخاطبين وبين المعنيين بون بعيد ، فكان تقديم المجرور في الترتيب على مفعول الفعل على خلاف مقتضى الظاهر لأن حق المفعول أن يتقدم على غيره من متعلِّقات الفعل وإنما خولف الظاهر لهذه النكتة .وجُعل تنزيل الرزق لأَجل المخاطبين وهم المؤمنون إشارة إلى أن الله أراد كرامتهم ابتداء وأن انتفاع غيرهم بالرزق انتفاع بالتبع لهم لأنهم الذين بمحل الرضى من الله تعالى .وتُثار من هذه الآية مسألة الاختلاف بين الأشعرية مع الماتريدي ومع المعتزلة في أن الكافر منعَم عليه أوْ لا؟ فعن الأشعري أن الكافر غير منعم عليه في الدنيا ولا في الدين ولا في الآخرة ، وقال القاضي أبو بكر الباقلاني والماتريدي : هو منعم عليه نعمةً دنيوية ، لا دينية ولا أُخروية ، وقالت المعتزلة : هم منعم عليه نعمةً دنيوية ودينية لا أخروية ، فأما الأشعري فلم يعتبر بظاهر الملاذ التي تحصل للكافر في الحياة فإنما ذلك إملاء واستدراج لأن مآلها العذاب المؤلم فلا تستحق اسم النعمة .وأنا أقول : لو استُدل له بأنها حاصلة لهم تبعاً فهي لذائد وليست نعماً لأن النعمة لذة أريد منها نفع من وصلت إليه كما أشرتُ إليه آنفاً .وأما الباقلاني فراعى ظاهر الملاذّ فلم يمنع أن تكون نعماً وإن كانت عواقبُها آلاماً ، وآياتُ القرآن شاهدة لقوله . وأما المعتزلة فزادوا فزعموا أن الكافر منعم عليه دِينَا ، وأرادوا بذلك أن الله مكَّن الكافر من نعمة القدرة على النظر المؤدي إلى معرفة الله وواجببِ صفاته . والذي استقر عليه رأي المحققين من المتكلمين أن هذا الخلاف لفظي لأنه غير ناظر إلى حقيقة حالة الكافر في الدنيا والدين ، وإنما نظر كل شِق من أهل الخلاف إلى ما حفّ بأحوال الكافر في تلك النعمة فرجع إلى الخلاف في الألفاظ المصطلح عليها ومدلولاتها لا في حقائق المقصود منها .\n\n",
      "translations": [
        {
          "translation": "(He it is Who showeth you) people of Mecca (His portents) the signs of His divine Oneness, power and marvels in the ruins of the homes of those who transgressed, (and sendeth down for you provision) rain (from the sky. None payeth heed) through the Qur'an (save him who turneth (unto Him) repentant) except him who betakes himself to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ هوالذي يريكم } آيات صفاته بتجلياته { وينزل لكم } من سماء الروح { رزقاً } حقيقياً ما أعظمه وهو العلم الذي يحيا به القلب ويتقوى { وما يتذكّر } أحواله السابقة بذلك الرزق { إلاّ من ينيب } إليه بالتجرّد وقطع النظر عن الغير فأنيبوا إليه لتتذكروا بتخصيص العبادة به وإخلاص الدين عن شوب الغيرية وتجريد الفطرة عن النشأة ولو أنكر المحجوبون وكرهوا",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتشركون فيه مع أنه سبحانه { هُوَ }  الله الكامل في الألوهية والربوبية { ٱلَّذِي يُرِيكُمْ آيَاتِهِ } الدالة على وحدة ذاته { وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ } أي: سماء الأسماء المربية لكم من لدنه { رِزْقاً } صورياً ومعنوياً تتميماً لتربيتكم وتكميلكم { وَمَا يَتَذَكَّرُ } ويتعظ منكم بآياته { إِلاَّ مَن يُنِيبُ } [غافر: 13] إليه\n ويرجع نحوه طالباً الترقي من حضيض التقليد والتخمين إلى ذروة التحقيق واليقين\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { هو الذي يُريكم آياته } الدالة على كبريائه\n وكمال قدرته\n من الرياح\n والسحاب\n والرعد\n والبرق\n والصواعق\n وغير ذلك\n لتستدلوا على ذلك\n وتعملوا بموجبها\n فتُوحدوه تعالى\n وتخصُّوه بالعبادة\n { ويُنزّل لكم من السماء رزقاً } مطراً لأنه سبب الرزق\n وأفرده بالذكر مع كونه مِن جملة الآيات لتفرُّده بكونه من آثار رحمته\n وجلائل نِعَمه الموجبة للشكر إذ به قوام الحيوانات بأسرها\n وصيغة المضارع في الفعلين للدلالة على تجدُّد الإراءة والتنزيل\n واستمرارهما\n { وما يتذكَّرُ إِلا مَن يُنيب } أي: وما يتعظ ويعتبر بهذه الآيات الباهرة\n ويعمل بمقتضاها إلا مَن يتوب ويرجع عن غيّه إلى الله تعالى\n فيتفكّر فيما أودعه في تضاعيف مصنوعاته من شواهد قدرته الكاملة\n ونِعَمه الشاملة\n وأما المعاند فلا يتعظ ولا يعتبر لسفح الران على قلبه\n وإذا كان الأمر كما ذكرنا\n من اختصاص التذكير بمَن ينيب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:8",
      "similarity": 0.7559300334722017
    },
    {
      "verse": "13:27",
      "similarity": 0.6957628221658309
    },
    {
      "verse": "30:31",
      "similarity": 0.6708216172067459
    },
    {
      "verse": "39:54",
      "similarity": 0.6557888303025098
    },
    {
      "verse": "42:10",
      "similarity": 0.6322694257868002
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}