{
  "chapter": "غافر",
  "text": "وانذرهم يوم الءازفة اذ القلوب لدى الحناجر كظمين ما للظلمين من حميم ولا شفيع يطاع",
  "translations": [
    {
      "translation": "And warn them of the Day of Immediacy when hearts rise choking to the throat. The wrongdoers will have no close friend nor any intercessor who might be heard.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of the coming day inevitable, when hearts would jump to the throats, filling them with anguish. The sinners will have neither friend nor intercessor whose (word) will be heeded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), then warn them of the Day that has drawn near, the Day when hearts full of suppressed grief will leap up to the throats and the wrong-doers shall neither have any sincere friend nor intercessor whose word will be heeded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), warn them of the approaching day when because of hardship and frustration their hearts will almost reach up to their throats. The unjust will have no friends nor any intercessor who will be heard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the day of impending calamity, when hearts will rise up to the throats filled with grief; and the disbelievers will have neither any friend nor any intercessor who will be obeyed. (Intercession will be accepted only for the Muslims, not for the disbelievers)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day that is drawing near, when the hearts will be at the throats Kazimin. There will be no friend, nor an intercessor for the wrongdoers, who could be given heed to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the day that draws near, when hearts shall rise up to the throats, grieving inwardly; the unjust shall not have any compassionate friend nor any intercessor who should be obeyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them against the Day of the Imminent when, choking with anguish, the hearts are in the throats and the evildoers have not one loyal friend, no intercessor to be heeded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them (O Muhammad) of the Day of the approaching (doom), when the hearts will be choking the throats, (when) there will be no friend for the wrong-doers, nor any intercessor who will be heard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Prophet] forewarn them of the approaching Day, when hearts will leap up to the throats and choke them; when the wrongdoers will have no friend, nor any intercessor who will be listened to,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore warn them thou of the Day of portending, whereon the hearts will be in the throats, choking: then will be for the wrong- doers no ardent friend nor an intercessor to be given heed to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of the Approaching Day, when the hearts will be at the throats, choking with suppressed agony, [and] the wrongdoers will have no sympathizer, nor any intercessor who might be heard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of the Day that is (ever) drawing near, when the hearts will (come) right up to the throats to choke (them); No intimate friend nor intercessor will the wrong-doers have, who could be listened to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them (O Muhammad SAW) of the Day that is drawing near (i.e. the Day of Resurrection), when the hearts will be choking the throats, and they can neither return them (hearts) to their chests nor can they throw them out. There will be no friend, nor an intercessor for the Zalimun (polytheists and wrong-doers, etc.), who could be given heed to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them against the Imminent Day when, choking with anguish, the hearts will be in their throats, the harmdoers will not have a single, loyal friend, and there will be no intercessor to be obeyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day of Imminence, when the hearts are at the throats, choking them. The evildoers will have no intimate friend, and no intercessor to be obeyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them, [O Muhammad], of the Approaching Day, when hearts are at the throats, filled [with distress]. For the wrongdoers there will be no devoted friend and no intercessor [who is] obeyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:18] And warn them of the Impending Day, namely, the Day of Resurrection (al-azifa, as in azifa al-rahīlu, ‘departure is very near’) when the hearts will, rising up in fear, reach the throats, choking with anguish, filled with [suppressed] anxiety (kāzimīna is a circumstantial qualifier referring to al-qulūbu, ‘the hearts’, which is qualified by the [active animate participle] plural [kāzimīna] and referred to as though they were the very individuals themselves). The evildoers will not have any intimate [friend], [any] sympathiser, nor any intercessor who might be heeded — the adjectival qualification [‘who might be heeded’] has no [literal] significance, for they do not have intercessors in the first place: So [now] we have no intercessors … [Q. 26:100]. The first part, however, may [be said to] have significance if [understand] on the basis of their claim to have intercessors, and so, in other words, even if — hypothetically speaking — they [their intercessors] did intercede for them, they would not be heeded.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Warn them) Muhammad (of the Day of the approaching (doom)) of the horrors of the Day of Doom which is the Day of Judgement, (when the hearts will be choking the throats) because of grief and distress due to the exasperation they feel inwardly, ((when) there will be no friend) no close friend to help (for the wrong-doers) for the idolaters, (nor any intercessor who will be heard) upon interceding for them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَنذِرْهُمْ يَوْمَ ٱلأَزِفَةِ إِذِ ٱلْقُلُوبُ لَدَى ٱلْحَنَاجِرِ كَاظِمِينَ } فيومُ الأَزِفةِ: هو يَومُ القِيامةِ وكاظمين: معناه مغتمونَ\n\n\n\n\nوقوله تعالى: { مَا لِلظَّالِمِينَ مِنْ حَمِيمٍ وَلاَ شَفِيعٍ } فالظَّالمونَ: الكَافرونَ\n والحَميمُ: القَريبُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {And warn them of the Day of Al-A'zifah, when the hearts will be choking while they are at the throats} - meaning, on the Day of Al-A'zifah: that is the Day of Resurrection, and they are choking: meaning, they are terrified.\n And His saying, {There is no friend or intercessor for the unjust}, so the unjust are the disbelievers.\n\n\nAnd the intimate: the close one.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنذِرْهُمْ } يا أكمل الرسل؛ أي: عموم المكلفين { يَوْمَ ٱلأَزِفَةِ } والمشارفة على العذاب الأبدي، حين أحضروا على شفير جهنم للطرح فيها { إِذِ ٱلْقُلُوبُ } أي: قلوب أولئك المحضرين ترتفع حينئذ { لَدَى ٱلْحَنَاجِرِ } وتلتصق بحلاقيمهم من كمال هولهم واضطرابهم، وكانوا حينئذ { كَاظِمِينَ } ومملوئين من الغم والحزن وأنواع الكآبة والخذلان، وبالجملة: { مَا لِلظَّالِمِينَ } أي: لهؤلاء المسرفين المقصورين على الخيبة والخسران حينئذ { مِنْ حَمِيمٍ } قريب يدركهم، ويولي أمرهم، ويسعى في استخلاصهم { وَلاَ شَفِيعٍ يُطَاعُ } [غافر: 18] أي: شفيع يشفع ويقبل الشفاعة منه لأجلهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وأنذِرْهُم يوم الأَزفةِ } أي: القيامة، سُميت بها لأزوفها، أي: قُربها\n فالأُزوف والازدلاف هو القرب، غير أن فيه إشعاراً بضيق الوقت، أو الخطة الأزفة، وهي مشارفة أهل النار لدخولها، ثم أبدل من يوم الآزفة قوله: { إِذِ القلوبُ لدى الحناجر } أي: التراقي، يعني: ترتفع قلوبُهم عن مقارّها، فتلتصق بحناجرهم من الرعب، فلا هي تخرج فيموتوا فيستريحوا، ولا ترجع إلى مقارها فيتروّحوا\n حال كونهم { كاظمين } ممسكين الغيظ بحناجرهم، أو: ممسكين قلوبهم بحناجرهم، يرومون ردها لئلا تخرج، فهو حال من القلوب، وجمعت جمع السلامة لوصفها بالكظم، وهو من أوصاف العقلاء، أو: من أصحاب القلوب إذ الأصل: قلوبهم، أو: من ضميرها في الظرف، { ما للظالمين من حميمٍ } أي: قريب مشفق { ولا شفيعٍ يُطاع } أي: ولا شفيع تُقبل شفاعته، فالمراد: نفي الشفاعة والطاعة، كقول الشاعر:\n\nيريد به: نفي الضب وانجحاره\n وكقول الآخر:\n\nوإن احتمل اللفظ نفي الطاعة دون الشفاعة\n فعن الحسن البصري: \" والله ما يكون لهم شفيع ألْبتة \"\n ووضع \" الظالمين \" موضع الضمير للتسجيل عليهم بالظلم وتعليل الحكم به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:57",
      "similarity": 0.5442339048327868
    },
    {
      "verse": "33:10",
      "similarity": 0.4745418402354361
    },
    {
      "verse": "43:17",
      "similarity": 0.1958860297653241
    },
    {
      "verse": "3:134",
      "similarity": 0.195286644252972
    },
    {
      "verse": "68:48",
      "similarity": 0.1947861341624121
    }
  ]
}