{
  "chapter": "غافر",
  "text": "يعلم خائنة الاعين وما تخفى الصدور",
  "translations": [
    {
      "translation": "Known to Him is the treachery of the eye, and what the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows even the most stealthy glance of the eyes and all the secrets that hearts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows the disloyalty of the eyes and what the hearts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah well knows the covert glance and all what lies hidden in the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows the fraud of the eyes, and all that the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows the stealthy looks and that which the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows the treachery of the eyes and what the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knoweth the traitor of the eyes, and that which the bosoms hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[for] He is aware of the [most] stealthy glance, and of all that the hearts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knoweth the fraudulence of the eyes, and that which the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows the treachery of the eyes, and what the breasts hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) knows of (the tricks) that deceive with the eyes, and all that the hearts (of men) conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows the fraud of the eyes, and all that the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) knows the furtive looks of the eyes and what the chests conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows the deceptions of the eyes, and what the hearts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows that which deceives the eyes and what the breasts conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:19] He, namely, God, knows the treachery of the eyes, when it steals a glance at what is prohibited [for it to look at], and what the breasts hide — [what] the hearts [hide].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He knoweth the traitor of the eyes) the glance after the second glance of treachery, (and that which the bosoms hide) He knows also what is people's chests after the second glance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَعْلَمُ خَآئِنَةَ ٱلأَعْيُنِ } قال: والرَّجلُ يكونُ في القَومِ، فتمر بِهمْ المَرأةُ، فيريهُم أنهُ يَغضُ نَظرَهُ، فإذا رأى منهُم غَفلةً، لَحِظَ إليها؛ فإنْ خَافَ أنْ يَفطِنوا لَهُ غَضَّ نَظرَهُ، فإذا رأى منهُم غَفلةً، لَحِظَ إليها؛ فإنْ خَافَ أنْ يَفطِنوا لَهُ غَضَّ نَظَرَهُ، وَقدْ اطلعَ الله تَعالى مَن قَلبهِ أنهُ ودَّ أنهُ نَظَرَ إلى عَورتِها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nمع أنه سبحانه { يَعْلَمُ } بعلمه الحضوري { خَآئِنَةَ ٱلأَعْيُنِ } أي: خيانتهم التي يتغامزن بعيونهم نحو محارم الله { وَ } يعلم أيضاً { مَا تُخْفِي ٱلصُّدُورُ } [غافر: 19] أي: ما تخفي صدورهم من الميل إلى الشهوات المحرمة بلا مباشرة الآلات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يعلم خائنةَ الأعين } أي: النظرة الخائنة، كاستراق النظر إلى ما لا يحلّ\n قيل: فيه تقديم وتأخير، أي: الأعين الخائنة، وقيل: مصدر، كالعافية، أي: خيانة الأعين\n قال ابن عباس رضي الله عنه: هو الرجل يكون جالساً مع القوم، فتمر المرأة، فيسارقهم النظر إليها\n هـ\n وقال ابن عطية: متصل بقوله: { سريع الحساب } ، فيحاسب على خيانة الأعين، وقالت فرقة: متصل بقوله: { لا يَخفى على الله منهم شيء } ، وهذا حسن، يُقويه تناسب المعنيَيْن، ويُبعده بعدُ الآية من الآية، وكثرة الحائل\n والحاصل: أنه متصل بما تقدّم من ذكر الله ووصفه، واعترض في أثناء ذلك بوصف القيامة لما استطرد إليه من قوله: { ليُنذر يوم التلاق } الآية\n قاله المحشي\n { و } يعلم { ما تُخفي الصدورُ } أي: ما تُكنّه من خيانة وأمانة\n وقيل: هو أن ينظر إلى أجنبية بشهوةٍ مسارقة، ثم يتفكّر بقلبه في جمالها، ولا يعلم بنظرته وفكرته مَن حَضرَه، والله يعلم ذلك كله",
      "translations": []
    }
  ]
}