{
  "chapter": "غافر",
  "text": "فلما جاءهم بالحق من عندنا قالوا۟ اقتلوا۟ ابناء الذين ءامنوا۟ معه واستحيوا۟ نساءهم وما كيد الكفرين الا فى ضلل",
  "translations": [
    {
      "translation": "When he brought them the truth from Us they said, 'Slaughter the sons of those who have iman with him but let their women live.' The stratagems of the kafirun are nothing but errors.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he brought the truth to them from Us, they said: \"Slay the sons of those who believe with him, and spare their women.\" But the unbelievers' stratagem is bound to fail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses brought them the Truth from Us they said: “Kill the sons of all the believers who have joined him, but spare the women.” The guile of the unbelievers always ends in vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We sent him to them for a genuine purpose, they said, \"Kill the sons of those who have believed in him but keep their women alive.\" The plots of the unbelievers can only result in failure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he brought the truth from Our presence to them, they said, “Kill the sons of those who believe in him, and keep their women alive”; and the evil scheme of the disbelievers only keeps wandering astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he brought them the Truth from Us, they said: \"Kill with him the sons of those who believe and let their women live;\" but the plots of disbelievers are nothing but in vain!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he brought to them the truth from Us, they said: Slay the sons of those who believe with him and keep their women alive; and the struggle of the unbelievers will only come to a state of perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he brought them the truth from Us, they said, 'Slay the sons of those who believe with him, and spare their women.' But the guile of the unbelievers is ever in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he brought them the Truth from Our presence, they said: Slay the sons of those who believe with him, and spare their women. But the plot of disbelievers is in naught but error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came to them with the truth from Us, they said, \"Slay the sons of those who believe with him and spare only their daughters\" -- the schemes of those who denied the truth were futile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he came to them with the truth from before Us, they said: slay the sons of those who have believed with him, and let their women live. And the plot of the infidels was naught but vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he brought them the truth from Us, they said, ‘Kill the sons of the faithful who are with him, and spare their women.’ But the stratagems of the faithless only go awry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, when he came to them in Truth, from Us, they said, \"Slay the sons of those who believe with him, and keep alive their females,\" but the plots of Unbelievers (end) in nothing but errors (and delusions)!...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he brought them the Truth from Us, they said: \"Kill the sons of those who believe with him and let their women live\", but the plots of disbelievers are nothing but errors!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he brought them the truth from Us they said: 'Kill the sons of those who believe with him, but spare their women' But the scheming of the unbelievers is always in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he came to them with the truth from Us, they said, “Kill the sons of those who have believed with him, and spare their daughters.” But the scheming of the unbelievers can only go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he brought them the truth from Us, they said, \"Kill the sons of those who have believed with him and keep their women alive.\" But the plan of the disbelievers is not except in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:25] So when he brought them the truth from Us, they said, ‘Slay the sons of those who believe with him, and spare, keep alive, their women’. But the guile of the disbelievers is ever in error, in perdition.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he) i.e. Moses (brought them the Truth) the Scripture (from Our presence, they said: Slay the sons of those who believe with him) i.e. return to killing the sons of those who believe in him, (and spare their women) for use as servants. (But the plot of disbelievers) the plot of Pharaoh and his folk (is in naught but error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَهُمْ } موسى ملتبساً { بِٱلْحَقِّ } مؤبداً { مِنْ عِندِنَا } وآمن له بنو إسرائيل حين عاينوا منه الآيات الكبرى والمعجزات العظمى { قَالُواْ } يعني: فرعون أصالة\n وملؤه تعباً لأعوانهم وأتباعهم: { ٱقْتُلُوۤاْ أَبْنَآءَ ٱلَّذِينَ آمَنُواْ مَعَهُ } يعني: أعيدوا على بني إسرائيل الزجر الشنيع الذي أنتم تفعلون معهم من قبل { وَٱسْتَحْيُواْ نِسَآءَهُمْ } للزواج والوقاع\n تعييراً عليهم وتضعيفاً لهم\n يعني: هم قصدوا المكر والمقت على أولئك المؤمنين بقولهم هذا { وَ } ما يظن أنهم ممكورون وممقوتون\n إذ { مَا كَـيْدُ ٱلْكَافِرِينَ } ومكرهم حيث كادوا ومكروا { إِلاَّ فِي ضَلاَلٍ } [غافر: 25] أي: هلاك وبوار على أهل الحق\n لذلك لم ينالوا على ما قصدوا\n بل عاد عليهم\n ولحق بهم أضعاف ما قصدوا إياهم\n ومكروا لأجلهم\n\n\n{ وَ } بعدما ظهر أمر موسى الكليم وعلا قدره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واستحيُوا نساءَهم } للخدمة\n أي: أَعيدوا عليهم القتل الذي كنتم تفعلونه أولاً\n وكان فرعون قد كفَّ عن قتل الولدان لئلا تعطل خدمته\n فلما بُعث عليه السلام\n وأحسَّ بأنه قد وقع ما توقع\n أعاده عليهم غيظاً\n وحُمقاً\n وزعماً منه أن يصدهم بذلك عن مظاهرته\n { وما كيدُ الكافرين إِلا في ضلالٍ } في ضياع وبطلان\n فإنهم باشروا قتلهم أولاً\n فما أغنى عنهم\n ونفذ قضاء الله بإظهار مَن خافوه\n فما يغني عنهم هذا القتل الثاني\n فلم يعلم أن كيده ضائع في الكَرّتين\n واللام: إما للعهد المتقدم\n والإظهار في موضع الإضمار لذمهم بالكفر\n والإشعار بعلة الحكم\n أو: للجنس وهم داخلون فيه دخولاً أوليّاً\n والجملة: اعتراض جيء بها في تضاعيف ما حكى عنهم من الأباطيل للمسارعة إلى بيان بطلان ما أظهروه من الإبراق والإرعاد الذي لا طائل تحته\n { وقال فرعونُ } لملئه: { ذروني أقتلْ موسى } \n وكان ملَؤه إذا همَّ بقتله كفّوه\n وقالوا: ليس بالذي تخافه\n وهو أقل من ذلك\n وما هو إلا ساحر\n وإذا قتلتَه أدخلتَ شبهة على الناس\n واعتقدوا أنك عجزت عن معارضته بالحجة\n والظاهر من دهاء اللعين ونكارته أنه قد استيقن أنه نبيّ\n وأن ما جاء به آيات باهرة\n وما هو بسحر\n ولكن كان يخاف إن همّ بقتله أن يعاجَل بالهلاك\n وكان قوله تمويهاً على قومه\n وإيهاماً أنهم هم الكافُّون عن قتله\n ولولاهم لقتله\n وما كان يكفه إلا ما في نفسه من الفزع الهائل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "105:2",
      "similarity": 0.4974429557907355
    },
    {
      "verse": "86:16",
      "similarity": 0.4612244379091786
    },
    {
      "verse": "77:39",
      "similarity": 0.4584552027867472
    },
    {
      "verse": "86:15",
      "similarity": 0.45738476244289356
    },
    {
      "verse": "52:42",
      "similarity": 0.44772806855917746
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/40:25.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/40:25.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}