{
  "chapter": "غافر",
  "text": "يقوم لكم الملك اليوم ظهرين فى الارض فمن ينصرنا منۢ باس الله ان جاءنا قال فرعون ما اريكم الا ما ارى وما اهديكم الا سبيل الرشاد",
  "translations": [
    {
      "translation": "O my people, authority is yours today being the most powerful in the land; but who will save us from the scourge of God if it fall upon us?\" \"I show you,\" said the Pharaoh, \"only what I see (is right), and guide you but to the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, today the kingdom is yours, and you are supreme in the land. But if Allah's chastisement were to come upon you, who will come to our help?” Pharaoh said: “I only counsel what I consider right; I only direct you to the Path of Rectitude.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, today you have the kingdom and the power on earth but who will help us against the wrath of God if it will befall us?\" The Pharaoh said, \"I show you only what I think is proper and guide you only to the right direction\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people! You now rule the earth, dominant; so who will save us from Allah’s punishment if it comes upon us?” Said Firaun, “I only explain to you what I think is correct, and I show you only the right path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Yours is the kingdom today, you being dominant in the land. But who will save us from the torment of Allah, should it befall us\" Fir`awn said: \"I show you only that which I see, and I guide you only to the path of right policy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! yours is the kingdom this day, being masters in the land, but who will help us against the punishment of Allah if it come to us? Firon said: I do not show you aught but that which I see (myself), and I do not make you follow any but the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, today the kingdom is yours, who are masters in the land. But who will help us, against the might of God, if it comes upon us?' Said Pharaoh, 'I only let you see what I see; I only guide you in the way of rectitude.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Yours is the kingdom to-day, ye being uppermost in the land. But who would save us from the wrath of Allah should it reach us? Pharaoh said: I do but show you what I think, and I do but guide you to wise policy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! Yours is the kingdom today, you have dominion in the land; but who will help us against the scourge of God if it befalls us?\" But Pharaoh said, \"I point out to you only that which I consider right; and I guide you to the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My people! yours is the the dominion to-day: ye being overcomers in the land; but who will succour us aginst the scourge of God if it cometh Unto us! Fir'awn said: I shew you only that which see, and I guide you but to the path of rectitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Today sovereignty belongs to you, and you are dominant in the land. But who will save us from Allah’s punishment should it overtake us?’ Pharaoh said, ‘I just point out to you what I see [to be advisable for you], and I guide you only to the way of rectitude.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my People! Yours is the dominion this day: Ye have the upper hand in the land: but who will help us from the Punishment of Allah, should it befall us?\" Pharaoh said: \"I but point out to you that which I see (myself); Nor do I guide you but to the Path of Right!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Yours is the kingdom this day, you are uppermost in the land. But who will save us from the Torment of Allah, should it befall us?\" Fir'aun (Pharaoh) said: \"I show you only that which I see (correct), and I guide you only to the path of right policy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my nation, today the kingdom is yours and you are the masters in the land. But, if the might of Allah should come against us, who will help us' Pharaoh said: 'I only let you see what I see. I guide you to the path of righteousness'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Yours is the dominion today, supreme in the land; but who will help us against God’s might, should it fall upon us?” Pharaoh said, “I do not show you except what I see, and I do not guide you except to the path of prudence.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, sovereignty is yours today, [your being] dominant in the land. But who would protect us from the punishment of Allah if it came to us?\" Pharaoh said, \"I do not show you except what I see, and I do not guide you except to the way of right conduct.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:29]   O my people! Today the kingdom is yours: [you are] dominant, prevailing (zāhirīna, a circumstantial qualifier) in the land, the land of Egypt. But who will help us against the might of God, [against] His chastisement, if you [resolve to] slay His friends, should it reach us?’ In other words, we would have no helper. Pharaoh said, ‘I only point out to you what I see [to be best], that is to say, I only suggest to you what I suggest to myself, and that is, to kill Moses [would be best]; and I am only guiding you to the path of rectitude’, [to] the correct way.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my people! Yours is the kingdom today, ye being uppermost) triumphant (in the land) of Egypt. (But who would save us from the wrath of Allah) from the torment of Allah (should it reach us) when it comes to us? (Pharaoh said: I do but show you) I do but command you (what I think) is my right that you should worship, (and I do but guide you) call you (to wise policy) to the way of the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ناداهم وخاطبهم مضيفاً لهم إلى نفسه إمحاضاً للنصح، واشتراكاً معهم في الوبال النازل عليه، فقال: { يٰقَومِ لَكُمُ ٱلْمُلْكُ ٱلْيَوْمَ } أي: ملك العمالقة مختص لكم اليوم بلا منازع ومخاصم، حال كونكم { ظَاهِرِينَ } عالين غالبين { فِي } أقطار { ٱلأَرْضِ } كلها، والحمد لله والمنَّة، فلا ترتكبوا فعلاً جالباً لغضب الله عليكم، بل اتركوا قتله، وإلاَّ { فَمَن يَنصُرُنَا } وينقذنا { مِن بَأْسِ ٱللَّهِ } المنتقم الغيور وعذابه { إِن جَآءَنَا } ونزل علينا بسبب قتل الصادق الصدوق في الدعوى، المرسل من عند الله تبارك وتعالى، لو نزل بما كيف ندفعه؟\n\n\n\n\nقيل: هذا القائل المؤمن هو ابن عم فرعون، وهو عنده من المقربين\n\n\n\n\nثم لما سمع فرعون من كلامه المشتمل على محض النصح { قَالَ فِرْعَوْنُ } معرضاً له مطرحاً إياه: { مَآ أُرِيكُمْ } وأشير إليكم في رفع هذا المفسد المدعي { إِلاَّ مَآ أَرَىٰ } واستصوب في رأيي، واستقر عليه فكري، وهو أن يقتله ليدفع شره { وَ } اعملوا أيها الملأ { مَآ أَهْدِيكُمْ } بقولي هذا، وأمري بقتله { إِلاَّ سَبِيلَ ٱلرَّشَادِ } [غافر: 29] الموصل إلى نجاتكم وخلاصكم من مفاسد هذا المدعي الساحر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال: { يا قوم لكم الملكُ اليومَ } حال كونكم { ظاهرين } غالبين عالين على بني إسرائيل { في الأرض } أرض مصر، لا يقاومكم أحد في هذا الوقت، { فمَن ينصُرنا من بأس الله إِن جاءنا } يعني: إن لكم اليوم مُلك مصر، وقد علوتم الناس، وقهرتموهم، فلا تُسرفوا على أنفسكم، ولا تتعرّضوا لبأس الله، أي: عذابه فإنه لا طاقة لكم به إن جاءكم، ولا يمنعكم منه أحد\n\n\nوإنما نسب ما يُسرهم من المُلك والظهور في الأرض إليهم خاصة، ونظم نفسه فيما يسوؤهم، من مجيء بأس الله تعالى، إمحاضاً للنصح، وإيذاناً بأن الذي ينصحهم به هو مساهم لهم فيه\n { قال فرعونُ } بعدما سمع نصحه لقومه: { ما أُرِيكُم } أي: ما أُشير عليكم { إِلا ما أرى } وأستصوبه من قتل موسى، يعني: لا أستصوب إلا قتله، وهذا الذي تقولونه غير صواب، { وما أَهديكم } بهذا الرأي { إِلا سبيل الرشاد } أي: الصواب، ولا أعلنكم إلا ما أعلم، ولا أُسِرُّ عنكم شيئاً خلاف ما أُظهِر، يعني: أن لسانه وقلبه متواطئان على ما يقول، وقد كذب اللعين، فقد كان مضمراً للخوف الشديد من جهة موسى عليه السلام، ولكنه كان يتجلَّد، ولولا استشعاره للخوف لم يستشر أحداً في قتله، وقد كان سفَّاكاً جبّاراً، فما منعه إلا خوف الهلاك إن مدّ يده إليه، والله تعالى أعلم\n الإشارة: قال القشيري: قد نصح وأبلغ مؤمنٌ آل فرعون، واحتجَّ عليهم، فلم ينجعْ فيهم قوله، وأعاد عليهم نصحه فلم يسمعوا، وكان كما قيل:\n\nثم قال: { وَقَالَ ٱلَّذِيۤ آمَنَ يٰقَوْمِ }\n\n",
      "translations": []
    }
  ]
}