{
  "chapter": "غافر",
  "text": "وقال موسى انى عذت بربى وربكم من كل متكبر لا يؤمن بيوم الحساب",
  "translations": [
    {
      "translation": "Musa said, 'I seek refuge in my Lord and your Lord from every proud man who does not have iman in the Day of Reckoning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"I seek refuge in my Lord and your Lord from every insolent imposter who does not believe in the Day of Reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: “I have taken refuge with my Lord and your Lord from everyone who waxes arrogant and does not believe in the Day of Reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"I seek protection from your and my Lord against every arrogant person who has no faith in the Day of Judgment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “I seek the refuge of mine and your Lord, from every haughty person who does not believe in the Day of Reckoning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: \"Verily, I seek refuge in my Lord and your Lord from every arrogant who believes not in the Day of Reckoning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: Surely I take refuge with my Lord and-- your Lord from every proud one who does not believe in the day of reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, 'I take refuge in my Lord and your Lord from every man who is proud, and believes not in the Day of Reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: Lo! I seek refuge in my Lord and your Lord from every scorner who believeth not in a Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied, \"I seek refuge with my Lord and your Lord from every arrogant person who does not believe in the Day of Reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: verily I seek refuge in my Lord and your Lord from every stiff-necked person who believeth not in a Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, ‘I seek the protection of my Lord and your Lord from every arrogant one who does not believe in the Day of Reckoning.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"I have indeed called upon my Lord and your Lord (for protection) from every arrogant one who believes not in the Day of Account!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa (Moses) said: \"Verily, I seek refuge in my Lord and your Lord from every arrogant who believes not in the Day of Reckoning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: 'I take refuge in my Lord and in your Lord from every proud (person), who does not believe in Day of Reckoning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, “I have sought the protection of my Lord and your Lord, from every tyrant who does not believe in the Day of Account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Moses said, \"Indeed, I have sought refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:27] And Moses said, to his people, after he had heard that [saying of Pharaoh]: ‘Indeed I seek refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Reckoning’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Moses said: Lo! I seek refuge in my Lord and your Lord from every scorner) who is too proud to believe and (who believeth not in a Day of Reckoning) i.e. the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما وصل إلى موسى مقصد له العدو { قَالَ مُوسَىٰ } متوكلاً على الله مفوضاً أمره إليه: { إِنِّي عُذْتُ } والتجأت { بِرَبِّي وَرَبِّكُـمْ } الواحد الأحد الصمد المراقب على حفظ عباده الخُلَّص أيها المؤمنون { مِّن } شر { كُلِّ مُتَكَبِّرٍ } متناه في الكبر والخيلاء بمقتضى أهويته الباطلة وإرادته الفاسدة\n إذ { لاَّ يُؤْمِنُ } ويصدق { بِيَوْمِ ٱلْحِسَابِ } [غافر: 27] حتى يرتدع عن أمثال هذه الجرأة على رسل الله\n وخُلَّص عباده\n فإنه سبحانه يكفي عني مؤمنة شره\n\n\n{ وَ } بعدما صمم فرعون عزمه لقتل موسى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وفي قوله: { وربكم } حث لهم على أن يقتدوا به\n فيعوذوا بالله عياذتَه\n ويعتصموا بالتوكل اعتصامَه\n ولم يُسمّ فرعون\n بل ذكره بوصف يعمه وغيره من الجبابرة لتعميم الاستعاذة\n والإشعار بعلة القساوة والجرأة على الله تعالى\n وهو التكبُّر\n قال ابن عرفة: أشار إلى أن كفره لم يكن لأجل أن موسى لم يأتِ بدليل ولا معجزة\n ولم يكن أيضاً لخفاء تلك المعجزة\n وعدم ظهورها\n بل كان لجحود التعنُّت والتكبُّر\n والإباية عن الانحطاط من سلطنة الملك إلى رتبة الاتِّباع\n هـ\n وقال: { لا يؤمن بيوم الحساب } لأنه إذا اجتمع في الرجل التجبُّر والتكذيب بالجزاء\n وقلة المبالاة بالعاقبة\n فقد استكمل أسباب القوة والجرأة على الله وعباده\n والعياذ بالله\n الإشارة: قال القشيري: كان موسى عليه السلام أكرم خَلْقِه في وقته\n وكان فرعون أخَسّ خَلْقِه في وقته إذ لم يقل أحد: ما علمتُ لكم من إله غيري\n فأرسل أخصَّ عباده إلى أخسّ عباده\n ثم إن فرعون سعى في قتل موسى\n واستعان على ذلك بخَيْله ورَجْله\n ولكن كما قال تعالى: { وما كيد الكافرين إلا في ضلال } \n وإذا حَفَرَ أحدٌ لِوَليِّ الله حُفرةً\n ما وقع فيها غيرُ حافِرها\n كذلك أجرى الحقُّ سُنَّتَه\n هـ\n ثم ذكر موعظة مؤمن آل فرعون لقومه\n فقال: { وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ آلِ فِرْعَوْنَ يَكْتُمُ إِيمَانَهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "114:1",
      "similarity": 0.7758194558723307
    },
    {
      "verse": "19:18",
      "similarity": 0.7497379256116983
    },
    {
      "verse": "23:98",
      "similarity": 0.6203041630533341
    },
    {
      "verse": "11:47",
      "similarity": 0.613473354281878
    },
    {
      "verse": "12:79",
      "similarity": 0.6081508906650787
    }
  ]
}