{
  "chapter": "غافر",
  "text": "والله يقضى بالحق والذين يدعون من دونه لا يقضون بشىء ان الله هو السميع البصير",
  "translations": [
    {
      "translation": "Allah will judge with truth; and those you call upon apart from Him will not judge with anything at all. It is Allah who is the All-Hearing, the All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God decides with justice. But those they call apart from Him can not adjudge in the least. Verily God is all-hearing, all-perceiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge with justice, whereas those whom they call upon beside Him cannot judge at all. Surely Allah -- and He alone -- is All- Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God judges with Truth but those whom they worship besides God can have no Judgment. God is certainly All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah renders the true judgement; and those whom they worship instead of Him do not judge at all; indeed Allah only, is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with truth, while those to whom they invoke besides Him, cannot judge anything. Certainly, Allah! He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with the truth; and those whom they call upon besides Him cannot judge aught; surely Allah is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall decide justly, and those they call on, apart from Him, shall not decide by any means. surely God is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah judgeth with truth, while those to whom they cry instead of Him judge not at all. Lo! Allah, He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will judge with [justice and] truth: but those whom they invoke besides Him, have no power to judge at all. Surely, God is all hearing, all seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah decreeth with truth, while those whom they call upon beside Him cannot decree aught; verily Allah! He is the Hearer, the Beholder!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah judges with justice, while those whom they invoke besides Him do not judge by anything. Indeed it is Allah who is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will judge with (justice and) Truth: but those whom (men) invoke besides Him, will not (be in a position) to judge at all. Verily it is Allah (alone) Who hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with truth, while those to whom they invoke besides Him, cannot judge anything. Certainly, Allah! He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With justice Allah will judge, but those upon whom they call, other than Him, can not judge anything at all! Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God judges with justice, while those whom they invoke besides Him cannot judge with anything. It is God who is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with truth, while those they invoke besides Him judge not with anything. Indeed, Allah - He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:20]   And God decrees with truth, while those on whom they call, whom they worship, that is, the disbelievers of Mecca (read yad‘ūna, ‘they call’, or tad‘ūna, ‘you call’) besides Him — and these are the idols — do not decree by any means [at all]: so how can they be God’s associates? Truly God is the Hearer, of their sayings, the Seer, of their actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah judgeth with truth) Allah allows intercession for whomever He wishes on the Day of Judgement; it is also said that this means: He commands with justice, (while those to whom they cry) worship (instead of Him) of idols (judge not at all) they will not judge anything in terms of intercession on the Day of Judgement, because they have no power to do so; it is also said that this means: they do not command any good in the life of the world because they are deaf and dumb. (Lo! Allah, He is the Hearer) of what they say (the Seer) He sees them and sees their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { ٱللَّهُ } المطلع بظواهرهم وضمائرهم { يَقْضِي } ويحكم بهم، ويجازي عليهم بمقتضى علمه وخبرته منهم { بِٱلْحَقِّ } بلا حيف وميل إظهاراً لكمال عدالته { وَٱلَّذِينَ يَدْعُونَ مِن دُونِهِ } سبحانه من الأوثان والأصنام { لاَ يَقْضُونَ } ولا يحكمون لا لهم ولا عليهم { بِشَيْءٍ } من نفع وضر؛ إذ هم جمادات لا شعور لها { إِنَّ ٱللَّهَ } القادر المقتدر على أنواع الإنعام والانتقام { هُوَ ٱلسَّمِيعُ } لجميع ما صدر من ألسنة استعداداته { ٱلْبَصِيرُ } [غافر: 20] بما ظهر على هياكل هوياتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والله يقضي بالحق } أي: ومَن هذه صفاتُه لا يقضي إلا بالعدل، فيُجازي كُلاًّ بما يستحقه إذ لا يخفى عليه خفيّ ولا جليّ، { والذين يَدْعُون } يعبدونهم { من دونه } من الآلهة { لا يقضون بشيء } ، وهذا تهكُّم بهم لأن الجماد الذي لا يعقل لا يقال فيه: يقضي ولا يقضي، وقرأ نافع بالخطاب أو: على إضمار \" قل \" ، { إِن الله هو السميعُ البصير } تقرير لقوله: { يعلم خائنة الأعين وما تُخفي الصدور } ووعيد لهم لأنه يسمع ما يقولون، ويُبصر ما يعملون، وأنه يعاقبهم عليه، وتعريض بما يدعون من دون الله، بأنها لا تسمع ولا تُبصر\n\n\nالإشارة: قال القشيري: قيامةُ الكل مؤجَّلة، وقيامةُ المحبين مُعَجَّلة، في كلِّ نَفَسٍ من العتاب والعذاب، والبعَاد والاقتراب، ما لم يكن في حساب، وشهادة الأعضاء بالدمع تشهد، وخفَقَانُ القلب ينطق، والنحولُ يُخْبِرُ، واللونُ يفضح، والعبد يستر، ولكن البلاء يُظهر، قال:\n\nوقوله تعالى: { إِذِ القلوبُ لدى الحناجرِ كاظمين } ، هو في حق مَن فاته التأهُّب والترقِّي في هذه الدار، فتحسَّر حين يُعاين مقامات الرجال، وليس له شفيع يُرقيه، ولا حميم يُصافيه\n وقوله تعالى: { يعلم خائنة الأعين } هو في حق العارفين: النظر إلى السِّوى بعين الاستحسان\n قال القشيري: خائنة الأعين هي من المحبين استحسانهم شيئاً ـ أي: من السِّوى ـ وأنشدوا:\n\nوأنشد أيضاً:\n\nقلت: ومثله قول الشاعر:\n\nثم قال: ومن خائنة الأعين: أن تأخذهم السِّنَةُ والسِّنات في أوقات المناجاة، وفي قصص داود عليه السلام: \" كَذَبَ مَن ادَّعَى محبتي، فإذا جَنَّهُ الليل نام عني، ومن خائنة أعين العارفين: أن يكون لهم خير، أي: استحسان يقع لقلوبهم مما تقع عليه أعينهم، ينظرون ولكن لا يُبصرون ـ أي: ينظرون إلى المستحسنات، ولكن لا يقفون معها ـ ومن خائنة أعين الموحِّدين ـ أي: السائرين للتوحيد ـ أن يخرج منها قطرة دمعٍ، تأسفاً على مخلوق يفوت من الدنيا والآخرة، ومن خائنة الأعين: النظرُ إلى غير المحبوب بأَي وجهٍ كان، ففي الخبر:\n\n \" حُبَّكَ الشيء يُعْمِي ويُصمُّ \" \n\nأي: يُغَيبك عن غيره، فلا ترى إلا محاسن الحبيب، وجماله في مظاهر تجلياته، وإليه يشير قول ابن الفارض رضي الله عنه:\n\nوقوله تعالى: { والله يقضي بالحق } قال القشيري: يقضي للأجانب بالبعاد، ولأهل الوداد بالوصال، ويقضي يومَ القدوم بعدل عُمال الصدود\n هـ\n أي: يعدل في أهل الصدود عن حضرته، فيجازيهم بنعيم الأشباح فقط\n ثم قال: وإذا ذبح الموت غدا بين الجنة والنار على صورة كبش أملح، فلا غَرو أن يذبح الفراق على رأس سكة الأحباب، في صورة شخص، ويُصلب على جذوع الغيرة، لينظر إليه أهل الحضرة\n هـ\n ثم أمر بالتفكُّشر ـ الذي هو طريق النجاة من كل ضرر ـ فقال: { أَوَلَمْ يَسِيروُاْ فِي ٱلأَرْضِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:20",
      "similarity": 0.4667950654892472
    },
    {
      "verse": "7:198",
      "similarity": 0.45354882579969547
    },
    {
      "verse": "27:78",
      "similarity": 0.4107385188483608
    },
    {
      "verse": "40:68",
      "similarity": 0.39276656954957573
    },
    {
      "verse": "29:42",
      "similarity": 0.39092234691819094
    }
  ]
}