{
  "chapter": "غافر",
  "text": "وقال رجل مؤمن من ءال فرعون يكتم ايمنه اتقتلون رجلا ان يقول ربى الله وقد جاءكم بالبينت من ربكم وان يك كذبا فعليه كذبه وان يك صادقا يصبكم بعض الذى يعدكم ان الله لا يهدى من هو مسرف كذاب",
  "translations": [
    {
      "translation": "A man among Pharaoh's people who had iman, but kept his iman concealed, said, 'Are you going to kill a be it on his own head. But if he is telling the truth, then some of what he is promising you will certainly happen to you. Allah does not guide any unbridled inveterate liar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believer from the House of Pharaoh who had kept his faith to himself, said: \"Will you kill a man because he says: 'My Lord is God,' when he has brought clear signs from his Lord to you? If he is a liar his lie will recoil back on him; but in case he speaks the truth, then what he predicts will befall you. Surely God does not show the way to the shameful liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then a man endowed with faith, from Pharaoh's folk, who had kept his faith hidden, said: “Do you kill a person simply because he says: 'My Lord is Allah' even though he brought to you clear Signs from your Lord? If he is a liar, his lying will recoil upon him; but if he is truthful, you will be smitten with some of the awesome consequences of which he warns you. Allah does not guide to the Right Way any who exceeds the limits and is an utter liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believing person from the people of the Pharaoh who concealed his faith said, \"Would you kill a man just because he says God is my Lord? He has brought you illustrious miracles from your Lord. If he speaks lies, it will only harm him, but if he speaks the Truth, some of his warnings may affect you. God does not guide a transgressing liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said a Muslim man from the people of Firaun, who used to hide his faith, “What! You want to kill a man just because he says, ‘Allah is my Lord’ whereas he has indeed brought clear signs to you from your Lord? And supposedly if he is speaking wrongly, then the calamity of wrongful speech is upon him; and if he is truthful, then part of what he promises you will reach you; indeed Allah does not guide any transgressor, excessive liar.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a believing man of Fir`awn's family, who hid his Faith said: \"Would you kill a man because he says: `My Lord is Allah,' and he has come to you with clear signs from your Lord And if he is a liar, upon him will be (the sin of) his lie; but if he is telling the truth, then some of that (calamity) wherewith he threatens you will befall on you.\" Verily, Allah guides not one who is a transgressor, a liar!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a believing man of Firon's people who hid his faith said: What! will you slay a man because he says: My Lord is Allah, and indeed he has brought to you clear arguments from your Lord? And if he be a liar, on him will be his lie, and if he be truthful, there will befall you some of that which he threatens you (with); surely Allah does not guide him who is extravagant, a liar:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then said a certain man, a believer 'of Pharaoh's folk that kept hidden his belief, 'What, will you slay a man because he says, \"My Lord is God,\" yet he has brought you the clear signs from your Lord? If he is a liar, his lying is upon his own head; but if he is truthful, somewhat of that he promises you will smite you. Surely God guides not him who is prodigal and a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a believing man of Pharaoh's family, who hid his faith, said: Would ye kill a man because he saith: My Lord is Allah, and hath brought you clear proofs from your Lord? If he is lying, then his lie is upon him; and if he is truthful, then some of that wherewith he threateneth you will strike you. Lo! Allah guideth not one who is a prodigal, a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believer, a man from among the people of Pharaoh, who had concealed his faith, said, \"Would you slay a man merely because he says, \"My Lord is God.\" He has brought you clear signs from your Lord, and if he is lying, the sin of his will be on his own head; but if he is truthful, a part of that of which he warns you will surely befall you. Certainly, God does not guide one who is a transgressor and a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a believing man of Fir'awn 's household, hiding his belief, said: would ye slay a man because he saith: my Lord is God, and hath come upto you with evidences from your Lord? If he is a liar, then upon him will be his lie, and if he is a truth-teller, then there will befall you some of that wherewith he threateneth you; verily God guideth not one who is an extravagant and a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said a man of faith from Pharaoh’s clan, who concealed his faith, ‘Will you kill a man for saying, ‘‘My Lord is Allah,’’ while he has already brought you manifest proofs from your Lord? Should he be lying, his falsehood will be to his own detriment; but if he is truthful, there shall visit you some of what he promises you. Indeed Allah does not guide someone who is a transgressor and liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believer, a man from among the people of Pharaoh, who had concealed his faith, said: \"Will ye slay a man because he says, 'My Lord is Allah'?- when he has indeed come to you with Clear (Signs) from your Lord? and if he be a liar, on him is (the sin of) his lie: but, if he is telling the Truth, then will fall on you something of the (calamity) of which he warns you: Truly Allah guides not one who transgresses and lies!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a believing man of Fir'aun's (Pharaoh) family, who hid his faith said: \"Would you kill a man because he says: My Lord is Allah, and he has come to you with clear signs (proofs) from your Lord? And if he is a liar, upon him will be (the sin of) his lie; but if he is telling the truth, then some of that (calamity) wherewith he threatens you will befall on you.\" Verily, Allah guides not one who is a Musrif (a polytheist, or a murderer who shed blood without a right, or those who commit great sins, oppressor, transgressor), a liar!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But one of Pharaoh's people, who was in secret a believer, asked: 'Would you kill a man because he says: \"My Lord is Allah?\" He has brought you clear signs from your Lord. If he is lying, let his lie be on his head, but, if he is speaking the truth then at least a part of what he promises will befall you. Allah does not guide the lying sinner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believing man from Pharaoh's family, who had concealed his faith, said, “Are you going to kill a man for saying, `My Lord is God,’ and he has brought you clear proofs from your Lord? If he is a liar, his lying will rebound upon him; but if he is truthful, then some of what he promises you will befall you. God does not guide the extravagant imposter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a believing man from the family of Pharaoh who concealed his faith said, \"Do you kill a man [merely] because he says, 'My Lord is Allah' while he has brought you clear proofs from your Lord? And if he should be lying, then upon him is [the consequence of] his lie; but if he should be truthful, there will strike you some of what he promises you. Indeed, Allah does not guide one who is a transgressor and a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:28] Then said a believing man from among Pharaoh’s folk — this is said to have been his paternal cousin — who had concealed his faith, ‘Will you slay a man for saying, “My Lord is God”, even though he has [also] brought you clear signs, manifest miracles, from your Lord? If he is lying, then his mendacity will be to his own detriment, that is, the harm resulting from his mendacity [will be to his own detriment]; but if he is truthful, then there will befall you some of that with which he is threatening you, in the way of chastisement, soon. Truly God does not guide one who is a prodigal, an idolater, a liar.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالَ رَجُلٌ مُؤْمِنٌ مِنْ آَلِ فِرْعَوْنَ يَكْتُمُ إِيمَانَهُ أَتَقْتُلُونَ رَجُلًا أَنْ يَقُولَ رَبِّيَ اللَّهُ وَقَدْ جَاءَكُمْ بِالْبَيِّنَاتِ مِنْ رَبِّكُمْ وَإِنْ يَكُ كَاذِبًا فَعَلَيْهِ كَذِبُهُ وَإِنْ يَكُ صَادِقًا يُصِبْكُمْ بَعْضُ الَّذِي يَعِدُكُمْ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ مُسْرِفٌ كَذَّابٌ (28)عطف قول هذا الرجل يقتضي أنه قال قوله هذا في غير مجلس شورى فرعون ، لأنه لو كان قوله جارياً مجرى المحاورة مع فرعون في مجلس استشارته ، أو كان أجاب به عن قول فرعون : { ذَرُوني أقتُل موسى } \\[ غافر : 26 \\] لكانت حكاية قوله بدون عطف على طريقة المُحاورات . والذي يظهر أن الله ألهم هذا الرجل بأن يقول مقالته إلهاماً كان أولَ مظهر من تحقيق الله لاستعاذة موسى بالله ، فلما شاع توعد فرعون بقتل موسى عليه السلام جاء هذا الرجل إلى فرعون ناصحاً ولم يكن يتهمه فرعون لأنه من آله .وخطابه بقوله : { أتقتلون } موجَّه إلى فرعون لأن فرعون هو الذي يسند إليه القتل لأنه الآمر به ، ولحكاية كلام فرعون عقب كلام مؤمن آل فرعون بدون عطف بالواو في قوله : { قال فرعون ما أريكم إلا ما أرى } \\[ غافر : 29 \\] .ووصفُه بأنه من آل فرعون صريح في أنه من القبط ولم يكن من بني إسرائيل خلافاً لبعض المفسرين ألا ترى إلى قوله تعالى بعده : { يا قوم لكم المُلْك اليومَ ظاهرين في الأرض فمن ينصرنا من بأس الله إن جاءنا } \\[ غافر : 29 \\] فإن بني إسرائيل لم يكن لهم مُلك هنالك .والأظهر أنه كان من قرابة فرعون وخاصته لما يقتضيه لفظ آل من ذلك حقيقةً أو مجازاً . والمراد أنه مؤمن بالله ومؤمن بصدق موسى ، وما كان إيمانه هذا إلا لأنه كان رجلاً صالحاً اهتدى إلى توحيد الله إما بالنظر في الأدلة فصدَّق موسى عندما سمع دعوته كما اهتدى أبو بكر الصديق رضي الله عنه إلى تصديق النبي في حين سماع دعوته فقال له : صَدَقتَ . وكان كتمه الإِيمان متجدداً مستمراً تقيةً من فرعون وقومه إذ علم أن إظهاره الإِيمان يُضره ولا ينفع غيره كما كان ( سقراط ) يكتم إيمانه بالله في بلاد اليونان خشية أن يقتلوه انتصاراً لآلهتهم .وأراد بقوله : أتَقْتُلُونَ رَجُلاً } إلى آخره أن يسعى لحفظ موسى من القتل بفتح باب المجادلة في شأنه لتشكيك فرعون في تكذيبه بموسى ، وهذا الرجل هو غير الرجل المذكور في سورة \\[ القصص : 20 \\] في قوله تعالى : { وجاء رجل من أقصى المدينة يسعى } فإن تلك القصة كانت قُبَيْل خروج موسى من مصر ، وهذه القصة في مبدأ دخوله مصر . ولم يوصف هنالك بأنه مؤمن ولا بأنه من آل فرعون بل كان من بني إسرائيل كما هو صريح سفر الخروج . والظاهر أن الرجل المذكور هنا كان رجلاً صالحاً نظَّاراً في أدلة التوحيد ولم يستقر الإِيمان في قلبه على وجهه إلا بعد أن سمع دعوة موسى ، وإن الله يقيض لعباده الصالحين حُماة عند الشدائد .قيل اسم هذا الرجل حبيب النجّار وقيل سمعان ، وقد تقدم في سورة ( يس ) أن حبيباً النجار من رسل عيسى عليه السلام .وقصة هذا الرجل المؤمن من آل فرعون غير مذكورة في «التوراة» بالصريح ولكنها مذكورة إجمالاً في الفقرة السابعة من الإصحاح العاشر «فقال عبيد فرعون إلى متَى يكون لنا هذا ( أي موسى ) فخًّا أَطْلِق الرجال ليعبدوا الرب إلههم» .والاستفهام في { أتقتلون } استفهام إنكار ، أي يقبح بكم أن تقتلوا نفساً لأنه يقول ربي الله ، أي ولم يجبركم على أن تؤمنوا به ولكنه قال لكم قولاً فاقبلوه أو ارفضوه ، فهذا محمل قوله : { أنْ يَقُولَ رَبِّيَ الله } وهو الذي يمكن الجمع بينه وبين كون هذا الرجل يكتم إيمانه .و { أنَّ يَقُولَ } . مجرور بلام التعليل المقدرة لأنها تحذف مع ( أَن ) كثيراً . وذكر اسممِ الله لأنه الذي ذكره موسى ولم يكن من أسماء آلهة القبط .وأما قوله : { وقد جاءَكُم بالبيناتت من رَبِّكُم } فهو ارتقاء في الحِجاج بعد أن استأنس في خطاب قومه بالكلام الموجَّه فارتقى إلى التصريح بتصديق موسى بعلة أنه جاء بالبينات ، أي الحجج الواضحة بصدقه ، وإلى التصريح بأن الذي سماه الله في قوله : { أن يقول ربي الله } هو رب المخاطبين فقال : { من ربكم } . فجملة { وقد جاءكم بالبينات من ربكم } في موضع الحال من قوله : { رجلاً } والباء في { بالبينات } للمصاحبة .وقوله : { وإن يَكُ كاذبا فَعلَيهِ كَذِبُهُ } رجوع إلى ضرب من إيهام الشك في صدق موسى ليكون كلامه مشتملاً على احتمالَيْ تصديق وتكذيب يتداولهما في كلامه فلا يؤخذ عليه أنه مصدق لموسى بل يُخيل إليهم أنه في حالة نظر وتأمل ليسوق فرعون وملأَه إلى أدلة صدق موسى بوجه لا يثير نفورهم ، فالجملة عطف على جملة { وقد جاءكم بالبينات } فتكون حالاً .وقَدم احتمال كذبه على احتمال صدقه زيادةً في التباعد عن ظنهم به الانتصار لموسى فأراد أن يَظهَر في مظهر المهتَم بأمر قومه ابتداء .ومعنى : { وإن يَكُ كَاذِباً فَعلَيه كَذِبُهُ } استنزالهم للنظر ، أي فعليكم بالنظر في آياته ولا تعجلوا بقتله ولا باتباعه فإن تبين لكم كذبه فيما تحداكم به وما أنذركم به من مصائب فلم يقع شيء من ذلك لم يضركم ذلك شيئاً وعاد كذبه عليه بأن يوسم بالكاذب ، وإن تبين لكم صدقه يصبكم بعضُ ما تَوَعَّدكم به ، أي تصبكم بوارقه فتعلموا صدقه فتتبَعوه ، وهذا وجه التعبير ب { بعض } دون أن يقول : يصبكم الذي يعدكم به . والمراد بالوعْد هنا الوعد بالسوء وهو المسمى بالوعيد . أي فإن استمررتم على العناد يصبكم جميع ما توعَّدكم به بطريق الأوْلى .وقد شابَه مقامُ أبي بكر الصديققِ مقامَ مؤمن آل فرعون إذ آمن بالنبي صلى الله عليه وسلم حين سمع دعوته ولم يكن من آله ، ويومَ جاء عقبة بن أبي مُعيط إلى النبي صلى الله عليه وسلم ( والنبي صلى الله عليه وسلم بفناء الكعبة ) يخنقه بثوبه فأقبل أبو بكر فأخذ بمنكب عقبة ودفَعه وقال : { أتقتلون رجلاً أن يقول ربي الله وقد جاءكم بالبينات من ربكم } .قال علي بن أبي طالب : «والله لَيَومُ أبي بكر خيرٌ من مؤمن آل فرعون ، إنَّ مؤمن آل فرعون رجل يكتم إيمانه وإن أبا بكر كان يُظهر إيمانه وبذل ماله ودمه»وأقول : كان أبو بكر أقوى يقيناً من مؤمن آل فرعون لأن مؤمن آل فرعون كتم إيمانه وأبو بكر أظهر إيمانه .وجملة { إنَّ الله لاَ يَهْدِي مَن هُو مُسْرفٌ كَذَّابٌ } يجوز أنها من قول مؤمن آل فرعون ، فالمقصود منها تعليل قوله : { وَإن يَكُ كاذبا فعليه كَذِبُهُ وإن يَكُ صادقاً يُصِبكم بعْض الذي يَعِدُكُم } أي لأن الله لا يقره على كذبه فإن كان كاذباً على الله فلا يلبث أن يفتضح أمره أو يهلكه ، كما قال تعالى : { ولو تقوَّل علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين } \\[ الحاقة : 44 46 \\] لأن الله لا يمهل الكاذب عليه ، ولأنه إذا جاءكم بخوارق العادات فقد تبين صدقه لأن الله لا يَخرق العادة بعد تحدي المتحدّي بها إلاّ ليجعلها أمارة على أنه مرسَل منه لأن تصديق الكاذب محال على الله تعالى .ومعنى : { يصيبكم بعض الذي يعدكم } أي مما تَوعدكم بوقوعه في الدنيا ، أو في الآخرة وكيف إذا كانت البينة نفسُها مصائب تحلّ بهم مثل الطوفان والجراد وبقية التسع الآيات .والمسرف : متجاوز المعروف في شيء ، فالمراد هنا مسرف في الكذب لأن أعظم الكذب أن يكون على الله ، قال تعالى : { ومن أظلم ممن افترى على الله كذباً أو قال أوحي إلي ولم يوح إليه شيء } \\[ الأنعام : 93 \\] .وإذا كان المراد الإِسراف في الكذب تعين أن قوله : { كذاب } عطف بيان وليس خبراً ثانياً إذ ليس ثمة إسراف هنا غير إسراف الكذب ، وفي هذا اعتراف من هذا المؤمن بالله الذي أنكره فرعون ، رمَاه بين ظهرانَيْهم . ويجوز أن تكون جملة { إنَّ الله لاَ يَهْدِي } إلى آخرها جملة معترضة بين كلامي مؤمن آل فرعون ليست من حكاية كلامه وإنما هي قول من جانب الله في قُرآنه يقصد منها تزكية هذا الرجل المؤمن إذ هداه الله للحق ، وأنه تقيّ صادق ، فيكون نفي الهداية عن المسرف الكذاب كناية عن تقوى هذا الرجل وصدقه لأنه نطق عن هدىً والله لا يعطي الهدى من هو مسرف كذاب .\n\n",
      "translations": [
        {
          "translation": "(And a believing man) Ezekiel (of Pharaoh's family) who was Pharaoh's cousin, (who hid his faith) from Pharaoh and his folk; it is also said that this means: a believing man, Ezekiel, who hid his faith from Pharaoh's family (said: Would ye kill a man because he saith: My Lord is Allah) and He has sent me to you, (and hath brought you clear proofs) commands, prohibitions and signs of his prophethood (from your Lord? If he is lying) in what he says, (then his lie is upon him) the punishment of his lying is to his own hurt; (and if he is truthful) in what he says and you still disbelieve in him (then some of that wherewith he threatens you) of punishment (will strike you) in the life of this world. (Lo! Allah guideth not) Allah leads not to His religion (one who is a prodigal) an idolater, (a liar) against Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وجزم لمقته وهلاكه { قَالَ رَجُلٌ مُّؤْمِنٌ } موحد ماكان له اعتقاد بألوهية فرعون\n وإن كان { مِّنْ آلِ فِرْعَوْنَ } لكن { يَكْتُمُ إِيمَانَهُ } مهم: { أَتَقْتُلُونَ } أيها المسرفون المتكبرون { رَجُلاً } موحداً بمجرد { أَن يَقُولَ } حقاً: { رَبِّيَ ٱللَّهُ } الاحد الأحد الصمد\n المنزه عن الشريك والنظير\n\n[الشورى: 11] { وَ } الحال أنه { قَدْ جَآءَكُمْ بِٱلْبَيِّنَاتِ } الواضحة المعجزات اللائحة مِن قِبل { رَّبِّكُمْ } الذي أوجدكم من كتم العدم { وَإِن يَكُ كَاذِباً } في دعواه { فَعَلَيْهِ كَذِبُهُ } اي: وبال كذبه آيل إليه { وَإِن يَكُ صَادِقاً يُصِبْكُمْ } ألبتة { بَعْضُ ٱلَّذِي يَعِدُكُمْ } بمقتضى وحي الله وإلهامه\n وبالجملة: { إِنَّ ٱللَّهَ } الهادي إلى سبيل الرشاد { لاَ يَهْدِي } ويوفق على الهداية كل { مَنْ هُوَ مُسْرِفٌ } في فعله { كَذَّابٌ } [غافر: 28] في قوله\n فلا حاجة إلى قتله ودفعه\n إذ قد يرهق عن قريب إن كانا كاذباً\n\n\nثم ناداهم وخاطبهم مضيفاً لهم إلى نفسه إمحاضاً للنصح\n واشتراكاً معهم في الوبال النازل عليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقال رجلٌ مؤمن } \n قيل: كان قبطياً\n ابن عَم لفرعون\n آمن بموسى سرّاً\n وقيل: كان إسرائيليّاً موحّداً\n وهو المراد بقوله:\n[يس: 20]\n قال ابن عباس: اسمه حزقيل\n وقال ابن إسحاق: جَبرل\n وقيل: سمعان\n وقيل: حبيب\n و { مِن آلِ فرعونَ }: صفة ثانية لرجل\n أو: صلة ليكتم\n أي: { يكتم إيمانه } من فرعون وملائه: { أتقتلون رجلاً } أي: أتقصدون قلته كراهةَ { أن يقولَ ربي الله } وحده\n من غير روية ولا تأمُّل في أمره؟ وهذا إنكار منه عليهم\n كأنه قال: أترتكبون هذه الفعلة الشنعاء ـ وهي قتل نفس محرمة ـ من غير حجة\n غير قوله الحق\n وإقراره بالتوحيد؟ { وقد جاءكم بالبيناتِ } أي: والحال أنه جاءكم بالمعجزات الظاهرة\n التي شاهدتموها وعاهدتموها من ربكم\n يعني أنه لم يكتفِ ببينة واحدة\n بل جاء ببينات كثيرة { من } عند { ربكم } \n أضافه إليهم\n استنزالاً لهم عن رتبة المكابرة\n واستدراجاً للاعتراف\n ثم أخذهم بالاحتجاج فقال: { وإِن يَكُ كاذباً فعليه كذبهُ } \n لا يتخطى وبال كذبه إلى غيره\n فيحتاج في دفعه إلى قتله\n { وإِن يك صادقاً يُصبكم بعضُ الذي يَعِدُكُم } من العذاب\n احتج عليهم بطريق التقسيم لأنه لا يخلو\n إما أن يكون كاذباً أو صادقاً\n فإن كان كاذباً فوبال كذبه عليه\n وإن كان صادقاً يُصبكم قطعاً بعضُ ما يعدكم من العذاب\n ولم يقل: كل الذي يعدكم\n مع أنه وعد من نبيٍّ صادق\n مداراة لهم وسلوكاً لطريق الإنصاف\n فجاء بما هو أقرب إلى تسليمهم له\n فكأنه قال: إن لم يصبكم الجميعُ يصبكم البعض\n وليس فيه نفي لإصابة الكل\n فكأنه قال: أقلّ ما فيه أن يصيبكم بعض ما يعدكم\n وهو العذاب العاجل\n وفي ذلك هلاككم\n وكان وعَدَهم عذاب الدنيا والآخرة\n وتفسير البضع بالكلّ مزيّف\n { إِن الله لا يهدي مَن هو مُسْرِفٌ كذّاب } \n هذا احتجاج آخر ذو وجهين: أحدهما: أنه لو كان مُسرفاً كذاباً لَمَا هداه الله إلى النبوة\n ولما عضده بتلك البينات\n وثانيهما: إن كان كذلك خذله الله وأهلكه\n فلا حاجة إلى قتله\n وقيل: أوهم أنه يريد بالمُسرف موسى\n وهو يعني به فرعون\n ويحتمل أن يكون من كلام الله ـ تعالى ـ اعتراضاً بين أجزاء وعظه\n إخباراً بما سبق لهم من الشقاء\n فلا ينفع فيهم الوعظ\n ثم قال: { يا قوم لكم الملكُ اليومَ } حال كونكم { ظاهرين } غالبين عالين على بني إسرائيل { في الأرض } أرض مصر\n لا يقاومكم أحد في هذا الوقت",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:31",
      "similarity": 0.43538938385218057
    },
    {
      "verse": "5:61",
      "similarity": 0.40584496074266185
    },
    {
      "verse": "21:9",
      "similarity": 0.40293246762109525
    },
    {
      "verse": "2:159",
      "similarity": 0.3648602480938134
    },
    {
      "verse": "17:33",
      "similarity": 0.36425421665679647
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}