{
  "chapter": "غافر",
  "text": "وقال فرعون ذرونى اقتل موسى وليدع ربه انى اخاف ان يبدل دينكم او ان يظهر فى الارض الفساد",
  "translations": [
    {
      "translation": "Pharaoh said, 'Let me kill Musa and let him call upon his Lord! I am afraid that he may change your deen and bring about corruption in the land.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let me kill Moses,\" the Pharaoh said, \"and let him call to his Lord. I fear that he will change your faith and spread corruption in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day Pharaoh said: “Let me go and kill Moses; then let him invoke his Lord. I fear that he will change your religion or cause disruption in the land.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh said, \"Let me kill Moses and let him call for help from his Lord. I am afraid that he will change your religion or spread evil through the land.\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said Firaun, “Allow me to kill Moosa and let him pray to his Lord; I fear that he will change your religion or cause chaos in the land!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fir`awn said: \"Leave me to kill Musa, and let him call his Lord! I fear that he may change your religion, or that he may cause mischief to appear in the land!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Firon said: Let me alone that I may slay Musa and let him call upon his Lord; surely I fear that he will change your religion or that he will make mischief to appear in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said, 'Let me slay Moses, and let him call to his Lord. I fear that he may change, your religion, or that he may cause corruption to appear in the land.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said: Suffer me to kill Moses, and let him cry unto his Lord. Lo! I fear that he will alter your religion or that he will cause confusion in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, \"Let me kill Moses, let him call upon his Lord, I fear that he may cause you to change your religion, or that he may cause disorder in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Fir'awn said: let me alone, that may slay Musa, and let him call upon his Lord. Verily fear that he may change your religion or that he may cause to appear in the land corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said, ‘Let me slay Moses, and let him invoke his Lord. Indeed I fear that he will change your religion, or bring forth corruption in our land.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Pharaoh: \"Leave me to slay Moses; and let him call on his Lord! What I fear is lest he should change your religion, or lest he should cause mischief to appear in the land!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fir'aun (Pharaoh) said: \"Leave me to kill Musa (Moses), and let him call his Lord (to stop me from killing him)! I fear that he may change your religion, or that he may cause mischief to appear in the land!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said: 'Let me kill Moses, then let him call to his Lord! I am fearful that he will change your religion or cause mischief in the land'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, “Leave me to kill Moses, and let him appeal to his Lord. I fear he may change your religion, or spread disorder in the land.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said, \"Let me kill Moses and let him call upon his Lord. Indeed, I fear that he will change your religion or that he will cause corruption in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:26] And Pharaoh said, ‘Let me slay Moses — for they used to restrain him from slaying him — and let him call to his Lord, to defend him against me. Indeed I fear that he may change your religion, [involving] your worship of me, so that you will then follow him [in his religion], or that he may cause corruption to appear in the land’, by [initiating] killing and otherwise (a variant reading [for wa-an, ‘and that’] is aw-an, ‘or that’; a variant reading [for an yuzhira fī’l-ardi’l-fasāda] is [the impersonal construction] an yazhara fī’l-ardi’l-fasādu, ‘that corruption may appear in the land’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالَ فِرْعَوْنُ ذَرُونِي أَقْتُلْ مُوسَى وَلْيَدْعُ رَبَّهُ إِنِّي أَخَافُ أَنْ يُبَدِّلَ دِينَكُمْ أَوْ أَنْ يُظْهِرَ فِي الْأَرْضِ الْفَسَادَ (26)عطفُ { وقال } بالواو يدل على أنه قال هذا القول في موطن آخر ولم يكن جواباً لقولهم : { اقْتُلوا أبْنَاءَ الَّذِينَ ءامَنُوا مَعَهُ } \\[ غافر : 25 \\] ، وفي هذا الأسلوب إيماء إلى أن فرعون لم يعمل بإشارة الذين قالوا : { اقتلوا أبناء الذين ءامنوا معه } وأنه سكت ولم يراجعهم بتأييد ولا إعراض ، ثم رأى أن الأجدر قتل موسى دون أن يقتل الذين آمنوا معه لأن قتله أقطع لفتنتهم .ومعنى : { ذروني } إعلامهم بعزمه بضرب من إظهار ميله لذلك وانتظاره الموافقة عليه بحيث يمثل حاله وحال المخاطبين بحال من يريد فعل شيء فيصدّ عنه ، فلرغبته فيه يقول لمن يصده : دَعْنِي أفعل كذا ، لأن ذلك التركيب مما يخاطب به الممانع والملائم ونحوهما ، قال طرفة: ... فان كنتَ لا تستطيع دفع منيتيفدَعْنِي أبادرها بما ملكتْ يدي ... ثم استعمل هذا في التعبير عن الرغبة ولم يكن ثمة معارض أو ممانع ، وهو استعمال شائع في هذا وما يرادفه مثل : دَعْني وخَلِّني ، كما في قوله تعالى : { ذرني ومن خلقت وحيداً } \\[ المدثر : 11 \\] وقوله : { وذرني والمكذبين } \\[ المزمل : 11 \\] ، وقول أبي القاسم السهيلي: ... دَعْنِي على حكم الهوى أتضرعفَعَسَى يلين ليَ الحبيب ويخشع ... وذلك يستتبع كناية عن خطر ذلك العمل وصعوبة تحصيله لأن مثله مما يَمنع المستشارُ مستشيره من الإِقدام عليه ، ولذلك عطف عليه : { وَلْيَدْعُ رَبَّهُ } لأن موسى خوّفهم عذاب الله وتحدَّاهم بالآيات التسع . ولام الأمر في { وَلْيَدعُ رَبَّهُ } مستعملة في التسوية وعدم الاكتراث . وجملة { إنِّي أَخَافُ أَن يُبَدّلَ دِينَكُمْ } تعليل للعزم على قتل موسى . والخوف مستعمل في الإِشفاق ، أي أظن ظناً قوياً أن يبدل دينكم . وحذفت ( مِن ) التي يتعدى بها فعل { أخاف } لأنها وقعت بينه وبين ( أنْ ) .والتبديل : تعويض الشيء بغيره . وتوسم فرعون ذلك من إنكار موسى على فرعون زعمه أنه إله لقومه فإن تبديل الأصول يقتضي تبديل فروع الشريعة كلها .والإِضافة في قوله : { دينكم } تعريض بأنهم أولى بالذبّ عن الدين وإن كان هو دينَه أيضاً لكنه تجرد في مشاورتهم عن أن يكون فيه مراعاة لحظ نفسه كما قالوا هم { أتذر موسى وقومَه ليفسدوا في الأرض ويذَرَك وآلهتك } \\[ الأعراف : 127 \\] وذلك كله إلهاب وتحضيض .والأرض : هي المعهودة عندهم وهي مملكة فرعون .ومعنى إظهار موسى الفساد عندهم أنه يتسبب في ظهوره بدعوته إلى تغيير ما هم عليه من الديانة والعوائد . وأطلق الإِظهار على الفشوّ والانتشار على سبيل الاستعارة . وقد حمله غروره وقلة تدبره في الأمور على ظن أن ما خالف دينهم يعدّ فساداً إذ ليست لهم حجة لدينهم غير الإِلف والانتفاع العاجل .وقرأ نافع وابن كثير وابن عامر وأبو عمرو وأبو جعفر { وأَنْ بواو العطف . وقرأ غيرهم أوْ أَنْ } ب ( أو ) التي للترديد ، أي لا يخلو سعي موسى عن حصول أحد هاذين . وقرأ نافع وأبو عَمرو وأبو بكر عن عاصم وأبو جعفر بضم ياء { يُظهر } ونصب { الفَسَاد } أي يبدل دينكم ويكون سبباً في ظهور الفساد . وقرأه ابن كثير وابن عامر وحمزة والكسائي وحفص عن عاصم ويعقوب وخلف بفتح الياء وبرفع { الفسادُ } على معنى أن الفساد يظهر بسبب ظهور أَتْباع موسى ، أو بأن يجترىء غيره على مثل دعواه بأن تزول حُرمة الدولة ، لأن شأن أهل الخوف عن عمل أن ينقلب جبنهم شجاعة إذا رأوا نجاح من اجترأ على العمل الذي يريدون مثله .\n\n",
      "translations": [
        {
          "translation": "And Pharaoh said: Suffer me to kill Moses, and let him cry unto his Lord) Whom he claims sent him to me. 542 (Lo! I fear that he will alter your religion) you presently practise (or that he will cause confusion in the land) or that he will kill your sons and use your daughters as servants, as you did yourself with his people; it is also said that this means: or they will cause confusion in the land by leaving your religion and the religion of your forefathers and accepting his religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وانتشر بين الناس حجته وبرهانه { قَالَ فِرْعَوْنُ } لملئه الذين قالوا له حين غلب موسى على السحرة\n وقصد فرعون قتله فمنعه الملأ عن قتله\n حتى لا يظهر بين الناس مغلوبيته من مسى\n مع أنه ادعى الألوهية لنفسه: { ذَرُونِيۤ } أي: ارتكوني على حالي\n أنا { أَقْتُلْ مُوسَىٰ وَلْيَدْعُ رَبَّهُ } أي: يمنعني عن قتله\n أو يهلكني لأجله\n يعني: لا أبالي به وبربه\n بل { إِنِّيۤ أَخَافُ } عليكم لو لم أقتله { أَن يُبَدِّلَ دِينَكُـمْ } وانقيادكم على سحره { أَوْ أَن يُظْهِرَ فِي ٱلأَرْضِ ٱلْفَسَادَ } [غافر: 26] أي: النهب والغارة في أطراف المملكة وأكناف البلاد\n وإن لم يقدر على تغيير دينكم وعقائدكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { وليَدْعُ رَبَّه } تجلُّد منه وإظهار لعدم المبالاة بدعائه\n ولكنه أخوف ما يخافه\n ثم قال: { إِني أخافُ } إن لم أقتله { أن يُبدِّلَ دينَكُم } أي: بغير ما أنتم عليه من الدين\n وهو عبادتهم له وللأصنام لتقربهم إليه\n { أو أن يُظْهِر في الأرض الفسادَ } أي: ما يفسد دنياكم من التحارب والتهارج إن لم يقدر على تبديل دينكم بالكلية\n والحاصل: أنه قال: أخاف أن يُفسد عليكم دينكم\n بدعوته إلى دينه\n أو: يفسد عليكم دنياكم بما يظهر من التقاتل والتهارج\n الذي يذهب معه الأمن\n وتتعطل المزارع والمكاسب والمعايش\n\n{ وقال موسى } لَمَّا سَمِعَ ما أجراه من الحديث في قتله لقومه: { إِني عُذْتُ بربي وربِّكُم من كل متكبرٍ لا يؤمن بيوم الحساب } \n صدّر عليه السلام كلامَه بإنَّ تأكيداً له\n وإظهاراً لمزية الاعتناء بمضمونه\n وفرط الرغبة\n وخصّ اسم الرب المنبىء عن الحفظ والتربية إذ بهما يقع الحفظ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:127",
      "similarity": 0.37331435984661715
    },
    {
      "verse": "60:9",
      "similarity": 0.31482535603540807
    },
    {
      "verse": "7:103",
      "similarity": 0.3035922973064932
    },
    {
      "verse": "2:11",
      "similarity": 0.27462011086051946
    },
    {
      "verse": "7:104",
      "similarity": 0.270083492455127
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}