{
  "chapter": "غافر",
  "text": "والله يقضى بالحق والذين يدعون من دونه لا يقضون بشىء ان الله هو السميع البصير",
  "translations": [
    {
      "translation": "Allah will judge with truth; and those you call upon apart from Him will not judge with anything at all. It is Allah who is the All-Hearing, the All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God decides with justice. But those they call apart from Him can not adjudge in the least. Verily God is all-hearing, all-perceiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge with justice, whereas those whom they call upon beside Him cannot judge at all. Surely Allah -- and He alone -- is All- Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God judges with Truth but those whom they worship besides God can have no Judgment. God is certainly All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah renders the true judgement; and those whom they worship instead of Him do not judge at all; indeed Allah only, is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with truth, while those to whom they invoke besides Him, cannot judge anything. Certainly, Allah! He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with the truth; and those whom they call upon besides Him cannot judge aught; surely Allah is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall decide justly, and those they call on, apart from Him, shall not decide by any means. surely God is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah judgeth with truth, while those to whom they cry instead of Him judge not at all. Lo! Allah, He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will judge with [justice and] truth: but those whom they invoke besides Him, have no power to judge at all. Surely, God is all hearing, all seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah decreeth with truth, while those whom they call upon beside Him cannot decree aught; verily Allah! He is the Hearer, the Beholder!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah judges with justice, while those whom they invoke besides Him do not judge by anything. Indeed it is Allah who is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will judge with (justice and) Truth: but those whom (men) invoke besides Him, will not (be in a position) to judge at all. Verily it is Allah (alone) Who hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with truth, while those to whom they invoke besides Him, cannot judge anything. Certainly, Allah! He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With justice Allah will judge, but those upon whom they call, other than Him, can not judge anything at all! Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God judges with justice, while those whom they invoke besides Him cannot judge with anything. It is God who is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah judges with truth, while those they invoke besides Him judge not with anything. Indeed, Allah - He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:20]   And God decrees with truth, while those on whom they call, whom they worship, that is, the disbelievers of Mecca (read yad‘ūna, ‘they call’, or tad‘ūna, ‘you call’) besides Him — and these are the idols — do not decree by any means [at all]: so how can they be God’s associates? Truly God is the Hearer, of their sayings, the Seer, of their actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاللَّهُ يَقْضِي بِالْحَقِّ وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ لَا يَقْضُونَ بِشَيْءٍ إِنَّ اللَّهَ هُوَ السَّمِيعُ الْبَصِيرُ (20)كان مقتضى الظاهر أن يؤتَى بجملة { يقضي بالحق } معطوفة بالواو على جملة { يعلم خائنة الأعين } \\[ غافر : 19 \\] فيقال : ويقضى بالحق ولكن عدل عن ذلك لما في الاسم العلم لله تعالى من الإِشعار بما يقتضيه المسمى به من صفات الكمال التي منها العدل في القضاء ، ونظيره في الإِظهار في مقام الإِضمار قوله تعالى : { أولم يروا أنا نأتي الأرض ننقصها من أطرافها والله يحكم لا معقب لحكمه } \\[ الرعد : 41 \\] . وليحصل من تقديم المسند إليه على المسند الفعلي تقوِّي المعنى ، ومنه قوله تعالى : { إن الذين كفروا ينفقون أموالهم ليصدوا عن سبيل الله فسينفقونها ثم تكون عليهم حسرة ثم يغلبون والذين كفروا إلى جهنم يحشرون } \\[ الأنفال : 36 \\] أعيد الموصول ولم يؤت بضمير { الذين كفروا } ليُفيد تقديمُ الاسم على الفعل تقوّي الحكم .والجملة من تمام الغرض الذي سيقت إليه جملة { يعلم خائنة الأعين } \\[ غافر : 19 \\] كما تقدم ، وكلتاهما ناظرة إلى قوله : { ما للظالمين من حميم ولا شفيع } \\[ غافر : 18 \\] أي أن ذلك من القضاء بالحق .وأما جملة { والذين تدعون من دونه لا يقضون بشيء } فناظرة إلى جملة { ما للظالمين من حميم ولا شفيع } \\[ غافر : 18 \\] فبعد أن نُفي عن أصنامهم الشفاعة ، نُفيَ عنها القضاءُ بشيء مَّا بالحق أو بالباطل وذلك إظهار لعجزِها . ولا تحْسِبنَّ جملةَ { والذين تدعون من دونه لا يقضون بشيء } مسوقةً ضميمة إلى جملة : { والله يقضي بالحق } ليفيد مجموع الجملتين قصر القضاء بالحق على الله تعالى قَصْرَ قلب ، أي دون الأصنام ، كما أفيد القصر من ضم الجملتين في قول السمَوْأل أو عبد الملك الحارثي: ... تَسيل على حد الظُّبات نفوسناوليست على غير الظُّبات تسيل ... لأن المنفي عن آلهتهم أعمّ من المثبت لله تعالى ، وليس مثل ذلك مما يضاد صيغة القصر لكفى في إفادته تقديم المسند إليه على الخبر الفعلي بحَمْله على إرادة الاختصاص في قوله : { والله يقضي بالحق } . فالمراد من قوله : { والذين تدعون من دونه لا يقضون بشيء } التذكير بعجز الذين يدعونهم وأنهم غير أهل للإِلهية ، وهذه طريقة في إثبات صفة لموصوف ثم تعقيب ذلك بإظهار نقيضه فيما يُعدّ مساوياً له كما في قول أمية بن أبي الصلت: ... تلك المكارمُ لا قَعْبَاننِ من لَبَنشيباً بماءٍ فصار فيما بعدُ أبوالا ... وإلاَّ لما كان لعطف قوله : لا قَعْباننِ من لبن ، مناسبة .والدعاء يجوز أن يكون بمعنى النداء وأن يكون بمعنى العبادة كما تقدم آنفاً .وجملة { إن الله هو السميع البصير } مقررة لجمل { يعلم خائنة الأعين وما تُخفي الصدور } إلى قوله : { لا يَقْضُون بشيء } \\[ غافر : 19 ، 20 \\] . فتوسيط ضمير الفصل مفيد للقصر وهو تعريض بأن آلهتهم لا تسمع ولا تبصر فكيف ينسبون إليها الإِلهية ، وإثبات المبالغة في السمع والبصر لله تعالى يُقرر معنى { يَقْضِي بالحق } لأن العالم بكل شيء تتعلق حكمته بإرادة الباطل ولا تخطىء أحكامه بالعثار في الباطل . وتأكيد الجملة بحرف التأكيد تحقيق للقصر . وقد ذكر التفتزاني في «شرح المفتاح» في مبحث ضمير الفصل أن القصر يُؤكَّد .وقرأ نافع وهشام عن ابن عامر { تدعُون بتاء الخطاب على الالتفات من الغيبة إلى الخطاب لقرع أسماع المشركين بذلك . وقرأ الجمهور بياء الغيبة على الظاهر .\n\n",
      "translations": [
        {
          "translation": "(Allah judgeth with truth) Allah allows intercession for whomever He wishes on the Day of Judgement; it is also said that this means: He commands with justice, (while those to whom they cry) worship (instead of Him) of idols (judge not at all) they will not judge anything in terms of intercession on the Day of Judgement, because they have no power to do so; it is also said that this means: they do not command any good in the life of the world because they are deaf and dumb. (Lo! Allah, He is the Hearer) of what they say (the Seer) He sees them and sees their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويجازي عليهم بمقتضى علمه وخبرته منهم { بِٱلْحَقِّ } بلا حيف وميل إظهاراً لكمال عدالته { وَٱلَّذِينَ يَدْعُونَ مِن دُونِهِ } سبحانه من الأوثان والأصنام { لاَ يَقْضُونَ } ولا يحكمون لا لهم ولا عليهم { بِشَيْءٍ } من نفع وضر\n إذ هم جمادات لا شعور لها { إِنَّ ٱللَّهَ } القادر المقتدر على أنواع الإنعام والانتقام { هُوَ ٱلسَّمِيعُ } لجميع ما صدر من ألسنة استعداداته { ٱلْبَصِيرُ } [غافر: 20] بما ظهر على هياكل هوياتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:20",
      "similarity": 0.4667950654892472
    },
    {
      "verse": "7:198",
      "similarity": 0.45354882579969547
    },
    {
      "verse": "27:78",
      "similarity": 0.4107385188483608
    },
    {
      "verse": "40:68",
      "similarity": 0.39276656954957573
    },
    {
      "verse": "29:42",
      "similarity": 0.39092234691819094
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}