{
  "chapter": "غافر",
  "text": "يقوم انما هذه الحيوة الدنيا متع وان الءاخرة هى دار القرار",
  "translations": [
    {
      "translation": "O people, the life of this world is ephemeral; but enduring is the abode of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, the life of this world is ephemeral, whereas the Hereafter, that is the permanent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, this worldly life is only the means (to an end), but the life hereafter will be the everlasting abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people! The life of this world is just a brief usage, and indeed the next abode is one of everlasting stay.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Truly, this life of the world is nothing but an enjoyment, and verily, the Hereafter that is the home that will remain forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! this life of the world is only a (passing) enjoyment, and surely the hereafter is the abode to settle;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, surely this present life is but a passing enjoyment; surely the world to come is the abode of stability.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Lo! this life of the world is but a passing comfort, and lo! the Hereafter, that is the enduring home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, the life of this world is only a temporary provision; and the Hereafter is the permanent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My people! this life of the world Is but a possi enjoyment, and verily the Hereafter! that is the Abode of rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! This life of the world is only a [passing] enjoyment, and indeed the Hereafter is the abiding home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! This life of the present is nothing but (temporary) convenience: It is the Hereafter that is the Home that will last.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Truly, this life of the world is nothing but a (quick passing) enjoyment, and verily, the Hereafter that is the home that will remain forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my nation, the life of this world is nothing but an enjoyment, but surely, the life of the Everlasting Life is the stable abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people, the life of this world is nothing but fleeting enjoyment, but the Hereafter is the Home of Permanence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, this worldly life is only [temporary] enjoyment, and indeed, the Hereafter - that is the home of [permanent] settlement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:39] O my people! Truly this life of the world is only an [ephemeral] enjoyment, [containing] comforts which will [eventually] disappear, whereas the Hereafter truly is the enduring abode.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O my people! Lo! this life of the world is but a passing comfort) like the comfort of your homes; it does not last, (and lo! the Hereafter) i.e. the Garden, (that is the enduring home) that is the everlasting abode which will never perish.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰقَوْمِ } ما شأنكم وأمركم في دار القتنة والغرور ومنزل الغفلة والثبور { إِنَّمَا هَـٰذِهِ ٱلْحَيَاةُ ٱلدُّنْيَا مَتَاعٌ } مستار بلا مدار واعتبار { وَإِنَّ ٱلآخِرَةَ } المعدة لذوي البصائر وأولي الألباب { هِيَ دَارُ ٱلْقَـرَارِ } [غافر: 39]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}