{
  "chapter": "غافر",
  "text": "غافر الذنۢب وقابل التوب شديد العقاب ذى الطول لا اله الا هو اليه المصير",
  "translations": [
    {
      "translation": "Forgiver of trespasses, acceptor of repentance, severe of retribution, lord of power. There is no god but He. Towards Him is your destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Forgiver of sins, the Accepter of repentance, the Stern in retribution, the Bountiful. There is no god but He. To Him are all destined to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who forgives sins, who accepts repentance, whose punishment is severe, and whose bounty is universal. He is the only Lord and to Him all things proceed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of sin, and the Most Acceptor of Repentance, the Severe in Punishing, the Greatly Rewarding; there is no God except Him; towards Him only is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of sin, the Acceptor of repentance, the Severe in punishment, the Bestower. La ilaha illa Huwa, to Him is the final return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of the faults and the Acceptor of repentance, Severe to punish, Lord of bounty; there is no god but He; to Him is the eventual coming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forgiver of sins, Accepter of penitence, Terrible in retribution, the Bountiful; there is no god but He, and unto Him is the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of sin, the Accepter of repentance, the Stern in punishment, the Bountiful. There is no Allah save Him. Unto Him is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of sin and the Accepter of repentance, who is severe in punishment and Infinite in His Bounty. There is no God but Him. All shall return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forgiver of sin, and Acceptor of repentance severe in chastisement, Lord of Power. There is no god but He; unto Him is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "forgiver of sins and acceptor of repentance, severe in retribution, [yet] all-bountiful; there is no god except Him, [and] toward Him is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who forgiveth sin, accepteth repentance, is strict in punishment, and hath a long reach (in all things). there is no god but He: to Him is the final goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of sin, the Acceptor of repentance, the Severe in punishment, the Bestower (of favours), La ilaha illa Huwa (none has the right to be worshipped but He), to Him is the final return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Forgiver of sins and the Acceptor of repentance. Stern in retribution, the Bountiful, there is no god except He and to Him is the arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forgiver of sins, Accepter of repentance, Severe in punishment, Bountiful in bounty. There is no god but He. To Him is the ultimate return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The forgiver of sin, acceptor of repentance, severe in punishment, owner of abundance. There is no deity except Him; to Him is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:3] Forgiver of sins, for believers, and Accepter of repentance, from them (al-tawb is the verbal noun), Severe in punishment, of disbelievers — in other words, One Who makes it severe for them — One of [abundant] bounty, bestower of abundant grace — God is eternally possessed of all of these attributes, and so the annexation construction using the derivatives [of these attributes] is for the purposes of characterisation, as in the case of the last. There is no god except Him; to Him is the journeying, the [ultimate] return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Forgiver of sin) He forgives the sins of those who say: \"there is no deity except Allah\", (the Acceptor of repentance) He accepts those who repent of idolatry, (the Stern in punishment) regarding those who die as idolaters, (the Bountiful) the Possessor of favour and grace and independence from need; that is to say he 539 has favours and graces for those who believe in him and is independent from need of those who disbelieve in Him. (There is no God) who does this (save Him. Unto Him is the journeying) to Him is the journeying of those who believe in Him as well as of those who do not believe in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدّثنا علي بن أحمد، قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السَّلامُ في قولهِ تعالى: { ذِي ٱلطَّوْلِ } معناه ذو الغِنى والتَفضلِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { غافر الذنب } بظهور نوره وستره لظلمات النفوس والطبائع { وقَابِلِ التوب } برجوع الحقيقة المجرّدة من غواشي النشأة إليه { شديد العقاب } للمحجوب الواقف مع الغير بالشرك غير الراجع إليه بالتوحيد { ذي الطول } أي: الفضل بإفاضة الكمال الزائد على نور الاستعداد الأول على حسب قبوله { لا إله إلا هو } أولاً وآخراً وظاهراً وباطناً معاقباً ومتفضلاً { إليه } مصير الكل على كل الأحوال من الراجع التائب والواقف المعاقب إما إلى ذاته أو صفاته أو أفعاله كيف كان لا يخرج عن إحاطته شيء فيكون خارجاً عن ذاته موجوداً بوجود غير وجوده،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ غَافِرِ ٱلذَّنبِ } أي: ساتر ذنوب الأنانيات، والهويات الحاصلة من انصباغ التعينات العدمية بصيغ الأسماء والصفات { وَقَابِلِ ٱلتَّوْبِ } أي: التوبة والرجوع على وجه الإخلاص والندم من إثبات الوجود لغيره سبحانه { شَدِيدِ ٱلْعِقَابِ } على من خرج عن ربقة عبوديته بإسناد الحوادث إلى نفسه، أو إلى مثله في الحدوث والمخلوقية { ذِي ٱلطَّوْلِ } والغني عن توحيد الموحد وإلحاد المشرك الملحد؛ لأنه في ذاته { لاَ إِلَـٰهَ إِلاَّ هُوَ } ولا موجود سواه يُعبد له ويُرجع إليه في الخطوب؛ إذ { إِلَيْهِ ٱلْمَصِيرُ } [غافر: 3] أي: مرجع الكل إليه سواء وحدَّه الموحدون، أو ألحد في شأ،ه الملحدون المشركون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { غافر الذنبِ } أي: ساتر ذنب المؤمنين { وقابلِ التَّوْبِ } وقابل توبةَ الراجعين { شديدِ العقاب } للمخالفين، { ذي الطَّوْلِ } على العارفين، أي: الفضل التام على العارفين، أو: ذي الغنى عن الكل\n وعن ابن عباس: غافر الذنب، وقابل التوب، لمَن قال: \" لا إله إلا الله \" شديد العقاب لمَن لم يقل لا إله إلا الله\n والتَّوب: مصدر، كالتوبة\n ويقال: تاب وثاب وآب، أي: رجع، فإن قلتَ: كيف اختلفت هذه الصفات تعريفاً وتنكيراً، والموصوف معرفة، وهو الله؟ قلتُ: أما { غافر الذنب وقابل التَّوب } فمعرفتان لأنه لم يُرِدْ بهما حدوث الفعلين حتّى يكون في تقدير الانفصال، فتكون إضافتهما غير حقيقية، وإنما أُريد ثُبوت ذلك ودوامه\n وأما { شديد العقاب } فهو في تقدير: شديد عقابُه، فيكون نكرة، فقيل: هو بدل، وقيل: كلّها أبدال غير أوصاف\n وإدخال الواو في { قابل التوب } لنكتة، وهي: إفادة الجمع للمذنب التائب بين رحمتين: بين قبول توبته، فتُكتب له طاعة، وبين جعلها ماحية للذنوب، كأن لم يُذنب، كأنه قال: جامع المغفرة والقبول\n وفي توحيد صفة العذاب مغمورة بصفات النعمة دليل سبقها ورجحانها،\n\n \" إن رحمتي سبقت غضبي \"\n \n\nقال القشيري: سُنَّةُ اللهِ تعالى: إذا خَوَّف العبادَ باسْمٍ، أو لفظٍ، تدارَكَ قلوبَهم بأن يُبشِّرهم باسْمَين أو وَصْفيْن\n هـ\n رُوي: أن عمر رضي الله عنه افتقد رجلاً ذا بأسٍ شديد، من أهل الشام، فقيل له: تابَع هذا الشراب، فقال لكاتبه: اكتب: من عمر إلى فلان، سلام الله عليك، وأنا أحمد إليك الله، الذي لا إله إلا هو، بسم الله الرحمن الرحيم { حم\n\n\n } إلى قوله: { إِليه المصير } وختم الكتاب، وقال لرسوله: لا تدفعه إليه حتى تجده صاحباً، ثم أمر مَن عنده بالدعاء له بالتوبة، فلما أتته الصحيفة، جعل يقرؤها، ويقول: قد وعدني الله أن يغفر لي، وحذّرني من عقابه، فلم يبرح يردّدها حتى بكى\n\n\nثمّ نزع، فأحسن النزوع، وحسنت توبته\n فلما بلغ عمر رضي الله عنه أمرُه، قال: \" هكذا فاصنعوا، إذا رأيتم أخاكم قد زلَّ فسدّدوه، وادعوا له الله أن يتوب عليه، ولا تكونوا أعواناً للشيطان عليه \" أي: بالدعاء عليه\n هـ\n { لا إِله إلا هو } أي: فيجب الإقبال الكلي عليه، وهو: إما استئناف، أو: صفة لذي الطَّوْل، { إِليه المصيرُ } أي: المرجع، فيُجازي كُلاًّ من العاصي والمطيع\n قال القشيري: إذا كان إلى الله المصير فقد طاب المسير",
      "translations": []
    }
  ]
}