{
  "chapter": "غافر",
  "text": "ولقد جاءكم يوسف من قبل بالبينت فما زلتم فى شك مما جاءكم به حتى اذا هلك قلتم لن يبعث الله منۢ بعده رسولا كذلك يضل الله من هو مسرف مرتاب",
  "translations": [
    {
      "translation": "Yusuf brought you the Clear Signs before, but you never stopped doubting what he brought to you to the extent that when he died, you said. \"Allah will never send another Messenger after him.\" That is how Allah",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph had indeed come to you before with clear proofs, but you did not cease to doubt what he had brought until he died, when you said: 'God will not send a prophet after him.' That is how God leads the waster, the sceptic astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Joseph came to you with Clear Signs before, yet you continued to doubt his Message. Thereafter when he died, you said: 'Allah shall send no Messenger after him.'” Thus Allah leads astray those who transgress the limits and are given to much doubting;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph came to you before with illustrious evidence but you still have doubts about what he brought. When he passed away, you said, \"God will never send any Messenger after him.\" Thus does God causes to go astray the skeptical transgressing people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And indeed Yusuf came to you with clear signs before this, thereupon you remained doubtful concerning what he had brought; to the extent that when he died, you said, ‘Allah will surely not send any Noble Messenger after him’”; this is how Allah sends astray whoever transgresses, is doubtful. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Yusuf did come to you, in times gone by, with clear signs, but you ceased not to doubt in that which he did bring to you, till when he died, you said: \"No Messenger will Allah send after him.\" Thus Allah leaves astray him who is a transgressor and a skeptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly Yusuf came to you before with clear arguments, but you ever remained in doubt as to what he brought; until when he died, you said: Allah will never raise an apostle after him. Thus does Allah cause him to err who is extravagant, a doubter\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph brought you the clear signs before, yet you continued in doubt concerning that he brought you until, when he perished, you said, \"God will never send forth a Messenger after him.\" Even, so God leads astray the prodigal and the doubter.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily Joseph brought you of old clear proofs, yet ye ceased not to be in doubt concerning what he brought you till, when he died, ye said: Allah will not send any messenger after him. Thus Allah deceiveth him who is a prodigal, a doubter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph came to you before with clear signs, but you never ceased to doubt the message he brought you. When he died, you said, 'God will not send another messenger.'\"\" In this way God leaves the transgressors and doubters to go astray --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly there came Unto you Yusuf aforetime with evidences, yet ye ceased not to be in doubt concerning that which he brought Unto you, until when he died, ye said: God shall by no means raise an apostle after him. Thus Allah keepeth astray one who is extravagant and a doubter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Joseph brought you manifest proofs earlier, but you continued to remain in doubt concerning what he had brought you. When he died, you said, ‘‘Allah will never send any apostle after him.’’ That is how Allah leads astray those who are unrestrained and skeptical.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to you there came Joseph in times gone by, with Clear Signs, but ye ceased not to doubt of the (Mission) for which he had come: At length, when he died, ye said: 'No messenger will Allah send after him.' thus doth Allah leave to stray such as transgress and live in doubt,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Yusuf (Joseph) did come to you, in times gone by, with clear signs, but you ceased not to doubt in that which he did bring to you, till when he died you said: \"No Messenger will Allah send after him.\" Thus Allah leaves astray him who is a Musrif (a polytheist, oppressor, a criminal, sinner who commit great sins) and a Murtab (one who doubts Allah's Warning and His Oneness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this, Joseph brought you clear signs, but you continued to be doubtful of that which he brought. When he passed away you said: \"Allah will never send another Messenger after him.\" As such Allah leads astray the sinner, the doubter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph had come to you with clear revelations, but you continued to doubt what he came to you with. Until, when he perished, you said, “God will never send a messenger after him.” Thus God leads astray the outrageous skeptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Joseph had already come to you before with clear proofs, but you remained in doubt of that which he brought to you, until when he died, you said, 'Never will Allah send a messenger after him.' Thus does Allah leave astray he who is a transgressor and skeptic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:34] And verily Joseph brought you, before, in other words, before Moses — according to one opinion, this Joseph is the son of Jacob, having been given life until the time of Moses; according to another opinion this is Joseph son of Abraham son of Joseph son of Jacob — clear signs, manifest miracles, but you continued to be in doubt concerning what he had brought you until, when he died, you said, without any evidence [to support such a claim]: “God will never send any messenger after him” — in other words, you will never cease to disbelieve in Joseph and others [that may come after him]. So, that is, just as you have been led astray, God leads astray one who is a prodigal, an idolater, a skeptic’, a doubter of that which the clear signs have certified.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily Joseph brought you) it is Ezekiel who said this (of old) before Moses (clear proofs) commands, prohibitions, the interpretation of dreams and the tearing off of his shirt, (yet ye ceased not to be in doubt concerning what he) Joseph (brought you till, when he died, ye said: Allah will not send any messenger after 543 him) after his death. (Thus Allah deceiveth) misguides from His religion (him who is a prodigal) an idolater, (a doubter) because of his idolatry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال القائل المذكور تسجيلاً على غيهم وضلالهم: { وَ } كيف تستبعدون نبوة هذا المدعي ورسالته من عند الله مع أنه ليس ببدع منه، بل { لَقَدْ جَآءَكُـمْ } أي: على آبائكم وأسلافكم { يُوسُفُ } ابن يعقوب رسولاً { مِن قَبْلُ } أي: من قبل هذا المدعي مؤيداً من عنده سبحانه { بِٱلْبَيِّنَاتِ } المبينة الموضحة لدعواه ورسالته { فَمَا زِلْتُمْ } أي: كنتم دائماً مستمراً سلفاً وخلفاً { فِي شَكٍّ } وتردد { مِّمَّا جَآءَكُـمْ بِهِ } في أمر الدين وشأن التوحيد واليقين { حَتَّىٰ إِذَا هَلَكَ } أي: مات يوسف عليه السلام وانقرض زمانه { قُلْتُمْ } من كمال تعنتكم وعنادكم على سبيل الجزم، بلا دليل وبرهان نزل عليكم عقلاً ونقلاً: { لَن يَبْعَثَ ٱللَّهُ مِن بَعْدِهِ رَسُولاً } مع أنكم شاكون في رسالته أيضاً، بل في مطلق الرسالة والإنزال من الله الواحد القهار\n\n\n\n\n{ كَذَلِكَ } أي: مثل ضلالكم هذا { يُضِلُّ ٱللَّهُ } المضل المغوي بمقتضى قهره وجلاله جميع { مَنْ هُوَ مُسْرِفٌ } في الخروج عن مقتضى الحدود املوضوعة لحفظ القسط الإلهي والاعتدال الحقيقي { مُّرْتَابٌ } [غافر: 34] شاك فيما يثبته البينات الواضحة والمعجزات اللائحة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الذين يُجادلون }: بدل مِن { مَن هو } وإنما جمع لأنه لم يرد مسرفاً واحداً، بل كل مسرف\n  يقول الحق جلّ جلاله: حاكياً لقول المؤمن: { ولقد جاءكم يوسُف } ، هو ابن يعقوب، وقيل: يوسف بن إفراثيم بن يوسف بن يعقوب، أقام فيهم نبيّاً عشرين سنة، وقال وهب: فرعون موسى هو فرعون يوسف، عمَّر إلى زمنه، وقيل: هو فرعون آخر لأن كل مَن ملك مصر يُقال له فرعون، وهذا أظهر\n وقول الجلال المحلي: هو يوسف بن يعقوب في قولٍ، عمّر إلى زمنه، سهو\n وإنما قيل ذلك في فرعون لا في يوسف\n قلت: والتحقيق: أنه وبّخهم بما فعل أسلافهم لأنهم على مِنوالهم، راضون بما فعلوا، فالمراد بيوسف، هو الصِّدِّيق، فما زالوا مترددين في رسالته حتى مات، واستمر خلفهم على ذلك إلى زمن موسى، وقوله تعالى: { من قبلُ } أي: من قبل موسى، أي: جاءكم يوسف { بالبينات } بالمعجزات الواضحة، كتعبير الرؤيا، ودلائل التوحيد، كقوله:\n\n[يوسف: 39] الآية، وملكه أموالهم ورقابهم في زمن المسبغة، وغير ذلك مما دلّ على رسالته\n { فما زلتم في شكٍّ مما جاءكم به } من الدين { حتى إِذا هَلَكَ } بالموت { قُلْتم لن يبعثَ الله من بعده رسولاً } ، حكماً من عند أنفسكم، من غير برهان، أي: أقمتم على كفركم، وظننتم أن لا يجدّد عليكم إيجاب الحجة\n قال القشيري: يقال: إن تكذيبهم وتكذيب سلفهم للأنبياء ـ عليهم السلام ـ كان قديماً حتى أهلكهم، كذلك يفعل بهؤلاء\n هـ\n { كذلك يُضِلُّ الله مَن هو مُسْرِفٌ مرتابٌ } أي: مثل ذلك الإضلل الفظيع يُضل الله مَن هو مسرف في عصيانه، شاكّ في دينه، لم يتفكّر فيما شهدت البينات بصحته لِغلبة الوهم، والانهماك في التقليد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:110",
      "similarity": 0.47392894401231295
    },
    {
      "verse": "11:118",
      "similarity": 0.3906671379374458
    },
    {
      "verse": "11:62",
      "similarity": 0.3737344026090858
    },
    {
      "verse": "10:28",
      "similarity": 0.3703579012387274
    },
    {
      "verse": "11:110",
      "similarity": 0.36201559703692826
    }
  ]
}