{
  "chapter": "غافر",
  "text": "وقال فرعون يهمن ابن لى صرحا لعلى ابلغ الاسبب",
  "translations": [
    {
      "translation": "Pharaoh said, 'Haman, build me a tower so that perhaps I may gain means of access,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh said: \"O Haman, build me a lofty tower that I may perhaps find the means\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said: “Haman, build for me a lofty tower that I may scale the highways --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, \"Haman, build a tower of baked bricks for me so that I shall have access.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said Firaun, “O Haman! Build a high palace for me, in order that I may reach the routes.” –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Fir`awn said: \"O Haman! Build me a lofty tower that I may arrive at the ways --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Firon said: O Haman! build for me a tower that I may attain the means of access,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, 'Haman, build for me a tower, that haply so I may reach the cords,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said: O Haman! Build for me a tower that haply I may reach the roads,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, \"O Haman, build for me a lofty building so that I may gain access\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Fir'awn said: O Haman! build for me a tower that haply I may reach the ways of access\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, ‘O Haman! Build me a tower so that I may reach the routes\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said: \"O Haman! Build me a lofty palace, that I may attain the ways and means-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Fir'aun (Pharaoh) said: \"O Haman! Build me a tower that I may arrive at the ways,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said: 'Haman, build me a tower that I can reach the ways,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said, “O Hamaan, build me a tower, that I may reach the pathways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Pharaoh said, \"O Haman, construct for me a tower that I might reach the ways -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:36]   And Pharaoh said, ‘O Hāmān! Build for me a tower, a lofty edifice, that perhaps I may reach the routes —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالَ فِرْعَوْنُ يَا هَامَانُ ابْنِ لِي صَرْحًا لَعَلِّي أَبْلُغُ الْأَسْبَابَ (36) هذه مقالة أخرى لفرعون في مجلس آخر غير المجلس الذي حاجّه فيه موسى ولذلك عطف قوله بالواو كما أشرنا إليه فيما عطف من الأقوال السابقة آنفاً ، وكما أشرنا إليه في سورة القصص ، وتقدم الكلام هنالك مستوفى على نظير معنى هذه الآية على حسب ظاهرها ، وتقدم ذكر ( هامان ) والصرح هنالك .وقد لاح لي هنا محمل آخر أقرب أن يكون المقصودَ من الآية ينتظم مع ما ذكرناه هنالك في الغاية ويخالفه في الدلالة ، وذلك أن يكون فرعون أمَر ببناء صرح لا لِقصد الارتقاء إلى السماوات بل ليخلُوَ بنفسه رياضة ليستمد الوحي من الربّ الذي ادعى موسى أنه أَوحَى إليه إذ قال : { إنا قد أوحي إلينا أن العذاب على من كذب وتولى } \\[ طه : 48 \\] فإن الارتياض في مكان منعزل عن الناس كان من شعار الاستيحاء الكهنوتي عندهم ، وكان فرعون يحسب نفسه أهلاً لذلك لزعمه أنه ابن الآلهة وحامي الكهنة والهياكل . وإنما كان يشغله تدبير أمر المملكة فكان يكِل شؤون الديانة إلى الكهنة في معابدهم ، فأراد في هذه الأزمة الجدلية أن يتصدى لذلك بنفسه ليكون قوله الفصل في نفي وجود إله آخر تضليلاً لدهماء أمته ، لأنه أراد التوطئة للإِخبار بنفي إله أخر غير آلهتهم فأراد أن يتولى وسائل النفي بنفسه كما كانت لليهود محاريب للخلوة للعبادة كما تقدم عند قوله تعالى : { فخرج على قومه من المحراب } \\[ مريم : 11 \\] وقوله : { كلما دخل عليها زكريا المحراب } \\[ آل عمران : 37 \\] ومن اتخاذ الرهبان النصارى صوامع في أعالي الجبال للخلوة للتعبد ، ووجودها عند هذه الأمم يدل على أنها موجودة عند الأمم المعاصرة لهم والسابقة عليهم .والأسباب : جمع سبب ، والسبب ما يوصِّل إلى مكان بعيد ، فيطلق السبب على الطريق ، ويطلق على الحبل لأنهم كانوا يتوصلون به إلى أعلى النخيل . والمراد هنا : طرق السماوات ، كما في قول زهير :ومن هَاب أسبابَ المنايا يَنَلْنَه ... وإن يَرْقَ أسبابَ السماء بسلّموانتصب { أسباب السماوات } على البدل المطابق لقوله : { الأسباب . } وجيء بهذا الأسلوب من الاجمال ثم التفصيل للتشويق إلى المراد بالأسباب تفخيماً لشأنها وشأننِ عمله لأنه أمرٌ عجيب ليورَدَ على نفس متشوقة إلى معرفته وهي نفس ( هامان ) .والاطّلاع بتشديد الطاء مبالغة في الطلوع ، والطلوع : الظهور . والأكثر أن يكون ظهوراً من ارتفاع ، ويعرف ذلك أو عدمُه بتعدية الفعل فإن عُدي بحرف ( على ) فهو الظهور من ارتفاع ، وإن عُدي بحرف ( إلى ) فهو ظهور مطلق .وقرأ الجمهور : { فأَطَّلِعُ } بالرفع تفريعاً على { أبلغ } كأنه قيل : أبلغُ ثم اطَّلِعُ ، وقرأه حفص عن عاصم بالنصب على جواب الترجي لمعاملة الترجي معاملة التمني وإن كان ذلك غير مشهور ، والبصريون ينكرونه كأنه قيل : متى بلغتُ اطلعتُ ، وقد تكون له ههنا نكتة وهي استعارة حرف الرجاء إلى معنى التمني على وجه الاستعارة التبعية إشارة إلى بُعْد ما ترجاه ، وجعل نصب الفعل بعده قرينة على الاستعارة .وبيْن { إلى } و { إله } الجناسُ الناقص بحرففٍ كما ورد مرتين في قول أبي تمام: ... يمُدُّون من أَيْد عَواصصٍ عَوَاصِمٍتَصُول بأسياف قَوَاضضٍ قَواضَبِ ... وجملة { وَإنِّي لأظُنُّه كاذبا } معترضة للاحتراس من أن يظن ( هامان ) وقومه أن دعوة موسى أوهنت منه يقينَه بدينه وآلهته وأنه يروم أن يبحث بحث متأمل ناظر في أدلة المعرفة فحقق لهم أنه ما أراد بذلك إلا نفي ما ادعاه موسى بدليل الحس . وجيء بحرف التوكيد المعزّز بلام الابتداء لينفي عن نفسه اتهام وزيره إياه بتزلزل اعتقاده في دينه . والمعنى : إني أفعل ذلك ليظهر كذب موسى .\n\n",
      "translations": [
        {
          "translation": "(And Pharaoh said) to his aid: (0 Haman! Build for me a tower that haply I may reach the roads) that I may climb up to the gates,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالصرح الذي أمر فرعون هامان ببنائه هو قاعدة الحكمة النظرية من القياسات الفكرية\n فإن القوم كانوا منطقيين محجوبين بعقولهم المشوبة بالوهم غير المنوّرة بنور الهداية\n أراد أن يبلغ طرق سموات الغيوب ويطلع على الحضرة الأحدية بطريق الفكر دون السلوك في الله بالتجريد والمحو والفناء ولاحتجابه بأنائيته وعلمه قال { وإني لأظنه كاذباً وكذلك } أي: مثل ذلك التزيين والصدّ { زيّن لفرعون سوء عمله } لاحتجابه بصفات نفسه ورذائله { وصدّ عن السبيل } لخطئه في فكره\n أي: فسد علمه ونظره لشدة ميله إلى الدنيا ومحبته إياها بغلبة الهوى بخلاف حال الذي آمن حيث حذر أولاً من الدنيا بقوله: { يا قوم إنما هذه الحياة الدنيا متاع وإن الآخرة هي دار القرار } لسرعة زوال الأولى وبقاء الأخرى دائماً { أدعوكم إلى النجاة } أي: التوحيد والتجريد الذي هو سبب نجاتكم { وتدعونني } إلى الشرك الموجب لدخول النار { وأشرك به ما ليس لي } بوجوده علم إذ لا وجود له { وأنا أدعوكم إلى العزيز } الغالب الذي يقهر من عصاه { الغفّار } الذي يستر ظلمات نفوس من أطاعه بأنواره\n { لا جرم } إلى آخره\n أي: وجب وحق { أنّ ما تدعونني إليه } لا دعوة له في الدارين لعدمه بنفسه واستحالة وجوده فيهما { النار يعرضون عليها غدوّاً وعشيّاً } أي: تصلى أرواحهم بنار الهيئات الطبيعية واحتجاب الأنوار القدسية والحرمان عن اللذات الحسيّة والشوق إليها مع امتناع حصولها\n { ويوم تقوم الساعة } بمحشر الأجساد أو ظهور المهدي عليه السلام\n قيل لهم: ادخلوا { أَشد العذاب } لانقلاب هيئاتهم وصورهم وتراكم الظلمات وتكاثف الحجب وضيق المحبس وضنك المضجع على الأول\n وقهر المهدي عليه السلام إياه وتعذيبه لهم لكفرهم به وبعدهم عنه ومعرفته إياهم بسيماهم على الثاني",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما ظهر أمر موسى وانتشر دينه بين الناس\n ودعوته إلى الله الواحد الأحد الموجِد للسماوات العلا والأرضين السفلى\n ومالت النفوس إليه لوضوح براهينه وسطوع معجزاته { قَالَ فَرْعَوْنُ } مدبراً في دفع موسى\n متأملاً في شأنه\n مشاوراً مع وزيره آمراً له\n منادياً إياه: { يٰهَامَانُ } قد وقع ما نخاف منه من قبل { ٱبْنِ لِي صَرْحاً } بناء رفيعاً ظاهراً عالياً من جميع الأبنية والقصور { لَّعَـلِّيۤ } بالارتقاء والعروج إليه { أَبْلُغُ ٱلأَسْبَابَ } [غافر: 36] المؤيدة لأمر موسى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقال فرعونُ } تمويهاً على قومه\n وجهلاً منه: { يا هامانِ } وزيره { ابنِ لي صَرْحاً } أي: قصراً عالياً\n وقيل: الصرح: البناء الظاهر الذي لا يخفى على الناظر وإن بَعُد منه\n يقال: صَرِح الشيءُ: إذا ظهر\n { لعلِّي أبلُغُ الأسبابَ } أي: الطرق\n ثم أبدل منها تفخيماً لشأنها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:38",
      "similarity": 0.7129772575396354
    },
    {
      "verse": "27:44",
      "similarity": 0.3959833053304776
    },
    {
      "verse": "28:6",
      "similarity": 0.3683994531151496
    },
    {
      "verse": "40:24",
      "similarity": 0.3310010651407446
    },
    {
      "verse": "29:39",
      "similarity": 0.320951680327924
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}