{
  "chapter": "غافر",
  "text": "الذين يجدلون فى ءايت الله بغير سلطن اتىهم كبر مقتا عند الله وعند الذين ءامنوا۟ كذلك يطبع الله على كل قلب متكبر جبار",
  "translations": [
    {
      "translation": "Those who argue about the Signs of Allah without any authority coming to them do something hateful in the sight of Allah and in the sight of the people who have iman. That is how Allah seals up the heart of every arrogant oppressor.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute God's revelations, with no authority having come to them, (are) greatly odious in the sight of God, and the sight of those who believe. That is how God seals every proud and perverse heart.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who contend regarding Allah's Signs without any evidence that might have come to them. That is exceedingly loathsome to Allah and to those that believe. Thus does Allah seal the heart of everyone who is proud and high-handed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who dispute the revelations of God without having received clear authority. This act greatly angers God and the believers. Thus does God seal the hearts of every arrogant oppressor.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute regarding the signs of Allah without any proof having come to them; how very disgusting this is, in the sight of Allah and in the sight of the believers! This is how Allah seals the entire heart of every haughty, rebellious person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute about the Ayat of Allah, without any authority that has come to them, it is greatly hateful and disgusting to Allah and to those who believe. Thus does Allah seal up the heart of every arrogant, tyrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute concerning the communications of Allah without any authority that He has given them; greatly hated is it by Allah and by-those who believe. Thus does Allah set a seal over the heart of every proud, haughty one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Those who dispute concerning the signs of God, without any authority come to them, very hateful is that in the sight of God and the believers; 'so God sets a seal on every heart proud', arrogant.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who wrangle concerning the revelations of Allah without any warrant that hath come unto them, it is greatly hateful in the sight of Allah and in the sight of those who believe. Thus doth Allah print on every arrogant, disdainful heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who dispute God's revelations without any authority are doing something that is greatly abhorrent to God and to the believers. That is how God seals up the heart of every arrogant oppressor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who wrangle concerning the signs of Allah without any authority that hath come Unto them. It is greatly abhorrent Unto Allah and Unto those who believe. Thus Allah sealeth up the heart of any stiff-necked, high-handed, person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute the signs of Allah without any authority that may have come to them—[that is] greatly outrageous to Allah and to those who have faith. That is how Allah seals the heart of every arrogant tyrant.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such) as dispute about the Signs of Allah, without any authority that hath reached them, grievous and odious (is such conduct) in the sight of Allah and of the Believers. Thus doth Allah, seal up every heart - of arrogant and obstinate Transgressors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute about the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, without any authority that has come to them, it is greatly hateful and disgusting to Allah and to those who believe. Thus does Allah seal up the heart of every arrogant, tyrant. (So they cannot guide themselves to the Right Path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute the signs of Allah without any authority having reached them are very hateful before Allah and the believers. As such Allah sets a seal on every heart that is proud and arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who argue against God’s revelations, without any proof having come to them—a heinous sin in the sight of God, and of those who believe. Thus God seals the heart of every proud bully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute concerning the signs of Allah without an authority having come to them - great is hatred [of them] in the sight of Allah and in the sight of those who have believed. Thus does Allah seal over every heart [belonging to] an arrogant tyrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:35] Those who dispute the signs of God, His miracles (alladhīna yujādilūna fī āyāti’Llāhi, the subject) without any warrant, any evidence, that has come to them — greatly hateful [is that], disputing of theirs (kabura, the predicate of the subject) in the sight of God and in the sight of those who believe. So, just as they have been led astray, God sets a seal, of misguidance, on the heart of every arrogant tyrant (read qalbin, ‘the heart of’, with nunation, or without, qalbi). As the heart grows arrogant, so does the individual and vice versa (kulli, in both readings, is meant to indicate the totality of the misguidance of such hearts, not the totality of the hearts).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who wrangle concerning the revelations of Allah) those who deny Muhammad (pbuh) and the Qur'an (without any warrant) without any proof (that hath come unto them) from Allah; the reference here is to Abu Jahl and his host who mocked the Prophet, (it is greatly hateful in the sight of Allah) on the Day of Judgement (and in the sight of those who believe) in the life of this world. (Thus doth Allah print on every arrogant) who is too proud to accept faith, (disdainful heart) of accepting the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلَّذِينَ يُجَادِلُونَ فِيۤ آيَاتِ ٱللَّهِ بِغَيْرِ سُلْطَانٍ } معناه بِغيرِ بُرهانٍ وَلاَ حُجةٍ\n\n",
      "translations": [
        {
          "translation": " The meaning of the verse {those who argue about the verses of God without evidence} is without evidence or proof.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كذلك } أي: مثل ذلك الطبع الفظيع { يَطْبَعُ الله على كل قلب متكبر جبَّار } فيصدر منه أمثال ما ذكر من الإسراف\n والارتياب\n والمجادلة بالباطل\n ومَن قرأ بالتنوين فوصف لقلب\n وإنما وصف بالتكبُّر والتجبُّر لأنه منبعهما\n كما تقول: سَمِعَتِ الأذنُ\n كقوله:\n[البقرة: 283] وإن كان الإثم للجملة\n والله تعالى أعلم\n الإشارة: يُقال لأهل كل عصر: ولقد جاءكم فلان ـ لوليِّ تقدم قبلهم ـ بالآيات الدالة على صحة ولايته\n فما زلتم\n أي: ما زال أسلافكم من أهل عصره ـ في شك منه\n حتى إذا مات ظهرت ولايته\n وأقررتم بها\n وقلتم: لن يبعث الله من بعده وليّاً\n وهذه عادة العامة\n يُقرون الأموات من الأولياء\n ويُنكرون الأحياء\n وهي نزعة أهل الكفر والضلال كذلك يُضل الله مَن هو مسرف مرتاب\n كالذين يُخاصمون في ثبوت الخصوصية عند أربابها\n من غير برهان\n وهو شأن المنكرين\n كذلك يطبع الله على كل قلب متكبر جبار\n ثم ذكر عتو فرعون وطغيانه\n فقال: { وَقَالَ فَرْعَوْنُ يٰهَامَانُ ٱبْنِ لِي صَرْحاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:3",
      "similarity": 0.5891470271001008
    },
    {
      "verse": "40:10",
      "similarity": 0.5641953385669453
    },
    {
      "verse": "35:39",
      "similarity": 0.5485897776285346
    },
    {
      "verse": "4:22",
      "similarity": 0.4147201035121418
    },
    {
      "verse": "30:59",
      "similarity": 0.34738525199641707
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/40:35.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/40:35.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}