{
  "chapter": "غافر",
  "text": "ولقد جاءكم يوسف من قبل بالبينت فما زلتم فى شك مما جاءكم به حتى اذا هلك قلتم لن يبعث الله منۢ بعده رسولا كذلك يضل الله من هو مسرف مرتاب",
  "translations": [
    {
      "translation": "Yusuf brought you the Clear Signs before, but you never stopped doubting what he brought to you to the extent that when he died, you said. \"Allah will never send another Messenger after him.\" That is how Allah",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph had indeed come to you before with clear proofs, but you did not cease to doubt what he had brought until he died, when you said: 'God will not send a prophet after him.' That is how God leads the waster, the sceptic astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Joseph came to you with Clear Signs before, yet you continued to doubt his Message. Thereafter when he died, you said: 'Allah shall send no Messenger after him.'” Thus Allah leads astray those who transgress the limits and are given to much doubting;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph came to you before with illustrious evidence but you still have doubts about what he brought. When he passed away, you said, \"God will never send any Messenger after him.\" Thus does God causes to go astray the skeptical transgressing people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And indeed Yusuf came to you with clear signs before this, thereupon you remained doubtful concerning what he had brought; to the extent that when he died, you said, ‘Allah will surely not send any Noble Messenger after him’”; this is how Allah sends astray whoever transgresses, is doubtful. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Yusuf did come to you, in times gone by, with clear signs, but you ceased not to doubt in that which he did bring to you, till when he died, you said: \"No Messenger will Allah send after him.\" Thus Allah leaves astray him who is a transgressor and a skeptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly Yusuf came to you before with clear arguments, but you ever remained in doubt as to what he brought; until when he died, you said: Allah will never raise an apostle after him. Thus does Allah cause him to err who is extravagant, a doubter\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph brought you the clear signs before, yet you continued in doubt concerning that he brought you until, when he perished, you said, \"God will never send forth a Messenger after him.\" Even, so God leads astray the prodigal and the doubter.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily Joseph brought you of old clear proofs, yet ye ceased not to be in doubt concerning what he brought you till, when he died, ye said: Allah will not send any messenger after him. Thus Allah deceiveth him who is a prodigal, a doubter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph came to you before with clear signs, but you never ceased to doubt the message he brought you. When he died, you said, 'God will not send another messenger.'\"\" In this way God leaves the transgressors and doubters to go astray --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly there came Unto you Yusuf aforetime with evidences, yet ye ceased not to be in doubt concerning that which he brought Unto you, until when he died, ye said: God shall by no means raise an apostle after him. Thus Allah keepeth astray one who is extravagant and a doubter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Joseph brought you manifest proofs earlier, but you continued to remain in doubt concerning what he had brought you. When he died, you said, ‘‘Allah will never send any apostle after him.’’ That is how Allah leads astray those who are unrestrained and skeptical.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to you there came Joseph in times gone by, with Clear Signs, but ye ceased not to doubt of the (Mission) for which he had come: At length, when he died, ye said: 'No messenger will Allah send after him.' thus doth Allah leave to stray such as transgress and live in doubt,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Yusuf (Joseph) did come to you, in times gone by, with clear signs, but you ceased not to doubt in that which he did bring to you, till when he died you said: \"No Messenger will Allah send after him.\" Thus Allah leaves astray him who is a Musrif (a polytheist, oppressor, a criminal, sinner who commit great sins) and a Murtab (one who doubts Allah's Warning and His Oneness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this, Joseph brought you clear signs, but you continued to be doubtful of that which he brought. When he passed away you said: \"Allah will never send another Messenger after him.\" As such Allah leads astray the sinner, the doubter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph had come to you with clear revelations, but you continued to doubt what he came to you with. Until, when he perished, you said, “God will never send a messenger after him.” Thus God leads astray the outrageous skeptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Joseph had already come to you before with clear proofs, but you remained in doubt of that which he brought to you, until when he died, you said, 'Never will Allah send a messenger after him.' Thus does Allah leave astray he who is a transgressor and skeptic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:34] And verily Joseph brought you, before, in other words, before Moses — according to one opinion, this Joseph is the son of Jacob, having been given life until the time of Moses; according to another opinion this is Joseph son of Abraham son of Joseph son of Jacob — clear signs, manifest miracles, but you continued to be in doubt concerning what he had brought you until, when he died, you said, without any evidence [to support such a claim]: “God will never send any messenger after him” — in other words, you will never cease to disbelieve in Joseph and others [that may come after him]. So, that is, just as you have been led astray, God leads astray one who is a prodigal, an idolater, a skeptic’, a doubter of that which the clear signs have certified.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَقَدْ جَاءَكُمْ يُوسُفُ مِنْ قَبْلُ بِالْبَيِّنَاتِ فَمَا زِلْتُمْ فِي شَكٍّ مِمَّا جَاءَكُمْ بِهِ حَتَّى إِذَا هَلَكَ قُلْتُمْ لَنْ يَبْعَثَ اللَّهُ مِنْ بَعْدِهِ رَسُولًا كَذَلِكَ يُضِلُّ اللَّهُ مَنْ هُوَ مُسْرِفٌ مُرْتَابٌ (34) وَلَقَدْ جَآءَكُمْ يُوسُفُ مِن قَبْلُ بالبينات فَمَا زِلْتُمْ فِى شَكٍّ مِّمَّا جَآءَكُمْ بِهِ حتى إِذَا هَلَكَ قُلْتُم لَن يَبْعَثَ اللَّهُ مِنْ بَعدِهِ رَسُولاً } .توسم فيهم قلة جدوى النصح لهم وأنهم مصممون على تكذيب موسى فارتقى في موعظتهم إلى اللوم على ما مضى ، ولتذكيرهم بأنهم من ذرية قوم كذّبوا يوسف لما جاءهم بالبينات فتكذيب المرشدين إلى الحق شنشنة معروفة في أسلافهم فتكون سجية فيهم . وتأكيد الخبر ب ( قد ) ولام القسم لتحقيقه لأنهم مظنة أن ينكروه لبعد عهدهم به .فالمجيء في قوله : { جاءكم } مستعار للحصول والظهور والباء للملابسة ، أي ولقد ظهر لكم يوسف ببيّنات . ولا يلزم أن يكون إظهار البينات مقارناً دعوةً إلى شرع لأنه لما أظهر البينات وتحققوا مكَانتهُ كان عليهم بحكم العقل السليم أن يتبينوا آياته ويستهدوا طريقَ الهدى والنجاة ، فإن الله لم يأمر يوسف بأن يدعو فرعون وقومه ، لحكمة لعلَّها هي انتظار الوقت والحاللِ المناسب الذي ادخره الله لموسى عليه السلام .والبيّنات : الدلائل البينة المظهرة أنه مصطَفى من الله للإِرشاد إلى الخير ، فكان على كل عاقل أن يتبع خطاه ويترسم آثاره ويسأله عما وراء هذا العالم الماديِّ ، بناء على أن معرفة الوحدانية واجبة في أزمان الفترات : إما بالعقل ، أو بما تواتر بين البشر من تعاليم الرسل السابقين على الخلاف بين المتكلمين .والبينات : إخباره بما هو مغيب عنهم من أحوالهم بطريق الوحي في تعبير الرُّؤَى ، وكذلك آية العصمة التي انفرد بها من بينهم وشهدت له بها امرأة العزيز وشاهِدُ أهلها حتى قال المَلِك : { ائتوني به استخلصه لنفسي } \\[ يوسف : 54 \\] ، فكانت دلائل نبوءة يوسف واضحة ولكنهم لم يستخلصوا منها استدلالاً يقتفون به أثره في صلاح آخرتهم ، وحرصوا على الانتفاع به في تدبير أمور دنياهم فأودعوه خزائن أموالهم وتدبير مملكتهم ، فقال له الملِك : { إنك اليوم لدينا مكين أمين } \\[ يوسف : 54 \\] . ولم يخطر ببالهم أن يسْترشدوا به في سلوكهم الديني . فإن قلت : إذا لم يهتدوا إلى الاسترشاد بيوسف في أمور دينهم وألهاهم الاعتناء بتدبير الدنيا عن تدبير الدين فلماذا لم يدْعُهم يوسف إلى الاعتقاد بالحق واقتصر على أن سَأَل من الملك : { اجعلني على خزائن الأرض إني حفيظ عليم } \\[ يوسف : 55 \\] .قلت : لأن الله لم يأمره بالدعوة للإِرشاد إلا إذا سُئل منه ذلك لحكمة كما علمت آنفاً ، فأقامه الله مقام المفتي والمرشد لمن استرشد لا مقام المحتسب المغيِّر للمنكر ، و { الله أعلم حيث يجعل رسالاته } \\[ الأنعام : 124 \\] ، فلما أقامه الله كذلك وعَلِم يوسف من قول الملك : { إنك اليوم لدينا مكين أمين } \\[ يوسف : 54 \\] أن الملك لا يريد إلا تدبير مملكته وأمواله ، لم يسأله أكثر مما يفي له بذلك . وأما وجوب طلبهم المعرفة والاسترشاد منه فذلك حق عليهم ، فمعنى : { فَمَا زِلْتُم في شَكّ مِمَّا جَاءَكُم به } الإِنحاء على أسلافهم في قلة الاهتمام بالبحث عن الكمال الأعلى وهو الكمال النفساني باتباع الدين القويم ، أي فما زال أسلافكم يشعرون بأن يوسف على أمر عظيم من الهُدى غير مألوف لهم ويهرعون إليه في مهماتهم ثم لا تعزم نفوسهم على أن يطلبوا منه الإرشاد في أمور الدين .فهم من أمره في حالة شك ، أي كان حاصل ما بلغوا إليه في شأنه أنهم في شك مما يكشف لهم عن واجبهم نحوه فانقضت مدة حياة يوسف بينهم وهم في شك من الأمر . فالملام متوجه عليهم لتقصيرهم في طلب ما ينجيهم بعد الموت قال تعالى : { من كان يريد العاجلة عجلنا له فيها } \\[ الإسراء : 18 \\] الآيتين .وحتى } للغاية وغايتها هو مضمون الجملة التي بعدها وهي جملة : { إذَا هَلَكَ } ، و { إذَا } هنا اسم لزمان المضي مجرورة ب ( حتى ) وليست بظرف ، أي حتى زمننِ هلاك يوسف قُلتم : لن يَبعث الله من بعده رسولاً ، أي قال أسلافكم في وقت وفاة يوسف : لا يبعث الله في المستقبل أبداً رسولاً بعد يوسف ، يعنون : أنا كنا مترددين في الإِيمان بيوسف فقد استرحنا من التردد فإنه لا يجيء من يدَّعِي الرسالة عن الله من بعده ، وهذا قول جَرى منهم على عادة المعاندين والمقاومين لأهل الإِصلاح والفضل أن يعترفوا بفضلهم بعد الموت تندماً على ما فاتهم من خير كانوا يَدعونهم إليه .وفيه ضرب من المبالغة في الكمال في عصره كما يقال : خاتمة المحققين ، وبقية الصالحين ، ومن لا يأتي الزمان بمثله ، وحاصله أنهم كانوا في شك من بعثة رسول واحد ، وأنهم أيقنوا أن من يَدّعي الرسالة بعده كاذب فلذلك كذبوا موسى .ومقالتهم هذه لا تقتضي أنهم كانوا يؤمنون بأنه رسول ضرورةَ أنهم كانوا في شك من ذلك وإنما أرادوا بها قطع هذا الاحتمال في المستقبل وكشفَ الشك عن نفوسهم وظاهر هذه الآية أن يوسف كان رسولاً لظاهر قوله : { قلتم لَن يَبْعثَ الله من بَعْدِهِ رَسُولاً } أن رسولاً محال من ضمير { من بعده } . والوجه أن يكون قوله : { رسولا } مفعولَ { يبعث } وأنه لا يقتضي وصف يوسف به فإنه لم يَرِد في الأخبار عدّة في الرسل ولا أنه دعا إلى دين في مصر وكيف والله يقول : { ما كان ليأخذ أخاه في دين الملك إلا أن يشاء الله } \\[ يوسف : 76 \\] ولا شك في أنه نبيء إذا وجد مساغاً للإرشاد أظهره كقوله : { يا صاحبي السجن أأرباب متفرقون خير أم الله الواحد القهار ما تعبدون من دونه إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان } \\[ يوسف : 39 ، 40 \\] وقوله : { إني تركت ملة قوم لا يؤمنون بالله وهم بالآخرة هم كافرون وأتعبتُ ملة آباءي إبراهيم وإسحاق ويعقوب ما كان لنا أن نشرك بالله من شيء } \\[ يوسف : 37 ، 38 \\] .وعدي فعل { جاءكم } إلى ضمير المخاطبين .وأسند { فما زِلْتُمْ } و { قلتم } إلى ضميرهم أيضاً ، وهم ما كانوا موجودين حينئذٍ قصداً لحمل تبعة أسلافهم عليهم وتسجيلاً عليهم بأن التكذيب للناصحين واضطراب عقولهم في الانتفاع بدلائل الصدق قد ورثوه عن أسلافهم في جبلّتهم وتقرر في نفوسهم فانتقاله إليهم جيلاً بعد جيل كما تقدم في خطاب بني إسرائيل في سورة \\[ البقرة : 49 \\] : { وإذا نجيناكم من آل فرعون } ونحوه .جرى أكثر المفسرين على أن هذه الجمل حكاية لبقية كلام المؤمن وبعضهم جعل بعضها من حكاية كلام المؤمن وبعضَها كلاماً من الله تعالى ، وذلك من تجويز أن يكون قوله : { الَّذِينَ يجادلونرسولا كَذَلِكَ يُضِلُّ الله مَنْ هُوَ مُسْرِفٌ مُّرْتَابٌ \\* الذين يجادلون فى ءايات الله بِغَيْرِ سلطان أتاهم كَبُرَ مَقْتاً عِندَ الله وَعِندَ الذين ءَامَنُواْ كَذَلِكَ يَطْبَعُ الله على كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ } الخ بدلاً أو مبتدأ ، وسكت بعضهم عن ذلك مقتصراً على بيان المعنى دون تصدّ لبيان اتصالَها بما قبلها .والذي يظهر أن قوله : { كذلك يُضِلُّ الله مَنْ هُوَ مُسْرِفٌ مُرْتَابٌ } إلى قوله : { جَبَّارٍ } . كله من كلام الله تعالى معترَض بين كلام المؤمن وكلام فرعون فإن هذا من المعاني الإِسلامية قصد منه العبرة بحال المكذبين بموسى تعريضاً بمشركي قريش ، أي كضلال قوم فرعون يضل الله من هو مسرف مرتاب أمثالكم ، فكذلك يكون جزاؤكم ، ويؤيد هذا الوجه قوله في آخرها : { وَعِندَ الَّذِينَ ءامَنُوا } فإن مؤمن آل فرعون لم يكن معه مؤمن بموسى وهارون غيره ، وهذا من باب تذكر الشيء بضده ، ومما يزيد يقيناً بهذا أن وصف { الذين يجادلون في آيات الله } تكرر أربع مرات من أول هذه السورة ، ثم كان هنا وسطاً في قوله : { إن الذين يجادلون في آيات الله بغير سلطان أتاهم إن في صدورهم إلا كبر ما هم ببالغيه } \\[ غافر : 56 \\] ، ثم كان خاتمة في قوله : { ألم تر إلى الذين يجادلون في آيات الله أنى يصرفون } \\[ غافر : 69 \\] .والإِشارة في قوله كذلك : إلى الضلال المأخوذ من قوله : { يُضِلُّ الله } أي مثل ذلك الضلال يضل الله المسرفين المرتابين ، أي أن ضلال المشركين في تكذيبهم محمداً صلى الله عليه وسلم مثل ضلال قوم فرعون في تكذيبهم موسى عليه السلام . والخطاب بالكاف المقترنة باسم الإِشارة خطاب للمسلمين .والمسرف : المُفْرِط في فعل لا خير فيه . والمرتاب : الشديد الريب ، أي الشك .وإسناد الإِضلال إلى الله كإسناد نفي الهداية إليه في قوله : { إن الله لا يهدي من هو مسرف كذاب } \\[ غافر : 28 \\] ، وتقدم آنفاً .\n\n",
      "translations": [
        {
          "translation": "(And verily Joseph brought you) it is Ezekiel who said this (of old) before Moses (clear proofs) commands, prohibitions, the interpretation of dreams and the tearing off of his shirt, (yet ye ceased not to be in doubt concerning what he) Joseph (brought you till, when he died, ye said: Allah will not send any messenger after 543 him) after his death. (Thus Allah deceiveth) misguides from His religion (him who is a prodigal) an idolater, (a doubter) because of his idolatry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال القائل المذكور تسجيلاً على غيهم وضلالهم: { وَ } كيف تستبعدون نبوة هذا المدعي ورسالته من عند الله مع أنه ليس ببدع منه\n بل { لَقَدْ جَآءَكُـمْ } أي: على آبائكم وأسلافكم { يُوسُفُ } ابن يعقوب رسولاً { مِن قَبْلُ } أي: من قبل هذا المدعي مؤيداً من عنده سبحانه { بِٱلْبَيِّنَاتِ } المبينة الموضحة لدعواه ورسالته { فَمَا زِلْتُمْ } أي: كنتم دائماً مستمراً سلفاً وخلفاً { فِي شَكٍّ } وتردد { مِّمَّا جَآءَكُـمْ بِهِ } في أمر الدين وشأن التوحيد واليقين { حَتَّىٰ إِذَا هَلَكَ } أي: مات يوسف عليه السلام وانقرض زمانه { قُلْتُمْ } من كمال تعنتكم وعنادكم على سبيل الجزم\n بلا دليل وبرهان نزل عليكم عقلاً ونقلاً: { لَن يَبْعَثَ ٱللَّهُ مِن بَعْدِهِ رَسُولاً } مع أنكم شاكون في رسالته أيضاً\n بل في مطلق الرسالة والإنزال من الله الواحد القهار\n\n\n{ كَذَلِكَ } أي: مثل ضلالكم هذا { يُضِلُّ ٱللَّهُ } المضل المغوي بمقتضى قهره وجلاله جميع { مَنْ هُوَ مُسْرِفٌ } في الخروج عن مقتضى الحدود املوضوعة لحفظ القسط الإلهي والاعتدال الحقيقي { مُّرْتَابٌ } [غافر: 34] شاك فيما يثبته البينات الواضحة والمعجزات اللائحة\n\n\nوبالجملة: المسرفون المكابرون { ٱلَّذِينَ يُجَادِلُونَ فِيۤ آيَاتِ ٱللَّهِ } الدالة على توحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الذين يُجادلون }: بدل مِن { مَن هو } وإنما جمع لأنه لم يرد مسرفاً واحداً\n بل كل مسرف\n  يقول الحق جلّ جلاله: حاكياً لقول المؤمن: { ولقد جاءكم يوسُف } \n هو ابن يعقوب\n وقيل: يوسف بن إفراثيم بن يوسف بن يعقوب\n أقام فيهم نبيّاً عشرين سنة\n وقال وهب: فرعون موسى هو فرعون يوسف\n عمَّر إلى زمنه\n وقيل: هو فرعون آخر لأن كل مَن ملك مصر يُقال له فرعون\n وهذا أظهر\n وقول الجلال المحلي: هو يوسف بن يعقوب في قولٍ\n عمّر إلى زمنه\n سهو\n وإنما قيل ذلك في فرعون لا في يوسف\n قلت: والتحقيق: أنه وبّخهم بما فعل أسلافهم لأنهم على مِنوالهم\n راضون بما فعلوا\n فالمراد بيوسف\n هو الصِّدِّيق\n فما زالوا مترددين في رسالته حتى مات\n واستمر خلفهم على ذلك إلى زمن موسى\n وقوله تعالى: { من قبلُ } أي: من قبل موسى\n أي: جاءكم يوسف { بالبينات } بالمعجزات الواضحة\n كتعبير الرؤيا\n ودلائل التوحيد\n كقوله:\n[يوسف: 39] الآية\n وملكه أموالهم ورقابهم في زمن المسبغة\n وغير ذلك مما دلّ على رسالته\n { فما زلتم في شكٍّ مما جاءكم به } من الدين { حتى إِذا هَلَكَ } بالموت { قُلْتم لن يبعثَ الله من بعده رسولاً } \n حكماً من عند أنفسكم\n من غير برهان\n أي: أقمتم على كفركم\n وظننتم أن لا يجدّد عليكم إيجاب الحجة\n قال القشيري: يقال: إن تكذيبهم وتكذيب سلفهم للأنبياء ـ عليهم السلام ـ كان قديماً حتى أهلكهم\n كذلك يفعل بهؤلاء\n هـ\n { كذلك يُضِلُّ الله مَن هو مُسْرِفٌ مرتابٌ } أي: مثل ذلك الإضلل الفظيع يُضل الله مَن هو مسرف في عصيانه\n شاكّ في دينه\n لم يتفكّر فيما شهدت البينات بصحته لِغلبة الوهم\n والانهماك في التقليد\n ثم فسّره فقال: { الذين يُجادِلون في آيات الله } بالرد والإبطال { بغير سلطانٍ } بغير حجة واضحة\n تصلح للتمسُّك بها في الجملة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:110",
      "similarity": 0.47392894401231295
    },
    {
      "verse": "11:118",
      "similarity": 0.3906671379374458
    },
    {
      "verse": "11:62",
      "similarity": 0.3737344026090858
    },
    {
      "verse": "10:28",
      "similarity": 0.3703579012387274
    },
    {
      "verse": "11:110",
      "similarity": 0.36201559703692826
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}