{
  "chapter": "غافر",
  "text": "اسبب السموت فاطلع الى اله موسى وانى لاظنه كذبا وكذلك زين لفرعون سوء عمله وصد عن السبيل وما كيد فرعون الا فى تباب",
  "translations": [
    {
      "translation": "access to the heavens, so that I can look on Musa's God. Truly I think he is a liar.' That is how Pharaoh's evil actions were made attractive to him and he debarred others from the Path. Pharaoh's scheming led to nothing but ruin.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of reaching the tracts of heaven and look at the god of Moses, though I think that he is a liar.\" Thus were the evil deeds of Pharaoh made to look attractive to him, and he was hindered from the path. So the stratagem of Pharaoh was bound to perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the highways to the heavens -- and have a look at the God of Moses, although I am certain that Moses is a liar.” Thus Pharaoh's evil deed was made to seem fair to him, and he was barred from the Right Path. Pharaoh's guile only led him to his own perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to the heavens and be able to climb up to the Lord of Moses. I think that Moses is lying.\" Thus, Pharaoh's evil deeds seemed attractive to him and prevented him from the right path. The Pharaoh's plots only led him to his own destructor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“The routes of the heavens, in order to glance at the God of Moosa – and indeed I think he is a liar”; this is how the evil deeds of Firaun were made seeming good to him, and he was stopped from the path; and the evil scheme of Firaun was destined to be ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ways of the heavens, and I may look upon the God of Musa, but verily, I think him to be a liar.\" Thus it was made fair seeming, in Fir`awn's eyes, the evil of his deeds, and he was hindered from the path; and the plot of Fir`awn led to nothing but loss and destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The means of access to the heavens, then reach the god of Musa, and I surely think him to be a liar. And thus the evil of his deed was made fairseeming to Firon, and he was turned away from the way; and the struggle of Firon was not (to end) in aught but destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the cords of the heavens, and look upon Moses' God; for I think that he is a liar.' So the evil of his deeds was decked out fair to Pharaoh, and he was barred from the way, and Pharaoh's guile came only to ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The roads of the heavens, and may look upon the god of Moses, though verily I think him a liar. Thus was the evil that he did made fairseeming unto Pharaoh, and he was debarred from the (right) way. The plot of Pharaoh ended but in ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to the heavens, so that I may look upon the God of Moses: I am convinced that he is a liar!\" That is how Pharaoh's evil actions were made to look fair in the eyes of Pharoah, and he was turned away from the path [of truth]. Pharaoh's scheming led to nothing but ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way of access to the heavens so that may be apprised of the God of Musa, and verily I believe him to be a liar. And thus fair- seeming was made Unto FIr'awn the evil of his work, and he was hindered from the path. And the plot of Fir'awn ended only in ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—the routes of the heavens—and take a look at the God of Moses, and indeed I consider him a liar.’ The evil of his conduct was thus presented as decorous to Pharaoh, and he was kept from the way [of Allah]. Pharaoh’s stratagems only led him into ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ways and means of (reaching) the heavens, and that I may mount up to the god of Moses: But as far as I am concerned, I think (Moses) is a liar!\" Thus was made alluring, in Pharaoh's eyes, the evil of his deeds, and he was hindered from the Path; and the plot of Pharaoh led to nothing but perdition (for him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ways of the heavens, and I may look upon the Ilah (God) of Musa (Moses) but verily, I think him to be a liar.\" Thus it was made fair-seeming, in Fir'aun's (Pharaoh) eyes, the evil of his deeds, and he was hindered from the (Right) Path, and the plot of Fir'aun (Pharaoh) led to nothing but loss and destruction (for him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the ways of heaven so that I may look upon the God of Moses, because I think that he is a liar' And so Pharaoh's evil deeds were made to seem fair to him, and he was barred from the Way. And Pharaoh's guile came to nothing except ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pathways of the heavens, so that I may glance at the God of Moses; though I think he is lying.” Thus Pharaoh’s evil deeds were made to appear good to him, and he was averted from the path. Pharaoh's guile was only in defeat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ways into the heavens - so that I may look at the deity of Moses; but indeed, I think he is a liar.\" And thus was made attractive to Pharaoh the evil of his deed, and he was averted from the [right] way. And the plan of Pharaoh was not except in ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:37] the routes of the heavens — the paths that lead to it, and look upon (read [indicative] fa-attali‘u as a supplement to ablughu, ‘I may reach’; or read [subjunctive] fa-attali‘a, as the response to ibni lī, ‘build for me’) the God of Moses; for I truly think that he, that is, Moses, is lying’, about his having a god other than me — Pharaoh said this in order to disguise [the truth]. And that is how the evil [nature] of his conduct was made to seem fair to Pharaoh, and [that is how] he was barred from the [right] way, the path to guidance (read sadda, ‘[that is how] he barred [others]’, or sudda, ‘[that is how] he was barred’). And Pharaoh’s guile ended only in ruin, loss.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The roads of the heavens) the gates of heaven, (and may look upon) and may see (the God of Moses) whom he claims is in heaven and has sent him to me, (though verily I think him a liar) there is no God in heaven. But he got too busy with Moses and the tower was not built. (Thus was the evil that he did made fair-seeming unto Pharaoh, and he was debarred from the (right) way) and he was prevented from the Truth and guidance. (The plot of Pharaoh ended but in ruin) in disarray.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقوله تعالى: { إِلاَّ فِي تَبَابٍ } معناه في هَلكةٍ\n\n",
      "translations": [
        {
          "translation": "\nThe saying of the Most High: {Except in a case of} means in destruction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nيعني: { أَسْبَابَ ٱلسَّمَٰوَٰتِ } أي: المؤثرات العلوية { فَأَطَّلِعَ إِلَىٰ إِلَـٰهِ مُوسَىٰ } وأسأل منه أمره: أهو صادق في دعواه أو كاذب؟ { وَإِنِّي } بمقتضى عقلي وفراستي { لأَظُنُّهُ كَاذِباً } ساحراً مفترياً على الله ترويجاً لسحره\n وتقريراً لضعفاء الأنام\n\n\nقيل: أمر ببناء رصد\n ليطلع على قوة طالع موسى وضعفه { وَكَـذَلِكَ } أي: مثلما سمعت { زُيِّنَ لِفِرْعَوْنَ سُوۤءُ عَمَلِهِ } أي: حسن الله له تدبيره الذي تأمل في دفع موسى بأمثال هذه الأفكار الفاسدة { وَصُدَّ عَنِ ٱلسَّبِيلِ } السوي الموصل إلى توحيد الحق { وَ } بالجملة: { مَا كَـيْدُ فِرْعَوْنَ } ومكره الذي دبره لدفع موسى { إِلاَّ فِي تَبَابٍ } [غافر: 37] هلاك وخسار\n\n\n{ وَ } بعدما ألزمهم القائل بأنواع الإلزام\n وأسكتهم بالدلائل القاطعة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وإظهاراً أنه يقصد أمراً عظيماً: { أسبابَ السماوات } أي: طرُقها وأبوابها\n وما يُؤدّي إليها\n وكل ما أدّاك إلى الشيء فهو سبب إليه\n { فأَطَّلِعَ إِلى إِله موسى } أي: فأنظر إليه وأتحقق وجوده\n قرأه حفص بالنصب\n جواب التمني\n والباقي بالرفع\n عطفاً على \" أبلغ \"\n قال البيضاوي: ولعله أراد أن يبني له صرحاً في موضع عال\n يرصد منه أحوال الكواكب\n التي هي أسباب سماوية\n تدلّ على الحوادث الأرضية\n فيرى هل فيها ما يدلّ على إرسال الله تعالى إياه\n أو أن يرى فساد قوله عليه السلام فإنّ إخباره عن إله السماء يتوقف على اطلاعه ووصوله إليه\n وذلك لا يتأتى إلا بالصعود للسماء\n وهو مما لا يقوى عليه الإنسان\n وما ذلك إلا لجهله بالله وكيفية استنبائه\n هـ\n قلت: والظاهر أنه كان مجسّماً\n يعتقد أن الله في السماء\n وأن اطلاعه إليه إنما كان ليرى هل ثَم إله\n وإن قوله: { وإِني لأظنه كاذباً } أي: في ادّعاء إله غيري\n بدليل قوله:\n[القصص: 38] مع أنَّ هذا كله إنما هو تمويه منه على قومه\n وجرأة على الله\n لا حقيقة له\n قال تعالى: { وكذلك } أي: ومثل ذلك التزيين المفرط\n والصدّ البليغ\n { زُيِّنَ لفرعونَ سوءُ علمه } فانهمك فيه انهماكاً لا يرعوي عنه بحال\n { وصدَّ عن السبيل } أي: سبيل الرشاد\n وقرأ الكوفون ويعقوب \" وصُدّ \" بالبناء للمفعول\n فالفاعل في الحقيقة فيهما هو الله\n بتوسط الشيطان في عالم الحكمة\n ومَن قرأ \" صَدّ \" بالبناء للفاعل\n فالفاعل: فرعون\n إما صدّ الناس عن طريق الحق بأمثال هذه التمويهات\n أو: اتصف بالصدّ\n { وما كيدُ فرعون إِلا في تَبابٍ } أي: خسران وهلاك\n الإشارة: ما ظهر على فرعون هو من طغيان النفس وعتوها\n فإنَّ النفس إذا اتصلت بها العوافي\n وساعدتها أقدار الجمال في الظاهر\n ادَّعت الربوبية\n فإنَّ فرعون قيل: إنه عاش أربعمائة سنة\n لم يتوجع فيها قط\n فادّعى الربوبية\n ولذا قال بعض الصوفية: في النفس خاصية ما ظهرت إلا على فرعون\n حين قال: أنا ربكم الأعلى\n فكان نزول الأقدار القهرية والبلايا على العبد\n رحمة عظيمة\n تتحقق بها العبودية\n التي هي شرف العبد ورفعته\n وبالله التوفيق\n ثم ذكر بقية وعظ المؤمن\n فقال: { وَقَالَ ٱلَّذِيۤ آمَنَ يٰقَوْمِ ٱتَّبِعُونِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:101",
      "similarity": 0.630947117093203
    },
    {
      "verse": "111:1",
      "similarity": 0.500368064304299
    },
    {
      "verse": "6:108",
      "similarity": 0.317068034295382
    },
    {
      "verse": "22:15",
      "similarity": 0.30439339725583325
    },
    {
      "verse": "18:85",
      "similarity": 0.2663270752591263
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}