{
  "chapter": "غافر",
  "text": "مثل داب قوم نوح وعاد وثمود والذين منۢ بعدهم وما الله يريد ظلما للعباد",
  "translations": [
    {
      "translation": "the same as happened to the people of Nuh and 'Ad and Thamud and those who followed after them. Allah does not want any injustice for His slaves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the people of Noah, 'Ad and Thamud, and those that came after them. God does not want to be unjust to His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "like the day that overtook the people of Noah and Ad and Thamud, and those who came after them. Allah does not wish to subject His servants to any injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "people of Noah, Ad, Thamud, and those after them. God did not want injustice for His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Like the tradition of the people of Nooh, and Aad, and Thamud and others after them; and Allah does not will injustice upon bondmen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the end of the people of Nuh, and `Ad, and Thamud and those who came after them. And Allah wills no injustice for (His) servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The like of what befell the people of Nuh and Ad and Samood and those after them, and Allah does not desire injustice for (His) servants;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the like of the case of Noah's people, Ad, Thamood, and those after them; and God desires not wrong for His servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A plight like that of Noah's folk, and A'ad and Thamud, and those after them, and Allah willeth no injustice for (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "like the fate of the people of Noah, 'Ad, Thamud, and those who came after them -- God never wills injustice on His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the wont of the people of Nuh and A'ad and Thamud and those after them, and God intendeth not any wrong Unto His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "like the case of the people of Noah, of Ad and Thamud, and those who came after them, and Allah does not desire any wrong for [His] servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Something like the fate of the People of Noah, the 'Ad, and the Thamud, and those who came after them: but Allah never wishes injustice to his Servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the fate of the people of Nuh (Noah), and 'Ad, and Thamud and those who came after them. And Allah wills no injustice for (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or, something similar to the circumstances of the nations of Noah, Aad, and Thamood, and those who came after them. Allah does not want to wrong His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the fate of the people of Noah, and Aad, and Thamood, and those after them. God wants no injustice for the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the custom of the people of Noah and of 'Aad and Thamud and those after them. And Allah wants no injustice for [His] servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:31] like the case of the people of Noah, and ‘Ād, and Thamūd, and those [who came] after them (mithla, ‘like’, substitutes for the previous mithla, ‘like’) in other words, the same requital as was customarily dealt to those who disbelieved before you, of their being chastised in this world, and God does not desire to wrong [any of] His servants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A plight) a punishment (like that of Noah's folk, and 'Aad) the folk of Hud (and Thamud) the folk of Salih, (and those after them) among the disbelievers, (and Allah willeth no injustice for (His) slaves) Allah does not transgress against His slaves such that He punishes them without them having committed any crime.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مِثْلَ دَأْبِ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَ } مثل المكذبين المسرفين { مِن بَعْدِهِمْ } ظهروا على رسل الله وكفروا به سبحانه { ٱلَّذِينَ } فلحقهم من العذاب ما لحقهم\n وكذلك يحل عليكم ما حل عليهم\n لو تقتفون أثرهم بالخروج عن مقتضى الحدود الإلهية { وَ } إلا { مَا ٱللَّهُ } العليم الحكيم { يُرِيدُ ظُلْماً لِّلْعِبَادِ } [غافر: 31] المتحرزين عن مطلق الجرائم والآثام المنافية للحدود الإلهية\n فلا يعاقب من لا ذنب له\n ولا يحل عليه عذابه\n\n\nثم ناداهم القائل الموحد أيضاً على سبيل التأكيد والمبالغة تتميماً لما يخفى في صدره من ترويج الحق وتقوية الرسول المرسل به\n فقال: { وَيٰقَوْمِ إِنِّيۤ أَخَافُ عَلَيْكُمْ يَوْمَ ٱلتَّنَادِ } [غافر: 32] أي: العذاب الموعود في يوم القيامة\n سميت به\n لتفرق الناس فيه وفرار كل منهم عن أبيه وأخيه وأمه وبنيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجمْعُ الأحزاب مع التفسير أغنى عن جمع اليوم، أي: بالإضافة، وفسره بقوله:  { مثلَ دأبِ قومِ نوحٍ وعادٍ وثمودَ والذين من بعدهم } كقوم لوط وشعيب، لم يُلْبَسْ أنّ كلّ حزب منهم كان له يوم دَمَار، فاقتصر على الواحد من الجمع\n ودأب هؤلاء: دؤوبهم في عملهم من الكفر، والتكذيب، وسائر المعاصي، حتى دمَّرهم الله\n ولا بد من حذف مضاف، أي: مثل جزاء دأبهم ـ وهو الهلاك\n و مثل الثاني: عطف بيان لمثل الأولى\n { وما الله يريد ظلماً للعباد } فلا يُعاقبهم بغير ذنب، أو: يزيد على ما يستحقونه من العذاب، يعني أن تدميرهم كان عدلاً لأنهم استحقوه بأعمالهم، وهو أبلغ من قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:11",
      "similarity": 0.6257118436708379
    },
    {
      "verse": "8:52",
      "similarity": 0.5986309877219567
    },
    {
      "verse": "8:54",
      "similarity": 0.5926499916745231
    },
    {
      "verse": "14:33",
      "similarity": 0.5909364524184579
    },
    {
      "verse": "22:42",
      "similarity": 0.44259110011617314
    }
  ]
}