{
  "chapter": "غافر",
  "text": "يوم تولون مدبرين ما لكم من الله من عاصم ومن يضلل الله فما له من هاد",
  "translations": [
    {
      "translation": "The day you will turn your backs and flee, with none to defend you against God. Whoever God allows to go astray has none to show him the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when you will turn around to retreat, there will be none to protect you from Allah. He whom Allah lets go astray, none will be able to show him the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day you will run away, but no one will be able to protect you from (God's Judgment). No one can guide one whom God has caused to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“A day when you will turn back fleeing; none can save you from Allah; and whomever Allah sends astray, there is no guide for him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Day when you will turn your backs and flee having no protector from Allah. And whomsoever Allah sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which you will turn back retreating; there shall be no savior for you from Allah, and whomsoever Allah causes to err, there is no guide for him:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day you turn about, retreating, having none to defend you from God; and whomsoever God leads astray, no guide has he.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day when ye will turn to flee, having no preserver from Allah: and he whom Allah sendeth astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when you will [wish to] turn your backs and flee, having none to defend you against God: for he whom God lets go astray can never find any guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Day whereon ye shall turn away retreating: for you there will be no protector from God; and whomsoever God sendeth astray for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a day when you will turn back [to flee], not having anyone to protect you from Allah, and whomever Allah leads astray has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Day when ye shall turn your backs and flee: No defender shall ye have from Allah: Any whom Allah leaves to stray, there is none to guide...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Day when you will turn your backs and flee having no protector from Allah, And whomsoever Allah sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when you will turn in retreat with none to protect you from Allah. He whom Allah leads astray has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when you will turn and flee, having no defender against God. Whomever God misguides has no guide.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day you will turn your backs fleeing; there is not for you from Allah any protector. And whoever Allah leaves astray - there is not for him any guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:33] a day when you will turn back to flee, from the site of the Reckoning [leading] to the Fire, not having anyone to defend you, to protect you, from God, in other words, from His chastisement, and whomever God leads astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A day when ye will turn to flee) from Allah's punishment, (having no preserver) having no saver (from Allah) from Allah's punishment: (and he whom Allah sendeth astray) from His religion, (for him there is no guide) to His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوأخاف أيضاً { يَوْمَ تُوَلُّونَ } وتنصرفون عن موقف العرض والحساب { مُدْبِرِينَ } قهقرى هاربين فارين من كثرة الآثام والجرائم الجالبة لأنواع العذاب، تخيلوا أيها المسرفون وتحروا في نفوسكم { مَا لَكُمْ } حينئذ { مِّنَ } غضب { ٱللَّهِ } ونزول عذابه عليكم { مِنْ عَاصِمٍ } يعصمكم ويدفع عنكم عذابه { وَ } بالجملة: اعلموا أن { مَن يُضْلِلِ ٱللَّهُ } المضل المغوي بمقتضى قهره وجلاله، ويحمله على ما لا ينبغي له ولا يرضى منه سبحانه، بل إنما ابتلاه وحمله عليه فتنة واختباراً { فَمَا لَهُ مِنْ هَادٍ } [غافر: 33] أي: إنه ماله هادٍ يهديه إلى ما يعينه ويليق بحاله ويرضى منه سبحانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}