{
  "chapter": "غافر",
  "text": "لا جرم انما تدعوننى اليه ليس له دعوة فى الدنيا ولا فى الءاخرة وان مردنا الى الله وان المسرفين هم اصحب النار",
  "translations": [
    {
      "translation": "There is no question that what you call me to has no foundation either in this world or the Next World, that our return is to Allah, and that the profligate will be Companions of the Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you are calling me to is surely not worth the calling in this world or in the next, because our returning is to God; and because the transgressors will be inmates of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no doubt that those whom you call me to have no claim to be called upon in this world and in the Hereafter. Certainly to Allah shall be our return, and those who exceed the limits are destined to the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The idols to which you invite me certainly have no claim to be deities in this world or in the life to come. Our return is to God and the transgressors will be the dwellers of hell fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So it is self evident that what you call me towards has no benefit being prayed to, either in this world or in the Hereafter, and that our return is towards Allah, and that the transgressors only are the people of the fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "La Jarama, you call me to one that does not have a claim in this world or in the Hereafter. And our return will be to Allah, and the transgressors, they shall be the dwellers of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt that what you call me to has no title to be called to in this world, nor in the hereafter, and that our turning back is to Allah, and that the extravagant are the inmates of the fire;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt that what you call me to has no call heard, in this world or in the world to come, that to God we return, and that the prodigal are the inhabitants of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly that whereunto ye call me hath no claim in the world or in the Hereafter, and our return will be unto Allah, and the prodigals will be owners of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely that to which you call me has no say in this world or in the life to come, that our return is to God alone, and that the transgressors shall be the inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without doubt ye only call me Unto that which is not to be invoked in the world nor in the Hereafter; and verily our return shall be Unto God, and the extravagant! they shall be fellows of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly, that to which you invite me has no invitation in the world nor in the Hereafter, and indeed our return will be to Allah, and indeed it is the transgressors who will be inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without doubt ye do call me to one who is not fit to be called to, whether in this world, or in the Hereafter; our return will be to Allah; and the Transgressors will be Companions of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt you call me to (worship) one who cannot grant (me) my request (or respond to my invocation) in this world or in the Hereafter. And our return will be to Allah, and Al-Musrifun (i.e. polytheists and arrogants, those who commit great sins, the transgressors of Allah's set limits)! They shall be the dwellers of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no doubt that what you call me to has neither a call in this world, nor in the Everlasting Life. To Allah we shall return, and the excessive sinners are the inhabitants of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without a doubt, what you call me to has no say in this world, or in the Hereafter; and our turning back is to God; and the transgressors are the inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly, that to which you invite me has no [response to a] supplication in this world or in the Hereafter; and indeed, our return is to Allah, and indeed, the transgressors will be companions of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:43] No doubt, verily, that to which you call me, to worship, has no call [that is heard], in other words, [has no] call answered, in this world or in the Hereafter, and indeed our return will be to God, and indeed the prodigal, the disbelievers, it is they who will be the inhabitants of the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "544 (Assuredly that whereunto ye call me hath no claim) no power (in the world or in the Hereafter, and our return will be unto Allah) after we die, (and the prodigals) the idolaters (will be owners of the Fire) the inhabitants of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَنَّ ٱلْمُسْرِفِينَ هُمْ أَصْحَابُ ٱلنَّارِ } معناه سَفكةُ الدِّماءِ بغيرِ حَقِّها\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {And that the transgressors are the companions of the Fire} means the shedding of blood without right.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لاَ جَرَمَ } أي: حق وثبت { أَنَّمَا تَدْعُونَنِيۤ إِلَيْهِ } وتمدونني نحوه { لَيْسَ لَهُ دَعْوَةٌ } أي: لا يتأتى منه الدعوة والهداية والإرشاد\n ولا { فِي ٱلدُّنْيَا وَلاَ فِي ٱلآخِرَةِ } إذ لا يتيسر للجمادات دعوة الإنسان وتكميله مطلقاً\n { وَ } بعدما انقضى أمر آلهتكم وعدم لياقتهم بالألوهية والربوبية\n ظهر { أَنَّ مَرَدَّنَآ } ومرجعنا\n يعني: أنا وأنتم وسائر العباد والمظاهر عموماً { إِلَى ٱللَّهِ } الواحد الأحد الصمد الحقيق بالحقية\n بلا توهم الشركة والنزاع رجوع الأظلال إلى الأضواء\n والأمواج إلى الماء { وَ } ظهر أيضاً { ٱلْمُسْرِفِينَ } الخائضين في توحيده سبحانه بالهذيانات التي تركبها أوهامهم وخيالاتهم\n بلا تأييد من وحي إلهي وعقلي فطري { هُمْ أَصْحَابُ ٱلنَّارِ } [غافر: 43] ملازموها وملاصقوها أبد الآباد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا جَرَمَ } لا شك، أو: حقاً، وقال البصريون: \" لا \": نفي رد لِما دعوه إليه، و \" جرم \": فعل، بمعنى: حقّ، و \" أن \" مع \" ما \" في حيزه فاعل، أي: حق ووجب { أنّما تدعونني إِليه ليس له دعوةٌ في الدنيا ولا في الآخرة } أي: وجب عدم دعوة آلهتكم إلى عبادتها، والظاهر: أن \" جَرَمَ \" من الجرم، وأراد به هنا الكذب، أي: لا كذب في أن ما تدعونني إليه ليس له دعوة\n\n\n الخ، فقد يضمن الفعل معنى المصدر، وتدخل \" لا \" النافية للجنس عليه، والمعنى: أن ما تدعونني إليه ليس له دعوة إلى نفسه قط، ومن حق المعبود بالحق أن يدعوَ العباد إلى طاعته، وما تدعونني إليه لا يدعو هو إلى عبادته، ولا يدّعي الربوبية، أو: معناه: ليس له استجابة دعوة في الدنيا والآخرة، أو: دعوة مستجابة\n جعلت الدعوة التي لا استجابة لها، ولا منفعة، كلا دعوة\n { وأنَّ مردَّنا إِلى الله } أي: رجوعنا إليه بالموت، { وأنَّ المسرفين } في الضلال والطغيان، كالإشراك وسفك الدماء، { هم أصحابُ النار } أي: ملازموها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:151",
      "similarity": 0.5020399780190078
    },
    {
      "verse": "44:31",
      "similarity": 0.4512307132246417
    },
    {
      "verse": "21:9",
      "similarity": 0.4159333662928891
    },
    {
      "verse": "20:127",
      "similarity": 0.3918734009060749
    },
    {
      "verse": "36:19",
      "similarity": 0.38776360735295723
    }
  ]
}