{
  "chapter": "غافر",
  "text": "ما يجدل فى ءايت الله الا الذين كفروا۟ فلا يغررك تقلبهم فى البلد",
  "translations": [
    {
      "translation": "No one disputes Allah's Signs except those who are kafir. Do not let their free movement about the earth deceive you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only the unbelievers dispute the revelations of God. So do not let their activities in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None but the unbelievers dispute regarding the Signs of Allah. So let not their strutting about in the land delude you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one disputes the revelations of the Lord except the disbelievers. Let not their activities in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None except the disbelievers dispute the signs of Allah, therefore do not let their free movements in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None disputes in the Ayat of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None dispute concerning the communications of Allah but those who disbelieve, therefore let not their going to and fro in the cities deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None but the unbelievers dispute concerning the signs of God; so let not their going to and fro in the land delude thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None argue concerning the revelations of Allah save those who disbelieve, so let not their turn of fortune in the land deceive thee (O Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who deny the truth dispute God's signs. Do not let their activity in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None dispute concerning the revelations of Allah save those who disbelieve, so let not beguile thee their going about in the cities.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one disputes the signs of Allah except the faithless. So do not be misled by their bustle in the towns.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None can dispute about the Signs of Allah but the Unbelievers. Let not, then, their strutting about through the land deceive thee!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None disputes in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you [O Muhammad SAW, their ultimate end will be the Fire of Hell]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None but the unbelievers dispute concerning the verses of Allah. So do not be deluded by their going to and fro in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None argues against God’s revelations except those who disbelieve. So do not be impressed by their activities in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one disputes concerning the signs of Allah except those who disbelieve, so be not deceived by their [uninhibited] movement throughout the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:4] None dispute the signs of God — the Qur’ān — except those who disbelieve, from among the people of Mecca, so do not be deceived by their bustle in the towns, [going about] seeking their livelihood in security, for the sequel for them will be the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا يُجَادِلُ فِي آَيَاتِ اللَّهِ إِلَّا الَّذِينَ كَفَرُوا فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِي الْبِلَادِ (4)استئناف بياني نشأ من قوله : { تَنْزِيلُ الكِتَاببِ مِن الله العَزيز العَليم } \\[ غافر : 2 \\] المقتضي أن كون القرآن منزلاً من عند الله أمرٌ لا ريب فيه كما تقدم ، فينشأ في نفوس السامعين أن يقولوا : فما بال هؤلاء المجادلين في صدق نسبة القرآن إلى الله لم تقنعهم دلائل نزول القرآن من الله ، فأجيب بأنه ما يجادل في صدق القرآن إلا الذين كفروا بالله وإذ قد كان كفر المكذبين بالقرآن أمراً معلوماً كان الإِخبار عنهم بأنهم كافرون غير مقصود منه إفادة اتصافهم بالكفر ، فتعين أن يكون الخبر غير مستعمل في فائدة الخبر لا بمنطوقه ولا بمفهومه ، فإن مفهوم الحصر وهو : أن الذين آمنوا لا يجادلون في آيات الله كذلك أمر معلوم مقرر ، فيجوز أن يجعل المراد بالذين كفروا نفس المجادلين في آيات الله وأن المراد بكفرهم كفرهم بوحدانية الله بسبب إشراكهم ، فالمعنى : لا عجب في جدالهم بآيات الله فإنهم أتوا بما هو أعظم وهو الإِشراك على طريقة قوله تعالى : { يسألك أهل الكتاب أن تنزل عليهم كتاباً من السماء فقد سألوا موسى أكبر من ذلك فقالوا أرنا اللَّه جهرة } \\[ النساء : 153 \\] .ويجوز أن يجعل المراد بالذين كفروا جميع الكافرين بالله من السابقين والحاضرين ، أي ما الجَدل في آيات الله إلا من شأن أهل الكفر والإِشراك ، ومجادلة مشركي مكة شعبة من شعب مجادلة كل الكافرين ، فيكون استدلالاً بالأعمّ على الخاص ، وعلى كلا الوجهين تُرك عطف هذه الجملة على التي قبلها .والمراد بالمجادلة هنا المجادلة بالباطل بقرينة السياق فمعنى { في آيات الله } في صدق آيات الله بقرينة قوله : { تَنزِيل الكِتَاب مِن الله العَزيز العليم } \\[ غافر : 2 \\] فتعين تقدير مضاف دل عليه المقام كما دَل قوله تعالى عن إبراهيم عليه السلام : { يجادلنا في قوم لوط } \\[ هود : 74 \\] ، على تقدير : في إهلاك قوم لوط ، فصيغة المفاعلة للمبالغة في الفعل من جانب واحد لإِفادة التكرر مثل : سافر وعافاه الله ، وهم يتلونون في الاختلاق ويعاودون التكذيب والقولَ الزور من نحو قولهم : { أساطير الأولين } \\[ الأنعام : 25 \\] ، { سحر مبين } \\[ المائدة : 110 \\] ، { قول كاهن } \\[ الحاقة : 42 \\] ، { قول شاعر } \\[ الحاقة : 41 \\] لا ينفكون عن ذلك . ومن المجادلة توركهم على الرسول صلى الله عليه وسلم بسؤاله أن يأتيهم بآيات كما يقترحون ، نحو قولهم : { لن نؤمن لك حتى تفجر لنا من الأرض ينبوعاً } \\[ الإسراء : 90 \\] الآيات وقولهم : { لولا أنزل إليه ملك فيكون معه نذيراً } \\[ الفرقان : 7 \\] الآيات .وقد كان لتعلق { في } الظرفية بالجدال ، ولدخوله على نفس الآيات دون أحوالها في قوله : { مَا يُجَادِلُ في آيات الله } موقعٌ عظيم من البلاغة لأن الظرفية تحْوِي جميعَ أصناف الجدال ، وجُعل مجرورُ الحرف نفسَ الآيات دون تعيين نحو صدقِها أو وقوعها أو صنفها ، فكان قوله : { في آيات الله } جامعاً للجدل بأنواعه ولمتعلِّق الجدل باختلاف أحواله والمراد الجدال بالباطل كما دل عليه تنظير حالهم بحال من قال فيهم{ وجادلوا بالباطل } \\[ غافر : 5 \\] فإذا أريد الجدال بالحق يقيد فعل الجدال بما يدل عليه .والمعنى : ما يجادل في آيات الله أنها من عند الله ، فإن القرآن تحدّاهم أن يأتوا بمثله فعجزوا ، وإنما هو تلفيق وتستر عن عجزهم عن ذلك واعتصام بالمكابرة فمجادلتهم بعدما تقدم من التحدّي دالة على تمكن الكفر منهم وأنهم معاندون وبذلك حصل المقصود من فائدة هذا وإلاّ فكونهم كفاراً معلوم .وإظهار اسم الجلالة في قوله : { ما يجادل في آيات الله } دون أن يقول : في آياته ، لتفظيع أمرها بالصريح لأن ذكر اسم الجلالة مؤذن بتفظيع جدالهم وكفرهم وللتصريح بزيادة التنويه بالقرآن .وفُرع قوله : { فَلا يَغرُرك تَقَلُّبهم في البِلادِ } على مضمون { ما يجادل في آيات الله إلا الذين كفروا } لما علمت من أن مقتضى تلك الجملة أن المجادلين في آيات الله هم أهل الكفر ، وذلك من شأنه أن يثير في نفس من يراهم في متعة ونعمة أن يتساءل في نفسه كيف يتركهم الله على ذلك ويظنَّ أنهم أمنوا من عذاب الله ، ففرع عليه الجواب { فلا يغررك تقلبهم في البلاد } أي إنما هو استدراج ومقدار من حلم الله ورحمته بهم وقتاً مَّا ، أو أن معناه نحن نُعلمُ أنهم يجادلون في آياتنا إصراراً على الكفر فلا يوهمْك تقلبهم في البلاد أنا لا نؤاخذهم بذلك .والغرور : ظن أحد شيئاً حسناً وهو بضده يقال : غَرّك ، إذا جعلك تظن السيّىء حسناً . ويكون التغرير بالقول أو بتحسين صورة القبيح .والتقلب : اختلاف الأحوال ، وهو كناية عن تناول محبوب ومرغوب . و { البلاد } الأرض ، وأريد بها هنا الدنيا كناية عن الحياة .والمخاطب بالنهي في قوله : { فلا يغررك } يجوز أن يكون غيرَ معين فيعم كل مَن شأنه أن يغره تقلب الذين كفروا في البلاد ، وعلى هذا يكون النهي جارياً على حقيقةِ بابه ، أي موجهاً إلى من يتوقع منه الغرور ، ومثله كثير في كلامهم ، قال كعب بن زهير: ... فلا يَغُرَّنْكَ مَا مَنَّتْ وما وعدتإِنَّ الأَمَانِيَّ والأَحلامَ تضليل ... ويجوز أن يكون الخطاب موجهاً للنبيء صلى الله عليه وسلم على أن تكون صيغة النهي تمثيلية بتمثيل حال النبي صلى الله عليه وسلم في استبطائه عقاب الكافرين بحال من غرّهُ تقلبهم في البلاد سالمين ، كقوله تعالى : { ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون } \\[ الحجر : 3 \\] .والمعنى : لا يوهمنك تناولهم مختلف النعماء واللذات في حياتهم أننا غير مؤاخذينهم على جدالِهم في آياتنا ، أو لا يوهمنك ذلك أننا لا نعلم ما هم عليه فلم نؤاخذهم به تنزيلاً للعالم منزلة الجاهل في شدة حزن الرسول صلى الله عليه وسلم على دوام كفرهم ومعاودةِ أذاهم كقوله : { ولا تحسبن اللَّه غافلاً عما يعمل الظالمون } \\[ إبراهيم : 42 \\] ، وفي معنى هذه قوله تعالى : { لا يغرنك تقلب الذين كفروا في البلاد متاع قليل ثم مأواهم جهنم وبئس المهاد } وتقدمت في \\[ آل عمران : 196 ، 197 \\] . .\n\n",
      "translations": [
        {
          "translation": "(None argue concerning the revelations of Allah) none disbelieves Muhammad (pbuh) and the Qur'an (save those who disbelieve) in Allah, i.e. the people of Mecca, (so let not their turn of fortune in the land deceive thee (0 Muhammad)) so let not, Muhammad, their comings and goings in travel for trade deceive you, for they account for nothing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ما يجادل في آيات الله إلا } المحجوبون عن الحق لأن غير المحجوب يقبلها بنور استعداده من غير إنكار لصفاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه توضيحاً وتصريحاً لما عُلم ضمناً: { مَا يُجَادِلُ } ويكابر { فِيۤ } شأن { آيَاتِ ٱللَّهِ } ودلائل توحيده واستقلاله في الآثار المترتبة على شئونه وتجلياته { إِلاَّ ٱلَّذِينَ كَفَرُواْ } وستروا ظهور شمس الذات\n وتحققها في صفحات الكائنات بغيوم هوياتهم الباطلة وتعيناتهم العاطلة { فَلاَ يَغْرُرْكَ تَقَلُّبُهُمْ فِي ٱلْبِلاَدِ } [غافر: 4] أي: لا يغررك يا أكمل الرسل إمهالنا إياهم\n يتقبلون في بلاد الإمكان وبقاع الهيولي عن إمهالنا وعدم انتقامنا منهم بالطرد إلى هاوية العدم وزاوية الخمول\n\n\nوإن كذبوك يا أكمل الرسل في دعوتك وشأنك وعاندوا معك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِلا الذين كفروا } \n وأما الذين آمنوا فلا يخطر ببالهم شائبة شُبهة منها\n فضلاً عن الطعن فيها\n وأما الجدال فيها لحل مشكلاتها\n وكشف حقائقها\n وتوضيح مناهج الحق منها\n وردّ مذاهب أهل الزيغ بها\n فمِن أعظم الجهاد في سبيل الله\n قال الطيبي: وأما اتصال قوله: { ما يُجادل في آيات الله\n\n\n } الآية بما قبله\n فهو أنه لَمَّا قال تعالى: { حم تنزيل الكتاب } من الإله المعبود\n الموصوف بصفات العلم الكامل\n والعز الغالب\n الجامع بين غفران الذنب وقبول التوبة\n المتفرّد بالعقاب\n الذي لا يقدّر كنهه\n وبالإفضال الذي لا يبلغ قدره\n قال: { ما يُجادل في آيات الله } أي: ما يجادل في مثل هذا الكتاب\n المشتمل على الآيات البينات\n المنزل من مثل ذلك الموصوف بنعوت الكمال\n إلا أمثال هؤلاء الكفرة المغرورين\n { فلا يَغْرُرْكَ نَقَلُبُهم في البلاد } فإنه استدراج\n فلا يَغْرُر مثلك في منصب الرسالة تقلُبُ أولئك تقلبَ الأنعام\n المنعَّمين في هذا الحطم\n وآيات الله: مُظْهَر أقيم المُضمر للتعظيم والتفخيم\n هـ\n والفاء لترتيب النهي عن الاغترار على ما قبله من التسجيل عليهم بالكفر\n الذي لا شيء أمقت منه عند الله\n ولا أجلب لخسران الدنيا والآخرة\n فإنَّ مَن تحقق ذلك لا يكاد يغتر بما لهم من الحظوظ الفانية\n والزخارف الدنيوية\n فإنهم مأخوذون عما قليل\n كما أُخذ من قبلهم\n ولذلك ذكرهم بقوله: { كذبت\n\n\n } الخ\n الإشارة: \" حم \" أي: بحلمي ومجدي تجليت في كلامي\n المنزل على حبي\n وهو تنزيل الكتاب من الله العزيز\n المُعزّ لأوليائه\n العليم بما كان وما يكون منهم\n فلا يمنعه عِلمُه عما سَلَفَ من قضائه\n غافرُ الذنب لمَن أَصَرَّ واجْتَرَم\n وقابلُ التوب لمَن تاب واحتشم\n شديد العقاب لمَن جَحَدَ وكفر\n ذي الطول لمَن توجه ووصل\n ويقال: غافر الذنب للغافلين\n وقابل التَّوب للمتوجهين\n شديد العقاب للمنكرين\n ذي الطول للعارفين الواصلين\n لا إله إلا هو\n فلا موجود معه\n إليه المصير بالسير في ميادين النفوس\n حتى يحصل الوصول إلى حضرة القدوس\n ما يُجادل في آيات الله\n وهم أولياء الله\n الدالون على الله\n إلا أهلُ الكفر بوجود الخصوصية\n قال القشيري: إذا ظهر البرهانُ\n واتَّضح البيانُ استسلمَت الألبابُ الصاحيةُ للاستجابة والإيمان\n وأمَّا أهلُ الكفر فلهم على الجحود إصرارٌ\n وشُؤْمُ شِرْكهم يحولُ بينهم وبين الإنصاف\n وكذلك مَن لا يحترم أولياء الله\n يُصرُّون على إنكارهم تخصيصَ الله عباده بالآيات\n ويعترضون عليهم بقلوبهم\n فيُجادلون في جَحْدِ الكرامات\n وسيفتضحون\n ولكنهم لا يُميزون بين رجحانهم ونقصانهم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:196",
      "similarity": 0.8251161669575416
    },
    {
      "verse": "95:3",
      "similarity": 0.5008573959125756
    },
    {
      "verse": "89:8",
      "similarity": 0.48968333114039125
    },
    {
      "verse": "89:11",
      "similarity": 0.46609233054925625
    },
    {
      "verse": "90:2",
      "similarity": 0.4528190517135481
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}