{
  "chapter": "غافر",
  "text": "فستذكرون ما اقول لكم وافوض امرى الى الله ان الله بصيرۢ بالعباد",
  "translations": [
    {
      "translation": "You will remember what I say in time to come; I submit my case to the judgement of God. Surely God keeps an eye on His creatures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon you shall remember what I say to you. I entrust my affairs to Allah. Surely Allah is watchful over His servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will soon recall what I have told you. I entrust God with my affairs. God is Well Aware of His servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And soon the time will come when you will remember what I now say to you; and I entrust my tasks to Allah; indeed Allah sees the bondmen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will remember what I am telling you, and my affair I leave it to Allah. Verily, Allah is the All-Seer of (His) servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you shall remember what I say to you, and I entrust my affair to Allah, Surely Allah sees the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will remember what I say to you. I commit my affair to God; surely God sees His servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye will remember what I say unto you. I confide my cause unto Allah. Lo! Allah is Seer of (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon you will remember what I say to you! I shall entrust my affair to God, for God is observant of all [His] servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And anon ye shall remember that which am telling you. Confide my affair Unto God; verily God is the Beholder of His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon you will remember what I tell you, and I entrust my affair to Allah. Indeed Allah watches His servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon will ye remember what I say to you (now), My (own) affair I commit to Allah: for Allah (ever) watches over His Servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will remember what I am telling you, and my affair I leave it to Allah. Verily, Allah is the All-Seer of (His) slaves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will remember what I say to you. To Allah I commit my affair, surely, Allah sees His worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will remember what I am telling you, so I commit my case to God. God is Observant of the servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will remember what I [now] say to you, and I entrust my affair to Allah. Indeed, Allah is Seeing of [His] servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:44] For you will [soon] remember what I have said to you, when you see the chastisement with your own eyes. And I entrust my affair to God. Truly God is Seer of [His] servants’ — he said this after they threatened him [with retribution] for opposing their religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ye will remember) you will know on the Day of Judgement (what I say unto you) in the life of the world regarding the torment. (I confide) I consign (my cause unto Allah) trusting in Him. (Lo! Allah is Seer of (His) slaves) He sees those who believe in Him and those who do not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَسَتَذْكُرُونَ } أيها الممكرون الممقوتون حين تعاينون وتدخلون النار { مَآ أَقُولُ لَكُـمْ } على وجه النصح من شأن العذاب الموعود لكم في النشأة الأخرى، وبعدما سمعوا من الوعيدات الهائلة، أضمروا في نفوسهم عداوته والإنكار عليه، وقصدوا مقته { وَ } لما تفرس منهم السوء، قال مسترجعاً إلى الله متوكلا نحوه: { أُفَوِّضُ أَمْرِيۤ } أي: حفظي وحصانتي عن شروركم { إِلَى ٱللَّهِ } المراقب على محافظة عباده المتوكلين عليه، المتوجهين نحو جنابه، يكفي بلطفه مؤنة شروركم عني وإساءتكم عليَّ { إِنَّ ٱللَّهَ } القادر العليم { بَصِيرٌ بِٱلْعِبَادِ } [غافر: 44] الخُلَّص، ما في ضمائرهم من الإخلاص والاختصاص\n\n\n\n\nقيل: فرَّ منهم إلى جبل، فأرسل فرعون جماعته لطلبه، فلحقوه وهو في الصلاة والوحوش حوله صافين حافين، يحرسون عما يضره، فلم يظفروا عليه، فرجعوا خائبين فقتلهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فستذكُرون ما أقولُ لكم } من النصائح عند نزول العذاب، { وأُفوِّضُ } أُسلّم { أمري إِلى الله } ، قال لَمّا توعّدوه\n { إِنَّ الله بصير بالعبادِ } فيَحْرُسُ مَن يلوذ به من المكاره\n { فوقاه اللهُ سيئاتِ ما مكروا } شدائد مكرهم، وما هَمُّوا به من إلحاق أنواع العذاب لِمَن خالفه، وقيل: إنه خرج من عندهم هارباً إلى جبل، فبعث قريباً من ألفٍ في طلبه، فمنهم مَن أكلته السباع، ومَنْ رجع منهم صَلَبه فرعونُ\n\n\nوقيل: لَمَّا وصلوا إليه ليأخذوه، وجدوه يُصلّي، والوحوش حوله، فرجعوا رُعباً، فقتلهم\n وقال مقاتل: لمّا قال المؤمن هذه الكلمات، قصدوا قتله، فوقاه الله من مكرهم، أي: بعد تفويض أمره إلى الله، فقيل: إنه نجا مع موسى في البحر\n هـ",
      "translations": []
    }
  ]
}