{
  "chapter": "غافر",
  "text": "واذ يتحاجون فى النار فيقول الضعفؤا۟ للذين استكبروا۟ انا كنا لكم تبعا فهل انتم مغنون عنا نصيبا من النار",
  "translations": [
    {
      "translation": "When they are squabbling with one another in the Fire, the weak will say to those deemed great, 'We were your followers, so why do you not relieve us of a portion of the Fire?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As they will noisily argue in the Fire, the weaker ones will say to the arrogant: \"We were your followers, so will you take over some of our share of the fire?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just imagine when they will remonstrate with one another in Hell. The weak ones will say to those who waxed proud: “We were your followers. Will you, then, lighten for us a part of our suffering of the Fire?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "During a dispute in the fire, the suppressed ones will say to those who had dominated them, \"We were your followers. Can you now relieve us of our suffering in the fire?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they will quarrel amongst themselves in the fire, those who were weak will say to those who sought greatness, “We were your followers, so will you reduce from us some of the punishment of the fire?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when they will dispute in the Fire, the weak will say to those who were arrogant: \"Verily, we followed you, can you then take from us some portion of the Fire\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they shall contend one with another in the fire, then the weak shall say to those who were proud: Surely we were your followers; will you then avert from us a portion of the fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they argue one with the other in the Fire, and the weak say unto those who waxed proud, 'Why, we were your followers; will you avail us now against any part of the Fire?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they wrangle in the Fire, the weak say unto those who were proud: Lo! we were a following unto you; will ye therefor rid us of a portion of the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they dispute with one another in the Fire, the weak will say to those who deemed themselves mighty, \"We were your followers; will you then relieve us of some of the Fire?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And consider what time they will wrangle together in the Fire, and the oppressed will say Unto those who were stiff-necked: verily we have been Unto you a following, are ye going to avail us against a portion of the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they argue in the Fire, the oppressed will say to the oppressors, ‘We used to follow you; will you avail us against any portion of the Fire?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, they will dispute with each other in the Fire! The weak ones (who followed) will say to those who had been arrogant, \"We but followed you: Can ye then take (on yourselves) from us some share of the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when they will dispute in the Fire, the weak will say to those who were arrogant; \"Verily! We followed you, can you then take from us some portion of the Fire?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they argue with one another in Hell, the weak will say to the proud: 'We were your followers, will you help us against any share of the Fire'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As they quarrel in the Fire, the weak will say to those who were arrogant, “We were followers of yours; will you then spare us a portion of the Fire?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when they will argue within the Fire, and the weak will say to those who had been arrogant, \"Indeed, we were [only] your followers, so will you relieve us of a share of the Fire?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:47] And, mention, when they will be arguing, [when] they, the disbelievers, will be disputing, [with one another] in the Fire, and the weak will say to those who were arrogant, ‘Indeed we were your followers (taba‘an is the plural of tābi‘); so will you [now] avail, [will you] defend, us against any portion of the Fire?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذْ يَتَحَاجُّونَ فِي النَّارِ فَيَقُولُ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا نَصِيبًا مِنَ النَّارِ (47) يجوز أن يكون { إذ } معمولاً ل ( اذْكُرْ ) محذوففٍ فيكون عطفاً على جملة { وأنذرهم يوم الأزِفَةِ } ، والضميرُ عائداً إلى { الذِّينَ يجادلون في ءاياتت الله بِغَيْرِ سلطان } \\[ غافر : 35 \\] وما بين هذا وذاك اعتراض واستطراد لأنها قصد منها عظة المشركين بمن سبقهم من الأمم المكذبين فلما استُوفي ذلك عاد الكلام إليهم . ويفيد ذلك صريحَ الوعيد للمشركين بعد أن ضُربت لهم الأمثال كما قال تعالى : { وللكافرين أمثالها } \\[ محمد : 10 \\] ، وقد تكرر في القرآن موعظة المشركين بمثل هذا كقوله تعالى : { إذ تبرأ الذين اتبعوا من الذين اتبعوا } الآية في سورة \\[ البقرة : 166 \\] ، وقوله : { قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذاباً ضعفاً من النار } الآية في سورة \\[ الأعراف : 38 \\] .( ويجوز أن تكون { وَإذْ يَتَحَآجُّونَ } عطفاً على جملة { ويوم تقوم الساعة ادخلوا ءالَ فرعونَ أشدَّ العذاب } \\[ غافر : 46 \\] لأن ( إذْ ) و ( يومَ ) كليهما ظرف بمعنى ( حين ) ، فيكون المعنى : وحين تقوم الساعة يقال : أدخلوا آل فرعون أشدّ العذاب ، وحين يتحاج أهل النار فيقول الضعفاء الخ .وقرن { فَيَقُولُ الضعفاؤا } بالفاء لإِفادة كون هذا القول ناشئاً عن تحاجّهم في النار مع كون ذلك دَالاً على أنه في معنى متعلَّق { إذ ، وهذا استعمال من استعمالات الفاء التي يسميها النحاة زائدة ، وأثبت زيادتها جماعة منهم الأخفش والفراء والأعلم وابن بَرهان ، وحكاه عن أصحابه البصريين . وضمير يتحاجون } على هذا الوجه عائد إلى آل فرعون . ويفيد مع ذلك تعريضاً بوعيد المشركين كما هو مقتضى المماثلة المسوقة وضمير { يتحاجون } غير عائد إلى { ءَالَ فِرعونَ } \\[ غافر : 46 \\] لأن ذلك يأباه قوله : { وقال الذين في النار لِخَزنة جهنم ادعوا ربكم } \\[ غافر : 49 \\] وقوله : { أَوَلَمْ تَكُ تَأتيكم رُسُلكم بالبينات } \\[ غافر : 50 \\] ولم يَأت آل فرعون إلا رسول واحد هو موسى عليه السلام فيعود ضمير { يتحاجون } إلى معلوم من المقام وهم أهل النار .والتحاجّ : الاحتجاج من جانبين فأكثرَ ، أي إقامة كل فريق حجته وهو يقتضي وقوع خلاف بين المتحاجّين إذ الحجة تأييد لدعوى لدفع الشك في صحتها .والضعفاء : عامة الناس الذين لا تصرُّف لهم في أمور الأمة . والذين استكبروا : سادة القوم ، أي الذين تكبروا كِبْراً شديداً ، فالسين والتاء فيه للمبالغة . وقول الضعفاء للكبراء هذا الكلامَ يحتمل أنه على حقيقته فهو ناشىء عما اعتادوه من اللجإ إليهم في مهمهم حين كانوا في الدنيا فخالوا أنهم يتولون تدبير أمورهم في ذلك المكان ولهذا أجاب الذين استكبروا بما يفيد أنهم اليوم سواء في العجز وعدم الحيلة فقالوا : { إنَّا كُلٌّ فِيهَآ } أي لو أغنينا عنكم لأغنينا عن أنفسنا .وتقديم قولهم : { إنَّا كُنَّا لَكُم تبعَاً } على طلب التخفيف عنهم من النار ، مقدمة للطلب لقصد توجيهه وتعليله وتذكيرهم بالولاء الذي بينهم في الدنيا ، يلهمهم الله هذا القول لافتضاح عجز المستكبرين أن ينفعوا أتباعهم تحقيراً لهم جزاء على تعاظمهم الذي كانوا يتعاظمون به في الدنيا .ويحتمل أن قول الضعفاء ليس مستعملاً في حقيقة الحث على التخفيف عنهم ولكنه مستعمل في التوبيخ ، أي كنتم تدعوننا إلى دين الشرك فكانت عاقبة ذلك أنا صرنا في هذا العذاب فهل تستطيعون الدفع عنا . وتأكيد { إنَّا كنا لكُم تَبَعاً } ب ( إنَّ ) للاهتمام بالخبر وليس لرد إنكار .والتبع : اسم لمن يتبع غيره ، يستوي فيه الواحد والجمع ، وهو مثل خَدَم وَحَشَم لأن أصله مصدر ، فلذلك استوى فيه الواحد والجمع ، وقيل التَبَع : جمع لا يجري على الواحد ، فهو إذن من الجموع النادرة .والاستفهام في قوله : { فَهَلْ أنتُم مُغْنُونَ } مستعمل في الحث واللوم على خذلانهم وترك الاهتمام بما هم فيه من عذاب .وجيء بالجملة الاسمية الدالة على الثبات ، أي هل من شأنكم أنكم مغنون عنّا . و { مغنون } اسم فاعل من أغنى غناء بفتح الغين والمدّ ، أي فائدة وإجزاء .والنصيب : الحَظ والحصة من الشيء ، قال تعالى : { للرجال نصيب مما ترك الوالدان والأقربون } إلى قوله : { نصيباً مفروضاً } \\[ النساء : 7 \\] .\n\n",
      "translations": [
        {
          "translation": "(And when they) the leaders and the followers (wrangle in the Fire, the weak) the followers (say unto those who were proud) too proud to accept faith, i.e. the leaders: (Lo! we were a following unto you) we followed your religion in the life of the world: (will ye therefore rid us of a portion of the Fire) will therefore bear for us some of the punishment of the Fire?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَ } اذكر يا أكمل الرسل للمعتبرين من المكلفين وقت { إِذْ يَتَحَآجُّونَ } ويتخاصمون\n أي: أصحاب النار { فِي ٱلنَّـارِ فَيَقُولُ ٱلضُّعَفَاءُ } منهم\n أي: الأتباع والأراذل { لِلَّذِينَ ٱسْتَكْـبَرُوۤاْ } أي: لدى رؤسائهم ومتبوعيهم المستكبرين عليهم\n المستتبعين لهم في النشأة الأولى: { إِنَّا كُنَّا لَكُمْ تَبَعاً } في دار الدنيا\n بل أنتم أضللتمونا عن متابعة الرسل والهادين { فَهَلْ أَنتُم } اليوم { مُّغْنُونَ } دافعون مانعون { عَنَّا نَصِيباً } جزءاً أو شيئاً\n قد صار حظنا { مِّنَ ٱلنَّارِ } [غافر: 47] النازلة علينا بسبب اتباعنا إياكم\n واقتفائنا أثركم\n وتديننا بدينكم وخصلتكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِذ يتحاجُّونَ في النار } أي: واذكر لقومك وقت تخاصم الكفار في النار\n { فيقول الضعفاءُ } منهم { للذين استكبروا } وهم رؤساؤهم: { إِنا كنا لكم تَبَعاً } \n وهو جمع تابع\n كخادم وخدَم\n أو: ذوي تَبَع\n على أنه مصدر\n أو: وصف به للمبالغة\n { فهل أنتم مُغنونَ عنا نصيباً من النار } أي: فهل أنتم دافعون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:97",
      "similarity": 0.41319945413931275
    },
    {
      "verse": "3:66",
      "similarity": 0.38499006523144363
    },
    {
      "verse": "88:3",
      "similarity": 0.36739854166647834
    },
    {
      "verse": "6:149",
      "similarity": 0.3596190993830671
    },
    {
      "verse": "3:20",
      "similarity": 0.3514085955431521
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040047.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040047.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}