{
  "chapter": "غافر",
  "text": "قال الذين استكبروا۟ انا كل فيها ان الله قد حكم بين العباد",
  "translations": [
    {
      "translation": "The arrogant will answer: \"All of us are in it. Surely God has judged between His creatures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had waxed proud will reply: “All of us are in it. Allah has already passed His judgement among His servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones who had dominated them will say, \"All of us are now in hell. God has already issued His Judgment of His servants (and no one can change this).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were proud will say, “We are all in the fire – indeed Allah has already passed the judgement among the bondmen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were arrogant will say: \"We are all (together) in this (Fire)! Verily, Allah has judged between (His) servants!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were proud shall say: Surely we are all in it: surely Allah has judged between the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then those who waxed proud shall say, 'Every one of us is in it; indeed, God already has passed judgment between His servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were proud say: Lo! we are all (together) herein. Lo! Allah hath judged between (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who had been arrogant will say, \"We are all in this together. God has judged between His servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were stiff-necked will say: verily we are all in it; verily Allah hath judged between His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The oppressors will say, ‘We are all in it [together]; Allah has judged between [His] servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had been arrogant will say: \"We are all in this (Fire)! Truly, Allah has judged between (his) Servants!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were arrogant will say: \"We are all (together) in this (Fire)! Verily Allah has judged between (His) slaves!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were proud will reply: 'All of us are in it (Hell). Allah has judged between His worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were arrogant will say, “We are all in it; God has judged between the servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had been arrogant will say, \"Indeed, all [of us] are in it. Indeed, Allah has judged between the servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:48] Those who were arrogant will say, ‘Indeed we are all [together] in it. God has indeed judged [fairly] between His servants’, admitting believers into Paradise and disbelievers into the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who were proud) to accept faith, i.e. the leaders (say) to their followers: (Lo! we are all (together)) the worshipped and the worshippers, the leaders and the followers (herein) in the Fire. (Lo! Allah hath judged between (His) slaves) He has judged between the worshipper and the worshipped and between the leaders and followers and decreed that they will abide in the Fire; it is also said that this means: Allah has judged between the believers and disbelievers: the believers will enter the Garden while the disbelievers will go to the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ ٱلَّذِينَ ٱسْتَكْبَرُوۤاْ } أي: الرؤساء المتبوعين { إِنَّا } نحن وأنتم { كُلٌّ } منَّا معذبون { فِيهَآ } أي: في النار، لا يسع أحد منَّا ومنكم، ليدفع شيئاً منها { إِنَّ ٱللَّهَ } المنتقم الغيور { قَدْ حَكَمَ بَيْنَ } عموم { ٱلْعِبَادِ } [غافر: 48] بأن أدخل بعضاً منهم في الجنة بفضله، وبعضاً في النار بعدله، ولا معقب لحكمه، وهو شديد المحال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}