{
  "chapter": "غافر",
  "text": "ما يجدل فى ءايت الله الا الذين كفروا۟ فلا يغررك تقلبهم فى البلد",
  "translations": [
    {
      "translation": "Only the unbelievers dispute the revelations of God. So do not let their activities in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None but the unbelievers dispute regarding the Signs of Allah. So let not their strutting about in the land delude you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one disputes the revelations of the Lord except the disbelievers. Let not their activities in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None except the disbelievers dispute the signs of Allah, therefore do not let their free movements in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None disputes in the Ayat of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None dispute concerning the communications of Allah but those who disbelieve, therefore let not their going to and fro in the cities deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None but the unbelievers dispute concerning the signs of God; so let not their going to and fro in the land delude thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None argue concerning the revelations of Allah save those who disbelieve, so let not their turn of fortune in the land deceive thee (O Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who deny the truth dispute God's signs. Do not let their activity in the land deceive you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None dispute concerning the revelations of Allah save those who disbelieve, so let not beguile thee their going about in the cities.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one disputes the signs of Allah except the faithless. So do not be misled by their bustle in the towns.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None can dispute about the Signs of Allah but the Unbelievers. Let not, then, their strutting about through the land deceive thee!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None disputes in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you [O Muhammad SAW, their ultimate end will be the Fire of Hell]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None but the unbelievers dispute concerning the verses of Allah. So do not be deluded by their going to and fro in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None argues against God’s revelations except those who disbelieve. So do not be impressed by their activities in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one disputes concerning the signs of Allah except those who disbelieve, so be not deceived by their [uninhibited] movement throughout the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:4] None dispute the signs of God — the Qur’ān — except those who disbelieve, from among the people of Mecca, so do not be deceived by their bustle in the towns, [going about] seeking their livelihood in security, for the sequel for them will be the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(None argue concerning the revelations of Allah) none disbelieves Muhammad (pbuh) and the Qur'an (save those who disbelieve) in Allah, i.e. the people of Mecca, (so let not their turn of fortune in the land deceive thee (0 Muhammad)) so let not, Muhammad, their comings and goings in travel for trade deceive you, for they account for nothing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه توضيحاً وتصريحاً لما عُلم ضمناً: { مَا يُجَادِلُ } ويكابر { فِيۤ } شأن { آيَاتِ ٱللَّهِ } ودلائل توحيده واستقلاله في الآثار المترتبة على شئونه وتجلياته { إِلاَّ ٱلَّذِينَ كَفَرُواْ } وستروا ظهور شمس الذات، وتحققها في صفحات الكائنات بغيوم هوياتهم الباطلة وتعيناتهم العاطلة { فَلاَ يَغْرُرْكَ تَقَلُّبُهُمْ فِي ٱلْبِلاَدِ } [غافر: 4] أي: لا يغررك يا أكمل الرسل إمهالنا إياهم، يتقبلون في بلاد الإمكان وبقاع الهيولي عن إمهالنا وعدم انتقامنا منهم بالطرد إلى هاوية العدم وزاوية الخمول\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما يُجادل في آيات الله } أي: ما يُخاصم فيها بالطعن فيها، واستعمال المقدمات الباطلة لإدحاض الحق المشتملة عليه، { إِلا الذين كفروا } ، وأما الذين آمنوا فلا يخطر ببالهم شائبة شُبهة منها، فضلاً عن الطعن فيها، وأما الجدال فيها لحل مشكلاتها، وكشف حقائقها، وتوضيح مناهج الحق منها، وردّ مذاهب أهل الزيغ بها، فمِن أعظم الجهاد في سبيل الله\n قال الطيبي: وأما اتصال قوله: { ما يُجادل في آيات الله\n\n\n } الآية بما قبله، فهو أنه لَمَّا قال تعالى: { حم تنزيل الكتاب } من الإله المعبود، الموصوف بصفات العلم الكامل، والعز الغالب، الجامع بين غفران الذنب وقبول التوبة، المتفرّد بالعقاب، الذي لا يقدّر كنهه، وبالإفضال الذي لا يبلغ قدره، قال: { ما يُجادل في آيات الله } أي: ما يجادل في مثل هذا الكتاب، المشتمل على الآيات البينات، المنزل من مثل ذلك الموصوف بنعوت الكمال، إلا أمثال هؤلاء الكفرة المغرورين، { فلا يَغْرُرْكَ نَقَلُبُهم في البلاد } فإنه استدراج، فلا يَغْرُر مثلك في منصب الرسالة تقلُبُ أولئك تقلبَ الأنعام، المنعَّمين في هذا الحطم\n وآيات الله: مُظْهَر أقيم المُضمر للتعظيم والتفخيم\n هـ\n والفاء لترتيب النهي عن الاغترار على ما قبله من التسجيل عليهم بالكفر، الذي لا شيء أمقت منه عند الله، ولا أجلب لخسران الدنيا والآخرة، فإنَّ مَن تحقق ذلك لا يكاد يغتر بما لهم من الحظوظ الفانية، والزخارف الدنيوية، فإنهم مأخوذون عما قليل، كما أُخذ من قبلهم\n ولذلك ذكرهم بقوله: { كذبت\n\n\n } الخ\n الإشارة: \" حم \" أي: بحلمي ومجدي تجليت في كلامي، المنزل على حبي، وهو تنزيل الكتاب من الله العزيز، المُعزّ لأوليائه، العليم بما كان وما يكون منهم، فلا يمنعه عِلمُه عما سَلَفَ من قضائه\n غافرُ الذنب لمَن أَصَرَّ واجْتَرَم، وقابلُ التوب لمَن تاب واحتشم، شديد العقاب لمَن جَحَدَ وكفر، ذي الطول لمَن توجه ووصل، ويقال: غافر الذنب للغافلين، وقابل التَّوب للمتوجهين، شديد العقاب للمنكرين، ذي الطول للعارفين الواصلين\n لا إله إلا هو، فلا موجود معه، إليه المصير بالسير في ميادين النفوس، حتى يحصل الوصول إلى حضرة القدوس\n ما يُجادل في آيات الله، وهم أولياء الله، الدالون على الله، إلا أهلُ الكفر بوجود الخصوصية\n قال القشيري: إذا ظهر البرهانُ، واتَّضح البيانُ استسلمَت الألبابُ الصاحيةُ للاستجابة والإيمان\n وأمَّا أهلُ الكفر فلهم على الجحود إصرارٌ، وشُؤْمُ شِرْكهم يحولُ بينهم وبين الإنصاف، وكذلك مَن لا يحترم أولياء الله، يُصرُّون على إنكارهم تخصيصَ الله عباده بالآيات، ويعترضون عليهم بقلوبهم، فيُجادلون في جَحْدِ الكرامات، وسيفتضحون، ولكنهم لا يُميزون بين رجحانهم ونقصانهم\n هـ\n\n",
      "translations": []
    }
  ]
}