{
  "chapter": "غافر",
  "text": "تدعوننى لاكفر بالله واشرك به ما ليس لى به علم وانا۠ ادعوكم الى العزيز الغفر",
  "translations": [
    {
      "translation": "You call me to reject Allah and to associate something with Him about which I have no knowledge, while I call you to the Almighty, the Endlessly Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are asking me to disbelieve in God, and to associate with Him that of which I have no knowledge, yet I invite you to the all-mighty, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you call me to deny Allah and to associate with Him as His partners those regarding whom I have no knowledge (that they are Allah's partners in His Divinity), whereas I call you to the Most Mighty, the Most Forgiving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You call me to disbelieve in God and to believe other things equal to Him about which I have no knowledge. I call you to the Majestic and All-forgiving One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You call me to disbelieve in Allah and ascribe such as partners to Him, regarding whom I do not have any knowledge – whereas I call you towards the Most Honourable, the Oft Forgiving!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You invite me to disbelieve in Allah, and to join partners in worship with Him of which I have no knowledge; and I invite you to the Almighty, the Oft-Forgiving!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You call on me that I should disbelieve in Allah and associate with Him that of which I have no knowledge, and I call you to the Mighty, the most Forgiving;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You call me to disbelieve in God, and to associate with Him that whereof I have no knowledge, while I call you to the All-mighty, the All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye call me to disbelieve in Allah and ascribe unto Him as partners that whereof I have no knowledge, while I call you unto the Mighty, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You call upon me to deny God and to serve other deities about which I have no knowledge, while I call you to the Almighty, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye call me for this, that should O blaspheme against God and associate with Him that whereof have no knowledge, call you onto the Mighty, the\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You invite me to defy Allah and to ascribe to Him partners of which I have no knowledge, while I call you to the All-mighty, the All-forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye do call upon me to blaspheme against Allah, and to join with Him partners of whom I have no knowledge; and I call you to the Exalted in Power, Who forgives again and again!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You invite me to disbelieve in Allah (and in His Oneness), and to join partners in worship with Him; of which I have no knowledge, and I invite you to the All-Mighty, the Oft-Forgiving!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You call me to disbelieve in Allah and to associate with Him that of which I know nothing; while I call you to the Almighty, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You call me to reject God, and to associate with Him what I have no knowledge of, while I call you to the Mighty Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You invite me to disbelieve in Allah and associate with Him that of which I have no knowledge, and I invite you to the Exalted in Might, the Perpetual Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:42] You call me to disbelieve in God and to associate with Him that whereof I have no knowledge, whereas I call you to the Mighty, Whose way [always] prevails, the Forgiver, to those who repent.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ye call me to disbelieve in Allah and ascribe unto Him as partners that whereof I have no knowledge) they are His partners because I know for certain that He has no partner, (while I call you unto the Mighty) while I call you unto the divine Oneness of the Mighty in retribution against those who disbelieve in Him, (the Forgiver) of those who believe in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { تَدْعُونَنِي لأَكْـفُرَ بِٱللَّهِ } الواحد الأحد الصمد، المتفرد بالألوهية والربوبية، وأنكر وجوده { وَأُشْرِكَ بِهِ مَا لَيْسَ لِي بِهِ عِلْمٌ } أي: أشرك به شيئاً لم يتعلق علمي بألوهيته وشركته مع الله لا يقيناً ولا ظناً ووهماً؛ إذ هو جماد ماله شعور { وَأَنَاْ أَدْعُوكُمْ } بمقتضى الوحي الإلهي المنزل على رسول الله المؤيد بالعقل الفطري المفاض لخواص عباده من لدنه سبحانه { إِلَى ٱلْعَزِيزِ } القادر الغالب في أمره بلا فتور وقصور { ٱلْغَفَّارِ } [غافر: 42] الستَّار لنفوس السوى والأغيار مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ومدار التعجُّب الذي يلوح به الاستفهام هو دعوتهم إياه إلى النار، لا دعوته إياهم إلى النجاة، كأنه قيل: أخبروني كيف هذا الحال أدعوكم إلى الخير وتدعونني إلى الشر؟ { تدعونني لأكفرَ بالله } هو بدل من تدعونني الأول، وفيه تعليل، والدعاء يتعدّى باللام وبإلى، كالهداية، { وأُشركَ به } وتدعونني لأُشرك به { ما ليسَ لي به عِلٍْمٌ } أي: بربوبيته، والمراد بنفي العلم: نفي المعلوم، كأنه قال: وأُشرك به شيئاً ليس بإله، وما ليس بإله كيف يصحّ أن يعلم إلهاً؟ { وأنا أدعوكم إِلى العزيز الغفار } أي: إلى الله الجامع لصفات الألوهية، من كمال القدرة والغلبة، وما يتوقف عليه من العلم والإرادة إذ بالقدرة يتمكن من المجازاة بالتعذيب، أو الإحسان بالغفران",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:42",
      "similarity": 0.4367275105010556
    },
    {
      "verse": "38:66",
      "similarity": 0.4254172379145245
    },
    {
      "verse": "95:8",
      "similarity": 0.3979357071437548
    },
    {
      "verse": "5:118",
      "similarity": 0.3935018764207011
    },
    {
      "verse": "14:20",
      "similarity": 0.3708791986181593
    }
  ]
}