{
  "chapter": "غافر",
  "text": "من عمل سيئة فلا يجزى الا مثلها ومن عمل صلحا من ذكر او انثى وهو مؤمن فاو۟لئك يدخلون الجنة يرزقون فيها بغير حساب",
  "translations": [
    {
      "translation": "Whoever does an evil act will only be repaid with its equivalent. But whoever acts rightly, male or female, being a mumin, such a person will enter the Garden, provided for in it without any reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does evil will be requited in accordance with it; but whoever does right, whether man or woman, and is a believer, will enter Paradise, where they will have provision in abundance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever does an evil deed will be requited only with the like of it; and whosoever acts righteously and has attained to faith -- be he a male or a female -- they shall enter Paradise and be provided sustenance beyond all reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever commits evil deeds will be recompensed to the same degree. The righteously striving believer, male or female, will enter Paradise wherein they will receive their sustenance without any account being kept.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Whoever commits an evil deed will not be repaid except to the same extent; and whoever does good deeds, whether a man or a woman, and is a Muslim, will be admitted into Paradise, in which they will receive sustenance without account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does an evil deed, will not be requited except the like thereof; and whosoever does a righteous deed, whether male or female and is a true believer, such will enter Paradise, where they will be provided therein without limit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does an evil, he shall not be recompensed (with aught) but the like of it, and whoever does good, whether male or female, and he is a believer, these shall enter the garden, in which they shall be given sustenance without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever does an evil deed shall be recompensed only with the like of it, but whosoever does a righteous deed, be it male or female, believing -- those shall enter Paradise, therein provided without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso doeth an ill-deed, he will be repaid the like thereof, while whoso doeth right, whether male or female, and is a believer, (all) such will enter the Garden, where they will be nourished without stint.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does evil will be requited with evil; but whoever does good, whether male or female, and is a believer, will enter the Garden; where they will be provided for without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever worketh an evil, he shallnotberequited except the like thereof; and whosoever, male or female, worketh righteously, and is a believer-they will enter the Garden wherein they will be pro vided for without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever commits a misdeed shall not be requited except with its like, but whoever acts righteously, whether male or female, should he be faithful—such shall enter paradise, and they will be provided therein without any reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He that works evil will not be requited but by the like thereof: and he that works a righteous deed - whether man or woman - and is a Believer- such will enter the Garden (of Bliss): Therein will they have abundance without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever does an evil deed, will not be requited except the like thereof, and whosoever does a righteous deed, whether male or female and is a true believer (in the Oneness of Allah), such will enter Paradise, where they will be provided therein (with all things in abundance) without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do an evil deed shall only be rewarded with its like, but those who believe and do good works, either men and women, shall enter the Gardens of Paradise and are provided for without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever commits a sin will be repaid only with its like. But whoever works righteousness, whether male or female, and is a believer—these will enter Paradise, where they will be provided for without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does an evil deed will not be recompensed except by the like thereof; but whoever does righteousness, whether male or female, while he is a believer - those will enter Paradise, being given provision therein without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:40] Whoever commits an evil deed shall not be requited except with the like of it; but whoever acts righteously, whether male or female, and is a believer — such shall be admitted into Paradise (read [passive] yudkhalūna, or the opposite [active yadkhulūna, ‘they shall enter’) wherein they will be provided without any reckoning, an abundant provision, [given to them] unconditionally.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso doeth an ill deed) while being an idolater, (he will be repaid the like thereof) in the Fire, (while whoso doeth right) sincerely, (whether male or female) whether they are men or women, (and is a believer) sincere in his faith, ((all) such will enter the Garden, where they will be nourished without stint) without measure or limit.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواعلموا أيها المجبولون على فطرة التكليف أن { مَنْ عَمِـلَ } في النشأة الأولى { سَـيِّئَةً } جالبة لغضب الله\n مستتبعة لعذابه { فَلاَ يُجْزَىٰ } في النشأة الأخرى { إِلاَّ مِثْلَهَا } بمقتضى العدل الإلهي { وَمَنْ عَمِـلَ صَالِحاً } مستجلباً لنعم الله وموائد كرمه\n سواء كان { مِّن ذَكَـرٍ أَوْ أُنْثَىٰ وَ } الحال أنه { هُوَ مُؤْمِنٌ } موقن بتوحيد الله\n مصدق برسله وكتبه { فَأُوْلَـٰئِكَ } السعداء المقبولون عند الله { يَدْخُلُونَ ٱلْجَنَّةَ } في النشأة الأخرى { يُرْزَقُونَ فِيهَا } رزقاً صورياً ومعنوياً رغداً واسعاً { بِغَيْرِ حِسَابٍ } [غافر: 40] بلا تقدير وموازنة مثل أرزاق الدنيا\n\n\n{ وَ } قال القائل المذكور أيضاً على سبيل الملاينة والمجاراة في صورة المناصحة والمقابلة\n إيقاضاً لهم عن سنة الغفلة\n وتتميماً للغرض المسوق له الكلام: { يٰقَوْمِ مَا لِيۤ } أي: أي شيء عرض علي ولحق لي { أَدْعُوكُـمْ } أنا من كمال عطفي ومرحمتي إياكم { إِلَى ٱلنَّجَاةِ } من عذاب الله وحلول غضبه\n وإلى دخول الجنة المشتملة على أنواع اللذات الجسمانية والروحانية المعدة لأهل التوحيد والإيمان { وَ } أنتم { تَدْعُونَنِيۤ إِلَى ٱلنَّارِ } [غافر: 41] المعدة لأصحاب الخيبة والخذلان\n\n\nإذ { تَدْعُونَنِي لأَكْـفُرَ بِٱللَّهِ } الواحد الأحد الصمد\n المتفرد بالألوهية والربوبية\n وأنكر وجوده { وَأُشْرِكَ بِهِ مَا لَيْسَ لِي بِهِ عِلْمٌ } أي: أشرك به شيئاً لم يتعلق علمي بألوهيته وشركته مع الله لا يقيناً ولا ظناً ووهماً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { مَن عَمِلَ سيئةً } في الدنيا { فلا يُجزَى } في الآخرة { إِلا مثلَها } عدلاً من الله تعالى\n قال القشيري: له مثلها في المقدار\n لا في الصفة لأن الأولى سيئة\n والمكافأة حسنة ليست بسيئة\n هـ\n وقال ابن عرفة: في توفيه مماثلة العذاب الأبدي على كفر ساعة تتصور المماثلة\n إما باعتبار نيته الكفر دواماً\n وإما بأن يقال: ليس المراد المماثلة عقلاً\n بل المماثلة شرعاً\n وفي الإحياء: قال الحسن: إنما خُلِّد أهل الجنة في الجنة\n وأهل النار\n في النار\n بالنية\n وهو ـ والله أعلم ـ مقتبس من قوله تعالى:\n[إبراهيم: 44]\n هـ\n قاله المحشي\n { ومَن عَمِلَ صالحاً من ذكرٍ أو أنثى وهو مؤمن فأولئك } الذين عملوا ذلك { يدخلون الجنةَ يُرزقون فيها بغير حسابٍ } أي: بغير تقدير\n وموازنة بالعمل\n بل بأضعافٍ مضاعفة\n فضلاً من الله ـ عزّ وجل ـ ورحمة\n قال القشيري: أي: مؤبداً مخلَّداً\n لا يخرجون من الجنة\n ولا مما هم عليه من الحال\n هـ\n وجعل العمل عمدة\n والإيمان حالاً للإيذان بأنه لا عبرة بالعمل بدونه\n وأنَّ ثوابه أعلى من ذلك\n الإشارة: قال الورتجبي: سبيل الرشاد: طريق المعرفة\n ومعرفة الله تعالى: موافقته ومتابعة أنبيائه وأوليائه\n ولا تحصل الموافقة إلا بترك مراد النفس\n ولذلك قال: { يا قوم إنما هذه الحياة الدينا متاع }\n قال محمد بن علي الترمذي: لم تزل الدنيا مذمومة في الأمم السابقة\n عند العقلاء منهم\n وطالبوها مهانين عند الحكماء الماضية\n وما قام داع في أمة إلا حذَّر متابعةَ الدنيا وجمعها والحب لها\n ألا ترى مؤمن آل فرعون كيف قال: { اتبعون أهدكم سبيلَ الرشاد } \n كأنهم قالوا: وما سبيل الرشاد؟ قال: { إِنما هذه الحياة الدنيا متاع } أي: لن تصل إلى سبيل الرشاد وفي قلبك محبة الدنيا وطلب لها\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:97",
      "similarity": 0.5574715869491718
    },
    {
      "verse": "53:21",
      "similarity": 0.4992455702128315
    },
    {
      "verse": "92:3",
      "similarity": 0.4915400280793775
    },
    {
      "verse": "75:39",
      "similarity": 0.4669087050803587
    },
    {
      "verse": "53:27",
      "similarity": 0.45679724604828
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/40:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/40:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/40:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}