{
  "chapter": "غافر",
  "text": "كذبت قبلهم قوم نوح والاحزاب منۢ بعدهم وهمت كل امةۭ برسولهم لياخذوه وجدلوا۟ بالبطل ليدحضوا۟ به الحق فاخذتهم فكيف كان عقاب",
  "translations": [
    {
      "translation": "The people of Nuh denied the truth before them, and the Confederates after them. Every nation planned to seize its Messenger and used false arguments to rebut the truth. So I seized them, and how was My retribution!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah had denied before them, and many factions after them. Every nation has intrigued against its apostle and afflicted him, and argued with false arguments to condemn the truth. Then I seized them. How was then My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the people of Noah also gave the lie (to Messengers), and so did many parties after them. Each nation sallied forth against its Messenger to seize him, and they disputed with false arguments seeking therewith to repudiate the Truth. Then I seized them; and behold, how woeful was My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah who lived before and the Confederate tribes who lived after them rejected Our revelations. Every nation schemed against its Messengers to seize them and disputed against them to defeat the truth. But torment struck them and how terrible was their retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them, the people of Nooh and the groups after them had denied; and every nation intended to apprehend its Noble Messenger, and they fought along with falsehood to avert the truth, so I seized them; so how did My punishment turn out?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh and the groups after them denied before these; and every nation plotted against their Messenger to seize him, and disputed by means of falsehood to refute therewith the truth. So I seized them, and how was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh and the parties after them rejected (prophets) before them, and every nation purposed against their apostle to destroy him, and they disputed by means of the falsehood that they might thereby render null the truth, therefore I destroyed them; how was then My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah before them also cried lies, and the parties after them; every nation purposed against their Messenger to seize him, and disputed with falsehood that they might rebut thereby the truth. Then I seized them; and how was My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The folk of Noah and the factions after them denied (their messengers) before these, and every nation purposed to seize their messenger and argued falsely, (thinking) thereby to refute the Truth. Then I seized them, and how (awful) was My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah and later factions also rejected the truth and every community plotted against the messenger sent to them, aiming to lay hands on him, and they contended [against his message] with fallacious arguments, so that they might defeat the truth, therefore I seized them. How terrible was My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh and the confederates after them belied their apostles before these, and each disbelieving community advanced toward their apostle that they may lay hold of him and disputed with vain speech that they may confute the truth thereby. Wherefore I laid hold of them; and how terrible was My chastisement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah denied before them and the [heathen] factions [who came] after them. Every nation attempted to lay hands on their apostle, and disputed erroneously to refute the truth. Then I seized them; so how was My retribution?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (there were people) before them, who denied (the Signs),- the People of Noah, and the Confederates (of Evil) after them; and every People plotted against their prophet, to seize him, and disputed by means of vanities, therewith to condemn the Truth; but it was I that seized them! and how (terrible) was My Requital!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh (Noah) and the confederates after them denied (their Messengers) before these, and every (disbelieving) nation plotted against their Messenger to seize him, and disputed by means of falsehood to refute therewith the truth. So I seized them (with punishment), and how (terrible) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The nation of Noah before them belied, and so did the parties after them. Every nation strove against their Messenger to seize him, disputing with false arguments to refute the truth. Then I seized them, how was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the people of Noah rejected the truth, as did the confederates after them. Every community plotted against their messenger, to capture him. And they argued with falsehood, to defeat with it the truth. But I seized them. What a punishment it was!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah denied before them and the [disbelieving] factions after them, and every nation intended [a plot] for their messenger to seize him, and they disputed by [using] falsehood to [attempt to] invalidate thereby the truth. So I seized them, and how [terrible] was My penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:5]   The people of Noah denied before them and [also] the factions, such as ‘Ād, Thamūd and others, [who came] after them. And every community sought to seize their messenger, to slay him, and they argued falsely [thinking] to rebut, to eliminate, thereby the truth. Then I seized them, with punishment; so how [fitting] was My punishment!, of them — in other words, it was appropriate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَالْأَحْزَابُ مِنْ بَعْدِهِمْ وَهَمَّتْ كُلُّ أُمَّةٍ بِرَسُولِهِمْ لِيَأْخُذُوهُ وَجَادَلُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ فَأَخَذْتُهُمْ فَكَيْفَ كَانَ عِقَابِ (5)جملة { كَذَّبَتْ قَبْلَهم قَوْم نُوحٍ } وما بعدها بيان لجملة { فلا يغرُرك تقلُّبهم في البلد } \\[ غافر : 4 \\] باعتبار التفريع الواقع عقب هاته الجمل من قوله : { فأخذتهم فكيف كانَ عِقَاب } ، فالمعنى : سبقتهم أمم بتكذيب الرسل كما كذبوك وجادلوا بالباطل رسلهم كما جادلك هؤلاء فأخذتهم فكيف رأيت عقابي إياهم كذلك مثل هؤلاء في إمهالهم إلى أن آخذهم .والأحزاب : جمع حِزب بكسر الحاء وسكون الزاي وهو اسم للجماعة الذين هم سواء في شأن : من اعتقادٍ أو عمل أو عادةٍ . والمراد بهم هنا الأمم الذين كانت كل أمة منهم متفقة في الدين ، فكل أمة منهم حزب فيما اتفقت عليه .وفي قوله : { مِن بَعْدِهم } إشارة إلى أن قوم نوح كانوا حزباً أيضاً فكانوا يدينون بعبادة الأصنام : يغوث ، ويعوق ، ونسر ، وودَ ، وسُواع ، وكذلك كانت كل أمة من الأمم التي كذبت الرسل حزباً متفقين في الدين ، فعادٌ حزب ، وثمود حزب ، وأصحاب الأيكة حزب ، وقوم فرعون حزب . والمعنى : أنهم جميعاً اشتركوا في تكذيب الرسل وإن تخالف بعض الأمم مع بعضها في الأديان . وفي الجمع بين { قبلهم } و { مِن بَعْدِهِم } محسِّن الطباق في الكلام .والهمّ : العزم . وحقه أن يعدّى بالباء إلى المعاني لأن العزم فعل نفساني لا يتعلق إلا بالمعاني . كقوله تعالى : { وهموا بما لم ينالوا } \\[ التوبة : 74 \\] ، ولا يتعدّى إلى الذوات ، فإذا عدّي إلى اسم ذات تعينّ تقدير معنى من المعاني التي تلابس الذات يدل عليها المقام كما في قوله تعالى : { ولقد همت به } \\[ يوسف : 24 \\] أي همّت بمضاجعته . وقد يذكر بعد اسم الذات ما يدل على المعنى الذي يُهَمّ به كما في قوله هنا : { ليأخذوه } إن الهمّ بأخذه ، وارتكابُ هذا الأسلوب لقصد الإجمال الذي يعقبه التفصيل ، ومثله تعلق أفعال القلوب بالأسماء في ظننتك جائياً ، أي ظننت مجيئك .والأخذ يستعمل مجازاً بمعنى التصرف في الشيء بالعقاب والتعذيب والقتل ونحو ذلك من التنكيل ، قال تعالى : { فأخذهم أخذة رابية } \\[ الحاقة : 10 \\] ويقال للأسير : أخيذ ، وللقتيل : أخيذ .واختير هذا الفعل هنا ليشمل مختلف ما هَمّت به كل أمة برسولها من قتل أو غيره كما قال تعالى : { وإذ يمكر بك الذين كفروا ليثبوتك أو يقتلوك أو يخرجوك } \\[ الأنفال : 30 \\] .( والمعنى : أن الأُمم السابقة من الكفرة لم يقتصروا على تكذيب الرسول بل تجاوزوا ذلك إلى غاية الأذى من الهمّ بالقتل كما حكى الله عن ثمود : { قالوا تقاسموا باللَّه لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون } \\[ النمل : 49 \\] . وقد تآمر كفار قريش على رسول الله صلى الله عليه وسلم ليلة دار الندوة ليقتلوه أن يتجمع نفر من جَميع عشائرهم فيضربوه بالسيوف ضربة رجل واحد كيلا يستطيع أولياؤه من بني هاشم الأخذ بثأره ، فأخذ الله الأمم عقوبة لهم على همهم برسلهم فأهلكهم واستأصلهم .ويفهم من تفريع قوله : { فأخذتهم } على قوله : { وهَمَّتْ كُلُّ أُمة بِرَسولهم لِيَأْخُذوه } إنذارُ المشركين أن همهم بقتل الرسول صلى الله عليه وسلم هو منتهى أمد الإِمهال لهم ، فإذا صمّموا العزم على ذلك أخذهم الله كما أخذ الأمم المكذبة قبلهم حين همّت كل أمة برسولهم ليأخذوه فإن قريشاً لما همّوا بقتل الرسول صلى الله عليه وسلم أنجاه الله منهم بالهجرة ثم أمكنه من نواصيهم يوم بدر . والمراد ب { كُلُّ أُمَّة } كل أمة من الأحزاب المذكورين .وضمير { وجادلوا بالباطل } عائد على { كُلُّ أُمَّة } . والمقصود : من تعداد جرائم الأمم السابقة من تكذيب الرسل والهمّ بقتلهم والجدال بالباطل تنظير حال المشركين النازل فيهم قوله : { ما يُجَادِلُ في آيَاتتِ الله إلا الذين كَفَرُوا } \\[ غافر : 4 \\] بحال الأمم السابقين سواء ، لينطبق الوعيد على حالهم أكمل انطباق في قوله : { فأخَذْتهُم فَكَيفَ كَانَ عِقابِ } .والباء في قوله : { بالباطل } للملابسة ، أي جادلوا ملابسين للباطل فالمجرور في موضع الحال من الضمير ، أو الباء لِلآلة بتنزيل الباطل منزلة الآلة لِجدالهم فيكون الظرف لغواً متعلقاً ب { جادلوا } . وتقييد { جادلوا } هذا بقيد كونه { بالباطل } يقتضي تقييد ما أطلق في قوله : { مَا يُجَادل في آيات الله إلاَّ الذينَ كَفَرُوا } .والإِدحاض : إبطال الحجة ، قال تعالى : { حجتهم داحضة عند ربهم } \\[ الشورى : 16 \\] . والمعنى : أنهم زوروا الباطل في صورة الحقّ وروّجوه بالسفسطة في صورة الحُجَّة ليبْطلوا حجج الحق وكفى بذلك تشنيعاً لكفرهم .وفُرع على قوله : { فأخذتهم } قولُه : { فَكَيْفَ كَانَ عِقَابِ } كما فُرّع قوله : { فَلا يَغررك تَقَلُّبهم في البِلاد } \\[ غافر : 4 \\] على جملة { ما يجادل في آيات الله إلا الذين كفروا } \\[ غافر : 4 \\] فيجري توجيه الاستفهام هنا على نحو ما جرى من توجيه الخطاب هناك .والأخذ هنا : الغَلب . والاستفهام ب { كيف كانَ عقاب } مستعمل في التعجيب من حالة العقاب وذلك يقتضي أن المخاطب بالاستفهام قد شاهد ذلك الأخذ والعقاب وإنما بني ذلك على مشاهدة آثار ذلك الأخذ في مرور الكثير على ديارهم في الأسفار كما أشار إليه قوله تعالى : { وإنها لبسبيل مقيم } \\[ الحجر : 76 \\] ونحوه ، وفي سماع الأخبار عن نزول العقاب بهم وتوصيفهم ، فنزل جميع المخاطبين منزلة من شاهد نزول العذاب بهم ، ففي هذا الاستفهام تحقيق وتثبيت لمضمون جملة { فأخذتهم } .ويجوز أن يكون في هذا الاستفهام معنى التقرير بناء على أن المقصود بقوله : { كذَّبَت قبلهم قوم نوح } إلى قوله : { فأخذتهم } التعريض بتهديد المشركين من قريش بتنبيههم على ما حلّ بالأمم قبلهم لأنهم أمثالهم في الإِشراك والتكذيب فلذلك يكون الاستفهام عمّا حلّ بنظرائهم تقريرياً لهم بذلك .وحذفت ياء المتكلم من { عقاب } تخفيفاً مع دلالة الكسرة عليها .\n\n",
      "translations": [
        {
          "translation": "(The folk of Noah and the factions) the disbelievers (after them) after the folk of Noah (denied (their messengers) before these) before your own folk, (and every nation purposed to seize their messenger) every nation wanted to kill their own messenger (and argued falsely) they argued with their messengers in favour of idolatry, ((thinking) thereby to refute the Truth) as an attempt to refute, by means of idolatry, the Truth which the messengers brought. (Then I seized them) I punished them when they disbelieved, (and how (awful) was My punishment) see, Muhammad, how was My punishment of them when they disbelieved.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وأما المحجوب فلظلمة جوهره وخبث باطنه لا يناسب ذاته آياته فينكرها ويجادل فيها { بالباطل } ليدحض بجداله آياته فيحق له العقاب\n { الذين يحملون العرش } من النفوس الناطقة السماوية اللاتي أرجلهم في الأرضين السفلى بتأثيرهم فيها وأعناقهم مرقت من السموات العلى لتجرّدهم منها وتدبيرهم إياها أو الأرواح التي هي معشوقاتها { ومن حوله } من الأرواح المجرّدة القدسية والنفوس الكوكبية { يسبحون بحمد ربهم } ينزهونه عن اللواحق المادية بتجرّد ذواتهم حامدين له بإظهار كمالاتهم المستفادة منه تعالى فكأنهم يقولون بلسان الحال: يا من هذه صفاته وهباته { ويؤمنون به } الإيمان العياني الحقيقي { ويستغفرون للذين آمنوا } بالأمداد النورية والإفاضات السبوحية لمناسبة ذواتهم ذواتهم في الحقيقة الإيمانية { ربنا وسعت كل شيء رحمة وعلماً } أي: شملت رحمتك وأحاط بالكل علمك { فاغفر } بنورك { للذين تابوا } إليك بالتجرّد عن الهيئات الظلمانية والظلمات الهيولانية { واتّبعوا سبيلك } بالسلوك فيك على متابعة حبيبك في الأعمال والمقامات والأحوال يتنصلون عن ذنوب أفعالهم وصفاتهم وذواتهم { وقِهِمْ } بعنايتك { عذاب } جحيم الطبيعة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فاصبر على أذاهم وتذكر كيف { كَـذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ } أخاك نوحاً\n وكيف صبر هو حتى ظفر عليهم حين ظهر أمرنا\n وجرى حكمنا بأخذهم واستئصالهم { وَ } كيف كذبت { ٱلأَحْزَابُ } والأمم الكثيرة { مِن بَعْدِهِمْ } أي: بعد قوم نوح رسلهم المبعوثين إليهم للهداية والإرشاد\n\n\n{ وَ } بالجملة: { هَمَّتْ } وقصدت { كُـلُّ أُمَّةٍ } من الأمم الماضية { بِرَسُولِهِمْ } المرسل إليهم { لِيَأْخُذُوهُ } ويِأسروه\n بل ليقتلوه أو يستحقروه ويهينوه { وَجَادَلُوا } أولئك الهالكون المنهمكون في تيه الكبر والعناد معهم { بِٱلْبَاطِلِ } الزاهق الزائل في نفسه { لِيُدْحِضُواْ بِهِ } ويزيلوا به { ٱلْحَقَّ } الحقيق بالإطاعة والاتباع { فَأَخَذْتُهُمْ } واستأصلهم بعدما أمهلتهم زماناً\n يعمهون في طغيانهم\n ويترددون في بنيانهم { فَكَيْفَ كَانَ عِقَابِ } [غافر: 5] إياهم حين حلَّ عليهم ما حلَّ من العذاب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { كذَّبتْ قبلهم قومُ نوحٍ } نوحاً\n { والأحزابُ } أي: الذين تحزّبوا على الرسل\n وناصبوهم العداوة\n { من بعدِهم } أي: من بعد قوم نوح\n كعاد\n وثمود\n وقوم لوط\n وأضرابهم\n { وهَمَّتْ كلُّ أُمَّةٍ } من تلك الأمم الماضية { برسولهم ليأخذوه } ليتمكنوا منه\n فيُصيبوا ما أرادوا من تعذيب أو قتل\n والأخذ: الأسر\n { وجادلوا بالباطل } الذي لا أصل له\n ولا حقيقة لوجوده\n { ليُدْحِضُوا بِه الحقَّ } ليُبطلوا به الحق الذي جاءت به من الإيمان وغيره\n { فأخَذتهُم } بسبب ذل أخذاً وبيلاً\n { فكيف كان عقابِ } الذي عاقبتم به\n فإنَّ آثار ديارهم عرضة للناظرين\n وسآخذ هؤلاء أيضاً لاتحادهم في السرة\n واشتراكهم في الجريرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:56",
      "similarity": 0.6753978016212249
    },
    {
      "verse": "42:16",
      "similarity": 0.5229600418885696
    },
    {
      "verse": "4:113",
      "similarity": 0.3072010004098716
    },
    {
      "verse": "5:11",
      "similarity": 0.28726147324191376
    },
    {
      "verse": "37:141",
      "similarity": 0.27385837358707293
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}