{
  "chapter": "غافر",
  "text": "كذبت قبلهم قوم نوح والاحزاب منۢ بعدهم وهمت كل امةۭ برسولهم لياخذوه وجدلوا۟ بالبطل ليدحضوا۟ به الحق فاخذتهم فكيف كان عقاب",
  "translations": [
    {
      "translation": "The people of Noah had denied before them, and many factions after them. Every nation has intrigued against its apostle and afflicted him, and argued with false arguments to condemn the truth. Then I seized them. How was then My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the people of Noah also gave the lie (to Messengers), and so did many parties after them. Each nation sallied forth against its Messenger to seize him, and they disputed with false arguments seeking therewith to repudiate the Truth. Then I seized them; and behold, how woeful was My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah who lived before and the Confederate tribes who lived after them rejected Our revelations. Every nation schemed against its Messengers to seize them and disputed against them to defeat the truth. But torment struck them and how terrible was their retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them, the people of Nooh and the groups after them had denied; and every nation intended to apprehend its Noble Messenger, and they fought along with falsehood to avert the truth, so I seized them; so how did My punishment turn out?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh and the groups after them denied before these; and every nation plotted against their Messenger to seize him, and disputed by means of falsehood to refute therewith the truth. So I seized them, and how was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh and the parties after them rejected (prophets) before them, and every nation purposed against their apostle to destroy him, and they disputed by means of the falsehood that they might thereby render null the truth, therefore I destroyed them; how was then My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah before them also cried lies, and the parties after them; every nation purposed against their Messenger to seize him, and disputed with falsehood that they might rebut thereby the truth. Then I seized them; and how was My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The folk of Noah and the factions after them denied (their messengers) before these, and every nation purposed to seize their messenger and argued falsely, (thinking) thereby to refute the Truth. Then I seized them, and how (awful) was My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah and later factions also rejected the truth and every community plotted against the messenger sent to them, aiming to lay hands on him, and they contended [against his message] with fallacious arguments, so that they might defeat the truth, therefore I seized them. How terrible was My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh and the confederates after them belied their apostles before these, and each disbelieving community advanced toward their apostle that they may lay hold of him and disputed with vain speech that they may confute the truth thereby. Wherefore I laid hold of them; and how terrible was My chastisement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah denied before them and the [heathen] factions [who came] after them. Every nation attempted to lay hands on their apostle, and disputed erroneously to refute the truth. Then I seized them; so how was My retribution?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (there were people) before them, who denied (the Signs),- the People of Noah, and the Confederates (of Evil) after them; and every People plotted against their prophet, to seize him, and disputed by means of vanities, therewith to condemn the Truth; but it was I that seized them! and how (terrible) was My Requital!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh (Noah) and the confederates after them denied (their Messengers) before these, and every (disbelieving) nation plotted against their Messenger to seize him, and disputed by means of falsehood to refute therewith the truth. So I seized them (with punishment), and how (terrible) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The nation of Noah before them belied, and so did the parties after them. Every nation strove against their Messenger to seize him, disputing with false arguments to refute the truth. Then I seized them, how was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the people of Noah rejected the truth, as did the confederates after them. Every community plotted against their messenger, to capture him. And they argued with falsehood, to defeat with it the truth. But I seized them. What a punishment it was!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah denied before them and the [disbelieving] factions after them, and every nation intended [a plot] for their messenger to seize him, and they disputed by [using] falsehood to [attempt to] invalidate thereby the truth. So I seized them, and how [terrible] was My penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:5]   The people of Noah denied before them and [also] the factions, such as ‘Ād, Thamūd and others, [who came] after them. And every community sought to seize their messenger, to slay him, and they argued falsely [thinking] to rebut, to eliminate, thereby the truth. Then I seized them, with punishment; so how [fitting] was My punishment!, of them — in other words, it was appropriate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The folk of Noah and the factions) the disbelievers (after them) after the folk of Noah (denied (their messengers) before these) before your own folk, (and every nation purposed to seize their messenger) every nation wanted to kill their own messenger (and argued falsely) they argued with their messengers in favour of idolatry, ((thinking) thereby to refute the Truth) as an attempt to refute, by means of idolatry, the Truth which the messengers brought. (Then I seized them) I punished them when they disbelieved, (and how (awful) was My punishment) see, Muhammad, how was My punishment of them when they disbelieved.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن كذبوك يا أكمل الرسل في دعوتك وشأنك وعاندوا معك، فاصبر على أذاهم وتذكر كيف { كَـذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ } أخاك نوحاً، وكيف صبر هو حتى ظفر عليهم حين ظهر أمرنا، وجرى حكمنا بأخذهم واستئصالهم { وَ } كيف كذبت { ٱلأَحْزَابُ } والأمم الكثيرة { مِن بَعْدِهِمْ } أي: بعد قوم نوح رسلهم المبعوثين إليهم للهداية والإرشاد\n\n\n\n\n{ وَ } بالجملة: { هَمَّتْ } وقصدت { كُـلُّ أُمَّةٍ } من الأمم الماضية { بِرَسُولِهِمْ } المرسل إليهم { لِيَأْخُذُوهُ } ويِأسروه، بل ليقتلوه أو يستحقروه ويهينوه { وَجَادَلُوا } أولئك الهالكون المنهمكون في تيه الكبر والعناد معهم { بِٱلْبَاطِلِ } الزاهق الزائل في نفسه { لِيُدْحِضُواْ بِهِ } ويزيلوا به { ٱلْحَقَّ } الحقيق بالإطاعة والاتباع { فَأَخَذْتُهُمْ } واستأصلهم بعدما أمهلتهم زماناً، يعمهون في طغيانهم، ويترددون في بنيانهم { فَكَيْفَ كَانَ عِقَابِ } [غافر: 5] إياهم حين حلَّ عليهم ما حلَّ من العذاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}