{
  "chapter": "غافر",
  "text": "قالوا۟ اولم تك تاتيكم رسلكم بالبينت قالوا۟ بلى قالوا۟ فادعوا۟ وما دعؤا۟ الكفرين الا فى ضلل",
  "translations": [
    {
      "translation": "They will ask, 'Did your Messengers not bring you the Clear Signs?' They will answer, 'Yes.' They will say, 'Then you call!' But the calling of the kafirun only goes astray.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Did not your apostles come to you with clear proofs?\" They will answer: \"Indeed, they did.\" \"Then pray,\" will (the warders) say. But the praying of unbelievers will be all in vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The keepers of Hell will ask: “Did your Messengers not come to you with Clear Signs?” They will say: “Yes (they did).” The keepers of Hell will say: “Then you yourselves should call (upon the Lord). And the call of the unbelievers will end in vain.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The keepers will ask them, \"Did your Messengers not come to you with illustrious evidence (of the Truth)? They will reply, \"Yes, they did.\" The keepers will then say, \"You may pray but the prayer of the disbelievers will not be answered\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Is it not that your Noble Messengers used to come to you with clear signs?” They said, “Why not, surely yes!” They said, “Then you yourselves pray”; and the prayer of the disbelievers is nothing but astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Did there not come to you, your Messengers with (clear) evidences\" They will say: \"Yes.\" They will reply: \"Then call (as you like)! And the invocation of the disbelievers is nothing but in vain!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: Did not your apostles come to you with clear arguments? They shall say: Yea. They shall say: Then call. And the call of the unbelievers is only in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'Did not your Messengers bring you the clear signs?' They shall say, 'Yes indeed.' They shall say, 'Then do you call!' But the calling of the unbelievers is only in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Came not your messengers unto you with clear proofs? They say: Yea, verily. They say: Then do ye pray, although the prayer of disbelievers is in vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but they will say, \"Did not your messengers come to you with clear signs?\" They will say, \"Yes.\" The keepers will say, \"Then pray [for help] yourselves.\" But the prayer of those who deny the truth is of no avail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: came there not your apostles Unto you with evidences? They will say: Yea? They will say: supplicate then yourselves. And supplication of the infidels will be but in wandering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Had not your apostles brought you manifest proofs?’ They will say, ‘Yes.’ They will say, ‘Then invoke [Him] yourselves.’ But the invocations of the faithless only go awry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Did there not come to you your messengers with Clear Signs?\" They will say, \"Yes\". They will reply, \"Then pray (as ye like)! But the prayer of those without Faith is nothing but (futile wandering) in (mazes of) error!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Did there not come to you, your Messengers with (clear) evidences and signs? They will say: \"Yes.\" They will reply: \"Then call (as you like)! And the invocation of the disbelievers is nothing but in error!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will say: 'Did your Messengers not come to you with clear signs' 'Yes indeed' they will answer. And they will reply: 'Then you call' But the calling of the unbelievers is only in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Did not your messengers come to you with clear signs?” They will say, “Yes.” They will say, “Then pray, but the prayers of the disbelievers will always be in vain.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Did there not come to you your messengers with clear proofs?\" They will say, \"Yes.\" They will reply, \"Then supplicate [yourselves], but the supplication of the disbelievers is not except in error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:50] They, that is, the keepers, will say, mockingly: ‘Did not your messengers bring you clear signs?’, manifest miracles? They will say, ‘Yes indeed’ — in other words, they disbelieved them. They will say, ‘Then supplicate [God]!’, yourselves, for we do not intercede for disbelievers. God, exalted be He, says: but the supplications of the disbelievers can only be misguided, void.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالُوا أَوَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ قَالُوا بَلَى قَالُوا فَادْعُوا وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ (50)والواو في قوله : { أوَلَمْ تَكُ تَأتِيكُم رُسُلُكُم } لم يعرج المفسرون على موقعها . وهي واو العطف عطف بها ( خزنة جهنم ) كلامهم على كلام الذين في النار من قَبيل طريقة عطف المتكلم كلاماً على كلاممٍ صدر من المخاطب إيماء إلى أن حقه أن يكون من بقية كلامه وأن لا يُغفِله ، وهو ما يلقب بعطف التلقين كقوله تعالى :{ قال إني جاعلك للناس إماماً قال ومن ذريتي } \\[ البقرة : 124 \\] فإن أهل النار إذا تذكروا ذلك علموا وجاهة تنصل خزنة جهنم من الشفاعة لهم ، وتفريع { فادعو } على ذلك ظاهر على كلا التقديرين . وهمزة الاستفهام مقدمة من التأخير على التقديرين ، لوجوب صدارتها .وجملة { وما دعاء الكافرين إلا في ضلال } يجوز أن تكون من كلام خزنة جهنم تذييلاً لكلامهم يبين أن قولهم : { فادعو } مستعمل في التنبيه على الخطأ ، أي دعاؤكم لم ينفعكم لأن دعاء الكافرين في ضلال والواو اعتراضية ، ويجوز أن تكون من كلام الله تعالى تذييلاً واعتراضاً .والبينات : الحجج الواضحة والدعَوات الصريحة إلى اتباع الهدى . فلم يسعهم إلا الاعتراف بمجيء الرسل إليهم بالبينات فقالوا : بلى ، فرد عليهم خزنة جهنم بالتنصل من أن يدعُوا الله بذلك ، إلى إيكال أمرهم إلى أنفسهم بقولهم : { فادعو } تفريعاً على اعترافهم بمجيء الرسل إليهم بالبينات .ومعنى تفريعه عليه هو أنه مفرع عليه باعتبار معناه الكِنائي الذي هو التنصل من أن يَدعُوا لهم ، أي كما توليتم الإعراض عن الرسل استبداداً بآرائكم فتولَّوا اليومَ أمرَ أنفسكم فادعوا أنتم ، فإن «من تولى قُرها يَتولَّى حَرَّها» ، فالأمر في قوله : { فادعو } مستعمل في الإِباحة أو في التسوية ، وفيه تنبيه على خطإِ السائلين في سُؤالهم .وزيادة فعل الكَون في { أوَلَمْ تَكُ تَأتِيكم } للدلالة على أن مجيء الرسل إلى الأمم أمر متقرر محقّق ، لما يدل عليه فعل الكَون من الوجود بمعنى التحقق ، وأما الدلالة على أن فعل الإِتيان كان في الزمن الماضي فهو مستفاد من ( لَم ) النافية في الماضي .والضلال : الضياع ، وأصله : خطأ الطريق ، كما في قوله تعالى : { أإذا ضللنا في الأرض أإنا لفي خلق جديد } \\[ السجدة : 10 \\] .والمعنى : أن دعاءهم لا ينفعهم ولا يُقبل منهم ، وسواء كان قوله : { وَمَا دُعاء الكافرين إلاَّ فِي ضلال } من كلام الملائكة أو من كلام الله تعالى فهو مقتض عموم دعائهم لأن المصدر المضاف من صيغ العموم فيقتضي أن دعاء الكافرين غير متقبل في الآخرة وفي الدنيا لأن عموم الذوات يستلزم عموم الأزمنة والأمكنة .وأما ما يوهم استجابة دعاء الكافرين نحو قوله تعالى : { قل من ينجيكم من ظلمات البر والبحر تدعونه تضرعاً وخفية لئن أنجيتنا من هذه لنكونن من الشاكرين قل الله ينجيكم منها } \\[ الأنعام : 63 ، 64 \\] وقوله : { دعوا الله مخلصين له الدين لئن أنجيتنا من هذه لنكونن من الشاكرين فلما أنجاهم إذا هم يبغون في الأرض بغير الحق } \\[ يونس : 22 ، 23 \\] ، فظاهر أن هذه لا تدل على استجابة كرامة ولكنها لتسجيل كفرهم ونكرانهم ، وقد يُتوهم في بعض الأحوال أن يَدْعو الكافر فيقع ما طَلبه وإنما ذلك لمصادفة دعائه وقَت إجابة دعاء غيره من الصالحين ، وكيف يستجاب دعاء الكافر وقد جاء عن النبي صلى الله عليه وسلم استبعاد استجابة دعاء المؤمن الذي يأكل الحرام ويلبس الحرام في حديث مسلم عن أبي هريرة : «ذَكَر رسول الله صلى الله عليه وسلم رَجُلاً يُطيلُ السَّفَر أشعثَ أَغْبَرَ يُمدُّ يديْه إلى السماء : يا رَبِّ يا رَبِّ ، ومطعَمُه حَرام ومَشْرَبُه حرام وغُذّي بالحرام فأنَّى يستجاب له» . ولهذا لم يقل الله : فلما استجاب دعاءهم ، وإنما قال : فلما نجاهم ، أي لأنه قدّر نجاتهم من قبل أن يدعوا أو لأن دعاءهم صادف دعاء بعض المؤمنين .\n\n",
      "translations": [
        {
          "translation": "(They say) i.e. the angels of hell say to the disbelievers: (Came not your messengers unto you with clear proofs) with commands and prohibitions and signs and did they not convey the message entrusted to them by Allah? (They say: Yea, verily) they conveyed the message to us, (They say) the angels of hell will say to them in mockery: (Then do ye pray, although the prayer of disbelievers) in the Fire (is in vain) it is also said that this means: although the worship of the disbelievers in the life of the world is but in error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُوۤاْ } أي: الخزنة في جوابهم تهكماً وتوبيخاً على سبيل التجاهل: { أَوَلَمْ تَكُ } أيها الحمقى الهالكون في تيه البعد والضلال { تَأْتِيكُمْ رُسُلُكُمْ } المبعوثون إليكم { بِٱلْبَيِّنَاتِ } الواضحة الدالة على قبول الإنذارات الصادرة من الله أصالة ومنهم تبعاً\n وبعدما سمعوا من الخزنة ما سمعوا { قَالُواْ } متأوهين متحسرين: { بَلَىٰ } قد جاءنا نذير فكذبنا\n وقلنا: ما نزل الله من شيء { قَالُواْ } أي: الخزنة بعدما سمعوا منهم ما سمعوا: إن أنتم إلا في ضلال مبين { فَٱدْعُواْ } على حالكم بلا استشفاع منَّا\n إذ نحن لا نجترئ بالشفاعة عنده\n والاستغفار منه سبحانه لأمثالكم\n إذ لا يقبل الدعاء منَّا ومنكم في أمثال هذه الجرائم الكبيرة\n\n\n{ وَ } بالجملة: { مَا دُعَاءُ ٱلْكَافِرِينَ } المصرين على كفرهم في النشأة الأولى التي هي دار الاختبار\n لاستخلاصهم في النشأة الأخرى التي هي دار القرار { إِلاَّ فِي ضَلاَلٍ } [غافر: 50] ضياع وخسار\n لا يسمع من أحد أمثال هذا الدعاء\n ولا يُجاب له\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n بعد مدة طويلة: { أَوَلَمْ تَكُ } أي: القصة { تأتيكم رُسلُكم بالبينات } بالمعجزات\n يَتْلُون عليكم آيات ربكم وينذرونكم لقاء يومكم هذا؟ أرادوا بذلك إلزامهم الحجة\n وتوبيخهم على إضاعة أوقات الدعاء\n وتعطيل أسباب الإجابة\n { قالوا } أي: الكفار: { بلى } أتونا بها\n فكذبناهم وقلنا: ما نزَّل اللهُ من شيء\n { قالوا } أي: الخزنة تهكُّماً بهم: { فادْعُوا } أي: إذا كان الأمر كذلك فادعوا أنتم\n فإنَّ الدعاء لمَن يفعل ذلك مما يستحيل صدوره\n منا\n زاد البيضاوي: إذ لم يؤذن لنا في الدعاء لأمثالكم\n وبحث معه أبو السعود بأنه يُوهم أن المانع هو عدم الإذن\n وأنَّ الإذن في حيز الإمكان\n ولا تجوز الشفاعة في كافر\n انظره\n قال تعالى: { وما دعاءُ الكافرين إِلا في ضلالٍ } في ضياع وبطلان\n لا يُجابون فيه لأنهم دعوا في غير وقته\n ويحتمل أن يكون من كلام الخزنة\n والله تعالى أعلم\n الإشارة: الآية تجر ذيلها على كلّ مَن له جاه\n فدعا إلى سوء\n بمقاله أو حاله\n فتبعه العامة على ذلك\n فيتحاجُّون يوم القيامة فيقول المستضعفون: إنا كنا لكم تبعاً\n فكل مَن أمر بسوء\n وفُعِل\n عُوقب الآمر والمأمور\n وكل مَن فعل فعلاً خارجاً عن السُنَّة\n كالرغبة في الدنيا\n والتكاثر منها\n فتبعه العامة على ذلك\n عُوتب الجميع\n وبالله التوفيق\n ثم وعد أهل الحق بالنصر\n فقال: { إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِينَ آمَنُواْ فِي ٱلْحَيَاةِ ٱلدُّنْيَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:15",
      "similarity": 0.7075661306179164
    },
    {
      "verse": "39:59",
      "similarity": 0.6856621587843414
    },
    {
      "verse": "67:9",
      "similarity": 0.6731626696394793
    },
    {
      "verse": "36:81",
      "similarity": 0.5849634154070157
    },
    {
      "verse": "46:34",
      "similarity": 0.5524588731255485
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}