{
  "chapter": "غافر",
  "text": "ان الذين يجدلون فى ءايت الله بغير سلطن اتىهم ان فى صدورهم الا كبر ما هم ببلغيه فاستعذ بالله انه هو السميع البصير",
  "translations": [
    {
      "translation": "Certainly those who argue about the Signs of Allah without any authority having come to them have nothing in their breasts except for pride which they will never be able to vindicate. Therefore seek refuge with Allah. He is the All-Hearing, the All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who argue in the matter of God's revelations, without authority having reached them, have nothing but pride in their hearts, and they will not achieve their end. So take refuge in God: Surely He is all-hearing and all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who dispute regarding the Signs of Allah without any evidence that might have come to them, nothing but vain pride fills their hearts. Yet they shall never be able to satisfy the pride with which they are puffed up. So seek refuge with Allah. Verily He is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute the revelations of God without having received any authority do so because of their arrogance, but their arrogance cannot bring them any success. Seek protection from God for He is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute concerning the signs of Allah without any proof having come to them – in their hearts is nothing but a craving for greatness which they shall never achieve; therefore seek the refuge of Allah; indeed He only is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who dispute about the Ayat of Allah, without any authority having come to them, there is nothing else in their breasts except pride. They will never have it. So seek refuge in Allah. Verily, it is He Who is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who dispute about the communications of Allah without any authority that has come to them, there is naught in their breasts but (a desire) to become great which they shall never attain to; Therefore seek refuge in Allah, surely He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute concerning the signs of God, without any authority come to them, in their breasts is only pride, that they shall never attain. So seek thou refuge in God; surely He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who wrangle concerning the revelations of Allah without a warrant having come unto them, there is naught else in their breasts save pride which they will never attain. So take thou refuge in Allah. Lo! He, only He, is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who, with no authority to do so, dispute God's messages, there is nothing in their hearts but a feeling of greatness which they will never attain. Seek refuge in God, for He is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who wrangle concerning the revelations of Allah without an authority having come Unto them there is aught in their breasts save greatness Which they shall not reach. Seek refuge thou then in Allah verily He! He is the Hearer, the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who dispute the signs of Allah without any authority that may have come to them—there is [an ambition for] greatness in their breasts, which they will never attain. So seek the protection of Allah; indeed, He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute about the signs of Allah without any authority bestowed on them,- there is nothing in their breasts but (the quest of) greatness, which they shall never attain to: seek refuge, then, in Allah: It is He Who hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who dispute about the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, without any authority having come to them, there is nothing else in their breasts except pride [to accept you (Muhammad SAW) as a Messenger of Allah and to obey you]. They will never have it (i.e. Prophethood which Allah has bestowed upon you). So seek refuge in Allah (O Muhammad SAW from the arrogants). Verily, it is He Who is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who dispute the verses of Allah without authority having been given to them, there is nothing in their chests but pride; that, they shall never attain. Therefore seek refuge in Allah, surely, He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute regarding God’s revelations without any authority having come to them—there is nothing in their hearts but the feeling of greatness, which they will never attain. So seek refuge in God; for He is the All-Hearing, the All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who dispute concerning the signs of Allah without [any] authority having come to them - there is not within their breasts except pride, [the extent of] which they cannot reach. So seek refuge in Allah. Indeed, it is He who is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:56] Truly those who dispute the signs of God, the Qur’ān, without any warrant, any evidence, that has come to them — there is only vanity in their breasts, [only] arrogance and an [evil] desire to get the better of you, which they will never attain [and satisfy]. So seek refuge with God, from their evil. Surely He is the Hearer, of their sayings, the Seer, of their state.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who wrangle concerning the revelations of Allah) those who disbelieve in Muhammad (pbuh) and in the Qur'an, i.e. the Jews; they also argued with the Prophet (pbuh) about the anti-Christ, his greatness and the return of their kingdom upon the coming of the anti-Christ (without a warrant) proof (having come unto them) from Allah for what they claimed, (there is naught else in their breasts) in their hearts (save pride) they were too proud to accept the Truth (which they will never attain) they will never attain the pride which is in their hearts nor will they have their kingdom back upon the coming of the anti-Christ. (So take thou refuge in Allah) O Muhammad, from the sedition of the anti-Christ. (Lo! He, only He, is the Hearer) of what the Jews say, (the Seer) He sees them and sees their works just as He sees the anti-Christ and his coming.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ } المشركين المعاندين { ٱلَّذِينَ يُجَادِلُونَ } ويخاصمون معك يا أكمل الرسل { فِيۤ آيَاتِ ٱللَّهِ } المنزلة عليك لتأييد دينك وشأنك على سبيل المكابرة والعناد { بِغَيْرِ سُلْطَانٍ } أي: حجة وبرهان { أَتَاهُمْ } وفاض عليهم من ربهم على طريق الوحي والإلهام { إِن فِي صُدُورِهِمْ } أي: ما في صدورهم وضمائرهم شيء يبعثهم على المجادلة { إِلاَّ كِبْرٌ } وخيلاء مركوز في جبلتهم، تقية لثروتهم ورئاستهم على زعمهم الفاسد، مع أنه { مَّـا هُم بِبَالِغِيهِ } على مقتضى ما جبلوا في نفوسهم؛ إذ هم سيغلبون عن قريب في هذه النشأة الأولى، ويحشرون إلى جنهم البعد والخذلان في الأخرى { فَٱسْتَعِذْ بِٱللَّهِ } القوي القادر، والتجئ إليه سبحانه عن غدر كل غادر { إِنَّـهُ } سبحانه { هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ } [غافر: 56] بنياتهم وأفعالهم، يكفيك مؤنة ما يقصدون عليك بمقتضى آرائهم الباطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ الذين يُجادلون في آياتِ الله } ويجحدونها { بغير سُلطانٍ } برهان { أتاهُم } من جهته تعالى، بل عناداً وحسداً\n وتعليق المجادلة بذلك، مع استحالة إتيانه للإيذان بأن التكلم في أمر الدين لا بد من استناده إلى برهان، وهذا عام لكل مجادل، محق أو مبطل، وإن نزل في مشركي مكة\n وقوله: { إِن في صُدورِهم إِلا كِبْرٌ }: خبر \" إِنْ \" ، أي: ما في قلوبهم إلا تكبُّر عن الحق، وتعاظم عنه، وهو إرادةُ التقدم والرئاسة، وألا يكون أحدٌ فوقهم، فلذلك عادوك، ودفعوا آياتك، خيفة أن تتقدمهم، ويكونوا تحت قهرك لأن النبوة تحتها كُل ملك ورئاسة، أو: إرادة أن تكون لهم النبوة دونك، حسداً وبغياً، كقولهم:\n\n[الزخرف: 31]،\n\n[الأحقاف: 11]\n ثم وصف كِبْرَهم بقوله: { ما هم ببالغِيه } أي: ما هم ببالغي موجب ذلك الكبر ومقتضاه، وهو ما أرادوه من التقدُّم والرئاسة، وقيل: نزلت في اليهود، وهم المجادلون، كانوا يقولون: لست صاحبنا المذكور في التوراة، بل هو المسيح ابن داود، يعنون الدجال، يخرج في آخر الزمان، فيبلغ سلطانه البر والبحر، وتسير معه الأنهار، وهو آية من آيات الله، فيرجع إلينا المُلك فسمى الله تمنيهم بذلك كِبْراً، ونفى أن يبلغوا متمناهم\n { فاستعذ بالله } فالتجىء إليه من كبد مَن يحسدك، ويبغي عليك، { إِنه هو السميعُ } لِمَا تقول ويقولون، { البصير } بما تعمل ويعملون، فهو ناصرك عليهم، وعاصمك من شرهم\n الإشارة: فاصبر أيها المتوجه إلى الله، إنَّ وعد الله بالفتح حق إن صبرت، وكابدت ولم تملّ، واستغفر لذنبك، وتطهرْ من عيبك، لتدخل حضرة ربك\n قال الورتجبي: \" واستغفر لذنبك \" أي: لما جرى على قلبك من الأحكام البشرية، وأيضاً: استغفر لرؤية وجودك في وجود الحق، فإنَّ كون الحادث في وجود القديم ذنب في إفراد القدم من الحدوث\n انظر تمامه\n وقوله تعالى: { وسبّح\n\n\n } الخ، فيه الحث على التوجُّه إلى الله في هذين الوقتين، فإن العبرة بالافتتاح والاختتام، فمَن فتح يومه بخير، وختمه بخير، حكم على بينهما\n وقال في أهل الإنكار: { إِن الذين يُجادلون في آيات الله\n\n\n } الآية، فاستعذ بالله منهم، وغِبْ عنهم بإقبالك على مولاك\n وبالله التوفيق\n ولمَّا كانت مجادلة الكفرة في آيات الله مشتملة على إنكار البعث، احتج عليهم بقوله: { لَخَلْقُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ أَكْـبَرُ مِنْ خَلْقِ ٱلنَّاسِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:27",
      "similarity": 0.4614352419195868
    },
    {
      "verse": "114:1",
      "similarity": 0.45903275739960764
    },
    {
      "verse": "19:18",
      "similarity": 0.4544850142067379
    },
    {
      "verse": "12:79",
      "similarity": 0.4102226789740976
    },
    {
      "verse": "23:98",
      "similarity": 0.3996995341985646
    }
  ]
}