{
  "chapter": "غافر",
  "text": "ان الذين يجدلون فى ءايت الله بغير سلطن اتىهم ان فى صدورهم الا كبر ما هم ببلغيه فاستعذ بالله انه هو السميع البصير",
  "translations": [
    {
      "translation": "Certainly those who argue about the Signs of Allah without any authority having come to them have nothing in their breasts except for pride which they will never be able to vindicate. Therefore seek refuge with Allah. He is the All-Hearing, the All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who argue in the matter of God's revelations, without authority having reached them, have nothing but pride in their hearts, and they will not achieve their end. So take refuge in God: Surely He is all-hearing and all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who dispute regarding the Signs of Allah without any evidence that might have come to them, nothing but vain pride fills their hearts. Yet they shall never be able to satisfy the pride with which they are puffed up. So seek refuge with Allah. Verily He is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute the revelations of God without having received any authority do so because of their arrogance, but their arrogance cannot bring them any success. Seek protection from God for He is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute concerning the signs of Allah without any proof having come to them – in their hearts is nothing but a craving for greatness which they shall never achieve; therefore seek the refuge of Allah; indeed He only is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who dispute about the Ayat of Allah, without any authority having come to them, there is nothing else in their breasts except pride. They will never have it. So seek refuge in Allah. Verily, it is He Who is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who dispute about the communications of Allah without any authority that has come to them, there is naught in their breasts but (a desire) to become great which they shall never attain to; Therefore seek refuge in Allah, surely He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute concerning the signs of God, without any authority come to them, in their breasts is only pride, that they shall never attain. So seek thou refuge in God; surely He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who wrangle concerning the revelations of Allah without a warrant having come unto them, there is naught else in their breasts save pride which they will never attain. So take thou refuge in Allah. Lo! He, only He, is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who, with no authority to do so, dispute God's messages, there is nothing in their hearts but a feeling of greatness which they will never attain. Seek refuge in God, for He is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who wrangle concerning the revelations of Allah without an authority having come Unto them there is aught in their breasts save greatness Which they shall not reach. Seek refuge thou then in Allah verily He! He is the Hearer, the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who dispute the signs of Allah without any authority that may have come to them—there is [an ambition for] greatness in their breasts, which they will never attain. So seek the protection of Allah; indeed, He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute about the signs of Allah without any authority bestowed on them,- there is nothing in their breasts but (the quest of) greatness, which they shall never attain to: seek refuge, then, in Allah: It is He Who hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who dispute about the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, without any authority having come to them, there is nothing else in their breasts except pride [to accept you (Muhammad SAW) as a Messenger of Allah and to obey you]. They will never have it (i.e. Prophethood which Allah has bestowed upon you). So seek refuge in Allah (O Muhammad SAW from the arrogants). Verily, it is He Who is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who dispute the verses of Allah without authority having been given to them, there is nothing in their chests but pride; that, they shall never attain. Therefore seek refuge in Allah, surely, He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who dispute regarding God’s revelations without any authority having come to them—there is nothing in their hearts but the feeling of greatness, which they will never attain. So seek refuge in God; for He is the All-Hearing, the All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who dispute concerning the signs of Allah without [any] authority having come to them - there is not within their breasts except pride, [the extent of] which they cannot reach. So seek refuge in Allah. Indeed, it is He who is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:56] Truly those who dispute the signs of God, the Qur’ān, without any warrant, any evidence, that has come to them — there is only vanity in their breasts, [only] arrogance and an [evil] desire to get the better of you, which they will never attain [and satisfy]. So seek refuge with God, from their evil. Surely He is the Hearer, of their sayings, the Seer, of their state.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ الَّذِينَ يُجَادِلُونَ فِي آَيَاتِ اللَّهِ بِغَيْرِ سُلْطَانٍ أَتَاهُمْ إِنْ فِي صُدُورِهِمْ إِلَّا كِبْرٌ مَا هُمْ بِبَالِغِيهِ فَاسْتَعِذْ بِاللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ (56){ إِنَّ الذين يجادلون فى ءايات الله بِغَيْرِ سلطان أتاهم إِن فِى صُدُورِهِمْ إلاَّ كِبْرٌ مَّا هُم بِبلِغِهِ } .جرى الكلام من أول السورة إلى هنا في مَيدان الرد على مجادلة المشركين في آيات الله ودَحض شُبههم وتوعدهم على كفرهم وضرب الأمثال لهم بأمثالهم من أهل العناد ابتداء من قوله : { ما يجادل في آيات الله إلا الذين كفروا } \\[ غافر : 4 \\] وقوله : { أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين كانوا من قبلهم } \\[ غافر : 21 \\] ، كما ذُكرت أمثال أضدادهم من أهل الإِيمان من حَضَر منهم ومَن غَبَرَ من قوله : { ولقد أرسلنا موسى بئاياتنا وسلطان مبين إلى فرعون \\[ هود : 96 ، 97 \\] ثم قوله : وقال رجل مؤمن من ءال فرعون } \\[ غافر : 28 \\] ، وخُتم ذلك بوعد النبي صلى الله عليه وسلم والمؤمنين بالنصر كما نُصر النبيئون من قبله والذين آمنوا بهم ، وأُمر بالصبر على عناد قومه والتوجه إلى عبادة ربه ، فكان ذكر الذين يجادلون في آيات الله بغير سلطان عقب ذلك من باب المثل المشهور : «الشيء بالشيء يُذكر» .وبهذه المناسبة انتقل هنا إلى كشف ما تكنه صدور المجادلين من أسباب جدالهم بغير حق ، ليَعلم الرسول صلى الله عليه وسلم دخيلتهم فلا يحسب أنهم يكذبونه تنقصاً له ولا تجويزاً للكذب عليه ، ولكن الذي يدفعهم إلى التكذيب هو التكبر عن أن يكونوا تبعاً للرسول صلى الله عليه وسلم ووراء الذين سبقوهم بالإِيمان ممن كانوا لا يعبَأون بهم . وهذا نحو قوله تعالى : { قد نعلم أنه ليحزنك الذي يقولون فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون } \\[ الأنعام : 33 \\] .( فقوله : { إنَّ الذينَ يُجادلُونَ في ءاياتت الله } الآية استئناف ابتدائي وهو كالتكرير لِجملة { الذين يجادلون في ءايات الله بغير سلطان أتاهم كبر مقتاً عند الله } \\[ غافر : 35 \\] تكرير تعداد للتوبيخ عند تنهية غرض الاستدلال كما يوقَّف الموبخ المرة بعد المرة . و { الذِينَ يجادلون } هم مشركو أهل مكة وهم المخبَر عنهم في قوله أولَ السورة : { ما يجادل في آيات الله إلا الذين كفروا فلا يغررك تقلبهم في البلاد } \\[ غافر : 4 \\] . ومعنى المجادلة في آيات الله تقدم هنالك .ويتعلق قوله : { بِغَيْرِ سلطان } ب { يجادلون . } والباء للمصاحبة ، أي مصاحب لهم غير سلطان ، أي غير حجة ، أي أنهم يجادلون مجادلة عناد وغصْب .وفائدة هذا القيد تشنيع مجادلتهم وإلا فإن المجادلة في آيات الله لا تكون إلا بغير سلطان لأن آيات الله لا تكون مخالفة للواقع فهذا القيد نظير القيد في قوله : { ومن أضل ممن اتبع هواه بغير هدى من الله } \\[ القصص : 50 \\] ، وكذلك وصف { سلطان } بجملة { أتاهم } لزيادة تفظيع مجادلتهم بأنها عرية عن حجة لديهم فهم يجادلون بما ليس لهم به علم ، وتقدم نظير أول هذه الآية في أثناء قصة موسى وفرعون في هذه السورة .و { إنْ في قوله : إن في صُدُورِهم إلاَّ كِبْرٌ } نافية والجار والمجرور خبر مقدم ، والاستثناء مفرّغ ، و { كبر } مبتدأ مؤخَّر ، والجملة كلها خبر عن { الَّذِينَ يُجادلون } .وأطلق الصدور على القلوب مجازاً بعلاقة الحلول ، والمراد ضمائر أنفسهم ، والعرب يطلقون القلب على العقل لأن القلب هو الذي يحس الإِنسان بحركته عند الانفعالات النفسية من الفرح وضده والاهتماممِ بالشيء . والكِبْر من الانفعالات النفسية ، وهو : إدراك الإِنسان خواطر تشعره بأنه أعظم من غيره فلا يرضى بمساواته بَلْهَ متابعته ، وتقدم في تفسير قوله تعالى : { إلا إبليس أبى واستكبر } في سورة \\[ البقرة : 34 \\] .والمعنى : ما يحملهم على المجادلة في آيات الله إلا الكِبر على الذي جاءهم بها وليست مجادلتهم لدليل لاح لهم . وقد أثبت لهم الكبرَ الباعثَ على المجادلة بطريق القصر ليُنفَى أن يكون داعيهم إلى المجادلة شيء آخر غير الكِبْر على وجه مؤكد ، فإن القصر تأكيد على تأكيد لما يتضمنه من إثبات الشيء بوجه مخصوص مؤكِّد ، ومن نفي ما عداه فتضمن جملتين .وجملة { ما هُمْ بِبالِغِيه } يجوز أن تكون معترضة ، ويجوز أن تكون في موضع الصفة ل { كبر . } وحقيقة البلوغ : الوصول ، قال تعالى : { إلى بلد لم تكونوا بالغيبة إلا بشق الأنفس } \\[ النحل : 7 \\] ويطلق على نوال الشيء وتحصيله مجازاً مرسلاً كما في قوله تعالى : { ما بلغوا معشار ما آتيناهم } \\[ سبأ : 45 \\] وهو هنا محمول على المعنى المجازي لا محالة ، أي ما هم ببالغي الكِبر .وإذ قد كان الكبر مثبتاً حصوله في نفوسهم إثباتاً مؤكداً بقوله : { إنَّ في صُدُورهم إلاَّ كِبرٌ } ، تعيّن أن نفي بلوغهم الكِبر منصرف إلى حالات الكِبر : فإما أن يراد نفي أهليتهم للكبر إذ هم أقل من أن يكون لهم الكبر كقوله تعالى : { ليخرجن الأعز منها الأذل ولله العزة ولرسوله وللمؤمنين } \\[ المنافقون : 8 \\] أي لا عزة حقاً لهم ، فالمعنى هنا : كِبْر زيفٌ ، وإما أن يراد نفي نوالهم شيئاً من آثار كِبْرهم مثل تحقير الذين يتكبرون عليهم مثل احتقار المتكبر عليهم ومخالفتهم إياهم فيما يدعونهم إليه فضلاً عن الانتظام في سلك اتباعهم ، وإذلالهم ، وإفْحام حجتهم ، فالمعنى : ما هم ببالغين مرادهم الذي يأملونه منك في نفوسهم الدالة عليه أقوالهم مثل قولهم : { نتربص به ريب المنون } \\[ الطور : 30 \\] وقولهم : { لا تسمعوا لهذا القرآن والغوا فيه لعلكم تغلبون } \\[ فصلت : 26 \\] ونحو ذلك من أقوالهم الكاشفة لآمالهم .فتنكير : { كبر } للتعظيم ، أي كبر شديد بتعدد أنواعه ، وتمكنه من نفوسهم ، فالضمير البارز في { ببالغيه } عائد إلى الكبر على وجه المجاز بعلاقة السببية أو المسببية ، والداعي إلى هذا المجاز طلب الإِيجاز لأن تعليق نفي البلوغ باسم ذات الكبر يشمل جميع الأحوال التي يثيرها الكِبر ، وهذا من مقاصد إسناد الأحكام إلى الذوات إن لم تقم قرينة على إرادة حالة مخصوصة ، كما في قوله تعالى : { نحن قسمنا بينهم معيشتهم } \\[ الزخرف : 32 \\] أي جميع أحوال معيشتهم . فشمل قوله : { ما هم ببالغيه } عدم بلوغهم شيئاً مما ينطوي عليه كِبرُهم ، فما بلغوا الفضل على غيرهم حتى يتكبروا ، ولا مطمع لهم في حصول آثار كبرهم ، كما قال تعالى :{ لقد استكبروا في أنفسهم وعتو عتواً كبيراً } \\[ الفرقان : 21 \\] .وقد نُفي أن يبلغوا مرادهم بصوغه في قالب الجملة الاسمية لإِفادتها ثبات مدلولها ودوامه ، فالمعنى ، أنهم محرومون من بلوغه حرماناً مستمراً ، فاشتمل تشويه حالهم إثباتاً ونفياً على خصوصيات بلاغية كثيرة . ومن المفسرين من جعل مَا صَدْقَ : { الذين يجادلون في ءايات الله } هنا اليهودَ ، وجعله في معنى قوله تعالى : { أم يحسدون الناس على ما آتاهم الله من فضله } \\[ النساء : 54 \\] ، وارتقى بذلك إلى القول بأن هذه الآية مدنية ألحقت بالسورة المكية كما تقدم في مقدمة تفسير السورة ، وأيدوا تفسيرهم هذا بآثار لو صحت لم تكن فيها دلالة على أكثر من صلوحية الآية لأن تُضرب مثلاً لكل فريق يجادلون في آيات الله بغير سلطان جدالاً يدفعهم إليهم الكبر .{ ببالغيه فاستعذ بالله إِنَّهُ هُوَ السميع }لما ضمن الله لرسوله صلى الله عليه وسلم أن الذين يجادلونه فيما جاءهم به يحدوهم إلى الجدال كبرهم المنطوي على كيدهم وأنهم لا يبلغون من أضمروه وما يضمرونه ، فَرّع على ذلك أن أَمَرَه بأن يجعل الله معاذه منهم ، أي لا يعبأ بما يبيتونه ، أي قدم على طلب العوذ بالله . وحذف متعلق ( استعذ ) لقصد تعميم الاستعاذة من كل ما يخاف منه .وجملة { إنَّه هوَ السَّمِيع البصِير } تعليل للأمر بالدوام على الاستعاذة ، أي لأنه المطلع على أقوالهم وأعمالهم وأنت لا تحيط علماً بتصاريف مكرهم وكيدهم .والتوكيد بحرف ( إنّ ) ، والحصرُ بضمير الفصل مراعى فيه التعريض بالمتحدث عنهم وهم الذين يجادلون في آيات الله بغير سلطان . والمعنى : أنه هو القادر على إبطال ما يصنعونه لا أنت فكيف يتم لهم ما أضمروه لك .\n\n",
      "translations": [
        {
          "translation": "(Lo! those who wrangle concerning the revelations of Allah) those who disbelieve in Muhammad (pbuh) and in the Qur'an, i.e. the Jews; they also argued with the Prophet (pbuh) about the anti-Christ, his greatness and the return of their kingdom upon the coming of the anti-Christ (without a warrant) proof (having come unto them) from Allah for what they claimed, (there is naught else in their breasts) in their hearts (save pride) they were too proud to accept the Truth (which they will never attain) they will never attain the pride which is in their hearts nor will they have their kingdom back upon the coming of the anti-Christ. (So take thou refuge in Allah) O Muhammad, from the sedition of the anti-Christ. (Lo! He, only He, is the Hearer) of what the Jews say, (the Seer) He sees them and sees their works just as He sees the anti-Christ and his coming.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنه { مَّـا هُم بِبَالِغِيهِ } على مقتضى ما جبلوا في نفوسهم\n إذ هم سيغلبون عن قريب في هذه النشأة الأولى\n ويحشرون إلى جنهم البعد والخذلان في الأخرى { فَٱسْتَعِذْ بِٱللَّهِ } القوي القادر\n والتجئ إليه سبحانه عن غدر كل غادر { إِنَّـهُ } سبحانه { هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ } [غافر: 56] بنياتهم وأفعالهم\n يكفيك مؤنة ما يقصدون عليك بمقتضى آرائهم الباطلة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم وصف كِبْرَهم بقوله: { ما هم ببالغِيه } أي: ما هم ببالغي موجب ذلك الكبر ومقتضاه\n وهو ما أرادوه من التقدُّم والرئاسة\n وقيل: نزلت في اليهود\n وهم المجادلون\n كانوا يقولون: لست صاحبنا المذكور في التوراة\n بل هو المسيح ابن داود\n يعنون الدجال\n يخرج في آخر الزمان\n فيبلغ سلطانه البر والبحر\n وتسير معه الأنهار\n وهو آية من آيات الله\n فيرجع إلينا المُلك فسمى الله تمنيهم بذلك كِبْراً\n ونفى أن يبلغوا متمناهم\n { فاستعذ بالله } فالتجىء إليه من كبد مَن يحسدك\n ويبغي عليك\n { إِنه هو السميعُ } لِمَا تقول ويقولون\n { البصير } بما تعمل ويعملون\n فهو ناصرك عليهم\n وعاصمك من شرهم\n الإشارة: فاصبر أيها المتوجه إلى الله\n إنَّ وعد الله بالفتح حق إن صبرت\n وكابدت ولم تملّ\n واستغفر لذنبك\n وتطهرْ من عيبك\n لتدخل حضرة ربك\n قال الورتجبي: \" واستغفر لذنبك \" أي: لما جرى على قلبك من الأحكام البشرية\n وأيضاً: استغفر لرؤية وجودك في وجود الحق\n فإنَّ كون الحادث في وجود القديم ذنب في إفراد القدم من الحدوث\n انظر تمامه\n وقوله تعالى: { وسبّح\n\n\n } الخ\n فيه الحث على التوجُّه إلى الله في هذين الوقتين\n فإن العبرة بالافتتاح والاختتام\n فمَن فتح يومه بخير\n وختمه بخير\n حكم على بينهما\n وقال في أهل الإنكار: { إِن الذين يُجادلون في آيات الله\n\n\n } الآية\n فاستعذ بالله منهم\n وغِبْ عنهم بإقبالك على مولاك\n وبالله التوفيق\n ولمَّا كانت مجادلة الكفرة في آيات الله مشتملة على إنكار البعث\n احتج عليهم بقوله: { لَخَلْقُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ أَكْـبَرُ مِنْ خَلْقِ ٱلنَّاسِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:27",
      "similarity": 0.4614352419195868
    },
    {
      "verse": "114:1",
      "similarity": 0.45903275739960764
    },
    {
      "verse": "19:18",
      "similarity": 0.4544850142067379
    },
    {
      "verse": "12:79",
      "similarity": 0.4102226789740976
    },
    {
      "verse": "23:98",
      "similarity": 0.3996995341985646
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040056.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040056.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:56.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}