{
  "chapter": "غافر",
  "text": "لخلق السموت والارض اكبر من خلق الناس ولكن اكثر الناس لا يعلمون",
  "translations": [
    {
      "translation": "The creation of the heavens and earth is far greater than the creation of mankind. But most of mankind do not know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth is indeed of greater magnitude than the creation of mankind; but most men do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the creation of the heavens and the earth is a greater act than the creation of human beings. But most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth is certainly greater than the creation of mankind, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly the creation of the heavens and the earth is far greater than the creation of men, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth is indeed greater than the creation of mankind; yet, most of the people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly the creation of the heavens and the earth is greater than the creation of the men, but most people do not know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly the creation of the heavens and earth is greater than the creation of men; but most men know it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly the creation of the heavens and the earth is greater than the creation of mankind; but most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, the creation of the heavens and the earth is greater than the creation of mankind; but most people do not know this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth is indeed greater than the creation of mankind; but most of man kind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth is surely more prodigious than the creation of mankind, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly the creation of the heavens and the earth is a greater (matter) than the creation of men: Yet most men understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth is indeed greater than the creation of mankind, yet most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the creation of heavens and earth is greater than the creation of mankind, yet most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly the creation of the heavens and the earth is greater than the creation of humanity, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and earth is greater than the creation of mankind, but most of the people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:57] The following was revealed regarding the deniers of resurrection: Assuredly the creation of the heavens and the earth, as an [unprecedented] first act, is greater than the creation of mankind, a second time — which is the restoration [of them after death]; but most people, namely, the disbelievers of Mecca, do not know, this, and so they are like the blind, whereas those who know it are like those who have sight.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (57)مناسبة اتصال هذا الكلام بما قبله أن أهم ما جادلوا فيه من آيات الله هي الآيات المثبِتة للبعث وجدالهم في إثبات البعث هو أكبر شبهة لهم ضللت أنفسهم وروجوها في عامَّتهِم فقالوا : { أإذا كنا تراباً أإنا لفي خلق جديد } \\[ الرعد : 5 \\] . فكانوا يسخرون من النبي صلى الله عليه وسلم لأجل ذلك { وقال الذين كفروا هل ندلكم على رجل ينبئكم إذا مزقتم كل ممزق إنكم لفي خلق جديد أفترى على اللَّه كذباً أم به جنة } \\[ سبأ : 7 ، 8 \\] ، ولما كانوا مقرّين بأن الله هو خالق السماوات والأرض أقيمت عليهم الحجة على إثبات البعث بأنّ بعْث الأموات لا يبلغ أمره مقدار أمر خلق السماوات والأرض بالنسبة إلى قدرة الله تعالى . والكلام مؤذن بقَسَم مقدّر لأن اللام لام جواب القسم ، والمقصود : تأكيد الخبر .ومعنى { أكبر } أنه أعظم وأهم وأكثر متعلَّقاتتِ قدرة بالقادر عليه لا يعجز عن خلق ناس يبعثهم للحساب .فالمراد بالناس في قوله : { مِنْ خَلْققِ النَّاسِ } الذين يعيد الله خلقتهم كما بدأهم أول مرة ويودع فيهم أرواحهم كما أودعها فيهم أول مرة . والخبر مستعمل في غير معناه لأن كون خلقها أكبر هو أمر معلوم وإنما أريد التذكير والتنبيه عليه لعدم جريهم على موجَب علمهم به .وموقع الاستدراك في قوله : { ولكن أكثرَ النَّاسسِ لا يعلَمُون } ما اقتضاه التوكيد بالقَسَم من اتضاح أن خلق السماوات والأرض أكبر من خلق الناس . فالمعنى : أن حجة إمكان البعث واضحة ولكن الذين ينكرونها لا يعلمون ، أي لا يعلمون الدليل لأنهم متلاهون عن النظر في الأدلة مقتنعون ببادىء الخواطر التي تبدو لهم فيتخذونها عقيدة دون بحث عن معارضها ، فلما جرَوا على حالة انتقاء العلم نُزلوا منزلة من لا علم لهم فلذلك نزل فعل { يعلمون } منزلة اللازم ولم يذكر له مفعول .فالمراد ب { أكثَرَ النَّاسِ } هم الذين يجادلون في آيات البعث وهم المشركون ، وأما الذين علموا ذلك فهم المؤمنون وهم أقل منهم عدداً . وإظهار لفظ { الناس } في قوله : { ولكنَّ أكثَر النَّاس لا يعلمون } مع أن مقتضى الظاهر الإضمار ، لتكون الجملة مستقلة بالدلالة فتصلح لأن تَسير مسير الأمثال ، فالمعنى أنهم أنكروا البعث لاستبعادهم خلق الأجسام مع أن في خلق السماوات والأرض ما لا يبقَى معه استبعاد مثل ذلك .\n\n",
      "translations": [
        {
          "translation": "(Assuredly the creation of the heavens and the earth is greater than the creation of mankind) than the creation of the anti-Christ; (but most of mankind) i.e. the Jews (know not) the sedition of the anti-Christ.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن أعظم ما يجادلون فيه أولئك المكابرون أمر السعة والمعاد الجسماني\n وبعث الموتى من قبورهم وحشرهم إلى المحشر\n والله { لَخَلْقُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: إظهار العلويات والسفليات من كتم العدم على سبيل الإبداع في النشأة الأولى { أَكْـبَرُ } وأعظم { مِنْ خَلْقِ ٱلنَّاسِ } وإعادتهم أحياء في النشأة الأخرى { وَلَـٰكِنَّ أَكْـثَرَ ٱلنَّاسِ لاَ يَعْلَمُونَ } [غافر: 57] قدرة الحق واقتداره على جميع ما دخل في حيطة علمه الشامل\n وإرادته الكاملة\n لقصورهم نظرهم عن إدراك الحق وصفاته\n[النور: 40]\n\n\nثم أشار سبحانه إلى تفاوت طبقات عباده في العلم بالله والجهل به وبصفاته\n فقال: { وَمَا يَسْتَوِي ٱلأَعْـمَىٰ } الغافل عن ظهور ذات الحق ومقتضيات أوصافه العظمى وأسمائه الحسنى { وَٱلْبَصِيرُ } العرف الكاشف بوحدة الحق\n وظهوره سبحانه على هياكل جميع ما ظهر وبطن سبحانه حسب أسمائه وشئونه الذاتية { وَ } لا المصلحون المحسنون { ٱلَّذِينَ آمَنُواْ } بالله واعتقدوا بتوحيده { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } المقبولة عنده سبحانه من الأ‘مال والأفعال المترتبة على الإيمان واليقين { وَلاَ ٱلْمُسِيۤءُ } أي: المسيئون الأدب مع الله\n وهم الكفرة الذين لا يؤمنون بالله\n ولا يتصفون بتوحيده\n بل يستروحون شروق شمس ذاته بغيوم هوياتهم الباطلة\n وأظلال أنانياتهم الزائلة المضمونة في شمس الذات\n لذلك عملوا عملاً سيئاً بمقتضى ما تهويه نفوسهم الخبيثة وأخلاقهم السخيفة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لَخلقُ السماوات والأرض أكبرُ من خلقِ الناسِ } \n فمَن قدر على اختراع هذه الأجرام مع عظمها كان على اختراع الإنسان بعد موته وبعثه مع مهانته أقدر\n { ولكن أكثرَ الناس لا يعلمون } ذلك لأنهم لا يتفكرون لغلبة الغفلة عليهم\n وعمى بصيرتهم\n { وما يستوي الأعمى والبصيرُ } أي: الغافل والمستبصر\n { ولا الذين آمنوا وعملوا الصالحات ولا المسيءُ } ولا يستوي المحسن والمسيء\n فلا بد أن تكون لهم حال أخرى\n يظهر فيها ما بين الفريقين من التفاوت\n وهي فيما بعد البعث\n فيرتفع المستبصر المحسن في أعلى عليين\n ويسقط الغافل المسيء في أسفل سافلين\n وزيادة \" لا \" في المسيء لتأكيد النفي لطول الكلام بالصلة\n { قليلاً ما يتذكرون } أي: تذكراً قليلاً يتذكرون\n وقرىء بالغيبة\n والخطاب\n على الالتفات\n { إِنَّ الساعة لآتيةٌ لا ريبَ فيها } لا شك في مجيئها لوضوح دلائلها\n وإجماع الرسل على الوعد بوقوعها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:39",
      "similarity": 0.6580418037833253
    },
    {
      "verse": "30:6",
      "similarity": 0.539535873870236
    },
    {
      "verse": "13:1",
      "similarity": 0.5120890235655124
    },
    {
      "verse": "52:47",
      "similarity": 0.4834271071013362
    },
    {
      "verse": "10:55",
      "similarity": 0.4332848962022581
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040057.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040057.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:57.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}