{
  "chapter": "غافر",
  "text": "انا لننصر رسلنا والذين ءامنوا۟ فى الحيوة الدنيا ويوم يقوم الاشهد",
  "translations": [
    {
      "translation": "We will certainly help Our Messengers and those who have iman both in the life of this world and on the Day the witnesses appear,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will certainly help Our messengers and those who believe, in this world, and on the day the witnesses take their stand,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We shall help Our Messengers and the believers in the life of this world and on the Day when witnesses will rise to testify,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall help Our Messengers and the believers, in this life and on the day when witness will come forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We will surely help Our Noble Messengers, and the believers, in the life of this world and on the day when the witnesses will be standing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We will indeed make victorious Our Messengers and those who believe in this world's life and on the Day when the witnesses will stand forth, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely We help Our apostles, and those who believe, in this world's life and on the day when the witnesses shall stand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We shall help Our Messengers and those who have believed, in the present life, and upon the day when the witnesses arise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We verily do help Our messengers, and those who believe, in the life of the world and on the day when the witnesses arise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely We help our messengers, and those who believe, in the life of this world and on the Day when all the witnesses will stand up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We shall surely succour Our apostles and those who believe, both in the life of the world and on a Day whereon the witnesses will stand forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We shall help Our apostles and those who have faith in the life of the world and on the day when the witnesses rise up,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will, without doubt, help our messengers and those who believe, (both) in this world's life and on the Day when the Witnesses will stand forth,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We will indeed make victorious Our Messengers and those who believe (in the Oneness of Allah Islamic Monotheism) in this world's life and on the Day when the witnesses will stand forth, (i.e. Day of Resurrection),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, We shall help Our Messengers and the believers both in this world and on the Day when the witnesses rise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely We will support Our messengers and those who believe, in this life, and on the Day the witnesses arise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We will support Our messengers and those who believe during the life of this world and on the Day when the witnesses will stand -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:51] Truly We shall help Our messengers and those who believe, in the life of this world and on the day when the witnesses rise up (ashhād is the plural of shāhid) — these are the angels, who will testify in support of the messengers, that they indeed delivered [their Messages], and against the disbelievers, that they denied [them];\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "545 (Lo! We verily do help Our messengers, and those who believe) in the messengers, (in the life of the world) with assistance and victory over their enemies (and on the day) which is the Day of Judgement (when the witnesses arise) the angels will assist them with reasons and proofs while the witnesses are the messengers; it is also said that the witnesses are the guardian angels who will testify about what they did,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَوْمَ يَقُومُ ٱلأَشْهَادُ } معناه الملائكةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّا لننصر رسلنا والذين آمنوا } بالتأييد الملكوتي والنور القدسي في الدارين\n { فاصبر إِن وعد الله حق } أي: احبس النفس عن الظهور في مقابلة أذاهم، واعلم أنك ستغلب حال البقاء والتمكين، إنّا غالبون { واستغفر } لذنب حالك بالتنصل عن أفعالك { وسبح } بالتجريد { بحمد ربك } موصوفاً بكماله دائماً، أي: ما دمت في حال الفناء لا تأمن التلوين بظهور النفس وصفاتها، وجب عليك الصبر والاستغفار والتجريد عن الأوصاف التي تظهر بها النفس، والتحقق بالله وصفاته، فإذا حصل لك مقام الاستقامة والتمكين حال البقاء بعد الفناء فذلك وقت الغلبة وظهور النفس والوفاء بالوعد\n { وقال ربّكم ادعوني أستجب لكم } هذا دعاء الحال، لأن الدعاء باللسان مع عدم العلم بأن المدعوّ به خير له أم لا دعاء المحجوبين، وقال الله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه وعداً للمؤمنين وحثاً لهم على تصديق رسل الله وكتبه: { إِنَّا } من مقام عظيم جودنا ولطفنا { لَنَنصُرُ } ونعاون { رُسُلَنَا } الذين هم حملة وحينا، وحفظة ديننا { وَٱلَّذِينَ آمَنُواْ } لهم، واسترشدوا منهم طريق الهداية، واجتنبوا بسببهم عن الغي والضلا { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } التي هي نشأة الفتن والاختبارات الإلهية، بتوفيقهم على العمل الصالح، وردعهم عن المفاسد والمنكرات، وننصرهم أيضاً نصرة تامة { وَيَوْمَ يَقُومُ ٱلأَشْهَادُ } [غافر: 51] أي: يوم القيامة التي تقوم فيها الشهود والعدول من الملائكة والنبيين والمؤمنين لنصرة المؤمنين ومقت الكافرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا لَننصرُ رُسُلَنا والذين آمنوا في الحياة الدنيا } بالحجّة والظفر، والانتقام لهم من الكفرة، بالاستئصال، والقتل، والسبي، وغير ذلك من العقوبات\n ولا يقدح في ذلك ما يتفق لهم من صورة الغلبة، امتحاناً إذ الحكم للغالب، وهذا كقوله تعالى:\n\n[الصافات: 171] الآية، وقوله:\n\n[المجادلة: 21]\n والنصر في الدنيا إما بالسيف، في حق مَن أمر بالجهاد، أو: بالحجة والإهلاك فيمن لم يؤثر به، وبذلك يندفع قول مَن زعم تخصيص الآية أو تعميمها، وإخراجَ زكريا ويحيى من الرسالة، وإنْ ثبت لهما النبوة لقتلهما، وأن الآية، إنما تضمنت نصر الرسل دون الأنبياء، فإنه خلاف لما صرّح به الجمهور من ثبوت الرسالة ليحيى، ففي كلام ابن جزي هنا نظر\n قاله المحشي\n { ويومَ يقومُ الأشهادُ } أي: وننصرهم يوم القيامة، عبَّر عنه بذلك للإشعار بكيفية النصرة، وأنها تكون حين يجتمع الأولون والآخرون، ويحضره الأشهاد من الملائكة وغيرهم، فيشهدون للأنبياء بالتبليغ، وعلى الكفرة بالتكذيب\n قال النسفي: الأشهاد جمع شاهد، كصاحب وأصحاب، يريد: الأنبياء والحفظة، فالأنبياء يشهدون عند رب العزة على الكفرة بالتكذيب، والحفظة يشهدون على بني آدم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:33",
      "similarity": 0.4232542441033451
    },
    {
      "verse": "6:29",
      "similarity": 0.4020370372821442
    },
    {
      "verse": "16:107",
      "similarity": 0.3941699036257576
    },
    {
      "verse": "23:37",
      "similarity": 0.3705231445239037
    },
    {
      "verse": "100:7",
      "similarity": 0.3622050824325662
    }
  ]
}