{
  "chapter": "غافر",
  "text": "فاصبر ان وعد الله حق واستغفر لذنۢبك وسبح بحمد ربك بالعشى والابكر",
  "translations": [
    {
      "translation": "So remain steadfast. Allah's promise is true. Ask forgiveness for your wrong action and glorify your Lord with praise in the evening and the early morning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So persevere; the promise of God is true; and seek forgiveness for your sins, and chant the praises of your Lord evening and morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be steadfast, then, (O Prophet), Allah's promise is true. Seek forgiveness for your shortcomings, and celebrate the praise of your Lord, evening and morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), exercise patience. The promise of God is true. Seek forgiveness for your sins and glorify your Lord with His praise in the evenings and in the early mornings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be patient (O dear Prophet Mohammed – peace and blessings be upon him), undoubtedly Allah’s promise is true, and seek forgiveness for the sins of your own people, and praising your Lord, proclaim His Purity morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. Verily, the promise of Allah is true, and ask forgiveness for your fault, and glorify the praises of your Lord in the `Ashi and in the Ibkar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be patient; surely the promise of Allah is true; and ask protection for your fault and sing the praise of your Lord in the evening and the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be thou patient; surely God's promise is true. And ask forgiveness for thy sin, and proclaim the praise of thy Lord at evening and dawn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then have patience (O Muhammad). Lo! the promise of Allah is true. And ask forgiveness of thy sin, and hymn the praise of thy Lord at fall of night and in the early hours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient, for what God has promised is sure to come. Ask forgiveness for your sins; praise your Lord morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore persevere thou. Verily the Promise of Allah is true and ask forgiveness for thy fault, and hallow the praise of thy Lord in the evening and in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient! Allah’s promise is indeed true. Plead [Allah] for forgiveness of your sin, and celebrate the praise of your Lord morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Patiently, then, persevere: for the Promise of Allah is true: and ask forgiveness for thy fault, and celebrate the Praises of thy Lord in the evening and in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient (O Muhammad SAW). Verily, the Promise of Allah is true, and ask forgiveness for your fault, and glorify the praises of your Lord in the Ashi (i.e. the time period after the midnoon till sunset) and in the Ibkar (i.e. the time period from early morning or sunrise till before midnoon) [it is said that, that means the five compulsory congregational Salat (prayers) or the 'Asr and Fajr prayers].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore have patience; the promise of Allah is true, and ask forgiveness of your sins, and exalt with the praise of your Lord in the evening and at dawn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. The promise of God is true. And ask forgiveness for your sin, and proclaim the praise of your Lord evening and morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient, [O Muhammad]. Indeed, the promise of Allah is truth. And ask forgiveness for your sin and exalt [Allah] with praise of your Lord in the evening and the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:55] So be patient, O Muhammad (s). Surely God’s promise, to grant victory to His friends, is true — for you and whoever follows you are among such [friends]. And ask forgiveness for your sin, so that you will be emulated in this [by your community], and glorify, perform prayer, continuously, with praise of your Lord at   night — which means after sunset — and in the early hours: the five prayers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then have patience) Muhammad in the face of the harm of the Jews, Christians and idolaters. (Lo! the promise of Allah) to help you and destroy them (is true) will happen. (And ask forgiveness of thy sin) for failing to thank duly the blessings that Allah has bestowed upon you and your Companions, (and hymn the praise of your Lord) and pray by the command of your Lord (at fall of night and in the early hours) in the evening and morning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱصْبِرْ } أنت أيضاً يا أكمل الرسل على ما أصابك من أذيات هؤلاء الجهلة المستكبرين المعاندين معك\n وانتظر إلى ما وعدك الحق من النصر والظفر وإعلاء دين الإسلام\n وإظهاره على الأديان كلها { إِنَّ وَعْدَ ٱللَّهِ } العليم القدير الحكيم الخبير { حَقٌّ } ثابت محقق إنجازه ووفاؤه\n إلا أنه مرهون بوقته\n فيسنصرك ويغلبك على أعدائك عن قريب\n ويبقى آثار هدايتك وإرشادك بين أوليائك إلى النشأة الأخرى { وَٱسْتَغْفِـرْ لِذَنبِكَ } أي: اشتغل في عموم أوقاتك بالاستغفار لفرطاتك\n ليكون استغفارك هذا سنة سنية منك لأمتك { وَسَبِّحْ } أيضاً { بِحَمْدِ رَبِّكَ } في جميع حالاتك وأوقاتك\n إذ كل نفس من أنفاسك يستلزم شكراً منك\n سيما { بِٱلْعَشِيِّ وَٱلإِبْكَارِ } [غافر: 55] أي: في أول النهار وأواخره\n إذ هما وقتان خاليان عن تزاحم الأشغال وتفاقم الآمال\n وبالجملة: كن مع ربك في جميع أحوالك وأطوارك\n يكفي مؤنة جميع من عاداك وعاندك\n\n\nثم قال سبحانه: { إِنَّ } المشركين المعاندين { ٱلَّذِينَ يُجَادِلُونَ } ويخاصمون معك يا أكمل الرسل { فِيۤ آيَاتِ ٱللَّهِ } المنزلة عليك لتأييد دينك وشأنك على سبيل المكابرة والعناد { بِغَيْرِ سُلْطَانٍ } أي: حجة وبرهان { أَتَاهُمْ } وفاض عليهم من ربهم على طريق الوحي والإلهام { إِن فِي صُدُورِهِمْ } أي: ما في صدورهم وضمائرهم شيء يبعثهم على المجادلة { إِلاَّ كِبْرٌ } وخيلاء مركوز في جبلتهم\n تقية لثروتهم ورئاستهم على زعمهم الفاسد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { فاصبرْ إِنَّ وَعْدَ الله حقٌّ } أي: فاصبر على ما يُجرّعك قومك من الغُصَص { إِنَّ وعد الله } بنصرك وإعلاء دينك\n على ما نطق به قوله تعالى:\n[الصافات: 171 ـ 173]\n { حقٌّ } لا يحتمل الاختلاف بحال\n قال الطيبي: الآية تشير إلى نصره على أعدائه\n كموسى\n وأنه يظهر دينه على الدين كله\n ويورث كتابه ليعتصموا به\n فيكون لهم هُدًى وذكرى\n وعزّاً وشرفاً\n هـ\n أي: ولذلك قدّم ذكر موسى على بشارته بالنصر ليتم التشبيه\n { واستغفر لذنبك } \n تشريعاً لأمتك فإِنَّ الاستغفار يمحو الذنوب التي تعوق عن النصر\n أو: تداركاً لِمَا فرط منك من ترك الأَوْلَى في بعض الأحايين\n فإِنَّ حسنات الأبرار سيئات المقربين\n والحاصل: أن كل مقام له ذنب يليق به\n وهو التقصير في القيام به على ما يليق به\n فالنبي صلى الله عليه وسلم كُلف بدوام الشهود ولو في حال التعليم\n فإذا غاب عن الحق لحظة بشغل البال بالتعليم\n كان في حقه نقصاً يُوجب الاستغفار\n ثم قال: { وسبّحْ بحمد ربك بالعشيّ والإِبكار } أي: دُم على التسبيح ملتبساً بحمده\n أي: قل: سبحان الله وبحمده\n أو: صَلّ في هذين الوقتين\n إذ كان الواجب بمكة ركعتين بكرة وعشيّاً\n وقيل: هما صلاة العصر والفجر\n خصصهما لشرفهما\n { إِنَّ الذين يُجادلون في آياتِ الله } ويجحدونها { بغير سُلطانٍ } برهان { أتاهُم } من جهته تعالى\n بل عناداً وحسداً\n وتعليق المجادلة بذلك\n مع استحالة إتيانه للإيذان بأن التكلم في أمر الدين لا بد من استناده إلى برهان\n وهذا عام لكل مجادل\n محق أو مبطل\n وإن نزل في مشركي مكة\n وقوله: { إِن في صُدورِهم إِلا كِبْرٌ }: خبر \" إِنْ \" \n أي: ما في قلوبهم إلا تكبُّر عن الحق\n وتعاظم عنه\n وهو إرادةُ التقدم والرئاسة\n وألا يكون أحدٌ فوقهم\n فلذلك عادوك\n ودفعوا آياتك\n خيفة أن تتقدمهم\n ويكونوا تحت قهرك لأن النبوة تحتها كُل ملك ورئاسة\n أو: إرادة أن تكون لهم النبوة دونك\n حسداً وبغياً\n كقولهم:\n[الزخرف: 31]\n\n[الأحقاف: 11]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:11",
      "similarity": 0.6380417746269953
    },
    {
      "verse": "19:62",
      "similarity": 0.6065010064863722
    },
    {
      "verse": "56:36",
      "similarity": 0.5130624218955597
    },
    {
      "verse": "30:18",
      "similarity": 0.45912063536131487
    },
    {
      "verse": "54:38",
      "similarity": 0.44234747851427575
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/40:55.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/40:55.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/40:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}