{
  "chapter": "غافر",
  "text": "يوم لا ينفع الظلمين معذرتهم ولهم اللعنة ولهم سوء الدار",
  "translations": [
    {
      "translation": "the Day when the excuses of the wrongdoers will not help them. The curse will be on them and they will have the most evil Home.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day upon which their excuses will not benefit the evil-doers, and the condemnation and evil abode will be theirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when the excuses offered by the wrong-doers shall not avail them. They shall be victims of the curse and a woeful abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The excuses of the unjust will be of no benefit to them on that day. They will be condemned to live in a most terrible abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which the unjust will not gain any benefit from their excuses, and for them is the curse, and for them is the wretched home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their excuses will be of no profit to wrongdoers. Theirs will be the curse, and theirs will be the evil abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which their excuse shall not benefit the unjust, and for them is curse and for them is the evil abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon the day when their excuses shall not profit the evildoers, and theirs shall be the curse, and theirs the evil abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when their excuse availeth not the evil-doers, and theirs is the curse, and theirs the ill abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their excuses will be of no avail to the wrongdoers, the curse shall be their lot and they will have the most evil abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Day whereon their excuse will not Profit the wrong- doers; and theirs Will be the curse and theirs the evil Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when the excuses of the wrongdoers will not benefit them, the curse will lie on them, and for them will be the ills of the [ultimate] abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when no profit will it be to Wrong-doers to present their excuses, but they will (only) have the Curse and the Home of Misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their excuses will be of no profit to Zalimun (polytheists, wrong-doers and disbelievers in the Oneness of Allah). Theirs will be the curse, and theirs will be the evil abode (i.e. painful torment in Hell-fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day no excuse will benefit the harmdoers. Theirs shall be the curse, and an evil lodging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their excuses will not profit the wrongdoers, and the curse will be upon them, and they will have the Home of Misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day their excuse will not benefit the wrongdoers, and they will have the curse, and they will have the worst home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:52] the day when their excuses will not benefit (read lā yanfa‘u, or lā tanfa‘u) the evildoers, [even] if they were to offer them, and theirs will be the curse, in other words, the banishment from [God’s] Mercy, and theirs will be the ills of the [ultimate] abode, in the Hereafter, meaning, the most severe of its chastisements.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The day when their excuse) for disbelieving (availeth not the evil-doers) the disbelievers, (and theirs is the curse) wrath and torment, (and theirs the ill abode) the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَ لاَ يَنفَعُ ٱلظَّالِمِينَ } الخارجين عن مقتضى الحدود الإلهية في نشأة الدنيا { مَعْذِرَتُهُمْ } التي آتوا بها يومئذ؛ إذ قد انقضى حينئذ وقت التلافي والتدارك، ومضى زمان الاختبار، بل { وَلَهُمُ ٱلْلَّعْنَةُ } أي: الطرد والتبعيد عن ساحة عز الحضور { وَلَهُمْ } أيضاً { سُوۤءُ ٱلدَّارِ } [غافر: 52] المعدة لأصحاب الخسار والبوار، وهي جهنم البعد والخذلان، أعاذنا الله منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يوم لا ينفعُ الظالمين معذرتُهم }: هو بدل من { يوم يقوم } أي: لا يقبل عذرهم، ومَن قرأ بالتأنيث فباعتبار لفظ المعذرة، { ولهم اللعنةُ } أي: البُعد من الرحمة، { ولهم سوءُ الدار } أي: سوء دار الآخرة، وهو عذابها\n الأشارة: كما نُصرت الرسل بعد الامتحان، نُصرت الأولياء بعد الامتحان والامتكان\n قال الشاذلي رضي الله عنه: اللهم إنَّ القوم قد حكمت عليهم بالذُل ّ حتى عزوا\n\n إلخ\n وهم داخلون في قوله: { والذين آمنوا في الحياة الدنيا } ، ونصرتهم تكون أولاً بالظفر بنفوسهم، ثم بالغيبة عن حس الكائنات، باتساع دائرة المعاني، ثم بالتصرف في الوجود بأسره بهمته\n قال القشيري: ويقال: ينصرهم على أعدائهم بلطف خفيّ، وكيد غير مرئيّ، من حيث يحتسب أو لا يحتسب، كما ينصرهم في الدنيا على تحقيق المعرفة، واليقين بأنَّ الكائنات من الله\n ثم قال: غاية النصرة أن يَقتُلَ الناصرُ عدوَّ مَنْ ينصره، فإذا رآه حقق له أنه لا عَدُو له في الحقيقة، وأنَّ الخلق أشباحٌ، وتجري عليهم أحكام القدرة، فالولِيُّ لا عدوَّ له ولا صديق، ليس له إلا الله\n قال الله تعالى:\n",
      "translations": []
    }
  ]
}