{
  "chapter": "غافر",
  "text": "وكذلك حقت كلمت ربك على الذين كفروا۟ انهم اصحب النار",
  "translations": [
    {
      "translation": "In this way the sentence of your Lord against the infidels that they would be the inmates of Hell, was justified.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus has the decree of your Lord become due against the unbelievers. They are destined for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word of your Lord that the disbelievers will be the dwellers of hell fire has already been decreed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how the Word of your Lord has proved true upon the disbelievers that they are people of the hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus has the Word of your Lord been justified against those who disbelieved, that they will be the dwellers of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus did the word of your Lord prove true against those who disbelieved that they are the inmates of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so the Word of thy Lord was realised against the unbelievers, that they are the inhabitants of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus was the word of thy Lord concerning those who disbelieve fulfilled: That they are owners of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus has the word of your Lord come true against the deniers; they shall be the inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus hath the Word of thy Lord been justified on those who disbelieve: that they shall be the fellows of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how the word of your Lord became due concerning the faithless, that they shall be inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus was the Decree of thy Lord proved true against the Unbelievers; that truly they are Companions of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus has the Word of your Lord been justified against those who disbelieved, that they will be the dwellers of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so it is that the Word of your Lord shall be realized against the unbelievers they are the inhabitants of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the sentence of your Lord became realized against those who disbelieve, that they are to be inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus has the word of your Lord come into effect upon those who disbelieved that they are companions of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:6] And thus was the word of your Lord — namely, the verse: Assuredly I will fill Hell … [Q. 11:119] — fulfilled against those who disbelieve: that they shall be the inhabitants of the Fire (annahum ashābu’l-nāri substitutes for kalimatu, ‘the word’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus was the word of thy Lord) to punish (concerning those who disbelieve) in the messengers (fulfilled) ordained: (that they are owners of the Fire) that they are the inhabitants of the Fire in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذَلِكَ حَقَّتْ } وثبتت { كَلِمَةُ رَبِّكَ } يا أكمل الرسل في لوح قضائه وحضرة علمه { عَلَى ٱلَّذِينَ كَفَرُوۤاْ } بك وبدينك وكتابك { أَنَّهُمْ أَصْحَابُ ٱلنَّارِ } [غافر: 6] أي: ملازموها وملاصقوها أبد الآباد، لا نجاة لهم منها، فـ\n\n[النحل: 127]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}