{
  "chapter": "غافر",
  "text": "وقال ربكم ادعونى استجب لكم ان الذين يستكبرون عن عبادتى سيدخلون جهنم داخرين",
  "translations": [
    {
      "translation": "Your Lord says, 'Call on Me and I will answer you. Those who who are too proud to worship Me will enter Hell abject.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said: \"Call to Me that I may answer your call. Surely those who disdain worshipping Me will enter Hell, disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord said: “Pray to Me, and I will accept your prayers. Surely those who wax too proud to worship Me shall enter Hell, utterly abased.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said, \"Pray to Me for I shall answer you prayers. Those who are too proud to worship Me will soon go to hell in disgrace\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord proclaimed, “Pray to Me, I will accept; indeed those who stay conceited towards worshipping Me, will enter hell in disgrace.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord said: \"Call upon Me, I will answer you. Verily, those who scorn My worship they will surely enter Hell in humiliation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord says: Call upon Me, I will answer you; surely those who are too proud for My service shall soon enter hell abased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said, 'Call upon Me and I will answer you. Surely those who wax too proud to do Me service shall enter Gehenna utterly abject.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord hath said: Pray unto Me and I will hear your prayer. Lo! those who scorn My service, they will enter hell, disgraced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said, \"Call on Me, and I will answer your prayers.\" But those who are too arrogant to worship Me will certainly enter Hell, in disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord hath said: call Unto Me, and I shall answer your prayer. Verily those who are stiff-necked against My worship, anon they will enter Hell abject.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said, ‘Call Me, and I will hear you!’ Indeed those who are disdainful of My worship will enter hell in utter humiliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord says: \"Call on Me; I will answer your (Prayer): but those who are too arrogant to serve Me will surely find themselves in Hell - in humiliation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord said: \"Invoke Me, [i.e. believe in My Oneness (Islamic Monotheism)] (and ask Me for anything) I will respond to your (invocation). Verily! Those who scorn My worship [i.e. do not invoke Me, and do not believe in My Oneness, (Islamic Monotheism)] they will surely enter Hell in humiliation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said: 'Call on Me and I will answer you. Those who are too proud to worship Me shall enter Gehenna utterly abject'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has said, “Pray to Me, and I will respond to you. But those who are too proud to worship Me will enter Hell forcibly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:60] And your Lord has said, ‘Call on Me and I will respond to you, in other words, worship Me and I will reward you — judging [this to be the meaning] by what follows. Surely those who disdain to worship Me shall enter (sa-yadkhulūna, or [passive] sa-yudkhalūna, ‘they shall be admitted into’) Hell [utterly] humiliated’, abased.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And your Lord hath said: Pray unto me) profess My divine Oneness (and I will hear your prayer) I will forgive you; it is also said that this means: pray unto Me; I will hear your prayers and accept them from you. (Lo! those who scorn My service) My divine Oneness and obedience, (they will enter hell, disgraced) humiliated.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ } معناه صاغرونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"They will enter Paradise, humbled,\" means that they will enter as lowly ones.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أشار سبحانه إلى مرتبة كلا الفريقين الموعد والمشرك، أشار إلى أن من توجه نحوه محنناً، وقصد تجاه توحيده مجتهداً، ودعا إليه متضرعاً، أجاب له وأنجح مطلوبه؛ حيث { قَالَ رَبُّكُـمُ } الذي رباكم على فطرة التوحيد والعرفان: { ٱدْعُونِيۤ } أيها المكلفون بمقتضى العقل المفاض حق دعوتي، وتوجهوا إلى مخصلين بلا رؤية الأسباب والوسائل في البين { أَسْتَجِبْ لَكُمْ } دعوتكم، وأوصلكم إلى مقصدكم ومقصودكم الذي هو توحيد الذات، فعليكم ألاَّ تستكبروا عن عبادتي وإطاعتي، وبالجملة: { إِنَّ } المسرفين { ٱلَّذِينَ يَسْتَكْبِرُونَ } ويستكنفون { عَنْ عِبَادَتِي } بمقتضى أرائهم الباطلة وأهوائهم الفاسدة { سَيَدْخُلُونَ } في يوم الجزاء { جَهَنَّمَ } الحرمان والخذلان { دَاخِرِينَ } [غافر: 60] صاغرين ذليلين مهانين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقال ربُّكُم ادعوني } أي: اعبدوني { أَستجبْ لكم } أي: أثبكم، ويدل على هذا قوله: { إِن الذين يستكبرون عن عبادتي سيدخلون جهنّم داخرين } صاغرين أذلاء، أو: اسألوني أعطكم، على ما أريد، في الوقت الذي أريد\n قال القشيري: والحكمة في أنه أمر بالسؤال قبل الإجابة، وبالاستغفار قبل المغفرة، أنه حكم في اللوح أن يعطيك ذلك الشيء الذي تسأله وإن لم تسأل، ولكن أمر بالسؤال، حتى إذا وجدته تظن أنك وجدته بدعائك، فتفرح به\n قلت: السؤال سبب، والأسباب غطى بها سر قدرته تعالى\n ثم قال: ويقال: إذا ثبت أن هذا الخطاب للمؤمنين فما مِن مؤمنٍ يدعو الله، ويسأله شيئاً، إلا أعطاه إياه، إما في الدنيا، وإما في الآخرة\n حيث يقال له: هذا ما طلَبْتَه في الدنيا، وقد ادخرتُه لك إلى هذا اليوم، حتى يَتَمنى العبدُ أنه لم يُعطَ شيئاً في الدنيا\n هـ\n قلت: فالدعاء كله إذاً مستجاب، بوعد القرآن، لكن منه ما يُعجّل، ومنه ما يُؤجّل، ومنه ما يصرف عنه به البلاء، كما في الأثر، وإذا فسر الدعاء بالسؤال كان الاستكبار عنه منزلاً منزلة الاستكبار عن العبادة للمبالغة في الحث عليه\n قال صلى الله عليه وسلم:\n\n \" الدعاء هو العبادة \" \n\nوقرأ الآية، وفي رواية:\n\n \" مخ العبادة \" \n\n، وعن ابن عباس:\n\n \" وحَدوني أغفر لكم \" \n\n، فسَّر الدعاء بالعبادة، والعبادة بالتوحيد\n الإشارة: اختلف الصوفية أيّ الحالين أفضل؟ هل الدعاء والابتهال، أو السكوت والرضا؟ والمختار أن ينظر العبد ما يتجلّى فيه قلبه، فإن انشرح للدعاء فهو في حقه أفضل، وإن انقبض عنه، فالسكوت أولى، والغالب على أهل التحقيق من العارفين، الغنى بالله، والاكتفاء بعلمه، كحال الخليل عليه السلام، فإنهم إبراهيميون\n قال الورتجبي: أي: ادعوني في زمن الدعاء الذي جعلته خاصّاً لإجابة الدعوة، فادعوني في تلك الأوقات، أستجب لكم فإنَّ وقوع الإجابة فيها حقيقة بلا شك، ومَن لم يعرف أوقات الدعاء، فدعاؤه ترك أدب فإن الدعاء في وقت الاستغفار من قلة معرفة المقامات، فإن السلطان إذا كان غضبان لا يُسأل منه، وإذا كان مستبشراً فيكون زمانه زمن العطاء والكرم\n قلت: هذا في حق الخصوص، الفاهمين عن الله، وأما العموم، فما يناسبهم إلا دوام الدعاء في الرخاء والشدة: قال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:18",
      "similarity": 0.8569354174212228
    },
    {
      "verse": "27:87",
      "similarity": 0.5706580723814382
    },
    {
      "verse": "16:48",
      "similarity": 0.5518505331972091
    },
    {
      "verse": "7:194",
      "similarity": 0.18431599804495188
    },
    {
      "verse": "2:186",
      "similarity": 0.1660787451513528
    }
  ]
}