{
  "chapter": "غافر",
  "text": "ذلكم الله ربكم خلق كل شىء لا اله الا هو فانى تؤفكون",
  "translations": [
    {
      "translation": "He is God your Lord, creator of everything. There is no god but He. How then do you turn away (from Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah (Who bestowed all these favours upon you) is your Lord, the Creator of everything. There is no god but He. Whence are you, then, being led astray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God, your Lord, Who has created all things. He is the only Lord. Why then do you turn away from His worship to the worshipping of idols?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord, the Creator of all things; there is no God except Him; so where are you reverting?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, the Creator of all things, La ilaha ila Huwa. How then are you turning away\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, the Creator of everything; there is no Allah but He; whence are you then turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That then is God, your Lord, the Creator of everything; there is no god but He. How then are you perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord, the Creator of all things, There is no Allah save Him. How then are ye perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God, your Lord, the Creator of all things. There is no god but He. How then are you being turned away [from Him]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah. your Lord, the Creator of everything there is no God but He. Wither then are ye straying away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, the creator of all things, there is no god except Him. Then where do you stray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord, the Creator of all things, there is no god but He: Then how ye are deluded away from the Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, the Creator of all things, La ilaha illa Huwa (none has the right to be worshipped but He), where then you are turning away (from Allah, by worshipping others instead of Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord, the Creator of all things. There is no god except He. How then can you turn away from Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God, your Lord, Creator of all things. There is no god except Him; so how could you turn away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, Creator of all things; there is no deity except Him, so how are you deluded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:62] That then is God, your Lord, the Creator of all things; there is no god except Him. How then are you made to deviate?, how then are you turned away from faith, despite the evidence having been established [for it]?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such is Allah, your Lord) the one who does all that is your Lord, therefore give thanks to Him, (the Creator of all things. There is no God) there is no Creator (save Him. How then are ye perverted) from whence do you then lie against Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَٰلِكُمُ ٱللَّهُ } الذي أفاض عليكم موائد بره وإحسانه، وأظهر عليكم مقتضيات ألوهيته وربوبيته { رَبُّكُمْ } الذي رباكم بأنواع اللطف والكرم، بعدما أوجدكم من كتم العدم؛ إذ هو { خَـٰلِقُ كُلِّ شَيْءٍ } ومظهره من العدم إظهاراً إبداعياً بمقتضى اختياره واستقلاله، فلكم أن تتوجهوا إليه وتتحنثوا نحوه مخصلين؛ إذ { لاَّ إِلَـٰهَ } يعبد له بالاستحقاق، ويرجع إليه في الخطول على الإطلاق { إِلاَّ هُوَ } الذات الواحدة الموصوفة بالصفات الكاملة، المربية لجميع ما في الكون من العكوس والأظلال المنعكسة منها { فَأَنَّىٰ تُؤْفَكُونَ } [غافر: 62] وتنصرفون عن عبادته أيها الآفكون المنصرفون؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلكمُ الله } أي: ذلكم المنفرد بالأفعال المقتضية للألوهية، من خلق الليل والنهار هو الله { ربكُم } لا ربّاً غيره، { خالقُ كل شيء لا إِله إِلا هو } أخبار مترادفة، أي: الجامع لهذه الأوصاف من الإلهية والربوبية، وإيجاد الأشياء، والوحدانية، { فأنَّى تُؤفكون } أي: فكيف، ومِن أيّ وجه تُصرفون عن عبادته إلى عبادة الأوثان؟! { كذلك يُؤفك الذين كانوا بآياتِ الله يجحدون } أي: مثل ذلك الإفك العجيب، الذي لا وجه له، ولا مصحح له أصلاً، يُؤفك كلُّ مَن جحد بآياته تعالى من غير تروٍّ ولا تأمُّل",
      "translations": []
    }
  ]
}