{
  "chapter": "غافر",
  "text": "الم تر الى الذين يجدلون فى ءايت الله انى يصرفون",
  "translations": [
    {
      "translation": "Have you not seen how those who dispute the signs of God are turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who dispute concerning Allah's Signs? Whence are they, then, being turned astray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how those who dispute the revelations of God, turn away from Truth to falsehood?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who dispute concerning the signs of Allah? Where are they being diverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not those who dispute about the Ayat of Allah How are they turning away\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who dispute with respect to the communications of Allah: how are they turned away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who dispute concerning the signs of God, how they are turned about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen those who wrangle concerning the revelations of Allah, how they are turned away? -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how those who dispute God's signs, are turned away from the right path --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observest thou not those who wrangle concerning the revelations of Allah: whither are they turning away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who dispute the signs of Allah, where they are being led away [from Allah’s way]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not those that dispute concerning the Signs of Allah? How are they turned away (from Reality)?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not those who dispute about the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah? How are they turning away (from the truth, i.e. Islamic Monotheism to the falsehood of polytheism)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how those who dispute about the verses of Allah how they are turned about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not observed those who dispute regarding God's revelations, how they have deviated?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not consider those who dispute concerning the signs of Allah - how are they averted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:69] Have you not regarded those who dispute the signs of God, the Qur’ān, how they are turned away?, from faith —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed, Muhammad, in the Qur'an about (those who wrangle concerning the revelations of Allah) those who deny the Qur'an, (how they are turned away) by lies: so why do they lie against Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع سرعة نفوذ قضاء الله، وظهور هذه الآثار العظيمة من قدرته الكاملة على الوجه المذكور { أَلَمْ تَرَ } أيها الرائي { إِلَى } المشركين المسرفين { ٱلَّذِينَ يُجَادِلُونَ } ويكابرون { فِيۤ آيَاتِ ٱللَّهِ } الدالة على كمال علمه وقدرته، ومتانة حكمه وحكمته { أَنَّىٰ يُصْرَفُونَ } [غافر: 69] أي: إلى أين ينصرفون عن عبادته، ويعرضون عن ساحة عز الوحدة الذاتية؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الذين يُجادلون }: بدل من الموصول قبله المجرور، أو: رفع، أو: نصب على الذم\n يقول الحق جلّ جلاله: { أَلَمْ تَرَ إِلى الذين يُجادلون في آيات الله } ، كرر الحق تعالى الجدال في هذه السورة ثلاث مرات، فإما أن يكون في ثلاث طوائف: الأول في قوم فرعون، والثاني في اليهود، والثالث في المشركين، وإما للتأكيد، أي: انظر إلى هؤلاء المكابرين المجادلين في آيات الله الواضحة، الموجبة للإيمان بها، الزاجرة عن الجدال فيها، { أَنَّى يُصْرَفُون } أي: كيف يُصرفون عنها، مع تعاضد الدواعي إلى الإقبال عليها، وانتفاء الصوارف عنها بالكلية",
      "translations": []
    }
  ]
}