{
  "chapter": "غافر",
  "text": "الله الذى جعل لكم اليل لتسكنوا۟ فيه والنهار مبصرا ان الله لذو فضل على الناس ولكن اكثر الناس لا يشكرون",
  "translations": [
    {
      "translation": "It is God who made the night for you to rest, the day to make things visible. Indeed God is gracious to men, but most men are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who made the night so that you may seek repose in it, and made the day radiant. Surely Allah is Most Bounteous to people; but most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God Who has made the night for you to rest and the day for you to see. God is Benevolent to the human being, but most people do not give Him due thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created night for you so that you may gain rest in it, and the day giving sight; indeed Allah is Most Munificent towards mankind, but most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, it is He Who has made the night for you that you may rest therein and the day for you to see. Truly, Allah is full of bounty to mankind; yet, most of mankind give no thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who made for you the night that you may rest therein and the day to see; most surely Allah is Gracious to men, but most men do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who made for you the night, to repose in it, and the day, to see. Surely God is bountiful to men, but most men are not thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath appointed for you night that ye may rest therein, and day for seeing. Lo! Allah is a Lord of bounty for mankind, yet most of mankind give not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has given you the night in which to rest and the day in which to see. God is truly bountiful to people, but most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is who hath appointed for you the night that ye may repose therein, and day enlightening. Verily Allah is the Lord of Grace for mankind; bur most of mankind return not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who made the night for you, that you may rest in it, and the day to provide visibility. Indeed Allah is gracious to mankind, but most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has made the Night for you, that ye may rest therein, and the days as that which helps (you) to see. Verily Allah is full of Grace and Bounty to men: yet most men give no thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, it is He Who has made the night for you that you may rest therein and the day for you to see. Truly, Allah is full of Bounty to mankind, yet most of mankind give no thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who made for you the night in which to rest and the day to see. Allah is bountiful to the people, yet most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God Who made the night for you, that you may rest therein; and the day allowing sight. God is gracious towards the people, but most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who made for you the night that you may rest therein and the day giving sight. Indeed, Allah is full of bounty to the people, but most of the people are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:61] God it is Who made for you night that you may rest in it, and day for seeing — the attribution of sight (ibsār) to ‘day’ is figurative, and it is [so attributed] because one is able to see in it. Surely God is a Lord of bounty to mankind, but most people are not thankful, to God, and so they do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah it is Who hath appointed) created (for you night that ye may rest therein) that you may rest at night, (and day for seeing) in order to see what you seek. (Lo! Allah is a Lord of bounty for mankind) for the people of Mecca, (yet most of mankind) the people of Mecca (give not thanks) for His bounties nor believe in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يستنكفون ويستكبرون عن عبادة الفاعل على الإطلاق، والمنعم بالاستقلال والاستحقاق مع أنه { ٱللَّهُ } الواحد الأحد الصمد، المتصف بصفات الكمال ونعوت الجلال والجمال، هو { ٱلَّذِي جَعَلَ لَكُمُ ٱللَّيْلَ } مظلماً بارداً { لِتَسْكُنُواْ } وتستريحوا بلا ضرر وإضرار { فِيهِ } جعل لكم { وَ } لتكتسبوا فيه معايشكم، وتجمعوا حوائجكم { ٱلنَّهَـارَ مُبْصِـراً } المنعم المكرم على عباده { إِنَّ ٱللَّهَ } عظيم وكرامة كاملة شاملة { لَذُو فَضْلٍ } عموم { عَلَى } المجبولين على النسيان والكفران { ٱلنَّاسِ وَلَـٰكِنَّ أَكْـثَرَ ٱلنَّاسِ لاَ يَشْكُرُونَ } [غافر: 61] نعمه، ولا يواظبون على أداء حقوق كرمه، جهلاً منهم بالله، وعناداً مع رسله الهادين إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { الله الذي جعلَ لكم الليلَ لتسكنوا فيه } بأن خلقه مظلماً بارداً، تقلّ فيه الحركات فتستريح فيه الجوارح، { و } جعل { النهارَ مبصراً } أي: مبصَراً فيه\n فأسند الإبصار إلى النهار، مجازاً، والأصل في الحقيقة لأهل النهار\n وقرن الليل بالمفعول له، والنهار بالحال، ولم يكونا حالين أو مفعولاً لهما رعايةً لحق المقابلة، لأنهما متقابلان معنىً لأن الليل مقابل النهار، فلما تقابلا معنىً تقابلا لفظاً، مع أن كل واحد منهما يؤدي مؤدى الآخر، ولأنه لو قيل: لتُبصروا فيه فاتت الفصاحة التي في الإسناد مجازي، ولو قيل: \" ساكناً \" لم تتميز الحقيقة من المجاز، إذ الليل يوصف بالسكون على الحقيقة، ألا ترى إلى قولهم: ليل ساج، أي: ساكن لا ريحَ فيه\n { إِنَّ الله لذو فضلٍ } عظيم { على الناس } ، حيث تفضَّل عليهم بهذه النعم الجسيمة، وإنما لم يقل: المتفضل لأن المراد تكثير الفضل، وأنه فضله لا يوازيه فضل، فالتنكير للتعظيم\n { ولكنَّ أكثرَ الناس لا يشكرون } لجهلهم بالمنعم، وإغفالهم مواضع النعم\n وتكرير الناس، ولم يقل: أكثرهم لتخصيص الكفران بهم، وأنهم هم الذين من شأنهم الكفران، كقوله:\n\n[الحج: 66]",
      "translations": []
    }
  ]
}