{
  "chapter": "غافر",
  "text": "هو الحى لا اله الا هو فادعوه مخلصين له الدين الحمد لله رب العلمين",
  "translations": [
    {
      "translation": "He is the Living - there is no god but Him - so call on Him, making your deen sincerely His. Praise be to Allah, the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the living. There is no god but He. Therefore pray to Him with obedience all-exclusive. Praise be to God, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Ever-Living: there is no god but He. So call upon Him, consecrating to Him all your devotion. All praise and thanks be to Allah, the Lord of the whole Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Everlasting and the only Lord. So worship Him and be devoted to His religion. It is only God, the Lord of the Universe who deserves all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He, the Alive – there is no God except Him; therefore worship Him as His sincere bondmen; all praise is to Allah, the Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Ever Living, La ilaha illa Huwa; so invoke Him making the religion for Him Alone. All the praises and thanks be to Allah, the Lord of all that exits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living, there is no god but He, therefore call on Him, being sincere to Him in obedience; (all) praise is due to Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living One; there is no god but He. So call upon Him, making your religion His sincerely. Praise belongs to God, the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living One. There is no Allah save Him. So pray unto Him, making religion pure for Him (only). Praise be to Allah, the Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living One. There is no deity save Him. So pray to Him, making religion pure for Him [only]. Praise be to God, the Lord of the Universe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living: there is no god but He so call upon Him, making religion pure for Him. All praise Unto Allah, the Lord of the worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living One, there is no god except Him. So supplicate Him, putting exclusive faith in Him. All praise belongs to Allah, Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living (One): There is no god but He: Call upon Him, giving Him sincere devotion. Praise be to Allah, Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Ever Living, La ilaha illa Huwa (none has the right to be worshipped but He), so invoke Him making your worship pure for Him Alone (by worshipping Him Alone, and none else, and by doing righteous deeds sincerely for Allah's sake only, and not to show off, and not to set up rivals with Him in worship). All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living; there is no god except He. Supplicate to Him and make the religion sincerely His. Praise belongs to Allah, Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Living One. There is no god except He. So pray to Him, devoting your religion to Him. Praise be to God, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Ever-Living; there is no deity except Him, so call upon Him, [being] sincere to Him in religion. [All] praise is [due] to Allah, Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:65]   He is the Living; there is no god except Him. So supplicate Him, worship Him, devoting [your] religion purely to Him, [free] from any idolatry. Praise be to God, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is the Living One) who dies not. (There is no God) who does this (save Him. So pray unto Him) so profess His divine Oneness, (making religion pure for Him (only)) making your worship and profession of Allah's divine Oneness sincere to Him. (Praise be to Allah) gratitude and lordship belong to Allah, (the Lord of the Worlds) the Lord of all that which has a spirit and moves on the face of the earth!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { هُوَ ٱلْحَيُّ } الأزلي الأبدي الدائم، المستغني عن مقدار الزمان ومكيال المكان مطلقاً { لاَ إِلَـٰهَ } في الوجود سواه، ولا موجود يعبد بالحق { إِلاَّ هُوَ } وبعدما سمعتم أيها المكلفون خواص أسمائه وصفاته سبحانه { فَـٱدْعُوهُ مُخْلِصِينَ } واعبدوه مخصصين { لَهُ ٱلدِّينَ } أي: العبادة والانقياد؛ إذ لا مستحق للإطاعة والعبادة سواه، وبعدما رجعتم نحوه مخلصلين، وعبدتم له مخصصين، قولوا بلسان الجمع: { ٱلْحَـمْدُ } المستوعب لجميع المحامد الناشئة من ألسنة عموم المظاهر ثابت { للَّهِ رَبِّ ٱلْعَالَمِينَ } [غافر: 65] لانفراده في الألوهية، واستقلاله في الربوبية بلا توهم الشركة والمظاهرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هو الحيُّ } المنفرد بالحياة الذاتية الحقيقية، { لا إِله إِلا هو } إذْ لا موجود يدانيه في ذاته وصفاته وأفعاله، { فادعوه } فاعبدوه { مخلِصين له الدينَ } أي: الطاعة من الشرك والرياء، وقولوا: { الحمد لله ربِّ العالمين }\n\n\nعن ابن عباس رضي الله عنه: مَن قال \" لا إله إلا الله \" فليقل على إثرها: الحمد لله رب العالمين\n الإشارة: الله هو الذي جعل ليل القبض لتسْكنوا فيه عند الله، ونهار البسط لتُبصروا نعم الله، فتشكروا لتبتغوا زيادة فضله، وجعل أرض النفوس قراراً لقيام وظائف العبودية، وسماء الأرواح مرقى لشهود عظمة الربوبية\n قال القشيري: سكونُ الناس بالليل ـ أي: الحسي ـ على أقسام: فأهل الغفلة يسكنون مع غفلتهم، وأهل المحبة يسكنون بحكم وصلتهم، فشتّان بين سكون غفلةٍ، وسكونِ وصلة، وقومٌ يسكنون إلى أمثالهم وأشكالهم، وقومٌ إلى حلاوة أعمالهم، وبسطهم، واستقبالهم، وقومٌ يعدِمون القرار في ليلهم ونهارهم ـ أي: لا يسكنون إلى شيء ـ أولئك أصحابُ الاشتياق، أبداً في الإحراق هـ\n  وقوله تعالى: { وصَوَّرَكُم } أي: صَوَّر أشباحكم، فأحسن صورتها، حيث بهَّجها بأنوار معرفته\n قال الورتجبي: فأحْسن صُوَرَكم بأن ألبستكم أنوار جلالي وجمالي، واتخاذِكم بنفسي، ونفخت من روحي فيكم، الذي أحسن الهياكل مِن حسنه، ومِن عكْس جماله، فإنه مرآة نوري الجلي للأشباح\n هـ\n قال القشيري: خَلَقَ العرشَ والكرسي والسمواتِ والأرض، وجميع المخلوقات، ولم يقل في شيء منها: فأحسن صورها، بل قاله لمّا خلق هذا الإنسان، وليس الحَسَنَ ما يستحسنه الناسُ، ولكن الحسنُ ما يستحسنه الحبيبُ، وأنشدوا:\n\nلم يَقُلْ للشمس في عُلاها، ولا للأقمار في ضيائها: فأَحسنَ صُوَرَكم ولما انتهى إلينا قال:\n\n[التين: 4]\n ثم قال: وكما أحسن صُوركم محى من ديوانكم الزلاّت، وأثبت الحسنات، قال الله تعالى:\n\n[الرعد: 39] هـ\n قوله تعالى: { ورزقكم من الطيبات } لذيذ المشاهدة، وأنس الوصلة\n وقوله تعالى: { هو الحي } الحياة عند المتكلمين لا تتعلق بشيء، وعند الصوفية تتعلق بالأشياء إذ لا قيام لها إلا بأسرار معاني ذاته، ومَن تحققت حياته من الأولياء بحياة الله، بحيث كان له نور يمشي به في الناس، كان كل مَن لقيه حييت روحه بمعرفة الله، ولذلك يضم الشيخُ المريدَ إليه، إن رآه لم ينهض حاله، ليسري حاله فيه، يأخذون ذلك من ضم جبريل للنبي عليهما السلام\n وبالله التوفيق\n ولَمَّا كان صلى الله عليه وسلم بين أظهر المشركين، نهى عن أن يتصف بصفاتهم، فقال: { قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:14",
      "similarity": 0.7116390233539794
    },
    {
      "verse": "39:11",
      "similarity": 0.68146683983521
    },
    {
      "verse": "39:2",
      "similarity": 0.6523994216682141
    },
    {
      "verse": "40:14",
      "similarity": 0.6249385436722491
    },
    {
      "verse": "37:40",
      "similarity": 0.6072918545972072
    }
  ]
}