{
  "chapter": "غافر",
  "text": "من دون الله قالوا۟ ضلوا۟ عنا بل لم نكن ندعوا۟ من قبل شيـا كذلك يضل الله الكفرين",
  "translations": [
    {
      "translation": "and they will reply, 'They have forsaken us. Or rather we were not calling to anything at all before.' That is how Allah misguides the kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Apart from God?\" They will answer: \"They have left us in the lurch and fled. In fact it was nothing that we prayed to before.\" That is how God sends the unbelievers astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "associated with Allah in His Divinity?” They will say: “We have lost them; rather, we never used to call upon anyone before.” Thus will Allah cause them to stumble in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply, \"They have abandoned us. In fact, we had worshipped nothing\" Thus does God cause the disbelievers to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“As rivals to Allah?”; they will say, “We have lost them – in fact we never used to worship anything before!”; this is how Allah sends the disbelievers astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides Allah\" They will say: \"They have vanished from us. Nay, we did not call upon anything before.\" Thus Allah leads astray the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides Allah? They shall say: They are gone away from us, nay, we used not to call upon anything before. Thus does Allah confound the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'They have gone astray from us; nay, but it was nothing at all that we called upon aforetime.' Even so God leads astray the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beside Allah? They say: They have failed us; but we used not to pray to anything before. Thus doth Allah send astray the disbelievers (in His guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"They have been lost to us; nay, we did not invoke anything before [that had real existence].\" Thus God leaves the deniers of the truth to stray;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beside Allah? They will say: they have failed us: aye! we have not been calling upon aught afore. Thus doth Allah lead the infidels astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "besides Allah?’ They will say, ‘They have forsaken us. No, we did not invoke anything before.’ That is how Allah leads the faithless astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In derogation of Allah?\" They will reply: \"They have left us in the lurch: Nay, we invoked not, of old, anything (that had real existence).\" Thus does Allah leave the Unbelievers to stray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides Allah\" They will say: \"They have vanished from us: Nay, we did not invoke (worship) anything before.\" Thus Allah leads astray the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "other than Allah' They will reply: 'They have gone astray from us. Indeed what we used to call upon before is nothing' Accordingly, Allah leads the unbelievers astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instead of God?” They will say, “They have abandoned us. In fact, we were praying to nothing before.” Thus God sends the disbelievers astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other than Allah?\" They will say, \"They have departed from us; rather, we did not used to invoke previously anything.\" Thus does Allah put astray the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:74]   besides God?’, alongside Him, and these are the idols. They will say, ‘They have forsaken, abandoned, us, and so we cannot see them. Nay, but [actually] we were not invoking anything before’. They deny that they used to worship these [idols]; but then these [idols] are brought [before them] — [which is where] God, exalted be He, says: ‘Truly you and what you worship besides God shall be fuel for Hell’ [Q. 21:98]). So, in the same way that these disbelievers have been led astray, God leads astray the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمِنْ دُونِ اللَّهِ قَالُوا ضَلُّوا عَنَّا بَلْ لَمْ نَكُنْ نَدْعُو مِنْ قَبْلُ شَيْئًا كَذَلِكَ يُضِلُّ اللَّهُ الْكَافِرِينَ (74) من حيث كانت سيادة جدّه أرسخت له سيادة أبيه وأعقبت سيادة نفسه ، وهذا استعمال موجود بكثرة . وصيغ ( قيلَ ) بصيغة المضيّ لأنه محقق الوقوع فكأنه وقع ومَضى وكذلك فعل { قَالُوا ضَلُّوا } .والقائل لهم : ناطق بإذن الله . و ( أين ) للاستفهام عن مكان الشيء المجهول المكان ، والاستفهام هنا مستعمل في التنبيه على الغلط والفضيحة في الموقف فإنهم كانوا يزعمون أنهم يعبدون الأصنام ليكونوا شفعاء لهم من غضب الله فلما حق عليهم العذاب فلم يجدوا شفعاء ذكروا بما كانوا يزعمونه فقيل لهم { أيْنَ ما كُنْتُم تُشْرِكُون مِن دُوننِ الله } ، فابتدروا بالجواب قبل انتهاء المقالة طمعاً في أن ينفعهم الاعتذار . فجملة { قَالُوا ضَلُوا عنا } معترضة في أثناء القول الذي قيل لهم ، ومعنى { ضَلُوا } غابوا كقوله : { أإذا ضللنا في الأرض أإنا لفي خلق جديد } \\[ السجدة : 10 \\] أي غُيبنا في التراب ، ثم عرض لهم فعلموا أن الأصنام لا تفيدهم . فأضربوا عن قولهم : { ضَلُوا عَنَّا } وقالوا : { بَلْ لَمْ نَكُن نَدْعُوا مِن قَبْلُ شَيْئَاً } أي لم نكن في الدنيا ندعو شيئاً يغني عنا ، فنفي دعاء شيء هنا راجع إلى نفي دعاء شيء يُعتدّ به ، كما تقول : حسبتُ أن فلاناً شيء فإذا هو ليس بشيء ، إن كنتَ خبرته فلم تر عنده خيراً . وفي الحديث : «سئل النبي صلى الله عليه وسلم عن الكهان فقال : «ليسوا بشيء» أي ليسوا بشيء معتدّ به فيما يقصدهم الناس لأجله ، وقال عباس بن مرداس: ... وقد كنت في الحرب ذا تدراءفلم أعط شيئاً ولم أمنع ... وتقدم عند قوله تعالى : { لستم على شيء حتى تقيموا التوراة والإنجيل } في سورة \\[ العقود : 68 \\] ، إذ ليس المعنى على إنكار أن يكونوا عبدوا شيئاً لمنافاته لقولهم : { ضَلُّوا عَنَّا } المقتضي الاعترافَ الضمني بعبادتهم .وفسر كثير من المفسرين قولهم : { بَل لَّمْ نَكُن ندْعُوا من قَبْلُ شيئاً } أنه إنكار لعبادة الأصنام بعد الاعتراف بها لاضطرابهم من الرعب فيكون من نحو قوله تعالى : { ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين } \\[ الأنعام : 23 \\] . ويجوز أن يكون لهم في ذلك الموقف مقالان ، وهذا كله قبل أن يحشروا في النار هم وأصنامهم فإنهم يكونون متماثلين حينئذٍ كما قال تعالى : { إنكم وما تعبدون من دون اللَّه حصب جهنم } .وجملة { كذلك يُضِلُّ الله الكافرين } تذييل معترض بين أجزاء القول الذي يقال لهم . ومعنى الإِشارة تعجيب من ضلالهم ، أي مثل ضلالهم ذلك يُضل الله الكافرين . والمراد بالكافرين : عموم الكافرين ، فليس هذا من الإِظهار في مقام الإِضمار . والتشبيه في قوله : { كذلك يُضِلُّ الله الكافرين } يُفيد تشبيه إضلال جميع الكافرين بإضلاله هؤلاء الذين يجادلون في آيات الله ، فتكون جملة { كذلك يُضِلُّ الله الكافرين } تذييلاً ، أي مثل إضلال الذين يجادلون في آيات الله يُضل الله جميع الكافرين ، فيكون إضلال هؤلاء الذين يجادلون مشبهاً به إضلال الكافرين كلهم ، والتشبيه كناية عن كون إضلال الذين يجادلون في آيات الله بلغ قوة نوعه بحيث ينظّر به كل ما خفي من أصناف الضلال ، وهو كناية عن كون مجادلة هؤلاء في آيات الله أشدُّ الكفر .والتشبيه جار على أصله وهو إلحاق ناقص بكامل في وصف ولا يكون من قبيل { وكذلك جعلناكم أمة وسطاً } \\[ البقرة : 143 \\] ولا هو نظير قوله المتقدم { كذلك يؤفك الذين كانوا بآيات اللَّه يجحدون } \\[ غافر : 63 \\] .\n\n",
      "translations": [
        {
          "translation": "(Beside Allah) and whom you claim they are associates of Allah? (They say: They have failed us) they are preoccupied with themselves from us; but then they denied this and said: (but we used not to pray to) to worship (anything before) this. (Thus doth Allah send astray the disbelievers (in His guidance)) such that they do not have any proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويسميتوهم آلهة { مِن دُونِ ٱللَّهِ } لم لا تنقذكم من عذاب الله\n ولم لا يشفعون لكم عنده سبحانه بمقتضى ما زعمتم في شأنكم؟\n\n\nوبعدما سمعوا ما سمعوا من التوبيخ والتقريع { قَـالُواْ } متحسرين متأوهين: { ضَـلُّواْ } وغابوا { عَنَّا } آلهتنا وشفعاؤنا التي كنا ندعو إليه ونستشفع منهم { بَل } قد ظهر اليوم أنًَّا { لَّمْ نَكُنْ نَّدْعُواْ مِن قَبْلُ } في النشأة الأولى شيئاً ينفعنا\n ويدفع عنَّا من غضب الله { كَذَلِكَ يُضِلُّ ٱللَّهُ } المنتقم المضل { ٱلْكَافِرِينَ } [غافر: 74] الضالين؟ حيث لا ينكشفون بضلالهم إلا وقت حلول العذاب والوبال عليهم\n\n\nثم قيل لهم مبالغة في توبيخهم وتعييرهم: { ذَلِكُمْ } أي: إضلال الله إياكم { بِمَا كُنتُمْ تَفْرَحُونَ فِي ٱلأَرْضِ } وتمشون عليها خيلاء بطرين مسرورين\n مستكبرين عن قبول آيات الله المنزلة على رسله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:20",
      "similarity": 0.44883794284659834
    },
    {
      "verse": "37:29",
      "similarity": 0.41506953009102354
    },
    {
      "verse": "29:42",
      "similarity": 0.39705988673491066
    },
    {
      "verse": "4:116",
      "similarity": 0.39678997555909024
    },
    {
      "verse": "22:12",
      "similarity": 0.3831250423614985
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040074.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040074.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:74.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}