{
  "chapter": "غافر",
  "text": "الذين كذبوا۟ بالكتب وبما ارسلنا به رسلنا فسوف يعلمون",
  "translations": [
    {
      "translation": "Those who deny the Book and that with which We sent Our Messengers will certainly come to know",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the Book and what We have sent down with Our apostles, will soon come to know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who gave the lie to this Book and all the Books which We had sent with Our Messengers shall soon come to know the Truth\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who rejected the Book and the message which was given to Our Messenger will soon know (the consequences of their evil deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who denied the Book and what We sent with Our Noble Messengers; so they will soon come to know. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the Book, and that with which We sent Our Messengers they will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject the Book and that with which We have sent Our Apostle; but they shall soon come to know,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who cry lies to the Book and that wherewith We sent Our Messengers -- soon they will know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the Scripture and that wherewith We send Our messengers. But they will come to know,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who reject the Book and that with which We sent Our messengers shall soon know --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who belie the Book and that message wherewith We sent Our apostles, presently they shall come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Those who deny the Book and what we have sent with Our apostles. Soon they will know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject the Book and the (revelations) with which We sent our messengers: but soon shall they know,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the Book (this Quran), and that with which We sent Our Messengers (i.e. to worship none but Allah Alone sincerely, and to reject all false deities and to confess resurrection after the death for recompense) they will come to know (when they will be cast into the Fire of Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who belie the Book and that with which We sent Our Messengers shall soon know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who call the Book a lie, and what We sent Our messengers with—they will surely know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the Book and that with which We sent Our messengers - they are going to know,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:70] those who deny the Book, the Qur’ān, and that wherewith We have sent Our messengers, in the way of the affirmation of [God’s] Oneness and [belief in] the Resurrection — and these [deniers] are the Meccan disbelievers. But they will come to know, the punishment for their denials;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who deny the Scripture) the Qur'an (and that wherewith we send Our messengers) of Scriptures. (But they will come to know) on the Day of Judgement what will be done to them. This is a threat to them,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nسيما إلى المكابرين { ٱلَّذِينَ كَذَّبُواْ بِٱلْكِـتَابِ } أي: بالقرآن الجامع الكامل المنزل عليك يا أكمل الرسل { وَبِمَآ أَرْسَلْنَا } أي: بجميع ما أرسلنا { بِهِ رُسُلَنَا } الذين مضوا من قبلك من الكتب والصحف المنزلة عليهم { فَسَوْفَ يَعْلَمُونَ } [غافر: 70] وبال جدالهم وتكذيبهم في النشأة الأخرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا تعجيب من أحوالهم الركيكة، وتمهيد لما يعقبه من بيان تكذيبهم بكل القرآن، أو بسائر الكتب والشرائع، كما أبانه بقوله: { الذي كذَّبوا بالكتاب } أي: بالقرآن، أو: بجنس الكتب السماوية، { وبما أرسلنا به رسلنا } من سائر الكتب، أو: الوحي، أو: الشرائع، { فسوف يعلمون } عاقبة ما فعلوا من الجدال والتكذيب، عند مشاهدتهم لأنواع العقوبات\n { إِذِ الأغلالُ في أعناقهم } أي: سوف يعلمون حين تكون الأغلال في أعناقهم\n و \" إذ \": ظرف للماضي، والمراد به هنا: الاستقبال لأن الأمور المستقبلة لَمّا كانت محققة الوقوع، مقطوعاً بها، عبّر بما كان ووُجد",
      "translations": []
    }
  ]
}