{
  "chapter": "غافر",
  "text": "الذين يحملون العرش ومن حوله يسبحون بحمد ربهم ويؤمنون به ويستغفرون للذين ءامنوا۟ ربنا وسعت كل شىء رحمة وعلما فاغفر للذين تابوا۟ واتبعوا۟ سبيلك وقهم عذاب الجحيم",
  "translations": [
    {
      "translation": "Those who bear the Throne, and all those around it, glorify their Lord with praise and believe in Him and ask forgiveness for those who have iman: 'Our Lord, You encompass everything in mercy and knowledge! Forgive those who turn to You and who follow Your Way and safeguard them from the punishment of the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bearers of the Throne, and those around it, sing the praises of their Lord and believe in Him, and seek forgiveness for those who believe: \"O our Lord, Your mercy and knowledge embrace everything; so forgive those who turn to You in repentance and follow Your path; and preserve them from the torment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels that bear the Throne and those that are around to extol your Lord's glory with His praise, they believe in Him, and ask forgiveness for the believers, saying: “Our Lord! You encompass everything with Your Mercy and Knowledge. So forgive those that repent and follow Your Path, and guard them against the chastisement of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bearers of the Throne glorify their Lord with His praise. They believe in Him and ask Him to forgive the believers. They say, \"Our Lord, Your mercy and knowledge encompass all things. Forgive those who turn to You in repentance and follow Your path. Lord, save them from the torment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those* who bear the Throne, and those who are around it, say the Purity of their Lord while praising Him, and they believe in Him and seek forgiveness for the believers; “O Our Lord! Your mercy and knowledge encompass all things, therefore forgive those who repented and followed Your path, and save them from the punishment of hell.” (* The angels.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (angels) who bear the Throne (of Allah) and those around it glorify the praises of their Lord, and believe in Him, and ask forgiveness for those who believe (saying): \"Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your way, and save them from the torment of the blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the power and those around Him celebrate the praise of their Lord and believe in Him and ask protection for those who believe: Our Lord! Thou embracest all things in mercy and knowledge, therefore grant protection to those who turn (to Thee) and follow Thy way, and save them from the punishment of the hell:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and those round about it proclaim the praise of their Lord, and believe in Him, and they ask forgiveness for those who believe: 'Our Lord, Thou embracest every thing in mercy and knowledge; therefore forgive those who have repented, and follow Thy way, and guard them against the chastisement of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and all who are round about it, hymn the praises of their Lord and believe in Him and ask forgiveness for those who believe (saying): Our Lord! Thou comprehendest all things in mercy and knowledge, therefor forgive those who repent and follow Thy way. Ward off from them the punishment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and those who are around it, glorify their Lord with His praise, and believe in Him. They ask forgiveness for those who believe, saying, \"Our Lord, You embrace all things in mercy and knowledge. Forgive those who turn to You and follow Your path. Save them from the punishment of Hell\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne and those who are round about it, hallow the praise of their Lord and believe in Him and ask forgiveness for those who believe, saying: our Lord! Thou comprehendest everything in mercy and knowledge, wherefore forgive these who repent and follow Thine path, and protect them from the torment of the Flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and those who are around it, celebrate the praise of their Lord and have faith in Him, and they plead for forgiveness for the faithful: ‘Our Lord! You embrace all things in mercy and knowledge. So forgive those who repent and follow Your way and save them from the punishment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who sustain the Throne (of Allah) and those around it Sing Glory and Praise to their Lord; believe in Him; and implore Forgiveness for those who believe: \"Our Lord! Thy Reach is over all things, in Mercy and Knowledge. Forgive, then, those who turn in Repentance, and follow Thy Path; and preserve them from the Penalty of the Blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (angels) who bear the Throne (of Allah) and those around it glorify the praises of their Lord, and believe in Him, and ask forgiveness for those who believe (in the Oneness of Allah) (saying): \"Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your Way, and save them from the torment of the blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne and those around it exalt with the praise of their Lord and believe in Him. They ask forgiveness for the believers (saying): 'Our Lord, You embrace all things in mercy and knowledge. Forgive those who repent and follow Your Way. Shield them against the punishment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who carry the Throne, and those around it, glorify their Lord with praise, and believe in Him, and ask for forgiveness for those who believe: “Our Lord, You have encompassed everything in mercy and knowledge; so forgive those who repent and follow Your path, and protect them from the agony of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those [angels] who carry the Throne and those around it exalt [Allah] with praise of their Lord and believe in Him and ask forgiveness for those who have believed, [saying], \"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:7] Those who bear the Throne (alladhīna yahmilūna’l-‘arsha is the subject) and those around it (wa-man hawlahu is a supplement to that [subject]) glorify (yusabbihūna, is the predicate thereof) with praise of their Lord, continuously proclaiming praise, in other words, [continuously] saying: subhāna’Llāhi wa-bi-hamdihi, ‘Glory, and praise, be to God’; and they believe in Him, exalted be He, through their power of discernment, in other words, they affirm the truth of His Oneness, and they ask forgiveness for those who believe, saying: ‘Our Lord, You embrace all things in [Your] mercy and knowledge, that is to say, Your mercy embraces all things and Your knowledge [also embraces] all things. So forgive those who repent, of idolatry, and follow Your way — the religion of Islam — and shield them from the chastisement of Hell-fire, that is, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who bear the Throne) of the Beneficent, who are a tenth of the angel carriers, (and all who are round about it) of the angels, (hymn the praises of their Lord) hymn by the command of their Lord (and believe in Him) while believing in Allah (and ask forgiveness) and pray (for those who believe) in Muhammad (pbuh) and in the Qur'an ((saying): Our Lord!) O our Lord! (Thou comprehendest all things in mercy) You filled all things with blessings (and knowledge) and You know all things, (therefore forgive those who repent) from idolatry (and follow Your way) Your religion: Islam. (Ward off from them the punishment of hell) drive away from them the torment of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى حثِّ المؤمنين الموحدين على الإيمان، ومواظبة الشكر على إنعام الله إياهم باليقين، فقال: { ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ } وهم الكروبيون الذين سبقوا بحمل العرش الإلهي، وحفظ ما انعكس فيهم من تجلياته الجمالية بدوام المراقبة والمطالعة بوجهه الكريم { وَمَنْ حَوْلَهُ } من الملائكة الذين يطوفون حول العرش، ويقتفون أثر أولئك الحملة السابقين كلهم { يُسَبِّحُونَ } وينزهون الحق عن سمات الحدوث والإمكان، ويقدسونه عن عروض السهو والنيسان؛ إذ كمال ما يدرك المدرك منه سبحانه إنما هو التسبيح والتقديس، وإلا فالأمر أعز وأعلى من أن يحيط به الآراء ويحوم حوله الأهواء، ويواظبون { بِحَمْدِ رَبِّهِمْ } على ما أولاهم نعمة التوجه إليه والتحنن نحوه\n\n\n\n\n{ وَ } بالجملة: { يُؤْمِنُونَ بِهِ } سبحانه، ويوحدونه، ويعتقدون أوصافه العليا وأسماؤه الحسنى، وإن عجزوا عن كنه ذاته { وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُواْ } أي: يطلبون العفو والستر منه سبحانه لذنوب إخوانهم الذين آمنوا بوحدة الحق وكمالات أسمائه وصفاته، مثل إيمانهم سواء كانوا سماويين أو أرضيين، قائلين مناجين مع ربهم حين استغفارهم: { رَبَّنَا } يا من ربانا على فطرة تسبيحك وتقديسك، ومداومة حمدك وثنائك، أنت بذاتك بمقتضى كرمك وجودك { وَسِعْتَ كُـلَّ شَيْءٍ رَّحْمَةً وَعِلْماً } أي: وسعت رحمتك، وأحاطت حضرة علمك على كل ما لمع عليه بروق تجلياتك وشروق شمس ذاتك { فَٱغْفِرْ } لسعة رحمتك وجودك { لِلَّذِينَ تَابُواْ } ورجعوا نحو بابل نادمي، وامحُ عن عيون بصائرهم سبل الغير والسوى في جنب بابك { وَٱتَّبَعُواْ } بالعزيمة الصادقة الخالصة { سَبِيلَكَ } الذي أرشدتهم إليه بوحيك على رسلك { وَقِهِمْ عَذَابَ ٱلْجَحِيمِ } [غافر: 7] أي: احفظهم عن عذاب الطرد والحرمان المعد لأصحاب الخسران في جميع حجتهم الخذلان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الذين }: مبتدأ، و { يُسبّحون }: خبره، والجملة: استئناف مسوق لتسلية الرسول صلى الله عليه وسلم ببيان أن أشراف الملائكة ـ عليهم السلام ـ مثابرون على ولاية مَن معه من المؤمنين، ونصرتهم، واستدعاء ما يُسعدهم في الدارين\n يقول الحق جلّ جلاله: { الذين يحملون العرش } على عواتقهم ـ وهم محمولون أيضاً بلطائف القدرة، { ومَن حَوْله } أي: الحافِّين حوله، وهم الكروبيّون، سادات الملائكة، وأعلى طبقاتهم\n قال ابن عباس: حملة العرش ما بين كعب أحدهم إلى أسفل قدميه مسيرة خمسمائة عام، وقيل: أرجلهم في الأرض السفلى، ورؤوسهم خرقت العرش، وهم خشوعٌ، لا يرفعون طرفهم، وهم أشد خوفاً من سائر الملائكة\n وقال أيضاً: لمَّا خلق الله حملة العرش، قال لهم: احملوا عرشي فلم يطيقوا، فخلق الله مع كل ملك من أعوانهم مثل جنود مَن في السموات ومَن في الأرض مِن الخلق، فقال لهم: احملوا عرشي، فلم يطيقوا، فخلق مع كل واحد منهم مثل جنود سبع سموات وسبع أرضين، وما في الأرض من عدد الحصى والثرى، فقال: احملوا عرشي، فلم يطيقوا، فقال: قولوا: لا حول ولا قوة إلا بالله العلي العظيم، فقالوها، فاستقلوا عرش ربنا، أي: لَمَّا حملوه بالله أطاقوه، فلم يحمل عرشه إلا قدرته، وفي الحديث:\n\n \" إن الله أمر جميع الملائكة أن يَغدُوا، ويَرُوحوا بالسلام على حملة العرش، تفضيلاً لهم على سائر الملائكة \"\n \n\nوقال وهب بن منبه: حول العرش سبعون ألف صف من الملائكة، صف خلف صف، يدورون حول العرش، يطوفون به، يُقبل هؤلاء، ويُدبر هؤلاء، فإذا استقبل بعضهم بعضاً، هلّل هؤلاء، وكبَّر هؤلاء، ومِن ورائهم سبعون ألف صف قيام، أيديهم إلى أعناقهم، قد وضعوها على عواتقهم، فإذا سمعوا تكبير هؤلاء وتهليلهم، رفعوا أصواتهم، فقالوا: سبحانك وبحمدك ما أعظمك وأجلَّك، أنت الله لا إله غيرك، أنت الأكبر، الخلقُ كلهم راجون رحمتك، ومِن وراء هؤلاء مائة ألف صف من الملائكة، قد وضعوا اليمنى على اليسرى، ليس منهم أحد إلا يُسبح الله ـ تعالى ـ بتسبيح لا يُسبحه الآخر، ما بين جناحي أحدهم مسيرة ثلاثمائة عام، واحتجب الله عزّ وجل ـ بينه وبين الملائكة الذين هم حول العرش ـ بسبعين حجاباً من ظُلمة، وسبعين حجاباً من نور، وسبعين حجاباً من دُرٍّ أبيض، وسبعين حجاباً من ياقوتٍ أحمر، وسبعين حجاباً من زمُردٍ أخضر، وسبعين حجاباً من ثلجٍ، وسبعين حجاباً من ماءٍ، إلى ما لا يعلمه إلا الله تعالى\n هـ\n قلت: لمّا أظهر الله العرشَ تجلّى بنورٍ جبروتي رحموتي، استوى به على العرش، كما يتجلّى يوم القيامة لفصل القضاء، ثم ضرب الحُجُب بين هذا التجلي الخاص وبين الملائكة الحافِّين، ولا يلزم عليه حصر ولا تجسيم إذ تجليات الذات العالية لا تنحصر، وليست هذه الحُجُب بين الذات الكلية وبين الخلق إذ لا حجاب بينها وبين سائر المخلوقات إلا حجاب القهر والوهم\n\n\nواخْتُلف في هيئة العرش، فقيل: إنه مستدير، والكون كله في جوفه كخردلة في الهواء، حتى قيل: هو الفلك التاسع، وقيل: هو منبسط كهيئة السرير، وله سواري وأعمدة، وهو ظاهر الأخبار النبوية\n رَوى جعفرُ الصادق عن أبيه عن جده، أنه قال: إن بين القائمة من قوائم العرش والقائمة الثانية من خفقان الطير المسرعة قياس ألف عام، وإن ملَكاً يقال له: حزقائيل، له ثمانية عشر ألف جناح، ما بين الجناح والجناح خمسمائة عام، فأوحى الله إليه: أن طِرْ، فطار مقدار عشرين ألف سنة، فلم ينل رأسُه قائمةً من قوائم العرش، ثم طار مقدار ثلاثين ألف سنة فلم ينلها، فأوحى الله إليه: لو طرت إلى نفخ الصور لم تبلغ ساق عرشي\n هـ\n مختصراً\n وفي حديث آخر:\n\n \" إن بين القائمة والقائمة من قوائم العرش ستين ألف صحراء، في كل صحراء ستون ألف عالم، في كل عالم قدر الثقلين \" \n\nومع هذا كله يسعه قلب العارف حتى يكون في زاوية منه لأنه محدود، وعظمة الحق غير محدودة، وقلب العارف قد تجلّت فيه عظمة الحق، فوسعها، بدليل الحديث:\n\n \" لن تسعني أرضي ولا سمائي، ووسعني قلب عبدي المؤمن \" \n\nأي: الكامل\n ثم أخبر تعالى عن حَمَلة العرش ومَن حوله بقوله: { يُسَبِّحُونَ بحمد ربهم } أي: ينزهونه تعالى عما لا يليق بشأنه الجليل، ملتبسين بحمده على نعمائه التي لا تتناهى، { ويُؤمنون به } إيماناً يناسب حالهم\n وفائدة ذكره مع علمنا بأن حملة العرش ومَنْ حوله الذي يُسبِّحون بحمد ربهم مؤمنون إظهار لشرف الإيمان وفضيلته، وإبراز لشرف أهله، والترغيب فيه، كما وصف الأنبياء في بعض المواضع بالصلاح\n وفيه تنبيه على أن الملائكة لم يحصل لهم العيان، وإنما وًصفوا بالإيمان بالغيب، وهم طبقات: منهم العارفون أهل العيان، ومنهم أهل الإيمان\n ثم قال تعالى: { ويستغفرون للذين آمنوا } أي: ويستغفرون لمَن شاركهم في حالهم من الإيمان، وفيه دليل على أن الإشراك يجب أن يكون أدعى شيء إلى النصيحة والشفقة، وإن تباعدت الأماكن، وفي نظم استغفارهم لهم في سلك وظائفهم المفروضة عليهم، من تسبيحهم، وتحميدهم، وإيمانهم، إيذان بكمال اعتنائهم به، وإشعار بوقوعه عند الله ـ تعالى ـ موقع القبول\n { ربَّنا } أي: يقولون: ربنا، إمّا بيان لاستغفارهم، أو حال، { وَسِعْتَ كلَّ شيء رحمةً وعلماً } أي: وسعت رحمتُك وعلمك كلَّ شيء، فأزيل الكلام عن أصله، بأن أسند الفعل إلى صاحب الرحمة والعلم، ونُصبا على التمييز، مبالغةً في وصفه ـ تعالى ـ بالرحمة والعلم، وفي عمومهما، وتقديم الرحمة لأنها السابقة والمقصودة هنا، { فاغفرْ للذين تابوا }  أي: للذين علمتَ منهم التوبة، ليُناسب ذكر الرحمة، { واتَّبعُوا سبيلَك } أي: طريق الهُدى التي دعوت إليها\n\n\nوالفاء لترتيب الدعاء على ما قبلها من سعة الرحمة والعلم، { وَقِهِم عذاب الجحيم } أي: احفظهم منه، وهو تصريح بعد إشعار للتأكيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "110:3",
      "similarity": 0.32861120084914064
    },
    {
      "verse": "27:8",
      "similarity": 0.29893167076362603
    },
    {
      "verse": "20:98",
      "similarity": 0.2868278839019129
    },
    {
      "verse": "44:56",
      "similarity": 0.2828407272953951
    },
    {
      "verse": "26:25",
      "similarity": 0.2757531112649354
    }
  ]
}