{
  "chapter": "غافر",
  "text": "اذ الاغلل فى اعنقهم والسلسل يسحبون",
  "translations": [
    {
      "translation": "when they have shackles and chains around their necks and are dragged along the ground",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When, with (iron) collars and chains around their necks, they will be dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when fetters and chains shall be on their necks, and they shall be dragged into\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when fetters will be placed around their necks and chains will drag them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When around their necks will be shackles and chains; they will be dragged. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When iron collars will be rounded over their necks, and the chains, they shall be dragged along,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the fetters and the chains shall be on their necks; they shall be dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the fetters and chains are on their necks, and they dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When carcans are about their necks and chains. They are dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when, with iron collars and chains around their necks, they are dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When shackles will be on their necks and also chains; they will be dragged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they are dragged [with] iron collars and chains around their necks\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the yokes (shall be) round their necks, and the chains; they shall be dragged along-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When iron collars will be rounded over their necks, and the chains, they shall be dragged along.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the fetters and chains are round their necks they shall be dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the yokes are around their necks, and they will be dragged by the chains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the shackles are around their necks and the chains; they will be dragged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:71] when (idh has the meaning of idhā) [with] fetters around their necks and chains (wa’l-salāsilu, a supplement to al-aghlālu, ‘fetters’, so that the meaning is that these [chains] are also around their necks; or it [alsalāsilu, ‘chains’] is the subject, the predicate of which has been omitted, in other words [the meaning being]: around their feet [will be these chains] — or [alternatively] its predicate is [the following, yushabūna]), they are dragged, in other words, they are dragged away by these [chains].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When carcans are about their necks and chains) tied up with the satans. (They are dragged) in the Fire\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوقت { إِذِ } تكون { ٱلأَغْلاَلُ } الثقيلة معقودة { فِيۤ أَعْنَاقِهِمْ } بسبب انصرافهم عن آيات الله، وعدم التفاتهم إلى رسله الحاملين { وٱلسَّلاَسِلُ } في أيديهم وأرجلهم؛ لعظم جرائمهم وآثامهم الباعثة على أخذهم ومقتهم { يُسْحَبُونَ } [غافر: 71] ويجرون على وجوههم، { فِي ٱلْحَمِيمِ } أي: الجحيم إلى ما شاء الله تفضيحاً لهم { ثُمَّ فِي ٱلنَّارِ } المسعرة { يُسْجَرُونَ } [غافر: 72] يوقدون، ويطرحون فيها طرح الحطب الوقود للنار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } في أعناقهم أيضاً { السلاسلُ }\n وفي تفسير ابن عرفة: ولا يجوز مثل ذلك في العقوبات الدنيوية، وقياسه على العقوبات الأخروية خطأ، وفاعله مخطىء غاية الخطأ، ولم يذكر الأئمة في اعتقال المحبوس للقتل إلا أنه يجعل القيد من الحديد في رِجْلِه، خيفة أن يهرب، وأما عنقه فلا يُجعل فيه شيء\n هـ\n { يُسْحَبون في الحميم } أي: يُجرّون في الماء الحارّ، وهو استئناف بياني، كأن قائلاً قال: فماذا يكون حالهم بعد ذلك؟ فقال: يُسحبون في الحميم، { ثم في النار يُسْجَرُون } ويُحرقون، من سَجَر التنّور: إذا ملأه بالوقود، والمراد: أنهم يُعذبون بأنواع العذاب، ويُنقلون من لون إلى لون\n { ثم قيلَ لهم أين ما كنتم تُشركون من دون الله قالوا ضَلُّوا عنا } أي: غابوا، وهذا قبل أن يُقرن بهم آلهتهم، أو: ضاعوا عنا فلم نجد ما كنا نتوقع منهم، { بل لم نكن ندعو من قبلُ شيئاً } أي: تبيّن لنا أنهم لم يكونوا شيئاً\n أو: يكون إنكاراً منهم، كقولهم:\n\n[الأنعام: 23]\n وهذا كله مستقبل عبّر عنه بالماضي لتحققه\n { كذلك } أي: مثل ذلك الضلال الفظيع { يُضل الله الكافرين } حيث لا يهتدون إلى شيء ينفعهم في الآخرة، أو: كما ضلّ عنهم آلهتهم يُضلهم الله عن آلهتهم، حتى لو تطالبوا لم يتصادفوا\n { ذلكم } الإضلال { بما كنتم تفرحون في الأرض } أي: تبطرون وتتكبرون { بغير الحق } ، بل بالشرك والطغيان، { وبما كنتم تمرحون } تفخرون وتختالون، أو: تتكبرون وتعجبون\n\n\nوالالتفات إلى الخطاب للمبالغة في التوبيخ\n فيقال لهم: { ادْخُلوا أبوابَ جهنَّم } أي: أبوابها السبعة المقسومة عليكم { خالدين فيها } مقدّراً خلودكم فيها، { فبئسَ مثوى المتكبرين } عن الحق، والمخصوص محذوف، أي: جهنّم\n الإشارة: الأولياء العارفون أهل التربية الكاملة، آية من آيات الله في كل زمان، فيقال في حق مَن يُخاصم في وجوههم، ويتنكّب عن صحبتهم: الذين يُجادلون في آيات الله أنَّى يُصرفون؟ وهم الذين كذَّبوا بأسرار الكتاب، وعلوم باطنه، وبما أرسل به خلفاء الرسل، ممن يغوص على تلك الأسرار، فسوف يعلمون حين تخاطبهم أغلال الوساوس والخواطر، وسلاسل العلائق والشواغل، فيقبضهم عن النهوض إلى قضاء الشهود والعيان، وجولان الفكرة في أنوار الملكوت وأسرار الجبروت، يُسحبون في حرّ التدبير والاختيار، ثم في نار القطيعة يُسْجَرون، ثم قيل لهم إذا ماتوا: أين ما كنتم تُشركون في المحبة والميل من دون الله؟ قالوا: ضلُّوا عنا، وغاب عنهم كل ما تمتعوا به من الحظوظ والشهوات، فيقال لهم: ذلكم بما كنتم تنبسطون في الدنيا في أنواع المآكل، والمشارب، والملابس، والمناكح، وبما كنتم تفتخرون على الناس، فيخلدون في الحجاب، إلا في وقت مخصوص\n وبالله التوفيق\n ثم أمر بالصبر وانتظار الفتح، فقال: { ٱدْخُلُوۤاْ أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:4",
      "similarity": 0.716910603317952
    },
    {
      "verse": "69:32",
      "similarity": 0.5024397337323422
    },
    {
      "verse": "13:5",
      "similarity": 0.3640562630573835
    },
    {
      "verse": "17:29",
      "similarity": 0.3516999576355792
    },
    {
      "verse": "34:33",
      "similarity": 0.29678188167759517
    }
  ]
}