{
  "chapter": "غافر",
  "text": "الذين يحملون العرش ومن حوله يسبحون بحمد ربهم ويؤمنون به ويستغفرون للذين ءامنوا۟ ربنا وسعت كل شىء رحمة وعلما فاغفر للذين تابوا۟ واتبعوا۟ سبيلك وقهم عذاب الجحيم",
  "translations": [
    {
      "translation": "Those who bear the Throne, and all those around it, glorify their Lord with praise and believe in Him and ask forgiveness for those who have iman: 'Our Lord, You encompass everything in mercy and knowledge! Forgive those who turn to You and who follow Your Way and safeguard them from the punishment of the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bearers of the Throne, and those around it, sing the praises of their Lord and believe in Him, and seek forgiveness for those who believe: \"O our Lord, Your mercy and knowledge embrace everything; so forgive those who turn to You in repentance and follow Your path; and preserve them from the torment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels that bear the Throne and those that are around to extol your Lord's glory with His praise, they believe in Him, and ask forgiveness for the believers, saying: “Our Lord! You encompass everything with Your Mercy and Knowledge. So forgive those that repent and follow Your Path, and guard them against the chastisement of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bearers of the Throne glorify their Lord with His praise. They believe in Him and ask Him to forgive the believers. They say, \"Our Lord, Your mercy and knowledge encompass all things. Forgive those who turn to You in repentance and follow Your path. Lord, save them from the torment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those* who bear the Throne, and those who are around it, say the Purity of their Lord while praising Him, and they believe in Him and seek forgiveness for the believers; “O Our Lord! Your mercy and knowledge encompass all things, therefore forgive those who repented and followed Your path, and save them from the punishment of hell.” (* The angels.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (angels) who bear the Throne (of Allah) and those around it glorify the praises of their Lord, and believe in Him, and ask forgiveness for those who believe (saying): \"Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your way, and save them from the torment of the blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the power and those around Him celebrate the praise of their Lord and believe in Him and ask protection for those who believe: Our Lord! Thou embracest all things in mercy and knowledge, therefore grant protection to those who turn (to Thee) and follow Thy way, and save them from the punishment of the hell:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and those round about it proclaim the praise of their Lord, and believe in Him, and they ask forgiveness for those who believe: 'Our Lord, Thou embracest every thing in mercy and knowledge; therefore forgive those who have repented, and follow Thy way, and guard them against the chastisement of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and all who are round about it, hymn the praises of their Lord and believe in Him and ask forgiveness for those who believe (saying): Our Lord! Thou comprehendest all things in mercy and knowledge, therefor forgive those who repent and follow Thy way. Ward off from them the punishment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and those who are around it, glorify their Lord with His praise, and believe in Him. They ask forgiveness for those who believe, saying, \"Our Lord, You embrace all things in mercy and knowledge. Forgive those who turn to You and follow Your path. Save them from the punishment of Hell\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne and those who are round about it, hallow the praise of their Lord and believe in Him and ask forgiveness for those who believe, saying: our Lord! Thou comprehendest everything in mercy and knowledge, wherefore forgive these who repent and follow Thine path, and protect them from the torment of the Flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne, and those who are around it, celebrate the praise of their Lord and have faith in Him, and they plead for forgiveness for the faithful: ‘Our Lord! You embrace all things in mercy and knowledge. So forgive those who repent and follow Your way and save them from the punishment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who sustain the Throne (of Allah) and those around it Sing Glory and Praise to their Lord; believe in Him; and implore Forgiveness for those who believe: \"Our Lord! Thy Reach is over all things, in Mercy and Knowledge. Forgive, then, those who turn in Repentance, and follow Thy Path; and preserve them from the Penalty of the Blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (angels) who bear the Throne (of Allah) and those around it glorify the praises of their Lord, and believe in Him, and ask forgiveness for those who believe (in the Oneness of Allah) (saying): \"Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your Way, and save them from the torment of the blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who bear the Throne and those around it exalt with the praise of their Lord and believe in Him. They ask forgiveness for the believers (saying): 'Our Lord, You embrace all things in mercy and knowledge. Forgive those who repent and follow Your Way. Shield them against the punishment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who carry the Throne, and those around it, glorify their Lord with praise, and believe in Him, and ask for forgiveness for those who believe: “Our Lord, You have encompassed everything in mercy and knowledge; so forgive those who repent and follow Your path, and protect them from the agony of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those [angels] who carry the Throne and those around it exalt [Allah] with praise of their Lord and believe in Him and ask forgiveness for those who have believed, [saying], \"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:7] Those who bear the Throne (alladhīna yahmilūna’l-‘arsha is the subject) and those around it (wa-man hawlahu is a supplement to that [subject]) glorify (yusabbihūna, is the predicate thereof) with praise of their Lord, continuously proclaiming praise, in other words, [continuously] saying: subhāna’Llāhi wa-bi-hamdihi, ‘Glory, and praise, be to God’; and they believe in Him, exalted be He, through their power of discernment, in other words, they affirm the truth of His Oneness, and they ask forgiveness for those who believe, saying: ‘Our Lord, You embrace all things in [Your] mercy and knowledge, that is to say, Your mercy embraces all things and Your knowledge [also embraces] all things. So forgive those who repent, of idolatry, and follow Your way — the religion of Islam — and shield them from the chastisement of Hell-fire, that is, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالَّذِينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ آَمَنُوا رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ (7)استئناف ابتدائي اقتضاه الانتقال من ذكر الوعيد المؤذن بذم الذين كفروا إلى ذكر الثناء على المؤمنين ، فإن الكلام الجاري على ألسنة الملائكة مثل الكلام الجاري على ألسنة الرسل إذ الجميع من وحي الله ، والمناسبة المضادَّةُ بين الحالين والمقالين .ويجوز أن يكون استئنافاً بيانياً ناشئاً عن وعيد المجادلين في آيات الله أن يسأل سائل عن حال الذين لا يجادلون في آيات الله فآمنوا بها .وخص في هذه الآية طائفة من الملائكة موصوفة بأوصاف تقتضي رفعة شأنهم تذرعاً من ذلك إلى التنويه بشأن المؤمنين الذين تستغفر لهم هذه الطائفة الشريفة من الملائكة ، وإلا فإن الله قد أسند مثل هذا الاستغفار لعموم الملائكة في قوله في سورة \\[ الشورى : 5 \\] { والملائكة يسبحون بحمد ربهم ويستغفرون لمن في الأرض } أي من المؤمنين بقرينة قوله فيها بعده : { والذين اتخذوا من دونه أولياء اللَّه حفيظ عليهم } \\[ الشورى : 6 \\] .و { الذين يحمِلُون العَرْش } هم الموكَّلون برفع العرش المحيط بالسماوات وهو أعظم السماوات ، ولذلك أضيف إلى الله في قوله تعالى : { ويحمل عرش ربك فوقهم يومئذ ثمانية } \\[ الحاقة : 17 \\] .( و { من حَوله } طائفة من الملائكة تحفّ بالعرش تحقيقاً لعظمته قال تعالى : { وترى الملائكة حافين من حول العرش يسبحون بحمد ربهم } \\[ الزمر : 75 \\] ، ولا حاجة إلى الخوض في عددهم { وما يعلم جنود ربك إلا هو } \\[ المدثر : 31 \\] .( والإِخبار عن صنفي الملائكة بأنهم يسبحون ويؤمنون به؛ توطئة وتمهيد للإخبار عنهم بأنهم يستغفرون للذين آمنوا فذلك هو المقصود من الخبر ، فقدم له ما فيه تحقيق استجابة استغفارهم لصدوره ممن دأبهم التسبيح وصفتهم الإِيمان .وصِيغةُ المضارع في { يسبحون } و { يؤمنون } و { يستغفرون } مفيدة لتجدد ذلك وتكرره ، وذلك مشعر بأن المراد أنهم يفعلون ذلك في الدنيا كما هو الملائم لقوله : { فاغفر للذين تابوا } وقوله : { وأدخِلهم جَنَّات عَدننٍ التي وعَدتَّهُم } \\[ غافر : 8 \\] وقوله : { ومَن تَقِ السَّيِئات } \\[ غافر : 9 \\] الخ وقد قال في الآية الأخرى { ويستغفرون لمن في الأرض } \\[ الشورى : 5 \\] أي من المؤمنين كما تقدم .ومعنى تجدد الإِيمان المستفاد من { ويؤمنون } تجدد ملاحظته في نفوس الملائكة وإلا فإن الإِيمان عقد ثابت في النفوس وإنما تجدده بتجدد دلائله وآثاره . وفائدة الإخبار عنهم بأنهم يؤمنون مع كونه معلوماً في جانب الملائكة التنويهُ بشأن الإِيمان بأنه حال الملائكة ، والتعريضُ بالمشركين أن لم يكونوا مثل أشرف أجناس المخلوقات مثل قوله تعالى في حق إبراهيم { وما كان من المشركين } \\[ الأنعام : 161 \\] .وجملة { رَبَّنا وَسِعْتَ كُلَّ شيء رَحْمَة وعِلمَاً } مبيّنة ل { يستغفرون } ، وفيها قول محذوف دلت عليه طريقة التكلم في قولهم : { ربنا } .والباء في { بِحَمْد رَبهِم } للملابسة ، أي يسبحون الله تسبيحاً مصاحباً للحمد ، فحذف مفعول { يسبحون } لدلالة المتعلِّق به عليه .والمراد ب { الذين آمنوا } المؤمنون المعهودون وهم المؤمنون بمحمد صلى الله عليه وسلم لأنهم المقصود في هذا المقام وإن كان صالحاً لكل المؤمنين .وافتتح دعاء الملائكة للمؤمنين بالنداء لأنه أدخل في التضرع وأرجى للإِجابة ، وتوجهوا إلى الله بالثناء بسعة رحمته وعلمه لأن سعة الرحمة مما يُطمِع باستجابة الغفران ، وسعة العلم تتعلق بثبوت إيماننِ الذين آمنوا .ومعنى السعة في الصفتين كثرة تعلقاتهما ، وذكر سعة العلم كناية عن يقينهم بصدق إيمان المؤمنين فهو بمنزلة قول القائل ، أنت تعلم أنهم آمنوا بك ووحّدوك .وجيء في وصفه تعالى بالرحمة الواسعة والعلم الواسع بأسلوب التمييز المحوَّل عن النسبة لما في تركيبه من المبالغة بإسناد السعة إلى الذات ظاهراً حتى كأنَّ ذاته هي التي وَسِعَتْ ، فذلك إجمال يستشرف به السامع إلى ما يرِد بعدَه فيجيء بعده التمييز المبيِّن لنسبة السعة أنها من جانب الرحمة وجانب العلم ، وهي فائدة تمييز النسبة في كلام العرب ، لأن للتفصيل بعد الإِجمال تمكيناً للصفة في النفس كما في قوله تعالى : { واشتعل الرأس شيباً } \\[ مريم : 4 \\] . والمراد أن الرحمة والعلم وَسِعَا كل موجود ، الآن ، أي في الدنيا وذلك هو سياق الدعاء كما تقدم آنفاً ، فما من موجود في الدنيا إلا وقد نالته قسمة من رحمة الله سواء في ذلك المؤمن والكافر والإِنسان والحيوان .و { كُلَّ شيءٍ } كل موجود ، وهو عام مخصوص بالعقل بالنسبة للرحمة ، أي كل شيء محتاج إلى الرحمة ، وتلك هي الموجودات التي لها إدراك تدرك به الملائم والمنافر والنافع والضار ، من الإِنسان والحيوان ، إذ لا فائدة في تعلق الرحمة بالحَجر والشجر ونحوهما . وأما بالنسبة إلى العلم فالعموم على بابه قال تعالى : { ألا يعلم من خلق } \\[ الملك : 14 \\] .ولما كان سياق هذا الدعاء أنه واقع في الدنيا كما تقدم اندفع ما عسى أن يقال إن رحمة الله لا تسع المشركين يوم القيامة إذ هم في عذاب خالد فلا حاجة إلى تخصيص عموم كل شيء بالنسبة إلى سعة الرحمة بمخصصات الأدلة المنفصلة القاضية بعدم سعة رحمة الله للمشركين بعد الحساب .وتَفَرع على هذه التوطئة بمناجاة الله تعالى ما هو المتوسَّل إليه منها وهو طلب المغفرة للذين تابوا لأنه إذا كان قد عَلم صدق توبة من تاب منهم وكانت رحمته وسعت كلَّ شيء فقد استحقوا أن تشملهم رحمته لأنهم أحرياء بها .ومفعولُ { فاغفر } محذوف للعلم ، أي اغفر لهم ما تابوا منه ، أي ذنوب الذين تابوا . والمراد بالتوبة : الإِقلاع عن المعاصي وأعظمها الإشراك بالله .واتباع سبيل الله هو العمل بما أمرهم واجتنابُ ما نهاهم عنه ، فالإِرشاد يشبه الطريق الذي رسمه الله لهم ودلهم عليه فإذا عملوا به فكأنهم اتبعوا السبيل فمشَوا فيه فوصلوا إلى المقصود .{ وَقِهم عذاب الجحيم } عطف على { فاغفر } فهو من جملة التفريع فإن الغفران يقتضي هذه الوقاية لأن غفران الذنب هو عدم المؤاخذة به . وعذاب الجحيم جعله الله لِجزاء المذنبين ، إلا أنهم عضدوا دلالة الالتزام بدلالة المطابقة إظهاراً للحرص على المطلوب . والجحيم : شدة الالتهاب ، وسميت به جهنم دارُ الجزاء على الذنوب .\n\n",
      "translations": [
        {
          "translation": "(Those who bear the Throne) of the Beneficent, who are a tenth of the angel carriers, (and all who are round about it) of the angels, (hymn the praises of their Lord) hymn by the command of their Lord (and believe in Him) while believing in Allah (and ask forgiveness) and pray (for those who believe) in Muhammad (pbuh) and in the Qur'an ((saying): Our Lord!) O our Lord! (Thou comprehendest all things in mercy) You filled all things with blessings (and knowledge) and You know all things, (therefore forgive those who repent) from idolatry (and follow Your way) Your religion: Islam. (Ward off from them the punishment of hell) drive away from them the torment of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ } وهم الكروبيون الذين سبقوا بحمل العرش الإلهي\n وحفظ ما انعكس فيهم من تجلياته الجمالية بدوام المراقبة والمطالعة بوجهه الكريم { وَمَنْ حَوْلَهُ } من الملائكة الذين يطوفون حول العرش\n ويقتفون أثر أولئك الحملة السابقين كلهم { يُسَبِّحُونَ } وينزهون الحق عن سمات الحدوث والإمكان\n ويقدسونه عن عروض السهو والنيسان\n إذ كمال ما يدرك المدرك منه سبحانه إنما هو التسبيح والتقديس\n وإلا فالأمر أعز وأعلى من أن يحيط به الآراء ويحوم حوله الأهواء\n ويواظبون { بِحَمْدِ رَبِّهِمْ } على ما أولاهم نعمة التوجه إليه والتحنن نحوه\n\n\n{ وَ } بالجملة: { يُؤْمِنُونَ بِهِ } سبحانه\n ويوحدونه\n ويعتقدون أوصافه العليا وأسماؤه الحسنى\n وإن عجزوا عن كنه ذاته { وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُواْ } أي: يطلبون العفو والستر منه سبحانه لذنوب إخوانهم الذين آمنوا بوحدة الحق وكمالات أسمائه وصفاته\n مثل إيمانهم سواء كانوا سماويين أو أرضيين\n قائلين مناجين مع ربهم حين استغفارهم: { رَبَّنَا } يا من ربانا على فطرة تسبيحك وتقديسك\n ومداومة حمدك وثنائك\n أنت بذاتك بمقتضى كرمك وجودك { وَسِعْتَ كُـلَّ شَيْءٍ رَّحْمَةً وَعِلْماً } أي: وسعت رحمتك\n وأحاطت حضرة علمك على كل ما لمع عليه بروق تجلياتك وشروق شمس ذاتك { فَٱغْفِرْ } لسعة رحمتك وجودك { لِلَّذِينَ تَابُواْ } ورجعوا نحو بابل نادمي\n وامحُ عن عيون بصائرهم سبل الغير والسوى في جنب بابك { وَٱتَّبَعُواْ } بالعزيمة الصادقة الخالصة { سَبِيلَكَ } الذي أرشدتهم إليه بوحيك على رسلك { وَقِهِمْ عَذَابَ ٱلْجَحِيمِ } [غافر: 7] أي: احفظهم عن عذاب الطرد والحرمان المعد لأصحاب الخسران في جميع حجتهم الخذلان\n\n\n{ رَبَّنَا وَأَدْخِلْهُمْ } بفضلك ولطفك { جَنَّاتِ عَدْنٍ } أي: متنزههات العلم والعين والحق { ٱلَّتِي وَعَدْتَّهُمْ } في كتابك لعموم أرباب العناية من عبادك { وَ } كذا أدخل { مَن صَـلَحَ } عندك لفيضان جودك وإحسانك { مِنْ آبَآئِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ } الذين تناسلوا منهم على فطرة التوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الذين }: مبتدأ\n و { يُسبّحون }: خبره\n والجملة: استئناف مسوق لتسلية الرسول صلى الله عليه وسلم ببيان أن أشراف الملائكة ـ عليهم السلام ـ مثابرون على ولاية مَن معه من المؤمنين\n ونصرتهم\n واستدعاء ما يُسعدهم في الدارين\n يقول الحق جلّ جلاله: { الذين يحملون العرش } على عواتقهم ـ وهم محمولون أيضاً بلطائف القدرة\n { ومَن حَوْله } أي: الحافِّين حوله\n وهم الكروبيّون\n سادات الملائكة\n وأعلى طبقاتهم\n قال ابن عباس: حملة العرش ما بين كعب أحدهم إلى أسفل قدميه مسيرة خمسمائة عام\n وقيل: أرجلهم في الأرض السفلى\n ورؤوسهم خرقت العرش\n وهم خشوعٌ\n لا يرفعون طرفهم\n وهم أشد خوفاً من سائر الملائكة\n وقال أيضاً: لمَّا خلق الله حملة العرش\n قال لهم: احملوا عرشي فلم يطيقوا\n فخلق الله مع كل ملك من أعوانهم مثل جنود مَن في السموات ومَن في الأرض مِن الخلق\n فقال لهم: احملوا عرشي\n فلم يطيقوا\n فخلق مع كل واحد منهم مثل جنود سبع سموات وسبع أرضين\n وما في الأرض من عدد الحصى والثرى\n فقال: احملوا عرشي\n فلم يطيقوا\n فقال: قولوا: لا حول ولا قوة إلا بالله العلي العظيم\n فقالوها\n فاستقلوا عرش ربنا\n أي: لَمَّا حملوه بالله أطاقوه\n فلم يحمل عرشه إلا قدرته\n وفي الحديث:\n \" إن الله أمر جميع الملائكة أن يَغدُوا\n ويَرُوحوا بالسلام على حملة العرش\n تفضيلاً لهم على سائر الملائكة \"\n \nوقال وهب بن منبه: حول العرش سبعون ألف صف من الملائكة\n صف خلف صف\n يدورون حول العرش\n يطوفون به\n يُقبل هؤلاء\n ويُدبر هؤلاء\n فإذا استقبل بعضهم بعضاً\n هلّل هؤلاء\n وكبَّر هؤلاء\n ومِن ورائهم سبعون ألف صف قيام\n أيديهم إلى أعناقهم\n قد وضعوها على عواتقهم\n فإذا سمعوا تكبير هؤلاء وتهليلهم\n رفعوا أصواتهم\n فقالوا: سبحانك وبحمدك ما أعظمك وأجلَّك\n أنت الله لا إله غيرك\n أنت الأكبر\n الخلقُ كلهم راجون رحمتك\n ومِن وراء هؤلاء مائة ألف صف من الملائكة\n قد وضعوا اليمنى على اليسرى\n ليس منهم أحد إلا يُسبح الله ـ تعالى ـ بتسبيح لا يُسبحه الآخر\n ما بين جناحي أحدهم مسيرة ثلاثمائة عام\n واحتجب الله عزّ وجل ـ بينه وبين الملائكة الذين هم حول العرش ـ بسبعين حجاباً من ظُلمة\n وسبعين حجاباً من نور\n وسبعين حجاباً من دُرٍّ أبيض\n وسبعين حجاباً من ياقوتٍ أحمر\n وسبعين حجاباً من زمُردٍ أخضر\n وسبعين حجاباً من ثلجٍ\n وسبعين حجاباً من ماءٍ\n إلى ما لا يعلمه إلا الله تعالى\n هـ\n قلت: لمّا أظهر الله العرشَ تجلّى بنورٍ جبروتي رحموتي\n استوى به على العرش\n كما يتجلّى يوم القيامة لفصل القضاء\n ثم ضرب الحُجُب بين هذا التجلي الخاص وبين الملائكة الحافِّين\n ولا يلزم عليه حصر ولا تجسيم إذ تجليات الذات العالية لا تنحصر\n وليست هذه الحُجُب بين الذات الكلية وبين الخلق إذ لا حجاب بينها وبين سائر المخلوقات إلا حجاب القهر والوهم\n\nواخْتُلف في هيئة العرش\n فقيل: إنه مستدير\n والكون كله في جوفه كخردلة في الهواء\n حتى قيل: هو الفلك التاسع\n وقيل: هو منبسط كهيئة السرير\n وله سواري وأعمدة\n وهو ظاهر الأخبار النبوية\n رَوى جعفرُ الصادق عن أبيه عن جده\n أنه قال: إن بين القائمة من قوائم العرش والقائمة الثانية من خفقان الطير المسرعة قياس ألف عام\n وإن ملَكاً يقال له: حزقائيل\n له ثمانية عشر ألف جناح\n ما بين الجناح والجناح خمسمائة عام\n فأوحى الله إليه: أن طِرْ\n فطار مقدار عشرين ألف سنة\n فلم ينل رأسُه قائمةً من قوائم العرش\n ثم طار مقدار ثلاثين ألف سنة فلم ينلها\n فأوحى الله إليه: لو طرت إلى نفخ الصور لم تبلغ ساق عرشي\n هـ\n مختصراً\n وفي حديث آخر:\n \" إن بين القائمة والقائمة من قوائم العرش ستين ألف صحراء\n في كل صحراء ستون ألف عالم\n في كل عالم قدر الثقلين \" \nومع هذا كله يسعه قلب العارف حتى يكون في زاوية منه لأنه محدود\n وعظمة الحق غير محدودة\n وقلب العارف قد تجلّت فيه عظمة الحق\n فوسعها\n بدليل الحديث:\n \" لن تسعني أرضي ولا سمائي\n ووسعني قلب عبدي المؤمن \" \nأي: الكامل\n ثم أخبر تعالى عن حَمَلة العرش ومَن حوله بقوله: { يُسَبِّحُونَ بحمد ربهم } أي: ينزهونه تعالى عما لا يليق بشأنه الجليل\n ملتبسين بحمده على نعمائه التي لا تتناهى\n { ويُؤمنون به } إيماناً يناسب حالهم\n وفائدة ذكره مع علمنا بأن حملة العرش ومَنْ حوله الذي يُسبِّحون بحمد ربهم مؤمنون إظهار لشرف الإيمان وفضيلته\n وإبراز لشرف أهله\n والترغيب فيه\n كما وصف الأنبياء في بعض المواضع بالصلاح\n وفيه تنبيه على أن الملائكة لم يحصل لهم العيان\n وإنما وًصفوا بالإيمان بالغيب\n وهم طبقات: منهم العارفون أهل العيان\n ومنهم أهل الإيمان\n ثم قال تعالى: { ويستغفرون للذين آمنوا } أي: ويستغفرون لمَن شاركهم في حالهم من الإيمان\n وفيه دليل على أن الإشراك يجب أن يكون أدعى شيء إلى النصيحة والشفقة\n وإن تباعدت الأماكن\n وفي نظم استغفارهم لهم في سلك وظائفهم المفروضة عليهم\n من تسبيحهم\n وتحميدهم\n وإيمانهم\n إيذان بكمال اعتنائهم به\n وإشعار بوقوعه عند الله ـ تعالى ـ موقع القبول\n { ربَّنا } أي: يقولون: ربنا\n إمّا بيان لاستغفارهم\n أو حال\n { وَسِعْتَ كلَّ شيء رحمةً وعلماً } أي: وسعت رحمتُك وعلمك كلَّ شيء\n فأزيل الكلام عن أصله\n بأن أسند الفعل إلى صاحب الرحمة والعلم\n ونُصبا على التمييز\n مبالغةً في وصفه ـ تعالى ـ بالرحمة والعلم\n وفي عمومهما\n وتقديم الرحمة لأنها السابقة والمقصودة هنا\n { فاغفرْ للذين تابوا }  أي: للذين علمتَ منهم التوبة\n ليُناسب ذكر الرحمة\n { واتَّبعُوا سبيلَك } أي: طريق الهُدى التي دعوت إليها\n\nوالفاء لترتيب الدعاء على ما قبلها من سعة الرحمة والعلم\n { وَقِهِم عذاب الجحيم } أي: احفظهم منه\n وهو تصريح بعد إشعار للتأكيد\n { ربنا وأَدْخِلهم جناتِ عدنٍ التي وعدتَّهم } إياها\n { ومَن صَلَحَ من آبائهم وأزواجهم وذرياتهم } أي: صلاحاً مصححاً لدخول الجنة في الجملة\n وإن كانوا دون صلاح أصولهم\n و مَن: عُطف على ضمير وعدتهم\n أي: وأَدْخل معهم هؤلاء ليتم سرورهم\n ويتضاعف ابتهاجهم\n قال سعيد بن جبير: يدخل الرجل الجنة\n فيقول: أين أبي؟ أين أمي؟ أين ولدي؟ أين زوجتي؟ فيقال له: لم يعملوا مثل عملك\n فيقول: كنتُ أعمل لي ولهم\n فيقال: أَدخلوهم الجنة\n وسبق الوعد بالإدخال والإلحاق لا يستدعي حصول الموعود بلا توسُّط شفاعة واستغفار\n وعليه بنى قول مَن قال: فائدة الاستغفار للمنيب الكرامة والثواب\n انظر أبا السعود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "110:3",
      "similarity": 0.32861120084914064
    },
    {
      "verse": "27:8",
      "similarity": 0.29893167076362603
    },
    {
      "verse": "20:98",
      "similarity": 0.2868278839019129
    },
    {
      "verse": "44:56",
      "similarity": 0.2828407272953951
    },
    {
      "verse": "26:25",
      "similarity": 0.2757531112649354
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}