{
  "chapter": "غافر",
  "text": "ولقد ارسلنا رسلا من قبلك منهم من قصصنا عليك ومنهم من لم نقصص عليك وما كان لرسول ان ياتى بـاية الا باذن الله فاذا جاء امر الله قضى بالحق وخسر هنالك المبطلون",
  "translations": [
    {
      "translation": "We sent Messengers before you. Some of them We have told you about and others We have not told you about. No Messenger can bring a Sign except with Allah's permission. But when Allah's command comes the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent apostles before you, some of whose account We have related to you, and that of some We have not told you. But no apostle was given a miracle unless God dispensed. But when the decree of God comes the sentence is passed with justice; and the lovers of vice and vanity will then come to grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent many Messengers before you: of them there are some whose account We have narrated to you and there are others whose account We have not narrated to you. It did not lie in any Messenger's power to bring any Sign except with Allah's leave. So when Allah's decree came, the matter was decided with justice, and those steeped in error courted utter loss, then and there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have told you the stories of some of Our Messengers whom We had sent before you and We have not told you the stories of some others. A Messenger is not supposed to show a miracle without the permission of God. When God's decree of punishment comes to pass, He will judge truthfully and the supporters of the falsehood will perish when God's decree of punishemnt comes to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent many Noble Messengers before you, so We have related to you the affairs of some among them, and not related the affairs of some; and no Noble Messenger has the right to bring any sign except with the command of Allah; so the time when the command of Allah comes, the true judgement will be delivered and there will the people of falsehood be ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, indeed We have sent Messengers before you, of some of them We have related to you their story. And of some We have not related to you their story, and it was not given to any Messenger that he should bring a sign except by the leave of Allah. But, when comes the commandment of Allah, the matter will be decided with truth, and the followers of falsehood will then be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent apostles before you: there are some of them that We have mentioned to you and there are others whom We have not mentioned to you, and it was not meet for an apostle that he should bring a sign except with Allah's permission, but when the command of Allah came, judgment was given with truth, and those who treated (it) as a lie were lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Messengers before thee; of some We have related to thee, and some We have not related to thee. It was not for any Messenger to bring a sign, save by God's leave. When God's command comes, justly the issue shall be decided; then the vain-doers shall be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We sent messengers before thee, among them those of whom We have told thee, and some of whom We have not told thee; and it was not given to any messenger that he should bring a portent save by Allah's leave, but when Allah's commandment cometh (the cause) is judged aright, and the followers of vanity will then be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before your time We sent other messengers: of them there are some whose story We have related to you, and some whose story We have not related to you. It was not [possible] for any messenger to bring a sign except by the leave of God: but when the command of God was issued, the matter was decided in truth and justice. There and then, those who stood on falsehoods perished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We have sent apostlesy before thee, of them are these whose store We have recounted Unto thee and these whose story We have net recounted Unto thee. And it was not possible for anv apostle that he should bring a sign san by Allah's leave. So when the commade of Allah cometh, judgment will be given with truth, and then will lose the followers of falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have sent apostles before you. Of them are those We have recounted to you, and of them are those We have not recounted to you. An apostle may not bring any sign except by Allah’s permission. Hence, when Allah’s edict comes, judgment is made with justice, and it is thence that the falsifiers become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did aforetime send messengers before thee: of them there are some whose story We have related to thee, and some whose story We have not related to thee. It was not (possible) for any messenger to bring a sign except by the leave of Allah: but when the Command of Allah issued, the matter was decided in truth and justice, and there perished, there and then those who stood on Falsehoods.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, indeed We have sent Messengers before you (O Muhammad SAW); of some of them We have related to you their story and of some We have not related to you their story, and it was not given to any Messenger that he should bring a sign except by the Leave of Allah. So, when comes the Commandment of Allah, the matter will be decided with truth, and the followers of falsehood will then be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent other Messengers before you; of some, We have already told you, of others We have not told you. Yet it was not for any Messenger to bring a verse except by the permission of Allah. And when the command of Allah comes the matter will be justly decided; and the vaindoers will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent messengers before you. Some of them We told you about, and some We did not tell you about. No messenger can bring a miracle except by leave of God. Then, when the command of God is issued, fair judgment will be passed, and there and then the seekers of vanity will lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already sent messengers before you. Among them are those [whose stories] We have related to you, and among them are those [whose stories] We have not related to you. And it was not for any messenger to bring a sign [or verse] except by permission of Allah. So when the command of Allah comes, it will be concluded in truth, and the falsifiers will thereupon lose [all].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:78] And verily We sent messengers before you. Of them are those whom We have recounted to you, and of them are those whom We have not recounted to you: it is reported that God, exalted be He, sent 8,00O Prophets, 4,00O Prophets [sent] from among the Children of Israel and [the other] 4,000 from among the remainder of mankind. And it was never [permitted] for any messenger, from among them, to bring a sign except with God’s permission, for they are [also] servants enthralled [by Him]. Hence when God’s command comes, for the chastisement to be sent down on the disbelievers, judgement, between the messengers and their deniers, is passed justly; and it is thence that the advocates of falsehood become losers, that is to say, [it is thence that] the judgement and the loss become manifest for mankind, although such [advocates of falsehood] will have always been losers always before that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily We sent messengers before thee) to their own folks, (among them) i.e. the messengers (those of whom We have told you) We named them for you so that you know them by name, (and some of whom We have not told thee) and some of them We did not name, and therefore you do not know them; (and it was not given to any messenger that he should bring a portent) a sign (save by Allah's leave) save by Allah's command; this is because they asked the Prophet (pbuh) to bring them a sign, (but when Allah's commandment cometh) when Allah's punishment came upon those past nations ((the cause) is judged aright) they are punished justly; it is also said this means: on the Day of Judgement Allah judges justly between the messengers and the nations to which they were sent, (and the followers of vanity) the disbelievers (will then be lost.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ليس لك أن تتعب نفلك بتعجيل العذاب عليهم قل حلول الأجل المقدر من عندنا\n إذ { لَقَدْ أَرْسَلْنَا } من مقام جودنا { رُسُلاً } كثيراً { مِّن قَبْلِكَ مِنْهُم مَّن قَصَصْنَا } قصتهم { عَلَيْكَ } في كتابك { وَمِنْهُمْ مَّن لَّمْ نَقْصُصْ عَلَيْكَ } ولم نذكر قصتهم في كتابك\n إذ ما يعلم جنود ربك وما جرى عليهم إلا هو\n\n\n{ وَ } بالجملة: { مَا كَانَ } أي: ما صح وجاز { لِرَسُولٍ } من الرسل { أَن يَأْتِيَ } ويعجل { بِآيَةٍ } مقترحة أو غير مقترحة من تلقاء نفسه { إِلاَّ بِإِذْنِ ٱللَّهِ } وبمقتضى مشيئته وإرادته سبحانه\n بل أن ينتظر الوقت الذي عين سبحانه ظهورها فيه\n إذ جميع الآيات والمعجزات موهوبة لله\n مقسومة بين أنبيائه ورسله بمقتضى قسمته سبحانه في حضرة علمه ولوح قضائه\n لا يسع لأحد منهم أن يعجل بها\n أو يؤخر عن وقتها\n بل { فَإِذَا جَـآءَ أَمْرُ ٱللَّهِ } العليم الحكيم بتعذيب المشركين وإثابة الموحدين { قُضِيَ بِٱلْحَقِّ } جميع المقتضيات الإلهية\n سواء كانت من العقوبات والمثوبات { وَ } كما { خَسِرَ هُنَالِكَ } أي: عند وقوع المقضي وظهوره { ٱلْمُبْطِلُونَ } [غافر: 78] المستوجبون لأنواع العذاب والنكال\n وربح حينئذ المستحقون لأصناف المثوبات واللذات الروحانية\n\n\nوكيف لا يكون مقاليد الأمور بيد الله وقبضته وقدرته\n إذ { ٱللَّهُ } المتفرد بالألوهية والربوبية هو { ٱلَّذِي جَعَلَ لَكُمُ ٱلأَنْعَامَ } مسخرة مقهورة لكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { ولقد أرسلنا رسلاً من قبلك } فأُوذوا وصبروا حتى جاءهم نصرنا\n { منهم مَن قَصصْنا عليك } في القرآن\n { ومنهم مَن لم نقصصْ عليك } \n قيل: عدد الأنبياء ـ عليهم السلام ـ مائة ألف وأربعمائة وعشرون ألفاً\n والمذكور قصصهم في القرآن أفراد معدودة\n قال الطيبي: والصحيح ما روينا عن أحمد بن حنبل\n عن أبي ذر\n قلت: يا رسول الله\n كم عدد الأنبياء؟ قال:\n \" مائة ألف وأربعة وعشرون ألفاً\n الرسل من ذلك ثلاثمائة وخمسة عشر جمّاً غفيراً \" \nهـ\n وقد تكلم في الحديث بالضعف والصحة والوضع\n وقيل: عدتهم ثمانية آلاف\n أربعة آلاف نبيّ من بني إسرائيل\n وأربعة آلاف من سائر الناس\n وعن عليّ كرّم الله وجهه: \" إنه الله تعالى بعث نبيّاً أسود\n فهو ممن لم تُذكر قصته في القرآن \"\n فقوله تعالى: { ومنهم مَن لم نقصص عليك } أي: في القرآن\n فلا ينافي إخباره بمطلق العدد على ما في حديث أبي ذر\n { وما كان } أي: ما صحّ\n ولما استقام { لرسولٍ } منهم { أن يأتيَ بآيةٍ } مما اقترح عليه قومه\n { إِلا بإذن الله }\n فإنَّ المعجزات على تشعُّب فنونها\n عطايا من الله تعالى\n قسمها بينهم على حسب المشيئة\n المبنية على الحِكَم البالغة\n وهذا جواب اقتراح قريش على رسول الله الآيات عناداً\n يعني إنَّا قد أرسلنا كثيراً من الرسل\n وما استقام لأحد منهم أن يأتي بآية { إِلا بإذن الله } ومشيئته\n فمَن لي بأن آتي بآية مما تقترحونه إِلاَّ أن يشاء الله\n ويأذن في الإتيان بها؟ { فإذا جاء أمرُ الله } بهلاكهم\n أو: بقيام الساعة\n { قُضي بالحقِ } أي: بإنجاء المُحق وإثابته\n وإهلاك المبطل وتعذيبه\n { وخَسِرَ هنالك المبطلون } أي: المعاندون المقترحون للآيات\n أو: المتمسكون بالباطل\n فيدخل المقترحون المعاندون دخولاً أولياً\n الإشارة: فاصبر أيها المتوجه إلى الله على الأذى وحمل الجفاء\n فإما أن ترى ما وُعد أهلُ الإنكار على الأولياء\n من التدمير\n وقطع الدابر\n في حياتك\n أو يلحقهم بعد موتك\n ولقد أُوذي من قبلك\n منهم مَن عرفت ومنهم مَن لم تعرف\n وما صحّ لأحد منهم أن يُظهر كرامةً إلا بإذن الله\n فإذا جاء أمر الله وقامت القيامة\n قُضي بالحق\n فيرتفع أهل الصبر من المقربين\n في أعلى عليين\n وينخفض أهل الإذاية في أسفل سافلين\n ثم ذكَّرهم بالنعم الحسية\n فقال: { ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلأَنْعَامَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:44",
      "similarity": 0.5205012663559154
    },
    {
      "verse": "40:85",
      "similarity": 0.4903239218163286
    },
    {
      "verse": "7:119",
      "similarity": 0.4539042051762899
    },
    {
      "verse": "10:30",
      "similarity": 0.3978572337685455
    },
    {
      "verse": "33:11",
      "similarity": 0.33668481374112114
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/40:78.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/40:78.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}