{
  "chapter": "غافر",
  "text": "ولكم فيها منفع ولتبلغوا۟ عليها حاجة فى صدوركم وعليها وعلى الفلك تحملون",
  "translations": [
    {
      "translation": "You gain various benefits from them, and on them you can obtain what your hearts desire, and on them and on the ships you are transported.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are advantages for you in them, so that you may satisfy your needs through them, and may be borne upon them and on ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them there are also other benefits for you, and through them you fulfil your heartfelt need (to reach places), and you are borne along upon them as upon the ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may also obtain other benefits from them. You may ride them to seek whatever you need or be carried by them as ships carry you by sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in them are numerous benefits for you, and for you to reach your hearts’ desires while riding them – and you ride upon them and upon the ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you have (many other) benefits from them, and that you may reach by their means a desire that is in your breasts, and on them and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are advantages for you in them, and that you may attain thereon a want which is in your breasts, and upon them and upon the ships you are borne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "other uses also you have in them; and that on them you may attain a need in your breasts, and upon them and on the ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Many) benefits ye have from them - and that ye may satisfy by their means a need that is in your breasts, and may be borne upon them as upon the ship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you have other benefits in them too. You can reach any destination you wish on them: they carry you by land, as ships carry you on the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are other benefits in them for you and that ye may attain thereby to any need that is in Your breasts and upon them and upon ships ye are borne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there are [numerous] uses in them for you, and that over them you may satisfy any need that is in your breasts, and you are carried on them and on ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are (other) advantages in them for you (besides); that ye may through them attain to any need (there may be) in your hearts; and on them and on ships ye are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you have (many other) benefits from them, and that you may reach by their means a desire that is in your breasts (i.e. carry your goods, loads, etc.), and on them and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for you there are other uses in them, and that upon them you may reach a need in your chests, and upon them and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in them you have other benefits as well, and through them you satisfy your needs. And on them, and on the ships, you are transported.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for you therein are [other] benefits and that you may realize upon them a need which is in your breasts; and upon them and upon ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:80] And there are [other] uses for you in them, such as [their] milk, offspring, fur and wool, and that by them you may satisfy any need that is in your breasts, namely, to transport heavy loads to [other] lands, and on them, on land, and on the ships, in the sea, you are carried.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Many) benefits ye have from them) from their milk and wool (and that ye may satisfy by their means a need that is in your breasts) in your hearts, (and may be borne upon them) in the land (as upon the ship) you travel by sea.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } جعل { لَكُمْ فِيهَا } أيضاً { مَنَافِعُ } كثيرة كالألبان والصواف والأشعار والأوبار، وغير ذلك { وَلِتَـبْلُغُواْ } أي: لتصلوا، وتنالوا بالحمل والركوب { عَلَيْهَا } أي: على الأنعام { حَاجَةً } مطلوبة لكم مركوزة { فِي صُدُورِكُمْ } ونفوسكم، ولولا ركوبكم وحملكم عليها، لم تصلوا إليها إلا بشق النفس { وَ } بالجملة: { عَلَيْهَا } أي: على الأنعام في البر { وَعَلَى ٱلْفُلْكِ } في البحر { تُحْمَلُونَ } [غافر: 80] يعني: سهل عليكم سبحانه أمور معاشكم في إقامتكم وأسفاركم تتميماً لتربيتكم وحفظكم؛ لتواظبوا على شكر نعمه، وتلازموما لعبادته وعبوديته بالتبتل والإخلاص التام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}