{
  "chapter": "غافر",
  "text": "فلما جاءتهم رسلهم بالبينت فرحوا۟ بما عندهم من العلم وحاق بهم ما كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "When their Messengers brought them the Clear Signs, they exulted in the knowledge they had and then were engulfed by the very things they mocked.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For when Our apostles came to them with clear proofs, they boasted and exulted at the knowledge they possessed; but what they used to mock recoiled back on them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their Messengers came to them with Clear Signs, they arrogantly exulted in whatever knowledge they had. They were then encompassed by what they had mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were far too content with their own knowledge (to pay attention to the Messengers) when Our Messengers came to them with illustrious evidence. They were encompassed by the torment for mocking Our guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when their Noble Messengers came to them with clear signs, they remained happy over the worldly knowledge they possessed, and upon them only reverted what they used to mock at!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when their Messengers came to them with clear proofs, they were glad (and proud) with that which they had of the knowledge (of worldly things). And that at which they used to mock, surrounded them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when their apostles came to them with clear arguments, they exulted in what they had with them of knowledge, and there beset them that which they used to mock.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when their Messengers brought them the clear signs, they rejoiced in what knowledge they had, and were encompassed by that they mocked at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their messengers brought them clear proofs (of Allah's Sovereignty) they exulted in the knowledge they (themselves) possessed. And that which they were wont to mock befell them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When messengers came to them with clear signs, they revelled in whatever knowledge they had, and so they were engulfed by the very punishment they mocked:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their apostles came Unto them with evidences, they exulted in the knowledge which was with them, and there surrounded them that which they had been mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their apostles brought them manifest proofs, they boasted about the knowledge they possessed, but they were besieged by what they used to deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For when their messengers came to them with Clear Signs, they exulted in such knowledge (and skill) as they had; but that very (Wrath) at which they were wont to scoff hemmed them in.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when their Messengers came to them with clear proofs, they were glad (and proud) with that which they had of the knowledge (of worldly things): And that at which they used to mock, surrounded them (i.e. the punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their Messengers brought them clear verses they rejoiced in such knowledge as they had; but they were encompassed by that which they mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their messengers came to them with clear proofs, they rejoiced in the knowledge they had, and the very things they used to ridicule besieged them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their messengers came to them with clear proofs, they [merely] rejoiced in what they had of knowledge, but they were enveloped by what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:83] And when their messengers brought them clear signs, manifest miracles, they, the disbelievers, exulted in the knowledge they, the messengers, possessed, an exultation that entailed mockery and amusement, as they rejected such [knowledge], and there besieged, befell, them that which they used to deride, namely, the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when their messengers brought them clear proofs) commands and prohibitions (they exulted in the knowledge they (themselves) possessed) they exulted in Religion and works they had; but this was out of surmise since they did not have any certainty. (And that which they were wont to mock) the punishment of mocking their messengers (befell them) surrounded them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَاتِ } أي: فهم في العتو والعناد كانوا كأمثال هؤلاء المسرفين\n لما جاءهم رسلهم المبعوثون إليهم بالمعجزات والآيات الواضحات\n المبينة لطريق الحق\n لم يلتفتوا ولم يلقوا أسماعهم نحوها تعنتاً واستكباراً\n بل { فَرِحُواْ بِمَا عِندَهُمْ مِّنَ ٱلْعِلْمِ } أي: الجهل المركب المركوز في طباعهم من تقليد آبائهم على أوجه الأصرار\n بلا التفات منهم إلى ما ظهر من الوحي الإلهي المنزل على رسلهم\n بل كذبوهم واستهزءوا معهم { وَ } لهذا { حَاقَ } وأحاط { بِهِم } وبال { مَّا كَانُواْ بِهِ يَسْتَهْزِئُونَ } [غافر: 83] حين دعوة الرسل وإرشادهم إلى طريق الحق بأنواع الوعد والوعيد\n وكانوا على ما هم عليه من العناد مصرين مستكبرينز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما جاءتهم رُسلهم بالبيناتِ } بالمعجزات الواضحة، { فرحوا بما عندهم من العلم } يريد علمهم بأمور الدنيا، ومعرفتهم بتدبيرها، كما قال:\n\n[الروم: 7]، فلما جاءتهم الرسل بعلوم الديانة، والتأهُّب ليوم القيامة، وهي أبعد شيء من علمهم لبعثِها على رفض الدنيا، والتباعد عن تتبع ملاذها، لم يلتفتوا إليها، وصغّروها، واستهزؤوا بها، واعتقدوا أنه لا علم أنفع وأجلب للفؤاد من علمهم، ففرحوا به\n أو: علم التنجيم والفلسفة، والدهريّين فإنهم كانوا إذا سمعوا بالوحي دفعوه، وصغّروا علم الأنبياء إلى علمهم، واعتقدوا عندهم علماً يستغنون به عن علم الأنبياء ـ عليهم السلام ـ ولما سمع بقراط بموسى عليه السلام قيل له: لو هاجرت إليه! فقال: نحن قوم مهذَّبون، فلا حاجة إلى مَن يُهذّبنا\n ورأى بعضُ الصالحين النبيَّ صلى الله عليه وسلم فسأله عن ابن سيرين، فقال له:\n\n \" إِنه أراد أن يصل إلى الله بلا واسطة، فانقطع عن الله \" \n\nوعلى فرض وقوفهم بالتجريد والرياضة على انكشاف حضرة القدس، فلا يظفرون بالعبودية، ولا بالفناء في توحيد الربوبية، والتخلُّص من لَوَث وجودهم، والشأن أن تكون عين الاسم، لا أن تعرف الاسم والعين، إنما تقتبس من مشكاة مهبط الوحي، وانصباب أنوار الغيب إنما تفيض بواسطة دُرة الوجود، نبينا صلى الله عليه وسلم، ومظهر سر العيان الأحدي الأحمدي، فافهم\n قاله شيخ شيوخنا، سيدي عبد الرحمن الفاسي\n قال تعالى: { وحاقَ بهم ما كانوا به يستهزئون } أي: نزل بهم عقوبة استخفافهم بالحق، وتعظيمهم واغتباطهم بالباطل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:34",
      "similarity": 0.7330706672215764
    },
    {
      "verse": "6:10",
      "similarity": 0.7262971195882227
    },
    {
      "verse": "21:41",
      "similarity": 0.7262971195882227
    },
    {
      "verse": "45:33",
      "similarity": 0.6989199734612423
    },
    {
      "verse": "39:48",
      "similarity": 0.6750936672761414
    }
  ]
}