{
  "chapter": "غافر",
  "text": "فلم يك ينفعهم ايمنهم لما راوا۟ باسنا سنت الله التى قد خلت فى عباده وخسر هنالك الكفرون",
  "translations": [
    {
      "translation": "But when they saw Our violent force their iman was of no use to them. That is the pattern Allah has always followed with His slaves. Then and there the kafirun were lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then their affirming served them nothing after they had seen Our torment. This is the law of God that has prevailed among His creatures, Then the unbelievers went to rack and ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their believing after they had seen Our chastisement did not avail them. That has been Allah's Way concerning His servants. And the unbelievers courted utter loss, then and there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their faith proved to be of no benefit to them when they became subject to Our torment. Such was God's prevailing tradition among His servants in the past. Thus were the unbelievers destroyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So their accepting of faith did not benefit them when they saw Our punishment; the tradition of Allah which has passed among His bondmen; and there were the disbelievers ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their Faith could not avail them when they saw Our punishment. (Like) this has been the way of Allah in dealing with His servants. And there the disbelievers lost utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their belief was not going to profit them when they had seen Our punishment; (this is) Allah's law, which has indeed obtained in the matter of His servants, and there the unbelievers are lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their belief when they saw Our might did not profit them -- the wont of God, as in the past, touching His servants; then the unbelievers shall be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their faith could not avail them when they saw Our doom. This is Allah's law which hath ever taken course for His bondmen. And then the disbelievers will be ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but believing after seeing Our punishment did not benefit them at all: this is the law of God to deal with His creatures, and thus the disbelievers were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their belief profited them naught when they saw our prowess. This hath been Allah's dispensation that hath- been in regard to His bondmen. And then there were lost the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their faith was of no benefit to them when they sighted Our punishment—Allah’s precedent, which has passed among His servants, and it is thence that the faithless will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their professing the Faith when they (actually) saw Our Punishment was not going to profit them. (Such has been) Allah's Way of dealing with His Servants (from the most ancient times). And even thus did the Rejecters of Allah perish (utterly)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their Faith (in Islamic Monotheism) could not avail them when they saw Our punishment. (Like) this has been the way of Allah in dealing with His slaves. And there the disbelievers lost utterly (when Our Torment covered them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they saw Our Might their belief did not benefit them! It is the way of Allah that has passed concerning His worshipers. There, the unbelievers shall be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their faith could not help them once they witnessed Our might. This has been God’s way of dealing with His servants. And there and then the disbelievers lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But never did their faith benefit them once they saw Our punishment. [It is] the established way of Allah which has preceded among His servants. And the disbelievers thereupon lost [all].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:85] But their faith was of no benefit to them when they saw Our doom — [This is] God’s way (sunnata’Llāhi is in the accusative because it functions as a verbal noun from an implicit verb of the same expression) with the believers, among all communities, which is that faith is of no benefit to them once the chastisement has been sent down, which has its precdent; and it is thence that the disbelievers will be losers — [it is thence that] their status as losers will become apparent to all [of mankind], even though they will have always been losers before that. Meccan: it consists of 53 or 54 verses, revealed after [sūrat] Ghāfir.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But their faith could not avail them when they saw Our doom) which came to destroy them, for faith upon the advent of Allah's punishment is of no value; but it is also said that such faith avails the person who declares it, just as repentance in such a moment benefits. (This is Allah's law) this is Allah's wont (which hath ever taken course for his bondsmen) that He sends His punishment upon them whenever they disbelieve, and rejects faith and repentance upon the advent of His punishment. (And then the disbelievers) in Allah (will be ruined) when the punishment visits them'. And of the surah in which the prostration is mentioned, which is all Meccan: Surah 41: They Are Exposited (Fussilat) And of the surah in which the prostration is mentioned, which is all Meccan:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمْ يَكُ يَنفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْاْ بَأْسَنَا } إذ حينئذ قد انقضى زمان التدارك والتفلافي\n وبالجملة: قد كانت هذه الديدنة المستمرة { سُنَّتَ ٱللَّهِ } العليم الحكيم { ٱلَّتِي قَدْ خَلَتْ } ومضت { فِي عِبَادِهِ } المستكبرين عن إطاعته وانقياده حين دعوة الرسل وإرشادهم { وَ } بعد حلول أوان اليأس ونزول العذاب { خَسِرَ هُنَالِكَ } أي: عنده { ٱلْكَافِرُونَ } [غافر: 85] المصرون على الإنكار والاستهزاء خسراناً عظيماً في الدنيا\n وفي الآخرة أعظم منه وأدوم\n أعاذنا الله وعموم عباده المؤمنين من بأسه وبطشه مبنِّه وجوده\n\n\nخاتمة السورة\n\nعليك أيها المحمدي القاصد نحو الحق المتوجه إلى توحيده - وفقك الله على إنجاح مهامك\n وأوصلك إلى منتهى مقصدك ومرامك - أن تكون على خبرة كاملة من آيات الله النازلة من عنده سبحانه\n لإهداء عباده التائهين في فضاء وجوده وعبرة تامة سريان وحدته الذاتية على عموم هياكل ما لمع عليه بروق تجلياته الجمالية والجلالية المنتشئة من ذاته حسب شئونه وتطوراته المتفرعة على أسمائه الحسنى وأوصافه العظمى\n\n\nفلك ألاَّ تغفل في عموم أحوالك عن مطالعة جمال الله وجلاله في كل ذرة من ذرائر الأكوان على وجه الاستبصار والاعتبار\n بلا شائبة شك وإنكار وتردد واستكبار\n لئلا تلحق بالأخسرين الذين يؤمنون بالله وتوحيده\n حين يكُ ينفعهم إيمانهم\n لانقضاء نشأة التلافي والاختبار\n وذلك حين يعرضون على الملك الجبار\n ويساقون إلى النار بأنواع الخسار والبوار\n\n\nربنا آتنا من لدنك رحمة وقنَّا عذاب النار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلم يَكُ ينفعهم إِيمانُهم لَمّا رأَوْا بأسَنَا } أي: فلم يستقم\n ولم يصح أن ينفعهم إيمانهم عند مجيء العذاب لأن النافع هو الإيمان الاختياري\n لا الاضطراري\n { سُنَّتَ اللهِ التي قد خلتْ في عباده } أي: سَنَّ اللهُ ذلك سُنَّة ماضية في عباده\n ألاَّ يُقبل الإيمان إلا قبل نزول العذاب\n وهو من المصادر المؤكدة\n نحو: وعد الله\n ونحوه\n { وخَسِرَ هُنالك الكافرون } أي: وقت رؤيتهم البأس\n\nفهنالك: مكان استعير للزمان\n والكافرون خاسرون في كل أوان\n ولكن يتبيّن خسرانهم إذا عاينوا العذاب\n وفائدة ترادف الفاءات في هذه الآيات: أن { فما أغنى عنهم } نيتجة قوله: { كانوا أكثر منهم } و { فلما جاءتهم رسلهم } كالبيان والتفسير لقوله: { فما أغنى عنهم } \n كقولك: رُزِق زيد المال\n فمَنَع المعروف\n فلم يحسن إلى الفقراء\n و { فلما رأوا بأسنا } تابع لقوله: { فلما جاءتهم } \n كأنه قال: فكفروا فلما رأوا بأسنا آمنوا\n وكذلك { فلم يك ينفعهم إيمانهم } تابع لإيمانهم لمّا رأوا بأس الله\n والله تعالى أعلم\n الإشارة: قد تقدّم مراراً الحث على عبادة التفكُّر\n وقوله تعالى: { فلما جاءتهم رسلهم بالبينات فرحوا بما عندهم من العلم\n\n\n } الآية\n كذلك مَن يَظهر بعلم التجريد\n ويتكلم في أسرار التوحيد\n سَخِرَ منه أهل زمانه\n ويقنعون بما عندهم من علم الرسوم الظاهرة\n وهو علم لا يُغني ولا يُفني لأن جله يتعلق بمنافع الناس\n لا بمنافع القلب\n فلا يُغني القلب\n ولا يُفني الحِس\n إنما ينفع لطالب الأجور\n لا لطالب الحضور ورفع الستور\n وما مثال مَن ظفر بعلم القلوب ـ وهو أسرار التوحيد الخاص ـ إلا كمَن عنده كنز من الفلوس\n ثم ظفر بالذهب الإبريز\n او الإكسير\n فكيف يمكن أن يلتفت إلى الفلوس مَن ظفر بالإكسير؟! ولا يظهر هذا لأهل الظاهر إلا بعد موتهم\n فيؤمنوا به حيث لا ينفعهم\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:13",
      "similarity": 0.5227734679208496
    },
    {
      "verse": "40:78",
      "similarity": 0.4903239218163289
    },
    {
      "verse": "48:23",
      "similarity": 0.4770892391154072
    },
    {
      "verse": "18:44",
      "similarity": 0.47261120335315926
    },
    {
      "verse": "33:62",
      "similarity": 0.47079447746407044
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/040085.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/040085.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/40:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}