{
  "chapter": "غافر",
  "text": "ربنا وادخلهم جنت عدن التى وعدتهم ومن صلح من ءابائهم وازوجهم وذريتهم انك انت العزيز الحكيم",
  "translations": [
    {
      "translation": "Our Lord, admit them to the Gardens of Eden You have promised them, and all of their parents, wives and children who acted rightly. Truly You are the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Admit them, O Lord, to the garden of Eden which You promised them, and those of their fathers, spouses and progeny who are upright. You are truly all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, admit them to the everlasting Gardens You have promised them and those of their fathers and spouses and progeny that were righteous. Surely You alone are Most Mighty, Most Wise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, admit them and their fathers, spouses, and offspring who have reformed themselves to the gardens of Eden which You have promised them. You are Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Our Lord! And admit them into the Gardens of everlasting stay which you have promised them, and those who are virtuous among their forefathers and their wives and their offspring; indeed You only are the Most Honourable, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And make them enter the `Adn (Eternal) Gardens which you have promised them -- and to the righteous among their fathers, their wives, and their offspring! Verily, You are the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! and make them enter the gardens of perpetuity which Thou hast promised to them and those who do good of their fathers and their wives and their offspring, surely Thou are the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and admit them to the Gardens of Eden that Thou hast promised them and those who were righteous of their fathers, and their wives, and their seed; surely Thou art the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And make them enter the Gardens of Eden which thou hast promised them, with such of their fathers and their wives and their descendants as do right. Lo! Thou, only Thou, art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and admit them, Lord, to the Eternal Garden You have promised to them, together with their righteous ancestors, spouses, and offspring: You alone are the Almighty; the All Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! make them enter the Everlasting Gardens Which Thou hast promised them, and also such of their fathers and their spouses and their offspring as verify Thou: Thou art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Admit them into the Gardens of Eden, which You have promised them, along with whoever is righteous among their forebears, their spouses and their descendants. Indeed You are the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And grant, our Lord! that they enter the Gardens of Eternity, which Thou hast promised to them, and to the righteous among their fathers, their wives, and their posterity! For Thou art (He), the Exalted in Might, Full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And make them enter the 'Adn (Eden) Paradise (everlasting Gardens) which you have promised them, and to the righteous among their fathers, their wives, and their offspring! Verily, You are the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Admit them, Our Lord, to the Gardens of Eden which You have promised them, together with those who were righteous among their fathers, their wives, and their offspring. You are the Almighty, the Wise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And admit them, Our Lord, into the Gardens of Eternity, which You have promised them, and the righteous among their parents, and their spouses, and their offspring. You are indeed the Almighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and admit them to gardens of perpetual residence which You have promised them and whoever was righteous among their fathers, their spouses and their offspring. Indeed, it is You who is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:8] Our Lord, and admit them into the Gardens of Eden, as [a place of] residence [for them], that which You have promised them, along with whoever were righteous (wa-man salaha is a supplement [either] to [the pronominal third person plural suffix] hum, ‘them’ in wa-adkhilhum, ‘and admit them’, or in wa‘adttahum, ‘You have promised them’) among their fathers and their wives and their descendants. Surely You are the One Who is the Mighty, the Wise, in what He does.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) O our Lord! (And make them enter the Gardens of Eden) the source of the prophets and righteous (which Thou hast promised them) in the Scripture, (with such of their fathers and their wives and their descendants as do right) as believe in Allah's divine Oneness. (Lo! Thou, only Thou, art the Mighty) in Your dominion and sovereignty, (the Wise) in Your command and decree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبَّنَا وَأَدْخِلْهُمْ } بفضلك ولطفك { جَنَّاتِ عَدْنٍ } أي: متنزههات العلم والعين والحق { ٱلَّتِي وَعَدْتَّهُمْ } في كتابك لعموم أرباب العناية من عبادك { وَ } كذا أدخل { مَن صَـلَحَ } عندك لفيضان جودك وإحسانك { مِنْ آبَآئِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ } الذين تناسلوا منهم على فطرة التوحيد، وحلية الإيمان والعرفان { إِنَّكَ } بذاتك وأسمائك وصفاتك { أَنتَ ٱلْعَزِيزُ } المنيع ساحة عز حضوره عن أن يحوم حوله شائبة وهم أحد من مظاهرك ومصنوعاتك { ٱلْحَكِيمُ } [غافر: 8] في جميع أفعالك الصادرة عنك على كمال الإحكام والإتقان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربنا وأَدْخِلهم جناتِ عدنٍ التي وعدتَّهم } إياها، { ومَن صَلَحَ من آبائهم وأزواجهم وذرياتهم } أي: صلاحاً مصححاً لدخول الجنة في الجملة، وإن كانوا دون صلاح أصولهم، و مَن: عُطف على ضمير وعدتهم، أي: وأَدْخل معهم هؤلاء ليتم سرورهم، ويتضاعف ابتهاجهم\n قال سعيد بن جبير: يدخل الرجل الجنة، فيقول: أين أبي؟ أين أمي؟ أين ولدي؟ أين زوجتي؟ فيقال له: لم يعملوا مثل عملك، فيقول: كنتُ أعمل لي ولهم، فيقال: أَدخلوهم الجنة\n وسبق الوعد بالإدخال والإلحاق لا يستدعي حصول الموعود بلا توسُّط شفاعة واستغفار، وعليه بنى قول مَن قال: فائدة الاستغفار للمنيب الكرامة والثواب\n انظر أبا السعود\n { إِنك أنت العزيزُ الحكيم } أي: الغالب الذي لا يمتنع عليه مقدور، وأنت مع مُلكك وعزتك لا تفعل شيئاً خالياً عن حكمة، وموجب حكمتك أن تفي بوعدك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:23",
      "similarity": 0.8138862710268029
    },
    {
      "verse": "19:61",
      "similarity": 0.6581888202342481
    },
    {
      "verse": "16:31",
      "similarity": 0.5859823165942786
    },
    {
      "verse": "38:50",
      "similarity": 0.5413397090753783
    },
    {
      "verse": "20:76",
      "similarity": 0.5234379929006214
    }
  ]
}