{
  "chapter": "غافر",
  "text": "افلم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم كانوا۟ اكثر منهم واشد قوة وءاثارا فى الارض فما اغنى عنهم ما كانوا۟ يكسبون",
  "translations": [
    {
      "translation": "Have they not travelled in the land and seen the final fate of those before them? They were more numerous than them and greater in strength and left more and deeper traces on earth, but what they earned was of no use to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land and seen how was the end of those before them who were far more numerous than they and more strong, and have left behind them traces on the earth. And yet nothing of what they did profited them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not journey in the land that they may behold the end of those who had gone before them? They were more numerous and greater in strength and left behind more splendid traces in the land. Yet their attainments did not avail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land to see the terrible end of those who lived before them? They were far mightier in both number and power and in what they had established. Their (worldly) gains were of no benefit to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not travel in the land to see what sort of fate befell those before them? They were more than these in number, and they exceeded them in strength and the signs they left behind in the earth – so what benefit did they get from what they earned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the earth and seen what was the end of those before them They were more in number than them and mightier in strength, and in the traces in the land; yet all that they used to earn availed them not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not then journeyed in the land and seen how was the end of those before them? They were more (in numbers) than these and greater in strength and in fortifications in the land, but what they earned did not avail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not journeyed in the land and beheld how was the end of those before them? They were stronger than themselves in might and left firmer traces in the earth; yet that they earned did not avail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land to see the nature of the consequence for those before them? They were more numerous than these, and mightier in power and (in the) traces (which they left behind them) in the earth. But all that they used to earn availed them not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land to see the fate of those who went before them? They were more numerous and mightier and left greater traces of their power on the earth; yet all that they accomplished was of no avail to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the earth so that they may behold what wise hath been the end of those before them. They were more numerous than these, and mightier in strength and the traces in the land. But naught availed them of that which they had been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled over the land so that they may observe how was the fate of those who were before them? They were more numerous than them and were greater [than them] in power and with respect to the effects [they left] in the land. But what they used to earn did not avail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not travel through the earth and see what was the End of those before them? They were more numerous than these and superior in strength and in the traces (they have left) in the land: Yet all that they accomplished was of no profit to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the earth and seen what was the end of those before them? They were more numerous than them and mightier in strength, and in the traces (they have left behind them) in the land, yet all that they used to earn availed them not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never journeyed through the land and seen what was the end of those who have gone before them? They were stronger than themselves in might and left firmer traces upon the earth; yet, whatsoever they earned did not help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed through the land, and seen the outcome for those before them? They were more numerous than they, and had greater power and influence in the land. But what they had achieved availed them nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the land and observed how was the end of those before them? They were more numerous than themselves and greater in strength and in impression on the land, but they were not availed by what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:82]   Have they not travelled across the land to see the nature of the consequence for those before them? They were more powerful than them in might and in [their] vestiges on earth, in the way of large structures and palaces. But what they used to earn did not avail them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not) i.e. the people of Mecca (travelled in the land to see) to reflect on (the nature of the consequence for) on the requital of (those before them) how We destroy them when they disbelieved in their messengers? (They were more numerous than these) than the people of Mecca, (and mightier in power) in physical strength (and (in the) traces (which they left behind them) in the earth) they were keener on the life of this world and travelled more than them in seeking it. (But all that they used to earn) and say and do upon following their religions (availed them not) from Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفَلَمْ يَسِيرُواْ فِي ٱلأَرْضِ } يعني: أينكر المشركون المصرون على الخروج عن مقتضى الحدود الإلهية كمال قدرته سبحانه على أنواع الانتقام والعذاب، فلم يسيروا في الأرض التي هي محل الكون والفساد { فَيَنظُرُواْ } عليها معتبرين من البلاقع والخربة والأطلال المندرسة { كَيْفَ كَانَ عَاقِبَةُ } الأمم الهالكة المسرفة { ٱلَّذِينَ } مضروا { مِن قَبْلِهِمْ } مع أنهم { كَانُوۤاْ أَكْـثَرَ مِنْهُمْ } عَدداً وعُدداً { وَأَشَدَّ قُوَّةً } أي: بسطة واستيلاء { وَ } أحكم { آثَاراً فِي ٱلأَرْضِ } أي: أبنية وقصوراً وقلاعاً وحصوناً مشيدة مرفوعة، ومع ذلك { فَمَآ أَغْنَىٰ } وأدفع { عَنْهُم مَّا كَانُواْ يَكْسِبُونَ } [غافر: 82] عليها من الأمور المذكورة شيئاً من غضب الله وعذابه، بل لحقهم ما لحقهم من العذاب، بحيث لا شعور لهم بأماراته ومقدماته فاستأصلهم بالمرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أَفَلَمْ يسيروا } أي: أَقعدوا فلم يسيروا { في الأرض }  { فينظروا كيف كان عاقبةُ الذين من قبلهم } من الأمم المهْلَكة، { كانوا أكثرَ منهم } عدداً { وأشدَّ قوةً } في الأبدان والأموال، { و } أشد { آثاراً في الأرض } أي: تركوا آثاراً كثيرة بعدهم، من الأبنية، والقبور، والمصانع، فكانوا أشدّ منهم، وقيل: هي آثار أقدامهم في الأرض لِعظم أجرامهم، { فما أَغْنى عنهم ما كانوا يَكْسِبون } أي: لم يغن عنهم ذلك شيئاً حين نزل بهم العذاب، أو: أي شيء أغنى عنهم مكسوبهم أو كسبهم؟ على أنَّ \" ما \" استفهام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:21",
      "similarity": 0.8200355050475753
    },
    {
      "verse": "35:44",
      "similarity": 0.6355426919011965
    },
    {
      "verse": "30:42",
      "similarity": 0.5800985373908887
    },
    {
      "verse": "6:11",
      "similarity": 0.5255232998627899
    },
    {
      "verse": "27:69",
      "similarity": 0.5137368783491679
    }
  ]
}