{
  "chapter": "غافر",
  "text": "وقهم السيـات ومن تق السيـات يومئذ فقد رحمته وذلك هو الفوز العظيم",
  "translations": [
    {
      "translation": "And safeguard them from evil acts. Those You safeguard from evil acts are truly the recipients of Your",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Protect them from evil; and whosoever You preserve from evil on that Day shall have surely received Your mercy. This will be the great triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and guard them against all ills. He whom You guard against ills on that Day, to him You have surely been Most Merciful. That is the great triumph.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, keep them away from evil deeds. Whomever You have saved from evil on the Day of Judgment has certainly been granted Your mercy and this is the greatest triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And save them from the evil consequences of sins; and whomever You save from the evil consequences of sins on that Day – so You have indeed had mercy upon him; and this only is the greatest success.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And save them from the sins, and whomsoever You save from the sins that Day, him verily, You have taken into mercy.\" And that is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep them from evil deeds, and whom Thou keepest from evil deeds this day, indeed Thou hast mercy on him, and that is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard them against evil deeds; whomsoever Thou guardest against evil deeds on that day, on him Thou hast had mercy; and that is indeed the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ward off from them ill-deeds; and he from whom Thou wardest off ill-deeds that day, him verily hast Thou taken into mercy. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Protect them from all evil deeds: those You protect from [the punishment for] evil deeds will receive Your mercy -- that is the supreme success.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And protect them from evils. And whosoever Thou shalt protect from evils on that Day, him Thou hast of a surety taken into mercy and that: it is an achievement mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save them from the ills [of the Day of Retribution]; and whomever You save from the ills that day, You will have had mercy upon him, and that is the great triumph.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And preserve them from (all) ills; and any whom Thou dost preserve from ills that Day,- on them wilt Thou have bestowed Mercy indeed: and that will be truly (for them) the highest Achievement\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And save them from (the punishment, because of what they did of) the sins, and whomsoever You save from (the punishment, because of what they did of) the sins (i.e. excuse them) that Day, him verily, You have taken into mercy.\" And that is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and guard them against all evil deeds. Whosoever You guarded against evil deeds on that Day, surely, You have had mercy upon them, and that is indeed the mighty triumph'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And shield them from the evil deeds. Whomever You shield from the evil deeds, on that Day, You have had mercy on him. That is the supreme achievement.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And protect them from the evil consequences [of their deeds]. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[40:9] And shield them from evil deeds, that is, [from] the chastisement thereof; for whomever You shield from evil deeds that day, the Day of Resurrection, verily him You will have had been merciful to; and that is indeed the supreme triumph’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ward off from them ill deeds) and drive away from them the torment of the Day of Judgement; (and he from whom Thou wardest off ill deeds) and he from whom you drive away the chastisement (that day) on the Day of Judgement, (him verily hast Thou taken into mercy) him indeed have You forgiven, protected and raised in station. (That) i.e. forgiveness and driving away chastisement (is the Supreme Triumph) is the abundant triumph: i.e. to gain the Garden and be saved from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَمَن تَقِ ٱلسَّيِّئَاتِ يَوْمَئِذٍ } أي: من تحفظه أنت بمقتضى لطفك وتوفيقك عن المعاصي في النشأة الأولى { فَقَدْ رَحِمْتَهُ } ألبتة في النشأة الأخرى { وَذَلِكَ } أي: وقايتك وحفظك إياهم عن أسباب الخذلان والحرمان { هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ } [غافر: 9] والكرم العميم واللطف الجسيم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وذلك هو الفوزُ العظيم } الإشارة إلى الرحمة المفهومة من رحمته\n أو: إليها وإلى الوقاية\n أي: ذلك التوقي هو الفوز العظيم الذي لا مطمع وراءه لطامع\n الإشارة: العرش وحملته\n والحافُّون به محمولون بلطائف القدرة لا حاملون في الحقيقة\n بل لا وجود لهم مع الحق\n وإنما هم شعاع من أنوار الذات الأقدس وتجلِّ من تجلياتها\n وقوله تعالى: { يُسبحون بحمد ربهم } \n قال الورتجبي: يُسبّحون الله بما يجدونه من القدس والتنزيه\n حمداً لأفضالِه\n وبأنه منزّه عن النظير والشبيه\n ويؤمنون به في كل لحظة\n بما يرون منه من كشوف صفات الأوليات\n وأنوار حقائق الذات\n التي تطمس في كل لمحة مسالك رسوم العقليات\n وهم يُقرون كل لحظة بجهلهم عن كنه معرفة وجوده\n ثم بيّن أنهم أهل الرأفة\n والرحمة\n والشفقة على أوليائه\n لأنهم إخوانهم في نسب المعرفة والمحبة\n انظر تمامه\n والحاصل: أنهم مع تجلّي أنوار ذاته\n قاصرون عن كنهه\n وحقيقة ذاته\n وغايتهم الإيمان به\n قاله في الحاشية\n قلت: والتحقيق أن المقربين منهم تحصل لهم المعرفة العيانية\n والرؤية للذات في مظاهر التجليات\n كما تحصل لخواص الأولياء في الدنيا\n ولكن معرفة الآدمي أكمل لاعتدال حقيقته وشريعته\n لمَّا اعتدل فيه الضدان\n وأما معرفة الملائكة فتكون مائلة لجهة الشكر والهيمان للطاقة أجسامهم\n فمثلهم كالمرآة بلا طلاء خلفها\n وأمّا ما ورد في بعض الأخبار: أن جبريل لم يرَ الله قط قبل يوم القيامة\n فلا يصح إلا أن يُحمل على أنه لم يره من غير مظهر\n وهذا لا يمكن له ولا لغيره\n وأما رؤيتهم الله يوم القيامة فهم كسائر المؤمنين\n يرونه على قدر تفاوتهم في المراتب والقُرب\n\nقال إمام أهل السنة\n أبو الحسن الأشعري رضي الله عنه\n في كتاب \" الإبانة في أصول الديانة \": أفضل اللذات لأهل الجنة رؤية الله تعالى\n ثم رؤية نبيه صلى الله عليه وسلم\n فلذلك لم يحرم الله أنبياءه المرسَلين\n وملائكته المقرّبين\n وجماعة المؤمنين\n والصدّيقين النظرَ إلى وجهه تعالى\n هـ\n وفي الآية حث على الدعاء للمؤمنين بظهر الغيب\n والاستغفار لهم\n وهو من شأن الأبدال\n أهل الحرمة لعباد الله\n اقتداءً بالملأ الأعلى\n ثم شفع بضد أهل الإيمان\n فقال: { إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوْنَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:60",
      "similarity": 0.7807282092561008
    },
    {
      "verse": "78:31",
      "similarity": 0.7450401534104509
    },
    {
      "verse": "44:57",
      "similarity": 0.7280638109335249
    },
    {
      "verse": "6:16",
      "similarity": 0.6396427818063679
    },
    {
      "verse": "23:111",
      "similarity": 0.5982198571718039
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/40:9.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/40:9.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/40:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}