{
  "chapter": "فصلت",
  "text": "ونجينا الذين ءامنوا۟ وكانوا۟ يتقون",
  "translations": [
    {
      "translation": "But We saved those who believed and took heed for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet We delivered those who believed and were God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We only rescued the believers who had fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We rescued those who accepted faith and were pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved those who believed and had Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered those who believed and guarded (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered those who believed and were godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered those who believed and used to keep their duty to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved those who had attained to faith and were God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered those who believed and had been fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered those who had faith and were Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We delivered those who believed and practised righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved those who believed and used to fear Allah, keep their duty to Him and avoid evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We saved those who believed and feared Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved those who believed and were righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved those who believed and used to fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:18] And We delivered, from it, those who believed and feared, God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We delivered those who believed) in Salih (and used to keep their duty to Allah) and used to ward off disbelief, idolatry and hamstringing the camel.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال قدرتنا على الإنعام والانتقام { نَجَّيْنَا } من تلك الصاعقة المهولة المهلكة القوم { ٱلَّذِينَ آمَنُواْ } برسلنا واهتدوا هدايتهم، مع أنهم كانوا فيهم مجارين معهم { وَ } بسبب تخليصنا إياهم أنهم { كَانُواْ يتَّقُونَ } [فصلت: 18] عن محارمنا ومنهياتنا، مع كونهم مصتفين بكمال الإيمان والتوحيد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ونجينا الذين آمنوا } أي: اختاروا الهدى على العمى، من تلك الصاعقة، { وكانوا يتقون } الضلالة والتقليد\n الإشارة: كل مَن أعرض عن الوعظ والتذكار، ونأى عن صُحبة الأبرار فالصعقة لاحقة به، إما في الدنيا أو في الآخرة\n وقوله تعالى: { فأما عاد فاستكبروا\n\n\n } الآية: أوصاف العبودية أربعة: الضعف، والذل، والفقر، والعجز، فمَن خرج عن واحد منها، فقد تعدّى طوره، واستحقّ الهلاك والهوان، ورمته رياح الأقدار في مهاوي النيران\n وقوله: { وأما ثمود فهديناهم } أي: بيَّنا لهم طريق السير إلينا، على ألسنة الوسائط، فحادُوا عنها، واستحبُّوا العمى على الهدى حيث لم يسبق لهم الهداية في الأزل، فالسوابق تُؤثر في العواقب، والعواقب لا تؤثر في السوابق، فكأن جبلة القوم الضلالة، فمالوا إلى ما جبلوا عليه من قبول الضلالة\n وقوله تعالى: { ونجينا الذين آمنوا } أي: في الدنيا من الصاعقة، وفي الآخرة من السقوط في الهاوية\n قال القشيري: منهم مَن نجَّاهم من غير أن رأوا النار، عَبَروا القنطرةَ ولم يعلموا، وقومٌ كالبرق الخاطف، وهم أعلاهم ـ قلت: بل أعلاهم كالطرف ـ ثم قال: وقوم كالرواكض، وهم أيضاً الأكابر، وقوم على الصراط يسقطون وتردُّهم الملائكة على الصراط، فبَعُدوا\n ثم قال: وقومٌ بعدما دخلوا النار، فمنهم مَن تأخذه إلى كعبيه، ثم إلى ركبتيه، ثم إلى حَقْوَيْه، فإذا بلغ القلب قال الحقُّ للنار: لا تحرقي قلبه، فإنه محترقُ بي\n وقوم يخرجون من النار بعدما أمْتُحِشُوا فصاروا حُمَماً\n هـ منه\n ثم ذكر وعيد أهل الشرك، فقال: { وَيَوْمَ يُحْشَرُ أَعْدَآءُ ٱللَّهِ }\n\n",
      "translations": []
    }
  ]
}