{
  "chapter": "فصلت",
  "text": "فاما عاد فاستكبروا۟ فى الارض بغير الحق وقالوا۟ من اشد منا قوة اولم يروا۟ ان الله الذى خلقهم هو اشد منهم قوة وكانوا۟ بـايتنا يجحدون",
  "translations": [
    {
      "translation": "'Ad were arrogant in the land, without any right, saying, 'Who has greater strength than us?' Did they not see that Allah, who created them, had greater strength than them? But they renounced Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So those who were 'Ad turned insolent unjustly in the land, and said: \"Who is stronger than us?\" Did they not see that God who created them was greater far in power than they? Yet they refused to believe Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Ad, they waxed proud in the land without justification and said: “Who is greater than we in strength?” Did they not see that Allah, Who created them, is greater in strength than they? They continued to deny Our Signs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Ad unjustly sought dominance on earth saying, \"Who is more powerful than us?\" Did they not consider that God created them and that He is more powerful than they were?\" They rejected Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So regarding the A’ad, they were haughty in the land without right, and they said, “Who is more powerful than us?” Did they not realise that Allah, Who created them, is more powerful than them? And they used to deny Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for `Ad, they were arrogant in the land without right, and they said: \"Who is mightier than us in strength\" See they not that Allah Who created them was mightier in strength than them. And they used to deny Our Ayat!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as to Ad, they were unjustly proud in the land, and they said: Who is mightier in strength than we? Did they not see that Allah Who created them was mightier than they in strength, and they denied Our communications?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Ad, they waxed proud in the earth without right, and they said, 'Who is stronger than we in might?' What, did they not see that God, who created them, was stronger than they in might? And they denied Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for A'ad, they were arrogant in the land without right, and they said: Who is mightier than us in power? Could they not see that Allah Who created them, He was mightier than them in power? And they denied Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the tribe of 'Ad, they behaved arrogantly in the land without any justification and said, \"Who is mightier than we in power?\" Did they not see that God, who created them, was mightier than they in power? Still they continued to deny Our signs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the tribe of 'Aad - they grew stiff-necked on the earth without justification, and said: who is mightier than we in strength? Saw they not that Allah who created them,-He was Mightier than they in strength? And Our signs they were wont to gainsay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for [the people of] ‘Ad, they acted arrogantly in the earth unduly, and they said, ‘Who is more powerful than us?’ Did they not see that Allah, who created them, is more powerful than them? They used to impugn Our signs;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now the 'Ad behaved arrogantly through the land, against (all) truth and reason, and said: \"Who is superior to us in strength?\" What! did they not see that Allah, Who created them, was superior to them in strength? But they continued to reject Our Signs!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for 'Ad, they were arrogant in the land without right, and they said: \"Who is mightier than us in strength?\" See they not that Allah, Who created them was mightier in strength than them. And they used to deny Our Ayat (proofs, evidences, verses, lessons, revelations, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Aad, they behaved proudly in the earth without right. 'Who is stronger than us' they would say. Could they not see that Allah, who created them, is stronger than they? But they disbelieved Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Aad, they turned arrogant on earth, and opposed justice, and said, “Who is more powerful than us?” Have they not considered that God, who created them, is more powerful than they? And they went on denying Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:15] As for ‘Ād, they acted arrogantly in the earth without right, and they said, upon their being threatened with the chastisement, ‘Who is more powerful than us in might?’, in other words, [they believed] no one [to be so] — a single man among them could pull out a huge rock from a mountainside and [have the strength to] place it wherever he wished. Did they not see, [did they not] realise, that God, He Who created them, was more powerful than them in might? And they used to deny Our signs, the miracles [We sent down].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for 'Aad) the folk of Hud, (they were arrogant) they were too proud to accept faith (in the land without right) to do so, (and they said) to Hud: (Who is mightier than us in power) who is stronger than us in power and strength such that he might destroy us? (Could they not see) did they not know (that Allah Who created them, He was mightier than them in power) and could easily destroy them? (And they denied Our revelations) and they disbelieved in Our Scripture and Messenger Hud.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم فصل سبحانه ما أجمل بقوله: { فَأَمَّا عَادٌ فَٱسْتَكْبَرُواْ } على عباد الله { فِي ٱلأَرْضِ } التي هي محل الاختبار الإلهي { بِغَيْرِ ٱلْحَقِّ } أي: بلا انقياد وإطاعة إلى دين ونبي يرشدهم إلى طريق الحق { وَ } من كمال تعنتهم وبطرهم { قَالُواْ } على وجه الشرف والمباهاة: { مَنْ أَشَدُّ } على وجه الأرض { مِنَّا قُوَّةً } وأكثر عَدداً وعُدداً\n وأتم بسطة واستيلاء؟!\n\n\nوقالوا هذا حين تخويفهم الرسل بإلمام العذاب عليهم\n وهم كانوا أعظم الناس جسما وأوفرهم قوة وقدرة\n لذلك اغتروا بما عندهم من القوة والثروة\n فكذبوا الرسل وقالوا لهم: نحن ندفع العذاب الذي ادعيتم نزوله أيها الكاذبون بوفور حولنا وقوتنا { أَوَلَمْ يَرَوْاْ } يعني: أيغترون على قوتهم وجسامتهم وينكرون كمال قدرة الله وشدة انتقامه\n ولم يعلموا { أَنَّ ٱللَّهَ } القدير العزيز { ٱلَّذِي خَلَقَهُمْ } وإظهرهم من كتم العدم\n ولم يكونوا شيئاً مذكوراً { هُوَ } سبحانه بذات وكمال أسمائه وصفاته { أَشَدُّ مِنْهُمْ قُوَّةً } وأكمل حولاً وقدرة\n وأحكم بطشاً وانتقاماً { وَ } هم وإن جزموا حقية رسلنا المبعوثين إليهم\n وآياتنا المنزلة عليهم في ظواهرهم وبواطنهم\n لكن { كَانُواْ بِآيَاتِنَا يَجْحَدُونَ } [فصلت: 15] وينكرون بحسب الظاهر عناداً ومكابرة\n اغتراراً بما معهم من الثروة والجسامة\n\n\nوبعدما تمادوا على غيبهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا مَن أشدُّ منا قوةً } \n كانوا ذوي أجسام طوال\n وخلْق عظيم\n بلغ من قوتهم أن الرجل كان يقلع الصخرة من الجبل بيده\n ويلوي الحديد بيده\n { أوَلَمْ يَرَوا } أي: أَوَلَم يعلموا علم عيان { أن الله الذي خلقهم هو أشَدُّ منهم قوةً }؟ أوسعُ منهم قدرة لأنه قادر على كل شيء\n وهم قادرون على بعض الأشياء بإقداره\n { وكانوا بآياتنا } المنزلة على رسلهم { يجحدون } أي: ينكرونها وهم يعرفون حقِيتها\n كما يجحد المودَعُ الوديعة\n و هم: عطف على فاستكبروا\n وما بينها اعتراض\n للرد على كلمتهم الشنعاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:47",
      "similarity": 0.568437163991582
    },
    {
      "verse": "40:63",
      "similarity": 0.5415719362246237
    },
    {
      "verse": "6:33",
      "similarity": 0.536778740502257
    },
    {
      "verse": "29:49",
      "similarity": 0.5353478491882923
    },
    {
      "verse": "41:28",
      "similarity": 0.5128292395403333
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/41:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/41:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}