{
  "chapter": "فصلت",
  "text": "فارسلنا عليهم ريحا صرصرا فى ايام نحسات لنذيقهم عذاب الخزى فى الحيوة الدنيا ولعذاب الءاخرة اخزى وهم لا ينصرون",
  "translations": [
    {
      "translation": "So We sent a howling wind against them on disastrous ill-fated days to make them taste the punishment of degradation in this world. And the punishment of the Next World is even more degrading. And they will not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We let loose on them a violent wind for several days of distress to make them taste a most disgraceful punishment here in this world, and far more shameful will be the punishment in the Hereafter, and there will be no succour for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereupon We sent upon them a fierce wind on inauspicious days that We might make them taste a degrading chastisement in the life of this world. And surely the chastisement of the Hereafter is even more degrading. There will be none to help them there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent upon them a violent wind during a few ill-fated days to make them suffer a disgraceful torment in this life. Their torment in the life to come will be even more disgraceful and they will not receive any help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore sent a violent thunderstorm towards them in their days of misfortune, in order to make them taste a disgraceful punishment in the life of this world; and indeed the punishment of the Hereafter is more disgracing, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We sent upon them a Sarsar wind in days of calamity that We might give them a taste of disgracing torment in this present worldly life. But surely the torment of the Hereafter will be more disgracing, and they will never be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent on them a furious wind in unlucky days, that We may make them taste the chastisement of abasement in this world's life; and certainly the chastisement of the hereafter is much more abasing, and they shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We loosed against them a wind clamorous in days of ill fortune, that We might let them taste the chastisement of degradation in the present life; and the chastisement of the world to come is even more degrading, and they shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor We let loose on them a raging wind in evil days, that We might make them taste the torment of disgrace in the life of the world. And verily the doom of the Hereafter will be more shameful, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so We let loose upon them a raging wind over several inauspicious days, so that We might make them taste the torment of humiliation in the life of this world, and surely the torment of the Hereafter will be more humiliating. They shall have none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore We sent upon them a raging wind in days inauspicious, that We might make them taste the torment of humiliation in the life of the world; and surely the torment of the Hereafter will be more humiliating, nor will they be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so We unleashed upon them an icy gale during ill-fated days, in order that We might make them taste a humiliating punishment in the life of the world. Yet the punishment of the Hereafter will be surely more disgraceful, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent against them a furious Wind through days of disaster, that We might give them a taste of a Penalty of humiliation in this life; but the Penalty of a Hereafter will be more humiliating still: and they will find no help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent upon them furious wind in days of evil omen (for them) that We might give them a taste of disgracing torment in this present worldly life, but surely the torment of the Hereafter will be more disgracing, and they will never be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on the ominous days, We loosed against them a howling wind that We might let them taste the punishment of humiliation in this life; but more humiliating will be the punishment of the Everlasting Life and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We unleashed upon them a screaming wind, for a few miserable days, to make them taste the punishment of shame in this life; but the punishment of the Hereafter is more shameful; and they will not be saved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent upon them a screaming wind during days of misfortune to make them taste the punishment of disgrace in the worldly life; but the punishment of the Hereafter is more disgracing, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:16] So We unleashed upon them a raging wind, cold and violent, but without rain, during [some] ill-fated days (read nahisātin, or nahsātin), [days that were] calamitous for them, that We might make them taste the chastisement of disgrace, humiliation, in the life of this world; yet the chastisement of the Hereafter is indeed more disgraceful, more severe, and they will not be helped, to have it warded off from them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore We let loose on them) We set on them (a raging wind) an icy wind (in evil days) days of ill omen for them which brought chastisement upon them; it is also said that this means: hard days, (that We might make them taste the torment of disgrace) a severe disgrace (in the life of the world. And verily the doom of the Hereafter will be more shameful) than the disgrace they faced in the life if the world, (and they will not be helped) they will not be prevented from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً صَرْصَراً } معناه شديدٌ\n قال الإِمام زيد بن علي عليهما السلام: إن كانت لَتمرَ على الراعي وهو في غنمهِ فتحملُهُ وإن كانت لَتمرَ على العَروسِ وهي في خِدرِهَا فتحملُهَا\n\n\n\n\nوقوله تعالى: { فِيۤ أَيَّامٍ نَّحِسَاتٍ } معناه مشائيمُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We sent against them a wind, violent and severe\" - this means strong and intense.\n\n\nThe Imam Zayd ibn Ali said: \"If a shepherd's flock passes by and he is with them, he should carry them. If a bride passes by and she is in her wedding dress, he should carry her.\"\n\n\nAnd His saying, {in days [of] uncleanliness} means [the] days [of] menstruation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأصروا على عتوهم وضلالهم { فَأَرْسَلْنَا } بمقتضى قهرنا وجلالنا { عَلَيْهِمْ رِيحاً صَرْصَراً } باردة شديدة البرد\n عقيمة عن المطر\n تعميهم بنقعها\n وتصميهم بصريرها { فِيۤ أَيَّامٍ نَّحِسَاتٍ } لا سعود فيها\n يعني: إنما بدلنا مسعودات ايامهم بالمنحوسات { لِّنُذِيقَهُمْ عَذَابَ ٱلْخِزْيِ } أي: المذلة والهوان اللازم على العذاب حيث كان ونزول { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } التي هم مغرورون فيها\n مسرورون بلذاتها وشهواتها { وَ } الله { لَعَذَابُ ٱلآخِرَةِ } المعدة للانتقام والجزاء { أَخْزَىٰ } أي: أشد خزياً\n وأتم تذليلاً وتصغيراً بأضعاف عذاب الدنيا وآلافها { وَ } بالجملة: { هُمْ لاَ يُنصَرُونَ } [فصلت: 16] ولا يشفعون فيها بدفع العذاب عنهم لحظة\n بل يخلدون في العذاب ما شاء الله\n ولا حول ولا قوة إلا بالله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأرسلنا عليهم ريحاً صَرْصَراً } أي: بارداً تهلك وتُحرق لشدة بردها\n من: الصر\n وهو البرد\n الذي يجمع ويقبض\n أو: عاصفة تصوّت في هبوبها\n من الصرير\n فضوعف\n كما يقال: نهنهت وكفكفت\n { في أيام نَّحِساتٍ } مشؤومات عليهم\n من: نَحِس نحساً\n نقيض: سعد سعداً\n وكانت من الأربعاء آخر شوال إلى الأربعاء\n وما عُذِّب قوم إلا في الأربعاء\n قيل: أمسك الله عنهم المطر ثلاث سنين\n ودامت الرياح عليهم من غير مطر\n قيل: إذا أراد الله بقوم خيراً\n أرسل عليهم المطر\n وحبس عنهم كثرة الرياح\n وإذا أراد الله بقوم شرّاً\n حبس عنهم المطر\n وأرسل عليهم كثرة الرياح\n هـ\n { لنُذيقَهُمْ عذابَ الخزي في الحياة الدنيا } \n أضاف العذاب إلى الخزي\n وهو الذل\n على أنه وصف للعذاب\n كأنه قال: عذاب خزي\n ويدل عليه قوله: { ولعذابُ الآخرة أخزى } أي: أذل لصاحبه\n وهو في الحقيقة وصف للمعذَّب\n وُصف به العذاب للمبالغة\n كقولك: له شعر شاعر\n { وهم لا يُنصَرُون } برفع العذاب عنهم بوجه من الوجوه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:19",
      "similarity": 0.9201417601188063
    },
    {
      "verse": "69:6",
      "similarity": 0.5442655639594226
    },
    {
      "verse": "55:35",
      "similarity": 0.3239166232731133
    },
    {
      "verse": "39:26",
      "similarity": 0.18498155617560993
    },
    {
      "verse": "3:192",
      "similarity": 0.11767096890711642
    }
  ]
}