{
  "chapter": "فصلت",
  "text": "اذ جاءتهم الرسل منۢ بين ايديهم ومن خلفهم الا تعبدوا۟ الا الله قالوا۟ لو شاء ربنا لانزل ملئكة فانا بما ارسلتم به كفرون",
  "translations": [
    {
      "translation": "When the Messengers came to them from in front and from behind, saying, 'Do not worship anyone but Allah.' they said, 'If our Lord had willed, He could have sent angels down, so we reject the Message you have been sent with.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles came to them one after the other (saying): \"Do not worship any one but God.\" They said: \"If our Lord had pleased He would have sent the angels down. We reject what is sent with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Messengers (of Allah) came to them from the front and from the rear, saying: “Do not serve any but Allah”; they said: “Had our Lord so willed, He would have sent down angels. So we deny the Message you have brought.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Messengers from all sides came to them saying, \"Do not worship anything besides God, \" they said, \"Had our Lord wanted, He would have sent us angelic Messengers. We do not believe in your message\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their Noble Messengers approached them from front and from behind saying, \"Do not worship any one except Allah\"; they said, \"If our Lord willed, He would surely have sent down angels – we therefore deny whatever you have been sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Messengers came to them, from before them and behind them (saying): \"Worship none but Allah,\" they said: \"If our Lord had so willed, He would surely have sent down the angels. So, indeed we disbelieve in that with which you have been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their apostles came to them from before them and from behind them, saying, Serve nothing but Allah, they said: If our Lord had pleased He would certainly have sent down angels, so we are surely unbelievers in that with which you are sent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Messengers came unto them from before them and from behind them, saying, 'Serve none but God,' they said, 'Had our Lord willed, surely He would have sent down angels; so we disbelieve in the Message you were sent with.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their messengers came unto them from before them and behind them, saying: Worship none but Allah! they said: If our Lord had willed, He surely would have sent down angels (unto us), so lo! we are disbelievers in that wherewith ye have been sent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the messengers came to them from before them and behind them, saying, 'Worship none but God!\" They said, \"If our Lord had willed, He would have sent down angels [to us]. Therefore, we shall never believe in your message.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time the apostles came Unto them from before them and behind them, saying: worship none save Allah. They said: had our Lord listed, He surely would have sent down angels, so verily in that wherewith ye have been sent we are disbelievers altogether.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the apostles came to them, before them and in their own time, saying, ‘Worship no one except Allah!’ They said, ‘Had our Lord wished, He would have sent down angels [to us]. We indeed disbelieve in what you have been sent with.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, the messengers came to them, from before them and behind them, (preaching): \"Serve none but Allah.\" They said, \"If our Lord had so pleased, He would certainly have sent down angels (to preach). Now we reject your mission (altogether).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Messengers came to them, from before them and behind them (saying): \"Worship none but Allah\" They said: \"If our Lord had so willed, He would surely have sent down the angels. So indeed! We disbelieve in that with which you have been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their Messengers came to them from before them and behind them, (saying): 'Worship none except Allah' they answered: 'Had it been the will of our Lord, He would have sent down angels. So we disbelieve in the Message with which you were sent'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers came to them, from before them and from behind them, saying, “Do not worship anyone but God.” They said, “Had our Lord willed, He would have sent down angels; Therefore, we reject what you are sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[That occurred] when the messengers had come to them before them and after them, [saying], \"Worship not except Allah.\" They said, \"If our Lord had willed, He would have sent down the angels, so indeed we, in that with which you have been sent, are disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:14] When the messengers came to them from in front of them and from behind them, that is, coming to them [to warn them] and leaving them behind [as they departed], but they disbelieved, as will be stated shortly — the destruction [of them meant] would only take place in his time — saying, ‘Worship none but God’, they said, ‘Had our Lord willed, He would have surely sent down, to us, angels; therefore we indeed disbelieve in what you, according to your claim, have been sent with!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When their messengers came unto them from before them) before 'Aad and Thamud to their respective people (and behind them) and after them messenger were sent to their folks, (saying: Worship none) do not declare the divine Oneness of anyone (but Allah! They said) each folk said to their messenger: (If our Lord had willed) to send us a messenger, (He surely would have sent down angels (unto us)) from the angels He has with Him, (so lo! we are disbelievers in that wherewith ye have been sent) We reject that with which you have been sent, you are but a human being like us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوقت { إِذْ جَآءَتْهُمُ ٱلرُّسُلُ } المبعوثون إليهم\n لتكميلهم وإرشادهم\n والمبلغون لهم الوحي الإلهي { مِن بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ } أي: في حضورهم وغيبتهم بواسة وبغير واسطة\n المنبهون عليهم\n القائلون لهم: عليكم أيها المجبولون على فطرة التوحيد { أَلاَّ تَعْبُدُوۤاْ } ولا تتوجهوا بالعبودية الخالصة { إِلاَّ ٱللَّهَ } الواحد الأحد الصمد\n الحقيق بالإطاعة والانقياد\n إذ لا معبود لكم سواه\n ولا مقصد إلا هو\n\n\nوبعدما سمعوا من رسلهم ما سمعوا { قَالُواْ } متهكمين مستهزئين: { لَوْ شَآءَ رَبُّنَا } الذي ادعيتم ربوبيته وألوهيته بالانفراد والاستقلال { لأَنزَلَ } بمقتضى قدرته الكاملة التي ادعيتم له { مَلاَئِكَةً } يخرجوننا من أودية الجهالات وبادية الضلال والغفلات\n وبالجملة: { فَإِنَّا } بأجمعنا { بِمَآ أُرْسِلْتُمْ بِهِ } أي: بجميع ما جئتم به وادعيتم الرسالة فيه { كَافِرُونَ } فصلت: 14] منكرون جاحدون\n إن أنتم إلا بشر مثلنا بلا مزية لكم علينا\n ومن أين يتأتى لكم هذا؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذ جاءتْهُمُ }: ظرف لمحذوف\n أي: أنزلناها بهم حين جاءتهم { الرسلُ من بين أيديهم ومن خلفِهِم } أي: أتوهم من كل جانب\n وعملوا فيهم كل حيلة\n فلم يروا منهم إلا الإعراض\n أو: جاءتهم الرسل قبلهم لآبائهم\n وبعدَهم لِمَن خلفهم\n أي: تواردت عليهم الرسل قديماً وحديثاً\n والمعهود إنما هو هود وصالح ـ عليهما السلام ـ وعن الحسن: أنذروهم من وقائع الله بمَنْ قبلهم من الأمم وعذاب الآخرة\n { ألاَّ تعبدوا إِلا اللهَ } أي: بأن لا تعبدوا إلا الله\n على أنها مصدرية\n أو: لا تعبدوا\n على أنها مفسرة\n وقيل: مخففة\n أي: أنه لا تعبدوا إلا الله\n { قالوا لو شاء ربُّنا لأنزل ملائكةً } أي: لو شاء إرسال الرسل لأرسل ملائكة\n ولَمَّا كان إرسالهم بطريق الإنزال عبَّر به\n { فإِنا بما أُرسلتُم به كافرون } أي: فحيث كنتم بشراً مثلنا\n ولم تكونوا ملائكة\n ولم يكن لكم فضل علينا\n فإنا لا نؤمن بكم\n ولا بما جئتم به\n وقولهم: { أُرسلتم به } ليس بإقرار بالإرسال\n وإنما هو على كلام الرسل\n وفيه تهكُّم\n كما قاله فرعون:\n[الشعراء: 27] وقولهم: { بما أرسلتم به كافرون } خطاب منهم لهود وصالح ولسائر الأنبياء\n الذين دعوا للإيمان\n رُوي أن أبا جهل قال في ملأ من قريش: قد التبس علينا أمر محمد\n فلو التمستم لنا رجلاً عالماً بالشعر والكهانة\n فكَلَّمه\n ثم أتانا بالبيان من أمره\n فقال عُتبة بن ربيعة: والله لقد سمعتُ الشعر والكهانة والسحر\n وعلمتُ من ذلك علماً ما يخفى عليَّ\n فأتاه\n فقال: أنت يا محمد خير أم هاشم؟ أنت يا محمد خير أم عبد المطلب؟ أنت خير أم عبد الله؟ فبمَ تشتم آلهتنا وتضللنا؟ فإن كنت تريد الرياسة عقدنا لك اللواء\n فكنت رئيسنا ما بقيت\n وإن كان بك الباءة زوجناك عشر نسوةٍ من أيّ بنات قريش شئتَ\n وإن كان بك المال\n جمعنا لك ما تستغني به أنت وعقبك\n\nوالنبي صلى الله عليه وسلم ساكت\n فلما فرغ عتبةُ\n قال صلى الله عليه وسلم:\n \" { بسم الله الرحمن الرحيم حم تنزيل من الرحمن الرحيم\n\n\n } إلى قوله تعالى: { مثل صاعقة عاد وثمود } \" \n\n فأمسك عتبة على فِيه النبيّ صلى الله عليه وسلم وناشده بالرحم\n فرجع عبتةُ إلى أهله\n ولم يخرج إلى قريش\n فلما احتبس عنهم\n قالوا: ما نرى عتبة إلا صبأ\n فانطلقوا\n وقالوا: يا عتبة ما حبسك عنا إلا أنك صبأت إلى محمد\n أم أنك أعجبك طعامه؟ فغضب\n ثم قال لهم: لقد كلمته فأجابني بشيء\n والله ما هو شعر\n ولا كهانة\n ولا سحر\n ثم تلى عليهم ما سمع منه إلى قوله: { مثل صاعقة عاد وثمود } فأمسكتُ بفيه\n وناشدته بالرحم أن يكف\n وقد علمتم أن محمداً إذا قال شيئاً لم يكذب\n فخفتُ أن ينزل بكم العذاب\n هـ\n ثم بيَّن ما ذكره من صاعقة عاد وثمود\n فقال: { فأما عاد فاستبكروا في الأرض بغير الحق } أي: تعاظموا فيها على أهلها بما لا يستحقون به التعظيم\n وهو القوة\n وعظم الأجرام\n واستولوا على الأرض بغير استحقاق للولاية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:60",
      "similarity": 0.4988932816518477
    },
    {
      "verse": "19:64",
      "similarity": 0.4589177024433287
    },
    {
      "verse": "36:45",
      "similarity": 0.4303780134140318
    },
    {
      "verse": "22:76",
      "similarity": 0.4288213537144458
    },
    {
      "verse": "26:30",
      "similarity": 0.38040405601035154
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/41:14.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/41:14.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/41:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}