{
  "chapter": "فصلت",
  "text": "ويوم يحشر اعداء الله الى النار فهم يوزعون",
  "translations": [
    {
      "translation": "The day the enemies of God will be gathered at the Fire and the records of their deeds will be distributed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Imagine the Day when Allah's enemies will be mustered to the Fire, and the people of the former times will be detained until the arrival of people of the later times,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be spurred on\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when the enemies of Allah are herded towards the fire, the earlier groups will be restrained till the latter join them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day that the enemies of Allah will be gathered to the Fire, then they will be driven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day that the enemies of Allah shall be brought together to the fire, then they shall be formed into groups.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when God's enemies are mustered to the Fire, duly disposed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (make mention of) the day when the enemies of Allah are gathered unto the Fire, they are driven on\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day that the enemies of God shall be gathered together and driven to the Fire, they shall be formed into groups, and\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day whereon the enemies of Allah will be gathered Unto the Fire; and they will be set in bands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the enemies of Allah are marched out toward the Fire, while they are in check,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day that the enemies of Allah will be gathered together to the Fire, they will be marched in ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day that the enemies of Allah will be gathered to the Fire, so they will be collected there (the first and the last).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the enemies of Allah will be rightfully gathered together before Fire,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when God’s enemies are herded into the Fire, forcibly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], the Day when the enemies of Allah will be gathered to the Fire while they are [driven] assembled in rows,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:19] And, mention, the day when God’s enemies are gathered ([read either] yuhsharu a‘dā’u’Llāhi, or nahshuru a‘dā’a’Llāhi, ‘[when] We gather God’s enemies’) to the Fire, for they will be driven [thereto],\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (make mention of) the day) which is the Day of Judgement (when the enemies of Allah) Safwan Ibn Umayyah and Rabi'ah Ibn 'Amr, Habib Ibn 'Amr as well as all the disbelievers (are gathered unto the Fire) one after the other, (they are driven on\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَهُمْ يُوزَعُونَ } معناه يَحشرونهُم بحَبسِ أولهم على آخرِهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل لمن عاندك من المشركين { يَوْمَ يُحْشَرُ } ويُساق { أَعْدَآءُ ٱللَّهِ } بعد العرض والحساب { إِلَى ٱلنَّارِ } المعدة لجزائهم { فَهُمْ } حينئذ { يُوزَعُونَ } [فصلت: 19] أي: يدفعون؛ يعني: حبس أولهم ومقدومهم على أخرهم؛ لئلا ينقطع تلاحقهم وأجتماعهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلَ جلاله: { و } اذكر { يوم نَحْشُرُ أعداء الله } من كفار المتقدمين والمتأخرين { إِلى النارِ فهم يُوزَعون } يُضمون ويُساقون إلى النار، ويُحبس أولهم على أخرهم، فيستوقف سوابقهم حتى تلحق بهم تواليهم، وهي عبارةٌ عن كثرة أهل النار، وأصله: من وزَعته، أي: كففته",
      "translations": []
    }
  ]
}