{
  "chapter": "فصلت",
  "text": "واما ثمود فهدينهم فاستحبوا۟ العمى على الهدى فاخذتهم صعقة العذاب الهون بما كانوا۟ يكسبون",
  "translations": [
    {
      "translation": "As for Thamud, We guided them, but they preferred blindness to guidance. So the lightning-bolt of the punishment of humiliation seized them on account of what they earned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the (tribe of) Thamud, We tried to guide them, but they preferred blindness to guidance; then they were seized by the torment of a humiliating punishment as requital for their misdeeds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Thamud, We bestowed guidance upon them, but they preferred to remain blind rather than be guided. At last a humiliating scourge overtook them on account of their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent guidance to the people of Thamud but they preferred blindness to guidance so a humiliating blast of torment struck them for their evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And regarding the Thamud, We showed them the right path – so they chose to be blind above being guided, therefore the thunderbolt of the disgraceful punishment overcame them – the recompense of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for Thamud, We showed them the path of truth but they preferred blindness to guidance; so the Sa`iqah of disgracing torment seized them because of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to Samood, We showed them the right way, but they chose error above guidance, so there overtook them the scourge of an abasing chastisement for what they earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Thamood, We guided them, but they preferred blindness above guidance, so the thunderbolt of the chastisement of humiliation seized them for that they were earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for Thamud, We gave them guidance, but they preferred blindness to the guidance, so the bolt of the doom of humiliation overtook them because of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Thamud We offered them Our guidance, but they preferred blindness to guidance. So the lightning-bolt of the punishment of humiliation seized them on account of their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the tribe of the Thamud We guided them but they preferred blindness to the guidance, wherefore the bolt of the torment of abjection laid hold of them because of that which they had been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for [the people of] Thamud, We guided them, but they preferred blindness to guidance. So the bolt of a humiliating punishment seized them because of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to the Thamud, We gave them Guidance, but they preferred blindness (of heart) to Guidance: so the stunning Punishment of humiliation seized them, because of what they had earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for Thamud, We showed and made clear to them the Path of Truth (Islamic Monotheism) through Our Messenger, (i.e. showed them the way of success), but they preferred blindness to guidance, so the Sa'iqah (a destructive awful cry, torment, hit, a thunderbolt) of disgracing torment seized them, because of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for Thamood, We (offered) them Our Guidance, but they preferred blindness to guidance. So a thunderbolt of the humiliating punishment seized them because of what they had earned;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for Thamood, We guided them, but they preferred blindness over guidance. So the thunderbolt of the humiliating punishment seized them, because of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for Thamud, We guided them, but they preferred blindness over guidance, so the thunderbolt of humiliating punishment seized them for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:17] And as for Thamūd, We offered them guidance, We pointed out to them the path of guidance, but they preferred blindness, they chose disbelief [as opposed], to guidance. So the thunderbolt of the humiliating chastisement seized them on account of what they used to earn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for Thamud) the people of Salih, (We gave them guidance) We sent to them Salih and made clear to them what is disbelief and what is faith and the difference between the Truth and falsehood, (but they preferred blindness to the guidance) they preferred disbelief to faith, (so the bolt of the doom of humiliation) the cry of a severe chastisement (overtook them because of what they used to earn) and say and do in their state of disbelief and because they hamstrung the camel.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ } معناه بينا لَهُمْ\n\n\n\n\nوقوله تعالى: { ٱلْعَذَابِ ٱلْهُونِ } أي الهوانِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd as for the people of Thamud, We showed them the right path\n\n\nAnd His saying, \"The punishment is humiliation,\" that is, humiliation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ } بإرسال الرسل أياهم\n ليرشدوهم إلى النجاة\n وينقذوهم من الضلال\n وبعدما بلغهم الرسل ما بلغهم من آيات الهداية والرشاد\n كذبوهم وأنكروا هدايتهم { فَٱسْتَحَبُّواْ ٱلْعَمَىٰ } والضلال بمقتضى عميهم وغفلتهم { عَلَى ٱلْهُدَىٰ } المنزل عليهم من عندنا على ألسنة رسلنا\n وبعدما أصروا على ما هم عليه من الغواية { فَأَخَذَتْهُمْ } فجأة { صَاعِقَةُ ٱلْعَذَابِ ٱلْهُونِ } المخزي المذل النازل من نحو السماء على صورة الصاعقة السريعة الجري والحركة\n فاستأصلهم بالمرة { بِمَا كَانُواْ يَكْسِبُونَ } [فصلت: 17] أي: بشؤم ما يقترفون من المعاصي والآثام الجالبة إياهم شدة غضب الله وعذابه\n\n\n{ وَ } من كمال قدرتنا على الإنعام والانتقام { نَجَّيْنَا } من تلك الصاعقة المهولة المهلكة القوم { ٱلَّذِينَ آمَنُواْ } برسلنا واهتدوا هدايتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأما ثمودُ فهديناهمْ } دللناهم على الرشد، بنصب الآيات التكوينية، وإرسال الرسل، وإنزال الآيات التشريعية، { فاستحبُّوا العَمَى على الهُدى } أي: اختاروا الضلالة على الهداية، { فأخذتهم صاعقةُ العذابِ الهُون } أي: داهية العذاب الذي يهين صاحبه ويخزيه، وهي الصيحة والرجفة، والهُون: الهوان، وصف به للمبالغة، { بما كانوا يكسبون } أي: بكسبهم الخبيث من الشرك والمعاصي\n\n\nقال الشيخ أبو منصور: يحتمل قوله: { فهديناهم }: بيَّنا لهم، كما تقدّم، ويحتمل: خلق الهداية في قلوبهم، فصاروا مهتدين، ثم كفروا بعد ذلك، وعقروا الناقة، لأن الهدي المضاف إلى الخالق يكون بمعنى البيان، ويكون بخلق فعل الاهتداء، وأما الهدي المضاف إلى الخلق فيكون بمعنى البيان، لا غير\n هـ\n وقال الطيبي: قوله تعالى: { فهديناهم } هو كقوله تعالى:\n\n[فصلت: 14]\n وقوله: { فاستحبوا العمى على الهدى } هو كقوله:\n\n[فصلت: 14] الآية\n وكذا في قوله: { فأما عاد فاستكبروا في الأرض } ، فإن الفاء في \" فاستكبروا \" فصيحة، تُفصح عن محذوف، أي: فهديناهم فاستكبروا بدلالة ما قيل في ثمود\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:13",
      "similarity": 0.6079122790992143
    },
    {
      "verse": "52:45",
      "similarity": 0.48237410010903137
    },
    {
      "verse": "2:55",
      "similarity": 0.42674820452282863
    },
    {
      "verse": "51:44",
      "similarity": 0.41421598272781046
    },
    {
      "verse": "39:68",
      "similarity": 0.387780141741303
    }
  ]
}