{
  "chapter": "فصلت",
  "text": "فقضىهن سبع سموات فى يومين واوحى فى كل سماء امرها وزينا السماء الدنيا بمصبيح وحفظا ذلك تقدير العزيز العليم",
  "translations": [
    {
      "translation": "In two days He determined them as seven heavens and revealed, in every heaven, its own mandate. We adorned the lowest heaven with lamps and guarded it. That is the decree of the Almighty, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He created several skies in two spans, and ingrained in each sky its function, decking the nearest heaven with lamps, and guarded it. This has been determined by the mighty and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He made them seven heavens in two days and revealed to each heaven its law. And We adorned the lower heaven with lamps, and firmly secured it. All this is the firm plan of the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He formed the seven heavens in two days and revealed to each one its task. He decked the sky above the earth with torches and protected it from (intruders).. Such is the design of the Majestic and All-knowing God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He then established them into seven heavens in two days, and to each heaven He sent the command of its affairs; and We decorated the lower heaven with lamps; and for its protection; this is the command set by the Most Honourable, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He completed and finished their creation (as) seven heavens in two Days and He made in each heaven its affair. And We adorned the nearest (lowest) heaven with lamps (stars) to be an adornment as well as to guard. Such is the decree of Him, the Almighty, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He ordained them seven heavens in two periods, and revealed in every heaven its affair; and We adorned the lower heaven with brilliant stars and (made it) to guard; that is the decree of the Mighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He determined them as seven heavens in two days, and revealed its commandment in every heaven.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He ordained them seven heavens in two Days and inspired in each heaven its mandate; and We decked the nether heaven with lamps, and rendered it inviolable. That is the measuring of the Mighty, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in two Days He formed seven heavens, and revealed to each heaven its functions; and We adorned the lower heaven with brilliant lamps [stars] and guarded it. That is the decree of the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He decreed them as seven heavens in two days, and revealed Unto each heaven the command thereof; and We bedecked the nether heaven with lamps and placed therein a guard. That is the ordinance of the Mighty, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He set them up as seven heavens in two days, and revealed [to the angels] in each heaven its ordinance. We have adorned the lowest heaven with lamps, and guarded them. That is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He completed them as seven firmaments in two Days, and He assigned to each heaven its duty and command. And We adorned the lower heaven with lights, and (provided it) with guard. Such is the Decree of (Him) the Exalted in Might, Full of Knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He completed and finished from their creation (as) seven heavens in two Days and He made in each heaven its affair. And We adorned the nearest (lowest) heaven with lamps (stars) to be an adornment as well as to guard (from the devils by using them as missiles against the devils). Such is the Decree of Him the All-Mighty, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In two days He determined them seven heavens, and He revealed to each heaven its commands. We decorated the lowest heaven with lamps and preserve them. Such is the decree of the Almighty, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He completed them as seven universes in two days, and He assigned to each universe its laws. And We decorated the lower universe with lamps, and for protection. That is the design of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He completed them as seven heavens within two days and inspired in each heaven its command. And We adorned the nearest heaven with lamps and as protection. That is the determination of the Exalted in Might, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:12] Then He ordained them (the [suffixed] pronoun refers back to al-samā’, ‘the heaven’, because it [al-samā’] actually denotes that plural [sense] to which it will lead [in the following clause), in other words, He made them to be, seven heavens in two days — Thursday and Friday. He completed them in the last hour thereof, in which He created Adam — which is why He does not say sawā’an, ‘evenly’ here [as He did earlier]; what is said here concords with those verse in which it is stated that the heavens and the earth were created in six days; and in each heaven He revealed its commandment’, that to which He commanded those in it [to follow], in the way of obedience and worship. And We adorned the lowest heaven with lamps, with stars, and [this was also] to guard them (hifzan is in the accusative because of its implicit verbal sense, in other words, ‘We guarded it against the devils lest they try to listen therein [to the angels] by stealth with meteors’). That is the ordaining of the Mighty, in His kingdom, the Knower, of His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then He ordained them) He created them (seven heavens) one above the other (in two Days) each day the equivalent of 1,000 years of the years of the life of this world (and inspired in each heaven its mandate) He created for each heaven its inhabitants and commanded it its command; (and we decked the nether heaven) the first heaven (with lamps) with stars, (and rendered it inviolable) and We protected it by means of the stars from the satans, such that some stars are an adornment for the heaven and remain fix, and some of which are used for finding directions in the darkness of land and sea and some are missiles sent against the satans. (That is the measuring) the providence (of the Mighty) in retribution against those who disbelieve in Him, (the Knower) of His providence as well as of those who believe in Him and those who do not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنْيَا بِمَصَابِيحَ } معناه بالنّجومِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And We have adorned the lowest heaven with stars} means with the stars.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فقضاهن سبع سموات في يومين } أي: المادة والصورة كالأرض { وأوحى في كل سماء أمرها } أي: أشار إليها بما أراد من حركتها وتأثيرات ملكوتها وتدبيراتها وخواص كوكبها وكل ما يتعلق بها\n { وزينا السماء الدنيا } أي: السطح الذي يلينا من فلك القمر { بمصابيح } الشهب { و } حفظناها { حفظاً } من أن تنخرق بصعود البخارات إليها ووصول القوى الطبيعية الشيطانية إلى ملائكتها { ذلك تقدير العزيز } الغالب على أمره كيف يشاء { العليم } الذي أتقن صنعه بعلمه\n أو أئنكم لتكفرون وتحتجبون بالغواشي البدنية عن الذي خلق أرض البدن وجعلها حجاب وجهه في يومين أي شهرين أو حادثين مادة وصورة\n وتجعلون له أنداداً بوقوفكم مع الغير ونسبتكم التأثير إلى ما لا وجود له ولا أثر\n ذلك الخالق هو الذي يربّ العالمين بأسمائه وجعل فيها رواسي الأعضاء من فوقها أو رواسي الطبائع الموجبة للميل السفلي من القوى العنصرية والصور الماديّة التي تقتضي ثباتها على حالها\n وبارك فيها بتهيئة الآلات والأسباب والمزاجات والقوى التي تتم بها لمقته وأفعاله وقدّر فيها أقواتها بتدبير الغاذية وأعوانها وتقدير مجاري الغذاء وأمور التغذية وأسبابها وموادّها في تتمة أربعة أشهر\n أي: جميع ذلك في أربعة أشهر سواء متساوية أو في مواد العناصر الأربعة\n ثم استوى أي: بعد ذلك قصد قصداً مستوياً من غير أن يلوي إلى شيء آخر\n إلى سماء الروح وتسويتها وهي دخان أي: مادة لطيفة من بخارية الأخلاط ولطافتها مرتفعة من القلب\n وقد جاء في الحديث:\n \" إن خلق أحدكم يجمع في بطن أمّه أربعين يوماً نطفة\n ثم يكون علقة مثل ذلك\n ثم يكون مضغة مثل ذلك\n ثم يبعث الله إليه ملكاً بأربع كلمات\n فيكتب عمله وأجله ورزقه وشقيّ أم سعيد\n ثم ينفخ فيه الروح \" \nويعضده حديث آخر في أنّ نفخ الروح في الجنين يكون بعد أربعة أشهر من وقت الحمل\n فقال لها ولأرض البدن: ائتيا\n أي: تعلقت إرادته بتكوينهما وصيرورتهما شيئاً واحداً وخلقاً جديداً\n فتكونا على ما أراد من الصورة وهذا معنى خلوّ الأرض قبل السماء غير مدحوّة ودحوها بعده\n فإن المادة البدنية وإن تخلقت بدناً قبل اتصال الروح وانتفاخه فيها لكن الأعضاء لم تنبسط ولم ينفتق بعضها من بعض إلا بعده\n فقضاهنّ سبع سموات\n أي: الغيوب السبعة المذكورة من القوى والنفس والقلب والسرّ والروح والخفاء\n والحق الذي أدرج هويته في هوية الشخص الموجود وتنزل بإيجاده في هذه المراتب واحتجب بها وإن جعلت السبعة من المخلوقات حتى تخرج الهوية من جملتها فإحداها وهي الرابعة بين القلب\n والسرّ العقل\n وهي السماء الدنيا باعتبار دنوّها من القلب الذي به الإنسان إنساناً في يومين في شهرين آخرين\n فتمّ مدة الحمل ستة أشهر أو مدة خلق الإنسان\n ولهذا إذا ولد بعد تمام الستة على رأس الشهر السابع عاش مستوي الخلق أو في طورين مجرّدة وغير مجرّدة أو حادثين روح وجسد والله أعلم\n { وأوحى في كل سماء } من الطبقات المذكورة { أمرها } وشأنها المخصوص بها من الأعمال والإدراكات والمكاشفات والمشاهدات والمواصلات والمناغيات والتجليات\n { وزيّنا السماء الدُّنيا } أي العقل بمصابيح الحجج والبراهين { وحفظناها } من استراق شياطين الوهم والخيال\n كلام الملأ الأعلى من الروحانيات بالترقي إلى الأفق العقلي واستفادة الصور القياسية لترويج أكاذيبها وتخيلاتها بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويوم لتكميل الصورة { وَ } بعدما حكم وقضي سبحانه { أَوْحَىٰ } وألهم { فِي كُلِّ سَمَآءٍ } من الأسماء المدبرة { أَمْرَهَا } أي: أمورها التي طلب منها ووضع لأجلها { وَ } قال سبحانه بعدما رتبها عليها تتميماً للتربية\n وتكميلاً للقدرة الكاملة الشاملة: { زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنْيَا } أي: القرب إلى عالم الشهادة المشتملة على الآثار والأعمال\n الصادرة من المظاهر والأظلال { بِمَصَٰبِيحَ } مقتبسة مسرجة من أشعة أنوار الذات { وَ } جعلناها { حِفْظاً } أي: وقاية ورقيباً لأرباب العناية من وساوس شيطان الأوهام\n والخيالات المترتبة على القوى الطبيعية المائلة بالذات إلى السفل { ذَلِكَ } الذي سمعت من الخلق والإيجاد على النظام البديع والترتيب العجيب { تَقْدِيرُ } الحكيم { ٱلْعَزِيزِ } الغالب على إيجاد جميع ما دخل في حيطة إرادته { ٱلْعَلِيمِ } [فصلت: 12] بإظهارها على عموم الصور الممكنة لظهورها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكيف يكون الحادث المعدوم ندّاً للقديم؟! { ذلك } الذي خلق ما سبق\n وما في الإشارة من معنى البُعد مع قرب العهد بالمشار إليه لبُعد منزلته في العظمة\n أي: ذلك العظيم الشأن هو { ربُّ العالمين } أي: خالق جميع الموجودات ومُربِّيها\n فكيف يتصور أن يكون أخس الخلق نِدّاً له؟! { وجعل فيها رواسي } جبالاً ثوابت كائنة { من فوقها } \n وإنما اختار إرساءها من فوق الأرض لتكون منافع الجبال مُعرَضة لأهلها\n ويظهر للناظرين ما فيها من مراصد الاعبتار\n ومطارح الأفكار\n فإن الأرض والجبال أثقال على أثقال\n كلها ممسَكة بقدرة الله عزّ وجل\n { وباركَ فيها } أي: قدّر بأن يكثر خيرها بما يخلق فيها من منافع\n ويجعل فيها من المصالح\n وما ينبت فيها من الطيبات والأطعمة وأصناف النعم\n { وقدّر فيها أقواتَها } أي: حكم أن يوجد فيها لأهلها ما يحتاجون إليه من الأقوات المختلفة المناسبة لهم على مقدار مُعين\n تقتضيه الحكمة والمشيئة\n وما يصلح بمعايشهم من الثمار والأنهار والأشجار\n وجعل الأقوات مختلفة في الطعم والصورة والمقدار\n وقيل: خصابها التي قسمها في البلاد\n جعل ذلك { في أربعةِ أيام } أي: تتمة أربعة أيام\n يومين للخلق\n ويومين لتقدير الأقوات\n كما تقول: سِرت إلى البصرة في عشرة\n وإلى الكوفة في خمسة عشر\n أي: في تتمة خمسة عشر\n ولو أجري الكلام على ظاهرة لكانت ثمانية أيام يومين للخلق وأربعة للتقدير\n ويومين لخلق السماء\n وهو مناقض لقوله:\n[الأعراف: 54]\n وقوله: { سواء } راجع للأربعة\n أي: في أربعة أيام مستويات تامات\n أو: استوت سواء { للسائلين } أي: قدَّر فيها الأقوات للطالبين لها والمحتاجين إليها\n لأن كلاًّ يطلب القوت ويسأله\n أو هذا الحصر في هذه الأيام لأجل مَن سأل: في كم خلقت الأرض وما فيها؟ { ثم استوى إِلى السماء وهي دخان فقال لها وللأرض ائتيا طَوعاً أو كَرهاً قالتا أتينا طائعين } \n الاستواء مجاز عن إيجاد الله تعالى السماء على ما أراد\n تقول العرب: فعل فلان كذا ثم استوى إلى عمل كذا\n يريدون أنه أكمل الأول وابتدأ الثاني\n أو قصد وانتهى\n فالاستواء إذا عدي بـ \" إلى \" فهو بمعنى الانتهاء إليه بالذات أو بالتدبير\n وإذا عدّي بـ \" على \" فبمعنى الاستعلاء\n ويفهم منه أن خلق السماء بعد الأرض\n وهو كذلك\n وأما دحو الأرض وتقدير أقواتها فمؤخر عن السماء\n كما صرح في قوله:\n\n[النازعات: 30]\n والترتيب في الخارج: أنه خلق الأرض\n ثم خلق السماء\n ثم دحا الأرض في يومين\n فـ \" ثم \" للتفاوت بين الخلقين لا للترتيب\n أو: للتفاوت في المرتبة\n ترقياً من الأدنى إلى الأعلى\n كقول القائل:\nوفي بعض الأحاديث:\n \" إن الله خلق الأرض يوم الأحد والاثنين\n وخلق الجبال يوم الثلاثاء\n وخلق يوم الأربعاء الشجر والماء والعُمران والخراب\n فتلك أربعة أيام\n وخلق يوم الخميس السماء\n وخلق يوم الجمعة النجوم والشمس والقمر والملائكة\n وخلق آدم عليه السلام في آخر ساعة من يوم الجمعة \" \nوهي الساعة التي تقوم فيها الساعة\n قاله النسفي\n وفي حديث مسلم ما يخالفه\n قال ابن عباس رضي الله عنه: أول ما خلق الله ـ أي: بعد العرش ـ جوهرة طُولها وعرضها ألف سنة\n فنظر إليها بالهيبة\n فذابت وصارت ماء\n فكان العرش على الماء\n فاضطرب الماء\n فثار منه دخان\n فارتفع إلى الجو\n واجتمع زيد\n فقام فوق الماء\n فجعل الزبد أرضاً\n ثم فتقها سبعاً\n والدخان سماء\n فسوّاهن سبع سموات\n ومعنى أمر السماء والأرض بالإتيان طوعاً أو كرهاً وامتثالهما أنه أراد أن يُكوّنهما\n فلم يمتنعا عليه\n ووجدتَا كما أراد\n وكانتا في ذلك كالمأمور والمطيع\n وإنما ذكر الأرض مع السماء في الأمر بالإتيان\n مع أن الأرض مخلوقة قبل السماء بيومين لأن المعنى: ائتيا على ما ينبغي أن تأتيا عليه من الشكل والوصف\n أي: ائتي يا أرض مدحوة قراراً ومهاداً لأهلك\n وائتي يا سماء مبنية سقفاً لهم\n ومعنى الإتيان: الحصول والوقوع\n وقوله: { طوعاً أو كَرهاً } لبيان تأثير قدرته فيهما\n وأن امتناعهما عن قدرته مُحال كما تقول لمَن تحت يدك: لتفعلن هذا شئت أو أبيت\n طوعاً أو كرهاً\n وقال ابن عطية: الأمر بالإتيان بعد اختراعهما\n قال: وهنا حذف\n أي: ثم استوى إلى السماء فأوجدها\n وأتقنها\n وأكمل أمرها\n وحينئذ قال لها وللأرض: ائتيا لأمري وإرادتي فيكما\n والمراد: تنجيزهما لما أراده منهما\n وما قدر من أعمالهما\n هـ\n حُكي أن بعض الأنبياء قال: يا رب لو أن السماوات والأرض حين قلت لهما: ائتيا طوعاً أو كرهاً عصتاك\n ما كنت صانعاً بهما؟ قال: كنتُ آمر دابة من دوابي فتبتلعهما\n قال: وأين تلك الدابة؟ قال: في مرج من مروجي\n قال: وأين ذلك المرج؟ قال: في علم من علومي\n وانتصاب { طوعاً أو كرهاً } على الحال\n أي: طائعين أو مكرهين\n ولم يقل \" طائعتين \" لأن المراد الجنس\n أي: السموات والأرضين\n وجمع جمع العقلاء لوصفهما بالطوع والكره\n اللذين من وصف العقلاء\n وقال: طائعين في موضع طائعات تغليباً للتذكير لشرفه\n كقوله:\n\n[يوسف: 4]\n { فقضاهنّ سبعَ سماواتٍ } أي: فأحكم خلقهن\n وأتقن أمرهن سبعاً\n حسبما تقتضيه الحكمة\n فالضمير راجع إلى السماء\n لأنه جنس\n يجوز أن يكون الضمير مبهماً مفسراً بقوله: { سبع سماوات } \n فينتصب سبع على الأول حالاً\n وعلى الثاني تمييزاً\n حصل ذلك القضاء { في يومين } الخميس والجمعة\n أي: في وقتين قدر يومين\n فكان المجموع ستة أيام\n { وأَوحى في كلِّ سماءٍ أمرها } أي: أوحى إلى ساكنها وعُمّارها من الملائكة في كل سماء ما شاء الله من الأمور\n التي تليق بهم\n كالخدمة وأنواع العبادة\n وإلى السماء في نفسها ما شاء الله من الأمور التي بها قوامها وصلاحها\n { وزيّنا السماء الدنيا بمصابيح } كالشمس والقمر والنجوم\n وهي زينة السماء الدنيا\n سواء كانت فيها أو فيما فوقها لأنها تُرى متلألأة عليها كأنها فيها\n والالتفات إلى نون العظمة لإبراز مزيد العناية بأمرها\n { وحفظاً } أي: حفظناها حفظاً من المسترقة\n أو من الآفات\n فهو مصدر لمحذوف\n وقيل: مفعول لأجله على المعنى\n أي: وجعلنا المصابيح للزينة والحفظ\n { ذلك تقديرُ العزيز العليم } أي: ذلك الذي ذكر تفصيله تقدير البالغ في القدرة والعلم\n أو: الغالب العليم بمواقع الأمور\n الإشارة: خلق الحق ـ تعالى ـ أرض النفوس محلاًّ للعبودية\n وأرساها بجبال العقل\n لئلا تميل إلى بحر الهوى\n وبارك فيها\n بأن جعل فيها صالحين وأبراراً\n وعباداً وزهاداً\n وعُلماء أتقياء\n وقدّر لها أقواتها الحسية والمعنوية\n فجعل الحسية سواء للسائلين\n أي: مستوية لا يزيد بالطلب ولا بالتعب\n ولا ينقص\n ففيه تأديب لمَن لم يرضَ بقسمته\n والأرزاق المعنوية: أرزاق القلوب من اليقين والمعرفة\n يزيد بالطلب والتعب\n وينقص بنقصانه\n حكمة من الحكيم العليم\n ثم استوى إلى سماء الأرواح\n أي: قصدها بالدعاء إليه\n وهي لطائف\n فقال لها ولأرض النفوس: ائتيا إلى حضرتي\n طوعاً أو كرهاً\n قالتا: أتينا طائعين\n فقضاهن سبع طبقات\n وهي دوائر الأولياء\n دائرة الغوث\n ثم دائرة الأقطاب\n ثم الأوتاد\n ثم النقباء\n ثم النجباء\n ثم الأبرار\n ثم الصالحين\n وأوحى في كل سماء\n أي: في كل دائرة ما يليق بها من العبادة\n فمنهم مَن عبادته الشهود والعيان\n ومنهم مَن عبادته الفكرة\n ومنهم الركوع والسجود\n ومنهم التلاوة والذكر\n\n\n إلى غير ذلك من أنواع الأعمال\n قال القشيري: وجعل نفوسَ العابدين\n أرضاً لطاعته وعبادته\n وجعل قلوبهم فَلَكاً لنجوم علمه\n وشموس معرفته\n فأوتاد النفوس الخوفُ والرجاءُ\n والرغبةُ والرهبة\n وفي القلوب ضياءُ العرفان\n وشموس التوحيد\n ونجوم العلوم والعقول\n والنفوس والقلوب\n بيده يُصَرِّفُها على ما أراد من أحكامه\n وقال في قوله: { وجعل فيها رواسي من فوقها }: الجبالُ أوتادُ الأرض\n في الصورة\n والأولياءُ رواسي الأرض في الحقيقة\n بهم تنزل البركة والأمطار\n وبهم يُدفع البلاء\n ثم قال: قوله تعالى: { وزيَّنا السماء الدنيا بمصابيح } وزيَّن وجه الأرض بمصابيح\n وهي قلوب الأحباب\n فأهلُ السماء إذا نظروا إلى قلوب أولياء الله بالليل\n فذلك متنزهُهُم\n كما أن أهل الأرض إذا نظروا إلى السماء تأنّسوا برؤية الكواكب\n هـ\n ثم هدّد أهل الكفر\n فقال: { فَإِنْ أَعْرَضُواْ فَقُلْ أَنذَرْتُكُمْ صَاعِقَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "65:12",
      "similarity": 0.400537385976289
    },
    {
      "verse": "2:29",
      "similarity": 0.3763409479710574
    },
    {
      "verse": "23:86",
      "similarity": 0.331255999481127
    },
    {
      "verse": "15:66",
      "similarity": 0.32384257247031883
    },
    {
      "verse": "78:12",
      "similarity": 0.3123411447225248
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/41:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/41:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/41:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}