{
  "chapter": "فصلت",
  "text": "وقال الذين كفروا۟ ربنا ارنا الذين اضلانا من الجن والانس نجعلهما تحت اقدامنا ليكونا من الاسفلين",
  "translations": [
    {
      "translation": "Those who are kafir say, 'Our Lord, show us those jinn and men who misguided us and we will place them beneath our feet so that they will be among the lowest of the low.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve will say: \"O Lord, show us those among the jinns and men who had led us astray that we may trample them underfoot and make them wholly abject.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There the unbelievers will say: “Our Lord, show us those that led us astray, both jinn and humans, and we will trample them under our feet so that they are utterly degraded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers will say, \"Lord, show us the human beings and jinn who caused us to go astray. We shall put them under our feet to lower them\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “Our Lord! Show us both – among jinns and men – who misled us, for us to put them beneath our feet so that they be the lowest of the low.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will say: \"Our Lord! Show us those among Jinn and men who led us astray, that we may crush them under our feet so that they become the lowest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will say: Our Lord! show us those who led us astray from among the jinn and the men that we may trample them under our feet so that they may be of the lowest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the unbelievers shall say, 'Our Lord, show us those that led us astray, both jinn and men, and we shall set them underneath our feet, that they may be among the lower ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will say: Our Lord! Show us those who beguiled us of the jinn and humankind. We will place them underneath our feet that they may be among the nethermost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those  who deny the truth will say, \"Our Lord, show us those jinn and men who misled us and we shall trample them underfoot, so that they may be among the lowest of the low.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will say: our Lord! show us those, of the jinn and mankind, who led us astray and we will place them underneath our feet that they may be of the nithermost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless will say, ‘Our Lord! Show us those who led us astray from among jinn and humans so that we may trample them under our feet, so that they may be among the lowermost!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Unbelievers will say: \"Our Lord! Show us those, among Jinns and men, who misled us: We shall crush them beneath our feet, so that they become the vilest (before all).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will say: \"Our Lord! Show us those among jinns and men who led us astray, we shall crush them under our feet, so that they become the lowest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will say: 'Lord, show us the jinn and people who led us astray, to put them under our feet so that they are among the lowest'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved will say, “Our Lord, show us those who led us astray—among jinn and humans—and we will trample them under our feet, so they become among of the lowest.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved will [then] say, \"Our Lord, show us those who misled us of the jinn and men [so] we may put them under our feet that they will be among the lowest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:29] And those who disbelieve will say, [while] in the Fire: ‘Our Lord, show us those who led us astray from among the jinn and mankind — namely, Iblīs and Cain [respectively], both of whom established disbelief and   slaying as something to be emulated — so that we may have them underneath our feet [to trample them], in the Fire, that they may be among the lowermost’, in other words, in a chastisement more severe than ours.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who disbelieve will say) while in the Fire: (Our Lord!) our Lord! (Show us these who beguiled us) those who misguided us from the Truth and guidance (of the jinn and humankind) from the jinn Satan, 553 and from humankind Cain who killed his brother Abel; and it is also said: from the jinn Iblis, and from the humans their leaders. (We will place them beneath our feet) to punish them (that they may be among the nethermost) that they may be among those who suffer the chastisement most.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَال الَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيْنِ أَضَلاَّنَا مِنَ ٱلْجِنِّ وَٱلإِنسِ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا } معناه إبليس، وابن آدم الذي قتلَ أخاهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah: {And those who disbelieve say, \"Our Lord, show us those who have misled us from among the jinn and the people that we may put them beneath our feet.\"} Its meaning is Iblis, and Adam's son who killed his brother.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدم استقر أهل النار في النار بأنواع السلاسل والأغلال { قَال الَّذِينَ كَفَرُواْ } بالله ورسله وكتبه في النشأة الأولى\n متحسرين متأسفين\n متضرعين إلى الله\n مناجين له: { رَبَّنَآ } يا من ربانا على فطرة الإسلام والتوحيد\n فكفرنا بك وأشركنا معك غيرك في ألوهيتك بإضلال قرنائنا الضالين المضلين { أَرِنَا } الشياطين { ٱلَّذَيْنِ أَضَلاَّنَا } عن طريق توحيد كتبك ورسلك الكائنين { مِنَ ٱلْجِنِّ وَٱلإِنسِ } أي: المضلِّين اللذين أضلانا من هذين الجنسين بأنواع الوساوس والزخارف\n والتغريرات والتزيينات { نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا } لننتقم عنهم جزاء ما فوتوا عنَّا سعادة الدارين وصلاح النشأتين\n وإنما نرجو منك هذا يا مولانا { لِيَكُونَا مِنَ ٱلأَسْفَلِينَ } [فصلت: 29] المستتبعين لنا\n كما كنا كذلك بالنسبة إليهم\n وإنما قالوا ما قالوا تحسراً وتضجراً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { وقال الذين كفروا } وهم متقلبون فيما ذكر من العذاب: { ربنا أَرِنَا اللذَيْنِ أَضَلاَّنا من الجن والإنس } ، يعنون الفريقين الحاملين على الضلال، من شياطين الجن والإنس، بالتسويل والتزيين، وقيل: هما إبليس وقابيل، فإنهما سنّا الكفر والقتل، وقرىء بسكون الراء تخفيفاً، كفَخِذ وفخْذ، وبالاختلاس، أي: أبصرناهما، { نَجْعَلْهُما تحت أقدامنا } أي: ندسهما تحت أرجلنا، انتقاماً منهما، أو: نجعلهما في الدرك الأسفل { ليكونا من الأسفلين } ذلاًّ ومهانةً، أو: مكاناً، جزاء إضلالهم إيانا. الإشارة: كل مَن سقط عن درجة المقربين العارفين، وتعوّق عن صحبتهم، بسبب تعويق أحد، تمنى يوم القيامة أن يكون تحت قدمه، ليكون أسفل منه، غيظاً وندماً، ولا ينفع التمني والندم في ذلك اليوم. وبالله التوفيق. ثم ذكر أهل القُرب والعناية، بعد ذكر أهل البُعد والغواية، فقال: { إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَامُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "95:5",
      "similarity": 0.7133476739258671
    },
    {
      "verse": "37:98",
      "similarity": 0.6780732873973442
    },
    {
      "verse": "4:145",
      "similarity": 0.5238851278959218
    },
    {
      "verse": "8:42",
      "similarity": 0.33363895352594375
    },
    {
      "verse": "15:74",
      "similarity": 0.3161233210158367
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}