{
  "chapter": "فصلت",
  "text": "وقيضنا لهم قرناء فزينوا۟ لهم ما بين ايديهم وما خلفهم وحق عليهم القول فى امم قد خلت من قبلهم من الجن والانس انهم كانوا۟ خسرين",
  "translations": [
    {
      "translation": "We have assigned close comrades to them who have made what is before them and behind them seem good to them. And the statement about the nations, both of jinn and men, who passed away before them has proved true of them as well. Certainly they were lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had assigned to them close companions who made their past and present look attractive to them; and the fate that had once befallen the communities of jinns and men before them was justified upon them. They were indeed bound to perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had assigned to them companions who embellished for them all that was before them and behind them. Thus the same decree (of chastisement) which had overtaken the previous generations of jinn and human beings (also) became due against them. Surely they became the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We assigned for them companions who would make their past and present (deeds) seem attractive to them. Thus, they became subject to what the jinn and human beings before were destined to suffer. They were certainly lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed companions for them, who made what is before them and what is after them seem good to them, and the Word proved true upon them along with the groups of jinns and men who passed away before them; they were indeed losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have assigned for them intimate companions (in this world), who have made fair seeming to them, what was before them and what was behind them. And the Word is justified against them as it was justified against those who were among the previous generations of Jinn and men that had passed away before them. Indeed they (all) were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have appointed for them comrades so they have made fair-seeming to them what is before them and what is behind them, and the word proved true against them-- among the nations of the jinn and the men that have passed away before them-- that they shall surely be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have allotted them comrades, and they have decked out fair to them that which is before them and behind them. So against them has been realized the Word concerning nations that passed away before them, men and jinn alike; surely they were losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We assigned them comrades (in the world), who made their present and their past fairseeming unto them. And the Word concerning nations of the jinn and humankind who passed away before them hath effect for them. Lo! they were ever losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We assigned to them companions who made their doings appear fair to them. But the same decree [of punishment] proved true against them, which had proved true against nations of jinn and mankind who passed away before them. Surely they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have assigned Unto them some companions who made fairseeming Unto them that which was before them and that which was behind them justified upon them was the Word Pronounced on the communities of the jinn and mankind who passed away before them; verily they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have assigned them companions who make their present [conduct] and future [state] seem decorous to them, and the word became due against them along with the nations of jinn and humans that passed away before them. They were indeed losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have destined for them intimate companions (of like nature), who made alluring to them what was before them and behind them; and the sentence among the previous generations of Jinns and men, who have passed away, is proved against them; for they are utterly lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have assigned them (devils) intimate companions (in this world), who have made fair-seeming to them, what was before them (evil deeds which they were doing in the present worldly life and disbelief in the Reckoning and the Resurrection, etc.) and what was behind them (denial of the matters in the coming life of the Hereafter as regards punishment or reward, etc.). And the Word (i.e. the torment) is justified against them as it was justified against those who were among the previous generations of jinns and men that had passed away before them. Indeed they (all) were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have assigned companions to them, who make what is before them and behind them seem fair to them. The statement has been realized against them in nations of people and jinn alike that passed away before them they were indeed the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had assigned companions for them, who glamorized to them what was in front of them, and what was behind them. And the Word proved true against them in communities of jinn and humans that have passed away before them. They were losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed for them companions who made attractive to them what was before them and what was behind them [of sin], and the word has come into effect upon them among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:25] And We have assigned, We have occasioned [for], them companions, from among the devils, who have adorned for them that which is before them, of what concerns this world and the following after lusts, and that which is behind them, of what concerns the Hereafter, when they [make them] say that there will be neither resurrection nor reckoning. And the word, of chastisement — namely, the verse: Assuredly I will fill Hell … [Q. 11:119]) — became due against them, being among, all those, communities that passed away, [that] were destroyed, before them of jinn and mankind. Truly they were losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We assigned them comrades) helpers and partners among the satans, (who made their present and their past fair-seeming unto them) about the life of the world, they enticed them not to spend, making them believe that the life of the world will never perish or end; and regarding the matter of the Hereafter, they convinced them that there is no Paradise or hell, resurrection or reckoning. (And the Word) of chastisement (concerning nations of the jinn and humankind) of the disbelievers among the jinn and human beings (who passed away before them hath effect for them) has been ordained for them. (Verily they are the losers) in that they are punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَيَّضْنَا لَهُمْ قُرَنَآءَ } معناه هيئنا لهم\n قُرناءُ: أمثالُ وأَشباهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {And We have appointed for them close companions} means that We have appointed for them\n\n\nContemporaries: Examples and Similarities",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ قد { قَيَّضْنَا } وقدرنا { لَهُمْ } فيما هم عليه من الكفر والشقاق\n وأنواع الفسوق والنفاق { قُرَنَآءَ } أخداناً وإخواناً من الشياطين يوحون إليهم ما يبعدهم عن الحق وأهله { فَزَيَّنُواْ لَهُم } وحسَّنوا لطباعهم { مَّا بَيْنَ أَيْدِيهِمْ } من اتباع الشهوات\n واركتاب المناهي والمحظورات { وَ } إنكار { مَا خَلْفَهُمْ } من الأمور الأخروية مواعيدها وموعوداتها\n\n\n{ وَ } سبب ارتكاب المعاصي وإصفاؤهم\n قول قرنائهم { حَقَّ } وثبت { عَلَيْهِمُ ٱلْقَوْلُ } وكلمة العذاب المؤبد منَّا\n وليس هذا مخصوص بقوم دون قوم بل جرت سنتا كذلك { فِيۤ } كل { أُمَمٍ } مفسدة مشركة { قَدْ خَلَتْ } ومضت { مِن قَبْلِهِمْ } أي: قبل هؤلاء المشركين المسرفين سواء أكانوا { مِّنَ ٱلْجِنِّ وَٱلإِنْسِ } أي: المكلفين منها\n وإنما استحقوا العذاب المؤبد والنكال المخلد بسبب { إِنَّهُمْ كَانُواْ خَاسِرِينَ } [فصلت: 25] خسراناً مبيناً\n لاستبدالهم أسباب السعادة والهداية بالشقاوة والضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { وقيّضنا } أي: سيَرنا، أو: قدّرنا، { لهم } أي: كفار مكة في الدنيا { قُرَناء } سواء من الجن والإنس، أو: سلطنا عليهم نظراء لهم من الشياطين يستولون عليهم، كقوله:\n[الزخرف: 36]، { فَزَيَّنوا لهم ما بين أيديهم } من أمور الدنيا، واتباع الشهوات، والتقليد لأسلافهم، حتى حادوا عن الحق، { وما خَلْفَهم } من أمور الآخرة، حيث ألقوا إليهم: ألا بعث ولا حساب. أو: ما تقدّم من أعمالهم وما هم عازمون عليها، { وحقّ عليهم القولُ } أي: ثبت وتقرّر عليهم كلمة العذاب، أو: تحقق موجبها ومصداقها، وهي قوله تعالى لإبليس:\n[ص: 85]، حال كونهم { في } جملة { أمم قد خلت مِن قبلهم } أي: قبل أهل مكة { من الجن والإِنس } كانوا مُصرّين على الكفر والعصيان، { إِنهم كانوا خاسرين } حيث آثروا الباطل على الحق، وهو تعليل لاستحقاقهم العذاب. والضمير لهم وللأمم. الإشارة: قال القشيري: إذا أراد الله بعبده سوء، قيّض له إخوان سوء وقرناء شر، هم الأضداد له فيما راموا، وإذا أراد الله بعبد خيراً قيّض له قرناء خير، يُعِينونه على الطاعة، ويَحْمِلونه عليها، ويدعونه إليها، وإذا كانوا إخوانَ سوءٍ يحملونه على المخالفات، ويدعونه إليها، ومن ذلك الشيطانُ. ثم قال: وشرُّ قرين للمرء نفسُه، ثم الشيطان، ثم شياطين الإنسِ، فزيّنوا لهم ما بين أيديهم من طول الأمل، وما خلفهم من نسيان الزَّلَلِ، والتسويف في التوبة، والتقصير في الطاعة. هـ. قلت: والله ما رأينا الفلاح والخسران إلا من الخلطة. قال بعضهم: والله ما أفلح مَن أفلح إلا بصحبة مَن أفلح، ولا سيما صبحة العارفين فساعة معهم تعدل عبادة سنين بالصيام والقيام وأنواع المجاهدة، ولله در الجيلاني رضي الله عنه حيث قال:\nثم ذكر بعض ما زيَّنوا لهم، فقال: { وَقَالَ ٱلَّذِينَ كَفَرُواْ لاَ تَسْمَعُواْ لِهَـٰذَا ٱلْقُرْآنِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:36",
      "similarity": 0.8278940478374922
    },
    {
      "verse": "46:18",
      "similarity": 0.22660313075813418
    },
    {
      "verse": "35:24",
      "similarity": 0.1392506093095647
    },
    {
      "verse": "13:30",
      "similarity": 0.13759899191593017
    },
    {
      "verse": "2:134",
      "similarity": 0.13378109726291437
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}