{
  "chapter": "فصلت",
  "text": "حتى اذا ما جاءوها شهد عليهم سمعهم وابصرهم وجلودهم بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "when they reach it, their hearing, sight and skin will testify against them concerning what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that when they reach it their ears and eyes and persons will testify to what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when all have arrived, their ears, their eyes, and their skins shall bear witness against them, stating all that they had done in the life of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until (on the brink of it) their eyes, ears and skin will testify to their deeds on the Day when the enemies of God are driven to the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when they reach it, their ears and their eyes and their skins will testify against them for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reach it, their hearing (ears) and their eyes and their skins will testify against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they come to it, their ears and their eyes and their skins shall bear witness against them as to what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "till when they are come to it, their hearing, their eyes and their skins bear witness against them concerning what they have been doing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reach it, their ears and their eyes and their skins testify against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they come close to it, their ears, eyes and skins will testify against them for their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they come to it, their ears and their sights and their skins will bear witness against them of that which they had been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they come to it, their hearing, their eyes and their skins will bear witness against them concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, when they reach the (Fire), their hearing, their sight, and their skins will bear witness against them, as to (all) their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reach it (Hell-fire), their hearing (ears) and their eyes, and their skins will testify against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they reach it, their hearing, eyes and skins will testify against them for what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they have reached it, their hearing, and their sight, and their skins will testify against them regarding what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:20] until, when they reach it (idhā mā: the mā is extra), their hearing and their eyes and their skins will bear witness against them concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nحَتَّى إِذَا مَا جَاءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُمْ بِمَا كَانُوا يَعْمَلُونَ (20) و { حتى } ابتدائية وهي مفيدة لمعنى الغاية فهي حرف انتهاء في المعنى وحرف ابتداء في اللفظ ، أي أن ما بعدها جملة مستأنفة . و { إذا } ظرف للمستقبل متضمن معنى الشرط وهو متعلق بجوابه ، و { ما } زائدة للتوكيد بعد { إذَا } تفيد توكيد معنى { إذَا } من الارتباط بالفعل الذي بعد { إذا } سواء كانت شرطية كما في هذه الآية أم كانت لمجرد الظرفية كقوله تعالى : { وإذا ما غضبوا هم يغفرون } \\[ الشورى : 37 \\] . ويظهر أن ورود { مَا } بعد { إذا } يقوّي معنى الشرط في { إذا } ، ولعلهُ يكون معنى الشرط حينئذٍ نصاً احتمالاً . وضمير المؤنث الغائب في { جَاءُوهَا } عائد إلى { النَّارِ } ، أي إذا وصلوا إلى جهنم .وجملة { شَهِدَ عَلَيهِم سَمْعُهُم وأبصارهم } الخ يقتضي كلام المفسرين أنها جواب { إذا } ، فاقتضى الارتباط بين شرطها وجوابها وتعليقها بفعل الجواب . واستشعروا أن الشهادة عليهم تكون قبل أن يوجهوا إلى النار ، فقدَّروا فِعلاً محذوفاً تقديره : وسُئلوا عما كانوا يفعلون فأنكروا فشهد عليهم سمعهم وأبصارهم وجلودهم ، يعني : سألهم خزنة النار .وأحسنُ من ذلك أن نقول : إن جواب { إذا } محذوف للتهويل وحذف مثله كثير في القرآن ، ويكون جملة { شَهِدَ عَلَيهِم سَمْعُهُم } إلى آخرها مستأنفة استئنافاً بيانياً نشأ عن مفاد { حتى } من الغاية لأن السائل يتطلب ماذا حصل بين حشرهم إلى النار وبين حضورهم عند النار فأجيب بأنه { شَهِدَ عَلَيهِم سَمْعُهُم وأبصارهم وَجُلُودُهُم } إلى قوله : { الَّذِي أنْطَقَ كُلَّ شَيْءٍ } ويتضمن ذلك أنهم حوسبوا على أعمالهم وأنكروها فشهدت عليهم جوارحهم وأجسادهم . أو أن يكون جواب { إذا } قوله : { فَإِن يَصْبِرُوا فالنَّارُ مَثْوَىً لَهُم } \\[ فصلت : 24 \\] الخ . وجملة { شَهِدَ عَلَيهِم سَمْعُهُم وأبصارهم } وما عطف عليها معترضة بين الشرط وجوابه . وشهادة جوارحهم وجلودهم عليهم : شهادة تكذيب وافتضاح لأن كون ذلك شهادة يقتضي أنهم لما رأوا النار اعتذروا بإنكار بعض ذنوبهم طمعاً في تخفيف العذاب وإلا فقد علم الله ما كانوا يصنعون وشهدت به الحفظة وقرىء عليهم كتابُهم ، وما أُحضروا للنار إلا وقد تحققت إدانتهم ، فما كانت شهادة جوارحهم إلا زيادة خزي لهم وتحسيراً وتنديماً على سوء اعتقادهم في سعة علم الله .وتخصيص السمع والأبصار والجلود بالشهادة على هؤلاء دون بقية الجوارح لأن للسمع اختصاصاً بتلقي دعوة النبي صلى الله عليه وسلم وتلقي آيات القرآن ، فسمعهم يشهد عليهم بأنهم كانوا يصرفونه عن سماع ذلك كما حكى الله عنهم بقوله : { وَفِي ءَاذَانِنَا وَقْرٌ } \\[ فصلت : 5 \\] ، ولأن للأبصار اختصاصاً بمشاهدة دلائل المصنوعات الدالة على انفراد الله تعالى بالخلق والتدبير فذلك دليل وحدانيته في إلهيته ، وشهادة الجلود لأن الجلد يحوي جميع الجسد لتكون شهادة الجلود عليهم شهادة على أنفسها فيظهر استحقاقها للحرق بالنار لبقية الأجساد دون اقتصار على حرق موضع السمع والبصر .ولذلك اقتصروا في توجيه الملامة على جلودهم لأنها حاوية لجميع الحواس والجوارح ، وبهذا يظهر وجه الاقتصار على شهادة السمع والأبصار والجلود هنا بخلاف آية سورة النور ( 24 ) { يوم تشهد عليهم ألسنتهم وأيديهم وأرجلهم بما كانوا يعملون } ، لأن آية النور تصف الذين يرمون المحصنات وهم الذين اختلقوا تهمة الإِفك ومشَوا في المجامع يُشيعونها بين الناس ويشيرون بأيديهم إلى من اتهموه إفكاً .وإنما قالوا لجلودهم { لِمَ شَهِدتُمْ عَلَيْنَا } دون أن يقولوه لسمعهم وأبصارهم لأن الجلود مواجهة لهم يتوجهون إليها بالملامة . وإجراء ضمائر السمع والبصر والجلود بصيغتي ضمير جمع العقلاء لأن التحاور معها صيرها بحالة العقلاء يومئذٍ . ومن غريب التفسير قول من زعموا أن الجلود أريد بها الفروج ونسب هذا للسدي والفراء ، وهو تعنت في محمل الآية لا داعي إليه بحال ، وعلى هذا التفسير بنى أحمد الجرجاني في كتاب «كنايات الأدباء» فعدَّ الجلود من الكنايات عن الفُروج وعزاه لأهل التفسير فجازف في التعبير .\n\n",
      "translations": [
        {
          "translation": "Till, when they reach it) i.e. the Fire, (their ears and their eyes and their skins testify against them) their ears will testify about what they heard, and their eyes will testify about what they saw and their skins and limbs will tell about what they did (as to what they used to do) with them in their state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا مَا جَآءُوهَا } أي: حضروا النار\n وازدحموا حولهم مجتمعين صائحين فزعين مجادلين منكرين بصدور أسباب العذاب عنهم\n مع أنهم يحاسبون أولاً ثم يساقون نحو النار\n ولإسكاتهم وتبكيتهم عن الجدال والمراء { شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُم } أي: أعترشفت جوارحهم وقواهم { بِمَا كَانُواْ يَعْمَلُونَ } [فصتل: 20] ويقترفون بها من المحرمات والمنهيات\n بأن يلهمهم الله الاعتراف والتنطق بلسان الحال والمقال\n إذ الكل مما أحاطت به قدرته سبحانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فبمجرد حضورهم { شَهِدَ عليهم سمعُهُم وأبصارُهم وجلودُهم } أي: بَشَراتهم { بما كانوا يعملون } في الدنيا\n من فنون الكفر والمعاصي\n بأن ينطقها الله تعالى\n ويظهرعليها آثار ما اقترفوا بها\n وعن ابن عباس رضي الله عنه: أن المراد بشهادة الجلود: شهادة الفروج\n كقول الشاعر:\nفكنَّى بجلده عن فرحه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:21",
      "similarity": 0.566133429450507
    },
    {
      "verse": "41:22",
      "similarity": 0.4190714424462717
    },
    {
      "verse": "24:4",
      "similarity": 0.3589508381478224
    },
    {
      "verse": "24:2",
      "similarity": 0.3140465833245586
    },
    {
      "verse": "22:20",
      "similarity": 0.27904388154475196
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}