{
  "chapter": "فصلت",
  "text": "وقالوا۟ لجلودهم لم شهدتم علينا قالوا۟ انطقنا الله الذى انطق كل شىء وهو خلقكم اول مرة واليه ترجعون",
  "translations": [
    {
      "translation": "And they will say to their bodies: \"Why did you testify against us?\" They will answer: \"God, who gave all things power of articulation, made us speak. It is He who created you the first time, and to Him you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask their skins: “Why did you bear witness against us?” The skins will reply: “Allah gave us speech, as He gave speech to all others. He it is Who created you for the first time and it is to Him that you will be sent back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask their own skin, \"Why did you testify against us?\" They will reply, \"God, who has made everything speak, made us also speak. It was He Who created you in the first place and to Him you have returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say to their skins, “Why did you testify against us?\"; they will say, “Allah has made us talk, Who has given all things the power of speech, and it is He Who created you the first time, and it is to Him that you have to return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say to their skins, \"Why do you testify against us\" They will say: \"Allah has caused us to speak - as He causes all things to speak, and He created you the first time, and to Him you are made to return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall say to their skins: Why have you borne witness against us? They shall say: Allah Who makes everything speak has made us speak, and He created you at first, and to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they will say to their skins, 'Why bore you witness against us?' They shall say, 'God gave us speech, as He gave everything speech. He created you the first time, and unto Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say unto their skins: Why testify ye against us? They say: Allah hath given us speech Who giveth speech to all things, and Who created you at the first, and unto Whom ye are returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will ask their skins, \"Why did you bear witness against us?\" and their skins will reply, \"God, who gives speech to all things, has given speech to us [as well], it was He who created you in the first instance and to Him you are [now] brought back,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say Unto their skins: wherefore bear ye witness against us They will say: Allah hath caused us to speak, Who causeth everything to speak, and Who created you the first time and Unto whom ye are now caused to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say to their skins, ‘Why did you bear witness against us?’ They will say, ‘We were given speech by Allah, who gave speech to all things. He created you the first time, and you are being brought back to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say to their skins: \"Why bear ye witness against us?\" They will say: \"Allah hath given us speech,- (He) Who giveth speech to everything: He created you for the first time, and unto Him were ye to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say to their skins, \"Why do you testify against us?\" They will say: \"Allah has caused us to speak, as He causes all things to speak, and He created you the first time, and to Him you are made to return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did you bear witness against us' they will ask their skins, and they will reply: 'Allah has given us speech, as He has given speech to everything. It was He who created you the first time, and to Him you shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say to their skins, “Why did you testify against us?” They will say, “God, Who made all things speak, made us speak. It is He who created you the first time, and to Him you are returned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:21] And they will say to their skins, ‘Why did you bear witness against us?’ They will say, ‘God made us speak, Who gave speech to all things, in other words, [all things] which He wanted to [be able to] speak. And He created you the first time, and to Him you will be returned: it is said that this statement is made by their skins; but it is also said to be God’s words, as is the case with what follows, for it is similar in context to   what preceded, namely, that the One with the power to originate you without any precedent and restore you to life after death, also has the power to make your skins and your limbs speak.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say unto their skins) to their limbs; and it is also said: to their sexual organs: (Why testify ye against us) when we were trying to argue in your favour? (They say: Allah hath given us speech) Allah has made us speak (Who giveth speech to all things) to all created beings today, (and Who created you) and Who made you speak (at the first) in the first instance, (and unto Whom ye are returned) after death. 552\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَالُواْ لِجُلُودِهِمْ لِمَ شَهِدتُّمْ عَلَيْنَا } قال: إنّ معناها الفروجُ\n ولكن الله عَزّ وجلّ كنى عنها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعوا من قواهم ما سمعوا من الاعتراف { قَالُواْ } موبِّخين مقرعين { لِجُلُودِهِمْ } وجوارحهم المعترفة بذنوبهم: { لِمَ شَهِدتُّمْ عَلَيْنَا } مع أنَّا لا نُعذب إلا بكم ومعكم؟ من أين تجترئون على أنفسكم بالعرض على العذاب المؤبد أيها الحمقى الجهلاء { قَالُوۤاْ } ما كنا مختارين في هذه الشهادة والاعتراف، بل { أَنطَقَنَا ٱللَّهُ } القادر المقتدر العليم الحكيم { ٱلَّذِي أَنطَقَ كُلَّ شَيْءٍ } بآيات وجوب وجوده، ودلائل توحيده بمقتضى جوده، وليس تعجباً من قدرته سبحانه إنطاقنا بما اقترفتم بنا من المعاصي والآثام المخالفة لأمره وحكمه، غيره منه سبحانه، وقهراً على من خرج عن ربقة عبوديته بترك أوامره وأحكامه\n\n\n\n\n{ وَ } كيف لا يغار ويقهر سبحانه عليكم أيها المفسدون المسرفون مع أنه { هُوَ } بذاته وبمقتضى أسمائه وصفاته { خَلَقَكُمْ } وأظهركم من كتم العدم خلقاً إبداعياً { أَوَّلَ مَرَّةٍ } بلا سبق مادة ومدة، وشركة من أحد ومظاهرة { وَإِلَيْهِ } أيضاً آخر مرة كذلك { تُرْجَعُونَ } [فصلت: 21] رجوع العكوس والأظلال إلى الأضواء، والأمواج إلى الماء، فمن أين تستنكفون عن عبوديته، وتخرجون عن حكمه وأمره؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفكنَّى بجلده عن فرحه، وهو الأنسب لتخصيص السؤال بها في قوله تعالى: { وقالوا لجلودهم لمَ شهدتم علينا } ، فإن ما تشهد به من الزنا أعظم جناية وقُبحاً، وأجلب للحزن والعقوبة، مما تشهد به السمع والأبصار من الجنايات المكتسبة بتوسطها\n روي: أن العبد يقول يوم القيامة: يا رب، أليس قد وعدتني ألا تظلمني؟ فيقول تعالى: فإن لك ذلك، قال: فإني لا أقبل عليّ شاهداً إلا من نفسي، قال تعالى: أوَ ليس كفى بي شهيداً، وبالملائكة الكرام الكاتبين؟ قال: فيُختم على فِيهِ، وتتكلم أركانُه بما كان يعمل، فيقول لهن: بُعْداً لكُنَّ وسُحْقاً، عنكُنَّ كنتُ أُجادل \"\n { قالوا } في جوابهم: { وأنطقَنا اللهُ الذي أنطق كلَّ شيءٍ } من الحيوانات، وأقدرنا على بيان الواقع، فشهدنا عليكم بما عملتم من القبائح، وما كتمناها\n أو: ما نطقنا باختيارنا، بل أنطقنا الله الذي انطق كل شيء\n وقيل: سألوها سؤال تعجُّب، فالمعنى حينئذ: وليس نطقنا بعجب من قدرة الله تعالى الذي أنطق كل شيء، { وهو خلقكم أولَ مرةٍ وإليه تُرجعون } فإنَّ مَن قدر على خلقكم أول مرة، وعلى إعادتكم ورجعكم إلى جزائه، لا يتعجب من إنطاقه جوارحكم\n ولعل صيغة المضارع، مع أن هذه المحاورة بعد البعث والرجع، كما أن المراد بالرجوع ليس مجرد الرد إلى الحياة بالعبث، بل ما يعمه، وما يترتب عليه من العذاب الخالد الترقب عند التخاطب، على تغليب المتوقع على الواقع، مع ما فيه من مراعاة الفواصل، فهذا على أنه من تتمة كلام الجلود، وقيل: هو من كلام الحق ـ تعالى ـ لهم، فيُوقف على \" شيء \" وهو ضعيف",
      "translations": []
    }
  ]
}