{
  "chapter": "فصلت",
  "text": "وقال الذين كفروا۟ لا تسمعوا۟ لهذا القرءان والغوا۟ فيه لعلكم تغلبون",
  "translations": [
    {
      "translation": "Those who are kafir say, 'Do not listen to this Qur'an. Drown it out so that hopefully you will gain the upper hand.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers say: \"Do not listen to this Qur'an, and shout away (its reading); you may haply prevail.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deniers of the Truth say: “Do not give ear to the Qur'an and cause interruption when it is recited; thus perhaps you will gain the upper hand.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers say, \"Do not listen to this Quran but make a lot of unnecessary noise while it is being read so that perhaps you will defeat it\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “Do not listen to this Qur’an and engulf it in noise – perhaps you may be victorious this way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: \"Listen not to this Qur'an, and make noise in the midst of its (recitation) that you may overcome.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: Do not listen to this Quran and make noise therein, perhaps you may overcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'Do not give ear to this Koran, and talk idly about it; haply you will overcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: Heed not this Qur'an, and drown the hearing of it; haply ye may conquer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say, \"Do not listen to this Quran. Drown it out with noise, so that you may gain the upper hand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: hearken not Unto this Qur'an and babble therein, haply ye may overcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘Do not listen to this Quran and hoot it down so that you may prevail [over the Apostle].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say: \"Listen not to this Qur'an, but talk at random in the midst of its (reading), that ye may gain the upper hand!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: \"Listen not to this Quran, and make noise in the midst of its (recitation) that you may overcome.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: 'Do not listen to this Koran, and talk idly about it so that you might be overcome'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “Do not listen to this Quran, and talk over it, so that you may prevail.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:26] And those who disbelieve say, during the Prophet’s (s) recitation [of the Qur’ān], ‘Do not listen to this Qur’ān and hoot it down, make a din and so forth, and clamour whenever he is reciting, that perhaps you might prevail’, so that he will then desist from recitation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) the disbelievers of Mecca, Abu Jahl and his host (say: Heed not this Qur'an) which is recited to you by Muhammad (pbuh) (and drown the hearing of it) by causing uproar; (haply ye may conquer) Muhammad (pbuh) and make him keep quiet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَالَ ٱلَّذِينَ كَفَرُواْ لاَ تَسْمَعُواْ لِهَـٰذَا ٱلْقُرْآنِ وَٱلْغَوْاْ فِيهِ } معناه اكثِروا من اللغطِ والصَّخبِ، حتى لا يسمَعهُ سَامعٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة غيهم وضلالهم والمفضي إلى الخسران العظيم { قَالَ ٱلَّذِينَ كَفَرُواْ } بك وبدينك وبكتابك - يا أكمل الرسل - حين تلاوتك وتبليغك عليهم آيات القرآن { لاَ تَسْمَعُواْ لِهَـٰذَا ٱلْقُرْآنِ } ولا تلفتوا إلى محمد حين قرأ، بل { وَٱلْغَوْاْ فِيهِ } بالصياح، وإنشاد الأشعار، وخلط الأصوات والخرفات { لَعَلَّكُمْ تَغْلِبُونَ } [فصلت: 26] محمداً، وتدفعون قراءتهم، وتخجلونه فيسكت\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقال الذين كفروا } من رؤساء المشركين لأتباعهم، أو: بعضهم لبعض: { لا تسمعوا لهذا القرآنِ } إذا قُرىء، أي: لا تنصتوا له لأنه يقلب القلوب، ويسبي العقول، وكل مَن استمع إليه صبا إليه، { والْغَوْا فيه لعلكم تَغْلِبون } أي: عارضوه بكلام غير مفهوم، أو: بالخرافات من الرّجَز والشعر والتصدية، وارفعوا أصواتكم بها { لعلكم تغلبون } أي: تغلبونه على قراءته، وشوِّشوا عليه فيقع في الغلط، أو: لا يسمعه منه أحد\n واللغو: الساقط من الكلام الذي لا طائلَ تحته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "88:11",
      "similarity": 0.7547789261826591
    },
    {
      "verse": "78:35",
      "similarity": 0.7447474477206042
    },
    {
      "verse": "56:25",
      "similarity": 0.692730345119602
    },
    {
      "verse": "23:3",
      "similarity": 0.6802062240209179
    },
    {
      "verse": "28:55",
      "similarity": 0.5754670613510013
    }
  ]
}