{
  "chapter": "فصلت",
  "text": "حتى اذا ما جاءوها شهد عليهم سمعهم وابصرهم وجلودهم بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "So that when they reach it their ears and eyes and persons will testify to what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when all have arrived, their ears, their eyes, and their skins shall bear witness against them, stating all that they had done in the life of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until (on the brink of it) their eyes, ears and skin will testify to their deeds on the Day when the enemies of God are driven to the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when they reach it, their ears and their eyes and their skins will testify against them for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reach it, their hearing (ears) and their eyes and their skins will testify against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they come to it, their ears and their eyes and their skins shall bear witness against them as to what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "till when they are come to it, their hearing, their eyes and their skins bear witness against them concerning what they have been doing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reach it, their ears and their eyes and their skins testify against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they come close to it, their ears, eyes and skins will testify against them for their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they come to it, their ears and their sights and their skins will bear witness against them of that which they had been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they come to it, their hearing, their eyes and their skins will bear witness against them concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, when they reach the (Fire), their hearing, their sight, and their skins will bear witness against them, as to (all) their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reach it (Hell-fire), their hearing (ears) and their eyes, and their skins will testify against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they reach it, their hearing, eyes and skins will testify against them for what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they have reached it, their hearing, and their sight, and their skins will testify against them regarding what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:20] until, when they reach it (idhā mā: the mā is extra), their hearing and their eyes and their skins will bear witness against them concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Till, when they reach it) i.e. the Fire, (their ears and their eyes and their skins testify against them) their ears will testify about what they heard, and their eyes will testify about what they saw and their skins and limbs will tell about what they did (as to what they used to do) with them in their state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا مَا جَآءُوهَا } أي: حضروا النار، وازدحموا حولهم مجتمعين صائحين فزعين مجادلين منكرين بصدور أسباب العذاب عنهم، مع أنهم يحاسبون أولاً ثم يساقون نحو النار، ولإسكاتهم وتبكيتهم عن الجدال والمراء { شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُم } أي: أعترشفت جوارحهم وقواهم { بِمَا كَانُواْ يَعْمَلُونَ } [فصتل: 20] ويقترفون بها من المحرمات والمنهيات، بأن يلهمهم الله الاعتراف والتنطق بلسان الحال والمقال؛ إذ الكل مما أحاطت به قدرته سبحانه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { حتى إِذا ما جاؤوها } أي: حضروها، و \" حتى \": غاية للحشر، أو: ليوزعون، و \" ما \": مزيدة لتأكيد اتصال الشهادة بالحضور، فبمجرد حضورهم { شَهِدَ عليهم سمعُهُم وأبصارُهم وجلودُهم } أي: بَشَراتهم { بما كانوا يعملون } في الدنيا، من فنون الكفر والمعاصي، بأن ينطقها الله تعالى، ويظهرعليها آثار ما اقترفوا بها\n وعن ابن عباس رضي الله عنه: أن المراد بشهادة الجلود: شهادة الفروج، كقول الشاعر:\n",
      "translations": []
    }
  ]
}