{
  "chapter": "فصلت",
  "text": "وذلكم ظنكم الذى ظننتم بربكم اردىكم فاصبحتم من الخسرين",
  "translations": [
    {
      "translation": "It is that thought you had about your Lord that has destroyed you so now you find yourselves among the lost.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is this notion you had of your Lord that caused your ruin, and you are lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This thought of yours about your Lord has led to your perdition and you have become among the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was how you considered your Lord, but He knows you better than you know yourselves. Thus, you are now lost\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the assumption you had regarding your Lord, which has ruined you, so you are now among those who have been defeated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that thought of yours which you thought about your Lord, has brought you to destruction; and you have become of those utterly lost!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that was your (evil) thought which you entertained about your Lord that has tumbled you down into perdition, so are you become of the lost ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That then, the thought you thought about your Lord, has destroyed you, and therefore you find yourselves this morning among the losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, your thought which ye did think about your Lord, hath ruined you; and ye find yourselves (this day) among the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but these thoughts which you entertained concerning your Lord, have brought you to destruction, and [now] you are among the utterly lost!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That thought of yours which ye formed concerning Your Lord, hath ruined you, and ye have become of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That misjudgement, which you entertained about your Lord ruined you. So you became losers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But this thought of yours which ye did entertain concerning your Lord, hath brought you to destruction, and (now) have ye become of those utterly lost!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that thought of yours which you thought about your Lord, has brought you to destruction, and you have become (this Day) of those utterly lost!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, it is the thoughts you thought about your Lord that have destroyed you, therefore, this morning you find yourselves among the losers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is that thought of yours about your Lord that led you to ruin—so you became of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:23] And that (wa-dhālikum, the subject) supposition of yours (zannukum, substitutes for it) which you supposed of your Lord (alladhī zanantum bi-rabbikum, a descriptive clause; the predicate [is the following, ardākum]) has ruined you, that is, it has brought about your destruction. So you have become among the losers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That, your thought which ye did think about your Lord) this which you said falsely about your Lord because of surmise (hath ruined you) has destroyed you; (and ye find yourselves (this day) among the lost) by being subject to punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَذَلِكُمْ } أي: هذا الذي نسبتم إلى الله بقولهم هذا { ظَنُّكُمُ } السوء، وزعمكم الفاسد { ٱلَّذِي ظَنَنتُم بِرَبِّكُمْ } العليم الخبير بجميع ما صدر عنكم، وهذا { أَرْدَاكُمْ } وأهلككم في تيه الجهل والضلال، وبعدما فوَّتم على أنفسكم أسباب السعادة والهداية، واخترتم بدلها ما يوجب الشقاوة والضلال { فَأَصْبَحْتُمْ مِّنَ } زمرة { ٱلُخَاسِرِينَ } [فصلت: 23] وانقلبتم صاغرين مهانين، وصرتم في النار خالدين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وذلكم ظنُّكم الذي ظننتم بربكم أرداكم } أهلككم، فـ \" ذلك \": مبتدأ، و \" ظنكم \": خبر، و \" الذي ظننتم بربكم \": صفة، و \" أرداكم \": خبر ثان، أو: ظنكم: بدل من \" ذلك \" و \" أرداكم \": خبر، { فأصبحتم } بسبب الظن السوء { من الخاسرين } إذ صار ما منحوا لسعادة الدارين سبباً لشقاء النشأتين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:11",
      "similarity": 0.7799553947053923
    },
    {
      "verse": "20:16",
      "similarity": 0.7236143492526511
    },
    {
      "verse": "37:56",
      "similarity": 0.606364929872029
    },
    {
      "verse": "6:137",
      "similarity": 0.5821176207238554
    },
    {
      "verse": "5:30",
      "similarity": 0.27259656123053594
    }
  ]
}