{
  "chapter": "فصلت",
  "text": "وما كنتم تستترون ان يشهد عليكم سمعكم ولا ابصركم ولا جلودكم ولكن ظننتم ان الله لا يعلم كثيرا مما تعملون",
  "translations": [
    {
      "translation": "You did not think to shield yourselves from your hearing, sight and skin testifying against you and you thought that Allah would never know much of what you did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not hide your (doings) so that your ears or eyes or persons should not testify against you. In fact you thought that God did not know the things you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you used to conceal yourselves (while committing misdeeds) you never thought that your ears or your eyes or your skins would ever bear witness against you; you rather fancied that Allah does not know a great deal of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not (think) to hide your deeds from your ears, eyes and skin and you felt that God would not know all that you had been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And where could you hide from Him, so that your ears and your eyes and your skins may not testify against you? But you had assumed that Allah does not know most of your deeds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you have not been hiding yourselves (in the world), lest your ears and your eyes and your skins should testify against you; but you thought that Allah knew not much of what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you did not veil yourselves lest your ears and your eyes and your skins should bear witness against you, but you thought that Allah did not know most of what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so did you cover yourselves, that your hearing, your eyes and your skins should not bear witness against you; but you thought that God would never know much of the things that you were working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye did not hide yourselves lest your ears and your eyes and your skins should testify against you, but ye deemed that Allah knew not much of what ye did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you could not hide yourselves from your ears and your eyes and your skins to prevent them from testifying against you, and you thought that God would never know much of what you did,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye have not been taking cover against yourselves lest your ears and your eyes and your skins should bear witness against you, but ye imagined that Allah not much knew of that which ye were working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not use to conceal yourselves [while perpetrating sinful acts] lest your hearing, your eyes, or your skins should bear witness against you, but you thought that Allah did not know most of what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye did not seek to hide yourselves, lest your hearing, your sight, and your skins should bear witness against you! But ye did think that Allah knew not many of the things that ye used to do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you have not been hiding against yourselves, lest your ears, and your eyes, and your skins testify against you, but you thought that Allah knew not much of what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not that you covered yourselves so that your hearing, eyes and skin could not bear witness against you but you thought that Allah did not know much of that which you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were unable to hide yourselves from your hearing, and your sight, and your skins, to prevent them from testifying against you, and you imagined that God was unaware of much of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:22] And you did not use to conceal yourselves, when you used to commit lewd acts, lest your hearing or your eyes or your skins should bear witness against you, because you were never certain about [the truth of] resurrection; but you thought, when you used to conceal yourselves, that God did not know most of what you did.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ (22) قلّ من تصدى من المفسرين لبيان اتصال هذه الآيات الثلاث بما قبلها ، ومن تصدّى منهم لذلك لم يأت بما فيه مقْنع ، وأوْلى كلام في ذلك كلام ابن عطية ولكنه وَجيز وغير محرر وهو وبعض المفسرين ذكروا سبباً لنزولها فزادوا بذلك إشكالاً وما أبانوا انفصالاً . ولنبدأ بما يقتضيه نظم الكلام ، ثم نأتي على ما روي في سبب نزولها بما لا يفضي إلى الانفصام .فيجوز أن تكون جملة { وَمَا كُنتُم تَسْتتِرُونَ } بتمامها معطوفة على جملة { وَهُوَ خَلَقَكُم أوَّلَ مَرَّةٍ } \\[ فصلت : 21 \\] الخ فتكون مشمولة للاعتراض متصلة بالتي قبلها على كلا التأويلين السابقين في التي قبلها . ويجوز أن تكون مستقلة عنها : إمّا معطوفة على جملة { وَيَوْمَ نَحْشُر أعْدَاءَ الله إلى النَّارِ } \\[ فصلت : 19 \\] الآيات ، وإما معترضة بين تلك الجملة وجملةِ { فَإِنْ يَصبِرُوا فالنَّارُ مَثْوَىً لَهُم } \\[ فصلت : 24 \\] ، وتكون الواو اعتراضية ، ومناسبة الاعتراض ما جرى من ذكر شهادة سمعهم وأبصارهم وجلودهم عليهم . فيكون الخطاب لجميع المشركين الأحياء في الدنيا ، أو للمشركين في يوم القيامة .وعلى هذه الوجوه فالمعنى : ما كنتم في الدنيا تخفون شرككم وتستترون منه بل كنتم تجهرون به وتفخرون باتباعه فماذا لومكم على جوارحكم وأجسادكم أن شهدت عليكم بذلك فإنه كان أمراً مشهوراً فالاستتار مستعمل في الإخبار مجازاً لأن حقيقة الاستتار إخفاء الذوات والذي شهدت به جوارحهم هو اعتقاد الشرك والأقوال الداعية إليه . وحرف { ما } نفي بقرينة قوله بعده : { ولكن ظَنَنتُمْ أَنَّ الله لاَ يَعْلَمُ } الخ ، ولا بد من تقدير حرف جر يتعدى به فعل { تَستتِرُونَ } إلى { أَن يَشْهَدَ } وهو محذوف على الطريقة المشهورة في حذف حرف الجر مع ( أَنْ ) . وتقديره : بحسب ما يدل عليه الكلام وهو هنا يقدر حرفَ مِن ، أي ما كنتم تستترون من شهادة سمعكم وأبصاركم وجلودكم ، أي ما كنتم تستترون من تلك الشهود ، وما كنتم تتقون شهادتها ، إذ لا تحسبون أن ما أنتم عليه ضائر إذ أنتم لا تؤمنون بوقوع يوم الحساب .فأما ما ورد في سبب نزول الآية فهو حديث «الصحيحين» و«جامع الترمذي» بأسانيد يزيد بعضها على بعض إلى عبد الله بن مسعود قال : «كنت مستتراً بأستار الكعبة فجاء ثلاثة نفر قرشيان وثقفي أو ثقفيان وقرشي قليلٌ فِقْهُ قلوبهم كثيرٌ شحْم بطونهم فتكلموا بكلام لم أفهمه ، فقال أحدهم : أترون الله يسمع ما نقول ، فقال الآخر : يَسمع إن جهرنا ولا يسمع إن أخفينا ، وقال الآخر : إن كان يسمع إذا جهرنا فهو يسمع إذا أخفينا ، قال عبد الله : فذكرتُ ذلك للنبيء صلى الله عليه وسلم فأنزل الله تعالى : { وَمَا كُنْتم تَستَتِرُونَ أَن يَشْهَد عَلَيكُم سَمْعُكُم وَلا أبصاركم } إلى قوله : { فَأَصْبَحْتُم مِنَ الخاسرين } . وهذا بظاهره يقتضي أن المخاطب به نفر معين في قضية خاصة مع الصلاحية لشمول من عسى أن يكون صدر منهم مثل هذا العمل للتساوي في التفكير .ويجعل موقعها بين الآيات التي قبلها وبعدها غريباً ، فيجوز أن يكون نزولها صادف الوقت الموالي لنزول التي قبلها ، ويجوز أن تكون نزلت في وقت آخر وأن رسول الله صلى الله عليه وسلم أمر بوضعها في موضعها هذا لمناسبة ما في الآية التي قبلها من شهادة سمعهم وأبصارهم .ومع هذا فهي آية مكية إذ لم يختلف المفسرون في أن السورة كلها مكية . وقال ابن عطية : يشبه أن يكون هذا بعد فتح مكة فالآية مدنية ، ويشبه أن رسول الله صلى الله عليه وسلم قرأ الآية متمثلاً بها عند إخبار عبد الله إياه ا ه . وفي كلامه الأول مخالفة لما جزم به هو وغيرهُ من المفسرين أن السورة كلها مكية ، وكيف يصح كلامه ذلك وقد ذكر غيرهُ أن النفر الثلاثة هم : عبد ياليل الثقفي وصفوان وربيعة ابنا أمية بننِ خلف ، فأما عبد ياليل فأسلم وله صحبة عند ابن إسحاق وجماعة ، وكذلك صفوان بن أمية ، وأما ربيعة بن أمية فلا يعرف له إسلام فلا يلاقي ذلك أن تكون الآية نزلت بعد فتح مكة . وأحسن ما في كلام ابن عطية طرفه الثاني وهو أن النبي صلى الله عليه وسلم قرأ الآية متمثلاً بها فإن ذلك يُؤَوِّل قول ابن مسعود فأنزل الله تعالى الآية ، ويبين وجه قراءة النبي صلى الله عليه وسلم إياها عندما أخبره ابن مسعود بأنه قرأها تحقيقاً لمثال من صور معنى الآية ، وهو أن مثل هذا النفر ممن يَشهد عليهم سمعهم وأبصارهم وجلودهم ، وذلك قاض بأن هؤلاء النفر كانوا مشركين يومئذٍ ، والآية تحق على من مات منهم كافراً مثل ربيعة بن أمية بن خلف .وعلى بعض احتمالات هذا التفسير يكون فعل { تَستَتِرُونَ } مستعملاً في حقيقته أي تستترون بأعمالكم عن سمعكم وأبصاركم وجلودكم ، وذلك توبيخ كناية عن أنهم ما كانوا يرون ما هم عليه قبيحاً حتى يستتروا منه وعلى بعض الاحتمالات فيما ذكر يكون فعل { تستترون } مستعملاً في حقيقته ومجازه ، ولا يُعوزك توزيع أصناف هذه الاحتمالات بعضها مع بعض في كل تقدير تَفرِضُه . وحاصل معنى الآية على جميع الاحتمالات : أن الله عليم بأعمالكم ونياتكم لا يخفى عليه شيء منها إن جهرتم أو سترتم وليس الله بحاجة إلى شهادة جوارحكم عليكم وما أوقعكم في هذا الضر إلا سوء ظنكم بجلال الله .\n\n",
      "translations": [
        {
          "translation": "(Ye did not hide yourselves) you will not be able to prevent your limbs (lest your ears and your eyes and your skins should testify against you) in the Hereafter; it is also said that this means: you were not able in the life of this world to hide from some limbs what other limbs earned, such that they do not testify against you; and it is also said that this means: you were not sure that your ears, eyes and skins would testify against you in the Hereafter, (but ye deemed) but you said (that Allah knew not much of what ye did) and said in private.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تذكيراً لما هم عليه عن ارتكاب المعاصي توبيخاً لهم وتقريعاً: { وَمَا كُنتُمْ تَسْتَتِرُونَ } أي: لم تكونوا مسرين مستترين عند ارتكاب الفواحش والمحظورات مخافة { أَن يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلاَ أَبْصَارُكُمْ وَلاَ جُلُودُكُمْ } عند الله في يوم الجزاء\n لإنكاركم به\n بل إنما تشترون وتكتمون معاصيكم وقبائحكم مخافة فضاحتكم واشتهاركم بين الناس بالمذام { وَلَـٰكِن ظَنَنتُمْ } بالله ظن السوء\n وهو { أَنَّ ٱللَّهَ } المطلع لسرائر الأمور وخفاياتها { لاَ يَعْلَمُ كَثِيراً مِّمَّا تَعْمَلُونَ } [فصلت: 22] في خلواتكم\n لذلك اجترأتم على اقتراف المعاصي والآثام المحرمات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكذا قوله: { وما كنتم تستترون أن يشهد عليكم سمعُكم ولا أبصارُكم ولا جلودُكم } \n يحتمل أن يكون من كلام الجلود\n أو: من كلام الله ـ عزّ وجل ـ وهو الظاهر\n أي: وما كنتم تستترون في الدنيا عند مباشرتكم الفواحش مخافة أن تشهد عليكم جوارحكم\n ولو خفتم من ذلك ما استترتم بها\n { ولكن ظننتم أنَّ الله لا يعلمُ كثيراً مما تعملون } من القبائح الخفية\n فلا يظهرها في الآخرة\n\nوعن ابن مسعود رضي الله عنه: كنت مستتراً بأستار الكعبة\n فدخل ثلاثة نفر وثقفيان وقرشي\n أو: قرشيان وثَقَفي\n فقال أحدهم: أترون أن الله يسمع ما نقول؟ قال الآخر: سمع جهرنا ولا يسمع ما أخفينا\n فذكر ذلك للنبي صلى الله عليه وسلم\n فأنزل الله تعالى: { وما كنتم تستترون\n\n\n } الآية\n فالحُكم المحكي حينئذ يكون خاصّاً بمَن كان على ذلك الاعتقاد من الكفرة\n انظر أبا السعود\n { وذلكم ظنُّكم الذي ظننتم بربكم أرداكم } أهلككم\n فـ \" ذلك \": مبتدأ\n و \" ظنكم \": خبر\n و \" الذي ظننتم بربكم \": صفة\n و \" أرداكم \": خبر ثان\n أو: ظنكم: بدل من \" ذلك \" و \" أرداكم \": خبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:90",
      "similarity": 0.6842813715174082
    },
    {
      "verse": "17:45",
      "similarity": 0.6724472232056258
    },
    {
      "verse": "41:20",
      "similarity": 0.4190714424462718
    },
    {
      "verse": "41:21",
      "similarity": 0.3103939192595102
    },
    {
      "verse": "24:4",
      "similarity": 0.23489960887669295
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}