{
  "chapter": "فصلت",
  "text": "ذلك جزاء اعداء الله النار لهم فيها دار الخلد جزاءۢ بما كانوا۟ بـايتنا يجحدون",
  "translations": [
    {
      "translation": "That is the repayment of the enemies of Allah - the Fire. They will have it for their Eternal Home as repayment for their renunciation of Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the requital for God's enemies: Hell, where they will have their lasting home, as punishment for denying Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the recompense of the enemies of Allah -- the Fire, their abiding home. That will be the re-compense for their denying Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of the enemies of God for their rejection of Our revelations will be fire as their eternal dwelling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the recompense of Allah’s enemies – the fire; they have to stay in it forever; the penalty for denying Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the recompense of the enemies of Allah: the Fire. Therein will be for them the eternal home, a recompense for that they used to deny Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the reward of the enemies of Allah-- the fire; for them therein shall be the house of long abiding; a reward for their denying Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the recompense of God's enemies -- the Fire, wherein they shall have the Abode of Eternity as a recompense, for that they denied Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the reward of Allah's enemies: the Fire. Therein is their immortal home, payment forasmuch as they denied Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that is the reward of the enemies of God, the Fire will be their everlasting home, a reward for their rejection of Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the meed of the enemies of Allah: the Fire. Therein is their home of Abidence: a meed forasmuch as Our revelations they were wont to gainsay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the requital of the enemies of Allah—the Fire! In it, they will have an everlasting abode, as a requital for their impugning Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the requital of the enemies of Allah,- the Fire: therein will be for them the Eternal Home: a (fit) requital, for that they were wont to reject Our Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the recompense of the enemies of Allah: The Fire, therein will be for them the eternal home, a (deserving) recompense for that they used to deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Fire that is the recompense of the enemies of Allah. There it is that they will be lodged for eternity, a recompense for their disbelief of Our verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the recompense of God’s enemies—the Fire—where they will have their permanent home, in recompense for having disregarded Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the recompense of the enemies of Allah - the Fire. For them therein is the home of eternity as recompense for what they, of Our verses, were rejecting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:28] That, severe chastisement and worst requital, is the requital of God’s enemies (jazā’u a‘dā’i, the second hamza may be pronounced fully or replaced with a wāw) — the Fire! (al-nāru, an explicative supplement to jazā’u, ‘the requital’, alluded to by [the demonstrative] dhālika, ‘that’). Therein will be their everlasting abode, that is, as a place of [permanent] residence, from which there will be no removal, as a requital (jazā’an is in the accusative as a verbal noun from the implicit verbal action) for their denial of Our signs, [for their denial of] the Qur’ān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) which they will have in the life of the world (is the reward of Allah's enemies) and the reward of Allah's enemies in the Hereafter is: (the Fire. Therein) in the Fire (is their immortal home) they will abide therein for eternity; (payment forasmuch as they denied Our revelations) Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } العذاب الأسوأ الأشد { جَزَآءُ } أعمال { أَعْدَآءِ ٱللَّهِ } الذين عاندوا معك يا أكمل الرسل\n واستهزءوا بك وبكتابك\n بطرين بما معهم من الجاه والثروة\n وهي { ٱلنَّارُ } المسعرة المعدَّة لدخولهم ونزولهم\n إذ { لَهُمْ فِيهَا } أي: في النار { دَارُ الخُلْدِ } أي: إقامة على وجه الخلود\n وإنما صارت كذلك ليكون { جَزَآءً بِمَا كَانُوا بِآياتِنَا يَجْحَدُونَ } [فصلت: 28] وينكرون بها\n ويكذبكون بمن أنزل إليه ويستهزئون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك جزاءُ أعداء الله النارُ } أي: ذلك الأسوأ من الجزاء هو جزاء أعداء الله\n وهو النار\n فالنار: خبر عن مضمر\n أو: عطف بيان للجزاء\n والنار: مبتدأ\n و { لهم فيها دارُ الخلد }: خبر\n أي: النار في نفسها دار الخلد\n كما تقول: لك في هذه الدار السرور\n وأنت تعني الدار بعينها\n ويسمى في علم البلاغة: التجريد\n وهو أن ينتزع من ذي صفة أمراً آخر مثله\n مبالغةً\n لكمالٍ فيه\n تقول: لقيت من زيد أسداً\n وقيل: هي على معناها\n والمراد: أن لهم في النار المشتملة على الدركات دار مخصوصة\n هم فيها خالدون\n { جزاء بما كانوا بآياتنا يجحدون } أي: جُوزوا بذلك جزاء بسبب ما كانوا يجحدون بآياتنا ويلغون فيها\n الإشارة: الآية تنسحب على مَن يرفع صوته بمحضر مجلس الوعظ والذكر\n أو العلم النافع\n أو صفوف الصلاة\n فهذه المجالس يجب صونها من اللغو والصخب\n ويجب الاستماع لها\n والإنصات\n والتوقير\n والتعظيم\n لأنها موروثة عن الرسول صلى الله عليه وسلم قال تعالى:\n[الحجرات: 3]\n ومَن فعل شيئاً من ذلك فالوعيد بقوله تعالى: { فلنذيقن الذين كفروا\n\n\n } الآية ـ منه بالمرصاد\n والله تعالى أعلم\n ثم ذكر مقالتهم بعد دخول النار\n فقال: { وَقَال الَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيْنِ أَضَلاَّنَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:47",
      "similarity": 0.6806748830911176
    },
    {
      "verse": "40:63",
      "similarity": 0.646343060496152
    },
    {
      "verse": "29:49",
      "similarity": 0.6300554206779385
    },
    {
      "verse": "6:33",
      "similarity": 0.6209655725112952
    },
    {
      "verse": "16:71",
      "similarity": 0.5257313816081505
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/41:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/41:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}