{
  "chapter": "فصلت",
  "text": "واما ينزغنك من الشيطن نزغ فاستعذ بالله انه هو السميع العليم",
  "translations": [
    {
      "translation": "If an evil urge from Shaytan eggs you on, seek refuge in Allah. He is the All-Hearing, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the Devil incite you to evil, seek refuge in God. He is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are prompted by a provocation from Satan, seek refuge with Allah. He, and He alone, is All-Hearing, All- Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), seek God's protection if satan's temptation grieves you, for God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O listener! If a distracting thought from the devil reaches you, seek the refuge of Allah; indeed He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an evil whisper from Shaytan tries to turn you away, then seek refuge in Allah. Verily, He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an interference of the Shaitan should cause you mischief, seek refuge in Allah; surely He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a provocation from Satan should provoke thee, seek refuge in God; He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a whisper from the devil reach thee (O Muhammad) then seek refuge in Allah. Lo! He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a prompting from Satan should stir you, seek refuge with God: He is the All Hearing and the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there inciteth thee an incitement from the Satan then seek refuge in Allah. Verily He! He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should an incitement from Satan prompt you [to ill feeling], seek the protection of Allah. Indeed, He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if (at any time) an incitement to discord is made to thee by the Evil One, seek refuge in Allah. He is the One Who hears and knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an evil whisper from Shaitan (Satan) tries to turn you away (O Muhammad SAW) (from doing good, etc.), then seek refuge in Allah. Verily, He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a provocation from satan should provoke you, seek refuge in Allah. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a temptation from the Devil provokes you, seek refuge in God; He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:36] And if (wa-immā: here the nūn of the conditional particle in has been assimilated with the mā, which is extra) some temptation from Satan should provoke you, in other words, if some diversion should turn you away from that [better] trait and other good acts, then seek refuge in God (this is the response to the conditional [‘and if’]; the response to the command clause is omitted, being ‘and He will ward it off from you’). Truly He is the Hearer, of what is said, the Knower, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if a whisper from the devil reach thee (0 Muhammad)) and if a whisper from the devil reaches you, 554 you should reciprocate Abu Jahl's harshness with harshness like it (then seek refuge in Allah) from the accursed devil. (Lo! He is the Hearer) of what Abu Jahl says, (the Knower) of his punishment; it is also said that this means: He is the Hearer of your seeking refuge in Him, the Knower of the whispering of the devil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أرشد سبحانه عموم عباده إلى طريق النجاة، وعلمهم الخصلة المحمودة المخلِّصة لهم عن أدوية الضلالات والجهالات، وأوصاهم بأا أوصاهم من الصبر والثبات على تحمل المشاق والمكروهات، خاطب حبيبه صلى الله عليه وسلم بما خاطب حثاً له ولمن تبعه واسترشد منه على دفع ما يمنعهم عن الاتصاف بتلك الخصال الحميدة، ويعوقهم منها بالإضلال والإغواء، فقال: { إِمَّا يَنزَغَنَّكَ } ويعرضن عليك يا أكمل الرسل { مِنَ ٱلشَّيْطَٰنِ } المضل المغوي { نَزْغٌ } نخس يحرك غضبك وحمية بشريتك، ويوقعن فيك بوسوسته فتنة تبعثك على الإساءة والانتقام بترك تلك الخصلة المحمودة { فَٱسْتَعِذْ } بالله أي: بادر إلى الإعادة والالتجاء { بِٱللَّهِ } المقلب للقلوب، وفوض أمورك كلها إليه سبحانه على وجه التبتل والإخلاص؛ لتأمين من غوائله وتلبيساته { إِنَّهُ } سبحانه { هُوَ ٱلسَّمِيعُ } لمناجاتك { ٱلْعَلِيمُ } [فصلت: 36] بحاجاتك وخلوص نياتك فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:200",
      "similarity": 0.9145242430190984
    },
    {
      "verse": "17:53",
      "similarity": 0.76226792577653
    },
    {
      "verse": "12:100",
      "similarity": 0.4582015001417992
    },
    {
      "verse": "23:93",
      "similarity": 0.2815674988177742
    },
    {
      "verse": "16:98",
      "similarity": 0.26354459146792636
    }
  ]
}