{
  "chapter": "فصلت",
  "text": "ومن احسن قولا ممن دعا الى الله وعمل صلحا وقال اننى من المسلمين",
  "translations": [
    {
      "translation": "Who could say anything better than someone who summons to Allah and acts rightly and says, 'I am one of the Muslims'?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose word is better than his who calls to God and does the right, and says: \"I am of the obedient?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is fairer in speech than he who calls to Allah and acts righteously and says: “I am a Muslim”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who speaks better than one who invites human beings to God, acts righteously and says, \"I am a Muslim\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whose speech is better than one who calls towards his Lord and does righteous deeds, and says, “I am a Muslim.”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in speech than he who invites to Allah, and does righteous deeds, and says: \"I am one of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who speaks better than he who calls to Allah while he himself does good, and says: I am surely of those who submit?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who speaks fairer than he who calls unto God and does righteousness and says, 'Surely I am of them that surrender'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in speech than him who prayeth unto his Lord and doeth right, and saith: Lo! I am of those who are muslims (surrender unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who speaks better than one who calls to God and does good works and says, \"I am surely of those who submit\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in speech than he who summoneth Unto Allah, and worketh righteously, and saith: verily I am one of the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has a better call than him who summons to Allah and acts righteously and says, ‘Indeed I am one of the Muslims’?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is better in speech than one who calls (men) to Allah, works righteousness, and says, \"I am of those who bow in Islam\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in speech than he who [says: \"My Lord is Allah (believes in His Oneness),\" and then stands straight (acts upon His Order), and] invites (men) to Allah's (Islamic Monotheism), and does righteous deeds, and says: \"I am one of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, who is better in saying than he who invites to Allah, does what is right, and says: 'Surely, I am of those who surrender'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in speech than someone who calls to God, and acts with integrity, and says, “I am of those who submit”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:33] And who speaks better [words] — in other words, no one speaks better [words] — than him who summons [others] to God, by affirming His Oneness, and acts righteously and says, ‘Indeed I am one of those who submit [to God]’?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who is better in speech) who is wiser in speech; and it is also said that this means: who is better in inviting others (than him who prayeth unto his Lord) than he who invites people to believe in Allah's divine Oneness; i.e. Muhammad (pbuh) (and doeth right) and perform the obligations; it is also said that this verse was revealed about the muezzins. He says: who is better in inviting people than he who calls to Allah through the call to prayer and then does right, i.e. performs two units of prayer after the call to prayer, except for the call to prayer of Maghrib, (and saith: Lo! I am of those who surrender (unto Him)) I adhere to the religion of Islam and says: I believe truly. The reference here is to Muhammad (pbuh) and his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومَن أحْسن قولاً } أي: حالاً إذ كثيراً ما يستعمل القول بمعنى الفعل والحال ومنه\n قالوا: { ربنا الله } أي: جعلوا دينهم التوحيد\n ومنه الحديث:\n \" هلك المكثرون إلا من قال هكذا وهكذا\n\n\n \" \nأي: اعطى\n { ممن دَعَا إلى الله وعَمِل صالحاً وقال إنني من المُسْلمين } أي: ممن أسلم وجهه إلى الله في التوحيد وعمل بالاستقامة والتمكين\n ودعا الخلق إلى الحق للتكميل\n فقدّم الدعوة إلى الحق والتكميل لكونه أشرف المراتب ولاستلزامه الكمال العلمي والعملي\n وإلا لما صحت الدعوة وإن صحت ما كانت إلى الله\n أي: إلى ذاته الموصوفة بجميع الصفات\n فإن العالم الغير العامل إن دعا كانت دعوته إلى العليم\n والعامل الغير العالم إلى الغفور الرحيم\n والعالم العامل والعارف الكامل صحّت دعوته إلى الله\n { ولا تستوي الحَسَنة ولا السيئة } لكون الأولى من مقام القلب تجرّ صاحبها إلى الجنّة ومصاحبة الملائكة\n والثانية من مقام النفس تجرّ صاحبها إلى النار ومقارنة الشياطين { ادْفع بالتي هي أحْسَن } إذا أمكنك دفع السيئة من عدوّك بالحسنة التي هي أحسن\n فلا تدفعها بالحسنة التي دونها\n فكيف بالسيئة؟!\n فإن السيئة لا تندفع بالسيئة بل تزيد وتعلو ارتفاع النار بالحطب\n فإن قابلتها بمثلها كنت منحطاً إلى مقام النفس\n متّبعاً للشيطان\n سالكاً طريق النار\n ملقياً لصاحبك في الأوزار وجاعلاً له ولنفسك من جملة الأشرار\n متسبباً لازدياد الشرّ معرضاً عن الخير\n وإن دفعتها بالحسنة سكنت شرارته وأزلت عداوته وتثبت في مقام القلب على الخير\n وهديت إلى الجنة وطردت الشيطان\n وأرضيت الرحمن وانخرطت في سلك الملكوت ومحوت ذنب صاحبك بالندامة\n وإن دفعتها بالتي هي أحسن ناسبت الحضرة الرحيمية بالرحموت وصرت باتصافك بصفاته تعالى من أهل الجبروت وأفضت من ذاتك فيض الرحمة على صاحبك فصار { كأنه وليّ حميم } ولأمر ما قال النبي عليه السلام:\n \" لو جاز أن يظهر البارىء لظهر بصورة الحلم \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَحْسَنُ قَوْلاً } وأصلح عملاً\n وأكمل إيماناً واعتقاداً\n وأتم معرفة وتوحيداً { مِّمَّن دَعَآ } أي: أشد وهدى { إِلَى ٱللَّهِ } الواحد الأحد الصمد\n المستقل بالألوهية والربوبية\n المتفرد بالوجود والديمومية { وَعَمِلَ } عملاً { صَالِحاً } مطابقاً موافقاً لصفاء مشرب التوحيد\n مجتنباً عن رعونات العجب والرياء\n وتخمينات التقليد والهوى { وَ } بالجملة: { قَالَ } بعدما نال أولاً ما نال\n وفني فيما فني: { إِنَّنِي مِنَ } زمرة { ٱلْمُسْلِمِينَ } [فصلت: 33] المسلِّمين المنقادين\n المفوضين إلى الله جميع ما لاح عليهم من بروق تجلياته الجمالية والجلالية\n وما لي أيضاً إلا التسليم والرضا بعموم ما جرى عليه القضاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ومَن أحسنُ قولاً ممن دعا إِلى اللهِ } أي: إلى الإقرار بربوبيته\n والاستقامة على عبوديته\n وهو الرسول صلى الله عليه وسلم وخلفاؤه من أمته\n الدعاة إلى الله في كل عصر\n أي: لا أحد أحسن قولاً ممن دعا إلى معرفة الله\n { وعَمِل صالحاً } فيما بينه وبين ربه\n بأن عمل أولاً بما دعا إليه\n { وقال إِنني من المسلمين } تفاخراً بالإسلام\n وابتهاجاً بأنه منهم\n واتخاذ الإسلام ديناً\n من قولهم: هذا قول فلان\n أي: مذهبه لأنه يتكلم بذلك\n أو: يقوله تواضعاً\n أي: من جملة عامة المسلمين\n { ولا تستوي الحسنةُ ولا السيئةُ } \n هذا بيان محاسن الأعمال الجارية بين العباد\n إثر بيان محاسن الأعمال الجارية بين العبد وبين الرب ـ عزّ وجل ـ ترغيباً للدعاة إلى الله في الصبر على إذاية الخلق\n لأن كل مَن يأمر بالحق يُؤذَى\n فأُمروا بمقابلة الإساءة بالإحسان\n أي: لا تستوي الخصلة الحسنة والخصلة السيئة\n و لا: مزيدة\n لتأكيد النفي\n { ادفع بالتي هي أحسنُ } أي: ادفع السيئة التي اعترضتك من بعض أعدائك بالتي هي أحسن منها\n وهي: أن تُحسن إليه في مقابلة إساءته\n فالحسنة والسيئة متفاوتتان في أنفسهما\n فخذ بالحسنة التي هي أحسن من أختها\n وادفع بها السيئة\n كما لو أساء إليك رجل\n فالحسنة: أن تعفو عنه\n والتي هي أحسن: أن تُحسن إليه مكان إساءته\n مثل أن يذمك فتمدحه\n ويحرمك فتعطيه\n ويقطعك فتصله\n وعن ابن عباس رضي الله عنه: التي هي أحسن: الصبر عند الغضب\n والحلم عند الجهل\n والعفو عند الإساءة\n هـ\n { فإِذا الذي بينك وبينه عداوةٌ كأنه وليٌّ حميم } أي: فإنك إن فعلت ذلك انقلب عدوك المشاقق مثل وليك الحميم الشفيق\n مصافاة لك\n وهذا صعب على النفوس\n ولذلك قال: { وما يُلقاها إلا الذين صبروا } أي: ما يلقى هذه الخصلة التي في مقابلة الإساءة بالإحسان إلا أهل الصبر\n { وما يُلقاها إِلا ذو حظ عظيم } من الله تعالى وسبق عنايته بكمال النفس وتهذيبها\n وعن ابن عباس رضي الله عنه: الحظ العظيم: الثواب\n وعن الحسن: والله ما عظم حظ دون الجنة\n وقيل: نزلت في أبي سفيان بن حرب\n كان عدوّاً مؤذياً للنبي صلى الله عليه وسلم فصار وليّاً مصافياً له\n وبقيت عامة\n { وإِما يَنزغنَّك من الشياطن نزغٌ } \n النزغ: شِبه النخس\n والشيطان ينزغ الإنسان\n كأنه ينخسه\n يبعثه على ما لا ينبغي\n وجعل النزغ نازغاً مجاز\n كجدّ جدّه\n والمعنى: وإن طرقك الشيطان على ترك ما وُصِّيْتَ به من الدفع بالتي هي أحسن\n { فاستعِذْ بالله } من شرِّه\n وامضِ على حلمك ولا تُطعه\n { إِنه هو السميعُ } لاستعاذتك\n { العليمُ } بنيتك وتعلقك به\n أو: بنزغ الشيطان ووسوسته\n وهو تعليم لأمته صلى الله عليه وسلم إذ كان شيطانه أسلم على يده\n\nالإشارة: قال القشيري: قيل: الداعي إلى الله هو الذي يدعو الناس إلى الاكتفاء بالله\n وتَرْكِ طلب العِوَض من الله\n بل يَكِلُ أمره إلى الله\n ويرضى من الله بقسمة الله\n ثم قال: { وعَمِلَ صالحاً } كما يدعو الخلق إلى الله يأتي بما يدعوهم إليه\n ويقال: هم الذين عرفوا طريقَ الله\n ثم دعوا ـ بعدما عرفوا الطريقَ إلى الله ـ الخلقَ إلى الله\n { وقال إِنني من المسلمين } لحكمه\n الراضين بقضائه وتدبيره\n هـ\n وقال الشاذلي رضي الله عنه: عليك برفض الناس جملة\n إلا مَن يدلك على الله\n بإشارةٍ صادقة\n وأعمال ثابتة\n لا ينقضها كتاب ولا سُنَّة\n هـ\n وشروط الداعي إلى الله على طريق المشيخة أربعة: علم صحيح\n وذوق صريح\n وهمّة عالية\n وحالة مرضية\n كما قال زروق رضي الله عنه\n وقال الشريشي في رائيته:\nأما العلم الظاهر فإنما يشترط منه ما يحتاج إليه في خاصة نفسه\n ويحتاج إليه المريد في حال سفره إلى ربه\n وهو القَدْر الذي لا بُد منه\n من أحكام الطهارة والصلاة ونحو ذلك\n ولا يشترط التبحُّر في علم الشريعة\n قال الشيخ أبو يزيد رضي الله عنه: صحبت أبا علي المسندي\n فكنت أُلقنه ما يُقيم به فرضه\n وكان يعلمني التوحيد والحقائق صِرفاً\n هـ\n ومن المعلوم أن الشيخ ابن عباد لم يُفتح عليه إلا على يد رجل عامي\n وقد تحققت تربية كثير من الأولياء\n كانوا أميين في علم الظاهر\n وأما علم الباطن فالمطلوب فيه التبحُّر التام إذ المقصود بالذات في الشيخ المصطلح عليه عند القوم هو هذا العلم لأن المريد إنما يطلب الشيخَ ليسلكه ويعلمه علم الطريقة والحقيقة فيكون عنده علم تام بالله وصفاته وأسمائه\n ذوقاً وكشفاً\n وعلم بآفات الطريق\n ومكائد النفس\n والشيطان\n وطرق المواجيد\n وتحقيق المقامات\n كما هو مقرر في فنه\n وهذا الداعي لا تخلو الأرض منه على الكمال\n خلافاً لمَن حكم بانقطاعه\n والله تعالى أعلم\n وفي الإحياء: المقتدى به هو الذي استقام في نفسه\n واستنار قلبه فانتشر نوره إلى غيره\n لا مَن يُظهر خلاف ما هو عليه ليُقتدى به\n فإنه مُلَبِّس\n لم ينصح لنفسه\n فكيف بغيره؟\n هـ\n قال الورتجبي: ومَن أحسن قولاً ممن دعا إلى الله\n أي: ممن عرف الله بعد أن رآه وأحبّه واشتاق إليه\n ودعا الخلق إليه\n من حيث هو فيه وصَدقه في حاله\n يدعو الخلق إلى الله بلسان الأفعال\n وصدق المقال\n وحلاوة الأحوال\n ويذكر لهم شمائل القِدَم وحق الربوبية\n ويُعرفهم صفات الحق وجلال ذاته\n ويُحبب اللهَ في قلوبهم\n وهذا عمله الصالح\n ثم يقول بعد كماله وتمكنه: إنني واحد من المسلمين\n مِن تواضعه ولطفِ حاله خلقاً وظرافةً\n وإن كان إسلامه من قُصارى ـ أي: غاية ـ أحوال المستقيمين\n\nقال سهل: أي ممن دلّ على الله\n وعلى عبادة الله وسُنَّة رسوله\n واجتناب المناهي\n وإدامة الاستقامة مع الله\n ثم قال: { ولا تستوي الحسنة ولا السيئة } بيَّن اللهُ هنا أن الخُلق الحسن ليس كالخُلق السيء\n وأمر بتبديل الأخلاق المذمومة بالأخلاق المحمودة\n وأحسن الأخلاق: الحلم إذ يكون به العدو صديقاً\n والبعيد قريباً\n حين دفع غضبه بحلمه\n وظلمَه بعفوه\n وسوءَ جانبه بكرمه\n وفي مظنة الخطاب: أن مَن كان متخلقاً بخلقه\n متصفاً بصفاته\n مستقيماً في خدمته\n صادقاً في محبته\n عارفاً بذاته وصفاته\n ليس كالمدعي الذي ليس في دعواه معنى\n ثم قال: { وما يُلقاها إِلا الذين صبروا } \n بيَّن الله سبحانه ألا يبلغ أحد درجة الخلق الحسن\n وحسنات الأعمال وسُنِيَّات الأفعال\n إلا مَن تصبّر في بلاء الله\n وامتحانه\n بالوسائط وغير الوسائط\n ولا يتحمّل هذه البليات إلا ذو حظ عظيم من مشاهدته\n وذو نصيب من قربه ووصاله\n صاحب معرفة كاملة\n ومحبة شاملة: وكمال هذا الصبر الاتصاف بصبر الله\n ثم الصبر في مشاهدة الأزل\n فبالصبر الاتصافي ومشاهدة الأبدي\n والحظ الجمالي\n يوازي طوارق صدمات الألوهية\n وغلبات القهّارية\n ثم قال: عن الجنيد: ما يوفق لهذا المقام إلا ذو حظ عظيم من عناية الحق فيه\n هـ\n ثم بيَّن دلائل توحيده\n فقال: { وَمِنْ آيَاتِهِ ٱلَّيلُ وَٱلنَّهَارُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:122",
      "similarity": 0.42837628169300884
    },
    {
      "verse": "25:71",
      "similarity": 0.4125482918062189
    },
    {
      "verse": "56:26",
      "similarity": 0.40441401862668563
    },
    {
      "verse": "61:7",
      "similarity": 0.40005038562657674
    },
    {
      "verse": "29:7",
      "similarity": 0.39790263622589916
    }
  ]
}