{
  "chapter": "فصلت",
  "text": "نحن اولياؤكم فى الحيوة الدنيا وفى الءاخرة ولكم فيها ما تشتهى انفسكم ولكم فيها ما تدعون",
  "translations": [
    {
      "translation": "We are your protectors in the life of this world and the Next World. You will have there all that your selves could wish for. You will have there everything you demand.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your friends in this life and in the Hereafter where you will get whatever your hearts desire, and have whatsoever you ask for,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your companions in this world and in the Hereafter. There you shall have all that you desire and all what you will ask for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your guardians in this world and in the life to come, where you will have whatever you call for,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We are your friends in the life of this world and in the Hereafter; in it for you is all that you may wish for, and for you is all what you ask.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have been your friends in the life of this world and are (so) in the Hereafter. Therein you shall have (all) that your souls desire, and therein you shall have (all) for which you ask.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your guardians in this world's life and in the hereafter, and you shall have therein what your souls desire and you shall have therein what you ask for:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your friends in the present life and in the world to come; therein you shall have all that your souls desire, all that you call for,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your protecting friends in the life of the world and in the Hereafter. There ye will have (all) that your souls desire, and there ye will have (all) for which ye pray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your companions in this life and in the Hereafter. Therein you shall have all that your souls desire, and therein you shall have all that you ask for\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your friends in the life of the world and in the Hereafter; there in yours will be whatsoever your souls desire, and therein yours shall be whatsoever ye call for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your friends in the life of this world and in the Hereafter, and you will have in it whatever your souls desire, and you will have in it whatever you ask for,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your protectors in this life and in the Hereafter: therein shall ye have all that your souls shall desire; therein shall ye have all that ye ask for!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have been your friends in the life of this world and are (so) in the Hereafter. Therein you shall have (all) that your inner-selves desire, and therein you shall have (all) for which you ask for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your guides in this world and in the Everlasting Life. There, you shall have all that your souls desire, and all that you ask for\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are your allies in this life and in the Hereafter, wherein you will have whatever your souls desire, and you will have therein whatever you call for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We [angels] were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:31] We are your friends in the life of this world, that is, we will look after you in it, and in the Hereafter, in other words, we will be alongside you thereat until you enter Paradise; and therein you will have whatever your souls desire, and therein you will have whatever you request,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We are your protecting friends in the life of the world) We protected you in the life of the world (and in the Hereafter) and We will protect you in the Hereafter; these are the guardian angels. (There) in Paradise (ye will have (all) that your souls desire, and there) in Paradise (ye will have (all) for which ye pray) all that which you request.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما وفقناكم على انكشاف سرائر توحيدنا، والتخلق بأخلاقنا { نَحْنُ أَوْلِيَآؤُكُمْ } نولي عموم أموركم؛ بحيث نكون سمعكم وبصركم وجميع قواكم وجوارحكم { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } حسب اسمنا الظاهر { وَفِي ٱلآخِرَةِ } أيضاً كذلك حسب اسمنا الباطن { وَلَكُمْ } منَّا وراء ذلك تفضلاً وإحساناً { فِيهَا } أي: في الآخرة { مَا تَشْتَهِيۤ أَنفُسُكُمْ } من اللذات الروحانية حسب استعداداتكم الفطرية وقابلياتكم الجبلية الفائضة عليكم بمقتضى جودنا الواسع { وَلَكُمْ } أيضاً { فِيهَا مَا تَدَّعُونَ } [فصلت: 31] تطلبون وتتمنون وقت دعائكم في نشأة الدنيا حسب عقولكم وهوياتكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال في قوله تعالى: { نحن أولياؤكم }: الولاية من الله تعالى بمعنى المحبة، وتكون بمعنى النصرة، وهذا الخطاب بقوله: { نحن أولياؤكم } ، يحتمل أن يكون من قِبَلِ الملائكة، الذين يتنزلون عليهم، ويحتمل أن يكون ابتداء خطابٍ من الله تعالى، والنصرة تصدر من المحبة، ولو لم تكن المحبة الأزلية لم تكن تحصل النصرة في الحال\n هـ\n وكونه من الملائكة أظهر، كما تقدّم\n والله تعالى أعلم\n ولمَّت ذكر حال أهل الاستقامة، ذكر حال مَن دعا إليها، أو: نقول: لمَّا ذكر حال أهل الكمال فقط، ذكر أهل الكمال والتكميل، فقال: { وَمَنْ أَحْسَنُ قَوْلاً مِّمَّن دَعَآ إِلَى ٱللَّهِ }\n\n",
      "translations": []
    }
  ]
}