{
  "chapter": "فصلت",
  "text": "ومن ءايته اليل والنهار والشمس والقمر لا تسجدوا۟ للشمس ولا للقمر واسجدوا۟ لله الذى خلقهن ان كنتم اياه تعبدون",
  "translations": [
    {
      "translation": "Among His Signs are the night and day and the sun and moon. Do not prostrate to the sun nor to the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The night and day and the sun and moon are (only) some of His signs. So do not bow before the sun and the moon, but bow in homage to God who created them, if you truly worship Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs are the night and the day, and the sun and the moon. Do not prostrate yourselves before the sun, nor before the moon, but prostrate yourselves before Allah Who created them, if it is Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some evidence of His existence) are the night, day, sun, and moon. Do not prostrate before the sun and the moon, but prostrate before God Who has created them if you want to worship Him alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the night, and the day, and the sun, and the moon are among His signs; do not prostrate for the sun or the moon, but prostrate for Allah Who has created them, if you are His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among His signs are the night and the day, and the sun and the moon. Do not prostrate yourselves to the sun nor to the moon, but prostrate yourselves to Allah Who created them, if you worship Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs are the night and the day and the sun and the moon; do not prostrate to the sun nor to the moon; and prostrate to Allah Who created them, if Him it is that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the night and the day, the sun and the moon. Bow not yourselves to the sun and moon, but bow yourselves to God who created them, if Him you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His portents are the night and the day and the sun and the moon. Do not prostrate to the sun or the moon; but prostrate to Allah Who created them, if it is in truth Him Whom ye worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs are the night and the day, and the sun and the moon. Do not prostrate yourselves before the sun and the moon, but prostrate yourselves before God who created them all, if it is truly Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the night and the day and the sun and the moon. So prostrate not yourselves Unto the sun nor the moon. but prostrate yourselves Unto Allah who hath created them, if it is He alone whom ye are worshipping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs are night and day, and the sun and the moon. Do not prostrate to the sun, nor to the moon, but prostrate to Allah who created them, if it is Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His Signs are the Night and the Day, and the Sun and the Moon. Do not prostrate to the sun and the moon, but prostrate to Allah, Who created them, if it is Him ye wish to serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among His Signs are the night and the day, and the sun and the moon. Prostrate not to the sun nor to the moon, but prostrate to Allah Who created them, if you (really) worship Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs are the night and the day, and the sun and the moon. But do not prostrate yourselves before the sun or the moon; rather prostrate before Allah, who created them both, if it is He whom you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the night and the day, and the sun and the moon. Do not bow down to the sun, nor to the moon, but bow down to God, Who created them both, if it is Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the night and day and the sun and moon. Do not prostrate to the sun or to the moon, but prostate to Allah, who created them, if it should be Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:37] And among His signs are the night and the day, and the sun and the moon. Do not prostrate to the sun and   moon, but prostrate to God Who created them, namely, these fours signs, if it is Him Whom you worship.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His portents) and of the signs of His divine Oneness and power (are the night and the day and the sun and the moon) all these are signs from Allah. (Adore not the sun) worship not the sun (nor the moon; but adore Allah) but worship Allah (Who created them) i.e. He created the sun, the moon, the day and the night, (if it is in truth Him whom ye worship) if you wish to worship Allah, then do not worship the sun and the moon, for you should worship the One Who created them; it is also said that this means: if, by worshipping the sun and the moon, you intend to worship Allah, then do not worship them, for the worship of Allah lies in not worshipping them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n يعبدونهم كعبادته: { وَمِنْ آيَاتِهِ } أي: من جملة الدلائل الداتلة على قدرة الصانع الحكيم { ٱلَّيلُ } المظلم { وَٱلنَّهَارُ } المبصر المضيء { وَ } كذا { ٱلشَّمْسُ } المشرق في النهار { وَٱلْقَمَرُ } والمنير في الليل\n قل لهم يا أكمل الرسل على وجه التنبيه والتذكير: { لاَ تَسْجُدُواْ } أي: لا تعبدوا ولا تتذللوا أيها الأظلال الهالكة في شمس الذات { لِلشَّمْسِ } المستهلكة أمثالكم في شروق ذاته سبحانه { وَلاَ لِلْقَمَرِ } المستنير منها بالطريق الأولى\n\nبل { وَٱسْجُدُواْ } وتذللوا بوضع جباهكم وجوارحكم على تراب المذلة { لِلَّهِ } الواحد الأحد القدير العزيز { ٱلَّذِي خَلَقَهُنَّ } أي: أظهرهن\n وأوجده من كتم العدم على سبيل الإبداع بلا سبق مادة وزمان\n بل بمجرد امتداد أظلال أسمائه وبسط عكوس صفاته على مرآة العدم\n فعليكم الإطاعة والإنقياد إليه\n والتوجه نحوه على وجه الإخلاص والاختصاص فاعبدوه { إِن كُنتُمْ إِيَّاهُ } سبحانه { تَعْبُدُونَ } [فصلت: 37] أيها العابدون المخلصون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:33",
      "similarity": 0.6194665028629684
    },
    {
      "verse": "75:9",
      "similarity": 0.5823016018954804
    },
    {
      "verse": "55:5",
      "similarity": 0.5770331583079937
    },
    {
      "verse": "16:12",
      "similarity": 0.4845749216909231
    },
    {
      "verse": "29:61",
      "similarity": 0.42766144056413313
    }
  ]
}