{
  "chapter": "فصلت",
  "text": "وما يلقىها الا الذين صبروا۟ وما يلقىها الا ذو حظ عظيم",
  "translations": [
    {
      "translation": "None will obtain it but those who are truly steadfast. None will obtain it but those who have great good fortune.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they attain it who forbear, and only a man of great good fortune can achieve it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none attains to this except those who are steadfast; none attains to this except those endowed with mighty good fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who exercise patience and who have been granted a great share of God's favor can find such an opportunity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And none receive this great treasure except those who are patient; and none receives this except one who is extremely fortunate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none is granted it except those who are patient -- and none is granted it except the owner of the great portion in this world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And none are made to receive it but those who are patient, and none are made to receive it but those who have a mighty good fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet none shall receive it, except the steadfast; none shall receive it, except a man of mighty fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none is granted it save those who are steadfast, and none is granted it save the owner of great happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but no one will be granted such goodness except those who exercise patience and self-restraint -- no one is granted it save those who are truly fortunate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And none attaineth that except those who are patient; and none attaineth that except the owner of mighty good fortune,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none is granted it except those who are patient, and none is granted it except the greatly endowed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no one will be granted such goodness except those who exercise patience and self-restraint,- none but persons of the greatest good fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none is granted it (the above quality) except those who are patient, and none is granted it except the owner of the great portion (of the happiness in the Hereafter i.e. Paradise and in this world of a high moral character).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none will receive it except those who are patient and, none shall receive it, except he who has a great share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none will attain it except those who persevere, and none will attain it except the very fortunate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:35] But none is granted it, in other words, [none] is given that better trait, except those who are steadfast; and none is granted it except one [deserving] of a great reward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But none is granted it) none is granted the Garden in the Hereafter (save those who are steadfast) in the face of misfortunes and the harm of the enemies in the life of the world, (and none is granted it) and none is given success to repel the evil deed with a good deed (save the owner of great happiness) save the one who has abundant reward in the Garden, like Muhammad (pbuh) and his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولا يلقي هذه الخصلة الشريفة والفضيلة العظيمة { إلاَّ الذين صَبروا } مع الله\n فلم يتغيروا بزلّة الأعداء لرؤيتهم منه تعالى وتوكلهم عليه واتّصافهم بحلمه أو طاعتهم لأمره { وما يلقاها إلاَّ ذو حظ عظيم } من الله بالتخلّق بأخلاقه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والقهر باللطف { إِلاَّ ٱلَّذِينَ صَبَرُواْ } أي: الأبطال المتحملون الذين صبروا على كظم الغيظ وتحمل المتاعب والمشاق المتعاقبة على نفوسهم\n لتحققهم بمقام الرضا والتسلي بما جرى عليهم من القضاء\n وتمكنهم في مقر التوحيد المسقط للإضافات\n المستلزمة لأنواع الاختلافات والانحرافات { وَ } بالجملة: { مَا يُلَقَّاهَآ إِلاَّ ذُو حَظٍّ عَظِيمٍ } [فصلت: 35] ونصيب كامل من الكشف والشهود بأسرار الوجود بمقتضى الجود الإلهي\n\n\n{ وَ } بعدما أرشد سبحانه عموم عباده إلى طريق النجاة\n وعلمهم الخصلة المحمودة المخلِّصة لهم عن أدوية الضلالات والجهالات\n وأوصاهم بأا أوصاهم من الصبر والثبات على تحمل المشاق والمكروهات\n خاطب حبيبه صلى الله عليه وسلم بما خاطب حثاً له ولمن تبعه واسترشد منه على دفع ما يمنعهم عن الاتصاف بتلك الخصال الحميدة\n ويعوقهم منها بالإضلال والإغواء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:176",
      "similarity": 0.6749651302183977
    },
    {
      "verse": "28:79",
      "similarity": 0.43636550487397946
    },
    {
      "verse": "4:176",
      "similarity": 0.3425051953748052
    },
    {
      "verse": "5:14",
      "similarity": 0.2395260214445631
    },
    {
      "verse": "4:11",
      "similarity": 0.23287106596884444
    }
  ]
}