{
  "chapter": "فصلت",
  "text": "ومن ءايته انك ترى الارض خشعة فاذا انزلنا عليها الماء اهتزت وربت ان الذى احياها لمحى الموتى انه على كل شىء قدير",
  "translations": [
    {
      "translation": "Among His Signs is that you see the earth laid bare and then when We send down water on it it quivers and swells. He who gives it life is He who gives life to the dead. Certainly He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is among His signs that the earth you see all barren and desolate begins to stir and sprout when We send down rain upon it. Surely He who gives it life will also give life to the dead. Indeed He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is that you see the earth withered, then We send down water upon it, and lo! it quivers and swells. Surely He Who gives life to the dead earth will also give life to the dead. Surely He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Further evidence is that (at times) you find the earth to be barren. When it is watered it moves and swells (to let the plants grow). The One who brings it back to life will also bring the dead back to life. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that you see the earth lying neglected, so when We sent down water on it, it freshened up and grew forth; indeed He Who gave it life, will revive the dead; indeed He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs; that you see the earth barren, but when We send down water to it, it is stirred to life and growth. Verily, He Who gives it life, surely is able to give life to the dead. Indeed He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is this, that you see the earth still, but when We send down on it the water, it stirs and swells: most surely He Who gives it life is the Giver of life to the dead; surely He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that thou seest the earth humble; then, when We send down water upon it, it quivers, and swells. Surely He who quickens it is He who quickens the dead; surely He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His portents (is this): that thou seest the earth lowly, but when We send down water thereon it thrilleth and groweth. Lo! He Who quickeneth it is verily the Quickener of the Dead. Lo! He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is this: you see the earth dry and barren, but when We send down on it water, it stirs and swells: most surely He who gives it life is the giver of life to the dead; surely He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that thou beholdest the earth lowly, and when We send down thereon water, it stirreth to life and groweth. Verily He who quickeneth is the Quickener of the dead. Verily He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs, is that you see the earth desolate; but when We send down water upon it, it stirs and swells. Indeed, He who revives it will also revive the dead. Indeed, He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs in this: thou seest the earth barren and desolate; but when We send down rain to it, it is stirred to life and yields increase. Truly, He Who gives life to the (dead) earth can surely give life to (men) who are dead. For He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs (in this), that you see the earth barren, but when We send down water (rain) to it, it is stirred to life and growth (of vegetations). Verily, He Who gives it life, surely, (He) is Able to give life to the dead (on the Day of Resurrection). Indeed! He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is that you see the earth humble; then when He sends down rain upon it, it quivers and swells. He who revives is He who revives the dead, surely, He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that you see the land still. But when We send down water upon it, it stirs and grows. Surely, He Who revived it will revive the dead. He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is that you see the earth stilled, but when We send down upon it rain, it quivers and grows. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:39] And among His signs is that you see the earth desolate, dried out, without any vegetation, but when We send down water upon it, it stirs, it moves, and swells, [swells] and rises. Truly He Who revives it is indeed the Reviver of the dead. Surely He has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His portents) and of the signs of His divine Oneness and power ((is this): that thou seest the earth lowly) still and dead, (but when We send down water) rain (thereon it thrilleth) because of the rain (and groweth) vegetation. (Lo! He who quickeneth it) after it was dead (is verily the Quickener of the dead) for the resurrection. (Lo! He is Able to do all things) whether it is giving death or life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَآ أَنزَلْنَا عَلَيْهَا ٱلْمَآءَ ٱهْتَزَّتْ وَرَبَتْ } معناه تَحركَتْ وطَالَتْ\n\n\n\n\nوقوله تعالى:\n\n[الحج: 5] معناه حَسنٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when We send down water onto it, it stirs and grows.\n\n\nAnd His saying, \"Exalted is He who took charge of him; {indeed,} [He is] Able to bring him back [to life]!\"\n\n\nThe Hajj: 5 Its Meaning is Good",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع ذلك هو سبحانه غني عن عبادتهم فكيف عن عبادة هؤلاء الحمقى\n المنغمسين في بحر الجهالات التائهين في بادية الضلالات وأودية الشهوات والغفلات { وَ } أيضاً { مِنْ } جملة { آيَاتِهِ } الدالة على وحدة ذاته وكمال أسمائه وصفاته: { أَنَّكَ } يا أكمل الرسل\n وإنما وجه سبحانه أمثال هذه الخطابات إلى النبي صلى الله عليه وسلم\n مع أنه يصلح عموم الناس\n لكمال لياقته بمطالعة آيات الله\n وخبرته منها { تَرَى ٱلأَرْضَ } أي: الطبيعة العدمية الجامدة اليابسة { خَاشِعَةً } ذليلة ساقطة عن درجات الاعتبار { فَإِذَآ أَنزَلْنَا } من مقا م وجودنا ورششنا { عَلَيْهَا ٱلْمَآءَ } المحيي المترشح من بحر الوجود\n الذي هو الحي الأزلي والقيوم السرمدي { ٱهْتَزَّتْ } أي: تحركت وارتعدت اهتزازاً شوقياً { وَرَبَتْ } أي: زادت ونمت\n مع أنها لا شعور فيها\n بل لا وجود لها أصلاً\n\n\nوبالجملة: { إِنَّ } القادر المقتدر الحكيم { ٱلَّذِيۤ أَحْيَاهَا } مع أنها لم تكن في ذاتها شيئاً مذكوراً { لَمُحْىِ ٱلْمَوْتَىٰ } مرة أخرى بعدما كانت أحياء بالطريق الأولى\n وبالجملة: { إِنَّهُ } سبحانه { عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة علمه وإرادته { قَدِيرٌ } [فصلت: 39] بلا فتور وقصور\n\n\nثم قال سبحانه تهديداً على منكر الآخرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِذا أنزلنا عليها الماء } المطر { اهتزّتْ } أي: تحركت { ورَبَتْ } انتفخت لأن النبات إذا دنا أن يظهر ارتفعت به وانتفخت\n ثم تصدّعت عن النبات\n وقيل: تزخرفت وارتفعت بارتفاع نباتها\n { إِنَّ الذي أحياها لمحيي الموتَى } بالبعث\n { إِنه على كل شيءٍ قديرٌ } \n ومن جملة الأشياء: البعث والحساب\n الإشارة: الليل والنهار والشمس والقمر خَلَقَهن من أجلك\n فعارٌ عليك أن تخضع لِمَا خُلق لك\n وتترك المنعِّم بها عليك\n قال القشيري: الحق ـ سبحانه ـ يأمرك بصيانة وجهك عن الشمس والقمر مع علوهما\n وأنت لأجلِ حظِّ خِسِيسٍ تنقل قَدَمك إلى كلّ أحدٍ\n وتذل وجهك لكل أحد\n هـ\n وأما الخضوع لمَن أمر الله بالخضوع له من الدعاة إلى الله فهو من الخضوع لله\n كأمر الملائكة بالسجود لآدم\n وكأمره بالخضوع له من الدعاة إلى الله فهو من الخضوع لله\n كأمر الملائكة بالسجود لآدم\n وكأمره بالخضوع للأنبياء والأولياء\n فكان مآل مَن سجد وخضع التقريب\n ومآل مَن استكبر وأنف الطرد والبُعد\n والله تعالى غني عن الكل\n ولذلك قال: { فإن استكبروا\n\n\n } الآية\n قوله تعالى: { ومن آياته أنك ترى الأرضَ خاشعةً\n\n\n } الآية\n وكذلك أرض النفوس تراها يابسة بالغفلة والقسوة والجهل\n فإذا أنزل عليها ماء الحياة\n وهي خمرة المحبة\n هاجت وارتفعت\n وحييت بذكر الله ومعرفته\n إن الذي أحيا الأرض الحسية قادر على إحياء النفوس الميتة بالغفلة\n وانظر القشيري\n ثم ذكر حال مَن أعرض عن الآيات\n فقال: { إِنَّ ٱلَّذِينَ يُلْحِدُونَ فِيۤ آيَاتِنَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:31",
      "similarity": 0.5137809227665942
    },
    {
      "verse": "27:10",
      "similarity": 0.4836419136603332
    },
    {
      "verse": "23:2",
      "similarity": 0.2716235760682347
    },
    {
      "verse": "79:9",
      "similarity": 0.271351782852257
    },
    {
      "verse": "69:10",
      "similarity": 0.270184614869779
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}