{
  "chapter": "فصلت",
  "text": "ولا تستوى الحسنة ولا السيئة ادفع بالتى هى احسن فاذا الذى بينك وبينه عدوة كانه ولى حميم",
  "translations": [
    {
      "translation": "A good action and a bad action are not the same. Repel the bad with something better and, if there is enmity between you and someone else, he will be like a bosom friend.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Good and evil are not alike. Repel evil with what is good. Then you will find your erstwhile enemy like a close. affectionate friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), good and evil are not equal. Repel (evil) with that which is good, and you will see that he, between whom and you there was enmity, shall become as if he were a bosom friend (of yours).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Virtue and evil are not equal. If you replace evil habits by virtuous ones, you will certainly find that your enemies will become your intimate friends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the good deed and the evil deed will never be equal; O listener! Repel the evil deed with a good one, thereupon the one between whom and you was enmity, will become like a close friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The good deed and the evil deed cannot be equal. Repel (the evil) with one which is better, then verily he, between whom and you there was enmity, (will become) as though he was a close friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not alike are the good and the evil. Repel (evil) with what is best, when lo! he between whom and you was enmity would be as if he were a warm friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are the good deed and the evil deed. Repel with that which is fairer and behold, he between whom and thee there is enmity shall be as if he were a loyal friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The good deed and the evil deed are not alike. Repel the evil deed with one which is better, then lo! he, between whom and thee there was enmity (will become) as though he was a bosom friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Good and evil deeds are not equal. Repel evil with what is better; then you will see that one who was once your enemy has become your dearest friend,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can good and evil be equal. Repel thou evil with that which is goodly then behold he between whom and thee there was enmity, will be as though he was a warm friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Good and evil [conduct] are not equal. Repel [evil] with what is best. [If you do so,] he between whom and you was enmity, will then be as though he were a sympathetic friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can goodness and Evil be equal. Repel (Evil) with what is better: Then will he between whom and thee was hatred become as it were thy friend and intimate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The good deed and the evil deed cannot be equal. Repel (the evil) with one which is better (i.e. Allah ordered the faithful believers to be patient at the time of anger, and to excuse those who treat them badly), then verily! he, between whom and you there was enmity, (will become) as though he was a close friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Good and evil deeds are not equal. Repel with that which is most just, and see, the one whom there is enmity between you will be as if he were a loyal guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Good and evil are not equal. Repel evil with good, and the person who was your enemy becomes like an intimate friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:34] And they are not equal, the good deed and the evil deed, [even] with respect to their subdivisions, because any number of such [good deeds] are [always] above any number of the latter. Repel, the evil deed, with that, in other words, with that trait, which is better, such as [repelling] anger with endurance, ignorance with forbearance, and [the intention to inflict] harm with pardon, then, behold, he between whom and you there was enmity will be as though he were a dear friend, in other words, then your enemy will become like a close friend in terms of [his] affection [for you], if you act in such a way (alladhī, ‘he … whom’, is the subject; ka-annahu, ‘as though’, is the predicate; idhā is an adverbial particle for [expressing] the comparative import).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The good deed) the call to Allah's divine Oneness by the Prophet (pbuh) (and the evil deed are not alike) and the call to idolatry by Abu Jahl are not alike; it is also said that this means: the testimony that there is no deity save Allah and ascribing partners to Allah are not alike. (Repel) Muhammad, lest he tries, (the evil deed) idolatry from Abu Jahl (with one which is better) with \"there is no deity save Allah\"; it is also said that this means: repel evil from Abu Jahl with that which is better, i.e. with good words, greetings and kindness, if you do that (then lo! he, between whom and thee there was enmity) regarding religion, i.e. Abu Jahl ((will become) as though he was a bosom friend) as though he is of the same religion or a close relative.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل التعليم والإرشاد لعموم العباد: { وَلاَ تَسْتَوِي ٱلْحَسَنَةُ } أي: لا تستوي جنس الحسنات بل هي متفاوتة في الحسن والبهاء { وَلاَ ٱلسَّيِّئَةُ } أي: وكذا لا تستوي جنس السيئات أيضاً بعضها أسوأ من بعض { ٱدْفَعْ } أيها السالك القاصد سلوط طريق التوحيد من جادة العدالة المنكشفة لأكمل افرسل وأفضل الأنبياء الهادين\n المرشدين إلى بحر الوحدة الذاتية من جدوال الأسماء والصفات المترشحة منها حسب تموجاتها وتطوراتها المتفرعة على شئونها الذاتية { بِٱلَّتِي } أي: بالخصلة الحسنة التي { هِيَ أَحْسَنُ } الحسنات أسوأ السيئات\n ودوام عليها\n وتخلق بها حتت تستوي وتستقيم أنت على جادة العدالة الإلهية\n\n\nوبعد استقامتك وتحققك في هذه المرتبة { فَإِذَا ٱلَّذِي } كان { بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ } مستمرة ناشئة من القوى البهيمية من كلا الطرفين\n صار صديقك وخليلك إلى حيث { كَأَنَّهُ وَلِيٌّ } حفيظ لك\n رقيب على حضانتك عن جميع ما يؤذيك ويرديك\n فكيف يؤذيك\n إذ هو { حَمِيمٌ } [فصلت: 34] مشفق كريم رءوف\n رحيم لك\n لا يخاصمك أصلاً\n\n\n{ وَ } لكن { مَا يُلَقَّاهَا } أي: الخصلة الحميدة الحسنة التي هي دفع الإساء بالإحسان\n والمكروه بالمعروف",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:8",
      "similarity": 0.6237742483596461
    },
    {
      "verse": "70:2",
      "similarity": 0.6027700134921764
    },
    {
      "verse": "23:96",
      "similarity": 0.565220641390167
    },
    {
      "verse": "22:38",
      "similarity": 0.480575481937125
    },
    {
      "verse": "3:167",
      "similarity": 0.38686074614206056
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/41:34.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/41:34.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/41:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}