{
  "chapter": "فصلت",
  "text": "ان الذين قالوا۟ ربنا الله ثم استقموا۟ تتنزل عليهم الملئكة الا تخافوا۟ ولا تحزنوا۟ وابشروا۟ بالجنة التى كنتم توعدون",
  "translations": [
    {
      "translation": "The angels descend on those who say, 'Our Lord is Allah,' and then go straight: 'Do not fear and do not grieve but rejoice in the Garden you have been promised.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the angels will come down to those who say, 'Our Lord is God' and then remain steadfast, saying: \"You should have neither fear nor regret, but rejoice in the happy news of Paradise that has been promised you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say “Allah is our Lord” and then remain steadfast, upon them descend angels (and say): “Do not fear nor grieve, and receive good tidings of Paradise which you were promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who have said, \"God is our Lord, \" and who have remained steadfast to their belief, the angels will descend saying, \"Do not be afraid or grieved. Receive the glad news of the Paradise which was promised to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who said, “Allah is our Lord” and remained firm upon it – upon them descend the angels, (saying), “Do not fear nor grieve, and be happy for the Paradise which you are promised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who say: \"Our Lord is Allah,\" and then they stand firm, on them the angels will descend (saying): \"Fear not, nor grieve! But receive the glad tidings of Paradise which you have been promised!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who say: Our Lord is Allah, then continue in the right way, the angels descend upon them, saying: Fear not, nor be grieved, and receive good news of the garden which you were promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have said, 'Our Lord is God.' then have gone straight, upon them the angels descend, saying, 'Fear not, neither sorrow; rejoice in Paradise that you were promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who say: Our Lord is Allah, and afterward are upright, the angels descend upon them, saying: Fear not nor grieve, but hear good tidings of the paradise which ye are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who affirm, \"Our Lord is God,\" and then remain steadfast, the angels will descend on them, saying, \"Have no fear and do not grieve. Rejoice in the [good news of the] Garden that you have been promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who say: our Lord is Allah, and have thereafter stood fast by it,- upon them there shall come down the angels: fear not, nor grieve, and rejoice in the tidings of the Garden which ye have been promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who say, ‘Our Lord is Allah!’ and then remain steadfast, the angels descend upon them, [saying,] ‘Do not fear, nor be grieved! Receive the good news of the paradise, which you have been promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the case of those who say, \"Our Lord is Allah\", and, further, stand straight and steadfast, the angels descend on them (from time to time): \"Fear ye not!\" (they suggest), \"Nor grieve! but receive the Glad Tidings of the Garden (of Bliss), the which ye were promised!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who say: \"Our Lord is Allah (Alone),\" and then they Istaqamu, on them the angels will descend (at the time of their death) (saying): \"Fear not, nor grieve! But receive the glad tidings of Paradise which you have been promised!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels will descend on those who said: 'Allah is Our Lord' and have then gone straight, (saying:) 'Be neither fearful, nor sad; rejoice in the Paradise you have been promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who say: “Our Lord is God,” and then go straight, the angels will descend upon them: “Do not fear, and do not grieve, but rejoice in the news of the Garden which you were promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have said, \"Our Lord is Allah \" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:30] Truly those who say, ‘Our Lord is God!’ and then remain upright, [adhering] to the affirmation of [God’s] Oneness and to whatever else has been enjoined on them, the angels descend upon them, at the point of death, [saying to them], ‘Do not fear, death and what will come after it, nor grieve, for any family or children that you have left behind, for we will look after them after you, and rejoice in the good tidings of the paradise which you were promised.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who say: Our Lord is Allah) they professed Allah's divine Oneness, (and afterward are upright) in faith and do not revert to disbelief; it is also said this means: those who are upright in performing the five daily prayers and do not play tricks, (the angels descend upon them) when their spirits are taken away, (saying: Fear not) the chastisement which is ahead (nor grieve) about what you have left behind, (but bear good tidings of the Paradise which ye are promised) in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَامُواْ } معناه ثَبَتُوا على الإِيمانِ بالله، ولم يُفارقوا رسولَ الله صلى الله عليهِ وعلى آلهِ وسلّمَ ولا أهلَ بيتهِ عليهمُ السَّلامُ\n\n",
      "translations": [
        {
          "translation": "\nThe meaning of the verse, \"Those who say, 'Our Lord is Allah,' and then remain on the straight path\" is that they have affirmed their faith in Allah and have not abandoned the Messenger of Allah or the members of his household - may peace be upon them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إِن الذين قالوا ربنا الله } أي: وحدوه بنفي غيره وعرفوه بالإيقان حق معرفته { ثم استقاموا } إليه بالسلوك في طريقه والثابت على صراطه مخلصين لأعمالهم عاملين لوجهه\n غير ملتفتين بها إلى غيره { تتنزّل عليهم الملائكة } للمناسبة الحقيقية بينهم في التوحيد الحقيقي والإيمان اليقيني والعمل الثابت على منهاج الحق والاستقامة في الطريقة إليه\n غير ناكثين في عزيمة ولا منحرفين عن وجهه ولا زائغين في عمل كما ناسبت نفوس المحجوبين من أهل الرذائل الشياطين بالجواهر المظلمة والأعمال الخبيثة لتنزّلت عليهم { ألاَّ تخافوا } من العقاب لتنوّر ذواتكم بالأنوار وتجرّدها عن غواسق الهيئات { ولا تَحْزنوا } بفوات كمالاتكم التي اقتضاها استعدادكم { وأبشروا } بجنّة الصفات { التي كنتم تُوعدون } حال الإيمان بالغيب أو قالوا: { ربنا الله } بالفناء فيه ثم استقاموا به بالبقاء بعد الفناء عند التمكين { تتنزَّل عليهم الملائكة } للتعظيم عند الرجوع إلى التفصيل\n إذ في حال الفناء لا وجود للملائكة ولا لغيرهم\n { ألاَّ تخافوا } من التلوين { ولا تحزنوا } على الاستغراق في التوحيد\n فإن أهل الوحدة إذا ردّوا إلى التفصيل ورؤية الكثرة غلب عليهم الحزن والوجد في أول الوهلة لفوات الشهود الذاتي في عين الجمع والاحتجاب بالتفصيل حتى يتمكنوا في التحقق بالحق حال البقاء وانشراح الصدر بنور الحق فلا تحجبهم الكثرة عن الوحدة ولا الوحدة عن الكثرة\n شاهدين في تفاصيل الصفات عين الذات بالذات\n كما قال تعالى لنبيه عليه السلام في هذه الحال:\n[الشرح\n الآيات:1 - 3] وأبشروا بجنّة الذات الشاملة لجميع مراتب الجنان التي كنتم توعدونها في مقام تجليّات الصفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته في كتابه: { إِنَّ } الموحدين { ٱلَّذِينَ قَالُواْ } في السراء والضراء والسر والعلن: { رَبُّنَا ٱللَّهُ } الواحد الأحد الفرد الصمد الذي\n[الإخلاص: 3-4] { ثُمَّ ٱسْتَقَامُواْ } وتثبتوا على ما أقروا\n واعترفوا بأعمالهم وأحوالهم وبيناتهم المترتبة عليها عموم أفعالهم { تَتَنَزَّلُ } على إعانتهم وشرح صدورهم وتهذيب أخلاقهم { عَلَيْهِمُ ٱلْمَلاَئِكَةُ } المترصدون لأم الله\n القائمون لحكمه\n قائلين لهم مبشرين إياهم: { أَلاَّ تَخَافُواْ } على فرطاتكم التي صدرت عنكم قبل انكشافكم بسرائر التوحيد واليقين { وَلاَ تَحْزَنُواْ } بما جرى عليكم من مقتضيات بشرياتكم { وَأَبْشِرُواْ بِٱلْجَنَّةِ ٱلَّتِي كُنتُمْ تُوعَدُونَ } [فصلت: 30] بألسنة أنبيائكم ورسلكم الهادين المهدين\n\n\nوبعدما وفقناكم على انكشاف سرائر توحيدنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن الذين قالوا ربُّنا الله } أي: نطقوا بالتوحيد واعتقدوا\n { ثم استقاموا } أي: ثبتوا على الإقرار ومقتضياته من حسن الأعمال\n وعن الصدّيق رضي الله عنه: استقاموا فعلاً\n كما استقاموا قولاً\n وعنه: أنه تلاها ثم قال: ما تقولون فيها؟ قالوا: لم يذنبوا\n قال: حملتم الأمر على أشده\n قالوا: فما تقول؟ قال: لم يرجعوا إلى عبادة الأوثان\n وعن عمر رضي الله عنه: لم يَرُوغوا رَوَغان الثعالب\n أي: لم ينافقوا\n وعن عثمان رضي الله عنه: أحكموا العمل\n وعن عليّ رضي الله عنه: أدُّوا الفرائض\n وعن الفُضيل: زهدوا في الفانية\n ورغبوا في الباقية\n قلت: ويجمعها الإقرار بالربوبية\n والقيام بوصائف العبودية\n { تَتَنزَّلُ عليهم الملائكةُ } عند الموت\n وفي القبر\n وعند البعث\n أو: في الدنيا بإلهام الخير وشرح الصدر\n وإعانتهم على الأمور الدينية\n كما أن الكفرة تقويهم ما قُيض لهم في قرناء السوء\n والأظهر: العموم\n { ألاَّ تخافوا ولا تحزنوا } فـ \" أن \" مخففة\n أو: تفسيرية\n أي: لا تخافوا ما تٌقدمون عليه\n ولا تحزنوا على ما خلفتم\n فالخوف: غم يلحق لتوقع مكروه\n والحزن: غم يلحق لفوات نافع\n أو حضور ضارٍّ\n والمعنى: أن الله تعالى كتب لكم الأمنَ من كل غم\n فلن تذوقوه أبداً\n { وأبْشِروا بالجنة التي كنتم تُوعدون } في الدنيا على ألسنة الرسل\n وقال محمد بن علي الترمذي: تتنزل عليهم ملائكة الرحمة\n عند مفارقة الأرواح الأبدان\n ألا تخافوا سلب الإيمان\n ولا تحزنوا على ما كان من العصيان\n وأبشروا بدخول الجنان\n التي تُوعدون في سالف الأزمان\n { نحن أولياؤُكم في الحياة الدنيا وفي الآخرة } \n كما أن الشياطين قرناء العصاة وإخوانهم\n فكذلك الملائكة أولياء المتقين وأحباؤهم في الدارين\n { ولكم فيها ما تشتهي أنفسُكم } من فنون الطيبات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:13",
      "similarity": 0.7202629702049776
    },
    {
      "verse": "6:48",
      "similarity": 0.6130373032898626
    },
    {
      "verse": "43:68",
      "similarity": 0.5787880803042331
    },
    {
      "verse": "10:62",
      "similarity": 0.486617709586499
    },
    {
      "verse": "2:277",
      "similarity": 0.45142392921489316
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/41:30.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/41:30.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/41:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}