{
  "chapter": "فصلت",
  "text": "ولو جعلنه قرءانا اعجميا لقالوا۟ لولا فصلت ءايته ءا۬عجمى وعربى قل هو للذين ءامنوا۟ هدى وشفاء والذين لا يؤمنون فى ءاذانهم وقر وهو عليهم عمى او۟لئك ينادون من مكانۭ بعيد",
  "translations": [
    {
      "translation": "If We had made it a Qur'an in a foreign tongue they would have said, 'Why have its Signs not been made plain? What! A foreign language for an Arab?' Say: 'It is guidance and healing for people who have iman. Those who do not have iman have heaviness in their ears and for them it is blindness. Such people are being called from a very distant place.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had made it a discourse in an obscure tongue, they would have said: \"Why were its revelations not expounded distinctly? A foreign tongue and an Arab (audience)?\" Say: \"For those who believe it is a guidance and a healing; but for those who do not believe it is a deafness in the ears, and a blindness. They are those one calls to from far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We revealed this as a non-Arabic Qur'an they would have said: “Why were its verses not clearly expounded? How strange, a non-Arabic scripture and an Arab audience!” Tell them: “It is a guidance and a healing to the believers. But to those who do not believe, it serves as a plug in their ears and a covering over their eyes. It is as if they are being called from a place far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We sent down this Quran in a non-Arabic language, they would have said, \"Why have its verses not been well expounded?\" Could a non-Arabic Book be revealed to an Arabic speaking person? (Muhammad), say, \"It is a guide and a cure for the believers. As for those who do not believe, they are deaf and blind. It is as though they had been called from a distant place\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had made it as a Qur’an in a foreign language they would have certainly said, “Why were its verses not explained in detail?” What! The Book in a foreign language, and the Prophet an Arab?! Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is a guidance and a cure for the believers”; and there is deafness in the ears of those who do not believe, and it is blindness upon them; as if they are being called from a place far away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had sent this as a Qur'an in a foreign language, they would have said: \"Why are not its verses explained in detail What! Not in Arabic nor an Arab\" Say: \"It is for those who believe, a guide and a cure. And as for those who disbelieve, there is heaviness in their ears, and it is blindness for them. They are called from a place far away.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had made it a Quran in a foreign tongue, they would certainly have said: Why have not its communications been made clear? What! a foreign (tongue) and an Arabian! Say: It is to those who believe a guidance and a healing; and (as for) those who do not believe, there is a heaviness in their ears and it is obscure to them; these shall be called to from a far-off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had made it a barbarous Koran, they would have said, 'Why are its signs not distinguished? What, barbarous and Arabic?' Say: 'To the believers it is a guidance, and a healing; but those who believe not, in their ears is a heaviness, and to them it is a blindness; those -- they are called from a far place.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had appointed it a Lecture in a foreign tongue they would assuredly have said: If only its verses were expounded (so that we might understand)? What! A foreign tongue and an Arab? - Say unto them (O Muhammad): For those who believe it is a guidance and a healing; and as for those who disbelieve, there is a deafness in their ears, and it is blindness for them. Such are called to from afar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We sent this as a Quran [in a language] other than Arabic, they would have said, \"Why are its verses not clearly explained? What! An Arab Prophet, and a scripture in a foreign tongue?\" Say, \"It is a guide and a healing to those who believe; but for those who do not believe, there is a deafness in their ears, and a covering over their eyes: they are [as it were] being called from a very distant place.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We made it a recital in a foreign tongue, they would have surely said: wherefore are the verses thereof not detailed? A foreign tongue and an Arab! Say thou: Unto those who have believed it is a guidance and a healing: and those who believe not, - in their ears there is a heaviness, and Unto them it is blindness. These are they who are cried Unto from a place far-off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We made it a non-Arabic Quran, they would have said, ‘Why have not its signs been articulated?’ ‘What! A non-Arabian [scripture] and an Arabian [prophet]!?’ Say, ‘It is guidance and healing for those who have faith. As for those who are faithless, there is a deafness in their ears and it is lost to their sight: [to them it is as if] they were called from a distant place.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We sent this as a Qur'an (in the language) other than Arabic, they would have said: \"Why are not its verses explained in detail? What! (a Book) not in Arabic and (a Messenger an Arab?\" Say: \"It is a Guide and a Healing to those who believe; and for those who believe not, there is a deafness in their ears, and it is blindness in their (eyes): They are (as it were) being called from a place far distant!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had sent this as a Quran in a foreign language other than Arabic, they would have said: \"Why are not its Verses explained in detail (in our language)? What! (A Book) not in Arabic and (the Messenger) an Arab?\" Say: \"It is for those who believe, a guide and a healing. And as for those who disbelieve, there is heaviness (deafness) in their ears, and it (the Quran) is blindness for them. They are those who are called from a place far away (so they neither listen nor understand).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We made the Koran in a nonArabic (language) they would have said: 'If only its verses were distinguished! Why in (a) nonArabic (language, when theProphet is) an Arab' Say: 'To the believers it is a guidance and a healing. But to those who do not believe, there is a heaviness in their ears, to them it is blindness. They are those called from afar'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We made it a Quran in a foreign language, they would have said, “If only its verses were made clear.” Non-Arabic and an Arab? Say, “For those who believe, it is guidance and healing. But as for those who do not believe: there is heaviness in their ears, and it is blindness for them. These are being called from a distant place.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had made it a non-Arabic Qur'an, they would have said, \"Why are its verses not explained in detail [in our language]? Is it a foreign [recitation] and an Arab [messenger]?\" Say, \"It is, for those who believe, a guidance and cure.\" And those who do not believe - in their ears is deafness, and it is upon them blindness. Those are being called from a distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:44] And had We made it, namely, the Remembrance, a non-Arabic Qur’ān, they would have said, ‘Why have its signs not been explained [clearly]?, so that we might understand them? What!, a Qur’ān [that is], nonArabic and an Arab, prophet?’ (this is an interrogative of denial [spoken] by them; read [a-a‘jamiyyun] pronouncing [both the first and] the second hamza, or by changing it into an alif and either writing it out in full or not). Say: ‘For those who believe it is guidance, from error, and a healing, from [the disease of] ignorance; but as for those who do not believe, there is a deafness in their ears, a heaviness, and so they are unable to hear it, and they are blind to it, so they are unable to comprehend it. Those, they are [as if they were being] called from a distant place’, that is to say, they are like one who is called from far away, unable to hear or comprehend what is being called out to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَوْ جَعَلْنَاهُ قُرْآَنًا أَعْجَمِيًّا لَقَالُوا لَوْلَا فُصِّلَتْ آَيَاتُهُ أَأَعْجَمِيٌّ وَعَرَبِيٌّ قُلْ هُوَ لِلَّذِينَ آَمَنُوا هُدًى وَشِفَاءٌ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آَذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ (44){ أَلِيمٍ \\* وَلَوْ جعلناه قُرْءَاناً أعْجَمِيّاً لَّقَالُواْ لَوْلاَ فُصِّلَتْ ءاياته ءَاعْجَمِىٌّ وَعَرَبِىٌّ قُلْ هُوَ لِلَّذِينَ ءَامَنُواْ هُدًى وَشِفَآءٌ والذين } .اتصال نظم الكلام من أول السورة إلى هنا وتناسب تنقلاته بالتفريع والبيان والاعتراض والاستطراد يقتضي أن قوله : { ولو جعلناه قرآناً أعجمياً لقالوا } إلى آخره تنقُّلٌ في دَرجَ إثبات أن قصدهم العناد فيما يتعللون به ليواجهوا إعراضهم عن القرآن والانتفاع بهديه بما يختلقونه عليه من الطعن فيه والتكذيببِ به ، وتكلّفُ الأعذار الباطلة ليتستروا بذلك من الظهور في مظهر المنهزم المحجوج ، فأخَذ يَنقض دعاويهم عُروة عُروة ، إذْ ابتدئت السورة بتحدِّيهم بمعجزة القرآن بقوله : { حم تَنزِيلٌ مِنَ الرحمن الرَّحِيممِ كتاب فُصِّلَتْ ءاياته قُرءَاناً عَرَبِياً } إلى قوله { فهم لا يسمعون } \\[ فصلت : 1 4 \\] فهذا تحدَ لهم ووصف للقرآن بصفة الإِعجاز .ثم أخذَ في إبطال معاذيرهم ومطاعنهم بقوله : { وقالوا قلوبنا في أكنة مما تدعونا إليه } \\[ فصلت : 5 \\] ، فإن قولهم ذلك قصدوا به أن حجة القرآن غير مقنعة لهم إغاظة منهم للنبيء صلى الله عليه وسلم ثم تَمالُئهم على الأعراض بقوله : { وقال الذين كفروا لا تسمعوا لهذا القرآن والغوا فيه لعلكم تغلبون } \\[ فصلت : 26 \\] وهو عجز مكشوف بقوله : { إن الذين يلحدون في ءاياتنا لا يَخْفَون علينا } \\[ فصلت : 40 \\] وبقوله : { إن الذين كفروا بالذكر لما جاءهم } \\[ فصلت : 41 \\] الآيات . فأعقبها بأوصاف كمال القرآن التي لا يجدون مطعناً فيها بقوله : { وإنه لكتاب عزيز } \\[ فصلت : 41 \\] الآية .وإذ قد كانت هذه المجادلات في أول السورة إلى هنا إبطالاً لتعللاتهم ، وكان عماده على أن القرآن عربي مفصَّل الدلالةِ المعروفةِ في لغتهم حسبما ابتدىء الكلام بقوله : { كتاب فُصِّلَتْ ءاياته قُرءاناً عربياً لِقَوْممٍ يَعْلَمُونَ } \\[ فصلت : 3 \\] وانْتُهي هنا بقوله : { وإنه لكتاب عزيز لا يأتيه الباطل من بين يديه ولا من خلفه } \\[ فصلت : 41 ، 42 \\] ، فقد نهضت الحجة عليهم بدلالته على صدق الرسول صلى الله عليه وسلم من هذه الجهة فانتقل إلى حجة أخرى عمادها الفرضُ والتقديرُ أن يكون قد جاءهم الرسول صلى الله عليه وسلم بقرآن من لغة أخرى غير لغة العرب .ولذلك فجملة : { ولو جعلناه قرءاناً أعجمياً } معطوفة على جملة : { وإنه لكتاب عزيز } \\[ فصلت : 41 \\] على الاعتبارين المتقدمين آنفاً في موقع تلك الجملة .ومعنى الآية متفرع على ما يتضمنه قوله : { كتاب فُصِّلَتْ آياتُهُ قُرْءاناً عربياً لِقَوم يعلمون } \\[ فصلت : 3 \\] وقوله : { قل إنما أنا بشر مثلكم يوحَى إلي } \\[ الكهف : 110 \\] من التحدِّي بصفة الأمية كما علمت آنفاً ، أي لو جئناهم بلون آخر من معجزة الأمية فأنزلنا على الرسول قُرآناً أعجمياً ، وليس للرسول صلى الله عليه وسلم علم بتلك اللغة من قبل ، لقلبوا معاذيرهم فقالوا : لولا بُينت آياتُه بلغة نفهمها وكيف يخاطِبنا بكلام أعجمي . فالكلام جار على طريقة الفرض كما هو مقتضى حرف { لو } الامتناعية . وهذا إبانة على أن هؤلاء القوم لا تجدي معهم الحجة ولا ينقطعون عن المعاذير لأن جدالهم لا يريدون به تطلب الحق وما هو إلا تعنت لترويج هواهم .ومن هذا النوع في الاحتجاج قوله تعالى : { ولو نزلناه على بعض الأعجمين فقرأه عليهم ما كانوا به مؤمنين } \\[ الشعراء : 198 ، 199 \\] ، أي لو نزلناه بلغة العرب على بعض الأعجمين فقرأه عليهم بالعربية ، لاشتراك الحجتين في صفة الأمية في اللغة المفروضضِ إنزالُ الكتاب بها ، إلا أن تلك الآية بينت على فرض أن ينزل هذا القرآن على رسوللٍ لا يعرف العربية ، وهذه الآية بنيت على فرض أن ينزل القرآن على الرسول العربي صلى الله عليه وسلم بلغة غير العربية . وفي هذه الآية إشارة إلى عموم رسالة محمد صلى الله عليه وسلم للعرب والعجم فلم يكن عجباً أن يكون الكتاب المنزل عليه بلغة غير العرب لولا أن في إنزاله بالعربية حكمةً علمها الله ، فإن الله لما اصطفى الرسول صلى الله عليه وسلم عربياً وبعثه بين أمة عربية كان أحقُّ اللغات بأن ينزل بها كتابه إليه العربية ، إذ لو نزل كتابه بغير العربية لاستوت لغات الأمم كلها في استحقاق نزول الكتاب بها فأوقع ذلك تحاسداً بينها لأن بينهم من سوابق الحوادث في التاريخ ما يثير الغيرة والتحاسد بينهم بخلاف العرب إذ كانوا في عزلة عن بقية الأمم ، فلا جرم رُجحت العربية لأنها لغة الرسول صلى الله عليه وسلم ولغة القوم المرسل بينهم فلا يستقيم أن يبقى القوم الذين يدعوهم لا يفقهون الكتاب المنزل إليهم . .ولو تعددت الكتب بعدد اللغات لفاتت معجزة البلاغة الخاصة بالعربية لأن العربية أشرف اللغات وأعلاها خصائص وفصاحة وحسنَ أداء للمعاني الكثيرة بالألفاظ الوجيزة . ثم العرب هم الذين يتولون نشر هذا الدين بين الأمم وتبيين معاني القرآن لهم . ووقع في «تفسير الطبري» عن سعيد بن جبير أنه قال : قالت قريش : لولا أنزل هذا القرآن أعجمياً وعربياً؟ فأنزل الله : { لَوْلاَ فُصِّلَتْ ءاياته أعْجَمِيٌّ وَعَرَبِيٌّ } بهمزة واحدة على غير مذهب الاستفهام ا ه . ولا أحسب هذا إلا تأويلاً لسعيد بن جبير لأنه لم يسنده إلى راو ، ولم يرو عن غيره فرأى أن الآية تنبىء عن جواب كلام صدر عن المشركين المعبر عنهم بضمير { لَّقَالُوا } . وسياق الآية ولفظها ينبو عن هذا المعنى ، وكيف و { لو } الامتناعية تمتنع من تحمل هذا التأويل وتدفعه .وأما ما ذكره في «الكشاف» : «أنهم كانوا لتعنتهم يقولون : هلا نزل القرآن بلغة العجم؟ فقيل : لو كان كما يقترحون لم يتركوا الاعتراض والتعنت ، وقالوا : لولا فصّلت آياته الخ» . فلم نقف على من ذكر مثله من المفسرين وأصحاب أسباب النزول وما هو إلا من صنف ما روي عن سعيد . ولو كان كذلك لكان نظم الآية : وقالوا لولا فصلت آياته ، ولم يكن على طريقة { لو } وجوابها . ولا يظن بقريش أن يقولوا ذلك إلا إذا كان على سبيل التهكم والاستهزاء .وضمير { جعلناه } عائد إلى { الذكر في قوله : { إنَّ الذِينَ كَفَرُوا بالذِّكْرِ } \\[ فصلت : 41 \\] .وقوله : أعجمِيٌّ وعَرَبِيٌّ } بقية ما يقولونه على فرض أن يُجعل القرآن أعجمياً ، أي أنهم لا يخلون من الطعن في القرآن على كل تقدير .و { لولا } حرف تحضيض .ومعنى : { فُصِّلَتْ } هنا : بيِّنت ووضِّحت ، أي لولا جعلت آياته عربية نفهمها .والواو في قوله : { وَعَرَبِيٌّ } للعطف بمعنى المعية . والمعنى : وكيف يلتقي أعجمي وعربي ، أي كيف يكون اللفظ أعجمياً والمخاطب به عربياً كأنهم يقولون : أيلقى لفظ أعجمي إلى مخاطب عربي .ومعنى : { قوآناً } كتاباً مقروءاً . وورد في الحديث تسمية كتاب داود عليه السلام قرآناً ، وقال النبي صلى الله عليه وسلم إن داود يُسّر له القرآن فكان يقرأ القرآن كله في حين يسرج له فرسه ( أو كما قال ) .والأعجمي : المنسوب إلى أعجم ، والأعجم مشتق من العجمة وهي الإِفصاح ، فالأعجم : الذي لا يفصح باللغة العربية ، وزيادة الياء فيه للوصف نحو : أحمري ودَوّاري . فالأعجمي من صفات الكلام .وأفرد { وَعَرَبِيٌّ } على تأويله بجنس السامع ، والمعنى : أكتاب عربي لسامعين عرب فكان حق { عربي أن يجمع ولكنه أفرد لأن مبنى الإِنكار على تنافر حالتي الكتاب والمرسل إليهم ، فاعتبر فيه الجنس دون أن ينظر إلى إفراد ، أو جمع . وحاصل معنى الآية : أنها تؤذن بكلام مقدر داخل في صفات الذِّكْر ، وهو أنه بلسان عربي بلغتكم إتماماً لهديكم فلم تؤمنوا به وكفرتم وتعللتم بالتعلّلات الباطلة فلو جعلناه أعجمياً لقلتم : هلا بينت لنا حتى نفهمه .}هذا جواب تضمنه قوله : { ما يُقَالُ لَكَ إلاَّ مَا قَدْ قِيلَ لِلرُّسُللِ مِن قَبْلِكَ وَعَرَبِىٌّ قُلْ هُوَ لِلَّذِينَ ءَامَنُواْ هُدًى وَشِفَآءٌ والذين لاَ يُؤْمِنُونَ فى ءَاذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أولئك يُنَادَوْنَ مِن مَّكَانٍ } \\[ فصلت : 43 \\] ، أي ما يقال من الطعن في القرآن ، فجوابه : أن ذلك الذكر أو الكتاب للذين آمنوا هدى وشفاء ، أي أن تلك الخصال العظيمة للقرآن حَرَمَهم كُفْرُهم الانتفاع بها وانتفع بها المؤمنون فكان لهم هدياً وشفاء . وهذا ناظر إلى ما حكاه عنهم من قولهم : { قلوبنا في أكنة مما تدعونا إليه وفي آذاننا وقر } \\[ فصلت : 5 \\] ، فهو إلزام لهم بحكم على أنفسهم .وحقيقة الشفاء : زوال المرض وهو مستعار هنا للبصارة بالحقائق وانكشاف الالتباس من النفس كما يزول المرض عند حصول الشفاء ، يقال : شُفيتْ نفسه ، إذا زال حَرجه ، قال قيس بن زهير: ... شَفَيْتُ النفسَ من حَمَللِ بننِ بدروسيفي من حُذيفة قد شفاني ... ونظيره قولهم : شُفي غليله ، وبرد غليله ، فإن الكفر كالداء في النفس لأنه يوقع في العذاب ويبعث على السيئات .وجملة : { وَالَّذِينَ لاَ يُؤْمِنُونَ } الخ معطوفة على جملة : { هُوَ للذِينَ ءامَنُوا هُدًى } فهي مستأنفة استئنافاً ابتدائياً ، أي وأما الذين لا يؤمنون فلا تتخلل آياته نفوسَهم لأنهم كمن في آذانهم وقر دون سماعه ، وهو ما تقدم في حكاية قولهم : { وفي آذاننا وقر } \\[ فصلت : 5 \\] ، ولهذا الاعتبار كان معنى الجملة متعلقاً بأحوال القرآن مع الفريق غير المؤمن من غير تكلف لتقدير جعل الجملة خبراً عن القرآن .ويجوز أن تكون الجملة خبراً ثانياً عن ضمير الذكر ، أي القرآن ، فتكونَ من مقول القول وكذلك جملة { وَهُوَ عَليهِمْ عَمًى } .والإِخبار عنهُ ب { وَقْرٌ } و { عَمًى } تشبيه بليغ ووجه الشبه هو عدم الانتفاع به مع سماع ألفاظه ، والوقر : داء فمقابلته بالشفاء من محسِّن الطِّباق .وضمير { وَهُوَ عَلَيْهِمْ عَمًى } يتبادر أنه عائد إلى الذِّكر أو الكتاب كما عاد ضمير { هو } { لِلَّذِينَ ءَامَنُوا هُدًى } . والعَمى : عدم البصر ، وهو مستعار هنا لضد الاهتداء فمقابلته بالهدى فيها محسِّن الطِّباق .والإِسناد إلى القرآن على هذا الوجه في معاد الضمير بأنه عليهم عمًى من الإِسناد المجازي لأن عنادهم في قبوله كان سبباً لضلالهم فكان القرآن سَبَبَ سبببٍ ، كقوله تعالى : { وأما الذين في قلوبهم مرض فزادتهم رجساً إلى رجسهم } \\[ التوبة : 125 \\] .ويجوز أن يكون ضمير { وَهُوَ } ضميرَ شأن تنبيهاً على فظاعة ضلالهم . وجملة { عَلَيهم عَمًى } خبر ضميرَ الشأن ، أي وأعظم من الوقر أن عليهم عمى ، أي على أبصارهم عمى كقوله : { وعلى أبصارهم غشاوة } \\[ البقرة : 7 \\] .وإنما علق العمى بالكون على ذواتهم لأنه لما كان عمى مجازياً تعين أن مصيبَته على أنفسهم كلها لا على أبصارهم خاصة فإن عمى البصائر أشدّ ضراً من عمى الأبصار كقوله تعالى : { فإنها لا تعمى الأبصار ولكن تعمَى القلوب التي في الصدور } \\[ الحج : 46 \\] .وجملة { أولئك يُنَادونَ مِن مَكاننٍ بَعِيدٍ } خبر ثالث عن { الذين لا يؤمنون } . والكلام تمثيل لحال إعراضهم عن الدعوة عند سماعها بحال من يُنادَى من مكان بعيد لا يبلغ إليه في مثله صوت المنادي على نحو قوله تعالى : { ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع } كما تقدم في سورة البقرة ( 171 ) . وتقول العرب لمن لا يفهم : أنت تُنادَى من مكان بعيد . والإِشارة ب { أولئك } إلى { الذين لا يؤمنون } لقصد التنبيه على أن المشار إليهم بعد تلك الأوصاف أحْرياء بما سيذكر بعدها من الحكم من أجلها نظير { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] .ويتعلق { مِن مكاننٍ بعيدٍ } ب { يُنَادونَ } . وإذا كان النداء من مكان بعيد كان المنادَى ( بالفتح ) في مكان بعيد لا محالة كما تقدم في تعلق { من الأرض } ، بقوله : { ثم إذا دعاكم دعوة من الأرض } \\[ الروم : 25 \\] أي دعاكم من مكانكم في الأرض ، ويذلك يجوز أن يكون { مِن مَكَاننٍ بعيدٍ } ظرفاً مستقراً في موضع الحال من ضمير { يُنَادونَ } وذلك غير متأتَ في قوله : { إذا دعاكم دعوة من الأرض } .\n\n",
      "translations": [
        {
          "translation": "(And if We had appointed it a Lecture in a foreign tongue) if We had sent Gabriel with a Qur'an which is not in the Arabic usage (they) the disbelievers of Mecca (would assuredly have said: If only its verses were exposited (so that we might understand)? What! A foreign tongue and an Arab) what, a Scripture in a foreign language brought by an Arab man? (Say) to them, Muhammad: (For those who believe) Abu Bakr and his fellow Muslims (it) i.e. the Qur'an (is a guidance) from error (and a healing) it removes the blindness which is in the hearts of people; (and as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. Abu Jahl and his host, (there is a deafness in their ears, and it) i.e. the Qur'an (is blindness for them) a proof against them. (Such) the people of Mecca: Abu Jahl and his host (are called to from afar) it is as if they are called to believe in Allah's divine Oneness from high, above the sky.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِيۤ آذَانِهِمْ وَقْرٌ } معناه صممٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in their ears is deafness} [means] complete deafness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ورود الله عليهم هذا بقوله: { وَلَوْ جَعَلْنَاهُ } أي: الذِكر المنزل عليك يا أكمل الرسل { قُرْآناً أعْجَمِيّاً لَّقَالُواْ } في شأنه من شدة بغضهم وشكيمتهم معك { لَوْلاَ فُصِّلَتْ } أي: هلا أُضحت وبُيِّنت { آيَاتُهُ } بلسان نفقهها وندركها\n مع أنه إنما أنزل إليك وإلينا ونحن لا نفهم لغة العجم\n ثم يأخذون في القدح والاستهزاء بوجه آ×ر\n ويقولون: { ءَاعْجَمِيٌّ وَعَرَبِيٌّ } يعني: أينزل كلام أعجمي من قبل الحق على سبيل الوحي على نبي عربي\n لا شعور له بكلام العجم أصلاً ليرشد الأعراب به ويبين له ما فيه؟! كلا وحاشا\n ما هذا إلا كذب مفترى\n وبالجملة \" لا يسكتون أولئكك المعاندون عن القدح والطعن فيه بحال\n\n\nوبعدما وضح حالهم في التعنت والعناد { قُلْ } لهم يا أكمل الرسل كلاماً خالياً عن وصمة المجادلة والعناد: { هُوَ } أي: القرآن { لِلَّذِينَ آمَنُواْ } به\n وامتثلوا بأوامره ونواهيه\n وتنبهوا من رموزه وإشارته\n واعتبروا من عبره وأمثاله وقصصه وأخباره { هُدًى } يهديهم إلى الحق الصريح\n ويوصلهم إلى محض اليقين والتحقيق { وَشِفَآءٌ } لما في النفوس من الجهل\n والأمراض العضال المورثة لهم من تقليد آبائهم وتخمينات وأوهام صناديدهم ورؤسائهم { وَ } المكابرون { ٱلَّذِينَ لاَ يُؤْمِنُونَ } ولا يصدقون نزوله\n بل يكذبونه ويستهزئون مع من أنزل إليه\n هو بالنسبة إليهم { فِيۤ آذَانِهِمْ وَقْرٌ } مستقر وصمم شديد يصمهم عن استماع آياته الدالة على تهذيب الظاهر والباطن\n بل { وَهُوَ عَلَيْهِمْ عَمًى } يعمي بصائرهم وأبصارهم عن رؤية الحق الظاهر في الأنفس والآفاق\n\n\nوبالجملة: { أُوْلَـٰئِكَ } البعداء عن ساحة عز الحضور { يُنَادَوْنَ } إلى مقصد التوحيد { مِن مَّكَانٍ بَعِيدٍ } [فصلت: 44] بمراحل عن الوصول إليه\n يعني: هم وإن جبلوا على نشأة التوحيد صورة\n إلا أنهم حطوا عنها ولحقوا بمرتبة البهائم\n بل صاروا أبعد منها وأنزل لذلك ينادون من مكان بعيد إن نودوا\n\n{ وَ } إن عاندوا معك يا أكمل الرسل\n واختلفوا في كتابك بالتصديق والتكذيب لا تبالِ بهم وبردهم وقبولهم\n فإنَّا { لَقَدْ آتَيْنَا } من كمال جودنا أخاك { مُوسَى ٱلْكِتَابَ } أي: التوراة المشتمل على ضبط ظاهر الأحكام وبواطنه\n حفظاً لهم وضبطاً لأمور معاشهم ومعادهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وشفاءٌ } لما في الصدور من شك وشبهة إذ الشك مرض\n { والذين لا يؤمنون } به { في آذانهم وَقْرٌ } أي: صمم\n فالموصول: مبتدأ\n والجار: خبره\n وقيل: في موضع الجر\n بدل من الذين آمنوا أي: هو للذين آمنوا هُدىً وللذين لا يؤمنون في آذانهم وقر\n إلا أن فيه عطفاً على عاملين\n وهو جائز عند الأخفش\n { وهو } أي: القرآن { عليهم عَمىً } ظلمة وشبهة\n { أولئك } البعداء الموصوفون بما ذكر من التعامي عن الحق الذي يسمعونه\n والتعامي عن الآيات الظاهرة التي يشاهدونها\n { يُنادَوْنَ من مكان بعيدٍ } يعني: أنهم لعدم قبولهم وانتفاعهم\n كأنهم يُنادون إلى الإيمان بالقرآن من حيث لا يسمعون\n لبُعد المسافة\n وهو تمثيل لحالهم بحال مَن يُنادي من مسافة بعيدة لا يكاد يسمع من مسافتها الأصوات\n وقيل: ينادون في القيامة من مكان بعيد بأقبح الأسماء\n الإشارة: ما يُقال لك أيها المتوجه أو الوليّ\n إلا ما قد قيل لِمن قبلك من المنتسبين\n فقد أُوذِي مَن قبلك من أهل النسبة بأنواع الإذايات من ضربٍ وقتلٍ وسجنٍ\n وغير ذلك\n ففيهم أُسوة لمن بَعدهم\n { إِن ربك لذو مغفرة وذو عقاب أليم }\n\nومما جرت عادة الله في خلقه ألا يُسَلِّموا لأحياء عصرهم ما نطقوا به من حِكَم\n وأَتَوا به من علوم\n ولو بلغت من البلاغة ما بلغت\n كما وقع مِن طعن الكفرة في القرآن\n على أيّ وجه جاء\n وهي نزعة جاهلية\n وقوله تعالى: { قل هو للذين آمنوا هدى وشفاء } \n قال الورتجبي: هُدىً\n لقلوب العارفين إلى معدنه\n وهو الذات القديم\n وشفاء لقلوب العاشقين\n وأرواح مرضى المحبة وسُقمى الصبابة\n فلأنه خطاب حبيبهم\n وكتاب مشوقهم\n يستلذُّونه من حيث العبارات\n ويعرفونه من حيث الإشارات\n هـ\n وقوله تعالى: { في آذانهم وقر } قال ذو النون: من وُقِر سمعُه وأصم عن نداء الحق في الأزل\n لا يسمع نداءه عند الإيجاد\n وإن سمعه كان ذلك عليه عمىً\n ويكون عن دقائقه بعيداً\n وذلك أنهم نُودوا عن بُعد\n ولم يكونوا بالقرب\n هـ\n فكل مَن قرأه ذاهلاً عن تدبُّره بوساوس نفسه\n فهو ممن نُودي في الأزل عن بُعد\n وبالله التوفيق\n ولما ذكر بيان القرآن أتبعه بذكر التوراة\n تسليةً أيضاً\n فقال: { وَلَقَدْ آتَيْنَا مُوسَى ٱلْكِتَابَ فَٱخْتُلِفَ فِيهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:198",
      "similarity": 0.5881589754595345
    },
    {
      "verse": "16:103",
      "similarity": 0.5415598066455556
    },
    {
      "verse": "17:82",
      "similarity": 0.35472301007703194
    },
    {
      "verse": "10:57",
      "similarity": 0.3308368775689365
    },
    {
      "verse": "26:80",
      "similarity": 0.32952128020601806
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041044.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041044.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}