{
  "chapter": "فصلت",
  "text": "ما يقال لك الا ما قد قيل للرسل من قبلك ان ربك لذو مغفرة وذو عقاب اليم",
  "translations": [
    {
      "translation": "Nothing has been said to you that was not said to the Messengers before you. Your Lord is the Possessor of forgiveness but also of painful retribution.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you which had not been said to other apostles before you. Surely your Lord is the lord of forgiveness, but also the lord of severe retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), nothing is said to you but what was already said to the Messengers before you. Surely your Lord is the Lord of forgiveness and the Lord of grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing has been said to you which was not said to the Messengers who lived before you. Your Lord is certainly All-forgiving, but stern in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not be told except what was said to the Noble Messengers before you; that “Your Lord is the Owner of Forgiveness, and the Owner of Painful Punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you except what was said to the Messengers before you. Verily, your Lord is the Possessor of forgiveness, and (also) the Possessor of painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught is said to you but what was said indeed to the apostles before you; surely your Lord is the Lord of forgiveness and the Lord of painful retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught is said to thee but what already was said to the Messengers before thee. Surely thy Lord is a Lord of forgiveness and of painful retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught is said unto thee (Muhammad) save what was said unto the messengers before thee. Lo! thy Lord is owner of forgiveness, and owner (also) of dire punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you but what was said indeed to the messengers before you; surely your Lord is the Lord of forgiveness but also the Lord of painful retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught is said Unto thee save that which was said Unto the apostles afore thee. Verily thy Lord is Owner of forgiveness and Owner of afflictive chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you except what has already been said to the apostles before you. Indeed your Lord is One who forgives and also metes out a painful retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to thee that was not said to the messengers before thee: that thy lord has at his Command (all) forgiveness as well as a most Grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you (O Muhammad SAW) except what was said to the Messengers before you. Verily, your Lord is the Possessor of forgiveness, and (also) the Possessor of painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing that is said to you has not already been said to other Messengers before you. Indeed, your Lord is a Lord of forgiveness, but stern in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you but was said to the Messengers before you: your Lord is Possessor of Forgiveness, and Possessor of Painful Repayment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is said to you, [O Muhammad], except what was already said to the messengers before you. Indeed, your Lord is a possessor of forgiveness and a possessor of painful penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:43] Nothing is said to you, in terms of denial [of you], except, the like of, what has already been said to the messengers before you. Surely your Lord is One of forgiveness, to believers, and [also] One of painful punishment, for disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Naught is said unto thee) Muhammad, of vilification or denial (save what was said unto the messengers 555 before thee) of vilification and denial; it is also said that this means: the message that you were commanded to convey is like what the messengers before you were commanded to convey. (Lo! thy Lord) Muhammad (is owner of forgiveness) He forgives those who repent of disbelief and believe in Allah, (and owner (also) of dire punishment) for those who die in a state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أخذ سبحانه يسلي حبيبه صلى الله عليه وسلم ويزيل عنه أذى الكفرة الجهلة المعاندين معه بمقتضى آرائهم الباطلة وأهويتهم الفاسدة العاطلة فقال: { مَّا يُقَالُ لَكَ } أي: ما يقول لك كفار قومك ليس { إِلاَّ } مثل { مَا قَدْ قِيلَ لِلرُّسُلِ } الذين مضوا { مِن قَبْلِكَ } من قِبل قومهم\n فصبروا على أذاهم حتى ظفروا عليهم وانتصروا\n فاصبر أنت أيضاً على أذى هؤلاء المعاندين حتى تظفر عليهم\n وبعدما ظفرت يؤمنوا بك\n ويصروا على عنادهم { إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ } على المؤمنين بك\n يغفر لهم ما تقدم من ذنبهم وما تأخر\n إن أخلصوا في إيمانهم { وَذُو عِقَابٍ أَلِيمٍ } [فصلت: 43] على من تولى واستكبر\n وأصرَّ على كفره ولم يؤمن\n\n\nوبعدما قدح كفار مكة في شأن القرآن\n وقالوا: هلا نزل بلغة العجم كالكتب السالفة\n مع أنه لم يعهد منه سبحانه إنزال كتاب بلغة العرب قط",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ما يُقال لك } أي: ما يقول لك كفار قومك { إِلا ما قدْ قيلَ للرسل مِن قبلك } إلا مثل ما قال للرسل كفارُ قومهم\n من الكلمات المؤذية\n والمطاعن في الكتب المنزلة\n فاصبر كما صبروا\n { إِن ربك لذو مغفرةٍ } ورحمة لأنبيائه { وذو عقابٍ أليمٍ } لأعدائهم\n وقد نصر مَن قبلك مِن الرسل\n وانتقم مِن أعدائهم\n وسيفعل مثل ذلك بك وبأعدائك\n و: { ما يُقال لك } من الوحي وتخاطب به من جهته تعالى\n { إِلا ما قد قيل للرسل } وأوحي إليهم\n فلست ببدع منهم { إِن ربك لذو مغفرة } لمَن صدق وحيه\n { وذو عقاب أليم } لمَن كذب\n { ولو جعلناه } أي: الذكر { قرآناً أعجمياً لقالوا لولا فُصِّلتْ آياتهُ } أي: هلاَّ بُيّنت بلسان العرب حتى نفهمها\n كانوا يقولون: لتعنتِهم: هلاّ نزل القرآن بلغة العجم! فقيل لهم: لو كان كما تقترحون لقلتم: هلاّ بُيّنت آياته بلغتنا لنفهمه\n { أأعجميٌّ وعربيٌّ } \n بهمزتين الأولى للإنكار\n يعني: لو نزل بلغة العجم لأنكروا وقالوا: أقرآن أعجمي ورسول عربي؟ والأعجمي: الذي لا يفصح ولا يُفهم كلامه\n سواء كان من العجم أو من العرب\n والعجمي: منسوب إلى أمة العجم\n فصيحاً كان أو غير فصيح\n ومَن قرأ بهمزة واحدة\n فالمعنى: هلاَّ فُصّلت آياته فيجعل بعضها أعجمياً لإفهام العجم\n وبعضها عربيّاً لإفهام العرب\n فيكون معنى \" فُصِّلت \": نُوِّعَت\n وقُرىء \" أعجمي \" بفح العين\n ويتجه على كونهم طعنوا فيه من أجل ما فيه من الكلمة العجمية\n كـ\n[المطفِفين: 7] و\n[الكهف: 31]\n فقالوا: فيه أعجمي وعربي\n مخلط من كلام العرب وكلام العجم\n وأيّاً ما كان فالمقصود: أن آيات الله ـ عزّ وجل ـ على أيِّ طريق جاءتهم وجدوا متعنتاً يتعلّلون به لأنهم غير طالبين للحقِّ\n وإنما يتعبون أهواءهم\n { قل هو للذين آمنوا هُدًى } يهديهم إلى الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:14",
      "similarity": 0.4430489461524445
    },
    {
      "verse": "5:98",
      "similarity": 0.4274157719391342
    },
    {
      "verse": "15:50",
      "similarity": 0.3957268795359572
    },
    {
      "verse": "13:6",
      "similarity": 0.3744121971879826
    },
    {
      "verse": "16:104",
      "similarity": 0.3673706995631388
    }
  ]
}