{
  "chapter": "فصلت",
  "text": "ولقد ءاتينا موسى الكتب فاختلف فيه ولولا كلمة سبقت من ربك لقضى بينهم وانهم لفى شك منه مريب",
  "translations": [
    {
      "translation": "We gave Musa the Book but there was disagreement about it. And had it not been for a prior Word from your Lord, the judgement between them would already have been made. They are indeed in grave doubt about it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We gave Moses the Book; but they began to differ about it. If the Word of your Lord had not preceded it the matter would have been settled between them. They are still in doubt about it and uneasy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the past We gave Moses the Book and yet it became an object of dispute. If your Lord's decree had not gone forth before, a decisive judgement would have been made among them, once and for all. Surely they are in a disquieting doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had given the Book to Moses about which people greatly disagreed. Had the word of your Lord not been decreed, He would have certainly settled their differences (there and then). They were greatly suspicious and doubtful about the Book of Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed gave the Book to Moosa, so a dispute was created regarding it; and were it not for a Word that had already gone forth from your Lord, the judgement would have been immediately passed upon them; and indeed they are in an intriguing doubt regarding it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa the Scripture, but dispute arose therein. And had it not been for a Word that went forth before from your Lord, and the matter would have been settled between them. But truly, they are in grave doubt thereto.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave the Book to Musa, but it has been differed about, and had not a word already gone forth from your Lord, judgment would certainly have been given between them; and most surely they are in a disquieting doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book; and there was difference concerning it, and but for a Word that preceded from thy Lord, it had been decided between them; and they are in doubt of it disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily gave Moses the Scripture, but there hath been dispute concerning it; and but for a Word that had already gone forth from thy Lord, it would ere now have been judged between them; but lo! they are in hopeless doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book, but differences were created concerning it: and had it not been for a word that had already gone forth from your Lord, the matter would have been decided between them; and certainly they are in grave doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed Unto Musa the Book, and difference arose concerning it; and had not a word gone forth from thy Lord, the affair would have been decreed between them. And verily they are in regard thereto in doubt and dubitating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book, but differences arose about it; and were it not for a prior decree of your Lord, judgement would have been made between them, for they are in grave doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly gave Moses the Book aforetime: but disputes arose therein. Had it not been for a Word that went forth before from thy Lord, (their differences) would have been settled between them: but they remained in suspicious disquieting doubt thereon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa (Moses) the Scripture, but dispute arose therein. And had it not been for a Word that went forth before from your Lord, (the torment would have overtaken them) and the matter would have been settled between them. But truly, they are in grave doubt thereto (i.e. about the Quran). [Tafsir Al-Qurtubi, Vol. 15, Page 370]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to Moses, but there were disputes about it, and had it not been for a Word that preceded from your Lord (their disputes) would have been decided between them. But they are in disquieting doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book, but disputes arose concerning it. Were it not for a prior decree from your Lord, judgment would have been pronounced between them. But they are in perplexing doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been concluded between them. And indeed they are, concerning the Qur'an, in disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:45] And verily We gave Moses the Scripture, the Torah, but differences arose concerning it, in terms of [some] affirming the truth [of it] and [others] denying [it], as with the Qur’ān; and were it not for a Word that had [already] preceded from your Lord, to defer the reckoning and requital of creatures until the Day of Resurrection, judgement would have been made between them, in this world, concerning that over which they differed; for indeed they, the deniers of it, are in grave doubt concerning it, [doubt] which leads to   [utter] uncertainty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We verily gave Moses the Scripture) i.e. the Torah, (but there hath been dispute concerning it) concerning the Scripture of Moses; some believed in it while others rejected it; (and but for a Word) to postpone the chastisement of this nation (that had already gone forth from your Lord, it would ere now have been judged between them) the Jews, Christians and idolaters would have been destroyed; it is also said that this means: they would have already been punished for disbelieving, just as were destroyed before them the people who disbelieved their messengers; (but lo! They) the Jews, Christians and idolaters (are in hopeless doubt concerning it) are in manifest doubt concerning the Qur'an; it is also said: concerning the Scripture of Moses.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومع ذلك { فَٱخْتُلِفَ فِيهِ } أي: في حق التوراة وشأنه\n فقلبه بعضهم\n ورده الآخر مثلما يفعل هؤلاء الغواة بكتابك هذا\n وليس هذه الديدنة ببدع من هؤلاء الجهلة\n بل هي من عادتهم المستمرة وشيمتهم القديمة\n\n\n{ وَ } بالجملة: { لَوْلاَ كَلِمَةٌ } موعودة معهودة { سَبَقَتْ مِن رَّبِّكَ } من أخذ الظالم منهم على ظلمه في يوم الجزاء { لَقُضِيَ بَيْنَهُمْ } أي: بأخذهم سبحانه بظلمهم\n ويستأصلهم اليوم بالكلية بلا إمهال لهم لاستئصالهم بالأخذ والانتقام\n لكن ثبت حكمه سبحانه على ما وعد وقضى\n إذ ما يبدل القول لديه { وَإِنَّهُمْ } من كمال تماديهم في الغفلة والإعراض عن الحق واقتداره على وجوه الانتقام { لَفِي شَكٍّ } عظيم { مِّنْهُ } أي: من قضاء الله وحكمه المبرم في يوم الجزاء { مُرِيبٍ } [فصلت: 45] فيه ريباً منتهياً إلى الإنكار والتكذيب\n\n\nوبالجملة: لا تبالِ يا أكمل الرسل بهم وبريبهم\n وإنكارهم وطغيانهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولقد آتينا موسى الكتابَ } التوراة { فاختُلف فيه } فقال بعضهم: حق\n وقال بعضهم: كتبه بيده في الجبل\n كما اختلف قومك في كتابك القرآن\n فمِن مؤمن به وكافر\n { ولولا كلمةٌ سبقتْ من ربك } في حق أمتك بتأخير العذاب\n { لقُضِيَ بينهم } لأهلكهم إهلاك استئصال\n وقيل: الكلمة السابقة هو العدة بالقيامة لقوله:\n[القمر: 46]\n وأن الخصومات تُفصل في ذلك اليوم\n ولولا ذلك لقُضي بينهم في الدنيا\n { وإِنهم } أي: كفار قومك { لفي شكٍّ منه } من أجل القرآن { مُرِيبٍ } موقع للريبة\n وقيل: الضمير في بينهم وإنهم لليهود\n وفي منه لموسى\n أو: لكتابه\n وهو ضعيف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:110",
      "similarity": 0.9999999999999999
    },
    {
      "verse": "42:14",
      "similarity": 0.7557152778109018
    },
    {
      "verse": "10:19",
      "similarity": 0.5520428750612014
    },
    {
      "verse": "11:62",
      "similarity": 0.5049576076810209
    },
    {
      "verse": "38:8",
      "similarity": 0.4471836206958367
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}