{
  "chapter": "فصلت",
  "text": "لا يسـم الانسن من دعاء الخير وان مسه الشر فيـوس قنوط",
  "translations": [
    {
      "translation": "Man never tires of praying for the good and if evil touches him, he despairs and loses hope.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man never tires of praying for good; but if evil assails him he begins to despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man wearies not of praying for good, but when evil visits him, he despairs and gives up all hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The human being never tires of asking for good, but if he is afflicted by hardship, he despairs and gives up all hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man does not weary of seeking goodness; and if some misfortune reaches him, he loses hope, gets disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man does not get tired of asking for good; but if an evil touches him, then he gives up all hope and is lost in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is never tired of praying for good, and if evil touch him, then he is despairing, hopeless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man wearies not of praying for good; but when evil visits him, then he is cast down and desperate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man tireth not of praying for good, and if ill toucheth him, then he is disheartened, desperate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man never tires of asking for the good things of life; but if evil fortune befalls him, he abandons all hope, giving himself up to despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is not wearied of praying for worldly good, and if there tcucheth him an evil, he is despondent, despairing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is never wearied of supplicating for good, and should any ill befall him, he becomes hopeless and despondent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man does not weary of asking for good (things), but if ill touches him, he gives up all hope (and) is lost in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man (the disbeliever) does not get tired of asking good (things from Allah), but if an evil touches him, then he gives up all hope and is lost in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind never wearies of supplicating for goodness, but when evil befalls him he is downcast and (grows) desperate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The human being never tires of praying for good things; but when adversity afflicts him, he despairs and loses hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is not weary of supplication for good [things], but if evil touches him, he is hopeless and despairing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:49] Man never wearies of supplicating for good, in other words, he never ceases to ask his Lord for wealth and good health and other [good] things, but should any ill befall him, such as impoverishment or hardship, then he becomes despondent, despairing, of God’s mercy — this and what follows relates to [the attitude of] disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Man) i.e. the disbelieving person (tireth not of praying for good) wealth, offspring and good health, (and if ill toucheth him) and if hardship and poverty touch him, (then he is disheartened, desperate) then he utterly despairs of Allah's mercy. 556\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَّ يَسْأَمُ ٱلإِنْسَانُ } معناه لا يَملُّ\n\n\n\n\nوقوله تعالى: { فَيَئُوسٌ قَنُوطٌ } معناه يَيأسُ ويَقنِطُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن العادة القديمة والديدنة المستمرة أنه { لاَّ يَسْأَمُ } أي: لا يمل ولا يفتر { ٱلإِنْسَانُ } المجبول على جلب الإحسان { مِن دُعَآءِ ٱلْخَيْرِ } لنفسه وجذب المنفعة إلى ذاته حريصاً عليها، مولعاً لاقتنائها وجمعها { وَإِن مَّسَّهُ ٱلشَّرُّ } وعرض عليه الضر حيناً من الأحيان { فَيَئُوسٌ } من قدرة الله على دفع الضر عنه، نوجلب النفع إياه بعدما أزال عنه ابتلاء { قَنُوطٌ } [فصلت: 49] من فض الله عليه وسعة رحمته وجوده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لا يسأمُ الإِنسانُ } أي: جنسه، أو: الكافر، بدليل قوله:\n\n[الكهف: 36]، أي: لا يملّ { من دعاءِ الخيرِ } من طلب السعة في المال والنعمة، ولا يملّ عن إرادة النفع والسلامة، والتقدير: من دعائه الخير، فحذف الفاعل وأضيف إلى المفعول، { وإِن مسَّه الشرُّ } الفقر والضيق، { فَيَؤُوسٌ } من الخير { قنوطٌ } من الرحمة، أي: لا يرجو زواله لعدم علمه بربه، وانسداد الطريق على قلبه في الرجوع إلى ربه، بُولغ فيه من طريقين: من طريق بناء فَعول، ومن طريق التكرير لأن اليأس هو القنط، والقنوط: أن يظهر أثر اليأس فيتضاءل وينكسر، ويظهرَ الجزع، وهذا صفة الكافر لقوله:\n\n[يوسف: 87]\n وقال الإمام الفخر: اليأس على أمر الدنيا من صفة القلب، والقنوط: إظهار آثاره على الظاهر\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:38",
      "similarity": 0.6437357865670381
    },
    {
      "verse": "15:55",
      "similarity": 0.4005701449344208
    },
    {
      "verse": "15:56",
      "similarity": 0.39943510941492616
    },
    {
      "verse": "39:53",
      "similarity": 0.3619590505444537
    },
    {
      "verse": "30:36",
      "similarity": 0.35786113455894203
    }
  ]
}