{
  "chapter": "فصلت",
  "text": "وضل عنهم ما كانوا۟ يدعون من قبل وظنوا۟ ما لهم من محيص",
  "translations": [
    {
      "translation": "And those they used to worship will leave them in the lurch, and they will realise there is no escape for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then all those deities whom they once used to call upon shall vanish and they will come to know for sure that there is no escape for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever they had worshipped before will disappear and they will then know that there is no way for them to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have lost what they used to worship before, and be sure, they do not have a place to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they used to invoke before (in this world) shall disappear from them, and they will perceive that they have no place of refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And away from them shall go what they called upon before, and they shall know for certain that there is no escape for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then that they called upon before will go astray from them and they will think that they have no asylum.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those to whom they used to cry of old have failed them, and they perceive they have no place of refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[the deities] they invoked before will have vanished; they will know that there is no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there will fail them those whom they had been calling upon aforetime, and they will perceive that there is for them no shelter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they used to invoke before has forsaken them, and they know there is no escape for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (deities) they used to invoke aforetime will leave them in the lurch, and they will perceive that they have no way of escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they used to invoke before will fail them, and they will perceive that they have no place of refuge (from Allah's punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they used to call upon before will go away from them, and they shall think that they have no asylum.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they used to pray to before will forsake them, and they will realize that they have no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lost from them will be those they were invoking before, and they will be certain that they have no place of escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:48] And what they used to call on, [what they used] to worship, before, in this world, of idols, has forsaken them and they suppose, they will be certain, that there is no refuge for them, no escape from the chastisement (the negation in both instances comments on the operation [implied in the nouns of actions; also the negation stands in place of the direct objects in both instances).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those to whom they used to cry) to worship (of old) in the life of the world (have failed them) become preoccupied from them, (and they perceive) they knew and became certain (they have no place of refuge) or helper or any escape from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَا لَهُمْ مِّن مَّحِيصٍ } معناه من مَلجإٍ ومَعدلٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تقوَّلوا ما تقوَّلوا من شدة الأسف ونهاية الحسرة والضجرة { ضَلَّ } وغاب { عَنْهُم } وخف عن أبصارهم وبصائرهم { مَّا كَانُواْ يَدْعُونَ } ويعبدون إليه { مِن قَبْلُ وَظَنُّواْ } بل تيقنوا حينئذ { مَا لَهُمْ مِّن مَّحِيصٍ } [فصلت: 48] مهرب ومخلِّص من عذاب الله، فتندموا وما ينفعهم الندم، ورجعوا إلى الله حينئذ وما يفيدهم الرجوع؛ لانقضاء مدة التدارك والاختبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}