{
  "chapter": "فصلت",
  "text": "لا ياتيه البطل منۢ بين يديه ولا من خلفه تنزيل من حكيم حميد",
  "translations": [
    {
      "translation": "falsehood cannot reach it from before it or behind it - it is a revelation from One who is All-Wise, Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot enter it from any side: It's a revelation from the all-wise and praiseworthy (God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood may not enter it from the front or from the rear. It is a revelation that has been sent down from the Most Wise, the Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood can not reach it from any direction. It is the revelation from the All-wise, Praiseworthy One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot approach it – neither from its front nor from its back; it is sent down by the Wise, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot come to it from before it or behind it, (it is) sent down by the All-Wise, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood shall not come to it from before it nor from behind it; a revelation from the Wise, the Praised One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "falsehood comes not to it from before it nor from behind it; a sending down from One All-wise, All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot come at it from before it or from behind it. (It is) a revelation from the Wise, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "falsehood shall not reach from before or from behind. It is a revelation from the Wise, the One worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot come at it from before it or behind it It, a revelation from One Wise and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "falsehood cannot approach it, at present or in future, a [revelation gradually] sent down from One all-wise, all-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No falsehood can approach it from before or behind it: It is sent down by One Full of Wisdom, Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot come to it from before it or behind it (it is) sent down by the All-Wise, Worthy of all praise (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "falsehood does not come to it from before it or from behind it. It is a sending down from the One, the Wise, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot approach it, from before it or behind it. It is a revelation from One Wise and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:42] falsehood cannot approach it from before it or from behind it, in other words, there is no scripture before it or after it that contradicts it; [it is] a revelation from One Wise, Praised, that is to say, [from] God, the One Who is praised in His affair.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Falsehood cannot come at it) it is not contradicted by the Torah, the Gospel or by any revealed Scriptures (from before it) before its revelation (or behind it) and after there will be no Scripture which will contradict it; it is also said that this means: the Torah, the Gospel, the Psalms and all the Scriptures which were revealed before the Qur'an do not contradict it and there will be no Scripture in the future which will contradict it and, hence, it will remain uncontradicted; and it is also said that this means: Iblis did not come to Muhammad (pbuh) before the coming of Gabriel to him such that he added to the Qur'an, nor did he come to him after Gabriel such that he took away from the Qur'an; and it is also said that this means: the Qur'an does not contradict itself, but rather everything in it is in perfect agreement. ((It is) a revelation from the Wise) in His command and decree, (the Owner of Praise) the Praiseworthy in His acts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوما اعتقدوه من باطلهم إذ { لا يأتيه الباطل من } جهة من الجهات لا من جهة الحق فيبطله بما هو أبلغ منه وأشدّ إحكاماً في كونه حقاً وصدقاً ولا من جهة الخلق فيبطلونه بالإلحاد في تأويله ويغيِّرونه بالتحريف لكونه ثابتاً في اللوح محفوظاً من جهة الحق\n كما قال تعالى:\n[الحجر\n الآية:9]\n { قُلْ هو للذين آمنُوا هُدىً وشفاء } أي: هو للمؤمنين بالغيب هداية تهديهم إلى الحق وتبصرهم بالمعرفة وشفاء يزيل أمراض قلوبهم من الرذائل كالنفاق والشك أي: تبصرهم بطريق النظر والعمل فتعلمهم وتزكيهم { والذين لا يؤمنُون } من المحجوبين لا يسمعونه ولا يفهمونه بل يشتبه عليهم ويلتبس لاستيلاء الغفلة عليهم وسدّ الغشاوات الطبيعية والهيئات البدنية طرق أسماع قلوبهم وأبصارهم فلا ينفذ فيها ولا يتنبهوا بها ولا يتيقظوا كالذي ينادي من مكان بعيد لبعدهم عن منبع النور الذي يدرك به الحق ويرى\n وانهماكهم في ظلمات الهيولى\n { سنُريهم آياتنا في الآفَاقِ وفي أنْفسهم } أي: نوفقهم للنظر في تصاريفنا للممكنات وأحوالها { حتى يَتَبيَّن لهم } بطريق الاستدلال واليقين البرهاني { أنه الحق أو لم يكفِّ بربك } للذين شاهدوه من أهل العيان { أنَّه على كل شيء شهيد } حاضر مطلع\n أي: لم يكف شهوده على مظاهر الأشياء في معرفته وكونه الحق الثابت دون غيره حتى تحتاج إلى الاستدلال بأفعاله أو التوسل بتجليات صفاته وهذا هو حال المحبوب المكاشف بالجذب قبل السلوك\n والأول حال المحبّ السالك المجاهد لطلب الوصول\n { ألا إنهم في مرية من لِقَاء ربّهم } لاحتجابهم بالكون عن المكوِّن والمخلوق عن الخالق { ألا إنه بكل شيء محيط } لا يخرج عن إحاطته شيء وإلا لم يوجد\n إذ حقيقة كل شيء عين علمه تعالى ووجوده به\n وعلمه عين ذاته وذاته عين وجوده\n فلا يخرج شيء عن إحاطته إذ لا وجود لغيره ولا عين ولا ذات\n[القصص\n الآية:88] كما قال تعالى:\n[الرحمن\n الآيات:26 - 27]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { لاَّ يَأْتِيهِ ٱلْبَاطِلُ } الزائغ الزائل في خلال أوامره وأحكامه لا { مِن بَيْنِ يَدَيْهِ } بأن يتصف حكمه وأحكامه حين نزوله وظهوره بعدم المطابقة لما في الواقع\n وما في علم الله ولوح قضائه { وَلاَ مِنْ خَلْفِهِ } بأن يلحقه نسخ وتبديل كالكتب السالفة\n إذ هو { تَنزِيلٌ مِّنْ حَكِيمٍ } كامل في الإتقان والإحكام\n عليم بأساليب الحكم والأحكام { حَمِيدٍ } [فصلت: 42] في ذاته\n يحمده كل الأنام على ما أفاض عليهم من موائد الإفضال والإنعام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا يأتيه الباطلُ مِن بين يديه ولا مِن خلفه } أي: لا يتطرقه الباطل من جهة من الجهات\n أو: لا يأتيه التبديل والتحريف\n أو: التناقض بوجه من الوجوه\n وأما النسخ فليس بمبطل للمنسوخ\n بل هو: انتهاء حكم إلى مدة وابتداء حكم آخر\n خلافاً لمَن احتجّ بالآية على عدم النسخ في القرآن\n انظر ابن عرفة\n { تنزيلٌ من حكيم حميدٍ } أي: تنزيل من حكيم محمود\n فـ \" تنزيل \": خبر عن مضمر\n أو: صفة أخرى لكتاب\n مفيدة لفخامته الإضافية\n كما أن الصلتين السابقتين\n مفيدتان لفخامته الذاتية\n كل ذلك لتأكيد بطلان الكفر به وبشاعة قُبحه\n الإشارة: إن الذين يُلحدون في آياتنا\n فيطعنون في أوليائنا\n الدالين علينا\n لا يخفون علينا\n وسيُلقون في نار القطيعة والبُعد مع عموم الخوف من هول المطَّلع\n أفمن يُلقى في النار خير أم مَن يأتي آمناً يوم القيامة؟ اعملوا ما شئتم من التسليم أو الانتقاد\n وكل مَن لا يصحب الرجال لا يخلو خاطره من شك أو وَهْم في مواعيد القرآن\n كالرزق وغيره\n ينسحب عليه قوله: { إِن الذين كفروا بالذكر\n\n\n } الآية\n من طريق الإشارة\n والله تعالى أعلم\n وقوله تعالى: { وإِنه لكتابٌ عزيز } قال الشيخ عبد الرحمن اللجاي في كتاب \" قطب العارفين \": الكتاب عزيز\n وعلم الكتاب أعز\n والعلم عزيز\n والعمل به أعز\n والعمل عزيز\n والذوق أعز\n والذوق عزيز\n والمشاهدة في الذوق أعز\n والمشاهدة عزيزة\n والموافقة في المشاهدة أعز\n والموافقة عزيزة\n والأنفس في الموافقة أعز\n والأنس عزيز\n وآداب الأنس أعز\n ثم قال: لكن لا يستنشق رائحة هذه المقامات مَن غلب جهلُه على علمه\n وهواه على عقله\n وسفهُه على حلمه\n هـ\n ثم سلَّى نبيه من تكذيب قومه\n فقال: { مَّا يُقَالُ لَكَ إِلاَّ مَا قَدْ قِيلَ لِلرُّسُلِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:33",
      "similarity": 0.46627228919237707
    },
    {
      "verse": "22:62",
      "similarity": 0.40515426906149504
    },
    {
      "verse": "31:30",
      "similarity": 0.40515426906149504
    },
    {
      "verse": "47:3",
      "similarity": 0.3807305548547789
    },
    {
      "verse": "38:27",
      "similarity": 0.3721975061257088
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}