{
  "chapter": "فصلت",
  "text": "ان الذين يلحدون فى ءايتنا لا يخفون علينا افمن يلقى فى النار خير ام من ياتى ءامنا يوم القيمة اعملوا۟ ما شئتم انه بما تعملون بصير",
  "translations": [
    {
      "translation": "Those who adulterate Our Signs are not concealed from Us. Who is better - someone who will be thrown into the fire or someone who will arrive in safety on the Day of Rising? Do what you like. He sees whatever you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who slander Our signs are not hidden from Us. Then, is he better who will be cast into Hell, or he who will come out safe on the Day of Resurrection? Do whatever you will, He sees whatsoever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who pervert Our Signs are not hidden from Us. Is he who will be cast into the Fire better, or he who comes secure on the Day of Resurrection? Do as you wish; He sees all what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deviate from Our revelations are not hidden from Us. Is the one who will be thrown into hell fire better than the one who will be brought safely into the presence of God on the Day of Judgment? Act as you wish; God is Well-Aware of whatever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who distort Our verses are not hidden from Us; so is one who is cast into the fire better, or one who comes in safety on the Day of Resurrection? Do whatever you wish! He is indeed seeing your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who Yulhiduna Fi Our Ayat are not hidden from Us. Is he who is cast into the Fire better or he who comes secure on the Day of Resurrection Do what you will. Verily, He is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they who deviate from the right way concerning Our communications are not hidden from Us. What! is he then who is cast into the fire better, or he who comes safe on the day of resurrection? Do what you like, surely He sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who blaspheme Our signs are not hidden from Us. What, is he who shall be cast into the Fire better, or he who comes on the Day of Resurrection in security? Do what you will; surely He sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who distort Our revelations are not hid from Us. Is he who is hurled into the Fire better, or he who cometh secure on the Day of Resurrection? Do what ye will. Lo! He is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who distort the meaning of Our message are not concealed from Us. Who is better -- someone who will be thrown into the Fire or someone who will arrive in safety on the Day of Resurrection? Do as you will, He sees whatever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who blaspheme Our revelations are not hid from Us. Is he then who will be cast into the Fire better or he who cometh secure on the Day of Resurrection? Work whatsoever ye will; Verily He is of that which ye work the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who abuse Our signs are not hidden from Us. Is someone who is cast in the Fire better off, or someone who arrives safely on the Day of Resurrection? Act as you wish; indeed He watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who pervert the Truth in Our Signs are not hidden from Us. Which is better?- he that is cast into the Fire, or he that comes safe through, on the Day of Judgment? Do what ye will: verily He seeth (clearly) all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who turn away from Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc. by attacking, distorting and denying them), are not hidden from Us. Is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do what you will. Verily! He is All-Seer of what you do (this is a severe threat to the disbelievers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve Our verses when it comes to them are not hidden from Us. Is he who is cast in the Fire better than he who comes in safety on the Day of Resurrection? Do as you will, surely, He sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who despise Our revelations are not hidden from Us. Is he who is hurled into the Fire better? Or he who arrives safely on the Day of Resurrection? Do as you please; He is Seeing of everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:40] Indeed those who blaspheme (yulhidūna derives from [the verb] alhada, or lahada, ‘he blasphemed’) Our signs — the Qur’ān, by denying [its truth] — are not hidden from Us, and We will requite them. Is one who is cast into the Fire better [off], or one who arrives secure on the Day of Resurrection? Act as you wish; indeed He is Seer of what you do — this is [meant as] a threat for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who distort Our revelations) those who deny Our signs-Muhammad (pbuh) and the Qur'an-(are not hid from Us) none of their works is hidden from Us. (Is he who is hurled into the Fire) Abu Jahl and his host (better, or he who cometh secure) from the torment (on the Day of Resurrection) this refers to Muhammad (pbuh) and his Companions? (Do what ye will) people of Mecca; this is a threat made to them. (Lo! He is Seer of what ye do) He will requite your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلَّذِينَ يُلْحِدُونَ فِيۤ آيَاتِنَا لاَ يَخْفَوْنَ عَلَيْنَآ } معناه يَجوُرونَ ويَميلُونَ ويَعدِلُونَ\n\n\n\n\nوقوله تعالى: { ٱعْمَلُواْ مَا شِئْتُمْ } هو وعيدٌ من الله عزَّ وجلَّ\n\n",
      "translations": [
        {
          "translation": " The meaning of the verse is that they {those who invent falsehoods in our verses} incline towards it and turn away from it and change it.\n\n\nAnd His saying, {Do as you please} is a sign from Allah, Most High, Most Great.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وقدرة الله على إعادة الموتى وحشر الأموات: { إِنَّ } المسرفين { ٱلَّذِينَ يُلْحِدُونَ } أي: يميلون وينحرفون { فِيۤ آيَاتِنَا } الدالة على عظمة ذاتنا وكمال قدرتنا على أنواع الانتقام { لاَ يَخْفَوْنَ عَلَيْنَآ } أي: لا يشتبه حالهم علينا\n بل نحن منكشفون بهم وبجميع ما جرى في ضمائرهم\n واختلج في خواطرهم من الميل والانحراف\n فيجازيهم على مقتضى إلحادهم وانحرافهم بأشد العذاب وأسوأ الجزاء\n\n\n{ أَفَمَن يُلْقَىٰ فِي ٱلنَّارِ } أي: قل لهم يا أكمل الرسل على سبيل التوبيخ والتقريع \" إن من يُلقى في النشأة الأخرى في النار المسعرة بأنواع المذلة والهوان { خَيْرٌ } عندهم { أَم مَّن يَأْتِيۤ آمِناً } من العذاب مسروراً { يَوْمَ ٱلْقِيَامَةِ } بأنواع الفتوحات والكرامات الموهوبة له من ربه تفضلاً عليه وإحساناً\n وبالجملة: قل يا أكمل الرسل للملحدين المصرين على الميل والإلحاد على سبيل التبكيت والتهديد: { ٱعْمَلُواْ مَا شِئْتُمْ } من الخوض في آيات الله\n والميل عن دلائل توحيده { إِنَّهُ } سبحانه { بِمَا تَعْمَلُونَ بَصِيرٌ } [فصلت: 40] يجازيكم عليه بلا فوت شيء منه\n ثم عرض عنهم ودعهم\n[الأنعام: 91]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن الذين يُلحدون في آياتنا } أي: يميلون عن الحق في أدلتنا التكوينية\n الدالة على وحدانيتنا\n فلا ينظرون فيها\n أو: يُلحدون في آياتنا التنزيلية\n بالطعن فيها\n وتحريفها\n بحملها على المحامل الباطلة\n { لا يَخْفَونَ علينا } \n بل نجازيهم على ذلك\n يقال: ألحد الكافر ولحدَ: إذا مال عن الاستقامة عن الحق\n ثم ذكر جزاءهم فقال: { أفمن يُلقى في النار خيرٌ أم من يأتي آمناً يومَ القيامةِ } قيل: نزلت في أبي جهل وعثمان\n وهي عامة\n { اعملوا ما شئتم } من الأعمال المؤدية إلى ما ذكر من الإبقاء في النار\n والإتيان آمناً\n وفيه تهديد وتنديد\n { إِنه بما تعملون بصيرٌ } فيجازيكم بحسب أعمالكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:180",
      "similarity": 0.713040514345409
    },
    {
      "verse": "18:27",
      "similarity": 0.6381666627896475
    },
    {
      "verse": "72:22",
      "similarity": 0.5942783964061045
    },
    {
      "verse": "22:25",
      "similarity": 0.48724751455569665
    },
    {
      "verse": "16:103",
      "similarity": 0.3890363007437762
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/41:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/41:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}