{
  "chapter": "فصلت",
  "text": "واذا انعمنا على الانسن اعرض ونـا بجانبه واذا مسه الشر فذو دعاء عريض",
  "translations": [
    {
      "translation": "When We show Our favours to man he moves away and turns aside; but when in trouble he prays a great deal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bestow Our favour upon man, he turns away and waxes proud; but when a misfortune touches him, he is full of supplication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We grant the human being a favor, he ignores it and turns away but when he is afflicted by hardship, he starts lengthy prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We favour man, he turns away and goes back afar; and when some hardship reaches him, he comes with a vast prayer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We show favor to man, he turns away and becomes arrogant; but when evil touches him, then he has recourse to long supplications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We show favor to man, he turns aside and withdraws himself; and when evil touches him, he makes lengthy supplications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bless man, he turns away and withdraws aside; but when evil visits him, he is full of endless prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We show favour unto man, he withdraweth and turneth aside, but when ill toucheth him then he aboundeth in prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We grant a blessing to a man, he turns away and draws aside, but when any evil touches him, he is full of endless prayers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We shew favour Unto man, he turneth aside and withdraweth on his side, and when evil toucheth him, then he is full of prolonged prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bless man, he is disregardful and turns aside; but when an ill befalls him, he makes protracted supplications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bestow favours on man, he turns away, and gets himself remote on his side (instead of coming to Us); and when evil seizes him, (he comes) full of prolonged prayer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We show favour to man, he withdraws and turns away, but when evil touches him, then he has recourse to long supplications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We favor a human, he swerves away and withdraws aside, but when evil befalls him he is full of unending prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We provide comfort for the human being, he withdraws and distances himself; but when adversity befalls him, he starts lengthy prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bestow favor upon man, he turns away and distances himself; but when evil touches him, then he is full of extensive supplication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:51] And when We bestow graces upon man (insān, the generic noun [is meant]), he shows disregard, of giving thanks, and turns aside, turns his head in arrogance (a variant reading [for nā’a] has na’ā); but when ill befalls him, he makes prolonged supplications.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When We show favour unto man) i.e. to the disbelieving person by giving him wealth and offspring, (he withdraweth) he abstains from giving thanks for it (and turneth aside) and turns away from faith, (but when ill toucheth him) when poverty touches him (then he aboundeth in prayer) asking for wealth; and it is also said that this means: asking for many offspring; the reference here is also to 'Utbah Ibn Rabi'ah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَعْرَضَ وَنَأَى بِجَانِبِهِ } معناه تَباعدَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة طغيان الإنسان ونهاية كفرانه وعدوانه: إنَّا { إِذَآ أَنْعَمْنَا } وأكرمنا من مقام جودنا { عَلَى ٱلإِنسَانِ } المجبول على النسيان { أَعْرَضَ وَنَأَى بِجَانِبِهِ } أي: تباعد عنَّا، ولم يشكر على نعمنا، ولم يلتفت إلى موائد كرمنا { وَإِذَا مَسَّهُ ٱلشَّرُّ } ولحقه الضر { فَذُو دُعَآءٍ عَرِيضٍ } [فصلت: 51] كثير ممتد عرضاً وطولاً، وهو كناية عن إلحاحهم ولجاجهم في طلب الكشف والتفريج من الله عند نزول البلاء وإلمام المصيبة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}