{
  "chapter": "فصلت",
  "text": "ولئن اذقنه رحمة منا منۢ بعد ضراء مسته ليقولن هذا لى وما اظن الساعة قائمة ولئن رجعت الى ربى ان لى عنده للحسنى فلننبئن الذين كفروا۟ بما عملوا۟ ولنذيقنهم من عذاب غليظ",
  "translations": [
    {
      "translation": "But if We let him taste mercy from Us after he has suffered hardship, then he says, 'This is my due. I do not think that the Hour is going to come. And if am returned to my Lord, I will definitely find the best reward with Him.' But We will inform those who are kafir of what they did and make them suffer a ruthless punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We give him a taste of Our favour after some distress he has known, he says: \"It was my due. I cannot imagine the Hour will come. And even if I go back to my Lord, there will surely still be the best for me with Him.\" We shall tell those who do not believe what they used to do, and inflict on them a heavy punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We bestow Our Mercy upon him after hardship, he will surely say: “This is what I truly deserve, and I do not believe that the Hour (of Resurrection) will ever come to pass; and if I am returned to my Lord, there too I shall enjoy the best.” Surely We shall fully apprise the unbelievers of what they have done, and We shall certainly make them taste a severe chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We grant him mercy after his suffering, he (boldly) says, \"This is what I deserved. I do not think that there will ever be a Day of Judgment. Even if I will be returned to my Lord, I shall still deserve to receive better rewards from Him.\" We shall certainly tell the unbelievers about their deeds and cause them to suffer a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We make him taste Our mercy after the hardship which befell him, he will say, “This is mine! And I do not think that the Last Day will ever be established – and even if I am returned to my Lord, with Him is only goodness for me”; so We shall indeed inform the disbelievers of what they did; and We shall indeed make them taste a solid punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And truly, if We give him a taste of mercy from Us, after some adversity has touched him, he is sure to say: \"This is due to my (merit); I think not that the Hour will be established. But if I am brought back to my Lord, surely there will be for me the best with Him. \"Then, We verily will show to the disbelievers what they have done, and We shall make them taste a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We make him taste mercy from Us after distress that has touched him, he would most certainly say: This is of me, and I do not think the hour will come to pass, and if I am sent back to my Lord, I shall have with Him sure good; but We will most certainly inform those who disbelieved of what they did, and We will most certainly make them taste of hard chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let him taste mercy from Us after hardship that has visited him, he surely says, 'This is mine; I think not the Hour is coming. If I am returned to my Lord, surely the reward most fair with Him will be mine.' Then We shall tell the unbelievers the things they have done, and assuredly We shall let them taste a harsh chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, if We cause him to taste mercy after some hurt that hath touched him, he will say: This is my own; and I deem not that the Hour will ever rise, and if I am brought back to my Lord, I surely shall be better off with Him - But We verily shall tell those who disbelieve (all) that they did, and We verily shall make them taste hard punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We give him a taste of some of Our mercy, after some adversity has touched him, he is sure to say, \"This is my due. I do not think that the Hour is going to come. And even if I return to my Lord, He will surely reward me well.\" But truly We shall tell those who deny the truth [all] that they did, and shall make them suffer a hard punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, surely, if We cause him to taste mercy from Us after affliction hath touched him, he is sure to say: this is my own, and I deem not that the Hour will everarise, and were I to be brought back to my Lord, verily there will be for me, with Him, an excellent condition. But We shall surely declare Unto those who disbelieve that which they have worked, and We shall surely make them taste a torment rough..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If, after distress has befallen him, We let him have a taste of Our mercy, he says, ‘This is my due! I do not think the Hour will ever come, and in case I am returned to my Lord, I will indeed have the best [reward] with Him.’ So We will surely inform the faithless about what they have done, and will surely make them taste a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we give him a taste of some Mercy from Ourselves, after some adversity has touched him, he is sure to say, \"This is due to my (merit): I think not that the Hour (of Judgment) will (ever) be established; but if I am brought back to my Lord, I have (much) good (stored) in His sight!\" But We will show the Unbelievers the truth of all that they did, and We shall give them the taste of a severe Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And truly, if We give him a taste of mercy from us, after some adversity (severe poverty or disease, etc.) has touched him, he is sure to say: \"This is for me (due to my merit), I think not that the Hour will be established. But if I am brought back to my Lord, Surely, there will be for me the best (wealth, etc.) with Him. Then, We verily, will show to the disbelievers what they have done and We shall make them taste a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We give him a taste of mercy from Us after his affliction has befallen him, he is sure to say: 'This is my own. I do not think the Hour will ever come. And even if I am returned to my Lord, with Him there is for me the finest reward (Paradise)' Then, We shall tell the unbelievers what they did and let them taste a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We let him taste a mercy from Us, after the adversity that had afflicted him, he will say, “This is mine, and I do not think that the Hour is coming; and even if I am returned to my Lord, I will have the very best with Him.” We will inform those who disbelieve of what they did, and We will make them taste an awful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let him taste mercy from Us after an adversity which has touched him, he will surely say, \"This is [due] to me, and I do not think the Hour will occur; and [even] if I should be returned to my Lord, indeed, for me there will be with Him the best.\" But We will surely inform those who disbelieved about what they did, and We will surely make them taste a massive punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:50] And if (wa-la-in: the lām is for oaths) We let him taste, [if] We bestow on him, mercy, [such as] riches or good health, from Us after the harm, the hardship or tribulation, that had befallen him, he will surely say, ‘This is my due!, in other words, [it is] on account of what I do. I do not think that the Hour will ever set in, and even if (wa-la-in: the lām is for oaths) I am returned to my Lord, I will indeed have the best [reward] with Him’, namely, Paradise. But We will assuredly inform those who disbelieve of what they did, and assuredly We will make them taste a harsh chastisement (the lām [prefixed] in both verbs is that for oaths).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَئِنْ أَذَقْنَاهُ رَحْمَةً مِنَّا مِنْ بَعْدِ ضَرَّاءَ مَسَّتْهُ لَيَقُولَنَّ هَذَا لِي وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِنْ رُجِعْتُ إِلَى رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنَى فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُمْ مِنْ عَذَابٍ غَلِيظٍ (50)وفي الحديث : « لوْ أن لابن آدم واديين من ذهب لأحبّ لهما ثالثاً ، ولو أن له ثلاثة لأحبّ لهما رابعاً ، ولا يملأ عين ابن آدم إلاّ التراب » وقال تعالى : { وإنّه لِحُبّ الخير لشديد } \\[ العاديات : 8 \\] .والدعاء : أصله الطلب بالقول ، وهو هنا مجاز في الطلب مطلقاً فتكون إضافته إلى الخير من إضافة المصدر إلى ما في معنى المفعول ، أي الدعاء بالخير أو طلب الخير .ويجوز أن يكون الدعاء استعارة مكنية ، شبه الخير بعاقل يسأله الإنسان أن يُقبِل عليه ، فإضافة الدعاء من إضافة المصدر إلى مفعوله .وأما أن الإنسان يؤوس قنوط إن مسه الشر فذلك من خُلق قلة صبر الإنسان على ما يتعبه ويَشق عليه فيضجر إن لحقه شرّ ولا يوازي بين ما كان فيه من خير فيقول : لئن مسني الشرّ زمناً لقد حلّ بي الخير أزماناً ، فمن الحق أن أتحمل ما أصابني كما نعمت بما كان لي من خير ، ثم لا ينتظر إلى حين انفراج الشرّ عنه وينسى الإقبال على سؤال الله أن يكشف عنه الضر بل ييأس ويقنط غضباً وكبراً ولا ينتظر معاودة الخير ظاهراً عليه أثرُ اليأس بانكسار وحزن . واليأس فعل قلبي هو : اعتقاد عدم حصوله الميؤوس منه .والقُنوط : انفعال يدني من أثَر اليأس وهو انكسار وتضاؤل . ولم يذكر هنا أنّه ذو دعاء لله كما ذكر في قوله الآتي : { وإذا مسه الشرُّ فذو دعاء عريض } \\[ فصلت : 51 \\] . لأنّ المقصود أهل الشرك وهم إنّما ينصرفون إلى أصنامهم . وقد جاءت تربية الشريعة للأمّة على ذم القنوط ، قال تعالى حكاية عن إبراهيم { قال ومن يَقنَط من رحمة ربّه إلاّ الضَّالون } \\[ الحجر : 56 \\] ، وفي الحديث « انتظار الفرج بعد الشدّة عبادة » .فالآية وصفت خُلقين ذميمين : أحدهما خلق البطر بالنعمة والغفلة عن شكر الله عليها . وثانيهما اليأس من رجوع النعمة عند فقدها . وفي نظم الآية لطائف من البلاغة :الأولى : التعبير عن دوام طلب النّعمة بعَدم السآمة كما علمْتَه .الثانية : التعبير عن محبّة الخير بدُعاء الخير .الثالثة : التعبير عن إضافة الضر بالمسّ الذي هو أضعف إحساس الإصابة قال تعالى : { لا يَمَسُّهم السوء } \\[ الزمر : 61 \\] .الرّابعة : اقتران شرط مسّ الشر ب { إنْ } التي من شأنها أن تدخل على النادر وقوعُه فإن إصابة الشر الإنسانَ نادرة بالنسبة لما هو مغمور به من النعم .الخامسة : صيغة المبالغة في { يَؤُوس } .السّادسة : إتْباع { يؤوس } ب { قنوط } الذي هو تجاوز إحساس اليأس إلى ظاهر البدن بالانكسار ، وهو من شدّة يَأسه ، فحصلت مبالغتان في التّعبير عن يأسه بأنّه اعتقاد في ضميره وانفعال في سحناته . فالمشرك يتأصّل فيه هذا الخُلق ويتزايد باستمرار الزّمان . والمؤمن لا تزال تربية الإيمان تكفه عن هذا الخلق حتى يزول منه أو يكاد .ثم بينت الآية خلقاً آخر في الإنسان وهو أنّه إذا زال عنه كربه وعادت إليه النّعمة نسي ما كان فيه من الشّدة ولم يتفكر في لطف الله به فبطر النّعمةَ ، وقال : قد استرجعت خيراتي بحيلتي وتدبيري ، وهذا الخير حق لي حصلت عليه ، ثمّ إذا كان من أهل الشرك وهم المتحدث عنهم تراه إذا سمع إنذار النبي صلى الله عليه وسلم بقيام الساعة أو هجس في نفسه هاجس عاقبة هذه الحياة قال لمن يدعوه إلى العمل ليوم الحساب أو قال في نفسه { ما أظنّ السّاعة قائمة } ولئن فَرَضت قِيام السّاعة على احتمال ضعيف فإنّي سأجد عند الله المعاملة بالحسنى لأنّي من أهل الثراء والرفاهية في الدّنيا فكذلك سأكون يوم القيامة .وهذا من سوء اعتقادهم أن يحسبوا أحوال الدّنيا مقارنة لهم في الآخرة ، كما حكى الله تعالى عن العاصي بن وائل حين اقتضاه خبَّاب بن الأرتِّ مالاً له عنده من أجر صناعةِ سيف فقال له : حتى تكفر بمحمد؟ فقال خبَّاب : لا أكفر بمحمد حتى يميتك الله ويبعثك ، فقال : أوَ إنِّي لميّت فمبعوث؟ قال : نعم . فقال : لئن بعثني الله فسيكون لي مالي فأقضيك ، فأنزل الله تعالى : { أفرَأيت الذي كفَر بآياتنا وقال لأوتيَنَّ مالاً وولداً } الآيات من سورة مريم ( 77 ) .ولَعَل قوله : { ولئن رجعت إلى ربي إن لي عنده للحسنى } إنّما هو على سبيل الاستهزاء كما في مقالة العاصي بن وائل . وذِكر إنكار البعث هنا إدماج بذكر أحوال الإنسان المشرك في عموم أحوال الإنسان .وجيء في حكاية قوله { ولئن رجعت } بحرف ( إنْ ) الشرطية التي يَغلب وقوعها في الشرط المشكوك وقوعه لأنّه جعل رجوعه إلى الله أمراً مفروضاً ضعيف الاحتمال . وأما دخول اللام الموطئة للقسم عليه فمورد التحقيق بالقسم هو حصول الجواب لو حصل الشرط .وكذلك التأكيد ب { إن } ولام الابتداء مورده هو جواب الشرط ، وكذلك تقديم { لي } و { عنده } على اسم { إنَّ } هو لتقوّي ترتب الجواب على الشرط .والحسنى : صفة لموصوف محذوف ، أي الحالة الحسنى ، أو المعاملة الحسنى . والأظهر أن الحسنى صارت اسماً للإحسان الكثير أخذاً من صيغة التفضيل .واعلم أن الإنسان متفاوتة أفراده في هذا الخُلق المعزوّ إليه هنا على تفاوت أفراده في الغرور ، ولما كان أكثر النّاس يومئذٍ المشركين كان هذا الخلق فاشياً فيهم يقتضيه دين الشرك . ولا نظر في الآية لمن كان يومئذٍ من المسلمين لأنهم النادر ، على أن المسلم قد يخامره بعض هذا الخلق وترتسم فيه شِيَات منه ولكن إيمانه يصرفه عنه انصرافاً بقدر قوة إيمانه ، ومعلوم أنّه لا يبلغ به إلى الحد الذي يقول { وما أظنّ الساعة قائمة } ، ولكنه قد تجري أعمال بعض المسلمين على صورة أعمال من لا يظنّ أن الساعة قائمة مثل أولئك الذّين يأتون السيئات ثم يقولون : إن الله غفور رحِيم ، والله غني عن عذابنا ، وإذا ذكر لهم يوم الجزاء قالوا : ما ثَمّ إلا الخير ونحو ذلك ، فجعل الله في هذه الآية مذمّة للمشركين وموعظة للمؤمنين كمَداً للأوّلين وانتشالاً للآخرين .{ للحسنى فَلَنُنَبِّئَنَّ الذين كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُمْ مِّنْ عَذَابٍ } .تفريع على جملة { ويوم يناديهم أين شركائي } \\[ فصلت : 47 \\] وما اتصل بها أي فلنعلمنّهم بما عَمِلوا عَلناً يعلَمُون به أنّا لا يخفى علينا شيء مما عملوه وتقريعاً لهم .وقول : { الذين كفروا } إظهار في مقام الإضمار ، ومقتضى الظّاهر أن يقال : ولننبئنّهم بما عملوا ، فعدل إلى الموصول وصلته لما تؤذن به الصلة من علة استحقاقهم الإذاقة بما عملوا وإذاقة العذاب . وقوله : { ولنذيقنهم من عذاب غليظ } هو المقصود من التفريع .والغليظ حقيقته : الصلب ، قال تعالى : { فاستغلظ فاستوى على سوقه } \\[ الفتح : 29 \\] ، وهو هنا مستعار للقويّ في نوعه ، أي عذاب شديد الإيلام والتعذيب ، كما استعير للقساوة في المعاملة في قوله { واغلظ عليهم } \\[ التوبة : 73 \\] وقوله : { وليجدوا فيكم غلظة } \\[ التوبة : 123 \\] .والإذاقة : مجاز في مطلق الإصابة في الحسّ لإطماعهم أنّها إصابة خفيفة كإصابة الذوق باللّسان . وهذا تجريد للمجاز كما أن وصفه بالغليظ تجريد ثان فحصل من ذلك ابتداء مُطمِع وانتهاء مُؤيِس .\n\n",
      "translations": [
        {
          "translation": "(And verily, if We cause him to taste mercy) through wealth and offspring (after some hurt that hath touched him) after being touched by some hardship, (he will say: This is my own) because of some goodness which Allah knows that I have in me; (and I deem not that the Hour will ever rise) as claimed by Muhammad (pbuh); thus denying the resurrection, (and if I am brought back to my Lord) as Muhammad (pbuh) says, (I surely shall be) in the Hereafter (better off with Him) I will enter Paradise; this is what 'Utbah Ibn Rabi'ah and his host said. (But We verily shall tell those who disbelieve (all) that they did) in their state of disbelief, (and We verily shall make them taste hard punishment) a severe punishment in hell: one sort of punishment after another.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية يأسه وقنوطه عن مقتضى فضلنا وجودنا { لَئِنْ أَذَقْنَاهُ رَحْمَةً } ووفرناها عليه\n بحيث تسري في جميع أجزائها مع كونها تفضلاً { مِّنَّا } بلا اقتراف { مِن } جانبه سوى أنه { بَعْدِ ضَرَّآءَ مَسَّتْهُ } لحقته أوائلها\n إذ المساس يحصل بمجرد الملاقاة { لَيَقُولَنَّ } معرضاً عن الله: { هَـٰذَا لِي } وأنا أستحق بها لاحتمال الشدائد ولكمال فضلي وعلمي\n أو هذا لي بمقتضى ذاتي { وَ } بالجملة: { مَآ أَظُنُّ ٱلسَّاعَةَ } الموهومة الموعودة { قَآئِمَةً } أتية { وَلَئِن } فرضت وقوعها وقيامها على الوجه الذي زعم الرسل المدعون\n ونطقت الكتب المزورة المفترية { رُّجِعْتُ إِلَىٰ رَبِّيۤ } كما زعموا { إِنَّ لِي } أي: ثبت وتحقق لي { عِندَهُ } سبحانه { لَلْحُسْنَىٰ } أي: الحالة التي هي أحسن الحالات وأكمر الكرامات\n لاستحقاقي بها واقتضاء ذاتي: إياها\n وإنما يقول ما يقول استهزاءً وتهكماً\n\n{ فَلَنُنَبِّئَنَّ } ونخبرن حين الجزاء الكافرين { ٱلَّذِينَ كَفَرُواْ } بوفور قدرتنا على وجوه الانتقام { بِمَا عَمِلُواْ } من الجرائم العظام وكبائر الآثام { وَلَنُذِيقَنَّهُمْ } ونحيطن عليهم { مِّنْ عَذَابٍ غَلِيظٍ } [فصلت: 50] مؤلم فظيع فجيع\n لا يمكنهم الخلاص عنه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما أظنُّ الساعةَ قائمةً } أي: ما أظنها تقوم فيما سيأتي\n { ولئن رُّجِعْتُ إِلى ربي } كما يقول المسلمون\n { إِنَّ لي عنده لَلْحُسْنَى } أي: الحالة الحسنى من الكرامة والنعمة\n أو: الجنة\n قاس أمر الآخرة على أمر الدينا لأن ما أصابه من نِعَمِ الدنيا\n زعم أنه لاستحقاقه إياها\n وأن نِعَم الآخرة كذلك\n وهذا غرور وحمق\n الرجاء ما قارنه عمل\n وإلا فهو أُمنية\n\n \" الجاهل مَن أَتْبَعَ نَفْسه هواها\n وتمنّى على الله\n والكيِّسُ مَن دَانَ نفسه\n وعَمِلَ لما بعد الموتِ \"\n \n{ فلننبئَنَّ الذين كفروا بما عَمِلُوا } أي: فلنخبرنهم بحقيقة ما عملوا من الأعمال الموجبة للعذاب\n { ولَنُذِيقَنَّهم من عذابٍ غليظٍ } شديد\n لا يفتر عنهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:24",
      "similarity": 0.5404671947358631
    },
    {
      "verse": "9:123",
      "similarity": 0.47157819951242497
    },
    {
      "verse": "11:58",
      "similarity": 0.44562011410986635
    },
    {
      "verse": "9:73",
      "similarity": 0.3935741448371314
    },
    {
      "verse": "66:9",
      "similarity": 0.3935741448371314
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}