{
  "chapter": "فصلت",
  "text": "وقالوا۟ قلوبنا فى اكنة مما تدعونا اليه وفى ءاذاننا وقر ومنۢ بيننا وبينك حجاب فاعمل اننا عملون",
  "translations": [
    {
      "translation": "They say, 'Our hearts are covered up against what you call us to and there is a heaviness in our ears. There is a screen between us and you. So act - we are certainly acting.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"Our hearts are immured against what you call us to. There is a deafness in our ears, and a veil lies between us and you. So act (your way), we are acting (ours).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “Our hearts are securely wrapped up against what you call us to, and in our ears is a heaviness, and between you and us there is a veil. So act; we too are acting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Our hearts are covered against and our ears are deaf to whatever you (Muhammad) invite us to. There is a barrier between us and you. So act as you please and we shall act as we please\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Our hearts are covered against the affair you call us to, and there is deafness in our ears, and there is a barrier between us and you – therefore mind your own business, we are minding ours.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Our hearts are under coverings from that to which you invite us; and in our ears is deafness, and between us and you is a screen, so work you (on your way); verily, we are working (on our way).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Our hearts are under coverings from that to which you call us, and there is a heaviness in our ears, and a veil hangs between us and you, so work, we too are working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Our hearts are veiled from what thou callest us to, and in our ears is a heaviness, and between us and thee there is a veil; so act; we are acting!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Our hearts are protected from that unto which thou (O Muhammad) callest us, and in our ears there is a deafness, and between us and thee there is a veil. Act, then. Lo! we also shall be acting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Our hearts are encased against that to which you call us, and there is a heaviness in our ears, and there is a barrier between us, so do as you will and so shall we.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: our hearts are under veils from that whereUnto thou callest us, and in our ears there is heaviness, and betwixt us and thee there is a curtain; work thou then, verily we are Workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Our hearts are in veils [which shut them off] from what you invite us to, and there is a deafness in our ears, and there is a curtain between us and you. So act [as your faith requires]; we too are acting [according to our own].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Our hearts are under veils, (concealed) from that to which thou dost invite us, and in our ears in a deafness, and between us and thee is a screen: so do thou (what thou wilt); for us, we shall do (what we will!)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Our hearts are under coverings (screened) from that to which you invite us, and in our ears is deafness, and between us and you is a screen, so work you (on your way); verily, we are working (on our way).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Our hearts are veiled from that to which you call us, and in our ears there is heaviness. And between us and you is a veil. So work (as you will) and we are working'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Our hearts are screened from what you call us to, and in our ears is deafness, and between us and you is a barrier. So do what you want, and so will we.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Our hearts are within coverings from that to which you invite us, and in our ears is deafness, and between us and you is a partition, so work; indeed, we are working.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:5] And they say, to the Prophet, ‘Our hearts are veiled, [they are] masked, from that to which you call us, and in our ears there is a deafness and between us and you there is a partition, a variance over religion, so act, according to your religion; indeed we shall be acting!’, according to our religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِمَّا تَدْعُونَا إِلَيْهِ وَفِي آَذَانِنَا وَقْرٌ وَمِنْ بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَاعْمَلْ إِنَّنَا عَامِلُونَ (5)عطف { وقالوا } على { فأعرض } \\[ فصلت : 4 \\] أو حالٌ من { أكثرهم } \\[ فصلت : 4 \\] أو عطف على { لا يَسْمَعُونَ } \\[ فصلت : 4 \\] ، أو حال من ضميره ، والمعنى : أنهم أعرضوا مصرحين بقلة الاكتراث وبالانتصاب للجفاء والعداء . وهذا تفصيل للإعراض عما وُصف به القرآن من الصفات التي شأنها أن تقربهم إلى تلقيه لا أن يَبعدوا ويعرضوا وقد جاء بالتفصيل بأقوالهم التي حرمتهم من الانتفاع بالقرآن واحداً واحداً كما ستعلمه .والمراد بالقلوب : العقول ، حكي بمصطلح كلامهم قولهم إذ يطلقون القلب على العقل .والأكنة : جمع كنان مثل : غطاء وأغطية وزناً ومعنى ، أثبتت لقلوبهم أغطية على طريقة التخييل ، وشُبهت القلوب بالأشياء المغطّاة على طريقة الاستعارة المكنية . ووجه الشبه حيلولة وصول الدعوة إلى عقولهم كما يحول الغطاء والغلاف دون تناول ما تحته . ومَا يدعوهم إليه يعم كل ما دعاهم إليه من المدلولات وأدلتها ، ومنها دلالة معجزة القرآن وما تتضمنه من دلالة أمية الرسول صلى الله عليه وسلم من نحو قوله تعالى : { وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك } \\[ العنكبوت : 48 \\] .وجعلت القلوب في أكنة لإِفادة حرف { في } معنى إحاطة الظرف بالمظروف . وكذلك جعل الوَقر في القلوب لإِفادة تغلغله في إدراكهم .و ( مِن ) في قوله : { مِمَّا تَدْعُونَا إلَيْهِ } بمعنى ( عن ) مثل قوله تعالى : { فويل للقاسية قلوبهم من ذكر اللَّه } \\[ الزمر : 22 \\] وقوله : { قد كنا في غفلة من هذا } \\[ الأنبياء : 97 \\] ، والمعنى : قلوبنا في أكنة فهي بعيدة عما تدعونا إليه لا ينفذ إليها .والوَقر بفتح الواو : ثقل السمع وهو الصمم ، وكأنَّ اللغة أخذته من الوِقر بكسر الواو ، وهو الحِمل لأنه يثقل الدَّابة عن التحرك ، فأطلقوه على عدم تحرك السمع عند قرع الصوت المسموع ، وشاع ذلك حتى ساوى الحقيقة ففتحوا له الواو تفرقة بين الحقيقة والمجاز ، كما فرقوا بين العَضّ الحقيقي وعظِّ الدهر بأن صيروا ضادهُ ظاء . وقد تقدم ذكر الأكنة والوقر في قوله : { وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقراً } في الأنعام ( 25 ) وفي سورة الإِسراء ( 46 ) .والحجاب : الساتر للمرئيّ من حائط أو ثوب . أطلقوا اسم الحجاب على ما يمنع نفوسهم أن يأخذوا بالدين الذي جاء به النبي صلى الله عليه وسلم من كراهية دينه وتجافي تقلده بجامععِ أن الحجاب يحول بين الرائي والمَرْئِيّ فلا ينظر أحدهما الآخر ولا يصل إليه ، ومرادهم البراءة منه . مثل نبوّ قلوبهم عن تقبُّل الإسلام واعتقاده بحال ما هو في أكنّة ، وعدمَ تأثر أسماعهم بدعوته بصَم الآذان ، وعدمَ التقارب بين ما هم عليه وما هو عليه بالحجاب الممدود بينه وبينهم فلا تلاقيَ ولا ترائيَ .وقد جمعوا بين الحالات الثلاث في التمثيل للمبالغة في أنهم لا يقبلون ما يدعوهم إليه . واجتلابُ حرف { مِن } في قوله : { وَمِن بَيْنِنَا وَبَيْنِك حِجَابٌ } لتقوية معنى الحجاب بين الطرفين وتمكن لازمه الذي هو بُعد المسافة التي بين الطرفين لأن { مِن } هذه زائدة لتأكيد مضمون الجملة .وضمير { بيننا } عائد إلى ما عاد إليه ضمير { أكثرهم } \\[ فصلت : 4 \\] .وعطف وبينك } تأكيد لأن واو العطف مغنية عنه وأكثر استعمال ( بين ) أن يكون معطوفاً عليه مثله كقوله تعالى : { قال يا ليت بيني وبينك بعد المشرقين } \\[ الزخرف : 38 \\] .وقد جعل ابن مالك ( من ) الداخلة على ( قبل ) و ( بعد ) زائدة فيكون ( بَين ) مقيساً على ( قبل ) و ( بعد ) لأن الجميع ظروف . وهذا القول المحكي عنهم في القرآن ب { قالوا } يحتمل أن يكون القرآن حكاه عنهم بالمعنى ، فجمع القرآن بإيجازه وبلاغته ما أطالوا به الجدال وأطنبوا في اللجاج ، ويحتمل أنه حكاه بلفظهم فيكون مما قاله أحد بلغائهم في مجامعهم التي جمعت بينهم وبين النبي صلى الله عليه وسلم وهذا ظاهر ما في سيرة ابن إسحاق ، وزعم أنهم قالوه استهزاء وأن الله حكاه في سورة الكهف .ويحتمل أن يكونوا تلقفوه ممّا سمعوه في القرآن من وصف قلوبهم وسمعهم وتباعدهم كقوله : { وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقراً } في سورة الإسراء ( 46 ) ، فإن سورة الإسراء معدودة في النزول قبل سورة فصلت . وكذلك قوله تعالى : { وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجاباً مستوراً } في سورة الإِسراء ( 45 ) أيضاً ، فجمعوا ذلك وجادلوا به الرسول . فيكون ما في هذه الآية من البلاغة قد اقتبسوه من آيات أخرى . قيل : إن قائله أبو جهل في مجمع من قريش فلذلك أسند القول إليهم جميعاً لأنهم مشائعون له .وقد جاء في حكاية أقوالهم ما فيه تفصيل ما يقابل ما ذُكر قبله من صفات القرآن وهي { تَنزِيلٌ مِنَ الرحمنن الرَّحِيممِ كتاب فُصِّلَتْ ءاياته قُرْءَاناً عَرَبِياً } \\[ فصلت : 2 ، 3 \\] ، فإن كونَه تنزيلاً من الرحمان الرحيم يستدعي تفهمه والانتفاع بما فيه ، فقوبل بقولهم : قُلُوبُنَا فِي أكِنَّةٍ مِمَّا تَدْعُونَا إليهِ } وكونَهُ فُصلت آياته يستدعي تلقّيها والاستماعَ إليها فقوبل بقولهم : { في آذاننا وقر } ، أي فلا نسمع تفصيله ، وكونَه قرآناً عربياً أشد إلزاماً لهم بفهمه فقوبل ذلك بما يقطع هذه الحجة وهو { من بيننا وبينك حجاب } أي فلا يصل كلامه إليهم ولا يتطرق جانبهم ، فهذه تفاصيل إعراضهم عن صفات القرآن .وقولهم : { فاعْمَل إنَّنَا عاملون } تفريع على تأييسهم الرسول من قبولهم دعوته وجعل قولهم هذا مقابِل وصف القرآن بأنه بَشير ونذير لظهور أنه تعين كونه نذيراً لهم بعذاب عظيم لأنهم أعرضوا فحكي ما فيه تصريحهم بأنهم لا يعبأُون بنذارته فإن كان له أذى فليؤذهم به وهذا كقول فرعون : «ذَرَوني أَقتُل موسى ولْيَدْعُ ربه» .وحذف مفعولا ( اعمل ) و { عاملون } ليعُمّ كل ما يمكن عمله كل مع الآخر ما يناسبه . والأمر في قوله : { فاعمل } مستعمل في التسوية كقول عنترة بن الأخرس المعْنِي: ... أَطِلْ حملَ الشَّناءة لِي وبُغضيوعِشْ ما شئتَ فانظر من تضيرُ ... وكقوله تعالى : { اعملوا ما شئتم إنه بما تعملون بصير } \\[ فصلت : 40 \\] .والخَبر في قولهم : { إنَّنَا عاملون } مستعمل في التهديد .\n\n",
      "translations": [
        {
          "translation": "(And they) the disbelievers of Mecca, Abu Jahl and his host (say: Our hearts are protected) our hearts are shielded (from that unto which thou (0 Muhammad) callest us) i.e. the Qur'an and the profession of Allah's divine Oneness, (and in our ears there is a deafness) we do not hear what you say to us, (and between us and thee there is a veil) they covered their heads with their clothes and then said: \"0 Muhammad! There is between us and you a veil and we do not hear what you say\", to mock him. (Act) according to your religion for your own god so that we are destroyed, (then. Lo! we also shall be acting) for our deities, following our religion, in order to destroy you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإعراضهم عن استماع كلمة الحق والالتفات إليه { قَالُواْ } على سبيل التهكم والتسخر: { قُلُوبُنَا } التي في وعاء الإيمن والاعتقاد { فِيۤ أَكِنَّةٍ } وأغيطة كثيفة وغشاوة غليظة { مِمَّا تَدْعُونَا إِلَيْهِ } من المعرفة والتوحيد\n لا نتنبه ولا نتفطن بحقيته { وَ } أيضاً { فِي آذانِنَا } التي هي وسائل العظة والتذكير { وَقْرٌ } صمم مانع عن استماع آياتك الدالة على صدقك في دعواك المبينة المثبتة لدعواك\n\n\n{ وَ } بالجملة: حال { مِن بَيْنِنَا وَبَيْنِكَ } أيها المؤيَّد بالوحي والإلهام { حِجَابٌ } عظيم يمنعنا عما تدعونا إليه\n بحث لا يتيسر لنا رفعه\n ولا نقدر على انكشافه { فَٱعْمَلْ } أيها المدعي بمقتضى ما أوحاك إليك ربك وألهمك عليه { إِنَّنَا } أيضاً { عَامِلُونَ } [فصلت: 5] بما تيسر لنا ووفقنا عليه\n إذ كل ميسر لما خُلق له",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن بيننا وبينك حجاب } غليظ\n وستر مانع يمنعنا من التواصل إليك\n و من للدلالة على أن الحجاب مبتدى منهم ومنه بحيث استوعب ما بينهما من المسافة المتوسطة\n ولم يبق ثمَّ فراغ أصلاً\n وهذه تمثيلات لنبو قلوبهم عن إدراك الحق وقبوله\n ومج أسماعهم له\n كأنَّ بها صمماً وثِقلاً منعهم من موافقتهم لرسول الله صلى الله عليه وسلم ثم قالوا: { فاعمل } على دينك وإبطال ديننا\n { إِننا عاملون } على ديننا\n لا نفارقه أبداً\n { قُلْ إِنما أنا بشر مثلُكم يُوحَى إِليَّ أَنَّما إِلهكُم إِله واحد } \n هذا تلقين للجواب عنه\n أي: لستُ من جنسٍ مباينٍ لكم حتى يكون بيني وبينكم حجاب\n وتباين مصحح لتباين الأعمال والأديان\n كما ينبىء عنه قوله: { فاعلم إننا عاملون } \n بل إنما أنا بشر مثلكم\n مأمور بما أُمرتم به من التوحيد\n حيث أخبرنا جميعاً بأن إلهنا واحد\n فالخطاب في \" إلهكم \" محكي منتظم للكل\n لا أنه خطاب منه ـ عليه الصلاة والسلام ـ للكفرة\n وقيل: لمّا دعاهم إلى الإيمان\n قالوا: إنا نراك مثلنا\n تأكل وتشرب\n فلو كنتَ رسولاً لاستغنيت عن ذلك\n فأنزل: { قل إنما أنا بشر\n\n\n\n } الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:57",
      "similarity": 0.5792051067884806
    },
    {
      "verse": "17:46",
      "similarity": 0.5704547797009832
    },
    {
      "verse": "6:25",
      "similarity": 0.5608191153159189
    },
    {
      "verse": "83:15",
      "similarity": 0.48501877202589505
    },
    {
      "verse": "19:17",
      "similarity": 0.4708173366775434
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}