{
  "chapter": "فصلت",
  "text": "الا انهم فى مرية من لقاء ربهم الا انه بكل شىء محيطۢ",
  "translations": [
    {
      "translation": "What! Are they in doubt about the meeting with their Lord? What! Does He not encompass all things?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In truth they are in doubt that they will ever face their Lord. Do they not know that He surrounds all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo, they are in doubt concerning their meeting with their Lord. Surely He fully encompasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly doubtful about their meeting with their Lord. God indeed encompasses all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! They are certainly doubtful regarding the meeting with their Lord; pay heed! He encompasses all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo, Verily, they are in doubt concerning the meeting with their Lord. Verily, He is surrounding all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now surely they are in doubt as to the meeting of their Lord; now surely He encompasses all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they not in doubt touching the encounter with their Lord? Does He not encompass everything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How! Are they still in doubt about the meeting with their Lord? Lo! Is not He surrounding all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they still doubt that they will ever meet their Lord. Surely, He encompasses all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! they are in doubt concerning the meeting with their Lord: Lo! He Is of everything the Encompasser!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they are in doubt about the encounter with their Lord! Indeed, He embraces all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah indeed! Are they in doubt concerning the Meeting with their Lord? Ah indeed! It is He that doth encompass all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! They are in doubt concerning the Meeting with their Lord? (i.e. Resurrection after their deaths, and their return to their Lord). Verily! He it is Who is surrounding all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they not in doubt concerning the Meeting with their Lord? Attention, He encompasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they are in doubt about the encounter with their Lord. Surely He comprehends everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, they are in doubt about the meeting with their Lord. Unquestionably He is, of all things, encompassing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:54] Nay, verily they are in doubt about the encounter with their Lord, because they deny the Resurrection. Nay, verily He, exalted be He, encompasses all things, in knowledge and in power, and so He will requite them for their disbelief. Meccan, except for verses 23, 24, 25 and 26, which are Medinese; it consists of 53 verses revealed after [sūrat] Fussilat.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How! Are they) i.e. the people of Mecca (still in doubt about the meeting with their Lord) about resurrection after death? (Lo! Is not He surrounding all things) does He not know all things concerning their works and punishment?' And of the surah in which (Ha. Mim. 'Ayn. Sin. Qaf) are mentioned, which is all Meccan except for seven verses, namely, (I ask of you no fee therefore, save loving kindness among kinsfolk....) and (And those who argue concerning Allah after He hath been acknowledged, their argument hath no weight with their Lord...) as well as five verses which were revealed about Abu Bakr al-Siddiq and his fellow believers from (And those who shun the worst of sins and indecencies...) to (... lo! that, verily, is (of) the steadfast heart of things) which are Medinan, and it consists of 50 verses, 886 words and 3,588 letters: Surah 42: Counsel (al-Shura) And of the surah in which (Ha. Mim. 'Ayn. Sin. Qaf) are mentioned, which is all Meccan except for seven verses, namely, (/ ask of you no fee therefore, save loving kindness among kinsfolk....) and {And those who argue concerning 557 Allah after He hath been acknowledged, their argument hath no weight with their Lord...) as well as five verses which were revealed about Abu Bakr al-Siddiq and his fellow believers from [And those who shun the worst of sins and indecencies...) to (... lot that, verily, is (of) the steadfast heart of things) which are Medinan, and it consists of 50 verses, 886 words and 3,588 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلاَ إِنَّهُمْ فِي مِرْيَةٍ مِّن لِّقَآءِ رَبِّهِمْ } فالمِريةُ: الشَّكُ\n وقال: لِقاءُ رَبِّهم: ثَوابُ رَبِّهم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, they are in doubt about a meeting with their Lord} [means that] doubt is their state.\n\n\nAnd he said, \"The meeting with their Lord is the reward of their Lord.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم نوَّر سبحانه ما نبه عليه على سبيل التعجب والتلويح تأكيدً ومبالغة وزيادة إيضاح، فقال: { أَلاَ إِنَّهُمْ } بعدما أضاء لهم شمس الذات من مرايا الكائنات { فِي مِرْيَةٍ } شك وارتياب { مِّن لِّقَآءِ رَبِّهِمْ } فيها ومطالعة وجهه الكريم عنها { أَلاَ إِنَّهُ } بذاته حسب شئونه وتطوراته المتفرعة على أسمائه وصفاته { بِكُلِّ شَيْءٍ } من مظاهره ومصنوعاته { مُّحِيطٌ } [فصلت: 54] بالاستقلال والانفراد، إحاطة ذاتية بلا شوب شركة؛ إذ لا موجود سواه، ولا إله إلا هو\n\n\nخاتمة السورة\n\n\n\nعليك أيها السالك المترقب لشهود الحق من ذرائر عموم الجمال والمظاهر الظاهرة في الآفاق والأنفس أن تصفي ضميرك أولاً من وساوس مطلق الأوهام، والخيالات العائقة من التوجه إلى صرافة الوحدة، وتجلي خُلدك عن الإضافات الصارفة عنه\n\n\n\n\nفلك أيضاً أن تكون في نفسك متوجهاً إلى ربك الذي هو حصة لا هوتك، ونشأة جبروتك، خالياً عنك وعن لوازم ناسوتك وعوارض بشريتك بالمرة، بحيث لا شعور لك عما جرى على هويتك أصلاً\n\n\n\n\nوبالجملة: كن فانياً في الله، باقياً ببقائه، ناظراً بنوره إلى وجهه الكريم تفز بنعيم الجنات وعظيم اللذات، مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أَلا إِنهم في مِريةٍ } شك عظيم { من لقاءِ ربهم } فلذلك أنكروا القرآن، { ألا إِنه بكل شيءٍ محيط } عالم بجميع الأشياء وتفاصيلها، وظواهرها، وبواطنها، فلا يخفى عليه خافية منهم، وهو مجازيهم على كفرهم وشكهم، لا محالة\n  الإشارة: قد اشتملت الآية على مقام الاستدلال في مقام الإيمان، وعلى مقام العيان في مقام الإحسان، أي: سنُريهم آياتنا الدالة على وجودنا في الآفاق، وفي أنفسهم، أي: في العوالم المنفصلة والمتصلة، حتى يتبين لهم أنه الحق، أي: وجوده حق، لأن الصنعة قطعاً تحتاج إلى صانع، ثم رقَّاهم إلى مقام المراقبة بقوله: { أوَلم يكف بربك أنه على كل شيء شهيد } ، ثم زاد إلى المشاهدة بقوله: { ألا إِنهم } أي: أهل الجهل بالله، { في مرية من لقاء ربهم } في الدنيا، بحصول الفناء، فيفنى وجود العبد في وجود الحق، ألا إنه بكل شيء محيط، فبحر العظمة أحاط بكل شيء، وأفنى كل شيء، ولم يبقَ مع وجوده شيء\n\n\nوفي الحِكَم: \" ما حجبك عن الله وجود موجود معه إذ لا شيء معه، وإنما حجبك توهُّم موجود معه \" وقال أيضاً: \" الأكوان ثابتة بإثباته، ممحوة بأحدية ذاته، فأحدية الذات محت وجودَ الأشياء كلها، ولم يبقَ إلا القديم الأزلي\n وقال القطب ابن مشيش لأبي الحسن رضي الله عنه: يا أبا الحسن، حدّد بصر الإيمان تجد الله في كل شيء، وعند كل شيء، ومع كل شيء، وقبل كل شيء، وبعد كل شيء، وفوق كل شيء، وتحت كل شيء، وقريباً من كل شيء، ومحيطاً بكل شيء، بقُرب هو وصفه، وبحيطة هي نعته، وعَد عن الظرفية والحدود، وعن الأماكن والجهات، وعن الصحبة والقرب في المسافات، وعن الدور بالمخلوقات، وأمحق الكل بوصفه الأول والآخر والظاهر والباطن، وهو هو هو، كان الله ولا شيء معه، وهو الآن على ما عليه كان\n هـ\n وقوله: وعد عن الحجهات، جاوز عن اعتقادها إذ لا ظرف، ولا حد، ولا مكان، ولا جهة، إذ الكل عظمة ذاته، وأنوار صفاته، والحد إنما يتصور في المحدود، ولا حد لعظمة ذاته ولا نهاية، ولا يحصرها مكان، ولا جهة إذ الكل منه وإليه\n وبالله التوفيق، وهو الهادي إلى سواء الطريق، وصلّى الله على سيدنا ومولانا محمد، عين بحر التحقيق، وعلى آله وصحبه، وسلّم تسليماً\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:50",
      "similarity": 0.5557906369448785
    },
    {
      "verse": "3:60",
      "similarity": 0.5551526321720798
    },
    {
      "verse": "2:147",
      "similarity": 0.5407218027165996
    },
    {
      "verse": "53:12",
      "similarity": 0.5403826901186922
    },
    {
      "verse": "15:63",
      "similarity": 0.5311181699999681
    }
  ]
}