{
  "chapter": "فصلت",
  "text": "سنريهم ءايتنا فى الءافاق وفى انفسهم حتى يتبين لهم انه الحق اولم يكف بربك انه على كل شىء شهيد",
  "translations": [
    {
      "translation": "We will show them Our Signs on the horizon and within themselves until it is clear to them that it is the truth. Is it not enough for your Lord that He is a witness of everything?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will show Our signs to them in the horizons of the external world and within themselves, until it becomes clear to them that it's the truth. Is your Lord not sufficient? He is a witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon shall We show them Our Signs on the horizons and in their own beings until it becomes clear to them that it is the Truth. Is it not enough that your Lord is a witness over everything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall (continue to) show them Our evidence in the world and within their souls until it becomes clear that the Quran is the truth. Is it not sufficient for you that your Lord witness all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall now show them Our signs in all the directions and within their own selves until it becomes clear to them that it is certainly the truth; is not your Lord sufficient as a Witness over all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will show them Our signs in the universes, and within themselves, until it becomes manifest to them that this is the truth. Is it not sufficient in regard to your Lord that He is a Witness over all things\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will soon show them Our signs in the Universe and in their own souls, until it will become quite clear to them that it is the truth. Is it not sufficient as regards your Lord that He is a witness over all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall show them Our signs in the horizons and in themselves, till it is clear to them that it is the truth. Suffices it not as to thy Lord, that He is witness over everything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall show them Our portents on the horizons and within themselves until it will be manifest unto them that it is the Truth. Doth not thy Lord suffice, since He is Witness over all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall show them Our signs in the universe and within themselves, until it becomes clear to them that this is the Truth. Is it not enough that your Lord is the witness of all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon We shall shew them Our signs in the regions and in their ownselves until it becometh manifest Unto them that it is the truth. Sufficeth it not in regard to thy Lord, that He is over everything Witness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon We shall show them Our signs in the horizons and in their own souls until it becomes clear to them that He is the Real. Is it not sufficient that your Lord is witness to all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon will We show them our Signs in the (furthest) regions (of the earth), and in their own souls, until it becomes manifest to them that this is the Truth. Is it not enough that thy Lord doth witness all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will show them Our Signs in the universe, and in their ownselves, until it becomes manifest to them that this (the Quran) is the truth. Is it not sufficient in regard to your Lord that He is a Witness over all things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will show them Our signs in all the horizons and in themselves, until it is clear to them that it is the truth. Is it not sufficient that your Lord is witness over everything'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will show them Our proofs on the horizons, and in their very souls, until it becomes clear to them that it is the truth. Is it not sufficient that your Lord is witness over everything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. But is it not sufficient concerning your Lord that He is, over all things, a Witness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:53]   We shall show them Our signs in the horizons, [in all] the regions of the heavens and the earth, in the way of the luminous [celestial] bodies, [the varieties of] vegetation and trees, and in their own souls, in the way of the exquisite craftsmanship and unique wisdom [inherent in their creation], until it becomes clear to them that it, namely, the Qur’ān, is the truth, revealed by God, informing of the Resurrection, the Reckoning and the Punishment, so that they [realise that they] will be punished for their disbelief in it and in the one who has come with it. Is it not sufficient that your Lord (bi-rabbika, governs the verb yakfi, ‘sufficient’) is witness to all things? (annahu ‘alā kulli shay’in shahīd, substitutes for bi-rabbika). In other words, is not sufficient proof of your truthfulness that nothing whatsoever can be hidden from God?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We shall show them) We shall show, Muhammad, to the people of Mecca (Our portents) Our signs, marvels, divine Oneness and power (on the horizons) in different parts of the earth in the form of the ruined remains of the nations who came before them, such as 'Aad, Thamud and those who came after them (and within themselves) and We shall show them in themselves kinds of illnesses, pains, misfortunes and other things (until it will be manifest unto them that it is the Truth) until it is clear to them that what the Prophet says to them is true. (Doth not thy Lord suffice) is it not enough that which Allah has made clear to them of the events of past nations without showing them their own destruction, (since He is Witness over all things) of their works?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { سَنُرِيهِمْ } أي: المجبولين على فطرة التوحيد\n المخلوقين على نشأة الإيمان والعرفان\n الموقنين على كمال الكشف والعيان { آيَاتِنَا } أي: دلائل توحيدنا الدالة على وحدة ذاتنا الظاهرة { فِي ٱلآفَاقِ } أي: ذرائر الأكوان الخارجة عن نفوسهم المدركة بآلاتهم وحواسهم\n سميت بها\n لطلوع شمس الحقيقة الحقية منها\n وظهورها عليها { وَفِيۤ أَنفُسِهِمْ } أي: ذواتهم التي هي أدل دليل على معرفة الحق ووحدة الحق\n\n\nلذلك قال أصدق القائلين وأكمل الكاملين: \" من عرف نفسه فقد عرف ربه \"\n\n\nوإنما نريهم ما نريهم { حَتَّىٰ يَتَبَيَّنَ لَهُمْ } ويظهر دونهم وينكشف عليهم { أَنَّهُ } أي: الأمر الظاهر في الآفاق والأنفس { ٱلْحَقُّ } الحقيق بالتحقق والثبوت لصرافة وحدته الذاتية والقرآن المعجز أيضاً\n ومن جملة مظاهره وصفاته\n\n\nثم لما أشار سبحانه إلى وحدة ذاته بالنسبة إلى عموم عباده\n أراد أن ينبه على المستكشفين من أرباب المحبة والولاء\n الوالهين في مطالعة وجهه الكريم\n فخاطب حبيبه صلى الله عليه وسلم\n إذ هو الحري بأمثال هذه الخطابات\n فقال مستفهماً على سبيل التعجب: { أَوَلَمْ يَكْفِ بِرَبِّكَ } أي: أتشكون في وجود مربيك يا أكمل الرسل ومربيهم\n وظهوره وتحققه\n ولم يكف دليلاً { أَنَّهُ } بذاته وعموم أسمائه وصفاته { عَلَىٰ كُلِّ شَيْءٍ } مما لاح عليه برق وجوده ورشاشة نوره { شَهِيدٌ } [فصلت: 53] حاضر غير مغيَّب عنه\n\n\nوبالجملة: أو لم يكف لهم دليلاً على تحقق الحق وحضوره مع كل شيء من مظاهره ومصنوعاته\n\n\nثم نوَّر سبحانه ما نبه عليه على سبيل التعجب والتلويح تأكيدً ومبالغة وزيادة إيضاح\n فقال: { أَلاَ إِنَّهُمْ } بعدما أضاء لهم شمس الذات من مرايا الكائنات { فِي مِرْيَةٍ } شك وارتياب { مِّن لِّقَآءِ رَبِّهِمْ } فيها ومطالعة وجهه الكريم عنها { أَلاَ إِنَّهُ } بذاته حسب شئونه وتطوراته المتفرعة على أسمائه وصفاته { بِكُلِّ شَيْءٍ } من مظاهره ومصنوعاته { مُّحِيطٌ } [فصلت: 54] بالاستقلال والانفراد\n إحاطة ذاتية بلا شوب شركة\n إذ لا موجود سواه\n ولا إله إلا هو\n\nخاتمة السورة\n\nعليك أيها السالك المترقب لشهود الحق من ذرائر عموم الجمال والمظاهر الظاهرة في الآفاق والأنفس أن تصفي ضميرك أولاً من وساوس مطلق الأوهام\n والخيالات العائقة من التوجه إلى صرافة الوحدة\n وتجلي خُلدك عن الإضافات الصارفة عنه\n\n\nفلك أيضاً أن تكون في نفسك متوجهاً إلى ربك الذي هو حصة لا هوتك\n ونشأة جبروتك\n خالياً عنك وعن لوازم ناسوتك وعوارض بشريتك بالمرة\n بحيث لا شعور لك عما جرى على هويتك أصلاً\n\n\nوبالجملة: كن فانياً في الله\n باقياً ببقائه\n ناظراً بنوره إلى وجهه الكريم تفز بنعيم الجنات وعظيم اللذات\n مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { حتى يتبين لهم } بذلك { أنه الحقُّ } أي: القرآن\n أو: الإسلام\n أو: التوحيد\n { أوَلَمْ يكف بربك أنه على كل شيءٍ شهيدٌ } \n توبيخ على تردُّدهم في شأن القرآن\n وعنادهم المحوج إلى إراءة الآيات\n وعدم اكتفائهم بإخباره تعالى\n والهمزة للإنكار\n والواو للعطف على مقدّر يقتضيه المقام\n أي: أَلَمْ يُغن ولم يكف ربك\n والباء: مزيدة للتأكيد\n ولا تكاد تزاد إلا مع \" كفى \"\n و أنه\n\n\n الخ: بدل منه\n أي: ألم يُغنهم عن إراءة الآيات المبنية لحقيّة القرآن ولم يكفهم في ذلك أنه تعالى شهيد على كل شيء\n وقد أخبر أنه من عنده\n وقيل: معناه: إن هذا الموعود من إظهار آيات الله في الآفاق وفي أنفسهم سيرونه ويشاهدونه فيتيقنون عند ذلك أن القرآن تنزيل من عالم الغيب الذي هو على كل شيء شهيدٌ\n { أَلا إِنهم في مِريةٍ } شك عظيم { من لقاءِ ربهم } فلذلك أنكروا القرآن\n { ألا إِنه بكل شيءٍ محيط } عالم بجميع الأشياء وتفاصيلها\n وظواهرها\n وبواطنها\n فلا يخفى عليه خافية منهم\n وهو مجازيهم على كفرهم وشكهم\n لا محالة\n  الإشارة: قد اشتملت الآية على مقام الاستدلال في مقام الإيمان\n وعلى مقام العيان في مقام الإحسان\n أي: سنُريهم آياتنا الدالة على وجودنا في الآفاق\n وفي أنفسهم\n أي: في العوالم المنفصلة والمتصلة\n حتى يتبين لهم أنه الحق\n أي: وجوده حق\n لأن الصنعة قطعاً تحتاج إلى صانع\n ثم رقَّاهم إلى مقام المراقبة بقوله: { أوَلم يكف بربك أنه على كل شيء شهيد } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:23",
      "similarity": 0.8933422255527569
    },
    {
      "verse": "53:7",
      "similarity": 0.8706945759379602
    },
    {
      "verse": "48:28",
      "similarity": 0.191429870343123
    },
    {
      "verse": "4:79",
      "similarity": 0.17741166253366275
    },
    {
      "verse": "13:43",
      "similarity": 0.17362236759655728
    }
  ]
}