{
  "chapter": "فصلت",
  "text": "قل انما انا۠ بشر مثلكم يوحى الى انما الهكم اله وحد فاستقيموا۟ اليه واستغفروه وويل للمشركين",
  "translations": [
    {
      "translation": "Say: 'I am only a human being like yourselves. It is revealed to me that your god is One God. So be straight with Him and ask His forgiveness.' Woe to those who associate others with Him:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am a man like you, (but) it is revealed to me that your God is one God, so take the straight path to Him, and ask Him to forgive your sins. Woe to the idolaters\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “I am only a human being like you. It is revealed to me that your God is One God; so direct yourselves straight to Him, and seek His forgiveness. Woe to those who associate others with Allah in His Divinity,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"I am a mere mortal like you. I have received a revelation that your Lord is the only One. So be up-right and obedient to Him and seek forgiveness from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Physically I am a human like you – I receive the divine revelation that your God is only One God, therefore be upright towards Him and seek forgiveness from Him”; and woe is to the polytheists. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am only a human being like you. It is revealed to me that your God is One God, therefore take straight path to Him and obedience to Him, and seek forgiveness of Him. And woe to the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am only a mortal like you; it is revealed to me that your Allah is one Allah, therefore follow the right way to Him and ask His forgiveness; and woe to the polytheists;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am only a mortal, like you are. To me it has been revealed that your God is One God; so go straight with Him, and ask for His forgiveness; and woe to the idolaters\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them O Muhammad): I am only a mortal like you. It is inspired in me that your Allah is One Allah, therefor take the straight path unto Him and seek forgiveness of Him. And woe unto the idolaters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am only a human being like yourselves. It has been revealed to me that your God is One God. So take the straight path to Him and ask His forgiveness.\" Woe to those who associate others with Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I am only a human being like Unto you: only it is revealed Unto me that your God is but One God, wherefore take the straight path Unto Him and seek forgiveness of Him. And woe be Unto the associators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I am just a human like you. It has been revealed to me that your God is the One God. So worship Him single-mindedly and plead to Him for forgiveness.’ And woe to the polytheists\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: \"I am but a man like you: It is revealed to me by Inspiration, that your Allah is one Allah: so stand true to Him, and ask for His Forgiveness.\" And woe to those who join gods with Allah,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I am only a human being like you. It is inspired in me that your Ilah (God) is One Ilah (God - Allah), therefore take Straight Path to Him (with true Faith Islamic Monotheism) and obedience to Him, and seek forgiveness of Him. And woe to Al-Mushrikun (the disbelievers in the Oneness of Allah, polytheists, idolaters, etc. - see V. 2:105).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (Prophet Muhammad): 'I am only a human like you, to whom it is revealed that your God is One God. Therefore be straight with Him and ask Him to forgive you. Woe to the idolaters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am only a human like you; it is inspired in me that your God is One God. So be upright towards Him, and seek forgiveness from Him.” And woe to the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:6] Say: ‘I am only a human being like you. It has been revealed to me [simply] that your God is One God. So be upright [in your conduct] before Him, through faith and obedience, and seek forgiveness from Him. And woe (waylun is an expression implying ‘chastisement’) to the idolaters,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَى إِلَيَّ أَنَّمَا إِلَهُكُمْ إِلَهٌ وَاحِدٌ فَاسْتَقِيمُوا إِلَيْهِ وَاسْتَغْفِرُوهُ وَوَيْلٌ لِلْمُشْرِكِينَ (6) { عاملون \\* قُلْ إِنَّمَآ أَنَاْ بَشَرٌ مِّثْلُكُمْ يوحى إِلَىَّ أَنَّمَآ إلهكم إله واحد فاستقيموا إِلَيْهِ واستغفروه وَوَيْلٌ لِّلْمُشْرِكِينَ } .استئناف ابتدائي هو تلقين الرسول صلى الله عليه وسلم أن يجيب قولهم : { فاعْمَل إنَّنَا عاملون } \\[ فصلت : 5 \\] المفرّعَ على قولهم : { قُلُوبُنَا فِي أكِنَّةٍ مِمَّا تَدْعُونَا إليهِ } \\[ فصلت : 5 \\] إلى آخره جوابَ المُتبرىء من أن يكون له حول وقوة ليعمل في إلجائهم إلى الإِيمان لمَّا أبوْه إذ ما هو إلا بشر مثلهم في البشرية لا حول له على تقليب القلوب الضالة ، إلى الهدى ، وما عليه إلا أن يبلغهم ما أوحَى الله إليه . وهذا الخبر يفيد كناية عن تفويض الأمر في العمل بجزائهم إلى الله تعالى كأنه يقول : وماذا أستطيع أن أعمل معكم فإني رسول من الله فحسابكم على الله .فصيغة القصر في { إنَّمَا أنَا بَشَرٌ مِثْلُكُم } تفيد قصراً إضافياً ، أي أنَا مقصور على البشرية دون التصرف في قلوب الناس . وبيَّن مما تميَّز به عنهم على وجه الاحتراس من أن يتلقفوا قوله : { إنَّمَا أنَا بَشَرٌ مِثْلُكُم } تلقفَ من حصَّل على اعتراف خصمه بنهوض حجته بما يُثبت الفارق بينه وبينهم في البشرية ، وهو مضمون جملة { يوحى إلَيَّ } وذلك للتسجيل عليهم إبطال زعمهم المشهور المكرر أن كونه بشراً مانع من إرساله عن الله تعالى لقولهم : { ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيراً } \\[ الفرقان : 7 \\] ، ونحوه مما تكرر في القرآن . ومثل هذا الاحتراس ما حكاه الله عن قول الكفار لرسلهم : { إن أنتم إلا بشر مثلنا تريدون أن تصدونا عما كان يعبد آباؤنا فأتونا بسلطان مبين قالت لهم رسلهم إن نحن إلا بشر مثلكم ولكن اللَّه يمن على من يشاء من عباده } \\[ إبراهيم : 10 ، 11 \\] .وحرصاً على إبلاغ الإرشاد إليهم بيَّن له ما يوحى إليه بقوله : { إنَّمَا إلهكم إله واحد } إعادة لِمَا أبلغهم إياه غيرَ مرة ، شأنَ القائم بهدي الناس أن لا يغادر فرصة لإِبلاغهم الحق إلا انتهزها . ونظيره ما جاء في محاورة موسى وفرعون { قال فرعون وما رب العالمين قال رب السماوات والأرض وما بينهما إن كنتم مؤمنين قال لمن حوله ألا تستمعون قال ربكم ورب آبائكم الأولين قال إن رسولكم الذي أرسل إليكم لمجنون قال رب المشرق والمغرب وما بينهما إن كنتم تعقلون } \\[ الشعراء : 23 28 \\] .و { أنما } مفتوحة الهمزة ، وهي أخت { إنما } المكسورة وإنما تفتح همزتها إذا وقعت معمولة لما قبلها ولم تكن في الابتداء كما تفتح همزة ( أنَّ ) وتكسر همزة ( إن ) لأن إنَّمَا أو ( أنَّما ) مركبان من ( إنَّ ) أو ( أَنَّ ) مع ( ما ) الكافة الزائدة للدلالة على معنى ( مَا ) وَ ( إلا ) حتى ذهب وَهَلُ بعضهم أن ( ما ) التي معها هي النافية اغتراراً بأن معنى القصر إثبات الحكم للمذكور ونفيُه عما عداه مثلَ ( ما ) و ( إلاَّ ) ولا ينبغي التردد في كون أَنما المفتوحةِ الهمزة مفيدة القصرَ مثلُ أختها المكسورة الهمزة وبذلك جزم الزمخشري في تفسير سورة الأنبياء ، وما رده أبو حيان عليه إنما هو مجازفة ، وقد تقدم ذلك عند قوله تعالى :{ قل إنما يوحى إلي أنما إلهكم إله واحد فهل انتم مسلمون } في سورة الأنبياء ( 108 ) .فقوله : { أنَّمَا إلهكم إله وَاحِدٌ } إدماج للدعوة إلى الحق في خلال الجواب حرصاً على الهدْي .وكذلك التفريع بقوله : { فاسْتَقِيمُوا إلَيْهِ واسْتَغْفِرُوهُ } فإنه إتمام لذلك الإِدماج بتفريع فائدته عليه لأن إثبات أن الله إله واحد إنما يقصد منه إفراده بالعبادة ونبذُ الشرك . هذا هو الوجه في توجيه ارتباط { قُلْ إنَّمَا أنَا بَشَرٌ } بقولهم : { قُلُوبُنَا فِي أكِنَّةٍ } \\[ فصلت : 5 \\] الخ .وموقع أنَّمَا إلهكم إله واحِدٌ } أنه نائب فاعل { يوحى إلَيَّ } ، أيْ يوحَى إِليَّ معنى المصدر المنسبك من { أنَّمَا إلهكم إله واحِدٌ } وهو حصر صفة الله تعالى في أنه واحد ، أي دون شريك . ومماثلته لهم : المماثلة في البشرية فتفيد تأكيدَ كونه بشراً .والاستقامة : كون الشيء قويماً ، أي غير ذي عوج وتطلق مجازاً على كون الشيء حقاً خالصاً ليست فيه شائبة تمويه ولا باطل . وعلى كون الشخص صادقاً في معاملته أو عهده غير خالط به شيئاً من الحيلة أو الخيانة ، فيقال : فلان رجل مستقيم ، أي صادق الخُلُق ، وإن أريد صدقه مع غيره يقال : استقام له ، أي استقام لأجله ، أي لأجل معاملته منه . ومنه قوله تعالى : { فما استقاموا لكم فاستقيموا لهم } \\[ التوبة : 7 \\] والاستقامة هنا بهذا المعنى ، وإنما عُدّي بحرف ( إلى ) لأنها كثيراً ما تعاقب اللام ، يقال : ذهبتُ له وذهبت إليه ، والأحسن أن إيثار ( إلى ) هنا لتضمين ( استقيموا ) معنى : توجهوا ، لأن التوحيد توجه ، أي صرف الوجه إلى الله دون غيره ، كما حكَى عن إبراهيم : { إني وجهت وجهي للذي فطر السماوات والأرض حنيفاً وما أنا من المشركين } \\[ الأنعام : 79 \\] ، أو ضمّن ( استقيموا ) معنى : أنيبوا ، أي توبوا من الشرك كما دل عليه عطف { واستغفروه .والاستغفار : طلب العفو عما فرط من ذنب أو عصيان وهو مشتق من الغَفْر وهو الستر .والمعنى : فأخلصوا إلى الله في عبادته ولا تشركوا به غيره واسألوا منه الصفح عما فرط منكم من الشرك والعناد .واستغفروه وَوَيْلٌ } { لِّلْمُشْرِكِينَ \\* الذين لاَ يُؤْتُونَ الزكواة وَهُمْ بالاخرة هُمْ كافرون }وعيد للمشركين بسوء الحال والشقاء في الآخرة يجوز أن يكون من جملة القول الذي أُمر الرسول صلى الله عليه وسلم أن يقوله فهو معطوف على جملة { إنَمَّا أنَا بَشَرٌ } . ويجوز أن يكون كلاماً معترضاً من جانب الله تعالى فتكون الواو اعتراضية بين جملة { قُلْ إنَّمَا أنَا بَشَرٌ } وجملة { قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بالَّذِي خَلَقَ الأرْضَ } \\[ فصلت : 9 \\] أي أجبهم بقولك : أنا بشر مثلك يوحى إليّ ونحن أعتدنا لهم الويل والشقاء إن لم يقبلوا ما تدعوهم إليه ، فيكون هذا إخباراً من الله تعالى .وذكر المشركين إظهار في مقام الإِضمار ويستفاد تعليق الوعيد على استمرارهم على الكفر من الإِخبار عن الويل بكونه ثابتاً للمشركين والموصوفين بالذين لا يؤتون الزكاة وبأنهم كافرون بالبعث لأن تعليق الحكم بالمشتق يؤذن بعليَّة ما منه الاشتقاق ، ولأن الموصول يؤذن بالإِيماء إلى وجه بناء الخبر . فأما كون الشرك وإنكارِ البعث موجِبَيْن للويل فظاهر ، وأما كون عدم إيتاء الزكاة موجباً للويل فذلك لأنه حَمَّل عليهم ما قارن الإشراك وإنكار البعث من عدم الانتفاع بالأعمال التي جاء بها الإسلام ، فذِكرُ ذلك هنا لتشويه كفرهم وتفظيع شركهم وكفرانهم بالبعث بأنهما يدعوانهم إلى منع الزكاة ، أي إلى القسوة على الفقراء الضعفاء وإلى الشحّ بالمال وكفى بذلك تشويهاً في حكم الأخلاق وحكم العُرف فيهم لأنهم يتعيرون باللؤم ، ولكنهم يبذلون المالَ في غير وجهه ويحرمون منه مستحقيه .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (I am only a mortal) a human being (like you. It is inspired in me) Gabriel was sent to me with the Qur'an to convey to you (that your God is One God) He has no son or partner, (therefore take the straight path unto Him) therefore turn to Him with repentance from idolatry (and seek 550 forgiveness of Him) and declare His divine Oneness. (And woe) severe punishment; it is also said this means: a river of puss and blood in Gehenna (unto the idolaters) Abu Jahl and his host,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قُلْ إنَّما بشر مثلكم } أي: إني من جنسكم وأناسبكم في البشرية والمماثلة النوعية\n لتوجهه للإنس والخلطة\n وأباينكم بالوحي المنبه على التوحيد المبيِّن لطريق السلوك\n فاتصلوا بي بالمناسبة النوعية والمجانسة البشرية لتهتدوا بنور التوحيد والوحي المفيد لبيان الدين\n وتسلكوا سبيل الحق الذي عرّفنيه بقوله: { أنما إلهكم إله واحد } لا شريك له في الوجود { فاستقيموا } بالثبات على الإيمان والسكينة والإيقان في التوجه { إليه } من غير انحراف إلى الباطل والطرق المتفرّقة ولا زيغ بالالتفات إلى الغير والميل إلى النفس { واستغفروه } بالتنصل عن الهيئات المادية والتجرّد عن الصفات البشرية ليستر بنور صفاته ذنوب صفاتكم { وويلٌ } للمحتجبين بالغير\n { الذين } لا يزّكون أنفسهم بمحو صفاتها ليرتفع حجاب الغيرية فتتحقق بالوحدة { وهم بالآخرة هم كافرون } لسترهم النور الفطري المقتضي الشوق إلى عالم القدس ومعدن الحياة الأبدية بظلمات الحسّ وهيئات الطبيعة البدنية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما استنكفوا عنك\n واستكبروا عليك وعلى دينك وكتابك { قُلْ } لهم يا أكمل الرسل كلاماً ناشئاً عن محض اليقين والتوحيد\n خالياً عن وصمة التخمين والتقليد: { إِنَّمَآ أَنَاْ بَشَرٌ مِّثْلُكُمْ } أي: ما أنا إلا بشر مثلكم ما أدعي الملكية لنفسي\n غاية ما في الباب أنه { يُوحَىٰ إِلَيَّ } أي: يوحي ربي إليّ بمقتضى سنته السنية المستمرة في سالف الزمان { أَنَّمَآ إِلَـٰهُكُمْ } الذي أظهركم من كتم العدم\n وأخرجكم من فضاء الوجود { إِلَـٰهٌ وَاحِدٌ } أحد صمد فرد وتر\n لا تعدد فيه بوجه من الوجوه { فَٱسْتَقِيمُوۤاْ إِلَيْهِ } توجهوا نحوه مخلصين موحدين { وَٱسْتَغْفِرُوهُ } لفرطاتكم التي صدرت عنكم بمقتضى بشريتكم\n ليغفر لكم ما تقدم منكم من طغيان بهيميتكم\n\n\n{ وَ } عليكم ألاَّ تشاركوا معه سبحانه شيئاً من مظاهره ومصنوعاته\n إذ { وَيْلٌ } عظيم وعذاب أليم معد عنده { لِّلْمُشْرِكِينَ } [فصلت: 6] المشركين له غيره\n الخارجين عن مقتضى توحيده واستقلاله في ألوهيته ظلماً وزوراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاستقيموا إِليه } بالتوحيد وإخلاص العبادة\n غير ذاهبين يميناً وشمالاً\n ولا ملتفتين إلى ما يُسوّل لكم الشيطانُ من عبادة الأصنام\n\n\n قال تعالى: { واستغفروه } مما كنتم عليه من سوء العقيدة\n والفاء لترتيب ما قبلها من إيحاء التوحيد على ما بعدها من الاستقامة\n { وويل للمشركين } \n وهو ترهيب وتنفير لهم عن الشرك إثر ترغيبهم في التوحيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:110",
      "similarity": 0.5188757503542425
    },
    {
      "verse": "21:108",
      "similarity": 0.4808187236776041
    },
    {
      "verse": "21:14",
      "similarity": 0.4398063294595866
    },
    {
      "verse": "52:11",
      "similarity": 0.42888817830792564
    },
    {
      "verse": "107:4",
      "similarity": 0.42400140361636673
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/041006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/041006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/41:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}