{
  "chapter": "فصلت",
  "text": "قل ائنكم لتكفرون بالذى خلق الارض فى يومين وتجعلون له اندادا ذلك رب العلمين",
  "translations": [
    {
      "translation": "Say: 'Do you reject Him who created the earth in two days, and make others equal to Him? That is the Lord of all the worlds.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Do you refuse to believe in Him who created the earth in two spans of time, and set up compeers to Him, the Lord of all the worlds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “Do you indeed disbelieve in Him and assign compeers to Him Who created the earth in two days? He is the Lord of all beings of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Do you really disbelieve in the One Who created the earth in two days? Do you consider things equal to Him? He is the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say “What! You disbelieve in Him Who created the earth in two days, and you appoint equals to Him? He is the Lord Of The Creation!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Do you verily disbelieve in Him Who created the earth in two Days And you set up rivals with Him That is the Lord of all that exists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: What! do you indeed disbelieve in Him Who created the earth in two periods, and do you set up equals with Him? That is the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What, do you disbelieve in Him who created the earth in two days, and do you set up compeers to Him? That is the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad, unto the idolaters): Disbelieve ye verily in Him Who created the earth in two Days, and ascribe ye unto Him rivals? He (and none else) is the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"What! Do you indeed deny Him who created the earth in two Days [periods] and do you set up equals with Him? He is the Lord of the Universe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: are ye indeed those who disbelieve in Him who hath created the earth in two days, and set up Unto Him peers? That is the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Do you really disbelieve in Him who created the earth in two days, and ascribe partners to Him? That is the Lord of all the worlds!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Is it that ye deny Him Who created the earth in two Days? And do ye join equals with Him? He is the Lord of (all) the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Do you verily disbelieve in Him Who created the earth in two Days and you set up rivals (in worship) with Him? That is the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Do you disbelieve in Him who created the earth in two days? And do you set up equals with Him? He is the Lord of the Worlds'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Do you reject the One who created the earth in two days? And you attribute equals to Him? That is the Lord of the Universe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Do you indeed disbelieve in He who created the earth in two days and attribute to Him equals? That is the Lord of the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[41:9] Say: ‘Do you [really] (read a-innakum, pronouncing both hamzas, or by not pronouncing the second one but inserting an alif between the two in both cases) disbelieve in Him Who created the earth in two days, Sunday and Monday, and ascribe to Him associates? That is the Lord, in other words, the Possesser, of [all] the Worlds (al-‘ālamīn, the plural of ‘ālam, which denotes everything apart from God. On account of the variety [of beings] that it subsumes, it has been expressed in the plural form ending with –īn, as a way of giving prevalence [in the address] to rational beings).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (Disbelieve ye) people of Mecca (verily in Him Who created the earth in two Days) each day the equivalent of 1,000 days of the days which you count: Sunday, Monday, etc., (and ascribe ye unto Him rivals) from among the idols? (He (and none else) is the Lord of the Worlds) the one who created them is the Lord of all that which has a spirit.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن أشرك بالله، وجحد توحيده على سبيل التوبيخ والتقريع: { أَإِنَّكُمْ } أيها الجاهدون المسرفون { لَتَكْفُرُونَ } وتنكرون { بِٱلَّذِي } أي: بالقادر العليم الحكيم الذي { خَلَقَ ٱلأَرْضَ } أي: عالم الطبيعة والهيولي { فِي يَوْمَيْنِ } يوماً لاستعداداتها القابلة لانعكاس أشعة نور الوجود، ويوماً لاتصافها بها بمقتضى الجود الإلهي\n\n\n\n\n{ وَ } من كمال غفلتكم وضلالكم عن توحيد الحق وتوحده في ذاته { تَجْعَلُونَ لَهُ أَندَاداً } تثبتون له شركاء في الوجود، مشاركين معه سبحانه في الآثار والتصرفات الواقعة في الكائنات، وتتوجهون نحوهم في الخطوب والملمات، مع أنه لا رب لهم سواه سبحانه، ولا مرجع لهم غيره، بل { ذَلِكَ } الواحد الأحد الصمد الذي ذكر نبذاً من أخص أوصافه { رَبُّ ٱلْعَالَمِينَ } [فصلت: 9] أي: موجد جميع ما لاح عليه برق الوجود، ومربيها بمقتضى الجود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وتجعلون }: عطف على { تكفرون }\n و { جَعَلَ }: عطف على { خَلَقَ } داخل في حيز الصلة، و { سواء }: مَن نَصَبَه فمصدر أي: استوت سواء\n ومَن جَرَّه فصفة لأيام، ومَن رفعه فخبر هي سواء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:30",
      "similarity": 0.789832253710505
    },
    {
      "verse": "2:165",
      "similarity": 0.7399741529910678
    },
    {
      "verse": "2:22",
      "similarity": 0.560802785032869
    },
    {
      "verse": "39:8",
      "similarity": 0.47672987092047103
    },
    {
      "verse": "34:33",
      "similarity": 0.40258025185992985
    }
  ]
}