{
  "chapter": "الشورى",
  "text": "الله الذى انزل الكتب بالحق والميزان وما يدريك لعل الساعة قريب",
  "translations": [
    {
      "translation": "It is Allah who has sent down the Book with truth and with the Just Balance. What will make you realise? Perhaps the Hour is close.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has sent down the Book with the truth, and the Balance. How do you know the Hour is not near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who sent down this Book with the Truth and the Balance. And what would make you know that the Hour (of Judgement) has drawn near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who revealed the Book and the Balance for a truthful purpose. You never know. Perhaps the Hour of Doom is close at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book with the truth, and the Scales of Justice; and what do you know – possibly the Last Day could really be near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book in truth, and the Balance. And what can make you know that perhaps the Hour is close at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who revealed the Book with truth, and the balance, and what shall make you know that haply the hour be nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God it is who has sent down the Book with the truth, and also the Balance. And what shall make thee know? Haply the Hour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath revealed the Scripture with truth, and the Balance. How canst thou know? It may be that the Hour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has sent down the Book with the truth and the scales of justice. What will make you realize that the Hour might well have drawn near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath sent down the Book with the truth and the balance. And what shall make thee know the Hour may haply be nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has sent down the Book with the truth and [He has sent down] the Balance. What do you know—maybe the Hour is near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book in Truth, and the Balance (by which to weigh conduct). And what will make thee realise that perhaps the Hour is close at hand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book (the Quran) in truth, and the Balance (i.e. to act justly). And what can make you know that perhaps the Hour is close at hand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has sent down the Book in truth and the Scale. And what will let you know? The Hour is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who revealed the Book with the truth, and the Balance. And what will make you realize that perhaps the Hour is near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has sent down the Book in truth and [also] the balance. And what will make you perceive? Perhaps the Hour is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:17] God it is Who has revealed the Book, the Qur’ān, with the truth (bi’l-haqqi is semantically connected to anzala, ‘revealed’) as well as the Balance, Justice. And what do you know — perhaps the Hour, that is, its arrival, is near! (la‘alla, ‘perhaps’, comments on the verb describing the action, with what follows it functioning as two direct objects).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاللَّهُ الَّذِي أَنْزَلَ الْكِتَابَ بِالْحَقِّ وَالْمِيزَانَ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ قَرِيبٌ (17)قد علمتم أن من جملة محاجة المشركين في الله ومِن أشدِّها تشغيباً في زعمهم محاجتهم بإنكار البعث كما في قولهم : { هل ندلكم على رجللٍ يُنبِّئكم إذا مُزِّقتم كلَّ مُمَزَّققٍ إِنكم لفي خَلققٍ جديدٍ أفترى على الله كذباً أم به جنّة } \\[ سبأ : 7 ، 8 \\] ، وقال شداد بن الأسود: ... يُخبِّرُنا الرّسولُ بأنْ سَنَحْيَاوكيفَ حياةُ أصداءٍ وهامِ ... وقد دحض الله حجتهم في مواضع من كتابه بنفي استحالته ، وبدليل إمكانه ، وأومأ هنا إلى مقتضي إيجابه ، فبيّن أن البعث والجزاء حق وعدل فكيف لا يقدِّره مدبّر الكون ومنزّل الكتاب والميزان . وقد أشارت إلى هذا المعنى آيات كثيرة منها قوله تعالى : { أفحسبتم أنما خلقناكم عبثاً وأنكم إلينا لا تُرجَعون } \\[ المؤمنون : 115 \\] وقوله : { إن الساعة آتيةٌ أكادُ أُخفيها لتُجْزَى كلُّ نفس بما تَسعى } \\[ طه : 15 \\] وقال : { وما خلقنا السماوات والأرض وما بينهما لاعبين ما خلقناهما إلا بالحقّ ولكن أكثرَهم لا يعلمون إنَّ يوم الفصل ميقاتُهم أجمعين } \\[ الدخان : 38 40 \\] .وأكثرُها جاء نظمها على نحو الترتيب الذي في نظم هذه الآية من الابتداء بما يذكِّر بحكمة الإيجاد وأن تمام الحكمة بالجزاء على الأعمال .فقوله : { الله الذي أنزل الكتاب بالحق والميزان } تمهيد لقوله : { وما يدريك لعل الساعة قريب } ، لأن قوله : { وما يدريك لعل الساعة قريب } يؤذن بمقدر يقتضيه المعنى ، تقديره : فجُعل الجزاء للسائرين على الحق والناكبين عنه في يوم السّاعة فلا محيص للعباد عن لقاء الجزاء وما يدريك لعل الساعة قريب ، فهو ناظر إلى قوله { إن الساعة آتية أكاد أُخْفِيها لتُجزَى كلَّ نفسسٍ بما تسعى } \\[ طه : 15 \\] . وهذه الجملة موقعها من جملة { والذين يحاجون في الله } \\[ الشورى : 16 \\] موقع الدّليل ، والدليلُ من ضروب البيان ، ولذلك فصلت الجملة عن التي قبلها لشدة اتصال معناها بمعنى الأخرى .والإخبار عن اسم الجلالة باسم الموصول الذي مضمون صلته إنزالُه الكتابَ والميزانَ ، لأجل ما في الموصولية من الإيماء إلى وجه بناء الخبر الآتي ، وأنه من جنس الحق والعدل ، مثل الموصول في قوله تعالى : { إن الذين يستكبرون عن عبادتي سيدخلون جهنّم داخرين } \\[ غافر : 60 \\] .ولام التعريف في الكتاب } لتعريف الجنس ، أي إنزال الكُتب وهو ينظر إلى قوله آنفاً : { وقل آمنت بما أنزل الله من كتاب } \\[ الشورى : 15 \\] .والباء في { بالحق } للملابسة ، أي أنزل الكتب مقترنة بالحق بعيدة عن الباطل .والحق : كلّ ما يَحق ، أي يجب في باب الصلاح عملُه ويصح أن يفسر بالأغراض الصحيحة النافعة .و { الميزان } حقيقته : آلة الوزن ، والوزن : تَقديرُ ثِقَللِ جسم ، والميزان آلة ذات كفتين معتدلتين معلقتين في طرفي قضيب مستوٍ معتدل ، له عروة في وسطه ، بحيث لا تتدلى إحدى الكفتين على الأخرى إذا أُمسك القضيب من عُروته . والميزان هنا مستعار للعدل والهدْي بقرينة قوله { أنزل } فإن الدّين هو المنزل والدّين يدعو إلى العدل والإنصاف في المجادلة في الدّين وفي إعطاء الحقوق ، فشبه بالميزان في تساوي رجحان كفتيه قال تعالى :{ وأنزلنا معهم الكتاب والميزان ليقومَ النّاس بالقسط } \\[ الحديد : 25 \\] .وجملة { وما يدريك لعل الساعة قريب } معطوفة على جملة { الله الذي أنزل الكتاب بالحق والميزان } ، والمناسبة هي ما ذكرناه من إيذان تلك الجملة بمقدَّر .وكلمة { وما يدريك } جارية مجرى المثل ، والكاف منها خطاب لغير معيّن بمعنى : قد تدري ، أي قد يدري الداري ، ف { ما } استفهامية والاستفهام مستعمل في التنبيه والتهيئة . و { يدريك } من الدراية بمعنى العلم . وقد عُلّق فعل ( يُدري ) عن العمل بحرف الترجّي . وعن ابن عباس كل ما جاء فعل ( ما أدراك ) فقد أعلمه الله به أي بينه له عقب كلمة ( ما أدراك ) نحو { وما أدراك ماهِيَهْ نارٌ حاميةٌ } \\[ القارعة : 10 ، 11 \\] وكل ما جاء فيه { وما يدريك } لم يُعلمه به أي لم يعقبه بما يبين إبْهامه نحو { وما يدريك لعل الساعة قريب وما يدريك لعله يزّكى } \\[ عبس : 3 \\] . ولعل معنى هذا الكلام أن الاستعمال خص كل صيغة من هاتين الصيغتين بهذا الاستعمال فتأمل .والمعنى : أي شيء يعلمك أيها السامع الساعةَ قريباً ، أي مقتضي علمِك متوفر ، فالخطاب لغير معين ، وفي معناه قوله تعالى : { وما يشعركم أنّها إذا جاءت لا يؤمنون } في سورة الأنعام ( 109 ) .والإخبار عن الساعة } ب { قريب } وهو غير مؤنث لأنه غلب لزوم كلمة قريب وبعيد للتذكير باعتبار شيء كقوله تعالى : { وما يدريك لعل الساعة تكون قريباً } \\[ الأحزاب : 63 \\] وقوله : { إن رحمة الله قريبٌ من المحسنين } وقد تقدم في سورة الأعراف ( 56 ) .\n\n",
      "translations": [
        {
          "translation": "(Allah it is who hath revealed the Scripture) He sent Gabriel with the Qur'an (with truth) to explain the Truth and falsehood, (and the Balance) and exposited therein justice. (How canst thou know) Muhammad? (It may be that the Hour is nigh) it may be that the Hour is coming soon.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفكيف يحاجون أولئك المعاندون في توحيده سبحانه مع أنه هو { ٱللَّهُ } المدبر المصلح لأمور عباده { ٱلَّذِيۤ أَنزَلَ } لإصلاحهم { ٱلْكِتَابَ } أي: جنس الكتب النازلة من عنده لتبيين مناهج توحيده ملتبساً { بِٱلْحَقِّ } الصريح المعرى عن الباطل الزاهق الزائل مطلقاً { وَ } أنزل على طبق الكتاب { ٱلْمِيزَانَ } أي: جنس الشرائع والأديا التي توزن بها أعمال الأنام وإخلاصهم فيها\n وثباتهم على جادة التوحيد والإسلام\n فعليك يا أكمل الرسل وعلى من تبعك امتثال عموم ما أمر ونهى من أحكام كتابك\n وأن تزن أنت ومن معك أعمالكم وأخلاقكم وأحوالكم بميزان الشرع القديم والدين المستقيم { وَ } بالجملة: { مَا يُدْرِيكَ } أيها المجبول على الدراية والشعور { لَعَلَّ ٱلسَّاعَةَ } الموعودة التي تعذرت دونها التدارك والتلافي { قَرِيبٌ } [الشورى: 17] إتيانها وقيامها\n وعند قيامها تتندمون وما ينفعكم الندم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { اللهُ الذي أنزل الكتابَ } القرآن\n أو: جنس الكتاب\n { بالحق } ملتبساً بالحق في أحكامه وأخباره\n أو: بما يحق إنزاله من العقائد والأحكام\n { والميزانَ } وأنزل العدل والتسوية بين الناس\n أي: أنزله في كتبه المنزلة\n وأمر به\n أو: الشرع الذي يُوزن به الحقوق\n ويساوي بين الناس\n وقيل: هو عين الميزان\n أي: الآلة\n أنزله في زمن نوح عليه السلام\n { وما يُدريكَ } أيَّ شيء يجعلك عالماً { لعلَّ الساعةَ } التي أخبر بها الكتاب الناطق بالحق { قريبٌ } مجيئها\n وضمّن الساعة معنى البعث فذكر الخبر\n وقيل: وجه المناسبة في ذكر الساعة مع إنزال الكتاب: أن الساعة يقع فيها الحساب ووضع الموازين بالقسط\n فكأنه قيل: أمركم الله بالعدل والتسوية\n والعمل بالشرائع\n فاعملوا بالكتاب والعدل قبل أن يفاجئكم يوم حسابكم\n ووزن أعمالكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:63",
      "similarity": 0.6553960728533046
    },
    {
      "verse": "69:3",
      "similarity": 0.4511372258729889
    },
    {
      "verse": "55:8",
      "similarity": 0.444474800817604
    },
    {
      "verse": "80:3",
      "similarity": 0.4410504763179728
    },
    {
      "verse": "45:32",
      "similarity": 0.4290197420956885
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}