{
  "chapter": "الشورى",
  "text": "وما تفرقوا۟ الا منۢ بعد ما جاءهم العلم بغيۢا بينهم ولولا كلمة سبقت من ربك الى اجل مسمى لقضى بينهم وان الذين اورثوا۟ الكتب منۢ بعدهم لفى شك منه مريب",
  "translations": [
    {
      "translation": "They only split up after knowledge came to them, tyrannising one another. And were it not for a prior decree from your Lord for a specified term, the judgement between them would already have been made. Those who inherited the Book after them are indeed in grave doubt about it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they did not differ about it until knowledge came to them, through rivalries among themselves. If the Word of your Lord, (staying) it for a time ordained, had not preceded it, the matter would have been settled among them. But those who came to inherit the Book after them are also in doubt and disturbed about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not split up except after knowledge had come to them, and then only because they wished to commit excesses against each other. Had your Lord not already decreed that judgement would be made later at an appointed time, the matter between them would surely have been decided once and for all. Indeed those who were later made the heirs of the Book are in disquieting doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only after receiving the knowledge did people divide themselves into different groups because of rebellion among themselves. Had it not been for your Lord's giving them respite for an appointed time, He would certainly have settled their differences once and for all. Those who inherited the Book, from their quarrelsome predecessors, also have doubts and suspicions about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they did not cause divisions except after the knowledge had come to them, because of jealousy among themselves; and were it not for a Word that had already gone forth from your Lord, the judgement would have been passed upon them long ago; and indeed those who inherited the Book after them are in an intriguing doubt regarding it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they divided not till after knowledge had come to them, through transgression between themselves. And had it not been for a Word that went forth before from your Lord for an appointed term, the matter would have been settled between them. And verily, those who were made to inherit the Scripture after them, are in grave doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they did not become divided until after knowledge had come to them out of envy among themselves; and had not a word gone forth from your Lord till an appointed term, certainly judgment would have been given between them; and those who were made to inherit the Book after them are most surely in disquieting doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They scattered not, save after knowledge had come to them, being insolent one to another; and but for a Word that preceded from thy Lord until a stated term, it had been decided between them. But those to whom the Book has been given as an inheritance after them, behold, they are in doubt of it disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were not divided until after the knowledge came unto them, through rivalry among themselves; and had it not been for a Word that had already gone forth from thy Lord for an appointed term, it surely had been judged between them. And those who were made to inherit the Scripture after them are verily in hopeless doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They became divided only after knowledge had reached them, out of mutual jealousy. Had it not been for a decree already passed by your Lord, [to reprieve them] till a specified period, the matter would surely have been decided between them. Those who inherited the Book after them are indeed in grave doubt, amounting to suspicion about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they divided not until after knowledge had come to them, through spite between themselves; And had not a word gone forth from thy Lord for an appointed term, the affair would surely have been judged between them. And verily those who have been made inheritors of the Book after them are in doubt thereof dubitating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not divide [into sects] except after the knowledge had come to them, out of envy among themselves; and were it not for a prior decree of your Lord [granting them reprieve] until a specified time, decision would have been made between them. Indeed those who were made heirs to the Book after them are in grave doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they became divided only after Knowledge reached them,- through selfish envy as between themselves. Had it not been for a Word that went forth before from thy Lord, (tending) to a Term appointed, the matter would have been settled between them: But truly those who have inherited the Book after them are in suspicious (disquieting) doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they divided not till after knowledge had come to them, through selfish transgression between themselves. And had it not been for a Word that went forth before from your Lord for an appointed term, the matter would have been settled between them. And verily, those who were made to inherit the Scripture [i.e. the Taurah (Torah) and the Injeel (Gospel)] after them (i.e. Jews and Christians) are in grave doubt concerning it (i.e. Allah's true religion Islam or the Quran).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they became divided only after knowledge had reached them from their own insolence. And had it not been for a Word that had preceded from yourLord, till an appointed term, it would have been determined between them. But those who inherited the Book after them are in disquieting doubt about it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They became divided only after knowledge came to them, out of resentment among themselves. Were it not for a predetermined decision from your Lord, judgment would have been pronounced between them. Indeed, those who were made to inherit the Book after them are in grave doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they did not become divided until after knowledge had come to them - out of jealous animosity between themselves. And if not for a word that preceded from your Lord [postponing the penalty] until a specified time, it would have been concluded between them. And indeed, those who were granted inheritance of the Scripture after them are, concerning it, in disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:14] And they did not become divided, that is, the adherents of the [monotheistic] religions [did not become divided] in religion — so that some affirmed the Oneness [of God], while others rejected it — except after   the knowledge, of His Oneness, had come to them, out of [jealous] rivalry, on the part of the disbelievers, among themselves. And were it not for a Word that preceded from your Lord, to defer requital [of them], until an appointed term, [until] the Day of Resurrection, it would have [already] been judged between them, to chastise the disbelievers in this world. And indeed those who were made heirs to the Scripture after them, namely, the Jews and the Christians, are truly in grave doubt concerning him, Muhammad (s).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا تَفَرَّقُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ إِلَى أَجَلٍ مُسَمًّى لَقُضِيَ بَيْنَهُمْ وَإِنَّ الَّذِينَ أُورِثُوا الْكِتَابَ مِنْ بَعْدِهِمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ (14){ يُنِيبُ \\* وَمَا تفرقوا إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ العلم بَغْياً بَيْنَهُمْ وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ إلى أَجَلٍ مُّسَمًّى لَّقُضِىَ بِيْنَهُمْ وَإِنَّ الذين أُورِثُواْ الكتاب مِن بَعْدِهِمْ لَفِى شَكٍّ مِّنْهُ مُرِيبٍ } .عطف على جملة { ولا تتفرقوا فيه } \\[ الشورى : 13 \\] وما بينهما اعتراض كما علمت ، وفي الكلام حذف يدل عليه قوله : { وما تفرقوا } تقديره : فتفرقوا . وضمير { تفرقوا } عائد إلى ما عاد إليه ضمير { أن أقيموا الدّين ولا تتفرقوا } \\[ الشورى : 13 \\] وهم أمم الرّسل المذكورين ، أي أوصيناهم بواسطة رسلهم بأن يقيموا الدّين . دلّ على تقديره ما في فعل { وصَّى } \\[ الشورى : 13 \\] من معنى التبليغ كما تقدم .والعلم : إدراك العقل جزماً أو ظنّاً . ومجيء العِلم إليهم يؤذن بأن رسلهم بيّنوا لهم مضارّ التفرق من عهد نوح كما حكى الله عنه في قوله : { ثم إنّي دعوتُهم جِهاراً ثم إنِيَ أعلنتُ لهم وأسررت لهم إسراراً } إلى قوله : { سُبُلاً فِجَاجاً } في سورة نوح ( 8 20 ) . وإنما تلقَّى ذلك العِلمَ علماؤهم .ويجوز أن يكون المراد بالعلم سببَ العلم ، أي إلاّ من بعد مجيء النبي بصفاته الموافقة لما في كِتابهم فتفرقوا في اختلاق المطاعن والمعاذير الباطلة لينفوا مطابقة الصفات ، فيكون كقوله تعالى : { وما تَفرّق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البيَّنة } \\[ البينة : 4 \\] على أحد تفسيرين .والمعنى : وما تفرقت أممهم في أديانهم إلا من بعد ما جاءهم العلم على لسان رسلهم من النهي عن التفرق في الدّين مع بيانهم لهم مفاسد التفرق وأضراره ، أي أنهم تفرقوا عالمين بمفاسد التفرق غير معذورين بالجهل . وهذا كقوله تعالى : { وما تفرّق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البيّنة } \\[ البينة : 4 \\] على التفسير الآخر .وذُكر سبب تفرقهم بقوله : { بغياً بينهم } أي تفرّقوا لأجل العداوة بينهم ، أي بين المتفرقين ، أي لم يحافظوا على وصَايَا الرّسل . وهذا تعريض بالمشركين في إعراضهم عن دعوة الإسلام لعداوتهم للمؤمنين وقولُه : { ولولا كلمة سبقت من ربك } الخ تحذير للمؤمنين من مثل ذلك الاختلاف . وتنكير { كلمة } للتنويع لأن لكل فريق من المتفرقين في الدّين كلمة من الله في تأجيلهم فهو على حدّ قوله تعالى : { وعلى أبصارهم غشاوة } \\[ البقرة : 7 \\] . وتنكير { أجل } أيضاً للتنويع لأن لكل أمة من المتفرقين أجلاً مسمى ، فهي آجال متفاوتة في الطّول والقصر ومختلفة بالأزمنة والأمكنة .والمراد بالكلمة ما أراده الله من إمهالهم وتأخير مؤاخذتهم إلى أجل لهم اقتضته حكمتُه في نظام هذا العالم ، فربّما أخرهم ثم عذّبهم في الدنيا ، وربّما أخرهم إلى عذاب الآخرة ، وكل ذلك يدخل في الأجل المسمّى ، ولكل ذلك كلمته . فالكلمة هنا مستعارة للإرادة والتقدير . وسبقها تقدمها من قَبل وقت تفرقهم وذلك سبْق علم الله بها وإرادته إيّاها على وقف علمه وقدره ، وقد تقدم نظير هذه الكلمة في سورة هود وفي سورة طه .{ بِيْنَهُمْ وَإِنَّ الذين أُورِثُواْ الكتاب مِن بَعْدِهِمْ لَفِى شَكٍّ مِّنْهُ } .عطف على جملة { وما تفرقوا إلا من بعد ما جاءهم العلم } إلى قوله : { لقضي بينهم } . وهذه الجملة هي المقصود من جملة { شَرع لكم من الدّين ما وصَّى به نوحاً } إلى قوله : { ولا تتفرقوا فيه } \\[ الشورى : 13 \\] ، لأن المقصود أهل الكتاب الموجودون في زمن نزول الآية .وإذ قد كانت من الأمم التي أوحى الله إلى رسلهم أمتَاننِ موجودتان في حين نزول هذه الآية وهما اليهود والنصارى ، وكانتا قد تفرقتا فيما جاءهم به العلم ، وكان الله قد أخّر القضاء بين المختلفين منهم إلى أجل مسمّى ، وكانوا لمَّا بلغتهم رسالة محمّد صلى الله عليه وسلم شَكُّوا في انطباق الأوصاف التي وردت في الكتاب بوصف النبي الموعود به .فالمعنى : أنه كما تفرق أسلافهم في الدّين قبل بعثة النبي الموعود به تفرق خلَفُهم مثلهم وزادوا تفرقاً في تطبيق صفات النبي الموعود به تفرقاً ناشئاً عن التردد والشك ، أي دونَ بذل الجهد في تحصيل اليقين ، فلم يزل الشك دأبهم . فالمخبر عنهم بأنهم في شك : هم الذين أُورثوا الكتاب من بعدِ سلفهم .وقد جاء نظم الآية على أسلوب إيجاز يتحمل هذه المعاني الكثيرةَ وما يتفرع عنها ، فجيء بضمير { منه } بعد تقدُّم ألفاظ صالحة لأن تكون معادَ ذلك الضمير ، وهي لفظ { الدِّين في قوله من الدّين } \\[ الشورى : 13 \\] ، ولفظ الذي } في قوله : { والذي أوحينا إليك } \\[ الشورى : 13 \\] ، و { ما الموصولةُ في قوله : { ما تدعوهم إليه } \\[ الشورى : 13 \\] ، وهذه الثلاثة مدلولها الإسلام . وهنالك لفظ { ما وصيّنا } \\[ الشورى : 13 \\] المتعدّي إلى موسى وعيسى ، ولفظ { الكتاب } في قوله { وإن الذين أُورثوا الكتاب } . وهذان مدلولهما كتابَا أهل الكتاب .وهؤلاء الذين أوتوا الكتاب هم الموجودون في وقت نزول الآية . والإخبار عنهم بأنهم في شك ناشىءٍ من تلك المعادات للضمير معناه : أن مبلغ كفرهم وعنادهم لا يتجاوز حالة الشك في صدق الرّسالة المحمدية ، أي ليسوا مع ذلك بموقنين بأن الإسلام باطل ، ولكنهم تردّدوا ثم أقدموا على التكذيب به حسداً وعناداً . فمنهم من بقي حالهم في الشك . ومنهم من أيقن بأن الإسلام حق ، كما قال تعالى : { الذين آتيناهم الكتاب يعرفونه كما يعرفون أبناءهم وإن فريقاً منهم ليكتمون الحق وهم يعلمون } \\[ البقرة : 146 \\] . ويحتمل أن المعنى لفي شك بصدق القرآن أو في شك مما في كتابهم من الأمور التي تفرقوا فيها ، أو ما في كتابهم من الدّلالة على مجيء النبي الموعود به وصفاته . فهذه معان كثيرة تتحملها الآية وكلها منطبقة على أهل الكتابَيْن وبذلك يظهر أنه لا داعي إلى صرف كلمة { شك } عن حقيقتها .ومعنى { أورثوا الكتاب } صار إليهم علم الكتاب الذي اختلف فيه سلفُهم فاستعير الإرث للخَلفِيّة في علم الكتاب .والتعريف في { الكتاب } للجنس ليشمل كتاب اليهود وكتاب النصارى .فضمير { من بعدهم } عائِد إلى ما عاد إليه ضمير { تفرقوا } وهم الذين خوطبوا بقوله { ولا تتفرقوا فيه } \\[ الشورى : 13 \\] .وظرفية قوله : { في شك } ظرفية مجازية وهي استعارة تبعية ، شُبه تمكن الشك من نفوسهم بإحاطة الظرف بالمظروف .و ( من ) في قوله : { لفي شك منه } ابتدائية وهو ابتداء مجازي معناه المصاحبة والملابسة ، أي شك متعلق به أو في شك بسببه . ففي حرف ( من ) استعارة تبعية ، وقع حرف ( مِن ) موقع باء المصاحبة أو السببية .وتأكيد الخبر ب { إنَّ } للاهتمام ومجرد تحقيقه للنبيء صلى الله عليه وسلم والمؤمنين ، وهذا الاهتمام كناية عن التحريض للحذر من مكرهم وعدم الركون إليهم لظهور عداوتهم لئلا يركنوا إليهم ، ولعل اليهود قد أخذوا يومئذٍ في تشكيك المسلمين واختلطوا بهم في مكّة ليتطلعوا حال الدعوة المحمدية .هذا هو الوجه في تفسير هذه الآية وهو الذي يلتئم مع ما قبله ومع قوله بعده { ولا تتبع أهواءهم وقُل آمنت بما أنزل الله من كتاب وأُمرتُ لأعدل بينكم الله رَبّنا وربّكم } \\[ الشورى : 15 \\] الآية .والمريب : الموجب الريب وهو الاتهام . فالمعنى : لفي شك يفضي إلى الظنة والتهمة ، أي شك مشوب بتكذيب ، ف { مريب } اسم فاعل من أراب الذي همزته للتعدية ، أي جاعل الريب ، وليست همزةَ أراب التي هي للجعل في قولهم : أرابني بمعنى أوهمني منه ريبة وهو ليس بذي ريب ، كما في قول بشار: ... أخوك الذي إن رِبْتَه قال إنّماأرَبْتَ وإن عاتبته لان جانبه ... على رواية فتح التاء من أربتَ ، وتقدم قوله { وإننا لفي شك مما تدعونا إليه مريب } في سورة هود ( 62 ) .\n\n",
      "translations": [
        {
          "translation": "(And they were not divided) i.e. the Jews and Christians about Muhammad (pbuh) the Qur'an and Islam (until after the knowledge) until after the exposition which is in their Scripture about the attributes and description of Muhammad (pbuh) (came unto them, through rivalry among themselves) out of resentful envy, they disbelieved in Muhammad (pbuh); (and had it not been for a Word) to delay the punishment of this nation (that had already gone forth from your Lord) had already been ordained by your Lord (for an appointed term) until an appointed time, (it surely had been judged between them) He would have already destroyed the Jews and Christians. (And those who were made to inherit the Scripture) and those who were given the Torah (after them) after the messengers; and it is also said: after the generations of old (are verily 559 in hopeless doubt concerning it) concerning the Torah; and it is also said that this means: concerning the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما ثبت أن أصل الأديان كلها هو التوحيد\n وأن الأنبياء والرسل إنما جاءوا لإظهاره وتبيينه\n ظهر أن الأمم الهالكة { مَا تَفَرَّقُوۤاْ } واختلفوا من مذاهبهم ومشاربهم { إِلاَّ مِن } بعدما { مَا جَآءَهُمُ ٱلْعِلْمُ } أي: الوحي المشتمل على بيان التوحيد من قبل الحق على ألسنة الكتب والرسل\n فتركوا مقتضى الوحي\n وأنكروا عليه فاختلفوا { بَغْياً بَيْنَهُمْ } أي: عدواناً وظلماً وإعراضاً عن الحق وأهله\n وما ظهر بينهم هذا إلا مراء وافتراء\n\n\n{ وَ } بالجملة: { لَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ } يا أكمل الرسل\n وهي إمهال انتقامهم وتأخيره { إِلَىٰ أَجَلٍ مُّسَمًّى } هو يوم القيامة { لَّقُضِيَ بِيْنَهُمْ } وحكم عليهم حين اختلافهم وتفرقهم إليه\n فاستؤصلوا فيه بالمرة { وَإِنَّ } المختلفين المتفرقين { ٱلَّذِينَ أُورِثُواْ ٱلْكِتَابَ } المنزل على أسلافهم { مِن بَعْدِهِمْ } أي: بعد انقراض أسلافهم { لَفِي شَكٍّ مِّنْهُ } أي: من الكتاب أمثال أولئك الأسلاف الضلال { مُرِيبٍ } [الشورى: 14] موقع لهم في الريب والضلال\n لذلك اختلفوا معك يا أكمل الرسل وأنكروا على كتابك ودينك\n\n\nولو كان لهم علم بكتابهم ما ظهروا عليك\n وما طعنوا في دينك وكتابك\n إذ الإيمان بكتاب من كتب الله\n ودين من أديانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما تَفرقوا } أي: أهل الكتاب من بعد أنبيائهم { إِلا مِن بعد ما جاءهم العلمُ } إلا بعد أن علموا أن الفُرقة ضلال\n وأمر متوعّد عليه على ألسنة الرسل\n { بغياً بينهم } حسداً\n وطلباً للرئاسة\n والاستطالة بغير حق\n أو: ما تفرّقوا في الدين الذي دُعوا إليه\n وهو الإسلام\n ولم يؤمنوا كما آمن بعضهم إلا مِن بعد ما جاءهم العلم بحقيقته لما يشهدونه في رسول الله صلى الله عليه وسلم والقرآن من دلائل الحقيّة\n حسبما وجدوه في كتبهم\n أو: العلم بمبعثه صلى الله عليه وسلم\n { ولولا كلمةٌ سبقتْ من ربك } \n وهي العِدَة بتأخير العقوبة { إِلى أجلٍ مسمى } هو يوم القيامة { لقُضي بينهم } أي: لوقع القضاء بينهم\n وأهلكوا حين افترقوا لعظم ما اقترنوا\n { وإِن الذين أُورثوا الكتاب مِن بعدهم } وهم المشركون { لفي شك منه } أي: القرآن { مُريبٍ } مُوقع في الريبة\n وهو بيان لكيفية كفر المشركين\n بعد بيان كيفية كفر أهل الكتاب\n أي: وإن المشركين الذي أُوتوا القرآن من بعدهم\n أي: من بعد ما أورث أهل الكتاب كتابهم\n لفي شك من القرآن مريب\n والظاهر: أن التفرُّق المذكور هنا إنما هو في شأن الرسول صلى الله عليه وسلم لأن سياق النظم إنما هو لبيان أحوال هذه الأمة\n وإنما ذكر مَن ذكر من الأنبياء ـ عليهم السلام ـ لتحقيق أن ما شرع لهؤلاء دين قديم\n أجمع عليه أولئك الأعلام ـ عليهم الصلاة والسلام ـ تأكيداً لوجوب إقامته\n وتشديداً للزجر عن التفرُّق والاختلاف\n فالتعرُّض لبيان تفرُّق أممهم عنه ربما يُوهم الإخلال بذلك المرام\n قاله أبو السعود\n الإشارة: الذي شرع الله من الدين لأقوياء عباده\n ووصّى به خواص أنبيائه: أن يشاهدوه وحده في الباطن\n ويقوموا برسم العبودية في الظاهر\n وهذا هو إقامة الدين\n الذي يجب الاتفاق عليه\n لكن لا ينال هذا إلا بعد موت النفوس\n وحط الرؤوس\n وبذل الفلوس\n ولذلك كَبُرَ على أهل الفَرْق\n قال تعالى: { كبر على المشركين ما تدعوهم إليه } \n فإذا وفق العبد لفعل ما تقدم\n وسلك طريقه اجتباه ربه لحضرته\n بعد أن هداه لسلوك طريقته\n قال تعالى { الله يجتبي إليه مَن يشاء ويهدي إليه مَن ينيب } فالاجتباء جذب\n والإنابة سلوك\n الاجتباء للحقيقة\n والإنابة للشريعة والطريقة\n وقدّم الاجتباء على الاهتداء اهتماماً بأمره لأن الجذب عناية يختص به أهل الولاية\n والإنابة هداية ينالها كل مَن تمسّك بالشريعة\n وحقيقة الجذب: شهود الخلق بلا خلق\n وحقيقة السلوك المحض: شهود الخلق بلا حق\n وحقيقة الجذب في السلوك: شهود الحق في قوالب الخلق\n أو: شهود الخلق في مظهر الحق\n فالناس ثلاثة: مجذوبون فقط\n سالكون فقط\n مجذبون سالكون\n فالأولان لا يصلحان للتربية\n والثالث هو الذي يصلح للتربية\n وهو الذي يتقدمه السلوك\n ثم يختطف إلى الحضرة في مقام الفناء\n ثم يرجع إلى السلوك في مقام البقاء\n وما وقع من التفرُّق والاختلاف في جانب النبوة\n يقع في جانب الولاية\n سُنَّة ماضية\n فيجب على الداعي إلى الله أن يجهد نفسه في الدعاء إليه\n ولا يبالي باختلافهم\n كما قال تعالى: { فَلِذَلِكَ فَٱدْعُ وَٱسْتَقِمْ كَمَآ أُمِرْتَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:110",
      "similarity": 0.7557152778109016
    },
    {
      "verse": "41:45",
      "similarity": 0.7557152778109016
    },
    {
      "verse": "11:62",
      "similarity": 0.4249651047505983
    },
    {
      "verse": "10:19",
      "similarity": 0.4142825087254888
    },
    {
      "verse": "14:9",
      "similarity": 0.37942699333997226
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}