{
  "chapter": "الشورى",
  "text": "الله الذى انزل الكتب بالحق والميزان وما يدريك لعل الساعة قريب",
  "translations": [
    {
      "translation": "It is God who has sent down the Book with the truth, and the Balance. How do you know the Hour is not near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who sent down this Book with the Truth and the Balance. And what would make you know that the Hour (of Judgement) has drawn near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who revealed the Book and the Balance for a truthful purpose. You never know. Perhaps the Hour of Doom is close at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book with the truth, and the Scales of Justice; and what do you know – possibly the Last Day could really be near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book in truth, and the Balance. And what can make you know that perhaps the Hour is close at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who revealed the Book with truth, and the balance, and what shall make you know that haply the hour be nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God it is who has sent down the Book with the truth, and also the Balance. And what shall make thee know? Haply the Hour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath revealed the Scripture with truth, and the Balance. How canst thou know? It may be that the Hour is nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has sent down the Book with the truth and the scales of justice. What will make you realize that the Hour might well have drawn near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath sent down the Book with the truth and the balance. And what shall make thee know the Hour may haply be nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has sent down the Book with the truth and [He has sent down] the Balance. What do you know—maybe the Hour is near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book in Truth, and the Balance (by which to weigh conduct). And what will make thee realise that perhaps the Hour is close at hand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has sent down the Book (the Quran) in truth, and the Balance (i.e. to act justly). And what can make you know that perhaps the Hour is close at hand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has sent down the Book in truth and the Scale. And what will let you know? The Hour is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who revealed the Book with the truth, and the Balance. And what will make you realize that perhaps the Hour is near?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has sent down the Book in truth and [also] the balance. And what will make you perceive? Perhaps the Hour is near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:17] God it is Who has revealed the Book, the Qur’ān, with the truth (bi’l-haqqi is semantically connected to anzala, ‘revealed’) as well as the Balance, Justice. And what do you know — perhaps the Hour, that is, its arrival, is near! (la‘alla, ‘perhaps’, comments on the verb describing the action, with what follows it functioning as two direct objects).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah it is who hath revealed the Scripture) He sent Gabriel with the Qur'an (with truth) to explain the Truth and falsehood, (and the Balance) and exposited therein justice. (How canst thou know) Muhammad? (It may be that the Hour is nigh) it may be that the Hour is coming soon.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفكيف يحاجون أولئك المعاندون في توحيده سبحانه مع أنه هو { ٱللَّهُ } المدبر المصلح لأمور عباده { ٱلَّذِيۤ أَنزَلَ } لإصلاحهم { ٱلْكِتَابَ } أي: جنس الكتب النازلة من عنده لتبيين مناهج توحيده ملتبساً { بِٱلْحَقِّ } الصريح المعرى عن الباطل الزاهق الزائل مطلقاً { وَ } أنزل على طبق الكتاب { ٱلْمِيزَانَ } أي: جنس الشرائع والأديا التي توزن بها أعمال الأنام وإخلاصهم فيها، وثباتهم على جادة التوحيد والإسلام، فعليك يا أكمل الرسل وعلى من تبعك امتثال عموم ما أمر ونهى من أحكام كتابك، وأن تزن أنت ومن معك أعمالكم وأخلاقكم وأحوالكم بميزان الشرع القديم والدين المستقيم { وَ } بالجملة: { مَا يُدْرِيكَ } أيها المجبول على الدراية والشعور { لَعَلَّ ٱلسَّاعَةَ } الموعودة التي تعذرت دونها التدارك والتلافي { قَرِيبٌ } [الشورى: 17] إتيانها وقيامها، وعند قيامها تتندمون وما ينفعكم الندم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { اللهُ الذي أنزل الكتابَ } القرآن، أو: جنس الكتاب، { بالحق } ملتبساً بالحق في أحكامه وأخباره، أو: بما يحق إنزاله من العقائد والأحكام، { والميزانَ } وأنزل العدل والتسوية بين الناس، أي: أنزله في كتبه المنزلة، وأمر به، أو: الشرع الذي يُوزن به الحقوق، ويساوي بين الناس\n وقيل: هو عين الميزان، أي: الآلة، أنزله في زمن نوح عليه السلام\n { وما يُدريكَ } أيَّ شيء يجعلك عالماً { لعلَّ الساعةَ } التي أخبر بها الكتاب الناطق بالحق { قريبٌ } مجيئها\n وضمّن الساعة معنى البعث فذكر الخبر، وقيل: وجه المناسبة في ذكر الساعة مع إنزال الكتاب: أن الساعة يقع فيها الحساب ووضع الموازين بالقسط، فكأنه قيل: أمركم الله بالعدل والتسوية، والعمل بالشرائع، فاعملوا بالكتاب والعدل قبل أن يفاجئكم يوم حسابكم، ووزن أعمالكم",
      "translations": []
    }
  ]
}