{
  "chapter": "الشورى",
  "text": "الله لطيفۢ بعباده يرزق من يشاء وهو القوى العزيز",
  "translations": [
    {
      "translation": "Allah is very gentle with His slaves. He provides for anyone He wills. He is the Most Strong, the Almighty.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is gracious to His creatures, and bestows favours on whosoever He will. He is all-powerful and all-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is Most Gentle to His servants and grants sustenance to whomsoever He pleases. He is All-Strong, Most Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is kind to His servants. He gives sustenance to whomever He wants. He is All-powerful and Majestic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is Benevolent upon His bondmen – He bestows sustenance to whomever He wills; and He only is the All Powerful, the Most Honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is very Gracious and Kind to His servants. He gives provisions to whom He wills. And He is the All-Strong, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is Benignant to His servants; He gives sustenance to whom He pleases, and He is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is All-gentle to His servants, providing for whomsoever He will. He is the All-strong, the All-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is gracious unto His slaves. He provideth for whom He will. And He is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is most Gracious to His creatures: He provides sustenance for whoever He wills -- for He alone is the Powerful One, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is Gentle Unto His bondmen: He provideth for whomsoever He will, and He is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is all-attentive to His servants. He provides for whomever He wishes, and He is the All-strong, the All-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gracious is Allah to His servants: He gives Sustenance to whom He pleases: and He has power and can carry out His Will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is very Gracious and Kind to His slaves. He gives provisions to whom He wills. And He is the All-Strong, the All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is Subtle towards His worshipers, and provides for whosoever He will. He is the Strong, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is kind towards His worshipers. He provides for whomever He wills. He is the Powerful, the Honorable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:19] God is Gracious to His servants, both the pious and the profligate, for He does not destroy them through hunger, despite their acts of disobedience. He provides for whomever He will, from among each of the two [classes of individuals] whatever He will. And He is the Strong, in [effecting] what He wants, the Mighty, Whose way [always] prevails.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah is gracious unto His slaves) the pious as well as the sinful; it is also said that this means: His knowledge is gracious with His slaves, both the pious and sinful among them. (He provideth for whom He will) He expands the wealth of whomever He will. (And He is the Strong) in providing the sustenance of the slaves, (the Mighty) in retribution against those who do not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ هم محجوبون بالأغشية الكثيفة الإمكانية، والأغطية الغليظة الهيولانية، مع أنه { ٱللَّهُ } المنزه ذاته عن سمة الحدوث والإمكان، المقدس أسماؤه وصفاته عن وصمة العيب والنقصان { لَطِيفٌ بِعِبَادِهِ } الخُلَّص { يَرْزُقُ مَن يَشَآءُ } منهم بالرزق المعنوي، الموصل إلى مبدئهم ومعادهم ترحماً وتلطفاً معهم { وَ } كيف لا { هُوَ ٱلْقَوِيُّ } القادر المقتدر على عموم مقدوراته الصادرة منه بمقضتى حكمته { ٱلْعَزِيزُ } [الشورى: 19] الغالب على مطلق مراداته الجارية منه حسب اختياره\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اللهُ لطيف بعباده } أي: برٌّ بهم في إيصال المنافع ودفع المضار، أوصل لهم من فنون الألطاف ما لا تكاد تناله أيدي الأفكار والظنون\n وقيل: هو مَن لطُف بالغوامض علمه، وعظُم عن الجرائم حلمه، أو: مَن ينشر المناقب ويستر المثالب، أو: يعفو عمَّن يهفو، أو: مَن يعطي العبد فوق الكفاية، ويكلّفه من الطاعة دون الطاقة\n وقال شيخ شيوخنا، سيدي عبد الرحمن الفاسي رضي الله عنه: الظاهر حمل العباد على ما اصطفاه، بدليل الإضافة المفيدة للتشريف، وأنه تعالى لطيف بهم رفيق، ومن ذلك: حمايتهم من الدنيا، ومما يطغى من الرزق، وعليه ينزل قوله: { يرزق مَن يشاء }\n هـ\n أي: يرزق على حسب مشيئته، المبنية على الحِكَم البالغة\n وفي الحديث:\n\n \" إِن من عبادي مَن لا يُصْلِحُ إيمانه إلا الغنى، ولو أفقرته لأفسده ذلك، وإِنَّ من عبادي المؤمنين مَن لا يُصْلِحُ إيمانه إلا الفقر، ولو أغنيته لأفسده ذلك \"\n \n\nوأما قوله تعالى:\n\n[هود: 6] فهو وعد لجميع الخلق، وهو مبني على المشيئة المذكورة هنا، فلا منافاة بينهما، خلافاً لابن جزي لأن المشيئة قاضية على ظاهر الوعد، ولا يقضي ظاهر الوعد عليها\n انظر الحاشية\n { وهو القويُّ } الباهر القدرة، الغالب على كل شيء، { العزيزُ } المنيع الذي لا يُغْلَب\n\n\nالإشارة: الميزان هو العقل إذ به تعرف الأشياء ومقاديرها، نافعها وضارها\n فالعقول متفاوتة كالموازين، فبعض الموازين لرقته لا يُوزن فيها إلا الشيء الرفيع، كالذهب، والإكسير، والفضة، والطيب الرفيع، وبعضها يصلح لوزن الأشياء اللطيفة، دون الخشينة، كميزان العطار وشبهه، وبعضها يصلح للأشياء الخشينة المتوسطة، كميزان الغزالين والحاكة، وبعضها لا يصلح إلا للخشين، كالفحم وشبه، وبعضها لا يصلح إلا للخشين الكثير، كالذي يُوزن به القناطير من الشيء الخشين، فالأول عقول العارفين، لا يوزن فيها إلا أنوار التوحيد وأسرار التفريد، لا يصلح لغيرها، والثاني للعباد، والزهّاد، والعلماء الصالحين، والثالث للمتجمدين من العلماء، والرابع لعامة المؤمنين، والخامس للفجار والكفار، وفيهم نزل: { يستعجل بها الذين لا يؤمنون بها\n\n\n } الآية، وما قبله هو قوله: { والذين آمنوا مشفقون منها }\n وقوله تعالى: { اللهُ لطيف بعباده } ، اعلم أن لطفه سبحانه بعباده لا ينحصر ولا ينفك عنه مخلوق، مَن ظنَّ انفكاك لطف الله عن قدره فذلك لقصور نظره، فمِن لطفه سبحانه بخلقه: أنه أعطاهم فوق الكفاية، وكلَّفهم دون الطاقة\n ومِن لطفه سبحانه: تسهيله الأرزاق، وتيسير الارتفاق، فلو تفكّر الإنسان في اللقمة التي توضع بين يديه، ماذا عمل فيها من العوالم العلوية والسفلية لتحقق بغاية عجزه، وتيقن بوجود لطفه، وكذا ما يحتاج إليه من مشروب، وملبوس، ومطعوم\n ومن لطفه سبحانه: توفيق الطاعات، وتسهيل العبادات، وتيسير الموافقات\n ومن لطفه سبحانه: حفظ التوحيد في القلوب، واطلاعها على مكاشفة الغيوب، وصيانة العقائد عن الارتياب، وسلامة القلوب عن الاضطراب\n ومن لطفه سبحانه: إيهام العاقبة لئلا يتكلموا أو ييأسوا\n ومن لطفه سبحانه بالعبد: إخفاء أجله عليه لئلا يستوحش إن كان قد دنا أجله\n ومن لطفه سبحانه بخواصه: ستر عيوبهم، ومحو ذنوبهم، حتى وصلهم بما منه إليهم، لا بما منهم إليه، فكشف لهم عن أسرار ذاته، وأنوار صفاته، فشاهدوه جهراً، وعبدوه شكراً\n وقوله تعالى: { يرزق مَن يشاء } إما رزق الأرواح، أو رزق الأشباح، وإلى هذا القسمين أشار قوله: { مَن كَانَ يُرِيدُ حَرْثَ ٱلآخِرَةِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:14",
      "similarity": 0.76182832043743
    },
    {
      "verse": "33:34",
      "similarity": 0.6822217108056202
    },
    {
      "verse": "6:103",
      "similarity": 0.5973618215735825
    },
    {
      "verse": "22:63",
      "similarity": 0.49817116129584915
    },
    {
      "verse": "18:19",
      "similarity": 0.3229444104340112
    }
  ]
}