{
  "chapter": "الشورى",
  "text": "فاطر السموت والارض جعل لكم من انفسكم ازوجا ومن الانعم ازوجا يذرؤكم فيه ليس كمثله شىء وهو السميع البصير",
  "translations": [
    {
      "translation": "the Bringer into Being of the heavens and the earth: He has given you mates from among yourselves, and given mates to the livestock, in that way multiplying you. Nothing is like Him. He is the All-Hearing, the All- Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Originator of the heavens and the earth, He has made your consorts from among you, and made pairs of cattle. He multiplies you in this way. There is no other like Him. He is all-hearing and all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Originator of the heavens and the earth, He has appointed for you pairs of your own kind, and pairs also of cattle. Thus does He multiply you. Naught in the universe is like Him. He is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Originator of the heavens and the earth. He has made you and the cattle in pairs and has multiplied you by His creation. There is certainly nothing like Him. He is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Maker of the heavens and the earth; He has created pairs for you from yourselves and pairs from the animals; He spreads your generation; nothing is like Him; and He only is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Creator of the heavens and the earth. He has made for you mates from yourselves, and for the cattle (also) mates. By this means He creates you. There is nothing like Him, and He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Originator of the heavens and the earth; He made mates for you from among yourselves, and mates of the cattle too, multiplying you thereby; nothing like a likeness of Him; and He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Originator of the heavens and the earth; He has appointed for you, of yourselves, pairs, and pairs also of the cattle, therein multiplying you. Like Him there is naught; He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Creator of the heavens and the earth. He hath made for you pairs of yourselves, and of the cattle also pairs, whereby He multiplieth you. Naught is as His likeness; and He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Creator of the Heavens and the Earth, He has made spouses for you from among yourselves, as well as pairs of livestock by means of which He multiplies His creatures. Nothing can be compared with Him! He is the All Hearing, the All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Creator of the heavens and the earth: He hath made for you mates of yourselves, and of the cattle also mates, whereby He diffuseth you. Not like Unto Him is aught, and He is the Hearer, the Beholder!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The originator of the heavens and the earth, He made for you mates from your own selves, and mates of the cattle, by which means He multiplies you. Nothing is like Him, and He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is) the Creator of the heavens and the earth: He has made for you pairs from among yourselves, and pairs among cattle: by this means does He multiply you: there is nothing whatever like unto Him, and He is the One that hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Creator of the heavens and the earth. He has made for you mates from yourselves, and for the cattle (also) mates. By this means He creates you (in the wombs). There is nothing like unto Him, and He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Originator of the heavens and the earth, He has given you from yourselves, pairs, and also pairs of cattle, thereby multiplying you. There is nothing like Him. He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Originator of the heavens and the earth. He made for you mates from among yourselves, and pairs of animals, by means of which He multiplies you. There is nothing like Him. He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He is] Creator of the heavens and the earth. He has made for you from yourselves, mates, and among the cattle, mates; He multiplies you thereby. There is nothing like unto Him, and He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:11] The Originator of the heavens and the earth, the One Who created them [without precedent]. He has made for you, from your own selves, pairs, when He created Eve from Adam’s rib, and [also] pairs, males and females, of the cattle: He multiplies you (read yadhra’ukum) by such [means], by the mentioned ‘making’, that is to say, He multiplies you through this [means] by way of propagation (the [suffixed] pronoun [-kum in yadhra’ukum, ‘He multiplies you’] refers to both human beings and cattle, but predominantly [to humans]). There is nothing like Him (ka-mithlihi: the kāf is extra, as there is no likeness of Him, exalted be He). He is the Hearer, of what is said, the Seer, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The Creator of the heavens and the earth. He hath made for you pairs) males and females (of yourselves) a human being like yourselves, (and of the cattle also pairs) males and females, (whereby He multiplieth you) He creates you in the wombs; it is also said that this means: He multiplies you through marriage. (Naught is as His likeness) in attribute, knowledge, power and providence; (and He is the Hearer) of what you say, (the Seer) of your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَذْرَؤُكُمْ فِيهِ } معناه يَخلُقُكُم فيهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He will leave you in it,\" means that He will create you in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ليسَ كمثله شيء } أي: كل الأشياء فانية فيه هالكة، فلا شيء يماثله في الشيئية والوجود { وهو السميع } الذي يسمع به كل من يسمع { البصير } الذي يبصر به كل من يبصر جمعاً وتفصيلاً يفني الكل بذاته ويبدئهم بصفاته، بيده مفاتيح الأرزاق وخزائن الملك والملكوت، يبسط ويقدِّر بمقتضى علمه على من يشاء من خلقه بحسب مصالحهم في الغنى والفقر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا أتوكل عليه ولا أنيب\n إذ هو بذاته حسب شئونه وتطوراته { فَاطِرُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } ومظهرها من كتم العدم\n ومدبر ما يتكمون بينهما من الطبائع والهيولي وصور المواليد\n ومن جملة تدبيراته سبحاه: إنه { جَعَلَ } وخلق { لَكُم } أيها المجبولون على فطرة التوحيد وإبقاء لتناسلكم وتوالدكم { مِّنْ أَنفُسِكُمْ } ومن بني نوعكم { أَزْوَاجاً } أيضاً من جنسكم وصنفكم إبقاء لكم وإدامة لبقائكم { وَمِنَ ٱلأَنْعَامِ } أيضاً { أَزْواجاً } تربية لكم وتتميماً لمعاشكم\n\n\nوبالجملة: { يَذْرَؤُكُمْ } يبثكم ويكثركم { فِيهِ } أي: في عالم الظهور ونشأة الشهادة بهذا التدبير البديع\n لتعلموا أو تعرفوا أنه { لَيْسَ كَمِثْلِهِ } أي: ليس مثله سبحانه { شَيْءٌ } يناسبه في الوجود ويماثله في التحقق والثبوت\n والمراد يقيناً بالمثل المنفي هو ذاته\n أي: لا يماثله ذاته\n فكيف غيره من قولهم: مثلك لا يبخل\n بمعنى: أنت لا تبخل\n والمراد: نفي التعدد عنه سبحانه مطلقاً على سبيل المبالغة والتأكيد\n فثبت حينئذ ألا موجود سواه\n ولا تحقق لغيره { وَ } متى ثبت هذا ظهر أنه { هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ } [الشورى: 11] أي: هو بذاته المنحصر على صفة السمع والبصر\n وجميع الأوصاف الذاتية الكاملة الشاملة آثارها عالمي الغيب والشهادة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاطرُ السماواتِ والأرضِ } خالقهما ومظهرهما، وهو خبر ثان لذلكم، أو عن مضمر، { جعل لكم من أنفسكم } من جنسكم { أزواجاً } نساء { ومن الأنعام أزواجاً } أي: وجعل للأنعام من جنسها أزواجاً، أو: خلق لكم من الأنعام أصنافاً ذكوراً وإناثاً، { يذرؤكم فيه } أي: يكثّركم فيما ذكر من التدبير البديع، من: الذرء، وهو البث، فجعل الناس والأنعام أزواجاً، حتى كان بين ذكورهم وإناثهم التوالد والتناسل، واختير لفظ \" فيه \" على \" به \" لأنه جَعَل هذا التدبير كالمنبع والمعدن للبث والتكثير\n والضمير في \" يذرؤكم \" يرجع إلى المخاطَبين والأنعام، مغلباً فيه المخاطبون العقلاء على غيرهم\n وقال الهروي: { يذرؤكم فيه } أي: يكثّركم بالتزويج، كأنه قال: يذرؤكم به\n هـ\n وقال ابن عطية: لفظة \" ذرأ \" تزيد على لفظة \" خلق \" معنى آخر، ليس في خلق، وهو توالي طبقاته على مرّ الزمان، وقوله: \" فيه \" الضمير عائد على الجعل\n وقال القتبي: الضمير للتزويج\n هـ\n { ليس كمثله شيءٌ } أي: ليس مثله شيء في شأن من الشؤون، التي من جملتها هذا التدبير البديع\n قيل: إن كلمة التشبيه كررت لتأكيد نفي التماثل لأن زيادة الحرف بمنزلة إعادة الجملة\n\n\nقال ابن عطية: الكاف مؤكدة للتشبيه، فنفي التشبيه أوكد ما يكون، وذلك أنك تقول: زيد كعمرو، وزيد مثل عمر، فإذا أردت المبالغة التامة قلت: زيد كمثل عمرو، وجرت الآية في هذا الموضع على عرف كلام العرب، وعلى هذا المعنى شواهد كثيرة\n هـ\n قال النسفي: وقيل: المثل زائد، والتقدير: ليس كهو شيء، كقوله تعالى:\n\n[البقرة: 137]، وهذا لأن المراد نفي المثليّة، وإذا لم نجعل الكاف أو المثل زيادة كان إثبات المثل\n هـ\n والجواب ما تقدّم لابن عطية\n وقيل: الآية جرت على طريق الكناية، كقولهم: مثلك لا يبخل، وغيرك لا يجود، أي: أنت لا تبخل لأنه إذا نفي البخل عمن هو مثله كان نفيه عنه أولى\n ثم قال تعالى: { وهو السميعُ البصيرُ } سميع لجميع المسموعات بلا آذان، بصير بجميع المبصرات بلا أجفان\n وذكرهما لئلا يتوهم أنه لا صفة له، كما لا مثل له، وقدّم تنزيهه عن المماثلة على وصفه بالسمع والبصر ليعلمنا أن سمعه وبصره ليس كسمعنا وبصرنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:79",
      "similarity": 0.6969875471002199
    },
    {
      "verse": "67:24",
      "similarity": 0.6959568004469955
    },
    {
      "verse": "7:179",
      "similarity": 0.5982011849514018
    },
    {
      "verse": "16:13",
      "similarity": 0.5466364858680327
    },
    {
      "verse": "6:136",
      "similarity": 0.45397961085139277
    }
  ]
}