{
  "chapter": "الشورى",
  "text": "فلذلك فادع واستقم كما امرت ولا تتبع اهواءهم وقل ءامنت بما انزل الله من كتب وامرت لاعدل بينكم الله ربنا وربكم لنا اعملنا ولكم اعملكم لا حجة بيننا وبينكم الله يجمع بيننا واليه المصير",
  "translations": [
    {
      "translation": "So call and go straight as you have been ordered to. Do not follow their whims and desires but say, 'I have iman in a Book sent down by Allah and I am ordered to be just between you. Allah is our Lord and your Lord. We have our actions and you have your actions. There is no debate between us and you. Allah will gather us all together. He is our final destination.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet to that (law) you should call them, and be constant as commanded. Do not follow their passing whims, but say: \"I believe in whatever Scripture God has revealed, and I am commanded to act with equivalence among you. God is our Lord and your Lord. To us our actions, to you your deeds. There is no dispute between you and us. God will gather us all together, and to Him is our returning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This being so, O Muhammad), call people to the same religion and be steadfast about it as you were commanded, and do not follow their desires, and say (to them): “I believe in the Book Allah has sent down. I have been commanded to establish justice among you. Allah is our Lord and your Lord. We have our deeds and you have your deeds. There is no contention between us and you. Allah will bring us all together. To Him all are destined to return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, (Muhammad), preach (My revelation) to the people and be steadfast (in your faith) as you have been commanded. Do not follow their desires but say, \"I believe in the Book which God has sent down and I have been commanded to exercise justice among you. God is our Lord and your Lord. Each of us will be responsible for his own deeds. Let there be no disputes among us. God will bring us all together and to Him we shall all return\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For this reason, call them (to Islam); and remain firm, as you are commanded to; and do not follow their desires; and say, “I accept faith in whichever Book Allah has sent down; and I am commanded to judge fairly between you; Allah is the Lord of all – ours and yours; for us are our deeds and for you are your misdeeds; there is no debate between us and you; Allah will gather all of us together; and towards Him is the return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So unto this then invite (people), and stand firm as you are commanded, and follow not their desires but say: \"I believe in whatsoever Allah has sent down of the Book and I am commanded to do justice among you. Allah is our Lord and your Lord. For us our deeds and for you your deeds. There is no dispute between us and you. Allah will assemble us (all), and to Him is the final return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To this then go on inviting, and go on steadfastly on the right way as you are commanded, and do not follow their low desires, and say: I believe in what Allah has revealed of the Book, and I am commanded to do justice between you: Allah is our Lord and your Lord; we shall have our deeds and you shall have your deeds; no plea need there be (now) between us and you: Allah will gather us together, and to Him is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore call thou, and go straight as thou hast been commanded; do not follow their caprices. And say: 'I believe in whatever Book God has sent down; I have been commanded to be just between you. God is our Lord and your Lord. We have our deeds, and you have your deeds; there is no argument between us and you; God shall bring us together, and unto Him is the homecoming.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto this, then, summon (O Muhammad). And be thou upright as thou art commanded, and follow not their lusts, but say: I believe in whatever scripture Allah hath sent down, and I am commanded to be just among you. Allah is our Lord and your Lord. Unto us our works and unto you your works; no argument between us and you. Allah will bring us together, and unto Him is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So call people to that faith and hold fast to it yourself as you are commanded, and do not be led by their desires, but say, \"I believe in the Book which God has sent down, and I am commanded to do justice between you: God is our Lord and your Lord; we are responsible for what we do and you are responsible for what you do. There is no contention between us and you. God will gather us together, for to Him we shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore Unto that summon thou, and be steadfast as thou hast been commanded, and follow not their desires. And say thou: I believe in whatsoever Allah hath sent down of the Book, and I am commanded that I should do justice between you; Allah is our Lord and your Lord; Unto us our works, and Unto you your works; let there be no contention between us and you; Allah will assemble us, and Unto Him is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So summon to this [unity of religion], and be steadfast, just as you have been commanded, and do not follow their desires, and say, ‘I believe in whatever Book Allah has sent down. I have been commanded to do justice among you. Allah is our Lord and your Lord. Our deeds belong to us and your deeds belong to you. There is no quarrel between us and you. Allah will bring us together and toward Him is the destination.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now then, for that (reason), call (them to the Faith), and stand steadfast as thou art commanded, nor follow thou their vain desires; but say: \"I believe in the Book which Allah has sent down; and I am commanded to judge justly between you. Allah is our Lord and your Lord: for us (is the responsibility for) our deeds, and for you for your deeds. There is no contention between us and you. Allah will bring us together, and to Him is (our) Final Goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So unto this (religion of Islam, alone and this Quran) then invite (people) (O Muhammad SAW), and Istaqim [(i.e. stand firm and straight on Islamic Monotheism by performing all that is ordained by Allah (good deeds, etc.), and by abstaining from all that is forbidden by Allah (sins and evil deeds, etc.)], as you are commanded, and follow not their desires but say: \"I believe in whatsoever Allah has sent down of the Book [all the holy Books, this Quran and the Books of the old from the Taurat (Torah), or the Injeel (Gospel) or the Pages of Ibrahim (Abraham)] and I am commanded to do justice among you, Allah is our Lord and your Lord. For us our deeds and for you your deeds. There is no dispute between us and you. Allah will assemble us (all), and to Him is the final return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so invite and go straight as you are ordered, and do not follow their desires and say: 'I believe in whatever Book Allah has sent down. I am ordered to be just among you. Allah is our Lord and your Lord. We have our deeds and you have yours; there is no argument between us and you, Allah will bring us all together, to Him is the arrival'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To this go on inviting, and be upright as you were commanded, and do not follow their inclinations, and say, “I believe in whatever Book God has sent down, and I was commanded to judge between you equitably. God is our Lord and your Lord. We have our deeds, and you have your deeds. Let there be no quarrel between us and you. God will bring us together, and to Him is the ultimate return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So to that [religion of Allah] invite, [O Muhammad], and remain on a right course as you are commanded and do not follow their inclinations but say, \"I have believed in what Allah has revealed of the Qur'an, and I have been commanded to do justice among you. Allah is our Lord and your Lord. For us are our deeds, and for you your deeds. There is no [need for] argument between us and you. Allah will bring us together, and to Him is the [final] destination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:15] So to that then, [to that] affirmation of [God’s] Oneness, summon, O Muhammad (s), people, and be upright, in [summoning them to] this, just as you have been commanded, and do not follow them in their desires, to abandon it. And say: ‘I believe in whatever Book God has revealed. And I have been commanded to be just between you, in passing judgement. God is our Lord and your Lord. Our deeds concern us and your deeds concern you, and so each [one of us] will be requited according to his [own] deeds. There is no argument, [no] dispute, between us and you — this was [revealed] before the command to struggle [against them]. God will bring us together, at the [time of the] Return to decide [definitively] between us, and to Him is the [final] destination’, the [ultimate] return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto this, then, summon (0 Muhammad)) summon unto belief in Allah's divine Oneness and to the Scripture of your Lord. (And be thou upright) in your profession of Allah's divine Oneness (as thou art commanded) in the Qur'an, (and follow not their lusts) and follow not the Qiblah and religion of the Jews, (but say: I believe in whatever Scripture Allah hath sent down) of Scriptures to the prophets, (and I am commanded) in the Qur'an (to be just among you) through faith in Allah's divine Oneness. (Allah is our Lord and your Lord) He will judge between us on the Day of Judgement. (Unto us our works) unto us is the worship of Allah and the religion of Islam (and unto you your works) and against you is the worship of idols and Satan's religion; (no argument between us and you) regarding religion. (Allah will bring us together) on the Day of Judgement, (and unto Him is the journeying) and unto Him is the destination of both believers and disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ } معناه لا خصومةَ بيننا وبينَكم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {There is no obligation between us and you} [means that] there is no obligation between us and you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولو كان لهم علم بكتابهم ما ظهروا عليك، وما طعنوا في دينك وكتابك؛ إذ الإيمان بكتاب من كتب الله، ودين من أديانه، ورسول من رسله يوجب الإيمان بجميع الكتب والرسل بناء على الأصل الذي سمعت من التوحيد { فَلِذَلِكَ } الأصل الذي هو التوحيد الذاتي المسقط لعموم الإضافات والاختلافات { فَٱدْعُ } يا أكمل الرسل كل من تدعوه من المجبولين على فطرة التوحيد والإسلام { وَٱسْتَقِمْ } أنت في نفسك على جادة التوحيد { كَمَآ أُمِرْتَ } من قِبل ربك، ومكن إقدام عزمك عليها معتدلاً حنيفاً مائلاً عن كلا طرفي الإفراط والتفريط { وَلاَ تَتَّبِعْ أَهْوَآءَهُمْ } أي: أهوية أصاب الخلاف والاختلاف، الضالين المترددين في أودية الجهالات وأغوار الخيلات المنافية لصفاء مشرب التوحيد\n\n\n\n\n{ وَقُلْ } يا أكمل الرسل بعد صفاء سرك وخلاء خلدك عن الأكدار الموجبة للاختلاف: { آمَنتُ بِمَآ أَنزَلَ ٱللَّهُ } أي: بجميع ما أنزل لله { مِن كِتَابٍ } مبين موضح لطريق الحق وتوحيده { وَ } قل بعد ذلك أيضاً إظهاراً لدعوتك إياهم: { أُمِرْتُ } من قِبل ربي { لأَعْدِلَ بَيْنَكُمُ } وأبين لكم طريق العدالة الإلهية بمقتضى وحي الله وإلهامه إياي، فأنا مأمور بتبليغه وتبيينه إياكم وتربيتكم وتكميلكم؛ إذ { ٱللَّهُ } المدبر لأمور عموم عباده { رَبُّنَا } الذي ربانا للإرشاد والتكميل { وَرَبُّكُمْ } أراد أن يربيكم بالهداية والرشاد، وإن لم نكن مأمورين من عنده سبحانه لإهدائكم وإرشادكم ما لنا معكم\n\n\n\n\nإذ { لَنَآ أَعْمَالُنَا } أي: جزاء صالحها وفاسدها { وَلَكُمْ } أيضاً { أَعْمَالُكُمْ } كذلك؛ إذ كل منَّا ومنكم مجزي بما عمل { لاَ حُجَّةَ } أي: نزاع ولا خومة { بَيْنَنَا وَبَيْنَكُمُ } بعدما بغلناكم ما أمرنا بتبليغه، وأوضحنا لكم طريق الحق، وبالجملة: { ٱللَّهُ } أي: الذات المستجمع لجميع الأسماء والصفات { يَجْمَعُ بَيْنَنَا } وبينكم، إن تعلق مشيئته بجمعنا { وَ } كيف لا يجمع بيننا سبحانه { إِلَيْهِ ٱلْمَصِيرُ } [الشورى: 15] أي: رجوع الكل إ ليه كما هو صدوره منه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فلذلك فادْعُ } أي: فلأجل ذلك التفرُّق، ولما حدث بسببه من تشعُّب الكفر شعباً، فادع إلى الاتفاق والائتلاف على الملّة الحنيفيّة القيّمة، { واستقِمْ } عليها، وعلى الدعوة إليها { كما أُمرتَ } كما أمرك الله\n أو: لأجل ما شرع لكم من الدين القويم القديم، الحقيق بأن يتنافس فيه المتنافسون، فادع الناس كافة إلى إقامته، والعمل بموجبه فإن كلاًّ من تفرقهم وشكِّهم، سبب للدعوة إليه والأمر بها، أو: فإلى ذلك الدين المشروع فادع، واستقم عليه، وعلى الدعوة إليه، كما أُمرت وأوحي إليك\n { ولا تتبع أهواءهم } الباطلة، وعقائدهم الزائغة، { وقل آمنتُ بما أنزلَ اللهُ من كتاب } أيّ كتاب كان من الكتب المنزلة، لا كالذين آمنوا ببعض وكفروا ببعض، وهم أهل الكتاب،\n\n[النساء: 151]، وفيه تحقيق للحق، وبيان لاتفاق الكتب في الأصول، وتأليف لقلوب أهل الكتابين، وتعريض بهم\n { وأُمرتُ لأعْدِلَ بينكم } في الحكم إذا تخاصمتم فتحاكمتم إليّ، أو: في تبليغ الشرائع والأحكام، لا أخص بعضاً دون بعض، أو: لأُسوِّي بيني وبينكم، ولا آمركم بما لا أعملُ به، ولا أخالفكم إلى ما أنهاكم عنه\n أو: لا أفرق بين أكابركم وأصاغركم\n واللام: إما على حقيقتها، أي: أمرت بذلك لأعدل، أو: زائدة، أي: أمرت أن أعدل بينكم\n { اللهُ ربُّنا وربُّكم } خالقنا جميعاً، ومتولي أمورنا، كلنا عبيده، { لنا أعمالنا } لا يتخطانا ثوابها أو عقابها، { ولكم أعمالكم } لا يجاوزكم وبالها إلى غيركم، أو: لنا ديننا التوحيد، ولكم دينكم الشرك\n { لا حُجةَ بيننا وبينكم } أي: لا خصومة لأن الحق قد وضح، ولم يبق للمحاجّاة حاجة، ولا للفصاحة محل، سوى المكابرة\n { اللهُ يجمع بيننا } يوم القيامة { وإِليه المصيرُ } المرجع، فيظهر هناك حالنا وحالكم\n وهذه محاججة، لا متاركة، فلا نسخ فيها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:149",
      "similarity": 0.36512609258868506
    },
    {
      "verse": "2:285",
      "similarity": 0.343785292315475
    },
    {
      "verse": "7:159",
      "similarity": 0.33978388692944306
    },
    {
      "verse": "3:66",
      "similarity": 0.3391686987831084
    },
    {
      "verse": "7:181",
      "similarity": 0.3330312964797484
    }
  ]
}