{
  "chapter": "الشورى",
  "text": "له مقاليد السموت والارض يبسط الرزق لمن يشاء ويقدر انه بكل شىء عليم",
  "translations": [
    {
      "translation": "The Keys of the heavens and earth belong to Him. He expands the provision of anyone He wills or restricts it. He has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He holds the keys of the heavens and the earth. He increases or decreases the provision of any one He will. He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth. He enlarges and straitens the sustenance of whomsoever He pleases. Surely He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In His hands are the keys of the heavens and the earth. He increases and determines the sustenance of whomever He wants. He has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Him only are the keys of the heavens and the earth; He increases the sustenance for whomever He wills and restricts it; indeed He is the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. He enlarges provision for whom He wills, and straitens. Verily, He is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the treasures of the heavens and the earth; He makes ample and straitens the means of subsistence for whom He pleases; surely He is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. He outspreads and straitens His provision to whom He will; surely He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth. He enlargeth providence for whom He will and straiteneth (it for whom He will). Lo! He is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is in complete control of heaven and earth; He gives abundantly to whoever He wills and gives sparingly to whoever He wills. He has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His are the keys of the heavens and the earth. He expandeth provision for whomsoever He will and stinteth. Verily; He is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth: He expands the provision for whomever He wishes, and tightens it [for whomever He wishes]. Indeed He has knowledge of all things.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth: He enlarges and restricts. The Sustenance to whom He will: for He knows full well all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth, He enlarges provision for whom He wills, and straitens (it for whom He wills). Verily! He is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the keys of the heavens and the earth. He outspreads and withholds His provisions to whom He will, surely, He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs absolute control of the heavens and the earth. He spreads the bounties to whomever He wills, or reduces it. He is aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong the keys of the heavens and the earth. He extends provision for whom He wills and restricts [it]. Indeed He is, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:12] To Him belong the keys of the heavens and the earth, the keys to their storehouses of rain and vegetation and other things. He extends provision, He makes it abundant, for whomever He will, as a test [of their gratitude], and He restricts [it], He straitens it for whomever He will, as a trial. Truly He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(His are the keys of the heavens) the stores of the heavens: rain (and the earth) vegetation. (He enlargeth providence for whom He will) He gives abundant provision to whom He will (and straiteneth (it for whom He will). Lo! He is Knower of all things) regarding expansion and straitening of provision.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَهُ مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه مفاتيحُها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He has the keys to the heavens and the earth}, means that He has control over them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { لَهُ } لا لغيره من الوسائل والأسباب العادية الظاهرة في أظلال المظاهر والمجالي { مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: مفاتيح خزائن العلويات من الأسماء والصفات\n والسفليات من مظاهر الطبائع\n والمرايا العدمية القابلة لانعكاس شمس الذات من مشكاة الأسماء والصفات\n هو بذاته { يَبْسُطُ } ويقبض { ٱلرِّزْقَ } الصوري والمعنوي { لِمَن يَشَآءُ } من أضلاله وعكوسه { وَيَقْدِرُ } ويقبض عمن يشاء منهم\n وبالجملة: { إِنَّهُ } سبحانه بذاته حسب أسمائه وصفاته { بِكُلِّ شَيْءٍ } دخل تحت ظل وجوده بمقتضى فضله وجوده { عَلِيمٌ } [الشورى: 12] بعلمه الحضوري\n لا يعزب عن حضوره شيء مما ظهر وبطن\n وغاب وشهد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { له مقاليدُ السماواتِ والأرضِ } مفاتيح خزائنها\n { يبسطُ الرزقَ لمَن يشاءُ } أي: يوسعه { ويَقْدرُ } أي: يُضيق على ما تقتضيه المناسبة المبنية على الحِكَم البالغة\n { إِنه بكل شيءٍ عليمٌ } لا يخفى عليه شيء\n فيفعل كل ما يفعل على ما ينبغي أن يفعل\n على ما تقتضيه مشيئته وحكمته البالغة\n قال ابن عرفة: تضمنت هذه الآية وصفه تعالى بجميع صفات الكمال\n فالقدرة في قوله: { فاطر السماوات والأرض } والوحدانية في قوله: { ليس كمثله شيء } والإرادة في قوله: { يبسط الرزق لمَن يشاء } لأن تخصيص البعض بالبسط إنما هو بالإرادة\n والعلم في قوله: { إنه بكل شيء عليم } \n والكلام في قوله: { شرع لكم من الدين } لأن المراد به الحكم الشرعي\n وهو خطاب الله تعالى المعلّق بأفعال المكلفين\n وخطابه كلامه\n هـ\n زاد في الحاشية الفاسية: يعني وكل وصف من هذه الأوصاف يستلزم الحياة\n مع أنه قال: { يُحيي الموتى } والإحياء إنما يكون من الحي\n هـ\n الإشارة: قوله تعالى: { وما اختلفتم فيه من شيء } قال القشيري: ويُقال إذا لم تهتدوا إلى شيء وتعرضت منهم الخواطر فَدَعُوا تدبيركم والتجئوا إلى ظلِّ شهود تقديره\n وانتظروا ما الذي ينبغي لكم أن تفعلوا بحُكم تيسيره\n ويقال: إذا اشتغلت قلوبكم بحديث أنفسكم\n فلا تدرون أبالسعادة جَرَى حُكْمُكم\n أو بالشقاوة جرى اسمُكم\n فَكِلوا الأمرَ فيه إلى الله\n واشتغلوا في الوقت بأمر الله\n دون التفكُّر فيما ليس له سبيل إلى عِلْمِه من عواقبكم\n هـ\n وقوله: { فاطرُ السماوات والأرض } أي: شققهما من أسرار الغيب\n ومتجلٍّ بهما وسائر الكائنات\n جعل لكم في عالم الحكمة من أنفسكم أزواجاً ليقع التناسل\n بعضكم من بعض\n ومن الأنعام أزواجاً ليقع التناسل فيها وأما بحر الجبروت فليس كمثله شيء\n\nوقال بعض العارفين: ليت شعري هل معه شيء حتى يشبهه أو لا يشبهه\n كان الله ولا شيء معه\n وهو الآن على ما عليه كان\n فقوله تعالى: { ليس كمثله شيء } أي: ليس معه شيء حتى يشبهه\n وقال الورتجبي عن الواسطي: أمور التوحيد كلها خرجت من هذه الآية لأنه ما عبّر عن الحقيقة بشيء إلا والعلة مصحوبة\n والعبارة منقوضة لأن الحق لا يُنعت على أقداره لأن كل ناعت مُشرف على المنعوت\n وجلّ أن يشرف عليه مخلوق\n وقال الشبلي: كل ما ميزتموه بأوهامكم\n وأدركتموه بعقولكم في أتم معانيكم\n فهو مصروف إليكم\n ومردود عليكم\n محدث مصنوع مثلكم لأن حقيقته عالية عن أن تلحقها عبارة\n أو يدركها وهم\n أو يحيط بها علم\n كلا\n كيف يحيط به علم\n وقد اتفق فيه الأضداد\n بقوله:\n[الحديد: 3]؟ أيّ عبارة تخبر عن حقيقة هذه الألفاظ؟ كلاّ\n قصرت عنه العبارة\n وخرست الألسن لقوله: { ليس كمثله شيء }\n هـ\n ولما عَرَّف بذاته وصفاته\n ذكر شرائعه لعباده\n فقال: { شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِ نُوحاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:63",
      "similarity": 0.8490208959141662
    },
    {
      "verse": "5:97",
      "similarity": 0.5564453985701105
    },
    {
      "verse": "29:62",
      "similarity": 0.34898988758066796
    },
    {
      "verse": "39:52",
      "similarity": 0.3275859111944828
    },
    {
      "verse": "34:36",
      "similarity": 0.3225245386501621
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/42:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/42:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/42:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}