{
  "chapter": "الشورى",
  "text": "وما اختلفتم فيه من شىء فحكمه الى الله ذلكم الله ربى عليه توكلت واليه انيب",
  "translations": [
    {
      "translation": "The judgement concerning anything you differ about is Allah's concern. That is Allah, my Lord - I have put my trust in Him and to Him I turn -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In whatever matter you disagree the ultimate judgement rests with God. This is God, my Lord; in Him have I placed my trust, if to Him I turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The judgement on whatever you differ rests with Allah. Such is Allah, my Lord; in Him I have put all my trust and to Him I always turn in devotion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever differences you may have about the Quran, the final decision rests with God. In Him do I trust and to Him do I turn in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“The final decision for the matters in which you differ rests with Allah; such is my Lord – I rely on Him; and towards Him do I incline.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in whatsoever you differ, the decision thereof is with Allah. Such is Allah, my Lord in Whom I put my trust, and to Him I turn in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in whatever thing you disagree, the judgment thereof is (in) Allah's (hand); that is Allah, my Lord, on Him do I rely and to Him do I turn time after time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you are at variance on, the judgment thereof belongs to God. That then is God, my Lord; in Him I have put my trust, and to Him I turn, penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in whatsoever ye differ, the verdict therein belongeth to Allah. Such is my Lord, in Whom I put my trust, and unto Whom I turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In whatever you may differ, [O believers] the verdict thereon rests with God. [Say, therefore], \"Such is God, my Lord: in Him I have placed my trust, and to Him I always turn.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever it be wherein ye differ the decision thereof is with Allah; such is Allah, my Lord: in Him put my trust and Unto Him I turn in penitenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever thing you may differ about, its judgement is with Allah. That is Allah, my Lord. In Him, I have put my trust, and to Him do I turn penitently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever it be wherein ye differ, the decision thereof is with Allah: such is Allah my Lord: In Him I trust, and to Him I turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in whatsoever you differ, the decision thereof is with Allah (He is the ruling Judge). (And say O Muhammad SAW to these polytheists:) Such is Allah, my Lord in Whom I put my trust, and to Him I turn in all of my affairs and in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you differ upon, its judgement belongs to Allah. Such is Allah, my Lord, in Him I have put my trust, and to Him I turn in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever matter you differ about, its judgment rests with God. “Such is God, my Lord, in Whom I trust, and unto Him I repent.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in anything over which you disagree - its ruling is [to be referred] to Allah. [Say], \"That is Allah, my Lord; upon Him I have relied, and to Him I turn back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:10] And whatever you may differ, with disbelievers, in, of religion or otherwise, the verdict therein belongs, it will return, to God, on the Day of Resurrection; He will judge between you. Say to them: That then is God, my Lord; in Him I have put my trust, and to Him I turn penitently.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in whatsoever ye differ) regarding religion, (the verdict therein belongeth to Allah) seek its verdict in Allah's book. (Such is my Lord) Who has thus commanded you, (in Whom I put my trust) I rely on Him, (and unto Whom I turn.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أم مفسد له { فَحُكْمُهُ } مفوض { إِلَى ٱللَّهِ } وأمره موكول إلى كتبه ورسله\n فعليكم التعبد والامتثال بما أمرتم به ونهيتهم عنه على ألسنة الرسل والكتب\n إذ لا مدبر لأموركم سواه\n ولا متصرف في الوجود إلا هو\n\n\n{ ذَلِكُمُ } الذي سمعتم وصفه واستقلاله في ملكه وملكوته { ٱللَّهُ رَبِّي } وربكم\n فاعبدوه حق عبادته\n وفوضوا أموركم كلها إليه\n وإن خوفتموني بغيره مع أنه لا غير في الوجود معه\n فأنا { عَلَيْهِ } لا على غيره من الوسائل والأسباب العادية { تَوَكَّلْتُ } واتخذته وكيلاً\n يدفع عني مؤنة جميع من عاداني { وَإِلَيْهِ } لا إلى الوسائط { أُنِيبُ } [الشورى: 10] وأرجع في مطلق الملمات والخطوب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما اختلفتمْ فيه من شيءٍ فحُكمه إِلى الله } ، حكاية لقول رسول الله صلى الله عليه وسلم للمؤمنين، بدليل قوله: { ذلكم اللهُ ربي } أي: ما خالفكم الكفار فيه من أهل الكتاب والمشركين، من أمور الدين، واختلفتم أنتم وهم، فحُكم ذلك المختلف فيه راجع إلى الله، ومُفوض إليه، وهو إثابةُ المحقّين فيه، ومعاقبة المبطلين\n والمختار العموم، أي: وما اختلفتم فيه أيها الناس من أمور الدين، سواء رجع ذلك الاختلاف إلى الأصول أو الفروع، فحُكم ذلك إلى الله، وقد قال في آية أخرى:\n\n[النساء: 59]\n فكل ما اختلف فيه يُردّ إلى كتاب الله، ثم إلى سنّة رسول الله، ثم إلى الإجماع، ثم القياس، فهذه هي قواعد الشريعة، وعليها بُنيت الأحكام، فمَن خرج عنها فهو مبطل، ففي كتاب الله، وسنّة رسوله صلى الله عليه وسلم من علم الأصول والفروع ما فيه غُنية، فإن لم يوجد نص فالإجماع أو القياس\n وقيل: ما اختلفتم فيه من العلوم، التي لا تتصل بتكليفكم، ولا طريق لكم إلى علمه، فقولوا: الله أعلم\n ثم قال: { ذلكم اللهُ ربي } أي: ذلكم العظيم الشأن الله مالكي ومدبر أمري، { عليه توكلتُ } في جميع أموري، لا على غيره، { وإِليه أُنيبُ } أرجع في كل ما يعرض لي، لا إلى أحد سواه\n وحيث كان التوكُّل أمراً واحداً مستمراً، والإنابة متعددة، متجددة بحسب تجدُّد مؤداها، أُوثر في الأول صيغة الماضي، والثاني صيغة المضارع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:8",
      "similarity": 0.6611197550287694
    },
    {
      "verse": "13:27",
      "similarity": 0.652824494755056
    },
    {
      "verse": "30:31",
      "similarity": 0.6430121383250378
    },
    {
      "verse": "39:54",
      "similarity": 0.6420955290185014
    },
    {
      "verse": "40:13",
      "similarity": 0.6322694257868002
    }
  ]
}