{
  "chapter": "الشورى",
  "text": "من كان يريد حرث الءاخرة نزد له فى حرثه ومن كان يريد حرث الدنيا نؤته منها وما له فى الءاخرة من نصيب",
  "translations": [
    {
      "translation": "If anyone desires to cultivate the Next World, We will increase him in his cultivation. If anyone desires to cultivate this world, We will give him some of it but he will have no share in the Next World.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the fruits of the Hereafter, We shall add to his fruit. As for him who desires the fruits of this world, We shall give to him of these, but he will have no share in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever seeks the harvest of the Hereafter, We shall increase for him his harvest, and whoever seeks the harvest of this world, We shall give him thereof; but he will have no share in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall increase the harvest of those who seek a good harvest in the life hereafter. However, those who want to have their harvest in this life will be given it but will have no share in the hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever aspires for the yield of the Hereafter – We increase its yield for him; and whoever aspires for the yield of this world – We give him part of it, and he has no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires the reward of the Hereafter, We give him increase in his reward, and whosoever desires the reward of this world, We give him thereof, and he has no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the gain of the hereafter, We will give him more of that gain; and whoever desires the gain of this world, We give him of it, and in the hereafter he has no portion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desires the tillage of the world to come, We shall give him increase in his tillage; and whoso desires the tillage of this world, We shall give him of it, but in the world to come he will have no share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desireth the harvest of the Hereafter, We give him increase in its harvest. And whoso desireth the harvest of the world, We give him thereof, and he hath no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To him who desires a harvest in the life to come, We shall grant an increase in his harvest; whereas to him who desires [but] a harvest in this world, We [may] give something thereof -- but he will have no share in [the blessings of] the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever seeketh the tillage of the Hereafter Unto him We shall give increase in his tillage; and whosoever seeketh the tillage of the world We shall give him somewhat thereof, and in the Hereafter his shall be no portion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the tillage of the Hereafter, We will enhance for him his tillage, and whoever desires the tillage of the world, We will give it to him, but he will have no share in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To any that desires the tilth of the Hereafter, We give increase in his tilth, and to any that desires the tilth of this world, We grant somewhat thereof, but he has no share or lot in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires (with his deeds) the reward of the Hereafter, We give him increase in his reward, and whosoever desires the reward of this world (with his deeds), We give him thereof (what is written for him), and he has no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever hopes for the tillage of the Everlasting Life, We will increase his tillage; and whoever hopes for the tillage of this world, We give him some of it, but in the Everlasting Life he shall have no share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the harvest of the Hereafter, We increase for him his harvest; and whoever desires the harvest of this world, We give him thereof, and he has no share of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the harvest of the Hereafter - We increase for him in his harvest. And whoever desires the harvest of this world - We give him thereof, but there is not for him in the Hereafter any share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:20] And whoever desires, in return for his actions, the harvest of the Hereafter, in other words, its gains, and that is reward, We will enhance for him his harvest, by multiplying in it the good deed up tenfold or more; and whoever desires the harvest of this world, We will give him of it, without multiplying [any of it], [giving him] only what is his [preordained] share; but in the Hereafter he will have no share.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso desireth the harvest of the Hereafter) the reward of the Hereafter through his works for Allah, (We give him increase in its harvest) We give him increase in his reward; it is also said: We give him increase in his strength, activity and reward in the Hereafter. (And Whoso desireth the harvest of the world) and whoever desires the reward of the life of the world through the works that Allah has made obligatory upon him, (We give him thereof) We give him of the life of the world and drive away from him some of its hardship, (and he hath no portion) he has no reward (in the Hereafter) in Paradise because he did not work for Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ من كانَ يريد حرث الآخرة } بقوة إرادته وشدّة طلبه لزيادة نصيب اللطف وتوجهه وإقباله إلى الحق لحيازة القرب { نزد له } في نصيبه\n فنصلح حال آخرته ودنياه لأن الدنيا تحت الآخرة وظلها ومثالها وصورتها تتبعها { ومَن كانَ يريد حرث الدنيا } وأقبل بهواه إلى جهة السفل وتعلق همّه بزيادة نصيب القهر وبَعُدَ عن الحق { نؤته منها } ما هو نصيبه وما قسم له وقدر لا مزيد عليه { وما له في الآخرة من نصيب } لإعراضه عنها وعقد همّه بالأدون ووقوفه معه وجعله حجاباً للأشرف وإدباره عن النصيب الأوفر\n فلا يتهيأ لقبوله ولا يستعد لحصوله إذ الأصل لا يتبع الفرع\n { قُلْ لا أسألكم عليه أجراً إلاَّ المودّة في القُربى } استثناء منقطع وفي القربى متعلق بمقدر أي: المودة الكائنة في القربى\n ومعناه: نفي الأجر أصلاً لأن ثمرة مودّة أهل قرابته عائدة إليهم لكونها سبب نجاتهم\n إذ المودة تقتضي المناسبة الروحانية المستلزمة لاجتماعهم في الحشر\n كما قال عليه الصلاة والسلام:\n \" المرء يحشر مع من أحبّ \" \nفلا تصلح أن تكون أجراً له ولا يمكن من تكدّرت روحه وبعدت عنهم مرتبته محبتهم بالحقيقة\n ولا يمكن من تنوّرت روحه وعرف الله وأحبه من أهل التوحيد أن لا يحبهم لكونهم أهل بيت النبوّة ومعادن الولاية والفتوة محبوبين في العناية الأولى\n مربوبين للمحل الأعلى فلا يحبهم إلا من يحبّ الله ورسوله ويحبّه الله ورسوله\n ولو لم يكونوا محبوبين من الله في البداية لما أحبَّهم رسول الله إذ محبته عين محبته تعالى في صورة التفصيل بعد كونه في عين الجمع وهم الأربعة المذكورون في الحديث الآتي بعد\n ألا ترى أن له أولاداً آخرين وذوي قرابات في مراتبهم كثيرين لم يذكرهم ولم يحرض الأمّة على محبتهم تحريضهم على محبة هؤلاء وخص هؤلاء بالذكر\n روي أنها لما نزلت قيل:\n \" يا رسول الله! من قرابتك هؤلاء الذين وُجِبَت علينا مودّتهم؟ قال: \" عليّ وفاطمة والحسن والحسين وأبناؤهما \" \nثم لما كانت القرابة تقتضي المناسبة المزاجية المقتضية للجنسية الروحانية كان أولادهم السالكون لسبيلهم\n التابعون لهديهم في حكمهم\n ولهذا حرَّض على الإحسان إليهم ومحبتهم مطلقاً ونهى عن ظلمهم وإيذائهم ووعد على الأول ونهى عن الثاني\n قال النبي صلى الله عليه وسلم:\n \" حرِّمت الجنة على من ظلم أهل بيتي وآذاني في عترتي ومن اصطنع صنيعة إلى أحد من ولد عبد المطلب ولم يجازه عليها فأنا أجازيه عليها غداً إذا لقيني يوم القيامة \" \nوقال عليه السلام:\n \" من مات على حبّ آل محمد مات مغفوراً له\n ألا ومن مات على حب آل محمد مات تائباً\n ألا ومن مات على حب آل محمد مات مؤمناً\n ألا ومن مات على حب آل محمد مات شهيداً مستكمل الإيمان\n ألا ومن مات على حب آل محمد بشّره ملك الموت بالجنة ثم منكر ونكير\n ألا ومن مات على حب محمد وآل محمد يزف إلى الجنة كما تزف العروس إلى بيت زوجها\n ألا ومن مات على حب آل محمد فتح له في قبره بابان إلى الجنة\n ألا ومن مات على حب آل محمد جعل الله قبره مزار ملائكة الرحمة\n ألا ومن مات على حب آل محمد مات على السنّة والجماعة\n ألا ومن مات على بغض آل محمد جاء يوم القيامة مكتوباً بين عينيه: آيس من رحمة الله\n ألا ومن مات على بغض آل محمد مات كافراً\n ألا ومن مات على بغض آل محمد لم يشمّ رائحة الجنة \"\n \n \n{ ومن يقترف حسنة } بمحبة آل الرسول { نزد له فيها حسناً } بمتابعته لهم في طريقتهم لأن تلك المحبة لا تكون إلا لصفاء الاستعداد وبقاء الفطرة\n وذلك يوجب التوفيق لحسن المتابعة وقبول الهداية إلى مقام المشاهدة\n فيصير صاحبها من أهل الولاية ويحشر معهم في القيامة { إنَّ الله غفور } بتنويره ظلمة صفات من أحبّ أهله { شَكُور } لسعي من ناسبهم فيحبهم بتضعيف جزاء حسناته وإفاضة كمالاته بتجليات صفاته ليوافقهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أشار سبحانه إلى كمال تنزعه وتقدس ذاته عن وصمة النقصان مطلقاً\n وإلى كمال ترحمه وتلطفه مع خُلَّص عباده\n قال: { مَن كَانَ } منهم { يُرِيدُ حَرْثَ ٱلآخِرَةِ } أي: يزرع في النشأة الأولى بذور الأعمال الصالحة والأخلاق الحميدة\n ليحصد ما يترتب عليها من المثوبات والكرامات في النشأة الأخرى { نَزِدْ لَهُ فِي حَرْثِهِ } ونضاعف ثوابها لأجله\n ونعطه من اللذات الروحانية ما لا مزيد عليه تفضلاً منَّا وتكريماً { وَمَن كَانَ } منهم { يُرِيدُ حَرْثَ ٱلدُّنْيَا } ونوى نماء بذوره فيها { نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي ٱلآخِرَةِ } ولذاتها الباقية { مِن نَّصِيبٍ } [الشورى: 20] لاختياره لذات الدنيا وشهواتها الفانية على ما في الآخرة من اللذات الروحانية\n لذلك ما له حظ في الآخر ونصيب من لذاتها\n\n\nأهم بأنفسهم يحرمون نفوسهم من اللذات الأخروية والفتوحات الروحانية { أَمْ لَهُمْ شُرَكَاءُ } من شياطين الجن والإنس ظاهرهم عليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { مَن كان يُريد حرثَ الآخرةِ } ، سُمِّي ما يعمله العامل مما يبتغي به الفائدة المستقبلة حرثاً، مجازاً لأن الحرث: إلقاء البذر في الأرض لننظر نتاجه، فأطلقه على العمل، لجامع حصول النتاج، أي: مَن كان يريد بأعماله ثواب الآخرة { نَزِدْ له في حَرْثِه } نضاعف له ثوابه، الواحدة بعشر إلى سبعمائة فما فوقها، أو: نَزِدْ له في توفيقه وإعانته، وتسهيل سبيل الخيرات والطاعات عليه. { ومَن كان يريد } بأعماله { حَرْثَ الدنيا } وهو متاعها وطيباتها { نُؤْتِهِ منها } أي: شيئاً منها، حسبما قسمناه له، لا ما يريده ويبتغيه، { وما لهُ في الآخرة من نصيبٍ } إذا كانت همته مقصورة على الدنيا. ولم يذكر في عامل الآخرة أن رزقه المقسوم يصل إليه، للاستهانة بذلك إلى جنب ما هو بصدده، من زكاء أعماله، وفوزه في المآب لأن ما يُعطى في الآخرة يستحقر أن يُذكر معه غيره من الدنيا. الإشارة: قد مرّ مِراراً ذم الدينا وصرف الهمة إليها، وفي الحديث عن أبي سعيد الخدري: أنه سمع رسول الله صلى الله عليه وسلم يقول في بعض خطبه:\n \" أيها الناس، أَقبِلوا على ما كلفتموه من صالح آخرتكم، وأَعْرِضوا عما ضُمِنَ لكم من أمر دنياكم، ولا تشغلوا جوارحكم جوارح غذيت بنعمته في التعرُّض لخطأ بمعصيته، واجعلوا شغلكم بالتماس معرفته، واصرفوا هممكم إلى التقرُّب بطاعته، إنه مَن بدأ بنصيبه من الدنيا فاته نصيبُه من الآخرة، ولم يدرك منها ما يريد، ومَن بدأ بنصيبه من الآخرة وصل إليه نصيبه من الدنيا، وأدرك من الآخرة ما يريد \". \nقال الورتجبي: حرث الآخرة: مشاهدته ووصاله وقربه، وهذا للعارفين، وحرث الدنيا: كرامات الظاهر، ومَن شغلته الكرامات احتجب بها عن الحق. ثم قال: عن بعضهم: مَن عَمِل لله محبة له، لا طلباً للجزاء، صغر عنده كل شيء دون الله، فلا يطلب حرث الدنيا، ولا حرث الآخرة، بل يطلب الله من الدنيا والآخرة. ثم قال: حرث الدنيا: قضاء الوطر منها، والجمع منها، والافتخار بها، ومَن كان بهذه الصفة فما له في الآخرة من نصيب. هـ. وقال بعض الشعراء في هذا المعنى:",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:63",
      "similarity": 0.6891891266450785
    },
    {
      "verse": "2:223",
      "similarity": 0.5095065879419657
    },
    {
      "verse": "6:136",
      "similarity": 0.38631372113117673
    },
    {
      "verse": "6:138",
      "similarity": 0.37461592536079297
    },
    {
      "verse": "3:117",
      "similarity": 0.37409297503635275
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/42:20.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/42:20.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/42:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}