{
  "chapter": "الشورى",
  "text": "ومن ءايته خلق السموت والارض وما بث فيهما من دابة وهو على جمعهم اذا يشاء قدير",
  "translations": [
    {
      "translation": "Among His Signs is the creation of the heavens and earth and all the creatures He has spread about in them. And He has the power to gather them together whenever He wills.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth and all the living things dispersed in them, are a sign of His. He has the power to gather them together when He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His Signs is the creation of the heavens and the earth and the living creatures that He has spread out in them. He has the power to bring them together when He so wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the evidence (of His existence) are His creation of the heavens and the earth and the beasts which inhabit it. He has all the power to bring them together if He wishes this to be so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His signs is the creation of the heavens and the earth, and the moving creatures dispersed in it; and He is Able to gather them whenever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Ayat is the creation of the heavens and the earth, and whatever moving creatures He has dispersed in them both. And He is Able to assemble them whenever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of His signs is the creation of the heavens and the earth and what He has spread forth in both of them of living beings; and when He pleases He is all-powerful to gather them together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and earth and the crawling things He has scattered abroad in them; and He is able to gather them whenever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His portents is the creation of the heaven and the earth, and of whatever beasts He hath dispersed therein. And He is Able to gather them when He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is the creation of the heavens and earth and all the living creatures He has dispersed throughout them: He has the power to gather them all together whenever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs is the creation of the heavens and the earth and of the moving creatures which He hath dispersed in the twain. And He is for their assembling whensoever He will Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is the creation of the heavens and the earth and whatever creatures He has scattered in them, and He is able to gather them whenever He wishes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Signs is the creation of the heavens and the earth, and the living creatures that He has scattered through them: and He has power to gather them together when He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among His Ayat (proofs, evidences, lessons, signs, etc.) is the creation of the heavens and the earth, and whatever moving (living) creatures He has dispersed in them both. And He is All-Potent over their assembling (i.e. resurrecting them on the Day of Resurrection after their death, and dispersion of their bodies) whenever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among His signs is the creation of the heavens and the earth and the crawling things which He has dispersed in them. If He will, He is Able to gather all of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of His signs are the creation of the heavens and the earth, and the creatures He has spread throughout them; and He is Able to gather them at will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of his signs is the creation of the heavens and earth and what He has dispersed throughout them of creatures. And He, for gathering them when He wills, is competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:29]   And of His signs is the creation of the heavens and the earth and, the creation of, whatever He has scattered, [whatever] He has divided and spread, in them in the way of creatures (dābba: this denotes all those [creatures] which tread [yadubbu] upon the earth, whether human beings or otherwise). And He is able to bring them together, for the Gathering, whenever He will (rational beings as opposed to others predominate in the [suffixed] pronoun [-him of jam‘ihim, ‘to bring them together’]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of His portents) and of the signs of His divine Oneness and power (is the creation of the heaven and the earth, and of whatever beasts He hath dispersed therein) they are all signs for you. (And He is Able to gather them) to revive them (when He will.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ آيَاتِهِ } الدالة على كمال ولايته وتدبيره وتربيته { خَلْقُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: إظهار الكائنات العلوية والسفلية بامتداد أظلال أسمائه وصفاته { وَمَا بَثَّ } وبسط { فِيهِمَا } وركب منهما { مِن دَآبَّةٍ } ذي حياة وحركة { وَهُوَ } سبحانه { عَلَىٰ جَمْعِهِمْ } أي: جمع الأظلال والعكوس إلى شمس الذات، وقبضهم عليها بعد بثهم وبسطهم منها { إِذَا يَشَآءُ } ويريد { قَدِيرٌ } [الشورى: 29] بلا فترة وتقصير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ومن آياته } الدالة على باهر قدرته ووحدانيته { خلقُ السماواتِ والأرض } على ما هما عليه من تعاجيب الصنعة، فإنها بذاتها وصفاتها تدل على شؤونه العظيمة، { وما بثَّ } أي: فرّق { فيهما من دابةٍ } من حي على الإطلاق، فأطلق الدابة على مطلق الحيوان، ليدخل الملائكة\n أو: ما يدب على الأرض، فإن ما يختص أحد الشيئين المجاورين يصح نسبته إليهما، كقوله تعالى:\n\n[الرحمن: 22] وإنما يخرج المرجان من الملح، ولا يبعدُ أن يخلق الله في السموات حيواناً يمشون مشي الأناسيّ على الأرض، أو: يكون للملائكة مشي مع الطيران، فوصفوا بالدَّبيب لذلك\n { وهو على جَمْعِهم } أي: حشرهم بعد البعث للحساب { إِذا يشاء } أي: في الوقت الذي يشاء { قديرٌ } لا يعجزه شيء\n الإشارة: مِن تعرفاته: إظهار السموات والأرض، وهذه رسوم المعاني، وما بثّ فيهما من دابة، وهذه أشكال توضح أسرار المعاني، فإذا قبضت المعاني محيت الرسول والأشكال\n وقوله تعالى: { وهو على جمعهم إذا يشاء قدير } ، قال القشيري: الإشارة في هذا: أنَّ الحقَّ تعالى يغار على أوليائه أن يَسْكنَ بعضُهم بقلبه إلى بعض، فأبداً يُبَدّدُ شملهم، ولا يكاد تتفق الجماعة من أهل القلوب إلا نادراً، وذلك أيضاً مدة يسيرة، كما أنشدوا:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:4",
      "similarity": 0.8433108556872017
    },
    {
      "verse": "4:1",
      "similarity": 0.50450563452984
    },
    {
      "verse": "2:164",
      "similarity": 0.4750653379672853
    },
    {
      "verse": "101:4",
      "similarity": 0.4543671985058966
    },
    {
      "verse": "16:49",
      "similarity": 0.43198331723081246
    }
  ]
}