{
  "chapter": "الشورى",
  "text": "ولو بسط الله الرزق لعباده لبغوا۟ فى الارض ولكن ينزل بقدر ما يشاء انه بعباده خبيرۢ بصير",
  "translations": [
    {
      "translation": "Were Allah to expand the provision of His slaves, they would act as tyrants on the earth. But He sends down whatever He wills in a measured way. He is aware of and He sees His slaves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to give in abundance to His creatures they would fill the earth with oppression. So He gives according to measure as He will. He knows (what is good for) His creatures. He is all-aware and all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to grant ample sustenance to His servants they would go about transgressing in the land. But He sends down in due measure whatever (sustenance) He wills. Surely He is Well-Aware and All-Seeing concerning matters that relate to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God given abundant sustenance to His servants, they would have certainly rebelled on earth, but He sends them a known measure of sustenance as He wills. He is All-aware of His servants and watches over them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah increased the sustenance for all His slaves, they would have surely caused turmoil in the land, but He sends it down by a proper assessment as He wills; indeed He is Well Aware of, Seeing His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to extend the provision for His servants, they would surely rebel in the earth, but He sends down by measure as He wills. Verily, He is, in respect of His servants, the Well-Aware, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah should amplify the provision for His servants they would certainly revolt in the earth; but He sends it down according to a measure as He pleases; surely He is Aware of, Seeing, His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God expanded His provision to His servants, they would have been insolent in the earth; but He sends down in measure whatsoever He will; surely He is aware of and sees His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to enlarge the provision for His slaves they would surely rebel in the earth, but He sendeth down by measure as He willeth. Lo! He is Informed, a Seer of His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to grant His abundant provision to [all] His creatures, they would act insolently on earth, but He sends down in due measure whatever He will, for He is well aware of His servants and watchful over them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah expanded the provision for His bondmen they surely would have rebelled in the earth, but He sendeth down by measure as He willeth; verily He is, in respect of His bondmen. Aware and Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to expand the provision for [all] His servants, they would surely create havoc on the earth. But He sends down in a [precise] measure whatever He wishes. Indeed, He is all-aware, all-seeing about His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to enlarge the provision for His Servants, they would indeed transgress beyond all bounds through the earth; but he sends (it) down in due measure as He pleases. For He is with His Servants Well-acquainted, Watchful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to enlarge the provision for His slaves, they would surely rebel in the earth, but He sends down by measure as He wills. Verily! He is in respect of His slaves, the Well-Aware, the All-Seer (of things that benefit them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had expanded His provision to His worshipers, they would become tyrannical in the earth, but He sends down to them what He will in due measure; He is Aware and sees His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to increase the provision to His servants, they would transgress on earth; but He sends down in precise measure whatever He wills. Surely, regarding His servants, He is Expert and Observant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had extended [excessively] provision for His servants, they would have committed tyranny throughout the earth. But He sends [it] down in an amount which He wills. Indeed He is, of His servants, Acquainted and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:27] For were God to extend His provision to His servants, [to] all of them, they would, all of them, surely become covetous, in other words, they would become tyrants, in the earth; but He sends down (read yunzilu or yunazzilu) of provisions, in the measure that He will, thus extending it for some of His servants to the exclusion of others — and from [such] extending [of provision to some] emerges tyranny. Surely He is Aware, Seer of His servants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ (27)عطف على جملة { ويزيدهم من فضله } \\[ الشورى : 26 \\] أو على المجموع من جملة { ويستجيب الذين آمنوا } \\[ الشورى : 26 \\] ومن جملة ويزيدهم من فضله .وموقع معناها موقع الاستدراك والاحتراس فإنها تشير إلى جواب عن سؤال مقدر في نفس السامع إذا سمع أن الله يستجيب للذين آمنوا وأنه يزيدهم من فضله أن يتساءل في نفسه : أن مما يَسأل المؤمنون سعة الرّزق والبسطةَ فيه فقد كان المؤمنون أيام صدر الإسلام في حاجة وضيق رزق إذ منعهم المشركون أرزاقهم وقاطعوا معاملتهم ، فيجاب بأن الله لو بسط الرّزق للنّاس كلهم لكان بسطه مفسداً لهم لأن الذي يستغني يتطرقه نسيان الالتجاء إلى الله ، ويحمله على الاعتداء على الناس فكان من خير المؤمنينَ الآجِللِ لهم أن لا يبسط لهم في الرّزق ، وكان ذلك منوطاً بحكمة أرادها الله من تدبير هذا العالم تَطّرد في الناس مؤمِنهم وكافرِهم قال تعالى : { إن الإنسان ليَطْغَى أنْ رءاه اسْتَغْنَى } \\[ العلق : 6 ، 7 \\] . وقد كان في ذلك للمؤمن فائدة أخرى ، وهي أن لا يشغله غناه عن العمل الذي به يفوز في الآخرة فلا تشغله أموالُه عنه ، وهذا الاعتبار هو الذي أشار إليه النبي صلى الله عليه وسلم حين قال للأنصار لما تعرّضوا له بعد صلاة الصبح وقد جاءه مال من البَحرين \" فوالله ما الفقرَ أخشى عليكم ولكنْ أخشى عليكم أن تُبْسَط عليكم الدنيا كما بُسطت على من قبلكم فتنَافَسُوها كما تنافَسُوها وتُهْلِككم كما أهلكتهم \" .وقد وردت هذه الآية مورداً كلياً لأن قوله { لعباده } يعُم جميع العباد . ومن هذه الكلية تحصل فائدة المسؤول عليه الجزئي الخاص بالمؤمنين مع إفادة الحكمة العامة من هذا النظام التكويني ، فكانت هذه الجملة بهذا الاعتبار بمنزلة التذييل لما فيها من العموم ، أي أن الله أسس نظام هذا العالم على قوانينَ عامةٍ وليس من حكمته أن يخص أولياءه وحزبه بنظام تكويني دنيوي ولكنه خصهم بمعاني القرب والرضى والفوز في الحياة الأبدية . وربما خصّهم بمَا أراد تخصيصهم به مما يرجع إلى إقامة الحق .والبغي : العدوان والظلم ، أي لبغى بعضهم على بعض لأن الغنى مظنة البطَر والأشر إذا صادف نفساً خبيثة ، قال بعض بني جَرم من طيء من شعراء الحماسة: ... إذا أخصبتمو كنتمْ عَدُوًّاوإن أجْدَبتُمُو كنتمْ عيالاً ... ولبعض العرب أنشده في «الكشاف» : ... وقد جعل الوسْمِيُّ يُنبِتُ بينَناوبينَ بني رُومَان نَبعاً وشَوْحَطا ... فأما الفَقر فقلما كان سبباً للبغي إلا بغياً مشوباً بمخافة كبغي الجائع بالافتكاك بالعنف فذلك لندرته لا يلتفت إليه ، على أن السياق لبيان حكمة كون الرزق بقدَر لا لبيان حكمةٍ في الفقر .فالتلازم بين الشرط وجوابه في قوله : { ولو بسط الله الرزق لعباده لبغوا } حاصل بهذه السببية بقطع النظر عن كون هذا السبب قد يخلفه ضده أيضاً ، على أن بَين بسط الرزق وبين الفقر مراتب أخرى من الكفاف وضيق الرزق والخصاصة ، والفقر ، وهي متفاوتة فلا إشكال في التعليل .وعن خبّاب بن الأرتّ «فينا نزلت هذه الآية ، وذلك أنَّا نظرنا إلى أموال بني النَّضِير وبني قُريظة وبني قينُقاع فتمنَّيْناها فنزلت» ، وهذا مما حمل قوماً على ظن هذه الآية مدنية كما تقدم في أول السورة . وهذا إن صح عن خبَّاب فهو تأويل منه لأن الآية مكية وخبّاب أنصاري فلعله سمع تمثيل بعضهم لبعض بهذه الآية ولم يكن سمعها من قبل . وروي أنها نزلت في أهل الصُّفَّة تمنوا سعة الرزق فنزلت ، وهذا خبر ضعيف .ومعنى الآية : لو جعل الله جميع الناس في بسطة من الرزق لاختلّ نظام حياتهم ببغي بعضهم على بعض لأن بعضهم الأغنياء تحدثه نفسه بالبغي لتوفر أسباب العُدوان كما علمت فيجد من المبغي عليه المقاومةَ وهكذا ، وذلك مفض إلى اختلال نظامهم . وبهذا تعلم أن بسط الرزق لبعض العباد كما هو مشاهَد لا يفضي إلى مثل هذا الفساد لأن الغِنى قد يصادف نفساً صالحة ونفساً لها وازع من الدين فلا يكون سبباً للبغي ، فإن صادف نفساً خبيثة لا وازع لها فتلك حالة نادرة هي من جملة الأحوال السيئة في العالم ولها ما يقاومها في الشريعة وفصللِ القضاء وغَيرة الجماعة فلا يفضي إلى فساد عام ولا إلى اختلال نظام .وإطلاق فعل التنزيل على إعطاء الرزق في قوله تعالى : { ولكن ينزل بقدر } استعارةٌ لأنه عطاء من رفيع الشأن ، فشبه بالنازل من علوّ وتكرر مثل هذا الإطلاق في القرآن .والقَدَر بفتحتين : المِقدار والتعيين .ومعنى { ما يشاء } أن مشيئته تعالى جارية على وفْق عِلمه وعلى ما ييسرّه له من ترتيب الأسباب على حسب مختلف صالح مخلوقاته وتعارض بعضها ببعض ، وكل ذلك تصرفات وتقديرات لا يحيط بها إلا علمه تعالى . وكلها تدخل تحت قوله { إنه بعباده خبير بصير } ، وهي جملة واقعة موقع التعليل للتي قبلها .وافتتحت ب ( إنّ ) التي لم يُرد منها تأكيد الخبر ولكنها لمجرد الاهتمام بالخبر والإيذان بالتعليل لأنّ ( إنّ ) في مثل هذا المقام تقوم مقام فاء التفريع وتفيد التعليل والربط ، فالجملة في تقدير المعطوفة بالفاء .والجمع بين وصفي { خبير } و { بصير } لأن وصف { خبير } دال على العلم بمصالح العبادِ وأحوالهم قبل تقديرها وتقدير أسبابها ، أي العلم بما سيكون . ووصف { بصير } دالّ على العلم المتعلق بأحوالهم التي حصلت ، وفرق بين التعلقين للعلم الإلهي .\n\n",
      "translations": [
        {
          "translation": "(And if Allah were to enlarge the provision for His slaves) if Allah were to give abundant wealth to His slaves (they would surely rebel) they would surely transgress and become too arrogant (in the earth, but He sendeth down) but He enlarges (by measure as He wills) for whomever He will. (Lo! He is Informed) of what is good for His slaves, (a Seer of His bondmen) and of their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبالجملة: كفر عموم الكفرة واستكبارهم وضلالهم\n إنما نشأ من كفرانهم بنعم الله وطغيانهم لأجلها على الله وعلى خُلَّص عباده\n كما أشار إليه سبحانه بقوله: { وَلَوْ بَسَطَ ٱللَّهُ ٱلرِّزْقَ } الصوري المستجلب المستتبع لأنواع العتو والاستكبار { لِعِبَادِهِ } المجبولين على الكفران والنسيان بمقتضى بشريتهم وبهيميتهم { لَبَغَوْاْ فِي ٱلأَرْضِ } بغياً فاحشاً\n واستكبروا على عباد الله\n وظهروا على أوليائه\n ومشوا على وجه الأرض خيلاء مفتخرين بمالهم من الجاه والثروة والرئاسة\n فسرى بغيهم واستكبارهم على الله وعلى أنبيائه ورسله\n فكفروا لذلك ظلماً وعدواناً { وَلَـٰكِن } جرت سنته سبحانه\n واقتضت حكمته على أنه { يُنَزِّلُ } ويفيض { بِقَدَرٍ } أي: مقداراً وتقدير { مَّا يَشَآءُ } على من يشاء بمقتضى حكمته ومشئته\n وبالجملة: { إِنَّهُ } سبحانه { بِعِبَادِهِ } أي: باستعداداتهم وعموم أحوالهم { خَبِيرٌ بَصِيرٌ } [الشورى: 27] يعلم منه ما خفي عليهم وما ظهر دونهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولو بَسَطَ اللهُ الرزقَ لعباده } أي: لو أغناهم جميعاً { لَبَغوا في الأرض } أي: لتَكَبروا وأفسدوا فيها\n بطراً\n ولعلا بعضُهم على بعض بالاستعلاء والاستيلاء\n لأن الغِنى مبطرة مفسدة\n وكفى بحال قارون وفرعون عبرة\n وأصل البغي: تجاوز الاقتصاد عما يجزي من حيث الكمية أو الكيفية\n { ولكن يُنَزِّل بِقَدرِ } أي: بتقدير { ما يشاء } أن ينزله\n مما تقضيه مشيئته\n يقال: قدره وقدّره قدراً وتقديراً { إِنه بعباده خبير بصير } محيط بخفايا أمورهم وجلاياها\n فيقدر لكل واحد منهم ما يليق بشأنه\n فيُفقر ويُغني\n ويُعطى ويَمنع\n ويقبض ويبسط\n حسبما تقتضيه الحكمة الربانية\n ولو أغناهم جميعاً لَبَغوا في الأرض\n ولو أفقرهم لهلكوا\n وما ترى من البسط على مَن يبغي\n ومِن البغي بدون البسط\n فهو قليل\n ولكن البغي مع الفقر أقلّ\n ومع البسط أكثر وأغلب\n فالحكمة لا تنافي بغي البعض بدفعه بالبعض الآخر\n بخلاف بغي الجميع\n\n[الحج: 40] الآية\n وقال شفيق بن إبراهيم: { لو بسط الله الرزق لعباده } أي: لو رزق الله العباد من غير كسب { لبغوا } طغوا وسَعَوا في الأرض بالفساد\n ولكن شغلهم بالكسب والمعاش\n رحمة منه\n هـ\n أي: لئلا يتفرّغوا للفساد\n ومثله في التنوير\n وقال شيخ شيوخنا الفاسي العارف: والظاهر حمل العباد على الخصوص المصْطَفين من المؤمنين\n فإنهم يحمون من الطغيان وبسط الرزق لئلا يبغوا\n هـ\n وقال قتادة: كان يقال: خير الرزق: ما لا يطغيك\n ولا يلهيك\n فذكر لنا أن النبي صلى الله عليه وسلم قال:\n \" أخوف ما أخاف على أمتي زهرة الدنيا وكثرتها \" \nهـ\n رُوي أن أهل الصُّفة تمنوا الغنى\n فنزلت\n وقيل: نزلت في العرب\n كانوا إذا أخصبوا تحاربوا\n وإذا جدبوا انتجعوا\n هـ\n { وهو الذي يُنَزِّل الغيث } أي: المطر الذي يُغيثهم من الجدب\n ولذا خصّ بالنافع منه\n فلا يقال للمطر الكثير: غيث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:30",
      "similarity": 0.8465858515228701
    },
    {
      "verse": "29:62",
      "similarity": 0.689331924922811
    },
    {
      "verse": "34:36",
      "similarity": 0.6771496909991213
    },
    {
      "verse": "39:52",
      "similarity": 0.634135658858658
    },
    {
      "verse": "30:37",
      "similarity": 0.6280977064318168
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}