{
  "chapter": "الشورى",
  "text": "ام لهم شركؤا۟ شرعوا۟ لهم من الدين ما لم ياذنۢ به الله ولولا كلمة الفصل لقضى بينهم وان الظلمين لهم عذاب اليم",
  "translations": [
    {
      "translation": "Or do they have partners who have laid down a deen for them for which Allah has not given any authority? Were it not for the prior Word of Decision, the judgement between them would already have been",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they other associates who have prescribed another law for them which has not been dispensed by God? But for the decisive Word (of God) a sentence would have been passed amongst them. Surely there is a grievous punishment for the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have any associates (of Allah) who have laid down for them a way pertaining to faith which Allah did not sanction? But for the fact that a decree had already been made, the matter between them would have been decided once and for all. Surely a grievous chastisement awaits the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have idols who have established a religion without the permission of God? Had not it been for your Lord's giving them respite for an appointed time, He would certainly have settled their differences once and for all. The unjust will certainly suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have associate deities who have appointed for them a religion, which Allah has not permitted? And were it not for a Word that had already been decided, the judgement would have been passed between them here itself; and indeed for the unjust is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they partners with Allah who have instituted for them a religion which Allah has not ordained And had it not been for a decisive Word, the matter would have been judged between them. And verily, for the wrongdoers there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they associates who have prescribed for them any religion that Allah does not sanction? And were it not for the word of judgment, decision would have certainly been given between them; and surely the unjust shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they associates who have laid down for them as religion that for which God gave not leave? But for the Word of Decision, it had been decided between them. For the evildoers there awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they partners (of Allah) who have made lawful for them in religion that which Allah allowed not? And but for a decisive word (gone forth already), it would have been judged between them. Lo! for wrong-doers is a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have associate gods who have laid down for them a religion without the permission of God? Had it not been for God's decree on the final Judgement, the matter would have been decided between them. Surely the wrongdoers shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they associate-gods who have instituted for them a religion which Allah hath not allowed? And had there net been a decisive Word, the affair would have been judged between them. And verily the wrong-doers? theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have deities [besides Allah] who have ordained for them a religion not permitted by Allah? Were it not for a [prior] conclusive word, judgement would have been made between them, and indeed a painful punishment awaits the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! have they partners (in godhead), who have established for them some religion without the permission of Allah? Had it not been for the Decree of Judgment, the matter would have been decided between them (at once). But verily the Wrong-doers will have a grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they partners with Allah (false gods), who have instituted for them a religion which Allah has not allowed. And had it not been for a decisive Word (gone forth already), the matter would have been judged between them. And verily, for the Zalimun (polytheists and wrong-doers), there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have associates who have made lawful to them in religion what Allah has not permitted? Had it not been for the Decisive Word, it would have been decided between them. For the evildoers there is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they have partners who litigate for them religious laws never authorized by God? Were it not for the conclusive decision, it would have been settled between them. The wicked will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they other deities who have ordained for them a religion to which Allah has not consented? But if not for the decisive word, it would have been concluded between them. And indeed, the wrongdoers will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:21] Or have they, the Meccan disbelievers, associates — these being their devils — who have prescribed for them, for the disbelievers, a religion, a corrupt [religion], which God has not given permission for?, such as idolatry and denial of resurrection? And were it not for a [prior] decisive word, in other words, a prior decree   to the effect that requital will take place on the Day of Resurrection, it would have been judged between them, and the believers, by chastising the former in this world. Truly the wrongdoers, the disbelievers, will have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "560 (Or have they) i.e. the disbelievers of Mecca (partners (of Allah)) deities (who have made lawful for them in religion that which Allah allowed not) that which Allah did not command the disbelievers: Abu Jahl and his host? (And but for a decisive word (gone forth already)) to delay the punishment of this nation, (it would have been judged between them) they would have been destroyed. (Lo! for wrong-doers) for disbelievers (is a painful doom.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { شَرَعُواْ لَهُمْ مِّنَ ٱلدِّينِ } معناه ابتدعوا لَهُم\n\n",
      "translations": [
        {
          "translation": " And His saying, \"Establish for them a religion\" - its meaning is, \"Invent for them a religion.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأهم بأنفسهم يحرمون نفوسهم من اللذات الأخروية والفتوحات الروحانية { أَمْ لَهُمْ شُرَكَاءُ } من شياطين الجن والإنس ظاهرهم عليه؛ حيث { شَرَعُواْ } وزينوا { لَهُمْ مِّنَ ٱلدِّينِ } الباطل والديدنة الزائغة { مَا لَمْ يَأْذَن بِهِ ٱللَّهُ } الحكيم المتقن في أفعاله المدبر لعموم مصالح عباده على مقتضى حكمته، ولم يأمر بوضعه واتخاذه لا بالوحي ولا بطريق الإلهام، بل إنما أخذوا ما أخذوا من تلقاء أنفسهم، وعلى مقتضى أهويتهم الباطلة؛ لذلك لم يتم لهم إلا الخيبة والخذلان والحسرة والحرمان\n\n\n\n\n{ وَ } بالجملة: { لَوْلاَ كَلِمَةُ ٱلْفَصْلِ } والقضاء صاردة من الله بتأخير أخذهم لظلمهم وإمهال انتقالهم إلى يوم الجزاء { لَقُضِيَ } وحكم اليوم { بَيْنَهُمْ } أي: بين أهل الهداية والضلال، فيلحق لكل منهم جزاء ما اقترفوا من الحسنات والسيئات { وَ } بالجملة: { إِنَّ ٱلظَّالِمِينَ } الخارجين عن مقتضى الحدود الإلهية، ومتابعة آرائهم وإخوانهم من الشياطين { لَهُمْ عَذَابٌ أَلِيمٌ } [الشورى: 21] في النشأة الأخرى، وهو حرمانهم عما أعد لنوع الإنسان المصور على صورة الرحمن من الكرامات السنية والمقامات العلية، لا عذاب أشد منه وأفزع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ أَمْ لَهُمْ شُرَكَاءُ شَرَعُواْ لَهُمْ مِّنَ ٱلدِّينِ مَا لَمْ يَأْذَن بِهِ ٱللَّهُ وَلَوْلاَ كَلِمَةُ ٱلْفَصْلِ لَقُضِيَ بَيْنَهُمْ وَإِنَّ ٱلظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ تَرَى ٱلظَّالِمِينَ مُشْفِقِينَ مِمَّا كَسَبُواْ وَهُوَ وَاقِعٌ بِهِمْ وَٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ فِي رَوْضَاتِ ٱلْجَنَّاتِ لَهُمْ مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ذَلِكَ هُوَ ٱلْفَضْلُ ٱلْكَبِيرُ ذَلِكَ ٱلَّذِي يُبَشِّرُ ٱللَّهُ عِبَادَهُ ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ\n\n\n }  يقول الحق جلّ جلاله: { أم لهم شركاءُ شرعوا لهم من الدين } ، \" أم \": منقطعة، أي: بل ألهم شركاء، أو: معادلة لمحذوف، تقديره: أقبلوا ما شرعت لهم من الدين، أم لهم آلهة شرعوا من الدين { ما لم يأذن به اللهُ } أي: لم يأمر به، { ولولا كلمةُ الفصل } أي: القضاء السابق بتأخير الجزاء، أي: ولولا العِدة بأن الفصل يكون يوم القيامة { لقُضِيَ بينهم } بين الكفار والمؤمنين\n أو: لعجلت لهم العقوبة\n { وإِنَّ الظالمين لهم عذابٌ أليمٌ } وإن المشركين لهم عذاب أليم في الآخرة، وإن أخّر عنهم في دار الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:18",
      "similarity": 0.6876043375591868
    },
    {
      "verse": "42:13",
      "similarity": 0.5004685810401001
    },
    {
      "verse": "7:163",
      "similarity": 0.3854614427728182
    },
    {
      "verse": "10:19",
      "similarity": 0.21430211284938208
    },
    {
      "verse": "11:110",
      "similarity": 0.18160312220521252
    }
  ]
}