{
  "chapter": "الشورى",
  "text": "ويستجيب الذين ءامنوا۟ وعملوا۟ الصلحت ويزيدهم من فضله والكفرون لهم عذاب شديد",
  "translations": [
    {
      "translation": "He responds to those who have iman and do right actions and gives them increase from His favour. But the kafirun will have a harsh punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answers (the prayers) of those who believe and do good, and gives them more of His bounty. But for the unbelievers there is severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and answers the prayers of those who believe and do good deeds and bestows upon them even more out of His Bounty. As for those who deny (the Truth), a grievous chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answers the prayers of the righteously striving believers and grants them increasing favors. The unbelievers will suffer a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He accepts the prayers of those who accept faith and do good deeds, and gives them a greater reward by His munificence; and for the disbelievers is a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answers those who believe and do righteous good deeds, and gives them increase of His bounty. And as for the disbelievers, theirs will be a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answers those who believe and do good deeds, and gives them more out of His grace; and (as for) the unbelievers, they shall have a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answers those who believe and do righteous deeds, and He gives them increase of His bounty. And the unbelievers -- for them awaits a terrible chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And accepteth those who do good works, and giveth increase unto them of His bounty. And as for disbelievers, theirs will be an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He responds to those who believe and do good deeds, and gives them more of His bounty; agonizing torment awaits the  deniers of the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answereth those who believe and work righteous works and increaseth Unto them of His grace. And the infidels! theirs shall be a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answers [the supplications of] those who have faith and do righteous deeds and enhances them out of His grace. But as for the faithless, there is a severe punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He listens to those who believe and do deeds of righteousness, and gives them increase of His Bounty: but for the Unbelievers their is a terrible Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answers (the invocation of) those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, and gives them increase of His Bounty. And as for the disbelievers, theirs will be a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answers those who believe and do good deeds, and He increases them from His bounty. But for the unbelievers there is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answers those who believe and do good deeds, and He increases them of His grace. But the disbelievers will suffer a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He answers [the supplication of] those who have believed and done righteous deeds and increases [for] them from His bounty. But the disbelievers will have a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:26] And He answers those who believe and perform righteous deeds, He grants them what they ask for, and He enhances them of His bounty. And as for the disbelievers, for them there will be a severe chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And accepteth those) and forgives those who believe in Muhammad (pbuh) and in the Qur'an and those (who do good works) between them and their Lord, (and giveth increase unto them of His bounty) of His honouring, by giving them more reward; this honour will be bestowed upon them in Paradise; and it is also said this honour is the beholding of Allah. (And as for disbelievers) Abu Jahl and his host, (theirs will be an awful doom).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بعدما رجعوا نحوه تائبين نادمين عما فعلوا { وَيَزِيدُهُم مِّن فَضْلِهِ } بدل إخلاصهم واستحيائهم منه سبحاه من الكرامات ما لا يكتنه وصفه { وَٱلْكَافِرُونَ } الساترون بأباطيل هوياتهم\n وما صدر منها من الجرائم والآثام شمس الحق الحقيق بالكشف والظهور { لَهُمْ عَذَابٌ شَدِيدٌ } [الشورى: 26] حين رجعوا إلى الله\n وحشروا نحوه مهانين صاغرين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويستجيبُ الذين آمنوا وعملوا الصالحات } أي: يستجيب لهم فحذف اللام كما في قوله:\n\n[المطففين: 3] أي: يجيب دعوتهم، ويثيبهم على طاعتهم، أو: يستجيبون له بالطاعة إذا دعاهم إليها\n قيل لإبراهيم بن أدهم: ما لنا ندعو فلا نُجاب؟ قال: \" لأنه دعاكم فلم تُجيبوا \"\n { ويَزِيدُهُمْ من فضله } على ما سألوه، واستحقوه بموجب الوعد\n { والكافرون لهم عذابٌ شديد } بدل ما للمؤمنين من الفضل العظيم والمزيد\n الإشارة: قال الورتجبي: { أم يقولون افترى على الله كذباً } فيه تقديس كلامه، وطهارة نبيه صلى الله عليه وسلم عن الافتراء، وكيف يفتري وهو مصون من طريان الشك والريب والوساوس والهواجس على قلبه؟ وقال أيضاً: عن الواسطي: إن يشأ الله يختم على قلبك لكن ما يشاء، ويمح الله الباطل بنفسه ونعته، حتى يعلم أنه لا حاجة له إلى أحد من خلقه، ثم يحقق الحق في قلوب أنشأها للحقيقة\n قلت: في الآية تهديد لأهل الدعوى لأنهم إن داموا على دعواهم الخصوصية بلا خصوصية ختم الله على قلوبهم بالنفاق، ثم يمحو الله الباطل بأهل الحق والتحقيق، فتُشرق حقائقهم على ما يقابلها من البال فتدمغه بإذن الله وقضائه وكلماته\n وقوله تعالى: { وهو الذي يقبل التوبة عن عباده\n\n\n } الخ، لكل مقام توبة، ولكل رجال سيئات، فتَوبة العوام من الذنوب، وتوبة الخواص من العيوب، وتوبة خواص الخواص من الغيبة عن شهود علاّم الغيوب\n\n\nوقوله تعالى: { ويعلم ما تفعلون } يشير إلى الحلم بعد العلم\n وقوله تعالى: { ويستجيب الذين آمنوا وعملوا الصالحات } أي: في كل ما يتمنون، { ويزيدهم من فضله } النظر إلى وجهه، ويتفاوتون فيه على قدر توجههم، ومعرفتهم في الدنيا\n وذكر في القوت حديثاً عن رسول الله صلى الله عليه وسلم في تفسير قوله تعالى: { ويزيدهم من فضله } قال:\n\n \" يُشفعهم في إخوانهم، فيدخلهم الجنة \" \n\nهـ\n قال القشيري: ويقال: لمَّا ذكر أن التائبين يقبل توبتهم، ومَنْ لم يَتُبْ يعفو عن زلَّته، والمطيع يدخله الجنة، فلعله خطر ببال أحد: فهذه النار لمَن هي؟ فقال { والكافرون لهم عذاب شديد } ، ولعله يخطر بالبال أن العصاة لا عذاب لهم، فقال: شديد بدليل الخطاب أنه ليس بشديد هـ\n ولمّا ذكر أن أهل الإيمان يستجيب لهم، ويزيدهم من فضله، يعني في الآخرة، وأما في الدنيا فإنما يعطيهم الكفاف، ذكر حكمة ذلك، فقال: { وَلَوْ بَسَطَ ٱللَّهُ ٱلرِّزْقَ لِعِبَادِهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:7",
      "similarity": 0.44082587706892795
    },
    {
      "verse": "35:7",
      "similarity": 0.42407332806876574
    },
    {
      "verse": "24:38",
      "similarity": 0.4090379538014082
    },
    {
      "verse": "28:64",
      "similarity": 0.4049194254709241
    },
    {
      "verse": "30:45",
      "similarity": 0.39950004348734486
    }
  ]
}