{
  "chapter": "الشورى",
  "text": "ذلك الذى يبشر الله عباده الذين ءامنوا۟ وعملوا۟ الصلحت قل لا اسـلكم عليه اجرا الا المودة فى القربى ومن يقترف حسنة نزد له فيها حسنا ان الله غفور شكور",
  "translations": [
    {
      "translation": "That is the good news which Allah gives to His slaves who have iman and do right actions. Say: 'I do not ask you for any wage for this - except for you to love your near of kin. If anyone does a good action, We will increase the good of it for him. Allah is Ever-Forgiving, Ever-Thankful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the good news that God gives to His creatures who believe and do good. Say: \"I ask no recompense of you for it other than obligations of relationship.\" We shall give more excellence to him who acquires excellence. Surely God forgives and accepts (gratitude).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Bounty of which Allah gives tidings to His servants who have faith and do good deeds. Tell them, (O Prophet): “I do not ask you for any recompense for my work except love towards kinsfolk.” Whoever does a good deed, We shall increase its merit for him. Surely Allah is Most Forgiving, Most Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the glad news which God gives to His servants, the righteously striving believers. (Muhammad), say, \"I do not ask you for any payment for my preaching to you except (your) love of (my near) relatives.\" Whoever achieves virtue will have its merit increased. God is All-forgiving and Appreciating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is what Allah gives the glad tidings of to His bondmen who accept faith and do good deeds; say (O dear Prophet Mohammed – peace and blessings be upon him) “I do not ask any fee from you upon this, except the love between close ones”; and whoever performs a good deed – We further increase the goodness in it for him; indeed Allah is Oft Forgiving, Most Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is whereof Allah gives glad tidings to His servants who believe and do righteous good deeds. Say: \"No reward do I ask of you for this except to be kind to me for my kinship with you.\" And whoever earns a good righteous deed, We shall give him an increase of good in respect thereof. Verily, Allah is Oft-Forgiving, Most Ready to appreciate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of which Allah gives the good news to His servants, (to) those who believe and do good deeds. Say: I do not ask of you any reward for it but love for my near relatives; and whoever earns good, We give him more of good therein; surely Allah is Forgiving, Grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the good tidings God gives to His servants who believe and do righteous deeds. Say: 'I do not ask of you a wage for this, except love for the kinsfolk; and whosoever gains a good deed, We shall give him increase of good in respect of it. Surely God is All-forgiving, All-thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This it is which Allah announceth unto His bondmen who believe and do good works. Say (O Muhammad, unto mankind): I ask of you no fee therefor, save lovingkindness among kinsfolk. And whoso scoreth a good deed We add unto its good for him. Lo! Allah is Forgiving, Responsive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the glad tidings which God gives to His servants who believe and do righteous deeds. Say, \"I do not ask of you any reward for it, except [that I am inviting you to God because of] love of kinship.\" Whoever earns a good deed, We shall increase its good for him; God is most forgiving, most appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is that whereof Allah giveth the glad tidings Unto His bondmen who believe and work righteous works, Say thou: I ask of you no hire therefor save affection in respect of kinship. And whoso ever earneth a good deed We shall increase Unto him good in respect thereof; verily Allah is Forgiving, Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the good news that Allah gives to His servants who have faith and do righteous deeds! Say, ‘I do not ask you any reward for it except the love of [my] relatives.’ Whoever performs a good deed, We shall enhance its goodness for him. Indeed Allah is all-forgiving, all-appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is (the Bounty) whereof Allah gives Glad Tidings to His Servants who believe and do righteous deeds. Say: \"No reward do I ask of you for this except the love of those near of kin.\" And if any one earns any good, We shall give him an increase of good in respect thereof: for Allah is Oft-Forgiving, Most Ready to appreciate (service).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is (the Paradise) whereof Allah gives glad tidings to His slaves who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds. Say (O Muhammad SAW): \"No reward do I ask of you for this except to be kind to me for my kinship with you.\" And whoever earns a good righteous deed, We shall give him an increase of good in respect thereof. Verily, Allah is Oft-Forgiving, Most Ready to appreciate (the deeds of those who are obedient to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the glad tidings that Allah gives to His worshipers, who believe and do good works. Say: 'For this I ask of you no wage except the love of the (Prophet's) relatives. We will add good to whosoever gains a good deed. Allah is the Forgiving and the Thanker'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the good news God gives to His servants who believe and do good deeds. Say, “I ask of you no wage for it, except affection among the near of kin.” Whoever does a good deed, We will increase its goodness for him. God is Forgiving and Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is that of which Allah gives good tidings to His servants who believe and do righteous deeds. Say, [O Muhammad], \"I do not ask you for this message any payment [but] only good will through kinship.\" And whoever commits a good deed - We will increase for him good therein. Indeed, Allah is Forgiving and Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:23] That is the good tidings (read yubshiru or yubashshiru, from bishāra, ‘good news’) which God gives to His servants who believe and perform righteous deeds. Say: ‘I do not ask of you any reward for it, for delivering the Message, except the affection for [my] kinsfolk (illā, ‘except’: this represents a discontinuous exception, in other words, ‘but I do ask of you that you show affection for my kinship [with you], which at the same time is your kinship’; for he [the Prophet] had kinship ties with all the subdivisions of the [tribe of] Quraysh). And whoever acquires a good deed, an act of obedience, We shall enhance for him its goodness, by multiplying [the reward for] it. Surely God is Forgiving, of sins, Appreciative, [even] of little [good], and so He multiplies it [manifold].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) bounty (it is which Allah announceth unto His bondmen) in the life of the world (who believe) in Muhammad and the Qur'an (and do good works) between them and their Lord. (Say) Muhammad, to your Companions; and it is said: to the people of Mecca: (I ask of you no fee) no payment (therefore, save loving kindness among kinsfolk) except that you treat kindly my kinsfolk after me; it is also said this means: except that you draw closer to Allah through the profession of Allah's divine Oneness, according to al-Hasan al- Basri; and according to al-Farra' this means: draw closer to Allah by means of repentance. (And whoso scoreth a good deed we add unto its good for him) nine times. (Lo! Allah is Forgiving) He forgives the one who repents, (Responsive) He is thankful for very little and rewards for it abundantly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَن يَقْتَرِفْ حَسَنَةً } معناه يَكتَسِبُ وكذلك يَجترحُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And whoever acquires [even] a small amount of goodness}, [means that] he will achieve [something] great, and likewise he will reach [a high station].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } المذكور من الفضل والفوز هو { ٱلَّذِي يُبَشِّرُ ٱللَّهُ } المنعم المفضل به { عِبَادَهُ ٱلَّذِينَ آمَنُواْ } بوحدة ذاته { وَعَمِلُواْ ٱلصَّالِحَاتِ } المفيضة الموصلة لهم إلى توحيد أفعاله وصفاته { قُل } يا أكمل الرسل بعدما بينت لهم طريقي الهداية والضلال\n وبلغت ما يوصل بوحي إليك للإرشاد والتكميل إياهم: { لاَّ أَسْأَلُكُمْ } أي: على تبليغي وتبشيري إياكم { عَلَيْهِ أَجْراً } جعلاً منكم ونفعاً دنيوياً { إِلاَّ ٱلْمَوَدَّةَ فِي ٱلْقُرْبَىٰ } أي: ما أطلب منكم نفعاً دنيوياً بل أطلب منكم محبة أهل بيتي ومودتهم\n ليدوم لكم طريق الاستفادة والاسترشاد منهم\n إذ هم مجبولون على فطرة التوحيد الذاتي مثلي\n\n\nروي أنها لما نزلت\n قيل: يا رسول الله صلى الله عليه وسلم: من قرابتك؟ قال:\n \" علي وفاطمة وأبنهائمها \"\n \n \nوكفاك شاهداً على ذلك ظهور الأئمة الذين هم أكابر أولي العزائم في طريق الحق وتوحيده\n صلوات الله على أسلافهم وسلامه عليهم وعلى أخلافهم\n ما تناسلوا بطناً بعد بطن\n\n\n{ وَمَن يَقْتَرِفْ } ويكتسب متابعة الرسول وأهل بيته { حَسَنَةً } دينية حقيقة { نَّزِدْ لَهُ فِيهَا } أي: فيما يترتب عليها من الكرامات الأخروية { حُسْناً } أي: زياة حسن تفضلاً منَّا وإحساناً { إِنَّ ٱللَّهَ } المطلع لضمائرهم عباده ونياتهم { غَفُورٌ } لذنوب من أحب أهل بيت حبيبه لرضاه سبحانه { شَكُورٌ } [الشورى: 23] يوفي عليهم الثواب\n ويوفر عليهم أنواع الكرامات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { عبادَه } فحذف عائد الموصول\n ويقال: بشَّر وبشر\n بالتشديد والتخفيف\n وقرىء بهما\n ثم وصف المبشرين بقوله: { الذين آمنوا وعملوا الصالحات } دون غيرهم\n الإشارة: كل مَن ابتدع عملاً خارجاً عن الكتاب والسنّة فقد شرع من الدين\n ما لم يأذن به الله\n فينسحب عليه الوعيد\n لقوله صلى الله عليه وسلم:\n \" مَن سنَّ سنّة سيئة فعليه وزرها ووزر مَن عمل بها إلى يوم القيامة \"\n \nوقوله تعالى: { والذين آمنوا وعملوا الصالحات في روضاتِ الجنات } قال القشيري: في الدنيا جنة الوصلة\n ولذاذة الطاعة والعبادة\n وطيب الأُنْسِ في أوقات الخلوة\n وفي الآخرة في روضات الجنات\n إن أرادوا دوامَ اللطفِ دامَ لهم\n وإن أرادوا تمامَ الكشف كان لهم\n هـ\n ولمَّا كان من شأن المبشر بالخير أن يلتمس الأجر\n نزّه نبيه عن ذلك\n فقال: {\n\n\n قُل لاَّ أَسْأَلُكُمْ عَلَيْهِ أَجْراً إِلاَّ ٱلْمَوَدَّةَ فِي ٱلْقُرْبَىٰ وَمَن يَقْتَرِفْ حَسَنَةً نَّزِدْ لَهُ فِيهَا حُسْناً إِنَّ ٱللَّهَ غَفُورٌ شَكُورٌ }\n يقول الحق جلّ جلاله: { قل } يا محمد { لا أسألكم عليه } على التبليغ { أجراً }\n رُوي أنه اجتمع المشركون في مجمع لهم\n فقال بعضهم لبعض: أترون أن محمداً يسأل على ما يتعاطاه أجراً؟ فنزلت\n\nأي: لا أسألكم على التبليغ والبشارة أجراً\n أي: نفعاً { إِلا المودَة في القربى } إلا أن تودوا أهل قرابتي\n ويجوز أن يكون الاستثناء منقطعاً\n أي: لا أسألكم أجراً قط\n ولكن أسألُكم أن تودُّوا قرابتي التي هم قرابتكم\n ولا تؤذوهم\n ولم يقل: إلا مودّة القربى\n أو: المودة للقربى لأنهم جُعلوا مكاناً للمودة\n ومقرّاً لها\n مبالغة\n كقولك: لي في مال فلان مودة\n ولي فيهم حبّ شديد\n تريد: أحبهم\n وهم مكان حبي ومحله\n وليست \" في \" بصلة للمودة كاللام\n إذا قلت: إلا المودة للقربى\n وإنما هي متعلقة بمحذوف\n تعلُّق الظرف\n به والتقدير: إلا المودة ثابتة في القربى\n ومتمكنة فيها\n والقربى: مصدر\n كالزلفى والبشرى\n بمعنى القرابة\n والمراد: في أهل القربى\n رُوي أنه لما نزلت قيل: يا رسول الله! مَن أهل قرابتك هؤلاء الذين وجبت علينا مودتهم؟ قال:\n \" عليّ وفاطمة وابناهما \" \nوقيل: معناه: إلا أن تودّوني لقرابتي فيكم\n ولا تؤذوني\n إذ لم يكن بطن من بطون قريش إلا وبين رسول الله صلى الله عليه وسلم وبينهم قرابة\n وقيل: القربى: التقرُّب إلى الله تعالى\n أي: إلا أن تحبُّوا الله ورسوله في تقرُّبكم إليه بالطاعة والعمل الصالح\n { ومن يقترفْ } أي: يكتسب { حسنةً } أيّ حسنة كانت\n فيتناول مودة ذي القربى تناولاً أولياً\n وعن السدي: أنها المرادة\n قيل: نزلت في الصدّيق رضي الله عنه ومودته فيهم\n والظاهر: العموم\n { نزدْ له فيها حُسْناً } أي: نضاعفها له في الجنة\n { إِن الله غفور } لمَن أذنب بِطَوْلِه { شَكورٌ } لمَن أطاع بفضله\n بتوفية الثواب والزيادة\n أو: غفور: قابل التوبة\n شكور: حامل عليها\n الإشارة: محبة أهل البيت واجبة على البشر\n حرمةً وتعظيماً لسيد البشر\n وقد قال:\n \" مَن أَحبهم فبحبي أُحبهم\n ومَن أبغضهم فببغضي أبغضهم \" \nفمحبة الرسول صلى الله عليه وسلم ركن من أركان الإيمان\n وعقد من عقوده\n لا يتم الإيمان إلا بها\n وكذلك محبة أهل بيته\n وفي الحديث صلى الله عليه وسلم:\n \" لا يؤمن أحدكم حتى يحبني\n ولا يحبني حتى يحب ذوي قرابتي\n أنا حرْب لمَن حاربهم\n وسلْم لمَن سالمهم\n وعدوٌّ لمَن عاداهم\n ألا مَن آذى قرابتي فقد آذاني\n ومَن آذاني فقد آذى الله تعالى \" \nوقال أيضاً عليه الصلاة والسلام:\n \" إني تاركٌ فيكم ما إن تمسكتم به لن تضلُّوا\n كتابُ الله تعالى وعترتي \" \n\n فانظر كيف قرنهم بالقرآن في كون التمسُّك بهم يمنع الضلال\n وقال صلى الله عليه وسلم:\n \" مَن مات على حب آل محمد مات شهيداً\n ألا ومَن مات على حب آل محمد بدّل الله له زوار قبره ملائكة الرحمة\n ألا ومَن مات على حب آل محمد مات على السنّة والجماعة\n ألا ومَن مات على بغض آل محمد جاء يوم القيامة مكتوب بين عينية: آيس من رحة الله \" \n \nانظر الثعلبي\n زاد بعضهم: ولو عصوا وغيّروا في المذهب فنكره فعلَهم ونحب ذاتهم\n قال الشيخ زروق في نصيحته: وما ينزل بنا من ناحيتهم نعدّه من القضاء النازل\n هـ\n وفي همزية البوصيري رحمه الله:\nوقال آخر:\nوقوله تعالى: { ومن يقترف حسنة نزد له فيها حسناً } \n الزيادة في الدنيا بالهداية والتوفيق\n وفي الآخرة بتضعيف الثواب وحسن الرفيق\n قال القشيري: إذا أتانا بالمجاهدة زدناه بفضلنا تحقيق المشاهدة\n ويقال: مَن يقترفْ حسنةَ الوظائف نَزِدْ له حُسْنَ اللطائف\n ويقال: الزيادة ما لا يصل إليه العبد بوسيلة\n مما لا يدخل تحت طَوْقِ البشر\n هـ\n ثم ردّ على مَن طعن في الوحي\n الذي نفى الأجر على تبليغه\n فقال: { أَمْ يَقُولُونَ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:120",
      "similarity": 0.6441209076441784
    },
    {
      "verse": "6:113",
      "similarity": 0.4120469198028613
    },
    {
      "verse": "9:24",
      "similarity": 0.2432073294260093
    },
    {
      "verse": "19:96",
      "similarity": 0.21361395834968538
    },
    {
      "verse": "35:30",
      "similarity": 0.20702736397856486
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}