{
  "chapter": "الشورى",
  "text": "وهو الذى ينزل الغيث منۢ بعد ما قنطوا۟ وينشر رحمته وهو الولى الحميد",
  "translations": [
    {
      "translation": "It is He who sends down abundant rain, after they have lost all hope, and unfolds His mercy. He is the Protector, the Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down rain when they had despaired of it, and showers His benevolence. He is the protector worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends down the rain after they despair of it, spreading out His Mercy. He is the Protector, the Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down the rain after they had lost hope and spreads out His mercy. He is the Guardian and the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who sends down the rain when they have despaired, and spreads out His mercy; and He is the Benefactor, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sends down the rain after they have despaired, and spreads His mercy. And He is the Wali, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sends down the rain after they have despaired, and He unfolds His mercy; and He is the Guardian, the Praised One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who sends down the rain after they have despaired, and He unfolds His mercy; He is the Protector, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sendeth down the saving rain after they have despaired, and spreadeth out His mercy. He is the Protecting Friend, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is He who sends rain after they have despaired and spreads His mercy far and wide. He is the Protector, Worthy of All Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sendeth down the rain after men have despaired, and spreadeth abroad His mercy. And He is the Patron of all, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down the rain after they have been despondent, and unfolds His mercy, and He is the Guardian, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the One that sends down rain (even) after (men) have given up all hope, and scatters His Mercy (far and wide). And He is the Protector, Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sends down the rain after they have despaired, and spreads abroad His Mercy. And He is the Wali (Helper, Supporter, Protector, etc.), Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down rain for them after they despaired, and He unfolds His Mercy. He is the Guardian, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who brings down the rain after they have despaired, and unfolds His mercy. He is the Guardian, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who sends down the rain after they had despaired and spreads His mercy. And He is the Protector, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:28] And He it is Who sends down the [saving] rain after they have despaired, [after] they have given up hope of its being sent down, and unfolds His mercy, He extends His rain, and He is the [true] Patron, the Benevolent towards believers, the Praised, by them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "561 (And He it is Who sendeth down the saving rain after they have despaired) they have despaired of its coming down, (and spreadeth out His mercy) i.e. rain. (He is the Protecting Friend) Who sends rain year after year, (the Praiseworthy) in His acts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يعلم سبحانه سرائر عباده وضمائرهم { هُوَ ٱلَّذِي يُنَزِّلُ ٱلْغَيْثَ } بمقتضى علمه وحكمته { مِن بَعْدِ مَا قَنَطُواْ } وآيسوا من نزوله { وَ } بتنزيله وإمطاره { يَنشُرُ رَحْمَتَهُ } الواسعة على جميع أقطار الأرض وأرجائها عناية منه سبحانه إلى سكانها من أجناس المواليد وأنواعها وأصنافها { وَ } كيف لا يرحم سبحانه على مظاهره؛ إذ { هُوَ ٱلْوَلِيُّ } المولي لعموم أمورهم المنحصرة على ولايتهم؛ إذ لا ولاية إلا له { ٱلْحَمِيدُ } [الشورى: 28] المستحق لجميع المحامد بذاته؛ إذ عموم المظاهر وذرائر الأكوان حامدة له سبحانه طوعاً ورغبة حالاً ومقالاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الذي يُنَزِّل الغيث } أي: المطر الذي يُغيثهم من الجدب، ولذا خصّ بالنافع منه، فلا يقال للمطر الكثير: غيث، { من بعد ما قنطوا }: يئسوا منه\n وتقييد تنزيله بذلك، مع نزوله بدونه أيضاً لمزيد تذكُّر كمال النعمة\n { وينشُرُ رحمتَه } أي: بركات الغيث ومنافعه، وما يحصل به من الخصب في كل مكان، من السهل، والجبل، والنبات، والحيوان\n أو: رحمته الواسعة المنتظمة لما ذكر وغيره\n { وهو الوليُّ } الذي يتولى عباده بالإحسان ونشر الرحمة، { الحميدُ } المستحق للحمد على ذلك، لا غيره\n الإشارة: عادته تعالى مع أوليائه أن يعطيهم ما يكفيهم بعد الاضطرار، ويمنعهم منه فوق الكفاية لئلا يشغلهم بذلك عن حضرته، وفي الحديث:\n\n \" إن الله يحمي عبده المؤمن ـ أي: مما يضره الدنيا وغيرها ـ كما يحمي الراعي الشفيق غنمه من مراتع الهلكة \" \n\nوفي حديث آخر:\n\n \" إذا أحبّ الله عبداً حماه الدنيا كما يحمي أحدكم سقيمه الماء \" \n\n \n\nورَوى ابن المبارك، عن سعيد بن المسيب قال:\n\n \" جاء رجل رسول الله صلى الله عليه وسلم فقال: أخبرني يا رسول الله بجلساء الله يوم القيامة؟ فقال: هم الخائفون، الخاضعون، المتواضعون، الذاكرون كثيراُ \" فقال: يا رسول الله فهم أول الناس يدخلون الجنة؟ قال: \" لا \" قال: فمَن أول الناس دخولاً الجنة؟ قال: \" الفقراء يسبقون الناس إلى الجنة، فيخرج إليهم ملائكة، فيقولون: ارجعوا إلى الحساب، فيقولون: علام نحاسب؟ والله ما أفيضت علينا الأموال فنفيض فيها، وما كنا أمراء نعدل ونجور، ولكنا جاءنا أمره فعبدنا حتى أتانا اليقين \" \n\nهـ\n قوله: { وهو الذي يُنزل الغيث\n\n\n } الآية، كما ينزل غيث المطر على الأرض الميتة، ينزل أمطار الواردات الإلهية على القلوب الميتة، فتحيا بالذكر والمعرفة، بعد أن أيست من الخصوصية\n قال القشيري: بعد كلام: وكذلك العبد إذا ذَبُلَ غُصْنُ وقته، وتكَدَّرَ صَفْو ودّه وكسفت شمس أُنسِه، وبَعُدَ عن الحضرةِ وساحاتِ القرب عَهْدُه، فربما ينظر إليه الحقُّ نظر رحمة، فينزل على سِرِّه أمطارَ الرحمة، ويعود عودُه طريّاً، ويُنْبِتُ في مشاهد أُنْسِه ورداً جَنِياً، وأنشدوا في المعنى:\n\nوقوله تعالى: { وهو الوليّ } قال القشيري في شرح الأسماء: الولي هو المتولي لأحوال عباده، وقيل معناه: المناصر، فأولياء الله أنصار دينه، وأشياع طاعته، والوليّ في صفة العبد: هو مَن يواظب على طاعة ربه، ومن علامات مَن يكون الحق سبحانه وليَّه: أن يصونه ويكفيه في جميع الأحوال، ويؤمنه، فيغار على قلبه أن يتعلق بمخلوق في دفع شر أو جلب نفع، بل يكون سبحانه هو القائم على قلبه في كل نَفَس، فيحقق آماله عند إشارته، ويجعل مآربه عند خطراته\n ومن أمارات ولايته لعبده: أن يديم توفيقه، حتى لو أراد سوءاً، أو قصد محظوراً، عصمه من ارتكابه\n ثم قال: ومن أمارات ولايته: أن يرزقه مودة في قلوب أوليائه\n هـ\n قلت: \" جعل مآربه عند خطراته: ليس شرطاً لأن هذا من باب الكرامة، ولا يشترط ظهورها عند المحققين\n ورَوى أنس عن النبي صلى الله عليه وسلم عن جبريل، عن ربه ـ عزّ وجل ـ قال:\n\n \" مَن أهان لي وليّاً فقد بارزني بالمحاربة، وإني لأسرع شيء إلى نصرة أوليائي، وإني لأغضب لهم، كما يغضب الليث الحَرِد \" \n\nانظر بقية الحديث في الثعلبي\n ثم ذكر شواهد قدرته، فقال: { وَمِنْ آيَاتِهِ خَلْقُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ }\n\n",
      "translations": []
    }
  ]
}