{
  "chapter": "الشورى",
  "text": "ام يقولون افترى على الله كذبا فان يشا الله يختم على قلبك ويمح الله البطل ويحق الحق بكلمته انه عليمۢ بذات الصدور",
  "translations": [
    {
      "translation": "Or do they ask, 'Has he invented a lie about Allah?' If Allah willed, He could seal up your heart. By His Words Allah wipes out the false and confirms the truth. He knows what the heart contains.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say he has fabricated a lie about God? He could have sealed your hearts if He pleased; but God blots out the false and vindicates the truth by His dispensations, for He knows the secrets of the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say: “He has forged a lie against Allah?” If Allah so wanted He could seal up your heart. Allah blots out falsehood and confirms the truth by His Words. He is well aware of all the secrets hidden in the breasts (of people).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say that he, (Muhammad), has invented falsehood against God? Had God wanted, He could have sealed up your heart. God causes falsehood to vanish and, by His words, firmly establishes the truth. He has full knowledge of what the hearts contain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! They dare say that, “He has fabricated a lie against Allah”? And if Allah wills, He can seal your heart by His mercy and protection*; and Allah wipes out falsehood and proves the truth by His Words; indeed He knows what lies within the hearts. (* So that you may not be agonised by what they do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: \"He has invented a lie against Allah\" If Allah willed, He could have sealed up your heart. And Allah wipes out falsehood, and establishes the truth by His Word. Verily, He knows well what are in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: He has forged a lie against Allah? But if Allah pleased, He would seal your heart; and Allah will blot out the falsehood and confirm the truth with His words; surely He is Cognizant of what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, 'He has forged against God a lie?' But if God wills, He will set a seal on thy heart; and God blots out falsehood and verifies the truth by His words; He knows the thoughts within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: He hath invented a lie concerning Allah? If Allah willed, He could have sealed thy heart (against them). And Allah will wipe out the lie and will vindicate the truth by His words. Lo! He is Aware of what is hidden in the breasts (of men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say, \"He has invented a lie about God\"? If God so willed, He could seal your heart. God wipes out falsehood and vindicates the truth by His words. He has full knowledge of what is in men's hearts --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say they: he hath fabricated a lie concerning God! Now, if Allah willed, He would seal thine heart. And Allah abolisheth falsehood and establisheth truth by His words; verily He is the Knower of that which is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say, ‘He has fabricated a lie against Allah’? If so, should Allah wish He would set a seal on your heart, and Allah will efface the falsehood and confirm the truth with His words. Indeed He knows well what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do they say, \"He has forged a falsehood against Allah\"? But if Allah willed, He could seal up thy heart. And Allah blots out Vanity, and proves the Truth by His Words. For He knows well the secrets of all hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: \"He has invented a lie against Allah?\" If Allah willed, He could have sealed your heart (so that you forget all that you know of the Quran). And Allah wipes out falsehood, and establishes the truth (Islam) by His Word (this Qur'an). Verily, He knows well what (the secrets) are in the breasts (of mankind).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: 'He has forged a lie about Allah? But if Allah wills He could set a seal upon your heart. Allah wipes out falsehood and verifies the truth by His Words. He knows the innermost of the chests.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, “He forged a lie about God.” If God so willed, He could have sealed your heart. But God obliterates the false, and confirm the true by His Words. He knows what is in the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He has invented about Allah a lie\"? But if Allah willed, He could seal over your heart. And Allah eliminates falsehood and establishes the truth by His words. Indeed, He is Knowing of that within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:24] Or (am here is like bal) do they say, ‘He has invented a lie against God?’, in ascribing the Qur’ān to God, exalted be He. For if God will, He can seal, He can fortify, your heart, with patience to endure the hurt they cause [you] by such sayings and otherwise — and God did this. And God will efface the falsehood, which they speak, and vindicate, confirm, the truth with His words, [the ones] revealed to His Prophet. Truly He is Knower of what is in the breasts, of what is in the hearts [of people].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or say they) in fact they do say: (He hath invented) Muhammad has invented (a lie concerning Allah?) The Prophet (pbuh) was saddened because of this, and so Allah, glorious and Exalted is He, said: (If Allah willed, He could have sealed) tied (thy heart (against them). And Allah will wipe out the lie) Allah will destroy idolatry and all the idolaters (and will vindicate the Truth by His words) and will manifest the religion of Islam through His enhancement. (Lo! He is aware of what is hidden in the breasts (of men)) He knows what is in people's hearts whether it is good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فإنْ يشأ الله يختم على قلبك } أي: لا يفتري على الله إلا من هو مختوم القلب مثلهم { ويمح الله الباطل } كلام مبتدأ\n ومن عادة الله أن يمحو الباطل { ويحقُّ الحقّ بكَلِماته } وقضائه إن كان افتراء يمحه ويثبت نقيضه وإن كان الافتراء ما يقولون فكذلك { وما عند الله خير وأبقى } لكونه أشرف وأدوم { للذين آمنُوا } الإيمان اليقيني ولا يتوكلون إلا على ربّهم بفناء الأفعال أي الذين علمهم اليقين وعملهم التوكل بالانسلاخ عن أفعالهم\n { والذين يجتنبون كبائر الإثم } التي هي وجوداتهم وهو أخسّ صفات نفوسهم التي تظهر بأفعالها في مقام المحو { وإذا ما غضبوا } في تلويناتهم { هم يغفرون } أي: الأخصاء بالمغفرة دون غيرهم { والذين اسْتَجابوا لربّهم } بلسان الفطرة الصافية إذا دعاهم إلى التوحيد بتجلي نور الوحدة { وأقَاموا } صلاة المشاهدة ولم يحتجبوا بآرائهم وعقولهم بل { أمرهم شورى بينهم } لعلمهم أن لله مع كل أحد شأناً وإليه نظراً وفيه سرّاً ليس لغيره ذلك الشأن والنظر والسرّ { وممّا رَزَقْناهم ينفقون } بالتكميل { والذين إذا أصَابهم البغي هم ينتصرون } بالعدالة احترازاً عن الذلَة والانظلام لكونهم في مقام الاستقامة\n قائمين بالحق والعدل الذي ظله في نفوسهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأينكرون مطلق رتبة النبوة والرسالة؟! أولئك المنكرون المعاندون { أَمْ يَقُولُونَ ٱفْتَرَىٰ } محمد صلى الله عليه وسلم { عَلَى ٱللَّهِ كَذِباً } واختلق آيات مفتريات ترويجاً لمدعاه\n وما قولهم هذا وزعمهم بك يا أكمل الرسل بأمثاله إلا قول باطل\n وزعم زاهق زائغ { فَإِن يَشَإِ ٱللَّهُ } الغني بذاته عن عموم مظاهره ومصنوعاته { يَخْتِمْ عَلَىٰ قَلْبِكَ } كما ختم على قلوبهم\n ويضلك عن طريق توحيده مثل ما أظلهم { وَ } بعد ذلك { يَمْحُ ٱللَّهُ ٱلْبَاطِلَ } لو تعلق مشيئته { وَيُحِقُّ } ويثبت { ٱلْحَقَّ } الحقيق بالإطاعة والاتباع { بِكَلِمَاتِهِ } التي هي آيات القرآن بلا سفارتك ورسالتك\n وبالجملة: { إِنَّهُ } سبحانه { عَلِيمٌ } يعلمه بعلمه الحضوري { بِذَاتِ ٱلصُّدُورِ } [الشورى: 24] فيظهر عليهم ما هو مكنون في صدورهم وضمائرهم\n ويجازيهم بمقتضاهز\n\n{ وَ } كيف لا يعلم سبحانه بمكنونات صدورهم { هُوَ ٱلَّذِي يَقْبَلُ ٱلتَّوْبَةَ } الصادرة عن محض الندم والإخلاص اللذين هما من أفعال القلوب { عَنْ عِبَادِهِ } المسترجعين نحوه بكمال الخشية والخضوع { وَ } بعد قبول التوبة عنهم { يَعْفُواْ } ويتجاوز { عَنِ } مطلق { ٱلسَّيِّئَاتِ } الصادرة عنهم على سبيل الغفلة { وَ } بالجملة { يَعْلَمُ } منكم جميع { مَا تَفْعَلُونَ } الشورى: 25] بظواهرهم وبواطنكم\n\n\n{ وَيَسْتَجِيبُ } أي: بحيث يقبل توبة { ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ } ترحماً لهم وإشفاقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أم يقولون } أي: بل أيقولون { افْتَرى } محمد { على اللهِ كذباً } في دعوة النبوة\n أو القرآن؟ والهمزة للإنكار التوبيخي\n كأنه قيل: أيمكن أن ينسبوا مثله ـ عليه الصلاة والسلام ـ للافتراء\n لا سيما لعظم الافتراء\n وهو الافتراء على الله\n فإن الافتراء إنما يُسام به أبعد خلق الله\n ومَن هو عرضة للختم والطبع\n فالعجب ممن يفوه به في جانب أكرم الخلق على الله\n { فإِن يشإِ يختمْ على قلبك } \n هذا استبعاد للافتراء على مثله لأنه إنما يجترىء على الله مَن كان مختوماً على قلبه\n جاهلاً بربه\n أمَّا مَن كان على بصيرة ومعرفة بربه\n فلا\n وكأنه قال: إن يشأ الله خذلانك يختم على قلبك\n لتجترىء بالافتراء عليه\n لكنه لم يفعل فلم تفتر\n أو: فإن يشأ الله عدم صدور القرآن عنك يختم على قلبك\n فلم تقدر أن تنطق بحرف واحد منه\n وحيث لم يكن كذلك\n بل تواتر الوحي عليك حيناً فحيناً تبين أنه من عند الله تعالى\n وهذا أظهر\n وقال مجاهد: إن يشأ يربط على قلبك بالصبر على أذاهم\n وعلى قولهم: افترى على الله كذباً لئلا تدخله مشقة بتكذيبهم\n هـ\n { ويَمْحُ اللهُ الباطلَ ويُحِقُّ الحقَّ بكلماته } \n استئناف مقرر لنفي الافتراء\n غير معطوف على \" يختم \" كما ينبىء عنه إظهار الاسم الجليل\n وإنما سقطت الواو ـ كما في بعض المصاحف ـ لاتباع اللفظ\n كقوله تعالى:\n[الإسراء: 11] مع أنها ثابتة في مصحف نافع\n قاله النسفي\n أي: ومن شأنه تعالى أن يمحق الباطل\n ويثبت الحق بوحيه\n أو بقضائه\n كقوله تعالى:\n[الأنبياء: 18]\n فلو كان افتراء كما زعموا لمحقه ودمغه\n أو: يكون عِدةً لرسول الله صلى الله عليه وسلم بأنه تعالى يمحو الباطل الذي هم عليه\n ويثبت الحق الذي هو عليه صلى الله عليه وسلم بالقرآن\n أو بقضائه الذي لا مرد له بنصره عليهم\n وقد فعل ذلك\n فمحا باطلهم\n وأظهر الإسلام\n { إِنه عليم بذاتِ الصدور } أي: عليم بما في صدرك وصدورهم\n فيجري الأمر على حسب ذلك من المحو والإثبات\n { وهو الذي يقبل التوبةَ عن عباده }\n يقال: قبلت الشيء منه: إذا أخذته منه\n وجعلته مبدأ قبولك\n وقبلتَه عنه\n أي: عزلته وأبنته عنه\n والتوبة: الرجوع عن القبيح بالندم\n والعزم ألا يعود\n ورد المظالم واجب غير شرط\n قال ابن عباس: لما نزل\n { قل لا اسألكم عليه أجراً\n\n\n } الآية\n قال قوم في نفوسهم: ما يريد إلا أن يحثنا على أقاربه من بعده\n فأخبر جبريلُ النبيَّ صلى الله عليه وسلم أنهم قد اتهموه\n وأنزل: { أم يقولون افترى على الله كذباً\n\n\n } الآية\n فقال القوم: يا رسول الله فإنا نشهد أنك صادق\n\nفنزل: { وهو الذي يقبل التوبة\n\n\n } هـ\n قال أبو هريرة: قال النبي صلى الله عليه وسلم:\n \" الله أفرح بتوبة عبده المؤمن من الضال الواجد\n ومن العقيم الوالد\n ومن الظمآن الوارد\n فمَن تاب إلى الله توبة نصوحاً أنسى الله حافظيه\n ولو كانت بقاعُ الأرض خطاياه وذنوبه \"\n \nواختلف العلماء في حقيقة التوبة وشرائطها\n فقال جابر بن عبد الله: دخل أعرابي مسجد النبي صلى الله عليه وسلم\n فقال: اللهم إني أستعيذك وأتوب إليك\n سريعاً\n وكبّر\n فلما فرغ من صلاته\n قال له عليّ: ما هذا؟ إن سرعة الاستغفار باللسان توبة الكذابين\n وتوبتك تحتاج إلى توبة\n فقال: يا أمير المؤمنين\n وما التوبة؟ قال: أسم يقع على ستة معانٍ: على الماضي من الذنوب الندامة\n ولتضييع الفرائض الإعادة\n ورد المظالم\n وإذابة النفس في الطاعة\n كما أذبتها في المعصية\n وإذاقة النفس مرارة الطاعة\n كما أذقتها حلاوة المعصية\n والبكاء بدل كل ضحك ضحكته\n وعن السدي: هي صدقُ العزيمة على ترك الذنوب\n والإنابة بالقلب إلى علاّم الغيوب\n وعن سهل: هي الانتقالُ من الأحوال المذمومة إلى الأحوال المحمودة\n وعن الجنيد: هي الإعراض عما سوى الله\n قال الله تعالى: { ويعفو عن السيئاتِ } وهو ما دون الشرك\n يعفو لمَن يشاء بلا توبة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:39",
      "similarity": 0.6768949259012376
    },
    {
      "verse": "17:12",
      "similarity": 0.6240164579913344
    },
    {
      "verse": "2:7",
      "similarity": 0.34274351740484066
    },
    {
      "verse": "83:26",
      "similarity": 0.3341250974120675
    },
    {
      "verse": "33:40",
      "similarity": 0.3319422629170326
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}