{
  "chapter": "الشورى",
  "text": "كذلك يوحى اليك والى الذين من قبلك الله العزيز الحكيم",
  "translations": [
    {
      "translation": "That is how He sends revelation to you and those before you. Allah is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So has God, all-mighty and all-wise, been revealing to you and to others before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus does Allah, the Most Mighty, the Most Wise reveal to you even as (He revealed) to those (Messengers) who preceded you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), this is how God, the Majestic and All-wise, sends revelations to you and sent them to those who lived before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is how Allah the Most Honourable, the All Knowing sends the divine revelation to you (O dear Prophet Mohammed – peace and blessings be upon him) and to those before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise Allah, the Almighty, the All-Wise sends revelation to you as to those before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus does Allah, the Mighty, the Wise, reveal to you, and (thus He revealed) to those before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So reveals to thee, and to those before thee, God, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus Allah the Mighty, the Knower inspireth thee (Muhammad) as (He inspired) those before thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus God, the Powerful, the Wise, sends revelation to you as He did to those before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this wise revealeth Unto thee and Unto those before thee, Allah the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, the All-mighty and the All-wise, thus reveals to you and to those who were before you:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus doth (He) send inspiration to thee as (He did) to those before thee,- Allah, Exalted in Power, Full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise Allah, the All-Mighty, the All-Wise inspires you (O Muhammad SAW) as (He inspired) those before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such Allah, the Almighty, the Wise reveals to you (Prophet Muhammad) and to those before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus He inspires you, and those before you—God the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus has He revealed to you, [O Muhammad], and to those before you - Allah, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:3] Thus — in other words, in the same [manner of] revelation — does He reveal to you and, did He reveal, to those [who were] before you, God (Allāhu, is the agent of [the action of] revelation) the Mighty, in His kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus Allah the Mighty) in retribution against those who do not believe in Him, (the Wise) in His command and decree, He commands that none should be worshipped except Him; it is also said this means: the Mighty in His sovereignty and dominion, the Wise in His command and decree (inspireth thee (Muhammad) as (He inspired) those before thee) of messengers; Allah says: just as We have revealed to you (Ha. Mim. 'Ayn. Sin. Qaf.) We have also revealed to those messengers who came before you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ حم * عسق } أي: الحق ظهر بمحمد ظهورعلمه بسلامة قلبه، فالحق محمد ظاهراً وباطناً، والعلم سلامة قلبه عن النقص والآفة أي: كماله وبروزه عن الحجاب إذ تجرّد القلب ظهور العلم { كذلِكَ } مثل ذلك الظهور على مظهرك وظهور علمه على قلبك { يوحي إليك وإلى الذين من قبلك } من الأنبياء { الله } الموصوف بجميع صفاته { العَزِيز } المتمنع بسرادقات جلاله وستور صفاته { الحَكِيم } الذي يظهر كماله بحسب الاستعدادات ويهدي بالوسايط والمظاهر جميع العباد على وفق قبول الاستعداد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَذَلِكَ } أي: مثل ما ذكر في هذه السورة من سرائر التوحيد والأخلاق المرضية الإلهية { يُوحِيۤ إِلَيْكَ } يا أكمل الرسل في كتابك هذا { وَإِلَى ٱلَّذِينَ } مضوا { مِن قَبْلِكَ } من الأنبياء والرسل في كتبهم وصحفهم { ٱللَّهُ } المتوحد بذاته المحيط بعموم مظاهره ومصنوعاته، المستقل بأمر الإرسال والإنزال والوحي والإلهام { ٱلْعَزِيزُ } الغالب في أمره وشأنه { ٱلْحَكِيمُ } [الشورى: 3] المتقن في أفعاله وتدبيراته الجارية في ملكه وملكوته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كذلك يُوحِي إِليك } أي: كما خصصناك بهذه الخصائص العظام أوحينا إليك { وإِلى الذين مِن قبلك } ، فقد خصصناهم ببعض ذلك، وأوحينا إليهم، وفي ابن عطية: عن ابن عباس: أن هذه الحروف بأعيانها نزلت في كل كتب الله، المنزلة على كل نبيّ أُنزل عليه كتاب، ولذلك قال تعالى: { كذلك يُوحي إليك وإلى الذين من قبلك }\n وقال القشيري: الحاء: مفتاح اسمه حكيم وحفيظ، والميم: مفتاح اسمه مالك وماجد ومؤمن ومهيمن، والعين: مفتاح اسمه عليم وعليّ، والسين: مفتاح اسمه سيد وسميع وسريع الحساب، والقاف: مفتاح اسمه قادر وقاهر وقريب وقدوس، أقسم الله تعالى بهذه الحروف أنه كذلك يُوحي إليك يا محمد\n هـ\n وقال ابن عطية: وإنما فصلت \" حم عسق \" ، ولم يفعل ذلك بـ \" كهيعص \" لتجري هذه مجرى الحواميم أخواتها\n هـ\n زاد النسفي: وأيضاً: هذه آيتان، و \" كهيعص \" آية واحدة\n هـ\n فانظره\n { اللهُ } أي: يوحي الله { العزيزُ الحكيمُ }: فاعل \" يُوحي \" ، وقرأ ابن كثير بالبناء للمفعول\n و \" الله \": فاعل بمحذوف، كأن قائلاً قال: مَن المُوحِي؟ فقال: { الله العزيز الحكيم } أي: الغالب بقهره، الحكيم في صنعه وتدبيره",
      "translations": []
    }
  ]
}