{
  "chapter": "الشورى",
  "text": "ان يشا يسكن الريح فيظللن رواكد على ظهره ان فى ذلك لءايت لكل صبار شكور",
  "translations": [
    {
      "translation": "If He wills He makes the wind stop blowing and then they lie motionless on its back. There are certainly Signs in that for everyone who is steadfast and thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He could stop the wind if He pleased, then they would be stranded on its surface. Surely there are signs in this for every one who perseveres and is grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He so wills, He can cause the winds to become still so that they will remain motionless on its surface. Surely there are many Signs in this for those who are wont to be steadfast and give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had He wanted, He could have stopped the wind and let the ships remain motionless on the surface of the sea, in this there is evidence (of the Truth) for all those who are patient and grateful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He wills, He can calm the winds so the ships remain still on the sea surface; indeed in this are signs for every greatly enduring, grateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He wills, He causes the wind to cease, then they would become motionless on the surface (of the sea). Verily, in this are signs for everyone patient and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He pleases, He causes the wind to become still so that they lie motionless on its back; most surely there are signs in this for every patient, grateful one,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and if He wills, He stills the wind, and they remain motionless on its back. Surely in that are signs for every man enduring, thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He will He calmeth the wind so that they keep still upon its surface - Lo! herein verily are signs for every steadfast grateful (heart). -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if He willed, He could bring the wind to a standstill and they would lie motionless on the surface of the sea, truly there are signs in this for anyone who is steadfast and grateful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He willeth He causeth the wind to cease so that they keep still on the back thereof; verily therein are signs for every patient, grateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He wishes He stills the wind, whereat they remain standstill on its surface. There are indeed signs in that for every patient and grateful [servant].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it be His Will He can still the Wind: then would they become motionless on the back of the (ocean). Verily in this are Signs for everyone who patiently perseveres and is grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He wills, He causes the wind to cease, then they would become motionless on the back (of the sea). Verily, in this are signs for everyone patient and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if He will, He calms the wind so that they remain motionless upon its back, surely, there are signs in this for every thankful, patient (person).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He willed, He could have stilled the winds, leaving them motionless on its surface. Surely in that are signs for every disciplined, grateful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If He willed, He could still the wind, and they would remain motionless on its surface. Indeed in that are signs for everyone patient and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:33] If He will, He stills the wind, whereat they remain, they become, motionless, fixed, not moving, on its surface. Surely in that there are signs for every steadfast, grateful [servant] — this is the believer, who is steadfast during hardship and grateful in [times of] comfort.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "If He will He calmeth the wind) by means of which ships sail (so that they keep still upon its surface) of the water. (Lo! Herein) in that which I have mentioned regarding ships (verily are signs) and lessons (for every steadfast) in acts of obedience (grateful (heart)) for Allah's blessings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن يَشَأْ يُسْكِنِ ٱلرِّيحَ فَيَظْلَلْنَ } معناه يَمكُثنَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {If He wills, He could settle the wind}, its meaning is that He could make it calm.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِن يَشَأْ } سبحانه { يُسْكِنِ ٱلرِّيحَ } المجرية لهن { فَيَظْلَلْنَ } ويبقين تلك السفن حينئذ { رَوَاكِدَ } سواكن { عَلَىٰ ظَهْرِهِ } أي: ظهر البحر ولججه\n فضاع جميع من فيها وما فيها { إِنَّ فِي ذَلِكَ } الإجراء والإرسال { لآيَاتٍ } دلائل واضحات على تولية الحق وتدبيره { لِّكُلِّ صَبَّارٍ } حبس نفسه في مقام الرضا بما قسم له ربه { شَكُورٍ } [الشورى: 33] بما ظهر عليه من آله ونعمائه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فيَظْلَلن رواكدَ على ظهره } فيبقين ثوابت على ظهر البحر، أي: غير جاريات لا غير متحركات أصلاً، { إِن في ذلك لآيات } عظيمة في أنفسها، كثيرة في العدد، دلالة على باهر قدرته { لكل صَبَّارٍ شكورٍ } لكل مَن حبس نفسه عن الهوى، وصرف همته إلى النظر في آلائه، أو: لكل صبّار على بلائه، شكور لنعمائه، أي: لكل مؤمن كامل فإن الإيمان نصفان: نصف شكر، ونصف صبر لأن الإنسان لا يخلو من ضر يمسه، أو نفع يناله، فآداب الضر: الصبر، وآداب النفع: الشكر، وأيضاً: راكب السفن ملزوم، إما للمشقة أو السلامة، فالصبر والشكر لا زمان له\n ولم يعطف إحدى الصفتين على الأخرى لأنهما لموصوف واحد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:51",
      "similarity": 0.07621277963828409
    },
    {
      "verse": "25:45",
      "similarity": 0.07311197406168331
    },
    {
      "verse": "77:41",
      "similarity": 0.057473387168376834
    },
    {
      "verse": "26:189",
      "similarity": 0.056946443869576174
    },
    {
      "verse": "30:46",
      "similarity": 0.05644627887268027
    }
  ]
}