{
  "chapter": "الشورى",
  "text": "وما انتم بمعجزين فى الارض وما لكم من دون الله من ولى ولا نصير",
  "translations": [
    {
      "translation": "You will not be able to thwart Him on the earth and you have no protector or helper besides Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot thwart Him on the earth, and have no friend or helper apart from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot frustrate Him in the earth; you have no protector nor helper against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot challenge God on earth and you will have no one besides Him as your guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot escape in the earth; and you have neither a friend nor any supporter against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot escape from Allah in the earth, and besides Allah you have neither any protector nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot escape in the earth, and you shall not have a guardian or a helper besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are not able to frustrate Him in the earth; and, apart from God, you have neither protector nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye cannot escape in the earth, for beside Allah ye have no protecting friend nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you cannot escape Him anywhere on earth. You have no protector or helper other than God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye cannot frustrate His Punishment in the earth; and there is for you beside Allah neither protector nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cannot frustrate [Allah] on the earth, and you do not have besides Allah any guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can ye frustrate (aught), (fleeing) through the earth; nor have ye, besides Allah, any one to protect or to help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot escape from Allah (i.e. His Punishment) in the earth, and besides Allah you have neither any Wali (guardian or a protector) nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are not able to frustrate Him in the earth, nor do you have a guardian and a helper other than Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are not the ones to interfere on earth; and besides God, you have no ally, and no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will not cause failure [to Allah] upon the earth. And you have not besides Allah any protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:31] And you, O idolaters, cannot escape, from God, by fleeing, on earth, and thus elude Him, and, besides God, that is to say, other than Him, you have neither protector nor helper, to ward off His chastisement from you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ye cannot escape in the earth) you cannot escape from Allah's chastisement, (for beside Allah) from Allah's torment (ye have no protecting friend) who can benefit you (nor any helper) who can defend you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لو أراد سبحاه تعقيب كل معصية بمصيبة { مَآ أَنتُمْ بِمُعْجِزِينَ } له { فِي ٱلأَرْضِ } أي: ليسي لكم أن تفوتوا شيئاً مما قضى سبحانه عليكم من المصائب المستتبعة لجرائمكم وآثامكم إن شاء، { وَ } الحال أنكم عاجزون في أنفسكم، مقهورون تحت قبضة قدرته؛ إذ { مَا لَكُمْ مِّن دُونِ ٱللَّهِ مِن وَلِيٍّ } يولي أموركم ويحفظكم منها { وَلاَ نَصِيرٍ } [الشورى: 31] ينصركم ويدفع عنكم ما يؤذيكم ويعينك على متبغاكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما أنتم بمعجزين في الأرض } أي: ما أنتم بفائتين ما قُضيَ عليكم من المصائب، وإن هجرتم في أقطارها كل مهرب، { وما لكم من دون الله من وليّ } متولِّ يحميكم منها { ولا نصيرٍ } يدفعها عنكم، أو يدفع عذابه إن حلّ\n\n\nالإشارة: إذا كان العبد عند الله في عين العناية أدّبه في الدنيا، ويبقى في حال قربه، وإذا كان عنده في عين الإهمال أمهل عقوبته إلى دار البقاء، وربما استدرجه بالنعم في حال إساءته، والعياذ بالله من مكره\n وإذا علم العبد أن ما يصيبه في هذه الدار من الأكدار كلها تخليص وتمحيص لم يستوحش منها، بل يفرح بها إذ هي علامة العناية، وإذا كانت على أيدي الناس، لم يقابلهم بالانتصار، بل يعفو ويصفح لعِلمه أن ذلك زيارة وترقية\n وقوله تعالى: { ويعفو عن كثير } هذا ـ والله أعلم ـ في حق العامة، وأما الخاصة فيشدد عليهم المحاسبة والتأديب ليرفع مقامهم، ويُكرم مثواهم\n ثم ذكر برهاناً آخر على قدرته تعالى، فقال: { وَمِنْ آيَاتِهِ ٱلْجَوَارِ فِي ٱلْبَحْرِ كَٱلأَعْلاَمِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:22",
      "similarity": 0.9788971631729185
    },
    {
      "verse": "11:33",
      "similarity": 0.7386870860107216
    },
    {
      "verse": "6:134",
      "similarity": 0.7070627697945919
    },
    {
      "verse": "16:46",
      "similarity": 0.6775123298692692
    },
    {
      "verse": "46:32",
      "similarity": 0.6627446660961931
    }
  ]
}