{
  "chapter": "الشورى",
  "text": "وما اصبكم من مصيبة فبما كسبت ايديكم ويعفوا۟ عن كثير",
  "translations": [
    {
      "translation": "Any disaster that strikes you is through what your own hands have earned and He pardons much.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever misfortune befalls you is a consequence of your deeds; yet He forgives much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever misfortune befalls you is a consequence of your own deeds. But much of it He forgives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever hardship befalls you is the result of your own deeds. God pardons many of your sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever calamity befalls you, is because of what your hands have earned – and there is a great deal He pardons!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever of misfortune befalls you, it is because of what your hands have earned. And He pardons much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever affliction befalls you, it is on account of what your hands have wrought, and (yet) He pardons most (of your faults).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever affliction may visit you is for what you own hands have earned; and He pardons much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever of misfortune striketh you, it is what your right hands have earned. And He forgiveth much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever misfortune befalls you is of your own doing, God forgives much,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever of affliction befalleth you is owing to that which your hands have earned; and He pardoneth much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever affliction that may visit you is because of what your hands have earned, and He excuses many [an offense of yours].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever misfortune happens to you, is because on the things your hands have wrought, and for many (of them) He grants forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever of misfortune befalls you, it is because of what your hands have earned. And He pardons much. (See the Quran Verse 35:45).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If affliction befalls you, it is what your own hands have earned, but He pardons a lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever misfortune befalls you, it is because of what your hands have earned; and yet He pardons much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever strikes you of disaster - it is for what your hands have earned; but He pardons much.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:30] And whatever affliction, [whatever] misfortune or hardship, may befall you — [this is] an address to the believers — is on account of what your [own] hands have earned, that is to say, [for] the sins that you have committed — the use of ‘hands’ to express this is because most actions are effected by them. And He pardons much, of these [sins] and does not requite them, for God’s kindness is greater than that He should [for example] double the requital in the Hereafter; as for those who do not commit [grave] sins, then what befalls them in this world [of hardship] raises their degree in the [reward of the] Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Whatever of misfortune striketh you) in your own persons, (it is what your right hands have earned. And He forgiveth much) of sins such that He does not take you to task for them\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها الأظلال الهالكة في أنفسها { مَآ أَصَـٰبَكُمْ مِّن مُّصِيبَةٍ } مضرة مؤلمة { فَبِمَا كَسَبَتْ أَيْدِيكُمْ } أي: بسبب اقترافكم المعاصي والآثام { وَ } مع ذلك { يَعْفُواْ } سبحانه { عَن كَثِيرٍ } [الشورى: 30] من المعاصي، لا يعقبها بمصيبة تخفيفاً لكم وتسهيلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما أصابكم من مصيبةٍ } غمّ، أو ألم، أو مكروه { بما كسبتْ أيديكم } أي: بجنايةٍ كسبتموها، عقوبةً لكم\n ومَن قرأ بالفاء فـ \" ما \" شرطية\n ومَن قرأ بغيرها فموصلة\n وتَعَلقَ بهذه الآية من يقول بالتناسخ، ومعناه عندهم: أن أرواح المتقدمين حين تموت أشباحها تنتقل إلى أشباح أُخر، فإن كانت صالحة انتقلت إلى جسم صالح وإن كانت خبيثة انتقلت إلى جسم خبيث، وهو باطل وكفر\n ووجه التعلُّق: أنه لو لم يكن للأطفال حالة كانوا عليها قبل هذه الحالة لما تألّموا\n ويجاب: بأن تألم الأطفال إما زيارة في درجات آبائهم إن عاشوا، أو في درجاتهم إن ماتوا لأنهم يلحقون بآبائهم في الدرجة، ولا عمل لهم إلا هذا التألُّم\n والله أعلم\n والآية مخصوصة بالمكلّفين بدليل السياق وهو قوله: { ويعفو عن كثير } أي: من الذنوب فلا يُعاقب عليها، أو: عن كثير من الناس، فلا يعاجلُهم بالعقوبة\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" واللهُ أكرم من أن يُثَنّي عليكم العقوبة في الآخرة، وما عفا عنه فالله أحلم من أن يعود فيه بعد عفوه \" \n\nوقال ابن عطاء: مَن لم يعلم أنَّ ما وصل إليه من الفتن والمصائب باكتسابه، وأن ما عفا عنه مولاه أكثر، كان قليل النظر في إحسان ربه إليه\n وقال محمد بن حامد: العبدُ ملازِمٌ للجنايات في كلّ أوان، وجناياته في طاعته أكثر من جناياته في معاصيه لأن جناية المعصية من وجه، وجناية الطاعة من وجوه، والله يُطهِّر العبد من جناياته بأنواع من المصائب ليخفّف عنه أثقاله في القيامة، ولولا عفوه ورحمته لهلك في أول خطوة\n وعن عليّ ـ كرّم الله وجهه ـ: هذه أرجى آيةٍ للمؤمنين في القرآن لأنّ الكريمَ إذا عاقب مرةً لا يُعاقِب ثانياً، وإذا عفا لا يعود\n هـ\n وقد تقدّم حديثاً\n قال في الحاشية الفاسية: قلت: وإنما يعفو في الدنيا عما يشاء، ويؤخر عقوبة مَن شاء إلى الآخرة، فلا يلزم إبطال وعيد الآخرة\n ثم الآية إما خاصة بالحدود، أو بالمجرم المذنب، وأما مَن لا ذنب له فما يُصيبه من البلاء اجتباء، وتخصيص، لا تمحيص\n هـ\n قلت: لكل مقام ذنب، حسنات الأبرار سيئات المقربين، فالتمحيص جار في كل مقام، وراجع ما تقدم عند قوله:\n\n[التوبة: 117] وسيأتي عند قوله:\n\n[محمد: 19] ما يبين هذا\n والله أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:52",
      "similarity": 0.4571659761441705
    },
    {
      "verse": "9:43",
      "similarity": 0.4518418861120662
    },
    {
      "verse": "42:25",
      "similarity": 0.4347316902223139
    },
    {
      "verse": "5:15",
      "similarity": 0.4322175160981473
    },
    {
      "verse": "4:99",
      "similarity": 0.42499167989750575
    }
  ]
}