{
  "chapter": "الشورى",
  "text": "والذين استجابوا۟ لربهم واقاموا۟ الصلوة وامرهم شورى بينهم ومما رزقنهم ينفقون",
  "translations": [
    {
      "translation": "those who respond to their Lord and establish salat, and manage their affairs by mutual consultation and give of what We have provided for them;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who obey the commands of their Lord and fulfil their devotional obligations, whose affairs are settled by mutual consultation, who spend of what We have given them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who obey their Lord and establish Prayer; who conduct their affairs by consultation, and spend out of what We have bestowed upon them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have pledged their obedience to the Lord, who are steadfast in prayer, who conduct their affairs with consultation among themselves, who spend for the cause of God out of what We have given them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who obeyed the command of their Lord and kept the prayer established; and whose affairs are with mutual consultation; and who spend in Our cause from what We have bestowed upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who answer the Call of their Lord, and perform the Salah, and who (conduct) their affairs by mutual consultation, and who spend of what We have bestowed on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who respond to their Lord and keep up prayer, and their rule is to take counsel among themselves, and who spend out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who answer their Lord, and perform the prayer, their affair being counsel between them, and they expend of that We have provided them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who answer the call of their Lord and establish worship, and whose affairs are a matter of counsel, and who spend of what We have bestowed on them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who respond to their Lord and attend to their prayers; who conduct their affairs by mutual consultation and spend out of what We have provided for them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who answer the call of their Lord and establish prayer and whose affair being matter of counsel among themselves, and who of that wherewith We have provided them expend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who answer their Lord, maintain the prayer, and [conduct] their affairs by counsel among themselves, and they spend out of what We have provided them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hearken to their Lord, and establish regular Prayer; who (conduct) their affairs by mutual Consultation; who spend out of what We bestow on them for Sustenance;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who answer the Call of their Lord [i.e. to believe that He is the only One Lord (Allah), and to worship none but Him Alone], and perform As-Salat (Iqamat-as-Salat), and who (conduct) their affairs by mutual consultation, and who spend of what We have bestowed on them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who answer their Lord, establish the prayers, and their affairs are by consultation; who spend of that which We have given them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who respond to their Lord, and pray regularly, and conduct their affairs by mutual consultation, and give of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have responded to their lord and established prayer and whose affair is [determined by] consultation among themselves, and from what We have provided them, they spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:38] and those who answer their Lord, [those who] respond to what He has summoned them in the way of affirming His Oneness and worship [of Him], and observe prayer, maintaining it regularly, and whose courses of action, those [courses of action] that seem good to them, are [a matter of] counsel between them, in which they consult one another and do not act hastily, and who, of what We have bestowed on them, expend, in obedience to God — such mentioned [individuals] constitute one category;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "562 (And those who answer the call of their Lord) through believing in Allah's divine Oneness and obeying Allah (and establish worship) and perform the five daily prayers, (and whose affairs are a matter of counsel) when they want a certain matter, deliberate among themselves about it and then embark upon it, (and who spend) in charity (of what We have bestowed on them) of wealth,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلَّذِينَ ٱسْتَجَابُواْ لِرَبِّهِمْ } معناه أَجابُوا }\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ ٱسْتَجَابُواْ } أي: أجابوا، وقبلوا دعوة من دعاهم إلى الطاعات والعبادات ومطلق الخيرات والحسنات، لا لغرض دنيوي بل { لِرَبِّهِمْ } طلباً لمرضاه وهرباً عن سخطه وانتقاماته { وَ } مع ذلك { أَقَامُواْ ٱلصَّلاَةَ } أي: أداموا الميل والرجوع إلى الله في جميع حالاتهم { أَمْرُهُمْ } أي: عموم أمورهم المتعلقة لمعاشهم ومعادهم { شُورَىٰ بَيْنَهُمْ } أي: هم متشاورون فيها مع إخوانهم، بلا استبدادهم لهم فيها برأيهم ولا انفراد بعقلهم { وَ } من معظم أخلاقهم أنهم { مِمَّا رَزَقْنَاهُمْ } أي: أبحنا لهم وأضفنا إليهم من الرزق الصوري { يُنفِقُونَ } [الشورى: 38] في سبيلنا للفقراء والمساكين، طالبين منَّا مرضاتنا ومثوباتنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ والذين استجابوا لربهم وأقاموا الصلاة } أتقنوا الصلوات الخمس، { وأمرُهُم شُورى بينهم } أي: ذو شورى، يعني: لا ينفردون برأيهم حتى يجتمعون عليه\n وعن الحسن: ما تشاور قوم إلا هُدوا لأرشد أمورهم\n والشورى: مصدر، كالفتيا، بمعنى التشاور\n { ومما رزقناهم يُنفقون } يتصدقون",
      "translations": []
    }
  ]
}