{
  "chapter": "الشورى",
  "text": "وترىهم يعرضون عليها خشعين من الذل ينظرون من طرف خفى وقال الذين ءامنوا۟ ان الخسرين الذين خسروا۟ انفسهم واهليهم يوم القيمة الا ان الظلمين فى عذاب مقيم",
  "translations": [
    {
      "translation": "You will see them as they are exposed to it, abject in their abasement, glancing around them furtively. Those who have iman will say, 'Truly the losers are those who lose themselves and their families on the Day of Rising.' The wrongdoers are in an everlasting punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You should see them brought before the Fire, abject in disgrace, looking stealthily. And those who believe will say: \"They who forfeit their souls and families on the Day of Resurrection will really be losers.\" Is it not that sinners will suffer a lasting torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall see them, as they are brought face to face with the chastisement, in a state of abject humiliation, looking with a furtive glance. But the believers will say: “Surely the true losers are they who lose themselves and their kindred on the Day of Resurrection.” Lo, the wrong-doers will be in an enduring torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see them exposed to the fire, subdued in humiliation, looking sideways at it pleadingly. However, at the same time, the believers will say, \"The true losers are those who will lose their souls and families on the Day of Judgment. The unjust will certainly suffer everlasting torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see them being presented upon the fire, cowering with disgrace watching with concealed eyes; and the believers will say, “Indeed ruined are those who have lost themselves and their families on the Day of Resurrection”; pay heed! Indeed the unjust are in a punishment that will never end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see them brought forward to it (Hell) made humble by disgrace, (and) looking with stealthy glance. And those who believe will say: \"Verily, the losers are they who lose themselves and their families on the Day of Resurrection.\" Verily, the wrongdoers will be in a lasting torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall see them brought before it humbling themselves because of the abasements, looking with a faint glance. And those who believe shall say: Surely the losers are they who have lost themselves and their followers on the resurrection day. Now surely the iniquitous shall remain in lasting chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou shalt see them, as they are exposed to it, abject in humbleness, looking with furtive glance; and the believers shall say, 'Surely the losers are they who lose themselves and their families on the Day of Resurrection; surely the evildoers are in lasting chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt see them exposed to (the Fire), made humble by disgrace, and looking with veiled eyes. And those who believe will say: Lo! the (eternal) losers are they who lose themselves and their housefolk on the Day of Resurrection. Lo! are not the wrong-doers in perpetual torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see them exposed to the Fire, abject in humiliation, glancing furtively at it, while those who believed will say, \"The losers are those ones who have forfeited their souls and their people on the Day of Resurrection.\" Truly, the wrongdoers will remain in everlasting torment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt behold them set up before it, downcast with ingominy ond looking with stealthy glance. And those who believe will say: verily the losers are they who have lost themselves and their housefolk on the Day of Resurrection. Lo! verily the wrong-doers will be in a a torment lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see them being exposed to it, humbled by abasement, furtively looking askance. The faithful will say, ‘Indeed the losers are those who have ruined themselves and their families on the Day of Resurrection. Indeed, the wrongdoers will abide in lasting punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt see them brought forward to the (Penalty), in a humble frame of mind because of (their) disgrace, (and) looking with a stealthy glance. And the Believers will say: \"Those are indeed in loss, who have given to perdition their own selves and those belonging to them on the Day of Judgment. Behold! Truly the Wrong-doers are in a lasting Penalty!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see them brought forward to it (Hell) made humble by disgrace, (and) looking with stealthy glance. And those who believe will say: \"Verily, the losers are they who lose themselves and their families on the Day of Resurrection. Verily, the Zalimun [i.e. Al-Kafirun (disbelievers in Allah, in His Oneness and in His Messenger SAW, polytheists, wrong-doers, etc.)] will be in a lasting torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall see them exposed before it, humbled in shame and looking upon it with a furtive glance and the believers will say: 'Indeed, the losers are they who lose themselves and their families on the Day of Resurrection' The harmdoers shall suffer an everlasting punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see them exposed to it, cowering from disgrace, looking with concealed eyes. Those who believed will say, “The losers are those who lost themselves and their families on the Day of Resurrection.” Indeed, the evildoers are in a lasting torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see them being exposed to the Fire, humbled from humiliation, looking from [behind] a covert glance. And those who had believed will say, \"Indeed, the [true] losers are the ones who lost themselves and their families on the Day of Resurrection. Unquestionably, the wrongdoers are in an enduring punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:45] And you will see them being exposed to it, namely, the Fire, submissive, fearful and humbled, by abasement, looking, at it, with a furtive glance, a slight look, stealthily (min [of min tarfin khafiyyin, ‘with a   furtive glance’] is to indicate inceptiveness, or it functions with the sense of a bā’, ‘with’ [sc. bi-tarfin khafiyyin]). And those who believe will say, ‘Verily the [true] losers are those who have lost themselves and their families on the Day of Resurrection, for being condemned to abide forever in the Fire and for not being able to attain [the blissful company of] the houris prepared for them in Paradise had they been believers (the relative clause [alladhīna khasirū ..., ‘those who have lost …’] constitutes the predicate of the particle inna, ‘verily’). Truly the wrongdoers, the disbelievers, will be in lasting, everlasting, chastisement — these [words] constitute God’s speech, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou wilt see them exposed to (the Fire), made humble by disgrace, and looking) towards you (with veiled eyes) i.e. furtively. (And those who believe) in Muhammad (pbuh) and the Qur'an (will say: Lo! the (eternal) losers are they who lose themselves and their housefolk) their servants in Paradise (on the Day of Resurrection. Lo! are not the wrong-doers) the idolaters: Abu Jahl and his host (in perpetual torment) in eternal chastisement?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن طَرْفٍ خَفِيٍّ } معناه انما ينظرُ ببعضِ عَينهِ\n وقال: يسارقونَ بالنَّظرِ إِلى جهنمَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {from a hidden side} means that He looks with some of His eyes.\n He said, \"They {The people of Paradise} steal glances at Hell.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم في هواجس أنفسهم يتكلمون بهذا الكلام تحسراً وتضجراً { تَرَاهُمْ } أيها الرائي حين { يُعْرَضُونَ عَلَيْهَا } أي: على النار { خَاشِعِينَ } خاضعين { مِنَ ٱلذُّلِّ } والصغار المفرط الشامل لهم { يَنظُرُونَ } نحو النار { مِن طَرْفٍ خَفِيٍّ } أي: بنظرة حفية من تحت الأهداب بلا تحريك الأجفان من كمال رعبهم وخشيتهم منها، كنظر من يؤمر بقتله إلى سيف الجلاد\n\n\n\n\n{ وَقَالَ ٱلَّذِينَ آمَنُوۤاْ } حين رأوا أعداءهم معذبين: { إِنَّ ٱلْخَاسِرِينَ } المسرفين المفسدين { ٱلَّذِينَ خَسِرُوۤاْ أَنفُسَهُمْ } بالظلم والضلال { وَأَهْلِيهِمْ } بالضد والإضلال، لذلك استحقوا العذاب المخلد { يَوْمَ ٱلْقِيَامَةِ } والنكال المؤبد فيها { أَلاَ } أي: تنبهوا أيها الأظلال المستظلون تحت لواء العدالة الإلهية { إِنَّ ٱلظَّالِمِينَ } الخارجين عن مقتضاها بإغواء الغوائل الإمكانية التسويلات الشيطانية { فِي عَذَابٍ مُّقِيمٍ } [الشورى: 45] وعقاب دائم أليم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والخطاب لكل مَن يتأتى منه الرؤية { خاشعين من الذل } متذللين متضائلين مما دهاهم، فالخشوع: خفض البصر وإظهار الذل، { ينظرون } إلى النار { من طَرْفٍ خَفِيٍّ } ضعيف بمسارقة، كما ترى المصْبُور ينظر إلى السيف عند إرادة قتله\n { وقال الذين آمنوا إِن الخاسرين الذين خسروا أنفسَهم وأهليهم } بالتعرُّض للعذاب الخالد { يومَ القيامة } ، و \" يوم \": متعلق بخسروا\n وقول المؤمنين واقع في الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:44",
      "similarity": 0.3932802726649284
    },
    {
      "verse": "68:43",
      "similarity": 0.3710304392100733
    },
    {
      "verse": "37:48",
      "similarity": 0.34292699666407866
    },
    {
      "verse": "27:40",
      "similarity": 0.331697806242017
    },
    {
      "verse": "38:52",
      "similarity": 0.3248925317916302
    }
  ]
}