{
  "chapter": "الشورى",
  "text": "له ما فى السموت وما فى الارض وهو العلى العظيم",
  "translations": [
    {
      "translation": "Everything in the heavens and everything in the earth belongs to Him. He is the Most High, the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth, belongs to Him. He is all-high and supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is all that is in the heavens and all that is in the earth; He is the Most High, the All-Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth. He is the Most High and the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him only belongs all whatever is in the heavens and all whatever is in the earth; and He is the Supreme, the Greatest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is on the earth, and He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is what is in the heavens and what is in the earth, and He is the High, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatsoever is in the heavens and whatsoever is in the earth; and He is the All-high, the All-glorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him belongeth all that is in the heavens and all that is in the earth, and He is the Sublime, the Tremendous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and earth belongs to Him: He is the Exalted, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatsoever is in the heavens and whatsoever is in the earth, and He is the Exalted, the Grand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whatever is in the heavens and whatever is in the earth belongs to Him, and He is the All-exalted, the All-supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and on earth: and He is Most High, Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is in the earth, and He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatsoever is in the heavens and the earth. He is the High, the Exalted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To him belongs everything in the heavens and everything on earth. He is the Sublime, the Magnificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and whatever is in the earth, and He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:4] To Him belongs whatever is in the heavens and whatever is in the earth, as possession, creation and servants, and He is the Exalted, above His creatures, the Tremendous, the Great.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَلِيُّ الْعَظِيمُ (4)جملة { له ما في السموات وما في الأرض } مقررة لوصفه { العزيز الحكيم } \\[ الشورى : 3 \\] لأن من كان ما في السماوات وما في الأرض مِلكاً له تتحقق له العزّة لقوة ملكوته ، وتتحقق له الحكمة لأن الحكمة تقتضي خلقَ ما في السماوات والأرض وإتقانَ ذلك النظام الذي تسير به المخلوقات . ولكون هذه الجملة مقررةً معنى التي قبلها كانت بمنزلة التأكيد فلم تعطف عليها .وجملة { وهو العلي العظيم } عطف عليها مقررة لما قررته الجملة قبلها فإن مَن اتصف بالعلاء والعظمة لو لم يكن عزيزاً لتخلف علاؤهُ وعظمته ، ولا يكون إلا حكيماً لأن عَلاءه يقتضي سموّه عن سفاسف الصفات والأفعال ، ولو لم يكن عظيماً لتعلقت إرادته بسفاسف الأمور ولتنازل إلى عبث الفعال .والعلو هنا علو مجازي ، وهو السموّ في الكمال بحيث كان أكمل من كل موجود كامل . والعظمة مجازية وهي جلالة الصفات والأفعال . وأفادت صيغة الجملة معنى القصر ، أي لا عليّ ولا عظيم غيره لأن مَن عداه لا يخلو عن افتقار إليه فلا علوّ له ولا عظمة . وهذا قصر قلب ، أي دون آلهتكم فلا علو لها كما تزعمون . قال أبو سفيان : أعْلُ هُبل .وتقدم معنى هاتين الجملتين في خلال آية الكرسي من سورة البقرة .\n\n",
      "translations": [
        {
          "translation": "(Unto Him belongeth all that is in the heavens and all that is in the earth) of created beings: they are all His slaves, (and He is the Sublime) most sublime than all that is, (the Tremendous) greater than all that is.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:4",
      "similarity": 0.6882737762963149
    },
    {
      "verse": "79:24",
      "similarity": 0.6351527717143831
    },
    {
      "verse": "69:22",
      "similarity": 0.6134767438714581
    },
    {
      "verse": "88:10",
      "similarity": 0.6134767438714581
    },
    {
      "verse": "16:3",
      "similarity": 0.6046152998653561
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}