{
  "chapter": "الشورى",
  "text": "انما السبيل على الذين يظلمون الناس ويبغون فى الارض بغير الحق او۟لئك لهم عذاب اليم",
  "translations": [
    {
      "translation": "There are only grounds against those who wrong people and act as tyrants in the earth without any right to do so. Such people will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blame lies on those who oppress, and terrorise the land unjustly. For them there is painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blame attaches only to those who subject people to wrong and commit excesses on earth. A painful chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who do injustice to people and commit rebellion on earth for no reason will be questioned. They will suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reproach is only against those who oppress people, and wrongfully spread rebellion in the land; for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way is only against those who oppress men and rebel in the earth without justification; for such there will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way (to blame) is only against those who oppress men and revolt in the earth unjustly; these shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way is only open against those who do wrong to the people, and are insolent in the earth wrongfully; there awaits them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way (of blame) is only against those who oppress mankind, and wrongfully rebel in the earth. For such there is a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "blame falls only on those who wrong men and transgress on this earth without justification, such will have a painful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way of blame is only against those who wrong mankind, and rebel in the earth without justice; these! for them is a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ground for action is only against those who oppress the people and commit tyranny in the land in violation of justice. For such there will be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blame is only against those who oppress men and wrong-doing and insolently transgress beyond bounds through the land, defying right and justice: for such there will be a penalty grievous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way (of blame) is only against those who oppress men and wrongly rebel in the earth, for such there will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blame is only against those who wrong people, and are wrongfully insolent in the earth, for them there is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blame lies on those who wrong people, and commit aggression in the land without right. These will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The cause is only against the ones who wrong the people and tyrannize upon the earth without right. Those will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:42] A course [of action] is only [open] against those who wrong people and seek [to commit], [who] commit, in the earth what is not right, [what are] acts of disobedience. For such there will be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ أُولَئِكَ لَهُمْ عَذَابٌ أَلِيمٌ (42)استئناف بياني فإنه لما جرى الكلام السابق كله على الإذن للذين بُغِي عليهم أن ينتصروا ممن بغَوا عليهم ثم عقب بأن أولئك ما عليهم من سبيل كان ذلك مثار سؤاللِ سائِللٍ عن الجانب الذي يقع عليه السبيل المنفي عن هؤلاء .والقصر المفاد ب { إنما } تأكيد لمضمون جملة { فأولئك ما عليهم من سبيل } \\[ الشورى : 41 \\] لأنه كان يكفي لإفادة معنى القصر أن يقابل نفيُ السبيل عن الذين انتصروا بعد ظلمهم بإثبات أنّ السبيل على الظالمين ، لأن إثبات الشيء لأحد ونفيه عمن سواه يفيد معنى القصر وهو الأصل في إفادة القصر بطريق المساواة أو الإطناب كقول آلسّمَؤْأل أو غيره: ... تَسيل على حدّ الظُّبات نفوسناوليستْ على غير الظبات تسيلُ ... وأما طرق القصر المعروفة في علم المعاني فهي من الإيجاز ، فلما أوردت أداة القصر هُنَا حصل نفي السبيل عن غيرهم مرةً أخرى بمفاد القصر فتأكد حصوله الأولُ الذي حصل بالنفي ، ونظيرُه قوله تعالى : ما على المُحسنين من سبيل إلى قوله : { إنَّما السبيل على الذين يستأذنونك وهم أغنياء } في سورة براءة ( 93 ) .والمراد بالسبيل } عين المراد به في قوله : { فأولئك ما عليهم من سبيل } \\[ الشورى : 41 \\] بقرينة أنه أعيد معرَّفا باللام بعد أن ذُكر منكَّراً فإن إعادة اللفظ النكرة معرّفاً بلام التعريف يفيد أن المراد به ما ذكر أولاً . وهذا السبيل الجزاء والتبعة في الدنيا والآخرة .وشمل عموم الذين يظلمون } ، وعمومُ { الناس } كلَّ ظالم ، وبمقدار ظلمه يكون جزاؤه . ويدخل ابتداءً فيه الظالمون المتحدَّث عنهم وهم مشركو أهل مكة ، والناسُ المتحدث عنهم وهم المسلمون يومئذٍ .والبغي في الأرض : الاعتداء على ما وضعه الله في الأرض من الحق الشامل لمنافع الأرض التي خلقت للناس ، مثل تحجير الزرع والأنعاممِ المحكِي في قوله تعالى : { وقالوا هذه أنعام وحَرْث حِجْرٌ لا يَطْعَمُها إلا مَن نَشاء بزعمهم } \\[ الأنعام : 138 \\] ، ومثل تسييب السائبة وتبحير البَحيرة ، والشامل لمخالفة ما سنّه الله في فطرة البشر من الأحوال القويمة مثل العدللِ وحسن المعاشرة ، فالبغْيُ عليها بمثل الكبرياء والصلف وتحقير الناسسِ المؤمنين وطردِهم عن مجامع القوْم بغيٌ في الأرض بغير الحق .والأرض } : أرض مكة ، أو جميع الكرة الأرضية وهو الأليق بعموم الآية ، كما قال تعالى : { وإذا تولى سعَى في الأرض ليفسد فيها } \\[ البقرة : 205 \\] وقال : { ولا تفسدوا في الأرض بعد إصلاحها } \\[ الأعراف : 85 \\] ، فكل فساد وظلم يقع في جزء من الأرض فهو بغي مظروف في الأرض .وبغير الحق } متعلق ب { يبغون } وهو لكشف حالة البغي لإفادة مذمته إذ لا يكون البغي إلاّ بغيرِ الحق فإن مسمى البغي هو الاعتداء على الحق ، وأما الاعتداء على المبطل لأجل باطله فلا يسمى بغياً ويُسمّى اعتداء قال تعالى : { فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم } \\[ البقرة : 194 \\] ، ويقال : استعدَى فلان الحاكمَ على خصمه ، أي طلب منه الحكم عليه .وجملة أولئك لهم عذاب أليم } بيان جملة { إنما السبيل على الذين يظلمون } إن أريد ب { السبيل } في قوله : { ما عليهم من سبيل } \\[ الشورى : 41 \\] سبيل العقاب في الآخرة ، أو بدل اشتمال منها إن أريد بالسبيل } هنالك ما يشمل الملام في الدنيا ، أي السبيل الذي عليهم هو أن لهم عذاباً أليماً جزاء ظلمهم وبغيهم .وحكم هذه الآية يشمل ظُلم المشركين للمسلمين ويشمل ظلم المسلمين بعضهم بعضاً ليتناسب مضمونها مع جميع ما سبق .وجيء باسم الإشارة للتنبيه على أنهم أحرياء بما يذكر بعد اسم الإشارة لأجل ما ذكر قبله مع تمييزهم أكمل تمييز بهذا الوعيد .\n\n",
      "translations": [
        {
          "translation": "(The way (of blame)) sin (is only against those who oppress mankind) i.e. who initiate wrong in the first place, (and wrongfully rebel in the earth. For such there is a painful doom.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { إِنَّمَا ٱلسَّبِيلُ } بهما { عَلَى } المسرفين { ٱلَّذِينَ يَظْلِمُونَ ٱلنَّاسَ } أي: يبتدئون بالظلم\n ويظهرون بينهم بالعدوان والطغيان { وَيَبْغُونَ } أي: يطلبون بظلمهم فساداً { فِي ٱلأَرْضِ بِغَيْرِ ٱلْحَقِّ } بلا خصة شرعية { أُوْلَـٰئِكَ } البعداء المجاوزون عن الحدود الشرعية { لَهُمْ } في النشأة الأخرى { عَذَابٌ أَلِيمٌ } [الشورى: 42] هو إحراقهم بنار القطيعة\n لا عذاب أشد منه وأفزع",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ويفسدون { بغير الحق أولئك لهم عذابٌ أليمٌ } بسبب بغيهم وظلمهم\n وفسّر السبيل بالتبعة والحجة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:50",
      "similarity": 0.44175001119937307
    },
    {
      "verse": "16:104",
      "similarity": 0.4413483609573866
    },
    {
      "verse": "7:140",
      "similarity": 0.40965434126133593
    },
    {
      "verse": "84:24",
      "similarity": 0.40326783246177433
    },
    {
      "verse": "26:201",
      "similarity": 0.39002084390797714
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}