{
  "chapter": "الشورى",
  "text": "استجيبوا۟ لربكم من قبل ان ياتى يوم لا مرد له من الله ما لكم من ملجا يومئذ وما لكم من نكير",
  "translations": [
    {
      "translation": "Respond to your Lord before a Day comes from Allah which cannot be turned back. On that Day you will have no hiding-place and no means of denial.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearken to your Lord before the Day arrives from God that will not be averted. You will have no place of refuge then nor time for denying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accept the command of your Lord before there comes a Day from Allah that cannot be averted. On that Day there shall be no shelter for you, and none may change your predicament.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pledge obedience to your Lord before the coming of the inevitable Day when you will find no refuge to escape from God's wrath and no one to defend you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey your Lord before the advent of a Day from Allah, which cannot be averted; you will not have any refuge on that day, nor will you be able to deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer the Call of your Lord before there comes from Allah a Day which cannot be averted. You will have no refuge on that Day nor there will be for you any denying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearken to your Lord before there comes the day from Allah for which there shall be no averting; you shall have no refuge on that day, nor shall it be yours to make a denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer your Lord, before there comes a day from God that cannot be turned back; upon that day you shall have no shelter, no denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer the call of your Lord before there cometh unto you from Allah a Day which there is no averting. Ye have no refuge on that Day, nor have a ye any (power of) refusal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Respond to your Lord before a Day arrives that will not be averted [against God's will]. You will not find any refuge from God on that Day, nor will you have [any opportunity] to deny your sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer the call of Your Lord afore there cometh Unto you a Day for which there is no averting from Allah. Ye will have no place of refuge on that Day, nor there will be for you any denying of Your guilt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Respond to your Lord before there comes a day for which there will be no revoking from Allah. On that day you will have no refuge, nor will you have [any chance for] denial [of your sins].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearken ye to your Lord, before there come a Day which there will be no putting back, because of (the Ordainment of) Allah! that Day there will be for you no place of refuge nor will there be for you any room for denial (of your sins)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer the Call of your Lord (i.e. accept the Islamic Monotheism, O mankind, and jinns) before there comes from Allah a Day which cannot be averted. You will have no refuge on that Day nor there will be for you any denying (of your crimes as they are all recorded in the Book of your deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer your Lord before that Day arrives which cannot be turned back from Allah, for you on that Day there shall be neither shelter, nor denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Respond to your Lord before there comes from God a Day that cannot be turned back. You will have no refuge on that Day, and no possibility of denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Respond to your Lord before a Day comes from Allah of which there is no repelling. No refuge will you have that day, nor for you will there be any denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:47] Answer your Lord, respond to Him by affirming His Oneness and worshipping [Him], before there comes a day, namely, the Day of Resurrection, for which there is no revoking from God, in other words, one which when He brings about He will not revoke. On that day you will have no refuge, in which to seek refuge in, and for you there will be no [way of] denying, your sins.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاسْتَجِيبُوا لِرَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا مَرَدَّ لَهُ مِنَ اللَّهِ مَا لَكُمْ مِنْ مَلْجَأٍ يَوْمَئِذٍ وَمَا لَكُمْ مِنْ نَكِيرٍ (47)بعد أن قُطع خطابهم عقب قوله : { فما أوتيتم من شيء فمتاع الحياة الدنيا } \\[ الشورى : 36 \\] بما تخلّص به إلى الثناء على فِرَق المؤمنين ، وما استتبع ذلك من التسجيل على المشركين بالضلالة والعذاب ، ووصففِ حالهم الفظيع ، عاد الكلام إلى خطابهم بالدعوة الجامعة لما تقدم طلباً لتدارك أمرهم قبل الفوات ، فاستؤنف الكلام استئنافاً فيه معنى النتيجة للمواعظ المتقدمة لأن ما تقدم من الزواجر يهيّىء بعض النفوس لقبول دعوة الإسلام .والاستجابة : إجابة الداعي ، والسين والتاء للتوكيد . وأطلقت الاستجابة على امتثال ما يطالبهم به النبي صلى الله عليه وسلم تبليغاً عن الله تعالى على طريقة المجاز لأن استجابة النداء تستلزم الامتثال للمنادي فقد كثر إطلاقها على إجابة المستنجد . والمعنى : أطيعوا ربكم وامتثلوا أمره من قبل أن يأتي يوم العذاب وهو يوم القيامة لأن الحديث جارٍ عليه .واللام في { لربكم } لِتأكيد تعدية الفعل إلى المفعول مثل : حمِدتُ له وشكرتُ له . وتسمى لام التبليغ ولام التبيين . وأصله استجابهُ ، قال كعب الغَنَوي: ... وداععٍ دعَا يَا مَن يجيب إلى النِّدافلم يستجبْه عند ذاك مجيب ... ولعل أصله استجاب دعاءه له ، أي لأجله له كما في قوله تعالى : { ألم نشرح لك صدرك } \\[ الشرح : 1 \\] فاختصر لكثرة الاستعمال فقالوا : استجاب له وشكر له ، وتقدم في قوله : { فليستجيبوا لي } في سورة البقرة ( 186 ) .والمردّ : مصدر بمعنى الرد ، وتقدم آنفاً في قوله : { هل إلى مَردّ من سبيل } \\[ الشورى : 44 \\] . { وَلا مَرد له } صفة { يوم } . والمعنى : لا مرد لإثباته بل هو واقع ، و { لَه } خبرُ { لا } النافية ، أي لا مرد كائناً له ، ولام { له } للاختصاص .و { مِن } : في قوله : { من الله } ابتدائية وهو ابتداء مجازي ، ومعناه : حكمُ الله به فكأنَّ اليوم جاء من لدنه .ويجوز تعليق المجرور بفعل { يأتي } . ويجوز أن يتعلق بالكون الذي في خبر { لا } . والتقدير على هذا : لا مرد كائناً من الله له وليس متعلقاً ب { مرد } على أنه متمم معناه ، إذ لو كان كذلك كان اسم { لا } شبيهاً بالمضاف فكان منوّناً ولم يكن مبنياً على الفتح ، وما وقع في «الكشاف» مما يوهم هذا مؤوّل بما سمعتَ ، ولذلك سمّاه صلة ، ولم يسمه متعلقاً .وجملة { ما لكم من ملجإٍ يومئذٍ } مستأنفة . والملجأ : مكان اللجأ ، واللجأ : المصير والانحياز إلى الشيء ، فالملجأ : المكان الذي يصير إليه المرء للتوقّي فيه ، ويطلق مجازاً على الناصر ، وهو المراد هنا ، أي ما لكم من شيء يقيكم من العذاب .والنكير : اسم مصدر أنكر ، أي ما لكم إنكار لما جُوزيتم به ، أي لا يسعكم إلاّ الاعتراف دون تنصل .\n\n",
      "translations": [
        {
          "translation": "(Answer the call of your Lord) by believing in Allah's divine Oneness (before there cometh unto you from Allah a Day) the Day of Judgement (which there is no averting. Ye have no refuge) no escape (on that Day) from Allah's torment, (nor have ye any (power of) refusal) nor do you have any helper.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { ٱسْتَجِيبُواْ } أيها المكلفون بالإجابة والقبول { لِرَبِّكُمْ } الذي رباكم على فطرة التوحيد\n وتوجهوا نحوه مخصلين\n وأجيبوا داعيه محمداً صلى الله عليه وسلم\n مصدقين { مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ } يحل فيه العذاب عليكم\n مع أنه { لاَّ مَرَدَّ لَهُ } أي: لا رفع ولا رد للعذاب النازل فيه { مِنَ ٱللَّهِ } وبعدما قضى سبحانه وحكم حتماً { مَا لَكُمْ مِّن مَّلْجَأٍ يَوْمَئِذٍ } سواه\n وقد جرى حكمه بتعذيبكم { وَمَا لَكُمْ مِّن نَّكِيرٍ } [الشورى: 47] وما يتيسر لكم حينئذ إنكار أسباب العذاب وموجباته\n إذ تشهد عليكم يومئذ أعضاؤكم وجوارحكم بما اقترفتم بها من الجرائم والآثام\n\n\nوبالجملة: قل لهم يا أكمل الرسل على سبيل العظة والتذكير أمثال هذه المواعظ والتذكيرات نيابة عنَّا\n فإن امتثلوا وقبلوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { استجيبوا لربكم } إلى ما دعاكم إليه على لسان نبيه\n { من قبل أن يأتيَ يومٌ } أي: يوم القيامة { لا مردَّ له من اللهِ } أي: لا يرده الله بعد ما حكم بمجيئه\n فـ \" من \" متعلق بـ \" لا مرد \" \n أو: بـ \" يأتي \" أي: من قبل أن يأتي من الله يوم لا يقدر أحد على رده\n { ما لكم من ملجأ يومئذٍ } أي: مفر تلتجئون إليه\n { وما لكم من نكيرٍ } أي: وليس لكم إنكار لما اقترفتموه لأنه مدوَّن في صحائف أعمالكم\n وتشهد عليكم جوارحكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:118",
      "similarity": 0.5650191751417516
    },
    {
      "verse": "9:57",
      "similarity": 0.32764123417153185
    },
    {
      "verse": "29:29",
      "similarity": 0.20119953312793398
    },
    {
      "verse": "18:87",
      "similarity": 0.1770673399484731
    },
    {
      "verse": "67:18",
      "similarity": 0.1339302907183645
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042047.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042047.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}