{
  "chapter": "الشورى",
  "text": "وجزؤا۟ سيئة سيئة مثلها فمن عفا واصلح فاجره على الله انه لا يحب الظلمين",
  "translations": [
    {
      "translation": "The repayment of a bad action is one equivalent to it. But if someone pardons and puts things right, his reward is with Allah. Certainly He does not love wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The retribution of evil is the equal of evil (done); yet those who forgive and rehabilitate will be rewarded by God. Verily He does not like those who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of evil is evil the like of it. But he who forgives and makes amends, his reward lies with Allah. Surely He does not love the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense for evil will be equivalent to the deed. He who pardons (the evil done to him) and reforms himself, will receive his reward from God. God certainly does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The retribution of a harmful deed is the harm equal to it; so whoever forgives and makes amends, so his reward is upon Allah; indeed He does not befriend the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense for an evil is an evil like thereof; but whoever forgives and makes reconciliation, his reward is with Allah. Verily, He likes not the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the recompense of evil is punishment like it, but whoever forgives and amends, he shall have his reward from Allah; surely He does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the recompense of evil is evil the like of it; but whoso pardons and puts things right, his wage falls upon God; surely He loves not the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guerdon of an ill-deed is an ill the like thereof. But whosoever pardoneth and amendeth, his wage is the affair of Allah. Lo! He loveth not wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let harm be requited by an equal harm. But whoever pardons and amends will find his reward with God. He does not love the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The meed of an ill-deed is an ill the like thereUnto; but whosoever pardoneth and amendeth, his hire is on Allah; verily He approveth not the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The requital of evil is an evil like it, so whoever excuses and conciliates, his reward lies with Allah. Indeed, He does not like the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense for an injury is an injury equal thereto (in degree): but if a person forgives and makes reconciliation, his reward is due from Allah: for (Allah) loveth not those who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense for an evil is an evil like thereof, but whoever forgives and makes reconciliation, his reward is due from Allah. Verily, He likes not the Zalimun (oppressors, polytheists, and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of a sin is a sin like it, but whosoever forgives and seeks to reform, his wage will be with Allah. Surely, He does not love the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The repayment of a bad action is one equivalent to it. But whoever pardons and makes reconciliation, his reward lies with God. He does not love the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the retribution for an evil act is an evil one like it, but whoever pardons and makes reconciliation - his reward is [due] from Allah. Indeed, He does not like wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:40] For the requital of an evil deed is an evil deed like it: the latter is [also] referred to as ‘an evil deed’ because in [outward] form it resembles the former; this is evident in what concerns retaliation for wounds. Some [scholars] say that even if another were to say, ‘May God disgrace you!’, then one should respond [equally] with, ‘May God disgrace you!’. But whoever pardons, his wrongdoer, and reconciles, the amity between himself and the one pardoned, his reward will be with God, that is to say, God will give him his reward without doubt. Truly He does not like wrongdoers, that is, those who initiate acts of wrongdoing and so merit His punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The guerdon of an ill deed is an ill the like thereof) the guerdon of wound is a wound like it. (But whosoever pardoneth) the wrong he suffers (and amendeth) and forgoes retaliation, (his wage is the affair of Allah) his reward is upon Allah. (Lo! He loveth not wrong-doers) he loves not those who initiate wrong.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تعليماً لعابده طريق هدايته ورشاده: { وَجَزَآءُ سَيِّئَةٍ } أصابتك من أحد من بني نوعك { سَيِّئَةٌ مِّثْلُهَا } لا أزي منها؛ أي: إذا أساءك أحد بسيئة، فأنت أيها المكلف تسيئه بمثلها جزاءً وعقوبة، سمى الجزاء سيئة؛ للازدواج والمشاكلة، هذا بحسب الرخصة الشرعية، وأما بحسب العزيمة { فَمَنْ عَفَا } وتجاوز عن الجاني والمسيء خالصاً لوجه الله وطلباً لمرضاته { وَأَصْلَحَ } بالصلح والإحسان ما أفسده بالجناية والإساءة { فَأَجْرُهُ } قد وقع { عَلَى ٱللَّهِ } وجزاؤه مفوض إلى كرمه يجازيه بمقتضى فضله وجوده ما شاء الله، وبالجملة: { إِنَّهُ } سبحانه بمقتضى عدالته الذاتية { لاَ يُحِبُّ ٱلظَّالِمِينَ } [الشورى: 40] المجاوزين عن الحدود الإلهية سيما في العقوبات والجنايات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيّن حدّ الانتصار، فقال: { وجزاءُ سيئةٍ سيئةٌ مثلها } فالأولى سيئة حقيقة، والثانية مجازاً للمشاكلة، وفي تسميتها سيئة نكتة، وهي الإشارة إلى أن العفو أولى، والأخذ بالقصاص سيئة بالنسبة إلى العفو، ولذلك عقبه بقوله: { فمَن عَفَا وأصلحَ } بينه وبين خصمه بالتجاوز والإغضاء { فأجره على الله } ، وهي عِدَةٌ مبهمة لا يقادر قدرها، { إِنه لا يحب الظالمين } الذين يبدؤون بالظلم، أو: يتجاوزون حدّ الانتصار\n\n\nوفي الحديث:\n\n \" ينادي منادٍ يوم القيامة: مَن كان له أجر على الله فليقم، فلا يقوم إلا مَن عفا \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:25",
      "similarity": 0.4732956479966028
    },
    {
      "verse": "22:60",
      "similarity": 0.46296643865771564
    },
    {
      "verse": "30:45",
      "similarity": 0.42069916501903676
    },
    {
      "verse": "2:52",
      "similarity": 0.41686240772551103
    },
    {
      "verse": "9:43",
      "similarity": 0.41544234780669276
    }
  ]
}