{
  "chapter": "الشورى",
  "text": "وما كان لهم من اولياء ينصرونهم من دون الله ومن يضلل الله فما له من سبيل",
  "translations": [
    {
      "translation": "They will have no protector to help them other than God. He whom God allows to go astray has no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have no protectors to help them against Allah. For he whom Allah causes to go astray will have no way to save himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have no guardian or helper besides God. Whoever God has caused to go astray will never find the right direction\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they had no friends to help them against Allah; and there is no way for one whom Allah sends astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will have no protectors to help them other than Allah. And he whom Allah sends astray, for him there is no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall have no friends to help them besides Allah; and-- whomsoever Allah makes err, he shall have no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no protectors to help them, apart from God, and whomsoever God leads astray, no way has he.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will have no protecting friends to help them instead of Allah. He whom Allah sendeth astray, for him there is no road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they will have no allies to help them against God; there is no way [forward] for those whom God lets go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall have no patrons succouring them beside Allah. And whomsoever Allah sendeth astray for him there will be no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no awliya to help them besides Allah. There is no way out for those whom Allah leads astray.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no protectors have they to help them, other than Allah. And for any whom Allah leaves to stray, there is no way (to the Goal).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will have no Auliya' (protectors) to help them other than Allah. And he whom Allah sends astray, for him there is no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have none to protect or help them other than Allah. He whom Allah leads astray there is no way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have no allies to support them against God. Whomever God leaves astray has no way out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there will not be for them any allies to aid them other than Allah. And whoever Allah sends astray - for him there is no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:46] And they have no guardians to help them besides God, that is to say, other than Him, to ward off His chastisement from them, and whomever God leads astray has no course [of action]’, no route to the truth in this world or to Paradise in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they will have no protecting friends) no relatives (to help them) to save them (instead of Allah) from Allah's torment. (He whom Allah sendeth astray) from His religion, like Abu Jahl, (for him there is no road) 563 for him there is no religion or proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا كَانَ لَهُم مِّنْ أَوْلِيَآءَ يَنصُرُونَهُم مِّن دُونِ ٱللَّهِ } وينقذونهم من عذابه، والحال أنه قد أضلهم الله بمقتضى قهره وجلاله { وَمَن يُضْلِلِ ٱللَّهُ } المنتقم الغيور { فَمَا لَهُ مِن سَبِيلٍ } [الشورى: 46] إلى الهداية والنجاة من وبال ما يترتب على الغي والضلال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ويقال، أي: يقولونه يوم القيامة، إذا رأوهم على تلك الصفة: { ألا إِن الظالمين في عذابٍ مقيم } دائم، { وما كان لهم من أولياء ينصرونهم } برفع العذاب عنهم { من دون الله } حسبما كانوا يرجون ذلك في الدنيا، { ومَن يُضلل اللهُ فما له من سبيلٍ } إلى النجاة",
      "translations": []
    }
  ]
}