{
  "chapter": "الشورى",
  "text": "فان اعرضوا۟ فما ارسلنك عليهم حفيظا ان عليك الا البلغ وانا اذا اذقنا الانسن منا رحمة فرح بها وان تصبهم سيئةۢ بما قدمت ايديهم فان الانسن كفور",
  "translations": [
    {
      "translation": "But if they turn away, We have not sent you to be their guardian. You are only responsible for transmission. When We let a man taste mercy from Us he exults in it. But if something bad strikes him for what he has done he is ungrateful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they turn away (you are not responsible); We have not appointed you a warden over them. Your duty is to deliver the message. When We let man taste of Our favours he begins to exult; but if misfortune befalls him, as a consequence of his own deeds, man is surely then ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), if they turn away from the Truth, know that We did not send you to them as their overseer. Your task is only to convey (the Message). Indeed when We give man a taste of Our Mercy, he exults in it. But if any misfortune afflicts them on account of their deeds, man is utterly ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), if they turn away from your message, know that We have not sent you as their keeper. Your duty is only to deliver the message. When We grant mercy to the human being, he becomes joyous, but when he is afflicted by evil as a result of his own deeds, he proves to be ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they turn away from you, We have not sent you as a guardian over them; upon you is nothing but to convey (the message); and when We make man taste some mercy from Us, he rejoices upon it; and if some harm reaches them because of what their own hands have sent before, thereupon man is ungrateful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn away, We have not sent you as a Hafiz over them. Your duty is to convey. And verily, when We cause man to taste of mercy from Us, he rejoices there at; but when some evil befalls them because of the deeds which their hands have sent forth, then verily, man (becomes) ingrate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn aside, We have not sent you as a watcher over them; on you is only to deliver (the message); and surely when We make man taste mercy from Us, he rejoices thereat; and if an evil afflicts them on account of what their hands have already done, then-surely man is ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn away, We sent thee not to be a guardian over them. It is for thee only to deliver the Message. And when We let man taste mercy from Us, he rejoices in it; but if some evil befalls him for that his own hands have forwarded, then surely man is unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they are averse, We have not sent thee as a warder over them. Thine is only to convey (the message). And lo! when We cause man to taste of mercy from Us he exulteth therefor. And if some evil striketh them because of that which their own hands have sent before, then lo! man is an ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now if they turn away, We have not sent you [O Prophet] as their keeper: your responsibility is only to convey the message. Man is such that when We let him taste Our mercy, he exults in it, but if an evil befalls him which is his own doing, he becomes utterly ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they turn away, then We have not sent thee to be a warden over them, on thee is naught but preaching. And verily We! when We cause man to taste of mercy from Us he exulteth thereat; and if an ill befalleth them because of that which their hands have sent on, then verily man becometh ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they disregard [your warnings], [keep in mind that] We have not sent you as their keeper. Your duty is only to communicate. Indeed when We let man taste Our mercy, he boasts about it; but should an ill visit him because of what his hands have sent ahead, then man is very ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they run away, We have not sent thee as a guard over them. Thy duty is but to convey (the Message). And truly, when We give man a taste of a Mercy from Ourselves, he doth exult thereat, but when some ill happens to him, on account of the deeds which his hands have sent forth, truly then is man ungrateful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn away (O Muhammad SAW from the Islamic Monotheism, which you have brought to them). We have not sent you (O Muhammad SAW) as a Hafiz (protector) over them (i.e. to take care of their deeds and to recompense them). Your duty is to convey (the Message). And verily, when We cause man to taste of Mercy from Us, he rejoices thereat, but when some ill befalls them because of the deeds which their hands have sent forth, then verily, man (becomes) ingrate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn away, We have not sent you (Prophet Muhammad) to be their (compulsory) guardian. It is only for you to deliver (the Message). When We give the human a taste of Our Mercy, he rejoices because of it; but when, because of what he has earned, evil befalls him, the human is ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn away—We did not send you as a guardian over them. Your only duty is communication. Whenever We let man taste mercy from Us, he rejoices in it; but when misfortune befalls them, as a consequence of what their hands have perpetrated, man turns blasphemous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they turn away - then We have not sent you, [O Muhammad], over them as a guardian; upon you is only [the duty of] notification. And indeed, when We let man taste mercy from us, he rejoices in it; but if evil afflicts him for what his hands have put forth, then indeed, man is ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:48] But if they are disregardful, of answering [God], We have not sent you as a keeper over them, to keep [track of] their deeds by securing what is demanded of them. Your duty is only to deliver the Message — this was [revealed] before the command to struggle [against them]. And indeed when We let man taste from Us some mercy, some grace, such as wealth and good health, he exults in it; but if some ill, [some] calamity, befalls them (the pronoun here refers to ‘man’, on the basis of the [plural import of the] generic noun) because of what their [own] hands have sent ahead, [because of what] they have offered [of deeds] — the expression refers to ‘the hands’ because most actions are effected by them), then lo! man is ungrateful, for the grace.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But if they are averse) of faith, (We have not sent thee as a warder over them) whereby you have to protect them. (Thine is only to convey (the message)) on behalf of Allah. After this, Allah commanded them to fight. (And lo! when We cause man) the disbelieving person (to taste of mercy) to taste a blessing (from Us he exulteth therefore) without giving thanks for it. (And if some evil) hardship, poverty or misfortune (striketh them because of that which their own hands have sent before) because of what they did in their state of idolatry, (then lo! Man) Abu Jahl (is an ingrate) he disbelieves in Allah and does not give thanks for His blessings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: قل لهم يا أكمل الرسل على سبيل العظة والتذكير أمثال هذه المواعظ والتذكيرات نيابة عنَّا، فإن امتثلوا وقبلوا، فقد اهتدوا { فَإِنْ أَعْرَضُواْ } أي: فاعلم أنا ما أرسلناك يا أكمل الرسل { عَلَيْهِمْ حَفِيظاً } يحفظهم عن جميع ما يضرهم ويغويهم، بل { إِنْ عَلَيْكَ } أي: ما عيك { إِلاَّ ٱلْبَلاَغُ } وقد بلغت، وبعد تبليغك ما بقي عليك من حسابهم من شيء\n\n\n\n\nثم أشار سبحانه إلى وهن عزائم الإنسان وضعف عقائده، فقال: { وَإِنَّآ } عنها، ولم يلتفتوا إليها عناداً ومكابرة { فَمَآ أَرْسَلْنَاكَ } من مقام عظيم جودنا { إِذَآ أَذَقْنَا ٱلإِنسَانَ } تفضلاً { مِنَّا } بلا سبق استحقاق منه { رَحْمَةً } شاملة محيطة بجميع أعضائه وجوارحه { فَرِحَ بِهَا } وانبسط بحلولها { وَإِن تُصِبْهُمْ } حيناً من الأحيان { سَيِّئَةٌ } من السيئات مؤلمة لهم، مع أنها { بِمَا قَدَّمَتْ أَيْدِيهِمْ } أي: بشؤم ما اقترفوا من المعاصي والآثام الجالبة لأنواع المضرات { فَإِنَّ ٱلإِنسَانَ كَفُورٌ } [الشورى: 48] مسرع إلى الكفران، مبادر إلى النيسان، كأنه لم ير منَّا الإحسان والإنعام قط\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِنْ أعرضوا } عن الإيمان { فما أرسلناك عليهم حفيظاً } رقيباً، تحفظ أعمالهم، وتحاسبهم، { إِنْ عليك إِلا البلاغُ } ما عليك إلا تبليغ الرسالة، وقد بلغت، وليس المانع لهم من الإيمان عدم التبليغ، وإنما المانع: الطغيان وبطر النعمة، كما قال تعالى: { وإِنَّا إِذا أَذقنا الإِنسانَ منا رحمةً } أي: نعمة من الصحة، والغنى، والأمن، { فرح بها } وقابلها بالبطر، وتوصّل بها إلى المخالفة والعصيان\n وأريد بالإنسان الجنس، لقوله تعالى: { وإِن تُصبهم سيئة } ، بلاء، من مرض، وفقر، وخوف، { بما قدمتْ أيديهمْ فإِنَّ الإِنسانَ كفورٌ } بليغ الكفر، ينسى النعمة رأساً، ويذكر البلية، ويستعظمها، بل يزعم أنها أصابته من غير استحقاق\n وأفرد الضمير في فرح مراعاة للفظ، وجمعه في \" تُصبهم \" مراعاة للمعنى\n وإسناد هذه الخصلة إلى الجنس مع كونها من خواص الجنس، لغلبتها فيهم\n وتصدير الشرطية الأُولى بإذا، مع إسناد الإذاقة إلى نون العظمة للتنبيه على أن إيصال الرحمة محقق الوجود، كثير الوقوع، وأنه مراد بالذات، كما أن تصدير الثانية بأن، وإسناد الإصابة إلى السيئة، وتعليلها بأعمالهم للإيذان بندرة وقوعها، وأنها غير مرادة بالذات، \" إن رحمتي سبقت غضبي \"\n\n\nووضع الظاهر موضع الضمير للتسجيل على أن هذا الجنس موسوم بكفران النعم\n قاله أبو السعود\n الإشارة: من تنكبتْه العناية السابقة، وأدركته الغواية اللاحقة، لم ينفع فيه وعظ ولا تذكير، وليس له من عذاب الله وليّ ولا نصير، فإذا تحققت الحقائق، وطلب الرجوع، لم يجد له سبيلاً، وبَقِيَ في الهوان خاشعاً ذليلاً، فيُعيرهم مَن سبقتْ لهم العناية، من أهل الجد والتشمير، ويقولون: هؤلاء الذين خسروا أنفسهم، حيث لم يُتعبوها في مرضاة الله، وأهليهم، حيث لم يذكِّروهم الله\n قال القشيري: قوله تعالى: { استجيبوا لربكم } بالوفاء بعهده، والقيام بحقِّه، والرجوع من مخالفته إلى موافقته، والاستسلام في كل وقت لحُكمِه والطريق اليوم إلى الاستجابة مفتوحٌ، وعن قريبٍ سيُغْلَقُ البابُ على القلب بغتة، ويُؤخذ فلتةً\n هـ\n ويقال لكل واعظ وداع: { فإِن أعرضوا فما أرسلناك عليهم حفيظاً\n\n\n } الآية\n ثم بيَّن وجه ما تقدّم، من أن الأمور كلها بيده، هداية وإضلالاً، وإنعاماً وابتلاء، فقال: { لِلَّهِ مُلْكُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:36",
      "similarity": 0.5336263914724282
    },
    {
      "verse": "9:50",
      "similarity": 0.5090724860921718
    },
    {
      "verse": "10:58",
      "similarity": 0.3941661144484395
    },
    {
      "verse": "28:47",
      "similarity": 0.38967043015005515
    },
    {
      "verse": "3:120",
      "similarity": 0.37601695944265723
    }
  ]
}