{
  "chapter": "الشورى",
  "text": "صرط الله الذى له ما فى السموت وما فى الارض الا الى الله تصير الامور",
  "translations": [
    {
      "translation": "the Path of Allah to Whom everything in the heavens and everything on the earth belongs. Indeed all",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of God to whom belongs the kingdom of the heavens and the earth. And will not all things go back to God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Way of Allah, to Whom belongs the dominion of all that is in the heavens and the earth. Lo, it is to Allah that all things ultimately revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of God who is the owner of all that is in the heavens and the earth. To God certainly do all matters return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah – the One to Whom only belongs all whatever is in the heavens and all whatever is in the earth; pay heed! Towards Allah only do all matters return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah to Whom belongs all that is in the heavens and all that is on the earth. Verily, all matters at the end go to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth; now surely to Allah do all affairs eventually come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of God, to whom belongs whatsoever is in the heavens, and whatsoever is in the earth. Surely unto God all things come home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth. Do not all things reach Allah at last?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of God, to whom belongs all that is in the heavens and on the earth. Indeed all matters return eventually to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth. Lo! Unto Allah trend all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of Allah, to whom belongs whatever is in the heavens and whatever is in the earth. Indeed all matters return to Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Way of Allah, to Whom belongs whatever is in the heavens and whatever is on earth. Behold (how) all affairs tend towards Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Path of Allah, to Whom belongs all that is in the heavens and all that is in the earth. Verily, all the matters at the end go to Allah (for decision).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Path of Allah, to whom belongs all that is in the heavens and all that is in the earth. Surely, to Allah all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of God, to whom belongs everything in the heavens and everything on earth. Indeed, to God all matters revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Unquestionably, to Allah do [all] matters evolve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:53] the path of God, to Whom belongs whatever is in the heavens and whatever is in the earth, as possessions, creatures and servants. Surely with God all matters end [their journey], [all matters] return. Meccan [entirely], or as some say [Meccan] with the exception of verse 45, which is Medinese; it consists of 89 verses, revealed after [sūrat] al-Shūrā.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nصِرَاطِ اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ (53){ عِبَادِنَا وَإِنَّكَ لتهدى إلى صراط } { مُّسْتَقِيمٍ \\* صراط الله الذى لَهُ مَا فِى السماوات وَمَا فِى الارض أَلاَ إِلَى الله تَصِيرُ الامور } .أي نهدي به من نشاء بدعوتك وواسطتك فلما أثبت الهديَ إلى الله وجعل الكتاب سبباً لتحصيل الهداية عطف عليه وساطةَ الرّسول في إيصال ذلك الهدي تنويهاً بشأن الرّسول صلى الله عليه وسلمفجملة { وإنك لتهدي } عطف على جملة { نهدي به من نشاء من عبادنا } . وفي الكلام تعريض بالمشركين إذ لم يهتدوا به وإذ كبر عليهم ما يدعوهم إليه مع أنه يهديهم إلى صراط مستقيم .والهداية في قوله : { وإنك لتهدي } هداية عامة . وهي : إرشاد النّاس إلى طريق الخير فهي تخالف الهداية في قوله : { نهدي به من نشاء } . وحذف مفعول { لتهدي } للعموم ، أي لتهدي جميع النّاس ، أي ترشدهم إلى صراط مستقيم ، وهذا كقوله : { وهديناه النجدين فلا اقتحم العقبة } \\[ البلد : 10 ، 11 \\] .وتأكيد الخبر ب ( إنَّ ) للاهتمام به لأن الخبر مستعمل في تثبيت قلب النبي صلى الله عليه وسلم بالشهادة له بهذا المقام العظيم فالخبر مستعمل في لازم معناه ، على أنه مستعمل أيضاً للتعريض بالمنكرين لِهَدْيِهِ فيكون في التأكيد ملاحظة تحقيقه وإبطال إنكارهم . فكما أن الخبر مستعمل في لازمين من لوازم معناه فكذلك التأكيدُ ب ( إنَّ ) مستعمل في غرضين من أغراضه ، وكلا الأمرين مما ألحق باستعمال المشترك في معنييه .وتنكير { صراط } للتعظيم مثل تنكير ( عظمٍ ) في قول أبي خراش: ... فلا وأبي الطير المُرِبَّة في الضحىعلى خالد لقد وقعن على عَظْم ... ولأن التنكير أنسب بمقام التعريض بالذين لم يأبهوا بهدايته .وعُدل عن إضافة { صراط } إلى اسم الجلالة ابتداء لقصد الإجمال الذي يعقبه التفصيل بأن يُبْدل منه بعد ذلك { صراط الله } ليتمكن بهذا الأسلوب المعنى المقصود فَضْلَ تمكُّن على نحو قوله : { اهدنا الصراط المستقيم صراطَ الذين أنعمت عليهم } \\[ الفاتحة : 6 ، 7 \\] .وإجراء وصف اسم الجلالة باسم الموصول وصلته للإيماء إلى أن سبب استقامة الصراط الذي يهدي إليه النبي بأنه صراط الذي يملك ما في السماوات وما في الأرض فلا يعْزب عنه شيء مما يليق بعباده ، فلما أرسَل إليهم رسولاً بكتاب لا يُرتاب في أن ما أرسل لهم فيه صلاحُهم .{ الارض أَلاَ إِلَى الله تَصِيرُ } .تذييل وتنهية للسورة بختام ما احتوت عليه من المجادلة والاحتجاج بكلام قاطع جامع منذر بوعيد للمعرضين فاجع ومبشر بالوعد لكل خاشع . وافتتحت الجملة بحرف التنبيه لاسترعاء أسماع النّاس . وتقديم المجرور لإفادة الاختصاص ، أي إلى الله لا إلى غيره .و { المصير } : الرّجوع والانتهاء ، واستعير هنا لظهور الحقائق كما هي يومَ القيامة فيَذهَب تلبيس الملبسين ، ويَهِن جبروت المتجبرين ، ويقرّ بالحق من كان فيه من المعاندين ، وهذا كقوله تعالى : { وإلى الله عاقبة الأمور } \\[ لقمان : 22 \\] وقوله : { وإليه يرجع الأمر كله } \\[ هود : 123 \\] . والأمور : الشؤون والأحوال والحقائق وكل موجود من الذوات والمعاني .وقد أخذَ هذا المعنى الكميت في قوله: ... فالآن صِرتُ إلى أمية والأمورُ إلى مَصائروفي تنهية السورة بهذه الآية محسن حُسن الختام .\n\n",
      "translations": [
        {
          "translation": "(The path of Allah) the religion of Allah, (unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings. (Do not all things reach Allah at last?) the consequence of things in the Hereafter reach to the Wise Sovereign'. And of the surah in which Ornaments of Gold are mentioned, which is all Meccan and consists of 87 verses, 564 833 words and 3,400 letters: Surah 43: Ornaments of Gold (al-Zukhruf) And of the surah in which Ornaments of Gold are mentioned, which is all Meccan and consists of 87 verses, 833 words and 3,400 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { صِرَاط الله } المخصوص به\n أي: طريق التوحيدي الذاتي الشامل للتوحيد الصفاتي والأفعالي المسمى توحيد الملك\n أعني سير الذات الأحدية مع جميع الصفات الظاهرة\n والباطنة بمالكية سموات الأرواح وأرض الجسم المطلق { ألا إلى الله تَصِير الأمور } بالفناء فيه\n فينادي بذاته:\n[غافر\n الآية:16] ويجيب هو نفسه بقوله:\n[غافر\n الآية:16]\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلاَ } أي: تنبهوا أيها الأظلال المستمدون من الله في كل الأحوال { إِلَى ٱللَّهِ } أي: إلى وجهه الكريم لا إلى غيره من وجوه الأسباب والوسائل العادية { تَصِيرُ ٱلأُمُورُ } [الشورى: 53] أي: إليه ترجع وجوه الصور المرتبة بعد ارتفاع الوجوه الهالكة عن البين واضمحلال الرسوم الباطلة عن العين\n\n\nخاتمة السورة\n\nعليك أيها الطالب للتحقق في صراط الحق\n والراكن نحوه بحزائمك الأقصى وعزائمك الأوفى أن تجعل قبلة مقصدك توحيد ربك\n وتستقيم على جادته التي هي الدين القويم المحمدي\n والسبيل السوي المصطفوي\n الذي\n[فصلت: 42] وتقتفي أثر من سلف من خُلَّص أتباعه الذين اهتدوا بمتابعته إلى مقر التوحيد واليقين بك\n ووصلوا إلى عالم اللاهوت والتمكين بعدما انخلعوا عن جلباب ناسوتهم بالمرة\n بتوفيق من الله وجذب من جانبه\n وإرشاد حبيبه صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { صراطِ الله } بدل من الأول\n وإضافته إلى الاسم الجليل\n ثم وصفه بقوله تعالى: { الذي له ما في السماوات وما في الأرض } لتفخيم شأنه\n وتقرير استقامته\n وتأكيد وجوب سلوكه فإن كون جميع ما فيهما من الموجودات له تعالى\n خلقاً\n وملكاً\n وتصرفاً\n مما يُوجب ذلك أتم الإيجاب\n { ألا إِلى الله تصير الأمورُ } أي: الأمور قاطبة راجعة إليه\n لا إلى غيره\n فيتصرّف فيها على وِفق حكمته ومشيئته\n الإشارة: قد تحصل للأولياء المكالمة مع الحق تعالى بواسطة تجلياته\n فيسمعون خطابه تعالى من البشر والحجر\n أو بلا واسطة\n بحيث يسمعون الكلام من الفضاء\n وإليه أشار الشيخ أبو الحسن رضي الله عنه بقوله: \" وهب لنا مشاهدةً تصحبها مكالمة \" \n ولا تكون هذه الحالة إلا للأكابر من أهل الفناء والبقاء\n وأما مكالمة الحق من النور الأقدس\n بلا واسطة\n فهو خاص نبينا صلى الله عليه وسلم ليلة الإسراء\n قال شيخ شيوخنا\n سيدي عبد الرحمن الفاسي رضي الله عنه: والذي عندي أن التكلم على المكافحة والمشابهة إنما يكون بالانخلاع عن البشرية\n ومحوها\n والبقاء بصفات الربوبية\n وذلك إشارة إلى أنه عليه السلام إنما شُوفَه وكلّم بعد العروج عن أرض الطبيعة إلى سماء الحقيقة\n وكان بالأرض يُكلم بالواسطة\n وموسى كُلّم بغير واسطة\n ولكن بغير مشافهة\n ولذلك كان كلامه بالأرض\n ولم يعط الرؤية لأنها لا تكون في الأرض\n أي في أرض البشرية\n بل لا بد من الغيبة عنها\n وذهب الورتجبي إلى أن الحصْر فيما ذكر في الآية إنما هو لمَن كان في حجاب البشرية\n فأما مَن خرج عنها إلى الغيب\n وألبس نور القرب وكحّل عينه بنوره تعالى\n ومدّ سمعه بقوة الربوبية\n فإنه يُخاطب كفاحاً وعياناً\n ونقل مثل ذلك عن الواسطي\n فراجع بسطه فيه\n والفرق بينه وبين ما ذكرنا: أن خطاب المكافحة عنده خارجة من الثلاثة المذكورة في الآية\n وعندنا داخلة في قوله: { إِلا وحياً } لأنه أعم من المشافهة\n والله أعلم\n وقوله تعالى: { وإِنك لَتَهدي إِلى صراط مستقيم } أي: طريق الوصول والترقي أبداً\n فيؤخذ منه: أن وساطته صلى الله عليه وسلم لا تنقطع عن المريد أبداً لأن الترقي يكون باستعمال أدب العبودية\n وهي مأخوذة عنه صلى الله عليه وسلم\n وكما أن الترقي لا ينقطع فالأدب الذي هو سلوك طريقته صلى الله عليه وسلم لا ينقطع\n والله تعالى أعلم\n وصلّى الله على سيدنا محمد وآله وسلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:42",
      "similarity": 0.5727729817607934
    },
    {
      "verse": "50:43",
      "similarity": 0.48435850194245517
    },
    {
      "verse": "24:64",
      "similarity": 0.44861852160777116
    },
    {
      "verse": "10:55",
      "similarity": 0.4477021107025981
    },
    {
      "verse": "67:6",
      "similarity": 0.4228029479368076
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}