{
  "chapter": "الشورى",
  "text": "او يزوجهم ذكرانا وانثا ويجعل من يشاء عقيما انه عليم قدير",
  "translations": [
    {
      "translation": "On some He bestows both sons and daughters, and some He leaves issueless. He is all-knowing and all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or grants them a mix of males and females, and causes whomever He pleases to be barren. He is All- Knowing, All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "offspring to whomever He wants. He causes whomever He wants to be childless. He is All-Knowing and All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or may mix them, the sons and daughters; and may make barren whomever He wills; indeed He is All Knowing, Able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He bestows both males and females, and He renders barren whom He wills. Verily, He is the All-Knower and is Able (to do all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He makes them of both sorts, male and female; and He makes whom He pleases barren; surely He is the Knowing, the Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or He couples them, both males and females; and He makes whom He will barren. Surely He is All-knowing, All-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He mingleth them, males and females, and He maketh barren whom He will. Lo! He is Knower, Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or both male and female, and He leaves whoever He will barren; He is all-knowing and all powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He conjoineth them males and females; and He maketh barren whomsoever He will; verily He is Knower, Petent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or He combines them males and females, and makes sterile whomever He wishes. Indeed, He is all-knowing, all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He bestows both males and females, and He leaves barren whom He will: for He is full of Knowledge and Power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He bestows both males and females, and He renders barren whom He wills. Verily, He is the All-Knower and is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, He couples them, both males and females, and to others, if He will, He makes them barren. Surely, He is the Knower, the Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He combines them together, males and females; and He renders whomever He wills sterile. He is Knowledgeable and Capable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He makes them [both] males and females, and He renders whom He wills barren. Indeed, He is Knowing and Competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:50] Or He combines them, that is to say, [or] He makes them, males and females; and He makes whomever He will infertile, such that she is unable to conceive or he cannot have a child. Surely He is Knower, of what He creates, Powerful, in [bringing about] whatever He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or He mingleth them, males and females) as was the case with the Prophet Muhammad (pbuh) (and He maketh barren whom He will) as was the case with the Prophet John the son of Zachariah. (Lo! He is Knower, Powerful) regarding that which He gives of males or females.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ يُزَوِّجُهُمْ ذُكْرَاناً وَإِنَاثاً } [أي] غلامٌ وجَاريةٌ\n { وَيَجْعَلُ مَن يَشَآءُ عَقِيماً } معناه لا يُولدَ لَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ يُزَوِّجُهُمْ } ويخلط لهم { ذُكْرَاناً وَإِنَاثاً } مجتمعين ممتزجين { وَيَجْعَلُ مَن يَشَآءُ } منهم { عَقِيماً } بلا إيلاد واستيلاد، ذكراً كان أو أنثى إظهاراً لكمال قدرته، وإشعاراً بأنه لا تأثير للوسائل والأسباب العادية، حتى ينسب تناسلهم وتوالدهم إلى اجتماع الأزواج والزوجات منهم، كما هو المتبادر إلى الأحلام السخيفة، وبالجملة: { إِنَّهُ } سبحانه { عَلِيمٌ } باستعدادات عباده وقابلياتهم { قَدِيرٌ } [الشورى: 50] على إفاضة ما ينبغي لمن ينبغي كما ينبغي، بمقتضى كرمه وجوده إرادة واختياراً، بلا إيجاب والتزام من جانبه سبحانه\n\n\n\n\nثم لما شنَّع اليهود على رسول الله صلى الله عليه وسلم وعيروه وطعنوا في نبوته، مستهزئين معه؛ حيث قالوا له تهكماً: ألاَ تكلم الله وتنظر إليه لو كنت نبيّاً كما كلمه موسى ونظر إليه\n\n\n\n\nفقال صلى الله عليه وسلم:\n\n \" لم ينظر موسى إلله تعالى \" \n\nإذ هو سبحانه أجل وأعلى من أن تنظر إليه العيون، وتدركه الأبصار ومحيط به الآراء والأفكار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}