{
  "chapter": "الشورى",
  "text": "وما كان لبشر ان يكلمه الله الا وحيا او من ورائ حجاب او يرسل رسولا فيوحى باذنه ما يشاء انه على حكيم",
  "translations": [
    {
      "translation": "It does not befit Allah to address any human being except by inspiration, or from behind a veil, or He sends a messenger who then reveals by His permission whatever He wills. He is indeed Most High, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not given to man that God should speak to him except by suggestion or indirectly, or send a messenger to convey by His command whatsoever He please. He is all-high and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not given to any human being that Allah should speak to him except through revelation, or from behind a veil, or that a messenger (an angel) be sent to him who reveals to him by Allah's leave whatever He wishes. He is All-High, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To no mortal does God speak but through revelation, from behind a curtain, or by sending a Messenger who reveals, by His permission whatever He pleases. He is the Most High and the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for any human that Allah may speak to him except as a divine revelation or while the human is on this side of the veil of greatness, or that He sends an angel to reveal by His permission, whatever He wills; indeed He is Supreme, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not given to any human being that Allah should speak to him unless (it be) by revelation, or from behind a veil, or (that) He sends a Messenger to reveal what He wills by His leave. Verily, He is Most High, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for any mortal that Allah should speak to him except by revelation or from behind a veil, or by sending a messenger and revealing by His permission what He pleases; surely He is High, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It belongs not to any mortal that God should speak to him, except by revelation, or from behind a veil, or that He should send a messenger and he reveal whatsoever He will, by His leave; surely He is All-high, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was not (vouchsafed) to any mortal that Allah should speak to him unless (it be) by revelation or from behind a veil, or (that) He sendeth a messenger to reveal what He will by His leave. Lo! He is Exalted, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not granted to any human being that God should speak to him other than by revelation or from behind a veil, or by sending him a messenger, so that the messenger may reveal, by His command, whatsoever He will. Truly, He is exalted and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not Possible for a human being that Allah should speak Unto him otherwise than by revelation or from behind a veil, or that He sendeth a messenger, so that he revealeth by His command whatsoever He will; verily He is Exalted, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not [possible] for any human that Allah should speak to him except through revelation or from behind a veil, or send a messenger who reveals by His permission whatever He wishes. Indeed He is all-exalted, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not fitting for a man that Allah should speak to him except by inspiration, or from behind a veil, or by the sending of a messenger to reveal, with Allah's permission, what Allah wills: for He is Most High, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not given to any human being that Allah should speak to him unless (it be) by Inspiration, or from behind a veil, or (that) He sends a Messenger to reveal what He wills by His Leave. Verily, He is Most High, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not belong to any human that Allah should speak to him except by Revelation, or from behind a veil, or that He sent a Messenger to revealwhatsoever He will by His Permission. He is the High, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any human that God should speak to him, except by inspiration, or from behind a veil, or by sending a messenger to reveal by His permission whatever He wills. He is All-High, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for any human being that Allah should speak to him except by revelation or from behind a partition or that He sends a messenger to reveal, by His permission, what He wills. Indeed, He is Most High and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:51] And it is not [possible] for any human that God should speak to him except, that He should reveal to him, by revelation, in sleep or by inspiration, or, except, from behind a veil, where He makes the person able to hear His speech but without seeing Him — as was the case with Moses, peace be upon him; or, except, that He should send a messenger, an angel, such as Gabriel, and he, the messenger, then reveals, to the person to whom he has been sent, that is to say, [and then] he speaks to him, with His permission, that is, God’s, whatever He, God, will. Truly He is Exalted, above the attributes of created beings, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it was not (vouchsafed)) it was not permissible (to any mortal that Allah should speak to him) directly without a veil (unless (it be) by revelation) in dream (or from behind a veil) as when He spoke with Moses (pbuh) (or (that) He sendeth a messenger) i.e. Gabriel, such as when He sent him to the Prophet Muhammad (pbuh) (to reveal what He will) of commands and prohibitions (by His leave) by His command. (Lo! He is Exalted) more exalted than all created beings, (Wise) in His command and decree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ ٱللَّهُ إِلاَّ وَحْياً أَوْ مِن وَرَآءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولاً فَيُوحِيَ بِإِذْنِهِ مَا يَشَآءُ } فالوحي ما يَراهُ النبي عليهِ السّلامُ في المَنامِ، كما رأى إبراهيمُ عليه السّلامُ حينَ أُمر بذبحِ ابنهِ إِسحاق أو من وراءِ حجابٍ: كما كلَّمَ موسى عَليه السّلامُ فَقِيلَ لَهُ استمع لِما يُوحى\n أو يَرسلُ رسولاً: كما أرسلَ جبريلَ وغيرَهُ إلى النبي عليه السّلامُ، وغيرِهِ من الأَنبياءِ عليهم السّلامُ\n والوحي: الإِشارةُ كما حَكى تعالى عن زكريا عليه السّلامُ\n\n[مريم: 11]\n والوحي: القَذفُ في القَلبِ، والإِلهامُ كقولهِ تعالى:\n\n[النحل: 68]\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كانَ لبشر أن يكلمه الله إلاَّ وحياً } أي: إلا بثلاثة أوجه، إما بوصوله إلى مقام الوحدة والفناء فيه ثم التحقق بوجوده في مقام البقاء فيوحي إليه بلا واسطة كما قال الله تعالى:\n\n[النجم، الآيات:8 - 10]\n { أو من وراء حجاب } بكونه في حجاب القلب ومقام تجليات الصفات فيكلمه على سبيل المناجاة والمكالمة والمكاشفة والمحادثة دون الرؤية لاحتجابه بحجاب الصفات كما كان حال موسى عليه السلام { أو يرسل رَسُولاً } من الملائكة فيوحي إليه على سبيل الإلقاء والنفث في الروع والإلهام أو الهتاف أو المنام كما قال عليه السلام: \" إنّ روح القدس نفث في روعي أن نفساً لن تموت حتى تستكمل رزقها \" ، { إنَّه علي } من أن يواجه ويخاطب، بل يفنى ويتلاشى من يواجهه لعلوه من أن يبقى معه غيره ويحتمل شيء حضوره { حَكِيم } يدبّر بالحكمة وجوه التكليم ليظهر علمه في تفاصيل المظاهر ويكمل به عباده ويهتدوا إليه ويعرفوه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأنزل سبحانه هذه الآية تصديقاً لحبيبه صلى الله عليه وسلم، فقال: { وَمَا كَانَ } أي: ما صح وجاز { لِبَشَرٍ } أي: لجنسه، ليس في وسعه واستعداده { أَن يُكَلِّمَهُ ٱللَّهُ } مشافهة بلا سترة وحجاب؛ إذ لا مناسبة بين المحدوج والمحبوس في مضيق الجهات، وبين غير المحدود والمستغني عن الحدود والجهات حتى تقع المكالمة بينهما { إِلاَّ وَحْياً } أي: تكلماً ناشئاً عن وحى إلهامي أو منامي { أَوْ } تكلماً مسموعاً { مِن وَرَآءِ حِجَابٍ } أي: وراء تعين من التعينات، كما سمع موسى كلامه سبحاه من وراء حجاب الشجرة، فكذلك يسمع العارف المتحقق بمقام الفناء في الله كلامه سبحانه، من وراء تعينات عموم المظاهر الناطقة بتسبيحه سبحانه حالاً ومقالاً { أَوْ } تكلماً بالسفارة والترجمان بأن { يُرْسِلَ رَسُولاً } من سدنة ذاته التي هي الملائكة الحاملون لكمالات أسمائه وصفاته { فَيُوحِيَ } الملك { بِإِذْنِهِ } سبحانه { مَا يَشَآءُ } ويسمعه من كلامه سبحانه لمن يشاء من عباده\n\n\n\n\nوبالجملة: { إِنَّهُ } سبحانه { عَلِيٌّ } في شأنه المختص به، وكمالاته اللائقة له، متعالٍ عن أن يحوم حول سرادقات عز سلطانه أحد من خلقه، فيكف أن يتكلموا معه بلا سترة وحجاب { حَكِيمٌ } [الشورى: 51] في كمال تمنعه وكبريائه ونهاية تعززه وترفعه؛ بحيث تكلم تارة بالوحي والإلهام، وتارة من وراء الحجب والأستار، وتارة بطريق السفارة الرسالة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما كان لبشرٍ } أي: ما صحّ لأحد من البشر { أن يُكلمه اللهُ } بوجه من الوجوه { إِلا وَحْياً } إلهاماً، كقوله عليه الصلاة السلام:\n\n \" ألقي في رُوعي \" \n\nأو: رؤيا في المنام لقوله صلى الله عليه وسلم:\n\n \" رؤيا الأنبياء وحي \" \n\nكأمر إبراهيم عليه السلام بذبح الولد، وكما أوحي إلى أم موسى، رُوي عن مجاهد: \" أَوحى اللهُ الزبورَ إلى داود عليه السلام في صدره \"\n { أو من وراءِ حجابٍ } بأن يسمع كلاماً من الله، من غير رؤية السامع مَن يكلمه، كما سمع موسى عليه السلام من الشجرة، ومن الفضاء في جبل الطور، وليس المراد به حجاب الله تعالى على عبده حساً إذ لا حجاب بينه وبين خلقه حساً، وإنما المراد: المنع من رؤية الذات بلا واسطة\n { أو يُرسلَ رسولاً } أو: بأن يرسل مَلَكاً { فيُوحيَ } الملَكُ { بإِذنه } بإذن الله تعالى وتيسيره { ما يشاءُ } من الوحي\n وهذا هو الذي يجري بينه تعالى وبين أنبيائه في عامة الأوقات\n روي: أن اليهود قالت للنبي صلى الله عليه وسلم: ألا تكلم الله، وتنظر إليه إن كنت نبياً، كما كلمة موسى، ونظر إليه؟ فقال صلى الله عليه وسلم:\n\n \" لم ينظر موسى إلى الله تعالى \" \n\nفنزلت\n والذي عليه جمهور المحققين أن نبينا عليه الصلاة والسلام رأى ربه ليلة المعراج، وكلّمه مشافهة، وعليه حمل البيضاوي قوله تعالى: { إِلا وحياً } لأن الوحي هو: الكلام الخفي، المدرك بسرعة، أعم من أن يكون مشافهة أو غيرها\n قال الطيبي: وإذا حمل الوحي على ما قاله البيضاوي، وأنه المشافهة، المعنى بقوله:\n\n[النجم: 10] اتجه ترتيب الآية، وأنه ذكر أولاً الكلام بلا واسطة، بل مشافهة، وهو حال نبينا صلى الله عليه وسلم، ثم ذكر ما كان بغير واسطة، ولكن لا بمشافهة، بل من وراء الغيب، ثم ذكر الكلام بواسطة الإرسال\n هـ\n بالمعنى\n { إِنه عَلِيٌّ } متعال عن صفات المخلوقين، لا يتأتى جريان المفاوضة بينه تعالى وبينهم إلا بأحد الوجوه المذكورة، ولا تكون المكافحة إلا بالغيبة عن حس البشرية، { حيكمٌ } يُجري أفعاله على سنن الحكمة، فيكلم تارة بواسطة، وأخرى بدونها، مكافحة، أو غيرها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:32",
      "similarity": 0.7327395184498734
    },
    {
      "verse": "19:17",
      "similarity": 0.6372742936904648
    },
    {
      "verse": "83:15",
      "similarity": 0.6197104274804934
    },
    {
      "verse": "41:5",
      "similarity": 0.46492776357378973
    },
    {
      "verse": "7:46",
      "similarity": 0.4148953289652493
    }
  ]
}