{
  "chapter": "الشورى",
  "text": "تكاد السموت يتفطرن من فوقهن والملئكة يسبحون بحمد ربهم ويستغفرون لمن فى الارض الا ان الله هو الغفور الرحيم",
  "translations": [
    {
      "translation": "The heavens are all but rent asunder from above when the angels glorify their Lord with praise and ask forgiveness for those who are on the earth. Allah is the Ever-Forgiving, the Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The skies are near to bursting asunder above them (for awe of Him), and the angels sing the praises of their Lord, imploring forgiveness for the dwellers of the earth. Is it not that God is forgiving and merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens may well nigh rend asunder from above while the angels proclaim the praise of their Lord and ask forgiveness for those on earth. Lo, it is Allah, and He alone, Who is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(When the revelation passes through) the heavens, they almost break apart. At that time the angels glorify their Lord with His praise and seek forgiveness for those who live on earth. God is certainly All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens nearly split apart from above – and the angels say the Purity of their Lord while praising Him, and seek forgiveness for those on earth; pay heed! Indeed Allah only is the Oft Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nearly the heavens might be rent asunder from above them, and the angels glorify the praises of their Lord, and ask for forgiveness for those on the earth. Lo, Verily, Allah is the Oft-Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens may almost rend asunder from above them and the angels sing the praise of their Lord and ask forgiveness for those on earth; now surely Allah is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens wellnigh are rent above them, when the angels proclaim the praise of their Lord, and ask forgiveness for those on earth. Surely God -- He is the All-forgiving, the All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Almost might the heavens above be rent asunder while the angels hymn the praise of their Lord and ask forgiveness for those on the earth. Lo! Allah, He is the Forgiver, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens are almost split asunder from above as the angels sing their Lord's praise and seek forgiveness for those on earth. God is indeed the Most Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well-nigh the heavens might be rent in sunder from above them. And the angels hallow the praise of their lord and ask forgiveness for these on the earth. Lo! Verily Allah! He is the Forgiver, the Merciful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens are about to be rent apart from above them, while the angels celebrate the praise of their Lord and plead for forgiveness for those [faithful] who are on the earth. Indeed, Allah is the All-forgiving, the All-merciful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens are almost rent asunder from above them (by Him Glory): and the angels celebrate the Praises of their Lord, and pray for forgiveness for (all) beings on earth: Behold! Verily Allah is He, the Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nearly the heavens might rent asunder from above them (by His Majesty), and the angels glorify the praises of their Lord, and ask for forgiveness for those on the earth, verily, Allah is the Oft-Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens nearly break apart above them as the angels exalt with the praise of their Lord and ask forgiveness for those on earth. Indeed Allah is the Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens above them almost burst apart, while the angels glorify the praises of their Lord, and ask forgiveness for those on earth. God is indeed the Forgiver, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The heavens almost break from above them, and the angels exalt [Allah] with praise of their Lord and ask forgiveness for those on earth. Unquestionably, it is Allah who is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:5] The heavens are well-nigh (read yakādu, or takādu) rent asunder (yanfatirna: a variant reading has yatafattarna) from above one another, in other words, [well-nigh] is each one torn away from above the one below it because of the magnitude of God, exalted be He, and the angels glorify with praise of their Lord, in other words, they are continuously engaged in praise [of Him], and ask forgiveness for those, believers, on earth. Verily God is the Forgiving, to His friends, the Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Almost might the heavens above be rent asunder) from the awe of the Beneficent; and it is also said from the claim of the Jews, (while the angels) in heaven (hymn the praise of their Lord) pray by the command of their Lord (and ask forgiveness for those on the earth) for the sincere believers. (Lo! Allah is the Forgiver) He forgives he who repents, (the Merciful) towards he who dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَتَفَطَّرْنَ } معناه يَتشقّقنَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, { they will burst forth } means they will rupture.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال عزته وعظمته { تَكَادُ ٱلسَّمَٰوَٰتُ } السبع { يَتَفَطَّرْنَ } بالياء والتاء\n أو بالياء والنون معناه على كلتا القراءتين: يتشققن { مِن فَوْقِهِنَّ } أي: من فوق السماوات أو من فوق الأرضين السبع من كمال خشية الله ورهبته\n خوفاً من تجليه عليهم باسمه القهار المفني للأغيار مطلقاً { وَٱلْمَلاَئِكَةُ } أيضاً من خشيتهم من كمال غضبه وقهره سبحانه { يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ } تعديداً لنعمه إياهم بإفاضة الشعور والإدراك على حقوق ربوبيته ومقتضيات ألوهيته\n والتمكن والاقتدار على مواظبة عبوديته ومشاهدة آثار سلطنته وعظمته { وَيَسْتَغْفِرُونَ } أيضاً بإذنه وبمقتضى أمره { لِمَن فِي ٱلأَرْضِ } من خُلَّص عباده الموحدين المجبولين على صورته\n المجعلوين لخلافته ونيابته { أَلاَ } أي: تنبهوا أيها الأظلال المنهمكون في بحر الحيرة والضلال { إِنَّ ٱللَّهَ } الذي أظهركم من كتم العدم\n ورباكم بأنواع اللطف والكرم { هُوَ ٱلْغَفُورُ } الستار لذنوب أنانياتكم\n المحَّاء لآثام هوياتكم إن تبتم وأخلصتم فيها { ٱلرَّحِيمُ } [الشورى: 5] لكم يقبل توبتكم يغفر زلتكم\n ويوصلكم إلى ما جبلتم لأجله\n\n\nثم قال سبحانه تهديداً على المشركين المتخذين لله المتوحد في ذاته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ومعنى: { من فوقهن } أي: يبتدين بالانفطار من جهتهنّ الفوقانية\n وتخصيصها على التفسير الأول لأن أعظم الآيات وأدلها على العظمة والجلال من تلك الجهة\n وأيضاً: استقرار الملائكة إنما هو من فوق\n فكادت تنشق من كثرة الثِقل\n كما في الحديث:\n \" أطَّت السماء\n وحُقّ لها أن تَئطَّ\n ما فيها موضع قدم إلا وفيها ملك راكع أو ساجد \"\n \nوعلى الثاني للدلالة على التفطُّر من تحتهن بالطريق الأولى لأن تلك الكلمة الشنعاء\n الواقعة في الأرض حين أثرت في جهة الفوق فلأن تؤثر في جهة التحت أولى\n وقيل: \" من فوقهن \": من فوق الأرض\n فالكناية راجعة إلى الأرض\n من قوله: { له ما في السماوات وما في الأرض } لأنه بمعنى الأرضين\n\n{ والملائكةُ يُسبِّحون بحمدِ ربهم } خضوعاً لِمَا يرون من عظمته\n { ويستغفرون لمَن في الأرض } أي: للمؤمنين منهم\n خوفاً عليهم من سطواته\n ويُوحدون اللهَ وينزهونه عما لا يليق به من الصفات\n حامدين له على ما أولاهم من ألطافه\n متعجبين لما رأوا من تعرُّض الكفرة لسخط الله تعالى\n ويستغفرون لمؤمني أهل الأرض\n الذين تبرؤوا من تلك الكلمات\n { ألا إِنَّ اللهَ هو الغفورُ الرحيمُ } حيث لا يعاجلهم بالعقوبة على ما وصفوه به مما لا يجوز عليه\n الإشارة: حم عسق\n الحاء تُشير إلى حمده لأوليائه\n وتنويهه بقدرهم\n والميم إلى تمليكهم التصرُّف في حس المُلك\n وأسرار الملكوت\n والعين إلى علو رتبتهم\n أو إلى علومهم اللدنية\n والسين إلى سيادتهم وسَنَا نورهم وسرهم\n والقاف إلى قُربهم وتقريبهم حتى يمتحق وجودهم في وجود محبوبهم\n فيمتحي القرب من شدة القرب\n وبذلك صاروا مقربين\n والوحي ينقسم إلى أربعة أقسام وحي أحكام\n ووحي منام\n ووحي إلهام\n ووحي إعلام\n فاختصت الأنبياء بالأول\n وشاركتهم الأولياء في الثلاثة\n ووحي إعلام هو إطّلاعهم على بعض المغيبات\n وقوله تعالى: { يكاد السماوات يَتَفَطَّرن } أي: يتشققن من هيبته تعالى وكبريائه\n وذلك لما لطُف حسها أدركت هيبة معاني أسرار الذات\n وكذلك الأرواح إذا لطفت ورقّ حسن بشريتها أدركت عظمة الحق وجلاله وجماله\n وإذا كثفت بشريتها\n بمباشرة الحس واتباع الهوى\n غلظ حجابها\n فبعدت عن حضرة الحق في حال قربها\n وقوله تعالى: { ويستغفرون لمَن في الأرض } \n انظر جلالة قدر هذا الآدمي\n حتى سخَّر الله له الملائكة الكرام يستغفرون له\n ويسعون في مصالحه\n فاستحِي من الله أيها العبد\n إن كان لك عقل وتمييز\n ثم ردّ على أهل الشرك\n فقال: { وَٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِهِ أَوْلِيَآءَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:1",
      "similarity": 0.4351978926325644
    },
    {
      "verse": "21:56",
      "similarity": 0.4326912378641609
    },
    {
      "verse": "73:18",
      "similarity": 0.4127992632764349
    },
    {
      "verse": "43:27",
      "similarity": 0.39909580232268416
    },
    {
      "verse": "36:22",
      "similarity": 0.3963907680433631
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/42:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/42:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}