{
  "chapter": "الشورى",
  "text": "صرط الله الذى له ما فى السموت وما فى الارض الا الى الله تصير الامور",
  "translations": [
    {
      "translation": "the Path of Allah to Whom everything in the heavens and everything on the earth belongs. Indeed all",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of God to whom belongs the kingdom of the heavens and the earth. And will not all things go back to God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Way of Allah, to Whom belongs the dominion of all that is in the heavens and the earth. Lo, it is to Allah that all things ultimately revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of God who is the owner of all that is in the heavens and the earth. To God certainly do all matters return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah – the One to Whom only belongs all whatever is in the heavens and all whatever is in the earth; pay heed! Towards Allah only do all matters return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah to Whom belongs all that is in the heavens and all that is on the earth. Verily, all matters at the end go to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth; now surely to Allah do all affairs eventually come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of God, to whom belongs whatsoever is in the heavens, and whatsoever is in the earth. Surely unto God all things come home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth. Do not all things reach Allah at last?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of God, to whom belongs all that is in the heavens and on the earth. Indeed all matters return eventually to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth. Lo! Unto Allah trend all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of Allah, to whom belongs whatever is in the heavens and whatever is in the earth. Indeed all matters return to Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Way of Allah, to Whom belongs whatever is in the heavens and whatever is on earth. Behold (how) all affairs tend towards Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Path of Allah, to Whom belongs all that is in the heavens and all that is in the earth. Verily, all the matters at the end go to Allah (for decision).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Path of Allah, to whom belongs all that is in the heavens and all that is in the earth. Surely, to Allah all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of God, to whom belongs everything in the heavens and everything on earth. Indeed, to God all matters revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Unquestionably, to Allah do [all] matters evolve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:53] the path of God, to Whom belongs whatever is in the heavens and whatever is in the earth, as possessions, creatures and servants. Surely with God all matters end [their journey], [all matters] return. Meccan [entirely], or as some say [Meccan] with the exception of verse 45, which is Medinese; it consists of 89 verses, revealed after [sūrat] al-Shūrā.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The path of Allah) the religion of Allah, (unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings. (Do not all things reach Allah at last?) the consequence of things in the Hereafter reach to the Wise Sovereign'. And of the surah in which Ornaments of Gold are mentioned, which is all Meccan and consists of 87 verses, 564 833 words and 3,400 letters: Surah 43: Ornaments of Gold (al-Zukhruf) And of the surah in which Ornaments of Gold are mentioned, which is all Meccan and consists of 87 verses, 833 words and 3,400 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { صِرَاط الله } المخصوص به، أي: طريق التوحيدي الذاتي الشامل للتوحيد الصفاتي والأفعالي المسمى توحيد الملك، أعني سير الذات الأحدية مع جميع الصفات الظاهرة، والباطنة بمالكية سموات الأرواح وأرض الجسم المطلق { ألا إلى الله تَصِير الأمور } بالفناء فيه، فينادي بذاته:\n\n[غافر، الآية:16] ويجيب هو نفسه بقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلاَ } أي: تنبهوا أيها الأظلال المستمدون من الله في كل الأحوال { إِلَى ٱللَّهِ } أي: إلى وجهه الكريم لا إلى غيره من وجوه الأسباب والوسائل العادية { تَصِيرُ ٱلأُمُورُ } [الشورى: 53] أي: إليه ترجع وجوه الصور المرتبة بعد ارتفاع الوجوه الهالكة عن البين واضمحلال الرسوم الباطلة عن العين\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الطالب للتحقق في صراط الحق، والراكن نحوه بحزائمك الأقصى وعزائمك الأوفى أن تجعل قبلة مقصدك توحيد ربك، وتستقيم على جادته التي هي الدين القويم المحمدي، والسبيل السوي المصطفوي، الذي\n\n[فصلت: 42] وتقتفي أثر من سلف من خُلَّص أتباعه الذين اهتدوا بمتابعته إلى مقر التوحيد واليقين بك، ووصلوا إلى عالم اللاهوت والتمكين بعدما انخلعوا عن جلباب ناسوتهم بالمرة، بتوفيق من الله وجذب من جانبه، وإرشاد حبيبه صلى الله عليه وسلم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألا إِلى الله تصير الأمورُ } أي: الأمور قاطبة راجعة إليه، لا إلى غيره، فيتصرّف فيها على وِفق حكمته ومشيئته\n الإشارة: قد تحصل للأولياء المكالمة مع الحق تعالى بواسطة تجلياته، فيسمعون خطابه تعالى من البشر والحجر، أو بلا واسطة، بحيث يسمعون الكلام من الفضاء، وإليه أشار الشيخ أبو الحسن رضي الله عنه بقوله: \" وهب لنا مشاهدةً تصحبها مكالمة \" ، ولا تكون هذه الحالة إلا للأكابر من أهل الفناء والبقاء\n وأما مكالمة الحق من النور الأقدس، بلا واسطة، فهو خاص نبينا صلى الله عليه وسلم ليلة الإسراء\n قال شيخ شيوخنا، سيدي عبد الرحمن الفاسي رضي الله عنه: والذي عندي أن التكلم على المكافحة والمشابهة إنما يكون بالانخلاع عن البشرية، ومحوها، والبقاء بصفات الربوبية، وذلك إشارة إلى أنه عليه السلام إنما شُوفَه وكلّم بعد العروج عن أرض الطبيعة إلى سماء الحقيقة\n وكان بالأرض يُكلم بالواسطة، وموسى كُلّم بغير واسطة، ولكن بغير مشافهة، ولذلك كان كلامه بالأرض، ولم يعط الرؤية لأنها لا تكون في الأرض، أي في أرض البشرية، بل لا بد من الغيبة عنها\n وذهب الورتجبي إلى أن الحصْر فيما ذكر في الآية إنما هو لمَن كان في حجاب البشرية، فأما مَن خرج عنها إلى الغيب، وألبس نور القرب وكحّل عينه بنوره تعالى، ومدّ سمعه بقوة الربوبية، فإنه يُخاطب كفاحاً وعياناً\n ونقل مثل ذلك عن الواسطي، فراجع بسطه فيه\n والفرق بينه وبين ما ذكرنا: أن خطاب المكافحة عنده خارجة من الثلاثة المذكورة في الآية، وعندنا داخلة في قوله: { إِلا وحياً } لأنه أعم من المشافهة، والله أعلم\n وقوله تعالى: { وإِنك لَتَهدي إِلى صراط مستقيم } أي: طريق الوصول والترقي أبداً، فيؤخذ منه: أن وساطته صلى الله عليه وسلم لا تنقطع عن المريد أبداً لأن الترقي يكون باستعمال أدب العبودية، وهي مأخوذة عنه صلى الله عليه وسلم، وكما أن الترقي لا ينقطع فالأدب الذي هو سلوك طريقته صلى الله عليه وسلم لا ينقطع\n والله تعالى أعلم، وصلّى الله على سيدنا محمد وآله وسلم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:42",
      "similarity": 0.5727729817607934
    },
    {
      "verse": "50:43",
      "similarity": 0.48435850194245517
    },
    {
      "verse": "24:64",
      "similarity": 0.44861852160777116
    },
    {
      "verse": "10:55",
      "similarity": 0.4477021107025981
    },
    {
      "verse": "67:6",
      "similarity": 0.4228029479368076
    }
  ]
}