{
  "chapter": "الشورى",
  "text": "وكذلك اوحينا اليك قرءانا عربيا لتنذر ام القرى ومن حولها وتنذر يوم الجمع لا ريب فيه فريق فى الجنة وفريق فى السعير",
  "translations": [
    {
      "translation": "Accordingly We have revealed to you an Arabic Qur'an so that you may warn the Mother of Cities* and those around it, and give warning of the Day of Gathering about which there is no doubt: one group in the Garden, the other in the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have, therefore, revealed to you the eloquent Qur'an that you may warn the people of the Metropolis, and those who live around it, of the Day of Gathering, of which there is no doubt, (when mankind would be assembled) some in Heaven, some in Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus did We reveal this Arabic Qur'an to you that you may warn the people of the Mother of Cities (to wit, Makkah) and those who dwell around it; and warn them of the Day of Gathering concerning which there is no doubt: whereon some will be in Paradise, and some in the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed the Quran to you in the Arabic language so that you could warn the people of the Mother Town (Mecca) and those around it of the inevitable Day of Resurrection when some will go to Paradise and others to hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We have divinely revealed to you the Qur’an in Arabic, for you to warn the people of the mother of all towns – Mecca – and those around it, and to warn of the Day of Assembling of which there is no doubt; a group is in Paradise, and another group is in hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have revealed to you a Qur'an in Arabic that you may warn the Mother of the Towns and all around it, and warn (them) of the Day of Assembling of which there is no doubt, a party will be in Paradise and a party in the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We revealed to you an Arabic Quran, that you may warn the mother city and those around it, and that you may give warning of the day of gathering together wherein is no doubt; a party shall be in the garden and (another) party in the burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We have revealed to thee an Arabic Koran, that thou mayest warn the Mother of Cities and those who dwell about it, and that thou mayest warn of the Day of Gathering, wherein is no doubt -- a party in Paradise, and a party in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have inspired in thee a Lecture in Arabic, that thou mayst warn the mother-town and those around it, and mayst warn of a day of assembling whereof there is no doubt. A host will be in the Garden, and a host of them in the Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We revealed to you, this Arabic Quran so that you may warn the mother of cities [Makkah] and those around it, and warn them of the Day of Gathering which is sure to come: when some group will be in the Garden, and some will be in the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have revealed Unto thee a Qur'an in Arabic, that thou mayest warn the mother of towns and those around it, and that thou mayest warn them of a Day of Assembling whereof there is no doubt. A party will be in the Garden, and a party in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We revealed to you an Arabic Quran that you may warn [the people of] the Mother of the Towns and those around it, and warn [them] of the Day of Gathering, in which there is no doubt, [whereupon] a part [of mankind] will be in paradise and a part will be in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent by inspiration to thee an Arabic Qur'an: that thou mayest warn the Mother of Cities and all around her,- and warn (them) of the Day of Assembly, of which there is no doubt: (when) some will be in the Garden, and some in the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have inspired unto you (O Muhammad SAW) a Quran (in Arabic) that you may warn the Mother of the Towns (Makkah) and all around it. And warn of the Day of Assembling, of which there is no doubt, when a party will be in Paradise (those who believed in Allah and followed what Allah's Messenger SAW brought them) and a party in the blazing Fire (Hell) (those who disbelieved in Allah and followed not what Allah's Messenger SAW brought them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We have revealed to you an Arabic Koran, so that you can warn the Mother of Villages (Mecca) and all who live about it, and that you also warn them of the Day of Gathering in which there is no doubt that a division will be in Paradise, and a division in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We inspired you with an Arabic Quran, that you may warn the Central City and whoever is around it, and to warn of the Day of Assembly, of which there is no doubt; a group in the Garden, and a group in the Furnace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have revealed to you an Arabic Qur'an that you may warn the Mother of Cities [Makkah] and those around it and warn of the Day of Assembly, about which there is no doubt. A party will be in Paradise and a party in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:7] And thus — in the same [manner of] revelation — have We revealed to you an Arabic Qur’ān, that you may warn, [that you may] threaten, the mother-town and those around it, namely, the inhabitants of Mecca and   all other people, and that you may warn, [all] people, of the Day of Gathering, the Day of Resurrection whereat [all] creatures will be gathered, of which there is no doubt. A part, of them, will be in Paradise and a part will be in the Blaze, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَكَذَلِكَ أَوْحَيْنَا إِلَيْكَ قُرْآَنًا عَرَبِيًّا لِتُنْذِرَ أُمَّ الْقُرَى وَمَنْ حَوْلَهَا وَتُنْذِرَ يَوْمَ الْجَمْعِ لَا رَيْبَ فِيهِ فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ (7)عطف على جملة { كذلك يُوحي إليك وإلى الذين من قبلك الله } \\[ الشورى : 3 \\] الخ باعتبار المغايرة بين المعطوفة والمعطوف عليها بما في المعطوفة من كون المُوحَى به قرآناً عربيّاً ، وما في المعطوف عليها من كونه من نوع ما أوحي به إلى الذين من قبله . والقول في { وكذلك أوحينا } كالقول في { كذلك يوحِي إليك } \\[ الشورى : 3 \\] .وإنّما أعيد { وكذلك أوحينا } ليبنى عليه { قرآناً عربياً } لِما حجز بينهما من الفصل وأصل النظم : كذلك يوحي إليك الله العزيز الحكيم قرآناً عربياً مع ما حصل بتلك الإعادة من التأكيد لتقرير ذلك المعنى أفضل تقرير .والعدول عن ضمير الغائب إلى ضمير العظمة التفات . وفي هذا إشارة إلى أنه لا فرق بين ما أوحي إليك وما أوحي إلى مَن قبلك ، إلا اختلاف اللّغات كما قال تعالى : { وما أرسلنا من رسول إلا بلسان قومه ليبين لهم } \\[ إبراهيم : 4 \\] .والقرآن مصدر : قرأ ، مثل : غُفران وسُبحان ، وأطلق هنا على المقروء مبالغة في الاتصاف بالمقروئية لكثرة ما يقرأه القارئون وذلك لحسنه وفائدته ، فقد تضمن هذا الاسم معنى الكمال بين المقروءات . و { عربياً } نسبة إلى العربية ، أي لغة العرب لأنّ كونه قرآناً يدلّ على أنه كلام ، فوصفه بكونه { عربياً } يفيد أنه كلام عربي .وقوله : { لتنذر أم القرى ومن حولها } تعليل ل { أوحينا إليك قرآناً عربياً } لأن كونه عربيّاً يليق بحال المنذَرين به وهم أهل مكّة ومَن حولها ، فأولئك هم المخاطبون بالدِّين ابتداء لما اقتضته الحكمة الإلهية من اختيار الأمة العربية لتكون أوّل من يتلقّى الإسلام وينشره بين الأمم ، ولو روعي فيه جميع الأمم المخاطبين بدعوة الإسلام لاقتضى أن ينزل بلغات لا تُحصى ، فلا جرم اختار الله له أفضل اللّغات واختار إنزاله على أفضل البشر .و { أم القرى } مكّة ، وكنيت : أم القرى لأنها أقدم المدن العربية فدعاها العرب : أم القرى ، لأن الأم تطلق على أصل الشيء مثل : أم الرأس ، وعلى مرجعه مثل قولهم للراية : أم الحرب ، وقولهم : أم الطريق ، للطريق العظيم الذي حوله طرق صغار . ثم إن إنذار أم القرى يقتضي إنذار بقية القُرى بالأحرى ، قال تعالى : { وما كان ربّك مهلك القرى حتى يبعث في أمّها رسولاً } \\[ القصص : 59 \\] ، وتقدم في قوله تعالى : { ولتنذر أم القرى } في سورة الأنعام ( 92 ) .والمراد : لتنذر أهلَ أمّ القُرى ، فأطلق اسم البلد على سكانه كقوله تعالى : { واسألْ القريةَ } \\[ يوسف : 82 \\] . وأهل مكّة هم قريش ، وأما من حولها فهم النازلون حولها من القبائل مثل خُزاعة وكنانة ، ومن الذين حولها قريشٌ الظواهر وهم الساكنون خارج مكة في جبالها .والاقتصار على إنذار أمّ القُرى ومن حولها لا يقتضي تخصيص إنذار الرّسول صلى الله عليه وسلم بأهل مكة ومَن حولها ، ولا تخصيص الرّسول صلى الله عليه وسلم بالإنذار دون التبشير للمؤمنين لأن تعليل الفعل بعلة باعثه لا يقتضي أن الفعل المعلّل مخصص بتلك العلّة ولا بمتعلِّقاتها إذ قد يكون للفعل الواحد عللُ باعثة فإن الرّسول صلى الله عليه وسلم بُعث للنّاس كافة ، كما قال تعالى :{ وما أرسلناك إلا كافّة للنّاس بشيراً ونذيراً } \\[ سبأ : 28 \\] . والاقتصار هنا على إنذار أهل مكّة ومَن حولها لأنهم المقصود بالردّ عليهم لإنكارهم رسالة محمد صلى الله عليه وسلموانتصب { أم القرى } على المفعول به لِفعل { تنذر } بتنزيل الفعل منزلة المعدَّى إلى مفعول واحد إذ لم يذكر معه المنذَر منه وهو الذي يكون مفعولاً ثانياً لفعل الإنذار . لأنّ ( أنذر ) يتعدّى إلى مفعولين كقوله تعالى : { فقل أنذرتكم صاعقةً } \\[ فصلت : 13 \\] ، وفي حديث الدجال : « مَا من نبيء إلاّ أنذَر قومَه » . فالمعنى : لتنذر أهل القرى ومن حولها ما يُنذرونه من العذاب في الدّنيا والآخرة .وقولُه : { وتنذر يوم الجمع } أعيد فعل { تنذر } لزيادة تهويل أمر يوم الجمع لأن تخصيصه بالذكر بعد عموم الإنذار يقتضي تهويله ، ولأن تعدية فعل { وتنذر } إلى { يوم الجمع } تعدية مخالفة لإنذار أم القرى لأن { يوم الجمع } مفعول ثان لفعل { وتنذر } ، أي وتنذر الناس يوم الجمع ، فمفعول { وتنذر } الثاني هو المنذر به ومفعول { لتنذر } الأول هو المنذر .وانتصب { يوم الجمع } على أنّه مفعول ثاننٍ لفعل { تنذر } وحذف مفعوله الأول لدلالة ما تقدم عليه ، أي وتنذرهم ، أي أهل أم القرى يومَ الجمع بالخصوص كقوله { وأنذرهم يوم الآزفة } \\[ غافر : 18 \\] .ويومُ الجمع : يومُ القيامة ، سمي { يوم الجمع } لأن الخلائق تُجمَع فيه للحساب ، قال تعالى : { يوم يجمعكم ليوم الجمع } \\[ التغابن : 9 \\] .والجمع مصدر ، ويجوز أن يكون اسماً للمجتمعين كقوله تعالى : { هذا فَوْجٌ مقتحمٌ معكم } \\[ ص : 59 \\] ، أي يوم جماعة النّاس كلهم .وجملة { فريق في الجنة } مستأنفة استئنافاً بيانياً ، وعطفت عليها جملة { وفريق في السعير } فكان الجملتان جواباً لسؤال سائل عن شأن هذا الجمع إن كان بمعنى المصدر . فقيل : فريق في الجنّة وفريق في السعير ، أي فريق من المجموعين بهذا الجمع في الجنّة وفريق في السعير ، أو لسؤال سائل عن حال هذا الجمع إن كان الجمعُ بمعنى المجموعين . والتقدير : فريق منهم في الجنّة وفريق منهم في السعير . وتقدم السعير عند قوله تعالى : { كُلَّمَا خبت زدناهم سعيراً } في سورة الإسراء ( 97 ) . وسوغ الابتداء ب { فريق } وهو نكرة لوقوعها في معرض التفصيل كقول امرىء القيس: ... فأقبلتُ زحفاً على الركبتينفثوبٌ لبِستُ وثوبٌ أَجُرّ ... وجملة { لا ريب فيه } معترضة بين البيان والمبيَّن . ومعنى { لا ريب فيه } أن دلائله تنفي الشك في أنه سيقع فنزّل ريب المرتابين في منزلة العدم لأن موجبات اليقين بوقوعه بينة كقوله تعالى : { ذلك الكتاب لا ريب فيه } في سورة البقرة ( 2 ) . وظرفية الريب المنفي في ضمير اليوم في قوله : لا ريب فيه } من باب إيقاع الفعل ونحوه على اسم الذات ، والمراد : إيقاعه على بعض أحوالها التي يدل عليها المقام مثل { حُرِّمت عليكم الميتة } \\[ المائدة : 3 \\] ، أي أكلُها ، أي لا ريبَ في وقوعه . وجملة { فريق في الجنة } الخ معترضة و { فريق } خبر مبتدأ محذوف على طريقة الحذف المتابع فيه الاستعمال كما سماه السكاكي ، أي هم فريق في الجنّة الخ .\n\n",
      "translations": [
        {
          "translation": "(And thus we have inspired in thee) We sent you Gabriel with the Qur'an (a Lecture in Arabic) a Qur'an in the Arabic usage, (that thou mayst warn) by the Qur'an (the mother town) the people of Mecca (and those around it) of townships, (and may warn of a day of assembling) of the horrors of the Day of Assembly whereby the dwellers of the heavens and earth will be brought together (whereof there is no doubt. A host) of those assembled (will be in the Garden) these are the believers, (and a host of them in the Flame) and these are the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِّتُنذِرَ أُمَّ ٱلْقُرَىٰ } معناه مكةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Warn [O Muhammad], your mother's town\" [Qur'an 60:4] - this means Mecca.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما بلغت وأنذرت لم يبقَ من أمرك شيء { وَكَذَلِكَ أَوْحَيْنَآ } أي: ومثل ما أوحينا إلى من قبلك من الأنبياء كتباً\n وأوحينا { إِلَيْكَ } يا أكمل الرسل أيضاً { قُرْآناً عَرَبِيّاً } نظماً وأسلوباً { لِّتُنذِرَ أُمَّ ٱلْقُرَىٰ } يعني: أهل مكة { وَمَنْ حَوْلَهَا } من أقطار الأرض وأنحائها\n كما أنذر الأنبياء أقوامهم فيما مضى من مطلق الأمور المنافية لسلوك طريق التوحيد وسبيل الهداية والرشاد { وَتُنذِرَ } خاصة { يَوْمَ ٱلْجَمْعِ } أي: الخذلان والحرمان الحاصل لهم يوم الحشر والاجتماع على المحشر\n والوقوف بين يدي الله\n الذي { لاَ رَيْبَ فِيهِ } أي: في إتيانه ووقوعه\n وبعدما اجتمعوا فيه حيارى سكارى هائمين\n يساقون بعدما يحاسبون منهم { فَرِيقٌ فِي ٱلْجَنَّةِ } مسرورون مقبولون { وَفَرِيقٌ فِي ٱلسَّعِيرِ } [الشورى: 7] محزونون مطرودون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وكذلك }: الكاف في محل النصب على المصدر\n و { قرآناً }: مفعول \" أوحينا \"\n  يقول الحق جلّ جلاله: { والذين اتخذوا من دونه أولياء } شركاء\n يُوالونهم بالعبادة والمحبة { اللهُ حفيظ عليهم }: رقيب على أحوالهم وأعمالهم\n فيجازيهم بها\n { وما أنت عليهم بوكيلٍ } بموكّل عليهم\n تجبرهم على الإيمان\n ثم نسخ بالجهاد\n أو: ما أنت بموكول إليك أمرهم\n وإنما وظيفتك الإنذار بما أوحينا إليك\n { وكذلك أوحينا إِليك قرآناً عربيّاً } أي: ومثل ذلك الإيحاء البديع الواضح أوحينا إليك قرآناً عربيّاً\n لا لبس فيه عليك ولا على قومك\n { لِتُنذِر أُمَّ الْقُرَى } أي: أهلها\n وهي مكة لأن الأرض دحيت من تحتها\n أو: لأنها أشرف البقع\n { و } تُنذر { مَنْ حولها } من العرب أو من سائر البلاد\n قال القشيري: وجميعُ العالَم مُحْدِقٌ بالكعبة لأنها سُرَّةُ الأرضِ\n هـ\n { وتُنذِرَ يَوْمَ الْجَمْعِ } يوم القيامة لأنه تجمع فيه الخلائق\n وفيه تجمع الأرواح والأشباح\n وحذف المفعول الثاني من \" تُنذر \" الأول للتهويل\n أي: لتنذر الناس أمراً فظيعاً تضيق عنه العبارة\n { لا ريبَ فيه } لا شك في وقوع ذلك اليوم\n { فريقٌ في الجنة وفريقٌ في السعير } أي: بعد جمعهم في الموقف يفترقون\n فريق يُصرف إلى الجنة\n وفريق إلى السعير بعد الحساب\n والتقدير: فريق منهم في الجنة\n والجملة: حال\n أي: وتنذر يوم الجمع متفرقين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:92",
      "similarity": 0.3497322348016389
    },
    {
      "verse": "41:3",
      "similarity": 0.3244703227836539
    },
    {
      "verse": "43:3",
      "similarity": 0.3229454410779992
    },
    {
      "verse": "12:2",
      "similarity": 0.32234031977730954
    },
    {
      "verse": "22:4",
      "similarity": 0.31586072018489686
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/042007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/042007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/42:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}