{
  "chapter": "الشورى",
  "text": "ولو شاء الله لجعلهم امة وحدة ولكن يدخل من يشاء فى رحمته والظلمون ما لهم من ولى ولا نصير",
  "translations": [
    {
      "translation": "If Allah had willed, He would have made them a single nation. But He admits whoever He wills into His",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had pleased He would have made them one community of belief; but He admits whom He please to His grace; yet the sinners have neither friend nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had so willed, He could have made them all a single community. But He admits whomsoever He pleases into His Mercy. As to those given to wrong-doing, they shall have none as protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God wanted, He could have made them all one single nation, but He grants mercy to whomever He wills. The unjust will have no guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah willed, He could have made them all upon one religion, but He admits whomever He wills into His mercy; and the unjust do not have any friend nor any supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had willed, He could have made them one nation, but He admits whom He wills to His mercy. And the wrongdoers will have neither a protector nor a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had pleased He would surely have made them a single community, but He makes whom He pleases enter into His mercy, and the unjust it is that shall have no guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had willed, He would have made them one nation; but He admits whomsoever He will into His mercy, and the evildoers shall have neither protector nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed, He could have made them one community, but Allah bringeth whom He will into His mercy. And the wrong-doers have no friend nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God so willed, He could have made all of them one community, but He admits into His mercy whom He wills; and the wrongdoers have neither protector, nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah willed, He would have made them one community; but He causeth whomsoever He will to enter into His mercy. And the wrong doers! for them there shall be no patron or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah wished, He would have surely made them one community; but He admits whomever He wishes into His mercy, and the wrongdoers do not have any guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had so willed, He could have made them a single people; but He admits whom He will to His Mercy; and the Wrong-doers will have no protector nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had willed, He could have made them one nation, but He admits whom He wills to His Mercy. And the Zalimun (polytheists and wrong-doers, etc.) will have neither a Wali (protector) nor a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been the Will of Allah, He would have made them all one nation. But He admits into His Mercy whom He will the harmdoers shall have neither a guardian nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God willed, He could have made them one community, but He admits into His mercy whomever He wills. As for the wrongdoers, they will have no protector and no savior.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah willed, He could have made them [of] one religion, but He admits whom He wills into His mercy. And the wrongdoers have not any protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[42:8] And had God willed, He would have made them one community, in other words, following one religion, and that is Islam; but He admits whomever He will into His mercy, and the evildoers, the disbelievers, have neither guardian nor helper, to ward off the chastisement from them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "558 (Had Allah willed, He could have made them one community) had Allah willed He would have gathered the Jews, Christians and the idolaters in one religion, the religion of Islam, (but Allah bringeth whom He will into His mercy) to His religion: Islam. (And the wrong-doers) the Jews, Christians and idolaters (have no friend) have no relative to assist them (nor helper) to save them from Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ شَآءَ ٱللَّهُ } الهادي لعباده وأراد هدايتهم جميعاً { لَجَعَلَهُمْ أُمَّةً وَاحِدَةً } مقتصدة معتدلة على مقتضى صرافة الوحدة الذاتية واعتدالها، { وَلَـٰكِن } راعى سبحانه متقضيات أوصافه وأسمائه المتقابلة، وشئونه المتخالفة لذلك { يُدْخِلُ مَن يَشَآءُ فِي رَحْمَتِهِ } ويوصله إلى فضاء وحدته بمقتضى جوده وحكمته عناية منه وفضلاً، وولاية لهم ونصراً { وَٱلظَّالِمُونَ } الخارجون عن مقتضى عناية الله، وولايته بمقتضى قهره وانتقامه إياهم إظهاراً لكمال قدرته { مَا لَهُمْ مِّن وَلِيٍّ } يواليهم، ويشفع لهم عنده سبحانه { وَلاَ نَصِيرٍ } [الشورى: 8] ينقذهم من عذابه، فظهر ألا ولاية ولا نصرة إلا لله، ولا غالب إلا هو، وإن زعموا آلهة سواه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو شاء اللهُ لجعلهم } في الدنيا { أمة واحدة } إما مهتدين كلّهم، أو ضالين، { ولكن يُدْخِلُ مَن يشاء في رحمته } أي: ويُدخل مَن يشاء في عذابه، يدلّ عليه ما بعده، ومن ضرورة اختلاف الرحمة والعذاب: اختلاف الداخلين فيهما، فلم يشأ جعل الكل أمة واحدة، بل جعلهم فريقين، فيسَّر كلاًّ لمَن خُلق له\n { والظالمون ما لهم من وَليٍّ ولا نصير } والكافرون ما لهم من شافع ولا دافع\n قال أبو السعود: والذي يقتضيه سياق النظم أن يُراد بقوله: { أمة واحدة } الاتحاد في الكفر، كما في قوله تعالى:\n\n[البقرة: 213] الآية، على أحد الوجهين، بأن يُراد بهم الذين هم في فترة إدريس، أو فترة نوح\n ولو شاء لجعلهم أمة واحدة متفقة على الكفر، بأن لا يُرسل إليهم رسولاً ليُنذرهم ما ذكر من يوم الجمع، وما فيه من ألوان الأهوال، فيبقوا على ما هم عليه من الكفر، ولكن يُدخل مَن يشاء في رحمته إن شاء ذلك، فيُرسل إلى الكل مَن ينذرهم، فيتأثر بعضهم بالإنذار فيعرفون الحق فيوفقهم الله تعالى للإيمان والطاعة، ويُدخلهم في رحمته، ولا يتأثر به الآخرون، ويتمادى في غيهم، وهم الظالمون، فيبقون في الدنيا على ما هم عليه، ويصيرون في الآخرة إلى السعير، من غير وليٍّ يلي أمرهم، ولا نصيرٍ يُخلصهم من العذاب\n\n\nهـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:93",
      "similarity": 0.6013638282218812
    },
    {
      "verse": "21:92",
      "similarity": 0.4511858411031369
    },
    {
      "verse": "23:52",
      "similarity": 0.4502064802215013
    },
    {
      "verse": "2:163",
      "similarity": 0.41451435756350125
    },
    {
      "verse": "28:41",
      "similarity": 0.3746751357747465
    }
  ]
}