{
  "chapter": "الزخرف",
  "text": "واذا بشر احدهم بما ضرب للرحمن مثلا ظل وجهه مسودا وهو كظيم",
  "translations": [
    {
      "translation": "When any of them is given the good news of the very thing which he himself has ascribed to the All-",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when news of (a daughter) they had reserved for Ar-Rahman comes to one of them, his face is blackened (with shame), and he grieves in silence inwardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They believe so although when) any of them is given tidings of the birth of a female child the like of which he assigns to the Merciful One, his countenance darkens and he is choked with grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When one of them is given the glad news of the birth of a daughter, which they believe to be the only kind of child that the Beneficent God can have, his face blackens with anger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one of them is given the glad tidings of what he professes regarding the Most Gracious, his face blackens and he is mournful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one of them is informed of the news of that which he sets forth as a parable to the Most Gracious, his face becomes dark, and he is filled with grief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when one of them is given news of that of which he sets up as a likeness for the Beneficent Allah, his face becomes black and he is full of rage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when any of them is given the good tidings of that he has likened to the All-merciful, his face is darkened, and he chokes inwardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one of them hath tidings of that which he likeneth to the Beneficent One, his countenance becometh black and he is full of inward rage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When any of them is given the news of the very thing [i.e. a female child] which he himself has ascribed to the All Merciful, his face darkens and he is filled with grief --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there is announced Unto any of them the birth of that which he likeneth Unto the Compassionate, his countenance remaineth darkened the whole day and he is wroth inwardly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When one of them is brought the news of what he ascribes to the All-beneficent, his face becomes darkened and he chokes with suppressed rage, [and says]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When news is brought to one of them of (the birth of) what he sets up as a likeness to (Allah) Most Gracious, his face darkens, and he is filled with inward grief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one of them is informed of the news of (the birth of) that which he set forth as a parable to the Most Beneficent (Allah) (i.e. of a girl), his face becomes dark, gloomy, and he is filled with grief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when one of them is given glad news of (a daughter) that which he likened to the Merciful his face darkens and he chokes inwardly (with gloom).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when one of them is given news of what he attributes to the Most Gracious, his face darkens, and he suppresses grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when one of them is given good tidings of that which he attributes to the Most Merciful in comparison, his face becomes dark, and he suppresses grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:17] And when one of them is given the good tidings of that which he has attributed to the Compassionate One, [of that which] he has likened to Him by the ascription to Him of daughters — for a child is likened to its   parent; in other words, when one of them is informed that a daughter has been born to him, his face becomes darkened, transformed into one laden with anguish, and he chokes inwardly, filled with anguish: so how can such a person then attribute daughters to Him? Exalted be He high above such [claims].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And if one of them) one of the Banu Malih (hath tidings of that which he likeneth) of that which he ascribes (to the Beneficent One) i.e. daughters, (his countenance becometh black) of grief (and he is full of inward rage) would you then, Banu Malih, like for Allah that which you do not like for yourselves?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ظَلَّ وَجْهُهُ مُسْوَدّاً وَهُوَ كَظِيمٌ } معناه مَكروبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"His face was dark {and he was stern},\" means that He was covered {in darkness}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتختارون لأنفسكم بنين مع أنه { إِذَا بُشِّرَ أَحَدُهُم بِمَا ضَرَبَ لِلرَّحْمَـٰنِ مَثَلاً } من إثبات البنات له { ظَلَّ } صار { وَجْهُهُ مُسْوَدّاً } من كمال ضجرته وكآبتها { وَهُوَ } حينئذ { كَظِيمٌ } [الزخرف: 17] مملوء من الغيظ والكرب\n\n\n{ أَوَمَن يُنَشَّأُ } أي: أتثبتون للصمد المنزه عن الأهل والولد ولداً ناقصاً يُربى ويزين { فِي ٱلْحِلْيَةِ } والزينة\n لعدم كماله الذاتي { وَ } الحال أنه { هُوَ فِي ٱلْخِصَامِ } أي: المجادلة والمحاباة { غَيْرُ مُبِينٍ } [الزخرف: 18] معرب مظهر\n لما يدعيه لنقصان عقله وركاكة رأيه وفهمه\n وهن البنات الناقصات عقلاً وديناً وخلقة\n وبالجملة: أثبوا لله ما ينزهون أنفسه عنه\n ويتغممون عند حصوله لهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قرّره بقوله: { وإِذا بُشِّر أحدُهُم بما ضَرَبَ للرحمن مَثَلاً } أي: وإذا أُخبر أحدُهم بولاده ما جُعل مثلاً له سبحانه\n وهي الأنثى\n لأنهم جعلوا الملائكة بنات الله\n وجزءاً منه إذ الولد لا بد أن يُجانس الوالِد ويشابهه\n { ظَلَّ وجهُهُ مُسوداً وهو كظيمٌ } يعني: أنهم نسبوا إليه هذا الجنس\n ومِن حالهم: أن أحدهم إذا قيل له: قد وُلدت لك بنت\n اغتمّ\n واربدّ وجهه غيظاً وتأسُّفاً\n وهو مملوءٌ من الكرب\n والظلول: بمعنى الصيرورة\n أي: صار أسود في الغاية من سوء ما بُشر به\n { أوَ مَن ينشأ في الحِلْيةِ وهو في الخصام غير مُبينٍ } أي: أو يَجْعَلُ للرحمن من الولد مَن هذه الصفة المذمومة صفته\n وهو أنه ينشأ في الحلية\n أي: يتربّى في الزينة والتخنُّث\n وإذا احتاج إلى مجاثاة الخصوم\n ومجاراة الرجال\n كان غير مبين\n ليس عنده بيان\n ولا يأتي ببرهان لضعف عقولهن\n قال مقاتل: لا تتكلم المرأة إلا وتأتي بالحجة عليها - أي: في الغالب - وفيه: أنه جعل النشأة في الزينة من المعايب\n فعلى الرجل أن يجتنبَ ذلك\n له ولأولاده\n ويتزين بلباس التقوى\n و \" مَنْ \" منصوب المحل\n أي: أوَ جعلوا مَن يربى في الحلية - يعني البنات - لله عزّ وجل\n\nوقرأ الأخَوان وحفص \" يُنشَّأُ \" أي: يُربّى\n { وجعلوا الملائكة الذين هم عند الرحمن إِناثاً } أي: اعتقدوا الملائكة وسموهم إناثاً\n وهو بيان لتضمُّن كفرهم كفراً آخر\n وتقريع لهم بذلك وهو جعلهم أكمل العباد وأكرمهم على الله - عزّ وجل - أنقصهم رأياً\n والعندية عندية منزلة ومكانة\n لا مكان\n ومَن قرأ \" عبِاد \" فجمع \" عبد \" \n وهو ألزم في الاحتجاج مع أهل العناد لتضاد العبودية والولادة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:58",
      "similarity": 0.9112290949885351
    },
    {
      "verse": "3:134",
      "similarity": 0.44504929013817923
    },
    {
      "verse": "33:67",
      "similarity": 0.4300312820923519
    },
    {
      "verse": "68:48",
      "similarity": 0.41734476562084694
    },
    {
      "verse": "39:60",
      "similarity": 0.40489286341902836
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}