{
  "chapter": "الزخرف",
  "text": "والذى نزل من السماء ماءۢ بقدر فانشرنا به بلدة ميتا كذلك تخرجون",
  "translations": [
    {
      "translation": "It is He who sends down water in due measure from the sky by which We bring a dead land back to life. That is how you too will be brought forth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who sent down water in due measure from the sky, then quickened a region that was dead -- So shall We bring you forth --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who sent down water from the sky in a determined measure, and thereby We revived a dead land: likewise will you be raised up (from the earth) --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent down water from the sky in a known measure by which He has given life to the dead earth. In the same way will you also be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Who sent down water from the sky with a proper measure, so We revived a dead city with it; this is how you will be taken out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Who sends down water from the sky in due measure, then We revive a dead land therewith, and even so you will be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He Who sends down water from the cloud according to a measure, then We raise to life thereby a dead country, even thus shall you be brought forth;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who sent down out of heaven water in measure; and We revived thereby a land that was dead; even so you shall be brought forth;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Who sendeth down water from the sky in (due) measure, and We revive a dead land therewith. Even so will ye be brought forth;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends water down from the sky in due measure, We revive dead land with it and likewise you will be resurrected from the grave,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Who sendeth down from the heaven water in measure; then We quicken a dead land therewith: even so ye shall be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who sent down water from the sky in a measured manner, and We revived with it a dead country. Likewise, you shall be raised [from the dead].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That sends down (from time to time) rain from the sky in due measure;- and We raise to life therewith a land that is dead; even so will ye be raised (from the dead);-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Who sends down water (rain) from the sky in due measure. Then We revive a dead land therewith, and even so you will be brought forth (from the dead),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it is He), who sends down water from the sky in its measure thereby We revive the land that was dead, as such you shall be brought forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who sends down water from the sky in due proportion; and so We revive thereby a dead land. Thus you will be brought out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who sends down rain from the sky in measured amounts, and We revive thereby a dead land - thus will you be brought forth -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:11] and Who sent down water from the heaven in measure, that is to say, in the measure that you require thereof and did not send it down in a deluge, and We revived with it a dead land. Thus — like this revivification — will you be brought forth, from your graves, alive;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who sendeth down water) rain (from the sky in (due) measure) according to the knowledge of the storer, (and We revive a dead land therewith) and We revive through it a barren land that had hitherto no vegetation. (Even so will ye be brought forth) Even so you will be revived and brought forth from the graves as We revive the barren land and bring forth from it vegetation;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تنكروف وجود موجدكم { ٱلَّذِي نَزَّلَ مِنَ ٱلسَّمَآءِ } أي: من عالم الأسباب { مَآءً } محيياً لأموات المسببات { بِقَدَرٍ } معتدل معتاد { فَأَنشَرْنَا بِهِ } أي: أحيينا وأخضررنا بإجراء الماء المحيي { بَلْدَةً } جافاً يابساً لا نبات فيها، ولا خضرة لها { مَّيْتاً كَذَلِكَ } أي: مثل إخراجنا النبات من الأرض اليابسة بإنزال الماء { تُخْرَجُونَ } [الزخرف: 11] وتنشرون؛ أي: الموتى حال كونكم موتى من قبورهم بنفخ الروح فيكم تارةً أخرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذي نَزَّلَ من السماء ماء بِقَدَرِ } بمقدار يسلم معه العباد، وتحتاج إليه البلاد، على ما تقتضيه مشيئته المبنية على الحِكَم والمصالح، { فأنشرنا به } أي: أحيينا بذلك الماء { بلدةً ميْتاً } خالياً عنه الماء والنبات\n وقُرئ: \" ميِّتاً \" بالتشديد\n وتذكيره لأن البلدة بمعنى البلد\n والالتفات إلى نون العظمة لإظهار كمال العناية بأمر الإحياء والإشعار بعظيم خطره، { كذلك تُخرجون } أي: مثل ذلك الإحياء، الذي هو في الحقيقة: إخراج النبات من الأرض، تُخرجون من قبوركم أحياء\n وفي التعبير عن إخراج النبات بالإنشاء، الذي هو إحياء الموتى، وعن إحيائهم بالإخراج تفخيم لإن لشأن الإنبات، وتهوين لأمر البعث، لتقويم سَنَنِ الاستدلال، وتوضيح منهاج القياس\n وهذه الجُمل، من قوله { الذي جعل\n\n\n } استئناف منه تعالى، وليست من مقول الكفار لأنهم يُنكرون الإخراج من القبول، بل الآية حجة عليهم في إنكار البعث، وكذا قوله: { والذي خلق الأزواجَ كلها } ، أي: أصناف المخلوقات بحذافيرها، على اختلاف أنواعها وألوانها\n وقيل: الأزواج: ما كان مزدوجاً، كالذكر والأنثى، والفوق والتحت، والأبيض والأسود، والحلو والحامض، وقيل: كل ما ظهر من الغيب فهو مزدوج\n والفرد هو الله",
      "translations": []
    }
  ]
}