{
  "chapter": "الزخرف",
  "text": "وانا الى ربنا لمنقلبون",
  "translations": [
    {
      "translation": "Indeed we are returning to our Lord!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely we have to go back to our Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is to our Lord that we shall eventually return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To our Lord we shall all return\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And indeed we have to return to our Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, to Our Lord we indeed are to return!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely to our Lord we must return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "surely unto our Lord we are turning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! unto our Lord we surely are returning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to our Lord we shall surely return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily Unto our Lord we are to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed we shall return to our Lord.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to our Lord, surely, must we turn back!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, to Our Lord we indeed are to return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "indeed, to our Lord we are turning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, to our Lord we will return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed we, to our Lord, will [surely] return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:14] And indeed it is to our Lord that we shall return’, [to Him that] we shall depart.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! unto our Lord we are returning) after we die.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { إِنَّآ } في عموم أوصافنا وأحوالنا وذواتنا { إِلَىٰ رَبِّنَا } الذي أظهرنا بمد أظلال أسمائه الحسنى وصفاته العليا علينا، وربانا بمقتضى لطفه بالنعم الأوفى { لَمُنقَلِبُونَ } [الزخرف: 14] راجعون إليه، صائرون نحوه بعد انخلاعنا عن لوازم ناسوتنا وارتفاع غشاوة تعيناتنا عنَّا\n\n\n\n\nوإنما أوصله به تنبيهاً على أن العبد العارف لا بدَّ أن يكون في عموم انقلاباته وحالاته مسترجعاً إلى الله، عازماً نحو الفناء فيه، متذكراً لموطنه الأصلي ومقره الحقيقي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقال: أقرن الشي: إذا أطاقه، وأصله: وجده قرينه لأن الصعب لا يكون قريناً للضعيف إلا إذا ذلّله الله وسهّله، { وإِنَّا إِلى ربنا لمنقلبون } أي: راجعون\n وفيه إيذان بأن حق الراكب أن يذكر عند ركوبه مركب الدنيا، آخر مركبه منها، وهو: الجنازة فيبني أموره في مسيره على تلك الملاحظة، حتى لا يخطر بباله شيء من زينة الدنيا، وملاهيها وأشغالها\n\n\nوعن النبي صلى الله عليه وسلم \" أنه كان إذا وضع رجله في الركاب، قال: \" بسم الله \" فإذا استوى على الدابة قال: { الحمد لله الذي خسر لنا هذا\n\n\n } إلى: { منقلبون } ، ثم كبّر \" ثلاثاً \" وهلّل ثلاثاً، ثم قال:\n\n \" اللهم اغفر لي\n\n \" \n\n، وحُكي أن قوماً ركبوا، وقالوا: { سبحان الذي سخّر لنا هذا\n\n\n } الآية، وفيهم رجل على ناقة لا تتحرك هُزالاً، فقال: إني مقرن لهذه - أي مطيق - فسقط منها لوثبتها، واندقّت عنقه\n وينبغي ألا يكون ركوبُ العاقل للشهرة والتلذُّذ، بل للاعتبار، فيحمد الله ويشكره على ما أولاه من نعمه، وسخَّر له من أنعامه\n الإشارة: قد اتفقت الملل كلها على وجود الصانع، إلا مَن عِبْرة به من الفلاسفة، وإنما كفر مَن كفر بالإشراك، أو: بوصف الحق على غير ما هو عليه، أو: بجحد الرسول\n وقد تواطأت الأدلة العقلية والسمعية على وجود الحق وظهوره، بظهور آثار قدرته، والصفة لا تُفارق الموصوف، فدلّ بوجود أثاره على وجود أسمائه، وبوجود أسمائه، على وجود أوصافه، وبثبوت أوصافه على وجود ذاته\n فأهل السلوك يكشف لهم أولاً عن وجود آثاره، ثم عن أسمائه، ثم صفاته، ثم عن شهود ذاته\n وأهل الجذب يكشف لهم أولاً عن ذاته، ثم عن أوصافه، ثم عن أسمائه، ثم عن آثاره، فربما التقيا في الطريق، هذا في ترقيه، وهذا في تدليه، كما في الحِكَم\n وقوله تعالى: { الذي جعل لكم الأرض مهاداً\n\n\n } الخ، قال القشيري: كما جَعلها قَراراً لأشباحهم، جَعَلَ الأشباحَ قراراً لأرواحهم فهي سُكَّانُ النفوس، كما أن الخَلْق سُكَّانُ الأرضِ، فإذا انتهت مدةُ كَوْنِ النفوسِ، حَكَمَ اللّهُ بخرابها\n\n\n كذلك إذا فارقت الأرواحُ الأشباحَ بالكُلِّية، قضى الله بخرابها\n ثم قال في قوله: { فأنشرنا به بلدة ميتاً } وكما يُحْيي الأرضَ بالمطَر يُحْيي القلوبَ بحُسن النَّظَر\n والذي خلق من الأزواج أصنافَ الخَلْق، كذلك حبس عليكم الأحوالَ كلها، فمِنْ رغبةٍ في الخيرات، وخوفٍ يحملكم على تَرْكِ الزلاّت، ورجاءٍ يبعثكم على فعل الطاعات، طمعاً في المثوبات، وغير ذلك من فنون الصِّفات، وكما سَخَّرَ الأنعام، وأعظمَ المنَّة بذلك، سَخَّر للمؤمنين مركب التوفيق، بحْملهم عليه إلى بساط الطاعة، وسهَّل للمريدين مركبّ الإرادة، وحَمَلَهم عليه إلى عَرَصَات الجود، وفضاء الشهود، وسَهَّل للعارفين مركبَ الهِمّة، فأناخوا بالحضرة القدسية، وعند ذلك مَحَطُّ الكافة ثم لا تخرق سرادقاتِ العزةِ هِمَّةُ مخلوقٍ، سواء كان ملَكاً مُقّرَّباً، أو نبيّاً مُرْسلاً، أو ولياً مُكَرَّماً\n فعند سطواتِ العِزِّ يتلاشى كلُّ مخلوقٍ، ويقف وراءها كل مُحْدَثٍ مسبوق\n هـ\n ببعض المعنى\n وسرادقات العز: حجاب الكبرياء، فلا تحصل الإحاطة بكُنه الربوبية لأحدٍ من الخلق\n ولهذا يبقى الترقي أبداً للعارفين، في هذه الدار، وفي تلك الدار، ولا يحصل على غاية أسرار الربوبية أحد، ولو بقي يترقى أبداً سرمداً\n والله تعالى أعلم\n ثم أبطل مذهب أهل الشرك، فقال: { وَجَعَلُواْ لَهُ مِنْ عِبَادِهِ }\n\n",
      "translations": []
    }
  ]
}