{
  "chapter": "الزخرف",
  "text": "قل اولو جئتكم باهدى مما وجدتم عليه ءاباءكم قالوا۟ انا بما ارسلتم به كفرون",
  "translations": [
    {
      "translation": "Say: 'What if I have come with better guidance than what you found your fathers following?' They say, 'We reject what you have been sent with.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if I bring you a better guidance,\" he rejoined, \"than the one you found your fathers on?\" Still they said: \"We do not believe in what you have brought.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each Prophet asked them: “Will you do so even if we were to show you a way better than the way of your forefathers?” They answered: “We disbelieve in the religion with which you have been sent.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers would say, \"Would you still follow in the footsteps of your fathers even if I was to bring you better guidance?\" They would say, \"We have no faith in your message\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The prophet said, “What! Even if I bring to you a path better than what you found your forefathers following?”; they said, “We do not believe in whatever you have been sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Even if I bring you better guidance than that which you found your fathers following\" They said: \"Verily, we disbelieve in that with which you have been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The warner) said: What! even if I bring to you a better guide than that on which you found your fathers? They said: Surely we are unbelievers in that with which you are sent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What, though I should bring you a better guidance than you found your fathers upon?' They say, 'We disbelieve in that you were sent with.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the warner) said: What! Even though I bring you better guidance than that ye found your fathers following? They answered: Lo! in what ye bring we are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each messenger said, \"What if I should bring you better guidance than what you found your forefathers had?\" They replied, \"We reject any message you have been sent with!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The warner said: What! even though bring you a better guidance than that which ye found your fathers upon They said: verily in that wherewith ye are sent we are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would say, ‘What! Even if I bring you a better guidance than what you found your fathers following?!’ They would say, ‘We indeed disbelieve in what you are sent with.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"What! Even if I brought you better guidance than that which ye found your fathers following?\" They said: \"For us, we deny that ye (prophets) are sent (on a mission at all).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The warner) said: \"Even if I bring you better guidance than that which you found your fathers following?\" They said: \"Verily, We disbelieve in that with which you have been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What then if I bring you a better guidance than that you found your fathers following' But they reply: 'We disbelieve in that you have been sent with.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would say, “Even if I bring you better guidance than what you found your parents following?” They would say, “We reject what you are sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Each warner] said, \"Even if I brought you better guidance than that [religion] upon which you found your fathers?\" They said, \"Indeed we, in that with which you were sent, are disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:24] Say, to them: ‘What! Will you follow them, even if I bring you a better [means to] guidance than what you found your fathers following?’ They say, ‘Lo! we disbelieve in what you, and those before you, are sent with’. God, exalted be He, says to them, as a threat to them:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (What! Even though I bring you better guidance) a truer religion (than that ye found your fathers following) would you not accept it? (They answered: Lo! in what ye bring) of Scripture (we are disbelievers) we are deniers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n عارياً عن أمارات التقليد والتخمين: { أَوَلَوْ جِئْتُكُمْ } يعني: أتقلدن\n وتتبعون آباءكم أيها المقلدون المسرفون\n ولو جئتكم { بِأَهْدَىٰ } أي: بدين أهدى\n وأنفع لكم ي أولاكم وأخراكم { مِمَّا وَجَدتُّمْ عَلَيْهِ آبَآءَكُمْ } أي: من أديان آبائكم وتقليداتهم\n فتتركون الهداية وتتبعون الضلال\n\n\nوبعدما سمع من هؤلاء المقلدون والمسرفون ما سمع أسلافهم من النذر الأولى من الهداية والرشاد { قَالُوۤاْ } مصرين على ما هم عليه: { إِنَّا بِمَآ أُرْسِلْتُمْ بِهِ } أي: بجميع ما جئتم به أيها المدعون للرسالة { كَافِرُونَ } [الزخرف: 24] منكرون جاحدون\n لا نقل من أمثال هذا\n ولا نترك دين آبائنا ومتابعتهم بمجرد ما ابتدعتموه مراء\n ونسبتموه إلى الله افتراء\n\n\nوبعدما أصروا على ضلالهم\n وتقليداتهم الموروثة له من آبائهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقرأ الشامي وحفص: { قال } أي: النذير: { أوَ لَو جئتُكُم } أي: أتقتدون بآبائكم ولو جئتكم { بأهدى } بدين أهدى { مما وجدتم عليه آباءكم } من الضلالة التي ليست من الهداية في شيء؟ { قالوا إِنا بما أُرسلتم به كافرون } أي: قالت كل أمة لنذيرها: إنا ثابتون على ديننا\n وإن جئتمونا بما هو أهدى وأهدى\n وقد أجمل عند الحكاية للإيجاز\n كقوله:\n[المؤمنون: 51]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:104",
      "similarity": 0.6058281891271332
    },
    {
      "verse": "21:53",
      "similarity": 0.6045010137235233
    },
    {
      "verse": "26:74",
      "similarity": 0.47308098801051435
    },
    {
      "verse": "93:7",
      "similarity": 0.44443080958828346
    },
    {
      "verse": "26:30",
      "similarity": 0.4212992749540376
    }
  ]
}