{
  "chapter": "الزخرف",
  "text": "وجعلها كلمةۢ باقية فى عقبه لعلهم يرجعون",
  "translations": [
    {
      "translation": "he made it an on-going word among his descendants so that perhaps they might turn back.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the legacy he left to his descendants so that they may turn (to God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham left behind this word to endure among his posterity so that they may return to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made (belief in one God) an everlasting task for his successors, so that perhaps they would return (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim kept this declaration among his progeny, in order that they may desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it a word lasting among his offspring, that they may turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it a word to continue in his posterity that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it a word enduring among his posterity; haply so they would return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it a word enduring among his seed, that haply they might return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and he left these words to endure among his descendants, so that they might return [to God].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it a word lasting among his posterity that haply they should return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made it a lasting word among his posterity so that they may come back [to the right path].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he left it as a Word to endure among those who came after him, that they may turn back (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it [i.e. La ilaha ill-Allah (none has the right to be worshipped but Allah Alone)] a Word lasting among his offspring (True Monotheism), that they may turn back (i.e. to repent to Allah or receive admonition).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made this an abiding word among his descendants, in order that they would return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it an enduring word in his progeny, so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he made it a word remaining among his descendants that they might return [to it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:28] And he made it, namely, the statement of the affirmation of [God’s] Oneness, understood from his words, I shall indeed depart to my Lord; He will guide me [Q. 37:99], a word enduring among his posterity, his descendants, and thus there still remains among them those who affirm the Oneness of [God]; that perhaps they, that is, the people of Mecca, might recant, what they follow [and return] to the religion of their forefather Abraham.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ (28)عطف على { إذ قال إبراهيم } \\[ الزخرف : 26 \\] أي أعلن تلك المقالة في قومه معاصريه وجعلها كلمة باقية في عقبه ينقلونها إلى معاصريهم من الأمم . إذ أوصى بها بنيه وأن يوصوا بَنِيهم بها ، قال تعالى في سورة البقرة ( 131 132 ) { إذ قال لَه ربّه أسلم قال أسلمت لربّ العالمين وأوصى بها إبراهيم بنيه ويعقوب يا بَنِيَّ إن الله اصطفى لكم الدّين فلا تموتُنّ إلاّ وأنتم مسلمون } فبتلك الوصية أبقى إبراهيم توحيد الله بالإلهية والعبادة في عقبه يبثونه في النّاس . ولذلك قال يوسف لصاحبيه في السجن { يا صاحبيَ السجن آربْاب متفرقون خير أم الله الواحد القهار } \\[ يوسف : 39 \\] وقال لهما { إنّي تركتُ ملة قوممٍ لا يؤمنون بالله وهم بالآخرة هم كافرون واتبعتُ ملة آبائِيَ إبراهيم وإسحاق ويعقوب ما كان لنا أن نشرك بالله من شيء } إلى قوله : { ولكن أكثر النّاس لا يعلمون } \\[ يوسف : 37 40 \\] .فضمير الرفع في { جعلها } عائد إلى إبراهيم وهو الظاهر من السياق والمناسب لقوله : { لعلهم يرجعون } ولأنه لم يتقدم اسم الجلالة ليعود عليه ضمير { جعلها } . وحكى في «الكشاف» إنه قيل : الضمير عائد إلى الله وجزم به القرطبي وهو ظاهر كلام أبي بكر بن العربي .والضمير المنصوب في قوله : { وجعلها } عائد إلى الكلام المتقدم . وأنث الضمير لتأويل الكلام بالكلمة نظراً لوقوع مفعوله الثاني لفظ { كلمة } لأن الكلام يطلق عليه { كلمة } كقوله تعالى في سورة المؤمنين ( 100 ) { إنها كلمةٌ هو قائلها } أي قولَ الكافر { رَبِّ ارجعون لعلّي أعمل صالحاً فيما تَركْتُ } \\[ المؤمنون : 99 ، 100 \\] . وقال تعالى : { كبرت كلمةٌ تخرج من أفواههم } \\[ الكهف : 5 \\] وهي قولهم : { اتّخذ الله ولداً } \\[ البقرة : 116 \\] وقد قال تعالى : { وأوصى بها إبراهيم بنيه } \\[ البقرة : 132 \\] ، أي بقَوله : { أسلمت لربّ العالمين } \\[ البقرة : 131 \\] فَأعاد عليها ضمير التأنيث على تأويل ( الكلمة ) .واعلم أنه إنّما يقال للكلام كلمة إذا كان كلاماً سائراً على الألسنة متمثلاً به ، كما في قول النبي صلى الله عليه وسلم \" أصدق كلمة قالها شاعر كلمةُ لبيد : ألاَ كلُ شيء ما خلا الله باطل \" أو كان الكلام مجعولاً شعاراً كقولهم : لا إله إلا الله كلمة الإسلام ، وقال تعالى : { ولقد قالوا كلمة الكفر } \\[ التوبة : 74 \\] » .فالمعنى : جعَل إبراهيم قوله : { إنني براءٌ مما تعبدون إلا الذي فطرني } \\[ الزخرف : 26 ، 27 \\] شعاراً لعقبه ، أي جعلها هي وما يرادفها قولاً باقياً في عقبه على مرّ الزمان فلا يخلو عقب إبراهيم من موحدين لله نابذين للأصنام . وأشعر حرف الظرفية بأن هاته الكلمة لم تنقطع بين عقب إبراهيم دون أن تعمّ العقب ، فإن أريد بالعقب مجموعُ أعقابه فإن كلمة التوحيد لم تنقطع من اليهود وانقطعت من العرب بعد أن تقلدوا عبادة الأصنام إلاّ من تَهوّد منهم أو تنصَّر ، وإن أريد مِن كُل عقب فإن العرب لم يخلو من قائم بكلمة التوحيد مثل المتنَصِّرين منهم كالقبائل المتنصرة وورقة بن نوفل ، ومثل المتحنفين كزيد بن عَمرو بن نُفيل ، وأُمية بن أبي الصلت .وذلك أن { في } ترد للتبعيض كما ذكرناه في قوله تعالى : { وارزقوهم فيها واكسوهم } في سورة النساء ( 5 ) . وقال سَبْرة بن عَمرو الفقعسي من الحماسة: ... ونَشْرب في أثمانها ونُقامروالعقب : الذرية الذين لا ينفصلون من أصلهم بأنثى ، أي جعل إبراهيم كلمة التوحيد باقية في عقبه بالوصاية عليها راجياً أنهم يرجعون ، أي يتذكرون بها التوحيد إذا رانَ رَيْن على قلوبهم ، أو استحسنوا عبادةَ الأصنام كما قال قوم موسى : { اجْعَل لنا إلها كما لهم آلهةٌ } \\[ الأعراف : 138 \\] فيهتدون بتلك الكلمة حين يضيق الزّمن عن بسط الحجة . وهذا شأن الكلام الذي يجعل شعاراً لشيء فإنه يكون أصلاً موضوعاً قد تبيّن صدقه وإصابته ، فاستحضاره يغني عن إعادة بسط الحجة له .وجملة { لعلهم يرجعون } بدل اشتمال من جملة { وجعلها كلمة باقية في عقبه } لأن جعله كلمة { إنني براء مما تعبدون } \\[ الزخرف : 26 \\] باقية في عقبه ، أراد منه مصالح لعقبه منها أنه رَجا بذلك أن يرجعوا إلى نبذ عبادة الأصنام إن فُتنوا بعبادتها أو يتذكروا بها الإقلاع عن عبادة الأصنام إن عبدوها ، فمعنى الرجوع ، العود إلى ما تدل عليه تلك الكلمة . ونظيره قوله تعالى : { وأخذناهم بالعذاب لعلهم يرجعون } \\[ الزخرف : 48 \\] ، أي لعلهم يرجعون عن كفرهم .فحرف ( لعل ) لإنشاء الرجاء ، والرجاء هنا رَجاء إبراهيم لا محالة ، فتعيّن أن يقدر معنى قوللٍ صادر من إبراهيم بإنشاء رجائه ، بأن يقدر : قال : { لعلهم يرجعون } ، أو قائلاً : { لعلهم يرجعون } . والرّجوع مستعار إلى تغيير اعتقاد طارىء باعتقاد سابق ، شبه ترك الاعتقاد الطارىء والأخذ بالاعتقاد السابق برجوع المسافر إلى وطنه أو رجوع الساعي إلى بيته .والمعنى : يرجع كل من حاد عنها إليها ، وهذا رجاؤه قد تحقق في بعض عقبه ولم يتحقق في بعضضٍ كما قال تعالى : { قال ومن ذريْتي قال لا ينال عهدي الظّالمين } \\[ البقرة : 124 \\] أي المشركين . ولعل ممن تحقق فيه رجاء إبراهيم عمود نسب النبي صلى الله عليه وسلم وإنما كانوا يكتمون دينهم تقية من قومهم ، وقد بسطتُ القول في هذا المعنى وفي أحوال أهل الفترة في هذه الآية في رسالة «طهارة النسب النبوي من النقائص» .وفي قوله : { وجعلها كلمة باقيةً في عقبه } إشعار بأن وحدانية الله كانت غير مجهولة للمشركين ، فيتجه أن الدعوة إلى العلم بوجود الله ووحدانيته كانت بالغة لأكثر الأمم بما تناقلوه من أقوال الرّسل السابقين ، ومن تلك الأمم العرب ، فيتجه مؤاخذَةُ المشركين على الإشراك قبل بعثة محمد صلى الله عليه وسلم لأنهم أهملوا النظر فيما هو شائع بينهم أو تغافلوا عنه أو أعرضوا . فيكون أهل الفترة مؤاخذين على نبذ التوحيد في الدّنيا ومعاقَبين عليه في الآخرة وعليه يُحمل ما ورد في صحاح الآثار من تعذيب عَمرو بن لُحيَ الذي سنّ عبادة الأصنام وما روي أن امرأ القيس حامل لواء الشعراء إلى النّار يوم القيامة وغير ذلك . وهذا الذي يناسب أن يكون نظر إليه أهل السنة الذين يقولون : إن معرفة الله واجبة بالشرع لا بالعقل وهو المشهور عن الأشعري ، والذين يقولون منهم : إن المشركين من أهل الفترة مخلَّدون في النّار على الشرك . وأما الذين قالوا بأن معرفة الله واجبة عقلاً وهو قول جميع المَاتريدية وبعض الشافعية فلا إشكال على قولهم .\n\n",
      "translations": [
        {
          "translation": "(And he made It) i.e. \"there is no deity except Allah\" (a word enduring) firm (among his seed) the offspring of Abraham, (that haply they might return) that his folk may return from their disbelief to the belief in Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلَهَا كَلِمَةً بَاقِيَةً } قال الإِمامُ زيد بن علي عليهما السّلامُ: هي قولُ لاَ إِله إِلاَّ الله\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And He made it a lasting word\" - Imam Zayd ibn Ali said, \"This is a saying that 'There is no god but Allah' will never cease to be true.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَجَعَلَهَا } سبحانه كلمة التوحيد { كَلِمَةً بَاقِيَةً } مستمرة { فِي عَقِبِهِ } أي: أولاد إبراهيم وذرياته إلى يوم القيامة موروثة لهم { لَعَلَّهُمْ يَرْجِعُونَ } [الزخرف: 28] إلى الله بكرامة هذه الكلمة\n ويوحدونه حق توحيده\n لذلك ما خلا زمان من الأزمنة من موحدي هذه الذرية\n وممن يدعون منهم إلى الحق وطريق توحيده\n وإن كان منهم أيضاً من يشرك بالله كمشركي قريش خذلهم اللهز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجعلها } أي: وجعل إبراهيم عليه السلام كلمة التوحيد التي تكلّم بها\n وهي قوله: { إِنني براء مما تعبدون إلا الذي فطرني } \n { كلمة باقية في عَقِبهِ } أي: في ذريته\n حيث وصَّاهم بها\n كما نطق به قوله تعالى:\n[البقرة: 132]\n فلا يزال فيهم مَن يوحّد الله تعالى\n ويدعوهم إلى توحيده\n { لعلهم يرجعون } أي: جعلها باقية في ذريته رجاء أن يرجع إليها مَن أشرك منهم بدعاء الموحّد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:17",
      "similarity": 0.6178248944236199
    },
    {
      "verse": "69:8",
      "similarity": 0.5935148924170833
    },
    {
      "verse": "37:77",
      "similarity": 0.579817100404903
    },
    {
      "verse": "74:28",
      "similarity": 0.5664746472734771
    },
    {
      "verse": "11:86",
      "similarity": 0.5319831876879108
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}