{
  "chapter": "الزخرف",
  "text": "بل متعت هؤلاء وءاباءهم حتى جاءهم الحق ورسول مبين",
  "translations": [
    {
      "translation": "I let those people and their forefathers enjoy themselves until the truth came to them and a Messenger to",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, I allowed them and their fathers to enjoy this life till the truth, and the apostle preaching it lucidly, came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Even when they began worshipping others than Allah We did not destroy them) but bestowed sustenance on them and on their forefathers until there came to them the Truth and a Messenger who clearly expounded things to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, We allowed them and their fathers to enjoy themselves until the truth and a strong Messenger came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact I gave them and their forefathers the usage of this world until the truth and the Noble Messenger who conveyed the message clearly, came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but I gave to these and their fathers to enjoy, till there came to them the truth, and a Messenger making things clear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! I gave them and their fathers to enjoy until there came to them the truth and an Apostle making manifest (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but I gave these and their fathers enjoyment of days, until the truth came unto them, and a manifest Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but I let these and their fathers enjoy life (only) till there should come unto them the Truth and a messenger making plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, I gave the good things of this life to these [men] and their fathers, until the truth came to them, and a messenger expounding things clearly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! I let these and their fathers enjoy life, until there hath come Unto them the truth and an apostle manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I provided for these and their fathers until the truth and a manifest apostle came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea, I have given the good things of this life to these (men) and their fathers, until the Truth has come to them, and a messenger making things clear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but I gave (the good things of this life) to these (polytheists) and their fathers to enjoy, till there came to them the truth (the Quran), and a Messenger (Muhammad SAW) making things clear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I gave them and their fathers days of enjoyment until the truth and a clear Messenger came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I gave these and their forefathers some enjoyment, until the truth and a manifest messenger came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, I gave enjoyment to these [people of Makkah] and their fathers until there came to them the truth and a clear Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:29] Nay, but I have let these, idolaters, and their fathers enjoy [life], without hastening to punish them, until there came to them the truth, the Qur’ān, and a messenger who makes [things] clear, one who manifests to them the stipulations of the Law — and this [messenger] is Muhammad (s).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but I let these) the people of Mecca (and their fathers) before them (enjoy life (only) till there should come unto them the Truth) the Scripture (and a messenger making plain) who explains the Truth to these people in a language they understand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكما قال سبحانه في شأنهم: { بَلْ مَتَّعْتُ هَـٰؤُلاَءِ } المسرفين المعاندين معك يا أكمل الرسل { وَ } كذا متعت { آبَآءَهُمْ } كذلك بأنواع النعم وأصناف الكرم { حَتَّىٰ جَآءَهُمُ ٱلْحَقُّ } أي: الطريق الموصل إكلى التوحيد الذاتي { وَرَسُولٌ } مرشد كامل { مُّبِينٌ } [الزخرف: 29] مظهر موضح لهم بطريق الهداية والرشاد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بل متعتُ هؤلاء } ، ضراب عن محذوف، ينساق إليه الكلام، كأنه قيل: جعلها كلمة باقية في عقبه رجاء أن يرجع إليها مَن أشرك منهم، فلم يحصل ما رجاه، بل متعتُ هؤلاء المعاصرين من أهل مكة\n { وآباءهم } بالمد في العمر، والنعمة، والمهلة، فاغترُّوا بالمهلة، وانهمكوا في الشهوات، وشُغلوا بها عن كلمة التوحيد، { حتى جاءَهم الحقُّ } القرآن { ورسولٌ مبينٌ } ظاهر الرسالة، واضحها بالمعجزات الباهرة، أو: مبين التوحيد\n بالآيات والحجج القاطعة\n وفي الآية توبيخ لهم، فإن التمتع بزيادة النعم يُوجب أن يجعلوه سبباً لزيادة الشكر، والثبات على التوحيد والإيمان، فجعلوه سبباً لزيادة أقصى مراتب الكفر والضلال",
      "translations": []
    }
  ]
}