{
  "chapter": "الزخرف",
  "text": "فانتقمنا منهم فانظر كيف كان عقبة المكذبين",
  "translations": [
    {
      "translation": "Then We punished them. So look at the fate of those who denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We exacted retribution from them. So do consider the end of those who gave the lie (to the Prophets).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took revenge on them. See how terrible the end of those who rejected (Or revelations) was!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took revenge from them – therefore see what sort of fate befell those who denied!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took revenge on them, then see what was the end of those who denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We inflicted retribution on them, then see how was the end of the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took vengeance upon them; and behold how was the end of them that cried lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We requited them. Then see the nature of the consequence for the rejecters!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We wreaked Our vengeance on them: now see what was the end of those who rejected [the Truth]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore We took revenge on them. Behold, then how hath been the end of the beliers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon We took vengeance on them; so observe how was the fate of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We exacted retribution from them: now see what was the end of those who rejected (Truth)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took revenge of them, then see what was the end of those who denied (Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took vengeance upon them, and see how the end was of those who lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We wreaked vengeance upon them. Behold, then, what was the fate of those who deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So we took retribution from them; then see how was the end of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:25] So We took vengeance on them, that is to say, on those who denied the messengers before you; behold then how was the sequel for the deniers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So We requited them) by sending punishment upon them when they denied the messengers and Scriptures. (Then see the nature of the consequence for the rejecters) then see the ultimate end of the deniers of Scriptures and messengers!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أصروا على ضلالهم، وتقليداتهم الموروثة له من آبائهم، لم ينفعهم إرشاد الرسل وإهداؤهم { فَٱنتَقَمْنَا مِنْهُمْ } فأخذناهم صاغرين { فَٱنظُرْ } أيها المعتبر الناظر { كَيْفَ كَانَ عَاقِبَةُ ٱلْمُكَذِّبِينَ } [الزخرف: 25] المصرين على التكذيب والعناد مع رسل الله، وذوي الخطر من خُلَّص عباده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فانتقمنا منهم } فعاقبناهم بما استحقوه على إصرارهم، { فانظر كيف كان عاقبةُ المكذِّبين } من الأمم المذكورين، فلا تكترث قومك\n والله تعالى أعلم\n الإشارة: وقالوا: لو شاء الرحمن ما عبدناهم، تمسّكوا بالحقيقة الظلمانية، الخالية عن التشريع، وهو كفر وزندقة، ولذلك ردّ الله عليهم بقوله: { أم آتيناهم كتاباً\n\n\n } الخ، وترى كثيراً ممن خذله الله يقول: لو أراد الله هدايتي لهداني، ولا ينفع ذلك في هذه الدار، التي هي التكليف، بل يجب عليه النهوض، والقصد إلى أمر الله به، من حقوق العبودية، فإن منعته الأقدار فلينظر إلى الواحد القهّار، وإلا فالشقاء لازم له\n وقد قالوا: مَن تحقق ولم يتشرّع فقد تزنذق، ومَن تشرَع ولم يتحقق فقد تفسّق، ومَن جمع بينهما فقد تحقّق\n فالواجب: النظر إلى تصريف الحقيقة في الباطن، والتمسُّك بالشريعة في الظاهر\n وبالله التوفيق\n وقوله تعالى: { بل قالوا إنا وجدنا آباءنا على أمة\n\n\n } الآية، فيه توبيخ لمَن تجمّد على تقليد أسلافه، وقد ظهر مَن هو أهدى منهم، ففيه نزعة جاهلية، وحمية من حميتهم\n ثم برهن على بطلان التقليد الرديء، فقال: { وَإِذْ قَالَ إِبْرَاهِيمُ لأَبِيهِ وَقَوْمِهِ }\n\n",
      "translations": []
    }
  ]
}