{
  "chapter": "الزخرف",
  "text": "وقالوا۟ لو شاء الرحمن ما عبدنهم ما لهم بذلك من علم ان هم الا يخرصون",
  "translations": [
    {
      "translation": "Yet they say: \"If Ar-Rahman had so pleased we would not have worshipped them.\" They have no knowledge of it in the least. They only make up lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “Had the Merciful One so willed, we would never have worshipped these deities.” But they have no knowledge of the matter and are simply conjecturing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pagans say, \"Had the Beneficent God wanted, we would not have worshipped them (idols).\" Whatever they say is not based on knowledge. It is only a false conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “If the Most Gracious had willed, we would not have worshipped them!” They do not know its truth at all; they only make guesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: \"If it had been the will of the Most Gracious, we should not have worshipped them.\" They have no knowledge whatsoever of that. They do nothing but lie!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: If the Beneficent Allah had pleased, we should never have worshipped them. They have no knowledge of this; they only lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Had the All-merciful so willed, we would not have served them.' They have no knowledge of that; they are only conjecturing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: If the Beneficent One had (so) willed, we should not have worshipped them. They have no knowledge whatsoever of that. They do but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"If the All Merciful had so willed, we would not have worshipped them.\" They have no knowledge of that. They are only conjecturing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: had the Compassionate willed we should not have worshipped them. They have no knowledge thereof; they are only guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Had the All-beneficent wished, we would not have worshipped them.’ They do not have any knowledge of that, and they do nothing but surmise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(\"Ah!\") they say, \"If it had been the will of (Allah) Most Gracious, we should not have worshipped such (deities)!\" Of that they have no knowledge! they do nothing but lie!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: \"If it had been the Will of the Most Beneficent (Allah), we should not have worshipped them (false deities).\" They have no knowledge whatsoever of that. They do nothing but lie!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Had it been the will of the Merciful, we would never have worshipped them' Of this they have no knowledge, they are but guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Had the Most Gracious willed, we would not have worshiped them.” But they have no knowledge of that; they are merely guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, \"If the Most Merciful had willed, we would not have worshipped them.\" They have of that no knowledge. They are not but falsifying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:20] And they say, ‘Had the Compassionate One [so] willed, we would not have worshipped them’, the angels: therefore our worship of them happens by His will and so He must be satisfied with it. God, exalted be He, says: They do not have any knowledge of that, which is said of His being satisfied with the worship of these [angels]; and they are only surmising, inventing lies in this [respect] and so punishment will befall them as a result thereof.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they) i.e. the Banu Malih (say: If the Beneficent One had (so) willed) if the Beneficent one had repelled and warned us, (we should not have worshipped them) they said this out of mockery, \"but He commanded us to worship them and never warned us against such a worship\". (They have no knowledge whatsoever of that) they have no proof or warrant for what they say. (They do but guess) they do but lie against Allah because they were forbidden from worshipping them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وقالوا لو شَاءَ الرَّحمن ما عَبَدْناهم } لما سمعوا من الأنبياء تعليق الأشيءا بمشيئة الله تعالى افترضوه وجعلوه ذريعة في الإنكار، وقالوا ذلك لا عن علم وإيقان بل على سبيل العناد والإفحام، ولهذا ردّهم الله تعالى بقوله: { ما لَهُم بذلِكَ مِن عِلم } إذ لو علموا ذلك لكانوا موحدين لا ينسبون التأثير إلا إلى الله فلا يسعهم إلا عبادته دون غيره إذ لا يرون حينئذ لغيره نفعاً ولا ضراً { إنْ هم إلاَّ يخرصون } لتكذيبهم أنفسهم في هذا القول بالفعل حين عظموهم وخافوهم وخوّفوا أنبياءهم من بطشهم كما قال قوم هود:\n\n[هود، الآية:54]، ولما خوّفوا إبراهيم عليه السلام كيدهم أجاب بقوله:\n\n[الأعراف، الآية:80] إلى قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سفَّه المسلمون أهل الشرك وعيروهم باتخاذ الملائكة والأوثان والأصنام، وجميع المعبودات الباطلة آلهة من دونه الله، شركاء له في الألوهية، مع كونهم منحطين عن رتبة الألوهية والربوبية مطلقاً { قَالُواْ } مستدلين على أخذهم واتخاذهم: { لَوْ شَآءَ } وأراد { ٱلرَّحْمَـٰنُ } عدم أخذنا وعبادتنا إياهم { مَا عَبَدْنَاهُمْ } ألبتة، لكن أراد سبحانه عبادتنا فعبدناهم؛ إذ لا يبدل قوله سبحانه ولا يغير حكمه ومشيئته، إنما قالوا ما قالوا تهكماً واستهزاءً، وعلى زعم المؤمنين، لا عن اعتقاد ويقين بمشيئة الله وتقديره، وعدم تغيير مراده سبحانه؛ لذلك جعلهم سبحانه بقوله: { مَّا لَهُم بِذَلِكَ مِنْ عِلْمٍ } أي: ما صدر عنهم هذا الاستدلال عن علم بمقدماته واعتقاد بنتيجته، بل { إِنْ هُمْ } أي: ما هم في قولهم هذا واستدلالهم { إِلاَّ يَخْرُصُونَ } [الزخرف: 20] يتمحلون تمحلاً باطلاً، ويتزورون زوراً ظاهراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقالوا لو شاء الرحمنُ } عدم عبادتنا للملائكة { ما عبدناهم } ، أرادوا بذلك بيان أن ما فعلوه مَرْضِي عنده تعالى، ولولا ذلك ما خلّى بينهم وبينها، ويُجاب: بأنه تعالى قد يخلي بين العبد ومعصيته، لينفذ فيه ما سبق من درك الوعيد\n وتعلقت المعتزلة بظاهر الآية في أن الله تعالى لم يشأ الكفر من الكفار، وإنما شاء الإيمان، فإنّ الكفار ادّعوا أن الله شاء منهم الكفر، وما شاء منهم ترك عبادة الأصنام، حيث قالوا: { لو شاء الرحمن ما عبدناهم } أي: لو شاء بنا أن نترك عبادة الأصنام لمَنَعَنَا عن عبادتها، لكنه لم يشأ ذلك\n والله تعالى ردّ عليهم قولهم، واعتقادهم، بقوله: { ما لهم بذلك } القول { من علم إِن هم إِلا يَخْرُصُون }: يكذبون، ومعنى الآية عندنا: أنهم أرادوا بالمشيئة: الرضا، وقالوا: لو لم يرضَ بذلك لعجّل عقوبتنا، ولمَنعنا من عبادتها مع قهر واضطرار، وإذ لم يفعل ذلك فقد رضي بذلك، فردَّ الله عليهم بقوله: { ما لهم بذلك من علم\n\n\n } الآية\n أو: قالوا هذا القول استهزاء، لا جدّاً واعتقاداً، فأكذبهم وجهّلهم حيث لم يقولوه اعتقاداً، كما قالوا:\n\n[يس: 47]\n وهذا كلام حق أرادوا به باطلاً: انظر النسفي",
      "translations": []
    }
  ]
}