{
  "chapter": "الزخرف",
  "text": "ولن ينفعكم اليوم اذ ظلمتم انكم فى العذاب مشتركون",
  "translations": [
    {
      "translation": "It will not benefit you today, since you did wrong, that you share equally in the punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But nothing will avail you on that day, for you were unjust, and you will be partners in the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He will then be told): “Today it will not benefit you the least that after your wrong-doing you and your satans now share the chastisement.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told on the Day of Judgment, \"Regret will never be of any benefit to you. You have done injustice to your souls and you will share the torment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said to them) “And you will not benefit from them this day, whereas you are unjust – for you are all partners in the punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will profit you not this Day as you did wrong, (and) that you will be sharers in the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And since you were unjust, it will not profit you this day that you are sharers in the chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall not profit you today, since you did evil, that you are partners in the chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it profiteth you not this day, because ye did wrong, that ye will be sharers in the doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said [to such a person], \"You have done wrong. Having partners in punishment will be of no avail to you today.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it Will profit you not today, because ye have done wrong, that ye are in the torment sharers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Today that will be of no avail to you. As you did wrong, so will you share in the punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye have done wrong, it will avail you nothing, that Day, that ye shall be partners in Punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will profit you not this Day (O you who turn away from Allah's remembrance and His worship, etc.) as you did wrong, (and) that you will be sharers (you and your Qarin) in the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the harm you did, it would be of no benefit to you today, you are partners in the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will not benefit you on that Day, since you did wrong. You are partners in the suffering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never will it benefit you that Day, when you have wronged, that you are [all] sharing in the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:39] And it, your wishes or your remorse, will not benefit you, blind ones, this day, given that you did wrong, that is to say, [given that] it has become clear to you that you were wrongdoers, through your idolatry in this world, that you, together with your companions, will be sharing in the chastisement (this constitutes the justification, on the basis of an implied lām [sc. li-annakum …], for the ‘lack of benefit’; idh substitutes for alyawma, ‘this day’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it profiteth you not) Allah says: it profits you not (this day) such talk, (because ye did wrong) because you disbelieved in the life of the world, (that ye will be sharers in the doom) the devils and the children of Adam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قيل لهم حينئذٍ من قبل الحق: { لَن يَنفَعَكُمُ ٱلْيَوْمَ } تمنيكم وأسفكم { إِذ } قد { ظَّلَمْتُمْ } أنفسكم في نشأة التدارك والتلافي، والآن قد انقرضت، بل { أَنَّكُمْ } وقرناءكم اليوم { فِي ٱلْعَذَابِ } النازل عليكم { مُشْتَرِكُونَ } [الزخرف: 39] كما إنكم كنتم مشتركون في الأسباب الجالبة له في النشأة الأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { ولن ينفعكم اليومَ } أي: يوم القيامة { إِذ ظلمتمْ } أي: حين صحّ وتبيّن ظلمكم وكفركم، ولم تبقَ لكم ولا لأحد شبهة في أنكم كنتم ظالمين\n و \" إذ \": بدل من اليوم\n وقوله: { أنكم في العذاب مشتركون }: فاعل ينفع، أي: لن ينفعكم يوم القيامة اشتراككم في العذاب، كما كان في الدنيا يُهون عليكم المصيبة اشتراككم فيها، لتعاونكم في تحمُّل أعبائها وتقسيمكم لعنائها، ولذلك قيل: المصيبة إذا عمّت هانت، وإذا خصت هالت، وفي ذلك تقول الخنساء:\n\nأما هؤلاء فلا يؤسّيهم اشتراكهم، ولا يُروّحهم، لأن بكلٍّ منهم ما لا تبلغه طاقة، وقد ورد أنهم يكونون في توابيت من نار، لا يرى أحد صاحبَه، بل يظن أنه وحده فيها\n وقيل: الفاعر مضمر، أي: ولن ينفعكم هذا التمني، أو هذا الاعتذار لأنكم في العذاب مشتركون لاشتراككم في سببه، وهو الكفر، ويؤيده: قراءة مَن قرأ: \" إنكم \" بالكسر\n وكان صلى الله عليه وسلم يُبالغ في المجاهدة في دعاء قومه، وهم لا يزيدون إلا غيّاً وتعامياً عما يشهدونه من شواهد النبوة، وتصامماً عما يسمعونه من القرآن، فأنزل الله تعالى: { أفأنت تُسْمِعُ الصمَّ أو تهدي العُمْيَ } ، وهو إنكار وتعجيب من أن يكون هو الذي يقدر على هدايتهم، وقد تمرّنوا في الكفر، واستغرقوا في الضلال، حيث صار ما بهم من العشي عَماً مقروناً بالصمم، أي: أفأنت تقدر أن تُسمع مَن فقد سمع القبول، أو تهدي مَن فقد بصر الاستبصار\n { ومَن كان في ضلالٍ مبين } أي: ومَن كان في علم الله أنه يموت على الضلال\n ومدار الإنكار هو التمكُّن والاستقرار في الضلال المفرط، بحيث لا ارعواء له منه، لا توهم القصور من قبل الهَادي، ففيه رمز في أنه لا يقدر على ذلك إلا الله\n\n",
      "translations": []
    }
  ]
}