{
  "chapter": "الزخرف",
  "text": "انا جعلنه قرءنا عربيا لعلكم تعقلون",
  "translations": [
    {
      "translation": "We have made it an Arabic Qur'an so that hopefully you will use your intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We made it a distinctly lucid Qur'an that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "verily We have made it an Arabic Qur'an that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made it an Arabic reading text so that perhaps you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent it as a Qur’an in the Arabic language, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have made it a Qur'an in Arabic that you may be able to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have made it an Arabic Quran that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "behold, We have made it an Arabic Koran; haply you will understand;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have appointed it a Lecture, in Arabic that haply ye may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made it an Arabic Quran so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have made it an Arabic Qur'an that haply ye may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made it an Arabic Quran so that you may exercise your reason,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made it a Qur'an in Arabic, that ye may be able to understand (and learn wisdom).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We verily, have made it a Quran in Arabic, that you may be able to understand (its meanings and its admonitions).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made it an Arabic Koran in order that you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made it an Arabic Quran, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have made it an Arabic Qur'an that you might understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:3] Lo! We have made it, We have brought the Book into existence [as], an Arabic Qur’ān, in the language of the Arabs, that perhaps you, O people of Mecca, may understand, [that you may] comprehend its meanings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّا جَعَلْنَاهُ قُرْآَنًا عَرَبِيًّا لَعَلَّكُمْ تَعْقِلُونَ (3)وفي جَعل المقسَم به القرآن بوصف كونه مبيناً ، وجَعْللِ جواب القسم أن الله جعله مُبيناً ، تنويه خاص بالقرآن إذ جُعل المقسم به هو المقسم عليه ، وهذا ضرب عزيز بديع لأنه يُومىء إلى أن المقسم على شأنه بلغ غاية الشرف فإذا أراد المقسِم أن يقسم على ثبوت شرف له لم يجد ما هو أوْلى بالقسم به للتناسب بين القَسَم والمقسم عليه . وجعل صاحب «الكشاف» من قبيله قولَ أبي تمام: ... وثَنَايَاككِ إِنها اغْرِيضُوَلآللٍ تُؤْمٌ وبَرقٌ ومَيضُ ... إذْ قدر الزمخشري جملة ( إنها اغريض ) جواب القسم وهو الذي تبعه عليه الطيبي والقزويني في شرحيهما «للكشاف» ، وهو ما فسر به التبريزي في شرحه لديوان أبي تمام ، ولكن التفتزاني أبطل ذلك في شرح «الكشاف» وجعل جملة ( إنها اغريض ) استئنافاً أي اعتراضاً لبيان استحقاق ثناياها أن يُقسم بها ، وجعل جواب القسم قوله بعد أبيات ثلاثة: ... لَتَكَادْنَي غِمارٌ من الأحْداث لمْ أدْرِ أيَّهُن أخوضُ ... والنكت والخصوصيات الأدبية يَكفي فيها الاحتمال المقبول فإن قوله قبله: ... وارتكاضضِ الكرى بعينيككِ في النوم فنوناً وما بعيني غموض ... يجوز أن يكون قَسَماً ثانِياً فيكون البيت جواباً له .وإطلاق اسم الكتاب على القرآن باعتبار أن الله أنزله ليكتب وأنَّ الأمة مأمورون بكتابته وإن كان نزوله على الرّسول صلى الله عليه وسلم لفظاً غير مكتوب . وفي هذا إشارة إلى أنه سيكتب فى المصاحف ، والمراد ب { الكتاب } ما نَزل من القرآن قبلَ هذه السورة وقد كتَبه كتَّاب الوحي .وضمير { جعلناه } عائد إلى { الكتاب } ، أي إنا جعلنا الكتاب المبينَ قرآناً والجعل : الإيجاد والتكوين ، وهو يتعدّى إلى مفعول واحد .والمعنى : أنه مقروء دون حضور كتاب فيقتضي أنه محفوظ في الصدور ولولا ذلك لما كانت فائدة للإخبار بأنه مقروء لأن كل كتاب صالح لأن يقرأ . والإخبار عن الكتاب بأنه قرآن مبالغة في كون هذا الكتاب مقروءاً ، أي ميسّراً لأنْ يُقرأ لقوله : { ولقد يسّرنا القرآن للذكر } \\[ القمر : 17 \\] وقوله : { إنّ علينا جمعَه وقُرآنه } \\[ القيامة : 17 \\] . وقوله : { إنّا نحن نزلنا الذكر وإنّا له لحافظون } \\[ الحجر : 9 \\] .فحصل بهذا الوصف أن الكتاب المنزل على محمد صلى الله عليه وسلم جامع لوصفين : كونِه كتاباً ، وكونه مقروءاً على ألسنة الأمة .وهذا مما اختص به كتاب الإسلام . و { عربياً } نسبة إلى العرب ، وإذ قد كان المنسوب كتاباً ومقروءاً فقد اقتضى أن نسبته إلى العرب نسبة الكلام واللّغةِ إلى أهلها ، أي هو مما ينطق العرب بمِثل ألفاظه ، وبأنواع تراكيبه .وانتصب { قرآناً } على الحال من مفعول { جعلناه } .ومعنى جعله { قرآناً عربياً } تكوينه على ما كُونت عليه لغة العرب ، وأن الله بباهر حكمتِه جعل هذا الكتاب قرآناً بلغة العرب لأنها أشرف اللّغات وأوْسعها دلالة على عديد المعاني ، وأنزله بين أهل تلك اللّغة لأنهم أفهم لدقائقها ، ولذلك اصطفى رسوله من أهل تلك اللّغة لتتظاهر وسائل الدلالة والفهم فيكونوا المبلغين مرادَ الله إلى الأمم . وإذا كان هذا القرآن بهاته المثابة فلا يأبَى مِن قبوله إلا قوم مسرفون في الباطل بُعداءُ عن الإنصاف والرشد ، ولكن الله أراد هديهم فلا يقطع عنهم ذكره حتى يتمّ مراده ويكمُل انتشار دينه فعليهم أن يراجعوا عقولهم ويتدبروا إخلاصهم فإن الله غير مُؤاخِذِهم بما سلف من إسرافهم إن هم ثَابُوا إلى رشدهم .والمقصود بوصف الكتاب بأنه عربي غَرضان : أحدهما التنويه بالقرآن ، ومدحه بأنه منسوج على منوال أفصح لغة ، وثانيهما التورّك على المعاندين من العرب حين لم يتأثروا بمعانيه بأنهم كمن يسمع كلاماً بلغة غير لغته ، وهذا تأكيد لما تضمنه الحرفان المقطعان المفتتحة بهما السورة من معنى التحدّي بأن هذا كتاب بلغتكم وقد عجزتم عن الإتيان بمثله .وحَرْف ( لعلّ ) مستعار لمعنى الإرادة وتقدم نظيره في قوله : { لعلكم تعقلون } في أوائل سورة البقرة ( 73 ) .والعقل الفهم . والغرض : التعريضُ بأنهم أهملوا التدبر في هذا الكتاب وأن كماله في البيان والإفصاح نستأهل العناية بِه لا الإعراض عنه فقوله : { لعلكم تعقلون } مشعر بأنهم لم يعقلوا .والمعنى : أنّا يسرنا فهمه عليكم لعلكم تعقلون فأعرضتم ولم تعقلوا معانيه ، لأنه قد نزل مقدار عظيم لو تدبروه لعقلوا ، فهذا الخبر مستعمل في التعريض على طريقة الكناية .\n\n",
      "translations": [
        {
          "translation": "(Lo! We have appointed it) We have spoken it, i.e. the Qur'an (a Lecture in Arabic) in the Arabic usage, hence the oath, (that haply ye may understand) so that you may know what is in the Qur'an of the lawful and unlawful, commands and prohibitions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n حاصراً للصفات الإلهية والمراتب الوجودية والكمالية { عربيّاً لعلّكم تعقلون } ما نخاطبكم به\n { وإنّه في أمّ الكتاب } أي: أصل الوجود في الرتبة الأولى وأول نقطة الوجود الإضافي الممتاز بالتعين الأول عن الوجود المطلق التالي للهوية المحضة المشار إليه بقوله: { لدينا لعلي } رفيع القدر بحيث لا رفعة وراءها { حكيم } ذو الحكمة إذ به ظهرت صور الأشياء وحقائقها أعيانها وصفاتها وترتيب الموجودات ونظامها على ما هي عليه\n وأما على الوجه الثاني فلا يستقيم هذا التأويل\n بل هو القرآن المبين للتوحيد والتفصيل الدال عليهما\n المقسم به إجمالاً { وإنه في أمّ الكتاب } أي: الروح الأعظم المشتمل على كل العلوم بل كل الأشياء لدينا قريباً منا أقرب من سائر العلوم الحاصلة في مراتب التنزلات\n فإن العلم اللدني هو الذي أنتقش في الروح الذي هو أول الأرواح قبل تنزّله في المراتب\n وكون القرآن ذا الحكمة كونه مشتملاً على الحكمة النظرية المفيدة للاعتقادات الحقّة من التوحيد والنبوّة وبيان أحوال المعاد وأمثالها\n فالحكمة العملية من بيان أحكام أفعال المكلفين كالشرائع وكيفية السلوك في المراتب وأحوال المكاسب والمواهب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتبياناً { عَرَبِيّاً } أسلوباً ونظماً { لَّعَلَّكُمْ تَعْقِلُونَ } [الزخرف: 3] وتفهمون ما فيه من الأسرار العجيبة والحكم البديعة والرموز والإشارا التي خلت عنها الكتب السالفة\n\n\n{ وَإِنَّهُ } أي: الشأن المندرج فيه\n والمرموز إليه من جملة ما هو كائن مثبت { فِيۤ أُمِّ ٱلْكِتَابِ } الذي هو حضرة العلم ولوح القضاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:2",
      "similarity": 0.9607492263357608
    },
    {
      "verse": "41:3",
      "similarity": 0.6425590303200397
    },
    {
      "verse": "20:113",
      "similarity": 0.5295983162388056
    },
    {
      "verse": "26:195",
      "similarity": 0.5049394179774109
    },
    {
      "verse": "56:37",
      "similarity": 0.5019884719508791
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}