{
  "chapter": "الزخرف",
  "text": "وزخرفا وان كل ذلك لما متع الحيوة الدنيا والءاخرة عند ربك للمتقين",
  "translations": [
    {
      "translation": "and gold ornaments. All that is merely the trappings of the life of this world. But the Next World with your Lord is for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ornaments of gold. But all this would have been nothing but the vanity of this world. The Hereafter with your Lord is for those who take heed for themselves and follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or that they be made of gold. Surely all this is only the enjoyment of the life of the world. But (true prosperity) in the Hereafter with Your Lord is only for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and other ornament of gold. All these are only the means of enjoyment in this world, but the pious will receive their reward from your Lord in the life hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And diverse adornments; and all this is usage only of the life of this world; and the Hereafter with your Lord, is for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And adornments of gold. Yet all this would have been nothing but an enjoyment of this world. And the Hereafter with your Lord is for those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (other) embellishments of gold; and all this is naught but provision of this world's life, and the hereafter is with your Lord only for those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and ornaments; surely all this is but the enjoyment of the present life, and the world to come with thy Lord is for the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ornaments of gold. Yet all that would have been but a provision of the life of the world. And the Hereafter with your Lord would have been for those who keep from evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and ornaments of gold. But all of these are but the provision of this present life; it is the life to come that the Lord reserves for those who fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ornament of gold. And yet all that would have been but a pro vision Of the life of the World; and the Hereafter with thy Lord is for the Godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and ornaments of gold; yet all that would be nothing but the wares of the life of this world, and the Hereafter is for the Godwary near your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also adornments of gold. But all this were nothing but conveniences of the present life: The Hereafter, in the sight of thy Lord is for the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And adornments of gold. Yet all this (i.e. the roofs, doors, stairs, elevators, thrones etc. of their houses) would have been nothing but an enjoyment of this world. And the Hereafter with your Lord is only for the Muttaqun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gold, surely, all this is but the enjoyment of this present life. The Everlasting Life with your Lord is for those who fear (Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And decorations. Yet all that is nothing but the stuff of this life. Yet the Hereafter, with your Lord, is for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And gold ornament. But all that is not but the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:35] and ornaments, gold: in other words, were it not for fear that a believer might disbelieve as a result of Our   giving the disbeliever what has been mentioned, We would have given him such [luxuries], since the [affairs of this] world represent no danger to Us and he [the disbeliever] would then have no share in the Bliss of the Hereafter. Yet surely (wa-in: in is softened from the hardened form [inna]) all that would be nothing (read lamā, with the mā as extra; or read lammā to mean ‘but’, making the particle in for negation) but the [transient] enjoyment of the life of this world, enjoyed during it, but then perishes, and the Hereafter, Paradise, with your Lord is for the God-fearing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ornaments of gold) and all the gold and silver utensils of their houses. (Yet all that would have been but a provision of the life of the world) yet all that would be but the stuff of the life of the world. (And the Hereafter) i.e. Paradise (with your Lord would have been for those who keep from evil) for those who ward off disbelief, idolatry and indecencies; this is much better than the stuff of the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَزُخْرُفاً } معناه ذَهَبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And {in adornment}\" means \"going forth.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: لوسعنا عليهم حطام الدنيا إلى حيث جعلنا لهم { زُخْرُفاً } وزينة من الذهب والفضة يتزينون بها\n ويتلذذون بلذاتها الفانية وشهواتها الزائلة الزائفة\n المبعدة عن اللذات الباقية الأخروية\n لكن لو فعلنا كذلك لمالَّ إليها المسلمون\n وتحسروا بما نالوا\n فضعف رأيهم في اتباع الدين القويم والصراط المستقيم\n\n\n{ وَ } بالجملة: { إِن كُلُّ ذَلِكَ لَمَّا مَتَاعُ ٱلْحَيَاةِ ٱلدُّنْيَا } أي: ما كل ذلك المذكور من المزخرفات الدنيوية إلا متاع الحياة الدنيا الفانية\n لا قرار لها\n ولا مدار لما فيها\n ولما يترتب عليها من اللذات والشهوات { وَ } النشأة { ٱلآخِرَةُ } الباقية الدائمة لذاتها أزلاً وأبداً { عِندَ رَبِّكَ } يا أكمل الرسل حاصلة { لِلْمُتَّقِينَ } [الزخرف: 35] الذين يحفظون نفوسهم وعن التلطخ بقاذورات الدنيا\n والركون إلى مزخرفاتها الفانية\n سوى سد جوعةٍ لبس خرقةٍ وكنٍّ يدفعون بها ضرر الحر والبرد\n ولا يميلون إلى ما سواها طلباً لمرضاة الله وهرباً عن مساخطه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وزُخرفاً } أي: وجعلنا لهم زخرفاً\n أي: زينةً من كل شيء\n والزخرف: الذهب والزينة\n ويجوز أن يكونَ الأصلُ: سقفاً من فضة وزخرف\n أي: بعضها من فضة\n وبعضها مِن ذهب\n فنُصب عطفاً على محل \" مِن فضة \"\n { وإِن كُلُّ ذلك لَمَّا متاعُ الحياةِ الدنيا } أي: وما كل ما ذكر من البيوت الموصوفة بما ذكر من الزخارف الغرارة\n إلا شيء يتمتع به في الحياة الدنيا\n ثم يفنى وتبقى تبعته\n { والآخرةُ } أي: ونعيم الآخرة الذي يقصر عنه البيان: خير { عند ربك للمتقين } الكفر والمعاصي\n وبهذا يتبين أن العظيم إنما هو العظيم في الآخرة\n لا في الدنيا\n ولذلك لم يجعل للمؤمنين فيها حظاً وافراً لأنه تمتع قليل بالنسبة إلى ما لهم في الآخرة\n ولأنه ربما يشغلهم عن ذكر الرحمن\n كما أشار إليه بقوله: { ومَن يَعْشُ\n\n\n } الخ\n الإشارة: في الآية ذم للدنيا ولمَن اشتغل بها\n وفي الحديث:\n \" لو كانت الدنيا تزن عند الله جناح بعوضة ما سقي كافراً منها شربة ماء \" \nوعن علقمة عن ابن مسعود رضي الله عنه قال: اضطجع رسول الله صلى الله عليه وسلم على حصيرٍ\n فأثَّرَ الحصيرُ في جَنْبِه\n فلما استيقظ\n جعلتُ أمسح عنه\n وأقول: يا رسول الله ألا آذنتني قبل أن تنام على هذه الحصيرة\n فأبسط عليه شيئاً\n فقال رسول الله صلى الله عليه وسلم:\n \" ما لي وللدنيا\n وما للدنيا وما لي\n ما أنا والدنيا إلا كراكبٍ استظلَّ في فيء\n أو ظل شجرةٍ\n ثم راح وتركها \" \nورُوي أن عيسى عليه السلام أخذ لبنة من طوب\n فجعلها تحت رأسه\n فجاءه جبريل عليه السلام\n فوكز الطوية من تحت رأسه\n ونزعها\n وقال:\n \" اترك هذه مع ما تركتَ \" \nوأنشدوا في هذا المعنى:\nوقال صلى الله عليه وسلم:\n \" الدنيا خراب\n وأخرب منها قلب مشتغل بها \" \nومَن اشتغل بها غَفَلَ عن ذكر الرحمن\n وسُلط عليه الشيطان\n كما قال تعالى: { وَمَن يَعْشُ عَن ذِكْرِ ٱلرَّحْمَـٰنِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:112",
      "similarity": 0.6888921859113386
    },
    {
      "verse": "17:93",
      "similarity": 0.5067080506446033
    },
    {
      "verse": "10:24",
      "similarity": 0.3373920393913348
    },
    {
      "verse": "40:39",
      "similarity": 0.17946597051588234
    },
    {
      "verse": "42:36",
      "similarity": 0.17326948962357755
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/43:35.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/43:35.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/43:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}