{
  "chapter": "الزخرف",
  "text": "حتى اذا جاءنا قال يليت بينى وبينك بعد المشرقين فبئس القرين",
  "translations": [
    {
      "translation": "so that, when he reaches Us, he says, 'If only there was the distance of the two Easts between you and",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he comes before Us he will say (to the devil): \"Would to God there was a distance of the East and West between you and me, for you were an evil companion!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he comes to Us, he will say (to his satan): “Would that there had been between me and you the distance as between the East and the West. How evil a companion you were!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he returns to us, he will say (to satan), \"Would that there had been as long a distance between me and you as that between the East and West. What a terrible companion you have been\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when the disbeliever will be brought to Us, he will say to his devil, “Alas – if only there was the distance* of east and west, between you and me!” – so what an evil companion** he is! (* Had I not listened to you. **They will be bound together in chains.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when (such a one) comes to Us, he says, \"Would that between me and you were the distance of the two easts (or the east and west) a worst companion (indeed)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he comes to Us, he says: O would that between me and you there were the distance of the East and the West; so evil is the associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "till, when he comes to Us, he says, 'Would there had been between me and thee the distance of the two Easts!' An evil comrade!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when he cometh unto Us, he saith (unto his comrade): Ah, would that between me and thee there were the distance of the two horizons - an evil comrade!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When such a person comes to Us, he will say [to his comrade], \"If only you had been as far away from me as east is from west. What an evil comrade!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he cometh Unto Us, he will say. Ah! would that there had been between me and thee, the distance of the east and the west an evil companion\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he comes to Us, he will say, ‘I wish there had been between me and you the distance between the east and the west! What an evil companion [you are]!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, when (such a one) comes to Us, he says (to his evil companion): \"Would that between me and thee were the distance of East and West!\" Ah! evil is the companion (indeed)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when (such a one) comes to Us, he says [to his Qarin (Satan / devil companion)] \"Would that between me and you were the distance of the two easts (or the east and west)\" a worst (type of) companion (indeed)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he comes before Us, he shall say: 'Would that there had been between me and you, the distance of the two Easts' Evil is the companion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when He comes to Us, he will say, “If only there were between me and you the distance of the two Easts.” What an evil companion!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he comes to Us [at Judgement], he says [to his companion], \"Oh, I wish there was between me and you the distance between the east and west - how wretched a companion.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:38] until when he comes to Us, such a blind one, together with his companion, on the Day of Resurrection, he says, to him: ‘O (yā is for calling attention) would that there were between me and you the distance of the two easts!’, that is to say, like the distance between the east and the west, What an evil companion then!, you are for me. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till, when he) i.e. the son of Adam along with his comrade the devil, tied to one chain (cometh unto Us, he saith) unto his devil comrade: (Ah, would that between me and thee there were the distance of the two horizons, an evil comrade) and friend!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا جَآءَنَا } أي: الغاشي الأعمى، وعلم ضلاله عنَّا، وغوايته عن طريقنا { قَالَ } متحسراً متأسفاً لقرينه المغوي: { يٰلَيْتَ بَيْنِي وَبَيْنَكَ بُعْدَ ٱلْمَشْرِقَيْنِ } أي: بُعد ما بين المشرق والمغرب { فَبِئْسَ ٱلْقَرِينُ } [الزخرف: 38] أنت أيها المضل، أضللتني عن الطريق القويم وابتليتني بالعذاب الأليم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nوصيغة المضارع في الأفعال الأربعة للدلالة على الاستمرار التجديدي، لقوله: { حتى إِذا جاءنا } فإن \" حتى \" تقتضي أن تكون غاية لأمر ممتد، أي: يستمر العاشون على ما ذكر من مقارنة الشياطين والصد والحسبان الباطل، حتى إذا جاءنا كل واحد منهم مع قرينه يوم القيامة\n ومَن قرأ بالتثنية، فالمراد العاشي وقرينه\n قال مخاطباً لقرينه: { يا ليتَ بيني وبينك } في الدنيا { بُعد المشرقين } أي: بُعد المشرق والمغرب، أي: تباعد كل منهما من صاحبه، فغلب المشرق على المغرب، كما قيل: القَمَران والعُمرَان، وأضيف البُعد إليهما، { فبئس القرينُ } أنت",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:26",
      "similarity": 0.5169050396963121
    },
    {
      "verse": "69:27",
      "similarity": 0.5120807938202033
    },
    {
      "verse": "89:24",
      "similarity": 0.4984184990199775
    },
    {
      "verse": "33:66",
      "similarity": 0.47936930298963665
    },
    {
      "verse": "37:5",
      "similarity": 0.46084117227279786
    }
  ]
}