{
  "chapter": "الزخرف",
  "text": "ومن يعش عن ذكر الرحمن نقيض له شيطنا فهو له قرين",
  "translations": [
    {
      "translation": "If someone shuts his eyes to the remembrance of the All-Merciful, We assign him a shaytan who becomes his bosom friend -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall attach to him who goes blind to the remembrance of Ar-Rahman a devil as companion, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who is negligent to remember the Merciful One, to him We assign a satan as his boon companion,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall make satan the companion of whoever ignores the remembrance of the Beneficent God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever is averse to the Remembrance of the Most Gracious, We appoint a devil upon him, who stays with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever Ya`shu (turns away blindly) from the remembrance of the Most Gracious, We appoint for him Shaytan to be a Qarin (a companion) to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever turns himself away from the remembrance of the Beneficent Allah, We appoint for him a Shaitan, so he becomes his associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso blinds himself to the Remembrance of the All-merciful, to him We assign a Satan for comrade;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whose sight is dim to the remembrance of the Beneficent, We assign unto him a devil who becometh his comrade;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for one who turns away from the remembrance of the Gracious God, We appoint for him a devil, who will become his intimate companion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever blindeth himself to the admonition of the Compassionate, We assign Unto him a Satan, and he becometh his companion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We assign a devil to be the companion of him who turns a blind eye to the remembrance of the All-beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone withdraws himself from remembrance of (Allah) Most Gracious, We appoint for him an evil one, to be an intimate companion to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever turns away (blinds himself) from the remembrance of the Most Beneficent (Allah) (i.e. this Quran and worship of Allah), We appoint for him Shaitan (Satan - devil) to be a Qarin (an intimate companion) to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whosoever blinds himself from the Remembrance of the Merciful, We shall assign him a satan so he is his companion,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever shuns the remembrance of the Most Gracious, We assign for him a devil, to be his companion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:36] And whoever withdraws from, [whoever] is oblivious, to the Remembrance of the Compassionate One, namely, the Qur’ān, We assign, We produce, for him a devil and he becomes his companion, never leaving his side.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَنْ يَعْشُ عَنْ ذِكْرِ الرَّحْمَنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ (36)ابتدئت السورة بالتنويه بالقرآن ووصفِه بأنه ذكر وبيان للنّاس ، ووصف عناد المشركين في الصدّ عنه والإعراض ، وأُعلموا بأن الله لا يتركُ تذكيرهم ومحاجّتهم لأنّ الله يدعو بالحق ويعد به .وأطنب في وصف تناقض عقائدهم لعلهم يستيقظون من غشاوتهم ، وفي تنبيههم إلى دلائل حقّيّة ما يدعوهم إليه الرّسول صلى الله عليه وسلم بهذا القرآن ، وفُضحت شبهاتهم بأنهم لا تعويل لهم إلا على ما كان عليه آباؤهم الأولون الضالّون ، وأنذروا باقتراب انتهاء تمتيعهم وإمهالهم ، وتقضى ذلك بمزيد البيان ، وأفضى الكلام إلى ما قالوه في القرآن ومن جاء به بقوله : { ولما جاءهم الحق قالوا هذا سحر إلى قوله عظيم } \\[ الزخرف : 30 ، 31 \\] ، وما ألحق به من التكملات ، عاد الكلام هنا إلى عواقب صرفهم عقولهم عن التدبر في الدعوة القرآنية فكان انصرافهم سبباً لأن يسخر الله شياطين لهم تلازمهم فلا تزال تصرفهم عن النظر في الحق وأدلة الرشد . وهو تسخير اقتضاه نظام تولد الفروع من أصولها ، فلا يتعجب من عمى بصائرهم عن إدراك الحق البيّن ، وهذا من سنة الوجود في تولد الأشياء من عناصرها فالضلال ينمى ويتولد في النفوس ويتمكن منها مرة بعد مرة حتى يصير طبْعاً على القلب وأكنَّة فيه وختماً عليه ولا يضعُف عمل الشيطان إلا بتكرر الدعوة إلى الحق وبالزجر والإنذار ، فمن زناد التذكير تنقدح شرارات نور فربّما أضاءت فصادفت قوةُ نور الحق حالةَ وهَن الشيطان فتتغلب القوة المَلكية على القوة الشيطانية فيفيق صاحبها من نومة ضلاله . وقد أشار إلى ذلك قوله : { أفنضرب عنكم الذكر صفحاً إن كنتم قوماً مسرفين } \\[ الزخرف : 5 \\] كما تقدم هنالك ، ولولا ذلك لَمَا ارعوى ضالّ عن ضلاله ولمَا نفع إرشاد المرشدين في نفوس المخاطبين .فجملة { ومن يعش عن ذكر الرحمن } عطف على جملة { ولما جاءهم الحق قالوا هذا سحرٌ } \\[ الزخرف : 30 \\] الآية .فجملة { ومن يعش عن ذكر الرحمن } تمثيل لحالهم في إظهارهم عدم فهم القرآن كقولهم : { قلوبنا في أكِنَّةٍ مما تدعونا إليه وفي آذاننا وقرٌ } \\[ فصلت : 5 \\] بحال من يَعشو عن الشيء الظاهر للبصر .و { يَعش } : مضارع عشا كغَزَا عَشْواً بالواو ، إذا نظر إلى الشيء نظراً غير ثابت يُشبه نظر الأعشى ، وأما العَشَا بفتح العين والشين فهو اسم ضُعف العين عن رؤية الأشياء ، يقال : عَشِي بالياء مثل عرِج إذا كانت في بصره آفة العَشَا ومصدره عَشًى بفتح العين والقصر مثل العرج . والفعل واوي عشا يعشو ، ويقال عشِيَ يعشَى إذا صار العَشا له آفة لأن أفعال الأدواء تأتي كثيراً على فَعِل بكسر العين مثل مرِض . وعشِي ياؤه منقلبة عن واو لأجل كسرة صيغة الأدواء .فمعنى { ومن يعش } من ينظر نظراً غير متمكن في القرآن ، أي من لا حظّ له إلا سماع كلمات القرآن دون تدبر وقصد للانتفاع بمعانيه ، فشبه سماع القرآن مع عدم الانتفاع به بنظر الناظر دون تأمل .وعُدي { يعش } ب { عن } المفيدة للمجاوزة لأنه ضمن معنى الإعراض عن ذكر الرحمان وإلا فإن حقّ عشا أن يعدّى ب ( إلى ) كما قال الحُطَيئَة :متى تأته تعشه إلى ضوء نارهتجد خير نار عندها خيرُ موقدولا يقال : عشوت عن النّار إلا بمثل التضمين الذي في هاته الآية . فتفسير من فسّر { يعش عن ذكر الرحمن } بمعنى يُعرض : أراد تحصيل المعنى باعتبار التعدية ب { عن } ، وإنكارُ من أنكر وجود ( عشا ) بمعنى أعرض أراد إنكار أن يكون معنى أصلياً لفعل ( عشَا ) وظن أن تفسيره بالإعراض تفسير لمعنى الفعل وليس تفسيراً للتعدية ب { عن } فالخلاف بين الفريقين لفظي .و { ذكر الرحمن } هو القرآن المعبر عنه بالذكر في قوله : { أفنضرب عنكم الذكر صفحاً } \\[ الزخرف : 5 \\] . وإضافته إلى { الرحمن } إضافة تشريف وهذا ثناء خامس على القرآن .والتقييض : الإتاحة وتهيئة شيء لملازمة شيء لعمل حتى يتمه ، وهو مشتق من اسم جامد وهو قَيْض البَيضَة ، أي القِشر المحيط بما في داخل البيضة من المُحِّ لأن القيْض يلازم البيضة فلا يفارقها حتى يخرج منها الفرخ فيتم ما أتيح له القيض .فصيغة التفعيل للجعل مثل طيَّن الجدَار : ومثل أزره ، أي ألبسه الإزار ، ودرَّعوا الجارية ، أي ألبسوها الدرع . وأصله هنا تشبيه أي نجعله كالقَيض له ، ثم شاع حتى صار معنى مستقلاً ، وقد تقدم في قوله تعالى : { وقيَّضنا لهم قرناء } في سورة فصّلت ( 25 ) فضُمَّ إليه ما هنا . وأتَى الضمير في { له } مفرداً لأن لكل واحد ممن تحقق فيهم الشرط شيطاناً وليس لجميعهم شيطان واحد ولذلك سيجيء في قوله : { قال يا ليت بيني وبينك } \\[ الزخرف : 38 \\] بالإفراد ، أي قال كل من له قرين لقرينه .ولم يذكر متعلق فعل { نقيّض } اكتفاءً بدلالة مفعوله وهو { شيطاناً } فعُلم منه أنه مقيض لإضلاله ، أي هُمْ أعرضوا عن القرآن لوسوسة الشيطان لهم .وفُرع عن { نقيض } قوله : { فهو له قرين } لأن التقيض كان لأجل مقارنته .ومن الفوائد التي جرت في تفسير هذه الآية ما ذكره صاحب «نَيل الابتهاج بتطريز الديباج» في ترجمة الحفيد محمد بن أحمد بن محمد الشهير بابن مرزوق قال : قال صاحب الترجمة : حضرت مجلس شيخنا ابن عرفة أولَ مجلس حضرتُه فقرأ { ومن يعش عن ذكر الرحمن } فقال : قُرِىء { يعشُو } بالرفع و { نُقيض } بالجزم . ووجهها أبُو حيان بكلام ما فهمتُه . وذكر أن في النسخة خللاً وذكر بعض ذلك الكلام . فاهتديتُ إلى تمامه وقلت : يا سيدي معنى ما ذكرَ أن جَزم { نُقَيضْ } ب { مَن } الموصولة لشبهها بالشرطية لما تضمَّنها من معنى الشرط وإذا كانوا يعاملون الموصول الذي لا يشبه لفظ الشرط بذلك فما يشبه لفظُه لفظَ الشرط أولى بتلك المعاملة . فوافق وفَرح لما أن الإنصاف كان طبعه . وعند ذلك أنكر عليّ جماعة من أهل المجلس وطالبوني بإثبات معاملة الموصول معاملة الشرط فقلت : نصهم على دخول الفاء في خبر الموصول في نحو : الذي يأتيني فله درهم ، فنازعوني في ذلك وكنت حديث عهد بحفظ التسهيل فقلت : قال ابن مالك فيما يشبه المسألة «وقد يَجزمه مسبب عن صلة الذي تشبيهاً بجواب الشرط وأنشدت من شواهد المسألة قولَ الشاعر: ... كذاك الذي يبغي على النّاس ظالماًتُصبه على رغممٍ عواقب ما صنع ... فجاء الشاهد موافقاً للحال . قال : وكنت في طرف الحَلقة ، فصاح ابن عرفة وقال : يا أخي ما بغينا ، لعلك ابنُ مرزوق؟ فقلت : عبدكم» انتهى من «اغتنام الفرصة» . اه .وجيء بالجملة المفرعة جملة اسمية للدلالة على الدوام ، أي فكان قريناً مقارنة ثابتة دائمة ، ولذلك لم يقل : نقيّض له شيطاناً قريناً له . وقدم الجار والمجرور على متعلَّقه في قوله : { له قرين } للاهتمام بضمير { من يَعش عن ذكر الرحمن } أي قرين له مقارنةً تامة .وقرأ الجمهور { نُقيّض } بنون العظمة . وقرأ يعقوب بياء الغائب عائداً ضميره على { الرحمن } .\n\n",
      "translations": [
        {
          "translation": "568 (And he whose sight is dim to the remembrance of the Beneficent) and he who is blind to the declaration of the divine Oneness and Scripture of the Beneficent, (We assign unto him a devil who becometh his comrade) in the life of the world and in the Fire;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَن يَعْشُ عَن ذِكْرِ ٱلرَّحْمَـٰنِ } يَعمى عَنه\n\n\n\n\nوقوله تعالى: { نُقَيِّضْ لَهُ شَيْطَاناً } معناه نُهيئءُ لَهُ { فَهُوَ لَهُ قَرِينٌ } معناه صَاحبٌ\n\n",
      "translations": [
        {
          "translation": " And whoever is {unmindful of the Most Merciful} - We have prepared for him a Blaze.\n\n\nAnd His saying, {We will appoint a Satan for him}, its meaning is that we will {abandon him}, its meaning is that he will have a companion.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَعْشُ } أي: يعرض ونصرف { عَن ذِكْرِ ٱلرَّحْمَـٰنِ } أي: القرآن المبيِّن له طريق الإيمان والعرفان\n لفرط انهماكه باللذات والشهوات الفانية الدنيوية { نُقَيِّضْ لَهُ } ونسلط عليه { شَيْطَاناً } يضله ويغويه ويوسوس عليه\n ويرديه\n وبالجملة: { فَهُوَ } أي: الشيطان { لَهُ قَرِينٌ } [الزخرف: 36] دائماً\n يزين عليه المعاصي والقبائح\n ويغريه عليها\n إلى أن يدخله في نار القطيعة والحرمان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" مَن يعش \": شرط وجواب\n وحكي أن أبا عبد الله بن مرزوق دخل على ابن عرفة\n فحضر مجلسه\n ولم يعرفه أحد\n فوجده يُفسر هذه الآية: { ومَن يعش عن ذكر الرحمن } \n فكان أول ما افتتح به - يعني ابن مرزوق - أن قال: وهل يصح أن تكون \" مَن \" هنا موصولة؟ فقال ابن عرفة: وكيف\n وقد جزمت؟ فقال ابن مرزوق: جزمت تشبيهاً بالشرطية\n فقال ابن عرفة: إنما يقدم على هذا بنص من إمام\n أو شاهد من كلام العرب\n فقال: أما النص فقال ابن مالك في التسهيل: وقد يحزم مسبب عن صلة الذي\n تشبيهاً بجواب الشرط\n وأما الشاهد فقوله:\nفقال ابن عرفة: فأنت إذاً أبو عبد الله بن مرزوق؟ فقال: نعم\n فحرّب به\n وقال\n والله ما ظلمناك\nهـ\n وقرأ ابن عباس: \" يعشَ \" - بفتح الشين\n أي: يَعْم\n من: عشى يعشى\n وقُرئ: \" يعشو \" على أن \" من \" موصولة غير مضمنة معنى الشرط\n وإلا جزمت كما تقدم\n قلتُ: والذي يظهر من كلام التسهيل أن الموصول المضمَن معنى الشرط إنما يجزم الجواب لا الشرط\n فتأمله\n مع كلام ابن مرزوق\n والشاهد الذي أتى به إنما فيه جزم الجواب لا الشرط\n فلا يصح ما قاله ابن مرزوق باعتبار جزم لفظ الشرط\n والله تعالى أعلم\n يقول الحق جلّ جلاله: { ومَن يَعْشُ } أي: يتعَامَ\n أو: يعْم\n والفرق بين القراءتين أنه إذا حصلت الآفة في بصره قيل: عشى يعشَى\n وإذا ضعف بصره بلا آفة قيل: عشَى يعشو\n والمعنى: ومَن يعرض { عن ذكر الرحمن } وهو القرآن\n لفرط اشتغاله بزهرة الدنيا\n وانهماكه في الحظوظ الفانية\n فلم يلتفت إليه\n ولم يعرف أنه حق - على قراءة الفتح - أو: عرف أنه حق وتعامى عنه\n تجاهلاً\n على قراءة الضم\n { نُقَيّضْ له شيطاناً فهو له قرينُ } \n قال ابن عباس: نسلطه عليه فهو معه في الدنيا والآخرة\n لا يفارقه\n ولا يزال يوسوسه ويغويه\n وفيه إشارة إلى أن مَن دام عليه لم يغوه الشيطان\n وإضافته إلى \" الرحمن \" للإيذان بأن نزوله رحمة للعالمين\n وهو من إضافة المصدر إلى فاعله\n أي: ما ذكره الرحمن وأوحى به في كتابه\n وقال ابن عطية: ما ذكّر الله به عباده من المواعظ\n ويحتمل أن يريد مطلق الذكر\n أي: ومَن يغفل عن ذكر الله نُسلط عليه شيطاناً\n عقوبة على الغفلة\n فإذا ذكر الله تباعد عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:25",
      "similarity": 0.8278940478374922
    },
    {
      "verse": "30:18",
      "similarity": 0.18869654987685236
    },
    {
      "verse": "38:18",
      "similarity": 0.17354844103951528
    },
    {
      "verse": "40:46",
      "similarity": 0.1688313637752665
    },
    {
      "verse": "40:55",
      "similarity": 0.1682548666987266
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}