{
  "chapter": "الزخرف",
  "text": "اهم يقسمون رحمت ربك نحن قسمنا بينهم معيشتهم فى الحيوة الدنيا ورفعنا بعضهم فوق بعض درجت ليتخذ بعضهم بعضا سخريا ورحمت ربك خير مما يجمعون",
  "translations": [
    {
      "translation": "Is it, then, they who allocate the mercy of your Lord? We have allocated their livelihood among them in the life of the dunya and raised some of them above others in rank so that some of them are subservient to others. But the mercy of your Lord is better than anything they amass.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they the ones who dispense the favour of your Lord? It is He who apportions the means of livelihood among them in this world, and raises some in position over the others to make some others submissive. The favours of your Lord are better than what they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who distribute the Mercy of your Lord? It is We Who have distributed their livelihood among them in the life of this world, and have raised some above others in rank that some of them may harness others to their service. Your Lord's Mercy is better than all the treasures that they hoard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they distribute the mercy of your Lord? It is We who have distributed their sustenance in this world and raised the positions of some of them above the others so that they would mock each other. The mercy of your Lord is better than what they can amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they the distributors of your Lord’s mercy? We have distributed among them their comforts in the life of this world, and gave high status to some over others so that they mock at each other; and the mercy of your Lord is better than all what they hoard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who would portion out the mercy of your Lord It is We Who portion out between them their livelihood in this world, and We raised some of them above others in ranks, so that some may employ others in their work. But the mercy of your Lord is better than what they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they distribute the mercy of your Lord? We distribute among them their livelihood in the life of this world, and We j have exalted some of them above others in degrees, that some of them may take others in subjection; and the mercy of your Lord is better than what they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is it they who divide the mercy of the Lord? We have divided between them their livelihood in the present life, and raised some of them above others in rank, that some of them may take others in servitude; and the mercy of thy Lord is better than that they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who apportion thy Lord's mercy? We have apportioned among them their livelihood in the life of the world, and raised some of them above others in rank that some of them may take labour from others; and the mercy of thy Lord is better than (the wealth) that they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who apportion the mercy of your Lord? It is We who distribute among them their livelihood in the life of this world, and raise some of them above others in rank, so that they may take one another into service; and the mercy of your Lord is better than [the wealth] which they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall they apportion their Lord's mercy? It is We Who have apportioned among them their livelihood in the life of the War, and raised some of them over others in degrees, so that one of them may take another as a serf; and the mercy of thy Lord is better than that which they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who dispense the mercy of your Lord? It is We who have dispensed among them their livelihood in the present life, and raised some of them above others in rank, so that some may take others into service, and your Lord’s mercy is better than what they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who would portion out the Mercy of thy Lord? It is We Who portion out between them their livelihood in the life of this world: and We raise some of them above others in ranks, so that some may command work from others. But the Mercy of thy Lord is better than the (wealth) which they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who would portion out the Mercy of your Lord? It is We Who portion out between them their livelihood in this world, and We raised some of them above others in ranks, so that some may employ others in their work. But the Mercy (Paradise) of your Lord (O Muhammad SAW) is better than the (wealth of this world) which they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is it they who divide the Mercy of your Lord! (It is) We who divided between them their livelihoods in this life, raising some in rank above others, sothat some may take the other into his service. Your Lord's Mercy is better than all they gather.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it they who allocate the mercy of your Lord? It is We who have allocated their livelihood in this life, and We elevated some of them in rank above others, that some of them would take others in service. But your Lord’s mercy is better than what they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:32] Is it they who apportion the mercy of your Lord?, [the mercy being] prophethood. We have apportioned among them their livelihood in the life of this world, making some of them wealthy and others poor, and raised some of them, in wealth, above others by degrees, so that some of them, who are wealthy, may take others, who are poor, in service, disposed to work for them in return for a wage (the [final] yā’ [in sukhriyyā] is attributive; a variant reading has sikhriyyan); and the mercy of your Lord, that is, Paradise, is better than what they amass, in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is it they who apportion their Lord's mercy) i.e. your Lord's prophethood and Scriptures, such that they give it to whoever they will? (We have apportioned among them their livelihood) their wealth and children (in the life of the world, and raised some of them above others in rank) and We raised the merits of some above others in relation to wealth and offspring (that some of them may take labour from others) that some may use others in the capacity of servants and slaves; (and the mercy of thy Lord) i.e. prophethood and Scripture; and it is also said that this means: Paradise for the believers (is better than (the wealth) that they amass) is better than what the disbelievers amass of wealth and adornment in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَهُمْ } من شدة شكيمتهم وغيظهم معك يا أكمل الرسل\n ونهاية إنكارهم بكتابك: { لَوْلاَ نُزِّلَ هَـٰذَا ٱلْقُرْآنُ } بأخلاقهم السخيفة\n وتدبيراتهم الركيكة { يَقْسِمُونَ رَحْمَتَ رَبِّكَ } يا أكمل الرسل\n ويضعون رتبة النبوة والرسالة إلى من يقتضيه أوهامهم وخيالاتهم الباطلة ونفوسهم الخبيثة\n بل { نَحْنُ } بوفور حكمتنا { قَسَمْنَا بَيْنَهُمْ مَّعِيشَتَهُمْ } التي يحتاجون إليها { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } ومع تدبيرنا إياهم مصالحَ معاشهم\n لا يُحسنون تدبيرها فيما بينهم\n ليصلح أمر ائتلافهم وتمدنهم فيها\n فكيف يخوضون في مصالح العباد وتدبيراتها؟! ومن أين يتأتى لهم التفوة في الأوضاع الألوهية والتدابير الربوبية الناشئة عن كمال العلم والحكمة والإرادة الكاملة والقدرة الشاملة؟!\n\n{ وَ } من غاية قصورهم عن تدبيرات معاشهم { رَفَعْنَا } بمقتضى حكمتنا وتربيتنا إياهم { بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ } بأن فضَّلنا بعضهم على بعضٍ في الرزق الصوري وغيره\n ليكون لهم الكبرياء والاستيلاء على البعض الآخر { لِّيَتَّخِذَ بَعْضُهُم بَعْضاً سُخْرِيّاً } أي: يستعمل البعض الأغنياء أُجراء من البعض الفقراء\n فيأمورهم بما قصدوا من الحوائج\n ليتم أمر النظام والتمدن والتضام { وَ } بالجملة: { رَحْمَتُ رَبِّكَ } يا أكمل الرسل\n وهي رتبة النبوة والرسالة { خَيْرٌ مِّمَّا يَجْمَعُونَ } [الزخرف: 32] من حطام الدنيا ومزخرفاتها الفانية\n لاشتمالها على ضبط الظاهر والبواطن المتعلقة بالنشأة الأولى والأخرى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { أهم يَقْسِمُونَ رَحْمَتَ ربك } \n إنكار عليهم\n وفيه تجهيل لهم وتعجيب من تحكمِهم في اختيار مَن يصلح للنبوة\n والمراد بالرحمة: النبوة\n { نَحنُ قَسَمْنَا بينهم معيشتَهم } ما يعيشون به\n وهو أرزاقهم الحسية { في الحياة الدنيا } أي: لم نجعل قسمة الأدون إليهم\n وهو رزق الأشباح\n فكيف بالنبوة\n والعلم\n الذي هو رزق الأرواح؟ { ورفعنا بعضهم فوق بعضٍ درجات } أي: جعلنا البعض أقوياء وأغنياء وموالي\n والبعض ضعفاء وفقراء وخدماء\n { ليتخذ بعضُهُم بعضاً سُخْرياً } أي: ليصرف بعضهم بعضاً في حوائجهم\n ويستخدموهم في مهماتهم\n ويُسخروهم في أشغالهم\n حتى يتعايشوا\n ويصلوا إلى أعمالهم\n هذا بماله\n وهذا ببدنه\n ولو استووا في الغنى والفقر لبطل جُل المصالح\n فسبحان المدبّر الحكيم\n قال القشيري: لو كانت المقاديرُ متساويةٌ لَتَعَطلَت المعايشُ\n ولَبَقي كلٌّ عند حاله\n فجعل بعضَهُم مخصوصاً بالترفُّه والمال\n وآخرين بالفقر ورقّة الحال\n حتى احتاج الفقيرُ في حين حاجته أن يعمل للغنيِّ\n ليترفّق من جهته بأجرته\n فيصلُح بذلك أمر الفقير والغنيّ معاً\n هـ\n ولو فوّضنا ذلك إلى تدبيرهم لهلكوا\n وإذا كانوا في تدبير خويصة أمرهم\n وما يصلحهم من متاع الدنيا الدنية\n في غاية العجز\n فما ظنهم في تدبير أمر الدين والنبوة؟!\n\nوقيل: \" سخريا \" أي: يسخر بعضهم من بعض\n { ورحمتُ ربك } أي: النبوة\n أو: الدين وما يتبعه من الفوز في المآب\n { خيرٌ مما يجمعون } أي: مما يجمعُ هؤلاء من حُطام الدنيا الدنية الفانية\n الإشارة: مما جرى في طبع الناس أنهم لا يُقرون الولاية إلا فيمن عَظُمَ جاهُه\n وكثر طعامه\n أو كثرت صلاته\n أو كان مجذوباً مصطلماً\n أو: سبقت في أسلافه\n وهذا خطأ\n فإن الولاية سر من أسرار الله\n أودعها قلوب أصفيائه\n لا تظهر على جوارحهم\n ولا تكون في الغالب إلا في أهل التجريد\n وأهل الخمول\n أخفاها الله في عابده\n فمَن ادعاها من غير تجريد ولا تخريب\n فهو مدّعٍ\n ولذلك قال أبو المواهب رضي الله عنه: مَا ادّعى شهود الجمال\n قبل تأدُّبه بالجلال\n فارفضه فإنه دجال\n ويقال لمَن أنكر على أهلها من أهل التجريد: { أهُم يقسمون رحمت ربك\n\n\n } الآية\n ورحمة ربك - هي سر الخصوصية - خير مما يجمعون\n وقال القشيري على قوله تعالى: { نحن قسمنا بينهم معيشتهم\n\n\n } الخ\n بعد كلام: ثم إنه تعالى قَسَمَ لبعض عباده النعمةَ والغنى\n ولقوم الفقر والقلّة\n وجعل لكلّ واحدٍ منهم مسكناً يسكنون إليه\n ويستقلُّون به\n فللأغنياء وجود الأنعام\n وجزيل الأقسام\n فشكروا واستبشروا\n وللفقراء شهودُ القَسَّام\n فحَمدوا وافتخروا\n فالأغنياء وجدوا النعمة فاستغنوا وانشغلوا\n والفقراء سمعوا قوله: \" نحن \" فاشتغلوا\n وفي الخبر: أنه صلى الله عليه وسلم قال للأنصار:\n \" أما تَرضَون أن يرجع الناس بالشاء والبعير\n وترجعوا برسول الله إلى أهليكم؟ والله ما تنقلبون به خير مما ينقلبون \" \nهـ\n قوله تعالى: { نحن قسمنا بينهم\n\n\n } الخ\n قد سبقت أقسام الرزق قبل ظهور الخلق\n فالواجب انتظار القسمة\n والرضا بما قسم\n كما قال الشاعر:\nثم ذكر إهانة الدنيا\n وخساستها عنده\n فقال: { وَلَوْلاَ أَن يَكُونَ ٱلنَّاسُ أُمَّةً وَاحِدَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:11",
      "similarity": 0.5147413610586772
    },
    {
      "verse": "69:21",
      "similarity": 0.5123305602408499
    },
    {
      "verse": "101:7",
      "similarity": 0.5123305602408499
    },
    {
      "verse": "15:20",
      "similarity": 0.5064112233516647
    },
    {
      "verse": "7:10",
      "similarity": 0.4423296603631473
    }
  ]
}