{
  "chapter": "الزخرف",
  "text": "ولما جاءهم الحق قالوا۟ هذا سحر وانا به كفرون",
  "translations": [
    {
      "translation": "But when the truth came to them they said, 'This is magic and we reject it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when the truth had come to them, they said: \"This is sorcery. We shall never believe in it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Truth came to them they said: “This is just sorcery and we reject it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the truth came to them, they said, \"This is magic and we have no faith in it\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the truth came to them they said, “This is magic, and we disbelieve in it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the truth came to them, they said: \"This is magic, and we disbelieve therein.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them the truth they said: This is magic, and surely we are disbelievers in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the truth came to them, they said, 'This is a sorcery, and in it we are unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now that the Truth hath come unto them they say: This is mere magic, and lo! we are disbelievers therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but when the truth came to them, they said, \"This is sorcery, and we reject it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the truth cometh Unto them, they say this is magic, and verily we are therein disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them, they said, ‘This is magic, and we indeed disbelieve in it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the Truth came to them, they said: \"This is sorcery, and we do reject it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the truth (this Quran) came to them, they (the disbelievers in this Quran) said: \"This is magic, and we disbelieve therein.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them, they said: 'This is sorcery, we disbelieve in it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them, they said, “This is sorcery, and we refuse to believe in it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the truth came to them, they said, \"This is magic, and indeed we are, concerning it, disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:30] But when the truth, the Qur’ān, came to them, they said, ‘This is sorcery, and we are indeed disbelievers in it’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And now that the Truth) the Scripture and Messenger (hath come unto them they say: This) i.e. this Scripture (is mere magic) is a mere lie, (and lo! we are disbelievers therein) in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا جَآءَهُمُ ٱلْحَقُّ } الحقيق بالاتباع { قَالُواْ } من فرط تعنتهم وعنادهم: { هَـٰذَا } الذي جاء به هذا المدعي؛ يعني: محمداً صلى الله عليه وسلم { سِحْرٌ } وشعر اختلقه من تلقاء نفسه، ونسبه إلى ربه افتراء وتغريراً { وَ } بالجملة: { إِنَّا بِهِ } وبدينه { كَافِرُونَ } [الزخرف: 30] منكرون جاحدون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وحاصل معنى الآية: أنه تعالى جعل كلمة التوحيد باقية في عقب إبراهيم عليه السلام ليدعو الموحّد المشرك، نسلاً بعد نسل، فيرجع المشرك عن شركه، فلم يرجعوا، بل اغترُّوا بما مُتّعوا به، فاستمرّوا على الشرك حتى جاءهم الحق، فكفروا وأصرُّوا، { ولمَّا جاءهم الحقُّ } أي: القرآن يُنبههم على ما هم عليه من الغفلة، ويُرشدهم إلى التوحيد، ازدادوا كفراً وعُتواً، وضمُّوا إلى كفرهم السابق معاندة الحقوالاستهانة به، حيث { قالوا هذا سحر وإِنا به كافرون } فسَمّوا القرآنَ سحراً، وجحدوه ومَن جاء به\n\n\nوالله تعالى أعلم\n الإشارة: كان إبراهيم عليه السلام إمام أهل التوحيد، لقوله تعالى:\n\n[البقرة: 124]، وجعل الدعوة إليه في عقبه إلى يوم القيامة، وهو على قسمين: توحيد البرهان، وتوحيد العيان\n وقد جاءت بعده الرسل بالأمرين معاً، وقام بها خلقاؤهم بعدهم، فقام بالأول العلماء، وقام بالثاني خواص الأولياء، أهل التربية الحقيقية، ولا ينال من توحيد العيان شيئاً مَن علق قلبه بالشهوات الجسمانية، والحظوظ الفانية، كما قال الششتري رضي الله عنه:\n\nوكل مَن تمتع بذلك، وانهمك فيه حَرِمَ بركة صحبة العارفين إذ يمنعه ذلك من حط رأسه، ودفع فلسه، فينخرط في سلك قوله تعالى: { بل متعتُ هؤلاء وآباءهم\n\n\n } الآية\n وكل زمان له رسول، خليفةً عن الرسول صلى الله عليه وسلم يدعو إلى الحق ومعرفته\n وبالله التوفيق\n ثم ذكر تحكمهم على الله، واستحقارهم لرسوله صلى الله عليه وسلم، فقال: { وَقَالُواْ لَوْلاَ نُزِّلَ هَـٰذَا ٱلْقُرْآنُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:76",
      "similarity": 0.8606134612820803
    },
    {
      "verse": "27:13",
      "similarity": 0.7659535645863068
    },
    {
      "verse": "46:7",
      "similarity": 0.744537197226176
    },
    {
      "verse": "10:80",
      "similarity": 0.677999535689484
    },
    {
      "verse": "37:15",
      "similarity": 0.6739079130112516
    }
  ]
}