{
  "chapter": "الزخرف",
  "text": "او نرينك الذى وعدنهم فانا عليهم مقتدرون",
  "translations": [
    {
      "translation": "or let you see what We have promised them. They are completely in Our power.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or show you some of what We have promised them. They are certainly well within Our power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or make you see the end that We had promised them, for We have full power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or show them to you suffering the torment with which We had threatened them. We are certainly dominant over them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or show you what We have promised them – We therefore have complete control over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (if) We show you that wherewith We threaten them, then verily, We have perfect command over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather We will certainly show you that which We have promised them; for surely We are the possessors of full power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or We show thee a part of that We promised them, surely We have power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (if) We show thee that wherewith We threaten them; for lo! We have complete command of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or We shall show you what We have promised them; for surely We have complete power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or if We shew thee that wherewith We threaten them, verily We are going to prevail over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or show you what We have promised them, for indeed We hold them in Our power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or We shall show thee that (accomplished) which We have promised them: for verily We shall prevail over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (if) We show you that wherewith We threaten them, then verily, We have perfect command over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or We show you a part of that which We have promised them, for indeed We have power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or show you what We have promised them; for We have absolute power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:42] or We show you, during your lifetime, that which We have promised them, in the way of chastisement, for surely We have power over, [surely] We are able to chastise, them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or (if) We show thee that wherewith We threaten them) on the Day of Badr; (for lo! We have complete command of them) We are able to punish them before your death and after it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ نُرِيَنَّكَ } العذاب الموعود { ٱلَّذِي وَعَدْنَاهُمْ } للإعراض عنك، وعن دينك وكتابك، وبالجملة: { فَإِنَّا عَلَيْهِمْ مُّقْتَدِرُونَ } [الزخرف: 42] قادرون على وجوه الانتقام إياهم حال حياتك أو بعدها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أو نُرِيَنَّكَ } العذاب { الذي وعدناهم } قبل أن نتوفينك، كما وقع بهم يوم بدر، { فإِنا عليهم مقتدرون } العذاب { الذي وعدناهم } قبل أن نتوفينك، كما وقع بهم يوم بدر، { فإِنا عليهم مقتدرون } بحيث لا ناصر لهم من حلول نقمتنا وقهرنا\n و \" إما \": شرط دخلت \" ما \" على \" إن \" توكيداً للشرط، وزاد التوكيد نون الثقيلة\n الإشارة: كل مَن غفل عن ذكر الله تسلّط الشيطان على قلبه بالوسوسة والخواطر الردية، وقد ورد في الحديث:\n\n \" إن قلب ابن آدم ملك وشيطان، فإذا ذكر الله قرب الملك منه وانخنس الشيطان، وإذا غفل عن ذكر الشيطان قرب منه، فلا يزال يوسوسه ويمنيه حتى يغفله عن الله \" \n\nولا شك أن الذكر الذي يصرف الشيطان عن القلب إنما هو الذكر القلبي لا اللساني، فكم من ذاكر بلسانه وقلبه مشغول بهواه، فذكر اللسان نتائجة الأجور، وذكر القلوب نتائجة الحضور ورفع الستور، وشتان بين مَن همّه الحور والقصور، ومَن همّه الحضور ورفع الستور، هذا من عامة أهل اليمين، وهذا من خاصة المقربين، فإذا أردت يا أخي ذكر القلوب، ولمعان أسرار الغيوب، فاصحب الرجالَ، حتى ينقلوك من عالم الطبيعة إلى عالم الروحانية، وإلا بقيت في عالم الأشباح\n قال القشيري: مَن لم يعرف قَدْرَ الخلوة مع اللّهِ، فحادَ عن ذكره وأخلدَ إلى الخواطر الرديَّة، قيَّض اللّهُ له مَن يشغله عن الله - وهذا جزاء مَن تَرك الأدب في الخلوة\n وإذا اشتغل العبدُ في خلوته مع ربَّه، وتعرَّض له مَن يشغله عن ربه، صَرَفه الحق عنه بأي وجْهٍ كان\n\n ويقال: أصعبُ الشياطين نَفْسُكَ، والعبدُ إذا لم يَعرفْ قدر فراغ قلبه، واتَّبَعَ شهوته، وفتح ذلك البابَ علَى نَفْسه، بقي في يد هواه أسيراً، لا يكاد يتخلصُ منه إلا بعد مُدة\n هـ\n وقال في الإحياء: للشيطان جندان ند يطير، وجند يسير، والوسواس عبارة عن حركة جنده الطيار، والشهوة عبارة عن حركة جنده السيار\n ثم قال: فتحقق أن الشيطان من المنظَرين، فلا يتواضع لك بالكف عن الوسواس إلى يوم الدين إلا أن تصبح وهمومك هم واحد، وهو الله، فيشتغل قلبك بالله وحده، فلا يجد الملعون مجالاً فيك، فعند ذلك تكون من عباد الله المخلّصين، الداخلين في الاستثناء من سلطنته\n ولا تظن أن يفرغ منه قلب فارغ من ذكر الله، بل هو سيّال يجري من ابن آدم مجرى الدم، وسيلانه مثل الهواء في القدح، إن أردت أن يخلو عن الهواء من غير أن تشغله بالماء أو غيره، فقد طمعت في غير مطمع، بل بقدر ما يخلو من الماء يدخل فيه من الهواء لا محالة، فكذلك القلب المشغول بتفكُّر مهم في الدين، يخلو عن جولان الشيطان، وإلا فمَن غفر عن الله، ولو لحظة، فليس له في تلك اللحظة قرين إلا الشيطان، وإلا فمَن غفل عن الله، ولو لحظة، فليس له في تلك اللحظة قرين إلا الشيطان، ولذلك سبحانه: { ومَن يعش عن ذكر الرحمن نُقيض له شيطاناً فهو له قرين }\n\n\nهـ\n المراد منه\n وكل مَن عوّق الناس عن طريق الحق يصدق عليه قوله: { وإِنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون } ، فإذا تحققت الحقائق، وارتفع الغطاء، وظهر الصواب من الخطأ، قال للذي صدّه عن طريق القوم: يا ليت بيني وبينك بُعد المشرقين فبئس القرين، فيقول الحق جلّ جلاله: { ولن ينفعكم اليوم إذ ظلمتم أنفسكم } حيث حرمتموها من الوصول إليّ أنكم من عذاب الحجاب مشتركون\n ويُقال لمَن وعظ ودعا إلى الله، فلم يُقبل منه: { أفأنت تُسمع الصُّم\n\n\n } الآية\n فإما نذهبنَّ بك بالموت، فيقع الندم عليك، أو نُرينك الذي وعدناهم من العز لك والنصر، والانتقام ممن آذى أولياء الله، فإنا عليهم مقتدرون\n ثم أمر بالثبتوت في طريق الحق، فقال: { فَٱسْتَمْسِكْ بِٱلَّذِيۤ أُوحِيَ إِلَيْكَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:95",
      "similarity": 0.7538482293818917
    },
    {
      "verse": "13:40",
      "similarity": 0.44067213779256126
    },
    {
      "verse": "87:3",
      "similarity": 0.42039720533229363
    },
    {
      "verse": "77:22",
      "similarity": 0.3841377292003435
    },
    {
      "verse": "86:8",
      "similarity": 0.3735938435538489
    }
  ]
}