{
  "chapter": "الزخرف",
  "text": "وانه لذكر لك ولقومك وسوف تسـلون",
  "translations": [
    {
      "translation": "It is a (source) of greatness for you and your people. You will surely be questioned about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily it is a great source of eminence for you and your people, and soon you will be called to account concerning that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Quran is a reminder to you and to your people and you will soon be questioned about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is undoubtedly an honour for you and your people; and you will soon be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, this is indeed a Dhikr for you and your people, and you will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely it is a reminder for you and your people, and you shall soon be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely it is a Reminder to thee and to thy people; and assuredly you will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! it is in truth a Reminder for thee and for thy folk; and ye will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is certainly a reminder to you and to your people and you will soon be  called to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily it is an admonition Unto thee and thy people; and presently ye will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is a reminder for you and your people, and soon you will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (Qur'an) is indeed the message, for thee and for thy people; and soon shall ye (all) be brought to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, this (the Quran) is indeed a Reminder for you (O Muhammad SAW) and your people (Quraish people, or your followers), and you will be questioned (about it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is indeed a Reminder to you and to your nation, and without doubt you shall be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a message for you, and for your people; and you will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:44]   And it is indeed a Reminder, an honour, for you and for your people, as it has been revealed in their language. And you will [eventually] be questioned, about [the extent of] your fulfilling your duty towards it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo!) i.e. the Qur'an (is in truth a Reminder for thee) an honour for you (and for thy folk) the Quraysh because it is revealed in their own language; (and ye will be questioned) about the gratitude which is owed to such an honour.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّهُ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ } معناه شَرفٌ\n وهو أنْ يَقولَ الرّجلُ أنا من العَربِ، فيقال من أي العَربِ، فيقول مِن قُريش، فيكون يَملكُ منها الشَّرفُ في الدّنيا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّهُ } أي: القرآن { لَذِكْرٌ } أي: عظة وتذكير { لَّكَ وَلِقَوْمِكَ } فعليكم أن تتعظوا به، وبما فيه من الحِكم والأحكام، والعبر والرموز والإشارات { وَسَوْفَ تُسْأَلُونَ } [الزخرف: 44] عن قيامكم بها وامتثالكم بما فيها\n\n\n\n\nوإن عاند المشركين معك، واستهزءوا بك وبكتابك، ونسبوا دينك إلى البدعة والاختلاق، فـ\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِنه } أي: ما أُوحي إليك { لَذِكرّ } لشرف عظيم { لك ولقومك } ولأمتك، أو: لقومك من قريش، فما زال العز فيهم، والشرف لهم، من زمانه صلى الله عليه وسلم إلى قرب الساعة\n قال صلى الله عليه وسلم:\n\n \" لا يزال هذا الشأن في قريش ما بقيّ منه اثنان \" \n",
      "translations": []
    }
  ]
}