{
  "chapter": "الزخرف",
  "text": "افانت تسمع الصم او تهدى العمى ومن كان فى ضلل مبين",
  "translations": [
    {
      "translation": "Can you make the deaf to hear, or show the blind, and those lost in clear error, the way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you, (O Prophet), then make the deaf hear, or direct to the Right Way the blind or one lost in manifest error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), can you make the deaf hear or guide the blind or the one who is clearly in error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will you make the deaf listen or show the path to the blind, and to those who are in open error? (The disbelievers whose hearts are sealed, are deaf and blind to the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you make the deaf to hear, or can you guide the blind or him who is in manifest error\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! can you then make the deaf to hear or guide the blind and him who is in clear error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shalt thou make the deaf to hear, or shalt thou guide the blind and him who is in manifest error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Canst thou (Muhammad) make the deaf to hear, or canst thou guide the blind or him who is in error manifest?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you [Prophet] make the deaf hear? Or guide either the blind or those who are in manifest error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore canst thou make the deaf to hear, or canst thou guide the blind or him who is is error manifest?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you, then, make the deaf hear or guide the blind and those who are in manifest error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Canst thou then make the deaf to hear, or give direction to the blind or to such as (wander) in manifest error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you (O Muhammad SAW) make the deaf to hear, or can you guide the blind or him who is in manifest error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, will you make the deaf hear, or guide the blind and he who is in clear error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can you make the deaf hear, or guide the blind, and him who is in evident error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will you make the deaf hear, [O Muhammad], or guide the blind or he who is in clear error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:40] Can you, then, make the deaf hear, or can you guide the blind and one who is in manifest error?, in other words, such [individuals] will not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Canst thou) Muhammad (make the deaf to hear) make the one who pretends to be deaf hear the Truth and guidance, (or canst thou guide the blind) or guide the disbeliever to see the Truth and guidance (or him who is in error manifest) whom you cannot guide to the guidance?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كان صلى الله عليه وسلم يبالغ في إرشاد عشيرته ويُتعب نفسه في إهدائهم، رد الله سبحانه على وجه التعجب والتأديب ردعاً له عما كان عليه من المبالغة، فقاله مستفهماً: { أَفَأَنتَ تُسْمِعُ ٱلصُّمَّ } أي: أأنت تتخيل لنفسك أنك تقدر على إسماع من جُبِل على الصمم في أصل فطرته { أَوْ تَهْدِي ٱلْعُمْيَ } المجبول على العمى في مبدأ خلقته { وَ } بالجملة: { مَن كَانَ فِي ضَلاَلٍ مُّبِينٍ } [الزخرف: 40] وغواية عظيمة جبلية، كيف تسعى لهدايته، وتبالغ في إرشاده وتكميله؛ إذ ليس في وسعك تغيير الخلقة، وإنما عليك الإنذار والتبليغ فقط، وإلى متى تتعب نفسك وتسعى؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}