{
  "chapter": "الزخرف",
  "text": "وقالوا۟ يايه الساحر ادع لنا ربك بما عهد عندك اننا لمهتدون",
  "translations": [
    {
      "translation": "They said, 'Magician, invoke your Lord for us by the contract He has made with you and we shall certainly follow the guidance.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said: \"O sorcerer, call on your Lord for us in accordance with the compact He has made with you. We shall certainly come to guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Whenever they faced an affliction) they would say: “O magician, pray for us to your Lord according to your station with Him. We shall certainly be guided to the Right Way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Magician, pray to your Lord for us through your covenant with Him (If he saves us from the torment), we shall certainly seek guidance\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “O you magician! Pray for us to your Lord, by the means of His covenant which is with you; we will certainly come to guidance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said (to Musa): \"O you sorcerer! Invoke your Lord for us according to what He has made a pact with you. Verily, We shall guide ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: O magician! call on your Lord for our sake, as He has made the covenant with you; we shall surely be the followers of the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, 'Sorcerer, pray to thy Lord for us by the covenant He has made with thee, and surely we shall be right-guided.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: O wizard! Entreat thy Lord for us by the pact that He hath made with thee. Lo! we verily will walk aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Sorcerer, call on your Lord for us, by virtue of His pledge to you: we shall certainly accept guidance,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: magician! supplicate thy Lord for us for that which He hath covenanted with thee; verily we shall let ourselves be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would say, ‘O magician! Invoke your Lord for us by the covenant He has made with you [to remove this scourge]. We will indeed be guided [when it is removed].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, \"O thou sorcerer! Invoke thy Lord for us according to His covenant with thee; for we shall truly accept guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said [to Musa (Moses)]: \"O you sorcerer! Invoke your Lord for us according to what He has covenanted with you. Verily, We shall guide ourselves (aright).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sorcerer' they said, 'pray to your Lord for us in accordance to the covenant He has made with you, and surely we shall be rightly guided'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O sorcerer, pray to your Lord for us, according to His pledge to you, and then we will be guided.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said [to Moses], \"O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:49] And they said, to Moses, upon seeing the chastisement, ‘O sorcerer! — that is to say, ‘[O] knowledgeable, perfect one’, since for them sorcery was an awesome [form of] knowledge — supplicate your Lord for us by the covenant that He has made with you, [to the effect] that He would relieve us from chastisement if we believe. Assuredly we will be guided’, that is to say, [we will become] believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالُوا يَا أَيُّهَا السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ إِنَّنَا لَمُهْتَدُونَ (49)عطف على { وأخذناهم بالعذاب } \\[ الزخرف : 48 \\] . والمعنى : ولما أخذناهم بالعذاب على يد موسى سألوه أن يدعو الله بكشف العذاب عنهم . ومخاطبتهم موسى بوصف الساحر مخاطبة تعظيم تزلفاً إليه لأن الساحر عندهم كان هو العالم وكانت علوم علمائهم سِحرية ، أي ذات أسباب خفية لا يعرفها غيرهم وغيرُ أتباعهم ، ألاَ تَرى إلى قول ملأ فرعون له { وابعث في المدائن حاشرين يأتوك بكل سَحَّار عليم } \\[ الشعراء : 36 ، 37 \\] .وكان السحر بأيدي الكهنة ومن مَظاهره تحنيط الموتى الذي بقيت به جثث الأموات سالمة من البِلى ولم يطلع أحد بعدهم على كيفية صنعه . وفي آية الأعراف ( 134 ) { قالوا يا موسى ادعُ لنا ربّك } ولا تُنافي ما هنا لأن الخطاب خطاب إلحاححٍ فهو يتكرر ويعاد بطرق مختلفة .وقرأ الجمهور { باأيه الساحر } بدون ألف بعد الهاء في الوصل وهو ظاهر ، وفي الوقف أي بفتحة دون ألف وهو غير قياسي لكن القراءة رواية . وعلله أبو شامة بأنهم اتبعوا الرّسم وفيه نظر . وقرأه أبو عمرو والكسائي ويعقوب بإثبات الألف في الوقف . وقرأه ابن عامر بضم الهاء في الوصل خاصة وهو لغة بني أسد ، وكتبت في المصحف كلمة { أيُّهَ } بدون ألف بعد الهاء ، والأصل أن تكون بألف بعد الهاء لأنها ( ها ) حرف تنبيه يفصل بين ( أيّ ) وبين نعتها في النداء فحذفت الألف في رسم المصحف رعياً لقراءة الجمهور والأصل أن يراعى في الرسم حالة الوقف .وعنَوا ب { ربّك } الرب الذي دعاهم موسى إلى عبادته . والقبط كانوا يحسبون أن لكل أمةٍ ربّاً ولا يحيلون تعدد الآلهة ، وكانت لهم أرباب كثيرون مختلفة أعمالهم وقُدَرهم ومثل ذلك كانت عقائد اليونان .وأرادوا { بما عهد عندك } ما خصك بعلمه دون غيرك مما استطعت به أن تأتي بخوارق العادة . وكانوا يحسبون أن تلك الآيات معلولة لعلل خفية قياساً على معارفهم بخصائص بعض الأشياء التي لا تعرفها العامة ، وكان الكهنة يعهدون بها إلى تلامذتهم ويوصونهم بالكتمان .والعهد : هو الائتمان على أمر مهمّ ، وليس مرادهم به النبوءة لأنهم لم يؤمنوا به وإذ لم يعرفوا كنه العهد عبروا عنه بالموصول وصلته . والباء في قوله : { بما عهد عندك } متعلقة ب { ادع } وهي للاستعانة . ولما رأوا الآيات علموا أن رب موسى قادر ، وأن بينه وبين موسى عهداً يقتضي استجابة سؤله .وجملة { إننا لمهتدون } جواب لكلام مقدر دل عليه { ادع لنا ربك } أي فإن دعوت لنا وكشفت عنا العذاب لنُؤمَنَنّ لك كما في آية الأعراف ( 134 ) { لئن كشفت عنا الرِّجْزَ لنؤمنَنّ لك } الآية . ف ( مهتدون ) اسم فاعل مستعمل في معنى الوعد وهو منصرف للمستقبل بالقرينة كما دلّ عليه قوله : { ينكثون } \\[ الزخرف : 50 \\] ونظيره قوله في سورة الدخان ( 12 ، 13 ) حكاية عن المشركين { ربنا اكشف عنّا العذاب إنا مؤمنون أنّى لهم الذكرى } الآية . وسَمَّوا تصديقهم إياه اهتداء لأن موسى سمى ما دَعاهم إليه هَدْياً كما في آية النازعات ( 19 ) { وأهْدِيَكَ إلى ربّك فتخشى }\n\n",
      "translations": [
        {
          "translation": "(And they said: wizard) knowledgeable wizard, as a form of respect, because magicians were venerated amongst them; (Entreat thy Lord for us by the pact that He hath made with thee) ask your Lord by the pact Allah made with you-the pact was that if they believed He will remove His punishment from them-this is why they asked him by the pact that Allah had made. (Lo! we verily will walk aright) we will believe in you and in that which you brought.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع ذلك لم يرجعوا بل { قَالُواْ } عند نزول البلاء وهجوم العناء مسترجعين نحوه\n منهمكين معه: { يَٰأَيُّهَ ٱلسَّاحِرُ } الماهر في السحر { ٱدْعُ لَنَا رَبَّكَ } الذي زعمت ألا منزل للمصيبة سواه\n ولا كاشف أيضاً إلا هو { بِمَا عَهِدَ عِندَكَ } أي: بمقتضى ما وعد لك وعهد معك ألا يعذب من آمن بك وصدقك\n فإنن انكشف الضر عنَّا بدعائك { إِنَّنَا لَمُهْتَدُونَ } [الزخرف: 49] بهدايتك مؤمنون لك\n مصدقون بنبوتك ورسالتك\n وبجميع ما دعوتنا إليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ادْعُ لنا ربك } يكشف عنا العذاب { بما عَهِدَ عندك } أي: لعهده عندك بأن دعوتك مستجابة\n أو: بما عهد عندك من النبوة والجاه\n أو: بما عهد من كشف العذاب عمن اهتدى\n { إِننا لمهتدون } مؤمنون أن كشف عنا بدعوتك\n كقوله:\n[الأعراف: 134]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:76",
      "similarity": 0.4576640986930605
    },
    {
      "verse": "9:75",
      "similarity": 0.44067958969149174
    },
    {
      "verse": "7:102",
      "similarity": 0.43613490925377635
    },
    {
      "verse": "37:15",
      "similarity": 0.4301371386779639
    },
    {
      "verse": "26:153",
      "similarity": 0.42330940683609114
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}