{
  "chapter": "الزخرف",
  "text": "وما نريهم من ءاية الا هى اكبر من اختها واخذنهم بالعذاب لعلهم يرجعون",
  "translations": [
    {
      "translation": "We showed them no Sign which was not greater than the one before it. We seized them with punishment so that hopefully they would turn back.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Even though) each miracle that We showed them was greater than the other. So We seized them with chastisement so that they may turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every Sign that We showed them was greater than its predecessor; and then We seized them with Our chastisement so that they may return (to the Right Way).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of all the miracles which We showed to them the latter ones were greater than the former. We struck them with torment so that perhaps they would return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all the signs We showed them were always greater than the earlier ones; and We seized them with calamities, so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not an Ayah We showed them but it was greater than its fellow preceding it, and We seized them with torment, in order that they might turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not show them a sign but it was greater than its like, and We overtook them with chastisement that they may turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not a sign We showed them, but it was greater than its sister sign; and We seized them with chastisement, that haply they should return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every token that We showed them was greater than its sister (token), and We grasped them with the torment, that haply they might turn again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though each sign We showed them was greater than the previous one. We afflicted them with torment so that they might return [to the right path].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not a sign We shewed them but it was greater than the like thereof; and We laid hold of them with the torment that haply they might turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not show them a sign but it was greater than the other, and We visited on them punishment so that they might come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed them Sign after Sign, each greater than its fellow, and We seized them with Punishment, in order that they might turn (to Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not an Ayah (sign, etc.) We showed them but it was greater than its fellow, and We seized them with torment, in order that they might turn [from their polytheism to Allah's Religion (Islamic Monotheism)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yet there was not a sign that We showed them that was not greater than its sister, and We seized them with the punishment so that they might return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each sign We showed them was more marvelous than its counterpart. And We afflicted them with the plagues, so that they may repent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We showed them not a sign except that it was greater than its sister, and We seized them with affliction that perhaps they might return [to faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:48] And We never showed them a sign, from among the signs of chastisement, such as the flood, which was when the waters [of the Nile] penetrated their dwellings and for seven days rose as high as their throats as they sat, or [the chastisement of] the locusts, but it was greater than the one before it, the one immediately preceding it. And We seized them with chastisement, that perhaps they might recant, their disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And every token) sign (that We showed them was greater than its sister (token)) that We sent before it, even so they refused to believe, (and we grasped them with the torment) with the flood, locusts, lice, frogs, blood, shortage of foodstuffs and years of drought, (that haply they might turn again) that haply they might desist from their disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الحال أنه { مَا نُرِيِهِم مِّنْ آيَةٍ } من الآيات { إِلاَّ هِيَ } أي: الآية المرئية في الحال { أَكْبَرُ } وأظهر دلالة على كمال قدرتنا وصدق نبينا { مِنْ أُخْتِهَا } أي: من الآية السابقة عليها، ومع ذلك أنكروا عليها واستهزءوا { وَ } بعدما بالغوا في العتو والعناد { أَخَذْنَاهُم بِٱلْعَذَابِ } العاجل من القحط والطاعون وغيرها { لَعَلَّهُمْ يَرْجِعُونَ } [الزخرف: 48] رجاء أن يرجعوا عن إنكارهم إصرارهم عليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما نُرِيهم من آيةٍ } من الآيات { إِلا هي أكْبرُ من أُختها } قرينتها، وصاحبتها التي كانت قبلها، أي: ما ظهر لهم آية إلا وهي بالغة أقصى مراتب الإعجاز، بحيث يجزم كل مَن ينظر إليها أنها أكبر من كل ما يُقاس بها من الآيات\n والمراد: وصف الكل بغاية الكِبرَ من غير ملاحظة قصور في شيء منها، قال النسفي: وظاهر النظم يدلّ على أن اللاحقة أعظم من السابقة، وليس كذلك، بل المراد بهذا الكلام: أنهن موصوفات بالكبر، كما يقال: هما أخوان، كلّ منهما أكبر من الآخر\n هـ\n وقال في الانتصاف: الظاهر: أن كل آية إذا أُفردت استغرقت الفكر وبهرته، حتى يجزم أنها النهاية، وأنَّ كل آية دونها، فإذا نقل الفكر إلى الأخرى كانت كذلك\n وحاصله: أنه لا يقدر الفكر أن يجمع بين آيتين، لتتميز الفاضلة من المفضولة\n هـ\n { وأخذناهم بالعذاب } وهو ما قال تعالى:\n\n[الأعراف: 130]،\n\n[الأعراف: 133] الآية\n { لعلهم يرجعون } لكي يرجعوا عما هم عليه من الضلال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:21",
      "similarity": 0.4775745120036673
    },
    {
      "verse": "49:10",
      "similarity": 0.4645332093917314
    },
    {
      "verse": "7:174",
      "similarity": 0.3929021447610882
    },
    {
      "verse": "20:23",
      "similarity": 0.378041003312563
    },
    {
      "verse": "79:20",
      "similarity": 0.367641318944954
    }
  ]
}