{
  "chapter": "الزخرف",
  "text": "وسـل من ارسلنا من قبلك من رسلنا اجعلنا من دون الرحمن ءالهة يعبدون",
  "translations": [
    {
      "translation": "Ask those We sent before you as Our Messengers: Have We ever designated any gods to be worshipped besides the All-Merciful?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Inquire of apostles We had sent before you if We appointed gods to be worshipped other than Ar-Rahman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask all Our Messengers whom We sent before you whether We had appointed any deities beside the Merciful One to be worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can ask Our Messengers whom We sent before you if We had commanded them to worship other gods besides the Beneficent God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask them – did any of the Noble Messengers We sent before you, appoint any other Gods except the Most Gracious, whom they used to worship?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask whom We sent before you of Our Messengers: \"Did We ever appoint gods to be worshipped besides the Most Gracious\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask those of Our apostles whom We sent before you: Did We ever appoint gods to be worshipped besides the Beneficent Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask those of Our Messengers We sent before thee: Have We appointed, apart from the All-merciful, gods to be served?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask those of Our messengers whom We sent before thee: Did We ever appoint gods to be worshipped beside the Beneficent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask those of Our messengers whom We sent before you, \"Did We ever appoint gods to be worshipped besides the Beneficent One?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask thou Our apostles whom We sent before thee: appointed We gods, beside the Compassionate, to be worshipped?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask those of Our apostles We have sent before you: Did We set up any gods to be worshipped besides the All-beneficent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And question thou our messengers whom We sent before thee; did We appoint any deities other than (Allah) Most Gracious, to be worshipped?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask (O Muhammad SAW) those of Our Messengers whom We sent before you: \"Did We ever appoint aliha (gods) to be worshipped besides the Most Beneficent (Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask Our Messengers whom We sent before you if We have ever made gods, other than the Merciful, to be worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask those of Our messengers We sent before you: “Did We appoint gods besides the Most Gracious to be worshiped?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask those We sent before you of Our messengers; have We made besides the Most Merciful deities to be worshipped?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:45] And ask those of Our messengers whom We sent before you: Did We [ever] appoint, besides the Compassionate One, that is to say, [any] other than Him, gods to be worshipped? It is said that this is to be understood literally, in other words, that God gathered for him all the messengers on the Night [of the] Journey; but it is also said that this meant [that he should ask] any communities belonging to either of the two Peoples of the Scripture. According to one of the two opinions, he never asked [anyone] since the point of this command to ask is to affirm to the idolaters of Quraysh that no messenger or scripture ever came from God with the command to worship [any] other than God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ask those of Our messengers) such as Jesus, Moses and Abraham; this was on the night when he was taken up to heaven and he led in prayer 7O Prophets, among whom were Abraham, Moses and Jesus. Allah commanded His Prophet, saying: ask them (whom We sent before thee) Muhammad: (Did We ever appoint gods to be worshipped beside the Beneficent) did We command that any other deity beside the Beneficent be worshipped? It is also said that this means: ask those unto whom We sent the messengers 569 before you, i.e. the people of Book, did We appoint any other deities beside the Beneficent to be worshipped? And it is also said that this means: ask them, did the messengers bring anything other than the profession of Allah's divine Oneness; the Prophet did not have to ask because he was certain that Allah did not appoint any other deities to be worshipped beside Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n[النحل: 127] وينسبونك إليه، { وَسْئَلْ مَنْ أَرْسَلْنَا مِن قَبْلِكَ مِن رُّسُلِنَآ } أي: أحبار قومهم وعلماء دينهم، وفتش أحوالهم عن آثارهم وأخبارهم وكتبهم الباقية بعدهم { أَجَعَلْنَا مِن دُونِ ٱلرَّحْمَـٰنِ } المنزه في ذاته عن الشركة والتعدد مطلقاً { آلِهَةً يُعْبَدُونَ } [الزخرف: 45] أي: هل حكمنا لهم، وأمرناهم باتخاذ آلهة سوى الحق، يُعبد لهم كعبادة الله، بل ما اتخذوا آلهتهم إلا بمقتضى آرائهم الباطلة وأهويتهم الفسادة، وما عبدوا لهم إلا ظلماً وزوراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:6",
      "similarity": 0.41060290433255886
    },
    {
      "verse": "37:27",
      "similarity": 0.4090581899353432
    },
    {
      "verse": "52:25",
      "similarity": 0.4090581899353432
    },
    {
      "verse": "37:50",
      "similarity": 0.40003822551947155
    },
    {
      "verse": "78:1",
      "similarity": 0.3632704088579984
    }
  ]
}