{
  "chapter": "الزخرف",
  "text": "وقالوا۟ يايه الساحر ادع لنا ربك بما عهد عندك اننا لمهتدون",
  "translations": [
    {
      "translation": "But they said: \"O sorcerer, call on your Lord for us in accordance with the compact He has made with you. We shall certainly come to guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Whenever they faced an affliction) they would say: “O magician, pray for us to your Lord according to your station with Him. We shall certainly be guided to the Right Way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Magician, pray to your Lord for us through your covenant with Him (If he saves us from the torment), we shall certainly seek guidance\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “O you magician! Pray for us to your Lord, by the means of His covenant which is with you; we will certainly come to guidance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said (to Musa): \"O you sorcerer! Invoke your Lord for us according to what He has made a pact with you. Verily, We shall guide ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: O magician! call on your Lord for our sake, as He has made the covenant with you; we shall surely be the followers of the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, 'Sorcerer, pray to thy Lord for us by the covenant He has made with thee, and surely we shall be right-guided.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: O wizard! Entreat thy Lord for us by the pact that He hath made with thee. Lo! we verily will walk aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Sorcerer, call on your Lord for us, by virtue of His pledge to you: we shall certainly accept guidance,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: magician! supplicate thy Lord for us for that which He hath covenanted with thee; verily we shall let ourselves be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would say, ‘O magician! Invoke your Lord for us by the covenant He has made with you [to remove this scourge]. We will indeed be guided [when it is removed].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, \"O thou sorcerer! Invoke thy Lord for us according to His covenant with thee; for we shall truly accept guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said [to Musa (Moses)]: \"O you sorcerer! Invoke your Lord for us according to what He has covenanted with you. Verily, We shall guide ourselves (aright).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sorcerer' they said, 'pray to your Lord for us in accordance to the covenant He has made with you, and surely we shall be rightly guided'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O sorcerer, pray to your Lord for us, according to His pledge to you, and then we will be guided.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said [to Moses], \"O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:49] And they said, to Moses, upon seeing the chastisement, ‘O sorcerer! — that is to say, ‘[O] knowledgeable, perfect one’, since for them sorcery was an awesome [form of] knowledge — supplicate your Lord for us by the covenant that He has made with you, [to the effect] that He would relieve us from chastisement if we believe. Assuredly we will be guided’, that is to say, [we will become] believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they said: wizard) knowledgeable wizard, as a form of respect, because magicians were venerated amongst them; (Entreat thy Lord for us by the pact that He hath made with thee) ask your Lord by the pact Allah made with you-the pact was that if they believed He will remove His punishment from them-this is why they asked him by the pact that Allah had made. (Lo! we verily will walk aright) we will believe in you and in that which you brought.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع ذلك لم يرجعوا بل { قَالُواْ } عند نزول البلاء وهجوم العناء مسترجعين نحوه، منهمكين معه: { يَٰأَيُّهَ ٱلسَّاحِرُ } الماهر في السحر { ٱدْعُ لَنَا رَبَّكَ } الذي زعمت ألا منزل للمصيبة سواه، ولا كاشف أيضاً إلا هو { بِمَا عَهِدَ عِندَكَ } أي: بمقتضى ما وعد لك وعهد معك ألا يعذب من آمن بك وصدقك، فإنن انكشف الضر عنَّا بدعائك { إِنَّنَا لَمُهْتَدُونَ } [الزخرف: 49] بهدايتك مؤمنون لك، مصدقون بنبوتك ورسالتك، وبجميع ما دعوتنا إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا يا أيُّه الساحِرُ } ، كانوا يقولون للعالِم: إنما هو ساحر لتعظيمهم علم السحر، أو: نادوه بذلك في مثل تلك الحالة لغاية عتوهم ونهاية حماقتهم وقرأ الشامي بضم الهاء، لاتباع حركة ما قبلها حين سقطت الألف، { ادْعُ لنا ربك } يكشف عنا العذاب { بما عَهِدَ عندك } أي: لعهده عندك بأن دعوتك مستجابة، أو: بما عهد عندك من النبوة والجاه، أو: بما عهد من كشف العذاب عمن اهتدى، { إِننا لمهتدون } مؤمنون أن كشف عنا بدعوتك، كقوله:\n",
      "translations": []
    }
  ]
}