{
  "chapter": "الزخرف",
  "text": "ولقد ارسلنا موسى بـايتنا الى فرعون وملاي۟ه فقال انى رسول رب العلمين",
  "translations": [
    {
      "translation": "We sent Musa with Our Signs to Pharaoh and his nobles. He said, 'I am the Messenger of the Lord of the worlds.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs to the Pharaoh and his nobles. He said: \"I have been sent by the Lord of all the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent Moses with Our Signs to Pharaoh and his nobles. He told them: “I am a Messenger of the Lord of the Universe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses to the Pharaoh and his nobles with Our miracles and he said, \"I am the Messenger of the Lord of the Universe\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Moosa along with Our signs towards Firaun and his chieftains – he therefore said, “Indeed I am a Noble Messenger of the Lord of the Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We did send Musa with Our Ayat to Fir`awn and his chiefs. He said: \"Verily, I am a Messenger of the Lord of all that exists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Musa with Our communications to Firon and his chiefs, so he said: Surely I am the apostle of the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We also sent Moses with Our signs to Pharaoh and his Council, and he said, 'Surely, I am the Messenger of the Lord of all Being.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We sent Moses with Our revelations unto Pharaoh and his chiefs, and he said: I am a messenger of the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs to Pharaoh and his nobles. He said, \"I am the messenger of the Lord of the Universe,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Musa with Our signs Unto Fir'awn and his chiefs, and he said: verily I am an apostle of the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Moses with Our signs to Pharaoh and his elite. He said, ‘I am indeed an apostle of the Lord of all the worlds.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did send Moses aforetime, with Our Signs, to Pharaoh and his Chiefs: He said, \"I am a messenger of the Lord of the Worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We did send Musa (Moses) with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to Fir'aun (Pharaoh) and his chiefs (inviting them to Allah's Religion of Islam) He said: \"Verily, I am a Messenger of the Lord of the 'Alamin (mankind, jinns and all that exists).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs to Pharaoh and his Council, and he said: 'I am the Messenger of the Lord of the Worlds'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our revelations to Pharaoh and his dignitaries. He said, “I am the Messenger of the Lord of the Worlds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly did We send Moses with Our signs to Pharaoh and his establishment, and he said, \"Indeed, I am the messenger of the Lord of the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:46] And verily We sent Moses with Our signs to Pharaoh and his council, namely, the Egyptians (al-Qibt), and he said, ‘I am indeed the messenger of the Lord of the Worlds’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We sent Moses with Our revelations) the hand and the staff (unto Pharaoh and his chiefs) and his folk the Copts, (and he said: I am a messenger of the Lord of the Worlds) to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَقَدْ أَرْسَلْنَا } أخاك { مُوسَىٰ بِآيَـٰتِنَآ } الدالة على توحيدنا { إِلَىٰ فِرْعَوْنَ } الطاغي المستعلي على من في الأرض { وَمَلإِيْهِ } المعاونين له في طغيانه { فَقَالَ } لهم بإذن منَّا وبمقتضى وحينا: { إِنِّي رَسُولُ رَبِّ ٱلْعَـٰلَمِينَ } [الزخرف: 46] أرسلني إليكم لأرشدكم إلى طريق توحيدي\n وأوضح لكم سبيل المعاد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولقد أرسلنا موسى بآياتنا } أي: متلبساً بآياتنا { إِلى فرعون وملَئِه فقال إِني رسولُ رب العالمين } فأجابوه بقولهم: { فأتنا بآية إن كنت من الصادقين } كما صرّح به في آية أخرى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:109",
      "similarity": 0.6807604432738279
    },
    {
      "verse": "23:46",
      "similarity": 0.6622936340920481
    },
    {
      "verse": "7:104",
      "similarity": 0.6218102872275993
    },
    {
      "verse": "7:103",
      "similarity": 0.530365272965454
    },
    {
      "verse": "7:60",
      "similarity": 0.5239947934439682
    }
  ]
}