{
  "chapter": "الزخرف",
  "text": "فاستخف قومه فاطاعوه انهم كانوا۟ قوما فسقين",
  "translations": [
    {
      "translation": "In that way he swayed his people and they succumbed to him. They were a people of deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he made light (of the matter) to his people, and they obeyed him. They were certainly wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He incited his people to levity and they obeyed him. Surely they were an iniquitous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, he made dimwits out of his people and they followed him. They, certainly, were a sinful people. When they invoked Our anger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had brainwashed his people, they followed him; indeed they were a disobedient nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he fooled his people, and they obeyed him. Verily, they were ever a people who were rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he incited his people to levity and they obeyed him: surely they were a transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he made his people unsteady, and they obeyed him; surely they were an ungodly people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he persuaded his people to make light (of Moses), and they obeyed him. Lo! they were a wanton folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this way he fooled his people and they obeyed him: they were a rebellious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he incited his people and they obeyed him; verily they were ever a transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did he mislead his people and they obeyed him. Indeed, they were a transgressing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did he make fools of his people, and they obeyed him: truly were they a people rebellious (against Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he [Fir'aun (Pharaoh)] befooled and misled his people, and they obeyed him. Verily, they were ever a people who were Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Pharaoh) intimidated his nation, so they obeyed him, for they were a sinning nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he fooled his people, and they obeyed him. They were wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he bluffed his people, and they obeyed him. Indeed, they were [themselves] a people defiantly disobedient [of Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:54] Thus did he, Pharaoh, persuade, incite, his people and they obeyed him, in his wish that Moses be denied. They were truly an immoral folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus he persuaded his people) the Copts (to make light (of Moses), and they obeyed him) in what he said. (Lo! they were a wanton folk) they were disbelieving folk. 570\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَٱسْتَخَفَّ قَوْمَهُ } وسفَّههم وضعَّف أحلامهم بامتثال هذه الهذيانات الباطلة { فَأَطَاعُوهُ } وقَبِلوا منه جميع ما قال عتواً وعناداً { إِنَّهُمْ } في أنفسهم { كَانُواْ قَوْماً فَاسِقِينَ } [الزخرف: 54] خارجين عن مقتضى العدالة الإلهية، لذلك انحرفوا عن سواء السبيل واتبعوا ذلك الفاسق الطاغي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو: فاستخف أحلامهم واستزلهم، { فأطاعوه } فيما أمرهم به { إِنهم كانوا قوماً فاسقين } ، خارجين عن الدين، فلذلك سارعوا إلى طاعته",
      "translations": []
    }
  ]
}