{
  "chapter": "الزخرف",
  "text": "ولما ضرب ابن مريم مثلا اذا قومك منه يصدون",
  "translations": [
    {
      "translation": "When an example is made of the son of Maryam your people laugh uproariously.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the example of Mary's son is quoted before them, your people cry out at it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No sooner the example of the son of Mary was mentioned than, lo and behold, your people raised a clamour\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the son of Mary was mentioned as an example, you people cried out in protest, saying,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the example of the son of Maryam is given, your people laugh at it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Maryam is quoted as an example, behold, your people cry aloud thereat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a description of the son of Marium is given, lo! your people raise a clamor thereat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Mary is cited as an example, behold, thy people turn away from it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Mary is quoted as an example, behold! the folk laugh out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When [Jesus] the son of Mary is held up as an example, your people raise an outcry on this,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Maryam is held up, an example, behold! thy people thereat cry out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Son of Mary was cited as an example, behold, your people raise an outcry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (Jesus) the son of Mary is held up as an example, behold, thy people raise a clamour thereat (in ridicule)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Maryam (Mary) is quoted as an example [i.e. 'Iesa (Jesus) is worshipped like their idols), behold! Your people cry aloud (laugh out at the example).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the son of Mary is mentioned as an example, your people turn away from it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Mary was cited as an example, your people opposed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the son of Mary was presented as an example, immediately your people laughed aloud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:57] And when the son of Mary is cited as an example — after God’s [following] words were revealed: ‘Truly you and what you worship besides God shall be fuel for Hell’ [Q. 21:98] and the idolaters said, ‘We are satisfied that our gods be together with Jesus [in Hell], for he too was worshipped besides God’ — behold! your people, that is, the idolaters, laugh at it, at this example — they clamour with joy at what they hear.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when the son of Mary is quoted as an example) they likened him to their deities, (behold! the folk laugh out) upon hearing the words of 'Abdullah al-Zib'ari and his folk,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ } وتُقراُ يَصُدون، فمَنْ قرأ بِضمِّ الصَّادِ، فإنهُ الإِعراضُ والصُدودُ، ومَنْ قَرأ بكسر الصَّادِ أرادَ أَنهم يَصيحون\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا ضُرِبَ ٱبْنُ مَرْيَمَ مَثَلاً } يعني: لما ضرب بن الزبعرى مثلاً بعيسى عليه السلام حين نزلت آية كرمية:\n\n[الأنبياء: 98] حيث قال مجادلاً مع رسول الله صلى الله عليه وسلم: إنك تزعم أن النصارى من أهل الكتاب، وأنهم يعبدون عيسى، ويعتقدونه ابن الله، والملائكة أولى بالمعبودية من عيسى، فسكت رسول الله صلى الله عليه وسلم\n\n\n\n\nوالقو لما سمعوا مجادلته، ورأوا سكوت الرسول صلى الله عليه وسلم من كلامه فهموا منه إلزام الرسول وإفحامه، فأوجسوا في نفوسهم إعراضاً، كما حكى عنهم سبحانه بقوله: { إِذَا قَوْمُكَ مِنْهُ } أي: من كلام ابن الزبعرى { يَصِدُّونَ } [الزخرف: 57] ويعرضون عنك فرحاً بأنك قد ألزمت من كلامه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولما ضُرب ابنُ مريمَ مثلا } ، وذلك أن رسول الله صلى الله عليه وسلم قرأ على قريش:\n\n[الأنبياء: 98] الآية، فغضبوا، فقال ابن الزِّبَعْرى: يا محمد! أخاصة لنا ولآلهتنا، أم لجميع الأمم؟ فقال عليه الصلاة والسلام:\n\n \" هو لكم ولآلهتكم ولجميع الأمم \" \n\n، فقالوا: ألست تزعم أن عيسى [نبي]، يُثنى عليه وعلى أمّه خيراً، وقد علمت أنَّ النصارى يعبدونهما؟ وعزيز يُعبد، والملائكة يُعبدون، فإن كان هؤلاء في النار، فقد رضينا أن نكون نحن وآلهتنا معهم، ففرحوا، وضحكوا، وسكت النبيُّ انتظاراً للوحي\n وفي رواية: فقال لهم صلى الله عليه وسلم:\n\n \" إنما عبدوا الشياطين التي أمرتهم بذلك \" \n\nوقال لابن الزبعرى:\n\n \" ما أجهلك بلغة قومك، أَمَا فهمت أن \" ما \" لِما لا يعقل، فهي خاصة بالأصنام \" \n\n، فأنزل الله:\n\n[الأنبياء: 101] الآية\n ونزلت هذه الآية\n والمعنى: ولما ضرب ابن الزبعرى عيسى { ابن مريم مثلاً } لآلهتهم، وجادل رسول الله صلى الله عليه وسلم بعبادة النصارى إياه { إِذا قومُك } قريش { منه } أي: من هذا المثل { يَصِدُّون } ترتفع لهم جلبة وضجيج، فرحاً وضحكاً، فهو من: الصديد، وهو الجلبة ورفع الصوت، ويؤيده: تعديته بمَن، ولو كان من الصدود لقال: \" عنه \" ، وقرئ بالكسر والضم، وقيل: هما لغتان، كيعكِفُون ويعكُفُون ويعرِشون ويعرُشُون، وقيل: بالكسر معناه: الصديد، أي: الضجيج والضحك، وبالضم معناه: الإعراض، فيكون من الصدود، أي: فهم من أجل هذا المثل يعرضون عن الحق، أي: يثبتون على ما كانوا عليه من الإعراض، أو يزدادون",
      "translations": []
    }
  ]
}