{
  "chapter": "الزخرف",
  "text": "افنضرب عنكم الذكر صفحا ان كنتم قوما مسرفين",
  "translations": [
    {
      "translation": "Shall We then deprive you of the Reminder for being a profligate people?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should We have withdrawn the Reminder from you as you are a people who exceed the bounds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should We divert this Good Counsel from you because you are a people immersed in extravagance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can We ignore sending you the Quran just because you are a transgressing people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So shall We divert the advice away from you, because you are a nation that exceeds the limits?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then take away the Reminder from you, because you are a people excessive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! shall We then turn away the reminder from you altogether because you are an extravagant people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We turn away the Remembrance from you, for that you are a prodigal people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We utterly ignore you because ye are a wanton folk?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should We withdraw the admonition from you because you are a people far gone in transgression?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then take away from you the Admonition because ye are a people extravagant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We keep back the Reminder from you and disregard you because you are an unrestrained lot?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then take away the Message from you and repel (you), for that ye are a people transgressing beyond bounds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then (warn you not and) take away the Reminder (this Quran) from you, because you are a people Musrifun\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We turn away the Remembrance from you because you are a sinful nation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We hold back the Reminder from you, since you are a transgressing people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then should We turn the message away, disregarding you, because you are a transgressing people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:5] Shall We turn away, [shall We] withhold, from you the Remembrance, the Qur’ān, utterly, an utter withholding, so that you are then neither commanded nor forbidden, because you are a profligate, an idolatrous, folk? No!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Shall We utterly ignore you) shall We remove from you, people of Mecca, the revelation and the Messenger? Or shall We leave you uncared for, without commands or prohibitions (because ye are a wanton folk) because you are idolatrous folk who do not believe in Allah, as is in His foreknowledge?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَنَضْرِبُ عَنكُمُ ٱلذِّكْرَ صَفْحاً } معناه ننركُكُم فلا تُحاسبون\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {Are the reminders to be cast aside from you carelessly?} Its meaning is: We will absolve you, so that you will not be held accountable.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أفنضرب عنكم الذكر } أي: أنهملكم ونصرف الذكر عنكم لإسرافكم وإنما كانت الحاجة إلى الذكر للإسراف، إذ لو كانوا على السيرة العادلة والطريقة الوسطى لما احتيج إلى التذكير بل التذكير يجب عند الإفراط والتفريط، ولهذا بعث الأنبياء في زمان الفترة\n قال الله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم استفهم سبحانه مهدداً مقرعاً، مشيراً إلى ما أودع سبحانه في استعدادات عباده من قابلية الهداية والرشاد، بقوله: { أَ } نهملكم أيها المجبولون على فطرة الهداية، ولم نرسل إليكم يرشدكم إلى ما جبلتم لأجله من قابلية الانكشاف لسرائر توحيدنا { فَنَضْرِبُ } أي: فنصرف { عَنكُمُ ٱلذِّكْرَ } أي: القرآن المبين لكم ما في نشأتكم وفطرتكم من الاطلاع والشعور على شئوننا وتجلياتنا الذاتية، وبالجملة: نعرض عنكم { صَفْحاً } إعراضاً وانصرافاً كلياً، مع كمال قابليتكم على الصلح وبالفوز بالفلاح { أَن كُنتُمْ } أي: أنهملكم لئن كنتم { قَوْماً مُّسْرِفِينَ } [الزخرف: 5] منحطين عن الاعتدال الفطري القسط الجبلي الذي جبلناكم عليه؛ والمعنى: أنهمل مقتضيات حكمتنا المودعة فيكم، إن كنتم في أنفسكم قوماً مسرفين في التمرد والإعراض؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وبعدما بيَّن علو شأنه، وبيَّن أنه أنزله بلغتهم ليعلموه، ويؤمنوا به، ويعملوا بما فيه، عقَّبَ ذلك بإنكار أن يكون الأمر بخلافه، فقال: { أفَنَضرِِبُ عنكم الذِكرَ } أي: ننحيه ونُبعده\n والضرب: مجاز، من قولهم: ضرب الغرائب عن الحوض\n وفيه إشعار باقتضاء الحكمة توجيه الذكر إليهم، وملازمته لهم، كأنه يتهافت عليهم ثم يضربه عنهم\n والفاء: للعطف على محذوف أي: أنهملكم فنضرب عنكم الذكر { صَفْحاً } أي: إعراضاً، مصدر، من: صفَح عنه: إذا أعرض، منصوب على أنه مفعول له، على معنى: أفنعزل عنكم إنزال القرآن، وإلزام الحجة به إعراضاً عنكم\n ويجوز أن يكون مصدراً مؤكداً لما دلّ عليه \" نضرب \" لأنه في معنى الصفح، كأنه قيل: أفنفصح صفحاً { أن كنتم قوماً مسرفين } ، أي: لأن كنتم منهمكين في الإسراف، مصرّين عليه لأن حالكم اقتضى تخيلتكم وشأنكم، حتى تموتوا على الكفر والضلالة، فتبقوا في العذاب الخالد، لكن بسعة رحمتنا لا نفعل ذلك، بل نهديكم إلى الحق، بإرسال الرسول الأمين، وإنزال الكتاب المبين\n ومَن قرأ بالكسر فشرط حُذف جوابه لدلالة ما قبله عليه، وهو من الشرط الذي يصدرُ عن الجازم بصحة الأمر، كما يقول الأجير: إن كنتُ عملتُ لك فوفّني حقي، وهو عالم بذلك\n وعبّر بـ \" أن \" إخراجاً للمحقق مخرج المشكوك لاستهجالهم، كأن الإسراف من حقه ألا يقع\n الإشارة: { حم } أي: حببناك، ومجدناك، وملكناك، وحق الكتاب المبين\n ثم استأنف فقال: { إنا جعلناه } أي: ما شرفناك به أنت وقومك { قرآناً عربياً } يفهمه مَن يسمعه { لعلكم تعقلون } عن الله، فتشكروا نعمه\n { وإنه في أُمّ الكتاب } أي: وإن الذي شرفناكم به في أُمّ الكتاب\n\n\nقال الرتجبي: أي: إنه صفتي، كان في ذاته منزهاً عن النقائص والافتراق - أي: منزهاً عن الحروف والأصوات، التي من شأنها التغيُّر، وعن التقديم والتأخير، وهو افتراق كلماته - إذ هما من صفات الحدث\n وأُم الكتاب عبارة عن ذاته القديم، لأنها أصل جميع الصفات، { لَدَيْنَا } معناه: ما ذكرنا أنه في أُمّ الكتاب عندنا { لعلِيّ } علا عن أن يدركه أحدٌ بالحقيقة، ممتنع من انتحال المبطلين، وتأويل الجاهلين، { حكيم } محكِم مبين\n وقال جعفر: عَلِيّ عن درك العباد وتوهمهم، حكيم فيما دبّر وأنشأ وقدّر\n هـ\n فانظره، فإنَّ هذه من صفات الحق، والكلام في أوصاف القرآن\n وقوله تعالى: { أَفَنَضْرِبُ عنكم الذِكْرَ صفحاً } الآية، قال القشيري: وفي هذه إشارة لطيفة، وهو: ألا يُقطع الكلامُ عمّن تمادى في عصيانه، وأسرف في أكثر شأنه، فأحرى أن مَنْ لم يُقَصّرْ في إيمانه، أو تَلَطَّخَ بعصيانه، ولم يَدْخُل خَلَلٌ في عرفانه، فإنه لا يَمْنَعَ عنه رؤية لطائف غفرانه\n هـ\n يعني: أن الحق جلّ جلاله لم يقطع كلامه عمن تمادى في ضلاله، فكيف يقطع إحسانه عمّن تمسك بإيمانه، ولو أكثر من عصيانه\n وكذلك أهل النسبة التصوفية، إذا اعوجّ أخوهم، لا يقطعون عنه كلامهم وإحسانهم، بل يلاطفونه، حتى يرجع، وهذا مذهب الجمهور\n ثم سلّى نبيه بمَن قبله، فقال: { وَكَمْ أَرْسَلْنَا مِن نَّبِيٍّ فِي ٱلأَوَّلِينَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:89",
      "similarity": 0.7259271179684743
    },
    {
      "verse": "15:85",
      "similarity": 0.5736974521359617
    },
    {
      "verse": "64:14",
      "similarity": 0.5661697521544516
    },
    {
      "verse": "24:22",
      "similarity": 0.5103271332921083
    },
    {
      "verse": "2:109",
      "similarity": 0.3690160364724456
    }
  ]
}