{
  "chapter": "الزخرف",
  "text": "ام انا۠ خير من هذا الذى هو مهين ولا يكاد يبين",
  "translations": [
    {
      "translation": "Am I (not) better than him who is contemptible, and cannot even express himself clearly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I better or this contemptible man who is scarcely able to express himself?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this lowly man who can barely express himself?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Or that I am better than him, for he is lowly – and he does not seem to talk plainly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this one (Musa) who is despicable and can scarcely express himself clearly\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! I am better than this fellow, who is contemptible, and who can hardly speak distinctly:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or am I better than this man, who is contemptible and scarcely makes things clear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am surely better than this fellow, who is despicable and can hardly make (his meaning) plain!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this contemptible man who can hardly make his meaning clear:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! I am better than this one who is depicable, and well- nigh cannot make himself plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this wretch who cannot even speak clearly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this (Moses), who is a contemptible wretch and can scarcely express himself clearly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this one [Musa (Moses)], who is Mahin [has no honour nor any respect, and is weak and despicable] and can scarcely express himself clearly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this contemptible (man), who can scarcely make things clear (because of the impediment of his speech)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Am I not better than this miserable wretch, who can barely express himself?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or am I [not] better than this one who is insignificant and hardly makes himself clear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:52] Or, do you perceive, in which case, am I not better than this one, namely, Moses, who is contemptible, feeble and lowly, and who can scarcely speak clearly?, [who can scarcely] articulate his speech, because of his lisp — which was the result of his [accidentally] placing a hot coal in his mouth when he was a child.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "I am surely better than this fellow, who is despicable) physically weak, (and can hardly make (his meaning) plain) his argument plain!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمْ أَنَآ خَيْرٌ مِّنْ هَـٰذَا ٱلَّذِي هُوَ مَهِينٌ } معناه بل أنا خيرٌ والمَهينُ: الضَعيفُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ أَنَآ } أي: بل أنا { خَيْرٌ مِّنْ هَـٰذَا } الساحر المدعي { ٱلَّذِي هُوَ مَهِينٌ } رذيل مهان، لا عزة له ولا مقدار { وَ } مع رذالته وسفالته { لاَ يَكَادُ يُبِينُ } [الزخرف: 52] يظهر ويعرب كلامه للكنة في لسانه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال: { أم أنا خير } مع هذه المملكة والبسْطة { مِن هذا الذي هو مَهينٌ } أي: ضعيف حقير، من: المهانة، وهي القلة\n { ولا يكاد يُبينُ } الكلام لما به من اللثة\n قاله افتراء عليه عليه السلام، وتنقيصاً له في أعين الناس، باعتبار ما كان في لسانه عليه السلام\n وقد كانت ذهبت عنه، لقوله تعالى:\n\n[طه: 36]\n والهمزة للتقرير، كأنه قال إثر ما عدّد من أسباب فضله، ومبادئ خيريته: أثبت عندكم واستقر لديكم أني أنا خير، وهذه حال، مِن هذا\n وإما متصلة، والمعنى: أفلا تبصرون أم تبصرون؟ فوضع قوله: { أما أنا خير } موضع \" تُبصرون \" لأنهم إذا قالوا: أنت خير فهم عنده بُصَراء\n وهذا من باب تنزيل السبب منزلة المسبب\n انظر أبا المسعود\n { فلولا أُلْقِيَ عليه أسَاوره من ذهب } أي: فهلاَّ أُلقي عليه مقاليد الملك إن كان صادقاً، لأنهم كانوا إذا سوّدوا رجلاً سوّروه بسوار، وطوّقوه بطوق من ذهب\n\n",
      "translations": []
    }
  ]
}