{
  "chapter": "الزخرف",
  "text": "فلولا القى عليه اسورة من ذهب او جاء معه الملئكة مقترنين",
  "translations": [
    {
      "translation": "Why have gold bracelets not been put upon his arms and why is there not a train of angels accompanying him?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why were then no bracelets of gold shed upon him from above, or angels sent down as a retinue with him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why were bracelets of gold not bestowed upon him? Why did a retinue of angels not accompany him as attendants?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why have bracelets of gold not been given to him and why have some angels not accompanied him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So why was he not bestowed with armlets of gold? Or angels should have come with him staying at his side!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then are not golden bracelets bestowed on him, or angels sent along with him\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why have not bracelets of gold been put upon him, or why have there not come with him angels as companions?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then have bracelets of gold not been cast on him, or angels not come with him conjoined?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, then, have armlets of gold not been set upon him, or angels sent along with him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and why have not armlets of gold been bestowed on him and why is there not a train of angels accompanying him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore, then, have bracelets of gold not been set upon him, and wherefore have not angels come with him accompanying\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why no bracelets of gold have been thrown to him, nor any angels accompany him as escorts?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why are not gold bracelets bestowed on him, or (why) come (not) with him angels accompanying him in procession?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then are not golden bracelets bestowed on him, or angels sent along with him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why have no armlets of gold been given him, or angels sent down successively with him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why are bracelets of gold not dropped on him, or they angels came with him in procession?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why have there not been placed upon him bracelets of gold or come with him the angels in conjunction?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:53] Why then, if he were being truthful, have bracelets of gold (asāwira, is the plural of aswira, which is the   plural of siwār, similar [in pattern] to [ghurāb] aghriba) not been cast on him — as according to their custom with those whom they made their leaders, dressing them with gold bracelets and gold necklaces — or the angels not come with him one after the other?’, in succession, to testify to his truthfulness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِنْ ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ (53)لمّا تضمن وصفُه موسى بمَهين ولا يكاد يبين أنه مكذّب له دعواه الرسالة عن الله فرع عليه قوله : { فلولا ألقي عليه أساورة من ذهب } ترقياً في إحالة كونه رسولاً من الله ، وفرعون لجهله أو تجاهله يخيّل لقومه أن للرسالة شعاراً كشعار الملوك .و ( لَولا ) حرف تحْضيض مستعمل في التعجيز مثل ما في قوله { وقالوا لولا نُزّل هذا القرآن على رجللٍ من القريتين عظيمٍ } \\[ الزخرف : 31 \\]والإلقاء : الرمي وهو مستعمل هنا في الإنزال ، أي هلاّ ألقي عليه من السماء أساورة من ذهب ، أي سَوَّره الرّب بها ليجعله ملكاً على الأمة . وقرأ الجمهور { أساورة } ، وقرأ حفص عن عاصم ويعقوب { أسورة } .والأساورة : جمع أُسْوار لغة في سِوَار . وأصل الجمع أساوير مخفف بحذف إشباع الكسرة ثم عوّض الهاء عن المحذوف كما عوضت في زنادقة جمع زِنديق إذ حقه زَناديق . وأما سوار فيجمع على أسورة .والسوار : حلقة عريضة من ذهب أو فضة تحيط بالرسغ ، هو عند معظم الأمم من حلية النساء الحرائر ولذلك جاء في المثل : لَو ذاتُ سوار لَطمَتْني أي لو حُرّة لطمَتْني ، قاله أحد الأسرى لطمته أمة لقوم هو أسيرهم . وكان السوار من شعار الملوك بفارس ومصر يلبَس المَلِك سوارين . وقد كان من شعار الفراعنة لبس سوارين أو أسورة من ذهب وربما جعلوا سوارين على الرسغين وآخرين على العضدين . فلما تخيّل فرعون أن رتبة الرسالة مثل المُلك حَسب افتقادها هو من شعار الملوك عندهم أمارة على انتفاء الرسالة .و { أو } للترديد ، أي إن لم تُلْق عليه أسَاورة من ذهب فلتجىءْ معه طوائف من الملائكة شاهدين له بالرسالة .ولم أقف على أنهم كانوا يثبتون وجود الملائكة بالمعنى المعروف عند أهل الدين الإلهي فلعل فرعون ذكر الملائكة مجاراة لموسى إذ لعله سمع منه أن لله ملائكة أو نحو ذلك في مقام الدعوة فأراد إفحامه بأن يأتي معه بالملائكة الذين يظهرون له .و { مقترنين } حال من { الملائكة } ، أي مقترنين معه فهذه الحال مؤكدة لِمعنى { معه } لئلا يحمل معنى المَعية على إرادة أن الملائكة تُؤيّده بالقول من قولهم : قرنتُه به فاقترن ، أي مقترنين بموسى وهو اقتران النصير لنصيره .\n\n",
      "translations": [
        {
          "translation": "(Why, then, have armlets of gold not been set upon him) as you yourselves are wearing, (or angels sent along with him) to help him and affirm the message with which he is sent?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ جَآءَ مَعَهُ ٱلْمَلاَئِكَةُ مُقْتَرِنِينَ } معناه رُفقاءُ\n\n",
      "translations": [
        {
          "translation": "\n\nThe meaning of the verse is that the angels came with him as companions.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n هلا أُلقي عليه أسورة { مِّن ذَهَبٍ } تدل على عزته وكرامته عنده وسيادته عند الناس\n إذ العادة حينئذ أن أهل الرئاسة والسيادة يُسورون ويطوفون بأسورة من ذهب { أَوْ } هلا { جَآءَ مَعَهُ ٱلْمَلاَئِكَةُ } من عند ربه { مُقْتَرِنِينَ } [الزخرف: 53] معه مجتمعين\n يعينونه فيما يعنيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ أو جاء معه الملائكةُ مقترنين } مقرونين يمشون معه\n مقترن بعضهم ببعض\n ليكونوا أعضاده وأنصاره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:124",
      "similarity": 0.45896807713821974
    },
    {
      "verse": "10:38",
      "similarity": 0.4478948911708442
    },
    {
      "verse": "2:23",
      "similarity": 0.4371265270731835
    },
    {
      "verse": "47:20",
      "similarity": 0.4186334949982843
    },
    {
      "verse": "24:1",
      "similarity": 0.40685365926679845
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}