{
  "chapter": "الزخرف",
  "text": "وقالوا۟ ءالهتنا خير ام هو ما ضربوه لك الا جدلۢا بل هم قوم خصمون",
  "translations": [
    {
      "translation": "They retort. 'Who is better then, our gods or him?' They only say this to you for argument's sake. They are indeed a disputatious people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"Are our deities better or he?\" They say this only for disputing. Surely they are a contentious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said: “Who is better, our deities or he?” They said so only out of contentiousness. They are a disputatious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are our gods any better than Jesus (for according to Muhammad), if our gods go to hell so too will Jesus. What they say is only a false argument. In fact, they are a quarrelsome people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Are our deities better or he?” They did not say this to you except to unjustly argue; in fact they are a quarrelsome people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"Are our gods better or is he\" They quoted not the above example except for argument. Nay! But they are a quarrelsome people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Are our gods better, or is he? They do not set it forth to you save by way of disputation; nay, they are a contentious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and say, 'What, are our gods better, or he?' They cite not him to thee, save to dispute;. nay, but they are a people contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: Are our gods better, or is he? They raise not the objection save for argument. Nay! but they are a contentious folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying, \"Are our gods better or him?\" -- they cite him only to challenge you: they are a contentious people --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: are our gods better, or is he? They mention him not to thee save for disputation. Aye! they are a people contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Are our gods better or he?’ They cite him to you only for the sake of contention. Indeed, they are a contentious lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Are our gods best, or he?\" This they set forth to thee, only by way of disputation: yea, they are a contentious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"Are our aliha (gods) better or is he ['Iesa (Jesus)]?\" They quoted not the above example except for argument. Nay! But they are a quarrelsome people. [(See VV. 21:97-101) - The Quran.]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and say: 'What are our gods better, or is he' They do not mention him to you except to dispute, truly, they are a contentious nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Are our gods better, or he?” They cited him only for argument. In fact, they are a quarrelsome people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, \"Are your gods better, or is he?\" They did not present the comparison except for [mere] argument. But, [in fact], they are a people prone to dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:58] And they say, ‘Are our gods better or he?’, Jesus. We are satisfied that our gods be [in the same predicament] with him. They only cite this, that is, the example, to you for the sake of contention, [merely] arguing with falsehood, for they know that [the particle] mā [of wa-mā ta‘budūna, ‘and what you worship’] refers [only] to non-rational beings and cannot therefore include Jesus, peace be upon him. Nay, but they are a contentious lot, an extremely disputatious folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And say) i.e. 'Abdullah al-Zib'ari: (Are our gods better) Muhammad, (or is he) i.e. Jesus the son of Mary? For if he is allowed in the Fire with the Christians, we are also allowed therein with our deities. (They raise not the objection) they do not mention Jesus the son of Mary (save for argument) save for wrangling and dispute. (Nay! but they are a contentious folk) they argue in defence of falsehood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أعرضوا واعتقدوا إلزامك من ذلك الطاغي { قَالُوۤاْ } أي: بعضهم لبعض: { ءَأَ ٰلِهَتُنَا } التي كنا نعبد نحن وأسلافنا أيضاً أياهم { خَيْرٌ أَمْ هُوَ } يعنون: إن محمداً الذي ادعى الرسالة من عنده\n وإنما قالوا ما قالوا له تهكماً واستهزاءً\n كما قال سبحانه: { مَا ضَرَبُوهُ لَكَ } مثلاً { إِلاَّ جَدَلاً } مجادلة ومراء { بَلْ هُمْ } في أنفسهم { قَوْمٌ خَصِمُونَ } [الزخرف: 58] مجادلون مكابرون في الخصومة\n وإجراء الباطل مجرى الحق وترويجه جدلاً ومغالطة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا آلهتُنا خيرٌ أَمْ هو } يعني أن آلهتنا عندك ليست بخير من عيسى، فإذا كان عيسى من حصب جهنم كان أمر آلهتنا هيناً\n أو: فإذا كان عيسى في النار، فلا بأس بكوننا مع آلهتنا فيها\n قال تعالى: { ما ضربوه لك إِلا جَدَلا } أي: ما ضربوا لك ذلك المثل إلا لأجل الجدال والخصام، لا لطلب الحق حتى يذعونا له عند ظهوره، { بل هم قوم خَصِمُونَ } أي: لُدّاً، شِدَاد الخصومة، مجبولون على اللجاج، وذلك أن الآية إنما قصدت الأصنام، بدليل التعبير بـ \" ما \" ، إلا أن ابن الزبعرى حدا عنه لمّا رأى كلام الله تعالى محتملاً لفظُه للعموم، مع علمه بأن المراد به أصنامهم، وجد للحيلة مساغاً، فصرف اللفظ إلى الشمول والإحاطة بكل معبود غير الله، على طريق اللجاج والجدال والمكابرة، وتوقَّح في ذلك، فصمت عنه صلى الله عليه وسلم حتى أجاب عنه ربه\n وقيل: لما سمعوا قوله تعالى:\n\n[آل عمران: 59] الآية، قالوا: نحن أهدى من النصارى، لأنهم عبدوا آدمياً، ونحن نعبد الملائكة، فنزلت\n\n\nفقولهم: آلهتنا خير، هو حينئذ تفضيل لآلهتهم على عيسى عليه السلام لأن المراد بهم الملائكة\n ومعنى: { ما ضربوه\n\n\n } الخ: ما قالوا هذا القول إلا للجدال\n وقيل: لما نزل: { إن مثل عيسى عند الله\n\n } الآية، قالوا: ما يريد محمد إلا أن نعبده كما عبد النصارى المسيح\n ومعنى \" يصدون \": يضجون ويسخرون، والضمير على هذا في \" أَم \" هو لمحمد صلى الله عليه وسلم، وغرضهم ومرادهم بالموازنة بينه وبين آلهتهم الاستهزاء به صلى الله عليه وسلم ويجوز أن يكون مرادهم التنصُّل عما أنكر عليهم من قولهم: الملائكة بنات الله، ومن عبادتهم لهم، كأنهم قالوا: ما قلنا بدعاً من القول، ولا فعلنا منكراً من الفعل، فإنَّ النصارى جعلوا المسيح ابن الله، وعبدوه، فنحن أرشد منهم قولاً وفعلاً، حيث نسبنا له الملائكة، وهم نسبوا إليه الأناسي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:96",
      "similarity": 0.5839596510760174
    },
    {
      "verse": "39:31",
      "similarity": 0.5563182914434479
    },
    {
      "verse": "38:64",
      "similarity": 0.5306144452230657
    },
    {
      "verse": "38:69",
      "similarity": 0.4768768390809309
    },
    {
      "verse": "50:28",
      "similarity": 0.4182970797453243
    }
  ]
}