{
  "chapter": "الزخرف",
  "text": "ان هو الا عبد انعمنا عليه وجعلنه مثلا لبنى اسرءيل",
  "translations": [
    {
      "translation": "He is only a slave on whom We bestowed Our blessing and whom We made an example for the tribe of Israel.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jesus) was only a creature whom We favoured and made an example for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was no more than a servant (of Ours), one upon whom We bestowed Our favours and whom We made an example (of Our infinite power) for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus was a servant of Ours to whom We had granted favors and whom We made as an example for the Israelites.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is purely a bondman (of Ours), whom We have favoured upon, and We made him an extraordinary example for the Descendants of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was not more than a servant. We granted Our favor to him, and We made him an example for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was naught but a servant on whom We bestowed favor, and We made him an example for the children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a servant We blessed, and We made him to be an example to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is nothing but a slave on whom We bestowed favour, and We made him a pattern for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but he was only a servant We favoured and made an example for the Children of Israel:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is naught but a bondman: him We favoured, and him We made an ensample Unto the Children of Israil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was just a servant whom We had blessed and made an exemplar for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was no more than a servant: We granted Our favour to him, and We made him an example to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He ['Iesa (Jesus)] was not more than a slave. We granted Our Favour to him, and We made him an example to the Children of Israel (i.e. his creation without a father).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Prophet Jesus) was only a worshiper whom We favored and We made him an example to the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was just a servant whom We blessed, and We made him an example for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus was not but a servant upon whom We bestowed favor, and We made him an example for the Children of Israel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:59] He, Jesus, is only a servant [of Ours] on whom We bestowed favour, through prophethood, and We made him, by his [coming into] being without a father, an exemplar for the Children of Israel, that is to say, like an example because of the wondrousness of his case, one from which one is able to infer God’s power, exalted be He, to do whatever He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is nothing) i.e. Jesus the son of Mary (but a slave on whom We bestowed favour) by entrusting him with the message and he is nothing like their deities, (and We made him a pattern) a lesson (for the Children of Israel) in that he was born without a father.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { إِنْ هُوَ } أي: ما عيسى { إِلاَّ عَبْدٌ } من جملة عبادنا { أَنْعَمْنَا عَلَيْهِ } بمقتضى فضلنا وجودنا\n وأظهرنا على يده من المعجزات الباهرة والخوارق الظاهرة الدالة على كمال قدرتنا { وَجَعَلْنَاهُ مَثَلاً } عجيباً وشأناً بديعاً { لِّبَنِيۤ إِسْرَائِيلَ } [الزخرف: 59] يسري بينهم أمر وجوده بلا أب وظهور الخوارق العجيبة عنه\n سيما في حال صباه وإرهاصات أمه كالمثل السائر\n كل ذلك من كمال قدرتنا وعلمنا\n ومتانة حكمتنا\n\n\n{ وَلَوْ نَشَآءُ لَجَعَلْنَا مِنكُمْ } أيضاً وأنشأنا بدلكم { مَّلاَئِكَةً } يسكنون { فِي ٱلأَرْضِ } مكلفين بالعبادة والعرفان أمثالكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقوله تعالى: { إن هو إِلا عبدٌ أنعمنا عليه } أي: ما عيسى إلا عبد، كسائر العبيد، أنعمنا عليه بالنبوة، { وجعلناه مثلاً لبني إِسرائيل } أي: أمراً عجيباً، حقيقاً بأن يسير ذكره كالأمثال السائرة، ففيه تنبيه على بطلان رفعه عن رتبة العبودية، أي: قصارى أمره أنه ممن أنعمنا عليه بالنبوة، وخصصناه ببعض الخواص البديعة، بأن خلقناه على وجهٍ بديع، وقد خلقنا آدم بوجه أبدع منه، فأين هو من رتبة الربوبية حتى يتوهم أنه رضي بعبادته مع الله؟ ومَن عبده فإنما عبد الشيطان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:47",
      "similarity": 0.6787402261081177
    },
    {
      "verse": "2:122",
      "similarity": 0.6787402261081177
    },
    {
      "verse": "26:197",
      "similarity": 0.6443136344796206
    },
    {
      "verse": "26:17",
      "similarity": 0.6392014167437935
    },
    {
      "verse": "26:22",
      "similarity": 0.6181618279982478
    }
  ]
}