{
  "chapter": "الزخرف",
  "text": "الاخلاء يومئذۭ بعضهم لبعض عدو الا المتقين",
  "translations": [
    {
      "translation": "On that Day the closest friends will be enemies to one another - except for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends will turn into enemies on that day, except those who fear and follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day even bosom friends shall become enemies to one another, all except the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All intimate friends on that day will become each others enemies except for the pious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Close friends will turn into enemies of one another on that Day, except the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that Day will be foes one to another except those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The friends shall on that day be enemies one to another, except those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that day shall be foes to one another, but the god-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that day will be foes one to another, save those who kept their duty (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, friends will become each other's enemies, except the righteous --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The intimate friends on that Day Will be hostile Unto one another save the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, friends will be one another’s enemies, except for the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that day will be foes, one to another,- except the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that Day will be foes one to another except Al-Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day close friends shall become enemies of each other, except those who fear (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, friends will be enemies of one another, except for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Close friends, that Day, will be enemies to each other, except for the righteous\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:67] Friends, [who shared] in acts of disobedience in this world, will, on that day, the Day of Resurrection (yawma’idhin is semantically connected to His [following] words) be foes of one another, except for the Godfearing, those who have love for one another through their [commitment to] obedience of God — such will be friends [on that day] and it will be said to them:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Friends) in sin, such as 'Uqbah Ibn Abi Ma'it and Ubayy Ibn Khalaf (on that day) on the Day of Judgement (will be foes one to another, save those who kept their duty (to Allah)) except those who ward off disbelief, idolatry and indecencies, such as Abu Bakr, 'Umar, 'Uthman, 'AN and their fellow believers, for these are not like that.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والقسم الرابع هو المحبة العقلية المستندة إلى تسهيل أسباب المعاش وتيسير المصالح الدنيوية كمحبة التجار والصناع ومحبة المحسن إليه للمحسن، فكل ما استند إلى غرض فانٍ وسبب زائل زال بزواله وانقلب عند فقدانه عداوة لتوقع كل من المتحابين ما اعتاد من صاحبه من اللذة المعهودة والنفع المألوف مع عدمه وامتناعه لزوال سببه، ولما كان الغالب على أهل العلم أحد القسمين الأخيرين أطلق الكلام وقال: { الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين } لانقطاع أسباب الوصلة بينهم وانتفاء الآلات البدنية عنهم وامتناع حصول اللذة الحسية والنفع الجسماني وانقلابهما حسرات وآلاماً وضرراً وخسراناً قد زالت اللذات والشهوات وبقيت العقوبات والتبعات، فكل يمحق صاحبه ويبغضه لأنه يرى ما به من العذاب منه وبسببه\n ثم استثنى المتقين المتناولين للقسمين الباقيين لقلتهم كما قال:\n\n[ص، الآية:24]،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلأَخِلاَّءُ } والأحباء { يَوْمَئِذٍ } من شدة الهول والفزع { بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ } إذ يتذكرون حينئذ ما جرى بينهم من المعاونة والمشاركة في الإعراض عن الله وكتبه ورسله، وعدم الانقياد والإطاعة للدين القويم { إِلاَّ ٱلْمُتَّقِينَ } [الزخرف: 67] أي: الأحياء الذين تحابوا في الله، وتشاركوا في طريق توحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { الأخلاءُ يومئذ بعضُهُم لبعضٍ عدو } أي: المتحابون في الدنيا على الأمور الذميمة متعادون يوم القيامة، يبغض بعضهم بعضاً، فتنقطع في ذلك اليوم كل خُلة كانت لغير الله، وتنقلب عدواة ومقتاً لانقطاع سببها، وهو الاجتماع على الهوى، { إِلا المتقين } أي: الأخلّة المصادقين في الله، فإنها الخُلة الباقية لأن خُلتهم في الدنيا لمَّا كانت لله، وفي الله، بقيت على حالها لأن ما ان لله دام واتصل، وما كان لغير الله انقطع وانفصل، بل تزداد خُلتهم بمشاهدة كل واحد منهم بركة خُلتهم من الثواب، ورفع الدرجات\n وسُئل صلى الله عليه وسلم: مَن أولياء الله الذين لا خوف عليهم ولا هم يحزنون؟ فقال:\n\n \" المتحابون في الله \" \n\n، وخرَّج البزار عن ابن عباس رضي الله عنه قيل: يا رسول الله! أَيُّ جُلَسَائِنا خيرٌ؟ قال:\n\n \" مَن ذكَّرَكُم بالله رؤيتُه، وزاد في عَمَلِكم مَنطِقُه وذكَّركُمْ بالله عِلمُه \"\n \n\nومن كلام الشيخ أبي مدين رضي الله عنه: دليل تخليطك صحبتك للمخلطين، ودليل انقطاعك إلى الله صحبتك للمنقطعين\n هـ\n في سماع العتبية: قال مالك: لا تصحبْ فاجراً لئلا تتعلَّم من فجور، قال ابن رُشد: لا ينبغي أن يُصحب إلا مَن يُقتدى به في دينه وخيره لأن قرين السوء يُردي، قال الحكيم:\n\nوفي الحديث:\n\n \" المَرْءُ على دينِ خَليله \" \n\nوسيأتي، في الإشارة بقية الكلام على المتحابين في الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:73",
      "similarity": 0.5148891699265378
    },
    {
      "verse": "2:254",
      "similarity": 0.4351490651736855
    },
    {
      "verse": "17:91",
      "similarity": 0.3884935273917852
    },
    {
      "verse": "4:125",
      "similarity": 0.3852586111021854
    },
    {
      "verse": "14:31",
      "similarity": 0.38190303512176577
    }
  ]
}