{
  "chapter": "الزخرف",
  "text": "ولما جاء عيسى بالبينت قال قد جئتكم بالحكمة ولابين لكم بعض الذى تختلفون فيه فاتقوا۟ الله واطيعون",
  "translations": [
    {
      "translation": "And when 'Isa came with the Clear Signs, he said, 'I have come to you with Wisdom and to clarify for you some of the things about which you have differed. Therefore have taqwa of Allah and obey me.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with the signs, he said: \"I have come to you with authority, and to explain some thing about which you are at variance. So fear God, and follow me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with Clear Signs and said: “I have brought wisdom to you that I may make plain to you some of the things you differ about. So fear Allah and follow me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with clear proof (in support of his truthfulness), he said, \"I have come to you with wisdom to clarify for you some of the matters in which you have disputes. Have fear of God and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Eisa came to them with clear signs, he said, “I have come to you with wisdom, and to explain to you some of the matters regarding which you dispute; therefore fear Allah, and obey me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when `Isa came with clear proofs, he said: \"I have come to you with Al-Hikmah, and in order to make clear to you some of that in which you differ. Therefore have Taqwa of Allah and obey me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Isa came with clear arguments he said: I have come to you indeed with wisdom, and that I may make clear to you part of what you differ in; so be careful of (your duty to) Allah and obey me:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Jesus came with the clear signs he said, 'I have come to you with wisdom, and that I may make clear to you some of that whereon you are at variance; so fear you God and obey you me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with clear proofs (of Allah's Sovereignty), he said: I have come unto you with wisdom, and to make plain some of that concerning which ye differ. So keep your duty to Allah, and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with clear signs, he said, \"Now I have come to you with wisdom, in order to make clear to you some of the things about which you dispute: therefore fear God and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Isa came with; evidences, he said: of a surety I have come Unto you with Wisdom, and to expound Unto you some of that wherein ye differ; so fear Allah and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus brought those manifest proofs, he said, ‘I have certainly brought you wisdom, and [I have come] to make clear to you some of the things that you differ about. So be wary of Allah and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with Clear Signs, he said: \"Now have I come to you with Wisdom, and in order to make clear to you some of the (points) on which ye dispute: therefore fear Allah and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when 'Iesa (Jesus) came with (Our) clear Proofs, he said: \"I have come to you with Al-Hikmah (Prophethood), and in order to make clear to you some of the (points) in which you differ, therefore fear Allah and obey me,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when (Prophet) Jesus came with clear signs, he said: 'I have come to you with wisdom and to clarify to you some of the matters about which you differ. Fear Allah and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus came with the clarifications, he said, “I have come to you with wisdom, and to clarify for you some of what you differ about. So fear God, and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Jesus brought clear proofs, he said, \"I have come to you with wisdom and to make clear to you some of that over which you differ, so fear Allah and obey me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:63] And when Jesus came with the clear signs, the miracles and the prescriptions [of the Law], he said, ‘Verily I have brought you wisdom, prophethood and the prescriptions of the Gospel, and [I have come] to make clear to you some of what you are at variance over, in the way of the rulings of the Torah for what concerns religion and otherwise — and he [indeed] made clear to them the matters of religion. So fear God and obey me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When Jesus came with clear proofs (of Allah's Sovereignty)) when he came with commands, prohibitions and marvels, (he said: I have come unto you with wisdom) with commands, prohibitions and prophethood, (and to make plain some of that concerning which ye differ) that which you contravene in the matter of religion. (So keep your duty to Allah) so fear Allah in that which He commands you, (and obey me) follow my counsel and words. 571\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلأُبَيِّنَ لَكُم بَعْضَ ٱلَّذِي تَخْتَلِفُونَ فِيهِ } معناه كُلُ الذي تَختلفونَ فيهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يكون عيسى عبداً من عبادنا، اذكر لهم يا أكمل الرسل { لَمَّا جَآءَ عِيسَىٰ } إلى بني إسرائيل من عندنا مؤيداً { بِٱلْبَيِّنَاتِ } الباهرة التي ما ظهر مثلها من نبي من الأنبياء { قَالَ } مظهراً لهم الدعوة إلى طريق الحق وتوحيده: { قَدْ جِئْتُكُم } من عند ربي { بِٱلْحِكْمَةِ } البالغة { وَ } إنما جئتكم { لأُبَيِّنَ } أوضح وأظهر { لَكُم } طريق العبودية والعرفان سيما { بَعْضَ ٱلَّذِي } أي: بعض المعالم الدينية التي { تَخْتَلِفُونَ فِيهِ } وفي نزوله في كتب الله، وعدم نزوله فيها { فَٱتَّقُواْ ٱللَّهَ } أولاً حق تقاته { وَأَطِيعُونِ } [الزخرف: 63] فيما جئت لكم من عنده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولما جاء عيسى بالبينات } بالمعجزات أو: بآيات الإنجيل أو: بالشرائع الواضحات { قال } لبني إسرائيل: { قد جئتكم بالحكمة } بالشريعة، أو: بالإنجيل المشتمل عليها { ولأُبَينَ لكم بعضَ الذي تختلفون فيه } وهو ما يتعلق بأمور الدين، وأما ما يتعلق بأمور الدنيا فليس بيانه من وظائف الأنبياء عليهم السلام كما قال صلى الله عليه وسلم:\n\n \" أنتم أعلمُ بدُنياكم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:55",
      "similarity": 0.3867902073716848
    },
    {
      "verse": "19:34",
      "similarity": 0.3615436500316009
    },
    {
      "verse": "5:116",
      "similarity": 0.34555480109830855
    },
    {
      "verse": "3:59",
      "similarity": 0.3356127315795466
    },
    {
      "verse": "61:6",
      "similarity": 0.30902109416262546
    }
  ]
}