{
  "chapter": "الزخرف",
  "text": "وانه لعلم للساعة فلا تمترن بها واتبعون هذا صرط مستقيم",
  "translations": [
    {
      "translation": "He is a Sign of the Hour. Have no doubt about it. But follow me. This is a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is certainly the sign of the Hour (of change). So have no doubt about it, and listen to me. This is the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily he [i.e., Jesus) is a portent of the Hour. So be in no doubt concerning it and follow Me. This is the Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"Jesus is a sign of the Hour of Doom. Have no doubt about it and follow me; this is the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Eisa is a sign* of the Last Day, therefore do not ever doubt in the Last Day, and obey Me**; this is the Straight Path. (* The advent of Prophet Eisa to earth for the second time. ** By obeying the Noble Messenger.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he shall be a known sign for (the coming of) the Hour. Therefore have no doubt concerning it. And follow Me! This is the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely it is a knowledge of the hour, therefore have no doubt about it and follow me: this is the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is knowledge of the Hour; doubt not concerning it, and follow me. This is a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! verily there is knowledge of the Hour. So doubt ye not concerning it, but follow Me. This is the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is a sign of the Hour. Have no doubt about it. But follow me. This is a straight path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily he is a sign of the Hour wherefore dubitate not thereof, and follow Me: this is the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say,] ‘Indeed he is a portent of the Hour; so do not doubt it and follow me. This is a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (Jesus) shall be a Sign (for the coming of) the Hour (of Judgment): therefore have no doubt about the (Hour), but follow ye Me: this is a Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he ['Iesa (Jesus), son of Maryam (Mary)] shall be a known sign for (the coming of) the Hour (Day of Resurrection) [i.e. 'Iesa's (Jesus) descent on the earth]. Therefore have no doubt concerning it (i.e. the Day of Resurrection). And follow Me (Allah) (i.e. be obedient to Allah and do what He orders you to do, O mankind)! This is the Straight Path (of Islamic Monotheism, leading to Allah and to His Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the knowledge of the Hour. Have no doubt concerning it, and follow me. This is a Straight Path,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is a portent of the Hour, so have no doubt about it, and follow Me. This is a straight way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, Jesus will be [a sign for] knowledge of the Hour, so be not in doubt of it, and follow Me. This is a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:61] And indeed he, that is, Jesus, is a portent of the Hour — [the arrival of] it is known by the sending down of him — so do not doubt it (tamtarunna: the indicative nūn has been omitted for apocopation together with the wāw of the [third] person [plural] on account of two unvowelled consonants coming together) but, say to them: ‘Follow me, in the affirmation of [God’s] Oneness. This, to which I command you, is a straight path’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! Verily) in the coming of Jesus the son of Mary (there is knowledge of the Hour) there is an indication of the coming of the Hour; it is also said that this means: his coming is a sign of the advent of the Hour. (So doubt ye not concerning it) so have no doubt in the coming of the Hour, (but follow Me) by professing Allah's divine Oneness. (This) profession of divine Oneness (is the right path) an established religion with which Allah is pleased: i.e. the religion of Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّهُ لَعِلْمٌ لِّلسَّاعَةِ } معناه خُروجُ عِيسى بن مريم عليهِ السَّلامُ\n\n\n\n\nوقوله تعالى: { فَلاَ تَمْتَرُنَّ بِهَا } معناه لا تَشُكَّنَّ فيها\n\n",
      "translations": [
        {
          "translation": " And His saying, {Indeed, he is knowledge of the Hour} [means that] 'Eesa ibn Maryam (peace be upon him) will come.\n\nAnd His saying, {So do not doubt it} [means that] do not disbelieve in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإنه لعلم للسَّاعة } أي: أنّ عيسى عليه السلام مما يعلم به القيامة الكبرى وذلك أن نزوله من أشراط الساعة\n قيل في الحديث:\n \" ينزل على ثنية من الأرض المقدسة اسمها أفيق وبيده حربة يقتل بها الدجال ويكسر الصليب ويهدم البيع والكنائس ويدخل بيت المقدس والناس في صلاة الصبح\n فيتأخر الإمام فيقدّمه عيسى عليه السلام ويصلي خلفه على دين محمد صلى الله عليه وسلم \" \nفالثنية المسماة أفيق إشارة إلى مظهره الذي يتجسد فيه\n والأرض المقدسة إلى المادة الطاهرة التي يتكون منها جسده\n والحربة إشارة إلى صورة القدرة والشوكة التي تظهر فيها\n وقتل الدجال بها إشارة إلى غلبته على المتغلب المضلّ الذي يخرج هو في زمانه\n وكسر الصليب وهدم البيع والكنائس إشارة إلى رفعه للأديان المختلفة\n ودخوله بيت المقدس إشارة إلى وصوله إلى مقام الولاية الذاتية في الحضرة الإلهية الذي هو مقام القطب\n وكون الناس في صلاة الصبح إشارة إلى اتفاق المحمديين على الاستقامة في التوحيد عند طلوع صبح يوم القيامة الكبرى بظهور نور شمس الوحدة\n وتأخر الإمام إشارة إلى شعور القائم بالدين المحمدي في وقته بتقدّمه على الكل في الرتبة لمكان قطبيته وتقديم عيسى عليه السلام إياه واقتداؤه به على الشريعة المحمدية إشارة إلى متابعته للملّة المصطفوية وعدم تغييره للشرائع وإن كان يعلمهم التوحيد العياني ويعرفهم أحوال القيامة اللكبرى وطلوع الوجه الباقي\n هذا إذا كان المهدي عيسى ابن مريم على ما روي في الحديث:\n \" لا مهدي إلا عيسى ابن مريم \" \n\n وإن كان المهدي غيره فدخوله بيت المقدس: وصوله إلى محل المشاهدة دون مقام القطب والإمام الذي يتأخر هو المهدي\n وإنما يتأخر مع كونه قطب الوقت مراعاة لأدب صاحب الولاية مع صاحب النبوة\n وتقديم عيسى عليه السلام إياه لعلمه بتقدمه في نفس الأمر لمكان قطبيته وصلاته خلفه على الشريعة المحمدية اقتداؤه به تحقيقاً للاستفاضة منه ظاهراً وباطناً والله أعلم\n وإنما قال: { واتبعون هذا صراط مستقيم } لأن الطريقة المحمدية هي صراط الله لكونه باقياً به بعد الفناء فدينه دين الله وصراطه صراط الله واتباعه اتباع الله\n فلا فرق بين قوله: { وَٱتَّبِعُونِ } \n وقوله: واتبعوا رسولي\n ولهذا كان متابعته تورث محبة الله إذ طريقه هي طريق الوحدة الحقيقية التي لا استقامة إلا لها ولهذا لم يسع عيسى إلا اتباعه عند الوصول إلى الوحدة وارتفاع الاثنينية يوجب المحبة الحقيقية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَإِنَّهُ } أي: شأن الظهورات المنبهة عليها والتطورات المشارة بها { لَعِلْمٌ } دليل لائح وبرهان واضح { لِّلسَّاعَةِ } الموعودة المعهودة { فَلاَ تَمْتَرُنَّ بِهَا } وبقيامها { وَ } بالجملة: { ٱتَّبِعُونِ } في جميع ما أنزلت لكم في كتبي وعلى ألسنة رسلي\n وأطيعوا أمري وأمرهم { هَـٰذَا } الذي أشرناكم إليه { صِرَاطٌ مُّسْتَقِيمٌ } [الزخرف: 61] فاسلكوا فيه\n لعلكم تهتدون على توحيدي وتفوزون بالفوز العظيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والمستحق للعبادة يتعالى عن ذلك؟! { وإِنه } أي: عيسى عليه السلام { لَعِلْمٌ للساعة } أي: مما يعلم به مجيء الساعة عند نزوله\n وقرأ ابن عباس \" لَعَلَمٌ \" بفتح اللام\n أي: وإن نزوله لَعَلَم للساعة\n أو: وإن وجوده بغير أب\n وإحياءه للموتى\n دليل على صحة البعث\n الذي هو معظم ما ينكرة الكفرة\n وفي الحديث: إن عيسى عليه السلام ينزل على ثنية بالأرض المقدسة\n يقال لها: أَفِيق\n وهي عقبة بيت المقدس\n وعليه مُمَصَّرتان\n وشعر رأسه دهين\n وبيده حربة يقتل بها الدجال\n فيأتي بيت المقدس\n والناس في صلاة العصر\n والإمام يؤم بهم\n فيتأخر الإمام\n فيقدمه عيسى\n ويصلي خلفه على شريعة محمد صلى الله عليه وسلم\n ويقتل الخنزير\n ويكسر الصليب\n ويخرب البيعَ والكنائس\n ويقتل النصارى إلا مَن آمن به وبمحمد صلى الله عليه وسلم\n\nوقيل: الضمير للقرآن لأن فيه الإعلام بالساعة\n { فلا تمْتَرُنَّ بها } فلا تشكنَّ فيها\n من المرْية\n وهو الشك\n { واتبعونِ } أي: اتبعوا هداي وشرائعي\n أو: رسولي: وقيل: هو قول نبينا صلى الله عليه وسلم مأموراً به من جهته تعالى: { هذا } أي: الذي أدعوكم إليه { صراط مستقيم } موصل إلى الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:147",
      "similarity": 0.6447670451417707
    },
    {
      "verse": "44:50",
      "similarity": 0.6437175821376091
    },
    {
      "verse": "3:60",
      "similarity": 0.6052928741865358
    },
    {
      "verse": "53:12",
      "similarity": 0.595064227201656
    },
    {
      "verse": "15:63",
      "similarity": 0.5697771229554591
    }
  ]
}