{
  "chapter": "الزخرف",
  "text": "الاخلاء يومئذۭ بعضهم لبعض عدو الا المتقين",
  "translations": [
    {
      "translation": "On that Day the closest friends will be enemies to one another - except for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends will turn into enemies on that day, except those who fear and follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day even bosom friends shall become enemies to one another, all except the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All intimate friends on that day will become each others enemies except for the pious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Close friends will turn into enemies of one another on that Day, except the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that Day will be foes one to another except those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The friends shall on that day be enemies one to another, except those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that day shall be foes to one another, but the god-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that day will be foes one to another, save those who kept their duty (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, friends will become each other's enemies, except the righteous --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The intimate friends on that Day Will be hostile Unto one another save the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, friends will be one another’s enemies, except for the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that day will be foes, one to another,- except the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Friends on that Day will be foes one to another except Al-Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day close friends shall become enemies of each other, except those who fear (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, friends will be enemies of one another, except for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Close friends, that Day, will be enemies to each other, except for the righteous\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:67] Friends, [who shared] in acts of disobedience in this world, will, on that day, the Day of Resurrection (yawma’idhin is semantically connected to His [following] words) be foes of one another, except for the Godfearing, those who have love for one another through their [commitment to] obedience of God — such will be friends [on that day] and it will be said to them:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ (67) استئناف يفيد أمرين :أحدهما : بيان بعض الأهوال التي أشار إليها إجمال التهديد في قوله : { فويل للذين ظلموا من عذاب يوم أليم } \\[ الزخرف : 65 \\] .وثانيهما : موعظة المشركين بما يحصل يوم القيامة من الأهوال لأمثالهم والحَبرة للمؤمنين . وقد أوثر بالذكر هنا من الأهوال ما له مزيد تناسب لحال المشركين في تألبهم على مناواة الرّسول صلى الله عليه وسلم ودين الإسلام ، فإنهم ما ألَّبَهم إلا تناصرهم وتوادّهم في الكفر والتباهي بذلك بينهم في نواديهم وأسمارهم ، قال تعالى حكاية عن إبراهيم : { وقال إنّما اتخذتم من دون الله أوثاناً مودةَ بينكم في الحياة الدنيا ثم يومَ القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضاً } \\[ العنكبوت : 25 \\] وتلك شنشنة أهل الشرك من قبل .وفي معنى هذه الآية قوله المتقدم آنفاً { حتى إذا جَاآنا قال يا ليت بيني وبينك بعد المشرقين فبئس القرين } \\[ الزخرف : 38 \\] .و { الأخلاء } : جمع خليل ، وهو الصاحب الملازم ، قيل : إنه مشتق من التخلل لأنه كالمتخلّل لصاحبه والممتزج به ، وتقدم في قوله : { واتّخذ الله إبراهيم خليلاً } في سورة النساء ( 125 ) . والمضاف إليه ( إذْ ) من قوله : { يومئذٍ } هو المعوَّضُ عنه التنوين دلّ عليه المذكور قبله في قوله : { من عذاب يوم أليم } \\[ الزخرف : 65 \\] .والعدوّ : المبغض ، ووزنه فَعول بمعنى فاعل ، أي عَادٍ ، ولذلك استوى جريانه على الواحد وغيره ، وَالمُذكر وغيره ، وتقدم عند قوله تعالى : { فإن كان من قوممٍ عدوّ لكم } في سورة النساء ( 92 ) .وتعريف الأخلاء } تعريف الجنس وهو مفيد استغراقاً عرفياً ، أي الأخلاّء من فريقي المشركين والمؤمنين أو الأخلاء من قريش المتحدّث عنهم ، وإلاّ فإن من الأخلاء غير المؤمنين من لا عداوة بينهم يومَ القيامة وهم الذين لم يستخدموا خلتهم في إغراء بعضهم بعضاً على الشرك والكفر والمعاصي وإن افترقوا في المنازل والدرجات يوم القيامة .\n\n",
      "translations": [
        {
          "translation": "(Friends) in sin, such as 'Uqbah Ibn Abi Ma'it and Ubayy Ibn Khalaf (on that day) on the Day of Judgement (will be foes one to another, save those who kept their duty (to Allah)) except those who ward off disbelief, idolatry and indecencies, such as Abu Bakr, 'Umar, 'Uthman, 'AN and their fellow believers, for these are not like that.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولما كان الغالب على أهل العلم أحد القسمين الأخيرين أطلق الكلام وقال: { الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين } لانقطاع أسباب الوصلة بينهم وانتفاء الآلات البدنية عنهم وامتناع حصول اللذة الحسية والنفع الجسماني وانقلابهما حسرات وآلاماً وضرراً وخسراناً قد زالت اللذات والشهوات وبقيت العقوبات والتبعات\n فكل يمحق صاحبه ويبغضه لأنه يرى ما به من العذاب منه وبسببه\n ثم استثنى المتقين المتناولين للقسمين الباقيين لقلتهم كما قال:\n[ص\n الآية:24]\n\n[سبأ\n الآية:13]\n ولعمري إن القسم الأول أعزّ من الكبريت الأحمر وهم الكاملون في التقوى البالغون إلى نهايتها\n الفائزون بجميع مراتبها\n اجتنبوا أولاً المعاصي ثم الفضول ثم الأفعال ثم الصفات ثم الذوات\n فما بقيت منهم بقايا حتى يتنافسوا فيها ويضنوا بها عن حبيبهم فيفسد محبتهم\n بل ما بقي منهم إلا نفس الحب\n وأما الفريق الثاني فاقتصروا على الرتبة الأولى وقنعوا بظاهر التقوى فرضوا من الآخرة بما أوتوا من النعيم وتسلوا عن الدنيا وما فيها بالفضل الجسيم فأبقى محباتهم فيما بينهم لبقاء أسبابها وهي الصفات المتماثلة والهيئات المتشابهة في ابتغاء مرضاة الله وطلب ثوابه واجتناب سخط الله وعقابه\n فهم العباد المرتضون أي كلا القسمين لاشتراكهما في طلب الرضا فلذلك نسبهم إلى نفسه بقوله: يا عباد لا خوف على الفريقين لأمنهم من العقاب ولا هم يحزنون على فوات لذات الدنيا لكونهم على ألذ منها وأبهج وأحسن حالاً وأجمل\n وإن تفاوت حالهم في اللذة والسرور والروح والحبور بما لا يتناهى\n وشتان بين محمد ومحمد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلأَخِلاَّءُ } والأحباء { يَوْمَئِذٍ } من شدة الهول والفزع { بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ } إذ يتذكرون حينئذ ما جرى بينهم من المعاونة والمشاركة في الإعراض عن الله وكتبه ورسله\n وعدم الانقياد والإطاعة للدين القويم { إِلاَّ ٱلْمُتَّقِينَ } [الزخرف: 67] أي: الأحياء الذين تحابوا في الله\n وتشاركوا في طريق توحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { الأخلاءُ يومئذ بعضُهُم لبعضٍ عدو } أي: المتحابون في الدنيا على الأمور الذميمة متعادون يوم القيامة\n يبغض بعضهم بعضاً\n فتنقطع في ذلك اليوم كل خُلة كانت لغير الله\n وتنقلب عدواة ومقتاً لانقطاع سببها\n وهو الاجتماع على الهوى\n { إِلا المتقين } أي: الأخلّة المصادقين في الله\n فإنها الخُلة الباقية لأن خُلتهم في الدنيا لمَّا كانت لله\n وفي الله\n بقيت على حالها لأن ما ان لله دام واتصل\n وما كان لغير الله انقطع وانفصل\n بل تزداد خُلتهم بمشاهدة كل واحد منهم بركة خُلتهم من الثواب\n ورفع الدرجات\n وسُئل صلى الله عليه وسلم: مَن أولياء الله الذين لا خوف عليهم ولا هم يحزنون؟ فقال:\n \" المتحابون في الله \" \n\n وخرَّج البزار عن ابن عباس رضي الله عنه قيل: يا رسول الله! أَيُّ جُلَسَائِنا خيرٌ؟ قال:\n \" مَن ذكَّرَكُم بالله رؤيتُه\n وزاد في عَمَلِكم مَنطِقُه وذكَّركُمْ بالله عِلمُه \"\n \nومن كلام الشيخ أبي مدين رضي الله عنه: دليل تخليطك صحبتك للمخلطين\n ودليل انقطاعك إلى الله صحبتك للمنقطعين\n هـ\n في سماع العتبية: قال مالك: لا تصحبْ فاجراً لئلا تتعلَّم من فجور\n قال ابن رُشد: لا ينبغي أن يُصحب إلا مَن يُقتدى به في دينه وخيره لأن قرين السوء يُردي\n قال الحكيم:\nوفي الحديث:\n \" المَرْءُ على دينِ خَليله \" \nوسيأتي\n في الإشارة بقية الكلام على المتحابين في الله\n ويقال لهم حينئذ\n تشريفاً لهم\n وتطييباً لقلوبهم: { يا عبادي لا خوف عليكم اليوم ولا أنتم تحزنون } \n ثم وصفهم أو مدحهم بقوله: { الذين آمنوا بآياتنا } صدّقوا بآياتنا التنزيلية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:73",
      "similarity": 0.5148891699265378
    },
    {
      "verse": "2:254",
      "similarity": 0.4351490651736855
    },
    {
      "verse": "17:91",
      "similarity": 0.3884935273917852
    },
    {
      "verse": "4:125",
      "similarity": 0.3852586111021854
    },
    {
      "verse": "14:31",
      "similarity": 0.38190303512176577
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043067.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043067.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:67.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}