{
  "chapter": "الزخرف",
  "text": "فاختلف الاحزاب منۢ بينهم فويل للذين ظلموا۟ من عذاب يوم اليم",
  "translations": [
    {
      "translation": "The various factions among them differed. Woe then to those who did wrong on account of the punishment of a painful Day!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the factions differed among themselves. Woe alas to the sinners for the torment of the grievous Day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the factions fell apart among themselves. So woe to the wrong-doers from the chastisement of a grievous Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But certain groups created differences among themselves. Woe to the unjust. They will face a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the groups differed amongst themselves; therefore ruin is for the unjust by the punishment of an agonising day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the sects from among themselves differed. So woe to those who do wrong from the torment of a painful Day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But parties from among them differed, so woe to those who were unjust because of the chastisement of a painful day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the parties among them fell into variance; so woe unto those who did evil, because of the chastisement of a painful day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the factions among them differed. Then woe unto those who do wrong from the doom of a painful day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The various factions among them differed -- woe then to those who did wrong: they will suffer the punishment of a painful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the sects differed among themselves. Woe then Unto those who do Wrong because of the torment of an afflictive Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the factions differed among themselves. So woe to the wrongdoers for the punishment of a painful day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But sects from among themselves fell into disagreement: then woe to the wrong-doers, from the Penalty of a Grievous Day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the sects from among themselves differed. So woe to those who do wrong (by ascribing things to 'Iesa (Jesus) that are not true) from the torment of a painful Day (i.e. the Day of Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the parties differed among themselves. So woe to those who did evil among the punishment of a Painful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the factions differed among themselves. So woe to the wrongdoers from the suffering of a painful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the denominations from among them differed [and separated], so woe to those who have wronged from the punishment of a painful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:65] But the factions differed among themselves, regarding [the status of] Jesus: was he God, or the son of God, or the third of Three [deities]? So woe (waylun is a term implying chastisement) to those who do wrong, [those] who blaspheme in what they say about Jesus, from the chastisement of a painful day.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَاخْتَلَفَ الْأَحْزَابُ مِنْ بَيْنِهِمْ فَوَيْلٌ لِلَّذِينَ ظَلَمُوا مِنْ عَذَابِ يَوْمٍ أَلِيمٍ (65)هذا التفريع هو المقصود من سوْق القصة مساق التنظير بين أحوال الرسل ، أي عَقِب دعوتَه اختلافُ الأحزاب من بين الأمة الذين بعث إليهم والذين تقلدوا ملته طلباً للاهتداء .وهذا التفريع دليل على جواب ( لمّا ) المحذوف .وضمير { بينهم } مراد به الذين جاءهم عيسى لأنهم معلومون من سياق القصة من قوله : { جاء عيسى } \\[ الزخرف : 63 \\] فإن المجيء يقتضي مجيئاً إليه وهم اليهود .و { من } يجوز أن تكون مزيدة لتأكيد مدلول { بينهم } أي اختلفوا اختلاف أمة واحدة ، أي فمنهم من صدق عيسى وهم : يحيى بن زكرياء ومريمُ أم عيسى والحواريون الاثنا عشر وبعض نساء مثل مريم المجدلية ونفر قليل ، وكفر به جمهور اليهود وأحبارهم ، وكان ما كان من تَألب اليهود عليه حتى رفعه الله . ثم انتشر الحواريون يدعون إلى شريعة عيسى فاتبعهم أقوام في بلاد رُومية وبلاد اليونان ولم يلبثوا أن اختلفوا من بينهم في أصول الديانة فتفرقوا ثلاث فرق : نسطورية ، ويعاقبة ، ومَلْكَانِيَّة . فقالت النسطورية : عيسى ابْن الله ، وقالت اليعاقبة : عيسى هو الله ، أي بطريق الحلول ، وقالت المَلْكَانية وهم الكاثوليك : عيسى ثالثُ ثلاثة مجموعها هو الإله ، وتلك هي : الأب الله ، والابنُ عيسى ، وروحُ القدس جبريل فالإله عندهم أقانيم ثلاثة .وقد شملت الآية كلا الاختلافين فتكون الفاء مستعملة في حقيقة التعقيب ومجازِه بأن يكون شمولها للاختلاف الأخير مجازاً علاقته المشابهة لتشبيه مفاجأة طروّ الاختلاف بين أتباعه مع وجود الشريعة المانعةِ من مثله كأنه حدث عقب بعثة عيسى وإن كان بينه وبينها زمان طويل دبَّت فيه بدعتهم ، واستعمال اللّفظ في حقيقته ومجازه شائع لأن المدار على أن تكون قرينة المجاز مانعة من إرادة المعنى الحقيقي وحده على التحقيق . وهذا الاختلاف أُجمِل هنا ووقع تفصيله في آيات كثيرة تتعلق بما تلقّى به اليهود دعوة عيسى ، وآيات تتعلق بما أحدثه النصارى في دين عيسى من زعم بنوّته من الله وإلهيته .ويجوز أن تكون { مِن } في قوله : { من بينهم } ابتدائية متعلقة ب ( اختلف ) أي نشأ الاختلاف من بينهم دون أن يُدخله عليهم غيرُهم ، أي كان دينهم سالماً فنشأ فيهم الاختلاف .وعلى هذا الوجه يختص الخلاف بأتباع عيسى عليه السلام من النصارى إذ اختلفوا فرقاً وابتدعوا قضية بنوّة عيسى من الله فتكون الفاء خالصة للتعقيب المجازي .وفرع على ذِكر الاختلاف تهديدُ بوعيد للذين ظلموا بالعذاب يوم القيامة تفريعَ التذييل على المذيَّل ، فالذين ظلموا يشمل جميع الذين أشركوا مع الله غيره في الإلهية { إن الشرك لظلمٌ عظيمٌ } \\[ لقمان : 13 \\] ، وهذا إطلاق الظلم غالباً في القرآن ، فعلم أن الاختلاف بين الأحزاب أفضى بهم أن صار أكثرهم مشركين بقرينة ما هو معروف في الاستعمال من لزوم مناسبة التذييل للمذيَّل ، بأن يكون التذييل يعمّ المذيَّل وغيرَه فيشمل عمومُ هذا التذييل مشركي العرب المقصودين من هذه الأمثال والعِبر ، ألاَ ترى أنه وقع في سورة مريم ( 37 ) قولُه { فاختَلف الأحزاب من بينهم فويل للذين كفروا من مشهد يوممٍ عظيمٍ } فجُعلت الصلة فعلَ كفروا لأن المقصود من آية سورة مريم الذين كفروا من النصارى ولذلك أردف بقوله : { لكن الظالمون اليوم في ضلاللٍ مبينٍ } \\[ مريم : 38 \\] لمَّا أريد التخلص إلى إنذار المشركين بعد إنذار النصارى .\n\n",
      "translations": [
        {
          "translation": "(But the factions) the Christians (among them differed) for some said he was the son of Allah, the Nestorians, some said he is Allah, the Jacobites, others said he is Allah's partner, the Melkites, and others said he is one of three hypostases, al-Marqusiyyah. (Then woe) severe punishment is (unto those who do wrong) to those who became different factions concerning Jesus (from the doom of a painful day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تم أمر الدعوة والتبليغ { فَٱخْتَلَفَ ٱلأَحْزَابُ } وتفرقا تفرقاً ناشئاً { مِن بَيْنِهِمْ } أي: من بين قومه المبعوث إليهم\n بعدما دعاهم إلى طريق الحق وتوحيده\n وهداهم إلى صراط مستقيم { فَوَيْلٌ } عظيم وعقاب شديد يتوقع { لِّلَّذِينَ ظَلَمُواْ } خرجوا عن مقتضى العبودية المأمورة لهم بالوحي الإلهي { مِنْ عَذَابِ يَوْمٍ أَلِيمٍ } [الزخرف: 65] مؤلم في غاية الإيلام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاختلف الأحزابُ } أي: الفرق المتحزِّبة بعد عيسى\n وهم: اليعقوبية والنسطورية\n والملكانية\n والشمعونية\n { من بينهم } أي: من بين النصارى\n أو: من بين مَن بُعِثَ إليهم من اليهود والنصارى\n أي: اختلافاً ناشئاً من بينهم\n من غير حجة ولا برهان\n { فَويلٌ للذين ظلموا } من المختلفين\n حيث قالوا في عيسى ما كفروا به\n { من عذاب يومٍ أليم } وهو يوم القيامة { هل ينظرون } أي: ما ينتظر أولئك الكفرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:37",
      "similarity": 0.8400398983435915
    },
    {
      "verse": "40:30",
      "similarity": 0.6016267433584516
    },
    {
      "verse": "5:56",
      "similarity": 0.535013091241532
    },
    {
      "verse": "33:22",
      "similarity": 0.49286615108877196
    },
    {
      "verse": "35:6",
      "similarity": 0.4306045272226321
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}