{
  "chapter": "الزخرف",
  "text": "هل ينظرون الا الساعة ان تاتيهم بغتة وهم لا يشعرون",
  "translations": [
    {
      "translation": "What are they waiting for, but the Hour to come upon them suddenly when they are not expecting it?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting (for any thing) but the Hour (of Doom) which would descend upon them suddenly, and catch them unawares?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they awaiting anything other than the Last Hour that it should suddenly come upon them without their even perceiving it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the Hour of Doom when the torment will suddenly strike them and they will not even realize from where it came?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they waiting for – except the Last Day, that it may suddenly come upon them while they are unaware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they only wait for the Hour that it shall come upon them suddenly while they perceive not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they wait for aught but the hour, that it should come! upon them all of a sudden while they do not perceive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they looking for aught but the Hour, that it shall come upon them suddenly, when they are not aware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they aught save the Hour, that it shall come upon them suddenly, when they know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they merely waiting for the Hour, which will come upon them suddenly and take them unawares?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await but the Hour: that it should come upon them of a sudden, while they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider that the Hour may overtake them suddenly while they are unaware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they only wait for the Hour - that it should come on them all of a sudden, while they perceive not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they only wait for the Hour that it shall come upon them suddenly, while they perceive not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they looking for anything except the Hour (to overtake them). It will come upon them suddenly when they are unaware!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they only waiting for the Hour to come upon them suddenly, while they are unaware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting except for the Hour to come upon them suddenly while they perceive not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:66] Are they, that is, the Meccan disbelievers, awaiting anything, that is to say — they are [in fact] awaiting nothing — but that Hour should come upon them (an ta’tiyahum substitutes for al-sā‘ata, ‘the Hour’) suddenly, unexpectedly, while they are unaware?, of the time of its coming beforehand.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ (66)استئناف بياني بتنزيل سامع قوله : { فويل للذين ظلموا من عذاب يوم أليم } \\[ الزخرف : 65 \\] مَنزلةَ من يطلب البيان فيسأل : متى يحلّ هذا اليوم الأليم؟ وما هو هذا الويل؟ فوردت جملة { هل ينظرون إلا الساعة أن تأتيهم بغتة } جواباً عن الشقّ الأول من السؤال ، وسيجيء الجواب عن الشق الثاني في قوله : { الأخلاء يومئذٍ بعضهم لبعضضٍ عدوّ } \\[ الزخرف : 67 \\] وفي قوله : { إن المجرمين في عذاب جهنم } \\[ الزخرف : 74 \\] الآيات .وقد جرى الجواب على طريقة الأسلوب الحكيم ، والمعنى : أن هذا العذاب واقع لا محالة سواء قرب زمان وقوعه أم بعُد ، فلا يريبكم عدم تعجيله قال تعالى : { قل أرأيتم إن أتاكم عذابُه بَيَاتاً أو نهاراً ماذا يستعجل منه المجرمون } \\[ يونس : 50 \\] ، وقد أشعر بهذا المعنى تقييد إتيان الساعة بقيد { بغتة } فإن الشيء الذي لا تسبقه أمارة لا يُدرَى وقتُ حلوله .و { ينظرون } بمعنى ينتظرون ، والاستفهام إنكاري ، أي لا ينتظرون بعد أن أشركوا لحصول العذاب إلا حلولَ الساعة . وعبر عن اليوم بالساعة تلميحاً لسرعة ما يحصل فيه .والتعريف في { الساعة } تعريف العهد . والبغتة : الفجأة ، وهي : حصول الشيء عن غير ترقّب .و { أن تأتيهم } بدل من { الساعة } بدلاً مطابقاً فإن إتيان الساعة هو عين الساعة لأن مسمى الساعة حلول الوقت المعيّن ، والحلول هو المجيء المجازي المراد هنا .وجملة { وهم لا يشعرون } في موضع الحال من ضمير النصب في { تأتيهم } . والشعور : العلم بحصول الشيء الحاصل .ولما كان مدلول { بغتة } يقتضي عدم الشعور بوقوع الساعة حين تقع عليهم كانت جملة الحال مؤكدة لِلجملة التي قبلها .\n\n",
      "translations": [
        {
          "translation": "Await they) if they do not repent of their claims (aught save the Hour) save the coming of the Hour, (that it shall come upon them suddenly, when they know not) when they are not aware of the descent of punishment upon them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ هل ينظرون إلاَّ الساعة أن تأتيهم } أي: ظهور المهدي دفعة وهم غافلون عنه { الأخلاء يومئذ بعضهم لبعض عدوّ إلاَّ المتَّقين } الخلة\n إما أن تكون خيرية أو لا\n والخيرية إما أن تكون في الله أو لله\n والغير الخيرية إما أن يكون سببها اللذة النفسانية أو النفع العقلي\n والقسم الأول هو المحبة الروحانية الذاتية المستندة إلى تناسب الأرواح في الأزل لقربها من الحضرة الأحدية وتساويها في الحضرة الواحدية التي قال فيها: فما تعارف منها ائتلف\n فهم إذا برزوا في هذه النشأة واشتاقوا إلى أوطانهم في القرب وتوجهوا إلى الحق وتجردوا عن ملابس الحس ومواد الرجس\n فلما تلاقوا تعارفوا وإذا تعارفوا تحابوا لتجانسهم الأصلي وتماثلهم الوضعي وتوافقهم في الوجه والطريقة\n وتشابههم في السيرة والغريزة وتجردهم عن الأغراض الفاسدة والأعراض الذاتية التي هي سبب العداوة\n وانتفع كل منهم بالآخر في سلوكه وعرفانه وتذكره لأوطانه والتذّ بلقائه وتصفّى بصفائه وتعاونوا في أمور الدنيا والآخرة فهي الخلة التامة الحقيقية التي لا تزول أبداً كمحبة الأولياء والأنبياء والأصفياء والشهداء\n والقسم الثاني هو المحبة القلبية المستندة إلى تناسب الأوصاف والأخلاق والسير الفاضلة\n ونشأته في الاعتقادات والأعمال الصالحة كمحبة الصلحاء والأبرار فيما بينهم ومحبة العرفاء والأولياء إياهم\n ومحبة الأنبياء العامة أممهم\n والقسم الثالث هو المحبة النفسانية المستندة إلى اللذات الحسية والأغراض الجزئية كمحبة الأزواج لمجرد الشهوة ومحبة الفجار والفساق المتعاونين في اكتساب الشهوات واجتلاب الأموال\n والقسم الرابع هو المحبة العقلية المستندة إلى تسهيل أسباب المعاش وتيسير المصالح الدنيوية كمحبة التجار والصناع ومحبة المحسن إليه للمحسن\n فكل ما استند إلى غرض فانٍ وسبب زائل زال بزواله وانقلب عند فقدانه عداوة لتوقع كل من المتحابين ما اعتاد من صاحبه من اللذة المعهودة والنفع المألوف مع عدمه وامتناعه لزوال سببه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَلْ يَنظُرُونَ } أي: ما ينظرون وينتظرون { إِلاَّ ٱلسَّاعَةَ } الموعودة قيامها { أَن تَأْتِيَهُمْ بَغْتَةً } فجأة بلا سبق مقدمة وأمارات { وَهُمْ } من غاية اشتغالهم بالملاهي الدنيوية { لاَ يَشْعُرُونَ } [الزخرف: 66] إيتانها إلا وقت وقوعهم في أهوالها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو قوم عيسى { إِلا الساعة أن تأتيهم }: بدل من \" الساعة \" أي: هل ينتظرون إلا إتيان الساعة { بغتةً } فجأة { وهم لا يشعرون } غافلون عن الاستعداد لها\n لاشتغالهم بأمر دنياهم\n أو: منكرون لها\n غير مترقبيبن وقوعها\n الإشارة: كانت الرسل - عليهم السلام - يُبينون لأممهم ما يقع فيه الاختلاف من أمر الدين\n سواء تعلّق ذلك بالظاهر أو بالباطن\n بما يوحى إليهم من إلهام\n أو بملَك مرسل\n فلما ماتوا بقي خلفاؤهم من العلماء والأولياء\n فالعلماء يُبينون ما اختُلِف فيه من الشرائع والعقائد\n بما عندهم من القواعد والبراهين\n والأولياء يُبينون الحقائق\n وما يتعلق بالقلوب من الشكوك والخواطر\n وسائر الأمراض\n بما عندهم من الأذواق والكشوفات\n فالعلماء يرجعون إلى كتبهم وعلومهم\n والأولياء يرجعون إلى قلوبهم وأذواقهم\n حتى كان فيما سلف من العلماء إذا توقفوا في مسألة عقلية أو قلبية أخذوا صوفيّاً أُميّاً فيسألونه\n ويجبرونه على الجواب\n فيجيبهم عن كل ما يسألونه\n كقصة أبي الحسن النوري مع القاضي\n وغيره\n وقد كان الشعراني يسأل شيخه الخواص - وهو أُمي - عن أمر معضلة\n فيجيب عنها\n حتى إن كتبه كلها مطرزة بكلامه رضي الله عنهم أجمعين\n وأهل الأذواق هم المتقون المتحابُّون في الله\n الذين أشار إليهم تعالى بقوله: { ٱلأَخِلاَّءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:202",
      "similarity": 0.8194781343002076
    },
    {
      "verse": "12:107",
      "similarity": 0.7806527086604275
    },
    {
      "verse": "39:55",
      "similarity": 0.7516818399349221
    },
    {
      "verse": "29:53",
      "similarity": 0.6400677793632629
    },
    {
      "verse": "6:47",
      "similarity": 0.5333511986952019
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043066.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043066.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:66.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}