{
  "chapter": "الزخرف",
  "text": "لكم فيها فكهة كثيرة منها تاكلون",
  "translations": [
    {
      "translation": "There will be many fruits in it for you to eat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will have fruits in abundance there to eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Herein you will have abundant fruits of which you will eat.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will have abundant fruits therein to consume\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“For you are many fruits in it, for you to eat therefrom.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein for you will be fruits in plenty, of which you will eat (as you desire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you therein are many fruits of which you shall eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein you have abundant fruits, whereof you may eat.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein for you is fruit in plenty whence to eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there is abundant fruit in it for you to eat.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you therein will be fruits in plenty whereof ye will eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are abundant fruits for you in it, from which you will eat.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye shall have therein abundance of fruit, from which ye shall have satisfaction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein for you will be fruits in plenty, of which you will eat (as you desire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall have therein abundant fruit to eat'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein you will have abundant fruit, from which you eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you therein is much fruit from which you will eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:73] Therein are abundant fruits for you, from which, that is, parts of which, you will eat’, for whatever is eaten is [immediately] replaced [with more of the same].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therein) in the Garden (for you is fruit) different kinds of fruit (in plenty whence to eat.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { لَكُمْ فِيهَا فَاكِهَةٌ كَثِيرَةٌ } من المستلذات الروحانية والجسمانية { مِّنْهَا تَأْكُلُونَ } [الزخرف: 73] ومنها تتفكهون جزاءً بما كنت تعملون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لكم فيها فاكهةُ كثيرة } بحسب الأنواع والأصناف، لا بحسب الأفراد فقط، { منها تأكلون } أي: لا تأكلون إلا بعضها، وأعقابها باقية في أشجارها على الدوام، لا ترى فيها شجراً خلت عن ثمرها لحظة، فهي مزيّنة بالثمار أبداً، موقورة بها، وعن النبي صلى الله عليه وسلم:\n\n \" لا ينزع رجل في الجنة من ثمرها إلا نبت في مكانها مثلاها \"\n \n\nالإشارة: كل خُلة وصحبة تنقطع يوم القيامة، إلاَّ خُلة المتحابين في الله، وهم الذين ورد في الحديث: أنهم يكونون في ظل العرش، والناس في حر الشمس، يغشى نورُهم الناسَ في المحشر، يغبطهم النبيون والشهداء لمنزلتهم عند الله\n قيل: يا رسول الله، مَن هؤلاءِ؟ صفهم لنا لنعرفهم، قال:\n\n \" رجالٌ من قبائلَ شتى، يجتمعون على ذكر الله \"\n \n\nوقد ورد فيهم أحاديث، منها: حديث الموطأ، عن معاذ، قال: سمعت رسول الله صلى الله عليه وسلم يقول: \" قال الله تعالى:\n\n \" وَجَبَتْ محَبتِّي للمُتَحَابِّين فِيَّ، والمُتَجالِسينَ فيّ، والمُتبَاذِلينَ فِيّ، والمُتَزَاوِرينَ فِيّ \" \n\n، وفي رواية أبي مُسلم الخولاني: قال صلى الله عليه وسلم:\n\n \" المتحابُّون في الله على مَنَابرَ من نورٍ، في ظِلِّ العرشِ، يوم لا ظِلَّ إِلا ظِلُّه \" \n\n، وفي حديث آخر:\n\n \" ما تحابّ اثنان في الله إلا وُضِعَ لهما كُرسِيّاً، فيجلِسَانِ عليه حتى يَفْرغَ من الحساب \" \n\nوقال صلى الله عليه وسلم:\n\n \" إنَّ المُتَحَابِّين في الله لَتَرى غُرفَهُم في الجنة كالكوكب الطَّالِعِ الشَّرقِي أو الغربي، فيقال: مَن هؤلاء؟ فيقال: هؤلاء المُتَحَابُّونَ في الله عزّ وجل \"\n \n\nوفي رواية:\n\n \" إنّ في الجنة غُرَفاً يُرى ظواهِرُها مِن بَوَاطِنِها، وبَواطِنُها من ظَواهرها، أعدَّها الله للمُتحابِّين في الله، والمُتَزَاورِينَ فيه، والمُتباذِلين فيه \" \n\n \n\nوفي لفظ آخر:\n\n \" إنَّ في الجنة لعُمُداً من ياقوتٍ، عليها غُرَفٌ من زَبَرْجد، لها أبواب مُفَتَّحَةٌ تُضيء كما يُضيء الكوكب الدُّرِّي، قلنا: يا رسول الله، مَن يَسْكُنُها؟ قال: المتحابُّون في الله، والمتباذِلُون في الله، والمتلاقون في الله، مكتوب على وجوههم، هؤلاء المتحابون في الله \" \n\nوفي الأثر أيضاً: إذا كان يوم القيامة: نادى منادٍ: أين المتحابون في الله؟ فيقوم ناس - وهم يسير - فَيَنْطَلِقُون إلى الجَنَّ سِرَاعاً، فَتَتَلقَّاهم الملائكة: فيقولون: رأيناكم سِراعاً إلى الجنة، فمَن أنتم؟ فيقولون: نحن المتَحَابُّون في الله فيقولون: وما كان تحابُّكُم؟ فيقولون: كنَّا نتحاب في الله ونتزاورُ في الله، ونتعاطف في الله، ونتباذل في الله، فيُقال لهم: ادخلوا الجنة، فَنِعْمَ أَجْرُ العاملين\n هـ\n من البدور السافرة\n والتباذل: المواساة بالبذل\n وذكر في الإحياء شروط المتحابين في الله، فقال رضي الله عنه: اعلم أن عقد الأخوة رابطة بين الشخصين، كعقد النكاح بين الزوجين، ثم قال: فَلأخيك عليك حق في المال، وفي النفس، وفي اللسان، وفي القلب\n وبالعقو، وبالدعاء، وذلك تجمعه ثمانية حقوق\n الحق الأول: في المال بالمواساة، وذلك على ثلاثة مراتب أدناها: أن تُنزله منزلة عبدك وخادمك، فتقوم بحاجاته بفضله مالك، فإذا سنحت له حاجة، وعندك فضلة أعطيته ابتداءً، فإذا أحوجته إلى سؤال فهو غاية التقصير\n الثانية: أن تنزله منزلة نفسك، وترضى بمشاركته إياك في مالك، فتسمح له في مشاركته\n الثالثة - وهي العليا -: أن تؤثره على نفسك، وتقدم حاجته على حاجتك، وهي رتبة الصدّيقين، ومنتهى درجات المتحابين\n الحق الثاني: الإعانة بالنفس في قضاء الحاجات، والقيام بها قبل السؤال، وهذا أيضاً لها درجات كالمواساة، فأدناها: القيام بالحاجة عند السؤال، ولكن مع البشاشة والاستبشار، وإظهار الفرح\n وأوسطها: أن تجعل حاجته كحاجتك، فتكون متفقداً لحاجته، غير غافل عن أحواله، كما لا تغفل عن أحوال نفسك، وتغنيه عن السؤال\n وأعلاها: أن تؤثره على نفسك، وتقدم حاجته على حاجتك، وتؤثره على نفسك، وأقاربك، وأولادك\n كان الحسن يقول: إخواننا أحبُّ إلينا من أهلينا وأولادنا لأن أهلينا يذكروننا الدنيا، وإخواننا يذكروننا في الآخرة\n الحق الثالث: على اللسان بالسكوت، فيسكت عن التجسُّس، والسؤال عن أحواله، وإذا رآه في طرقه فلا يسأله عن غرضه وحاجته، فربما يثقل عليه، أو يحتاج إلى أن يكذب، ويسكت عن أسراره التي بثها إليه، فلا يبثها إلى غيره، ولا إلى أخص أصدقائه، ولا يكشف شيئاً منها ولو بعد القطيعة، وليسكن عن مماراته ومدافعته في كلامه\n الحق الرابع: على اللسان بالنطق، فيتودد إليه بلسانه، ويتفقده في أحواله، كالسؤال عن عارض عرض له، وأظهر شغل القلب بسببه، فينبغي أن يظهر له بلسانه كراهتها\n والأحوال التي يُسِرُّ بها، ينبغي أن يظهر له بلسانه كراهتها\n\n\nوالأحوال التي يُسِرُّ بها، ينبغي أن يظهر له بلسانه مشاركته في السرور بها\n فمعنى الأخوة: المساهمة في السراء والضراء، ويدعوه بأحب أسمائه في حضوره ومغيبه، ويُثني عليه بما يعرف من محاسن أحواله، عند مَن يريد هو الثناء عنده، وكذا على أولاده وأهله، حتى على عقله، وخُلُقه، وهيئته، وخطه، وشعره، وتصنيفه، وجميع ما يفرح به، من غير كذب ولا إفراط، ويذب عنه في غيبته مهما قُصد بسوء، ويُعلمه مما علّمه الله وينصحه\n الحق الخامس: العفو عن الزلاّت والهفوات، فإن كان زلته في الدين بارتكاب معصية، فليتلطّف في نصحه، فإن بقي مُصرّاً، فقد اختلف الصحابة في ذلك، فذهب أبو ذر إلى مقاطعته، وقال: إذا انقلب أخوك عما كان عليه فأبغضه من حيث أحببته\n وذهب أبو الدرداء، وجماعة، إلى خلاف ذلك، وقال أبو الدرداء: إذا تغيّر أخوك عما كان عليه فلا تدعه لأجل ذلك فإن أخاك يُعوجُّ مرة، ويستقيم أخرى\n وهذا ألطف وأفقه، وذلك لما في هذه الطريق من الرفق، والاستمالة، والتعطُّف، المفضي إلى الرجوع والتوبة\n وأيضاً: للأخوة عقد، ينزل منزلة القرابة، فإذا انقعدت وجب الوفاء بها، ومن الوفاء: ألا يهمله أيام حاجته وفقره، وفقر الدين أشد من فقر المال\n ثم قال: والفاجر إذا صَحِبَ تقيّاً وهو ينظر إلى خوفه رجع عن قريب، ويتخلّى من الإصرار، بل الكسلان يصحب الحريص في العمل، فيحرص، حياءً منه، وإن كانت زلته في حقك فلا خلاف أن العفو والاحتمال هو المطلوب\n هـ\n قلت: ولعل حق القلب يندرج هنا مع المحبة وشهود الصفاء منه\n الحق السادس: الدعاء له في حياته ومماته بكل ما يُحب لنفسه وأهله\n قلت: ومن ذلك زيارة قبره، وإيصال النفع له في ذلك الوقت\n الحق السابع: الوفاء والإخلاص\n ومعنى الوفاء: الثبات على الحب، وإدامته إلى الممات، معه ومع أولاده وأصدقائه\n الحق الثامن: التخفيف وترك التكليف والتكلُّف، فلا تُكلف أخاك ما يشق عليه بل تُرَوح سره عن مهماتك وحاجاتك، وترفهُه عن أن تحمّله شيئاً من أعبائك، ولا تكلفه التواضع لك، والتفقُّد والقيام بحقوقك، بل ما تقصد بمحبته إلا الله تعالى\n هـ\n باختصار\n وفي وصية القطب ابن مشيش، لأبي الحسن رضي الله عنهما: لا تصحب مَن يُؤثر نفسه عليك، فإنه لئيم ولا مَن يُؤثرك على نفسه، فإنه قلما يدوم واصحب مَن إذا ذكر ذكر الله، فالله يغني به إذا شهد، وينوب عنه إذا فُقِدْ، ذكره نور القلوب، ومشاهدته مفاتح الغيوب\n ومعنى كلام الشيخ: لا تصحب مَن يبخل عنك بما عنده من العلوم، ولا مَن يتكلّف لك، فإنه لا يدوم، وهذه صحبة الشيخوخة\n وقال صلى الله عليه وسلم:\n\n \" مَثَلُ الأَخَوَيْنِ كَمَثَلِ اليَدَيْنِ، يَغْسِلُ إِحداهُما الأُخرى، وكَمَثَلِ البُنْيَان يَشُدُّ بَعْضُه بعضاً \" \n\nوفي معناه قيل:\n\nوهذا في حق الإخوان، والله تعالى أعلم\n ثم ذكر تعالى أضداد هؤلاء، فقال: { إِنَّ ٱلْمُجْرِمِينَ فِي عَذَابِ جَهَنَّمَ خَالِدُونَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:32",
      "similarity": 0.9102060526212168
    },
    {
      "verse": "36:57",
      "similarity": 0.8254212840964039
    },
    {
      "verse": "56:20",
      "similarity": 0.8183087487104768
    },
    {
      "verse": "44:27",
      "similarity": 0.80734762569521
    },
    {
      "verse": "44:55",
      "similarity": 0.7978497632202879
    }
  ]
}