{
  "chapter": "الزخرف",
  "text": "يطاف عليهم بصحاف من ذهب واكواب وفيها ما تشتهيه الانفس وتلذ الاعين وانتم فيها خلدون",
  "translations": [
    {
      "translation": "Platters and cups of gold will passed around among them and they will have there all that their hearts desire and their eyes find delight in. You will remain in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Golden platters and goblets will be passed around, and everything the heart desires and pleases the eye will be there, where you will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Platters and cups of gold shall be passed around them, and there shall be all that they might desire and all that their eyes might delight in. (They shall be told): “Herein shall you abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Golden dishes and cups will be passed among them. All that the souls may desire and that may delight their eyes will be available therein. You will live therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Rounds of golden cups and wine will be presented upon them; and in it is whatever the hearts wish for, and what pleases the eye; and you will stay in it forever.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Trays of gold and cups will be passed round them; (there will be) therein all that their souls desire, and all that eyes could delight in and you will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be sent round to them golden bowls and drinking-cups and therein shall be what their souls yearn after and (wherein) the eyes shall delight, and you shall abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be passed around them platters of gold, and cups, therein being whatever the souls desire, and the eyes delight in. 'And therein, you shall dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein are brought round for them trays of gold and goblets, and therein is all that souls desire and eyes find sweet. And ye are immortal therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dishes and goblets of gold will be passed around them with all that their souls desire and their eyes delight in. \"There you will remain forever:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Passed round amongst them will be dishes of gold and goblets, and therein will be whatsoever souls desire and eyes delight in; and ye will be therein abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be served around with golden dishes and goblets, and therein will be whatever the souls desire and eyes delight in. ‘You will remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To them will be passed round, dishes and goblets of gold: there will be there all that the souls could desire, all that their eyes could delight in: and ye shall abide therein (for eye).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Trays of gold and cups will be passed round them, (there will be) therein all that the one's inner-selves could desire, all that the eyes could delight in, and you will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To them will be passed large platters and cups of gold. There will be all that souls desire and all that eyes delight in. (And it will be said:) 'There you shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be served around with trays of gold, and cups. Therein is whatever the souls desire and delights the eyes. Therein you will stay forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Circulated among them will be plates and vessels of gold. And therein is whatever the souls desire and [what] delights the eyes, and you will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:71] They will be served from all around with [large] dishes of gold and goblets (akwāb is the plural of kūb, which is a [drinking] vessel without a handle so that the person can drink from whichever side he wants) and therein will be whatever souls desire, to relish, and eyes delight in, contemplating, and you will abide in it [forever].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therein are brought round for them) to serve them (trays of gold) filled with different types of food (and goblets) round goblets without handles, filled with drinks, (and therein) i.e. in Paradise (is all that souls desire and eyes find sweet) to look at. (And you are immortal therein) you will abide in Paradise forever, never to die or leave.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُطَافُ عَلَيْهِمْ بِصِحَافٍ مِّن ذَهَبٍ وَأَكْوَابٍ } فالصِّحافُ: القِصاعُ\n واحدُها صحفةٌ\n والأَكوابُ: الأَباريقُ التي لا آذانَ لها واحدُها كوبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {They will be served on silver platters and cups} The platters are the dishes.\n\n\nOne of them is a page.\n\n\nAnd the (al-akwab) are the (al-abariq) which have no ears (al-udhan), and one of them is a cup (kubun).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتمكنوا في مكمن التمجيد والتعظيم: { يُطَافُ عَلَيْهِمْ } أي: يطوف حولهم خدمة الجنة { بِصِحَافٍ } جمع: صحفةٍ\n وهي القطعة الكبيرة المتخذة { مِّن ذَهَبٍ وَأَكْوَابٍ } جمع: كوب\n وهي الكوز التي لا عرى لها أيضاً متخذة منها { وَ } بالجملة: { فِيهَا } أي: في الجنة { مَا تَشْتَهِيهِ ٱلأَنْفُسُ } من اللذات والشهوات المدركة بآلاتها { وَتَلَذُّ ٱلأَعْيُنُ } أي: من المحسوسات التي استحسنتها العيون واستلذذون بها\n { وَ } بالجملة: { أَنتُمْ فِيهَا خَالِدُونَ } [الزخرف: 71] دائمون لا تتحولون منها أبد الآبدين\n\n\n{ وَتِلْكَ ٱلْجَنَّةُ ٱلَّتِيۤ } تفوزون بها { أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ } [الزخرف: 72] من الأعمال المصورة بها\n المنتجة لها\n المأمورة لأجلها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يُطاف عليهم بصِحَافٍ من ذهب } أي: بعد دخولهم الجنة حسبنا أمروا به { وأكوابٍ } من ذهب حذف لدلالة ما قبله\n والصِحَاف: جمع صحفة\n قيل: هي كالقصعة\n وقيل: أعظم القصاع\n فهي ثلاث: الجفنة\n ثم القصعة\n ثم الصحفة\n والأكواب: جمع كوب\n وهو كوز مستدير لا عروة له\n وفي حديث أبي هريرة\n عنه صلى الله عليه وسلم قال:\n\n \" أدنى أهْلُ الجنةِ مَن له سَبْعُ درجاتٍ\n هو على السادسة\n وفوقه السابعة\n وإنّ له ثَلاَثَمائةِ خادمٍ\n ويُغدى عليه ويُراح بثلاثمائة صَحفةٍ من ذَهبٍ\n في كلِّ صَحْفَةٍ لونٌ ليس في الأُخرى مِثْلُه\n وإنه لَيَلَدُّ آخِرُه كما يَلَدُّ أَوله\n ويقول: لَوْ أَذِنْتَ لي يا رب لأطْعَمْتُ أهلَ الجنةِ\n وأسقيتهم\n ولا ينقص مما عندي شيء\n وإنَّ لَه من الحور العِين لاثنين وسبعين زوجة\n سوى أزواجه في الدنيا\n وإن الواحدة منهن ليأخذَ مِقعدُها قَدرَ ميل \" \nوفي حديث عكرمة:\n \" إن أدنى أهل الجنة منزلةً مَن يُفسح له في بصره مسيرة مائة عام\n في قصور من ذهب\n وخيام من لؤلؤٍ\n وليس منها موضع شبر إلا معمور\n يُغدى عليه ويُراح بسبعين ألف صحفة من ذهب\n ليس فيها صحفة إلا وفيها لون ليس في الأخرى مثله\n شهوته في آخرها كشهوته في أولها\n ولو نزل به جميع أهل الدنيا لوسع عليهم مما أعطى\n ولا ينقص ذلك ما اُوتي شيئاً \" \nويجمع بينهما بتعدُّد اهل هذه المنزلة\n وتفاوتهم\n { وفيها } أي: في الجنة { ما تشتهيه الأنفسُ } من فنون الملاذ\n ومَن قرأ بحذف الهاء فلطول الموصول بالفعل والفاعل\n { وتلذُّ الأعينُ } أي: تستلذه\n وتقر بمشاهدته\n وهذا حصر لأنواع النعيم لأنها إما مشتهيات في القلوب\n أو مستلذات في العيون\n ففي الجنة كل ما يشتهي العبد من الملابس والمناكح والمراكب\n رُوي أن رجلاً قال: يا رسول الله\n إني أُحبُّ الخيلَ\n فهل في الجنة خيلٌ؟ فقال:\n \" إنْ يُدْخلك اللّهُ الجنةَ فلا تشاء أن تركبَ فرساً من ياقُوتَةٍ حمراء\n يَطيرُ بكَ في الجنة حيث شئت\n إلا فعلت\n قال أعرابي: يا رسول الله\n إني أحبُّ الإبلَ\n فهل في الجنة إبل؟ فقال: يا أعرابي\n إن يُدْخلك الله الجنة ففيها ما اشتهيت نفسك ولذَت عيناك \" \nهـ\n وقال أبو طيبة السلمي: إن الشرذمة من أهل الجنة لتظلهم سحابة\n فتقول: ما أُمْطِرْكُم؟ فما يدعو داع من القوم بشيء إلا أَمطرَتْه\n حتى إن الرجل منهم يقول: أمطر علينا كواعب أتراباً\n وقال أبو أُمامة: إن الرجل من أهل الجنة ليشتهي الطائر وهو يطير\n فيقع نضيجاً في كفه كما أراد\n فيأكل منه حتى تشتهي نفسه\n ثم يطير كان أول مرة\n ويشتهي الشراب\n فيقع الإبريق في يده\n فيشرب منه ما يريد\n ثم يُرفع الإبريق إلى مكانه\n هـ\n من الثعلبي\n قال القشيري: وفيها ما تشتهيه الأنفس للعُبَّاد لأنهم قاسوا في الدنيا - بحكم المجاهدات - الجوعَ والعطشَ\n وتحمّلوا وجوهَ المشاقِّ\n فيجزون في الجنة وجوهاً من الثواب\n وأما أهل المعرفة والمحبُّون فلهم ما تلذّ أعينهم من النظر إلى الله\n لطول ما قاسوه من فَرْطِ الاشتياق بقلوبهم\n وما عالجوه من احتراقهم فيه لشدة غليلهم\n هـ\n والحاصل: أن ما تشتهي الأنفس يرجع لنعيم الأشباح\n وتلذ الأعين لنعيم الأرواح من النظر\n والقُرب\n والمناجاة والمكالمة\n والرضوان الأكبر\n منحنا الله من ذلك الحظ الأوفر\n\n{ وأنتم فيها خالدون } إتمام للنعمة\n وكمال للسرور فإن كل نعيم له زواله مكدر بخوف زواله لا محالة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:46",
      "similarity": 0.5135170249979195
    },
    {
      "verse": "88:14",
      "similarity": 0.43729783444411513
    },
    {
      "verse": "76:15",
      "similarity": 0.4016441901945287
    },
    {
      "verse": "56:18",
      "similarity": 0.3736929905470362
    },
    {
      "verse": "87:18",
      "similarity": 0.2294303044703088
    }
  ]
}