{
  "chapter": "الزخرف",
  "text": "وتلك الجنة التى اورثتموها بما كنتم تعملون",
  "translations": [
    {
      "translation": "That is the Garden you will inherit for what you did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Paradise you will inherit (as meed) for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Paradise that you shall inherit by virtue of your good deeds in the life of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Paradise which you have received as your inheritance by virtue of what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And this is the Paradise which is bequeathed to you, because of your deeds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Paradise, which you have been made to inherit because of your deeds that you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the garden which you are given as an inheritance on account of what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Paradise that you have been given for an inheritance for the things that you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Garden which ye are made to inherit because of what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "this is the Garden which you will inherit by virtue of your past deeds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Garden which ye have been made to inherit for that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the paradise you have been given to inherit for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such will be the Garden of which ye are made heirs for your (good) deeds (in life).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Paradise which you have been made to inherit because of your deeds which you used to do (in the life of the world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Paradise you shall inherit, for the things you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Garden you are made to inherit, because of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is Paradise which you are made to inherit for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:72]   And that is the Paradise which you have been given to inherit [as the reward] for what you used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This is the Garden which ye are made to inherit) this is Paradise in which you are made to dwell, you inherited it (because of what ye used to do) and say in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالجنة التي أمروا بدخولها هي جنة النفس لاشتراك الفريقين فيها دون جنتي الصفات والذات المخصوصتين بالسابقين بدليل قوله بعده: { وتِلكَ الجنَّة التي أورثتموها بما كنتم تعلمون } وإنما الجنة التي هي ثواب الأعمال جنّة النفس لقوله: { وفيها ما تشتهيه الأنفس وتلذ الأعين }\n { ونَادوا يا مالك } سمي خازن النار مالكاً لاختصاصه بمن ملك الدنيا وآثرها لقوله تعالى:\n[النازعات\n الآيات:37 - 39] كما سمَّى خازن الجنة رضواناً لاختصاصه بمن رضي الله عنهم ورضوا عنه\n وقيل: الرضا بالقضاء باب الله الأعظم وهو الطبيعة الجسمانية الموكلة بأجساد العالم والهيولى الظلمانية أو النفس الحيوانية الكلية الموكلة بالتأثير في الأجساد الحيوانية المستعلية على النفوس الناطقة المحبوسة في قيود اللذات الحسيّة والمطالب السفلية\n وإنما لا يتعذب بالنار لكونه من جوهر تلك النار فهي له جنة\n وللجهنميين نار لتنافي جواهرهم وجوهرها وتباينهما\n واختصاص ندائهم بمالك دون الله تعالى لاحتجابهم وبعدهم عن الله بالكلية وتعبّدهم لمالك بالنية والأمنية\n وما ذلك النداء إلا توجههم إليه وطلب المراد منه ودعوتهم بقولهم: { ليقض علينا ربّك } إشارة إلى تمني زوال بقية الاستعداد بالكلية وإماتة الغريزة الفطرية لئلا يتأذوا بالهيئات المؤذية والنيران المردية\n أو تمني تعطل الحواس وعدم الإحساس لشدّة التألم بالعذاب الجسماني و { قال إنكم ماكثون } إشارة إلى المكث المقدّر بحسب رسوخ الهيئات وارتكام الذنوب والآثام إن كانت الاستعدادات باقية والاعتقادات صحيحة أو الخلود فيها إن لم تكن\n فإن المكث أعم من المتناهي وغيره\n وكذا المجرم أعم من الشقي الأصلي وغيره\n وعلى هذا حمل الخلود في قوله:\n[الزخرف\n الآية:74] على المكث الطويل الأعم من المتناهي وغيره\n فإنه قد يستعمل في العرف بمعناه كثيراً مجازاً\n وإنما جعلنا المجرم شاملاً للقسمين المذكورين من الأشقياء لمقابلته للمتقي الشامل للقسمين المذكورين من السعداء وإن خصصناه بالشقي المردود المطرود في الأزل كان المكث في قوله: { إنكم ماكثون } عبارة عن الأبد\n { بلى ورسلنا لديهم يكتبون } كل ما خطر فينا بالبال من الأشرار ينتقش في النفوس الفلكية كما ينتقش في الإنسانية لاتصالها بها وانتقاشها كما هي\n إما في القوى الخيالية إن كانت جزئية وإما في القوى العاقلة إن كانت كلية\n وكلاهما يظهر على النفس عند ذهولها عن الحسّ ورجوعها إلى ذاتها وما كانت تنساها تنعكس إليها من النفوس الفلكية عند المفارقة فتذكرها دفعة وذلك معنى قوله:\n[المجادلة\n الآية:6] فالرسل الكاتبون هم النفوس الفلكية المناسبة لكل واحد واحد من الأشخاص البشرية بحسب الوضع المقارن لاتصال النفس بالبدن",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتلك الجنة } مبتدأ وخبر\n و \" التي أُورثتموها \": صفة الجنة\n أو: \" الجنة \" صفة المبتدأ\n الذي هو الإشارة\n و \" التي أورثتموها \": خبره\n أو: \" التي أورثتموها \" صفة المبتدأ\n و { بما كنتم تعملون }: خبر\n أي: حاصلة\n أو كائنة بما كنتم تعملون في الدنيا\n شبه جزاء العمل بالميراث لبقائه على أهله دائماً\n ولا ينافي هذا قوله صلى الله عليه وسلم:\n \" لَن يُدخِل أحدَكُم الجنةَ عملُه \" \nلأن نفس الدخول بالرحمة\n والتنعُّم والدرجات بقدر العمل\n أو: تقول: الحديث خرج مخرج الحقيقة\n والآية خرجت مخرج الشريعة\n فالحقيقة تنفي العمل عن العبد\n وتُثبته لله\n والشريعة تُثبته له باعتبار الكسب\n والدين كله وارد بين حقيقة وشريعة فإذا شرع القرآن حققته السُّنة\n وإذا شرعت السنة حققه القرآن\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:63",
      "similarity": 0.852514905475137
    },
    {
      "verse": "23:10",
      "similarity": 0.8410978972572207
    },
    {
      "verse": "26:85",
      "similarity": 0.790912596160504
    },
    {
      "verse": "44:28",
      "similarity": 0.7495432296125376
    },
    {
      "verse": "15:23",
      "similarity": 0.7026236145623214
    }
  ]
}