{
  "chapter": "الزخرف",
  "text": "ولا يملك الذين يدعون من دونه الشفعة الا من شهد بالحق وهم يعلمون",
  "translations": [
    {
      "translation": "Those you call upon apart from Him possess no power of intercession - only those who bore witness to the truth and have full knowledge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they invoke apart from Him have no power of intercession, except those who testify to the truth and have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon, instead of Allah have no power of intercession, except such that testify to the truth based on knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they worship besides God are not able to intercede, except for those among them who believe in the Truth (God) and who know whom to intercede for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they worship besides Allah do not have the right of intercession – the right of intercession is only for those who testify to the Truth and have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they invoke instead of Him have no power of intercession -- except for those who bear witness to the truth knowingly, and they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they call upon besides Him have no authority for intercession, but he who bears witness of the truth and they know (him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they call upon, apart from Him, have no power of intercession, save such as have testified to the truth, and that knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those unto whom they cry instead of Him possess no power of intercession, saving him who beareth witness unto the Truth knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke besides God have no power of intercession, only those who bear witness to the truth and they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they call upon beside Him own not the power of intercession save those who have borne witness to the truth and who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke besides Him have no power of intercession, except those who are witness to the truth and who know [for whom to intercede].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they invoke besides Allah have no power of intercession;- only he who bears witness to the Truth, and they know (him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they invoke instead of Him have no power of intercession; except those who bear witness to the truth (i.e. believed in the Oneness of Allah, and obeyed His Orders), and they know (the facts about the Oneness of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon, other than Him, have no power to intercede (for them), except those that have knowingly borne witness to the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they invoke besides Him are incapable of intercession; only those who testify to the truth and have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those they invoke besides Him do not possess [power of] intercession; but only those who testify to the truth [can benefit], and they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:86] And those whom they, the disbelievers, call on, [those whom] they worship, besides Him, that is, besides God, have no power of intercession, for anyone, except those who bear witness to the truth, that is, those who say ‘there is no god except God’, with [full] knowledge, in their hearts of what they have testified to with their tongues — such are Jesus, Ezra, and the angels, who will intercede for believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those unto whom they cry) those whom they worship (instead of Him possess no power of intercession) He says: the angels have no power to intercede in favour of anybody, (saving him who beareth witness unto the Truth) the testification that there is no deity save Allah, sincerely believing in it (knowingly) knowing deep in their hearts it is the Truth. This was revealed about the Banu Malih who claimed the angels were the daughters of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ مَن شَهِدَ بِٱلْحَقِّ وَهُمْ يَعْلَمُونَ } معناه شَهِدَ ألاّ إلهَ إلاّ الله، وهو يَعلمُ أنهُ رَبُّهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Except for those who witness the truth and they know} means witness that there is no god but Allah, and He knows that He is his Lord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما ثبت وحدة الحق واستقلاله في ملكه وملكوته { لاَ يَمْلِكُ } ولا ينفع المشركين المسرفين { ٱلَّذِينَ يَدْعُونَ } ويعبدون { مِن دُونِهِ } سبحانه { ٱلشَّفَاعَةَ } عنده من آلهتهم الذين زعموا أنهم شفعاؤهم عند الله { إِلاَّ مَن شَهِدَ } أن الشفاعة؛ أي: إلا شفاعة من أقر { بِٱلْحَقِّ } واعترف بتوحيده { وَهُمْ } مع إقرارهم واعترافهم { يَعْلَمُونَ } [الزخرف: 86] وينكشفون بوحدة ذاته وكمالات أسمائه وصفاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا يملك الذين يدعُونَ من دونه } أي: لا تملك آلهتهم التي يدعونها { من دونه } أي: من دون الله { الشفاعةَ } كما زعموا أنهم شفعاؤهم عند الله { إِلا مَن شَهِدَ بالحق } الذي هو التوحيد، { وهم يعلمون } بما يشهدون به عن بصيرة وإتقان وإخلاص، وهم خواص المسلمين، والملائكة\n وجمع الضميرين باعتبار معنى مَن كما أن الإفراد أولاً باعتبار لفظها\n والاستثناء: إما متصل، والموصل عام لكل ما يعبد من دون الله، أو: منقطع، على أنه خاص بالأصنام\n الإشارة: قل يا محمد: إن كان للرحمن ولد، على زعمكم في عيسى والملائكة، فأنا أولى بهذه النسبة على تقدير صحتها لأني أنا أول مَن عبد الله في سابق الوجود لأن أول ما ظهر نوري، فعَبَد اللّهَ سنين متطاولة ثم تفرّعت منه الكائنات، ومَن سبق إلى الطاعة كان أولى بالتقريب، فلِمَ خصصتم الملائكة وعيسى بهذه النسبة، وأنا قد سبقتهم في العبادة، بل لا وجود لهم إلا من نوري، لكن لا ولد له، فأنا عبد الله ورسوله\n قال جعفر الصادق: أول ما خلق الله نور محمد صلى الله عليه وسلم قبل كل شي، وأول مَن وحّد الله عزّ وجل من خلقه، دُرة محمد صلى الله عليه وسلم، وأول ما جرى به القلم \" لا إله إلا الله محمد رسول الله \"\n\n\nهـ\n قاله الورتجبي\n ففي الآية إشارة إلى سبقيته صلى الله عليه وسلم، وأنه أول تجلٍّ من تجليات الحق، فمِن نوره انشقت أسرار الذات، وانفلقت أنوار الصفات، وامتدت من نوره جميع الكائنات\n قوله تعالى: { فذهرم يخوضوا\n\n\n } الخ، كل مَن خاض في بحار التوحيد بغير برهان العيان، تصدق عليه الآية، وكذا كل مَن اشتغل بغير الله، وبغير ما يُقرب إليه فهو ممن يخوض ويلعب، وفي الحديث:\n\n \" الدنيا ملعونة ملعونٌ ما فيها إلا ذِكْرَ الله، وما والاَه، أو عالماً أو متعلماً \" \n\nوقوله تعالى: { ولا يملك الذين يدعون من دونه الشفاعة\n\n\n } الخ\n قال القشيري: وفي الآية دليل على أن جميع المسلمين تكون شفاعتهم غداً مقبولة\n هـ\n أي: لأنهم في الدنيا شَهِدوا بالحق، وهو التوحيد عن علم وبصيرة، لكن في تعميمه نظر لأن الاستثناء، الأصل فيه الاتصال، ولأن مَن شهد بالحق مستنثى من { الذين يدعون من دونه } - وهم الملائكة، وعيسى، وعزير، فهم الذين شَهِدُوا بالحق ممن دعوا من دون الله، وشفاعة مَن عداهم مأخذوة من أدلة أخرى\n ثم ذكر إقرار المشركين بالربوبية، فقال: { وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ ٱللَّهُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:100",
      "similarity": 0.6793375980226678
    },
    {
      "verse": "30:13",
      "similarity": 0.6228130060995404
    },
    {
      "verse": "39:43",
      "similarity": 0.6111488265025996
    },
    {
      "verse": "39:44",
      "similarity": 0.5978600426400573
    },
    {
      "verse": "19:87",
      "similarity": 0.5799477977326465
    }
  ]
}