{
  "chapter": "الزخرف",
  "text": "وهو الذى فى السماء اله وفى الارض اله وهو الحكيم العليم",
  "translations": [
    {
      "translation": "He is God in heaven and God on earth, and He is all-wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who is God in the heavens and the earth. He is the Most Wise, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who is the Lord of the heavens and is the Lord on earth. He is All-wise and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And only He is the God of the heavenly creation and the God of the earthly creation; and He only is the Wise, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who is the only God in the heaven and the only God on the earth. And He is the All-Wise, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who is Allah in the heavens and Allah in the earth; and He is the Wise, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who in heaven is God and in earth is God; He is the All-wise, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who in the heaven is Allah, and in the earth Allah. He is the Wise, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who is God in heaven, and God on earth: He is the Wise One, the All Knowing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who is God in the heavens and God in the earth, and He is the Wise, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who is God in the sky, and God on the earth, and He is the All-Wise, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who is Allah in heaven and Allah on earth; and He is full of Wisdom and Knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He (Allah) Who is the only Ilah (God to be worshipped) in the heaven and the only Ilah (God to be worshipped) on the earth. And He is the All-Wise, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who is God in the heavens is also God in the earth; He is the Wise, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who is God in heaven, and God on earth. He is the Wise, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah who is [the only] deity in the heaven, and on the earth [the only] deity. And He is the Wise, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:84] And He it is Who in the heaven is God (fi’l-samā’i ilāhun: pronounce here both hamzas, or drop the first one or softening it into a yā’), in other words, [Who in the heaven] is the Worshipped One, and in the earth is God (both adverbials are semantically connected to what follows); and He is the Wise, in the management of His creatures, the Knower, of their welfare.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who in the heaven is God) He is the God of everything that is in the heaven, (and in the earth God) and He is the God of everything that is in the earth. (He is the Wise) in His command and decree, (the Knower) of His created beings and providence. 573\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف يتخذون له سبحانه ولداً وينسبون له شريكاً، مع أنه سبحانه { هُوَ ٱلَّذِي فِي ٱلسَّمآءِ } أي: علام الأساء والصفات { إِلَـٰهٌ } يُعبد له ويُرجع إليه مع صرافة وحدته الذاتية { وَفِي ٱلأَرْضِ } أي: عالم الطبيعة والهيولي { إِلَـٰهٌ } كذلك بلا تعدد وتغير في ذاته { وَ } بالجملة: { هُوَ ٱلْحَكِيمُ } المقصور على الحكمة المتقنة البالغة لا حاكم سواه { ٱلْعَلِيمُ } [الزخرف: 84] المقصور على العلم الكامل الشامل، المحيط بجميع ما لاح عليه بروق تجليات الوجود وشروق شمس الذات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n خبر عن مضمر، ولا يصح أن يكون \" إله \" مبتدأ، و \" في السماء \" خبره لخلو الصلة حينئذ عن العائد { وهو الحكيمُ } في أقواله وأفعاله { العليمُ } بما كان وما يكون، أو: الحكيم في إمهال العصاة، العليم بما يؤول أمرهم إليه، وهو كالدليل على ما قبله من التنزيه، وانفراده بالربوبية",
      "translations": []
    }
  ]
}