{
  "chapter": "الزخرف",
  "text": "ام يحسبون انا لا نسمع سرهم ونجوىهم بلى ورسلنا لديهم يكتبون",
  "translations": [
    {
      "translation": "Or do they imagine that We do not hear their secrets and their private talk? On the contrary Our",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think We do not hear their secrecies and stealthy consultations? In fact, Our messengers who attend them record everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We do not hear their secret talks and their whispering counsels? Yes, indeed We do and Our messengers [i.e., angels) are with them, writing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that We do not hear their secrets and whispers? We certainly can hear them and Our Messengers record it all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they fancy that We do not listen to their whispers and their counselling? Why not, We surely do! And Our angels are with them, writing down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We hear not their secrets and their private counsel Yes (We do) and Our messengers are by them, to record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We do not hear what they conceal and their secret discourses? Aye! and Our apostles with them write down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think We hear not their secret and what they conspire together? Yes indeed, and Our messengers are present with them writing it down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or deem they that We cannot hear their secret thoughts and private confidences? Nay, but Our envoys, present with them, do record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they imagine We do not hear their secret talk and their private counsels? On the contrary, Our messengers [angels] are at their sides, recording everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink they that We hear not their secrets and whispers? Yea! We do, and Our messengers present with them write down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they suppose that We do not hear their secret thoughts and their secret talks? Yes indeed [We do]! And with them are Our messengers, writing down [everything].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We hear not their secrets and their private counsels? Indeed (We do), and Our messengers are by them, to record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We hear not their secrets and their private counsel? (Yes We do) and Our Messengers (appointed angels in charge of mankind) are by them, to record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think We do not hear their secret and that which they conspire! Yes, indeed Our angels, who are present with them write it down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We cannot hear their secrets and their conspiracies? Yes indeed, Our messengers are by them, writing down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they think that We hear not their secrets and their private conversations? Yes, [We do], and Our messengers are with them recording.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:80] Or do they reckon that We do not hear their secret thoughts and their conspiring?, that is to say, what they secretly communicate to others and what they openly conspire about among themselves. Yes indeed!, We hear [all of] that, and Our messengers, the guardians, are with them keeping a record, of that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُمْ بَلَى وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ (80){ أم } والاستفهام المقدر بعدها في قوله : { أم يحسبون } هما مثل ما تقدم في قوله : { أم أبرموا أمراً } \\[ الزخرف : 79 \\] .وحرف { بلى } جواب للنفي من قوله : { أنا لا نسمع } ، أي بَلى نحن نسمع سرهم ونجواهم .والسمع هو : العلم بالأصوات .والمراد بالسر : ما يُسرونه في أنفسهم من وسائل المَكر للنبيء صلى الله عليه وسلم وبالنجوى ما يتناجون به بينهم في ذلك بحديث خفيّ .وعطف { ورسلنا لديهم يكتبون } ليعلموا أن علم الله بما يُسِرُّون علم يترتب عليه أثرٌ فيهم وهو مؤاخذتهم بما يسرّون لأن كتابة الأعمال تؤذن بأنها ستحسب لهم يوم الجزاء . والكتابة يجوز أن تكون حقيقة ، وأن تكون مجازاً ، أو كناية عن الإحصاء والاحتفاظ .والرسل : هم الحفظة من الملائكة لأنهم مرسلون لتقصّي أعمال النّاس ولذلك قال : { لديهم يكتبون } كقوله : { ما يلفظ من قولٍ إلا لديه رقيبٌ عتيدٌ } \\[ ق : 18 \\] ، أي رقيب يرقب قوله .\n\n",
      "translations": [
        {
          "translation": "(Or deem they) i.e. Safwan Ibn Umayyah and his two friends (that We cannot hear their secret thoughts and private confidences) around the Ka'bah? (Nay) We do hear, (but Our envoys) the guardian angels, (present with them, do record) their secrets and private conferences.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمْ يَحْسَبُونَ أَنَّا لاَ نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُم } معناه يَظُنونَ أنهُ تَخفى علينا أَسرارُهم فيما بينَهُم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {Do they think that We do not hear their secrets and their private conversation?} Its meaning: They think that their secrets and what is between them is hidden from Us.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأيشكون ويترددون أنَّا لا نقدر على انتقامنا وأخذهم { أَمْ يَحْسَبُونَ أَنَّا لاَ نَسْمَعُ } نعلم وندرك { سِرَّهُمْ } الذي يخفونه في ضمائرهم { وَنَجْوَاهُم } الذي يتناجون به في هواجس نفوسهم { بَلَىٰ } إنَّا عالمون بجميع ما يجري في أسرارهم وضمائرهم\n مطلعون بعموم ما صدر من استعداداتهم وقابلياتهم { وَ } مع إحاطة علمنا بهم ولأحوالهم { رُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ } [الزخرف: 80] جميع ما صدر عنهم\n نقيره وقطميره\n حتى نحاسبهم عليه\n ونجازيهم بمقتضاه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم يحسبون } بل يحسبون { أنا لا نسمعَ سِرَّهم } وهو ما حدَّثوا به أنفسهم أو غيرهم في مكان خال\n { ونجواهم } أي: ما تكلّموا به فيما بينهم بطريق التناجي\n { بلى } نحن نسمعها ونطَّلع عليها { ورسلُنا } الملائكة الذين يحفظون عليهم أعمالهم\n ويلازمونهم أينما كانوا { لديهم } أي: عندهم { يكتبون } كل ما صدر عنهم من الأفعال والأقوال\n ومن جملتها: ما ذكر من سرهم ونجواهم\n والجملة: إما عطف على ما يترجم عنه \" بلى \" \n أي: نكتبها ورسلنا كذلك\n أو حال\n أي: نسمعها والحال أن رسلنا يكتبونه\n الإشارة: قوله تعالى: { إن المجرمين\n\n\n } الخ\n\n أما أهل الشرك فقد اتفق المسلمون على خلودهم\n إلا ما انفرد به ابن العربي الحاتمي والجيلي\n فقد نقلاً خبراً مأثوراً: أن النار تخرب\n وينبت موضعها الجرجير\n وينتقل زبانيتها إلى خزنة الجنان\n فهذا من جهة الكرم وشمول الرحمة لا يمنع\n ومن جهة ظواهر النصوص معارض\n وباطن المشيئة مما اختص الله تعالى به\n ونقل الجيلي أيضاً في كتابه الإنسان الكامل: أن بعض أهل النار أفضل عند الله من بعض أهل الجنة يتجلّى لهم الحق تعالى في دار الشقاء\n ونقل أيضاً: أن بعض أهل النار تعرض عليهم الجنة فيأنفون فيها\n وان بعض أهل النار يتلذّذون بها كصاحب الجرب\n وذكر بعضهم أن أهل النار يتطبعون بها\n كالسمندل\n فهذه مقالات غريبة\n الله أعلم بصحتها\n وعلى تقدير وقوعها في غيب مشيئته تعالى\n فلعلها في قوم مخصوصين من المسلمين ختم لهم بالشقاء بعد مُقاساة شدائد الطاعة\n أو: في قوم من أهل الفترة لم يكن فيهم إذاية\n أو صدر منهم إحسان\n والله أعلم بأسرار غيبه\n وأما أهل التوحيد فحالهم في النار أرفق من هذا\n بل حالهم فيها أروح من حال الدنيا من وجه\n قال القشيري: ولقد قال الشيوخ: إن حالَ المؤمنين في النار - من وجه - أرْوَحُ لقلوبهم من حالهم اليوم في الدنيا لأن اليوم خوف الهلاك وغداً يقين النجاة\n وأنشدوا:\nثم قال في قوله تعالى: { ونادوا يا مالك } لو قالوا: يا مَلِك بدل من يا مالك لكان أقربَ إلى الإجابة\n ولكنَّ الأجنبيةَ حالت بينهم وبين ذلك\n هـ\n أي: تعلقهم بالمخلوق دون الخالق\n وقوله تعالى: { أم أبرموا أمراً\n\n\n } الخ\n هي عادته تعالى مع خواصه كيفما كانوا\n يرد كيد مَن كادهم في نحره\n وقوله تعالى: { أم يحسبون أنا لا نسمع سرهم\n\n\n } الخ\n قال القشيري: إنما خوَّفهم بسماع الملائكة\n وكتابتهم أعمالهم عليهم\n لغفلتهم عن الله\n ولو كان لهم خبر عن الله لما خوّفهم بغير الله\n ومَن عَلِمَ أن أعماله تُكتَبُ عليه\n ويُطالَب بمقتضاها\n قلَّ إلمامُه بما يخاف أن يُسأَلَ عنه\n هـ\n ثم ردّ على مَن زعم اتخاذ الولد لله تعالى\n كعيسى والملائكة\n فقال: { قُلْ إِن كَانَ لِلرَّحْمَـٰنِ وَلَدٌ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:4",
      "similarity": 0.4208294315385828
    },
    {
      "verse": "84:15",
      "similarity": 0.41786287205780476
    },
    {
      "verse": "50:35",
      "similarity": 0.415073991115959
    },
    {
      "verse": "40:50",
      "similarity": 0.40248902946583964
    },
    {
      "verse": "39:59",
      "similarity": 0.39585773155603565
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/043080.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/043080.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/43:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}