{
  "chapter": "الزخرف",
  "text": "قل ان كان للرحمن ولد فانا۠ اول العبدين",
  "translations": [
    {
      "translation": "Say: 'If the All-Merciful had a son, I would be the first to worship him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If Ar-Rahman had a son I would have been the first of worshippers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “If the Merciful One had a son, I would have been the first one to worship him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Had the Beneficent God really had a son, I would certainly have been the first one to worship him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “If supposedly, the Most Gracious had an offspring* – I would be the first to worship!” (*Which is impossible)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the Most Gracious had a son, then I am the first of the worshippers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If the Beneficent Allah has a son, I am the foremost of those who serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If the All-merciful has a son, then I am the first to serve him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): If the Beneficent One hath a son, then, I shall be first among the worshippers. (But there is no son).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If the All Merciful had a son, I would be the first to worship him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: had the Compassionate a son, shall be the first of his worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If the All-beneficent had offspring, I would have been the first to worship [him].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If (Allah) Most Gracious had a son, I would be the first to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"If the Most Beneficent (Allah) had a son (or children as you pretend), then I am the first of Allah's worshippers [who deny and refute this claim of yours (and the first to believe in Allah Alone and testify that He has no children)].\" [Tafsir At-Tabari].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (Prophet Muhammad): 'If the Merciful had a son, I would be the first of the worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If the Most Gracious had a son, I would be the first to worship.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"If the Most Merciful had a son, then I would be the first of [his] worshippers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:81] Say: ‘If the Compassionate One had a son, hypothetically [speaking], I would have been first among the worshippers, of that son; but it is established that He, exalted be He, does not have a child and thus there can be no worshipping of such [a child].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to al-Nadr Ibn al-Harith and 'Alqamah: (The Beneficent One hath no son. I am first among the worshippers) I am the first to acknowledge that Allah has no son or partner.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن كَانَ لِلرَّحْمَـٰنِ وَلَدٌ فَأَنَاْ أَوَّلُ ٱلْعَابِدِينَ } معناهُ الآنفين والرَّادينَ لَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما شاع قول اليهود والنصارى بولديه عزير وعيسى، ومال إليه أولو الأحلام الضعيفة منهم ومن غيرهم، ردَّ الله عليهم على أبلغ وجهٍ وآكده، بأن أمرَّ حبيبه صلى الله عليه وسلم بالقول على سبيل الفرض والتقدير: { قُلْ } لهم يا أكمل الرسل بعدما بالغوا في هذه الفرية البعيدة عن الحق بمراحل مستحيلة في نفسها: { إِن كَانَ لِلرَّحْمَـٰنِ وَلَدٌ } أي: إن صح وجاز أن يكون له ولد متصف ببنوته { فَأَنَاْ أَوَّلُ ٱلْعَابِدِينَ } [الزخرف: 81] لابنه؛ إذ أنا أعلم الناس بلوازم الألوهية وأحفظهم بحقوق الربوبية، إن كان له سبحانه ولد أنا أحق بعبوديته وتعظيمه من جميع بريته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قلْ } يا محمد { إن كان للرحمن ولدٌ } على زعمكم { فأنا أول العابدين } لله، كان أو لم يكن، ويسمى هذا إرخاء العنان، أي: أنا أول مَن يخضع لله، كان له ولد أو لم يكن، وقد قام البرهان على نفيه\n قال معناه السدي، أو: وإن كان للرحمن ولد فأنا أول مَن يعظم ذلك الولد، وأسبقكم إلى طاعته، والانقياد إليه، كما يعظم ولد الملِك، لتعظيم أبيه وهذا الكلام وارد على سبيل الفرض، والمراد: نفي الولد، وذلك أنه علَّق العبادة بكينونة الولد، وهي محال في نفسها، فكان الملعلق بها محالاً مثلها، ونظيره، قول سعيد بن جبير للحجاج - حين قال له: والله لأبدلنَّك بالدنيا ناراً تلظى -: لو عرفت أن ذلك إليك ما عبدت إلهاً غيرك\n أو: إن كان للرحمن ولد في زعمكم { فأنا أول العابدين } أي: الموحِّدين لله، المكذِّبين قولكم، بإضافة الولد إليه لأن مَن عَبَدَ الله، واعترف بأنه إلهه فقد دفع أن يكون له ولد\n أو: إن كان للرحمن ولد فأنا أول العابدين، أي: الجاحدين والآنفين من أن يكون له ولد، مِن عبَدِ: بكسر الباء: إذا اشتد أنفسه فهو عبَد وعابد، ومنه قول الشاعر:\n\nوقول الحريري:\n\nأي: على جاحد الحق\n وقيل هي \" إنْ \" النافية، أي: ما كان للرحمن ولد فأنا أول من عبد الله ووحَّده، فيوقف على \" ولد \" على هذا التأويل\n رُوي: أن النضر قال: إن الملائكة بنات الله، فنزلت الآية، فقال النضر: ألا ترون أنه صدّقني فقال الوليد: ما صدّقك، ولكن قال: ما كان للرحمن ولداً، فأنا أوّل الموحدين من أهل مكة أن لا ولد له\n وسيأتي في الإشارة قول آخر\n قال القشيري: وفي الآية وأمثالها دليل على جواز حكاية قول المبتدعة فيما أخطأوا فيه في الاعتقاد، على وجه الردّ عليهم\n هـ\n قلت: ولا تجوز مطالقعة أقوالهم إلا لمَن رسختْ قدمه في المعرفة، والإعراض عنها أسلم",
      "translations": []
    }
  ]
}