{
  "chapter": "الزخرف",
  "text": "فاهلكنا اشد منهم بطشا ومضى مثل الاولين",
  "translations": [
    {
      "translation": "So We destroyed far more powerful (nations) than they. The example of earlier people is there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We utterly destroyed them although they were greater in might than these. The examples of ancient peoples have gone before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed the strongest among them in power. The stories of the ancient people have already been mentioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore destroyed the people who were more forceful than these, and the example of the earlier ones has already gone by.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We destroyed men stronger (in power) than these and the example of the ancients has passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We destroyed those who were stronger than these in prowess, and the case of the ancients has gone before,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so We destroyed men stronger in valour than they, and the example of the ancients passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We destroyed men mightier than these in prowess; and the example of the men of old hath gone (before them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so We destroyed those who were mightier than these; such was the example of the earlier peoples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore We destroyed peoples mightier than these in prowess; and there hath gone forth the example of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We destroyed those who were stronger than these, and the example of the former peoples has already come to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We destroyed (them)- stronger in power than these;- and (thus) has passed on the Parable of the peoples of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We destroyed men stronger (in power) than these, and the example of the ancients has passed away (before them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so We destroyed those who were mightier in courage than they. And the example of the ancients has passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed people more powerful than they, and so the example of the ancients has passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We destroyed greater than them in [striking] power, and the example of the former peoples has preceded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:8] So We destroyed those who were mightier than them — than your people — in prowess, strength, and [already] there passed, there has been mentioned in previous verses, the example of the ancients, the description of how they were destroyed, and thus the sequel for your people will be the same.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then we destroyed men mightier than these) mightier than the people of Mecca (in prowess) in strength and power; (and the example of the men of old hath gone (before them)) i.e. they were destroyed when they disbelieved in their messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تمادوا في الغفلة والعناد، وبالغوا فيها مغرورين { فَأَهْلَكْنَآ } أي: أخذناهم بذنوبهم، واستأصلناهم مع كونهم { أَشَدَّ مِنْهُم } أي: من هؤلاء المسرفين المستهزئين معك { بَطْشاً } حولا وقوة، وأكثر أموالاً وأولاداً، وأكبر جاهاً وشدةً { وَ } بعدما { مَضَىٰ } وجرى { مَثَلُ ٱلأَوَّلِينَ } [الزخرف: 8] على ما جرى، ومضى مثل الأولين من قصصهم ووقائعهم الهائلة، وسيمضي ويجري عن قريب على هؤلاء أيضاً مثلهم بالطريق الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}