{
  "chapter": "الزخرف",
  "text": "وتبارك الذى له ملك السموت والارض وما بينهما وعنده علم الساعة واليه ترجعون",
  "translations": [
    {
      "translation": "Blessed be Him to whom belongs the sovereignty of the heavens and the earth and everything in between them. The knowledge of the Hour is with Him. You will be returned to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He, who holds the kingdom of the heavens and the earth and all that lies between them. He alone has knowledge of the Hour, and to Him will you return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who has dominion over the heavens and the earth and all that is between them. With Him is the knowledge of the Hour; and to Him you shall all be sent back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He to whom belongs the heavens, the earth and all that is between them and who has the knowledge of the Hour of Doom. To Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Most Auspicious is He, for Whom is the kingship of the heavens and the earth and all that is between them; and only with Him is the knowledge of the Last Day; and towards Him you are to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Blessed be He to Whom belongs the kingdom of the heavens and the earth, and all that is between them, and with Whom is the knowledge of the Hour, and to Whom you (all) will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed is He Whose is the kingdom of the heavens and the earth and what is between them, and with Him is the knowledge of the hour, and to Him shall you be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him, to whom belongs the Kingdom of the heavens and the earth and all that between them is; with Him is the knowledge of the Hour, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed be He unto Whom belongeth the Sovereignty of the heavens and the earth and all that is between them, and with Whom is knowledge of the Hour, and unto Whom ye will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "blessed be He who has sovereignty over the kingdom of the heavens and the earth and all that lies between them. He alone has knowledge of the Hour, and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blest be He Whose is the dominion of the heavens and the earth and whatsoever is in-between the twain, and with Him is knowledge of the Hour, and Unto Him ye will be made to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He to whom belongs the kingdom of the heavens and the earth and whatever is between them, and with Him is the knowledge of the Hour, and to Him you will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed is He to Whom belongs the dominion of the heavens and the earth, and all between them: with Him is the Knowledge of the Hour (of Judgment): and to Him shall ye be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed be He to Whom belongs the kingdom of the heavens and the earth, and all that is between them, and with Whom is the knowledge of the Hour, and to Whom you (all) will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to Him to whom belong the Kingdom of the heavens and the earth, and all that is between them! With Him is the knowledge of the Hour and toHim you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed is He Who has sovereignty over the heavens and the earth and what is between them. He alone has knowledge of the Hour, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed is He to whom belongs the dominion of the heavens and the earth and whatever is between them and with whom is knowledge of the Hour and to whom you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:85] And Blessed, Magnificent, be He to Whom belongs the kingdom of the heavens and the earth and all that is between them; and with Him is the knowledge of the Hour, [of] when it shall come to pass, and to Him they will [all] be returned (yurja‘ūna, may also be read [second person plural] turja‘ūna, ‘you will be returned’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And blessed be He unto Whom) He is too exalted and exonerated from having sons and partners He unto Whom (belongeth the Sovereignty of the heavens and the earth and all that is between them) of created beings, (and with Whom is knowledge of the Hour) the knowledge of the coming of the Hour, (and unto Whom ye will be returned) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتَبَارَكَ } أي: تعاظم وتعالى الذات القادر العليم الحكيم { ٱلَّذِي لَهُ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: العلويات والسفليات { وَمَا بَيْنَهُمَا } من المركبات والممتزجات\n تدبيراً وتصرفاً على وجه الاستقلال بالإرادة والاختيار { وَعِندَهُ عِلْمُ ٱلسَّاعَةِ } الموعودة قيامها من عنده سبحانه { وَ } بالجملة: { إِلَيْهِ تُرْجَعُونَ } [الزخرف: 85] في النشأة الأخرى رجوع الأظلال إلى الأضواء والأمواج إلى الماء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وعنده علمُ الساعة } أي: العلم بالساعة التي فيها تقوم\n { وإِليه تُرجعون } للجزاء\n والالتفات للتهديد\n فيمن قرأ بالخطاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:1",
      "similarity": 0.5097441159958193
    },
    {
      "verse": "23:29",
      "similarity": 0.4890752255417752
    },
    {
      "verse": "25:1",
      "similarity": 0.4417634154554122
    },
    {
      "verse": "21:71",
      "similarity": 0.4330131214045579
    },
    {
      "verse": "44:3",
      "similarity": 0.43137924478868167
    }
  ]
}