{
  "chapter": "الزخرف",
  "text": "سبحن رب السموت والارض رب العرش عما يصفون",
  "translations": [
    {
      "translation": "Glory be to the Lord of the heavens and the earth, the Lord of the Throne, beyond what they describe.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All too glorious is He, Lord of the heavens and the earth, the Lord of all power, for what they ascribe to Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted be the Lord of the heavens and the earth, the Lord of the Throne, above what they attribute to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of the heavens and the earth and the Throne is too glorious to be described in the way they describe Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Purity is to the Lord of the heavens and the earth, the Lord of the Throne, from all what they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified is the Lord of the heavens and the earth, the Lord of the Throne! Exalted be He from all that they ascribe (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory to the Lord of the heavens and the earth, the Lord of power, from what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to the Lord of the heavens and the earth, the Lord of the Throne, above that they describe.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe (unto Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But -- exalted be the Lord of the heavens and earth, the Lord of the Throne -- He is far above their [false] descriptions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hallowed be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Clear is the Lord of the heavens and the earth, the Lord of the Throne, of whatever they allege [concerning Him]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory to the Lord of the heavens and the earth, the Lord of the Throne (of Authority)! (He is free) from the things they attribute (to him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified be the Lord of the heavens and the earth, the Lord of the Throne! Exalted be He from all that they ascribe (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations be to the Lord of the heavens and the earth, the Lord of the Throne, above that which they describe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified be the Lord of the heavens and the earth, the Lord of the Throne, beyond what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is the Lord of the heavens and the earth, Lord of the Throne, above what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[43:82] Glory be to the Lord of the heavens and the earth, the Lord of the Throne (the ‘arsh is the [same as the] kursī) above what they allege!’, [above] the lies which they speak in ascribing a child to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Glorified be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe (unto Him)) of sons and partners!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أما دلالته على الأول فلما دلّ قوله: { سُبْحان ربّ السموات } إلى قوله: { عمَّا يصفون } على نفي التالي وهو عبادة الولد أي: أو حده وأنزّهه تعالى عما يصفونه من كونه مماثلاً لشيء ربّاً خالقاً للأجسام كلها فلا يكون من جنسها\n فيفيد انتقاء الولد على الطريق البرهاني\n وأما دلالته على الثاني: فإذا جعل قوله: { سبحان رب السموات } إلى آخره\n من كلام الله تعالى لا من كلام الرسول\n أي: نزّه ربّ السموات عمّا يصفونه فيكون نفياً للمقدّم ويكون تعليق عبادة الرسول من باب التعليق بالمحال والمعلق بالشرط عند عدمه فحوى بدلالة المفهوم أبلغ عند علماء البيان من دلالة المنطوق\n كما قال في استبعاد الرؤية:\n[الأعراف\n الآية:143] والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سُبْحَانَ رَبِّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ رَبِّ ٱلْعَرْشِ } أي: تنزه وتعالى شأن من هو مربي العلويات والسلفيات\n المنبسط بالإحاطة التامة والاستيلاء الكامل الشامل على عموم عروش المظاهر بالاستقلال والانفراد { عَمَّا يَصِفُونَ } [الزخرف: 82] أولئك الواصفون من نسبة الولد والمولود له\n تعالى شأنه عما يقول الظالمون علواً كبيراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { سبحان ربِّ السماوات والأرض ربِّ العرش عما يصفون } أي: تنزّه رب هذه العوالم العظام عن اتخاذ الولد لأن اتخاذ الولد من صفة الأجسام\n ولو كان جسماً ما قدر على خلو هذه الأجرام\n وفي إضافة اسم الرب إلى أعظم الأجرام وأقواها\n تنبيه على أنها وما فيها من المخلوقات حيث كانت تحت ملوكت ربوبيته كيف يتوهم أن يكون شيء منها جزءاً منه\n وفي تكرير اسم الرب تفخيم لشأن العرش",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:22",
      "similarity": 0.8666944641236883
    },
    {
      "verse": "37:159",
      "similarity": 0.8167767287493489
    },
    {
      "verse": "37:180",
      "similarity": 0.794469569917656
    },
    {
      "verse": "23:91",
      "similarity": 0.5930221015580643
    },
    {
      "verse": "21:112",
      "similarity": 0.4862035802483618
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/43:82.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/43:82.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/43:82.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}