{
  "chapter": "الدخان",
  "text": "انى لهم الذكرى وقد جاءهم رسول مبين",
  "translations": [
    {
      "translation": "How can a warning benefit them? The Apostle who explained all things clearly had come to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how will they take heed? Such are they that a Messenger came to them clearly expounding the Truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How could this punishment bring them to their senses when a Messenger evidently had come to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it possible for them to accept guidance, whereas a Noble Messenger who speaks clearly has already come to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can there be for them an admonition, when a Messenger explaining things clearly has already come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall they be reminded, and there came to them an Apostle making clear (the truth),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should they have the Reminder, seeing a clear Messenger already came to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can there be remembrance for them, when a messenger making plain (the Truth) had already come unto them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can they benefit from admonition, seeing that a messenger had already come to them explaining things clearly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can there be an admonition Unto them, when surely there came Unto them an apostle manifest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will the admonition avail them, when a manifest apostle had already come to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall the message be (effectual) for them, seeing that an Messenger explaining things clearly has (already) come to them,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can there be for them an admonition (at the time when the torment has reached them), when a Messenger explaining things clearly has already come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how will they avail themselves of the Reminder, when a clear Messenger had already come to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how can they be reminded? An enlightening messenger has already come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How will there be for them a reminder [at that time]? And there had come to them a clear Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:13] God, exalted be He, says: How can there be a reminder for them, that is to say, faith will not benefit them once the chastisement has been sent down, when already there has come to them a manifest Messenger, whose Message is plain [to understand],\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How can there be remembrance for them) how can they take admonition or repent if We were to remove the torment from them; and it is also said: how can they take admonition or repent if We were to destroy 575 them at Badr; and it is also said: on the Day of Judgement, (when a messenger) Muhammad (pbuh) (making plain (the Truth)) in a language they understand (had already come unto them,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أنى لهم الذكرى } أي: الاتعاظ والإيمان بمجرد انكشاف العذاب { وقد جاءهم } ما هو أبلغ منه من الرسول المبين طريق الحق بالمعجز والبرهان ودعاهم إلى سبيله بالطرق الثلاثة من الحكمة والموعظة الحسنة والمجادلة بالتي هي أحسن { ثمَّ } أعرضوا ونسبوه إلى الجنون والتعليم المتنافيين لفرط احتجابهم وعنادهم { إنَّا كاشفوا العذاب قليلاً } بتعطيل الحواس والإدراكات { إنكم عائدون } إليه\n { يوم نبطش البطشة الكبرى } أي: وقت تمام الفراغ إلى إدراك العذاب المؤلم بتلك الهيئات وتحقق الخلود { إنّا منتقمون } معذّبون بالحقيقة أو بالردّ إلى الصحة والحياة البدنية، إنكم عائدون إلى الكفر لرسوخه فيكم { يوم نبطش البطشة الكبرى } بزوال الاستعداد وانطفاء نور الفطرة بالرين الحاصل من ارتكاب الذنوب والاحتجاب الكلي الموجب للعذاب الأبدي كما قال:\n\n[المطففين، الآيات:14 - 15] ننتقم منهم بالحقيقة بالحرمان الكلي والحجاب الأبدي والعذاب السرمدي\n وإن فسرنا القيامة بالكبرى: فالدخان هو حجاب الأنية الذي يغشى الناس عند ظهور نور الوحدة بطغيان النفس لانتحال صفات الربوبية وغلبة سكرة يوم الجمع المورثة للإباحة إذ هو من بقية النفس الأرضية اللطيفة بنور الوحدة المرتقبة إلى محل الشهود التي تأتي بها سماء الروح لتأثيره فيها بالتنوير إذ لم تحترق بالكلية بنار العشق بل صفت وتلطفت وتصعدت\n فأما المؤمن بالإيمان الحقيقي الموحد التام الاستعداد، المحب الغالب المحبة، فيصيبه كهيئة الزكمة، أي: السكرة التي قال فيها أبو زيد قدّس الله روحه: سبحاني ما أعظم شأني\n والحسين بن منصور رحمه الله: أنا الحق\n ثم يرتفع عنه سريعاً لمزيد العناية الإلهية وقوة الاستعداد الفطرية وشدة المحبة الحقيقية، فيتنبه لذلك ويتعذب به غاية التعذب ويشتاق إلى الانطماس في عين الجمع غاية الشوق، فيقول: هذا عذاب أليم، ويطلب الفناء الصرف، كما قال الحلاج قدّس الله روحه: بيني وبينك أني ينازعني فارفع بفضلك أني من البين\n ويدعو بلسان التضرع والافتقار:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفأجاب الله دعاءه، فأخذه بالقحط، فأكلوا الميتة والجيفة، وهلك كثير منهم، فيغشاهم حينئذ دخان عظيم، يسمع كل منهم كلام صاحبه ولا يراه من ظلمة الدخان، وقالوا صارخين متضرعين: { هَـٰذَا عَذَابٌ أَلِيمٌ * رَّبَّنَا ٱكْشِفْ عَنَّا ٱلْعَذَابَ إِنَّا مْؤْمِنُونَ } وكانوا عليه حتى جاء أبو سفيان إلى رسول الله صلى الله عليه وسلم فقال: إنك قدئ جئت بصلة الرحم، وإن قومك قد هلكوا من الجهد، فدعا لهم، فكشف الله عنهم جهدهم، ومع ذلك لم يوفوا بعهدهم الذي عهدوا، ولذلك رد الله عليهم بقوله: { أَنَّىٰ لَهُمُ ٱلذِّكْرَىٰ } أي: من أين يتأتى منهم التذكر والاتعاض { وَقَدْ جَآءَهُمْ } لتكميلهم وإرشادهم { رَسُولٌ مُّبِينٌ } [الدخان: 13] ظاهر الفضل والعظمة أكمل من كل الرسل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما اشتد بهم القحط، مشى أبو سفيان، ونفر معه إلى رسول الله صلى الله عليه وسلم وناشده الله تعالى والرحم، وواعدوه إن دعا لهم، وكشف عنهم، أن يؤمنوا، وذلك قوله تعالى: { ربنا اكشف عنا العذاب إِنا مؤمنون } أي: سنؤمن إن كُشف عنا العذاب، قال تعالى: { أنَّى لهم الذكرَى } أي: كيف يذَّكرون ويتَّعظون ويَفُون بما وعدوه من الإيمان عند كشف العذاب، { وقد جاءهم رسول مبين } أي: والحال أنهم يُشاهدون من دواعي التذكير وموجبات الاتعاظ، ما هو أعظم منه، حيث جاءهم رسول عظيم لشأن، بيِّن البرهان، يُبين لهم مناهج الحق بإظهار آيات ظاهرة، ومعجزات قاهرة، تخرّ لها صُمّ الجبال",
      "translations": []
    }
  ]
}