{
  "chapter": "الدخان",
  "text": "انا كاشفوا۟ العذاب قليلا انكم عائدون",
  "translations": [
    {
      "translation": "We remove the punishment a little, and you revert!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We remove the torment a little, you revert back (to misdeeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet We will hold the scourge back for a while, (but no sooner than We will do so) you will revert to your old ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall remove the torment for a while but you will revert to your old ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We now remove the punishment for some days – so you will again commit the same.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We shall remove the torment for a while. Verily, you will revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We will remove the punishment a little, (but) you will surely return (to evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, We are removing the chastisement a little; behold, you revert!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We withdraw the torment a little. Lo! ye return (to disbelief).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We to ease the torment for a while, you would still revert to denial of the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We shall remove the torment for a while; but verily ye shall revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We will withdraw the punishment a little; but you will revert [to your earlier ways].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall indeed remove the Penalty for a while, (but) truly ye will revert (to your ways).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We shall remove the torment for a while. Verily! You will revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are removing the punishment a little, but you revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will ease the punishment a little, but you will revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We will remove the torment for a little. Indeed, you [disbelievers] will return [to disbelief].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:15] ‘Indeed We will remove the chastisement, the famine from you [for], a little, time; and so it was removed from them. [But] you will indeed revert!’, to your disbelief — and they did.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We withdraw the torment) hunger (a little) until the Day of Badr. (Lo! ye) people of Mecca (return) to transgression. And when the torment was removed from them, they did indeed return to transgression, and so Allah destroyed them on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنا كاشفوا العذاب } أي:عذاب الحجاب والحرمان لإعراضهم بقوة العشق عن الرسول قليلاً بطلوع نور الوجه الباقي وإشراق سبحاته وإحراقها ما انتهى إليه بصره من خلقه { إنكم عائدون } بالتلوين إلى الحجاب بعد تجلي نور الذات لبقية الآثار إلى وقت التمكين { يوم نبطش البطشة الكبرى } أي: وقت الفناء الكلي والانطماس الحقيقي بحيث لا عين ولا أثر { إنا منتقمون } أي: ننتقم بالقهر الأحدي والإفناء الكلي من وجوداتهم وبقاياهم فيطهرون عن الشرك الخفي بالوجود الأحدي\n\n\nوأما الكافر، أي: المحجوب عن نور الذات، الممنوّ بحجب الصفات، المحروم عن الطمس عن عين الجمع بتوهم الكمال فيبقى في مقام الأنائية ويتفرعن وراء حجاب الأنائية كما قال اللعين:\n\n[النازعات، الآية:24 }\n\n[القصص، الآية:38]، فيخلع عن عنقه ربقة الشريعة ويسير بسيرة الإباحة ويتجسر على المخالفات ويتزندق بارتكاب المعاصي وتركه الطاعات، فيكون من شرار الناس الذين قال فيهم:\n\n \" شرّ الناس من قامت القيامة عليه وهو حيّ \" \n\nفهو في عدم التمييز والرجوع إلى التفصيل والانهماك في الدواعي الطبيعية والتعمّق في الجاهلية كالسكران غلب الهوى على عقله وأحاط به الحجاب من جميع جهاته وظهر أثر الغيّ من مشاعره، هذا عذاب أليم لكنه لا يشعر به لشدّة انهماكه في تفرعنه وقوة شكيمته في تشيطنه، كلما دعاه الموحد القائم بالحق المهدي إلى نور الذات بالفناء المطلق المنصور من عند الله بالوجود الموهوب المتحقق ونبهه على ما به من الاحتجاب أبى واستكبر وطغى وتجبر لاستغنائه بنفسه وثباته في غيِّه حتى إذا وقع في الارتياب وتفطّن بالحجاب عند ارتتاج الباب بتعيين المآب وتيقن العقاب قال:\n\n[الدخان، الآية:12] كما قال فرعون حين أدركه الغرق:\n\n[يونس، الآية:90]، { أنى لهم الذكرى } أي: الاتعاظ والإيمان الحقيقي وقد عاندوا الحق وأعرضوا عن القائم بالحق، فلعنوا وطردوا\n { إنا كاشفو العذاب } ريثما تحققوا ما هم فيه من الوقوف مع النفس وتبينوا التفريط في جنب الحق { إنكم عائدون } لفرط تمكن الهوى من أنفسكم وتشرّب قلبوكم بمحبة نفوسكم واستيلاء صفاتها عليكم وقوّة الشيطنة فيكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل الإخبار والتنبيه لحبيبه صلى الله عليه وسلم بعدما دعا لهم بالكشف: { إِنَّا } من مقام عظيم جودنا معك يا أكمل الرسل { كَاشِفُواْ ٱلْعَذَابِ } المحيط بهم بدعائك زمانا { قَلِيلاً } في دار الاختبار\n إلا أنهم لم يوفوا بعهدهم الذي عهدوا معك لعراقتهم وانهماكهم في الكفر\n ثم خاطبهم سبحانه مخبراً بما سيصدر عنهم فقال: { إِنَّكُمْ } وإن كشفنا العذاب عنكم أيها الضالون المكذبون { عَآئِدُونَ } [الدخان: 15] راجعون إلى كفركم وضلالكم غب الكشف والفرج\n مبادرون على ما كنتم عليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:12",
      "similarity": 0.7508842204997481
    },
    {
      "verse": "53:58",
      "similarity": 0.6469245535231988
    },
    {
      "verse": "16:54",
      "similarity": 0.5541464708859246
    },
    {
      "verse": "27:62",
      "similarity": 0.5365803316525668
    },
    {
      "verse": "6:17",
      "similarity": 0.5285352644155856
    }
  ]
}