{
  "chapter": "الدخان",
  "text": "يوم نبطش البطشة الكبرى انا منتقمون",
  "translations": [
    {
      "translation": "On the day We launch the Great Assault We will certainly take Our revenge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day that We shall seize them with a grievous hold, We will indeed castigate them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when We shall seize them with a mighty seizing, that will be the Day on which We shall inflict upon you full retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, We shall truly take Our revenge on the day when the great seizure takes place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when We will seize with the greatest seizure – We will indeed take revenge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We shall strike you with the great Batshah. Verily, We will exact retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We will seize (them) with the most violent seizing; surely We will inflict retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when We shall assault most mightily, then We shall take Our vengeance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We shall seize them with the greater seizure, (then) in truth We shall punish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day We inflict the direst scourge upon all sinners, We will certainly exact retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon We assault them with the greatest assault, verily We shall take vengeance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall strike with the most terrible striking, We will indeed take vengeance [on them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day We shall seize you with a mighty onslaught: We will indeed (then) exact Retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We shall seize you with the greatest grasp. Verily, We will exact retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But on that Day We will assault them most mightily, and then We shall revenge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when We launch the Great Assault—We will avenge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day We will strike with the greatest assault, indeed, We will take retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:16] Mention, the day when We shall assault with the most mighty assault — this was the day of [the battle of] Badr — [then] indeed We shall take vengeance, on them (al-batsh, means ‘to seize violently’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "This is because He said: (On the day when We shall seize them with the greater seizure) We shall punish them with the greater punishment, by the sword on the Day of Badr ((then), in truth We shall punish) with Our torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ نَبْطِشُ ٱلْبَطْشَةَ ٱلْكُبْرَىٰ إِنَّا مُنتَقِمُونَ } معناه يومُ بَدرٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يوم نبطش البطشة الكبرى } بالقهر الحقيقي والإذلال الكلي والطرد والإبعاد ننتقم منهم لمكان شركهم وعبادتهم لأنفسهم ومبارزتهم علينا بالظهور في مقابلتنا ومنازعتهم رداء الكبرياء منَّا، كما قلنا:\n\n \" العظمة إزاري والكبرياء ردائي، فمن نازعني واحداً منهما قذفته في النار \" \n\nوأما حكاية قوم فرعون فاشتهيت تطبيقها على حالك فافهم منها\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل { يَوْمَ نَبْطِشُ ٱلْبَطْشَةَ ٱلْكُبْرَىٰ } أي: يوم نأخذهم وننتقم عن جرائهم وآثامهم في يوم القيامة والطامة الكبرى، كيف ينقذون أنفسهم من عذابنا الذي لا مرد له حينئذ { إِنَّا مُنتَقِمُونَ } [الدخان: 16] منهم ألبتة يومئذ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وانتصاب { يوم نبطش } باذكر أو بما دلّ عليه { إنا منتقمون } ، وهو ننتقم، لا بمنتقمون، لأن ما بعد \" إن \" لا يعمل فيما قبله\n\n\nالإشارة: { فارتقب } أيها العارف { يوم تأتي السماء بدخان مبين } أي: يوم يبرز من سماء الغيوب بدخان الحس، وظلمة الأسباب تغشى قلوب الناس، فتحجبهم عن شمس العرفان، هذا عذاب أليم موجع للقلوب، حيث حجبها عن حضرة علاّم الغيوب\n وأما العارف فشمسه ضاحية، ونهاره مشرق على الدوام، كما قال شاعرهم:\n\nوقال آخر:\n\nقال القَشيري: قيامة هؤلاء - أي الصوفية - مُعَجَّلة لهم، يوم تأتي السماء فيه بدخان، مبين، وهو باب غيبة الأخبار، وانسداد باب ما كان مفتوحاً من الأنس بالأحباب\n قلت: وأحسن من عبارته أن تقول: وهو باب غيبة الأنوار، وانسداد نبع الأسرار\n ثم قال: وفي معناه قالوا:\n\nهـ\n وقوله تعالى: { ربنا اكشف عنا العذاب } قال القشيري: وقد يستزيد هؤلاء العذاب على العكس من أحوال الخلق، وفي ذلك أنشدوا:\n\nفهم يسألون البلاء بدل ما يستكشفه الخلق، وأنشدوا:\n\nهـ\n قلت: وأصرح منه قول الشاعر:\n\nوقول الجيلاني رضي الله عنه:\n\nقوله تعالى: { أنَّى لهم الذكرى } أي: كيف يتّعظ مَن تنكَّب عن صحبة الرجال، وملأ قلبه بالخواطر والأشغال؟ وقد جاءهم مَن يدعوهم إلى الكبير المتعال، فأنكروه، وقالوا: مُعَلَّمٌ مجنون، إنا كاشفوا العذاب عن قلوبهم من الشكوك والخواطر قليلاً، حين يتوجهون إلينا، ويفزعون إلى بابنا، أو يسمعون مِن بعض أوليائنا، ثم تكثر عيهم الخواطر، حين تنقشع عنهم سحابة أمطار الواردات من قلوب أوليائنا، إنكم عائدون إلى ما كنتم عليه، { يوم نبطش البطشة الكبرى } هي خطفة الموت، فلا ينفع يفها ندم ولا رجوع، بل يورثهم حزناً طويلاً، فلا يجدون في ظلال انتقامنا مقيلاً، فننتقم ممن أعرض بسريرته عن دوام رؤيتنا\n ثم ذكر وبال مَن سلك مسلكهم، فقال: { وَلَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:12",
      "similarity": 0.7511300836614453
    },
    {
      "verse": "54:36",
      "similarity": 0.6459210179448296
    },
    {
      "verse": "26:130",
      "similarity": 0.5886041646453757
    },
    {
      "verse": "7:195",
      "similarity": 0.4914616903768772
    },
    {
      "verse": "15:79",
      "similarity": 0.46077576820400545
    }
  ]
}