{
  "chapter": "الدخان",
  "text": "وان لا تعلوا۟ على الله انى ءاتيكم بسلطن مبين",
  "translations": [
    {
      "translation": "And: 'Do not exalt yourselves above Allah. I come to you with clear authority.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think yourselves to be above God: I have come to you with clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and do not exalt yourselves in defiance of Allah. I have come to you with a clear authority (as a Messenger).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not consider yourselves above God? I shall show you a manifest authority (in support of my truthfulness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And saying, “And do not rebel against Allah; I have brought a clear proof to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And exalt not yourselves against Allah. Truly, I have come to you with a manifest authority.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that do not exalt yourselves against Allah, surely I will bring to you a clear authority:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, 'Rise not up against God; behold, I come to you with a clear authority,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And saying: Be not proud against Allah. Lo! I bring you a clear warrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not set yourselves above God: I bring you clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And saying exalt not yourselves against Allah; verily I have come Unto you with an authority manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not defy Allah. Indeed I bring you a manifest authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not arrogant as against Allah: for I come to you with authority manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And exalt not (yourselves) against Allah. Truly, I have come to you with a manifest authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not rise up against Allah, I come to you with clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, “Do not exalt yourselves above God. I come to you with clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [saying], \"Be not haughty with Allah. Indeed, I have come to you with clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:19] and, ‘Do not rebel, [do not] try to act strong, against God, by neglecting obedience to Him. Lo! I bring you a clear warrant’, [clear] proof of [the sincerity of] my Mission — but they threatened to stone him to death.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And saying: Be not proud against Allah) nor lie against Him. (Lo! I bring you a clear warrant) a clear proof and plain warrant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } عليكم { أَن لاَّ تَعْلُواْ } ولا تتكبروا { عَلَى ٱللَّهِ } وعلى قبول وحيه وتصديق رسوله { إِنِّيۤ آتِيكُمْ بِسُلْطَانٍ مُّبِينٍ } [الدخان: 19] حجة واضحة دالة على صدقي في دعواي { وَ } مع وضوح الحجة وسطوع البرهان أن تظهروا علي بالعناد والمكابرة اتكالاً على شوكتكم وكثرتكم، فإنا لا نبالي بكم وبشوكتكم واستيلائكم، بل { إِنِّي عُذْتُ } التجأت ووثقت { بِرَبِّي وَرَبِّكُمْ أَن تَرْجُمُونِ } [الدخان: 20] وتقتلون أو تضربوني بالحجارة أو تشتموني باللسان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأن لا تعلوا على الله } أي: لا تتكبّروا على الله بالاستهانة بوحيه وبرسوله أو: لا تتكبروا على نبيّ الله، { إِني آتيكم } من جهته تعالى { بسلطانٍ مبين } بحجة واضحة، لا سبيل إلى إنكارها، تدل على نبوتي، وفي إيراد الأداء مع الأمين، والسلطان مع العلو، من الجزالة ما لا يخفى، { وإِني عُذْتُ بربي وربكم } أي: التجأت إليه، وتوكلتُ عليه، { أن ترجمون } من أن ترجمون، أي: تؤذونني ضرباً وشتماً، أو تقتلوني رجماً\n قيل: لما قال: { وأن لا تعلوا على الله } توعّدوه بالرجم، فتوكّل على الله، واعتصم به، ولم يُبال بما توعّدوه\n { وإِن لم تؤمنوا لي فاعتزلونِ } أي: وإن كابرتم ولم تُذعنوا لي، فلا مولاة بيني وبين مَن لا يؤمن، فتنحُّوا عني، أو: فخلُّوني كفافاً لا لي ولا عليّ، ولا تتعرضوا لي بشرِّكم وأذاكم، فليس ذلك جزاء مَن دعاكم إلى ما فيه فلا حُكم، قال أبو السعود: وحَمْلُه على قطع الوصلة وعدم الموالاة بينه وبينهم، يأباه المقام\n { فدعا ربَّه } بعدما تمادوا على تكذيبه، شاكياً إلى ربه: { أَنَّ هؤلاء } أي: بأن هؤلاء، { قوم مجرمون } وهو تعريض بالدعاء عليهم، بذكر ما استوجبوه، ولذلك سمي دعاء، وقيل: كان دعاؤه،: اللهم عجِّل لهم ما يستوجبونه بإجرامهم، وقيل: هو قوله:\n\n[القمر: 10] وقيل: قوله:\n\n[يونس: 85] وقُرئ بالكسر على إضمار القول\n قال تعالى له بعدُ: { فأَسْرِ بعبادي ليلاً } والفاء تؤذن بشرط محذوف، أي: إن كان الأمر كما تقول { فأسْرِ بعبادي } بني إسرائيل { ليلاً إِنكُم مُتَّبعون } أي: دبّر الله أن تتقدموا، ويتبعكم فرعون وجنوده، فننجّي المتقدمين، ونغرف الباقين، { واترك البحر رَهْواً } ساكناً على حالته بعدما جاوزته، ولا تضربه بعصاك لينطبق، ولا تُغيره عن حاله ليدخله القبط، أراد موسى عليه السلام لمّا جاوزه أن يضربه بعصا لينطبق، فأمره أن يتركه ساكناً على هيئته، قاراً على حالته، من انتصاب الماء كالطود العظيم، وكون الطريق يبساً لا يُغير منه شيئاً، ليدخله القبط، فإذا دخلوا فيه أطبقه الله عليهم، فالرهو في كلام العرب: السكون، قال الشاعر:\n\n\n\nأي: ساكنة، وقيل: الرهو: الفرجة الواسعة، أي: اتركه مفتوحاً على حاله منفرجاً، { إنهم جند مُغْرَقون } بعد خروجكم من البحر\n وقرئ بالفتح، أي: لأنهم\n الإشارة: كل زمان له فراعين، يحبسون الناسَ عن طريق الله، وعن خدمته، فيبعث الله إليهم مَن يُذكَّرهم، ويأمرهم بتخلية سبيلهم، أو بأداء الحقوق الواجبة عليهم، فإذا كُذّب الداعي، قال: وإن لم تؤمنوا فاعتزلون، فإذا أيِس من إقبالهم دعا عليهم، فيغرقون في بحر الهوى، ويهلكون في أودية الخواطر\n وبالله التوفيق\n ثم حضَّ على الاعتبار، فقال: { كَمْ تَرَكُواْ مِن جَنَّاتٍ وَعُيُونٍ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:156",
      "similarity": 0.6506934108881357
    },
    {
      "verse": "11:96",
      "similarity": 0.618066572619364
    },
    {
      "verse": "40:23",
      "similarity": 0.618066572619364
    },
    {
      "verse": "16:100",
      "similarity": 0.6147509716971395
    },
    {
      "verse": "52:38",
      "similarity": 0.588714374899724
    }
  ]
}