{
  "chapter": "الدخان",
  "text": "ولقد فتنا قبلهم قوم فرعون وجاءهم رسول كريم",
  "translations": [
    {
      "translation": "Before them We put Pharaoh's people to the test when a noble Messenger came to them, saying",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had tried the people of Pharaoh before them. A respected prophet had come to them (saying):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed before that We subjected the Pharaonites to the same test. A noble Messenger came to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had certainly tested the people of the Pharaoh before them to whom a noble Messengers had come, saying,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before them We indeed tried the people of Firaun, and an Honourable Noble Messenger came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We tried before them Fir`awn's people, when there came to them a noble Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We tried before them the people of Firon, and there came to them a noble apostle,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already before them We tried the people of Pharaoh, and a noble Messenger came unto them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We tried before them Pharaoh's folk, when there came unto them a noble messenger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tried the people of Pharaoh before them: a noble messenger was sent to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly afore them We proved Fir'awn's people, and there came Unto them an apostle honoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We tried the people of Pharaoh before them, when a noble apostle came to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did, before them, try the people of Pharaoh: there came to them a messenger most honourable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We tried before them Fir'aun's (Pharaoh) people, when there came to them a noble Messenger [i.e. Musa (Moses)],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tried Pharaoh's nation before them. A noble Messenger came to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them We tested the people of Pharaoh; a noble messenger came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already tried before them the people of Pharaoh, and there came to them a noble messenger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:17] And certainly We tried, We tested, before them the people of Pharaoh, together with him, when a messenger came to them, namely, Moses, peace be upon him, who was honoured, before God, exalted be He,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We tried before them) before the Quraysh (Pharaoh's folk) by punishing them, (when there came unto them a noble messenger) i.e. Moses,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تسلية لحيبيه صلى الله عليه وسلم وتسكيناً لقلبه بما أهمه من استهزاء قومه معه واستخفافهم عليه: { وَ } كما امتحنا قريشاً بإرسالك إليهم مع إنا نعلم منهم أنهم لم يؤمنوا لك ولم يهتدوا بهدايتك، وأوقعناهم في فتنة عظيمة وبلية فظيعة { لَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ } بإرسال أخيك موسى الكليم إياهم { وَجَآءَهُمْ رَسُولٌ } مرسل من لدينا { كَرِيمٌ } [الدخان: 17] مكرم بأنواع الكرامات، مريد بالمعجزات، مبلغ لهم على مقتضى الوحي الإلهي { أَنْ أَدُّوۤاْ } أي: بأن أدوا { إِلَيَّ عِبَادَ ٱللَّهِ } حق الله، وأرسلوا معي عباده بني إسرائيل { إِنِّي لَكُمْ } من قبل ربى { رَسُولٌ أَمِينٌ } [الدخان: 18] مأمون مصون عن الكذب والافتراء، غير متهم به؛ لدلالة ما عندي من المعجزات على صدق دعوتي ورسالتي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولقد فتنا قبلهم } قبل هؤلاء المشركين، { قومَ فرعون } أي: امتحانهم بإرسال موسى عليه السلام، أو: أوقعناهم في الفتنة بالإمهال وتوسيع الأرزاق، أو فعلنا بهم فعل المختبِر ليظهر ما كان باطناً، { وجاءهم رسولٌ كريمٌ } موسى عليه السلام، أي: كريم على الله، أو على المؤمنين، أو في نفسه حسيب نسيب، لأن الله تعالى لم يبعث نبيّاً إلا من سادات قومه: { أنْ أدُّوا إِليَّ عبادَ الله } أي: بان أدُّوا إليّ، أي: ادفعوا عبادَ الله، وهم بنو إسرائيل، بأن ترسلوهم معي، فكانت دعوة موسى لفرعون بعد الإقرار بالتوحيد إرسال بني إسرائيل من يده، أو: بأن أدُّوا إليّ يا عباد الله ما يجب عليكم من الإيمان، وقبول الدعوة، فالعباد على هذا عام\n فـ \" إن \" مفسرة لأن مجيء الرسل لا يكون إلا بدعوة، وهي تتضمن القول، أو مخففة، أي: جاءهم بأن الشأن أدوا إليّ، و \" عبادُ الله \" على الأول: مفعول به، وعلى الثاني: منادى، { إِني لكم رسولٌ أمين } تعليل للأمر، أو لوجوب المأمور، أي: رسول غير ظنين، قد ائتمنني الله على وحيه، وصدّقني بالمعجزات القاهرة",
      "translations": []
    }
  ]
}