{
  "chapter": "الدخان",
  "text": "فما بكت عليهم السماء والارض وما كانوا۟ منظرين",
  "translations": [
    {
      "translation": "Neither heaven nor earth shed any tears for them and they were granted no reprieve.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither did the heavens weep for them, nor the earth, nor were they granted respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then neither the sky shed tears over them nor the earth. They were granted no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sky nor the earth cried for them, nor were they given respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the heavens and the earth did not weep for them, and they were not given respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heavens and the earth wept not for them, nor were they given respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the heaven and the earth did not weep for them, nor were they respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither heaven nor earth wept for them, nor were they respited;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heaven and the earth wept not for them, nor were they reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither heaven nor earth wept for them, nor were they allowed any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heavens and the earth wept not over them, nor were they respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So neither the sky wept for them, nor the earth; nor were they granted any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And neither heaven nor earth shed a tear over them: nor were they given a respite (again).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heavens and the earth wept not for them, nor were they given a respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither heaven nor earth shed tears for them; nor were they respited,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither heaven nor earth wept over them, nor were they reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the heaven and earth wept not for them, nor were they reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:29] So neither the heaven nor the earth wept for them — in contrast to the [case with] believers, at the point of whose death weep both their places of prayer on earth and the route by which their deeds ascend the heaven; nor were they reprieved, [nor] were they deferred [until they were able] to make repentance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the heaven) the gate of heaven (and the earth) and the place of prayer on earth (wept not for them) for Pharaoh and his folk; this is because when the believer dies the gate of heaven from which his works ascends, and the place wherein he used to pray on earth, will weep for him; Pharaoh and his folk did not have any good works to ascend to heaven nor any place of prayer on earth, (nor were they reprieved) from drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَا بَكَتْ عَلَيْهِمُ ٱلسَّمَآءُ وَٱلأَرْضُ } يقال إنه ليس من مُؤمنٍ إلاّ وَلَهُ بَابٌ يَصعدُ فيهِ عَملُهُ وكلامُهُ\n وبابٌ يَخرُجُ منهُ رِزقُهُ\n فإذا ماتَ وفُقِدَ بَكيا عَليهِ أربعينَ صباحاً\n ولمْ يكنْ لآل فرعون أَعمالٌ صالحةٌ تَبكي ذلك عليهِم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فما بَكَتْ عليهم السماءُ والأرض } مجاز عن الاكتراث بهلاكهم، والاعتداد بوجودهم، وفيه تهكُّم بهم، وبحالهم المنافية، بحال مَن يعظم فقده، فيقال: { بكت عليهم السماء والأرض } وكانت العرب إذا عظَّمت مهلك رجل قالوا: بكته الريحُ والبرقُ والسماء، قال الشاعر:\n\nوقال جرير، يرثي عمر بن عبد العزيز:\n\nوقيل: البكاء حقيقة، وأن المؤمن تبكي عليه من الأرض مُصلاَّه، ومحل عبادته، ومن السماء مَصْعدُ عمله، كما في الحديث، وإذا مات العالم بكت عليه حيتان البحر، ودوابه، وهَوام البر وأنعامه، والطير في الهواء، وهؤلاء لمَّا ماتوا كُفاراً لم يعبأ الوجودُ بفقدهم، بل يفرح بهلاكهم، { وما كانوا } لّمَّا جاء وقت هلاكهم { مُنظّرين } ممهلين إلى وقت آخر، أو إلى الآخر، بل عجّل لهم في الدنيا",
      "translations": []
    }
  ]
}