{
  "chapter": "الدخان",
  "text": "اهم خير ام قوم تبع والذين من قبلهم اهلكنهم انهم كانوا۟ مجرمين",
  "translations": [
    {
      "translation": "Are they better or the people of Tubba' and those before them whom We destroyed? They were certainly evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better than the people of Tubba, and those who had lived before them, whom We destroyed as they were sinners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these better or the people of Tubba and those who went before them? We destroyed them for they were a criminal people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better than the tribe of Tubba (name of a Yemenite tribal chief) and those who lived before them? We destroyed them. They were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba? And those who were before them? We destroyed them; they were indeed criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba` and those before them We destroyed them because they were indeed criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba and those before them? We destroyed them, for surely they were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba' and those before them whom We destroyed? They were surely sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the folk of Tubb'a and those before them? We destroyed them, for surely they were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better than the people of Tubba' and those who came before them? We destroyed them, because they were guilty of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better Or the people of Tubba and those afore them? We destroyed them; verily they were culprits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba‘, and those who were before them? We destroyed them; indeed, they were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Are they better than the people of Tubba and those who were before them? We destroyed them because they were guilty of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba' and those before them? We destroyed them because they were indeed Mujrimun (disbelievers, polytheists, sinners, criminals, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba' and those who were before them whom We destroyed? Indeed they were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba and those before them? We annihilated them. They were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba' and those before them? We destroyed them, [for] indeed, they were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:37] God, exalted be He, says: Are they better, or the people of Tubba‘ — [he was] a prophet or a righteous man — and those, communities, before them? We destroyed, because of their disbelief. In other words: they are not mightier than those, and yet they were destroyed; indeed they were criminals.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah said (Are they better) are your people better, (or the folk of Tubba') or the people of Himyar, whose name was As'ad Ibn Malkikarb and his agnomen was Abu Karb, he was called Tubba' because he had a great number of followers (and those before them) before the people of Tubba'? (We destroyed them, for surely they were guilty) they were idolaters. Would your people not fear that We destroy them and punish them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أصروا على عنادهم وبالغوا في إنكارهم، رد الله عليهم على أبلغ وجه وآكده بقوله مستفهما على سبيل التقريع والتوبيخ: { أَهُمْ } يعني: قريشاً { خَيْرٌ } مالاً وجاهاً، وثروة وسيادة { أَمْ قَوْمُ تُبَّعٍ } اسم لمن ملك الحمير، ككسرى لملوك فارس، وقيصر لملوك الروم، والمراد: أبو كريب سعيد بن منبل، آمن بنبينا قبل بعثته، فتنحى عن قومه، معللين أنك قد تركت ديننا، فأخذهم الله بجرمهم هذا، وأهلكهم { وَٱلَّذِينَ مِن قَبْلِهِمْ } من الأمم الهالكة كعاد وثمود { أَهْلَكْنَاهُمْ } مع شدة قوتهم وبسطتهم وكثرة شوكتهم { إِنَّهُمْ كَانُواْ مُجْرِمِينَ } [الدخان: 37] بالجرائم العيظمة الموجبة للمقت والهلاك، أمثال جرائمكم أيها المجرمون المسرفون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قيل: كانوا يطلبون أن ينشر لهم قُصيّ بن كلاب، ليُشاوروه، كان كبيرهم ومفزعهم في المهمات، قال تعالى: { أَهُم خيرٌ أم قومُ تُبَّع } ردّ لقولهم وتهديد لهم، أي: أهم خير في القوة والمنعة، اللتين يدفع بهما أساب الهلاك، أم قوم تُبع الحميري؟ وكان سار بالجيوش حتى حيّر الحيرة، وبنى سمرقند، وقيل: هدمها، وكان مؤمناً وقومه كافرين، ولذلك ذمّهم الله تعالى دونه، وكان يكتب في عنوان كتابه: بسم الله الذي ملك برّاً وبحراً ومضحاً وريحاً\n قال القشيري: كان تُبَّع ملك اليمن، وكان قومه فيهم كثرة، وكان مسلماً، فأهلك اللّهُ قومَه على كثرة عددهم وكمال قوتهم\n هـ\n روي عنه عليه السلام أنه قال: لا تسبُّوا تُبعاً فإنه كان مؤمناً \" هـ وقيل: كان نبيّاً، وفي حديث أبي هريرة عنه صلى الله عليه وسلم قال:\n\n \" لا أدري تُبعاً كان نبيّاً أو غير نبي \"\n \n\nوذكر السهيلي: أن الحديث يُؤذن بأنه واحد بعينه، وهو - والله أعلم - أسعد أبو كرب، الذي كسا الكعبة بعدما أراد غزوه، وبعدما غزا المدينة، وأراد خرابها، ثم انصرف عنها، لما أخبر أنها مهاجَر نبي اسمه \" أحمد \" وقال فيه شعراً، وأودعه عند أهلها، فكانوا يتوارثونه كابراً عن كابر، إلى أن هاجر النبي صلى الله عليه وسلم فأدُّوه إليه\n ويقال: كان الكتاب والشعر عند أبي أيوب الأنصاري: حتى نزل عليه النبي صلى الله عليه وسلم فدفعه إليه، وفي الكتاب الشعر، وهو:\n\nوذكر الزجاج وابن أبي الدنيا: أنه حُفر قبرٌ بصنعاء في الإسلام، فوجد فيه امرأتان، وعند رؤوسهما لوح من فضة، مكتوب فيه بالذهب اسمهما، وأنهما بنتا تُبع، تشهدان ألا إله إلا الله، ولا تُشركان به شيئاً، وعلى ذلك مات الصالحون قبلهما\n هـ\n ويقال لملوك اليمن: التبابعة لأنهم يُتبعون، ويقال لهم: الأقيال لأنهم يتقيلون\n هـ\n { والذين مِن قبلهم } عطف على \" قوم تُبع \" ، والمراد بهم عاد وثمود، وأضرابهم من كل جبار عنيد، أُولي بأس شديد، { أهلكناهم } بأنواع من العذاب { إِنهم كانوا مجرمين } تعليل لإهلاكهم، ليعلم أن أولئك حيث أهلكوا بسبب إجرامهم مع ما كانوا عليه من غاية القوة والشدة، فكان مهلكَ هؤلاء - وهم شركاؤهم في الإجرام، مع كونهم أضعف منهم في الشدة والقوة - أولى\n قال الطيبي: لما أنكر المشركون الحشر، بقولهم: { إن هي إلا موتتنا الأولى } وبَّخهم بقوله: { أهم خير أم قوم تبع } إيذاناً بأن هذا الإنكار ليس عن حجة قاطعة ودليل ظاهر، بل عن مجرد حب العاجلة، والتمتُّع بملاذ الدنيا، والاغترار بالمال والمآل والقوة والمنعة، أي: كما فعل بمَن سلك قبلَهم من الفراعنة والتبابعة حتى هلكوا، كذلك يفعل بهؤلاء إن لم يرتدعوا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:13",
      "similarity": 0.4554141488076489
    },
    {
      "verse": "15:58",
      "similarity": 0.420514578248226
    },
    {
      "verse": "51:32",
      "similarity": 0.420514578248226
    },
    {
      "verse": "21:6",
      "similarity": 0.42022290145739166
    },
    {
      "verse": "23:48",
      "similarity": 0.4116811571632726
    }
  ]
}