{
  "chapter": "الدخان",
  "text": "اهم خير ام قوم تبع والذين من قبلهم اهلكنهم انهم كانوا۟ مجرمين",
  "translations": [
    {
      "translation": "Are they better or the people of Tubba' and those before them whom We destroyed? They were certainly evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better than the people of Tubba, and those who had lived before them, whom We destroyed as they were sinners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these better or the people of Tubba and those who went before them? We destroyed them for they were a criminal people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better than the tribe of Tubba (name of a Yemenite tribal chief) and those who lived before them? We destroyed them. They were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba? And those who were before them? We destroyed them; they were indeed criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba` and those before them We destroyed them because they were indeed criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba and those before them? We destroyed them, for surely they were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba' and those before them whom We destroyed? They were surely sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the folk of Tubb'a and those before them? We destroyed them, for surely they were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better than the people of Tubba' and those who came before them? We destroyed them, because they were guilty of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better Or the people of Tubba and those afore them? We destroyed them; verily they were culprits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba‘, and those who were before them? We destroyed them; indeed, they were guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Are they better than the people of Tubba and those who were before them? We destroyed them because they were guilty of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba' and those before them? We destroyed them because they were indeed Mujrimun (disbelievers, polytheists, sinners, criminals, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba' and those who were before them whom We destroyed? Indeed they were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better, or the people of Tubba and those before them? We annihilated them. They were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they better or the people of Tubba' and those before them? We destroyed them, [for] indeed, they were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:37] God, exalted be He, says: Are they better, or the people of Tubba‘ — [he was] a prophet or a righteous man — and those, communities, before them? We destroyed, because of their disbelief. In other words: they are not mightier than those, and yet they were destroyed; indeed they were criminals.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَهُمْ خَيْرٌ أَمْ قَوْمُ تُبَّعٍ وَالَّذِينَ مِنْ قَبْلِهِمْ أَهْلَكْنَاهُمْ إِنَّهُمْ كَانُوا مُجْرِمِينَ (37)استئناف ناشىء عن قوله : { ولقد فتنّا قبلهم قوم فرعون } \\[ الدخان : 17 \\] فضمير { هم راجع إلى اسم الإشارة في قوله : { إن هؤلاء ليقولون إن هي إلا موتتنا الأولى } \\[ الدخان : 34 ، 35 \\] فبعد أن ضرب لهم المثل بمهلك قوم فرعون زادهم مثلاً آخر هو أقرب إلى اعتبارهم به وهو مُهلك قوم أقرب إلى بلادهم من قوم فرعون وأولئك قوم تبّع فإن العرب يتسامعون بعظمة مُلك تُبَّع وقومه أهل اليمن وكثير من العرب شاهدوا آثار قوتهم وعظمتهم في مراحل أسفارهم وتحادثوا بما أصابهم من الهلك بسيل العرم . وافتتح الكلام بالاستفهام التقريري لاسترعاء الأسماع لمضمونه لأن كل أحد يعلم أن تُبَّعاً ومن قبله من الملوك خير من هؤلاء المشركين .والمعنى : أنهم ليسوا خيراً من قوم تبع ومن قبلهم من الأمم الذين استأصلهم الله لأجل إجرامهم فلما مَاثلوهم في الإجرام فلا مزيّة لهم تدفع عنهم استئصال الذي أهلك الله به أمماً قبلهم .والاستفهام في { أهم خير أم قوم تبع } تقريري إذ لا يسعهم إلا أن يعترفوا بأن قوم تبّع والذين من قبلهم خير منهم لأنهم كانوا يضربون بهم الأمثال في القوة والمنعة . والمراد بالخيرية التفضيل في القوة والمنعة ، كما قال تعالى بعد ذكر قوم فرعون { أكفاركم خيرٌ من أُولئكم } في سورة القمر ( 43 ) . وقوم تُبّع هم حمير وهم سكان اليمن وحضرَموت من حمير وسبأ وقد ذكرهم الله تعالى في سورة قَ .وتُبّع بضم الميم وتشديد الموحدة لقب لِمَن يملك جميع بلاد اليمن حِمْيراً وسبأ وحضرموت ، فلا يطلق على الملك لقب تُبّع إلا إذا ملك هذه المواطن الثلاثة . قيل سمّوه تُبّعاً باسم الظل لأنه يَتبع الشمس كما يتبع الظل الشمس ، ومعنى ذلك : أنه يسير بغزاوته إلى كل مكان تطلع عليه الشمس ، كما قال تعالى في ذي القرنين { فاتّبع سبباً حتى إذا بلغ مغرب الشمس } إلى قوله : { لم نجعل لهم من دونها ستراً } \\[ الكهف : 85 90 \\] ، وقيل لأنه تتبعه ملوك مخاليف اليمن ، وتخضع له جميع الأقيال والأذواء من ملوك مخاليف اليمن وأذوائه ، فلذلك لُقِّبَ تُبّعاً لأنه تتبعه الملوك .وتُبّع المراد هُنا المسمّى أسعد والمُكَنَّى أبا كَرِب ، كان قد عظم سلطانه وغزا بلاد العرب ودخل مكة ويثرب وبلغ العراق . ويقال : إنه الذي بنى مدينة الحِيرة في العراق ، وكانت دولة تُبّع في سنة ألف قبل البعثة المحمدية ، وقيل كان في حدود السبعمائة قبل بعثة النبي صلى الله عليه وسلم وتعليق الإهلاك بقوم تُبّع دونه يقتضي أن تبّعاً نجا من هذا الإهلاك وأن الإهلاك سلط على قومه ، قالت عائشة : ألا ترى أن الله ذمّ قومه ولم يَذمه .والمروي عن النبي صلى الله عليه وسلم في مسند أحمد وغيره أنه قال : « لا تسبوا تُبعاً فإنه كان قد أسلم وفي رواية كان مؤمناً » وفسره بعض العلماء بأنه كان على دين إبراهيم عليه السلام وأنه اهتدى إلى ذلك بصحبة حبْرَين من أحبار اليهود لقيهما بيثرب حين غزاها وذلك يقتضي نجاته من الإهلاك . ولعل الله أهلك قومه بعد موته أو في مغيبه .وجملة { أهلكناهم } مستأنفة استئنافاً بيانياً لما أثاره الاستفهام التقريري من السؤال عن إبهامه ماذا أريد به . وجملة { إنهم كانوا مجرمين } تعليل لمضمون جملة { أهلكناهم } ، أيْ أهلكناهم عن بكرة أبيهم بسبب إجرامهم ، أي شركهم .\n\n",
      "translations": [
        {
          "translation": "Allah said (Are they better) are your people better, (or the folk of Tubba') or the people of Himyar, whose name was As'ad Ibn Malkikarb and his agnomen was Abu Karb, he was called Tubba' because he had a great number of followers (and those before them) before the people of Tubba'? (We destroyed them, for surely they were guilty) they were idolaters. Would your people not fear that We destroy them and punish them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n رد الله عليهم على أبلغ وجه وآكده بقوله مستفهما على سبيل التقريع والتوبيخ: { أَهُمْ } يعني: قريشاً { خَيْرٌ } مالاً وجاهاً\n وثروة وسيادة { أَمْ قَوْمُ تُبَّعٍ } اسم لمن ملك الحمير\n ككسرى لملوك فارس\n وقيصر لملوك الروم\n والمراد: أبو كريب سعيد بن منبل\n آمن بنبينا قبل بعثته\n فتنحى عن قومه\n معللين أنك قد تركت ديننا\n فأخذهم الله بجرمهم هذا\n وأهلكهم { وَٱلَّذِينَ مِن قَبْلِهِمْ } من الأمم الهالكة كعاد وثمود { أَهْلَكْنَاهُمْ } مع شدة قوتهم وبسطتهم وكثرة شوكتهم { إِنَّهُمْ كَانُواْ مُجْرِمِينَ } [الدخان: 37] بالجرائم العيظمة الموجبة للمقت والهلاك\n أمثال جرائمكم أيها المجرمون المسرفون\n\n\n{ وَ } بالجملة: { مَا خَلَقْنَا ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ وَمَا بَيْنَهُمَا } من الممتزجات { لَـٰعِبِينَ } [الدخان: 38] عابثين بلا طائل { مَا خَلَقْنَاهُمَآ } وأظهرناها على هذا النمط البديع والنظام العجيب المشتمل على أنواع التغيرات من الكائنات والفاسدات { إِلاَّ بِٱلْحَقِّ } ليستدلوا بها على وحدة ذاتنا\n وكمال علمنا وقدرتنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { أَهُم خيرٌ أم قومُ تُبَّع } ردّ لقولهم وتهديد لهم\n أي: أهم خير في القوة والمنعة\n اللتين يدفع بهما أساب الهلاك\n أم قوم تُبع الحميري؟ وكان سار بالجيوش حتى حيّر الحيرة\n وبنى سمرقند\n وقيل: هدمها\n وكان مؤمناً وقومه كافرين\n ولذلك ذمّهم الله تعالى دونه\n وكان يكتب في عنوان كتابه: بسم الله الذي ملك برّاً وبحراً ومضحاً وريحاً\n قال القشيري: كان تُبَّع ملك اليمن\n وكان قومه فيهم كثرة\n وكان مسلماً\n فأهلك اللّهُ قومَه على كثرة عددهم وكمال قوتهم\n هـ\n روي عنه عليه السلام أنه قال: لا تسبُّوا تُبعاً فإنه كان مؤمناً \" هـ وقيل: كان نبيّاً\n وفي حديث أبي هريرة عنه صلى الله عليه وسلم قال:\n \" لا أدري تُبعاً كان نبيّاً أو غير نبي \"\n \nوذكر السهيلي: أن الحديث يُؤذن بأنه واحد بعينه\n وهو - والله أعلم - أسعد أبو كرب\n الذي كسا الكعبة بعدما أراد غزوه\n وبعدما غزا المدينة\n وأراد خرابها\n ثم انصرف عنها\n لما أخبر أنها مهاجَر نبي اسمه \" أحمد \" وقال فيه شعراً\n وأودعه عند أهلها\n فكانوا يتوارثونه كابراً عن كابر\n إلى أن هاجر النبي صلى الله عليه وسلم فأدُّوه إليه\n ويقال: كان الكتاب والشعر عند أبي أيوب الأنصاري: حتى نزل عليه النبي صلى الله عليه وسلم فدفعه إليه\n وفي الكتاب الشعر\n وهو:\nوذكر الزجاج وابن أبي الدنيا: أنه حُفر قبرٌ بصنعاء في الإسلام\n فوجد فيه امرأتان\n وعند رؤوسهما لوح من فضة\n مكتوب فيه بالذهب اسمهما\n وأنهما بنتا تُبع\n تشهدان ألا إله إلا الله\n ولا تُشركان به شيئاً\n وعلى ذلك مات الصالحون قبلهما\n هـ\n ويقال لملوك اليمن: التبابعة لأنهم يُتبعون\n ويقال لهم: الأقيال لأنهم يتقيلون\n هـ\n { والذين مِن قبلهم } عطف على \" قوم تُبع \" \n والمراد بهم عاد وثمود\n وأضرابهم من كل جبار عنيد\n أُولي بأس شديد\n { أهلكناهم } بأنواع من العذاب { إِنهم كانوا مجرمين } تعليل لإهلاكهم\n ليعلم أن أولئك حيث أهلكوا بسبب إجرامهم مع ما كانوا عليه من غاية القوة والشدة\n فكان مهلكَ هؤلاء - وهم شركاؤهم في الإجرام\n مع كونهم أضعف منهم في الشدة والقوة - أولى\n قال الطيبي: لما أنكر المشركون الحشر\n بقولهم: { إن هي إلا موتتنا الأولى } وبَّخهم بقوله: { أهم خير أم قوم تبع } إيذاناً بأن هذا الإنكار ليس عن حجة قاطعة ودليل ظاهر\n بل عن مجرد حب العاجلة\n والتمتُّع بملاذ الدنيا\n والاغترار بالمال والمآل والقوة والمنعة\n أي: كما فعل بمَن سلك قبلَهم من الفراعنة والتبابعة حتى هلكوا\n كذلك يفعل بهؤلاء إن لم يرتدعوا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:13",
      "similarity": 0.4554141488076489
    },
    {
      "verse": "15:58",
      "similarity": 0.420514578248226
    },
    {
      "verse": "51:32",
      "similarity": 0.420514578248226
    },
    {
      "verse": "21:6",
      "similarity": 0.42022290145739166
    },
    {
      "verse": "23:48",
      "similarity": 0.4116811571632726
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/044037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/044037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/44:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}