{
  "chapter": "الدخان",
  "text": "ولقد اخترنهم على علم على العلمين",
  "translations": [
    {
      "translation": "And We exalted them over the other people knowingly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We knowingly exalted them (i.e., the Children of Israel) above other peoples of the world\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave preference to the Israelites over the other people with Our knowledge\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We knowingly chose them, among all others of their time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We chose them above the nations (Al-`Alamin) with knowledge,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We chose them, having knowledge, above the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We chose them, out of a knowledge, above all beings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We chose them, purposely, above (all) creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We knowingly chose them above all other people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We elected them with knowledge above the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We chose them knowingly above all the nations,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We chose them aforetime above the nations, knowingly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We chose them (the Children of Israel) above the 'Alamin (mankind, and jinns) [during the time of Musa (Moses)] with knowledge,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We chose them, out of a knowledge above the nations (of their time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We chose them knowingly over all other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly chose them by knowledge over [all] the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:32] And verily We chose them, that is, the Children of Israel, with a knowledge, that We had of their state, over [all] the worlds, that is, the worlds of their time, [those of] the rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We chose them) i.e. the Children of Israel, (purposely) in accordance with Our knowledge, (above (all) creatures) of their time, by bestowing upon them quails and honey, the Scripture and Messenger, and by saving them from Pharaoh and his folk and from drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ولقد اخترناهم } أي: بني إسرائيل { على عِلْمٍ } أي: عالِمين بأنهم أحقاء بالاختيار، أو عالِمين بأنهم يزيغون في بعض الأوقات، ويكثر منهم الفرطات، فلم يؤثر ذلك في سوابق علمنا، ليعلم أن الجنايات لا تؤثر في الرعايات، { على العالَمين } أي: عالمي زمانهم، لما كثر فيهم من الأنبياء، { وآتيناهم من الآيات } كفلق البحر، وتظليل الغمام، وإنزال المن والسلوى، وغيرها من عظائم الآيات، { ما فيه بلاء مبين } نعمة ظاهرة، أو: اختبار ظاهر، لينظر كيف يعملون، وقيل: البلاء المبين هو المطالبة بالشكر عند الرضا، والصبر عند الكدر والعناء\n الإشارة: كم ترك أهلُ الغفلة والاغترار، من جنات وعيون، وزروع ومقام كريم، من قصور وديار، فارقوها، أخصب ما كانوا فيها، وأُزعجوا عنها أحوج ما كانوا إليها، استبدلوا سعة القصور بضيق اللحود والقبور، ومحاسن الملابس والتيجان بعصائب الخِّرق والأكفان، فيا مَن ركن إلى الدنيا، انظر كيف تفعل بأهلها، فرحم الله عبداً أخذ من الدنيا الكفاف، وصاحب فيها العفاف، وتزوّد للرحيل، وتأهّب للمسير\n ذكر الطرطوسي في كتابه \" سراج الملوك \": قال أبو عبد الله بن حمدون: كنتُ مع المتوكل، لما خرج إلى دمشق، فركب يوماً إلى رصافة \" هشام بن عبد الملك \" فنظر إلى قصورها خاوية، ثم خرج فنظر إلى دير هناك قديم، حسن البناء، بين مزارع وأشجار، فدخله، فبينما هو يطوف به، إذ بَصُر برقعة قد التصقت بصدره، فأمر بقلعها، فإذا فيها مكتوب هذه الأبيات\n\n\nإلى أن قال:\n\nفلما قرأها المتوكل ارتاع، ثم دعا صاحب الدير، فسأله: مَن كتبها؟ فقال: لا علم لي، وانصرف هـ\n ومن هذا القبيل ما وجد مكتوباً على باب \" كافور الإخشيدي \" بمصر:\n\n\n\nومن هذا أيضاً ما وُجد على قَصر \" ذي يزن \" مكتوباً:\n\nوحاصل الدنيا ما قال الشاعر:\n\nهذه فكرة اعتبار، وأما فكرة استبصار، فما ثَمَّ إلا تصرفات الحق، ومظاهر أسرار ذاته، وأنوار صفاته، ظهرت في عالم الحكمة بالأشكال والرسوم، وأما في عالم القدرة فما ثَمَّ إلا الحي القيوم\n\n\nوقوله تعالى: { فما بكت عليهم السماء والأرض } يُفهم منه: أن من عظم قدره تبكي على فقده السموات والأرض ومَن فيهن، في عالم الحس، الذي هو عالم الأشباح وتفرح به أهل السموات السبع في عالم الأرواح لتخلُّصه إليها، فيستبشر بقدومه كل مَن هنالك، وينظر اللّهُ إلى خلقه بعين الرحمة، فيرتحم ببركة قدومه الوجود بأسره\n والله ذو الفضل العظيم\n وقوله تعالى: { ولقد اخترناهم على علم } قال القشيري: ويُقال: على علم بمحبة قلوبهم لنا مع كثرة ذنوبهم فينا، ويقال: على علم بما نُودع عندهم من أسرارنا، ونكاشفهم به من حقائق حقنا\n وقال الورتجبي: { ولقد اخترناهم على علم } أي: على علم بصفاتنا، ومعرفة بذاتنا، ومشاهدة على أسرارنا، وبيان على معرفة العبودية والربوبية، ودقائق الخطرات والقهريات واللطيفات في زمان المراقبات\n هـ\n وقا الواسطي: اخترناهم على علم منا بجنايتهم، وما يقترفون من أنواع المخالفات، فلم يؤثر ذلك في سوابق علمنا لهم، ليُعلم أن الجنايات لا تؤثر في الرعايات\n وقال الجرّار: علما ما أودعنا فيهم من خصائص سرنا، فاخترناهم بعلمنا على العالمين\n هـ\n قلت: والمقصود بالذات: بيان أن اختياره - تعالى - مرتّب على سابق علمه الأزلي، وعلمه - تعالى - لا تُغيره الحوادث، وقد انقطعت دولة بني إسرائيل، فما بقي الكلام إلا مع الملة المحمدية\n ثم ردّ على مَن أنكر البعث، بعد أن ذكر بعض أشراطه، كالدخان وغيره، فقال: { إِنَّ هَـٰؤُلاَءِ لَيَقُولُونَ }\n\n",
      "translations": []
    }
  ]
}