{
  "chapter": "الدخان",
  "text": "فانما يسرنه بلسانك لعلهم يتذكرون",
  "translations": [
    {
      "translation": "We have made it easy in your own tongue so that hopefully they will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore We have made this (Qur'an) easy in your tongue. They may haply take a warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), We have made this Book easy in your tongue so that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the Quran easy for you to recite so that perhaps they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made this Qur’an easy in your language, for them to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, We have made this easy in your tongue, in order that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have We made it easy in your tongue that they may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have made it easy by thy tongue, that haply they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made (this Scripture) easy in thy language only that they may heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made this Quran easy to understand, in your own language, so that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made it easy in thy language; they might haply be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have made it simple in your language, so that they may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have made this (Qur'an) easy, in thy tongue, in order that they may give heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, We have made this (Quran) easy in your tongue, in order that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have now made it easy on your tongue, in order that they remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made it easy in your language, so that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We have eased the Qur'an in your tongue that they might be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:58] For We have made it easy, We have facilitated the Qur’ān, in your tongue, in your language, so that the Arabs may understand it from you, that perhaps they may remember, [that perhaps] they may be admonished and become believers — but they do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have made (this Scripture) easy in your language) We have made easy for you the recitation of the Qur'an (only that they may heed) that they may take admonition by means of the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِنَّمَا يَسَّرْنَاهُ } وسهلناه أي: المذكور في القرآن من المعارف والحقائق والرموز والإشارات التي خلت عنها سائر الكتب { بِلِسَانِكَ } وبناء على لغتكت { لَعَلَّهُمْ } أي: الأعراب { يَتَذَكَّرُونَ } [الدخان: 58] أي: يفهمونه ويتعظون بما فيه، كي يتفطنوا إلى كنوز رموزه وبعدما لم يؤمنوا بك ولم يقصدوا كتابك، فكيف التذكر والاتعاظ بما فيه، وبالجملة: { فَٱرْتَقِبْ } وانتظر يا أكمل الرسل ما ينزل عليهم من العذاب { إِنَّهُمْ مُّرْتَقِبُونَ } [الدخان: 59] منتظرون أيضاً بما ينزل عليك من القهر والغضب على زعمهم الفاسد\n\n\n\n\nجعلنا الله من المتذكرين الفائزين من عنده سبحانه بالفوز العظيم بمنه وجوده\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها السالك المراقب لنفحات الحق ونسمات لطفه الموهبة من عالم قدسه في عموم أحوالك: أن تلازم بالتقوى عن محارم الله، والاجتناب عن منهياته المنافية لآداب العبودية، وتداوم على التخلق بالأخلاق المرضية الإلهية، والاشتغال بالطاعات المقربة نحوه، والإعراض عن الملاهي الملهية عن التوجه إليه؛ لتكون من جملة المتقين الفائزين من عنده سبحانه بالفوز العظيم والفضل الكريم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِنما يسَّرناه } أي: الكتاب، وقد جرى ذكره في أول السورة، أي: سهَّلنا قراءته { بلسانك } بلغتك { لعلهم يتذكرون } أي: كي يفهموه ويتعظوا به، ويعملوا بموجبه، فلم يفعلوا، { فارتقبْ } فانظر ما يحلّ بهم، { إِنهم مرتَقِبون }  ما يحلُّ بك\n\n\nقال القشيري: فارتقب العواقب ترى العجائب، إنهم مرتَقِبون، ولكن لا يرون إلا ما يكرهون\n هـ\n الإشارة: إن المتقين شهود ما سوانا في مقام العرفان، وهو مقام المقربين، وهو محل الأمن والأمان، في جنات المعارف، وعيون العلوم والحِكَم، يلبسون من أسرار الحقيقة وأنوار الشريعة، ما تبتهج به بواطنهم وظواهرهم، متقابلين في المقامات، يجمعهم الفناء والبقاء، ويتفاوتون في اتساع المقامات والأسرار، تفاوت أهل غرف الجنان، كذلك، أي: الأمر فوق ما تصف، وزوجانهم بعرائس المعرفة، لا يذوقون في جنات المعارف - إذ دخلوها - الموت أبداً إلا الموتة الأولى، وهي موت نفوسهم، فَحييتْ أرواحهم حياة أبدية، وأما الموت الحسي فإنما هو انتقال من عالم إلى عالم، ومن مقام إلى مقام، ووقاهم ربُّهم عذابَ الجحيم، فضلاً منه وإحساناً، خلقَ فيهم المجاهدة، ومَنَّ عليهم بالمشاهدة\n وقال الورتجبي بعد كلام: إذ أحضرهم - تعالى - في ساحة كبريائه، ويتجلّى لهم بالبديهة من غير الجبّارية القهّارية يكونون في محل الفناء، وفي فناء الفناء، وغلبات سطوات ألوهيته، فإذا صاروا فانين، ألبسهم الله لباس بقائه، فيبقون ببقائه أبد الآبدين، فإذاً الاستثناء وقع على التحقيق، لا على التأويل، فيا رُبّ موتٍ هناك، ويا رُبّ حياة هناك لأن الحدَث لا يستقيم عند بروز حقائق بواطن القِدم، ألا ترى إلى إشارة النبي صلى الله عليه وسلم كيف قال: \" حجابه النور، لو كشفه لأحرقت سُبحات وجهه ما انتهى إليه بصره من خلقه \" أي: فيتلاشى الخلق ويبقى الحق\n قيل للجنيد: أهل الجنة باقون ببقاء الحق؟ فقال: لا، ولكنهم مُبْقَوْن ببقاء الحق، والباقي على الحقيقة من لم يزل، ولا يزال بقاياً\nهـ\n والحاصل: أنه لا عدم بعد وجودهم بالله، ولا يكون إلا بعد الفناء عن أوصاف الخليقة، ووجود البشرية، بالاندراج في وجود الحق، ثم الحياة بحياته، والبقاء ببقائه أبداً، قاله في الحاشية الفاسية\n والفرق بين الباقي والمبقى في كلام الجنيد: أن الباقي يدلّ على ثبوت بقائه مستقلاً، بخلاف المبقَى، لا وجود لبقائه، بل مبقى ببقاء غيره\n وقال في قطب العارفين، لمَّا تكلم على التقوى: التقوى مطرد في وجوه كثيرة، تقوى الشرك، ثم تقوى المعصية، ثم تقوى فضل المباح، ثم تقوي كل ما يسترق القلوب عن الله تعالى، وإلى هذا الصنف الإشارة بسر قوله تعالى: { إن المتقين في مقام أمين في جنات وعيون\n\n\n } الآية\n هـ\n وعنه صلى الله عليه وسلم:\n\n \" مَن قرأ سورة الدخان في ليلة أصبح يستغفر له سبعون ألف ملك \" \n\nذكره في الجامع، وفي فضلها أحاديث، تركتها\n\n",
      "translations": []
    }
  ]
}