{
  "chapter": "الدخان",
  "text": "لا اله الا هو يحى ويميت ربكم ورب ءابائكم الاولين",
  "translations": [
    {
      "translation": "There is no god but Him - He gives life and causes to die - your Lord and the Lord of your forefathers, the previous peoples.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god other than He, who gives you life and death, your Lord and the Lord of your fathers of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He: He gives life and causes death. He is your Lord and the Lord of your forefathers of yore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is only One Lord. It is He who gives life and causes things to die. He is your Lord and the Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no worship except for Him – He gives life and causes death; your Lord and the Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "La ilaha illa Huwa. He gives life and causes death -- your Lord and the Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He; He gives life and causes death, your Lord and the Lord of your fathers of yore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He; He gives life and makes to die; your Lord and the Lord of your fathers, the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no Allah save Him. He quickeneth and giveth death; your Lord and Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is no deity save Him: It is He who gives both life and death -- He is your Lord, and the Lord of your forefathers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He. He quickeneth and causeth to die: your Lord and Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god except Him: He gives life and brings death, your Lord and the Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He: It is He Who gives life and gives death,- The Lord and Cherisher to you and your earliest ancestors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "La ilaha illa Huwa (none has the right to be worshipped but He). It is He Who gives life and causes death, your Lord and the Lord of your fore-fathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god except He. He revives and causes to die. (He is) your Lord and the Lord of your fathers, the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He. He gives life and causes death—your Lord and Lord of your ancestors of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no deity except Him; He gives life and causes death. [He is] your Lord and the Lord of your first forefathers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[44:8] There is no god except Him. He gives life and brings death. Your Lord and the Lord of your forefathers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is no God) there is no Creator (save Him) Who created the heavens and the earth. (He quickeneth) for the Resurrection (and giveth death) in the life of the world; (your Lord and Lord of your forefathers) your Creator and the Creator of you forefathers before you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { لاَ إِلَـٰهَ } ولا موجود في الوجود { إِلاَّ هُوَ } بصرافة وحدته وتنزهه عن وصمة الشركة مطلقاً هو { يُحْيِـي وَيُمِيتُ } أي: يظهر ويوجد ما يظهر، ويعدم ما يعدم، بمد ظله إليه وقبضه عنه؛ إذ هو سبحانه { رَبُّكُمْ وَرَبُّ آبَآئِكُمُ ٱلأَوَّلِينَ } [الدخان: 8] لا مربي لكم ولهم سواه، لو تأمل عموم العباد في دلائل توحيده سبحانه، ونظروا في آيات ألوهيته وربوبيته، لعرفوا يقينا وحدة ذاته { بَلْ هُمْ } أي: أكثرهم { فِي شَكٍّ } أي: غفلة وتردد { يَلْعَبُونَ } [الدخان: 9] ويترددون في أودية الظنون والجهالات حسب آرائهم الفاسدة وأهويتهم الباطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا إِله إِلا هو } مِن قصر إفرادٍ لا قصر قلبٍ، لأن المشركين كانوا يُثبتون الألوهية لله تعالى ويشركون معه غيره، فردّ الله عليهم بكونه لا يستحق العبادة غيره، { يُحيي ويُميت } ثم يبعث للجزاء، { ربُّكم وربُّ آبائكم الأولين } أي: هو رب الجميع، ثم ردّ أن يكونوا موقنين بقوله: { بل هم في شك يلعبون } وإقرارهم غير صادر عن علم وإيقان، بل قول مخلوط بهزؤ ولعب\n والله تعالى أعلم\n الإشارة: { حم } ، قال الورتجبي: الحاء: الوحي الخاص إلى محمد، والميم: محمد صلى الله عليه وسلم، وذلك الوحي الخاص بلا واسطة خبرٌ عن سر في سر، لا يطلع على ذلك - الذي بين المحب والمحبوب - أحد من خلق الله، ألا ترى كيف قال سبحانه:\n\n[النجم: 10]؟ وذلك إشارة إلى وحي السر في السر، وجملتها قسم، أي بمعنى الوحي السري والمحبوب، والقرآن الظاهر الذي ينبئ عن الأسرار، { إنا أنزلناه } هـ\n قال القشيري: الحاء تشير إلى حقِّه، والميم إلى محبته، ومعناه: بحقي ومحبتي لعبادي، وكتابي العزيز إليهم، ألا أُعَذِّب أهلَ محبتي بفرقتي\n هـ\n والليلة المباركة عند القوم، هي ليلة الوصال والاتصال، حين يُمْتَحى وجودُهم، ويتحقق فناؤهم، وكل وقت يجدون فيه قلوبهم، ويفقدون وجودهم فهو مبارك، وهو ليلة القدر عندهم، فإذا دام اتصالهم، كانت أوقاتهم كلها ليلة القدر، وكلها مباركة\n قال الورتجبي: قوله تعالى: { في ليلة مباركة } كانت مباركة لتجلِّي الحق فيها بالأقضية، والرحمة غالبة فيها، ومن جملتها: إنزال القرآن فيها فإنه افتتاح وصلة لأهل القرية\n\n\nهـ\n قال القشيري: وسمّاها ليلة مباركة لأنها ليلة افتتاح الوصلة، وأشدُّ الليالي بركةً، ليلةٌ يكون العبد فيها حاضراً بقلبه، مشاهداً لربه، يتنسّم بأنوار الوصلة، ويجد فيها نسيم القربة، وأحوال هذه الطائفة في لياليهم مختلفة، كما قالوا، وأنشدوا:\n\nهـ\n أي: لَيْلِي كما شاء المحبوب، فإن لم يزرني طال ليلِي، وإن زارني قَصُر\n والحاصل: أن أوقات الجمال والبسط كلها قصيرة، وأوقات الجلال كلها طويلة، وقوله تعالى: { فيها يُفرق كل أمر حكيم } أي: في ليلة الوصال تفرق وتبرز الحِكَم والمواهب القدسية، بلا واسطة، بل أمراً من عندنا، والغالب أن هذه الحالة لا تكون إلا عند الحيرة والشدة من الفاقة أو غيرها، وكان بعض العارفين من أشياخنا يستعدُّون فيها لكتب المواهب، ويسمونها ليلة القدر\n وقوله تعالى: { إِنّا كنا مرسلين رحمةً من ربك } هو الرسول صلى الله عليه وسلم قال:\n\n \" أنا الرحمة المهداة \" \n\n، فرحمة مفعول به، { إِنه هو السميع العليم } قال القشيري: السميع لأنين المشتاقين، العليم بحنين المحبين\n هـ\n { لا إِله إلا هو } أي: لا يستحق أن يَتَأله ويُعشق إلا هو، { يُحيي ويميت } يُحيي قلوب قوم بمعرفته ومحبته، ويُميت قلوباً بالجهل والبُعد، يفعل ما يشاء، ويحكم ما يريد\n ثم وصف أهل الجهل والبُعد بقوله: { بل هم في شك يلعبون } وأما أهل المعرفة والقُرب فهم في حضرة محبوبهم يتنعّمون، ومن روح وصاله يتنسّمون\n قال القشيري: واللعب يجري على غير ترتيب، تشبيهاً باللعاب الذي يسيل لا على نظام مخصوص، ووصف الكافر باللعب لتردُّده وشكِّه وتحيُّره في عقيدته\n هـ\n ثم هدّدهم بقوله: { فَٱرْتَقِبْ يَوْمَ تَأْتِي ٱلسَّمَآءُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:126",
      "similarity": 0.7229100071764784
    },
    {
      "verse": "26:26",
      "similarity": 0.7014313208221886
    },
    {
      "verse": "37:17",
      "similarity": 0.6578173432602913
    },
    {
      "verse": "56:48",
      "similarity": 0.6578173432602913
    },
    {
      "verse": "37:59",
      "similarity": 0.612850244759878
    }
  ]
}