{
  "chapter": "الجاثية",
  "text": "ثم جعلنك على شريعة من الامر فاتبعها ولا تتبع اهواء الذين لا يعلمون",
  "translations": [
    {
      "translation": "Then We placed you on the right road of Our Command, so follow it. Do not follow the whims and desires of those who do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have put you on the right way in the matter (of divine law). So follow it, and do not follow the wishes of those who are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then We set you, (O Prophet), on a clear high road in religious matters. So follow that and do not follow the desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have established for you a code of conduct and a religion. Follow it and do not follow the desires of the ignorant people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then placed you (O dear prophet Mohammed – peace and blessings be upon him) upon the clear path of the command, therefore continue following it and do not listen to the desires of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We have put you on a (legal) way of commandment. So follow you that, and follow not the desires of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We have made you follow a course in the affair, therefore follow it, and do not follow the low desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set thee upon an open way of the Command; therefore follow it, and follow not the caprices of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now have We set thee (O Muhammad) on a clear road of (Our) commandment; so follow it, and follow not the whims of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set you on a clear path [of religion]: so follow it, and do not yield to the desires of those who have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thereafter We have placed thee upon the law of the religion; so follow it thou, and follow not the vain desires of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set you upon a clear course of the Law; so follow it, and do not follow the desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We put thee on the (right) Way of Religion: so follow thou that (Way), and follow not the desires of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We have put you (O Muhammad SAW) on a plain way of (Our) commandment [like the one which We commanded Our Messengers before you (i.e. legal ways and laws of the Islamic Monotheism)]. So follow you that (Islamic Monotheism and its laws), and follow not the desires of those who know not. [Tafsir At-Tabari Vol. 25, Page 146].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now, We have set you on the jurisprudence of the Command, therefore follow it and do not follow the desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set you upon a pathway of faith, so follow it, and do not follow the inclinations of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We put you, [O Muhammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:18] Then We set you, O Muhammad (s), upon a [clear] course, [a clear] way, of the commandment, the commandment of religion; so follow it, and do not follow the desires of those who do not know, in worshipping other than God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And now have We set thee) We have chosen you ((0 Muhammad) on a clear road of (Our) commandment) on a clear wont and way in relation to My command and obedience; (so follow it) hold fast to them and act upon them; it is also said that this means: We have honoured you with Islam and have commanded you to call mankind to it, (and follow not the whims of those) the religion of those (who know not) Allah's divine Oneness, i.e. the Jews, Christians and idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِّنَ ٱلأَمْرِ } معناه على طَريقةٍ وسُنةٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } اعلم يا أكمل الرسل إنا من مقام فضلنا وجودنا { جَعَلْنَاكَ } تابعاً مقتدياً مقتفياً { عَلَىٰ شَرِيعَةٍ } وطريقة منبئة موضحة { مِّنَ ٱلأَمْرِ } الذي أنت تظهر عليه، وأتيت لتنبيهه، ألا وهي الحقيقة التي هي عبارة عن الوحدة الذاتية الإلهية { فَٱتَّبِعْهَا } أي: الشريعة الموصلة إلى الحقيقة بالعزيمة الخالصة { وَلاَ تَتَّبِعْ أَهْوَآءَ ٱلَّذِينَ لاَ يَعْلَمُونَ } [الجاثية: 18] فكيف ينكشفون بسرائرها وحكمها، ولا تقبل منهم أباطيلهم الناشئة وآراءهم الفاسدة وأحلامهم السخيفة الكاسدة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}