{
  "chapter": "الجاثية",
  "text": "هذا هدى والذين كفروا۟ بـايت ربهم لهم عذاب من رجز اليم",
  "translations": [
    {
      "translation": "This is guidance. And those who reject the Signs of their Lord will have a punishment of agonising pain.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance. Those who deny the revelations of their Lord will suffer a dreadful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Qur'an) is the true guidance. Those who deny the Signs of their Lord shall suffer the torment of a woeful scourge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is a guidance. Those who reject the revelations of their Lord will suffer the most painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the (true) guidance; and for those who disbelieve in the verses of their Lord is the severest of painful punishments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance. And those who disbelieve in the Ayat of their Lord, for them there is a painful torment of Rijz.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance; and (as for) those who disbelieve in the communications of their Lord, they shall have a painful punishment on account of uncleanness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance; and those who disbelieve in the signs of their Lord, there awaits them a painful chastisement of wrath.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance. And those who disbelieve the revelations of their Lord, for them there is a painful doom of wrath.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Our guidance; those who reject their Lord's revelations shall suffer a woeful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book is guidance, and those who disbelieve in the revelations of their Lord, theirs shall be torment of calamity, afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is [true] guidance, and there is a painful punishment due to defilement for those who defy the signs of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is (true) Guidance and for those who reject the Signs of their Lord, is a grievous Penalty of abomination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is a guidance. And those who disbelieve in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord, for them there is a painful torment of Rijz (a severe kind of punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance; for those who disbelieve in the verses of their Lord the anger of the painful punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is guidance. Those who blaspheme their Lord’s revelations will have a punishment of agonizing pain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This [Qur'an] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:11] This, that is, the Qur’ān, is a guidance, from error; and those who disbelieve in the signs of their Lord, for them there will be a torture, a lot, of a painful, an excruciating, chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) i.e. this Qur'an (is guidance) from error. (And those who disbelieve the revelations of their Lord) those who disbelieve in Muhammad (pbuh) and the Qur'an, i.e. al-Nadr Ibn al-Harith and his host, (for them there is a painful doom of wrath) for them there is a painful punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبالجملة: { هَـٰذَا } الذي في كتابك يا أكمل الرسل { هُدًى } يبين طريق الهداية والرشاد لأهل العناية والتوفيق { وَ } المسرفون { ٱلَّذِينَ كَفَرُواْ بِآيَٰتِ رَبِّهِمْ } المنزلة في كتابك هذا\n والتي نزلت في الكتب السالفة { لَهُمْ عَذَابٌ } نازل ناشئ { مِّن رِّجْزٍ } غضب عظيم من الله المقتدر على أنواع الانتقام { أَلِيمٌ } [الجاثية: 11] مؤلم أشد الإيلام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هذا } أي: القرآن { هُدىً } في غاية الكمال من الهداية، كأنه نفس الهدى، { والذين كفروا بآيات ربهم } أي: القرآن، وإنما وضع موضع ضميره الآيات لزيادة تشنيع كفرهم وتفظيع حالهم، { لهم عذابٌ من رِجْزٍ } من أشد العذاب { أليم } مؤلم، بالرفع صفة \" عذاب \" ، وبالجر صفة \" رِجز \" ، وتنوين عذاب في المواضع الثلاثة للتخيم\n\n\nالإشارة: مَن لم يضبط لسانه وجوارحه، وتصاممت آذانُ قلبه عن تدبُّر القرآن، فالويل حاصل له، ويُبَشَّر بالخيبة والخسران من مراتب أهل العرفان، ومن ضبط أمور ظاهره بالتقوى، وفتحت آذان قلبه لسماع كلام المولى، فقد فَاز بعز الدارين\n قال القشيري: فمَن استمع بسمع الفهم، واستبصر بنور التوحيد، فاز بذُخْر الدارين، وتصدَّى لعز المنزلتين، ومَن تصامم بحكم الغفلة، وقع في وهدة الجهل، ووُسِم بكى الهَجْر\n هـ\n قوله تعالى: { إذا علم من آياتنا شيئاً اتخذوها هزواً } قال القشيري: وقد يُكاشَفُ العبدُ من مواطن القلب بتعريفاتٍ لا يداخله فيها ريبٌ، ولا يتخلله فيها شكٌّ فيما هو فيه من حاله، فإذا استهان بها وقع في ذُلِّ الحجْبة، وحجاب الفرقة وهوانها\n هـ\n فإذا صفا القلب صار مرسى لتجلي الواردات الإلهية، وهي آية من آياته، فإذا تجلّى فيه شيء بأمر أو نهي فاستهان به وخالفه أدّبه الحق على ذلك، إما في ظاهره، وهو أخف، أو في باطنه بالحجبة أو الفرقة، ولقد سمعت شيخ شيخنا، مولاي العربي الدرقاوي رضي الله عنه يقول: لي ثلاثون سنة ما خالفت قلبي في شيء إلا أدّبني الحق تعالى عليه\n هـ\n أي: في ظاهره، وذلك لغاية صفائه\n قوله تعالى: { من ورائهم جهنم\n\n } الآية، لا عذاب أشد من الحجب بعد الإظهار، والفرقة بعد الوصال، وأنشدوا:\n\nانظر القشيري\n ولمَّا ذكر ما منَّ به عليهم من النِعم الباطنة، وهي دلائل التوحيد، ذكر ما منَّ به عليهم من النعم الظاهرة، فقال: { ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلْبَحْرَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:5",
      "similarity": 0.7646403618146567
    },
    {
      "verse": "7:162",
      "similarity": 0.7559550559957738
    },
    {
      "verse": "34:5",
      "similarity": 0.7543871061385888
    },
    {
      "verse": "29:34",
      "similarity": 0.7376862668355342
    },
    {
      "verse": "2:59",
      "similarity": 0.708453262569555
    }
  ]
}