{
  "chapter": "الجاثية",
  "text": "الله الذى سخر لكم البحر لتجرى الفلك فيه بامره ولتبتغوا۟ من فضله ولعلكم تشكرون",
  "translations": [
    {
      "translation": "It is Allah who has made the sea subservient to you so that the ships sail on it at His command, enabling you to seek His bounty, so that hopefully you will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who subjugated the ocean for you so that ships may ply through it by His command, and you may seek His bounty, and may haply be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who has subjected the sea to you so that ships may sail upon it at His bidding and you may seek of His Bounty and give thanks to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the sea subservient to you so that ships sail on by His command and you seek His favors. Perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has subjected the sea for you so that ships may sail upon it by His command, and for you to seek His munificence, and so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, it is He Who has subjected to you the sea, that ships may sail through it by His command, and that you may seek of His bounty, and that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who made subservient to you the sea that the ships may run therein by His command, and that you may seek of His grace, and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He who has subjected to you the sea, that the ships may run on it at His commandment, and that you may seek His bounty; haply so you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath made the sea of service unto you that the ships may run thereon by His command, and that ye may seek of His bounty, and that haply ye may be thankful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has subjected the sea to you so that you may sail thereon by His command, and so that you may seek His bounty, and so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath subjected the sea for your sake, that the ships may run thereon by His command and that ye may seek of His grace, and that haply ye may return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who disposed the sea for you[r benefit] so that the ships may sail in it by His command, that you may seek of His bounty and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has subjected the sea to you, that ships may sail through it by His command, that ye may seek of his Bounty, and that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is He Who has subjected to you the sea, that ships may sail through it by His Command, and that you may seek of His Bounty, and that you may be thankful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has subjected to you the sea so that ships run upon it at His command, and so that you may seek His bounty and be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who placed the sea at your service, so that ships may run through it by His command, and that you may seek of His bounty, and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who subjected to you the sea so that ships may sail upon it by His command and that you may seek of His bounty; and perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:12] God it is Who disposed for you the sea so that the ships may sail upon it by His command, by His permission, and that you may seek, that you may request, by way of trade, of His bounty, and that perhaps you may give thanks.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n.اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ (12)استئناف ابتدائي للانتقال من التذكير بما خلق الله من العوالم وتصاريف أحوَالِها من حيث إنها دلالات على الوحدانية ، إلى التذكير بما سخر الله للناس من المخلوقات وتصاريفها من حيثُ كانت منافع للناس تقتضي أن يشكروا مقدِّرها فجحدوا بها إذ توجهوا بالعبادة إلى غير المنعم عليهم ، ولذلك عُلق بفعليْ { سخر } في الموضعين مجرور بلام العلة بقوله : { لكم } ؛ على أن هذه التصاريف آيات أيضاً مثلُ اختلاف الليل والنهار ، وما أنزل الله من السماء من ماء ، وتصريف الرياح ، ولكن لُوحظ هنا ما فيها من النعم كما لوحظ هنالك ما فيها من الدلالة ، والفَطِنُ يَستخلص من المقامين كلا الأمرين على ما يشبه الاحتباك . ومناسبة هذا الانتقال واضحة .واسم الجلالة مسند إليه والموصول مسند ، وتعريف الجزأين مفيد الحصر وهو قَصر قلب بتنزيل المشركين منزلة من يحسب أن تسخير البحر وتسخير ما في السماوات والأرض إنعام من شركائهم كقوله تعالى : { هل من شركائكم من يفعل من ذلكم من شيء } \\[ الروم : 40 \\] ، فكان هذا القصر إبطالا لهذا الزعم الذي اقتضاه هذا التنزيل .وقوله : { لتجري الفلك فيه } بَدل اشتمال من { لكم } لأن في قوله : { لكم } إجمالاً أريد تفصيله . فتعريف { الفلك } تعريف الجنس ، وليس جري الفلك في البحر بنعمة على الناس إلا باعتبار أنهما يجرونهما للسفر في البحر فلا حاجة إلى جعل الألف واللام عوضاً عن المضاف إليه من باب { فإن الجنة هي المأوى } \\[ النازعات : 41 \\] .وعطف عليه { ولتبتغوا من فضله } باعتبار ما فيه من عموم الاشتمال ، فحصل من مجموع ذلك أن تسخير البحر لجري الفلك فيه للسفر لقضاء مختلف الحاجات حتى التنزه وزيارة الأهل .وعطف { ولعلكم تشكرون } على قوله : { لتجري الفلك فيه } لا باعتبار ما اشتمل عليه إجمالاً ، بل باعتبار لفظه في التعليق بفعله . وهذا مناط سَوق هذا الكلام ، أي لعلكم تشكرون فكفرتم ، وتقدم نظير مفردات هذه الآية غير مرة ما أغنى عن إعادته .\n\n",
      "translations": [
        {
          "translation": "(Allah it is Who hath made the sea of service unto you that the ships may run thereon by His command) by His leave, (and that ye may seek of His bounty) of His provision, (and that haply ye may be thankful) and that you may give thanks for His blessings;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تكفرون أيها الجاحدون المسرفون بآيات المنعم المفضل الكريم مع أنه: { ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلْبَحْرَ } وسهل عليكم العبور عنه بأن جعله أملس مستوي السطح\n ساكناً على هيئته { لِتَجْرِيَ ٱلْفُلْكُ فِيهِ بِأَمْرِهِ } أي: بمقتضى تسخيره وحكمه { وَ } أنتم تركبون عليها { لِتَبْتَغُواْ } وتطلبوا { مِن فَضْلِهِ } بالتجارة والاصطياد والغوص\n وغير ذلك من الأغراض { وَ } إنما سخر وسهل { لَعَلَّكُمْ تَشْكُرُونَ } [الجاثية: 12] نعمه\n وتواظبون على أداء حقوق كرمه\n\n\n{ وَ } بالجملة: { سَخَّرَ لَكُمْ } وهيأ لتربيتكم وتدبير معاشكم مظاهر { مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلأَرْضِ جَمِيعاً } إذ أنتم زبدة الكائنات\n وخلاصة الموجودات كل ذلك لكم منتشئة منه سبحانه\n مستندة إليه أولاً وبالذات\n فعليكم ألا تسندوها إلى الوسائل والأسباب العادية { مِّنْهُ إِنَّ فِي ذَلِكَ لأيَٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ } [الجاثية: 13] في آلاء الله\n وسوابغ نعمائه\n وكيفية ظهور العالم منه سبحانه وصدروه عنه\n وارتباطه له\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { اللّهُ الذي سخَّر لكم البحر } أي: ذلّله\n بأن جعله أملس السطح\n يطفو عليه ما فوقه\n ولا يمنع الغوص فيه\n لمَيَعَانه\n { لتجري الفلكُ فيه بأمره } بإذنه\n وأنتم راكبوها\n { ولتبتغوا من فضله } بالتجارة\n والغوص لابتغاء الحلية\n كاللؤلؤ والمرجان\n وكالصيد وغيرها\n { ولعلكم تشكرون } ولكي تشكروا النعم المترتبة على ذلك\n { وسخَّر لكم ما في السماوات وما في الأرض } من الموجودات\n بأن جعلها مداراً لمنافعهم\n قال القشيري: إذ ما من شيء من الأعيان الظاهرة\n إلا وللإنسان به انتفاع من وجوه\n فالسماء لها بناء\n والأرض لهم مِهاد\n وليتأمل العبدُ في كل شيء لو لم يكن\n أيّ خلل يرجع إلى الخلق؟ لولا الشمس كيف كانوا يتصرفون بالنهار؟ ولولا الليل\n كيف كانوا يسكنون؟ ولولا القمر هل كانوا يهتدون للحساب والآجال؟ وكذلك جميع المخلوقات\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:31",
      "similarity": 0.6661112590734264
    },
    {
      "verse": "30:46",
      "similarity": 0.6625194768225918
    },
    {
      "verse": "14:32",
      "similarity": 0.6167628451601272
    },
    {
      "verse": "22:65",
      "similarity": 0.48634568189207417
    },
    {
      "verse": "42:32",
      "similarity": 0.4003900874144586
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}