{
  "chapter": "الجاثية",
  "text": "ولقد ءاتينا بنى اسرءيل الكتب والحكم والنبوة ورزقنهم من الطيبت وفضلنهم على العلمين",
  "translations": [
    {
      "translation": "We gave the Book and Judgement and Prophethood to the tribe of Israel and provided them with good things and favoured them over all other people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the children of Israel the Book, and the judgement and the prophethood, provided them with good things, favoured them over other people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We endowed the Children of Israel with the Book and Wisdom and Prophethood, and provided them with good things as sustenance, and exalted them above the peoples of the whole world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to the Israelites, the commandments, and prophethood, granted them pure sustenance, and gave them preference above all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave the Descendants of Israel the Book, and the rule, and the Prophethood, and gave good things for sustenance and gave them superiority over all others of their time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave the Children of Israel the Scripture, and the understanding of the Scripture and its laws, and the prophethood; and provided them with good things, and preferred them above the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave the Book and the wisdom and the prophecy to the children of Israel, and We gave them of the goodly things, and We made them excel the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave the Children of Israel the Book, the Judgment, and the Prophethood, and We provided them with good things, and We preferred them above all beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily we gave the Children of Israel the Scripture and the Command and the Prophethood, and provided them with good things and favoured them above (all) peoples;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Scriptures, wisdom and prophethood to the Children of Israel, and provided them with good things and favoured them over all other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly. We vouchsafed Unto the Children of Israil the Book and the wisdom and the propherhood, and We provided them with good things and preferred them above the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave the Children of Israel the Book, judgement and prophethood and We provided them with all the good things. We gave them an advantage over all the nations,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did aforetime grant to the Children of Israel the Book the Power of Command, and Prophethood; We gave them, for Sustenance, things good and pure; and We favoured them above the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave the Children of Israel the Scripture, and the understanding of the Scripture and its laws, and the Prophethood; and provided them with good things, and preferred them above the 'Alamin (mankind and jinns) (of their time, during that period),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave to the Children of Israel the Book, judgment and prophethood. We provided them with good things and preferred them above the worlds (of theirtime).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Children of Israel the Book, and wisdom, and prophecy; and We provided them with the good things; and We gave them advantage over all other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did certainly give the Children of Israel the Scripture and judgement and prophethood, and We provided them with good things and preferred them over the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:16] And verily We gave the Children of Israel the Scripture, the Torah, and [the means of] judgement, therewith between people, and prophethood, for Moses and Aaron among them, and We provided them with the good   things, the lawful things, such as manna and quails, and We favoured them above [all] worlds, the worlds of their time, [that is, above all other] rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We gave the Children of Israel the Scripture and the Command) knowledge and understanding (and the prophethood) they had among them many prophets and Scriptures, (and provided them with good things) and provided them with quails and honey; and it is also said this means: and provided them with spoils of war (and favoured them above (all) peoples) above all the people of their time in that We bestowed upon them the Scripture and messenger;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكما أخبر سبحانه حكاية عن ضلال بني إسرائيل وانحرافهم عن سواء السبيل: { وَلَقَدْ آتَيْنَا } بمقتضى فضلنا وجودنا { بَنِيۤ إِسْرَائِيلَ ٱلْكِتَابَ } أي: التوراة المبينة لهم طريق الهداية والرشاد { وَٱلْحُكْمَ } أي: الحكمة المنبئة عن العدالة الإلهية في قطع الخصومات { وَٱلنُّبُوَّةَ } أذ أكثر الأنبياء بعث منهم وإليهم { وَرَزَقْنَاهُمْ مِّنَ ٱلطَّيِّبَاتِ } أي: الرزق الصوري والمعنوي { وَ } بالجملة { فَضَّلْنَاهُمْ } بإفاضة النعم الجليلة عليهم { عَلَى ٱلْعَالَمينَ } [الجاثية: 16] من أهل عصرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:47",
      "similarity": 0.5676116705676185
    },
    {
      "verse": "2:122",
      "similarity": 0.5676116705676185
    },
    {
      "verse": "10:93",
      "similarity": 0.47946043053509013
    },
    {
      "verse": "26:197",
      "similarity": 0.476964281530748
    },
    {
      "verse": "40:53",
      "similarity": 0.4523605730092693
    }
  ]
}