{
  "chapter": "الجاثية",
  "text": "من ورائهم جهنم ولا يغنى عنهم ما كسبوا۟ شيـا ولا ما اتخذوا۟ من دون الله اولياء ولهم عذاب عظيم",
  "translations": [
    {
      "translation": "Hell is right at their heels. Nothing they have earned will be of any use to them, nor will those they took as protectors besides Allah. They will have a terrible punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is Hell before them; and whatever they have earned will not avail them in the least, nor those whom they take as friends apart from God. There is great chastisement for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hell is behind them. Their worldly earnings shall not avail them, nor those whom they took as protectors instead of Allah. An awesome chastisement lies in store for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hell is awaiting them and none of their deeds will be of any benefit to them, nor will any guardian whom they have chosen besides God. They will suffer a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hell is after them; and what they have earned will not benefit them at all, nor those whom they have chosen as supporters besides Allah; and for them is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In front of them there is Hell. And that which they have earned will be of no profit to them, nor those whom they have taken as protective friends besides Allah. And theirs will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them is hell, and there shall not avail them aught of what they earned, nor those whom they took for guardians besides Allah, and they shall have a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behind them Gehenna; and that they have earned shall not avail them aught, nor those they took as protectors, apart from God; for them awaits a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beyond them there is hell, and that which they have earned will naught avail them, nor those whom they have chosen for protecting friends beside Allah. Theirs will be an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In front of them is Hell; and of no profit to them is anything they may have earned, nor any protectors they may have taken to themselves besides God: for them there shall be a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them is Hell; naught will avail them of that which they earned, nor those whom they took for patrons beside Allah. Theirs shall be a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ahead of them is hell, and neither what they have earned, nor what they had taken as guardians besides Allah will avail them in any way, and there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In front of them is Hell: and of no profit to them is anything they may have earned, nor any protectors they may have taken to themselves besides Allah: for them is a tremendous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In front of them there is Hell, and that which they have earned will be of no profit to them, nor (will be of any profit to them) those whom they have taken as Auliya' (protectors, helpers, etc.) besides Allah. And theirs will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gehenna (Hell) is behind them, all that they have earned shall not help them at all, nor shall those they took as guardians, other than Allah. For them there is a mighty punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beyond them lies Hell. What they have earned will not benefit them at all, nor will those they adopted as lords instead of God. They will have a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them is Hell, and what they had earned will not avail them at all nor what they had taken besides Allah as allies. And they will have a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:10] Beyond them, that is to say, ahead of them — because they are [still] in this world — is Hell, and that which they have earned, of wealth and deeds, will not avail them in any way, nor those whom they took besides God, that is, idols, as patrons. And for them there will be a great chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n. مِنْ وَرَائِهِمْ جَهَنَّمُ وَلَا يُغْنِي عَنْهُمْ مَا كَسَبُوا شَيْئًا وَلَا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ وَلَهُمْ عَذَابٌ عَظِيمٌ (10)وجملة { من ورائهم } بيان لجملة { لهم عذاب مهين } . وفي قوله : { من ورائهم } تحقيق لحصول العذاب وكونه قريباً منهم وأنهم غافلون عن اقترابه كغفلة المرء عن عدوّ يتبعه من ورائه ليأخذه فإذا نظر إلى أمامه حسب نفسه آمناً . ففي الوراء استعارة تمثيلية للاقتراب والغفلة ، ومنه قوله تعالى : { وكان وراءهم مَلِك يأخذ كلّ سفينة غصباً } \\[ الكهف : 79 \\] ، وقول لبيد :أليسَ ورائي إنْ تراخت منيتي ... لُزومُ العصا تُحنى عليها الأصابعومن فسر وراء بقُدّام ، فما رعَى حق الكلام .وعطف جملة { ولا يغني عنهم ما كسبوا شيئاً } على جملة { من ورائهم جهنم } لأن ذلك من جملة العذاب المهين فإن فقدان الفداء وفقدان الوليّ مما يزيد العذاب شدة ويكسب المعاقب إهانة . ومعنى الإغناء في قوله : { ولا يغني عنهم } الكفاية والنفع ، أي لا ينفعهم .وعُدي بحرف ( عن ) لتضمينه معنى يدفع فكأنَّه عُبّر بفعلين لا يغنيهم وبالدفع عنهم ، وتقدم في قوله : { لن تغني عنهم أموالهم ولا أولادهم من الله شيئاً } في سورة آل عمران ( 10 ) .و { ما كسبوا } : أموالهم . و { شيئاً } منصوب على المفعولية المطلقة ، أي شيئاً من الإغناء لأن { شيئاً } من أسماء الأجناسسِ العاليةِ فهو مفسر بما وقع قبله أو بعده ، وتنكيره للتقليل ، أي لا يدفع عنهم ولو قليلاً من جهنم ، أي عذابها .{ ولا ما اتخذوا } عطف على { ما كسبوا } وأعيد حرف النفي للتأكيد ، و { أولياء } مفعول ثان ل { اتخذوا } . وحذف مفعوله الأول وهو ضميرهم لوقوعه في حيز الصلة فإن حذف مثله في الصلة كثير .وأردف { عذاب مهين } بعطف { ولهم عذاب عظيم } لإفادة أن لهم عذاباً غير ذلك وهو عذاب الدنيا بالقتل والأسر ، فالعذاب الذي في قوله : { ولهم عذاب عظيم } غير العذاب الذي في قوله : { أولئك لهم عذاب مهين } .\n\n",
      "translations": [
        {
          "translation": "(Beyond them there is hell) ahead of them, after they die, there is Gehenna, (and that which they have earned) and that which they have amassed of wealth and that which they have committed of transgressions (will naught avail them) from Allah's punishment, (nor those whom they have chosen for protecting friends beside Allah) nor those whom they worshipped as deities beside Allah will avail them. (Theirs will be an awful doom) al-Nadr Ibn al-Harith will suffer all this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّن وَرَآئِهِمْ جَهَنَّمُ } معناه مِنْ بينَ أيديهِم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {from behind them is Hell} means from among their hands.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع تلك الإهانة العاجلة { مِّن وَرَآئِهِمْ } أي: قدامهم { جَهَنَّمُ } البعد والخذلان\n وسعير الطرد والحرمان { وَ } بالجملة: { لاَ يُغْنِي } ولا يدفع { عَنْهُم } يومئذ { مَّا كَسَبُواْ } وجمعوا من الأموال والأولاد والثروة والجاه { شَيْئاً } من الدفع والإغناء من غضب الله عليهم { وَ } كذا { لاَ } ينفعهم { مَا ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ } الواحد الأحد الصمد\n المستقل بالإلوهية\n المتفرد بالربوبية { أَوْلِيَآءَ } من الأصنام والأوثان\n يدعون ولايتهم كولاية الله\n ويعبدونهم كعبادته عدواناً وظلماً\n بل { وَلَهُمْ عَذَابٌ عَظِيمٌ } [الجاثية: 10] لا عذاب أعظم منه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مِن ورائهم جهنمُ } أي: من قدّامهم\n لأنهم متوجهون إلى ما أعدّ لهم\n أو: مِن خلقهم لأنهم معرضون عن ذلك\n مقبلون على الدنيا\n فإن الوراء: اسم للجهة التي يواريها الشخص من قدّام وخلف\n { ولا يُغني عنهم } لا يدفع عنهم { ما كسبوا } من الأموال والأولاد { شيئاً } من عذاب الله تعالى\n { ولا ما اتخذوا من دون الله أولياءَ } أي: الأصنام\n و \" ما \" مصدرية\n أو موصولة\n وتوسيط حرف النفي بين المعطوفين ينبئ أن عدم إغناء الأصنام أظهر وأجلى من عدم إغناء الأموال والأولاد قطعاً\n مبني على زعمهم الفاسد\n حيث كانوا يطمعون في شفاعتهم { ولهم عذاب عظيم } لا يقادر قدره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:84",
      "similarity": 0.46181738009154655
    },
    {
      "verse": "39:50",
      "similarity": 0.4426554813610533
    },
    {
      "verse": "111:2",
      "similarity": 0.43095598881010405
    },
    {
      "verse": "56:71",
      "similarity": 0.4158695404441759
    },
    {
      "verse": "23:7",
      "similarity": 0.39552241959287465
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}