{
  "chapter": "الجاثية",
  "text": "وءاتينهم بينت من الامر فما اختلفوا۟ الا منۢ بعد ما جاءهم العلم بغيۢا بينهم ان ربك يقضى بينهم يوم القيمة فيما كانوا۟ فيه يختلفون",
  "translations": [
    {
      "translation": "We made the Commandments very clear to them and they only differed after knowledge came to them, tyrannising one other. Your Lord will decide between them on the Day of Rising regarding the things they differed about.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And gave them a clear exposition of Our laws. And they did not differ until after knowledge came to them, through mutual jealousies. Verily your Lord will judge between them on the Day of Judgement in what they differed about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave them clear directions in matters pertaining to religion. Yet they differed among themselves (not out of ignorance but) after knowledge had come to them; and they did so out of the desire to commit excesses against one another. On the Day of Resurrection Allah will judge among them regarding what they had differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We also gave them clear evidence in support of the true religion. Only after having received knowledge did they create differences among themselves because of their rebelliousness. Your Lord will issue His decree concerning their differences on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them clear proofs in the command; so they did not differ except after the knowledge had come to them – due to jealousy among themselves; indeed your Lord will judge between them on the Day of Resurrection concerning the matter in which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And gave them clear proofs in matters. And they differed not until after the knowledge came to them, through envy among themselves. Verily, your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them clear arguments in the affair, but they did not differ until after knowledge had come to them out of envy among themselves; surely your -Lord will judge between them on the day of resurrection concerning that wherein they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave them clear signs of the Command; so they differed not, except after the knowledge had come to them, being insolent one to another. Surely thy Lord will decide between them on the Day of Resurrection touching their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And gave them plain commandments. And they differed not until after the knowledge came unto them, through rivalry among themselves. Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave them clear arguments in matters [of religion]. It was only after knowledge came to them that they differed among themselves out of mutual rivalry. On the Day of Resurrection your Lord will judge between them regarding their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We vouchsafed Unto them evidences of the affair. And they differed not except after the knowledge had come Unto them, through spite among themselves. Verily thy Lord will decide between them on the DaY of Judgment concerning that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We gave them manifest precepts. But they did not differ except after knowledge had come to them, out of envy among themselves. Indeed your Lord will judge between them on the Day of Resurrection concerning that about which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted them Clear Signs in affairs (of Religion): it was only after knowledge had been granted to them that they fell into schisms, through insolent envy among themselves. Verily thy Lord will judge between them on the Day of Judgment as to those matters in which they set up differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And gave them clear proofs in matters [by revealing to them the Taurat (Torah)]. And they differed not until after the knowledge came to them, through envy among themselves. Verily, Your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave them clear signs of the Command; yet it was not until after knowledge had come to them that they differed among themselves, and were insolent to each other. On the Day of Resurrection your Lord will indeed decide their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them precise rulings. They fell into dispute only after knowledge came to them, out of mutual rivalry. Your Lord will judge between them on the Day of Resurrection regarding the things they differed about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them clear proofs of the matter [of religion]. And they did not differ except after knowledge had come to them - out of jealous animosity between themselves. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:17] And We gave them clear illustrations of the commandment, the commandment of religion, in the way of what is lawful or unlawful, and the Mission of Muhammad (s), upon whom be the most excellent blessings and peace. And they did not differ, regarding his Mission, except after the knowledge had come to them, out of rivalry among themselves, that is to say, because of some rivalry that came about among them, out of envy of him. Surely your Lord will judge between them on the Day of Resurrection concerning that in which they used to differ.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n.وَآَتَيْنَاهُمْ بَيِّنَاتٍ مِنَ الْأَمْرِ فَمَا اخْتَلَفُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ (17)قوله هنا { وآتيناهم بينات من الأمر فما اختلفوا إلا من بعد ما جاءهم العلم بغياً بينهم } ، ومثل قوله :{ ليجزي قوماً بما كانوا يكسبون } \\[ الجاثية : 14 \\] فإنه مقابل قوله هنا { إن ربك يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون } .و { الكتاب } : التوراة .و { الحكم } يصح أن يكون بمعنى الحِكمة ، أي الفهم في الدّين وعلم محاسن الأخلاق كقوله تعالى : { وآتيناه الحُكم صبيّاً } \\[ مريم : 12 \\] ، يعني يحيى ، ويصح أن يكون بمعنى السيادة ، أي أنهم يحكمون أنفسهم بأنفسهم ولا تحكمهم أمة أخرى كقوله تعالى و { جَعلَكم ملوكاً } \\[ المائدة : 20 \\] ، و { النبوءة } أن يقوم فيهم أنبياء . ومعنى إيتائهم هذه الأمور الثلاثة : إيجادها في الأمة وإيجاد القائمين بها لأن نفع ذلك عائد على الأمة جمعاء فكان كل فرد من الأمة كمن أوتي تلك الأمور .وأما رزقهم من الطيبات فبأن يسّر لهم امتلاك بلاد الشام التي تفيض لبناً وعسلاً كما في التوراة في وعد إبراهيم والتي تجبى إليها ثمرات الأرضين المجاورة لها وتَرد عليها سلع الأمم المقابلة لها على سواحل البحر فتزخر مراسيها بمختلف الطعام واللباس والفواكه والثمار والزخارف ، وذلك بحُسن موقِععِ البلاد من بين المشرق براً والمغرب بحراً . و { الطيبات } : هي التي تطيب عند الناس وتحسن طعْماً ومنظراً ونفعاً وزينة . وأما تفضيلهم على العالمين فبأن جمع الله لهم بين استقامة الدّين والخَلق ، وبين حكم أنفسهم بأنفسهم ، وبث أصول العدل فيهم ، وبين حسن العيش والأمن والرخاء ، فإن أمماً أخرى كانوا في بحبوحة من العيش ولكن ينقص بعضَها استقامةُ الدّين والخلق ، وبعضها عزة حكم النفس وبعضَها الأمن بسبب كثرة الفتن .والمراد ب { العالمين } : أمم زمانهم وكل ذلك إخبار عما مضى من شأن بني إسرائيل في عنفوان أمرهم لا عَمَّا آل إليه أمرهم بعد أن اختلفوا واضمحل ملكهم ونسخت شريعتهم .و { بيّنات } صفة نزلت منزلة الجامد ، فالبينة : الحجة الظاهرة ، أي آتيناهم حججاً ، أي علمناهم بواسطة كتبهم وبواسطة علمائهم حجج الحق والهدى التي من شأنها أن لا تترك للشك والخطإ إلى نفوسهم سبلاً إلا سدتها .و { الأمر } : الشأن كما في قوله : { وما أمر فرعون برشيدٍ } \\[ هود : 97 \\] والتعريف في { الأمر } للتعظيم ، أي من شؤون عظيمة ، أي شأن الأمة وما به قوام نظامها إذْ لم يترك موسى والأنبياء من بعده شيئاً مُهماً من مصالحهم إلا وقد وضحوه وبينوه وحذروا من الالتباس فيه .و { مِن } في قوله { من الأمر } بمعنى ( في ) الظرفيّة فيحصل من هذا أن معنى { وءاتيناهم بينات من الأمر } : علمناهم حججاً وعلوماً في أمر دينهم ونظامهم بحيث يكونون على بصيرة في تدبير مجتمعهم وعلى سلامة من مخاطر الخطإ والخطل . وفُرع على ذلك قولُه { فما اختلفوا إلا من بعد ما جاءهم العلم } تفريعَ إدماج لمناسبته للحالة التي أريد تنظيرها . وتقدير الكلام : فاختلفوا وما اختلفوا إلا من بعد ما جاءهم العلم ، فحذف المفرَّع لدلالة ما بعده عليه على طريقة الإيجاز إذ المقصود هو التعجيب من حالهم كيف اختلفوا حينَ لا مظنة للاختلاف إذ كان الاختلاف بينهم بعدما جاءهم العلم المعهود بالذكر آنفاً من الكتاب والحُكم والنبوءة والبينات من الأمر ، ولو اختلفوا قبل ذلك لكان لهم عذر في الاختلاف وهذا كقوله تعالى :{ وأضلّه الله على علم } \\[ الجاثية : 23 \\] . وهذا الكلام كناية عن عدم التعجيب من اختلاف المشركين مع المؤمنين حيث أن المشركين ليسوا على علم ولا هدى ليعلم رسول الله صلى الله عليه وسلم أنه ملطوف به في رسالته .والبغي : الظلم . والمراد : أن اختلافهم عن عمد ومكابرة بعضهم لبعض وليس عن غفلة أو تأويل ، وهذا الظلم هو ظلم الحسد فإن الحسد من أعظم الظلم ، أي فكذلك حال نظرائهم من المشركين ما اختلفوا على النبي صلى الله عليه وسلم إلا بغياً منهم عليه مع علمهم بصدقه بدلالة إعجاز القرآن لفظاً ومعاني .وانتصب { بغياً } إمّا على المفعول لأجله ، وإمّا على الحال بتأويل المصدر باسم الفاعل ، وعلى كلا الوجهين فالعامل فيه فعل { اختلفوا } ، وإن كان منفياً في اللفظ لأن الاستثناء أبطل النفي إذ ما أريد إلا نفي أن يكون الاختلاف في وقت قبل أن يحثهم العلم فلما استفيد ذلك بالاستثناء صار الاختلاف ثابتاً وما عدا ذلك غير منفي .وجملة { إن ربّك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون } مستأنفة استئنافاً بيانياً لأن خبرَهم العجيب يثير سؤالاً في نفس سامعه عن جزاء الله إياهم على فعلهم ، وهذا جواب فيه إجمال لتهويل ما سيُقضَى به بينهم في الخير والشر لأن الخلاف يقتضي محقّاً ومبطلاً .ونظير هذه الآية قوله تعالى : { ولقد بوَّأنا بني إسرائيل مُبَوّأ صدق ورزقناهم من الطيبات فما اختلفوا حتى جاءهم العلم إن ربّك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون } في سورة يونس ( 93 ) .\n\n",
      "translations": [
        {
          "translation": "(And gave them plain commandments) regarding Religion. (And they differed not) regarding Muhammad (pbuh) the Qur'an and Islam (until after the knowledge came unto them) until the explanation in their own Scripture came to them, (through rivalry among themselves) because of resentful envy they refused to believe in Muhammad (pbuh) and the Qur'an. (Lo! thy Lord) Muhammad (will judge between them) between the Jews, Christians and believers (on the Day of Resurrection concerning that wherein) in matter of religion (they used to differ) in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَآتَيْنَاهُم بَيِّنَاتٍ } دلائل مبينات منبهات موضحات { مِّنَ ٱلأَمْرِ } أي: التوحيد الذاتي الذي أنت يأ أكمل الرسل تبعث عليه وعلى تبيينه\n وبالجملة: { فَمَا ٱخْتَلَفُوۤاْ } في شأنك أي: { إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ } القطع في كتبهم وعلى ألسنة رسلهم بأنك وكتابك ودينك يا أكمل الرسل على الحق\n وما أنكروا لك إلا { بَغْياً } وطغياناً ناشئاً بينهم حسداً وعدواناً بلا مستند عقلي أو نقلي\n فاصبر يا أكمل الرسل على مضضهم\n وغيظهم { بَيْنَهُمْ إِنَّ رَبَّكَ } الذي اصطفاك بكرامته\n واجتباك لرسالته { يَقْضِي } ويحكم { بِيْنَهُمْ يَوْمَ ٱلْقِيَامَةِ فِيمَا كَانُواْ فِيهِ يَخْتَلِفُونَ } [الجاثية: 17] يعني: في شأنك ودينك وكتابك\n بعدما عرفوا صدقك وحقية كتابك بالدلائل العقلية والنقلية بأنواع المؤاخذة والمجازاة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وآتيناهم بيناتٍ من الأمر } دلائل ظاهرة من أمر الدين\n ومعجزات قاهرة\n قال ابن عباس: هو العلم بمبعث النبي صلى الله عليه وسلم\n وما بُيّن لهم من أمره\n وأنه يُهاجر من تهامة إلى يثرب\n ويكون أنصاره أهل يثرب\n { فَما اختلفوا } في ذلك الأمر { إِلا من بعد ما جاءهم العلمُ } بحقيقته وحقيّته\n فجعلوا ما يوجب زوال الخلاف موجباً له\n { بغياً بينهم } أي: عداوة وحسداً\n حديث بينهم\n لا شك وقع لهم فيه\n { إِن ربك يقضي بينهم يوم القيامة } بالمؤاخذة والجزاء { فيما كانوا فيه يختلفون } من أمر الدين\n الإشارة: كانت بنو إسرائيل في أول أمرها متمسكة بكتاب ربها\n عاملة بما شرعت لها أنبياؤها\n فرفع الله بذلك قدرها\n حتى تحاسدوا\n وتهاجروا على الدنيا والرئاسة\n فأعقبهم الله ذل الأبد\n فهذه سُنَّة الله تعالى في عباده\n مَن تمسّك بالكتاب والسنّة\n وزهد في الدنيا\n وتواضع لعباد الله\n رفعه الله وأعزّه\n فإذا خرج عن هذا الوصف انعكس حاله إلى أسفل\n والعياذ بالله\n ولما ذكر شريعة موسى أعقبه بشريعة نبينا صلوات الله وسلامه عليهم أجمعين\n فقال: { ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِّنَ ٱلأَمْرِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:68",
      "similarity": 0.4476983102612732
    },
    {
      "verse": "27:78",
      "similarity": 0.44077338961829143
    },
    {
      "verse": "3:19",
      "similarity": 0.3952714286033054
    },
    {
      "verse": "6:58",
      "similarity": 0.39392423432172924
    },
    {
      "verse": "19:35",
      "similarity": 0.3916281165346391
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}