{
  "chapter": "الجاثية",
  "text": "ثم جعلنك على شريعة من الامر فاتبعها ولا تتبع اهواء الذين لا يعلمون",
  "translations": [
    {
      "translation": "Then We placed you on the right road of Our Command, so follow it. Do not follow the whims and desires of those who do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have put you on the right way in the matter (of divine law). So follow it, and do not follow the wishes of those who are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then We set you, (O Prophet), on a clear high road in religious matters. So follow that and do not follow the desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have established for you a code of conduct and a religion. Follow it and do not follow the desires of the ignorant people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then placed you (O dear prophet Mohammed – peace and blessings be upon him) upon the clear path of the command, therefore continue following it and do not listen to the desires of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We have put you on a (legal) way of commandment. So follow you that, and follow not the desires of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We have made you follow a course in the affair, therefore follow it, and do not follow the low desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set thee upon an open way of the Command; therefore follow it, and follow not the caprices of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now have We set thee (O Muhammad) on a clear road of (Our) commandment; so follow it, and follow not the whims of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set you on a clear path [of religion]: so follow it, and do not yield to the desires of those who have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thereafter We have placed thee upon the law of the religion; so follow it thou, and follow not the vain desires of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set you upon a clear course of the Law; so follow it, and do not follow the desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We put thee on the (right) Way of Religion: so follow thou that (Way), and follow not the desires of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We have put you (O Muhammad SAW) on a plain way of (Our) commandment [like the one which We commanded Our Messengers before you (i.e. legal ways and laws of the Islamic Monotheism)]. So follow you that (Islamic Monotheism and its laws), and follow not the desires of those who know not. [Tafsir At-Tabari Vol. 25, Page 146].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now, We have set you on the jurisprudence of the Command, therefore follow it and do not follow the desires of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We set you upon a pathway of faith, so follow it, and do not follow the inclinations of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We put you, [O Muhammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:18] Then We set you, O Muhammad (s), upon a [clear] course, [a clear] way, of the commandment, the commandment of religion; so follow it, and do not follow the desires of those who do not know, in worshipping other than God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n.ثُمَّ جَعَلْنَاكَ عَلَى شَرِيعَةٍ مِنَ الْأَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ لَا يَعْلَمُونَ (18) { ثم } للتراخي الرتبي كما هو شأنها في عطف الجمل ، ولولا إرادة التراخي الرتبي لكانت الجملة معطوفة بالواو . وهذا التراخي يفيد أن مضمون الجملة المعطوفة بحرف { ثم } أهم من مضمون الجملة المعطوففِ عليها أهمية الغرض على المقدمة والنتيجةِ على الدليل . وفي هذا التراخي تنويه بهذا الجعل وإشارة إلى أنه أفضل من إيتاء بني إسرائيل الكتاب والحكم والنبوءة والبّيناتتِ من الأمر ، فنبوءة محمد صلى الله عليه وسلم وكتابُه وحُكمه وبَيناته أفضل وأهدى مما أوتيه بنو إسرائيل من مثل ذلك .و { على } للاستعلاء المجازي ، أي التمكن والثبات على حد قوله تعالى : { أولئك على هدى من ربّهم } \\[ البقرة : 5 \\] .وتنوين { شريعة } للتعظيم بقرينة حرف التراخي الرتبي .والشريعة : الدين والملة المتَّبعة ، مشتقة من الشرع وهو : جَعل طريق للسير ، وسمي النهج شَرعاً تسميةً بالمصدر . وسُميت شَريعة الماء الذي يرده الناس شريعةً لذلك ، قال الراغب : استعير اسم الشريعة للطريقة الإلهية تشبيهاً بشريعة الماء قلتُ : ووجه الشبه ما في الماء من المنافع وهي الري والتطهير .و { الأمر } : الشأن ، وهو شأن الدين وهو شأن من شؤون الله تعالى ، قال تعالى : { وكذلك أوحينا إليك روحاً من أمرنا } \\[ الشورى : 52 \\] ، فتكون { مِن } تبعيضية وليست كالتي في قوله آنفاً { وآتيناهم بينات من الأمر } \\[ الجاثية : 17 \\] لأن إضافة { شريعة } إلى { الأمر } تمنع من ذلك .وقد بلغت هذه الجملة من الإيجاز مبلغاً عظيماً إذ أفادت أن شريعة الإسلام أفضل من شريعة موسى ، وأنها شريعة عظيمة ، وأن الرسول صلى الله عليه وسلم متمكن منها لا يزعزعه شيء عن الدَأب في بيانها والدعوة إليها . ولذلك فرع عليه أمره باتباعها بقوله : { فاتّبعها } أي دُم على اتباعها ، فالأمر لطلب الدوام مثل { يا أيها الذين آمنوا آمنوا بالله ورسوله } \\[ النساء : 136 \\] .وبين قوله : { فاتبعها } وقوله : { ولا تتبع أهواء الذين لا يعلمون } محسِّن المطابقة بين الأمر بالاتباع والنهي عن اتباع آخر . و { الذين لا يعلمون } هم المشركون وأهواؤهم دين الشرك قال تعالى : { أفرأيت من اتخذ إلهاه هواه } \\[ الجاثية : 23 \\] .والأهواء : جمع هوى ، وهو المحبة والميل . والمعنى : أن دينهم أعمال أحبوها لم يأمر الله بها ولا اقتضتها البراهين .والخطاب للنبيء صلى الله عليه وسلم والمقصود منه : إسماع المشركين لئلا يطمعوا بمصانعة الرسول صلى الله عليه وسلم إيَّاهم حين يرون منه الإغضاء عن هفواتهم وأذاهم وحِينَ يسمعون في القرآن بالصفح عنهم كما في الآية السالفة { قل للذين آمنوا يغفروا للذين لا يرجون أيام الله } \\[ الجاثية : 14 \\] . وفيه أيضاً تعريض للمسلمين بأن يحذروا من أهواء الذين لا يعلمون . وعن ابن عباس «أنها نزلت لمّا دعته قريش إلى دين آبائه» قال البغوي : كانوا يقولون له : ارجع إلى دين آبائك فإنهم أفضل منك .\n\n",
      "translations": [
        {
          "translation": "(And now have We set thee) We have chosen you ((0 Muhammad) on a clear road of (Our) commandment) on a clear wont and way in relation to My command and obedience; (so follow it) hold fast to them and act upon them; it is also said that this means: We have honoured you with Islam and have commanded you to call mankind to it, (and follow not the whims of those) the religion of those (who know not) Allah's divine Oneness, i.e. the Jews, Christians and idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِّنَ ٱلأَمْرِ } معناه على طَريقةٍ وسُنةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then We made you follow a path from the affair\" - meaning on a way and a sunnah.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } اعلم يا أكمل الرسل إنا من مقام فضلنا وجودنا { جَعَلْنَاكَ } تابعاً مقتدياً مقتفياً { عَلَىٰ شَرِيعَةٍ } وطريقة منبئة موضحة { مِّنَ ٱلأَمْرِ } الذي أنت تظهر عليه\n وأتيت لتنبيهه\n ألا وهي الحقيقة التي هي عبارة عن الوحدة الذاتية الإلهية { فَٱتَّبِعْهَا } أي: الشريعة الموصلة إلى الحقيقة بالعزيمة الخالصة { وَلاَ تَتَّبِعْ أَهْوَآءَ ٱلَّذِينَ لاَ يَعْلَمُونَ } [الجاثية: 18] فكيف ينكشفون بسرائرها وحكمها\n ولا تقبل منهم أباطيلهم الناشئة وآراءهم الفاسدة وأحلامهم السخيفة الكاسدة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ثم جعلناك } يا محمد بعد اختلاف أهل الكتاب\n { على شريعةٍ } على طريقة عظيمة الشأن\n ومنهاج واضح { من الأمر } الدين\n وأصل الشريعة في اللغة: مورد الماء\n أي: الطريق الموصلة إليه\n ثم جعل للطريق الموصلة إلى حياة القلوب والأرواح لأن الماء به حياة الأشباح\n { فاتّبِعْها } بإجراء أحكامها في نفسك وفي غيرك\n من غير إخلال بشيء منها\n قال ابن عرفة: الخطاب له عليه السلام\n والمراد غيره لأنه معلوم الاتباع التام\n أو: دم على اتباعها\n هـ\n { ولا تتبع أهواء الذين لا يعلمون } أي: لا تتبع آراء الجهلة واعتقاداتهم الزائغة التابعة للشهوات\n وهم رؤساء قريش\n كانوا يقولون له صلى الله عليه وسلم: ارجع إلى دين آبائك\n { إنهم لن يُغنوا عنك من الله شيئاً } مما أراد بك إن اتبعتهم\n أي: لن ينفعونك بدفع ما ينزل بك بدلاً من الله شيئاً إن اتبعت أهواءهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:21",
      "similarity": 0.6876043375591869
    },
    {
      "verse": "42:13",
      "similarity": 0.5088408811935995
    },
    {
      "verse": "7:163",
      "similarity": 0.41997955950984095
    },
    {
      "verse": "54:3",
      "similarity": 0.2366506208132788
    },
    {
      "verse": "30:29",
      "similarity": 0.2263481676196164
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}