{
  "chapter": "الجاثية",
  "text": "قل الله يحييكم ثم يميتكم ثم يجمعكم الى يوم القيمة لا ريب فيه ولكن اكثر الناس لا يعلمون",
  "translations": [
    {
      "translation": "Say: \"God, who gives you life and makes you die, will (raise the dead) then gather you (and your ancestors) together on the Day of Resurrection of which there is no doubt.\" And yet most men do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “It is Allah Who gives you life and then causes you to die, and He it is Who will then bring all of you together on the Day of Resurrection, a Day regarding which there can be no doubt. Yet most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"It is God who gives you life and causes you to die. He will bring you together on the inevitable Day of Judgment,\" but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is Allah Who gives you life, then will give you death, then will gather you all on the Day of Resurrection in which there is no doubt, but most people do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to them): \"Allah gives you life, then causes you to die, then He will assemble you on the Day of Resurrection about which there is no doubt. But most of mankind know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Allah gives you life, then He makes you die, then will He gather you to the day of resurrection wherein is no doubt, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'God gives you life, then makes you die, then He shall gather you to the Day of Resurrection, wherein is no doubt, but most men do not know.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): Allah giveth life to you, then causeth you to die, then gathereth you unto the Day of Resurrection whereof there is no doubt. But most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"God gives you life, then causes you to die, and then will gather you together for the Day of Resurrection, about which there is no doubt. But most people do not know it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: Allah keepeth you alive, then He shall cause you to die, then He shall assemble you on the Day of Resurrection whereof there is no doubt; but most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It is Allah who gives you life, then He makes you die. Then He will gather you on the Day of Resurrection, in which there is no doubt. But most people do not know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is Allah Who gives you life, then gives you death; then He will gather you together for the Day of Judgment about which there is no doubt\": But most men do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to them): \"Allah gives you life, then causes you to die, then He will assemble you on the Day of Resurrection about which there is no doubt. But most of mankind know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Allah revives you and causes you to die. Then, He shall gather you on the Day of Resurrection, and of this there is no doubt, yet most people do notknow'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “God gives you life, then He makes you die; then He gathers you for the Day of Resurrection, about which there is no doubt. But most people do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Allah causes you to live, then causes you to die; then He will assemble you for the Day of Resurrection, about which there is no doubt, but most of the people do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:26] Say: ‘God [is the One Who] gives you life, when you are sperm-drops, then makes you die, then gathers you, alive, to the Day of Resurrection, in which there is no doubt; but most people, and these are the one who say the above-mentioned, do not know’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to Abu Jahl and his host: (Allah giveth life to you) in the grave, (then causeth you to die) in the grave, (then gathereth you unto the Day of Resurrection) it is also said that this means: Allah will cause you to die and then will gather you to the Day of Resurrection (whereof there is no doubt. But most of mankind) the people of Mecca (know not) this nor believe it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أعرضوا عن الحق وانصرفوا عن الآيات البينات، وتشبثوا بأمثال هذه الحجج الواهية: { قُلِ } لهم يا أكمل الرسل كلاماً يحرك سلسلة حميتهم الفطرية، ومحبتهم الجبلية لو ساعدهم التوفيق والعناية من عندنا: { ٱللَّهُ } المظهر للكل، المحيط به، المتصرف فيه على الإطلاق بالاختيار والاستحقاق { يُحْيِيكُمْ } ويبعثكم في النشأة الأخرى كما أوجدكم وأظهركم من كتم العدم أولاً في النشأة الأولى، يبسط ظله عليكم { ثُمَّ يُمِيتُكُمْ } ويعدمكم بقبضه عنكم { ثُمَّ يَجْمَعُكُمْ } أي: أنتم ومن انقرض من آبائكم { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } الذي { لاَ رَيْبَ فِيهِ } وفي وقوع ما فيه من الحساب والجزاء والسؤال والصراط والجنة والنار وسائر المعتقدات الأخروية { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ } المجبولين على الكفران والنسيان { لاَ يَعْلَمُونَ } [الجاثية: 26] وقوعه وقيامه، بل ينكرون عليه لاعتيادهم بالأمور الحسية، وقصورهم عن مدركات الكشف والشهود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}