{
  "chapter": "الجاثية",
  "text": "ولله ملك السموت والارض ويوم تقوم الساعة يومئذ يخسر المبطلون",
  "translations": [
    {
      "translation": "The kingdom of the heavens and earth belongs to Allah and, on the Day that the Hour arrives, that Day the liars will be lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's is the kingdom of the heavens and the earth. The day the Hour is proclaimed the liars will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is the kingdom of the heavens and the earth, and on the Day when the Hour (of Resurrection) shall come to pass, the followers of falsehood shall be in utter loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth. On the day when the Hour of Doom arrives, the followers of falsehood will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only belongs the kingship of the heavens and the earth; and when the Last Day is established – on that day the followers of falsehood will suffer loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the kingdom of the heavens and the earth. And on the Day that the Hour will be established -- on that Day the followers of falsehood shall lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the kingdom of the heavens and the earth; and on the day when the hour shall come to pass, on that day shall they perish who say false things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the Kingdom of the heavens and the earth. And on the day when the Hour is come, upon that day the vain-doers shall lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah belongeth the Sovereignty of the heavens and the earth; and on the day when the Hour riseth, on that day those who follow falsehood will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth; on the Day when the Hour comes, those who follow falsehood will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the dominion of the heavens and the earth; and on the Day whereon the Hour arriveth, then shall lose the followers of falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the kingdom of the heavens and the earth, and when the Hour sets in, the falsifiers will be losers on that day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth, and the Day that the Hour of Judgment is established,- that Day will the dealers in Falsehood perish!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the kingdom of the heavens and the earth. And on the Day that the Hour will be established, on that Day the followers of falsehood (polytheists, disbelievers, worshippers of false deities, etc.) shall lose (everything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Kingdom in the heavens and the earth. On the Day when the Hour comes, those who disbelieved shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingship of the heavens and the earth. On the Day when the Hour takes place, on that Day the falsifiers will lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:27] And to God belongs the kingdom of the heavens and the earth. And on the day when the Hour sets in (yawma taqūmu’l-sā‘atu is substituted by [the following, yawma’idhin]) on that day the followers of falsehood, the disbelievers, will be losers, that is to say, their loss will become manifest by their ending up in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n.وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَخْسَرُ الْمُبْطِلُونَ (27) { يَعْلَمُونَ \\* وَلِلَّهِ مُلْكُ السماوات والارض وَيَوْمَ تَقُومُ الساعة يَوْمَئِذٍ يَخْسَرُ المبطلون } .اعتراض تذييل لقوله : { قل الله يحييكم ثم يميتكم } \\[ الجاثية : 26 \\] أي لله لا لغيره مُلك السماوات والأرض ، أي فهو المتصرف في أحوال ما حوته السماوات والأرض من إحياء وإماتة ، وغير ذلك بما أوجد من أصولها وما قدّر من أسبابها ووسائلها فليس للدهر تصرف ولا لما سوى الله تعالى . وتقديم المجرور على المسند إليه لإفادة التخصيص لرد معتقدهم من خروج تصرف غيره في بعض ما في السماوات والأرض كقولهم في الدهر .{ } صلى الله عليه وسلم .لما جرى ذِكْر يوم القيامة أعقب بإنذار الذين أنكروه من سوء عاقبتهم فيه .و { المبطلون والارض وَيَوْمَ تَقُومُ الساعة يَوْمَئِذٍ يَخْسَرُ المبطلون \\* وترى كُلَّ أُمَّةٍ جَاثِيَةً كُلُّ أمَّةٍ تدعى إلى كتابها اليوم تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ \\* هذا كتابنا يَنطِقُ عَلَيْكُم } : الآتون بالباطل في معتقداتهم وأقوالهم وأعمالهم إذ الباطل ما ضادَّ الحق . والمقصود منه ابتداء هنا هو الشرك بالله فإنه أعظم الباطل ثم تجيء درجات الباطل متنازلة وما من درجة منها إلا وهي خسارة على فاعلها بقدر فعلته وقد أنذر الله الناس وهو العليم بمقادير تلك الخسارة .{ ويوم تقوم الساعة } ظرف متعلق ب { يخسر } ، وقدم عليه للاهتمام به واسترعاء الأسماع لما يرد من وصف أحواله .و { يومئذٍ } توكيد ل { يوم تقوم الساعة } وتنوينه عوض عن المضاف إليه المحذوف لدلالة ما أضيف إليه يومَ عليه ، أي يوم إذْ تقوم الساعة يخسر المبطلون فالتأكيد بتحقيق مضمون الخبر ولتهويل ذلك اليوم .\n\n",
      "translations": [
        {
          "translation": "(And Unto Allah belongeth the Sovereignty) the stores (of the heavens) i.e. rain (and the earth) i.e. vegetation; (and on the day when the Hour riseth) which is the Day of Judgement, (on that day those who follow falsehood will be lost) the idolaters will be losers both for missing the life of the world and the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { لِلَّهِ } المتوحد في الألوهية والربوبية { مُلْكُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ } وملكوتهما\n وله التصرف المطابق في ملكه وملكوته بالاستقلال\n إرادة واختياراً { وَيَوْمَ تَقُومُ ٱلسَّاَعةُ } المعدة للحشر والجزاء { يَوْمَئِذٍ يَخْسَرُ ٱلْمُبْطِلُونَ } [الجاثية: 27] المنكرون حين يشهدون ربح المحقين المؤمنين بقيام الساعة\n وبحقية جميع ما فيها من الوعد والوعيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولله ملكُ السماوات والأرض } أي: له التصرُّف فيما وفيما بينهما\n وهو بيان لاختصاص الملك المطلق بالله\n إثر بيان تصرفه تعالى في الناس بالإحياء والإماتة\n والبعث والجمع والجزاء\n وكأنه دليل لِما قبله\n { ويوم تقوم الساعةُ يومئذ يَخْسَرُ المبطلون } الداخلون في الباطل\n وهو الكفر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:52",
      "similarity": 0.5465512903015661
    },
    {
      "verse": "30:14",
      "similarity": 0.4579920709563374
    },
    {
      "verse": "47:33",
      "similarity": 0.42809245267240786
    },
    {
      "verse": "43:85",
      "similarity": 0.3884432536178884
    },
    {
      "verse": "22:62",
      "similarity": 0.3845742141195362
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}