{
  "chapter": "الجاثية",
  "text": "وقالوا۟ ما هى الا حياتنا الدنيا نموت ونحيا وما يهلكنا الا الدهر وما لهم بذلك من علم ان هم الا يظنون",
  "translations": [
    {
      "translation": "They say, 'There is nothing but our existence in this world. We die and we live and nothing destroys us except for time.' They have no knowledge of that. They are only conjecturing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they say: \"There is nothing but the life of this world. We die and we live, and only time annihilates us.\" Yet they have no knowledge of this: They only speculate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “There is no life other than our present worldly life: herein we live and we die, and it is only (the passage of) time that destroys us. Yet the fact is that they know nothing about this and are only conjecturing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"The only life is this worldly life and here we shall live and die. It is only time which will destroy us\" They have no knowledge about this. It is only their guesswork.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “There is nothing except our life of this world – we die and we live – and nothing destroys us except the passage of time”; and they do not have any knowledge of it; they only make guesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"There is nothing but our life of this world, we die and we live and nothing destroys us except Ad-Dahr (time). And they have no knowledge of it, they only presume.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: There is nothing but our life in this world; we live and die and nothing destroys us but time, and they have no knowledge of that; they only conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'There is nothing but our present life; we die, and we live, and nothing but Time destroys us.' Of that they have no knowledge; they merely conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: There is naught but our life of the world; we die and we live, and naught destroyeth us save time; when they have no knowledge whatsoever of (all) that; they do but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"There is nothing but our life in this world: we die, we live, nothing but time destroys us.\" They have no knowledge of this; they only follow conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: there is no naught but our life of the world; die and we live; and naught destroyeth us save Time. And they have no knowledge thereof: they do but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘There is nothing but the life of this world: we live and we die, and nothing but time destroys us.’ But they do not have any knowledge of that, and they only make conjectures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"What is there but our life in this world? We shall die and we live, and nothing but time can destroy us.\" But of that they have no knowledge: they merely conjecture:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"There is nothing but our life of this world, we die and we live and nothing destroys us except Ad-Dahr (the time). And they have no knowledge of it, they only conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'There is nothing except this life, we die and we live, it is only time that destroys us' Surely, of this they have no knowledge, they are just guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “There is nothing but this our present life; we die and we live, and nothing destroys us except time.” But they have no knowledge of that; they are only guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"There is not but our worldly life; we die and live, and nothing destroys us except time.\" And they have of that no knowledge; they are only assuming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:24] And they, those who deny the Resurrection, say, ‘There is only, that is to say, [the only] life [is], our life, the one that is, in this world. We die and we live, that is to say, some die, while others are given life by [virtue of] being born, and nothing but time, that is, [nothing but] the passage of time, destroys us’. God, exalted be He, says: Of that, saying, they have no knowledge; they are only making conjectures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n.وَقَالُوا مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ وَمَا لَهُمْ بِذَلِكَ مِنْ عِلْمٍ إِنْ هُمْ إِلَّا يَظُنُّونَ (24)هذا عطف على جملة { أم حسب الذين اجترحوا السيئات } \\[ الجاثية : 21 \\] أي بعد أن جادلوا المسلمين بأنه إن كان يبعث بعد الموت فستكون عقباهم خيراً من عقبى المسلمين ، يقولون ذلك لقصد التورك وهم لا يوقنون بالبعث والجزاء بل ضربوه جدلاً وإنما يقينُهم قولُهم { ما هي إلا حياتنا الدنيا } .وتقدم في سورة الأنعام ( 29 ) { وقالوا إن هي إلاّ حياتنا الدنيا وما نحن بمبعوثين } وضمير { هي } ضمير القصة والشأن ، أي قصة الخوض في البعث تنحصر في أن لا حياة بعد الممات ، أي القصة هي انتفاء البعث كما أفاده حصر الأمر في الحياة الدنيا ، أي الحاضرة القريبَة منا ، أي فلا تطيلوا الجدال معنا في إثبات البعث ، ويجوز أن يكون { هي } ضمير الحياة باعتبار دلالة الاستثناء على تقدير لفظ الحياة فيكون حَصْراً لجنس الحياة في الحياة الدنيا .وجملة { نموت ونحيا } مبيّنة لجملة { ما هي إلا حياتنا الدنيا } أي ليس بعد هذا العالم عالم آخر فالحياة هي حياة هذا العالم لا غير فإذا مات من كان حيّاً خلفه من يوجد بعده . فمعنى { نموت ونحيا } يموت بعضنا ويحيا بعض أي يبقى حيّاً إلى أمد أو يولد بعد من ماتوا . وللدلالة على هذا التطور عبّر بالفعل المضارع ، أي تتجدد فينا الحياة والموت . فالمعنى : نموت ونحيا في هذه الحياة الدنيا وليس ثمة حياة أخرى . ثم إن كانت هذه الجملة محكية بلفظ كلامهم فَلَعَلها ممّا جرى مجرى المثل بينهم ، وإنْ كانت حكايَة لمعنى كلامهم فهي من إيجاز القرآن وهم إنما قالوا : يموت بعضنا ويحيَا بعضنا ثم يموت فصار كالمثل .ولا يخطر بالبال أن حكاية قولهم : { نموت ونحيا } تقتضي إرادة نحيا بعد أن نموت لأن قولهم { ما هي إلا حياتنا الدنيا } يصرف عن خطور هذا بالبال . والعطفُ بالواو لا يقتضي ترتيباً بين المتعاطفين في الحصول .وإنما قدم { نموت } في الذكر على { ونحيا } في البيان مع أن المبيّن قولهم { ما هي إلا حياتنا الدنيا } فكان الظاهر أن يبدأ في البيان بذكر اللفظ المبيَّن فيقال : نَحيَا ونموت ، فقيل قُدّم { نموت } لتتأتى الفاصلة بلفظ { نحيا } مع لفظ { الدنيا } . وعندي أن تقديم فعل { نموت } على { نَحيا } للاهتمام بالموت في هذا المقام لأنهم بصدد تقرير أن الموت لا حياة بعده ويتبع ذلك الاهتمام تأتي طباقين بين حياتنا الدنيا ونموت ثم بين نموت ونحيا . وحصلت الفاصلة تبعاً ، وذلك أدخل في بلاغة الإعجاز ولذلك أعقبه بقوله تعالى : { وما لهم بذلك من علم } فالإشارة ب { ذلك } إلى قولهم { وما يُهلكنا إلا الدهر } ، أي لا علم لهم بأن الدهر هو المميت إذ لا دليل .وأما زيادة { وما يهلكنا إلا الدهر } فقصدوا تأكيد معنى انحصار الحياة والموت في هذا العالم المعبر عنه عندهم بالدهر .فالحياة بتكوين الخلقة والممات بفعل الدهر . فكيف يرجى لمن أهلكه الدهر أن يعود حيّاً فالدهر هو الزمان المستمر المتعاقب ليله ونهاره .والمعنى : أحياؤنا يصيرون إلى الموت بتأثير الزمان ، أي حَدثانه من طول مدة يعقبها الموت بالشيخوخة ، أو من أسباب تفضي إلى الهلاك ، وأقوالهم في هذا كثيرة ومن الشعر القديم قول عَمْرو بن قميئة: ... رَمَتْنِي بناتُ الدهر من حيث لا أرىفمَا بال من يُرمى وليس بِرَامِ ... ولعلهم يريدون أنه لو تأثر الزمان لبقي الناس أحياء كما قال أسقف نجران: ... منع البقاء تقلب الشمسوطلوعها من حيث لا تُمسي ... فلما كان الموت بفعل الدهر فكيف يرجى أن يعودوا أحياء . وهذه كلمات كانت تجري على ألسنتهم لقلة التدبر في الأمور وإن كانوا يعلمون أن الله هو الخالق للعوالم ، وأما ما يجري في العالم من التصرفات فلم يكن لهم فيه رأي وكيف وحالتهم الأمية لا تساعد على ذلك ، وكانوا يخطئون في التفاصيل حتى يأتوا بما يناقض ما يعتقدونه ، ولذلك أعقبه بقوله تعالى : { وما لهم بذلك من علم } فإشارة ب { ذلك } إلى قولهم { وما يهلكنا إلا الدهر } أي لا علم لهم بأن الدهر هو المميت إذ لا دليل على ذلك فإن الدليل النظري بَيَّن أن الدهر وهو الزمان ليس بمُميت مباشرةً وهو ظاهر ولا بواسطةٍ في الإماتة إذ الزمان أمر اعتباري لا يفعل ولا يؤثر وإنما هو مقادير يقدِّر بها الناس الأبعاد بين الحوادث مرجعه إلى تقدير حصة النهار والليل وحصص الفصول الأربعة ، وإنما توهم عامة الناس أن الزمان متصرف ، وهي توهمات شاعت حتى استقرت في الأذهان الساذجة .والمراد بالظن في قوله : { إن هم إلا يظنون } ما ليس بعلم فهو هنا التخيل والتوهم وجملة { إن هم إلا يظنون } مبيّنة بجملة { وما لهم بذلك من علم } أو استئناف بياني كأنّ سائلاً حين سَمع قوله : { وما لهم بذلك من علم } سأل عن مستندهم في قولهم ذلك فأجيب بأنه الظن المبني على التخيل .وجيء بالمضارع في { يظنون } لأنهم يحددون هذا الظن ويتلقاه صغيرهم عن كبيرهم في أجيالهم وما هم بمقلعين عنه .\n\n",
      "translations": [
        {
          "translation": "(And they say) i.e. the people of Mecca: (There is naught but our life of the world) in this life of the world; (we die and we live) they meant: the fathers die and the sons live, (and naught destroyeth us save time) i.e. the length of nights, days, months, and hours; (when they have no knowledge) proof or argument (whatsoever of (all) that) which they say; (they do but guess) they only guess when they say this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا سكن لنا غيرها { وَ } بالجملة: { مَا يُهْلِكُنَآ } ويميتنا فيها { إِلاَّ ٱلدَّهْرُ } أي: مر الزمان وكر الأعوام\n لا فاعل سواه\n ولا متصرف إلا هو { وَ } الحال أنه { مَا لَهُمْ بِذَلِكَ } الذي صدر عنهم { مِنْ عِلْمٍ } عقلي أو نقلي أو كشفي بل أن { إِنْ هُمْ } أي: ما هم باعتقادهم هذا { إِلاَّ يَظُنُّونَ } [الجاثية: 24] ظنَّا على وجه التقليد والتخمين بلا سند لهم يستندون إليه\n سوى الأُلف بالمسحوسات والتقليد بالرسوم والعادات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقالوا } من غاية غيهم وضلالهم: { ما هيَ } أي: ما الحياة لأنهم وُعِدُوا حياة ثانية\n { إِلا حياتُنا الدنيا } التي نحن فيها\n { نموت ونحيا } أي: يُصيبنا الموت والحياة فيها\n وليس وراء ذلك حياة\n أو: نموت بأنفسنا ونحيا ببقاء أولادنا\n أو: يموت بعض ويحيا بعض\n أو: نكون مواتاً نطفاً في الأصلاب\n ونحيا بعد ذلك\n وقيل: هذا كلام مَن يقول بالتناسخ\n فإنه عقيدة أكثر عبدة الأوثان\n أي: يموت الرجل\n ثم تجعل روحه في شبح آخر\n فيحيا به\n وهو باطل عند أهل الإسلام\n ثم قالوا: { وما يُهكنا إِلا الدهرُ } إلا مرور الزمان وهو في الأصل: مدة بقاء العالم\n من: دهَرهُ: إذا غَلَبه\n وكانوا يزعمون أن مرور الزمان بالليالي والأيام هو المؤثِّر في هلاك الأنفس\n وينكرون ملك الموت\n وقبضه الأرواحَ بأمر الله تعالى\n وكانوا يُضيفون كلَّ حادثة تحدثُ إلى الدهر والزمان\n كما قال شاعرهم:\nومنه قول تُبع الأكبر\n أو غيره:\nفإن كان تُبَّعاً المتقدم فنسبة الفعل إلى الدهر مجاز\n كما سيأتي\n وعقيدة الموحدين ألاَّ فاعل إلا الله\n فالدهر مُسخّر بأمر الله وقدرته\n بل هو من أسرار الله وأنوار صفاته\n ولذلك قال صلى الله عليه وسلم:\n \" لا تسبُّوا الدهر\n فإن الله هو الدهر \" \nوقال صلى الله عليه وسلم:\n \" قال الله تعال: يُؤذيني ابنُ آدم\n يَسُبُّ الدَّهر\n وأنا الدهر\n بيدي الأمر\n أُقلّب الليلَ والنهارَ \" \nفالأمور كلها بيد الله\n والدهر إنما هو مظهر لعجائب القدرةن كما قال أبو علي الثقفي رضي الله عنه:\nوقد ينسب أهل التوحيد الفعلَ إلى الدهر مجازاً\n تغزُّلاً\n في أشعارهم\n كما قال عبد الملك بن مروان\n حين ضعف حالُه:\nقال تعالى: { وما لهم بذلك من علم } أي: ليس لهم بما ذكر من اقتصار الحياة على ما في الدنيا\n وإسناد التأثير إلى الدهر\n { من علم } يستند إلى عقل ولا نقل\n { إِن هم إِلا يظنون } ما هم إلا قوم قصارى أمرهم الظن والتقليد\n هذا معتقدهم الفاسد في أنفسهم\n\n{ وإِذا تُتلى عليهم آياتنا } الناطقة بالحق\n الذي من جملته البعث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:1",
      "similarity": 0.8939961049709012
    },
    {
      "verse": "23:37",
      "similarity": 0.08154527790052703
    },
    {
      "verse": "53:28",
      "similarity": 0.0763750544439834
    },
    {
      "verse": "10:36",
      "similarity": 0.07327959948755833
    },
    {
      "verse": "26:186",
      "similarity": 0.07131701819677559
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}