{
  "chapter": "الجاثية",
  "text": "افرءيت من اتخذ الهه هوىه واضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشوة فمن يهديه منۢ بعد الله افلا تذكرون",
  "translations": [
    {
      "translation": "Have you seen him who takes his whims and desires to be his god - whom Allah has misguided knowingly, sealing up his hearing and his heart and placing a blindfold over his eyes? Who then will guide him after Allah? So will you not pay heed?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just think: Who apart from God can show the way to him who deifies his ego into his god, whom God allows to go astray knowingly, and seals his ears and heart, and covers over his eyes with a veil? Why then do you not contemplate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you ever consider the case of him who took his desire as his god, and then Allah caused him to go astray despite knowledge, and sealed his hearing and his heart, and cast a veil over his sight? Who, after Allah, can direct him to the Right Way? Will you not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen the one who has chosen his desires as his lord? God has knowingly caused him to go astray, sealed his ears and heart and veiled his vision. Who besides God can guide him? Will they, then, not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just look at him who makes his desire as his God, and Allah has sent him astray despite his having knowledge, and set a seal upon his ears and his heart, and a covering upon his eyes; so who will guide him after Allah? So do you not ponder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen him who takes his own lust as his god And Allah, left him astray with knowledge, and sealed his hearing and his heart, and put a cover on his sight. Who then will guide him after Allah Will you not then remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you then considered him who takes his low desire for his god, and Allah has made him err having knowledge and has set a seal upon his ear and his heart and put a covering upon his eye. Who can then guide him after Allah? Will you not then be mindful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou seen him who has taken his caprice to be his god, and God has led him astray out of a knowledge, and set a seal upon his hearing and his heart, and laid a covering on his eyes? Who shall guide him after God? What, will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou seen him who maketh his desire his god, and Allah sendeth him astray purposely, and sealeth up his hearing and his heart, and setteth on his sight a covering? Then who will lead him after Allah (hath condemned him)? Will ye not then heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Prophet], consider the one who has taken his own desire as a deity, whom God allows to stray in the face of knowledge, sealing his ears and heart and covering his eyes -- who can guide such a person after God [has abandoned him]? Will you not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou him who taketh for his god his own vain desire, and Allah hath sent him astray despite his knowledge, and hath sealed up his hearing and his heart, and hath set on his sight a covering? Who will guide him after Allah? Will ye not then be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen him who has taken his desire to be his god and whom Allah has led astray knowingly, set a seal upon his hearing and heart, and put a blindfold on his sight? So who will guide him after Allah [has consigned him to error]? Will you not then take admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then seest thou such a one as takes as his god his own vain desire? Allah has, knowing (him as such), left him astray, and sealed his hearing and his heart (and understanding), and put a cover on his sight. Who, then, will guide him after Allah (has withdrawn Guidance)? Will ye not then receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen him who takes his own lust (vain desires) as his ilah (god), and Allah knowing (him as such), left him astray, and sealed his hearing and his heart, and put a cover on his sight. Who then will guide him after Allah? Will you not then remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen he who took his desire for a god? With knowledge, Allah has led him astray, setting a seal upon his hearing and heart, and has made a veil over his eyes, who then shall guide him after Allah? Will you not then remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you considered him who has taken his desire for his god? God has knowingly led him astray, and has sealed his hearing and his heart, and has placed a veil over his vision. Who will guide him after God? Will you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen he who has taken as his god his [own] desire, and Allah has sent him astray due to knowledge and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allah? Then will you not be reminded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:23]   Have you then seen, inform Me [about], him who has taken as his god his [own] desire, [that is] whatever [new] stone he may desire after [having desired] some other stone, considering this [new one] to be better, and whom God has led astray knowingly, on His part, exalted be He, that is to say, knowing him to be of those who follow misguidance before he was created, and set a seal upon his hearing and his heart, so that he cannot hear guidance or understand it, and laid a covering, a darkness, over his sight?, so that he cannot perceive guidance (here one should understand as implied the second direct object of [the verb] a-ra’ayta, ‘have you seen’, namely: a-yahtadī, ‘can he find guidance?). So who will guide him after God?, that is to say, after His leading him astray? In other words, he will not find guidance. Will you not then remember?, [will you not then] be admonished? (tadhakkarūna: one of the two tā’ letters [of the original form tatadhakkarūna] has been assimilated with the dhāl).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou seen) Muhammad (him who maketh his desire his god) the one who worships a deity because of the whim of his ego; whenever his ego desires something, he worships it-this refers to al-Nadr Ibn al- Harith-and it is also said that this refers to Abu Jahl; as it is said that this refers to al-Harith Ibn Qays, (and Allah sendeth him astray) from faith (purposely) as Allah knows he is among the folk of error, (and sealeth up his hearing) and Allah places a covering on his hearing so that he does not hear the Truth (and his heart) and a covering on his heart so that he does not understand the Truth, (and setteth on his sight a covering) and places a covering on his sight so that He does not see the Truth? (Then who will lead him) who will guide him to the religion of Allah (after Allah) has sent him astray? (Will ye not then heed) by means of the Qur'an and understand that Allah is one, without partners?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَرَأَيْتَ مَنِ ٱتَّخَذَ إِلَـٰهَهُ هَوَاهُ } قال: كانَ الرَّجلُ يَعبدُ الحَجَر الأَبيضَ زَماناً فِي الجَاهليةِ، فيَجدُ حَجراً أحسنَ منهُ فَيعبدُ الآخرَ ويَترك الأَولَ\n\n",
      "translations": [
        {
          "translation": "\n\nHave you seen the one who has taken his own desires as his god? He was worshipping a white stone in the time of ignorance, but then he found a better stone and started worshipping that one instead, leaving the first stone behind.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أفرأيت من اتَّخذ إلهه هواه } الإله المعبود ولما أطاعوا الهوى فقد عبدوه وجعلوه إلهاً\n إذ كل ما يعبد الإنسان بمحبته وطاعته فهو إلهه ولو كان حجراً { وأضلّه الله } عالماً بحاله من زوال استعداده وانقلاب وجهه إلى الجهة السفلية أو مع كون ذلك العابد للهوى عالماً بعلم ما يجب عليه فعله في الدين على تقدير أن يكون على علم حالاً من الضمير المفعول في { أضله الله } لا من الفاعل وحينئذ يكون الإضلال لمخالفته علمه بالعمل وتخلف القدم عن النظر لتشرب قلبه بمحبة النفس وغلبة الهوى كحال بلعام بن باعورا وأضرابه كما قال عليه السلام:\n \" كم من عالم ضلّ ومعه علمه لا ينفعه \" \nأو على علم منه غير نافع\n لكونه من باب الفضول لا تعلق له بالسلوك { وخَتَم على سمعه وقلبه } بالطرد عن باب الهدى والإبعاد عن محل سماع كلام الحق وفهمه لمكان الرين وغلظ الحجاب { وجَعَل على بَصَره غشاوة } عن رؤية جماله وشهود لقائه { فمن يهديه من بعد الله } إذ لا موجود سواه يقوم بهدايته { أفلا تَذّكرون } أيها الموحدون { ما هي إلاَّ حياتنا الدنيا } أي: الحسيّة { نموت } بالموت البدني الطبيعي { ونحيى } الحياة الجسمانية الحسيّة لا موت ولا حياة غيرهما ولا ينسبون ذلك إلا إلى الدهر لاحتجابهم عن المؤثر الحقيقي القابض للأرواح والمفيض للحياة على الأبدان\n { قل الله يحييكم ثم يميتكم } لا الدهر { ثم يجمعكم } إليه بالحياة الثانية عند البعث\n أو الله يحييكم لا الدهر بالحياة الأبدية القلبية بعد الحياة النفسانية ثم يميتكم بالفناء فيه ثم يجمعكم إليه بالبقاء بعد الفناء والوجود الموهوب لتكونوا به معه\n { ولله مُلْك السَّموات والأرض } لا مالك غيره في نظرالشهود { ويوم تقوم } القيامة الكبرى { يخْسَر } الذين يثبتون الغير إذ كل ما سواه باطل ومن أثبته واحتجب به عنه مبطل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكيف أطاع من يتمناه وعبد إلى ما يحبه ويرضاه ولم يفوض أمره إلى مولاه { وَ } ما ذلك إلا أن { أَضَلَّهُ ٱللَّهُ } العليم الحكيم باسمه المذل المضل مع أنه أظهره سبحانه { عَلَىٰ } صورة ذي { عِلْمٍ } وجبله على فطرة أولى المعرفة والتوحيد { وَخَتَمَ عَلَىٰ سَمْعِهِ } لئلا يسمع كلامه الحق من أهله { وَخَتَمَ } أيضاً { وَقَلْبِهِ } لئلا يتفكر في آيات الله ودلائل توحيده { وَجَعَلَ عَلَىٰ بَصَرِهِ غِشَاوَةً } غليظة وغطاء كثيفاً\n لئلا يعتبر من عجائب مصنوعاته سبحانه وغرائب مخترعاته\n مع انه خلقه سبحانه كذلك { فَمَن يَهْدِيهِ } ويرشده أي: ينقذه من الضلال { مِن بَعْدِ } إضلال { ٱللَّهِ } إياه وإذلاله { أَفَلاَ تَذَكَّرُونَ } [الجاثية: 23] وتتفطنون من تبدل أحواله أيها العقلاء المجبولون على فطرة العبرة والعظة من غاية غوايتهم وضلالهم\n عن مقتضى كمال قدرة الله\n وعدم تنبههم وتفطنهم بوحدة ذاته\n وكمال أسمائه وصفاته\n واستقلاله في تدبيراته وتصرفاته\n\n\n{ وَقَالُواْ } منكرين الحشر والنشر: { مَا هِيَ } أي: ما الحال والحياة { إِلاَّ حَيَاتُنَا ٱلدُّنْيَا نَمُوتُ وَنَحْيَا } فيها لا منزل لنا سواها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { أفرأيتَ مَن اتخذ إِلهَهُ هواه } أي: أباح لنفسه كل ما تهواه، سواء كان مباحاً أو غير مباح، فكأنه يعبده كما يعبد الرجل إلهه، وإليه أشار في المباحث بقوله:\nفالآية وإن نزلت في هوى الكفر فهي متناولة لكل هوى النفس الأمَّارة، قال ابن جبير: نزلت في قريش والعرب، كانوا يعبدون الحجارة والذهب والفضة، فإذا وجدوا شيئاً أحسن أَلْقَوه وعبدوا غيره. هـ. ومتابعة الهوى كلها مذمومة، فإن كان ما هوته مُحرّماً أفضى بصاحبه إلى العقاب، وإن كان مباحاً بقي صاحبه في غم الحجاب وسوء الحساب، وأسْرِ نفسه وكدِّ طبعه. وفي الحديث عنه صلى الله عليه وسلم:\n \" ما عُبد تحت السماء أبغض إلى الله تعالى من هوى \" \n، وقال صلى الله عليه وسلم:\n \" ثلاثٌ مهلكات شحٌّ مطاع، وهوىً متبع، وإعجابُ المرء بنفسه \" \nوقال أيضاً:\n \" الكيِّسُ مَن دان نفسه، وعَمِلَ لما بعد الموت، والعاجز مَن أَتبع نفسَه هواها، وتمنَّى على الله \" \n، وسيأتي في الإشارة تمامه. ثم قال تعالى: { وأضلَّه اللّهُ على علم } أي: خذله على علم منه، باختياره الضلالة، أي: عالماً بضلاله، وتبديله لفطرة الله التي فطر الناس عليها. وقيل: نزلت في أمية بن أبي الصلت، وكان عنده علم بالكتب المتقدمة، فكان ينتظر بعثة الرسول صلى الله عليه وسلم، فلما ظهر، قال: ما كنتُ لأومن لرسول ليس من ثقيف، وأشعاره محشوة بالتوحيد، ولكن سبق له الشقاء، فلم يؤمن، وختم على سمعه فلا يقبل وعظاً وقلبه، فلا يعتقد حقاً أي: لا يتأثر بالمواعظ، ولا يتكفّر في الآيات والنُذر. { وجَعَلَ على بصره غشاوةً } أي: ظلمة مانعة نم الاعتبار والاستبصار، { فمَن يهديه من بعدِ الله } من بعد إضلال الله إياه؟ { أفلا تَذَكَّرون } أفلا تتعظون، فتُسلمون الأمور إلى مولاها، يُضل مَن يشاء ويهدي مَن يشاء. الإشارة: حقيقة الهوى كل ما تعشقه النفس، وتميل إليه من الحظوظ العاجلة، ويجري ذلك في المآكل، والمشارب، والملابس، والمناكح، والجاه، ورفع المنزلة، فليجاهد العبد نفسه في ترك ذلك كله، حتى لا تحب إلا ما هو طاعة يقرب إلى الله، كما قال صلى الله عليه وسلم:\n \" لا يؤمنُ أحدكُم حتى يكون هواه تابعاً لما جئتُ به \" \nفإن كان في طريق الإرادة والتربية ترك كل ما تميل إليه نفسه وتسكن إليه، ولو كان طاعة، كما قال البوصيري رضي الله عنه:\nفإنَّ حلاوة الطاعة سموم قاتلة، يمنع الوقوف معها من الترقي إلى حلاوة الشهود ولذة المعرفة، وكذلك الركون إلى الكرامات، والوقوف مع المقامات، كلها أهوية تمنع مما هو أعلى منها من مقام العيان، فلا يزل المريد يُجاهد نفسه، ويرحلها عن هذه الحظوظ، حتى تتمحّض محبتها في الحق تعالى، فلا يشتهي إلا شهود ذاته الأقدس، أو ما يقضيه عليه، فإذا ظهر بهذا المقام لم تبقَ له مجاهدة ولا رياضة، وكان ملكاً حرّاً، فيقال له حينئذ:\n\nوطريق السير في هذا أن يُساس نفسه شيئاً فشيئاً، يمنعها من المكروهات، ثم من المباحات شيئاً فشيئاً، حتى تستأنس، يترك شهوة ثم أخرى، وهكذا، وأما لو منعها الكل دفعة واحدة فربما تمل وتسقط، وقد قال عليه الصلاة والسلام:\n \" لا يكن أحدكم كالمُنبت، لا أرضاً قَطَع، ولا ظهراً أبقى \" \nوإلى هذا أشار في المباحث، حيث قال:\nوأعظم الحظوظ حُب الجاه والتقدُّم، فلا يسامحها المريد في شيء من ذلك قط، ولينزل بها إلى الخمول والسفليات، وأما شهوة البطن والفرج، فما تشوّفت إليه النفس من ذلك فليمنعها منها كليّاً، وما أتاها من غير حرص ولا تشوُّف فليأخذ منه قدر الحاجة، مع الشكر عيله، هكذا يسير حتى يتحقق وصوله، ويتمكن من معرفة الحق، وحينئذ فلا كلام معه، كما تقدّم، ولا بد من صُحبة شيخ عارف كامل، يلقيه زمام نفسه، فيحمله بهمته، وإلا فلا طاقة على مجاهدتها أصلاً، وجَرَّب ففي التجريب علم الحقائق. قال القشيري: مَن لم يَسْلك سبيلَ الاتباع، ولم يستوفِ أحكام الرياضة، ولم ينسلخ عن هواه بالكلية، ولم يؤدبَه إمامٌ مُقتدًى به، فهو ينحرفُ في كل وَهْدةٍ، ويهيمُ في كل ضلالة، ويضلُّ في كل فجٍّ، خسرانه أكثر من ربحه، ونقصانه أوفر من رجحانه، أولئك في ضلال بعيد، زِمامُهم بيد هواهم، أولئك أهل المكر، استْتُدرِجُوا وما يشعرون. هـ. وفي الحِكَم: \" لا يخاف أن تلتبس الطرق عليك، وإنما يخاف من غلبة الهوى عليك \". فمَن غَلَبَه الهوى غَلَبَه الوجود بأسره، وتصرّف فيه، أحبّ أم كَرِهَ، ومَن غلب هواه غلب الوجودَ بأسره، وتصرّف فيه بهمته كيف شاء. حكي عن أبي عمران الواسطي، قال: انكسرت بنا السفينة، فبقيت أنا وامرأتي على ألواح، وقد وَلَدَتْ في تلك الليلة صبية، فصاحت بي، وقالت: يقتلني العطش، فقتل: هو ذا يرى حالنا، فرفعتُ رأسي، فإذا رجل جالس في يده سلسلة من ذهب، فيها كوز من ياقوت أحمر، فقال: هاك اشربا، فأخذتُ الكوز، فشربنا، فإذا هو أطيب من المسك، وأبرد من الثلج، وأحلى من العسل، فقلتُ: مَن أنتَ؟ فقال: أنا عبد لمولاك، فقلت: بِمَ وصلتَ إلى هذا؟ فقال: تركت هواي لمرضاته، فأجلسني في الهواء، ثم غاب ولم أره. هـ. وقال سهل رضي الله عنه: هواك داؤك، فإن خالفته فدواؤك، وقال وهب: إذا عرض لك أمران وشككت في خيرهما، فانظر أبعدهما من هواك فأته.\nهـ. ومثله في الحِكَم: \" إذا التبس عليك أمران، فانظر أثقلهما على النفس، فاتبعه، فإنه لا يَثْقُل عليها إلا ما كان حقاً \". فالعز كله في مخالفة الهوى والذل والهوان كله في متابعة الهوى، فنُونُ الهوان سُرقت من الهوى، كما قال الشاعر:\nوقال آخر:\nوقال ابن المبارك:\nولابن دُريد:\nوقال أبو عُبيد الطوسي:\nهذا، وللآية إشارة أخرى، رُويت عن بعض مشايخنا، قال: يمكن أن تكون الآية مدحاً، يقول تعالى: { أفرأيت من اتخذ إلهه } وهو الله تعالى، ومحبوبَه وهواه، لا يهوى معه غيره، وأضله الله، في محبته، على علم منه بالله، وختم على سمعه وقلبه وبمحبته، فلا يسمع إلا منه، ولا يُحب غيره، وجعل على بصره غشاوة، فلا يرى سواه، فمَن يهديه هذه الهداية العظمى من بعد الله، وهذا يُسلّم في طريق الإشارة، لأنها خارجة عن سياق العبارة، وللقرآن أسرار باطنة، يعرفها أهل الباطن فقط، فسلِّم تَسْلَمْ. ثم ذكر مقالة أهل الأهواء والضلال، فقال: { وَقَالُواْ مَا هِيَ إِلاَّ حَيَاتُنَا ٱلدُّنْيَا نَمُوتُ وَنَحْيَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:7",
      "similarity": 0.8371850401035805
    },
    {
      "verse": "83:26",
      "similarity": 0.5999793405186673
    },
    {
      "verse": "33:40",
      "similarity": 0.5677504763707243
    },
    {
      "verse": "36:65",
      "similarity": 0.4885454575204274
    },
    {
      "verse": "6:46",
      "similarity": 0.38771147266411093
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/45:23.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/45:23.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/45:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}