{
  "chapter": "الجاثية",
  "text": "واذا تتلى عليهم ءايتنا بينت ما كان حجتهم الا ان قالوا۟ ائتوا۟ بـابائنا ان كنتم صدقين",
  "translations": [
    {
      "translation": "When Our Clear Signs are recited to them their only argument is to say, 'Bring us our fathers if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are recited to them, their only argument is to say: \"Bring our ancestors back, if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Signs are rehearsed to them, their only contention is: “Bring back to us our fathers if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our enlightening revelations are recited to them, their only argument against it is, \"Bring our forefathers back to life if what you say is true\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear verses are recited to them, their only argument is, “Bring back our forefathers, if you are truthful!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Ayat are recited to them, their argument is no other than that they say: \"Bring back our (dead) fathers, if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear communications are recited to them, their argument is no other than that they say: Bring our fathers (back) if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our signs are recited to them, clear signs, their only argument is that they say, 'Bring us our fathers, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear revelations are recited unto them their only argument is that they say: Bring (back) our fathers. then, if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our clear revelations are recited to them, their only argument is to say, \"Bring back to us our forefathers, if what you say be true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our manifest revelations are rehearsed Unto them, their argument is no other than that they say bring our fathers, if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our manifest signs are recited to them, their only argument is to say, ‘Bring our fathers back [to life], if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Signs are rehearsed to them their argument is nothing but this: They say, \"Bring (back) our forefathers, if what ye say is true!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, their argument is no other than that they say: \"Bring back our (dead) fathers, if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them, their only argument is: 'Bring our fathers back to us, if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clarifying Verses are recited to them, their only argument is to say, “Bring back our ancestors, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them as clear evidences, their argument is only that they say, \"Bring [back] our forefathers, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:25] And when Our signs, of the Qur’ān, indicating Our power to resurrect, are recited to them, being clear signs, evident [signs] (bayyinātin, ‘clear signs’, is a circumstantial qualifier), their only argument is to say, ‘Bring us our fathers, alive, if you are being truthful’, [when you say] that we will be resurrected.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our clear revelations) explaining the commands and prohibitions (are recited unto them) to Abu Jahl and his host (their only argument) and excuse to Muhammad (pbuh) (is that they say: Bring (back) our fathers then) do bring, Muhammad, our fathers back to life so that we may ask them whether what you say is true or false, (if ye are truthful) that we will be resurrected again after we die.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من نهاية جهلهم وغفلتهم عن الله وعن مقتضى ألوهيته وربوبيته { إِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَٰتُنَا } الدالة على كمال تربيتنا إياهم مع كونها { بَيِّنَاتٍ } مبينات لهم طريق الهداية والرشاد، منبهات لهم إلى معياد المعاد { مَّا كَانَ حُجَّتَهُمْ } حين سمعوها { إِلاَّ أَن قَالُواْ } على سبيل الإنكار والاستبعاد { ٱئْتُواْ بِآبَآئِنَآ } وأسلافنا الذين مضوا وانقرضوا أحياء كما كانوا { إِن كُنتُمْ صَادِقِينَ } [الجاثية: 25] في دعوى الحشر والنشر والميعاد الجسماني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وإِذا تُتلى عليهم آياتنا } الناطقة بالحق، الذي من جملته البعث، { بيناتٍ } واضحات الدلالة على ما نطقت به، أو مبينات له، { ما كان حُجَّتَهم } ما كان متمسكاً لهم شيء من الأشياء، { إِلا أن قالوا ائتوا بآبائنا إِن كنتم صادقين } في أنَّا نُبعث بعد الموت أي: لا شبهة لهم إلا هذا القول الباطل، الذي يستحيل أن يكون من قبيل الحُجة، أي: ليس لهم حُجة إلا العناد والاستبعاد\n وتسميته حُجة إما لسوقهم إياه مساق الحُجة في زعمهم، أو تهكماً بهم، كقول القائل: \" تحية بينهم ضرب وجيع \"\n قال ابن عرفة: { وإذا تتلى عليهم\n\n\n } الآية، أي: إنهم مع كونهم ظانين فَهُم بحيث لو استدل لهم لما ازدادوا إلا ضلالاً، وقد تقرّر في علم الجدل أن المصمم على الشيء يصعب نقله عنه، بخلاف الظان والشك، فأتت هذه الآية نفياً لما يتوهم في هؤلاء أنهم حيث لا يقين عندهم يسهل رجوعهم، حين تظهر الحجة\n هـ\n ومَن نَصَبَ \" حجتهم \" فخبر كان، ومَن رفعه فاسمها\n الإشارة: قال القشيري: { وقالوا ما هي إلا حياتنا الدنيا\n\n\n } الآية، اغترُّوا بما وجدوا عليه خَلَفَهم، وأَرْخوا في البهيمية عَنَانهم وعُمْرَهم، وأغفوا عن ذكر الفكرة قلوبَهم، فلا بالعلم استبصروا، ولا من الحقائق استمدوا، رأسُ مالهم الظن، وهم غافلون، وإذا تتلى عليهم الآيات طلبوا إحياء موتاهم، وسوف يرون ما استبعدوا\n هـ\n ثم قرر البعث الذي أنكروه، فقال: { قُلِ ٱللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:66",
      "similarity": 0.5446306195250055
    },
    {
      "verse": "6:149",
      "similarity": 0.4873690437078191
    },
    {
      "verse": "4:165",
      "similarity": 0.47454425036271525
    },
    {
      "verse": "2:139",
      "similarity": 0.4697005497152174
    },
    {
      "verse": "6:80",
      "similarity": 0.4236587473192037
    }
  ]
}