{
  "chapter": "الجاثية",
  "text": "هذا بصئر للناس وهدى ورحمة لقوم يوقنون",
  "translations": [
    {
      "translation": "This is clear insight for mankind and guidance and mercy for people with certainty.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are precepts of wisdom for men, and guidance and grace for people who believe with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the lights of discernment for people and guidance and mercy for those endowed with sure faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is an enlightenment for the people and a guide and mercy for the people who have strong faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an enlightenment for mankind, and a guidance and mercy for the people of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a clear insight and evidence for mankind, and a guidance and a mercy for people who have faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are clear proofs for men, and a guidance and a mercy for a people who are sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is clear proofs for men, and a guidance, and a mercy to a people having sure faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is clear indication for mankind, and a guidance and a mercy for a folk whose faith is sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This [Book] brings enlightenment and guidance to mankind, and is a blessing for those who have firm faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book is an enlightenment Unto mankind and a guidance, and a mercy Unto a People who are convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are eye-openers for mankind, and guidance and mercy for a people who have certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are clear evidences to men and a Guidance and Mercy to those of assured Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is a clear insight and evidence for mankind, and a guidance and a mercy for people who have Faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are clear proofs for people, a guidance, and mercy for those who are certain (of the Resurrection) in belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an illumination for mankind, and guidance, and mercy for people who believe with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This [Qur'an] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:20] This, Qur’ān, is [a set of] insights for mankind, guideposts with which they can discern [God’s] rulings and legal proscriptions, and guidance and mercy for a people who have certainty, with regard to the [truth of the] Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n.هَذَا بَصَائِرُ لِلنَّاسِ وَهُدًى وَرَحْمَةٌ لِقَوْمٍ يُوقِنُونَ (20)إن كانت الإشارة إلى الكلام المتقدم وما فيه من ضرب المثل بموسى وقومه ومن تفضيل شريعة محمد على شريعة موسى عليهما الصلاة والسلام والأمر بملازمة اتباعها والتحذير من اتباع رغائب الذين لا يعلمون ، فهذه الجملة بمنزلة التذييل لما قبلها والتهيئةِ لأغراضها تنبيهاً لما في طيها من عواصمَ عن الشك والباطل بمنزلة قوله تعالى بعد عدة آيات في آخر سورة الأحقاف ( 35 ) { بلاغ } وقوله في سورة الأنبياء ( 105 ، 106 ) { ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحونإن في هذا لبلاغاً لقوممٍ عابدين } وإن كانت الإشارة إلى القرآن إذ هو حاضر في الأذهان كانت الجملة استئنافاً أعيد بها التنويه بشأن القرآن ومتبعيه والتعريضُ بتحميق الذين أعرضوا عنه ، وتكون مفيدة تأكيد قوله آنفاً { هذا هدىً والذين كفروا بآيات ربّهم لهم عذابٌ من رجزٍ أليم } \\[ الجاثية : 11 \\] ، وتكون الجملة المتقدمة صريحة في وعيد الذين كفروا بآياته وهذه تعريضاً بأنهم لم يَحْظَواْ بهذه البصائر ، وكلا الاحتمالين رشيق ، وكل بأن يكون مقصوداً حقيق .و { بصائر } : جمع بصيرة وهي إدراك العقل الأمور على حقائقها ، شبهت ببصر العين ، وفرق بينهما بصيغة فعلية للمبالغة قال تعالى : { أدْعو إلى الله على بصيرةٍ أنا ومَن اتّبعني } في سورة يوسف ( 108 ) . وقال : { قال لقد علمتَ ما أنزل هؤلاء إلا ربّ السماوات والأرض بصائر } في سورة الإسراء ( 102 ) وقوله : { ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى بصائر للناس } في سورة القصص ( 43 ) .ووصف الآيات السابقة أو القرآن بالبصائر مجاز عقلي لأن ذلك سبب البصائر . وجمع البصائر : إن كانت الإشارة إلى القرآن باعتبار المتبصرين بسببه كما اقتضاه قوله : للناس } لأن لكل أحد بصيرته الخاصة فهي أمر جزئي بالتبع لكَون صاحببِ كل بصيرة جزئياً مشخصاً فناسب أن تُورد جمعاً ، فالبصيرة : الحاسَّة من الحواس الباطنة ، وهذا بخلاف إفراد { هدى ورحمة } لأن الهدى والرحمة معنيان كليان يصلحان للعدد الكثير قال تعالى : { هدى للناس } \\[ آل عمران : 4 \\] وقال : { وما أرسلناك إلا رحمةً للعالمين } \\[ الأنبياء : 107 \\] . وإنما كان هدى لأنه طريق نفع لمن اتبع إرشاده فاتباعه كالاهتداء للطريق الموصلة إلى المقصود . وإنّما كان رحمة لأن في اتباع هديه نجاح الناس أفراداً وجَماعاتتٍ في الدنيا لأنه نظام مجتمعهم ومناط أمنهم ، وفي الآخرة لأنه سبب نوالهم درجات النعيم الأبدي . وكان بصائر لأنه يبين للناس الخير والشر ويحَرضهم على الخير ويحذرهم من الشر ويعدهم على فعل الخير ويوعدهم على فعل الشرور فعمله عمل البصيرة .وجُعل البصائر للناس لأنه بيان للناس عامة وجعل الهدى والرحمة لقوم يوقنون لأنه لا يهتدي ببيانه إلا الموقن بحقيقته ولا يرحم به إلا من اتبعه المؤمن بحقيته .وذكر لفظ ( قوم ) للإيماء إلى أن الإيقان متمكن من نفوسهم كأنه من مقومات قوميتهم التي تميزهم عن أقوام آخرين .والإيقان : العلم الذي لا يتردد فيه صاحبه . وحذف متعلقه لأنه معلوم بما جاءت به آيات الله .\n\n",
      "translations": [
        {
          "translation": "(This) Qur'an (is clear indication for mankind, and a guidance) from error (and a mercy) preventing from chastisement (for a folk whose faith is sure) for people who believe in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَـٰذَا } الذي ذكر في كتابك من الأخلاق المرضية\n والمنبهة على القسط الحقيقي والعدل الإلهي { بَصَائِرُ لِلنَّاسِ } يبصرهم طريق الهداية\n ويوصلهم إلى التوحيد الذاتي\n إن استقاموا عليها بالعزيمة الصادقة الصحيحة { وَهُدًى } يهديهم إلى سواء السبيل { وَرَحْمَةٌ } نازلة من قبل الحق { لِّقَوْمٍ يُوقِنُونَ } [الجاثية: 20] يوفقون للإيمان والإيقان والكشف والعيان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هذا بصائرُ للناس } أي: هذا القرآن واتباع الشريعة بصائر لقلوب الناس\n كما جُعل روحاً وحياة لها\n فإنَّ مَن تمسك بالكتاب والسنّة\n وأمعن فيها النظر\n وعمل بمقتضاهما\n فُتحت بصيرته\n وحيي قلبُه\n { وهُدىً } من الضلالة { ورحمةٌ } من العذاب { لقوم يوقون } لمَن كَمُلَ إيمانه وإيقانه بالأمور الغيبية\n الإشارة: الشريعة لها ظاهر وباطن\n وهو لُبها وخالصها\n فالعامة أخذوا بظاهرها\n فأخذوا بكل ما يُبيحه ظاهرالشريعة من الرخص والسهولة\n ولا نظر عندهم لقلوبهم من النقص والزيادة\n والخاصة أخذوا بباطنها\n فأخذوا منها بالمُهم\n وتركوا كل ما يَفتنهم أو ينقص من نور إيقانهم\n فوصلوا بذلك إلى حضرة ربهم\n فيقال للمريد: ثم جعلناك على طريقة واضحة من أمر الخاصة\n فاتبعها\n ولا تتبع أهواء الذين لا يعلمون ما يزيد في قلوبهم وما ينقص\n إنهم لن يغنوا عنك من الله شيئاً إن أبعدك بميلك إليهم واتباع أغراضهم\n قال القشيري: { إنهم لن يُغنوا عنك من الله شيئاً } إن أراد بك نعمة\n فلا يمنعُها أحد\n وإن أراد بك فتنة فلا يصرفها عنك أحد\n فلا تُعلِّقْ بمخلوقٍ فكرك\n ولا توجه ضميرك إلى شيء\n وثِقْ به\n وتوكلْ عليه\n هـ\n وأهل الغفلة بعضهم أولياء بعض\n يتوالون على حظوظ الدنيا وشهواتها\n { والله وليُّ المتقين } الذي اتقوا كل ما يشغل عن الله\n { هذا بصائر للناس } أي: سبب فتح بصائرهم\n { وهُدى } أي: إشارة لطريق الوصول\n ورحمة للأرواح والقلوب\n لقوم يوقنون\n أي: لأهل اليقين الكبير\n قال القشيري: { هذا بصائرُ للناس } أنوار البصيرة إذا تلألأت انكشفت دونهما تهمةُ التجويز\n ونظرُ الناس على مراتب\n مَن نظر بنور نجومه\n فهو صاحب عقل\n ومَن نظر بنور فراسته فهو صاحب ظن\n يُقَوِّيه لوْحُ\n لكنه من وراء ستر\n ومَن نظر بيقين فهو على تحكُّم برهان\n ومَن نظر بعين إيمان فهو بوصف اتباع\n ومَن نظر بنور بصيرة\n فهو على نهار\n وشمسه طالعة\n وشمسه عن السحاب مصيحة\n هـ\n ثم بَيّن حال مَن لا يرجو أيام الله ومَن يرجوه\n فقال: { أَمْ حَسِبَ ٱلَّذِينَ ٱجْتَرَحُواْ ٱلسَّيِّئَاتِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:95",
      "similarity": 0.7710130621452354
    },
    {
      "verse": "69:51",
      "similarity": 0.7338638325162216
    },
    {
      "verse": "51:20",
      "similarity": 0.7304384174230563
    },
    {
      "verse": "74:47",
      "similarity": 0.6916462609532055
    },
    {
      "verse": "44:7",
      "similarity": 0.6873707278959694
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}