{
  "chapter": "الجاثية",
  "text": "وخلق الله السموت والارض بالحق ولتجزى كل نفسۭ بما كسبت وهم لا يظلمون",
  "translations": [
    {
      "translation": "Allah created the heavens and earth with truth so that every self might be repaid for what it earned and they will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created the heavens and the earth with reason, so that He may reward each soul in accordance with what it has done; and no wrong will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created the heavens and the earth in Truth that each person may be requited for his deeds. They shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created the heavens and the earth for a genuine purpose so that every soul will be duly recompensed for its deeds without being wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created the heavens and the earth with the truth, and so that every soul is repaid for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created the heavens and the earth with truth, in order that each person may be recompensed what he has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created the heavens and the earth with truth and that every soul may be rewarded for what it has earned and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created the heavens and the earth in truth, and that every soul may be recompensed for what it has earned; they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath created the heavens and the earth with truth, and that every soul may be repaid what it hath earned. And they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created the heavens and the earth for a true purpose, so that every soul may be rewarded for whatever it has earned, and no one will be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath created the heavens and the earth with purpose and that every soul may be recompensed for that which it hath earned. And they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created the heavens and the earth with consummate wisdom, so that every soul may be requited for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created the heavens and the earth for just ends, and in order that each soul may find the recompense of what it has earned, and none of them be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created the heavens and the earth with truth, in order that each person may be recompensed what he has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created the heavens and the earth in truth and that each soul shall be recompensed for what it earned, they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created the heavens and the earth with justice, so that every soul will be repaid for what it has earned. And they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created the heavens and earth in truth and so that every soul may be recompensed for what it has earned, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:22] And God created the heavens and, He created, the earth with the truth (bi’l-haqqi is semantically connected to khalaqa, ‘He created’), so that He may indicate His power and His Oneness, and so that every soul may be requited for what it has earned, in the way of acts of disobedience or obedience, and therefore the disbeliever cannot be equal to the believer, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah hath created the heavens and the earth with truth) for the Truth, (and that every soul) righteous or sinful (may be repaid what it hath earned) of good or evil. (And they will not be wronged) their good deeds will not be decreased and their evil works will not be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنه { خَلَقَ ٱللَّهُ } المستوى بالعدل القويم على عروش عموم المظاهر { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } ملتبسة بالحق\n أي: بالعدالة الصورية المنبئة عن العدالة المعنوية الحقيقية\n وإنما خلقها كذلك { بِٱلْحَقِّ وَلِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا كَسَبَتْ } من خير وشر\n بعدما أمر الحق بما أمر\n ونهى عن ما منهى { وَهُمْ لاَ يُظْلَمُونَ } [الجاثية: 22] في أجور أعمالهم وجزائهم زيادة ونقصاناً\n\n\n{ أَفَرَأَيْتَ } أيها المعتبر الرائي إلى { مَنِ ٱتَّخَذَ } أي: إلى الجاحد الجاهل المعاند الذي اتخذ { إِلَـٰهَهُ هَوَاهُ } أي: ما يهواه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وخلق اللّهُ السماوات والأرض بالحق } لتدل على قدرته على البعث وغيره\n قال البيضاوي: كأنه دليل على الحُكم السابق\n من حيث إن خلق ذلك بالحق المقتضي للعدل\n يقتضي انتصار المظلوم من الظالم\n والتفاوت بين المحسن والمسيء\n إذا لم يكن في المحيا كان بعد الممات\n هـ\n { ولتُجزى كلُّ نفسٍ بما كَسَبَتْ } عطف على هذه العلة المحذوفة\n أي: لتدل ولتُجزى\n أو على \" بالحق \" لأن فيه معنى التعليل إذ معناه: خلقها مقرونة بالحكمة والصواب\n دون العبث ولتُجزى\n\n\n الخ\n أو: ليعدل وتُجزى كل نفس بما كسبت\n { وهم } أي: النفوس\n المدلول عليها بكل نفس { لا يُظلمون } بنقص الثواب أو زيادة عقاب\n الإشارة: أم حَسِبَ الذين ماتوا على دنس الإصرار\n أن نجعلهم كالمطهرين الأبرار أم حسب الذين عاشوا في البطالة والتقصير أن نجعلهم كالذين عاشوا في الجد والتشمير؟ \" أم حَسِبَ الذين عاشوا في غم الحجاب\n وصاروا إلى سوء الحساب\n أن نجعلهم كالذين تهذّبوا حتى ارتفع عنهم الحجاب\n وصاروا إلى غاية الكرامة والاقتراب؟ لا استواء بينهم في المحيا ولا في الممات\n الأولون عاشوا معيشة ضنكاً\n وصاروا بعد الموت إلى الندامة والحسرة\n والآخرون عاشوا عيشة راضية\n وماتوا موتة طيبة\n وصاروا إلى كرامة أبدية\n ولهذا بكت الأكابرُ عند قراءتها\n فَرُويَ عن تميم الداري: أنه كان يُصلي ليلة عند المقام\n فبلغ هذه الآية\n فجعل يبكي ويرددها إلى الصباح\n\nوعن الفُضيل: أنه بلغها\n فجعل يبكي\n ويقول: يا فضيل! ليت شعري من أيّ الفريقين أنت؟ وعن الربيع بن خيثم: أنه قام يصلي ليلة\n فمرّ بهذه الآية\n فمكث ليلةً حتى أصبح يبكي بكاءً شديداً\n وكانت تُسمى مَبْكاة العابدين\n وسبب تسوية العاصي مع المطيع الانهماك في الهوى\n كما أبان ذلك الحق تعالى بقوله: { أَفَرَأَيْتَ مَنِ ٱتَّخَذَ إِلَـٰهَهُ هَوَاهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:17",
      "similarity": 0.5227895857572261
    },
    {
      "verse": "14:51",
      "similarity": 0.4850341245192276
    },
    {
      "verse": "2:281",
      "similarity": 0.4839784781848351
    },
    {
      "verse": "10:52",
      "similarity": 0.46535018380158005
    },
    {
      "verse": "6:129",
      "similarity": 0.456016459347702
    }
  ]
}