{
  "chapter": "الجاثية",
  "text": "وترى كل امة جاثية كل امة تدعى الى كتبها اليوم تجزون ما كنتم تعملون",
  "translations": [
    {
      "translation": "You will see every nation on its knees, every nation summoned to its Book: 'Today you will be repaid for what you did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see each community kneeling down; and each community will be summoned to its ledger (of good and evil deeds). You will receive upon that day your recompense for what you had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day you shall see every people fallen on their knees. Every people will be summoned to come forth and see its Record and will be told: “Today you shall be requited for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see all the people kneeling down. Everyone will be summoned to the Book (containing the record of their deeds). They will be told, \"On this day you will be recompensed for what you have done\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see every group down on its knees; every group will be called towards its book of deeds; “This day you will be repaid for what you did.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see each nation humbled to their knees (Jathiyah), each nation will be called to its Record (of deeds). This Day you shall be recompensed for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall see every nation kneeling down; every nation shall be called to its book: today you shall be rewarded for what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou shalt see every nation hobbling on their knees, every nation being summoned unto its Book: 'Today you shall be recompensed for that you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt see each nation crouching, each nation summoned to its record. (And it will be said unto them): This day ye are requited what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see every people on their knees, every people shall be summoned to its Record [and a voice will say], \"Today you will be requited for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou shalt behold each community kneeling; each community shall be summoned to its Book. Today, shall be recompensed for that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see every nation fallen on its knees. Every nation will be summoned to its book: ‘Today you will be requited for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt see every sect bowing the knee: Every sect will be called to its Record: \"This Day shall ye be recompensed for all that ye did!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see each nation humbled to their knees (kneeling), each nation will be called to its Record (of deeds). This Day you shall be recompensed for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall see every nation hobbling on their knees. Each nation shall be summoned to its Book. (And it will be said:) 'This Day, you shall be recompensedfor what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see every community on its knees; every community will be called to its Book: “Today you are being repaid for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], \"Today you will be recompensed for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:28] And you will see every community, that is, [all] members of a religion, crouching, on their knees — or [jāthiya means] ‘gathered together’. Every community will be summoned to its record, the record of its deeds and it will be said to them: ‘Today you will be requited for what you used to do, that is, [you will be given] the desert thereof.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n. وَتَرَى كُلَّ أُمَّةٍ جَاثِيَةً كُلُّ أُمَّةٍ تُدْعَى إِلَى كِتَابِهَا الْيَوْمَ تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ (28) والخطاب في { ترى } لكل من يصلح له الخطاب بالقرآن فلا يقصد مخاطب معين ، ويجوز أن يكون خطاباً للرسول صلى الله عليه وسلم والمضارع في { ترى } مراد به الاستقبال فالمعنى : وترى يومئذٍ .والأمة : الجماعة العظيمة من الناس الذين يَجمعهم دين جاء به رسول إليهم .و { جاثية } اسم فاعل من مصدر الجُثُوِّ بضمتين وهو البروك على الرُكبتين باستئفاز ، أي بغير مباشرة المقعدة للأرض ، فالجاثي هو البارك المستوفز وهو هيئة الخضوع .وظاهر كون { كتابها } مفرداً غير معرف باللام أنه كتاب واحد لكل أمة فيقتضي أن يراد كتاب الشريعة مثل القرآن ، والتوراة ، والإنجيل ، وصحف إبراهيم وغير ذلك لا صحائف الأعمال ، فمعنى { تدعى إلى كتابها } تدعى لتعرض أعمالها على ما أُمرت به في كتابها كما في الحديث « القرآن حجةٌ لك أو عليك » وقيل : أريد بقوله : { كتابها } كتاب تسجيل الأعمال لكل واحد ، أو مراد به الجنس وتكون إضافته إلى ضمير الأمة على إرادة التوزيع على الأفراد لأن لكل واحد من كل أمة صحيفة عمله خاصة به كما قال تعالى : { اقرأ كتابك كفى بنفسك اليوم عليك حسيباً } \\[ الإسراء : 14 \\] ، وقال : { وَوضع الكتاب فترى المجرمين مشفقين مما فيه }\\[ الكهف : 49 \\] أي كل مجرم مشفق مما في كتابه ، إلا أن هذه الآية الأخيرة وقع فيها الكتاب معرفاً باللام فقبل العمومَ . وأما آية الجاثية فعمومها بدليّ بالقرينة . فالمراد : خصوص الأمم التي أرسلت إليها الرسل ولها كتب وشرائع لقوله تعالى : { وما كنا معذبين حتى نبعث رسولاً } \\[ الإسراء : 15 \\] .ومسألة مؤاخذة الأمم التي لم تجئها الرسل بخصوص جحد الإله أو الإشراككِ به مقررة في أصول الدين ، وتقدمت عند قوله تعالى : { وما كنا معذبين حتى نبعث رسولاً } في سورة الإسراء ( 15 ) .وقرأ الجمهور { كل أمة تدعى إلى كتابها } برفع { كل } على أنه مبتدأ و { تدعى } خبر عنه والجملة استئناف بياني لأن جُثو الأمة يثير سؤال سائل عما بعد ذلك الجثوّ . وقرأه يعقوب بنصب { كلَّ } على البدل من قوله : { وترى كل أمة } . وجملة { تدعى } حال من { كل أمة } فأعيدت كلمة { كل أمة } دون اكتفاء بقوله { تدعَى } أو يدعون للتهويل والدعاء إلى الكتاب بالأمم تجثو ثم تدعى كل أمة إلى كتابها فتذهب إليه للحساب ، أي يذهب أفرادها للحساب ولو قيل : وترى كل أمة جاثية تدعى إلى كتابها لأوهم أن الجثو والدعاء إلى الكتاب يحصلان معاً مع ما في إعادة الخبر مرة ثانية من التهويل .وجملة { اليوم تجزون ما كنتم تعملون } بدل اشتمال من جملة { تدعى إلى كتابها } بتقدير قول محذوف ، أي يقال لهم اليوم تجزون ، أي يكون جزاؤكم على وفق أعْمالِكم وجريها على وفق ما يوافق كتاب دينكم من أفعالكم في الحسنات والسيئات ، وهذا البدل وقع اعتراضاً بين جملة { وترى كل أمة جاثية } وجملة { فأما الذين آمنوا وعملوا الصالحات } \\[ الجاثية : 30 \\] الآيات .وجملة { هذا كتابنا ينطق عليكم بالحق } من مقول القول المقدّر ، وهي مستأنفة استئنافاً بيانياً لتوقع سؤال من يقول منهم : ما هو طريق ثبوت أعمالها . والإشارة إما إلى كتاب شريعة الأمة المدعوة ، وإما إلى كُتب أفرادها على تأويل الكتاب بالجنس على الوجهتين المتقدمين .\n\n",
      "translations": [
        {
          "translation": "(And thou wilt see each nation) the adherents of each religion (crouching) gathered, (each nation) the adherents of each religion (summoned to its record) to read the record of their good and bad deeds; some will be given their record in their right hands and others in their left. ((And it will be said unto them): This day ye are requited what ye used to do) and say in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَرَىٰ كُلَّ أُمَّةٍ جَاثِيَةً } معناه قد جَثتْ عَلَى الرُّكبِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Every nation has been raised up\" - meaning that each nation has been carried on its back.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وترى } يا موحد { كل أمّة جاثية } لا حراك بها إذ هي بنفسها ميتة غير قادرة كما قال:\n[الزمر\n الآية:30] أو تراها جاثية في الموقف الأول وقت البعث قبل الجزاء على حالها في النشأة الأولى عند الاجتنان وفيه سرّ\n { كل أمّة تدعى إلى كِتابها } أي: اللوح الذي أثبت فيه أعمالها وتجسدت صورها وانتقشت فيه على هيئة جسدانية فإن كتابة الأعمال إنما تكون في أربعة ألواح أحدها: اللوح السفلي الذي يدعى إليه كل أمّة ويعطى بيمين من كان سعيداً وشمال من كان شقيّاً\n والثلاثة الأخرى سماوية علوية أشير إليها فيما قبل\n وإنما قلنا هذا الكتاب هو اللوح السفلي لأن الكلام ههنا في جزاء الأعمال لقوله: { اليوم تجزون ما كنتم تعملون } وقوله: { إنّا كنا نَسْتَنْسخ ما كنتم تعملون } والناسخون هم الملكوت السماوية والأرضية جميعاً { فأمّا الذينَ آمنوا } الإيمان الغيبي التقليدي أو اليقيني العلمي { وعَملوا } ما صلح به حالهم في المعاد الجسماني من أبواب البرّ { فيدخلهم ربّهم في } رحمة ثواب الأعمال في جنّة الأفعال { وأمّا الذين كَفَروا } احتجبوا عن الحق بالكفر الأصلي والانغماس في الهيئات الجرمانية المظلمة بالإجرام بدليل قوله: { اليوم ننساكم كما نسيتم لقاء يومكم هذا } أي: نترككم في العذاب كما تركتم العمل للقائي في يومكم هذا لعدم اعترافكم\n أو نعجلكم كالشيء المنسيّ المتروك بالخذلان في العذاب كما نسيتم لقاء يومكم هذا بنسيان العهد الأزلي\n { فللّه الحَمْد } الكمال المطلق الحاصل للكل ببلوغ الأشياء إلى غاياتها وحصولها على أجلّ ما يمكن من كمالاتها { ربّ السموات } مكمل الأرواح ومدبرها { وربّ الأرض } مدبر الأجساد ومالكها ومصرّفها { ربّ العالمين } موجه العالمين إلى كمالاتهم بربوبيته إياهم { وله الكبرياء } أي: استعلاء ونهاية الترفع والكبر على كل شيء وغاية العلو والعظمة باستغنائه عنه وافتقاره إليه\n فكل يحمده بإظهار كماله وجميع صفاته بلسان حاله ويكبره بتغيره وإمكانه وانخراطه في سلك المخلوقات المحتاجة إليه الفانية بالذات القاصرة عن سائر الكمالات غير ما اختصّ به { وهو العزيزُ } القوي القاهر لكل شيء بتأثيره فيه وإجباره على ما هو عليه { الحكيم } المرتب لاستعداد كل شيء بلطف تدبيره\n المهيىء لقبوله لما أراد منه من صفاته بدقيق صنعته وخفيّ حكمته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتَرَىٰ } أيها المعتبر الرائي حين تقوم الساعة ويحشر الناس إلى الحشر للحساب { كُلَّ أُمَّةٍ } من الأمم { جَاثِيَةً } أي: كل فرد من أفراد الأمم { كُلُّ أمَّةٍ تُدْعَىٰ إِلَىٰ كِتَابِهَا } بين يدي الله إلى صحيفة أعمالها التي كتب فيها جميع أحوالها وأفعالها الكائنة الحاصلة منها في النشأة الأولى\n فيقال لهم حينئذ: { ٱلْيَوْمَ تُجْزَوْنَ } كل منكم { مَا كُنتُمْ تَعْمَلُونَ } [الجاثية: 28] في نشأتكم الأولى\n إن خيراً فخير\n وإن شراً فشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وترى كُلَّ أمةٍ } من الأمم المجموعة { جاثيةً } باركة على الركب\n مستوفزة من هول ذلك اليوم\n يقال: جثا فلان يجثو: إذا جلس على ركبتيه\n قال سلمان رضي الله عنه: في القيامة ساعة هي عشر سنين\n يخرّ الناسُ فيها جثاةً على ركبهم\n حتى إن إبراهيم ينادي: نفسي نفسي\n هـ\n ورُوي: أن جهنم حين يؤمر بها أن تُساق إلى الموقف\n تنفلت من أيدي الزبانية\n حتى تهم أن تأتي على أهل الموقف جميعاً\n وتزفر زفرة تذهب بحاسة الآذان\n فيجثو الكل على الركب\n حتى المرسلين\n وكل واحد يقول: نفسي نفسي\n لا أسألك اليوم غيرها\n ونبينا عليه الصلاة والسلام يقول:\n \" أمتي أمتي \" \nنقله الغزالي\n وعن ابن عباس: جاثية\n مجتمعة\n وقيل: جماعات\n من: الجثوة\n وهي الجماعة\n { كُلُّ أمةٍ تُدْعَى إِلى كتابها } صحيفة أعمالها\n والمراد الجنس\n أي: صحائف أعمالها\n { اليوم تُجْزَون ما كنتم تعملون } في الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:72",
      "similarity": 0.8797998911439109
    },
    {
      "verse": "19:68",
      "similarity": 0.7861009687331598
    },
    {
      "verse": "28:41",
      "similarity": 0.09205520631023913
    },
    {
      "verse": "6:108",
      "similarity": 0.08266222461976051
    },
    {
      "verse": "36:54",
      "similarity": 0.08162610396922114
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}