{
  "chapter": "الجاثية",
  "text": "هذا بصئر للناس وهدى ورحمة لقوم يوقنون",
  "translations": [
    {
      "translation": "These are precepts of wisdom for men, and guidance and grace for people who believe with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the lights of discernment for people and guidance and mercy for those endowed with sure faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is an enlightenment for the people and a guide and mercy for the people who have strong faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an enlightenment for mankind, and a guidance and mercy for the people of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a clear insight and evidence for mankind, and a guidance and a mercy for people who have faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are clear proofs for men, and a guidance and a mercy for a people who are sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is clear proofs for men, and a guidance, and a mercy to a people having sure faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is clear indication for mankind, and a guidance and a mercy for a folk whose faith is sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This [Book] brings enlightenment and guidance to mankind, and is a blessing for those who have firm faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book is an enlightenment Unto mankind and a guidance, and a mercy Unto a People who are convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are eye-openers for mankind, and guidance and mercy for a people who have certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are clear evidences to men and a Guidance and Mercy to those of assured Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is a clear insight and evidence for mankind, and a guidance and a mercy for people who have Faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are clear proofs for people, a guidance, and mercy for those who are certain (of the Resurrection) in belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an illumination for mankind, and guidance, and mercy for people who believe with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This [Qur'an] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:20] This, Qur’ān, is [a set of] insights for mankind, guideposts with which they can discern [God’s] rulings and legal proscriptions, and guidance and mercy for a people who have certainty, with regard to the [truth of the] Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) Qur'an (is clear indication for mankind, and a guidance) from error (and a mercy) preventing from chastisement (for a folk whose faith is sure) for people who believe in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَـٰذَا } الذي ذكر في كتابك من الأخلاق المرضية، والمنبهة على القسط الحقيقي والعدل الإلهي { بَصَائِرُ لِلنَّاسِ } يبصرهم طريق الهداية، ويوصلهم إلى التوحيد الذاتي، إن استقاموا عليها بالعزيمة الصادقة الصحيحة { وَهُدًى } يهديهم إلى سواء السبيل { وَرَحْمَةٌ } نازلة من قبل الحق { لِّقَوْمٍ يُوقِنُونَ } [الجاثية: 20] يوفقون للإيمان والإيقان والكشف والعيان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}