{
  "chapter": "الجاثية",
  "text": "ولله ملك السموت والارض ويوم تقوم الساعة يومئذ يخسر المبطلون",
  "translations": [
    {
      "translation": "The kingdom of the heavens and earth belongs to Allah and, on the Day that the Hour arrives, that Day the liars will be lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's is the kingdom of the heavens and the earth. The day the Hour is proclaimed the liars will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is the kingdom of the heavens and the earth, and on the Day when the Hour (of Resurrection) shall come to pass, the followers of falsehood shall be in utter loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth. On the day when the Hour of Doom arrives, the followers of falsehood will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only belongs the kingship of the heavens and the earth; and when the Last Day is established – on that day the followers of falsehood will suffer loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the kingdom of the heavens and the earth. And on the Day that the Hour will be established -- on that Day the followers of falsehood shall lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the kingdom of the heavens and the earth; and on the day when the hour shall come to pass, on that day shall they perish who say false things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the Kingdom of the heavens and the earth. And on the day when the Hour is come, upon that day the vain-doers shall lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah belongeth the Sovereignty of the heavens and the earth; and on the day when the Hour riseth, on that day those who follow falsehood will be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth; on the Day when the Hour comes, those who follow falsehood will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the dominion of the heavens and the earth; and on the Day whereon the Hour arriveth, then shall lose the followers of falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the kingdom of the heavens and the earth, and when the Hour sets in, the falsifiers will be losers on that day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth, and the Day that the Hour of Judgment is established,- that Day will the dealers in Falsehood perish!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the kingdom of the heavens and the earth. And on the Day that the Hour will be established, on that Day the followers of falsehood (polytheists, disbelievers, worshippers of false deities, etc.) shall lose (everything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Kingdom in the heavens and the earth. On the Day when the Hour comes, those who disbelieved shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingship of the heavens and the earth. On the Day when the Hour takes place, on that Day the falsifiers will lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:27] And to God belongs the kingdom of the heavens and the earth. And on the day when the Hour sets in (yawma taqūmu’l-sā‘atu is substituted by [the following, yawma’idhin]) on that day the followers of falsehood, the disbelievers, will be losers, that is to say, their loss will become manifest by their ending up in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Unto Allah belongeth the Sovereignty) the stores (of the heavens) i.e. rain (and the earth) i.e. vegetation; (and on the day when the Hour riseth) which is the Day of Judgement, (on that day those who follow falsehood will be lost) the idolaters will be losers both for missing the life of the world and the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف ينكرون جمع الله عباده في النشأة الأخرى؛ إذ { لِلَّهِ } المتوحد في الألوهية والربوبية { مُلْكُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ } وملكوتهما، وله التصرف المطابق في ملكه وملكوته بالاستقلال، إرادة واختياراً { وَيَوْمَ تَقُومُ ٱلسَّاَعةُ } المعدة للحشر والجزاء { يَوْمَئِذٍ يَخْسَرُ ٱلْمُبْطِلُونَ } [الجاثية: 27] المنكرون حين يشهدون ربح المحقين المؤمنين بقيام الساعة، وبحقية جميع ما فيها من الوعد والوعيد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ويوم }: منصوب بيَخْسَر، و \" يومئذٍ \" بدل منه، و \" كل أُمةٍ تُدْعَى \": مبتدأ وخبر، ومن نصب فبدل من \" كل أمة \" ، { والساعة لا ريب فيها } مَن رفعها فمبتدأ، ومَن نصبها فعطف على { وعد الله }\n يقول الحق جلّ جلاله: { قل الله يُحييكم } في الدنيا { ثم يُميتكم } عند انقضاء أعماركم، لا كما تزعمون من أنكم تحيون وتموتون بحكم الدهر، { ثم يجمعكم } بعد الموت { إِلى يوم القيامة } للجزاء، { لا ريبَ فيه } أي: في جمعكم فإنّ مَن قدر على البدء قدر على الإعادة، والحكمة اقتضت الجمع للجزاء لا محالة، وتأخيره ليوم معلوم، والردّ لآبائهم كما اقترحوا، حيث كان مزاحماً للحكمة التشريعية، امتنع إيقاعه لرفع الإيمان بالغيب حينئذ، { ولكنَّ أكثرَ الناس لا يعلمون } قدرة الله على البعث، وحكمة إمهاله، لإعراضهم عن التفكُّر بالانهماك في الغفلة، وهو استدراك من قوله: { لا ريب } إما من تمام الكلام المأمور به، أو مستأنف من جهته تعالى، تحقيقاً للحق، وتنبيهاً على أن ارتيابهم إنما هو لجهلهم وتقصيرهم في التفكُّر والنظر، لا لأن فيه شائبة ريبٍ ما\n { ولله ملكُ السماوات والأرض } أي: له التصرُّف فيما وفيما بينهما، وهو بيان لاختصاص الملك المطلق بالله، إثر بيان تصرفه تعالى في الناس بالإحياء والإماتة، والبعث والجمع والجزاء، وكأنه دليل لِما قبله، { ويوم تقوم الساعةُ يومئذ يَخْسَرُ المبطلون } الداخلون في الباطل، وهو الكفر، { وترى كُلَّ أمةٍ } من الأمم المجموعة { جاثيةً } باركة على الركب، مستوفزة من هول ذلك اليوم، يقال: جثا فلان يجثو: إذا جلس على ركبتيه، قال سلمان رضي الله عنه: في القيامة ساعة هي عشر سنين، يخرّ الناسُ فيها جثاةً على ركبهم، حتى إن إبراهيم ينادي: نفسي نفسي\n هـ\n ورُوي: أن جهنم حين يؤمر بها أن تُساق إلى الموقف، تنفلت من أيدي الزبانية، حتى تهم أن تأتي على أهل الموقف جميعاً، وتزفر زفرة تذهب بحاسة الآذان، فيجثو الكل على الركب، حتى المرسلين، وكل واحد يقول: نفسي نفسي، لا أسألك اليوم غيرها، ونبينا عليه الصلاة والسلام يقول:\n\n \" أمتي أمتي \" \n\nنقله الغزالي، وعن ابن عباس: جاثية، مجتمعة، وقيل: جماعات، من: الجثوة، وهي الجماعة",
      "translations": []
    }
  ]
}