{
  "chapter": "الجاثية",
  "text": "وقالوا۟ ما هى الا حياتنا الدنيا نموت ونحيا وما يهلكنا الا الدهر وما لهم بذلك من علم ان هم الا يظنون",
  "translations": [
    {
      "translation": "They say, 'There is nothing but our existence in this world. We die and we live and nothing destroys us except for time.' They have no knowledge of that. They are only conjecturing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they say: \"There is nothing but the life of this world. We die and we live, and only time annihilates us.\" Yet they have no knowledge of this: They only speculate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “There is no life other than our present worldly life: herein we live and we die, and it is only (the passage of) time that destroys us. Yet the fact is that they know nothing about this and are only conjecturing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"The only life is this worldly life and here we shall live and die. It is only time which will destroy us\" They have no knowledge about this. It is only their guesswork.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “There is nothing except our life of this world – we die and we live – and nothing destroys us except the passage of time”; and they do not have any knowledge of it; they only make guesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"There is nothing but our life of this world, we die and we live and nothing destroys us except Ad-Dahr (time). And they have no knowledge of it, they only presume.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: There is nothing but our life in this world; we live and die and nothing destroys us but time, and they have no knowledge of that; they only conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'There is nothing but our present life; we die, and we live, and nothing but Time destroys us.' Of that they have no knowledge; they merely conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: There is naught but our life of the world; we die and we live, and naught destroyeth us save time; when they have no knowledge whatsoever of (all) that; they do but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"There is nothing but our life in this world: we die, we live, nothing but time destroys us.\" They have no knowledge of this; they only follow conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: there is no naught but our life of the world; die and we live; and naught destroyeth us save Time. And they have no knowledge thereof: they do but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘There is nothing but the life of this world: we live and we die, and nothing but time destroys us.’ But they do not have any knowledge of that, and they only make conjectures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"What is there but our life in this world? We shall die and we live, and nothing but time can destroy us.\" But of that they have no knowledge: they merely conjecture:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"There is nothing but our life of this world, we die and we live and nothing destroys us except Ad-Dahr (the time). And they have no knowledge of it, they only conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'There is nothing except this life, we die and we live, it is only time that destroys us' Surely, of this they have no knowledge, they are just guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “There is nothing but this our present life; we die and we live, and nothing destroys us except time.” But they have no knowledge of that; they are only guessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"There is not but our worldly life; we die and live, and nothing destroys us except time.\" And they have of that no knowledge; they are only assuming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:24] And they, those who deny the Resurrection, say, ‘There is only, that is to say, [the only] life [is], our life, the one that is, in this world. We die and we live, that is to say, some die, while others are given life by [virtue of] being born, and nothing but time, that is, [nothing but] the passage of time, destroys us’. God, exalted be He, says: Of that, saying, they have no knowledge; they are only making conjectures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. the people of Mecca: (There is naught but our life of the world) in this life of the world; (we die and we live) they meant: the fathers die and the sons live, (and naught destroyeth us save time) i.e. the length of nights, days, months, and hours; (when they have no knowledge) proof or argument (whatsoever of (all) that) which they say; (they do but guess) they only guess when they say this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا سكن لنا غيرها { وَ } بالجملة: { مَا يُهْلِكُنَآ } ويميتنا فيها { إِلاَّ ٱلدَّهْرُ } أي: مر الزمان وكر الأعوام\n لا فاعل سواه\n ولا متصرف إلا هو { وَ } الحال أنه { مَا لَهُمْ بِذَلِكَ } الذي صدر عنهم { مِنْ عِلْمٍ } عقلي أو نقلي أو كشفي بل أن { إِنْ هُمْ } أي: ما هم باعتقادهم هذا { إِلاَّ يَظُنُّونَ } [الجاثية: 24] ظنَّا على وجه التقليد والتخمين بلا سند لهم يستندون إليه\n سوى الأُلف بالمسحوسات والتقليد بالرسوم والعادات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وقالوا } من غاية غيهم وضلالهم: { ما هيَ } أي: ما الحياة لأنهم وُعِدُوا حياة ثانية\n { إِلا حياتُنا الدنيا } التي نحن فيها\n { نموت ونحيا } أي: يُصيبنا الموت والحياة فيها\n وليس وراء ذلك حياة\n أو: نموت بأنفسنا ونحيا ببقاء أولادنا\n أو: يموت بعض ويحيا بعض\n أو: نكون مواتاً نطفاً في الأصلاب\n ونحيا بعد ذلك\n وقيل: هذا كلام مَن يقول بالتناسخ\n فإنه عقيدة أكثر عبدة الأوثان\n أي: يموت الرجل\n ثم تجعل روحه في شبح آخر\n فيحيا به\n وهو باطل عند أهل الإسلام\n ثم قالوا: { وما يُهكنا إِلا الدهرُ } إلا مرور الزمان وهو في الأصل: مدة بقاء العالم\n من: دهَرهُ: إذا غَلَبه\n وكانوا يزعمون أن مرور الزمان بالليالي والأيام هو المؤثِّر في هلاك الأنفس\n وينكرون ملك الموت\n وقبضه الأرواحَ بأمر الله تعالى\n وكانوا يُضيفون كلَّ حادثة تحدثُ إلى الدهر والزمان\n كما قال شاعرهم:\nومنه قول تُبع الأكبر\n أو غيره:\nفإن كان تُبَّعاً المتقدم فنسبة الفعل إلى الدهر مجاز\n كما سيأتي\n وعقيدة الموحدين ألاَّ فاعل إلا الله\n فالدهر مُسخّر بأمر الله وقدرته\n بل هو من أسرار الله وأنوار صفاته\n ولذلك قال صلى الله عليه وسلم:\n \" لا تسبُّوا الدهر\n فإن الله هو الدهر \" \nوقال صلى الله عليه وسلم:\n \" قال الله تعال: يُؤذيني ابنُ آدم\n يَسُبُّ الدَّهر\n وأنا الدهر\n بيدي الأمر\n أُقلّب الليلَ والنهارَ \" \nفالأمور كلها بيد الله\n والدهر إنما هو مظهر لعجائب القدرةن كما قال أبو علي الثقفي رضي الله عنه:\nوقد ينسب أهل التوحيد الفعلَ إلى الدهر مجازاً\n تغزُّلاً\n في أشعارهم\n كما قال عبد الملك بن مروان\n حين ضعف حالُه:\nقال تعالى: { وما لهم بذلك من علم } أي: ليس لهم بما ذكر من اقتصار الحياة على ما في الدنيا\n وإسناد التأثير إلى الدهر\n { من علم } يستند إلى عقل ولا نقل\n { إِن هم إِلا يظنون } ما هم إلا قوم قصارى أمرهم الظن والتقليد\n هذا معتقدهم الفاسد في أنفسهم\n\n{ وإِذا تُتلى عليهم آياتنا } الناطقة بالحق\n الذي من جملته البعث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:1",
      "similarity": 0.8939961049709012
    },
    {
      "verse": "23:37",
      "similarity": 0.08154527790052703
    },
    {
      "verse": "53:28",
      "similarity": 0.0763750544439834
    },
    {
      "verse": "10:36",
      "similarity": 0.07327959948755833
    },
    {
      "verse": "26:186",
      "similarity": 0.07131701819677559
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/45:24.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/45:24.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/45:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}