{
  "chapter": "الجاثية",
  "text": "واذا قيل ان وعد الله حق والساعة لا ريب فيها قلتم ما ندرى ما الساعة ان نظن الا ظنا وما نحن بمستيقنين",
  "translations": [
    {
      "translation": "When you were told, \"Allah's promise is true and so is the Hour, of which there is no doubt,\" you said, \"We have no idea what the Hour is. We have only been conjecturing. We are by no means certain.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever it was said: 'God's promise is certainly true, and there is no doubt about the Hour,' you replied: 'We know not what the Hour is. We have only a vague idea, but are not certain.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said to them: “Surely Allah's promise is true, and there is no doubt regarding the Hour of Resurrection,” you were wont to say: “We do not know what the Hour (of Resurrection) is. We are simply making conjectures and are not at all certain.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it was said that the promise of God is true and that the Hour would inevitably come, you said, \"We do not know what the Hour of Doom is, we are suspicious about it and we are not convinced\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when it was said, ‘Indeed Allah’s promise is true and there is no doubt regarding the Last Day”, you used to say, ‘We do not know what the Last Day is – we think it is nothing except an imagination, and we are not convinced.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said: \"Verily, Allah's promise is the truth, and there is no doubt about the coming of the Hour,\" you said: \"We know not what is the Hour: we do not think it but conjecture, and we have no firm convincing belief (therein).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said, Surely the promise of Allah is true and as for the hour, there is no doubt about it, you said: We do not know what the hour is; we do not think (that it will come to pass) save a passing thought, and we are not at all sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said, \"God's promise is true, and the Hour, there is no doubt of it,\" you said; \"We know not what the Hour may be; we have only a surmise, and are by no means certain.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said: Lo! Allah's promise is the truth, and there is no doubt of the Hour's coming, ye said: We know not what the Hour is. We deem it naught but a conjecture, and we are by no means convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it was said to you, \"God's promise is true: there is no doubt about the Hour,\" did you not reply, 'We do not know what the Hour is. We think it to be nothing but a conjecture, and we are not convinced'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said; verily Allah's promise is, true, and the Hour! there is no doubt thereof, ye said: we know not what the Hour is, we imagine it naught but an opinion, and we are not convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it was said, ‘‘Allah’s promise is indeed true, and there is no doubt about the Hour,’’ you said, ‘‘We do not know what the Hour is. We know nothing beyond conjectures, and we do not possess any certainty.’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said that the promise of Allah was true, and that the Hour- there was no doubt about its (coming), ye used to say, 'We know not what is the hour: we only think it is an idea, and we have no firm assurance.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said: \"Verily! Allah's Promise is the truth, and there is no doubt about the coming of the Hour,\" you said; \"We know not what is the Hour, we do not think it but as a conjecture, and we have no firm convincing belief (therein).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it was said: 'The promise of Allah is true, and of the Hour there is no doubt' you replied: 'We do not know what the Hour is, we guess, assuming, and we are by no means certain'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said, “The promise of God is true, and of the Hour there is no doubt,” you said, “We do not know what the Hour is; we think it is only speculation; we are not convinced.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it was said, 'Indeed, the promise of Allah is truth and the Hour [is coming] - no doubt about it,' you said, 'We know not what is the Hour. We assume only assumption, and we are not convinced.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:32] And when it was said, to you, O disbelievers: “God’s promise, of resurrection, is indeed true, and there is no doubt about the Hour”, (read al-sā‘atu or al-sā‘ata) you said, “We do not know what the Hour is. We only make conjectures (al-Mubarrad said that this actually [means] in nahnu illā nazunnu zannan) and we are by no means certain” ’, that it will come to pass.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it was said) to them in the life of the world: (Lo! Allah's promise) resurrection after death (is the Truth, and there is no doubt of the Hour's coming, ye said: We know not what the Hour is) we do not know what the coming of the Hour is. (We deem it naught but a conjecture) we only guess, (and we are by no means convinced) of the coming of the Hour.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال استكباركم واغتراركم بما عندكم من الجاه والثروة { إِذَا قِيلَ } لكم إمحاضاً للنصح: { إِنَّ وعْدَ ٱللَّهِ } الذي وعدكم على ألسنة رسله وكتبه { حَقٌّ } مطلقاً، لا بدَّ وأن يقع الموعود منه سبحانه ألبتة بلا خلف في وعده { وَ } لا سيما { ٱلسَّاعَةُ } الموعودة آتية { لاَ رَيْبَ فِيهَا } وفي قيامها، وإذا سمعتم كلمة الحق عن أهله { قُلْتُم مَّا نَدْرِي } على وجه الاستبعاد والاستغراب { مَا ٱلسَّاعَةُ } الموعودة وما معنى قيامها والإيمان بها { إِن نَّظُنُّ } أي: ما نظن بها وفي شأنها { إِلاَّ ظَنّاً } ضعيفاً، بل وهماً مرجوحاً سخيفاً؛ إذ ما لنا علم بها سوى الاستماع من أفواه الناس { وَمَا نَحْنُ بِمُسْتَيْقِنِينَ } [الجاثية: 32] بها حتى نؤمن لها وبقيامها، ونصدق بما فيها من المواعيد والوعيدات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا قيل إِنَّ وعد الله } أي: وكنتم إذا قيل لكم: إن وعد الله بالجزاء { حقٌّ والساعةُ لا ريبَ فيها } أي: في وقوعها { قلتم ما ندري ما الساعةُ } أيّ شيء هي الساعة، استهزاء بها، { إِن نظنُّ إِلا ظناً } أصله: نظن ظناً، ومعناه: إثبات الظن، فحسب، فأدخل حرف النفي والاستثناء ليفيد إثبات الظن مع نفس ما سواه\n وقال المبرد: أصله: إن نحن إلا نَظُن ظناً، وإنما أوَّله لأنه لا يصح التفريع في المصدر المؤكد، لعدم حصول الفائدة، إذ لا معنى لقولك: لا نضرب إلا ضرباً، وجوابه: إن المصدر نوعي لا مؤكد، أي: ظناً حقيراً ضعيفاً\n وفي الآية اللف والنشر المعكوس\n فقوله: { قلتم ما ندري ما الساعة } راجع لقوله: { والساعة لا ريب فيها } ، وقوله: { إن نظن إلا ظناً } راجع لقوله: { إن وعد الله حق } ، وكذا قوله: { وما نحن بمستيقنين } أي: لا يقين عندنا، وهو راجع لقوله { إن وعد الله حق }\n قاله ابن عرفة\n ولعل هؤلاء غير القائلين: { ما هي إلا حياتنا الدنيا } والله أعلم\n الإشارة: قل الله يُحييكم الحياةَ الفانية، ثم يُميتكم عن حظوظكم، وعن شهود وجودكم، ثم يجمعكم به إلى يوم القيامة، لا يعزلكم عن رؤيته أبداً، ولكن أكثر الناس لا يعلمون أن هذا يقع في الدنيا، مع أن المُلك لله يتصرف فيه كيف شاء، يُوصِّل مَن أراد، ويُبعد مَن شاء\n\n\nويوم تقوم الساعة يخسر الباطلون والمبطلون، ويفوز المجتهدون والواصلون\n وترى كُلَّ أمة جاثية من هيبة المتجلِّي باسمه القهّار، وهذذ القهرية - نعم - لا ينجو منها خاص ولا عام لأن الطبع البشري يثبت عند صدمات الجلال\n وقوله تعالى: { كل أمة تُدعى إلى كتابها } هو أيضاً عام، فيستبشر المجتهدون، ويحزن الباطلون، ولا يظلم ربك أحداً، فاليوم يوم عمل، وغداً يوم جزاء، فأهل الإيقان يفوزون بغاية النعيم والرضوان، وأهل الشك يخلدون في الخسران، فيظهر لهم ما لم يكونوا يحتسبون، كما قال: { وَبَدَا لَهُمْ سَيِّئَاتُ مَا عَمِلُواْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:63",
      "similarity": 0.4667454665418931
    },
    {
      "verse": "40:59",
      "similarity": 0.4568978792495058
    },
    {
      "verse": "42:17",
      "similarity": 0.42901974209568844
    },
    {
      "verse": "69:3",
      "similarity": 0.4028404364983117
    },
    {
      "verse": "69:51",
      "similarity": 0.4019138684661532
    }
  ]
}