{
  "chapter": "الجاثية",
  "text": "وقيل اليوم ننسىكم كما نسيتم لقاء يومكم هذا وماوىكم النار وما لكم من نصرين",
  "translations": [
    {
      "translation": "They will be told, 'Today We have forgotten you as you forgot the meeting of this your Day. Your refuge is the Fire and you have no helpers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall ignore you today,\" they will be told, \"as you had forgotten the meeting of this Day. Your dwelling place is Hell, and there is none to save you:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and it will be said: “We will forget you today as you forgot the meeting of this Day of yours. The Fire shall now be your abode, and you shall have none to come to your aid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be told, \"On this day We shall forget you in the same way that you had forgotten your coming into Our presence. Your dwelling will be hell fire and no one will help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said, “This day We shall forsake you, the way you had forgotten the confronting of this day of yours – and your destination is the fire, and you do not have any supporters.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: \"This Day We will forget you as you forgot the meeting of this Day of yours. And your abode is the Fire, and there is none to help you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said: Today We forsake you as you neglected the meeting of this day of yours and your abode is the fire, and there are not for you any helpers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said, 'Today We do forget you, even as you forgot the encounter of this your day; and your refuge is the Fire, and you shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: This day We forget you, even as ye forgot the meeting of this your day; and your habitation is the Fire, and there is none to help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said to them, \"This Day We shall forget you, as you yourselves forgot that you would meet this Day. Your abode shall be the Fire, and you shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: Today shall forget you, even as ye forgat the meeting of this your Day, and your abode will be the Fire, and none ye will have as helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said, ‘Today We will forget you, just as you forgot the encounter of this day of yours. The Fire will be your abode, and you will not have any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will also be said: \"This Day We will forget you as ye forgot the meeting of this Day of yours! and your abode is the Fire, and no helpers have ye!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said: \"This Day We will forget you as you forgot the Meeting of this Day of yours. And your abode is the Fire, and there is none to help you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and it shall be said: 'Today, We will forget you as you yourselves forgot that you would encounter this Day. The Fire shall be your refuge, and none will help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said, “Today We forget you, as you forgot the encounter of this Day of yours. Your abode is the Fire, and there are no saviors for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said, \"Today We will forget you as you forgot the meeting of this Day of yours, and your refuge is the Fire, and for you there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:34] And it will be said: ‘Today We will forget you, We will abandon you in the Fire, just as you forgot the encounter of this day of yours, that is to say, [just as] you neglected to perform [those good] deeds [in preparation] for the encounter with it, and your abode will be the Fire, and you will not have any helpers, [any] protectors therefrom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it will be said) to them: (This day We forget you) We will leave you in the Fire, (even as ye forgot the meeting of this your day) even as you shunned the belief in this day; (and your habitation) your dwelling- place (is the Fire, and there is none to help you) and you have none to protect you from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلْيَوْمَ نَنسَاكُمْ } معناه نَتركُكم من الرَّحمةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقِيلَ } لهم حينئذ من قبل الحق { ٱلْيَوْمَ نَنسَاكُمْ } نترككم في النار خالدين { كَمَا نَسِيتُمْ } ونبذتم وراء ظهوركم { لِقَآءَ يَوْمِكُمْ هَـٰذَا } بل أنكرتم لقياه، وكذبتم الرسل المبلغين لكم أخباره، المنذرين لكم من أهواله { وَ } بالجملة: { مَأْوَاكُمُ ٱلنَّارُ } أبداً، لا منزل لكم سواه { وَمَا لَكُمْ مِّن نَّاصِرِينَ } [الجاثية: 34] منقذين لكم منها بعدما استوجبتم بها بمفاسد أعمالكم ومقابح أفعالكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}