{
  "chapter": "الجاثية",
  "text": "وفى خلقكم وما يبث من دابة ءايت لقوم يوقنون",
  "translations": [
    {
      "translation": "And in your creation and all the creatures He has spread about there are Signs for people with certainty.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In creating you and spreading all the moving things (on earth) are signs for people firm of faith,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in your own creation; and in the animals which He spreads out over the earth too there are Signs for those endowed with sure faith;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In your creation and in that of the beasts living on earth there is evidence of the Truth for the people who have strong faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in your creation, and all the creatures He scatters in the earth – in them are signs for the people who are certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in your creation, and what He spread (through the earth) of moving creatures are signs for people who have faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in your (own) creation and in what He spreads abroad of animals there are signs for a people that are sure;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in your creation, and the crawling things He scatters abroad, there are signs for a people having sure faith,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in your creation, and all the beasts that He scattereth in the earth, are portents for a folk whose faith is sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in your own creation and all the creatures He has spread about, there are signs for people of sure faith;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the creation of yourselves and of the beasts that He hath scattered over the earth, are signs Unto a people who are convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are signs for people who have certainty in your own creation and in animals, He scatters abroad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the creation of yourselves and the fact that animals are scattered (through the earth), are Signs for those of assured Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in your creation, and what He scattered (through the earth) of moving (living) creatures are signs for people who have Faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in your creation, and in the crawling things that He has scattered far and near, there are signs for a nation whose belief is certain,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in your own creation, and in the creatures He scattered, are signs for people of firm faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the creation of yourselves and what He disperses of moving creatures are signs for people who are certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:4] And in your creation, that is to say, and in the creation of every one of you from a sperm-drop, then a blood clot, then an embryo until it becomes a human being; and, [in] the creation of, what He has scattered, [what] He has dispersed throughout the earth, of animals — [dābba denotes] whatever treads on (yadubbu) the earth of [both] human beings and other [animals] — there are signs for a people who are certain, of the Resurrection;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in your creation) in the transformation of your states, one state after another, there is also a sign and lesson for you, (and all the beasts that He scattereth in the earth) and also in all the things that He created with a soul, (are portents) signs and lessons (for a folk whose faith is sure) for people who believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَمَا يَبُثُّ مِن دَآبَّةٍ } معناه يُفرِّقُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: Ali ibn Ahmad narrated to us.\n\n\nHe said: \"Ata ibn al-Sa'ib narrated to us from Abu Khalid from Zayd ibn Ali, peace be upon them, regarding the words of Allah, {And whatever beast of burden} [the meaning of which is] 'it separates [from the herd].'\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { آيات لقوم يوقنون } بصفاته لأنكم وجميع الحيوانات مظاهر صفاته من كونه حيّاً عالماً مريداً قادراً متكلماً سميعاً بصيراً\n لأنكم بهذه الصفات شاهدون بصفاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَفِي خَلْقِكُمْ } أي: في خلق أنفسكم وإيجادكم من كتم العدم { وَ } كذا في أنفس { مَا يَبُثُّ } ينتشر ويتفرق على الأرض { مِن دَآبَّةٍ } مركبة من العناصر متحركة على وجه الأرض من أنواع الحيوانات والحشرات وأصنافها { ءَايَٰتٌ } دلائل وشواهد واضحات { لِّقَوْمٍ يُوقِنُونَ } [الجاثية: 4] وحدة الحق وينكشفون بشؤونه وتجلياته التي لا تعد ولا تحصى\n\n\n{ وَ } كذا في { ٱخْتِلاَفِ ٱللَّيْلِ وَٱلنَّهَارِ } وإيلاجهما وازديادهما وانتقاصهما في الفصول الأربعة حسب الأوضاع الفلكية وأشكالها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لقومٍ يُوقنون } أي: من شأنهم أن يوقنوا بالأشياء على ما هي عليه\n ويعرفوا فيها صانعها\n { وفي اختلاف الليل والنهار } أي: تعاقبهما بالذهاب والمجيء\n أو: تفاوتهما طولاً\n وقصراً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:29",
      "similarity": 0.8433108556872017
    },
    {
      "verse": "4:1",
      "similarity": 0.48901832205618023
    },
    {
      "verse": "27:82",
      "similarity": 0.487591042294277
    },
    {
      "verse": "2:164",
      "similarity": 0.45994098781652004
    },
    {
      "verse": "101:4",
      "similarity": 0.44387120080834025
    }
  ]
}