{
  "chapter": "الجاثية",
  "text": "واختلف اليل والنهار وما انزل الله من السماء من رزق فاحيا به الارض بعد موتها وتصريف الريح ءايت لقوم يعقلون",
  "translations": [
    {
      "translation": "And in the alternation of night and day and the provision Allah sends down from the sky, bringing the earth to life by it after it has died, and the varying direction of the winds, there are Signs for people who use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As there are signs in the alternation of night and day, and in rain that God sends with which He revives the earth once dead, as there are in the changing of the winds, for people who can understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in the succession of night and day, and in the provision that Allah sends down from the sky wherewith He gives life to the earth after it had been lifeless, and in the change of the winds: (in all these) there are Signs for people who use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the alternation of the night and the day, the sustenance which God has sent down from the sky to revive the barren earth, and in the changing of the direction of the winds there is evidence of the truth for the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the alternation of night and day, and in the means of sustenance – water – which Allah sends down from the sky whereby He gave life to the earth after its death, and in the movement of the winds – (in all these) are signs for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the alternation of night and day, and the provision that Allah sends down from the sky, and revives therewith the earth after its death, and in the turning about of the winds, are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (in) the variation of the night and the day, and (in) what Allah sends down of sustenance from the cloud, then gives life thereby to the earth after its death, and (in) the changing of the winds, there are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in the alternation of night and day, and the provision God sends down from heaven, and therewith revives the earth after it is dead, and the turning about of the winds, there are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the difference of night and day and the provision that Allah sendeth down from the sky and thereby quickeneth the earth after her death, and the ordering of the winds, are portents for a people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in the succession of night and day, and in the means of subsistence which God sends down from the skies, giving life thereby to the earth after it had been lifeless, and in the circulation of the winds: [in all this] there are signs for people who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the alternation of night and day and that which Allah sendeth down of provision from the heaven and thereby quickeneth the earth after the death thereof and the turning about of the winds, are signs Unto a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are signs for people who exercise their reason in the alternation of night and day, in the provision that Allah sends down from the sky, with which He revives the earth after its death, and in the changing of the winds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the alternation of Night and Day, and the fact that Allah sends down Sustenance from the sky, and revives therewith the earth after its death, and in the change of the winds,- are Signs for those that are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the alternation of night and day, and the provision (rain) that Allah sends down from the sky, and revives therewith the earth after its death, and in the turning about of the winds (i.e. sometimes towards the east or north, and sometimes towards the south or west etc., sometimes bringing glad tidings of rain etc., and sometimes bringing the torment), are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in the alternation of the night and day, in the provision Allah sends down from heaven with which the earth is revived after its death, and in the changing about of the winds, there are signs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the alternation of night and day, and in the sustenance God sends down from the sky, with which He revives the earth after its death, and in the circulation of the winds, are marvels for people who reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [in] the alternation of night and day and [in] what Allah sends down from the sky of provision and gives life thereby to the earth after its lifelessness and [in His] directing of the winds are signs for a people who reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:5] and, in, the alternation of night and day, their passing and their arrival, and what God sends down from the heaven [in the way] of provision, rain, for it constitutes a means of provision, with which He revives the earth after it is dead, and the circulation of the winds, its alternation between southerly and northerly, hot and cold, there are signs for a people who understand, proofs and therefore have faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the difference of night and day) and in the alternation of night and day, the increase and decrease of their duration, their coming and going, are a sign and lesson for you, (and the provision that Allah sendeth down from the sky) of rain (and thereby) by means of the rain (quickeneth the earth after her death) after her dryness and exposure to drought are also lessons and signs for you, (and the ordering of the winds) right and left, north and south, as a punishment and as mercy, (are portents) signs and lessons (for a people who have sense) for people who believe they are from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ و } في { اختلاف اللَّيل والنهار } إلى آخره\n { آيات لقوم يعقلون } أفعاله\n فإن هذه التصرفات أفعاله\n وإنما فرّق بين الفواصل الثلاث بالإيمان والإيقان والعقل لأن شهود الذات أوضح وإن خفي لغاية وضوحه والوجود أظهر والمصدّقون به أكثر لكونه من الضروريات ومشاهدة الصفات أدق وألطف من القسمين الباقيين فعبر عنها بالإيقان\n فكل موقن مؤمن بوجوده ولا ينعكس وقد يوجد الإيقان بدون الإيمان بالذات لذهول المؤمن بالوجد الموقن بالصفات عن شهود الذات لاحتجابه بالكثرة عن الوحدة\n وأما الأفعال فمعرفتها استدلال بالعقل إذ التغير في الأشياء لا بد له من تغيير مغير عند العقل لاستحالة التأثر بدون التأثير عقلاً\n والأول فطري روحي\n والثاني علمي قلبي\n أي: كشفي ذوقي\n والثالث عقلي\n فالمحبوب الباقي على الفطرة يؤمن أولاً بالذات ثم يوقن بالصفات ثم يعقل الأفعال\n وأما المحب المحتجب عن الفطرة بالنشأة والمادة فهو في مقام النفس يعقل أولاً أفعاله ثم يوقن بصفاته التي هي مبادىء أفعاله\n ثم يؤمن بذاته ولهذا\n \" لما سئل حبيب الله صلى الله عليه وسلم: بم عرفت الله؟ قال: \" عرفت الأشياء بالله \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وارتفاع الشمس وانحطاطها { وَمَآ أَنَزَلَ ٱللَّهُ } المدبر لأمور عباده { مِنَ } جانب { ٱلسَّمَآءِ مَّن رِّزْقٍ } بعد تصعيد الأبخرة والأدخنة وتراكمها سحباً وصيرورتها ماء في غاية الصفاء { فَأَحْيَا بِهِ } بإنزال المطر { ٱلأَرْضَ بَعْدَ مَوْتِهَا } يبسها وجفافها { وَ } في { تَصْرِيفِ ٱلرِّيَاحِ } السائقة للسحب إلى الأراضي الميتة اليابسة\n بعد تعلق إرادته سبحانه بإحيائها { ءَايَٰتٌ } أنواع من الدلائل القاطعة والبراهني الساطعة على وحدة القادر العليم الحكيم { لِّقَوْمٍ يَعْقِلُونَ } [الجاثية: 5] يستعلمون عقولهم في كيفية انبعاث هذه الأوضاع والحركات\n وارتباط بعضهامع بعض\n وترتب الأمور الغير المحصورة عليها\n وانشعاب الحوادث الغير المتناهية منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } في { ما أنزل اللّهُ من السماءِ مِن رزقٍ } مطر لأنه سبب الرزق\n فعبَّر عن السبب بالمسبب لأنه نتيجته\n تنبيهاً على كونه آية من جهة القدرة والرحمة\n { فأحيا به الأرضَ } بأن أخرج أصناف الزرع والثمرات والنبات { بعد موتها } أي: خلُوها عن آثار الحياة وانتفاء قوة التنمية عنها\n وخُلوا أشجارها عن الثمار والأزهار\n { وتصريفِ الرياح } أي: هبوبها من جهة إلى أخرى\n ومن حال إلى حال\n وتأخيره عن نزول المطر مع تقدمه عليه في الوجود\n إما للإيذان بأنه آية مستقلة\n ولو روعي الترتيب الوجودي لربما توهم أن مجموع تصريف الرياح ونزول المطر آية واحدة\n أو: لأن كون التصريف آية ليس مجرد كونه مبتدأ لإنشاء المطر\n بل له ولسائر المنافع\n التي من جملتها: سوق السفن في البحار\n وإلقاح الأشجار\n { آياتٌ لقوم يعقلون } يتدبّرون بعقولهم\n فيصلون إلى صريح التوحيد\n\nوفي تقديم الإيمان على الإيقان\n وتأخير تدبُّر العقل لأن العباد إذا نظروا في السموات والأرض نظراً صحيحاً علموا أنها مصنوعة\n وأنه لا بُدَّ لها من صانع\n فآمنوا بالله\n وإذا نظروا في خلق أنفسهم\n وتنقلها من حالٍ إلى حال\n وفي خلق ما ظَهَرَ على ظَهْر الأرض من صنوف الحيوان ازدادوا إيماناً وأيقنوا\n فإذا نظروا في سائر الحوادث التي تتجدّد في كل وقت\n كتعاقب الليل والنهار\n ونزول الأمطار\n وحياة الأرض بعد موتها\n وتصريف الرياح\n جنوباً وشمالاً\n ودَبوراً وصباً\n عقِلوا\n واستحكم في عقولهم\n وخلص يقينهم\n فكانوا من ذوي الألباب\n { تلك آياتُ الله } مبتدأ وخبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:80",
      "similarity": 0.6050187134081365
    },
    {
      "verse": "57:17",
      "similarity": 0.4189790329997205
    },
    {
      "verse": "10:6",
      "similarity": 0.4152703681993951
    },
    {
      "verse": "2:164",
      "similarity": 0.3923635762591081
    },
    {
      "verse": "29:63",
      "similarity": 0.38352788094398615
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/045005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/045005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}