{
  "chapter": "الجاثية",
  "text": "تلك ءايت الله نتلوها عليك بالحق فباى حديثۭ بعد الله وءايته يؤمنون",
  "translations": [
    {
      "translation": "Those are Allah's Signs We recite to you with truth. In what discourse, then, after Allah and His Signs, will they have iman?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are revelations of God which we recite to you correctly: In what other lore but God and His manifestations would they then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are Allah's Signs that We rehearse to you in Truth. In what kind of discourse after Allah and His Signs will they, then, believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the revelations of God which We recite to you for a genuine purpose. In what statements other than God's and His revelations will they then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah which We recite to you with the truth; so forsaking Allah and His signs, what will they believe in?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Ayat of Allah, which We recite to you with truth. Then in which speech after Allah and His Ayat will they believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the communications of Allah which We recite to you with truth; then in what announcement would they believe after Allah and His communications?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the signs of God that We recite to thee in truth; in what manner of discourse then, after God and His signs, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the portents of Allah which We recite unto thee (Muhammad) with truth. Then in what fact, after Allah and His portents, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are God's revelations, which We recite to you in all truth. But if they deny God and His revelations, in what message will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the revelations of Allah which We rehearse Unto thee with truth: in what discourse then, after Allah and His revelations, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the signs of Allah that We recite for you in truth. So what discourse will they believe after Allah and His signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the Signs of Allah, which We rehearse to thee in Truth; then in what exposition will they believe after (rejecting) Allah and His Signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Ayat (proofs, evidences, verses, lessons, revelations, etc.) of Allah, which We recite to you (O Muhammad SAW) with truth. Then in which speech after Allah and His Ayat will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the verses of Allah. We recite them to you in truth. So in what speech, after Allah and His signs, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are God’s Verses which We recite to you in truth. In which message, after God and His revelations, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the verses of Allah which We recite to you in truth. Then in what statement after Allah and His verses will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:6] These, mentioned signs, are the signs of God, the proofs of His that indicate His Oneness, which We recite, relate, to you with truth (bi’l-haqqi is semantically connected to natlū, ‘We recite’). So in what [kind of] discourse then, after God, that is to say, [after] His discourse, namely, the Qur’ān, and His signs, His definitive arguments, will they, that is, the disbelievers of Mecca, believe? In other words: they will not believe [in anything] (a variant reading [for yu’minūna, ‘they believe’] has tu’minūna, ‘you believe’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These are the portents of Allah which We recite unto thee (Muhammad)) Gabriel brought them down to you 580 (with truth) in order to show you right and wrong. (Then in what fact) in what speech, (after Allah) after Allah's speech (and His portents) and His Scripture; and it is also said this means: and of His marvels, (will they believe) if they do not believe in this Qur'an?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ تِلْكَ } أي: آيات سموات الأرواح وأرض الجسم المطلق، أي الكل وآيات الأحياء من الموجودات وآيات سائر الحوادث من الكائنات { آيات الله } أي: آيات ذاته وصفاته وأفعاله { فبأيّ حديث بعد الله } وآيات صفاته وأفعاله { يُؤمِنُون } إذ لا موجود بعدها إلا حديث بلا معنى واسم بلا مسمى، كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { تَلْكَ } الآيات المجملة الكلية { ءَايَٰتُ ٱللَّهِ } أي: بعض آياته الدالة على نبذ من كمالاته، وإلا فلا يفي درك أحد من عباده لتفصيل كمالاتها كلها { نَتْلُوهَا } ونقصها { عَلَيْكَ } يا أكمل الرسل تأييداً لأمرك وتعظيماً لشأنك ملتبسة { بِٱلْحَقِّ } بلا ريب فيه وتردد، وإنما نتلوها عليك لتبين لهم بها طريق توحيدنا، وتنبههم على وحدة وكمالات أسمائنا وصفاتنا { فَبِأَيِّ حَدِيثٍ } أي: فهم بأي كلام وقول { بَعْدَ } نزول كتاب { ٱللَّهِ وَءَايَٰتِهِ } المنزلة من عنده المبينة لتوحيده { يُؤْمِنُونَ } [الجاثية: 6] يذعنون ويوقنون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تلك آياتُ الله } مبتدأ وخبر، و { نتلُوها عليك } حال، العامل: معنى الإشارة، أي: تلك الآيات المتقدمة هي آيات الله الدالة على وجوب وجوده واتصافه بأوصاف الكمال، حال كونها متلوةً عليك، ملتبسة { بالحق } أو: نتلوها محقين في ذلك: فالجار والمجرور: حال من المفعول أو الفاعل\n { فبأيّ حديثٍ } من الأحاديث { بعد الله وآياتهِ } أي: بعد آيات الله، كقولك: أعجبني زيد وكرمه، أي: أعجبني كرم زيد، أو: بعد حديث الله، الذي هو القرآن، وآياته العامة في كل شيء، فيكون على حذف مضاف، أو: يُراد بها القرآن أيضاً، والعطف للتغاير العنواني، فالأول من جهة كونه حديثاً حسناً، والثاني باعتبار كونه معجزاً، أي: فبأي حديثٍ بعد أحسن الحديث وأبهر الآيات { يؤمنون } يُصدِّقون؟! ومَن قرأ بالخطاب يُقدر: قل يا محمد\n الإشارة: قال القشيري: الحاء تدل على حياته، والميم تدل على مودته، كأنه قال: بحق حياتي ومودتي لأوليائي، لا شيء أعز على أحبائي من لقائي، العزيزُ في جلاله، الحكيم في فعاله، العزيز في أزله، الحكيم في لُطفه بالعبد بوصف إقباله\n قوله تعالى: { إِنَّ في السماوات والأرض\n\n\n } الآية شواهد الربوبية لائحةٌ، وأدلة الإلهية واضحةٌ، فَمَنْ صحا فكره عن سُكر الغفلة، ووضعَ سِرَّه في محل العِبْرة، حَظِيَ - لا محالة - بحقائق الوصلة\n هـ\n قلت: إنما يحظى بالوصلة إذا نفذت بصيرته إلى شهود المكوِّن، ولم يقف مع شيء من حس الكائنات، بل نفذ إلى ما فيها من أسرار المعاني، فعرف فيها مولاها، وشاهد فيها المتجلي بها، وإلا بَقِيَ مسجوناً محصوراً في ذاته\n قوله تعالى: { وفي خلقكم\n\n\n } الآية، قال القشيري: إذا أنعم العبدُ النظرَ في استواء قدِّه وقامته، واستكمال خلقه، وتمام تمييزه، وما هو مخصوص به من جوارحه وحوائجه، ثم فكّر فيما عداه من الدواب، وأجزائها وأعضائها، ووقف على اختصاصه، وامتياز بني آدم من بين البريَّة من الحيوانات، في الفهم والعقل والتمييز والعلم، ثم في الإيمان والعرفان، ووجوه خصائص أهل الصفوة من هذه الطائفة من فنون الإحسان عَرَف تخصيصهم بمناقبهم، وانفرادهم بفضلهم، فاستيقن أن الله أكرمهم، وعلى كثيرٍ من المخلوقات قَدَّمهم\n\n\nثم قال في قوله: { واختلاف الليل والنهار\n\n\n } الآية\n جعل الله العلومَ الدينية كسبيةً مُصحَّحةً بالدلائل، مُحتَفةً بالشواهد، فمَن لم يستبصرْ لها زلَّتْ قَدَمُه عن الصراط المستقيم، ووقع في عذاب الجحيم، فاليومَ في ظلمة الحيرة والتقليد، وفي الآخرة في التخليد في الوعيد\n هـ\n قلت: النظر في دلائل الكائنات من غير تنوير، ولا صحبة أهل التنوير، لا تزيد إلا حيرة، ولذلك قال بعضهم: إيمان أهل علم الكلام كالخيط في الهواء، يميل مع كل ريح، فالتقليد حينئذ أسلم، والتمسك بظاهر الكتاب والسنة أتم، ومَن سقط على العارفين بالله، لم يحتج إلى دليل ولا شاهد، وأغناه شهود الشهيد عن كل شاهد\n\n\nكيف يُعرف بالمعارف مَن به عُرفت المعارف؟! تنزّه الحق تعالى أن يفتقر إلى دليل يدلّ عليه، بل به يستدل على غيره، فلا يجد غيره\n تلك آيات شواهد نتلوها عليك لترانا فيها، لا لتراها مفروقةً عنا، ولذلك قال تعالى: { بالحق } أي: ملتبسة بنور الحق، الله نور السموات والأرض\n قوله تعالى: { فبأي حديث\n\n\n } الآية، قال القشيري: فَمَنْ لا يؤمن بها فبأي حديث يؤمن؟ ومن أي أصل ينشأ بعده؟ ومن أي بحر في التحقيق يغترف؟ هيهات ما بقي للإشكال في هذا مجال\n هـ\n ثم ذكر حال مَن أعرض عنها، فقال: { وَيْلٌ لِّكُلِّ أَفَّاكٍ أَثِيمٍ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:50",
      "similarity": 0.7565337160023945
    },
    {
      "verse": "2:252",
      "similarity": 0.5795957439778244
    },
    {
      "verse": "52:34",
      "similarity": 0.5489788158173888
    },
    {
      "verse": "3:108",
      "similarity": 0.5185369031296805
    },
    {
      "verse": "20:9",
      "similarity": 0.5147922791736331
    }
  ]
}