{
  "chapter": "الجاثية",
  "text": "يسمع ءايت الله تتلى عليه ثم يصر مستكبرا كان لم يسمعها فبشره بعذاب اليم",
  "translations": [
    {
      "translation": "who hears the Signs of Allah recited to him and then persists in his arrogance just as if he had never heard them. Give him the news of a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the revelations of God being recited to him, yet persists in denying with arrogance as though he had never heard them! So warn him of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who hears Allah's Signs being rehearsed to him, and yet persists in his pride, as though he had not heard it. Announce to him, then, the tidings of a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hears the revelations of God which are recited to him, then persists in his arrogance as if he had not even heard them. Tell him that he will suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the verses of Allah which are recited to him, then remains stubborn, proud, as if he did not hear them; therefore give him the glad tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the Ayat of Allah Tutla (recited) to him, yet persists with pride as if he heard them not. So announce to him a painful torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the communications of Allah recited to him, then persists proudly as though he had not heard them; so announce to him a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who hears the signs of God being recited to him, then perseveres in waxing proud, as if he has not heard them; so give him the good tidings of a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who heareth the revelations of Allah recited unto him, and then continueth in pride as though he heard them not. Give him tidings of a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hears God's revelations being recited to him, yet persists in his arrogance as if he had never heard them. Forewarn him of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who heareth the revelations of Allah rehearsed Unto him, and yet persisteth with stiff-neckedness as though he heard them not. Announce thou Unto him, then, a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who hears the signs of Allah being recited to him, yet persists arrogantly as if he had not heard them. So inform him of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hears the Signs of Allah rehearsed to him, yet is obstinate and lofty, as if he had not heard them: then announce to him a Penalty Grievous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the Verses of Allah (being) recited to him, yet persists with pride as if he heard them not. So announce to him a painful torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hears the verses of Allah recited to him and then, as though he never heard them, persists in insolence. Give to him the glad tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears God's revelations being recited to him, yet he persists arrogantly, as though he did not hear them. Announce to him a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the verses of Allah recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:8] who hears the signs of God, the Qur’ān, being recited to him, then persists, in his disbelief, arrogantly, disdainful of faith, as if he had not heard them. So give him tidings of a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who heareth the revelations of Allah) who hears the recitation of Allah's verses (recited unto him) explaining the commands and prohibitions, (and then continueth in pride) in his disbelief too proud to believe in Muhammad (pbuh) and the Qur'an (as though he heard them not) as though he did not understand them. (Give him) Muhammad (tidings of a painful doom) and so he was killed in captivity on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وإثم الشرك بنسبة الأفعال لذلك الوجود { يسمع آيات الله } من كل موجود قائل بلسان الحال أو القال { تتلى عليه } على لسان كل شيء إلا على لسان النبي وحده { ثم يصرّ مستكبراً } في نسبتها إلى الغير لاحتجابه بوجوده واستكباره وأنائيته لفرط تفرعنه أو لغرّته وغفلته { كأن لم يسمعها } لعدم تأثره بها { فبشره بعذاب } الحجاب المؤلم والحرمان الموبق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إلى حيث: { يَسْمَعُ ءَايَٰتِ ٱللَّهِ } الدالة على عظمة ذاته حين { تُتْلَىٰ عَلَيْهِ } مع كمال وضوحها وسطوعها { ثُمَّ يُصِرُّ } يقيم ويديم على ما هو عليه من الكفر والضلال { مُسْتَكْبِراً } بلا علة وسند سوى العناد والاستكبار\n ويصير من نهاية عتوه وعناده حين يسمعها { كَأَن لَّمْ يَسْمَعْهَا } اغتراراً بما عنده من الجاه والثروة\n وبالجملة: { فَبَشِّرْهُ } يا أكمل الرسل على إصراره وعناده { بِعَذَابٍ أَلِيمٍ } [الجاثية: 8] في غاية الإيلام\n وهو انحطاطه عن رتبة الخلافة الإنسانية\n إذ لا عذاب عند العارف أشد من ذلك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم يُصِرُّ } أي: يُقيم على كفره\n حال كونه { مستكبراً } عن الإيمان بالآيات\n والإذعان لما تنطق به من الحق\n مُزْدرياً بها\n مُعجَباً بما عنده من الأباطيل\n قيل: نزلت في النضر بن الحارث\n وكان يشتري من أحاديث الأعاجم\n ويشغل بها الناس عن سماع القرآن\n والآية عامة في كل مَن كان مضاراً لدين الله وجيء بثمّ لأن الإصرارَ على الضلالة\n والاستكبار عن الإيمان عند سماع آيات القرآن\n مستبعدٌ في العقول\n ثم قال: { كأن لم يسمعها } أي: كأنه لم يسمعها\n فأن مخففة\n ومحل الجملة النصب على الحال\n أي: يُصر شبيهاً بغير السامع\n { فبشِّره } على إصراره واستكباره { بعذابٍ أليم } أي: أخبره خبر يظهر أثره على البشرة\n تهكُّماً به\n { وإِذا عَلِمَ من آياتنا شيئاً } أي: إذا بلغه من آياتنا شيئاً يمكن أن يتشبّث بها المعاند\n ويجد له محملاً فاسداً يتوسل به إلى الطعن والمغمزة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:135",
      "similarity": 0.5508353613808007
    },
    {
      "verse": "31:7",
      "similarity": 0.5061053532644484
    },
    {
      "verse": "3:117",
      "similarity": 0.47127692722876835
    },
    {
      "verse": "11:68",
      "similarity": 0.41567090254492306
    },
    {
      "verse": "11:95",
      "similarity": 0.3891535317374342
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/45:8.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/45:8.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/45:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}