{
  "chapter": "الجاثية",
  "text": "واذا علم من ءايتنا شيـا اتخذها هزوا او۟لئك لهم عذاب مهين",
  "translations": [
    {
      "translation": "When he does learn something of Our Signs, he makes a mockery of them. Such people will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he comes to know something of Our messages he makes fun of them: For them is shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever he comes to know anything of Our Signs, he makes them an object of jest. For such there awaits a humiliating chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he learns about some of Our revelations, he mocks them. Such people will suffer a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he comes to know about any of the verses, he mocks at it; for them is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our Ayat, he makes them a jest. For such there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he comes to know of any of Our communications, he takes it for a jest; these it is that shall have abasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he knows anything of Our signs, he takes them in mockery; those for them awaits a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he knoweth aught of Our revelations he maketh it a jest. For such there is a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he learns something of Our revelations, he derides them: for such there will be humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he cometh to know aught of Our revelations, he taketh it scoffingly. These! theirs shall be a torment ignominous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should he learn anything about Our signs, he takes them in derision. For such there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our Signs, he takes them in jest: for such there will be a humiliating Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our Verses (this Quran), he makes them a jest. For such there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for he who knows something of Our verses and then mocks them for those there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our revelations, he takes them in mockery. For such there is a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:9] And should he come to know anything of Our signs, namely, the Qur’ān, he takes them in mockery. For such, liars — there is a degrading chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he knoweth) and when he hears (aught of Our revelations he maketh it a jest) a mockery. (For such) for people like al-Nadr Ibn al-Harith (there is a shameful doom) there is a severe torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من نهاية استكباره واغتراره { إِذَا عَلِمَ مِنْ ءَايَٰتِنَا } الدالة على ضبط الظواهر وتهذيب البواطن { شَيْئاً } أي: آية { ٱتَّخَذَهَا } وأخذها من غاية تكبره وتجبره { هُزُواً } محل استهزاء وسخرية يستهزأ بها ويتهكم عليها { أُوْلَـٰئِكَ } البعداء الأفاكون الضالون، المنحرفون عن منهج الحق وصراطه { لَهُمْ عَذَابٌ مُّهِينٌ } [الجاثية: 9] في الدنيا بإعلاء كلمة الحق وإظهار دين الإسلام على الأديان كلها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا عَلِمَ من آياتنا شيئاً } أي: إذا بلغه من آياتنا شيئاً يمكن أن يتشبّث بها المعاند، ويجد له محملاً فاسداً يتوسل به إلى الطعن والمغمزة، { اتخذها } أي: مهزوءاً بها، لا ما يسمعه فقط، وإنما لم يقل: اتخذه للإشعار بأنه إذا أحسّ بشيء من الكلام فيه شيء بزعمه الركيك لم يقتصر على الاستهزاء بما بلغه، بل يستهزئ بالجميع، ويجوز أن يرجع الضمير لشيء لأنه في معنى الآية\n { أولئك لهم } بسبب جناياتهم المذكورة { عذابٌ مُهين } وصف العذاب بالإهانة توفية لحق استكبارهم واستهزائهم بآيات الله تعالى، وجمع الإشارة باعتبار ما في { كل أفَّاك أثيم } من الشمول، كما في قوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:57",
      "similarity": 0.6438353910255327
    },
    {
      "verse": "19:9",
      "similarity": 0.5681772141135216
    },
    {
      "verse": "21:36",
      "similarity": 0.5321537326684653
    },
    {
      "verse": "18:106",
      "similarity": 0.5062636286398117
    },
    {
      "verse": "19:21",
      "similarity": 0.5051566058924789
    }
  ]
}