{
  "chapter": "الجاثية",
  "text": "واذا علم من ءايتنا شيـا اتخذها هزوا او۟لئك لهم عذاب مهين",
  "translations": [
    {
      "translation": "When he does learn something of Our Signs, he makes a mockery of them. Such people will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he comes to know something of Our messages he makes fun of them: For them is shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever he comes to know anything of Our Signs, he makes them an object of jest. For such there awaits a humiliating chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he learns about some of Our revelations, he mocks them. Such people will suffer a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he comes to know about any of the verses, he mocks at it; for them is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our Ayat, he makes them a jest. For such there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he comes to know of any of Our communications, he takes it for a jest; these it is that shall have abasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he knows anything of Our signs, he takes them in mockery; those for them awaits a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he knoweth aught of Our revelations he maketh it a jest. For such there is a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he learns something of Our revelations, he derides them: for such there will be humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he cometh to know aught of Our revelations, he taketh it scoffingly. These! theirs shall be a torment ignominous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should he learn anything about Our signs, he takes them in derision. For such there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our Signs, he takes them in jest: for such there will be a humiliating Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our Verses (this Quran), he makes them a jest. For such there will be a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for he who knows something of Our verses and then mocks them for those there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he learns something of Our revelations, he takes them in mockery. For such there is a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[45:9] And should he come to know anything of Our signs, namely, the Qur’ān, he takes them in mockery. For such, liars — there is a degrading chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he knoweth) and when he hears (aught of Our revelations he maketh it a jest) a mockery. (For such) for people like al-Nadr Ibn al-Harith (there is a shameful doom) there is a severe torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذا علم من آياتنا شيئاً اتخذها هزواً } بنسبتها إلى من لا وجود له أصلاً { أولئك لهم عَذَاب مهين } في ذلّ الإمكان { إنّ في ذلك لآياتٍ لقوم يتفكرون } أي: في تسخير ما في السموات وما في الأرض لكم دلائل لمن يتفكر في نفسه من هو؟ ولماذا سخّر له هذه الأشياء؟ حتى الملكوت والجبروت منه من جهته فيرجع إلى ذاته ويعرف حقيقته وسرّ وجوده وخاصيته التي بها شرّف وفضل عليها وأهل لتسخيرها له فيأنف عن التأخر عن رتبة أشرفها فضلاً عن أخسها ويترقى إلى غايته التي يندب إليها\n { ثم جعلناك على شريعة } طريقة من أمر الحق هي طريقة التوحيد { فاتَّبعها } بسلوكها على بينة وبصيرة { ولا تتَّبع } جهالات أهل التقليد { الذين لا يعلمون } علم التوحيد { إنَّهم لن يغنوا عنك من الله شيئاً } أي: لن يدفعوا عنك ضرّاً بأفعالهم لعدم تأثيرهم ولا جهالة وحجاباً بأوصافهم لعدم قواهم وقدرهم وعلومهم\n إذ لا حول ولا قوّة إلا بالله ولا وحشة بحضورهم إذ لا مناسبة بينك وبينهم فتستأنس بهم بل لا أنس لك إلا بالحق وهم لا شيء محض في شهودك فلا موالاة بينك وبينهم بوجه وإنما موالاة الظالمين ليست إلا مع الظالمين لما بينهم من الجنسية والمناسبة في الاحتجاب { والله وليّ المتّقين } أي: متولي أمور من اتقى أفعاله بالتوكل عليه في شهود توحيد الأفعال أو ناصر من اتقى صفاته في مقام الرضا بمشاهدة تجليات الصفات أو حبيب من اتقى ذاته في شهود توحيد الذات إذ الوليّ يستعمل بالمعاني الثلاثة لغة\n { هذا } أي: هذا البيان { بصائر } أي: بيّنات لقلوب الذين طالعوا بهجة الصفات\n يطالعون بكل بصيرة تجلي طلعة صفته { وهدىً } لأرواحهم إلى محل شهود الذات { ورحمة } لنفوسهم من عذاب حجاب الأفعال { لِقَوْم يوقِنُون } هذه البيانات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من نهاية استكباره واغتراره { إِذَا عَلِمَ مِنْ ءَايَٰتِنَا } الدالة على ضبط الظواهر وتهذيب البواطن { شَيْئاً } أي: آية { ٱتَّخَذَهَا } وأخذها من غاية تكبره وتجبره { هُزُواً } محل استهزاء وسخرية يستهزأ بها ويتهكم عليها { أُوْلَـٰئِكَ } البعداء الأفاكون الضالون\n المنحرفون عن منهج الحق وصراطه { لَهُمْ عَذَابٌ مُّهِينٌ } [الجاثية: 9] في الدنيا بإعلاء كلمة الحق وإظهار دين الإسلام على الأديان كلها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اتخذها } أي: مهزوءاً بها\n لا ما يسمعه فقط\n وإنما لم يقل: اتخذه للإشعار بأنه إذا أحسّ بشيء من الكلام فيه شيء بزعمه الركيك لم يقتصر على الاستهزاء بما بلغه\n بل يستهزئ بالجميع\n ويجوز أن يرجع الضمير لشيء لأنه في معنى الآية\n { أولئك لهم } بسبب جناياتهم المذكورة { عذابٌ مُهين } وصف العذاب بالإهانة توفية لحق استكبارهم واستهزائهم بآيات الله تعالى\n وجمع الإشارة باعتبار ما في { كل أفَّاك أثيم } من الشمول\n كما في قوله تعالى:\n[المؤمنون: 53]\n وأفرد فيما سبق من الضمائر باعتبار كل واحدٍ واحد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:57",
      "similarity": 0.6438353910255327
    },
    {
      "verse": "19:9",
      "similarity": 0.5681772141135216
    },
    {
      "verse": "21:36",
      "similarity": 0.5321537326684653
    },
    {
      "verse": "18:106",
      "similarity": 0.5062636286398117
    },
    {
      "verse": "19:21",
      "similarity": 0.5051566058924789
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/45:9.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/45:9.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/45:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}