{
  "chapter": "الأحقاف",
  "text": "وقال الذين كفروا۟ للذين ءامنوا۟ لو كان خيرا ما سبقونا اليه واذ لم يهتدوا۟ به فسيقولون هذا افك قديم",
  "translations": [
    {
      "translation": "Those who are kafir say of those who have iman, 'If there was any good in it, they would not have beaten us to it.' And since they have not been guided by it, they are bound to say, 'This is an antiquated falsehood.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny say of those who believe: \"Had there been any good in it they would not have preceded us in coming to it.\" Since they have not taken guidance from it, they will say: \"This is the same old lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say to the believers: If there was any good in this Book, others would not have beaten us to its acceptance.” But since they have not been guided to it, they will certainly say: “This is an old fabrication.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers have said about the believers, \"Had there been anything good in it (Quran), they could not have accepted it before us\" Since they do not benefit from its guidance, they say, \"It (Quran) is only a fabricated legend\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said regarding the Muslims, “If there were any good in it, the Muslims would not have surpassed us in achieving it!”; and since they did not receive guidance with it, they will now say, “This is an old slander.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say of those who believe: \"Had it been a good thing, they (the poor believers) would not have preceded us to it!\" And when they have not been guided by it, they say: \"This is ancient falsehood!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say concerning those who believe: If it had been a good, they would not have gone ahead of us therein. And as they do not seek to be rightly directed thereby, they say: It is an old lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, as regards the believers, 'If it had been aught good, they had not outstripped us to it.' And since they are not guided by it, certainly they will say, 'This is an old calumny!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say of those who believe: If it had been (any) good, they would not have been before us in attaining it. And since they will not be guided by it, they say: This is an ancient lie;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say of the believers, \"If there were any good in this Quran, they would not have believed in it before we did.\" And since they refuse to be guided by it, they say, \"This is an ancient fabrication.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say of those who believe: had it been good, they would not have preceded us thereto. And when they have not let themselves be guided thereby, they say: this is an ancient falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say about the faithful, ‘Had it been [anything] good, they would not have taken the lead over us toward [accepting] it.’ And since they could not find the way to it, they will say, ‘It is an ancient lie.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say of those who believe: \"If (this Message) were a good thing, (such men) would not have gone to it first, before us!\" And seeing that they guide not themselves thereby, they will say, \"this is an (old,) falsehood!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve (strong and wealthy) say of those who believe (weak and poor): \"Had it (Islamic Monotheism to which Muhammad SAW is inviting mankind) been a good thing, they (weak and poor) would not have preceded us thereto!\" And when they have not let themselves be guided by it (this Quran), they say: \"This is an ancient lie!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say of the believers: 'Had it been any good they would not have believed in it before us' And because they are not guided by it they say: 'This is an ancient falsehood'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say to those who believe, “If it were anything good, they would not have preceded us to it.” And since they were not guided by it, they will say, “This is an ancient lie.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say of those who believe, \"If it had [truly] been good, they would not have preceded us to it.\" And when they are not guided by it, they will say, \"This is an ancient falsehood.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:11] And those who disbelieve say of those who believe, that is, [they say] with regards to them: ‘Had it, faith, been [anything] good, they would not have attained it before us’. And since they, the ones [now] speaking, will not be guided by it, that is, [by] the Qur’ān, they say, ‘This, that is, the Qur’ān, is an ancient lie!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who disbelieve) Asad, Ghatafan and Hanzalah (say of those who believe) Juhaynah, Muzaynah and Aslam: (If it had been (any) good) if what Muhammad (pbuh) says had any good or truth in it, (they would not have been before us in attaining it) Juhaynah, Muzaynah and Aslam would not have been first to accept it. (And since they will not be guided by it) and since Asad and Ghatafan do not believe in Muhammad (pbuh) and the Qur'an, (they say: This is an ancient lie) this Qur'an is an ancient lie;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة شقاقهم ونفاقهم { قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ آمَنُواْ } أي: لأجلهم وفي حقهم { لَوْ كَانَ } الإيمان وبما أتى به محمد من الدين { خَيْراً } مما نحن عليه { مَّا سَبَقُونَآ إِلَيْهِ } بأنواع الكرامة والجاه والثورة إذا هو ومن تبعه كلهم أراذل سقاط رعاة فقراء\n فاقدين لوجه الكفاف\n ونحن أغبياء ذوو الحظ من الناس\n إنما قالته قريش حين افتخروا على المؤمنين وقصدوا إضلالهم وإذلالهم { وَ } لا تبال يا أكمل الرسل بهم وبعنادهم بك وبكتابك { إِذْ لَمْ يَهْتَدُواْ بِهِ } أي: بالقرآن { فَسَيَقُولُونَ } من جهلهم وضلالهم: { هَـٰذَآ إِفْكٌ قَدِيمٌ } [الأحقاف: 11] وأساطير الأولين\n\n\n{ وَ } عليك يا أكمل الرسل أن لا تلتفت إلى هذياناتهم وأباطيلهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقوله الحق جلّ جلاله: { وقال الذين كفروا للذين آمنوا } أي: لأجلهم\n وهو كلام كفار مكة\n قالوا: إنَّ عامة مَن يتبع محمد السُّقاط\n يعنون الفقراء\n كعمار وصهيب وبلال وابن مسعود رضي الله عنهم\n قالوا: { لو كان } ما جاء به محمد من القرآن والدين { خيراً ما سبقونا إِليه } فإن معالي الأمور لا تنالها أيدي الأرذال\n فإنَّ عامتهم فقراء وموالٍ ورُعاة\n قالوه زعماً منهم أن الرئاسة الدينية مما تُنال بأسباب دنيوية\n كما قالوا:\n[الزخرف: 31]\n وضلّ عنهم أنها منوطة بكمالات نفسانية\n وملكات روحانية\n مبناها: الإعارض عن زخارف الدنيا\n والإقبال على الله بالكلية\n وأنّ مَن فاز بها حازها بحذافيرها\n ومَن حرمها فما له عند الله من خلاق\n والحاصل: أن هذه المقالة سببها الرضا عن النفس\n وهو صل كل معصية وغفلة\n ثم قال تعالى: { وإِذ لم يهتدوا به } العامل في الظرف محذوف لدلالة الكلام عليه\n أي: وإذ لم يهتدوا به ظهر عنادهم\n وقالوا ما قالوا: { فسيقولون } غير مكتفين بنفي خيريته: { هذا إِفك قديم } أي: كذب متقادم\n كقوله:\n[الأنعام: 25]\n وقال القشيري: إنه تكذيب للرسل فيما بُيّن لهم\n فما أُنزل عليهم من بعثة محمد رسولاً\n يعني: فيكون كقوله تعالى:\n[القصص: 48\n الزخرف: 30]\n وقيل لابن عباس: أين نجد في القرآن \" مَن كره شيئاً عاداه \" \n فقرأ هذه الآية: { وإذ لم يهتدوا\n\n } الخ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:12",
      "similarity": 0.4526195211027585
    },
    {
      "verse": "51:9",
      "similarity": 0.421474051884116
    },
    {
      "verse": "46:22",
      "similarity": 0.3973586333391159
    },
    {
      "verse": "37:86",
      "similarity": 0.38556532409231303
    },
    {
      "verse": "70:41",
      "similarity": 0.37480917533751423
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}