{
  "chapter": "الأحقاف",
  "text": "او۟لئك اصحب الجنة خلدين فيها جزاءۢ بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Such people are the Companions of the Garden, remaining in it timelessly, for ever, as repayment for what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are men of Paradise where they will abide for ever as a recompense for what they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the people of Paradise. They shall remain in it forever as a reward for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be the dwellers of Paradise wherein they will live forever as a reward for what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the People of Paradise, abiding in it forever; the reward of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such shall be the dwellers of Paradise, abiding therein (forever) -- a reward for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the dwellers of the garden, abiding therein: a reward for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the inhabitants of Paradise, therein dwelling forever, as a recompense for that they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are rightful owners of the Garden, immortal therein, as a reward for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is they who are the people of Paradise, they shall abide therein as a reward for all that they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the fellows of the Carden: abiders therein: a recompense for that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be the inhabitants of paradise, remaining in it [forever]—a reward for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such shall be Companions of the Gardens, dwelling therein (for aye): a recompense for their (good) deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such shall be the dwellers of Paradise, abiding therein (forever), a reward for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, they shall be for ever the inhabitants of Paradise, a recompense for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the inhabitants of Paradise, where they will dwell forever—a reward for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the companions of Paradise, abiding eternally therein as reward for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:14] Those will be the inhabitants of Paradise, abiding therein (khālidīna fīhā is a circumstantial qualifier) as a reward (jazā’an is in the accusative as a verbal noun, because of the implied verbal action, that is to say, yujzawna, ‘they will be rewarded’) for what they used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such are rightful owners of the Garden, immortal thereafter) they will dwell therein forever, never to die nor leave it (as a reward for what they used to do) and say in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أولئك أصحاب الجنة } المطلقة الشاملة للجنان كلها { خالدين فيها جَزَاءَ بما كانوا يَعْمَلون } في حال السلوك حتى الوصول { حتى إذا بَلَغ أشُدّه وبَلَغ أربعين سنة } لما كانت النفس ممنوّة بتدبير البدن لتوقف استكمالها عليه مشغولة عن كمالها به في أول النشأة لم تنفتح بصيرتها ولم يصف إدراكها ولم يتبين رشدها إلا وقت بلوغ النكاح كما قال في اليتامى:\n\n[النساء، الآية:6] وذلك هو الأشد الصوري\n ألا ترى أن الطبيعة من وقت الطفولة إلى هذا الحد لا تتفرغ إلى تحصيل مادة النوع عن إيرادها ما يزيد في الأقطار من الغذاء زائداً على بدل المتحلل من البدن لضعف الأعضاء وشدةّ الاحتياج إلى النمو والتصلب، فالنفس حينئذ منغمسة في البدن، مستعملة للطبيعة في ذلك العمل، ذاهلة عن كمالها إلى هذا الأجل، فلما قربت الآلات من حدّ كمالها ووصلت إلى ما يصلح لاستعمالها في تصرفاتها وانتقص الاحتياج إلى ما يزيد في أقطارها تفرّغت الطبيعة إلى ذخيرة مادة النوع من الشخص لاستغنائها بكمال الشخص عن مادته فتفرّغت النفس إلى تحصيل كمالها، فانفتحت بصيرة عقلها وظهرت أنوار فطرتها واستعدادها وتنبّهت عن نومها في مهدها، وتيقظت عن سنة غفلتها وتفطّنت لقدس جوهرها وطلبت مركزها وغايتها لأمرين: صلاحية الآلات للاستعمال في الاستكمال وفراغها عن تخصيص البدن بالإقبال لقلة الإشغال، لكنها ما دامت سنّ النموّ باقية وزيادة الآلاف في القوة والشدة ممكنة ما توجهت بالكلية إلى الجهة العلوية وما تجرّدت لتحصيل الكمالات العقلية والمطالب القدسية للاشتغال المذكور وإن قلّ وذلك إلى منتهى الثلثين من السن كما تبين في علم الطب، فلما جاوزتها وأخذت في سنّ الوقوف أقبلت إلى عالمها وأشرقت أنوار فطرتها فاشتدّت في طلب كمالها لوقوع الفراغ لها إليها، فأخذ كافل الأيتام الحقيقية الذي هو روح القدس أن آنس رشدها في دفع أموالها التي هي الحقائق والمعارف والعلوم والحكم إليها، لبلوغها نكاح الغواني من المفارقات القدسية والنورانيات الجبروتية وذلك وقت سيرها في صفات الله إلى ذات الله حتى الفناء التام بالاستغراق في عين الجمع لإمكان السير في أفعاله من وقت الأشدّ الصوري إلى أشدّ هذا الأشدّ المعنوي الذي نهايته الأربعون تقريباً\n\n\nولهذا قيل: الصوفيّ بعد الأربعين أبذّ، إذ لم يستعدّ بالتوجه والطلب والسير في الأفعال بالتزكية لقبول تلك الأموال والتصرف فيها فلم يأنس روح القدس منه الرشد فلم يدفع إليه، وإذا تم سيره في الله عند ذلك الأشدّ بالفناء فيه كان وقت البقاء بعد الفناء وأوان الاستقامة في العمل\n وأشار إليها بقوله: { ربّ أوْزعني } ولهذا لم يبعث نبي قط إلا بعد الأربعين سوى عيسى ويحيى ومع ذلك وقفا في بعض السموات\n ولما كانت النعم أوابد يجب تقييدها بالشكر استوزع الشكر على نعمة الكمال الحاصل المسبوق بالنعم الغير المتناهية لمحافظتها لئلا يحتجب برؤية الفناء فيترك الطاعة تبرّماً لحاله واتكالاً على كماله، فإن آفة مقام الفناء رؤية الفناء والمبتلى بها يقع في التلوين ويحرم نعمة التمكين، ولهذا قال عليه السلام:\n\n \" أفلا أكون عبداً شكوراً \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:82",
      "similarity": 0.7739068798048834
    },
    {
      "verse": "2:39",
      "similarity": 0.6029778566851798
    },
    {
      "verse": "81:22",
      "similarity": 0.5624453022052193
    },
    {
      "verse": "7:36",
      "similarity": 0.5582308739977523
    },
    {
      "verse": "59:17",
      "similarity": 0.5094924114640272
    }
  ]
}