{
  "chapter": "الأحقاف",
  "text": "ولكل درجت مما عملوا۟ وليوفيهم اعملهم وهم لا يظلمون",
  "translations": [
    {
      "translation": "Everyone will be ranked according to what they did. We will pay them in full for their actions and they will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each will have a position in accordance with his deeds; and no wrong will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of these all have ranks according to their deeds so that Allah may fully recompense them for their deeds. They shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone will have a position proportionate to the degree of his deeds. Finally, God will recompense them for their deeds and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all persons are ranks according to their deeds; and so that He may repay them in full for their deeds, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all, there will be degrees according to that which they did, so that He might fully recompense for their deeds. And they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all are degrees according to what they did, and that He may pay them back fully their deeds and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All shall have their degrees, according to what they have wrought, and that He may pay them in full for their works, and they not being wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all there will be ranks from what they do, that He may pay them for their deeds; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All will be ranked according to their deeds. We will requite them in full for their actions and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for each are ranks according to that which they have worked, that He may repay them in full for their works; and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For everyone there are degrees [of merit] pertaining to what he has done: He will recompense them fully for their works, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to all are (assigned) degrees according to the deeds which they (have done), and in order that (Allah) may recompense their deeds, and no injustice be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all, there will be degrees according to that which they did, that He (Allah) may recompense them in full for their deeds. And they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each shall have their degrees, according to what they have done, so that He will recompense them for their works, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are degrees for everyone, according to what they have done, and He will repay them for their works in full, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all there are degrees [of reward and punishment] for what they have done, and [it is] so that He may fully compensate them for their deeds, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:19] And for each one, of both categories, believer and disbeliever, there will be degrees [of status] , thus the degrees of the believers in Paradise are high, while the degrees of disbelievers in the Fire are despicable, according to what they have done, that is to say, [according to what] believers [have done] in the way of acts of obedience, and disbelievers, in the way of acts of disobedience, and that He may recompense them fully, namely, God (li-yuwaffiyahum: a variant reading has li-nuwaffiyahum, ‘that We may recompense them fully’) for their deeds, that is, [pay them] their deserts, and they will not be wronged, [not even] in a single thing that may be diminished for believers or increased for disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "587 (And for all) for each person among the believers and disbelievers (there will be ranks) the believers will have ascending ranks in the Garden while the disbelievers will have descending ranks in the Fire (from what they do) due to their works in the life of the world, (that He may pay them for their deeds) that He may pay them the reward of their deeds, (and they will not be wronged) their good deeds will not be diminished nor will their evil deeds be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولكل درجات } لما ذكر السابقين وعقبهم بذكر من يقابلهم من المطرودين الذين حقّ عليهم القول وبين أنّ الفريق الأول في عداد السعداء والفريق الثاني من جملة الأشقياء\n تناول الكلام الأصناف السبعة المذكورة في أول الكتاب للتصريح بذكر الصنفين اللذين هما الأصل في الإيمان والكفر\n والتعريض بذكر الخمسة الباقية فقال: { ولكل درجاتٌ مما عملوا } أي: ولكل صنف من أصناف الناس درجات من جزاء أعمالهم من أعلى عليين إلى أسفل سافلين\n وغلب الدرجات على الدركات بل لكل أحد من كل صنف رتبة ومقام وموقع قدم من إحدى الجنان أو طبقات النيران\n { أذهبتم طيباتكم في حياتكم الدنيا } أنكر عليهم إذهاب جميع الحظوظ في لذات الدنيا لأن لكل أحد بحسب استعداده الأول كمالاً ونقصاً يقابله\n وبحسب وقت تكوّنه في هذا العالم سعادة عاجلة وشقاوة تقابلها فله بحسب كل واحدة من النشأتين طيبات وحظوظ تناسب كلا كماليه\n فمن أقبل بوجهه على طيبات الدنيا وحظوظها والاستمتاع بها وأعرض بقلبه عن طيبات الأخرى ولذاتها حرم الثانية أصلاً لانغماسه في الأمور الظلمانية واحتجاجه عن المطالب النورانية\n كما قال تعالى:\n[البقرة\n الآية:200]\n وذلك معنى قوله: { أذهبتم طيباتكم في حياتكم الدنيا } لأن حظوظ الأخروية التي تقتضيها هويته ذهب في هذه\n فكان ما زاد في النهار نقص من الليل\n وأما من أقبل بوجهه إلى الأخرى وتنزّه عن هذه بالزهد والتقوى ورغب في المعارف الحقيقية والحقائق الإلهية واللذات العلوية والأنوار القدسية التي هي الطيبات بالحقيقة فقد أوتي منها حظه ولم ينقص من حظوظه العاجلة على قياس الأول بل وفر منها نصيبه كما قال:\n[الشورى\n الآية:20] وذلك لأن الاستغراق في عالم القدس والتوجه إلى جناب الحق يورث النفس قوة وقدرة تؤثر بها في عالم الحسّ\n فكيف إذا اتصلت بمنبع القوى والقدر\n أما ترى أن عالم الملكوت مؤثر في عالم الملك متصرّف فيه\n قاهر له بإذن الله تعالى؟\n وتسخيره والانهماك في عالم الحسْ يخمد قوة الفطرة ويطفىء نور القلب فلا تبقى له قدرة ولا قوة ولا تأثير في شيء\n وكيف وقد تأثرت عمّا من شأنه التأثر المحض وتسخرت لما من شأنه التسخر الصرف والانفعال المطلق؟\n ولهذا قيل: الدنيا كالظل تتبع من أعرض عنها وتفوت من أقبل إليها\n وقال أمير المؤمنين رضي الله عنه: \" من أقبل إليها فاتته ومن أعرض عنها أتته \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلما أن { لِكُلٍّ } من المحقين والمبطلين { دَرَجَٰتٌ } من الثواب والعقاب متفاوتة شدةً وضعفاً\n ورفعةً ودناءةً\n منتشئة { مِّمَّا عَمِلُواْ } مترتبة عليه خيراً كان أو شراً\n حسنات أو سيئات { وَ } كل منهم متعلق بعمله\n يشاكل عليه { لِيُوَفِّيَهُمْ أَعْمَٰلَهُمْ } ويوفى عليهم جزاءهم المترتب عليها درجات أو دركات { وَهُمْ لاَ يُظْلَمُونَ } [الأحقاف: 19] بالزيادة والنقصان على أجور ما كسبوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولكلٍّ } من الفريقين المذكورين\n الأبرار والفجار\n { درجاتٌ مما عملوا } أي: منازل ومراتب من جزاء ما عملوا من الخير والشر\n ويقال في جانب الجنة: درجات\n وفي جانب النار: دركات\n فغلب هنا جانب الخير\n قال الطيبي: ولكلٍّ من الجنسين المذكورين درجاتٌ\n والظاهر أن أحد الجنسين ما دلّ عليه قوله:\n[الأحقاف: 13]\n والآخر قوله: { والذي قال لوالديه أُف لكما } ثم غلب الدرجات على الدركات\n لأنه لمّا ذكر الفريق الأول\n ووصفَهم بثباتٍ في القول\n واستقامةٍ في الفعْل\n وعقَّب ذلك بذكر فريقِ الكافرين\n ووصفهم بعقوق الوالدين\n وبإنكارهم البعثَ\n وجعل العقوقَ أصلاً في الاعتبار\n وكرر في القِسم الأول الجزاء\n وهو ذكر الجنة مراراً ثلاثاً\n وأفْردَ ذكر النار\n وأخّره\n وذكرَ ما يجمعُهما\n وهو قوله: { ولكلٍّ درجات } غلّب الدرجات على الدركات لذلك\n وفيه ألا شيء أعظم من التوحيد والثبات عليه\n وبر الوالدين والإحسان إليهما\n ولا شيء أفحش من عقوق الوالدين\n وإنكار الحشر\n وفي إيقاع إنكار الحشر مقابلاً لإثبات التوحيد الدلالة على أن المنكر معطل مبطل لحكمة الله في إيجاد العالم\n\nهـ\n { ولنُوفيهم أعمالهم } وقرأ المكي والبصري بالغيب\n أي: وليوفيهم الله جزاء أعمالهم\n { وهم لا يُظلمون } بنقص ثواب الأولين\n وزيادة عقاب الآخرين\n واللام متعلقة بمحذوف\n أي: وليوفيهم أعمالهم\n ولا يظلمهم حقوقهم\n فعل ما فعل من ترتيب الدرجات أو الدركات\n الإشارة: عقوق الأساتيذ أقبح من عقوق الوالدين\n كما أن برهما أوكد لأن الشيخ أخرجك من ظلمة الجهل إلى نور المعرفة بالله\n والوالدان أخرجاك إلى دار التعب\n مُعرض لأمرين\n إما السلامة أو العطب\n والمراد بالشيخ هنا شيخ التربية\n لا شيخ التعليم\n فلا يقدّم حقه على حق الوالدين\n هذا ومَن يَسّر اللّهُ عليه الجمع بين بِر الوالدين والشيخ فهو كمال الكمال\n وبالله التوفيق\n ثم ذكر جزاء العاق المنكر للبعث\n فقال: { وَيَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:163",
      "similarity": 0.7448973959373678
    },
    {
      "verse": "4:96",
      "similarity": 0.7361041330325696
    },
    {
      "verse": "6:132",
      "similarity": 0.6867895397251729
    },
    {
      "verse": "20:75",
      "similarity": 0.6775051806875152
    },
    {
      "verse": "8:4",
      "similarity": 0.5723912134845216
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/46:19.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/46:19.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/46:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}