{
  "chapter": "الأحقاف",
  "text": "ووصينا الانسن بولديه احسنا حملته امه كرها ووضعته كرها وحمله وفصله ثلثون شهرا حتى اذا بلغ اشده وبلغ اربعين سنة قال رب اوزعنى ان اشكر نعمتك التى انعمت على وعلى ولدى وان اعمل صلحا ترضىه واصلح لى فى ذريتى انى تبت اليك وانى من المسلمين",
  "translations": [
    {
      "translation": "We have instructed man to be good to his parents. His mother bore him with difficulty and with difficulty gave birth to him; and his bearing and weaning take thirty months. Then when he achieves his full strength and reaches forty, he says, 'My Lord, keep me thankful for the blessing You bestowed on me and on my parents, and keep me acting rightly, pleasing You. And make my descendants righteous. I have made tawba to You and I am truly one of the Muslims.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined on man to be good to his parents: His mother carries him in her womb with hardship, and gives birth to him in pain. Thirty months is the period of her carrying and weaning him. When he attains to manhood and the age of forty, he says: \"O Lord, guide me to thank You for the favours You have bestowed on me and my parents, and to do things good as may please You, and give me a righteous off-spring. I turn to You in penitence and submit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined man to be kind to his parents. In pain did his mother bear him and in pain did she give birth to him. The carrying of the child to his weaning is a period of thirty months. And when he is grown to full maturity and reaches the age of forty, he prays: “My Lord, dispose me that I may give thanks for the bounty that You have bestowed upon me and my parents, and dispose me that I may do righteous deeds that would please You, and also make my descendants righteous. I repent to You, and I am one of those who surrender themselves to You.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have advised the human being to be kind to his parents; his mother bore him with hardship and delivered him while suffering a great deal of pain. The period in which his mother bore and weaned him lasted for thirty months. When he grew-up to manhood and became forty years old, he then said, \"Lord, inspire me to give You thanks for the bounties you have granted to me and my parents, and to act righteously to please You. Lord, make my offspring virtuous. Lord I turn to you in repentance; I am a Muslim\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have commanded man to be good towards parents; his mother bore him with hardship, and delivered him with hardship; and carrying him and weaning him is for thirty months; until when he* reached maturity and became forty years of age, he said, “My Lord! Inspire me to be thankful for the favours you bestowed upon me and my parents, and that I may perform the deeds pleasing to You, and keep merit among my offspring; I have inclined towards you and I am a Muslim.” (* This verse was revealed concerning S. Abu Bakr – the first caliph, R. A. A)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship. And she delivers him with hardship. And (the period of) his gestation and the weaning of him is thirty months, till when he attains full strength and reaches forty years, he says: \"My Lord! Grant me the power and ability that I may be grateful for Your favor which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my offspring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man doing of good to his parents; with trouble did his mother bear him and with trouble did she bring him forth; and the bearing of him and the weaning of him was thirty months; until when he attains his maturity and reaches forty years, he says: My Lord! grant me that I may give thanks for Thy favor which Thou hast bestowed on me and on my parents, and that I may do good which pleases Thee and do good to me in respect of my offspring; surely I turn to Thee, and surely I am of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have charged man, that he be kind to his parents; his mother bore him painfully, and painfully she gave birth to him; his bearing and his weaning are thirty months. Until, when he is fully grown, and reaches forty years, he says, 'O my Lord, dispose me that I may be thankful for Thy blessing wherewith Thou hast blessed me and my father and mother, and that I may do righteousness well-pleasing to Thee; and make me righteous also in my seed. Behold, I repent to Thee, and am among those that surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have commended unto man kindness toward parents. His mother beareth him with reluctance, and bringeth him forth with reluctance, and the bearing of him and the weaning of him is thirty months, till, when he attaineth full strength and reacheth forty years, he saith: My Lord! Arouse me that I may give thanks for the favour wherewith Thou hast favoured me and my parents, and that I may do right acceptable unto Thee. And be gracious unto me in the matter of my seed. Lo! I have turned unto Thee repentant, and lo! I am of those who surrender (unto Thee).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined on man kindness to his parents: his mother bore him, in pain and in pain she gave birth to him, and his bearing and weaning takes thirty months. At length, when he reaches the age of full maturity and attains forty years, he says, \"O my Lord! Help me to be grateful for Your favours which You have bestowed upon me, and upon both my parents, and to do good deeds that will please You. Grant me righteousness in my offspring. Truly, I have turned to You and, truly, I submit to You.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man kindness Unto the parents: with hardship his mother beareth him and with hardship she bringeth him forth, and the bearing of him and the weaning of him is thirty months, until, when he attaineth his full strength and attaineth the age of forty years, he saith: my Lord! grant me that may give thanks for the favour wherewith. Thou hast favoured me and my parents and that may work righteously such as Thou mayest approve; and be Thou good Unto me in my progeny, verily have turned Unto Thee repentant, and verily I am of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined man to be kind to his parents. His mother has carried him in travail, and bore him in travail, and his gestation and weaning take thirty months. When he comes of age and reaches forty years, he says, ‘My Lord! Inspire me to give thanks for Your blessing with which You have blessed me and my parents, and that I may do righteous deeds which please You, and invest my descendants with righteousness. Indeed I have turned to you in penitence, and I am one of the Muslims.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined on man kindness to his parents: In pain did his mother bear him, and in pain did she give him birth. The carrying of the (child) to his weaning is (a period of) thirty months. At length, when he reaches the age of full strength and attains forty years, he says, \"O my Lord! Grant me that I may be grateful for Thy favour which Thou has bestowed upon me, and upon both my parents, and that I may work righteousness such as Thou mayest approve; and be gracious to me in my issue. Truly have I turned to Thee and truly do I bow (to Thee) in Islam.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship and she brings him forth with hardship, and the bearing of him, and the weaning of him is thirty (30) months, till when he attains full strength and reaches forty years, he says: \"My Lord! Grant me the power and ability that I may be grateful for Your Favour which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my off-spring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims (submitting to Your Will).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have charged the human to be kind to his parents. With much pain his mother bore him, and with much pain she gave birth to him; his bearing andweaning are thirty months. When he grows to manhood and attains his fortieth year, he says: 'Make me so disposed My Lord, so that I give thanks for the favorswith which You have blessed me, my father and mother, and that I will do good deeds that will please You. And, make me righteous and also my descendants. To You I repent, and I am among those who surrender'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have enjoined upon man kindness to his parents. His mother carried him with difficulty, and delivered him with difficulty. His bearing and weaning takes thirty months. Until, when he has attained his maturity, and has reached forty years, he says, “Lord, enable me to appreciate the blessings You have bestowed upon me and upon my parents, and to act with righteousness, pleasing You. And improve my children for me. I have sincerely repented to You, and I am of those who have surrendered.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:15] And We have enjoined man to be kind (husnan: a variant reading has ihsānan), that is to say, We have commanded him to act kindly towards both of them (thus ihsānan is in the accusative as a verbal noun, because of the implied verbal action; the same applies to husnan) to his parents. His mother carries him in travail, and gives birth to him in travail, that is to say, with suffering; and his gestation and his weaning, from suckling, take thirty months, six months being the minimum period for gestation, the remainder being the maximum period of suckling; it is also said that, regardless of whether she bore him for six or nine months, she should suckle him for the remainder. So that (hattā is a [particle of] purpose for an implied sentence, that is to say, wa-‘āsha hattā, ‘and he lived on so that …’) when he is mature, namely, at his prime in terms of his strength, intellect and reasoning, the minimum [age] for which is thirty or thirty three years, and reaches forty years, that is, exactly [forty years], which is the maximum for [attaining] maturity, he says, ‘My Lord!, [this] to the end [of this verse] was revealed regarding Abū Bakr al-Siddīq, when he had reached forty years of age, two years after the [beginning of the] Prophet’s Mission (s). He [Abū Bakr] believed in him, whereafter his parents believed [in the Prophet], followed by his son ‘Abd al-Rahmān, then ‘Abd al-Rahmān’s son Abū ‘Atīq [Muhammad b. ‘Abd al-Rahmān]. Inspire me to give thanks for Your favour with which You have favoured me and my parents, namely, [the grace of] affirming [God’s] Oneness, and that I may act righteously in a way that will please You, thus he [Abū Bakr] emancipated nine believers who had been enduring torture [at the hands of the idolaters] for [their belief in] God, and invest my seed with   righteousness, all of them were believers. Indeed I repent to You and I am truly of those who submit [to You]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have commended unto man) We have commanded 'Abd al-Rahman Ibn Abi Bakr in the Qur'an (kindness towards parents) Abu Bakr Ibn Abi Quhafah and his wife. (His mother beareth him) in her womb (with reluctance) with hardship, (and bringeth him forth with reluctance) and delivers him in hardship, (and the bearing of him) in the womb of his mother (and the weaning of him is thirty months, till, when he attaineth full strength) between the age of 18 to the age of 30 (and reacheth forty years, he saith) Abu Bakr says: (My Lord! Arouse me) inspire in me (that I may give thanks for the favour) of believing in Your divine Oneness (wherewith Thou hast favoured me and my parents) who by then had both accepted Islam, (and that I may do right) sincere righteous works which are (acceptable unto Thee. And be gracious unto me in the matter of my seed) and honour my offspring with repentance and Islam, for 'Abd al-Rahman was not a Muslim by then; he became Muslim later. (Lo! I have turned unto Thee repentant, and lo! I am of those who surrender (unto Thee)) following their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَحَمْلُهُ وَفِصَٰلُهُ ثَلٰثُونَ شَهْراً } قال الإِمام زيد بن علي عليهما السّلامُ: فالحَملُ: ستةُ أَشهرٍ وهو أَقلُهُ\n والفِصالُ والفِطامُ في الحَولين\n وأكثرُ الحَملِ سَنتان\n\n\n\n\nوقوله تعالى: { حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ } معناه ثلاثةٌ وثَلاثون سنةً\n واستوى: أي بَلغَ أَربعين سنةً\n وللإِمام زيد بن علي عليه السّلامُ قَولٌ ثانٍ إن يَبلغَ الحِلمُ إذا كَتَب على الإِنسانِ الحَسنات والسيئات\n\n\n\n\nوقوله تعالى: { أَوْزِعْنِيۤ } معناه أَلهِمني\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of the Most High: {And His gestation and His weaning are thirty months} Imam Zayd ibn Ali (peace be upon him) said: The gestation is six months and it is the least of it.\n\n\nAnd the {fisāl} and the {fitām} are in the two {hawlīn}.\n\n\nAnd most of the load is two years.\n\n\nAnd His saying, {Until he reaches his full strength} means thirty-three years.\n\n\nHe attained the age of forty.\n\n\nAnd for Zaid ibn Ali, peace be upon him, a second saying: \"If wisdom reaches the point that it can write down a person's good and bad deeds...\"\n\n\nAnd His saying - {Awzi'ni} - its meaning is: \"Inspire me.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفطلب محافظة نعمة الهداية والكمال عليه بإيقافه على الطاعات التي هي شكر نعمته التي أنعم بها عليه وعلى والديه اللذين هما السبب القريب لوجوده إذ لو لم يكن فيهما خير وخلق حسن وسرّ صالح لم يظهر عليه ذلك الكمال لأنه سرّهما ولهذا وجب الإحسان والدعاء بالوالدين ولهما { وأن أعْمَل صالحاً } بتكميل المستعدّين فإن الواجب على الكامل أولاً محافظة كماله ثم تكميل المستكملين\n إذ العمل إنما هو من الأمور النسبية فربما كان صالحاً بالنسبة إلى أحد سيئاً بالنسبة إلى غيره\n كما قال:\n \" حسنات الأبرار سيئات المقرّبين \" \nولهذا قال: { وأصلح لي في ذريتي } أي: أولادي الحقيقية سواء كانوا صلبية أو لا لأن علمه الصالح الذي هو التكميل وتربية المريدين لا ينجع إلا بعد تهيىء استعدادهم والصلاح في أعمالهم وأحوالهم وذلك من فيضه الأقدس\n ولو لم يكن هذا الصلاح والقبول التام الذي لا يكون إلا من عند الله لما كان للإصلاح والتكميل والإرشاد أثر كما قال:\n[القصص\n الآية:56] وهما\n أي: محافظة الكمال بالشكر بالقيام بحق الملهم بالطاعات والتكميل بالإرشاد ملاك العمل في الاستقامة ووظيفة المتحقق بالوجود الحقاني في مقام البقاء { إني تبت إليك } من ذنب رؤية الفناء وهذه التوبة هي التي تاب بها موسى عليه السلام عند الإفاقة كما قال تعالى:\n[الأعراف\n الآية:143] { وإنِّي من المُسْلمين } المنقادين المستسلمين في سلك العباد لمكان الاستقامة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَوَصَّيْنَا ٱلإِنسَانَ } أي: ومن جملة ما ألزمنا على الإنسان الاتصاف به والمحافظة عليه حتماً إكرامه { بِوَٰلِدَيْهِ إِحْسَاناً } لهما وحسن الأدب معهما\n أداءً لحقوق تربيتهما وحضانتهما له\n وكيف لا يحسن إليهما\n إذ { حَمَلَتْهُ أُمُّهُ } لأجله حين حبلت به { كُرْهاً } مشقة عظيمة\n وألماً شديداً\n وحملاً ثقيلاً { وَ } حين { وَضَعَتْهُ } أيضاً { كُرْهاً } أشد من شمقة الحمل\n وأكثر ألماً منها { وَ } ليست مشقتها ومقاساتها زماناً قليلاً\n بل { حَمْلُهُ } أي: من حمل أمة إياه في بطنها { وَفِصَٰلُهُ } أي: مدة فطامه عن لبنها كلاهما { ثَلٰثُونَ شَهْراً } وهي مدة طويلة\n ثم بعد فطامه أيضاً تلازم حفظه وحضانته { حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ } وكمل عقله ورشده { وَبَلَغَ أَرْبَعِينَ سَنَةً } إذ القوة العاقلة إنما تكاملت دونها\n لهذا قيل: لم يبعث نبي إلا بعد الأربعين إلا نادراً؟\n\n{ قَالَ } بعدما تذكر نعم الحق الفائضة عليه من بدء فطرته إلى أوان رشده وكماله مناجياً مع ربه مستمداً منه: { رَبِّ أَوْزِعْنِيۤ } أي: أولعني وحرصني بتوفيقك إياي { أَنْ أَشكُرَ نِعْمَتَكَ ٱلَّتِيۤ أَنْعَمْتَ عَلَيَّ } طل دهري وأواظب على أداء حقوقها حسب طاقتي وقدر قوتي { وَ } كذا أشكر نعمتك التي أنعمت { عَلَىٰ وَالِدَيَّ } إذ أداء حقوقهما\n وما لزم عليهما من حقوق نعمك عليك واجبة عليَّ { وَ } كذا حرصني بمقتضى كرمك وجودك { أَنْ أَعْمَلَ صَٰلِحاً } مطلقاً على الوجه الذي { تَرْضَٰهُ } عني { وَ } بالجملة: { أَصْلِحْ لِي } بمقتضى كرامتك عليَّ عملي\n واجعل بفضلك صلاحي سارياً { فِي ذُرِّيَّتِيۤ } ليكونوا صلحاء مثلي\n وارثين مستحقين لكرامتك وعنايتك بهدايتهم وصلاحهم { إِنِّي تُبْتُ } ورجعت { إِلَيْكَ } عن جميع ما لا يرضيك من عملي\n إذ أنت أعلم مني بحالي { مِنَ ٱلْمُسْلِمِينَ } إليك يا رب { وَإِنِّي } [الأحقاف: 15] المنقادين لك\n المطيعين لحكمك\n المفوضين أمورهم كلها إليك\n إذ لا مقصد لنا غيرك ولا مرجع سواك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ووصينا الإِنسانَ } بأن يُحسن { بوالديه حُسناً } وقرأ أهل الكوفة { إحساناً } وهما مصدران\n وقرئ: \" حَسَناً \" بفتح الحاء والسين\n أي: يفعل بهما فعلاً حَسَناً\n أو: وصينا إيصاءً حَسَاناً\n { حملته أُمه كُرْهاً ووضعته كُرهاً } أي: حملته بكُرْهٍ ومشقة\n ووضعته كذلك\n وذكره للحث على الإحسان والبرور بها\n فإن الإحسان إليها أوجب\n وأحق من الأب\n ونصبهما على الحال\n أي: حملته كارهة\n أو: ذات كُره\n وفيه لغتان الفتح والضم\n وقيل: بالفتح مصدر\n وبالضم اسمه\n { وحَمْلُه وفِصَالُه } أي: ومدةُ حمله وفصاله\n وهو الفطام\n وقرأ يعقوبُ: \" وفصله \" وهما لغتان كالفَطْم والفطام\n { ثلاثون شهراً } لأن في هذه المدة عُظَّم مشقة التربية\n وفيه دليل على أن أقل مدة ستةُ أشهر لأنه إذ حُط منه لفطام حولان\n لقوله تعالى:\n[البقرة: 233] يبقى للحمل ستة\n قيل: ولعل تعيين أقل مدة الحمل\n وأكثر مدة الرضاع لانضباطهما\n وارتباطِ النسب والرضاع بهما\n { حتى إِذا بلغ أشُدَّه } أي: اكتهل\n واستحكم عقله وقوته\n وانتهت قامته وشبابه\n وهي ما بين ثماني عشرة سنة إلى أربعين\n وقال زيد بن أسلم: الحلم\n وقال قتادة: ستة وثلاثون سنة\n وهو الراجح\n وقال الحسن: قيام الحجة عليه\n { وبلغ أربعين سنة } وهو نهاية الأشدّ\n وتمام العقل\n وكمال الاستواء\n قيل: لم يُبعث نبيّ إلا بعد الأربعين\n قال ابن عطية: وإنما ذكر تعالى الأربعين\n لأنها حدّ الإنسان في فلاحه ونجاته\n وفي الحديث\n \" إن الشيطان يمدّ يده على وجه مَن زاد على الأربعين ولم يتب\n فيقول: بأبي وَجْهٌ لايُفلح \" \nهـ\n ومن حديث أنس قال صلى الله عليه وسلم:\n \" مَن بلغ أربعين سنة أمّنه الله من البلايا لثالث: الجنون والجذام والبرص\n فإذا بلغ الخمسين خفّف الله عنه الحساب\n فإذا بلغ ستين سنة رزقه الله الإنابة كما يُحب\n فإذا بلغ سبعين سنة غفر الله ما تقدّم من ذنبه وما تأخر\n وشفع في أهل بيته\n وناداه منادٍ من السماء: هذا أسير الله في أرضه \" \nوهذا في العبد المقبل على الله\n والله تعالى أعلم\n وقُرئ: \" حتى إذا استوى وبلغ أشُدَّه \"\n { قال ربِّ أوزعني } أي: ألهمني { أن أشكر نعمتك التي أنعمتَ عليَّ } من الهداية والتوحيد\n والاستقامة على الدين\n { وعلى والديَّ } كذلك\n وجمع بين شكر النعمة عليه وعلى والديه لأن النعمة عليهما نعمةٌ عليه\n { وأنْ أعمل صالحاً ترضاه } التنكير للتفخيم والتكثير\n قيل: هو الصلوات الخمس\n والعموم أحسن\n { وأَصْلِحْ لي في ذُريتي } أي: واجعل الصلاة سارياً في ذريتي راسخاً فيهم\n أو: اجعل ذريتي مَوقعاً للصلاح دائماً فيهم\n { إِني تُبتُ إِليك } من كل ذنب\n { وإِني من المسلمين } الذين أخلصوا لك أنفسهم\n وانقادوا إليك بكليتهم\n\nقال عليّ رضي الله عنه: نزلت في أبي بكر رضي الله عنه\n ولم تجتمع لأحد من أصحاب النبي صلى الله عليه وسلم من المهاجرين مَن أسلم أبواه غيره\n وأوصاه الله بهما\n هـ\n فاجتمع لأبي بكر إسلام أبي قحافة وأمه \" أم الخير \" وأولاده: عبد الرحمن\n وابنه عتيق\n فاستجاب الله دعاءه في نفسه وفي ذريته\n فإنه آمن بالنبي صلى الله عليه وسلم وهو ابن ثمان وثلاثين سنة\n ودعا لهم وهو ابن أربعين سنة\n قال ابن عباس: أعتق أبو بكر تسعةً من المؤمنين\n منهم: بلال\n وعامر بن فهيرة\n ولم يُرد شيئاً من الخير إلا أعانه الله عليه\n هـ\n قال ابن عطية: معنى الآية: هكذا ينبغي للإنسان أن يكون\n فهي وصية الله تعالى للإنسان في كل الشرائع\n وقول مَن قال: إنها في أبي بكر وأبويه ضعيف\n لأن هذه نزلت في مكة بلا خلاف\n وأبو قُحافة أسلم يوم الفتح\n هـ\n قلت: كثيراً ما يقع في التنزيل تنزيل المستقبل منزلة الماضي\n فيُخبر عنه كأنه واقع\n ومنه:\n[الأحقاف: 10] و\n[فصلت:6\n 7] وهذه الآية في إسلام إبي قحافة\n والله تعالى أعلم\n { أولئك الذين يتقبل عنهم أحسن ما عملوا } من الطاعات\n فإن المباح لا يُثاب عليه إلا بنية صالحة\n فإن يَنقلِب حينئذ طاعة\n وضمّن \" يتقبل \" معنى يتجاوز\n فعدّاه بعَن إذ لا عمَلَ يستوجبُ القبول\n لولا عفوُ الله وتجاوزه عن عامله\n إذ لا يخلو عمل من خلل أو نقص\n فإذا تجاوز الحق عن عبده قَبِلَه منه على نقصه\n فلولا حلمه تعالى ورأفته ما كان عملٌ أهلاً للقبول\n { ويتجاوز عن سيائتهم } فيغفر لهم\n { في } جملة { أصحاب الجنة } كقولك: أكرمني الأمير في نار من أصحابه\n أي: أكرمني في جملة مَن أكرمهم\n ونظمني في سِلكِهمْ ومحله: نصب على الحال\n أي: كائنين في أصحاب الجنة\n ومعدودين فيهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:19",
      "similarity": 0.416835868091223
    },
    {
      "verse": "27:17",
      "similarity": 0.37210717833283113
    },
    {
      "verse": "27:83",
      "similarity": 0.359983676801519
    },
    {
      "verse": "27:19",
      "similarity": 0.25263881075716965
    },
    {
      "verse": "31:14",
      "similarity": 0.2347908477731671
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}