{
  "chapter": "الأحقاف",
  "text": "قل ارءيتم ان كان من عند الله وكفرتم به وشهد شاهد منۢ بنى اسرءيل على مثله فـامن واستكبرتم ان الله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "Say: 'What do you think? If it is from Allah and you reject it, when a witness from the tribe of Israel testifies to its similarity and has iman while you are arrogant . . . ! Allah certainly does not guide wrongdoing people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Think (of the consequence) if this is from God and you deny it when a witness from the people of Israel had testified to the like of it and come to believe, while you spurn it?\" Assuredly God does not guide a wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “Did you consider (what would be your end) if this Qur'an were indeed from Allah and yet you rejected it? And this even though a witness from the Children of Israel has testified to the like of it. But he believed, while you waxed arrogant. Verily Allah does not guide such wrong-doers to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"What do you think will happen if this Quran is from God and you have rejected it? Besides, a witness from among the Israelites has testified to the divinity of a Book like it and believed in it (Quran) while you have arrogantly denied it. God does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if the Qur’an is from Allah and you have rejected faith in it, and a witness among the Descendants of Israel has already testified upon this and accepted faith, while you became arrogant? Indeed Allah does not guide the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me! If it was from Allah and you disbelieved it, (at the same time), a witness from among the Children of Israel has testified to something similar and believed while you rejected (the truth)!\" Verily, Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have you considered if it is from Allah, and you disbelieve in it, and a witness from among the children of Israel has borne witness of one like it, so he believed, while you are big with pride; surely Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you considered? If it be from God, and you disbelieve in it, and a witness from among the Children of Israel hears witness to its like, and believes, and you wax proud, God guides not the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink you: If it is from Allah and ye disbelieve therein, and a witness of the Children of Israel hath already testified to the like thereof and hath believed, and ye are too proud (what plight is yours)? Lo! Allah guideth not wrong-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you thought: what if this Quran really is from God and you reject it? What if one of the Children of Israel testifies to its similarity to earlier scripture and believes in it, and yet you are too arrogant to do the same? God certainly does not guide evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye: if it is from Allah while ye disbelieve therein and a witness from the Children of Isra'il beareth witness to the like thereof and believeth, while ye are still stiff necked, then who is further astray than you? Verily Allah guideth not a wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, if it is from Allah and you disbelieve in it, and a witness from the Children of Israel has testified to its like and believed [in it], while you are disdainful [of it]?’ Indeed Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"See ye? If (this teaching) be from Allah, and ye reject it, and a witness from among the Children of Israel testifies to its similarity (with earlier scripture), and has believed while ye are arrogant, (how unjust ye are!) truly, Allah guides not a people unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me! If this (Quran) is from Allah, and you deny it, and a witness from among the Children of Israel ('Abdullah bin Salam) testifies that this Quran is from Allah [like the Taurat (Torah)], so he believed (embraced Islam) while you are too proud (to believe).\" Verily! Allah guides not the people who are Zalimun (polytheists, disbelievers and wrong-doing).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Consider, if this (Koran) is from Allah and you disbelieve in it, and a witness from the Children of Israel testifies to its like and believes, while you areproud! Indeed, Allah does not guide the harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? What if it is from God and you disbelieve in it? A witness from the Children of Israel testified to its like, and has believed, while you turned arrogant. God does not guide the unjust people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if the Qur'an was from Allah, and you disbelieved in it while a witness from the Children of Israel has testified to something similar and believed while you were arrogant...?\" Indeed, Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:10] Say: ‘Have you considered?, [say:] inform me, what will be your predicament, if it, the Qur’ān, is from God and you disbelieve in it (wa-kafartum bihi, the sentence is a circumstantial qualifier), and a witness from the Children of Israel has [already] testified, this was ‘Abd Allāh b. Salām, to the like of it, that is to say, to it [the Qur’ān], that it is from God, and he, the witness, has believed [in it], while you act with arrogance …’, you are disdainful of faith (the response to the conditional [‘if …’] is given [by implication] in what has been supplemented to it, in other words: ‘Would you not then be [considered] wrongdoers?’; this [understanding of the response] is indicated by [what follows]). Truly God does not guide wrongdoing folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Say, Muhammad, to the Jews: (Bethink you) Jews: (If it is from Allah) if this Qur'an is from Allah (and ye disbelieve therein) and you disbelieve in the Qur'an, (and a witness of the Children of Israel) Benjamin (hath already testified to the like thereof) to the same testimony of 'Abdullah Ibn Salam and his followers regarding Muhammad (pbuh) and the Qur'an (and hath believed) 'Abdullah Ibn Salam and his followers believed in Muhammad (pbuh) and the Qur'an, (and ye) group of Jews (are too proud) to believe in Muhammad (pbuh) and the Qur'an ((what plight is yours)? Lo! Allah, guides not) to his religion (wrong- doing folk) a folk that does not deserve it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل بعدما أقر رأيهم على أن القرآن مختلق من عندك\n افتريته على الله\n أو سحر نسبته إلى مالله تغريراً وترويجاً: { أَرَأَيْتُمْ } أخبروني أن { كَانَ } القرآن { مِنْ عِندِ ٱللَّهِ } العليم العلام { وَكَفَرْتُمْ بِهِ } بلا مستند لكم في تكذيبه وإنكاره { وَ } الحال أنه قد { شَهِدَ شَاهِدٌ } حبر ماهر { مِّن بَنِيۤ إِسْرَائِيلَ } عالم بالتوراة { عَلَىٰ مِثْلِهِ } أي: على مثل ما في القرآن\n يعني: أقر واعترف عبد الله بن سلام أنه قرأ في التوراة أحكاماً وأوامر مثل في القرآن\n ووجد فيها من أوصاف القرآن ما يلجئه إلى الإيمان به { فَآمَنَ } به وصدق من أنزل إليه\n وامتثل بما فيه { وَٱسْتَكْبَرْتُمْ } أنتم عن الإيمان والقبول\n بل كذبتم به\n وأنكرتم عليه ألستم قوماً ضالين ظالمين؟! { إِنَّ ٱللَّهَ } المطلع على ما في استعدادات عباده { لاَ يَهْدِي ٱلْقَوْمَ ٱلظَّالِمِينَ } [الأحقاف: 10] الخارجين عن مقتضى حدوده إلى زلال هدايته وتوحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { على مثله } أي: مثل القرآن من المعاني المنطوية في التوراة\n المطابقة لما في القرآن من الوعد والوعيد وغير ذلك\n فإنَّ ما فيه عين ما فيها في الحقيقة\n كما يُعرب عنه قوله تعالى:\n[الشعراء: 196] والمثلية باعتبار كونه من عند الله\n وقيل: المثل: صلة\n { فآمَنَ } ذلك الشاهد لَمّا تحقق برسالته\n رُوي أنه لما قَدِمَ رسولُ الله صلى الله عليه وسلم نظر إلى وجهه\n فعلم أنه ليس بوجه كذاب\n وقال له:إني سائلك عن ثلاث لا يعلمهن إلا نبيّ: ما أول أشراط الساعة؟ وما أول طعام يأكله أهل الجنة؟ وما بالُ الولد ينزع إلى أبيه أو إلى أمة؟ فقال رسول الله صلى الله عليه وسلم:\n \" أما أول أشراط الساعة فنارٌ تحشُرُ الناسَ من المشرق إلى المغرب\n وأول طعام يأكله أهل الجنة فزيادة كبد الحوت\n وأما الولد فإذا سبقَ ماءُ الرجل نزعه\n وإن سبق ماءُ المرأة نزعته \" \nفقال: أشهد أنك رسول الله حقاًُ\n فأسلم\n { واستكبرتم } عن الإيمان به\n وجواب الشرط محذوف\n والمعنى: أخبروني إن كان من عند الله\n وشهد بذلك أعلم بني إسرائيل\n فآمن به من غير تلعثم\n واستكبرتم عن الإيمان به بعد هذه البينة\n فمَن أضل منكم؟ بدليل قوله تعالى:\n[فصلت: 52] الآية أو: إن كان القرآن من عند الله وكفرتم به ألستم ظالمين؟ ويدل عليه قوله: { إِن الله لا يهدي القوم الظالمين } \n والتقديران صحيحان\n لأن عدم الهداية مستلزم الضلال\n ووصفهم بالظلم للإشعار بعلة الحكم\n فإن تركه - تعالى - لهدايتهم إنما هو لظلمهم\n وقال الواحدي: معنى: { إِنّ الله لا يهدي القوم الظالمين }: إن الله جعل جزاء المعاندين للإيمان بعد الوضوح والبيان أن يمدهم في ضلالتهم\n ويحرمهم الهداية\n هـ\n الإشارة: قل ما كنت بِدعاً من الرسل\n وكذلك الوليّ يقول: ما كنت بِدعاً من الأولياء\n مع العصمة والحفظ وصريح الوعد بالنجاة\n لاتساع معرفتهم وعلمهم بالله لأنهم لا يقفون مع عد ولا وعيد لأن غيب المشيئة لا يعلم حقيقته إلا الله\n وقد يكون الوعد معلقاً بشروط أخفاها الله عنهم\n ليتحقق اختصاصه بحقيقة العلم\n وفي الحديث:\n\n \" لا تأمن مكري وإن أَمَّنتك \" \n\n ولذلك كان العارف لا يزول اضطراره\n ولا يكون مع غير الله قراره\n وعلى ذلك الششتري في نونيته\n حيث قال:\nهذا\n وقد قال تعالى في حق رسوله صلى الله عليه وسلم:\n[الضحى: 4\n 5] وقال: { لِّيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ } [الفتح: 2]\n ومع ذلك كله لم يقف مع ظاهر الوعد\n لغيب المشيئة\n فقال في حديث ابن مظعون:\n \" والله لا أدري - وأنا رسول - ما يُفعل بي \" \nوحديث ابن مظعون بالمدينة بعد الهجرة\n فتبيَّن أنَّ الأمن الحقيقي لا يحصل لأحد قبل الختام\n وإن كان الغالب والطرف الراجح أن من وُعد بخيرٍ أو بُشِّر به يُنْجَز له بفضل الله وكرمه\n والكريم إذا وعد لا يُخلف\n لكن المشيئة وقهرية الربوبية لا تزال فوق رأس العبد حتى يلقاه\n والله تعالى أعلم\n قال القشيري: وفي الآية دليل على فساد قول أهل البدع\n حيث لم يُجوزوا إيلام البريء عقلاً لأنه لو لم يَجُزْ ذلك لكان يقول: أعْلَمُ قطعاً أني معصومٌ\n فلا محالةَ يغفر لي\n ولكنه قال هذا ليُعلم أن الأمر أمرُه\n والحكمَ حكمُه\n له أن يفعلَ بعباده ما يريد\n هـ\n وقال الورتجبي: لا أدري أين استغرق في بحار وصال جماله الأبدي\n وهناك لججات تغيب في ذرة منها جميعُ الأرواح العاشقة\n والأسرار الوالهة\n والقلوب الحائرة\n هـ\n والحاصل: أنه لا يدري نهاية مناله من الله\n لنفي الغاية في حقه تعالى والنهاية\n وهو صريح استبعاد الششتري دعوى الوصال\n والله أعلم\n هـ\n من الحاشية\n ثم حكى مقالة أخرى للكفار من مقالاتهم الباطلة\n فقال: { وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ آمَنُواْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:59",
      "similarity": 0.571399433297835
    },
    {
      "verse": "26:197",
      "similarity": 0.5532270947885721
    },
    {
      "verse": "26:17",
      "similarity": 0.5062554932536041
    },
    {
      "verse": "7:105",
      "similarity": 0.4994693624598208
    },
    {
      "verse": "20:47",
      "similarity": 0.4985251887250262
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/46:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/46:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}