{
  "chapter": "الأحقاف",
  "text": "ومن قبله كتب موسى اماما ورحمة وهذا كتب مصدق لسانا عربيا لينذر الذين ظلموا۟ وبشرى للمحسنين",
  "translations": [
    {
      "translation": "But before it there was the Book of Musa as a model and a mercy. And this is a corroborating Book in the Arabic tongue so that you may warn those who do wrong, and as good news for the good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was the Book of Moses before this, a guide and a mercy; and here is this Book confirming it in lucid language, warning those who are wicked, and giving happy tidings to the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet before this the Book was revealed to Moses as a guide and a mercy. This Book, which confirms it, is in the Arabic tongue to warn the wrong-doers and to give good tidings to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this (Quran), the Book of Moses was a guide and a blessing. This Book confirms the Torah. It is in the Arabic language so that it may warn the unjust people, and give glad news to the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whereas before this exists the Book of Moosa, a guide and a mercy; and this is a Book giving testimony, in the Arabic language, to warn the unjust; and to give glad tidings to the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before this was the Scripture of Musa as a guide and a mercy. And this is a Book confirming in the Arabic tongue, to warn those who do wrong, and as glad tidings for the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before it the Book of Musa was a guide and a mercy: and this is a Book verifying (it) in the Arabic language that it may warn those who are unjust and as good news for the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet before it was the Book of Moses for a model and a mercy; and this is a Book confirming, in Arabic tongue, to warn the evildoers, and good tidings to the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When before it there was the Scripture of Moses, an example and a mercy; and this is a confirming Scripture in the Arabic language, that it may warn those who do wrong and bring good tidings for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the scripture of Moses was revealed before it as a guide and a blessing; and this is a Book in the Arabic language, fulfilling [previous prophecies], to forewarn those who do evil and to bring good news to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before it there hath been the Book of Musa, a guide and a mercy. And this a Book confirming it, in Arabic speech, that it may warn those who have done wrong and as glad tidings Unto the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet before it the Book of Moses was a guide and mercy, and this is a Book in the Arabic language, which confirms it, [sent] to warn the wrongdoers, and is a [bearer of] good news for the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before this, was the Book of Moses as a guide and a mercy: And this Book confirms (it) in the Arabic tongue; to admonish the unjust, and as Glad Tidings to those who do right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before this was the Scripture of Musa (Moses) as a guide and a mercy. And this is a confirming Book (the Quran) in the Arabic language, to warn those who do wrong, and as glad tidings to the Muhsinun (good-doers - see V. 2:112).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet before it there was the Book of Moses which was an authority, and a mercy. This (Koran) is the Book confirming it (the other untampered Books) in theArabic tongue, to warn the harmdoers and to give glad tidings to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before it was the Book of Moses, a model and a mercy. And this is a confirming Book, in the Arabic language, to warn those who do wrong—and good news for the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before it was the scripture of Moses to lead and as a mercy. And this is a confirming Book in an Arabic tongue to warn those who have wronged and as good tidings to the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:12] Yet before it, that is, [before] the Qur’ān, [there was] the Book of Moses, that is, the Torah, as a guidepost and a mercy, for those who believed in it (imāman wa-rahmatan are two circumstantial qualifiers) and this, Qur’ān, is a Book that confirms, scriptures before it, in the Arabic tongue (lisānan ‘arabiyyan is a circumstantial qualifier referring to the subject of musaddiqun, ‘that confirms’) to warn those who do wrong, the idolaters of Mecca, and, it is, good tidings for the virtuous, the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When before it) before the Qur'an (there was the Scripture of Moses) the Torah, (an example) to be emulated (and a mercy) shielding from chastisement for those who believe in it. But they did not believe in it nor took it as an example to be emulated; (and this) Qur'an (is a confirming Scripture) it confirms the Torah in the call to belief in Allah's divine Oneness and in the attributes and description of the Prophet Muhammad (pbuh) (in the Arabic language) in the Arabic usage, (that it may warn those who do wrong) the idolaters (and bring good tidings for the righteous) bring the good tidings of Paradise for the believers. 586\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ جاء { مِن قَبْلِهِ } أي: قبل كتابك { كِتَابُ مُوسَىٰ } أي: التوراة حال كونه { إِمَاماً } مقتدى لقاطبة الأنام { وَرَحْمَةً } شاملة فوائدها على كافة الخواص والعوام { وَهَـٰذَا } الكتاب الذي نزل عليك يا أكمل الرسل { كِتَابٌ مُّصَدِّقٌ } لجميع ما مضى من الكتب السالفة { لِّسَاناً عَرَبِيّاً } أسلوباً ونظماً\n إنما جاء كذلك { لِّيُنذِرَ } التفسير هنا على قراءة ابن عامر ونافع وغيرهما بما فيه من الوعيدات الهائلة { ٱلَّذِينَ ظَلَمُواْ } خرجوا عن مقتضى العدالة الإلهية بمتابعة آرائهم الباطلة المنحرفة عن صراط الحق الحقيق بالإطاعة والاتبا { وَ } ليصير { بُشْرَىٰ } بما فيه من أنواع المواعيد الدالة على كرامة الحق وإحسانه { لِلْمُحْسِنِينَ } [الأحقاف: 12] من خلص عباده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومِن قبله } أي: مِن قبل القرآن { كتابُ موسى } أي: التوراة\n فكتاب: مبتدأ\n و \" من قبله \": خبر\n والاستقرار هو العامل في قوله: { إِماماً ورحمةً } على أنهما حالان من الكتاب\n أي: قدوة يُؤْتمُ به في دين الله وشرائعه\n ورحمة من الله تعالى لمَن آمن به\n { وهذا } القرآن\n الذي يقولون في حقه ما يقولون\n هو { كتاب } عظيم الشأن { مُصدِّق } لكتاب موسى\n الذي هو أماماً ورحمة\n أو: لِما بين يديه من جميع الكتب الإلهية\n قال ابن عرفة: وجه مناسبتها لما قبلها: أنه لما تضمن قوله: { فسيقولون هذا إفك قديم } تقبيحهم إياه بأنه إما كذب في نفسه\n أو شبيه بما قبله من الأكاذيب والافتراءات\n عقبه ببيان أنه إما صدق في نفسه\n أو شبيه بما قبله من الكتب الصادقة\n هـ\n حال كون الكتاب { لساناً عربياً ليُنذر الذين ظلموا } متعلق بمُصَدِّق\n أو بأنزل\n محذوفاً\n وفيه ضمير الكتاب\n أو: الله تعالى\n أو: الرسول صلى الله عليه وسلم\n ويؤيده: قراءة الخطاب\n { وبُشرى للمحسنين } في حيز النصب\n عطف على محل \" ليُنذر \" لأنه مفعول له\n أي: للإنذار والبشرى\n أو: وهو بشرى للمحسنين\n للمؤمنين المطيعين\n الإشارة: قال في الحِكَم: \" أصل كل معصية وغفلة وشهوة: الرضا عن النفس\n وأصل كل طاعة ويقظة وعفة: عدم الرضا منك عنها\n ولأن تصحب جاهلاً لا يرضى عن نفسه\n خير من أن تصحب عالماً يرضى عن نفسه\n فأيّ علِم لعالم يرضى عن نفسه؟ وأيّ جهل لجاهل لا يرضى عن نفسه؟ \" \n وعلامة الرضا عن النفس: تغطية مساوئها\n وإظهار محاسنها\n كما قال الشاعر:\n\nوإذا نقصها له أحدٌ انتقم منه وغضب\n وإذا مدحها له فَرِحَ واستبشر\n ويرى أنه أهل لكل خيرٍ\n وأولى من غيره\n فيقول إذا رأى مَن حاز خيراً أو رئاسة\n كما قال الكفار: لو كان خيراً ما سبقونا إليه\n وعلامة عدم الرضا عنها: إظهار مساوئها\n واتهامها في كل حال\n وقال أبو حفص الحداد: مَن لم يتهم نفسه على دوام الأوقات\n ولم يخالفها في جميع الأحوال\n ولم يجرها إلى مكروهها في سائر أيامه\n كان مغروراً\n ومَن نظر إلى نفسه باستحسان شيء منها فقد أهلكها\n وكيف يصح لعاقل الرضا عن نفسه؟! والكريم ابن الكريم ابن الكريم يقول:\n[يوسف: 35] هـ\n فإذا لم يرضَ عن نفسه\n وهذّبها\n استقامت أحواله\n وكان من المحسنين\n الذين قال الله تعالى في شأنهم: { إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَامُواْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:195",
      "similarity": 0.7182916201478018
    },
    {
      "verse": "26:84",
      "similarity": 0.47024893143007956
    },
    {
      "verse": "41:3",
      "similarity": 0.40584027990033916
    },
    {
      "verse": "19:50",
      "similarity": 0.39255119766242663
    },
    {
      "verse": "43:3",
      "similarity": 0.37423916557651316
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/46:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/46:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}