{
  "chapter": "الأحقاف",
  "text": "ان الذين قالوا۟ ربنا الله ثم استقموا۟ فلا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "Those who say, 'Our Lord is Allah,' and then go straight will feel no fear and will know no sorrow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely for those who say, \"God is our Lord,\" and then remain firm, there is no fear or regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who said: “Our Lord is Allah” and then remained steadfast shall have nothing to fear nor to grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have said, \"Our Lord is God,\" and are steadfast in their belief need have no fear or be grieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who said, “Allah is our Lord”, and then remained steadfast – upon them is neither any fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who say: \"Our Lord is (only) Allah,\" and thereafter stand firm, on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who say, Our Lord is Allah, then they continue on the right way, they shall have no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who say, 'Our Lord is God' and then go straight, no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who say: Our Lord is Allah, and thereafter walk aright, there shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who say, \"Our Lord is God,\" and remain firm [on that path] shall feel no fear, nor shall they grieve:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who say: our Lord is Allah, and thereafter stand fast thereto, no fear shall come upon them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, ‘Our Lord is Allah,’ and then remain steadfast, they will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who say, \"Our Lord is Allah,\" and remain firm (on that Path),- on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who say: \"Our Lord is (only) Allah,\" and thereafter Istaqamu (i.e. stood firm and straight on the Islamic Faith of Monotheism by abstaining from all kinds of sins and evil deeds which Allah has forbidden and by performing all kinds of good deeds which He has ordained), on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say: 'Our Lord is Allah' and follow the Straight Path shall have nothing to fear nor shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, “Our Lord is God,” then lead a righteous life—they have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have said, \"Our Lord is Allah,\" and then remained on a right course - there will be no fear concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:13] Assuredly those who say, ‘Our Lord is God’ and then remain upright, in [their adherence to] obedience, no fear will befall them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who say: our Lord is Allah) those who declare Allah's divine Oneness, (and thereafter walk aright) and thereafter hold fast to performing the obligations of Allah and to avoiding transgressing against Him and, further, do not play about in matters of religion, (there shall no fear come upon them) in relation to future torment (neither shall they grieve) for what they have left behind; it is also said that this means: there shall be no fear upon them when the people of the Fire are in fear, and they shall not grieve when others do.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الذين قالوا ربّنا الله } أي: تجرّدوا عن العلائق ورفضوا العوائق وانقطعوا إلى الله عن كل ما سواه ورحموا البصر عن طغواه فصدقاً { قالوا }: ربنا الله\n إذ لو بقيت منهم بقايا ولم يأمنوا التلوينات في عرصة الفناء لم يقولوا صادقين: { ربّنا الله }  { ثمَّ اسْتَقاموا } بالتحقق به في العمل والتحفظ به في مراعاة آداب الحضرة عن الزلل والخطل\n بحيث لم ينبض منهم عرق ولم يتحرك منهم شعرة إلا بالله ولله { فلا خَوْف عليهم } إذ لا حجاب ولا عقاب { ولا هم يَحْزنون } إذ لا مرغوب إلا وهو حاصل لهم فلم يفت منهم شيء ولا يفوت كما قيل: إنّ في الله عزاء لكل مصيبة ودركاً عن كل ما فات\n { أولئك أصحاب الجنة } المطلقة الشاملة للجنان كلها { خالدين فيها جَزَاءَ بما كانوا يَعْمَلون } في حال السلوك حتى الوصول { حتى إذا بَلَغ أشُدّه وبَلَغ أربعين سنة } لما كانت النفس ممنوّة بتدبير البدن لتوقف استكمالها عليه مشغولة عن كمالها به في أول النشأة لم تنفتح بصيرتها ولم يصف إدراكها ولم يتبين رشدها إلا وقت بلوغ النكاح كما قال في اليتامى:\n[النساء\n الآية:6] وذلك هو الأشد الصوري\n ألا ترى أن الطبيعة من وقت الطفولة إلى هذا الحد لا تتفرغ إلى تحصيل مادة النوع عن إيرادها ما يزيد في الأقطار من الغذاء زائداً على بدل المتحلل من البدن لضعف الأعضاء وشدةّ الاحتياج إلى النمو والتصلب\n فالنفس حينئذ منغمسة في البدن\n مستعملة للطبيعة في ذلك العمل\n ذاهلة عن كمالها إلى هذا الأجل\n فلما قربت الآلات من حدّ كمالها ووصلت إلى ما يصلح لاستعمالها في تصرفاتها وانتقص الاحتياج إلى ما يزيد في أقطارها تفرّغت الطبيعة إلى ذخيرة مادة النوع من الشخص لاستغنائها بكمال الشخص عن مادته فتفرّغت النفس إلى تحصيل كمالها\n فانفتحت بصيرة عقلها وظهرت أنوار فطرتها واستعدادها وتنبّهت عن نومها في مهدها\n وتيقظت عن سنة غفلتها وتفطّنت لقدس جوهرها وطلبت مركزها وغايتها لأمرين: صلاحية الآلات للاستعمال في الاستكمال وفراغها عن تخصيص البدن بالإقبال لقلة الإشغال\n لكنها ما دامت سنّ النموّ باقية وزيادة الآلاف في القوة والشدة ممكنة ما توجهت بالكلية إلى الجهة العلوية وما تجرّدت لتحصيل الكمالات العقلية والمطالب القدسية للاشتغال المذكور وإن قلّ وذلك إلى منتهى الثلثين من السن كما تبين في علم الطب\n فلما جاوزتها وأخذت في سنّ الوقوف أقبلت إلى عالمها وأشرقت أنوار فطرتها فاشتدّت في طلب كمالها لوقوع الفراغ لها إليها\n فأخذ كافل الأيتام الحقيقية الذي هو روح القدس أن آنس رشدها في دفع أموالها التي هي الحقائق والمعارف والعلوم والحكم إليها\n لبلوغها نكاح الغواني من المفارقات القدسية والنورانيات الجبروتية وذلك وقت سيرها في صفات الله إلى ذات الله حتى الفناء التام بالاستغراق في عين الجمع لإمكان السير في أفعاله من وقت الأشدّ الصوري إلى أشدّ هذا الأشدّ المعنوي الذي نهايته الأربعون تقريباً\n\nولهذا قيل: الصوفيّ بعد الأربعين أبذّ\n إذ لم يستعدّ بالتوجه والطلب والسير في الأفعال بالتزكية لقبول تلك الأموال والتصرف فيها فلم يأنس روح القدس منه الرشد فلم يدفع إليه\n وإذا تم سيره في الله عند ذلك الأشدّ بالفناء فيه كان وقت البقاء بعد الفناء وأوان الاستقامة في العمل\n وأشار إليها بقوله: { ربّ أوْزعني } ولهذا لم يبعث نبي قط إلا بعد الأربعين سوى عيسى ويحيى ومع ذلك وقفا في بعض السموات\n ولما كانت النعم أوابد يجب تقييدها بالشكر استوزع الشكر على نعمة الكمال الحاصل المسبوق بالنعم الغير المتناهية لمحافظتها لئلا يحتجب برؤية الفناء فيترك الطاعة تبرّماً لحاله واتكالاً على كماله\n فإن آفة مقام الفناء رؤية الفناء والمبتلى بها يقع في التلوين ويحرم نعمة التمكين\n ولهذا قال عليه السلام:\n \" أفلا أكون عبداً شكوراً \" ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإن المحسنين { إِنَّ ٱلَّذِينَ قَالُواْ } بعدما تحققوا بمقام العبودية { رَبُّنَا ٱللَّهُ } الواحد الأحد الصمد المستقل بالألوهية والربوبية { ثُمَّ } بعدما تمكنوا من مقر التوحيد وتمرنوا عليه { ٱسْتَقَامُواْ } فيه ورسخوا بمحافظة الآداب الشرعية والعقائد الدينية الموضوعة لتأييد أرباب المعرفة\n وتمكينهم على جادة التوحيد\n لئلا يطرأ عليهم التزلزل والانحراف عن صراط الحق وسواء سبيله { فَلاَ خَوْفٌ عَلَيْهِمْ } بعدما وصلوا إلى مقر التمكين { وَلاَ هُمْ يَحْزَنُونَ } [الأحقاف: 13] عن التردد والتلوين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِن الذين قالوا ربُّنا اللّهُ ثم استقاموا } أي: جمعوا بين التوحيد\n الذي هو خاصة العلم\n والاستقامة في الظاهر\n التي هي منتهى العمل\n { فلا خوفٌ عليهم } من لحوق مكروه\n { ولا هم يحزنون } على فوات مرغوب\n و \" ثم \" للدلالة على تراخي رتبة العمل\n وتوقف الاعتداد به على التوحيد\n ودخلت الفاء لتضمن الموصول معنى الشرط\n والتعبير بالمضارع للدلالة على دوام نفي الحزن عنهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:68",
      "similarity": 0.7891473675357729
    },
    {
      "verse": "41:30",
      "similarity": 0.7202629702049776
    },
    {
      "verse": "6:48",
      "similarity": 0.6469972150322529
    },
    {
      "verse": "10:62",
      "similarity": 0.6265151679571791
    },
    {
      "verse": "10:65",
      "similarity": 0.5588418907025484
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/46:13.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/46:13.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}