{
  "chapter": "الأحقاف",
  "text": "فلولا نصرهم الذين اتخذوا۟ من دون الله قربانا ءالهةۢ بل ضلوا۟ عنهم وذلك افكهم وما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "Why have those they took as gods besides Allah, to bring them near to Him, not come to their aid? No, in fact they have forsaken them! That was a fiction, something they invented.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then did the gods they had taken apart from God as propitiators, not come to their aid? In fact they strayed away from them. It was all a lie what they had contrived!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So why did those whom they had set up as gods apart from Allah, hoping that they would bring them nearer to Him, not come to their aid? Instead, they failed them. This was the end of the lie they had fabricated and the false beliefs they had invented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did the idols, whom they worshipped as a means of pleasing God, not help them? In fact, they proved to be the cause of their going astray and it were lies which they had falsely invented lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So why did they – the ones whom they had chosen as Gods as a means of attaining Allah’s proximity – not help them? In fact the disbelievers lost them; and this is just their slander and fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whom they had taken for gods besides Allah, as the means of approach to Him, why then did they not aid them Nay, but they vanished completely from them. And that was their falsehood, and what they were fabricating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did not then those help them whom they took for gods besides Allah to draw (them) nigh (to Him)? Nay! they were lost to them; and this was their lie and what they forged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why did those not help them that they had taken to themselves as mediators, gods apart from God? Not so; but they went astray from them, and that was their calumny, and what they had been forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why did those whom they had chosen for gods as a way of approach (unto Allah) not help them? Nay, but they did fail them utterly. And (all) that was their lie, and what they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so why did their gods not help them, those they set up as gods besides God to bring them nearer to Him? No indeed! They failed them utterly: it was all a lie, a fabrication of their own making.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then wherefore succoured them not those whom they had taken for gods beside Allah, as a means of approach? Aye! they failed them. And that was their lie, that which they had been fabricating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So why did not those [fake deities] help them whom they had taken as gods besides Allah, as a means of nearness [to Him]? Indeed, they forsook them; that was their lie and what they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then was no help forthcoming to them from those whom they worshipped as gods, besides Allah, as a means of access (to Allah)? Nay, they left them in the lurch: but that was their falsehood and their invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why did those whom they had taken for aliha (gods) besides Allah, as a way of approach (to Allah) not help them? Nay, but they vanished completely from them (when there came the torment). And that was their lie, and their inventions which they had been inventing (before their destruction).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did not those who they took, other than Allah, as mediating gods help them! Indeed, they went astray from them! Such were their lies and what they were forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then did the idols, whom they worshiped as means of nearness to God, not help them? In fact, they abandoned them. It was their lie, a fabrication of their own making.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why did those they took besides Allah as deities by which to approach [Him] not aid them? But they had strayed from them. And that was their falsehood and what they were inventing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:28] So why did they not help them, by averting from them the chastisement, those whom they had chosen besides God, that is to say, other than Him, as [a means of] nearness, through whom they may secure nearness to God, to be gods?, alongside Him, and these are the idols (the first object of ittakhadhū, ‘they had chosen’, is the omitted pronoun referred to by the relative clause [alladhīna, ‘those who …’], and it is hum, ‘they’; qurbānan, ‘nearness’, is the second [object], with ālihatan, ‘gods’, as its substitution). Nay, but they forsook them, when the chastisement came down [on them], and that, that is to say, [that] choosing of theirs of idols as gods as a means of nearness [to God], was their lie and what they used to invent — the lies they used to speak (mā, ‘what’, either relates to the verbal action [‘their lying’], or it indicates a relative clause with the referential pronoun omitted, this being fīhi, ‘about’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then why did those whom they had chosen for) worshipped as (gods as a way of approach (unto Allah)) as a means to bring them closer to Allah (not help them? (Nay, but they did fail them utterly) that which they worshipped is made void. (And (all) that was their lie, and what they used to invent) and what they used to lie about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَوْلاَ نَصَرَهُمُ } أي: هلا نصرهم ومنعهم عن الهلاك والإهلاك شفعاؤهم { ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ } الفرد الصمد، وقربوا لهم { قُرْبَاناً } لأنهم اتخذوهم { آلِهَةَ } شركاء مع الله في الألوهية والربوبية، لذلك تقربوا إليهم، وتوجهوا نحوهم في عموم الملمات، مع أنه ما ينفعهم لدى الحاجة إليهم وإلى تصرفهم { بَلْ ضَلُّواْ } وغلبوا { عَنْهُمْ } فأنى ينصرهم ويدفع عنهم ما يضرهم { وَذَلِكَ } الذي اعتقدوا في شأنهم { إِفْكُهُمْ } أي: صرفهم عن الحق وإعراضهم عنه وميلهم إلى الباطل وإصرارهم فيه { وَمَا كَانُواْ يَفْتَرُونَ } [الأحقاف: 28] أي: افتراؤهم على الله بإثبات الشريك له، والمشاركة معهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فيما } موصولة، أو موصوفة، ومفعول { اتخذوا } الأول: محذوف، و { آلهة } مفعول ثان، أي: اتخذوهم آلهة، و { قرباناً } حال، ولا يصح أن يكون مفعولاً ثايناً لـ \" اتخذوا \" ، و \" آلهة \": بدل، لفساد المعنى، وأجازه ابن عطية، ووجه فساده: أن اتخاذهم آلهة منافٍ لاتخاذهم قرباناً لأن القربان مقصود لغيره، والآلهة مقصود بنفسها، فتأمله، و \" إن \" نافية، والأصل: فيما ما مكنكم فيه، ولمّا كان التكرار مستثقلاً جيء بأن، كما قالوا في مهما، والأصل: مَا مَا، فلبشاعة التكرار قلبوا الألف هاء، وقيل: \" إن \" صلة، أي: في مثل ما مكنكم فيه، والأول أحسن\n يقول الحق جلّ جلاله: { ولقد مكَّنَّاهم } أي: قررنا عاد ومكناهم في التصرُّف { فيما } أي: في الذي، أو في شيء ما { مكناكم } يا معشر قريش { فيه } من السعة والبسطة، وطول الأعمار، وسائر مبادئ التصرفات، فما إغنى عنهم شيء من ذلك، حين نزل بهم الهلاك، وهذا كقوله تعالى:\n\n[الأنعام: 6] أو: ولقد مكنهم في مثل ما مكنكم فيه، فما جرى عليهم يجري عليكم، حيث خالفتم نبيكم، والأول أوفق بقوله:\n\n[غافر: 21] وقوله:\n\n[مريم: 74]\n { وجعلنا لهم سمعاً وأبصاراً وأفئدةً } أي: آلات الإدراك والفهم، ليعرفوا بكل واحدة منها ما خلقتْ له، وما نيطت به معرفته، من فنون النعم، ويستدلوا بها شؤون منعمها، ويداوموا على شكرها، ويوحدوا خالقها،، { فما أغنى عنهم سمعُهم } حيث لم يستعملوه في استماع الوحي ومواعظ الرسل، { ولا أبصارهم } حيث لم يُبصروا ما نصب من الآيات الدالة على وحدانيته تعالى ووجوب وجوده، { ولا أفئدتهم } حيث لم يتفكّروا بها في عظمة الله تعالى وأسباب معرفته، فما أغنت عنهم { من شيء } أي: شيئاً من الإغناء\n و { من } زائدة للتأكيد، وقوله: { إِذ كانوا يجحدون بآيات الله } ظرف لقوله: { فما أغنى } جارٍ مجرى التعليل، لاستواء مؤدّي التعليل والظرف في قولك: ضربته إذ أساء، أو: لإساءته، لأنك إذا ضربته وقت إساءته فإنما ضربته فيه لوجود إساءته فيه، وكذلك الحال في \" حيث \" دون سائر الظروف غالباً، أي: فما أغنت عنهم آلات الإدراك لأجل جحودهم بآيات الله\n { وحاق } أي: نزل { بهم ما كانوا به يستهزؤون } من العذاب الذي كانوا يستعجلونه بطريق الاستهزاء، ويقولون: { فأتنا بما تعدنا إن كنت من الصادقين }\n { ولقد أهلكنا ما حولَكم من القرى } يا أهل مكة، كحِجر ثمود، وقرى لوط، والمراد: أهل القرى، ولذلك قال: { وصرَّفنا الآياتِ } كرّرناه، { ولعلهم يرجعون } أي: كرّرنا عليهم الحجج وأنواع العِبر لعلهم يرجعون من الطغيان إلى الإيمان، فلم يرجعوا فأنزلنا عليه العذاب\n\n\n{ فلولا نَصَرَهم الذين اتخذوا من دون الله قُرباناً آلهةً } أي: فهلاّ منعهم وخلصهم من العذاب الأصنام الذين اتخذوهم آلهة من دون الله، حال كونها متقرباً بها إلى الله، حيث كانوا يقولون:\n\n[الزمر: 3] و\n\n[يونس: 18] { بل ضلوا عنهم } أي: غابوا عن نصرتهم، { وذلك إِفكهم وما كانوا يفترون } الإشارة إلى امتناع نصرة آلهتهم وضلالهم، أي: وذلك أثر إفكهم الذي هو اتخاذها آلهة، وثمرة شركهم، وفترائهم على الله الكذب\n وقرأ ابن عباس وابن الزبير: { أَفَكَهم } أي: صرفهم عن التوحيد\n وقُرئ: بتشديد الفاء، للتكثير\n الإشارة: التمكُّن من كثرة الحس لا يزيد إلا ضعفاً في المعنى، وبُعداً من الحق، ولذلك يقول الصوفية: كل من زاد في الحس نقص في المعنى، وكل ما نقص في الحس زاد في المعنى، والمراد بالمعنى: كشف أسرار الذات وأنوار الصفات، وما مكّن اللّهُ تعالى عبدَه من الحواس الخمس إلا ليستعملها فيما يقربه إليه، ويوصله إلى معرفته، فإذا صرفها في غير ذلك، عُوقب عليها\n وبالله التوفيق\n ثم ذكر حال مَن أغنى عنه سمعه ونَفَعَه، حيث استعمله فيما وصله إلى ربه، فقال: { وَإِذْ صَرَفْنَآ إِلَيْكَ نَفَراً مِّنَ ٱلْجِنِّ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:86",
      "similarity": 0.49437842768378143
    },
    {
      "verse": "51:9",
      "similarity": 0.4808618252133984
    },
    {
      "verse": "24:12",
      "similarity": 0.46766103562456757
    },
    {
      "verse": "18:15",
      "similarity": 0.44325041900256507
    },
    {
      "verse": "46:22",
      "similarity": 0.43880130848706367
    }
  ]
}