{
  "chapter": "الأحقاف",
  "text": "قال انما العلم عند الله وابلغكم ما ارسلت به ولكنى ارىكم قوما تجهلون",
  "translations": [
    {
      "translation": "He said, 'All knowledge is with Allah. I only transmit to you what I have been sent with. But I see that you are a people who are ignorant.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Only God has the knowledge. I only convey to you what I have been sent with. But I see you are a foolish people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: “Allah alone knows about this. I only convey to you the Message that I have been sent with. But I see that you are an ignorant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Only God has the knowledge (of the coming of such torment). I preach to you the message that I have brought, but I can see that you are an ignorant people\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Its knowledge is only with Allah; and I convey to you the messages of my Lord, but I perceive that you are an ignorant nation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"The knowledge (of that) is only with Allah. And I convey to you that wherewith I have been sent, but I see that you are a people given to ignorance!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: The knowledge is only with Allah, and I deliver to you the message with which I am sent, but I see you are a people who are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Knowledge is only with God, and I deliver to you the Message with which I was sent; but I see you are an ignorant people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: The knowledge is with Allah only. I convey unto you that wherewith I have been sent, but I see you are a folk that know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"God alone knows when it will come, and I deliver to you the message with which I am sent, but I see you are a people who are ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: the knowledge is only with Allah, and I preach Unto you that wherewith I have been sent, but I see you are a people given to ignorance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘The knowledge [of when that threat will be carried out] is with Allah alone. I communicate to you what I have been sent with. But I see that you are a senseless lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"The Knowledge (of when it will come) is only with Allah: I proclaim to you the mission on which I have been sent: But I see that ye are a people in ignorance!\"..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"The knowledge (of the time of its coming) is with Allah only, and I convey to you that wherewith I have been sent, but I see that you are a people given to ignorance!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah alone has the knowledge' he said, 'I am sent to deliver to you the Message. But I can see that you are ignorant people'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “The knowledge is only with God, and I inform you of what I was sent with; but I see you are an ignorant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Knowledge [of its time] is only with Allah, and I convey to you that with which I was sent; but I see you [to be] a people behaving ignorantly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:23] He, Hūd, said, ‘The knowledge is with God only, He is the One Who knows when chastisement will befall you, and I am [merely] conveying to you what I have been sent with, to you. But I see that you are an ignorant lot’, given your hastening on of the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Hud said to them: (The knowledge) of when the torment shall come (is with Allah only. I convey unto you that wherewith I have been sent) of the message of Allah's divine Oneness, (but I see you are a folk that know not) Allah's command and His torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ لم يوح إلى وقت إتيانه بل { إِنَّمَا ٱلْعِلْمُ } بوقت نزوله { عِندَ ٱللَّهِ } المطلع على عموم الغيوب { وَ } إنما { أُبَلِّغُكُمْ مَّآ أُرْسِلْتُ بِهِ } وأمرت بتبليغه من عنده\n إذ ما على الرسول إلا البلاغ { وَلَـٰكِنِّيۤ أَرَاكُمْ } بسبب إعراضكم عن الحق وأهله وإصراركم على الشرك الباطل والضلال والزائل { قَوْماً تَجْهَلُونَ } [الأحقاف: 23] عن كمال عظمة الله وعزته\n ومن مقتضيات قوته وقدرته\n\n\nوبالجملة: قال هود عليه السلام ما قال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأُبلغكم ما أُرسلت به } من التخويف والإنذار من غير وقف على تعيين وقت نزول العذاب، { ولكني أراكم قوماً تجهلون } حيث تقترحون عليَّ ما ليس من وظائف الرسل، من الإتيان بالعذاب وتعيين وقته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:64",
      "similarity": 0.5932037908044434
    },
    {
      "verse": "4:17",
      "similarity": 0.5218361032813127
    },
    {
      "verse": "16:119",
      "similarity": 0.497330017770213
    },
    {
      "verse": "6:111",
      "similarity": 0.4796896287414681
    },
    {
      "verse": "5:50",
      "similarity": 0.4767936726873593
    }
  ]
}