{
  "chapter": "الأحقاف",
  "text": "فلما راوه عارضا مستقبل اوديتهم قالوا۟ هذا عارض ممطرنا بل هو ما استعجلتم به ريح فيها عذاب اليم",
  "translations": [
    {
      "translation": "When they saw it as a storm cloud advancing on their valleys they said, 'This is a storm cloud which will give us rain.' No, rather it is what you desired to hasten - a wind containing painful punishment,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they saw it as a cloud advancing towards their valleys, they said: \"This is just a passing cloud that will bring us rain.\" \"No. It is what you were trying to hasten: The wind which carries the grievous punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they saw the scourge advancing towards their valleys, they said: “This is a cloud that will bring much rain to us.” “By no means; it is what you had sought to hasten -- a wind-storm bearing a grievous chastisement\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they saw the torment as a cloud proceeding to their valleys, they said, \"This cloud will bring us rain.\" He said, \"No, it is the torment which you wanted to suffer immediately. It is a wind bearing and painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they saw the punishment coming towards their valleys, spread like a cloud on the horizon, they said, “That is a cloud which will shower rain upon us”; said Hud “In fact this is what you were being impatient for; a windstorm carrying a painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they saw it as a dense cloud approaching their valleys, they said: \"This is a cloud bringing us rain!\" Nay, but it is that which you were asking to be hastened - a wind wherein is a painful torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they saw it as a cloud appearing in the sky advancing towards their valleys, they said: This is a cloud which will give us rain. Nay! it is what you sought to hasten on, a blast of wind in which is a painful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they saw it as a sudden cloud coming towards their valleys, they said, 'This is a cloud, that shall give us rain!' 'Not so; rather it is that you sought to hasten -- a wind, wherein is a painful chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they beheld it as a dense cloud coming toward their valleys, they said: Here is a cloud bringing us rain. Nay, but it is that which ye did seek to hasten, a wind wherein is painful torment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they saw it in the shape of a dense cloud approaching their valleys, they exclaimed, \"This is only a heavy cloud which will bring us [welcome] rain!\" [But Hud said]: \"By no means! It is the very thing which you sought to hasten -- a wind bearing grievous suffering\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they beheld it as an overpeering cloud tending toward their valleys they said: yonder is an overpeering cloud bringing us rain. Nay it is that which ye sought to be hastened: a wind wherein is a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they saw it as a cloud advancing toward their valleys, they said, ‘This cloud brings us rain.’ ‘No, it is what you sought to hasten: a hurricane carrying a painful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they saw the (Penalty in the shape of) a cloud traversing the sky, coming to meet their valleys, they said, \"This cloud will give us rain!\" \"Nay, it is the (Calamity) ye were asking to be hastened!- A wind wherein is a Grievous Penalty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they saw it as a dense cloud coming towards their valleys, they said: \"This is a cloud bringing us rain!\" Nay, but it is that (torment) which you were asking to be hastened! a wind wherein is a painful torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they saw it as a sudden cloud heading for their valley they said: 'This is a cloud that will bring us rain' 'Rather' (he replied): 'it is that which you have sought to hasten, a wind in which there is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they saw a cloud approaching their valley, they said, “This is a cloud that will bring us rain.” “In fact, it is what you were impatient for: a wind in which is grievous suffering.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they saw it as a cloud approaching their valleys, they said, \"This is a cloud bringing us rain!\" Rather, it is that for which you were impatient: a wind, within it a painful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:24] Then, when they saw it, that is, [when they saw] what chastisement [really] was, as a sudden cloud, a cloud that appeared [out of nowhere] on the horizon, heading towards their valleys, they said, ‘This is a cloud that will bring us rain!’. God, exalted be He, says: Nay, but it is what you sought to hasten, of the chastisement — a hurricane (rīhun substitutes for mā, ‘what’) containing a painful chastisement,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then when they beheld it a dense cloud coming towards their valleys, they said; Here is a cloud bringing us rain) bringing rain to our fields. Hud said to them: (Nay, but it is that which ye did seek to hasten) of punishment, (a wind wherein is painful torment,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَـٰذَا عَارِضٌ مُّمْطِرُنَا } قال الإِمامُ زيد بن علي عليهما السّلامُ\n فالعَارضُ: السَّحابُ الذي يُرى في نَاحيةٍ مِنْ نَواحي السّماءِ بالعِشي، ثم يُصبح وقد حَبا حتَّى استوى\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {This is an obstacle to our rain} - Imam Zayd ibn Ali said, peace be upon them both.\n\n\nThe observer: the cloud that is seen in one direction of the sky at sunset, then becomes completely white by morning.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم كانوا على شركهم وإصرارهم كما كانوا { فَلَمَّا رَأَوْهُ } يوماً من الأيام { عَارِضاً } سحاباً ذا عرض على الأفق { مُّسْتَقْبِلَ أَوْدِيَتِهِمْ } أي: متوجهاً لأمكنتهم التي كانوا متوطنين فيها\n وكانوا حينئذ\n قد حبس عليهم القطر\n فلما رأوها حينئذ { قَالُواْ } فرحين مستبشرين: { هَـٰذَا عَارِضٌ } مبارك توجه نحو بلادنا هو { مُّمْطِرُنَا } مطراً عظيماً\n وهم استدلوا بسواده إلى كثرة مائه\n وبعدما استبشروا في ما بينهم\n قال هود: { بَلْ هُوَ مَا ٱسْتَعْجَلْتُم بِهِ } واستبشرتهم باستقباله { رِيحٌ } عاصفة لا راحة فيها بل { فِيهَا عَذَابٌ أَلِيمٌ } [الأحقاف: 24] لا عذاب أشد منه\n\n\nإذ { تُدَمِّرُ } وتهلك { كُلَّ شَيْءٍ } ذي حياة { بِأَمْرِ رَبِّهَا } وبمقتضى مشيئته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يُفسره قوله: { عارضاً } على أنه تمييز\n أي: رأوا عارضاً\n والعارض: السحاب\n سُمي به لأنه يعرض السحاب في أُفق السماء\n قال المفسرون: ساق الله السحابة السوداء التي اختاروها بما فيها من النقمة\n فخرجت عليهم من واد يُقال له: \" مغيث \" \n فلما رأوها مستقبلة أوديتهم\n أي: متوجة إليها\n فرحوا\n وقالوا: { هذا عارض مُمطرنا } أي: ممطر إياناً\n لأنه صفة النكرة\n فيقدر انفصاله\n\nقال الله تعالى: { بل هو ما استعجلتم به } من العذاب\n وقيل: القائل هود عليه السلام\n { ريحٌ فيها عذابٌ إليم } فجعلت تحمل الفساطيط\n وتحمل الظعينة فترفعها في الجو\n فتُرى كأنها جرادة\n قال ابن عباس: لما دنا العارض\n قاموا فنظروا\n فأول ما عروا أنه عذاب رأوا ما كان خارجاً من ديارهم من حالهم ومواشيهم\n تطير بهم الريح بين السماء والأرض\n مثل الريش\n فدخلوا بيوتهم\n وأغلقوا أبوابهم\n فألقت الريح أبوابهم\n وصرعتهم\n وأمر الله تعالى الريح فأمالت عليهم الرمال\n فكانوا تحت الرمل سبع ليال وثمانية أيام حسوماً\n لهم أنين\n ثم أمر الله تعالى الريح\n فكشفت عنهم الرمال\n فاحتملتهم\n فرمت منهم في البحر\n وشدخت الباقي بالحجارة\n وقيل: أول مَن أبصر العذاب امرأة منهم\n قالت: رأيت ريحاً فيها كشهب النار\n وهو معنى قوله: { تُدَمّرُ كلَّ شيء } أي: تهلك من نفوس عاد وأموالهم الجم الكثير\n فعبّر عن الكثرة بالكلية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:173",
      "similarity": 0.5181257791130263
    },
    {
      "verse": "27:58",
      "similarity": 0.5181257791130263
    },
    {
      "verse": "7:84",
      "similarity": 0.4790053041535175
    },
    {
      "verse": "25:40",
      "similarity": 0.4466095709031215
    },
    {
      "verse": "8:32",
      "similarity": 0.3704896263491159
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/46:24.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/46:24.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/46:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}