{
  "chapter": "الأحقاف",
  "text": "تدمر كل شىءۭ بامر ربها فاصبحوا۟ لا يرى الا مسكنهم كذلك نجزى القوم المجرمين",
  "translations": [
    {
      "translation": "destroying everything at its Lord's command! When morning came you could see nothing but their dwellings. That is how We repay the people of the evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will destroy everything at the bidding of its Lord.\" So in the morning there was nothing but their empty dwellings to be seen. That is how We requite the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that will destroy everything by the command of its Lord.” Thereafter nothing was left to be seen except their dwellings. Thus do We requite the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will destroy everything by the will of its Lord\" (Not very long after) nothing could be seen of them except their dwellings. Thus do We recompense the sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“That destroys all things by the command of its Lord” – so at morning none could be seen except their empty houses; this is the sort of punishment We mete out to the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Destroying everything by the command of its Lord! So they became such that nothing could be seen except their dwellings! Thus do We recompense the criminal people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Destroying everything by the command of its Lord, so they became such that naught could be seen except their dwellings. Thus do We reward the guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "destroying everything by the commandment of its Lord.' So in the morning there was naught to be seen but their dwelling-places. Even so do We recompense the people of the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Destroying all things by commandment of its Lord. And morning found them so that naught could be seen save their dwellings. Thus do We reward the guilty folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which will destroy everything at its Lord's behest!\" And in the morning there was nothing left to be seen save their [empty] dwellings: thus We repay the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall annihilate everything by the command of its Lord. Wherefore they became such that naught could be seen save their dwellings Thus We requite a nation of the culprits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "destroying everything by its Lord’s command.’ So they became such that nothing could be seen except their dwellings. Thus do We requite the guilty lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything will it destroy by the command of its Lord!\" Then by the morning they - nothing was to be seen but (the ruins of) their houses! thus do We recompense those given to sin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Destroying everything by the Command of its Lord! So they became such that nothing could be seen except their dwellings! Thus do We recompense the people who are Mujrimun (polytheists, disbelievers, sinners, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will destroy everything by the command of its Lord' And when morning came there was nothing to be seen except their dwellings. As such Werecompense sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will destroy everything by the command of its Lord. And when the morning came upon them, there was nothing to be seen except their dwellings. Thus We requite the guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Destroying everything by command of its Lord. And they became so that nothing was seen [of them] except their dwellings. Thus do We recompense the criminal people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:25] destroying, ruining, everything, it passes through, by the command of its Lord, by His will, that is to say, [destroying] everything that He wants to destroy with it. And so it destroyed their men, women, children and properties by flinging them up into the air high above the ground and tearing them to pieces. Only Hūd and those who believed with him remained [unscathed]. So they became such that nothing could be seen except their dwellings. Thus, in the way that We requited them, do We requite guilty folk, besides them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Destroying all things by commandment of its Lord) by leave of its Lord. (And morning found them so that) after their destruction (naught could be seen save their dwellings) their houses. (Thus do We reward the guilty folk) the idolatrous folk.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبعدما وصلت الريح دمرتهم تدميراً إلى حيث استأصلهم { فَأْصْبَحُواْ لاَ يُرَىٰ } منهم { إِلاَّ مَسَاكِنُهُمْ } أي: سوى دورهم الخربة وأطلالهم المندرسة\n وليس هذا مخصوصاً بهم بل { كَذَلِكَ نَجْزِي } عموم { ٱلْقَوْمَ ٱلْمُجْرِمِينَ } [الأحقاف: 25] الخاريجن عن ربقة عبوديتنا بارتكاب الجرائم والآثام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بأمر ربها } أي: رب الريح، وفي ذكر الأمر والرب، والإضافة ألى الريح، من الدلالة على عظيم شأنه تعالى ما لا يخفى، { فأصبحوا لا يُرى إلا مساكنُهُم } أي: فجاءت الريح فدمرتهم، فصاروا بحيث لا يُرى شيء إلا مساكنهم خاوية، ومَن قرأ بتاء الخطاب، فهو لكل مَن يتأتى منه الرؤية، تنبيهاً على أن حالهم صار بحيث لو نظر كل أحد بلادَهم لا يَرى فيها إلا مساكنهم\n { كذلك } أي: مثل ذلك الجزاء الفظيع { نجزي القومَ المجرمين } وننجي المؤمنين، رُوي أن هود عليه السلام ومَن معه من المؤمنين في حظيرته، ما يصيبهم من الريح إلا ما تلين على الجلود، وتلذه الأنفس، وإنها لتمرّ من عاد بالظعن بين السماء، والأرض، وتدمغهم بالحجارة\n سبحان الحكيم القدير، اللطيف الخبير\n الإشارة: إنما جاءت النُذر من عهد آدم عليه السلام إلى القيامة الساعة، تأمر بعبادة الله، ورفض كل ما سواه، فمَن تمسّك بذلك نجى، ومَن عبد غير الله، أو مال إلى سواه، عاجلته العقوبة في الظاهر أو الباطن\n والله تعالى أعلم\n ثم خوّف هذه الأمة بما جرى على عاد، فقال: { وَلَقَدْ مَكَّنَاهُمْ فِيمَآ إِن مَّكَّنَّاكُمْ فِيهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:172",
      "similarity": 0.7259570352301612
    },
    {
      "verse": "37:136",
      "similarity": 0.7259570352301612
    },
    {
      "verse": "25:36",
      "similarity": 0.697334295553913
    },
    {
      "verse": "27:51",
      "similarity": 0.5945829054626361
    },
    {
      "verse": "47:10",
      "similarity": 0.5770460415039816
    }
  ]
}