{
  "chapter": "الأحقاف",
  "text": "ويوم يعرض الذين كفروا۟ على النار اذهبتم طيبتكم فى حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون فى الارض بغير الحق وبما كنتم تفسقون",
  "translations": [
    {
      "translation": "On the Day when those who were kafir are exposed to the Fire: 'You dissipated the good things you had in your worldly life and enjoyed yourself in it. So today you are being repaid with the punishment of humiliation for being arrogant in the earth without any right and for being deviators.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the unbelievers are brought to the Fire, (it will be said): \"You wasted all your good deeds in the life of the world, and enjoyed them to the full. You will now be requited with a shameful punishment, for you behaved with arrogance for no reason on the earth, and acted wickedly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when the unbelievers will be exposed to the Fire, they will be told: “You have exhausted your share of the bounties in the life of the world, and you took your fill of enjoyments. So, degrading chastisement shall be yours on this Day for you waxed arrogant in the earth without justification and acted iniquitously.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the disbelievers will be exposed to the fire, they will be told, \"You have spent your happy days during your worldly life and enjoyed them. On this day you will suffer a humiliating torment for your unreasonably arrogant manners on earth and for the evil deeds which you have committed\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when the disbelievers will be presented upon the fire; it will be said to them, “You have wasted your portion of the good things in the life of this world and enjoyed them; so this day you will be repaid with the disgraceful punishment, the recompense of your wrongfully priding yourself in the land, and because you used to disobey.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when those who disbelieve will be exposed to the Fire (it will be said): \"You received your good things in the life of the world, and you took your pleasure therein. Today, you will be recompensed with the torment of extreme humiliation, because you were arrogant upon the earth without a right, and because you used to rebel against Allah's command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when those who disbelieve shall be brought before the fire: You did away with your good things in your life of the world and you enjoyed them for a while, so today you shall be rewarded with the punishment of abasement because you were unjustly proud in the land and because you transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the unbelievers are exposed to the Fire: 'You dissipated your good things in your present life, and you took your enjoyment in them; therefore today you shall be recompensed with the chastisement of humiliation for that you waxed proud in the earth without right, and for your ungodliness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when those who disbelieve are exposed to the Fire (it will be said): Ye squandered your good things in the life of the world and sought comfort therein. Now this day ye are rewarded with the doom of ignominy because ye were disdainful in the land without a right, and because ye used to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when those who deny the truth are brought before the Fire, it will be said to them, \"You have had the good things of the life of this world, and you enjoyed them. Now this Day you shall be requited with humiliating punishment, because you were arrogant in the land without justification, and because you acted rebelliously.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day whereon those who disbelieve shall be placed before the Fire: ye made away with your good things in your life of the world, and ye enjoyed yourselves therewith so Today ye shall be requited with the torment of ignominy, for that ye have been growing stiff-necked on the earth without justification, and for that ye have been transgressing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the faithless are exposed to the Fire, [they will be told,] ‘You have exhausted your good things in the life of the world and enjoyed them. So today you will be requited with a humiliating punishment for your acting arrogantly in the earth unduly, and because you used to transgress.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day that the Unbelievers will be placed before the Fire, (It will be said to them): \"Ye received your good things in the life of the world, and ye took your pleasure out of them: but today shall ye be recompensed with a Penalty of humiliation: for that ye were arrogant on earth without just cause, and that ye (ever) transgressed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when those who disbelieve (in the Oneness of Allah Islamic Monotheism) will be exposed to the Fire (it will be said): \"You received your good things in the life of the world, and you took your pleasure therein. Now this Day you shall be recompensed with a torment of humiliation, because you were arrogant in the land without a right, and because you used to rebel and disobey (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the Day when the unbelievers are brought before the Fire, (We shall say to them): 'You squandered your good things in your earthly life and took your fill of enjoyment in them, therefore today you shall be recompensed with a humiliating punishment, because you were unrightfully proud in the earth and for that you were debauchers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the faithless will be paraded before the Fire: “You have squandered your good in your worldly life, and you took pleasure in them. So today you are being repaid with the torment of shame, because of your unjust arrogance on earth, and because you used to sin.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"You exhausted your pleasures during your worldly life and enjoyed them, so this Day you will be awarded the punishment of [extreme] humiliation because you were arrogant upon the earth without right and because you were defiantly disobedient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:20] And on the day when those who disbelieve are exposed to the Fire, by its being revealed for them, it will be said to them: ‘You squandered (read with one hamza, adhhabtum, or with two hamzas [as an interrogative], a-adhhabtum, ‘have you sqaundered …?’; or with one hamza, adhhabtum, or with an initial long ‘a’, ādhhabtum, with both of these [pronounced fully] or without pronouncing the second [hamza]) your good things during your life of the world, by preoccupying yourselves with sensual delights, and enjoyed them. So today you will be requited with the chastisement of humiliation in return for acting arrogantly in the earth without right and in return for that regarding which you used to act immorally’, and [for] the torture you used to inflict [upon others] therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on the day when those who disbelieve are exposed to the Fire) before they actually enter it, ((it will be said)) to them: (Ye squandered your good things) you have used up the reward of your deeds (in the life of the world and sought comfort therein) and obtained benefit from the reward of your deeds in the life of the world. (Now this day ye are rewarded with the) severe (doom of ignominy because ye were disdainful) because you were too proud to accept faith (in the land without a right and because ye used to transgress) and because you used to disbelieve and transgress on the earth in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم يا أكمل الرسل { يَوْمَ يُعْرَضُ } المسرفون { ٱلَّذِينَ كَفَرُواْ } بالحق وأعرضوا عنه وعن أهله { عَلَى ٱلنَّارِ } المسعرة المعدة للكافري المعرضين لهم حينئذ على التوبيخ التشنيع أنتم { أَذْهَبْتُمْ طَيِّبَـٰتِكُمْ } من اللذائذ وتلذذهم بها { فِي حَيَاتِكُمُ ٱلدُّنْيَا وَٱسْتَمْتَعْتُمْ بِهَا } فيها { فَٱلْيَوْمَ تُجْزَوْنَ } بدلها { عَذَابَ ٱلْهُونِ } المخزي المضل { بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِي ٱلأَرْضِ } على عباد الله { بِغَيْرِ ٱلْحَقِّ } يعني: بدل تعززكم وتعظمكم بها في دار الدنيا وكبركم وخيلائكم على ضعفاء العباد { وَبِمَا كُنتُمْ تَفْسُقُونَ } [الأحقاف: 20] وتخرجون عن مقتضى الحدود الإلهية ظلماً وزرواً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ويوم }: منصوب بقول مقدّر قبل { أذهبتم } أي: يقال هم: أذهبتم طيباتكم يوم عرضكم، أو باذكر، وهو أحسن\n يقول الحق جلّ جلاله: { و } اذكر { يومَ يُعْرَضُ الذين كفروا على النار } أي: يُعذّبون بها، من قولهم: عُرض بنو فلان على السيف، إذا قُتلوا به، وقيل المراد: عرض النار عليهم، من قولهم: عرضت الناقة على الحوض، يريدون: عرض الحوض عليها، فقلبوا\n وإذا عُرضوا عليها يُقال لهم: { أَذْهبتُمْ طيباتِكُم } أي: أخذتم ما كُتب لكم من حظوظ الدنيا ولذائذها { في حياتكم الدنيا } فقد قدمتم حظكم من النعيم في الدر الفانية قال ابن عرفة: قيل: المراد بالطيبات المستلذات، والظاهر: أن المراد أسباب المستلذات، أي: الأسباب التي تتوصلون بها إلى نيل المستلذات في الدار الآخرة، إذ نسيتموها في الدنيا، أي: تركتموها ولم تفعلوها\n هـ\n قلت: يُبعده قوله: { واستمتعتم بها } أي: فلم يُبق ذلك لكم شيئاً منها، بل قدمتم جنتكم في دنياكم\n وعن عمر رضي الله عنه: لو شئتُ كنتُ أطيبَكم طعاماً، وألينكم لباساً، ولكني أستبقي طيباتي\n ولما قَدِم الشامَ صُنعَ له طعامٌ لم يُر قبله مثله، قال: هذا لنا، فما للفقراء المسلمين الذين ماتوا وهم لا يشبعون خبز الشعير؟ قال خالد، لهم الجنة، فاغروْرقتْ عينا عمر وبكى، وقال: لئن كان حظنا من الحطام، وذهبوا بالجنة، لقد باينونا بوناً بعيداً، وقال أبو هريرة رضي الله عنه: إنما كان طعامنا مع النبي صلى الله عليه وسلم الماء والتمر، والله ما كان نرى سمراءَكم هذه، وقال أبو موسى: ما كان لباسنا مع النبي صلى الله عليه وسلم إلا الصوف\n ورُوي: أن النبيّ صلى الله عليه وسلم دخل على أهل الصُّفة، وهم يرقعون ثيابهم بالأدَم، ما يجدون لها رقعاً، فقال:\n\n \" أنتم اليوم خيرٌ أم يومَ يغدوا أحدكم في حُلة، ويروح في أخرى، ويُغدا عليه بجفنة ويُراح بأخرى، ويُسترُ بيته كما تُستر الكعبة \"؟ قالوا: نحن يومئذ خير، فقال لهم: \" بل أنتم اليوم خير \"\n \n\nوقال عمرو بن العاص: كنت أتغدّى عند عمر الخبزَ والزيتَ، والخبز والخل، والخبز واللبن، والخبز والقديد، وأجلّ ذلك اللحم الغريض، وكان يقول: لا تنخلوا الدقيق، فإنه كله طعامٌ، ثم قال عمر رضي الله عنه: والله الذي لا إله إلا هو، لولا أني أخاف أن تنقص حسناتي يوم القيامة لشاركتهم في العيش! ولكني سمعتُ اللّهَ يقول لقوم: { أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها }\n هـ\n { فاليوم تُجزونَ عذابَ الهُونِ } أي: الهوان، وقرئ به، { بما كنتم } في الدنيا { تستكبرون في الأرض بغير الحق } بغير استحقاق لذلك، { وبما كنتم تَفْسُقون } وتخرجون عن طاعة الله عزّ وجل، أي: بسبب استكباركم وفسقكم\n\n\nالإشارة: ما زالت الأكابر من الأولياء تتنكب الحظوظ والشهوات، مجاهدةً لنفوسهم، وتصفيةً لقلوبهم، فإنَّ تَتَبُّعَ الشهوات يُقَسي القلب، ويكسِف نور العقل، كما قال الشاعر:\n\nهذا في حال سيرهم، فإذا تحقق وصولهم فلا كلام عليهم لأنهم يأخذون من الله، ويتصرفون به في أمورهم كلها، فلا حرج عليهم في نيل ما أنعم الله به عليهم، حيث أمِنوا ضرره، ومن ذلك: ما رُوي عن إبراهيم بن أدهم، أنه أصلح ذات يوم طعاماً كثيراً، ودعا نفراً يسيراً، منهم الأوزاعي والثوري، فقال له الثوري: أما تخاف أن يكون هذا إسرافاً؟ فقال: ليس في الطعام إسراف، إنما الإسراف في الثياب والأثاث، ودفع أيضاً إلى بعض إخوانه دراهم، فقال: خذ لنا بهذه زُبداً وعسلاً وخبزاً حُوَّاري، فقال: يا أبا إسحاق هذا كله؟ قال: ويحك إذا وجدنا أَكَلْنا أكلَ الرجال، وإذا عُدمنا صبرنا صبر الرجال، وإن معروفاً الكرخي كان يُهدي له طيبات الطعام، فيأكل، فيقال له: إن أخاك بِشْراً كان كلا يأكل من هذا، فيقول: أخي بِشْر قبضه الورعْ، وأنا بسطتني المعرفة، وإنما أنا شضيف في دار مولاي، إذا أطعمني أكلت، وإذا جوّعني صبرت، ما لي وللاعتراض والتمييز\n هـ\n والحاصل: أن الناس أقسام ثلاثة: عوام، لا همة لهم في السير، وإنما قنعوا أن يكونوا من عامة أهل اليمين\n فهؤلاء يأخذون كل ما أباحته الشريعة، إذ لا سير لهم حتى يخافوا من تخلُّفهم، وخواص، نهضت همتُهم إلى الله، وراموا الوصول إليه، وهم في السير لم يتحقق وصولهم، أو من العُبَّاد والزهّاد، يخافون إن تناولوا المستلذات تفتَّرت عزائمهم، فهؤلاء يتأكد في حقهم ترك الحظوظ والشهوات، والقسم الثالث: خواص الخواص، قد تحقق وصولهم، ورسخت أقدامهم في المعرفة، فهؤلاء لا كلام معهم، ولا ميزان عليهم\n قال في الإحياء، بعد كلام: وأكل الشهوات لا يُسلَّم إلا لمَن نظر من مشكاة الولاية والنبوة، فيكون بينه وبين الله علامة في استرساله وانقباضه، ولا يكون ذلك إلا بعد خروج النفس من طاعة الهوى والعادة بالكلية، حتى يكون أكلُه إذا أكل بنية، كما يكون إمساكه بنية، فيكون عاملاً له في إفطاره وإمساكه\n ثم قال: وينبغي أن يتعلّم الحزم من عُمر، فإنه كان يرى النبيّ صلى الله عليه وسلم يُحب العسل ويأكله، ثم لم يقس نفسه عليه، بل لمّا عُرض عليه ماء مبرّد بالعسل جعل يُدير الإناء في كفه، ويقول: أَشربُها فتذهب حلاوتها وتبقى تباعتُها، اعزلوا عني حسابها، وتركها رضي الله عنه\n ثم ذكر وبال من تمتع بدنياه، وأعرض عن أخراه، فقال: { وَٱذْكُرْ أَخَا عَادٍ إِذْ أَنذَرَ قَوْمَهُ }\n\n",
      "translations": []
    }
  ]
}