{
  "chapter": "الأحقاف",
  "text": "واذ صرفنا اليك نفرا من الجن يستمعون القرءان فلما حضروه قالوا۟ انصتوا۟ فلما قضى ولوا۟ الى قومهم منذرين",
  "translations": [
    {
      "translation": "And We diverted a group of jinn towards you to listen to the Qur'an. When they were in earshot of it they said, 'Be quiet and listen.' When it was over they went back to their people, warning them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember), when We turned a company of jinns towards you to listen to the Qur'an, they arrived when it was being recited, and they said: \"Keep silent.\" When it was over they came back to their people, warning them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind when We sent to you a party of the jinn that they may listen to the Qur'an. When they reached the place (where you were reciting the Qur'an), they said to one another: “Be silent (and listen).” And when the recitation ended, they went back to their people as warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We turned a party of jinn towards you to listen to the Quran. When they attended a Quranic recitation, they said to each other, \"Be silent,\" and, when it was over, they turned back to their people, in warning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We sent a number of jinns towards you (O dear Prophet Mohammed – peace and blessings be upon him), listening attentively to the Qur’an; so when they presented themselves there, they said to each other, “Listen quietly!”; and when the recitation finished, they turned back to their people, giving them warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We sent toward you a group of the Jinn, to listen to the Qur'an. When they attended it, they said: \"Listen quietly!\" And when it was concluded, they returned to their people, as warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We turned towards you a party of the jinn who listened to the Quran; so when they came to it, they said: Be silent; then when it was finished, they turned back to their people warning (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We turned to thee a company of jinn giving ear to the Koran; and when they were in its presence they said, 'Be silent!' Then, when it was finished, they turned back to their people, warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We inclined toward thee (Muhammad) certain of the jinn, who wished to hear the Qur'an and, when they were in its presence, said: Give ear! and, when it was finished, turned back to their people, warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember how We sent to you a band of jinn who wished to hear the Quran and as they listened to its recitation, they said to one another, \"Be silent and listen,\" and, then when it was finished, they went back to their people, to give them warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We turned towards thee a company Of the Jinns hearkening Unto the Qur'an. So when they came in the presence thereof they said: give ear. Then when it was ended, they turned back to their people as warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We dispatched toward you a team of jinn listening to the Quran, when they were in its presence, they said, ‘Be silent!’ When it was finished, they went back to their people as warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, We turned towards thee a company of Jinns (quietly) listening to the Qur'an: when they stood in the presence thereof, they said, \"Listen in silence!\" When the (reading) was finished, they returned to their people, to warn (them of their sins).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We sent towards you (Muhammad SAW) Nafran (three to ten persons) of the jinns, (quietly) listening to the Quran, when they stood in the presence thereof, they said: \"Listen in silence!\" And when it was finished, they returned to their people, as warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) how We sent to you (Prophet Muhammad) a company of jinn who, when they came and listened to the Koran, said to each other: 'Be silent' Then, when it was finished, they returned to their nation and warned them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when We dispatched towards you a number of jinn, to listen to the Quran. When they came in its presence, they said, “Pay attention!” Then, when it was concluded, they rushed to their people, warning them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when We directed to you a few of the jinn, listening to the Qur'an. And when they attended it, they said, \"Listen quietly.\" And when it was concluded, they went back to their people as warners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:29] And, mention, when We sent a company of jinn your way — the jinn of Nasībīn in Yemen, or the jinn of Nineveh, who were seven or nine, [and this was] while the Prophet (s) was leading the dawn prayer with some of his Companions at Batn Nakhla, as reported by the two Shaykhs [al-Bukhārī and Muslim] — to listen to the Qur’ān and, when they were in its presence, they said, that is, they said to one another: ‘Listen carefully!’, concentrate in order to hear it [carefully]. Then, when it was finished, [when] he was finished reciting it, they went back to their people to warn [them], to threaten their people with the chastisement [from God] if they do not believe — they had been Jews, but then become Muslims.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We inclined towards thee (Muhammad)) and when we directed towards you (certain) a group (of the jinn) nine in all, (who wished to hear the Qur'an) recited (and, when they were in its presence) and when they were in the presence of the Prophet Muhammad (pbuh) in Batn Nakhl, they (said) to one another: (Give ear!) so that you can hear the words of the Prophet (pbuh) (and, when it was finished) when the Prophet (pbuh) finished his recitation and prayer, they declared their belief in Muhammad (pbuh) and the Qur'an, and (turned back to their people, warning) they went back to their own folk as believers in Muhammad (pbuh) and the Qur'an and also as warners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذْ صَرَفْنَآ إِلَيْكَ نَفَراً } قال الإِمام زيد بن علي عليهما السّلامُ: بَلغني أنهم كانوا تسعةً أحدُهم زوبعة أتوا النبي صلى الله عليه وَعَلة آلهِ وسلَّمَ ببطنِ نَخلةٍ وهو قائمٌ يُصلي فاستمعوا القُرآنَ\n\n\n\n\nوقوله تعالى: { فَلَمَّا حَضَرُوهُ قَالُوۤاْ أَنصِتُواْ } معناه قالوا صه\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذْ صَرَفنا إليك نفراً من الجنّ } الجنّ نفوس أرضية تجسدت في أبدان لطيفة مركبة من لطائف العناصر سماها حكماء الفرس الصور المعلقة، ولكونها أرضية متجسدة في أبدان عنصرية ومشاركتها الإنس في ذلك سميّا ثقلين، وكما أمكن الناس التهدّي بالقرآن أمكنهم\n وحكاياتهم من المحققين وغيرهم أكثر من أن يمكن ردّ الجميع وأوضح من أن يقبل التأويل، وإن شئت التطبيق فاسمع\n وإذْ صرفنا إليك نفراً من جنّ القوى الروحانية من العقل والفكر والمتخيلة والوهم حال القراءة في الصلاة، أي: أملناهم نحوك واتّبعناهم سرّك بالإقبال بهم إليك وصرفهم عن جانب النفس والطبيعة بتطويقهم إياك وتسخيرهم لك حتى يجتمع همّك ولا يتوزع قلبك ولا يتشوّش بالك بحركاتهم في وقت حضورك عند طلوع فجر نور القدس { يستمعون القرآن } الوارد إليك من العالم القدسيّ { فلما حضروه } أي: حضروا العقل القرآني الجامع للكمالات عند ظهور النور الفرقاني عليك { قالوا أنصتوا } أي: سكنوا وسكت بعضهم بعضاً عن كلامهم الخاص بهم مثل الأحاديث النفسانية والتصورات والهواجس والوساوس والخواطر والحركات الفكرية والانتقالات التخيلية\n والقول ههنا حاليّ كما ذكر غير مرة إذ لو لم يسكنوا وينصتوا مستمعين لما يفيض عليهم من الواردات القدسية لم يبق من الوارد أثر، بل لم يكن بتلقي الغيب ولا ورود المعنى القدسي ولا تلاوة الكلام الإلهي كما ينبغي، ولهذا قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لمن عاندك وكذلك إلزاماً لهم وتبكيتاً وقت { إِذْ صَرَفْنَآ } وأملنا { إِلَيْكَ } يا أكمل الرسل تأييداً لك ولشأنك { نَفَراً } جماعة { مِّنَ ٱلْجِنِّ } حال كونهم { يَسْتَمِعُونَ } منك { ٱلْقُرْآنَ } حين تلوته في صلاتك وتهجدك { فَلَمَّا حَضَرُوهُ } أي: القرآن وسمعوه، تعجبوا من حسن نظمه واتساقه، وكمال بلاغته وفصاحته { قَالُوۤاْ } أي: بعضهم لبعض: { أَنصِتُواْ } ولا تخالطوا أصواتكم حتى نسمع على وجهه؛ إذ هو كلام عجيب في أعلى مرتبة البلاغة { فَلَمَّا قُضِيَ } وتم قراءته وفهموا معناه وفحواه { وَلَّوْاْ } ورجعوا { إِلَىٰ قَوْمِهِم } حال كونهم { مُّنذِرِينَ } [الأحقاف: 29] بما يفهمون منه من الإنذارات والوعيدات القوم الذين بلغوا حد التكليف من إخوانهم ينذرونهم بها عن الضلال والانحراف عن طريق الحق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" النفر \" بالفتح: الجماعة من ثلاثة إلى عشرة، وقيل: إلى سبعة ولا يُقال نفر فيما زاد على عشرة، والرهط والقوم والعشيرة والعشر معناهم الجمع، ولا واحد لهم من لفظه، وهو للرجال دون النساء\n قاله في المصباح\n و { من الجن } نعت للنفر، وكذا { يستمعون }\n يقول الحق جلّ جلاله: { و } اذكر { إِذ صرفنا إِليك نفراً من الجن } أي: أملناهم إليك، وقبلنا بهم نحوك، وهم جن نصيبين، أو جن نينوى، قال في القاموس: \" نِينوى \" بكسر أوله، موضع بالكوفة، وقرية بالموصل ليونس عليه السلام\n هـ\n { يستمعون القرآن } منه عليه السلام { فلما حضروه } أي: الرسول صلى الله عليه وسلم، أو القرآن، أي: كانوا منه حيث تمّ وفرغ من تلاوته، { وَلَّوا إِلى قومهم منذرين } مقدّرين إنذارهم عند رجوعهم إليهم\n رُوي: أن الجنَّ كانت تسترق السمع، فلما حُرست السماء، ورُموا بالشُهب، قالوا: ماهذا إلا لأمر حديث، فاضربوا مشارق الأرض ومغاربها، لتعرفوا ما هذا، فنهض سبعة أو تسعة من أشراف جن نصيبين أو نينوى، منهم: \" زوبعة \" فمضوا نحو تهامة، ثم انتهوا إلى وادي نخلة، فوافقوا رسولَ الله صلى الله عليه وسلم وهو قائم يصلي صلاة الفجر، فستمعوا القرآن، وذلك عند منصرفه من الطائف، حين ذهب يدعوهم إلى الله، فكذّبوه، وردُّوا عليه، وأغروا به سفاءهم، فمضى على وجهه، حتى وصل إلى نخل، فصلّى بها الغداة، فوافاه نفر الجن يصلي، فاستمعوا لقراءته، ولم يشعُر بهم، فأخبره الله تعالى باستماعهم\n وقيل: أمره اللّهُ تعالى أن يُنذر الجن، ويقرأ عليهم، فصرف الله إليه نفراً منهم، وجمعهم له، فقال صلى الله عليه وسلم:\n\n \" إني أُمرت أن أقرأ على الجن، فمَن يتبعني؟ \" قالها ثلاثاً، فأطرقوا إلا عبد الله بن مسعود، قال: فانطلقنا حتى إذا كنا بأعلى مكة، في شعب الجحون، فخطّ خطّاً، فقال: لا تخرج عنه حتى أعود إليك، ثم افتتح القرآن، وسمعت لغطاً شديداً، حتى خفت على رسول الله صلى الله عليه وسلم فجعلت أرى أمثال النسور تهوي وتمشي، وغشيته أسوِدة كثيرة حالت بيني وبينه، حتى ما أسمع صوته، ثم تتقطع كقطع الحساب، ذاهبين، ففرغ صلى الله عليه وسلم مع الفجر، فقال: أنمتَ؟ فقلت: لا والله، ولقد هممت مراراً أن أستغيث بالناس حتى سمعتك تقرعهم بعصاك، تقول: اجلسوا، فقال: لو خرجت لم آمن عليك أن يتخطفك بعضهم، ثم قال رسولُ الله صلى الله عليه وسلم: \" هل رأيت شيئاً؟ \" قلت: نعم، رجالاً سوداً، في ثياب بيض، قال: \" أولئك جن نصيبين \" \n\nوكانوا اثني عشر ألفاً، والسورة التي قرأ عليهم: { اقرأ باسم ربك }\n فلمَّا رجعوا إلى قومهم { قالوا يا قومنا إِنا سمعنا كتاباً أُنزل من بعد موسى } قيل: قالوا ذلك لأنهم كاناو على اليهودية، وعن ابن عباس: إن الجن لم تكن سمعت بأمر عيسى عليه السلام وهو بعيد\n\n\nحال كون الكتاب { مُصدّقاً لما بين يديه يهدي إِلى الحق } من العقائد الصحيحة، أو إلى الله، { وإِلى صراطٍ مستقيم } يُوصل إلى الله، وهو الشرائع والأعمال الصالحة",
      "translations": []
    }
  ]
}