{
  "chapter": "الأحقاف",
  "text": "ولقد مكنهم فيما ان مكنكم فيه وجعلنا لهم سمعا وابصرا وافـدة فما اغنى عنهم سمعهم ولا ابصرهم ولا افـدتهم من شىء اذ كانوا۟ يجحدون بـايت الله وحاق بهم ما كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "We established them far more firmly than We have established you and gave them hearing, sight and hearts. But their hearing, sight and hearts were of no use to them at all when they renounced Allah's Signs and what they mocked at engulfed them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had strengthened them as We have not strengthened you, had given them ears and eyes and hearts; but nothing stood them in good stead, neither their ears nor eyes nor hearts, for they rejected the signs of God, and were seized by what they had mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had established them firmly in a manner We have not established you. We had given them ears and eyes and hearts. But nothing availed them -- neither their ears, nor their eyes, nor their hearts, for they denied the Signs of Allah. Then what they had mocked at encompassed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had established them more firmly in the land than you are. We had given them ears, eyes, and hearts but none of their ears, eyes, and hearts proved to be of any benefit to them; they rejected the revelations of God and the torment which they mocked brought upon them utter destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had indeed given them the means which We have not given you, and made ears and eyes and hearts for them; so their ears and eyes and hearts did not benefit them at all because they used to deny the signs of Allah, and the punishment they used to mock at encompassed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We had firmly established them with that wherewith We have not established you! We also gave them hearing, vision, and hearts. But their hearing, vision, and hearts availed them nothing since they used to deny the Ayat of Allah, and they were completely encircled by that which they used to ridicule!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We had established them in what We have not established you in, and We had given-- them ears and eyes and hearts, but neither their ears, nor their eyes, nor their hearts availed them aught, since they denied the communications of Allah, and that which they mocked encompassed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had established them in that wherein We have not established you, and We appointed for them hearing, and sight, and hearts; and yet their hearing, their sight and their hearts availed them nothing, since they denied the signs of God, and they were encompassed by that they mocked at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We had empowered them with that wherewith We have not empowered you, and had assigned them ears and eyes and hearts; but their ears and eyes and hearts availed them naught since they denied the revelations of Allah; and what they used to mock befell them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had empowered them to an extent which We have not empowered you, [O people of later times]; and We had endowed them with hearing, and sight, and hearts: but neither their hearing, nor their sight, nor their hearts were of the least avail to them, since they went on rejecting God's revelations; and they were overwhelmed by the very thing which they had been wont to deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We had established them in that flourishing condition wherein We have not established you, and We had appointed for them hearing and sight and hearts; yet their hearing and sight and heart availed them not at all, they became wont to gainsay the revelations of Allah, and surrounded them that whereat they had been mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We had granted them power in respects that We have not granted you, and We had vested them with hearing and sight and hearts. But neither their hearing availed them in any way nor did their sight, nor their hearts when they used to impugn the signs of Allah. So they were besieged by what they used to deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had firmly established them in a (prosperity and) power which We have not given to you (ye Quraish!) and We had endowed them with (faculties of) hearing, seeing, heart and intellect: but of no profit to them were their (faculties of) hearing, sight, and heart and intellect, when they went on rejecting the Signs of Allah; and they were (completely) encircled by that which they used to mock at!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We had firmly established them with that wherewith We have not established you (O Quraish)! And We had assigned them the (faculties of) hearing (ears), seeing (eyes), and hearts, but their hearing (ears), seeing (eyes), and their hearts availed them nothing since they used to deny the Ayat (Allah's Prophets and their Prophethood, proofs, evidences, verses, signs, revelations, etc.) of Allah, and they were completely encircled by that which they used to mock at!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had established them in that which We have not established you, and We made for them hearing, sight, and hearts, but their hearing, sight, andhearts did not help them a thing, because they disbelieved the signs of Allah. And what they mocked encompassed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had empowered them in the same way as We empowered you; and We gave them the hearing, and the sight, and the minds. But neither their hearing, nor their sight, nor their minds availed them in any way. That is because they disregarded the revelations of God; and so they became surrounded by what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly established them in such as We have not established you, and We made for them hearing and vision and hearts. But their hearing and vision and hearts availed them not from anything [of the punishment] when they were [continually] rejecting the signs of Allah; and they were enveloped by what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:26] And verily We had empowered them in ways in which We have not (in is either for negation or extra) empowered you, O people of Mecca, in the way of strength and means, and We had vested them with ears and eyes and hearts. But their ears and their eyes and their hearts did not avail them in any way (min shay’in: min is extra) since (idh, is operated by aghnā, ‘avail’, and imbued with the sense of [a particle introducing a] reason) they used to deny the signs of God, His clear proofs, and they were besieged by, there befell them, what they used to deride, of chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَقَدْ مَكَّنَّاهُمْ فِيمَا إِنْ مَكَّنَّاكُمْ فِيهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَارًا وَأَفْئِدَةً فَمَا أَغْنَى عَنْهُمْ سَمْعُهُمْ وَلَا أَبْصَارُهُمْ وَلَا أَفْئِدَتُهُمْ مِنْ شَيْءٍ إِذْ كَانُوا يَجْحَدُونَ بِآَيَاتِ اللَّهِ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ (26(هذا استخلاص لموعظة المشركين بمَثَل عاد ، ليعلموا أن الذي قدَر على إهلاك عاد قادر على إهلاك مَن هم دونهم في القوة والعدد ، وليعلموا أن القوم كانوا مثلهم مستجمعين قوى العقل والحسّ وأنهم أهملوا الانتفاع بقواهم فجحدوا بآيات الله واستهزؤوا بها وبوعيده فحاق بهم ما كانوا يستهزئون به ، وقريش يعلمون أن حالهم مثل الحال المحكيّة عن أولئك فليتهيّأوا لما سيحلّ بهم . ولإفادة هذا الاستخلاص غُيّر أسلوب الكلام إلى خطاب المشركين من أهل مكة ، فالجملة في موضع الحال من واو الجماعة في { قالوا أجئتنا } \\[ الأحقاف : 22 \\] والخبر مستعمل في التعجيب من عدم انتفاعهم بمواهب عقولهم . وتأكيد هذا الخبر بلام القسم مع أن مفاده لا شك فيه مصروف إلى المبالغة في التعجيب .والتمكين : إعطاء المَكِنة ( بفتح الميم وكسر الكاف ( وهي القدرة والقوة . يقال : مكُن من كذا وتمكن منه ، إذا قدر عليه . ويقال : مكَّنه في كذا ، إذا جعل له القدرة على مدخول حرف الظرفية فيفسر بما يليق بذلك الظرف قال تعالى : { مكنّاهم في الأرض ما لم نمكن لهم } في سورة الأنعام ( 6 ( .فالمعنى : جعلنا لهم القدرة في الذي لم نمكنكم فيه ، أي من كل ما يمكّن فيه الأقوام والأمم ، وتقدم عند قوله تعالى : { ألم يروا كم أهلكنا من قبلهم من قرن مكَّنَّاهم في الأرض } في أول الأنعام ( 6 ( فضمّ إليه ما هنا .و ( ما ( من قوله فيما } موصولة . و { إن } نافية ، أي في الذي ما مَكَّناكم فيه .ومعنى مكناكم فيه : مكناكم في مثله أو في نوعه فإن الأجناس والأنواع من الذوات حقائق معنوية لا تتغير مواهبها وإنما تختلف بوجودها في الجزئيات ، فلذلك حسن تعدية فعل { مكناكم } بحرف الظرفية إلى ضمير اسم الموصول الصادق على الأمور التي مُكنت منها عاد . ومن بديع النظم أن جاء النفي هنا بحرف { إنْ } النافية مع أنَّ النفي بها أقل استعمالا من النفي ب ( ما ( النافية قصداً هنا لدفع الكراهة من توالي مثلين في النطق وهما ( ما ( الموصولة و ( ما ( النافية وإن كان معناهما مختلفاً ، ألا ترى أن العرب عوضوا الهاء عن الألف في ( مهما ( ، فإن أصلها : ( ما ما ( مركبة من ( ما ( الظرفية و ( ما ( الزائدة لإفادة الشرط مثل ( أينما ( . قال في «الكشاف» : ولقد أغَثَّ أبو الطيب في قوله :لعمرك مَا مَا بَان منك لِضَاربٍ ... وأقول ولم يتعقب ابن جنّي ولا غيره ممّن شرح الديوان من قبل على المتنبي وقد وقع مثله في ضرورات شعر المتقدمين كقول خطام المجاشعي :وَصَاليات كَكَمَا يُؤثفَيْنْ ... ولا يغتفر مثله للمولدين .فأما إذا كانت ( ما ( نافية وأراد المتكلم تأكيدها تأكيداً لفظياً ، فالإتيان بحرف ( إنْ ( بعد ( ما ( أحرى كما في قول النابغة :رماد ككحل العين ما إنْ أبينُه ... ونؤيٌ كجذم الحوض أثلم خاشعوفائدة قوله : { وجعلنا لهم سمعاً وأبصاراً وأفئدة } أنهم لم ينقصهم شيء من شأنه أي يخلّ بإدراكهم الحق لولا العناد ، وهذا تعريض بمشركي قريش ، أي أنكم حرمتم أنفسكم الانتفاع بسمعكم وأبصاركم وعقولكم كما حُرموه ، والحالة متحدة والسبب متّحد فيوشك أن يكون الجزاء كذلك . وإفراد السمع دون الأبصار والأفئدة للوجه الذي تقدم في قوله : { قل أرأيتم إن أخذ الله سمعكم وأبصاركم } في سورة الأنعام ( 46 ( وقوله : { أم مَن يملك السمع والأبصار } في سورة يونس ( 31 ( .ومِن } في قوله : { من شيء } زائدة للتنصيص على انتفاء الجنس فلذلك يكون { شيء } المجرور ب { من } الزائدة نائباً عن المفعول المطلق لأن المراد بشيء من الإغناء ، وحق { شيء } النصب وإنما جُرّ بدخول حرف الجر الزائد .و { إذْ } ظرف ، أي مدة جحودهم وهو مستعمل في التعليل لاستواء مؤدى الظرف ومؤدى التعليل لأنه لما جعل الشيء من الإغناء معلقاً نفيُه بزمان جحدهم بآيات الله كما يستفاد من إضافة { إذْ } إلى الجملة بعدها ، عُلم أن لذلك الزمان تأثيراً في نفي الإغناء .وآيات الله دلائل إرادته من معجزات رسولهم ومن البراهين الدالة على صدق ما دعاهم إليه . وقد انطبق مثالهم على حال المشركين فإنهم جحدوا بآيات الله وهي آيات القرآن لأنها جَمَعت حقيقة الآيات بالمعنيين .وحاق بهم : أحاط بهم { وما كانوا به يستهزئون } العذاب ، عدل عن اسمه الصريح إلى الموصول للتنبيه على ضلالهم وسوء نظرهم .\n\n",
      "translations": [
        {
          "translation": "(And verily We had empowered them with) We gave them of wealth, power and works (that where with We have not empowered you) that which We did not give you, People of Mecca, (and had assigned them ears) with which to hear (and eyes) with which to see (and hearts) with which to perceive; (but their ears and eyes and hearts availed them naught) from Allah's chastisement (since they denied the revelations of 588 Allah) since they denied Hud and Allah's Scripture; (and what they used to mock befell them) the chastisement which they used to mock befell them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى توبيخ مشركي مكة ومجرميهم على وجه التأكيد والمبالغة\n فقال سبحانه مقسماً: { وَ } الله يا أهل مكة { لَقَدْ مَكَّنَاهُمْ } أي: عاداً { فِيمَآ } أي: في الأمور التي أن { مَّكَّنَّاكُمْ فِيهِ } أي: ما مكناكم وأقدرناكم فيه من كثرة الأموال والأولاد والحصون والقلاع والقصور الرفيعة والمنازل الوسيعة { وَجَعَلْنَا لَهُمْ سَمْعاً } ليسمعوا به آياتنا الدالة على وحدة ذاتنا { وَأَبْصَاراً } ليشهدوا بها آثار قدرتنا ومتانة حكمتنا الدالة على كمال علمنا { وَأَفْئِدَةً } ولينكشفوا بها على وحدة ذاتنا ويتفطنوا بها باستقلالنا في تدبيراتنا وتصرفاتنا\n ومع ذلك { فَمَآ أَغْنَىٰ } ودفع { عَنْهُمْ سَمْعُهُمْ وَلاَ أَبْصَارُهُمْ وَلاَ أَفْئِدَتُهُمْ مِّن شَيْءٍ } أي: شيئاً من الإغناء\n أي: ما أفاد لهم هذه الآلات العجيبة الشأن شيئاً من الفائدة التي هي إنقاذهم عن الجهل بالله\n وعم الضلال في طريق توحيده\n إذ { كَانُواْ يَجْحَدُونَ } وينكرون بمقتضى جهلهلم المركب في جبلتهم أمثالكم أيها الجاحدون بآيَاتِ اللهِ ودلائل توحيده\n ويستهزئون بها وبمن أنزلت إليه من الرسل { وَ } لذلك { حَاقَ } وأحاط { بِهم } وبال { مَّا كَانُواْ بِهِ يَسْتَهْزِئُونَ } [الأحقاف: 26] عاجلاً\n وسيلحقهم وينزل عليهم وعليكم أيضاً أيها المسرفون آجلا بأضعافه وآلافه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فيما } موصولة\n أو موصوفة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:10",
      "similarity": 0.4856427973932469
    },
    {
      "verse": "21:41",
      "similarity": 0.4856427973932469
    },
    {
      "verse": "16:34",
      "similarity": 0.48319909240744197
    },
    {
      "verse": "45:33",
      "similarity": 0.4688328263586777
    },
    {
      "verse": "39:48",
      "similarity": 0.4580182541128728
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}