{
  "chapter": "الأحقاف",
  "text": "يقومنا اجيبوا۟ داعى الله وءامنوا۟ به يغفر لكم من ذنوبكم ويجركم من عذاب اليم",
  "translations": [
    {
      "translation": "Our people, respond to Allah's caller and believe in Him. He will forgive you some of your wrong actions and save you from a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people, hearken to the summoner of God, and believe in him, so that He may forgive you your sins and save you from a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our people, respond to the call of him who calls you to Allah and believe in him. Allah will forgive your sins and will protect you from a grievous chastisement.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our people, respond favorably to the Messenger of God and believe in Him. He will forgive your sins and rescue you from the painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O our people! Listen to Allah’s caller and accept faith in Him, so that He may forgive you some of your sins and save you from the painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! Respond to Allah's Caller, and believe in him. He (Allah) will forgive you some of your sins, and protect you from a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! accept the Divine caller and believe in Him, He will forgive you of your faults and protect you from a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people, answer God's summoner, and believe in Him, and He will forgive you some of your sins, and protect you from a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! respond to Allah's summoner and believe in Him. He will forgive you some of your sins and guard you from a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our people, respond to the one who calls you to God. Believe in him! God will forgive you your sins and protect you from a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! answer Allah's summoner and believe in him; He shall forgive you your sins and shall shelter you from a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! Respond to Allah’s summoner and have faith in Him. He will forgive you some of your sins and shelter you from a painful punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people, hearken to the one who invites (you) to Allah, and believe in him: He will forgive you your faults, and deliver you from a Penalty Grievous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! Respond (with obedience) to Allah's Caller (i.e. Allah's Messenger Muhammad SAW), and believe in him (i.e. believe in that which Muhammad SAW has brought from Allah and follow him). He (Allah) will forgive you of your sins, and will save you from a painful torment (i.e. Hell-fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our nation, answer the Caller of Allah and believe in Him! He (Allah) will forgive you some of your sins and protect you from a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people! Answer the caller to God, and believe in Him; and He will forgive you your sins, and will save you from a painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people, respond to the Messenger of Allah and believe in him; Allah will forgive for you your sins and protect you from a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:31] O our people! Respond to God’s summoner, Muhammad (s), by embracing faith, and believe in him, and He, God, will forgive you some of your sins, because some of these [sins] are wrongs [done to others] and which [therefore] can only be forgiven after those wronged are reconciled — and shelter you from a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 our people! respond to Allah's summoner) Muhammad (pbuh) in his call for belief in Allah's divine Oneness (and believe in Him. He will forgive you some of your sins) Allah will forgive you the sins you committed in the time of ignorance (and guard you from a painful doom) and save you from a painful torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰقَوْمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ } يعني: محمداً صلى الله عليه وسلم واقبلوا منه دعوته إلى توحيد الحق ودين الإسلام { وَآمِنُواْ بِهِ } وبكتابه الذي أنزل إليه لتبيين دينه وتأييد أمره { يَغْفِرْ لَكُمْ } سبحانه { مِّن ذُنُوبِكُمْ } أي: من جميعها أن تبتم ورجعتم إليه مخلصين { وَيُجِرْكُمْ مِّنْ عَذَابٍ أَلِيمٍ } [الأحقاف: 31] هو عذاب النار\n إذ لا عذاب أشد منها وأفزع\n\n\n{ وَ } بالجملة: { مَن لاَّ يُجِبْ دَاعِيَ } ولا يؤمن به سبحانه\n وبجميع ما جاء داعية من عنده\n بل كذب الداعي وأنكر دعوته ولم يقبل منه { فَلَيْسَ } هو أي: المنكر { بِمُعْجِزٍ فِي ٱلأَرْضِ } حتى يهرب عن انتقامه سبحانه\n ويفر من غضبه من مكان على مكان\n أو يستر عنه سبحانه ويخفى نفسه في أقطار الأرض",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يا قومنا أجيبوا دَاعِيَ الله } وهو محمد صلى الله عليه وسلم، { وآمِنوا به } أي: بالرسول أو القرآن، وصفوه بالدعوة إلى الله تعالى بعدما وصفوه بالهداية إلى الحق والطريق المستقيم لتلازمهما، دعوهم إلى ذلك بعد بيان حقيقته واستقامته، ترغيباً في الإجابة، ثم أكدوه بقولهم: { يغفر لكم من ذنوبكم } أي: بعض ذنوبكم، وهو ما كان في حق خالصٍ لله تعالى، فإنّ حقوق العباد لا تُغفر بالإيمان، وقيل: تغفر\n { ويُجركمْ من عذابٍ أليم } موجع\n واختلف في مؤمني الجن، هل يُثابون على الطاعون، ويدخلون الجنة، أو يُجارون من النار فقط؟ قال الفخر: والصحيح أنهم في حكم بني آدم، يستحقون الثواب على الطاعة، والعقاب على المعصية، وهو قول مالك، وابن أبي ليلى، وقال الضحاك: يدخلون الجنة ويأكلون ويشربون\n هـ\n ويؤده قوله تعالى: { وَلِكُلِّ دَرَجَاتٌ مِمَّا عَمِلُوا } كما تقدّم في الأنعام\n { ومَن لا يُجِبْ داعيَ الله فليس بمعجزٍ في الأرض } أي: لا ينجي منه مهرب، وإظهار \" داعي الله \" من غير اكتفاء بضميره، للمبالغة في الإيجاب، بزيادة المهابة والتقرير وتربيته، وإدخال الروعة\n وتقييد الإعجاز بكونه في الأرض لتوسيع الدائرة، أي: فليس بمعجز له تعالى وإن هرب في أقطار الأرض ودخل في أعمالقها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:28",
      "similarity": 0.6851481598553206
    },
    {
      "verse": "23:88",
      "similarity": 0.6482959240496479
    },
    {
      "verse": "9:6",
      "similarity": 0.5825139744692565
    },
    {
      "verse": "16:9",
      "similarity": 0.421952470615255
    },
    {
      "verse": "72:22",
      "similarity": 0.4088267923225144
    }
  ]
}