{
  "chapter": "الأحقاف",
  "text": "قالوا۟ يقومنا انا سمعنا كتبا انزل منۢ بعد موسى مصدقا لما بين يديه يهدى الى الحق والى طريق مستقيم",
  "translations": [
    {
      "translation": "They said, 'Our people, we have heard a Book which was sent down after Musa, confirming what came before it, guiding to the truth and to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our people:\" they said: \"we have listened to a Book which has come down after Moses, confirming what was (sent down) before it, showing the way to the truth and a path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: “Our people, We have heard a Scripture revealed after Moses, verifying the Scriptures revealed before it; it guides to the Truth and to the Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said, \"Our people, we have listened to the recitation of a Book revealed after Moses. It confirms the Books revealed before and guides to the Truth and the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O our people! We have indeed heard a Book, sent down after Moosa, which confirms the Books preceding it, and guides towards the Truth and the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O our people! Verily, we have heard a Book sent down after Musa, confirming what came before it, it guides to the truth and to the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O our people! we have listened to a Book revealed after Musa verifying that which is before it, guiding to the truth and to a right path:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Our people, we have heard a Book that was sent down after Moses, confirming what was before it, guiding to the truth and to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O our people! Lo! we have heard a scripture which hath been revealed after Moses, confirming that which was before it, guiding unto the truth and a right road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O our people, we have heard a Book, which has been sent down after Moses, fulfilling the predictions existing in previous scriptures; it guides to the truth, and to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O our people! verily we have hearkened Unto a Book sent down after Musa, confirming that which was before it, guiding Unto the truth and a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O our people! Indeed, we have heard a Book, which has been sent down after Moses, confirming what was before it. It guides to the truth and to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O our people! We have heard a Book revealed after Moses, confirming what came before it: it guides (men) to the Truth and to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O our people! Verily! We have heard a Book (this Quran) sent down after Musa (Moses), confirming what came before it, it guides to the truth and to a Straight Path (i.e. Islam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our nation' they said: 'we have just been listening to a Book sent down after Moses confirming what came before it and guiding to the truth and to aStraight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O our people, we have heard a Scripture, sent down after Moses, confirming what came before it. It guides to the truth, and to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O our people, indeed we have heard a [recited] Book revealed after Moses confirming what was before it which guides to the truth and to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:30] They said, ‘O our people! Indeed we have heard a Book, namely, the Qur’ān, which has been revealed after Moses, confirming what was before it, what preceded it, such as the Torah. It guides to the truth, submission [to God] (islām), and to a straight way, that is, the way thereto [to Islam].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَى مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَى طَرِيقٍ مُسْتَقِيمٍ (30(فقالوا : إنا سمعنا قرآناً عجباً» . وفي «الصحيح» عن ابن مسعود «افتقدْنا النبي صلى الله عليه وسلم ذات ليلة وهو بمكة فقلنا ما فَعل به اغتيل أو واستطيرَ فبتنا بشرِّ ليلة حتى إذا أصبحنا إذا نحن به من قِبَل حِراء فقال \" أتاني دَاعي الجن فأتيتهم فقرأت عليهم القرآن \"وأيًّا مَّا كان فهذا الحادث خارق عادة وهو معجزة للنبيء صلى الله عليه وسلم وقد تقدم قوله تعالى : { يا معشر الجن والإنس ألم يأتكم رسل منكم يقصون عليكم آياتي } في سورة الأنعام ( 130 ( .والصرف : البعث . والنفر : عدد من الناس دون العشرين . وإطلاقه على الجن لتنزيلهم منزلة الإنس وبيانه بقوله : من الجن } .وجملة { يستمعون القرآن } في موضع الحال من الجن وحيث كانت الحال قيداً لعاملها وهو { صرفنا } كان التقدير : يستمعون منك إذا حضروا لديك فصار ذلك مؤديا مؤدَّى المفعول لأجله .فالمعنى : صرفناهم إليك ليستمعوا القرآن .وضمير { حضروه } عائد إلى القرآن ، وتعدية فعل حضروا إلى ضمير القرآن تعدية مجازية لأنهم إنما حضروا قارىء القرآن وهو الرسول صلى الله عليه وسلم و { أنصتوا } أمر بتوجيه الأسماع إلى الكلام اهتماماً به لئلا يفوت منه شيء . وفي حديث جابر بن عبد الله في حجة الوداع أن النبي صلى الله عليه وسلم قال له : «استنصت الناس» ، أي قبل أن يبدأ في خطبته .وفي الحديث : \" إذا قلت لصاحبك يوم الجمعة أنْصِت والإمام يخطب فقد لغوت \" ، أي قالوا كلُّهم : أنصتوا ، كل واحد يقولها للبقية حرصاً على الوعي فنطق بها جميعهم .و { قُضِي } مِبني للنائب . والضمير للقرآن بتقدير مضاف ، أي قضيت قراءته ، أي انتهى النبي صلى الله عليه وسلم من القراءة حين حضروا وبانتهائه من القراءة تمّ مراد الله من صرف الجن ليستمعوا القرآن ف ( ولَّوا ( ، أي انصرفوا من مكان الاستماع ورجعوا إلى حيث يكون جنسهم وهو المعبر عنه ب { قومهم } على طريقة المجاز ، نزل منزلة الإنس لأجل هذه الحالة الشبيهة بحالة الناس ، فإطلاق القوم على أمة الجن نظير إطلاق النفر على الفريق من الجن المصروف إلى سماع القرآن .والمنذر : المخبر بخبر مخيف .ومعنى { ولوا إلى قومهم منذرين } رجعوا إلى بني جنسهم بعد أن كانوا في حضرة النبي صلى الله عليه وسلم يتسمعون القرآن فأبلغوهم ما سمعوا من القرآن مما فيه التخويف من بأس الله تعالى لمن لا يؤمن بالقرآن . والتبشير لمن عمِل بما جاء به القرآن . ولا شك أن الله يسّر لهم حضورهم لقراءة سورة جامعة لما جاء به القرآن كفاتحة الكتاب وسورة الإخلاص . وجملة { قالوا يا قومنا } إلى آخرها مبينة لقوله : { منذرين } . وحكاية تخاطب الجن بهذا الكلام الذي هو من كلام عربي حكاية بالمعنى إذ لا يعرف أن للجن معرفة بكلام الإنس ، وكذلك فعل { قالوا } مجاز عن الإفادة ، أي أفادوا جنسهم بما فهموا منه بطرق الاستفادة عندهم معانيَ ما حكي بالقول في هذه الآية كما في قوله تعالى : { قالت نملة يأيها النمل ادخلوا مساكنكم } \\[ النمل : 18 \\] . وابتدأوا إفادتهم بأنهم سمعوا كتاباً تمهيداً للغرض من الموعظة بذكر الكتاب ووصفه ليستشرفَ المخاطبون لما بعد ذلك .ووصْف الكتاب بأنه { أنزل من بعد موسى } دون : أنزل على محمد صلى الله عليه وسلم لأن «التوراة» آخر كتاب من كتب الشرائع نزل قبل القرآن ، وأما ما جاء بعده فكتب مكملة للتوراة ومبينة لها مثل «زبور داود» و«إنجيل عيسى» ، فكأنه لم ينزل شيء جديد بعد «التوراة» فلما نَزل القرآن جاء بهدي مستقل غير مقصود منه بيان التوراة ولكنه مصدق للتوراة وهادٍ إلى أزيد مما هدت إليه «التوراة» .و { ما بين يديه } : ما سبقه من الأديان الحق . ومعنى { يهدي إلى الحق } : يهدي إلى الاعتقاد الحق ضد الباطل من التوحيد وما يجب لله تعالى من الصفات وما يستحيل وصفه به .والمراد بالطريق المستقيم : ما يسلك من الأعمال والمعاملة . وما يترتب على ذلك من الجزاء ، شبه ذلك بالطريق المستقيم الذي لا يضل سالكه عن القصد من سيره . ويجوز أن يراد ب { الحق } ما يشمل الاعتقاد والأعمال الصالحة ويراد بالطريق المستقيم الدلائل الدالة على الحق وتزييف الباطل فإنها كالصراط المستقيم في إبلاغ متبعها إلى معرفة الحق .\n\n",
      "translations": [
        {
          "translation": "(They said: our people! Lo! we have heard a Scripture) we have heard the recitation of a Scripture, meaning the Qur'an (which hath been revealed) to Muhammad (pbuh) (after Moses, confirming that which was before it) confirming the message of Allah's divine Oneness and the attribute and description of Muhammad (pbuh) found in the Torah, because they believers in Moses, (guiding unto the Truth and a right road) guiding to a true, established religion with which Allah is pleased, i.e. Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قالوا يا قومنا إنّا سمعنا كتاباً أنزل من بعد موسى } أي: ما تأثرنا بمثل هذا التأثر النوري في الوجود المحمدي إلا في زمن موسى ومن بعده إلى هذا الزمان ما تلقينا هذا المعنى لان عيسى عليه السلام ما تم معراجه وما بلغ حاله حال النبيين المذكورين\n موسى ومحمد\n في الانخراط في سلك القدس في حياته ومشايعة جميع قواه لسرّه وما كمل فناؤه ليتحقق جميع قواه بالوجود الحقاني ولذلك بقي في السماء الرابعة واحتجب فيها بخلافهما وسيتبع الملة المحمدية بعد النزول ليتم حاله { مصدّقاً لما بين يديه } لكونه مطابقاً له في الهداية إلى التوحيد والاستقامة كما أشير إليه بقوله: { يهدي إلى الحق وإلى طريق مستقيم }\n { يا قومنا أجيبوا داعي الله } بمطاوعة القلب في التوجه إلى الله والتأدّب بآدابه والاستسلام لأحكامه والانقياد لأوامره ونواهيه في طاعته { وآمنوا به } بالتنوّر بنوره والانخراط في سلك عبادته { يغفر لكم من ذنوبكم } الهيئات الرذائل والميل إلى الجهات السفلية بمتابعة الهوى وحجب الصفات النفسانية دون التعلقات البدنية والشواغل الطبيعية لامتناع تجريدها عن المادة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ: { قَالُواْ } أي: النفر المستمعون مبشرين لقومهم: { يٰقَوْمَنَآ إِنَّا سَمِعْنَا كِتَاباً } عجيباً سماوياً\n وعربياً نظماً وأسلوباً { أُنزِلَ مِن بَعْدِ مُوسَىٰ مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ } أي: جميع الكتب السالفة السماوية شأنه أنه { يَهْدِيۤ إِلَى } توحيد { ٱلْحَقِّ وَإِلَىٰ طَرِيقٍ مُّسْتَقِيمٍ } [الأحقاف: 30] موصل إليه بلا عوج وانحراف\n وهذا الكتاب العجيب الشأن\n الجلي البرهان\n منزل إلى داع من العرب اسمه محمد صلى الله عليه وسلم يدعو قاطبة الأنام إلى دين الإسلام بوحي الله العليم العلام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "86:1",
      "similarity": 0.7440381557972973
    },
    {
      "verse": "4:168",
      "similarity": 0.7260838336600878
    },
    {
      "verse": "86:2",
      "similarity": 0.6588276827975227
    },
    {
      "verse": "20:104",
      "similarity": 0.6237603338523146
    },
    {
      "verse": "20:63",
      "similarity": 0.6056848080674486
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}