{
  "chapter": "الأحقاف",
  "text": "ما خلقنا السموت والارض وما بينهما الا بالحق واجل مسمى والذين كفروا۟ عما انذروا۟ معرضون",
  "translations": [
    {
      "translation": "We have not created the heavens and earth and everything between them except with truth and for a set term. But those who are kafir turn away from what they have been warned about.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and the earth and all that lies between them but with a purpose for an appointed time. Yet the unbelievers turn away from the warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created the heavens and the earth and all that is between them in Truth and for an appointed term. But those who disbelieve have turned away from what they were warned against.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created the heavens and the earth and all that is between them ONLY for a genuine purpose and an appointed time. The unbelievers ignore that of which they have been warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth and all that is between them except with the truth, and for a fixed term; and the disbelievers have turned away from what they are warned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all that is between them except with truth, and for a specified term. But those who disbelieve, turn away from that whereof they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth and what is between them two save with truth and (for) an appointed term; and those who disbelieve turn aside from what they are warned of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and the earth, and what between them is, save with the truth and a stated term; but the unbelievers are turning away from that they were warned of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all that is between them save with truth, and for a term appointed. But those who disbelieve turn away from that whereof they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created the heavens and the earth and all that lies between them purely for just ends, and for a specific term, but those who reject Faith turn away from what they have been warned of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and whatsoever is in-between the twain save with truth, and for a term stated. And those who disbelieve are from that whereof they are warned backsliders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth and whatever is between them except with consummate wisdom and for a specified term. Yet the faithless are disregardful of what they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all between them but for just ends, and for a Term Appointed: But those who reject Faith turn away from that whereof they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all that is between them except with truth, and for an appointed term. But those who disbelieve turn away from that whereof they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was in truth that We created the heavens and the earth, and all that is between them, for an appointed term. Yet the unbelievers do not turn away from that which they were warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth and what lies between them except with reason, and for a finite period. But the blasphemers continue to ignore the warnings they receive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and earth and what is between them except in truth and [for] a specified term. But those who disbelieve, from that of which they are warned, are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:3] We have not created the heavens and the earth and all that is between them except, as a creation, in truth, so that it may be an indication of Our power and Our Oneness, and for an appointed term, until [the point of] their annihilation on the Day of Resurrection. Yet those who disbelieve are disregardful of what they are warned, [of what] they are threatened with in the way of [impending] chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We created not the heavens and the earth and all that is between them) of creation and marvels (save with truth) save for the Truth, (and for a term appointed) to which everything proceeds. (But those who disbelieve) the disbelievers of Mecca (turn away from that whereof they are warned) disbelieve in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ما خَلَقنا السَّموات والأرض وما بَيْنَهما إلاَّ بالحق } أي: بالوجود المطلق الثابت الأحدي الصمدي الذي يتقوّم به كل شيء\n أو بالعدل الذي هو ظل الوحدة المنتظم به كل كثرة\n كما قال: بالعدل قامت السماوات والأرض\n { و } بتقدير { أجلٍ مسمَّى } أي: كمال معين ينتهي به كمال الوجود وهو القيامة الكبرى بظهور المهدي وبروز الواحد القهار بالوجود الأحدي الذي يفنى عنده كل شيء كما كان في الأزل { والذينَ كَفَروا } بالاحتجاب عن الحق { عمَّا أنذروا } من أمر هذه القيامة { معرضون }\n { قل أرأيتم ما تَدعون من دُون الله } تسمونه وتثبتون له وجوداً وتأثير أي شيء كان { أرُوني } ما تأثيره في شيء أرضي بالاستقلال أو شيء سماويّ بالشركة { ائتوني } على ذلك بدليل نقليّ من كتاب سابق أو عقلي من علم متقن { إن كنتم صادقين } ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم التفت سحبانه تهويلاً وتفخيماً لحكمه فقال: { مَا خَلَقْنَا } وأظهرنا من كتم العدم { ٱلسَّمَٰوَٰتِ } أي: آثار الأسماء والصفات الذاتية { وَٱلأَرْضَ } أي: عالم الاستعدادات القابلة لانعكاس أشعة أنواع الذات الفائضة عليها حسب الشئون والتطورات الجمالية والجلالية { وَمَا بَيْنَهُمَآ } من الآثار المتراكمة من امتزاج الفواعل الأسمائية من الآثار الناشئة من قوابل المسميات والهيولي { إِلاَّ بِٱلْحَقِّ } أي: خلقاً ملتبساً بالصدق المطابق للواقع { وَ } قدرنا بقاء ظهورها إلى { أَجَلٍ مُّسَمًّى } أي: وقت مقدر عندنا\n محفوظ في خزانة حضرة علمنا ولوح قضائنا لا نطلع أحداً عليه\n فإذا جاء الأجل المسمى انعدم الكل بلا تقدم وتأخر { وَٱلَّذِينَ كَفَرُواْ } وأنكر كمال قدرتنا واقتدارنا على إيجاد الأشياء وإعدامها وإبدائها وإعادتها { عَمَّآ أُنذِرُواْ } من أهوال يوم القيامة المعدة لانعدام الكل وانقهار الأظلال الهالكة في شروق شمس الذات { مُعْرِضُونَ } [الأحقاف: 3] لذلك لا يترددون له\n ولا يتهيئون أسبابه\n ولا يستعدون لحلوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما خلقنا السماواتِ والأرض وما بينهما } من المخلوقات { إِلا بالحق } أي: إلا ملتبساً بالحق الذي تقتضيه الحكمة التكوينية والتشريعية\n فالاستثناء مفرغ من أعم المفاعيل\n أو من أعم الأحوال\n أي: ما خلقناهما في حال من الأحوال إلا حال ملابستنا بالحق\n وفيه من الدلالة على وجود الصانع\n وصفات كماله\n وابتناء أفعاله على حكمة بالغة\n ما لا يخفى\n { وأجل مُسمىً } تنتهي إليه\n وهو يوم القيامة\n يوم تُبدل الأرض غير الأرض والسموات\n { والذين كفروا عما أُنذروا } به من هول ذلك اليوم\n الذي لا بُد لكل مخلوق من الانتهاء إليه\n { مُعرِضُون } لا يؤمنون به\n ولا يهتمُّون بالاستعداد له\n ويجوز أن تكون \" ما \" مصدرية\n أي: عن إنذارهم ذلك اليوم معرضون\n وحاصل افتتاح السورة: أنّ الوحي الخاص إلى محمد هو منزل من الله العزيز\n الذي عَزَّ عن الافتراء عليه\n وأعزَّ بالوحي مَن تمسّك به\n الحكيم في تنزيله وحيه\n مرشداً لعباده لِمَا فيه صلاحهم وهداهم\n ومن حكمته: أنّ خلق السموات والأرض دالاًّ بذلك على توحيده\n وكماله في أوصافه وتدابيره\n المقتضية لترتُّب دار الجزاء على دار العمل\n بحيث لا يُسَوِّي بين مبطل ومحق\n فأرشد بخلق الأشياء إلى حكمته دلالة\n ثم بإنزال الوحي بذلك قالة\n ومع وضوح الأمر في دلالتهما أعرض الذين كفروا من غير دليل عقلي ولا نقلي متواتر ولا آحاد\n على أنَّ ما اقتضاه الوحي إلى محمد من التوحيد\n والجزاء المرتب على الإخلاص له\n والصدق في عبودية الله\n والدعاء إلى محاسن الأخلاق\n مما اجتمعت عليه الرسل قبله\n فليس بمدع مِن عنده\n هـ\n من الحاشية\n الإشارة: { حمۤ } يا حبيب ممجد\n قد مجدناك بإنزال كتابنا\n وعززناك برسالتنا\n ما خلقنا الكائنات إلا ملتبسة بأسرار الحق\n وأهل الغفلة معرضون عن هذا\n قال القشيري: حَمَيْتُ قلوبَ أهل عنايتي\n فصرفتُ عنها خواطر التجويز\n ورميتها في مشاهد اليقين بنور التحقيق\n فيها شواهد برهانهم\n أي: برهان العيان - فأضفنا إليها لطائف إحساننا\n فكملت مَنالها من عين الوصلة\n وغديناهم بنسيم الأنس في ساحات القربة\n { العزيز } المعز للمؤمنين بإنزال الكتب\n { الحكيم } لكتابه عن التبديل والتحويل\n هـ\n وخواطر التجويز هي خواطر الشك في المقدور\n يجوز الوقوع وعدمه بسبب ضعف اليقين\n فإذا انتفى عن القلب خواطر التجويز\n دخله السكون والطمأنينة\n وارتاح في ظل برد الرضا والتسليم\n والله تعالى أعلم\n ثم وبَّخهم على الشرك بعد ظهور بطلانه\n فقال: { قُلْ أَرَأَيْتُمْ مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:12",
      "similarity": 0.448491994949836
    },
    {
      "verse": "30:8",
      "similarity": 0.431079848810439
    },
    {
      "verse": "41:4",
      "similarity": 0.40578323575922653
    },
    {
      "verse": "6:4",
      "similarity": 0.40378284414681276
    },
    {
      "verse": "36:46",
      "similarity": 0.40378284414681276
    }
  ]
}