{
  "chapter": "الأحقاف",
  "text": "اولم يروا۟ ان الله الذى خلق السموت والارض ولم يعى بخلقهن بقدر على ان يحى الموتى بلى انه على كل شىء قدير",
  "translations": [
    {
      "translation": "Do they not see that Allah - He who created the heavens and the earth and was not wearied by creating them - has the power to bring the dead to life? Yes indeed! He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not realise that God who created the heavens and the earth, and did not tire creating them, is able to bring the dead to life? And why not? He has the power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, Who created the heavens and the earth -- and creating them did not wear Him out -- has the power to bring the dead back to life? Why not! He certainly has the power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that God has created the heavens and the earth and that He experienced no fatigue in doing this. He has the power to bring the dead back to life. Certainly He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not realised that Allah, Who did not tire in creating the heavens and the earth and in creating them, is Able to revive the dead? Surely yes, why not? Indeed He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead Yes, He surely is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered that Allah, Who created the heavens and the earth and was not tired by their creation, is able to give life to the dead? Aye! He has surely power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not seen that God who created the heavens and earth, not being wearied by creating them, is able to give life to the dead? Yes indeed; He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead? Aye, He verily is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that God, who created the heavens and the earth and was not wearied by their creation, has the power to bring the dead back to life? Yes, indeed, He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink they not that Allah Who created the heavens and the earth and was not fatigued with the creation thereof, is able to quicken the dead? Aye! verily He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, who created the heavens and the earth and [who] was not exhausted by their creation, is able to revive the dead? Yes, indeed He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that Allah, Who created the heavens and the earth, and never wearied with their creation, is able to give life to the dead? Yea, verily He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead? Yes, He surely is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that it is Allah who created the heavens and the earth and was not wearied by their creation, and that He is Able to restore the dead tolife? Yes, He has power over all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not realize that God, who created the heavens and the earth, and was never tired by creating them, is Able to revive the dead? Yes indeed; He is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, who created the heavens and earth and did not fail in their creation, is able to give life to the dead? Yes. Indeed, He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:33] Have they not seen, [have they not] realised, that is, the deniers of resurrection, that God, Who created the heavens and the earth and [Who] was not wearied by their creation, [Who] did not fail therein, is able to give life to the dead? (bi-qādirin is the predicate of anna, ‘that’, the bi- having been added to it because the statement has the same force as [the construction]: a-laysa’Llāhu bi-qādirin, ‘Is God not able …?’). Yes, indeed, He is able to give life to the dead. Indeed He has is able to do all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقَادِرٍ عَلَى أَنْ يُحْيِيَ الْمَوْتَى بَلَى إِنَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (33(عود إلى الاستدلال على إمكان البعث فهو متصل بقوله : { والذي قال لوالديه أفَ لكما أتَعِدَانِني أن أُخرج وقد خلت القرون من قبلي إلى قوله : { أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين } \\[ الأحقاف : 17 ، 18 \\] فهو انتقال من الموعظة بمصير أمثالهم من الأمم إلى الاستدلال على إبطال ضلالهم في شركهم وهو الضلال الذي جرّأهم على إحالة البعث ، بعد أن أطيل في إبطال تعدد الآلهة وفي إبطال تكذيبهم بالقرآن وتكذيبهم النبي صلى الله عليه وسلم وهذا عود على بدء فقد ابتدئت السورة بالاحتجاج على البعث بقوله تعالى : { ما خلقنا السماوات والأرض وما بينهما إلا بالحق } \\[ الأحقاف : 3 \\] الآية ويتصل بقوله : { والذي قال لوالديه أفَ لكما أتِعَدَانني أن أخرج إلى قوله : أساطير الأولين } \\[ الأحقاف : 17 \\] .والواو عاطفة جملة الاستفهام ، وهو استفهام إنكاري ، والرؤية عِلمية . واختير هذا الفعل من بين أفعال العلم هنا لأن هذا العلم عليه حجة بينة مشاهدة ، وهي دلالة خلق السماوات والأرض من عدم ، وذلك من شأنه أن يفرض بالعقل إلى أن الله كامل القدرة على ما هو دون ذلك من إحياء الأموات .ووقعت { أنّ } مع اسمها وخبرها سادّة مسدّ مفعولي { يروا } . ودخلت الباء الزائدة على خبر { أنّ } وهو مثبت وموكَّد ، وشأن الباء الزائدة أن تدخل على الخبر المنفي ، لأن { أن } وقعت في خبر المنفي وهو { أولم يروا } .ووقع { بلى } جواباً عن الاستفهام الإنكاري . ولا يريبك في هذا ما شاع على ألسنة المعربين أن الاستفهام الإنكاري في تأويل النفي ، وهو هنا اتصل بفعل منفي ب ( لم ( فيصير نفي النفي إثباتاً ، فكان الشأن أن يكون جوابه بحرف ( نعم ( دون { بلى } ، لأن كلام المعربين أرادوا به أنه في قوة منفي عند المستفهم به ، ولم يريدوا أنه يعامل معاملة النفي في الأحكام . وكون الشيء بمعنى شيء لا يقتضي أن يعطَى جميع أحكامه .ومحل التعجيب هو خبر { أنّ } وأما ما قبله فالمشركون لا ينكرونه فلا تعجيب في شأنه . ووقوع الباء في خبر { أنّ } وهو { بقادر } باعتبار أنه في حيّز النفي لأن العامل فيه وهو حرف { أنّ } وقع في موضع مفعولي فِعل { يروا } الذي هو منفي فسرى النفي للعامل ومعموله ، فقرن بالباء لأجل ذلك ، وفي «الكشاف» «قال الزجاج لو قلت : ما ظننت أن زيداً بقائم جاز ، كأنه قيل : أليس الله بقادر» اه . وقال أبو عبيدة والأخفش : الباء زائدة للتوكيد كالباء في قوله : { وكفى بالله شهيداً } \\[ النساء : 79 \\] يريدان أنها زائدة في الإثبات على وجه الندور .وأما موقع الجواب بحرف { بلى } فهو جواب لمحذوف دل عليه التعجيب من ظنهم أن الله غيرُ قادر على أن يحيي الموتى ، فإن ذلك يتضمن حكاية عنهم أن الله لا يحيي الموتى ، فأجيب بقوله : { بلى } تعليماً للمسلمين وتلقيناً لما يجيبونهم به .وحرف { بلى } لما كان جواباً كان قائماً مقام جملة تقديرها : هو قادر على أن يحيي الموتى .وجملة { ولم يَعْيَ بخلقهن } عطف على جملة { الذي خلق السماوات والأرض } . وقوله : { لم يعييَ } مضارع عَيِيَ من باب رضي ، ومصدره العِيّ بكسر العين وهو العجز عن العمل أو عن الكلام ، ومنه العيّ في الكلام ، أي عسر الإبَانِة . وتعديته بالباء هنا بلاغة ليفيد انتفاء عجزه عن صنعها وانتفاء عجزه في تدبير مقاديرها ومناسباتها ، فكانت باء الملابسة صالحة لتعليق الخلق بالعي بمعنييه .وكثير من أيمة اللغة يرون أن العِيّ يطلق على التعب وعن عجز الرأي وعجز الحيلة . وعن الكسائي والأصمعي : العِيُّ خاص بالعجز في الحيلة والرأي . وأما الإعياء فهو التعب من المشي ونحوه ، وفعله أعيا ، وهذا ما درج عليه الراغب وصاحب «القاموس» .وظاهر الأساس : أن أعيا لا يكون إلا متعدياً ، أي همزته همزة تعدية فهذا قول ثالث .وزعم أبو حيان أن مثله مقصور على السماع . قلت : وهو راجع إلى تنازع العاملين .وعلى هذا الرأي يكون قوله تعالى هنا { ولم يَعْي } دالاً على سَعة علمه تعالى بدقائق ما يقتضيه نظام السماوات والأرض ليوجدهما وافيين به . وتكون دلالته على أنه قدير على إيجادهما بدلالة الفحوى أو يكون إيكال أمر قدرته على خلقهما إلى علم المخاطبين ، لأنهم لم ينكروا ذلك ، وإنما قصد تنبيههم إلى ما في نظام خلقهما من الدقائق والحِكم ومن جملتها لزوم الجزاء على عمل الصالحات والسيئات . وعليه أيضاً تكون تعدية فعل { يَعْيَ } بالباء متعينة .وقرأ الجمهور { بقادر } بالموحدة بصيغة اسم الفاعل . وقرأه يعقوب { يقدر } بتحتية في أوله على أنه مضارع من القدرة ، وتكون جملة { يقدر } في محل خبر { أنَّ } .وجملة { إنه على كل شيء قدير } تذييل لجملة { بلى } لأن هذه تفيد القدرة على خلق السماوات والأرض وإحياء الموتى وغير ذلك من الموجودات الخارجة عن السماوات والأرض . وتأكيد الكلام بحرف ( أنَّ ( لرد إنكارهم أن يمكن إحياء الله الموتى ، لأنهم لما أحالوا ذلك فقد أنكروا عموم قدرته تعالى على كل شيء .ولهذه النكتة جيء في القدرة على إحياء الموتى بوصف { قادر } ، وفي القدرة على كل شيء بوصف { قدير } الذي هو أكثر دلالة على القدرة من وصف { قادر } .\n\n",
      "translations": [
        {
          "translation": "(Have they not seen) do the disbelievers of Mecca not know (that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead) for the resurrection? (Aye, He verily is Able to do all things) of giving life and inflicting death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ يَعْيَ بِخَلْقِهِنَّ } معناه لم يَجهَلْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He has not been unaware of the creation of {the women}\" means that He has not been ignorant.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى توبيخ منكري الحشر والنشر وإعادة الموتى أحياء وتقريعهم\n فقال مستفهماً على سبيل التبكيت والإلزام: { أَوَلَمْ يَرَوْاْ } يعني: أيشكون ويترددون أولئك الشاكون المترددون في قدرة الله على إعادة المعدوم ونشر الأموات أحياء من قبورهم وحشرهم إلى المحشر للحساب والجزاء\n ولم يعلموا { أَنَّ ٱللَّهَ } العليم الحكيم القادر المقتدر { ٱلَّذِي خَلَقَ } أظهر وأوجد { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: العلويات السفليات خلقاً إبداعياً من كتم العدم { وَ } مع ذلك { لَمْ يَعْيَ بِخَلْقِهِنَّ } أي: لم يفتر ولم يضعف بإظهارهن ابتداء مع غاية عظمتهن وسعتهن { بِقَادِرٍ } يعني: أليس القادر المقتدر على الإبداع والإبداء بقادر { عَلَىٰ أَن يُحْيِـيَ ٱلْمَوْتَىٰ } ويعيدهم أحياء بعدما أماتهم { بَلَىٰ } أنه سبحانه { عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة علمه وإرادته { قَدِيرٌ } [الأحقاف: 33] بلا فتور ولا قصور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ولم يَعْيَ } حال من فاعل \" خلق \" \n يُقال: عَي\n كرضَى\n وَعِيَ بالإدغام\n وهو أكثر\n قاله في الصحاح\n وفي القاموس: عَيَّ بالأمر وعَيِيَ كرَضِيَى\n وتَعايا واسْتَعيا وتَعَيَّا: لم يهتدِ لوجه مُراده\n أو عَجَزَ عنه ولم يُطِقْ إحْكَامه\n هـ\n و { بقادر } خبر \" أن \" \n ودخلت الباء لاشتمال النفي الذي في صدر الآية على \" أنّ \" وما في حيّزها\n قال الزجاج: لو قلت: ما ظنت أنَّ زيداً بقائم\n جاز\n يقول الحق جلّ جلاله: { أَوَ لَمْ يَرَوا } أي: ألم يتكّفروا ولم يعلموا علماً جازماً { أنَّ الله الذي خلق السماوات والأرض } ابتداء من غير مثال يحتويه\n ولا قانون يحتذيه\n { و } الحال أنه { لم يَعْيَ بخلقهن } أي: لم يتعب ولم ينصب بذلك أصلاً\n ولم يعجز عنه\n أليس مَن فعل ذلك { بقادرٍ على أن يحيي الموتى بلى } جواب النفي\n أي: بلى هو قادر على ذلك\n { إِنه على كل شيء قديرٌ } تقرير للقدرة على وجه عام\n ليكون كالبرهان على المقصود\n ثم ذكر عقاب مَن أنكر البعث المبرهن عليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:15",
      "similarity": 0.7987513716538267
    },
    {
      "verse": "36:81",
      "similarity": 0.20280914847552728
    },
    {
      "verse": "40:50",
      "similarity": 0.15363123039151758
    },
    {
      "verse": "67:9",
      "similarity": 0.14320353943566072
    },
    {
      "verse": "84:15",
      "similarity": 0.14293833339388332
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}