{
  "chapter": "الأحقاف",
  "text": "فاصبر كما صبر او۟لوا۟ العزم من الرسل ولا تستعجل لهم كانهم يوم يرون ما يوعدون لم يلبثوا۟ الا ساعة من نهارۭ بلغ فهل يهلك الا القوم الفسقون",
  "translations": [
    {
      "translation": "So be steadfast as the Messengers with firm resolve were also steadfast. And do not seek to hasten it for them. On the Day they see what they were promised, it will be as if they had only tarried for just one hour of a single day. It has been transmitted! Will any be destroyed except for deviant people?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear with patience, as the apostles who were constant, bore; and do not be hasty (in demanding punishment) for them. On the day they see what they had been foretold, (they will realise) that they did not stay in the world but only an hour of the day. This is the message to be conveyed: Shall any perish but the ungodly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear with patience, (O Prophet), even as the Messengers endowed with firmness of resolve (before you) bore with patience, and do not be hasty in their regard. The Day when they see what they had been warned against they will feel as though they had remained in the world no more than an hour of a day. (The Truth has been conveyed.) Will any, then, suffer perdition except those who disobey?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), exercise patience as did the steadfast Messengers. Do not try to make them suffer the torment immediately; on the day when they will see the torment with which they were threatened, they will think that they had lived no more than an hour. The message has been delivered. No one else will be destroyed except the evil doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore patiently endure (O dear Prophet Mohammed – peace and blessings be upon him) like the courageous Noble Messengers had endured, and do not be impatient for them; on the day when they see what they are promised, it will be as if they had not stayed on earth except part of a day; this is to be conveyed; will anyone be destroyed, except the disobedient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be patient as did those of determination among the Messengers and be in no hurry for them. On the Day when they will see what they are promised, it will be as though they had not remained (in the world) except an hour in a day. (This is) a clear Message. But will any be destroyed except the defiantly rebellious people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore bear up patiently as did the apostles endowed with constancy bear up with patience and do not seek to hasten for them (their doom). On the day that they shall see what they are promised they shall be as if they had not tarried save an hour of the day. A sufficient exposition! Shall then any be destroyed save the transgressing people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be thou patient, as the Messengers possessed of constancy were also patient. Seek not to hasten it for them -- it shall be as if on the day they see that they are promised, they had not tarried but for an hour of a single day. A Message to be delivered! And shall any be destroyed but the people of the ungodly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then have patience (O Muhammad) even as the stout of heart among the messengers (of old) had patience, and seek not to hasten on (the doom) for them. On the day when they see that which they are promised (it will seem to them) as though they had tarried but an hour of daylight. A clear message. Shall any be destroyed save evil-living folk?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have patience, then, as had the steadfast Messengers before you; and be in no haste about them. On the Day when they see what they are threatened with, it will appear to them as though they had not tarried longer than an hour of a day. [Your responsibility is] to deliver the message: and none but the disobedient shall be destroyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear thou then with patience even as the apostles, endued with resolution bear with patience, and seek not to hasten on for them. On the Day whereon they will behold that wherewith they are threatened, it will seem to them as though they had tarried but an hour of the day. A proclamation this: so none will be destroyed save the nation of transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient just as the resolute among the apostles were patient, and do not seek to hasten [the punishment] for them. The day when they see what they are promised, [it will be] as though they had remained [in the world] only an hour of a day. This is a proclamation. So shall anyone be destroyed except the transgressing lot?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore patiently persevere, as did (all) messengers of inflexible purpose; and be in no haste about the (Unbelievers). On the Day that they see the (Punishment) promised them, (it will be) as if they had not tarried more than an hour in a single day. (Thine but) to proclaim the Message: but shall any be destroyed except those who transgress?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be patient (O Muhammad SAW) as did the Messengers of strong will and be in no haste about them (disbelievers). On the Day when they will see that (torment) with which they are promised (i.e. threatened, it will be) as if they had not stayed more than an hour in a single day. (O mankind! This Quran is sufficient as) a clear Message (or proclamation to save yourself from destruction). But shall any be destroyed except the people who are Al-Fasiqun (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient, as the Messengers of might were patient, and do not hasten it for them. On the Day when they see what they have been promised, it will be as if they did not stay except an hour of a day. (This Koran is) a Conveyance! Shall any be destroyed except the nation of evildoers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient, as the messengers with resolve were patient, and do not be hasty regarding them. On the Day when they witness what they are promised, it will seem as if they had lasted only for an hour of a day. A proclamation: Will any be destroyed except the sinful people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient, [O Muhammad], as were those of determination among the messengers and do not be impatient for them. It will be - on the Day they see that which they are promised - as though they had not remained [in the world] except an hour of a day. [This is] notification. And will [any] be destroyed except the defiantly disobedient people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:35] So endure [with patience], the harm done [to you] by your people, just as the resolute, those of constancy and [power of] endurance during hardships, from among the messengers endured [with patience], before you, so that you may be one of resolve [like them] (min [of mina’l-rusuli] is explicative, as all of them were men of resolve; but some say that this [particle min] is [actually] meant to be partitive, since excluded from their number are: Adam, on the basis of God’s saying, exalted be He: And We did not find in him any constancy [Q. 20:115]; and Jonah, on the basis of His words: And do not be like the One of the fish [Q. 68:48]). And do not seek to hasten [it] for them, for your people, the sending down of the chastisement on them. Some say that he [the Prophet] seemed [by this stage] to have become exasperated because of them and desired that chastisement be sent down on them, which is why he was enjoined to [exercise] patience and to refrain from hastening the chastisement [for them] — for it would befall them [eventually] without   doubt. It shall seem for them, on the day when they see what they are promised, of chastisement in the Hereafter, given its long duration, as though they had tarried, in this world, by their reckoning, only an hour of a day. This Qur’ān is, a communication, a proclamation from God to you. So shall any be destroyed, that is to say, none [shall be destroyed] upon seeing the chastisement, but the immoral folk?, that is to say, the disbelieving [folk]. Medinese, except for verse 13, or [it is all] Meccan; it consists of 38 or 39 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then have patience) Muhammad in the face of the disbelievers' harm (even as the stout of heart) as those possessed of certainty and resolve (among the messengers (of old)) such as Noah, Abraham, Moses and Jesus; it is also said that this means: such as those possessed of toughness and patience like Noah, Job, Zachariah and John (had patience, and seek not to hasten on the doom for them. On the day when they see that which they are promised) of doom ((it will seem to them) as though they had tarried) in the life of the world (but an hour of daylight. A clear message). And when the time of chastisement and destruction comes, (Shall any be destroyed) through such a chastisement (save evil-living folk) save the disbelievers, those who had denied and barred people from the way of Allah?' And of the surah in which Muhammad is mentioned which is all Meccan and was revealed about fighting: Surah 47: Muhammad And of the surah in which Muhammad is mentioned which is all Meccan and was revealed about fighting:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱصْبِرْ كَمَا صَبَرَ أُوْلُواْ ٱلْعَزْمِ مِنَ ٱلرُّسُلِ } معناه أُولوا العَزمِ أربعةٌ، نوحٌ، وإبراهيمُ، وهودٌ، ومحمدٌ عليهم السّلامُ\n وقيلَ كَانَ لُوطٌ، وشُعيبُ، وهودٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So be patient, [O Muhammad], as were those of determination among the messengers} [means that] the people of determination are four: Noah, Abraham, Moses, and Muhammad - upon them be peace.\n\n\nIt is said that Lut, Shu'ayb, and Hud were",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعت يا أكمل الرسل مآل حال الكفرة المصرين على العتو والعناد { فَٱصْبِرْ } يا أكمل الرسل على تحمل أعباء الرسالة ومتاعب التبليغ وأذيات أصحاب الزيغ والضلال { كَمَا صَبَرَ } عليها { أُوْلُواْ ٱلْعَزْمِ مِنَ ٱلرُّسُلِ } العازمين عليها وعلى تبليغها بالعزيمة الخالصة والثبات التام\n ليبينوا للناس طريق التوحيد ويرشدهم إلى سبيل الاستقامة والرشاد { وَلاَ تَسْتَعْجِل لَّهُمْ } أي: للمعاندين من قريش بحلول العذاب الموعود عليهم\n فإنه سينزل عليهم حتماً عند حلول وقته { كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ } من العذاب من نهاية شدته وهوله وغاية طوله\n تذكروا أنهم { لَمْ يَلْبَثُوۤاْ } في الدنيا { إِلاَّ سَاعَةً } واحدة { مِّن نَّهَارٍ } يعني: استقصروا مدة لبثهم في الدنيا وقاسوا بالنسبة إلى طول يوم القيامة بساعة بل أقصرها منها\n\n\nهذا الذي ذكر من المواعظ والتذكيرات في هذه السورة { بَلاَغٌ } كافٍ لأهل الهداية والإرشاد إلى أن اتعظوا بها\n ويتذكروا منها\n وإن لم يتعظوا بها\n هلكوا في تيه الجهل والغواية مثل سائر الهالكين { فَهَلْ يُهْلَكُ } وما يستأصل بالقهر الإلهي { إِلاَّ ٱلْقَوْمُ ٱلْفَاسِقُونَ } [الأحقاف: 35] الخارجون عن مقتضى الحدود الإلهية النازلة من عنده سبحانه على أنبيائه ورسله\n المبعوثين إلى الهداية والتكميل\n\n\nجعلنا الله ممن تذكر بما في كتابه من المواعظ والتذكير\n وامتثل بما فيه من الأوامر والنواهي\n\n\nخاتمة السورة\n\nعليك أيها العازم على سلوك طريق التوحيد: أن تقصد نحوه بالعزيمة الخالصة الصافية عن كدر الرياء ورعونات الهوى\n وتتصبر على مشاق التكاليف ومتاعب الطاعات والرياضاتت القالعة لمقتضيات القوى البشرية بجملتها ومشتهيات القوى البهيمية برمتها\n فلك أن تقتدي في سلوكك هذا أثر أولى العزائم من الرسل الكرام والأنبياء العظام والكمل من الأولياء الذين هم ورثة الأنبياء\n لتفوز بالدرجة القصوى والمرتبة العليا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { لهم } متعلق بتستعجل، وأما تعليقه ببلاغ فضعيف، لا يليق بإعجاز التنزيل، خلافاً لوقف الهبطي، { وبلاغ } خبر عن مضمر، أي: هذا بلاغ. يقول الحق جلّ جلاله: { فاصبر } يا محمد على ما يُصيبك من جهة الكفرة { كما صبر أُولوا العزم } أي: الثبات والحزم { من الرسل } فإنك مِن جملتهم، بل من أكملهم وأفضلهم، و \" من \" للتبعيض، واختلف في تعيينهم، فقيل: هم المذكورون في الأحزاب\n[الأحزاب: 7] وهم أهل الشرائع، الذين اجتهدوا في تأسيسها وتقريرها، وصبروا على تحمُّل مشاقها، وسياسة مَن تمسّك بها، ومعاداة الطاعنين فيها. وقيل: هم الصابرون على بلاء الله تعالى، كنوح صَبَر على إذاية قومه، كانوا يضربونه حتى يُغشى عليه، وإبراهيم صبر على النار، وذَبْحِِ ولده، ومفارقة وطنه، وترك ولده ببلد خالية من العمران، ويعقوب على فقد ولده، وذهَاب بصره، ويوسف على الجُب والسجن، وأيوب على الضُر، وموسى قال له قومه:\n[الشعراء: 61، 62] وعلى مكابدة التيه مع قومه، وداود بكى على خطيئته أربعين سنة، وعيسى لم يضع لبنة على لبنة. وقيل: هم اثنا عشر نبياً، أُرسلوا إلى بني إسرائيل، فعصوهم، فأوحى الله إلى الأنبياء: إني مرسل عذابي على عصاة بني إسرائيل، فشقَّ عليهم، فأوحى الله إليهم: أن اختاروا لأنفسكم، إن شئتم أنزلتُ بكم العذاب، وأنجيت بني إسرائيل، وإن شئتم أنجيتكم وأنزلت ببني إسرائيل، فتشاوروا بينهم، فاجتمع رأيهم على أن ينزل بهم العذاب ويُنجي بني إسرائيل، فسلّط عليهم ملوك الأرض، فمنهم مَن نُشر بالمناشير، ومنهم مَن سُلخ جلدة رأسه ووجهه، ومنهم مَن رُفع على الخشب، ومنهم مَن أُحرق بالنار. نسأل الله العافية، فإنهم أقوياء ونحن ضعفاء. وقيل: \" من \" للتبيين، كقولك: اشتريت ثياباً من الخز، فكلهم أولو العزم، وقيل: إلا يونس، لقوله:\n[القلم: 48] وآدم لقوله:\n[طه: 115] ثم قال تعالى: { ولا تستعجلْ لهم } أي: لكفار مكة نزول العذاب، فإنه نازل بهم، { كأنهم يوم يَرَوْن ما يُوعدون } من العذاب { لم يلبثوا } في الدنيا { إِلا ساعةً } يسيرة { من نهارٍ } لما يُشاهدونه من شدة العذاب وطول مدته. وقال الثعالبي: وإذا علمت أيها الأخ أن الدنيا أضغاث أحلام، كان من الحزم اشتغالك الآن بتحصيل الزاد للمعاد، وحفظ الحواس، ومراعاة الأنفاس، ومراقبة مولاك، فاتخذه صاحباً، ودعْ الناس جانباً، ثم نقل عن الغزالي ما يهيج النفس إلى النهوض إلى الله، والفرار مما سواه، فانظره. هذا { بلاغٌ } أي: هذا الذي وُعظتم به كفاية في الموعظة، أو تبليغ من الرسول، أو مني إليك، ومنك إلى العالمين.\n{ فهلْ يُهلك إِلا القوم الفاسقون } أي: ما يُهلك إلا الخارجون عن هذا الاتعاظ، أو عن هذه المواعظ، أو عن الطاعة، أو: فلا يهلك مع هذه المواعظ البالغة، والأدلة القاطعة إلا مَن هلك عن بينة، أو: فلا يهلك مع رحمة الله وتفضُّله إلا الهالكون، ونظير ما ختم به هنا ما ختم به سورة الأنبياء:\n[الأنبياء: 106] الآية. فائدة: قال ابن عباس: إذا عسر على المرأة ولدها، فليكتب هاتين الآيتين الكريمتين في صحيفة، ثم تغسل وجهها منها، وتُسقى منها: بسم الله الرحمن الرحيم، لا إله إلا الله، العظيم الحليم، سبحان الله رب السموات والأرض، ورب العرش العظيم، كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها، { كأنهم يوم يرون ما يُوعدون لم يلبثوا إلا ساعة من نهار } صدق الله العظيم. هـ. الإشارة: أولو العزم من الأولياء هم أولو الجد والتشمير، قد خلّصهم البلاء وشحّرهم، فهم جلاليون الظاهر، جماليون الباطن، قد أسّسوا منار الطريق، وأظهروا معالم التحقيق، قاسوا شدائد المجاهدة، وأفضوا إلى دوام المشاهدة، عالجوا سياسة الخلق، حتى هدى الله على أيديهم الجم الغفير، فهم خلفاء الرسل في تجديد الشرائع، وإحياء الدين، جعلنا الله منهم بمنِّه وكرمه. فيُقال لكل وليّ من أولي العزم: فاصبر كما صبر أولو العزم من الأولياء قبلك. قال القشيري: والصبرُ هو الوقوفُ لحكم الله تعالى، والثبات من غير بَثّ الاستكراه. هـ. أي: من غير إظهار الشكوى والتكرُّه. قلت: وأعظم مواطن الصبر عند ورود الفاقات، وتوالي الأزمات، وصيانة الوجه عن ذلك المخلوقات، ولله در القائل:\nولبدتي الأسد: جانبا كتفيْه. ويُقال لأُولي العزم، حين يُؤذون من جهة الخلق: { ولا تستعجل لهم... } الآية. وقوله تعالى: { كأنهم يوم يرون... } الآية، قال القشيري: مُدةُ الخلق من مبتدأ خلقتهم إلى مُنتهى آجالهم، بالإضافة إلى الأزلية، كلحظةٍ، بل هي أقلُّ، إذ الأول لا ابتداء له ولا انتهاء، وأيّ خَطَرٍ لما حصل في لحظةٍ.. خيراً كان أو شرّاً؟ هـ. قال الورتجبي، ثم بيَّن أن عند معاينة سطوات القهريات، لا يهلك فيها إلا الخارجون من نعوت استعداد معرفتي، حين يحتجبون بظلمات نعوتهم بقوله: { فهل يهلك إلا القوم الفاسقون } الخارجون بالدعاوى الباطلة. هـ. وبالله التوفيق، وصلّى الله على سيدنا محمد وآله وصحبه وسلّم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:43",
      "similarity": 0.5155004182979517
    },
    {
      "verse": "47:21",
      "similarity": 0.44338116085063806
    },
    {
      "verse": "2:227",
      "similarity": 0.4379037267610467
    },
    {
      "verse": "31:17",
      "similarity": 0.43327324680057244
    },
    {
      "verse": "3:186",
      "similarity": 0.4099560284112787
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/46:35.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/46:35.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/46:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}