{
  "chapter": "الأحقاف",
  "text": "ومن لا يجب داعى الله فليس بمعجز فى الارض وليس له من دونه اولياء او۟لئك فى ضلل مبين",
  "translations": [
    {
      "translation": "Those who do not respond to Allah's caller cannot thwart Allah on earth and have no protectors apart from Him. Such people are clearly misguided.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does not listen to the summoner of God cannot weaken (the power of) God on earth, nor will he have protectors other than Him. They are clearly in the wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who does not respond to the one who calls to Allah will not be able to frustrate Him on earth, nor will they have anyone to protect them from Allah. Such people are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not favorably respond to the Messenger of God should know that they cannot challenge God on earth and will not have anyone as their guardian besides Him. Such people are in plain error\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And whoever does not listen to Allah’s caller cannot escape in the earth, and he has no supporters against Allah; they are in open error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever does not respond to Allah's Caller, he cannot escape on earth, and he will not have besides Allah any protectors. Those are in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does not accept the-Divine caller, he shall not escape in the earth and he shall not have guardians besides Him, these are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever answers not God's summoner cannot frustrate God in the earth, and he has no protectors apart from Him; those are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso respondeth not to Allah's summoner he can nowise escape in the earth, and he hath no protecting friends instead of Him. Such are in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who does not respond to God's calls can never elude [Him] on earth, nor can he have any protector against Him. Such people have clearly gone far astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever answereth not Allah's summoner, he cannot frustrate His vengeAnce on the earth, and for him there will be, beside Him, no patrons. Those are in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not respond to Allah’s summoner cannot frustrate [Allah] on the earth, and they will not find any protectors besides Him. They are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any does not hearken to the one who invites (us) to Allah, he cannot frustrate (Allah's Plan) on earth, and no protectors can he have besides Allah: such men (wander) in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever does not respond to Allah's Caller, he cannot escape on earth, and there will be no Auliya' (protectors) for him besides Allah (from Allah's Punishment). Those are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not answer the Caller of Allah cannot frustrate Allah in the earth, nor shall any one protect them other than Him; those are in clear error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does not answer the caller to God will not escape on earth, and has no protectors besides Him. Those are in obvious error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who does not respond to the Caller of Allah will not cause failure [to Him] upon earth, and he will not have besides Him any protectors. Those are in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:32] And whoever does not respond to God’s summoner cannot thwart God on earth, that is to say, he will not be able to thwart God by escaping from Him and eluding Him, and he, the one who does not respond, will not have, besides Him, that is, [besides] God, any protectors, any helpers to ward off the chastisement from him — those, who do not respond, are in manifest error’, plain and evident [error].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso respondeth not to Allah's summoner) Muhammad (pbuh) (he can nowise escape) Allah's punishment (in the earth, and he hath no protecting friends) relatives to benefit him (instead of Him) beside Allah. (Such are in error manifest) such are in manifest disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل له الإحاطة والاستيلاء بعموم الأمكنة والأنحاء { وَلَيْسَ لَهُ } أي: للمنكر المعاند { دُونِهِ } سبحانه { أَوْلِيَآءُ } يوالونه وينقذونه من غضب الله وعذابه بعدما نزل عليه\n وبالجملة: { أُوْلَـٰئِكَ } المنكرون المكابرون الذين لا يجيبون داعي الله\n ولا يقبلون منه دعوته عناداً ومكابرة { فِي ضَلاَلٍ مُّبِينٍ } [الأحقاف: 32] وغواية ظاهرة\n يجازيهم سبحانه بمقتضى ما صدر عنهم من الغي والضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وليس له من دونه أولياءُ } ينصرونه من عذاب الله\n وهو بيان لاستحالة نجاته بواسطة\n إثر بيان استحالة نجاته بنفسه\n وجمع \" الأولياء \" مبالغة\n إذا كان لا ينفعه أولياء\n فأولى واحد\n { أولئك } الموصوفون بعدم إجابة داعي الله { في ضلال مبين } أي: ظاهر: بحيث لا تخفى ضلالته على أحد\n حيث أعرضوا عن إجابة مَن هذا شأنه\n وجمع الإشارة باعتبار معنى \" من \" \n وأفرادَ أولاً باعتبار لفظها\n الإشارة: قد استعملت الجن الأدب بين يديه صلى الله عليه وسلم حيث قالوا: أنصتوا\n فالجلوس مع الأكابر يحتاج إلى أدب كبير\n كالصمت\n والوقار\n والهيبة\n والخضوع\n كما كانت حالة الصحابة رضي الله عنهم مع الرسول صلى الله عليه وسلم إذا تكلم أنصتوا كأنما على رؤوسهم الطير\n قال الشيخ أبو الحسن رضي لله عنه: \" إذا جالست الكبراء فدع ما تعرف إلى ما لا تعرف\n لتفوز بالسر المكنون \" فإذا انقضى مجلس التذكير رجع كل واحد منذراً وداعياً إلى الله كلَّ مَن لقيه\n وقد كان صلى الله عليه وسلم يقول لأصحابه:\n \" ليبلغ الشاهد الغائب \" \nفمَن بلغه ذلك واستجاب ربح وغنم\n ومَن لا يجب داعي الله خاب وخسر\n والاستجابة أقسام\n قال القشيري: فمستجيبٌ بنفسه\n ومستجيبٌ بقلبه\n ومستجيبٌ بروحه\n ومستجيبٌ بسرِّه\n ومَن توقف عند دعاء الداعي إليه\n ولم يُبادر إلى الاستجابة هُجِرَ فيما كان يُخَاطب به\n هـ\n قلت: المستجيب بنفسه هو المستجيب بالقيام بوظائف الإسلام\n والمستجيب بقلبه القائم بوظائف الإيمان\n والمستجيب بروحه القائم بوظائف الإحسان\n والمستجيب بسره هو المتمكن من دوام الشهود والعيان\n وقول: هجر فيما يُخاطب به\n أي: كان يُخاطب بملاحظة الإحسان\n فإذا لم يبادر قِيد بسلاسل الامتحان\n والله تعالى أعلم\n ثم بَرْهن على قوله\n فليس بمعجزة في الأرض\n فقال: { أَوَلَمْ يَرَوْاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَاوَاتِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:31",
      "similarity": 0.6627446660961931
    },
    {
      "verse": "29:22",
      "similarity": 0.652168100860412
    },
    {
      "verse": "11:20",
      "similarity": 0.5288712947299923
    },
    {
      "verse": "11:33",
      "similarity": 0.5271032991886757
    },
    {
      "verse": "6:134",
      "similarity": 0.5099848347269019
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/46:32.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/46:32.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}