{
  "chapter": "الأحقاف",
  "text": "ويوم يعرض الذين كفروا۟ على النار اليس هذا بالحق قالوا۟ بلى وربنا قال فذوقوا۟ العذاب بما كنتم تكفرون",
  "translations": [
    {
      "translation": "On the Day when those who were kafir are exposed to the Fire, they will be asked, 'Is this not the truth?' They will say, 'Yes, by our Lord.' He will say, 'Then taste the punishment for having been kafir.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the unbelievers will be stood before the Fire, (they will be asked:) \"Is this not the reality?\" They will answer: \"In truth, by our Lord!\" It will be said: \"Then taste the torment of what you had denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the unbelievers will be brought within sight of the Fire, they will be asked: “Is this not the Truth?” and they will answer “Yes, by Our Lord (this is the Truth).” Allah will say: “Then suffer the chastisement as a requital for your disbelieving.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the disbelievers will be exposed to the fire, they will be asked, \"Is this not real?\" They will say, \"Yes, Our Lord, it is real\" He will say, \"Suffer the torment for your disbelief\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when the disbelievers are presented upon the fire; it will be said, “Is this not a reality?” They will answer, “By oath of our Lord, surely yes, why not?”; it will be said, “Therefore taste the punishment, the recompense of your disbelief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when those who disbelieve will be exposed to the Fire (it will be said to them): \"Is this not the truth\" They will say: \"Yes, by our Lord!\" He will say: \"Then taste the torment, because you used to disbelieve!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when those who disbelieve shall be brought before the fire: Is it not true? They shall say: Aye! by our Lord! He will say: Then taste the punishment, because you disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the unbelievers are exposed to the Fire: 'Is not this the truth?' They shall say, 'Yes, by our Lord!' He shall say, 'Then taste the chastisement of your unbelief!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when those who disbelieve are exposed to the Fire (they will be asked): Is not this real? They will say: Yea, by our Lord. He will say: Then taste the doom for that ye disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when those who deny the truth will be brought before the Fire, they shall be asked, \"Is this not the truth?\" They will reply, \"Yes, by our Lord.\" He will say, \"Then taste the punishment, because of your denial of the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day whereon those who disbelieve will be placed before the Fire: is this not real? They will say: yea, by our Lord. He will say: taste wherefore the torment, for ye have been disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the faithless are exposed to the Fire, [He will say,] ‘Is this not a fact?’ They will say, ‘Yes, by our Lord!’ He will say, ‘So taste the punishment because of what you used to disbelieve.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day that the Unbelievers will be placed before the Fire, (they will be asked,) \"Is this not the Truth?\" they will say, \"Yea, by our Lord!\" (One will say:) \"Then taste ye the Penalty, for that ye were wont to deny (Truth)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when those who disbelieve will be exposed to the Fire (it will be said to them): \"Is this not the truth?\" They will say: \"Yes, By our Lord!\" He will say: \"Then taste the torment, because you used to disbelieve!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the unbelievers are brought before the Fire they shall be asked: 'Is this not the truth' 'Yes, by our Lord' they will answer. He will say:'Then taste the punishment, for you were unbelievers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when those who disbelieved are presented to the Fire: “Is this not real?” They will say, “Yes, indeed, by our Lord.” He will say, “Then taste the suffering for having disbelieved.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will say, \"Then taste the punishment because you used to disbelieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:34] And on the day when those who disbelieve are exposed to the Fire, when they are being chastised in it, it will be said to them: ‘Is not this, chastisement, the truth?’ They will say, ‘Yes, by our Lord!’ He will say, ‘Then taste the chastisement for what you used to disbelieve [in]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on the day when those who disbelieve) in Muhammad (pbuh) and the Qur'an (are exposed to the Fire) 589 before they eventually enter it, ((they will be asked): Is not this) chastisement (real) just? (They will say: Yea, by our Lord) it is just. (He will say: Then taste the doom for that you disbelieved) in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَ } اذكر يا أكمل الرسل لمنكري الحشر { يَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُواْ } بالبعث والجزاء { عَلَىٰ ٱلنَّارِ } المعدة لهم\n فيقال لهم حينئذ تفضيحاً وتهويلاً وتوبيخاً وتقريعاً: { أَلَيْسَ هَـٰذَا } العذاب الذي أنتم فيه الآن\n وكذبتم به من قبل في نشأة الاختبار { بِٱلْحَقِّ قَالُواْ } متأسفين متحسرين: { بَلَىٰ } هو الحق { وَ } حق { رَبِّنَا } الذي ربانا على فطرة الإسلام\n وأنذرنا عن إتيان هذا العذاب في هذه الأيام\n فكفرنا به ظلماً وزوراً\n وأنكرنا عليه عناداً واستكباراً\n وبعدما اعترفوا وندموا في وقت لا ينفعهم الندم والاعتراف { قَالَ } قائل من قبل الحق: { فَذُوقُواْ ٱلْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ } [الأحقاف: 34] إذا لم يفدكم اعترافكم هذا\n بعدما انقضى نشأة التدارك والتلافي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { و } اذكر { يوم يُعرض الذين كفروا على النار } فيقال لهم: { أليس هذا بالحق } فالإشارة إلى ما يُشاهدونه من فظيع العذاب\n وفيه تهكُّم بهم\n وتوبيخ لهم\n على استهزائهم بوعد الله تعالى ووعيده\n ونفيه بقوله: \" وما نحن بمعذبين \" \n { قالوا } في جواب الملائكة: { بلى وربَّنا } إنه لحق\n أكدوا جوابهم بالقسم كأنهم يطمعون في الخلاص بالاعتراف بحقيقتهما كما في الدنيا\n وأنَّى لهم ذلك؟ { قال } تعالى لهم: { فذُوقوا العذابَ بما كنتم تكفرون } بها في الدنيا\n ومعنى الأمر: الإهانة بهم والتوبيخ لهم\n نعوذ بالله من موارد الهوان\n الإشارة: تربية اليقين تطلب في أمرين\n حتى يكونا كرأي العين: وجود الحق أو شهوده\n وإيتان الساعة وقربها\n حتى تكون نُصب العين\n وتقدّم حديث حارثة شاهداً على إيمانه\n حيث قال:\n \" وكأني أنظر إلى أهل الجنة يتزاورون\n\n\n \" \nالحديث\n ثم أمر بالصبر على ما يسمع من الكفرة\n في إمكان البعث وغيره\n فقال: { فَٱصْبِرْ كَمَا صَبَرَ أُوْلُواْ ٱلْعَزْمِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:81",
      "similarity": 0.6031737468093266
    },
    {
      "verse": "84:15",
      "similarity": 0.558380664124008
    },
    {
      "verse": "40:50",
      "similarity": 0.5524588731255488
    },
    {
      "verse": "39:59",
      "similarity": 0.5393932566369966
    },
    {
      "verse": "67:9",
      "similarity": 0.4626696411101849
    }
  ]
}