{
  "chapter": "الأحقاف",
  "text": "اولم يروا۟ ان الله الذى خلق السموت والارض ولم يعى بخلقهن بقدر على ان يحى الموتى بلى انه على كل شىء قدير",
  "translations": [
    {
      "translation": "Do they not see that Allah - He who created the heavens and the earth and was not wearied by creating them - has the power to bring the dead to life? Yes indeed! He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not realise that God who created the heavens and the earth, and did not tire creating them, is able to bring the dead to life? And why not? He has the power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, Who created the heavens and the earth -- and creating them did not wear Him out -- has the power to bring the dead back to life? Why not! He certainly has the power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that God has created the heavens and the earth and that He experienced no fatigue in doing this. He has the power to bring the dead back to life. Certainly He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not realised that Allah, Who did not tire in creating the heavens and the earth and in creating them, is Able to revive the dead? Surely yes, why not? Indeed He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead Yes, He surely is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered that Allah, Who created the heavens and the earth and was not tired by their creation, is able to give life to the dead? Aye! He has surely power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not seen that God who created the heavens and earth, not being wearied by creating them, is able to give life to the dead? Yes indeed; He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead? Aye, He verily is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that God, who created the heavens and the earth and was not wearied by their creation, has the power to bring the dead back to life? Yes, indeed, He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink they not that Allah Who created the heavens and the earth and was not fatigued with the creation thereof, is able to quicken the dead? Aye! verily He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, who created the heavens and the earth and [who] was not exhausted by their creation, is able to revive the dead? Yes, indeed He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that Allah, Who created the heavens and the earth, and never wearied with their creation, is able to give life to the dead? Yea, verily He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead? Yes, He surely is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that it is Allah who created the heavens and the earth and was not wearied by their creation, and that He is Able to restore the dead tolife? Yes, He has power over all things!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not realize that God, who created the heavens and the earth, and was never tired by creating them, is Able to revive the dead? Yes indeed; He is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that Allah, who created the heavens and earth and did not fail in their creation, is able to give life to the dead? Yes. Indeed, He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:33] Have they not seen, [have they not] realised, that is, the deniers of resurrection, that God, Who created the heavens and the earth and [Who] was not wearied by their creation, [Who] did not fail therein, is able to give life to the dead? (bi-qādirin is the predicate of anna, ‘that’, the bi- having been added to it because the statement has the same force as [the construction]: a-laysa’Llāhu bi-qādirin, ‘Is God not able …?’). Yes, indeed, He is able to give life to the dead. Indeed He has is able to do all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not seen) do the disbelievers of Mecca not know (that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead) for the resurrection? (Aye, He verily is Able to do all things) of giving life and inflicting death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ يَعْيَ بِخَلْقِهِنَّ } معناه لم يَجهَلْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He has not been unaware of the creation of {the women}\" means that He has not been ignorant.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى توبيخ منكري الحشر والنشر وإعادة الموتى أحياء وتقريعهم\n فقال مستفهماً على سبيل التبكيت والإلزام: { أَوَلَمْ يَرَوْاْ } يعني: أيشكون ويترددون أولئك الشاكون المترددون في قدرة الله على إعادة المعدوم ونشر الأموات أحياء من قبورهم وحشرهم إلى المحشر للحساب والجزاء\n ولم يعلموا { أَنَّ ٱللَّهَ } العليم الحكيم القادر المقتدر { ٱلَّذِي خَلَقَ } أظهر وأوجد { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: العلويات السفليات خلقاً إبداعياً من كتم العدم { وَ } مع ذلك { لَمْ يَعْيَ بِخَلْقِهِنَّ } أي: لم يفتر ولم يضعف بإظهارهن ابتداء مع غاية عظمتهن وسعتهن { بِقَادِرٍ } يعني: أليس القادر المقتدر على الإبداع والإبداء بقادر { عَلَىٰ أَن يُحْيِـيَ ٱلْمَوْتَىٰ } ويعيدهم أحياء بعدما أماتهم { بَلَىٰ } أنه سبحانه { عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة علمه وإرادته { قَدِيرٌ } [الأحقاف: 33] بلا فتور ولا قصور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ولم يَعْيَ } حال من فاعل \" خلق \" \n يُقال: عَي\n كرضَى\n وَعِيَ بالإدغام\n وهو أكثر\n قاله في الصحاح\n وفي القاموس: عَيَّ بالأمر وعَيِيَ كرَضِيَى\n وتَعايا واسْتَعيا وتَعَيَّا: لم يهتدِ لوجه مُراده\n أو عَجَزَ عنه ولم يُطِقْ إحْكَامه\n هـ\n و { بقادر } خبر \" أن \" \n ودخلت الباء لاشتمال النفي الذي في صدر الآية على \" أنّ \" وما في حيّزها\n قال الزجاج: لو قلت: ما ظنت أنَّ زيداً بقائم\n جاز\n يقول الحق جلّ جلاله: { أَوَ لَمْ يَرَوا } أي: ألم يتكّفروا ولم يعلموا علماً جازماً { أنَّ الله الذي خلق السماوات والأرض } ابتداء من غير مثال يحتويه\n ولا قانون يحتذيه\n { و } الحال أنه { لم يَعْيَ بخلقهن } أي: لم يتعب ولم ينصب بذلك أصلاً\n ولم يعجز عنه\n أليس مَن فعل ذلك { بقادرٍ على أن يحيي الموتى بلى } جواب النفي\n أي: بلى هو قادر على ذلك\n { إِنه على كل شيء قديرٌ } تقرير للقدرة على وجه عام\n ليكون كالبرهان على المقصود\n ثم ذكر عقاب مَن أنكر البعث المبرهن عليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:15",
      "similarity": 0.7987513716538267
    },
    {
      "verse": "36:81",
      "similarity": 0.20280914847552728
    },
    {
      "verse": "40:50",
      "similarity": 0.15363123039151758
    },
    {
      "verse": "67:9",
      "similarity": 0.14320353943566072
    },
    {
      "verse": "84:15",
      "similarity": 0.14293833339388332
    }
  ]
}